{
  "doi": "10.1145/642611.642706",
  "title": "XWand: UI for intelligent spaces",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "545-552",
  "year": 2003,
  "badges": [],
  "abstract": "The XWand is a novel wireless sensor package that enables styles of natural interaction with intelligent environments. For example, a user may point the wand at a device and control it using simple gestures. The XWand system leverages the intelligence of the environment to best determine the user's intention. We detail the hardware device, signal processing algorithms to recover position and orientation, gesture recognition techniques, a multimodal (wand and speech) computational architecture and a preliminary user study examining pointing performance under conditions of tracking availability and audio feedback.",
  "tags": [
    "magnetometer",
    "accelerometer",
    "multimodal interfaces",
    "gesture recognition",
    "sensing",
    "intelligent environments",
    "Bayesian networks"
  ],
  "authors": [
    {
      "name": "Andrew Wilson",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    },
    {
      "name": "Steven Shafer",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339527454",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brummitt, B., and JJ Cadiz. \"Let There Be Light\": Examining Interfaces for Homes of the Future. in Human-Computer Interaction: INTERACT '01. 2001.]]",
      "doi": ""
    },
    {
      "text": "Johnson, M., A. Wilson, C. Kline, B. Blumberg and A. Bobick. Using a Plush Toy to Direct Synthetic Characters. in Proceedings CHI. 1999. Pittsburgh, PA.]]  ",
      "doi": "10.1145/302979.303028"
    },
    {
      "text": "Marrin, T. Possibilities for the Digital Baton as a General-Purpose Gestural Interface. in Proceedings CHI. 1997. Atlanta.]]  ",
      "doi": "10.1145/1120212.1120409"
    },
    {
      "text": "Masui, T., and I. Silo. Real-World Graphical User Interfaces. in HUC. 2000.]] ",
      "doi": "10.5555/647986.743884"
    },
    {
      "text": "Swindells, C., K. Inkpen, J. Dill, and M. Tory. That one there! Gesture for on-demand device identity. in Proceedings UIST. 2002. Paris.]]  ",
      "doi": "10.1145/571985.572007"
    },
    {
      "text": "Priyantha, N.B., A. Chakraborty, H. Balakrishnan. The Cricket Location-Support System. in Proceedings 6th ACM MOBICOM. 2000. Boston, MA.]]  ",
      "doi": "10.1145/345910.345917"
    },
    {
      "text": "Randell, C., and H. Muller. Low Cost Indoor Positioning System. in Proceedings Ubicomp. 2001. Atlanta, Georgia: Springer-Verlag.]] ",
      "doi": "10.5555/647987.741343"
    },
    {
      "text": "Jojic, N., B. Brummitt, B. Meyers, S. Harris, and T. Huang. Estimation of Pointing Parameters in Dense Disparity Maps. in IEEE Intl. Conf. on Automatic Face and Gesture Recognition. 2000. Grenoble, France.]] ",
      "doi": "10.5555/795661.796232"
    },
    {
      "text": "Horn, B.K.P., Robot Vision. 1986, Cambridge, MA: MIT Press.]] ",
      "doi": "10.5555/542459"
    },
    {
      "text": "MacNeil, D., Hand and Mind. 1992: University of Chicago Press.]]",
      "doi": ""
    },
    {
      "text": "Oviatt, S.L., Taming Speech Recognition Errors Within a Multimodal Interface. Communications of the ACM, 2000. 43(9): p. 45--51.]]  ",
      "doi": "10.1145/348941.348979"
    },
    {
      "text": "Pearl, J., Probabilistic Reasoning in Intelligent Systems. 1988, San Mateo, CA: Morgan Kaufmann.]] ",
      "doi": "10.5555/52121"
    },
    {
      "text": "Olsen, D.R.J., T. Nielsen. Laser Pointer Interaction. in Proceedings CHI. 2001. Seattle.]]  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Myers, B.A., R. Bhatnagar, J. Nichols, C. H. Peck, D. Kong, R. Miller, and A. C. Long. Interacting At a Distance: Measuring the Performance of Laser Pointers and Other Devices. in Proceedings CHI. 2002. Minneapolis, Minnesota.]]  ",
      "doi": "10.1145/503376.503383"
    }
  ]
}