{
  "doi": "10.1145/642611.642661",
  "title": "Media inequality in conversation: how people behave differently when interacting with computers and people",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "281-288",
  "year": 2003,
  "badges": [],
  "abstract": "How is interacting with computer programs different from interacting with people? One answer in the literature is that these two types of interactions are similar. The present study challenges this perspective with a laboratory experiment grounded in the principles of Interpersonal Theory, a psychological approach to interpersonal dynamics. Participants had a text-based, structured conversation with a computer that gave scripted conversational responses. The main manipulation was whether participants were told that they were interacting with a computer program or a person in the room next door. Discourse analyses revealed a key difference in participants' behavior -- when participants believed they were talking to a person, they showed many more of the kinds of behaviors associated with establishing the interpersonal nature of a relationship. This finding has important implications for the design of technologies intended to take on social roles or characteristics.",
  "authors": [
    {
      "name": "Nicole Shechtman",
      "institution": "SRI International, Menlo Park, CA and Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100537961",
      "orcid": "missing"
    },
    {
      "name": "Leonard M. Horowitz",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100479679",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berzins, J. I. (1977). Therapist-patient matching. In A. S. Gurman (Ed.), Effective psychotherapy (pp. 221--251). New York: Pergamon.",
      "doi": ""
    },
    {
      "text": "Blatt, S. J. (1990). Interpersonal relatedness and self-definition: Two personality configurations and their implications for psychopathology and psychotherapy. In J. L. Singer (Ed.), Repression and dissociation. Chicago: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Carson, R. (1969). Interaction concepts of personality. Chicago, IL: Aldine Publishing Company.",
      "doi": ""
    },
    {
      "text": "Clark, H. (1996). Using language. Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Dryer, D. C., & Horowitz, L. M. (1997). When do opposites attract? Interpersonal complementarity versus similarity. Journal of Personality & Social Psychology, 72, 592--603.",
      "doi": ""
    },
    {
      "text": "Hobbs, J. R., & Evans, D. A. (1980). Conversation as planned behavior. Cognitive Science, 4, 349--377.",
      "doi": ""
    },
    {
      "text": "Horowitz, L. (in press). An interpersonal approach to psychopathology. Washington D.C.: APA Books.",
      "doi": ""
    },
    {
      "text": "Kiesler, D. (1996). Contemporary interpersonal theory and research. New York: Wiley.",
      "doi": ""
    },
    {
      "text": "Lafferty, J., & Eady, P. (1974). The desert survival problem. Plymouth, MI: Experimental Learning Methods.",
      "doi": ""
    },
    {
      "text": "LaForge, R., & Suczek, R. F. (1955). The interpersonal domain of personality: An interpersonal checklist. Journal of Personality, 24.",
      "doi": ""
    },
    {
      "text": "Leary, T. (1957). Interpersonal diagnosis of personality. New York: Ronald Press Co.",
      "doi": ""
    },
    {
      "text": "Moon, Y. (2000). Intimate exchanges: Using computers to elicit self-disclosure from consumers. Journal of Consumer Research.",
      "doi": ""
    },
    {
      "text": "Morkes, J., Kernal, H. K., & Nass, C. (1999). Effects of humor in task-oriented human-computer interactions and computer-mediated communication: A direct test of SRCT theory. Human-Computer Interaction, 14, 395--435.  ",
      "doi": "10.1207/S15327051HCI1404_2"
    },
    {
      "text": "Nass, C., & Moon, Y. (2000). Machines and mindlessness: Social responses to computers. Journal of Social Issues, 56, 81--103.",
      "doi": "10.1111/0022-4537.00153"
    },
    {
      "text": "Nass, C., Isbister, K., & Lee, E-J. (2000). Truth is beauty: Research conversational agents. In J. Castells (Ed.), Embodied conversational agents . Cambridge, MA: MIT Press. ",
      "doi": "10.5555/371552.371575"
    },
    {
      "text": "Nass, C., Fogg, B. J., & Moon, Y. (1996). Can computers be teammates? International Journal of Human-Computer Studies, 45, 669--678.  ",
      "doi": "10.1006/ijhc.1996.0073"
    },
    {
      "text": "Nass, C., Moon, Y., & Carney, P. (1999). Are people polite to computers? Responses to computer-based interviewing systems. Journal of Applied Social Psychology, 29, 1093--1110.",
      "doi": ""
    },
    {
      "text": "Nass, C., Moon, Y., Fogg, B. J., Reeves, B., & Dryer, D. C. (1995). Can computer personalities be human personalities? International Journal of Human-Computer Studies, 43, 223--239.  ",
      "doi": "10.1006/ijhc.1995.1042"
    },
    {
      "text": "Person, E. (2000). The effect of polite language on the assertive person's reaction to advice. Stanford: Stanford University.",
      "doi": ""
    },
    {
      "text": "Reeves, B., & Nass, C. (1996). The media equation: how people treat computers, televisions, and new media like real people and places. New York: Cambridge University Press. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Sullivan, H. S. (1953). The interpersonal theory of psychiatry. New York: Norton.",
      "doi": ""
    }
  ]
}