{
  "doi": "10.1145/642611.642650",
  "title": "With similar visual angles, larger displays improve spatial performance",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "217-224",
  "year": 2003,
  "badges": [],
  "abstract": "Large wall-sized displays are becoming prevalent. Although researchers have articulated qualitative benefits of group work on large displays, little work has been done to quantify the benefits for individual users. We ran two studies comparing the performance of users working on a large projected wall display to that of users working on a standard desktop monitor. In these studies, we held the visual angle constant by adjusting the viewing distance to each of the displays. Results from the first study indicate that although there was no significant difference in performance on a reading comprehension task, users performed about 26% better on a spatial orientation task done on the large display. Results from the second study suggest that the large display affords a greater sense of presence, allowing users to treat the spatial task as an egocentric rather than an exocentric rotation. We discuss future work to extend our findings and formulate design principles for computer interfaces and physical workspaces.",
  "authors": [
    {
      "name": "Desney S. Tan",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    },
    {
      "name": "Peter Scupelli",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100126432/rel-imgonly/cropped_scupelli.jpg",
      "acmid": "81100126432",
      "orcid": "missing"
    },
    {
      "name": "Randy Pausch",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arthur, K.W. (2000). Effects of field of view on performance with head-mounted displays. Doctoral Dissertation, University of North Carolina, Chapel Hill, NC. ",
      "doi": "10.5555/931187"
    },
    {
      "text": "Baudisch, P., Good, N., Belloti, V., & Schraedley, P. (2002). Keeping things in context: A comparitive evaluation of focus plus context screens, overviews, and zooming. Proceedings of CHI 2002, 259--266.  ",
      "doi": "10.1145/503376.503423"
    },
    {
      "text": "Bystrom, K.E., Barfield, W., & Hendrix, C. (1999). A conceptual model of the sense of presence in virtual environments. Presence: Teleoperators and Virtual Environments, 8(2), 241--244.  ",
      "doi": "10.1162/105474699566107"
    },
    {
      "text": "Carpenter, M., Proffitt, D. (2001). Comparing viewer and array mental rotations in different planes. Memory & Cognition, 29, 441--448.",
      "doi": ""
    },
    {
      "text": "Chapanis, A., Scarpa, L.C. (1967). Readability of dials at difference distances with constant viewing angle. Human Factors, 9(5), 419--426.",
      "doi": ""
    },
    {
      "text": "Childs, I. (1988). HDTV-putting you in the picture. IEE Review, 34(7), 261--265.",
      "doi": ""
    },
    {
      "text": "Chou, P., Gruteser, M., Lai, J., Levas, A., McFaddin, S., Pinhanez, C., Viveros, M., Wong, D., & Yoshihama, S. (2001). BlueSpace: Creating a personalized and context-aware workspace. IBM technical report, RC22281.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Tan, D.S., Robertson, G.G. (2002). Women take a wider view. Proceedings of CHI 2002, 195--202.  ",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Dillion, A. (1992). Reading from paper versus screens: A critical review of the empirical literature. Ergonomics, 35(10), 1297--1326.",
      "doi": ""
    },
    {
      "text": "Dudfield, H.J., Macklin, C., Fearnley, R., Simpson, A., & Hall, P. (2001). Big is better? Human factors issues of large screen displays with military command teams. Proceedings of People in Control 2001, 304--309.",
      "doi": ""
    },
    {
      "text": "Educational Testing Service. (1994). Practicing to take the GRE test. New Jersey: ETS.",
      "doi": ""
    },
    {
      "text": "Elrod, S., Bruce, R., Gold, R., Goldberg, D., Halasz, F., Janssen, W., Lee, D., McCall, K., Pederson, E., Pier, K., Tang, J., & Welch, B. (1992). Liveboard: A large interactive display supporting group meetings, presentations and remote collaboration, Proceedings of CHI 1992, 599--607.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Guilford, J.P., Zimmerman, W.S. (1948). The Guilford-Zimmerman Aptitude Survey. Journal of Applied Psychology, 32, 24--34.",
      "doi": ""
    },
    {
      "text": "Guimbretière, F. (2002). Fluid interaction for high resolution wall-size displays. Doctoral Dissertation, Stanford University, Stanford, CA.",
      "doi": ""
    },
    {
      "text": "Infield, S.E. (1991). An investigation into the relationship between navigation skill and spatial abilities. Doctoral Dissertation, University of Washington, Seattle, WA. Dissertation Abstracts International, 52(5-B), 2800.",
      "doi": ""
    },
    {
      "text": "Lin, J.J., Duh, H.B.L., Parker, D.E., Abi-Rached, H., Furness, T.A. (2002). Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. Proceedings of IEEE Virtual Reality Conference 2002, 164--171. ",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Mills, C.B., Weldon, L.J. (1987). Reading text from computer screens. ACM Computer Surveys, 19(4), 329--357.  ",
      "doi": "10.1145/45075.46162"
    },
    {
      "text": "Patrick, E., Cosgrove, D., Slavkovic, A., Rode, J.A., Verratti, T., & Chiselko, G. (2000). Using a large projection screen as an alternative to head-mounted displays for virtual environments. Proceedings of CHI 2000, 478--485.  ",
      "doi": "10.1145/332040.332479"
    },
    {
      "text": "Prothero, J.D., Hoffman, H.D. (1995). Widening the field of view increases the sense of presence within immersive virtual environments. Human Interface Technology Laboratory Technical Report, University of Washington, Seattle, WA, R-95-4.",
      "doi": ""
    },
    {
      "text": "Raskar, R., Welch, G., Cutts, M., Lake, A., Stesin, L., & Fuchs, H. (1998). The office of the future: A unified approach to image-based modeling and spatially immersive displays. Proceedings of SIGGRAPH 1998, 179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Shepard, R.N., Metzler, J. (1971). Mental rotations of three-dimensional objects. Science, 171(3972), 701--703.",
      "doi": ""
    },
    {
      "text": "Slater, M., Usoh, M. (1993). Presence in Immersive Virtual Environments. Proceedings of the IEEE Conference - Virtual Reality Annual International Symposium, 90--96.",
      "doi": "10.1109/VRAIS.1993.380793"
    },
    {
      "text": "Streitz, N.A., Geißler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P., & Steinmetz, R. (1999). i-LAND: An interactive landscape for creativity and innovation. Proceedings of CHI 1999, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Suzuki, K., Nakata, Y. (1988). Does the size of figures affect the rate of mental rotation? Perception & Psychophysics, 44(1), 76--80.",
      "doi": ""
    },
    {
      "text": "Swaminathan, N., Sato, S. (1997). Interaction design for large displays. Interactions, 4(1), 15--24.  ",
      "doi": "10.1145/242388.242395"
    },
    {
      "text": "Tan, D.S., Stefanucci, J.K., Proffitt, D.R., Pausch, R. (2001). The Infocockpit: Providing Location and Place to Aid Human Memory. Workshop on Perceptive User Interfaces 2001.  ",
      "doi": "10.1145/971478.971526"
    },
    {
      "text": "Tani, M., Masato, H., Kimiya, Y., Koichiro, T., & Futakawa, M. (1994). Courtyard: Integrating shared overview on a large screen and per-user detail on individual screens. Proceedings of CHI 1994, 44--50.  ",
      "doi": "10.1145/191666.191690"
    },
    {
      "text": "Tlauka, M. (2002). Switching imagined viewpoints: The effects of viewing angle and layout size. British Journal of Psychology, 93, 193--201.",
      "doi": ""
    },
    {
      "text": "Wraga, M., Creem, S.H., & Proffitt, D.R. (2000). Updating displays after imagined object and viewer rotations. Journal of Experimental Psychology: Learning, Memory, and Cognition. 26(1), 151--168.",
      "doi": ""
    }
  ]
}