{
  "doi": "10.1145/642611.642626",
  "title": "Comparative effectiveness of augmented reality in object assembly",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "73-80",
  "year": 2003,
  "badges": [],
  "abstract": "Although there has been much speculation about the potential of Augmented Reality (AR), there are very few empirical studies about its effectiveness. This paper describes an experiment that tested the relative effectiveness of AR instructions in an assembly task. Task information was displayed in user's field of view and registered with the workspace as 3D objects to explicitly demonstrate the exact execution of a procedure step. Three instructional media were compared with the AR system: a printed manual, computer assisted instruction (CAI) using a monitor-based display, and CAI utilizing a head-mounted display. Results indicate that overlaying 3D instructions on the actual work pieces reduced the error rate for an assembly task by 82%, particularly diminishing cumulative errors - errors due to previous assembly mistakes. Measurement of mental effort indicated decreased mental effort in the AR condition, suggesting some of the mental calculation of the assembly task is offloaded to the system.",
  "authors": [
    {
      "name": "Arthur Tang",
      "institution": "Michigan State Univeristy, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640678",
      "orcid": "missing"
    },
    {
      "name": "Charles Owen",
      "institution": "Michigan State Univeristy, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408594090",
      "orcid": "missing"
    },
    {
      "name": "Frank Biocca",
      "institution": "Michigan State Univeristy, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100082338",
      "orcid": "missing"
    },
    {
      "name": "Weimin Mou",
      "institution": "Michigan State Univeristy, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100176370",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azuma, R., A Survey of Augmented Reality. Presence: Teleoperators and Virtual Environment, 1997. 6(4): p. 355--385.",
      "doi": ""
    },
    {
      "text": "Barfield, W. and Caudell, T., Basic Concepts in Wearable Computers and Augmented Reality, in Fundamentals of Wearable Computers and Augmented Reality, Barfield, W. and Caudell, T., Editors. 2001, Lawrence Erlbaum Associates, Publishers: Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Feiner, S., MacIntyre, B., and Seligmann, D., Knowledge-based Augmented Reality. Communications of the ACM, 1993. 36(7): p. 52--62.  ",
      "doi": "10.1145/159544.159587"
    },
    {
      "text": "Caudell, T.P. and Mizell, D.W. Augmented Reality: An Application of Heads-Up Display Technology to Manual Manufacturing Processes., in International Conference on System Sciences, 1992, Kauai, Hawaii.",
      "doi": ""
    },
    {
      "text": "Bajura, M., Fuchs, H., and Ohbuchi, R., Merging Virtual Reality with the Real World: Seeing Ultrasound Imagery Within the Patient. IEEE Computer Graphics, 1992. 26(2): p. 203--210.  ",
      "doi": "10.1145/142920.134061"
    },
    {
      "text": "Klinker, G., Stricker, D., and Reiners, D., Augmented Reality for Exterior Construction Applications, in Fundamentals of Wearable Computers and Augmented Reality, Barfield, W. and Caudell, T., Editors. 2001, Lawrence Erlbaum Associates, Publishers: Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Webster, A., Feiner, S., MacIntyre, B., Massie, W., and Krueger, T. Augmented Reality in Architectural Construction, Inspection and Renovation, in ASCE Third Congress on Computing in Civil Engineering, 1996, Anaheim, CA.",
      "doi": ""
    },
    {
      "text": "Ohshima, T., Satoh, K., Yamamoto, H., and Tamura, H., AR2 Hockey system: A collaborative mixed reality system. Transactions of the Virtual Reality Society of Japan, 1998. 3(2): p. 55--60.",
      "doi": ""
    },
    {
      "text": "Jebara, T., Eyster, C., Weaver, J., Starner, T., and Pentland, A. Stochasticks: Augmenting the Billiards Experience with Probablistic Vision and Wearable Computers, in International Symposium on Wearable Computers, 1997, Cambridge, MA. ",
      "doi": "10.5555/851036.856456"
    },
    {
      "text": "Biocca, F. Human-bandwidth and the design of Internet 2 interfaces: Human factors and psychosocial challenges, in Internet2 Socialtechnical Summit, 2000, Ann Arbor, MI.",
      "doi": ""
    },
    {
      "text": "Biocca, F., Tang, A., and Lamas, D. Evolution of the mobile infosphere: Iterative design of a high-information bandwidth, mobile augmented reality interface., in Euroimage 2001: International Conference on Augmented, Virtual Environments and 3D Imaging, 2001, Mykonos, Greece.",
      "doi": ""
    },
    {
      "text": "Haines, R., Fischer, E., and Price, T., Head-up transition behavior of pilots with and without head-up display in simulated low-visibility approaches. 1980.Technical Report: NASA Ames Research Center, Moffett Field.",
      "doi": ""
    },
    {
      "text": "Neumann, U. and Majoros, A. Cognitive, Performance, and Systems Issues for Augmented Reality Applications in Manufacturing and Maintenance, in IEEE VRAIS '98, 1998, Atlanta, GA. ",
      "doi": "10.5555/522258.836112"
    },
    {
      "text": "Kirsh, D., The intelligent use of space. Artificial Intelligence, 1995. 73(1): p. 31--68.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Biocca, F., Tang, A., Lamas, D., Gregg, J., Brady, R., and Gai, P., How do users organize virtual tools around their body in immersive virtual and augmented environment?: An exploratory study of egocentric spatial mapping of virtual tools in the mobile infosphere. 2001.Technical Report: Media Interface and Network Design Labs, Michigan State University, East Lansing.",
      "doi": ""
    },
    {
      "text": "Gaulin, S., Evolution of sex differences in spatial ability. Yearbook of Physical Anthropology, 1992. 35: p. 125--151.",
      "doi": ""
    },
    {
      "text": "Owen, C., The ImageTclAR Augmented Reality Development Environment. \"http://metlab.cse.msu.edu/imagetclar/\". 2001.",
      "doi": ""
    },
    {
      "text": "Tuceryan, M. and Navab, N. Single point active alignment method (SPAAM) for optical see-through HMD calibration for AR, in IEEE and ACM International Symposium for Augmented Reality, 2000, Munich, Germany.",
      "doi": ""
    },
    {
      "text": "Hart, S.G. Background Description and Application of the NASA Task Load Index (TLX), in Department of Defense Human Engineering Technical Advisory Group Workshop on Workload, 1987, Newport, RI.",
      "doi": ""
    },
    {
      "text": "Inzuka, Y., Osumi, Y., and Shinkai, K. Visibility of head up display for automobiles., in 35th Annual Meeting of the Human Factors Society, 1991.",
      "doi": ""
    },
    {
      "text": "Sojourner, R. and Antin, J., The effects of a simulated head-up display speedometer on perceptual task performance. Human Factors, 1990. 32(3): p. 329--339. ",
      "doi": "10.1177/001872089003200306"
    },
    {
      "text": "Neisser, U. and Becklen, R., Selective looking: Attention to visually specified events. Cognitive Psychology, 1975. 7: p. 480--494.",
      "doi": ""
    },
    {
      "text": "McCann, R.S., Foyle, D.C., and Johnston, J.C. Attentional limitations with head-up displays, in Seventh International Symposium on Aviation Psychology, 1993, Columbus, OH.",
      "doi": ""
    },
    {
      "text": "Becklen, R. and Cervone, D., Selective looking and the notice of unexpected events. Memory & Cognition, 1983. 11: p. 601--608.",
      "doi": ""
    },
    {
      "text": "Fisher, E., Haines, R., and Price, T., Cognitive issues in head-up displays. 1980.Technical Report: NASA Ames Research Center, Moffett Field.",
      "doi": ""
    },
    {
      "text": "Larish, I. and Wickens, C. Attention and HUDs: Flying in the dark?, in Society for Information Display International Symposium Digest of Technical Papers XXII, 1991.",
      "doi": ""
    },
    {
      "text": "Weintraub, D.R., Haines, R., and Randle, R. Head-up display (HUD) utility II: Runway to HUD transitions monitoring eye focus and decision times, in Human Factors Society 29th annual meeting, 1985.",
      "doi": ""
    },
    {
      "text": "Dopping-Hepenstal, L.L., Head-up displays: The integrity of flight information. IEE Proceedings Part F, Communication, Radar and Signal Processing, 1981. 128(7): p. 440--442.",
      "doi": ""
    },
    {
      "text": "Yeh, M. and Wickens, C.D., Attention and Trust Biases in the Design of Augmented Reality Displays. 2000.Technical Report: Aviation Research Lab, University of Illinois, Urbana-Champaign, Savoy, IL.",
      "doi": ""
    }
  ]
}