{
  "doi": "10.1145/642611.642678",
  "title": "Reflowing digital ink annotations",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "385-393",
  "year": 2003,
  "badges": [],
  "abstract": "Annotating paper documents with a pen is a familiar and indispensable activity across a wide variety of work and educational settings. Recent developments in pen-based computing promise to bring this experience to digital documents. However, digital documents are more flexible than their paper counterparts. When a digital document is edited, or displayed on different devices, its layout adapts to the new situation. Freeform digital ink annotations made on such a document must likewise adapt, or \"reflow.\" But their unconstrained nature yields only vague guidelines for how these annotations should be transformed. Few systems have considered this issue, and still fewer have addressed it from a user's point of view. This paper reports the results of a study of user expectations for reflowing digital ink annotations. We explore user reaction to reflow in common cases, how sensitive users are to reflow errors, and how important it is that personal style survive reflow. Our findings can help designers and system builders support freeform annotation more effectively.",
  "tags": [
    "context",
    "reflow",
    "digital ink",
    "handwriting recognition",
    "annotation system design",
    "annotation",
    "documents"
  ],
  "authors": [
    {
      "name": "David Bargeron",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100187010",
      "orcid": "missing"
    },
    {
      "name": "Tomer Moscovich",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100624219",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "aha! InkWriter Handbook. Microsoft Corp, aha! Software, Mountain View, CA, 1993",
      "doi": ""
    },
    {
      "text": "Arvo, J., and K. Novins. Fluid sketches: Continuous recognition and morphing of simple hand-drawn shapes. In Proceedings of UIST 2000. p. 73--80. ACM Press, 2000.  ",
      "doi": "10.1145/354401.354413"
    },
    {
      "text": "Brush, A.J., Bargeron, D., Gupta, A., and Cadiz, J.J., Robust Annotation Positioning in Digital Documents. In Proceedings of CHI 2001. p. 285--292. ACM Press, 2001.  ",
      "doi": "10.1145/365024.365117"
    },
    {
      "text": "Finkelstein A., and Salesin, D., Multiresolution Curves, Computer Graphics (SIGGRAPH '94 Proceedings), 28(3), p. 261--268.  ",
      "doi": "10.1145/192161.192223"
    },
    {
      "text": "Golovchinsky, G. L. Denoue. Moving Markup: Repositioning Freeform Annotations. In Proceedings of UIST 2002. ACM Press, 2002.  ",
      "doi": "10.1145/571985.571989"
    },
    {
      "text": "Gross, M.D., and Do, E.Y., \"Ambiguous Intentions: A Paper-like Interface for Creative Design. In Proceedings of UIST 1996. p. 183--192. ACM Press, 1996.  ",
      "doi": "10.1145/237091.237119"
    },
    {
      "text": "Hertzmann, A., N. Oliver, B. Curless, and S.M. Seitz. Curve Analogies. 13th Eurographics Workshop on Rendering, Pisa, Italy, June 26--28, 2002. ",
      "doi": "10.5555/581896.581926"
    },
    {
      "text": "Hong, J.I. and J.A. Landay, SATIN: A Toolkit for Informal Ink-based Applications. CHI Letters: Proceedings of User Interfaces and Software Technology: UIST 2000. 2(2):p. 63--72. ACM Press, 2000.  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "Igarashi, T., S. Matsuoka, and H. Tanaka. Teddy: A sketching interface for 3D freeform design. In SIGGRAPH 99 Conference Proceedings, p. 409--416. ACM SIGGRAPH, August 1999.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Landay, J.A. and B.A. Myers, Sketching Interfaces: Toward More Human Interface Design. IEEE Computer, 2001. 34(3): p. 56--64.  ",
      "doi": "10.1109/2.910894"
    },
    {
      "text": "Lin, J., Newman, M.W., Hong, J.I., and Landay, J.A, DENIM: Finding a Tighter Fit Between Tools and Practice for Web Site Design. CHI Letters: Human Factors in Computing Systems: CHI '99, 1999, p. 576--583.",
      "doi": ""
    },
    {
      "text": "Marshall, C.C., and Brush, A.J. From Personal to Shared Annotations. In Proceedings of CHI 2002. p. 812-813. ACM Press, 2002.  ",
      "doi": "10.1145/506443.506610"
    },
    {
      "text": "Phelps, T.A., and Wilensky, R. Robust Intra-document Locations. In Proceedings of WWW9 World Wide Web Conference. Amsterdam, The Netherlands, May 2000. ",
      "doi": "10.5555/347319.346265"
    },
    {
      "text": "Plamondon, R., and S.N. Srihari. On-Line and Off-Line Handwriting Recognition: A Comprehensive Survey. IEEE Transactions on Pattern Analysis and Machine Intelligence. 22(1), January 2000, p. 63--84.  ",
      "doi": "10.1109/34.824821"
    },
    {
      "text": "Rubine, D. Specifying Gestures by Example, Computer Graphics, 25(4), 1991, p. 329--337.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "Schilit, B.N., G. Golovchinsky, and M.N. Price. Beyond paper: supporting active reading with free-form digital ink annotations. In Proceedings of CHI '98. p. 249--256. ACM Press, 1998.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Zanibbi, R. K. Novins, J. Arvo, and K. Zanibbi. Aiding Manipulation of Handwritten Mathematical Expressions through Style-Prserving Morphs. In Proceedings of Graphics Interface. P. 127--134. 2001. ",
      "doi": "10.5555/780986.781002"
    },
    {
      "text": "Zeleznik, R.C., and K.P. Herndon, and J.F. Hughes. SKETCH: An interface for sketching 3D scenes. In SIGGRAPH 96 Conference Proceedings, p. 163--170. ACM SIGGRAPH, August 1996.  ",
      "doi": "10.1145/237170.237238"
    }
  ]
}