{
  "doi": "10.1145/642611.642714",
  "title": "Recommending collaboration with social networks: a comparative evaluation",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "593-600",
  "year": 2003,
  "badges": [],
  "abstract": "Studies of information seeking and workplace collaboration often find that social relationships are a strong factor in determining who collaborates with whom. Social networks provide one means of visualizing existing and potential interaction in organizational settings. Groupware designers are using social networks to make systems more sensitive to social situations and guide users toward effective collaborations. Yet, the implications of embedding social networks in systems have not been systematically studied. This paper details an evaluation of two different social networks used in a system to recommend individuals for possible collaboration. The system matches people looking for expertise with individuals likely to have expertise. The effectiveness of social networks for matching individuals is evaluated and compared. One finding is that social networks embedded into systems do not match individuals' perceptions of their personal social network. This finding and others raise issues for the use of social networks in groupware. Based on the evaluation results, several design considerations are discussed.",
  "tags": [
    "information seeking",
    "expertise locating",
    "social networks",
    "recommender systems"
  ],
  "authors": [
    {
      "name": "David W. McDonald",
      "institution": "University of Washington, Seattle, Seattle, WA",
      "img": "/do/10.1145/contrib-81406596787/rel-imgonly/mcdonald-square-kenya-2019.jpg",
      "acmid": "81406596787",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S., Augmenting the Organizational Memory: A Field Study of Answer Garden. in ACM Conference on Computer-Supported Cooperative Work (CSCW '94), (1994), 243--252.  ",
      "doi": "10.1145/192844.193019"
    },
    {
      "text": "Allen, T.J. Managing the Flow of Technology. MIT Press, Cambridge, 1977.",
      "doi": ""
    },
    {
      "text": "Berkowitz, S.D. An Introduction to Structural Analysis: The Network Approach to Social Research. Butterworths, Toronto, 1982.",
      "doi": ""
    },
    {
      "text": "Boster, J.S. The Successive Pile Sort. Cultural Anthropology Methods, 6 (2). (1994) 7--8.",
      "doi": ""
    },
    {
      "text": "Chin, G., Myers, J. and Hoyt, D. Social Networks in the Virtual Science Laboratory. Communications of the ACM, 45 (8). (2002) 87--92.  ",
      "doi": "10.1145/545151.545156"
    },
    {
      "text": "Ehrlich, K. and Cash, D. The Invisible World of Intermediaries: A Cautionary Tale. Computer Supported Cooperative Work: The Journal of Collaborative Computing, 8 (1/2). (1999) 147--167.  ",
      "doi": "10.1023/A%3A1008696415354"
    },
    {
      "text": "Eveland, J.D., Blanchard, A., Brown, W. and Mattocks, J., The Role of \"Help Networks\" in Facilitating Use of CSCW Tools. in Proceedings of the ACM 1994 Conference on Computer-Supported Cooperative Work, (Chapel Hill, NC, 1994), 265--274.  ",
      "doi": "10.1145/192844.193025"
    },
    {
      "text": "Foner, L.N., Yenta: A Multi-Agent, Referral-Based Matchmaking System. in First International Conference on Autonomous Agents (Agent'97), (1997).  ",
      "doi": "10.1145/267658.267732"
    },
    {
      "text": "Granovetter, M. The Strength of Weak Ties: A Network Theory Revisited. Sociological Theory, 1 (1). (1983) 201--233.",
      "doi": ""
    },
    {
      "text": "Kautz, H.A., Selman, B. and Shah, M. Referral Web: Combining Social Networks and Collaborative Filtering. Communications of the ACM, 40 (3). (1997) 63--65.  ",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Kraut, R.E., Egido, C. and Galegher, J. Patterns of Contact and Communication in Scientific Research Collaboration. in Galegher, J. and Kraut, R.E. eds. Intellectual Teamwork: Social and Technological Foundations of Cooperative Work, Lawrence Erlbaum, Hillsdale, NJ, 1990, 149--172. ",
      "doi": "10.5555/117848.117854"
    },
    {
      "text": "Lutters, W.G., Ackerman, M.S., Boster, J.S. and McDonald, D.W., Mapping Knowledge Networks in Organizations: Creating a Knowledge Mapping Instrument. in Americas Conference on Information Systems, AMCIS'00, (Long Beach, CA, 2000), AIS, 2014--2018.",
      "doi": ""
    },
    {
      "text": "Maybury, M., D'Amore, R. and House, D. Awareness of Organizational Expertise, The MITRE Corporation, MacLean, VA, 2000.",
      "doi": ""
    },
    {
      "text": "McDonald, D.W., Evaluating Expertise Recommendations. in ACM 2001 International Conference on Supporting Group Work (GROUP'01), (2001) 214--223.  ",
      "doi": "10.1145/500286.500319"
    },
    {
      "text": "McDonald, D.W. and Ackerman, M.S., Expertise Recommender: A Flexible Recommendation System and Architecture. in The ACM 2000 Conference on Computer-Supported Cooperative Work (CSCW'00), (Philadelphia, PA, 2000), 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "McDonald, D.W. and Ackerman, M.S., Just Talk to Me: A Field Study of Expertise Location. in The 1998 ACM Conference on Computer-Supported Cooperative Work (CSCW'98), (Seattle, WA, 1998), 315--324.  ",
      "doi": "10.1145/289444.289506"
    },
    {
      "text": "Nardi, B.A., Whittaker, S., Isaacs, E., Creech, M., Johnson, J. and Hainsworth, J. Integrating Communication and Information Through ContactMap. Communications of the ACM, 45 (4). (2002) 89--95.  ",
      "doi": "10.1145/505248.505251"
    },
    {
      "text": "Nardi, B.A., Whittaker, S. and Schwarz, H. NetWORKers and their Activity in Intensional Networks. Computer Supported Cooperative Work: The Journal of Collaborative Computing, 11 (1--2). (2002) 205--242.  ",
      "doi": "10.1023/A%3A1015241914483"
    },
    {
      "text": "O'Day, V.L. and Jeffries, R., Orienteering in an Information Landscape: How Information Seekers Get From Here to There. in Interchi'93, (1993), 438--445.  ",
      "doi": "10.1145/169059.169365"
    },
    {
      "text": "Ogata, H., Yano, Y., Furugori, N. and Jin, Q. Computer Supported Social Networking for Augmenting Cooperation. Computer Supported Cooperative Work: The Journal of Collaborative Computing, 10. (2001) 189--209.  ",
      "doi": "10.1023/A%3A1011216431296"
    },
    {
      "text": "Pickering, J.M. and King, J.L., Hardwiring Weak Ties: Individual and Institutional Issues in Computer Mediated Communication. in The 1992 ACM Conference on Computer-Supported Cooperative Work (CSCW '92), (1992), 356--361.  ",
      "doi": "10.1145/143457.143547"
    },
    {
      "text": "Sack, W., Conversation Map: A Content-Based Usenet Newsgroup Browser. in The 2000 International Conference on Intelligent User Interfaces (IUI 2000), (New Orleans, LA, 2000), ACM Press, 233--240.  ",
      "doi": "10.1145/325737.325856"
    },
    {
      "text": "Scott, J. Social Network Analysis. SAGE, Thousand Oaks, CA, 1991.",
      "doi": ""
    },
    {
      "text": "Smith, M.A., Cadiz, J. and Burkhalter, B., Conversation Trees and Threaded Chats. in The ACM 2000 Conference on Computer-Supported Cooperative Work (CSCW'00), (Philadelphia, PA, 2000), 97--105.  ",
      "doi": "10.1145/358916.358980"
    },
    {
      "text": "Smith, M.A. and Fiore, A.T., Visualization Componentes for Persistent Conversations. in The ACM Conference on Human Factors in Computing Systems (CHI'01), (2001), 136--143.  ",
      "doi": "10.1145/365024.365073"
    },
    {
      "text": "Streeter, L.A. and Lochbaum, K.E., Who Knows: A System Based on Automatic Representation of Semantic Structure. in RIAO '88, (1988), 380--388.",
      "doi": ""
    },
    {
      "text": "Vivacqua, A. and Lieberman, H., Agents to Assist in Finding Help. in ACM Conference on Human Factors in Computing Systems (CHI 2000), (2000), 65--72.  ",
      "doi": "10.1145/332040.332408"
    },
    {
      "text": "Wasserman, S. and Faust, K. Social Network Analysis: Methods and Applications. Cambridge University Press, Cambridge, UK, 1994.",
      "doi": ""
    },
    {
      "text": "Weller, S.C. and Romney, A.K. Systematic Data Collec-tion. Sage Publications, Newbury Park, 1988.",
      "doi": ""
    },
    {
      "text": "Wellman, B. and Berkowitz, S.D. (eds.). Social Structures: A Network Approach. Cambridge University Press, Cambridge, 1988.",
      "doi": ""
    }
  ]
}