{
  "doi": "10.1145/642611.642682",
  "title": "How do people manage their digital photographs?",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "409-416",
  "year": 2003,
  "badges": [],
  "abstract": "In this paper we present and discuss the findings of a study that investigated how people manage their collections of digital photographs. The six-month, 13-participant study included interviews, questionnaires, and analysis of usage statistics gathered from an instrumented digital photograph management tool called Shoebox. Alongside simple browsing features such as folders, thumbnails and timelines, Shoebox has some advanced multimedia features: content-based image retrieval and speech recognition applied to voice annotations. Our results suggest that participants found their digital photos much easier to manage than their non-digital ones, but that this advantage was almost entirely due to the simple browsing features. The advanced features were not used very often and their perceived utility was low. These results should help to inform the design of improved tools for managing personal digital photographs.",
  "tags": [
    "content-based image retrieval",
    "annotation",
    "image browsing",
    "digital photography",
    "personal photography"
  ],
  "authors": [
    {
      "name": "Kerry Rodden",
      "institution": "University of Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100347361",
      "orcid": "missing"
    },
    {
      "name": "Kenneth R. Wood",
      "institution": "Microsoft Research, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344500170",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balabanovic, M., Chu, L.L., and Wolff, G.J. Storytelling with digital photographs. In Proceedings of CHI 2000, 564--571. ACM, 2000.  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Bederson, B.B. PhotoMesa: A zoomable image browser using quantum treemaps and bubblemaps. In Proceedings of UIST 2001, 71--80. ACM, 2001.  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Brown, M.G., Foote, J.T., Jones, G.J.F., Spärck Jones, K., and Young, S.J. Open-vocabulary speech indexing for voice and video mail retrieval. In Proceedings of ACM Multimedia '96, 307--316. ACM, 1996.  ",
      "doi": "10.1145/244130.244232"
    },
    {
      "text": "Graham, A., Garcia-Molina, H., Paepcke, A., and Winograd, T. Time as essence for photo browsing through personal digital libraries. In Proceedings of JCDL 2002, 326--335. ACM, 2002.  ",
      "doi": "10.1145/544220.544301"
    },
    {
      "text": "Holland, P. 'Sweet it is to scan..': Personal photographs and popular photography. In L. Wells, editor, Photography: A Critical Introduction, chapter 3, 103--150. Routledge, London, 1997.",
      "doi": ""
    },
    {
      "text": "Kuchinsky, A., Pering, C., Creech, M.L., Freeze, D., Serra, B., and Gwizdka, J. FotoFile: A consumer multimedia organization and retrieval system. In Proceedings of CHI'99, 496--503. ACM, 1999.  ",
      "doi": "10.1145/302979.303143"
    },
    {
      "text": "Lansdale, M., and Edmonds, E. Using memory for events in the design of personal filing systems. International Journal of Man-Machine Studies, 36(1):97--126, 1992.  ",
      "doi": "10.1016/0020-7373%2892%2990054-O"
    },
    {
      "text": "Mäkelä, A., Giller, V., Tscheligi, M., and Sefelin, R. Joking, storytelling, artsharing, expressing affection: A field trial of how children and their social network communicate with digital images in leisure time. In Proceedings of CHI 2000, 548--555. ACM, 2000.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "Markkula, M., and Sormunen, E. End-user searching challenges indexing practices in the digital newspaper photo archive. Information Retrieval, 1(4):259--285, 2000.  ",
      "doi": "10.1023/A%3A1009995816485"
    },
    {
      "text": "Mills, T.J., Pye, D., Hollinghurst, N.J., and Wood, K.R. AT&TV: broadcast television and radio retrieval. In Proceedings of RIAO 2000, 2000.",
      "doi": ""
    },
    {
      "text": "Mills, T.J., Pye, D., Sinclair, D., and Wood, K.R. Shoebox: A digital photo management system. Technical Report 2000.10, AT&T Laboratories Cambridge, 2000.",
      "doi": ""
    },
    {
      "text": "Platt, J.C. AutoAlbum: Clustering digital photographs using probabilistic model merging. In Proceedings of the IEEE Workshop on Content-Based Access of Image and Video Libraries, 96--100. IEEE, 2000. ",
      "doi": "10.5555/791222.791947"
    },
    {
      "text": "Platt, J.C., Czerwinski, M., and Field, B.A. PhotoTOC: Automatic clustering for browsing personal photographs. Technical Report MSR-TR-2002-17, Microsoft Research, 2002.",
      "doi": ""
    },
    {
      "text": "Rodden, K. How do people organise their photographs? In Proceedings of the BCS IRSG Colloquium, Electronic Workshops in Computing, http://www.ewic.org.uk, 1999. ",
      "doi": "10.5555/2228015.2228027"
    },
    {
      "text": "Rodden, K. Evaluating Similarity-Based Visualisations as Interfaces for Image Browsing. PhD thesis, Technical Report 543, University of Cambridge Computer Laboratory, 2001.",
      "doi": ""
    },
    {
      "text": "Rodden, K., Basalaj, W., Sinclair, D., and Wood, K. Does organisation by similarity assist image browsing? In Proceedings of CHI 2001, 190--197. ACM, 2001.  ",
      "doi": "10.1145/365024.365097"
    },
    {
      "text": "Shneiderman, B., and Kang. H. Direct annotation: A drag-and-drop strategy for labeling photos. In Proceedings of the International Conference on Information Visualisation, 88--95. IEEE, 2000. ",
      "doi": "10.5555/518910.850488"
    },
    {
      "text": "Whittaker, S., and Sidner, C. Email overload: exploring personal information management of email. In Proceedings of CHI'96, 276--283. ACM, 1996.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}