{
  "doi": "10.1145/642611.642634",
  "title": "Shiny happy people building trust?: photos on e-commerce websites and consumer trust",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "121-128",
  "year": 2003,
  "badges": [],
  "abstract": "Designing for trust in technology-mediated interaction is an increasing concern in CHI. In advertising, images of people have long been used to create positive attitudes to products or trust in brands. However, the evidence as to whether placing photographs of people on e-commerce web sites has the intended effect has been mixed. This paper reports a study that examined the effect of adding such photographs to 12 existing e-commerce sites, whose reputation had been established through customer ratings. In an experiment with 115 participants, trust was measured using methods that induced financial risk, adapted from experimental economics. Averaging across sites, neither the presence of a photo, nor trustworthiness of the person depicted, had a significant effect. However, the presence of photos reduced participants' ability to identify vendors with good and bad reputations -- the perceived trustworthiness of poorly performing vendors was increased, whereas that of vendors with good reputation was decreased. This result advocates caution when using photos on e-commerce sites to boost trustworthiness, and demonstrates the need for further research into interpersonal cues and on-line trust.",
  "tags": [
    "experimental economics",
    "interpersonal cues",
    "trust",
    "photos"
  ],
  "authors": [
    {
      "name": "Jens Riegelsberger",
      "institution": "University College London/UCL, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100305214",
      "orcid": "missing"
    },
    {
      "name": "M. Angela Sasse",
      "institution": "University College London/UCL, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499004",
      "orcid": "missing"
    },
    {
      "name": "John D. McCarthy",
      "institution": "University College London/UCL, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100383349",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aaker, D. A., Building Strong Brands. New York: The Free Press, 1996.",
      "doi": ""
    },
    {
      "text": "Brynjolfsson, E. and Smith, M., Frictionless Commerce? A Comparison of Internet and Conventional Retailers. Management Science. 46(4), 2000, pp. 563--585.  ",
      "doi": "10.5555/2774904.2774913"
    },
    {
      "text": "Corritore, C. L., Kracher, B., and Wiedenbeck, S., Trust in the online environment. In M. J.Smith, G. Salvendy, D. Harris, and R. J. Koubek, R. J. (eds.). Evaluation and Interface Design: Cognitive Engineering, Intelligent Agents and Virtual Reality. Mahwah: Lawrence Erlbaum, 2001, pp. 1548--1552.",
      "doi": ""
    },
    {
      "text": "Dasgupta, P., Trust as a Commodity. In D. Gambetta (ed.). Trust. Making and Breaking Cooperative Relations. Oxford: Basil Blackwell, 1988, pp. 49--71.",
      "doi": ""
    },
    {
      "text": "Diekmann, A. and Lindenberg, S., Sociological aspects of cooperation. In N.J. Smelser, and P.B. Baltes (eds.). International Encyclopedia of the Social & Behavioral Sciences. New York: Elsevier Science, 2001.",
      "doi": ""
    },
    {
      "text": "Egger, F. N., Affective Design of E-Commerce User Interfaces: How to maximise perceived trustworthiness. Conference on Affective Human Factors Design. Singapore, June 27-29, 2001, pp. 317--324.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Persuasive Technology: Using Computers To Change What We Think and Do. San Francisco: Morgan Kaufman, 2002. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Giddens, A., The consequences of modernity. Stanford: Stanford University Press, 1990.",
      "doi": ""
    },
    {
      "text": "Glaeser, E. L., Laibson, D., Scheinkman, J. A., and Soutter, C. L., Measuring Trust. Quarterly Journal of Economics. Vol.65, 2000, pp. 811--846.",
      "doi": ""
    },
    {
      "text": "Goffman, E., The Presentation of Self in Everyday Life Garden City: Doubleday, 1959.",
      "doi": ""
    },
    {
      "text": "Huck, S. and Weizsaecker, G., Do players correctly estimate what others do? Journal of Economic Behaviour & Organization, 47(1), 2002, pp. 71--85.",
      "doi": ""
    },
    {
      "text": "Jarvenpaa, S. L. and Tractinsky, N., Consumer Trust in an Internet Store: A Cross-Cultural Validation. Journal of Computer Mediated Communication, 5(2), 1999.",
      "doi": ""
    },
    {
      "text": "Kammerer, M., Die Bestimmung von Vertrauen in Internetangebote. Lizenziatsarbeit der Philosophischen Fakultaet der Universitaet Zuerich, 2000.",
      "doi": ""
    },
    {
      "text": "Kroeber-Riel, W., Bildkommunikation. Imagerysysteme fuer die Werbung. Munich: Vahlen, 1996.",
      "doi": ""
    },
    {
      "text": "Lahno, B. Institutional Trust: A Less Demanding Form of Trust? Revista Latinoamericana de Estudios Avanzados (RELEA). Vol.16, 2002.",
      "doi": ""
    },
    {
      "text": "Luhmann, N. (1979). Trust and Power. Cichester: Wiley.",
      "doi": ""
    },
    {
      "text": "Mitra, A., Trust, Authenticity and Discursive Power in Cyberspace, Communications of the ACM, 45(3), 2002, pp. 27--29.  ",
      "doi": "10.1145/504729.504748"
    },
    {
      "text": "Nielsen, J., Trust or Bust: Communicating Trustworthiness in Web Design. http://www.useit.com/ alertbox/990307.html. 1999.",
      "doi": ""
    },
    {
      "text": "Olson, J. S., Zheng, J., Bos, N., Olson, G. M., and Veinott, E., Trust without Touch: Jumpstarting long-distance trust with initial social activities. Proceedings of CHI2002, Minneapolis, MN, US, April 20--25, 2002, pp.141--146.  ",
      "doi": "10.1145/503376.503402"
    },
    {
      "text": "Riegelsberger, J. and Sasse, M. A., Trustbuilders and Trustbusters: The role of trust cues in interfaces to ecommerce applications. Proccedings of IFIP/I3E: E-commerce, E-business, and E-government. Zurich, Switzerland, October 3--5, 2001. pp 17--30. ",
      "doi": "10.5555/647853.760819"
    },
    {
      "text": "Riegelsberger, J. and Sasse, M. A., Face it: Photographs Don't Make Websites Trustworthy. In Proceedings of CHI2002: Extended Abstracts. Minneapolis, MN, US, April 20--25, 2002, pp. 742--743.  ",
      "doi": "10.1145/506443.506575"
    },
    {
      "text": "Riegelsberger, J., Sasse, M. A., and McCarthy, J. D., The Researcher's Dilemma: Evaluating Trust in Computer- Mediated Communication. International Journal of Human Computer Studies. Special Issue on Trust, 2003.  ",
      "doi": "10.1016/S1071-5819%2803%2900042-9"
    },
    {
      "text": "Sapient & Cheskin. eCommerce Trust, 1999.",
      "doi": ""
    },
    {
      "text": "Steinbrueck, U., Schaumburg, H., Duda, S., and Krueger, T., A, Picture Says More Than A Thousand Words - Photographs As Trust Builders In E-Commerce Websites. In. Proceedings of CHI2002: Extended Abstracts. Minneapolis, MN, US, April 20--25, 2002, pp. 748--749.  ",
      "doi": "10.1145/506443.506578"
    },
    {
      "text": "STERN, Wie wirken Anzeigen? Hamburg: Gruner & Jahr, 2002.",
      "doi": ""
    },
    {
      "text": "Tversky, A. and Kahneman, D., Rational Choice and the Framing of Decisions. In D.E. Bell, H. Raiffa, and A. Tversky, (eds.) Decision Making. Descriptive, normative and prescriptive interactions. Cambridge: University Press, 1988, pp. 167--192.",
      "doi": ""
    },
    {
      "text": "Uslaner, E. M., The Moral Foundations of Trust Cambridge: Cambridge University Press, 2002.",
      "doi": ""
    },
    {
      "text": "Wilson, G and Sasse, M. A., Do users always know what's good for them? Utilising physiological responses to assess media quality. In Proceedings of HCI2000: People and Computers XIV. Sunderland, UK, Sept 5--8, 2000, pp. 151--175.",
      "doi": ""
    }
  ]
}