{
  "doi": "10.1145/642611.642697",
  "title": "The bull's-eye: a framework for web application user interface design guidelines",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "489-496",
  "year": 2003,
  "badges": [],
  "abstract": "A multi-leveled framework for user interface design guidelines of Web applications is presented. User interface design guidelines tend to provide information that is either too general, so that it is difficult to apply to a specific case, or too specific, so that a wide range of products is not supported. The framework presented is unique in that it provides a bridge between the two extremes. It has been dubbed the 'Bull's-Eye' due to its five layers, represented as concentric circles. The center of the Bull's-Eye is the Component layer, followed by Page Templates, Page Flows, Interface Models and Patterns, and Overarching Features and Principles. To support this approach, requirements were gathered from user interface designers, product managers, UI developers, and product developers. Also, usability testing of the guidelines occurred on several levels, from broad guideline tests to more specific product tests. The guidelines and lessons learned are intended to serve as examples for others seeking to design families of Web applications or Web sites.",
  "authors": [
    {
      "name": "Betsy Beier",
      "institution": "Oracle Corporation, Redwood Shores, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100374752",
      "orcid": "missing"
    },
    {
      "name": "Misha W. Vaughan",
      "institution": "Oracle Corporation, Redwood Shores, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100253714",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple Computers, Inc. Macintosh Human Interface Guidelines. Addison-Wesley, Reading, MA, 1992. ",
      "doi": "10.5555/573097"
    },
    {
      "text": "Gale, S. A collaborative approach to developing style guides, in Proceedings of CHI '96 (Vancouver Canada, April 1996), ACM Press, 362--367.  ",
      "doi": "10.1145/238386.238572"
    },
    {
      "text": "Henninger, S. Haynes, K., Reith, M. W. A framework for developing experience-based usability guidelines, in Proceedings of DIS '95 (Ann Arbor MI, August 1995), ACM Press, 43--53.  ",
      "doi": "10.1145/225434.225440"
    },
    {
      "text": "IBM Corporation, Object-Oriented Interface Design: IBM Common User Access Guidelines. QUE, Carmel, IN, 1992.",
      "doi": ""
    },
    {
      "text": "McFarland, A. & Dayton, T. Design Guidelines for Multiplatform Graphical User Interfaces {Document # LP-R13}. Bellcore, Piscataway, NJ, 1995. Available at: http://telecom-info.telcordia.com/site-cgi/ido/index.html",
      "doi": ""
    },
    {
      "text": "Microsoft Corporation, The Windows Interface Guidelines for Software Design. Microsoft Press, Redmond, WA, 1995. ",
      "doi": "10.5555/526513"
    },
    {
      "text": "Miller, A. Integrating human factors in customer support systems development using a multi-level organisational approach, in Proceedings of CHI '96 (Vancouver Canada, April 1996), ACM Press, 368--375.  ",
      "doi": "10.1145/238386.238574"
    },
    {
      "text": "Najjar, L. J. E-commerce user interface design for the Web, in M. J. Smith, G. Salvendy, D. Harris, & R. J. Koubek, Usability evaluation and interface design: Cognitive engineering, intelligent agents, and virtual reality, Vol. 1, Erlbaum, Mahwah, NJ, 2001, 843--847.",
      "doi": ""
    },
    {
      "text": "Ohnemus, K. R. Web style guides: Who, What, Where, in Proceedings of SIGDOC '97 (Snowbird UT, Month 1997), ACM Press, 189--197.  ",
      "doi": "10.1145/263367.263392"
    },
    {
      "text": "Oracle Corporation. Oracle Applications User Interface Standards Release 11. {Part # A58193-01}. Redwood Shores, CA, 1998.",
      "doi": ""
    },
    {
      "text": "Roszenweig, E. Design guidelines for software products: A common look and feel or fantasy? Interactions, 3(5), (September/October 1996), 21--26.  ",
      "doi": "10.1145/234757.234759"
    },
    {
      "text": "Sun Microsystems, Inc. Java Look and Feel Design Guidelines {2nd ed}. Palo Alto, CA, 2001. Available at: http://java.sun.com/products/jlf/ ",
      "doi": "10.5555/554110"
    },
    {
      "text": "Sun Microsystems, Inc. Java Look and Feel Design Guidelines: Advanced Topics {2nd ed}. Palo Alto, CA, 2001. Available at: http://java.sun.com/products/jlf/ ",
      "doi": "10.5555/516911"
    },
    {
      "text": "Tidwell, J. UI Patterns and Techniques: About Patterns. May, 2002. Available at: http://time-tripper.com/uipatterns/about-patterns.html",
      "doi": ""
    },
    {
      "text": "van Duyne, D. K., Landay, J. A., & Hong, J. I. The Design of Sites. Addison Wesely, 2002.",
      "doi": ""
    },
    {
      "text": "Weinshenk, S. & Yeo, S. C. Guidelines for Enterprise-Wide GUI Design. John Wiley & Sons, New York, NY, 1995. ",
      "doi": "10.5555/202718"
    },
    {
      "text": "Zhu, W. Designing and evaluating a Web-based collaboration application: A case study, in M. J. Smith, G. Salvendy, D. Harris, & R. J. Koubek, Usability evaluation and interface design: Cognitive engineering, intelligent agents, and virtual reality, Vol. 1, Erlbaum, Mahwah, NJ, 2001, 838--842.",
      "doi": ""
    }
  ]
}