{
  "doi": "10.1145/642611.642664",
  "title": "The challenges of user-centered design and evaluation for infrastructure",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "297-304",
  "year": 2003,
  "badges": [],
  "abstract": "Infrastructure software comprises code libraries or runtime processes that support the development or operation of application software. A particular infrastructure system may support certain styles of application, and may even determine the features of applications built using it. This poses a challenge: although we have good techniques for designing and evaluating interactive applications, our techniques for designing and evaluating infrastructure intended to support these applications are much less well formed. In this paper, we reflect on case studies of two infrastructure systems for interactive applications. We look at how traditional user-centered techniques, while appropriate for application design and evaluation, fail to properly support infrastructure design and evaluation. We present a set of lessons from our experience, and conclude with suggestions for better user-centered design and evaluation of infrastructure software.",
  "tags": [],
  "authors": [
    {
      "name": "W. Keith Edwards",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Victoria Bellotti",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100464780/rel-imgonly/bellotti-portrait-small.jpg",
      "acmid": "81100464780",
      "orcid": "missing"
    },
    {
      "name": "Anind K. Dey",
      "institution": "Intel Research Lab at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Mark W. Newman",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594629",
      "orcid": "0000-0001-7186-1383"
    }
  ],
  "references": [
    {
      "text": "Alexander, C., Ishikawa, S., Silverstein, M., Jacobson, M., Fiksdahl-King, I. and Angel, S. A Pattern Language. Oxford University Press, Oxford, UK, 1977.]]",
      "doi": ""
    },
    {
      "text": "Apple Computer, Macintosh: Macintosh Toolbox Essentials, 1993.]] ",
      "doi": "10.5555/530497"
    },
    {
      "text": "Bass, L., John, B.E. and Kates, J. Achieving Usability Through Software Architecture. Carnegie Mellon University. 2001, 2001.]]",
      "doi": ""
    },
    {
      "text": "Beck, K. Extreme Programming Explained: Embrace Change. Addison-Wesley, 1999.]] ",
      "doi": "10.5555/318762"
    },
    {
      "text": "Cousins, S.B., Paepcke, A., Winograd, T., Bier, E.A. and Pier, K., The Digital Library Automated Task Environment (DLITE). In Proceedings of ACM International Conference on Digital Libraries, (1997).]]  ",
      "doi": "10.1145/263690.263807"
    },
    {
      "text": "Dey, A.K. and Abowd, G., CybreMinder: A Context-Aware System for Supporting Reminders. In Proceedings of Symposium on Handheld and Ubiquitous Computing (HUC), (2000), Springer-Verlag.]] ",
      "doi": "10.5555/647986.757284"
    },
    {
      "text": "Dey, A.K., Futakawa, M., Salber, D. and Abowd, G., The Conference Assistant: Combining Context-Awareness with Wearable Computing. In Proceedings of International Symposium on Wearable Computers (ISWC), (1999).]] ",
      "doi": "10.5555/519309.856496"
    },
    {
      "text": "Dey, A.K., Salber, D. and Abowd, G.D. A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-Aware Applications. Human Computer Interaction, 16 (2--4). 2001.]]",
      "doi": "10.1207/S15327051HCI16234_02"
    },
    {
      "text": "Dourish, P., Edwards, W.K., LaMarca, A., Lamping, J., Petersen, K., Salisbury, M., Thornton, J. and Terry, D.B. Extending Document Management Systems with Active Properties. ACM Transactions on Information Systems (TOIS). 2000.]]  ",
      "doi": "10.1145/348751.348758"
    },
    {
      "text": "Dourish, P., Lamping, J. and Rodden, T., Building Bridges: Customisation and Mutual Intelligibility in Shared Category Management. In Proceedings of ACM Conference on Supporting Group Work (GROUP), (1999).]]  ",
      "doi": "10.1145/320297.320299"
    },
    {
      "text": "Espinoza, F., Persson, P., Sandin, A., Nystrom, H., Cacciatore, E. and Bylund, M., GeoNotes: Social and Navigational Aspects of Location-Based Information Systems. In Proceedings of Ubicomp, (2001), Springer-Verlag.]] ",
      "doi": "10.5555/647987.741330"
    },
    {
      "text": "Fowler, M., http://martinfowler.com/articles/newMethodology.html.]]",
      "doi": ""
    },
    {
      "text": "Gamma, E., Helm, R., Johnson, R. and Vlissides, J. Design Patterns: Elements of Reusable Object-oriented Software. Addison-Wesley, Reading, Massachusetts, 1994.]] ",
      "doi": "10.5555/186897"
    },
    {
      "text": "Hudson, S.E. and Stasko, J.T., Animation Support in a User Interface Toolkit: Flexible, Robust, and Reusable Abstractions. In Proceedings of Symposium on User Interface Software and Technology (UIST), (1993), ACM.]]  ",
      "doi": "10.1145/168642.168648"
    },
    {
      "text": "Jacobson, I., Griss, M. and Jonsson, P. Software Reuse: Architecture, Process and Organization for Business Success. ACM Press, New York, NY, 1997.]] ",
      "doi": "10.5555/261054"
    },
    {
      "text": "LaMarca, A., Edwards, W.K., Dourish, P., Lamping, J., Smith, I.E. and Thornton, J.D., Taking the Work out of Workflow: Mechanisms for Document-Centered Collaboration. In Proceedings of European Conference on Computer-Supported Cooperative Work (ECSCW), (Copenhagen, Denmark, 1999).]] ",
      "doi": "10.5555/351689.351691"
    },
    {
      "text": "Nagel, K., Kidd, C., O'Connell, T., Dey, A.K. and Abowd, G.D., The Family Intercom: Developing a Context-Aware Communication System. In Proceedings of Ubicomp, (2001), Springer-Verlag.]] ",
      "doi": "10.5555/647987.741326"
    },
    {
      "text": "Roseman, M. and Greenberg, S., GROUPKIT: A Groupware Toolkit for Building Real-Time Conferencing Applications. In Proceedings of Conference on Computer-Supported Cooperative Work (CSCW), (1992).]]  ",
      "doi": "10.1145/143457.143460"
    },
    {
      "text": "Salber, D., Dey, A.K. and Abowd, G.D., The Context Toolkit: Aiding the Development of Context-Enabled Applications. In Proceedings of Conference on Human Factors in Computing Systems (CHI '99), (Pittsburgh, PA USA, 1999), 434--441.]]  ",
      "doi": "10.1145/302979.303126"
    }
  ]
}