{
  "doi": "10.1145/642611.642703",
  "title": "The impact of avatar realism and eye gaze control on perceived quality of communication in a shared immersive virtual environment",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "529-536",
  "year": 2003,
  "badges": [],
  "abstract": "This paper presents an experiment designed to investigate the impact of scommunication in an immersive virtual environment.Participants were paired by gender and were randomly assigned to a CAVE-like system or a head-mounted display. Both were represented by a humanoid avatar in the shared 3D environment. The visual appearance of the avatars was either basic and genderless (like a \"match-stick\" figure), or more photorealistic and gender-specific. Similarly, eye gaze behavior was either random or inferred from voice, to reflect different levels of behavioral realism.Our comparative analysis of 48 post-experiment questionnaires confirms earlier findings from non-immersive studies using semi-photorealistic avatars, where inferred gaze significantly outperformed random gaze. However responses to the lower-realism avatar are adversely affected by inferred gaze, revealing a significant interaction effect between appearance and behavior. We discuss the importance of aligning visual and behavioral realism for increased avatar effectiveness.",
  "authors": [
    {
      "name": "Maia Garau",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100051968",
      "orcid": "missing"
    },
    {
      "name": "Mel Slater",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615391",
      "orcid": "missing"
    },
    {
      "name": "Vinoba Vinayagamoorthy",
      "institution": "University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81100355462/rel-imgonly/image2017-06-2316-50-25-208.jpg",
      "acmid": "81100355462",
      "orcid": "missing"
    },
    {
      "name": "Andrea Brogni",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100506656",
      "orcid": "missing"
    },
    {
      "name": "Anthony Steed",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501447",
      "orcid": "missing"
    },
    {
      "name": "M. Angela Sasse",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M. Bodily Communication. Methuen & Co., London, 1975.",
      "doi": ""
    },
    {
      "text": "Argyle, M. Bodily Communication. 2nd ed., Methuen & Co., London, 1988.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Cook, M. Gaze and Mutual Gaze. Cambridge University Press, Cambridge, 1976.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Ingham, R. Mutual Gaze and Proximity. Semiotica 6 (1972), 32--49.",
      "doi": ""
    },
    {
      "text": "Argyle, M., Ingham, R., Alkema, F., and McCallin, M. The Different Functions of Gaze. Semiotica 7 (1973), 10--32.",
      "doi": ""
    },
    {
      "text": "Bailenson, J. N., Blascovich, J., Beall, A. C., and Loomis, J. M. Equilibrium theory revisited: Mutual gaze and personal space in virtual environments. Presence: Teleoperators and Virutal Environments 10, 6 (2001), 583--598.  ",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Benford, S., Bowers, J., Fahlen, L. E., Greenhalgh, C., and Snowdon, D. User Embodiment in Collaborative Virtual Environments, in Proceedings of CHI'95: ACM Conference on Human Factors in Computing Systems (Denver, CO, 1995), 242--249.  ",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Cassell, J., Sullivan, J., Prevost, S., and Churchill, E., Eds., Embodied Conversational Agents, The MIT Press, Cambridge, MA, 2000.",
      "doi": ""
    },
    {
      "text": "Cruz-Neira, C., Sandin, D. J., and DeFanti, T. A. Surround-Screen Projection-Based Virtual Reality: The Design and Implementation of the CAVE, in Proceedings of Computer Graphics (SIGGRAPH) Proceedings, Annual Conference Series 1993), 135--142.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Eyematic. Available at http://www.eyematic.com.",
      "doi": ""
    },
    {
      "text": "Frecon, E., Smith, G., Steed, A., Stenius, M., and Stahl, O. An Overview of the COVEN Platform. Presence: Teleoperators & Virtual Environments 10 (2001), 109--127.  ",
      "doi": "10.1162/105474601750182351"
    },
    {
      "text": "Fukayama, A., Sawaki, M., Ohno, T., Murase, H., Hagita, N., and Mukawa, N. Expressing Personality of Interface Agents by Gaze, in Proceedings of INTERACT (Tokyo, Japan, 2001), 793--794.",
      "doi": ""
    },
    {
      "text": "Fukayama, A., Takehiko, O., Mukawa, N., Sawaki, M., and Hagita, N. Messages Embedded in gaze of Interface Agents - Impression management with agent's gaze -, in Proceedings of SGICHI - Conference in Human factor in Computing Systems (Minneapolis, USA, 2002), ACM Press, 41--48.  ",
      "doi": "10.1145/503376.503385"
    },
    {
      "text": "Garau, M., Slater, M., Bee, S., and Sasse, M.-A. The Impact of Eye Gaze on Communication using Humanoid Avatars, in Proceedings of CHI'01: ACM Conference on Human Factors in Computing Systems (Seattle, WA, 2001), 309--316.  ",
      "doi": "10.1145/365024.365121"
    },
    {
      "text": "H-Anim. Humanoid Animation Working Group, Available at http://www.hanim.org.",
      "doi": ""
    },
    {
      "text": "Kendon, A. Some Functions of Gaze-Direction in Social Interaction. Acta Psychologica 26 (1967), 22--63.",
      "doi": ""
    },
    {
      "text": "Lee, S. H., Badler, J. B., and Badler, N. I. Eyes Alive, in Proceedings of 29th Annual Conference on Computer Graphics and Interactive Techniques (San Antonio, TX, 2002), ACM Press, 637--644.  ",
      "doi": "10.1145/566570.566629"
    },
    {
      "text": "Sellen, A. Remote Conversations: The Effect of Mediating talk with Technology. Human-Computer Interaction 10, 4 (1995), 401--444.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Slater, M., Howell, J., Steed, A., Pertaub, D.-P., Garau, M., and Springel, S. Acting in Virtual Reality, in Proceedings of Proceedings of ACM Collaborative Virtual Environments (San Francisco, CA, 2000), 103--110.  ",
      "doi": "10.1145/351006.351020"
    },
    {
      "text": "Slater, M., Steed, A., and Chrysanthou, Y. Computer Graphics and Virtual Environments: From Realism to Real-Time. Addison Wesley Publishers, Harlow, England, 2001. ",
      "doi": "10.5555/559649"
    },
    {
      "text": "Slater, M. and Steed, A. Meeting People Virtually: Experiments in Virtual Environments. In R. Schroeder, Ed., The Social Life of Avatars: Presence and Interaction in Shared Virtual Environments, Springer Verlag, Berlin, 2001. ",
      "doi": "10.5555/505799.505808"
    },
    {
      "text": "Slater, M., Steed, A., Mc.Carthy, J., and Maringelli, F. The Influence of Body Movement on Subjective Presence in Virtual Environments. Human Factors 40, 3 (1998), 469--477.",
      "doi": ""
    },
    {
      "text": "Steed, A., Mortensen, J., and Frecon, E. Spelunking: Experiences using the DIVE System on CAVE-like Platforms. In B. Frohlicj, J. Deisinger, and H.-J. Bullinger, Eds., Immersive Projection Technologies and Virtual Environments, Springer-Verlag, 2001, 153--164.  ",
      "doi": "10.5555/2383737.2383758"
    },
    {
      "text": "Straus, S. and McGrath, J. E. Does the Medium Matter: The Interaction of Task and Technology on Group Performance and Member Reactions. Journal of Applied Psychology 79 (1994), 87--97.",
      "doi": ""
    },
    {
      "text": "Tromp, J., Bullock, A., Steed, A., Sadagic, A., Slater, M., and Frecon, E. Small Group Behaviour Experiments in the COVEN Project. IEEE Computer Graphics and Applications 18, 6 (1998), 53--63.  ",
      "doi": "10.1109/38.734980"
    },
    {
      "text": "Vertegaal, R., Slagter, R., Van der Veer, G., and Nijholt, A. Eye Gaze patterns in Conversations: There is More to Conversational Agents than Meets the Eyes, in Proceedings of CHI'01: ACM Conference on Human Factors in Computing Systems (Seattle, WA, 2001), 301--307.  ",
      "doi": "10.1145/365024.365119"
    },
    {
      "text": "Watson, D. and Friend, R. Measurement of social-evaluative anxiety. Journal of Consulting and Clinical Psychology 33 (1969), 448--457.",
      "doi": ""
    }
  ]
}