{
  "doi": "10.1145/642611.642635",
  "title": "Unpacking \"privacy\" for a networked world",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "129-136",
  "year": 2003,
  "badges": [],
  "abstract": "Although privacy is broadly recognized as a dominant concern for the development of novel interactive technologies, our ability to reason analytically about privacy in real settings is limited. A lack of conceptual interpretive frameworks makes it difficult to unpack interrelated privacy issues in settings where information technology is also present. Building on theory developed by social psychologist Irwin Altman, we outline a model of privacy as a dynamic, dialectic process. We discuss three tensions that govern interpersonal privacy management in everyday life, and use these to explore select technology case studies drawn from the research literature. These suggest new ways for thinking about privacy in socio-technical environments as a practical matter.",
  "tags": [
    "data monitoring",
    "disclosure",
    "social psychology",
    "access regulation",
    "boundary management",
    "privacy",
    "surveillance"
  ],
  "authors": [
    {
      "name": "Leysia Palen",
      "institution": "University of Colorado, Boulder, CO",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    },
    {
      "name": "Paul Dourish",
      "institution": "University of California, Irvine, CA",
      "img": "/do/10.1145/contrib-81100521529/rel-imgonly/paul-headshot-square.jpg",
      "acmid": "81100521529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. & Cranor, L. 1999. Privacy Critics: UI Components to Safeguard Users' Privacy. Proc. ACM Conf. Human Factors in Computing Systems CHI'99, 2, 258--259.]]  ",
      "doi": "10.1145/632716.632875"
    },
    {
      "text": "Agre, P. 1995. Conceptions of the User in Computer Systems Design. In Thomas (ed), The Social and Interactional Dimensions of Human-Computer Interfaces, 67--106. Cambridge: CUP.]] ",
      "doi": "10.5555/214811.214823"
    },
    {
      "text": "Agre, P. 1997. Beyond the Mirror Worlds: Privacy and the Representational Practices of Computer Science. In Agre and Rotenberg (eds), Technology and Privacy: The New Landscape. Cambridge, MA: MIT Press.]] ",
      "doi": "10.5555/275283.275285"
    },
    {
      "text": "Agre, P. 1999. The Architecture of Identity: Embedding Privacy in Market Institutions. Information, Communication, and Society, 2(1), 1--25.]]",
      "doi": ""
    },
    {
      "text": "Agre, P. 2001. Changing Places: Contexts of Awareness in Computing. Human-Computer Interaction, 16(2-4), 177--192.]]",
      "doi": "10.1207/S15327051HCI16234_04"
    },
    {
      "text": "Altman, I. 1975. The Environment and Social Behavior: Privacy, Personal Space, Territory and Crowding. Monterey, CA: Brooks/Cole Pub. Co., Inc.]]",
      "doi": ""
    },
    {
      "text": "Altman, I. 1977. Privacy Regulation: Culturally Universal or Culturally Specific? Journal of Social Issues, 33 (3), 66--84.]]",
      "doi": ""
    },
    {
      "text": "Bellotti, V. & Sellen, A. 1993. Design for Privacy in Ubiquitous Computing Environments. Proc. Third European Conf. Computer-Supported Cooperative Work ECSCW'93 (Milano, Italy), 77--92. Dordrecht: Kluwer.]] ",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Bly, S., Harrison, S., & Irwin, S. 1993. Media Spaces: Bring People Together in Video, Audio and Computing Environments. Communications of the ACM, 36(1), 28--47.]]  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Bly, S., Cook, L., Bickmore, T., Churchill, E., & Sullivan, J. 1998. The Rise of Personal Web Pages at Work. Proc. ACM Conf. Human Factors in Computing Systems CHI'98, 2, 313--314.]]  ",
      "doi": "10.1145/286498.286786"
    },
    {
      "text": "Clement, A. 1994. Considering Privacy in the Development of Multimedia Communications. Computer-Supported Cooperative Work, 2, 67--88.]]",
      "doi": ""
    },
    {
      "text": "Dourish, P. 1993. \"Culture and Control in a Media Space,\" Proc. Third European Conf. Computer-Supported Cooperative Work ECSCW'93 (Milano, Italy), 125--138. Dordrecht: Kluwer.]] ",
      "doi": "10.5555/1241934.1241943"
    },
    {
      "text": "Dourish, P. & Redmiles, D. 2002. An Architecture for Usable Security based on Event Monitoring and Information Visualization. Proc. New Security Paradigms Workshop NSPW'02 (Virginia Beach, VA).]]  ",
      "doi": "10.1145/844102.844116"
    },
    {
      "text": "Erickson, T. 1996. The World-Wide Web as Social Hypertext. Comm. of the ACM, 37(1), 15--17.]]  ",
      "doi": "10.1145/234173.234174"
    },
    {
      "text": "Erickson, T. 1997. Social Interaction on the Net: Virtual Community as Participatory Genre. Proc. Hawaii Int'l Conference on Systems Science HICSS. Los Alamitos, CA: IEEE Computer Society Press.]] ",
      "doi": "10.5555/938438.938868"
    },
    {
      "text": "Gaver, W. 1992. The Affordances of Media Spaces for Collaboration. Proc. ACM Conf. Computer-Supported Cooperative Work CSCW'92 (Toronto, Ontario), 17--24. New York: ACM.]]  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Grinter, R. & Palen, L. 2002. Instant Messaging in Teen Life. Proc. ACM Conf. Computer-Supported Cooperative Work CSCW'02 (New Orleans, LA), 21--30. New York: ACM.]]  ",
      "doi": "10.1145/587078.587082"
    },
    {
      "text": "Grudin, J. 2001. Desituating Action: Digital Representation of Context. Human-Computer Interaction, 16, 269--286.]]",
      "doi": "10.1207/S15327051HCI16234_10"
    },
    {
      "text": "Harper, R. 1992. Looking at Ourselves: An Examination of the Social Organization of Two Research Laboratories. Proc. ACM Conf. Computer-Supported Cooperative Work CSCW'92 (Toronto, Ontario), 330--337. New York: ACM.]]  ",
      "doi": "10.1145/143457.143542"
    },
    {
      "text": "Harper, R., Lamming, M. & Newman, W. 1992. Locating Systems at Work: Implications for the Development of Active Badge Applications. Interacting with Computers, 4 (3), 343--363.]]  ",
      "doi": "10.1016/0953-5438%2892%2990022-8"
    },
    {
      "text": "Laurier, E. 2001. Why People Say Where They Are During Mobile Phone Calls. Environment and Planning D: Society & Space, 19(4), 485--504.]]",
      "doi": ""
    },
    {
      "text": "Nagel, K., Kidd, C., O'Connell, T., Dey, A., & Abowd, G. 2001. The Family Intercom: Developing a Context-Aware Audio Communication System. In Abowd, Brumitt and Shafer (eds), Ubicomp 2001, LNCS 2201, 176--183. Berlin: Springer-Verlag.]] ",
      "doi": "10.5555/647987.741326"
    },
    {
      "text": "Orwell, G. 1949. Nineteen Eighty-Four. London: Martin Secker & Warburg.]]",
      "doi": ""
    },
    {
      "text": "Palen, L. 1999. Social, Individual and Technological Issues for Groupware Calendar Systems. Proc. ACM Conf. Human Factors in Computing Systems CHI'99 (Pittsburgh, PA), 17--24. New York: ACM Press.]]  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Palen, L., Salzman, M. & Youngs, E. 2000. Going Wireless: Behavior and Practice of New Mobile Phone Users. Proc. ACM Conf Computer Supported Cooperative Work CSCW 2000 (Philadelphia, PA), 201--210. New York: ACM Press.]]  ",
      "doi": "10.1145/358916.358991"
    },
    {
      "text": "Reagle, J. and Cranor, L. 1999. The Platform for Privacy Preferences. Comm. ACM, 42(2), 48--55.]]  ",
      "doi": "10.1145/293411.293455"
    },
    {
      "text": "Yates, J. & Orlikowski, W. 1992. Genres of Organizational Communication: A Structurational Approach to Studying Communication & Media. Academy of Management Science Review, 17(2), 299--326.]]",
      "doi": ""
    }
  ]
}