{
  "doi": "10.1145/642611.642653",
  "title": "Ambiguity as a resource for design",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "233-240",
  "year": 2003,
  "badges": [],
  "abstract": "Ambiguity is usually considered anathema in Human Computer Interaction. We argue, in contrast, that it is a resource for design that can be used to encourage close personal engagement with systems. We illustrate this with examples from contemporary arts and design practice, and distinguish three broad classes of ambiguity according to where uncertainty is located in the interpretative relationship linking person and artefact. Ambiguity of information finds its source in the artefact itself, ambiguity of context in the sociocultural discourses that are used to interpret it, and ambiguity of relationship in the interpretative and evaluative stance of the individual. For each of these categories, we describe tactics for emphasising ambiguity that may help designers and other practitioners understand and craft its use.",
  "authors": [
    {
      "name": "William W. Gaver",
      "institution": "The Royal College of Art, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    },
    {
      "name": "Jacob Beaver",
      "institution": "The Royal College of Art, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578663",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Atelier van Lieshout. A manual. Kölnischer Kunstverein and Museum Boijmans van Beuningen, Cologne, 1997.",
      "doi": ""
    },
    {
      "text": "Boucher, A., Gaver, W., Pennington, S., and Walker, B. Equator workbook one: Ideas, scenarios and proposals for the home. Royal College of Art, 2001.",
      "doi": ""
    },
    {
      "text": "BBC online. Available at: http://news.bbc.co.uk/1/hi/ entertainment/arts/1987109.stm",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Hemmings, T., and Rodden, T. Pattern-based support for interactive design in domestic settings. Proc. DIS2002 (London 2002). ACM Press, pp. 265--275.  ",
      "doi": "10.1145/778712.778749"
    },
    {
      "text": "Dahley, A., Wisneski, C., and Ishii, H. Water Lamp and Pinwheels: Ambient projection of digital information into architectural space. Proc. CHI'98 Companion (1998), ACM Press, pp. 269--270.  ",
      "doi": "10.1145/286498.286750"
    },
    {
      "text": "Dunne, A. Hertzian tales: Electronic products, aesthetic experience and critical design. London, RCACRD Research Publications, 1999. ",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Dunne, A., and Gaver, W. The Pillow: Artist-designers in the digital age. Proc. of CHI'97 Companion (Atlanta, 1997), ACM Press.  ",
      "doi": "10.1145/1120212.1120434"
    },
    {
      "text": "Gaver, W., and Dunne, A. (1999). Projected Realities: Conceptual design for cultural effect. Proc. of CHI'99 (1999), ACM Press.  ",
      "doi": "10.1145/302979.303168"
    },
    {
      "text": "Gaver, W., and Hooker, B. The Presence Project. London, RCACRD Research Publications, 2001.",
      "doi": ""
    },
    {
      "text": "Gaver, W., and Martin, H. Alternatives: Exploring information appliances through conceptual design proposals. Proc. of CHI'00 (Den Haag). New York, ACM Press.  ",
      "doi": "10.1145/332040.332433"
    },
    {
      "text": "Godfrey, T. Conceptual Art. London, Phaidon, 1998.",
      "doi": ""
    },
    {
      "text": "Koleva, B., Taylor, I., Benford, S., Fraser, M., Greenhalgh, C., Schndelbach, H., vom Lehn, D., Heath, C., Row-Farr, J. & Adams, M. Orchestrating a Mixed Reality Performance. Proc. CHI'01, (Seattle, 2001), ACM Press.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Murray, P., and Murray, L. The Penguin Dictionary of Art and Artists. London: Penguin Books, 1983.",
      "doi": ""
    },
    {
      "text": "Nickerson, R. & Landauer, T. Human-computer interaction: Background and issues. In Helander, M.G., Landauer, T.K. and Prabhu, P. (eds.), Handbook of Human-Computer Interaction, 2nd edition. Amsterdam, The Netherlands: Elsevier Science.",
      "doi": ""
    },
    {
      "text": "Nicolls, C. The Mona Lisa, London Review of Books, 4 April 2002.",
      "doi": ""
    },
    {
      "text": "Read, H. A Concise History of Painting. London, Thames & Hudson, 1959.",
      "doi": ""
    },
    {
      "text": "Sassoon, D. Mona Lisa: The History of the World's Most Famous Painting. London, HarperCollins, 2001.",
      "doi": ""
    },
    {
      "text": "Weiser, M. and Brown J.S. Designing calm technology. PowerGrid Journal, v.1.01, July 1996.",
      "doi": "10.5555/504928.504934"
    }
  ]
}