{
  "doi": "10.1145/642611.642676",
  "title": "Using pixel rewrites for shape-rich interaction",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "369-376",
  "year": 2003,
  "badges": [],
  "abstract": "This paper introduces new interactive ways to create, manipulate and analyze shapes, even when those shapes do not have simple algebraic generators. This is made possible by using pixel-pattern rewrites to compute directly with bitmap representations. Such rewrites also permit the definition of functionality maps, bitmaps that specify the spatial scope of application functionality, and organic-widgets, implemented right in the pixels to have arbitrary form, integrated with the shape needs of the applications. Together these features should increase our capabilities for working with rich spatial domains.",
  "authors": [
    {
      "name": "George W. Furnas",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100649937",
      "orcid": "missing"
    },
    {
      "name": "Yan Qu",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337837",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, B. & Lewis, C. (1993) ChemTrains: A Language for Creating Behaving Pictures. In 1993 IEEE Workshop on Visual Languages, 1993, 188--195.]]",
      "doi": ""
    },
    {
      "text": "Codd, E. F., Cellular automata, New York: Academic Press, 1968.]] ",
      "doi": "10.5555/1098682"
    },
    {
      "text": "Davis, R. & King, J. An overview of production systems. Rep. STAN-CS-75-524, Computer Science Dept., Stanford Univ., Stanford, CA, 1975.]]",
      "doi": ""
    },
    {
      "text": "Furnas, G.W. (1991) New Graphical Reasoning Models for Understanding Graphical Interfaces. Proc. of CHI '91 Conf. on Hum. Factors in Comp. Sys. 1991, 71--78.]]  ",
      "doi": "10.1145/108844.108855"
    },
    {
      "text": "Furnas, George W. and Qu, Yan (2002) Shape Manipulation using Pixel Rewrites. At Workshop on Visual Computation 2002, in Proceedings of the Distributed Multimedia Systems 2002, San Francisco, CA, Sept 26--29, 630--639.]]",
      "doi": ""
    },
    {
      "text": "Furnas, G.W., Qu, Y., Shrivastava, S., and Peters, G, (2000) The use of intermediate graphical constructions in problem solving with dynamic, pixel-level diagrams. In M.Anderson, P.Cheng, V.Harslev (Eds.) Theory and Application of Diagrams, Lecture Notes in A. I. #1889, Springer Verlag.]] ",
      "doi": "10.5555/645970.674901"
    },
    {
      "text": "Furnas, G., Qu, Y., Shrivastava, S., and Peters, G. (2001) Richer Graphical Interaction using Interactive Pixel Rewrite Systems. Extended Abstract (demo) In Proc. of CHI 2001 Conf. on Hum. Factors in Comp. Sys., 9--10.]]  ",
      "doi": "10.1145/634067.634075"
    },
    {
      "text": "Kurlander, D & Bier, Eric A. (1988) Graphical search and replace. Computer Graphics, 22(4), 113--120.]]  ",
      "doi": "10.1145/378456.378495"
    },
    {
      "text": "Lindenmayer, A. (1968) Mathematical models for cellular interaction in development, Parts I and II. Journal of Theoretical Biology, 18, 280--315.]]",
      "doi": ""
    },
    {
      "text": "Repenning, A. & Fahlen, L.E. (1993) Agentsheets: A Tool for Building Domain-Oriented Visual Programming Environments. Proc. of ACM INTERCHI'93 Conf. on Human Factors in Comp. Sys., 142--143.]]  ",
      "doi": "10.1145/169059.169119"
    },
    {
      "text": "Russ, John C. (1998) The Image Processing Handbook 3rd Ed, Boca Raton, FL: CRC Press.]] ",
      "doi": "10.5555/289912"
    },
    {
      "text": "Serra, Jean (1982) Image Analysis and Mathematical Morphology, New York: Academic Press.]] ",
      "doi": "10.5555/1098652"
    },
    {
      "text": "Siromoney, G., Siromoney, R, Krithivasan, K. (1973) Picture Languages with Array Rewriting Rules. Information and Control, 22. Academic Press, 447--470.]]",
      "doi": ""
    },
    {
      "text": "Smith, D.C., Cypher, A. & Spohrer, J. (1994) KidSim: Programming Agents Without a Programming Language. Comm of the ACM, 37(7), 54--67.]]  ",
      "doi": "10.1145/176789.176795"
    },
    {
      "text": "Stiny, G, (1980) Introduction to shape and shape grammars. Environment And Planning B - Planning & Design, 7 (3): 343--351.]]",
      "doi": ""
    },
    {
      "text": "Yamamoto, Kakuya (1996). Visulan: A Visual Programming Language for Self-Changing Bitmap. Proc. of International Conference on Visual Information Systems, Victoria Univ. of Tech. cooperation with IEEE (Melbourne, Australia), 88--89.]]",
      "doi": ""
    }
  ]
}