{
  "doi": "10.1145/642611.642690",
  "title": "A design tool for camera-based interaction",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "449-456",
  "year": 2003,
  "badges": [],
  "abstract": "Cameras provide an appealing new input medium for interaction. The creation of camera-based interfaces is outside the skill-set of most programmers and completely beyond the skills of most interface designers. Image Processing with Crayons is a tool for creating new camera-based interfaces using a simple painting metaphor. A transparent layers model is used to present the designer with all of the necessary information. Traditional machine learning algorithms have been modified to accommodate the rapid response time required of an interactive design tool.",
  "tags": [
    "interaction",
    "image processing",
    "classification",
    "machine learning",
    "perceptive user interfaces"
  ],
  "authors": [
    {
      "name": "Jerry Fails",
      "institution": "Brighm Young University/BYU, Provo, UT",
      "img": "/do/10.1145/contrib-81100158845/rel-imgonly/070215_5734_jerryalanfalls.jpg",
      "acmid": "81100158845",
      "orcid": "missing"
    },
    {
      "name": "Dan Olsen",
      "institution": "Brighm Young University/BYU, Provo, UT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410595121",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Belongie, S., Carson, C., Greenspan, H. and Malik, J. \"Color and texture-based image segmentation using EM and its application to content-based image retrieval.\" In Proc. Int. Conf. Comp. Vis., 1998.]] ",
      "doi": "10.5555/938978.939161"
    },
    {
      "text": "Buck, I., Finkelstein, A., Jacobs, C., Klein, A., Salesin, D. H., Seims, J., Szeliski, R., and Toyama, K. \"Performance-driven hand-drawn animation.\" Proceedings of NPAR 2000 (June 2000).]]  ",
      "doi": "10.1145/340916.340929"
    },
    {
      "text": "Carson, C., Thomas, M., Belongie, S., Hellerstein, J.M. and Malik, J. \"Blobworld: A system for region-based image indexing and retrieval.\" In Proc. Int. Conf. Visual Inf. Sys., 1999.]] ",
      "doi": "10.5555/647060.714153"
    },
    {
      "text": "Christos Faloutsos, C., Barber, R., Flickner, M., Niblack, W., Petkovic, D. and Equitz, W. \"Efficient and effective querying by image content.\" Journal of Intelligent Information Systems, 3(3/4): 231--262, July 1994.]]  ",
      "doi": "10.1007/BF00962238"
    },
    {
      "text": "Cover, T., and Hart, P. \"Nearest Neighbor Pattern Classification.\" IEEE Transactions on Information Theory, 13, (1967) 21--27.]]",
      "doi": "10.1109/TIT.1967.1053964"
    },
    {
      "text": "Crowley, J.L, Bérard, F., and Coutaz, J. \"Finger Tracking as an Input Device for Augmented Reality.\" IWAGFR '95: Zurich, Germany (June 1995).]]",
      "doi": ""
    },
    {
      "text": "Davis, J. \"Recognizing movement using motion histograms.\" MIT Media lab Technical Report #487, March 1999.]]",
      "doi": ""
    },
    {
      "text": "Duda, R. O., Hart, P. E., and Stork, D. G., Pattern Classification. (2001).]] ",
      "doi": "10.5555/954544"
    },
    {
      "text": "Fails, J.A., Olsen, D.R. \"LightWidgets: Interacting in Everyday Spaces.\" Proceedings of IUI '02 (San Francisco CA, January 2002).]]  ",
      "doi": "10.1145/502716.502729"
    },
    {
      "text": "Fayyad, U.M. and Irani, K. B. \"On the Handling of Continuous-valued Attributes in Decision Tree Generation.\" Machine Learning, 8, 87--102,(1992).]]  ",
      "doi": "10.1023/A%3A1022638503176"
    },
    {
      "text": "Freeman, W., Anderson, D., Beardsley, P., et al. \"Computer vision for interactive computer graphics.\" IEEE Computer Graphics and Applications, Vol. 18, Num 3, pages 42--53, May--June 1998.]]  ",
      "doi": "10.1109/38.674971"
    },
    {
      "text": "Ghidary, S.S. Nakata, Y., Takamori, T. and Hattori, M. \"Head and Face Detection at Indoor Environment by Home Robot.\" Proceedings of ICEE200 (Iran, May 2000).]]",
      "doi": ""
    },
    {
      "text": "Hirata, K. and Kato, T. \"Query by Visual Example-Content-Based Image Retrieval.\" Advances in Database Technology EDBT '92, 3rd International Conference on Extending Database Technology, Vienna, Austria, A. Pirotte, C. Delobel, and G. Gottlob, eds., Lecture Notes in Computer Science, vol. 580, Springer-Verlag, Berlin, 1992, pp. 56--71.]] ",
      "doi": "10.5555/645336.649863"
    },
    {
      "text": "Ishii, H., and Ullmer, B. \"Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms.\" Human Factors in Computing Systems (CHI '97). (March 1997).]]  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Jaimes, A. and Chang, S.-F. \"A Conceptual Framework for Indexing Visual Information at Multiple Levels.\" IS&T/SPIE Internet Imaging 2000, (San Jose CA, January 2000).]]",
      "doi": ""
    },
    {
      "text": "Jaimes, A. and Chang, S.-F. \"Automatic Selection of Visual Features and Classifier.\" Storage and Retrieval for Image and Video Databases VIII, IS&T/SPIE (San Jose CA, January 2000).]]",
      "doi": ""
    },
    {
      "text": "Jaimes, A. and Chang, S.-F. \"Integrating Multiple Classifiers in Visual Object Detectors Learned from User Input.\" Invited paper, session on Image and Video Databases, 4th Asian Conference on Computer Vision (ACCV 2000), Taipei, Taiwan, January 8-11, 2000.]]",
      "doi": ""
    },
    {
      "text": "Kelly, P. M. and Cannon, M. \"Query by Image Example: the CANDID Approach.\" Los Alamos National Laboratory White Paper, (1995).]]",
      "doi": ""
    },
    {
      "text": "Koller, D., Klinker, G., Rose, E., Breen, D., Whitaker, R. and Tuceryan, M. \"Real-time Vision-based Camera Tracking for Augmented Reality Applications.\" Proceedings of the Symposium on Virtual Reality Software and Technology (VRST-97), Lusanne, Switzerland, Sept 1997, 87--94.]]  ",
      "doi": "10.1145/261135.261152"
    },
    {
      "text": "Krueger, M. W., Gionfriddo. T., and Hinrichsen, K., \"VIDEOPLACE -- an artificial reality\". Human Factors in Computing Systems, CHI '85 Conference Proceedings, ACM Press, 1985, 35--40.]]  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Hardenberg, C. and Bérard, F. \"Bare-Hand Human-Computer Interaction.\" Proceedings of the ACM Workshop on Perceptive User Interfaces (Orlando, FL, Nov. 15--16, 2001).]]  ",
      "doi": "10.1145/971478.971513"
    },
    {
      "text": "Olsen, D.R., Nielsen, T. \"Laser Pointer Interaction.\" Proceedings of CHI '01 (Seattle WA, March 2001).]]  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Quinlan, J. R. \"Induction of Decision Trees.\" Machine Learning, 1(1); 81--106, (1986).]]  ",
      "doi": "10.1023/A%3A1022643204877"
    },
    {
      "text": "Rumelhart, D., Widrow, B., and Lehr, M. \"The Basic Ideas in Neural Networks.\" Communications of the ACM, 37(3), (1994), pp 87--92.]]  ",
      "doi": "10.1145/175247.175256"
    },
    {
      "text": "Scott, S., Lesh, N., Klau, G. \"Investigating Human-Computer Optimization.\" Proceedings of CHI '02 (Minneapolis MN, April 2002), pp. 155--162.]]  ",
      "doi": "10.1145/503376.503405"
    },
    {
      "text": "Starner, T., Auxier, J. and Ashbrook, D. \"The Gesture Pendant: A Self-illuminating, Wearable, Infrared Computer Vision System for Home Automation Control and Medical Monitoring.\" International Symposium on Wearable Computing (Atlanta GA, October 2000).]] ",
      "doi": "10.5555/851037.856538"
    },
    {
      "text": "Takagi, H. \"Interactive evolutionary computation: fusion of the capabilities of EC optimization and human evaluation.\" Proceedings of the IEEE, Vol. 89, Issue 9, Sep 2001, pp. 1275--1296.]]",
      "doi": ""
    },
    {
      "text": "Underkoffler, J., Ullmer, B. and Ishii, H. \"Emancipated Pixels: Real-World Graphics in the Luminous Room.\" Proceedings of SIGGRAPH '99 (Los Angeles CA, 1999), ACM Press, 385--392.]]  ",
      "doi": "10.1145/311535.311593"
    },
    {
      "text": "Underkoffler, J. and Ishii H. \"Illuminating Light: An Optical Design Tool with a Luminous-Tangible Interface.\" Proceedings of CHI '98 (Los Angeles CA, April 1998).]]  ",
      "doi": "10.1145/274644.274717"
    },
    {
      "text": "Vailaya, A., Zhong, Y., and Jain, A. K. \"A hierarchical system for efficient image retrieval.\" In Proc. Int. Conf. on Patt. Recog. (August 1996).]] ",
      "doi": "10.5555/839288.842069"
    },
    {
      "text": "Viola, P. and Jones, M. \"Robust real-time object detection.\" Technical Report 2001/01, Compaq CRL, February 2001.]]",
      "doi": ""
    },
    {
      "text": "Weiser, M. \"The Computer for the 21st Century.\" Scientific American, 1991, 365(3), pp. 94--104.]]",
      "doi": ""
    },
    {
      "text": "Yang, M.H. and Ahuja, N. \"Gaussian Mixture Model for Human Skin Color and Its Application in Image and Video Databases.\" Proceedings of SPIE '99 (San Jose CA, Jan 1999), 458--466.]]",
      "doi": ""
    }
  ]
}