{
  "doi": "10.1145/642611.642624",
  "title": "Social coordination around a situated display appliance",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "65-72",
  "year": 2003,
  "badges": [],
  "abstract": "Advances in display technology are creating more opportunities for situating displays in our environment. While these displays share some common design principles with display-based interaction at the desktop PC, situated displays also have unique characteristics and values that raise particular design considerations and challenges. In order to further understand situated display design we present a field study of RoomWizard, an interactive room reservation display appliance designed to be mounted outside meeting rooms. The findings illustrate important ways that individual and social behaviours were oriented around the persistent situated displays. These observed behaviours are discussed in relation to particular design characteristics of RoomWizard. We conclude by highlighting more general themes supporting the design of other situated display technologies.",
  "authors": [
    {
      "name": "Kent O'Hara",
      "institution": "The Appliance Studio, University Gate, Park Row, Bristol, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Mark Perry",
      "institution": "Brunel University, Uxbridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100036324",
      "orcid": "missing"
    },
    {
      "name": "Simon Lewis",
      "institution": "The Appliance Studio, University Gate, Park Row, Bristol, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81536946656",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cheverst, K. Fitton, D, Dix, A. and Rouncefield, M. (2002) Exploring Situated Interaction with Ubiquitous Office Door Displays. Workshop: Public, Community & Situated Displays, CSCW'02 New Orleans, Louisiana.",
      "doi": ""
    },
    {
      "text": "Erickson, T. and Kellogg, W. ('2000) Social Transluscence: An Approach to Designing Systems That Support Social Processes. ACM Transactions on Computer-Human Interaction. 7(1), pp 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Farrell, S. (2001) Social and informational proxies in a fish tank Extended Abstracts of CHI '01, Seattle WA.  ",
      "doi": "10.1145/634067.634283"
    },
    {
      "text": "Gaver, W., Moran, T., MacLean, A. Lovstrand, L., Dourish, P. Carter, K. and Buxton, W. (1992) Realising a video environment: EuroPARC's RAVE system. Proceedings of CHI '92, 27--35.  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Greenberg, S. (1999). Designing Computers As Public Artifacts. International Journal of Design Computing: Special Issue on Design Computing on the Net (DCNet'99), Nov 30--Dec 3, University of Sydney.",
      "doi": ""
    },
    {
      "text": "Gruen, D., Rohall, S. Petigara, N. and Lam, D. (2000) \"In Your Space\" Displays for Casual Awareness. In Demonstrations of CSCW 2000, Philadelphia, PA.",
      "doi": ""
    },
    {
      "text": "Houde, S., Bellamy, R., Leahy, L. (1998) In search of design principles for tools and practices to support communication within a learning community. SIGCHI Bulletin, 30, 2 (April 1998), 113--118.  ",
      "doi": "10.1145/279044.279171"
    },
    {
      "text": "Ishii, H. Wisneski, C.Brave, S. and Dahley, A., Gorbet, M. Ullmer, B. and Yarin, P. (1998) ambientROOM: Integrating Ambient Media with Architectural Space. In Extended Abstracts of CHI '98, Los Angeles, CA.  ",
      "doi": "10.1145/286498.286652"
    },
    {
      "text": "McCarthy, J.F., Costa, T.J. and Liongosari, E.S. (2001) UniCast, OutCast and GroupCast: Three Steps Toward Ubiquitous Peripheral Displays. Proceedings of UbiComp'01, Atlanta, GA. ",
      "doi": "10.5555/647987.741333"
    },
    {
      "text": "O'Hara, K. and Brown, B. (2001) Designing CSCW Technologies to Support Tacit Knowledge Sharing Through Conversation Initiation. Workshop on Managing Tacit Knowledge, ECSCW'01, Bonn, Germany.",
      "doi": ""
    },
    {
      "text": "Palen, L. (1999) Social, individual and technological issues for groupware calendar systems. Proceedings of CHI'99, Pittsburgh, PA, 17--24.  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Pedersen, E.R. (1998) People Presence or Room Activity supporting peripheral awareness over distance. In Extended Abstracts of CHI '98, Los Angeles, CA, 283--284.  ",
      "doi": "10.1145/286498.286763"
    },
    {
      "text": "Russell, D.M. and Gossweiler, R. (2001) On the Design of Personal and Communal Large Information Appliances. In Proceedings of UbiComp 2001, Atlanta, GA. ",
      "doi": "10.5555/647987.757257"
    },
    {
      "text": "Snowden, D. and Grasso, A. (2002) Diffusing Information in Organisational Settings: Learning from Experience. In Proceedings of CHI'02, Minneapolis, MA.  ",
      "doi": "10.1145/503376.503435"
    },
    {
      "text": "Streitz, N.A., Geißler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P., and Steinmetz, R. (1999) i-LAND: An interactive Landscape for Creativity and Innovation. In Proceedings of CHI '99, Pittsburgh, PA.  ",
      "doi": "10.1145/302979.303010"
    }
  ]
}