{
  "doi": "10.1145/642611.642670",
  "title": "Mobile computing in the retail arena",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "337-344",
  "year": 2003,
  "badges": [],
  "abstract": "Although PDAs typically run applications in a \"stand-alone\" mode, they are increasingly equipped with wireless communications, which makes them useful in new domains. This capability for more powerful information exchange with larger information systems presents a new situated context for PDA applications, and provides new design and usability evaluation challenges.In this work we examine how grocery shopping could be aided by a mobile shopping application that consumers access via a PDA while in a store. The interactive relationship between the physical space of the store and the human activity of shopping are crucial when designing for this application. To better understand this interaction, we studied people's grocery shopping habits, designed and evaluated prototypes, and performed usability tests within the shopping environment. This paper reveals our design process for this problem and a framework for designing and evaluating situated applications for mobile handhelds.",
  "tags": [
    "mobile interfaces",
    "wireless communication",
    "PDA",
    "situated computing"
  ],
  "authors": [
    {
      "name": "Erica Newcomb",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100281927",
      "orcid": "missing"
    },
    {
      "name": "Toni Pashley",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415136",
      "orcid": "missing"
    },
    {
      "name": "John Stasko",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/do/10.1145/contrib-81100573160/rel-imgonly/stasko-06oct-small.jpg",
      "acmid": "81100573160",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellamy, R., Brezin, J., Kellogg, W.A., Richards, J. and Swart, C. Designing an E-Grocery Application for a Palm Computer: Usability and Interface Issues. IEEE Personal Communications, 8, 4, 60--64, August 2000.]]",
      "doi": ""
    },
    {
      "text": "Lindstrom, Martin. ClickZ© Today. The Race to Map Shopping DNA. Available at http://www.clickz.com/ article/cz.1321.html. 2000.]]",
      "doi": ""
    },
    {
      "text": "Gershman, Anatole V. Situated Computing: An Applications Perspective, CHI 2000 Workshop: Research Directions in Situated Computing, April 2000.]]",
      "doi": ""
    },
    {
      "text": "Hewagamage, K. Priyantha and Hirakawa, Masahito. Situated Computing: A Paradigm to Enhance the Mobile User's Interaction. Handbook of Software Engineering and Knowledge Engineering Vol. 0, No. 0. 2000.]]",
      "doi": ""
    },
    {
      "text": "Klever Marketingπ, Inc. Available at http://www.kleverkart.com. 2001.]]",
      "doi": ""
    },
    {
      "text": "Lave, J. Cognition in Practice. Cambridge University Press, Cambridge, 1988.]]",
      "doi": ""
    },
    {
      "text": "Nardi, Bonnie A. Studying Context: A Comparison of Activity Theory, Situated Action Models, and Distributed Cognition. Context and Consciousness. The MIT Press, Massachusetts, 1996.]]",
      "doi": ""
    },
    {
      "text": "Underhill, Paco. Why We Buy: The Science of Shopping. Simon & Schuster Press, New York, 1999.]] ",
      "doi": "10.5555/1201675"
    }
  ]
}