{
  "doi": "10.1145/642611.642620",
  "title": "Multiple haptic targets for motion-impaired computer users",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "41-48",
  "year": 2003,
  "badges": [],
  "abstract": "Although a number of studies have reported that force feedback gravity wells can improve performance in \"point-and-click\" tasks, there have been few studies addressing issues surrounding the use of gravity wells for multiple on-screen targets. This paper investigates the performance of users, both with and without motion-impairments, in a \"point-and-click\" task when an undesired haptic distractor is present. The importance of distractor location is studied explicitly. Results showed that gravity wells can still improve times and error rates, even on occasions when the cursor is pulled into a distractor. The greatest improvement is seen for the most impaired users. In addition to traditional measures such as time and errors, performance is studied in terms of measures of cursor movement along a path. Two cursor measures, angular distribution and temporal components, are proposed and their ability to explain performance differences is explored.",
  "tags": [
    "motion-impaired",
    "force feedback",
    "cursor control",
    "Wingman"
  ],
  "authors": [
    {
      "name": "Faustina Hwang",
      "institution": "University of Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100582390",
      "orcid": "missing"
    },
    {
      "name": "Simeon Keates",
      "institution": "University of Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100330096",
      "orcid": "missing"
    },
    {
      "name": "Patrick Langdon",
      "institution": "University of Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100182446",
      "orcid": "missing"
    },
    {
      "name": "P. John Clarkson",
      "institution": "University of Cambridge, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100051919",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akamatsu, M., MacKenzie, I. S., and Hasbrouq, T. A comparison of tactile, auditory, and visual feedback in a pointing task using a mouse-type device, Ergonomics 38 (1995), 816--827.",
      "doi": ""
    },
    {
      "text": "Akamatsu, M. and MacKenzie, I. S. Movement characteristics using a mouse with tactile and force feedback, International Journal of Human-Computer Studies 45, (1996), 483--493.  ",
      "doi": "10.1006/ijhc.1996.0063"
    },
    {
      "text": "Dennerlein, J. T., Martin, D. B., and Hasser, C. Force-feedback improves performance for steering and combined steering-targeting tasks. In Proceedings of CHI 2000 (The Hague, 2000), ACM Press, 423--429.  ",
      "doi": "10.1145/332040.332469"
    },
    {
      "text": "Dennerlein, J. T. and Yang, M. C. Haptic force-feedback devices for the office computer: performance and musculoskeletal loading issues, Human Factors 43, 2 (2001), 278--286.",
      "doi": ""
    },
    {
      "text": "Gregor, P., Newell, A. F., and Zajicek, M. Designing for dynamic diversity - interfaces for older people. In Proceedings of ASSETS 2002 (Edinburgh UK, 2002), ACM Press, 151--156.  ",
      "doi": "10.1145/638249.638277"
    },
    {
      "text": "Hasser, C. and Goldenberg, A. User performance in a GUI pointing task with a low-cost force-feedback computer mouse. In Proceedings of the ASME Dynamic Systems and Control Division (1998), American Society of Mechanical Engineers, 151--156.",
      "doi": ""
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P., and Clarkson, P.J. Using cursor measures to determine appropriate computer input assistance for motion-impaired users. To appear in Proceedings of the Annual Conference of the IEEE EMBS 2002 (Houston TX, 2002).",
      "doi": ""
    },
    {
      "text": "Johnson, P.W., Hewes, J., Dropkin, J., and Rempel, D.M. Office ergonomics: motion analysis of computer mouse usage. In Proceedings of the American Industrial Hygiene Association (Fairfax VA, 1993), 12--13.",
      "doi": ""
    },
    {
      "text": "Keates, S., Langdon, P., Clarkson, J., and Robinson, P. Investigating the use of force feedback for motion-impaired users. In Proceedings of the 6th ERCIM Workshop (Florence Italy 2000), 207--212.",
      "doi": ""
    },
    {
      "text": "Keates, S., Hwang, F., Langdon, P., Clarkson, P. J., and Robinson, P. Cursor measures for motion-impaired computer users. In Proceedings of ASSETS 2002 (Edinburgh UK, 2002), ACM Press, 135--142.  ",
      "doi": "10.1145/638249.638274"
    },
    {
      "text": "Langdon, P., Hwang, F., Keates, S., Clarkson, P. J., and Robinson, P. Investigating haptic assistive interfaces for motion-impaired users: Force-channels and competitive attractive-basins. In Proceedings of Eurohaptics 2002 (Edinburgh UK, 2002), 122--127.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Kauppinen, T., and Silfverberg, M. Accuracy measures for evaluating computer pointing devices. In Proceedings of CHI 2001 (Seattle WA, 2001), ACM Press, 9--15.  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "Oakley, I., McGee, M.R., Brewster, S.A. and Gray, P.D. Putting the feel in look and feel. In Proceedings of CHI 2000 (The Hague, 2000), ACM Press, 415--422.  ",
      "doi": "10.1145/332040.332467"
    },
    {
      "text": "Oakley, I., Adams, A., Brewster, S.A. and Gray, P.D. Guidelines for the design of haptic widgets. In Proceedings of BCS HCI 2002 (London UK, 2002), Springer, 195--212.",
      "doi": ""
    },
    {
      "text": "Trewin, S. and Pain, H. Keyboard and mouse errors due to motor disabilities, International Journal of Human-Computer Studies 50, 2 (1999), 109--144.  ",
      "doi": "10.1006/ijhc.1998.0238"
    },
    {
      "text": "Trewin, S. Accelerating assessment with self-optimizing devices. In Proceedings of ICCHP 2002 (Linz Austria, 2002), Springer, 273--275. ",
      "doi": "10.5555/646269.684354"
    },
    {
      "text": "Workforce Investment Act of 1998, Section 508. US Public Law 105-220 (1998).",
      "doi": ""
    }
  ]
}