{
  "doi": "10.1145/642611.642654",
  "title": "Sense and sensibility: evaluation and interactive art",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "241-248",
  "year": 2003,
  "badges": [],
  "abstract": "HCI evaluation methods are useful for improving the design of interactive systems, yet they may be rejected by nontraditional technology disciplines such as media art. We have developed a two-tiered evaluation model that responds to the concerns of interactive artists and have used it to improve the design of an interactive artwork, the Influencing Machine, exploring issues in affective computing. The method was interpretive, focusing on giving the artists a grounded feeling for how the machine was interpreted and their message was communicated. We describe the resulting design of the Influencing Machine and the reactions of users. The study itself is part of the art piece - together these activities achieve the goal of the artists: to provoke our cultural notions of whether a machine can \"have emotions\".",
  "authors": [
    {
      "name": "Kristina Höök",
      "institution": "SICS/Swedish Insitute of Computer Science, Kista, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Phoebe Sengers",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/do/10.1145/contrib-81100397464/rel-imgonly/ditheredhead.jpg",
      "acmid": "81100397464",
      "orcid": "missing"
    },
    {
      "name": "Gerd Andersson",
      "institution": "SICS/Swedish Insitute of Computer Science, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100100427",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beyer, H., & Holzblatt, K. (1998). Contextual Design: Defining Customer-Centered Systems, Morgan Kaufmann Publ. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Dumas, JS, & Redish, J. (1993) A Practical Guide to Usability Testing, Ablex, Norwood, NJ. ",
      "doi": "10.5555/562615"
    },
    {
      "text": "Dunne, A. & Raby, F. (2001). Design Noir: The Secret Life of Electronic Objects. Basel, Switzerland: August/Birkhaeuser.",
      "doi": ""
    },
    {
      "text": "Garabet, A., Mann, S., & Fung, J. (2002) Exploring Design through Wearable Computing Art(ifacts), CHI 2002, Interactive Poster: Fun, 634--635.  ",
      "doi": "10.1145/506443.506520"
    },
    {
      "text": "Gaver, W. & Dunne, A. (1999). Projected Realities: Conceptual Design for Cultural Effect. CHI 1999.  ",
      "doi": "10.1145/302979.303168"
    },
    {
      "text": "Gaver, W., Hooker, B., & Dunne, A. (2001). The Presence Project. London: Royal College of Art.",
      "doi": ""
    },
    {
      "text": "Höök, K. (1998). Evaluating the Utility and Usability of an Adaptive Hypermedia System, in Journal of Knowledge-Based Systems, 10 (5).",
      "doi": "10.1016/S0950-7051%2897%2900034-8"
    },
    {
      "text": "Höök, K., Persson, P., & Sjöölinder, M. (2000). Evaluating Users' Experience of a Character-Enhanced Information Space, J. of AI Communications, 13 (3) 195--212. ",
      "doi": "10.5555/1216435.1216441"
    },
    {
      "text": "Lakoff, G., & Johnson, M. (1980) Metaphors We Live By, The University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Mateas, M. (2001). Expressive AI: A hybrid art and science practice, in Leonardo, 34 (2), 147--153.",
      "doi": ""
    },
    {
      "text": "Nardi, B. (1996). Context and Consciousness: Activity Theory and Human-Computer Interaction, MIT Press. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Oudshoorn, N. (1996) Gender Scripts in Technologie: Noodlot of Uitdaging? Tijdschrift voor Vrouwenstudies, 17(1): 350--367.",
      "doi": ""
    },
    {
      "text": "Penny, S., Smith, J., Sengers, P., Bernhardt, A., & Schulte, J. (2001). Traces: Embodied Immersive Interaction with Semi-Autonomous Avatars, in Convergence, 7:2, 47--65.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Liesendahl, R., Magar, W., Seibert, C., Müller, B., Joachims, T., Geng, W., Mårtensson, P., & Hööök, K. (2002) Enigmatics of Affect, Proc of Designing Interactive Systems, ACM Press.  ",
      "doi": "10.1145/778712.778728"
    },
    {
      "text": "Weiser, M. & Seely Brown, J. (1996). Designing Calm Technology, in PowerGrid Journal, 1(1).",
      "doi": ""
    }
  ]
}