{
  "doi": "10.1145/642611.642622",
  "title": "Semi-public displays for small, co-located groups",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "49-56",
  "year": 2003,
  "badges": [],
  "abstract": "The majority of systems using public displays to foster awareness have focused on providing information across remote locations or among people who are loosely connected and lack awareness of each other's activities or interests. We have, however, identified many potential benefits for an awareness system that displays information within a small, co-located group in which the members already possess some awareness of each other's activities. By using \"Semi-Public Displays,\" public displays scoped for small groups, we can make certain types of information visible in the environment, promoting collaboration and providing lightweight information about group activity. Compared to designing for large, loosely connected groups, designing for Semi-Public Displays mitigates typically problematic issues in sustaining relevant content for the display and minimizing privacy concerns. We are using these applications to support and enhance the interactions and information that group members utilize to maintain awareness and collaborate.",
  "authors": [
    {
      "name": "Elaine M. Huang",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100080130",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bly, S., Harrison, S., Irwin, S. Media Spaces: Bringing People Together in a Video, Audio, and Computing Environment. In Communications of the ACM, Volume 36, Issue 1, January 1993, 28--46.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Cadiz, J., Venolia, G., Jancke, G., Gupta, A. Designing and Deploying an Information Awareness Interface. In Proceedings of CSCW 2002.  ",
      "doi": "10.1145/587078.587122"
    },
    {
      "text": "Dourish, P., Bly, S. Portholes: Supporting Awareness in a Distributed Work Group. In Proceedings of CHI 1992, ACM Press, 541--547.  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Farrell, S. Social and Informational Proxies in a Fishtank. In CHI 2001 Extended Abstracts, ACM Press, 365--366.  ",
      "doi": "10.1145/634067.634283"
    },
    {
      "text": "Fass, A., Forlizzi, J. Pausch, R. MessyDesk and MessyBoard: two Designs Inspired By the Goal of Improving Human Memory. In Proceedings of Designing Interactive Systems (DIS) 2002, 303--311.  ",
      "doi": "10.1145/778712.778754"
    },
    {
      "text": "Fitzpatrick, G., Kaplan, S. Mansfield, T., Arnold D., Segall B. Supporting public availability and accessibility with Elvin: Experiences and reflections. In Computer Supported Cooperative Work: the Journal of Collaborative Computing (To Appear).  ",
      "doi": "10.1023/A%3A1021226206564"
    },
    {
      "text": "Greenberg, S., Rounding, M. The Notification Collage. In Proceedings of CHI 2001, ACM Press, 514--521.  ",
      "doi": "10.1145/365024.365339"
    },
    {
      "text": "Grudin, J., Palen, L. Emerging Groupware Successes in Major Corporations: Studies of Adoption and Adaptation. In Proceedings of WWCA 1997, 142--153. ",
      "doi": "10.5555/645965.674402"
    },
    {
      "text": "Hong, J., Landay, J. SATIN: A Toolkit for Informal Ink-based Applications. In Proceedings of UIST 2000, ACM Symposium on User Interface Software and Technology, CHI Letters 2(2), p. 63--72.  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "Huang, E., Terry, M., Mynatt, E., Lyons, K., Chen, A. Distributing Event Information by Simulating Word-of-Mouth Exchanges, In Proceedings of Mobile HCI 2002 Symposium. ",
      "doi": "10.5555/645739.666600"
    },
    {
      "text": "Isaacs, E., Tang, J., Morris, T. Piazza: A Desktop Environment Supporting Impromptu and Planned Interactions. In Proceedings of CSCW 1996, ACM Press, 315--324.  ",
      "doi": "10.1145/240080.240316"
    },
    {
      "text": "Jancke, G., Venolia, G., Grudin, J., Cadiz, J., Gupta, A. Linking Public Spaces: Technical and Social Issues. In Proceedings of CHI 2001, ACM Press, 530--537.  ",
      "doi": "10.1145/365024.365352"
    },
    {
      "text": "McCarthy, J., Costa, T., Liongosari, E. UniCast, OutCast & GroupCast: Three Steps Toward Ubiquitous, Peripheral Displays. In Proceedings of Ubicomp 2001, 332--345. ",
      "doi": "10.5555/647987.741333"
    },
    {
      "text": "Neustaedter, C., Greenberg, S. Supporting Coherence with a 3D Instant Messenger Visualization. Position Paper presented at ACM CHI 2002 Workshop on Discourse Architectures.",
      "doi": ""
    },
    {
      "text": "Pedersen, E., Sokoler, T. AROMA: Abstract Representation of Presence Supporting Mutual Awareness. In Proceedings of CHI 1997, ACM Press, 51--58.  ",
      "doi": "10.1145/258549.258584"
    },
    {
      "text": "Russell, D. Gossweiler, R. On the Design of Personal & Communal Larger Information Scale Appliances. In Proceedings of Ubicomp 2001, 354--361. ",
      "doi": "10.5555/647987.757257"
    },
    {
      "text": "Smith, I., Hudson, S. Techniques for Addressing Fundamental Privacy and Disruption Tradeoffs in Awareness Support Systems. In Proceedings of CSCW 1996, ACM Press, 248--257.  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Tang, J., Yankelovich, N., Begole, J., Van Kleek, M., Li, F, Bhalodia, J. ConNexus to Awarenex: Extending Awareness to Mobile Users. In Proceedings of CHI 2001, ACM Press, 221--228.  ",
      "doi": "10.1145/365024.365105"
    },
    {
      "text": "Zhao, Q.A., Stasko, J. T. What's Happening?: Promoting Community Awareness through Opportunistic, Peripheral Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI 2002), 69--74.  ",
      "doi": "10.1145/1556262.1556271"
    }
  ]
}