{
  "doi": "10.1145/642611.642701",
  "title": "Effects of head-mounted and scene-oriented video systems on remote collaboration on physical tasks",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "513-520",
  "year": 2003,
  "badges": [],
  "abstract": "This study assessed the value of two video configurations-a head-mounted camera with eye tracking capability and a scene camera providing a view of the work environment-on remote collaboration on physical (3D) tasks. Pairs of participants performed five robot construction tasks in five media conditions: side-by-side, audio-only, head-mounted camera, scene camera, and scene plus head cameras. Task completion times were shortest in the side-by-side condition, and shorter with the scene camera than in the audio-only condition. Participants rated their work quality highest when side-by-side, intermediate with the scene camera, and worst in the audio-only and head-camera conditions. Similarly, helpers' self-rated ability to assist workers and pairs' communication efficiency were highest in the side-by-side condition, but significantly higher with the scene camera than in the audio-only condition. The results demonstrate the value of a shared view of the work environment for remote collaboration on physical tasks.",
  "tags": [
    "video-conferencing"
  ],
  "authors": [
    {
      "name": "Susan R. Fussell",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    },
    {
      "name": "Leslie D. Setlock",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057970",
      "orcid": "missing"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    }
  ],
  "references": [
    {
      "text": "Clark, H. H. (1996). Using language. Cambridge, UK: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Clark, H. H. & Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, R. M. Levine, & S. D. Teasley (Eds.). Perspectives on socially shared cognition (pp. 127--149). Washington, DC: APA",
      "doi": ""
    },
    {
      "text": "Clark, H. H. & Marshall, C. E. (1981). Definite reference and mutual knowledge. In A. K. Joshi, B. L. Webber & I. A. Sag (Eds.), Elements of discourse understanding (pp. 10--63). Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Clark, H. & Wilkes-Gibbs, D. (1986). Referring as a collaborative process. Cognition, 22, 1--39.",
      "doi": ""
    },
    {
      "text": "Daly-Jones, O., Monk, A. & Watts, L. (1998). Some advantages of video conferencing over high-quality audio conferencing: fluency and awareness of attentional focus. International Journal of Human-Computer Studies, 49, 21--58.  ",
      "doi": "10.1006/ijhc.1998.0195"
    },
    {
      "text": "Endsley, M. (1995). Toward a theory of situation awareness in dynamic systems. Human Factors, 37, 32--64.",
      "doi": ""
    },
    {
      "text": "Ford, C. E. (1999). Collaborative construction of task activity: Coordinating multiple resources in a high school physics lab. Research on Language and Social Interaction, 32, , 369--408.",
      "doi": ""
    },
    {
      "text": "Fussell, S. R., Kraut, R. E., & Siegel, J. (2000). Coordination of communication: Effects of shared visual context on collaborative work. Proceedings of CSCW 2000 (pp. 21--30). NY: ACM Press.  ",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "Gaver, W., Sellen, A., Heath, C., & Luff, P. One is not enough: Multiple views in a media space. Interchi '93 (335--341). NY: ACM Press.  ",
      "doi": "10.1145/169059.169268"
    },
    {
      "text": "Goodwin, C. (1996). Professional vision. American Anthropologist, 96, 606--633.",
      "doi": ""
    },
    {
      "text": "Isaacs, E., & Clark, H. H. (1987). References in conversation between experts and novices. J. of Experimental Psychology: General, 116, 26--37.",
      "doi": ""
    },
    {
      "text": "Jefferson, G. (1972). Side sequences. In D. Sudnow (Ed.)Studies in social interaction (pp. 294--338). NY: Free Press.",
      "doi": ""
    },
    {
      "text": "Karsenty, L. (1999). Cooperative work and shared visual context: An empirical study of comprehension problems in side-by-side and remote help dialogues. Human-Computer Interaction, 14, 283--315.  ",
      "doi": "10.1207/S15327051HCI1403_2"
    },
    {
      "text": "Kraut, R. E., Fussell, S. R., & Siegel, J. (in press). Visual information as a conversational resource in collaborative physical tasks. Human-Computer Interaction.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "Kraut, R. E., Fussell, S. R., Brennan, S., & Siegel, J. (2002). A framework for understanding effects of proximity on collaboration: Implications for technologies to support remote collaborative work. P. Hinds & S. Kiesler (Eds.), Technology and Distributed Work. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., Gergle, D., & Fussell, S. R. (2002). The use of visual information in shared visual spaces: Informing the development of virtual co-presence. Proceedings of CSCW 2002.  ",
      "doi": "10.1145/587078.587084"
    },
    {
      "text": "Kraut, R. E., Miller, M. D., & Siegel, J. (1996) Collaboration in performance of physical tasks: Effects on outcomes and communication, Proceedings of CSCW'96 (57--66). NY: ACM Press.  ",
      "doi": "10.1145/240080.240190"
    },
    {
      "text": "Kuzuoka, H. (1992). Spatial workspace collaboration: A Sharedview video support system for remote collaboration capability. Proceedings of CHI'92 (533--540). NY: ACM Press.  ",
      "doi": "10.1145/142750.142980"
    },
    {
      "text": "MacWhinney, B. (1995). The CHILDES Project: Tools for Analyzing Talk. Second edition. Hillsdale, NJ: Erlbaum. http://childes.psy.cmu.edu/",
      "doi": ""
    },
    {
      "text": "Nardi, B., Schwarz, H., Kuchinsky, A., Leichner, R., Whittaker, S. & Sclabassi, R. (1993). Turning away from talking heads: The use of video-as-data in neurosurgery. Proceedings of Interchi '93 (327--334). NY: ACM Press.  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Tang, J. C. (1991). Findings from observational studies of collaborative work. International Journal of Man-Machine Studies, 34, 143--160.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    }
  ]
}