{
  "doi": "10.1145/642611.642652",
  "title": "Design-oriented human-computer interaction",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "225-232",
  "year": 2003,
  "badges": [],
  "abstract": "We argue that HCI has emerged as a design-oriented field of research, directed at large towards innovation, design, and construction of new kinds of information and interaction technology. But the understanding of such an attitude to research in terms of philosophical, theoretical, and methodological underpinnings seems however relatively poor within the field. This paper intends to specifically address what design 'is' and how it is related to HCI. First, three candidate accounts from design theory of what design 'is' are introduced; the conservative, the romantic, and the pragmatic. By examining the role of sketching in design, it is found that the designer becomes involved in a necessary dialogue, from which the design problem and its solution are worked out simultaneously as a closely coupled pair. In conclusion, it is proposed that we need to acknowledge, first, the role of design in HCI conduct, and second, the difference between the knowledge-generating Design-oriented Research and the artifact-generating conduct of Research-oriented Design.",
  "authors": [
    {
      "name": "Daniel Fallman",
      "institution": "Umea University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100018490",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. Notes on the Synthesis of Form. Harvard University Press, Cambridge MA, 1964.",
      "doi": ""
    },
    {
      "text": "Alexander, C. The State of the Art in Design Methods. DMG Newsletter 5(3), 1971, 1--7.",
      "doi": ""
    },
    {
      "text": "Arnheim, R. Sketching and the Psychology of Design. In Margolin, V. & Buchanan, R. (Eds.) The Idea of Design. MIT Press, Cambridge MA, 1995.",
      "doi": ""
    },
    {
      "text": "Black A, Visible Planning on Paper and on Screen. Behavior and Info. Technology 9(4), 1990, 283--296.",
      "doi": ""
    },
    {
      "text": "Broadbent, G. Design in Architecture. John Wiley & Sons, New York NY, 1973.",
      "doi": ""
    },
    {
      "text": "Broadbent, G. The Development of Design Methods. Design Methods and Theories 13(1), 1979, 41--45.",
      "doi": ""
    },
    {
      "text": "Brockman, J. The Third Culture: Beyond the Scientific Revolution. Simon & Schuster, New York NY, 1995.",
      "doi": ""
    },
    {
      "text": "Coyne, R. Designing Information Technology in the Postmodern Age. MIT Press, Cambridge MA, 1995. ",
      "doi": "10.5555/212656"
    },
    {
      "text": "Coyne, R. Technoromanticism: Digital Narrative, Holism, and the Romance of the Real. MIT Press, Cambridge MA, 1999. ",
      "doi": "10.5555/318919"
    },
    {
      "text": "Coyne, R. & Adrian, S. Is Designing Mysterious? Challenging the Dual Knowledge Thesis. Design Studies, Vol. 12, No. 3, 1991, 124--131.",
      "doi": ""
    },
    {
      "text": "Cross, N. (Ed.) Developments in Design Methodology. John Wiley & Sons, Chichester UK, 1984.",
      "doi": ""
    },
    {
      "text": "Dorst, K. & Dijkhuis, J. Comparing Paradigms for Describing Design Activity. Design Studies, 16, 1995, 261--274.",
      "doi": ""
    },
    {
      "text": "Ehn, P. Work-oriented Design of Computer Artifacts. Arbetslivscentrum, Falköping Sweden, 1988. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Gedenryd, H. How Designers Work. Ph.D. Thesis, University of Lund, Lund Sweden, 1998.",
      "doi": ""
    },
    {
      "text": "Goldschmidt, G. The Dialectics of Sketching, Design Studies, Vol. 4, No. 2, 1991, 123--143.",
      "doi": ""
    },
    {
      "text": "Houde, S. & Hill, C. What do Prototypes Prototype?. In Helander, M., Landauer, T. K., & Prabhu, P. (Eds.) Handbook of Human--Computer Interaction. 2nd Ed, Elsevier Science, Amsterdam Netherlands, 1997.",
      "doi": ""
    },
    {
      "text": "Ihde, D. Instrumental Realism. Indiana University Press, Bloomington IN, 1991.",
      "doi": ""
    },
    {
      "text": "Ihde, D. Postphenomenology. North Western University Press, Evanston IL, 1993.",
      "doi": ""
    },
    {
      "text": "Jones, J. C. A Method of Systematic Design. In Jones, J. C. & Thornley, D. (Eds.) Conference on Design Methods, Pergamon Press, Oxford UK, 1963.",
      "doi": ""
    },
    {
      "text": "Jones, J. C. Design Methods. Van Nostrand Reinhold, New York NY, 1970.",
      "doi": ""
    },
    {
      "text": "Kuhn, T. S. The Structure of Scientific Revolutions. University of Chicago Press, Chicago IL, 1962.",
      "doi": ""
    },
    {
      "text": "Lawson. B. How Designers Think. Butterworth Architecture, Oxford UK, 1980.",
      "doi": ""
    },
    {
      "text": "Lévi-Strauss, C. The Savage Mind. Transl. Weidenfeld, G., University of Chicago Press, Chicago IL, 1966.",
      "doi": ""
    },
    {
      "text": "Louridas, P. Design as Bricolage: Anthropology meets Design Thinking. Design Studies, Vol. 20, No. 6, 1999, 517--535.",
      "doi": ""
    },
    {
      "text": "Löwgren, J. Applying Design Methodology to Software Development. (DIS'95, Ann Arbor) ACM Press, New York NY, 1995, 87--95.  ",
      "doi": "10.1145/225434.225444"
    },
    {
      "text": "Löwgren, J. & Stolterman, E. Design Methodology and Design Practice. interactions, 1, 1999, 13--20.  ",
      "doi": "10.1145/291224.291233"
    },
    {
      "text": "Nelson, H. & Stolterman, E. The Design Way.(In Press).",
      "doi": ""
    },
    {
      "text": "Newell, A. & Simon, H. A. Human Problem Solving. Prentice-Hall, Englewood Cliffs NJ, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Parnas, D. L. & Clements, P. C. A Rational Design Process: How and Why to Fake It. IEEE Transactions on Software Engineering 12(2), 1986, 251--257. ",
      "doi": "10.5555/9794.9800"
    },
    {
      "text": "Rittel, H. W. J. Second-generation Design Methods. The DMG 5th Anniversary Report, DMG Occasional Paper No. 1, 1972, 5--10.",
      "doi": ""
    },
    {
      "text": "Schön, D. The Reflective Practitioner: How Professionals Think in Action. Basic Books, New York NY, 1983.",
      "doi": ""
    },
    {
      "text": "Schön, D. Educating the Reflective Practitioner. Jossey-Bass, San Francisco CA, 1987.",
      "doi": ""
    },
    {
      "text": "Schön, D. Designing as Reflective Conversation with the Materials of a Design Situation. Knowledge-Based Systems, 5, 1992, 3--14.",
      "doi": "10.1016/0950-7051%2892%2990020-G"
    },
    {
      "text": "Simon, H. A. The Sciences of the Artificial. MIT Press, Cambridge MA, 1969. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Stolterman, E. Guidelines or Aesthetics: Design Learning Strategies. Design Studies,Vol.15, No.4, 1994.",
      "doi": ""
    },
    {
      "text": "Stolterman, E. The Design of Information Systems: Parti, Formats and Sketching. Information Systems Journal, Vol. 9, No. 1, 1999.",
      "doi": ""
    },
    {
      "text": "Winograd, T., Bennett, J., De Young, L., & Hartfield, B. (Eds.) Bringing Design to Software. ACM Press, New York NY, 1996. ",
      "doi": ""
    }
  ]
}