{
  "doi": "10.1145/642611.642639",
  "title": "Usability and biometric verification at the ATM interface",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "153-160",
  "year": 2003,
  "badges": [],
  "abstract": "This paper describes some of the consumer-driven usability research conducted by NCR Self Service Strategic Solutions in the development of an understanding of usability and user acceptance of leading-edge biometrics verification techniques. We discuss biometric techniques in general and focus upon the usability phases and issues, associated with iris verification technology at the Automated Teller Machine (ATM) user interface. The paper concludes with a review of some of the major research issues encountered, and an outline of future work in the area.",
  "authors": [
    {
      "name": "Lynne Coventry",
      "institution": "Advanced Technology and Research, NCR Financial Solutions Division, Dundee, DD2 4SW",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100191442",
      "orcid": "missing"
    },
    {
      "name": "Antonella De Angeli",
      "institution": "Advanced Technology and Research, NCR Financial Solutions Division, Dundee, DD2 4SW",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647415",
      "orcid": "missing"
    },
    {
      "name": "Graham Johnson",
      "institution": "Advanced Technology and Research, NCR Financial Solutions Division, Dundee, DD2 4SW",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100449044",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A. and Chang, S.Y. An investigation of keypad interface security. Information & Management, 24, 53--59, 1993.  ",
      "doi": "10.1016/0378-7206%2893%2990054-W"
    },
    {
      "text": "Adams, A. and Sasse, M.A. Users are not the enemy. Communications of the ACM, 42, 41--46, 1999.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Ashbourn, J. Biometrics. Advanced Identity Verification. Springer Verlag, London, 2000. ",
      "doi": "10.5555/355320"
    },
    {
      "text": "Clarke, R. Human Identification in Information Systems: Management Challenges and Public Policy Issues. Information technology and People, 74, 6--37, 1994.",
      "doi": ""
    },
    {
      "text": "Coventry, L., De Angeli, A., and Johnson, G. Biometric verification at a self service interface. Proceedings of the British Ergonomic Society Conference (Edinburgh April 2003), Contemporary Ergonomics (to be published).",
      "doi": ""
    },
    {
      "text": "Davies, S.G. How biometrics will fuse flesh and machine, Information Technology and People, 7,4, 1994.",
      "doi": ""
    },
    {
      "text": "De Angeli, A., Coutts, M. Coventry, L., Johnson, G.I, Cameron D., and Fischer M. VIP: a visual approach to user authentication. Proceedings of the Working Conference on Advanced Visual Interfaces AVI 2002, ACM Press, pp. 316--323, 2002.  ",
      "doi": "10.1145/1556262.1556312"
    },
    {
      "text": "Deane, F.P., Barelle K., Henderson R.D. and Mahar D.P., Employee acceptance of computerised biometrics security systems, Computers and Security, 14, 225--231, 1995.",
      "doi": "10.1016/0167-4048%2895%2900005-S"
    },
    {
      "text": "Deane, F.P., Henderson R.D., Mahar D.P. and Saliba A.J. Theoretical examination of the effects of anxiety and electronic performance monitoring on biometric security systems, Interacting with Computers, 7, 395--411, 1995.",
      "doi": ""
    },
    {
      "text": "Dhamija, R. & Perrig, A. Dééjà vu: A User Study Using Images for Authentication. In Proceedings of 9th USENIX Security Symposium, August 2000. ",
      "doi": "10.5555/1251306.1251310"
    },
    {
      "text": "Feustal, T.C. and Velius, G.A. Speaker identity verification over telephone lines: Where we are and where we are going. Proceedings of the 1989 International Carahan conference on security technology, (3-5 Oct), 181--182, 1989.",
      "doi": ""
    },
    {
      "text": "Gong, L., Lomas, M.A., Needham, R.M. and Saltzer, J.H. Protecting poorly chosen secrets from guessing attacks. IEEE J. on Selected Areas in Communications, 11(5), 648--656, 1993.",
      "doi": "10.1109/49.223865"
    },
    {
      "text": "Hide, S. Haslegrave, C.M. Hopkinson, N., Robertson D. and Johnson G.I. Tracking eye positions during the use of an Automatic Teller Machine (ATM), Proceedings of CAES '99, May: Barcelona, Spain. 1999.",
      "doi": ""
    },
    {
      "text": "Mansfield, A.J. & Wayman, J.L. Best Practices in Testing and Reporting Performance of Biometric Devices. NPL Report CMSC 14/02 August 2002.",
      "doi": ""
    },
    {
      "text": "Mansfield, A.J., Kelly, G., Chandler, P. and Kane, J. Biometric product testing final report. www.cesg.gov.uk/technology/biometrics, March 2001.",
      "doi": ""
    },
    {
      "text": "Negin, M., Chmielewski, T.A., Salganicoff, M., Camus, T.A., Cahn von Seelen, M.M., Venetianer, P.L. and Zhang, G.G. An iris biometric system for public and personal use. Computer, 33,2, 70--75, 2000.  ",
      "doi": "10.1109/2.820042"
    },
    {
      "text": "Phillips, P.J., Martin, A., Wilson, C.L. and Prozybocki, M. An introduction to evaluating biometric systems, Computer, 33,2, 56--62, 2000.  ",
      "doi": "10.1109/2.820040"
    },
    {
      "text": "Scholtz, J. and Johnson, J. Interacting with identification technology: Can it make us more secure? CHI2002 Extended Abstracts, ACM Press, 2002.  ",
      "doi": "10.1145/506443.506484"
    },
    {
      "text": "Thalheim, L., Krissler, J. and Ziegler, P.M. Bodycheck: Biometric access protection devices and their programs put to the test. C'T, 11, May 22, 2002 (www.heise.de/ct/english/02/11/114/)",
      "doi": ""
    },
    {
      "text": "Westin, A. Biometrics in the mainstream: What does the U.S. public think. Privacy and American Business Newsletter, 9,8, December 2002.",
      "doi": ""
    },
    {
      "text": "Woodward. J.D. Biometrics: Privacy's Foe or Privacy's Friend? Proceedings of IEEE, 85, 9, pp 1480--1492, 1997.",
      "doi": ""
    },
    {
      "text": "Yan, J., Blackwell, A., Anderson, R. and Grant, A. The memorability and security of passwords - Some empirical results. Technical Report No. 500 2001, Computer Laboratory University of Cambridge, http://www.ftp.cl.cam.ac.uk/ftp/users/rja14/tr500.pdf, 2001.",
      "doi": ""
    }
  ]
}