{
  "doi": "10.1145/642611.642681",
  "title": "Faceted metadata for image search and browsing",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "401-408",
  "year": 2003,
  "badges": [],
  "abstract": "There are currently two dominant interface types for searching and browsing large image collections: keyword-based search, and searching by overall similarity to sample images. We present an alternative based on enabling users to navigate along conceptual dimensions that describe the images. The interface makes use of hierarchical faceted metadata and dynamically generated query previews. A usability study, in which 32 art history students explored a collection of 35,000 fine arts images, compares this approach to a standard image search interface. Despite the unfamiliarity and power of the interface (attributes that often lead to rejection of new search interfaces), the study results show that 90% of the participants preferred the metadata approach overall, 97% said that it helped them learn more about the collection, 75% found it more flexible, and 72% found it easier to use than a standard baseline system. These results indicate that a category-based approach is a successful way to provide access to image collections.",
  "tags": [
    "faceted metadata",
    "image search interfaces"
  ],
  "authors": [
    {
      "name": "Ka-Ping Yee",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100560074",
      "orcid": "missing"
    },
    {
      "name": "Kirsten Swearingen",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100563089",
      "orcid": "missing"
    },
    {
      "name": "Kevin Li",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100475948",
      "orcid": "missing"
    },
    {
      "name": "Marti Hearst",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L. H. Armitage and P. G. B. Enser. Analysis of user need in image archives. Journal of Information Science, 23(4):287--299, 1997.]]",
      "doi": ""
    },
    {
      "text": "M. L. Bernard. Examining the effects of hypertext shape on user performance. Usability News, 4(2), 2002.]]",
      "doi": ""
    },
    {
      "text": "P. Borland and P. Ingwersen. The development of a method for the evaluation of interactive information retrieval systems. Journal of Documentation, 53(3):225--250, 1997.]]",
      "doi": ""
    },
    {
      "text": "C. Carson, M. Thomas, S. Belongie, J. M. Hellerstein, and J. Malik. Blobworld: {A system for region-based image indexing and retrieval. In Third International Conference on Visual Information Systems, 1999.]] ",
      "doi": "10.5555/647060.714153"
    },
    {
      "text": "A. M. Elliott. Computational Support for Sketching and Image Sorting During the Early Phase of Architectural Design. Ph.D. dissertation, University of California, Berkeley, 2002.]] ",
      "doi": "10.5555/937086"
    },
    {
      "text": "C. Fellbaum, editor. WordNet: An Electronic Lexical Database. MIT Press, 1998.]]",
      "doi": ""
    },
    {
      "text": "S. R. Garber and M. B. Grunes. The art of search: A study of art directors. In Proc. of CHI-92, Monterey, CA, 1992.]]  ",
      "doi": "10.1145/142750.142780"
    },
    {
      "text": "M. Hearst, J. English, R. Sinha, K. Swearingen, and K.-P. Yee. Finding the flow in web site search. Communications of the ACM, 45(9), September 2002.]]  ",
      "doi": "10.1145/567498.567525"
    },
    {
      "text": "J. M. Jose, J. Furner, and D. J. Harper. Spatial querying for image retrieval: a user-oriented evaluation. In Proceedings of ACM SIGIR '98, pages 232--240, 1998.]]  ",
      "doi": "10.1145/290941.291000"
    },
    {
      "text": "M. Markkula and E. Sormunen. End-user searching challenges indexing practices in the digital newspaper photo archive. Information Retrieval, 1:259--285, 2000.]]  ",
      "doi": "10.1023/A%3A1009995816485"
    },
    {
      "text": "J. Muramatsu and W. Pratt. Transparent queries: Investigating users' mental models of search engines. In Research and Development in Information Retrieval, pages 217--224, 2001.]]  ",
      "doi": "10.1145/383952.383991"
    },
    {
      "text": "W. Niblack, R. Barber, W. Equitz, M. Flickner, E. Glasman, D. Petkovic, P. Yanker, and C. Faloutsos. The QBIC project: Querying images by content using color, texture, and shape. SPIE: Storage and Retrieval for Image and Video Databases, 1908, 1993.]]",
      "doi": ""
    },
    {
      "text": "M. Ortega, Y. Rui, K. Chakrabarti, S. Mehrotra, and T. S. Huang. Supporting similarity queries in MARS. In ACM Multimedia, pages 403--413, 1997.]]  ",
      "doi": "10.1145/266180.266394"
    },
    {
      "text": "C. Plaisant, B. Shneiderman, K. Doan, and T. Bruns. Interface and data architecture for query preview in networked information systems. ACM Transactions on Information Systems, 17(3):320--341, 1999.]]  ",
      "doi": "10.1145/314516.314522"
    },
    {
      "text": "K. Rodden, W. Basalaj, D. Sinclair, and K. R. Wood. Does organisation by similarity assist image browsing? In Proceedings of ACM SIGCHI 2001, pages 190--197, 2001.]]  ",
      "doi": "10.1145/365024.365097"
    },
    {
      "text": "B. Shneiderman, D. Byrd, and W. B. Croft. Sorting out searching: A user-interface framework for text searches. Communications of the ACM, 41(4):95--98, 1998.]]  ",
      "doi": "10.1145/273035.273069"
    },
    {
      "text": "R. K. Srihari, Z. Zhang, and A. Rao. Intelligent indexing and semantic retrieval of multimodal documents. Information Retrieval, 2(2/3):245--275, 2000.]]  ",
      "doi": "10.1023/A%3A1009962928226"
    },
    {
      "text": "R. C. Veltkamp and M. Tanase. Content-Based Image Retrieval Systems: A Survey. Technical Report UU-CS-2000-34, Dept. of Computing Science, Utrecht University, 2000.]]",
      "doi": ""
    }
  ]
}