{
  "doi": "10.1145/642611.642686",
  "title": "The mad hatter's cocktail party: a social mobile audio space supporting multiple simultaneous conversations",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "425-432",
  "year": 2003,
  "badges": [],
  "abstract": "This paper presents a mobile audio space intended for use by gelled social groups. In face-to-face interactions in such social groups, conversational floors change frequently, e.g., two participants split off to form a new conversational floor, a participant moves from one conversational floor to another, etc. To date, audio spaces have provided little support for such dynamic regroupings of participants, either requiring that the participants explicitly specify with whom they wish to talk or simply presenting all participants as though they are in a single floor. By contrast, the audio space described here monitors participant behavior to identify conversational floors as they emerge. The system dynamically modifies the audio delivered to each participant to enhance the salience of the participants with whom they are currently conversing. We report a user study of the system, focusing on conversation analytic results.",
  "tags": [
    "audio space",
    "floor management",
    "conversation analysis"
  ],
  "authors": [
    {
      "name": "Paul M. Aoki",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100590142/rel-imgonly/pma-square.jpg",
      "acmid": "81100590142",
      "orcid": "missing"
    },
    {
      "name": "Matthew Romaine",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100185743",
      "orcid": "missing"
    },
    {
      "name": "Margaret H. Szymanski",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343506379",
      "orcid": "missing"
    },
    {
      "name": "James D. Thornton",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343506925",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wilson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100531718",
      "orcid": "missing"
    },
    {
      "name": "Allison Woodruff",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327302",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S. et al., \"Hanging on the 'Wire: A Field Study of an Audio-Only Media Space,\" ACM TOCHI 4 (1997), 39--66.  ",
      "doi": "10.1145/244754.244756"
    },
    {
      "text": "Berc, L., Gajewska, H. and Manasse, M., \"Pssst: Side Conversations in the Argo Telecollaboration System,\" Proc. ACM UIST, 1995, 155--156.  ",
      "doi": "10.1145/215585.215968"
    },
    {
      "text": "Bly, S.A., Harrison, S.R. and Irwin, S., \"Media Spaces: Bringing People Together in a Video, Audio, and Computing Environment,\" CACM 36 (1993), 28--47.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Bregman, A.S., Auditory Scene Analysis, MIT Press, Cambridge, MA, 1990.",
      "doi": ""
    },
    {
      "text": "Coates, J., Women Talk: Conversation Between Women Friends, Blackwell, Oxford, 1996.",
      "doi": ""
    },
    {
      "text": "Cohen, M. and Ludwig, L.F., \"Multidimensional Audio Window Management,\" Int'l J. Man-Machine Studies 34 (1991), 319--336.  ",
      "doi": "10.1016/0020-7373%2891%2990023-Z"
    },
    {
      "text": "Dourish, P. and Bellotti, V., \"Awareness and Coordination in Shared Workspaces,\" Proc. ACM CSCW Conf., 1992, 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Edelsky, C., \"Who's Got the Floor?\" Language in Society 10 (1981), 383--421.",
      "doi": ""
    },
    {
      "text": "Egbert, M.M., \"Schisming: The Collaborative Transformation from a Single Conversation to Multiple Conversations,\" Research on Language & Social Interaction 30 (1997), 1--51.",
      "doi": ""
    },
    {
      "text": "Ito, M. \"Mobile Phones, Japanese Youth, and the Re-placement of Social Contact,\" Proc. Ann. Mtg. Society for Social Studies of Science (4S), 2001.",
      "doi": ""
    },
    {
      "text": "Ling, R. and Yttri, B., \"Hyper-coordination via Mobile Phones in Norway,\" in Perpetual Contact, J.E. Katz and M.A. Aakhus (eds.), Cambridge Univ. Press, Cambridge, 2002, 139--169. ",
      "doi": "10.5555/644547.644558"
    },
    {
      "text": "Morgan, N. et al., \"The Meeting Project at ICSI,\" Proc. 1st HLT Conf., Morgan Kaufmann, San Francisco, CA, 2001, 246--252.  ",
      "doi": "10.3115/1072133.1072203"
    },
    {
      "text": "Patterson, E.S., Watts-Perotti, J. and Woods, D.D., \"Voice Loops as Coordination Aids in Space Shuttle Mission Control,\" CSCW 8 (1999), 353--371.  ",
      "doi": "10.1023/A%3A1008722214282"
    },
    {
      "text": "Rodenstein, R. and Donath, J.S., \"Talking in Circles: Designing a Spatially-Grounded Audioconferencing Environment,\" Proc. ACM SIGCHI Conf., 2000, 81--87.  ",
      "doi": "10.1145/332040.332410"
    },
    {
      "text": "Rohlicek, J.R. et al., \"Gisting Conversational Speech,\" Proc. ICASSP (Vol. II), 1992, 113--116.",
      "doi": ""
    },
    {
      "text": "Sacks, H., \"Notes on Methodology,\" in Structures of Social Action, J.M. Atkinson and J. Heritage (eds.), Cambridge Univ. Press, Cambridge, 1984, 21--27.",
      "doi": ""
    },
    {
      "text": "Sacks, H., Schegloff, E.A. and Jefferson, G., \"A Simplest Systematics for the Organization of Turn-Taking for Conversation,\" Language 50 (1974), 696--735.",
      "doi": ""
    },
    {
      "text": "Sawhney, N. and Schmandt, C., \"Nomadic Radio: Speech and Audio Interaction for Contextual Messaging in Nomadic Environments,\" ACM TOCHI 7 (2001), 353--383.  ",
      "doi": "10.1145/355324.355327"
    },
    {
      "text": "Schegloff, E.A., Jefferson, G. and Sacks, H., \"The Preference for Self Correction in the Organization of Repair of Conversation,\" Language 53 (1977), 361--382.",
      "doi": ""
    },
    {
      "text": "Schmandt, C. et al., \"Mediated Voice Communication via Mobile IP,\" Proc. ACM UIST, 2002, 141--150.  ",
      "doi": "10.1145/571985.572005"
    },
    {
      "text": "Sellen, A.J., \"Remote Conversations: The Effect of Mediating Talk with Technology,\" Human-Computer Interaction 10 (1995), 401--444.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Strub, H., \"ConcertTalk: A Weekend with a Portable Audio Space,\" Proc. IFIP INTERACT Conf., Chapman & Hall, London, 1997, 381--388. ",
      "doi": "10.5555/647403.723820"
    },
    {
      "text": "Thomason, W.R. and Hopper, R., \"Pauses, Transition Relevance, and Speaker Change,\" Human Communication Research 18 (1992), 429--444.",
      "doi": ""
    },
    {
      "text": "Traum, D. and Rickel, J., \"Embodied Agents for Multi-Party Dialogue in Immersive Virtual Worlds,\" Proc. 1st AAMAS Conf. (Vol. 2), 2002, 766--773.  ",
      "doi": "10.1145/544862.544922"
    },
    {
      "text": "Whittaker, S., Frohlich, D. and Daly-Jones, O., \"Informal Workplace Communication: What Is It Like and How Might We Support It?\" Proc. ACM SIGCHI Conf., 1994, 131--137.  ",
      "doi": "10.1145/191666.191726"
    },
    {
      "text": "Wilson, T.P. and Zimmerman, D.H., \"The Structure of Silence Between Turns in Two-Party Conversation,\" Discourse Processes 9 (1986), 375--390.",
      "doi": ""
    },
    {
      "text": "Woodruff, A. and Aoki, P.M., \"Media Affordances of a Mobile Push-to-Talk Communication Service,\" 2003, submitted for publication.",
      "doi": ""
    }
  ]
}