{
  "doi": "10.1145/642611.642627",
  "title": "Information use of service technicians in difficult cases",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "81-88",
  "year": 2003,
  "badges": [],
  "abstract": "Service technicians in the field often come across difficult service problems that are new to them. They have a large number of resources that they can draw on to deal with such problems, including both people and documents. We have undertaken a detailed study of technicians' everyday work, and have discovered two distinct types of information use, reflecting two different problem-solving practices. The less frequently used problem-solving practice is instruction following, where technicians follow company-documented Repair Analysis Procedures (RAPs). The second, more common practice is gleaning, where the information is gathered from many sources -- including other technicians and informal tips, which are documents written by technicians describing their invented solutions to hard service problems. Our observations show how the informational and interface affordances of the system for accessing the tips support their easy incorporation into the gleaning approach for problem solving in difficult cases. We also recommend ways that RAPs can be augmented to provide affordances for gleaning, and more effective instruction following.",
  "tags": [
    "knowledge management system",
    "ethnography"
  ],
  "authors": [
    {
      "name": "Yutaka Yamauchi",
      "institution": "The Anderson School at UCLA, Los Angeles, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100323311",
      "orcid": "missing"
    },
    {
      "name": "Jack Whalen",
      "institution": "Palo Alto Research Center, Inc., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100590648",
      "orcid": "missing"
    },
    {
      "name": "Daniel G. Bobrow",
      "institution": "Palo Alto Research Center, Inc., Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100435652/rel-imgonly/danny2-3.jpg",
      "acmid": "81100435652",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S. and Halverson, C., Considering an Organization's Memory. in ACM 1998 Computer Supported Cooperative Work, (Seattle, WA, 1998), ACM Press, 39--48.  ",
      "doi": "10.1145/289444.289461"
    },
    {
      "text": "Bates, M.J. The design of browsing and berrypicking techniques for the on-line search interface. Online Review, 13 (5). 1989, 407--431.",
      "doi": ""
    },
    {
      "text": "Bobrow, D.G. and Whalen, J. The Eureka Story: Community Knowledge Sharing in Practice. Reflections, 4 (2). 2002.",
      "doi": ""
    },
    {
      "text": "Ellis, D. A Behavioural Approach to Information Retrieval System Design. Journal of Documentation, 45 (3). 1989, 171--212.  ",
      "doi": "10.1108/eb026843"
    },
    {
      "text": "Goodwin, C. and Goodwin, M.H. Seeing as a Situated Activity: Formulating Planes. in Engeström, Y. and Middleton, D. eds. Cognition and Communication at Work, Cambridge University Press, Cambridge, 1996, 61--95.",
      "doi": ""
    },
    {
      "text": "Hutchins, E. Cognition in the Wild. MIT Press, Cambridge MA, 1995.",
      "doi": ""
    },
    {
      "text": "Markus, M.L. and Robey, D. Information Technology and Organizational Change: Causal Structure in Theory and Research. Management Science, 34 (5). 1988, 583--598.  ",
      "doi": "10.5555/50623.50626"
    },
    {
      "text": "Orlikowski, W.J. The Duality of Technology: Rethinking the Concept of Technology in Organizations. Organization Science, 3 (3). 1992, 398--427.",
      "doi": "10.1287/orsc.3.3.398"
    },
    {
      "text": "Orr, J. Talking About Machines: An Ethnography of a Modern Job. ILR Press, Cornell University Press, Ithaca NY, 1996.",
      "doi": ""
    },
    {
      "text": "Pirolli, P. and Card, S.K. Information Foraging. Psychological Review, 106 (4). 1999, 643--675.",
      "doi": ""
    },
    {
      "text": "Suchman, L.A. Plans and Situated Actions: The Problem of Human Machine Communication. Cambridge University Press, Cambridge, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Weick, K.E. Sensemaking in Organizations. Sage Publications, Thousand Oaks, CA, 1995.",
      "doi": ""
    },
    {
      "text": "Whalen, J. and Vinkhuyzen, E. Expert Systems in (Inter)Action: Diagnosing Document Machine Problems over the Telephone. in Luff, P., Hindmarsh, J. and Heath, C. eds. Workplace Studies: Recovering Work Practice and Information System Design, Cambridge University Press, Cambridge, UK, 2001, 92--140.",
      "doi": ""
    }
  ]
}