{
  "doi": "10.1145/642611.642660",
  "title": "Hardware companions?: what online AIBO discussion forums reveal about the human-robotic relationship",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "273-280",
  "year": 2003,
  "badges": [],
  "abstract": "In this study, we investigated people's relationships with AIBO, a robotic pet, through 6,438 spontaneous postings in online AIBO discussion forums. Results showed that AIBO psychologically engaged this group of participants, particularly by drawing forth conceptions of technological essences (75%), life-like essences (49%), mental states (60%), and social rapport (59%). However, participants seldom attributed moral standing to AIBO (e.g., that AIBO deserves respect, has rights, or can be held morally accountable for action). Our discussion focuses on how robotic pets (now and in the future) may (a) challenge traditional boundaries (e.g. between who or what can possess feelings), (b) extend our conceptions of self, companionship, and community, and (c) begin to replace interactions with live pets. We also discuss a concern that people in general, and children in particular, may fall prey to accepting robotic pets without the moral responsibilities (and moral developmental outcomes) that real, reciprocal companionship and cooperation involves. This research contributes to a growing literature on the human-robotic relationship.",
  "authors": [
    {
      "name": "Batya Friedman",
      "institution": "University of Washington/UW, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636215",
      "orcid": "missing"
    },
    {
      "name": "Peter H. Kahn",
      "institution": "University of Washington/UW, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408592441",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Hagman",
      "institution": "University of Washington/UW, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338676",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Back, M., Cohen, J., Gold, R., Harrison, S., and Minneman, S. Listen Reader: An electronically augmented paper-based book, in Proceedings of CHI 2001, ACM Press, 23--29.  ",
      "doi": "10.1145/365024.365031"
    },
    {
      "text": "Beck, A.M., and Katcher, A. Between pets and people. Purdue University Press, West Lafayette IN, 1996.",
      "doi": ""
    },
    {
      "text": "Cassell, J., Sullivan, J., Prevost, S., and Churchill, E. Embodied Conversational Agents. MIT Press, Cambridge MA, 2000.",
      "doi": ""
    },
    {
      "text": "Farnham, S., Cheng, L., Stone, L., Zaner-Godsey, M., Hibbeln, C., Syrjala, K., Clark, A. M., and Abrams, J. HutchWorld: Clinical study of computer-mediated social support for cancer patients and their caregivers, in Proceedings of CHI 2002, ACM Press, 375--382.  ",
      "doi": "10.1145/503376.503444"
    },
    {
      "text": "Friedman, B. (ed.). Human Values and the Design of Computer Technology. Cambridge University Press and CSLI Publications, New York NY and Stanford CA, 1997. ",
      "doi": "10.5555/278213"
    },
    {
      "text": "Friedman, B. and Millett, L. \"It's the computer's fault\" -- Reasoning about computers as moral agents, in Conf. Companion of CHI 1995, ACM Press, 226--227.  ",
      "doi": "10.1145/223355.223537"
    },
    {
      "text": "Friedman, B. and Kahn, P. H., Jr. Human values, ethics, and design, in J. Jacko and A. Sears (eds.), Handbook of Human-Computer Interaction. Lawrence Erlbaum Associates, Mahwah NJ, in press. ",
      "doi": "10.5555/772072.772147"
    },
    {
      "text": "Fukayama, A., Ohno, T., Mukawa, N., Sawaki, M., and Hagita, N. Messages embedded in gaze of interface agents -- impression management with agent's gaze --, in Proceedings of CHI 2002, ACM Press, 41--48.  ",
      "doi": "10.1145/503376.503385"
    },
    {
      "text": "Goldberg, K. (ed.). The Robot in the Garden: Telerobotics and Telepistemology on the Internet. The MIT Press, Cambridge MA, 2000. ",
      "doi": "10.5555/335968"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible bits: Towards seamless interfaces between people, bits and atoms, in Proceedings of CHI 1997, ACM Press, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Ishii, H., Wisneski, C., Brave, S., Dahley, A., Gorbet, M., Ullmer, B., & Yarin, P. ambientROOM: Integrating ambient media with architectural space, in Conf. Summary of CHI 1998, ACM Press, 173--174.  ",
      "doi": "10.1145/286498.286652"
    },
    {
      "text": "Kahn, P. H., Jr. The Human Relationship with Nature: Development and Culture. MIT Press, Cambridge MA, 1999.",
      "doi": ""
    },
    {
      "text": "Kahn, P. H., Jr., and Kellert, S. R. (eds). Children and Nature: Psychological, Sociocultural, and Evolutionary Investigations. MIT Press, Cambridge MA, 2002.",
      "doi": ""
    },
    {
      "text": "Katcher, A., and Wilkins, G. Dialogue with animals: Its nature and culture, in S.R. Kellert and E.O. Wilson (eds.), The Biophilia Hypothesis. Island Press, Washington DC, 1993, 173--197.",
      "doi": ""
    },
    {
      "text": "Kiesler, S. (ed.) Culture of the Internet. Lawrence Erlbaum, Mahwah NJ, 1997.",
      "doi": ""
    },
    {
      "text": "Lawrence, E. A. The sacred bee, the filthy pig, and the bat out of hell: Animal symbolism as cognitive biophilia, in S.R. Kellert and E.O. Wilson (eds.), The Biophilia Hypothesis. Island Press, Washington DC, 1993, 301--341.",
      "doi": ""
    },
    {
      "text": "McKenna, K. Y. A., and Bargh, J. A. Plan 9 from cyberspace: The implications of the Internet for personality and social psychology. Personality and Social Psychology Review, 4, 1 (2000), 57--75.",
      "doi": ""
    },
    {
      "text": "Melson, G. F. Why the Wild Things Are: Animals in the Lives of Children. Harvard University Press, Cambridge MA, 2001.",
      "doi": ""
    },
    {
      "text": "Myers, G. Children and Animals: Social Development and Our Connections to Other Species. Westview Press, Boulder CO, 1988.",
      "doi": ""
    },
    {
      "text": "Mynatt, E. D., Adler, A., Ito, M., Linde, C., and O'Day, V. L. The network communities of SeniorNet, in Proceedings of ECSCW 1999, Kluwer Academic Publishers, Dordrecht Netherlands, 219--238. ",
      "doi": "10.5555/351689.351702"
    },
    {
      "text": "Nass, C., and Lee, K. M. Does computer-generated speech manifest personality? An experimental test of similarity-attraction, in Proceedings of CHI 2000, ACM Press, 329--336.  ",
      "doi": "10.1145/332040.332452"
    },
    {
      "text": "Nass, C., Moon, Y., Morkes, J., Kim, E., and Fogg, B.J. Computers are social actors: A review of current research, in B. Friedman (ed.), Human Values and the Design of Computer Technology. Cambridge University Press and CSLI Publications, New York NY and Stanford CA, 1997, 137--162. ",
      "doi": "10.5555/278213.278222"
    },
    {
      "text": "Parise, S., Kiesler, S., Sproull, L., and Waters, K. My partner is a real dog: Cooperation with social agents, in Proceedings of CSCW 1996, ACM Press, 399--408.  ",
      "doi": "10.1145/240080.240351"
    },
    {
      "text": "Paulos, E., and Canny, J. PRoP: Personal roving presence, in Proceedings of CHI 1998, ACM Press, 296--303.  ",
      "doi": "10.1145/274644.274686"
    },
    {
      "text": "Piaget, J. The Moral Judgment of the Child. Free Press, Glencoe, IL, 1932/1969.",
      "doi": ""
    },
    {
      "text": "Preece, J. Empathic communities: Balancing emotional and factual communication. Interacting with Computers, 12, (1999), 63--77.",
      "doi": ""
    },
    {
      "text": "Preece, J. Reaching out across the Web. interactions (march + april, 1998), 32--43.  ",
      "doi": "10.1145/274430.274435"
    },
    {
      "text": "Reeves, B., and Nass, C. The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Cambridge University Press and CSLI Publications, New York NY and Stanford CA, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Rheingold, H. The Virtual Community. Addison-Wesley, Reading MA, 1993.",
      "doi": ""
    },
    {
      "text": "Shepard, P. The Others: How Animals Made Us Human. Island Press, Washington DC, 1996.",
      "doi": ""
    },
    {
      "text": "Sheridan, T. Telerobotics, Automation, and Human Supervisory Control. MIT Press, Cambridge MA, 1992. ",
      "doi": "10.5555/134291"
    },
    {
      "text": "Sony AIBO US Web site. Available at http://www.us.aibo.com/.",
      "doi": ""
    },
    {
      "text": "Strommen, E. When the interface is a talking dinosaur: Learning across media with ActiMates Barney, in Proceedings of CHI 1998, ACM Press, 288--295.  ",
      "doi": "10.1145/274644.274685"
    },
    {
      "text": "Turkle, S. Life on the Screen: Identity in the Age of the Internet. Simon & Schuster, New York NY, 1997. ",
      "doi": "10.5555/523015"
    },
    {
      "text": "Turiel, E. The Development of Social Knowledge. Cambridge University Press, Cambridge England, 1983.",
      "doi": ""
    },
    {
      "text": "Turiel, E. Moral development, in N. Eisenberg (ed.), Social, emotional, and personality development (1998). Vol. 3 of W. Damon (Ed.) Handbook of Child Psychology. 5th ed. Wiley, New York NY, 863--932.",
      "doi": ""
    },
    {
      "text": "Want, R., Fishkin, K. P., Gujar, A., & Harrison, B. L. Bridging physical and virtual worlds with electronic tags, in Proceedings of CHI 1999, ACM Press, 370--377.  ",
      "doi": "10.1145/302979.303111"
    }
  ]
}