{
  "doi": "10.1145/642611.642669",
  "title": "Navigating in a mobile XHTML application",
  "published": "2003-04-05",
  "proctitle": "CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "329-336",
  "year": 2003,
  "badges": [],
  "abstract": "The Internet has been a great success in the fixed world, whereas WAP (Wireless Application Protocol), the mobile Internet, has not fulfilled its promise. However, now the analysts have started to believe in a rise of the mobile Internet again. WAP 2.0, with XHTML Mobile Profile as its standard language, will enable sites to function both in the fixed and wireless worlds. In this paper, we analyze different ways to navigate XHTML sites with mobile phones and base our analysis on two usability evaluations with a total of 30 subjects from various countries. The results show that due to limitations of mobile devices (the limited display size, pointing methods, and bandwidth), not all navigation guidelines of the fixed Internet are applicable to the mobile Internet. It is important for developers to realize the effect of these limitations in order to build usable XHTML sites also for mobile use.",
  "tags": [
    "XHTML mobile profile",
    "WAP",
    "wireless web",
    "navigation",
    "mobile phones",
    "mobile internet"
  ],
  "authors": [
    {
      "name": "Anne Kaikkonen",
      "institution": "Nokia Research Center, Nokia Group, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100306087",
      "orcid": "missing"
    },
    {
      "name": "Virpi Roto",
      "institution": "Nokia Research Center, Nokia Group, Finland",
      "img": "/do/10.1145/contrib-81100443285/rel-imgonly/virpiroto-face.png",
      "acmid": "81100443285",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Wireless Application Protocol Forum Ltd.: XHTML Mobile Profile Specification. http://www.wapforum.org/what/technical.htm",
      "doi": ""
    },
    {
      "text": "Kaikkonen, A., Williams, D.: \"Here, there, everywhere\": Designing Usable Wireless Services, Interact 2001 Tutorial Notes (2001)",
      "doi": ""
    },
    {
      "text": "Kaikkonen, A., Törmänen, P.: User Experience in Mobile Banking, HCI2000 Proceedings, BCS (2000)",
      "doi": ""
    },
    {
      "text": "Kaikkonen, A., Williams, D.: Designing Usable Mobile Services, CHI2000 Tutorial Notes, ACM (2000)",
      "doi": ""
    },
    {
      "text": "Kaasinen, E., Kolari, J., Laakko, T.: Mobile-Transparent Access to Web Services. Interact 2001 Proceedings (2001)",
      "doi": ""
    },
    {
      "text": "Nokia Corporation: Mobile Application Development Guidelines. http://www.forum.nokia.com (2002)",
      "doi": ""
    },
    {
      "text": "Nokia Corporation: XHTML Guidelines. http://www.forum.nokia.com (2002)",
      "doi": ""
    },
    {
      "text": "Kaikkonen,A., Roto,V.: XHTML in Mobile Application Development. Mobile HCI 2002 Proceedings (2002) ",
      "doi": "10.5555/645739.666589"
    },
    {
      "text": "Chittaro, L., Dal Cin, P.: Evaluating Interface Design Choices on WAP Phones: Single-choice List Selection and Navigation among Cards. Mobile HCI 2001 Proceedings (2001)",
      "doi": ""
    },
    {
      "text": "Nielsen, Jakob: Designing Web Usability: The Practice of Simplicity. New Riders Publishing (2000) ",
      "doi": "10.5555/519216"
    },
    {
      "text": "Krug, Steve: Don't Make Me Think: A Common Sense Approach to Web Usability. New Riders Publishing (2000) ",
      "doi": "10.5555/557439"
    },
    {
      "text": "Serco Usability Services: Designing WAP Services: Usability Guidelines (2000) http://www.usability.serco.com/research/suswapguide.pdf",
      "doi": ""
    },
    {
      "text": "Fleming, J., Koman, R. (editor): Web Navigation: Designing the User Experience. O'Reilly & Associates (1998) ",
      "doi": "10.5555/290178"
    },
    {
      "text": "Sprint Spectrum L.P.: PCS Web Style Guide, Vision Edition (2002). http://www.sprintpcs.com/",
      "doi": ""
    },
    {
      "text": "Openwave Systems Inc.: XHTML Mobile Profile Reference (2001). http://www.openwave.com",
      "doi": ""
    }
  ]
}