{
  "doi": "10.1145/332040.332478",
  "title": "The effect of communication modality on cooperation in online environments",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "470-477",
  "year": 2000,
  "badges": [],
  "abstract": "One of the most robust findings in the sociological literature is the positive effect of communication on cooperation and trust. When individuals are able to communicate, cooperation increases significantly. How does the choice of communication modality influence this effect? We adapt the social dilemma research paradigm to quantitatively analyze different modes of communication. Using this method, we compare four forms of communication: no communication, text-chat, text-to-speech, and voice. We found statistically significant differences between different forms of communication, with the voice condition resulting in the highest levels of cooperation. Our results highlight the importance of striving towards the use of more immediate forms of communication in online environments, especially where trust and cooperation are essential. In addition, our research demonstrates the applicability of the social dilemma paradigm in testing the extent to which communication modalities promote the development of trust and cooperation.",
  "tags": [
    "social interfaces",
    "collaboration",
    "CSCW",
    "computer mediated communication",
    "social dilemna",
    "online interaction"
  ],
  "authors": [
    {
      "name": "Carlos Jensen",
      "institution": "College of Computing, Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577066",
      "orcid": "missing"
    },
    {
      "name": "Shelly D. Farnham",
      "institution": "Microsoft Research, Microsoft Corporation, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100243264",
      "orcid": "missing"
    },
    {
      "name": "Steven M. Drucker",
      "institution": "Microsoft Research, Microsoft Corporation, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090466",
      "orcid": "0000-0002-5022-9343"
    },
    {
      "name": "Peter Kollock",
      "institution": "Department of Sociology, University of California at Los Angeles, Los Angeles, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100292236",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abela, A., and Sacconaghi, A., Value Exchange: The Secret of Building Customer Relationships On Line. The McKinsey Quarterly 1997, Number 2",
      "doi": ""
    },
    {
      "text": "Axelrod, R. The Evolution of Cooperation. Basic Books, New York, 1984",
      "doi": ""
    },
    {
      "text": "Chapanis, A., Ochsman, R. B., Parrish, R. N. &amp; Weeks, G.D. Studies in interactive communication: The behavior of teams during co-operative problem solving. Human Factors, 14. (1972). 487-509.",
      "doi": ""
    },
    {
      "text": "Doherty-Sneedon, G., Anderson, A., O'Malley, C., Langton, S., Garrod, S., &amp; Bruce, V. Face-to-Face and video mediated communication: A comparison of dialog structure and task performance, Journal of Experimental Psychology: Applied, 3, 2, (1997). 105- 123.",
      "doi": ""
    },
    {
      "text": "Edigo, C. Teleconferencing as a technology to support co-operative work: Its possibilities and limitations. In J. Gallegher, R. E. Kraut, &amp; C. Edigo (Eds.) Intellectual teamwork: Social and technological foundations of cooperative work (pp. 351-371). Hillsdale, NJ. Erlbaum Associates ",
      "doi": "10.5555/117848.117953"
    },
    {
      "text": "Finn, K., Sellen, A., Wilbur, S. (Eds.) Video-Mediated Communication. (1997) Hillsdale, NJ. Eribaum Associates ",
      "doi": "10.5555/548502"
    },
    {
      "text": "Kelly, H. Interpersonal Relations: A Theory of Interdependence. Wiley and Sons, New York, 1978",
      "doi": ""
    },
    {
      "text": "Kiesler, S., Sproull, L. and Waters, K. A Prisoner's Dilemma Experiment on Cooperation With People and Human-Like Computers. Journal of Personality and Social Psychology 1996. Vol. 70, No 1, 47-65",
      "doi": ""
    },
    {
      "text": "Kollock, P. Social Dilemmas: The Anatomy of Cooperation. Annual Review of Sociology 1998. 24:183- 214",
      "doi": ""
    },
    {
      "text": "Ledyard, J. Public Goods: A Survey of Experimental Research. In Kagel, J. and Roth, A. (Eds.), The Handbook of Experimental Economics. Princeton University Press, Princeton, NJ, 1995",
      "doi": ""
    },
    {
      "text": "Messick, D and Brewer, M. Solving Social Dilemmas. In Wheeler, L. and Shaver, P. (Eds.), Review of Personality and Social Psychology. Sage, Beverly Hills, CA, 1983",
      "doi": ""
    },
    {
      "text": "Rocco, E. Trust Breaks Down in Electronic Contexts but Can Be Repaired by Some Initial Face-to-Face Contact. Proceedings of CHl '98 (Los Angeles CA, April 1998), ACM Press, 496-502.  ",
      "doi": "10.1145/274644.274711"
    },
    {
      "text": "Ruhleder, K., Jorden, B. Meaning-making across remote sites\" how delays in transmission affect interaction. Proceedings of 1999 European Conference on CSCW. ",
      "doi": "10.5555/351689.351712"
    },
    {
      "text": "Sally, D. Conversation and Cooperation in Social Dilemmas: A Meta-analysis of Experiments from 1958 to 1992. Rationality and Society, 7,58-92, 1995",
      "doi": ""
    },
    {
      "text": "Veinott, E. S., Olson, J. S., Olson, G. M., Fu, X. Video Helps Remote Work: Speakers Who Need to Negotiate Common Ground Benefit from Seeing Eachother. Proceedings of CHI '99 (Pittsburgh PA, May 1999), ACM Press, 302-309.  ",
      "doi": "10.1145/302979.303067"
    },
    {
      "text": "Veinott, E. S., Olson, J. S., Olson, G. M., Fu, X. Video Matters! When communication is stressed video Helps. Extended Abstracts of CHI '97 (Atlanta GA, April 1997) ACM Press, 315-316.  ",
      "doi": "10.1145/1120212.1120411"
    }
  ]
}