{
  "doi": "10.1145/332040.332437",
  "title": "Traversable interfaces between real and virtual worlds",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "233-240",
  "year": 2000,
  "badges": [],
  "abstract": "Traversable interfaces establish the illusion that virtual and physical worlds are joined together and that users can physically cross from one to the other. Our design for a traversable interface combines work on tele-embodiment, mixed reality boundaries and virtual environments. It also exploits non-solid projection surfaces, of which we describe four examples. Our design accommodates the perspectives of users who traverse the interface and also observers who are present in the connected physical and virtual worlds, an important consideration for performance and entertainment applications. A demonstrator supports encounters between members of our laboratory and remote visitors.",
  "authors": [
    {
      "name": "Boriana Koleva",
      "institution": "School of Computer Science & Information Technology, The University of Nottingham, Nottingham NG8 1BB, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100296314",
      "orcid": "missing"
    },
    {
      "name": "Holger Schnädelbach",
      "institution": "School of Computer Science & Information Technology, The University of Nottingham, Nottingham NG8 1BB, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100504057",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "School of Computer Science & Information Technology, The University of Nottingham, Nottingham NG8 1BB, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Chris Greenhalgh",
      "institution": "School of Computer Science & Information Technology, The University of Nottingham, Nottingham NG8 1BB, UK",
      "img": "/do/10.1145/contrib-81100557223/rel-imgonly/chrisgreenhalghsmall.jpg",
      "acmid": "81100557223",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benford, S. D., Greenhaigh, C. M. and Lloyd, D, Crowded Collaborative Virtual Environments, Proc. CHI'97, pp. 59-66, 1997  ",
      "doi": "10.1145/258549.258588"
    },
    {
      "text": "Benford, S., Greenhalgh, C., Reynard, G., Brown, C., and Koleva, B., Understanding and Constructing Shared Spaces with Mixed Reality Boundaries, ACM ToCHI, 5 (3), 185-223, ACM Press.  ",
      "doi": ""
    },
    {
      "text": "Billinghurst, M., Weghorst, S., Fumess III, T., Shared Space: An Augmented Reality Interface for Computer Supported Collaborative Work, Proc. CVE'96, Nottingham University, UK, Sept 1996.",
      "doi": ""
    },
    {
      "text": "Bowers, J., Pycock, J. and O'Brien, J., Talk and Embodiment in Collaborative Virtual Environments, Proc. CHI'96, 1996.  ",
      "doi": "10.1145/238386.238404"
    },
    {
      "text": "Cruz-Neira, C., Sandin, D. J., DeFant, T. A., Kenyon, R. V. and Hart, J. C., The Cave - Audio Visual Experience Virtual Environment, CACM, 35 (6), pp 65-72, 1992.  ",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Ullmer, B, Tangible bits: Towards seemless interfaces between People, Bits and Atoms, Proc. CHI'97, pp 234-241, ACM Press, 1997.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Koleva, B., Benford, S. and Greenhalgh, C, The Properties of Mixed Reality Boundaries, Proc. ECSCW'99, Copenhagen, September 1999, Kluwer. ",
      "doi": ""
    },
    {
      "text": "Kuzuoka, H., Ishimoda, G. and Nishimura, T., Can the GestureCam be a surrogate?, Proc. ECSCW'95, Stockholm, Sweden, September 1995, Kluwer. ",
      "doi": ""
    },
    {
      "text": "ilgram, P. and Kishino, F., A Taxonomy of Mixed Reality Visual Displays, IEICE Transactions on Information Systems, Vol E77-D (12), Dec. 1994.",
      "doi": ""
    },
    {
      "text": "Paulos, E. and Canny, J., PRop: Personal Roving Presence, Proc. CHI'98, pp 296-303, 1998.  ",
      "doi": "10.1145/274644.274686"
    },
    {
      "text": "Usoh, M., Arthur, K., Whitton, M., Bastos, R., Steed, A., Slater, M. and Brooks, F., Walking > Walking-in-Place > Flying, in Virtual Environments, Proc. SIGGRAPH'99, pp359-364.  ",
      "doi": "10.1145/311535.311589"
    },
    {
      "text": "Buxton, B., Living in Augmented Reality: Ubiquitous Media and Reactive Environments, Proc. imagina'95. Monte Carlo, February 1995.",
      "doi": ""
    }
  ]
}