{
  "doi": "10.1145/332040.332444",
  "title": "Intelligent gaze-added interfaces",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "273-280",
  "year": 2000,
  "badges": [],
  "abstract": "We discuss a novel type of interface, the intelligent gaze-added interface, and describe the design and evaluation of a sample gaze-added operating-system interface. Gaze-added interfaces, like current gaze-based systems, allow users to execute commands using their eyes. However, while most gaze-based systems replace the functionality of other inputs with that of gaze, gaze-added interfaces simply add gaze functionality that the user can employ if and when desired. Intelligent gaze-added interfaces utilize a probabilistic algorithm and user model to interpret gaze focus and alleviate typical problems with eye-taking data. We extended a standard WIMP operating-system interface into a new interface, IGO, that incorporates intelligent gaze-added input. In a user study, we found that users quickly adapted to the new interface and utilized gaze effectively both alone and with other inputs.",
  "tags": [
    "gaze-based interfaces",
    "gaze-added interfaces",
    "eye movements",
    "user models",
    "intelligent interfaces"
  ],
  "authors": [
    {
      "name": "Dario D. Salvucci",
      "institution": "Cambridge Basic Research, Four Cambridge Center, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289294",
      "orcid": "missing"
    },
    {
      "name": "John R. Anderson",
      "institution": "Department of Psychology, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363598414",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R., &amp; Lebiere, C. (1998). The atomic components of thought. Hillsdale, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Frey, L.A., White, K.P., &amp; Hutchinson, T.E. (1990). Eye-gaze word processing. IEEE Transactions on Systems, Man, and Cybernetics, 20, 944-950.",
      "doi": ""
    },
    {
      "text": "Gips, J. (1998). On building intelligence into EagleEyes. In V. O. Mittal, H. A. Yanco, J. Aronis, &amp; R. Simpson (Eds.), Assistive Technology and Artificial Intelligence (pp. 50-58). Berlin: Springer-Verlag. ",
      "doi": "10.5555/646629.696519"
    },
    {
      "text": "Goldberg, J.H., &amp; Schryver, J.C. (1995). Eye-gaze determination of user intent at the computer interface. In J. M. Findlay, R. Walker, &amp; R. W. Kentridge (Eds.), Eye Movement Research: Mechanisms, Processes, and Applications (pp. 491-502). New York: Elsevier Science Publishing.",
      "doi": ""
    },
    {
      "text": "Hutchinson, T.E., White, K.P., Martin, W.N., Reichert, K.C., &amp; Frey, L.A. (1989). Humancomputer interaction using eye-gaze input. 1EEE Transactions on Systems, Man, and Cybernetics, 19, 1527-1534.",
      "doi": ""
    },
    {
      "text": "Jacob, R. J.K. (1995). Eye tracking in advanced interface design. In W. Barfield &amp; T. A. Furness (Eds.), Virtual Environments and Advanced Interface Design (pp. 258-288). New York: Oxford University Press. ",
      "doi": "10.5555/216164.216178"
    },
    {
      "text": "Jacob, R. J.K., Deligiannidis, L., &amp; Morrison, S. (1999). A soft'ware model and specification language for non-WIMP user interfaces. A CM Transactions on Computer-Human Interaction, 6, 1-46.  ",
      "doi": "10.1145/310641.310642"
    },
    {
      "text": "John, B.E. (1990). Extensions of GOMS analyses to expert performance requiring perception of dynamic visual and auditory information. In Proceedings of CH1 90 (pp. 107-115). New York: ACM Press.  ",
      "doi": "10.1145/97243.97262"
    },
    {
      "text": "Salvucci, D.D. (1999). Mapping eye movements to cognitive processes. Doctoral Dissertation, Department of Computer Science, Carnegie Mellon University. ",
      "doi": "10.5555/930784"
    },
    {
      "text": "Salvucci, D.D. (1999). Inferring intent in eyemovement interfaces: Tracing user actions with process models. In Human Factors in Computing Systems: CH199 Conference Proceedings (pp. 254-261). New York: ACM Press.  ",
      "doi": "10.1145/302979.303055"
    },
    {
      "text": "Stampe, D.M., &amp; Reingold, E. M. (1995). Selection by looking: A novel computer interface and its application to psychological research. In J. M. Findlay, R. Walker, &amp; R. W. Kentridge (Eds.), Eye Movement Research: Mechanisms, Processes, and Applications (pp. 467-478). New York: Elsevier Science Publishing.",
      "doi": ""
    },
    {
      "text": "Yanco, H.A. (1998). Wheelesley: A robotic wheelchair system: Indoor navigation-and user interface. In V. O. Mittal, H. A. Yanco, J. Aronis, &amp; R. Simpson (Eds.), Assistive Technology and Artificial Intelligence (pp. 256-268). Berlin: Springer-Verlag. ",
      "doi": "10.5555/646629.696524"
    },
    {
      "text": "Zhai, S., Morimoto, C., &amp; lhde, S. (1999). Manual and gaze input cascaded (MAGIC) pointing. In Human Factors in Computing Systems: CH1 99 Conference Proceedings (pp. 246-253). New York: ACM Press.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}