{
  "doi": "10.1145/332040.332466",
  "title": "Eye-hand co-ordination with force feedback",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "408-414",
  "year": 2000,
  "badges": [],
  "abstract": "The term Eye-hand co-ordination refers to hand movements controlled with visual feedback and reinforced by hand contact with objects. A correct perspective view of a virtual environment enables normal eye-hand co-ordination skills to be applied. But is it necessary for rapid interaction with 3D objects? A study of rapid hand movements is reported using an apparatus designed so that the user can touch a virtual object in the same place where he or she sees it. A Fitts tapping task is used to assess the effect of both contact with virtual objects and real-time update of the centre of perspective based on the user's actual eye position. A Polhemus tracker is used to measure the user's head position and from this estimate their eye position. In half of the conditions, head tracked perspective is employed so that visual feedback is accurate while in the other half a fixed eye-position is assumed. A Phantom force feedback device is used to make it possible to touch the targets in selected conditions. Subjects were required to change their viewing position periodically to assess the importance of correct perspective and of touching the targets in maintaining eye-hand co-ordination, The results show that accurate perspective improves performance by an average of 9% and contact improves it a further 12%. A more detailed analysis shows the advantages of head tracking to be greater for whole arm movements in comparison with movements from the elbow.",
  "authors": [
    {
      "name": "Roland Arsenault",
      "institution": "Faculty of Computer Science, University of New Brunswick, Fredericton, New Brunswick, Canada E3B 5A3",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100144707",
      "orcid": "missing"
    },
    {
      "name": "Colin Ware",
      "institution": "Faculty of Computer Science, University of New Brunswick, Fredericton, New Brunswick, Canada E3B 5A3",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100446762",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arthur, K. W., Booth, K. S., and Ware, C. (1993). Evaluating 3D Task Performance for Fish Tank virtual Worlds. A CM Transactions on Information Systems, 11(3) 239-265.  ",
      "doi": "10.1145/159161.155359"
    },
    {
      "text": "Boritz, James and Booth, Kellogg S., A Study of Interactive 3D Point Location in a Computer Simulated Virtual Environment, In Proceedings of A CM Symposium on Virtual Reality Software and Technology '97, Lausanne, Switzerland, Sept., pp. 181- 187.  ",
      "doi": "10.1145/261135.261168"
    },
    {
      "text": "Deering, M. (1992). High Resolution Virtual Reality. Proceedings of ACM SIGGRAPH '92, Computer Graphics, 26:2, 195-202.  ",
      "doi": "10.1145/142920.134039"
    },
    {
      "text": "Fitts, P.M. (1954) The information capacity of the human motor system in controlling the amplitude of movement. Journal of Expeimental Psychology, 47(6) 381-391.",
      "doi": ""
    },
    {
      "text": "Graham, E.D. and MacKenzie, C.L. (1996) Physical versus virtual pointing. Proceedings of ACM CHI'96. 292-299.  ",
      "doi": "10.1145/238386.238532"
    },
    {
      "text": "Hannaford, B. Wood, L. Guggisberg, b., McAffee, D. and Zack, H. (1989) Performance evaluation of a sixaxis universal force-reflecting hand controller. In Proceedings of the 19th IEEE Conference on Decision and Control. Albuquerque, NM, Dec, 1197-1205.",
      "doi": ""
    },
    {
      "text": "Harris, C. S. (1965). Perceptual adaptation to inverted, reversed, and displaced vision. Psychological Review, 72, 419-444.",
      "doi": ""
    },
    {
      "text": "Held, R., Estanthiou, A. and Green, M. (1966) Adaptation to displaced and delayed visual feedback from the hand. Journal of Experimental Psychology, 72, 887-891.",
      "doi": ""
    },
    {
      "text": "Kubovy, M. (1986) The psychology of perspective and renaissance art. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Meek, S.G., Jacobson, S.C., and Goulding, P.P. (1989) Extended physiologic taction, design and evaluation of a proportional force feedback system. Journal of Rehabilitation Research and Development, 2693) 53- 62.",
      "doi": ""
    },
    {
      "text": "MacKenzie, C.L. (1992) Making contact: target surfaces and pointing implements for 3-D kinematics of humans performing a Fitts' task. Society for Neuroscience Abstracts, 18, 515",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. (1992) Fitts' Law as a Research and Design tool in human-computer interaction. Human- Computer Interaction, 7(1) 91-139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Pausch, R., Proffitt, D., &amp; Williams, G (1997) Quantifying immersion in virtual reality, ACM SIGGRAPH'97 Conference Proceedings, Computer Graphics.  ",
      "doi": "10.1145/258734.258744"
    },
    {
      "text": "Rossetti, Y., Koga, K., and Mano, T., (1993) Prismatic displacement of vision induces transient changes in the timing of eye-hand coordination. Perception and Psychophysics, 54(3) 355-364.",
      "doi": ""
    },
    {
      "text": "Sheridan, T.B. (1992) Telerobotics, Automation and Human Supervisory Control, MIT Press: Cambridge, Mass. ",
      "doi": "10.5555/134291"
    },
    {
      "text": "Tan, H. Z., Srinivasan, M. A., Eberman, B., Cheng, B. (1994). Human Factors for the Design of Force- Reflecting Haptic Interfaces. Dynamic Systems and Control 55:1",
      "doi": ""
    },
    {
      "text": "Ware, C. and Rose, J. (1999) Rotating Virtual Objects with Real Handles, ACM Transactions on Computer- Human Interaction, 6(2) 162-180.  ",
      "doi": "10.1145/319091.319102"
    },
    {
      "text": "Ware, C. Arthur, K., and Booth, K.S. (1993) Fish tank virtual reality. In Proceedings of ACM INTERCHI'93, 37-42.  ",
      "doi": "10.1145/169059.169066"
    },
    {
      "text": "Ware, C., and Franck, G., Evaluating Stereo and Motion Cues for Visualizing information Nets in Three-Dimension. ACM Transactions on Graphics, 15(2) 121-140.  ",
      "doi": "10.1145/234972.234975"
    }
  ]
}