{
  "doi": "10.1145/332040.332411",
  "title": "Jotmail: a voicemail interface that enables you to see what was said",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "89-96",
  "year": 2000,
  "badges": [],
  "abstract": "Voicemail is a pervasive, but under-researched tool for workplace communication. Despite potential advantages of voicemail over email, current phone-based voicemail UIs are highly problematic for users. We present a novel, Web-based, voicemail interface, Jotmail. The design was based on data from several studies of voicemail tasks and user strategies. The GUI has two main elements: (a) personal annotations that serve as a visual analogue to underlying speech; (b) automatically derived message header information. We evaluated Jotmail in an 8-week field trial, where people used it as their only means for accessing voicemail. Jotmail was successful in supporting most key voicemail tasks, although users' electronic annotation and archiving behaviors were different from our initial predictions. Our results argue for the utility of a combination of annotation based indexing and automatically derived information, as a general technique for accessing speech archives.",
  "tags": [
    "note-taking",
    "“speech as data”",
    "annotation",
    "voicemail",
    "empirical evaluation",
    "asynchronous communication",
    "speech access"
  ],
  "authors": [
    {
      "name": "Steve Whittaker",
      "institution": "ATT Labs-Research, 180 Park Avenue, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "Richard Davis",
      "institution": "Virtual Ink Corporation, 56 Roland St. Suite 306, Boston, MA",
      "img": "/do/10.1145/contrib-81416597118/rel-imgonly/2011-rcdavis-mugshot.jpg",
      "acmid": "81416597118",
      "orcid": "missing"
    },
    {
      "name": "Julia Hirschberg",
      "institution": "ATT Labs-Research, 180 Park Avenue, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235440",
      "orcid": "missing"
    },
    {
      "name": "Urs Muller",
      "institution": "ATT Labs-Research, 180 Park Avenue, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545752156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G., Atkeson, C., Feinstein, A., Hmelo, C., Kooper, R., Long, S., Sawhney, N., Tani, M. Teaching and learning as multimedia authoring in the classroom 2000 project, Multimedia96, 187.  ",
      "doi": "10.1145/244130.244191"
    },
    {
      "text": "Arons, B. Interactively skimming speech. Unpublished PhD thesis, MIT Media Lab, 1994. ",
      "doi": "10.5555/920916"
    },
    {
      "text": "Chalfonte, B., Fish, R., and Kraut, R. Expressive richness. In CH191, 21-26, 1991.  ",
      "doi": "10.1145/108844.108848"
    },
    {
      "text": "Chapanis, A., Ochsman, R., Parrish, R. and Weeks, G. Studies in interactive communication: I. The effects of four communication modes on the behavior of teams during cooperative problem-solving. Human Factors, 14, 487-509, 1972.",
      "doi": ""
    },
    {
      "text": "Degen, L., Mander, R., and Salomon, G. Working with audio. In CH192, 413-418, 1992.  ",
      "doi": "10.1145/142750.142877"
    },
    {
      "text": "Hindus, D., Schmandt, C., and Horner, C. Capturing, structuring and representing ubiquitous audio. A CM Transactions on Information Systems, 11, 1993.  ",
      "doi": "10.1145/159764.159761"
    },
    {
      "text": "Kazman, R., AI-Halimi, R., Hunt, W., and Mantei, M. Four paradigms for indexing video conferences. In IEEE Multimedia, 3(1), 63-73, 1996.  ",
      "doi": "10.1109/93.486705"
    },
    {
      "text": "Mackay, W. More than just a communication system: diversity in the use of electronic mail. In CSCW86, 344-353, 1986.  ",
      "doi": "10.1145/62266.62293"
    },
    {
      "text": "Moran, T., Palen, L., Harrison, S., Chiu, P., Kimber, D., Minneman, S., van Melle, W., and Zellweger, P. \"I'11 get that off the audio\": salvaging in a multimedia meeting. In CHI97, 202-209, 1997.  ",
      "doi": "10.1145/258549.258704"
    },
    {
      "text": "Rice R. and Shook, D. Voice messaging coordination and communication. In C. Egido, J. Galegher and R. Kraut, eds., Intellectual Teamwork, Lawrence Erlbaum, NJ, 1990. ",
      "doi": "10.5555/117848.117860"
    },
    {
      "text": "Schmandt, C. and Arons, B. Phoneslave: a graphical telecommunications system, SID International Symposium, 25, 146-149, 1984.",
      "doi": ""
    },
    {
      "text": "Stifelman, L. Augmenting real-world objects: a paperbased audio notebook. In CHI96, 199-200, 1996.  ",
      "doi": "10.1145/257089.257279"
    },
    {
      "text": "Whittaker, S., Hirschberg, J. and Nakatani, C. All talk and all action. In CHI98, 249-250,1998.  ",
      "doi": "10.1145/286498.286732"
    },
    {
      "text": "Whittaker, S., Hirschberg, J. and Nakatani, C. Play it again: a study of the factors underlying speech browsing behaviour. In CH198, 247-248,1998.  ",
      "doi": "10.1145/286498.286731"
    },
    {
      "text": "Wlaittaker, S., Hyland, P, and Wiley, M. Filochat: handwritten notes provide access to recorded conversations. In CH194, 271-277, 1994.  ",
      "doi": "10.1145/191666.191763"
    },
    {
      "text": "Whittaker, S. and Sidner, C. Email overload: exploring personal information management of email. In CH196, 276-283, 1996.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Wilcox, L., Schilit, W., and Sawhney. Dynomite: a dynamically organized ink and audio notebook. In CH197, 186-193, 1997.  ",
      "doi": "10.1145/258549.258700"
    }
  ]
}