{
  "doi": "10.1145/332040.332497",
  "title": "Non-isomorphic 3D rotational techniques",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "540-547",
  "year": 2000,
  "badges": [],
  "abstract": "This paper demonstrates how non-isomorphic rotational mappings and interaction techniques can be designed and used to build effective spatial 3D user interfaces. In this paper, we develop a mathematical framework allowing us to design non-isomorphic 3D rotational mappings and techniques, investigate their usability properties, and evaluate their user performance characteristics. The results suggest that non-isomorphic rotational mappings can be an effective tool in building high-quality manipulation dialogs in 3D interfaces, allowing our subjects to accomplish experimental tasks 13% faster without a statistically detectable loss in accuracy. The current paper will help interface designers to use non-isomorphic rotational mappings effectively.",
  "tags": [
    "interactive 3D rotations",
    "motor control",
    "interaction techniques",
    "6DOF input devices",
    "3D user interfaces"
  ],
  "authors": [
    {
      "name": "Ivan Poupyrev",
      "institution": "ATR MIC Research Laboratories, 2-2 Hikaridai, Seika, Soraku-gun, Kyoto 619-02, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593278",
      "orcid": "missing"
    },
    {
      "name": "Suzanne Weghorst",
      "institution": "HIT Lab, University of Washington, Box 352142, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100490395",
      "orcid": "missing"
    },
    {
      "name": "Sidney Fels",
      "institution": "Department of ECE, University of British Columbia, Vancouver, BC Canada, V6T 1Z4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327488395",
      "orcid": "0000-0001-9279-9021"
    }
  ],
  "references": [
    {
      "text": "Boritz, J., Booth, K., A study of interactive 3D point location in a computer simulated virtual environment. Proceedings of VRST'97. 1997. ACM. pp. 181-187.  ",
      "doi": "10.1145/261135.261168"
    },
    {
      "text": "Bowman, D., Hodges, L., An evaluation of techniques for grabbing and manipulating remote objects in immersive virtual environments. Proceedings of 13DCG. 1997. ACM. pp. 35-38.  ",
      "doi": "10.1145/253284.253301"
    },
    {
      "text": "Britton, E., Lipscomb, j., Pique, M., Making nested rotations convenient for the user. Proceedings of SIGGRAPH'78. 1978. ACM. pp. 222-227.  ",
      "doi": "10.1145/800248.807394"
    },
    {
      "text": "Buxton, W., There's more to interaction then meets the eye: some issues in manual input. In User Centered System Design: New Perspectives on Human-Computer Interaction, D. Norman and S. Draper, Editors. 1986, Lowrence Erlbaum, pp. 319-337. ",
      "doi": "10.5555/87725.87734"
    },
    {
      "text": "Chen, M., Mountford, S., Sellen, A., A study in interactive 3D rotation using 2-D control devices. Proceedings of SIGGRAPH'88. 1988. ACM. pp. 121 -- 129.  ",
      "doi": "10.1145/54852.378497"
    },
    {
      "text": "Fitts, P., Jones, R., Compatibility: spatial characteristics of stimulus and response codes. Journal of Experimental Psychology, 1953 (46).",
      "doi": ""
    },
    {
      "text": "Gould, J., Smith, K., Angular displacement of the visual feedback in motion. Science, 1962(137): pp. 619-620.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Tullio, J., Pausch, R., et al., Usability analysis of 3D rotation techniques. Proc. ofACM UIST'97. 1997. pp. 1-10.  ",
      "doi": "10.1145/263407.263408"
    },
    {
      "text": "Hultquits, J., A Vrtual Trackball. In Graphics Gems L 1990, Academic Press. pp. 462-463. ",
      "doi": "10.5555/90767.90901"
    },
    {
      "text": "Jenkins, W., Connor, M., Some design factors in making settings on a linear scale. Journal of Applied Psychology, 1949. 33(4): pp. 395-409.",
      "doi": ""
    },
    {
      "text": "Knight, J., Manual control and tracking. In Handbook of human factors, Salvendy, Ed. 1987, John Wiley&amp;S. pp. 182-218.",
      "doi": ""
    },
    {
      "text": "Mine, M., Brooks, F., Sequin, C., Moving objects in space: exploiting proprioception in virtual-environment interaction. Proceedings ofSIGGRAPH'97. 1997. ACM. pp. 19-26.  ",
      "doi": "10.1145/258734.258747"
    },
    {
      "text": "Pierce, J., Steams, B., Pausch, R., Voodoo Dolls: Seamless interaction at the multiple scales in virtual environments. Proceedings of I3DCG'99. 1999. ACM. pp. 141-145.  ",
      "doi": "10.1145/300523.300540"
    },
    {
      "text": "Poupyrev, I., Billinghurst, M., Weghorst, S., Ichikawa, T., Go- Go Interaction Technique: Non-Linear Mapping for Direct Manipulation in VR. Proc. of UIST'96. 1996. ACM. pp. 79-80.  ",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Poupyrev, 1., Weghorst, S., Billinghurst, M., Ichikawa, T., Egocentric object manipulation in virtual environments: empirical evaluation of interaction techniques. Computer Graphics Forum, EUROGRAPHICS'98 issue, 1998. 17(3): pp. 41-52.",
      "doi": ""
    },
    {
      "text": "Poupyrev, I., Weghorst, S., Otsuka, T., lchikawa, T., Amplifying rotations in 3D interfaces. Proc. of CHI'99 Conference Abstracts, Late Breaking Results. 1999. ACM. pp. 256-257.  ",
      "doi": "10.1145/632716.632874"
    },
    {
      "text": "Shoemake, K., Animating rotations with quaternion curves. Proceedings ofSIGGRAPH'85. 1985. ACM. pp. 245-254.  ",
      "doi": "10.1145/325334.325242"
    },
    {
      "text": "Shoemake, K., ARCBALL: a user interface for specifying three-dimensional orientation using a mouse. Proceedings of Graphics Interface'92. 1992. pp. 151-156. ",
      "doi": "10.5555/155294.155312"
    },
    {
      "text": "Smith, T., Smith, K., Feedback-control mechanisms of human behavior. In Handbook of human factors, G. Salvendy, Editor. 1987, John Wiley and Sons. pp. 251-293.",
      "doi": ""
    },
    {
      "text": "Song, D., Norman, M., Nonlinear interactive motion control techniques for virtual space navigation. Proceedings of VRAIS'93. 1993. IEEE. pp. 111-117.",
      "doi": "10.1109/VRAIS.1993.380790"
    },
    {
      "text": "Stoakley, R., Conway, M., Pausch, R., Virtual reality on a WIM: interactive worlds in miniature. Proceedings of CHI'95. 1995. pp. 265-272.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Wang, Y., MacKenzie, L., Object manipulation in virtual environments: relative size matters. Proceedings of CHI'99. 1999. ACM. pp. 48-55.  ",
      "doi": "10.1145/302979.302989"
    },
    {
      "text": "Ware, C., Rose, J., Rotating virtual objects with real handles. ACM Transactions on Computer-Human Interaction, 1999. 6(2): pp. 162-180.  ",
      "doi": "10.1145/319091.319102"
    },
    {
      "text": "Zhai, S., Human performance in six degrees of freedom input control, Ph.D. Thesis, Department of Industrial Engineering. 1995, University of Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Zhai, S., Milgram, P., Buxton, W., The influence of muscle groups on performance of multiple degree-of-freedom input. Proceedings of CHI'96. 1996. ACM. pp. 308-315.  ",
      "doi": "10.1145/238386.238534"
    }
  ]
}