{
  "doi": "10.1145/332040.332410",
  "title": "Talking in circles: designing a spatially-grounded audioconferencing environment",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "81-88",
  "year": 2000,
  "badges": [],
  "abstract": "This paper presents Talking in Circles, a multimodal audioconferencing environment whose novel design emphasizes spatial grounding with the aim of supporting naturalistic group interaction behaviors. Participants communicate primarily by speech and are represented as colored circles in a two-dimensional space. Behaviors such as subgroup conversations and social navigation are supported through circle mobility as mediated by the environment and the crowd and distance-based attenuation of the audio. The circles serve as platforms for the display of identity, presence and activity: graphics are synchronized to participants' speech to aid in speech-source identification and participants can sketch in their circle, allowing a pictorial and gestural channel to complement the audio. We note user experiences through informal studies as well as design challenges we have faced in the creation of a rich environment for computer-mediated communication.",
  "authors": [
    {
      "name": "Roy Rodenstein",
      "institution": "Sociable Media Group, MIT Media Lab, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100093118",
      "orcid": "missing"
    },
    {
      "name": "Judith S. Donath",
      "institution": "Sociable Media Group, MIT Media Lab, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223099",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M., Hindus, D., Mainwaring, S., Starr, B. Hanging on the 'wire: A field study of an audio-only media space. In A CM Transactions on Computer- Human Interaction, March 1997, 4(1), pp. 39-66.  ",
      "doi": "10.1145/244754.244756"
    },
    {
      "text": "Benford, S., Brown, C., Reynard, G., Greenhalgh, C. Shared Spaces: Transportation, Artificiality and Spatiality. In Proceedings of CSCW '96, ACM, 1996, pp. 77-86.  ",
      "doi": "10.1145/240080.240196"
    },
    {
      "text": "Chalfonte, B., Fish, R. S., Kraut, R. E. Expressive Richness: A Comparison of Speech and Text As Media for Revision. In Proceedings of CHI '91, ACM, 1991, pp. 21-26.  ",
      "doi": "10.1145/108844.108848"
    },
    {
      "text": "Chapanis, A. Interactive Human Communication. Scientific American. 232, 1975, pp. 36-42.",
      "doi": ""
    },
    {
      "text": "Cherry, E. C. Some experiments on the recognition of speech with one and with two ears. Journal of the Acoustical Society of America, 25, 1953, pp. 975-979.",
      "doi": ""
    },
    {
      "text": "Donath, J. The Illustrated Conversation. Multimedia Tools and Applications, 1, March 1995.  ",
      "doi": "10.1007/BF01261226"
    },
    {
      "text": "Erickson, T. et al. Socially Translucent Systems: Social Proxies, Persistent Conversation, and the Design of \"Babble.\" In Proceedings of CHI '99, ACM, 1999, pp. 72-79.  ",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "Greenhalgh, C., Benford, S. MASSIVE: a collaborative virual environment for teleconferencing. ACM Transactions on Computer-Human Interaction. 2(3), 1995.  ",
      "doi": "10.1145/210079.210088"
    },
    {
      "text": "Harrison, S., Dourish, P. Re-Place-ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of CSCW '96, ACM, 1996, pp. 67-76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hindus, D., Ackerman, M. S., Mainwaring, S., Starr, B. Thunderwire: A Field Study of an Audio-Only Media Space. In Proceedings of CSCW '96, ACM, 1996, pp. 238-247.  ",
      "doi": "10.1145/240080.240262"
    },
    {
      "text": "Isaacs, E. A., Tang, J. C. What Video Can and Can't Do for Collaboration: a Case Study. In Proceedings of Multimedia '93, ACM, 1993, pp. 199-206.  ",
      "doi": "10.1145/166266.166289"
    },
    {
      "text": "Java Sound API. Sun Microsystems, Inc. http ://j ava.sun.com/products/j ava-media/sound",
      "doi": ""
    },
    {
      "text": "Kansas.Sun Microsystems, Inc. http ://research. sun.com/research/ics/kansas.html",
      "doi": ""
    },
    {
      "text": "Krauss, R. M., Bricker, P.D. Effects of transmission delay and access delay on the efficiency of verbal communication. Journal of the Acoustic Society of America. 41, 1967, pp. 286-292.",
      "doi": ""
    },
    {
      "text": "Kroll, B.M. Cognitive egocentrism and the problem of audience awareness in written discourse. Research in the Teaching of English. 12, 1978, pp. 269-281.",
      "doi": ""
    },
    {
      "text": "Kurlander, D., Skelly, T., Salesin, D. Comic Chat. In Proceedings of SiGGPeq_PH, 1996, pp. 225-236.  ",
      "doi": "10.1145/237170.237260"
    },
    {
      "text": "McDaniel, S. E., Olson, G. M., Magee, J. C. Identifying and Analyzing Multiple Threads in Computer-Mediated and Face-to-Face Conversations. In Proceedings of CSCW '96, ACM, 1996, pp. 39-47.  ",
      "doi": "10.1145/240080.240187"
    },
    {
      "text": "Milgram, S. The Individual in a Social World. Reading, MA: Addison-Wesley, 1977.",
      "doi": ""
    },
    {
      "text": "Nakanishi, H., Yoshida, C., Nishimura, T., Ishida, T. FreeWalk: Supporting Casual Meetings in a Network. In Proceedings of CSCW '96, ACM, 1996, pp. 308- 314.  ",
      "doi": "10.1145/240080.240314"
    },
    {
      "text": "O'Conaill, B., Whittaker, S., Wilbur, S. Conversations Over Video Conferences: An Evaluation fo the Spoken Aspects of Video-Mediated Communication. Human- Computer Interaction. 8, 1993, pp. 389-428.",
      "doi": ""
    },
    {
      "text": "The Palace, Inc. The Palace. http://www.thepalace.com",
      "doi": ""
    },
    {
      "text": "Picard, R. Affective Computing. Cambridge, MA: MIT Press, 1997. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Progressive Networks, Inc., http://www.real.com",
      "doi": ""
    },
    {
      "text": "Rutter, D.R. The role of cuelessness in social interaction: An examination of teaching by telephone. In Roger, D. and P. Bull (ed.), Conversation: An Interdisciplinary Perspective. Multilingual Matters, 1989.",
      "doi": ""
    },
    {
      "text": "Savetz, K., Randall, N., Lepage, Y. MBONE: Multicasting Tomorrow's lnternet. IDG, 1996. ",
      "doi": "10.5555/546729"
    },
    {
      "text": "Schmandt, C. Audio Hallway: a Virtual Acoustic Environment for Browsing. In Proceedings of UIST '98, San Francisco, CA: ACM, 1998, pp. 163-170.  ",
      "doi": "10.1145/288392.288597"
    },
    {
      "text": "Sellen, A. J. Speech Patterns In Video-Mediated Conversations. In Proceedings of CHI '92, ACM, 1992, pp. 49-59.  ",
      "doi": "10.1145/142750.142756"
    },
    {
      "text": "Singer, A., Hindus, D., Stifelman, L., White, S. Tangible Progress: Less Is More In Somewire Audio Spaces. In Proceedings of CHI '99, ACM, 1999, pp. 104-111.  ",
      "doi": "10.1145/302979.303007"
    },
    {
      "text": "Smith, G. Cooperative Virtual Environments: lessons from 2D multi user interfaces. In Proceedings of CSCW '96, ACM, 1996, pp. 390-398.  ",
      "doi": "10.1145/240080.240350"
    },
    {
      "text": "Tang, J.C. Findings from observational studies of collaborative work. International Journal of Man- Machine Studies. 34(2), 1991, pp. 143-160.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "University College London. Robust Audio Tool. http://www-mice.cs.ucl.ac.uk/multimedia/software/rat",
      "doi": ""
    },
    {
      "text": "Viegas, F. B., Donath, J. S. ChatCircles. In Proceedings of CHI '99, ACM, 1999, pp. 9-16.  ",
      "doi": "10.1145/302979.302981"
    },
    {
      "text": "Whyte, W. H. City: Rediscovering the Center. NY: Doubleday, 1988",
      "doi": ""
    }
  ]
}