{
  "doi": "10.1145/332040.332044",
  "title": "Predicting text entry speed on mobile phones",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "9-16",
  "year": 2000,
  "badges": [],
  "abstract": "We present a model for predicting expert text entry rates for several input methods on a 12-key mobile phone keypad. The model includes a movement component based on Fitts' law and a linguistic component based on digraph, or letter-pair, probabilities. Predictions are provided for one-handed thumb and two-handed index finger input. For the traditional multi-press method or the lesser-used two-key method, predicted expert rates vary from about 21 to 27 words per minute (wpm). The relatively new T9 method works with a disambiguating algorithm and inputs each character with a single key press. Predicted expert rates vary from 41 wpm for one-handed thumb input to 46 wpm for two-handed index finger input. These figures are degraded somewhat depending on the user's strategy in coping with less-than-perfect disambiguation. Analyses of these strategies are presented.",
  "authors": [
    {
      "name": "Miika Silfverberg",
      "institution": "Nokia Research Center, P.O. Box 407, FIN-00045 Nokia Group, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658980659",
      "orcid": "missing"
    },
    {
      "name": "I. Scott MacKenzie",
      "institution": "Dept. of Mathematics & Statistics, York University, Toronto, Ontario, Canada M3J 1P3",
      "img": "/do/10.1145/contrib-81100367406/rel-imgonly/me8.jpg",
      "acmid": "81100367406",
      "orcid": "missing"
    },
    {
      "name": "Panu Korhonen",
      "institution": "Nokia Research Center, P.O. Box 407, FIN-00045 Nokia Group, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100008260",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellman, T., and MacKenzie, I. S. A probabilistic character layout strategy for mobile text entry, Proc of Graphics Interface '98. Toronto: CIPS, 1998, 168-176.",
      "doi": ""
    },
    {
      "text": "Bohan, M., Phipps, C. A., Chaparro, A., and Halcomb, C. G. A psychophysical comparison of two stylus-driven soft keyboards, Proc of Graphics Interface '99. Toronto: CIPS, 1999. ",
      "doi": "10.5555/351631.351662"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. The psychology of human-computer interaction, (Hillsdale, N J: Lawrence Erlbaum, 1983). ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Drury, C. G., and Hoffmann, E. R. A model for movement time on data-entry keyboards, Ergonomics 35 (1992), 129-147.",
      "doi": ""
    },
    {
      "text": "Epps, B. W. Comparison of six cursor control devices based on Fitts' law models, Proc Human Factors Society. Santa Monica, CA: HFS, 1986, 327-331.",
      "doi": ""
    },
    {
      "text": "Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement, Journal of Experimental Psychology 47 (1954), 381-391.",
      "doi": ""
    },
    {
      "text": "(}an, K.-C., and Hoffmann, E. R. Geometrical conditions for ballistic and visually controlled movements, Ergonomics 31 (1988), 829-839.",
      "doi": ""
    },
    {
      "text": "Grover, D. L., King, M. T., and Kuschler, C. A. Patent No. US5818437, Reduced keyboard disambiguating computer. Tegic Communications, Inc., Seattle, WA (1998).",
      "doi": ""
    },
    {
      "text": "ISO/IEC 9995-8. Information systems - Keyboard layouts for text and office systems - Part 8: Allocation of letters to the keys of a numeric keypad, International Organisation for Standardisation, 1994.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction 7 (1992), 91-139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I. S., and Buxton, W. Extending Fitts' law to two-dimensional tasks, Proc of CH192. New York: ACM, 1992, 219-226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "MacKenzie, I. S., Sellen, A., and Buxton, W. A comparison of input devices in elemental pointing and dragging tasks, Proc of CH191. New York: ACM, 1991, 161-166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "MacKenzie, I. S., and Zhang, S. The design and evaluation of a high-performance soft keyboard, Proc of CH199. New York: ACM, 1999, 25-3 i.  ",
      "doi": "10.1145/302979.302983"
    },
    {
      "text": "Martin, G. L. Configuring a numeric keypad for a touch screen, Ergonomics 31 (1988), 945-953.",
      "doi": ""
    },
    {
      "text": "Soukoreff, W., and MacKenzie, I. S. Theoretical upper and lower bounds on typing speeds using a stylus and keyboard, Behaviour &amp; Information Technology 14 (1995), 370-379.",
      "doi": ""
    }
  ]
}