{
  "doi": "10.1145/332040.332464",
  "title": "Gaze communication using semantically consistent spaces",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "400-407",
  "year": 2000,
  "badges": [],
  "abstract": "This paper presents a design for a user interface that supports improved gaze communication in multi-point video conferencing. We set out to use traditional computer displays to mediate the gaze of remote participants in a realistic manner. Previous approaches typically assume immersive displays, and use live video to animate avatars in a shared 3D virtual world. This shared world is then rendered from the viewpoint of the appropriate avatar to yield the required views of the virtual meeting. We show why such views of a shared space do not convey gaze information realistically when using traditional computer displays. We describe a new approach that uses a different arrangement of the avatars for each participant in order to preserve the semantic significance of gaze. We present a design process for arranging these avatars. Finally, we demonstrate the effectiveness of the new interface with experimental results.",
  "tags": [
    "gaze",
    "virtual meeting",
    "videophones",
    "animation",
    "avatar"
  ],
  "authors": [
    {
      "name": "Michael J. Taylor",
      "institution": "Canon Research Centre Europe, Guildford GU2 5YJ, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410593532",
      "orcid": "missing"
    },
    {
      "name": "Simon M. Rowe",
      "institution": "Canon Research Centre Europe, Guildford GU2 5YJ, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100148729",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M., lngham, R. and McCallin, M. The different functions of gaze. Semiotica, 7:10-32, 1979.",
      "doi": ""
    },
    {
      "text": "Fields, C.I. Virtual space teleconference system. US Patent No 4,400,724, 1981.",
      "doi": ""
    },
    {
      "text": "Finn, K.E., Sellen, A.J. and Wilbur, S.B. (Editors). Videomediated communication. Lawrence Erlbaum Associates, 1997. ",
      "doi": "10.5555/548502"
    },
    {
      "text": "Gibbs, S.J., Arapis, C. and Breiteneder, C.J., TELEPORT- Towards immersive copresence. A CM Multimedia Systems 7(3): pages 214-221, May 1999.  ",
      "doi": "10.1007/s005300050123"
    },
    {
      "text": "Heath, C. and Luff, P. Disembodied conduct: Communication through video in a multi-media office environment. In Proceedings of CHI'91. New Orleans, ACM, 1991.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Heuring, J.J. and Murray, D.W. Visual head tracking and slaving for visual telepresence. In IEEE Intl. Conf. on Robotics and Automation, 1996.",
      "doi": ""
    },
    {
      "text": "Issacs, E.I. and Tang, J.C. What video can and cannot do for collaboration: a case study. Multimedia Systems 2, pages 63- 73, 1994.  ",
      "doi": "10.1007/BF01274181"
    },
    {
      "text": "La Cascia, M. and Sclaroff, S. Fast, Reilable Head Tracking under Varying Illumination. IEEE CVPR pages 604-610, June 1999.",
      "doi": ""
    },
    {
      "text": "Liu, J. Determination of the point of fixation in a head-fixed coordinate system. In 14th Inter. Conf. on Pattern Recognition, August 1998. ",
      "doi": "10.5555/839289.842440"
    },
    {
      "text": "Nakanishi, H. FreeWalk: A 3D Virtual Space for Casual Meetings. IEEE Multimedia, pages 20-28, 6(2), 1999.  ",
      "doi": "10.1109/93.771370"
    },
    {
      "text": "O'Connaill, B., Whittaker, S. and Wilbur, S. Conversations over Video Conferences: An Evaluation of the Spoken Aspects of Video-Mediated Communication. Human-Compter Interaction 8, pages 389-428, 1993.",
      "doi": ""
    },
    {
      "text": "Ohm, J, Griineberg, K., Hendriks, E., lzquierdo, E., Kalivas, D., Karl, M., Papadimatos, D. and Redert, A. A Realtime Hardware System for Stereoscopic Videoconferencing with Viewpoint Adaptation. In International Workshop on Synthetic-Natural Hybrid Coding and Three Dimensional Imaging, pages 147-150, Rhodes 1997.",
      "doi": ""
    },
    {
      "text": "Ohya, J., Kitamura, Y., Kishino, F. and Terashima, N. Virtual space teleconferencing: real-time reproduction of 3D human images. Journal of Visual Communication and Image Representation, 6(1): 1-25, March 1995.",
      "doi": ""
    },
    {
      "text": "Okada, K., Maeda, F., Ichikawaa, Y. and Matsushita, Y. Multiparty Videoconferencing at Virtual Social Distance: MAJIC Design. In Proceedings of CSCW, pages 385-393, 1994.  ",
      "doi": "10.1145/192844.193054"
    },
    {
      "text": "Okada, K., Tanaka, S. and Matsushita, Y. MAJIC and Desktop MAJIC Conferencing System. in Video Program, Proceedings of CSCW, 1996.  ",
      "doi": "10.1145/240080.318421"
    },
    {
      "text": "Raskar, R., Welch, G., Cutts. M, Lake, A., Stesin, L. and Fuchs, H. The office of the future: a unified approach to image-based modeling and spatially immersive displays. In SIGGRAPH, pages 179-188, 1998.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Sellen, A.J. Speech Patterns in Video-Mediated Conversations. In Proceedings CHI, pages 49-59, 1992.  ",
      "doi": "10.1145/142750.142756"
    },
    {
      "text": "Sellen, A.J. Remote Conversations: The Effects of Mediating Talk With Technology. Human-Computer Interaction, volume 10, pages 401-444, 1995.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Valente, S. and Dugelay, J. A Multi-Site Tele-conferencing System Using VR Paradigms. In ECMAST, Milano, Italy, pages 359-374, 1997. ",
      "doi": "10.5555/646771.705393"
    },
    {
      "text": "Vertegaal, R. The GAZE Groupware System: Mediating Joint Attention in Multiparty Communication and Collaboration. in Proceedings CHI, pages 294-301, May 1999.  ",
      "doi": "10.1145/302979.303065"
    }
  ]
}