{
  "doi": "10.1145/332040.332413",
  "title": "Keystroke level analysis of email message organization",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "105-112",
  "year": 2000,
  "badges": [],
  "abstract": "Organization of email messages takes an increasing amount of time for many email users. Research has demonstrated that users develop very different strategies to handle this organization. In this paper, the relationship between the different organization strategies and the time necessary to use a certain strategy is illustrated by a mathematical model based on keystroke-level analysis. The model estimates time usage for archiving and retrieving email messages for individual users. Besides explaining why users develop different strategies to organize email messages, the model can also be used to advise users individually when to start using folders, clean messages, learn the search functionality, and using filters to store messages. Similar models could assist evaluation of different interface designs where the number of items increase with time.",
  "tags": [
    "email",
    "organisation of messages",
    "user",
    "model"
  ],
  "authors": [
    {
      "name": "Olle Bälter",
      "institution": "Interaction and Presentation Laboratory, Nada, Royal Institute of Technology, SE-100 44 Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81100447558/rel-imgonly/modellolle.jpg",
      "acmid": "81100447558",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "B~ilter O. (1997): Strategies for organising email messages, in Proceedings of HCI'97, Springer, London, United Kingdom, pp 21-38. ",
      "doi": "10.5555/646684.702639"
    },
    {
      "text": "B~ilter O. (1998): Electronic mail in a working context. Doctoral thesis, Nada, Royal Institute of Technology, Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Card S., Moran T. &amp; Newell A. (1980): The keystroke-level model for user performance with interactive systems. Communications of the A CM, vol. 23, pp 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card S., Moran T. &amp; Newell A. (1983).' The Psychology of Human Computer Interaction. Lawrence Erlbaum Associates, New Jersey, USA. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Fitts P. M. &amp; Posner M. I. (1967): Human Performance. Wadsworth Publishing.",
      "doi": ""
    },
    {
      "text": "Pliskin N. (1989): Interacting with electronic mail can be a dream or a nightmare: a user's point of view. Interacting with computers, vol. 1, no 3, pp 259-272.  ",
      "doi": "10.1016/0953-5438%2889%2990014-3"
    },
    {
      "text": "Trumbly J., Amett K. &amp; Johnson P. (1994): Productivity gains via an adaptive user interface: an empirical analysis. International Journal of Human-Computer Studies, vol. 40, pp 63-81.  ",
      "doi": "10.1006/ijhc.1994.1004"
    },
    {
      "text": "Trumbly J., Amett K. &amp; Martin M. (1993): Performance effect of matching computer interface characteristics and user skill level. International Journal of Man-Machine Studies, vol. 38, pp 713-724.  ",
      "doi": "10.1006/imms.1993.1033"
    },
    {
      "text": "Whittaker S. &amp; Sidner C. (1996): Email overload: exploring personal information management of email. In Proceedings of CHl'96, pp 276-283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}