{
  "doi": "10.1145/332040.332491",
  "title": "The cubic mouse: a new device for three-dimensional input",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "526-531",
  "year": 2000,
  "badges": [],
  "abstract": "We have developed a new input device that allows users to intuitively specify three-dimensional coordinates in graphics applications. The device consists of a cube-shaped box with three perpendicular rods passing through the center and buttons on the top for additional control. The rods represent the X, Y, and Z axes of a given coordinate system. Pushing and pulling the rods specifies constrained motion along the corresponding axes. Embedded within the device is a six degree of freedom tracking sensor, which allows the rods to be continually aligned with a coordinate system located in a virtual world. We have integrated the device into two visualization prototypes for crash engineers and geologists from oil and gas companies. In these systems the Cubic Mouse controls the position and orientation of a virtual model and the rods move three orthogonal cutting or slicing planes through the model. We have evaluated the device with experts from these domains, who were enthusiastic about its ease of use.",
  "authors": [
    {
      "name": "Bernd Fröhlich",
      "institution": "GMD/IMK.VE, D-53754 Sankt Augustin, Germany",
      "img": "/do/10.1145/contrib-81100162399/rel-imgonly/froehlich-head-shoulder-shot-small.jpg",
      "acmid": "81100162399",
      "orcid": "missing"
    },
    {
      "name": "John Plate",
      "institution": "GMD/IMK.VE, D-53754 Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100272360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cruz-Neira, C., Sandin, D.J., and DeFanti, T.A. Surround-screen Projection-based Virtual Reality: The Design and Implementation of the CAVE. Proceedings of SIGGRAPH '93, 135-142, 1993.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Cutler, L. D., Fr6hlich, B., and Hanrahan, P. Two- Handed Direct Manipulation on the Responsive Workbench. 1997 Symposium on Interactive 3D Graphics, 107-114, 1997.  ",
      "doi": "10.1145/253284.253315"
    },
    {
      "text": "Guiard, Y. Symmetric division of labor in human skilled bimanual action: the kinematic chain as a model. The Journal of Motor Behaviour, 19(4):486-517, 1987.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J.C., and Kassell, N.F.A Survey of Design Issues in Spatial Input. In Proceedings of the A CM Symposium on User Interface Software and Technology, pages 213-222, 1994.  ",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J.C., and Kassell, N.F. Passive real-world interface props for neurosurgical visualization. In Proceedings of A CM CHI'94 Conference on Human Factors in Computing Systems, pages 452--458, 1994  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Kriiger, W., Bohn, C.-A., Fr6hlich, B., Schtith, H., Strauss, W., and Wesche, G. The Responsive Workbench. IEEE Computer, 42-48, July 1995  ",
      "doi": "10.1109/2.391040"
    },
    {
      "text": "Kriiger, W., and Fr6hlich B. The Responsive Workbench. IEEE Computer Graphics and Applications, 12- 15, May 1994  ",
      "doi": "10.1109/38.279036"
    },
    {
      "text": "Mine, M.R., Brooks F. P. Jr., and H. Sequin, C. H. Moving Objects in Space: Exploiting Proprioception In Virtual-Environment Interaction. In SIGGRAPH 97 Conference Proceedings, pages 19-26. August 1997  ",
      "doi": "10.1145/258734.258747"
    },
    {
      "text": "Pausch, R., Burnette, T., Brockway, D., and Weiblen, M.E. Navigation and locomotion in virtual worlds via flight into Hand-Held miniatures. In SIGGRAPH 95 Conference Proceedings, pages 399-400, August 1995.  ",
      "doi": "10.1145/218380.218495"
    },
    {
      "text": "Poston, T., and Serra, L. The Virtual Workbench: Dextrous VR. in Virtual Reality Software and Technology (Proceedings of VRST'94, August 23-26, 1994, Singapore), pages 111-122, August 1994. ",
      "doi": "10.5555/207072.207133"
    },
    {
      "text": "Tramberend, H. Avocado: A Distributed Virtual Reality Framework. Proceedings of VR'99 Conference, Houston, Texas, 14-2 l, March 1999. ",
      "doi": "10.5555/554230.835699"
    },
    {
      "text": "Viega, J., Conway, M. J., Williams G., and Pausch, R. 3D Magic Lenses. In Proceedings of the ACM Symposium on User Interface Software and Technology, Papers: Information Visualization, pages 51-58, 1996.  ",
      "doi": "10.1145/237091.237098"
    }
  ]
}