{
  "doi": "10.1145/332040.332443",
  "title": "Interacting with eye movements in virtual environments",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "265-272",
  "year": 2000,
  "badges": [],
  "abstract": "Eye movement-based interaction offers the potential of easy, natural, and fast ways of interacting in virtual environments. However, there is little empirical evidence about the advantages or disadvantages of this approach. We developed a new interaction technique for eye movement interaction in a virtual environment and compared it to more conventional 3-D pointing. We conducted an experiment to compare performance of the two interaction types and to assess their impacts on spatial memory of subjects and to explore subjects' satisfaction with the two types of interactions. We found that the eye movement-based interaction was faster than pointing, especially for distant objects. However, subjects' ability to recall spatial information was weaker in the eye condition than the pointing one. Subjects reported equal satisfaction with both types of interactions, despite the technology limitations of current eye tracking equipment.",
  "authors": [
    {
      "name": "Vildan Tanriverdi",
      "institution": "Department of Electrical Engineering and Computer Science, Tufts University, Medford, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100091191",
      "orcid": "missing"
    },
    {
      "name": "Robert J. K. Jacob",
      "institution": "Department of Electrical Engineering and Computer Science, Tufts University, Medford, MA",
      "img": "/do/10.1145/contrib-81100438120/rel-imgonly/portrait.jpg",
      "acmid": "81100438120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolt, R.A. Gaze-Orchestrated Dynamic Windows, Computer Graphics, vol. 15, no. 3, pp. 109-119, August 1981.  ",
      "doi": "10.1145/965161.806796"
    },
    {
      "text": "Bolt, R.A. Eyes at the Interface, Proc. A CM Human Factors in Computer Systems Conference, pp. 360-362, 1982.  ",
      "doi": "10.1145/800049.801811"
    },
    {
      "text": "Bowman, D.A., Hodges, L.F., An Evaluation of Techniques for Grabbing and Manipulating Remote Objects in Immersive Virtual Environments, Proceedings of the 1997 Symposium on Interactive 3D Graphics, 1997, pp.35-38  ",
      "doi": "10.1145/253284.253301"
    },
    {
      "text": "Darken, R., Sibert, J., Wayfinding Strategies and Behaviors in Large Virtual Worlds, Proceedings on Human Factors in Computing Systems, CHI'96 pp. 142- 149  ",
      "doi": "10.1145/238386.238459"
    },
    {
      "text": "Doll, W.J., Torkzadeh, G., The measurement of enduser computing satisfaction, MlS-Quarterly, Vol.12, n12, pp.259-274. (1988).  ",
      "doi": "10.2307/248851"
    },
    {
      "text": "Forsberg A., Herndon K., Zeleznik R., Effective Techniques for Selecting Objects in Immersive Virtual Environments, Proc. A CM U1ST'96 Symposium on User Interface Software and Technology (U1ST), 1996.  ",
      "doi": "10.1145/237091.237105"
    },
    {
      "text": "Glenn, F.A., and others, Eye-voice-controlled Interface, Proc. 30th Annual Meeting of the Human Factors Society, pp. 322-326, Santa Monica, Calif., 1986.",
      "doi": ""
    },
    {
      "text": "Jacob, R.J.K., The use of eye movements in humancomputer interaction techniques: what you look at is what you get, A CM Transactions on Information Systems, 9, 3, pp. 152-169(April 1991).  ",
      "doi": "10.1145/123078.128728"
    },
    {
      "text": "Jacob, R.J.K., Eye Tracking in Advanced Interface Design, in Advanced Interface Design and Virtual Environments, ed. W. Barfield and T. Furness, Oxford University Press, Oxford (1994) ",
      "doi": "10.5555/216164.216178"
    },
    {
      "text": "Jacob, R.J.K., A Visual Language for Non-WlMP User interfaces, Proc. IEEE Symposium on Visual Languages pp. 231-238, IEEE Computer Society Press (1996). ",
      "doi": "10.5555/832277.834371"
    },
    {
      "text": "Jacob, R.J.K., Deligiannidis, L., Morrison, S., A Software Model and Specification Language for Non- WIMP User Interfaces, A CM Transactions on Computer-Human Interaction, Vol. 6(1) pp.1-46 (March 1999).  ",
      "doi": "10.1145/310641.310642"
    },
    {
      "text": "Koller, D., Mine, M., Hudson, S., Head-Tracked Orbital Viewing: An Interaction Technique for Immersive Virtual Environments, Proc. A CM UIST'96 Symposium on User Interface Software and Technology (UIST), 1996.  ",
      "doi": "10.1145/237091.237103"
    },
    {
      "text": "Mine M., Brooks Jr.,F.P., Sequin C., Moving Objects in Space; Exploiting Proprioception in Virtual- Environment Interaction, Proceedings SIGGRAPH 97, Los Angeles, CA, pp. 19-26  ",
      "doi": "10.1145/258734.258747"
    },
    {
      "text": "Nielsen, J., Noncommand User Interfaces, Communications of the ACM 36, 4 pp. 83-99 (April 1993)  ",
      "doi": "10.1145/255950.153582"
    },
    {
      "text": "Poupyrev I., Billinghurst M., Weghorst S., Ichikawa T., The Go-Go Interaction Technique: Non-linear Mapping for Direct Manipulation in VR, Proc. A CM Symposium on User Interface Software and Technology (U1ST), 1996.  ",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Shneiderman, B., Norman, K., Questionnaire for User Interface Satisfaction (QUIS), Designing the User Interface, Strategies for Effective Human-Computer Interaction, Second Edition, Addison-Wesley press (1992).",
      "doi": ""
    },
    {
      "text": "Sibert L.E., Jacob, R.J.K., Evaluation of Eye Gaze Interaction Techniques, Proc. ACM CHI'2000 Human Factors in Computing Systems Conference, Addison- Wesley/ACM Press (2000). (in press)  ",
      "doi": "10.1145/332040.332445"
    },
    {
      "text": "Starker, I., Bolt, R.A., A Gaze-Responsive Self- Disclosing Display, Proc. ACM CHI'90 Human Factors in Computing Systems Conference, pp.3-9, Addison- Wesley / ACM Press (1990).  ",
      "doi": "10.1145/97243.97245"
    },
    {
      "text": "Ware C., Mikaelian, H.T., An Evaluation of an Eye Tracker as a Device for Computer Input, Proc. A CM CHI+GI'87 Human Factors in Computing Systems Conference, pp. 183-188, 1987.  ",
      "doi": "10.1145/29933.275627"
    }
  ]
}