{
  "doi": "10.1145/332040.332432",
  "title": "Hedonic and ergonomic quality aspects determine a software's appeal",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "201-208",
  "year": 2000,
  "badges": [],
  "abstract": "The present study examines the role of subjectively perceived ergonomic quality (e.g. simplicity, controllability) and hedonic quality (e.g. novelty, originality) of a software system in forming a judgement of appeal. A hypothesised research model is presented. The two main research question are: (1) Are ergonomic and hedonic quality subjectively different quality aspects that can be independently perceived by the users? and (2) Is the judgement of appeal formed by combining and weighting ergonomic and hedonic quality and which weights are assigned?\nThe results suggest that both quality aspects can be independently perceived by users. Moreover, they almost equally contributed to the appeal of the tested software prototypes. A simple averaging model implies that both quality aspects will compensate each other.\nLimitations and practical implication of the results are discussed.",
  "authors": [
    {
      "name": "Mare Hassenzahl",
      "institution": "Corporate Technology - User Interface Design, Siemens AG, 81730 Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452610717",
      "orcid": "missing"
    },
    {
      "name": "Axel Platz",
      "institution": "Corporate Technology - User Interface Design, Siemens AG, 81730 Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100520446",
      "orcid": "0000-0002-5619-177X"
    },
    {
      "name": "Michael Burmester",
      "institution": "Corporate Technology - User Interface Design, Siemens AG, 81730 Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548038773",
      "orcid": "missing"
    },
    {
      "name": "Katrin Lehner",
      "institution": "Corporate Technology - User Interface Design, Siemens AG, 81730 Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332511683",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, E. and Sanders, E. An evaluation of the fun factor for the Microsoft EasyBall Mouse, in Proc. of the 39th Human Factors and Ergonomics Society Annual Meeting (1995), 311-315.",
      "doi": ""
    },
    {
      "text": "Anderson, N. H. Foundations of information integration theory. Academic Press, New York, NY, 1981.",
      "doi": ""
    },
    {
      "text": "Berlyne, D. E. Curiosity and exploration. Science 153 (1968), 25-33.",
      "doi": ""
    },
    {
      "text": "Bevan, N. and Macleod, M. Usability measurement in context. Behaviour &amp; Information Technology 13 1&amp;2 (1994), 132-145.",
      "doi": ""
    },
    {
      "text": "Burmester, M., Platz, A., Rudolph, U., and Wild, B. Aesthetic design -just an add on? in Proc. of the HC1 '99 (1999), 671-675. ",
      "doi": ""
    },
    {
      "text": "Carroll, J. M. and Thomas, J. C. Fun. SIGCHI Bulletin 19 3 (1988), 21-24.  ",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Beyond Boredom and Anxiety. Jossey-Bass, San Francisco, 1975.",
      "doi": ""
    },
    {
      "text": "Davis, F. D., Bagozzi, R. P., and Warshaw, P. R. Extrinsic and Intrinsic Motivation to Use Computers in the Workplace. Journal of Applied Psychology 22 14 (1992), 1111-1132.",
      "doi": ""
    },
    {
      "text": "Fishbein, M. and Ajzen, I. Belief Attitude, Intention and Behavior. Addison-Wesley, Reading, MA, 1975.",
      "doi": ""
    },
    {
      "text": "Harrison, A. W. and Rainer, R. K. A general measure of user computing satisfaction. Computers in Human Behavior 12 1 (1996), 79-92.",
      "doi": ""
    },
    {
      "text": "Hollnagel, E. Keep cool: The value of affective computer interfaces in a rational world. In Proc. of HCl International '99 (1999), 676-680. ",
      "doi": ""
    },
    {
      "text": "Igbaria, M., Schiffman, S. J., and Wieckowski, T. J. The respective roles of perceived usefulness and perceived fun in the acceptance of microcomputer technology. Behaviour &amp; Information Technology 13 6 (1994), 349- 361.",
      "doi": ""
    },
    {
      "text": "ISO. ISO 9241: Ergonomic requirements for office work with visual display terminals. Part 11: Guidance on usability (1996), International Organization for Standardization.",
      "doi": ""
    },
    {
      "text": "Kim, J. and Moon, J. Y. Designing towards emotional usability in customer interfaces - trustworthiness of cyber-banking system interfaces. Interacting with Computers 10 (1998), 1-29.",
      "doi": ""
    },
    {
      "text": "Kurosu, M. and Kashimura, K.: Apparent usability vs. inherent usability. In CHI '95 Conference Companion. (1995), 292-293.  ",
      "doi": "10.1145/223355.223680"
    },
    {
      "text": "Laurel B. Computers as Theatre. Addison-Wesley, Reading, MA, 1993. ",
      "doi": ""
    },
    {
      "text": "Logan, R. J. Behavioral and emotional usability: Thomson Consumer Electronics, in M. Wiklund (ed.) Usability in Practice. Academic Press, Cambridge, MA, 1994. ",
      "doi": ""
    },
    {
      "text": "Logan, R. J., Augaitis, S., and Renk, T. Design of simplified television remote controls: a case for behavioral and emotional usability, in Proc. of the 38th Human Factors and Ergonomics Society Annual Meeting (1994), 365-369.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. Toward a theory of intrinsically motivating instruction. Cognitive Science 4 (1981), 333-369.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. Heuristics for designing enjoyable user interfaces: Lessons from computer games, in J. C. Thomas and M. L. Schneider (eds.) Human Factors in Computer Systems. Ablex, Norwood, NJ, 1984. ",
      "doi": ""
    },
    {
      "text": "Thurstone, L. L. Multiple factor analysis: A development and expansion of vectors of the mind. University of Chicago Press, Chicago, 1947.",
      "doi": ""
    },
    {
      "text": "Tractinsky, N. Aesthetics and Apparent Usability: Empirically Assessing Cultural and Methodological issues, in Proc. of the CHI '97 (1997), 115-122.  ",
      "doi": "10.1145/258549.258626"
    }
  ]
}