{
  "doi": "10.1145/332040.332469",
  "title": "Force-feedback improves performance for steering and combined steering-targeting tasks",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "423-429",
  "year": 2000,
  "badges": [],
  "abstract": "The introduction of a force-feedback mouse, which provides high fidelity tactile cues via force output, may represent a long-awaited technological breakthrough in pointing device designs. However, there have been few studies examining the benefits of force-feedback for the desktop computer human interface. Ten adults performed eighty steering tasks, where the participants moved the cursor through a small tunnel with varying indices of difficulty using a conventional and force-feedback mouse. For the force-feedback condition, the mouse displayed force that pulled the cursor to the center of the tunnel. The tasks required both horizontal and vertical screen movements of the cursor. Movement times were on average 52 percent faster during the force-feedback condition when compared to the conventional mouse. Furthermore, for the conventional mouse vertical movements required more time to complete than horizontal screen movements. Another ten adults completed a combined steering and targeting task, where the participants navigated through a tunnel and then clicked a small box at the end of the tunnel. Again, force-feedback improved times to complete the task. Although movement times were slower than the pure steering task, the steering index of difficulty dominated the steering-targeting relationship. These results further support that human computer interfaces benefit from the additional sensory input of tactile cues to the human user.",
  "authors": [
    {
      "name": "Jack Tigh Dennerlein",
      "institution": "Harvard University, 665 Huntington Ave, Boston, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81541863856",
      "orcid": "missing"
    },
    {
      "name": "David B. Martin",
      "institution": "Harvard University & Dartmouth College, Hanover, NH",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406600417",
      "orcid": "missing"
    },
    {
      "name": "Christopher Hasser",
      "institution": "Stanford University & Immersion Corporation, 2158 Paragon Drive, San Jose, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100070039",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot J, Zhai S. Beyond Fitts' Law: Models for Trajectory-Based, Proceedings of Conference on Human Factors in Computing Systems, CHI, 1997.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Akamatsu M, Sigeru S, MacKenzie IS. Multimodal Mouse: A mouse-type device with tactile and force display. Presence, 3(1): 73-80, 1994.",
      "doi": "10.1162/pres.1994.3.1.73"
    },
    {
      "text": "American National Standards Institute (ANSI) for Human Factors Engineering of Visual Display Terminal Workstations. Standard No. 100-1988. Human Factors Society, Santa Monica, California, 1988.",
      "doi": ""
    },
    {
      "text": "Armstrong TJ, Martin BJ, Franzblau A, Rempel DM, Johnson PW: Mouse input devices and work-related upper limb disorders. Working With Display Lr~its 94, Elsevier Science, 375-380, 1995",
      "doi": ""
    },
    {
      "text": "Dennerlein JT, Yang M, Perceived Musculoskeletal Loading during Use of A Force-Feedback Computer Mouse, Proceedings of the Human Factors and Ergonomics Conference, Houston, 1999.",
      "doi": ""
    },
    {
      "text": "Eberhardt S, Neverov M, West T, Sanders C. Force Reflection for WIMPs: A Button Acquisition Experiment, Sixth Annual Symposium on Haptic Interfaces, International Mechanical Engineer'ing Congress and Exposition, Dallas Texas, 1997.",
      "doi": ""
    },
    {
      "text": "Fitts PM. The Information Capacity of Human Motor Systems in Controlling the Amplitude of a Movement, Journal of Experimental Psychology, 47: 381-391, 1954.",
      "doi": ""
    },
    {
      "text": "Hasser C, Goldenberg A, Martin K, Rosenberg L. User performance in a GUI pointing task with a lowcost force-feedback computer mouse. Seventh Annual Symposium on Haptic interfaces, International Mechanical Engineering Congress and Exposition, Anaheim, CA, 1998.",
      "doi": ""
    },
    {
      "text": "Johnson PW, Dropkin J, Hewes J, Rempel D: Office ergonomics: motion analysis of computer mouse usage. In: Proceedings of the American Industrial Hygiene Conference and Exposition, Fairfax, VA: AIHA 12-13, 1993.",
      "doi": ""
    },
    {
      "text": "Keamey RE, Stein RB Parameswaran L: Identification of Intrinsic and Reflex Contributions to Human Ankle Stiffness Dynamics, 1EEE Trans. Biomed. Eng., 44(6): 493-504, 1997.",
      "doi": ""
    },
    {
      "text": "Rosenberg L. Virtual Fixtures, Ph.D. Dissertation Stanford University, 1994.",
      "doi": ""
    },
    {
      "text": "Sheridan TB. Telerobotics, automation and human supervisory control. MIT Press, Cambridge, M.A, 1992. ",
      "doi": "10.5555/134291"
    }
  ]
}