{
  "doi": "10.1145/332040.332440",
  "title": "The impact of fluid documents on reading and browsing: an observational study",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "249-256",
  "year": 2000,
  "badges": [],
  "abstract": "Fluid Documents incorporate additional information into a page by adjusting typography using interactive animation. One application is to support hypertext browsing by providing glosses for link anchors. This paper describes an observational study of the impact of Fluid Documents on reading and browsing. The study involved six conditions that differ along several dimensions, including the degree of typographic adjustment and the distance glosses are placed from anchors. Six subjects read and answered questions about two hypertext corpora while being monitored by an eyetracker. The eyetracking data revealed no substantial differenccs in eye behavior between conditions. Gloss placement was significant: subjects required less time to use nearby glosses. Finally, the reaction to the conditions was highly varied, with several conditions receiving both a best and worst rating on the subjective questionnaires. These results suggest implications for the design of dynamic reading environments.",
  "tags": [
    "eye tracking",
    "focus+context",
    "hypertext navigation",
    "fluid documents",
    "on-line reading",
    "studies of dynamic user interfaces",
    "fluid user interfaces"
  ],
  "authors": [
    {
      "name": "Polle T. Zellweger",
      "institution": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100351035/rel-imgonly/81100351035.jpg",
      "acmid": "81100351035",
      "orcid": "missing"
    },
    {
      "name": "Susan Harkness Regli",
      "institution": "Baker Hall 259, Carnegie Mellon University, 5000 Forbes Ave. Pittsburgh, PA and Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100181007/rel-imgonly/sregli-crop.jpg",
      "acmid": "81100181007",
      "orcid": "missing"
    },
    {
      "name": "Jock D. Mackinlay",
      "institution": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81452617082/rel-imgonly/jock.jpg",
      "acmid": "81452617082",
      "orcid": "missing"
    },
    {
      "name": "Bay-Wei Chang",
      "institution": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100247192",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. Aaltonen, A. Hyrskykari, K. Raiha. 101 spots, or how do users read menus? Proc CHI'98, 132-139.  ",
      "doi": "10.1145/274644.274664"
    },
    {
      "text": "B. Bederson, J. Hollan. Pad++: A zooming graphical interface for exploring alternate interface physics. Proc. UIST'94, 17-26.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "J. Bransford, M. Johnson. Considerations of some problems of comprehension. In W.G. Chase (ed.), Visual information processing. New York: Academic Press, 1973,383-438.",
      "doi": ""
    },
    {
      "text": "B. Chang, J. Mackinlay, P. Zellweger, T. Igarashi. A negotiation architecture for fluid documents. Proc. UIST'98, 123-132.  ",
      "doi": "10.1145/288392.288585"
    },
    {
      "text": "J. Conklin. Hypertext: an introduction and survey. IEEE Computer, Sept 1987, 17-41.  ",
      "doi": "10.1109/MC.1987.1663693"
    },
    {
      "text": "G. Furnas. Generalized fisheye views. Proc. CHI'86,16-23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "G. Fumas. Effective view navigation. Proc. CHI'97, 367-374.  ",
      "doi": "10.1145/258549.258800"
    },
    {
      "text": "T. Igarashi, J. Mackinlay, B. Chang, P. Zellweger. Fluid visualization of spreadsheet structures. Proc. Visual Languages '98. ",
      "doi": "10.5555/832279.834481"
    },
    {
      "text": "W. Kintsch. Comprehension: A paradigm for cognition. Cambridge: Cambridge University Press, 1998.",
      "doi": ""
    },
    {
      "text": "T. Kopetzky, M. Miihlh~iuser. Visual preview for link traversal on the World Wide Web. Proc WWW8, 1999. ",
      "doi": "10.1016/S1389-1286%2899%2900050-X"
    },
    {
      "text": "G. Landow. Relationally encoded links and the rhetoric of hypertext. Proc. Hypertext'87, 331-338.  ",
      "doi": "10.1145/317426.317450"
    },
    {
      "text": "G. Marchionini, B. Shneiderman. Finding facts vs. browsing knowledge in hypertext systems. IEEE Computer, Jan 1988, 70- 80.  ",
      "doi": "10.1109/2.222119"
    },
    {
      "text": "C. McKnight, A. Dillon, J. Richardson. A comparison of linear and hypertext formats in information retrieval. In R. McAlesse, C. Green (eds.), Hypertext: State of the art. Oxford: Intellect Books, Ltd., 1990, 10-19.",
      "doi": ""
    },
    {
      "text": "C. Neuwirth, J. Morris, S. Regli, R. Chandhok, G. Wenger. Envisioning communication: Task-tailorable representations of communication in asynchronous work. Proc. CSCW'98, 265- 274.  ",
      "doi": "10.1145/289444.289501"
    },
    {
      "text": "J. Nielsen. Jakob Nielsen's Alertbox for January 11, 1998. http://www.useit.com/alertbox/980111 .html",
      "doi": ""
    },
    {
      "text": "G. Robertson, S. Card, J. Mackinlay. Information visualization using 3D interactive animation. CACM, 36-(4), 1993, 57-71.  ",
      "doi": "10.1145/255950.153577"
    },
    {
      "text": "R. Rosenthal, R.L. Rosnow. Contrast Analysis: Focused comparisons in the analysis of variance. Cambridge: Cambridge University Press, 1985.",
      "doi": ""
    },
    {
      "text": "J. Rouet, J. Levonen, A. Dillon, R. Spiro, eds. Hypertext and Cognition. Lawrence Erlbaum Associates, 1996.",
      "doi": ""
    },
    {
      "text": "D. Stanyer, R. Procter. Improving Web usability with the link lens. Proc. WWW8, 1999. ",
      "doi": "10.1016/S1389-1286%2899%2900034-1"
    },
    {
      "text": "P. Zellweger, B. Chang, J. Mackinlay. Fluid links for informed and incremental link transitions. Proc. Hypertext'98, 50-57.  ",
      "doi": "10.1145/276627.276633"
    },
    {
      "text": "P. Zellweger, B. Chang, J. Mackinlay. Fluid links for informed and incremental hypertext browsing. CHI'99 Extended Abstracts (Video Program, 6:38 minutes), 7-8.  ",
      "doi": "10.1145/632716.632722"
    }
  ]
}