{
  "doi": "10.1145/332040.332451",
  "title": "The effect of task conditions on the comprehensibility of synthetic speech",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "321-328",
  "year": 2000,
  "badges": [],
  "abstract": "A study was conducted with 78 subjects to evaluate the comprehensibility of synthetic speech for various tasks ranging from short, simple e-mail messages to longer news articles on mostly obscure topics. Comprehension accuracy for each subject was measured for synthetic speech and for recorded human speech. Half the subjects were allowed to take notes while listening, the other half were not. Findings show that there was no significant difference in comprehension of synthetic speech among the five different text-to-speech engines used. Those subjects that did not take notes performed significantly worse for all synthetic voice tasks when compared to recorded speech tasks. Performance for synthetic speech in the non note-taking condition degraded as the task got longer and more complex. When taking notes, subjects also did significantly worse within the synthetic voice condition averaged across all six tasks. However, average performance scores for the last three tasks in this condition show comparable results for human and synthetic speech, reflective of a training effect.",
  "tags": [
    "comprehension",
    "text-to-speech",
    "synthetic speech",
    "user study"
  ],
  "authors": [
    {
      "name": "Jennifer Lai",
      "institution": "IBM Corporation/T.J. Watson Research Center, 30 Saw Mill River Road, Hawthorne, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452599499",
      "orcid": "missing"
    },
    {
      "name": "David Wood",
      "institution": "IBM Corporation/T.J. Watson Research Center, 30 Saw Mill River Road, Hawthorne, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615001",
      "orcid": "missing"
    },
    {
      "name": "Michael Considine",
      "institution": "Rice University, 6300 S. Main Street, Houston, Texas",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Francis, A.L., Nusbaum, H.C. (1999). Evaluating the quality of Synthetic Speech. In Gardner-Bonneau, D. (Ed.), Human Factors and Voice Interactive Systems (pp. 63 - 97)",
      "doi": ""
    },
    {
      "text": "Greenspan, S. L., Nusbaum, H.C., and Pisoni D.B. (1988). Perception of synthetic speech produced by rule: lntellibility of eight text-to-speech systems. Behavioral Research Methods, Instruments, and Computers, 18 100-107",
      "doi": ""
    },
    {
      "text": "Klatt, D. H. (1987). Review of text-to-speech conversion for English. The Journal of the Acoustical Society of America. September 1987 (pp. 737- 793)",
      "doi": ""
    },
    {
      "text": "Pisoni, D.B. and Hunnieutt, S. (1980). Perceptual Evaluation of MITalk: The MIT unrestricted text-to-speech system. IEEE International Conference on Acoustics, Speech and Signal Processing (pp. 572-575) New York",
      "doi": ""
    },
    {
      "text": "Pisoni D.B., Nusbaum H.C. &amp; Greene B.G. (1985). Perception of synthetic speech generated by rule. Proceedings of the 1EEE 73:1665-1676",
      "doi": ""
    },
    {
      "text": "Ralston, J.V., Pisoni, D.B., Lively, S.E., Greene, B.G. &amp; Mullennix, J.W. (1991). Comprehension of Synthetic Speech Produced by Rule: Word Monitoring and Sentence-by-Sentence Listening Times. Human Factors 1991, 33(4) (pp. 471-491) ",
      "doi": "10.1177/001872089103300408"
    },
    {
      "text": "Ralston, J.V., Pisoni, D.B., and Muliermix, J.W. (1995). Perception and comprehension of speech. In Syrdal, A.K., Bennett, R.W., Greenspan, S.L. (Eds.), Applied Speech Technology (pp. 233-288) Boca Raton: CRC Press",
      "doi": ""
    },
    {
      "text": "Van Bezooijen, R. &amp; van Heuven, V. (1998) Assessment of Synthesis System. In Gibbon, D., Moore, R. and Winski,R. (Eds.) , Volume 111.\" Spoken Language System Assessment (pp. 1671481} - 249 {563}) Mouton de Gruyer",
      "doi": ""
    },
    {
      "text": "www.toefl.org",
      "doi": ""
    },
    {
      "text": "www.genmagic.com/portico/portico__home.shtml",
      "doi": ""
    },
    {
      "text": "www.webley.com",
      "doi": ""
    }
  ]
}