{
  "doi": "10.1145/332040.332418",
  "title": "Bringing order to the Web: automatically categorizing search results",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "145-152",
  "year": 2000,
  "badges": [],
  "abstract": "We developed a user interface that organizes Web search results into hierarchical categories. Text classification algorithms were used to automatically classify arbitrary search results into an existing category structure on-the-fly. A user study compared our new category interface with the typical ranked list interface of search results. The study showed that the category interface is superior both in objective and subjective measures. Subjects liked the category interface much better than the list interface, and they were 50% faster at finding information that was organized into categories. Organizing search results allows users to focus on items in categories of interest rather than having to browse through all the results sequentially.",
  "authors": [
    {
      "name": "Hao Chen",
      "institution": "School of Information Management & Systems, University of California, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81540489656",
      "orcid": "missing"
    },
    {
      "name": "Susan Dumais",
      "institution": "Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/do/10.1145/contrib-81100134501/rel-imgonly/sdumais02.jpg",
      "acmid": "81100134501",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, R. B., Two digital library interfaces that exploit hierarchical structure. In Proceedings of DAGS95: Electronic Publishing and the Information Superhighway (1995).",
      "doi": ""
    },
    {
      "text": "Chakrabarti, S., Dom, B., Agrawal, R., and Raghavan, P. Scalable feature selection, classification and signature generation for organizing large text databases into hierarchical topic taxonomies. The VLDB Journal 7, (1998), 163-178.  ",
      "doi": "10.1007/s007780050061"
    },
    {
      "text": "Chekuri, C., Goldwasser, M., Raghavan, P. and Upfal, E. Web search using automated classification. In Sixth International World Wide Web Conference, Santa Clara, California, Apr. 1997, Poster POS725.",
      "doi": ""
    },
    {
      "text": "Chen, M., Hearst, M., Hong, J., and Lin, J. Cha-Cha: a system for organizing intranet search results. In Proceedings of the 2nd USENIX Symposium on Internet Technologies and SYSTEMS (USITS) (Boulder CO, October 1999) (to appear). ",
      "doi": "10.5555/1251480.1251485"
    },
    {
      "text": "Dumais, S. T., Platt, J., Heckerman, D. and Sahami, M. Inductive learning algorithms and representations for text categorization. In Proceedings of A CM-CIKM98, Nov. 1998.  ",
      "doi": "10.1145/288627.288651"
    },
    {
      "text": "Hearst, M., and Karadi, C. Searching and browsing text collections with large category hierarchies. In Proceedings of the A CM SIGCHI Conference on Human Factors in Computing Systems (CHI), Conference Companion (Atlanta GA, March 1997).  ",
      "doi": "10.1145/1120212.1120404"
    },
    {
      "text": "Hearst, M., and Pedersen, P. Reexamining the cluster hypothesis: scatter/gather on retrieval results. In Proceedings of 19th Annual International A CM/SIGIR Conference (Zurich 1996).  ",
      "doi": "10.1145/243199.243216"
    },
    {
      "text": "Hearst, M., Pedersen, J., and Karger, D. Scatter/gather as a tool for the analysis of retrieval results. Working Notes of the AAAI Fall Symposium on AI Applications in Knowledge Navigation (Cambridge MA, November 1995).",
      "doi": ""
    },
    {
      "text": "Johnson, B., and Shneiderman, B. Treemaps: a spacefilling approach to the visualization of hierarchical information structures. In Sparks of Innovation in Human-Computer Interaction. Ablex Publishitig Corporation, Norwood NJ, 1993",
      "doi": ""
    },
    {
      "text": "Landauer, T., Egan, D., Remde, J., Lesk, M., Lochbaum, C., and Ketchum, D. Enhancing the usability of text through computer delivery and formative evaluation: the SuperBook project. In Hypertext - A Psychological Perspective. Ellis Horwood, 1993.",
      "doi": ""
    },
    {
      "text": "Maarek, Y., Jacovi, M., Shtalhaim, M., Ur, S., Zernik, D., and Ben Shaul, I.Z. WebCutter: a system for dynamic and tailorable site mapping. In Proceedings of the 6th International World Wide Web Conference (Santa-Clara CA, April 1997). ",
      "doi": "10.5555/283554.283418"
    },
    {
      "text": "Marchionini, G., Plaisant, C., and Komlodi, A. Interfaces and tools for the Library of Congress national digital library program. Information Processing and Management, 34, 535-555, 1998.  ",
      "doi": "10.1016/S0306-4573%2898%2900020-X"
    },
    {
      "text": "Mladenic, D. Turning Yahoo into an automatic web page classifier. In Proceedings of the 13th European Conference on Artificial Intelligence (ECAI'98) 473- 474.",
      "doi": ""
    },
    {
      "text": "Platt, J. Fast training of support vector machines using sequential minimal optimization. In Advances in Kernel Methods -Support Vector Learning. B. Sch61kopf, C. Burges, and A. Smola, eds., MIT Press, (1999). ",
      "doi": "10.5555/299094.299105"
    },
    {
      "text": "Pratt, W. Dynamic organization of search results using the umls. In American Medical lnformatics Association Fall Symposium, 1997.",
      "doi": ""
    },
    {
      "text": "Pratt, W., Hearst, M. and Fagan, L. A knowledge-based approach to organizing retrieved documents. In Proceedings of AAAI-99. ",
      "doi": "10.5555/315149.315232"
    },
    {
      "text": "Shneiderman, B., Feldman, D. and Rose, A. Visualizing digital library search results with categorical and hierarchical axes. CS-TR-3993, UMIACS-TR-99-12. ftp ://ftp.cs.umd. edu/pub/hcil/Reports-Abstracts- Bibliography/99-03html/99-03.html",
      "doi": ""
    },
    {
      "text": "Wittenburg, K. and Sigman, E. Integration of browsing, searching and filtering in an applet for information access. In Proceedings of A CM CH197: Human Factors in Computing Systems, (Atlanta GA, March 1997).  ",
      "doi": "10.1145/1120212.1120400"
    },
    {
      "text": "Zamir, O., and Etzioni, O. Grouper: A dynamic clustering interface to web search results. In Proceedings of WWW8 (Toronto, Canada, May 1999). ",
      "doi": "10.1016/S1389-1286%2899%2900054-7"
    },
    {
      "text": "Zamir, O., and Etzioni, O. Web document clustering: a feasibility demonstration. In Proceedings of the 19th International A CM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '98), 46- 54.  ",
      "doi": "10.1145/290941.290956"
    },
    {
      "text": "http://cha-cha.berkeley.edu/",
      "doi": ""
    },
    {
      "text": "http://search.msn.com/",
      "doi": ""
    },
    {
      "text": "http ://www.inktomi.com/new/press/directory.html/",
      "doi": ""
    },
    {
      "text": "http://www.looksmart.com/",
      "doi": ""
    },
    {
      "text": "http ://www. northernlight.com/",
      "doi": ""
    },
    {
      "text": "http://www.snap.com/",
      "doi": ""
    },
    {
      "text": "http ://www. yahoo.com/",
      "doi": ""
    }
  ]
}