{
  "doi": "10.1145/332040.332435",
  "title": "Tagged handles: merging discrete and continuous manual control",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "225-232",
  "year": 2000,
  "badges": [],
  "abstract": "Discrete and continuous modes of manual control are fundamentally different: buttons select or change state, while handles persistently modulate an analog parameter. User interfaces for many electronically aided tasks afford only one of these modes when both are needed. We describe an integration of two kinds of physical interfaces (tagged objects and force feedback) that enables seamless execution of such multimodal tasks while applying the benefits of physicality; and demonstrate application scenarios with conceptual and engineering prototypes. Our emphasis is on sharing insights gained in a design case study, including expert user reactions.",
  "authors": [
    {
      "name": "Karon E. MacLean",
      "institution": "Interval Research Corp., 1801 C Page Mill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    },
    {
      "name": "Scott S. Snibbe",
      "institution": "Interval Research Corp., 1801 C Page Mill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023637",
      "orcid": "missing"
    },
    {
      "name": "Golan Levin",
      "institution": "MIT Media Lab E15-447, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100404612",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Cohen, M. Withgott, and P. Piernot, \"Logjam: a tangible multi-person interface for video logging,\" in Proc. of the Conference on Human Factors in Computing Systems (CHI '99), Pittsburgh, PA, 1999.]]  ",
      "doi": "10.1145/302979.303013"
    },
    {
      "text": "P. M. Fitts, \"Engineering psychology and equipment design,\" in llandbook of experimental psychology, S. S. Stevens, Ed. New York: John Wiley &amp; Sons, 1951, pp. 1287- 1339.]]",
      "doi": ""
    },
    {
      "text": "G. Fitzmaurice, H. Ishii, and W. Buxton, 'Bricks: laying the foundations for graspable user interfaces,\" in Proc. of Conference on Human Factors in Computing Systems (CHI '95), Denver, CO, pp. 442-449, 1995.]]  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "M.G. Gorbet, M. Orth, and H. Ishii, \"Triangles: Tangible Interface for Manipulation and Exploration of Digital Information Topography,\" in Proc. of the Conference on Human Factors in Computing Systems (CHI '98), Los Angeles, CA, pp. 49-56, 1998.]]  ",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "J. M. Hollerbach and S. C. Jacobsen, 'Uaptic interfaces for teleoperation and virtual environments,\" in Proc. of First Workshop on Simulation and Interaction in Virtual Environments, Iowa City, 1995.]]",
      "doi": ""
    },
    {
      "text": "L. Holmquist, J. Redstrtm, and P. Ljungstrand, \"Token- Based Access to Digital Information,\" in Proc. of First International Symposium on Handheld and Ubiquitous Computing (HUC)'99, Karlsruhe, Germany, 1999.]] ",
      "doi": "10.5555/647985.743869"
    },
    {
      "text": "Immersion Corporation, The Immersion Feel-It Mouse &amp; l- Force Game Controllers. San Jose, CA, 1999.]]",
      "doi": ""
    },
    {
      "text": "K. E. MacLean, \"The Haptic Camera: A Technique for Characterizing and Playing Back Haptic Environments,\" in Proc. of the 5th Ann. Symp. on Haptic Interfaces for Virtual Environments and Teleoperator Systems, ASME/IMECE, Atlanta, GA, DSC-Vol. 58, 1996.]]",
      "doi": ""
    },
    {
      "text": "K. E. MacLean and S. S. Snibbe, \"An Architecture for Haptic Control of Media,\" in Proc. of the 8th Ann. Syrup. on Haptic Interfaces for Virtual Environment and Teleoperator Systems, ASME / IMECE, Nashville, TN, DSC-5B-3, 1999.]]",
      "doi": ""
    },
    {
      "text": "C. Richard, M. Cutkosky, and K. MacLean, \"Friction Identification for Haptic Display,\" in Proc. of the 8th Ann. Symp. on Haptic Interfaces for Virtual Environment and Teleoperator Systems, ASME/IMECE, Nashville, TN, 1999.]]",
      "doi": ""
    },
    {
      "text": "I. Rock and C. S. Harris, \"Vision and Touch,\" Scientific American, vol. 216 (5), pp. 96-104, 1967.]]",
      "doi": ""
    },
    {
      "text": "M. J. Rosen and B. D. Adelstein, \"Design of a two degreeof-freedom manipulandum for tremor research,\" in Proc. of IEEE Frontiers of Engineering and Computing in Health Care, Los Angeles, CA, pp. 47-51, 1984.]]",
      "doi": ""
    },
    {
      "text": "Sensable Technologies, PHANTOM Desktop 3D Touch System. Cambridge, MA, 1998.]]",
      "doi": ""
    },
    {
      "text": "S. S. Snibbe, R. Shaw, K. E. MacLean, J. B. Roderick, K. Johnson, O. Bayley, and W. L. Verplank, 'l-Iaptic Metaphors for Digital Media,\" Interval Research Corp., Palo Alto, TR IRC # 1999-071 (in preparation), 1999.]]",
      "doi": ""
    },
    {
      "text": "M. A. Srinivasan, G. L. Beauregard, and D. Brock, \"The impact of Visual Information on the Haptic Perception of Stiffness in Virtual Environments,\" in Proc. of the 5th Ann. Symp. on Haptic Interfaces for Virtual Environment and Teleoperator Systems, ASME/IMECE, Atlanta, GA, DSC:58, 1996.]]",
      "doi": ""
    },
    {
      "text": "H. Z. Tan, M. A. Srinivasan, B. Eberman, and B. Cheng, 'Human Factors for the Design of Force-Reflecting Haptic Interfaces,\" in Proc. of the 3rd Ann. Symp. on Haptic Interfaces for Virtual Environment and Teleoperator Systems, ASME/IMECE, Chicago, IL, DSC:55-1, 1994.]]",
      "doi": ""
    },
    {
      "text": "B. Ullmer, H. Ishii, and D. Glass, \"mediaBlocks: P hysical Containers, Transports, and Controls for Online Media,\" in Proc. of Siggraph '98, 1998.]]  ",
      "doi": "10.1145/280814.280940"
    },
    {
      "text": "R. Want, K. P. Fishkin, A. Gujar, and B. Harrison, \"Bridging Physical and Virtual Worlds with Electronic Tags,\" in Proc. of The Conference on Human Factors in Computing Systems (CHI '99), Pittsburgh, PA, pp. 370-377, 1999.]]  ",
      "doi": "10.1145/302979.303111"
    },
    {
      "text": "P. M. Yarin, Towards the Distributed Visualization of Usage History, M.S. Thesis, MIT, 1999.]]",
      "doi": ""
    }
  ]
}