{
  "doi": "10.1145/332040.332454",
  "title": "A toolkit for strategic usability: results from workshops, panels, and surveys",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "337-344",
  "year": 2000,
  "badges": [],
  "abstract": "This paper describes the organizational approaches and usability methodologies considered by HCI professionals to increase the strategic impact of usability research within companies. We collected the data from 134 HCI professionals at three conferences: CHI 98, CHI 99, and the Usability Professionals' Association 1999 conference. The results are the first steps towards a toolkit for the usability community that can help HCI practitioners learn from the experiences of others in similar situations.",
  "tags": [
    "corporate planning",
    "usability",
    "HCI professionals",
    "strategic usability",
    "organizational change",
    "methodology"
  ],
  "authors": [
    {
      "name": "Stephanie Rosenbaum",
      "institution": "Tec-Ed, Inc., P.O. Box 1905, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100050235",
      "orcid": "missing"
    },
    {
      "name": "Janice Anne Rohn",
      "institution": "User Experience, Siebel Systems, Inc., 1855 South Grant Street, San Mateo, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100560056",
      "orcid": "missing"
    },
    {
      "name": "Judee Humburg",
      "institution": "JL Humburg Associates, 480 Lytton Avenue, Suite 7, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100043688",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Humburg, J., Rosenbaum, S., and Ramey J. \"Corporate Strategy and Usability Research: A New Partnership,\" in CHI 96 Conference Companion (Vancouver, BC, April 1996), ACM Press, 428.  ",
      "doi": "10.1145/257089.257425"
    },
    {
      "text": "Rohn, J., Rosenbaum, S., and Humburg, J. \"What Makes Strategic Usability Succeed or Fail? Lessons from the Field,\" in Proceedings of the Usability Professionals' Association 8th Annual Conference (Scottsdale, AZ, June-July 1999), Usability Professionals' Association, Inc. 225-248.",
      "doi": ""
    },
    {
      "text": "Rosenbaum, S., Humburg, J., and Rohn, J. \"Unpacking Strategic Usability: Corporate Strategy and Usability Research.\" in CHI 98 Summary, (Los Angeles, CA, April 1998), ACM Press, 205-206.  ",
      "doi": "10.1145/286498.286690"
    },
    {
      "text": "Rosenbaum, S., Rohn, J., Humburg J., Bloomer, S., Dye, K., Nielsen, J., Rinehart, D., and Wixon, D. \"What Makes Strategic Usability Fail? Lessons Learned from the Field,\" in CHI 99 Extended Abstracts, (Pittsburgh, PA, May 1999), ACM Press, 93-94.  ",
      "doi": "10.1145/632716.632773"
    },
    {
      "text": "Rosenbaum, S., Rohn, J., Thomas, J., Humburg, J., Bloomer S., and Czerwinski, M. \"Corporate Strategy and Usability Research: A New Partnership,\" in CHI 97 Extended Abstracts (Atlanta, GA, March 1997), ACM Press, 115-116.  ",
      "doi": "10.1145/1120212.1120286"
    }
  ]
}