{
  "doi": "10.1145/332040.332445",
  "title": "Evaluation of eye gaze interaction",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "281-288",
  "year": 2000,
  "badges": [],
  "abstract": "Eye gaze interaction can provide a convenient and natural addition to user-computer dialogues. We have previously reported on our interaction techniques using eye gaze [10]. While our techniques seemed useful in demonstration, we now investigate their strengths and weaknesses in a controlled setting. In this paper, we present two experiments that compare an interaction technique we developed for object selection based on a where a person is looking with the most commonly used selection method using a mouse. We find that our eye gaze interaction technique is faster than selection with a mouse. The results show that our algorithm, which makes use of knowledge about how the eyes behave, preserves the natural quickness of the eye. Eye gaze interaction is a reasonable addition to computer interaction and is convenient in situations where it is important to use the hands for other tasks. It is particularly beneficial for the larger screen workspaces and virtual environments of the future, and it will become increasingly practical as eye tracker technology matures.",
  "tags": [
    "eye tracking",
    "eye movements",
    "interaction techniques",
    "user interfaces"
  ],
  "authors": [
    {
      "name": "Linda E. Sibert",
      "institution": "Human-Computer Interaction Lab, NCARAI, Naval Research Laboratory, Washington DC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100481248",
      "orcid": "missing"
    },
    {
      "name": "Robert J. K. Jacob",
      "institution": "Department of Electrical Engineering & Computer Science, Tufts University, Medford, MA",
      "img": "/do/10.1145/contrib-81100438120/rel-imgonly/portrait.jpg",
      "acmid": "81100438120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrams, R. A., Meyer, D. E., and Kornblum, S. Speed and accuracy of saccadic eye movements: Characteristics of impulse variability in the oculomotor system. Journal of Experimental Psychology: Human Perception and Performance 15, 3 (1989), 529-543.",
      "doi": ""
    },
    {
      "text": "Bartz, A. E. Eye-movement latency, duration, and response time as a function of angular displacement. Journal of Experimental Psychology 64, 3 (1962), 318- 324.",
      "doi": ""
    },
    {
      "text": "Boff, K. R. and Lincoln, J. E., eds. Engineering Data Compendium: Human Perception and Performance. AAMRL, Wright-Patterson AFB, OH, 1988.",
      "doi": ""
    },
    {
      "text": "Bolt, R. A. Gaze-orchestrated dynamic windows. Computer Graphics 15, 3 (Aug. 1981 ), 109-119.  ",
      "doi": "10.1145/965161.806796"
    },
    {
      "text": "Bolt, R. A. Eyes at the interface. Proc. A CM CHI'82 (1982), 360-362.  ",
      "doi": "10.1145/800049.801811"
    },
    {
      "text": "Bolt, R. A. Eyemovements in Human/Computer Dialogue. AHIG Research Report 92-1, MIT Media Laboratory, 1992.",
      "doi": ""
    },
    {
      "text": "Flagg, B.N. Children and Television: Effects of Stimulus Repetition on Eye Activity. Thesis, Doctor of Education degree, Graduate School of Education, Harvard University, 1977.",
      "doi": ""
    },
    {
      "text": "Glenn III, F. A., Iavecchia, H. P., Ross, L. V., Stokes, J. M., Weiland, W. J., Weiss, D., and Zakland, A. L. Eyevoice-controlled interface, Proc. of the Human Factors Society (1986), 322-326.",
      "doi": ""
    },
    {
      "text": "Jacob, R. J. I~ The use of eye movements in humancomputer interaction techniques: What you look at is what you get. A CM Transactions on Information Systems 9, 3 (April 1991), 152-169.  ",
      "doi": "10.1145/123078.128728"
    },
    {
      "text": "Jacob, R. J. K. What you look at is what you get: Eye movement-based interaction techniques. Proc. A CM CHI'90 (1992), 11-18.  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Jacob, R. J. K. Eye-gaze computer interfaces: What you look at is what you get. IEEE Computer 26, 7 (July 1993), 65-67.",
      "doi": "10.1109/MC.1993.274943"
    },
    {
      "text": "Jacob, R. j. K. What you look at is what you get: Using eye movements as computer input. Proc. Virtual Reality Systems'93 (1993), 164-166.",
      "doi": ""
    },
    {
      "text": "Jacob, R. J. K. Eye movement-based human-computer interaction techniques: Toward non-command interfaces. In Advances in Human-Computer Interaction, Vol. 4, ed. H. R. Hartson and D. Hix, Ablex Publishing Co. (1993), Norwood, N.J., 151-190.",
      "doi": ""
    },
    {
      "text": "Jacob, R. J. K. Eye tracking in advanced interface design. In Advanced Interface Design and Virtual Environments, ed. W. Barfield and T. Furness, Oxford University Press, Oxford, 1994. ",
      "doi": "10.5555/216164.216178"
    },
    {
      "text": "Jacob, R. J. K., Sibert, L. E., Mcfarlane, D. C., and Mullen, M. P. 1994. Integrality and Separability of Input Devices. A CM Transactions on Computer- Human Interaction 1, 1 (1994), 3-26.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Just, M. A. and Carpenter, P. A. A theory of reading: from eye fixations to comprehension. Psychological Review 87, 4 (1980), 329-354.",
      "doi": ""
    },
    {
      "text": "Just, M. A. and Carpenter, P.A. Eye fixations and cognitive processes. Cognitive Psychology 8 (1976), 441-480.",
      "doi": ""
    },
    {
      "text": "Lambert, R.H., Monty, R.A., and Hail, R.J. High-speed Data Processing and Unobtrusive Monitoring of Eye Movements. Behavior Research Methods and Instrumentation 6,6 (1974), 525-530.",
      "doi": ""
    },
    {
      "text": "Olson, J. R., and Olson, G. M. The growth of cognitive modeling in human-computer interaction since gores. Human-Computer Interaction 5 (1990), 221-265.",
      "doi": "10.1207/s15327051hci0502%25263_4"
    },
    {
      "text": "Prablanc, C. and Pelisson, D. Gaze saccade orienting and hand pointing are locked to their goal by quick internal loops. In Attention and Performance XIII: Motor Representation and Control, M. Jeannerof (ed.). Lawrence Erlbaum Associates (1990), Hillsdale, N.J., 653-676.",
      "doi": ""
    },
    {
      "text": "Sheridan, M. R. A reappraisal of fitts' law. Journal of Motor Behavior 11, 3 (1979), 179-188.",
      "doi": ""
    },
    {
      "text": "Sibert, L. E., Templeman, J. N., and Jacob, R. J. K. Evaluation and Analysis of Eye Gaze Interaction. NRL Report, Naval Research Laboratory, Washington, D.C., 2000, in press.",
      "doi": ""
    },
    {
      "text": "Starker, I., and Bolt, R. A. A gaze-responsive selfdisclosing display. Proc. A CM CHI'90 (1990), 3-9.  ",
      "doi": "10.1145/97243.97245"
    },
    {
      "text": "Thorisson, K. R., and Koons, D.B. Unconstrained Eye Tracking in Multi-Modal Natural Dialogue. AHIG Research Report 92-4, MIT Media Laboratory, 1992.",
      "doi": ""
    },
    {
      "text": "Ware, C. and Mikaelian, H. H. An evaluation of an eye tracker as a device for computer input. Proc. A CM CHI'87 (1987), pp. 183-188.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Young, L. R. and Sheena, C. Methods and designs: survey of eye movement recording methods. Behavior Research Methods &amp; Instrumentation 7, 5 (1975), 397- 429",
      "doi": ""
    },
    {
      "text": "Zhai, S., Morimoto, C., and Ihde, S. Manual and Gaze Input Cascaded (MAGIC) Pointing. Proc. A CM CHI'99 (1999), pp. 246-253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}