{
  "doi": "10.1145/332040.332455",
  "title": "Measuring usability: are effectiveness, efficiency, and satisfaction really correlated?",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "345-352",
  "year": 2000,
  "badges": [],
  "abstract": "Usability comprises the aspects effectiveness, efficiency, and satisfaction. The correlations between these aspects are not well understood for complex tasks. We present data from an experiment where 87 subjects solved 20 information retrieval tasks concerning programming problems. The correlation between efficiency, as indicated by task completion time, and effectiveness, as indicated by quality of solution, was negligible. Generally, the correlations among the usability aspects depend in a complex way on the application domain, the user's experience, and the use context. Going through three years of CHI Proceedings, we find that 11 out of 19 experimental studies involving complex tasks account for only one or two aspects of usability. When these studies make claims concerning overall usability, they rely on risky assumptions about correlations between usability aspects. Unless domain specific studies suggest otherwise, effectiveness, efficiency, and satisfaction should be considered independent aspect of usability and all be included in usability testing.",
  "tags": [
    "satisfaction",
    "user studies",
    "information retrival",
    "usability measures",
    "usability testing",
    "efficiency",
    "effectiveness"
  ],
  "authors": [
    {
      "name": "Erik Frøkjær",
      "institution": "Dept. of Computing, University of Copenhagen, Copenhagen ø, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100265136",
      "orcid": "missing"
    },
    {
      "name": "Morten Hertzum",
      "institution": "Centre for Human-Machine Interaction, Risø National Laboratory, Roskilde, Denmark",
      "img": "/do/10.1145/contrib-81100503897/rel-imgonly/aa.jpg",
      "acmid": "81100503897",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "Dept. of Computing, University of Copenhagen, Copenhagen ø, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Bailey, R.W. Performance vs. preference, in Proceedings of the Human Factors and Ergonomics Society 37th Annual Meeting (Seattle WA, October 1993), HFES, 282-285.",
      "doi": ""
    },
    {
      "text": "Bevan, N. Measuring usability as quality of use. Software Quality Journal 4 (1995), 115-150.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P. and Newell, A. The keystrokelevel model for user performance time with interactive systems. Communications of the ACM 23, 7 (1980), 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Cohen, J. and Cohen, P. Applied Multiple Regression~Correlation Analysis for the Behavioral Sciences. Lawrence Erlbaum Associates, Hillsdale NJ, 1975.",
      "doi": ""
    },
    {
      "text": "Gutwin, C. and Greenberg, S. Effects of awareness support on groupware usability, in Proceedings of CHI 98 (Los Angeles CA, May 1998), ACM Press, 511- 518.  ",
      "doi": "10.1145/274644.274713"
    },
    {
      "text": "Hertzum, M. and Frckja~r, E. Browsing and querying in online documentation: A study of user interfaces and the interaction process. A CM Transactions on Computer-Human Interaction 3, 2 (1996), 136-161.  ",
      "doi": "10.1145/230562.230570"
    },
    {
      "text": "ISO 9241-11. Ergonomic requirements for office work with visual display terminals (VDTs) - Part 11: Guidance on usability (1998).",
      "doi": ""
    },
    {
      "text": "Kirakowski, J. and Corbett, M. SUMI: The software usability measurement inventory. British Journal of Educational Technology 24, 3 (1993), 210-212.",
      "doi": ""
    },
    {
      "text": "Naur, P. Intuition in software development, in H. Ehring et al. Formal Methods and Software Development, Vol. 2, Lecture Notes in Computer Science 186, Springer, Berlin, 1985. Also in Naur, P. Computing: A Human Activity. ACM Press/Addison- Wesley, New York, 1992, 449-466.",
      "doi": ""
    },
    {
      "text": "Newman, W. and Taylor, A. Toward a methodology employing critical parameters to deliver performance improvements in interactive systems, in Proceedings of INTERACT 99 (Edinburgh, August 1999), IOS Press, 605-612.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Usability Engineering, Academic Press, Boston, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Nielsen, J. and Levy, J. Measuring usability: Preference vs. performance, Communications of the A CM 37, 4 (1994), 66-75.  ",
      "doi": "10.1145/175276.175282"
    },
    {
      "text": "Omoigui, N., He, L., Gupta, A., Grudin, J. and Sanocki, E. Time-compression: Systems concerns, usage, and benefits, in Proceedings of CH1 99 (Pittsburg PA, May 1999), ACM Press, 136-143.  ",
      "doi": "10.1145/302979.303017"
    },
    {
      "text": "Rasmussen, J. Skills, rules, and knowledge; signals, signs, and symbols, and other distinctions in human performance models. IEEE Transactions on Systems, Man, and Cybernetics SMC-13, 3 (1983), 257-266.",
      "doi": ""
    },
    {
      "text": "Su, L.T. Evaluation measures for interactive information retrieval. Information Processing &amp; Management 28, 4 (1992), 503-516.  ",
      "doi": "10.1016/0306-4573%2892%2990007-M"
    },
    {
      "text": "Van Welie, M., van der Veer, G.C. and Eli~ns, A. Breaking Down Usability, in Proceedings of INTERACT 99 (Edinburgh, August 1999), IOS Press, 613-620.",
      "doi": ""
    },
    {
      "text": "Walker, M.A., Fromer, J., Di Fabbrizio, G., Mestel, C. and Hindle, D. What can I say?: Evaluating a spoken language interface to email, in Proceedings of CHI 98 (Los Angeles CA, May 1998), ACM Press, 582-589.  ",
      "doi": "10.1145/274644.274722"
    }
  ]
}