{
  "doi": "10.1145/332040.332458",
  "title": "Visual similarity of pen gestures",
  "published": "2000-04-01",
  "proctitle": "CHI '00: Proceedings of the SIGCHI conference on Human Factors in Computing Systems",
  "pages": "360-367",
  "year": 2000,
  "badges": [],
  "abstract": "Pen-based user interfaces are becoming ever more popular. Gestures (i.e., marks made with a pen to invoke a command) are a valuable aspect of pen-based UIs, but they also have drawbacks. The challenge in designing good gestures is to make them easy for people to learn and remember. With the goal of better gesture design, we performed a pair of experiments to determine why users find gestures similar. From these experiments, we have derived a computational model for predicting perceived gesture similarity that correlates 0.56 with observation. We will incorporate the results of these experiments into a gesture design tool, which will aid the pen-based UI designer in creating gesture sets that are easier to learn and more memorable.",
  "authors": [
    {
      "name": "A. Chris Long",
      "institution": "Department of Electrical Engineering and Computer Science, University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81540989556",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "Department of Electrical Engineering and Computer Science, University of California at Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    },
    {
      "name": "Lawrence A. Rowe",
      "institution": "Department of Electrical Engineering and Computer Science, University of California at Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81452607913/rel-imgonly/larowe.jpg",
      "acmid": "81452607913",
      "orcid": "missing"
    },
    {
      "name": "Joseph Michiels",
      "institution": "Department of Electrical Engineering and Computer Science, University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332515377",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashby, E G., Maddox, W. T., and Lee, W. W. On the dangers of averaging across subjects when using multidimensional scaling or the similarity-choice model. Psychological Science, May 1994. 5, 3, 144-151.",
      "doi": ""
    },
    {
      "text": "Attneave, F. Dimensions of similarity. American Journal of Psychology, 1950. 63, 516-556.",
      "doi": ""
    },
    {
      "text": "Beck, J., Prazdny, K., and Rosenfeld, A. A theory of textural segmentation, in Human and Machine Vision (Beck, J., Hope, B., and Rosenfeld, A., eds.), vol. 8 of Notes and Reports in Computer Science and Applied Mathematics. Academic Press, New York, NY, 1983 1-38. Proceedings of the Conference on Human and Machine Vision, Aug. 1981.",
      "doi": "10.5555/577753"
    },
    {
      "text": "Briggs, R., Dennis, A., Beck, B., and Nunamaker, Jr., J. Whither the pen-based interface? Journal of Management Information Systems, 1992-1993.9, 3, 71-90. ",
      "doi": "10.1080/07421222.1992.11517968"
    },
    {
      "text": "Buxton, W. There's more to interaction than meets the eye: Some issues in manual input. In User Centered System Design: New Perspectives on Human-Computer Interaction (Norman, D. A. and Draper, S. W., eds.). Lawrence Erlbaum Associates, Hillsdale, N.J, 1986 319-337. ",
      "doi": "10.5555/87725.87734"
    },
    {
      "text": "Chatty, S. and Lecoanet, P. Pen computing for air traffic control. In Human Factors in Computing Systems (SIGCHI Proceedings). ACM, Addison-Wesley, Apr. 1996 87-94.  ",
      "doi": "10.1145/238386.238436"
    },
    {
      "text": "Forsberg, A., Dieterich, M., and Zeleznik, R. The music notepad. In Proceedings of the A CM Symposium on User Interface and Software Technology (UIST). ACM, ACM Press, New York, NY, Nov. 1998 203-210.  ",
      "doi": "10.1145/288392.288608"
    },
    {
      "text": "Frankish, C., Hull, R., and Morgan, P. Recognition accuracy and user acceptance of pen interfaces. In Human Factors in Computing Systems (SIGCHI Proceedings). ACM, Addison- Wesley, Apr. 1995 503-510.  ",
      "doi": "10.1145/223904.223972"
    },
    {
      "text": "International Data Corporation. Smart handheld device market will enjoy robust growth in 1999 and 2000, May 1999. Available at http://www.idc.com/Data/Personal/content/ PS052699PR.htm.",
      "doi": ""
    },
    {
      "text": "Landay, J. and Myers, B. Interactive sketching for the early stages of user interface design. In Human Factors in Computing Systems (SIGCHI Proceedings). ACM, Addison- Wesley, Apr. 1995 43-50.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "Lazarte, A.A. and Schonemann, P.H. Saliency metric for subadditive dissimilarity judgments on rectangles. Perception and Psychophysics, Feb. 1991.49, 2, 142-158.",
      "doi": ""
    },
    {
      "text": "Lee, Y. L. PDA users can express themselves with Graffiti. InfoWorld, Oct 3 1994. 16, 40, 30.",
      "doi": ""
    },
    {
      "text": "Lipscomb, J. A trainable gesture recognizer. Pattern Recognition, Sep. 1991.24, 9, 895-907.  ",
      "doi": "10.1016/0031-3203%2891%2990009-T"
    },
    {
      "text": "Long, Jr., A.C., Landay, J.A., and Rowe, L.A. PDA and gesture use in practice: Insights for designers of pen-based user interfaces. Tech. Rep. UCB//CSD-97 -97 6, U.C. Berkeley, 1997. Available at http://bmrc.berkeley.edu/papers/ 1997/142/142.html. ",
      "doi": "10.5555/893639"
    },
    {
      "text": "Long, Jr., A. C., Landay, J. A., and Rowe, L. A. Implications for a gesture design tool. In Human Factors in Computing Systems (SIGCHI Proceedings). ACM, ACM Press, May 1999 4O-47.  ",
      "doi": "10.1145/302979.302985"
    },
    {
      "text": "Lopresti, D. and Tomkins, A. Computing in the ink domain. In International Conference on Human-Computer Interaction (Anzai, Y., Ogawa, K., and Mori, H., eds.), vol. 1 of Advances in Human Factors~Ergonomics. Information Processing Society of Japan and others, Elsevier Science, Jul. 1995 543- 548.",
      "doi": ""
    },
    {
      "text": "Meyer, A. Pen computing. SIGCHI Bulletin, Jul. 1995.27, 3, 46-90.  ",
      "doi": "10.1145/221296.221308"
    },
    {
      "text": "Moran, T. et al. Implicit structures for pen-based systems within a freeform interaction paradigm. In Human Factors in Computing Systems (SIGCHI Proceedings). ACM, Addison- Wesley, Apr. 1995 487-494.  ",
      "doi": "10.1145/223904.223970"
    },
    {
      "text": "Morrel-Samuels, E Clarifying the distinction between lexical and gestural commands. International Journal of Man- Machine Studies, 1990. 32, 581-590.  ",
      "doi": "10.1016/S0020-7373%2805%2980034-3"
    },
    {
      "text": "Pier, K. and Landay, J.A. Issues for location-independent interfaces. Tech. Rep. ISTL92-4, Xerox Palo Alto Research Center, Dec 1992.",
      "doi": ""
    },
    {
      "text": "Reeves, B. and Nass, C. The media equation: how people treat computers, television, and new media like real people and places. Center for the Study of Language and Information; Cambridge University Press, Stanford, Calif.: Cambridge {England}; New York, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Rubine, D. Specifying gestures by example. In Computer Graphics. ACM SIGGRAPH, Addison Wesley, Jul. 1991 329-337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Tapia, M. and Kurtenbach, G. Some design refinements and principles on the appearance and behavior of marking menus. In Proceedings of the ACM Symposium on User Interface and Software Technology (UIST). ACM, Nov. 1995 189-195.  ",
      "doi": "10.1145/215585.215973"
    },
    {
      "text": "Thomas, H. Spatial models and multidimensional scaling of random shapes. American Journal of Psychology, 1968.81, 4, 551-558.",
      "doi": ""
    },
    {
      "text": "Wolf, C., Rhyne, J., and Ellozy, H. The paper-like interface. In Designing and Using Human-Computer Interfaces and Knowledge Based Systems (Salvendy, G. and Smith, M., eds.), vol. 12B of Advances in Human Factors~Ergonomics. Elsevier, Sep. 1989 494-501. ",
      "doi": "10.5555/92449.92512"
    },
    {
      "text": "Young, E W. Multidimensional Scaling: History, Theory, and Applications. Lawrence Erlbaum Associates, Hillsdale, NJ, 1987.",
      "doi": ""
    },
    {
      "text": "Zhao, R., Kaufmann, H.-J., Kern, T., and Miiller, W. Penbased interfaces in engineering environments. In International Conference on Human-Computer Interaction (Anzai, Y., Ogawa, K., and Mori, H., eds.), vol. 20B of Advances in Human Factors/Ergonomics. Information Processing Society of Japan and others, Elsevier Science, Jul. 1995 531-536.",
      "doi": ""
    }
  ]
}