{
  "doi": "10.1145/3313831.3376577",
  "title": "The Role of Everyday Sounds in Advanced Dementia Care",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Best Paper"
  ],
  "abstract": "The representation of sounds derived from everyday life can be beneficial for people with dementia by evoking memories and emotional responses. Despite this potential, integrating sound and sound-based interventions in care facilities has not received much research attention. In this paper, we present the findings from a field study that explored the responses of 19 people with advanced dementia to a selection of everyday sounds presented to them in a care home and the role of these responses in the care environment. To study this, we deployed Vita, a 'pillow-like' sound player, in two dementia care facilities for four weeks, during which observations were recorded. Afterwards, we conducted interviews with caregivers who used Vita in everyday care practice. Our findings reveal how everyday sounds provided by Vita stimulated meaningful conversation, playfulness, and connection between residents and caregivers. Furthermore, we propose design implications for integrating everyday sounds in dementia care.",
  "authors": [
    {
      "name": "Maarten Houben",
      "institution": "Eindhoven University of Technology & Tilburg University, Eindhoven & Tilburg, Netherlands",
      "img": "/do/10.1145/contrib-99659178085/rel-imgonly/nieuwe_foto_reduced_size_trimmed.jpg",
      "acmid": "99659178085",
      "orcid": "0000-0002-6571-1925"
    },
    {
      "name": "Rens Brankaert",
      "institution": "University of Technology Eindhoven & Fontys University of Applied Sciences, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068300",
      "orcid": "missing"
    },
    {
      "name": "Saskia Bakker",
      "institution": "Philips Experience Design, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324487449",
      "orcid": "missing"
    },
    {
      "name": "Gail Kenning",
      "institution": "University of Technology Sydney, Sydney, NSW, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261298",
      "orcid": "missing"
    },
    {
      "name": "Inge Bongers",
      "institution": "Tilburg University, Tilburg, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441971",
      "orcid": "missing"
    },
    {
      "name": "Berry Eggen",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100262920",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tjeerd C. Andringa and J. Jolie L. Lanser. 2013. How pleasant sounds promote and annoying sounds impede health: A cognitive approach. Int. J. Environ. Res. Public Health 10, 4 (April 2013), 1439--1461. DOI:https://doi.org/10.3390/ijerph10041439",
      "doi": ""
    },
    {
      "text": "Arlene J. Astell, Maggie P. Ellis, Norman Alm, Richard Dye, and Gary Gowans. 2010. Stimulating People with Dementia to Reminisce Using Personal and Generic Photographs. Int. J. Comput. Heal. 1, 2 (2010), 177--198. DOI:https://doi.org/10.1504/IJCIH.2010.037461",
      "doi": "10.1504/IJCIH.2010.037461"
    },
    {
      "text": "Amee Baird and Séverine Samson. 2009. Memory for Music in Alzheimer's Disease: Unforgettable? Neuropsychol. Rev. 19, 1 (May 2009), 85--101. DOI:https://doi.org/10.1007/s11065-009--9085--2",
      "doi": ""
    },
    {
      "text": "Amee Baird and Séverine Samson. 2015. Music and dementia. In Progress in Brain Research, Eckart Altenmüller, Stanley Finger and François Boller (eds.). Elsevier, 207--235. DOI:https://doi.org/10.1016/bs.pbr.2014.11.028",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Elise van den Hoven, and Berry Eggen. 2012. Knowing by ear: leveraging human attention abilities in interaction design. J. Multimodal User Interfaces 5, 3--4 (February 2012), 197--209. DOI:https://doi.org/10.1007/s12193-011-0062--8",
      "doi": ""
    },
    {
      "text": "Ashok J. Bharucha, Vivek Anand, Jodi Forlizzi, Mary Amanda Dew, Charles F. Reynolds, Scott Stevens, and Howard Wactlar. 2009. Intelligent Assistive Technology Applications to Dementia Care: Current Capabilities, Limitations, and Future Challenges. Am. J. Geriatr. Psychiatry 17, 2 (February 2009), 88--104. DOI:https://doi.org/10.1097/JGP.0b013e318187dde5",
      "doi": ""
    },
    {
      "text": "Karin Bijsterveld and José van. Dijck. 2009. Sound Souvenirs: Audio Technologies, Memory and Cultural Practices. Amsterdam University Press, Amsterdam. DOI:https://doi.org/10.5117/9789089641328",
      "doi": ""
    },
    {
      "text": "Kirsten A. van den Bosch, Tjeerd C. Andringa, Deniz Başkent, and Carla Vlaskamp. 2016. The Role of Sound in Residential Facilities for People With Profound Intellectual and Multiple Disabilities. J. Policy Pract. Intellect. Disabil. 13, 1 (March 2016), 61--68. DOI:https://doi.org/10.1111/jppi.12147",
      "doi": ""
    },
    {
      "text": "Kirsten A. van den Bosch, Tjeerd C. Andringa, Wolter Peterson, Wied A. J. J. M. Ruijssenaars, and Carla Vlaskamp. 2017. A comparison of natural and non-natural soundscapes on people with severe or profound intellectual and multiple disabilities. J. Intellect. Dev. Disabil. 42, 3 (July 2017), 301--307. DOI:https://doi.org/10.3109/13668250.2016.1250251",
      "doi": ""
    },
    {
      "text": "Rens Brankaert and Elke den Ouden. 2017. The design-driven living lab: a new approach to exploring solutions to complex societal challenges. Technol. Innov. Manag. Rev. 7, 1 (May 2017), 44--51.",
      "doi": ""
    },
    {
      "text": "Rens Brankaert, Elke den Ouden, and Aarnout Brombacher. 2015. Innovate dementia: the development of a living lab protocol to evaluate interventions in context. info 17, 4 (June 2015), 40--52. DOI:https://doi.org/10.1108/info-01--2015-0010",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qual. Res. Psychol. 3, 2 (January 2006), 77--101. DOI:https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "D. Brooker and L. Duce. 2000. Wellbeing and activity in dementia: A comparison of group reminiscence therapy, structured goal-directed group activity and unstructured time. Aging Ment. Health 4, 4 (November 2000), 354--358. DOI:https://doi.org/10.1080/713649967",
      "doi": ""
    },
    {
      "text": "Dawn Brooker. 2003. What is person-centred care in dementia? Rev. Clin. Gerontol. 13, 03 (August 2003), 215--222. DOI:https://doi.org/10.1017/S095925980400108X",
      "doi": ""
    },
    {
      "text": "Bennett M. Brooks, Brigitte Schulte-Fortkamp, Kay S. Voigt, and Alex U. Case. 2014. Exploring our sonic environment through soundscape research & theory. Acoust. Today 10, 1 (2014), 30--40.",
      "doi": ""
    },
    {
      "text": "Sonya Brownie and Susan Nancarrow. 2013. Effects of person-centered care on residents and staff in aged-care facilities: a systematic review. Clin. Interv. Aging 8, (January 2013), 1. DOI:https://doi.org/10.2147/CIA.S38589",
      "doi": ""
    },
    {
      "text": "Caroline Bulsara, Karla Seaman, and Silke Steuxner. 2016. Using sound therapy to ease agitation amongst persons with dementia: a pilot study. Aust. Nurs. Midwifery J. 23, 7 (2016), 38--39.",
      "doi": ""
    },
    {
      "text": "Tim Coughlan, Kerstin Leder Mackley, Michael Brown, Sarah Martindale, Stephan Schlögl, Becky Mallaband, John Arnott, Jettie Hoonhout, Dalila Szostak, Robin Brewer, Erika Poole, Antti Pirhonen, Val Mitchell, Sarah Pink, and Nicolas Hine. 2013. Current issues and future directions in methods for studying technology in the home. PsychNology J. 11, 2 (2013), 159--184.",
      "doi": ""
    },
    {
      "text": "Jeffrey L. Cummings, Frank D. Benson, Mary Ann Hill, and Stephen Read. 1985. Aphasia in dementia of the Alzheimer type. Neurology 35, 3 (March 1985), 394--397. DOI:https://doi.org/10.1212/wnl.35.3.394",
      "doi": ""
    },
    {
      "text": "Jeffrey Cummings, Garam Lee, Aaron Ritter, and Kate Zhong. 2018. Alzheimer's disease drug development pipeline: 2018. Alzheimer's Dement. (New York, N. Y.) 4, (2018), 195--214. DOI:https://doi.org/10.1016/j.trci.2018.03.009",
      "doi": ""
    },
    {
      "text": "Yngve Dahl and Kristine Holbø. 2012. Value Biases of Sensor-Based Assistive Technology: Case Study of a GPS Tracking System Used in Dementia Care. In Proceedings of the Designing Interactive Systems Conference - DIS '12, ACM Press, New York, New York, USA, 572--581. DOI:https://doi.org/10.1145/2317956.2318043",
      "doi": "10.1145/2317956.2318043"
    },
    {
      "text": "Boyd H. Davis and Dena Shenk. 2015. Beyond Reminiscence: Using Generic Video to Elicit Conversational Language. Am. J. Alzheimer's Dis. Other Dementiasr 30, 1 (February 2015), 61--68. DOI:https://doi.org/10.1177/1533317514534759",
      "doi": ""
    },
    {
      "text": "Paul Devos, Francesco Aletta, Pieter Thomas, Karlo Filipan, Mirko Petrovic, Dick Botteldooren, Tara Vander Mynsbrugge, Dominique Van de Velde, and Patricia De Vriendt. 2018. Soundscape design for management of behavioral disorders?: a pilot study among nursing home residents with dementia. In Impact of noise control engineering?: proceedings of Inter-Noise 2018, Institute of Noise Control Engineering of the United States of America, 8.",
      "doi": ""
    },
    {
      "text": "Jan Dewing. 2007. Participatory research: A method for process consent with persons who have dementia. Dementia 6, 1 (February 2007), 11--25. DOI:https://doi.org/10.1177/1471301207075625",
      "doi": ""
    },
    {
      "text": "Berry Eggen. 2016. Interactive Soundscapes of the Future Everyday Life. In Peripheral interaction: challenges and opportunities for HCI in the periphery of attention. 239--251. DOI:https://doi.org/10.1007/978--3--319--29523--7_11",
      "doi": ""
    },
    {
      "text": "Robert M. Emerson, Rachel I. Fretz, and Linda L. Shaw. 2001. Participant observation and fieldnotes. Handb. Ethnogr. (2001), 352--368.",
      "doi": ""
    },
    {
      "text": "Sam Fazio, Douglas Pace, Janice Flinner, and Beth Kallmyer. 2018. The Fundamentals of Person-Centered Care for Individuals With Dementia. Gerontologist 58, suppl_1 (January 2018), S10--S19. DOI:https://doi.org/10.1093/geront/gnx122",
      "doi": ""
    },
    {
      "text": "Yuan Feng, Suihuai Yu, Dirk van de Mortel, Emilia Barakova, Jun Hu, and Matthias Rauterberg. 2019. LiveNature: Ambient Display and Social Robot-Facilitated Multi-Sensory Engagement for People with Dementia. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS'19, ACM Press, New York, NY, USA, 1321--1333. DOI:https://doi.org/10.1145/3322276.3322331",
      "doi": ""
    },
    {
      "text": "Sarah Foley, Nadia Pantidi, and John McCarthy. 2019. Care and design: An ethnography of mutual recognition in the context of advanced dementia. In Conference on Human Factors in Computing Systems - Proceedings, ACM Press, New York, NY, USA, Paper 610, 13 pages. DOI:https://doi.org/10.1145/3290605.3300840",
      "doi": "10.1145/3290605.3300840"
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI'19, ACM Press, New York, New York, USA, Paper 404, 1--13. DOI:https://doi.org/10.1145/3290605.3300634",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "David M. Frohlich. 2004. Audiophotography. Springer Netherlands, Dordrecht. DOI:https://doi.org/10.1007/978--1--4020--2210--4",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the Conference on Human Factors in Computing Systems - CHI '03, ACM Press, New York, New York, USA, 233--240. DOI:https://doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Karen Gold. 2014. But does it do any good? Measuring the impact of music therapy on people with advanced dementia: (Innovative practice). Dementia 13, 2 (2014), 258--264. DOI:https://doi.org/10.1177/1471301213494512",
      "doi": ""
    },
    {
      "text": "Gary Gowans, Jim Campbell, Norm Alm, Richard Dye, Arlene Astell, and Maggie Ellis. 2004. Designing a multimedia conversation aid for reminiscence therapy in dementia care environments. In Extended abstracts of the 2004 conference on Human factors and computing systems - CHI '04, ACM Press, New York, New York, USA, 825--836. DOI:https://doi.org/10.1145/985921.985943",
      "doi": ""
    },
    {
      "text": "Megan E. Graham. 2018. Re-socialising sound: investigating sound, selfhood and intersubjectivity among people living with dementia in long-term care. Sound Stud. 5, 2 (December 2018), 175--190. DOI:https://doi.org/10.1080/20551940.2018.1551051",
      "doi": ""
    },
    {
      "text": "Michael James Hayne and Richard Fleming. 2014. Acoustic design guidelines for dementia care facilities. In Proceedings of 43rd International Congress on Noise Control Engineering: Internoise 2014, Australia: Australian Acoustical Society, 1--10.",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Karin Slegers, and Andrea Wilkinson. 2018. Valuing implicit decision-making in participatory design: A relational approach in design with people with dementia. Design Studies 59, 58--76. DOI:https://doi.org/10.1016/j.destud.2018.06.001",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Karin Slegers, and Pieter Duysburgh. 2015. Codesign with people living with cognitive or sensory impairments: a case for method stories and uniqueness. CoDesign 11, 1 (January 2015), 70--82. DOI:https://doi.org/10.1080/15710882.2015.1020316",
      "doi": ""
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), ACM Press, New York, New York, USA, Paper 514, 1--13. DOI:https://doi.org/10.1145/3173574.3174088",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2019. Foregrounding Everyday Sounds in Dementia. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS '19, ACM Press, New York, New York, USA, 71--83. DOI:https://doi.org/10.1145/3322276.3322287",
      "doi": "10.1145/3322276.3322287"
    },
    {
      "text": "Emily S. Ihara, Catherine J. Tompkins, Megumi Inoue, and Sonya Sonneman. 2019. Results from a person-centered music intervention for individuals living with dementia. Geriatr. Gerontol. Int. 19, 1 (January 2019), 30--34. DOI:https://doi.org/10.1111/ggi.13563",
      "doi": ""
    },
    {
      "text": "Gail Kenning. 2018. Reciprocal design: inclusive design approaches for people with late stage dementia. Des. Heal. 2, 1 (January 2018), 142--162. DOI:https://doi.org/10.1080/24735132.2018.1453638",
      "doi": ""
    },
    {
      "text": "Tom Kitwood. 1997. The experience of dementia. Aging Ment. Heal. 1, 1 (1997), 13--22. DOI:https://doi.org/10.1080/13607869757344",
      "doi": ""
    },
    {
      "text": "Tom Kitwood. 1997. Dementia reconsidered: The person comes first. Open University Press, London.",
      "doi": ""
    },
    {
      "text": "Pia C. Kontos. 2004. Ethnographic reflections on selfhood, embodiment and Alzheimer's disease. Ageing Soc. 24, 6 (November 2004), 829--849. DOI:https://doi.org/10.1017/S0144686X04002375",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), ACM Press, New York, New York, USA, 2175--2188. DOI:https://doi.org/10.1145/3025453.3025522",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Jessica L. Feuston, Caroline Edasis, and Anne Marie Piper. 2018. Making as Expression: Informing Design with People with Complex Communication Needs through Art Therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, New York, New York, USA, Paper 351, 1--16. DOI:https://doi.org/10.1145/3173574.3173925",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Amanda Lazar, Hilaire Thompson, and George Demiris. 2014. A systematic review of the use of technology for reminiscence therapy. Health Educ. Behav. 41, 1 Suppl (October 2014), 51S-61S. DOI:https://doi.org/10.1177/1090198114537067",
      "doi": ""
    },
    {
      "text": "Micheline Lesaffre, Bart Moens, and Frank Desmet. 2017. Monitoring music and movement interaction in people with dementia. In The Routledge Companion to embodied music interaction. Routledge, 294--303.",
      "doi": ""
    },
    {
      "text": "Kiel Long, Lyndsey Bakewell, Roisin McNaney, Konstantina Vasileiou, Mark Atkinson, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2017. Connecting Those That Care: Designing for Transitioning, Talking, Belonging and Escaping. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (CHI '17), ACM Press, New York, New York, USA, 1339--1351. DOI:https://doi.org/10.1145/3025453.3025715",
      "doi": "10.1145/3025453.3025715"
    },
    {
      "text": "Helle Nystrup Lund, Lars Rye Bertelsen, and Lars Ole Bonde. 2016. Sound and music interventions in psychiatry at Aalborg University Hospital. SoundEffects - An Interdiscip. J. Sound Sound Exp. 6, 1 (November 2016), 48--68. DOI:https://doi.org/10.7146/se.v6i1.24912",
      "doi": ""
    },
    {
      "text": "Stine S. Lundgaard and Peter Axel Nielsen. 2019. Personalised Soundscapes in Homes. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS '19, ACM Press, New York, New York, USA, 813--822. DOI:https://doi.org/10.1145/3322276.3322364",
      "doi": ""
    },
    {
      "text": "Eneida Mioshi, Christopher M. Kipps, and John R. Hodges. 2009. Activities of Daily Living in Behavioral Variant Frontotemporal Dementia: Differences in Caregiver and Performance-based Assessments. Alzheimer Dis. Assoc. Disord. 23, 1 (January 2009), 70--76. DOI:https://doi.org/10.1097/WAD.0b013e318182d293",
      "doi": ""
    },
    {
      "text": "Susan L. Mitchell, Joan M. Teno, Dan K. Kiely, Michele L. Shaffer, Richard N. Jones, Holly G. Prigerson, Ladislav Volicer, Jane L. Givens, and Mary Beth Hamel. 2009. The clinical course of advanced dementia. N. Engl. J. Med. 361, 16 (2009), 1529--1538. DOI:https://doi.org/10.1056/NEJMoa0902234",
      "doi": ""
    },
    {
      "text": "Karyn Moffatt, Joanna McGrenere, Barbara Purves, and Maria Klawe. 2004. The participatory design of a sound and image enhanced daily planner for people with aphasia. In Proceedings of the 2004 conference on Human factors in computing systems - CHI '04, ACM Press, New York, New York, USA, 407--414. DOI:https://doi.org/10.1145/985692.985744",
      "doi": "10.1145/985692.985744"
    },
    {
      "text": "Kellie Morrissey and John McCarthy. 2015. Creative and Opportunistic Use of Everyday Music Technologies in a Dementia Care Unit. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition - C&C '15, ACM Press, New York, New York, USA, 295--298. DOI:https://doi.org/10.1145/2757226.2757228",
      "doi": "10.1145/2757226.2757228"
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), ACM Press, New York, New York, USA, 1326--1338. DOI:https://doi.org/10.1145/3025453.3025527",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Kellie Morrissey, Gavin Wood, David Green, Nadia Pantidi, and John McCarthy. 2016. 'I'm a rambler, I'm a gambler, I'm a long way from home': The Place of Props, Music, and Design in Dementia Care. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, ACM Press, New York, New York, USA, 1008--1020. DOI:https://doi.org/10.1145/2901790.2901798",
      "doi": "10.1145/2901790.2901798"
    },
    {
      "text": "Raymond Murray Schafer. 1977. The soundscape: Our sonic environment and the tuning of the world. Vancouver Destin. Books (1977).",
      "doi": ""
    },
    {
      "text": "Gerard Oleksik, David Frohlich, Lorna M. Brown, and Abigail Sellen. 2008. Sonic interventions: Understanding and extending the domestic soundscape. In Conference on Human Factors in Computing Systems - Proceedings, ACM Press, New York, New York, USA, 1419--1428. DOI:https://doi.org/10.1145/1357054.1357277",
      "doi": "10.1145/1357054.1357277"
    },
    {
      "text": "Christina Patterson. 2018. World Alzheimer's report 2018.",
      "doi": ""
    },
    {
      "text": "Alfredo Raglio, Stefania Filippi, Daniele Bellandi, and Marco Stramba-Badiale. 2014. Global music approach to persons with dementia: evidence and practice. Clin. Interv. Aging 9, (2014), 1669--1676. DOI:https://doi.org/10.2147/CIA.S71388",
      "doi": ""
    },
    {
      "text": "Raymond Murray Schafer. 1993. The Soundscape: Our Sonic Environment and the Tuning of the World. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Kimberly Johanna Schelle, Carolina Gomez Naranjo, Martijn ten Bhömer, Oscar Tomico, and Stephan Wensveen. 2015. Tactile Dialogues: Personalization of Vibrotactile Behavior to Trigger Interpersonal Communication. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14, ACM Press, New York, New York, USA, 637--642. DOI:https://doi.org/10.1145/2677199.2687894",
      "doi": "10.1145/2677199.2687894"
    },
    {
      "text": "Sandra Suijkerbuijk, Rens Brankaert, Yvonne A.W. De Kort, Liselore J.A.E. Snaphaan, and Elke Den Ouden. 2015. Seeing the first-person perspective in dementia: A qualitative personal evaluation game to evaluate assistive technology for people affected by dementia in the home context. Interacting with Computers 27, 47--59. DOI:https://doi.org/10.1093/iwc/iwu038",
      "doi": ""
    },
    {
      "text": "Ana Tajadura-Jiménez and Daniel Västfjäll. 2008. Auditory-Induced Emotion: A Neglected Channel for Communication in Human-Computer Interaction. In Affect and Emotion in Human-Computer Interaction. Springer, Berlin, Heidelberg, 63--74.",
      "doi": ""
    },
    {
      "text": "Lisanne Teunissen, Tom Luyten, and Luc de Witte. 2017. Reconnecting People with Dementia by Using the Interactive Instrument CRDL. Stud. Health Technol. Inform. 242, (2017), 9--15.",
      "doi": ""
    },
    {
      "text": "Myrte Thoolen, Rens Brankaert, and Yuan Lu. 2019. Sentic: A Tailored Interface Design for People with Dementia to Access Music. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion - DIS '19 Companion, ACM Press, New York, New York, USA, 57--60. DOI:https://doi.org/10.1145/3301019.3325152",
      "doi": "10.1145/3301019.3325152"
    },
    {
      "text": "David Unbehaun, Daryoush Daniel Vaziri, Konstantin Aal, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Exploring the Potential of Exergames to affect the Social and Daily Life of People with Dementia and their Caregivers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, New York, New York, USA, Paper 62, 1--15. DOI:https://doi.org/10.1145/3173574.3173636",
      "doi": "10.1145/3173574.3173636"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia: An Enquiry into Design in a Hospital Setting. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, ACM Press, New York, New York, USA, 2629. DOI:https://doi.org/10.1145/2207676.2208654",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, New York, New York, USA, 2617--2626. DOI:https://doi.org/10.1145/2470654.2481363",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Jenny Waycott, Hilary Davis, Frank Vetere, Amee Morgans, Alan Gruner, Elizabeth Ozanne, and Lars Kulik. 2014. Captioned photographs in psychosocial aged care: Relationship Building and Boundary Work. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, New York, New York, USA, 4167--4176. DOI:https://doi.org/10.1145/2556288.2557290",
      "doi": "10.1145/2556288.2557290"
    },
    {
      "text": "Bob Woods, Laura O'Philbin, Emma M. Farrell, Aimee E. Spector, and Martin Orrell. 2018. Reminiscence therapy for dementia. Cochrane Database Syst. Rev. 3 (March 2018). DOI:https://doi.org/10.1002/14651858.CD001120.pub3",
      "doi": ""
    },
    {
      "text": "BBC Sound Effects - Research & Education Space. Retrieved from http://bbcsfx.acropolis.org.uk/",
      "doi": ""
    }
  ]
}