{
  "doi": "10.1145/3313831.3376680",
  "title": "The Human in Emotion Recognition on Social Media: Attitudes, Outcomes, Risks",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [],
  "abstract": "Emotion recognition algorithms recognize, infer, and harvest emotions using data sources such as social media behavior, streaming service use, voice, facial expressions, and biometrics in ways often opaque to the people providing these data. People's attitudes towards emotion recognition and the harms and outcomes they associate with it are important yet unknown. Focusing on social media, we interviewed 13 adult U.S. social media users to fill this gap. We find that people view emotions as insights to behavior, prone to manipulation, intimate, vulnerable, and complex. Many find emotion recognition invasive and scary, associating it with autonomy and control loss. We identify two categories of emotion recognition's risks: individual and societal. We discuss findings' implications for algorithmic accountability and argue for considering emotion data as sensitive. Using a Science and Technology Studies lens, we advocate that technology users should be considered as a relevant social group in emotion recognition advancements.",
  "authors": [
    {
      "name": "Nazanin Andalibi",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958798457",
      "orcid": "0000-0002-3257-2527"
    },
    {
      "name": "Justin Buss",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528599",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Puneet Agrawal. 2017. Emotionally connected responses from a digital assistant. Retrieved June 26, 2019 from https://patents.google.com/patent/WO2017078960A1/e n",
      "doi": ""
    },
    {
      "text": "Hessa AlBalooshi, Shahram Rahmanian, and Rahul Venkatesh Kumar. 2018. EmotionXSmartDubai_NLP: Detecting User Emotions In Social Media Text. In Proceedings of the Sixth International Workshop on Natural Language Processing for Social Media, 45--49. Retrieved June 17, 2019 from https://www.aclweb.org/anthology/W18--3508",
      "doi": ""
    },
    {
      "text": "Micah Altman, Alexandra Wood, and Effy Vayena. 2018. A Harm-Reduction Framework for Algorithmic Fairness. IEEE Security & Privacy 16, 3: 34--45. https://doi.org/10.1109/MSP.2018.2701149",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y. Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants. ACM Transactions on Computer-Human Interaction 26, 3: 1--28. https://doi.org/10.1145/3311956",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Tawfiq Ammari, Meredith Ringel Morris, and Sarita Yardi Schoenebeck. 2014. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. In Proceedings of ICWSM 2014.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi. What Happens After Disclosing Stigmatized Experiences on Identified Social Media: Individual, Dyadic, and Social/Network Consequences. In Under Review for CHI 2019.",
      "doi": "10.1145/3290605.3300367"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In CHI 2018. https://doi.org/10.1145/3173574.3173732",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Responding to Sensitive Disclosures on Social Media: A Decision Making Framework. ACM Transactions on Computer-Human Interaction (TOCHI). http://dx.doi.org/10.1145/3241044",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Margaret E. Morris, and Andrea Forte. 2018. Testing Waters, Sending Clues: Indirect Disclosures of Socially Stigmatized Experiences on Social Media. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 1--23. https://doi.org/10.1145/3274288",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression. In Proceedings of the Conference on Computer Supported Cooperative Work & Social Computing (CSCW '17). https://doi.org/10.1145/2998181.2998243",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Ian Barnett and John Torous. 2019. Ethics, Transparency, and Public Health at the Intersection of Innovation and Facebook's Suicide Prevention Efforts. Annals of Internal Medicine. https://doi.org/10.7326/M19-0366",
      "doi": ""
    },
    {
      "text": "Solon Barocas and Danah Boyd. 2017. Engaging the Ethics of Data Science in Practice. Commun. ACM 60, 11: 23--25. https://doi.org/10.1145/3144172",
      "doi": "10.1145/3144172"
    },
    {
      "text": "Lisa Feldman Barrett. 2006. Are Emotions Natural Kinds? Perspectives on Psychological Science 1, 1: 28--58. https://doi.org/10.1111/j.17456916.2006.00003.x",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett, Ralph Adolphs, Stacy Marsella, Aleix M. Martinez, and Seth D. Pollak. 2019. Emotional Expressions Reconsidered: Challenges to Inferring Emotion From Human Facial Movements: Psychological Science in the Public Interest. https://doi.org/10.1177/1529100619832930",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Timothy Berrill, Sarah C. Botwinick, Jonathan L. Gonzales, Kevin Ho, Allison Kundrik, Luke Kwon, Tim LaRowe, Chanh P. Nguyen, Fredy Ramirez, Peter Schaedler, William Ulrich, Amber Wallace, Yuchen Wan, and Benjamin Weinfeld. 2018. What Would You Do?: Design Fiction and Ethics. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (GROUP '18), 244--256. https://doi.org/10.1145/3148330.3149405",
      "doi": "10.1145/3148330.3149405"
    },
    {
      "text": "Natalya N. Bazarova, Yoon Hyung Choi, Victoria Schwanda Sosik, Dan Cosley, and Janis Whitlock. 2015. Social sharing of emotions on Facebook: Channel differences, satisfaction, and replies. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 154--164. Retrieved from http://dl.acm.org/citation.cfm?id=2675297",
      "doi": "10.1145/2675133.2675297"
    },
    {
      "text": "Igor Bilogrevic, Kévin Huguenin, Berker Agir, Murtuza Jadliwala, Maria Gazaki, and Jean-Pierre Hubaux. 2016. A machine-learning based approach to privacy-aware information-sharing in mobile social networks. Pervasive and Mobile Computing 25: 125-- 142. https://doi.org/10.1016/j.pmcj.2015.01.006",
      "doi": "10.1016/j.pmcj.2015.01.006"
    },
    {
      "text": "Robert Brannon. 1976. The male sex role - And what it's done for us lately. In The forty-nine percent majority: The male sex role (Edited by Deborah S. David and Robert Brannon). Addison-Wesley, Reading, MA.",
      "doi": ""
    },
    {
      "text": "John S. Breese and John Eugene Ball. 1999. Modeling a user's emotion and personality in a computer user interface. Retrieved June 26, 2019 from https://patents.google.com/patent/US5987415A/en",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a legacy: responsibilities and relationships in the management of post-mortem data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems Pages 4157--4166, 4157--4166. https://doi.org/10.1145/2556288.2557059",
      "doi": ""
    },
    {
      "text": "Manuel G. Calvo and Lauri Nummenmaa. 2016. Perceptual and affective mechanisms in facial expression recognition: An integrative review. Cognition & Emotion 30, 6: 1081--1106. https://doi.org/10.1080/02699931.2015.1049124",
      "doi": ""
    },
    {
      "text": "R. A. Calvo and S. D'Mello. 2010. Affect Detection: An Interdisciplinary Review of Models, Methods, and Their Applications. IEEE Transactions on Affective Computing 1, 1: 18--37. https://doi.org/10.1109/TAFFC.2010.1",
      "doi": "10.1109/T-AFFC.2010.1"
    },
    {
      "text": "Robyn Caplan, Lauren Hanson, Joan Donovan, and Jeanna Matthews. 2018. Tech Algorithm Briefing: How Algorithms Perpetuate Racial Bias and Inequality. Data & Society. Retrieved from https://datasociety.net/wpcontent/uploads/2018/04/Data_Society_Algorithmic_A ccountability_Primer_FINAL-4.pdf",
      "doi": ""
    },
    {
      "text": "J. M. Carroll. 2000. Five reasons for scenario-based design. Interacting with Computers 13, 1: 43--60. https://doi.org/10.1016/S0953--5438(00)00023-0",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Eric P.S. Baumer, and Munmun De Choudhury. 2019. Who is the \"Human\" in Human-Centered Machine Learning: The Case of Predicting Mental Health from Social Media. Proc. ACM Hum.-Comput. Interact. https://doi.org/10.1145/3359249",
      "doi": "10.1145/3359249"
    },
    {
      "text": "Sheldon Chang. 2018. Determining a mood for a group. Retrieved August 7, 2019 from https://patents.google.com/patent/US10061977/en",
      "doi": ""
    },
    {
      "text": "Hsuan-Ting Chen. 2018. Revisiting the Privacy Paradox on Social Media With an Extended Privacy Calculus Model: The Effect of Privacy Concerns, Privacy Self-Efficacy, and Social Capital on Privacy Management. American Behavioral Scientist 62, 10: 1392--1412. https://doi.org/10.1177/0002764218792691",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Michael Gamon. 2012. Not All Moods Are Created Equal! Exploring Human Emotional States in Social Media. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, and Scott Counts. 2012. Happy, Nervous or Surprised? Classification of Human Affective States in Social Media. In Sixth International AAAI Conference on Weblogs and Social Media. Retrieved July 15, 2019 from https://www.microsoft.com/enus/research/publication/happy-nervous-or-surprisedclassification-of-human-affective-states-in-socialmedia/",
      "doi": ""
    },
    {
      "text": "Sven-Ake Christianson (ed.). 1992. The Handbook of Emotion and Memory: Research and Theory. Psychology Press, Hillsdale, N.J.",
      "doi": ""
    },
    {
      "text": "John Christman. 2018. Autonomy in Moral and Political Philosophy. In The Stanford Encyclopedia of Philosophy (Spring 2018), Edward N. Zalta (ed.). Metaphysics Research Lab, Stanford University. Retrieved August 7, 2019 from https://plato.stanford.edu/archives/spr2018/entries/auto nomy-moral/",
      "doi": ""
    },
    {
      "text": "Mike Conway. 2014. Ethical issues in using Twitter for public health surveillance and research: developing a taxonomy of ethical concepts from the research literature. Journal of Medical Internet Research 16, 12: e290. https://doi.org/10.2196/jmir.3617",
      "doi": ""
    },
    {
      "text": "Mike Conway and Daniel O'Connor. 2016. Social Media, Big Data, and Mental Health: Current Advances and Ethical Implications. Current Opinion in Psychology 9: 77--82. https://doi.org/10.1016/j.copsyc.2016.01.004",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Jason Schultz. 2013. Big Data and Due Process: Toward a Framework to Redress Predictive Privacy Harms. Social Science Research Network, Rochester, NY. Retrieved August 7, 2019 from https://papers.ssrn.com/abstract=2325784",
      "doi": ""
    },
    {
      "text": "Baobao Zhang and Allan Dafoe and Center for the Governance of AI Oxford Future of Humanity Institute, University of. 2019. Artificial Intelligence: American Attitudes and Trends. Retrieved June 13, 2019 from https://governanceai.github.io/US-PublicOpinion-Report-Jan-2019/",
      "doi": ""
    },
    {
      "text": "Melissa Davis, Gareth Herschel, and Jim Hare. 2019. Hype Cycle for Customer Experience Analytics, 2019. Gartner. Retrieved August 8, 2019 from https://www.gartner.com/document/3956037?ref=solr All&refval=227857318&qid=7df2169fe08cf98b6fda1",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared facebook data. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing, 626--638.",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Tony Dokoupil. 2018. Researcher who inspired Cambridge Analytica's data harvesting says era of privacy is over. Retrieved August 7, 2019 from https://www.cbsnews.com/news/michal-kosinskiresearcher-who-inspired-facebook-data-harvestingsays-era-of-privacy-is-over/",
      "doi": ""
    },
    {
      "text": "Dana S Dunn, Kristen R Clinton Goldbach, Judith N Lasker, and Lori J Toedter. 1991. Explaining pregnancy loss: Parents' and physicians' attributions. OMEGA-Journal of Death and Dying 23, 1: 13--23.",
      "doi": ""
    },
    {
      "text": "J. A. Easterbrook. 1959. The effect of emotion on cue utilization and the organization of behavior. Psychological Review 66, 3: 183--201. https://doi.org/10.1037/h0047707",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 2004. Emotions revealed. BMJ 328, Suppl S5: 0405184. https://doi.org/10.1136/sbmj.0405184",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace V Friesen. 1975. Unmasking the face: A guide to recognizing emotions from facial cues.",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4: 1143--1168. https://doi.org/10.1111/j.1083--6101.2007.00367.x",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. \"I Always Assumed That I Wasn't Really That Close to [Her]\": Reasoning About Invisible Algorithms in News Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 153--162. https://doi.org/10.1145/2702123.2702556",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin's Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Casey Fiesler and Blake Hallinan. 2018. \"We Are the Product\": Public Reactions to Online Data Sharing and Privacy Controversies in the Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--13. https://doi.org/10.1145/3173574.3173627",
      "doi": "10.1145/3173574.3173627"
    },
    {
      "text": "Casey Fiesler and Nicholas Proferes. 2018. \"Participant\" Perceptions of Twitter Research Ethics. Social Media + Society 4, 1: 2056305118763366. https://doi.org/10.1177/2056305118763366",
      "doi": ""
    },
    {
      "text": "Janet Finch. 1987. The Vignette Technique in Survey Research. Sociology 21, 1: 105--114. https://doi.org/10.1177/0038038587021001008",
      "doi": ""
    },
    {
      "text": "Brett Q. Ford and James J. Gross. 2019. Why Beliefs About Emotion Matter: An Emotion-Regulation Perspective. Current Directions in Psychological Science 28, 1: 74--81. https://doi.org/10.1177/0963721418806697",
      "doi": ""
    },
    {
      "text": "Andrea Forte, Nazanin Andalibi, and Rachel Greenstadt. 2017. Privacy, Anonymity, and Perceived Risk in Open Collaboration: A Study of Tor Users and Wikipedians. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 1800--1811. https://doi.org/10.1145/2998181.2998273",
      "doi": "10.1145/2998181.2998273"
    },
    {
      "text": "Michel Foucault. 2012. Discipline and Punish: The Birth of the Prison. Knopf Doubleday Publishing Group.",
      "doi": ""
    },
    {
      "text": "Simson Garfinkel, Jeanna Matthews, Stuart S Shapiro, and Jonathan M Smith. 2017. Toward Algorithmic Transparency and Accountability. Communications of the ACM 60. Retrieved August 6, 2019 from https://cacm.acm.org/magazines/2017/9/220423toward-algorithmic-transparency-andaccountability/fulltext",
      "doi": ""
    },
    {
      "text": "Maria Gendron and Lisa Feldman Barrett. 2009. Reconstructing the Past: A Century of Ideas About Emotion in Psychology. Emotion Review 1, 4: 316-- 339. https://doi.org/10.1177/1754073909338877",
      "doi": ""
    },
    {
      "text": "Ysabel Gerrard and Tarleton Gillespie. 2019. When Algorithms Think You Want to Die. Wired. Retrieved February 21, 2019 from https://www.wired.com/story/when-algorithms-thinkyou-want-to-die/",
      "doi": ""
    },
    {
      "text": "Kevin Granville. 2018. Facebook and Cambridge Analytica: What You Need to Know as Fallout Widens - The New York Times. Retrieved from https://www.nytimes.com/2018/03/19/technology/facebook-cambridge-analytica-explained.html",
      "doi": ""
    },
    {
      "text": "Michael Froimowitz Greenzeiger, Ravindra Phulari, and Mehul K. Sanghavi. 2015. Inferring user mood based on user and group characteristic data. Retrieved June 26, 2019 from https://patents.google.com/patent/US8965828B2/en",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson. 2019. Mapping gender transition sentiment patterns via social media data: toward decreasing transgender mental health disparities. Journal of the American Medical Informatics Association. https://doi.org/10.1093/jamia/ocz056",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1176--1190. https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Foad Hamidi, Morgan Klaus Scheuerman, and Stacy M. Branham. 2018. Gender Recognition or Gender Reductionism?: The Social Implications of Embedded Gender Recognition Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--13. https://doi.org/10.1145/3173574.3173582",
      "doi": ""
    },
    {
      "text": "Zenobia Hedge. 2018. Emotion recognition and sentiment analysis market to reach $3.8bn by 2025, says Tractica. IoT Now - How to run an IoT enabled business. Retrieved August 7, 2019 from https://www.iot-now.com/2018/03/08/78263-emotionrecognition-sentiment-analysis-market-reach-3--8bn2025-says-tractica/",
      "doi": ""
    },
    {
      "text": "David M. Herszenhorn. 2014. Heightened Security, Visible and Invisible, Blankets the Olympics. The New York Times. Retrieved August 7, 2019 from https://www.nytimes.com/2014/02/14/sports/olympics/heightened-security-visible-and-invisible-blankets-theolympics.html",
      "doi": ""
    },
    {
      "text": "Andrew C. High, Anne Oeldorf-Hirsch, and Saraswathi Bellur. 2014. Misery rarely gets company: The influence of emotional bandwidth on supportive communication on Facebook. Computers in Human Behavior 34, 0: 79--88. https://doi.org/10.1016/j.chb.2014.01.037",
      "doi": ""
    },
    {
      "text": "Rhidian Hughes. 1998. Considering the Vignette Technique and its Application to a Study of Drug Injecting and HIV Risk and Safer Behaviour. Sociology of Health & Illness 20, 3: 381--400. https://doi.org/10.1111/1467--9566.00107",
      "doi": ""
    },
    {
      "text": "Molly Jackman and Lauri Kanerva. 2016. Evolving the IRB: Building Robust Review for Industry Research. Washington and Lee Law Review Online 72, 3: 442.",
      "doi": ""
    },
    {
      "text": "Rana el Kaliouby and Daniel Abraham Bender. 2014. Mental state well being monitoring. Retrieved August 6, 2019 from https://patents.google.com/patent/US20140200463A1/en?assignee=affectiva&page=2",
      "doi": ""
    },
    {
      "text": "Rana el Kaliouby, Rosalind Picard, and Simon Baron Cohen. 2006. Affective computing and autism. Annals of the New York Academy of Sciences 1093: 228--248. https://doi.org/10.1196/annals.1382.016",
      "doi": ""
    },
    {
      "text": "Youssef Kashef, Rana El Kaliouby, Ahmed Adel OSMAN, Niels Haering, and Viprali Bhatkar. 2014. Mental state analysis using heart rate collection based video imagery. Retrieved August 6, 2019 from https://patents.google.com/patent/WO2014145204A1/e n",
      "doi": ""
    },
    {
      "text": "Yaser Khan, Chris HUYBREGTS, Jaeyoun Kim, and Thomas C. Butcher. 2016. Real-time emotion recognition from audio signals. Retrieved June 11, 2019 from https://patents.google.com/patent/WO2016014321A1/e n",
      "doi": ""
    },
    {
      "text": "Y. Kim, H. Lee, and E. M. Provost. 2013. Deep learning for robust feature generation in audiovisual emotion recognition. In 2013 IEEE International Conference on Acoustics, Speech and Signal Processing, 3687--3691. https://doi.org/10.1109/ICASSP.2013.6638346",
      "doi": ""
    },
    {
      "text": "Peter Kindness, Judith Masthoff, and Chris Mellish. 2017. Designing emotional support messages tailored to stressors. International Journal of Human-Computer Studies 97: 1--22. https://doi.org/10.1016/j.ijhcs.2016.07.010",
      "doi": ""
    },
    {
      "text": "Funda Kivran-Swaine, Jeremy Ting, Jed R. Brubaker, Rannie Teodoro, and Mor Naaman. 2014. Understanding Loneliness in Social Awareness Streams: Expressions and Responses. In Proceedings of the Eighth International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Adam D. I. Kramer, Jamie E. Guillory, and Jeffrey T. Hancock. 2014. Experimental evidence of massivescale emotional contagion through social networks. Proceedings of the National Academy of Sciences 111, 24: 8788--8790. https://doi.org/10.1073/pnas.1320040111",
      "doi": ""
    },
    {
      "text": "Akash Krishnan and Matthew Fernandez. 2013. System and method for recognizing emotional state from a speech signal. Retrieved June 26, 2019 from https://patents.google.com/patent/US8595005B2/en",
      "doi": ""
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Back to the Future: 10 Years of Design Fiction. In Proceedings of the 2015 British HCI Conference (British HCI '15), 210--211. https://doi.org/10.1145/2783446.2783592",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "Changchun Liu, Karla Conn, Nilanjan Sarkar, and Wendy Stone. 2008. Physiology-based affect recognition for computer-assisted intervention of children with Autism Spectrum Disorder. International Journal of Human-Computer Studies 66, 9: 662--677. https://doi.org/10.1016/j.ijhsc.2008.04.003",
      "doi": "10.1016/j.ijhsc.2008.04.003"
    },
    {
      "text": "George Loewenstein and Jennifer S. Lerner. 2003. The role of affect in decision making. In Handbook of affective sciences. Oxford University Press, New York, NY, US, 619--642.",
      "doi": ""
    },
    {
      "text": "Mary Madden. 2014. Americans Consider Certain Kinds of Data to be More Sensitive than Others | Pew Research Center. Retrieved August 7, 2019 from https://www.pewinternet.org/2014/11/12/americansconsider-certain-kinds-of-data-to-be-more-sensitivethan-others/",
      "doi": ""
    },
    {
      "text": "Miguel Malheiros, Sören Preibusch, and M. Angela Sasse. 2013. \"Fairly Truthful\": The Impact of Perceived Effort, Fairness, Relevance, and Sensitivity on Personal Data Disclosure. In Trust and Trustworthy Computing (Lecture Notes in Computer Science), 250-- 266.",
      "doi": ""
    },
    {
      "text": "Lydia Manikonda and Munmun De Choudhury. 2017. Modeling and Understanding Visual Attributes of Mental Health Disclosures in Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 170--181. https://doi.org/10.1145/3025453.3025932",
      "doi": "10.1145/3025453.3025932"
    },
    {
      "text": "Kimball P. Marshall. 1999. Has Technology Introduced New Ethical Problems? Journal of Business Ethics 19, 1: 81--90. https://doi.org/10.1023/A:1006154023743",
      "doi": ""
    },
    {
      "text": "Michael James Matas, Michael Waldman Reckhow, and Yaniv Taigman. 2017. Systems and methods for dynamically generating emojis based on image analysis of facial features. Retrieved June 26, 2019 from https://patents.google.com/patent/US20170140214A1/ en",
      "doi": ""
    },
    {
      "text": "Louise Matsakis. 2018. Online Ad Targeting Does Work-As Long As It's Not Creepy. Wired. Retrieved February 22, 2019 from https://www.wired.com/story/online-ad-targeting-doeswork-as-long-as-its-not-creepy/",
      "doi": ""
    },
    {
      "text": "Adam McCann. 2019. Most Diverse Cities in the U.S. WalletHub. Retrieved August 3, 2019 from https://wallethub.com/edu/most-diverse-cities/12690/",
      "doi": ""
    },
    {
      "text": "Andrew McStay. 2018. Emotional AI: The Rise of Empathic Media. SAGE.",
      "doi": ""
    },
    {
      "text": "Jacob Metcalf, Emily F. Keller, and danah boyd. 2019. Perspectives on Big Data, Ethics, and Society. Council for Big Data, Ethics, and Society. Retrieved August 7, 2019 from https://bdes.datasociety.net/counciloutput/perspectives-on-big-data-ethics-and-society/",
      "doi": ""
    },
    {
      "text": "Michelle N. Meyer. 2015. Two Cheers for Corporate Experimentation: The A/B Illusion and the Virtues of Data-Driven Innovation. Social Science Research Network, Rochester, NY. Retrieved August 7, 2019 from https://papers.ssrn.com/abstract=2605132",
      "doi": ""
    },
    {
      "text": "Jude Mikal, Samantha Hurst, and Mike Conway. 2016. Ethical issues in using Twitter for population-level depression monitoring: a qualitative study. BMC medical ethics 17: 22. https://doi.org/10.1186/s12910016-0105--5",
      "doi": ""
    },
    {
      "text": "Dan Muriello, Lizzy Donahue, Danny Ben-David, Umut Ozertem, and Reshef Shilon. 2018. Under the hood: Suicide prevention tools powered by AI. Facebook Code. Retrieved January 29, 2019 from https://code.fb.com/ml-applications/under-the-hoodsuicide-prevention-tools-powered-by-ai/",
      "doi": ""
    },
    {
      "text": "Anthony Nadler and Lee McGuigan. 2018. An impulse to exploit: the behavioral turn in data-driven marketing. Critical Studies in Media Communication 35, 2: 151--165. https://doi.org/10.1080/15295036.2017.1387279",
      "doi": ""
    },
    {
      "text": "Barak Reuven Naveh. 2015. Techniques for emotion detection and content delivery. Retrieved from https://patents.google.com/patent/US20150242679A1/en",
      "doi": ""
    },
    {
      "text": "William Fielding Ogburn. 1922. Social Change with Respect to Culture and Original Nature. B.W. Huebsch, Incorporated.",
      "doi": ""
    },
    {
      "text": "S. Panwar, P. Rad, K.-K.R. Choo, and M. Roopaei. 2019. Are you emotional or depressed? Learning about your emotional state from your music using machine learning. Journal of Supercomputing 75, 6: 2986-- 3009. https://doi.org/10.1007/s11227-018--2499-y",
      "doi": "10.1007/s11227-018-2499-y"
    },
    {
      "text": "James W Pennebaker. 1995. Emotion, disclosure, & health. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Phelps, Sam Ling, and Marisa Carrasco. 2006. Emotion Facilitates Perception and Potentiates the Perceptual Benefits of Attention. Psychological science 17, 4: 292--299. https://doi.org/10.1111/j.14679280.2006.01701.x",
      "doi": ""
    },
    {
      "text": "Trevor J. Pinch and Wiebe E. Bijker. 1984. The Social Construction of Facts and Artefacts: or How the Sociology of Science and the Sociology of Technology might Benefit Each Other. Social Studies of Science 14, 3: 399--441. https://doi.org/10.1177/030631284014003004",
      "doi": ""
    },
    {
      "text": "Nicholas Proferes. 2017. Information Flow Solipsism in an Exploratory Study of Beliefs About Twitter. Social Media + Society 3, 1: 2056305117698493. https://doi.org/10.1177/2056305117698493",
      "doi": ""
    },
    {
      "text": "Foster Provost and Tom Fawcett. 2013. Data Science and its Relationship to Big Data and Data-Driven Decision Making. Big Data 1, 1: 51--59. https://doi.org/10.1089/big.2013.1508",
      "doi": ""
    },
    {
      "text": "Andrew G. Reece and Christopher M. Danforth. 2017. Instagram photos reveal predictive markers of depression. EPJ Data Science 6, 1: 15. https://doi.org/10.1140/epjds/s13688-017-0110-z",
      "doi": ""
    },
    {
      "text": "Lauren Rhue. 2018. Racial Influence on Automated Perceptions of Emotions. Social Science Research Network, Rochester, NY. Retrieved March 13, 2019 from https://papers.ssrn.com/abstract=3281765",
      "doi": ""
    },
    {
      "text": "Bernard Rimé. 2009. Emotion elicits the social sharing of emotion: Theory and empirical review. Emotion Review 1, 1: 60--85.",
      "doi": ""
    },
    {
      "text": "James A. Russell. 1994. Is there universal recognition of emotion from facial expression? A review of the cross-cultural studies. Psychological Bulletin 115, 1: 102--141. https://doi.org/10.1037/0033--2909.115.1.102",
      "doi": ""
    },
    {
      "text": "Richard Scott Sadowsky, Rana el Kaliouby, Rosalind Wright Picard, Oliver Orion Wilder-Smith, Panu James Turcot, and Zhihong Zheng. 2011. Mental state analysis using web services. Retrieved August 6, 2019 from https://patents.google.com/patent/US20110301433A1/en?assignee=affectiva",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Larry Chan, Kaya De Barbaro, Gregory D. Abowd, and Munmun De Choudhury. 2017. Inferring Mood Instability on Social Media by Leveraging Ecological Momentary Assessments. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3: 95:1--95:27. https://doi.org/10.1145/3130960",
      "doi": "10.1145/3130960"
    },
    {
      "text": "Irving Seidman. 2006. Interviewing as qualitative research: a guide for researchers in education and the social sciences. Teachers College Press, New York.",
      "doi": ""
    },
    {
      "text": "Andrew D. Selbst, Danah Boyd, Sorelle A. Friedler, Suresh Venkatasubramanian, and Janet Vertesi. 2019. Fairness and Abstraction in Sociotechnical Systems. In Proceedings of the Conference on Fairness, Accountability, and Transparency (FAT* '19), 59--68. https://doi.org/10.1145/3287560.3287598",
      "doi": "10.1145/3287560.3287598"
    },
    {
      "text": "Irina Shklovski, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 2347--2356. https://doi.org/10.1145/2556288.2557421",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Natasha Singer. 2018. Creepy or Not? Your Privacy Concerns Probably Reflect Your Politics. The New York Times. Retrieved April 25, 2019 from https://www.nytimes.com/2018/04/30/technology/privacy-concerns-politics.html",
      "doi": ""
    },
    {
      "text": "Michael Skirpan and Casey Fiesler. 2018. Ad Empathy: A Design Fiction. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (GROUP '18), 267--273. https://doi.org/10.1145/3148330.3149407",
      "doi": "10.1145/3148330.3149407"
    },
    {
      "text": "Aaron Smith. 2018. Public Attitudes Toward Computer Algorithms | Pew Research Center. Retrieved January 31, 2019 from http://www.pewinternet.org/2018/11/16/publicattitudes-toward-computer-algorithms/",
      "doi": ""
    },
    {
      "text": "Brad Smith and Harry Shum. 2018. The Future Computed: Artificial Intelligence and its role in society. Microsoft. Retrieved from https://blogs.microsoft.com/wpcontent/uploads/2018/02/The-FutureComputed_2.8.18.pdf",
      "doi": ""
    },
    {
      "text": "Jay Stanleye. 2019. Experts Say \"Emotion Recognition\" Lacks Scientific Foundation. American Civil Liberties Union. Retrieved July 20, 2019 from https://www.aclu.org/blog/privacytechnology/surveillance-technologies/experts-sayemotion-recognition-lacks-scientific",
      "doi": ""
    },
    {
      "text": "Luke Stark. 2016. The emotional context of information privacy. The Information Society 32, 1: 14--27. https://doi.org/10.1080/01972243.2015.1107167",
      "doi": "10.1080/01972243.2015.1107167"
    },
    {
      "text": "Luke Stark. 2018. Algorithmic psychometrics and the scalable subject. Social Studies of Science 48, 2: 204-- 231. https://doi.org/10.1177/0306312718772094",
      "doi": ""
    },
    {
      "text": "Luke Stark. 2018. Facial recognition, emotion and race in animated social media. First Monday 23, 9. https://doi.org/10.5210/fm.v23i9.9406",
      "doi": ""
    },
    {
      "text": "Luke Stark. 2019. Facial recognition is the plutonium of AI. XRDS: Crossroads, The ACM Magazine for Students 25, 3: 50--55. https://doi.org/10.1145/3313129",
      "doi": "10.1145/3313129"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research: Techniques and procedures for developing grounded theory. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "J. Tang, Y. Zhang, J. Sun, J. Rao, W. Yu, Y. Chen, and A. C. M. Fong. 2012. Quantitative Study of Individual Emotional States in Social Networks. IEEE Transactions on Affective Computing 3, 2: 132--144. https://doi.org/10.1109/T-AFFC.2011.23",
      "doi": "10.1109/T-AFFC.2011.23"
    },
    {
      "text": "Tractica. Emotion Recognition and Sentiment Analysis | Tractica. Retrieved August 7, 2019 from https://www.tractica.com/research/emotionrecognition-and-sentiment-analysis/",
      "doi": ""
    },
    {
      "text": "Zeynep Tufekci. 2015. Algorithmic Harms beyond Facebook and Google: Emergent Challenges of Computational Agency. Colorado Technology Law Journal 13: 203.",
      "doi": ""
    },
    {
      "text": "Joseph Turow, Michael Hennessy, Nora Draper, and Ope Akanbi. 2018. Divided We Feel: Partisan Politics Drive Americans' Emotions Regarding Surveillance of Low-Income Populations. Retrieved from https://repository.upenn.edu/asc_papers/543/",
      "doi": ""
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12), 4:1-- 4:15. https://doi.org/10.1145/2335356.2335362",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "Kristen Vaccaro, Dylan Huang, Motahhare Eslami, Christian Sandvig, Kevin Hamilton, and Karrie Karahalios. 2018. The Illusion of Control: Placebo Effects of Control Settings. In Proceedings of the CHI Conference on Human Factors in Computing Systems, 1--13. Retrieved January 7, 2020 from http://dl.acm.org/doi/abs/10.1145/3173574.3173590",
      "doi": "10.1145/3173574.3173590"
    },
    {
      "text": "Yang Wang, Gregory Norice, and Lorrie Faith Cranor. 2011. Who Is Concerned about What? A Study of American, Chinese and Indian Users' Privacy Concerns on Social Network Sites. In Trust and Trustworthy Computing (Lecture Notes in Computer Science), 146--153.",
      "doi": ""
    },
    {
      "text": "Yichen Wang and Aditya Pal. 2015. Detecting Emotions in Social Media: A Constrained Optimization Approach. In IJCAI.",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2016. When a Product Is Still Fictional: Anticipating and Speculating Futures Through Concept Videos. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 121--133. https://doi.org/10.1145/2901790.2901801",
      "doi": "10.1145/2901790.2901801"
    },
    {
      "text": "Richmond Y. Wong, Deirdre K. Mulligan, and John Chuang. 2017. Using Science Fiction Texts to Surface User Reflections on Privacy. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17), 213--216. https://doi.org/10.1145/3123024.3123080",
      "doi": "10.1145/3123024.3123080"
    },
    {
      "text": "Richmond Y. Wong, Ellen Van Wyk, and James Pierce. 2017. Real-Fictional Entanglements: Using Science Fiction and Design Fiction to Interrogate Sensing Technologies. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 567--579. https://doi.org/10.1145/3064663.3064682",
      "doi": "10.1145/3064663.3064682"
    },
    {
      "text": "Meredith GF Worthen. 2013. An invitation to use craigslist ads to recruit respondents from stigmatized groups for qualitative interviews: Qualitative Research. https://doi.org/10.1177/1468794113481791",
      "doi": ""
    },
    {
      "text": "Michael Zimmer. 2010. \"But the data is already public\": on the ethics of research in Facebook. Ethics and Information Technology 12, 4: 313--325. https://doi.org/10.1007/s10676-010--9227--5",
      "doi": "10.1007/s10676-010-9227-5"
    },
    {
      "text": "Michael Zimmer. 2016. OkCupid Study Reveals the Perils of Big-Data Science. Retrieved August 7, 2019 from https://www.wired.com/2016/05/okcupid-studyreveals-perils-big-data-science/",
      "doi": ""
    },
    {
      "text": "Michael Zimmer. 2018. Addressing Conceptual Gaps in Big Data Research Ethics: An Application of Contextual Integrity. Social Media + Society 4, 2: 205630511876830. https://doi.org/10.1177/2056305118768300",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 2015. Big Other: Surveillance Capitalism and the Prospects of an Information Civilization. Social Science Research Network, Rochester, NY. Retrieved August 7, 2019 from https://papers.ssrn.com/abstract=2594754",
      "doi": ""
    }
  ]
}