{
  "doi": "10.1145/3313831.3376750",
  "title": "Practicing Without a License: Design Research as Psychotherapy",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "This paper considers the potential for participants to experience psychotherapeutic effects through their involvement in design research. Drawing on literature in human-computer interaction, psychotherapy, and feminist sociology, I argue that vulnerable participants may experience qualitative interviews therapeutically when they engage in reflexive activity about sensitive topics with researchers who employ psychotherapeutic techniques that encourage disclosure and reflection. I discuss ethical concerns and suggest the need for trauma-informed research practices, updated consent procedures, and revised pedagogy that better support researchers and participants engaged in emotionally charged encounters.",
  "authors": [
    {
      "name": "Tad Hirsch",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503651895",
      "orcid": "0000-0003-1421-3544"
    }
  ],
  "references": [
    {
      "text": "Adler, P. and Adler, P. 1987. Membership Roles in Field Research. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Agar, M. 1986. Speaking of Ethnography. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "American Psychological Association 2017. Ethical Principles of Psychologists and Code of Conduct.",
      "doi": ""
    },
    {
      "text": "Arnold, K. 2014. Behind the mirror: Reflective listening and its Tain in the work of Carl Rogers. The Humanistic Psychologist. 42, 4 (2014), 354--369. https://doi.org/10.1080/08873267.2014.913247.",
      "doi": ""
    },
    {
      "text": "Balaam, M., Comber, R., Clarke, R.E., Windlin, C., Ståhl, A., Höök, K. and Fitzpatrick, G. 2019. Emotion Work in Experience-Centered Design. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19 (Glasgow, Scotland Uk, 2019), 1--12.",
      "doi": ""
    },
    {
      "text": "Bardzell, S. and Bardzell, J. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. (2011), 675.",
      "doi": ""
    },
    {
      "text": "Battarbee, K. and Koskinen, I. 2005. Co-experience: user experience as interaction. CoDesign. 1, 1 (Mar. 2005), 5--18. https://doi.org/10.1080/15710880412331289917.",
      "doi": ""
    },
    {
      "text": "Bennett, C.L. and Rosner, D.K. 2019. The Promise of Empathy: Design, Disability, and Knowing the ?Other.\" (2019), 1--13.",
      "doi": ""
    },
    {
      "text": "Bergen, R.K. 1993. Interviewing survivors of marital rape: doing feminist research on sensitive topics. Researching sensitive topics. C.M. Renzetti and R.M. Lee, eds. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Birch, M. and Miller, T. 2000. Inviting intimacy: The interview as therapeutic opportunity. International Journal of Social Research Methodology. 3, 3 (Jan. 2000), 189--202. https://doi.org/10.1080/13645570050083689.",
      "doi": ""
    },
    {
      "text": "Brannen, J. 1993. Research Notes: The Effects of Research on Participants: Findings from a Study of Mothers and Employment. The Sociological Review. 41, 2 (May 1993), 328--346. https://doi.org/10.1111/j.1467--954X.1993.tb00068.x.",
      "doi": ""
    },
    {
      "text": "Brinkmann, S. and Kvale, S. 2005. Confronting the Ethics of Qualitative Research. Journal of Constructivist Psychology. 18, 2 (Mar. 2005), 157--181. https://doi.org/10.1080/10720530590914789.",
      "doi": ""
    },
    {
      "text": "Brodsky, A.E. 2008. Researcher as Instrument. The SAGE Encyclopedia of Qualitative Research Methods. L. Given, ed. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Clarkson, P. 1994. The Nature and Range of Psychotherapy. The Handbook of Psychotherapy. P. Clarkson and M. Pokorny, eds. Routledge.",
      "doi": ""
    },
    {
      "text": "Cotterill, P. 1992. Interviewing women. Women's Studies International Forum. 15, 5--6 (Sep. 1992), 593-- 606. https://doi.org/10.1016/0277--5395(92)90061-Y.",
      "doi": ""
    },
    {
      "text": "Davis, H. and Waycott, J. 2015. Ethical Encounters: HCI Research in Sensitive and Complex Settings. Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (New York, NY, USA, 2015), 667--669.",
      "doi": "10.1145/2838739.2838834"
    },
    {
      "text": "Devine, F. and Heath, S. 1999. Sociological research methods in context. Macmillan.",
      "doi": ""
    },
    {
      "text": "Dosono, B., Rashidi, Y., Akter, T., Semaan, B. and Kapadia, A. 2017. Challenges in Transitioning from Civil to Military Culture: Hyper-Selective Disclosure through ICTs. Proceedings of the ACM on HumanComputer Interaction. 1, CSCW (Dec. 2017), 1--23. https://doi.org/10.1145/3134676.",
      "doi": ""
    },
    {
      "text": "Duckworth, M.P. and Follette, V.M. eds. 2012. Retraumatization: assessment, treatment, and prevention. Routledge, Taylor & Francis Group.",
      "doi": ""
    },
    {
      "text": "Duncombe, J. and Jessop, J. 2002. 'Doing rapport' and the ethics of 'faking friendship.' Ethics in qualitative research. M. Mauthner, J. Birch, and T. Miller, eds. Sage. 107--122.",
      "doi": ""
    },
    {
      "text": "Fiesler, C., Morrison, S. and Bruckman, A.S. 2016. An Archive of Their Own: A Case Study of Feminist HCI and Values in Design. (2016), 2574--2585.",
      "doi": ""
    },
    {
      "text": "Finch, J. 1993. It's great to have someone to talk to: ethics and politics of interviewing women. Social research: philosophy, politics and practice. M. Hammersley, ed. Sage Publications. 166--180.",
      "doi": ""
    },
    {
      "text": "Frank, J.D. and Frank, J.B. 1991. Persuasion and Healing: A Comparative Study of Psychotherapy. Johns Hopkins University Press.",
      "doi": ""
    },
    {
      "text": "Frauenberger, C., Rauhala, M. and Fitzpatrick, G. 2017. In-Action Ethics. Interacting with Computers. 29, 2 (Mar. 2017), 220--236. https://doi.org/10.1093/iwc/iww024.",
      "doi": ""
    },
    {
      "text": "Gabe, J. and Williams, P. 1986. Is space bad for your health? The relationship between crowding in the home and emotional distress in women. Sociology of Health & Illness. 8, 4 (1986), 351--371. https://doi.org/10.1111/1467--9566.ep11340458.",
      "doi": ""
    },
    {
      "text": "Gelo, O.C.G., Pritz, A. and Rieken, B. 2014. Psychotherapy Research: Foundations, Process, and Outcome. Springer.",
      "doi": ""
    },
    {
      "text": "Grohol, J.M. 2018. When You Disclose Too Much in Therapy}. Psych Central. Retrieved on 1/7/2020 from http://psychcentral.com/blog/when-you-disclose-toomuch-in-therapy/",
      "doi": ""
    },
    {
      "text": "Hall, L.A. and Farel, A.M. 1988. Maternal Stresses and Depressive Symptoms: Correlates of Behavior Problems in Young Children. Nursing Research. 37, 3 (Jun. 1988), 156--161.",
      "doi": ""
    },
    {
      "text": "Hallam, R.S. 2015. The therapy relationship a special kind of friendship. Karnac Books Ltd.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction. 18, 3 (Jul. 2011), 1--20. https://doi.org/10.1145/1993060.1993065.",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Holland, J. 2007. Emotions and Research. International Journal of Social Research Methodology. 10, 3 (Jul. 2007), 195--209. https://doi.org/10.1080/13645570701541894.",
      "doi": ""
    },
    {
      "text": "Klein, M.H., Kolden, G.G., Michels, J.L. and Chisholm-Stockard, S. 2002. Congruence. Psychotherapy Relationships That Work: Therapist Contributions and Responsiveness to Patients. John C. Norcross, ed. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Kvale, S. 2007. Doing Interviews. SAGE Publications, Ltd.",
      "doi": ""
    },
    {
      "text": "Kvale, S. 1996. Interviews: an introduction to qualitative research interviewing. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Lambert, M.J. and Barley, Dean E 2002. Research Summary on the Therapeutic Relationship and Psychotherapy Outcome. Psychotherapy Relationships That Work: Therapist Contributions and Responsiveness to Patients. J.C. Norcross, ed. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Lazarus, R.S. 1991. Psychological Stress in the Workplace - ProQuest. Journal of Social Behavior and Personality. 6, 7 (Jan. 1991).",
      "doi": ""
    },
    {
      "text": "Lee, R.M. and Renzetti, C.M. 1990. The Problems of Researching Sensitive Topics. The American Behavioral Scientist. 33, 5 (May 1990), 507--637.",
      "doi": ""
    },
    {
      "text": "Lim, C., Berry, A.B.L., Hirsch, T., Hartzler, A.L., Wagner, E.H., Ludman, E. and Ralston, J.D. 2016. \"It just seems outside my health\": How Patients with Chronic Conditions Perceive Communication Boundaries with Providers. (2016), 1172--1184.",
      "doi": ""
    },
    {
      "text": "Lim, C.Y., Berry, A.B.L., Hartzler, A.L., Hirsch, T., Carrell, D.S., Bermet, Z.A. and Ralston, J.D. 2019. Facilitating Self-reflection about Values and Self-care Among Individuals with Chronic Conditions. (2019), 1--12.",
      "doi": ""
    },
    {
      "text": "McLeod, J. 1997. Narrative and psychotherapy. SAGE.",
      "doi": ""
    },
    {
      "text": "Miller, T. and Bell, L. 2013. Consenting to what? Issues of access, gate keeping and \"informed\" consent.",
      "doi": ""
    },
    {
      "text": "Miller, W. and Rollnick, S. 2012. Motivational Interviewing. Guilford.",
      "doi": ""
    },
    {
      "text": "Miller, W.R., Moyers, T.B., Ernst, D. and Amrhein, P. 2008. Manual for the Motivational Interviewing Skill Code (MISC), Version 2.1. University of New Mexico Center on Alcoholism, Substance Use, and Addictions.",
      "doi": ""
    },
    {
      "text": "Moncur, W. 2013. The emotional wellbeing of researchers: considerations for practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (Paris, France, 2013), 1883.",
      "doi": "10.1145/2470654.2466248"
    },
    {
      "text": "Morrissey, K., McCarthy, J. and Pantidi, N. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (Denver, Colorado, USA, 2017), 1326--1338.",
      "doi": ""
    },
    {
      "text": "Munteanu, C., Molyneaux, H., Moncur, W., Romero, M., O'Donnell, S. and Vines, J. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (New York, NY, USA, 2015), 105--114.",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Munteanu, C., Molyneaux, H. and O'Donnell, S. 2014. Fieldwork with vulnerable populations. Interactions. (Jan. 2014).",
      "doi": ""
    },
    {
      "text": "Norcross, J.C. 2002. Empirically Supported Therapy Relationships. Psychotherapy Relationships That Work: Therapist Contributions and Responsiveness to Patients. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Oakley, A. 1981. Interviewing women: A contradiction in terms. Doing feminist research. H. Roberts, ed. Routledge. 30--61.",
      "doi": ""
    },
    {
      "text": "Parry, G.D., Crawford, M.J. and Duggan, C. 2016. Iatrogenic harm from psychological therapies -- time to move on. British Journal of Psychiatry. 208, 3 (Mar. 2016), 210--212. https://doi.org/10.1192/bjp.bp.115.163618.",
      "doi": ""
    },
    {
      "text": "Portigal, S. 2013. Interviewing users: how to uncover compelling insights. Rosenfeld Media.",
      "doi": ""
    },
    {
      "text": "Reeves, E. 2015. A Synthesis of the Literature on Trauma-Informed Care. Issues in Mental Health Nursing. 36, 9 (Sep. 2015), 698--709. https://doi.org/10.3109/01612840.2015.1025319.",
      "doi": ""
    },
    {
      "text": "Rogers, C.R. 1995. A way of being. Houghton Mifflin Co.",
      "doi": ""
    },
    {
      "text": "Rogers, C.R. 1957. The Necessary and Sufficient Conditions of Therapeutic Personality Change. The Journal of Consulting Psychology. 21, (1957), 95--103.",
      "doi": ""
    },
    {
      "text": "Rogers, C.R. and Farson, R.E. Active Listening. Industrial Relations Center of the University of Chicago.",
      "doi": ""
    },
    {
      "text": "Semaan, B.C., Britton, L.M. and Dosono, B. 2016. Transition Resilience with ICTs: \"Identity Awareness\" in Veteran Re-Integration. (2016), 2882--2894.",
      "doi": ""
    },
    {
      "text": "Shamai, M. 2003. Therapeutic Effects of Qualitative Research: Reconstructing the Experience of Treatment as a By-Product of Qualitative Evaluation. Social Service Review. 77, 3 (2003), 455--467. https://doi.org/10.1086/375789.",
      "doi": ""
    },
    {
      "text": "Sin, C.H. 2005. Seeking Informed Consent: Reflections on Research Practice. Sociology. 39, 2 (Apr. 2005), 277--294. https://doi.org/10.1177/0038038505050539.",
      "doi": ""
    },
    {
      "text": "Substance Abuse and Mental Health Services Administration 2014. SAMHSA's Concept of Trauma and Guidance for a Trauma-Informed Approach. Technical Report #HHS Publication No. (SMA) 144884. Substance Abuse and Mental Health Services Administration.",
      "doi": ""
    },
    {
      "text": "Sundararajan, L. 1995. Echoes after Carl Rogers: \"Reflective listening\" revisited. The Humanistic Psychologist. 23, 2 (1995), 259--271. https://doi.org/10.1080/08873267.1995.9986828.",
      "doi": ""
    },
    {
      "text": "Toombs, A., Gross, S., Bardzell, S. and Bardzell, J. 2017. From Empathy to Care: A Feminist Care Ethics Perspective on Long-Term Researcher--Participant Relations. Interacting with Computers. 29, 1 (Jan. 2017), 45--57. https://doi.org/10.1093/iwc/iww010.",
      "doi": ""
    },
    {
      "text": "Torrey, E.F. 1972. What Western psychotherapists can learn from witchdoctors. American Journal of Orthopsychiatry. 42, 1 (Jan. 1972), 69--76. https://doi.org/10.1111/j.1939-0025.1972.tb02472.x.",
      "doi": ""
    },
    {
      "text": "Wampold, B.E. 2007. Psychotherapy: The humanistic (and effective) treatment. American Psychologist. 62, 8 (2007), 857--873. https://doi.org/10.1037/0003066X.62.8.857.",
      "doi": ""
    },
    {
      "text": "Watson, J.C. 2007. Reassessing Rogers' necessary and sufficient conditions of change. Psychotherapy: Theory, Research, Practice, Training. 44, 3 (2007), 268--273. https://doi.org/10.1037/0033--3204.44.3.268.",
      "doi": ""
    },
    {
      "text": "Waycott, J., Munteanu, C., Davis, H., Thieme, A., Moncur, W., McNaney, R., Vines, J. and Branham, S. 2016. Ethical Encounters in Human-Computer Interaction. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (New York, NY, USA, 2016), 3387--3394.",
      "doi": "10.1145/2851581.2856498"
    },
    {
      "text": "Wilkinson-Lee, A.M., Zhang, Q., Nuno, V.L. and Wilhelm, M.S. 2011. Adolescent Emotional Distress: The Role of Family Obligations and School Connectedness. Journal of Youth and Adolescence. 40, 2 (Feb. 2011), 221--230. https://doi.org/10.1007/s10964-009--9494--9.",
      "doi": ""
    },
    {
      "text": "Woelfer, J. and Hendry, D. 2012. Homeless young people on social network sites. (2012), 2825.",
      "doi": ""
    },
    {
      "text": "Woelfer, J. and Hendry, D. Homeless Young People on Social Network Sites: Uses, Concerns, and Human Capabilities (unpublished).",
      "doi": ""
    },
    {
      "text": "Wolters, M.K., Mkulo, Z. and Boynton, P.M. 2017. The Emotional Work of Doing eHealth Research. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems CHI EA '17 (Denver, Colorado, USA, 2017), 816--826.",
      "doi": ""
    },
    {
      "text": "Yoo, D., Kantengwa, O., Logler, N., Interayamahanga, R., Nkurunziza, J. and Friedman, B. 2018. Collaborative Reflection: A Practice for Enriching Research Partnerships Spanning Culture, Discipline, and Time. (2018), 1--11.",
      "doi": "10.1145/3173574.3173853"
    },
    {
      "text": "Yoo, D., Utter, R.F., Friedman, B., Lake, M., Nilsen, T., Utter, M.E., Alsdorf, R., Bizimana, T., Nathan, L.P., Ring, M. and Utter, E.J. 2013. Envisioning across generations: a multi-lifespan information system for international justice in rwanda. (2013), 2527.",
      "doi": ""
    },
    {
      "text": "Young, J. and Beck, A.T. 1980. Cognitive Therapy Scale Rating Manual. Beck Institute for Cognitive Behavioral Therapy.",
      "doi": ""
    }
  ]
}