{
  "doi": "10.1145/3313831.3376181",
  "title": "Addressing Cognitive and Emotional Barriers in Parent-Clinician Communication through Behavioral Visualization Webtools",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Effective communication between clinicians and parents of young children with developmental delays can decrease parents' anxiety, help them handle bad news, and improve their adherence to proposed interventions. However, parents have reported dissatisfaction regarding their current communication with clinicians, and they face cognitive and emotional challenges when discussing their child's developmental delays. In this paper, we present visualization as a facilitator of parent-clinician communication and how it could address existing communication challenges. Parents and clinicians anticipated visualization webtools would aid their communication by helping parents gain a better understanding of their child, acting as objective evidence, and highlighting the strength of the child as well as important medical concepts. In addition, visualization can act as a longitudinal record, helping parents track, explore, and share their child's developmental progress. Finally, we propose visualization as a tool to guide parents in their transition from feeling emotional and disempowered to advocating with confidence.",
  "tags": [
    "developmental delays",
    "clinical communication",
    "visualization"
  ],
  "authors": [
    {
      "name": "Ha-Kyung Kong",
      "institution": "Seattle University & University of Illinois at Urbana Champaign, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020996",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    }
  ],
  "references": [
    {
      "text": "Samar Al-Hajj. 2014. Collaborative Visual Analytics for public health: facilitating problem solving and supporting decision-making. Ph.D. Dissertation. Communication, Art & Technology: School of Interactive Arts and Technology.",
      "doi": ""
    },
    {
      "text": "Adriana Arcia, Niurka Suero-Tejeda, Michael E Bales, Jacqueline A Merrill, Sunmoo Yoon, Janet Woollen, and Suzanne Bakken. 2015. Sometimes more is more: iterative participatory design of infographics for engagement of community members with varying levels of health literacy. Journal of the American Medical Informatics Association 23, 1 (2015), 174--183.",
      "doi": ""
    },
    {
      "text": "Lauren Brookman-Frazee and RL Koegel. 2004. Using parent/clinician partnerships in parent education programs for children with autism. Journal of positive behavior interventions 6, 4 (2004), 195--213.",
      "doi": ""
    },
    {
      "text": "Christie Cabral, Jeremy Horwood, Alastair D Hay, and Patricia J LUniversity of Chinese Academy of Sciences. 2014a. How communication affects prescription decisions in consultations for acute illness in children: a systematic review and meta-ethnography. BMC family practice 15, 1 (2014), 63.",
      "doi": ""
    },
    {
      "text": "Christie Cabral, Jenny Ingram, Alastair D Hay, and Jeremy Horwood. 2014b. \"They just say everything's a virus\"-Parent's judgment of the credibility of clinician communication in primary care consultations for respiratory tract infections in children: A qualitative study. Patient education and counseling 95, 2 (2014), 248--253.",
      "doi": ""
    },
    {
      "text": "Eunji Chong, Katha Chanda, Zhefan Ye, Audrey Southerland, Nataniel Ruiz, Rebecca M Jones, Agata Rozga, and James M Rehg. 2017. Detecting gaze towards eyes in natural social interactions and its use in child assessment. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 43.",
      "doi": "10.1145/3131902"
    },
    {
      "text": "Anthony Faiola, Preethi Srinivas, and Simon Hillier. 2015. Improving patient safety: Integrating data visualization and communication into ICU workflow to reduce cognitive load. In Proceedings of the International Symposium on Human Factors and Ergonomics in Health Care, Vol. 4. SAGE Publications Sage India: New Delhi, India, 55--61.",
      "doi": ""
    },
    {
      "text": "Yi Han, Agata Rozga, Nevena Dimitrova, Gregory D Abowd, and John Stasko. 2015. Visual analysis of proximal temporal relationships of social and communicative behaviors. In Computer Graphics Forum, Vol. 34. Wiley Online Library, 51--60. DOI: http://dx.doi.org/10.1111/cgf.12617",
      "doi": ""
    },
    {
      "text": "Kimberly M Ho and Margaret K Keiley. 2003. Dealing with denial: A systems approach for family professionals working with parents of individuals with multiple disabilities. The Family Journal 11, 3 (2003), 239--247.",
      "doi": ""
    },
    {
      "text": "Alda Hummelinck and Kristian Pollock. 2006. Parents' information needs about the treatment of their chronically ill child: a qualitative study. Patient education and counseling 62, 2 (2006), 228--234.",
      "doi": ""
    },
    {
      "text": "Joe Kai. 1996. Parents' difficulties and information needs in coping with acute illness in preschool children: a qualitative study. Bmj 313, 7063 (1996), 987--990.",
      "doi": ""
    },
    {
      "text": "Julie A Kientz, Sebastian Boring, Gregory D Abowd, and Gillian R Hayes. 2005. Abaris: Evaluating automated capture applied to structured autism interventions. In International Conference on Ubiquitous Computing. Springer, 323--339. DOI: http://dx.doi.org/10.1007/11551201_19",
      "doi": "10.1007/11551201_19"
    },
    {
      "text": "Jennifer Kim, Melinda Snodgrass, Mary Pietrowicz, Karrie Karahalios, and Jim Halle. 2013. BEDA: Visual analytics for behavioral and physiological data. In Workshop on Visual Analytics in Healthcare. Washington DC. 23--27.",
      "doi": ""
    },
    {
      "text": "Paul Kinnersley, Nigel Stott, Tim J Peters, and Ian Harvey. 1999. The patient-centredness of consultations and outcome in primary care. Br J Gen Pract 49, 446 (1999), 711--716.",
      "doi": ""
    },
    {
      "text": "Ha Kyung Kong, John Lee, Jie Ding, and Karrie Karahalios. 2016. EnGaze: Designing Behavior Visualizations with and for Behavioral Scientists. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 1185--1196.",
      "doi": "10.1145/2901790.2901870"
    },
    {
      "text": "Ha Kyung Kong, John Lee, and Karrie Karahalios. 2017. A Comparative Study of Visualizations with Different Granularities of Behavior for Communicating about Autism. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 59.",
      "doi": "10.1145/3134694"
    },
    {
      "text": "Ha Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and slants in titles of visualizations on controversial topics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 438.",
      "doi": "10.1145/3173574.3174012"
    },
    {
      "text": "Ha Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2019. Trust and Recall of Information across Varying Degrees of Title-Visualization Misalignment. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 346.",
      "doi": "10.1145/3290605.3300576"
    },
    {
      "text": "Robert Kosara and Jock Mackinlay. 2013. Storytelling: The Next Step for Visualization. Computer (2013), 44--50. http://kosara.net/papers/2013/Kosara",
      "doi": ""
    },
    {
      "text": "John Lee, Ha-Kyung Kong, Sanny Lin, and Karrie Karahalios. 2016. Plexlines: Tracking Socio-communicative Behaviors Using Timeline Visualizations. In AMIA Annual Symposium Proceedings, Vol. 2016. American Medical Informatics Association, 1890.",
      "doi": ""
    },
    {
      "text": "Wendy Levinson. 1994. Physician-patient communication: a key to malpractice prevention. Jama 272, 20 (1994), 1619--1620.",
      "doi": ""
    },
    {
      "text": "Katherine A Loveland and Susan H Landry. 1986. Joint attention and language in autism and developmental language delay. Journal of autism and developmental disorders 16, 3 (1986), 335--349.",
      "doi": ""
    },
    {
      "text": "Rita Mangione-Smith, Elizabeth A McGlynn, Marc N Elliott, Laurie McDonald, Carol E Franz, and Richard L Kravitz. 2001. Parent expectations for antibiotics, physician-parent communication, and satisfaction. Archives of pediatrics & adolescent medicine 155, 7 (2001), 800--806.",
      "doi": ""
    },
    {
      "text": "Jennifer B Mathys. 2013. Beyond Parental Report: Findings from the Rapid-ABC, A New 4-Minute Interactive Autism. (2013).",
      "doi": ""
    },
    {
      "text": "Siegfried Meryn. 1998. Improving doctor-patient communication: not an option, but a necessity. BMJ: British Medical Journal 316, 7149 (1998), 1922.",
      "doi": ""
    },
    {
      "text": "Megan Monroe, Rongjian Lan, Hanseung Lee, Catherine Plaisant, and Ben Shneiderman. 2013. Temporal event sequence simplification. Visualization and Computer Graphics, IEEE Transactions on 19, 12 (2013), 2227--2236.",
      "doi": "10.1109/TVCG.2013.200"
    },
    {
      "text": "Catherine S Nelson, Susan M Higman, Calvin Sia, Elizabeth McFarlane, Loretta Fuddy, and Anne K Duggan. 2005. Medical homes for at-risk children: parental reports of clinician-parent relationships, anticipatory guidance, and behavior changes. Pediatrics 115, 1 (2005), 48--56.",
      "doi": ""
    },
    {
      "text": "Tao Ni, Amy K Karlson, and Daniel Wigdor. 2011. AnatOnMe: facilitating doctor-patient communication using a projection-based handheld device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3333--3342.",
      "doi": "10.1145/1978942.1979437"
    },
    {
      "text": "Lisa A Osborne and Phil Reed. 2008. Parents' perceptions of communication with professionals during the diagnosis of autism. Autism 12, 3 (2008), 309--324. DOI:http://dx.doi.org/10.1177/1362361307089517",
      "doi": ""
    },
    {
      "text": "Rachel L Panton, Robert Downie, Tran Truong, Leslie MacKeen, Stefane Kabene, Qi-Long Yi, Helen SL Chan, and Brenda L Gallie. 2009. A visual approach to providing prognostic information to parents of children with retinoblastoma. Psycho-Oncology: Journal of the Psychological, Social and Behavioral Dimensions of Cancer 18, 3 (2009), 300--304.",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is Personal: Attitudes and Perceptions of Data Visualization in Rural Pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 244.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Adam Perer and David Gotz. 2013. Visualizations to support patient-clinician communication of care. (2013).",
      "doi": ""
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. 1996. LifeLines: visualizing personal histories. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 221--227.",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Fateme Rajabiyazdi, Charles Perin, Jo Vermeulen, Haley MacLeod, Diane Gromala, and Sheelagh Carpendale. 2017. Differences That Matter: In-Clinic Communication Challenges. In Proceedings of the International Conference on Pervasive Computing Technologies for Healthcare.",
      "doi": "10.1145/3154862.3154885"
    },
    {
      "text": "John S Rolland. 1994. Families, illness, and disability: An integrative treatment model. Basic Books.",
      "doi": ""
    },
    {
      "text": "Beatrice Schaad, Celine Bourquin, Floriane Bornet, Thierry Currat, Michael Saraga, Francesco Panese, and Friedrich Stiefel. 2015. Dissatisfaction of hospital patients, their relatives, and friends: Analysis of accounts collected in a complaints center. Patient education and counseling 98, 6 (2015), 771--776.",
      "doi": ""
    },
    {
      "text": "Siobhan Sharkey, Claire Lloyd, Richard Tomlinson, Eleanor Thomas, Alice Martin, Stuart Logan, and Christopher Morris. 2016. Communicating with disabled children when inpatients: barriers and facilitators identified by parents and professionals in a qualitative study. Health Expectations 19, 3 (2016), 738--750.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman, Catherine Plaisant, and Bradford W Hesse. 2013. Improving healthcare with interactive visualization. Computer 46, 5 (2013), 58--66. DOI: http://dx.doi.org/10.1109/MC.2013.38",
      "doi": "10.1109/MC.2013.38"
    },
    {
      "text": "Linda Tetzlaff. 1997. Consumer informatics in chronic illness. Journal of the American Medical Informatics Association 4, 4 (1997), 285--300.",
      "doi": ""
    },
    {
      "text": "RC Wasserman, TS Inui, RD Barriatua, WB Carter, and P Lippincott. 1984. Pediatric clinicians' support for parents makes a difference: an outcome-based analysis of clinician-parent interaction. Pediatrics 74, 6 (1984), 1047--1053.",
      "doi": ""
    },
    {
      "text": "Krist Wongsuphasawat, John Alexis Guerra Gomez, Catherine Plaisant, Taowei David Wang, Meirav Taieb-Maimon, and Ben Shneiderman. 2011. LifeFlow: visualizing an overview of event sequences. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1747--1756.",
      "doi": "10.1145/1978942.1979196"
    },
    {
      "text": "Peter WD Wright and Pamela Darr Wright. 2002. Wrightslaw: From Emotions to Advocacy--The Special Education Survival Guide. ERIC.",
      "doi": ""
    },
    {
      "text": "Robert Zachariae, Christina G Pedersen, Anders B Jensen, Eva Ehrnrooth, Philip B Rossen, and Hans von der Maase. 2003. Association of perceived physician communication style with patient satisfaction, distress, cancer-related self-efficacy, and perceived control over the disease. British journal of cancer 88, 5 (2003), 658.",
      "doi": ""
    },
    {
      "text": "Kelly B Haskard Zolnierek and M Robin DiMatteo. 2009. Physician communication and patient adherence to treatment: a meta-analysis. Medical care 47, 8 (2009), 826.",
      "doi": ""
    }
  ]
}