{
  "doi": "10.1145/3313831.3376645",
  "title": "Fragile Masculinity: Men, Gender, and Online Harassment",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Harassment is a persistent problem in contemporary online environments, with women disproportionately experiencing its most severe forms. While critical scholars posit that online gender harassment may be linked to men's anxieties about fulfilling normative masculine gender roles, this relationship has not been examined by empirical research. We survey 264 young men between the ages of 18-24 about their masculinity anxieties and their perceptions of harassment directed at a woman on Twitter. We find that men who perceive themselves as less masculine than average men report higher endorsement of harassment. Further, we find that the relationship between masculinity anxieties and harassment endorsement is mediated by men's adherence to masculine norms and toxic disinhibition. We interpret these results through the lens of social media's specific affordances, and we discuss their implications for technology designers and other practitioners who wish to better detect, prevent, and remediate online harassment by accounting for the role of gender.",
  "tags": [
    "masculinity",
    "gender",
    "women",
    "online harassment",
    "misogyny",
    "social media"
  ],
  "authors": [
    {
      "name": "Jennifer D. Rubin",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526981",
      "orcid": "missing"
    },
    {
      "name": "Lindsay Blackwell",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658986987",
      "orcid": "missing"
    },
    {
      "name": "Terri D. Conley",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528342",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amnesty International. 2018. Toxic Twitter - Triggers of Violence and Abuse Against Women on Twitter. Retrieved September 16, 2019 from https://www.amnesty.org/en/latest/research/2018/03/onlineviolence-against-women-chapter-2/",
      "doi": ""
    },
    {
      "text": "Jeffrey Jensen Arnett. 2000. Emerging adulthood: A theory of development from the late teens through the twenties. American Psychologist 55, 5: 469--480. https://doi.org/10.1037/0003-066X.55.5.469",
      "doi": ""
    },
    {
      "text": "Sarah Banet-Weiser and Kate M. Miltner. 2016. #MasculinitySoFragile: culture, structure, and networked misogyny. Feminist Media Studies 16, 1: 171--174. https://doi.org/10.1080/14680777.2016.1120490",
      "doi": ""
    },
    {
      "text": "Jamie Barlett, Richard Norrie, Norrie Patel, Rebekka Rumpel, and Wibberley. 2014. Misogyny on Twitter. Demos. Retrieved December 15, 2017 from https://www.demos.co.uk/project/misogyny-on-twitter/",
      "doi": ""
    },
    {
      "text": "Danielle S. Berke, Dennis E. Reidy, Joshua D. Miller, and Amos Zeichner. 2017. Take it like a man: Gender-threatened men's experience of gender role discrepancy, emotion activation, and pain tolerance. Psychology of Men & Masculinity 18, 1: 62--69. https://doi.org/10.1037/men0000036",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Tianying Chen, Sarita Schoenebeck, and Cliff Lampe. 2018. When Online Harassment is Perceived as Justified. In Twelfth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. Proceedings of the ACM on Human-Computer Interaction 1, CSCW: 1--19. https://doi.org/10.1145/3134659",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Andrea Braithwaite. 2016. It's About Ethics in Games Journalism? Gamergaters and Geek Masculinity. Social Media + Society 2, 4: 2056305116672484. https://doi.org/10.1177/2056305116672484",
      "doi": ""
    },
    {
      "text": "Amy Bruckman, Catalina Danis, Cliff Lampe, Janet Sternberg, and Chris Waldron. 2006. Managing deviant behavior in online communities. In CHI'06 extended abstracts on Human factors in computing systems, 21--24. Retrieved June 24, 2015 from http://dl.acm.org/citation.cfm?id=1125458",
      "doi": "10.1145/1125451.1125458"
    },
    {
      "text": "Shawn Meghan Burn and A. Zachary Ward. 2005. Men's Conformity to Traditional Masculinity and Relationship Satisfaction. Psychology of Men & Masculinity 6, 4: 254--263. https://doi.org/10.1037/1524--9220.6.4.254",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The Bag of Communities: Identifying Abusive Behavior Online with Preexisting Internet Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Shira Chess and Adrienne Shaw. 2015. A Conspiracy of Fishes, or, How We Learned to Stop Worrying About #GamerGate and Embrace Hegemonic Masculinity. Journal of Broadcasting & Electronic Media 59, 1: 208--220. https://doi.org/10.1080/08838151.2014.999917",
      "doi": ""
    },
    {
      "text": "Danielle Keats Citron. 2014. Addressing Cyber Harassment: An Overview of Hate Crimes in Cyberspace. Case Western Reserve Journal of Law, Technology and the Internet 6: 1.",
      "doi": ""
    },
    {
      "text": "Danielle Keats Citron. 2014. Hate Crimes in Cyberspace. Harvard University Press, Cambridge, Massachusettes.",
      "doi": "10.5555/3051927"
    },
    {
      "text": "Elizabeth R. Cole. 2009. Intersectionality and research in psychology. American Psychologist 64, 3: 170--180. https://doi.org/10.1037/a0014564",
      "doi": ""
    },
    {
      "text": "Bethany M. Coston and Michael Kimmel. 2012. Seeing Privilege Where It Isn't: Marginalized Masculinities and the Intersectionality of Privilege. Journal of Social Issues 68, 1: 97-- 111. https://doi.org/10.1111/j.1540--4560.2011.01738.x",
      "doi": ""
    },
    {
      "text": "Julia Dahl, Theresa Vescio, and Kevin Weaver. 2015. How Threats to Masculinity Sequentially Cause Public Discomfort, Anger, and Ideological Dominance Over Women. Social Psychology 46, 4: 242--254. https://doi.org/10.1027/18649335/a000248",
      "doi": ""
    },
    {
      "text": "Elena Dall'Ara and Anne Maass. 1999. Studying Sexual Harassment in the Laboratory: Are Egalitarian Women at Higher Risk? Sex Roles 41, 9: 681--704. https://doi.org/10.1023/A:1018816025988",
      "doi": ""
    },
    {
      "text": "Julian Dibbell. 1993. A Rape in Cyberspace | Village Voice. Retrieved June 26, 2015 from http://www.villagevoice.com/news/a-rape-in-cyberspace-6401665",
      "doi": ""
    },
    {
      "text": "Kelly P. Dillon and Brad J. Bushman. 2015. Unresponsive or un-noticed?: Cyberbystander intervention in an experimental cyberbullying context. Computers in Human Behavior 45: 144--150. https://doi.org/10.1016/j.chb.2014.12.009",
      "doi": "10.1016/j.chb.2014.12.009"
    },
    {
      "text": "Kelly P. Dillon and Brad J. Bushman. 2015. Unresponsive or un-noticed?: Cyberbystander intervention in an experimental cyberbullying context. Computers in Human Behavior 45, Supplement C: 144--150. https://doi.org/10.1016/j.chb.2014.12.009",
      "doi": "10.1016/j.chb.2014.12.009"
    },
    {
      "text": "Kitsy Dixon. 2014. Feminist Online Identity: Analyzing the Presence of Hashtag Feminism. Journal of Arts and Humanities 3, 7: 34--40. https://doi.org/10.18533/journal.v3i7.509",
      "doi": ""
    },
    {
      "text": "Judith Donath. 1999. Communities in Cyberspace. In Identity and Deception in the Virtual Community. Retrieved June 24, 2015 from http://smg.media.mit.edu/people/Judith/Identity/IdentityDeception .html",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2014. Online harassment. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017. Online Harassment 2017. Pew Research Center: Internet, Science & Tech. Retrieved September 19, 2017 from http://www.pewinternet.org/2017/07/11/onlineharassment-2017/",
      "doi": ""
    },
    {
      "text": "Alice H. Eagly and Mary E. Kite. 1987. Are stereotypes of nationalities applied to both women and men? Journal of Personality and Social Psychology 53, 3: 451--462. https://doi.org/10.1037/0022--3514.53.3.451",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4: 1143--1168. https://doi.org/10.1111/j.1083--6101.2007.00367.x",
      "doi": ""
    },
    {
      "text": "Breanne Fahs and Michelle Gohr. 2012. Superpatriarchy Meets Cyberfeminism: Facebook, Online Gaming, and the New Social Genocide. MP: An Online Feminist Journal 3, 6: 1--40.",
      "doi": ""
    },
    {
      "text": "Susan Faludi. 2009. Backlash: The Undeclared War Against American Women. Crown/Archetype, New York, New York.",
      "doi": ""
    },
    {
      "text": "Jill Filipovic. 2007. Blogging While Female: How Internet Misogyny Parallels Real-World Harassment Responding to Internet Harassment. Yale Journal of Law and Feminism 19: 295-- 304.",
      "doi": ""
    },
    {
      "text": "Thomas E. Ford. 2000. Effects of Sexist Humor on Tolerance of Sexist Events. Personality and Social Psychology Bulletin 26, 9: 1094--1107. https://doi.org/10.1177/01461672002611006",
      "doi": ""
    },
    {
      "text": "Jesse Fox, Carlos Cruz, and Ji Young Lee. 2015. Perpetuating online sexism offline: Anonymity, interactivity, and the effects of sexist hashtags on social media. Computers in Human Behavior 52, Supplement C: 436--442. https://doi.org/10.1016/j.chb.2015.06.024",
      "doi": "10.1016/j.chb.2015.06.024"
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2014. Sexism in online video games: The role of conformity to masculine norms and social dominance orientation. Computers in Human Behavior 33, Supplement C: 314--320. https://doi.org/10.1016/j.chb.2013.07.014",
      "doi": "10.1016/j.chb.2013.07.014"
    },
    {
      "text": "Mary Anne Franks. 2012. Sexual Harassment 2.0 Special Feature: Cyberlaw. Maryland Law Review 71: 655--704.",
      "doi": ""
    },
    {
      "text": "Michelle E. Funk and Calvin R. Coker. 2016. She's Hot, for a Politician: The Impact of Objectifying Commentary on Perceived Credibility of Female Candidates. Communication Studies 67, 4: 455--473. https://doi.org/10.1080/10510974.2016.1196380",
      "doi": ""
    },
    {
      "text": "Becky Gardiner. 2018. \"It's a terrible way to go to work:\" what 70 million readers' comments on the Guardian revealed about hostility to women and minorities online. Feminist Media Studies 18, 4: 592--608. https://doi.org/10.1080/14680777.2018.1447334",
      "doi": ""
    },
    {
      "text": "Rosalind Gill. 2016. Post-postfeminism?: new feminist visibilities in postfeminist times. Feminist Media Studies 16, 4: 610--630. https://doi.org/10.1080/14680777.2016.1193293",
      "doi": ""
    },
    {
      "text": "Ervin Goffman. 1963. Stigma: notes on the management of spoiled identity. Prentice-Hall, Englewood Cliffs, New Jersey.",
      "doi": ""
    },
    {
      "text": "KISHONNA L. Gray. 2016. Solidarity is for white women in gaming. Diversifying Barbie and Mortal Kombat: Intersectional perspectives and inclusive designs in gaming: 59--70.",
      "doi": ""
    },
    {
      "text": "Mark Griffiths. 2002. Occupational health issues concerning Internet use in the workplace. Work & Stress 16, 4: 283-- 286. https://doi.org/10.1080/0267837031000071438",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes. 2017. Introduction to Mediation, Moderation, and Conditional Process Analysis, Second Edition: A Regression-Based Approach. Guilford Publications.",
      "doi": ""
    },
    {
      "text": "Hunt and Karen Gonsalkorale. 2014. Who Cares What She Thinks, What Does He Say? Links between Masculinity, InGroup Bonding and Gender Harassment. Sex Roles 70, 1--2: 14--27. https://doi.org/10.1007/s11199-013-0324-x",
      "doi": ""
    },
    {
      "text": "Lauren Michele Jackson. 2017. Does Twitter Really Want to Solve Its Harassment Problem? The New Republic. Retrieved December 18, 2017 from https://newrepublic.com/article/145853/twitter-really-want-solveharassment-problem",
      "doi": ""
    },
    {
      "text": "Emma A Jane. 2014. \"Back to the kitchen, cunt': speaking the unspeakable about online misogyny. Continuum 28, 4: 558-- 570. https://doi.org/10.1080/10304312.2014.924479",
      "doi": ""
    },
    {
      "text": "Emma A Jane. 2014. \"Your a Ugly, Whorish, Slut:\" Understanding e-bile. Feminist Media Studies 14, 4: 531--546. https://doi.org/10.1080/14680777.2012.741073",
      "doi": ""
    },
    {
      "text": "Emma A. Jane. 2016. Online misogyny and feminist digilantism. Continuum 30, 3: 284--297. https://doi.org/10.1080/10304312.2016.1166560",
      "doi": ""
    },
    {
      "text": "Euisol Jeong and Jieun Lee. 2018. We take the red pill, we confront the DickTrix: online feminist activism and the augmentation of gendered realities in South Korea. Feminist Media Studies 18, 4: 705--717. https://doi.org/10.1080/14680777.2018.1447354",
      "doi": ""
    },
    {
      "text": "Kimberly Barsamian Kahn, Katherine Spencer, and Jack Glaser. 2013. Online prejudice and discrimination: From dating to hating. The social net: Understanding our online behavior: 201-- 219.",
      "doi": ""
    },
    {
      "text": "Franccesca Kazerooni, Samuel Hardman Taylor, Natalya N. Bazarova, and Janis Whitlock. 2018. Cyberbullying bystander intervention: The number of offenders and retweeting predict likelihood of helping a cyberbullying victim. Journal of ComputerMediated Communication 23, 3: 146--162.",
      "doi": ""
    },
    {
      "text": "Michael Kimmel. 2017. Angry White Men: American Masculinity at the End of an Era. Nation Books, New York.",
      "doi": ""
    },
    {
      "text": "Cliff Lampe and Paul Resnick. 2004. Slash (dot) and burn: distributed moderation in a large online conversation space. In Proceedings of the SIGCHI conference on Human factors in computing systems, 543--550. Retrieved September 19, 2017 from http://dl.acm.org/citation.cfm?id=985761",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Noam Lapidot-Lefler and Azy Barak. 2012. Effects of anonymity, invisibility, and lack of eye-contact on toxic online disinhibition. Computers in Human Behavior 28, 2: 434--443. https://doi.org/10.1016/j.chb.2011.10.014",
      "doi": "10.1016/j.chb.2011.10.014"
    },
    {
      "text": "Bibb Latane and John M. Darley. 1968. Group inhibition of bystander intervention in emergencies. Journal of personality and social psychology 10, 3: 215.",
      "doi": ""
    },
    {
      "text": "Martin Lea and Russell Spears. 1991. Computermediated communication, de-individuation and group decisionmaking. International Journal of Man-Machine Studies 34, 2: 283-- 301. https://doi.org/10.1016/0020--7373(91)90045--9",
      "doi": "10.1016/0020-7373%2891%2990045-9"
    },
    {
      "text": "Amanda Lenhart, Michele Ybarra, Kathryn Zickuhr, and Myeshia Price-Feeney. 2016. Online harassment, digital abuse, and cyberstalking in America. Data and Society Research Institute.",
      "doi": ""
    },
    {
      "text": "Emily A. Leskinen and Lilia M. Cortina. 2014. Dimensions of Disrespect: Mapping and Measuring Gender Harassment in Organizations. Psychology of Women Quarterly 38, 1: 107--123. https://doi.org/10.1177/0361684313496549",
      "doi": ""
    },
    {
      "text": "Karen Lumsden and Heather Morgan. 2017. Media framing of trolling and online abuse: silencing strategies, symbolic violence, and victim blaming. Feminist Media Studies 17, 6: 926-- 940.",
      "doi": ""
    },
    {
      "text": "Anne Maass, Mara Cadinu, Gaia Guarnieri, and Annalisa Grasselli. 2003. Sexual harassment under social identity threat: The computer harassment paradigm. Journal of Personality and Social Psychology 85, 5: 853--870. https://doi.org/10.1037/00223514.85.5.853",
      "doi": ""
    },
    {
      "text": "James R. Mahalik, Benjamin D. Locke, Larry H. Ludlow, Matthew A. Diemer, Ryan P. J. Scott, Michael Gottfried, and Gary Freitas. 2003. Development of the Conformity to Masculine Norms Inventory. Psychology of Men & Masculinity 4, 1: 3--25. https://doi.org/10.1037/1524--9220.4.1.3",
      "doi": ""
    },
    {
      "text": "Karla Mantilla. 2015. Gendertrolling: How Misogyny Went Viral: HowMisogyny Went Viral. ABC-CLIO, Santa Barbara, California.",
      "doi": ""
    },
    {
      "text": "Alice E. Marwick and Robyn Caplan. 2018. Drinking male tears: language, the manosphere, and networked harassment. Feminist Media Studies 18, 4: 543--559. https://doi.org/10.1080/14680777.2018.1450568",
      "doi": ""
    },
    {
      "text": "Adrienne Massanari. 2017. # Gamergate and The Fappening: How Reddit's algorithm, governance, and culture support toxic technocultures. New Media & Society 19, 3: 329--346.",
      "doi": ""
    },
    {
      "text": "Adrienne Massanari. 2017. #Gamergate and The Fappening: How Reddit's algorithm, governance, and culture support toxic technocultures. New Media & Society 19, 3: 329--346. https://doi.org/10.1177/1461444815608807",
      "doi": ""
    },
    {
      "text": "J. Nathan Matias, Amy Johnson, Whitney Erin Boesel, Brian Keegan, Jaclyn Friedman, and Charlie DeTar. 2015. Reporting, Reviewing, and Responding to Harassment on Twitter. arXiv:1505.03359 [cs]. Retrieved January 19, 2016 from http://arxiv.org/abs/1505.03359",
      "doi": ""
    },
    {
      "text": "James C. McCroskey and Jason J. Teven. 1999. Goodwill: A reexamination of the construct and its measurement. Communication Monographs 66, 1: 90--103. https://doi.org/10.1080/03637759909376464",
      "doi": ""
    },
    {
      "text": "Jessica Megarry. 2014. Online incivility or sexual harassment? Conceptualising women's experiences in the digital age. Women's Studies International Forum 47, Part A: 46--55. https://doi.org/10.1016/j.wsif.2014.07.012",
      "doi": ""
    },
    {
      "text": "R. Meyer and M. Cukier. 2006. Assessing the Attack Threat due to IRC Channels. In International Conference on Dependable Systems and Networks (DSN'06), 467--472. https://doi.org/10.1109/DSN.2006.12",
      "doi": "10.1109/DSN.2006.12"
    },
    {
      "text": "Torill Elvira Mortensen. 2018. Anger, Fear, and Games: The Long Event of #GamerGate. Games and Culture 13, 8: 787-- 806. https://doi.org/10.1177/1555412016640408",
      "doi": ""
    },
    {
      "text": "Kevin Munger. 2016. Tweetment Effects on the Tweeted: Experimentally Reducing Racist Harassment. Political Behavior: 1--21. https://doi.org/10.1007/s11109-016--9373--5",
      "doi": ""
    },
    {
      "text": "Mike C. Parent and Bonnie Moradi. 2009. Confirmatory factor analysis of the Conformity to Masculine Norms Inventory and development of the Conformity to Masculine Norms Inventory46. Psychology of Men & Masculinity 10, 3: 175--189. https://doi.org/10.1037/a0015481",
      "doi": ""
    },
    {
      "text": "Dominic J. Parrott and Amos Zeichner. 2003. Effects of hypermasculinity oh physical aggression against women. Psychology of Men & Masculinity 4, 1: 70--78. https://doi.org/10.1037/1524--9220.4.1.70",
      "doi": ""
    },
    {
      "text": "C.J. Pascoe and Tristan Bridges (eds.). 2016. Exploring Masculinities?: Identity, Inequality, Continuity, and Change. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Whitney Phillips. 2015. This Is Why We Can't Have Nice Things: Mapping the Relationship between Online Trolling and Mainstream Culture. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "J. H. Pleck. 1981. The myth of masculinity. MIT Press, Cambridge, Massachusettes.",
      "doi": ""
    },
    {
      "text": "J.H. Pleck. 1995. The gender role strain paradigm: An update. In A new psychology of men, R.H. Levant and W.S. Pollack (eds.). Basic Books, New York, 11--32.",
      "doi": ""
    },
    {
      "text": "Bailey Poland. 2016. Haters: Harassment, Abuse, and Violence Online. University of Nebraska Press, Lincoln, Nebraska.",
      "doi": ""
    },
    {
      "text": "Lee Rainie, Janna, erson, and Jonathan Albright. 2017. The Future of Free Speech, Trolls, Anonymity and Fake News Online. Pew Research Center: Internet, Science & Tech. Retrieved April 27, 2017 from http://www.pewinternet.org/2017/03/29/thefuture-of-free-speech-trolls-anonymity-and-fake-news-online/",
      "doi": ""
    },
    {
      "text": "Dennis E. Reidy, Danielle S. Berke, Brittany Gentile, and Amos Zeichner. 2016. Masculine discrepancy stress, substance use, assault and injury in a survey of US men. Injury Prevention 22, 5: 370--374. https://doi.org/10.1136/injuryprev-2015-041599",
      "doi": ""
    },
    {
      "text": "Dennis E. Reidy, Kathryn A. Brookmeyer, Brittany Gentile, Danielle S. Berke, and Amos Zeichner. 2016. Gender Role Discrepancy Stress, High-Risk Sexual Behavior, and Sexually Transmitted Disease. Archives of Sexual Behavior 45, 2: 459--465. https://doi.org/10.1007/s10508-014-0413-0",
      "doi": ""
    },
    {
      "text": "Dennis E. Reidy, Steven D. Shirk, Colleen A. Sloan, and Amos Zeichner. 2009. Men who aggress against women: Effects of feminine gender role violation on physical aggression in hypermasculine men. Psychology of Men & Masculinity 10, 1: 1-- 12. https://doi.org/10.1037/a0014794",
      "doi": ""
    },
    {
      "text": "Dennis E. Reidy, Joanne P. Smith-Darden, Kai S. Cortina, Roger M. Kernsmith, and Poco D. Kernsmith. 2015. Masculine Discrepancy Stress, Teen Dating Violence, and Sexual Violence Perpetration Among Adolescent Boys. Journal of Adolescent Health 56, 6: 619--624. https://doi.org/10.1016/j.jadohealth.2015.02.009",
      "doi": ""
    },
    {
      "text": "Barbara A. Ritter. 2014. Deviant Behavior in ComputerMediated Communication: Development and Validation of a Measure of Cybersexual Harassment. Journal of ComputerMediated Communication 19, 2: 197--214. https://doi.org/10.1111/jcc4.12039",
      "doi": "10.1111/jcc4.12039"
    },
    {
      "text": "Michael Salter. 2018. From geek masculinity to Gamergate: the technological rationality of online abuse. Crime, Media, Culture 14, 2: 247--264. https://doi.org/10.1177/1741659017690893",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Sinn. 1997. The Predictive and Discriminant Validity of Masculinity Ideology. Journal of Research in Personality 31, 1: 117--135. https://doi.org/10.1006/jrpe.1997.2172",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The Online Disinhibition Effect. CyberPsychology & Behavior 7, 3: 321--326. https://doi.org/10.1089/1094931041291295",
      "doi": ""
    },
    {
      "text": "Laura Thompson. 2018. \"I can be your Tinder nightmare\": Harassment and misogyny in the online sexual marketplace. Feminism & Psychology 28, 1: 69--89. https://doi.org/10.1177/0959353517720226",
      "doi": ""
    },
    {
      "text": "Reinis Udris. 2014. Cyberbullying among high school students in Japan: Development and validation of the Online Disinhibition Scale. Computers in Human Behavior 41, Supplement C: 253--261. https://doi.org/10.1016/j.chb.2014.09.036",
      "doi": "10.1016/j.chb.2014.09.036"
    },
    {
      "text": "Joseph A. Vandello and Jennifer K. Bosson. 2013. Hard won and easily lost: A review and synthesis of theory and research on precarious manhood. Psychology of Men & Masculinity 14, 2: 101--113. https://doi.org/10.1037/a0029826",
      "doi": ""
    },
    {
      "text": "Joseph A. Vandello, Jennifer K. Bosson, Dov Cohen, Rochelle M. Burnaford, and Jonathan R. Weaver. 2008. Precarious manhood. Journal of Personality and Social Psychology 95, 6: 1325--1339. https://doi.org/10.1037/a0012453",
      "doi": ""
    },
    {
      "text": "J.R. Vikery, T. Everback, L. Blackwell, M.A. Franks, B. Friedman, S. Gibbons, T. Gillespie, and A. Massanari. 2018. Conclusion: What Can We Do About Mediated Misogyny? In Mediating Misogyny: Gender, Technology, and Harassment, J.R. Vickery and T. Everback (eds.). Palgrave Macmillan, London, 399-- 422.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women's Experiences With and Strategies for Mitigating Negative Effects of Online Harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, 1231--1245. https://doi.org/10.1145/2998181.2998337",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Sebastian Wachs and Michelle F. Wright. 2018. Associations between Bystanders and Perpetrators of Online Hate: The Moderating Role of Toxic Online Disinhibition. International Journal of Environmental Research and Public Health 15, 9. https://doi.org/10.3390/ijerph15092030",
      "doi": ""
    },
    {
      "text": "Kevin S. Weaver and Theresa K. Vescio. 2015. The Justification of Social Inequality in Response to Masculinity Threats. Sex Roles 72, 11--12: 521--535. https://doi.org/10.1007/s11199-015-0484-y",
      "doi": ""
    },
    {
      "text": "Y. Joel Wong, Moon-Ho Ringo Ho, Shu-Yi Wang, and I. S. Keino Miller. 2017. Meta-analyses of the relationship between conformity to masculine norms and mental health-related outcomes. Journal of Counseling Psychology 64, 1: 80--93. https://doi.org/10.1037/cou0000176",
      "doi": ""
    },
    {
      "text": "Understanding \"Bad Actors\" Online | Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. Retrieved January 8, 2020 from http://dl.acm.org/doi/abs/10.1145/3170427.3170610",
      "doi": ""
    },
    {
      "text": "Harassment in Social Virtual Reality: Challenges for Platform Governance: Proceedings of the ACM on HumanComputer Interaction: Vol 3, No CSCW. Proceedings of the ACM on Human-Computer Interaction. Retrieved January 8, 2020 from http://dl.acm.org/doi/abs/10.1145/3359202",
      "doi": ""
    },
    {
      "text": "Accountability and Empathy by Design: Encouraging Bystander Intervention to Cyberbullying on Social Media: Proceedings of the ACM on Human-Computer Interaction: Vol 3, No CSCW. Proceedings of the ACM on Human-Computer Interaction. Retrieved January 8, 2020 from http://dl.acm.org/doi/abs/10.1145/3359220",
      "doi": ""
    },
    {
      "text": "Upstanding by Design | Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Retrieved January 8, 2020 from https://dl.acm.org/doi/abs/10.1145/3173574.3173785",
      "doi": ""
    }
  ]
}