{
  "doi": "10.1145/3313831.3376880",
  "title": "Dziban: Balancing Agency & Automation in Visualization Design via Anchored Recommendations",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Visualization recommender systems attempt to automate design decisions spanning choices of selected data, transformations, and visual encodings. However, across invocations such recommenders may lack the context of prior results, producing unstable outputs that override earlier design choices. To better balance automated suggestions with user intent, we contribute Dziban, a visualization API that supports both ambiguous specification and a novel anchoring mechanism for conveying desired context. Dziban uses the Draco knowledge base to automatically complete partial specifications and suggest appropriate visualizations. In addition, it extends Draco with chart similarity logic, enabling recommendations that also remain perceptually similar to a provided \"anchor\" chart. Existing APIs for exploratory visualization, such as ggplot2 and Vega-Lite, require fully specified chart definitions. In contrast, Dziban provides a more concise and flexible authoring experience through automated design, while preserving predictability and control through anchored recommendations.",
  "authors": [
    {
      "name": "Halden Lin",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528154",
      "orcid": "missing"
    },
    {
      "name": "Dominik Moritz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-89758751957/rel-imgonly/dominik_berlin.jpg",
      "acmid": "89758751957",
      "orcid": "0000-0002-3110-1053"
    },
    {
      "name": "Jeffrey Heer",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michelle Q. Wang Baldonado, Allison Woodruff, and Allan Kuchinsky. 2000. Guidelines for Using Multiple Views in Information Visualization. In Proceedings of the working conference on Advanced visual interfaces, AVI 2000, Palermo, Italy, May 23--26, 2000. 110--119. DOI: http://dx.doi.org/10.1145/345513.345271",
      "doi": "10.1145/345513.345271"
    },
    {
      "text": "Leilani Battle and Jeffrey Heer. 2019. Characterizing Exploratory Visual Analysis: A Literature Review and Evaluation of Analytic Provenance in Tableau. Computer Graphics Forum (Proc. EuroVis) (2019). DOI: http://dx.doi.org/10.1111/cgf.13678",
      "doi": ""
    },
    {
      "text": "Jacques Bertin. 1983. The Semiology of Graphics.",
      "doi": ""
    },
    {
      "text": "Gerhard Brewka, Thomas Eiter, and Miroslaw Truszczynski. 2011. Answer set programming at a glance. Commun. ACM 54, 12 (2011), 92--103. DOI: http://dx.doi.org/10.1145/2043174.2043195",
      "doi": "10.1145/2043174.2043195"
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Camilla Forsell and Jimmy Johansson. 2010. An heuristic set for evaluation in information visualization. In Proceedings of the International Conference on Advanced Visual Interfaces, AVI 2010, Roma, Italy, May 26--28, 2010. 199--206. DOI: http://dx.doi.org/10.1145/1842993.1843029",
      "doi": "10.1145/1842993.1843029"
    },
    {
      "text": "Martin Gebser, Roland Kaminski, Benjamin Kaufmann, and Torsten Schaub. 2014. Clingo = ASP + Control: Preliminary Report. ArXiv abs/1405.3694 (2014).",
      "doi": ""
    },
    {
      "text": "Martin Gebser, Benjamin Kaufmann, Roland Kaminski, Max Ostrowski, Torsten Schaub, and Marius Schneider. 2011. Potassco: The Potsdam Answer Set Solving Collection. AI Commun. 24, 2 (April 2011), 107--124. http://dl.acm.org/citation.cfm?id=1971622.1971623",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer. 2019. Agency plus automation: Designing arti?cial intelligence into interactive systems. Proceedings of the National Academy of Sciences 116, 6 (Feb. 2019), 1844--1850. DOI: http://dx.doi.org/10.1073/pnas.1807184115",
      "doi": ""
    },
    {
      "text": "Kevin Zeng Hu, Diana Orghian, and César A. Hidalgo. 2018. DIVE: A Mixed-Initiative System Supporting Integrated Data Exploration Work?ows. In HILDA@SIGMOD.",
      "doi": ""
    },
    {
      "text": "Younghoon Kim, Kanit Wongsuphasawat, Jessica Hullman, and Jeffrey Heer. 2017. GraphScape: A Model for Automated Reasoning About Visualization Similarity and Sequencing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2628--2638. DOI: http://dx.doi.org/10.1145/3025453.3025866",
      "doi": "10.1145/3025453.3025866"
    },
    {
      "text": "Jock Mackinlay. 1986. Automating the design of graphical presentations of relational information. ACM Transactions on Graphics 5, 2 (1986), 110--141. DOI: http://dx.doi.org/10.1145/22949.22950",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "Jock D. Mackinlay, Pat Hanrahan, and Chris Stolte. 2007. Show Me: Automatic Presentation for Visual Analysis. IEEE Trans. Vis. Comput. Graph. 13, 6 (2007), 1137--1144. DOI: http://dx.doi.org/10.1109/TVCG.2007.70594",
      "doi": "10.1109/TVCG.2007.70594"
    },
    {
      "text": "Dominik Moritz, Chenglong Wang, Gregory Nelson, Halden Lin, Adam M. Smith, Bill Howe, and Jeffrey Heer. 2019. Formalizing Visualization Design Knowledge as Constraints: Actionable and Extensible Models in Draco. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2019). DOI: http://dx.doi.org/10.1109/TVCG.2018.2865240",
      "doi": ""
    },
    {
      "text": "Zening Qu and Jessica Hullman. 2016. Evaluating Visualization Sets: Trade-offs Between Local Effectiveness and Global Consistency. In Proceedings of the Sixth Workshop on Beyond Time and Errors on Novel Evaluation Methods for Visualization, BELIV 2016, Baltimore, MD, USA, October 24, 2016. 44--52. DOI: http://dx.doi.org/10.1145/2993901.2993910",
      "doi": "10.1145/2993901.2993910"
    },
    {
      "text": "Zening Qu and Jessica Hullman. 2018. Keeping Multiple Views Consistent: Constraints, Validations, and Exceptions in Visualization Authoring. IEEE Trans. Vis. Comput. Graph. 24, 1 (2018), 468--477. DOI: http://dx.doi.org/10.1109/TVCG.2017.2744198",
      "doi": ""
    },
    {
      "text": "A. Sarikaya, M. Gleicher, and D. A. Sza?r. 2018. Design Factors for Summary Visualization in Visual Analytics. Computer Graphics Forum 37, 3 (June 2018), 145--156. DOI: http://dx.doi.org/10.1111/cgf.13408",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Trans. Vis. Comput. Graph. 23, 1 (2017), 341--350. DOI: http://dx.doi.org/10.1109/TVCG.2016.2599030",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Tarique Siddiqui, Albert Kim, John Lee, Karrie Karahalios, and Aditya Parameswaran. 2016. Effortless Data Exploration with Zenvisage: An Expressive and Interactive Visual Analytics System. Proc. VLDB Endow. 10, 4 (Nov. 2016), 457--468. DOI: http://dx.doi.org/10.14778/3025111.3025126",
      "doi": "10.14778/3025111.3025126"
    },
    {
      "text": "Melanie Tory and Vidya Setlur. 2019. Do What I Mean , Not What I Say ! Design Considerations for Supporting Intent and Context in Analytical Conversation. IEEE Trans. Visualization & Comp. Graphics (Proc. VAST) (2019). https://research.tableau.com/paper/intent-VAST",
      "doi": ""
    },
    {
      "text": "Jacob VanderPlas, Brian Granger, Jeffrey Heer, Dominik Moritz, Kanit Wongsuphasawat, Arvind Satyanarayan, Eitan Lees, Ilia Timofeev, Ben Welsh, and Scott Sievert. 2018. Altair: Interactive Statistical Visualizations for Python. Journal of Open Source Software (dec 2018). DOI: http://dx.doi.org/10.21105/joss.01057",
      "doi": ""
    },
    {
      "text": "Manasi Vartak, Samuel Madden, Aditya G. Parameswaran, and Neoklis Polyzotis. 2014. SEEDB: Automatically Generating Query Visualizations. PVLDB 7 (2014), 1581--1584. DOI: http://dx.doi.org/10.14778/2733004.2733035",
      "doi": "10.14778/2733004.2733035"
    },
    {
      "text": "Vega-Lite API 2019. (2019). https://github.com/vega/vega-lite-api Accessed: 2019-09--19.",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2016. ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. https://ggplot2.tidyverse.org",
      "doi": "10.5555/2967391"
    },
    {
      "text": "Leland Wilkinson. 2005. The Grammar of Graphics (Statistics and Computing). Springer-Verlag, Berlin, Heidelberg.",
      "doi": "10.5555/1088896"
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016a. Towards a general-purpose query language for visualization recommendation. In Proceedings of the Workshop on Human-In-the-Loop Data Analytics HILDA '16. 1--6. DOI: http://dx.doi.org/10.1145/2939502.2939506",
      "doi": "10.1145/2939502.2939506"
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016b. Voyager: Exploratory Analysis via Faceted Browsing of Visualization Recommendations. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan. 2016), 649--658. DOI: http://dx.doi.org/10.1109/tvcg.2015.2467191",
      "doi": "10.1109/TVCG.2015.2467191"
    },
    {
      "text": "Kanit Wongsuphasawat, Zening Qu, Dominik Moritz, Riley Chang, Felix Ouk, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2017. Voyager 2. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press. DOI: http://dx.doi.org/10.1145/3025453.3025768",
      "doi": "10.1145/3025453.3025768"
    }
  ]
}