{
  "doi": "10.1145/3313831.3376556",
  "title": "Evaluation of a Financial Portfolio Visualization using Computer Displays and Mixed Reality Devices with Domain Experts",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2020,
  "badges": [],
  "abstract": "With the advent of mixed reality devices such as the Microsoft HoloLens, developers have been faced with the challenge to utilize the third dimension in information visualization effectively. Research on stereoscopic devices has shown that three-dimensional representation can improve accuracy in specific tasks (e.g., network visualization). Yet, so far the field has remained mute on the underlying mechanism. Our study systematically investigates the differences in user perception between a regular monitor and a mixed reality device. In a real-life within-subject experiment in the field with twenty-eight investment bankers, we assessed subjective and objective task performance with two- and three-dimensional systems, respectively. We tested accuracy with regard to position, size, and color using single and combined tasks. Our results do not show a significant difference in accuracy between mixed-reality and standard 2D monitor visualizations.",
  "authors": [
    {
      "name": "Kay Schroeder",
      "institution": "Zuyd University of Applied Sciences, Heerlen, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528084",
      "orcid": "missing"
    },
    {
      "name": "Batoul Ajdadilish",
      "institution": "Zuyd University of Applied Sciences, Heerlen, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528036",
      "orcid": "missing"
    },
    {
      "name": "Alexander P. Henkel",
      "institution": "Open University, Heerlen, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528970",
      "orcid": "missing"
    },
    {
      "name": "André Calero Valdez",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472646060",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benjamin Bach, Raimund Dachselt, Sheelagh Carpendale, Tim Dwyer, Christopher Collins, and Bongshin Lee. 2016. Immersive Analytics: Exploring Future Interaction and Visualization Technologies for Data Analytics. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). Association for Computing Machinery, New York, NY, USA, 529--533. DOI: http://dx.doi.org/10.1145/2992154.2996365",
      "doi": "10.1145/2992154.2996365"
    },
    {
      "text": "Julien Barnier. 2019. rmdformats: HTML Output Formats and Templates for 'rmarkdown' Documents. https://CRAN.R-project.org/package=rmdformats R package version 0.3.5.",
      "doi": ""
    },
    {
      "text": "Peter W. S. Butcher, Nigel W. John, and Panagiotis D. Ritsos. 2019. VRIA - A Framework for Immersive Analytics on the Web. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article LBW2615, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3312798",
      "doi": ""
    },
    {
      "text": "T. Chandler, M. Cordeil, T. Czauderna, T. Dwyer, J. Glowacki, C. Goncu, M. Klapperstueck, K. Klein, K. Marriott, F. Schreiber, and E. Wilson. 2015. Immersive Analytics. In 2015 Big Data Visual Analytics (BDVA). IEEE, Hobart, TAS, Australia, 1--8. DOI: http://dx.doi.org/10.1109/BDVA.2015.7314296",
      "doi": ""
    },
    {
      "text": "Zhutian Chen, Yifang Wang, Tianchen Sun, Xiang Gao, Wei Chen, Zhigeng Pan, Huamin Qu, and Yingcai Wu. 2017. Exploring the design space of immersive urban analytics. Visual Informatics 1, 2 (2017), 132 -- 142. DOI: http://dx.doi.org/10.1016/j.visinf.2017.11.002",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Grégoire Cliquet, Matthieu Perreira, Fabien Picarougne, Yannick Prié, and Toinon Vigier. 2017. Towards HMD-based Immersive Analytics. In Immersive analytics Workshop. IEEE VIS 2017, Phoenix, AZ, USA, hal--01631306.",
      "doi": ""
    },
    {
      "text": "Gergely Daróczi. 2019. logger: A Lightweight, Modern and Flexible Logging Utility. https://CRAN.R-project.org/package=logger R package version 0.1.",
      "doi": ""
    },
    {
      "text": "Fred D Davis. 1985. A technology acceptance model for empirically testing new end-user information systems: Theory and results. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Glenn Davis. 2018. spacesXYZ: CIE XYZ and some of Its Derived Color Spaces. https://CRAN.R-project.org/package=spacesXYZ R package version 1.0--4.",
      "doi": ""
    },
    {
      "text": "Andrew J Elliot and Judith M Harackiewicz. 1996. Approach and avoidance achievement goals and intrinsic motivation: A mediational analysis. Journal of personality and social psychology 70, 3 (1996), 461.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, ACM, Atlanta, Georgia, USA, 203--212.",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Debra Steele Johnson, Daniel B Turban, Kalen F Pieper, and Yin Mei Ng. 1996. Exploring the Role of Normative-and Performance-Based Feedback in Motivational Processes 1. Journal of Applied Social Psychology 26, 11 (1996), 973--0992.",
      "doi": ""
    },
    {
      "text": "Sungahn Ko, Isaac Cho, Shehzad Afzal, C. Yau, Junghoon Chae, A. Malik, K. Beck, Y. Jang, W. Ribarsky, and David Ebert. 2016. A Survey on Visual Analysis Approaches for Financial Data. Computer Graphics Forum 35 (06 2016), 599--617. DOI: http://dx.doi.org/10.1111/cgf.12931",
      "doi": ""
    },
    {
      "text": "Artur Lugmayr, Yi Juin Lim, Joshua Hollick, Joyce Khuu, and Felix Chan. 2018. Financial Data Visualization in 3D on Immersive Virtual Reality Displays: A Case-Study for Data Storytelling and Information Visualization of Financial Data of Australia's Energy Sector. In Enterprise Applications and Services in the Finance Industry (Lecture Notes in Computer Science (LNCB)), Brahim Saadouni (Ed.). Springer-Verlag, Cham, 118--120. [ACCEPTED].",
      "doi": ""
    },
    {
      "text": "Ulrik Lyngs. 2019. chi20-papers-rmarkdown. https://github.com/ulyngs/chi20-papers-rmarkdown. (2019). DOI: http://dx.doi.org/10.5281/zenodo.3451422",
      "doi": ""
    },
    {
      "text": "Patrick Millais, Simon L. Jones, and Ryan Kelly. 2018. Exploring Data in Virtual Reality: Comparisons with 2D Data Visualizations. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW007, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188537",
      "doi": "10.1145/3170427.3188537"
    },
    {
      "text": "Tamara Munzner. 2008. Process and pitfalls in writing information visualization research papers. In Information visualization. Springer, Cham, 134--153.",
      "doi": ""
    },
    {
      "text": "William Revelle. 2018. psych: Procedures for Psychological, Psychometric, and Personality Research. https://CRAN.R-project.org/package=psych R package version 1.8.10.",
      "doi": ""
    },
    {
      "text": "Anya C. Savikhin. 2013. The Application of Visual Analytics to Financial Decision-Making and Risk Management: Notes from Behavioural Economics. Springer Berlin Heidelberg, Berlin, Heidelberg, 99--114. DOI: http://dx.doi.org/10.1007/978--3--642--32232--7_5",
      "doi": ""
    },
    {
      "text": "H. S. Smallman, M. St. John, H. M. Oonk, and M. B. Cowen. 2001. Information availability in 2D and 3D displays. IEEE Computer Graphics and Applications 21, 5 (July 2001), 51--57. DOI: http://dx.doi.org/10.1109/38.946631",
      "doi": "10.1109/38.946631"
    },
    {
      "text": "David P. Tegarden. 1999. Business Information Visualization. Commun. AIS 1, 1es, Article 4 (Jan. 1999), 37 pages. http://dl.acm.org/citation.cfm?id=374109.374113",
      "doi": ""
    },
    {
      "text": "M. Tory, A. E. Kirkpatrick, M. S. Atkins, and T. Moller. 2006. Visualization task performance with 2D, 3D, and combination displays. IEEE Transactions on Visualization and Computer Graphics 12, 1 (Jan 2006), 2--13. DOI: http://dx.doi.org/10.1109/TVCG.2006.17",
      "doi": "10.1109/TVCG.2006.17"
    },
    {
      "text": "André Calero Valdez. 2019. rmdtemplates - an opinionated collection of rmarkdown templates. https://github.com/statisticsforsocialscience/rmd_templates R package version 0.3.0.0.",
      "doi": ""
    },
    {
      "text": "Jarke J Van Wijk and Edward R Van Selow. 1999. Cluster and calendar based visualization of time series data. In Proceedings 1999 IEEE Symposium on Information Visualization (InfoVis' 99). IEEE, IEEE, Burnaby, BC, Canada, 4--9.",
      "doi": ""
    },
    {
      "text": "Colin Ware and Peter Mitchell. 2008. Visualizing Graphs in Three Dimensions. ACM Trans. Appl. Percept. 5, 1, Article 2 (Jan. 2008), 15 pages. DOI: http://dx.doi.org/10.1145/1279640.1279642",
      "doi": "10.1145/1279640.1279642"
    },
    {
      "text": "Hadley Wickham. 2017. tidyverse: Easily Install and Load the 'Tidyverse'. https://CRAN.R-project.org/package=tidyverse R package version 1.2.1.",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2018. scales: Scale Functions for Visualization. https://CRAN.R-project.org/package=scales R package version 1.0.0.",
      "doi": ""
    },
    {
      "text": "Yihui Xie. 2019. knitr: A General-Purpose Package for Dynamic Report Generation in R. https://CRAN.R-project.org/package=knitr R package version 1.25.",
      "doi": ""
    },
    {
      "text": "Yihui Xie, Joe Cheng, and Xianying Tan. 2018. DT: A Wrapper of the JavaScript Library 'DataTables'. https://CRAN.R-project.org/package=DT R package version 0.5.",
      "doi": ""
    },
    {
      "text": "Hao Zhu. 2018. kableExtra: Construct Complex Table with 'kable' and Pipe Syntax. https://CRAN.R-project.org/package=kableExtra R package version 0.9.0.",
      "doi": ""
    },
    {
      "text": "Daniel Zielasko, Martin Bellgardt, Alexander Meisner, Maliheh Haghgoo, Bernd Hentschel, Benjamin Weyers, and Torsten Kuhlen. 2017. buenoSDIAs: Supporting Desktop Immersive Analytics While Actively Preventing Cybersickness. In Workshop on Immersive Analytics. IEEE, Phoenix, AZ, USA.",
      "doi": ""
    }
  ]
}