{
  "doi": "10.1145/3313831.3376353",
  "title": "Virtual Reality Without Vision: A Haptic and Auditory White Cane to Navigate Complex Virtual Worlds",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Current Virtual Reality (VR) technologies focus on rendering visuospatial effects, and thus are inaccessible for blind or low vision users. We examine the use of a novel white cane controller that enables navigation without vision of large virtual environments with complex architecture, such as winding paths and occluding walls and doors. The cane controller employs a lightweight three-axis brake mechanism to provide large-scale shape of virtual objects. The multiple degrees-of-freedom enables users to adapt the controller to their preferred techniques and grip. In addition, surface textures are rendered with a voice coil actuator based on contact vibrations; and spatialized audio is determined based on the progression of sound through the geometry around the user. We design a scavenger hunt game that demonstrates how our device enables blind users to navigate a complex virtual environment. Seven out of eight users were able to successfully navigate the virtual room (6x6m) to locate targets while avoiding collisions. We conclude with design consideration on creating immersive non-visual VR experiences based on user preferences for cane techniques, and cane material properties.",
  "authors": [
    {
      "name": "Alexa F. Siu",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-99659214534/rel-imgonly/profile_square.jpg",
      "acmid": "99659214534",
      "orcid": "missing"
    },
    {
      "name": "Mike Sinclair",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498872",
      "orcid": "0000-0003-4343-2332"
    },
    {
      "name": "Robert Kovacs",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658696163/rel-imgonly/robert_kovacs.jpg",
      "acmid": "99658696163",
      "orcid": "0000-0002-9427-2861"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi, Mar Gonzalez-Franco, Eyal Ofek, and Anthony Steed. 2019. I'm a Giant: Walking in Large Virtual Environments at High Speed Gains. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 522, 1--13. DOI: https://doi.org/10.1145/3290605.3300752",
      "doi": "10.1145/3290605.3300752"
    },
    {
      "text": "Grace Ambrose-Zaken. 2005. Knowledge of and preferences for long cane components: A qualitative and quantitative study. Journal of Visual Impairment & Blindness, 99(10), 633--645.",
      "doi": ""
    },
    {
      "text": "B. B. Blasch, Steven J. LaGrow, and W. R. De l'Aune. 1996. Three aspects of coverage provided by the long cane: Object, surface, and foot-placement preview. Journal of Visual Impairment and Blindness, 90, 295301.",
      "doi": ""
    },
    {
      "text": "Erin Connors, Elizabeth R. Chrastil, Jaimie Sánchez and Ltfi B. Merabet. 2014. Action video game play and transfer of navigation and spatial cognition skills in adolescents who are blind. Frontiers in Human Neuroscience, 133.",
      "doi": ""
    },
    {
      "text": "Edoardo D'Atri, Carlo Maria Medaglia, Alexandru Serbanati, Ugo Biader Ceipidor, Emanuele Panizzi and Alessandro D'Atri. 2007. A system to aid blind people in the mobility: A usability test and its results. In Second International Conference on Systems (ICONS'07) (pp. 35--35). IEEE.",
      "doi": "10.1109/ICONS.2007.7"
    },
    {
      "text": "Massimiliano Gabardi, Massimiliano Solazzi, Daniele Leonardis and Antonio Frisoli. 2016. A new wearable fingertip haptic interface for the rendering of virtual shapes and surface features. In 2016 IEEE Haptics Symposium (HAPTICS) (pp. 140--146). IEEE.",
      "doi": ""
    },
    {
      "text": "Nicholas A. Giudice. (2018). Navigating without vision: principles of blind spatial cognition. Handbook of behavioral and cognitive geography. Edward Elgar Publishing.",
      "doi": ""
    },
    {
      "text": "José L. González-Mora, L. Rodriguez-Hernandez, L. F. Rodriguez-Ramos, L. Díaz-Saco, and N. Sosa. 1999. Development of a new space perception system for blind people, based on the creation of a virtual acoustic space. In International Work-Conference on Artificial Neural Networks. (pp. 321--330). Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "William Henry Jacobson. (1993). The art and science of teaching orientation and mobility to persons with visual impairments. American Foundation for the Blind.",
      "doi": ""
    },
    {
      "text": "HTC Vive. Retrieved September 13, 2019 from https://www.vive.com/us/.",
      "doi": ""
    },
    {
      "text": "Dae Shik Kim and Robert Wall Emerson. 2012. Effect of cane length on drop-off detection performance. Journal of Visual Impairment & Blindness, 106(1), 3135.",
      "doi": ""
    },
    {
      "text": "Dae Shik Kim, Robert Wall Emerson and Amy B. Curtis. 2010. Ergonomic factors related to drop-off detection with the long cane: Effects of cane tips and techniques. Human Factors, 52(3), 456--465.",
      "doi": ""
    },
    {
      "text": "Dae Shik Kim, Robert Wall Emerson, Kooroosh Naghshineh and Alexander Auer. 2017. Drop-off detection with the long cane: Effect of cane shaft weight and rigidity on performance. Ergonomics, 60(1), 59--68.",
      "doi": ""
    },
    {
      "text": "Julian Kreimeier and Timo Götzelmann. 2019. First Steps Towards Walk-In-Place Locomotion and Haptic Feedback in Virtual Reality for Visually Impaired. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). Association for Computing Machinery, New York, NY, USA, Paper LBW2214, 1--6. DOI: https://doi.org/10.1145/3290607.3312944",
      "doi": ""
    },
    {
      "text": "Katherine K. Kuchenbecker, Jonathan Fiene and Günter Niemeyer. 2006. Improving contact realism through event-based haptic feedback. IEEE Transactions on Visualization and Computer Graphics, 12.2, 219--230.",
      "doi": "10.1109/TVCG.2006.32"
    },
    {
      "text": "Steven J. LaGrow, B. B. Blasch and William De l'Aune. 1997. The effect of hand position on detection distance for object and surface preview when using the long cane for nonvisual travel. RE: view, 28(4), 169.",
      "doi": ""
    },
    {
      "text": "Steven J. LaGrow and Marvin J. Weessies. 1994. Orientation and mobility: Techniques for independence. Palmerston North, New Zealand: Dunmore Press.",
      "doi": ""
    },
    {
      "text": "Orly Lahav and David Mioduser. 2001. Multisensory virtual environment for supporting blind persons' acquisition of spatial cognitive mapping--a case study. In EdMedia+ Innovate Learning. Association for the Advancement of Computing in Education (AACE), 10461051.",
      "doi": ""
    },
    {
      "text": "Orly Lahav and David Mioduser. 2004. Exploration of unknown spaces by people who are blind, using a multisensory virtual environment (MVE). Journal of Special Education Technology, 19, 3, 15--23.",
      "doi": ""
    },
    {
      "text": "Orly Lahav and David Mioduser. 2008. Hapticfeedback support for cognitive mapping of unknown spaces by people who are blind. International Journal of Human-Computer Studies, 66(1), 23--35.",
      "doi": "10.1016/j.ijhcs.2007.08.001"
    },
    {
      "text": "Orly Lahav, D Schloerb, S Kummar and M A Srinivasan. 2011. A virtual map to support people who are blind to navigate through real spaces. Journal of Special Education Technology, 26, 4.",
      "doi": ""
    },
    {
      "text": "Orly Lahav, David W. Schloerb and Mandayam A. Srinivasan. 2015. Virtual environments for people who are visually impaired integrated into an orientation and mobility program. Journal of Visual Impairment & Blindness, 109(1), 5--16.",
      "doi": ""
    },
    {
      "text": "Nils Landin, Joseph M. Romano, William McMahan and Katherine J. Kuchenbecker. 2010. Dimensional reduction of high-frequency accelerations for haptic rendering. In International conference on human haptic sensing and touch enabled computer applications, pp. 79--86. Springer, Berlin, Heidelberg, 2010.",
      "doi": ""
    },
    {
      "text": "Anatole Lécuyer, Pascal Mobuchon, Christine Mégard, Jérôme Perret, Claude Andriot and J. P. Colinot. 2003. HOMERE: a multimodal system for visually impaired people to explore virtual environments. In Proceedings of IEEE Virtual Reality. IEEE. (pp. 251--258).",
      "doi": ""
    },
    {
      "text": "Eric Linberg and Tommy Garling. 1983. Acquisition of different types of locational information in cognitive maps: Automatic or effortful processing? In Psychological Research, 45, 19--38.",
      "doi": ""
    },
    {
      "text": "Maruricio Lumbreras and Jaime Sánchez. 1999. Interactive 3D sound hyperstories for blind children. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). Association for Computing Machinery, New York, NY, USA, 318-- 325. DOI: https://doi.org/10.1145/302979.303101",
      "doi": "10.1145/302979.303101"
    },
    {
      "text": "Shachar Maidenbaum, Shelly Levy-Tzedek, DanielRobert Chebat and Amir Amedi. 2013. Increasing accessibility to the blind of virtual environments, using a virtual mobility aid based on the\" EyeCane\": Feasibility study. PloS one 8, 8, e72555.",
      "doi": ""
    },
    {
      "text": "Shachar Maidenbaum and Amir Amedi. 2015. Nonvisual virtual interaction: Can Sensory Substitution generically increase the accessibility of Graphical virtual reality to the blind? In 2015 3rd IEEE VR International Workshop on Virtual and Augmented Assistive Technology (VAAT). IEEE. pp. 15--17.",
      "doi": ""
    },
    {
      "text": "Mayer L. Max and Jesse R. Gonzalez. 1997. Blind persons navigate in virtual reality (VR); hearing and feeling communicates reality. Studies in health technology and informatics. 39, 54--59.",
      "doi": ""
    },
    {
      "text": "Ravish Mehra, Nikunj Raghuvanshi, Lauri Savioja, Ming C. Lin, and Dinesh Manocha. 2012. An efficient GPU-based time domain solver for the acoustic wave equation. In Applied Acoustics. 73(2), 83--94.",
      "doi": ""
    },
    {
      "text": "Frank Meijer, Branko L. Geudeke, and Egon L. Van den Broek. 2009. Navigating through virtual environments: Visual realism improves spatial cognition. In CyberPsychology & Behavior. 12(5), 517--521.",
      "doi": ""
    },
    {
      "text": "Lofti B. Merabet, Erin C. Connors, Mark A. Halko and Jaime Sanchez. 2012. Teaching the Blind to Find Their Way by Playing Video Games. PloS one 7, no. 9 (2012): e44958.",
      "doi": ""
    },
    {
      "text": "Richard Mettler. 1998. Cognitive learning theory and cane travel instruction: A new paradigm. DIANE Publishing.",
      "doi": ""
    },
    {
      "text": "Shannon D. Moeser. 1988. Cognitive mapping in a complex building. In Environment and Behavior. 20, 21--49.",
      "doi": ""
    },
    {
      "text": "NFB Canes. Retrieved August 9, 2019 from https://www.nfb.org/programs-services/free-whitecane-program. NFB canes.",
      "doi": ""
    },
    {
      "text": "Kiyohiko Nunokawa, Y. Seki, Shuichi Ino and K. Doi. 2014. Judging hardness of an object from the sounds of tapping created by a white cane. In 2014 36th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE, pp. 5876--5879.",
      "doi": ""
    },
    {
      "text": "Makoto Ohuchi, Yukio Iwaya, and Yôiti Suzuki. 2006. Cognitive-map forming of the blind in virtual sound environment. Georgia Institute of Technology, 2006. http://hdl.handle.net/1853/50588.",
      "doi": ""
    },
    {
      "text": "Project Acoustics. 2019. (3 March 2019). Retrieved September 6, 2019 from https://aka.ms/acoustics.",
      "doi": ""
    },
    {
      "text": "Ludek Pokluda and Jiri Sochor. 2003. Spatial haptic orientation for visually impaired people. In Eurographics.",
      "doi": ""
    },
    {
      "text": "Nikunj Raghuvanshi and John Snyder. 2018. Parametric directional coding for precomputed sound propagation. ACM Trans. Graph. 37, 4, Article 108 (July 2018), 14 pages. DOI: https://doi.org/10.1145/3197517.3201339",
      "doi": "10.1145/3197517.3201339"
    },
    {
      "text": "Nikunj Raghuvanshi, John Snyder, Ravish Mehra, Ming Lin, and Naga Govindaraju. 2010. Precomputed wave simulation for real-time sound propagation of dynamic sources in complex scenes. ACM Trans. Graph. 29, 4, Article 68 (July 2010), 11 pages. DOI: https://doi.org/10.1145/1778765.1778805",
      "doi": "10.1145/1778765.1778805"
    },
    {
      "text": "Reardon, S. 2011. Playing by ear. Science, 333(6051), 1816.",
      "doi": ""
    },
    {
      "text": "Anthony E. Richardson, Daniel R. Montello and Mary Hegarty. 1999. Spatial knowledge acquisition from maps and from navigation in real and virtual environments. Memory & Cognition. 27(4), 741--750.",
      "doi": ""
    },
    {
      "text": "Mark D. Rodgers and Robert W. Emerson. 2005. Human factor analysis of long cane design: Weight and length. Journal of Visual Impairment & Blindness. 99(10), 622--632.",
      "doi": ""
    },
    {
      "text": "Joseph M. Romano and Katherine J. Kuchenbecker. 2011. Creating realistic virtual textures from contact acceleration data. In IEEE Transactions on Haptics. 5(2), 109--119.",
      "doi": "10.1109/TOH.2011.38"
    },
    {
      "text": "Joseph M. Romano, Takashi Yoshioka and Katherine J. Kuchenbecker. 2010. Automatic filter design for synthesis of haptic textures from recorded acceleration data. In 2010 IEEE International Conference on Robotics and Automation. IEEE. pp. 1815--1821.",
      "doi": ""
    },
    {
      "text": "Sandra Rosen. Long Cane Techniques: Study Guide. Retrieved August 9, 2019 from https://tech.aph.org/sbs/04_sbs_lc_study.html#12",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez and Mauricio Sáenz. 2010. Metro navigation for the blind. In Computers & Education. 55(3), 970--981.",
      "doi": "10.1016/j.compedu.2010.04.008"
    },
    {
      "text": "David W. Schloerb, Orly Lahav, Joseph G. Deslogeand Mandayam A. Srinivasan. 2010. BlindAid: Virtual environment system for self-reliant trip planning and orientation and mobility training. In 2010 IEEE Haptics Symposium. IEEE. pp. 363--370.",
      "doi": ""
    },
    {
      "text": "Martijn J. Schuemie, Peter Van Der Straaten, Merel Krijn and Charles A. Van Der Mast. 2001. Research on presence in virtual reality: A survey. In CyberPsychology & Behavior. 4(2), 183--201.",
      "doi": ""
    },
    {
      "text": "Yoshikazu Seki and Tetsuji Sato, T. 2010. A training system of orientation and mobility for blind people using acoustic virtual reality. IEEE Transactions on neural systems and rehabilitation engineering. 19(1), 95104.",
      "doi": ""
    },
    {
      "text": "Alexander W. Siegel and Sheldon H. White. 1975. The development of spatial representations of large-scale environments. In Advances in Child Development and Behavior. New York: Academic Press. Vol. 10, (pp 10--55).",
      "doi": ""
    },
    {
      "text": "Mike Sinclair, Eyal Ofek, Mar Gonzalez-Franco, and Christian Holz. 2019. CapstanCrunch: A Haptic VR Controller with User-supplied Force Feedback. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). Association for Computing Machinery, New York, NY, USA, 815--829. DOI: https://doi.org/10.1145/3332165.3347891",
      "doi": "10.1145/3332165.3347891"
    },
    {
      "text": "Dimitrios Tzovaras, Georgios Nikolakis, Georgios Fergadis, Stratos Malasiotis and Modestos Stavrakis. 2004. Design and implementation of haptic virtual environments for the training of the visually impaired. In IEEE Transactions on Neural Systems and Rehabilitation Engineering. 12, 2, pp. 266--278.",
      "doi": ""
    },
    {
      "text": "David Waller, Earl Hunt and David Knapp. 1998. The transfer of spatial knowledge in virtual environment training. Presence. 7(2), 129--143.",
      "doi": "10.1162/105474698565631"
    },
    {
      "text": "Wai Yu and Stephen Brewster. 2002. Multimodal virtual reality versus printed medium in visualization for blind people. In Proceedings of the fifth international ACM conference on Assistive technologies (Assets '02). Association for Computing Machinery, New York, NY, USA, 57--64. DOI: https://doi.org/10.1145/638249.638261",
      "doi": "10.1145/638249.638261"
    },
    {
      "text": "Yuhang Zhao, Cynthia L. Bennett, Hrvoje Benko, Edward Cutrell, Christian Holz, Meredith Ringel Morris, and Mike Sinclair. 2018. Enabling People with Visual Impairments to Navigate Virtual Reality with a Haptic and Auditory Cane Simulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 116, 1-- 14. DOI: https://doi.org/10.1145/3173574.3173690",
      "doi": "10.1145/3173574.3173690"
    }
  ]
}