{
  "doi": "10.1145/3313831.3376358",
  "title": "PoCoPo: Handheld Pin-based Shape Display for Haptic Rendering in Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We introduce PoCoPo, the first handheld pin-based shape display that can render various 2.5D shapes in hand in realtime. We designed the display small enough for a user to hold it in hand and carry it around, thereby enhancing the haptic experiences in a virtual environment. PoCoPo has 18 motor-driven pins on both sides of a cuboid, providing the sensation of skin contact on the user's palm and fingers. We conducted two user studies to understand the capability of PoCoPo. The first study showed that the participants were generally successful in distinguishing the shapes rendered by PoCoPo with an average success rate of 88.5%. In the second study, we investigated the acceptable visual size of a virtual object when PoCoPo rendered a physical object of a certain size. The result led to a better understanding of the acceptable differences between the perceptions of visual size and haptic size.",
  "tags": [
    "virtual reality",
    "handheld device",
    "shape display",
    "haptic device"
  ],
  "authors": [
    {
      "name": "Shigeo Yoshida",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81555914056/rel-imgonly/osx_profile_img.jpg",
      "acmid": "81555914056",
      "orcid": "0000-0001-5381-0187"
    },
    {
      "name": "Yuqian Sun",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659323685",
      "orcid": "missing"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi and Sean Follmer. 2018. Visuo-Haptic Illusions for Improving the Perceived Performance of Shape Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 150, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173724",
      "doi": "10.1145/3173574.3173724"
    },
    {
      "text": "Jatin Arora, Aryan Saini, Nirmita Mehra, Varnit Jain, Shwetank Shrey, and Aman Parnami. 2019. VirtualBricks: Exploring a Scalable, Modular Toolkit for Enabling Physical Manipulation in VR. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 56, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300286",
      "doi": "10.1145/3290605.3300286"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1968--1979. DOI: http://dx.doi.org/10.1145/2858036.2858226",
      "doi": ""
    },
    {
      "text": "Yuki Ban, Takashi Kajinami, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Modifying an identified curved surface shape using pseudo-haptic effect. In 2012 IEEE Haptics Symposium (HAPTICS). IEEE, 211--216.",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: High-fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 717--728. DOI: http://dx.doi.org/10.1145/2984511.2984526",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Daniel K.Y. Chen, Jean-Baptiste Chossat, and Peter B. Shull. 2019. HaptiVec: Presenting Haptic Feedback Vectors in Handheld Controllers Using Embedded Tactile Pin Arrays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 171, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300401",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R. Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 119--130. DOI: http://dx.doi.org/10.1145/3126594.3126599",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, NY, NY, USA, 117--119. DOI: http://dx.doi.org/10.1145/2984751.2985725",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 654, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174228",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 417--426. DOI: http://dx.doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Eisuke Fujinawa, Shigeo Yoshida, Yuki Koyama, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2017. Computational Design of Hand-held VR Controllers Using Haptic Shape Illusion. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (VRST '17). ACM, NY, NY, USA, Article 28, 10 pages. DOI: http://dx.doi.org/10.1145/3139131.3139160",
      "doi": "10.1145/3139131.3139160"
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1991--1995. DOI: http://dx.doi.org/10.1145/2858036.2858487",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor's Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 525, 11 pages. DOI: http://dx.doi.org/10.1145/3173574.3174099",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing Reality: Enabling Opportunistic Use of Everyday Objects As Tangible Proxies in Augmented Reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1957--1967. DOI: http://dx.doi.org/10.1145/2858036.2858134",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "K. Hirota and M. Hirose. 1995. Simulation and presentation of curved surface in virtual reality environment through surface display. In Proceedings Virtual Reality Annual International Symposium '95. 211--216. DOI: http://dx.doi.org/10.1109/VRAIS.1995.512498",
      "doi": ""
    },
    {
      "text": "Da-Yuan Huang, Ruizhen Guo, Jun Gong, Jingxian Wang, John Graham, De-Nian Yang, and Xing-Dong Yang. 2017. RetroShape: Leveraging Rear-Surface Shape Displays for 2.5D Interaction on Smartwatches. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 539--551. DOI: http://dx.doi.org/10.1145/3126594.3126610",
      "doi": "10.1145/3126594.3126610"
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: adding haptic surface to graphics. In Proceedings of the 28th annual conference on Computer graphics and interactive techniques. ACM, 469--476.",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Sungjune Jang, Lawrence H. Kim, Kesler Tanner, Hiroshi Ishii, and Sean Follmer. 2016. Haptic Edge Display for Mobile Tactile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3706--3716. DOI: http://dx.doi.org/10.1145/2858036.2858264",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Seungwoo Je, Myung Jin Kim, Woojin Lee, Byungjoo Lee, Xing-Dong Yang, Pedro Lopes, and Andrea Bianchi. 2019. Aero-plane: A Handheld Force-Feedback Device That Renders Weight Motion Illusion on a Virtual 2D Plane. In Proceedings of the 32Nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, NY, NY, USA, 763--775. DOI: http://dx.doi.org/10.1145/3332165.3347926",
      "doi": "10.1145/3332165.3347926"
    },
    {
      "text": "Kenneth O Johnson and John R Phillips. 1981. Tactile spatial resolution. I. Two-point discrimination, gap detection, grating resolution, and letter recognition. Journal of neurophysiology 46, 6 (1981), 1177--1192.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Lynette A Jones. 2011. Tactile and haptic illusions. IEEE Transactions on Haptics 4, 4 (2011), 273--294.",
      "doi": "10.1109/TOH.2011.2"
    },
    {
      "text": "Jaeyeon Lee, Mike Sinclair, Mar Gonzalez-Franco, Eyal Ofek, and Christian Holz. 2019. TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 71, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300301",
      "doi": "10.1145/3290605.3300301"
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2014. Physical Telepresence: Shape Capture and Display for Embodied, Computer-mediated Remote Collaboration. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 461--470. DOI: http://dx.doi.org/10.1145/2642918.2647377",
      "doi": "10.1145/2642918.2647377"
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, Samuel Luescher, Akimitsu Hogge, Jinha Lee, and Hiroshi Ishii. 2013. Sublimate: State-changing Virtual and Physical Rendering to Augment Interaction with Shape Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1441--1450. DOI: http://dx.doi.org/10.1145/2470654.2466191",
      "doi": "10.1145/2470654.2466191"
    },
    {
      "text": "Daniel Leithinger, David Lakatos, Anthony DeVincenzi, Matthew Blackshaw, and Hiroshi Ishii. 2011. Direct and Gestural Interaction with Relief: A 2.5D Shape Display. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 541--548. DOI: http://dx.doi.org/10.1145/2047196.2047268",
      "doi": "10.1145/2047196.2047268"
    },
    {
      "text": "Yuhu Liu, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. ShapeSense: A 2D Shape Rendering VR Device with Moving Surfaces That Controls Mass Properties and Air Resistance. In ACM SIGGRAPH 2019 Emerging Technologies (SIGGRAPH '19). ACM, NY, NY, USA, Article 23, 2 pages. DOI: http://dx.doi.org/10.1145/3305367.3327991",
      "doi": "10.1145/3305367.3327991"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 11--19. DOI: http://dx.doi.org/10.1145/2807442.2807443",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding Force Feedback to Mixed Reality Experiences and Games Using Electrical Muscle Stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 446, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174020",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Ken Nakagaki, Daniel Fitzgerald, Zhiyao (John) Ma, Luke Vink, Daniel Levine, and Hiroshi Ishii. 2019. inFORCE: Bi-directional 'Force' Shape Display for Haptic Interaction. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 615--623. DOI: http://dx.doi.org/10.1145/3294109.3295621",
      "doi": "10.1145/3294109.3295621"
    },
    {
      "text": "Ken Nakagaki, Udayan Umapathi, Daniel Leithinger, and Hiroshi Ishii. 2017. AnimaStage: Hands-on Animated Craft on Pin-based Shape Displays. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 1093--1097. DOI: http://dx.doi.org/10.1145/3064663.3064670",
      "doi": "10.1145/3064663.3064670"
    },
    {
      "text": "Ken Nakagaki, Luke Vink, Jared Counts, Daniel Windham, Daniel Leithinger, Sean Follmer, and Hiroshi Ishii. 2016. Materiable: Rendering Dynamic Material Properties in Response to Direct Physical Touch with Shape Changing Interfaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2764--2772. DOI: http://dx.doi.org/10.1145/2858036.2858104",
      "doi": "10.1145/2858036.2858104"
    },
    {
      "text": "S. Nakagawara, H. Kajimoto, N. Kawakami, S. Tachi, and I. Kawabuchi. 2005. An Encounter-Type Multi-Fingered Master Hand Using Circuitous Joints. In Proceedings of the 2005 IEEE International Conference on Robotics and Automation. 2667--2672. DOI: http://dx.doi.org/10.1109/ROBOT.2005.1570516",
      "doi": ""
    },
    {
      "text": "N. Ogawa, T. Narumi, and M. Hirose. 2019. Virtual Hand Realism Affects Object Size Perception in Body-Based Scaling. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 519--528. DOI: http://dx.doi.org/10.1109/VR.2019.8798040",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: Interactive Visual and Shape Display for Calm Computing. In ACM SIGGRAPH 2004 Emerging Technologies (SIGGRAPH '04). ACM, NY, NY, USA, 17--. DOI: http://dx.doi.org/10.1145/1186155.1186173",
      "doi": "10.1145/1186155.1186173"
    },
    {
      "text": "Irvin Rock and Jack Victor. 1964. Vision and touch: An experimentally created conflict between the two senses. Science 143, 3606 (1964), 594--596.",
      "doi": ""
    },
    {
      "text": "Philipp Schoessler, Daniel Windham, Daniel Leithinger, Sean Follmer, and Hiroshi Ishii. 2015. Kinetic Blocks: Actuated Constructive Assembly for Interaction and Display. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 341--349. DOI: http://dx.doi.org/10.1145/2807442.2807453",
      "doi": "10.1145/2807442.2807453"
    },
    {
      "text": "Samuel B. Schorr and Allison M. Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3115--3119. DOI: http://dx.doi.org/10.1145/3025453.3025744",
      "doi": ""
    },
    {
      "text": "Seung-Chan Kim, Chong Hui Kim, Tae-Hon Yang, Gi-Hun Yang, Sung-Chul Kang, and Dong-Soo Kwon. 2008. SaLT: Small and lightweight tactile display using ultrasonic actuators. In RO-MAN 2008 - The 17th IEEE International Symposium on Robot and Human Interactive Communication. 430--435. DOI: http://dx.doi.org/10.1109/ROMAN.2008.4600704",
      "doi": ""
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering Based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 11, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300241",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "M. Shimojo, M. Shinohara, and Y. Fukui. 1999. Human shape recognition performance for 3D tactile display. IEEE Transactions on Systems, Man, and Cybernetics Part A: Systems and Humans 29, 6 (Nov 1999), 637--644. DOI: http://dx.doi.org/10.1109/3468.798067",
      "doi": "10.1109/3468.798067"
    },
    {
      "text": "Alexa F. Siu, Eric J. Gonzalez, Shenli Yuan, Jason B. Ginsberg, and Sean Follmer. 2018. shapeShift: 2D Spatial Manipulation and Self-Actuation of Tabletop Shape Displays for Tangible and Haptic Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 291, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173865",
      "doi": "10.1145/3173574.3173865"
    },
    {
      "text": "Evan Strasnick and Sean Follmer. 2016. Applications of Switchable Permanent Magnetic Actuators in Shape Change and Tactile Display. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, NY, NY, USA, 123--125. DOI: http://dx.doi.org/10.1145/2984751.2985728",
      "doi": "10.1145/2984751.2985728"
    },
    {
      "text": "Evan Strasnick, Christian Holz, Eyal Ofek, Mike Sinclair, and Hrvoje Benko. 2018. Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stiffness Actuation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 644, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174218",
      "doi": "10.1145/3173574.3174218"
    },
    {
      "text": "Yuqian Sun, Shigeo Yoshida, Takuji Narumi, and Michitaka Hirose. 2019. PaCaPa: A Handheld VR Device for Rendering Size, Shape, and Stiffness of Virtual Objects in Tool-based Interactions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 452, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300682",
      "doi": "10.1145/3290605.3300682"
    },
    {
      "text": "Ryo Suzuki, Junichi Yamaoka, Daniel Leithinger, Tom Yeh, Mark D. Gross, Yoshihiro Kawahara, and Yasuaki Kakehi. 2018. Dynablock: Dynamic 3D Printing for Instant and Reconstructable Shape Formation. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 99--111. DOI: http://dx.doi.org/10.1145/3242587.3242659",
      "doi": "10.1145/3242587.3242659"
    },
    {
      "text": "Shan-Yuan Teng, Tzu-Sheng Kuo, Chi Wang, Chi-huan Chiang, Da-Yuan Huang, Liwei Chan, and Bing-Yu Chen. 2018. PuPoP: Pop-up Prop on Palm for Virtual Reality. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 5--17. DOI: http://dx.doi.org/10.1145/3242587.3242628",
      "doi": "10.1145/3242587.3242628"
    },
    {
      "text": "Robert W. Van Boven and Kenneth O. Johnson. 1994. The limit of tactile spatial resolution in humans. Neurology 44, 12 (1994), 2361--2361. DOI: http://dx.doi.org/10.1212/WNL.44.12.2361",
      "doi": ""
    },
    {
      "text": "Christopher R. Wagner, Robert D. Howe, and S. J. Lederman. 2002. A Tactile Shape Display Using RC Servomotors. In Proceedings of the 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (HAPTICS '02). IEEE Computer Society, Washington, DC, USA, 354--. http://dl.acm.org/citation.cfm?id=795682.797533",
      "doi": ""
    },
    {
      "text": "Peter Walker, Brian J Francis, and Leanne Walker. 2010. The brightness-weight illusion. Experimental psychology (2010).",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfigurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 86, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173660",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "S. H. Winter and M. Bouzit. 2007. Use of Magnetorheological Fluid in a Force Feedback Glove. IEEE Transactions on Neural Systems and Rehabilitation Engineering 15, 1 (March 2007), 2--8. DOI: http://dx.doi.org/10.1109/TNSRE.2007.891401",
      "doi": ""
    },
    {
      "text": "Vibol Yem, Ryuta Okazaki, and Hiroyuki Kajimoto. 2016. FinGAR: Combination of Electrical and Mechanical Stimulation for High-fidelity Tactile Presentation. In ACM SIGGRAPH 2016 Emerging Technologies (SIGGRAPH '16). ACM, NY, NY, USA, Article 7, 2 pages. DOI: http://dx.doi.org/10.1145/2929464.2929474",
      "doi": "10.1145/2929464.2929474"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1285--1294. DOI: http://dx.doi.org/10.1109/TVCG.2017.2656978",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2019. Drag:on: A Virtual Reality Controller Providing Haptic Feedback Based on Drag and Weight Shift. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 211, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300441",
      "doi": "10.1145/3290605.3300441"
    },
    {
      "text": "K. Zhang and S. Follmer. 2018. Electrostatic adhesive brakes for high spatial resolution refreshable 2.5D tactile shape displays. In 2018 IEEE Haptics Symposium (HAPTICS). 319--326. DOI: http://dx.doi.org/10.1109/HAPTICS.2018.8357195",
      "doi": ""
    },
    {
      "text": "Yiwei Zhao, Lawrence H. Kim, Ye Wang, Mathieu Le Goc, and Sean Follmer. 2017. Robotic Assembly of Haptic Proxy Objects for Tangible Interaction and Virtual Reality. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, NY, NY, USA, 82--91. DOI: http://dx.doi.org/10.1145/3132272.3134143",
      "doi": "10.1145/3132272.3134143"
    },
    {
      "text": "Kening Zhu, Taizhou Chen, Feng Han, and Yi-Shiun Wu. 2019. HapTwist: Creating Interactive Haptic Proxies in Virtual Reality Using Low-cost Twistable Artefacts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 693, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300923",
      "doi": "10.1145/3290605.3300923"
    }
  ]
}