{
  "doi": "10.1145/3313831.3376199",
  "title": "Watch+Strap: Extending Smartwatches with Interactive StrapDisplays",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "While smartwatches are widely adopted these days, their input and output space remains fairly limited by their screen size. We present StrapDisplays-interactive watchbands with embedded display and touch technologies-that enhance commodity watches and extend their input and output capabilities. After introducing the physical design space of these StrapDisplays, we explore how to combine a smartwatch and straps in a synergistic Watch+Strap system. Specifically, we propose multiple interface concepts that consider promising content distributions, interaction techniques, usage types, and display roles. For example, the straps can enrich watch apps, display visualizations, provide glanceable feedback, or help avoiding occlusion issues. Further, we provide a modular research platform incorporating three StrapDisplay prototypes and a flexible web-based software architecture, demonstrating the feasibility of our approach. Early brainstorming sessions with 15 participants informed our design process, while later interviews with six experts supported our concepts and provided valuable feedback for future developments.",
  "tags": [
    "mobile visualization",
    "interactive watchband",
    "mde",
    "flexible displays",
    "smartwatch",
    "wearable device",
    "mobile interaction"
  ],
  "authors": [
    {
      "name": "Konstantin Klamka",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81558540356/rel-imgonly/konstantin-klamka-768x512-2.jpg",
      "acmid": "81558540356",
      "orcid": "missing"
    },
    {
      "name": "Tom Horak",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-99658655442/rel-imgonly/tom_horak-square.jpg",
      "acmid": "99658655442",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Adafruit Industries, LLC. 2014. Adafruit Pro Trinket 5V 16MHz ID: 2000. (2014). https://www.adafruit.com/product/2000 (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Youngseok Ahn, Sungjae Hwang, HyunGook Yoon, Junghyeon Gim, and Jung hee Ryu. 2015. BandSense: Pressure-sensitive Multi-touch Interaction on a Wristband. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 251--254. DOI: http://dx.doi.org/10.1145/2702613.2725441",
      "doi": "10.1145/2702613.2725441"
    },
    {
      "text": "Fereshteh Amini, Khalad Hasan, Andrea Bunt, and Pourang Irani. 2017. Data Representations for In-situ Exploration of Health and Fitness Data. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, NY, NY, USA, 163--172. DOI: http://dx.doi.org/10.1145/3154862.3154879",
      "doi": "10.1145/3154862.3154879"
    },
    {
      "text": "Patrick Baudisch and Gerry Chu. 2009. Back-of-device interaction allows creating very small touch devices. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 1923--1932. DOI: http://dx.doi.org/10.1145/1518701.1518995",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus Plus Context Screens: Combining Display Technology with Visualization Techniques. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 31--40. DOI: http://dx.doi.org/10.1145/502348.502354",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Benjamin B. Bederson. 2000. Fisheye menus. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 217--225. DOI: http://dx.doi.org/10.1145/354401.354782",
      "doi": "10.1145/354401.354782"
    },
    {
      "text": "Tanja Blascheck, Lonni Besancon, Anastasia Bezerianos, Bongshin Lee, and Petra Isenberg. 2019. Glanceable Visualization: Studies of Data Comparison Performance on Smartwatches. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 630--640. DOI: http://dx.doi.org/10.1109/tvcg.2018.2865142",
      "doi": "10.1109/TVCG.2018.2865142"
    },
    {
      "text": "Florian Block, Hans Gellersen, and Nicolas Villar. 2010. Touch-display keyboards: Transforming Keyboards into Interactive Surfaces. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 1145--1154. DOI: http://dx.doi.org/10.1145/1753326.1753498",
      "doi": "10.1145/1753326.1753498"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301--2309. DOI: http://dx.doi.org/10.1109/TVCG.2011.185",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Matthew Brehmer, Bongshin Lee, Petra Isenberg, and Eun Kyoung Choe. 2019. Visualizing Ranges over Time on Mobile Phones: A Task-Based Crowdsourced Evaluation. IEEE Transactions on Visualization and Computer Graphics 25 (Jan. 2019), 619--629. Issue 1. DOI: http://dx.doi.org/10.1109/tvcg.2018.2865234",
      "doi": "10.1109/TVCG.2018.2865234"
    },
    {
      "text": "Barry Brown, Alex S. Taylor, Shahram Izadi, Abigail Sellen, Joseph Jofish' Kaye, and Rachel Eardley. 2007. Locating Family Values: A Field Trial of the Whereabouts Clock. In UbiComp 2007: Ubiquitous Computing. Springer Berlin Heidelberg, Berlin, Heidelberg, 354--371. DOI: http://dx.doi.org/10.1007/978--3--540--74853--3_21",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "Jesse Burstyn, Paul Strohmeier, and Roel Vertegaal. 2015. DisplaySkin: Exploring Pose-Aware Displays on a Flexible Electrophoretic Wristband. In Proceedings of the ACM Conference on Tangible, Embedded, and Embodied Interaction. ACM, NY, NY, USA, 165--172. DOI: http://dx.doi.org/10.1145/2677199.2680596",
      "doi": "10.1145/2677199.2680596"
    },
    {
      "text": "Steven P Cardinali, Katherine E Tong, Trevor J Ness, and William C Lukens. 2019. Indicators for Wearable Electronic Devices. (2019). https://patents.google.com/patent/US20190086875A1 US Patent App. 16/151,199.",
      "doi": ""
    },
    {
      "text": "Xiang Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 159--168. DOI: http://dx.doi.org/10.1145/2556288.2556955",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Yang Chen. 2017. Visualizing Large Time-series Data on Very Small Screens. In Short Paper Proceedings of the IEEE VGTC/Eurographics Conference on Visualization. Eurographics Association, Aire-la-Ville, Switzerland, 37--41. DOI: http://dx.doi.org/10.2312/eurovisshort.20171130",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Raimund Dachselt, Petra Isenberg, and Bongshin Lee. 2019. Mobile Data Visualization (Dagstuhl Seminar 19292). Dagstuhl Reports 9, 7 (2019), 78--93. DOI: http://dx.doi.org/10.4230/DAGREP.9.7.78",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Ryan Libby, Ian Smith, James A. Landay, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, and Louis LeGrand. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 1797--1806. DOI: http://dx.doi.org/10.1145/1357054.1357335",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Espressif Systems Co., Ltd. 2016. ESP8266 Overview | Espressif Systems. (2016). https://www.espressif.com/ en/products/hardware/esp8266ex/overview (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Augusto Esteves, Eduardo Velloso, Andreas Bulling, and Hans Gellersen. 2015. Orbits: Gaze Interaction for Smart Watches Using Smooth Pursuit Eye Movements. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 457--466. DOI: http://dx.doi.org/10.1145/2807442.2807499",
      "doi": "10.1145/2807442.2807499"
    },
    {
      "text": "Alexandra Fuchs, Miriam Sturdee, and Johannes Schöning. 2018. Foldwatch: Using Origami-inspired Paper Prototypes to Explore the Extension of Output Space in Smartwatches. In Proceedings of the ACM Nordic Conference on Human-Computer Interaction. ACM, NY, NY, USA, 47--59. DOI: http://dx.doi.org/10.1145/3240167.3240173",
      "doi": "10.1145/3240167.3240173"
    },
    {
      "text": "Markus Funk, Alireza Sahami, Niels Henze, and Albrecht Schmidt. 2014. Using a touch-sensitive wristband for text entry on smart watches. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 2305--2310. DOI: http://dx.doi.org/10.1145/2559206.2581143",
      "doi": "10.1145/2559206.2581143"
    },
    {
      "text": "G. W. Furnas. 1986. Generalized Fisheye Views. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 16--23. DOI: http://dx.doi.org/10.1145/22339.22342",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Glance Team. 2014. Kickstarter Campagain: Glance: World's first smart accessory for your watch. (2014). https://www.kickstarter.com/projects/1742184757/ glance-worlds-first-smart-accessory-for-your-watch (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Antonio Gomes, Tristan Trutna, and Roel Vertegaal. 2015. DisplayCover: A Tablet Keyboard with an Embedded Thin-Film Touchscreen Display. In Proceedings of the ACM Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, NY, NY, USA, 531--535. DOI: http://dx.doi.org/10.1145/2785830.2785843",
      "doi": "10.1145/2785830.2785843"
    },
    {
      "text": "Jun Gong, Zheer Xu, Qifan Guo, Teddy Seyed, Xiang 'Anthony' Chen, Xiaojun Bi, and Xing-Dong Yang. 2018a. WrisText: One-handed Text Entry on Smartwatch Using Wrist Gestures. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 181:1--181:14. DOI: http://dx.doi.org/10.1145/3173574.3173755",
      "doi": "10.1145/3173574.3173755"
    },
    {
      "text": "Jun Gong, Xin Yang, Teddy Seyed, Josh Urban Davis, and Xing-Dong Yang. 2018b. Indutivo: Contact-Based, Object-Driven Interactions with Inductive Sensing. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 321--333. DOI: http://dx.doi.org/10.1145/3242587.3242662",
      "doi": "10.1145/3242587.3242662"
    },
    {
      "text": "Good Display Co., Ltd. 2007. E-ink Display | China e-paper Display module manufacturer - Good Display. (2007). http://www.e-paper-display.com/ (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Fábio Pereira, Evangelos Karapanos, Sean A. Munson, and Marc Hassenzahl. 2016. Exploring the design space of glanceable feedback for physical activity trackers. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, NY, NY, USA, 144--155. DOI: http://dx.doi.org/10.1145/2971648.2971754",
      "doi": "10.1145/2971648.2971754"
    },
    {
      "text": "Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 3933--3942. DOI: http://dx.doi.org/10.1145/2702123.2702331",
      "doi": "10.1145/2702123.2702331"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 441--450. DOI: http://dx.doi.org/10.1145/2047196.2047255",
      "doi": ""
    },
    {
      "text": "Florian Heller and Kris Luyten. 2019. TaskHerder: A Wearable Minimal Interaction Interface for Mobile and Long-lived Task Execution. In Proceedings of the ACM SIGCHI Symposium on Engineering Interactive Computing Systems. ACM, NY, NY, USA, 4:1--4:5. DOI: http://dx.doi.org/10.1145/3319499.3328226",
      "doi": ""
    },
    {
      "text": "David Holman, Jesse Burstyn, Ryan Brotman, Audrey Younkin, and Roel Vertegaal. 2013. Flexkit: A Rapid Prototyping Platform for Flexible Displays. In ACM Symposium on User Interface Software and Technology Adjunct Proceedings. ACM, NY, NY, USA, 17--18. DOI: http://dx.doi.org/10.1145/2508468.2514934",
      "doi": "10.1145/2508468.2514934"
    },
    {
      "text": "Tom Horak, Sriram Karthik Badam, Niklas Elmqvist, and Raimund Dachselt. 2018. When David Meets Goliath: Combining Smartwatches with a Large Vertical Display for Visual Data Exploration. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 19:1--19:13. DOI: http://dx.doi.org/10.1145/3173574.3173593",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Erik Frøkjær. 2001. Reading of Electronic Documents: The Usability of Linear, Fisheye, and Overview+Detail Interfaces. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 293--300. DOI: http://dx.doi.org/10.1145/365024.365118",
      "doi": "10.1145/365024.365118"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WATCHCONNECT: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 1247--1256. DOI: http://dx.doi.org/10.1145/2702123.2702215",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Walther Jensen, Ashley Colley, Jonna Häkkilä, Carlos Pinheiro, and Markus Löchtefeld. 2019. TransPrint: A Method for Fabricating Flexible Transparent Free-Form Displays. Advances in Human-Computer Interaction 2019, 1 (May 2019), 1--14. DOI: http://dx.doi.org/10.1155/2019/1340182",
      "doi": "10.1155/2019/1340182"
    },
    {
      "text": "Kairos Team. 2014. Indiegogo Campagain: Kairos T-Band. (2014). https://igg.me/at/kairostband/x#/ (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Joseph 'Jofish' Kaye, Mariah K. Levitt, Jeffrey Nevins, Jessica Golden, and Vanessa Schmidt. 2005. Communicating intimacy one bit at a time. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 1529--1532. DOI: http://dx.doi.org/10.1145/1056808.1056958",
      "doi": ""
    },
    {
      "text": "Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture based Wrist Interface. In Proceedings of the IEEE Symposium on Wearable Computers. IEEE, Piscataway, NJ, USA, 15--22. DOI: http://dx.doi.org/10.1109/iswc.2007.4373770",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2017. IllumiPaper: Illuminated Interactive Paper. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 5605--5618. DOI: http://dx.doi.org/10.1145/3025453.3025525",
      "doi": "10.1145/3025453.3025525"
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2018. Pushables: A DIY Approach for Fabricating Customizable and Self-Contained Tactile Membrane Dome Switches. In ACM Symposium on User Interface Software and Technology Adjunct Proceedings. ACM, NY, NY, USA, 1--4. DOI: http://dx.doi.org/10.1145/3266037.3266082",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin Buttons: Cheap, Small, Low-powered and Clickable Fixed-icon Laser Projectors. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 389--394. DOI: http://dx.doi.org/10.1145/2642918.2647356",
      "doi": "10.1145/2642918.2647356"
    },
    {
      "text": "L!ber8 Technology. 2018. TAGO ARC. (2018). https://liber8tech.com (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Bongshin Lee, Matthew Brehmer, Petra Isenberg, Eun Kyoung Choe, Ricardo Langner, and Raimund Dachselt. 2018. Data Visualization on Mobile Devices. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, W07:1--W07:8. DOI: http://dx.doi.org/10.1145/3170427.3170631",
      "doi": "10.1145/3170427.3170631"
    },
    {
      "text": "Kent Lyons, David Nguyen, Daniel Ashbrook, and Sean White. 2012. Facet: A Multi-segment Wrist Worn System. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 123--130. DOI: http://dx.doi.org/10.1145/2380116.2380134",
      "doi": "10.1145/2380116.2380134"
    },
    {
      "text": "Jess McIntosh, Paul Strohmeier, Jarrod Knibbe, Sebastian Boring, and Kasper Hornbæk. 2019. Magnetips: Combining Fingertip Tracking and Haptic Feedback for Around-Device Interaction. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 408:1--408:12. DOI: http://dx.doi.org/10.1145/3290605.3300638",
      "doi": ""
    },
    {
      "text": "Momentum Labs LLC. 2014. Kickstarter Campagain: Moment Smartwatch: world's first wrap around smart watch. (2014). http://kck.st/VebX7r (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Ian Oakley and Doyoung Lee. 2014. Interaction on the Edge: Offset Sensing for Small Devices. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 169--178. DOI: http://dx.doi.org/10.1145/2556288.2557138",
      "doi": "10.1145/2556288.2557138"
    },
    {
      "text": "Masa Ogata, Ryosuke Totsuka, and Michita Imai. 2015. SkinWatch: Adapting Skin As a Gesture Surface. In SIGGRAPH Asia 2015 Emerging Technologies. ACM, NY, NY, USA, 22:1--22:2. DOI: http://dx.doi.org/10.1145/2818466.2818496",
      "doi": ""
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, NY, NY, USA, 281--290. DOI: http://dx.doi.org/10.1145/2642918.2647413",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Simon Olberding, Kian Peen Yeo, Suranga Nanayakkara, and Jurgen Steimle. 2013. AugmentedForearm: Exploring the Design Space of a Display-enhanced Forearm. In Proceedings of the 4th Augmented Human International Conference on - AH '13. ACM, NY, NY, USA, 9--12. DOI: http://dx.doi.org/10.1145/2459236.2459239",
      "doi": "10.1145/2459236.2459239"
    },
    {
      "text": "Alex Olwal. 2018. Hybrid Watch User Interfaces: Collaboration Between Electro-Mechanical Components and Analog Materials. In ACM Symposium on User Interface Software and Technology Adjunct Proceedings. ACM, NY, NY, USA, 200--202. DOI: http://dx.doi.org/10.1145/3266037.3271650",
      "doi": ""
    },
    {
      "text": "Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 1451--1460. DOI: http://dx.doi.org/10.1145/2470654.2466192",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in Vivo. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 5456--5469. DOI: http://dx.doi.org/10.1145/2858036.2858522",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Raf Ramakers, Johannes Schuning, and Kris Luyten. 2014. Paddle: Highly Deformable Mobile Devices with Physical Controls. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 2569--2578. DOI: http://dx.doi.org/10.1145/2556288.2557340",
      "doi": ""
    },
    {
      "text": "Ramana Rao and Stuart K. Card. 1994. The Table Lens: Merging Graphical and Symbolic Representations in an Interactive Focus + Context Visualization for Tabular Information. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 318--322. DOI: http://dx.doi.org/10.1145/191666.191776",
      "doi": ""
    },
    {
      "text": "Samsung Electronics. 2015. Samsung Gear S2. (2015). https://www.samsung.com/global/galaxy/gear-s2/ (last visit: Dec 19, 2019).",
      "doi": ""
    },
    {
      "text": "Samsung Electronics. 2016. Samsung Gear S3. (2016). https://www.samsung.com/global/galaxy/gear-s3/ (last visit: Dec 19, 2019).",
      "doi": ""
    },
    {
      "text": "Léa Saviot, Frederik Brudy, and Steven Houben. 2017. WRISTBAND.IO: Expanding Input and Output Spaces of a Smartwatch. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 2025--2033. DOI: http://dx.doi.org/10.1145/3027063.3053132",
      "doi": "10.1145/3027063.3053132"
    },
    {
      "text": "Stefan Schneegass, Sophie Ogando, and Florian Alt. 2016. Using on-body displays for extending the output of wearable devices. In Proceedings of the ACM International Symposium on Pervasive Displays. ACM, NY, NY, USA, 67--74. DOI: http://dx.doi.org/10.1145/2914920.2915021",
      "doi": "10.1145/2914920.2915021"
    },
    {
      "text": "Michail Schwab. 2019. Scalable Scalable Vector Graphics. (2019). DOI: http://dx.doi.org/10.17605/OSF.IO/GE8WP",
      "doi": ""
    },
    {
      "text": "Abigail Sellen, Rachel Eardley, Shahram Izadi, and Richard Harper. 2006. The Whereabouts Clock: Early Testing of a Situated Awareness Device. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 1307--1312. DOI: http://dx.doi.org/10.1145/1125451.1125694",
      "doi": "10.1145/1125451.1125694"
    },
    {
      "text": "Teddy Seyed, Xing-Dong Yang, and Daniel Vogel. 2016. Doppio: A Reconfigurable Dual-Face Smartwatch for Tangible Interaction. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 4675--4686. DOI: http://dx.doi.org/10.1145/2858036.2858256",
      "doi": "10.1145/2858036.2858256"
    },
    {
      "text": "Sony. 2018. Sony FES Watch U e-paper fashion watch. (2018). https://www.sony.co.uk/electronics/ fes-watch-u-collection/fes-wa1 (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Spectra Symbol Corp. 2019. ThinPot - Spectra Symbol Innovation-Driven. (2019). https://www.spectrasymbol.com/product/thinpot/ (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Srinath Sridhar, Anders Markussen, Antti Oulasvirta, Christian Theobalt, and Sebastian Boring. 2017. WatchSense: On- and Above-Skin Input Sensing through a Wearable Depth Sensor. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 3891--3902. DOI: http://dx.doi.org/10.1145/3025453.3026005",
      "doi": "10.1145/3025453.3026005"
    },
    {
      "text": "Paul Strohmeier, Jesse Burstyn, and Roel Vertegaal. 2015. Effects of Display Sizes on a Scrolling Task using a Cylindrical Smartwatch. In Proceedings of the ACM Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, NY, NY, USA, 846--853. DOI: http://dx.doi.org/10.1145/2786567.2793710",
      "doi": "10.1145/2786567.2793710"
    },
    {
      "text": "Ke Sun, Yuntao Wang, Chun Yu, Yukang Yan, Hongyi Wen, and Yuanchun Shi. 2017. Float: One-Handed and Touch-Free Target Selection on Smartwatches. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 692--704. DOI: http://dx.doi.org/10.1145/3025453.3026027",
      "doi": "10.1145/3025453.3026027"
    },
    {
      "text": "Texas Instruments Inc. 2010. ADS1115 16-Bit 860SPS 4-Ch Delta-Sigma ADC With PGA, Oscillator, Vref, Comparator, and I2C. (2010). http://www.ti.com/product/ADS1115 (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Christian Tominski, Stefan Gladisch, Ulrike Kister, Raimund Dachselt, and Heidrun Schumann. 2016. Interactive Lenses for Visualization: An Extended Survey. Computer Graphics Forum 36, 6 (May 2016), 173--200. DOI: http://dx.doi.org/10.1111/cgf.12871",
      "doi": ""
    },
    {
      "text": "Edward R. Tufte. 2006. Beautiful Evidence. Graphics Press, Cheshire, MA, USA.",
      "doi": "10.5555/1198006"
    },
    {
      "text": "Anita Vogl, Patrick Parzer, Teo Babic, Joanne Leong, Alex Olwal, and Michael Haller. 2017. StretchEBand: Enabling Fabric-based Interactions Through Rapid Fabrication of Textile Stretch Sensors. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 2617--2627. DOI: http://dx.doi.org/10.1145/3025453.3025938",
      "doi": "10.1145/3025453.3025938"
    },
    {
      "text": "Ulrich von Zadow, Wolfgang Büschel, Ricardo Langner, and Raimund Dachselt. 2014. SleeD: Using a Sleeve Display to Interact with Touch-sensitive Display Walls. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, NY, NY, USA, 129--138. DOI: http://dx.doi.org/10.1145/2669485.2669507",
      "doi": "10.1145/2669485.2669507"
    },
    {
      "text": "Waveshare Electronics. 2019. Waveshare Electronics. (2019). https://www.waveshare.com/ (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Dirk Wenig, Florian Heller, and Johannes Schöning. 2016. StrapMaps: Bringing Map-based Navigation to the Straps of Bags. In Proceedings of the ACM Conference on Pervasive and Ubiquitous Computing. ACM, NY, NY, USA, 225--228. DOI: http://dx.doi.org/10.1145/2968219.2993411",
      "doi": "10.1145/2968219.2993411"
    },
    {
      "text": "Dirk Wenig, Johannes Schöning, Brent Hecht, and Rainer Malaka. 2015. StripeMaps: Improving Map-based Pedestrian Navigation for Smartwatches. In Proceedings of the ACM Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, NY, NY, USA, 52--62. DOI: http://dx.doi.org/10.1145/2785830.2785862",
      "doi": "10.1145/2785830.2785862"
    },
    {
      "text": "Dirk Wenig, Johannes Schöning, Alex Olwal, Mathias Oben, and Rainer Malaka. 2017. WatchThru: Expanding Smartwatch Displays with Mid-air Visuals and Wrist-worn Augmented Reality. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 716--721. DOI: http://dx.doi.org/10.1145/3025453.3025852",
      "doi": "10.1145/3025453.3025852"
    },
    {
      "text": "Gerard Wilkinson, Ahmed Kharrufa, Jonathan Hook, Bradley Pursglove, Gavin Wood, Hendrik Haeuser, Nils Y. Hammerla, Steve Hodges, and Patrick Olivier. 2016. Expressy: Using a Wrist-worn Inertial Measurement Unit to Add Expressiveness to Touch-based Interactions. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 2832--2844. DOI: http://dx.doi.org/10.1145/2858036.2858223",
      "doi": "10.1145/2858036.2858223"
    },
    {
      "text": "WiseChip Semiconductor Inc. 2019. Professional PMOLED Display Manufacturer - WiseChip Semiconductor Inc. (2019). http://www.wisechip.com.tw/ (last visit: Dec 12, 2019).",
      "doi": ""
    },
    {
      "text": "Robert Xiao, Teng Cao, Ning Guo, Jun Zhuo, Yang Zhang, and Chris Harrison. 2018. LumiWatch: On-Arm Projected Graphics and Touch Input. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 95:1--95:11. DOI: http://dx.doi.org/10.1145/3173574.3173669",
      "doi": "10.1145/3173574.3173669"
    },
    {
      "text": "Cheng Xu and Kent Lyons. 2015. Shimmering Smartwatches: Exploring the Smartwatch Design Space. In Proceedings of the ACM Conference on Tangible, Embedded, and Embodied Interaction. ACM, NY, NY, USA, 69--76. DOI: http://dx.doi.org/10.1145/2677199.2680599",
      "doi": "10.1145/2677199.2680599"
    },
    {
      "text": "Xin Yi, Chun Yu, Weijie Xu, Xiaojun Bi, and Yuanchun Shi. 2017. COMPASS: Rotational Keyboard on Non-Touch Smartwatches. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 705--715. DOI: http://dx.doi.org/10.1145/3025453.3025454",
      "doi": "10.1145/3025453.3025454"
    },
    {
      "text": "Cheng Zhang, AbdelKareem Bedri, Gabriel Reyes, Bailey Bercik, Omer T. Inan, Thad E. Starner, and Gregory D. Abowd. 2016. TapSkin: Recognizing On-Skin Input for Smartwatches. In Proceedings of the ACM Conference on Interactive Surfaces and Spaces. ACM, NY, NY, USA, 13--22. DOI: http://dx.doi.org/10.1145/2992154.2992187",
      "doi": ""
    },
    {
      "text": "Kening Zhu, Morten Fjeld, and Ayça Ünlüer. 2018. WristOrigami: Exploring Foldable Design for Multi-Display Smartwatch. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 DIS '18. ACM, NY, NY, USA, 1207--1218. DOI: http://dx.doi.org/10.1145/3196709.3196713",
      "doi": "10.1145/3196709.3196713"
    }
  ]
}