{
  "doi": "10.1145/3313831.3376491",
  "title": "Touch me Gently: Recreating the Perception of Touch using a Shape-Memory Alloy Matrix",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We present a wearable forearm augmentation that enables the recreation of natural touch sensation by applying shear-forces onto the skin. In contrast to previous approaches, we arrange light-weight and stretchable 3x3cm plasters in a matrix onto the skin. Individual plasters were embedded with lines of shape-memory alloy (SMA) wires to generate shear-forces. Our design is informed by a series of studies investigating the perceptibility of different sizes, spacings, and attachments of plasters on the forearm. Our matrix arrangement enables the perception of touches, for instance, feeling ones wrist being grabbed or the arm being stroked. Users rated the recreated touch sensations as being fairly similar to a real touch (4.1/5). Even without a visual representation, users were able to correctly distinguish them with an overall accuracy of 94.75%. Finally, we explored two use cases showing how AR and VR could be empowered with experiencing recreated touch sensations on the forearm.",
  "authors": [
    {
      "name": "Sachith Muthukumarana",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-99659133087/rel-imgonly/sachithpp3_-_copy.jpg",
      "acmid": "99659133087",
      "orcid": "missing"
    },
    {
      "name": "Don Samitha Elvitigala",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-99659118088/rel-imgonly/1004585_677003825650293_574565969_n.jpg",
      "acmid": "99659118088",
      "orcid": "missing"
    },
    {
      "name": "Juan Pablo Forero Cortes",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474996",
      "orcid": "missing"
    },
    {
      "name": "Denys J.C. Matthies",
      "institution": "The University of Auckland & Technical University of Applied Sciences Lübeck, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81548327356/rel-imgonly/citations.jpg",
      "acmid": "81548327356",
      "orcid": "missing"
    },
    {
      "name": "Suranga Nanayakkara",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81416609140/rel-imgonly/_mg_5811-uoa.jpg",
      "acmid": "81416609140",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christian Antfolk, Christian Balkenius, Göran Lundborg, Birgitta Rosén, and Fredrik Sebelius. 2010. Design and technical construction of a tactile display for sensory feedback in a hand prosthesis system. Biomedical engineering online 9, 1 (2010), 50.",
      "doi": ""
    },
    {
      "text": "Karlin Bark, Jason Wheeler, Pete Shull, Joan Savall, and Mark Cutkosky. 2010. Rotational skin stretch feedback: A wearable haptic display for motion. IEEE Transactions on Haptics 3, 3 (2010), 166--176.",
      "doi": "10.1109/TOH.2010.21"
    },
    {
      "text": "Cagatay Basdogan, Mert Sedef, Matthias Harders, and Stefan Wesarg. 2007. VR-based simulators for training in minimally invasive surgery. IEEE Computer Graphics and Applications 27, 2 (2007), 54--66.",
      "doi": "10.1109/MCG.2007.51"
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: electrovibration for touch surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 283--292.",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Matthew A Baumann, Karon E MacLean, Thomas W Hazelton, and Ashley McKay. 2010. Emulating human attention-getting practices with wearable haptics. In 2010 IEEE Haptics Symposium. IEEE, 149--156.",
      "doi": "10.1109/HAPTIC.2010.5444662"
    },
    {
      "text": "bhaptics. 2019. Ready to feel the future. (2019). Retrieved April 2, 2019 from https://teslasuit.io/.",
      "doi": ""
    },
    {
      "text": "Jonathan Blake and Hakan B Gurocak. 2009. Haptic glove with MR brakes for virtual reality. IEEE/ASME Transactions On Mechatronics 14, 5 (2009), 606--615.",
      "doi": ""
    },
    {
      "text": "Pinar Boyraz, Gundula Runge, and Annika Raatz. 2018. An Overview of Novel Actuators for Soft Robotics. In Actuators, Vol. 7. Multidisciplinary Digital Publishing Institute, 48.",
      "doi": ""
    },
    {
      "text": "Chia-Yu Chen, Yen-Yu Chen, Yi-Ju Chung, and Neng-Hao Yu. 2016. Motion guidance sleeve: Guiding the forearm rotation through external artificial muscles. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3272--3276.",
      "doi": "10.1145/2858036.2858275"
    },
    {
      "text": "George Chernyshov, Benjamin Tag, Cedric Caremel, Feier Cao, Gemma Liu, and Kai Kunze. 2018. Shape Memory Alloy Wire Actuators for Soft, Wearable Haptic Devices. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (ISWC '18). ACM, NY, NY, USA, 112--119. DOI: http://dx.doi.org/10.1145/3267242.3267257",
      "doi": "10.1145/3267242.3267257"
    },
    {
      "text": "Francesco Chinello, Mirko Aurilio, Claudio Pacchierotti, and Domenico Prattichizzo. 2014. The HapBand: A cutaneous device for remote tactile interaction. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 284--291.",
      "doi": ""
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, NY, NY, USA, 117--119. DOI: http://dx.doi.org/10.1145/2984751.2985725",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Heather Culbertson, Cara M Nunez, Ali Israr, Frances Lau, Freddy Abnousi, and Allison M Okamura. 2018. A social haptic device to create continuous lateral motion using sequential normal indentation. In 2018 IEEE Haptics Symposium (HAPTICS). IEEE, 32--39.",
      "doi": ""
    },
    {
      "text": "Nathan Dunkelberger, Jenny Sullivan, Joshua Bradley, Nickolas P Walling, Indu Manickam, Gautam Dasarathy, Ali Israr, Frances WY Lau, Keith Klumb, Brian Knott, and others. 2018. Conveying language through haptics: a multi-sensory approach. In Proceedings of the 2018 ACM International Symposium on Wearable Computers. ACM, 25--32.",
      "doi": "10.1145/3267242.3267244"
    },
    {
      "text": "Yurika Ebe and Hiroyuki Umemuro. 2015. Emotion Evoked by Texture and Application to Emotional Communication. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1995--2000.",
      "doi": "10.1145/2702613.2732768"
    },
    {
      "text": "Abdulmotaleb El Saddik, Mauricio Orozco, Mohamad Eid, and Jongeun Cha. 2011. Haptics technologies: Bringing touch to multimedia. Springer Science & Business Media.",
      "doi": "10.5555/2095937"
    },
    {
      "text": "Don Samitha Elvitigala, Denys JC Matthies, Vipula Dissanayaka, Chamod Weerasinghe, and Suranga Nanayakkara. 2019. 2bit-TactileHand: Evaluating Tactons for On-Body Vibrotactile Displays on the Hand and Wrist. In Proceedings of the 10th Augmented Human International Conference 2019. ACM, 3.",
      "doi": "10.1145/3311823.3311832"
    },
    {
      "text": "Frank A Geldard and Carl E Sherrick. 1972. The cutaneous\" rabbit\": A perceptual illusion. Science 178, 4057 (1972), 178--179.",
      "doi": ""
    },
    {
      "text": "Brian T Gleeson, Scott K Horschel, and William R Provancher. 2010. Design of a fingertip-mounted tactile display with tangential skin displacement feedback. IEEE Transactions on Haptics 3, 4 (2010), 297--301.",
      "doi": "10.1109/TOH.2010.8"
    },
    {
      "text": "Rachael Granberry, Kevin Eschen, Brad Holschuh, and Julianna Abel. 2019. Functionally Graded Knitted Actuators with NiTi-Based Shape Memory Alloys for Topographically Self-Fitting Wearables. Advanced Materials Technologies (2019).",
      "doi": ""
    },
    {
      "text": "Oliver Grau. 2003. Virtual Art: from illusion to immersion. MIT press.",
      "doi": "10.5555/640594"
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations Using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 109--117. DOI: http://dx.doi.org/10.1145/3126594.3126598",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019), 488. DOI: http://dx.doi.org/10.1145/3290605.3300718",
      "doi": ""
    },
    {
      "text": "HaptX. 2018. HaptX Gloves Development kit. (2018). Retrieved April 2, 2019 from https://haptx.com/.",
      "doi": ""
    },
    {
      "text": "Matthew J Hertenstein, Dacher Keltner, Betsy App, Brittany A Bulleit, and Ariane R Jaskolka. 2006. Touch communicates distinct emotions. Emotion 6, 3 (2006), 528.",
      "doi": ""
    },
    {
      "text": "Ronan Hinchet, Velko Vechev, Herbert Shea, and Otmar Hilliges. 2018. DextrES: Wearable Haptic Feedback for Grasping in VR via a Thin Form-Factor Electrostatic Brake. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 901--912.",
      "doi": "10.1145/3242587.3242657"
    },
    {
      "text": "Toshiyuki Hino and Takashi Maeno. 2004. Development of a miniature robot finger with a variable stiffness mechanism using shape memory alloy. In International Symposium on Robotics and Automation, Querétaro, México, Aug. 25--27.",
      "doi": ""
    },
    {
      "text": "Aaron M Hoover, Erik Steltz, and Ronald S Fearing. 2008. RoACH: An autonomous 2.4 g crawling hexapod robot. In 2008 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 26--33.",
      "doi": ""
    },
    {
      "text": "Gijs Huisman, Aduen Darriba Frederiks, Betsy Van Dijk, Dirk Hevlen, and Ben Kröse. 2013. The TaSST: Tactile sleeve for social touch. In 2013 World Haptics Conference (WHC). IEEE, 211--216.",
      "doi": ""
    },
    {
      "text": "Filip Ilievski, Aaron D Mazzeo, Robert F Shepherd, Xin Chen, and George M Whitesides. 2011. Soft robotics for chemists. Angewandte Chemie 123, 8 (2011), 1930--1935.",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Edward Jay Wang, and Patrick Baudisch. 2015. Skin Drag Displays: Dragging a Physical Tactor Across the User's Skin Produces a Stronger Tactile Stimulus Than Vibrotactile. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2501--2504. DOI: http://dx.doi.org/10.1145/2702123.2702459",
      "doi": "10.1145/2702123.2702459"
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011. Tactile brush: drawing on skin with a tactile grid display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2019--2028.",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Seungwoo Je, Brendan Rooney, Liwei Chan, and Andrea Bianchi. 2017. tactoRing: A Skin-Drag Discrete Display. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3106--3114. DOI: http://dx.doi.org/10.1145/3025453.3025703",
      "doi": "10.1145/3025453.3025703"
    },
    {
      "text": "Yvonne Jung, Ruth Recker, Manuel Olbrich, and Ulrich Bockholt. 2008. Using X3D for medical training simulations. In Proceedings of the 13th international symposium on 3D web technology. ACM, 43--51.",
      "doi": "10.1145/1394209.1394221"
    },
    {
      "text": "Maria Karam, Carmen Branje, Gabe Nespoli, Norma Thompson, Frank A. Russo, and Deborah I. Fels. 2010. The Emoti-chair: An Interactive Tactile Music Exhibit. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 3069--3074. DOI: http://dx.doi.org/10.1145/1753846.1753919",
      "doi": "10.1145/1753846.1753919"
    },
    {
      "text": "Thorsten A Kern. 2009. Engineering haptic devices: a beginner's guide for engineers. Springer Publishing Company, Incorporated.",
      "doi": "10.5555/1695792"
    },
    {
      "text": "Mohammad Mahdi Kheirikhah, Samaneh Rabiee, and Mohammad Ehsan Edalat. 2010. A review of shape memory alloy actuators in robotics. In Robot Soccer World Cup. Springer, 206--217.",
      "doi": ""
    },
    {
      "text": "Ryo Kikuuwe and Tsuneo Yoshikawa. 2001. Haptic display device with fingertip presser for motion/force teaching to human. In Proceedings 2001 ICRA. IEEE International Conference on Robotics and Automation (Cat. No. 01CH37164), Vol. 1. IEEE, 868--873.",
      "doi": ""
    },
    {
      "text": "Jacob H Kirman. 1974. Tactile perception of computer-derived formant patterns from voiced speech. The Journal of the Acoustical Society of America 55, 1 (1974), 163--169.",
      "doi": ""
    },
    {
      "text": "Espen Knoop and Jonathan Rossiter. 2015. The tickler: a compliant wearable tactile display for stroking and tickling. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1133--1138.",
      "doi": "10.1145/2702613.2732749"
    },
    {
      "text": "Cecilia Laschi and Matteo Cianchetti. 2014. Soft robotics: new perspectives for robot bodyware and control. Frontiers in bioengineering and biotechnology 2 (2014), 3.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Lynette A Jones. 2011. Tactile and haptic illusions. IEEE Transactions on Haptics 4, 4 (2011), 273--294.",
      "doi": "10.1109/TOH.2011.2"
    },
    {
      "text": "Jaeyeon Lee, Mike Sinclair, Mar Gonzalez-Franco, Eyal Ofek, and Christian Holz. 2019. TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 71.",
      "doi": "10.1145/3290605.3300301"
    },
    {
      "text": "Nadia Magnenat-Thalmann and Ugo Bonanni. 2006. Haptics in virtual reality and multimedia. IEEE MultiMedia 13, 3 (2006), 6--11.",
      "doi": "10.1109/MMUL.2006.56"
    },
    {
      "text": "Denys JC Matthies, Laura Milena Daza Parra, and Bodo Urban. 2018. Scaling notifications beyond alerts: from subtly drawing attention up to forcing the user to take action. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST '18 Adjunct). ACM, 45--47.",
      "doi": "10.1145/3266037.3266096"
    },
    {
      "text": "Francis McGlone and David Reilly. 2010. The cutaneous sensory system. Neuroscience & Biobehavioral Reviews 34, 2 (2010), 148--159.",
      "doi": ""
    },
    {
      "text": "Takashi Mitsuda. 2013. Pseudo force display that applies pressure to the forearms. Presence 22, 3 (2013), 191--201.",
      "doi": "10.1162/PRES_a_00150"
    },
    {
      "text": "Makoto Miyazaki, Masaya Hirashima, and Daichi Nozaki. 2010. The 'cutaneous rabbit\" hopping out of the body. Journal of Neuroscience 30, 5 (2010), 1856--1860.",
      "doi": ""
    },
    {
      "text": "Sachith Muthukumarana, Denys JC Matthies, Chamod Weerasinghe, Don Samitha Elvitigala, and Suranga Nanayakkara. 2019. CricketCoach: Towards Creating a Better Awareness of Gripping Forces for Cricketers. In Proceedings of the 10th Augmented Human International Conference 2019. ACM, 43.",
      "doi": "10.1145/3311823.3311833"
    },
    {
      "text": "Suranga Nanayakkara, Elizabeth Taylor, Lonce Wyse, and S H Ong. 2009. An enhanced musical experience for the deaf: design and evaluation of a music display and a haptic chair. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 337--346.",
      "doi": "10.1145/1518701.1518756"
    },
    {
      "text": "Patrick E Patterson and Judd A Katz. 1992. Design and evaluation of a sensory feedback system that provides grasping pressure in a myoelectric hand. J Rehabil Res Dev 29, 1 (1992), 1--8.",
      "doi": ""
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, Don Samitha Elvitigala, and Suranga Nanayakkara. 2018. Supporting Rhythm Activities of Deaf Children using Music-Sensory-Substitution Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 486.",
      "doi": "10.1145/3173574.3174060"
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, and Suranga Nanayakkara. 2016. MuSS-bits: sensor-display blocks for deaf people to explore musical sounds. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. ACM, 72--80.",
      "doi": "10.1145/3010915.3010939"
    },
    {
      "text": "Dario Pittera, Elia Gatti, and Marianna Obrist. 2019. I'm Sensing in the Rain: Spatial Incongruity in Visual-Tactile Mid-Air Stimulation Can Elicit Ownership in VR Users. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 132.",
      "doi": "10.1145/3290605.3300362"
    },
    {
      "text": "plexus imersive corp. 2018. We make high performance VR/AR gloves to feel the digital reality. (2018). Retrieved April 2, 2019 from http://plexus.im/.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Peter Brandes, Hung Ngo Quang, and Michael Rohs. 2017. Squeezeback: pneumatic compression for notifications. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5318--5330.",
      "doi": "10.1145/3025453.3025526"
    },
    {
      "text": "Anil K Raj, Steven J Kass, and James F Perry. 2000. Vibrotactile displays for improving spatial awareness. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 44. SAGE Publications Sage CA: Los Angeles, CA, 181--184.",
      "doi": ""
    },
    {
      "text": "Charlotte M Reed, Hong Z Tan, Zachary D Perez, E Courtenay Wilson, Frederico M Severgnini, Jaehong Jung, Juan S Martinez, Yang Jiao, Ali Israr, Frances Lau, and others. 2018. A Phonemic-Based Tactile Display for Speech Communication. IEEE Transactions on Haptics 12, 1 (2018), 2--17.",
      "doi": ""
    },
    {
      "text": "Mark Schrope. 2001. Simply sensational. New Scientist (2001).",
      "doi": ""
    },
    {
      "text": "Andrew A Stanley and Katherine J Kuchenbecker. 2012. Evaluation of tactile feedback methods for wrist rotation guidance. IEEE Transactions on Haptics 5, 3 (2012), 240--251.",
      "doi": "10.1109/TOH.2012.33"
    },
    {
      "text": "Katja Suhonen, Kaisa Väänänen-Vainio-Mattila, and Kalle Mäkelä. 2012. User experiences and expectations of vibrotactile, thermal and squeeze feedback in interpersonal communication. In Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers. British Computer Society, 205--214.",
      "doi": "10.5555/2377916.2377939"
    },
    {
      "text": "Camilo Tejeiro, Cara E Stepp, Mark Malhotra, Eric Rombokas, and Yoky Matsuoka. 2012. Comparison of remote pressure and vibrotactile feedback for prosthetic hand control. In 2012 4th IEEE RAS & EMBS International Conference on Biomedical Robotics and Biomechatronics (BioRob). IEEE, 521--525.",
      "doi": ""
    },
    {
      "text": "TESLASUIT. 2019. Ultimate tech in Smart Clothing. (2019). Retrieved April 2, 2019 from https://teslasuit.io/.",
      "doi": ""
    },
    {
      "text": "Jan BF Van Erp, Ian Saturday, and Chris Jansen. 2006. Application of tactile displays in sports: where to, how and when to move. In Proc. Eurohaptics. Citeseer, 105--109.",
      "doi": ""
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo: A thin and feel-through tattoo for on-skin tactile output. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 365--378.",
      "doi": "10.1145/3242587.3242645"
    },
    {
      "text": "Zhuoming Zhang, Robin Héron, Eric Lecolinet, Françoise Détienne, and Stéphane Safin. 2019. VisualTouch: Enhancing Affective Touch Communication with Multi-modality Stimulation. In 2019 International Conference on Multimodal Interaction. ACM, 114--123.",
      "doi": ""
    },
    {
      "text": "Ying Zheng and John B Morrell. 2012. Haptic actuator design parameters that influence affect and attention. In 2012 IEEE Haptics Symposium (HAPTICS). IEEE, 463--470.",
      "doi": ""
    },
    {
      "text": "Ying Zheng, Ellen Su, and John B Morrell. 2013. Design and evaluation of pactors for managing attention capture. In 2013 World Haptics Conference (WHC). IEEE, 497--502.",
      "doi": ""
    }
  ]
}