{
  "doi": "10.1145/3313831.3376736",
  "title": "Investigating Collaborative Exploration of Design Alternatives on a Wall-Sized Display",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Industrial design review is an iterative process which mainly relies on two steps involving many stakeholders: design discussion and CAD data adjustment. We investigate how a wall-sized display could be used to merge these two steps by allowing multidisciplinary collaborators to simultaneously generate and explore design alternatives. We designed ShapeCompare based on the feedback from a usability study. It enables multiple users to compute and distribute CAD data with touch interaction. To assess the benefit of the wall-sized display in such context, we ran a controlled experiment which aims to compare ShapeCompare with a visualization technique suitable for standard screens. The results show that pairs of participants performed a constraint solving task faster and used more deictic instructions with ShapeCompare. From these findings, we draw generic recommendations for collaborative exploration of alternatives.",
  "authors": [
    {
      "name": "Yujiro Okuya",
      "institution": "Université Paris-Saclay, CNRS, LIMSI VENISE team & Université Paris-Saclay, CNRS, Inria, LRI, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529243",
      "orcid": "missing"
    },
    {
      "name": "Olivier Gladin",
      "institution": "Université Paris-Saclay, CNRS, Inria, LRI, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527626",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Ladevèze",
      "institution": "Université Paris-Saclay, CNRS, LIMSI, VENISE team, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611860",
      "orcid": "missing"
    },
    {
      "name": "Cédric Fleury",
      "institution": "Université Paris-Saclay, CNRS, Inria, LRI, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381604779",
      "orcid": "missing"
    },
    {
      "name": "Patrick Bourdot",
      "institution": "Université Paris-Saclay, CNRS, LIMSI VENISE team, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100543311",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bruno R. De Araújo, Géry Casiez, Joaquim A. Jorge, and Martin Hachet. 2013. Mockup Builder: 3D modeling on and above the surface. Computers & Graphics 37, 3 (2013), 165 -- 178. https://doi.org/10.1016/j.cag.2012.12.005",
      "doi": "10.1016/j.cag.2012.12.005"
    },
    {
      "text": "Ravin Balakrishnan, George Fitzmaurice, Gordon Kurtenbach, and William Buxton. 1999. Digital Tape Drawing. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology (UIST '99). ACM, NY, NY, USA, 161--169. https://doi.org/10.1145/320719.322598",
      "doi": "10.1145/320719.322598"
    },
    {
      "text": "Robert Ball and Chris North. 2008. The Effects of Peripheral Vision and Physical Navigation on Large Scale Visualization. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 9--16. http://dl.acm.org/citation.cfm?id=1375714.1375717",
      "doi": "10.5555/1375714.1375717"
    },
    {
      "text": "Robert Ball, Chris North, Chris North, and Doug A. Bowman. 2007. Move to Improve: Promoting Physical Navigation to Increase User Performance with Large Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 191--200. https://doi.org/10.1145/1240624.1240656",
      "doi": ""
    },
    {
      "text": "Michel Beaudouin-Lafon. 2011. Lessons Learned from the WILD Room, a Multisurface Interactive Environment. In Proceedings of the 23rd Conference on L'Interaction Homme-Machine (IHM '11). ACM, NY, NY, USA, Article 18, 8 pages. https://doi.org/10.1145/2044354.",
      "doi": "10.1145/2044354.2044376"
    },
    {
      "text": "M. Beaudouin-Lafon, S. Huot, M. Nancel, W. Mackay, E. Pietriga, R. Primet, J. Wagner, O. Chapuis, C. Pillias, J. Eagan, T. Gjerlufsen, and C. Klokmose. 2012. Multisurface Interaction in the WILD Room. Computer 45, 4 (April 2012), 48--56. https://doi.org/10.1109/MC.2012.110",
      "doi": "10.1109/MC.2012.110"
    },
    {
      "text": "Julien Berta. 1999. Integrating VR and CAD. IEEE Computer Graphics and Applications 19, 5 (Sep. 1999), 14--19. https://doi.org/10.1109/38.",
      "doi": "10.1109/38.788793"
    },
    {
      "text": "Xiaojun Bi and Ravin Balakrishnan. 2009. Comparing Usage of a Large High-resolution Display to Single or Dual Desktop Displays for Daily Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1005--1014. https://doi.org/10.1145/1518701.1518855",
      "doi": "10.1145/1518701.1518855"
    },
    {
      "text": "Yannick Bodein, Bertrand Rose, and Emmanuel Caillaud. 2013. A roadmap for parametric CAD efficiency in the automotive industry. Computer-Aided Design 45, 10 (2013), 1198 -- 1214. https://doi.org/10.1016/j.cad.2013.05.006",
      "doi": "10.1016/j.cad.2013.05.006"
    },
    {
      "text": "William Buxton, George Fitzmaurice, Ravin Balakrishnan, and Gordon Kurtenbach. 2000. Large displays in automotive design. IEEE Computer Graphics and Applications 20, 4 (July 2000), 68--75. https://doi.org/10.1109/38.851753",
      "doi": "10.1109/38.851753"
    },
    {
      "text": "SangSu Choi, HyunJei Jo, Stefan Boehm, and Sang Do Noh. 2010. ONESVIEW: An Integrated System for OneStop Virtual Design Review. Concurrent Engineering 18, 1 (2010), 75--91. https://doi.org/10.1177/1063293X10361624 arXiv:https://doi.org/10.1177/1063293X10361624",
      "doi": ""
    },
    {
      "text": "Herbert H Clark, Susan E Brennan, et al. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.",
      "doi": ""
    },
    {
      "text": "Dane Coffey, Chi-Lun Lin, Arthur G Erdman, and Daniel F Keefe. 2013. Design by Dragging: An Interface for Creative Forward and Inverse Design with Simulation Ensembles. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2783--2791. https://doi.org/10.1109/TVCG.2013.147",
      "doi": "10.1109/TVCG.2013.147"
    },
    {
      "text": "Thomas Convard and Patrick Bourdot. 2004. History Based Reactive Objects for Immersive CAD. In Proceedings of the Ninth ACM Symposium on Solid Modeling and Applications (SM '04). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 291--296. http://dl.acm.org/citation.cfm?id=1217875.1217921",
      "doi": "10.5555/1217875.1217921"
    },
    {
      "text": "Mary Czerwinski, Greg Smith, Tim Regan, Brian Meyers, George Robertson, and Gary Starkweather. 2003. Toward Characterizing the Productivity Benefits of Very Large Displays. In (2003) Interact 2003 ((2003) interact 2003 ed.). IOS Press.",
      "doi": ""
    },
    {
      "text": "Jakub Dostal, Uta Hinrichs, Per Ola Kristensson, and Aaron Quigley. 2014. SpiderEyes: Designing Attention- and Proximity-aware Collaborative Interfaces for Wall-sized Displays. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, NY, NY, USA, 143--152. https://doi.org/10.1145/2557500.2557541",
      "doi": "10.1145/2557500.2557541"
    },
    {
      "text": "Michele Fiorentino, Raffaele de Amicis, Giuseppe Monno, and Andre Stork. 2002. Spacedesign: a mixed reality workspace for aesthetic industrial design. In Proceedings. International Symposium on Mixed and Augmented Reality. 86--318. https://doi.org/10.1109/ISMAR.2002.",
      "doi": ""
    },
    {
      "text": "T. Fleisch, G. Brunetti, P. Santos, and A. Stork. 2004. Stroke-input methods for immersive styling environments. In Proceedings Shape Modeling Applications, 2004. 275--283. https://doi.org/10.1109/SMI. 2004.1314514",
      "doi": ""
    },
    {
      "text": "Clifton Forlines, Daniel Vogel, and Ravin Balakrishnan. 2006. HybridPointing: Fluid Switching Between Absolute and Relative Pointing with a Direct Input Device. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 211--220. https://doi.org/10.1145/1166253.1166286",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Tovi Grossman, Ravin Balakrishnan, Gordon Kurtenbach, George Fitzmaurice, Azam Khan, and Bill Buxton. 2001. Interaction Techniques for 3D Modeling on Large Displays. In Proceedings of the 2001 Symposium on Interactive 3D Graphics (I3D '01). ACM, NY, NY, USA, 17--23. https://doi.org/10.1145/364338.364341",
      "doi": "10.1145/364338.364341"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASATLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139 -- 183. https://doi.org/10.1016/S0166--4115(08)62386--9",
      "doi": ""
    },
    {
      "text": "Takeo Igarashi, Takeo Igarashi, and John F. Hughes. 2007. A Suggestive Interface for 3D Drawing. In ACM SIGGRAPH 2007 Courses (SIGGRAPH '07). ACM, NY, NY, USA, Article 20. https://doi.org/10.1145/1281500.1281531",
      "doi": ""
    },
    {
      "text": "J.H. Israel, E. Wiese, M. Mateescu, C. Zöllner, and R. Stark. 2009. Investigating three-dimensional sketching for early conceptual design-Results from expert discussions and user studies. Computers & Graphics 33, 4 (2009), 462 -- 473. https://doi.org/10.1016/j.cag.2009.05. 005",
      "doi": "10.1016/j.cag.2009.05.005"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2014. Up Close and Personal: Collaborative Work on a High-resolution Multitouch Wall Display. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 11 (Feb. 2014), 34 pages. https://doi.org/10.1145/2576099",
      "doi": "10.1145/2576099"
    },
    {
      "text": "Daniel F Keefe, Robert C Zeleznik, and David H Laidlaw. 2007. Drawing on Air: Input Techniques for Controlled 3D Line Illustration. IEEE Transactions on Visualization and Computer Graphics 13, 5 (Sep. 2007), 1067--1081. https://doi.org/10.1109/TVCG.2007.1060",
      "doi": "10.1109/TVCG.2007.1060"
    },
    {
      "text": "Azam Khan, Justin Matejka, George Fitzmaurice, and Gordon Kurtenbach. 2005. Spotlight: Directing Users' Attention on Large Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 791--798. https://doi.org/10.1145/1054972.1055082",
      "doi": "10.1145/1054972.1055082"
    },
    {
      "text": "Sebastien Kuntz. 2017. improov3, The VR collaborative meeting room, MiddleVR company, Paris, FRANCE, http://www.improovr.com/home/. http://www.improovr.com/home/",
      "doi": ""
    },
    {
      "text": "R. Langner, U. Kister, and R. Dachselt. 2019. Multiple Coordinated Views at Large Displays for Multiple Users: Empirical Findings on CHI '20, April 25--30, 2020, Honolulu, HI, USA Y. Okuya et al. User Behavior, Movements, and Distances. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 608--618. https://doi.org/10.1109/TVCG.2018.2865235",
      "doi": "10.1109/TVCG.2018.2865235"
    },
    {
      "text": "Glyn Lawson, Davide Salanitri, and Brian Waterfield. 2015. VR Processes in the Automotive Industry. In Human-Computer Interaction: Users and Contexts, Masaaki Kurosu (Ed.). Springer International Publishing, 208--217. https://doi.org/10.1007/978--3--319--21006--3_21",
      "doi": ""
    },
    {
      "text": "Valerie D Lehner and Thomas A DeFanti. 1997. Distributed virtual reality: supporting remote collaboration in vehicle design. IEEE Computer Graphics and Applications 17, 2 (March 1997), 13--17. https://doi.org/10.1109/38.574654",
      "doi": "10.1109/38.574654"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, and Eric Lecolinet. 2016. Shared Interaction on a Wall-Sized Display in a Data Manipulation Task. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2075--2086. https://doi.org/10.1145/2858036.2858039",
      "doi": "10.1145/2858036.2858039"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, and Eric Lecolinet. 2017. CoReach: Cooperative Gestures for Data Manipulation on Wallsized Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6730--6741. https://doi.org/10.1145/3025453.3025594",
      "doi": "10.1145/3025453.3025594"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy E. Mackay. 2014. Effects of Display Size and Navigation Type on a Classification Task. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 4147--4156. https://doi.org/10.1145/2556288.2557020",
      "doi": ""
    },
    {
      "text": "Jean-Baptiste Louvet and Cédric Fleury. 2016. Combining Bimanual Interaction and Teleportation for 3D Manipulation on Multi-touch Wall-sized Displays. In Proceedings of the 22Nd ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM, NY, NY, USA, 283--292. https://doi.org/10.1145/2993369.2993390",
      "doi": "10.1145/2993369.2993390"
    },
    {
      "text": "Morad Mahdjoub, Davy Monticolo, Samuel Gomes, and Jean-Claude Sagot. 2010. A collaborative Design for Usability approach supported by Virtual Reality and a Multi-Agent System embedded in a PLM environment. Computer-Aided Design 42, 5 (2010), 402 -- 413. https://doi.org/10.1016/j.cad.2009.02.009",
      "doi": "10.1016/j.cad.2009.02.009"
    },
    {
      "text": "Pierre Martin, Stéphane Masfrand, Yujiro Okuya, and Patrick Bourdot. 2017. A VR-CAD Data Model for Immersive Design. In Augmented Reality, Virtual Reality, and Computer Graphics, Lucio Tommaso De Paolis, Patrick Bourdot, and Antonio Mongelli (Eds.). Springer International Publishing, Cham, 222--241. https://doi.org/10.1007/978--3--319--60922--5_17",
      "doi": ""
    },
    {
      "text": "T.S. Mujber, T. Szecsi, and M.S.J. Hashmi. 2004. Virtual reality applications in manufacturing process simulation. Journal of Materials Processing Technology 155--156 (2004), 1834 -- 1838. https://doi.org/10.1016/j.jmatprotec.2004.04.401",
      "doi": ""
    },
    {
      "text": "Mathieu Nancel, Olivier Chapuis, Emmanuel Pietriga, Xing-Dong Yang, Pourang P. Irani, and Michel Beaudouin-Lafon. 2013. High-precision Pointing on Large Wall Displays Using Small Handheld Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 831--840. https://doi. org/10.1145/2470654.2470773",
      "doi": "10.1145/2470654.2470773"
    },
    {
      "text": "Yujiro Okuya, Nicolas Ladeveze, Cédric Fleury, and Patrick Bourdot. 2018. ShapeGuide: Shape-Based 3D Interaction for Parameter Modification of Native CAD Data. Frontiers in Robotics and AI 5 (2018), 118. https://doi.org/10.3389/frobt.2018.00118",
      "doi": ""
    },
    {
      "text": "Yujiro Okuya, Nicolas Ladeveze, Olivier Gladin, Cédric Fleury, and Patrick Bourdot. 2018. Distributed Architecture for Remote Collaborative Modification of Parametric CAD Data. In 2018 IEEE Fourth VR International Workshop on Collaborative Virtual Environments (3DCVE). 1--4. https://doi.org/10.1109/3DCVE.2018.8637112",
      "doi": ""
    },
    {
      "text": "Dan R. Olsen. 2007. Evaluating User Interface Systems Research. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). Association for Computing Machinery, New York, NY, USA, 251--258. https://doi.org/10.1145/1294211.1294256",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "D. Rantzau, F. Maurer, C. Mayer, R. Löffler, O. Riedel, H. Scharm, and D. Banek. 2001. The integration of immersive Virtual Reality applications into Catia V5. In Immersive Projection Technology and Virtual Environments 2001, Bernd Fröhlich, Joachim Deisinger, and Hans-Jörg Bullinger (Eds.). Springer Vienna, Vienna, 93--102. https://doi.org/10.1007/978--3--7091--6221--7_10",
      "doi": ""
    },
    {
      "text": "Alberto Raposo, Ismael Santos, Luciano Soares, Gustavo Wagner, Eduardo Corseuil, and Marcelo Gattass. 2009. Environ: Integrating VR and CAD in Engineering Projects. IEEE Computer Graphics and Applications 29, 6 (Nov 2009), 91--95. https://doi.org/10.1109/MCG.2009.118",
      "doi": ""
    },
    {
      "text": "Judy Robertson and Maurits Kaptein. 2016. Modern Statistical Methods for HCI. Springer. https://doi.org/10.1007/978--3--319--26633--6",
      "doi": "10.5555/2927492"
    },
    {
      "text": "Drew Skillman and Patrick Hackett. 2016. Tilt Brush application, Google Inc., https://www.tiltbrush.com/. https://www.tiltbrush.com/",
      "doi": ""
    },
    {
      "text": "TechViz. 2004. TechViz XL. https://www.techviz.net/techviz-xl",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2005. Distant Freehand Pointing and Clicking on Very Large, High Resolution Displays. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (UIST '05). ACM, NY, NY, USA, 33--42. https://doi. org/10.1145/1095034.1095041",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Beth Yost, Yonca Haciahmetoglu, Chris North, and Chris North. 2007. Beyond Visual Acuity: The Perceptual Scalability of Information Visualizations for Large Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 101--110. https://doi.org/10.1145/1240624.1240639",
      "doi": "10.1145/1240624.1240639"
    },
    {
      "text": "Peter Zimmermann. 2008. Virtual Reality Aided Design. A survey of the use of VR in automotive industry. Springer Netherlands, Dordrecht, 277--296. https://doi.org/10.1007/978--1--4020--8200--9_13",
      "doi": ""
    }
  ]
}