{
  "doi": "10.1145/3313831.3376597",
  "title": "Computational Alternatives Vignettes for Place- and Activity-Centered Digital Services in Public Libraries",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We investigate how to design community technologies for public events. We do so with a focus on technologies that give rise to new forms of participation and knowledge co-production in public libraries. Specifically, we deployed a digital service at a major public library during its four-week creative workshop series. The system offered an alternative way for people to work together as a community, to go beyond achieving individual goals, and to contribute to the achievement of public goals (e.g., building community bookshelves). We report on how the system has reconfigured physical spaces and afforded new social practices in the library. We propose Computational Alternatives as a fruitful approach for gaining situated, nuanced insights into a technology's possible adoption. We offer key insights in the form of computational alternatives vignettes -- grounded stories that encapsulate sociotechnical implications of technology, pointing to plausible alternative futures.",
  "authors": [
    {
      "name": "Daisy Yoo",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556772856",
      "orcid": "missing"
    },
    {
      "name": "Aurélien Tabard",
      "institution": "Université de Lyon 1, Lyon, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490759",
      "orcid": "missing"
    },
    {
      "name": "Alix Ducros",
      "institution": "Université de Lyon 1, Lyon, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260318",
      "orcid": "missing"
    },
    {
      "name": "Peter Dalsgaard",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81100468838/rel-imgonly/peter.jpeg",
      "acmid": "81100468838",
      "orcid": "missing"
    },
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    },
    {
      "name": "Eva Eriksson",
      "institution": "Aarhus University & Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/do/10.1145/contrib-81324489214/rel-imgonly/eva_2013.jpg",
      "acmid": "81324489214",
      "orcid": "missing"
    },
    {
      "name": "Sofia Serholt",
      "institution": "University of Gothenburg & Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658993473",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Noorhidawati Abdullah, Samuel Chu, Sandhya Rajagopal, Abigail Tung, and Yeung Kwong-Man. 2015. Exploring Libraries' Efforts in Inclusion and Outreach Activities Using Social Media. International Journal of Libraries and Information Studies 65, 1 (2015), 34--47. DOI: http://dx.doi.org/10.1515/libri-2014-0055",
      "doi": ""
    },
    {
      "text": "Maija Berndtson. 2013. Public libraries and placemaking. In IFLA WLIC 2013 - Singapore - Future Libraries: Infinite Possibilities. IFLA, Singapore, 1--10. http://library.ifla.org/id/eprint/224",
      "doi": ""
    },
    {
      "text": "Olav W. Bertelsen, Susanne Bødker, Eva Eriksson, Eve Hoggan, and Jo Vermeulen. 2018. Beyond Generalization: Research for the Very Particular. Interactions 26, 1 (Dec. 2018), 34--38. DOI: http://dx.doi.org/10.1145/3289425",
      "doi": ""
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction. Near Future Laboratory 29 (2009).",
      "doi": ""
    },
    {
      "text": "Susanne Bødker and Ole Sejer Iversen. 2002. Staging a Professional Participatory Design Practice: Moving PD Beyond the Initial Fascination of User Involvement. In Proceedings of the Second Nordic Conference on Human-computer Interaction (NordiCHI '02). ACM, NY, NY, USA, 11--18. DOI: http://dx.doi.org/10.1145/572020.572023",
      "doi": "10.1145/572020.572023"
    },
    {
      "text": "Bertram C Bruce, Andee Rubin, and Junghyun An. 2010. Situated evaluation of socio-technical systems. In Social Computing: Concepts, Methodologies, Tools, and Applications. IGI Global, 2211--2225.",
      "doi": ""
    },
    {
      "text": "Parmit K. Chilana, Andrew J. Ko, and Jacob Wobbrock. 2015. From User-Centered to Adoption-Centered Design: A Case Study of an HCI Research Innovation Becoming a Product. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1749--1758. DOI: http://dx.doi.org/10.1145/2702123.2702412",
      "doi": "10.1145/2702123.2702412"
    },
    {
      "text": "Terry Costantino, Steven LeMay, Linnea Vizard, Heather Moore, Dara Renton, Sandra Gornall, and Ian Strang. 2014. Exploring Participation in the Design of Public Library e-Services. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium Papers, and Keynote Abstracts - Volume 2 (PDC '14). ACM, NY, NY, USA, 17--20. DOI: http://dx.doi.org/10.1145/2662155.2662174",
      "doi": "10.1145/2662155.2662174"
    },
    {
      "text": "Peter Dalsgaard, Christian Dindler, and Eva Eriksson. 2008. Designing for Participation in Public Knowledge Institutions. In Proceedings of the 2008 Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, NY, NY, USA, 93--102. DOI: http://dx.doi.org/10.1145/1463160.1463171",
      "doi": "10.1145/1463160.1463171"
    },
    {
      "text": "Peter Dalsgaard and Eva Eriksson. 2013. Large-scale Participation: A Case Study of a Participatory Approach to Developing a New Public Library. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 399--408. DOI: http://dx.doi.org/10.1145/2470654.2470713",
      "doi": "10.1145/2470654.2470713"
    },
    {
      "text": "Paul Dourish. 2004. What We Talk About when We Talk About Context. Personal Ubiquitous Comput. 8, 1 (Feb. 2004), 19--30. DOI: http://dx.doi.org/10.1007/s00779-003-0253--8",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Yrjö Engeström. 2015. Learning by expanding. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "International Organization for Standardization. 2014. International Standard ISO 16439: Information and Documentation: Methods and Procedures for Assessing the Impact of Libraries. ISO.",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions 6, 1 (1999), 21--29.",
      "doi": ""
    },
    {
      "text": "Dwayne D Gremler. 2004. The critical incident technique in service research. Journal of service research 7, 1 (2004), 65--89.",
      "doi": ""
    },
    {
      "text": "Carla Gröschel, Peter Dalsgaard, Clemens N. Klokmose, Henrik Korsgaard, Eva Eriksson, Raphaëlle Bats, Aurélien Tabard, Alix Ducros, and Sofia E. Serholt. 2018. PARTICIPATE: Capturing Knowledge in Public Library Activities. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW060, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188605",
      "doi": ""
    },
    {
      "text": "Bruce Hanington and Bella Martin. 2012. Universal methods of design: 100 ways to research complex problems, develop innovative ideas, and design effective solutions. Rockport Publishers.",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (CSCW '96). ACM, NY, NY, USA, 67--76. DOI: http://dx.doi.org/10.1145/240080.240193",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Jina Huh, Mark S. Ackerman, Thomas Erickson, Steve Harrison, and Phoebe Sengers. 2007. Beyond Usability: Taking Social, Situational, Cultural, and Other Contextual Factors into Account. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, NY, NY, USA, 2113--2116. DOI: http://dx.doi.org/10.1145/1240866.1240961",
      "doi": "10.1145/1240866.1240961"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. In Proc. ACM CHI '03. ACM, NY, NY, USA, 17--24. DOI: http://dx.doi.org/10.1145/642611.642616",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Clemens N. Klokmose, James Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2016. Webstrates: Demonstrating the Potential of Shareable Dynamic Media. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW '16 Companion). ACM, NY, NY, USA, 61--64. DOI: http://dx.doi.org/10.1145/2818052.2874325",
      "doi": "10.1145/2818052.2874325"
    },
    {
      "text": "Henrik Korsgaard, Clemens Nylandsted Klokmose, and Susanne Bødker. 2016. Computational Alternatives in Participatory Design: Putting the T Back in Socio-technical Research. In Proceedings of the 14th Participatory Design Conference: Full Papers - Volume 1 (PDC '16). ACM, NY, NY, USA, 71--79. DOI: http://dx.doi.org/10.1145/2940299.2940314",
      "doi": "10.1145/2940299.2940314"
    },
    {
      "text": "Jörn Messeter. 2009. Place-specific computing: A place-centric perspective for digital designs. International Journal of Design 3, 1 (2009), 29--41.",
      "doi": ""
    },
    {
      "text": "William Odom, Ron Wakkary, Youn-kyung Lim, Audrey Desjardins, Bart Hengeveld, and Richard Banks. 2016. From research prototype to research product. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2549--2561.",
      "doi": "10.1145/2858036.2858447"
    },
    {
      "text": "R Oldenburg. 1989. The Great Good Place: Cafes, Coffee Shops, Bookstores, Bars, Hairsalons and Other Hangouts at the Heart of Community. Marlowe and Company.",
      "doi": ""
    },
    {
      "text": "T.C. Pape and K. Thoresen. 1987. Development of common systems by prototyping. In Computers and Democracy: A Scandinavian Challenge, Gro Bjerknes, Pelle Ehn, and Morten Kyng (Eds.). Gower Pub Co.",
      "doi": ""
    },
    {
      "text": "Beth Posner. 2002. Urban Librarianship: Libraries, Cities and Beyond. In CUNY Academic Works. CUNY, New York, NY, USA, 1--24. http://academicworks.cuny.edu/gc_pubs/342",
      "doi": ""
    },
    {
      "text": "Vicky Reich and Mark Weiser. 1994. Libraries are more than information: Situational aspects of electronic libraries. Serials Review 20, 3 (1994), 31--37. DOI: http://dx.doi.org/10.1016/0098--7913(94)90037-X",
      "doi": ""
    },
    {
      "text": "Antti Salovaara, Antti Oulasvirta, and Giulio Jacucci. 2017. Evaluation of Prototypes and the Problem of Possible Futures. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2064--2077.",
      "doi": "10.1145/3025453.3025658"
    },
    {
      "text": "Sofia Serholt, Eva Eriksson, Peter Dalsgaard, Raphaëlle Bats, and Alix Ducros. 2018. Opportunities and Challenges for Technology Development and Adoption in Public Libraries. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI '18). ACM, NY, NY, USA, 311--322. DOI: http://dx.doi.org/10.1145/3240167.3240198",
      "doi": "10.1145/3240167.3240198"
    },
    {
      "text": "Jesper Simonsen and Toni Robertson. 2012. Routledge international handbook of participatory design. Routledge.",
      "doi": ""
    },
    {
      "text": "Emma Simpson, Rob Comber, Andrew Garbett, Ed Ian Jenkins, and Madeline Balaam. 2017. Experiences of Delivering a Public Health Data Service. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6171--6183. DOI: http://dx.doi.org/10.1145/3025453.3025881",
      "doi": "10.1145/3025453.3025881"
    },
    {
      "text": "Aurélien Tabard, Juan David Hincapié Ramos, and Jakob Bardram. 2012. The eLabBench in the Wild: Supporting Exploration in a Molecular Biology Lab. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 3051--3060. DOI: http://dx.doi.org/10.1145/2207676.2208718",
      "doi": "10.1145/2207676.2208718"
    },
    {
      "text": "Aurélien Tabard, Wendy E. Mackay, and Evelyn Eastmond. 2008. From Individual to Collaborative: The Evolution of Prism, a Hybrid Laboratory Notebook. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 569--578. DOI: http://dx.doi.org/10.1145/1460563.1460653",
      "doi": "10.1145/1460563.1460653"
    },
    {
      "text": "Joshua Tanenbaum. 2014. Design fictional interactions: why HCI should care about stories. interactions 21, 5 (2014), 22--23.",
      "doi": "10.1145/2648414"
    },
    {
      "text": "Kaya van Beynen and Camielle Swenson. 2016. Exploring Peer-to-Peer Library Content and Engagement on a Student-Run Facebook Group. College & Research Libraries 77, 1 (2016), 34--50. DOI: http://dx.doi.org/10.5860/crl.77.1.34",
      "doi": ""
    },
    {
      "text": "Jon Whittle. 2014. How much participation is enough?. In Proceedings of the 13th Participatory Design Conference on Research Papers - PDC '14. ACM Press. DOI: http://dx.doi.org/10.1145/2661435.2661445",
      "doi": "10.1145/2661435.2661445"
    },
    {
      "text": "Jason Yip and Kung Jin Lee. 2018. The Design of Digital Learning Activities for Libraries Through Participatory Design. In Reconceptualizing Libraries. Routledge, 203--216. DOI: http://dx.doi.org/10.4324/9781315143422--12",
      "doi": ""
    },
    {
      "text": "Daisy Yoo, Anya Ernest, Sofia Serholt, Eva Eriksson, and Peter Dalsgaard. 2019. Service Design in HCI Research: The Extended Value Co-creation Model. In Proceedings of the Halfway to the Future Symposium 2019. ACM, 17.",
      "doi": "10.1145/3363384.3363401"
    }
  ]
}