{
  "doi": "10.1145/3313831.3376197",
  "title": "The Effects of Explicit Intention Communication, Conspicuous Sensors, and Pedestrian Attitude in Interactions with Automated Vehicles",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper, we investigate the effect of an external human-machine interface (eHMI) and a conspicuous external vehicle appearance due to visible sensors on pedestrian interactions with automated vehicles (AVs). Recent research shows that AVs may need to explicitly communicate with the environment due to the absence of a driver. Furthermore, in interaction situations, an AV that looks different and conspicuous owing to an extensive sensor system may potentially lead to hesitation stemming from mistrust in automation. Thus, we evaluated in a virtual reality study how pedestrian attitude, the presence/absence of an eHMI, and a conspicuous sensor system affect their willingness to cross the road. Results recommend the use of an eHMI. A conspicuous appearance of automated-driving capability had no effect for the sample as a whole, although it led to more efficient crossing decisions for those with a more negative attitude towards AVs. Our findings contribute towards the effective design of future AV interfaces.",
  "authors": [
    {
      "name": "Sander Ackermans",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366573",
      "orcid": "missing"
    },
    {
      "name": "Debargha Dey",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/do/10.1145/contrib-99659205251/rel-imgonly/enlight420.jpeg",
      "acmid": "99659205251",
      "orcid": "missing"
    },
    {
      "name": "Peter Ruijten",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558243656",
      "orcid": "missing"
    },
    {
      "name": "Raymond H. Cuijpers",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384593969",
      "orcid": "missing"
    },
    {
      "name": "Bastian Pfleging",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651934",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Richard A Abrams and Shawn E Christ. 2003. Motion onset captures attention. Psychological Science 14, 5 (2003), 427--432. DOI: http://dx.doi.org/10.1111/1467--9280.01458",
      "doi": ""
    },
    {
      "text": "Pavlo Bazilinskyy, Dimitra Dodou, and Joost de Winter. 2019. Survey on eHMI concepts: The effect of text, color, and perspective. (2019). https://www.researchgate.net/publication/332686842_ Survey_on_eHMI_concepts_The_effect_of_text_color_and_ perspective",
      "doi": ""
    },
    {
      "text": "Pavlo Bazilinskyy, Miltos Kyriakidis, and Joost de Winter. 2015. An International Crowdsourcing Study into People's Statements on Fully Automated Driving. Procedia Manufacturing 3, AHFE (2015), 2534--2542. DOI: http://dx.doi.org/10.1016/j.promfg.2015.07.540",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Claudia Witzlack, and Josef F. Krems. 2017. Gap Acceptance and Time-To-Arrival Estimates As Basis for Informal Communication Between Pedestrians and Vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, NY, NY, USA, 50--57. DOI: http://dx.doi.org/10.1145/3122986.3122995",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Claudia Witzlack, Sabine Springer, and Josef Krems. 2018. The Right Moment for Braking as Informal Communication Signal Between Automated Vehicles and Pedestrians in Crossing Situations. In Advances in Human Aspects of Transportation, Neville A Stanton (Ed.). Springer, Cham, 1072--1081. DOI: http://dx.doi.org/10.1007/978--3--319--60441--1_101",
      "doi": ""
    },
    {
      "text": "Ola Benderius, Christian Berger, and Victor Malmsten Lundgren. 2018. The Best Rated Human-Machine Interface Design for Autonomous Vehicles in the 2016 Grand Cooperative Driving Challenge. IEEE Transactions on Intelligent Transportation Systems 19, 4 (2018), 1302--1307. DOI: http://dx.doi.org/10.1109/TITS.2017.2749970",
      "doi": ""
    },
    {
      "text": "Marc-Philipp Böckle, Anna Pernestål Brenden, Maria Klingegård, Azra Habibovic, and Martijn Bout. 2017. SAV2P: Exploring the Impact of an Interface for Shared Automated Vehicles on Pedestrians' Experience. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct (AutomotiveUI '17). ACM, NY, NY, USA, 136--140. DOI: http://dx.doi.org/10.1145/3131726.3131765",
      "doi": "10.1145/3131726.3131765"
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Takeo Igarashi, Masahiro Miyata, and Yasuhiro Kobayashi. 2018. A Video-based Study Comparing Communication Modalities Between an Autonomous Car and a Pedestrian. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '18). ACM, NY, NY, USA, 104--109. DOI: http://dx.doi.org/10.1145/3239092.3265950",
      "doi": "10.1145/3239092.3265950"
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Daisuke Sakamoto, and Takeo Igarashi. 2017. Eyes on a Car: An Interface Design for Communication Between an Autonomous Car and a Pedestrian. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, NY, NY, USA, 65--73. DOI: http://dx.doi.org/10.1145/3122986.3122989",
      "doi": "10.1145/3122986.3122989"
    },
    {
      "text": "Michael Clamann, Miles Aubert, and Mary L Cummings. 2017. Evaluation of vehicle-to-pedestrian communication displays for autonomous vehicles. In Transportation Research Board 96th Annual Meeting. TRB, Washington DC, USA, 17--02119. https://trid.trb.org/View/1437891",
      "doi": ""
    },
    {
      "text": "Steve Connor. 2016. First self-driving cars will be unmarked so that other drivers don't try to bully them. (2016). https://www.theguardian.com/technology/2016/oct/30/volvo-self-driving-car-autonomous",
      "doi": ""
    },
    {
      "text": "Koen de Clercq, Andre Dietrich, Juan Pablo Núñez Velasco, Joost de Winter, and Riender Happee. 2019. External human-machine interfaces on automated vehicles: effects on pedestrian crossing decisions. Human factors (2019). DOI: http://dx.doi.org/10.1177/0018720819836343",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W Carruth, Richard Sween, Lesley Strawderman, and Teena M Garrison. 2017a. Efficacy of virtual reality in pedestrian safety research. Applied Ergonomics 65 (2017), 449--460. DOI: http://dx.doi.org/10.1016/j.apergo.2017.03.007",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Lesley Strawderman, Daniel W. Carruth, Janice DuBien, Brian Smith, and Teena M. Garrison. 2017b. Development and validation of a questionnaire to assess pedestrian receptivity toward fully autonomous vehicles. Transportation Research Part C: Emerging Technologies 84 (2017), 178--195. DOI: http://dx.doi.org/10.1016/j.trc.2017.08.029",
      "doi": ""
    },
    {
      "text": "Stavroula Panagiota Deligianni, Mohammed Quddus, Andrew Morris, Aaron Anvuur, and Steven Reed. 2017. Analyzing and Modelling Drivers' Deceleration Behaviour from Normal Driving. Transportation Research Record 2663, 1 (2017), 134--141. DOI: http://dx.doi.org/10.3141/2663--17",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Marieke Martens, Berry Eggen, and Jacques Terken. 2017. The Impact of Vehicle Appearance and Vehicle Behavior on Pedestrian Interaction with Autonomous Vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct (AutomotiveUI '17). ACM, NY, NY, USA, 158--162. DOI: http://dx.doi.org/10.1145/3131726.3131750",
      "doi": "10.1145/3131726.3131750"
    },
    {
      "text": "Debargha Dey, Marieke Martens, Berry Eggen, and Jacques Terken. 2019. Pedestrian Road-Crossing Willingness as a Function of Vehicle Automation, External Appearance, and Driving Behaviour. Transportation Research Part F: Traffic Psychology and Behaviour 65 (2019), 191--205. DOI: http://dx.doi.org/10.1016/j.trf.2019.07.027",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques Terken. 2018. Interface Concepts for Intent Communication from Autonomous Vehicles to Vulnerable Road Users. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '18). ACM, NY, NY, USA, 82--86. DOI: http://dx.doi.org/10.1145/3239092.3265946",
      "doi": "10.1145/3239092.3265946"
    },
    {
      "text": "Debargha Dey and Jacques Terken. 2017. Pedestrian Interaction with Vehicles: Roles of Explicit and Implicit Communication. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, NY, NY, USA, 109--113. DOI: http://dx.doi.org/10.1145/3122986.3123009",
      "doi": "10.1145/3122986.3123009"
    },
    {
      "text": "Debargha Dey, Francesco Walker, Marieke Martens, and Jacques Terken. 2019. Gaze Patterns in Pedestrian Interaction with Vehicles. (2019). Accepted in AutomotiveUI '19 ACM 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications.",
      "doi": "10.1145/3342197.3344523"
    },
    {
      "text": "Jillian D'Onfro. 2014. Why Google Made Its Self-Driving Car Look So Cute. (2014). https://www.businessinsider.com/google-self-driving-car-why-its-so-cute-2014--12? international=true&r=US&IR=T",
      "doi": ""
    },
    {
      "text": "Daniel J Fagnant and Kara Kockelman. 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transportation Research Part A: Policy and Practice 77 (2015), 167--181. DOI: http://dx.doi.org/10.1016/j.tra.2015.04.003",
      "doi": ""
    },
    {
      "text": "Berthold Färber. 2016. Communication and Communication Problems Between Autonomous Vehicles and Human Drivers. In Autonomous Driving: Technical, Legal and Social Aspects, Markus Maurer, J. Christian Gerdes, Barbara Lenz, and Hermann Winner (Eds.). Springer, Berlin, Heidelberg, 125--144. DOI: http://dx.doi.org/10.1007/978--3--662--48847--8_7",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Albert-Georg Lang, and Axel Buchner. 2007. G*Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences. Behavior Research Methods 39, 2 (2007), 175--191. DOI: http://dx.doi.org/10.3758/BF03193146",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen and CéLine Jacob. 2002. Direct Look Versus Evasive Glance and Compliance With a Request. The Journal of Social Psychology 142, 3 (2002), 393--396. DOI: http://dx.doi.org/10.1080/00224540209603907",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen, Sébastien Meineri, and Chloé Eyssartier. 2015. A pedestrian's stare and drivers' stopping behavior: A field experiment at the pedestrian crossing. Safety Science 75 (2015), 87--89. DOI: http://dx.doi.org/10.1016/j.ssci.2015.01.018",
      "doi": ""
    },
    {
      "text": "A Habibovic, Jonas Andersson, Victor Malmsten Lundgren, Maria Klingegård, Cristofer Englund, and Sofia Larsson. 2018. External Vehicle Interfaces for Communication with Other Road Users?. In Automated Vehicles Symposium 2018. Springer, Cham, 91--102. DOI: http://dx.doi.org/10.1007/978--3--319--94896--6",
      "doi": ""
    },
    {
      "text": "A. Habibovic, J. Andersson, M. Nilsson, V. M. Lundgren, and J. Nilsson. 2016. Evaluating Interactions with Non-existing Automated Vehicles: Three Wizard of Oz Approaches. In 2016 IEEE Intelligent Vehicles Symposium (IV). IEEE, Gothenburg, Sweden, 32--37. DOI: http://dx.doi.org/10.1109/IVS.2016.7535360",
      "doi": ""
    },
    {
      "text": "Azra Habibovic, Cristofer Englund, and Johan Wedlin. 2014. Current gaps, challenges and opportunities in the field of road vehicle automation. (2014). https://trid.trb.org/view/1506435",
      "doi": ""
    },
    {
      "text": "Azra Habibovic, Victor Malmsten Lundgren, Jonas Andersson, Maria Klingegård, Tobias Lagström, Anna Sirkka, Johan Fagerlönn, Claes Edgren, Rikard Fredriksson, Stas Krupenia, Dennis Saluäär, and Pontus Larsson. 2018. Communicating Intent of Automated Vehicles to Pedestrians. Frontiers in Psychology 9 (2018), 1336. DOI: http://dx.doi.org/10.3389/fpsyg.2018.01336",
      "doi": ""
    },
    {
      "text": "P. A. Hancock, Illah Nourbakhsh, and Jack Stewart. 2019. On the future of transportation in an era of automated and autonomous vehicles. Proceedings of the National Academy of Sciences 116, 16 (2019), 7684--7691. DOI: http://dx.doi.org/10.1073/pnas.1805770115",
      "doi": ""
    },
    {
      "text": "Lynn M Hulse, Hui Xie, and Edwin R Galea. 2018. Perceptions of autonomous vehicles: Relationships with road users, risk, gender and age. Safety Science 102 (2018), 1--13. DOI: http://dx.doi.org/10.1016/j.ssci.2017.10.001",
      "doi": ""
    },
    {
      "text": "B Raghuram Kadali and P Vedagiri. 2016. Proactive pedestrian safety evaluation at unprotected mid-block crosswalk locations under mixed traffic conditions. Safety science 89 (2016), 94--105. DOI: http://dx.doi.org/10.1016/j.ssci.2016.05.014",
      "doi": ""
    },
    {
      "text": "Franz Keferböck and Andreas Riener. 2015. Strategies for Negotiation between Autonomous Vehicles and Pedestrians. In Mensch und Computer, Burmester M. & Schmidt A. Weisbecker, A. (Ed.). De Gruyter, Berlin, Oldenbourg, 525--532. https://www.degruyter.com/downloadpdf/books/9783110443905/9783110443905-074/9783110443905-074.pdf",
      "doi": ""
    },
    {
      "text": "Siddartha Khastgir, Stewart Birrell, Gunwant Dhadyalla, and Paul Jennings. 2018. Calibrating trust through knowledge: introducing the concept of informed safety for automation in vehicles. Transportation research part C: emerging technologies 96 (2018), 290--303. DOI: http://dx.doi.org/10.1016/j.trc.2018.07.001",
      "doi": ""
    },
    {
      "text": "Wilhelm K. Klatt, Alvin Chesham, and Janek S. Lobmaier. 2016. Putting Up a Big Front: Car Design and Size Affect Road-Crossing Behaviour. PLOS ONE 11, 7 (07 2016), 1--12. DOI: http://dx.doi.org/10.1371/journal.pone.0159455",
      "doi": ""
    },
    {
      "text": "Kirsten Korosec. 2016. How to Design a Car When You're Not a Car Designer. (2016). http://fortune.com/2016/10/12/google-yoojung-ahn-car-designer/",
      "doi": ""
    },
    {
      "text": "Michail D Kozlov and Mark K Johansen. 2010. Real behavior in virtual environments: Psychology experiments in a simple virtual-reality paradigm using video games. Cyberpsychology, behavior, and social networking 13, 6 (2010), 711--714. DOI: http://dx.doi.org/10.1089/cyber.2009.0310",
      "doi": ""
    },
    {
      "text": "Miltos Kyriakidis, Riender Happee, and Joost C F de Winter. 2015. Public opinion on automated driving: Results of an international questionnaire among 5000 respondents. Transportation research part F: traffic psychology and behaviour 32 (2015), 127--140. DOI: http://dx.doi.org/10.1016/j.trf.2015.04.014",
      "doi": ""
    },
    {
      "text": "Todd Litman. 2017. Autonomous vehicle implementation predictions. Victoria Transport Policy Institute, Victoria, Canada. https://www.vtpi.org/avip.pdf",
      "doi": ""
    },
    {
      "text": "Victor Malmsten Lundgren, Azra Habibovic, Jonas Andersson, Tobias Lagström, Maria Nilsson, Anna Sirkka, Johan Fagerlönn, Rikard Fredriksson, Claes Edgren, Stas Krupenia, and Dennis Saluäär. 2017. Will There Be New Communication Needs When Introducing Automated Vehicles to the Urban Context?. In Advances in Human Aspects of Transportation, Neville A. Stanton, Steven Landry, Giuseppe Di Bucchianico, and Andrea Vallicelli (Eds.). Springer, Cham, 485--497. DOI: http://dx.doi.org/10.1007/978--3--319--41682--3_41",
      "doi": ""
    },
    {
      "text": "Julie Mathieu, Reinoud J. Bootsma, Catherine Berthelon, and Gilles Montagne. 2017. Judging arrival times of incoming traffic vehicles is not a prerequisite for safely crossing an intersection: Differential effects of vehicle size and type in passive judgment and active driving tasks. Acta Psychologica 173 (2017), 1--12. DOI: http://dx.doi.org/10.1016/j.actpsy.2016.11.014",
      "doi": ""
    },
    {
      "text": "Milecia Matthews, Girish Chowdhary, and Emily Kieson. 2017. Intent Communication between Autonomous Vehicles and Pedestrians. arXiv preprint arXiv:1708.07123. (2017). DOI: http://dx.doi.org/10.1016/j.trf.2009.05.002",
      "doi": ""
    },
    {
      "text": "Lars Müller, Malte Risto, and Colleen Emmenegger. 2016. The Social Behavior of Autonomous Vehicles. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, NY, NY, USA, 686--689. DOI: http://dx.doi.org/10.1145/2968219.2968561",
      "doi": "10.1145/2968219.2968561"
    },
    {
      "text": "Sina Nordhoff, Joost De Winter, Miltos Kyriakidis, Bart Van Arem, and Riender Happee. 2018. Acceptance of Driverless Vehicles: Results from a Large Cross-National Questionnaire Study. Journal of Advanced Transportation, 2018 (2018). DOI: http://dx.doi.org/10.1155/2018/5382192",
      "doi": ""
    },
    {
      "text": "J. P. Núñez Velasco, P. Rodriguez, H. Farah, and M. P. Hagenzieker. 2016. Safety of pedestrians and cyclists when interacting with self-driving vehicles: A case study of the WEpods. In Proceedings of the ITRL Conference on Integrated Transport 2016: Connected and Automated Transport Systems. http://resolver.tudelft.nl/uuid: f8ad5f8c-ecdb-45e3--86ae-6ddf645166b1",
      "doi": ""
    },
    {
      "text": "Paul K. Piff, Daniel M. Stancato, Stéphane Côté, Rodolfo Mendoza-Denton, and Dacher Keltner. 2012. Higher social class predicts increased unethical behavior. Proceedings of the National Academy of Sciences 109, 11 (2012), 4086--4091. DOI: http://dx.doi.org/10.1073/pnas.1118373109",
      "doi": ""
    },
    {
      "text": "Ryan Randazzo. 2018. Waymo's driverless cars on the road: Cautious, clunky, impressive. (2018). https://eu. azcentral.com/story/money/business/tech/2018/12/05/phoenix-waymo-vans-how-self-driving-cars-operate-roads/2082664002/",
      "doi": ""
    },
    {
      "text": "Amir Rasouli, Iuliia Kotseruba, and John K. Tsotsos. 2017. Agreeing To Cross: How Drivers and Pedestrians Communicate. In 2017 IEEE Intelligent Vehicles Symposium (IV). IEEE, Los Angeles, CA, USA, 264--269. DOI: http://dx.doi.org/10.1109/IVS.2017.7995730",
      "doi": ""
    },
    {
      "text": "Amir Rasouli, Iuliia Kotseruba, and John K. Tsotsos. 2018. Understanding Pedestrian Behavior in Complex Traffic Scenes. IEEE Transactions on Intelligent Vehicles 3, 1 (2018), 61--70. DOI: http://dx.doi.org/10.1109/TIV.2017.2788193",
      "doi": ""
    },
    {
      "text": "Amir Rasouli and John K. Tsotsos. 2019. Autonomous Vehicles That Interact With Pedestrians: A Survey of Theory and Practice. IEEE Transactions on Intelligent Transportation Systems (2019), 1--19. DOI: http://dx.doi.org/10.1109/TITS.2019.2901817",
      "doi": ""
    },
    {
      "text": "Miguel Ángel Recarte, Ángela Conchillo, and Luis Miguel Nunes. 2005. Estimation of arrival time in vehicle and video. Psicothema 17, 1 (2005), 112--117. http://www.redalyc.org/articulo.oa?id=72717118",
      "doi": ""
    },
    {
      "text": "Samantha Reig, Selena Norman, Cecilia G. Morales, Samadrita Das, Aaron Steinfeld, and Jodi Forlizzi. 2018. A Field Study of Pedestrians and Autonomous Vehicles. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '18). ACM, NY, NY, USA, 198--209. DOI: http://dx.doi.org/10.1145/3239060.3239064",
      "doi": "10.1145/3239060.3239064"
    },
    {
      "text": "Malte Risto, Colleen Emmenegger, Erik Vinkhuyzen, Melissa Cefkin, and Jim Hollan. 2017. Human-Vehicle Interfaces: The Power of Vehicle Movement Gestures in Human Road User Coordination. In Proceedings of the 9th International Driving Symposium on Human Factors in Driver Assessment, Training, and Vehicle Design. Manchester Village, Vermont, USA, 186--192. DOI: http://dx.doi.org/10.17077/drivingassessment.1633",
      "doi": ""
    },
    {
      "text": "Anna Schieben, Marc Wilbrink, Carmen Kettwich, Ruth Madigan, Tyron Louw, and Natasha Merat. 2019. Designing the interaction of automated vehicles with other traffic participants: design considerations based on human needs and expectations. Cognition, Technology and Work 21 (2019), 69--85. DOI: http://dx.doi.org/10.1007/s10111-018-0521-z",
      "doi": "10.1007/s10111-018-0521-z"
    },
    {
      "text": "Sarah Schmidt and B Färber. 2009. Pedestrians at the kerb-Recognising the action intentions of humans. Transportation research part F: traffic psychology and behaviour 12, 4 (2009), 300--310. DOI: http://dx.doi.org/10.1016/j.trf.2009.02.003",
      "doi": ""
    },
    {
      "text": "Friederike Schneemann and Irene Gohl. 2016. Analyzing driver-pedestrian interaction at crosswalks: A contribution to autonomous driving in urban environments. In 2016 IEEE Intelligent Vehicles Symposium (IV). 38--43. DOI: http://dx.doi.org/10.1109/IVS.2016.7535361",
      "doi": "10.1109/IVS.2016.7535361"
    },
    {
      "text": "Matus Sucha, Daniel Dostal, and Ralf Risser. 2017. Pedestrian-driver communication and decision strategies at marked crossings. Accident Analysis and Prevention 102 (2017), 41--50. DOI: http://dx.doi.org/10.1016/j.aap.2017.02.018",
      "doi": ""
    },
    {
      "text": "Hugh R. Terry, Samuel G. Charlton, and John A. Perrone. 2008. The role of looming and attention capture in drivers' braking responses. Accident Analysis & Prevention 40, 4 (2008), 1375--1382. DOI: http://dx.doi.org/10.1016/j.aap.2008.02.009",
      "doi": ""
    },
    {
      "text": "Helmut Tiesler-Wittig. 2019. Functional Application, Regulatory Requirements and Their Future Opportunities for Lighting of Automated Driving Systems. Technical Report. DOI: http://dx.doi.org/10.4271/2019-01-0848",
      "doi": ""
    },
    {
      "text": "Andras Varhelyi. 1998. Drivers' speed behaviour at a zebra crossing: a case study. Accident Analysis & Prevention 30, 6 (1998), 731--743. DOI: http://dx.doi.org/10.1016/S0001--4575(98)00026--8",
      "doi": ""
    },
    {
      "text": "Erik Vinkhuyzen and Melissa Cefkin. 2016. Developing Socially Acceptable Autonomous Vehicles. In 2016 Ethnographic Praxis in Industry Conference Proceedings. 522--534. DOI: http://dx.doi.org/10.1111/1559--8918.2016.01108",
      "doi": ""
    },
    {
      "text": "Ian Walker. 2007. Drivers overtaking bicyclists: Objective data on the effects of riding position, helmet use, vehicle type and apparent gender. Accident Analysis & Prevention 39, 2 (2007), 417--425. DOI: http://dx.doi.org/10.1016/j.aap.2006.08.010",
      "doi": ""
    },
    {
      "text": "Annette Werner. 2018. New Colours for Autonomous Driving: An Evaluation of Chromaticities for the External Lighting Equipment of Autonomous Vehicles. ColourTurn 10, 3 (2018), 183--193. DOI: http://dx.doi.org/10.25538/tct.v0i1.692",
      "doi": ""
    },
    {
      "text": "Sonja Windhager, Dennis E. Slice, Katrin Schaefer, Elisabeth Oberzaucher, Truls Thorstensen, and Karl Grammer. 2008. Face to Face : The Perception of Automotive Designs. Human Nature 19, 4 (2008), 331--346. DOI: http://dx.doi.org/10.1007/s12110-008--9047-z",
      "doi": ""
    },
    {
      "text": "Thomas Winkle. 2016. Safety Benefits of Automated Vehicles: Extended Findings from Accident Research for Development, Validation and Testing. In Autonomous Driving: Technical, Legal and Social Aspects, Markus Maurer, J. Christian Gerdes, Barbara Lenz, and Hermann Winner (Eds.). Springer, Berlin, Heidelberg, 335--364. DOI: http://dx.doi.org/10.1007/978--3--662--48847--8_17",
      "doi": ""
    }
  ]
}