{
  "doi": "10.1145/3313831.3376431",
  "title": "Molder: An Accessible Design Tool for Tactile Maps",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Tactile materials are powerful teaching aids for students with visual impairments (VIs). To design these materials, designers must use modeling applications, which have high learning curves and rely on visual feedback. Today, Orientation and Mobility (O&M) specialists and teachers are often responsible for designing these materials. However, most of them do not have professional modeling skills, and many are visually impaired themselves. To address this issue, we designed Molder, an accessible design tool for interactive tactile maps, an important type of tactile materials that can help students learn O&M skills. A designer uses Molder to design a map using tangible input techniques, and Molder provides auditory feedback and high-contrast visual feedback. We evaluated Molder with 12 participants (8 with VIs, 4 sighted). After a 30-minute training session, the participants were all able to use Molder to design maps with customized tactile and interactive information.",
  "authors": [
    {
      "name": "Lei Shi",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658757652",
      "orcid": "missing"
    },
    {
      "name": "Yuhang Zhao",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/do/10.1145/contrib-81472651606/rel-imgonly/img_2060.jpg",
      "acmid": "81472651606",
      "orcid": "0000-0003-3686-695X"
    },
    {
      "name": "Ricardo Gonzalez Penuela",
      "institution": "Universidad de los Andes & Cornell Tech, Bogota, Colombia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526810",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Kupferstein",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659312048",
      "orcid": "missing"
    },
    {
      "name": "Shiri Azenkot",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466647758",
      "orcid": "0000-0002-6701-4066"
    }
  ],
  "references": [
    {
      "text": "Jérémy Albouys-Perrois, Jérémy Laviole, Carine Briant, and Anke Brock. 2018. Towards a Multisensory Augmented Reality Map for Blind and Low Vision People: a Participatory Design Approach. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 1--14. https://doi.org/10.1145/3173574.3174203",
      "doi": "10.1145/3173574.3174203"
    },
    {
      "text": "Amazon.com. Xenvo Pro Lens Kit for iPhone, Samsung, Pixel, Macro and Wide Angle Lens with LED Light and Travel Case: Camera & Photo. Retrieved May 2, 2019 from https://www.amazon.com/gp/product/B01A6D2JVI/ref=ppx_yo_dt_b_asin_title_o07_s00?ie=UTF8&psc=1",
      "doi": ""
    },
    {
      "text": "Apple. SFSpeechRecognizer - Speech | Apple Developer Documentation. Retrieved September 18, 2018 from https://developer.apple.com/documentation/speech/sfspeechrecognizer?language=objc",
      "doi": ""
    },
    {
      "text": "Apple. AVSpeechSynthesizer - AVFoundation | Apple Developer Documentation. Retrieved September 18, 2018 from https://developer.apple.com/documentation/avfoundation/avspeechsynthesizer?language=objc",
      "doi": ""
    },
    {
      "text": "Blender. Blender. Retrieved April 25, 2019 from https://www.blender.org/",
      "doi": ""
    },
    {
      "text": "Quentin Bonnard, Severin Lemaignan, Guillaume Zufferey, Andrea Mazzei, Sebastien Cuendet, Nan Li, Ayberk Ozgur, and Pierre Dillenbourg. 2013. Chilitags 2: Robust Fiducial Markers for Augmented Reality and Robotics.",
      "doi": ""
    },
    {
      "text": "Gary R. Bradski and Adrian. Kaehler. 2008. Learning OpenCV?: computer vision with the OpenCV library. O'Reilly.",
      "doi": ""
    },
    {
      "text": "Anke M. Brock. 2013. Touch the map!: designing interactive maps for visually impaired people. ACM SIGACCESS Accessibility and Computing, 105: 9--14. https://doi.org/10.1145/2444800.2444802",
      "doi": "10.1145/2444800.2444802"
    },
    {
      "text": "Anke M. Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity Improves Usability of Geographic Maps for Visually Impaired People. Human--Computer Interaction 30, 2: 156--194. https://doi.org/10.1080/07370024.2014.924412",
      "doi": "10.5555/2692791.2692794"
    },
    {
      "text": "Anke Brock, Philippe Truillet, Bernard Oriola, and Christophe Jouffrais. 2011. Usage of multimodal maps for blind people. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10), 247. https://doi.org/10.1145/1936652.1936699",
      "doi": "10.1145/1936652.1936699"
    },
    {
      "text": "Anke Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2012. Design and user satisfaction of interactive maps for visually impaired people. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 544--551. https://doi.org/10.1007/978--3--642--31534--3_80",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194: 4--7.",
      "doi": ""
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 131--138. https://doi.org/10.1145/2148131.2148160",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Transactions on Accessible Computing 8, 3: 1--28. https://doi.org/10.1145/2870640",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: opportunities and obstacles to 3D printing in special education environments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 107--114. https://doi.org/10.1145/2661334.2661365",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Julie Ducasse, Anke M Brock, and Christophe Jouffrais. 2018. Accessible Interactive Maps for Visually Impaired Users. In Mobility of Visually Impaired People. Springer, Cham, 537--584. https://doi.org/https://doi.org/10.1007/978--3--319--54446--5_17",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud, Anke M. Brock, Marc J.-M. Macé, Christophe Jouffrais, Mohamed Chetouani, Marco Fyfe Pietro Gillies, M-Carmen Juan, Christophe Jouffrais, Stéphanie Giraud, Anke M. Brock, and Marc J-M Macé. 2017. Map Learning with a 3D Printed Interactive Small-Scale Model: Improvement of Space and Text Memorization in Visually Impaired Students. Frontiers in Psychology 8: 930. https://doi.org/10.3389/fpsyg.2017.00930",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud, Philippe Truillet, Véronique Gaildrat, and Christophe Jouffrais. 2017. \"DIY\" prototyping of teaching materials for visually impaired children: Usage and satisfaction of professionals. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 515--524. https://doi.org/10.1007/978--3--319--58706--6_42",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann. 2016. LucentMaps: 3D Printed Audiovisual Tactile Maps for Blind and Visually Impaired People. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 81--90. https://doi.org/10.1145/2982142.2982163",
      "doi": "10.1145/2982142.2982163"
    },
    {
      "text": "Timo Götzelmann. 2018. Visually Augmented Audio-Tactile Graphics for Visually Impaired People. ACM Transactions on Accessible Computing 11, 8: 31. https://doi.org/10.1145/3186894",
      "doi": "10.1145/3186894"
    },
    {
      "text": "Timo Götzelmann and Aleksander Pavkovic. 2014. Towards automatically generated tactile detail maps by 3D printers for blind persons. In International Conference on Computers for Handicapped Persons, 1--7. https://doi.org/10.1007/978--3--319-08599--9_1",
      "doi": ""
    },
    {
      "text": "Noreen Grice, Carol Christian, Antonella Nota, and Perry Greenfield. 2015. 3D Printing Technology: A Unique Way of Making Hubble Space Telescope Images Accessible to Non-Visual Learners. Journal of Blindness Innovation and Research 5, 1. https://doi.org/10.5241/5--66",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, and Joaquim Lloveras. 2011. Universal design and visual impairment: Tactile products for heritage access. In Proceedings of the 18th International Conference on Engineering Design (ICED '11), Impacting Society Through Engineering Design, 155--164. Retrieved from http://www.scopus.com/inward/record.url?eid=2-s2.0--84858852744&partnerID=tZOtx3y1",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, and Joaquim Lloveras. 2014. Three-dimensional tactile symbols produced by 3D Printing: Improving the process of memorizing a tactile map key. British Journal of Visual Impairment 32, 3: 263--278. https://doi.org/10.1177/0264619614540291",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, Joaquim Lloveras, and Lola Merino. 2012. Visual Impairment and urban orientation. Pilot study with tactile maps produced through 3D Printing. Psyecology 3, 2: 239--250. https://doi.org/10.1174/217119712800337747",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang \"Anthony\" Chen, Tom Yeh, Scott E Hudson, Jennifer Mankoff, and Jeffrey P Bigham. 2017. Facade: Auto-generating Tactile Interfaces to Appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5826--5838. https://doi.org/10.1145/3025453.3025845",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible Maps for the Blind?: Comparing 3D Printed Models with Tactile Graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), Paper 198, 13 pages. https://doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Ke Huo, Vinayak, and Karthik Ramani. 2017. Window-Shaping: 3D Design Ideation by Creating on, Borrowing from, and Looking at the Physical World. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17)., 37--45. https://doi.org/10.1145/3024969.3024995",
      "doi": "10.1145/3024969.3024995"
    },
    {
      "text": "R Dan Jacobson. Navigating maps with little or no sight: An audio-tactile approach. Retrieved April 25, 2019 from https://www.aclweb.org/anthology/W98-0214",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking@ stemxcomet: teaching programming to blind students via 3D printing, crisis management, and twitter. In Proceedings of the 45th ACM technical symposium on Computer science education (SIGCSE '14), 247--252. https://doi.org/10.1145/2538862.2538975",
      "doi": ""
    },
    {
      "text": "Jeeeun Kim and Tom Yeh. 2015. Toward 3D-Printed Movable Tactile Pictures for Children with Visual Impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2815--2824. https://doi.org/10.1145/2702123.2702144",
      "doi": "10.1145/2702123.2702144"
    },
    {
      "text": "Michael A. Kolitsky. Making Tactile 3D Prints Talk. Retrieved September 20, 2018 from http://www.instructables.com/id/Making-Tactile-3D-Prints-Talk/?ALLSTEPS",
      "doi": ""
    },
    {
      "text": "Michael A. Kolitsky. 2014. 3D Printed Tactile Learning Objects: Proof of Concept. Journal of Blindness Innovation and Research 4, 1: 4--51.",
      "doi": ""
    },
    {
      "text": "A.F. Koschan. Perception-based 3D triangle mesh segmentation using fast marching watersheds. In 2003 IEEE Computer Society Conference on Computer Vision and Pattern Recognition, 2003. Proceedings., II-27-II--32. https://doi.org/10.1109/CVPR.2003.1211448",
      "doi": ""
    },
    {
      "text": "Louisheath. Braille Printer. Retrieved from https://github.com/louisheath/braille-printer",
      "doi": ""
    },
    {
      "text": "OpenSCAD. The Programmers Solid 3D CAD Modeller. Retrieved September 19, 2019 from https://www.openscad.org/",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. HaptoRender. Retrieved April 25, 2019 from https://wiki.openstreetmap.org/wiki/HaptoRender",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. OpenStreetMap. Retrieved from https://www.openstreetmap.org/",
      "doi": ""
    },
    {
      "text": "Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph Kider, Stefanie Mueller, Patrick Baudisch, and François Guimbretière. 2018. RoMA: Interactive Fabrication with Augmented Reality and a Robotic 3D Printer. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 1--12. https://doi.org/10.1145/3173574.3174153",
      "doi": "10.1145/3173574.3174153"
    },
    {
      "text": "Hanae Rateau, Yosra Rekik, Edward Lank, and Laurent Grisoni. 2018. Ether-Toolbars: Evaluating Off-Screen Toolbars for Mobile Interaction. In 23rd International Conference on Intelligent User Interfaces (IUI '18), 487--495. https://doi.org/10.1145/3172944.3172978",
      "doi": ""
    },
    {
      "text": "Andreas Reichinger, Anton Fuhrmann, Stefan Maierhofer, and Werner Purgathofer. 2016. Gesture-Based Interactive Audio Guide on Tactile Reliefs. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 91--100. https://doi.org/10.1145/2982142.2982176",
      "doi": "10.1145/2982142.2982176"
    },
    {
      "text": "Rhino. Rhino 6. Retrieved April 28, 2019 from https://www.rhino3d.com/",
      "doi": ""
    },
    {
      "text": "Jonathan Rowell and Simon Ungar. 2003. The world of touch: an international survey of tactile maps. Part 1: production. British Journal of Visual Impairment 21, 3: 98--104. https://doi.org/10.1177/026461960302100303",
      "doi": ""
    },
    {
      "text": "Johnny Saldana. 2015. The Coding Manual for Qualitative Researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15): 253--258. https://doi.org/10.1145/2807442.2807503",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Huiying Shen, Owen Edwards, Joshua Miele, and James M. Coughlan. 2013. CamIO. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13), 1--2. https://doi.org/10.1145/2513383.2513423",
      "doi": ""
    },
    {
      "text": "Linda Sheppard and Frances K. Aldrich. 2001. Tactile graphics in school education: perspectives from teachers. British Journal of Visual Impairment 19, 3: 93--97. https://doi.org/10.1177/026461960101900303",
      "doi": ""
    },
    {
      "text": "Lei Shi. 2015. Talkabel: A Labeling Method for 3D Printed Models. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 361--362. https://doi.org/10.1145/2700648.2811327",
      "doi": "10.1145/2700648.2811327"
    },
    {
      "text": "Lei Shi, Holly Lawson, Zhuohao Zhang, and Shiri Azenkot. 2019. Designing Interactive 3D Printed Models with Teachers of the Visually Impaired. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 14. https://doi.org/https://doi.org/10.1145/3290605.3300427",
      "doi": "10.1145/3290605.3300427"
    },
    {
      "text": "Lei Shi, Ross McLachlan, Yuhang Zhao, and Shiri Azenkot. 2016. Magic Touch: Interacting with 3D Printed Graphics. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 329--330. https://doi.org/10.1145/2982142.2982153",
      "doi": "10.1145/2982142.2982153"
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and Talker: An Accessible Labeling Toolkit for 3D Printed Models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4896--4907. https://doi.org/10.1145/2858036.2858507",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017. Markit and Talkit: A Low-Barrier Toolkit to Augment 3D Printed Models with Audio Annotations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17), 493--506. https://doi.org/10.1145/3126594.3126650",
      "doi": "10.1145/3126594.3126650"
    },
    {
      "text": "Alexa F. Siu, Son Kim, Joshua A. Miele, and Sean Follmer. 2019. shapeCAD: An Accessible 3D Modeling Workflow for the Blind and Visually-Impaired Via 2.5D Shape Displays. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '19), 342--354. https://doi.org/10.1145/3308561.3353782",
      "doi": "10.1145/3308561.3353782"
    },
    {
      "text": "SketchUp. SketchUp. Retrieved April 28, 2019 from https://www.sketchup.com/",
      "doi": ""
    },
    {
      "text": "Abigale Stangl, Chia-Lo Hsu, and Tom Yeh. 2015. Transcribing across the senses: community efforts to create 3D printable accessible tactile pictures for young children with visual impairments. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 127--137. https://doi.org/10.1145/2700648.2809854",
      "doi": "10.1145/2700648.2809854"
    },
    {
      "text": "Abigale Stangl, Jeeeun Kim, and Tom Yeh. 2014. 3D printed tactile picture books for children with visual impairments. In Proceedings of the 2014 conference on Interaction design and children (IDC '14), 321--324. https://doi.org/10.1145/2593968.2610482",
      "doi": "10.1145/2593968.2610482"
    },
    {
      "text": "Saiganesh Swaminathan, Thijs Roumen, Robert Kovacs, David Stangl, Stefanie Mueller, and Patrick Baudisch. 2017. Linespace: A sensemaking platform for the blind. Informatik-Spektrum 40, 6: 516--526. https://doi.org/10.1007/s00287-017--1070--1",
      "doi": ""
    },
    {
      "text": "TactileView. TactileView. Retrieved April 28, 2019 from http://www.tactileview.com/",
      "doi": ""
    },
    {
      "text": "Brandon Taylor, Anind Dey, Dan Siewiorek, and Asim Smailagic. 2016. Customizable 3D Printed Tactile Maps as Interactive Overlays. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 71--79. https://doi.org/10.1145/2982142.2982167",
      "doi": "10.1145/2982142.2982167"
    },
    {
      "text": "Brandon T. Taylor, Anind K. Dey, Dan P. Siewiorek, and Asim Smailagic. 2015. TactileMaps.net: A web interface for generating customized 3D-printable tactile maps. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 427--428. https://doi.org/10.1145/2700648.2811336",
      "doi": "10.1145/2700648.2811336"
    },
    {
      "text": "Thingiverse. Digital Designs for Physical Objects. Retrieved April 28, 2019 from https://www.thingiverse.com/",
      "doi": ""
    },
    {
      "text": "Tinkercad. Create 3D digital designs with online CAD. Retrieved April 28, 2019 from https://www.tinkercad.com/",
      "doi": ""
    },
    {
      "text": "Touch Mapper. Tactile Maps Easily. Retrieved April 25, 2019 from https://touch-mapper.org/en/",
      "doi": ""
    },
    {
      "text": "Vvoovv. Blender OSM. Retrieved from https://github.com/vvoovv/blender-osm",
      "doi": ""
    },
    {
      "text": "Henry B. Wedler, Sarah R. Cohen, Rebecca L. Davis, Jason G. Harrison, Matthew R. Siebert, Dan Willenbring, Christian S. Hamann, Jared T. Shaw, and Dean J. Tantillo. 2012. Applied Computational Chemistry for the Blind and Visually Impaired. Journal of Chemical Education 89, 11: 1400--1404. https://doi.org/10.1021/ed3000364",
      "doi": ""
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, Hans W. Gellersen, Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3855--3864. https://doi.org/10.1145/2556288.2557090",
      "doi": "10.1145/2556288.2557090"
    }
  ]
}