{
  "doi": "10.1145/3313831.3376293",
  "title": "Digital Juries: A Civics-Oriented Approach to Platform Governance",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "As concerns have grown regarding harmful content spread on social media, platform mechanisms for content moderation have become increasingly significant. However, many existing platform governance structures lack formal processes for democratic participation by users of the platform. Drawing inspiration from constitutional jury trials in many legal systems, this paper proposes digital juries as a civics-oriented approach for adjudicating content moderation cases. Building on existing theoretical models of jury decision-making, we outline a 5-stage model characterizing the space of design considerations in a digital jury process. We implement two examples of jury designs involving blind-voting and deliberation. From users who participate in our jury implementations, we gather informed judgments of the democratic legitimacy of a jury process for content moderation. We find that digital juries are perceived as more procedurally just than existing common platform moderation practices, but also find disagreement over whether jury decisions should be enforced or used as recommendations.",
  "authors": [
    {
      "name": "Jenny Fan",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527339",
      "orcid": "missing"
    },
    {
      "name": "Amy X. Zhang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640424",
      "orcid": "0000-0001-9462-9835"
    }
  ],
  "references": [
    {
      "text": "Kimberley R. Allison, Kay Bussey, and Naomi Sweller. 2019. 'I'm Going to Hell for Laughing at This': Norms, Humour, and the Neutralisation of Aggression in Online Communities. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 152 (Nov. 2019), 25 pages. DOI: http://dx.doi.org/10.1145/3359254",
      "doi": "10.1145/3359254"
    },
    {
      "text": "Jack M. Balkin. 2004. Virtual liberty: Freedom to design and freedom to play in virtual worlds. Virginia Law Review 90, 8 (2004), 2043--2098.",
      "doi": ""
    },
    {
      "text": "Robert V. Bartlett and Walter F. Baber. 2015. The Citizen Jury as a Deliberative Forum: Juries as Instruments of Democracy. In Consensus and Global Environmental Governance: Deliberative Democracy in Nature's Regime. The MIT Press, Cambridge, Massachusetts; London, England.",
      "doi": ""
    },
    {
      "text": "Susan Benesch. 2013. Dangerous Speech: A Proposal to Prevent Group Violence. (Feb 2013). https://perma.cc/K97E-9U78",
      "doi": ""
    },
    {
      "text": "Reuben Binns, Michael Veale, Max Van Kleek, and Nigel Shadbolt. 2017. Like trainer, like bot? Inheritance of bias in algorithmic content moderation. In International Conference on Social Informatics. Springer, Springer, New York, 405--415.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 24 (Dec. 2017), 19 pages. DOI: http://dx.doi.org/10.1145/3134659",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in Social Virtual Reality: Challenges for Platform Governance. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 100 (Nov. 2019), 25 pages. DOI: http://dx.doi.org/10.1145/3359202",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Andrew J. Bloeser, Carl Mccurley, and Jeffery J. Mondak. 2012. Jury Service as Civic Engagement: Determinants of Jury Summons Compliance. American Politics Research 40, 2 (2012), 179--204.",
      "doi": ""
    },
    {
      "text": "Robert M. Bond, Christopher J. Fariss, Jason J. Jones, Adam D. I. Kramer, Cameron Marlow, Jaime E. Settle, and James H. Fowler. 2012. A 61-million-person experiment in social influence and political mobilization. Nature 489, 7415 (2012).",
      "doi": ""
    },
    {
      "text": "Nathan Bos, Judy Olson, Darren Gergle, Gary Olson, and Zach Wright. 2002. Effects of Four Computer-mediated Communications Channels on Trust Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, NY, NY, USA, 135--140. DOI: http://dx.doi.org/10.1145/503376.503401",
      "doi": "10.1145/503376.503401"
    },
    {
      "text": "Ben Bradford, Florian Grisel, Tracey L. Meares, Emily Owens, Baron L. Pineda, Jacob N. Shapiro, Tom R. Tyler, and Danieli Evans Peterman. 2019. Report of the Facebook Data Transparency Advisory Group. The Justice Collaboratory, New Haven. https://perma.cc/4W9X-WJWA",
      "doi": ""
    },
    {
      "text": "William J. Brady, Julian A. Wills, John T. Jost, Joshua A. Tucker, and Jay J. Van Bavel. 2017. Emotion shapes the diffusion of moralized content in social networks. Proceedings of the National Academy of Sciences 114, 28 (2017), 7313--7318. DOI: http://dx.doi.org/10.1073/pnas.1618923114",
      "doi": ""
    },
    {
      "text": "Amy Bruckman, Pavel Curtis, Cliff Figallo, and Brenda Laurel. 1994. Approaches to managing deviant behavior in virtual communities. In CHI Conference Companion. ACM, New York, 183--184.",
      "doi": "10.1145/259963.260231"
    },
    {
      "text": "Moira Burke and Robert Kraut. 2008. Mopping up: modeling wikipedia promotion decisions. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 27--36.",
      "doi": "10.1145/1460563.1460571"
    },
    {
      "text": "Brian Butler, Elisabeth Joyce, and Jacqueline Pike. 2008. Don't look now, but we've created a bureaucracy: the nature and roles of policies and rules in wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1101--1110.",
      "doi": "10.1145/1357054.1357227"
    },
    {
      "text": "Justin Caffier. 2017. Get to Know the Memes of the Alt-Right and Never Miss a Dog-Whistle Again. (Jan. 2017). https://perma.cc/EM8H-AYVL",
      "doi": ""
    },
    {
      "text": "Robyn Caplan. 2018. Content or Context Moderation? Artisanal, Community-Reliant, and Industrial Approaches. (Nov. 2018). https://perma.cc/W6D3-HMPE",
      "doi": ""
    },
    {
      "text": "Michael X. Carpini, Fay L. Cook, and Lawrence R. Jacobs. 2004. Public deliberation, discursive participation, and citizen engagement: A review of the empirical literature. Annual Review Of Political Science 7, 1 (2004), 315--344.",
      "doi": ""
    },
    {
      "text": "Anupam Chander and Vivek Krishnamurthy. 2018. The Myth of Platform Neutrality. (Symposium Issue: Information Platforms and the Law). The Georgetown Law Technology Review 2, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Umashanthi Pavalanathan, Anirudh Srinivasan, Adam Glynn, Jacob Eisenstein, and Eric Gilbert. 2017. You Can't Stay Here: The Efficacy of Reddit's 2015 Ban Examined Through Hate Speech. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 1--22.",
      "doi": "10.1145/3134666"
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Shagun Jhaver, Hunter Charvat, Amy Bruckman, Cliff Lampe, Jacob Eisenstein, and Eric Gilbert. 2018. The Internet's Hidden Rules: An Empirical Study of Reddit Norm Violations at Micro, Meso, and Macro Scales. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 1--25.",
      "doi": "10.1145/3274301"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Quanze Chen, Jonathan Bragg, Lydia B. Chilton, and Daniel S. Weld. 2018. Cicero: Multi-Turn, Contextual Argumentation for Accurate Crowdsourcing. (2018).",
      "doi": ""
    },
    {
      "text": "Jennifer Cobbe. 2019. Algorithmic Censorship on Social Platforms: Power, Legitimacy, and Resistance. Legitimacy, and Resistance (Aug. 2019).",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Tarleton Gillespie. 2016. What is a flag for? Social media reporting tools and the vocabulary of complaint. New Media & Society 18, 3 (2016), 410--428.",
      "doi": ""
    },
    {
      "text": "Richard L. Daft and Robert H. Lengel. 1986. Organizational Information Requirements, Media Richness and Structural Design. Management Science 32, 5 (1986), 554--571.",
      "doi": "10.1287/mnsc.32.5.554"
    },
    {
      "text": "Norman Dalkey and Olaf Helmer. 1963. An experimental application of the Delphi method to the use of experts. Management science 9, 3 (1963), 458--467.",
      "doi": ""
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and Dynamics of Mechanical Turk Workers. In Proceedings of the Eleventh ACM International Conference on web search and data mining (WSDM '18), Vol. 2018-. ACM, 135--143.",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Joan Donovan. 2019. How Hate Groups' Secret Sound System Works. (Mar 2019). https://perma.cc/9L5J-ZLAC",
      "doi": ""
    },
    {
      "text": "Ryan Drapeau, Lydia B. Chilton, Jonathan Bragg, and Daniel S. Weld. 2016. MicroTalk: Using Argumentation to Improve Crowdsourcing Accuracy. In HCOMP.",
      "doi": ""
    },
    {
      "text": "Kristen Eichensehr. 2019. Digital Switzerlands. University of Pennsylvania Law Review 167 (2019), 665--732. Issue 3.",
      "doi": ""
    },
    {
      "text": "Joshua M. Epstein. 2013. Agent_Zero: Toward Neurocognitive Foundations for Generative Social Science. Princeton University Press, Princeton, New Jersey ; Oxfordshire, England.",
      "doi": ""
    },
    {
      "text": "Cynthia Farina, Hoi Kong, Cheryl Blake, Mary Newhart, and Nik Luka. 2014. Democratic Deliberation in the Wild: the McGill Online Design Studio and the RegulationRoom Project. Fordham Urban Law Journal 41 (2014), 1527--1759.",
      "doi": ""
    },
    {
      "text": "Cynthia Farrar, James S. Fishkin, Donald P. Green, Christian List, Robert C. Luskin, and Elizabeth Levy Paluck. 2010. Disaggregating Deliberation's Effects: An Experiment within a Deliberative Poll. British Journal of Political Science 40, 2 (2010), 333--347.",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Joshua McCann, Kyle Frye, and Jed R. Brubaker. 2018. Reddit rules! characterizing an ecosystem of governance. In Twelfth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "James Fishkin, Nikhil Gargl, Lodewijk Gelauffl, Ashish Goell, Kamesh Munagala, Sukolsak Sakshuwong, Alice Siu, and Sravya Yandamuri. 2019. Deliberative Democracy with the Online Deliberation Platform. (2019). https://perma.cc/C53W-PA5L",
      "doi": ""
    },
    {
      "text": "Andrea Forte, Vanesa Larco, and Amy Bruckman. 2009. Decentralization in Wikipedia governance. Journal of Management Information Systems 26, 1 (2009), 49--72.",
      "doi": "10.2753/MIS0742-1222260103"
    },
    {
      "text": "Seth Frey, P. M. Krafft, and Brian Keegan. 2019. \"This Place Does What It Was Built For\": Designing Digital Institutions for Participatory Change. Proceedings of the ACM on Human-Computer Interaction 3 (Nov. 2019), 1--31. DOI: http://dx.doi.org/10.1145/3359134",
      "doi": "10.1145/3359134"
    },
    {
      "text": "Seth Frey and Robert W. Sumner. 2019. Emergence of integrated institutions in a large population of self-governing communities. PloS One 14, 7 (2019), e0216335.",
      "doi": ""
    },
    {
      "text": "John Gastil. 2010. The Jury and Democracy: How Jury Deliberation Promotes Civic Engagement and Political Participation. Oxford University Press, Oxford ; New York.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2015. Platforms intervene. Social Media + Society 1, 1 (2015), 2056305115580479.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the internet : platforms, content moderation, and the hidden decisions that shape social media. Yale University Press, New Haven.",
      "doi": ""
    },
    {
      "text": "Jesse Graham, Jonathan Haidt, Sena Koleva, Matt Motyl, Ravi Iyer, Sean Wojcik, and Peter Ditto. 2013. Moral Foundations Theory: The Pragmatic Validity of Moral Pluralism. Advances In Experimental Social Psychology, Vol 47 47 (2013), 55--130.",
      "doi": ""
    },
    {
      "text": "James Grimmelmann. 2015. The Virtues of Moderation. Yale Journal of Law and Technology 17 (2015), 42--368.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R. Stuart Geiger, Jonathan T. Morgan, and John Riedl. 2013. The rise and decline of an open collaboration system: How Wikipedia@MISCs reaction to popularity is causing its decline. American Behavioral Scientist 57, 5 (2013), 664--688.",
      "doi": ""
    },
    {
      "text": "Valerie P. Hans, John Gastil, and Traci Feller. 2014. Deliberative Democracy and the American Civil Jury. 11 (2014), 697--894.",
      "doi": ""
    },
    {
      "text": "Stephan Hartmann and Soroush Rafiee Rad. 2018. Voting, deliberation and truth. Synthese 195, 3 (2018), 1273--1293.",
      "doi": ""
    },
    {
      "text": "Nigel Harvey. 2008. Blackwell Handbook of Judgment and Decision Making. Wiley, Hoboken.",
      "doi": ""
    },
    {
      "text": "Reid Hastie. 1983. Inside the Jury. Harvard University Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Margaret Levi Henry Farrell and Tim O'Reilly. 2018. Mark Zuckerberg runs a nation-state, and he's the king. (April 2018). https://perma.cc/WE8M-2SDT",
      "doi": ""
    },
    {
      "text": "Mitchel N. Herian, Joseph A. Hamm, Alan J. Tomkins, and Lisa M. Pytlik Zillig. 2012. Public Participation, Procedural Fairness, and Evaluations of Local Governance: The Moderating Role of Uncertainty. Journal of Public Administration Research and Theory 22, 4 (2012), 815--840.",
      "doi": ""
    },
    {
      "text": "Hossein Hosseini, Sreeram Kannan, Baosen Zhang, and Radha Poovendran. 2017. Deceiving Google's Perspective API Built for Detecting Toxic Comments. CoRR abs/1702.08138 (2017). http://arxiv.org/abs/1702.08138",
      "doi": ""
    },
    {
      "text": "Jane Im, Amy X. Zhang, Christopher J. Schilling, and David Karger. 2018. Deliberation and Resolution on Wikipedia: A Case Study of Requests for Comments. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 74.",
      "doi": "10.1145/3274343"
    },
    {
      "text": "Irving L Janis. 1972. Victims of groupthink: A psychological study of foreign-policy decisions and fiascoes. (1972).",
      "doi": ""
    },
    {
      "text": "Jigsaw. 2019. Perspective API. (2019). https://perspectiveapi.com/",
      "doi": ""
    },
    {
      "text": "Stanley M. Kaplan and Carolyn Winget. 1992. The occupational hazards of jury duty. The Bulletin of the American Academy of Psychiatry and the Law 20, 3 (1992).",
      "doi": ""
    },
    {
      "text": "David Kaye. 2019. Speech Police: The Global Struggle to Govern the Internet. (2019).",
      "doi": ""
    },
    {
      "text": "Sara Kiesler and Lee Sproull. 1992. Group decision making and communication technology. Organizational Behavior and Human Decision Processes 52, 1 (1992), 96--123.",
      "doi": ""
    },
    {
      "text": "Kate Klonick. 2018. The New Governors: The People, Rules, and Processes Governing Online Speech. Harvard Law Review 131, 6 (2018), 598--670.",
      "doi": ""
    },
    {
      "text": "Jason Koebler and Joseph Cox. 2018. The Impossible Job: Inside Facebook's Struggle to Moderate Two Billion People. (aug 2018). https://perma.cc/PZ7W-PDYY",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2017. When Code Governs Community. In 50th Hawaii International Conference on System Sciences, HICSS 2017, Hilton Waikoloa Village, Hawaii, USA, January 4--7, 2017. 1--9.",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Xinning Gui, Shaozeng Zhang, and Bonnie Nardi. 2017. Managing Disruptive Behavior Through Non-Hierarchical Governance: Crowdsourcing in League of Legends and Weibo. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 62 (Dec. 2017), 17 pages. DOI: http://dx.doi.org/10.1145/3134697",
      "doi": "10.1145/3134697"
    },
    {
      "text": "Yubo Kou and Bonnie Nardi. 2013. Regulating Anti-Social Behavior on the Internet: The Example of League of Legends. (Feb. 12--15 2013), 616--622.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Bonnie Nardi. 2014. Governance in League of Legends: A Hybrid System. Foundations of Digital Games (April 3--7 2014).",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut. 2011. Building Successful Online Communities: Evidence-based Social Design. MIT Press, Cambridge, Mass.",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Travis Kriplean, Jonathan Morgan, Deen Freelon, Alan Borning, and Lance Bennett. 2012. Supporting Reflective Public Thought with Considerit. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). Association for Computing Machinery, New York, NY, USA, 265--274. DOI: http://dx.doi.org/10.1145/2145204.2145249",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring cyberbullying and other toxic behavior in team competition online games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3739--3748.",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Cliff Lampe and Paul Resnick. 2004. Slash(dot) and burn: distributed moderation in a large online conversation space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, 543--550.",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Melvin J. Lerner, E. Allan Lind, and Tom R. Tyler. 1988. Social Psychology of Procedural Justice. Springer, Boston.",
      "doi": ""
    },
    {
      "text": "Lawrence Lessig. 2006. Code version 2.0 ([2nd ed.]. ed.). Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Natasha Lomas. 2015. Can Civil Comments Kill the Internet Troll? (Oct. 2015). https://perma.cc/Z5XH-C4KP",
      "doi": ""
    },
    {
      "text": "J. Nathan Matias. 2019. The Civic Labor of Volunteer Moderators Online. Social Media + Society 5, 2 (2019). https://doi.org/10.1177/2056305119836778",
      "doi": ""
    },
    {
      "text": "Peter Muhlberger. 2005. The Virtual Agora Project: A Research Design for Studying Democratic Deliberation. Journal of Public Deliberation 1, 1 (2005).",
      "doi": ""
    },
    {
      "text": "Charlan Nemeth. 1977. Interactions Between Jurors as a Function of Majority vs. Unanimity Decision Rules. Journal of Applied Social Psychology 7, 1 (1977), 38--56.",
      "doi": ""
    },
    {
      "text": "Elinor Ostrom. 1990. Governing the commons : the evolution of institutions for collective action. Cambridge University Press, Cambridge ; New York.",
      "doi": ""
    },
    {
      "text": "David G. Post. 1995. Anarchy, State, and the Internet: An Essay on Law-Making in Cyberspace. Journal of Online Law 1995 (1995), 3--5.",
      "doi": ""
    },
    {
      "text": "Paul Resnick. 2001. Beyond bowling together: Sociotechnical capital. HCI in the New Millennium 77 (2001), 247--272.",
      "doi": ""
    },
    {
      "text": "Sarah T. Roberts. 2016. Commercial content moderation: digital laborers' dirty work. In The Intersectional Internet: Race, Sex, Class and Culture Online, Safiya Umoja Noble and Brendesha M. Tynes (Eds.). Peter Lang Publishing, New York, Chapter 8.",
      "doi": ""
    },
    {
      "text": "Sarah T. Roberts. 2019. Behind the screen : content moderation in the shadows of social media. Yale University Press, New Haven.",
      "doi": ""
    },
    {
      "text": "Mike Schaekermann, Joslin Goh, Kate Larson, and Edith Law. 2018. Resolvable vs. Irresolvable Disagreement: A Study on Worker Deliberation in Crowd Work. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 1--19.",
      "doi": "10.1145/3274423"
    },
    {
      "text": "Richard Seltzer. 1999. The Vanishing Juror: Why Are There Not Enough Available Jurors? The Justice System Journal 20, 3 (1999), 203--218.",
      "doi": ""
    },
    {
      "text": "Henry Silverman. 2019. Helping fact-checkers identify false claims faster. (Dec. 2019). https://perma.cc/S7F6-WUV4",
      "doi": ""
    },
    {
      "text": "Miriam Solomon. 2006. Groupthink versus the wisdom of crowds: The social epistemology of deliberation and dissent. The Southern Journal of Philosophy 44, S1 (2006), 28--42.",
      "doi": ""
    },
    {
      "text": "Lee Sproull. 2011. Prosocial Behavior on the Net. Daedalus 140, 4 (2011), 140--153.",
      "doi": ""
    },
    {
      "text": "Cass R. Sunstein. 2002. The Law of Group Polarization. Journal of Political Philosophy 10, 2 (2002), 175--195.",
      "doi": ""
    },
    {
      "text": "Nicolas Suzor. 2018. Digital constitutionalism: Using the rule of law to evaluate the legitimacy of governance by platforms. Social Media + Society 4, 3 (2018), 2056305118787812.",
      "doi": ""
    },
    {
      "text": "Nabiha Syed and Ben Smith. 2016. A First Amendment For Social Platforms. (Jun 2016). https://perma.cc/THC3-UNQ4",
      "doi": ""
    },
    {
      "text": "Lynne Tirrell. 2018. Toxic Speech: Inoculations and Antidotes. Southern Journal of Philosophy 56, S1 (2018), 116--144.",
      "doi": ""
    },
    {
      "text": "Tom Tyler. 1988. What Is Procedural Justice? Criteria Used by Citizens to Assess the Fairness of Legal Procedures. Law and Society Review 22, 1 (1988), 103--103.",
      "doi": ""
    },
    {
      "text": "Tom R. Tyler. 1989. The Psychology of Procedural Justice: A Test of the Group-Value Model. Journal of Personality and Social Psychology 57, 5 (1989), 830--838.",
      "doi": ""
    },
    {
      "text": "Ted Ullyot. 2009. Results of the Inaugural Facebook Site Governance Vote. (Apr 2009). https://web.archive.org/web/20090430215524/http://blog.facebook.com/blog.php?post=79146552130",
      "doi": ""
    },
    {
      "text": "Claire Wardle and Hossein Derakhshan. 2017. Information Disorder: Toward an interdisciplinary framework for research and policy making. Council of Europe Report 27 (2017).",
      "doi": ""
    },
    {
      "text": "Morten Warncke-Wang, Vladislav R. Ayukaev, Brent Hecht, and Loren G. Terveen. 2015. The success and failure of quality improvement projects in peer production communities. In Proceedings of the 2015 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 743--756.",
      "doi": ""
    },
    {
      "text": "Ryan Winter and Edie Greene. 2008. Juror Decision-Making. Wiley Online Library, 739 -- 761. DOI: http://dx.doi.org/10.1002/9780470713181.ch28",
      "doi": ""
    },
    {
      "text": "Savvas Zannettou, Tristan Caulfield, Jeremy Blackburn, Emiliano De Cristofaro, Michael Sirivianos, Gianluca Stringhini, and Guillermo Suarez-Tangil. 2018. On the Origins of Memes by Means of Fringe Web Communities. CoRR abs/1805.12512 (2018). http://arxiv.org/abs/1805.12512",
      "doi": ""
    },
    {
      "text": "Amy X. Zhang, Lea Verou, and David Karger. 2017. Wikum: Bridging Discussion Forums and Wikis Using Recursive Summarization. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, 2082--2096.",
      "doi": "10.1145/2998181.2998235"
    },
    {
      "text": "Mark Zuckerberg. 2018. A Blueprint for Content Governance and Enforcement. (nov 2018). https://perma.cc/TC7X-YUXF",
      "doi": ""
    }
  ]
}