{
  "doi": "10.1145/3313831.3376606",
  "title": "\"How do I make this thing smile?\": An Inventory of Expressive Nonverbal Communication in Commercial Social Virtual Reality Platforms",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Despite the proliferation of platforms for social Virtual Reality (VR) communicating emotional expression via an avatar remains a significant design challenge. In order to better understand the design space for expressive Nonverbal Communication (NVC) in social VR we undertook an inventory of the ten most prominent social VR platforms. Our inventory identifies the dominant design strategies for movement, facial control, and gesture in commercial VR applications, and identifies opportunities and challenges for future design and research into social expression in VR. Specifically, we highlight the paucity of interaction paradigms for facial expression and the near nonexistence of meaningful control over ambient aspects of nonverbal communication such as posture, pose, and social status.",
  "tags": [
    "social interactions",
    "nonverbal communication",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Theresa Jean Tanenbaum",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81388594272/rel-imgonly/20210704_104248.jpg",
      "acmid": "81388594272",
      "orcid": "missing"
    },
    {
      "name": "Nazely Hartoonian",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529340",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Bryan",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527853",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sang Chul Ahn, Ig-Jae Kim, Hyoung-Gon Kim, Yong-Moo Kwon, and Heedong Ko. 2001. Audience Interaction for Virtual Reality Theater and Its Implementation. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '01), 41--45. https://doi.org/10.1145/505008.505016",
      "doi": "10.1145/505008.505016"
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2001. Equilibrium Theory Revisited: Mutual Gaze and Personal Space in Virtual Environments. Presence 10, 6: 583--598.",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2003. Interpersonal Distance in Immersive Virtual Environments. Personality and Social Psychology Bulletin 29: 819--833.",
      "doi": "10.1145/3452918.3458804"
    },
    {
      "text": "Irmgard Bartenieff. 1980. Body Movement: Coping with the Enviornment. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Steve Benford, John Bowers, Lennart E. Fahl´en, Chris Greenhalgh, and Dave Snowdon. 1997. Embodiments, avatars, clones and agents for multi-user, multi-sensory virtual worlds. Multimedia Systems 5: 93--104.",
      "doi": "10.1007/s005300050045"
    },
    {
      "text": "Ray L. Birdwhistell. 1952. Introduction to Kinesics: an annotation system for analysis of body motion and gesture. Louisville University Press, Louisville, KY.",
      "doi": ""
    },
    {
      "text": "Jim Bizzocchi and Theresa Jean Tanenbaum. 2011. Well read: applying close reading techniques to gameplay experiences. In Drew Davidson (ed.). ETC Press, Pittsburgh, PA, USA, 262--290. Retrieved October 10, 2018 from http://dl.acm.org/citation.cfm?id=2031858.2031881",
      "doi": ""
    },
    {
      "text": "Staffan Bjork and Jussi Holopainen. 2005. Patterns in game design. Charles River Media Hingham.",
      "doi": ""
    },
    {
      "text": "Sarah Blackburn. 2017. Top Five VR Social Experiences. VRFocus. Retrieved April 3, 2019 from https://www.vrfocus.com/2017/08/top-five-vr-social-experiences/",
      "doi": ""
    },
    {
      "text": "Costas Boletsis. 2017. The New Era of Virtual Reality Locomotion: A Systematic Literature Review of Techniques and a Proposed Typology. Multimodal Technologies and Interaction 1, 4: 24. https://doi.org/10.3390/mti1040024",
      "doi": ""
    },
    {
      "text": "Dario Bombari, Marianne Schmid Mast, Elena Canadas, and Manuel Bachmann. 2015. Studying social interactions through immersive virtual environment technology: virtues, pitfalls, and future challenges. Frontiers in Psychology 6. https://doi.org/10.3389/fpsyg.2015.00869",
      "doi": ""
    },
    {
      "text": "Jerome Bruner. 1987. Life as Narrative. Social Research: An International Quarterly 54, 1: 11--32.",
      "doi": ""
    },
    {
      "text": "Jerome Bruner. 1991. The Narrative Construction of Reality. Critical Inquiry 18, 1: 1--21.",
      "doi": ""
    },
    {
      "text": "Tuncay Cakmak and Holger Hager. 2014. Cyberith virtualizer: a locomotion device for virtual reality. In ACM SIGGRAPH 2014 Emerging Technologies, 6.",
      "doi": "10.1145/2614066.2614105"
    },
    {
      "text": "J. Cassell and H. Vilhjálmsson. 1999. Fully Embodied Conversational Avatars: Making Communicative Behaviors Autonomous. Autonomous Agents and Multi-Agent Systems 2, 1: 45--64.",
      "doi": "10.1023/A%3A1010027123541"
    },
    {
      "text": "Justine Cassell. 1989. Embodied Conversation: Integrating Face and Gesture into Automatic Spoken Dialogue Systems. Retrieved October 24, 2009 from http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.34.7936",
      "doi": ""
    },
    {
      "text": "Bruce Damer. 1997. Avatars!; Exploring and Building Virtual Worlds on the Internet. Peachpit Press, Berkeley, CA, USA.",
      "doi": ""
    },
    {
      "text": "Rudolph P. Darken, William R. Cockayne, and David Carmein. 1997. The omni-directional treadmill: a locomotion device for virtual worlds.",
      "doi": ""
    },
    {
      "text": "M. Eddy. 2009. A brief history of somatic practices and dance: historical development of the field of somatic education and its relationship to dance. Journal of Dance and Somatic Practices 1, 1: 5--27.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace V. Friesen. 1981. The Repertoire of Nonverbal Behavior: Categories, Origins, Usage, and Coding. In Nonverbal Communication, Interaction, and Gesture, Thomas A. Sebeok, Jean Umiker-Sebeok and Adam Kendon (eds.). Mouton Publishers, The Hague.",
      "doi": ""
    },
    {
      "text": "Robert Giusti, Kenneth Hullett, and Jim Whitehead. 2012. Weapon Design Patterns in Shooter Games. In Proceedings of the First Workshop on Design Patterns in Games (DPG '12), 3:1--3:7. https://doi.org/10.1145/2427116.2427119",
      "doi": "10.1145/2427116.2427119"
    },
    {
      "text": "David Gochfeld, Corinne Brenner, Kris Layng, Sebastian Herscher, Connor DeFanti, Marta Olko, David Shinn, Stephanie Riggs, Clara Fernández-Vara, and Ken Perlin. 2018. Holojam in Wonderland: Immersive Mixed Reality Theater. Leonardo 51, 4: 362--367. https://doi.org/10.1162/leon_a_01644",
      "doi": ""
    },
    {
      "text": "Lindsay D. Grace. 2013. Affection Games in Digital Play: A Content Analysis of Web Playable Games. In DiGRA Conference.",
      "doi": ""
    },
    {
      "text": "Arline Groenewald. 2017. We Visit The Best Free PC Social VR Apps/Games Available Now. VR The Gamers. Retrieved April 3, 2019 from http://vrthegamers.com/best-free-social-vr-apps-games/",
      "doi": ""
    },
    {
      "text": "Anthony Guye-Vuillieme, Tolga K. Capin, Igor Sunday Pandzic, Nadia Magnenat, and Daniel Thalmann. 1999. Nonverbal communication interface for collaborative virtual environments. Virtual Reality Journal 4: 49--59.",
      "doi": "10.1007/BF01434994"
    },
    {
      "text": "Edward T. Hall. 1966. The Hidden Dimension. Anchor Books.",
      "doi": ""
    },
    {
      "text": "Linjia He, Hongsong Li, Tong Xue, Deyuan Sun, Shoulun Zhu, and Gangyi Ding. 2018. Am I in the Theater?: Usability Study of Live Performance Based Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (VRST '18), 28:1--28:11. https://doi.org/10.1145/3281505.3281508",
      "doi": "10.1145/3281505.3281508"
    },
    {
      "text": "H. Iwata. 1999. The Torus Treadmill: realizing locomotion in VEs. IEEE Computer Graphics and Applications 19, 6: 30--35. https://doi.org/10.1109/38.799737",
      "doi": "10.1109/38.799737"
    },
    {
      "text": "Hiroo Iwata and Takashi Fujii. 1996. Virtual perambulator: a novel interface device for locomotion in virtual environment. In Proceedings of the IEEE 1996 Virtual Reality Annual International Symposium, 60--65.",
      "doi": ""
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Hiroyuki Fukushima, and Haruo Noma. 2005. CirculaFloor [locomotion interface]. IEEE Computer Graphics and Applications 25, 1: 64--67.",
      "doi": "10.1109/MCG.2005.5"
    },
    {
      "text": "Keith Johnstone. 1999. Impro for Storytellers. Routledge/Theatre Arts Books.",
      "doi": ""
    },
    {
      "text": "Stephen Jolly. 2000. Understanding Body Language: Birdwhistell's Theory of Kinesics. Corporate Communications: An International Journal 5, 3: 133--139.",
      "doi": ""
    },
    {
      "text": "Jen Karner. 2017. The Best VR social apps to share with friends. VRHeads. Retrieved April 3, 2019 from https://www.vrheads.com/best-vr-social-apps-share-friends",
      "doi": ""
    },
    {
      "text": "J. S. Kestenberg. 1979. The role of movement patterns in development. Dance Notation Bureau, Inc., New York.",
      "doi": ""
    },
    {
      "text": "SJ Kim. 2018. List Of The Most Popular Social VR Platforms. VR News, Games, And Reviews. Retrieved April 3, 2019 from https://www.vrandfun.com/popular-social-vr-platform-list/",
      "doi": ""
    },
    {
      "text": "Anya Kolesnichenko, Joshua McVeigh-Schultz, and Katherine Isbister. 2019. Understanding Emerging Design Practices for Avatar Systems in the Commercial Social VR Ecology. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 241--252. https://doi.org/10.1145/3322276.3322352",
      "doi": "10.1145/3322276.3322352"
    },
    {
      "text": "George Lakoff and Mark Johnson. 1980. Metaphors We Live By. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "W. Lamb and E. Watson. 1987. Body code: The meaning in movement. Princeton Book Company.",
      "doi": ""
    },
    {
      "text": "Lara Maister, Mel Slater, Maria V. Sanchez-Vives, and Manos Tsakiris. 2015. Changing bodies changes minds: owning another body affects social cognition. Trends in Cognitive Sciences 19, 1: 6--12. https://doi.org/10.1016/j.tics.2014.11.001",
      "doi": ""
    },
    {
      "text": "Vera Maletic. 1987. Body - Space - Expression: The Development of Rudolf Laban's Movement and Dance Concepts. Walter de Gruyter & Co., Berlin.",
      "doi": ""
    },
    {
      "text": "David McNeill. 1992. Hand and mind: what gestures reveal about thought. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "David McNeill and Susan Duncan. 2000. Growth points in thinking-for-speaking. In Language and Gesture, David McNeill (ed.). Cambrige University Press, Cambridge, 162--185.",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz, Elena Márquez Segura, Nick Merrill, and Katherine Isbister. 2018. What's It Mean to \"Be Social\" in VR?: Mapping the Social VR Design Ecology. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS '18 Companion), 289--294. https://doi.org/10.1145/3197391.3205451",
      "doi": "10.1145/3197391.3205451"
    },
    {
      "text": "Mark Metry. 2017. Top 7 Social VR Networks You Can Hang out in Now. VU Dream. Retrieved April 3, 2019 from http://www.vudream.com/top-7-social-vr-networks-you-can-hang-out-in-now/",
      "doi": ""
    },
    {
      "text": "Jacquelyn Ford Morie. 2014. Avatar appearance as prima facie non-verbal communication. In Nonverbal Communication in Virtual Worlds, Theresa Jean Tanenbaum, Magy Seif El-Nasr and Michael Nixon (eds.). ETC Press, Pittsburgh, PA, USA, 77--102. Retrieved April 8, 2019 from http://dl.acm.org/citation.cfm?id=2812748.2812755",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A Longitudinal Study of Small Group Interaction in Social Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (VRST '18), 22:1--22:10. https://doi.org/10.1145/3281505.3281527",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Brian Myers. 2017. Friends With Benefits: Plausible Optimism and the Practice of Teabagging in Video Games. Games and Culture: 1555412017732855. https://doi.org/10.1177/1555412017732855",
      "doi": ""
    },
    {
      "text": "S. H. Oh and T. K. Whangbo. 2017. A study on the effective interaction method to improve the presence in social virtual reality game. In 2017 4th International Conference on Computer Applications and Information Processing Technology (CAIPT), 1--2. https://doi.org/10.1109/CAIPT.2017.8320715",
      "doi": ""
    },
    {
      "text": "Ken Perlin and Athomas Goldberg. 1996. Improv: A System for Scripting Interactive Actors in Virtual Worlds. In Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '96), 205--216. https://doi.org/10.1145/237170.237258",
      "doi": "10.1145/237170.237258"
    },
    {
      "text": "T. S. Perry. 2016. Virtual reality goes social. IEEE Spectrum 53, 1: 56--57. https://doi.org/10.1109/MSPEC.2016.7367470",
      "doi": "10.1109/MSPEC.2016.7367470"
    },
    {
      "text": "Pierre Pita. 2017. List of Social VR Apps and Projects. Virtual Reality Times. Retrieved April 3, 2019 from https://virtualrealitytimes.com/2017/04/16/social-vr/",
      "doi": ""
    },
    {
      "text": "Fabio Pittarello and Eugenio Franchin. 2016. PlayVR: A VR Experience for the World of Theater. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16), 338--339. https://doi.org/10.1145/2909132.2926063",
      "doi": "10.1145/2909132.2926063"
    },
    {
      "text": "Ralph Schroeder. 2002. Social Interaction in Virtual Environments: Key Issues, Common Themes, and a Framework for Research. In The Social Life of Avatars: Presence and Interaction in Shared Virtual Environments, Ralph Scroeder (ed.). Springer-Verlag, London, 1--18.",
      "doi": ""
    },
    {
      "text": "Author Ryan Schultz. 2018. A Complete List of Every Social VR Space and Virtual World Platform I Have Written About on The RyanSchultz.com Blog. Ryan Schultz. Retrieved April 3, 2019 from https://ryanschultz.com/2018/05/10/a-complete-list-of-every-social-vr-space-and-virtual-world-platform-i-have-written-about-on-the-ryanschultz-com-blog/",
      "doi": ""
    },
    {
      "text": "Author Ryan Schultz. 2018. UPDATED: A Comparison Chart of Twelve Popular Social VR Platforms. Ryan Schultz. Retrieved April 3, 2019 from https://ryanschultz.com/2018/10/22/a-comparison-chart-of-twelve-popular-social-vr-platforms/",
      "doi": ""
    },
    {
      "text": "Nicola S. Schutte and Emma J. Stilinovi?. 2017. Facilitating empathy through virtual reality. Motivation and Emotion 41, 6: 708--712. https://doi.org/10.1007/s11031-017--9641--7",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr and Huaxin Wei. 2008. Exploring Non-verbal Behavior Models for Believable Characters. In Interactive Storytelling (Lecture Notes in Computer Science), 71--82.",
      "doi": ""
    },
    {
      "text": "Koichi Shimizu, Gaku Sueta, Kentaro Yamaoka, Kazuki Sawamura, Yujin Suzuki, Keisuke Yoshida, Vibol Yem, Yasushi Ikei, Tomohiro Amemiya, Makoto Sato, Koichi Hirota, and Michiteru Kitazaki. 2018. FiveStar VR: Shareable Travel Experience Through Multisensory Stimulation to the Whole Body. In SIGGRAPH Asia 2018 Virtual & Augmented Reality (SA '18), 2:1--2:2. https://doi.org/10.1145/3275495.3275502",
      "doi": "10.1145/3275495.3275502"
    },
    {
      "text": "Husain Sumra. 2017. Social Reality: From Facebook Spaces to Altspace, VR social apps compared. Wareable. Retrieved April 3, 2019 from https://www.wareable.com/vr/best-virtual-reality-social-experiences-967",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Magy Seif El-Nasr, and Michael Nixon. 2014. Nonverbal Communication in Virtual Worlds: Understanding and Designing Expressive Characters. ETC Press. Retrieved from http://press.etc.cmu.edu/content/nonverbal-communication-virtual-worlds-understanding-and-designing-expressive-characters",
      "doi": ""
    },
    {
      "text": "B. Tarr, M. Slater, and E. Cohen. 2018. Synchrony and social connection in immersive Virtual Reality. Scientific Reports 8, 1: 3693. https://doi.org/10.1038/s41598-018--21765--4",
      "doi": ""
    },
    {
      "text": "T. L. Taylor. 2002. Living Digitally: Embodiment in Virtual Worlds. In The Social Life of Avatars: Presence and Interaction in Shared Virtual Environments, Ralph Scroeder (ed.). Springer-Verlag, London, 40--62.",
      "doi": "10.5555/505799.505802"
    },
    {
      "text": "Mickey Thibault. 2018. VR Social Networks will be all the rage in 2018. Mickey Thibault. Retrieved April 3, 2019 from https://medium.com/@tickarawr/vr-social-networks-will-be-all-the-rage-in-2018-fda5093c65",
      "doi": ""
    },
    {
      "text": "Justus Thies, Michael Zollhöfer, Marc Stamminger, Christian Theobalt, and Matthias Nießner. 2016. FaceVR: Real-Time Facial Reenactment and Eye Gaze Control in Virtual Reality. arXiv:1610.03151 [cs]. Retrieved April 8, 2019 from http://arxiv.org/abs/1610.03151",
      "doi": ""
    },
    {
      "text": "Luiz Velho, Leonardo Carvalho, and Djalma Lucio. 2018. VR Kino+ Theater: from the ancient greeks into the future of media. In Proceedings of the Conference on Computer Animation, 9--10.",
      "doi": ""
    },
    {
      "text": "Jeffrey Ventrella. 2014. Virtual Gaze: the communicative energy between avatar faces. In Nonverbal Communication in Virtual Worlds, Theresa Jean Tanenbaum, Magy Seif El-Nasr and Michael Nixon (eds.). ETC Press, Pittsburgh, PA, USA, 61--75. Retrieved April 8, 2019 from http://dl.acm.org/citation.cfm?id=2812748.2812754",
      "doi": ""
    },
    {
      "text": "Jeffrey Ventrella. 2014. Avatar Puppeteering: direct manipulation of avatar joints for spontaneous body language. In Nonverbal Communication in Virtual Worlds, Theresa Jean Tanenbaum, Magy Seif El-Nasr and Michael Nixon (eds.). ETC Press, Pittsburgh, PA, USA, 237--249. Retrieved April 8, 2019 from http://dl.acm.org/citation.cfm?id=2812748.2812764",
      "doi": ""
    },
    {
      "text": "Alessandro Vinciarelli, Maja Pantic, Herve Bourlard, and Alex Pentland. 2008. Social Signals, their Function, and Automatic Analysis: A Survey. ACM.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Jeremy N. Bailenson, Mark Urbanek, Francis Chang, and Dan Merget. 2007. The Unbearable Likeness of Being Digital: The Persistence of Nonverbal Social Norms in Online Virtual Environments. CyberPsychology & Behavior 10, 1: 115--121.",
      "doi": ""
    },
    {
      "text": "Y. Zhang and Z. Zhu. 2017. On Stage Interactive Spatial AR for Drama Performance. In 2016 IEEE International Symposium on Mixed and Augmented Reality (ISMAR-Adjunct)(ISMARW), 280--283. https://doi.org/10.1109/ISMAR-Adjunct.2016.0095",
      "doi": ""
    }
  ]
}