{
  "doi": "10.1145/3313831.3376482",
  "title": "Social Comparison and Facebook: Feedback, Positivity, and Opportunities for Comparison",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "People compare themselves to one another both offline and online. The specific online activities that worsen social comparison are partly understood, though much existing research relies on people recalling their own online activities post hoc and is situated in only a few countries. To better understand social comparison worldwide and the range of associated behaviors on social media, a survey of 38,000 people from 18 countries was paired with logged activity on Facebook for the prior month. People who reported more frequent social comparison spent more time on Facebook, had more friends, and saw proportionally more social content on the site. They also saw greater amounts of feedback on friends' posts and proportionally more positivity. There was no evidence that social comparison happened more with acquaintances than close friends. One in five respondents recalled recently seeing a post that made them feel worse about themselves but reported conflicting views: half wished they hadn't seen the post, while a third felt very happy for the poster. Design opportunities are discussed, including hiding feedback counts, filters for topics and people, and supporting meaningful interactions, so that when comparisons do occur, people are less affected by them.",
  "authors": [
    {
      "name": "Moira Burke",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100241308",
      "orcid": "missing"
    },
    {
      "name": "Justin Cheng",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553324256",
      "orcid": "missing"
    },
    {
      "name": "Bethany de Gant",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527048",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Responding to Sensitive Disclosures on Social Media: A Decision-Making Framework. ACM Transactions on Computer-Human Interaction 25, 6, Article 31 (Dec. 2018), 29 pages.",
      "doi": "10.1145/3241044"
    },
    {
      "text": "Helmut Appel, Alexander L Gerlach, and Jan Crusius. 2016. The interplay between Facebook use, social comparison, envy, and depression. Current Opinion in Psychology 9 (2016), 44--49.",
      "doi": ""
    },
    {
      "text": "Eric P. S. Baumer. 2018. Socioeconomic Inequalities in the Non Use of Facebook. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Article 616, 14 pages.",
      "doi": "10.1145/3173574.3174190"
    },
    {
      "text": "CR Blease. 2015. Too many \"friends,' too few \"likes'? Evolutionary psychology and \"Facebook depression'. Review of General Psychology 19, 1 (2015), 1--13.",
      "doi": ""
    },
    {
      "text": "Charles F Bond Jr and Evan L Anderson. 1987. The reluctance to transmit bad news: Private discomfort or public display? Journal of Experimental Social Psychology 23, 2 (1987), 176--187.",
      "doi": ""
    },
    {
      "text": "Moira Burke and Mike Develin. 2016. Once more with feeling: Supportive responses to social sharing on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 1462--1474.",
      "doi": "10.1145/2818048.2835199"
    },
    {
      "text": "Moira Burke and Robert E Kraut. 2016. The relationship between Facebook use and well-being depends on communication type and tie strength. Journal of computer-mediated communication 21, 4 (2016), 265--281.",
      "doi": "10.1111/jcc4.12162"
    },
    {
      "text": "Mitchell J Callan, Hyunji Kim, and William J Matthews. 2015. Age differences in social comparison tendency and personal relative deprivation. Personality and Individual Differences 87 (2015), 196--199.",
      "doi": ""
    },
    {
      "text": "Justin Cheng, Moira Burke, and Elena Goetz Davis. 2019. Understanding Perceptions of Problematic Facebook Use: When People Experience Negative Life Impact and a Lack of Control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Hui-Tzu Grace Chou and Nicholas Edge. 2012. ?They are happier and having better lives than I am\": the impact of using Facebook on perceptions of others' lives. Cyberpsychology, Behavior, and Social Networking 15, 2 (2012), 117--121.",
      "doi": ""
    },
    {
      "text": "Trudy Hui Hui Chua and Leanne Chang. 2016. Follow me and like my beautiful selfies: Singapore teenage girls' engagement in self-presentation and peer comparison on social media. Computers in Human Behavior 55 (2016), 190--197.",
      "doi": "10.1016/j.chb.2015.09.011"
    },
    {
      "text": "Anna Codrea-Rado. 2017. #MeToo Floods Social Media With Stories of Harassment and Assault. https://www.nytimes.com/2017/10/16/technology/ metoo-twitter-facebook.html. (2017).",
      "doi": ""
    },
    {
      "text": "Josh Constine. 2019. Now Facebook says it may remove Like counts. https://techcrunch.com/2019/09/02/facebook-hidden-likes/. (2019).",
      "doi": ""
    },
    {
      "text": "Kevin Doherty and Barry R Schlenker. 1991. Self-consciousness and strategic self-presentation. Journal of Personality 59, 1 (1991), 1--18.",
      "doi": ""
    },
    {
      "text": "Judith Donath. 2007. Signals in social supernets. Journal of Computer-Mediated Communication 13, 1 (2007), 231--251.",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Bryan Dosono, Yasmeen Rashidi, Taslima Akter, Bryan Semaan, and Apu Kapadia. 2017. Challenges in Transitioning from Civil to Military Culture: Hyper-Selective Disclosure Through ICTs. Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing 1, CSCW, Article 41 (Dec. 2017), 23 pages.",
      "doi": "10.1145/3134676"
    },
    {
      "text": "Nicole B Ellison, Jessica Vitak, Rebecca Gray, and Cliff Lampe. 2014. Cultivating social resources on social network sites: Facebook relationship maintenance behaviors and their role in social capital processes. Journal of Computer-Mediated Communication 19, 4 (2014), 855--870.",
      "doi": "10.1111/jcc4.12078"
    },
    {
      "text": "Sindhu Ernala, Moira Burke, Nicole Ellison, and Alex Leavitt. 2020. How Well Do People Report Their Time Spent on Facebook? An Evaluation of Time-on-Site Survey Questions with Recommendations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3313831.3376435"
    },
    {
      "text": "Facebook. 2019. How do I take a break from someone on Facebook? https://www.facebook.com/help/1638212473101795. (2019).",
      "doi": ""
    },
    {
      "text": "Brian A Feinstein, Rachel Hershenberg, Vickie Bhatia, Jessica A Latack, Nathalie Meuwly, and Joanne Davila. 2013. Negative social comparison on Facebook and depressive symptoms: Rumination as a mechanism. Psychology of Popular Media Culture 2, 3 (2013), 161.",
      "doi": ""
    },
    {
      "text": "Scott L Feld. 1991. Why your friends have more friends than you do. Amer. J. Sociology 96, 6 (1991), 1464--1477.",
      "doi": ""
    },
    {
      "text": "Leon Festinger. 1954. A theory of social comparison processes. Human Relations 7, 2 (1954), 117--140.",
      "doi": ""
    },
    {
      "text": "Madeline Fitzgerald. 2019. Instagram Starts Test To Hide Number of Likes Posts Receive for Users in 7 Countries. https://time.com/5629705/instagram-removing-likes-test/. (2019).",
      "doi": ""
    },
    {
      "text": "Frederick X Gibbons and Bram P Buunk. 1999. Individual differences in social comparison: development of a scale of social comparison orientation. Journal of Personality and Social Psychology 76, 1 (1999), 129.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert and Karrie Karahalios. 2009. Predicting Tie Strength with Social Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 211--220.",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "George R Goethals and John M Darley. 1977. Social comparison theory: An attributional approach. Social comparison processes: Theoretical and empirical perspectives (1977), 259--278.",
      "doi": ""
    },
    {
      "text": "Amy L Gonzales and Jeffrey T Hancock. 2011. Mirror, mirror on my Facebook wall: Effects of exposure to Facebook on self-esteem. Cyberpsychology, Behavior, and Social Networking 14, 1--2 (2011), 79--83.",
      "doi": ""
    },
    {
      "text": "Serge Guimond, Nyla R Branscombe, Sophie Brunot, Abraham P Buunk, Armand Chatard, Michel Désert, Donna M Garcia, Shamsul Haque, Delphine Martinot, and Vincent Yzerbyt. 2007. Culture, gender, and the self: variations and impact of social comparison processes. Journal of Personality and Social Psychology 92, 6 (2007), 1118.",
      "doi": ""
    },
    {
      "text": "Nina Haferkamp and Nicole C Krämer. 2011. Social comparison 2.0: Examining the effects of online profiles on social-networking sites. Cyberpsychology, Behavior, and Social Networking 14, 5 (2011), 309--314.",
      "doi": ""
    },
    {
      "text": "Leslie J Heinberg and J Kevin Thompson. 1992. Social comparison: Gender, target importance ratings, and relation to body image disturbance. Journal of Social Behavior and Personality 7, 2 (1992), 335.",
      "doi": ""
    },
    {
      "text": "Nicole E Henniger and Christine R Harris. 2015. Envy across adulthood: The what and the who. Basic and Applied Social Psychology 37, 6 (2015), 303--318.",
      "doi": ""
    },
    {
      "text": "Russell A Hill and Robin IM Dunbar. 2003. Social network size in humans. Human Nature 14, 1 (2003), 53--72.",
      "doi": ""
    },
    {
      "text": "Clayton J Hutto and Eric Gilbert. 2014. Vader: A parsimonious rule-based model for sentiment analysis of social media text. In Proceedings of the International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: how technology mediated reflection improves well-being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1071--1080.",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Dietmar Jannach, Lukas Lerche, Fatih Gedikli, and Geoffray Bonnin. 2013. What recommenders recommend--an analysis of accuracy, popularity, and sales diversity effects. In International Conference on User Modeling, Adaptation, and Personalization. 25--37.",
      "doi": ""
    },
    {
      "text": "Alexander H Jordan, Benoît Monin, Carol S Dweck, Benjamin J Lovett, Oliver P John, and James J Gross. 2011. Misery has more company than people think: Underestimating the prevalence of others' negative emotions. Personality and Social Psychology Bulletin 37, 1 (2011), 120--135.",
      "doi": ""
    },
    {
      "text": "Reynol Junco. 2013. Comparing actual and self-reported measures of Facebook use. Computers in Human Behavior 29, 3 (2013), 626--631.",
      "doi": "10.1016/j.chb.2012.11.007"
    },
    {
      "text": "Gueorgi Kossinets and Duncan J Watts. 2009. Origins of homophily in an evolving social network. Amer. J. Sociology 115, 2 (2009), 405--450.",
      "doi": ""
    },
    {
      "text": "Robert Kraut and Moira Burke. 2015. Internet use and psychological well-being: Effects of activity and audience. Commun. ACM 58, 12 (2015), 94--100.",
      "doi": "10.1145/2739043"
    },
    {
      "text": "Ethan Kross, Philippe Verduyn, Emre Demiralp, Jiyoung Park, David Seungjae Lee, Natalie Lin, Holly Shablack, John Jonides, and Oscar Ybarra. 2013. Facebook use predicts declines in subjective well-being in young adults. PloS one 8, 8 (2013), e69841.",
      "doi": ""
    },
    {
      "text": "Sang Yup Lee. 2014. How do people compare themselves with others on social network sites?: The case of Facebook. Computers in Human Behavior 32 (2014), 253--260.",
      "doi": "10.1016/j.chb.2013.12.009"
    },
    {
      "text": "Pengxiang Li, Leanne Chang, Trudy Hui Hui Chua, and Renae Sze Ming Loh. 2018. \"Likes\" as KPI: An examination of teenage girls' perspective on peer feedback on Instagram and its influence on coping response. Telematics and Informatics 35, 7 (2018), 1994--2005.",
      "doi": ""
    },
    {
      "text": "Myungsuh Lim and Yoon Yang. 2015. Effects of users' envy and shame on social comparison that occurs on social network services. Computers in Human Behavior 51 (2015), 300--311.",
      "doi": "10.1016/j.chb.2015.05.013"
    },
    {
      "text": "Ruoyun Lin and Sonja Utz. 2015. The emotional responses of browsing Facebook: Happiness, envy, and the role of tie strength. Computers in Human Behavior 52 (2015), 29--38.",
      "doi": "10.1016/j.chb.2015.04.064"
    },
    {
      "text": "Sonja Lyubomirsky and Lee Ross. 1997. Hedonic consequences of social comparison: a contrast of happy and unhappy people. Journal of Personality and Social Psychology 73, 6 (1997), 1141.",
      "doi": ""
    },
    {
      "text": "Samantha B Mackson, Paula M Brochu, and Barry A Schneider. 2019. Instagram: Friend or foe? The application's association with psychological well-being. New Media & Society (2019).",
      "doi": ""
    },
    {
      "text": "Adriana M Manago, Michael B Graham, Patricia M Greenfield, and Goldie Salimkhan. 2008. Self-presentation and gender on MySpace. Journal of Applied Developmental Psychology 29, 6 (2008), 446--458.",
      "doi": ""
    },
    {
      "text": "Adriana M Manago, Tamara Taylor, and Patricia M Greenfield. 2012. Me and my 400 friends: The anatomy of college students' Facebook networks, their communication patterns, and well-being. Developmental Psychology 48, 2 (2012), 369.",
      "doi": ""
    },
    {
      "text": "Miller McPherson, Lynn Smith-Lovin, and James M Cook. 2001. Birds of a feather: Homophily in social networks. Annual Review of Sociology 27, 1 (2001), 415--444.",
      "doi": "10.1146/annurev.soc.27.1.415"
    },
    {
      "text": "Carol T Miller. 1984. Self-schemas, gender, and social comparison: A clarification of the related attributes hypothesis. Journal of Personality and Social Psychology 46, 6 (1984), 1222.",
      "doi": ""
    },
    {
      "text": "Sylvia A Morelli, Matthew D Lieberman, and Jamil Zaki. 2015. The emerging study of positive empathy. Social and Personality Psychology Compass 9, 2 (2015), 57--68.",
      "doi": ""
    },
    {
      "text": "Robin L Nabi and Lauren Keblusek. 2014. Inspired by hope, motivated by envy: Comparing the effects of discrete emotions in the process of social comparison to media figures. Media Psychology 17, 2 (2014), 208--234.",
      "doi": ""
    },
    {
      "text": "Jacqueline Nesi and Mitchell J Prinstein. 2015. Using social media for social comparison and feedback-seeking: gender and popularity moderate associations with depressive symptoms. Journal of Abnormal Child Psychology 43, 8 (2015), 1427--1438.",
      "doi": ""
    },
    {
      "text": "Philip M Podsakoff, Scott B MacKenzie, Jeong-Yeon Lee, and Nathan P Podsakoff. 2003. Common method biases in behavioral research: A critical review of the literature and recommended remedies. Journal of Applied Psychology 88, 5 (2003), 879.",
      "doi": ""
    },
    {
      "text": "Deanna R Puglia. 2017. Social Media Use and Its Impact on Body Image: The Effects of Body Comparison Tendency, Motivation for Social Media Use, and Social Media Platform on Body Esteem in Young Women. Ph.D. Dissertation. The University of North Carolina at Chapel Hill.",
      "doi": ""
    },
    {
      "text": "Ameet Ranadive and David Ginsberg. 2018. New Tools to Manage Your Time on Facebook and Instagram. https://newsroom.fb.com/news/2018/08/manage-your-time/. (2018).",
      "doi": ""
    },
    {
      "text": "Sidney Rosen and Abraham Tesser. 1970. On reluctance to communicate undesirable information: The MUM effect. Sociometry (1970), 253--263.",
      "doi": ""
    },
    {
      "text": "Willem E Saris, Melanie Revilla, Jon A Krosnick, and Eric M Shaeffer. 2010. Comparing Questions with Agree/Disagree Response Options to Questions with Item-Specific Response Options. In Survey Research Methods, Vol. 4. 61--79.",
      "doi": ""
    },
    {
      "text": "Hirotsune Sato and Jun-ichiro Kawahara. 2011. Selective bias in retrospective self-reports of negative mood states. Anxiety, Stress & Coping 24, 4 (2011), 359--367.",
      "doi": ""
    },
    {
      "text": "Michael F Scheier and Charles S Carver. 1985. The Self-Consciousness Scale: A Revised Version for Use with General Populations 1. Journal of Applied Social Psychology 15, 8 (1985), 687--699.",
      "doi": ""
    },
    {
      "text": "Lauren Scissors, Moira Burke, and Steven Wengrovitz. 2016. What's in a Like?: Attitudes and behaviors around receiving Likes on Facebook. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing. 1501--1510.",
      "doi": "10.1145/2818048.2820066"
    },
    {
      "text": "Kennon M Sheldon and Sonja Lyubomirsky. 2006. How to increase and sustain positive emotion: The effects of expressing gratitude and visualizing best possible selves. Journal of Positive Psychology 1, 2 (2006), 73--82.",
      "doi": ""
    },
    {
      "text": "Lauren E Sherman, Ashley A Payton, Leanna M Hernandez, Patricia M Greenfield, and Mirella Dapretto. 2016. The power of the like in adolescence: effects of peer influence on neural and behavioral responses to social media. Psychological Science 27, 7 (2016), 1027--1035.",
      "doi": ""
    },
    {
      "text": "Xiaolin Shi, Lada A Adamic, and Martin J Strauss. 2007. Networks of strong ties. Physica A: Statistical Mechanics and its Applications 378, 1 (2007), 33--47.",
      "doi": ""
    },
    {
      "text": "Mai-Ly N Steers, Robert E Wickham, and Linda K Acitelli. 2014. Seeing everyone else's highlight reels: How Facebook usage is linked to depressive symptoms. Journal of Social and Clinical Psychology 33, 8 (2014), 701--731.",
      "doi": ""
    },
    {
      "text": "Jerry Suls. 1982. From the cradle to the grave: Comparison and self-evaluation across the life-span. Psychological perspectives on the self 1 (1982), 97--125.",
      "doi": ""
    },
    {
      "text": "Jerry Suls. 1986. Comparison processes in relative deprivation: A life-span analysis. In Relative deprivation and social comparison: The Ontario Symposium, Vol. 4. 95--116.",
      "doi": ""
    },
    {
      "text": "Jerry Suls, John Gastorf, and John Lawhon. 1978. Social comparison choices for evaluating a sexand age-related ability. Personality and Social Psychology Bulletin 4, 1 (1978), 102--105.",
      "doi": ""
    },
    {
      "text": "Jerry Suls, Rene Martin, and Ladd Wheeler. 2002. Social comparison: Why, with whom, and with what effect? Current Directions in Psychological Science 11, 5 (2002), 159--163.",
      "doi": ""
    },
    {
      "text": "Catalina L Toma and Jeffrey T Hancock. 2013. Self-affirmation underlies Facebook use. Personality and Social Psychology Bulletin 39, 3 (2013), 321--331.",
      "doi": ""
    },
    {
      "text": "Johan Ugander, Brian Karrer, Lars Backstrom, and Cameron Marlow. 2011. The anatomy of the facebook social graph. arXiv preprint arXiv:1111.4503 (2011).",
      "doi": ""
    },
    {
      "text": "Erin A Vogel and Jason P Rose. 2016. Self-reflection and interpersonal connection: Making the most of self-presentation on social media. Translational Issues in Psychological Science 2, 3 (2016), 294.",
      "doi": ""
    },
    {
      "text": "Erin A Vogel, Jason P Rose, Bradley M Okdie, Katheryn Eckles, and Brittany Franz. 2015. Who compares and despairs? The effect of social comparison orientation on social media use and its outcomes. Personality and Individual Differences 86 (2015), 249--256.",
      "doi": ""
    },
    {
      "text": "Erin A Vogel, Jason P Rose, Lindsay R Roberts, and Katheryn Eckles. 2014. Social comparison, social media, and self-esteem. Psychology of Popular Media Culture 3, 4 (2014), 206.",
      "doi": ""
    },
    {
      "text": "Yi-Chia Wang, Moira Burke, and Robert Kraut. 2016. Modeling self-disclosure in social networking sites. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 74--85.",
      "doi": "10.1145/2818048.2820010"
    },
    {
      "text": "Joanne V Wood. 1989. Theory and research concerning social comparisons of personal attributes. Psychological Bulletin 106, 2 (1989), 231.",
      "doi": ""
    },
    {
      "text": "Joanne V Wood. 1996. What is social comparison and how should we study it? Personality and Social Psychology Bulletin 22, 5 (1996), 520--537.",
      "doi": ""
    },
    {
      "text": "Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of Facebook: Experiencing social media as performance, exhibition, and personal archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1--10.",
      "doi": "10.1145/2470654.2470656"
    }
  ]
}