{
  "doi": "10.1145/3313831.3376792",
  "title": "Researching AI Legibility through Design",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Everyday interactions with computers are increasingly likely to involve elements of Artificial Intelligence (AI). Encompassing a broad spectrum of technologies and applications, AI poses many challenges for HCI and design. One such challenge is the need to make AI's role in a given system legible to the user in a meaningful way. In this paper we employ a Research through Design (RtD) approach to explore how this might be achieved. Building on contemporary concerns and a thorough exploration of related research, our RtD process reflects on designing imagery intended to help increase AI legibility for users. The paper makes three contributions. First, we thoroughly explore prior research in order to critically unpack the AI legibility problem space. Second, we respond with design proposals whose aim is to enhance the legibility, to users, of systems using AI. Third, we explore the role of design-led enquiry as a tool for critically exploring the intersection between HCI and AI research.",
  "tags": [
    "human-data interaction",
    "artificial intelligence",
    "machine learning",
    "legibility",
    "research through design"
  ],
  "authors": [
    {
      "name": "Joseph Lindley",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458634157",
      "orcid": "0000-0002-5527-3028"
    },
    {
      "name": "Haider Ali Akmal",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526927",
      "orcid": "missing"
    },
    {
      "name": "Franziska Pilling",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-99659574017/rel-imgonly/franziskaprofile.jpg",
      "acmid": "99659574017",
      "orcid": "missing"
    },
    {
      "name": "Paul Coulton",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81100461071/rel-imgonly/me.png",
      "acmid": "81100461071",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Max Chickering, Steven M. Drucker, Bongshin Lee, Patrice Simard, and Jina Suh. 2015. ModelTracker. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, New York, New York, USA, 337--346. DOI: https://doi.org/10.1145/2702123.2702509",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, Eric Horvitz, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, and Paul N. Bennett. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, New York, New York, USA, 1--13. DOI: https://doi.org/10.1145/3290605.3300233",
      "doi": ""
    },
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. New Media Soc. 20, 3 (March 2018), 973--989. DOI: https://doi.org/10.1177/1461444816676645",
      "doi": ""
    },
    {
      "text": "Timo Arnall. 2006. A graphic language for touchbased interactions. In Mobile Interaction with the Real World. Retrieved from http://citeseerx.ist.psu.edu/viewdoc/download?doi= 10.1.1.95.9464&rep=rep1&type=pdf#page=18",
      "doi": ""
    },
    {
      "text": "Matthew Arnold, Rachel K. E. Bellamy, Michael Hind, Stephanie Houde, Sameep Mehta, Aleksandra Mojsilovic, Ravi Nair, Karthikeyan Natesan Ramamurthy, Darrell Reimer, Alexandra Olteanu, David Piorkowski, Jason Tsay, and Kush R. Varshney. 2018. FactSheets: Increasing Trust in AI Services through Supplier's Declarations of Conformity. (2018). Retrieved from http://arxiv.org/abs/1808.07261",
      "doi": ""
    },
    {
      "text": "Kai Arulkumaran, Antoine Cully, and Julian Togelius. 2019. AlphaStar: An Evolutionary Computation Perspective. (February 2019). DOI: https://doi.org/10.1145/3319619.3321894",
      "doi": "10.1145/3319619.3321894"
    },
    {
      "text": "Thomas Binder and Johan Redström. 2006. Exemplary design research. In Proceedings of Wonderground, Design Research Society.",
      "doi": ""
    },
    {
      "text": "John Blythe and Shane Johnson. 2018. Rapid evidence assessment on labelling schemes and implications for consumer IoT security. Retrieved from https://www.gov.uk/government/publications/rapidevidence-assessment-on-labelling-schemes-for-iotsecurity",
      "doi": ""
    },
    {
      "text": "Nick Bostrom. 2014. Superintelligence: Paths, Dangers, Strategies. Oxford University Press.",
      "doi": "10.5555/2678074"
    },
    {
      "text": "Jenna Burrell. 2016. How the machine ?thinks': Understanding opacity in machine learning algorithms. Big Data Soc. 3, 1 (January 2016), 205395171562251. DOI: https://doi.org/10.1177/2053951715622512",
      "doi": ""
    },
    {
      "text": "Stephen Cave and Seán S. ÓhÉigeartaigh. 2018. An AI Race for Strategic Advantage. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society - AIES '18, ACM Press, New York, New York, USA, 36--40. DOI: https://doi.org/10.1145/3278721.3278780",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Richard Mortier. 2015. Human Data Interaction: Historical Lessons from Social Studies and CSCW. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway. Springer International Publishing, Cham, 3--21. DOI: https://doi.org/10.1007/978--3--319--20499--4_1",
      "doi": ""
    },
    {
      "text": "Nigel Cross. 2011. Design Thinking: Understanding How Designers Think And Work. Bloomsbury.",
      "doi": ""
    },
    {
      "text": "Yiming Ding, Jae Ho Sohn, Michael G. Kawczynski, Hari Trivedi, Roy Harnish, Nathaniel W. Jenkins, Dmytro Lituiev, Timothy P. Copeland, Mariam S. Aboian, Carina Mari Aparici, Spencer C. Behr, Robert R. Flavell, Shih-Ying Huang, Kelly A. Zalocusky, Lorenzo Nardo, Youngho Seo, Randall A. Hawkins, Miguel Hernandez Pampaloni, Dexter Hadley, and Benjamin L. Franc. 2019. A Deep Learning Model to Predict a Diagnosis of Alzheimer Disease by Using 18 F-FDG PET of the Brain. Radiology 290, 2 (February 2019), 456--464. DOI: https://doi.org/10.1148/radiol.2018180958",
      "doi": ""
    },
    {
      "text": "Andreas Drichoutis, Panagiotis Lazaridis, and Rodolfo Nayga Jr. 2006. Consumers' use of nutritional labels: a review of research studies and issues. Acad. Mark. Sci. Rev. (2006).",
      "doi": ""
    },
    {
      "text": "Abigail C. Durrant, John Vines, Jayne Wallace, and Joyce S. R. Yee. 2017. Research Through Design: Twenty-First Century Makers and Materialities. Des. Issues 33, 3 (July 2017), 3--10. DOI: https://doi.org/10.1162/DESI_a_00447",
      "doi": ""
    },
    {
      "text": "Jennifer Ferreira, Pippin Barr, and James Noble. 2002. The Semiotics of User Interface Redesign. In Proceedings of the Sixth Australasian conference on User interface, 47--53.",
      "doi": ""
    },
    {
      "text": "Jennifer Ferreira, James Noble, and Robert Biddle. 2006. A case for iconic icons. In Conferences in Research and Practice in Information Technology Series, 87--90.",
      "doi": ""
    },
    {
      "text": "Lois Frankel and Martin Racine. 2010. The Complex Field of Research: for Design, through Design, and about Design. Des. Res. Soc. (2010).",
      "doi": ""
    },
    {
      "text": "William Gaver. 1986. Auditory Icons: Using Sound in Computer Interfaces. Human-Computer Interact. 2, 2 (June 1986), 167--177. DOI: https://doi.org/10.1207/s15327051hci0202_3",
      "doi": "10.1207/s15327051hci0202_3"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design? In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, ACM Press, New York, New York, USA, 937--946. DOI: https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William Gaver and Kristina Höök. 2017. What makes a good CHI design paper? Interactions 24, 3 (2017), 20--21. DOI: https://doi.org/10.1145/3076255",
      "doi": "10.1145/3076255"
    },
    {
      "text": "Elizabeth Gibney. 2016. Google AI algorithm masters ancient game of Go. Nature 529, 7587 (January 2016), 445--446. DOI: https://doi.org/10.1038/529445a",
      "doi": ""
    },
    {
      "text": "Karamjit S. Gill. 2016. Artificial super intelligence: beyond rhetoric. AI Soc. 31, 2 (May 2016), 137-- 143. DOI: https://doi.org/10.1007/s00146-016-0651x",
      "doi": ""
    },
    {
      "text": "David Gittins. 1986. Icon-based human-computer interaction. Int. J. Man. Mach. Stud. 24, 6 (June 1986), 519--543. DOI: https://doi.org/10.1016/S0020--7373(86)80007-",
      "doi": "10.1016/S0020-7373%2886%2980007-4"
    },
    {
      "text": "Joseph Gogeun. 1993. On Notation. In Tools10: Technology of Object-Oriented Languages and Systems, Prentice Hall, 47--53.",
      "doi": ""
    },
    {
      "text": "Samuel Greengard. 2018. Weighing the impact of GDPR. Commun. ACM 61, 11 (October 2018), 16-- 18. DOI: https://doi.org/10.1145/3276744",
      "doi": "10.1145/3276744"
    },
    {
      "text": "Hamed Haddadi, Richard Mortier, Derek McAuley, and Jon Crowcroft. 2012. Human Data-Interaction.",
      "doi": ""
    },
    {
      "text": "P Hayes and K Ford. 1995. Turing test considered harmful. Int. Jt. Conf. Artif. Intell. (1995), 972--977. Retrieved from http://www.csee.umbc.edu/courses/471/papers/haye s95.pdf",
      "doi": ""
    },
    {
      "text": "Jonathan L. Herlocker, Joseph A. Konstan, and John Riedl. 2000. Explaining collaborative filtering recommendations. In Proceedings of the 2000 ACM conference on Computer supported cooperative work - CSCW '00, ACM Press, New York, New York, USA, 241--250. DOI: https://doi.org/10.1145/358916.358995",
      "doi": "10.1145/358916.358995"
    },
    {
      "text": "Sarah Holland, Ahmed Hosny, Sarah Newman, Joshua Joseph, and Kasia Chmielinski. 2018. The Dataset Nutrition Label: A Framework To Drive Higher Data Quality Standards. May (2018). Retrieved from http://arxiv.org/abs/1805.03677",
      "doi": ""
    },
    {
      "text": "Frank R. Kardes. 1988. Spontaneous Inference Processes in Advertising: The Effects of Conclusion Omission and Involvement on Persuasion. J. Consum. Res. 15, 2 (September 1988), 225. DOI: https://doi.org/10.1086/209159",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Joanna Bresee, Lorrie Faith Cranor, and Robert W. Reeder. 2009. A ?nutrition label\" for privacy. In Proceedings of the 5th Symposium on Usable Privacy and Security SOUPS '09, ACM Press, New York, New York, USA, 1. DOI: https://doi.org/10.1145/1572532.1572538",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Lucian Cesca, Joanna Bresee, and Lorrie Faith Cranor. 2010. Standardizing privacy notices. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press, New York, New York, USA, 1573. DOI: https://doi.org/10.1145/1753326.1753561",
      "doi": "10.1145/1753326.1753561"
    },
    {
      "text": "Asle H. Kiran and Peter-Paul Verbeek. 2010. Trusting Our Selves to Technology. Knowledge, Technol. Policy 23, 3--4 (December 2010), 409-- 427. DOI: https://doi.org/10.1007/s12130-010--9123-",
      "doi": ""
    },
    {
      "text": "Joerg Koenigstorfer and Hans Baumgartner. 2016. The Effect of Fitness Branding on Restrained Eaters' Food Consumption and Postconsumption Physical Activity. J. Mark. Res. 53, 1 (February 2016), 124--138. DOI: https://doi.org/10.1509/jmr.12.0429",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee. 2018. Understanding perception of algorithmic decisions: Fairness, trust, and emotion in response to algorithmic management. Big Data Soc. 5, 1 (June 2018), 205395171875668. DOI: https://doi.org/10.1177/2053951718756684",
      "doi": ""
    },
    {
      "text": "Hsuan Lin, Yu-Chen Hsieh, and Fong-Gong Wu. 2016. A study on the relationships between different presentation modes of graphical icons and users' attention. Comput. Human Behav. 63, (October 2016), 218--228. DOI: https://doi.org/10.1016/j.chb.2016.05.008",
      "doi": "10.1016/j.chb.2016.05.008"
    },
    {
      "text": "Joseph Lindley, Sara Canizzaro, Rob Procter, and Paul Coulton. 2019. Adoption and Acceptabillity. In Cybersecurity of the Internet of Things, K Pothong, I Brass and M Carr (eds.). PETRAS IoT Research Hub. Retrieved from https://www.petrashub.org/petras-stream-report/",
      "doi": ""
    },
    {
      "text": "Joseph Lindley, Paul Coulton, and Miriam Sturdee. 2017. Implications for Adoption. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, New York, USA, 265--277. DOI: https://doi.org/10.1145/3025453.3025742",
      "doi": "10.1145/3025453.3025742"
    },
    {
      "text": "Xiaoyue Ma, Nada Matta, Jean-Pierre Cahier, Chunxiu Qin, and Yanjie Cheng. 2015. From action icon to knowledge icon: Objective-oriented icon taxonomy in computer science. Displays 39, (October 2015), 68--79. DOI: https://doi.org/10.1016/j.displa.2015.08.006",
      "doi": ""
    },
    {
      "text": "Aaron Marcus. 2002. Information Visualization for Advanced Vehicle Displays. Inf. Vis. 1, 2 (June 2002), 95--102. DOI: https://doi.org/10.1057/palgrave.ivs.9500016",
      "doi": ""
    },
    {
      "text": "Aaron Marcus. 2003. Icons, symbols, and signs. interactions 10, 3 (May 2003), 37. DOI: https://doi.org/10.1145/769759.769774",
      "doi": ""
    },
    {
      "text": "Evgeny Morozov. 2013. To Save Everything Click Here: Technology, Solutionism and the Urge to Fix Problems That Don't Exist. Allen Lane Penguin Books.",
      "doi": ""
    },
    {
      "text": "Richard Mortier, Hamed Haddadi, Tristan Henderson, Derek McAuley, and Jon Crowcroft. 2014. Human-Data Interaction: The Human Face of the Data-Driven Society. SSRN Electron. J. (2014). DOI: https://doi.org/10.2139/ssrn.2508051",
      "doi": ""
    },
    {
      "text": "Kayur Patel, Naomi Bancroft, Steven M. Drucker, James Fogarty, Andrew J. Ko, and James Landay. 2010. Gestalt. In Proceedings of the 23nd annual ACM symposium on User interface software and technology - UIST '10, ACM Press, New York, New York, USA. DOI: https://doi.org/10.1145/1866029.1866038",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Kelley Cotter, and Janghee Cho. 2018. Explanations as Mechanisms for Supporting Algorithmic Transparency. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, New York, New York, USA, 1--13. DOI: https://doi.org/10.1145/3173574.3173677",
      "doi": "10.1145/3173574.3173677"
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. \"Why Should I Trust You?\" Explaining the Predictions of Any Classifier. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining - KDD '16, ACM Press, New York, New York, USA, 1135--1144. DOI: https://doi.org/10.1145/2939672.2939778",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "Neelima Sailaja, Andy Crabtree, and Phil Stenton. 2017. Challenges of using Personal Data to Drive Personalised Electronic Programme Guides. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, New York, USA, 5226-- 5231. DOI: https://doi.org/10.1145/3025453.3025986",
      "doi": "10.1145/3025453.3025986"
    },
    {
      "text": "Thomas Albert Sebeok. 2001. Signs: An Introduction to Semiotics. University of Toronto Press.",
      "doi": ""
    },
    {
      "text": "Roger Silverstone. 2006. Domesticating domestication. Reflecting on the life of a concept. In Domestication Of Media And Technology, Thomas Berker, Maren Hartmann, Yves Punie and Katie Ward (eds.). Open University Press, 229--247.",
      "doi": ""
    },
    {
      "text": "Pieter Stappers and Elisa Giaccardi. 2019. 43. Research through Design. In The Encyclopedia of Human-Computer Interaction, 2nd Ed. Retrieved September 6, 2019 from https://www.interactiondesign.org/literature/book/the-encyclopedia-ofhuman-computer-interaction-2nd-ed/researchthrough-design",
      "doi": ""
    },
    {
      "text": "Alan Turing. 1950. Computing Machinery and Intelligence. Mind LIX, 236 (1950), 433--460. DOI: https://doi.org/10.1093/mind/LIX.236.433",
      "doi": ""
    },
    {
      "text": "Hassan Ugail and Ahmad Al-dahoud. 2019. A genuine smile is indeed in the eyes -- The computer aided non-invasive analysis of the exact weight distribution of human smiles across the face. Adv. Eng. Informatics 42, February (October 2019), 100967. DOI: https://doi.org/10.1016/j.aei.2019.100967",
      "doi": "10.1016/j.aei.2019.100967"
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21 st century. ACM SIGMOBILE Mob. Comput. Commun. Rev. 3, 3 (July 1999), 3--11. DOI: https://doi.org/10.1145/329124.329126",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Daniel S. Weld and Gagan Bansal. 2019. The challenge of crafting intelligible intelligence. Commun. ACM 62, 6 (May 2019), 70--79. DOI: https://doi.org/10.1145/3282486",
      "doi": "10.1145/3282486"
    },
    {
      "text": "Ke Yang, Julia Stoyanovich, Abolfazl Asudeh, Bill Howe, HV Jagadish, and Gerome Miklau. 2018. A Nutritional Label for Rankings. In Proceedings of the 2018 International Conference on Management of Data - SIGMOD '18, ACM Press, New York, New York, USA, 1773--1776. DOI: https://doi.org/10.1145/3183713.3193568",
      "doi": "10.1145/3183713.3193568"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. Proc. SIGCHI Conf. Hum. factors Comput. Syst. CHI '07 (2007), 493. DOI: https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "CES Day One: AI Is Everywhere - SyncedReview Medium. Retrieved September 6, 2019 from https://medium.com/syncedreview/ces-day-one-aiis-everywhere-6b13f3999596",
      "doi": ""
    }
  ]
}