{
  "doi": "10.1145/3313831.3376882",
  "title": "QMaps: Engaging Students in Voluntary Question Generation and Linking",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Generating multiple-choice questions is known to improve students' critical thinking and deep learning. Visualizing relationships between concepts enhances meaningful learning, students' ability to relate new concepts to previously learned concepts. We designed and deployed a collaborative learning process through which students generate multiple-choice questions and represent the prerequisite knowledge structure between questions as visual links in a shared map, using a variation of Concept Maps that we call \"QMap.\" We conducted a four-month study with 19 undergraduate students. Students sustained voluntary contributions, creating 992 good questions, and drawing 1,255 meaningful links between the questions. Through analyzing self-reports, observations, and usage data, we report on the technical and social design features that led students to sustain their motivation.",
  "tags": [
    "learnersourcing",
    "cscl",
    "intrinsic motivation",
    "collaborative learning",
    "question generation",
    "learner-centered design",
    "concept mapping"
  ],
  "authors": [
    {
      "name": "Iman Yeckehzaare",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659352229",
      "orcid": "missing"
    },
    {
      "name": "Tirdad Barghi",
      "institution": "Independent Scholar, Tehran, Iran",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528433",
      "orcid": "missing"
    },
    {
      "name": "Paul Resnick",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100225915/rel-imgonly/resnick_paul_5x7.jpeg",
      "acmid": "81100225915",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Stephen J Aguilar, Caitlin Holman, and Barry J Fishman. 2018. Game-inspired design: Empirical evidence in support of gameful learning environments. Games and Culture 13, 1 (2018), 44--70.",
      "doi": ""
    },
    {
      "text": "David G Ausubel. 1963. Cognitive Structure and the Facilitation of Meaningful Verbal Learning. Journal of teacher education 14, 2 (1963), 217--222.",
      "doi": ""
    },
    {
      "text": "David P Ausubel. 1966. Ego development among segregated Negro children. In Mental Health and Segregation. Springer, 33--40.",
      "doi": ""
    },
    {
      "text": "Simon P Bates, Ross K Galloway, and Karon L McBride. 2012. Student-generated content: Using PeerWise to enhance engagement and outcomes in introductory physics courses. In AIP Conference Proceedings, Vol. 1413. AIP, 123--126.",
      "doi": ""
    },
    {
      "text": "Anita Berglund. 2015. What's in a Word? Concept mapping: a graphical tool to reinforce learning of epidemiological concepts. J Epidemiol Community Health (2015), jech--2014.",
      "doi": ""
    },
    {
      "text": "David Biggins, Emma J Crowley, Elvira Bolat, Mihai Dupac, and H Dogan. 2015. Using Peerwise to improve engagement and learning. The International Academic Forum (IAFOR).",
      "doi": ""
    },
    {
      "text": "Danielle Blouin. 2018. Impact of interpersonal relations on learning and development of professional identity: A study of residents' perceptions. Emergency Medicine Australasia 30, 3 (2018), 398--405.",
      "doi": ""
    },
    {
      "text": "Steven Bottomley and Paul Denny. 2011. A participatory learning approach to biochemistry using student authored and evaluated multiple-choice questions. Biochemistry and Molecular Biology Education 39, 5 (2011), 352--361.",
      "doi": ""
    },
    {
      "text": "David Boud. 2000. Sustainable assessment: rethinking assessment for the learning society. Studies in continuing education 22, 2 (2000), 151--167.",
      "doi": ""
    },
    {
      "text": "Susan M Bridges, Esmonde F Corbet, and Lap Ki Chan. 2015. Designing problem-based curricula: The role of concept mapping in scaffolding learning for the health sciences. Knowledge Management & E-Learning: An International Journal (2015).",
      "doi": ""
    },
    {
      "text": "Alberto J Cañas, Joseph D Novak, and Priit Reiska. 2015. How good is my concept map? Am I a good Cmapper? Knowledge Management & E-Learning 7, 1 (2015), 6.",
      "doi": ""
    },
    {
      "text": "Alberto J Cañas, Priit Reiska, and Joseph D Novak. 2016. Is My Concept Map Large Enough?. In International Conference on Concept Mapping. Springer, 128--143.",
      "doi": ""
    },
    {
      "text": "Paul Denny. 2013. The effect of virtual achievements on student engagement. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 763--772.",
      "doi": "10.1145/2470654.2470763"
    },
    {
      "text": "Paul Denny. 2015. Generating practice questions as a preparation strategy for introductory programming exams. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education. ACM, 278--283.",
      "doi": "10.1145/2676723.2677253"
    },
    {
      "text": "Paul Denny, Fiona McDonald, Ruth Empson, Philip Kelly, and Andrew Petersen. 2018. Empirical support for a causal relationship between gamification and learning outcomes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 311.",
      "doi": "10.1145/3173574.3173885"
    },
    {
      "text": "Paul Denny, Ewan Tempero, Dawn Garbett, and Andrew Petersen. 2017. Examining a Student-Generated Question Activity Using Random Topic Assignment. In Proceedings of the 2017 ACM Conference on Innovation and Technology in Computer Science Education. ACM, 146--151.",
      "doi": "10.1145/3059009.3059033"
    },
    {
      "text": "Stephen W Draper. 2009. Catalytic assessment: understanding how MCQs and EVS can foster deep learning. British Journal of Educational Technology 40, 2 (2009), 285--293.",
      "doi": ""
    },
    {
      "text": "Honglu Du, Mary Beth Rosson, and John M Carroll. 2012. Augmenting classroom participation through public digital backchannels. In Proceedings of the 17th ACM international conference on Supporting group work. ACM, 155--164.",
      "doi": "10.1145/2389176.2389201"
    },
    {
      "text": "Denis Duret, Rob Christley, Paul Denny, and Avril Senior. 2018. Collaborative learning with PeerWise. Research in Learning Technology 26 (Jan. 2018). DOI: http://dx.doi.org/10.25304/rlt.v26.1979",
      "doi": ""
    },
    {
      "text": "Martin R Fellenz. 2004. Using assessment to support higher level learning: the multiple choice item development assignment. Assessment & Evaluation in Higher Education 29, 6 (2004), 703--719.",
      "doi": ""
    },
    {
      "text": "Denae Ford, Kristina Lustig, Jeremy Banks, and Chris Parnin. 2018. We don't do that here: How collaborative editing with mentors improves engagement in social q&a communities. In Proceedings of the 2018 CHI conference on human factors in computing systems. ACM, 608.",
      "doi": "10.1145/3173574.3174182"
    },
    {
      "text": "Lawrence T Frase and Barry J Schwartz. 1975. Effect of question production and answering on prose recall. Journal of Educational Psychology 67, 5 (1975), 628.",
      "doi": ""
    },
    {
      "text": "JP Gerber, Ladd Wheeler, and Jerry Suls. 2018. A social comparison theory meta-analysis 60+ years on. Psychological bulletin 144, 2 (2018), 177.",
      "doi": ""
    },
    {
      "text": "Elena L Glassman, Aaron Lin, Carrie J Cai, and Robert C Miller. 2016. Learnersourcing personalized hints. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1626--1636.",
      "doi": "10.1145/2818048.2820011"
    },
    {
      "text": "Dale Hancock, Nicole Hare, Paul Denny, and Gareth Denyer. 2018. Improving large class performance and engagement through student-generated question banks. Biochemistry and Molecular Biology Education 46, 4 (2018), 306--317.",
      "doi": ""
    },
    {
      "text": "Derek L Hansen. 2006. Knowledge sharing, maintenance, and use in online support communities. In CHI'06 Extended Abstracts on Human Factors in Computing Systems. ACM, 1751--1754.",
      "doi": "10.1145/1125451.1125780"
    },
    {
      "text": "Judy Hardy, Simon P Bates, Morag M Casey, Kyle W Galloway, Ross K Galloway, Alison E Kay, Peter Kirsop, and Heather A McQueen. 2014. Student-generated content: Enhancing learning through sharing multiple-choice questions. International Journal of Science Education 36, 13 (2014), 2180--2194.",
      "doi": ""
    },
    {
      "text": "Stephen G Harkins and Jeffrey M Jackson. 1985. The role of evaluation in eliminating social loafing. Personality and Social Psychology Bulletin 11, 4 (1985), 457--465.",
      "doi": ""
    },
    {
      "text": "ASC Hooper, Simon Jigwan Park, and Gemma Gerondis. 2011. Promoting student participation and collaborative learning in a large INFO 101 class: Student perceptions of PeerWise Web 2.0 technology.. In Proceedings of Higher Education Research and Development Society of Australasia International Conference (HERDSA 2011).",
      "doi": ""
    },
    {
      "text": "Kiri Hunter and Catherine Cook. 2018. Role-modelling and the hidden curriculum: New graduate nurses' professional socialisation. Journal of clinical nursing (2018).",
      "doi": ""
    },
    {
      "text": "Sunyoung Joung and John M Keller. 2004. The Effects of High-Structure Cooperative versus Low-Structure Collaborative Design of Decision Change, Critical Thinking, and Interaction Pattern during Online Debates. Association for Educational Communications and Technology (2004).",
      "doi": ""
    },
    {
      "text": "Steven J Karau and Kipling D Williams. 1993. Social loafing: A meta-analytic review and theoretical integration. Journal of personality and social psychology 65, 4 (1993), 681.",
      "doi": ""
    },
    {
      "text": "John Keller and Katsuaki Suzuki. 2004. Learner motivation and e-learning design: A multinationally validated process. Journal of educational Media 29, 3 (2004), 229--239.",
      "doi": ""
    },
    {
      "text": "DoHyoung Kim and Frank M Shipman III. 2012. Visualizing history to improve users' location and comprehension of collaborative work. In Proceedings of the 17th ACM international conference on Supporting group work. ACM, 11--20.",
      "doi": "10.1145/2389176.2389179"
    },
    {
      "text": "Juho Kim, Philip J Guo, Carrie J Cai, Shang-Wen Daniel Li, Krzysztof Z Gajos, and Robert C Miller. 2014a. Data-driven interaction techniques for improving navigation of educational videos. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 563--572.",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Juho Kim, Phu Tran Nguyen, Sarah Weir, Philip J Guo, Robert C Miller, and Krzysztof Z Gajos. 2014b. Crowdsourcing step-by-step information extraction to enhance existing how-to videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 4017--4026.",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "Ian M Kinchin. 2016. Visualising powerful knowledge to develop the expert student: A knowledge structures perspective on teaching and learning at university. Springer.",
      "doi": ""
    },
    {
      "text": "Srikanth Kolluru. 2012. An active-learning assignment requiring pharmacy students to write medicinal chemistry examination questions. American Journal of Pharmaceutical Education 76, 6 (2012), 112.",
      "doi": ""
    },
    {
      "text": "George P Landow. 1989. The rhetoric of hypermedia: Some rules for authors. Journal of Computing in Higher Education 1, 1 (1989), 39--64.",
      "doi": ""
    },
    {
      "text": "John O Ledyard. 1994. Public goods: A survey of experimental research. (1994).",
      "doi": ""
    },
    {
      "text": "Mark R Lepper, David Greene, and Richard E Nisbett. 1973. Undermining children's intrinsic interest with extrinsic reward: A test of the\" overjustification\" hypothesis. Journal of Personality and social Psychology 28, 1 (1973), 129.",
      "doi": ""
    },
    {
      "text": "Liang-Yi Li and Chin-Chung Tsai. 2017. Accessing online learning material: Quantitative behavior patterns and their effects on motivation and learning performance. Computers & Education 114 (2017), 286--297.",
      "doi": "10.1016/j.compedu.2017.07.007"
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018. ConceptScape: Collaborative Concept Mapping for Video Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 387.",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Kathleen Luchini, Chris Quintana, and Elliot Soloway. 2004. Design guidelines for learner-centered handheld tools. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 135--142.",
      "doi": "10.1145/985692.985710"
    },
    {
      "text": "Andrew Luxton-Reilly, Daniel Bertinshaw, Paul Denny, Beryl Plimmer, and Robert Sheehan. 2012. The impact of question generation activities on performance. In Proceedings of the 43rd ACM technical symposium on Computer Science Education. ACM, 391--396.",
      "doi": "10.1145/2157136.2157250"
    },
    {
      "text": "Lena Mamykina, Thomas N Smyth, Jill P Dimond, and Krzysztof Z Gajos. 2016. Learning from the crowd: Observational learning in crowdsourcing communities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2635--2644.",
      "doi": "10.1145/2858036.2858560"
    },
    {
      "text": "HA McQueen, C Shields, DJ Finnegan, J Higham, and MW Simmen. 2014. PeerWise provides significant academic benefits to biological science students across diverse learning tasks, but with minimal instructor intervention. Biochemistry and Molecular Biology Education 42, 5 (2014), 371--381.",
      "doi": ""
    },
    {
      "text": "Scott A Miller and Celia A Brownell. 1975. Peers, persuasion, and Piaget: Dyadic interaction between conservers and nonconservers. Child Development (1975), 992--997.",
      "doi": ""
    },
    {
      "text": "David Nicol. 2007. E-assessment by design: using multiple-choice tests to good effect. Journal of Further and higher Education 31, 1 (2007), 53--64.",
      "doi": ""
    },
    {
      "text": "Joseph D Novak. 1990. Concept mapping: A useful tool for science education. Journal of research in science teaching 27, 10 (1990), 937--949.",
      "doi": ""
    },
    {
      "text": "Joseph D Novak. 2002. Meaningful learning: The essential factor for conceptual change in limited or inappropriate propositional hierarchies leading to empowerment of learners. Science education 86, 4 (2002), 548--571.",
      "doi": ""
    },
    {
      "text": "Joseph D Novak. 2011. A theory of education: Meaningful learning underlies the constructive integration of thinking, feeling, and acting leading to empowerment for commitment and responsibility. Meaningful Learning Review 1, 2 (2011), 1--14.",
      "doi": ""
    },
    {
      "text": "Joseph D Novak and Alberto J Cañas. 2008. The theory underlying concept maps and how to construct and use them. Florida Institute for Human and Machine Cognition (2008).",
      "doi": ""
    },
    {
      "text": "Ferry Novliadi, Rika Eliana, and others. 2017. Reducing Social Loafing Tendency Through Achievement Motivation Training. International Journal of Management Science and Business Administration 4, 1 (2017), 15--18.",
      "doi": ""
    },
    {
      "text": "Rianne Poot, Renske AM De Kleijn, Harold VM Van Rijen, and Jan van Tartwijk. 2017. Students generate items for an online formative assessment: Is it motivating? Medical teacher 39, 3 (2017), 315--320.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, Ko Kuwabara, Richard Zeckhauser, and Eric Friedman. 2000. Reputation systems. Commun. ACM 43, 12 (2000), 45--48.",
      "doi": "10.1145/355112.355122"
    },
    {
      "text": "C Scott Rigby, Edward L Deci, Brian C Patrick, and Richard M Ryan. 1992. Beyond the intrinsic-extrinsic dichotomy: Self-determination in motivation and learning. Motivation and emotion 16, 3 (1992), 165--185.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American psychologist 55, 1 (2000), 68.",
      "doi": ""
    },
    {
      "text": "Richard Michael Ryan and Edward Lewis Deci. 2016. Facilitating and hindering motivation, learning, and well-being in schools: Research and observations from self-determination theory. Handbook of motivation at school 96 (2016).",
      "doi": ""
    },
    {
      "text": "Andy Sharp and Angela Sutherland. 2007. Learning Gains... my (ARS) The Impact of Student Empowerment Using Audience Response Systems Technology on Knowledge Construction. In Student Engagement and Assessment REAP International Online Conference on Assessment Design for Learner Responsibility, 29th-31st May, Vol. 2007. 29--31.",
      "doi": ""
    },
    {
      "text": "Yih-Chearng Shiue, Chao-Min Chiu, and Chen-Chi Chang. 2010. Exploring and mitigating social loafing in online communities. Computers in Human Behavior 26, 4 (2010), 768--777.",
      "doi": "10.1016/j.chb.2010.01.014"
    },
    {
      "text": "Mel Silberman. 1996. Active Learning: 101 Strategies To Teach Any Subject. ERIC.",
      "doi": ""
    },
    {
      "text": "Christina De Simone, Richard F Schmid, and Laura A McEwen. 2001. Supporting the learning process with collaborative concept mapping using computer-based communication tools and processes. Educational research and evaluation 7, 2--3 (2001), 263--283.",
      "doi": ""
    },
    {
      "text": "Stephen Snow, Adriana Wilde, Paul Denny, and mc schraefel. 2019. A discursive question: Supporting student-authored multiple choice questions through peer-learning software in non-STEMM disciplines. British Journal of Educational Technology (2019).",
      "doi": ""
    },
    {
      "text": "Yang Song, Zhewei Hu, and Edward F Gehringer. 2016. Who Took Peer Review Seriously: Another Perspective on Student-Generated Quizzes.. In EDM (Workshops).",
      "doi": ""
    },
    {
      "text": "Robert Sternszus, Yvonne Steinert, Farhan Bhanji, Sero Andonian, and Linda S Snell. 2018. Evaluating a novel resident role-modelling programme. The clinical teacher 15, 3 (2018), 252--257.",
      "doi": ""
    },
    {
      "text": "Pei-Chen Sun, Ray J Tsai, Glenn Finger, Yueh-Yang Chen, and Dowming Yeh. 2008. What drives a successful e-Learning? An empirical investigation of the critical factors influencing learner satisfaction. Computers & education 50, 4 (2008), 1183--1202.",
      "doi": ""
    },
    {
      "text": "Chin-Chung Tsai, Sunny SJ Lin, and Shyan-Ming Yuan. 2002. Developing science activities through a networked peer assessment system. Computers & Education 38, 1--3 (2002), 241--252.",
      "doi": "10.1016/S0360-1315%2801%2900069-0"
    },
    {
      "text": "Lise Vesterlund. 2016. Using experimental methods to understand why and how we give to charity. Handbook of Experimental Economics 2 (2016), 91--151.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Judith S Olson, Jingwen Zhang, Trung Nguyen, and Gary M Olson. 2015. DocuViz: visualizing collaborative writing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1865--1874.",
      "doi": "10.1145/2702123.2702517"
    },
    {
      "text": "Xu Wang, Srinivasa Teja Talluri, Carolyn Rosé, and Kenneth Koedinger. 2019. UpGrade: Sourcing Student Open-Ended Solutions to Create Scalable Learning Opportunities. (2019).",
      "doi": ""
    },
    {
      "text": "Sarah Weir, Juho Kim, Krzysztof Z Gajos, and Robert C Miller. 2015. Learnersourcing subgoal labels for how-to videos. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 405--416.",
      "doi": "10.1145/2675133.2675219"
    },
    {
      "text": "James V Wertsch and Peeter Tulviste. 1992. LS Vygotsky and contemporary developmental psychology. Developmental psychology 28, 4 (1992), 548.",
      "doi": ""
    },
    {
      "text": "Joseph Jay Williams, Juho Kim, Anna Rafferty, Samuel Maldonado, Krzysztof Z Gajos, Walter S Lasecki, and Neil Heffernan. 2016. Axis: Generating explanations at scale with learnersourcing and machine learning. In Proceedings of the Third (2016) ACM Conference on Learning@ Scale. ACM, 379--388.",
      "doi": "10.1145/2876034.2876042"
    },
    {
      "text": "Kipling D Williams and Steven J Karau. 1991. Social loafing and social compensation: The effects of expectations of co-worker performance. Journal of personality and social psychology 61, 4 (1991), 570.",
      "doi": ""
    },
    {
      "text": "Chun-Ping Wu, Yu-Chi Chen, and Shu-ling Wu. 2018a. Development of a collaborative learning space for student generated-question strategy. In Proceedings of the 6th International Conference on Information and Education Technology. ACM, 102--105.",
      "doi": "10.1145/3178158.3178177"
    },
    {
      "text": "Chun-Ping Wu, Jie Tu, and Shu-ling Wu. 2018b. Design a reflective mechanism to engage students in student-constructed test activity. In Proceedings of the 6th International Conference on Information and Education Technology. ACM, 106--110.",
      "doi": "10.1145/3178158.3178178"
    },
    {
      "text": "Iman YeckehZaare, Paul Resnick, and Barbara Ericson. 2019. A Spaced, Interleaved Retrieval Practice Tool that is Motivating and Effective. In Proceedings of the 2019 ACM Conference on International Computing Education Research. ACM, 71--79.",
      "doi": "10.1145/3291279.3339411"
    },
    {
      "text": "Xi Zhang, Shan Jiang, and Yihang Cheng. 2017. Inferring the Student Social Loafing State in Collaborative Learning with a Hidden Markov Model: A Case on Slack. In Proceedings of the 26th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 149--152.",
      "doi": "10.1145/3041021.3054145"
    }
  ]
}