{
  "doi": "10.1145/3313831.3376552",
  "title": "MagneLayer: Force Field Fabrication by Layered Magnetic Sheets",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Magnets are very useful for the rapid prototyping of haptic interactions. However, it is difficult to arrange fine and complex magnetic fields rapidly. Therefore, we invented a method for fabricating complex geometric magnetic patterns by overlaying multiple magnetic rubber sheets. This method resolves the tradeoff between magnetized pattern complexity and the time required for magnetization. By layering multiple magnetic sheets that have simple magnetic patterns, various types of geometric magnetic patterns, such as checkered and diamond ones, can be generated on the top surface. By applying superposed magnetic fields, various types of tactile stimuli and haptic interaction can be created rapidly. Furthermore, the superposed magnetic fields can be changed dynamically by rotating the layered magnetic sheets. In this paper, we clarify the material requirements and describe the design method for creating these geometric magnetic patterns. We also demonstrate several of their applications.",
  "tags": [
    "diy",
    "tactile",
    "fabrication",
    "magnet",
    "haptic",
    "rapid prototyping"
  ],
  "authors": [
    {
      "name": "Kentaro Yasu",
      "institution": "NTT Communication Science Laboratories, Kanagawa, Japan",
      "img": "/do/10.1145/contrib-81470654779/rel-imgonly/img_7327_1_4_____.jpg",
      "acmid": "81470654779",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch. 2016. Personal Fabrication in HCI: Trends and Challenges. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, NY, NY, USA, 1--2. DOI: http://dx.doi.org/10.1145/2909132.2934645",
      "doi": "10.1145/2909132.2934645"
    },
    {
      "text": "Ayah Bdeir and Ted Ullrich. 2011. Electronics As Material: LittleBits. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, NY, NY, USA, 341--344. DOI: http://dx.doi.org/10.1145/1935701.1935781",
      "doi": "10.1145/1935701.1935781"
    },
    {
      "text": "J. M. Camacho and V Sosa. 2013. Alternative method to calculate the magnetic field of permanent magnets with azimuthal symmetry. Revista mexicana de física E 59 (06 2013), 8 -- 17. http://www.scielo.org.mx/scielo.php'script=sci_ arttext&pid=S1870--35422013000100002&nrm=iso",
      "doi": ""
    },
    {
      "text": "Jack Forman, Taylor Tabb, Youngwook Do, Meng-Han Yeh, Adrian Galvin, and Lining Yao. 2019. ModiFiber: Two-Way Morphing Soft Thread Actuators for Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 660, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300890",
      "doi": "10.1145/3290605.3300890"
    },
    {
      "text": "Yohei Fujii, Shogo Okamoto, and Yoji Yamada. 2016. Friction model of fingertip sliding over wavy surface for friction-variable tactile feedback panel. Advanced Robotics 30 (07 2016), 1--13. DOI: http://dx.doi.org/10.1080/01691864.2016.1208591",
      "doi": ""
    },
    {
      "text": "Daniel Groeger and Jürgen Steimle. 2019. LASEC: Instant Fabrication of Stretchable Circuits Using a Laser Cutter. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 699, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300929",
      "doi": "10.1145/3290605.3300929"
    },
    {
      "text": "Florian Heller, Jan Thar, Dennis Lewandowski, Mirko Hartmann, Pierre Schoonbrood, Sophy Stönner, Simon Voelker, and Jan Borchers. 2018. CutCAD - An Open-source Tool to Design 3D Objects in 2D. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 1135--1139. DOI: http://dx.doi.org/10.1145/3196709.3196800",
      "doi": "10.1145/3196709.3196800"
    },
    {
      "text": "Alexandra Ion, Robert Kovacs, Oliver S. Schneider, Pedro Lopes, and Patrick Baudisch. 2018. Metamaterial Textures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 336, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173910",
      "doi": "10.1145/3173574.3173910"
    },
    {
      "text": "Jaebong Lee, J. Ryu, and S. Choi. 2009. Vibrotactile score: A score metaphor for designing vibrotactile patterns. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 302--307. DOI: http://dx.doi.org/10.1109/WHC.2009.4810816",
      "doi": ""
    },
    {
      "text": "Azusa Kadomura and Itiro Siio. 2014. MagNail: Augmenting Nails with a Magnet to Detect User Actions Using a Smart Device. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, NY, NY, USA, 135--136. DOI: http://dx.doi.org/10.1145/2634317.2634333",
      "doi": "10.1145/2634317.2634333"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 363--372. DOI: http://dx.doi.org/10.1145/2493432.2493486",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Brett E. Kelly, Indrasen Bhattacharya, Hossein Heidari, Maxim Shusteff, Christopher M. Spadaccini, and Hayden K. Taylor. 2019. Volumetric additive manufacturing via tomographic reconstruction. Science 363, 6431 (2019), 1075--1079. DOI: http://dx.doi.org/10.1126/science.aau7114",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Liwei Chan, Hung-Yu Tseng, Han-Chih Kuo, Da-Yuan Huang, De-Nian Yang, and Bing-Yu Chen. 2014. GaussBricks: Magnetic Building Blocks for Constructive Tangible Interactions on Portable Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3153--3162. DOI: http://dx.doi.org/10.1145/2556288.2557105",
      "doi": "10.1145/2556288.2557105"
    },
    {
      "text": "Jonatan Martínez, Arturo S. García, Miguel Oliver, José P. Molina, and Pascual González. 2014. VITAKI: A Vibrotactile Prototyping Toolkit for Virtual Reality and Video Games. International Journal of Human-Computer Interaction 30, 11 (2014), 855--871. DOI: http://dx.doi.org/10.1080/10447318.2014.941272",
      "doi": ""
    },
    {
      "text": "Kouta Minamizawa, Yasuaki Kakehi, Masashi Nakatani, Soichiro Mihara, and Susumu Tachi. 2012. TECHTILE Toolkit: A Prototyping Tool for Design and Education of Haptic Media. In Proceedings of the 2012 Virtual Reality International Conference (VRIC '12). ACM, NY, NY, USA, Article 26, 2 pages. DOI: http://dx.doi.org/10.1145/2331714.2331745",
      "doi": "10.1145/2331714.2331745"
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014a. WirePrint: 3D Printed Previews for Fast Prototyping. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 273--280. DOI: http://dx.doi.org/10.1145/2642918.2647359",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014b. faBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3827--3834. DOI: http://dx.doi.org/10.1145/2556288.2557005",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Masa Ogata. 2018. Magneto-Haptics: Embedding Magnetic Force Feedback for Physical Interactions. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 737--743. DOI: http://dx.doi.org/10.1145/3242587.3242615",
      "doi": "10.1145/3242587.3242615"
    },
    {
      "text": "Hayes Solos Raffle, Amanda J. Parkes, and Hiroshi Ishii. 2004. Topobo: A Constructive Assembly System with Kinetic Memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 647--654. DOI: http://dx.doi.org/10.1145/985692.985774",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Thierry Rayna and Ludmila Striukova. 2016. From rapid prototyping to home fabrication: How 3D printing is changing business model innovation. Technological Forecasting and Social Change 102 (2016), 214 -- 224. DOI: http://dx.doi.org/https://doi.org/10.1016/j.techfore.2015.07.023",
      "doi": ""
    },
    {
      "text": "Maria Shugrina, Ariel Shamir, and Wojciech Matusik. 2015. Fab Forms: Customizable Objects for Fabrication with Validity and Geometry Caching. ACM Trans. Graph. 34, 4, Article 100 (July 2015), 12 pages. DOI: http://dx.doi.org/10.1145/2766994",
      "doi": "10.1145/2766994"
    },
    {
      "text": "Maxim Shusteff, Allison E. M. Browar, Brett E. Kelly, Johannes Henriksson, Todd H. Weisgraber, Robert M. Panas, Nicholas X. Fang, and Christopher M. Spadaccini. 2017. One-step volumetric additive manufacturing of complex polymer structures. Science Advances 3, 12 (2017). DOI: http://dx.doi.org/10.1126/sciadv.aao5496",
      "doi": ""
    },
    {
      "text": "C. Swindells, S. Pietarinen, and A. Viitanen. 2014. Medium fidelity rapid prototyping of vibrotactile haptic, audio and video effects. In 2014 IEEE Haptics Symposium (HAPTICS). 515--521. DOI: http://dx.doi.org/10.1109/HAPTICS.2014.6775509",
      "doi": ""
    },
    {
      "text": "Haruki Takahashi and Homei Miyashita. 2016. Thickness Control Technique for Printing Tactile Sheets with Fused Deposition Modeling. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, NY, NY, USA, 51--53. DOI: http://dx.doi.org/10.1145/2984751.2985701",
      "doi": "10.1145/2984751.2985701"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 569, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174143",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Malte Weiss, Chat Wacharamanotham, Simon Voelker, and Jan Borchers. 2011. FingerFlux: Near-surface Haptic Feedback on Tabletops. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 615--620. DOI: http://dx.doi.org/10.1145/2047196.2047277",
      "doi": "10.1145/2047196.2047277"
    },
    {
      "text": "Zhijie Yang, Jingjing Wei, Konrad Gizynski, Myung-Geun Song, and Bartosz A. Grzybowski. 2017. Interference-like patterns of static magnetic fields imprinted into polymer/nanoparticle composites. Nature Communications 8, 1 (2017), 1564. DOI: http://dx.doi.org/10.1038/s41467-017-01861--1",
      "doi": ""
    },
    {
      "text": "Kentaro Yasu. 2017. Magnetic Plotter: A Macrotexture Design Method Using Magnetic Rubber Sheets. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4983--4993. DOI: http://dx.doi.org/10.1145/3025453.3025702",
      "doi": "10.1145/3025453.3025702"
    },
    {
      "text": "Kentaro Yasu. 2019. Magnetact: Magnetic-sheet-based Haptic Interfaces for Touch Devices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 240, 8 pages. DOI: http://dx.doi.org/10.1145/3290605.3300470",
      "doi": "10.1145/3290605.3300470"
    },
    {
      "text": "Kentaro Yasu and Yuichiro Katsumoto. 2015. Bump Ahead: Easy-to-design Haptic Surface Using Magnet Array. In SIGGRAPH Asia 2015 Emerging Technologies (SA '15). ACM, NY, NY, USA, Article 3, 3 pages. DOI: http://dx.doi.org/10.1145/2818466.2818478",
      "doi": "10.1145/2818466.2818478"
    },
    {
      "text": "Yang Zhang, Gierad Laput, and Chris Harrison. 2017. Electrick: Low-Cost Touch Sensing Using Electric Field Tomography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1--14. DOI: http://dx.doi.org/10.1145/3025453.3025842",
      "doi": "10.1145/3025453.3025842"
    },
    {
      "text": "Clement Zheng, Jeeeun Kim, Daniel Leithinger, Mark D. Gross, and Ellen Yi-Luen Do. 2019a. Mechamagnets: Designing and Fabricating Haptic and Functional Physical Inputs with Embedded Magnets. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 325--334. DOI: http://dx.doi.org/10.1145/3294109.3295622",
      "doi": "10.1145/3294109.3295622"
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019b. Sensing Kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, NY, NY, USA, 921--934. DOI: http://dx.doi.org/10.1145/3322276.3323689",
      "doi": "10.1145/3322276.3323689"
    },
    {
      "text": "Kening Zhu and Shengdong Zhao. 2013. AutoGami: A Low-cost Rapid Prototyping Toolkit for Automated Movable Paper Craft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 661--670. DOI: http://dx.doi.org/10.1145/2470654.2470748",
      "doi": "10.1145/2470654.2470748"
    }
  ]
}