{
  "doi": "10.1145/3313831.3376549",
  "title": "Private Responses for Public Sharing: Understanding Self-Presentation and Relational Maintenance via Stories in Social Media",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "With nearly two billion users, social media Stories-an ephemeral format of sharing-are increasingly popular and projected to overtake sharing via public feeds. Sharing via Stories differs from Feeds sharing by removing the visible feedback (e.g. \"likes\" and \"comments\") which has come to characterize social media. Given the salience of responses visibility to self-presentation and relational maintenance in social media literature, we conducted semi-structured interviews (N = 22) to explore how people understand these processes when using Stories. We find that users have lower expectations for responses with Stories and experience lower pressure for self-presentation. This fosters more frequent sharing and a sense of daily connectedness, which strong ties can find valuable. Finally, the act of viewing takes on new significance of signaling attention when made known to the sharer. Our findings point to the importance of effort and attention in understanding responses on social media.",
  "tags": [
    "social media",
    "self-presentation",
    "relational maintenance",
    "stories"
  ],
  "authors": [
    {
      "name": "Penny Trieu",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320211",
      "orcid": "missing"
    },
    {
      "name": "Nancy K. Baym",
      "institution": "Microsoft Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528213",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bazarova, N. N. and Choi, Y. H. Self-disclosure in social media: Extending the functional approach to disclosure motivations and characteristics on social network sites. Journal of Communication, 64, 4 (2014), 635--657.",
      "doi": ""
    },
    {
      "text": "Vitak, J. and Kim, J. 2014. You can't block people offline: Examining how Facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM. New York, NY.",
      "doi": ""
    },
    {
      "text": "Madden, M., Lenhart, A., Cortesi, S., Gasser, U., Duggan, M., Smith, A. and Beaton, M. Teens, social media, and privacy. Pew Research Center, 21 (2013), 2--86.",
      "doi": ""
    },
    {
      "text": "Ellison, N. B., Vitak, J., Gray, R. and Lampe, C. Cultivating social resources on social network sites: Facebook relationship maintenance behaviors and their role in social capital processes. Journal of Computer?Mediated Communication, 19, 4 (2014), 855--870.",
      "doi": ""
    },
    {
      "text": "Sherman, L. E., Payton, A. A., Hernandez, L. M., Greenfield, P. M. and Dapretto, M. The power of the like in adolescence: Effects of peer influence on neural and behavioral responses to social media. Psychological science, 27, 7 (2016), 1027--1035.",
      "doi": ""
    },
    {
      "text": "Walther, J. B., Van Der Heide, B., Hamel, L. M. and Shulman, H. C. Self-generated versus other-generated statements and impressions in computer-mediated communication: A test of warranting theory using Facebook. Communication research, 36, 2 (2009), 229--253.",
      "doi": ""
    },
    {
      "text": "DeAndrea, D. C., Van Der Heide, B. and Easley, N. How modifying third-party information affects interpersonal impressions and the evaluation of collaborative online media. Journal of Communication, 65, 1 (2014), 62--78.",
      "doi": ""
    },
    {
      "text": "Carr, C. T. and Foreman, A. C. Identity shift III: Effects of publicness of feedback and relational closeness in computer-mediated communication. Media Psychology, 19, 2 (2016), 334--358.",
      "doi": ""
    },
    {
      "text": "Treem, J. W. and Leonardi, P. M. Social media use in organizations: Exploring the affordances of visibility, editability, persistence, and association. Annals of the International Communication Association, 36, 1 (2013), 143--189.",
      "doi": ""
    },
    {
      "text": "2019. Number of daily active WhatsApp Status users from 1st quarter 2017 to 1st quarter 2019. https://www.statista.com/statistics/730306/whatsapp-status-dau/",
      "doi": ""
    },
    {
      "text": "Statt, N. 2019. Facebook Stories somehow hits 500 million daily users. https://www.theverge.com/2019/4/24/18514955/facebook-stories-500-million-monthly-users-advertising-instagram-snapchat",
      "doi": ""
    },
    {
      "text": "Constine, J. 2018. Stories are about to surpass feed sharing. Now what? https://techcrunch.com/2018/05/02/stories-are-about-to-surpass-feed-sharing-now-what/",
      "doi": ""
    },
    {
      "text": "Bernstein, M. S., Bakshy, E., Burke, M. and Karrer, B. 2013. Quantifying the invisible audience in social networks. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM. New York, NY.",
      "doi": ""
    },
    {
      "text": "DeVito, M. A., Birnholtz, J. and Hancock, J. T. 2017. Platforms, People, and Perception: Using Affordances to Understand Self-Presentation on Social Media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM. New York, NY.",
      "doi": ""
    },
    {
      "text": "Etherington, D. 2013. Snapchat Gets Its Own Timeline With Snapchat Stories, 24-Hour Photo & Video Tales. https://techcrunch.com/2013/10/03/snapchat-gets-its-own-timeline-with-snapchat-stories-24-hour-photo-video-tales/",
      "doi": ""
    },
    {
      "text": "Constine, J. 2016. Instagram launches \"Stories,\" a Snapchatty feature for imperfect sharing. https://techcrunch.com/2016/08/02/instagram-stories/",
      "doi": ""
    },
    {
      "text": "Leary, M. R. Self-presentation: Impression management and interpersonal behavior. Brown & Benchmark Publishers, 1995.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. Anchor, New York, NY, 1959.",
      "doi": ""
    },
    {
      "text": "Bayer, J. B., Tri?u, P. and Ellison, N. B. Social Media Elements, Ecologies, and Effects. Annual review of psychology, 71 (2020).",
      "doi": ""
    },
    {
      "text": "Hampton, K. N., Goulet, L. S., Rainie, L. and Purcell, K. Social networking sites and our lives. Pew Internet & American Life Project, 16 (2011), 1--85.",
      "doi": ""
    },
    {
      "text": "boyd, d. It's complicated: The social lives of networked teens. Yale University Press, 2014.",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Marwick, A. E. and boyd, d. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New media & society, 13, 1 (2011), 114--133.",
      "doi": ""
    },
    {
      "text": "Hogan, B. The presentation of self in the age of social media: Distinguishing performances and exhibitions online. Bulletin of Science, Technology & Society, 30, 6 (2010), 377--386.",
      "doi": ""
    },
    {
      "text": "Scissors, L. E., Burke, M. and Wengrovitz, S. 2016. What's in a Like?: Attitudes and behaviors around receiving Likes on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM. New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Morlok, T., Schneider, K., Matt, C. and Hess, T. Snap. Share. 2017. (Don't) Care? Ephemerality, Privacy Concerns, and the Use of Ephemeral Social Network Sites. In 23rd Americas Conference on Information Systems (AMCIS). Boston, USA.",
      "doi": ""
    },
    {
      "text": "Taber, L. and Whittaker, S. 2018. Personality Depends on The Medium: Differences in Self-Perception on Snapchat, Facebook and Offline. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM. New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Duffy, B. E. and Chan, N. K. \"You never really know who's looking\": Imagined surveillance across social media platforms. New Media & Society (2019), 21(1), 119--138.",
      "doi": ""
    },
    {
      "text": "McRoberts, S., Ma, H., Hall, A. and Yarosh, S. 2017. Share First, Save Later: Performance of Self through Snapchat Stories. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Xu, B., Chang, P., Welker, C. L., Bazarova, N. N. and Cosley, D. 2016. Automatic archiving versus default deletion: what Snapchat tells us about ephemerality in design. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. ACM. New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Bayer, J. B., Ellison, N. B., Schoenebeck, S. Y. and Falk, E. B. Sharing the small moments: ephemeral social interaction on Snapchat. Information, Communication & Society, 19, 7 (2016), 956--977.",
      "doi": ""
    },
    {
      "text": "Zhao, X., Lampe, C. and Ellison, N. B. 2016. The social media ecology: User perceptions, strategies and challenges. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM. New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Dindia, K. and Canary, D. Definitions and theoretical perspectives on maintaining relationships. Journal of Social and Personal Relationships, 10, 2 (1993), 163--173.",
      "doi": ""
    },
    {
      "text": "Burke, M. and Develin, M. 2016. Once more with feeling: Supportive responses to social sharing on facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM. New York, NY.",
      "doi": ""
    },
    {
      "text": "Burke, M. and Kraut, R. E. The relationship between Facebook use and well?being depends on communication type and tie strength. Journal of Computer-Mediated Communication, 21, 4 (2016), 265--281.",
      "doi": "10.1111/jcc4.12162"
    },
    {
      "text": "French, M. and Bazarova, N. N. Is Anybody Out There?: Understanding Masspersonal Communication Through Expectations for Response Across Social Media Platforms. Journal of Computer?Mediated Communication, 22, 6 (2017), 303--319.",
      "doi": ""
    },
    {
      "text": "Hayes, R. A., Carr, C. T. and Wohn, D. Y. One click, many meanings: Interpreting paralinguistic digital affordances in social media. Journal of Broadcasting & Electronic Media, 60, 1 (2016), 171--187.",
      "doi": ""
    },
    {
      "text": "Sumner, E. M., Ruge-Jones, L. and Alcorn, D. A functional approach to the Facebook Like button: An exploration of meaning, interpersonal functionality, and potential alternative response buttons. New Media & Society, 20, 4 (2018), 1451--1469.",
      "doi": ""
    },
    {
      "text": "Bazarova, N. N., Choi, Y. H., Schwanda Sosik, V., Cosley, D. and Whitlock, J. 2015. Social sharing of emotions on Facebook: Channel differences, satisfaction, and replies. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM. New York, NY.",
      "doi": ""
    },
    {
      "text": "Grinberg, N., Kalyanaraman, S., Adamic, L. A. and Naaman, M. 2017. Understanding Feedback Expectations on Facebook. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. New York, NY.",
      "doi": ""
    },
    {
      "text": "Trieu, P. and Ellison, N. 2018. Channel navigation in interpersonal communication: Contemporary practices and proposed future research directions. In A Networked Self and Love. Routledge. London, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Haimson, O. L., Andalibi, N., De Choudhury, M. and Hayes, G. R. Relationship breakup disclosures and media ideologies on Facebook. New Media & Society (2018), 20(5), 1931--1952.",
      "doi": ""
    },
    {
      "text": "Vitak, J. and Ellison, N. B. 'There's a network out there you might as well tap': Exploring the benefits of and barriers to exchanging informational and support-based resources on Facebook. New Media & Society, 15, 2 (2013), 243--259.",
      "doi": ""
    },
    {
      "text": "Andalibi, N. and Forte, A. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Bazarova, N. N. Public intimacy: Disclosure interpretation and social judgments on Facebook. Journal of Communication, 62, 5 (2012), 815--832.",
      "doi": ""
    },
    {
      "text": "Hoyle, R., Das, S., Kapadia, A., Lee, A. J. and Vaniea, K. 2017. Viewing the Viewers: Publishers' Desires and Viewers' Privacy Concerns in Social Networks. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM. New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Hoyle, R., Das, S., Kapadia, A., Lee, A. J. and Vaniea, K. 2017. Was my message read?: Privacy and Signaling on Facebook Messenger. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM. New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Mai, L. M., Freudenthaler, R., Schneider, F. M. and Vorderer, P. \"I know you've seen it!\" Individual and social factors for users' chatting behavior on Facebook. Computers in Human Behavior, 49 (2015), 296--302.",
      "doi": "10.1016/j.chb.2015.01.074"
    },
    {
      "text": "Smith, A. and Anderson, M. 2018. Social Media Use in 2018. https://www.pewresearch.org/internet/2018/03/01/social-media-use-in-2018/",
      "doi": ""
    },
    {
      "text": "Alhabash, S. and Ma, M. A Tale of Four Platforms: Motivations and Uses of Facebook, Twitter, Instagram, and Snapchat Among College Students? Social Media+ Society, 3, 1 (2017), 2056305117691544.",
      "doi": ""
    },
    {
      "text": "Charmaz, K. Constructing grounded theory: A practical guide through qualitative analysis. Sage, 2006.",
      "doi": ""
    },
    {
      "text": "Baym, N. K. A call for grounding in the face of blurred boundaries. Journal of Computer-Mediated Communication, 14, 3 (2009), 720--723.",
      "doi": ""
    },
    {
      "text": "Kelly, R., Gooch, D. and Watts, L. 'It's More Like a Letter': An Exploration of Mediated Conversational Effort in Message Builder. Proceedings of the ACM on Human-Computer Interaction, 2, CSCW (2018), 87.",
      "doi": "10.1145/3274356"
    },
    {
      "text": "Donath, J. Signals in social supernets. Journal of Computer-Mediated Communication, 13, 1 (2007), 231--251.",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Thompson, R. 2016. This Snapchat feature can tell you if your crush is into you.",
      "doi": ""
    },
    {
      "text": "Gershon, I. Media ideologies: An introduction. Journal of Linguistic Anthropology, 20, 2 (2010), 283--293.",
      "doi": ""
    },
    {
      "text": "Conger, K. 2019. Facebook Tests Hiding 'Likes' on Social Media Posts. https://www.nytimes.com/2019/09/26/technology/facebook-hidden-likes.html",
      "doi": ""
    },
    {
      "text": "Holmes, R. Are Facebook Groups The Future Of Social Media (Or A Dead End)? https://www.forbes.com/sites/ryanholmes/2018/10/29/are-facebook-groups-the-future-of-social-media-or-a-dead-end/#7ba6c9861d23",
      "doi": ""
    },
    {
      "text": "Leung, H. 2019. Would It Be Better If You Couldn't See How Many Likes a Photo Got? Instagram is Testing to Find Out. https://time.com/5580887/instagram-likes-new-features/",
      "doi": ""
    },
    {
      "text": "Krämer, N. C., Neubaum, G., Hirt, M., Knitter, C., Ostendorf, S. and Zeru, S. \"I see you, I know you, it feels good\"--Qualitative and quantitative analyses of ambient awareness as a potential mediator of social networking sites usage and well-being. Computers in Human Behavior, 77 (2017), 77--85.",
      "doi": ""
    },
    {
      "text": "Levordashka, A. and Utz, S. Ambient awareness: From random noise to digital closeness in online social networks. Computers in Human Behavior, 60 (2016), 147--154.",
      "doi": "10.1016/j.chb.2016.02.037"
    }
  ]
}