{
  "doi": "10.1145/3313831.3376297",
  "title": "GoTree: A Grammar of Tree Visualizations",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We present GoTree, a declarative grammar allowing users to instantiate tree visualizations by specifying three aspects: visual elements, layout, and coordinate system. Within the set of all possible tree visualization techniques, we identify a subset of techniques that are both \"unit-decomposable\" and \"axis-decomposable\" (terms we define). For tree visualizations within this subset, GoTree gives the user flexible and fine-grained control over the parameters of the techniques, supporting both explicit and implicit tree visualizations. We developed Tree Illustrator, an interactive authoring tool based on GoTree grammar. Tree Illustrator allows users to create a considerable number of tree visualizations, including not only existing techniques but also undiscovered and hybrid visualizations. We demonstrate the expressiveness and generative power of GoTree with a gallery of examples and conduct a qualitative study to validate the usability of Tree Illustrator.",
  "tags": [
    "authoring tool",
    "\"tree visualization",
    "hierarchical data visualization\"",
    "declarative grammar"
  ],
  "authors": [
    {
      "name": "Guozheng Li",
      "institution": "Peking University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526587",
      "orcid": "missing"
    },
    {
      "name": "Min Tian",
      "institution": "Peking University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526648",
      "orcid": "missing"
    },
    {
      "name": "Qinmei Xu",
      "institution": "Peking University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527709",
      "orcid": "missing"
    },
    {
      "name": "Michael J. McGuffin",
      "institution": "École de Technologie Supérieure, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100605090",
      "orcid": "missing"
    },
    {
      "name": "Xiaoru Yuan",
      "institution": "Peking University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444592554",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "https://www.tableau.com/.",
      "doi": ""
    },
    {
      "text": "Narendra Ahuja. 1986. Efficient planar embedding of trees for VLSI layouts. Computer Vision, Graphics, and Image Processing 34, 2 (1986), 189--203.",
      "doi": "10.1016/S0734-189X%2886%2980058-5"
    },
    {
      "text": "James F. Allen. 1983. Maintaining Knowledge about Temporal Intervals. Commun. ACM 26, 11 (1983), 832--843.",
      "doi": "10.1145/182.358434"
    },
    {
      "text": "Greg J. Badros, Alan Borning, and Peter J. Stuckey. 2001. The Cassowary Linear Arithmetic Constraint Solving Algorithm. ACM Transactions on Computer-Human Interaction 8, 4 (2001), 267--306.",
      "doi": "10.1145/504704.504705"
    },
    {
      "text": "S. Todd Barlow and Padraic Neville. 2001. A comparison of 2-D visualizations of hierarchies. In Proc. IEEE Symp. Information Visualization (InfoVis). 131--138.",
      "doi": ""
    },
    {
      "text": "Thomas Baudel and Bertjan Broeksema. 2012. Capturing the Design Space of Sequential Space-Filling Layouts. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2593--2602.",
      "doi": "10.1109/TVCG.2012.205"
    },
    {
      "text": "Florian Block, Michael S Horn, Brenda Caldwell Phillips, Judy Diamond, E Margaret Evans, and Chia Shen. 2012. The DeepTree exhibit: Visualizing the tree of life to facilitate informal learning. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2789--2798.",
      "doi": "10.1109/TVCG.2012.272"
    },
    {
      "text": "Michael Bostock and Jeffrey Heer. 2009. Protovis: A Graphical Toolkit for Visualization. IEEE Transactions on Visualization and Computer Graphics 15, 6 (2009), 1121--1128.",
      "doi": "10.1109/TVCG.2009.174"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2301--2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Mark Bruls, Kees Huizing, and Jarke J. van Wijk. 2000. Squarified Treemaps. In Proc. Eurographics and IEEE TCVG Symposium on Visualization (VisSym). 33--42.",
      "doi": ""
    },
    {
      "text": "Michael Burch, Michael Raschke, and Daniel Weiskopf. 2010. Indented Pixel Tree Plots. In Proc. Int. Symp. Advances in Visual Computing (ISVC). 338--349.",
      "doi": "10.1007/978-3-642-17289-2_33"
    },
    {
      "text": "Wetherell Charles and Shannon Alfred. 1979. Tidy Drawings of Trees. IEEE Transactions on Software Engineering SE-5, 5 (1979), 514--520.",
      "doi": ""
    },
    {
      "text": "Hyungsuk Choi, Woohyuk Choi, Tran Minh Quan, David G. C. Hildebrand, Hanspeter Pfister, and Won-Ki Jeong. 2014. Vivaldi: A Domain-Specific Language for Volume Processing and Visualization on Distributed Heterogeneous Systems. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 2407--2416.",
      "doi": ""
    },
    {
      "text": "Ana M. Cuadros, Fernando Vieira Paulovich, Rosane Minghim, and Guilherme P. Telles. 2007. Point Placement by Phylogenetic Trees and its Application to Visual Analysis of Document Collections. In Proc. IEEE Symp. Visual Analytics Science And Technology (VAST). 99--106.",
      "doi": ""
    },
    {
      "text": "Peter Eades. 1992. Drawing free trees. Bulletin of the Institute of Combinatorics and its Applications 5 (1992), 10--36.",
      "doi": ""
    },
    {
      "text": "David Eppstein. 2009. Visualizing BFS as a spiral. (2009).",
      "doi": ""
    },
    {
      "text": "Jochen Görtler, Christoph Schulz, Daniel Weiskopf, and Oliver Deussen. 2018. Bubble Treemaps for Uncertainty Visualization. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 719--728.",
      "doi": ""
    },
    {
      "text": "Wang Guanqun, Nakanishi Tsuneo, and Fukuda Akira. 2016. 2-D Layout for Tree Visualization: a survey. MATEC Web of Conferences 56 (2016), 01007.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Declarative Language Design for Interactive Visualization. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 1149--1156.",
      "doi": "10.1109/TVCG.2010.144"
    },
    {
      "text": "Jeffrey Heer, Stuart K. Card, and James A. Landay. 2005. Prefuse: a toolkit for interactive information visualization. In Proc. ACM Conf. Human Factors in Computing Systems (CHI). 421--430.",
      "doi": ""
    },
    {
      "text": "Allan Heydon and Greg Nelson. 1994. The Juno-2 constraint-based drawing editor. Technical Report 131a. Digital Systems Research.",
      "doi": ""
    },
    {
      "text": "Jane Hoffswell, Alan Borning, and Jeffrey Heer. 2018. SetCoLa: High-Level Constraints for Graph Layout. Computer Graphics Forum 37, 3 (2018), 537--548.",
      "doi": ""
    },
    {
      "text": "Danny Holten. 2006. Hierarchical Edge Bundles: Visualization of Adjacency Relations in Hierarchical Data. IEEE Transactions on Visualization and Computer Graphics 12, 5 (2006), 741--748.",
      "doi": "10.1109/TVCG.2006.147"
    },
    {
      "text": "Edwin P Curran Hongzhi Song and Roy Sterritt. 2002. FlexTree: visualising large quantities of hierarchical information. In Proc. IEEE International Conference on Systems, Man and Cybernetics (SMC).",
      "doi": ""
    },
    {
      "text": "Paul Hudak. 1996. Building Domain-Specific Embedded Languages. ACM Computing Surveys (CSUR) 28, 4es (1996), 196.",
      "doi": "10.1145/242224.242477"
    },
    {
      "text": "Jaemin Jo, Frédéric Vernier, Pierre Dragicevic, and Jean-Daniel Fekete. 2019. A Declarative Rendering Model for Multiclass Density Maps. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2019), 470--480.",
      "doi": "10.1109/TVCG.2018.2865141"
    },
    {
      "text": "Brian Johnson and Ben Shneiderman. 1991. Tree-maps: a space-filling approach to the visualization of hierarchical information structures. In Proc. IEEE Visualization (VIS). 284--291.",
      "doi": ""
    },
    {
      "text": "Thomas A. Keahey, Daniel J. Rope, and Graham J. Wills. 2018. Generating an Outside-in Hierarchical Tree Visualization. (2018).",
      "doi": ""
    },
    {
      "text": "Bernard Kerr. 2003. Thread Arcs: an email thread visualization. In Proc. IEEE Symp. Information Visualization (InfoVis). 211--218.",
      "doi": ""
    },
    {
      "text": "Nam Wook Kim, Eston Schweickart, Zhicheng Liu, Mira Dontcheva, Wilmot Li, Jovan Popovic, and Hanspeter Pfister. 2016. Data-driven guides: Supporting expressive design for information graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2016), 491--500.",
      "doi": "10.1109/TVCG.2016.2598620"
    },
    {
      "text": "Joseph B Kruskal and James M Landwehr. 1983. Icicle plots: Better displays for hierarchical clustering. The American Statistician 37, 2 (1983), 162--168.",
      "doi": ""
    },
    {
      "text": "Guozheng Li, Yu Zhang, Yu Dong, Jie Liang, Jinson Zhang, Jinsong Wang, Michael J. McGuffin, and Xiaoru Yuan. 2020. BarcodeTree: Scalable Comparison of Multiple Hierarchies. IEEE Transactions on Visualization and Computer Graphics 26, 1 (2020), 1022--1032.",
      "doi": ""
    },
    {
      "text": "Shaomeng Li, R Jordan Crouser, Garth Griffin, Connor Gramazio, Hans-Jörg Schulz, Hank Childs, and Remco Chang. 2015. Exploring hierarchical visualization designs using phylogenetic trees. In Visualization and Data Analysis. International Society for Optics and Photonics, SPIE, 68 -- 81.",
      "doi": ""
    },
    {
      "text": "Zhicheng Liu, John Thompson, Alan Wilson, Mira Dontcheva, James Delorey, Sam Grigg, Bernard Kerr, and John Stasko. 2018. Data Illustrator: Augmenting Vector Design Tools with Lazy Data Binding for Expressive Visualization Authoring. In Proc. ACM Conf. Human Factors in Computing Systems (CHI). ACM, 123:1--123:13.",
      "doi": "10.1145/3173574.3173697"
    },
    {
      "text": "Hao Lü and James Fogarty. 2008. Cascaded treemaps: examining the visibility and stability of structure in treemaps. In Proceedings of graphics interface. 259--266.",
      "doi": ""
    },
    {
      "text": "S MacNeil and Niklas Elmqvist. 2013. Visualization mosaics for multivariate visual exploration. Computer Graphics Forum 32, 6 (2013), 38--50.",
      "doi": "10.1111/cgf.12013"
    },
    {
      "text": "Jarke J. van Wijk Mark Bruls, Kees Huizing. 2000. Squarified Treemaps. In Proc. Eurographics / IEEE VGTC Conference on Visualization (EuroVis). 33--42.",
      "doi": ""
    },
    {
      "text": "Michael J. McGuffin and Jean-Marc Robert. 2010. Quantifying the Space-Efficiency of 2D Graphical Representations of Trees. Information Visualization 9, 2 (2010), 115--140.",
      "doi": "10.1145/1890886.1890889"
    },
    {
      "text": "Tamara Munzner, François Guimbretière, Serdar Tasiran, Li Zhang, and Yunhong Zhou. 2003. TreeJuxtaposer: Scalable Tree Comparison Using Focus+Context with Guaranteed Visibility. ACM Transactions on Graphics 22, 3 (2003), 453--462.",
      "doi": "10.1145/882262.882291"
    },
    {
      "text": "Petra Neumann, Stefan Schlechtweg, and Sheelagh Carpendale. 2005. ArcTrees: Visualizing Relations in Hierarchical Data. In Proc. Eurographics / IEEE VGTC Conference on Visualization (EuroVis). 53--60.",
      "doi": ""
    },
    {
      "text": "Benoît Otjacques, Monique Noirhomme, Xavier Gobert, Pierre Collin, and Fernand Feltz. 2007. Visualizing the activity of a web-based collaborative platform. In Proc. Int. Conf. Information Visualisation (IV). IEEE Computer Society, 251--256.",
      "doi": "10.1109/IV.2007.137"
    },
    {
      "text": "Deokgun Park, Steven M. Drucker, Roland Fernandez, and Niklas Elmqvist. 2018. Atom: A Grammar for Unit Visualizations. IEEE Transactions on Visualization and Computer Graphics 24, 12 (2018), 3032--3043.",
      "doi": ""
    },
    {
      "text": "Casey Reas and Ben Fry. 2007. Processing: A Programming Handbook for Visual Designers and Artists. MIT Press.",
      "doi": "10.5555/1296181"
    },
    {
      "text": "Edward M. Reingold and John S. Tilford. 1981. Tidier Drawings of Trees. IEEE Transactions on Software Engineering SE-7, 2 (1981), 223--228.",
      "doi": "10.1109/TSE.1981.234519"
    },
    {
      "text": "Donghao Ren, Bongshin Lee, and Matthew Brehmer. 2019. Charticulator: Interactive Construction of Bespoke Chart Layouts. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2019), 789--799.",
      "doi": "10.1109/TVCG.2018.2865158"
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014. Lyra: An Interactive Visualization Design Environment. Computer Graphics Forum 33, 3 (2014), 351--360.",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 341--350.",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Arvind Satyanarayan, Ryan Russell, Jane Hoffswell, and Jeffrey Heer. 2016. Reactive Vega: A Streaming Dataflow Architecture for Declarative Interactive Visualization. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 659--668.",
      "doi": "10.1109/TVCG.2015.2467091"
    },
    {
      "text": "Arvind Satyanarayan, Kanit Wongsuphasawat, and Jeffrey Heer. 2014. Declarative Interaction Design for Data Visualization. In Proc. ACM Conf. Symposium on User Interface Software and Technology (UIST). ACM, 669--678.",
      "doi": "10.1145/2642918.2647360"
    },
    {
      "text": "Hans-Jörg Schulz. 2011. Treevis.net: A Tree Visualization Reference. IEEE Computer Graphics and Applications 31, 6 (2011), 11--15.",
      "doi": "10.1109/MCG.2011.103"
    },
    {
      "text": "Hans-Jörg Schulz, Zabedul Akbar, and Frank Maurer. 2013. A generative layout approach for rooted tree drawings. In Proc. IEEE Pacific Visualization Symposium (PacificVis). 225--232.",
      "doi": ""
    },
    {
      "text": "Hans-Jörg Schulz and Steffen Hadlak. 2015. Preset-based generation and exploration of visualization designs. Journal of Visual Languages and Computing 31 (2015), 9--29.",
      "doi": "10.1016/j.jvlc.2015.09.004"
    },
    {
      "text": "Hans-Jörg Schulz, Steffen Hadlak, and Heidrun Schumann. 2011. The Design Space of Implicit Hierarchy Visualization: A Survey. IEEE Transactions on Visualization and Computer Graphics 17, 4 (2011), 393--411.",
      "doi": "10.1109/TVCG.2010.79"
    },
    {
      "text": "Jonathan Richard Shewchuk and others. 1994. An introduction to the conjugate gradient method without the agonizing pain. (1994).",
      "doi": ""
    },
    {
      "text": "Min Shih, Charles Rozhon, and Kwan-Liu Ma. 2019. A Declarative Grammar of Flexible Volume Visualization Pipelines. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2019), 1050--1059.",
      "doi": "10.1109/TVCG.2018.2864841"
    },
    {
      "text": "Ben Shneiderman. 1992. Tree Visualization with Tree-maps: 2-d Space-filling Approach. ACM Transactions on Graphics 11, 1 (1992), 92--99.",
      "doi": "10.1145/102377.115768"
    },
    {
      "text": "Aidan Slingsby, Jason Dykes, and Jo Wood. 2009. Configuring Hierarchical Layouts to Address Research Questions. IEEE Transactions on Visualization and Computer Graphics 15, 6 (2009), 977--984.",
      "doi": "10.1109/TVCG.2009.128"
    },
    {
      "text": "Weixin Wang, Hui Wang, Guozhong Dai, and Hongan Wang. 2006. Visualization of Large Hierarchical Data by Circle Packing. In Proc. ACM Conf. Human Factors in Computing Systems (CHI). ACM, 517--520.",
      "doi": "10.1145/1124772.1124851"
    },
    {
      "text": "Yun Wang, Haidong Zhang, He Huang, Xi Chen, Qiufeng Yin, Zhitao Hou, Dongmei Zhang, Qiong Luo, and Huamin Qu. 2018. InfoNice: Easy Creation of Information Graphics. In Proc. ACM Conf. Human Factors in Computing Systems (CHI). ACM, 335:1--335:12.",
      "doi": "10.1145/3173574.3173909"
    },
    {
      "text": "Hadley Wickham. 2016. ggplot2: Elegant Graphics for Data Analysis. Springer.",
      "doi": "10.5555/1795559"
    },
    {
      "text": "Leland Wilkinson. 2006. The Grammar of Graphics. Springer.",
      "doi": "10.5555/316575"
    },
    {
      "text": "Shengdong Zhao, Michael J. McGuffin, and Mark H. Chignell. 2005. Elastic Hierarchies: Combining Treemaps and Node-Link Diagrams. In Proc. IEEE Symp. Information Visualization (InfoVis). 57--64.",
      "doi": ""
    }
  ]
}