{
  "doi": "10.1145/3313831.3376831",
  "title": "A Postmortem on Playtesting: Exploring the Impact of Playtesting on the Critical Reception of Video Games",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Game studios aim to develop titles that deliver a fun and engaging experience for players. Playtesting promises to help identify opportunities to improve player experience and assist developers in achieving their design intent. However, a lack of research on the added value of playtesting means that many studios are still uncertain about its commercial viability and impact on product success. This gap in understanding is further complicated by the vague definition of \"success\" afforded by sales figures and review scores. In this paper, we assess reported feature quality of three commercial titles by analyzing playtesting reports and game reviews. By comparing themes and design issues expressed in game reviews to the results of pre-release playtesting for each game, we aim to highlight the value of playtesting and propose a set of guidelines for selecting playtest methods based on the needs of a given game evaluation. Through the real-world case studies presented, this paper contributes to the growing domain of games user research and highlights the value of playtesting in game development.",
  "authors": [
    {
      "name": "Pejman Mirza-Babaei",
      "institution": "Ontario Tech University, Oshawa, ON, Canada",
      "img": "/do/10.1145/contrib-81484656474/rel-imgonly/screenshot2012-02-16at20.43.31.png",
      "acmid": "81484656474",
      "orcid": "missing"
    },
    {
      "name": "Samantha Stahlke",
      "institution": "Ontario Tech University, Oshawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750771",
      "orcid": "missing"
    },
    {
      "name": "Günter Wallner",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493799",
      "orcid": "missing"
    },
    {
      "name": "Atiya Nova",
      "institution": "Ontario Tech University, Oshawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365986",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrea Abney, Brooke White, Jeremy Glick, Andre Bermudez, Paul Breckow, Jason Yow, Rayna Tillinghast-Trickett, and Paul Heath. 2014. Evaluation of Recording Methods for User Test Sessions on Mobile Devices. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play. ACM, NY, NY, USA, 1--8. DOI: http://dx.doi.org/10.1145/2658537.2658704",
      "doi": "10.1145/2658537.2658704"
    },
    {
      "text": "Regina Bernhaupt, Manfred Eckschlager, and Manfred Tscheligi. 2007. Methods for Evaluating Games: How to Measure Usability and User Experience in Games?. In Proceedings of the International Conference on Advances in Computer Entertainment Technology. ACM, NY, NY, USA, 309--310. DOI: http://dx.doi.org/10.1145/1255047.1255142",
      "doi": "10.1145/1255047.1255142"
    },
    {
      "text": "Regina Bernhaupt, Wijand Ijsselsteijn, Florian 'Floyd' Mueller, Manfred Tscheligi, and Dennis Wixon. 2008. Evaluating User Experiences in Games. In CHI '08 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 3905--3908. DOI: http://dx.doi.org/10.1145/1358628.1358953",
      "doi": ""
    },
    {
      "text": "Matthew Bond and Russell Beale. 2009. What Makes a Good Game?: Using Reviews to Inform Design. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology. British Computer Society, Swinton, UK, UK, 418--422.",
      "doi": ""
    },
    {
      "text": "Judeth Oden Choi, Jodi Forlizzi, Michael Christel, Rachel Moeller, MacKenzie Bates, and Jessica Hammer. 2016. Playtesting with a Purpose. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, NY, NY, USA, 254--265. DOI: http://dx.doi.org/10.1145/2967934.2968103",
      "doi": "10.1145/2967934.2968103"
    },
    {
      "text": "Anders Drachen, Pejman Mirza-Babaei, and Lennart E. Nacke. 2018. Games User Research. Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Mirjam P. Eladhari and Elina M. I. Ollila. 2012. Design for Research Results: Experimental Prototyping and Play Testing. Simulation & Gaming 43, 3 (2012), 391--412. DOI: http://dx.doi.org/10.1177/1046878111434255",
      "doi": "10.1177/1046878111434255"
    },
    {
      "text": "Rob Fahey. 2013. Nintendo in the Firing Line. (2013). https://www.gamesindustry.biz/articles/2013--12-05nintendo-in-the-firing-line Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Wes Fenlon. 2017. Steam Review Bombing is Working, and Chinese Players are a Powerful New Voice. (2017). https://www.pcgamer.com/steam-review-bombing-isworking-and-chinese-players-are-a-powerful-newvoice/ Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating Rigor Using Thematic Analysis: A Hybrid Approach of Inductive and Deductive Coding and Theme Development. International Journal of Qualitative Methods 5, 1 (2006), 80--92. DOI: http://dx.doi.org/10.1177/160940690600500107",
      "doi": ""
    },
    {
      "text": "Tracy Fullerton. 2008. Game Design Workshop: A Playcentric Approach to Creating Innovative Games. Morgan Kaufmann, Burlington, MA, USA.",
      "doi": ""
    },
    {
      "text": "Serena Hillman, Tad Stach, Jason Procyk, and Veronica Zammitto. 2016. Diary Methods in AAA Games User Research. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 1879--1885. DOI: http://dx.doi.org/10.1145/2851581.2892316",
      "doi": "10.1145/2851581.2892316"
    },
    {
      "text": "Effie Lai-Chong Law. 2011. The Measurability and Predictability of User Experience. In Proceedings of the 3rd ACM SIGCHI Symposium on Engineering Interactive Computing Systems. ACM, NY, NY, USA, 1--10. DOI: http://dx.doi.org/10.1145/1996461.1996485",
      "doi": ""
    },
    {
      "text": "Ian Livingston. 2018. Post-launch in Games User Research. In Games User Research, Anders Drachen, Pejman Mirza-Babaei, and Lennart Nacke (Eds.). Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Ian J. Livingston, Regan L. Mandryk, and Kevin G. Stanley. 2010. Critic-proofing: How Using Critic Reviews and Game Genres Can Refine Heuristic Evaluations. In Proceedings of the International Academic Conference on the Future of Game Design and Technology. ACM, NY, NY, USA, 48--55. DOI: http://dx.doi.org/10.1145/1920778.1920786",
      "doi": ""
    },
    {
      "text": "Ian J. Livingston, Lennart E. Nacke, and Regan L. Mandryk. 2011a. The Impact of Negative Game Reviews and User Comments on Player Experience. In ACM SIGGRAPH 2011 Game Papers. ACM, NY, NY, USA, 4:1--4:5. DOI: http://dx.doi.org/10.1145/2037692.2037697",
      "doi": ""
    },
    {
      "text": "Ian J. Livingston, Lennart E. Nacke, and Regan L. Mandryk. 2011b. Influencing Experience: The Effects of Reading Game Reviews on Player Experience. In Entertainment Computing -- ICEC 2011, Junia Coutinho Anacleto, Sidney Fels, Nicholas Graham, Bill Kapralos, Magy Saif El-Nasr, and Kevin Stanley (Eds.). Springer, Berlin, Heidelberg, 89--100.",
      "doi": ""
    },
    {
      "text": "Trevor McCalmont. 2015. 15 Metrics All Game Developers Should Know by Heart. (2015). https://gameanalytics.com/blog/metrics-all-gamedevelopers-should-know.html Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Kirk McKeand. 2017. A Brief History of how Steam Review Bombing Damages Developers. (2017). https://www.pcgamesn.com/history-of-steam-review-bombing Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Alec Meer. 2010. EEDAR study: Review Scores do Affect Sales. (2010). https://www.gamesindustry.biz/articles/eedar-reviewscores-do-affect-sales Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Pejman Mirza-Babaei, Naeem Moosajee, and Brandon Drenikow. 2016. Playtesting for Indie Studios. In Proceedings of the 20th International Academic Mindtrek Conference. ACM, NY, NY, USA, 366--374. DOI: http://dx.doi.org/10.1145/2994310.2994364",
      "doi": "10.1145/2994310.2994364"
    },
    {
      "text": "Pejman Mirza-Babaei, Veronica Zammitto, Jörg Niesenhaus, Mirweis Sangin, and Lennart Nacke. 2013. Games User Research: Practice, Methods, and Applications. In CHI '13 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 3219--3222. DOI: http://dx.doi.org/10.1145/2468356.2479651",
      "doi": "10.1145/2468356.2479651"
    },
    {
      "text": "Naeem Moosajee and Pejman Mirza-Babaei. 2016. Games User Research (GUR) for Indie Studios. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 3159--3165. DOI: http://dx.doi.org/10.1145/2851581.2892408",
      "doi": "10.1145/2851581.2892408"
    },
    {
      "text": "Lennart E. Nacke, Pejman Mirza-Babaei, and Anders Drachen. 2019. User Experience (UX) Research in Games. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, C25:1--C25:4. DOI: http://dx.doi.org/10.1145/3290607.3298826",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke, Christiane Moser, Anders Drachen, Pejman Mirza-Babaei, Andrea Abney, and Zhu (Cole) Zhenyu. 2016. Lightweight Games User Research for Indies and Non-Profit Organizations. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 3597--3603. DOI: http://dx.doi.org/10.1145/2851581.2856504",
      "doi": "10.1145/2851581.2856504"
    },
    {
      "text": "Jakob Nielsen. 1995. Severity Ratings for Usability Problems. Papers and Essays 54 (1995), 1--2.",
      "doi": ""
    },
    {
      "text": "Dana Ruggiero. 2017. How Game Developers Define Success. Presentation at GDC 2017. (2017). https://www.gdcvault.com/play/1023960/How-GameDevelopers-Define Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Chad Sapieha. 2019. Far Cry New Dawn review: Eminently playable, predictably repetitive. (2019). https://business.financialpost.com/technology/gaming/far-cry-new-dawn-review-eminently-playablepredictably-repetitive Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Jesse Schell. 2014. The Art of Game Design: A Deck of Lenses (2nd ed.). Schell Games.",
      "doi": ""
    },
    {
      "text": "Jason Schreier. 2015. Metacritic Matters: How Review Scores Hurt Video Games. (2015). https://kotaku.com/metacritic-matters-how-reviewscores-hurt-video-games-472462218 Accessed: September, 2019.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr, Heather Desurvire, Lennart Nacke, Anders Drachen, Licia Calvi, Katherine Isbister, and Regina Bernhaupt. 2012. Game User Research. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 2679--2682. DOI: http://dx.doi.org/10.1145/2212776.2212694",
      "doi": ""
    },
    {
      "text": "Matt Streit. 2018. ROI of UX: Making the Business Case. White paper (personal publication). (March 2018). https://docs.google.com/document/d/1J3jRbqKUjlwt4el82KL3kZ5y6mGHOOJY8jbrusYW8k/mobilebasic Accessed: January, 2020.",
      "doi": ""
    },
    {
      "text": "José P. Zagal, Amanda Ladd, and Terris Johnson. 2009. Characterizing and Understanding Game Reviews. In Proceedings of the 4th International Conference on Foundations of Digital Games. ACM, NY, NY, USA, 215--222. DOI: http://dx.doi.org/10.1145/1536513.1536553",
      "doi": "10.1145/1536513.1536553"
    },
    {
      "text": "José Pablo Zagal and Noriko Tomuro. 2013. Cultural Differences in Game Appreciation: A Study of Player Game Reviews. In Proceedings of the 8th International Conference on Foundations of Digital Games. 86--93.",
      "doi": ""
    },
    {
      "text": "Veronica Zammitto, Pejman Mirza-Babaei, Ian Livingston, Marina Kobayashi, and Lennart E. Nacke. 2014. Player Experience: Mixed Methods and Reporting Results. In CHI '14 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 147--150. DOI: http://dx.doi.org/10.1145/2559206.2559239",
      "doi": ""
    }
  ]
}