{
  "doi": "10.1145/3313831.3376517",
  "title": "Exploring the Potential of an Intelligent Tutoring System for Sketching Fundamentals",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Sketching is a practical and useful skill that can benefit communication and problem solving. However, it remains a difficult skill to learn because of low confidence and motivation among students and limited availability for instruction and personalized feedback among teachers. There is an need to improve the educational experience for both groups, and we hypothesized that integrating technology could provide a variety of benefits. We designed and developed an intelligent tutoring system for sketching fundamentals called Sketchtivity, and deployed it in to six existing courses at the high school and university level during the 2017-2018 school year. 268 students used the tool and produced more than 116,000 sketches of basic primitives. We conducted semi-structured interviews with the six teachers who implemented the software, as well as nine students from a course where the tool was used extensively. Using grounded theory, we found ten categories which unveiled the benefits and limitations of integrating an intelligent tutoring system for sketching fundamentals in to existing pedagogy.",
  "tags": [
    "human-computer interaction",
    "intelligent tutoring system",
    "art education",
    "sketch recognition",
    "sketching",
    "user experience design",
    "design education",
    "drawing"
  ],
  "authors": [
    {
      "name": "Blake Williford",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659182955",
      "orcid": "missing"
    },
    {
      "name": "Matthew Runyon",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659211232",
      "orcid": "missing"
    },
    {
      "name": "Wayne Li",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659074946",
      "orcid": "missing"
    },
    {
      "name": "Julie Linsey",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501671400",
      "orcid": "missing"
    },
    {
      "name": "Tracy Hammond",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/do/10.1145/contrib-81309486982/rel-imgonly/81309486982.jpg",
      "acmid": "81309486982",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albert Bandura. 1997. Self-Efficacy: The Exercise of Control(1st ed.). Worth Publishers, New York, New York, USA. ISBN=9780716728504.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2006. Guide for constructing self-efficacy scales. Self-efficacy beliefs of adolescents 5,1 (2006), 307--337.",
      "doi": ""
    },
    {
      "text": "Benjamin S Bloom. 1968. Learning for Mastery.Instruction and Curriculum. Regional Education Laboratory for the Carolinas and Virginia, Topical Papers and Reprints, Number 1.Evaluation comment1,2 (1968), n2.",
      "doi": ""
    },
    {
      "text": "David Boud, Ruth Cohen, and Jane Sampson. 2014. Peer learning in higher education: Learning from and with each other. Routledge.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis. Sage, London, United Kingdom. ISBN=978-0857029140.",
      "doi": ""
    },
    {
      "text": "Albert T Corbett, Kenneth R Koedinger, and John R Anderson. 1997. Intelligent tutoring systems. In Handbook of human-computer interaction. Elsevier,Netherlands, 849--874.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1996.Flow and the Psychology of Discovery and Invention. Harper Collins,New York.",
      "doi": ""
    },
    {
      "text": "Danielle Cummings, Francisco Vides, and Tracy Hammond. 2012. I Don't Believe My Eyes!: Geometric Sketch Recognition for a Computer Art Tutorial. In Proceedings of the International Symposium on Sketch-Based Interfaces and Modeling (SBIM '12). Eurographics Association, Aire-la-Ville, Switzerland,Switzerland, 97--106.",
      "doi": "10.5555/2331067.2331082"
    },
    {
      "text": "Karen Ernst da Silva. 2001. Drawing on Experience:Connecting Art and Language.Primary Voices K-610, 2(2001), 2--9. ERIC=EJ634470.",
      "doi": ""
    },
    {
      "text": "Daniel Dixon, Manoj Prasad, and Tracy Hammond.2010. iCanDraw: Using Sketch Recognition and Corrective Feedback to Assist a User in Drawing Human Faces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 10). ACM,New York, New York, USA, 897--906.DOI:http://dx.doi.org/10.1145/1753326.1753459",
      "doi": ""
    },
    {
      "text": "Ronald G. Ehrenberg, Dominic J. Brewer, Adam Gamoran, and J. Douglas Willms. 2001. Class Size and Student Achievement.Psychological Science in the Public Interest 2, 1 (May 2001), 1--30.",
      "doi": ""
    },
    {
      "text": "Koos Eissen and Roselien Steur. 2009.Sketching:Drawing Techniques for Product Designers(12 ed.). BIS Publishers, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Jennifer Fernquist, Tovi Grossman, and George Fitzmaurice. 2011. Sketch-Sketch Revolution: An Engaging Tutorial System for Guided Sketching and Application Learning. In Proceedings of the 24th annual ACM Symposium on User Interface Software and Technology. ACM, Santa Barbara, California, USA,373--382.http://www.jstor.org/stable/20715757",
      "doi": "10.1145/2047196.2047245"
    },
    {
      "text": "Ronald A Finke, Thomas B Ward, and Steven M Smith.1992. Creative cognition: Theory, research, and applications. MIT press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Kenneth Forbus, Dedre Gentner, Benjamin Jee, Bradley Sageman, and David Uttal. 2009. Drawing on Experience: Use of Sketching to Evaluate Knowledge of Spatial Scientific Concepts. In 31st Annual Meeting of the Cognitive Science Society 2009 (CogSci 2009),Vol. 31. Cognitive Science Society, New Jersey, USA,2499--2504.",
      "doi": ""
    },
    {
      "text": "Kenneth Forbus, Jeffrey Usher, Andrew Lovett, Kate Lockwood, and Jon Wetzel. 2011. CogSketch: Sketch understanding for cognitive science research and for education.Topics in Cognitive Science 3, 4 (2011),648--666.",
      "doi": ""
    },
    {
      "text": "Kenneth D Forbus, Jeffrey M Usher, Andrew M Lovett, Kate Lockwood, and Jon Wetzel. 2008. CogSketch: Open-domain Sketch Understanding for Cognitive Science Research and for Education.SBM8 (2008),159--166.",
      "doi": ""
    },
    {
      "text": "Barney G Glaser. 1965. The Constant Comparative Method of Qualitative Analysis.Social Problems 12, 4(1965), 436--445.DOI:http://dx.doi.org/10.2307/798843",
      "doi": ""
    },
    {
      "text": "Arthur C Graesser, Kurt VanLehn, Carolyn P Rosé,Pamela W Jordan, and Derek Harter. 2001. Intelligent tutoring systems with conversational dialogue. AImagazine22, 4 (2001), 39--39.",
      "doi": ""
    },
    {
      "text": "Tracy Hammond, Shalini Priya Ashok Kumar, Matthew Runyon, Josh Cherian, Blake Williford, Swarna Keshavabhotla, Stephanie Valentine, Wayne Li, and Julie Linsey. 2018. Its Not Just about Accuracy: Metrics That Matter When Modeling Expert Sketching Ability. ACM Transactions on Interactive Intelligent Systems (TiiS)8,3 (2018), 19.DOI:http://dx.doi.org/10.1145/3181673",
      "doi": ""
    },
    {
      "text": "James W Hennessey, Han Liu, Holger Winnemöller, Mira Dontcheva, and Niloy J Mitra. 2016. How2Sketch: generating easy-to-follow tutorials for sketching 3D objects. In I3D '17: Proceedings of the21st ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games. ACM, San Francisco, CA, Article 8, 11 pages. DOI:http://dx.doi.org/10.1145/3023368.3023371",
      "doi": ""
    },
    {
      "text": "Richard Hickman and Sarah Lord. 2009. An Examination of Adolescents' Self-Efficacy, Engagement and Achievement in Representational Drawing. Australian Art Education 32, 2 (2009), 73--85.",
      "doi": ""
    },
    {
      "text": "Ethan Hilton, Wayne Li, Sunni H Newton, Meltem Alemdar, Raghuram Pucha, and Julie Linsey. 2016. The Development and Effects of Teaching Perspective Free-Hand Sketching in Engineering Design. In ASME2016 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference. American Society of Mechanical Engineers (ASME), Charlotte, North Carolina, V003T04A013--V003T04A013.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides, James Aczel, Eileen Scanlon, JosieTaylor, and Will Woods. 2011. Motivation, Engagement and Learning through Digital Games. International Journal of Virtual and Personal Learning Environments(IJVPLE)2(2) (2011), 1--16.DOI:http://dx.doi.org/10.4018/jvple.2011040101",
      "doi": "10.4018/jvple.2011040101"
    },
    {
      "text": "Shari L Jackson, Joseph Krajcik, and Elliot Soloway. 1998. The design of guided learner-adaptable scaffolding in interactive learning environments. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co.,New York City, NY, 187--194.",
      "doi": "10.1145/274644.274672"
    },
    {
      "text": "E.E. Jones. 1922. The Correlation of Visual Memory and Perception of Perspective with Drawing Ability.School and Society 15 (1922), 174--176.",
      "doi": ""
    },
    {
      "text": "Swarna Keshavabhotla, Blake Williford, Ethan Hilton,Paul Taele, Wayne Li, Julie Linsey, and Tracy Hammond. 2017. Conquering the Cube: Learning to Sketch Primitives in Perspective with an Intelligent Tutoring System. In SBIM '17 Proceedings of the Symposium on Sketch-Based Interfaces and Modeling,Vol. 2. ACM, Los Angeles, CA, USA, 1--11.DOI:http://dx.doi.org/10.1145/3092907.3092911",
      "doi": "10.1145/3092907.3092911"
    },
    {
      "text": "Hong-hoe Kim, Paul Taele, Jinsilhwaryoung Seo, Jeffrey Liew, and Tracy Hammond. 2016. EasySketch 2: anovel sketch-based interface for improving children's fine motor skills and school readiness. In Proceedings of the Joint Symposium on Computational Aesthetics and Sketch Based Interfaces and Modeling and Non-Photorealistic Animation and Rendering. Eurographics Association, Lisbon, Portugal, 69--78.",
      "doi": ""
    },
    {
      "text": "Kenneth R Koedinger, John R Anderson, William H Hadley, and Mary A Mark. 1997. Intelligent tutoring goes to school in the big city.International Journal of Artificial Intelligence in Education (IJAIED)8 (1997),30--43.",
      "doi": ""
    },
    {
      "text": "Joseph A. Koncelik and Kevin Reeder. 2008.Conceptual Drawing(1sted.). Course Technology,Boston, Massachusetts, USA. ISBN=978--1418080976.",
      "doi": ""
    },
    {
      "text": "André Kukla. 2013.Social constructivism and the philosophy of science. Routledge, Oxfordshire, UK.",
      "doi": ""
    },
    {
      "text": "James A Kulik and JD Fletcher. 2016. Effectiveness of intelligent tutoring systems: a meta-analytic review. Review of Educational Research86, 1 (2016), 42--78.",
      "doi": ""
    },
    {
      "text": "Annabel Latham, Keeley Crockett, David McLean, and Bruce Edmonds. 2012. A conversational intelligent tutoring system to automatically predict learning styles.Computers & Education59, 1 (2012), 95--109.",
      "doi": ""
    },
    {
      "text": "Joseph J. LaViola, Jr. and Robert C. Zeleznik. 2004.MathPad2: A System for the Creation and Exploration of Mathematical Sketches. In ACM SIGGRAPH 2004Papers (SIGGRAPH 2004). ACM, New York, New York,USA, 432--440.",
      "doi": ""
    },
    {
      "text": "Yong Jae Lee, C Lawrence Zitnick, and Michael F Cohen. 2011. Shadowdraw: Real-Time User Guidance for Freehand Drawing. InACM Transactions on Graphics (TOG), Vol. 30. ACM, New York, New York, USA, 27. DOI:http://dx.doi.org/10.1145/2010324.1964922",
      "doi": "10.1145/1964921.1964922"
    },
    {
      "text": "Lisa A. Linnenbrink and Paul R. Pintrich. 2002.Motivation as an Enabler for Academic Success. School Psychology Review31, 3 (2002), 313--327.",
      "doi": ""
    },
    {
      "text": "Antonija Mitrovic, Stellan Ohlsson, and Devon K Barrow. 2013. The effect of positive feedback in a constraint-based intelligent tutoring system.Computers& Education60, 1 (2013), 264--272.",
      "doi": ""
    },
    {
      "text": "Cody Phillips, Daniel Johnson, Madison Klarkowski,Melanie Jade White, and Leanne Hides. 2018. The Impact of Rewards and Trait Reward Responsiveness on Player Motivation. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play.ACM, Melbourne, VIC, Australia, 393--404. DOI:http://dx.doi.org/10.1145/3242671.3242713",
      "doi": "10.1145/3242671.3242713"
    },
    {
      "text": "Paul R Pintrich and others. 1991. A Manual for the Use of the Motivated Strategies for Learning Questionnaire(MSLQ). National Center for Research to Improve Postsecondary Teaching and Learning Project on Instructional Processes and Educational Outcomes OERI-86-0010, Article NCRIPTAL-91-B-004 (1991),76 pages. ERIC Number: ED338122.",
      "doi": ""
    },
    {
      "text": "Gary S Plano. 2004.The Effects of the Cognitive Tutor Algebra on student attitudes and achievement in a 9th grade Algebra course. Ph.D. Dissertation. Seton Hall University.",
      "doi": ""
    },
    {
      "text": "Rosemary Richards. 2003. \"My drawing sucks!\": Children's belief in themselves as artists. In Proceedings of the 2003 NZARE/AARE Joint Conference. NZARE/AARE, Auckand, New Zealand, 10.",
      "doi": ""
    },
    {
      "text": "Scott Robertson and Thomas Bertling. 2013. How to Draw: Drawing and Sketching Objects and Environments from your Imagination(1st ed.). Design Studio Press, Culver City, California, USA.ISBN=978--1933492735.",
      "doi": ""
    },
    {
      "text": "Burr Settles and Brendan Meeder. 2016. A trainable spaced repetition model for language learning. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1:Long Papers). Association for Computational Linguistics, Berlin, Germany, 1848--1858.",
      "doi": ""
    },
    {
      "text": "Kathy G. Short, Gloria Kauffman, and Leslie H. Kahn. 2000. \"I Just Need To Draw\": Responding to Literature across Multiple Sign Systems. The Reading Teacher 54,2 (Oct 2000), 160--171. ISSN-0034-0561.",
      "doi": ""
    },
    {
      "text": "Valerie J Shute. 2011. Stealth Assessment in Computer-based Games to Support Learning. Computer Games and Instruction 55, 2 (2011), 503--524. ISBN=978--1617354083.",
      "doi": ""
    },
    {
      "text": "Klara Sjolen and Allan MacDonald. 2011. Learning Curves: An Inspiring Guide to Improve Your Design Sketch Skills(1 ed.). Keeos Design Books, Sundsvall, Sweden.",
      "doi": ""
    },
    {
      "text": "Derek Sleeman and John Seely Brown. 1982. Intelligent tutoring systems. Academic Press, London, UK.",
      "doi": ""
    },
    {
      "text": "Sheryl Sorby. 2009. Educational Research in Developing 3-D Spatial Skills for Engineering Students.International Journal of Science Education 31, 3 (Feb 2009), 459--480.",
      "doi": ""
    },
    {
      "text": "Robert A Sottilare, Arthur Graesser, Xiangen Hu, and Heather Holden. 2013. Design recommendations for intelligent tutoring systems: Volume 1-learner modeling.Vol. 1. US Army Research Laboratory, Orlando, FL,USA.",
      "doi": ""
    },
    {
      "text": "Paul Taele, Laura Barreto, and Tracy Hammond. 2009. Hashigo: A Next-Generation Sketch Interactive System for Japanese Kanji. In Proceedings of the Twenty-First Innovative Applications of Artificial Intelligence Conference (IAAI '15). AAAI, Palo Alto, California,USA, 153--158.",
      "doi": ""
    },
    {
      "text": "Paul Taele, Laura Barreto, and Tracy Hammond. 2015. Maestoso: An Intelligent Educational Sketching Tool for Learning Music Theory. In Proceedings of the Twenty-Seventh Innovative Applications of Artificial Intelligence Conference (IAAI '15). AAAI, Palo Alto, California, USA, 3999--4005.",
      "doi": ""
    },
    {
      "text": "Paul Taele and Tracy Hammond. 2015. Bopo Noto: An Intelligent Sketch Education Application for Learning Zhuyin Phonetic Script. In Proceedings of the 21st International Conference on Distributed Multimedia Systems (DMS '15). Knowledge Systems Institute, Skokie, Illinois, USA, 101--107.",
      "doi": ""
    },
    {
      "text": "Stephanie Valentine, Francisco Vides, George Lucchese, David Turner, Hong-Hoe (Ayden) Kim, Wenzhe Li,Julie Linsey, and Tracy Hammond. 2012. Mechanix: A Sketch-Based Tutoring System for Statics Courses. In Proceedings of the Twenty-Fourth Innovative Applications of Artificial Intelligence Conference (IAAI). AAAI, Toronto, Canada, Canada, 2253--2260.",
      "doi": ""
    },
    {
      "text": "Kurt Vanlehn. 2006. The behavior of tutoring systems.International journal of artificial intelligence ineducation16, 3 (2006), 227--265.",
      "doi": ""
    },
    {
      "text": "Kurt VanLehn. 2011. The relative effectiveness of human tutoring, intelligent tutoring systems, and other tutoring systems.Educational Psychologist 46, 4 (2011),197--221.",
      "doi": ""
    },
    {
      "text": "Roumen Vesselinov and John Grego. 2012. Duolingo effectiveness study. Technical Report. City University of New York, USA.",
      "doi": ""
    },
    {
      "text": "Lev Vygotsky. 1987. Zone of proximal development. Mind in society: The development of higher psychological processes 5291 (1987), 157 pages.",
      "doi": ""
    },
    {
      "text": "Nicola Jane Whitton. 2007.An Investigation into the Potential of Collaborative Computer Game-Based Learning in Higher Education. Ph.D. Dissertation. Edinburgh Napier University. http://researchrepository.napier.ac.uk/id/eprint/4281",
      "doi": ""
    },
    {
      "text": "Blake Williford, Abhay Doke, Michel Pahud, Ken Hinckley, and Tracy Hammond. 2019. DrawMyPhoto: Assisting Novices in Drawing from Photographs. In Proceedings of the 2019 on Creativity and Cognition. ACM, San Diego, California, USA, 198--209. DOI:http://dx.doi.org/10.1145/3325480.3325507",
      "doi": "10.1145/3325480.3325507"
    },
    {
      "text": "Blake Williford, Matthew Runyon, Adil Hamid Malla, Wayne Li, Julie Linsey, and Tracy Hammond. 2017. ZenSketch: A Sketch-based Game For Improving Line Work. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play. ACM, Amsterdam, 591--598.",
      "doi": "10.1145/3130859.3130861"
    },
    {
      "text": "Pieter Wouters, Christof Van Nimwegen, Herre Van Oostendorp, and Erik D Van Der Spek. 2013. A Meta-Analysis of the Cognitive and Motivational Effects of Serious Games. Journal of Educational Psychology 105, 2 (2013), 249. https://psycnet.apa.org/doiLanding?doi=10.1037%2Fa0031311",
      "doi": ""
    },
    {
      "text": "Ruhizan M. Yasin, Lilia Halim, and Azaman Ishar. 2012. Effects of Problem-Solving Strategies in the Teaching and Learning of Engineering Drawing Subject. Asian Social Science 8, 16 (2012), 65--79.",
      "doi": ""
    },
    {
      "text": "Panrong Yin, Kenneth D Forbus, Jeffrey Usher, Brad Sageman, and Benjamin D Jee. 2010. Sketch worksheets: A sketch-based educational software system. In Title of host publication AAAI-10 /IAAI-10--Proceedings of the 24th AAAI Conference on Artificial Intelligence and the 22nd Innovative Applications of Artificial Intelligence Conference, Vol. 3.AAAI, Atlanta, GA, United States, 1871--1876.",
      "doi": ""
    },
    {
      "text": "Barry J. Zimmerman and Anastasia Kitsantas. 2005. The Hidden Dimension of Personal Competence:Self-regulated Learning and Practice. In Handbook of Competence and Motivation, A.J. Elliot, C.S. Dweck,and S. Carol (Eds.). Guilford Publications, New York,New York, USA, 509--526.",
      "doi": ""
    }
  ]
}