{
  "doi": "10.1145/3313831.3376309",
  "title": "\"Energy is a Finite Resource\": Designing Technology to Support Individuals across Fluctuating Symptoms of Depression",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2020,
  "badges": [],
  "abstract": "While the HCI field increasingly examines how digital tools can support individuals in managing mental health conditions, it remains unclear how these tools can accommodate these conditions' temporal aspects. Based on weekly interviews with five individuals with depression, conducted over six weeks, this study identifies design opportunities and challenges related to extending technology-based support across fluctuating symptoms. Our findings suggest that participants perceive events and contexts in daily life to have marked impact on their symptoms. Results also illustrate that ebbs and flows in symptoms profoundly affect how individuals practice depression self-management. While digital tools often aim to reach individuals while they feel depressed, we suggest they should also engage individuals when they are less symptomatic, leveraging their energy and motivation to build habits, establish plans and goals, and generate and organize content to prepare for symptom onset.",
  "authors": [
    {
      "name": "Rachel Kornfield",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701819",
      "orcid": "0000-0001-8542-6913"
    },
    {
      "name": "Renwen Zhang",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659204537",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Nicholas",
      "institution": "University of Melbourne & Northwestern University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659476252",
      "orcid": "missing"
    },
    {
      "name": "Stephen M. Schueller",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658749229",
      "orcid": "0000-0002-1003-0399"
    },
    {
      "name": "Scott A. Cambo",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080799",
      "orcid": "missing"
    },
    {
      "name": "David C. Mohr",
      "institution": "Northwestern University, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490646436",
      "orcid": "0000-0002-5443-7596"
    },
    {
      "name": "Madhu Reddy",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340492349",
      "orcid": "0000-0002-6330-3637"
    }
  ],
  "references": [
    {
      "text": "Ana M. Abrantes, Claire E. Blevins, Cynthia L. Battle, Jennifer P. Read, Alan L. Gordon, and Michael D. Stein. 2017. Developing a Fitbitsupported lifestyle physical activity intervention for depressed alcohol dependent women. Journal of Substance Abuse Treatment 80, 88--97. http://doi.org/10.1016/j.jsat.2017.07.006",
      "doi": ""
    },
    {
      "text": "Adrian Aguilera and Ricardo F. Muñoz. 2011. Text Messaging as an Adjunct to CBT in Low-Income Populations: A Usability and Feasibility Pilot Study. Professional psychology, research and practice 42, 6, 472--478. http://doi.org/10.1037/a0025499",
      "doi": ""
    },
    {
      "text": "Adrian Aguilera, Stephen M. Schueller, and Yan Leykin. 2015. Daily mood ratings via text message as a proxy for clinic based depression assessment. Journal of Affective Disorders 175, 471--474. http://doi.org/10.1016/j.jad.2015.01.033",
      "doi": ""
    },
    {
      "text": "Vincent I. O. Agyapong, Sinead Ahern, Declan M. McLoughlin, and Conor K. Farren. 2012. Supportive text messaging for depression and comorbid alcohol use disorder: single-blind randomised trial. Journal of Affective Disorders 141, 2, 168--176. http://doi.org/10.1016/j.jad.2012.02.040",
      "doi": ""
    },
    {
      "text": "Patricia A. Areàn, Kien Hoa Ly, and Gerhard Andersson. 2016. Mobile technology for mental health assessment. Dialogues in Clinical Neuroscience 18, 2, 163--169.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, 28:1--28:14. http://doi.org/10.1145/3173574.3173602",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram. 2000. Temporal Coordination -- On Time and Coordination of Collaborative Activities at a Surgical Department. Computer Supported Cooperative Work (CSCW) 9, 2, 157--187. http://doi.org/10.1023/A:1008748724225",
      "doi": "10.1023/A%3A1008748724225"
    },
    {
      "text": "Jakob E. Bardram and Mads Frost. 2016. The Personal Health Technology Design Space. IEEE Pervasive Computing 15, 2, 70--78. http://doi.org/10.1109/MPRV.2016.37",
      "doi": "10.1109/MPRV.2016.37"
    },
    {
      "text": "Jakob E. Bardram, Darius A. Rohani, Nanna Tuxen, Maria Faurholt-Jepsen, and Lars V. Kessing. 2017. Supporting Smartphone-based Behavioral Activation: A Simulation Study. Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers, ACM, 830-- 843. http://doi.org/10.1145/3123024.3125617",
      "doi": ""
    },
    {
      "text": "Stephen R. Barley. 1988. On technology, time, and social order: Technically induced change in the temporal organization of radiological work. Making time: Ethnographies of high-technology organizations, 123--169.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Sherri Jean Katz, Jill E. Freeman, et al. 2012. Prescriptive Persuasion and Open-ended Social Awareness: Expanding the Design Space of Mobile Health. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, ACM, 475--484. http://doi.org/10.1145/2145204.2145279",
      "doi": "10.1145/2145204.2145279"
    },
    {
      "text": "Dror Ben-Zeev, Emily A. Scherer, Rui Wang, Haiyi Xie, and Andrew T. Campbell. 2015. Nextgeneration psychiatric assessment: Using smartphone sensors to monitor behavior and mental health. Psychiatric rehabilitation journal 38, 3, 218.",
      "doi": ""
    },
    {
      "text": "Niels van Berkel, Jorge Goncalves, Simo Hosio, Zhanna Sarsenbayeva, Eduardo Velloso, and Vassilis Kostakos. 2020. Overcoming compliance bias in self-report studies: A cross-study analysis. International Journal of Human-Computer Studies 134, 1--12.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. In APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological. American Psychological Association, Washington, DC, US, 57--71. http://doi.org/10.1037/13620-004",
      "doi": ""
    },
    {
      "text": "Nathalie Bricon-Souf and Conrad R. Newman. 2007. Context awareness in health care: a review. International Journal of Medical Informatics 76, 1, 2--12. http://doi.org/10.1016/j.ijmedinf.2006.01.003",
      "doi": ""
    },
    {
      "text": "W. Eugene Broadhead, Dan G. Blazer, Linda K. George, and Chiu Kit Tse. 1990. Depression, Disability Days, and Days Lost From Work in a Prospective Epidemiologic Survey. JAMA 264, 19, 2524--2528. http://doi.org/10.1001/jama.1990.03450190056028",
      "doi": ""
    },
    {
      "text": "Kirk Warren Brown and Richard M. Ryan. 2003. The benefits of being present: Mindfulness and its role in psychological well-being. Journal of Personality and Social Psychology 84, 4, 822--848. http://doi.org/10.1037/0022--3514.84.4.822",
      "doi": ""
    },
    {
      "text": "Michelle Nicole Burns, Mark Begale, Jennifer Duffecy, et al. 2011. Harnessing Context Sensing to Develop a Mobile Intervention for Depression. Journal of Medical Internet Research 13, 3, e55. http://doi.org/10.2196/jmir.1838",
      "doi": ""
    },
    {
      "text": "Paulo C. Büttenbender, Jorge L. V. Barbosa, and Marcio G. Martins. 2018. Ubiquitous Computing Applied to Mental Health: Trends and Research Focus. Proceedings of the 24th Brazilian Symposium on Multimedia and the Web, ACM, 73--76. http://doi.org/10.1145/3243082.3267456",
      "doi": "10.1145/3243082.3267456"
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 981-- 992. http://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Rafael A. Calvo, Dorian Peters, Daniel Johnson, and Yvonne Rogers. 2014. Autonomy in Technology Design. CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 37--40. http://doi.org/10.1145/2559206.2560468",
      "doi": ""
    },
    {
      "text": "Luca Canzian and Mirco Musolesi. 2015. Trajectories of depression: unobtrusive monitoring of depressive states by means of smartphone mobility traces analysis. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 1293--1304. Retrieved March 5, 2016 from http://dl.acm.org/citation.cfm?id=2805845",
      "doi": "10.1145/2750858.2805845"
    },
    {
      "text": "Xuetong Chen, Martin D. Sykora, Thomas W. Jackson, and Suzanne Elayan. 2018. What About Mood Swings: Identifying Depression on Twitter with Temporal Measures of Emotions. Companion Proceedings of the The Web Conference 2018, International World Wide Web Conferences Steering Committee, 1653--1660. http://doi.org/10.1145/3184558.3191624",
      "doi": "10.1145/3184558.3191624"
    },
    {
      "text": "Chul-Hyun Cho, Taek Lee, Min-Gwan Kim, Hoh Peter In, Leen Kim, and Heon-Jeong Lee. 2019. Mood Prediction of Patients With Mood Disorders by Machine Learning Using Passive Digital Phenotypes Based on the Circadian Rhythm: Prospective Observational Cohort Study. Journal of Medical Internet Research 21, 4, e11029. http://doi.org/10.2196/11029",
      "doi": ""
    },
    {
      "text": "Helen Christensen, Kathleen M. Griffiths, and Louise Farrer. 2009. Adherence in internet interventions for anxiety and depression. Journal of Medical Internet Research 11, 2, e13. http://doi.org/10.2196/jmir.1194",
      "doi": ""
    },
    {
      "text": "H. J. Conradi, J. Ormel, and P. de Jonge. 2011. Presence of individual (residual) symptoms during depressive episodes and periods of remission: a 3year prospective study. Psychological Medicine 41, 6, 1165--1174. http://doi.org/10.1017/S0033291710001911",
      "doi": ""
    },
    {
      "text": "Judith A. Cook, Mary Ellen Copeland, Carol Bailey Floyd, et al. 2012. A randomized controlled trial of effects of Wellness Recovery Action Planning on depression, anxiety, and recovery. Psychiatric Services (Washington, D.C.) 63, 6, 541--547. http://doi.org/10.1176/appi.ps.201100125",
      "doi": ""
    },
    {
      "text": "Juliet M. Corbin. 1991. A nursing model for chronic illness management based upon the trajectory framework. Research and Theory for Nursing Practice 5, 3, 155.",
      "doi": ""
    },
    {
      "text": "Charles S. Cornford, Angela Hill, and Joe Reilly. 2007. How patients with depressive symptoms view their condition: a qualitative study. Family Practice 24, 4, 358--364. http://doi.org/10.1093/fampra/cmm032",
      "doi": ""
    },
    {
      "text": "Patrick W. Corrigan and Deepa Rao. 2012. On the Self-Stigma of Mental Illness: Stages, Disclosure, and Strategies for Change. Canadian journal of psychiatry. Revue canadienne de psychiatrie 57, 8, 464--469.",
      "doi": ""
    },
    {
      "text": "Simon Coulombe, Stephanie Radziszewski, Sophie Meunier, et al. 2016. Profiles of Recovery from Mood and Anxiety Disorders: A Person-Centered Exploration of People's Engagement in SelfManagement. Frontiers in Psychology 7. http://doi.org/10.3389/fpsyg.2016.00584",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski. 2018. Using Technology for Health and Wellbeing. Proceedings of the 20th ACM International Conference on Multimodal Interaction, ACM. http://doi.org/10.1145/3242969.3243392",
      "doi": "10.1145/3242969.3243392"
    },
    {
      "text": "Jonathan R. T. Davidson. 2010. Major depressive disorder treatment guidelines in America and Europe. The Journal of Clinical Psychiatry 71 Suppl E1, e04. http://doi.org/10.4088/JCP.9058se1c.04gry",
      "doi": ""
    },
    {
      "text": "Roelof AJ De Vries, Cristina Zaga, Franciszka Bayer, Constance HC Drossaert, Khiet P. Truong, and Vanessa Evers. 2017. Experts get me started, peers keep me going: comparing crowd-versus expert-designed motivational text messages for exercise behavior change. Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare, ACM, 155--162.",
      "doi": "10.1145/3154862.3154875"
    },
    {
      "text": "Sona Dimidjian, Steven D. Hollon, Keith S. Dobson, et al. 2006. Randomized trial of behavioral activation, cognitive therapy, and antidepressant medication in the acute treatment of adults with major depression. Journal of consulting and clinical psychology 74, 4, 658.",
      "doi": ""
    },
    {
      "text": "Peter Farvolden, John Cunningham, and Peter Selby. 2009. Using E-Health Programs to Overcome Barriers to the Effective Treatment of Mental Health and Addiction Problems. Journal of Technology in Human Services 27, 1, 5--22. http://doi.org/10.1080/15228830802458889",
      "doi": ""
    },
    {
      "text": "Aaron J. Fisher and James F. Boswell. 2016. Enhancing the Personalization of Psychotherapy With Dynamic Assessment and Modeling. Assessment 23, 4, 496--506. http://doi.org/10.1177/1073191116638735",
      "doi": ""
    },
    {
      "text": "Aaron J. Fisher, Jonathan W. Reeves, Glenn Lawyer, John D. Medaglia, and Julian A. Rubel. 2017. Exploring the idiographic dynamics of mood and anxiety via network analysis. Journal of Abnormal Psychology 126, 8, 1044--1056. http://doi.org/10.1037/abn0000311",
      "doi": ""
    },
    {
      "text": "Theresa Fleming, Sally Merry, Karolina Stasiak, et al. 2019. The Importance of User Segmentation for Designing Digital Therapy for Adolescent Mental Health: Findings From Scoping Processes. JMIR Mental Health 6, 5, e12656. http://doi.org/10.2196/12656",
      "doi": ""
    },
    {
      "text": "Eiko I. Fried and Randolph M. Nesse. 2015. Depression is not a consistent syndrome: an investigation of unique symptom patterns in the STAR*D study. Journal of affective disorders 172, 96--102. http://doi.org/10.1016/j.jad.2014.10.010",
      "doi": ""
    },
    {
      "text": "Paul E. Greenberg, Andree-Anne Fournier, Tammy Sisitsky, Crystal T. Pike, and Ronald C. Kessler. 2015. The economic burden of adults with major depressive disorder in the United States (2005 and 2010). The Journal of clinical psychiatry 76, 2, 155-- 162.",
      "doi": ""
    },
    {
      "text": "Rosa A. van Grieken, Mirjam J. van Tricht, Maarten W. J. Koeter, Wim van den Brink, and Aart H. Schene. 2018. The use and helpfulness of selfmanagement strategies for depression: The experiences of patients. PLOS ONE 13, 10, e0206262. http://doi.org/10.1371/journal.pone.0206262",
      "doi": ""
    },
    {
      "text": "Amelia Gulliver, Kathleen M. Griffiths, and Helen Christensen. 2010. Perceived barriers and facilitators to mental health help-seeking in young people: a systematic review. BMC psychiatry 10, 113. http://doi.org/10.1186/1471--244X-10--113",
      "doi": ""
    },
    {
      "text": "Robert P. Hawkins, Matthew Kreuter, Kenneth Resnicow, Martin Fishbein, and Arie Dijkstra. 2008. Understanding tailoring in communicating about health. Health Education Research 23, 3, 454--466. http://doi.org/10.1093/her/cyn004",
      "doi": ""
    },
    {
      "text": "Sarah Elisabeth Hetrick, Jo Robinson, Eloise Burge, et al. 2018. Youth Codesign of a Mobile Phone App to Facilitate Self-Monitoring and Management of Mood Symptoms in Young People With Major Depression, Suicidal Ideation, and Self-Harm. JMIR Mental Health 5, 1. http://doi.org/10.2196/mental.9041",
      "doi": ""
    },
    {
      "text": "Clara E. Hill, Barbara J. Thompson, and Elizabeth Nutt Williams. 1997. A guide to conducting consensual qualitative research. The counseling psychologist 25, 4, 517--572.",
      "doi": ""
    },
    {
      "text": "Aine Horgan, Geraldine McCarthy, and John Sweeney. 2013. An Evaluation of an Online Peer Support Forum for University Students With Depressive Symptoms. Archives of Psychiatric Nursing 27, 2, 84--89. http://doi.org/10.1016/j.apnu.2012.12.005",
      "doi": ""
    },
    {
      "text": "Sky Tien-Yun Huang, Akane Sano, and Chloe Mun Yee Kwan. 2014. The Moment: A Mobile Tool for People with Depression or Bipolar Disorder. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, ACM, 235--238. http://doi.org/10.1145/2638728.2638784",
      "doi": "10.1145/2638728.2638784"
    },
    {
      "text": "Stephen S. Intille, A. A. Stone, and S. Shiffman. 2007. Technological innovations enabling automatic, context-sensitive ecological momentary assessment. In The science of real-time data capture: self-reports in health research, Arthur Stone (ed.). Oxford University Press, Oxford, 308--337.",
      "doi": ""
    },
    {
      "text": "Sheena S. Iyengar and Mark R. Lepper. 2000. When choice is demotivating: Can one desire too much of a good thing? Journal of personality and social psychology 79, 6, 995.",
      "doi": ""
    },
    {
      "text": "Robert Johansson and Gerhard Andersson. 2012. Internet-based psychological treatments for depression. Expert Review of Neurotherapeutics 12, 7, 861--869; quiz 870. http://doi.org/10.1586/ern.12.63",
      "doi": ""
    },
    {
      "text": "Luke Johnston, Blake F Dear, Milena Gandy, et al. 2014. Exploring the efficacy and acceptability of Internet-delivered cognitive behavioural therapy for young adults with anxiety and depression: An open trial. Australian & New Zealand Journal of Psychiatry 48, 9, 819--827. http://doi.org/10.1177/0004867414527524",
      "doi": ""
    },
    {
      "text": "L. L. Judd and H. S. Akiskal. 2000. Delineating the Longitudinal Structure of Depressive Illness: Beyond Clinical Subtypes and Duration Thresholds. Pharmacopsychiatry 33, 1, 3--7. http://doi.org/10.1055/s-2000--7967",
      "doi": ""
    },
    {
      "text": "Hyunggu Jung, Woosuk Seo, and Michelle Cha. 2017. Personas and Scenarios to Design Technologies for North Korean Defectors with Depression. Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, ACM, 215--218. http://doi.org/10.1145/3022198.3026308",
      "doi": "10.1145/3022198.3026308"
    },
    {
      "text": "Eva Kaltenthaler, Glenys Parry, Catherine Beverley, and Michael Ferriter. 2008. Computerised cognitive-behavioural therapy for depression: systematic review. The British Journal of Psychiatry 193, 3, 181--184. http://doi.org/10.1192/bjp.bp.106.025981",
      "doi": ""
    },
    {
      "text": "Manu Kapur. 2011. Temporality matters: Advancing a method for analyzing problem-solving processes in a computer-supported collaborative environment. International Journal of Computer-Supported Collaborative Learning 6, 1, 39--56. http://doi.org/10.1007/s11412-011--9109--9",
      "doi": ""
    },
    {
      "text": "David A. Karp. 1994. Living with Depression: Illness and Identity Turning Points. Qualitative Health Research 4, 1, 6--30. http://doi.org/10.1177/104973239400400102",
      "doi": ""
    },
    {
      "text": "Idit Katz and Avi Assor. 2006. When Choice Motivates and When It Does Not. Educational Psychology Review 19, 4, 429. http://doi.org/10.1007/s10648-006--9027-y",
      "doi": ""
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences. Proceedings of the 2017 SIGCHI conference on human factors in computing systems, ACM, 629--641. http://doi.org/10.1145/3025453.3025750",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Rafal Kocielnik, Lillian Xiao, Daniel Avrahami, and Gary Hsieh. 2018. Reflection Companion: A Conversational System for Engaging Users in Reflection on Physical Activity. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, ACM, 2, 2, 70:1-- 70:26. http://doi.org/10.1145/3214273",
      "doi": "10.1145/3214273"
    },
    {
      "text": "Matthew W. Kreuter, David W. Farrell, Laura R. Olevitch, and Laura K. Brennan. 2013. Tailoring Health Messages: Customizing Communication With Computer Technology. Routledge.",
      "doi": ""
    },
    {
      "text": "Jeffrey Kristan and Brian Suffoletto. 2015. Using online crowdsourcing to understand young adult attitudes toward expert-authored messages aimed at reducing hazardous alcohol consumption and to collect peer-authored messages. Translational Behavioral Medicine 5, 1, 45--52. http://doi.org/10.1007/s13142-014-0298--4",
      "doi": ""
    },
    {
      "text": "Kurt Kroenke, Robert L Spitzer, and Janet B W Williams. 2001. The PHQ-9. Journal of General Internal Medicine 16, 9, 606--613. http://doi.org/10.1046/j.15251497.2001.016009606.x",
      "doi": "10.1046/j.1525-1497.2001.016009606"
    },
    {
      "text": "Nicholas D. Lane, Mashfiqui Mohammod, Mu Lin, et al. 2011. Bewell: A smartphone application to monitor, model and promote wellbeing. 5th International ICST Conference on Pervasive Computing Technologies for Healthcare, 23--26. Retrieved from http://www.cs.cornell.edu/~ms2749/pubs/Pervasive Health_BeWell.pdf",
      "doi": ""
    },
    {
      "text": "Emily G. Lattie, Stephen M. Schueller, Elizabeth Sargent, et al. 2016. Uptake and usage of IntelliCare: A publicly available suite of mental health and wellbeing apps. Internet Interventions 4, 152--158. http://doi.org/10.1016/j.invent.2016.06.003",
      "doi": ""
    },
    {
      "text": "Andrea Lawson, Ariel Dalfen, Kellie E. Murphy, Natasha Milligan, and William Lancee. 2019. Use of Text Messaging for Postpartum Depression Screening and Information Provision. Psychiatric Services (Washington, D.C.) 70, 5, 389--395. http://doi.org/10.1176/appi.ps.201800269",
      "doi": ""
    },
    {
      "text": "Hee Rin Lee, Selma Sabanovic, Wan-Ling Chang, et al. 2017. Steps Toward Participatory Design of Social Robots: Mutual Learning with Older Adults with Depression. Proceedings of the 2017 ACM/IEEE International Conference on HumanRobot Interaction, ACM, 244--253. http://doi.org/10.1145/2909824.3020237",
      "doi": "10.1145/2909824.3020237"
    },
    {
      "text": "Jisoo Lee, Erin Walker, Winslow Burleson, Matthew Kay, Matthew Buman, and Eric B. Hekler. 2017. Self-Experimentation for Behavior Change: Design and Formative Evaluation of Two Approaches. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 6837--6849. http://doi.org/10.1145/3025453.3026038",
      "doi": "10.1145/3025453.3026038"
    },
    {
      "text": "Ian Li, Jon Froehlich, Jakob E. Larsen, Catherine Grevet, and Ernesto Ramirez. 2013. Personal Informatics in the Wild: Hacking Habits for Health & Happiness. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, 3179-- 3182. http://doi.org/10.1145/2468356.2479641",
      "doi": "10.1145/2468356.2479641"
    },
    {
      "text": "Jingbo Meng, Syed Ali Hussain, David C. Mohr, Mary Czerwinski, and Mi Zhang. 2018. Exploring User Needs for a Mobile Behavioral-Sensing Technology for Depression Management: Qualitative Study. Journal of Medical Internet Research 20, 7, e10139. http://doi.org/10.2196/10139",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Joyce Ho, Jenna Duffecy, et al. 2010. Perceived barriers to psychological treatments and their relationship to depression. Journal of clinical psychology 66, 4, 394--409. http://doi.org/10.1002/jclp.20659",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Stacey L. Hart, Isa Howard, et al. 2006. Barriers to psychotherapy among depressed and nondepressed primary care patients. Annals of Behavioral Medicine: A Publication of the Society of Behavioral Medicine 32, 3, 254--258. http://doi.org/10.1207/s15324796abm3203_12",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Kathryn Noth Tomasino, Emily G. Lattie, et al. 2017. IntelliCare: An Eclectic, SkillsBased App Suite for the Treatment of Depression and Anxiety. Journal of Medical Internet Research 19, 1, e10. http://doi.org/10.2196/jmir.6645",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Mi Zhang, and Stephen M. Schueller. 2017. Personal Sensing: Understanding Mental Health Using Ubiquitous Sensors and Machine Learning. Annual Review of Clinical Psychology 13, 1, 23--47. http://doi.org/10.1146/annurev-clinpsy-032816044949",
      "doi": ""
    },
    {
      "text": "Robert R. Morris, Kareem Kouddous, Rohan Kshirsagar, and Stephen M. Schueller. 2018. Towards an Artificially Empathic Conversational Agent for Mental Health Applications: System Design and User Perceptions. Journal of Medical Internet Research 20, 6, e10148. http://doi.org/10.2196/10148",
      "doi": ""
    },
    {
      "text": "Robert R. Morris, Stephen M. Schueller, and Rosalind W. Picard. 2015. Efficacy of a Web-Based, Crowdsourced Peer-To-Peer Cognitive Reappraisal Platform for Depression: Randomized Controlled Trial. Journal of Medical Internet Research 17, 3. http://doi.org/10.2196/jmir.4167",
      "doi": ""
    },
    {
      "text": "Frederick Muench, Katherine van Stolk-Cooke, Jon Morgenstern, Alexis N. Kuerbis, and Kendra Markle. 2014. Understanding Messaging Preferences to Inform Development of Mobile GoalDirected Behavioral Interventions. Journal of Medical Internet Research 16, 2, e14. http://doi.org/10.2196/jmir.2945",
      "doi": ""
    },
    {
      "text": "Susan A. Murphy, Linda M. Collins, and A. John Rush M.D. 2007. Customizing Treatment to the Patient: Adaptive Treatment Strategies. Drug and alcohol dependence 88, Suppl 2, S1--S3. http://doi.org/10.1016/j.drugalcdep.2007.02.001",
      "doi": ""
    },
    {
      "text": "Inbal Nahum-Shani, Shawna N. Smith, Bonnie J. Spring, et al. 2016. Just-in-Time Adaptive Interventions (JITAIs) in Mobile Health: Key Components and Design Principles for Ongoing Health Behavior Support. Annals of Behavioral Medicine, 1--17. http://doi.org/10.1007/s12160-0169830--8",
      "doi": ""
    },
    {
      "text": "Bjorn Nansen, Michael Arnold, Martin R. Gibbs, and Hilary Davis. 2009. Domestic orchestration: Rhythms in the mediated home. Time & Society 18, 2--3, 181--207. http://doi.org/10.1177/0961463X09338082",
      "doi": ""
    },
    {
      "text": "Ada Ng, Rachel Kornfield, Stephen Schueller, Allison Zalta, Michael Brennan, and Madhu Reddy. 2019. Provider Perspectives on Integrating Sensor-Captured Patient-Generated Data in Mental Health Care. Proceedings of the ACM on Human-Computer Interaction (CSCW). https://doi.org/10.1145/3359217",
      "doi": "10.1145/3359217"
    },
    {
      "text": "John C. Norcross and Bruce E. Wampold. 2011. What works for whom: Tailoring psychotherapy to the person. Journal of Clinical Psychology 67, 2, 127--132. http://doi.org/10.1002/jclp.20764",
      "doi": ""
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2018. Understanding the Mundane Nature of Self-care: Ethnographic Accounts of People Living with Parkinson's. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, 402:1--402:15. http://doi.org/10.1145/3173574.3173976",
      "doi": "10.1145/3173574.3173976"
    },
    {
      "text": "Kathleen O'Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies. CSCW, 1470--1484.",
      "doi": ""
    },
    {
      "text": "Katie O'Leary, Lisa Vizer, Jordan Eschler, James Ralston, and Wanda Pratt. 2015. Understanding patients' health and technology attitudes for tailoring self-management interventions. AMIA Annual Symposium Proceedings 2015, 991--1000.",
      "doi": ""
    },
    {
      "text": "Jukka-Pekka Onnela and Scott L. Rauch. 2016. Harnessing smartphone-based digital phenotyping to enhance behavioral and mental health. Neuropsychopharmacology 41, 7, 1691.",
      "doi": ""
    },
    {
      "text": "Wanda J. Orlikowski and JoAnne Yates. 2002. It's About Time: Temporal Structuring in Organizations. Organization Science 13, 6, 684--700. http://doi.org/10.1287/orsc.13.6.684.501",
      "doi": "10.1287/orsc.13.6.684.501"
    },
    {
      "text": "Mika Pantzar and Minna Ruckenstein. 2017. Living the metrics: Self-tracking and situated objectivity. DIGITAL HEALTH 3, 2055207617712590. http://doi.org/10.1177/2055207617712590",
      "doi": ""
    },
    {
      "text": "K. Posner, D. Brent, C. LUniversity of Chinese Academy of Sciences, et al. 2008. Columbia-suicide severity rating scale (C-SSRS). New York, NY: Columbia University Medical Center.",
      "doi": ""
    },
    {
      "text": "Abhishek Pratap, Joaquin A. Anguera, Brenna N. Renn, et al. 2017. The Feasibility of Using Smartphones to Assess and Remediate Depression in Hispanic/Latino Individuals Nationally. Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers, ACM, 854-- 860. http://doi.org/10.1145/3123024.3127877",
      "doi": "10.1145/3123024.3127877"
    },
    {
      "text": "Abhishek Pratap, David C. Atkins, Brenna N. Renn, et al. 2019. The accuracy of passive phone sensors in predicting daily mood. Depression and Anxiety 36, 1, 72--81. http://doi.org/10.1002/da.22822",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Shahid Ali, Tanzeem Choudhury, and Ethan Berke. 2011. Passive and in-situ assessment of mental and physical well-being using mobile sensors. Proceedings of the 13th international conference on Ubiquitous computing, ACM, 385--394.",
      "doi": "10.1145/2030112.2030164"
    },
    {
      "text": "Shriti Raj, Kelsey Toporski, Ashley Garrity, Joyce M. Lee, and Mark W. Newman. 2019. \"My blood sugar is higher on the weekends\": Finding a Role for Context and Context-Awareness in the Design of Health Self-Management Technology. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, 1--13. http://doi.org/10.1145/3290605.3300349",
      "doi": ""
    },
    {
      "text": "Madhu C. Reddy, Paul Dourish, and Wanda Pratt. 2006. Temporality in Medical Work: Time Also Matters. Comput. Supported Coop. Work 15, 1, 29-- 53. http://doi.org/10.1007/s10606-005--9010-z",
      "doi": "10.1007/s10606-005-9010-z"
    },
    {
      "text": "Madhu Reddy and Paul Dourish. 2002. A finger on the pulse: Temporal rhythms and information seeking in medical work. Proceedings of the ACM Conference on Computer Supported Cooperative Work, 344--353.",
      "doi": "10.1145/587078.587126"
    },
    {
      "text": "Harry T. Reis, Kennon M. Sheldon, Shelly L. Gable, Joseph Roscoe, and Richard M. Ryan. 2000. Daily Well-Being: The Role of Autonomy, Competence, and Relatedness. Personality and Social Psychology Bulletin 26, 4, 419--435. http://doi.org/10.1177/0146167200266002",
      "doi": ""
    },
    {
      "text": "Brenna N. Renn, Theresa J. Hoeft, Heather Sophia Lee, Amy M. Bauer, and Patricia A. Areán. 2019. Preference for in-person psychotherapy versus digital psychotherapy options for depression: survey of adults in the U.S. npj Digital Medicine 2, 1, 6. http://doi.org/10.1038/s41746-019-0077--1",
      "doi": ""
    },
    {
      "text": "Damien Ridge and Sue Ziebland. 2012. Understanding depression through a 'coming out' framework. Sociology of Health & Illness 34, 5, 730-- 745. http://doi.org/10.1111/j.14679566.2011.01409.x",
      "doi": ""
    },
    {
      "text": "Maaike Roubroeks, Cees Midden, and Jaap Ham. 2009. Does It Make a Difference Who Tells You What to Do?: Exploring the Effect of Social Agency on Psychological Reactance. Proceedings of the 4th International Conference on Persuasive Technology, ACM, 15:1--15:6. http://doi.org/10.1145/1541948.1541970",
      "doi": "10.1145/1541948.1541970"
    },
    {
      "text": "Kathleen Rowan, Donna McAlpine, and Lynn Blewett. 2013. Access and Cost Barriers to Mental Health Care by Insurance Status, 1999 to 2010. Health affairs (Project Hope) 32, 10, 1723--1730. http://doi.org/10.1377/hlthaff.2013.0133",
      "doi": ""
    },
    {
      "text": "Sohrab Saeb, Emily G. Lattie, Stephen M. Schueller, Konrad P. Kording, and David C. Mohr. 2016. The relationship between mobile phone location sensor data and depressive symptom severity. PeerJ 4, e2537. http://doi.org/10.7717/peerj.2537",
      "doi": ""
    },
    {
      "text": "Christina Sagioglou and Tobias Greitemeyer. 2014. Facebook's emotional consequences: Why Facebook causes a decrease in mood and why people still use it. Computers in Human Behavior 35, 359--363. http://doi.org/10.1016/j.chb.2014.03.003",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, et al. 2010. Mind the Body!: Designing a Mobile Stress Management Application Encouraging Personal Reflection. Proceedings of the 8th ACM Conference on Designing Interactive Systems, ACM, 47--56. http://doi.org/10.1145/1858171.1858182",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Pedro Sanches, Axel Janson, Pavel Karpashevich, et al. 2019. HCI and Affective Health: Taking stock of a decade of studies and charting future research directions. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, 245.",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "Jitender Sareen, Amit Jagdeo, Brian J. Cox, et al. 2007. Perceived Barriers to Mental Health Service Utilization in the United States, Ontario, and the Netherlands. Psychiatric Services 58, 3, 357--364. http://doi.org/10.1176/ps.2007.58.3.357",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Chelsey Wilkes, Kael Rowan, et al. 2018. Pocket Skills: A Conversational Mobile Web App To Support Dialectical Behavioral Therapy. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, 398:1--398:15. http://doi.org/10.1145/3173574.3173972",
      "doi": "10.1145/3173574.3173972"
    },
    {
      "text": "S. M. Schueller, A. Aguilera, and D. C. Mohr. 2017. Ecological momentary interventions for depression and anxiety. Depression and Anxiety 34, 6, 540--545. http://doi.org/10.1002/da.22649",
      "doi": ""
    },
    {
      "text": "Dena Schulman-Green, Sarah Jaser, Faith Martin, et al. 2012. Processes of Self-Management in Chronic Illness. Journal of Nursing Scholarship 44, 2, 136-- 144. http://doi.org/10.1111/j.15475069.2012.01444.x",
      "doi": ""
    },
    {
      "text": "Leah B. Shapira and Myriam Mongrain. 2010. The benefits of self-compassion and optimism exercises for individuals vulnerable to depression. The Journal of Positive Psychology 5, 5, 377--389. http://doi.org/10.1080/17439760.2010.516763",
      "doi": ""
    },
    {
      "text": "Marie A. Sillice, Shira Dunsiger, Ernestine Jennings, Ryan Lantini, and Beth C. Bock. 2018. Differences in mobile phone affinity between demographic groups: implications for mobile phone delivered interventions and programs. mHealth 4. http://doi.org/10.21037/mhealth.2018.09.06",
      "doi": ""
    },
    {
      "text": "G. E. Simon, M. VonKorff, and W. Barlow. 1995. Health care costs of primary care patients with recognized depression. Archives of General Psychiatry 52, 10, 850--856.",
      "doi": ""
    },
    {
      "text": "David A. Solomon, Martin B. Keller, Andrew C. Leon, et al. 1997. Recovery From Major Depression: A 10-Year Prospective Follow-up Across Multiple Episodes. Archives of General Psychiatry 54, 11, 1001--1006. http://doi.org/10.1001/archpsyc.1997.01830230033 005",
      "doi": ""
    },
    {
      "text": "Jan Spijker, Ron De Graaf, Rob V. Bijl, Aartjan T. F. Beekman, Johan Ormel, and Willem A. Nolen. 2002. Duration of major depressive episodes in the general population: Results from the Netherlands Mental Health Survey and Incidence Study (NEMESIS). The British Journal of Psychiatry 181, 3, 208--213. http://doi.org/10.1192/bjp.181.3.208",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Chris Preist, and David Coyle. 2019. Use of Smartphone Apps, Social Media, and Web-Based Resources to Support Mental Health and Well-Being: Online Survey. JMIR Mental Health 6, 7, e12546. http://doi.org/10.2196/12546",
      "doi": ""
    },
    {
      "text": "Michael F. Steger and Todd B. Kashdan. 2009. Depression and Everyday Social Activity, Belonging, and Well-Being. Journal of counseling psychology 56, 2, 289--300. http://doi.org/10.1037/a0015416",
      "doi": ""
    },
    {
      "text": "Diana W. Stewart, Jeanne M. Gabriele, and Edwin B. Fisher. 2012. Directive support, nondirective support, and health behaviors in a community sample. Journal of Behavioral Medicine 35, 5, 492-- 499. http://doi.org/10.1007/s10865-011--9377-x",
      "doi": ""
    },
    {
      "text": "Annemieke van Straten, Wike Seekles, Nelleke J. van 't Veer-Tazelaar, Aartjan T. F. Beekman, and Pim Cuijpers. 2010. Stepped care for depression in primary care: what should be offered and how? The Medical Journal of Australia 192, 11 Suppl, S36--39.",
      "doi": ""
    },
    {
      "text": "S. Shyam Sundar. 2008. Self as source: Agency and customization in interactive media. Mediated Interpersonal Communication, 58--74. http://doi.org/10.4324/9780203926864",
      "doi": ""
    },
    {
      "text": "S. Shyam Sundar and Sampada S. Marathe. 2010. Personalization versus Customization: The Importance of Agency, Privacy, and Power Usage. Human Communication Research 36, 3, 298--322. http://doi.org/10.1111/j.1468--2958.2010.01377.x",
      "doi": ""
    },
    {
      "text": "Joshua K. Swift and Roger P. Greenberg. 2012. Premature discontinuation in adult psychotherapy: A meta-analysis. Journal of consulting and clinical psychology 80, 4, 547.",
      "doi": ""
    },
    {
      "text": "Graham Thornicroft, Somnath Chatterji, Sara EvansLacko, et al. 2017. Undertreatment of people with major depressive disorder in 21 countries. The British Journal of Psychiatry 210, 2, 119--124. http://doi.org/10.1192/bjp.bp.116.188078",
      "doi": ""
    },
    {
      "text": "John Torous, Rohn Friedman, and Matcheri Keshvan. 2014. Smartphone Ownership and Interest in Mobile Applications to Monitor Symptoms of Mental Health Conditions. JMIR mhealth and uhealth 2, 1, e2. http://doi.org/10.2196/mhealth.2994",
      "doi": ""
    },
    {
      "text": "John Torous, Jennifer Nicholas, Mark E. Larsen, Joseph Firth, and Helen Christensen. 2018. Clinical review of user engagement with mental health smartphone apps: evidence, theory and improvements. Evidence-Based Mental Health 21, 3, 116--119. http://doi.org/10.1136/eb-2018--102891",
      "doi": ""
    },
    {
      "text": "John Torous and Adam C. Powell. 2015. Current research and trends in the use of smartphone applications for mood disorders. Internet Interventions 2, 2, 169--173. http://doi.org/10.1016/j.invent.2015.03.002",
      "doi": ""
    },
    {
      "text": "John Torous, Patrick Staples, and Jukka-Pekka Onnela. 2015. Realizing the potential of mobile mental health: new methods for new data in psychiatry. Current psychiatry reports 17, 8, 61.",
      "doi": ""
    },
    {
      "text": "Marjan Verstappen, Paula Gardner, Dora Poon, and Tim Bettridge. 2014. Off the Couch and out of the Hospital, Mobile Applications for Acceptance and Commitment Therapy. Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 431--434. http://doi.org/10.1145/2628363.2633573",
      "doi": "10.1145/2628363.2633573"
    },
    {
      "text": "Marius Veseth, Per-Einar Binder, Marit Borg, and Larry Davidson. 2012. Toward Caring for Oneself in a Life of Intense Ups and Downs: A ReflexiveCollaborative Exploration of Recovery in Bipolar Disorder. Qualitative Health Research 22, 1, 119-- 133. http://doi.org/10.1177/1049732311411487",
      "doi": ""
    },
    {
      "text": "T. Franklin Waddell, S. Shyam Sundar, and Joshua Auriemma. 2015. Can Customizing an Avatar Motivate Exercise Intentions and Health Behaviors Among Those with Low Health Ideals? Cyberpsychology, Behavior, and Social Networking 18, 11, 687--690. http://doi.org/10.1089/cyber.2014.0356",
      "doi": ""
    },
    {
      "text": "Fabian Wahle, Tobias Kowatsch, Elgar Fleisch, Michael Rufer, and Steffi Weidt. 2016. Mobile Sensing and Support for People With Depression: A Pilot Trial in the Wild. JMIR mHealth and uHealth 4, 3, e111. http://doi.org/10.2196/mhealth.5960",
      "doi": ""
    },
    {
      "text": "Philip S. Wang, Patricia Berglund, Mark Olfson, Harold A. Pincus, Kenneth B. Wells, and Ronald C. Kessler. 2005. Failure and delay in initial treatment contact after first onset of mental disorders in the National Comorbidity Survey Replication. Archives of General Psychiatry 62, 6, 603--613. http://doi.org/10.1001/archpsyc.62.6.603",
      "doi": ""
    },
    {
      "text": "Rui Wang, Weichen Wang, Alex daSilva, et al. 2018. Tracking Depression Dynamics in College Students Using Mobile Phone and Wearable Sensing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1, 43. http://doi.org/10.1145/3191775",
      "doi": "10.1145/3191775"
    },
    {
      "text": "Philip C. Watkins, Jens Uhder, and Stan Pichinevskiy. 2015. Grateful recounting enhances subjective well-being: The importance of grateful processing. The Journal of Positive Psychology 10, 2, 91--98. http://doi.org/10.1080/17439760.2014.927909",
      "doi": ""
    },
    {
      "text": "Robin L. Whitney, Deborah H. Ward, Maria T. Marois, Christopher H. Schmid, Ida Sim, and Richard L. Kravitz. 2018. Patient Perceptions of Their Own Data in mHealth Technology--Enabled Nof-1 Trials for Chronic Pain: Qualitative Study. JMIR mHealth and uHealth 6, 10, e10291. http://doi.org/10.2196/10291",
      "doi": ""
    },
    {
      "text": "Renwen Zhang, Jordan Eschler, and Madhu Reddy. 2018. Online support groups for depression in China: Culturally shaped interactions and motivations. Computer Supported Cooperative Work (CSCW) 27, 3--6, 327--354.",
      "doi": "10.1007/s10606-018-9322-4"
    },
    {
      "text": "Mark Zimmerman, William Ellison, Diane Young, Iwona Chelminski, and Kristy Dalrymple. 2015. How many different ways do patients meet the diagnostic criteria for major depressive disorder? Comprehensive Psychiatry 56, 29--34. http://doi.org/10.1016/j.comppsych.2014.09.007",
      "doi": ""
    }
  ]
}