{
  "doi": "10.1145/3313831.3376678",
  "title": "Ethics in Movement: Shaping and Being Shaped in Human-Drone Interaction",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "How is ethics shaped by the particularities of a design? Through a detailed video analysis, we explore how ethicality is shaped in interaction between a choreographer, a performer and a choir of five drones, performing together on the opera stage. We pinpoint how movements enabled by the human-drone assemblage may limit or liberate artistic expressions vis-à-vis the norms of operatic performance. From a somaesthetics perspective on ethics, we show how the process of crafting rich experiences together with drones can deepen sensory appreciation skills, leading to an increased understanding of underlying somatic drivers and imposed norms. Somatic awareness thereby enables a richer repertoire of movements, expanding the ability to freely choose how to act, and cultivating empathy towards others. This shifts our understanding of ethics in HCI as solely about abstract rules or policies 'out there' to also concern the specifics of how technology informs or dictates movement and experience.",
  "authors": [
    {
      "name": "Sara Eriksson",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659178358",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Richard Shusterman",
      "institution": "Florida Atlantic University, Boca Raton, FL, USA",
      "img": "/do/10.1145/contrib-89758972157/rel-imgonly/640x640_10714884.jpg",
      "acmid": "89758972157",
      "orcid": "missing"
    },
    {
      "name": "Dag Svanes",
      "institution": "Norwegian University of Science and Technology, Trondheim, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528041",
      "orcid": "missing"
    },
    {
      "name": "Carl Unander-Scharin",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557068756",
      "orcid": "missing"
    },
    {
      "name": "Åsa Unander-Scharin",
      "institution": "Luleå university of technology, Piteå, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958876257",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Julio Abascal and Colette Nicolle. 2005. Moving towards inclusive design guidelines for socially and ethically aware HCI. Interacting Computers 17, 5 (Sept. 2005), 484--505. DOI: http://dx.doi.org/10.1016/j.intcom.2005.03.002",
      "doi": "10.1016/j.intcom.2005.03.002"
    },
    {
      "text": "Kristina Andersen and Dan Gibson. 2017. The instrument as the source of new in new music. Design Issues 33, 3 (July 2017), 37--55. DOI: http://dx.doi.org/10.1162/DESI_a_00450",
      "doi": ""
    },
    {
      "text": "Thomas Arnold and Matthias Scheutz. 2017. The tactile ethics of soft robotics: Designing wisely for human--robot interaction. Soft robotics 4, 2 (June 2017), 81--87.",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2007. Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning. Duke University Press, Durham, NC, USA.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking stock and outlining an agenda for design. In Proceedings of the 2010 CHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1301--1310. DOI: http://dx.doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Mehmet Aydin Baytas, Damla Çay, Yuchong Zhang, Mohammad Obaid, Asim Evren Yantaç, and Morten Fjeld. 2019. The design of social drones: A review of studies on autonomous flyers in inhabited environments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 250, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300480",
      "doi": "10.1145/3290605.3300480"
    },
    {
      "text": "Victoria Bellotti and Abigail Sellen. 1993. Design for privacy in ubiquitous computing environments. In Proceedings of the Third European Conference on Computer-Supported Cooperative Work 13--17 September 1993 (ECSCW '93), Giorgio de Michelis, Carla Simone, and Kjeld Schmidt (Eds.). Springer, Dordrecht, Netherlands, 77--92. DOI: http://dx.doi.org/10.1007/978--94-011--2094--4_6",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Cynthia L. Bennett and Daniela K. Rosner. 2019. The promise of empathy: Design, disability, and knowing the \"other\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 298, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300528",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Rebecca Boden, Debbie Epstein, and Joanna Latimer. 2009. Accounting for ethos or programmes for conduct? The brave new world of research ethics committees. The Sociological Review 57, 4 (Nov. 2009), 727--749.",
      "doi": ""
    },
    {
      "text": "Arthur L. Caplan. 2005. Ethics of the Body: Postconventional Challenges. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Isabelle Choinière. 2015. Intercorporeality and technology: toward a new cognitive, aesthetic and communicative paradigm in the performing arts. Ph.D. Dissertation. Plymouth University, Plymouth, UK.",
      "doi": ""
    },
    {
      "text": "Gilbert Cockton. 2006. Designing worth is worth designing. In Proceedings of the Fourth Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06). ACM, NY, NY, USA, 165--174. DOI: http://dx.doi.org/10.1145/1182475.1182493",
      "doi": "10.1145/1182475.1182493"
    },
    {
      "text": "Andy Dearden. 2012. See no evil?: Ethics in an interventionist ICTD. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). ACM, NY, NY, USA, 46--55. DOI: http://dx.doi.org/10.1145/2160673.2160680",
      "doi": "10.1145/2160673.2160680"
    },
    {
      "text": "Vinciane Despret. 2013a. From secret agents to interagency. History and Theory 52, 4 (dec 2013), 29--44.",
      "doi": ""
    },
    {
      "text": "Vinciane Despret. 2013b. Responding bodies and partial affinities in human--animal worlds. Theory, Culture & Society 30, 7--8 (Aug. 2013), 51--76. DOI: http://dx.doi.org/10.1177/0263276413496852",
      "doi": ""
    },
    {
      "text": "John Dewey. 2005. Art as experience. Perigee Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Paul Dourish, Janet Finlay, Phoebe Sengers, and Peter Wright. 2004. Reflective HCI: Towards a critical technical practice. In Extended Abstracts of the 2004 CHI Conference on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 1727--1728.",
      "doi": "10.1145/985921.986203"
    },
    {
      "text": "Sara Eriksson, Åsa Unander-Scharin, Vincent Trichon, Carl Unander-Scharin, Hedvig Kjellström, and Kristina Höök. 2019. Dancing with drones: Crafting novel artistic expressions through intercorporeality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 617, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300847",
      "doi": "10.1145/3290605.3300847"
    },
    {
      "text": "Gurur. Ertem and Sandra. Noeth. 2018. Bodies of Evidence: Ethics, Aesthetics, and Politics of Movement. Passagen Verlag Ges.m.b.H., Vienna, AU.",
      "doi": ""
    },
    {
      "text": "Sarah Fdili Alaoui. 2019. Making an interactive dance piece: Tensions in integrating technology in art. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, NY, NY, USA, 1195--1208. DOI: http://dx.doi.org/10.1145/3322276.3322289",
      "doi": "10.1145/3322276.3322289"
    },
    {
      "text": "Sarah Fdili Alaoui, Thecla Schiphorst, Shannon Cuykendall, Kristin Carlson, Karen Studd, and Karen Bradley. 2015. Strategies for embodied design: the value and challenges of observing movement. In Proceedings of the ACM Conference on Creativity and Cognition (C&C'15). ACM, NY, NY, USA, 121--130. DOI: http://dx.doi.org/10.1145/2757226.2757238",
      "doi": ""
    },
    {
      "text": "Moshe Feldenkrais. 1972. Awarness through movement. Harper & Row, San Fransisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Pedro Ferreira and Kristina Höök. 2011. Bodily orientations around mobiles: Lessons learnt in Vanuatu. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 277--286. DOI: http://dx.doi.org/10.1145/1978942.1978981",
      "doi": "10.1145/1978942.1978981"
    },
    {
      "text": "Christopher Frauenberger, Marjo Rauhala, and Geraldine Fitzpatrick. 2016. In-action ethics. Interacting with Computers 29, 2 (June 2016), 220--236. DOI: http://dx.doi.org/10.1093/iwc/iww024",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Kristina Höök, Brian Gill, Lina Eidmar, Catherine Sallmander Prien, and Rachel Severson. 2008a. Personlig integritet: A comparative study of perceptions of privacy in public places in Sweden and the United States. In Proceedings of the Fifth Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, NY, NY, USA, 142--151. DOI: http://dx.doi.org/10.1145/1463160.1463176",
      "doi": "10.1145/1463160.1463176"
    },
    {
      "text": "Batya Friedman and Peter H. Kahn. 2003. Human values, ethics, and design. In The human-computer interaction handbook, Julie A. Jacko and Andrew Sears (Eds.). L. Erlbaum Associates Inc., Hillsdale, NJ, USA, 1177--1201.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter H. Kahn, and Alan Borning. 2008b. Value sensitive design and information systems. The Handbook of Information and Computer Ethics (2008), 69--101.",
      "doi": ""
    },
    {
      "text": "Elizabeth Grosz. 1994. Volatile Bodies: Toward a Corporeal Feminism. Indiana University Press, Bloomington, IN, USA.",
      "doi": ""
    },
    {
      "text": "Maurice Hamington. 2008. Resources for feminist care ethics in Merleau-Ponty's phenomenology of the body. In Intertwinings: Interdisciplinary Encounters with Merleau-Ponty, Gail Weiss (Ed.). Suny Press, Albany, NY, USA, 203--220.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2006. A cyborg manifesto: Science, technology, and socialist-feminism in the late 20th century. Springer Netherlands, Dordrecht, NL, 117--158. DOI: http://dx.doi.org/10.1007/978--1--4020--3803--7_4",
      "doi": ""
    },
    {
      "text": "Christian Heath, Paul Luff, and Marcus Sanchez Svensson. 2007. Video and qualitative research: Analysing medical practice and interaction. Medical Education 41, 1 (Jan. 2007), 109--116.",
      "doi": ""
    },
    {
      "text": "Cressida J. Heyes. 2007. Self-transformations: Foucault, Ethics, and Normalized Bodies. Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Mads Hobye and Jonas Löwgren. 2011. Touching a stranger: Designing for engaging experience in embodied interaction. International Journal of Design 5, 3 (Dec. 2011), 31--48.",
      "doi": ""
    },
    {
      "text": "Stacy Hsueh, Sarah Fdili Alaoui, and Wendy E. Mackay. 2019. Understanding Kinaesthetic Creativity in Dance. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 511, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300741",
      "doi": "10.1145/3290605.3300741"
    },
    {
      "text": "Caroline Hummels, Kees C. Overbeeke, and Sietske Klooster. 2007. Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction. Personal Ubiquitous Computing 11 (Dec. 2007), 677--690. DOI: http://dx.doi.org/10.1007/s00779-006-0135-y",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Floyd Müller, Marianne Graves Petersen, Thecla Schiphorst, Elena Márquez Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing first-person perspectives in soma-based design. Informatics 5, 1 (Feb. 2018). DOI: http://dx.doi.org/10.3390/informatics5010008",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Martin Jonsson, Anna Ståhl, Jakob Tholander, Toni Robertson, Patrizia Marti, Dag Svanæs, Marianne Graves Petersen, Jodi Forlizzi, Thecla Schiphorst, Katherine Isbister, Caroline Hummels, Sietske Klooster, Lian Loke, and George Poonkhin Khut. 2016b. Move to Be Moved. In Extended Abstracts of the 2016 CHI Conference on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 3301--3308. DOI: http://dx.doi.org/10.1145/2851581.2856470",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016a. Somaesthetic appreciation design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3131--3142. DOI: http://dx.doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Kristina Höök and Jarmo Laaksolahti. 2008. Empowerment: a strategy to dealing with human values in affective interactive systems. (2008).",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Anna Ståhl, Petra Sundström, and Jarmo Laaksolaahti. 2008. Interactional Empowerment. In Proceedings of the 2008 CHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 647--656. DOI: http://dx.doi.org/10.1145/1357054.1357157",
      "doi": ""
    },
    {
      "text": "Don Ihde. 1990. Technology and the Lifeworld: From Garden to Earth. Indiana University Press, Bloomington, IN, USA.",
      "doi": ""
    },
    {
      "text": "Nassim JafariNaimi, Lisa Nathan, and Ian Hargraves. 2015. Values as hypotheses: Design, inquiry, and the service of values. Design Issues 31, 4 (Oct. 2015), 91--104. DOI: http://dx.doi.org/10.1162/DESI_a_00354",
      "doi": ""
    },
    {
      "text": "Kari Karjalainen, Anna Romell, Photchara Ratsamee, Asim Yantac, Morten Fjeld, and Mohammad Obaid. 2017. Social drone companion for the home environment: A user-centric exploration. In Proceedings of the 5th International Conference on Human Agent Interaction (HAI '17). ACM, NY, NY, USA, 89--96. DOI: http://dx.doi.org/10.1145/3125739.3125774",
      "doi": "10.1145/3125739.3125774"
    },
    {
      "text": "Pavel Karpashevich, Eva Hornecker, Michaela Honauer, and Pedro Sanches. 2018. Reinterpreting Schlemmer's Triadic Ballet: Interactive costume for unthinkable movements. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 61:1--61:13. DOI: http://dx.doi.org/10.1145/3173574.3173635",
      "doi": ""
    },
    {
      "text": "Md. Nafiz Hasan Khan and Carman Neustaedter. 2019. An exploratory study of the use of drones for assisting firefighters during emergency situations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 272, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300502",
      "doi": ""
    },
    {
      "text": "Oussama Khatib. 1985. Real-time obstacle avoidance for manipulators and mobile robots. In Proceedings of the IEEE International Conference on Robotics and Automation (IEEE'85). IEEE, 500--505. DOI: http://dx.doi.org/10.1109/ROBOT.1985.1087247",
      "doi": ""
    },
    {
      "text": "George Khut. 2006. Development and evaluation of participant-centred biofeedback artworks. Unpublished Doctoral Exegesis, University of Western Sydney. (2006).",
      "doi": ""
    },
    {
      "text": "Heesoon Kim and James A. Landay. 2018. Aeroquake: Drone augmented dance. In Proceedings of the 2018 on Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 691--701. DOI: http://dx.doi.org/10.1145/3196709.3196798",
      "doi": ""
    },
    {
      "text": "Nina Kov. 2012. Copter. (2012). Retrieved September 1, 2019 from http://www.ninakov.com/portfolio-item/copter/",
      "doi": ""
    },
    {
      "text": "Joseph La Delfa, Mehmet Aydin Baytas, Olivia Wichtowski, Rohit Ashok Khot, and Florian Floyd Mueller. 2019. Are drones meditative?. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article INT046, 4 pages. DOI: http://dx.doi.org/10.1145/3290607.3313274",
      "doi": "10.1145/3290607.3313274"
    },
    {
      "text": "Christopher A. Le Dantec, Erika S. Poole, and Susan P. Wyche. 2009. Values as lived experience: Evolving value sensitive design in support of value discovery. In Proceedings of the 2009 CHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1141--1150. DOI: http://dx.doi.org/10.1145/1518701.1518875",
      "doi": ""
    },
    {
      "text": "Lian Loke and Thecla Schiphorst. 2018. The somatic turn in human-computer interaction. Interactions 25, 5 (Aug. 2018), 54--5863. DOI: http://dx.doi.org/10.1145/3236675",
      "doi": "10.1145/3236675"
    },
    {
      "text": "Jonas Löwgren and Erik Stolterman. 2004. Thoughtful Interaction Design: A design Perspective on Information Technology. MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Daito Manabe. 2014. Dance with drones. (2014). Retrieved September 9, 2019 from http://www.daito.ws/work/elevenplay_drones.html",
      "doi": ""
    },
    {
      "text": "Annette N. Markham, Katrin Tiidenberg, and Andrew Herman. 2018. Ethics as methods: Doing ethics in the era of big data research - Introduction. Social Media + Society 4, 3 (7 2018), 2056305118784502. DOI: http://dx.doi.org/10.1177/2056305118784502",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 1962. Phenomenology of Perception. Routledge & Kegan Paul, Abingdon-on-Thames, UK.",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 1969. The Visible and the Invisible. Northwestern University Press, Evanston, IL, USA.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, and John Vines. 2015. Situational ethics: Re-thinking approaches to formal ethics requirements for human-computer interaction. In Proceedings of the 2015 CHI Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 105--114. DOI: http://dx.doi.org/10.1145/2702123.2702481",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Maria Puig de la Bellacasa. 2010. Ethical doings in naturecultures. Ethics Place and Environment 13 (06 2010), 151--169. DOI: http://dx.doi.org/10.1080/13668791003778834",
      "doi": ""
    },
    {
      "text": "Maria Puig de La Bellacasa. 2011. Matters of care in technoscience: Assembling neglected things. Social studies of science 41, 1 (Dec. 2011), 85--106.",
      "doi": ""
    },
    {
      "text": "Robert Rosenberger and Peter-Paul Verbeek. 2015. A field guide to postphenomenology. In Postphenomenological Investigations: Essays on Human-Technology Relations, Robert Rosenberger and Peter-Paul Verbeek (Eds.). Lexington Books, Lanham, MD, USA, 9--41.",
      "doi": ""
    },
    {
      "text": "Céline Roux. 2007. Danse(s) Performative(s). Editions L'Harmattan, Paris, France.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2011. Self-evidence: applying somatic connoisseurship to experience design. In Extended Abstracts of the 2011 CHI Conference on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 145--160. DOI: http://dx.doi.org/10.1145/1979742.1979640",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility (CC '05). ACM, NY, NY, USA, 49--58. DOI: http://dx.doi.org/10.1145/1094562.1094569",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Maxine Sheets-Johnstone. 1994. The Roots of Power: Animate Form and Gendered Bodies. Open Court Publishing, Chicago, IL, USA.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 1999a. Emotion and movement: A beginning empirical-phenomenological analysis of their relationship. Journal of Consciousness Studies 6, 11--12 (Jan. 1999), 259--277.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 1999b. The Primacy of Movement. John Benjamins Publishing, Amsterdam, NL.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 2008. The Roots of Morality. Penn State Press, University Park, PA, USA.",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2018. Values and ethics in human-computer interaction. Foundations and Trends in Human--Computer Interaction 12, 2 (July 2018), 107--171. DOI: http://dx.doi.org/10.1561/1100000073",
      "doi": "10.1561/1100000073"
    },
    {
      "text": "Richard Shusterman. 1997. Practicing Philosophy: Pragmatism and the Philosophical Life. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2003. Somaesthetics and The Second Sex: A pragmatist reading of a feminist classic. Hypatia 18, 4 (Nov. 2003), 106--136.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2008. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2012. Thinking through the Body: Essays in Somaesthetics. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2018. Somaesthetic practice and the question of norms. In Questions of Practice in Philosophy and Social Theory, Anders Buch and Theodore Schatzki (Eds.). Routledge, London, UK, 136--153. DOI: http://dx.doi.org/10.4324/9781351184854--9",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2019. Pleasure, pain, and the Somaesthetics of illness: A question for everyday aesthetics. In Paths from the Philosophy of Art to Everyday Aesthetics. Finnish Society for Aesthetics, Helsinki, Finland, 201--214.",
      "doi": ""
    },
    {
      "text": "Mario Silvagni, Andrea Tonoli, Enrico Zenerino, and Marcello Chiaberge. 2017. Multipurpose UAV for search and rescue operations in mountain avalanche events. Geomatics, Natural Hazards and Risk 8, 1 (Oct. 2017), 18--33. DOI: http://dx.doi.org/10.1080/19475705.2016.1238852",
      "doi": ""
    },
    {
      "text": "Dag Svanæs. 2013. Interaction design for and with the lived Body: Some implications of Merleau-Ponty's phenomenology. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 1 (April 2013), 8:1--8:30. DOI: http://dx.doi.org/10.1145/2442106.2442114",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Dag Svanæs and Martin Solheim. 2016. Wag your tail and flap your ears: The kinesthetic user experience of extending your body. In Extended Abstracts of the 2016 CHI Conference on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 3778--3779. DOI: http://dx.doi.org/10.1145/2851581.2890268",
      "doi": "10.1145/2851581.2890268"
    },
    {
      "text": "Dag Svanæs. 1997. Kinaesthetic thinking: The tacit dimension of interaction design. Computers in Human Behavior 13, 4 (Dec. 1997), 443 -- 463. DOI: http://dx.doi.org/10.1016/S0747--5632(97)00020--4 Norwegian Perspectives on Computing in Complex Domains.",
      "doi": ""
    },
    {
      "text": "Atau Tanaka. 2006. Interaction, experience and the future of music. In Consuming Music Together: Social and Collaborative Aspects of Music Consumption Technologies, Kenton O'Hara and Barry Brown (Eds.). Springer, Berlin, Germany, 267--288.",
      "doi": ""
    },
    {
      "text": "Henry D. Thoreau. 2016. Walden. Macmillan Collector's Library, Basingstoke, UK.",
      "doi": ""
    },
    {
      "text": "Carl Unander-Scharin. 2015. Extending opera artist-led explorations in operatic practice through interactivity and electronics. Ph.D. Dissertation. KTH Royal Institute of Technology and University College of Opera, Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Åsa Unander-Scharin. 2008. Mänsklig mekanik och besjälade maskiner: koreografiska perspektiv på mänskliga kvaliteter i kroppars rörelse. Ph.D. Dissertation. Luleå University of Technology, Piteå, Sweden.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde. 2012. hipDisk: Experiencing the value of ungainly, embodied, performative, fun. In Extended Abstracts of the 2012 CHI Conference on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 979--982. DOI: http://dx.doi.org/10.1145/2212776.2212365",
      "doi": "10.1145/2212776.2212365"
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied design ideation methods: Analysing the power of estrangement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5158--5170. DOI: http://dx.doi.org/10.1145/3025453.3025873",
      "doi": "10.1145/3025453.3025873"
    },
    {
      "text": "Anette Zimmerman and Bendert Zevenbergen. 2019. AI ethics: Seven traps. (2019). Retrieved September 5, 2019 from https://freedom-to-tinker.com/2019/03/25/ ai-ethics-seven-traps/",
      "doi": ""
    }
  ]
}