{
  "doi": "10.1145/3313831.3376227",
  "title": "Unfabricate: Designing Smart Textiles for Disassembly",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Smart textiles development is combining computing and textile technologies to create tactile, functional objects such as smart garments, soft medical devices, and space suits. However, the field also combines the massive waste streams of both the digital electronics and textiles industries. The following work explores how HCI researchers might be poised to address sustainability and waste in future smart textiles development through interventions at design time. Specifically, we perform a design inquiry into techniques and practices for reclaiming and reusing smart textiles materials and explore how such techniques can be integrated into smart textiles design tools. Beginning with a practice in sustainable or \"slow\" fashion, unravelling a garment into yarn, the suite of explorations titled \"Unfabricate\" probes values of time and labor in crafting a garment; speculates how a smart textile garment may be designed with reuse in mind; and imagines how electronic and textile components may be given new life in novel uses.",
  "tags": [
    "knitting",
    "disassembly",
    "computer-aided design",
    "sustainability",
    "smart textiles",
    "weaving",
    "unraveling"
  ],
  "authors": [
    {
      "name": "Shanel Wu",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366751",
      "orcid": "missing"
    },
    {
      "name": "Laura Devendorf",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81557677456/rel-imgonly/laura_devendorf14ga.jpg",
      "acmid": "81557677456",
      "orcid": "0000-0002-3656-7936"
    }
  ],
  "references": [
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 184:1--184:13. DOI: http://dx.doi.org/10.1145/3290605.3300414",
      "doi": ""
    },
    {
      "text": "Paul M. Aoki, R. J. Honicky, Alan Mainwaring, Chris Myers, Eric Paulos, Sushmita Subramanian, and Allison Woodruff. 2009. A Vehicle for Research: Using Street Sweepers to Explore the Landscape of Environmental Community Action. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 375--384. DOI: http://dx.doi.org/10.1145/1518701.1518762",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Beth Bachuss. 2007. Ravelry: Thrifty Knitters. (2007). https://www.ravelry.com/groups/thrifty-knitters",
      "doi": ""
    },
    {
      "text": "Sandy Black. 2012. Knitting: Fashion, Industry, Craft. Victoria & Albert Museum, London, England, UK.",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 503--512. DOI: http://dx.doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Mark Blythe. 2004. Pastiche Scenarios. Interactions 11, 5 (Sept. 2004), 51--53. DOI: http://dx.doi.org/10.1145/1015530.1015554",
      "doi": "10.1145/1015530.1015554"
    },
    {
      "text": "Beta Brand. 2010. DARPA Hoodie. (2010). https://www.betabrand.com/gray-darpa-hoodie",
      "doi": ""
    },
    {
      "text": "Kunigunde Cherenack and Liesbeth van Pieterson. 2012. Smart textiles: Challenges and opportunities. Journal of Applied Physics 112, 9 (Nov. 2012), 091301. DOI: http://dx.doi.org/10.1063/1.4742728",
      "doi": ""
    },
    {
      "text": "David Chudzicki. 2011. Planned/Intentional Pooling. (2011). http://plannedpooling.com",
      "doi": ""
    },
    {
      "text": "National Resources Defense Council. 2017. Encourage Textile Manufacturers to Reduce Pollution. (2017). https://www.nrdc.org/issues/encourage-textilemanufacturers-reduce-pollution",
      "doi": ""
    },
    {
      "text": "Beatriz da Costa, Cina Hazegh, and Kevin Ponto. 2008. Interspecies Coproduction in the Pursuit of Resistant Action. (2008). http://nideffer.net/shaniweb/pigeonblog.php",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 753--764. DOI: http://dx.doi.org/10.1145/3196709.3196781",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Audrey Desjardins and Ron Wakkary. 2016. Living In A Prototype: A Reconfgured Space. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5274--5285. DOI: http://dx.doi.org/10.1145/2858036.2858261",
      "doi": "10.1145/2858036.2858261"
    },
    {
      "text": "Laura Devendorf, Kristina Andersen, Daniela K. Rosner, Ron Wakkary, and James Pierce. 2019. From HCI to HCI-Amusement: Strategies for Engaging What New Technology Makes Old. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article Paper 35, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300265",
      "doi": "10.1145/3290605.3300265"
    },
    {
      "text": "Laura Devendorf and Chad Di Lauro. 2019. Adapting Double Weaving and Yarn Plying Techniques for Smart Textiles Applications. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 77--85. DOI: http://dx.doi.org/10.1145/3294109.3295625",
      "doi": "10.1145/3294109.3295625"
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2477--2486. DOI: http://dx.doi.org/10.1145/2702123.2702547",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2018. Lessons from the Woodshop: Cultivating Design with Living Materials. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 585, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174159",
      "doi": "10.1145/3173574.3174159"
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2019. Designing with Waste: A Situated Inquiry into the Material Excess of Making. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, NY, NY, USA, 1307--1319. DOI: http://dx.doi.org/10.1145/3322276.3322320",
      "doi": "10.1145/3322276.3322320"
    },
    {
      "text": "Kristin N. Dew, Samantha Shorey, and Daniela Rosner. 2018. Making Within Limits: Towards Salvage Fabrication. In Proceedings of the 2018 Workshop on Computing Within Limits (LIMITS '18). ACM, NY, NY, USA, Article 7, 11 pages. DOI: http://dx.doi.org/10.1145/3232617.3232626",
      "doi": "10.1145/3232617.3232626"
    },
    {
      "text": "Carl DiSalvo and Tom Jenkins. 2017. Fruit Are Heavy: A Prototype Public IoT System to Support Urban Foraging. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 541--553. DOI: http://dx.doi.org/10.1145/3064663.3064748",
      "doi": "10.1145/3064663.3064748"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the Landscape of Sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1975--1984. DOI: http://dx.doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 1--10. DOI: http://dx.doi.org/10.1145/1858171.1858173",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. The MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Deb Essen. 2016. Easy Weaving with Supplemental Warps: Overshot, Velvet, Shibori, and More. Interweave, Fort Collins, CO, USA.",
      "doi": ""
    },
    {
      "text": "Kate Fletcher. 2016. Craft of Use: Post-Growth Fashion. Routledge, London, England, UK.",
      "doi": ""
    },
    {
      "text": "Kate Fletcher and Mathilda Tham. 2014. Routledge Handbook of Sustainability and Fashion. Routledge, London, England, UK.",
      "doi": ""
    },
    {
      "text": "World Business Council for Sustainable Development. 2019. Design for disassembly/deconstruction. In Circular Economy Guide. Climate-KIC, Geneva, Switzerland. https://www.ceguide.org/Strategies-and-examples/Design/Design-for-disassembly-deconstruction",
      "doi": ""
    },
    {
      "text": "Ellen MacArthur Foundation. 2017. A New Textiles Economy: Redesigning fashion's future. Ellen MacArthur Foundation, Cowes, United Kingdom. https://www.ellenmacarthurfoundation.org/publications/a-new-textiles-economy-redesigning-fashions-future",
      "doi": ""
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. 2019. AdaCAD: Crafting Software For Smart Textiles Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 345:1--345:13. DOI: http://dx.doi.org/10.1145/3290605.3300575",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions 6, 1 (Jan. 1999), 21--29. DOI: http://dx.doi.org/10.1145/291224.291235",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William Gaver. 2011. Making spaces: how design workbooks work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1551--1560. DOI: http://dx.doi.org/10.1145/1978942.1979169",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 937--946. DOI: http://dx.doi.org/10.1145/2208516.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Tim Ingold. 2013. Making: Anthropology, Archaeology, Art and Architecture (1 ed.). Routledge, London ; New York.",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson and Laewoo Kang. 2014. Breakdown, Obsolescence and Reuse: HCI and the Art of Repair. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 449--458. DOI: http://dx.doi.org/10.1145/2556288.2557332",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair Worlds: Maintenance, Repair, and ICT for Development in Rural Namibia. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 107--116. DOI: http://dx.doi.org/10.1145/2145204.2145224",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Sunyoung Kim, Eric Paulos, and Mark D. Gross. 2010. WearAir: Expressive T-shirts for Air Quality Sensing. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10). ACM, NY, NY, USA, 295--296. DOI: http://dx.doi.org/10.1145/1709886.1709949",
      "doi": ""
    },
    {
      "text": "David Kirsh. 2011. How marking in dance constitutes thinking with the body. VERSUS: Quaderni di studi semiotici 113--115 (2011), 179--210. http://adrenaline.ucsd.edu/kirsh/Articles/Marking_In_Dance/MarkingInDance.pdf",
      "doi": ""
    },
    {
      "text": "Kniterate. 2019. Kniterate: the Digital Knitting Machine. (2019). https://www.kniterate.com/product/kniteratethe-digital-knitting-machine/",
      "doi": ""
    },
    {
      "text": "Robert Kovacs, Alexandra Ion, Pedro Lopes, Tim Oesterreich, Johannes Filter, Philipp Otto, Tobias Arndt, Nico Ring, Melvin Witte, Anton Synytsia, and Patrick Baudisch. 2018. TrussFormer: 3D Printing Large Kinetic Structures. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 113--125. DOI: http://dx.doi.org/10.1145/3242587.3242607",
      "doi": "10.1145/3242587.3242607"
    },
    {
      "text": "Stacey Kuznetsov, William Odom, James Pierce, and Eric Paulos. 2011. Nurturing Natural Sensors. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, NY, NY, USA, 227--236. DOI: http://dx.doi.org/10.1145/2030112.2030144",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "Jacqueline Lefferts. 2019. Mannequin Loom. (2019). http://www.jacquelinelefferts.com/#/mannequin-loom/",
      "doi": ""
    },
    {
      "text": "Ann Light, Irina Shklovski, and Alison Powell. 2017. Design for Existential Crisis. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 722--734. DOI: http://dx.doi.org/10.1145/3027063.3052760",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Pamela Liou. 2015. Doti: the Dot-Matrix Desktop Loom. (April 2015). http://pamelaliou.com/blog/?p=418",
      "doi": ""
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 40, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173614",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Leah Maestri and Ron Wakkary. 2011. Understanding Repair As a Creative Process of Everyday Design. In Proceedings of the 8th ACM Conference on Creativity and Cognition (C&C '11). ACM, NY, NY, USA, 81--90. DOI: http://dx.doi.org/10.1145/2069618.2069633",
      "doi": "10.1145/2069618.2069633"
    },
    {
      "text": "James McCann, Lea Albaugh, Vidya Narayanan, April Grow, Wojciech Matusik, Jennifer Mankoff, and Jessica Hodgins. 2016. A Compiler for 3D Machine Knitting. ACM Trans. Graph. 35, 4, Article 49 (July 2016), 11 pages. DOI: http://dx.doi.org/10.1145/2897824.2925940",
      "doi": "10.1145/2897824.2925940"
    },
    {
      "text": "Holly McQuillan. 2019. Hybrid zero waste design practices.: Zero waste pattern for composite garment weaving and its implications. In Running with Scissors, 13th EAD Conference, Dundee, 10--12 April, 2019. European Academy of Design, Dundee, Scotland, UK, 1--17. http://hb.diva-portal.org/smash/record.jsf?pid= diva2%3A1316581",
      "doi": ""
    },
    {
      "text": "Jussi Mikkonen and Emmi Pouta. 2015. Weaving Electronic Circuit into Two-layer Fabric. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, NY, NY, USA, 245--248. DOI: http://dx.doi.org/10.1145/2800835.2800936",
      "doi": ""
    },
    {
      "text": "Martin Murer. 2018. Making Things Apart: Gaining Material Understanding. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 497--509. DOI: http://dx.doi.org/10.1145/3196709.3196806",
      "doi": "10.1145/3196709.3196806"
    },
    {
      "text": "Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2015. Deconstructivist Interaction Design: Interrogating Expression and Form. Aarhus Series on Human Centered Computing 1, 1 (Oct. 2015), 4. DOI: http://dx.doi.org/10.7146/aahcc.v1i1.21313",
      "doi": "10.7146/aahcc.v1i1.21313"
    },
    {
      "text": "Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2017. Un-Crafting: De-Constructive Engagements with Interactive Artifacts. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, NY, NY, USA, 67--77. DOI: http://dx.doi.org/10.1145/3024969.3024993",
      "doi": "10.1145/3024969.3024993"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning Through Use-it-yourself. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 514--523. DOI: http://dx.doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Michael Nitsche and Anna Weisling. 2019. When is It Not Craft?: Materiality and Mediation when Craft and Computing Meet. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 683--689. DOI: http://dx.doi.org/10.1145/3294109.3295651",
      "doi": "10.1145/3294109.3295651"
    },
    {
      "text": "Digital Weaving Norway. 2019. TC2 Digital Jacquard Loom. (2019). http://www.digitalweaving.no/",
      "doi": ""
    },
    {
      "text": "NIIR Board of Consultants & Engineers. 2017. The Complete Technology Book on Textile Spinning, Weaving, Finishing and Printing (3rd Revised Edition). ASIA PACIFIC BUSINESS PRESS Inc., Kamla Nagar, Delhi, India.",
      "doi": ""
    },
    {
      "text": "Maggie Orth, Rehmi Post, and Emily Cooper. 1998. Fabric Computing Interfaces. In CHI 98 Conference Summary on Human Factors in Computing Systems (CHI '98). ACM, NY, NY, USA, 331--332. DOI: http://dx.doi.org/10.1145/286498.286800",
      "doi": "10.1145/286498.286800"
    },
    {
      "text": "Yue Pan and Eli Blevis. 2014. Fashion Thinking: Lessons from Fashion and Sustainable Interaction Design, Concepts and Issues. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 1005--1014. DOI: http://dx.doi.org/10.1145/2598510.2598586",
      "doi": "10.1145/2598510.2598586"
    },
    {
      "text": "Hayley Phelan. 2017. What Is Slow Fashion? We Explain. (Oct. 2017). https://www.nytimes.com/2017/10/11/fashion/what-is-slow-fashion.html",
      "doi": ""
    },
    {
      "text": "Anna Piper and Katherine Townsend. 2015. Crafting the Composite Garment: The role of hand weaving in digital creation. Journal of Textile Design Research and Practice 3, 1--2 (July 2015), 3--26. DOI: http://dx.doi.org/10.1080/20511787.2015.1127037",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev. 2019. Keynotes -- CHI 2019. (2019). https://chi2019.acm.org/for-attendees/keynotes/",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4216--4227. DOI: http://dx.doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "David Pye. 2007. The Nature and Art of Workmanship. A&C Black, London.",
      "doi": ""
    },
    {
      "text": "Barath Raghavan and Daniel Pargman. 2017. Means and Ends in Human-Computer Interaction: Sustainability Through Disintermediation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 786--796. DOI: http://dx.doi.org/10.1145/3025453.3025542",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "Transparency Market Research. 2019. Global Smart Fabrics Market is projected to rise at a colossal CAGR of 19.6% during 2017--2022. (Jan. 2019). http://www.globenewswire.com/news-release/2019/01/09/1682672/0/en/Global-Smart-Fabrics-Market-isprojected-to-rise-at-a-colossal-CAGR-of-19--6-during2017--2022-TMR.html",
      "doi": ""
    },
    {
      "text": "Mohammad Rashidujjaman Rifat, Hasan Mahmud Prottoy, and Syed Ishtiaque Ahmed. 2019. The Breaking Hand: Skills, Care, and Sufferings of the Hands of an Electronic Waste Worker in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). Association for Computing Machinery, New York, NY, USA, Article Paper 23, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300253",
      "doi": "10.1145/3290605.3300253"
    },
    {
      "text": "Daniela K. Rosner and Kimiko Ryokai. 2008. Spyn: Augmenting Knitting to Support Storytelling and Refection. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08). ACM, NY, NY, USA, 340--349. DOI: http://dx.doi.org/10.1145/1409635.1409682",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofsh' Kaye. 2005. Refective Design. In Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility (CC '05). ACM, NY, NY, USA, 49--58. DOI: http://dx.doi.org/10.1145/1094562.1094569",
      "doi": ""
    },
    {
      "text": "Stephen Sheard. 1989. THE ROWAN/BROTHER DESIGNER MACHINE KNITTING BOOK (1st ed.). EBURY PRESS, London.",
      "doi": ""
    },
    {
      "text": "Rachel Charlotte Smith, Kasper Tang Vangkilde, Mette Gislev Kjaersgaard, Ton Otto, Joachim Halse, and Thomas Binder (Eds.). 2016. Design Anthropological Futures (reprint ed.). Bloomsbury Academic, London ; New York.",
      "doi": ""
    },
    {
      "text": "WEAR Sustain. 2019. WEAR Sustain. (2019). https://wearsustain.eu/",
      "doi": ""
    },
    {
      "text": "Ye Tao, Nannan Lu, Caowei Zhang, Guanyun Wang, Cheng Yao, and Fangtian Ying. 2016. CompuWoven: A Computer-Aided Fabrication Approach to Hand-Woven Craft. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 2328--2333. DOI: http://dx.doi.org/10.1145/2851581.2892293",
      "doi": "10.1145/2851581.2892293"
    },
    {
      "text": "Vasiliki Tsaknaki, Marisa Cohn, Laurens Boer, Ylva Fernaeus, and Anna Vallgårda. 2016. Things Fall Apart: Unpacking the Temporalities of Impermanence for HCI. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, NY, NY, USA, Article 141, 3 pages. DOI: http://dx.doi.org/10.1145/2971485.2987680",
      "doi": "10.1145/2971485.2987680"
    },
    {
      "text": "Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A Sustainable Design Fiction: Green Practices. ACM Trans. Comput.-Hum. Interact. 20, 4, Article 23 (Sept. 2013), 34 pages. DOI: http://dx.doi.org/10.1145/2494265",
      "doi": "10.1145/2494265"
    },
    {
      "text": "Ron Wakkary and Karen Tanenbaum. 2009. A Sustainable Identity: The Creativity of an Everyday Designer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 365--374. DOI: http://dx.doi.org/10.1145/1518701.1518761",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Melinda Watt. 2011. Renaissance Velvet Textiles. In Heilbrunn Timeline of Art History. The Metropolitan Museum of Art, New York, NY, USA. https://www.metmuseum.org/toah/hd/velv/hd_velv.htm",
      "doi": ""
    },
    {
      "text": "Colin Webster. 2013. The Art Of Design For Disassembly. In Engineering the Circular Economy. Ellen MacArthur Foundation, Cowes, United Kingdom, Chapter 1, 1--5. https://www.ellenmacarthurfoundation.org/news/engineering-the-circular-economy",
      "doi": ""
    },
    {
      "text": "Linda Worbin. 2010. Designing dynamic textile patterns. Ph.D. Dissertation. Chalmers University of Technology. https://www.researchgate.net/publication/277200413_Designing_dynamic_textile_patterns",
      "doi": ""
    },
    {
      "text": "WOVNS. 2019. WOVNS. (2019). https://www.wovns.com/",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Tawanna R. Dillahunt, Nightingale Simiyu, and Sharon Alaka. 2015. \"If God Gives Me the Chance I Will Design My Own Phone\": Exploring Mobile Phone Repair and Postcolonial Approaches to Design in Rural Kenya. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 463--473. DOI: http://dx.doi.org/10.1145/2750858.2804249",
      "doi": "10.1145/2750858.2804249"
    },
    {
      "text": "Reunion Yarn. 2019. Unraveling Club: Get yarn from sweaters! (2019). https://www.unraveling.club/",
      "doi": ""
    },
    {
      "text": "Xiao Zhang and Ron Wakkary. 2011. Design Analysis: Understanding e-Waste Recycling by Generation Y. In Proceedings of the 2011 Conference on Designing Pleasurable Products and Interfaces (DPPI '11). ACM, NY, NY, USA, Article 6, 8 pages. DOI: http://dx.doi.org/10.1145/2347504.2347511",
      "doi": "10.1145/2347504.2347511"
    },
    {
      "text": "Elizabeth Zimmermann. 2012. Elizabeth Zimmermann's Knitter's Almanac: The Commemorative Edition. Courier Corporation, North Chelmsford, MA, USA.",
      "doi": ""
    },
    {
      "text": "C. Zysset, K. Cherenack, T. Kinkeldei, and G. Tröster. 2010. Weaving integrated circuits into textiles. In International Symposium on Wearable Computers (ISWC) 2010. IEEE, Seoul, South Korea, 1--8. DOI: http://dx.doi.org/10.1109/ISWC.2010.5665874",
      "doi": ""
    }
  ]
}