{
  "doi": "10.1145/3313831.3376777",
  "title": "Techniques for Flexible Responsive Visualization Design",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Responsive visualizations adapt to effectively present information based on the device context. Such adaptations are essential for news content that is increasingly consumed on mobile devices. However, existing tools provide little support for responsive visualization design. We analyze a corpus of 231 responsive news visualizations and discuss formative interviews with five journalists about responsive visualization design. These interviews motivate four central design guidelines: enable simultaneous cross-device edits, facilitate device-specific customization, show cross-device previews, and support propagation of edits. Based on these guidelines, we present a prototype system that allows users to preview and edit multiple visualization versions simultaneously. We demonstrate the utility of the system features by recreating four real-world responsive visualizations from our corpus.",
  "authors": [
    {
      "name": "Jane Hoffswell",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131610",
      "orcid": "0000-0002-9871-4575"
    },
    {
      "name": "Wilmot Li",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100480929",
      "orcid": "missing"
    },
    {
      "name": "Zhicheng Liu",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385599440",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Keith Andrews. 2018. Responsive Visualisation. Data Visualization on Mobile Devices Workshop at CHI 2018 (MobileVis) (2018). https://mobilevis.github.io/assets/mobilevis2018_paper_4.pdf",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Trans. Visualization & Comp. Graphics 17, 12 (2011), 2301--2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Nadieh Bremer. 2019. Techniques for Data Visualization on both Mobile & Desktop. (2019). https://www.visualcinnamon.com/2019/04/mobile-vsdesktop-dataviz",
      "doi": ""
    },
    {
      "text": "The New York Times Company. 2017. ai2html. http://ai2html.org/. (2017).",
      "doi": ""
    },
    {
      "text": "Matt Conlen and Jeffrey Heer. 2018. Idyll: A Markup Language for Authoring and Publishing Interactive Articles on the Web. In ACM User Interface Software & Technology (UIST). http://idl.cs.washington.edu/papers/idyll",
      "doi": "10.1145/3242587.3242600"
    },
    {
      "text": "Matt Conlen, Alex Kale, and Jeffrey Heer. 2019. Capture & Analysis of Active Reading Behaviors for Interactive Articles on the Web. Computer Graphics Forum (Proc. EuroVis) (2019). http://idl.cs.washington.edu/papers/idyll-analytics",
      "doi": ""
    },
    {
      "text": "Steven P. Dow, Alana Glassco, Jonathan Kass, Melissa Schwarz, Daniel L. Schwartz, and Scott R. Klemmer. 2010. Parallel Prototyping Leads to Better Design Results, More Divergence, and Increased Self-efficacy. ACM Trans. Comput.-Hum. Interact. 17, 4, Article 18 (Dec. 2010), 24 pages. DOI: http://dx.doi.org/10.1145/1879831.1879836",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Sophia Fedeli and Katerina Eva Matsa. 2018. Use of mobile devices for news continues to grow, outpacing desktops and laptops. Pew Research Center (2018). https://pewrsr.ch/2uvqS04",
      "doi": ""
    },
    {
      "text": "Ben Frain. 2015. Responsive Web Design with HTML5 and CSS3. Packt Publishing.",
      "doi": ""
    },
    {
      "text": "Roy Gal. 2017. Responsive visualizations coming to Power BI. Microsoft Power BI Blog (2017). https://powerbi.microsoft.com/en-us/blog/responsivevisualizations-coming-to-power-bi/",
      "doi": ""
    },
    {
      "text": "Datawrapper GmbH. 2019. Datawrapper. https://www.datawrapper.de/. (2019).",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Maneesh Agrawala, and Wesley Willett. 2008. Generalized Selection via Interactive Query Relaxation. In ACM Human Factors in Computing Systems (CHI). 959--968. http://idl.cs.washington.edu/papers/generalized-selection",
      "doi": ""
    },
    {
      "text": "Tom Horak, Andreas Mathisen, Clemens N. Klokmose, Raimund Dachselt, and Niklas Elmqvist. 2019. Vistribute: Distributing Interactive Visualizations in Dynamic Multi-Device Setups. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/3290605.3300846",
      "doi": "10.1145/3290605.3300846"
    },
    {
      "text": "Zhicheng Liu, John Thompson, Alan Wilson, Mira Dontcheva, James Delorey, Sam Grigg, Bernard Kerr, and John Stasko. 2018. Data Illustrator: Augmenting vector design tools with lazy data binding for expressive visualization authoring. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 123.",
      "doi": "10.1145/3173574.3173697"
    },
    {
      "text": "Ethan Marcotte. 2014. Responsive Web Design. A Book Apart Publ.",
      "doi": ""
    },
    {
      "text": "Ethan Marcotte. 2015. Responsive Design: Patterns and Principles. A Book Apart Publ.",
      "doi": ""
    },
    {
      "text": "Donghao Ren, Matthew Brehmer, Bongshin Lee, Tobias Höllerer, and Eun Kyoung Choe. 2017. ChartAccent: Annotation for Data-Driven Storytelling. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 230--239.",
      "doi": ""
    },
    {
      "text": "Donghao Ren, Bongshin Lee, and Matthew Brehmer. 2018. Charticulator: Interactive construction of bespoke chart layouts. IEEE transactions on visualization and computer graphics 25, 1 (2018), 789--799.",
      "doi": ""
    },
    {
      "text": "Cedric Sam. 2018. Ai2html and Its Impact on the News Graphics Industry. Data Visualization on Mobile Devices Workshop at CHI 2018 (MobileVis) (2018). https://mobilevis.github.io/assets/mobilevis2018_paper_20.pdf",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014a. Authoring Narrative Visualizations with Ellipsis. Computer Graphics Forum (Proc. EuroVis) (2014). http://idl.cs.washington.edu/papers/ellipsis",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014b. Lyra: An Interactive Visualization Design Environment. Computer Graphics Forum (Proc. EuroVis) (2014). http://idl.cs.washington.edu/papers/lyra",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Bongshin Lee, Donghao Ren, Jeffrey Heer, John Stasko, John R. Thompson, Matthew Brehmer, and Zhicheng Liu. 2020. Critical Reflections on Visualization Authoring Systems. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2020). http://idl.cs.washington.edu/papers/reflections-visauthoring",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2017). http://idl.cs.washington.edu/papers/vega-lite",
      "doi": ""
    },
    {
      "text": "Chris Stolte, Diane Tang, and Pat Hanrahan. 2002. Polaris: A system for query, analysis, and visualization of multidimensional relational databases. IEEE Transactions on Visualization and Computer Graphics 8, 1 (2002), 52--65.",
      "doi": "10.1109/2945.981851"
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2015. Voyager: Exploratory analysis via faceted browsing of visualization recommendations. IEEE transactions on visualization and computer graphics 22, 1 (2015), 649--658.",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Xiaotong Liu, Shixia Liu, and Kwan-Liu Ma. 2012. ViSizer: a visualization resizing framework. IEEE Transactions on Visualization and Computer Graphics 19, 2 (2012), 278--290.",
      "doi": ""
    }
  ]
}