{
  "doi": "10.1145/3313831.3376671",
  "title": "Exploring the Quality, Efficiency, and Representative Nature of Responses Across Multiple Survey Panels",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "A common practice in HCI research is to conduct a survey to understand the generalizability of findings from smaller-scale qualitative research. These surveys are typically deployed to convenience samples, on low-cost platforms such as Amazon's Mechanical Turk or Survey Monkey, or to more expensive market research panels offered by a variety of premium firms. Costs can vary widely, from hundreds of dollars to tens of thousands of dollars depending on the platform used. We set out to understand the accuracy of ten different survey platforms/panels compared to ground truth data for a total of 6,007 respondents on 80 different aspects of demographic and behavioral questions. We found several panels that performed significantly better than others on certain topics, while different panels provided longer and more relevant open-ended responses. Based on this data, we highlight the benefits and pitfalls of using a variety of survey distribution options in terms of the quality, efficiency, and representative nature of the respondents and the types of responses that can be obtained.",
  "tags": [
    "representative",
    "surveymonkey",
    "mturk",
    "survey"
  ],
  "authors": [
    {
      "name": "Frank Bentley",
      "institution": "Yahoo/Verizon Media, Sunnyvale, CA, USA",
      "img": "/do/10.1145/contrib-81311482466/rel-imgonly/me.jpg",
      "acmid": "81311482466",
      "orcid": "missing"
    },
    {
      "name": "Kathleen O'Neill",
      "institution": "Yahoo/Verizon Media, New York, NY, USA",
      "img": "/do/10.1145/contrib-99659527395/rel-imgonly/kat_s_headshot.jpg",
      "acmid": "99659527395",
      "orcid": "missing"
    },
    {
      "name": "Katie Quehl",
      "institution": "Yahoo/Verizon Media, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210813",
      "orcid": "missing"
    },
    {
      "name": "Danielle Lottridge",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81350585336/rel-imgonly/daniellelottridgephoto2.jpg",
      "acmid": "81350585336",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Samuel J Abrams. 2016. There are conservative professors. Just not in these states. The New York Times (2016).",
      "doi": ""
    },
    {
      "text": "Judd Antin and Aaron Shaw. 2012. Social Desirability Bias and Self-Reports of Motivation: A Study of Amazon Mechanical Turk in the US and India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). Association for Computing Machinery, New York, NY, USA, 2925--2934. DOI: http://dx.doi.org/10.1145/2207676.2208699",
      "doi": "10.1145/2207676.2208699"
    },
    {
      "text": "API. 2019. Paying for news: Why people subscribe and what it says about the future of journalism. (2019). https://www.americanpressinstitute.org/publications/ reports/survey-research/paying-for-news/",
      "doi": ""
    },
    {
      "text": "Perry Bacon Jr. 2018. Can Conservatives Ever Trust A Tech Industry Staffed Mostly By Liberals? fivethirtyeight (2018).",
      "doi": ""
    },
    {
      "text": "Tara S Behrend, David J Sharek, Adam W Meade, and Eric N Wiebe. 2011. The viability of crowdsourcing for survey research. Behavior research methods 43, 3 (2011), 800.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Nediyana Daskalova, and Nazanin Andalibi. 2017a. If a person is emailing you, it just doesn't make sense: Exploring Changing Consumer Behaviors in Email. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 85--95.",
      "doi": "10.1145/3025453.3025613"
    },
    {
      "text": "Frank R Bentley, Nediyana Daskalova, and Brooke White. 2017b. Comparing the reliability of Amazon Mechanical Turk and Survey Monkey to traditional market research surveys. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1092--1099.",
      "doi": "10.1145/3027063.3053335"
    },
    {
      "text": "Robert Blaise, Michael Halloran, and Marc Muchnick. 2018. Mobile commerce competitive advantage: A quantitative study of variables that predict m-commerce purchase intentions. Journal of Internet Commerce 17, 2 (2018), 96--114.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on psychological science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Daniel Burda and Frank Teuteberg. 2013. Towards Understanding an Employee's Retention Behavior: Antecedents and Implications for E-Mail Governance. (2013).",
      "doi": ""
    },
    {
      "text": "United States Census Bureau. 2018. Annual Estimates of the Resident Population for the United States, Regions, States, and Puerto Rico: April 1, 2010 to July 1, 2018. (2018). http://www2.census.gov/programs-surveys/popest/tables/2010--2018/national/totals/nst-est2018-01.xlsx?#",
      "doi": ""
    },
    {
      "text": "Jonathan J Cadiz, Gina Venolia, Gavin Jancke, and Anoop Gupta. 2002. Designing and deploying an information awareness interface. In Proceedings of the 2002 ACM conference on Computer supported cooperative work. ACM, 314--323.",
      "doi": "10.1145/587078.587122"
    },
    {
      "text": "CDC. 2018. 2018 National Health Interview Survey (NHIS). (2018). ftp://ftp.cdc.gov/pub/Health_Statistics/NCHS/Dataset_Documentation/NHIS/2018/personsx_freq.pdf",
      "doi": ""
    },
    {
      "text": "census.gov. 2010. Table 1188. Usage of General Purpose Credit Cards by Families: 1995 to 200. (2010). https://www2.census.gov/library/publications/2010/compendia/statab/130ed/tables/11s1188.pdf",
      "doi": ""
    },
    {
      "text": "ComScore. 2019. ComScore Internet Population - July 2019. (2019). http://mymetrix.comscore.com",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Frank R Bentley, Eric B Hekler, and Sayali S Phatak. 2017. Mobile user research: A practical guide. Synthesis Lectures on Mobile and Pervasive Computing 9, 1 (2017), i--195.",
      "doi": "10.5555/3110815"
    },
    {
      "text": "Tilman Dingler and Martin Pielot. 2015. I'll be there for you: Quantifying Attentiveness towards Mobile Messaging. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 1--5.",
      "doi": "10.1145/2785830.2785840"
    },
    {
      "text": "eMarketer. 2019. Devices Owned by US Internet Users, Feb 2019. (2019). https://www.emarketer.com/chart/228605/devices-ownedby-us-internet-users-feb-2019-of-respondents",
      "doi": ""
    },
    {
      "text": "Ilker Etikan, Sulaiman Abubakar Musa, and Rukayya Sunusi Alkassim. 2016. Comparison of convenience sampling and purposive sampling. American journal of theoretical and applied statistics 5, 1 (2016), 1--4.",
      "doi": ""
    },
    {
      "text": "FatWallet. 2015. 2015 Travel Study: 8 in 10 Americans Take Vacations. (2015). https://www.prnewswire.com/news-releases/2015-travel-study-8-in-10-americans-take-vacations-300065251.html",
      "doi": ""
    },
    {
      "text": "Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012. I've got 99 problems, but vibration ain't one: a survey of smartphone users' concerns. In Proceedings of the second ACM workshop on Security and privacy in smartphones and mobile devices. ACM, 33--44.",
      "doi": "10.1145/2381934.2381943"
    },
    {
      "text": "Leah Findlater, Joan Zhang, Jon E Froehlich, and Karyn Moffatt. 2017. Differences in crowdsourced vs. lab-based mobile and desktop input performance data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6813--6824.",
      "doi": "10.1145/3025453.3025820"
    },
    {
      "text": "fivethirtyeight.com. 2019. How Popular is Donald Trump? (2019). https://projects.fivethirtyeight.com/trump-approval-ratings/?ex_cid=rrpromo",
      "doi": ""
    },
    {
      "text": "Ronald D Fricker. 2008. Sampling methods for web and e-mail surveys. The SAGE handbook of online research methods (2008), 195--216.",
      "doi": ""
    },
    {
      "text": "Richard Fry. 2013. 2013: Where are the Animal Companions. (2013). https://www.census.gov/programs-surveys/ahs/visualizations/where-are-the-animal-companions-.html",
      "doi": ""
    },
    {
      "text": "Richard Fry. 2017. The share of Americans living without a partner has increased, especially among young adults. (2017). https://www.pewresearch.org/fact-tank/2017/10/11/the-share-of-americans-living-without-apartner-has-increased-especially-among-young-adults/",
      "doi": ""
    },
    {
      "text": "Huiqing Fu, Yulong Yang, Nileema Shingte, Janne Lindqvist, and Marco Gruteser. 2014. A field study of run-time location access disclosures on android smartphones. Proc. USEC 14 (2014).",
      "doi": ""
    },
    {
      "text": "Joseph K Goodman, Cynthia E Cryder, and Amar Cheema. 2013. Data collection in a flat world: The strengths and weaknesses of Mechanical Turk samples. Journal of Behavioral Decision Making 26, 3 (2013), 213--224.",
      "doi": ""
    },
    {
      "text": "Samantha Jaroszewski, Danielle Lottridge, Oliver L Haimson, and Katie Quehl. 2018. Genderfluid or attack helicopter: Responsible HCI research practice with non-binary gender variation in online communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 307.",
      "doi": "10.1145/3173574.3173881"
    },
    {
      "text": "Tendayi Kapfidze. 2018. U.S. Mortgage Market Statistics: 2018. (2018). https://www.magnifymoney.com/ blog/mortgage/u-s-mortgage-market-statistics-2018/",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Dan Morris, Julie A Kientz, and others. 2013. There's no such thing as gaining a pound: Reconsidering the bathroom scale user interface. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 401--410.",
      "doi": "10.1145/2493432.2493456"
    },
    {
      "text": "Dan Kopf. 2019. Old people in the US are watching a lot more TV. (2019). https://qz.com/1563911/who-watches-the-most-tv/",
      "doi": ""
    },
    {
      "text": "Richard N Landers and Tara S Behrend. 2015. An inconvenient truth: Arbitrary distinctions between organizational, Mechanical Turk, and other convenience samples. Industrial and Organizational Psychology 8, 2 (2015), 142--164.",
      "doi": ""
    },
    {
      "text": "Brooke Fisher Liu, Michele M Wood, Michael Egnoto, Hamilton Bean, Jeannette Sutton, Dennis Mileti, and Stephanie Madden. 2017. Is a picture worth a thousand words? The effects of maps and warning messages on how publics respond to disaster information. Public Relations Review 43, 3 (2017), 493--506.",
      "doi": ""
    },
    {
      "text": "Joanne Locascio, Rushil Khurana, Yan He, and Jofish Kaye. 2016. Utilizing employees as usability participants: exploring when and when not to leverage your coworkers. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 4533--4537.",
      "doi": "10.1145/2858036.2858047"
    },
    {
      "text": "Niall McCarthy. 2019. The Rise In U.S. Auto Loan Debt Shows No Signs Of Slowing Down. (2019). https://www.forbes.com/sites/niallmccarthy/2019/01/03/thenumber-of-americans-holding-auto-loan-debt-shows-nosigns-of-slowing-down-infographic/#1b3c33607ffe",
      "doi": ""
    },
    {
      "text": "Hendrik Müller, Aaron Sedley, and Elizabeth Ferrall-Nunge. 2014. Survey Research in HCI. Springer New York, New York, NY, 229--266. DOI: http://dx.doi.org/10.1007/978--1--4939-0378--8_10",
      "doi": ""
    },
    {
      "text": "Nielsen. 2019. Super Bowl LIII Draws 98.2 Million TV Viewers, 32.3 Million Social Media Interactions. (2019). https://www.nielsen.com/us/en/insights/article/2019/super-bowl-liii-draws-98--2-million-tv-viewers-32--3million-social-media-interactions/",
      "doi": ""
    },
    {
      "text": "NPR. 2019. NPR Report: Smart Speakers See 78% Increase YOY. (2019). https://www.npr.org/about-npr/682946406/npr-reportsmart-speakers-see-78-increase-yoy",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on amazon mechanical turk. Judgment and Decision making 5, 5 (2010), 411--419.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin. 2018. One-in-five Americans now listen to audiobooks. (2018). https://www.pewresearch.org/fact-tank/2018/03/08/nearly-onein-five-americans-now-listen-to-audiobooks/",
      "doi": ""
    },
    {
      "text": "Zuzanna Pieniak, Wim Verbeke, Federico Perez-Cueto, Karen Brunsø, and Stefaan De Henauw. 2008. Fish consumption and its motives in households with versus without self-reported medical history of CVD: A consumer survey from five European countries. BMC Public Health 8, 1 (2008), 306.",
      "doi": ""
    },
    {
      "text": "Paulo Rita, Ana Brochado, and Lyublena Dimova. 2019. Millennials' travel motivations and desired activities within destinations: A comparative study of the US and the UK. Current Issues in Tourism 22, 16 (2019), 2034--2050.",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who are the crowdworkers?: shifting demographics in mechanical turk. In CHI'10 extended abstracts on Human factors in computing systems. ACM, 2863--2872.",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Nicolas Roulin. 2015. Don't throw the baby out with the bathwater: Comparing data quality of crowdsourcing, online panels, and student samples. Industrial and Organizational Psychology 8, 2 (2015), 190--196.",
      "doi": ""
    },
    {
      "text": "Neil Stewart, Christoph Ungemach, Adam JL Harris, Daniel M Bartels, Ben R Newell, Gabriele Paolacci, Jesse Chandler, and others. 2015. The average laboratory samples a population of 7,300 Amazon Mechanical Turk workers. Judgment and Decision making 10, 5 (2015), 479--491.",
      "doi": ""
    },
    {
      "text": "Jessica AR Williams and Selena E Ortiz. 2017. Examining public knowledge and preferences for adult preventive services coverage. PloS one 12, 12 (2017), e0189661.",
      "doi": ""
    }
  ]
}