{
  "doi": "10.1145/3313831.3376844",
  "title": "Imagining Data-Objects for Reflective Self-Tracking",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "While self-tracking data is typically captured real-time in a lived experience, the data is often stored in a manner detached from the context where it belongs. Research has shown that there is a potential to enhance people's lived experiences with data-objects (artifacts representing contextually relevant data), for individual and collective reflections through a physical portrayal of data. This paper expands that research by studying how to design contextually relevant data-objects based on people's needs. We conducted a participatory research project with five households using object theater as a core method to encourage participants to speculate upon combinations of meaningful objects and personal data archives. In this paper, we detail three aspects that seem relevant for designing data-objects: social sharing, contextual ambiguity and interaction with the body. We show how an experience-centric view on data-objects can contribute with the contextual, social and bodily interplay between people, data and objects.",
  "authors": [
    {
      "name": "Maria Karyda",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100088946/rel-imgonly/aaltopic.jpg",
      "acmid": "81100088946",
      "orcid": "missing"
    },
    {
      "name": "Merja Ryöppy",
      "institution": "University of Southern Denmark, Kolding, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078378",
      "orcid": "missing"
    },
    {
      "name": "Jacob Buur",
      "institution": "University of Southern Denmark, Kolding, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100496089",
      "orcid": "missing"
    },
    {
      "name": "Andrés Lucero",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81314484387/rel-imgonly/81314484387.jpg",
      "acmid": "81314484387",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 28, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173602",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Rene Baker. 2018. Specialist in puppet and object theatre. (2018). https://renebaker.org/",
      "doi": ""
    },
    {
      "text": "Stephen Barrass. 2012. Digital fabrication of acoustic sonifications. AES: Journal of the Audio Engineering Society 60, 9 (2012), 709--715.",
      "doi": ""
    },
    {
      "text": "Jacob Buur and Preben Friis. 2015. Object Theatre in Design Education. In Nordes 2015.",
      "doi": ""
    },
    {
      "text": "Jacob Buur, Sara Said Mosleh, and Christina Fyhn. 2018. Physicalizations of Big Data in Ethnographic Context. Ethnographic Praxis in Industry Conference Proceedings 2018, 1 (2018), 86--103. DOI: http://dx.doi.org/10.1111/1559--8918.2018.01198",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding Quantified-selfers' Practices in Collecting and Exploring Personal Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1143--1152. DOI: http://dx.doi.org/10.1145/2556288.2557372",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Charles Horton Cooley. 1902. The Looking-Glass Self. (1902), 1--2.",
      "doi": ""
    },
    {
      "text": "Jason Patrick de Leon and Jeffrey H. Cohen. 2005. Object and Walking Probes in Ethnographic Interviewing. Field Methods 17, 2 (2005), 200--204. DOI: http://dx.doi.org/10.1177/1525822X05274733",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting, and David S. Kirk. 2017. Designing Documentary Informatics. (2017), 649--661. DOI: http://dx.doi.org/10.1145/3064663.3064714",
      "doi": "10.1145/3064663.3064714"
    },
    {
      "text": "Chris Elsden, David S. Kirk, and Abigail C. Durrant. 2016. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human-Computer Interaction 31, 6 (2016), 518--557. DOI: http://dx.doi.org/10.1080/07370024.2015.1093422",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "Laurie Frick. 2011. Sleep Patterns. (2011). Retrieved September 9, 2019 from https://vimeo.com/21852158",
      "doi": ""
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated Portfolios. Interactions 19, 4 (July 2012), 40--49. DOI: http://dx.doi.org/10.1145/2212877.2212889",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "William W Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 233--240.",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Choiti Ghosh. 2016. Ordinary Objects in Theater: Breaking Norms | Choiti Ghosh | TEDxMDAE. (2016). https://www.youtube.com/watch?v=FDLAx3dd_LU",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1982. The presentation of Self in Everyday Life. the Presentation of Self in Everyday Life (1982), 1--10.",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3227--3236. DOI: http://dx.doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Maria Karyda. 2017. Crafting Collocated Interactions: Exploring Physical Representations of Personal Data. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, NY, NY, USA, Article 74, 4 pages. DOI: http://dx.doi.org/10.1145/3098279.3119927",
      "doi": "10.1145/3098279.3119927"
    },
    {
      "text": "Ingun Grimstad Klepp and Mari Bjerck. 2014. A methodological approach to the materiality of clothing: Wardrobe studies. International Journal of Social Research Methodology 17, 4 (2014), 373--386. DOI: http://dx.doi.org/10.1080/13645579.2012.737148",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 1987. Science in action: How to follow scientists and engineers through society. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 557--566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding My Data, Myself: Supporting Self-reflection with Ubicomp Technologies. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, NY, NY, USA, 405--414. DOI: http://dx.doi.org/10.1145/2030112.2030166",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Deborah Lupton. 2014. Self-tracking Cultures: Towards a Sociology of Personal Informatics. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, NY, NY, USA, 77--86. DOI: http://dx.doi.org/10.1145/2686612.2686623",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Deborah Lupton. 2016. Personal data practices in the age of lively data. Digital sociologies (2016), 335--50.",
      "doi": ""
    },
    {
      "text": "Eleanor Margolies. 2016. Props. Macmillan International Higher Education.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology As Experience. Interactions 11, 5 (Sept. 2004), 42--43. DOI: http://dx.doi.org/10.1145/1015530.1015549",
      "doi": "10.1145/1015530.1015549"
    },
    {
      "text": "Daniel Miller. 2008. The comfort of things. Polity.",
      "doi": ""
    },
    {
      "text": "Andrew Vande Moere. 2008. Beyond the tyranny of the pixel: Exploring the physicality of information visualization. In 2008 12th International Conference Information Visualisation. IEEE, 469--474.",
      "doi": "10.1109/IV.2008.84"
    },
    {
      "text": "Trine Møller. 2018. Presenting The Accessory Approach: A Start-up's Journey Towards Designing An Engaging Fall Detection Device. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 559, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3174133",
      "doi": "10.1145/3173574.3174133"
    },
    {
      "text": "Richard Mortier, Hamed Haddadi, Tristan Henderson, Derek McAuley, and Jon Crowcroft. 2014. Human-data interaction: The human face of the data-driven society. Available at SSRN 2508051 (2014).",
      "doi": ""
    },
    {
      "text": "Sean Myatt and Daniel Watt. 2012. From Frozen Sponges to Plastic Bags: Object Theatre-A Developing Network. Puppet Notebook 22 (2012), 19--22.",
      "doi": ""
    },
    {
      "text": "Bettina Nissen and John Bowers. 2015. Data-Things: Digital Fabrication Situated Within Participatory Data Translation Activities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2467--2476. DOI: http://dx.doi.org/10.1145/2702123.2702245",
      "doi": "10.1145/2702123.2702245"
    },
    {
      "text": "Susan Naomi Nordstrom. 2013. Object-interviews: Folding, unfolding, and refolding perceptions of objects. International Journal of Qualitative Methods 12, 1 (2013), 237--257.",
      "doi": ""
    },
    {
      "text": "Sarah Pink. 2008. Visual anthropology. (2008).",
      "doi": ""
    },
    {
      "text": "Zachary Pousman, John Stasko, and Michael Mateas. 2007. Casual information visualization: Depictions of data in everyday life. IEEE transactions on visualization and computer graphics 13, 6 (2007), 1145--1152.",
      "doi": ""
    },
    {
      "text": "Alireza Rezaeian and Jared Donovan. 2014. Design of a Tangible Data Visualization. In Proceedings of the 7th International Symposium on Visual Information Communication and Interaction (VINCI '14). ACM, NY, NY, USA, Article 232, 4 pages. DOI: http://dx.doi.org/10.1145/2636240.2636869",
      "doi": "10.1145/2636240.2636869"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal Tracking As Lived Informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1163--1172. DOI: http://dx.doi.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Merja Ryöppy, Sofus Bach Poulsen, Pavels Konstantinovs, and Salu Ylirisku. 2018. Object theatre in field studies. In 5th Participatory Innovation ConferenceParticipatory Innovation Conference. 286--293.",
      "doi": ""
    },
    {
      "text": "Merja Ryöppy, Salu Ylirisku, and Eva Knutz. 2017. Exploring Power with Object Theatre. In 7th Nordic Design Research ConferenceNordic Design Research Conference.",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, William Odom, Lyn Bartram, and Carman Neustaedter. 2017. Time-Turner: Data Engagement Through Everyday Objects in the Home. Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (2017), 72--78. DOI: http://dx.doi.org/10.1145/3064857.3079122",
      "doi": "10.1145/3064857.3079122"
    },
    {
      "text": "R. Sosa, V. Gerrard, A. Esparza, R. Torres, and R. Napper. 2018. Data objects: Design principles for data physicalisation. Proceedings of International Design Conference, DESIGN 4 (2018), 1685--1696. DOI: http://dx.doi.org/10.21278/idc.2018.0125",
      "doi": ""
    },
    {
      "text": "Alex S Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-place: Thinking through the relations between data and community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2863--2872.",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Kaiton Williams. 2015. An anxious alliance. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives. Aarhus University Press, 121--131.",
      "doi": "10.7146/aahcc.v1i1.21146"
    },
    {
      "text": "Gary Wolf. 2010. The data-driven life. The New York Times 28 (2010), 2010.",
      "doi": ""
    },
    {
      "text": "Sophie Woodward. 2016. Object interviews, material imaginings and 'unsettling'methods: interdisciplinary approaches to understanding materials and material culture. Qualitative Research 16, 4 (2016), 359--374.",
      "doi": ""
    },
    {
      "text": "Chang Long Zhu, Harshit Agrawal, and Pattie Maes. 2015. Data-objects: Re-designing everyday objects as tactile affective interfaces. 2015 International Conference on Affective Computing and Intelligent Interaction, ACII 2015 (2015), 322--326. DOI: http://dx.doi.org/10.1109/ACII.2015.7344590",
      "doi": "10.1109/ACII.2015.7344590"
    }
  ]
}