{
  "doi": "10.1145/3313831.3376555",
  "title": "Trust versus Privacy: Using Connected Car Data in Peer-to-Peer Carsharing",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Trust is the lubricant of the sharing economy. This is true especially in peer-to-peer carsharing, in which one leaves a highly valuable good to a stranger in the hope of getting it back unscathed. Nowadays, ratings of other users are major mechanisms for establishing trust. To foster uptake of peer-to-peer carsharing, connected car technology opens new possibilities to support trust-building, e.g., by adding driving behavior statistics to users' profiles. However, collecting such data intrudes into rentees' privacy. To explore the tension between the need for trust and privacy demands, we conducted three focus group and eight individual interviews. Our results show that connected car technologies can increase trust for car owners and rentees not only before but also during and after rentals. The design of such systems must allow a differentiation between information in terms of type, the context, and the negotiability of information disclosure.",
  "tags": [
    "peer-to-peer carsharing",
    "connected car",
    "privacy",
    "trust"
  ],
  "authors": [
    {
      "name": "Paul Bossauer",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659167515",
      "orcid": "missing"
    },
    {
      "name": "Thomas Neifer",
      "institution": "Hochschule Bonn-Rhein-Sieg Sankt Augustin, Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528986",
      "orcid": "missing"
    },
    {
      "name": "Gunnar Stevens",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100661746",
      "orcid": "missing"
    },
    {
      "name": "Christina Pakusch",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659169467",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akerlof, G.A. 1978. The market for \"lemons\": Quality uncertainty and the market mechanism. Uncertainty in Economics. Elsevier. 235--251.",
      "doi": ""
    },
    {
      "text": "Ballús-Armet, I. et al. 2014. Peer-to-peer car sharing: Exploring public perception and market characteristics in the San Francisco Bay area, California. Transportation Research Record. 2416, 1 (2014), 27--36.",
      "doi": ""
    },
    {
      "text": "Belk, R. 2009. Sharing. Journal of consumer rese-arch. 36, 5 (2009), 715--734.",
      "doi": ""
    },
    {
      "text": "Benjaafar, S. et al. 2018. Peer-to-Peer Product Sharing: Implications for Ownership, Usage, and Social Welfare in the Sharing Economy. Management Science. (2018).",
      "doi": ""
    },
    {
      "text": "Bossauer, P. et al. 2019. Using Blockchain in Peer-to-Peer Carsharing to Build Trust in the Sharing Economy. (2019).",
      "doi": ""
    },
    {
      "text": "Botsman, R. and Rogers, R. 2011. What's mine is yours: how collaborative consumption is changing the way we live. (2011).",
      "doi": ""
    },
    {
      "text": "Carutasu, G. et al. 2016. Expanding eCall from cars to other means of transport. Journal of Information Systems & Operations Management. 10, 2 (2016), 354--363.",
      "doi": ""
    },
    {
      "text": "Chen, S.C. and Dhillon, G.S. 2003. Interpreting dimensions of consumer trust in e-commerce. In-formation technology and management. 4, 2--3 (2003), 303--318.",
      "doi": ""
    },
    {
      "text": "Clement, R. et al. 2019. Internet-Ökonomie: Grundlagen und Fallbeispiele der digitalen und vernetzten Wirtschaft. Springer Berlin Heidelberg.",
      "doi": ""
    },
    {
      "text": "Coppola, R. and Morisio, M. 2016. Connected car: technologies, issues, future trends. ACM Computing Surveys (CSUR). 49, 3 (2016), 46.",
      "doi": "10.1145/2971482"
    },
    {
      "text": "Corbitt, B.J. et al. 2003. Trust and e-commerce: a study of consumer perceptions. Electronic commerce research and applications. 2, 3 (2003), 203--215.",
      "doi": ""
    },
    {
      "text": "Derikx, S. et al. 2016. Can privacy concerns for insurance of connected cars be compensated? Electronic Markets. 26, 1 (2016), 73--81.",
      "doi": ""
    },
    {
      "text": "Dinev, T. and Hart, P. 2006. An extended privacy calculus model for e-commerce transactions. Information systems research. 17, 1 (2006), 61--80.",
      "doi": ""
    },
    {
      "text": "Ert, E. et al. 2016. Trust and reputation in the sharing economy: The role of personal photos in Airbnb. Tourism Management. 55, (2016), 62--73.",
      "doi": ""
    },
    {
      "text": "Feeney, M. and companies Uber, R. 2015. Is ride-sharing safe? (2015).",
      "doi": ""
    },
    {
      "text": "Gatersleben, B. 2007. Affective and symbolic aspects of car use. Threats from car traffic to the quality of urban life: Problems, Causes and Solutions. Emerald Group Publishing Limited. 219--233.",
      "doi": ""
    },
    {
      "text": "Haberle, T. et al. 2015. The connected car in the cloud: a platform for prototyping telematics services. IEEE Software. 32, 6 (2015), 11--17.",
      "doi": "10.1109/MS.2015.137"
    },
    {
      "text": "Hawlitschek, F. et al. 2016. Trust in the sharing economy. Die Unternehmung. 70, 1 (2016), 26--44.",
      "doi": ""
    },
    {
      "text": "Hawlitschek, F. et al. 2016. Understanding the Sharing Economy--Drivers and Impediments for Participation in Peer-to-Peer Rental. System Sciences (HICSS), 2016 49th Hawaii International Conference on (2016), 4782--4791.",
      "doi": ""
    },
    {
      "text": "Hsiao, J.C.-Y. et al. 2018. The Role of Demographics, Trust, Computer Self-efficacy, and Ease of Use in the Sharing Economy. Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (2018), 37.",
      "doi": "10.1145/3209811.3209816"
    },
    {
      "text": "Huurne, M. et al. 2017. Antecedents of trust in the sharing economy: A systematic review. Journal of Consumer Behaviour. 16, 6 (2017), 485--498.",
      "doi": ""
    },
    {
      "text": "Jakobi, T. et al. 2019. It Is About What They Could Do with the Data: A User Perspective on Privacy in Smart Metering. ACM Transactions on Computer-Human Interaction (TOCHI). 26, 1 (2019), 2.",
      "doi": "10.1145/3281444"
    },
    {
      "text": "Jakobi, T. et al. 2018. Privacy-By-Design für das Connected Car: Architekturen aus Verbrauchersicht. Datenschutz und Datensicherheit-DuD. 42, 11 (2018), 704--707.",
      "doi": ""
    },
    {
      "text": "Kamal, P. and Chen, J.Q. 2016. Trust in Sharing Economy. PACIS (2016), 109.",
      "doi": ""
    },
    {
      "text": "Kawgan-Kagan, I. 2015. Early adopters of carsharing with and without BEVs with respect to gender preferences. European Transport Research Re-view. 7, 4 (Oct. 2015), 33. DOI:https://doi.org/10.1007/s12544-015-0183--3.",
      "doi": ""
    },
    {
      "text": "Kollock, P. 1999. The production of trust in online markets. Advances in group processes. 16, 1 (1999), 99--123.",
      "doi": ""
    },
    {
      "text": "Lauterbach, D. et al. 2009. Surfing a web of trust: Reputation and reciprocity on couchsurfing. com. 2009 International Conference on Computational Science and Engineering (2009), 346--353.",
      "doi": "10.1109/CSE.2009.345"
    },
    {
      "text": "Lawson, P. et al. 2015. The Connected Car: Who is in the Driver's Seat? A Study on Privacy and On-board Vehicle Telematics Technology. (2015).",
      "doi": ""
    },
    {
      "text": "Lawson, P. et al. 2015. The Connected Car: Who is in the Driver's Seat? A Study on Privacy and On-board Vehicle Telematics Technology. (2015).",
      "doi": ""
    },
    {
      "text": "Li, H. et al. 2016. Examining individuals' adoption of healthcare wearable devices: An empirical study from privacy calculus perspective. International journal of medical informatics. 88, (2016), 8--17.",
      "doi": ""
    },
    {
      "text": "Liu, D. et al. 2015. Friendships in online peer-to-peer lending: Pipes, prisms, and relational herding. (2015).",
      "doi": ""
    },
    {
      "text": "Ma, X. et al. 2017. Self-disclosure and perceived trustworthiness of Airbnb host profiles. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (2017), 2397--2409.",
      "doi": "10.1145/2998181.2998269"
    },
    {
      "text": "Mayring, P. 2004. Qualitative content analysis. A companion to qualitative research. 1, (2004), 159--176.",
      "doi": ""
    },
    {
      "text": "Mayring, P. 2010. Qualitative inhaltsanalyse. Handbuch qualitative Forschung in der Psychologie. Springer. 601--613.",
      "doi": ""
    },
    {
      "text": "McKnight, D.H. and Chervany, N.L. 2001. What trust means in e-commerce customer relationships: An interdisciplinary conceptual typology. International journal of electronic commerce. 6, 2 (2001), 35--59.",
      "doi": ""
    },
    {
      "text": "Mead, G.H. 1934. Mind, self and society. Chicago University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Metcalf, D. et al. 2016. Wearables and the internet of things for health: wearable, interconnected devices promise more efficient and comprehensive health care. IEEE pulse. 7, 5 (2016), 35--39.",
      "doi": ""
    },
    {
      "text": "Meurer, J. et al. 2014. Social dependency and mo-bile autonomy: supporting older adults' mobility with ridesharing ict. Proceedings of the 32nd annual ACM conference on Human factors in computing systems (2014), 1923--1932.",
      "doi": ""
    },
    {
      "text": "Mikusz, M. et al. 2015. Business model patterns for the connected car and the example of data orchestrator. International Conference of Software Business (2015), 167--173.",
      "doi": ""
    },
    {
      "text": "Muermann, A. and Straka, D. 2011. Asymmetric information in automobile insurance: new evidence from telematic data. Working paper, Vienna University of Economics and Business.",
      "doi": ""
    },
    {
      "text": "Olakanmi, O. and Oluwaseun, S. 2018. A Trust Based Secure and Privacy Aware Framework for Efficient Taxi and Car Sharing System. International Journal of Vehicular Telematics and Infotainment Systems (IJVTIS). 2, 1 (2018), 34--47.",
      "doi": ""
    },
    {
      "text": "Owyang, J. et al. 2013. The collaborative economy. Altimeter, United States. (2013).",
      "doi": ""
    },
    {
      "text": "Pakusch, C. et al. 2018. P2P-Carsharing. Motive, -ngste und Barrieren bei der Teilnahmeeine explorative Studie. Internationales Verkehrswesen. 70, 4 (2018).",
      "doi": ""
    },
    {
      "text": "Palen, L. and Dourish, P. 2003. Unpacking privacy for a networked world. Proceedings of the SIGCHI conference on Human factors in computing systems (2003), 129--136.",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Pfitzmann, A. et al. 2000. Mehrseitige Sicherheit in offenen Netzen. Grundlagen, praktische Umset-zung und in Java implementierte Demonstrations-Software. (2000).",
      "doi": ""
    },
    {
      "text": "Pfitzmann, A. 2001. Multilateral security: Enabling technologies and their evaluation. Informatics (2001), 50--62.",
      "doi": ""
    },
    {
      "text": "Qiu, W. et al. 2018. More Stars or More Reviews? Proceedings of the 2018 CHI Conference on Hu-man Factors in Computing Systems (New York, NY, USA, 2018), 153:1--153:11.",
      "doi": "10.1145/3173574.3173727"
    },
    {
      "text": "Rabiee, F. 2004. Focus-group interview and data analysis. Proceedings of the Nutrition Society. 63, 4 (Nov. 2004), 655--660. DOI:https://doi.org/10.1079/PNS2004399.",
      "doi": ""
    },
    {
      "text": "Resnick, P. and Zeckhauser, R. 2002. Trust among strangers in Internet transactions: Empirical analysis of eBay's reputation system. The Economics of the Internet and E-commerce. Emerald Group Publishing Limited. 127--157.",
      "doi": ""
    },
    {
      "text": "Salam, A.F. et al. 2005. Trust in e-commerce. Communications of the ACM. 48, 2 (2005), 72--77.",
      "doi": "10.1145/1042091.1042093"
    },
    {
      "text": "Schreier, H. et al. 2017. Endbericht Evaluation CarSharing (EVA-CS). (2017).",
      "doi": ""
    },
    {
      "text": "Share Economy in Deutschland wächst weiter: https://www.pwc.de/de/pressemitteilungen/2018/share-economy-in-deutschland-waechst-weiter.html. Accessed: 2018-09--12.",
      "doi": ""
    },
    {
      "text": "Smithson, J. 2000. Using and analysing focus groups: Limitations and possibilities. International Journal of Social Research Methodology. 3, 2 (Jan. 2000), 103--119. DOI:https://doi.org/10.1080/136455700405172.",
      "doi": ""
    },
    {
      "text": "Solove, D. 2008. Understanding privacy. (2008).",
      "doi": ""
    },
    {
      "text": "Spremann, K. 1987. Agent and principal. Agency theory, information, and incentives. Springer. 3--37.",
      "doi": ""
    },
    {
      "text": "Stevens, G. et al. 2014. Mehrseitige, barrierefreie Sicherheit intelligenter Messsysteme. Datenschutz und Datensicherheit-DuD. 38, 8 (2014), 536--544.",
      "doi": ""
    },
    {
      "text": "Stevens, G. et al. 2018. Mehrseitiges Vertrauen bei IoT-basierten Reputationssystemen. Mensch und Computer 2018-Workshopband. (2018).",
      "doi": ""
    },
    {
      "text": "Stevens, G. et al. 2017. Second Dashboard: Information Demands in a Connected Car. Mensch und Computer 2017-Tagungsband. (2017).",
      "doi": ""
    },
    {
      "text": "Stevens, G. and Bossauer, P. 2017. Dealing with Personal Data in the Age of Big Data Economies. Zeitschrift fuer Geistiges Eigentum/Intellectual Property Journal. 9, 3 (2017), 266--278.",
      "doi": ""
    },
    {
      "text": "Stevens, G. and Pipek, V. 2018. Making use: understanding, studying, and supporting appropriation. Socio-Informatics: A Practice-Based Perspective on the Design and Use of IT-Artefacts. Oxford University Press. 139--178.",
      "doi": ""
    },
    {
      "text": "Stevens, G. and Wulf, V. 2002. A new dimension in access control: Studying maintenance engineering across organizational boundaries. Proceedings of the 2002 ACM conference on Computer supported cooperative work (2002), 196--205.",
      "doi": ""
    },
    {
      "text": "Stevens, G. and Wulf, V. 2009. Computer-supported access control. ACM Transactions on Computer-Human Interaction (TOCHI). 16, 3 (2009), 12.",
      "doi": "10.1145/1592440.1592441"
    },
    {
      "text": "Swan, M. 2015. Connected car: quantified self becomes quantified car. Journal of Sensor and Actuator Networks. 4, 1 (2015), 2--29.",
      "doi": ""
    },
    {
      "text": "Tashakkori, A. and Teddlie, C. 2010. Sage hand-book of mixed methods in social & behavioral re-search.",
      "doi": ""
    },
    {
      "text": "Teigland, R. et al. 2019. The Importance of Trust in a Digital Europe: Reflections on the Sharing Economy and Blockchains. Trust in the European Union in Challenging Times. Springer. 181--209.",
      "doi": ""
    },
    {
      "text": "Teubner, T. 2014. Thoughts on the sharing economy. Proceedings of the International Conference on e-Commerce (2014), 322--326.",
      "doi": ""
    },
    {
      "text": "Teubner, T. and Flath, C.M. 2016. Privacy in the sharing economy. Working Paper.",
      "doi": ""
    },
    {
      "text": "Thomas, L. et al. 1995. Comparison of focus group and individual interview methodology in examining patient satisfaction with nursing care. Social Sciences in Health. 1, 4 (1995), 206--220.",
      "doi": ""
    },
    {
      "text": "Truong, N.B. et al. 2016. A reputation and knowledge based trust service platform for trustworthy social internet of things. Innovations in Clouds, Internet and Networks (ICIN), Paris, France. (2016).",
      "doi": ""
    },
    {
      "text": "Tsai, J.Y. et al. 2011. The Effect of Online Privacy Information on Purchasing Behavior: An Experimental Study. Information Systems Research. 22, 2 (Jun. 2011), 254--268.",
      "doi": "10.1287/isre.1090.0260"
    },
    {
      "text": "Walter, J. et al. 2017. PRICON: self-determined privacy in the connected car motivated by the privacy calculus model. Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia (2017), 421--427.",
      "doi": "10.1145/3152832.3156627"
    },
    {
      "text": "Waterman, R.W. and Meier, K.J. 1998. Principal-agent models: an expansion? Journal of public administration research and theory. 8, 2 (1998), 173--202.",
      "doi": ""
    },
    {
      "text": "Weidner, W. et al. 2017. Telematic driving profile classification in car insurance pricing. Annals of Actuarial Science. 11, 2 (2017), 213--236.",
      "doi": ""
    },
    {
      "text": "Wiegard, R.-B. and Breitner, M.H. 2017. Smart services in healthcare: A risk-benefit-analysis of pay-as-you-live services from customer perspective in Germany. Electronic Markets. (2017), 1--17.",
      "doi": ""
    },
    {
      "text": "Xu, H. et al. 2009. The role of push-pull technology in privacy calculus: the case of location-based services. Journal of Management Information Systems. 26, 3 (2009), 135--174.",
      "doi": "10.2753/MIS0742-1222260305"
    },
    {
      "text": "Yoon, D. et al. 2008. Future automotive insurance system based on telematics technology. Advanced Communication Technology, 2008. ICACT 2008. 10th International Conference on (2008), 679--681.",
      "doi": ""
    },
    {
      "text": "Zervas, G. et al. 2017. The rise of the sharing economy: Estimating the impact of Airbnb on the hotel industry. Journal of Marketing Research. 54, 5 (2017), 687--705.",
      "doi": ""
    }
  ]
}