{
  "doi": "10.1145/3313831.3376333",
  "title": "PneuSleeve: In-fabric Multimodal Actuation and Sensing in a Soft, Compact, and Expressive Haptic Sleeve",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Integration of soft haptic devices into garments can improve their usability and wearability for daily computing interactions. In this paper, we introduce PneuSleeve, a fabric-based, compact, and highly expressive forearm sleeve which can render a broad range of haptic stimuli including compression, skin stretch, and vibration. The haptic stimuli are generated by controlling pneumatic pressure inside embroidered stretchable tubes. The actuation configuration includes two compression actuators on the proximal and distal forearm, and four uniformly distributed linear actuators around and tangent to the forearm. Further, to ensure a suitable grip force, two soft mutual capacitance sensors are fabricated and integrated into the compression actuators, and a closed-loop force controller is implemented. We physically characterize the static and dynamic behavior of the actuators, as well as the performance of closed-loop control. We quantitatively evaluate the psychophysical characteristics of the six actuators in a set of user studies. Finally, we show the expressiveness of PneuSleeve by evaluating combined haptic stimuli using subjective assessments.",
  "authors": [
    {
      "name": "Mengjia Zhu",
      "institution": "Facebook Reality Labs & University of California, Santa Barbara, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529452",
      "orcid": "missing"
    },
    {
      "name": "Amirhossein H. Memar",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659487872",
      "orcid": "missing"
    },
    {
      "name": "Aakar Gupta",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548039279",
      "orcid": "0000-0001-6435-3583"
    },
    {
      "name": "Majed Samad",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366531",
      "orcid": "missing"
    },
    {
      "name": "Priyanshu Agarwal",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659827860",
      "orcid": "missing"
    },
    {
      "name": "Yon Visell",
      "institution": "University of California, Santa Barbara, Santa Barbara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100340614",
      "orcid": "missing"
    },
    {
      "name": "Sean J. Keller",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659049710",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Colonnese",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658710526",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nathaniel Agharese, Tyler Cloyd, Laura H Blumenschein, Michael Raitor, Elliot W Hawkes, Heather Culbertson, and Allison M Okamura. 2018. HapWRAP: Soft growing wearable haptic device. In 2018 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 1--5.",
      "doi": "10.1109/ICRA.2018.8460891"
    },
    {
      "text": "Faisal Arafsha, Kazi Masudul Alam, and Abdulmotaleb El Saddik. 2012. EmoJacket: Consumer centric wearable affective jacket to enhance emotional immersion. In 2012 international conference on innovations in information technology (IIT). IEEE, 350--355.",
      "doi": ""
    },
    {
      "text": "Karlin Bark, Jason Wheeler, Gayle Lee, Joan Savall, and Mark Cutkosky. 2009. A wearable skin stretch device for haptic feedback. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 464--469.",
      "doi": "10.1109/WHC.2009.4810850"
    },
    {
      "text": "Alexandra Delazio, Ken Nakagaki, Roberta L Klatzky, Scott E Hudson, Jill Fain Lehman, and Alanson P Sample. 2018. Force jacket: Pneumatically-actuated jacket for embodied haptic experiences. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 320.",
      "doi": "10.1145/3173574.3173894"
    },
    {
      "text": "Esther W Foo, J Walter Lee, Crystal Compton, Simon Ozbek, and Brad Holschuh. 2019. User experiences of garment-based dynamic compression for novel haptic applications. In Proceedings of the 23rd International Symposium on Wearable Computers. ACM, 54--59.",
      "doi": "10.1145/3341163.3347732"
    },
    {
      "text": "MM Gavrilovi´ c and MR Mari´ c. 1969. Positional servo-mechanism activated by artificial muscles. Medical and Biological Engineering 7, 1 (1969), 77--82.",
      "doi": ""
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 109--117.",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 488.",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "Elliot W Hawkes, David L Christensen, and Allison M Okamura. 2016. Design and implementation of a 300% strain soft artificial muscle. In 2016 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 4022--4029.",
      "doi": "10.1109/ICRA.2016.7487592"
    },
    {
      "text": "Ronan Hinchet, Velko Vechev, Herbert Shea, and Otmar Hilliges. 2018. DextrES: Wearable Haptic Feedback for Grasping in VR via a Thin Form-Factor Electrostatic Brake. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 901--912.",
      "doi": "10.1145/3242587.3242657"
    },
    {
      "text": "Da-Yuan Huang, Ruizhen Guo, Jun Gong, Jingxian Wang, John Graham, De-Nian Yang, and Xing-Dong Yang. 2017. RetroShape: Leveraging rear-surface shape displays for 2.5 D interaction on smartwatches. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 539--551.",
      "doi": "10.1145/3126594.3126610"
    },
    {
      "text": "Alexandra Ion, Edward Jay Wang, and Patrick Baudisch. 2015. Skin drag displays: Dragging a physical tactor across the user's skin produces a stronger tactile stimulus than vibrotactile. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2501--2504.",
      "doi": "10.1145/2702123.2702459"
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011. Tactile brush: drawing on skin with a tactile grid display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2019--2028.",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel Effects: Enriching Storytelling with Haptic Feedback. ACM Trans. Appl. Percept. 11, 3 (Sept. 2014). DOI: http://dx.doi.org/10.1145/2641570",
      "doi": "10.1145/2641570"
    },
    {
      "text": "Claudio Pacchierotti, Stephen Sinclair, Massimiliano Solazzi, Antonio Frisoli, Vincent Hayward, and Domenico Prattichizzo. 2017. Wearable haptic systems for the fingertip and the hand: taxonomy, review, and perspectives. IEEE transactions on haptics 10, 4 (2017), 580--600.",
      "doi": "10.1109/TOH.2017.2689006"
    },
    {
      "text": "Roshan Lalitha Peiris, Yuan-Ling Feng, Liwei Chan, and Kouta Minamizawa. 2019. ThermalBracelet: Exploring Thermal Haptic Feedback Around the Wrist. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 170.",
      "doi": "10.1145/3290605.3300400"
    },
    {
      "text": "Evan Pezent, Ali Israr, Majed Samad, Shea Robinson, Priyanshu Agarwal, Hrvoje Benko, and Nick Colonnese. 2019. Tasbi: Multisensory squeeze and vibrotactile wrist haptics for augmented and virtual reality. In 2019 IEEE World Haptics Conference (WHC). IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Peter Brandes, Hung Ngo Quang, and Michael Rohs. 2017. Squeezeback: pneumatic compression for notifications. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5318--5330.",
      "doi": "10.1145/3025453.3025526"
    },
    {
      "text": "Panagiotis Polygerinos, Zheng Wang, Kevin C Galloway, Robert J Wood, and Conor J Walsh. 2015. Soft robotic glove for combined assistance and at-home rehabilitation. Robotics and Autonomous Systems 73 (2015), 135--143.",
      "doi": "10.1016/j.robot.2014.08.014"
    },
    {
      "text": "Domenico Prattichizzo, Francesco Chinello, Claudio Pacchierotti, and Monica Malvezzi. 2013. Towards wearability in fingertip haptics: a 3-dof wearable device for cutaneous force feedback. IEEE Transactions on Haptics 6, 4 (2013), 506--516.",
      "doi": "10.1109/TOH.2013.53"
    },
    {
      "text": "Michael Raitor, Julie M Walker, Allison M Okamura, and Heather Culbertson. 2017. WRAP: Wearable, restricted-aperture pneumatics for haptic guidance. In 2017 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 427--432.",
      "doi": "10.1109/ICRA.2017.7989055"
    },
    {
      "text": "Samuel B Schorr and Allison M Okamura. 2017. Fingertip tactile devices for virtual object manipulation and exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3115--3119.",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "HF Schulte Jr. 1961. The characteristics of the McKibben artificial muscle (1961) The Application of external power in prosthetics and orthotics. National Academy of Sciences-National Research Council, Washington DC, Appendix H (1961), 94--115.",
      "doi": ""
    },
    {
      "text": "Youngbo Aram Shim, Jaeyeon Lee, and Geehyuk Lee. 2018. Exploring Multimodal Watch-back Tactile Display using Wind and Vibration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 132.",
      "doi": "10.1145/3173574.3173706"
    },
    {
      "text": "Evan Strasnick, Jessica R Cauchard, and James A Landay. 2017. Brushtouch: Exploring an alternative tactile method for wearable haptics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3120--3125.",
      "doi": "10.1145/3025453.3025759"
    },
    {
      "text": "Nobuhiro Takahashi, Hayato Takahashi, and Hideki Koike. 2019. Soft Exoskeleton Glove Enabling Force Feedback for Human-Like Finger Posture Control with 20 Degrees of Freedom. In 2019 IEEE World Haptics Conference (WHC). IEEE, 217--222.",
      "doi": ""
    },
    {
      "text": "Fei Tang, Ryan P McMahan, and Tandra T Allen. 2014. Development of a low-cost tactile sleeve for autism intervention. In 2014 IEEE International Symposium on Haptic, Audio and Visual Environments and Games (HAVE) Proceedings. IEEE, 35--40.",
      "doi": ""
    },
    {
      "text": "Michael Wehner, Michael T Tolley, Yi?it Mengüç, Yong-Lae Park, Annan Mozeika, Ye Ding, Cagdas Onal, Robert F Shepherd, George M Whitesides, and Robert J Wood. 2014. Pneumatic energy sources for autonomous and wearable soft robotics. Soft robotics 1, 4 (2014), 263--274.",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic revolver: Touch, shear, texture, and shape rendering on a reconfigurable virtual reality controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 86.",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "Weicheng Wu and Heather Culbertson. 2019. Wearable Haptic Pneumatic Device for Creating the Illusion of Lateral Motion on the Arm. In 2019 IEEE World Haptics Conference (WHC). IEEE, 193--198.",
      "doi": ""
    },
    {
      "text": "Eric M Young, Amirhossein H Memar, Priyanshu Agarwal, and Nick Colonnese. 2019. Bellowband: A Pneumatic Wristband for Delivering Local Pressure and Vibration. In 2019 IEEE World Haptics Conference (WHC). IEEE, 55--60.",
      "doi": ""
    },
    {
      "text": "Mengjia Zhu, Thanh Nho Do, Elliot Hawkes, and Yon Visell. 2020. Fluidic fabric muscle sheets for wearable and soft robotics. Soft Robotics (2020).",
      "doi": ""
    },
    {
      "text": "Bengang Zhuo, Sujie Chen, Mingmin Zhao, and Xiaojun Guo. 2017. High sensitivity flexible capacitive pressure sensor using polydimethylsiloxane elastomer dielectric layer micro-structured by 3-D printed mold. IEEE Journal of the Electron Devices Society 5, 3 (2017), 219--223.",
      "doi": ""
    }
  ]
}