{
  "doi": "10.1145/3313831.3376757",
  "title": "Evaluating a Personalizable, Inconspicuous Vibrotactile(PIV) Breathing Pacer for In-the-Moment Affect Regulation",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Given the prevalence and adverse impact of anxiety, there is considerable interest in using technology to regulate anxiety. Evaluating the efficacy of such technology in terms of both the average effect (the intervention efficacy) and the heterogeneous effect (for whom and in what context the intervention was effective) is of paramount importance. In this paper, we demonstrate the efficacy of PIV, a personalized breathing pacer, in reducing anxiety in the presence of a cognitive stressor. We also quantify the relation between our specific stressor and PIV-user engagement. To our knowledge, this is the first mixed-design study of a vibrotactile affect regulation technology which accounts for a specific stressor and for individual differences in relation to the technology's efficacy. Guidelines in this paper can be applied for designing and evaluating other affect regulation technologies.",
  "authors": [
    {
      "name": "Pardis Miri",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81440623305/rel-imgonly/pardis.miri.jpg",
      "acmid": "81440623305",
      "orcid": "missing"
    },
    {
      "name": "Emily Jusuf",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528810",
      "orcid": "missing"
    },
    {
      "name": "Andero Uusberg",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159982",
      "orcid": "missing"
    },
    {
      "name": "Horia Margarit",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528393",
      "orcid": "missing"
    },
    {
      "name": "Robert Flory",
      "institution": "Intel, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162654",
      "orcid": "missing"
    },
    {
      "name": "Katherine Isbister",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-99659489823/rel-imgonly/ella-square.jpg",
      "acmid": "99659489823",
      "orcid": "missing"
    },
    {
      "name": "Keith Marzullo",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260867",
      "orcid": "missing"
    },
    {
      "name": "James J. Gross",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547035856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Touchpoint. https://thetouchpointsolution.com. Accessed 8/31/2019.",
      "doi": ""
    },
    {
      "text": "2018. Lief Patch. https://www.youtube.com/watch?v=aclzen-GGTE. Accessed 8/31/2019.",
      "doi": ""
    },
    {
      "text": "2018. Lief Therapeutics. https://getlief.com. Accessed 8/31/2019.",
      "doi": ""
    },
    {
      "text": "2018. Spire Stone. https://spire.io/pages/stone. Accessed 8/31/2019.",
      "doi": ""
    },
    {
      "text": "2018. Vitali Sports Bra. https://vitaliwear.com. Accessed 8/31/2019.",
      "doi": ""
    },
    {
      "text": "Chris Allen and David MA Mehler. 2019. Open Science challenges, benefits and tips in early career and beyond. PLoS biology 17, 5 (2019), e3000246.",
      "doi": ""
    },
    {
      "text": "Ruben T Azevedo, Nell Bennett, Andreas Bilicki, Jack Hooper, Fotini Markopoulou, and Manos Tsakiris. 2017. The calming effect of a new wearable device during the anticipation of public speech. Scientific Reports 7 (2017). DOI: http://dx.doi.org/10.1038/s41598-017-02274--2",
      "doi": ""
    },
    {
      "text": "Edward M Bowden and Mark Jung-Beeman. 2003. Normative data for 144 compound remote associate problems. Behavior Research Methods, Instruments, & Computers 35, 4 (2003), 634--639.",
      "doi": ""
    },
    {
      "text": "breathe App. https://support.apple.com/en-us/HT206999. Accessed 6/7/2019.",
      "doi": ""
    },
    {
      "text": "Charles S Carver and Michael F Scheier. 1982. Control theory: A useful conceptual framework for personality--social, clinical, and health psychology. Psychological bulletin 92, 1 (1982), 111. 12All code, anonymized datasets, and learning model discussed in this paper is available on github https://github.com/paris007/PIV_plus_plus.",
      "doi": ""
    },
    {
      "text": "Dianne L Chambless, G Craig Caputo, Priscilla Bright, and Richard Gallagher. 1984. Assessment of fear of fear in agoraphobics: the body sensations questionnaire and the agoraphobic cognitions questionnaire. Journal of consulting and clinical psychology 52, 6 (1984), 1090.",
      "doi": ""
    },
    {
      "text": "Jean Costa, Alexander T Adams, Malte F Jung, François Guimbetiere, and Tanzeem Choudhury. 2016. EmotionCheck: leveraging bodily signals and false feedback to regulate our emotions. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 758--769. DOI: http://dx.doi.org/10.1145/2971648.2971752",
      "doi": "10.1145/2971648.2971752"
    },
    {
      "text": "Jean Costa, François Guimbretière, Malte F Jung, and Tanzeem Choudhury. 2019. BoostMeUp: Improving Cognitive Performance in the Moment by Unobtrusively Regulating Emotions with a Smartwatch. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 2 (2019), 40.",
      "doi": "10.1145/3328911"
    },
    {
      "text": "Steven Dragutinovich. 1987. Australian factorial confirmation of Vando's Reducer-Augmenter Scale. Personality and individual differences 8, 4 (1987), 489--497.",
      "doi": ""
    },
    {
      "text": "Asma Ghandeharioun and Rosalind Picard. 2017. BrightBeat: effortlessly influencing breathing for cultivating calmness and focus. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1624--1631.",
      "doi": "10.1145/3027063.3053164"
    },
    {
      "text": "Kim L Gratz and Lizabeth Roemer. 2004. Multidimensional assessment of emotion regulation and dysregulation: Development, factor structure, and initial validation of the difficulties in emotion regulation scale. Journal of psychopathology and behavioral assessment 26, 1 (2004), 41--54.",
      "doi": ""
    },
    {
      "text": "James J Gross. 2002. Emotion regulation: Affective, cognitive, and social consequences. Psychophysiology 39, 3 (2002), 281--291.",
      "doi": ""
    },
    {
      "text": "James J Gross. 2015. The extended process model of emotion regulation: Elaborations, applications, and future directions. Psychological Inquiry 26, 1 (2015), 130--137.",
      "doi": ""
    },
    {
      "text": "James J Gross and Oliver P John. 2003. Individual differences in two emotion regulation processes: implications for affect, relationships, and well-being. Journal of personality and social psychology 85, 2 (2003), 348.",
      "doi": ""
    },
    {
      "text": "Oliver P John, Sanjay Srivastava, and others. 1999. The Big Five trait taxonomy: History, measurement, and theoretical perspectives. Handbook of personality: Theory and research 2, 1999 (1999), 102--138.",
      "doi": ""
    },
    {
      "text": "Peter Kuppens, Francis Tuerlinckx, James A Russell, and Lisa Feldman Barrett. 2013. The relation between valence and arousal in subjective experience. Psychological Bulletin 139, 4 (2013), 917.",
      "doi": ""
    },
    {
      "text": "Scott M Lundberg, Gabriel G Erion, and Su-In Lee. 2018. Consistent individualized feature attribution for tree ensembles. arXiv preprint arXiv:1802.03888 (2018).",
      "doi": ""
    },
    {
      "text": "Theresa M Marteau and Hilary Bekker. 1992. The development of a six-item short-form of the state scale of the Spielberger State-Trait Anxiety Inventory (STAI). British Journal of Clinical Psychology 31, 3 (1992), 301--306.",
      "doi": ""
    },
    {
      "text": "Erin C McKiernan, PE Bourne, CT Brown, S Buck, A Kenall, J Lin, D McDougall, BA Nosek, K Ram, CK Soderberg, and others. 2016. How open science helps researchers succeed, ELife 5. 16800 (2016). DOI: http://dx.doi.org//10.7554/elife",
      "doi": ""
    },
    {
      "text": "Pardis Miri, Robert Flory, Andero Uusberg, Heather Culbertson, Richard Harvey, Agata Keman, Erik Peper, and Keith Gross, J. James Marzullo. 2019. PIV: Placement, pattern, and personalization of an inconspicuous vibrotactile breathing pacer. (2019). DOI: http://dx.doi.org//10.1145/3365107",
      "doi": ""
    },
    {
      "text": "Pardis Miri, Andero Uusberg, Heather Culbertson, Robert Flory, Helen Uusberg, James J. Gross, Keith Marzullo, and Katherine Isbister. 2018. Emotion Regulation in the Wild: Introducing WEHAB System Architecture. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW021. DOI: http://dx.doi.org/10.1145/3170427.3188495",
      "doi": "10.1145/3170427.3188495"
    },
    {
      "text": "Miri Pardis, Gross James J., Marzullo Keith, Uusberg Andero, and Jusuf Emily. 2019a. Pre-registered Hypothesis. (2019). https://osf.io/epn3h.",
      "doi": ""
    },
    {
      "text": "Miri Pardis, Gross James J., Marzullo Keith, Uusberg Andero, and Jusuf Emily. 2019b. Supplemental Material. (2019). https://osf.io/rbk2h/.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson Robert Flory Helen Uusberg James J. Gross Keith Marzullo Katherine Isbister Pardis Miri, Andero Uusberg. 2018. Emotion Regulation in the Wild: The WEHAB Approach. Technical Report. University of California, Santa Cruz. https://www.soe.ucsc.edu/sites/default/files/technicalreports/UCSC-SOE-18-04.pdf.",
      "doi": ""
    },
    {
      "text": "Pablo E Paredes, Yijun Zhou, Nur Al-Huda Hamdan, Stephanie Balters, Elizabeth Murnane, Wendy Ju, and James A Landay. 2018. Just breathe: In-car interventions for guided slow breathing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (2018), 28. DOI: http://dx.doi.org/10.1145/3191760",
      "doi": "10.1145/3191760"
    },
    {
      "text": "Steven Reiss, Rolf A Peterson, David M Gursky, and Richard J McNally. 1986. Anxiety sensitivity, anxiety frequency and the prediction of fearfulness. Behaviour research and therapy 24, 1 (1986), 1--8.",
      "doi": ""
    },
    {
      "text": "Lloyd S Shapley. 1953. A value for n-person games. Contributions to the Theory of Games 2, 28 (1953), 307--317.",
      "doi": ""
    },
    {
      "text": "Gal Sheppes, Gaurav Suri, and James J Gross. 2015. Emotion regulation and psychopathology. Annual review of clinical psychology 11 (2015), 379--405. DOI: http://dx.doi.org/10.1146/annurev-clinpsy-032814--112739",
      "doi": ""
    },
    {
      "text": "Eric N Smith, Erik Santoro, Neema Moraveji, Michael Susi, and Alia J Crum. 2019. Integrating wearables in stress management interventions: Promising evidence from a randomized trial. International Journal of Stress Management (2019). DOI: http://dx.doi.org/10.1037/t02889-000",
      "doi": ""
    },
    {
      "text": "Alan Vando. 1974. The development of the RA scale: A paper-and-pencil measure of pain tolerance. Personality and Social Psychology Bulletin (1974). DOI: http://dx.doi.org/10.1177/014616727400100110",
      "doi": ""
    }
  ]
}