{
  "doi": "10.1145/3313831.3376304",
  "title": "Wearable Microphone Jamming",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We engineered a wearable microphone jammer that is capable of disabling microphones in its user's surroundings, including hidden microphones. Our device is based on a recent exploit that leverages the fact that when exposed to ultrasonic noise, commodity microphones will leak the noise into the audible range. Unfortunately, ultrasonic jammers are built from multiple transducers and therefore exhibit blind spots, i.e., locations in which transducers destructively interfere and where a microphone cannot be jammed. To solve this, our device exploits a synergy between ultrasonic jamming and the naturally occur- ring movements that users induce on their wearable devices (e.g., bracelets) as they gesture or walk. We demonstrate that these movements can blur jamming blind spots and increase jamming coverage. Moreover, current jammers are also directional, requiring users to point the jammer to a microphone; instead, our wearable bracelet is built in a ring-layout that al- lows it to jam in multiple directions. This is beneficial in that it allows our jammer to protect against microphones hidden out of sight. We evaluated our jammer in a series of experiments and found that: (1) it jams in all directions, e.g., our device jams over 87% of the words uttered around it in any direction, while existing devices jam only 30% when not pointed directly at the microphone; (2) it exhibits significantly less blind spots; and, (3) our device induced a feeling of privacy to participants of our user study. We believe our wearable provides stronger privacy in a world in which most devices are constantly eavesdropping on our conversations.",
  "authors": [
    {
      "name": "Yuxin Chen",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528260",
      "orcid": "missing"
    },
    {
      "name": "Huiying Li",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659478611",
      "orcid": "missing"
    },
    {
      "name": "Shan-Yuan Teng",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659090106",
      "orcid": "missing"
    },
    {
      "name": "Steven Nagels",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261037",
      "orcid": "missing"
    },
    {
      "name": "Zhijing Li",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529404",
      "orcid": "missing"
    },
    {
      "name": "Pedro Lopes",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/do/10.1145/contrib-81557182156/rel-imgonly/_pedrolopes_uchicago.jpg",
      "acmid": "81557182156",
      "orcid": "0000-0001-6527-7084"
    },
    {
      "name": "Ben Y. Zhao",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700527",
      "orcid": "missing"
    },
    {
      "name": "Haitao Zheng",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452605074",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Muhammad Taher Abuelma'atti. 2003. Analysis of the effect of radio frequency interference on the DC performance of bipolar operational amplifiers. IEEE Transactions on Electromagnetic compatibility 45, 2 (2003), 453--458.",
      "doi": ""
    },
    {
      "text": "Rawan Alharbi, Tammy Stump, Nilofar Vafaie, Angela Pfammatter, Bonnie Spring, and Nabil Alshurafa. 2018. I Can'T Be Myself: Effects of Wearable Cameras on the Capture of Authentic Behavior in the Wild. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 90 (Sept. 2018), 40 pages. DOI: http://dx.doi.org/10.1145/3264900",
      "doi": "10.1145/3264900"
    },
    {
      "text": "Leonardo Angelini, Maurizio Caon, Stefano Carrino, Luc Bergeron, Nathalie Nyffeler, Mélanie Jean-Mairet, and Elena Mugellini. 2013. Designing a Desirable Smart Bracelet for Older Adults. In Proceedings of ACM Conference on Pervasive and Ubiquitous Computing Adjunct. 425--434.",
      "doi": "10.1145/2494091.2495974"
    },
    {
      "text": "Xavier Anguera, Chuck Wooters, and Javier Hernando. 2007. Acoustic beamforming for speaker diarization of meetings. IEEE Transactions on Audio, Speech, and Language Processing 15, 7 (2007), 2011--2022.",
      "doi": "10.1109/TASL.2007.902460"
    },
    {
      "text": "Daniel Arp, Erwin Quiring, Christian Wressnegger, and Konrad Rieck. 2017. Privacy threats through ultrasonic side channels on mobile devices. In Proc. of EuroS&P.",
      "doi": ""
    },
    {
      "text": "Dmitri Asonov and Rakesh Agrawal. 2004. Keyboard acoustic emanations. In IEEE Symposium on Security and Privacy, 2004. Proceedings. 2004. IEEE, 3--11.",
      "doi": ""
    },
    {
      "text": "Md Tanvir Islam Aumi, Sidhant Gupta, Mayank Goel, Eric Larson, and Shwetak Patel. 2013. DopLink: Using the Doppler Effect for Multi-device Interaction. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp).",
      "doi": ""
    },
    {
      "text": "Kazuki Awaki, Chun-Hao Liao, Makoto Suzuki, and Hiroyuki Morikawa. 2016. Speaker-less Sound-based 3D Localization with Centimeter-level Accuracy. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp).",
      "doi": "10.1145/2968219.2971365"
    },
    {
      "text": "Michael Backes, Markus Dürmuth, Sebastian Gerling, Manfred Pinkal, and Caroline Sporleder. 2010. Acoustic Side-Channel Attacks on Printers.. In USENIX Security symposium. 307--322.",
      "doi": "10.5555/1929820.1929847"
    },
    {
      "text": "Dom Barnard. 2018. Average Speaking Rate and Words per Minute. VIRTUALSPEECH. (January 2018). https://virtualspeech.com/blog/average-speaking-ratewords-per-minute.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti and Abigail Sellen. 1993. Design for Privacy in Ubiquitous Computing Environments. In Proceedings of the Third Conference on European Conference on Computer-Supported Cooperative Work (ECSCW'93). Kluwer Academic Publishers, Norwell, MA, USA, 77--92. http://dl.acm.org/citation.cfm?id=1241934.1241940",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Joseph A. Boales, Farrukh Mateen, and Pritiraj Mohanty. 2017. Micromechanical microphone using sideband modulation of nonlinear resonators. Applied Physics Letters 111, 9 (2017), 093504.",
      "doi": ""
    },
    {
      "text": "Matthew Brocker and Stephen Checkoway. 2014. iSeeYou: Disabling the MacBook Webcam Indicator LED. In Proceedings of the 23rd USENIX Conference on Security Symposium (SEC'14). USENIX Association, Berkeley, CA, USA, 337--352. http://dl.acm.org/citation.cfm?id=2671225.2671247",
      "doi": ""
    },
    {
      "text": "Ke-Yu Chen, Daniel Ashbrook, Mayank Goel, Sung-Hyuck Lee, and Shwetak Patel. 2014. AirLink: Sharing Files Between Multiple Devices Using In-air Gestures. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp).",
      "doi": "10.1145/2632048.2632090"
    },
    {
      "text": "H. Chung, M. Iorga, J. Voas, and S. Lee. 2017. Alexa, Can I Trust You? Computer 50, 9 (2017), 100--104.",
      "doi": "10.1109/MC.2017.3571053"
    },
    {
      "text": "Hyunji Chung and Sangjin Lee. 2018. Intelligent Virtual Assistant knows Your Life. CoRR abs/1803.00466 (2018).",
      "doi": ""
    },
    {
      "text": "Gregg D Colton. 1997. High-Tech Approaches to Breeching Examination Security. Espionage 101. (1997).",
      "doi": ""
    },
    {
      "text": "LibriSpeech Dataset. 2017. http://www.openslr.org/12. (2017).",
      "doi": ""
    },
    {
      "text": "Luigi De Russis, Dario Bonino, and Fulvio Corno. 2013. The Smart Home Controller on Your Wrist. In Proceedings of ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (UbiComp). 8.",
      "doi": "10.1145/2494091.2497319"
    },
    {
      "text": "Silent Ultrasonic Microphone Defeater. 2019. https://www.uspystore.com/silent-ultrasonicmicrophone-defeater. (2019).",
      "doi": ""
    },
    {
      "text": "Hidden Microphone dictaphone Bug Recording supressor ultrasonic + Noise Generator by i4 Technology. 2019. https://www.amazon.com/Microphone-dictaphoneRecording-supressor-ultrasonic/dp/B01MG4WACJ/. (2019).",
      "doi": ""
    },
    {
      "text": "Al Faruque, Mohammad Abdullah, Sujit Rokka Chhetri, Arquimedes Canedo, and Jiang Wan. 2016. Acoustic side-channel attacks on additive manufacturing systems. In Proceedings of the 7th International Conference on Cyber-Physical Systems. IEEE Press, 19.",
      "doi": "10.5555/2984464.2984483"
    },
    {
      "text": "Carl Fischer, Kavitha Muthukrishnan, Mike Hazas, and Hans Gellersen. 2008. Ultrasound-aided Pedestrian Dead Reckoning for Indoor Navigation. In Proceedings of the First ACM International Workshop on Mobile Entity Localization and Tracking in GPS-less Environments (MELT '08).",
      "doi": "10.1145/1410012.1410020"
    },
    {
      "text": "Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. SoundWave: Using the Doppler Effect to Sense Gestures. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems (CHI).",
      "doi": "10.1145/2207676.2208331"
    },
    {
      "text": "Mordechai Guri, Yosef Solewicz, Andrey Daidakulov, and Yuval Elovici. 2017. SPEAKE(a)R: Turn Speakers to Microphones for Fun and Profit. In 11th USENIX Workshop on Offensive Technologies (WOOT 17). USENIX Association, Vancouver, BC. https://www.usenix.org/conference/woot17/workshopprogram/presentation/guri",
      "doi": ""
    },
    {
      "text": "Google is permanently nerfing all Home Minis because mine spied on everything I said 24/7 [Update x2]. 2017. https://www.androidpolice.com/2017/10/10/googlenerfing-home-minis-mine-spied-everything-said-247/. (2017).",
      "doi": ""
    },
    {
      "text": "Speech jammer TOWER-A for blocking proffessional microphones / counter surveillance. 2019. https://www.detective-store.com/speech-jammer-towera-for-blocking-proffessional-microphones-countersurveillance-1516.html. (2019).",
      "doi": ""
    },
    {
      "text": "Ilias Kaperonis. 1984. Industrial espionage. Computers & Security 3, 2 (1984), 117--121.",
      "doi": ""
    },
    {
      "text": "Gary S. Kendall, Christopher Haworth, and Rodrigo F. Cádiz. 2014. Sound Synthesis with Auditory Distortion Products. Computer Music Journal 38 (2014), 5--23. Issue 4.",
      "doi": "10.1162/COMJ_a_00265"
    },
    {
      "text": "Junhong Li, Chenghao Wang, Wei Ren, and Jun Ma. 2017. ZnO thin film piezoelectric micromachined microphone with symmetric composite vibrating diaphragm. Smart Materials and Structures 26, 5 (2017), 055033.",
      "doi": ""
    },
    {
      "text": "Dominique Machuletz, Stefan Laube, and Rainer Böhme. 2018. Webcam Covering As Planned Behavior. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 180, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173754",
      "doi": "10.1145/3173574.3173754"
    },
    {
      "text": "Sapna Maheshwari. 2018. Hey, Alexa, What Can You Hear? And What Will You Do With It? New York Times. (March 2018). https://mobile.nytimes.com/2018/03/31/business/media/ amazon-google-privacy-digital-assistants.html.",
      "doi": ""
    },
    {
      "text": "Robert J Mailloux. 1982. Phased array theory and technology. Proc. IEEE 70, 3 (1982), 246--291.",
      "doi": ""
    },
    {
      "text": "Asier Marzo, Sue Ann Seah, Bruce W. Drinkwater, Deepak Ranjan Sahoo, Benjamin Long, and Sriram Subramanian. 2015. Holographic acoustic elements for manipulation of levitated objects. Nature Communications 6, 1 (2015), 8661.",
      "doi": ""
    },
    {
      "text": "R. Mayrhofer and H. Gellersen. 2007. On the Security of Ultrasound as Out-of-band Channel. In Proceedings of the 2007 IEEE International Parallel and Distributed Processing Symposium.",
      "doi": ""
    },
    {
      "text": "Saeed Mirzamohammadi and Ardalan Amiri Sani. 2016. Viola: Trustworthy Sensor Notifications for Enhanced Privacy on Mobile Systems. In Proceedings of the 14th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '16). ACM, NY, NY, USA, 263--276. DOI: http://dx.doi.org/10.1145/2906388.2906391",
      "doi": "10.1145/2906388.2906391"
    },
    {
      "text": "Rafael Morales, Asier Marzo, Sriram Subramanian, and Diego Martínez. 2019. LeviProps: Animating Levitated Optimized Fabric Structures using Holographic Acoustic Tweezers. In Proc. of UIST.",
      "doi": "10.1145/3332165.3347882"
    },
    {
      "text": "Tim Moynihan. 2016. Alexa and Google Home Record What You Say. But What Happens to That Data? Wired. (December 2016). https://www.wired.com/2016/ 12/alexa-and-google-record-your-voice/.",
      "doi": ""
    },
    {
      "text": "New Generation of High Grade Smartphone Scrambler. 2019. https://www.globaltscmgroup-usa.com/. (2019).",
      "doi": ""
    },
    {
      "text": "Wayne O Olsen. 1998. Average speech levels and spectra in various speaking/listening conditions: A summary of the Pearson, Bennett, & Fidell (1977) report. American Journal of Audiology 7, 2 (1998).",
      "doi": ""
    },
    {
      "text": "Minna Pakanen, Ashley Colley, Jonna Häkkilä, Johan Kildal, and Vuokko Lantz. 2014. Squeezy Bracelet: Designing a Wearable Communication Device for Tactile Interaction. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). 305--314.",
      "doi": "10.1145/2639189.2639238"
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking \"Privacy\" for a Networked World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 129--136. DOI: http://dx.doi.org/10.1145/642611.642635",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Rebecca S. Portnoff, Linda N. Lee, Serge Egelman, Pratyush Mishra, Derek Leung, and David Wagner. 2015. Somebody's Watching Me?: Assessing the Effectiveness of Webcam Indicator Lights. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1649--1658. DOI: http://dx.doi.org/10.1145/2702123.2702164",
      "doi": "10.1145/2702123.2702164"
    },
    {
      "text": "William K Pratt. 1972. Generalized Wiener filtering computation techniques. IEEE Trans. Comput. 100, 7 (1972), 636--641.",
      "doi": "10.1109/T-C.1972.223567"
    },
    {
      "text": "Dario Rethage, Jordi Pons, and Xavier Serra. 2018. A wavenet for speech denoising. In 2018 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 5069--5073.",
      "doi": "10.1109/ICASSP.2018.8462417"
    },
    {
      "text": "Nirupam Roy, Haitham Hassanieh, and Romit Roy Choudhury. 2017. Backdoor: Making microphones hear inaudible sounds. In Proceedings of ACM MobiSys.",
      "doi": "10.1145/3081333.3081366"
    },
    {
      "text": "Nirupam Roy, Sheng Shen, Haitham Hassanieh, and Romit Roy Choudhury. 2018. Inaudible Voice Commands: The Long-Range Attack and Defense. In Proceedings of the 15th USENIX Symposium on Networked Systems Design and Implementation (NSDI).",
      "doi": ""
    },
    {
      "text": "U.S. Occupational Safety and Health Administration (OSHA). 2013. Occupational Safety and Health Administration Technical Manual. https://www.osha.gov/dts/osta/otm/new_noise/#appendixc. (August 2013).",
      "doi": ""
    },
    {
      "text": "T. Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A. Landay. 2009. Enabling Always-available Input with Muscle-computer Interfaces. In Proceedings of ACM Symposium on User Interface Software and Technology (UIST). 167--176.",
      "doi": ""
    },
    {
      "text": "Woon Seob Lee and Seung S. Lee. 2008. Piezoelectric microphone built on circular diaphragm. 144 (06 2008), 367--373.",
      "doi": ""
    },
    {
      "text": "Liwei Song and Prateek Mittal. 2017. Inaudible Voice Commands. CoRR abs/1708.07238 (2017).",
      "doi": ""
    },
    {
      "text": "IBM Speech to Text. 2018. https://www.ibm.com/watson/services/speech-to-text/. (Jul. 2018).",
      "doi": ""
    },
    {
      "text": "Your Phone Is Listening Literally Listening to Your TV. 2015. https://www.theatlantic.com/ technology/archive/2015/11/your-phone-is-literallylistening-to-your-tv/416712/. (2015).",
      "doi": ""
    },
    {
      "text": "Edward J. Wang, Tien-Jui Lee, Alex Mariakakis, Mayank Goel, Sidhant Gupta, and Shwetak N. Patel. 2015. MagnifiSense: Inferring Device Interaction Using Wrist-worn Passive Magneto-inductive Sensors. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp).",
      "doi": ""
    },
    {
      "text": "Charlie Wood. 2017. Devices sprout ears: What do Alexa and Siri mean for privacy? Christian Science Monitor. (January 2017). https://www.csmonitor.com/Technology/2017/0114/Devicessprout-ears-What-do-Alexa-and-Siri-mean-for-privacy.",
      "doi": ""
    },
    {
      "text": "Candid Wueest. 2017. Everything You Need to Know About the Security of Voice-Activated Smart Speakers. Symantec. (Nov. 2017). https://www.symantec.com/blogs/threat-intelligence/ security-voice-activated-smart-speakers.",
      "doi": ""
    },
    {
      "text": "Chenren Xu, Sugang Li, Gang Liu, Yanyong Zhang, Emiliano Miluzzo, Yih-Farn Chen, Jun Li, and Bernhard Firner. 2013. Crowd++: Unsupervised Speaker Count with Smartphones. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp).",
      "doi": "10.1145/2493432.2493435"
    },
    {
      "text": "Tuo Yu, Haiming Jin, and Klara Nahrstedt. 2016. WritingHacker: Audio Based Eavesdropping of Handwriting via Mobile Devices. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp).",
      "doi": "10.1145/2971648.2971681"
    },
    {
      "text": "Clint Zeagler. 2017. Where to Wear It: Functional, Technical, and Social Considerations in On-body Location for Wearable Technology 20 Years of Designing for Wearability. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (ISWC '17).",
      "doi": "10.1145/3123021.3123042"
    },
    {
      "text": "Guoming Zhang, Chen Yan, Xiaoyu Ji, Tianchen Zhang, Taimin Zhang, and Wenyuan Xu. 2017. DolphinAttack: Inaudible voice commands. In Proceedings of ACM Conference on Computer and Communications Security (CCS).",
      "doi": "10.1145/3133956.3134052"
    },
    {
      "text": "Li Zhuang, Feng Zhou, and J Doug Tygar. 2009. Keyboard acoustic emanations revisited. ACM Transactions on Information and System Security (TISSEC) 13, 1 (2009), 3.",
      "doi": "10.1145/1609956.1609959"
    }
  ]
}