{
  "doi": "10.1145/3313831.3376841",
  "title": "PolySense: Augmenting Textiles with Electrical Functionality using In-Situ Polymerization",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We present a method for enabling arbitrary textiles to sense pressure and deformation: In-situ polymerization supports integration of piezoresistive properties at the material level, preserving a textile's haptic and mechanical characteristics. We demonstrate how to enhance a wide set of fabrics and yarns using only readily available tools. To further support customisation by the designer, we present methods for patterning, as needed to create circuits and sensors, and demonstrate how to combine areas of different conductance in one material. Technical evaluation results demonstrate the performance of sensors created using our method is comparable to off-the-shelf piezoresistive textiles. As application examples, we demonstrate rapid manufacturing of on-body interfaces, tie-dyed motion-capture clothing, and zippers that act as potentiometers.",
  "tags": [
    "personal fabrication",
    "in-situ polymerization",
    "etextiles",
    "wearables",
    "electro-functionalization",
    "piezoresistive sensors"
  ],
  "authors": [
    {
      "name": "Cedric Honnet",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-99659046848/rel-imgonly/ch_square.jpg",
      "acmid": "99659046848",
      "orcid": "missing"
    },
    {
      "name": "Hannah Perner-Wilson",
      "institution": "Kobakant, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453657990",
      "orcid": "missing"
    },
    {
      "name": "Marc Teyssier",
      "institution": "Télécom Paris and Saarland University, Saarland Informatics Campus, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019889",
      "orcid": "missing"
    },
    {
      "name": "Bruno Fruchard",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161949",
      "orcid": "0000-0002-2488-6032"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    },
    {
      "name": "Ana C. Baptista",
      "institution": "NOVA University Lisbon, Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527608",
      "orcid": "missing"
    },
    {
      "name": "Paul Strohmeier",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-81498658319/rel-imgonly/crop.jpg",
      "acmid": "81498658319",
      "orcid": "0000-0002-7442-2607"
    }
  ],
  "references": [
    {
      "text": "Linden Allison, Steven Hoxie, and Trisha Andrew. 2017. Towards Seamlessly-Integrated Textile Electronics: Methods to Coat Fabrics and Fibers with Conducting Polymers for Electronic Applications. Chem. Commun. 53 (05 2017). DOI: http://dx.doi.org/10.1039/C7CC02592K",
      "doi": ""
    },
    {
      "text": "Moritz Bächer, Benjamin Hepp, Fabrizio Pece, Paul G. Kry, Bernd Bickel, Bernhard Thomaszewski, and Otmar Hilliges. 2016. DefSense: Computational Design of Customized Deformable Input Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3806--3816. DOI: http://dx.doi.org/10.1145/2858036.2858354",
      "doi": "10.1145/2858036.2858354"
    },
    {
      "text": "Jedrzej Banaszczyk, Andrzej Rybak, and Mateusz Odziomek. 2015. Aging of Polypyrrole Coated Fabrics Potted in Epoxy. Fibres and Textiles in Eastern Europe 23 (03 2015), 79--83. 12Such a technology is used by https://www.solidscape.com/",
      "doi": ""
    },
    {
      "text": "A. C. Baptista, I. Ropio, B. Romba, J. P. Nobre, C. Henriques, J. C. Silva, J. I. Martins, J. P. Borges, and I. Ferreira. 2018. Cellulose-based electrospun fbers functionalized with polypyrrole and polyaniline for fully organic batteries. Journal of Materials Chemistry A 6, 1 (dec 2018), 256--265. DOI: http://dx.doi.org/10.1039/C7TA06457H",
      "doi": ""
    },
    {
      "text": "N. Belfer. 1992. Batik and Tie Dye Techniques. Dover Publications.",
      "doi": ""
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Sebastian Boring, and Kasper Hornbundefnedk. 2017. Placing and Recalling Virtual Items on the Skin. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). Association for Computing Machinery, New York, NY, USA, 1497--1507. DOI: http://dx.doi.org/10.1145/3025453.3026030",
      "doi": "10.1145/3025453.3026030"
    },
    {
      "text": "Lina M Castano and Alison B Flatau. 2014. Smart fabric sensors and e-textile technologies: a review. Smart Materials and Structures 23, 5 (2014), 053001. DOI: http://dx.doi.org/10.1088/0964--1726/23/5/053001",
      "doi": ""
    },
    {
      "text": "Artem Dementyev, Hsin-Liu (Cindy) Kao, and Joseph A. Paradiso. 2015. SensorTape: Modular and Programmable 3D-Aware Dense Sensor Network on a Tape. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). Association for Computing Machinery, New York, NY, USA. DOI: http://dx.doi.org/10.1145/2807442.2807507",
      "doi": "10.1145/2807442.2807507"
    },
    {
      "text": "Maurin Donneaud, Cedric Honnet, and Paul Strohmeier. 2017. Designing a Multi-Touch eTextile for Music Performances. In Proceedings of the International Conference on New Interfaces for Musical Expression. 7--12. http://www.nime.org/proceedings/2017/nime2017",
      "doi": ""
    },
    {
      "text": "Yu Enokibori and Kenji Mase. 2014. Human Joint Angle Estimation with an e-Textile Sensor. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, NY, NY, USA, 129--130. DOI: http://dx.doi.org/10.1145/2634317.2634331",
      "doi": "10.1145/2634317.2634331"
    },
    {
      "text": "Rachel Freire, Cedric Honnet, and Paul Strohmeier. 2017. Second Skin: An Exploration of eTextile Stretch Circuits on the Body. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, NY, NY, USA, 653--658. DOI: http://dx.doi.org/10.1145/3024969.3025054",
      "doi": "10.1145/3024969.3025054"
    },
    {
      "text": "Rachel Freire, Paul Strohmeier, Cedric Honnet, Jarrod Knibbe, and Sophia Brueckner. 2018. Designing eTextiles for the Body: Shape, Volume & Motion. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, NY, NY, USA, 728--731. DOI: http://dx.doi.org/10.1145/3173225.3173331",
      "doi": "10.1145/3173225.3173331"
    },
    {
      "text": "Pavel Galár, Branislav Dzurnak, Petr Maly, Jan Cermák, Alexander Kromka, Mária Omastová, and Bohuslav Rezek. 2013. Chemical Changes and Photoluminescence Properties of UV Modifed Polypyrrole. International journal of electrochemical science 8 (01 2013), 57--70.",
      "doi": ""
    },
    {
      "text": "Daniel Groeger and Jürgen Steimle. 2018. ObjectSkin: augmenting everyday objects with hydroprinted touch sensors and displays. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 4 (2018), 134.",
      "doi": "10.1145/3161165"
    },
    {
      "text": "Florian Heller, Stefan Ivanov, Chat Wacharamanotham, and Jan Borchers. 2014. FabriTouch: Exploring Flexible Touch Input on Textiles. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, NY, NY, USA, 59--62. DOI: http://dx.doi.org/10.1145/2634317.2634345",
      "doi": "10.1145/2634317.2634345"
    },
    {
      "text": "David Holman, Nicholas Fellion, and Roel Vertegaal. 2014. Sensing Touch Using Resistive Graphs. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). Association for Computing Machinery, New York, NY, USA, 195--198. DOI: http://dx.doi.org/10.1145/2598510.2598552",
      "doi": "10.1145/2598510.2598552"
    },
    {
      "text": "David Holman and Roel Vertegaal. 2011. TactileTape: Low-Cost Touch Sensing on Curved Surfaces. In Proceedings of the 24th Annual ACM Symposium Adjunct on User Interface Software and Technology (UIST '11 Adjunct). Association for Computing Machinery, New York, NY, USA, 17--18. DOI: http://dx.doi.org/10.1145/2046396.2046406",
      "doi": "10.1145/2046396.2046406"
    },
    {
      "text": "Cédric Honnet and Gonçalo Lopes. 2019. HiveTracker: 3D Positioning for Ubiquitous Embedded Systems. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers (UbiComp/ISWC '19 Adjunct). ACM, NY, NY, USA, 288--291. DOI: http://dx.doi.org/10.1145/3341162.3349295",
      "doi": ""
    },
    {
      "text": "Bingxiang Huang, G.J. Kang, and Y. Ni. 2006. Preparation of conductive paper by in-situ polymerization of pyrrole in a pulp fbre system. Pulp and Paper Canada 107 (02 2006), 38--42.",
      "doi": ""
    },
    {
      "text": "JW Jeong, YW Jang, I Lee, S Shin, and S Kim. 2009. Wearable respiratory rate monitoring using piezo-resistive fabric sensor. In World Congress on Medical Physics and Biomedical Engineering, September 7--12, 2009, Munich, Germany. Springer, 282--284.",
      "doi": ""
    },
    {
      "text": "Hsin-Liu Cindy Kao, Abdelkareem Bedri, and Kent Lyons. 2018. SkinWire: Fabricating a Self-Contained On-Skin PCB for the Hand. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article Article 116 (Sept. 2018), 23 pages. DOI: http://dx.doi.org/10.1145/3264926",
      "doi": ""
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2015. ExtensionSticker: A Proposal for a Striped Pattern Sticker to Extend Touch Interfaces and Its Assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 1851--1854. DOI: http://dx.doi.org/10.1145/2702123.2702500",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S Cook, Cheng Zhang, and Gregory D Abowd. 2013. Instant inkjet circuits: lab-based inkjet printing to support rapid prototyping of UbiComp devices. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 363--372.",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Arshad Khan, Joan Sol Roo, Tobias Kraus, and Jürgen Steimle. 2019. Soft Inkjet Circuits: Rapid Multi-Material Fabrication of Soft Circuits Using a Commodity Inkjet Printer. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). Association for Computing Machinery, New York, NY, USA, 341--354. DOI: http://dx.doi.org/10.1145/3332165.3347892",
      "doi": "10.1145/3332165.3347892"
    },
    {
      "text": "An Liang, Rebecca Stewart, and Nick Bryan-Kinns. 2019a. Analysis of Sensitivity, Linearity, Hysteresis, Responsiveness, and Fatigue of Textile Knit Stretch Sensors. Sensors 19, 16 (2019), 3618.",
      "doi": ""
    },
    {
      "text": "An Liang, Rebecca Stewart, Rachel Freire, and Nick Bryan-Kinns. 2019b. Effect of Bonding and Washing on Electronic Textile Stretch Sensor Properties. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers (UbiComp/ISWC '19 Adjunct). ACM, NY, NY, USA, 121--124. DOI: http://dx.doi.org/10.1145/3341162.3343817",
      "doi": ""
    },
    {
      "text": "Ruibo Liu, Qijia Shao, Siqi Wang, Christina Ru, Devin Balkcom, and Xia Zhou. 2019. Reconstructing Human Joint Motion with Computational Fabrics. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1, Article 19 (March 2019), 26 pages. DOI: http://dx.doi.org/10.1145/3314406",
      "doi": "10.1145/3314406"
    },
    {
      "text": "Eric Markvicka, Guanyun Wang, Yi-Chin Lee, Gierad Laput, Carmel Majidi, and Lining Yao. 2019. ElectroDermis: Fully Untethered, Stretchable, and Highly-Customizable Electronic Bandages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 632, 10 pages. DOI: http://dx.doi.org/10.1145/3290605.3300862",
      "doi": "10.1145/3290605.3300862"
    },
    {
      "text": "Conor O'Quigley, Mathilde Sabourin, Shirley Coyle, James Connolly, Joan Condall, Kevin Curran, Brian Corcoran, and Dermot Diamond. 2014. Characteristics of a Piezo-Resistive Fabric Stretch Sensor Glove for Home-Monitoring of Rheumatoid Arthritis. In Proceedings of the 2014 11th International Conference on Wearable and Implantable Body Sensor Networks Workshops (BSNWORKSHOPS '14). IEEE Computer Society, Washington, DC, USA, 23--26. DOI: http://dx.doi.org/10.1109/BSN.Workshops.2014.15",
      "doi": "10.1109/BSN.Workshops.2014.15"
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, and others. 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 745--756.",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: Real-time Sensing of Surface and Deformation Gestures on Flexible, Interactive Textiles, using a Hybrid Gesture Detection Pipeline Patrick. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology - UIST '17. 565--577. DOI: http://dx.doi.org/10.1145/3126594.3126652",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "E. Rehmi Post and Margaret Orth. 1997. Smart Fabric, or \"Wearable Clothing\". In Proceedings of the 1st IEEE International Symposium on Wearable Computers (ISWC '97). IEEE Computer Society, Washington, DC, USA, 167--. http://dl.acm.org/citation.cfm?id=851036.856432",
      "doi": "10.5555/851036.856432"
    },
    {
      "text": "I. Ropio, A.C. Baptista, J.P. Nobre, J. Correia, F. Belo, S. Taborda, B.M. Morais Faustino, J.P. Borges, A. Kovalenko, and I. Ferreira. 2018. Cellulose paper functionalised with polypyrrole and poly(3,4-ethylenedioxythiophene) for paper battery electrodes. Organic Electronics 62 (nov 2018), 530--535. DOI: http://dx.doi.org/10.1016/J.ORGEL.2018.06.025",
      "doi": ""
    },
    {
      "text": "Ilya Rosenberg and Ken Perlin. 2009. The UnMousePad: An Interpolating Multi-touch Force-sensing Input Pad. ACM Trans. Graph. 28, 3, Article 65 (July 2009), 9 pages. DOI: http://dx.doi.org/10.1145/1531326.1531371",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 579--588.",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Andreas Schlegel and Cedric Honnet. 2017. Digital Oxymorons: From Ordinary to Expressive Objects Using Tiny Wireless IMUs. In Proceedings of the 4th International Conference on Movement Computing (MOCO '17). ACM, NY, NY, USA, Article 4, 8 pages. DOI: http://dx.doi.org/10.1145/3077981.3078040",
      "doi": "10.1145/3077981.3078040"
    },
    {
      "text": "Stefan Schneegass and Alexandra Voit. 2016. GestureSleeve: using touch sensitive fabrics for gestural input on the forearm for controlling smartwatches. Proceedings of the 2016 ACM International Symposium on Wearable Computers - ISWC '16 (2016), 108--115. DOI: http://dx.doi.org/10.1145/2971763.2971797",
      "doi": "10.1145/2971763.2971797"
    },
    {
      "text": "Sophie Skach, Patrick Healey, and Rebecca Stewart. 2017. Talking Through Your Arse: Sensing Conversation with Seat Covers.",
      "doi": ""
    },
    {
      "text": "Sophie Skach, Anna Xambó, Luca Turchet, Ariane Stolf, Rebecca Stewart, and Mathieu Barthet. 2018. Embodied Interactions with E-Textiles and the Internet of Sounds for Performing Arts. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, NY, NY, USA, 80--87. DOI: http://dx.doi.org/10.1145/3173225.3173272",
      "doi": "10.1145/3173225.3173272"
    },
    {
      "text": "Paul Strohmeier, Jarrod Knibbe, Sebastian Boring, and Kasper Hornbæk. 2018. zPatch: Hybrid resistive/capacitive etextile input. In TEI 2018 Proceedings of the 12th International Conference on Tangible, Embedded, and Embodied Interaction, Vol. 2018-Janua. DOI: http://dx.doi.org/10.1145/3173225.3173242",
      "doi": "10.1145/3173225.3173242"
    },
    {
      "text": "Paul Strohmeier, Kaja Vembe Swensen, Cameron Lapp, Audrey Girouard, and Roel Vertegaal. 2012a. A Flock of Birds: Bringing Paper to Life. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 333--334. DOI: http://dx.doi.org/10.1145/2148131.2148208",
      "doi": "10.1145/2148131.2148208"
    },
    {
      "text": "Paul Strohmeier, Roel Vertegaal, and Audrey Girouard. 2012b. With a Flick of the Wrist: Stretch Sensors As Lightweight Input for Mobile Devices. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 307--308. DOI: http://dx.doi.org/10.1145/2148131.2148195",
      "doi": "10.1145/2148131.2148195"
    },
    {
      "text": "Aneesh P. Tarun and Peng Wang. 2012. Designing and Building Inexpensive Flexible Circuits. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 375--377. DOI: http://dx.doi.org/10.1145/2148131.2148221",
      "doi": ""
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, Eric Lecolinet, Andrew Conn, and Anne Roudaut. 2019. Skin-On Interfaces: A Bio-Driven Approach for Artifcial Skin Design to Cover Interactive Devices. (2019). http://dx.doi.org/10.475/123_4",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2991--3000. DOI: http://dx.doi.org/10.1145/2702123.2702391",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). Association for Computing Machinery, New York, NY, USA, 3095--3105. DOI: http://dx.doi.org/10.1145/3025453.3025704",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E. Mackay. 2016. Stretchis: Fabricating Highly Stretchable User Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 697--704. DOI: http://dx.doi.org/10.1145/2984511.2984521",
      "doi": ""
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo: A thin and feel-through tattoo for on-skin tactile output. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 365--378.",
      "doi": "10.1145/3242587.3242645"
    },
    {
      "text": "Juan Xie, Wei Pan, Zheng Guo, Shan Shan Jiao, and Ling Ping Yang. 2019. In situ polymerization of polypyrrole on cotton fabrics as fexible electrothermal materials. Journal of Engineered Fibers and Fabrics 14 (jan 2019), 155892501982744. DOI: http://dx.doi.org/10.1177/1558925019827447",
      "doi": ""
    },
    {
      "text": "Yang Zhang, Gierad Laput, and Chris Harrison. 2017. Electrick: Low-cost touch sensing using electric feld tomography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1--14.",
      "doi": "10.1145/3025453.3025842"
    },
    {
      "text": "Yang Zhang, Chouchang Jack Yang, Scott E Hudson, Chris Harrison, and Alanson Sample. 2018. Wall++: Room-scale interactive and context-aware sensing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 273.",
      "doi": "10.1145/3173574.3173847"
    },
    {
      "text": "Bo Zhou, Jingyuan Cheng, Mathias Sundholm, and Paul Lukowicz. 2014. From smart clothing to smart table cloth: Design and implementation of a large scale, textile pressure matrix sensor. In Lecture Notes in Computer Science, Vol. 8350 LNCS. Springer, Cham, 159--170. DOI: http://dx.doi.org/10.1007/978--3--319-04891--8_14",
      "doi": ""
    }
  ]
}