{
  "doi": "10.1145/3313831.3376299",
  "title": "Understanding Older Adults' Participation in Design Workshops",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Design workshops are a popular means of including older adults in technology development. However, there are open questions around how to best scaffold this participation, particularly in supporting older adults to associate their designs with themselves, rather than designing for an \"other older adult.\" By conducting workshops focusing on envisioning the future of internet of things (IoT) technologies at home, we provide an understanding of how older individuals participate in group activities to conceptualize technology for themselves. We find that at different stages of the design process, individuals shift in who they envision the end user of the technology: at first, they think about common older adult needs, then turn to designing for themselves. Individuals' attitudes towards technology also impact group dynamics along with final design ideas. Our discussion contributes to an understanding of how to support older adults in designing for themselves, new perspectives on aging-in-place technologies, and recommendations for configuring design workshops with older individuals.",
  "tags": [
    "co-design, iot",
    "older adults",
    "design workshops",
    "participatory design"
  ],
  "authors": [
    {
      "name": "Alisha Pradhan",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659213464",
      "orcid": "missing"
    },
    {
      "name": "Ben Jelen",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021620",
      "orcid": "missing"
    },
    {
      "name": "Katie A. Siek",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81311481394/rel-imgonly/dsc_0184-less1mb-1024x683.jpg",
      "acmid": "81311481394",
      "orcid": "missing"
    },
    {
      "name": "Joel Chan",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259095857",
      "orcid": "missing"
    },
    {
      "name": "Amanda Lazar",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    }
  ],
  "references": [
    {
      "text": "Aloha Hufana Ambe, Margot Brereton, Alessandro Soro, Min Zhen Chai, Laurie Buys, and Paul Roe. 2019. Older People Inventing Their Personal Internet of Things with the IoT Un-Kit Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 322:1-- 322:15. https://doi.org/10.1145/3290605.3300552",
      "doi": "10.1145/3290605.3300552"
    },
    {
      "text": "Ingrid Arreola, Zan Morris, Matthew Francisco, Kay Connelly, Kelly Caine, and Ginger White. 2014. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 1933--1936. https://doi.org/10.1145/2556288.2557084",
      "doi": ""
    },
    {
      "text": "Naveen Bagalkot, Elena Nazzi, and Tomas Sokoler. 2010. Facilitating Continuity: Exploring the Role of Digital Technology in Physical Rehabilitation. In Proceedings of the 6th Nordic Conference on HumanComputer Interaction: Extending Boundaries (NordiCHI '10), 42--51. https://doi.org/10.1145/1868914.1868924",
      "doi": "10.1145/1868914.1868924"
    },
    {
      "text": "Steven Baker, Jenny Waycott, Romina Carrasco, Thuong Hoang, and Frank Vetere. 2019. Exploring the Design of Social VR Experiences with Older Adults. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 303--315. https://doi.org/10.1145/3322276.3322361",
      "doi": "10.1145/3322276.3322361"
    },
    {
      "text": "Athanasios Bamis, Dimitrios Lymberopoulos, Thiago Teixeira, and Andreas Savvides. 2010. The BehaviorScope framework for enabling ambient assisted living. Personal and Ubiquitous Computing 14, 6: 473--487. https://doi.org/10.1007/s00779-0100282-z",
      "doi": "10.1007/s00779-010-0282-z"
    },
    {
      "text": "Ana Barros, Sílvia Rêgo, and João Antunes. 2014. Aspects of Human-Centred Design in HCI with Older Adults: Experiences from the Field. In 5th International Conference on Human-Centred Software Engineering (HCSE), 235--242. https://doi.org/10.1007/978--3--662--44811--3_14",
      "doi": "10.1007/978-3-662-44811-3_14"
    },
    {
      "text": "Margot Brereton. 2013. Habituated Objects: Everyday Tangibles That Foster the Independent Living of an Elderly Woman. interactions 20, 4: 20--24. https://doi.org/10.1145/2486227.2486233",
      "doi": ""
    },
    {
      "text": "Margot Brereton, Alessandro Soro, Kate Vaisutis, and Paul Roe. 2015. The Messaging Kettle: Prototyping Connection over a Distance Between Adult Children and Older Parents. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 713--716. https://doi.org/10.1145/2702123.2702462",
      "doi": "10.1145/2702123.2702462"
    },
    {
      "text": "Kelly E. Caine, Celine Y. Zimmerman, Zachary Schall-Zimmerman, William R. Hazlewood, Alexander C. Sulgrove, L. Jean Camp, Katherine H. Connelly, Lesa L. Huber, and Kalpana Shankar. 2010. DigiSwitch: Design and Evaluation of a Device for Older Adults to Preserve Privacy While Monitoring Health at Home. In Proceedings of the 1st ACM International Health Informatics Symposium (IHI '10), 153--162. https://doi.org/10.1145/1882992.1883016",
      "doi": "10.1145/1882992.1883016"
    },
    {
      "text": "Zoraida Callejas and Ramón López-Cózar. 2009. Designing Smart Home Interfaces for the Elderly. SIGACCESS Access. Comput., 95: 10--16. https://doi.org/10.1145/1651259.1651261",
      "doi": "10.1145/1651259.1651261"
    },
    {
      "text": "Caroline Cakebread. 2018. How Voice Assistants Will Become More Significant for Seniors. eMarketer. Retrieved September 3, 2019 from https://www.emarketer.com/content/how-voiceassistants-will-become-more-significant-for-seniors",
      "doi": ""
    },
    {
      "text": "Scott Carter and Jennifer Mankoff. 2005. When Participants Do the Capturing: The Role of Media in Diary Studies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 899--908. https://doi.org/10.1145/1054972.1055098",
      "doi": "10.1145/1054972.1055098"
    },
    {
      "text": "Kayla Carucci and Kentaro Toyama. 2019. Making Well-being: Exploring the Role of Makerspaces in Long Term Care Facilities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--12. https://doi.org/10.1145/3290605.3300699",
      "doi": "10.1145/3290605.3300699"
    },
    {
      "text": "J. A. Chatman, J. T. Polzer, S. G. Barsade, and M. A. Neale. 1998. Being Different Yet Feeling Similar: The Influence Of Demographic Composition And Organizational Culture On Work Processes And Outcomes. Adminstrative Science Quarterly 43, 4: 749--780. https://doi.org/10.2307/2393615",
      "doi": ""
    },
    {
      "text": "Gilbert Cockton. 2004. Value-centred HCI. In Proceedings of the Third Nordic Conference on Human-computer Interaction (NordiCHI '04), 149-- 160. https://doi.org/10.1145/1028014.1028038",
      "doi": "10.1145/1028014"
    },
    {
      "text": "Graeme W. Coleman, Lorna Gibson, Vicki L. Hanson, Ania Bobrowicz, and Alison McKay. 2010. Engaging the disengaged: how do we design technology for digitally excluded older adults? In Proceedings of the 8th ACM Conference on Designing Interactive Systems - DIS '10, 175. https://doi.org/10.1145/1858171.1858202",
      "doi": "10.1145/1858171.1858202"
    },
    {
      "text": "Charles Consel, Lucile Dupuy, and Hélène Sauzéon. 2015. l. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 77--87. https://doi.org/10.1145/2700648.2809855",
      "doi": ""
    },
    {
      "text": "Elizabeth V. Cyarto, Frances Batchelor, Steven Baker, and Briony Dow. 2016. Active Ageing with Avatars: A Virtual Exercise Class for Older Adults. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI '16), 302--309. https://doi.org/10.1145/3010915.3010944",
      "doi": "10.1145/3010915.3010944"
    },
    {
      "text": "Sara J. Czaja, Neil Charness, Arthur D. Fisk, Christopher Hertzog, Sankaran N. Nair, Wendy A. Rogers, and Joseph Sharit. 2006. Factors predicting the use of technology: Findings from the center for research and education on aging and technology enhancement (create). Psychology and Aging 21, 2: 333--352. https://doi.org/10.1037/0882--7974.21.2.333",
      "doi": "10.1037/0882-"
    },
    {
      "text": "Jennifer L. Davidson and Carlos Jensen. 2013. Participatory Design with Older Adults: An Analysis of Creativity in the Design of Mobile Healthcare Applications. In Proceedings of the 9th ACM Conference on Creativity & Cognition (C&C '13), 114--123. https://doi.org/10.1145/2466627.2466652",
      "doi": ""
    },
    {
      "text": "Jennifer L Davidson and Carlos Jensen. What Health Topics Older Adults Want To Track: A Participatory Design Study. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility, Article No.: 26. https://doi.org/10.1145/2513383.2513451",
      "doi": ""
    },
    {
      "text": "M. Jamal Deen. 2015. Information and Communications Technologies for Elderly Ubiquitous Healthcare in a Smart Home. Personal Ubiquitous Comput. 19, 3--4: 573--599. https://doi.org/10.1007/s00779-015-0856-x",
      "doi": "10.1007/s00779-015-0856-x"
    },
    {
      "text": "George Demiris, Debra Parker Oliver, Geraldine Dickey, Marjorie Skubic, and Marilyn Rantz. 2008. Findings from a participatory evaluation of a smart home application for older adults. Technology and Health Care 16, 2: 111--118.",
      "doi": "10.5555/1378666.1378670"
    },
    {
      "text": "George Demiris, Marilyn Rantz, Myra Aud, Karen Marek, Harry Tyrer, Marjorie Skubic, and Ali Hussam. 2004. Older adults' attitudes towards and perceptions of ?smart home\" technologies: a pilot study. Medical Informatics and the Internet in Medicine 29, 2: 87--94. https://doi.org/10.1080/14639230410001684387",
      "doi": ""
    },
    {
      "text": "United Nations Department of Economic & Social Affairs Population Division. 2013. World Population Ageing 2013. Social Science Computer Review December: ST/ESA/SER.A/348.",
      "doi": ""
    },
    {
      "text": "Julie Doyle, Lorcan Walsh, Antonella Sassu, and Teresa McDonagh. 2014. Designing a Wellness SelfManagement Tool for Older Adults -- Results from a Field Trial of YourWellness. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. https://doi.org/10.4108/icst.pervasivehealth.2014.2549",
      "doi": ""
    },
    {
      "text": "Amy C. Edmondson, Josephine P. Mogelof, and Josephine P. Mogelof. 2006. Explaining Psychological Safety in Innovation Teams: Organizational Culture, Team Dynamics, or Personality? In Creativity and Innovation in Organizational Teams. 109--136. https://doi.org/10.4324/9781410615732--16",
      "doi": ""
    },
    {
      "text": "R. Eisma, A. Dickinson, J. Goodman, A. Syme, L. Tiwari, and F. Newell. 2004. Early User Involvement in the Development of Information Technology-related Products for Older People. Univers. Access Inf. Soc. 3, 2: 131--140. https://doi.org/10.1007/s10209-004-0092z",
      "doi": "10.1007/s10209-004-0092-z"
    },
    {
      "text": "Leonardo Giusti, Eleonora Mencarini, and Massimo Zancanaro. 2010. \"Luckily, I Don'T Need It\": Elderly and the Use of Artifacts for Time Management. In Proceedings of the 6th Nordic Conference on HumanComputer Interaction: Extending Boundaries (NordiCHI '10), 198--206. https://doi.org/10.1145/1868914.1868940",
      "doi": "10.1145/1868914.1868940"
    },
    {
      "text": "Lilit Hakobyan, Jo Lumsden, and Dympna O'Sullivan. 2014. Participatory Research with Older Adults with AMD: Co-Designing a SMART Diet Diary App. 32-- 41. https://doi.org/10.14236/ewic/hci2014.4",
      "doi": ""
    },
    {
      "text": "Joachim Halse. 2013. Ethnographies of the Possible. Design Anthropology -- Theory and Practice Chapter 10: 180--198.",
      "doi": ""
    },
    {
      "text": "Kim Halskov and Peter Dalsgård. 2006. Inspiration card workshops. In DIS '06: Proceedings of the 6th conference on Designing Interactive system, 2--11. https://doi.org/10.1145/1142405.1142409",
      "doi": "10.1145/1142405.1142409"
    },
    {
      "text": "Christina N. Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions Through Community-based Design Workshops. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 593:1-- 593:15. https://doi.org/10.1145/3290605.3300823",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "David A. Harrison, Kenneth H. Price, Joanne H. Gavin, and Anna T. Florey. 2002. Time, Teams, and Task Performance: Changing Effects of Surface- and Deep-Level Diversity on Group Functioning. The Academy of Management Journal 45, 5: 1029--1045. https://doi.org/10.2307/3069328",
      "doi": ""
    },
    {
      "text": "Ilyce Glink. 2017. 10 smart home features to help you age in place | CBS news. Retrieved September 8, 2019 from https://www.cbsnews.com/media/10-smart-homefeatures-to-help-you-age-in-place/",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, Jean-Bernard Martens, and Marc Hassenzahl. 2010. On the Retrospective Assessment of Users' Experiences over Time: Memory or Actuality? In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10), 4075--4080. https://doi.org/10.1145/1753846.1754105",
      "doi": "10.1145/1753846.1754105"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Cory D. Kidd, Robert Orr, Gregory D. Abowd, Christopher G. Atkeson, Irfan A. Essa, Blair MacIntyre, Elizabeth Mynatt, Thad E. Starner, and Wendy Newstetter. 1999. The Aware Home: A Living Laboratory for Ubiquitous Computing Research. In Cooperative Buildings. Integrating Information, Organizations, and Architecture (Lecture Notes in Computer Science), 191--198.",
      "doi": ""
    },
    {
      "text": "Bran Knowles and Vicki L. Hanson. 2018. Older Adults' Deployment of 'Distrust.' ACM Trans. Comput.-Hum. Interact. 25, 4: 21:1--21:25. https://doi.org/10.1145/3196490",
      "doi": "10.1145/3196490"
    },
    {
      "text": "Jaroslaw Kowalski, Anna Jaskulska, Kinga Skorupska, Katarzyna Abramczuk, Cezary Biele, Wieslaw Kope, and Krzysztof Marasek. 2019. Older Adults and Voice Interaction: A Pilot Study with Google Home. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19), LBW0187:1--LBW0187:6. https://doi.org/10.1145/3290607.3312973",
      "doi": ""
    },
    {
      "text": "Amanda Lazar and David H. Nguyen. 2017. Successful Leisure in Independent Living Communities: Understanding Older Adults' Motivations to Engage in Leisure Activities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 7042--7056. https://doi.org/10.1145/3025453.3025802",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Hilaire J. Thompson, Anne Marie Piper, and George Demiris. 2016. Rethinking the Design of Robotic Pets for Older Adults. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 1034--1046. https://doi.org/10.1145/2901790.2901811",
      "doi": "10.1145/2901790.2901811"
    },
    {
      "text": "Matthew L Lee and Anind K Dey. 2011. Reflecting on pills and phone use: supporting awareness of functional abilities for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2095--2104. https://doi.org/10.1145/1978942.1979247",
      "doi": "10.1145/1978942.1979247"
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2015. Sensorbased Observations of Daily Living for Aging in Place. Personal Ubiquitous Comput. 19, 1: 27--43. https://doi.org/10.1007/s00779-014-0810--3",
      "doi": "10.1007/s00779-014-0810-3"
    },
    {
      "text": "Tuck Wah Leong and Toni Robertson. 2016. Voicing values: laying foundations for ageing people to participate in design. In Proceedings of the 14th Participatory Design Conference on Full papers PDC '16, 31--40. https://doi.org/10.1145/2940299.2940301",
      "doi": "10.1145/2940299.2940301"
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Guy Schofield, and Patrick Olivier. 2012. Engaging older people using participatory design. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, 1199. https://doi.org/10.1145/2207676.2208570",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Michael Massimi, Ronald M. Baecker, and Michael Wu. 2007. Using participatory activities with seniors to critique, build, and evaluate mobile phones. In Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility - Assets '07, 155. https://doi.org/10.1145/1296843.1296871",
      "doi": "10.1145/1296843.1296871"
    },
    {
      "text": "Marilyn Rose McGee-Lennon, Maria Klara Wolters, and Stephen Brewster. 2011. User-centred Multimodal Reminders for Assistive Living. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2105--2114. https://doi.org/10.1145/1978942.1979248",
      "doi": "10.1145/1978942.1979248"
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative Research & Evaluation Methods. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Alex Mihailidis, Amy Cockburn, Catherine Longley, and Jennifer Boger. 2008. The Acceptability of Home Monitoring Technology Among Community-Dwelling Older Adults and Baby Boomers. Assistive Technology 20, 1: 1--12. https://doi.org/10.1080/10400435.2008.10131927",
      "doi": ""
    },
    {
      "text": "Tracy L. Mitzner, Julie B. Boron, Cara Bailey Fausset, Anne E. Adams, Neil Charness, Sara J. Czaja, Katinka Dijkstra, Arthur D. Fisk, Wendy A. Rogers, and Joseph Sharit. 2010. Older Adults Talk Technology: Technology Usage and Attitudes. Computers in Human Behavior 26, 6: 1710--1721. https://doi.org/10.1016/j.chb.2010.06.020",
      "doi": "10.1016/j.chb.2010.06.020"
    },
    {
      "text": "Monica Anderson and Andrew Perrin. 2017. Tech Adoption Climbs Among Older Americans. Pew Research Center: Internet, Science & Tech. Retrieved September 20, 2019 from https://www.pewinternet.org/2017/05/17/techadoption-climbs-among-older-adults/",
      "doi": ""
    },
    {
      "text": "Simone Mora, Francesco Gianni, and Monica Divitini. 2017. Tiles: A Card-based Ideation Toolkit for the Internet of Things. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 587--598. https://doi.org/10.1145/3064663.3064699",
      "doi": "10.1145/3064663.3064699"
    },
    {
      "text": "Elizabeth D. Mynatt, Jim Rowan, Sarah Craighill, and Annie Jacobs. 2001. Digital Family Portraits: Supporting Peace of Mind for Extended Family Members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01), 333--340. https://doi.org/10.1145/365024.365126",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Arun Nagargoje, Karl Maybach, and Tomas Sokoler. 2012. Social Yoga Mats: Designing for Exercising/Socializing Synergy. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 87--90. https://doi.org/10.1145/2148131.2148151",
      "doi": "10.1145/2148131.2148151"
    },
    {
      "text": "Louis Neven. 2010. \"But obviously not for me': robots, laboratories and the defiant identity of elder test users. Sociology of Health & Illness 32, 2: 335--347. https://doi.org/10.1111/j.1467--9566.2009.01218.x",
      "doi": ""
    },
    {
      "text": "Bernard A. Nijstad and Wolfgang Stroebe. 2006. How the Group Affects the Mind: A Cognitive Model of Idea Generation in Groups. Personality and Social Psychology Review 10, 3: 186--213. https://doi.org/10.1207/s15327957pspr1003_1",
      "doi": ""
    },
    {
      "text": "Jessica Pater, Shane Owens, Sarah Farmer, Elizabeth Mynatt, and Brad Fain. 2017. Addressing Medication Adherence Technology Needs in an Aging Population. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '17), 58--67. https://doi.org/10.1145/3154862.3154872",
      "doi": "10.1145/3154862.3154872"
    },
    {
      "text": "Paul B. Paulus and Bernard A. Nijstad. 2019. The Oxford Handbook of Group Creativity and Innovation. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1-- 12. https://doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "François Portet, Michel Vacher, Caroline Golanski, Camille Roux, and Brigitte Meillon. 2013. Design and evaluation of a smart home voice interface for the elderly: acceptability and objection aspects. Personal and Ubiquitous Computing 17, 1: 127--144. https://doi.org/10.1007/s00779-011-0470--5",
      "doi": "10.1007/s00779-011-0470-5"
    },
    {
      "text": "Alisha Pradhan, Leah Findlater, and Amanda Lazar. 2019. Phantom Friend or Just a Box with Information: Personification and Ontological Categorization of Smart Speaker-based Voice Assistants by Older Adults. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 214. https://doi.org/10.1145/3359316",
      "doi": "10.1145/3359316"
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. \"Accessibility Came by Accident\": Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 459:1--459:13. https://doi.org/10.1145/3173574.3174033",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "Yann Riche and Wendy Mackay. 2010. PeerCare: Supporting Awareness of Rhythms and Routines for Better Aging in Place. Computer Supported Cooperative Work (CSCW) 19, 1: 73--104. https://doi.org/10.1007/s10606-009--9105-z",
      "doi": "10.1007/s10606-009-9105-z"
    },
    {
      "text": "Eric F. Rietzschel, Bernard A. Nijstad, and Wolfgang Stroebe. 2006. Productivity is not enough: A comparison of interactive and nominal brainstorming groups on idea generation and selection. Journal of Experimental Social Psychology 42, 2: 244--251. https://doi.org/10.1016/j.jesp.2005.04.005",
      "doi": ""
    },
    {
      "text": "Valeria Righi, Sergio Sayago, and Josep Blat. 2017. When we talk about older people in HCI, who are we talking about? Towards a 'turn to community' in the design of technologies for a growing ageing population. International Journal of Human-Computer Studies 108: 15--31. https://doi.org/10.1016/j.ijhcs.2017.06.005",
      "doi": "10.1016/j.ijhcs.2017.06.005"
    },
    {
      "text": "Rimma Kats. 2018. Are Seniors Using Smart Speakers? - eMarketer Trends, Forecasts & Statistics. eMarketer. Retrieved September 3, 2019 from https://www.emarketer.com/content/the-smart-speakerseries-seniors-infographic",
      "doi": ""
    },
    {
      "text": "Saskia Robben, Lilian Bosch, Pascal Wiggers, Jasmien Decancq, and Marije Kanis. 2015. Managing Flexible Care with a Context Aware System for Ageing-inplace. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '15), 338--341. https://doi.org/10.5555/2826165.2826231",
      "doi": "10.5555/2826165.2826231"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L. Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 3913--3922. https://doi.org/10.1145/2556288.2557184",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "L. D. Rosen, K. Whaling, L. M. Carrier, N. A. Cheever, and J. Rokkum. 2013. The Media and Technology Usage and Attitudes Scale: An empirical investigation. Computers in Human Behavior 29, 6: 2501--2511. https://doi.org/10.1016/j.chb.2013.06.006",
      "doi": "10.1016/j.chb.2013.06.006"
    },
    {
      "text": "Jim Rowan and Elizabeth D. Mynatt. 2005. Digital Family Portrait Field Trial: Support for Aging in Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 521--530. https://doi.org/10.1145/1054972.1055044",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Niloufar Salehi and Michael S. Bernstein. 2018. Hive: Collective Design Through Network Rotation. Proc. ACM Hum.-Comput. Interact. 2, CSCW: 151:1-- 151:26. https://doi.org/10.1145/3274420",
      "doi": ""
    },
    {
      "text": "Sergio Sayago, Barbara Barbosa Neves, and Benjamin R Cowan. 2019. Voice Assistants and Older People: Some Open Issues. In Proceedings of the 1st International Conference on Conversational User Interfaces (CUI '19), 7:1--7:3. https://doi.org/10.1145/3342775.3342803",
      "doi": "10.1145/3342775.3342803"
    },
    {
      "text": "Neil Selwyn. 2004. The information aged: A qualitative study of older adults' use of information and communications technology. Journal of Aging Studies 18, 4: 369--384. https://doi.org/10.1016/j.jaging.2004.06.008",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2016. Towards an Analysis Framework of Technology Habituation by Older Users. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 1021--1033. https://doi.org/10.1145/2901790.2901806",
      "doi": "10.1145/2901790.2901806"
    },
    {
      "text": "Tim Brown. Design Thinking. Harvard Business Review 86, 6: 84.",
      "doi": ""
    },
    {
      "text": "Stephen Uzor, Lynne Baillie, and Dawn Skelton. 2012. Senior Designers: Empowering Seniors to Design Enjoyable Falls Rehabilitation Tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1179--1188. https://doi.org/10.1145/2207676.2208568",
      "doi": "10.1145/2207676.2208568"
    },
    {
      "text": "Kate Vaisutis, Margot Brereton, Toni Robertson, Frank Vetere, Jeannette Durick, Bjorn Nansen, and Laurie Buys. 2014. Invisible Connections: Investigating Older People's Emotions and Social Relations Around Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1937--1940. https://doi.org/10.1145/2556288.2557314",
      "doi": "10.1145/2556288.2557314"
    },
    {
      "text": "John Vines, Mark Blythe, Paul Dunphy, Vasillis Vlachokyriakos, Isaac Teece, Andrew Monk, and Patrick Olivier. 2012. Cheque Mates: Participatory Design of Digital Payments with Eighty Somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1189--1198. https://doi.org/10.1145/2207676.2208569",
      "doi": "10.1145/2207676.2208569"
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk, and Patrick Olivier. 2012. Questionable Concepts: Critique As Resource for Designing with Eighty Somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1169--1178. https://doi.org/10.1145/2207676.2208567",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: on how we involve people in design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 429. https://doi.org/10.1145/2470654.2470716",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Transactions on Computer-Human Interaction 22, 1: 1--27. https://doi.org/10.1145/2696867",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Alan Yusheng Wu and Cosmin Munteanu. 2018. Understanding Older Users' Acceptance of Wearable Interfaces for Sensor-based Fall Risk Assessment. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 119:1-- 119:13. https://doi.org/10.1145/3173574.3173693",
      "doi": "10.1145/3173574.3173693"
    },
    {
      "text": "Bo Xie. 2007. Information Technology Education for Older Adults as a Continuing Peer-Learning Process: A Chinese Case Study. Educational Gerontology 33, 5: 429--450. https://doi.org/10.1080/03601270701252872",
      "doi": ""
    },
    {
      "text": "2009. Team effectiveness in complex organizations: Cross-disciplinary perspectives and approaches. Routledge/Taylor & Francis Group, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "2017 Amazon Echo and Alexa for the Elderly. Techenhanced Life. Retrieved September 3, 2019 from https://www.techenhancedlife.com/explorers/amazonecho-and-alexa-elderly",
      "doi": ""
    }
  ]
}