{
  "doi": "10.1145/3313831.3376573",
  "title": "Being (In)Visible: Privacy, Transparency, and Disclosure in the Self-Management of Bipolar Disorder",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Research in personal informatics (PI) calls for systems to sup- port social forms of tracking, raising questions about how privacy can and should support intentionally sharing sensitive health information. We focus on the case of personal data related to the self-tracking of bipolar disorder (BD) in order to explore the ways in which disclosure activities intersect with other privacy experiences. While research in HCI of- ten discusses privacy as a disclosure activity, this does not reflect the ways in which privacy can be passively experienced. In this paper we broaden conceptions of privacy by defining transparency experiences and contributing factors in contrast to disclosure activities and preferences. Next, we ground this theoretical move in empirical analysis of personal narratives shared by people managing BD. We discuss the resulting emer- gent model of transparency in terms of implications for the design of socially-enabled PI systems. CAUTION: This paper contains references to experiences of mental illness, including self-harm, depression, suicidal ideation, etc.",
  "authors": [
    {
      "name": "Justin Petelka",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366341",
      "orcid": "0000-0003-2423-2079"
    },
    {
      "name": "Lucy Van Kleunen",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659462850",
      "orcid": "missing"
    },
    {
      "name": "Liam Albright",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526629",
      "orcid": "0000-0002-5067-1019"
    },
    {
      "name": "Elizabeth Murnane",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81381605773/rel-imgonly/murnane2020-for-circle.png",
      "acmid": "81381605773",
      "orcid": "missing"
    },
    {
      "name": "Stephen Voida",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81100147302/rel-imgonly/steve_-_interactions__cropped_close_.png",
      "acmid": "81100147302",
      "orcid": "missing"
    },
    {
      "name": "Jaime Snyder",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81442610059/rel-imgonly/ischool_photo_jsnyder.jpeg",
      "acmid": "81442610059",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for Privacy and Security: Understanding and Assisting Users' Choices Online. Comput. Surveys 50, 3, Article 44 (Aug. 2017), 41 pages. http://dx.doi.org/10.1145/3054926",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Irwin Altman. 1975. The Environment and Social Behavior: Privacy, Personal Space, Territory, and Crowding. Brooks/Cole, Monterey, cA, USA.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018a. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 158, 14 pages. http://dx.doi.org/10.1145/3173574.3173732",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018b. Responding to Sensitive Disclosures on Social Media: A Decision-Making Framework. ACM Trans. Comput.-Hum. Interact. 25, 6, Article 31 (Dec. 2018), 29 pages. http://dx.doi.org/10.1145/3241044",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Margaret E. Morris, and Andrea Forte. 2018. Testing Waters, Sending Clues: Indirect Disclosures of Socially Stigmatized Experiences on Social Media. Proceedings of the ACM on Human-Computer Interaction 2, CSCW, Article 19 (Nov. 2018), 23 pages. http://dx.doi.org/10.1145/3274288",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Jodi Aronson. 1995. A pragmatic view of thematic analysis. The Qualitative Report 2, 1 (1995), 1--3.",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus. 2012. The mismeasurement of privacy: Using contextual integrity to reconsider privacy in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 367--376. http://dx.doi.org/10.1145/2207676.2207727",
      "doi": "10.1145/2207676.2207727"
    },
    {
      "text": "Toby Beauchamp. 2009. Artful concealment and strategic visibility: Transgender bodies and US state surveillance after 9/11. Surveillance & Society 6, 4 (2009), 356--366. http://dx.doi.org/10.24908/ss.v6i4.3267",
      "doi": ""
    },
    {
      "text": "Geoffrey C. Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/380681"
    },
    {
      "text": "danah boyd. 2007. Why youth (heart) social network sites: The role of networked publics in teenage social life. MacArthur Foundation series on digital learning--Youth, identity, and digital media volume 119 (2007), 142. https://ssrn.com/abstract=1518924",
      "doi": ""
    },
    {
      "text": "Dale E. Brashers, Daena J. Goldsmith, and Elaine Hsieh. 2006. Information Seeking and Avoiding in Health Contexts . Human Communication Research 28, 2 (01 2006), 258--271. http://dx.doi.org/10.1111/j.1468--2958.2002.tb00807.x",
      "doi": ""
    },
    {
      "text": "Simone Browne. 2015. Dark matters: On the surveillance of blackness. Duke University Press, Durham, NC, USA.",
      "doi": ""
    },
    {
      "text": "John Cheney-Lippold. 2018. We are data: Algorithms and the making of our digital selves. NYU Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A. Munson. 2017. When Personal Tracking Becomes Social: Examining the Use of Instagram for Healthy Eating. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1674--1687. http://dx.doi.org/10.1145/3025453.3025747",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "Chia-Fang Chung, Kristin Dew, Allison Cole, Jasmine Zia, James Fogarty, Julie A. Kientz, and Sean A. Munson. 2016. Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 770--786. http://dx.doi.org/10.1145/2818048.2819926",
      "doi": ""
    },
    {
      "text": "Julie E. Cohen. 2012. What privacy is for. Harvard Law Review 126 (2012), 1904.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Peter Roessler, and Brett E. Shelton. 2004. The CareNet display: lessons learned from an in home evaluation of an ambient display. In Proceedings of the 6th International Conference on Ubiquitous Computing (UbiComp `04). Springer, Berlin, 1--17. https://dx.doi.org/10.1007/978--3--540--30119--6_1",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor and Simson Garfinkel. 2005. Security and usability: Designing secure systems that people can use. O'Reilly, Sebastopol, CA, USA.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. In Proceedings of the 8th International AAAI Conference on Weblogs and Social Media (ICWSM 2014). AAAI Press, Palo Alto, CA, USA, 71--80. https://www.aaai.org/ocs/index.php/ICWSM/ICWSM14/paper/view/8075",
      "doi": ""
    },
    {
      "text": "Kirk D. Denicoff, Gabriele S. Leverich, William A. Nolen, A. John Rush, Susan L. McElroy, Paul E. Keck, Trisha Suppes, Lori L. Altshuler, Ralph Kupka, Mark A. Frye, J. Hatef, M. A. Brotman, and Robert M. Post. 2000. Validation of the prospective NIMH-Life-Chart Method (NIMH-LCM-p) for longitudinal assessment of bipolar disorder. Psychological Medicine 30, 6 (2000), 1391--1397. http://dx.doi.org/10.1017/s0033291799002810",
      "doi": ""
    },
    {
      "text": "Tamara Dinev and Paul Hart. 2006. An Extended Privacy Calculus Model for E-Commerce Transactions. Information Systems Research 17, 1 (2006), 61--80. http://dx.doi.org/10.1287/isre.1060.0080",
      "doi": "10.1287/isre.1060.0080"
    },
    {
      "text": "Paul Dourish and Ken Anderson. 2006. Collective Information Practice: Exploring Privacy and Security as Social and Cultural Phenomena. Human-Computer Interaction 21, 3 (2006), 319--342. http://dx.doi.org/10.1207/s15327051hci2103_2",
      "doi": "10.1207/s15327051hci2103_2"
    },
    {
      "text": "Daniel A. Epstein, Alan Borning, and James Fogarty. 2013. Fine-grained Sharing of Sensed Physical Activity: A Value Sensitive Approach. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 489--498. http://dx.doi.org/10.1145/2493432.2493433",
      "doi": "10.1145/2493432.2493433"
    },
    {
      "text": "Daniel A. Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 667--676. http://dx.doi.org/10.1145/2598510.2598558",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015a. From “Nobody Cares” to “Way to Go!”: A Design Framework for Social Sharing in Personal Informatics. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1622--1636. http://dx.doi.org/10.1145/2675133.2675135",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015b. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 731--742. http://dx.doi.org/10.1145/2750858.2804250",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Mike Y. Chen, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2007. MyExperience: A System for in Situ Tracing and Capturing of User Feedback on Mobile Phones. In Proceedings of the 5th International Conference on Mobile Systems, Applications and Services (MobiSys '07). ACM, New York, NY, USA, 57--70. http://dx.doi.org/10.1145/1247660.1247670",
      "doi": ""
    },
    {
      "text": "John J. Gumperz. 1982. Discourse strategies. Vol. 1. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Nikki Hayfield, Victoria Clarke, and Emma Halliwell. 2014. Bisexual women's understandings of social marginalisation: `The heterosexuals don't understand us but nor do the lesbians'. Feminism & Psychology 24, 3 (2014), 352--372. http://dx.doi.org/10.1177/0959353514539651",
      "doi": ""
    },
    {
      "text": "Barbara Johnstone. 2008. Discourse Analysis (3rd ed.). Blackwell, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Adam N. Joinson and Carina B. Paine. 2009. Self-disclosure, privacy and the Internet. The Oxford Handbook of Internet Psychology 2374252 (2009), 237--252. http://dx.doi.org/10.1093/oxfordhb/9780199561803.013.0016",
      "doi": ""
    },
    {
      "text": "David A. Kahn, Gary S. Sachs, David J. Printz, Daniel Carpenter, John P. Docherty, and Ruth Ross. 2000. Medication treatment of bipolar disorder 2000: A summary of the expert consensus guidelines. Journal of Psychiatric Practice 6, 4 (2000), 197--211. http://dx.doi.org/10.1097/00131746--200007000-00004",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, and Sara Kiesler. 2013. Why Do People Seek Anonymity on the Internet?: Informing Policy and Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2657--2666. http://dx.doi.org/10.1145/2470654.2481368",
      "doi": "10.1145/2470654.2481368"
    },
    {
      "text": "Elisabeth Kersten-van Dijk and Wijnand A Ijsselsteijn. 2016. Design Beyond the Numbers: Sharing, Comparing, Storytelling and the Need for a Quantified Us. Interaction Design and Architecture(s) 29 (2016), 121--135.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Eric P. S. Baumer, Dan Cosley, Stephen Voida, and Geri Gay. 2013. “Everybody Knows What You're Doing”: A Critical Design Approach to Personal Informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3403--3412. http://dx.doi.org/10.1145/2470654.2466467",
      "doi": "10.1145/2470654.2466467"
    },
    {
      "text": "Nima Kordzadeh, John Warren, and Ali Seifi. 2016. Antecedents of privacy calculus components in virtual health communities. International Journal of Information Management 36, 5 (2016), 724 -- 734. http://dx.doi.org/10.1016/j.ijinfomgt.2016.04.015",
      "doi": "10.1016/j.ijinfomgt.2016.04.015"
    },
    {
      "text": "Robert S. Laufer and Maxine Wolfe. 1977. Privacy as a Concept and a Social Issue: A Multidimensional Developmental Theory. Journal of Social Issues 33, 3 (1977), 22--42. http://dx.doi.org/10.1111/j.1540--4560.1977.tb01880.x",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 557--566. http://dx.doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Catherine A. Lugg. 2016. US Public Schools and the Politics of Queer Erasure. Palgrave Macmillan, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Mary Madden, Michele Gilman, Karen Levy, and Alice Marwick. 2017. Privacy, poverty, and big data: A matrix of vulnerabilities for poor Americans. Washington University Law Review 95 (2017), 53. https://ssrn.com/abstract=2930247",
      "doi": ""
    },
    {
      "text": "Michelle Madejski, Maritza Johnson, and Steven M. Bellovin. 2012. A study of privacy settings errors in an online social network. In 2012 IEEE International Conference on Pervasive Computing and Communications Workshops. IEEE, Piscataway, NJ, USA, 340--345. http://dx.doi.org/10.1109/PerComW.2012.6197507",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff, Susan R Fussell, Tawanna Dillahunt, Rachel Glaves, Catherine Grevet, Michael Johnson, Deanna Matthews, H Scott Matthews, Robert McGuire, Robert Thompson, and others. 2010. StepGreen.org: Increasing energy saving behaviors via social networks. In Fourth International AAAI Conference on Weblogs and Social Media. AAAI Press, Palo Alto, CA, USA, 106--113. https://www.aaai.org/ocs/index.php/ICWSM/ICWSM10/paper/view/1474",
      "doi": ""
    },
    {
      "text": "Emily Martin. 2009. Bipolar expeditions: Mania and depression in American culture. Princeton University Press, Princeton, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Mark Matthews, Elizabeth L. Murnane, and Jaime Snyder. 2017a. Quantifying the Changeable Self: The Role of Self-Tracking in Coming to Terms With and Managing Bipolar Disorder. Human-Computer Interaction 32, 5--6 (2017), 413--446. http://dx.doi.org/10.1080/07370024.2017.1294983",
      "doi": "10.1080/07370024.2017.1294983"
    },
    {
      "text": "Mark Matthews, Elizabeth L. Murnane, Jaime Snyder, Shion Guha, Pamara Chang, Gavin Doherty, and Geri Gay. 2017b. The double-edged sword: A mixed methods study of the interplay between bipolar disorder and technology use. Computers in Human Behavior 75 (2017), 288--300. http://dx.doi.org/10.1016/j.chb.2017.05.009",
      "doi": "10.1016/j.chb.2017.05.009"
    },
    {
      "text": "Sean A. Munson, Hasan Cavusoglu, Larry Frisch, and Sidney Fels. 2013. Sociotechnical Challenges and Progress in Using Social Media for Health. Journal of Medical Internet Research 15, 10, Article e226 (22 Oct 2013), 14 pages. http://dx.doi.org/10.2196/jmir.2792",
      "doi": ""
    },
    {
      "text": "Elizabeth L. Murnane, Dan Cosley, Pamara Chang, Shion Guha, Ellen Frank, Geri Gay, and Mark Matthews. 2016. Self-monitoring practices, attitudes, and needs of individuals with bipolar disorder: implications for the design of technologies to manage mental health . Journal of the American Medical Informatics Association 23, 3 (01 2016), 477--484. http://dx.doi.org/10.1093/jamia/ocv165",
      "doi": ""
    },
    {
      "text": "Elizabeth L. Murnane, Tara G. Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal informatics in interpersonal contexts: Towards the design of technology that supports the social ecologies of long-term mental health management. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 127. http://dx.doi.org/10.1145/3274396",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's not that I don't have problems, I'm just not putting them on Facebook: Challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 341--350. http://dx.doi.org/10.1145/1958824.1958876",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington Law Review 79 (2004), 119.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in Context: Technology, Policy, and the Integrity of Social Life. Stanford University Press, Palo Alto, CA, USA.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Kathleen O'Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1470--1484. http://dx.doi.org/10.1145/2998181.2998349",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Kathleen O'Leary, Stephen M. Schueller, Jacob O. Wobbrock, and Wanda Pratt. 2018. “Suddenly, We Got to Become Therapists for Each Other”: Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 331, 14 pages. http://dx.doi.org/10.1145/3173574.3173905",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking privacy for a networked world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI `03). ACM, New York, NY, USA, 129--136. http://dx.doi.org/10.1145/642611.642635",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Dilisha Patel, Ann Blandford, Mark Warner, Jill Shawe, and Judith Stephenson. 2019. “I Feel Like Only Half a Man”: Online Forums As a Resource for Finding a “New Normal” for Men Experiencing Fertility Issues. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 82 (Nov. 2019), 20 pages. http://dx.doi.org/10.1145/3359184",
      "doi": "10.1145/3359184"
    },
    {
      "text": "Sai Teja Peddinti, Keith W. Ross, and Justin Cappos. 2014. “On the Internet, Nobody Knows You're a Dog”: A Twitter Case Study of Anonymity in Social Networks. In Proceedings of the Second ACM Conference on Online Social Networks (COSN '14). ACM, New York, NY, USA, 83--94. http://dx.doi.org/10.1145/2660460.2660467",
      "doi": "10.1145/2660460.2660467"
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 45, 14 pages. http://dx.doi.org/10.1145/3290605.3300275",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A Munson, James Fogarty, and Julie A. Kientz. 2017. From personal informatics to family informatics: Understanding family practices around health monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 2300--2315. http://dx.doi.org/10.1145/2998181.2998362",
      "doi": ""
    },
    {
      "text": "Rhys Price-Robertson, Angela Obradovic, and Brad Morgan. 2017. Relational recovery: beyond individualism in the recovery approach. Advances in Mental Health 15 (2017), 108--120.Issue 2. http://dx.doi.org/10.1080/18387357.2016.1243014",
      "doi": ""
    },
    {
      "text": "Amon Rapp and Federica Cena. 2016. Personal informatics for everyday life: How users without prior self-tracking experience engage with personal data. International Journal of Human-Computer Studies 94 (Oct. 2016), 1--17. http://dx.doi.org/10.1016/j.ijhcs.2016.05.006",
      "doi": "10.1016/j.ijhcs.2016.05.006"
    },
    {
      "text": "Juana Mar'ia Rodr'iguez. 2016. Queer Politics, Bisexual Erasure: Sexuality at the Nexus of Race, Gender, and Statistics. lambda nordica 21, 1--2 (2016), 169--182. https://escholarship.org/uc/item/8hv987pn",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI `14). ACM, New York, NY, USA, 1163--1172. http://dx.doi.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Ravi S. Sandhu, Edward J. Coyne, Hal L. Feinstein, and Charles E. Youman. 1996. Role-Based Access Control Models. Computer 29, 2 (Feb. 1996), 38--47. http://dx.doi.org/10.1109/2.485845",
      "doi": "10.1109/2.485845"
    },
    {
      "text": "Shruti Sannon, Elizabeth L. Murnane, Natalya N. Bazarova, and Geri Gay. 2019. “I was really, really nervous posting it”: Communicating about Invisible Chronic Illnesses across Social Media Platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 353. http://dx.doi.org/10.1145/3290605.3300583",
      "doi": "10.1145/3290605.3300583"
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L. Durity, and Lorrie Faith Cranor. 2015a. A Design Space for Effective Privacy Notices. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015). USENIX Association, Ottawa, 1--17. https://www.usenix.org/conference/soups2015/proceedings/presentation/schaub",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Bastian Könings, and Michael Weber. 2015b. Context-Adaptive Privacy: Leveraging Context Awareness to Support Privacy Decision Making. IEEE Pervasive Computing 14, 1 (Jan 2015), 34--43. http://dx.doi.org/10.1109/MPRV.2015.5",
      "doi": "10.1109/MPRV.2015.5"
    },
    {
      "text": "Jamie Scot. 2014. A Revisionist History: How Archives are Used to Reverse the Erasure of Queer People in Contemporary History. QED: A Journal in GLBTQ Worldmaking 1, 2 (2014), 205--209. http://dx.doi.org/10.14321/qed.1.2.0205",
      "doi": ""
    },
    {
      "text": "HongHai Shen and Prasun Dewan. 1992. Access Control for Collaborative Environments. In Proceedings of the 1992 ACM Conference on Computer-supported Cooperative Work (CSCW '92). ACM, New York, NY, USA, 51--58. http://dx.doi.org/10.1145/143457.143461",
      "doi": "10.1145/143457.143461"
    },
    {
      "text": "Jaime Snyder, Elizabeth L. Murnane, Caitie Lustig, and Stephen Voida. 2019. Visually Encoding the Lived Experience of Bipolar Disorder. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 133. http://dx.doi.org/10.1145/3290605.3300363",
      "doi": "10.1145/3290605.3300363"
    },
    {
      "text": "Trisha Suppes, Gabriele S. Leverich, Paul E. Keck Jr, Willem A. Nolen, Kirk D. Denicoff, Lori L. Altshuler, Susan L. McElroy, A. John Rush, Ralph Kupka, Mark A. Frye, Maia Bickel, and Robert M. Post. 2001. The Stanley Foundation Bipolar Treatment Outcome Network: II. demographics and illness characteristics of the first 261 patients. Journal of Affective Disorders 67, 1--3 (2001), 45--59. http://dx.doi.org/10.1016/S0165-0327(01)00432--3",
      "doi": ""
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A Field Trial of Privacy Nudges for Facebook. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2367--2376. http://dx.doi.org/10.1145/2556288.2557413",
      "doi": "10.1145/2556288.2557413"
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Kevin Scott, Xiaoxuan Chen, Alessandro Acquisti, and Lorrie Faith Cranor. 2013. Privacy Nudges for Social Media: An Exploratory Facebook Study. In Proceedings of the 22nd International Conference on World Wide Web (WWW '13 Companion). ACM, New York, NY, USA, 763--770. http://dx.doi.org/10.1145/2487788.2488038",
      "doi": "10.1145/2487788.2488038"
    },
    {
      "text": "Mark Warner, Juan F. Maestre, Jo Gibbs, Chia-Fang Chung, and Ann Blandford. 2019. Signal Appropriation of Explicit HIV Status Disclosure Fields in Sex-Social Apps Used by Gay and Bisexual Men. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 692, 15 pages. http://dx.doi.org/10.1145/3290605.3300922",
      "doi": "10.1145/3290605.3300922"
    },
    {
      "text": "Peter West, Max Van Kleek, Richard Giordano, Mark J. Weal, and Nigel Shadbolt. 2018. Common Barriers to the Use of Patient-Generated Data Across Clinical Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 484, 13 pages. http://dx.doi.org/10.1145/3173574.3174058",
      "doi": "10.1145/3173574.3174058"
    },
    {
      "text": "Xuan Zhao, Cliff Lampe, and Nicole B Ellison. 2016. The social media ecology: User perceptions, strategies and challenges. In Proceedings of the 2016 SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 89--100. http://dx.doi.org/10.1145/2858036.2858333",
      "doi": "10.1145/2858036.2858333"
    }
  ]
}