{
  "doi": "10.1145/3313831.3376138",
  "title": "Mouillé: Exploring Wetness Illusion on Fingertips to Enhance Immersive Experience in VR",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "Providing users with rich sensations is beneficial to enhance their immersion in Virtual Reality (VR) environments. Wetness is one such imperative sensation that affects users' sense of comfort and helps users adjust grip force when interacting with objects. Researchers have recently begun to explore ways to create wetness illusions, primarily on a user's face or body skin. In this work, we extended this line of research by creating wetness illusion on users' fingertips. We first conducted a user study to understand the effect of thermal and tactile feedback on users' perceived wetness sensation. Informed by the findings, we designed and evaluated a prototype---Mouillé---that provides various levels of wetness illusions on fingertips for both hard and soft items when users squeeze, lift, or scratch it. Study results indicated that users were able to feel wetness with different levels of temperature changes and they were able to distinguish three levels of wetness for simulated VR objects. We further presented applications that simulated an ice cube, an iced cola bottle, and a wet sponge, etc, to demonstrate its use in VR.",
  "tags": [
    "prototype",
    "user study",
    "virtual reality",
    "wetness illusion"
  ],
  "authors": [
    {
      "name": "Teng Han",
      "institution": "Institute of Software, Chinese Academy of Sciences & University of Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488652855",
      "orcid": "missing"
    },
    {
      "name": "Sirui Wang",
      "institution": "Institute of Software, Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528525",
      "orcid": "missing"
    },
    {
      "name": "Sijia Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528524",
      "orcid": "missing"
    },
    {
      "name": "Xiangmin Fan",
      "institution": "Institute of Software, Chinese Academy of Sciences & University of Chinese Academy of Sciences, Beijing, China",
      "img": "/do/10.1145/contrib-99659261665/rel-imgonly/20191207163100.jpg",
      "acmid": "99659261665",
      "orcid": "missing"
    },
    {
      "name": "Jie Liu",
      "institution": "Institute of Software, Chinese Academy of Sciences & University of Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659275888",
      "orcid": "missing"
    },
    {
      "name": "Feng Tian",
      "institution": "Institute of Software, Chinese Academy of Sciences & University of Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106876",
      "orcid": "0000-0002-6598-419X"
    },
    {
      "name": "Mingming Fan",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-81482645714/rel-imgonly/official-photo-rit-mingming-fan.jpg",
      "acmid": "81482645714",
      "orcid": "0000-0002-0356-4712"
    }
  ],
  "references": [
    {
      "text": "Thibaut André, Philippe Lefèvre, and Jean-Louis Thonnard. 2009. Fingertip moisture is optimally modulated during object manipulation. Journal of neurophysiology 103, 1 (2009), 402--408.",
      "doi": ""
    },
    {
      "text": "Thibaut André, V Lévesque, V Hayward, Philippe Lefèvre, and J-L Thonnard. 2011. Effect of skin hydration on the dynamics of fingertip gripping contact. Journal of The Royal Society Interface 8, 64 (2011), 1574--1583.",
      "doi": ""
    },
    {
      "text": "Hong-Yu Chang, Wen-Jie Tseng, Chia-En Tsai, Hsin-Yu Chen, Roshan Lalintha Peiris, and Liwei Chan. 2018. FacePush: Introducing Normal Force on Face with Head-Mounted Displays. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 927--935. DOI: http://dx.doi.org/10.1145/3242587.3242588",
      "doi": "10.1145/3242587.3242588"
    },
    {
      "text": "Kam-Hong Chau, Ka-Po Maggie Tang, and Chi-Wai Kan. 2018. Subjective wet perception assessment of fabrics with different drying time. Royal Society open science 5, 8 (2018), 180798.",
      "doi": ""
    },
    {
      "text": "Zikun Chen, Wei Peng, Roshan Peiris, and Kouta Minamizawa. 2017. ThermoReality: Thermally enriched head mounted displays for virtual reality. In 44th International Conference on Computer Graphics and Interactive Techniques, ACM SIGGRAPH 2017. Association for Computing Machinery, Inc, a32.",
      "doi": "10.1145/3102163.3102222"
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic turk: a motion platform based on people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3463--3472.",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "RP Clark and Otto Gustaf Edholm. 1985. Man and his thermal environment. Arnold London.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Juliette Unwin, and Katherine J Kuchenbecker. 2014. Modeling and rendering realistic textures from unconstrained tool-surface interactions. IEEE transactions on haptics 7, 3 (2014), 381--393.",
      "doi": ""
    },
    {
      "text": "Victor Adriel de Jesus Oliveira, Luciana Nedel, Anderson Maciel, and Luca Brayda. 2016. Localized magnification in vibrotactile HMDs for accurate spatial awareness. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 55--64.",
      "doi": ""
    },
    {
      "text": "S Derler and G-M Rotaru. 2013. Stick--slip phenomena in the friction of human skin. Wear 301, 1--2 (2013), 324--329.",
      "doi": ""
    },
    {
      "text": "Davide Filingeri and Rochelle Ackerley. 2017. The biology of skin wetness perception and its implications in manual function and for reproducing complex somatosensory signals in neuroprosthetics. Journal of neurophysiology 117, 4 (2017), 1761--1775.",
      "doi": ""
    },
    {
      "text": "Davide Filingeri, Damien Fournet, Simon Hodder, and George Havenith. 2014. Why wet feels wet? A neurophysiological model of human cutaneous wetness sensitivity. Journal of neurophysiology 112, 6 (2014), 1457--1469.",
      "doi": ""
    },
    {
      "text": "Davide Filingeri, Bernard Redortier, Simon Hodder, and George Havenith. 2013. The role of decreasing contact temperatures and skin cooling in the perception of skin wetness. Neuroscience letters 551 (2013), 65--69.",
      "doi": ""
    },
    {
      "text": "James J Gibson. 1962. Observations on active touch. Psychological review 69, 6 (1962), 477.",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C Peck. 2018. Avatar embodiment. towards a standardized questionnaire. Frontiers in Robotics and AI 5 (2018), 74.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. Gyrovr: Simulating inertia in virtual reality using head worn flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 227--232.",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor's hammer: An ungrounded force feedback device utilizing propeller-induced propulsive force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 525.",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Susan J Lederman. 1981. The perception of surface roughness by active and passive touch. Bulletin of the Psychonomic Society 18, 5 (1981), 253--255.",
      "doi": ""
    },
    {
      "text": "Jaeyeon Lee, Mike Sinclair, Mar Gonzalez-Franco, Eyal Ofek, and Christian Holz. 2019. TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 71.",
      "doi": "10.1145/3290605.3300301"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating physical impact by combining tactile stimulation with electrical muscle stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 11--19.",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding force feedback to mixed reality experiences and games using electrical muscle stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 446.",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Ellen A Lumpkin and Michael J Caterina. 2007. Mechanisms of sensory transduction in the skin. Nature 445, 7130 (2007), 858.",
      "doi": ""
    },
    {
      "text": "Shogo Okamoto, Hikaru Nagano, and Yoji Yamada. 2012. Psychophysical dimensions of tactile perception of textures. IEEE Transactions on Haptics 6, 1 (2012), 81--93.",
      "doi": "10.1109/TOH.2012.32"
    },
    {
      "text": "Roshan Lalintha Peiris, Liwei Chan, and Kouta Minamizawa. 2018. LiquidReality: wetness sensations on the face for virtual reality. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 366--378.",
      "doi": ""
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, Liwei Chan, and Kouta Minamizawa. 2017. Thermovr: Exploring integrated thermal haptic feedback with head mounted displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5452--5456.",
      "doi": "10.1145/3025453.3025824"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: enhancing sense of presence in virtual reality by simulating real-world environmental conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1731--1742.",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Nguyen Thi Ngoc Tram, Koon Chuan Raymond Koh, David Tolley, Shienny Karwita, Lin Lien-Ya, Yan Liangkun, Kala Shamaiah, Chow Eason Wai Tung, Ching Chiuan Yen, and Ellen Yi-Luen Do. 2018. Season Traveller: Multisensory Narration for Enhancing the Virtual Reality Experience. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 577, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174151",
      "doi": "10.1145/3173574.3174151"
    },
    {
      "text": "P Saels, Jean-Louis Thonnard, Christine Detrembleur, and AM Smith. 1999. Impact of the surface slipperiness of grasped objects on their subsequent acceleration. Neuropsychologia 37, 6 (1999), 751--756.",
      "doi": ""
    },
    {
      "text": "Mai Shibahara and Katsunari Sato. 2019. Illusion of wetness by dynamic touch. IEEE Transactions on Haptics (2019), 1--1. DOI: http://dx.doi.org/10.1109/TOH.2019.2919575",
      "doi": "10.1109/TOH.2019.2919575"
    },
    {
      "text": "Kenichiro Shirota, Makoto Uju, Roshan Peiris, and Kouta Minamizawa. 2018. Liquid-VR-Wetness Sensations for Immersive Virtual Reality Experiences. In International AsiaHaptics conference. Springer, 252--255.",
      "doi": ""
    },
    {
      "text": "AM Smith, Geneviève Cadoret, and Dominic St-Amour. 1997. Scopolamine increases prehensile force during object manipulation by reducing palmar sweating and decreasing skin friction. Experimental brain research 114, 3 (1997), 578--583.",
      "doi": ""
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3 (1998), 225--240.",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Kening Zhu, Simon Perrault, Taizhou Chen, Shaoyu Cai, and Roshan Lalintha Peiris. 2019. A sense of ice and fire: Exploring thermal feedback with multiple thermoelectric-cooling elements on a smart ring. International Journal of Human-Computer Studies 130 (2019), 234--247.",
      "doi": "10.1016/j.ijhcs.2019.07.003"
    }
  ]
}