{
  "doi": "10.1145/3313831.3376188",
  "title": "Tricks and Treats: Designing Technology to Support Mobility Assistance Dogs",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Assistance dogs are a key intervention to support the autonomy of people with tetraplegia. Previous research on assistive technologies have investigated ways to, ultimately, replace their labour using technology, for instance through the design of smart home environments. However, both the disability studies literature and our interviews suggest there is an immediate need to support these relationships, both in terms of training and bonding. Through a case study of an accessible dog treats dispenser, we investigate a technological intervention responding to these needs, detailing an appropriate design methodology and contributing insights into user requirements and preferences.",
  "authors": [
    {
      "name": "Charlotte Robinson",
      "institution": "University of Sussex, Falmer, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959312357",
      "orcid": "missing"
    },
    {
      "name": "Emeline Brulé",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658765641",
      "orcid": "missing"
    },
    {
      "name": "James Jackson",
      "institution": "University of Sussex, Falmer, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528122",
      "orcid": "missing"
    },
    {
      "name": "Alice Torjussen",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659358456",
      "orcid": "missing"
    },
    {
      "name": "Joshua Kybett",
      "institution": "University of Sussex, Falmer, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659454507",
      "orcid": "missing"
    },
    {
      "name": "Tom Appshaw",
      "institution": "University of Sussex, Falmer, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529242",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "California Service Dog Academy. 2019. About Us. (2019). https://californiaservicedogacademy.org/about-us/",
      "doi": ""
    },
    {
      "text": "Hilary M. Audrestch, Chantelle T. Whelan, David Grice, Lucy Asher, Gary C.W. England, and Sarah L. Freeman. 2015. Recognizing the value of assistance dogs in society. Disability and health journal 8, 4 (2015), 469--474.",
      "doi": ""
    },
    {
      "text": "Emily J. Blackwell, Caroline Twells, Anne Seawright, and Rachel A. Casey. 2008. The relationship between training methods and the occurrence of behavior problems, as reported by owners, in a population of domestic dogs. Journal of Veterinary Behavior 3, 5 (2008), 207--217.",
      "doi": ""
    },
    {
      "text": "Simon Bowen. 2010. Critical theory and participatory design. In Proceedings of CHI. Citeseer, 10--15.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Annika Bremhorst, Paolo Mongillo, Tiffani Howell, and Lieta Marinelli. 2018. Spotlight on Assistance Dogs-Legislation, Welfare and Research. Animals 8, 8 (2018), 129.",
      "doi": ""
    },
    {
      "text": "Emeline Brulé. 2016. Playing Music with the Head. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 339--340.",
      "doi": "10.1145/2982142.2982146"
    },
    {
      "text": "Michael Bui. 2019. Empathic Techniques for Co-Design with Spinal Muscular Atrophy Type II. B.S. thesis. University of Twente.",
      "doi": ""
    },
    {
      "text": "Héctor A. Caltenco, Lotte N.S. Andreasen Struijk, and Björn Breidegard. 2010. TongueWise: Tongue-computer interface software for people with tetraplegia. In 2010 Annual International Conference of the IEEE Engineering in Medicine and Biology. IEEE, 4534--4537.",
      "doi": ""
    },
    {
      "text": "Mary Michelle Camp. 2001. The use of service dogs as an adaptive strategy: A qualitative study. American Journal of Occupational Therapy 55, 5 (2001), 509--517.",
      "doi": ""
    },
    {
      "text": "Patrick Carrington, Amy Hurst, and Shaun K. Kane. 2014. Wearables and chairables: inclusive design of mobile input and output techniques for power wheelchair users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3103--3112.",
      "doi": ""
    },
    {
      "text": "Marie Chan, Eric Campo, Daniel Estève, and Jean-Yves Fourniols. 2009. Smart homes-current features and future perspectives. Maturitas 64, 2 (2009), 90--97.",
      "doi": ""
    },
    {
      "text": "C Chandramouli and Vivek Agarwal. 2009. Speech recognition based computer keyboard replacement for the Quadriplegics, Paraplegics, paralytics and amputees. In 2009 IEEE International Workshop on Medical Measurements and Applications. IEEE, 241--245.",
      "doi": "10.1109/MEMEA.2009.5167993"
    },
    {
      "text": "CleverPet. 2019. CleverPet: Exercise your pet's mind and body. (2019). https://clever.pet/",
      "doi": ""
    },
    {
      "text": "Deborah J. Dalziel, Basim M. Uthman, Susan P. Mcgorray, and Roger L. Reep. 2003. Seizure-alert dogs: a review and preliminary study. Seizure 12, 2 (2003), 115--120.",
      "doi": ""
    },
    {
      "text": "Pete Denman, Lama Nachman, and Sai Prasad. 2016. Designing for a user: Stephen Hawking's UI. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops-Volume 2. ACM, 94--95.",
      "doi": "10.1145/2948076.2948112"
    },
    {
      "text": "Jane Eddy, Lynette A. Hart, and Ronald P. Boltz. 1988. The effects of service dogs on social acknowledgments of people in wheelchairs. The Journal of psychology 122, 1 (1988), 39--45.",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 1988. Work-oriented design of computer artifacts. Ph.D. Dissertation. Arbetslivscentrum.",
      "doi": "10.5555/1102017"
    },
    {
      "text": "The Guide Dogs for the Blind Association. 2019. Training With A Guide Dog. (2019). https://www.guidedogs.org.uk/services-we-provide/guide-dogs/ training-with-a-guide-dog#how-are-guide-dogs-trained",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Julia Makhaeva, and Katharina Spiel. 2017. Blending methods: Developing participatory design sessions for autistic children. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 39--49.",
      "doi": "10.1145/3078072.3079727"
    },
    {
      "text": "Larry Freil, Ceara Byrne, Giancarlo Valentin, Clint Zeagler, David Roberts, Thad Starner, Melody Jackson, and others. 2017. Canine-centered computing. Foundations and Trends® in Human--Computer Interaction 10, 2 (2017), 87--164.",
      "doi": ""
    },
    {
      "text": "Fiona French, Clara Mancini, and Helen Sharp. 2016. Exploring methods for interaction design with animals: a case-study with Valli. In ACI'16: Proceedings of the Third International Conference on Animal-Computer Interaction. ACM.",
      "doi": "10.1145/2995257.2995394"
    },
    {
      "text": "Megumi Fukuzawa and Naomi Hayashi. 2013. Comparison of 3 different reinforcements of learning in dogs (Canis familiaris). Journal of Veterinary Behavior: Clinical Applications and Research 8, 4 (2013), 221--224.",
      "doi": ""
    },
    {
      "text": "Furbo. 2019. Furbo Dog Camera UK | Treat-tossing Pet Camera with HD Cam, 2 Way Audio Barking Alert. (2019). https://shopuk.furbo.com/",
      "doi": ""
    },
    {
      "text": "Monica Gori, Giulia Cappagli, Alessia Tonelli, Gabriel Baud-Bovy, and Sara Finocchietti. 2016. Devices for visually impaired people: High technological devices with low user acceptance and no adaptability for children. Neuroscience & Biobehavioral Reviews 69 (2016), 79--88.",
      "doi": ""
    },
    {
      "text": "Peter Gyory, Clement Zheng, Daniel Leithinger, and Ellen Yi-Luen Do. 2019. HOT SWAP: Probing Embodied Game Interfaces With Reconfigurable Controllers. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion. ACM, 183--187.",
      "doi": "10.1145/3301019.3323901"
    },
    {
      "text": "K. Whalley Hammell. 2004. Exploring quality of life following high spinal cord injury: a review and critique. Spinal cord 42, 9 (2004), 491.",
      "doi": ""
    },
    {
      "text": "E.F. Hiby, N.J. Rooney, and J.W.S. Bradshaw. 2004. Dog training methods: their use, effectiveness and interaction with behaviour and welfare. Animal Welfare 13, 1 (2004), 63--70.",
      "doi": ""
    },
    {
      "text": "Steve Holburn, Dong Nguyen, and Peter M Vietze. 2004. Computer-assisted learning for adults with profound multiple disabilities. Behavioral Interventions 19, 1 (2004), 25--37.",
      "doi": ""
    },
    {
      "text": "Catherine Holloway. 2019. Disability interaction (DIX): a manifesto. interactions 26, 2 (2019), 44--49.",
      "doi": "10.1145/3310322"
    },
    {
      "text": "Geoffroy Hubert, Michel Tousignant, Fran Routhier, Helene Corriveau, and others. 2013. Effect of service dogs on manual wheelchair users with spinal cord injury: A pilot study. Journal of Rehabilitation Research & Development 50, 3 (2013).",
      "doi": ""
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. ACM, 11--18.",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Mikko Kannisto, Juhani Merikanto, Hannu Alaranta, Hannele Hokkanen, and Harri Sintonen. 1998. Comparison of health-related quality of life in three subgroups of spinal cord injury patients. Spinal cord 36, 3 (1998), 193.",
      "doi": ""
    },
    {
      "text": "Joseph 'Jofish' Kaye. 2007. Evaluating experience-focused HCI. In CHI'07 extended abstracts on Human factors in computing systems. ACM, 1661--1664.",
      "doi": "10.1145/1240866.1240962"
    },
    {
      "text": "Bret Kinsella and Ava Mutchler. 2018. Smart speaker consumer adoption report. Voicebot. ai March (2018).",
      "doi": ""
    },
    {
      "text": "S Eben Kirksey and Stefan Helmreich. 2010. The emergence of multispecies ethnography. Cultural anthropology 25, 4 (2010), 545--576.",
      "doi": ""
    },
    {
      "text": "DR Lane, June McNicholas, and Glynn M Collis. 1998. Dogs for the disabled: benefits to recipients and welfare of the dog. Applied Animal Behaviour Science 59, 1--3 (1998), 49--60.",
      "doi": ""
    },
    {
      "text": "Jacob Logas, Will Mitchell, Monira Khan, Lorita Freeman, Clint Zeagler, and Melody Moore Jackson. 2018. A toolkit for animal touchscreen slider design. In Proceedings of the Fifth International Conference on Animal-Computer Interaction. ACM, 13.",
      "doi": "10.1145/3295598.3295611"
    },
    {
      "text": "Clara Mancini. 2011. Animal-computer interaction (ACI): a manifesto. interactions 18, 4 (2011), 69--73.",
      "doi": ""
    },
    {
      "text": "Clara Mancini. 2017. Towards an animal-centred ethics for Animal--Computer Interaction. International Journal of Human-Computer Studies 98 (2017), 221--233.",
      "doi": "10.1016/j.ijhcs.2016.04.008"
    },
    {
      "text": "Clara Mancini, Rob Harris, Brendan Aengenheister, and Claire Guest. 2015. Re-centering multispecies practices: a canine interface for cancer detection dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2673--2682.",
      "doi": "10.1145/2702123.2702562"
    },
    {
      "text": "Clara Mancini and Jussi Lehtonen. 2018. The Emerging Nature of Participation in Multispecies Interaction Design. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 907--918.",
      "doi": "10.1145/3196709.3196785"
    },
    {
      "text": "Clara Mancini, Sha Li, Grainne O'Connor, Jose Valencia, Duncan Edwards, and Helen McCain. 2016. Towards multispecies interaction environments: extending accessibility to canine users. In Proceedings of the Third International Conference on Animal-Computer Interaction. ACM, 8.",
      "doi": "10.1145/2995257.2995395"
    },
    {
      "text": "Patricia J Manns and Karen E Chad. 2001. Components of quality of life for persons with a quadriplegic and paraplegic spinal cord injury. Qualitative health research 11, 6 (2001), 795--811.",
      "doi": ""
    },
    {
      "text": "Roger W McIntire and Thomas A Colley. 1967. Social reinforcement in the dog. Psychological Reports 20, 3 (1967), 843--846.",
      "doi": ""
    },
    {
      "text": "Michael J Muller. 2009. Participatory design: the third space in HCI. In Human-computer interaction. CRC press, 181--202.",
      "doi": ""
    },
    {
      "text": "Kenichiro Noda. 2018. Google Home: smart speaker as environmental control unit. Disability and rehabilitation: assistive technology 13, 7 (2018), 674--675.",
      "doi": ""
    },
    {
      "text": "Marguerite E O'Haire. 2013. Animal-assisted intervention for autism spectrum disorder: A systematic literature review. Journal of autism and developmental disorders 43, 7 (2013), 1606--1622.",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2013. WHO factsheet on Spinal Cord Injury. (2013). https://www.who.int/ news-room/fact-sheets/detail/spinal-cord-injury",
      "doi": ""
    },
    {
      "text": "Christina Papadimitriou. 2008. Becoming en-wheeled: the situated accomplishment of re-embodiment as a wheelchair user after spinal cord injury. Disability & society 23, 7 (2008), 691--704.",
      "doi": ""
    },
    {
      "text": "Kwang-Hyun Park, Zeungnam Bien, Ju-Jang Lee, Byung Kook Kim, Jong-Tae Lim, Jin-Oh Kim, Heyoung Lee, Dimitar H Stefanov, Dae-Jin Kim, Jin-Woo Jung, and others. 2007. Robotic smart house to assist people with movement disabilities. Autonomous Robots 22, 2 (2007), 183--198.",
      "doi": "10.1007/s10514-006-9012-9"
    },
    {
      "text": "Kwang-Hyun Park, Hyong-Euk Lee, Youngmin Kim, and Z Zenn Bien. 2008. A steward robot for human-friendly human-machine interaction in a smart house environment. IEEE Transactions on Automation Science and Engineering 5, 1 (2008), 21--25.",
      "doi": ""
    },
    {
      "text": "Emanuele Perini, Simone Soria, Andrea Prati, and Rita Cucchiara. 2006. FaceMouse: A human-computer interface for tetraplegic people. In European Conference on Computer Vision. Springer, 99--108.",
      "doi": "10.1007/11754336_10"
    },
    {
      "text": "Petcube. 2020. PETCUBE BITES 2: Smart HD pet camera with treat dispenser, lens, and voice control. (2020). https://petcube.com/bites-2/",
      "doi": ""
    },
    {
      "text": "PetSafe. 2020. Treat Train Remote Reward Dog Trainer. (2020). https://store.intl.petsafe.net/en-gb/treat-and-train",
      "doi": ""
    },
    {
      "text": "MW Post, AJ Dijk Van, FW Asbeck Van, and AJ Schrijvers. 1998. Life satisfaction of persons with spinal cord injury compared to a population group. Scandinavian Journal of Rehabilitation Medicine 30, 1 (1998), 23--30.",
      "doi": ""
    },
    {
      "text": "Marti L Riemer-Reiss and Robbyn R Wacker. 2000. Factors associated with assistive technology discontinuance among individuals with disabilities. Journal of Rehabilitation 66, 3 (2000).",
      "doi": ""
    },
    {
      "text": "Diana Rintala, Natalie Sachs-Ericsson, and K.A. Hart. 2002. The effects of service dogs on the lives of persons with mobility impairments: A pre-post study design. SCI Psychosocial Process 15 (01 2002), 70--82.",
      "doi": ""
    },
    {
      "text": "Charlotte Robinson, Clara Mancini, Janet van der Linden, Claire Guest, Lydia Swanson, Helen Marsden, Jose Valencia, and Brendan Aengenheister. 2015. Designing an emergency communication system for human and assistance dog partnerships. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 337--347.",
      "doi": ""
    },
    {
      "text": "Charlotte L Robinson, Clara Mancini, Janet Van Der Linden, Claire Guest, and Robert Harris. 2014. Canine-centered interface design: supporting the work of diabetes alert dogs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3757--3766.",
      "doi": "10.1145/2556288.2557396"
    },
    {
      "text": "Kerri E Rodriguez, Jessica Bibbo, and Marguerite E O'Haire. 2018. The effects of service dogs on psychosocial health and wellbeing for individuals with physical disabilities or chronic conditions. Disability and rehabilitation (2018), 1--9.",
      "doi": ""
    },
    {
      "text": "Nicola J Rooney, Steve Morant, and Claire Guest. 2013. Investigation into the value of trained glycaemia alert dogs to clients with type I diabetes. PloS one 8, 8 (2013), e69921.",
      "doi": ""
    },
    {
      "text": "RSPCA. 2019. What is reward based dog training and why does the RSPCA support it? (Nov 2019). https:// kb.rspca.org.au/article-tags/reward-based-training/",
      "doi": ""
    },
    {
      "text": "Carol Rushing. 1995. The effect of service dogs on the self-concept of spinal injured adults. Ph.D. Dissertation. ProQuest Information & Learning.",
      "doi": ""
    },
    {
      "text": "Natalie Sachs-Ericsson, Nancy K Hansen, and Shirley Fitzgerald. 2002. Benefits of assistance dogs: A review. Rehabilitation Psychology 47, 3 (2002), 251.",
      "doi": ""
    },
    {
      "text": "Jason Seewoodhary, Thomas Dacruz, Erin Lloyd, and Peter J Evans. 2014. The role of diabetic alert dogs in the management of impaired hypoglycaemia awareness. Practical Diabetes 31, 8 (2014), 323--325.",
      "doi": ""
    },
    {
      "text": "Vinod Sharma, Richard C Simpson, Edmund F LoPresti, Casimir Mostowy, Joseph Olson, Jeremy Puhlman, Steve Hayashi, Rory A Cooper, Ed Konarski, and Barry Kerley. 2008. Participatory design in the development of the wheelchair convoy system. Journal of NeuroEngineering and Rehabilitation 5, 1 (2008), 1.",
      "doi": ""
    },
    {
      "text": "Emir Skejié and Marijan Durek. 2007. Assistive technologies for physically handicapped persons. In Innovations and Advanced Techniques in Computer and Information Sciences and Engineering. Springer, 173--178.",
      "doi": ""
    },
    {
      "text": "Katharina Spiel, Christopher Frauenberger, Eva Hornecker, and Geraldine Fitzpatrick. 2017. When empathy is not enough: Assessing the experiences of autistic children with technologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2853--2864.",
      "doi": "10.1145/3025453.3025785"
    },
    {
      "text": "SpinalCord.com. 2019. Quadriplegia: Tetraplegia. (2019). https://www.spinalcord.com/quadriplegia-tetraplegia",
      "doi": ""
    },
    {
      "text": "Clay Spinuzzi. 2005. The methodology of participatory design. Technical communication 52, 2 (2005), 163--174.",
      "doi": ""
    },
    {
      "text": "Dimitar H Stefanov, Zeungnam Bien, and Won-Chul Bang. 2004. The smart house for older persons and persons with physical disabilities: structure, technology arrangements, and perspectives. IEEE transactions on neural systems and rehabilitation engineering 12, 2 (2004), 228--250.",
      "doi": ""
    },
    {
      "text": "Molly Follette Story. 1998. Maximizing usability: the principles of universal design. Assistive technology 10, 1 (1998), 4--12.",
      "doi": ""
    },
    {
      "text": "Philip Tedeschi, Aubrey H Fine, and Jana I Helgeson. 2010. Assistance animals: Their evolving role in psychiatric service applications. In Handbook on Animal-Assisted Therapy. Elsevier, 421--438.",
      "doi": ""
    },
    {
      "text": "Dogs Trust. 2019. What is Positive Reinforcement Dog Training? (2019). https://www.dogstrustdogschool.org. uk/training/i-want-to-train-my-dog/ the-benefits-of-positive-reinforcement/",
      "doi": ""
    },
    {
      "text": "Pet Tutor. 2020. Smart Training Feeder. (2020). https://smartanimaltraining.com/",
      "doi": ""
    },
    {
      "text": "Dirk van der Linden and Anna Zamansky. 2017. Agile with animals: Towards a development method. In 2017 IEEE 25th International Requirements Engineering Conference Workshops (REW). IEEE, 423--426.",
      "doi": ""
    },
    {
      "text": "Vappu Viemerö and Christina Krause. 1998. Quality of life in individuals with physical disabilities. Psychotherapy and psychosomatics 67, 6 (1998), 317--322.",
      "doi": ""
    },
    {
      "text": "Claude Vincent, Dany Gagnon, François Routhier, Jean Leblond, Pascale Boucher, Marie Blanchet, Valérie Martin-Lemoyne, and ADMI group. 2015. Service dogs in the province of Quebec: sociodemographic profile of users and the dogs' impact on functional ability. Disability and rehabilitation: Assistive technology 10, 2 (2015), 132--140.",
      "doi": ""
    },
    {
      "text": "Bess Williamson. 2019. Accessible America: A history of disability and design. Vol. 2. NYU Press.",
      "doi": ""
    },
    {
      "text": "Chadwick A Wingrave, Jeremy Rose, Todd Langston, and Joseph J LaViola Jr. 2010. Early explorations of CAT: canine amusement and training. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 2661--2670.",
      "doi": "10.1145/1753846.1753849"
    },
    {
      "text": "Melissa Winkle, Terry K Crowe, and Ingrid Hendrix. 2012. Service dogs and people with physical disabilities partnerships: A systematic review. Occupational therapy international 19, 1 (2012), 54--66.",
      "doi": ""
    },
    {
      "text": "Mariko Yamamoto and Lynette A Hart. 2019. Professionally-and self-trained service dogs: Benefits and challenges for partners with disabilities. Frontiers in Veterinary Science 6 (2019).",
      "doi": ""
    },
    {
      "text": "Gal Ziv. 2017. The effects of using aversive training methods in dogs-A review. Journal of veterinary behavior 19 (2017), 50--60.",
      "doi": ""
    }
  ]
}