{
  "doi": "10.1145/3313831.3376626",
  "title": "Podoportation: Foot-Based Locomotion in Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Virtual Reality (VR) allows for infinitely large environments. However, the physical traversable space is always limited by real-world boundaries. This discrepancy between physical and virtual dimensions renders traditional locomotion methods used in real world unfeasible. To alleviate these limitations, research proposed various artificial locomotion concepts such as teleportation, treadmills, and redirected walking. However, these concepts occupy the user's hands, require complex hardware or large physical spaces. In this paper, we contribute nine VR locomotion concepts for foot-based locomotion, relying on the 3D position of the user's feet and the pressure applied to the sole as input modalities. We evaluate our concepts and compare them to state-of-the-art point & teleport technique in a controlled experiment with 20 participants. The results confirm the viability of our approaches for foot-based and engaging locomotion. Further, based on the findings, we contribute a wireless hardware prototype implementation.",
  "authors": [
    {
      "name": "Julius von Willich",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99659366375/rel-imgonly/julius.jpg",
      "acmid": "99659366375",
      "orcid": "missing"
    },
    {
      "name": "Martin Schmitz",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-87958634757/rel-imgonly/martin_foto.jpg",
      "acmid": "87958634757",
      "orcid": "0000-0002-7332-3287"
    },
    {
      "name": "Florian Müller",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81464642529/rel-imgonly/flo_small.jpg",
      "acmid": "81464642529",
      "orcid": "0000-0002-9621-6214"
    },
    {
      "name": "Daniel Schmitt",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528666",
      "orcid": "0000-0003-0308-0416"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi, Mar Gonzalez-Franco, Eyal Ofek, and Anthony Steed. 2019. I'm a giant: Walking in large virtual environments at high speed gains. In Conference on Human Factors in Computing Systems - Proceedings. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3290605.3300752",
      "doi": "10.1145/3290605.3300752"
    },
    {
      "text": "Jonas Auda, Max Pascher, and Stefan Schneegass. 2019. Around the (Virtual) World. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, New York, New York, USA, 1--8. DOI: http://dx.doi.org/10.1145/3290605.3300661",
      "doi": "10.1145/3290605.3300661"
    },
    {
      "text": "Ralph M Barnes, Henry Hardaway, and Odif Podolsky. 1942. Which pedal is best. Factory Management and Maintenance 100, 98 (1942).",
      "doi": ""
    },
    {
      "text": "Ralph L Barnett. 2009. Foot Controls: Riding the Pedal. The Ergonomics Open Journal 2, 1 (2009), 13--16. DOI: http://dx.doi.org/10.2174/1875934300902010013",
      "doi": ""
    },
    {
      "text": "Jiwan Bhandari, Sam Tregillus, and Eelke Folmer. 2017. Legomotion: Scalable walking-based virtual locomotion. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology - VRST '17, Vol. Part F1319. ACM Press, New York, New York, USA, 1--8. DOI: http://dx.doi.org/10.1145/3139131.3139133",
      "doi": "10.1145/3139131.3139133"
    },
    {
      "text": "Costas Boletsis. 2017. The New Era of Virtual Reality Locomotion: A Systematic Literature Review of Techniques and a Proposed Typology. Multimodal Technologies and Interaction 1, 4 (sep 2017), 24. DOI: http://dx.doi.org/10.3390/mti1040024",
      "doi": ""
    },
    {
      "text": "B Bolte, G Bruder, and F Steinicke. 2011. The Jumper Metaphor: An Effective Navigation Technique for Immersive Display Setups. Proceedings of Virtual Reality International Conference (VRIC) April (2011), 6--8. http://www.uni-wuerzburg.de/fileadmin/06110000/user_upload/Paper/IMG/2011/P34_VRIC_2011_BOLTE_ Benjamin.pdf",
      "doi": ""
    },
    {
      "text": "D.A. Bowman, David Koller, and L.F. Hodges. 1997. Travel in immersive virtual environments: an evaluation of viewpoint motion control techniques. In Proceedings of IEEE 1997 Annual International Symposium on Virtual Reality. IEEE Comput. Soc. Press, Albuquerque, NM, USA, USA, 45--52,. DOI: http://dx.doi.org/10.1109/VRAIS.1997.583043",
      "doi": ""
    },
    {
      "text": "Evren Bozgeyikli, Andrew Raij, Srinivas Katkoori, and Rajiv Dubey. 2016. Point & Teleport locomotion technique for virtual reality. In CHI PLAY 2016 Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, Inc, 205--216. DOI: http://dx.doi.org/10.1145/2967934.2968105",
      "doi": "10.1145/2967934.2968105"
    },
    {
      "text": "Richard Byrne, Joe Marshall, and Florian 'Floyd' Mueller. 2016. Balance Ninja. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '16. ACM Press, New York, New York, USA, 159--170. DOI: http://dx.doi.org/10.1145/2967934.2968080",
      "doi": ""
    },
    {
      "text": "Tuncay Cakmak and Holger Hager. 2014. Cyberith Virtualizer: A locomotion device for Virtual Reality. In ACM SIGGRAPH 2014 Emerging Technologies on SIGGRAPH '14. ACM Press, New York, New York, USA, 1--1. DOI: http://dx.doi.org/10.1145/2614066.2614105",
      "doi": "10.1145/2614066.2614105"
    },
    {
      "text": "Marcello Carrozzino, Giovanni Avveduto, Franco Tecchia, Pavel Gurevich, and Benjamin Cohen. 2014. Navigating immersive virtual environments through a foot controller. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology VRST '14. ACM Press, New York, New York, USA, 23--26. DOI: http://dx.doi.org/10.1145/2671015.2671121",
      "doi": "10.1145/2671015.2671121"
    },
    {
      "text": "Jacob Cohen. 1988. Statistical Power Analysis for the Behavioral Sciences. Routledge. DOI: http://dx.doi.org/10.4324/9780203771587",
      "doi": ""
    },
    {
      "text": "E. N. Corlett and R. P. Bishop. 1975. Foot pedal forces for seated operators. Ergonomics 18, 6 (1975), 687--692. DOI: http://dx.doi.org/10.1080/00140137508931504",
      "doi": ""
    },
    {
      "text": "Gerwin de Haan, Eric J. Griffith, and Frits H. Post. 2008. Using the Wii Balance BoardTM as a low-cost VR interaction device. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology VRST '08. ACM Press, New York, New York, USA, 289. DOI: http://dx.doi.org/10.1145/1450579.1450657",
      "doi": ""
    },
    {
      "text": "Mingming Fan, Yizheng Ding, Fang Shen, Yuhui You, and Zhi Yu. 2017. An empirical study of foot gestures for hands-occupied mobile interaction. In Proceedings of the 2017 ACM International Symposium on Wearable Computers - ISWC '17, Vol. Part F1305. ACM Press, New York, New York, USA, 172--173. DOI: http://dx.doi.org/10.1145/3123021.3123043",
      "doi": "10.1145/3123021.3123043"
    },
    {
      "text": "Yasmin Felberbaum and Joel Lanir. 2018. Better understanding of foot gestures: An elicitation study. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, Vol. 2018-April. ACM Press, New York, New York, USA, 1--12. DOI: http://dx.doi.org/10.1145/3173574.3173908",
      "doi": "10.1145/3173574.3173908"
    },
    {
      "text": "Sebastian Freitag, Dominik Rausch, and Torsten Kuhlen. 2014. Reorientation in virtual environments using interactive portals. In IEEE Symposium on 3D User Interfaces 2014, 3DUI 2014 - Proceedings. IEEE Computer Society, 119--122. DOI: http://dx.doi.org/10.1109/3DUI.2014.6798852",
      "doi": ""
    },
    {
      "text": "Markus Funk, Florian Müller, Marco Fendrich, Megan Shene, Moritz Kolvenbach, Niclas Dobbertin, Sebastian Günther, and Max Mühlhäuser. 2019. Assessing the Accuracy of Point & Teleport Locomotion with Orientation Indication for Virtual Reality using Curved Trajectories. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems CHI '19. ACM Press, New York, New York, USA, 1--12. DOI: http://dx.doi.org/10.1145/3290605.3300377",
      "doi": "10.1145/3290605.3300377"
    },
    {
      "text": "Fabian Göbel, Stefan Vogt, Konstantin Klamka, Sophie Stellmach, Andreas Siegel, and Raimund Dachselt. 2013. Gaze-supported Foot Interaction in Zoomable Information Spaces. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2013-April. ACM Press, New York, New York, USA, 3059--3062. DOI: http://dx.doi.org/10.1145/2468356.2479610",
      "doi": ""
    },
    {
      "text": "Teng Han, Jason Alexander, Abhijit Karnik, Pourang Irani, and Sriram Subramanian. 2011. Kick: Investigating the use of kick gestures for mobile interactions. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services - MobileHCI '11. ACM Press, New York, New York, USA, 29. DOI: http://dx.doi.org/10.1145/2037373.2037379",
      "doi": "10.1145/2037373.2037379"
    },
    {
      "text": "Alyssa Harris, Kevin Nguyen, Preston Tunnell Wilson, Matthew Jackoski, and Betsy Williams. 2014. Human joystick: Wii-leaning to translate in large virtual environments. In Proceedings of the 13th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and its Applications in Industry - VRCAI '14. ACM Press, New York, New York, USA, 231--234. DOI: http://dx.doi.org/10.1145/2670473.2670512",
      "doi": "10.1145/2670473.2670512"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (oct 2006), 904--908. DOI: http://dx.doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Andre Hilsendeger, Stephan Brandauer, Julia Tolksdorf, and Christian Fröhlich. 2009. Navigation in Virtual Reality with the Wii Balance Board. 6th Workshop on Virtual and Augmented Reality (2009), 269--280. https://techfak.uni-bielefeld.de/ags/wbski/hiwis/ahilsend/files/navigation",
      "doi": ""
    },
    {
      "text": "Victoria Interrante, Brian Ries, and Lee Anderson. 2007. Seven League Boots: A New Metaphor for Augmented Locomotion through Moderately Large Scale Immersive Virtual Environments. In 2007 IEEE Symposium on 3D User Interfaces. IEEE, 167--170. DOI: http://dx.doi.org/10.1109/3DUI.2007.340791",
      "doi": ""
    },
    {
      "text": "Jia Wang and Robert W. Lindeman. 2012. Comparing isometric and elastic surfboard interfaces for leaning-based travel in 3D virtual environments. In 2012 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 31--38. DOI: http://dx.doi.org/10.1109/3DUI.2012.6184181",
      "doi": ""
    },
    {
      "text": "Ricardo Jota, Pedro Lopes, Daniel Wigdor, and Joaquim Jorge. 2014. Let's kick it: How to stop wasting the bottom third of your large scale display. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 1411--1414. DOI: http://dx.doi.org/10.1145/2556288.2557316",
      "doi": "10.1145/2556288.2557316"
    },
    {
      "text": "Alexandra Kitson, Abraham M. Hashemian, Ekaterina R. Stepanova, Ernst Kruijff, and Bernhard E. Riecke. 2017. Comparing leaning-based motion cueing interfaces for virtual reality locomotion. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 73--82. DOI: http://dx.doi.org/10.1109/3DUI.2017.7893320",
      "doi": ""
    },
    {
      "text": "Konstantin Klamka, Andreas Siegel, Stefan Vogt, Fabian Göbel, Sophie Stellmach, and Raimund Dachselt. 2015. Look & Pedal: Hands-free Navigation in Zoomable Information Spaces through Gaze-supported Foot Input. In Proceedings of the 2015 ACM on International Conference on Multimodal Interaction - ICMI '15. ACM Press, New York, New York, USA, 123--130. DOI: http://dx.doi.org/10.1145/2818346.2820751",
      "doi": "10.1145/2818346.2820751"
    },
    {
      "text": "Eugenia M. Kolasinski. 1995. Simulator Sickness in Virtual Environments. (1995). DOI: http://dx.doi.org/10.1121/1.404501",
      "doi": ""
    },
    {
      "text": "Andrey Krekhov, Sebastian Cmentowski, Katharina Emmerich, Maic Masuch, and Jens Krüger. 2018. GulliVR: A walking-oriented technique for navigation in virtual reality games based on virtual body resizing. In CHI PLAY 2018 - Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM Press, New York, New York, USA, 243--256. DOI: http://dx.doi.org/10.1145/3242671.3242704",
      "doi": "10.1145/3242671.3242704"
    },
    {
      "text": "K. H. Kroemer. 1971. Foot operation of controls. Ergonomics 14, 3 (1971), 333--361. DOI: http://dx.doi.org/10.1080/00140137108931255",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, Alexander Marquardt, Christina Trepkowski, Robert W. Lindeman, Andre Hinkenjann, Jens Maiero, and Bernhard E. Riecke. 2016. On Your Feet!. In Proceedings of the 2016 Symposium on Spatial User Interaction - SUI '16. ACM Press, New York, New York, USA, 149--158. DOI: http://dx.doi.org/10.1145/2983310.2985759",
      "doi": ""
    },
    {
      "text": "Andreas Linn Kth. Gaze Teleportation in Virtual Reality. Technical Report. www.kth.se",
      "doi": ""
    },
    {
      "text": "Joseph J. LaViola. 2000. A Discussion of Cybersickness in Virtual Environments. ACM SIGCHI Bulletin 32, 1 (jan 2000), 47--56. DOI: http://dx.doi.org/10.1145/333329.333344",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "Zhihan Lv. 2013. Wearable smartphone: Wearable hybrid framework for hand and foot gesture interaction on smartphone. In 2013 IEEE International Conference on Computer Vision Workshops. IEEE, 436--443. DOI: http://dx.doi.org/10.1109/ICCVW.2013.64",
      "doi": "10.1109/ICCVW.2013.64"
    },
    {
      "text": "Zhihan Lv, Shengzhong Feng, Muhammad Sikandar Lal Khan, Shafiq Ur Réhman, and Haibo Li. 2014a. Foot motion sensing: Augmented game interface based on foot interaction for smartphone. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14. ACM Press, New York, New York, USA, 293--296. DOI: http://dx.doi.org/10.1145/2559206.2580096",
      "doi": "10.1145/2559206.2580096"
    },
    {
      "text": "Zhihan Lv, Alaa Halawani, Shengzhong Feng, Haibo Li, and Shafiq Ur Réhman. 2014b. Multimodal Hand and Foot Gesture Interaction for Handheld Devices. ACM Transactions on Multimedia Computing, Communications, and Applications 11, 1s (oct 2014), 1--19. DOI: http://dx.doi.org/10.1145/2645860",
      "doi": "10.1145/2645860"
    },
    {
      "text": "Denys J.C. Matthies, Franz Müller, Christoph Anthes, and Dieter Kranzlmüller. 2013. ShoeSoleSense: Proof of concept for a wearable foot interface for virtual and real environments. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST. ACM Press, New York, New York, USA, 93--96. DOI: http://dx.doi.org/10.1145/2503713.2503740",
      "doi": "10.1145/2503713.2503740"
    },
    {
      "text": "Mark McGill, Daniel Boland, Roderick Murray-Smith, and Stephen Brewster. 2015. A Dose of Reality. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 2143--2152. DOI: http://dx.doi.org/10.1145/2702123.2702382",
      "doi": "10.1145/2702123.2702382"
    },
    {
      "text": "Vangelis Metsis, Kenneth S. Smith, and Denise Gobert. 2018. Integration of virtual reality with an omnidirectional treadmill system for multi-directional balance skills intervention. In 2017 International Symposium on Wearable Robotics and Rehabilitation, WeRob 2017. Institute of Electrical and Electronics Engineers Inc., 1--2. DOI: http://dx.doi.org/10.1109/WEROB.2017.8383831",
      "doi": ""
    },
    {
      "text": "Florian Müller, Joshua McManus, Sebastian Günther, Martin Schmitz, Max Mühlhäuser, and Markus Funk. 2019. Mind the tap: Assessing foot-taps for interacting with head-mounted displays. In Conference on Human Factors in Computing Systems - Proceedings. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3290605.3300707",
      "doi": "10.1145/3290605.3300707"
    },
    {
      "text": "Toni Pakkanen and Roope Raisamo. 2004. Appropriateness of foot interaction for non-accurate spatial tasks. In Extended abstracts of the 2004 conference on Human factors and computing systems CHI '04. ACM Press, New York, New York, USA, 1123. DOI: http://dx.doi.org/10.1145/985921.986004",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Thomas Crea, and Matthew Conway. 2017. A Literature Survey for Virtual Environments: Military Flight Simulator Visual Systems and Simulator Sickness. In Simulation in Aviation Training. Vol. 1. Routledge, 147--166. DOI: http://dx.doi.org/10.4324/9781315243092--10",
      "doi": ""
    },
    {
      "text": "Glenn Pearson and Mark Weiser. 1986. Of moles and men: The design of foot controls for workstations. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '86. ACM Press, New York, New York, USA, 333--339. DOI: http://dx.doi.org/10.1145/22627.22392",
      "doi": "10.1145/22627.22392"
    },
    {
      "text": "Vijay Dandur Rajanna. 2016. Gaze and foot input: Toward a rich and assistive interaction modality. In Companion Publication of the 21st International Conference on Intelligent User Interfaces - IUI '16 Companion. ACM Press, New York, New York, USA, 126--129. DOI: http://dx.doi.org/10.1145/2876456.2876462",
      "doi": "10.1145/2876456.2876462"
    },
    {
      "text": "William Saunders and Daniel Vogel. 2016. Tap-kick-click: Foot interaction for a standing desk. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16. ACM Press, New York, New York, USA, 323--333. DOI: http://dx.doi.org/10.1145/2901790.2901815",
      "doi": "10.1145/2901790.2901815"
    },
    {
      "text": "Shayle R. Searle, Fred M. Speed, and George A Milliken. 1980. Population Marginal Means in the Linear Model: An Alternative to Least Squares Means. The American Statistician 34, 4 (nov 1980), 216--221. DOI: http://dx.doi.org/10.1080/00031305.1980.10483031",
      "doi": ""
    },
    {
      "text": "Mara G. Silva and Doug A. Bowman. 2009. Body-based interaction for desktop games. In Proceedings of the 27th international conference extended abstracts on Human factors in computing systems - CHI EA '09. ACM Press, New York, New York, USA, 4249. DOI: http://dx.doi.org/10.1145/1520340.1520648",
      "doi": ""
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, Jason Alexander, and Hans Gellersen. 2014. Feet movement in desktop 3D interaction. In 2014 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 71--74. DOI: http://dx.doi.org/10.1109/3DUI.2014.6798845",
      "doi": ""
    },
    {
      "text": "Nancy A. Skopp, Derek J. Smolenski, Melinda J. Metzger-Abamukong, Albert A. Rizzo, and Greg M. Reger. 2014. A Pilot Study of the VirtuSphere as a Virtual Reality Enhancement. International Journal of Human-Computer Interaction 30, 1 (jan 2014), 24--31. DOI: http://dx.doi.org/10.1080/10447318.2013.796441",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1995. Taking steps: the influence of a walking technique on presence in virtual reality. ACM Transactions on Computer-Human Interaction 2, 3 (sep 1995), 201--219. DOI: http://dx.doi.org/10.1145/210079.210084",
      "doi": "10.1145/210079.210084"
    },
    {
      "text": "Sam Tregillus, Majed Al Zayer, and Eelke Folmer. 2017. Handsfree Omnidirectional VR Navigation using Head Tilt. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 4063--4068. DOI: http://dx.doi.org/10.1145/3025453.3025521",
      "doi": "10.1145/3025453.3025521"
    },
    {
      "text": "Sam Tregillus and Eelke Folmer. 2016. VR-STEP: Walking-in-place using inertial sensing for hands free navigation in mobile VR environments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 1250--1255. DOI: http://dx.doi.org/10.1145/2858036.2858084",
      "doi": "10.1145/2858036.2858084"
    },
    {
      "text": "Dimitar Valkov, Frank Steinicke, Gerd Bruder, and Klaus Hinrichs. 2010. A multi-touch enabled human-transporter metaphor for virtual 3D traveling. In 3DUI 2010 - IEEE Symposium on 3D User Interfaces 2010, Proceedings. IEEE, 79--82. DOI: http://dx.doi.org/10.1109/3DUI.2010.5444715",
      "doi": ""
    },
    {
      "text": "Eduardo Velloso, Jason Alexander, Andreas Bulling, and Hans Gellersen. 2015a. Interactions under the desk: A characterisation of foot movements for input in a seated position. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 9296. Springer Verlag, 384--401. DOI: http://dx.doi.org/10.1007/978--3--319--22701--6_29",
      "doi": ""
    },
    {
      "text": "Eduardo Velloso, Dominik Schmidt, Jason Alexander, Hans Gellersen, and Andreas Bulling. 2015b. The feet in human-computer interaction: A survey of foot-based interaction. Comput. Surveys 48, 2 (sep 2015), 1--35. DOI: http://dx.doi.org/10.1145/2816455",
      "doi": "10.1145/2816455"
    },
    {
      "text": "Julius von Willich, Dominik Schön, Sebastian Günther, Florian Müller, Max Mühlhäuser, and Markus Funk. 2019. VRChairRacer: Using an Office Chair Backrest as a Locomotion Technique for VR Racing Games. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, New York, New York, USA, 1--4. DOI: http://dx.doi.org/10.1145/3290607.3313254",
      "doi": "10.1145/3290607.3313254"
    },
    {
      "text": "Preston Tunnell Wilson, William Kalescky, Ansel MacLaughlin, and Betsy Williams. 2016. VR locomotion: Walking&gt;Walking in Place&gt;Arm swinging. In Proceedings of the 15th ACM SIGGRAPH Conference on Virtual-Reality Continuum and Its Applications in Industry - VRCAI '16, Vol. 1. ACM Press, New York, New York, USA, 243--249. DOI: http://dx.doi.org/10.1145/3013971.3014010",
      "doi": "10.1145/3013971.3014010"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for nonparametric factorial analyses using only ANOVA procedures. In Conference on Human Factors in Computing Systems - Proceedings. 143--146. DOI: http://dx.doi.org/10.1145/1978942.1978963",
      "doi": ""
    },
    {
      "text": "Tetsuya Yamamoto, Masahiko Tsukamoto, and Tomoki Yoshihisa. 2008. Foot-Step input method for operating information devices while jogging. In 2008 International Symposium on Applications and the Internet. IEEE, 173--176. DOI: http://dx.doi.org/10.1109/SAINT.2008.97",
      "doi": "10.1109/SAINT.2008.97"
    }
  ]
}