{
  "doi": "10.1145/3313831.3376672",
  "title": "'I Just Want to Hack Myself to Not Get Distracted': Evaluating Design Interventions for Self-Control on Facebook",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Beyond being the world's largest social network, Facebook is for many also one of its greatest sources of digital distraction. For students, problematic use has been associated with negative effects on academic achievement and general wellbeing. To understand what strategies could help users regain control, we investigated how simple interventions to the Facebook UI affect behaviour and perceived control. We assigned 58 university students to one of three interventions: goal reminders, removed newsfeed, or white background (control). We logged use for 6 weeks, applied interventions in the middle weeks, and administered fortnightly surveys. Both goal reminders and removed newsfeed helped participants stay on task and avoid distraction. However, goal reminders were often annoying, and removing the newsfeed made some fear missing out on information. Our findings point to future interventions such as controls for adjusting types and amount of available information, and flexible blocking which matches individual definitions of 'distraction'.",
  "tags": [
    "facebook",
    "addiction",
    "problematic use",
    "ict non-use",
    "focus",
    "distraction",
    "interruptions",
    "self-control"
  ],
  "authors": [
    {
      "name": "Ulrik Lyngs",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/do/10.1145/contrib-99659161047/rel-imgonly/704330_10151299089216195_1209963406_o-2.jpg",
      "acmid": "99659161047",
      "orcid": "0000-0001-9960-1436"
    },
    {
      "name": "Kai Lukoff",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161231",
      "orcid": "0000-0001-5069-6817"
    },
    {
      "name": "Petr Slovak",
      "institution": "King's College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611500",
      "orcid": "missing"
    },
    {
      "name": "William Seymour",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/do/10.1145/contrib-99659260771/rel-imgonly/cdtyearbook2017byianwallman-8251.jpg",
      "acmid": "99659260771",
      "orcid": "0000-0002-0256-6740"
    },
    {
      "name": "Helena Webb",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658969286",
      "orcid": "missing"
    },
    {
      "name": "Marina Jirotka",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398221",
      "orcid": "missing"
    },
    {
      "name": "Jun Zhao",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453639687",
      "orcid": "0000-0001-6935-9028"
    },
    {
      "name": "Max Van Kleek",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/do/10.1145/contrib-81328490974/rel-imgonly/max-android.jpg",
      "acmid": "81328490974",
      "orcid": "0000-0003-3873-6366"
    },
    {
      "name": "Nigel Shadbolt",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100351241",
      "orcid": "0000-0002-5085-9724"
    }
  ],
  "references": [
    {
      "text": "Alexander T. Adams, Jean Costa, Malte F. Jung, and Tanzeem Choudhury. 2015. Mindless Computing: Designing Technologies to Subtly Influence Behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 719--730. DOI: http://dx.doi.org/10.1145/2750858.2805843",
      "doi": "10.1145/2750858.2805843"
    },
    {
      "text": "Sami Abdo Radman Al-Dubai, Kurubaran Ganasegeran, Mustafa Ahmed Mahdi Al-Shagga, Hematram Yadav, and John T. Arokiasamy. 2013. Adverse Health Effects and Unhealthy Behaviors among Medical Students Using Facebook. https://www.hindawi.com/journals/tswj/2013/465161/. (2013). DOI: http://dx.doi.org/10.1155/2013/465161",
      "doi": ""
    },
    {
      "text": "All Party Parliamentary Group on Social Media and Young People's Mental Health and Wellbeing. 2019. #NewFilters to Manage the Impact of Social Media on Young People's Mental Health and Wellbeing. Technical Report. UK Parliament.",
      "doi": ""
    },
    {
      "text": "Hunt Allcott, Luca Braghieri, Sarah Eichmeyer, and Matthew Gentzkow. 2019. The Welfare Effects of Social Media. Working Paper 25514. National Bureau of Economic Research. DOI: http://dx.doi.org/10.3386/w25514",
      "doi": ""
    },
    {
      "text": "Cecilie Schou Andreassen, Torbjørn Torsheim, Geir Scott Brunborg, and Staale Pallesen. 2012. Development of a Facebook Addiction Scale. Psychological Reports 110, 2 (apr 2012), 501--517. DOI: http://dx.doi.org/10.2466/02.09.18.PR0.110.2.501--517",
      "doi": ""
    },
    {
      "text": "Yummy Apps. 2019. Todobook. (May 2019).",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1982. Self-efficacy mechanism in human agency. American Psychologist 37, 2 (1982), 122--147. DOI: http://dx.doi.org/10.1037/0003-066x.37.2.122",
      "doi": ""
    },
    {
      "text": "Fanni Bányai, Ágnes Zsila, Orsolya Király, Aniko Maraz, Zsuzsanna Elekes, Mark D. Griffiths, Cecilie Schou Andreassen, and Zsolt Demetrovics. 09-Jan-2017. Problematic Social Media Use: Results from a Large-Scale Nationally Representative Adolescent Sample. PLOS ONE 12, 1 (09-Jan-2017), e0169839. DOI: http://dx.doi.org/10.1371/journal.pone.0169839",
      "doi": ""
    },
    {
      "text": "Elliot T Berkman, Cendri A Hutcherson, Jordan L Livingston, Lauren E Kahn, and Michael Inzlicht. 2017. Self-Control as Value-Based Choice. Current Directions in Psychological Science 26, 5 (2017), 422--428. DOI: http://dx.doi.org/10.1177/0963721417704394",
      "doi": ""
    },
    {
      "text": "Walter R. Boot, Daniel J. Simons, Cary Stothart, and Cassie Stutts. 2013. The Pervasive Problem with Placebos in Psychology. Perspectives on Psychological Science 8, 4 (jul 2013), 445--454. DOI: http://dx.doi.org/10.1177/1745691613491271",
      "doi": ""
    },
    {
      "text": "Amara Brook. 2011. Ecological Footprint Feedback: Motivating or Discouraging? Social Influence 6, 2 (April 2011), 113--128. DOI: http://dx.doi.org/10.1080/15534510.2011.566801",
      "doi": ""
    },
    {
      "text": "Gharad Bryan, Dean Karlan, and Scott Nelson. 2010. Commitment Devices. Annual Review of Economics 2, 1 (Sept. 2010), 671--698. DOI: http://dx.doi.org/10.1146/annurev.economics.102308.124324",
      "doi": ""
    },
    {
      "text": "Moira Burke and Robert E. Kraut. 2016. The Relationship Between Facebook Use and Well-Being Depends on Communication Type and Tie Strength. Journal of Computer-Mediated Communication 21, 4 (2016), 265--281. DOI: http://dx.doi.org/10.1111/jcc4.12162",
      "doi": "10.1111/jcc4.12162"
    },
    {
      "text": "Moira Burke, Cameron Marlow, and Thomas Lento. 2010. Social Network Activity and Social Well-Being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1909--1912. DOI: http://dx.doi.org/10.1145/1753326.1753613",
      "doi": "10.1145/1753326.1753613"
    },
    {
      "text": "Wenhong Chen and Kye-Hyoung Lee. 2013. Sharing, Liking, Commenting, and Distressed? The Pathway between Facebook Interaction and Psychological Distress. Cyberpsychology, Behavior and Social Networking 16, 10 (oct 2013), 728--734. DOI: http://dx.doi.org/10.1089/cyber.2012.0272",
      "doi": ""
    },
    {
      "text": "Justin Cheng, Moira Burke, and Elena Goetz Davis. 2019. Understanding Perceptions of Problematic Facebook Use: When People Experience Negative Life Impact and a Lack of Control. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 199:1--199:13. DOI: http://dx.doi.org/10.1145/3290605.3300429",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. HARK No More: On the Preregistration of CHI Experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 141:1--141:12. DOI: http://dx.doi.org/10.1145/3173574.3173715",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. A Power Primer. Psychological Bulletin 112, 1 (1992), 155--159. DOI: http://dx.doi.org/10.1037/0033--2909.112.1.155",
      "doi": ""
    },
    {
      "text": "Anna L Cox, Sandy J J Gould, Marta E Cecchinato, Ioanna Iacovides, and Ian Renfree. 2016. Design Frictions for Mindful Interactions: The Case for Microboundaries. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 1389--1397. DOI: http://dx.doi.org/10.1145/2851581.2892410",
      "doi": "10.1145/2851581.2892410"
    },
    {
      "text": "Helen Creswick, Liz Dowthwaite, Ansgar Koene, Elvira Perez Vallejos, Virginia Portillo, Monica Cano, and Christopher Woodard. 2019. ?... They don't really listen to people\". Journal of Information, Communication and Ethics in Society 17, 2 (May 2019), 167--182. DOI: http://dx.doi.org/10.1108/jices-11--2018-0090",
      "doi": ""
    },
    {
      "text": "Angela L. Duckworth, Katherine L. Milkman, and David Laibson. 2018. Beyond Willpower: Strategies for Reducing Failures of Self-Control. Psychological Science in the Public Interest 19, 3 (Dec. 2018), 102--129. DOI: http://dx.doi.org/10.1177/1529100618821893",
      "doi": ""
    },
    {
      "text": "Angela L. Duckworth and Laurence Steinberg. 2015. Unpacking Self-Control. Child development perspectives 9, 1 (2015), 32--37. DOI: http://dx.doi.org/10.1111/cdep.12107",
      "doi": ""
    },
    {
      "text": "Angela L. Duckworth, Rachel E. White, Alyssa J. Matteucci, Annie Shearer, and James J. Gross. 2016. A Stitch in Time: Strategic Self-Control in High School and College Students. Journal of Educational Psychology 108, 3 (apr 2016), 329--341. DOI: http://dx.doi.org/10.1037/edu0000062",
      "doi": ""
    },
    {
      "text": "David A. Ellis, Brittany I. Davidson, Heather Shaw, and Kristoffer Geyer. 2019. Do Smartphone Usage Scales Predict Behavior? International Journal of Human-Computer Studies (may 2019). DOI: http://dx.doi.org/10.1016/j.ijhcs.2019.05.004",
      "doi": ""
    },
    {
      "text": "David A. Ellis, Linda K. Kaye, Thomas D.W. Wilcockson, and Francesca C. Ryding. 2018. Digital Traces of Behaviour Within Addiction: Response to Griffiths (2017). International Journal of Mental Health and Addiction 16, 1 (feb 2018), 240--245. DOI: http://dx.doi.org/10.1007/s11469-017--9855--7",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4 (jul 2007), 1143--1168. DOI: http://dx.doi.org/10.1111/j.1083--6101.2007.00367.x",
      "doi": ""
    },
    {
      "text": "Yonah Forst. 2016. Focusbook. (2016).",
      "doi": ""
    },
    {
      "text": "Catherine O. Fritz, Peter E. Morris, and Jennifer J. Richler. 2012. Effect Size Estimates: Current Use, Calculations, and Interpretation. Journal of Experimental Psychology. General 141, 1 (feb 2012), 2--18. DOI: http://dx.doi.org/10.1037/a0024338",
      "doi": ""
    },
    {
      "text": "Brian M. Galla and Angela L. Duckworth. 2015. More Than Resisting Temptation: Beneficial Habits Mediate the Relationship Between Self-Control and Positive Life Outcomes. Journal of Personality and Social Psychology 109, 3 (2015), No Pagination Specified. DOI: http://dx.doi.org/10.1037/pspp0000026",
      "doi": ""
    },
    {
      "text": "Jennifer Gerson, Anke C. Plagnol, and Philip J. Corr. 2017. Passive and Active Facebook Use Measure (PAUM): Validation and Relationship to the Reinforcement Sensitivity Theory. Personality and Individual Differences 117 (oct 2017), 81--90. DOI: http://dx.doi.org/10.1016/j.paid.2017.05.034",
      "doi": ""
    },
    {
      "text": "Samuel D. Gosling, Peter J. Rentfrow, and William B. Swann Jr. 2003. A Very Brief Measure of the Big-Five Personality Domains. Journal of Research in Personality 37, 6 (2003), 504--528. DOI: http://dx.doi.org/10.1016/S0092--6566(03)00046--1",
      "doi": ""
    },
    {
      "text": "Rachel Grieve, Michaelle Indian, Kate Witteveen, G. Anne Tolan, and Jessica Marrington. 2013. Face-to-Face or Facebook: Can Social Connectedness Be Derived Online? Computers in Human Behavior 29, 3 (may 2013), 604--609. DOI: http://dx.doi.org/10.1016/j.chb.2012.11.017",
      "doi": "10.1016/j.chb.2012.11.017"
    },
    {
      "text": "Barbara Grimpe, Mark Hartswood, and Marina Jirotka. 2014. Towards a Closer Dialogue Between Policy and Practice: Responsible Design in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2965--2974. DOI: http://dx.doi.org/10.1145/2556288.2557364",
      "doi": "10.1145/2556288.2557364"
    },
    {
      "text": "Ben Grosser. 2019. Facebook Demetricator. (jul 2019).",
      "doi": ""
    },
    {
      "text": "Eduardo Guedes, Federica Sancassiani, Mauro Giovani Carta, Carlos Campos, Sergio Machado, Anna Lucia Spear King, and Antonio Egidio Nardi. 2016. Internet Addiction and Excessive Social Networks Use: What About Facebook? Clinical Practice and Epidemiology in Mental Health : CP & EMH 12 (jun 2016), 43--48. DOI: http://dx.doi.org/10.2174/1745017901612010043",
      "doi": ""
    },
    {
      "text": "Natasha Gupta and Julia D. Irwin. 2016. In-Class Distractions: The Role of Facebook and the Primary Learning Task. Computers in Human Behavior 55 (feb 2016), 1165--1178. DOI: http://dx.doi.org/10.1016/j.chb.2014.10.022",
      "doi": ""
    },
    {
      "text": "Jaron Harambam, Dimitrios Bountouridis, Mykola Makhortykh, and Joris van Hoboken. 2019. Designing for the Better by Taking Users into Account: A Qualitative Evaluation of User Control Mechanisms in (News) Recommender Systems. In Proceedings of the 13th ACM Conference on Recommender Systems (RecSys '19). ACM, NY, NY, USA, 69--77. DOI: http://dx.doi.org/10.1145/3298689.3347014",
      "doi": "10.1145/3298689.3347014"
    },
    {
      "text": "Alexis Hiniker, Sungsoo Ray Hong, Tadayoshi Kohno, and Julie A Kientz. 2016. MyTime: Designing and Evaluating an Intervention for Smartphone Non-Use. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 4746--4757. DOI: http://dx.doi.org/10.1145/2858036.2858403",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "Michael Inzlicht, Bruce D. Bartholow, and Jacob B. Hirsh. 2015. Emotional Foundations of Cognitive Control. Trends in Cognitive Sciences 19, 3 (March 2015), 126--132. DOI: http://dx.doi.org/10.1016/j.tics.2015.01.004",
      "doi": ""
    },
    {
      "text": "Michael Inzlicht, Brandon J. Schmeichel, and C. Neil Macrae. 2014. Why Self-Control Seems (but May Not Be) Limited. Trends in Cognitive Sciences 18, 3 (2014), 127--133. DOI: http://dx.doi.org/10.1016/j.tics.2013.12.009",
      "doi": ""
    },
    {
      "text": "Hosein Jafarkarimi, Alex Tze Hiang Sim, Robab Saadatdoost, and Jee Mei Hee. 2016. Facebook Addiction among Malaysian Students. International Journal of Information and Education Technology 6, 6 (2016), 465--469. DOI: http://dx.doi.org/10.7763/IJIET.2016.V6.733",
      "doi": ""
    },
    {
      "text": "JDev. 2019. News Feed Eradicator for Facebook. (jul 2019).",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Jason Riis. 2005. Living, and Thinking about It: Two Perspectives on Life. In The Science of Well-Being, F. A. Huppert, N. Baylis, and B. Keverne (Eds.). Oxford University Press, New York, 285--304. DOI: http://dx.doi.org/10.1093/acprof: oso/9780198567523.003.0011",
      "doi": ""
    },
    {
      "text": "Alboukadel Kassambara. 2019. Rstatix: Pipe-Friendly Framework for Basic Statistical Tests. (dec 2019).",
      "doi": ""
    },
    {
      "text": "Jiraporn Khumsri, Rungmanee Yingyeun, null Mereerat Manwong, Nitt Hanprathet, and Muthita Phanasathit. 2015. Prevalence of Facebook Addiction and Related Factors Among Thai High School Students. Journal of the Medical Association of Thailand = Chotmaihet Thangphaet 98 Suppl 3 (apr 2015), S51--60.",
      "doi": ""
    },
    {
      "text": "Jaejeung Kim, Chiwoo Cho, and Uichin Lee. 2017. Technology Supported Behavior Restriction for Mitigating Self-Interruptions in Multi-Device Environments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (sep 2017), 1--21. DOI: http://dx.doi.org/10.1145/3130932",
      "doi": "10.1145/3130932"
    },
    {
      "text": "Mustafa Koc and Seval Gulyagci. 2013. Facebook Addiction among Turkish College Students: The Role of Psychological Health, Demographic, and Usage Characteristics. Cyberpsychology, Behavior and Social Networking 16, 4 (apr 2013), 279--284. DOI: http://dx.doi.org/10.1089/cyber.2012.0249",
      "doi": ""
    },
    {
      "text": "Hiroki P. Kotabe and Wilhelm Hofmann. 2015. On Integrating the Components of Self-Control. Perspectives on Psychological Science 10, 5 (2015), 618--638. DOI: http://dx.doi.org/10.1177/1745691615593382",
      "doi": ""
    },
    {
      "text": "Geza Kovacs, Drew Mylander Gregory, Zilin Ma, Zhengxuan Wu, Golrokh Emami, Jacob Ray, and Michael S. Bernstein. 2019. Conservation of Procrastination: Do Productivity Interventions Save Time Or Just Redistribute It?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 330:1--330:12. DOI: http://dx.doi.org/10.1145/3290605.3300560",
      "doi": ""
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2018. Rotating Online Behavior Change Interventions Increases Effectiveness But Also Increases Attrition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1--25. DOI: http://dx.doi.org/10.1145/3274364",
      "doi": ""
    },
    {
      "text": "Hanna Krasnova, Helena Wenninger, Thomas Widjaja, and Peter Buxmann. 2013. Envy on Facebook: A Hidden Threat to Users' Life Satisfaction?. In Wirtschaftsinformatik. DOI: http://dx.doi.org/10.7892/boris.47080",
      "doi": ""
    },
    {
      "text": "Leodoro J. Labrague. 2014. Facebook Use and Adolescents' Emotional States of Depression, Anxiety, and Stress. Health Science Journal 8, 1 (2014), 80--89.",
      "doi": ""
    },
    {
      "text": "AV Tech Labs. 2019. Auto Logout. (jul 2019).",
      "doi": ""
    },
    {
      "text": "Laura Lascau, Priscilla N Y Wong, Duncan P Brumby, and Anna L Cox. 2019. Why Are Cross-Device Interactions Important When It Comes To Digital Wellbeing? (2019).",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining Behavioral Economics to Design Persuasive Technology for Healthy Choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 325--334. DOI: http://dx.doi.org/10.1145/1978942.1978989",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Ulrik Lyngs, Reuben Binns, Max Van Kleek, and Nigel Shadbolt. 2018. \"So, Tell Me What Users Want, What They Really, Really Want!\". In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, alt04:1--alt04:10. DOI: http://dx.doi.org/10.1145/3170427.3188397",
      "doi": "10.1145/3170427.3188397"
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, Reuben Binns, Adam Slack, Michael Inzlicht, Max Van Kleek, and Nigel Shadbolt. 2019. Self-Control in Cyberspace : Applying Dual Systems Theory to a Review of Digital Self-Control Tools. In CHIConference on Human Factors in Computing Systems Proceedings (CHI 2019). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/3290605.3300361",
      "doi": "10.1145/3290605.3300361"
    },
    {
      "text": "Claudia Marino, Gianluca Gini, Alessio Vieno, and Marcantonio M. Spada. 2018a. The Associations between Problematic Facebook Use, Psychological Distress and Well-Being among Adolescents and Young Adults: A Systematic Review and Meta-Analysis. Journal of Affective Disorders 226, September 2017 (2018), 274--281. DOI: http://dx.doi.org/10.1016/j.jad.2017.10.007",
      "doi": ""
    },
    {
      "text": "Claudia Marino, Gianluca Gini, Alessio Vieno, and Marcantonio M Spada. 2018b. A Comprehensive Meta-Analysis on Problematic Facebook Use. Computers in Human Behavior 83 (2018), 262--277. DOI: http://dx.doi.org/10.1016/j.chb.2018.02.009",
      "doi": "10.1016/j.chb.2018.02.009"
    },
    {
      "text": "Gloria Mark, Mary Czerwinski, and Shamsi T Iqbal. 2018. Effects of Individual Differences in Blocking Workplace Distractions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 92:1--92:12. DOI: http://dx.doi.org/10.1145/3173574.3173666",
      "doi": ""
    },
    {
      "text": "Adrian Meier, Leonard Reinecke, and Christine E. Meltzer. 2016. Facebocrastination? Predictors of Using Facebook for Procrastination and Its Effects on Students Well-Being. Comput. Hum. Behav. 64, C (nov 2016), 65--76. DOI: http://dx.doi.org/10.1016/j.chb.2016.06.011",
      "doi": ""
    },
    {
      "text": "Pardis Miri, Andero Uusberg, Heather Culbertson, Robert Flory, Helen Uusberg, James J. Gross, Keith Marzullo, and Katherine Isbister. 2018. Emotion Regulation in the Wild: Introducing WEHAB System Architecture. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW021, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188495",
      "doi": ""
    },
    {
      "text": "Roberto Mosquera, Mofioluwasademi (Moffii) Odunowo, Trent McNamara, Xiongfei Guo, and Ragan Petrie. 2019. The Economic Effects of Facebook. SSRN Scholarly Paper ID 3312462. Social Science Research Network, Rochester, NY.",
      "doi": ""
    },
    {
      "text": "Austin Lee Nichols and Jon K. Maner. 2008. The Good-Subject Effect: Investigating Participant Demand Characteristics. The Journal of General Psychology 135, 2 (apr 2008), 151--166. DOI: http://dx.doi.org/10.3200/GENP.135.2.151--166",
      "doi": ""
    },
    {
      "text": "Amy Orben and Andrew K. Przybylski. 2019. Screens, Teens, and Psychological Well-Being: Evidence From Three Time-Use-Diary Studies. Psychological Science 30, 5 (may 2019), 682--696. DOI: http://dx.doi.org/10.1177/0956797619830329",
      "doi": ""
    },
    {
      "text": "Gábor Orosz, István Tóth-Király, and Beáta Bothe. 2016. Four Facets of Facebook Intensity - The Development of the Multidimensional Facebook Intensity Scale. Personality and Individual Differences 100 (oct 2016), 95--104. DOI: http://dx.doi.org/10.1016/j.paid.2015.11.038",
      "doi": ""
    },
    {
      "text": "Elvira Perez Vallejos, Ansgar Koene, Virginia Portillo, Liz Dowthwaite, and Monica Cano. 2017. Young People's Policy Recommendations on Algorithm Fairness. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17). ACM, NY, NY, USA, 247--251. DOI: http://dx.doi.org/10.1145/3091478.3091512",
      "doi": "10.1145/3091478.3091512"
    },
    {
      "text": "Becky Phu and Alan J. Gow. 2019. Facebook Use and Its Association with Subjective Happiness and Loneliness. Computers in Human Behavior 92 (mar 2019), 151--159. DOI: http://dx.doi.org/10.1016/j.chb.2018.11.020",
      "doi": ""
    },
    {
      "text": "Charlie Pinder, Jo Vermeulen, Benjamin R. Cowan, and Russell Beale. 2018. Digital Behaviour Change Interventions to Break and Form Habits. ACM Transactions on Computer-Human Interaction 25, 3 (2018), 1--66. DOI: http://dx.doi.org/10.1145/3196830",
      "doi": "10.1145/3196830"
    },
    {
      "text": "Andreas Poller. 2017. Welcome to ROSE - The Research Tool for Online Social Environments. (2017).",
      "doi": ""
    },
    {
      "text": "Andreas Poller, Petra Ilyes, Andreas Kramm, and Laura Kocksch. 2014. Investigating OSN Users' Privacy Strategies with In-Situ Observation. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW Companion '14). ACM, NY, NY, USA, 217--220. DOI: http://dx.doi.org/10.1145/2556420.2556508",
      "doi": "10.1145/2556420.2556508"
    },
    {
      "text": "Prettymind.co. 2018. Timewaste Timer.",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, Kou Murayama, Cody R. Dehaan, and Valerie Gladwell. 2013. Motivational, Emotional, and Behavioral Correlates of Fear of Missing Out. Computers in Human Behavior 29, 4 (2013), 1841--1848. DOI: http://dx.doi.org/10.1016/j.chb.2013.02.014",
      "doi": ""
    },
    {
      "text": "Donald A. Redelmeier and Daniel Kahneman. 1996. Patients' Memories of Painful Medical Treatments: Real-Time and Retrospective Evaluations of Two Minimally Invasive Procedures. Pain 66, 1 (1996), 3--8. DOI: http://dx.doi.org/10.1016/0304--3959(96)02994--6",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke and Wilhelm Hofmann. 2016. Slacking off or Winding down? An Experience Sampling Study on the Drivers and Consequences of Media Use for Recovery versus Procrastination. Human Communication Research 42, 3 (jul 2016), 441--461. DOI: http://dx.doi.org/10.1111/hcre.12082",
      "doi": ""
    },
    {
      "text": "Richard W. Robins, Holly M. Hendin, and Kali H. Trzesniewski. 2001. Measuring Global Self-Esteem: Construct Validation of a Single-Item Measure and the Rosenberg Self-Esteem Scale. Personality and Social Psychology Bulletin 27, 2 (2001), 151--161. DOI: http://dx.doi.org/10.1177/0146167201272002",
      "doi": ""
    },
    {
      "text": "Larry D. Rosen, L. Mark Carrier, and Nancy A. Cheever. 2013. Facebook and Texting Made Me Do It: Media-Induced Task-Switching While Studying. Computers in Human Behavior 29, 3 (2013), 948--958. DOI: http://dx.doi.org/10.1016/j.chb.2012.12.001",
      "doi": "10.1016/j.chb.2012.12.001"
    },
    {
      "text": "Sana Rouis, Moez Limayem, and Esmail Salehi-Sangari. 2011. Impact of Facebook Usage on Students' Academic Achievement: Role of Self-Regulation and Trust. Electronic Journal of Research in Educational Psychology 25 (2011), 34.",
      "doi": ""
    },
    {
      "text": "Tracii Ryan, Andrea Chester, John Reece, and Sophia Xenos. 2014. The Uses and Abuses of Facebook: A Review of Facebook Addiction. Journal of Behavioural Addictions 3, 3 (2014), 133--148. DOI: http://dx.doi.org/10.1556/JBA.3.2014.016",
      "doi": ""
    },
    {
      "text": "Michael Scharkow. 2016. The Accuracy of Self-Reported Internet Use - A Validation Study Using Client Log Data. Communication Methods and Measures 10, 1 (jan 2016), 13--27. DOI: http://dx.doi.org/10.1080/19312458.2015.1118446",
      "doi": ""
    },
    {
      "text": "Janet K. Swim and Brittany Bloodhart. 2013. Admonishment and Praise: Interpersonal Mechanisms for Promoting Proenvironmental Behavior. Ecopsychology 5, 1 (March 2013), 24--35. DOI: http://dx.doi.org/10.1089/eco.2012.0065",
      "doi": ""
    },
    {
      "text": "D M Tice, E Bratslavsky, and R F Baumeister. 2001. Emotional Distress Regulation Takes Precedence over Impulse Control: If You Feel Bad, Do It! Journal of personality and social psychology 80, 1 (2001), 53--67. DOI: http://dx.doi.org/10.1037/0022--3514.80.1.53",
      "doi": ""
    },
    {
      "text": "Morten Tromholt. 2016. The Facebook Experiment: Quitting Facebook Leads to Higher Levels of Well-Being. Cyberpsychology, Behavior and Social Networking 19, 11 (nov 2016), 661--666. DOI: http://dx.doi.org/10.1089/cyber.2016.0259",
      "doi": ""
    },
    {
      "text": "U.S. Senate Committee On Commerce, Science, & Transportation. 2019. Optimizing for Engagement: Understanding the Use of Persuasive Technology on Internet Platforms. (jun 2019). https://www.commerce.senate.gov/public/index.cfm/2019/ 6/optimizing-for-engagement-understanding-the-useof-persuasive-technology-on-internet-platforms",
      "doi": ""
    },
    {
      "text": "Eric J. Vanman, Rosemary Baker, and Stephanie J. Tobin. 2018. The Burden of Online Friends: The Effects of Giving up Facebook on Stress and Well-Being. The Journal of Social Psychology 158, 4 (jul 2018), 496--508. DOI: http://dx.doi.org/10.1080/00224545.2018.1453467",
      "doi": ""
    },
    {
      "text": "Philippe Verduyn, David Seungjae Lee, Jiyoung Park, Holly Shablack, Ariana Orvell, Joseph Bayer, Oscar Ybarra, John Jonides, and Ethan Kross. 2015. Passive Facebook Usage Undermines Affective Well-Being: Experimental and Longitudinal Evidence. Journal of Experimental Psychology. General 144, 2 (apr 2015), 480--488. DOI: http://dx.doi.org/10.1037/xge0000057",
      "doi": ""
    },
    {
      "text": "Yiran Wang and Gloria Mark. 2018. The Context of College Students' Facebook Use and Academic Performance: An Empirical Study. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 418:1--418:11. DOI: http://dx.doi.org/10.1145/3173574.3173992",
      "doi": ""
    },
    {
      "text": "Isabella Wolniczak, José Alonso Cáceres-DelAguila, Gabriela Palma-Ardiles, Karen J. Arroyo, Rodrigo Solís-Visscher, Stephania Paredes-Yauri, Karina Mego-Aquije, and Antonio Bernabe-Ortiz. 2013. Association between Facebook Dependence and Poor Sleep Quality: A Study in a Sample of Undergraduate Students in Peru. PloS One 8, 3 (2013), e59087. DOI: http://dx.doi.org/10.1371/journal.pone.0059087",
      "doi": ""
    },
    {
      "text": "Shan Xu, Zheng (Joyce) Wang, and Prabu David. 2016. Media Multitasking and Well-Being of University Students. Comput. Hum. Behav. 55, PA (feb 2016), 242--250. DOI: http://dx.doi.org/10.1016/j.chb.2015.08.040",
      "doi": ""
    }
  ]
}