{
  "doi": "10.1145/3313831.3376444",
  "title": "Assessing Severity of Pulmonary Obstruction from Respiration Phase-Based Wheeze-Sensing Using Mobile Sensors",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Obstructive pulmonary diseases cause limited airflow from the lung and severely affect patients' quality of life. Wheeze is one of the most prominent symptoms for them. High requirements imposed by traditional diagnosis methods make regular monitoring of pulmonary obstruction challenging, which hinders the opportunity of early intervention and prevention of significant exacerbation. In this work, we explore the feasibility of developing a mobile sensor-based system as a convenient means of assessing the severity of pulmonary obstruction via respiration phase-based symptomatic wheeze sensing. We conduct a 131 subjects' (91 patients and 40 healthy) study for the detection (F1: 87.96%) and characterization (F1: 79.47%) of wheeze. Subsequently, we develop novel wheeze metrics, which show a significant correlation (Pearson's correlation: -0.22, p-value: 0.024) with standard spirometry measure of pulmonary obstruction severity. This work takes a principal step towards the unobtrusive assessment of pulmonary condition from mobile sensor interactions.",
  "authors": [
    {
      "name": "Soujanya Chatterjee",
      "institution": "University of Memphis, Memphis, TN, USA",
      "img": "/do/10.1145/contrib-99658753594/rel-imgonly/professionalpic.jpg",
      "acmid": "99658753594",
      "orcid": "missing"
    },
    {
      "name": "Md Mahbubur Rahman",
      "institution": "Samsung Research America, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659432516",
      "orcid": "0000-0002-3236-1666"
    },
    {
      "name": "Tousif Ahmed",
      "institution": "Samsung Research America, Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-99658705436/rel-imgonly/392319_319112251452441_1138476323_n.jpg",
      "acmid": "99658705436",
      "orcid": "0000-0003-1085-6294"
    },
    {
      "name": "Nazir Saleheen",
      "institution": "University of Memphis, Memphis, TN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658749747",
      "orcid": "missing"
    },
    {
      "name": "Ebrahim Nemati",
      "institution": "Samsung Research America, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659432984",
      "orcid": "0000-0002-6406-1086"
    },
    {
      "name": "Viswam Nathan",
      "institution": "Samsung Research America, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659617124",
      "orcid": "missing"
    },
    {
      "name": "Korosh Vatanparvar",
      "institution": "Samsung Research America, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658710415",
      "orcid": "missing"
    },
    {
      "name": "Jilong Kuang",
      "institution": "Samsung Research America, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433386",
      "orcid": "0000-0003-2942-9102"
    }
  ],
  "references": [
    {
      "text": "Mohsin Y. Ahmed, Md Mahbubur Rahman, Viswam Nathan, Ebrahim Nemati, Korosh Vatanparvar, and Jilong Kuang. 2019. mlung: Privacy-preserving naturally windowed lung activity detection for pulmonary patients. In 2019 IEEE 16th International Conference on Wearable and Implantable Body Sensor Networks (BSN). IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Pere Almagro, Pablo Martinez-Camblor, Joan B. Soriano, Jose M. Marin, Inmaculada Alfageme, Ciro Casanova, Cristobal Esteban, Juan J Soler-Cataluna, Juan P De-Torres, Bartolome R Celli, and others. 2014. Finding the best thresholds of FEV1 and dyspnea to predict 5-year survival in COPD patients: the COCOMICS study. PLoS One 9, 2 (2014), e89866.",
      "doi": ""
    },
    {
      "text": "Justice Amoh and Kofi Odame. 2013. Technologies for developing ambulatory cough monitoring devices. Critical ReviewsTM in Biomedical Engineering 41, 6 (2013).",
      "doi": ""
    },
    {
      "text": "Rummana Bari, Roy J Adams, Md Mahbubur Rahman, Megan Battles Parsons, Eugene H Buder, and Santosh Kumar. 2018. rConverse: Moment by moment conversation detection using a mobile respiration sensor. Proceedings of the ACM on interactive, mobile, wearable and ubiquitous technologies 2, 1 (2018), 2.",
      "doi": "10.1145/3191734"
    },
    {
      "text": "Christos C Bellos, Athanasios Papadopoulos, Roberto Rosso, and Dimitrios I Fotiadis. 2013. Identification of COPD patients' health status using an intelligent system in the CHRONIOUS wearable platform. IEEE journal of biomedical and health informatics 18, 3 (2013), 731--738.",
      "doi": ""
    },
    {
      "text": "Christian Bime, Christine Y. Wei, Janet T. Holbrook, Marianna M. Sockrider, Dennis A Revicki, and Robert A Wise. 2012. Asthma symptom utility index: reliability, validity, responsiveness, and the minimal important difference in adult asthmatic patients. Journal of Allergy and Clinical Immunology 130, 5 (2012), 1078--1084.",
      "doi": ""
    },
    {
      "text": "Christopher M. Bishop. 2006. Pattern recognition and machine learning. springer.",
      "doi": ""
    },
    {
      "text": "Simon E Brill and Jadwiga A Wedzicha. 2014. Oxygen therapy in acute exacerbations of chronic obstructive pulmonary disease. International journal of chronic obstructive pulmonary disease 9 (2014), 1241.",
      "doi": ""
    },
    {
      "text": "RL Burden, J.D. Faires, and A.M. Burden. 2010. Numerical analysis: Cengage Learning. (2010).",
      "doi": ""
    },
    {
      "text": "José A Castro-Rodríguez, Catharine J Holberg, Anne L Wright, and Fernando D Martinez. 2000. A clinical index to define risk of asthma in young children with recurrent wheezing. American journal of respiratory and critical care medicine 162, 4 (2000), 1403--1406.",
      "doi": ""
    },
    {
      "text": "Soujanya Chatterjee, Md Mahbubur Rahman, Ebrahim Nemati, and Jilong Kuang. 2019. WheezeD: Respiration Phase Based Wheeze Detection Using Acoustic Data From Pulmonary Patients Under Attack. EAI. DOI: http://dx.doi.org/10.4108/eai.20--5--2019.2283516",
      "doi": ""
    },
    {
      "text": "Qian Cheng, Joshua Juen, Shashi Bellam, Nicholas Fulara, Deanna Close, Jonathan C Silverstein, and Bruce Schatz. 2017. Predicting pulmonary function from phone sensors. Telemedicine and e-Health 23, 11 (2017), 913--919.",
      "doi": ""
    },
    {
      "text": "Jen-Chien Chien, Huey-Dong Wu, Fok-Ching Chong, and Chung-I Li. 2007. Wheeze detection using cepstral analysis in gaussian mixture models. In 2007 29th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE, 3168--3171.",
      "doi": ""
    },
    {
      "text": "Marco Clari, Maria Matarese, Dhurata Ivziku, and Maria Grazia De Marinis. 2017. Self-care of people with chronic obstructive pulmonary disease: a meta-synthesis. The Patient-Patient-Centered Outcomes Research 10, 4 (2017), 407--427.",
      "doi": ""
    },
    {
      "text": "Saso Deroski and Bernard Senko. 2004. Is combining classifiers with stacking better than selecting the best one? Machine learning 54, 3 (2004), 255--273.",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Elliot Saba, Maia Stiber, Eric Whitmire, Josh Fromm, Eric C Larson, Gaetano Borriello, and Shwetak N Patel. 2016. Spirocall: Measuring lung function over a phone call. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5675--5685.",
      "doi": "10.1145/2858036.2858401"
    },
    {
      "text": "Mark Andrew Hall. 1999. Correlation-based feature selection for machine learning. (1999).",
      "doi": ""
    },
    {
      "text": "Maxine Hardinge, Heather Rutter, Carmelo Velardo, Syed Ahmar Shah, Veronika Williams, Lionel Tarassenko, and Andrew Farmer. 2015. Using a mobile health application to support self-management in chronic obstructive pulmonary disease: a six-month cohort study. BMC medical informatics and decision making 15, 1 (2015), 46.",
      "doi": ""
    },
    {
      "text": "Semra Içer and Serife Gengeç. 2014. Classification and analysis of non-stationary characteristics of crackle and rhonchus lung adventitious sounds. Digital Signal Processing 28 (2014), 18--27.",
      "doi": "10.1016/j.dsp.2014.02.001"
    },
    {
      "text": "PixSoft Inc. Accessed Sept, 2019. R.A.L.E Lung Sound. http://www.rale.ca/",
      "doi": ""
    },
    {
      "text": "Christian Infante, Daniel Chamberlain, R Fletcher, Y Thorat, and Rahul Kodgule. 2017. Use of cough sounds for diagnosis and screening of pulmonary disease. In 2017 IEEE Global Humanitarian Technology Conference (GHTC). IEEE, 1--10.",
      "doi": ""
    },
    {
      "text": "Richard S Irwin, Peter J Barnes, and H Hollingsworth. 2013. Evaluation of wheezing illnesses other than asthma in adults. UpToDate. Waltham: UpToDate (2013).",
      "doi": ""
    },
    {
      "text": "PW Jones, G Harding, P Berry, I Wiklund, WH Chen, and N Kline Leidy. 2009a. Development and first validation of the COPD Assessment Test. European Respiratory Journal 34, 3 (2009), 648--654.",
      "doi": ""
    },
    {
      "text": "Paul Jones, Gale Harding, Ingela Wiklund, Pamela Berry, and Nancy Leidy. 2009b. Improving the process and outcome of care in COPD: development of a standardised assessment tool. Primary Care Respiratory Journal 18, 3 (2009), 208.",
      "doi": ""
    },
    {
      "text": "Joshua Juen, Qian Cheng, Valentin Prieto-Centurion, Jerry A Krishnan, and Bruce Schatz. 2014. Health monitors for chronic disease by gait analysis with mobile phones. Telemedicine and e-Health 20, 11 (2014), 1035--1041.",
      "doi": ""
    },
    {
      "text": "Joshua Juen, Qian Cheng, and Bruce Schatz. 2015. A natural walking monitor for pulmonary patients using mobile phones. IEEE Journal of biomedical and health informatics 19, 4 (2015), 1399--1405.",
      "doi": ""
    },
    {
      "text": "Kunal Khanade and Farzan Sasangohar. 2017. Stress, fatigue, and workload in intensive care nursing: a scoping literature review. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 61. SAGE Publications Sage CA: Los Angeles, CA, 686--690.",
      "doi": ""
    },
    {
      "text": "Eric C Larson, Mayank Goel, Gaetano Boriello, Sonya Heltshe, Margaret Rosenfeld, and Shwetak N Patel. 2012. SpiroSmart: using a microphone to measure lung function on a mobile phone. In Proceedings of the 2012 ACM Conference on ubiquitous computing. ACM, 280--289.",
      "doi": "10.1145/2370216.2370261"
    },
    {
      "text": "Shih-Hong Li, Bor-Shing Lin, Chen-Han Tsai, Cheng-Ta Yang, and Bor-Shyh Lin. 2017. Design of wearable breathing sound monitoring system for real-time wheeze detection. Sensors 17, 1 (2017), 171.",
      "doi": ""
    },
    {
      "text": "3M Littman. Accessed Sept, 2019. Littmann repository. https://www.littmann.ca/3M/en_CA/littmann-stethoscopes-ca/",
      "doi": ""
    },
    {
      "text": "Xi Liu, Wee Ser, Jianmin Zhang, and Daniel Yam Thiam Goh. 2015. Detection of adventitious lung sounds using entropy features and a 2-D threshold setting. In 2015 10th International Conference on Information, Communications and Signal Processing (ICICS). IEEE, 1--5.",
      "doi": ""
    },
    {
      "text": "Erin M Lowery, Aleah L Brubaker, Erica Kuhlmann, and Elizabeth J Kovacs. 2013. The aging lung. Clinical interventions in aging 8 (2013), 1489.",
      "doi": ""
    },
    {
      "text": "FD Martinez. 1999. Recognizing early asthma. Allergy 54 (1999), 24--28.",
      "doi": ""
    },
    {
      "text": "N Meslier, G Charbonneau, and JL Racineux. 1995. Wheezes. European respiratory journal 8, 11 (1995), 1942--1948.",
      "doi": ""
    },
    {
      "text": "Martin R Miller, JATS Hankinson, V Brusasco, F Burgos, R Casaburi, A Coates, R Crapo, P vd Enright, CPM Van Der Grinten, P Gustafsson, and others. 2005. Standardisation of spirometry. European respiratory journal 26, 2 (2005), 319--338.",
      "doi": ""
    },
    {
      "text": "Fizza Ghulam Nabi, Kenneth Sundaraj, Chee Kiang Lam, and Rajkumar Palaniappan. 2019. Characterization and classification of asthmatic wheeze sounds according to severity level using spectral integrated features. Computers in biology and medicine 104 (2019), 52--61.",
      "doi": ""
    },
    {
      "text": "Ana Oliveira, Cátia Pinho, João Dinis, Daniela Oliveira, and Alda Marques. 2013. Automatic Wheeze Detection and Lung Function Evaluation-A Preliminary Study.. In HEALTHINF. 323--326.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2017. Chronic obstructive pulmonary disease (COPD). https://www.who.int/en/news-room/fact-sheets/detail/ chronic-obstructive-pulmonary-disease-(copd). (Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Koksoon Phua, Jianfeng Chen, Tran Huy Dat, and Louis Shue. 2008. Heart sound as a biometric. Pattern Recognition 41, 3 (2008), 906--919.",
      "doi": "10.1016/j.patcog.2007.07.018"
    },
    {
      "text": "Renard Xaviero Adhi Pramono, Stuart Bowyer, and Esther Rodriguez-Villegas. 2017. Automatic adventitious respiratory sound analysis: A systematic review. PloS one 12, 5 (2017), e0177926.",
      "doi": ""
    },
    {
      "text": "Ho-Kyeong Ra, Asif Salekin, Hee Jung Yoon, Jeremy Kim, Shahriar Nirjon, David J Stone, Sujeong Kim, Jong-Myung Lee, Sang Hyuk Son, and John A Stankovic. 2016. AsthmaGuide: an asthma monitoring and advice ecosystem. In 2016 IEEE Wireless Health (WH). IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Klaus F Rabe, Suzanne Hurd, Antonio Anzueto, Peter J Barnes, Sonia A Buist, Peter Calverley, Yoshinosuke Fukuchi, Christine Jenkins, Roberto Rodriguez-Roisin, Chris Van Weel, and others. 2007. Global strategy for the diagnosis, management, and prevention of chronic obstructive pulmonary disease: GOLD executive summary. American journal of respiratory and critical care medicine 176, 6 (2007), 532--555.",
      "doi": ""
    },
    {
      "text": "Md Mahbubur Rahman, Rummana Bari, Amin Ahsan Ali, Moushumi Sharmin, Andrew Raij, Karen Hovsepian, Syed Monowar Hossain, Emre Ertin, Ashley Kennedy, David H Epstein, and others. 2014b. Are we there yet?: Feasibility of continuous stress assessment via wireless physiological sensors. In Proceedings of the 5th ACM Conference on Bioinformatics, Computational Biology, and Health Informatics. ACM, 479--488.",
      "doi": "10.1145/2649387.2649433"
    },
    {
      "text": "Md Mahbubur Rahman, Viswam Nathan, Ebrahim Nemati, Korosh Vatanparvar, Mohsin Ahmed, and Jilong Kuang. 2019. Towards Reliable Data Collection and Annotation to Extract Pulmonary Digital Biomarkers Using Mobile Sensors. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, 179--188.",
      "doi": "10.1145/3329189.3329204"
    },
    {
      "text": "Tauhidur Rahman, Alexander Travis Adams, Mi Zhang, Erin Cherry, Bobby Zhou, Huaishu Peng, and Tanzeem Choudhury. 2014a. BodyBeat: a mobile system for sensing non-speech body sounds.. In MobiSys, Vol. 14. Citeseer, 2--13.",
      "doi": "10.1145/2594368.2594386"
    },
    {
      "text": "Md Mahbubur Rahman et al. 2018. InstantRR: Instantaneous Respiratory Rate Estimation on Context-aware Mobile Devices. In EAI International Conference on Body Area Networks.",
      "doi": ""
    },
    {
      "text": "R.J. Riella, P. Nohama, and J.M. Maia. 2009. Method for automatic detection of wheezing in lung sounds. Brazilian Journal of Medical and Biological Research 42, 7 (2009), 674--684.",
      "doi": ""
    },
    {
      "text": "Nazir Saleheen, Amin Ahsan Ali, Syed Monowar Hossain, Hillol Sarker, Soujanya Chatterjee, Benjamin Marlin, Emre Ertin, Mustafa Al'Absi, and Santosh Kumar. 2015. puffMarker: a multi-sensor approach for pinpointing the timing of first lapse in smoking cessation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 999--1010.",
      "doi": "10.1145/2750858.2806897"
    },
    {
      "text": "Malay Sarkar, Irappa Madabhavi, Narasimhalu Niranjan, and Megha Dogra. 2015. Auscultation of the respiratory system. Annals of thoracic medicine 10, 3 (2015), 158.",
      "doi": ""
    },
    {
      "text": "Simone Schleede, Felix G Meinel, Martin Bech, Julia Herzen, Klaus Achterhold, Guillaume Potdevin, Andreas Malecki, Silvia Adam-Neumair, Sven F. Thieme, Fabian Bamberg, and others. 2012. Emphysema diagnosis using X-ray dark-field imaging at a laser-driven compact synchrotron light source. Proceedings of the National Academy of Sciences 109, 44 (2012), 17880--17885.",
      "doi": ""
    },
    {
      "text": "Björn Schuller, Stefan Steidl, Anton Batliner, Felix Burkhardt, Laurence Devillers, Christian Müller, and Shrikanth S Narayanan. 2010. The INTERSPEECH 2010 paralinguistic challenge. In Eleventh Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "Terence A.R. Seemungal, Gavin C. Donaldson, Angshu Bhowmik, Donald J Jeffries, and Jadwiga A Wedzicha. 2000. Time course and recovery of exacerbations in patients with chronic obstructive pulmonary disease. American journal of respiratory and critical care medicine 161, 5 (2000), 1608--1613.",
      "doi": ""
    },
    {
      "text": "Chang S. Shim and M Henry Williams. 1983. Relationship of wheezing to the severity of obstruction in asthma. Archives of internal medicine 143, 5 (1983), 890--892.",
      "doi": ""
    },
    {
      "text": "Sheree M.S. Smith, Stephen Jan, Joseph Descallar, and Guy B Marks. 2019. An investigation of methods to improve recall for the patient-reported outcome measurement in COPD patients: a pilot randomised control trial and feasibility study protocol. Pilot and feasibility studies 5, 1 (2019), 92.",
      "doi": ""
    },
    {
      "text": "Joan B Soriano, Jan Zielinski, and David Price. 2009. Screening for and early detection of chronic obstructive pulmonary disease. The Lancet 374, 9691 (2009), 721--732.",
      "doi": ""
    },
    {
      "text": "Germán D. Sosa, Angel Cruz-Roa, and Fabio A. González. 2015. Automatic detection of wheezes by evaluation of multiple acoustic feature extraction methods and C-weighted SVM. In 10th International Symposium on Medical Information Processing and Analysis, Vol. 9287. International Society for Optics and Photonics, 928709.",
      "doi": ""
    },
    {
      "text": "SoundCloud. Accessed Sept, 2019. SoundCloud. https://soundcloud.com/search?q=lung%20sounds",
      "doi": ""
    },
    {
      "text": "Chris Stenton. 2008. The MRC breathlessness scale. Occupational Medicine 58, 3 (2008), 226--227.",
      "doi": ""
    },
    {
      "text": "Tharoeun Thap, Heewon Chung, Changwon Jeong, Ki-Eun Hwang, Hak-Ryul Kim, Kwon-Ha Yoon, and Jinseok Lee. 2016. High-resolution time-frequency spectrum-based lung function test from a smartphone microphone. Sensors 16, 8 (2016), 1305.",
      "doi": ""
    },
    {
      "text": "Ralph Turner, Michael DePietro, and Bo Ding. 2018. Overlap of asthma and chronic obstructive pulmonary disease in patients in the United States: analysis of prevalence, features, and subtypes. JMIR public health and surveillance 4, 3 (2018), e60.",
      "doi": ""
    },
    {
      "text": "Korosh Vatanparvar, Viswam Nathan, Ebrahim Nemati, Md Mahbubur Rahman, and Jilong Kuang. 2019. A Generative Model for Speech Segmentation and Obfuscation for Remote Health Monitoring. In 2019 IEEE 16th International Conference on Wearable and Implantable Body Sensor Networks (BSN). IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Peter Welch. 1967. The use of fast Fourier transform for the estimation of power spectra: a method based on time averaging over short, modified periodograms. IEEE Transactions on audio and electroacoustics 15, 2 (1967), 70--73.",
      "doi": ""
    },
    {
      "text": "Veronika Williams, Jonathan Price, Maxine Hardinge, Lionel Tarassenko, and Andrew Farmer. 2014. Using a mobile health application to support self-management in COPD: a qualitative study. Br J Gen Pract 64, 624 (2014), e392--e400.",
      "doi": ""
    },
    {
      "text": "Marcin Wi´ sniewski and Tomasz Zieli´ nski. 2010. Digital analysis methods of wheezes in asthma. In Signals and Electronic Systems (ICSES), 2010 International Conference on. IEEE, 69--72.",
      "doi": ""
    },
    {
      "text": "Fen Yang, Yuncui Wang, Chongming Yang, Hui Hu, and Zhenfang Xiong. 2018. Mobile health applications in self-management of patients with chronic obstructive pulmonary disease: a systematic review and meta-analysis of their efficacy. BMC pulmonary medicine 18, 1 (2018), 147.",
      "doi": ""
    },
    {
      "text": "Jianmin Zhang, Wee Ser, Jufeng Yu, and TT Zhang. 2009. A novel wheeze detection method for wearable monitoring systems. In Intelligent Ubiquitous Computing and Education, 2009 International Symposium on. IEEE, 331--334.",
      "doi": "10.1109/IUCE.2009.66"
    },
    {
      "text": "Fatma Zubaydi, Assim Sagahyroon, Fadi Aloul, and Hasan Mir. 2017. MobSpiro: Mobile based spirometry for detecting COPD. In 2017 IEEE 7th Annual Computing and Communication Workshop and Conference (CCWC). IEEE, 1--4.",
      "doi": ""
    }
  ]
}