{
  "doi": "10.1145/3313831.3376867",
  "title": "Relational Aspects in Patient-provider Interactions: A Facial Paralysis Case Study",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Facial appearance is significant for everyday interactions, but hundreds of thousands of people have interactions negatively affected by facial paralysis (FP) annually. FP treatment utilizes multiple components and requires significant collaboration amongst multidisciplinary specialists and patients. Complex interactions in these contexts offer ample challenges for designers to technologically support healthcare providers in their processes. We conduct a formative case study, employing 20 clinic observations and 11 interviews, to investigate FP treatment workflow. We use cognitive authority theory (CAT) to understand relational factors in patient-provider collaboration. We then pinpoint structural and relational components of workflow challenges and discuss the utility of these distinctions; notably, we identify that patient adherence lapses caused by perceived plateaus may be primarily relational and caused by unmet expectations. Our work adds to patient-provider interaction literature and sheds light upon technology design for healthcare team contexts with significant patient obligations.",
  "authors": [
    {
      "name": "Haining Zhu",
      "institution": "Pennsylvania State University, State College, PA, USA",
      "img": "/do/10.1145/contrib-99659161075/rel-imgonly/hainingzhu.jpg",
      "acmid": "99659161075",
      "orcid": "missing"
    },
    {
      "name": "Zachary J. Moffa",
      "institution": "Independent Researcher, Huntingdon, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659305418",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ofra Amir, Barbara J Grosz, Krzysztof Z Gajos, Sonja M Swenson, and Lee M Sanders. 2015. From care plans to care coordination: Opportunities for computer support of teamwork in complex healthcare. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1419--1428.",
      "doi": "10.1145/2702123.2702320"
    },
    {
      "text": "Marie-Paule Austin, Philip Mitchell, and Guy M Goodwin. 2001. Cognitive deficits in depression: possible implications for functional neuropathology. The British Journal of Psychiatry 178, 3 (2001), 200--206.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1982. Self-efficacy mechanism in human agency. American psychologist 37, 2 (1982), 122.",
      "doi": ""
    },
    {
      "text": "Ida Björkman, Magnus Simrén, Gisela Ringström, and Eva Jakobsson Ung. 2016. Patientsâ ? A´ Z experiences of healthcare encounters in severe irritable bowel syndrome: an analysis based on narrative and feminist theory. Journal of clinical nursing 25, 19--20 (2016), 2967--2978.",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Erik Berndt, Ken Catchpole, Dominic Furniss, Astrid Mayer, Helena Mentis, Aisling Ann O'Kane, Tom Owen, Atish Rajkomar, and Rebecca Randell. 2012. Experiencing Interactive Healthcare Technologies: embracing 'the wild' on its own terms. Invited submission to ToCHI's special issue on 'The Turn to the Wild (2012).",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Erik Berndt, Ken Catchpole, Dominic Furniss, Astrid Mayer, Helena Mentis, Aisling Ann O'Kane, Tom Owen, Atish Rajkomar, and Rebecca Randell. 2015. Strategies for conducting situated studies of technology use in hospitals. Cognition, Technology & Work 17, 4 (2015), 489--502.",
      "doi": "10.1007/s10111-014-0318-7"
    },
    {
      "text": "Joel N Bleicher, Steve Hamiel, Jon S Gengler, and J Antimarino. 1996. A survey of facial paralysis: etiology and incidence. Ear, nose, & throat journal 75, 6 (1996), 355--358.",
      "doi": ""
    },
    {
      "text": "Elizabeth Boland, Teresa Monsod, Maria Delucia, Cynthia A Brandt, Sanjay Fernando, and William V Tamborlane. 2001. Limitations of conventional methods of self-monitoring of blood glucose: lessons learned from 3 days of continuous glucose sensing in pediatric patients with type 1 diabetes. Diabetes care 24, 11 (2001), 1858--1862.",
      "doi": ""
    },
    {
      "text": "Jennifer S Brach and Jessie M Van Swearingen. 1999. Physical therapy for facial paralysis: a tailored treatment approach. Physical therapy 79, 4 (1999), 397--404.",
      "doi": ""
    },
    {
      "text": "Linda E Carlson, Joshua J Lounsberry, Olga Maciejewski, Kristin Wright, Vivian Collacutt, and Paul Taenzer. 2012. Telehealth-delivered group smoking cessation for rural and urban participants: Feasibility and cessation rates. Addictive behaviors 37, 1 (2012), 108--114.",
      "doi": ""
    },
    {
      "text": "Jane Carthey. 2003. The role of structured observational research in health care. BMJ Quality & Safety 12, suppl 2 (2003), ii13--ii16.",
      "doi": ""
    },
    {
      "text": "Yunan Chen. 2010. Documenting transitional information in EMR. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1787--1796.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, Sidney Harrison, and Victoria Duong. 2011. Unpacking exam-room computing: negotiating computer-use in patient-physician interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3343--3352.",
      "doi": "10.1145/1978942.1979438"
    },
    {
      "text": "Yu Chen and Pearl Pu. 2014. HealthyTogether: exploring social incentives for mobile fitness applications. In Proceedings of the second international symposium of Chinese chi. ACM, 25--34.",
      "doi": "10.1145/2592235.2592240"
    },
    {
      "text": "Lawrence J Cheskin and Laurie Friedman Donze. 2001. Appearance vs health as motivators for weight loss. JAMA 286, 17 (2001), 2160--2160.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Saeed Abdullah, Mashfiqui Rabbi, Edison Thomaz, Daniel A Epstein, Matthew Kay, Felicia Cordeiro, Gregory D Abowd, Tanzeem Choudhury, James Fogarty, Bongshin Lee, Mark Matthews, and Julie A Kientz. 2017a. Semi-automated tracking: a balanced approach for self-monitoring applications. Pervasive Computing (2017).",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017b. Understanding self-reflection: how people reflect on personal data through visual data exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, 173--182.",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Chia-Fang Chung, Kristin Dew, Allison Cole, Jasmine Zia, James Fogarty, Julie A Kientz, and Sean A Munson. 2016. Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 770--786.",
      "doi": "10.1145/2818048.2819926"
    },
    {
      "text": "Ali Darejeh and Siti Salwah Salim. 2016. Gamification solutions to enhance software user engagement-a systematic review. International Journal of Human-Computer Interaction 32, 8 (2016), 613--642.",
      "doi": ""
    },
    {
      "text": "Mary Jo Deering, Erin Siminerio, and Scott Weinstein. 2013. Issue brief: patient-generated health data and health IT. Office of the National Coordinator for Health Information Technology (2013), 1--11.",
      "doi": ""
    },
    {
      "text": "JD Deven McGraw, Helen R Pfister, and Susan R Ingargiola. Lessons from Project HealthDesign. (????).",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Munmun De Choudhury, and Mor Naaman. 2012. Finding and assessing social media information sources in the context of journalism. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2451--2460.",
      "doi": "10.1145/2207676.2208409"
    },
    {
      "text": "H Jacqueline Diels. 2000. Facial paralysis: is there a role for a therapist? Facial Plastic Surgery 16, 04 (2000), 361--364.",
      "doi": ""
    },
    {
      "text": "Patrick Doiron-Cadrin, Dahlia Kairy, Pascal-André Vendittoli, Véronique Lowry, Stéphane Poitras, and François Desmeules. 2018. Feasibility and preliminary effects of a tele-prehabilitation program and an in-person prehablitation program compared to usual care for total hip or knee arthroplasty candidates: a pilot randomized controlled trial. Disability and rehabilitation (2018), 1--10.",
      "doi": ""
    },
    {
      "text": "Inger Ekman, Karl Swedberg, Charles Taft, Anders Lindseth, Astrid Norberg, Eva Brink, Jane Carlsson, Synneve Dahlin-Ivanoff, Inga-Lill Johansson, Karin Kjellgren, and others. 2011. Person-centered care - Ready for prime time. European journal of cardiovascular nursing 10, 4 (2011), 248--251.",
      "doi": ""
    },
    {
      "text": "Vanessa Ferreira, Ramanakumar V Agnihotram, Andreas Bergdahl, Stefanus J van Rooijen, Rashami Awasthi, Francesco Carli, and Celena Scheede-Bergdahl. 2018. Maximizing patient adherence to prehabilitation: what do the patients say? Supportive Care in Cancer (2018), 1--7.",
      "doi": ""
    },
    {
      "text": "Richard Frankel, Andrea Altschuler, Sheba George, James Kinsman, Holly Jimison, Nan R Robertson, and John Hsu. 2005. Effects of exam-room computing on clinician-patient communication. Journal of General Internal Medicine 20, 8 (2005), 677--682.",
      "doi": ""
    },
    {
      "text": "BM Frier, MM Jensen, and BD Chubb. 2016. Hypoglycaemia in adults with insulin-treated diabetes in the UK: self-reported frequency and effects. Diabetic Medicine 33, 8 (2016), 1125--1132.",
      "doi": ""
    },
    {
      "text": "Dominic Furniss, Rebecca Randell, Aisling Ann O'Kane, Svetlena Taneva, Helena Mentis, and Ann Blandford. 2014. Fieldwork for healthcare: guidance for investigating human factors in computing systems. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 3, 2 (2014), 1--146.",
      "doi": "10.5555/2616402"
    },
    {
      "text": "Karen Glanz, Barbara K Rimer, and Kasisomayajula Viswanath. 2008. Health behavior and health education: theory, research, and practice. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Sheldon Greenfield, Sherrie Kaplan, and John E Ware. 1985. Expanding patient involvement in care: effects on patient outcomes. Annals of internal medicine 102, 4 (1985), 520--528.",
      "doi": ""
    },
    {
      "text": "Devon Greyson. 2017. Health information practices of young parents. Journal of Documentation 73, 5 (2017), 778--802.",
      "doi": ""
    },
    {
      "text": "Noora Hirvonen, Alisa Tirroniemi, and Terttu Kortelainen. 2019. The cognitive authority of user-generated health information in an online forum for girls and young women. Journal of Documentation 75, 1 (2019), 78--98.",
      "doi": ""
    },
    {
      "text": "WE House. 1985. Facial nerve grading system. Otolaryngol Head Neck Surg 93 (1985), 184--193.",
      "doi": ""
    },
    {
      "text": "Katherine J Hunt and Carl R May. 2017. Managing expectations: cognitive authority and experienced control in complex healthcare processes. BMC health services research 17, 1 (2017), 459.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A Kientz. 2012. Lullaby: a capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 226--234.",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Yoojung Kim, Eunyoung Heo, Hyunjeong Lee, Sookyoung Ji, Jueun Choi, Jeong-Whun Kim, Joongseek Lee, and Sooyoung Yoo. 2017. Prescribing 10,000 steps like aspirin: designing a novel interface for data-driven medical consultations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5787--5799.",
      "doi": "10.1145/3025453.3025570"
    },
    {
      "text": "Aaron M Kosins, Keith A Hurvitz, Gregory Rd Evans, and Garrett A Wirth. 2007. Facial paralysis for the plastic surgeon. Canadian Journal of Plastic Surgery 15, 2 (2007), 77--82.",
      "doi": ""
    },
    {
      "text": "R Lewis and F Cramp. 2010. Facilitators and barriers to exercise maintenance in chronic obstructive pulmonary disease: patient views. Physiotherapy Practice and Research 31, 2 (2010), 19--24.",
      "doi": ""
    },
    {
      "text": "PHAN Lo An, Alexander Helhorn, Henner M Kruse, Eric Thomas, Andrew J Heidel, Kutaiba Saleh, Florian Rissner, Martin Specht, Andreas Henkel, André Scherag, and others. 2019. Approaching Clinical Data Transformation from Disparate Healthcare IT Systems hrough a Modular Framework. In ICT for Health Science Research: Proceedings of the EFMI 2019 Special Topic Conference, Vol. 258. IOS Press, 85.",
      "doi": ""
    },
    {
      "text": "Meethu Malu and Leah Findlater. 2017. Sharing automatically tracked activity data: implications for therapists and people with mobility impairments. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, 136--145.",
      "doi": "10.1145/3154862.3154864"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 477--486.",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Gabriela Marcu, Kevin Tassini, Quintin Carlson, Jillian Goodwyn, Gabrielle Rivkin, Kevin J Schaefer, Anind K Dey, and Sara Kiesler. 2013. Why do they still use paper?: understanding data collection and use in Autism education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3177--3186.",
      "doi": "10.1145/2470654.2466436"
    },
    {
      "text": "Carl R May, David T Eton, Kasey Boehmer, Katie Gallacher, Katherine Hunt, Sara MacDonald, Frances S Mair, Christine M May, Victor M Montori, Alison Richardson, and others. 2014. Rethinking the patient: using Burden of Treatment Theory to understand the changing dynamics of illness. BMC health services research 14, 1 (2014), 281.",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Kerry S Courneya, David L Rudolph, and Curt L Lox. 1994. Enhancing exercise adherence in middle-aged males and females. Preventive medicine 23, 4 (1994), 498--506.",
      "doi": ""
    },
    {
      "text": "Helena M Mentis, Anita Komlodi, Katrina Schrader, Michael Phipps, Ann Gruber-Baldini, Karen Yarbrough, and Lisa Shulman. 2017. Crafting a view of self-tracking data in the clinical visit. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5800--5812.",
      "doi": "10.1145/3025453.3025589"
    },
    {
      "text": "Tara Mullaney, Helena Pettersson, Tufve Nyholm, and Erik Stolterman. 2012. Thinking beyond the cure: A case for human-centered design in cancer care. International Journal of Design 6, 3 (2012).",
      "doi": ""
    },
    {
      "text": "Elizabeth L Murnane, Tara G Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal informatics in interpersonal contexts: towards the design of technology that supports the social ecologies of long-term mental health management. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 127.",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Tao Ni, Amy K Karlson, and Daniel Wigdor. 2011. AnatOnMe: facilitating doctor-patient communication using a projection-based handheld device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3333--3342.",
      "doi": "10.1145/1978942.1979437"
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 6 (2015), 33.",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Rachel O'Conor, Michael S Wolf, Samuel G Smith, Melissa Martynenko, Daniel P Vicencio, Mary Sano, Juan P Wisnivesky, and Alex D Federman. 2015. Health literacy, cognitive function, proper use, and adherence to inhaled asthma controller medications among older adults with asthma. Chest 147, 5 (2015), 1307--1315.",
      "doi": ""
    },
    {
      "text": "Lucille ML Ong, Johanna CJM De Haes, Alaysia M Hoos, and Frits B Lammes. 1995. Doctor-patient communication: a review of the literature. Social science & medicine 40, 7 (1995), 903--918.",
      "doi": ""
    },
    {
      "text": "Venet Osmani, Daqing Zhang, and Sasitharan Balasubramaniam. 2009. Human activity recognition supporting context-appropriate reminders for elderly. In 2009 3rd International Conference on Pervasive Computing Technologies for Healthcare. IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Rocco Palumbo. 2016. Contextualizing co-production of health care: a systematic literature review. International Journal of Public Sector Management 29, 1 (2016), 72--90.",
      "doi": ""
    },
    {
      "text": "Sun Young Park, So Young Lee, and Yunan Chen. 2012. The effects of EMR deployment on doctors' work practices: A qualitative study in the emergency department of a teaching hospital. International journal of medical informatics 81, 3 (2012), 204--217.",
      "doi": ""
    },
    {
      "text": "Rupa A Patel, Predrag Klasnja, Andrea Hartzler, Kenton T Unruh, and Wanda Pratt. 2012. Probing the benefits of real-time tracking during cancer care. In AMIA Annual Symposium Proceedings, Vol. 2012. American Medical Informatics Association, 1340.",
      "doi": ""
    },
    {
      "text": "Fernando Plazzotta, C John III, Fernando D Storani, Juan Marcos Ortiz, Gastón E López, Gastón M Gimenez, and Daniel R Luna. 2015. Multimedia Health Records: user-centered design approach for a multimedia uploading service.. In MIE. 474--478.",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Min Hane Aung, Mi Zhang, and Tanzeem Choudhury. 2015. MyBehavior: automatic personalized health feedback from user behaviors and preferences using smartphones. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 707--718.",
      "doi": "10.1145/2750858.2805840"
    },
    {
      "text": "Brenda G Ross, Gaeton Fradet, and Julian M Nedzelski. 1996. Development of a sensitive clinical facial grading system. Otolaryngology-Head and Neck Surgery 114, 3 (1996), 380--386.",
      "doi": ""
    },
    {
      "text": "Laura Schopp, Brick Johnstone, and Deb Merrell. 2000. Telehealth and neuropsychological assessment: New opportunities for psychologists. Professional Psychology: Research and Practice 31, 2 (2000), 179.",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Jane Hoffswell, Chia-Fang Chung, James Fogarty, Sean Munson, and Jasmine Zia. 2017. Supporting patient-provider collaboration to identify individual triggers using food and symptom journals. In CSCW: proceedings of the Conference on Computer-Supported Cooperative Work. Conference on Computer-Supported Cooperative Work, Vol. 2017. NIH Public Access, 1726.",
      "doi": ""
    },
    {
      "text": "TS Shafshak. 2006. The treatment of facial palsy from the point of view of physical and rehabilitation medicine. Europa medicophysica 42, 1 (2006), 41.",
      "doi": ""
    },
    {
      "text": "Enrique V Smith-Forbes, Dana M Howell, Jason Willoughby, Hilary Armstrong, Donald G Pitts, and Tim L Uhl. 2016. Adherence of individuals in upper extremity rehabilitation: a qualitative study. Archives of physical medicine and rehabilitation 97, 8 (2016), 1262--1268.",
      "doi": ""
    },
    {
      "text": "Melisa A Spaling, Kay Currie, Patricia H Strachan, Karen Harkness, and Alexander M Clark. 2015. Improving support for heart failure patients: a systematic review to understand patients' perspectives on self-care. Journal of advanced nursing 71, 11 (2015), 2478--2489.",
      "doi": ""
    },
    {
      "text": "Moira Stewart, Judith Belle Brown, Heather Boon, Joanne Galajda, Leslie Meredith, Michelle Sangster, and others. 1999. Evidence on patient-doctor communication. Cancer 25, 1999 (1999), 30.",
      "doi": ""
    },
    {
      "text": "Melanie Swan. 2009. Emerging patient-driven health care models: an examination of health social networks, consumer personalized medicine and quantified self-tracking. International journal of environmental research and public health 6, 2 (2009), 492--525.",
      "doi": ""
    },
    {
      "text": "Lazaro J Teixeira, Juliana S Valbuza, and Gilmar F Prado. 2011. Physical therapy for Bell's palsy (idiopathic facial paralysis). The Cochrane Library (2011).",
      "doi": ""
    },
    {
      "text": "Figen Tuncay, Pnar Borman, Burcu Taser, Ilhan Ünlü, and Erdal Samim. 2015. Role of electrical stimulation added to conventional therapy in patients with idiopathic facial (Bell) palsy. American journal of physical medicine & rehabilitation 94, 3 (2015), 222--228.",
      "doi": ""
    },
    {
      "text": "Kim M Unertl, Matthew B Weinger, and Kevin B Johnson. 2006. Applying direct observation to model workflow and assess adoption. In AMIA Annual Symposium proceedings, Vol. 2006. American Medical Informatics Association, 794.",
      "doi": ""
    },
    {
      "text": "Kim M Unertl, Matthew B Weinger, Kevin B Johnson, and Nancy M Lorenzi. 2009. Describing and modeling workflow and information flow in chronic disease care. Journal of the American Medical Informatics Association 16, 6 (2009), 826--836.",
      "doi": ""
    },
    {
      "text": "Kenton T Unruh, Meredith Skeels, Andrea Civan-Hartzler, and Wanda Pratt. 2010. Transforming clinic environments into information workspaces for patients. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 183--192.",
      "doi": "10.1145/1753326.1753354"
    },
    {
      "text": "Nancy Van House. 2004. Weblogs: Credibility and collaboration in an online world. In Computer Supported Cooperative Work Workshop.",
      "doi": ""
    },
    {
      "text": "Patrick Wilson. 1983. Second-hand knowledge: An inquiry into cognitive authority. (1983).",
      "doi": ""
    },
    {
      "text": "Deborah Rohm Young, Joel Gittelsohn, Jeanne Charleston, Kaytura Felix-Aaron, and Lawrence J Appel. 2001. Motivations for exercise and weight loss among African-American women: focus group results and their contribution towards program development. Ethnicity & health 6, 3--4 (2001), 227--245.",
      "doi": ""
    },
    {
      "text": "Leslie A Zebrowitz and Joann M Montepare. 2008. Social psychological face perception: Why appearance matters. Social and personality psychology compass 2, 3 (2008), 1497--1517.",
      "doi": ""
    },
    {
      "text": "Haining Zhu and John M Carroll. 2018. Multidisciplinary Care for Facial Paralysis Patients: Collaboration between Carers. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 189--192.",
      "doi": "10.1145/3272973.3274052"
    },
    {
      "text": "Haining Zhu, Joanna Colgan, Madhu Reddy, and Eun Kyoung Choe. 2016. Sharing patient-generated data in clinical practices: an interview study. In AMIA Annual Symposium Proceedings, Vol. 2016. American Medical Informatics Association, 1303.",
      "doi": ""
    },
    {
      "text": "Haining Zhu, Yuhan Luo, and Eun Kyoung Choe. 2017. Making Space for the Quality Care: Opportunities for Technology in Cognitive Behavioral Therapy for Insomnia. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5773--5786.",
      "doi": "10.1145/3025453.3025549"
    },
    {
      "text": "Haining Zhu, Zachary Moffa, Xiying Wang, Saeed Abdullah, Juxihong Julaiti, and John Carroll. 2018. Understanding Challenges in Prehabilitation for Patients with Multiple Chronic Conditions. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, 138--147.",
      "doi": "10.1145/3240925.3240959"
    }
  ]
}