{
  "doi": "10.1145/3313831.3376791",
  "title": "On Conducting Security Developer Studies with CS Students: Examining a Password-Storage Study with CS Students, Freelancers, and Company Developers",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Ecological validity is a major concern in usable security studies with developers. Many studies are conducted with computer science (CS) students out of convenience, since recruiting professional software developers in sufficient numbers is very challenging. In a password-storage study, Naiakshina et al. (CHI'19) showed that CS students behave similarly to freelance developers recruited online. While this is a promising result for conducting developer studies with students, an open question remains: Do professional developers employed in companies behave similarly as well? To provide more insight into the ecological validity of recruiting students for security developer studies, we replicated the study of Naiakshina et al. with developers from diverse companies in Germany. We found that developers employed in companies performed better than students and freelancers in a direct comparison. However, treatment effects were found to be significant in all groups; the treatment effects on CS students also held for company developers.",
  "tags": [
    "developer password study",
    "student developer",
    "security developer study",
    "usable security and privacy"
  ],
  "authors": [
    {
      "name": "Alena Naiakshina",
      "institution": "University of Bonn, Bonn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659215356",
      "orcid": "missing"
    },
    {
      "name": "Anastasia Danilova",
      "institution": "University of Bonn, Bonn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659215656",
      "orcid": "missing"
    },
    {
      "name": "Eva Gerlitz",
      "institution": "Fraunhofer FKIE, Bonn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366076",
      "orcid": "0000-0003-1251-5629"
    },
    {
      "name": "Matthew Smith",
      "institution": "University of Bonn & Fraunhofer FKIE, Bonn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81485645929",
      "orcid": "0000-0002-2724-1379"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. JavaServer Faces (JSF). ([n.d.]). Retrieved August 31, 2019 from https://javaee.github.io/javaserverfaces-spec/",
      "doi": ""
    },
    {
      "text": "[n.d.]. Spring. ([n.d.]). Retrieved August 31, 2019 from https://spring.io/projects/spring-framework",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Michael Backes, Sascha Fahl, Simson Garfinkel, Doowon Kim, Michelle L Mazurek, and Christian Stransky. 2017. Comparing the Usability of Cryptographic APIs. In Security and Privacy (SP), 2017 IEEE Symposium on. IEEE, IEEE, San Jose, CA, USA, 154--171.",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Michael Backes, Sascha Fahl, Doowon Kim, Michelle L Mazurek, and Christian Stransky. 2016a. You Get Where You're Looking for: The Impact of Information Sources on Code Security. In 2016 IEEE Symposium on Security and Privacy (SP). IEEE Press, Piscataway, NJ, USA, 289--305. http://dx.doi.org/10.1109/SP.2016.25",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Sascha Fahl, and Michelle L Mazurek. 2016b. You are Not Your Developer, Either: A Research Agenda for Usable Security and Privacy Research Beyond End Users. In Cybersecurity Development (SecDev), IEEE. IEEE, IEEE Press, Piscataway, NJ, USA, 3--8.",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Christian Stransky, Dominik Wermke, Michelle L. Mazurek, and Sascha Fahl. 2017. Security Developer Studies with GitHub Users: Exploring a Convenience Sample. In Thirteenth Symposium on Usable Privacy and Security (SOUPS 2017). USENIX Association, Santa Clara, CA, 81--95. https://www.usenix.org/conference/soups2017/technical-sessions/presentation/acar",
      "doi": ""
    },
    {
      "text": "Anne Adams and Martina Angela Sasse. 1999. Users are not the enemy. Commun. ACM 42, 12 (1999), 40--46.",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Hala Assal and Sonia Chiasson. 2019. 'Think Secure from the Beginning': A Survey with Software Developers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 289, 13 pages. http://dx.doi.org/10.1145/3290605.3300519",
      "doi": "10.1145/3290605.3300519"
    },
    {
      "text": "Rebecca Balebako, Abigail Marsh, Jialiu Lin, Jason I Hong, and Lorrie Faith Cranor. 2014. The Privacy and Security Behaviors of Smartphone App Developers. (2014).",
      "doi": ""
    },
    {
      "text": "Titus Barik, Justin Smith, Kevin Lubick, Elisabeth Holmes, Jing Feng, Emerson Murphy-Hill, and Chris Parnin. 2017. Do Developers Read Compiler Error Messages?. In Proceedings of the 39th International Conference on Software Engineering (ICSE '17). IEEE Press, Piscataway, NJ, USA, 575--585. http://dx.doi.org/10.1109/ICSE.2017.59",
      "doi": "10.1109/ICSE.2017.59"
    },
    {
      "text": "Patrik Berander. 2004. Using Students as Subjects in Requirements Prioritization. In Empirical Software Engineering, 2004. ISESE'04. Proceedings. 2004 International Symposium on. IEEE, IEEE, Redondo Beach, CA, USA, 167--176.",
      "doi": ""
    },
    {
      "text": "Alex Biryukov, Daniel Dinu, and Dmitry Khovratovich. 2015. Argon2: the memory-hard function for password hashing and other applications. Technical Report. Tech. rep., Password Hashing Competition (PHC).",
      "doi": ""
    },
    {
      "text": "Kenneth P Burnham and David R Anderson. 2004. Multimodel inference: understanding AIC and BIC in model selection. Sociological methods & research 33, 2 (2004), 261--304.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educational and psychological measurement 20, 1 (1960), 37--46.",
      "doi": ""
    },
    {
      "text": "Joseph L Fleiss, Bruce Levin, and Myunghee Cho Paik. 2013. Statistical methods for rates and proportions. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Nahid Golafshani. 2003. Understanding reliability and validity in qualitative research. The qualitative report 8, 4 (2003), 597--606.",
      "doi": ""
    },
    {
      "text": "Paul A Grassi, James L Fenton, EM Newton, RA Perlner, AR Regenscheid, WE Burr, JP Richer, NB Lefkovitz, JM Danker, Yee-Yin Choong, and others. 2017. NIST Special Publication 800--63b: Digital Identity Guidelines. Enrollment and Identity Proofing Requirements. url:https://pages.nist.gov/800--63--3/sp800--63b.html (2017).",
      "doi": ""
    },
    {
      "text": "Matthew Green and Matthew Smith. 2016. Developers are Not the Enemy!: The Need for Usable Security APIs. IEEE Security & Privacy 14, 5 (2016), 40--46.",
      "doi": "10.1109/MSP.2016.111"
    },
    {
      "text": "George Hatzivasilis, Ioannis Papaefstathiou, and Charalampos Manifavas. 2015. Password Hashing Competition-Survey and Benchmark. IACR Cryptology ePrint Archive 2015 (2015), 265.",
      "doi": ""
    },
    {
      "text": "Martin Höst, Björn Regnell, and Claes Wohlin. 2000. Using Students as Subjects- A Comparative Study of Students and Professionals in Lead-Time Impact Assessment. Empirical Software Engineering 5, 3 (2000), 201--214.",
      "doi": "10.1023/A%3A1026586415054"
    },
    {
      "text": "Shubham Jain and Janne Lindqvist. 2014. Should I protect you? Understanding developers' behavior to privacy-preserving APIs. In Workshop on Usable Security, Vol. 2014.",
      "doi": ""
    },
    {
      "text": "Brittany Johnson, Yoonki Song, Emerson Murphy-Hill, and Robert Bowdidge. 2013. Why Don't Software Developers Use Static Analysis Tools to Find Bugs?. In Proceedings of the 2013 International Conference on Software Engineering (ICSE '13). IEEE Press, Piscataway, NJ, USA, 672--681. http://dl.acm.org/citation.cfm?id=2486788.2486877",
      "doi": "10.5555/2486788.2486877"
    },
    {
      "text": "Katharina Krombholz, Wilfried Mayer, Martin Schmiedecker, and Edgar Weippl. 2017. \"I Have No Idea What Itextquoterightm Doing\" - On the Usability of Deploying HTTPS. In 26th USENIX Security Symposium (USENIX Security 17). USENIX Association, Vancouver, BC, 1339--1356. https://www.usenix.org/conference/usenixsecurity17/technical-sessions/presentation/krombholz",
      "doi": ""
    },
    {
      "text": "Thomas D. LaToza, Gina Venolia, and Robert DeLine. 2006a. Maintaining Mental Models: A Study of Developer Work Habits. In Proceedings of the 28th International Conference on Software Engineering (ICSE '06). ACM, New York, NY, USA, 492--501. http://dx.doi.org/10.1145/1134285.1134355",
      "doi": "10.1145/1134285.1134355"
    },
    {
      "text": "Thomas D LaToza, Gina Venolia, and Robert DeLine. 2006b. Maintaining mental models: a study of developer work habits. In Proceedings of the 28th international conference on Software engineering. ACM, 492--501.",
      "doi": "10.1145/1134285.1134355"
    },
    {
      "text": "L. Layman, L. Williams, and R. S. Amant. 2007. Toward Reducing Fault Fix Time: Understanding Developer Behavior for the Design of Automated Fault Detection Tools. In First International Symposium on Empirical Software Engineering and Measurement (ESEM 2007). 176--185. http://dx.doi.org/10.1109/ESEM.2007.11",
      "doi": ""
    },
    {
      "text": "Brad A Myers and Jeffrey Stylos. 2016. Improving API Usability. Commun. ACM 59, 6 (2016), 62--69.",
      "doi": "10.1145/2896587"
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Eva Gerlitz, Emanuel von Zezschwitz, and Matthew Smith. 2019. \"If You Want, I Can Store the Encrypted Password\": A Password-Storage Field Study with Freelance Developers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 140, 12 pages. http://dx.doi.org/10.1145/3290605.3300370",
      "doi": "10.1145/3290605.3300370"
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Christian Tiefenau, Marco Herzog, Sergej Dechand, and Matthew Smith. 2017. Why Do Developers Get Password Storage Wrong?: A Qualitative Usability Study. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (CCS '17). ACM, New York, NY, USA, 311--328. http://dx.doi.org/10.1145/3133956.3134082",
      "doi": "10.1145/3133956.3134082"
    },
    {
      "text": "Alena Naiakshina, Anastasia Danilova, Christian Tiefenau, and Matthew Smith. 2018. Deception Task Design in Developer Password Studies: Exploring a Student Sample. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, USA, 297--313. https://www.usenix.org/conference/soups2018/presentation/naiakshina",
      "doi": ""
    },
    {
      "text": "[n.d.]. [n.d.]a. LinkedIn. ([n.d.]). https://www.linkedin.com Accessed: September 2019.",
      "doi": ""
    },
    {
      "text": "[n.d.]. [n.d.]b. Open Web Application Security Project (OWASP). ([n.d.]). https://github.com/OWASP/CheatSheetSeries/blob/master/cheatsheets/Password_Storage_Cheat_Sheet.md Accessed: September 2019.",
      "doi": ""
    },
    {
      "text": "[n.d.]. [n.d.]c. Random (Java SE 11 & JDK 11 ) - Oracle Docs. ([n.d.]). Retrieved September 05, 2019 from https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/Random.html",
      "doi": ""
    },
    {
      "text": "[n.d.]. [n.d.]d. SecureRandom (Java SE 11 & JDK 11 ) - Oracle Docs. ([n.d.]). Retrieved September 05, 2019 from https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/security/SecureRandom.html",
      "doi": ""
    },
    {
      "text": "[n.d.]. [n.d.]e. XING. ([n.d.]). Retrieved August 31, 2019 from https://www.xing.com/",
      "doi": ""
    },
    {
      "text": "Duc Cuong Nguyen, Dominik Wermke, Yasemin Acar, Michael Backes, Charles Weir, and Sascha Fahl. 2017. A Stitch in Time: Supporting Android Developers in WritingSecure Code. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (CCS '17). ACM, New York, NY, USA, 1065--1077. http://dx.doi.org/10.1145/3133956.3133977",
      "doi": "10.1145/3133956.3133977"
    },
    {
      "text": "Lutz Prechelt. 2011. Plat_Forms: A Web Development Platform Comparison by an Exploratory Experiment Searching for Emergent Platform Properties. IEEE Transactions on Software Engineering 37, 1 (Jan 2011), 95--108. http://dx.doi.org/10.1109/TSE.2010.22",
      "doi": "10.1109/TSE.2010.22"
    },
    {
      "text": "Iflaah Salman, Ayse Tosun Misirli, and Natalia Juristo. 2015. Are students representatives of professionals in software engineering experiments?. In Proceedings of the 37th International Conference on Software Engineering-Volume 1. IEEE Press, IEEE, Florence, Italy, 666--676.",
      "doi": "10.5555/2818754.2818836"
    },
    {
      "text": "M Angela Sasse. 2003. Computer security: Anatomy of a usability disaster, and a plan for recovery. (2003).",
      "doi": ""
    },
    {
      "text": "Martina Angela Sasse, Sacha Brostoff, and Dirk Weirich. 2001. Transforming the `weakest link' - a human/computer interaction approach to usable and effective security. BT technology journal 19, 3 (2001), 122--131.",
      "doi": ""
    },
    {
      "text": "R. Scandariato, J. Walden, and W. Joosen. 2013. Static analysis versus penetration testing: A controlled experiment. In 2013 IEEE 24th International Symposium on Software Reliability Engineering (ISSRE). IEEE Press, Piscataway, NJ, USA, 451--460. http://dx.doi.org/10.1109/ISSRE.2013.6698898",
      "doi": ""
    },
    {
      "text": "Dag IK Sjoberg, Bente Anda, Erik Arisholm, Tore Dyba, Magne Jorgensen, Amela Karahasanovic, Espen Frimann Koren, and Marek Vokác. 2002. Conducting realistic experiments in software engineering. In Proceedings international symposium on empirical software engineering. IEEE, IEEE Press, Piscataway, NJ, USA, 17--26.",
      "doi": ""
    },
    {
      "text": "Malcolm Smith. 2017. Research methods in accounting. Sage.",
      "doi": ""
    },
    {
      "text": "Mikael Svahnberg, Aybüke Aurum, and Claes Wohlin. 2008. Using Students As Subjects - an Empirical Evaluation. In Proceedings of the Second ACM-IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '08). ACM, New York, NY, USA, 288--290. http://dx.doi.org/10.1145/1414004.1414055",
      "doi": "10.1145/1414004.1414055"
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "T. Thomas, B. Chu, H. Lipford, J. Smith, and E. Murphy-Hill. 2015. A study of interactive code annotation for access control vulnerabilities. In 2015 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE Press, Piscataway, NJ, USA, 73--77. http://dx.doi.org/10.1109/VLHCC.2015.7357200",
      "doi": ""
    },
    {
      "text": "Tyler W. Thomas, Heather Lipford, Bill Chu, Justin Smith, and Emerson Murphy-Hill. 2016. What Questions Remain? An Examination of How Developers Understand an Interactive Static Analysis Tool. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO. https://www.usenix.org/conference/soups2016/workshop-program/wsiw16/presentation/thomas",
      "doi": ""
    },
    {
      "text": "Alma Whitten and J Doug Tygar. 1999. Why Johnny Can't Encrypt: A Usability Evaluation of PGP 5.0.. In Usenix Security, Vol. 1999.",
      "doi": "10.5555/1251421.1251435"
    },
    {
      "text": "Chamila Wijayarathna and Nalin A. G. Arachchilage. 2018. Why Johnny Can't Store Passwords Securely?: A Usability Evaluation of Bouncycastle Password Hashing. In Proceedings of the 22Nd International Conference on Evaluation and Assessment in Software Engineering 2018 (EASE'18). ACM, New York, NY, USA, 205--210. http://dx.doi.org/10.1145/3210459.3210483",
      "doi": ""
    },
    {
      "text": "J. Xie, H. R. Lipford, and B. Chu. 2011. Why do programmers make security errors?. In 2011 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE Press, Piscataway, NJ, USA, 161--164. http://dx.doi.org/10.1109/VLHCC.2011.6070393",
      "doi": ""
    },
    {
      "text": "Khaled Yakdan, Sergej Dechand, Elmar Gerhards-Padilla, and Matthew Smith. 2016. Helping Johnny to Analyze Malware: A Usability-Optimized Decompiler and Malware Analysis User Study. In Security and Privacy (SP), 2016 IEEE Symposium on. IEEE, IEEE, San Jose, CA, USA, 158--177.",
      "doi": ""
    }
  ]
}