{
  "doi": "10.1145/3313831.3376865",
  "title": "Gaiters: Exploring Skin Stretch Feedback on Legs for Enhancing Virtual Reality Experiences",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "We propose generating two-dimensional skin stretch feedback on the user's legs. Skin stretch is useful cutaneous feedback to induce the perception of virtual textures and illusory forces and to deliver directional cues. This feedback has been applied to the head, body, and upper limbs to simulate rich physical properties in virtual reality (VR). However, how to expand the benefit of skin stretch feedback and apply it to the lower limbs, remains to be explored. Our first two psychophysical studies examined the minimum changes in skin stretch distance and stretch angle that are perceivable by participants. We then designed and implemented Gaiters, a pair of ungrounded, leg-worn devices, each of which is able to generate multiple two-dimensional skin stretches on the skin of the user's leg. With Gaiters, we conducted an exploratory study to understand participants' experiences when coupling skin stretch patterns with various lower limb actions. The results indicate that rich haptic experiences can be created by our prototype. Finally, a user evaluation indicates that participants enjoyed the experiences when using Gaiters and considered skin stretch as compelling haptic feedback on the legs.",
  "authors": [
    {
      "name": "Chi Wang",
      "institution": "National Taiwan University & National Chiao Tung University, Taipei & Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314429",
      "orcid": "missing"
    },
    {
      "name": "Da-Yuan Huang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/do/10.1145/contrib-81551198756/rel-imgonly/81551198756.jpg",
      "acmid": "81551198756",
      "orcid": "missing"
    },
    {
      "name": "Shuo-Wen Hsu",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473888",
      "orcid": "missing"
    },
    {
      "name": "Cheng-Lung Lin",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475008",
      "orcid": "missing"
    },
    {
      "name": "Yeu-Luen Chiu",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473625",
      "orcid": "missing"
    },
    {
      "name": "Chu-En Hou",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314264",
      "orcid": "missing"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    }
  ],
  "references": [
    {
      "text": "Ahmed Al Maimani and Anne Roudaut. 2017. Frozen Suit: Designing a Changeable Stiffness Suit and Its Application to Haptic Games. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2440--2448. DOI: http://dx.doi.org/10.1145/3025453.3025655",
      "doi": "10.1145/3025453.3025655"
    },
    {
      "text": "Karlin Bark, Jason W Wheeler, Sunthar Premakumar, and Mark R Cutkosky. 2008. Comparison of skin stretch and vibrotactile stimulation for feedback of proprioceptive information. In 2008 Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 71--78.",
      "doi": "10.1109/HAPTICS.2008.4479916"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: High-fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 717--728. DOI: http://dx.doi.org/10.1145/2984511.2984526",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Yi Cai, M Ishii, and M Sato. 1996. A human interface device for cave: size virtual workspace. In 1996 IEEE International Conference on Systems, Man and Cybernetics. Information Intelligence and Systems (Cat. No. 96CH35929), Vol. 3. IEEE, 2084--2089.",
      "doi": ""
    },
    {
      "text": "Nathaniel A Caswell, Ryan T Yardley, Markus N Montandon, and William R Provancher. 2012. Design of a forearm-mounted directional skin stretch device. In Haptics Symposium (HAPTICS), 2012 IEEE. IEEE, 365--370.",
      "doi": ""
    },
    {
      "text": "Hong-Yu Chang, Wen-Jie Tseng, Chia-En Tsai, Hsin-Yu Chen, Roshan Lalintha Peiris, and Liwei Chan. 2018. FacePush: Introducing Normal Force on Face with Head-Mounted Displays. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 927--935. DOI: http://dx.doi.org/10.1145/3242587.3242588",
      "doi": "10.1145/3242587.3242588"
    },
    {
      "text": "Daniel KY Chen, Iain A Anderson, Cameron G Walker, and Thor F Besier. 2016. Lower extremity lateral skin stretch perception for haptic feedback. IEEE transactions on haptics 9, 1 (2016), 62--68.",
      "doi": "10.1109/TOH.2016.2516012"
    },
    {
      "text": "Zikun Chen, Wei Peng, Roshan Peiris, and Kouta Minamizawa. 2017. ThermoReality: Thermally Enriched Head Mounted Displays for Virtual Reality. In ACM SIGGRAPH 2017 Posters (SIGGRAPH '17). ACM, NY, NY, USA, Article 32, 2 pages. DOI: http://dx.doi.org/10.1145/3102163.3102222",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Claudio Pacchierotti, Nikos G Tsagarakis, and Domenico Prattichizzo. 2016a. Design of a wearable skin stretch cutaneous device for the upper limb. In Haptics Symposium (HAPTICS), 2016 IEEE. IEEE, 14--20.",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Claudio Pacchierotti, Nikos G Tsagarakis, and Domenico Prattichizzo. 2016b. Design of a wearable skin stretch cutaneous device for the upper limb. In Haptics Symposium (HAPTICS), 2016 IEEE. IEEE, 14--20.",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R. Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 119--130. DOI: http://dx.doi.org/10.1145/3126594.3126599",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, NY, NY, USA, 117--119. DOI: http://dx.doi.org/10.1145/2984751.2985725",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 654, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174228",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Fabien Danieau, Philippe Guillotel, Olivier Dumas, Thomas Lopez, Bertrand Leroy, and Nicolas Mollet. 2018. HFX Studio: Haptic Editor for Full-body Immersive Experiences. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (VRST '18). ACM, NY, NY, USA, Article 37, 9 pages. DOI: http://dx.doi.org/10.1145/3281505.3281518",
      "doi": "10.1145/3281505.3281518"
    },
    {
      "text": "Victor Adriel de Jesus Oliveira, Luca Brayda, Luciana Nedel, and Anderson Maciel. 2017. Experiencing guidance in 3D spaces with a vibrotactile head-mounted display. In 2017 IEEE Virtual Reality (VR). IEEE, 453--454.",
      "doi": ""
    },
    {
      "text": "Alexandra Delazio, Ken Nakagaki, Roberta L. Klatzky, Scott E. Hudson, Jill Fain Lehman, and Alanson P. Sample. 2018. Force Jacket: Pneumatically-Actuated Jacket for Embodied Haptic Experiences. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 320, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173894",
      "doi": "10.1145/3173574.3173894"
    },
    {
      "text": "Paul Dempsey. 2016. The teardown: HTC Vive VR headset. Engineering & Technology 11, 7--8 (2016), 80--81.",
      "doi": ""
    },
    {
      "text": "Farzam Farbiz, Zhou Hao Yu, Corey Manders, and Waqas Ahmad. 2007. An Electrical Muscle Stimulation Haptic Feedback for Mixed Reality Tennis Game. In ACM SIGGRAPH 2007 Posters (SIGGRAPH '07). ACM, NY, NY, USA, Article 140. DOI: http://dx.doi.org/10.1145/1280720.1280873",
      "doi": ""
    },
    {
      "text": "Brian T Gleeson, Scott K Horschel, and William R Provancher. 2009. Communication of direction through lateral skin stretch at the fingertip. In EuroHaptics conference, 2009 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics 2009. Third Joint. IEEE, 172--177.",
      "doi": "10.1109/WHC.2009.4810804"
    },
    {
      "text": "Brian T Gleeson, Scott K Horschel, and William R Provancher. 2010. Perception of direction for applied tangential skin displacement: Effects of speed, displacement, and repetition. IEEE transactions on haptics 3, 3 (2010), 177--188.",
      "doi": ""
    },
    {
      "text": "Brian T Gleeson, Charles A Stewart, and William R Provancher. 2011. Improved tactile shear feedback: Tactor design and an aperture-based restraint. IEEE Transactions on Haptics 4, 4 (2011), 253--262.",
      "doi": "10.1109/TOH.2010.56"
    },
    {
      "text": "Peter E Gruenbaum, William A McNeely, HA Sowizral, TL Overman, and BW Knutson. 1997. Implementation of dynamic robotic graphics for a virtual control panel. Presence: Teleoperators & Virtual Environments 6, 1 (1997), 118--126.",
      "doi": "10.1162/pres.1997.6.1.118"
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality Using Head Worn Flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 227--232. DOI: http://dx.doi.org/10.1145/2984511.2984535",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "Ashley L. Guinan, Markus N. Montandon, Andrew J. Doxon, and William R. Provancher. 2014. Discrimination thresholds for communicating rotational inertia and torque using differential skin stretch feedback in virtual environments. 2014 IEEE Haptics Symposium (HAPTICS) (2014), 277--282.",
      "doi": ""
    },
    {
      "text": "Ahmet Guzererler, William R Provancher, and Cagatay Basdogan. 2016. Perception of skin stretch applied to palm: Effects of speed and displacement. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 180--189.",
      "doi": "10.1007/978-3-319-42321-0_17"
    },
    {
      "text": "Arata Horie, Hikaru Nagano, Masashi Konyo, and Satoshi Tadokoro. 2018. Buttock skin stretch: inducing shear force perception and acceleration illusion on self-motion perception. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 135--147.",
      "doi": ""
    },
    {
      "text": "Da-Yuan Huang, Liwei Chan, Xiao-Feng Jian, Chiun-Yao Chang, Mu-Hsuan Chen, De-Nian Yang, Yi-Ping Hung, and Bing-Yu Chen. 2016. Vibroplay: Authoring Three-dimensional Spatial-temporal Tactile Effects with Direct Manipulation. In SIGGRAPH ASIA 2016 Emerging Technologies (SA '16). ACM, NY, NY, USA, Article 3, 2 pages. DOI: http://dx.doi.org/10.1145/2988240.2988250",
      "doi": "10.1145/2988240.2988250"
    },
    {
      "text": "Muhammad Afif B Husman, Hafiz Farhan Maqbool, Mohammed I Awad, Alireza Abouhossein, and Abbas A Dehghani-Sanij. 2016. A wearable skin stretch haptic feedback device: Towards improving balance control in lower limb amputees. In 2016 38th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 2120--2123.",
      "doi": ""
    },
    {
      "text": "Muhammad Afif B Husman, Hafiz Farhan Maqbool, Mohammed I Awad, and Abbas A Dehghani-Sanij. 2017. Portable haptic device for lower limb amputee gait feedback: Assessing static and dynamic perceptibility. In 2017 International Conference on Rehabilitation Robotics (ICORR). IEEE, 1562--1566.",
      "doi": ""
    },
    {
      "text": "Seungzoo Jeong, Naoki Hashimoto, and Sato Makoto. 2004. A Novel Interaction System with Force Feedback Between Real - and Virtual Human: An Entertainment System: \"Virtual Catch Ball\". In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, NY, NY, USA, 61--66. DOI: http://dx.doi.org/10.1145/1067343.1067350",
      "doi": "10.1145/1067343.1067350"
    },
    {
      "text": "Oliver Beren Kaul and Michael Rohs. 2017. HapticHead: A Spherical Vibrotactile Grid Around the Head for 3D Guidance in Virtual and Augmented Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3729--3740. DOI: http://dx.doi.org/10.1145/3025453.3025684",
      "doi": "10.1145/3025453.3025684"
    },
    {
      "text": "Yuki Kon, Takuto Nakamura, and Hiroyuki Kajimoto. 2017. HangerOVER: HMD-embedded Haptics Display with Hanger Reflex. In ACM SIGGRAPH 2017 Emerging Technologies (SIGGRAPH '17). ACM, NY, NY, USA, Article 11, 2 pages. DOI: http://dx.doi.org/10.1145/3084822.3084842",
      "doi": "10.1145/3084822.3084842"
    },
    {
      "text": "Yuki Kon, Takuto Nakamura, Michi Sato, Takashi Asahi, and Hiroyuki Kajimoto. 2016b. Hanger reflex of the head and waist with translational and rotational force perception. In International AsiaHaptics conference. Springer, 217--223.",
      "doi": ""
    },
    {
      "text": "Yuki Kon, Takuto Nakamura, Michi Sato, and Hiroyuki Kajimoto. 2016a. Effect of hanger reflex on walking. In 2016 IEEE Haptics Symposium (HAPTICS). IEEE, 313--318.",
      "doi": ""
    },
    {
      "text": "Yuki Kuniyasu, Michi Sato, Shogo Fukushima, and Hiroyuki Kajimoto. 2012. Transmission of Forearm Motion by Tangential Deformation of the Skin. In Proceedings of the 3rd Augmented Human International Conference (AH '12). ACM, NY, NY, USA, Article 16, 4 pages. DOI: http://dx.doi.org/10.1145/2160125.2160141",
      "doi": "10.1145/2160125.2160141"
    },
    {
      "text": "Jaeyeon Lee, Mike Sinclair, Mar Gonzalez-Franco, Eyal Ofek, and Christian Holz. 2019. TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 71, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300301",
      "doi": "10.1145/3290605.3300301"
    },
    {
      "text": "Jo-Yu Lo, Da-Yuan Huang, Chen-Kuo Sun, Chu-En Hou, and Bing-Yu Chen. 2018. RollingStone: Using Single Slip Taxel for Enhancing Active Finger Exploration with a Virtual Reality Controller. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 839--851. DOI: http://dx.doi.org/10.1145/3242587.3242627",
      "doi": "10.1145/3242587.3242627"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 11--19. DOI: http://dx.doi.org/10.1145/2807442.2807443",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1471--1482. DOI: http://dx.doi.org/10.1145/3025453.3025600",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding Force Feedback to Mixed Reality Experiences and Games Using Electrical Muscle Stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 446, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174020",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Kouta Minamizawa, Souichiro Fukamachi, Hiroyuki Kajimoto, Naoki Kawakami, and Susumu Tachi. 2007. Gravity grabber: wearable haptic display to present virtual mass sensation. In ACM SIGGRAPH 2007 emerging technologies. ACM, 8.",
      "doi": "10.1145/1278280.1278289"
    },
    {
      "text": "R. Omori, Y. Kuroda, S. Yoshimoto, and O. Oshiro. 2019. A Wearable Skin Stretch Device for Lower Limbs: Investigation of Curvature Effect on Slip. In 2019 IEEE World Haptics Conference (WHC). 37--42. DOI: http://dx.doi.org/10.1109/WHC.2019.8816129",
      "doi": ""
    },
    {
      "text": "Claudio Pacchierotti, Gionata Salvietti, Irfan Hussain, Leonardo Meli, and Domenico Prattichizzo. 2016. The hRing: A wearable haptic device to avoid occlusions in hand tracking. In Haptics Symposium (HAPTICS), 2016 IEEE. IEEE, 134--139.",
      "doi": ""
    },
    {
      "text": "C. Pacchierotti, S. Sinclair, M. Solazzi, A. Frisoli, V. Hayward, and D. Prattichizzo. 2017. Wearable Haptic Systems for the Fingertip and the Hand: Taxonomy, Review, and Perspectives. IEEE Transactions on Haptics 10, 4 (Oct 2017), 580--600. DOI: http://dx.doi.org/10.1109/TOH.2017.2689006",
      "doi": "10.1109/TOH.2017.2689006"
    },
    {
      "text": "Roshan Lalintha Peiris, Liwei Chan, and Kouta Minamizawa. 2018. LiquidReality: Wetness Sensations on the Face for Virtual Reality. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 366--378.",
      "doi": ""
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, Liwei Chan, and Kouta Minamizawa. 2017. ThermoVR: Exploring Integrated Thermal Haptic Feedback with Head Mounted Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5452--5456. DOI: http://dx.doi.org/10.1145/3025453.3025824",
      "doi": "10.1145/3025453.3025824"
    },
    {
      "text": "William R Provancher and Nicholas D Sylvester. 2009. Fingerpad skin stretch increases the perception of virtual friction. IEEE Transactions on Haptics 2, 4 (2009), 212--223.",
      "doi": "10.1109/TOH.2009.34"
    },
    {
      "text": "Zhan Fan Quek, Samuel B Schorr, Ilana Nisky, Allison M Okamura, and William R Provancher. 2014. Augmentation of stiffness perception with a 1-degree-of-freedom skin stretch device. IEEE Transactions on Human-Machine Systems 44, 6 (2014), 731--742.",
      "doi": ""
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1731--1742. DOI: http://dx.doi.org/10.1145/3025453.3025723",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "J Rigg. 2017. Teslasuit does full-body haptic feedback for VR. Engadget. (2017).",
      "doi": ""
    },
    {
      "text": "MHD Yamen Saraiji, Roshan Lalintha Peiris, Lichao Shen, Kouta Minamizawa, and Susumu Tachi. 2018. Ambient: Facial Thermal Feedback in Remotely Operated Applications. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article D321, 4 pages. DOI: http://dx.doi.org/10.1145/3170427.3186483",
      "doi": ""
    },
    {
      "text": "Michi Sato, Rika Matsue, Yuki Hashimoto, and Hiroyuki Kajimoto. 2009. Development of a head rotation interface by using hanger reflex. In Robot and Human Interactive Communication, 2009. RO-MAN 2009. The 18th IEEE International Symposium on. IEEE, 534--538.",
      "doi": ""
    },
    {
      "text": "Samuel B Schorr and Allison M Okamura. 2017a. Fingertip tactile devices for virtual object manipulation and exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3115--3119.",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Samuel Benjamin Schorr and Allison M Okamura. 2017b. Three-dimensional skin deformation as force substitution: Wearable device design and performance during haptic exploration of virtual environments. IEEE Transactions on Haptics 10, 3 (2017), 418--430.",
      "doi": "10.1109/TOH.2017.2672969"
    },
    {
      "text": "Massimiliano Solazzi, William R Provancher, Antonio Frisoli, and Massimo Bergamasco. 2011. Design of a SMA actuated 2-DoF tactile device for displaying tangential skin displacement. In World Haptics Conference (WHC), 2011 IEEE. IEEE, 31--36.",
      "doi": ""
    },
    {
      "text": "Andrew A Stanley and Katherine J Kuchenbecker. 2012. Evaluation of tactile feedback methods for wrist rotation guidance. IEEE Transactions on Haptics 5, 3 (2012), 240--251.",
      "doi": "10.1109/TOH.2012.33"
    },
    {
      "text": "Evan Strasnick, Christian Holz, Eyal Ofek, Mike Sinclair, and Hrvoje Benko. 2018. Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stiffness Actuation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 644, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174218",
      "doi": "10.1145/3173574.3174218"
    },
    {
      "text": "Jason Wheeler, Karlin Bark, Joan Savall, and Mark Cutkosky. 2010. Investigation of rotational skin stretch for proprioceptive feedback with application to myoelectric systems. IEEE Transactions on Neural Systems and Rehabilitation Engineering 18, 1 (2010), 58--66.",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfigurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 86, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173660",
      "doi": "10.1145/3173574.3173660"
    }
  ]
}