{
  "doi": "10.1145/3313831.3376738",
  "title": "Charge for a whole day: Extending Battery Life for BCI Wearables using a Lightweight Wake-Up Command",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Commercially available EEG-based Brain-Computer Interface (BCI) wearable headsets are always-on and are thus power hungry, requiring users to charge the headsets multiple times a day. In this paper, we tackle the problem of wake-up command design and detection for BCI headsets, and explore how battery life can be made to last for approximately a whole day. The key challenge that we address is enabling the headset to operate in a near-sleep mode but still reliably detect and interpret an EEG-based wake-up command from the user. Towards addressing the challenge, we present a solution that is built upon eye-blinks. Our core contribution is Trance, a user-friendly and robust wake-up command for BCI headsets that is computationally lightweight. We show using experimental results coupled with multiple data sets collected through user-studies that Trance can extend battery life by approximately 2.7x or to approximately 10 hours for a typical wearable battery, while remaining user-friendly.",
  "authors": [
    {
      "name": "Mohit Agarwal",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658740515",
      "orcid": "missing"
    },
    {
      "name": "Raghupathy Sivakumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106660",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "William Welby Abbott and Aldo Ahmed Faisal. 2012. Ultra-low-cost 3D gaze estimation: an intuitive high information throughput compliment to direct brain--machine interfaces. Journal of neural engineering 9, 4 (2012), 046016.",
      "doi": ""
    },
    {
      "text": "Apurva Adapa, Fiona Fui-Hoon Nah, Richard H Hall, Keng Siau, and Samuel N Smith. 2018. Factors influencing the adoption of smart wearable devices. International Journal of Human--Computer Interaction 34, 5 (2018), 399--409.",
      "doi": ""
    },
    {
      "text": "Mohit Agarwal and Raghupathy Sivakumar. 2015. THINK: Toward Practical General-Purpose Brain-Computer Communication. In Proceedings of the 2Nd International Workshop on Hot Topics in Wireless. ACM, 41--45.",
      "doi": "10.1145/2799650.2799659"
    },
    {
      "text": "Mohit Agarwal and Raghupathy Sivakumar. 2017. Poster: Characters vs. Words: Observations on Command Design for Brain-Computer Interfaces. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services. ACM, 177--177.",
      "doi": "10.1145/3081333.3089321"
    },
    {
      "text": "Mohit Agarwal and Raghupathy Sivakumar. 2019a. Blink: A Fully Automated Unsupervised Algorithm for Eye-Blink Detection in EEG Signals. In 2019 57th Annual Allerton Conference on Communication, Control, and Computing (Allerton). IEEE, 1113--1121.",
      "doi": ""
    },
    {
      "text": "Mohit Agarwal and Raghupathy Sivakumar. 2019b. Cerebro: A Wearable Solution to Detect and Track User Preferences using Brainwaves. In The 5th ACM Workshop on Wearable Systems and Applications. ACM, 47--52.",
      "doi": "10.1145/3325424.3329660"
    },
    {
      "text": "Amaravati Anvesha, Shaojie Xu, Ningyuan Cao, Justin Romberg, and Arijit Raychowdhury. 2016. A light-powered, always-on, smart camera with compressed domain gesture detection. In Proceedings of the 2016 International Symposium on Low Power Electronics and Design. ACM, 118--123.",
      "doi": "10.1145/2934583.2934594"
    },
    {
      "text": "Patricia Batres-Mendoza, Mario A Ibarra-Manzano, Erick I Guerra-Hernandez, Dora L Almanza-Ojeda, Carlos R Montoro-Sanjose, Rene J Romero-Troncoso, and Horacio Rostro-Gonzalez. 2017. Improving EEG-based motor imagery classification for real-time applications using the QSA method. Computational intelligence and neuroscience 2017 (2017).",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Gerry Chu. 2009. Back-of-device interaction allows creating very small touch devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1923--1932.",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Anna Rita Bentivoglio, Susan B Bressman, Emanuele Cassetta, Donatella Carretta, Pietro Tonali, and Alberto Albanese. 1997. Analysis of blink rate patterns in normal subjects. Movement Disorders 12, 6 (1997), 1028--1034.",
      "doi": ""
    },
    {
      "text": "Guangyu Bin, Xiaorong Gao, Yijun Wang, Bo Hong, and Shangkai Gao. 2009. VEP-based brain-computer interfaces: time, frequency, and code modulations [Research Frontier]. IEEE Computational Intelligence Magazine 4, 4 (2009).",
      "doi": "10.1109/MCI.2009.934562"
    },
    {
      "text": "Guangyu Bin, Xiaorong Gao, Yijun Wang, Yun Li, Bo Hong, and Shangkai Gao. 2011. A high-speed BCI based on code modulation VEP. Journal of neural engineering 8, 2 (2011), 025015.",
      "doi": ""
    },
    {
      "text": "Marie Black. 2017. How to use OK Google. http://www.techadvisor.co.uk/how-to/google-android/ how-use-ok-google-3535224/. (2 Aug 2017).",
      "doi": ""
    },
    {
      "text": "Gabor Blasko and Steven Feiner. 2004. An interaction system for watch computers using tactile guidance and bidirectional segmented strokes. In Eighth International Symposium on Wearable Computers, Vol. 1. IEEE, 120--123.",
      "doi": "10.1109/ISWC.2004.6"
    },
    {
      "text": "P Brunner, L Bianchi, C Guger, F Cincotti, and G Schalk. 2011. Current trends in hardware and software for brain--computer interfaces (BCIs). Journal of neural engineering 8, 2 (2011), 025001.",
      "doi": ""
    },
    {
      "text": "Gloria L Calhoun and Grant R McMillan. 1998. Hands-free input devices for wearable computers. In Proceedings Fourth Annual Symposium on Human Interaction with Complex Systems. IEEE, 118--123.",
      "doi": "10.5555/795692.798014"
    },
    {
      "text": "Ishan Chatterjee, Robert Xiao, and Chris Harrison. 2015. Gaze+ gesture: Expressive, precise and targeted free-space interactions. In Proceedings of the 2015 ACM on International Conference on Multimodal Interaction. ACM, 131--138.",
      "doi": "10.1145/2818346.2820752"
    },
    {
      "text": "Peter M Corcoran, Florin Nanu, Stefan Petrescu, and Petronel Bigioi. 2012. Real-time eye gaze tracking for gaming design and consumer electronics systems. IEEE Transactions on Consumer Electronics 58, 2 (2012).",
      "doi": ""
    },
    {
      "text": "Damien Coyle, Jhonatan Garcia, Abdul R Satti, and T Martin McGinnity. 2011. EEG-based continuous control of a game using a 3 channel motor imagery BCI: BCI game. In Computational Intelligence, Cognitive Algorithms, Mind, and Brain (CCMB), 2011 IEEE Symposium on. IEEE, 1--7.",
      "doi": ""
    },
    {
      "text": "Angela B Dalton and Carla Schlatter Ellis. 2003. Sensing User Intention and Context for Energy Management.. In HotOS. 151--156.",
      "doi": ""
    },
    {
      "text": "FCC ID Database. 2019. Emotiv EPOC+ Neuroheadset Teardown Internal Photos. (2019). https://fccid.io/2ADIH-EPOC02/Internal-Photos/ Internal-Photos-2596557.",
      "doi": ""
    },
    {
      "text": "Chris Davies. 2014. How private is Amazon Echo? https://www.slashgear.com/ how-private-is-amazon-echo-07354486/. (2014).",
      "doi": ""
    },
    {
      "text": "Embedded. 2019. Optimizing wearable display power consumption. (2019). https://www.embedded.com/design/power-optimization/4461973/ Optimizing-wearable-display-power-consumption.",
      "doi": ""
    },
    {
      "text": "Emotiv. 2019a. Emotiv EPOC+ Battery Life. (2019). https://www.emotiv.com/product/ emotiv-epoc-14-channel-mobile-eeg/#tab-description.",
      "doi": ""
    },
    {
      "text": "Emotiv. 2019b. Emotiv Insight Battery Life. (2019). https://www.emotiv.com/product/ emotiv-insight-5-channel-mobile-eeg/ #tab-description.",
      "doi": ""
    },
    {
      "text": "Parvaneh Eskandari and Abbas Erfanian. 2008. Improving the performance of brain-computer interface through meditation practicing. In Engineering in medicine and biology society, 2008. EMBS 2008. 30th Annual international conference of the IEEE. IEEE, 662--665.",
      "doi": ""
    },
    {
      "text": "Bryn Farnsworth. 2019. EEG Headset Prices -- An Overview of 15+ EEG Devices. (2019). https://imotions.com/blog/eeg-headset-prices/.",
      "doi": ""
    },
    {
      "text": "Torsten Felzer, Rudolf Fischer, Thomas Groensfelder, and Rainer Nordmann. 2005. Alternative control system for operating a PC using intentional muscle contractions only. In Online-Proc. CSUN Conf. Citeseer.",
      "doi": ""
    },
    {
      "text": "Google. 2019. Google Home. https://store.google.com/us/product/google_home. (2019).",
      "doi": ""
    },
    {
      "text": "Kristen Grauman, Margrit Betke, James Gips, and Gary R Bradski. 2001. Communication via eye blinks-detection and duration analysis in real time. In Proceedings of the 2001 IEEE Computer Society Conference on Computer Vision and Pattern Recognition. CVPR 2001, Vol. 1. IEEE, I--I.",
      "doi": ""
    },
    {
      "text": "Mick Grierson and Chris Kiefer. 2011. Better brain interfacing for the masses: progress in event-related potential detection using commercial brain computer interfaces. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 1681--1686.",
      "doi": "10.1145/1979742.1979828"
    },
    {
      "text": "Michael E Gunn and Pratik M Kamdar. 2017. Voice Control User Interface with Progressive Command Engagement. (March 29 2017). US Patent App. 15/473,131.",
      "doi": ""
    },
    {
      "text": "Joerg F Hipp and Markus Siegel. 2013. Dissociating neuronal gamma-band activity from cranial and ocular muscle activity in EEG. Frontiers in human neuroscience 7 (2013), 338.",
      "doi": ""
    },
    {
      "text": "Michael Xuelin Huang, Tiffany CK Kwok, Grace Ngai, Stephen CF Chan, and Hong Va Leong. 2016. Building a personalized, auto-calibrating eye tracker from user interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5169--5179.",
      "doi": "10.1145/2858036.2858404"
    },
    {
      "text": "Shinsuke Inoue, Yoko Akiyama, Yoshinobu Izumi, and Shigehiro Nishijima. 2008. The development of BCI using alpha waves for controlling the robot arm. IEICE transactions on communications 91, 7 (2008), 2125--2132.",
      "doi": ""
    },
    {
      "text": "Argus Insights. 2016. Battery life still important to wearable consumers. http://www.argusinsights.com/2016/04/14/ battery-life-still-important-to-wearable-consumers/. (14 April 2016).",
      "doi": ""
    },
    {
      "text": "John Peter Karidis and Clifford Alan Pickover. 2009. Apparatus and method for display power saving. (Nov. 3 2009). US Patent 7,614,011.",
      "doi": ""
    },
    {
      "text": "Arie E Kaufman, Amit Bandopadhay, and Bernard D Shaviv. 1993. An eye tracking computer user interface. In Virtual Reality, 1993. Proceedings., IEEE 1993 Symposium on Research Frontiers in. IEEE, 120--121.",
      "doi": ""
    },
    {
      "text": "Juha Kela, Panu Korpipää, Jani Mäntyjärvi, Sanna Kallio, Giuseppe Savino, Luca Jozzo, and Di Marca. 2006. Accelerometer-based gesture control for a design environment. Personal and Ubiquitous Computing 10, 5 (2006), 285--299.",
      "doi": "10.1007/s00779-005-0033-8"
    },
    {
      "text": "VZ Këpuska and TB Klein. 2009. A novel wake-up-word speech recognition system, wake-up-word recognition task, technology and evaluation. Nonlinear Analysis: Theory, Methods & Applications 71, 12 (2009), e2772--e2789.",
      "doi": ""
    },
    {
      "text": "Jasmin Kevric and Abdulhamit Subasi. 2017. Comparison of signal decomposition methods in classification of EEG signals for motor-imagery BCI system. Biomedical Signal Processing and Control 31 (2017), 398--406.",
      "doi": ""
    },
    {
      "text": "Taeho Kim, Sungwoo Hwang, Sangwon Kim, Hoyoung Ahn, and Daeyoung Chung. 2016. Smart contact lenses for augmented reality and methods of manufacturing and operating the same. (2016). US Patent App. 14/644,488.",
      "doi": ""
    },
    {
      "text": "Pieter-Jan Kindermans, Hannes Verschore, David Verstraeten, and Benjamin Schrauwen. 2012. A P300 BCI for the masses: Prior information enables instant unsupervised spelling. In Advances in Neural Information Processing Systems. 710--718.",
      "doi": ""
    },
    {
      "text": "Bret Kinsella. 2018. Google Home Beats Amazon Echo in Two Audio Recognition Performance Tests, But Alexa Delivers Highest Composite Score. (2018). https://voicebot.ai/2018/05/14/.",
      "doi": ""
    },
    {
      "text": "Anastasia Kononova, Lin Li, Kendra Kamp, Marie Bowen, RV Rikard, Shelia Cotten, and Wei Peng. 2019. The Use of Wearable Activity Trackers Among Older Adults: Focus Group Study of Tracker Perceptions, Motivators, and Barriers in the Maintenance Stage of Behavior Change. JMIR mHealth and uHealth 7, 4 (2019), e9832.",
      "doi": ""
    },
    {
      "text": "Sara Lin. 2014. The Complete Guide to Samsung S Voice. https://www.guidingtech.com/27428/s-voice-guide/. (11 Mar 2014).",
      "doi": ""
    },
    {
      "text": "Aram M Lindahl. 2016. Speech recognition wake-up of a handheld portable electronic device. (Jan. 26 2016). US Patent 9,245,527.",
      "doi": ""
    },
    {
      "text": "Xing Liu, Tianyu Chen, Feng Qian, Zhixiu Guo, Felix Xiaozhu Lin, Xiaofeng Wang, and Kai Chen. 2017. Characterizing smartwatch usage in the wild. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services. ACM, 385--398.",
      "doi": "10.1145/3081333.3081351"
    },
    {
      "text": "Jacob R Lorch and Alan Jay Smith. 1998. Software strategies for portable computer energy management. IEEE Personal Communications 5, 3 (1998), 60--73.",
      "doi": ""
    },
    {
      "text": "Fabien Lotte, Laurent Bougrain, Andrzej Cichocki, Maureen Clerc, Marco Congedo, Alain Rakotomamonjy, and Florian Yger. 2018. A review of classification algorithms for EEG-based brain--computer interfaces: a 10 year update. Journal of neural engineering 15, 3 (2018), 031005.",
      "doi": ""
    },
    {
      "text": "Fabien Lotte, Marco Congedo, Anatole Lécuyer, Fabrice Lamarche, and Bruno Arnaldi. 2007. A review of classification algorithms for EEG-based brain--computer interfaces. Journal of neural engineering 4, 2 (2007), R1.",
      "doi": ""
    },
    {
      "text": "Ruhi Mahajan and Bashir I Morshed. 2014. Unsupervised eye blink artifact denoising of EEG data with modified multiscale sample entropy, kurtosis, and wavelet-ICA. IEEE journal of Biomedical and Health Informatics 19, 1 (2014), 158--165.",
      "doi": ""
    },
    {
      "text": "Carol Maher, Jillian Ryan, Christina Ambrosi, and Sarah Edney. 2017. Users' experiences of wearable activity trackers: a cross-sectional study. BMC public health 17, 1 (2017), 880.",
      "doi": ""
    },
    {
      "text": "Roni O Maimon-Mor, Jorge Fernandez-Quesada, Giuseppe A Zito, Charalambos Konnaris, Sabine Dziemian, and A Aldo Faisal. 2017. Towards free 3D end-point control for robotic-assisted human reaching using binocular eye tracking. In 2017 International Conference on Rehabilitation Robotics (ICORR). IEEE, 1049--1054.",
      "doi": ""
    },
    {
      "text": "Matthew Middendorf, Grant McMillan, Gloria Calhoun, and Keith S Jones. 2000. Brain-computer interfaces based on the steady-state visual-evoked response. IEEE transactions on rehabilitation engineering 8, 2 (2000), 211--214.",
      "doi": ""
    },
    {
      "text": "Carlos H Morimoto and Marcio RM Mimica. 2005. Eye gaze tracking techniques for interactive applications. Computer vision and image understanding 98, 1 (2005), 4--24.",
      "doi": ""
    },
    {
      "text": "Muse. 2019. Muse Battery Life. (2019). https://neurobb.com/t/muse-battery-replacement/665.",
      "doi": ""
    },
    {
      "text": "Katsu Nakamori, Mikiko Odawara, Toshiaki Nakajima, Taku Mizutani, and Kazuo Tsubota. 1997. Blinking is controlled primarily by ocular surface conditions. American journal of ophthalmology 124, 1 (1997), 24--30.",
      "doi": ""
    },
    {
      "text": "Noman Naseer and Keum-Shik Hong. 2015. fNIRS-based brain-computer interfaces: a review. Frontiers in human neuroscience 9 (2015), 3.",
      "doi": ""
    },
    {
      "text": "Bernardo Noronha, Sabine Dziemian, Giuseppe A Zito, Charalambos Konnaris, and A Aldo Faisal. 2017. Wink to grasp-comparing eye, voice & EMG gesture control of grasp with soft-robotic gloves. In 2017 International Conference on Rehabilitation Robotics (ICORR). IEEE, 1043--1048.",
      "doi": ""
    },
    {
      "text": "Ori Novanda, Maha Salem, Joe Saunders, Michael L Walters, and Kerstin Dautenhahn. 2016. What Communication Modalities Do Users Prefer in Real Time HRI? arXiv preprint arXiv:1606.03992 (2016).",
      "doi": ""
    },
    {
      "text": "Natasha Padfield, Jaime Zabalza, Huimin Zhao, Valentin Masero, and Jinchang Ren. 2019. EEG-based brain-computer interfaces using motor-imagery: techniques and challenges. Sensors 19, 6 (2019), 1423.",
      "doi": ""
    },
    {
      "text": "Debajyoti Pal, Suree Funilkul, and Vajirasak Vanijja. 2018. The future of smartwatches: assessing the end-users' continuous usage using an extended expectation-confirmation model. Universal Access in the Information Society (2018), 1--21.",
      "doi": ""
    },
    {
      "text": "Jiapu Pan and Willis J Tompkins. 1985. A real-time QRS detection algorithm. IEEE Trans. Biomed. Eng 32, 3 (1985), 230--236.",
      "doi": ""
    },
    {
      "text": "Rajesh C Panicker, Sadasivan Puthusserypady, and Ying Sun. 2011. An asynchronous P300 BCI with SSVEP-based control state detection. IEEE Transactions on Biomedical Engineering 58, 6 (2011), 1781--1788.",
      "doi": ""
    },
    {
      "text": "Paul Pickering. 2014. The Importance of Battery Technology in Wearables. (2014). https://www.ecnmag.com/article/2015/09/ importance-battery-technology-wearables.",
      "doi": ""
    },
    {
      "text": "Picovoice. 2019. Wake Word Engine Benchmark Frameworks. (2019). https://github.com/Picovoice/wake-word-benchmark#results.",
      "doi": ""
    },
    {
      "text": "Matthew Pike, Richard Ramchurn, Steve Benford, and Max L Wilson. 2016. # scanners: Exploring the control of adaptive films using brain-computer interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5385--5396.",
      "doi": "10.1145/2858036.2858276"
    },
    {
      "text": "John P Powell. 2003. Display brightness control method and apparatus for conserving battery power. (Sept. 9 2003). US Patent 6,618,042.",
      "doi": ""
    },
    {
      "text": "Marius M Punt, Coen N Stefels, Cornelis A Grimbergen, and Jenny Dankelman. 2005. Evaluation of voice control, touch panel control and assistant control during steering of an endoscope. Minimally Invasive Therapy & Allied Technologies 14, 3 (2005), 181--187.",
      "doi": ""
    },
    {
      "text": "Arjun Puri. 2017. Acceptance and usage of smart wearable devices in Canadian older adults. Master's thesis. University of Waterloo.",
      "doi": ""
    },
    {
      "text": "Brad Reed. 2014. Battery life has become the single biggest reason people choose a smartphone. http://bgr.com/2014/05/12/best-smartphone-battery-life/. (12 March 2014).",
      "doi": ""
    },
    {
      "text": "Yann Renard, Fabien Lotte, Guillaume Gibert, Marco Congedo, Emmanuel Maby, Vincent Delannoy, Olivier Bertrand, and Anatole Lécuyer. 2010. Openvibe: An open-source software platform to design, test, and use brain--computer interfaces in real and virtual environments. Presence: teleoperators and virtual environments 19, 1 (2010), 35--53.",
      "doi": ""
    },
    {
      "text": "Gerardo Rosas-Cholula, Juan Ramirez-Cortes, Vicente Alarcon-Aquino, Pilar Gomez-Gil, Jose Rangel-Magdaleno, and Carlos Reyes-Garcia. 2013. Gyroscope-driven mouse pointer with an EMOTIV® EEG headset and data analysis based on empirical mode decomposition. Sensors 13, 8 (2013), 10561--10583.",
      "doi": ""
    },
    {
      "text": "Alexander L Rudnicky. 1993. Mode preference in a simple data-retrieval task. In HUMAN LANGUAGE TECHNOLOGY: Proceedings of a Workshop Held at Plainsboro, New Jersey, March 21--24, 1993.",
      "doi": ""
    },
    {
      "text": "T Scott Saponas, Desney S Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A Landay. 2009. Enabling always-available input with muscle-computer interfaces. In Proceedings of the 22nd annual ACM symposium on User interface software and technology. ACM, 167--176.",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Stefan Schaffer, Robert Schleicher, and Sebastian Möller. 2015. Modeling input modality choice in mobile graphical and speech interfaces. International Journal of Human-Computer Studies 75 (2015), 21--34.",
      "doi": "10.1016/j.ijhcs.2014.11.004"
    },
    {
      "text": "Julia Schwarz, Chris Harrison, Scott Hudson, and Jennifer Mankoff. 2010. Cord input: an intuitive, high-accuracy, multi-degree-of-freedom input method for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1657--1660.",
      "doi": "10.1145/1753326.1753573"
    },
    {
      "text": "Steven J Scrivani, David A Keith, and Leonard B Kaban. 2008. Temporomandibular disorders. New England Journal of Medicine 359, 25 (2008), 2693--2705.",
      "doi": ""
    },
    {
      "text": "Tyler Simpson, Colin Broughton, Michel JA Gauthier, and Arthur Prochazka. 2008. Tooth-click control of a hands-free computer interface. IEEE Transactions on Biomedical Engineering 55, 8 (2008), 2050--2056.",
      "doi": ""
    },
    {
      "text": "Alcimar Soares, Adriano Andrade, Edgard Lamounier, and Renato Carrijo. 2003. The development of a virtual myoelectric prosthesis controlled by an EMG pattern recognition system based on neural networks. Journal of Intelligent Information Systems 21, 2 (2003), 127--141.",
      "doi": "10.1023/A%3A1024758415877"
    },
    {
      "text": "Becky Stern. 2015. Inside the Muse. (2015). https://learn.adafruit.com/muse-headset-teardown/ inside-the-muse.",
      "doi": ""
    },
    {
      "text": "Kirill Stytsenko, Evaldas Jablonskis, and Cosima Prahm. 2011. Evaluation of consumer EEG device Emotiv EPOC. In MEi: CogSci Conference 2011, Ljubljana.",
      "doi": ""
    },
    {
      "text": "Ming Sun, David Snyder, Yixin Gao, Varun K Nagaraja, Mike Rodehorst, Sankaran Panchapagesan, Nikko Strom, Spyros Matsoukas, and Shiv Vitaladevuni. 2017. Compressed Time Delay Neural Network for Small-Footprint Keyword Spotting.. In INTERSPEECH. 3607--3611.",
      "doi": ""
    },
    {
      "text": "Benjamin Tag, Junichi Shimizu, Chi Zhang, Naohisa Ohta, Kai Kunze, and Kazunori Sugiura. 2016. Eye blink as an input modality for a responsive adaptable video system. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. ACM, 205--208.",
      "doi": "10.1145/2968219.2971449"
    },
    {
      "text": "George Townsend, Bernhard Graimann, and Gert Pfurtscheller. 2004. Continuous EEG classification during motor imagery-simulation of an asynchronous BCI. IEEE Transactions on Neural Systems and Rehabilitation Engineering 12, 2 (2004), 258--265.",
      "doi": ""
    },
    {
      "text": "Chun Sing Louis Tsui, Pei Jia, John Q. Gan, Huosheng Hu, and Kui Yuan. 2007. EMG-based hands-free wheelchair control with EOG attention shift detection. In 2007 IEEE International Conference on Robotics and Biomimetics (ROBIO). IEEE, 1266--1271.",
      "doi": ""
    },
    {
      "text": "Albert J.N. van Breemen. 2004. Animation engine for believable interactive user-interface robots. In Intelligent Robots and Systems, 2004.(IROS 2004). Proceedings. 2004 IEEE/RSJ International Conference on, Vol. 3. IEEE, 2873--2878.",
      "doi": ""
    },
    {
      "text": "Marijn van Vliet, Arne Robben, Nikolay Chumerin, Nikolay V. Manyakov, Adrien Combaz, and Marc M. Van Hulle. 2012. Designing a brain-computer interface controlled video-game using consumer grade EEG hardware. In Biosignals and Biorobotics Conference (BRC), 2012 ISSNIP. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Vocalize.ai. 1998. Smart Speakers, Wake Words and Ghoul Oil. (1998). http://www.vocalize.ai/2018/11/01/ wake-words-false-positives/.",
      "doi": ""
    },
    {
      "text": "Athanasios Vourvopoulos and others. 2016. Usability and Cost-effectiveness in Brain-Computer Interaction: Is it User Throughput or Technology Related?. In Proceedings of the 7th Augmented Human International Conference 2016. ACM, 19.",
      "doi": ""
    },
    {
      "text": "Ina Wechsung, Klaus-Peter Engelbrecht, and Sebastian Möller. 2012. Using quality ratings to predict modality choice in multimodal systems. In Thirteenth Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "Anouk Wipprecht. 2014. NeuroSky MindWave Mobile Teardown. (2014). https://www.instructables.com/id/ NeuroSky-MindWave-Mobile-Teardown-to-customized-EE/.",
      "doi": ""
    },
    {
      "text": "Jonathan R. Wolpaw, Niels Birbaumer, Dennis J. McFarland, Gert Pfurtscheller, and Theresa M. Vaughan. 2002. Brain--computer interfaces for communication and control. Clinical neurophysiology 113, 6 (2002), 767--791.",
      "doi": ""
    },
    {
      "text": "Shengdong Zhao, Pierre Dragicevic, Mark Chignell, Ravin Balakrishnan, and Patrick Baudisch. 2007. Earpod: eyes-free menu selection using touch input and reactive audio feedback. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1395--1404.",
      "doi": "10.1145/1240624.1240836"
    }
  ]
}