{
  "doi": "10.1145/3313831.3376217",
  "title": "Swap: A Replacement-based Text Revision Technique for Mobile Devices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Text revision is an important task to ensure the accuracy of text content. Revising text on mobile devices is cumbersome and time-consuming due to the imprecise caret control and the repetitive use of the backspace. We present Swap, a novel replacement-based technique to facilitate text revision on mobile devices. We conducted two user studies to validate the feasibility and the effectiveness of Swap compared to traditional text revision techniques. Results showed that Swap reduced efforts in caret control and repetitive backspace pressing during the text revision process. Most participants preferred to use the replacement-based technique rather than backspace and caret. They also commented that the new technique is easy to learn, and it makes text revision rapid and intuitive.",
  "authors": [
    {
      "name": "Yang Li",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528789",
      "orcid": "missing"
    },
    {
      "name": "Sayan Sarcar",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550967756",
      "orcid": "missing"
    },
    {
      "name": "Sunjun Kim",
      "institution": "Aalto University & Daegu Gyeongbuk Institute of Science and Technology, Espoo, Finland",
      "img": "/do/10.1145/contrib-81460641074/rel-imgonly/sunjun.png",
      "acmid": "81460641074",
      "orcid": "missing"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ohoud Alharbi, Ahmed Sabbir Arif, Wolfgang Stuerzlinger, Mark D Dunlop, and Andreas Komninos. 2019. WiseType: A Tablet Keyboard with ColorCoded Visualization and Various Editing Options for Error Correction. In Proceedings of Graphics Interface 2019 (GI 2019). DOI: https://doi.org/10.20380/GI2019.04",
      "doi": ""
    },
    {
      "text": "Zaib Ali. 2017. Increase Text Delete Speed On Stock iOS Keyboard With 3D Touch. Retrieved from https://ioshacker.com/how-to/adjust-text-delete-speedstock-ios-keyboard-3d-touch",
      "doi": ""
    },
    {
      "text": "Toshiyuki Ando, Toshiya Isomoto, Buntarou Shizuki, and Shin Takahashi. 2018. Press & Tilt: One-handed Text Selection and Command Execution on Smartphone. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI '18), 401--405. DOI: https://doi.org/10.1145/3292147.3292178",
      "doi": "10.1145/3292147.3292178"
    },
    {
      "text": "Toshiyuki Ando, Toshiya Isomoto, Buntarou Shizuki, and Shin Takahashi. 2019. One-handed Rapid Text Selection and Command Execution Method for Smartphones. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA'19), LBW0224:1--LBW0224:6. DOI: https://doi.org/10.1145/3290607.3312850",
      "doi": ""
    },
    {
      "text": "Android. 2017. Spell checker framework. Retrieved from https://developer.android.com/guide/topics/text/spellchecker-framework",
      "doi": ""
    },
    {
      "text": "Apple. 2019. Caret navigation features in iOS 13. Retrieved from https://www.apple.com/ios/ios-13preview/features",
      "doi": ""
    },
    {
      "text": "Samuel Arbesman. 2017. Overcomplicated: Technology at the Limits of Comprehension. https://www.xarg.org/ref/a/0143131303/",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif, Sunjun Kim, Wolfgang Stuerzlinger, Geehyuk Lee, and Ali Mazalek. 2016. Evaluation of a Smart-Restorable Backspace Technique to Facilitate Text Entry Error Correction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5151--5162. DOI: https://doi.org/10.1145/2858036.2858407",
      "doi": "10.1145/2858036.2858407"
    },
    {
      "text": "Ahmed Sabbir Arif, Michel Pahud, Ken Hinckley, and Bill Buxton. 2014. Experimental Study of Stroke Shortcuts for a Touchscreen Keyboard with Gestureredundant Keys Removed. In Proceedings of Graphics Interface 2014 (GI '14), 43--50. http://dl.acm.org/citation.cfm?id=2619648.2619657",
      "doi": "10.5555/2619648.2619657"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2010. Predicting the Cost of Error Correction in Character-based Text Entry Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 5--14. DOI: https://doi.org/10.1145/1753326.1753329",
      "doi": "10.1145/1753326.1753329"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2013. Pseudo-pressure Detection and Its Use in Predictive Text Entry on Touchscreens. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13), 383--392. DOI: https://doi.org/10.1145/2541016.2541024",
      "doi": "10.1145/2541016.2541024"
    },
    {
      "text": "Kenneth C Arnold, Krzysztof Z Gajos, and Adam T Kalai. 2016. On Suggesting Phrases vs. Predicting Words for Mobile Text Composition. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16), 603--608. DOI: https://doi.org/10.1145/2984511.2984584",
      "doi": "10.1145/2984511.2984584"
    },
    {
      "text": "Stephen Brewster. 2002. Overcoming the Lack of Screen Space on Mobile Computers. Personal Ubiquitous Comput. 6, 3: 188--205. DOI: https://doi.org/10.1007/s007790200019",
      "doi": "10.1007/s007790200019"
    },
    {
      "text": "Daniel Buschek, Benjamin Bisinger, and Florian Alt. 2018. ResearchIME: A mobile keyboard application for studying free typing behaviour in the wild. In Conference on Human Factors in Computing Systems Proceedings. DOI: https://doi.org/10.1145/3173574.3173829",
      "doi": "10.1145/3173574.3173829"
    },
    {
      "text": "Stuart K Card, Allen Newell, and Thomas P Moran. 1986. The Psychology of Human-Computer Interaction. CRC Press. https://www.xarg.org/ref/a/B0074195FY/",
      "doi": "10.5555/578027"
    },
    {
      "text": "Herbert A Colle and Keith J Hiszem. 2004. Standing at a kiosk: Effects of key size and spacing on touch screen numeric keypad performance and user preference. Ergonomics 47, 13: 1406--1423. DOI: https://doi.org/10.1080/00140130410001724228",
      "doi": ""
    },
    {
      "text": "Martin Cutts. 2013. Oxford Guide to Plain English (Oxford Paperback Reference). OUP Oxford. Retrieved from https://www.xarg.org/ref/a/B00FZSX76G/",
      "doi": ""
    },
    {
      "text": "Vivek Dhakal, Anna Maria Feit, Per Ola Kristensson, and Antti Oulasvirta. 2018. Observations on Typing from 136 Million Keystrokes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 646:1--646:12. DOI: https://doi.org/10.1145/3173574.3174220",
      "doi": "10.1145/3173574.3174220"
    },
    {
      "text": "Alexander Keith Eady and Audrey Girouard. 2015. Caret Manipulation Using Deformable Input in Mobile Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), 587--591. DOI: https://doi.org/10.1145/2677199.2687916",
      "doi": "10.1145/2677199.2687916"
    },
    {
      "text": "Fleksy. 2019. Fleksy keyboard. Retrieved from https://www.fleksy.com",
      "doi": ""
    },
    {
      "text": "Vittorio Fuccella, Poika Isokoski, and Benoit Martin. 2013. Gestures and Widgets: Performance in Text Editing on Multi-touch Capable Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2785--2794. DOI: https://doi.org/10.1145/2470654.2481385",
      "doi": "10.1145/2470654.2481385"
    },
    {
      "text": "Google. 2018. Magnifier widget. Retrieved from https://developer.android.com/guide/topics/text/magnifier",
      "doi": ""
    },
    {
      "text": "Google. 2018. Selection handle for Android Textview. Retrieved from https://developer.android.com/reference/android/widge t/TextView.html#getTextSelectHandle()",
      "doi": ""
    },
    {
      "text": "Google. 2019. Gboard. Retrieved from https://play.google.com/store/apps/details?id=com.google.android.inputmethod.latin",
      "doi": ""
    },
    {
      "text": "Grammarly. 2019. Grammarly: free writing assistant. Retrieved from https://www.grammarly.com",
      "doi": ""
    },
    {
      "text": "Toshiyuki Hagiya, Toshiharu Horiuchi, and Tomonori Yazaki. 2016. Typing Tutor: Individualized Tutoring in Text Entry for Older Adults Based on Input Stumble Detection. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16: 733-- 744. DOI: https://doi.org/10.1145/2858036.2858455",
      "doi": "10.1145/2858036.2858455"
    },
    {
      "text": "idownloadblog. 2018. How to use iOS 12 virtual keyboard in trackpad mode on iPhones without 3D Touch. Retrieved from https://www.idownloadblog.com/2018/08/22/howtoiphone-keyboard-trackpad-mode/",
      "doi": ""
    },
    {
      "text": "Andreas Komninos, Mark Dunlop, Kyriakos Katsaris, and John Garofalakis. 2018. A Glimpse of Mobile Text Entry Errors and Corrective Behaviour in the Wild. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI'18), 221--228. DOI: https://doi.org/10.1145/3236112.3236143",
      "doi": "10.1145/3236112.3236143"
    },
    {
      "text": "Andreas Komninos, Emma Nicol, and Mark D Dunlop. 2015. Designed with Older Adults to SupportBetter Error Correction in SmartPhone Text Entry: The MaxieKeyboard. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI'15), 797--802. DOI: https://doi.org/10.1145/2786567.2793703",
      "doi": "10.1145/2786567.2793703"
    },
    {
      "text": "V I Levenshtein. 1966. Binary Codes Capable of Correcting Deletions, Insertions and Reversals. Soviet Physics Doklady 10: 707.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Using an Input Method Editor in a Game. Retrieved from https://docs.microsoft.com/enus/windows/win32/dxtecharts/using-an-input-methodeditor-in-a-game",
      "doi": ""
    },
    {
      "text": "Microsoft. 2019. SwiftKey: The Smart Keyboard. Retrieved from https://www.microsoft.com/enus/swiftkey",
      "doi": ""
    },
    {
      "text": "Donald A Norman. 1995. The Psychopathology of Everyday Things. Elsevier. DOI: https://doi.org/10.1016/b978-0-08-051574--8.50006--6",
      "doi": ""
    },
    {
      "text": "Raymond. 2007. Whose idea was it to make Ctrl+Backspace delete the previous word. Retrieved from https://devblogs.microsoft.com/oldnewthing/20071011-00/?p=24823",
      "doi": ""
    },
    {
      "text": "Jean-Baptiste Scheibel, Cyril Pierson, Benoît Martin, Nathan Godard, Vittorio Fuccella, and Poika Isokoski. 2013. Virtual Stick in Caret Positioning on Touch Screens. In Proceedings of the 25th Conference on L'Interaction Homme-Machine (IHM '13), 107:107--107:114. DOI: https://doi.org/10.1145/2534903.2534918",
      "doi": "10.1145/2534903.2534918"
    },
    {
      "text": "Katie A Siek, Yvonne Rogers, and Kay H Connelly. 2005. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (INTERACT'05), 267-- 280. DOI: https://doi.org/10.1007/11555261_24",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Shyamli Sindhwani, Christof Lutteroth, and Gerald Weber. 2019. ReType: Quick Text Editing with Keyboard and Gaze. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 203:1--203:13. DOI: https://doi.org/10.1145/3290605.3300433",
      "doi": "10.1145/3290605.3300433"
    },
    {
      "text": "Kenji Suzuki, Kazumasa Okabe, Ryuuki Sakamoto, and Daisuke Sakamoto. 2015. Fix and Slide: Caret Navigation with Movable Background. In Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15 Adjunct), 79--80. DOI: https://doi.org/10.1145/2815585.2815728",
      "doi": "10.1145/2815585.2815728"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. A Versatile Dataset for Text Entry Evaluations Based on Genuine Mobile Emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI'11), 295--298. DOI: https://doi.org/10.1145/2037373.2037418",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Wikipedia. 2019. Backspace. Retrieved from https://en.wikipedia.org/wiki/Backspace",
      "doi": ""
    }
  ]
}