{
  "doi": "10.1145/3313831.3376292",
  "title": "Miniature Haptics: Experiencing Haptic Feedback through Hand-based and Embodied Avatars",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2020,
  "badges": [],
  "abstract": "We present Miniature Haptics, a new approach to providing realistic haptic experiences by applying miniaturized haptic feedback to hand-based, embodied avatars. By shrinking haptics to a much smaller scale, Miniature Haptics enables the exploration of new haptic experiences that are not practical to create at the full, human-body scale. Using Finger Walking in Place (FWIP) as an example avatar embodiment and control method, we first explored the feasibility of Miniature Haptics then conducted a human factors study to understand how people map their full-body skeletal model to their hands. To understand the user experience of Miniature Haptic, we developed a miniature football haptic display, and results from our user study show that Miniature Haptics significantly improved the realism and enjoyment of the experience and is preferred by users (p < 0.05). In addition, we present two miniature motion platforms supporting the haptic experiences of: 1) rapidly changing ground height for platform jumping games such as Super Mario Bros and 2) changing terrain slope. Overall, Miniature Haptics makes it possible to explore novel haptic experiences that have not been practical before.",
  "authors": [
    {
      "name": "Bo-Xiang Wang",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529081",
      "orcid": "missing"
    },
    {
      "name": "Yu-Wei Wang",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-99659702103/rel-imgonly/all_photo_108_____-1_33-____e34046171_e34046171-1.jpg",
      "acmid": "99659702103",
      "orcid": "missing"
    },
    {
      "name": "Yen-Kai Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528263",
      "orcid": "missing"
    },
    {
      "name": "Chun-Miao Tseng",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529077",
      "orcid": "missing"
    },
    {
      "name": "Min-Chien Hsu",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526503",
      "orcid": "missing"
    },
    {
      "name": "Cheng An Hsieh",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-99659475415/rel-imgonly/99659475415.jpg",
      "acmid": "99659475415",
      "orcid": "missing"
    },
    {
      "name": "Hsin-Ying Lee",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528284",
      "orcid": "missing"
    },
    {
      "name": "Mike Y. Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81460645188/rel-imgonly/mikebiophotosmall.jpg",
      "acmid": "81460645188",
      "orcid": "0000-0001-5410-652X"
    }
  ],
  "references": [
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI'16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 218--226.",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands 'feel'touch that eyes see. Nature 391, 6669 (1998), 756.",
      "doi": ""
    },
    {
      "text": "Yu-Ting Cheng, Timothy K Shih, and Chih-Yang Lin. 2017. Create a puppet play and interative digital models with leap Motion. In 2017 10th International Conference on Ubi-media Computing and Workshops (Ubi-Media). IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Charith Lasantha Fernando, Takeo Igarashi, Masahiko Inami, Maki Sugimoto, Yuta Sugiura, Anusha Indrajith Withana, and Kakehi Gota. 2009. An operating method for a bipedal walking robot for entertainment.. In SIGGRAPH ASIA Art Gallery & Emerging Technologies. 79.",
      "doi": ""
    },
    {
      "text": "An-Pin Huang, Fay Huang, and Jing-Siang Jhu. 2018. Unreal Interactive Puppet Game Development Using Leap Motion. In Journal of Physics: Conference Series, Vol. 1004. IOP Publishing, 012025.",
      "doi": ""
    },
    {
      "text": "Brent Edward Insko, M Meehan, M Whitton, and F Brooks. 2001. Passive haptics significantly enhances virtual environments. Ph.D. Dissertation. University of North Carolina at Chapel Hill.",
      "doi": ""
    },
    {
      "text": "Kurt A Kaczmarek, Mitchell E Tyler, and Paul Bach-y Rita. 1994. Electrotactile haptic display on the fingertips: Preliminary results. In Proceedings of 16th Annual International Conference of the IEEE Engineering in Medicine and Biology Society, Vol. 2. IEEE, 940--941.",
      "doi": ""
    },
    {
      "text": "Hiroyuki Kajimoto, Naoki Kawakami, Susumu Tachi, and Masahiko Inami. 2004. Smarttouch: Electric skin to touch the untouchable. IEEE computer graphics and applications 24, 1 (2004), 36--43.",
      "doi": ""
    },
    {
      "text": "Ji-Sun Kim, Denis Grafanin, Kresimir Matkovic, and Francis Quek. 2008. Finger walking in place (FWIP): A traveling technique in virtual environments. In International Symposium on Smart Graphics. Springer, 58--69.",
      "doi": "10.1007/978-3-540-85412-8_6"
    },
    {
      "text": "Ji-Sun Kim, Denis Gracanin, Kresimir Matkovic, and Francis Quek. 2009. iPhone/iPod touch as input devices for navigation in immersive virtual environments. In 2009 IEEE Virtual Reality Conference. IEEE, 261--262.",
      "doi": ""
    },
    {
      "text": "Luis LEite and Veronica Orvalho. 2017. Mani-Pull-Action: Hand-based Digital Puppetry. Proceedings of the ACM on Human-Computer Interaction 1, EICS (2017), 2.",
      "doi": ""
    },
    {
      "text": "Kouta Minamizawa, Sho Kamuro, Naoki Kawakami, and Susumu Tachi. 2008. A palm-worn haptic display for bimanual operations in virtual environments. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 458--463.",
      "doi": "10.1007/978-3-540-69057-3_59"
    },
    {
      "text": "Novint. 2006. Novint Falcon Haptic Device. (2006). https://hapticshouse.com/",
      "doi": ""
    },
    {
      "text": "Yoshihiro Okada. 2003. Real-time character animation using puppet metaphor. In Entertainment Computing. Springer, 101--108.",
      "doi": ""
    },
    {
      "text": "Masaki Oshita, Yuta Senju, and Syun Morishige. 2013. Character motion control interface with hand manipulation inspired by puppet mechanism. In Proceedings of the 12th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and Its Applications in Industry. ACM, 131--138.",
      "doi": "10.1145/2534329.2534360"
    },
    {
      "text": "Jérôme Perret and Emmanuel Vander Poorten. 2018. Touching Virtual Reality: A Review of Haptic Gloves. In ACTUATOR 2018; 16th International Conference on New Actuators. VDE, 1--5.",
      "doi": ""
    },
    {
      "text": "Domenico Prattichizzo, Francesco Chinello, Claudio Pacchierotti, and Monica Malvezzi. 2013. Towards wearability in fingertip haptics: a 3-dof wearable device for cutaneous force feedback. IEEE Transactions on Haptics 6, 4 (2013), 506--516.",
      "doi": "10.1109/TOH.2013.53"
    },
    {
      "text": "PrimeSense. 2005. PrimeSense. (2005). http://primesense.com",
      "doi": ""
    },
    {
      "text": "Z Radivojevic, P Beecher, C Bower, Samiul Haque, Piers Andrew, Tawfique Hasan, Francesco Bonaccorso, Andrea C Ferrari, and B Henson. 2012. Electrotactile touch surface by using transparent graphene. In Proceedings of the 2012 Virtual Reality International Conference. ACM, 16.",
      "doi": "10.1145/2331714.2331733"
    },
    {
      "text": "Henning Schmidt, Stefan Hesse, Rolf Bernhardt, and Jörg Krüger. 2005. HapticWalker-a novel haptic foot device. ACM Transactions on Applied Perception (TAP) 2, 2 (2005), 166--180.",
      "doi": "10.1145/1060581.1060589"
    },
    {
      "text": "Youngbo Aram Shim and Geehyuk Lee. 2018. Demonstrating Gamepad with Programmable Haptic Texture Analog Buttons. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings. ACM, 194--196.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Pérez Marcos, Henrik Ehrsson, and Maria V Sanchez-Vives. 2009. Inducing illusory ownership of a virtual body. Frontiers in neuroscience 3 (2009), 29.",
      "doi": ""
    },
    {
      "text": "Yusuke Ujitoko, Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, Koichi Hirota, and Michitaka Hirose. 2015. Yubi-Toko: finger walking in snowy scene using pseudo-haptic technique on touchpad. In SIGGRAPH Asia 2015 Emerging Technologies. ACM, 29.",
      "doi": ""
    },
    {
      "text": "Emanuel Vonach, Clemens Gatterer, and Hannes Kaufmann. 2017. VRRobot: Robot actuated props in an infinite virtual environment. In 2017 IEEE Virtual Reality (VR). IEEE, 74--83.",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic revolver: Touch, shear, texture, and shape rendering on a reconfigurable virtual reality controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 86.",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "Zhixin Yan, Robert W Lindeman, and Arindam Dey. 2016. Let your fingers do the walking: A unified approach for efficient short-, medium-, and long-distance travel in VR. In 2016 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 27--30.",
      "doi": ""
    }
  ]
}