{
  "doi": "10.1145/3313831.3376166",
  "title": "Making Chat at Home in the Hospital: Exploring Chat Use by Nurses",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper, we examine WhatsApp use by nurses in India. Globally, personal chat apps have taken the workplace by storm, and healthcare is no exception. In the hospital setting, this raises questions around how chat apps are integrated into hospital work and the consequences of using such personal tools for work. To address these questions, we conducted an ethnographic study of chat use in nurses' work in a large multi-specialty hospital. By examining how chat is embedded in the hospital, rather than focusing on individual use of personal tools, we throw new light on the adoption of personal tools at work — specifically what happens when such tools are adopted and used as though they were organisational tools. In doing so, we explicate their impact on invisible work [77] and the creep of work into personal time, as well as how hierarchy and power play out in technology use. Thus, we point to the importance of looking beyond individual adoption by knowledge workers when studying the impact of personal tools at work.",
  "tags": [
    "workplace studies",
    "whatsapp",
    "chat apps",
    "nursing",
    "ethnography",
    "hospital communication",
    "work-life balance"
  ],
  "authors": [
    {
      "name": "Naveena Karusala",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163160",
      "orcid": "0000-0003-0355-3041"
    },
    {
      "name": "Ding Wang",
      "institution": "Microsoft Research India, Bengaluru, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366178",
      "orcid": "0000-0002-5037-5017"
    },
    {
      "name": "Jacki O'Neill",
      "institution": "Microsoft Research India, Bengaluru, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041250",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Laila Akhu-Zaheya, Rowaida Al-Maaitah, and Salam Bany Hani. 2018. Quality of nursing documentation: Paper-based health records versus electronic-based health records. Journal of clinical nursing 27, 3--4 (2018), e578--e589.",
      "doi": ""
    },
    {
      "text": "Devanuj Balkrishan, Anirudha Joshi, Chandni Rajendran, Nazreen Nizam, Chinmay Parab, and Sujit Devkar. 2016. Making and breaking the user-usage model: Whatsapp adoption amongst emergent users in India. In Proceedings of the 8th Indian Conference on Human Computer Interaction. ACM, 52--63.",
      "doi": "10.1145/3014362.3014367"
    },
    {
      "text": "Jakob E Bardram. 2000. Temporal coordination--on time and coordination of collaborativeactivities at a surgical department. Computer Supported Cooperative Work (CSCW) 9, 2 (2000), 157--187.",
      "doi": "10.1023/A%3A1008748724225"
    },
    {
      "text": "Jakob E Bardram and Claus Bossen. 2005a. Mobility work: The spatial dimension of collaboration at a hospital. Computer supported cooperative work (CSCW) 14, 2 (2005), 131--160.",
      "doi": ""
    },
    {
      "text": "Jakob E Bardram and Claus Bossen. 2005b. A web of coordinative artifacts: collaborative work at a hospital ward. In Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work. ACM, 168--176.",
      "doi": "10.1145/1099203.1099235"
    },
    {
      "text": "John Robert Bautista and Trisha TC Lin. 2017. Nurses' use of mobile instant messaging applications: A uses and gratifications perspective. International journal of nursing practice 23, 5 (2017), e12577.",
      "doi": ""
    },
    {
      "text": "N.J. Bidwell, A. Shipepe, T.K. Makawa, G. Nhinda, S. Sheetekala, A. Limbo, and M. Mutonga. Forthcoming. Communication Practices and Togetherness in Setting up a Community Network in Rural Namibia.. In The Relational Interface. Springer.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker and Clemens Nylandsted Klokmose. 2012. Dynamics in artifact ecologies. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. ACM, 448--457.",
      "doi": "10.1145/2399016.2399085"
    },
    {
      "text": "Susanne Bødker, Henrik Korsgaard, and Joanna Saad-Sulonen. 2016. 'A Farmer, a Place and at least 20 Members': The Development of Artifact Ecologies in Volunteer-based Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1142--1156.",
      "doi": "10.1145/2818048.2820029"
    },
    {
      "text": "Claus Bossen and Martin Foss. 2016. The collaborative work of hospital porters: Accountability, visibility and configurations of work. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 965--979.",
      "doi": "10.1145/2818048.2820002"
    },
    {
      "text": "Graham Button and Wes Sharrock. 1997. The production of order and the order of production: possibilities for distributed organisations, work and technology in the print industry. In Proceedings of the Fifth European Conference on Computer Supported Cooperative Work. Springer, 1--16.",
      "doi": "10.5555/1241980.1241981"
    },
    {
      "text": "Federico Cabitza, Marcello Sarini, Carla Simone, and Michele Telaro. 2005. When once is not enough: the role of redundancy in a hospital ward setting. In Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work. ACM, 158--167.",
      "doi": "10.1145/1099203.1099234"
    },
    {
      "text": "Sergio Carmona, Nada Alayed, Ali Al-Ibrahim, and Rohan D'Souza. 2018. Realizing the potential of real-time clinical collaboration in maternal--fetal and obstetric medicine through WhatsApp. Obstetric medicine 11, 2 (2018), 83--89.",
      "doi": ""
    },
    {
      "text": "ME Cecchinato, Anna L Cox, and Jon Bird. 2014. “I check my emails on the toilet”: Email Practices and Work-Home Boundary Management. ACM Conference on Human Factors in Computing Systems (CHI).",
      "doi": ""
    },
    {
      "text": "Marta E Cecchinato. 2018. Communicating in a multi-role, multi-device, multi-channel world: how knowledge workers manage work-home boundaries. Ph.D. Dissertation. UCL (University College London).",
      "doi": ""
    },
    {
      "text": "Marta E Cecchinato, Anna L Cox, and Jon Bird. 2015. Working 9--5?: Professional differences in email and boundary management practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3989--3998.",
      "doi": "10.1145/2702123.2702537"
    },
    {
      "text": "Yee Tak Derek Cheung, Ching Han Helen Chan, Chi-Keung Jonah Lai, Wai Fung Vivian Chan, Man Ping Wang, Ho Cheung William Li, Sophia Siu Chee Chan, and Tai-Hing Lam. 2015. Using WhatsApp and Facebook online social groups for smoking relapse prevention for recent quitters: a pilot pragmatic cluster randomized controlled trial. Journal of medical Internet research 17, 10 (2015), e238.",
      "doi": ""
    },
    {
      "text": "Karen Church and Rodrigo De Oliveira. 2013. What's up with whatsapp?: comparing mobile instant messaging behaviors with traditional SMS. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services. ACM, 352--361.",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Elizabeth F Churchill and Sara Bly. 1999. Virtual Environments at Work: ongoing use of MUDs in the Workplace. In ACM SIGSOFT Software Engineering Notes, Vol. 24. ACM, 99--108.",
      "doi": "10.1145/295665.295677"
    },
    {
      "text": "Luigina Ciolfi and Aparecido Fabiano Pinatti De Carvalho. 2014. Work practices, nomadicity and the mediational role of technology. Computer Supported Cooperative Work (CSCW) 23, 2 (2014), 119--136.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi and Eleanor Lockley. 2018. From Work to Life and back again: Examining the digitally-mediated work/life practices of a group of knowledge workers. Computer Supported Cooperative Work (CSCW) 27, 3--6 (2018), 803--839.",
      "doi": "10.1007/s10606-018-9315-3"
    },
    {
      "text": "Enrico Coiera and Vanessa Tombs. 1998. Communication behaviours in a hospital setting: an observational study. Bmj 316, 7132 (1998), 673--676.",
      "doi": ""
    },
    {
      "text": "Rebecca Dimond, Alison Bullock, Joseph Lovatt, and Mark Stacey. 2016. Mobile learning devices in the workplace: 'as much a part of the junior doctors' kit as a stethoscope'? BMC medical education 16, 1 (2016), 207.",
      "doi": ""
    },
    {
      "text": "Pranav Dorwal, Ritesh Sachdev, Dheeraj Gautam, Dharmendra Jain, Pooja Sharma, Assem Kumar Tiwari, and Vimarsh Raina. 2016. Role of WhatsApp messenger in the laboratory management system: a boon to communication. Journal of medical systems 40, 1 (2016), 14.",
      "doi": "10.1007/s10916-015-0384-2"
    },
    {
      "text": "Linda Duxbury and Rob Smart. 2011. The “myth of separate worlds”: An exploration of how mobile technology has redefined work-life balance. In Creating balance? Springer, 269--284.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson, Wendy A Kellogg, Mark Laff, Jeremy Sussman, Tracee Vetting Wolf, Christine A Halverson, and Denise Edwards. 2006. A persistent chat space for work groups: the design, evaluation and deployment of loops. In Proceedings of the 6th conference on Designing Interactive systems. ACM, 331--340.",
      "doi": "10.1145/1142405.1142454"
    },
    {
      "text": "Thomas Erickson, David N Smith, Wendy A Kellogg, Mark Laff, John T Richards, and Erin Bradner. 1999. Socially translucent systems: social proxies, persistent conversation, and the design of “babble”. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 72--79.",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "Jesus Favela, Ana I Martinez-Garcia, and others. 2003. Context-aware mobile communication in hospitals. Computer 9 (2003), 38--46.",
      "doi": ""
    },
    {
      "text": "Matthew Finnegan. 2018. WhatsApp at work: Companies grapple with a popular ad hoc tool. https://www.computerworld.com/article/3322621/whatsapp-at-work-companies-grapple-with-a-popular-ad-hoc-tool.html. (November 2018).",
      "doi": ""
    },
    {
      "text": "Rowanne Fleck, Anna L Cox, and Rosalyn AV Robison. 2015. Balancing boundaries: Using multiple devices to manage work-life balance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3985--3988.",
      "doi": "10.1145/2702123.2702386"
    },
    {
      "text": "Kurubaran Ganasegeran, Pukunan Renganathan, Abdul Rashid, and Sami Abdo Radman Al-Dubai. 2017. The m-Health revolution: Exploring perceived benefits of WhatsApp use in clinical practice. International journal of medical informatics 97 (2017), 145--151.",
      "doi": ""
    },
    {
      "text": "Michael Gold and Mona Mustafa. 2013. `Work always wins': client colonisation, time management and the anxieties of connected freelancers. New Technology, Work and Employment 28, 3 (2013), 197--211.",
      "doi": ""
    },
    {
      "text": "Umut Gulacti, Ugur Lok, Sinan Hatipoglu, and Haci Polat. 2016. An analysis of WhatsApp usage for communication between consulting and emergency physicians. Journal of medical systems 40, 6 (2016), 130.",
      "doi": "10.1007/s10916-016-0483-8"
    },
    {
      "text": "Mark Handel and James D Herbsleb. 2002. What is chat doing in the workplace?. In Proceedings of the 2002 ACM conference on Computer supported cooperative work. ACM, 1--10.",
      "doi": "10.1145/587078.587080"
    },
    {
      "text": "Richard Harper, Christian Bird, Thomas Zimmermann, and Brendan Murphy. 2013. Dwelling in software: Aspects of the felt-life of engineers in large software projects. In ECSCW 2013: Proceedings of the 13th European Conference on Computer Supported Cooperative Work, 21--25 September 2013, Paphos, Cyprus. Springer, 163--180.",
      "doi": ""
    },
    {
      "text": "Richard Harper and Mark Rouncefield. 2007. Fieldwork for Design: Theory and Practice. Computer Supported Cooperative Work. Springer.",
      "doi": ""
    },
    {
      "text": "James D Herbsleb, David L Atkins, David G Boyer, Mark Handel, and Thomas A Finholt. 2002. Introducing instant messaging and chat in the workplace. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 171--178.",
      "doi": "10.1145/503376.503408"
    },
    {
      "text": "Ellen Isaacs, Alan Walendowski, Steve Whittaker, Diane J Schiano, and Candace Kamm. 2002. The character, functions, and styles of instant messaging in the workplace. In Proceedings of the 2002 ACM conference on Computer supported cooperative work. ACM, 11--20.",
      "doi": "10.1145/587078.587081"
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2019. Empowerment on the Margins: The Online Experiences of Community Health Workers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 99.",
      "doi": "10.1145/3290605.3300329"
    },
    {
      "text": "Swathi Jagannath, Aleksandra Sarcevic, and Andrea Forte. 2018. We Are Not Entirely Replacing Paper: Understanding Paper Persistence in Emergency Medical Settings. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 249--252.",
      "doi": ""
    },
    {
      "text": "Swathi Jagannath, Aleksandra Sarcevic, Victoria Young, and Sage Myers. 2019. Temporal Rhythms and Patterns of Electronic Documentation in Time-Critical Medical Work. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 334.",
      "doi": "10.1145/3290605.3300564"
    },
    {
      "text": "Mohammad Hossein Jarrahi, Sarah Beth Nelson, and Leslie Thomson. 2017. Personal artifact ecologies in the context of mobile knowledge workers. Computers in Human Behavior 75 (2017), 469--483.",
      "doi": "10.1016/j.chb.2017.05.028"
    },
    {
      "text": "Mohammad Hossein Jarrahi and Steve Sawyer. 2012. Social networking technologies and organizational knowledge sharing as a sociotechnical ecology. In Proceedings of the ACM 2012 conference on computer supported cooperative work companion. ACM, 99--102.",
      "doi": "10.1145/2141512.2141552"
    },
    {
      "text": "Maximilian J Johnston, Dominic King, Sonal Arora, Nebil Behar, Thanos Athanasiou, Nick Sevdalis, and Ara Darzi. 2015. Smartphones let surgeons know WhatsApp: an analysis of communication in emergency surgical teams. The American Journal of Surgery 209, 1 (2015), 45--51.",
      "doi": ""
    },
    {
      "text": "Feroze Kaliyadan, KT Ashique, Soumya Jagadeesan, Boby Krishna, and others. 2016. What's up dermatology? A pilot survey of the use of WhatsApp in dermatology practice and case discussion among members of WhatsApp dermatology groups. Indian Journal of Dermatology, Venereology, and Leprology 82, 1 (2016), 67.",
      "doi": ""
    },
    {
      "text": "Maged Kamel Boulos, Dean Giustini, and Steve Wheeler. 2016. Instagram and WhatsApp in health and healthcare: An overview. Future Internet 8, 3 (2016), 37.",
      "doi": ""
    },
    {
      "text": "Vishesh Khanna, Senthil N Sambandam, Arif Gul, and Varatharaj Mounasamy. 2015. “WhatsApp”ening in orthopedic care: a concise report from a 300-bedded tertiary care teaching center. European Journal of Orthopaedic Surgery & Traumatology 25, 5 (2015), 821--826.",
      "doi": ""
    },
    {
      "text": "LW Kivuti-Bitok. 2009. What do nurse managers want computerized? Needs based assessment study of middle and functional level nurse managers at Kenyatta National Hospital, Kenya. Journal of Health Informatics in Developing Countries 3, 2 (2009).",
      "doi": ""
    },
    {
      "text": "Soyoung Lee, Charlotte Tang, Sun Young Park, and Yunan Chen. 2012. Loosely formed patient care teams: communication challenges and technology design. In Proceedings of the ACM 2012 conference on computer supported cooperative work. ACM, 867--876.",
      "doi": "10.1145/2145204.2145334"
    },
    {
      "text": "So Young Lee, Sun Young Park, and Yunan Chen. 2011. Why not use mobile phones: an observational study of medical work. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 1267--1272.",
      "doi": ""
    },
    {
      "text": "Eleanor T Lewis. 2000. Tech support engineers' communication in a chat tool. In CHI'00 Extended Abstracts on Human Factors in Computing Systems. ACM, 103--104.",
      "doi": "10.1145/633292.633353"
    },
    {
      "text": "Cristina Verea Linares and Johno Breeze. 2015. Is instant messaging the future of workplace communication for oral and maxillofacial surgery? Faculty Dental Journal 6, 4 (2015), 180--186.",
      "doi": ""
    },
    {
      "text": "Paul Luff, Christian Heath, and David Greatbatch. 1992. Tasks-in-interaction: paper and screen based documentation in collaborative activity. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work. ACM, 163--170.",
      "doi": "10.1145/143457.143475"
    },
    {
      "text": "Gloria Mark and Norman Makoto Su. 2010. Making infrastructure visible for nomadic work. Pervasive and Mobile Computing 6, 3 (2010), 312--323.",
      "doi": "10.1016/j.pmcj.2009.12.004"
    },
    {
      "text": "Maurice Mars and Richard E Scott. 2016. Whatsapp in clinical practice: A literature. The Promise of New Technologies in an Age of New Health Challenges (2016), 82.",
      "doi": ""
    },
    {
      "text": "Guy Martin, Ankur Khajuria, Sonal Arora, Dominic King, Hutan Ashrafian, and Ara Darzi. 2019. The impact of mobile technology on teamwork and communication in hospitals: a systematic review. Journal of the American Medical Informatics Association 26, 4 (2019), 339--355.",
      "doi": ""
    },
    {
      "text": "Clarissa Martyn-Hemphill, Somita Sarkar, John Withington, Ashoke Roy, Rosaline Chisholm, Toby Newton, Diego Ottaviani, Connie Pidgeon, Sonia Szamocki, Daniel Cohen, and others. 2015. `Whatsapp Doc?' Evaluating A Novel Modality Of Communication Amongst Urology Team Members To Promote Patient Safety. The Journal of urology 193, 4S (2015), e169--e170.",
      "doi": ""
    },
    {
      "text": "Deborah L McBride, Sandra A LeVasseur, and Dongmei Li. 2015. Non-work-related use of personal mobile phones by hospital registered nurses. JMIR mHealth and uHealth 3, 1 (2015), e3.",
      "doi": ""
    },
    {
      "text": "Moira McGregor, Nicola J Bidwell, Vidya Sarangapani, Jonathan Appavoo, and Jacki O'Neill. 2019. Talking about Chat at Work in the Global South: An Ethnographic Study of Chat Use in India and Kenya. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 233.",
      "doi": "10.1145/3290605.3300463"
    },
    {
      "text": "Ebrahim Mohammed, Gashaw Andargie, Solomon Meseret, and Eshetu Girma. 2013. Knowledge and utilization of computer among health workers in Addis Ababa hospitals, Ethiopia: computer literacy in the health sector. BMC research notes 6, 1 (2013), 106.",
      "doi": ""
    },
    {
      "text": "Sally Moore, John Anderson, and Susanne Cox. 2012. Pros and cons of using apps in clinical practice. Nursing Management-UK 19, 6 (2012).",
      "doi": ""
    },
    {
      "text": "Glenn Munkvold, Gunnar Ellingsen, and Hege Koksvik. 2006. Formalizing work: reallocating redundancy. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 59--68.",
      "doi": "10.1145/1180875.1180886"
    },
    {
      "text": "Bonnie A Nardi, Steve Whittaker, and Erin Bradner. 2000. Interaction and outeraction: instant messaging in action. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 79--88.",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Bruno Nardo, Marco Cannistrà, Vincenzo Diaco, Agostino Naso, Matteo Novello, Alessandra Zullo, Michele Ruggiero, Raffaele Grande, and Rosario Sacco. 2016. Optimizing patient surgical management using WhatsApp application in the Italian healthcare system. Telemedicine and e-Health 22, 9 (2016), 718--725.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens and Clemens Nylandsted Klokmose. 2018. The application and its consequences for non-standard knowledge work. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 399.",
      "doi": "10.1145/3173574.3173973"
    },
    {
      "text": "Sherman D Quan, Robert C Wu, Peter G Rossos, Teri Arany, Silvi Groe, Dante Morra, Brian M Wong, Rodrigo Cavalcanti, William Coke, and Francis Y Lau. 2013. It's not about pager replacement: An in-depth look at the interprofessional nature of communication in healthcare. Journal of hospital medicine 8, 3 (2013), 137--143.",
      "doi": ""
    },
    {
      "text": "Anabel Quan-Haase, Joseph Cothrel, and Barry Wellman. 2005. Instant messaging for collaboration: A case study of a high-tech firm. Journal of Computer-Mediated Communication 10, 4 (2005), JCMC10413.",
      "doi": ""
    },
    {
      "text": "EE Raja, Rajinder Mahal, and Veena Barkat Masih. 2004. An exploratory study to assess the computer knowledge, attitude and skill among nurses in health care setting of a selected hospital in Ludhiana, Punjab, India. Studies in health technology and informatics 107, Pt 2 (2004), 1304--1307.",
      "doi": ""
    },
    {
      "text": "Shimaa Ali Abd-Elmaksoud Romman, Magda Amen Elmola, Magda Abd Elhamid, Manal Amin Zamzam, and others. 2017. Relationship between electronic medical record utilization and the quality of nursing care at Pediatric Oncology Hospital. Egyptian Nursing Journal 14, 2 (2017), 124.",
      "doi": ""
    },
    {
      "text": "Chiara Rossitto, Cristian Bogdan, and Kerstin Severinson-Eklundh. 2014. Understanding constellations of technologies in use in a collaborative nomadic setting. Computer Supported Cooperative Work (CSCW) 23, 2 (2014), 137--161.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks. 1992. Lectures on conversation [1964--1972]. Maiden, MA: Blackwell (1992).",
      "doi": ""
    },
    {
      "text": "Kirsten Sadler, Toni Robertson, Melanie Kan, and Penny Hagen. 2006. Balancing work, life and other concerns: a study of mobile technology use by Australian freelancers. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles. ACM, 413--416.",
      "doi": "10.1145/1182475.1182525"
    },
    {
      "text": "Paul R Schalow, Till J Winkler, Jonas Repschlaeger, and Ruediger Zarnekow. 2013. The Blurring Boundaries Of Work-Related And Personal Media Use: A Grounded Theory Study On The Employee's Perspective.. In ECIS. 212.",
      "doi": ""
    },
    {
      "text": "Jeremiah Scholl and Kristina Groth. 2012. Of organization, device and context: Interruptions from mobile communication in highly specialized care. Interacting with Computers 24, 5 (2012), 358--373.",
      "doi": "10.1016/j.intcom.2012.06.002"
    },
    {
      "text": "Meredith M Skeels and Jonathan Grudin. 2009. When social networks cross boundaries: a case study of workplace use of facebook and linkedin. In Proceedings of the ACM 2009 international conference on Supporting group work. ACM, 95--104.",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Lee Sproull, Sara Kiesler, and Sara B Kiesler. 1991. Connections: New ways of working in the networked organization. MIT press.",
      "doi": "10.5555/117640"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1--2 (1999), 9--30.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L Cox, Jon Bird, and Rachel Benedyk. 2013. I'd sit at home and do work emails: how tablets affect the work-life balance of office workers. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1383--1388.",
      "doi": "10.1145/2468356.2468603"
    },
    {
      "text": "Erik Stolterman, Heekyoung Jung, Ryan Will, and Martin A Siegel. 2013. Device landscapes: A new challenge to interaction design and HCI research. Archives of Design Research 26 (2013), 7--33.",
      "doi": ""
    },
    {
      "text": "Norman Makoto Su and Gloria Mark. 2008. Communication Chains and Multitasking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 83--92. http://dx.doi.org/10.1145/1357054.1357069",
      "doi": "10.1145/1357054.1357069"
    },
    {
      "text": "Charlotte Tang and Sheelagh Carpendale. 2007. An observational study on information flow during nurses' shift change. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 219--228.",
      "doi": "10.1145/1240624.1240661"
    },
    {
      "text": "Charlotte Tang and Sheelagh Carpendale. 2008. Evaluating the deployment of a mobile technology in a hospital ward. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 205--214.",
      "doi": "10.1145/1460563.1460596"
    },
    {
      "text": "Charlotte Tang and Sheelagh Carpendale. 2009a. A mobile voice communication system in medical setting: Love it or hate it?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2041--2050.",
      "doi": "10.1145/1518701.1519012"
    },
    {
      "text": "Charlotte Tang and Sheelagh Carpendale. 2009b. Supporting nurses' information flow by integrating paper and digital charting. In ECSCW 2009. Springer, 43--62.",
      "doi": ""
    },
    {
      "text": "Nelson Tenório and Pernille Bjørn. 2019. Online Harassment in the Workplace: the Role of Technology in Labour Law Disputes. Computer Supported Cooperative Work (CSCW) 28, 3--4 (2019), 293--315.",
      "doi": "10.1007/s10606-019-09351-2"
    },
    {
      "text": "Kim Thomas. 2018. Wanted: a WhatsApp alternative for clinicians. Bmj 360 (2018), k622.",
      "doi": ""
    },
    {
      "text": "Raghu Thota and Jigeeshu Divatia. 2015. WhatsApp: what an App! Indian Journal of Critical Care Medicine 19, 6 (2015), 363.",
      "doi": ""
    },
    {
      "text": "Aksel Tjora. 2004. Maintaining redundancy in the coordination of medical emergencies. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 132--141.",
      "doi": "10.1145/1031607.1031631"
    },
    {
      "text": "Thea Turner, Pernilla Qvarfordt, Jacob T Biehl, Gene Golovchinsky, and Maribeth Back. 2010. Exploring the workplace communication ecology. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 841--850.",
      "doi": "10.1145/1753326.1753449"
    },
    {
      "text": "Jane Wakefield. 2017. Use of WhatsApp in NHS 'widespread', say doctors. (July 2017). https://www.bbc.com/news/technology-40507440",
      "doi": ""
    },
    {
      "text": "Shabeer Ahmad Wani, Sari M Rabah, Sara AlFadil, Nancy Dewanjee, and Yahya Najmi. 2013. Efficacy of communication amongst staff members at plastic and reconstructive surgery section using smartphone and mobile WhatsApp. Indian journal of plastic surgery: official publication of the Association of Plastic Surgeons of India 46, 3 (2013), 502.",
      "doi": ""
    },
    {
      "text": "Juliana J Willemse. 2015. Undergraduate nurses reflections on Whatsapp use in improving primary health care education. curationis 38, 2 (2015), 1--7.",
      "doi": ""
    },
    {
      "text": "Yan Xiao, Caterina Lasome, Jacqueline Moss, Colin F Mackenzie, and Samer Faraj. 2001. Cognitive properties of a whiteboard: a case study in a trauma centre. In ECSCW 2001. Springer, 259--278.",
      "doi": ""
    },
    {
      "text": "Hakan Yaman, Erdincc Yavuz, Adem Er, Ramazan Vural, Yalcc in Albayrak, Ahmet Yardimci, and Özcan Asilkan. 2016. The use of mobile smart devices and medical apps in the family practice setting. Journal of evaluation in clinical practice 22, 2 (2016), 290--296.",
      "doi": ""
    },
    {
      "text": "Yushi Yang and A Joy Rivera. 2015. An observational study of hands-free communication devices mediated interruption dynamics in a nursing work system. Health Policy and Technology 4, 4 (2015), 378--386.",
      "doi": ""
    },
    {
      "text": "Yan Zhong-mei. 2015. The application of the Wechat in nurses' inservice training. Chinese Journal of Nursing Education 6 (2015), 17.",
      "doi": ""
    },
    {
      "text": "Xiaomu Zhou, Mark S Ackerman, and Kai Zheng. 2009. I just don't know why it's gone: maintaining informal information use in inpatient care. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2061--2070.",
      "doi": "10.1145/1518701.1519014"
    },
    {
      "text": "Xiaomu Zhou, Mark S Ackerman, and Kai Zheng. 2010. Computerization and information assembling process: nursing work and CPOE adoption. In Proceedings of the 1st ACM International Health Informatics Symposium. ACM, 36--45.",
      "doi": "10.1145/1882992.1883000"
    }
  ]
}