{
  "doi": "10.1145/3313831.3376863",
  "title": "Voice+Tactile: Augmenting In-vehicle Voice User Interface with Tactile Touchpad Interaction",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Promisingly, driving is adapting to a Voice User Interface (VUI) that lets drivers utilize diverse applications with little effort. However, the VUI has innate usability issues, such as a turn-taking problem, a short-term memory workload, inefficient controls, and difficulty correcting errors. To overcome these weaknesses, we explored supplementing the VUI with tactile interaction. As an early result, we present the Voice+Tactile interactions that augment the VUI via multi-touch inputs and high-resolution tactile outputs. We designed various Voice+Tactile interactions to support different VUI interaction stages and derived four Voice+Tactile interaction themes: Status Feedback, Input Adjustment, Output Control, and Finger Feedforward. A user study showed that the Voice+Tactile interactions improved the VUI efficiency and its user experiences without incurring significant additional distraction overhead on driving. We hope these early results open new research questions to improve in-vehicle VUI with a tactile channel.",
  "tags": [
    "tactile feedback touchpad",
    "voice user interface",
    "in-vehicle user interface"
  ],
  "authors": [
    {
      "name": "Jingun Jung",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "60000000515",
      "orcid": "missing"
    },
    {
      "name": "Sangyoon Lee",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659303571",
      "orcid": "missing"
    },
    {
      "name": "Jiwoo Hong",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-99659163295/rel-imgonly/cb9b7a2a-abd1-40d9-8c74-de386dca4aa3-1863-0000017e75a42845.jpg",
      "acmid": "99659163295",
      "orcid": "missing"
    },
    {
      "name": "Eunhye Youn",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640721",
      "orcid": "missing"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ken Abbott. 2002. VUI Design Principles and Techniques. Apress, Berkeley, CA, 87--103. DOI: http://dx.doi.org/10.1007/978--1--4302-0850--1_8",
      "doi": ""
    },
    {
      "text": "Barry Arons. 1991. Hyperspeech: Navigating in Speech-Only Hypermedia. In Proceedings of the Third Annual ACM Conference on Hypertext (HYPERTEXT '91). Association for Computing Machinery, New York, NY, USA, 133--146. DOI: http://dx.doi.org/10.1145/122974.122989",
      "doi": "10.1145/122974.122989"
    },
    {
      "text": "Amna Asif and Susanne Boll. 2010. Where to Turn My Car? Comparison of a Tactile Display and a Conventional Car Navigation System under High Load Condition. In Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '10). Association for Computing Machinery, New York, NY, USA, 64--71. DOI: http://dx.doi.org/10.1145/1969773.1969786",
      "doi": "10.1145/1969773.1969786"
    },
    {
      "text": "Matthew P. Aylett, Per Ola Kristensson, Steve Whittaker, and Yolanda Vazquez-Alvarez. 2014. None of a CHInd: Relationship Counselling for HCI and Speech Technology. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). Association for Computing Machinery, New York, NY, USA, 749--760. DOI: http://dx.doi.org/10.1145/2559206.2578868",
      "doi": "10.1145/2559206.2578868"
    },
    {
      "text": "Kenneth Majlund Bach, Mads Gregers Jæger, Mikael B. Skov, and Nils Gram Thomassen. 2008. You Can Touch, but You Can't Look: Interacting with In-vehicle Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1139--1148. DOI: http://dx.doi.org/10.1145/1357054.1357233",
      "doi": ""
    },
    {
      "text": "Grace M. Begany, Ning Sa, and Xiaojun Yuan. 2015. Factors Affecting User Perception of a Spoken Language vs. Textual Search Interface: A Content Analysis. Interacting with Computers 28, 2 (07 2015), 170--180. DOI: http://dx.doi.org/10.1093/iwc/iwv029",
      "doi": ""
    },
    {
      "text": "Ludovic Le Bigot, Loïc Caroux, Christine Ros, Agnès Lacroix, and Valérie Botherel. 2013. Investigating memory constraints on recall of options in interactive voice response system messages. Behaviour & Information Technology 32, 2 (2013), 106--116. DOI: http://dx.doi.org/10.1080/0144929X.2011.563800",
      "doi": "10.1080/0144929X.2011.563800"
    },
    {
      "text": "Michael Braun, Nora Broy, Bastian Pfleging, and Florian Alt. 2019. Visualizing natural language interaction for conversational in-vehicle information systems to minimize driver distraction. Journal on Multimodal User Interfaces 13, 2 (2019), 71--88. DOI: http://dx.doi.org/10.1007/s12193-019-00301--2",
      "doi": ""
    },
    {
      "text": "Alex Cao, Keshav K. Chintamani, Abhilash K. Pandya, and R Darin Ellis. 2009. NASA TLX: Software for assessing subjective mental workload. Behavior research methods 41, 1 (2009), 113--117. DOI: http://dx.doi.org/10.3758/BRM.41.1.113",
      "doi": ""
    },
    {
      "text": "Riccardo Coppola and Maurizio Morisio. 2016. Connected Car: Technologies, Issues, Future Trends. ACM Comput. Surv. 49, 3, Article Article 46 (Oct. 2016), 36 pages. DOI: http://dx.doi.org/10.1145/2971482",
      "doi": "10.1145/2971482"
    },
    {
      "text": "Eric Corbett and Astrid Weber. 2016. What Can I Say? Addressing User Experience Challenges of a Mobile Voice User Interface for Accessibility. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). Association for Computing Machinery, New York, NY, USA, 72--82. DOI: http://dx.doi.org/10.1145/2935334.2935386",
      "doi": "10.1145/2935334.2935386"
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. ?What Can i Help You with?\": Infrequent Users' Experiences of Intelligent Personal Assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). Association for Computing Machinery, New York, NY, USA, Article Article 43, 12 pages. DOI: http://dx.doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Jan Curín, Martin Labský, Tomá? Macek, Jan Kleindienst, Hoi Young, Ann Thyme-Gobbel, Holger Quast, and Lars König. 2011. Dictating and Editing Short Texts While Driving: Distraction and Task Completion. In Proceedings of the 3rd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '11). Association for Computing Machinery, New York, NY, USA, 13--20. DOI: http://dx.doi.org/10.1145/2381416.2381418",
      "doi": "10.1145/2381416.2381418"
    },
    {
      "text": "Jan B.F. Van Erp and Hendrik A.H.C. Van Veen. 2004. Vibrotactile in-vehicle navigation system. Transportation Research Part F: Traffic Psychology and Behaviour 7, 4 (2004), 247 -- 256. DOI: http://dx.doi.org/https://doi.org/10.1016/j.trf.2004.09.003",
      "doi": ""
    },
    {
      "text": "Driver Focus-telematics. 2006. Statement of Principles, Criteria and Verification Procedures on Driver Interactions with Advanced In- Vehicle Information and Communication Systems Including. (2006).",
      "doi": ""
    },
    {
      "text": "Jonggi Hong and Leah Findlater. 2018. Identifying Speech Input Errors Through Audio-Only Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 567, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174141",
      "doi": "10.1145/3173574.3174141"
    },
    {
      "text": "Jingun Jung, Eunhye Youn, and Geehyuk Lee. 2017. PinPad: Touchpad Interaction with Fast and High-Resolution Tactile Output. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17). Association for Computing Machinery, New York, NY, USA, 2416--2425. DOI: http://dx.doi.org/10.1145/3025453.3025971",
      "doi": "10.1145/3025453.3025971"
    },
    {
      "text": "Dagmar Kern, Paul Marshall, Eva Hornecker, Yvonne Rogers, and Albrecht Schmidt. 2009. Enhancing Navigation Information with Tactile Output Embedded into the Steering Wheel. In Pervasive Computing. Springer Berlin Heidelberg, Berlin, Heidelberg, 42--58. DOI: http://dx.doi.org/10.1007/978--3--642-01516--8_5",
      "doi": ""
    },
    {
      "text": "Dagmar Kern and Bastian Pfleging. 2013. Supporting Interaction through Haptic Feedback in Automotive User Interfaces. Interactions 20, 2 (March 2013), 16--21. DOI: http://dx.doi.org/10.1145/2427076.2427081",
      "doi": "10.1145/2427076.2427081"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. ?Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 5286--5297. DOI: http://dx.doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Stefan Mattes. 2003. The lane-change-task as a tool for driver distraction evaluation. Quality of Work and Products in Enterprises of the Future 57 (2003), 60.",
      "doi": ""
    },
    {
      "text": "Nathan Medeiros-Ward, Joel M. Cooper, Andrew J. Doxon, David L. Strayer, and William R. Provancher. 2010. Bypassing the Bottleneck: The Advantage of Fingertip Shear Feedback for Navigational Cues. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 54, 24 (2010), 2042--2047. DOI: http://dx.doi.org/10.1177/154193121005402405",
      "doi": ""
    },
    {
      "text": "Kathleen K. Molnar and Marilyn G. Kletke. 1996. The impacts on user performance and satisfaction of a voice-based front-end interface for a standard software tool. International Journal of Human-Computer Studies 45, 3 (1996), 287 -- 303. DOI: http://dx.doi.org/10.1006/ijhc.1996.0053",
      "doi": "10.1006/ijhc.1996.0053"
    },
    {
      "text": "Christine Murad, Cosmin Munteanu, Leigh Clark, and Benjamin R. Cowan. 2018. Design Guidelines for Hands-Free Speech Interaction. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '18). Association for Computing Machinery, New York, NY, USA, 269--276. DOI: http://dx.doi.org/10.1145/3236112.3236149",
      "doi": "10.1145/3236112.3236149"
    },
    {
      "text": "Bastian Pfleging, Stefan Schneegass, and Albrecht Schmidt. 2012. Multimodal Interaction in the Car: Combining Speech and Gestures on the Steering Wheel. In Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '12). Association for Computing Machinery, New York, NY, USA, 155--162. DOI: http://dx.doi.org/10.1145/2390256.2390282",
      "doi": "10.1145/2390256.2390282"
    },
    {
      "text": "Roberto Pieraccini, Krishna Dayanidhi, Jonathan Bloom, Jean-Gui Dahan, Michael Phillips, Bryan R Goodman, and K Venkatesh Prasad. 2004. A multimodal conversational interface for a concept vehicle. The New School Psychology Bulletin 1, 1 (2004), 9--24.",
      "doi": ""
    },
    {
      "text": "Paul Resnick. 1994. HyperVoice: Groupware by telephone. (1994).",
      "doi": ""
    },
    {
      "text": "Paul Resnick and Robert A. Virzi. 1992. Skip and Scan: Cleaning up Telephone Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). Association for Computing Machinery, New York, NY, USA, 419--426. DOI: http://dx.doi.org/10.1145/142750.142881",
      "doi": ""
    },
    {
      "text": "Hendrik Richter, Ronald Ecker, Christopher Deisler, and Andreas Butz. 2010. HapTouch and the 2+1 State Model: Potentials of Haptic Feedback on Touch Based in-Vehicle Information Systems. In Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '10). Association for Computing Machinery, New York, NY, USA, 72--79. DOI: http://dx.doi.org/10.1145/1969773.1969787",
      "doi": "10.1145/1969773.1969787"
    },
    {
      "text": "Gözel Shakeri, Stephen A. Brewster, John Williamson, and Alexander Ng. 2016. Evaluating Haptic Feedback on a Steering Wheel in a Simulated Driving Scenario. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). Association for Computing Machinery, New York, NY, USA, 1744--1751. DOI: http://dx.doi.org/10.1145/2851581.2892497",
      "doi": "10.1145/2851581.2892497"
    },
    {
      "text": "Ben Shneiderman. 2000. The Limits of Speech Recognition. Commun. ACM 43, 9 (Sept. 2000), 63--65. DOI: http://dx.doi.org/10.1145/348941.348990",
      "doi": "10.1145/348941.348990"
    },
    {
      "text": "Roland Spies, Andreas Blattner, Christian Lange, Martin Wohlfarter, Klaus Bengler, and Werner Hamberger. 2011. Measurement of Driver's Distraction for an Early Prove of Concepts in Automotive Industry at the Example of the Development of a Haptic Touchpad. In Human-Computer Interaction. Interaction Techniques and Environments, Julie A. Jacko (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 125--132. DOI: http://dx.doi.org/10.1007/978--3--642--21605--3_14",
      "doi": ""
    },
    {
      "text": "Bernhard Suhm, Brad Myers, and Alex Waibel. 2001. Multimodal Error Correction for Speech User Interfaces. ACM Trans. Comput.-Hum. Interact. 8, 1 (March 2001), 60--98. DOI: http://dx.doi.org/10.1145/371127.371166",
      "doi": "10.1145/371127.371166"
    },
    {
      "text": "Maria Wolters, Kallirroi Georgila, Johanna D. Moore, Robert H. Logie, Sarah E. MacPherson, and Matthew Watson. 2009. Reducing Working Memory Load in Spoken Dialogue Systems. Interact. Comput. 21, 4 (Aug. 2009), 276--287. DOI: http://dx.doi.org/10.1016/j.intcom.2009.05.009",
      "doi": "10.1016/j.intcom.2009.05.009"
    },
    {
      "text": "Nicole Yankelovich, Gina-Anne Levow, and Matt Marx. 1995. Designing SpeechActs: Issues in Speech User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., USA, 369--376. DOI: http://dx.doi.org/10.1145/223904.223952",
      "doi": "10.1145/223904.223952"
    },
    {
      "text": "Bo Yi, Xiang Cao, Morten Fjeld, and Shengdong Zhao. 2012. Exploring User Motivations for Eyes-Free Interaction on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). Association for Computing Machinery, New York, NY, USA, 2789--2792. DOI: http://dx.doi.org/10.1145/2207676.2208678",
      "doi": "10.1145/2207676.2208678"
    },
    {
      "text": "Mary Zajicek, Richard Wales, and Andrew Lee. 2004. Speech interaction for older adults. Universal Access in the Information Society 3, 2 (2004), 122--130. DOI: http://dx.doi.org/10.1007/s10209-004-0091-0",
      "doi": "10.1007/s10209-004-0091-0"
    }
  ]
}