{
  "doi": "10.1145/3313831.3376433",
  "title": "Designing and Evaluating 'In the Same Boat', A Game of Embodied Synchronization for Enhancing Social Play",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Social closeness is important for health and well-being, but is difficult to maintain over a distance. Games can help connect people by strengthening existing relationships or creating new ones through shared playful experiences. We present the design and evaluation of 'In the Same Boat' (ITSB), a two-player infinite runner designed to foster social closeness in distributed dyads. ITSB leverages the synchronization of both players' input to steer a canoe down a river and avoid obstacles. We created two versions: embodied controls, which use players' physiological signals (breath rate, facial expressions), and standard keyboard controls. Results from a study with 35 dyads indicate that ITSB fostered affiliation, and while embodied controls were less intuitive, people enjoyed them more. Further, photos of the dyads were rated as happier and closer in the embodied condition, indicating the potential of embodied controls to foster social closeness in synchronized play over a distance.",
  "authors": [
    {
      "name": "Raquel Breejon Robinson",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-99659078053/rel-imgonly/raquel.png",
      "acmid": "99659078053",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Reid",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365125",
      "orcid": "missing"
    },
    {
      "name": "James Collin Fey",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260850",
      "orcid": "missing"
    },
    {
      "name": "Ansgar E. Depping",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022433",
      "orcid": "missing"
    },
    {
      "name": "Katherine Isbister",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-99659489823/rel-imgonly/ella-square.jpg",
      "acmid": "99659489823",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cynthia F Berrol. 2006. Neuroscience meets dance/movement therapy: Mirror neurons, the therapeutic process and empathy. The Arts in Psychotherapy 33, 4: 302--315. https://doi.org/https://doi.org/10.1016/j.aip.2006.04. 001",
      "doi": ""
    },
    {
      "text": "Anastasiia Beznosyk, Peter Quax, Wim Lamotte, and Karin Coninx. 2012. The Effect of CloselyCoupled Interaction on Player Experience in Casual Games. In Entertainment Computing - ICEC 2012, 243--255.",
      "doi": ""
    },
    {
      "text": "Nadia Bianchi-Berthouze, Whan Woong Kim, and Darshak Patel. 2007. Does Body Movement Engage You More in Digital Game Play? and Why? In Affective Computing and Intelligent Interaction, 102--113.",
      "doi": ""
    },
    {
      "text": "Peter Carruthers. 2018. Implicit versus Explicit Attitudes: Differing Manifestations of the Same Representational Structures? Review of Philosophy and Psychology 9, 1: 51--72. https://doi.org/10.1007/s13164-017-0354--3",
      "doi": ""
    },
    {
      "text": "Laura A Dabbish. 2008. Jumpstarting Relationships with Online Games: Evidence from a Laboratory Investigation. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08), 353--356. https://doi.org/10.1145/1460563.1460620",
      "doi": "10.1145/1460563.1460620"
    },
    {
      "text": "Ansgar E Depping, Colby Johanson, and Regan L. Mandryk. 2018. Designing for Friendship: Modeling Properties of Play, In-Game Social Capital, and Psychological Well-being. In Forthcoming CHI Play '18.",
      "doi": ""
    },
    {
      "text": "Ansgar E Depping and Regan L Mandryk. 2017. Cooperation and Interdependence: How Multiplayer Games Increase Social Closeness. CHI PLAY 2017 Proceedings of the 2017 Annual Symposium on Computer-Human Interaction in Play. https://doi.org/10.1145/3116595.3116639",
      "doi": ""
    },
    {
      "text": "Ansgar E Depping and Regan L Mandryk. 2017. Why is This Happening to Me?: How Player Attribution Can Broaden Our Understanding of Player Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17), 1040--1052. https://doi.org/10.1145/3025453.3025648",
      "doi": "10.1145/3025453.3025648"
    },
    {
      "text": "Ansgar E Depping, Regan L Mandryk, Colby Johanson, Jason T Bowey, and Shelby C Thomson. 2016. Trust Me: Social Games are Better than Social Icebreakers at Building Trust. Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '16: 116--129. https://doi.org/10.1145/2967934.2968097",
      "doi": "10.1145/2967934.2968097"
    },
    {
      "text": "Paul Dourish. Embodied Interaction?: Exploring the Foundations of a New Approach to HCI. 1--16.",
      "doi": ""
    },
    {
      "text": "Mark G. Ehrhart, Karen Holcombe Ehrhart, Scott C. Roesch, Beth G. Chung-Herrera, Kristy Nadler, and Kelsey Bradshaw. 2009. Testing the latent factor structure and construct validity of the Ten-Item Personality Inventory. Personality and Individual Differences 47, 8: 900--905. https://doi.org/10.1016/j.paid.2009.07.012",
      "doi": ""
    },
    {
      "text": "Jason B Ellis, Kurt Luther, Katherine Bessiere, and Wendy A Kellogg. 2008. Games for Virtual Team Building. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS '08), 295-- 304. https://doi.org/10.1145/1394445.1394477",
      "doi": "10.1145/1394445.1394477"
    },
    {
      "text": "Limor Fried. 2005. Adafruit. Retrieved from https://www.adafruit.com/",
      "doi": ""
    },
    {
      "text": "G. Gergely and J. S Watson. 1996. The social biofeedback model of parental affect-mirroring. The International Journal of Psycho-Analysis 77(6): 1181. Retrieved from https://search-proquestcom.oca.ucsc.edu/docview/1298180531?accountid=",
      "doi": ""
    },
    {
      "text": "Kathrin Gerling and Regan Mandryk. Designing Video Games for Older Adults and Caregivers.",
      "doi": ""
    },
    {
      "text": "John Harris, Mark Hancock, and Stacey D Scott. 2016. Leveraging Asymmetries in Multiplayer Games: Investigating Design Elements of Interdependent Play. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16), 350--361. https://doi.org/10.1145/2967934.2968113",
      "doi": "10.1145/2967934.2968113"
    },
    {
      "text": "Hamilton A Hernandez, Mallory Ketcheson, Adrian Schneider, Zi Ye, Darcy Fehlings, Lauren Switzer, Virginia Wright, Shelly K. Bursick, Chad Richards, and T. C. Nicholas Graham. 2014. Design and Evaluation of a Networked Game to Supportsocial Connection of Youth with Cerebral Palsy. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 161--168. https://doi.org/10.1145/2661334.2661370",
      "doi": ""
    },
    {
      "text": "E Tory Higgins. 1987. Self-discrepancy: A theory relating self and affect. Psychological Review 94, 319--340. https://doi.org/10.1037/0033295X.94.3.319",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Caroline Hummels, Katherine Isbister, Patrizia Marti, Elena Márquez Segura, Martin Jonsson, Florian \"Floyd\" Mueller, Pedro A N Sanches, Thecla Schiphorst, Anna Ståhl, Dag Svanaes, Ambra Trotto, Marianne Graves Petersen, and Youn-kyung Lim. 2017. Soma-Based Design Theory. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 550--557. https://doi.org/10.1145/3027063.3027082",
      "doi": "10.1145/3027063.3027082"
    },
    {
      "text": "Isto Huvila, Kim Holmberg, Stefan Ek, and Gunilla Widén-Wulff. 2010. Social capital in Second Life. Online Information Review 34, 2: 295--316. https://doi.org/10.1108/14684521011037007",
      "doi": ""
    },
    {
      "text": "Kori Inkpen, Brett Taylor, Sasa Junuzovic, John Tang, and Gina Venolia. 2013. Experiences2Go: Sharing Kids' Activities Outside the Home with Remote Family Members. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), 1329--1340. https://doi.org/10.1145/2441776.2441926",
      "doi": "10.1145/2441776.2441926"
    },
    {
      "text": "Katherine Isbister. 2012. How to stop being a buzzkill. Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services companion - MobileHCI '12: 1. https://doi.org/10.1145/2371664.2371666",
      "doi": "10.1145/2371664.2371666"
    },
    {
      "text": "Katherine Isbister. 2016. How Games Move Us: Emotion by Design. MIT Press.",
      "doi": "10.5555/2927483"
    },
    {
      "text": "Katherine Isbister, Kaho Abe, and Michael Karlesky. 2017. Interdependent Wearables (for Play). Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17: 465--471. https://doi.org/10.1145/3025453.3025939",
      "doi": "10.1145/3025453.3025939"
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, and Edward F Melcer. 2018. Social Affordances at Play?: Game Design Toward Socio - Technical Innovation. 1--9.",
      "doi": ""
    },
    {
      "text": "Jeroen Jansz and Martin Tanis. 2007. Appeal of Playing Online First Person Shooter Games. CyberPsychology & Behavior 10, 1: 133--136. https://doi.org/10.1089/cpb.2006.9981",
      "doi": ""
    },
    {
      "text": "Tejinder K Judge, Carman Neustaedter, and Andrew F Kurtz. 2010. The Family Window: The Design and Evaluation of a Domestic Media Space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10), 2361-- 2370. https://doi.org/10.1145/1753326.1753682",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Isbister Katherine, Elena Márquez Segura, Suzanne Kirkpatrick, Xiaofeng Chen, Syed Salahuddin, Gang Cao, and Raybit Tang. YAMOVE! A Movement Synchrony Game that Choreographs Social Interaction. Human Technology.",
      "doi": ""
    },
    {
      "text": "Joseph ?Jofish\" Kaye and Liz Goulding. 2004. Intimate Objects. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04), 341--344. https://doi.org/10.1145/1013115.1013175",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami, and Annika Waern. 2016. Embodied Sketching. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems: 6014-- 6027. https://doi.org/10.1145/2858036.2858486",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The design space of body games: technological, physical, and social design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13: 3365--3374. https://doi.org/10.1145/2470654.2466461",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Kerry L. Marsh, Michael J. Richardson, and R. C. Schmidt. 2009. Social Connection Through Joint Action and Interpersonal Coordination. Topics in Cognitive Science 1, 2: 320--339. https://doi.org/10.1111/j.1756--8765.2009.01022.x",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1: 48--58. https://doi.org/10.1080/02701367.1989.10607413",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: A CrossPlatform Real-Time Multi-Face Expression Recognition Toolkit. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA'16: 3723--3726. https://doi.org/10.1145/2851581.2890247",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Mitchell McEwan, Alethea Blackler, Daniel Johnson, and Peta Wyeth. 2014. Natural mapping and intuitive interaction in videogames. CHI PLAY 2014 - Proceedings of the 2014 Annual Symposium on Computer-Human Interaction in Play: 191--200. https://doi.org/10.1145/2658537.2658541",
      "doi": "10.1145/2658537.2658541"
    },
    {
      "text": "Mitchell McEwan, Daniel Johnson, Peta Wyeth, and Alethea Blackler. 2012. Videogame control device impact on the play experience. ACM International Conference Proceeding Series: 1--3. https://doi.org/10.1145/2336727.2336745",
      "doi": "10.1145/2336727.2336745"
    },
    {
      "text": "Florian (''Floyd'') Mueller, Martin Gibbs, Frank Vetere, and Stefan Agamanolis. 2008. Design Space of Networked Exertion Games Demonstrated by a Three-way Physical Game Based on Table Tennis. Comput. Entertain. 6, 3: 36:1--36:31. https://doi.org/10.1145/1394021.1394029",
      "doi": ""
    },
    {
      "text": "Florian 'Floyd' Mueller, Gunnar Stevens, Alex Thorogood, Shannon O'Brien, and Volker Wulf. 2007. Sports over a Distance. Personal Ubiquitous Comput. 11, 8: 633--645. https://doi.org/10.1007/s00779-006-0133-0",
      "doi": "10.1007/s00779-006-0133-0"
    },
    {
      "text": "Florian \"Floyd\" Mueller, Stefan Agamanolis, Frank Vetere, and Martin Gibbs. 2009. Brute Force Interactions: Leveraging Intense Physical Actions in Gaming. Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group on Design: Open 24/7 OZCHI '09: 57. https://doi.org/10.1145/1738826.1738836",
      "doi": "10.1145/1738826.1738836"
    },
    {
      "text": "Florian \"Floyd\" Mueller, Stefan Agamanolis, Frank Vetere, and Martin R. Gibbs. 2009. A framework for exertion interactions over a distance. Proceedings of the 2009 ACM SIGGRAPH Symposium on Video Games - Sandbox '09 1, 212: 143. https://doi.org/10.1145/1581073.1581096",
      "doi": ""
    },
    {
      "text": "Florian \"Floyd' Mueller, Martin R. Gibbs, Frank Vetere, and Darren Edge. 2017. Designing for Bodily Interplay in Social Exertion Games. ACM Transactions on Computer-Human Interaction 24, 3: 1--41. https://doi.org/10.1145/3064938",
      "doi": "10.1145/3064938"
    },
    {
      "text": "Florian \"Floyd\" Mueller, Shannon O'Brien, and Alex Thorogood. 2007. Jogging over a Distance: Supporting a \"Jogging Together\" Experience Although Being Apart. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA'07), 1989--1994. https://doi.org/10.1145/1240866.1240937",
      "doi": "10.1145/1240866.1240937"
    },
    {
      "text": "Lennart E. Nacke, Michael Kalyn, C Lough, and Regan L. Mandryk. 2011. Biofeedback game design: using direct and indirect physiological control to enhance game interaction. Proceedings of the SIGCHI ?: 103--112. https://doi.org/10.1145/1978942.1978958",
      "doi": ""
    },
    {
      "text": "M. Niedenthal, Paula. 2007. Embodying emotion. Science 316, May: 1002--1005. https://doi.org/10.1126/science.1093535",
      "doi": ""
    },
    {
      "text": "Paul Reddish, Ronald Fischer, and Joseph Bulbulia. 2013. Let's Dance Together: Synchrony, Shared Intentionality and Cooperation. PLoS ONE 8, 8. https://doi.org/10.1371/journal.pone.0071182",
      "doi": ""
    },
    {
      "text": "Scott Rigby and Richard Ryan. 2007. The player experience of need satisfaction (PENS) model. Immersyve Inc: 1--22. Retrieved from http://scholar.google.com/scholar?hl=en&btnG=Sea rch&q=intitle:The+Player+Experience+of+Need+S atisfaction+(+PENS+)#0",
      "doi": ""
    },
    {
      "text": "Raquel Robinson, Zachary Rubin, Elena Márquez Segura, and Katherine Isbister. 2017. All the Feels: Designing a Tool That Reveals Streamers' Biometrics to Spectators. In Proceedings of the 12th International Conference on the Foundations of Digital Games (FDG '17), 36:1--36:6. https://doi.org/10.1145/3102071.3102103",
      "doi": "10.1145/3102071.3102103"
    },
    {
      "text": "José Bernardo Rocha, Samuel Mascarenhas, and Rui Prada. 2008. Game Mechanics for Cooperative Games. ZON Digital Games 2008 0, 0: 72--80. https://doi.org/10.1523/JNEUROSCI.1920--10.2010",
      "doi": ""
    },
    {
      "text": "R. Ryan and E. Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. The American psychologist 55, 1: 68--78. https://doi.org/10.1037/0003-066X.55.1.68",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and Emotion 30, 4: 347--363. https://doi.org/10.1007/s11031-006--9051--8",
      "doi": ""
    },
    {
      "text": "Laura R. Saslow, Amy Muise, Emily A. Impett, and Matt Dubin. 2013. Can You See How Happy We Are? Facebook Images and Relationship Satisfaction. Social Psychological and Personality Science 4, 4: 411--418. https://doi.org/10.1177/1948550612460059",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura. 2016. BODYSTORMING FOR MOVEMENT-BASED INTERACTION DESIGN. 12, November: 193--251.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr, Bardia Aghabeigi, David Milam, Mona Erfani, Beth Lameman, Hamid Maygoli, and Sang Mah. 2010. Understanding and evaluating cooperative games. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10: 253. https://doi.org/10.1145/1753326.1753363",
      "doi": "10.1145/1753326.1753363"
    },
    {
      "text": "Nicholas Shim, Ronald Baecker, Jeremy Birnholtz, Karyn Moffatt, and Kennedy Hall. 2010. TableTalk Poker?: An Online Social Gaming Environment for Seniors. Futureplay 2010: 98--104. https://doi.org/http://doi.acm.org/10.1145/1920778.",
      "doi": ""
    },
    {
      "text": "Bart Simon. 2009. Wii are out of Control: Bodies, Game Screens and the Production of Gestural Excess. Loading..., October: 1--27. https://doi.org/10.2139/ssrn.1354043",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros, Janne Paavilainen, and Frans Mäyrä. 2009. The many faces of sociability and social play in games. In Proceedings of the 13th International MindTrek Conference: Everyday Life in the Ubiquitous Era on - MindTrek '09, 82. https://doi.org/10.1145/1621841.1621857",
      "doi": "10.1145/1621841.1621857"
    },
    {
      "text": "Clare A.M. Sutherland, Lauren E. Rowley, Unity T. Amoaku, Ella Daguzan, Kate A. Kidd-Rossiter, Ugne Maceviciute, and Andrew W. Young. 2015. Personality judgments from everyday images of faces. Frontiers in Psychology 6, OCT: 1--11. https://doi.org/10.3389/fpsyg.2015.01616",
      "doi": ""
    },
    {
      "text": "Sabine Trepte, Leonard Reinecke, and Keno Juechems. 2012. The social side of gaming: How playing online computer games creates online and offline social support. Computers in Human Behavior 28, 3: 832--839. https://doi.org/https://doi.org/10.1016/j.chb.2011.12 .003",
      "doi": "10.1016/j.chb.2011.12.003"
    },
    {
      "text": "Wouter Walmink, Danielle Wilde, and Florian \"Floyd\" Mueller. 2013. Displaying Heart Rate Data on a Bicycle Helmet to Support Social Exertion Experiences. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14), 97--104. https://doi.org/10.1145/2540930.2540970",
      "doi": "10.1145/2540930.2540970"
    },
    {
      "text": "D. Williams, Nicolas Ducheneaut, N. Yee, and Eric Nickell. 2006. The Social Life of Guilds in World of Warcraft. Games and Culture 1, 4: 338--361. https://doi.org/10.1177/1555412006292616",
      "doi": ""
    },
    {
      "text": "Allison F Winters. 2008. Emotion, Embodiment, and Mirror Neurons in Dance/Movement Therapy: A Connection Across Disciplines. American Journal of Dance Therapy 30, 2: 84. https://doi.org/10.1007/s10465-008--9054-y",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Cliff Lampe, Rick Wash, Nicole Ellison, and Jessica Vitak. 2011. The \"S\" in Social Network Games: Initiating, Maintaining, and Enhancing Relationships. 2011 44th Hawaii International Conference on System Sciences: 1--10. https://doi.org/10.1109/HICSS.2011.400",
      "doi": "10.1109/HICSS.2011.400"
    },
    {
      "text": "Midori Yamagishi and Jyuji Misumi. 1994. 30 Yamagishl and Yamagishi. 18, 2. Retrieved from https://lookaside.fbsbx.com/file/Yamagishi article Trust and commitment in the United states and Japan.pdf?token=AWxbMgdbujdcdnQGvWEMoHIk_wXBwfhyGBstmJu0qQD_ZP7UGN3iaLJOEjJG2LlriDGawf9AcIun01fa9AecDte fGpNAwsWMen0vsG3PeupWJCNvQVXm3pBNE ca8OJ9UglX_maptG",
      "doi": ""
    },
    {
      "text": "Farnaz Zangouei, Mohammad Ali Babazadeh Gashti, Kristina Höök, Tim Tijs, Gert-Jan de Vries, and Joyce Westerink. 2010. How to stay in the emotional rollercoaster. Proceedings of the 6th Nordic Conference on Human-Computer Interaction Extending Boundaries - NordiCHI '10: 571. https://doi.org/10.1145/1868914.1868978",
      "doi": "10.1145/1868914.1868978"
    },
    {
      "text": "Temple Run. Retrieved from https://www.imangistudios.com/",
      "doi": ""
    },
    {
      "text": "2018. 2018 Essential Facts About The Computer And Video Game Industry. Retrieved from http://www.theesa.com/wpcontent/uploads/2018/05/EF2018_FINAL.pdf",
      "doi": ""
    }
  ]
}