{
  "doi": "10.1145/3313831.3376232",
  "title": "Will the Crowd Game the Algorithm?: Using Layperson Judgments to Combat Misinformation on Social Media by Downranking Distrusted Sources",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "How can social media platforms fight the spread of misinformation? One possibility is to use newsfeed algorithms to downrank content from sources that users rate as untrustworthy. But will laypeople be handicapped by motivated reasoning or lack of expertise, and thus unable to identify misinformation sites? And will they \"game\" this crowdsourcing mechanism in order to promote content that aligns with their partisan agendas? We conducted a survey experiment in which =984 Americans indicated their trust in numerous news sites. To study the tendency of people to game the system, half of the participants were told their responses would inform social media ranking algorithms. Participants trusted mainstream sources much more than hyper-partisan or fake news sources, and their ratings were highly correlated with professional fact-checker judgments. Critically, informing participants that their responses would influence ranking algorithms did not diminish these results, despite the manipulation increasing the political polarization of trust ratings.",
  "authors": [
    {
      "name": "Ziv Epstein",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-99659052816/rel-imgonly/12186707_10207921956549362_6024261905473397476_o.jpg",
      "acmid": "99659052816",
      "orcid": "missing"
    },
    {
      "name": "Gordon Pennycook",
      "institution": "University of Regina, Regina, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658713762",
      "orcid": "missing"
    },
    {
      "name": "David Rand",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659054185",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2018. Fact-Checking on Facebook: What Publishers Should Know. (Jun 2018). https://www.facebook.com/help/publisher/182222309230722",
      "doi": ""
    },
    {
      "text": "Dennis Alann, Atino Kim, and Tricia Moravec. 2018. Facebook's Bad Idea: Crowdsourced Ratings Work For Toasters, But Not News. https://www.buzzfeednews.com/article/alandennis/ facebooks-bad-idea-crowsourced-ratings-work-for-toasters. (Jan 2018).",
      "doi": ""
    },
    {
      "text": "Bence Bago, David Rand, and Gordon Pennycook. 2019. Fake news, fast and slow: Deliberation reduces belief in false (but not true) news headlines. (2019).",
      "doi": ""
    },
    {
      "text": "Md Momen Bhuiyan, Kexin Zhang, Kelsey Vick, Michael A Horning, and Tanushree Mitra. 2018. FeedReflect: A Tool for Nudging Users to Assess News Credibility on Twitter. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 205--208.",
      "doi": "10.1145/3272973.3274056"
    },
    {
      "text": "Xunru Che, Danaë Metaxa-Kakavouli, and Jeffrey T Hancock. 2018. Fake News in the News: An Analysis of Partisan Coverage of the Fake News Phenomenon. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 289--292.",
      "doi": "10.1145/3272973.3274079"
    },
    {
      "text": "Giovanni Luca Ciampaglia, Prashant Shiralkar, Luis M Rocha, Johan Bollen, Filippo Menczer, and Alessandro Flammini. 2015. Computational fact checking from knowledge networks. PloS one 10, 6 (2015), e0128193.",
      "doi": ""
    },
    {
      "text": "Philip E Converse. 2000. Assessing the capacity of mass electorates. Annual review of political science 3, 1 (2000), 331--353.",
      "doi": ""
    },
    {
      "text": "Alexander Coppock and Oliver A McClellan. 2019. Validating the demographic, political, psychological, and experimental results obtained from a new source of online survey respondents. Research & Politics 6, 1 (2019), 2053168018822174.",
      "doi": ""
    },
    {
      "text": "Song Feng, Ritwik Banerjee, and Yejin Choi. 2012. Syntactic stylometry for deception detection. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Short Papers-Volume 2. Association for Computational Linguistics, 171--175.",
      "doi": "10.5555/2390665.2390708"
    },
    {
      "text": "Simon Gächter and Jonathan F Schulz. 2016. Intrinsic honesty and the prevalence of rule violations across societies. Nature 531, 7595 (2016), 496.",
      "doi": ""
    },
    {
      "text": "Francis Galton. 1907. Vox populi (the wisdom of crowds). Nature 75, 7 (1907), 450--451.",
      "doi": ""
    },
    {
      "text": "Uri Gneezy, Bettina Rockenbach, and Marta Serra-Garcia. 2013. Measuring lying aversion. Journal of Economic Behavior & Organization 93 (2013), 293--300.",
      "doi": ""
    },
    {
      "text": "Benjamin Golub and Matthew O Jackson. 2010. Naive learning in social networks and the wisdom of crowds. American Economic Journal: Microeconomics 2, 1 (2010), 112--49.",
      "doi": ""
    },
    {
      "text": "Naeemul Hassan, Bill Adair, James T Hamilton, Chengkai Li, Mark Tremayne, Jun Yang, and Cong Yu. 2015. The quest to automate fact-checking. In Proceedings of the 2015 Computation+ Journalism Symposium.",
      "doi": ""
    },
    {
      "text": "Christoph Hube, Besnik Fetahu, and Ujwal Gadiraju. 2019. Understanding and mitigating worker biases in the crowdsourced collection of subjective judgments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 407.",
      "doi": "10.1145/3290605.3300637"
    },
    {
      "text": "Taylor Hughes, Jeff Smith, and Alex Leavitt. 2018. Helping People Better Assess the Stories They See in News Feed with the Context Button. (Jun 2018). https://about.fb.com/news/2018/04/ news-feed-fyi-more-context/",
      "doi": ""
    },
    {
      "text": "Maurice Jakesch, Moran Koren, Anna Evtushenko, and Mor Naaman. 2018. The Role of Source, Headline and Expressive Responding in Political News Evaluation. Headline and Expressive Responding in Political News Evaluation (December 5, 2018) (2018).",
      "doi": ""
    },
    {
      "text": "Shan Jiang and Christo Wilson. 2018. Linguistic Signals under Misinformation and Fact-Checking: Evidence from User Comments on Social Media. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 82.",
      "doi": "10.1145/3274351"
    },
    {
      "text": "Dan M Kahan. 2017. Misconceptions, misinformation, and the logic of identity-protective cognition. (2017).",
      "doi": ""
    },
    {
      "text": "Jooyeon Kim, Behzad Tabibian, Alice Oh, Bernhard Schölkopf, and Manuel Gomez-Rodriguez. 2018. Leveraging the crowd to detect and reduce the spread of fake news and misinformation. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining. ACM, 324--332.",
      "doi": "10.1145/3159652.3159734"
    },
    {
      "text": "David MJ Lazer and others. 2018. The science of fake news. Science 359, 6380 (2018), 1094--1096.",
      "doi": ""
    },
    {
      "text": "Michael Luca and Georgios Zervas. 2016. Fake it till you make it: Reputation, competition, and Yelp review fraud. Management Science 62, 12 (2016), 3412--3427.",
      "doi": "10.1287/mnsc.2015.2304"
    },
    {
      "text": "Cameron Martel, Gordon Pennycook, and David Rand. 2019. Reliance on emotion promotes belief in fake news. (2019).",
      "doi": ""
    },
    {
      "text": "Katerina Eva Matsa and Elisa Shearer. 2018. News Use Across Social Media Platforms 2018. (Sep 2018). https://www.journalism.org/2018/09/10/ news-use-across-social-media-platforms-2018/",
      "doi": ""
    },
    {
      "text": "A Mitchell, J Gottfried, M Barthel, and N Sumida. 2018. Distinguishing between factual and opinion statements in the news. (2018).",
      "doi": ""
    },
    {
      "text": "Amy Mitchell, Jeffrey Gottfried, and Katerina Eva Matsa. 2015. Millennials and political news. Pew research center 1 (2015).",
      "doi": ""
    },
    {
      "text": "Mohsen Mosleh, Gordon Pennycook, Antonio Alonso Arechar, and David Rand. 2019. Digital fingerprints of cognitive reflection. (2019).",
      "doi": ""
    },
    {
      "text": "Adam Mosseri. 2018. Helping Ensure News on Facebook Is From Trusted Sources. (2018). https://about.fb.com/news/2018/01/trusted-sources/",
      "doi": ""
    },
    {
      "text": "Vishwajeet Narwal, Mohamed Hashim Salih, Jose Angel Lopez, Angel Ortega, John O'Donovan, Tobias Höllerer, and Saiph Savage. 2017. Automated assistants to identify and prompt action on visual news bias. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2796--2801.",
      "doi": "10.1145/3027063.3053227"
    },
    {
      "text": "Gordon Pennycook, Adam Bear, Evan Collins, and David G. Rand. 2019a. The implied truth effect: Attaching warnings to a subset of fake news stories increases perceived accuracy of stories without warnings. https://papers.ssrn.com/sol3/papers.cfm? abstract_id=3035384, (2019).",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook, Ziv Epstein, Mohsen Mosleh, Antonio A Arechar, Dean Eckles, and David G Rand. 2019b. Understanding and reducing the spread of misinformation online. (2019).",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G Rand. 2018. Lazy, not biased: Susceptibility to partisan fake news is better explained by lack of reasoning than by motivated reasoning. Cognition (2018).",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G Rand. 2019a. Fighting misinformation on social media using crowdsourced judgments of news source quality. Proceedings of the National Academy of Sciences (2019), 201806781.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G Rand. 2019b. Lazy, not biased: Susceptibility to partisan fake news is better explained by lack of reasoning than by motivated reasoning. Cognition 188 (2019), 39--50.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook, David G Rand, and Nic Dias. 2019c. Emphasizing publishers does not effectively reduce susceptibility to misinformation on social media. (Dec 2019). osf.io/m74v2",
      "doi": ""
    },
    {
      "text": "Martin Potthast, Johannes Kiesel, Kevin Reinartz, Janek Bevendorff, and Benno Stein. 2017. A stylometric inquiry into hyperpartisan and fake news. arXiv preprint arXiv:1702.05638 (2017).",
      "doi": ""
    },
    {
      "text": "Rob Price. 2019. Mark Zuckerberg has started his 2019 challenge of doing public debates ? here are the highlights from the first one. https://www.businessinsider.com/ facebook-mark-zuckerberg-first-2019-public-discussion-2019--2. (Feb 2019).",
      "doi": ""
    },
    {
      "text": "Hannah Rashkin, Eunsol Choi, Jin Yea Jang, Svitlana Volkova, and Yejin Choi. 2017. Truth of varying shades: Analyzing language in fake news and political fact-checking. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. 2931--2937.",
      "doi": ""
    },
    {
      "text": "Robert M Ross, David Rand, and Gordon Pennycook. 2019. Beyond \"fake news\": The role of analytic thinking in the detection of inaccuracy and partisan bias in news headlines. (2019).",
      "doi": ""
    },
    {
      "text": "Geoff Samek. 2018. Greater transparency for users around news broadcasters. (2018). https://youtube.googleblog.com/2018/02/ greater-transparency-for-users-around.html",
      "doi": ""
    },
    {
      "text": "Baoxu Shi and Tim Weninger. 2016. Fact checking in heterogeneous information networks. In Proceedings of the 25th International Conference Companion on World Wide Web. International World Wide Web Conferences Steering Committee, 101--102.",
      "doi": "10.1145/2872518.2889354"
    },
    {
      "text": "Kai Shu, Amy Sliva, Suhang Wang, Jiliang Tang, and Huan Liu. 2017. Fake news detection on social media: A data mining perspective. ACM SIGKDD Explorations Newsletter 19, 1 (2017), 22--36.",
      "doi": "10.1145/3137597.3137600"
    },
    {
      "text": "Henry Silverman. 2019. Helping Fact-Checkers Identify False Claims Faster. (Dec 2019). https://about.fb.com/news/2019/12/helping-fact-checkers/",
      "doi": ""
    },
    {
      "text": "Sebastian Tschiatschek, Adish Singla, Manuel Gomez Rodriguez, Arpit Merchant, and Andreas Krause. 2018. Fake news detection in social networks via crowd signals. In Companion of the The Web Conference 2018 on The Web Conference 2018. International World Wide Web Conferences Steering Committee, 517--524.",
      "doi": "10.1145/3184558.3188722"
    },
    {
      "text": "Soroush Vosoughi, Deb Roy, and Sinan Aral. 2018. The spread of true and false news online. Science 359, 6380 (2018), 1146--1151.",
      "doi": ""
    },
    {
      "text": "Xuezhi Wang, Cong Yu, Simon Baumgartner, and Flip Korn. 2018. Relevant document discovery for fact-checking articles. In Companion of the The Web Conference 2018 on The Web Conference 2018. International World Wide Web Conferences Steering Committee, 525--533.",
      "doi": "10.1145/3184558.3188723"
    },
    {
      "text": "Peter Welinder, Steve Branson, Pietro Perona, and Serge J Belongie. 2010. The multidimensional wisdom of crowds. In Advances in neural information processing systems. 2424--2432.",
      "doi": ""
    },
    {
      "text": "Gavin Wood, Kiel Long, Tom Feltwell, Scarlett Rowland, Phillip Brooker, Jamie Mahoney, John Vines, Julie Barnett, and Shaun Lawson. 2018. Rethinking Engagement with Online News through Social and Visual Co-Annotation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 576.",
      "doi": "10.1145/3173574.3174150"
    },
    {
      "text": "You Wu, Pankaj K Agarwal, Chengkai Li, Jun Yang, and Cong Yu. 2014. Toward computational fact-checking. Proceedings of the VLDB Endowment 7, 7 (2014), 589--600.",
      "doi": "10.14778/2732286.2732295"
    },
    {
      "text": "Jonathan Zittrain and Mark Zuckerberg. 2019. Mark Zuckerberg discussion with Jonathan Zittrain. https://www.youtube.com/watch?v=WGchhsKhG-A, (2019).",
      "doi": ""
    }
  ]
}