{
  "doi": "10.1145/3313831.3376403",
  "title": "Improving Worker Engagement Through Conversational Microtask Crowdsourcing",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "The rise in popularity of conversational agents has enabled humans to interact with machines more naturally. Recent work has shown that crowd workers in microtask marketplaces can complete a variety of human intelligence tasks (HITs) using conversational interfaces with similar output quality compared to the traditional Web interfaces. In this paper, we investigate the effectiveness of using conversational interfaces to improve worker engagement in microtask crowdsourcing. We designed a text-based conversational agent that assists workers in task execution, and tested the performance of workers when interacting with agents having different conversational styles. We conducted a rigorous experimental study on Amazon Mechanical Turk with 800 unique workers, to explore whether the output quality, worker engagement and the perceived cognitive load of workers can be affected by the conversational agent and its conversational styles. Our results show that conversational interfaces can be effective in engaging workers, and a suitable conversational style has potential to improve worker engagement.",
  "tags": [
    "conversational style",
    "microtask crowdsourcing",
    "cognitive task load",
    "conversational interface",
    "user engagement"
  ],
  "authors": [
    {
      "name": "Sihang Qiu",
      "institution": "Delft University of Technology, Delft, Netherlands",
      "img": "/do/10.1145/contrib-99659280517/rel-imgonly/sihang_zoo.jpg",
      "acmid": "99659280517",
      "orcid": "missing"
    },
    {
      "name": "Ujwal Gadiraju",
      "institution": "Leibniz Universität Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-83458903457/rel-imgonly/ujwal-circle.png",
      "acmid": "83458903457",
      "orcid": "0000-0002-6189-6539"
    },
    {
      "name": "Alessandro Bozzon",
      "institution": "Delft University of Technology, Delft, Netherlands",
      "img": "/do/10.1145/contrib-81314480825/rel-imgonly/me_medium.jpg",
      "acmid": "81314480825",
      "orcid": "0000-0002-3300-2913"
    }
  ],
  "references": [
    {
      "text": "Alan Aipe and Ujwal Gadiraju. 2018. SimilarHITs: Revealing the Role of Task Similarity in Microtask Crowdsourcing. In Proceedings of the 29th on Hypertext and Social Media. ACM, 115--122.",
      "doi": "10.1145/3209542.3209558"
    },
    {
      "text": "Sandeep Avula, Gordon Chadwick, Jaime Arguello, and Robert Capra. 2018. SearchBots: User Engagement with ChatBots During Collaborative Search. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval. ACM, 52--61.",
      "doi": "10.1145/3176349.3176380"
    },
    {
      "text": "Luka Bradeko, Michael Witbrock, Janez Starc, Zala Herga, Marko Grobelnik, and Dunja Mladeni´ c. 2017. Curious Cat--Mobile, Context-Aware Conversational Crowdsourcing Knowledge Acquisition. ACM Transactions on Information Systems (TOIS) 35, 4 (2017), 33.",
      "doi": ""
    },
    {
      "text": "Phil Cohen, Adam Cheyer, Eric Horvitz, Rana El Kaliouby, and Steve Whittaker. 2016. On the future of personal assistants. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1032--1037.",
      "doi": "10.1145/2851581.2886425"
    },
    {
      "text": "Benjamin R Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. What can i help you with?: infrequent users' experiences of intelligent personal assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 43.",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Peng Dai, Jeffrey M. Rzeszotarski, Praveen Paritosh, and Ed H. Chi. 2015. And now for something completely different: Improving crowdsourcing workflows with micro-diversions. In Proceeding of The 18th ACM Conference on Computer-Supported Cooperative Work and Social Computing. ACM, 628--638.",
      "doi": ""
    },
    {
      "text": "Djellel Eddine Difallah, Michele Catasta, Gianluca Demartini, and Philippe Cudré-Mauroux. 2014. Scaling-up the crowd: Micro-task pricing schemes for worker retention and latency improvement. In Second AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Djellel Eddine Difallah, Michele Catasta, Gianluca Demartini, Panagiotis G Ipeirotis, and Philippe Cudré-Mauroux. 2015. The dynamics of micro-task crowdsourcing: The case of amazon mturk. In Proceedings of the 24th international conference on world wide web. International World Wide Web Conferences Steering Committee, 238--247.",
      "doi": "10.1145/2736277.2741685"
    },
    {
      "text": "Li Fei-Fei, Rob Fergus, and Pietro Perona. 2007. Learning generative visual models from few training examples: An incremental bayesian approach tested on 101 object categories. Computer vision and Image understanding 106, 1 (2007), 59--70.",
      "doi": ""
    },
    {
      "text": "Oluwaseyi Feyisetan, Elena Simperl, Max Van Kleek, and Nigel Shadbolt. 2015. Improving paid microtasks through gamification and adaptive furtherance incentives. In Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 333--343.",
      "doi": "10.1145/2736277.2741639"
    },
    {
      "text": "Joel E Fischer, Stuart Reeves, Martin Porcheron, and Rein Ove Sikveland. 2019. Progressivity for voice interface design. In Proceedings of the 1st International Conference on Conversational User Interfaces. ACM, 26.",
      "doi": "10.1145/3342775.3342788"
    },
    {
      "text": "Ujwal Gadiraju, Ricardo Kawase, and Stefan Dietze. 2014. A taxonomy of microtasks on the web. In Proceedings of the 25th ACM conference on Hypertext and social media. ACM, 218--223.",
      "doi": "10.1145/2631775.2631819"
    },
    {
      "text": "Ujwal Gadiraju, Jie Yang, and Alessandro Bozzon. 2017. Clarity is a worthwhile quality: On the role of task clarity in microtask crowdsourcing. In Proceedings of the 28th ACM Conference on Hypertext and Social Media. ACM, 5--14.",
      "doi": "10.1145/3078714.3078715"
    },
    {
      "text": "Bettina Graf, Maike Krüger, Felix Müller, Alexander Ruhland, and Andrea Zech. 2015. Nombot: simplify food tracking. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia. ACM, 360--363.",
      "doi": "10.1145/2836041.2841208"
    },
    {
      "text": "Lei Han, Kevin Roitero, Ujwal Gadiraju, Cristina Sarasua, Alessandro Checco, Eddy Maddalena, and Gianluca Demartini. 2019. All those wasted hours: On task abandonment in crowdsourcing. In Proceedings of the Twelfth ACM International Conference on Web Search and Data Mining. ACM, 321--329.",
      "doi": "10.1145/3289600.3291035"
    },
    {
      "text": "Sandra G. Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage publications Sage CA: Los Angeles, CA, 904--908.",
      "doi": ""
    },
    {
      "text": "Rens Hoegen, Deepali Aneja, Daniel McDuff, and Mary Czerwinski. 2019. An End-to-End Conversational Style Matching Agent. arXiv preprint arXiv:1904.02760 (2019).",
      "doi": ""
    },
    {
      "text": "Sture Holm. 1979. A simple sequentially rejective multiple test procedure. Scandinavian journal of statistics (1979), 65--70.",
      "doi": ""
    },
    {
      "text": "Ting-Hao Kenneth Huang, Joseph Chee Chang, and Jeffrey P Bigham. 2018. Evorus: A Crowd-powered Conversational Assistant Built to Automate Itself Over Time. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 295.",
      "doi": "10.1145/3173574.3173869"
    },
    {
      "text": "Ting-Hao Kenneth Huang, Walter S Lasecki, and Jeffrey P Bigham. 2015. Guardian: A crowd-powered spoken dialog system for web apis. In Third AAAI conference on human computation and crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Soomin Kim, Joonhwan Lee, and Gahgene Gweon. 2019. Comparing Data from Chatbot and Web Surveys: Effects of Platform and Conversational Style on Survey Response Quality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). ACM, NY, NY, USA, Article 86, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300316",
      "doi": "10.1145/3290605.3300316"
    },
    {
      "text": "Julia Kiseleva, Kyle Williams, Jiepu Jiang, Ahmed Hassan Awadallah, Aidan C Crook, Imed Zitouni, and Tasos Anastasakos. 2016. Understanding user satisfaction with intelligent assistants. In Proceedings of the 2016 ACM on Conference on Human Information Interaction and Retrieval. ACM, 121--130.",
      "doi": "10.1145/2854946.2854961"
    },
    {
      "text": "Aniket Kittur, Jeffrey V Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1301--1318.",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Pavel Kucherbaev, Alessandro Bozzon, and Geert-Jan Houben. 2018. Human-Aided Bots. IEEE Internet Computing 22, 6 (2018), 36--43.",
      "doi": "10.1109/MIC.2018.252095348"
    },
    {
      "text": "Robin Tolmach Lakoff. 1979. Stylistic strategies within a grammar of style. Annals of the New York Academy of Sciences 327, 1 (1979), 53--78.",
      "doi": ""
    },
    {
      "text": "Walter S Lasecki, Rachel Wesley, Jeffrey Nichols, Anand Kulkarni, James F Allen, and Jeffrey P Bigham. 2013. Chorus: a crowd-powered conversational assistant. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 151--162.",
      "doi": "10.1145/2501988.2502057"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286--5297.",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Andrew Mao, Ece Kamar, and Eric Horvitz. 2013. Why stop now? predicting worker engagement in online crowdsourcing. In First AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Panagiotis Mavridis, Owen Huang, Sihang Qiu, Ujwal Gadiraju, and Alessandro Bozzon. 2019. Chatterbox: Conversational Interfaces for Microtask Crowdsourcing. In Proceedings of the 27th ACM Conference on User Modeling, Adaptation and Personalization. ACM, 243--251.",
      "doi": "10.1145/3320435.3320439"
    },
    {
      "text": "Robert J Moore, Raphael Arar, Guang-Jie Ren, and Margaret H Szymanski. 2017. Conversational UX design. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 492--497.",
      "doi": "10.1145/3027063.3027077"
    },
    {
      "text": "Heather O'Brien. 2016. Theoretical perspectives on user engagement. In Why Engagement Matters. Springer, 1--26.",
      "doi": ""
    },
    {
      "text": "Heather L O'Brien, Paul Cairns, and Mark Hall. 2018. A practical approach to measuring user engagement with the refined user engagement scale (UES) and new UES short form. International Journal of Human-Computer Studies 112 (2018), 28--39.",
      "doi": ""
    },
    {
      "text": "Jeffrey M Rzeszotarski, Ed Chi, Praveen Paritosh, and Peng Dai. 2013. Inserting micro-breaks into crowdsourcing workflows. In First AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Ameneh Shamekhi, Mary Czerwinski, Gloria Mark, Margeigh Novotny, and Gregory A Bennett. 2016. An exploratory study toward the preferred conversational style for compatible virtual agents. In International Conference on Intelligent Virtual Agents. Springer, 40--50.",
      "doi": ""
    },
    {
      "text": "Tanya Stivers and Jeffrey D Robinson. 2006. A preference for progressivity in interaction. Language in society 35, 3 (2006), 367--392.",
      "doi": ""
    },
    {
      "text": "Deborah Tannen. 1987. Conversational style. Psycholinguistic models of production (1987), 251--267.",
      "doi": ""
    },
    {
      "text": "Deborah Tannen. 2005. Conversational style: Analyzing talk among friends. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Paul Thomas, Mary Czerwinski, Daniel McDuff, Nick Craswell, and Gloria Mark. 2018. Style and alignment in information-seeking conversation. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval. ACM, 42--51.",
      "doi": "10.1145/3176349.3176388"
    },
    {
      "text": "Paul Thomas, Daniel McDuff, Mary Czerwinski, and Nick Craswell. 2017. MISC: A data set of information-seeking conversations. In SIGIR 1st International Workshop on Conversational Approaches to Information Retrieval (CAIR'17), Vol. 5.",
      "doi": ""
    },
    {
      "text": "Bert Vandenberghe. 2017. Bot personas as off-the-shelf users. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 782--789.",
      "doi": "10.1145/3027063.3052767"
    },
    {
      "text": "Alexandra Vtyurina, Denis Savenkov, Eugene Agichtein, and Charles LA Clarke. 2017. Exploring conversational search with humans, assistants, and wizards. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2187--2193.",
      "doi": "10.1145/3027063.3053175"
    },
    {
      "text": "Jie Yang, Judith Redi, Gianluca Demartini, and Alessandro Bozzon. 2016. Modeling task complexity in crowdsourcing. In Fourth AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Xi Yang, Marco Aurisicchio, and Weston Baxter. 2019. Understanding Affective Experiences With Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 542.",
      "doi": "10.1145/3290605.3300772"
    },
    {
      "text": "Mengdie Zhuang and Ujwal Gadiraju. 2019. In What Mood Are You Today?: An Analysis of Crowd Workers' Mood, Performance and Engagement. In Proceedings of the 11th ACM Conference on Web Science, WebSci 2019, Boston, MA, USA, June 30-July 03, 2019. 373--382. DOI: http://dx.doi.org/10.1145/3292522.3326010",
      "doi": "10.1145/3292522.3326010"
    }
  ]
}