{
  "doi": "10.1145/3313831.3376365",
  "title": "Du Bois Wrapped Bar Chart: Visualizing Categorical Data with Disproportionate Values",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We propose a visualization technique, Du Bois wrapped bar chart, inspired by work of W.E.B Du Bois. Du Bois wrapped bar charts enable better large-to-small bar comparison by wrapping large bars over a certain threshold. We first present two crowdsourcing experiments comparing wrapped and standard bar charts to evaluate (1) the benefit of wrapped bars in helping participants identify and compare values; (2) the characteristics of data most suitable for wrapped bars. In the first study (n=98) using real-world datasets, we find that wrapped bar charts lead to higher accuracy in identifying and estimating ratios between bars. In a follow-up study (n=190) with 13 simulated datasets, we find participants were consistently more accurate with wrapped bar charts when certain category values are disproportionate as measured by entropy and H-spread. Finally, in an in-lab study, we investigate participants' experience and strategies, leading to guidelines for when and how to use wrapped bar charts.",
  "authors": [
    {
      "name": "Alireza Karduni",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349355",
      "orcid": "0000-0001-9719-7513"
    },
    {
      "name": "Ryan Wesslen",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349405",
      "orcid": "0000-0001-9638-8078"
    },
    {
      "name": "Isaac Cho",
      "institution": "North Carolina A&T State University, Greensboro, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502662146",
      "orcid": "missing"
    },
    {
      "name": "Wenwen Dou",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414604610",
      "orcid": "0000-0003-0319-9484"
    }
  ],
  "references": [
    {
      "text": "2016. W. E. B. Du Bois' Hand-Drawn Infographics of African-American Life (1900) The Public Domain Review. https://publicdomainreview.org/collections/we-b-du-bois-hand-drawn-infographics-of-africanamerican-life-1900. (2016). (Accessed on 06/12/2019).",
      "doi": ""
    },
    {
      "text": "Alfie Abdul-Rahman, Karl J Proctor, Brian Duffy, and Min Chen. 2014. Repeated measures design in crowdsourcing-based experiments for visualization. In Proceedings of the Fifth Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization. ACM, 95--102.",
      "doi": "10.1145/2669557.2669561"
    },
    {
      "text": "Witney Battle-Baptiste, Britt Rusert, and others. 2018. WEB Du Bois's Data Portraits: Visualizing Black America. Chronicle Books.",
      "doi": ""
    },
    {
      "text": "James R Beniger and Dorothy L Robyn. 1978. Quantitative graphics in statistics: A brief history. The American Statistician 32, 1 (1978), 1--11.",
      "doi": ""
    },
    {
      "text": "Rita Borgo, Alfie Abdul-Rahman, Farhan Mohamed, Philip W Grant, Irene Reppa, Luciano Floridi, and Min Chen. 2012. An empirical study on using visual embellishments in visualization. IEEE Transactions on Visualization and Computer Graphics 18 (2012), 2759--2768.",
      "doi": "10.1109/TVCG.2012.197"
    },
    {
      "text": "Rita Borgo, Joel Dearden, and Mark W Jones. 2014. Order of magnitude markers: An empirical study on large magnitude number detection. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2261--2270.",
      "doi": ""
    },
    {
      "text": "Eliot Brown. 2019. This Is Not the Way Everybody Behaves. How Adam Neumann's Over-the-Top Style Built WeWork. https://www.wsj.com/articles/this-is-notthe-way-everybody-behaves-how-adamneumanns-over-the-top-style-built-wework11568823827. (Sep 2019). (Accessed on 09/19/2019).",
      "doi": ""
    },
    {
      "text": "John Bryan. 1995. Seven types of distortion: A taxonomy of manipulative techniques used in charts and graphs. Journal of technical writing and communication 25, 2 (1995), 127--179.",
      "doi": ""
    },
    {
      "text": "Aaron Bycoffe, Sarah Frostenson, and Julia Wolfe. 2019. A Final Look At Who Won The Third Democratic Debate. https://projects.fivethirtyeight.com/ democratic-debate-september-poll/. (Sep 2019). (Accessed on 09/16/2019).",
      "doi": ""
    },
    {
      "text": "Guillaume Calmettes, Gordon B Drummond, and Sarah L Vowler. 2012. Making do with what we have: use your bootstraps. Advances in physiology education 36, 3 (2012), 177--180.",
      "doi": ""
    },
    {
      "text": "Clark R Carvalho and Michael D McMillan. 1992. Graphic representation in managerial decision making: The effect of scale break on the dependent axis. Technical Report. AIR FORCE INST OF TECH WRIGHT-PATTERSON AFB OH.",
      "doi": ""
    },
    {
      "text": "William S Cleveland. 1984. Graphical methods for data presentation: Full scale breaks, dot charts, and multibased logging. The American Statistician 38, 4 (1984), 270--280.",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the social sciences. (1988).",
      "doi": ""
    },
    {
      "text": "Geoff Der and Brian S Everitt. 2014. A handbook of statistical graphics using SAS ODS. Chapman and Hall/CRC.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair statistical communication in HCI. In Modern Statistical Methods for HCI. Springer, 291--330.",
      "doi": ""
    },
    {
      "text": "Stephen Few. 2013. Wrapping Graphs to Extend Their Limits. https://www.perceptualedge.com/articles/ visual_business_intelligence/wrapping_graphs_to_ extend_their_limits.pdf. (2013).",
      "doi": ""
    },
    {
      "text": "Robert M Gray. 2011. Entropy and information theory. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 203--212.",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Marcel Hlawatsch, Filip Sadlo, Michael Burch, and Daniel Weiskopf. 2013. Scale-Stack Bar Charts. In Computer Graphics Forum, Vol. 32. Wiley Online Library, 181--190.",
      "doi": ""
    },
    {
      "text": "Thomas Kaplan and Sarah Almukhtar. 2019. How Trump Is Outspending Every 2020 Democrat on Facebook. https://www.nytimes.com/interactive/2019/ 05/21/us/politics/trump-2020-facebook-ads.html. (May 2019). (Accessed on 09/13/2019).",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Jake M. Hofman, and Daniel G. Goldstein. Effectively Communicating Effect Sizes. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI '20). Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Daniël Lakens. 2013. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Frontiers in psychology 4 (2013), 863.",
      "doi": ""
    },
    {
      "text": "Pranathi Mylavarapu, Adil Yalcin, Xan Gregg, and Niklas Elmqvist. 2019. Ranked-List Visualization: A Graphical Perception Study. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 192, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300422",
      "doi": "10.1145/3290605.3300422"
    },
    {
      "text": "Drew Skau, Lane Harrison, and Robert Kosara. 2015. An evaluation of the impact of visual embellishments in bar charts. In Computer Graphics Forum, Vol. 34. Wiley Online Library, 221--230.",
      "doi": "10.5555/2858877.2858901"
    },
    {
      "text": "Ian Spence. 2006. William Playfair and the psychology of graphs. In Proceedings of the American Statistical Association, Section on Statistical Graphics. 2426--2436.",
      "doi": ""
    },
    {
      "text": "Ian Spence and Stephan Lewandowsky. 1991. Displaying proportions and percentages. Applied Cognitive Psychology 5, 1 (1991), 61--77.",
      "doi": ""
    },
    {
      "text": "Arjun Srinivasan, Matthew Brehmer, Bongshin Lee, and Steven M Drucker. 2018. What's the Difference?: Evaluating Variations of Multi-Series Bar Charts for Visual Comparison Tasks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 304.",
      "doi": "10.1145/3173574.3173878"
    },
    {
      "text": "Ben Starr. 2014. How to Design Bar Charts. https://visage.co/data-visualization-101-bar-charts/. (2014). (Accessed on 06/13/2019).",
      "doi": ""
    },
    {
      "text": "Justin Talbot, Vidya Setlur, and Anushka Anand. 2014. Four experiments on the perception of bar charts. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2152--2160.",
      "doi": ""
    },
    {
      "text": "AnyChart Team. 2015. First Ever Bar Charts Created in 14th Century. https://www.anychart.com/blog/2015/06/ 02/first-bar-chart-in-history/. (June 2015). (Accessed on 06/13/2019).",
      "doi": ""
    },
    {
      "text": "Anne Treisman and Janet Souther. 1985. Search asymmetry: A diagnostic for preattentive processing of separable features. Journal of Experimental Psychology: General 114, 3 (1985), 285.",
      "doi": ""
    },
    {
      "text": "ER Tufte and P Graves-Morris. 1983. Vol. 2. The Visual Display of Quantitative Information. CT: Graphics press Cheshire (1983).",
      "doi": "10.5555/33404"
    },
    {
      "text": "John W Tukey. 1976. Exploratory data analysis. Massachusetts: Addison-Wesley (1976).",
      "doi": ""
    },
    {
      "text": "Mingqian Zhao, Huamin Qu, and Michael Sedlmair. 2019. Neighborhood Perception in Bar Charts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, Article 232, 12 pages.",
      "doi": "10.1145/3290605.3300462"
    }
  ]
}