{
  "doi": "10.1145/3313831.3376464",
  "title": "From Creating Spaces for Civic Discourse to Creating Resources for Action",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper, we investigate the role of technology to address the concerns of a civil society group carrying out community-level consultation on the allocation of £1 million of community funds. We explore issues of devolved decision-making through the evaluation of a sociodigital system designed to foster deliberative virtues. We describe the ways in which this group used our system in their consultation practices. Our findings highlight how they adopted our technology to privilege specific forms of expression, ascertain issues in their community, make use of and make sense of community data, and create resources for action within their existing practices. Based on related fieldwork we discuss the impacts of structuring and configuring tools for 'talk-based' consultation in order to turn attention to the potential pitfalls and prospects for designing civic technologies that create resources for action for civil society.",
  "authors": [
    {
      "name": "Ian G. Johnson",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659020768/rel-imgonly/1u6a8263.jpg",
      "acmid": "99659020768",
      "orcid": "missing"
    },
    {
      "name": "Dalya Al-Shahrabi",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163375",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Rebecca Neaera Abers. 2003. Reflections on what Makes Empowered Participatory Governence Happen. In Deepening Democracy: Institutional Innovations in Empowered Participatory Governance, Archon Fung (ed.). Verso, London.",
      "doi": ""
    },
    {
      "text": "Shana Agid and Elizabeth Chin. 2019. Making and negotiating value: design and collaboration with community led groups. CoDesign 15, 1 (January 2019), 75--89. DOI: https://doi.org/10.1080/15710882.2018.15631",
      "doi": ""
    },
    {
      "text": "Adriana Alvarado Garcia, Alyson L Young, and Lynn Dombrowski. 2017. On Making Data Actionable. Proc. ACM Human-Computer Interact. 1, CSCW (2017), 1--19. DOI: https://doi.org/10.1145/3134654",
      "doi": ""
    },
    {
      "text": "Mariam Asad, Christopher A. Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API: Designing City-Scale Community Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, New York, USA, 2295--2306. DOI: https://doi.org/10.1145/3025453.3025963",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Mara Balestrini, Jon Bird, Paul Marshall, Alberto Zaro, and Yvonne Rogers. 2014. Understanding sustained community engagement. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, New York, New York, USA, 2675--2684. DOI: https://doi.org/10.1145/2556288.2557323",
      "doi": "10.1145/2556288.2557323"
    },
    {
      "text": "Mara Balestrini, T. Diez, and F. Kresin. 2015. From Participatory Sensing to Making Sense. Environ. Infrastructures Platforms 2015 - Infrastructures Platforms Environ. Crowd Sens. Big Data (2015), 49--56.",
      "doi": ""
    },
    {
      "text": "Mara Balestrini, Yvonne Rogers, Carolyn Hassan, Javi Creus, Martha King, and Paul Marshall. 2017. A City in Common: A Framework to Orchestrate Large-scale Citizen Engagement around Urban Issues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, New York, USA, 2282-- 2294. DOI: https://doi.org/10.1145/3025453.3025915",
      "doi": "10.1145/3025453.3025915"
    },
    {
      "text": "Mara Balestrini, Yvonne Rogers, and Paul Marshall. 2015. Civically engaged HCI. In Proceedings of the 2015 British HCI Conference on - British HCI '15, ACM Press, New York, New York, USA, 35--36. DOI: https://doi.org/10.1145/2783446.2783590",
      "doi": "10.1145/2783446.2783590"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press, New York, New York, USA, 1301. DOI: https://doi.org/10.1145/1753326.1753521",
      "doi": ""
    },
    {
      "text": "Rahul Bhargava, Ricardo Kadouaki, Emily Bhargava, Castro Guilherme, and Catherine D'Ignazio. 2016. Data Murals: Using the Arts to Build Data Literacy. J. Community Informatics 12, 3 (October 2016). Retrieved February 5, 2019 from http://cijournal.org/index.php/ciej/article/view/1276",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner and Carl DiSalvo. 2016. Data, Design and Civics: An Exploratory Study of Civic Tech. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, New York, New York, USA, 2970-- 2981. DOI: https://doi.org/10.1145/2858036.2858326",
      "doi": "10.1145/2858036.2858326"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2008. Using thematic analysis in psychology. Qual. Res. Psychol. 3, 2 (July 2008), 77--101.",
      "doi": ""
    },
    {
      "text": "Michael X. Delli Carpini, Fay Lomax Cook, and Lawrence R. Jacobs. 2004. Public Deliberation, Discursive Participation, and Citizen Engagement: A Review of the Empirical Literature. Annu. Rev. Polit. Sci. 7, 1 (May 2004), 315--344. DOI: https://doi.org/10.1146/annurev.polisci.7.1210 03.091630",
      "doi": ""
    },
    {
      "text": "Alan Chamberlain, Andy Crabtree, and Mark Davies. 2013. Community engagement for research. In Proceedings of the 6th International Conference on Communities and Technologies - C&T '13, ACM Press, New York, New York, USA, 131--139. DOI: https://doi.org/10.1145/2482991.2483001",
      "doi": "10.1145/2482991.2483001"
    },
    {
      "text": "Jill Clark, Karen Laing, David Leat, Rachel Lofthouse, Ulrike Thomas, Lucy Tiplady, and Pamela Woolner. 2017. Transformation in interdisciplinary research methodology: the importance of shared experiences in landscapes of practice. Int. J. Res. Method Educ. 40, 3 (2017), 243-- 256. DOI: https://doi.org/10.1080/1743727X.2017.12819 02",
      "doi": ""
    },
    {
      "text": "Nick Clarke and Allan Cochrane. 2013. Geographies and politics of localism: The localism of the United Kingdom's coalition government. Polit. Geogr. 34, (May 2013), 10--23. DOI: https://doi.org/10.1016/j.polgeo.2013.03.003",
      "doi": ""
    },
    {
      "text": "V. Clarke and V. Braun. 2013. Teaching thematic analysis: Overcoming challenges and developing strategies for effective learning. Psychologist 26, 2 (September 2013), 120--123. Retrieved August 13, 2015 from http://eprints.uwe.ac.uk/21155/3/Teaching thematic analysis Research Repository version.pdf",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Christopher A. Le Dantec. 2018. The Problem of Community Engagement. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, New York, New York, USA, 1--13. DOI: https://doi.org/10.1145/3173574.3174148",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Christopher A. Le Dantec. 2018. Exploring Trust in Digital Civics. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18, ACM Press, New York, New York, USA, 9--20. DOI: https://doi.org/10.1145/3196709.3196715",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Christopher A. Le Dantec. 2018. Going the Distance: Trust Work for Citizen Participation. In CHI '18 Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. DOI: https://doi.org/10.1145/3173574.3173886",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Alex Taylor, Vasilis Vlachokyriakos, Rob Comber, Bettina Nissen, and Peter Wright. 2016. Re-Making Places: HCI , 'Community Building\" and Change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 2958--2969. DOI: https://doi.org/10.1145/2858036.2858332",
      "doi": "10.1145/2858036.2858332"
    },
    {
      "text": "Catherine D'Ignazio and Rahul Bhargava. 2015. Approaches to Building Big Data Literacy. In Bloomberg Data for Good Exchange Conference. Retrieved February 5, 2019 from https://damprod.media.mit.edu/x/2016/10/20/Edu_D'Ignazio_5 2.pdf",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E. Watkins. 2015. Planning with Crowdsourced Data. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15, ACM Press, New York, New York, USA, 1717-- 1727. DOI: https://doi.org/10.1145/2675133.2675212",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15, ACM Press, New York, New York, USA, 1348-- 1358. DOI: https://doi.org/10.1145/2675133.2675147",
      "doi": ""
    },
    {
      "text": "DCLG. 2011. Localism Act. Local Department for Communities and Local Government. Retrieved May 31, 2016 from http://www.local.gov.uk/localism/localism-act",
      "doi": ""
    },
    {
      "text": "Susan Dieleman. 2015. Epistemic justice and democratic legitimacy. Hypatia 30, 4 (2015), 794-- 810. DOI: https://doi.org/10.1111/hypa.12173",
      "doi": ""
    },
    {
      "text": "Julia Díez, Paloma Conde, María Sandin, María Urtasun, Remedios López, José Luis Carrero, Joel Gittelsohn, and Manuel Franco. 2017. Understanding the local food environment: A participatory photovoice project in a low-income area in Madrid, Spain. Heal. Place 43, (2017), 95-- 103. DOI: https://doi.org/10.1016/j.healthplace.2016.11.0",
      "doi": ""
    },
    {
      "text": "Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback! In Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13, ACM Press, New York, New York, USA, 477. DOI: https://doi.org/10.1145/2441776.2441831",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Jennifer Dodge. 2009. Environmental justice and deliberative democracy: How social change organizations respond to power in the deliberative system. Policy Soc. 28, 3 (October 2009), 225--239. DOI: https://doi.org/10.1016/j.polsoc.2009.08.005",
      "doi": ""
    },
    {
      "text": "Jennifer Dodge. 2010. Tensions in deliberative practice: a view from civil society. Crit. Policy Stud. 4, 4 (December 2010), 384--404. DOI: https://doi.org/10.1080/19460171.2010.52590",
      "doi": ""
    },
    {
      "text": "Jennifer Dodge. 2014. Civil society organizations and deliberative policy making: interpreting environmental controversies in the deliberative system. Policy Sci. 47, 2 (June 2014), 161--185. DOI: https://doi.org/10.1007/s11077-014--9200-y",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, ACM Press, New York, New York, USA, 656--671. DOI: https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Sheena L. Erete. 2015. Engaging Around Neighborhood Issues. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15, ACM Press, New York, New York, USA, 1590-- 1601. DOI: https://doi.org/10.1145/2675133.2675182",
      "doi": "10.1145/2675133.2675182"
    },
    {
      "text": "Sheena L. Erete, Emily Ryou, Geoff Smith, Khristina Marie Fassett, and Sarah Duda. 2016. Storytelling with Data: Examining the Use of Data by Non-Profit Organizations. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW '16, ACM Press, New York, New York, USA, 1271-- 1281. DOI: https://doi.org/10.1145/2818048.2820068",
      "doi": "10.1145/2818048.2820068"
    },
    {
      "text": "Mark Evans, David Marsh, and Gerry Stoker. 2013. Understanding localism. Policy Stud. 34, 4 (2013). DOI: https://doi.org/10.1080/01442872.2013.82269",
      "doi": ""
    },
    {
      "text": "James S. Fishkin. 2009. When the People Speak: Deliberative Democracy and Public Consultation. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "J. Forester. 1999. The deliberative practitioner: encouraging participatory planning processes.",
      "doi": ""
    },
    {
      "text": "Mila Gascó-Hernández, Erika G. Martin, Luigi Reggi, Sunyoung Pyo, and Luis F. Luna-Reyes. 2018. Promoting the use of open government data: Cases of training and engagement. Gov. Inf. Q. 35, 2 (April 2018), 233--242. DOI: https://doi.org/10.1016/J.GIQ.2018.01.003",
      "doi": ""
    },
    {
      "text": "Eric Gordon, Becky E. Michelson, and Jason Haas. 2016. @Stake: A Game to Facilitate the Process of Deliberative Democracy. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion - CSCW '16 Companion, ACM Press, New York, New York, USA, 269--272. DOI: https://doi.org/10.1145/2818052.2869125",
      "doi": "10.1145/2818052.2869125"
    },
    {
      "text": "Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, New York, New York, USA, 2833--2842. DOI: https://doi.org/10.1145/2702123.2702255",
      "doi": "10.1145/2702123.2702255"
    },
    {
      "text": "Annette Hastings, Nick Bailey, Glen Bramley, Maria Gannon, and David Watkins. 2015. The Cost of the Cuts: The Impact on Local Government and Poorer Communites. Retrieved July 29, 2019 from https://www.jrf.org.uk/sites/default/files/jrf/migrate d/files/CostofCuts-Full.pdf",
      "doi": ""
    },
    {
      "text": "Gerard A. Hauser and Chantal Benoit-Barne. 2002. Reflections on Rhetoric, Deliberative Democracy, Civil Society, and Trust. Rhetor. Public Aff. 5, 2 (2002), 261--275. DOI: https://doi.org/10.1353/rap.2002.0029",
      "doi": ""
    },
    {
      "text": "Patsy Healey. 2003. Collaborative Planning in Perspective. Plan. Theory 2, 2 (July 2003), 101--123. DOI: https://doi.org/10.1177/14730952030022002",
      "doi": ""
    },
    {
      "text": "Patsy Healey. 2015. Collaborative planning in a stakeholder society. Town Plan. Rev. (February 2015).",
      "doi": ""
    },
    {
      "text": "Carolyn M. Hendriks. 2006. Integrated Deliberation: Reconciling Civil Society's Dual Role in Deliberative Democracy. Polit. Stud. 54, 3 (October 2006), 486--508. DOI: https://doi.org/10.1111/j.14679248.2006.00612.x",
      "doi": ""
    },
    {
      "text": "Ian G. Johnson, Alistair MacDonald, Jo Briggs, Jennifer Manuel, Karen Salt, Emma Flynn, and John Vines. 2017. Community Conversational: Supporting and Capturing Deliberative Talk in Local Consultation Processes. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, New York, USA, 2320--2333. DOI: https://doi.org/10.1145/3025453.3025559",
      "doi": "10.1145/3025453.3025559"
    },
    {
      "text": "Ian G. Johnson, Aare Puussaar, Jennifer Manuel, and Peter Wright. 2018. Neighbourhood Data. Proc. ACM Human-Computer Interact. 2, CSCW (November 2018), 1--20. DOI: https://doi.org/10.1145/3274352",
      "doi": "10.1145/3274352"
    },
    {
      "text": "Ian G. Johnson, John Vines, Nick Taylor, Edward Jenkins, and Justin Marshall. 2016. Reflections on Deploying Distributed Consultation Technologies with Community Organisations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, New York, New York, USA, 2945--2957. DOI: https://doi.org/10.1145/2858036.2858098",
      "doi": "10.1145/2858036.2858098"
    },
    {
      "text": "Axel Kaehne and Helen Taylor. 2016. Do public consultations work? The case of the Social Services and Well-being (Wales) Bill. Public Policy Adm. 31, 1 (2016), 80--99. DOI: https://doi.org/10.1177/0952076715595676",
      "doi": ""
    },
    {
      "text": "David. Ley. 1983. A social geography of the city. Harper & Row. Retrieved July 8, 2019 from https://books.google.co.uk/books/about/A_Social_ Geography_of_the_City.html?id=UtgBAQAACAA J&redir_esc=y&hl=en",
      "doi": ""
    },
    {
      "text": "Ann Light, Katie J. Hill, Nicolai Brodersen Hansen, Fiona Hackney, Kim Halskov, and Peter Dalsgaard. 2013. Exploring the dynamics of ownership in community-oriented design projects. In Proceedings of the 6th International Conference on Communities and Technologies - C&T '13, ACM Press, New York, New York, USA, 90--99. DOI: https://doi.org/10.1145/2482991.2482998",
      "doi": "10.1145/2482991"
    },
    {
      "text": "Sian E. Lindley, Anja Thieme, Alex S. Taylor, Vasilis Vlachokyriakos, Tim Regan, and David Sweeney. 2017. Surfacing Small Worlds through Data-In-Place. Comput. Support. Coop. Work 26, 1-- 2 (April 2017), 135--163. DOI: https://doi.org/10.1007/s10606-017--9263--3",
      "doi": "10.1007/s10606-017-9263-3"
    },
    {
      "text": "Vivien Lowndes and Alison Gardner. 2016. Local Government Studies Local governance under the Conservatives: super-austerity, devolution and the \"smarter state.\" (2016). DOI: https://doi.org/10.1080/03003930.2016.11508",
      "doi": ""
    },
    {
      "text": "Vivien Lowndes and Lawrence Pratchett. 2012. Local Governance under the Coalition Government: Austerity, Localism and the \"Big Society.' Local Gov. Stud. 38, 1 (February 2012), 21--40. DOI: https://doi.org/10.1080/03003930.2011.64294",
      "doi": ""
    },
    {
      "text": "Narges Mahyar, Diana V. Nguyen, Maggie Chan, Jiayi Zheng, and Steven P. Dow. 2019. The Civic Data Deluge. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS '19, ACM Press, New York, New York, USA, 1171-- 1181. DOI: https://doi.org/10.1145/3322276.3322354",
      "doi": ""
    },
    {
      "text": "Jennifer Manuel, Geoff Vigar, Tom Bartindale, and Rob Comber. 2017. Participatory Media: Creating Spaces for Storytelling in Neighbourhood Planning. Proc. 2017 SIGCHI Conf. Hum. Factors Comput. Syst. (2017), 1688--1701. DOI: https://doi.org/10.1145/3025453.3025745",
      "doi": "10.1145/3025453.3025745"
    },
    {
      "text": "Paul Matthews. 2016. Data literacy conceptions, community capabilities. J. Community Informatics 12, 3 (October 2016). Retrieved February 5, 2019 from http://cijournal.org/index.php/ciej/article/view/1348",
      "doi": ""
    },
    {
      "text": "Noelle Mcafee. 2015. Acting Politically in a Digital Age. In From Voice to Influence: Understanding Citizenship in a Digital Age, Danielle Allen and Jennifer S. Light (eds.). University of Chicago Press, 273--293. Retrieved July 23, 2015 from https://books.google.co.uk/books/about/From_Voic e_to_Influence.html?id=Rh_voQEACAAJ&pgis=1",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2016. Taking [A] part. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Cecelia B. Merkel, Lu Xiao, Umer Farooq, Craig H. Ganoe, Roderick Lee, John M. Carroll, and Mary Beth Rosson. 2004. Participatory design in community computing contexts. In Proceedings of the eighth conference on Participatory design Artful integration: interweaving media, materials and practices - PDC 04, ACM Press, New York, New York, USA, 1. DOI: https://doi.org/10.1145/1011870.1011872",
      "doi": "10.1145/1011870.1011872"
    },
    {
      "text": "Michael Mitchell and Michael Leachman. 2015. Years of Cuts Threaten to Put College Out of Reach for More Students. Retrieved July 29, 2019 from http://www.census.gov/govs/qtax/.",
      "doi": ""
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics. interactions 22, 4 (June 2015), 61--63. DOI: https://doi.org/10.1145/2776885",
      "doi": ""
    },
    {
      "text": "David Owen and Graham Smith. 2015. Survey Article: Deliberation, Democracy, and the Systemic Turn. J. Polit. Philos. 23, 2 (June 2015), 213--234. DOI: https://doi.org/10.1111/jopp.12054",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Adrian K. Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, New York, USA, 6936--6942. DOI: https://doi.org/10.1145/3025453.3025804",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Aare Puussaar, Ian G. Johnson, Kyle Montague, Philip James, and Peter Wright. 2018. Making Open Data Work for Civic Advocacy. CSCW 2, November (November 2018), 1--20. DOI: https://doi.org/https://doi.org/10.1145/3274412",
      "doi": ""
    },
    {
      "text": "Erna Ruijer, Stephan Grimmelikhuijsen, and Albert Meijer. 2017. Open data for democracy: Developing a theoretical framework for open data use. Gov. Inf. Q. 34, 1 (January 2017), 45--52. DOI: https://doi.org/10.1016/j.giq.2017.01.001",
      "doi": ""
    },
    {
      "text": "Joanna Saad-Sulonen, Andrea Botero, and Kari Kuutti. 2012. A long-term strategy for designing (in) the wild. In Proceedings of the Designing Interactive Systems Conference on - DIS '12, ACM Press, New York, New York, USA, 166. DOI: https://doi.org/10.1145/2317956.2317982",
      "doi": "10.1145/2317956.2317982"
    },
    {
      "text": "Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama, and Sara Douglas. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, New York, New York, USA, 3167--3176. DOI: https://doi.org/10.1145/2702123.2702403",
      "doi": "10.1145/2702123.2702403"
    },
    {
      "text": "John Stanton. 2014. The Big Society and Community Development: Neighbourhood Planning under the Localism Act. http://dx.doi.org/10.1350/enlr.2014.16.4.225 (December 2014). DOI: https://doi.org/10.1350/ENLR.2014.16.4.225",
      "doi": ""
    },
    {
      "text": "Angelika Strohmayer, Mary Laing, and Rob Comber. 2018. Justice-oriented ecologies: A framework for designing technologies with sex work support services. In Routledge International Handbook of Sex Industry Research, Susan Dewey, Isabel Crowhurst and Izugbara Chimaraoke (eds.). Routledge, London.",
      "doi": ""
    },
    {
      "text": "John Sturzaker and Dave Shaw. 2015. Localism in practice: lessons from a pioneer neighbourhood plan in England. Town Plan. Rev. 86, 5 (September 2015), 587--609. DOI: https://doi.org/10.3828/tpr.2015.34",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human-Machine Reconfiguration. Plans and Situated Actions. Cambridge University Press. DOI: https://doi.org/10.1017/CBO9780511808418",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, New York, New York, USA, 1549. DOI: https://doi.org/10.1145/2470654.2466206",
      "doi": "10.1145/2470654.2466206"
    },
    {
      "text": "Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, Nick Taylor, Paul Dunphy, Patrick McCorry, and Patrick Olivier. 2014. PosterVote: Expanding the Action Repertoire for Local Political Activism. In Proceedings of the 2014 conference on Designing interactive systems - DIS '14, ACM Press, New York, New York, USA, 795--804. DOI: https://doi.org/10.1145/2598510.2598523",
      "doi": "10.1145/2598510.2598523"
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Christopher A. Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16, ACM Press, New York, New York, USA, 1096--1099. DOI: https://doi.org/10.1145/2851581.2886436",
      "doi": ""
    },
    {
      "text": "Annika Wolff, Matthew Barker, and Marian Petre. 2017. Creating a datascape: A game to support communities in using open data. ACM Int. Conf. Proceeding Ser. Part F1285, (2017), 135--138. DOI: https://doi.org/10.1145/3083671.3083686",
      "doi": "10.1145/3083671.3083686"
    },
    {
      "text": "Annika Wolff, Daniel Gooch, Jose J. Cavero Montaner, Umar Rashid, and Gerd Kortuem. 2016. Creating an Understanding of Data Literacy for a Data-driven Society. J. Community Informatics 12, 3 (August 2016). Retrieved February 5, 2019 from http://cijournal.org/index.php/ciej/article/view/1286",
      "doi": ""
    },
    {
      "text": "Annika Wolff, Antti Knutas, Victoria Palacin, Cathrine Seidelin, Peter Kun, and Ingrid Mulder. 2019. Civic Data Literacies for Bottom-up Data Innovation. In Proceedings of the 9th International Conference on Communities & Technologies Transforming Communities - C&T '19, ACM Press, New York, New York, USA, 306--309. DOI: https://doi.org/10.1145/3328320.3328381",
      "doi": "10.1145/3328320.3328381"
    },
    {
      "text": "AR Toolkit. Retrieved from www.hitl.washington.edu/artoolkit/",
      "doi": ""
    }
  ]
}