{
  "doi": "10.1145/3313831.3376509",
  "title": "Digital-Enabled Last Mile: A Study of Passenger Trips in Rural, Low-density Populated Areas",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Public transportation in rural areas is difficult due to low numbers of passengers and diverse needs, also reflected in the last mile problem that points to the distance to access transportation hubs in order to connect with core networks of transportation. In this paper, we study public transportation in rural areas using a digital-enabled, demand-responsive service called Plustur. This service was recently introduced as an effort to increase mobility in underserved rural areas by creating routes ad-hoc to answer to the last mile(s). We study how passengers and drivers understand Plustur, as well as experience the role of passenger. Our findings show that Plustur is viewed as a benefit for autonomy of mobility in rural areas, however is lacking in addressing integration of modes of mobilities, flexibility and spontaneous trips. We contribute with design implications for digital multimodal mobility services.",
  "authors": [
    {
      "name": "Maria Kjærup",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260330",
      "orcid": "missing"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Niels Agerholm",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526716",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bilge Atasoy, Takuro Ikeda, Xiang Song, and Moshe E. Ben-Akiva. 2015. The concept and impact analysis of a flexible mobility on demand system. Transportation Research Part C: Emerging Technologies 56: 373--392. http://doi.org/10.1016/j.trc.2015.04.009",
      "doi": ""
    },
    {
      "text": "John Barker, Peter Kraftl, John Horton, and Faith Tucker. 2009. The road less travelled - New directions in children's and young people's mobility. Mobilities 4, 1: 1--10. http://doi.org/10.1080/17450100802657939",
      "doi": ""
    },
    {
      "text": "Oliver Bates, Adrian Friday, Julian Allen, et al. 2018. Transforming last-mile logistics: Opportunities for more sustainable deliveries. In Conference on Human Factors in Computing Systems - Proceedings. http://doi.org/10.1145/3173574.3174100",
      "doi": "10.1145/3173574.3174100"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. APA Handbook of Research Methods in Psychology: Volume 2.",
      "doi": ""
    },
    {
      "text": "Danmarks Statisik and Geodatastyrelsen. 2018. Kort over befolkningstæthed i kommunernes landdistrikter (Eng: Map of population density in the municipalities' rurals).",
      "doi": ""
    },
    {
      "text": "Joyce Dargay, Dermot Gately, and Martin Sommer. 2007. Vehicle ownership and income growth, worldwide: 1960--2030. Energy Journal 28, 4: 143-- 170. http://doi.org/10.2307/41323125",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt, Vaishnav Kameswaran, Linfeng Li, and Tanya Rosenblat. 2017. Uncovering the values and constraints of real-time ridesharing for lowresource populations. Conference on Human Factors in Computing Systems - Proceedings 2017-May: 2757-- 2769. http://doi.org/10.1145/3025453.3025470",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Epinion and Nordjyllands Trafikselskab. 2018. (DK) Mobilitet - Nulpunktsmåling, Hovedrapport, februar 2018.",
      "doi": ""
    },
    {
      "text": "MaaS Global. Whim app. Retrieved from https://whimapp.com/",
      "doi": ""
    },
    {
      "text": "Mareike Glöss, Moira McGregor, and Barry Brown. 2016. Designing for Labour. 1632--1643. http://doi.org/10.1145/2858036.2858476",
      "doi": ""
    },
    {
      "text": "Warwick Goodall, Tiffany Dovey Fishman, Justine Bornstein, and Brett Bonthron. 2018. The rise of mobility as a service. Deloitte Review, 20: 112--129. Retrieved from https://www2.deloitte.com/insights/us/en/deloittereview/issue-20/smart-transportation-technologymobility-as-a-service.html",
      "doi": ""
    },
    {
      "text": "David Gray, Jon Shaw, and John Farrington. 2006. Community transport, social capital and social exclusion in rural areas. Area 38, 1: 89--98. http://doi.org/10.1111/j.1475--4762.2006.00662.x",
      "doi": ""
    },
    {
      "text": "Jean Hardy, Susan Wyche, and Tiffany Veinot. 2019. Rural HCI research: Definitions, distinctions, methods, and opportunities. Proceedings of the ACM on HumanComputer Interaction 3, CSCW. http://doi.org/10.1145/3359298",
      "doi": "10.1145/3359298"
    },
    {
      "text": "Hanna Hasselqvist, Mia Hesselgren, and Cristian Bogdan. 2016. Challenging the car norm: Opportunities for ict to support sustainable transportation practices. Conference on Human Factors in Computing Systems Proceedings: 1300--1311. http://doi.org/10.1145/2858036.2858468",
      "doi": "10.1145/2858036.2858468"
    },
    {
      "text": "David A. Hensher. 2017. Future bus transport contracts under a mobility as a service (MaaS) regime in the digital age: Are they likely to change? Transportation Research Part A: Policy and Practice 98: 86--96. http://doi.org/10.1016/j.tra.2017.02.006",
      "doi": ""
    },
    {
      "text": "Jani Pekka Jokinen, Teemu Sihvola, and Milos N. Mladenovic. 2017. Policy lessons from the flexible transport service pilot Kutsuplus in the Helsinki Capital Region. Transport Policy, May: 1--11. http://doi.org/10.1016/j.tranpol.2017.12.004",
      "doi": ""
    },
    {
      "text": "Zhili Liu, Xudong Jia, and Wen Cheng. 2012. Solving the Last Mile Problem: Ensure the Success of Public Bicycle System in Beijing. Procedia - Social and Behavioral Sciences 43: 73--78. http://doi.org/10.1016/j.sbspro.2012.04.079",
      "doi": ""
    },
    {
      "text": "Maas-alliance. MaaS-alliance.eu/what is MaaS. Retrieved from http://maasalliance.eu/homepage/what-is-maas/",
      "doi": ""
    },
    {
      "text": "Gary Pritchard, John Vines, and Patrick Olivier. 2015. Your Money's No Good Here: The Elimination of Cash Payment on London Buses. Proceedings of the ACM CHI'15 Conference on Human Factors in Computing Systems 1: 907--916. http://doi.org/10.1145/2702123.2702137",
      "doi": "10.1145/2702123.2702137"
    },
    {
      "text": "Sunil Rodger, John Vines, and Janice McLaughlin. 2016. Technology and the Politics of Mobility. 2417-- 2429. http://doi.org/10.1145/2858036.2858146",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers and Marshall Paul. 2017. Research In the Wild. Morgan & Claypool, London.",
      "doi": ""
    },
    {
      "text": "Kevin Sanders and David Geerts. 2019. You can't go your own way: Social influences on travelling behavior. Conference on Human Factors in Computing Systems - Proceedings: 10--15. http://doi.org/10.1145/3290607.3313079",
      "doi": "10.1145/3290607.3313079"
    },
    {
      "text": "Caleb Southern, Yunnuo Cheng, Cheng Zhang, and Gregory D. Abowd. 2017. Understanding the cost of driving trips. Conference on Human Factors in Computing Systems - Proceedings 2017-May: 430-- 434. http://doi.org/10.1145/3025453.3025686",
      "doi": ""
    },
    {
      "text": "Martin Stein, Johanna Meurer, Alexander Boden, and Volker Wulf. 2017. Mobility in later life Appropriation of an integrated transportation platform. Conference on Human Factors in Computing Systems Proceedings 2017-May: 5716--5729. http://doi.org/10.1145/3025453.3025672",
      "doi": "10.1145/3025453.3025672"
    },
    {
      "text": "Michael K. Svangren, Mikael B. Skov, and Jesper Kjeldskov. 2018. Passenger Trip Planning using RideSharing Services. Proc. of CHI: 1--12. http://doi.org/10.1145/3173574.3174054",
      "doi": ""
    },
    {
      "text": "UITP. 2017. UITP Awards: North Denmarks's ?Around Your World\" increases accessibility in low density areas. Retrieved from http://www.uitp.org/news/awards-NT-denmark",
      "doi": ""
    },
    {
      "text": "Roni Utriainen and Markus Pöllänen. 2018. Review on mobility as a service in scientific publications. Research in Transportation Business and Management, July: 1--9. http://doi.org/10.1016/j.rtbm.2018.10.005",
      "doi": ""
    },
    {
      "text": "Nagendra Velaga, John Nelson, Steve Wright, and John Farrington. 2012. The Potential Role of Flexible Transport Services in Enhancing Rural Public Transport Provision. Journal of Public Transportation 15, 1: 111--131. http://doi.org/10.5038/23750901.15.1.7",
      "doi": ""
    }
  ]
}