{
  "doi": "10.1145/3313831.3376392",
  "title": "Critical Race Theory for HCI",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [
    "Best Paper"
  ],
  "abstract": "The human-computer interaction community has made some efforts toward racial diversity, but the outcomes remain meager. We introduce critical race theory and adapt it for HCI to lay a theoretical basis for race-conscious efforts, both in research and within our community. Building on the theory's original tenets, we argue that racism is pervasive in everyday socio-technical systems; that the HCI community is prone to \"interest convergence\", where concessions to inclusion require benefits to those in power; and that the neoliberal underpinnings of the technology industry itself propagate racism. Critical race theory uses storytelling as a means to upend deep-seated assumptions, and we relate several personal stories to highlight ongoing problems of race in HCI. The implications: all HCI research must be attuned to issues of race; participation of underrepresented minorities must be sought in all of our activities; and as a community, we cannot become comfortable while racial disparities exist.",
  "tags": [
    "race",
    "critical race theory",
    "theory",
    "racism",
    "storytelling"
  ],
  "authors": [
    {
      "name": "Ihudiya Finda Ogbonnaya-Ogburu",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-99659022329/rel-imgonly/ihudiya_finda.png",
      "acmid": "99659022329",
      "orcid": "missing"
    },
    {
      "name": "Angela D.R. Smith",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529450",
      "orcid": "0000-0001-5546-5452"
    },
    {
      "name": "Alexandra To",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99658642648/rel-imgonly/ato_2021_squarec.jpg",
      "acmid": "99658642648",
      "orcid": "0000-0001-7298-7607"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Michelle Alexander. 2017. The New Jim Crow . New Press.",
      "doi": ""
    },
    {
      "text": "Jeremy Ashkenas, Haeyoun Park, and Adam Pearce. 2017. Even With Affirmative Action, Blacks and Hispanics Are More Underrepresented at Top Colleges Than 35 Years Ago. (2017). https://www.nytimes.com/interactive/2017/08/24/us/affirmative-action.html",
      "doi": ""
    },
    {
      "text": "Neda Atanasoski and Kalindi Vora. 2019. Surrogate humanity: Race, robots, and the politics of technological futures. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Drake Baer. 2016. How Facebook and the `Filter Bubble' Pushed Trump to Victory . The Cut by New York Media (11 2016). https://www.thecut.com/2016/11/how-facebook-and-the-filter-bubble-pushed-trump-to-victory.html",
      "doi": ""
    },
    {
      "text": "Nat a M. Barbosa and Monchu Chen. 2019. Rehumanized Crowdsourcing: A Labeling Framework Addressing Bias and Ethics in Machine Learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 543.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, New York, New York, USA, 1301. http://dx.doi.org/10.1145/1753326.1753521",
      "doi": ""
    },
    {
      "text": "Karl Baumann, Ben Caldwell, Fracois Bar, and Benjamin Stokes. 2018. Participatory Design Fiction : Community Storytelling for Speculative Urban Technologies . CHI 18 extended abstracts (2018), 2018.",
      "doi": "10.1145/3170427.3186601"
    },
    {
      "text": "Derrick Bell. 1980. Brown v. Board of Education and the interest-convergence dilemma . Harvard Law Review (1980), 518--533.",
      "doi": ""
    },
    {
      "text": "Derrick Bell. 1992. The Space Traders . https://web.archive.org/web/20100404123611/http://edweb.tusd.k12.az.us/uhs/APUSH/1stSem/ArticlesSemester1/ArtilesSemester1/Bell.htm",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin (Ed.). 2019. Captivating Technology: Race, Carceral Technoscience, and Liberatory Imagination in Everyday Life. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new Jim code. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Nicolas Boccard. 1999. Racial Discrimination and Redlining in Cities Yves Zenou CERAS, Ecole Nationale des Ponts et Chaussees GAINS, Universite du Maine . Technical Report.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI Interprets the Probes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM. http://doi.acm.org/10.1145/1240624.1240789",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Eduardo Bonilla-Silva. 2006. Racism without racists: Color-blind racism and the persistence of racial inequality in the United States . Rowman & Littlefield Publishers.",
      "doi": ""
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press, New York, New York, USA, 1125. http://dx.doi.org/10.1145/2207676.2208560",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Geoffrey C Bowker and Susan Leigh Star. 2000. Sorting Things Out: Classification and Its Consequences . MIT Press, Cambridge, MA.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Robin Brewer, Ronald Metoyer, Marvin Andujar, Manuel Pé rez-Qui n ones, Sheena Erete, and Yolanda Rankin. 2018. CHIMe. (2018). https://chime2018.wordpress.com/",
      "doi": ""
    },
    {
      "text": "André Brock. 2012. From the blackhand side: Twitter as a cultural conversation. Journal of Broadcasting & Electronic Media 56, 4 (2012), 529--549.",
      "doi": ""
    },
    {
      "text": "André Brock. 2020. Distributed Blackness: African American Cybercultures. NYU Press.",
      "doi": ""
    },
    {
      "text": "Anke Brock, Daniela Busse, Dalila Szostak, and Gopinaath Kannabiran. 2016. The Diversity and Inclusion Lunch. (2016). https://sigchi.tumblr.com/post/138016200160/diversitylunch",
      "doi": ""
    },
    {
      "text": "Jennifer Bronson and E. Ann Carson. 2019. Prisoners in 2017 . BJS Bulletin (2019). https://www.bjs.gov/content/pub/pdf/p17.pdf",
      "doi": ""
    },
    {
      "text": "Simone Browne (Ed.). 2015. Dark Matters: On the Surveillance of Blackness. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. In Proceedings of the 1st Conference on Fairness, Accountability and Transparency (Proceedings of Machine Learning Research), Sorelle A Friedler and Christo Wilson (Eds.), Vol. 81. PMLR, New York, NY, USA, 77--91. http://proceedings.mlr.press/v81/buolamwini18a.html",
      "doi": ""
    },
    {
      "text": "Danielle Keats Citron. 2014. Hate crimes in cyberspace . Harvard University Press.",
      "doi": "10.5555/3051927"
    },
    {
      "text": "Matthew Clair and Jeffrey S. Denis. 2015. Sociology of Racism . In International Encyclopedia of the Social & Behavioral Sciences: Second Edition. Elsevier Inc., 857--863. http://dx.doi.org/10.1016/B978-0-08-097086--8.32122--5",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Peter Wright, and John McCarthy. 2012. Sharing narrative and experience: digital stories and portraits at a women's centre. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 1505--1510.",
      "doi": "10.1145/2212776.2223663"
    },
    {
      "text": "Chuck Collins, Dedrick Asante-Muhammad, Josh Hoxie, and Sabrina Terry. 2019. Dreams Deferred: How Enriching the 1% Widens the Racial Wealth Divide . (2019). https://ips-dc.org/wp-content/uploads/2019/01/IPS_RWD-Report_FINAL-1.15.19.pdf",
      "doi": ""
    },
    {
      "text": "Constitutional Rights Foundation. 2019. The Constitution and Slavery. (2019). https://www.crf-usa.org/black-history-month/the-constitution-and-slavery",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Yanni Loukissas. 2019. Engaging Gentrification as a Social Justice Issue in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM. http://doi.acm.org/10.1145/3290605.3300510",
      "doi": "10.1145/3290605.3300510"
    },
    {
      "text": "Kimberle Crenshaw. 1990. Mapping the margins: Intersectionality, identity politics, and violence against women of color . Stan. L. Rev. 43 (1990), 1241.",
      "doi": ""
    },
    {
      "text": "Dave Davies and Craig Silverman. 2016. Fake news expert on how false stories spread and why people believe them . (2016). https://www.npr.org/2016/12/14/505547295/fake-news-expert-on-how-false-stories-spread-and-why-people-believe-them",
      "doi": ""
    },
    {
      "text": "Kevin J. Delaney. 2017. Bill Gates says filter bubbles are a serious problem with news . Quartz (2 2017). https://qz.com/913114/bill-gates-says-filter-bubbles-are-a-serious-problem-with-news/",
      "doi": ""
    },
    {
      "text": "Richard Delgado. 1989. Storytelling for oppositionists and others: A plea for narrative . Michigan Law Review 87, 8 (1989), 2411--2441.",
      "doi": ""
    },
    {
      "text": "Richard Delgado and Jean Stefancic. 2017. Critical Race Theory: An Introduction. NYU Press, New York.",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. \"Yours is better!\": participant response bias in HCI. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press, New York, New York, USA, 1321. http://dx.doi.org/10.1145/2207676.2208589",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Department of Justice. 2019. Hate crimes case examples. (2019). https://www.justice.gov/hatecrimes/hate-crimes-case-examples",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt. 2014. Fostering social capital in economically distressed communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 531--540.",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Adrienne D. Dixson and Celia K. Rousseau. 2005. And we are still not saved: Critical race theory in education ten years later . Race Ethnicity and Education 8, 1 (3 2005), 7--27. http://dx.doi.org/10.1080/1361332052000340971",
      "doi": ""
    },
    {
      "text": "John F. Dovidio, Samuel E. Gaertner, Kerry Kawakami, and Gordon Hodson. 2002a. Why can't we just get along? Interpersonal biases and interracial distrust. Cultural Diversity and Ethnic Minority Psychology 8, 2 (2002), 88.",
      "doi": ""
    },
    {
      "text": "John F. Dovidio and Samuel L. Gaertner. 2004. Aversive racism . Advances in experimental social psychology 36 (2004), 4--56.",
      "doi": ""
    },
    {
      "text": "John F. Dovidio, Kerry Kawakami, and Samuel L. Gaertner. 2002b. Implicit and explicit prejudice and interracial interaction. Journal of personality and social psychology 82, 1 (2002), 62.",
      "doi": ""
    },
    {
      "text": "Allison Druin. 2018. The possibilities of inclusion for SIGCHI. (2018). https://sigchi.org/2018/10/the-possibilities-of-inclusion-for-sigchi/",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming . MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Frank Edwards, Hedwig Lee, and Michael Esposito. 2019. Risk of being killed by police use of force in the United States by age, racetextbackslashtextendash ethnicity, and sex . Proceedings of the National Academy of Sciences 116, 34 (2019), 16793--16798. http://dx.doi.org/10.1073/pnas.1821204116",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social Inequality and HCI: The View from Political Economy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM. http://doi.acm.org/10.1145/2858036.2858343",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Mostafa M. El-Bermawy. 2016. Your Echo Chamber is Destroying Democracy . Wired (11 2016). https://www.wired.com/2016/11/filter-bubble-destroying-democracy/",
      "doi": ""
    },
    {
      "text": "Sheena L. Erete. 2015. Engaging around neighborhood issues: How online communication affects offline behavior. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1590--1601.",
      "doi": "10.1145/2675133.2675182"
    },
    {
      "text": "Sheena L. Erete and Jennifer O. Burrell. 2017. Empowered participation: How citizens use technology in local governance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2307--2319.",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating Inequality: How High-Tech Tools Profile, Police, and Punish the Poor . St. Martin's Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "John E. Filer, Lawrence W. Kenny, and Rebecca B. Morton. 1991. Voting Laws, Educational Policies, and Minority Turnout . Technical Report 2. 371--393 pages.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social justice and design: Power and oppression in collaborative systems. In CSCW 2017 - Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, Inc, 117--122. http://dx.doi.org/10.1145/3022198.3022201",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Nancy Fraser. 1990. Rethinking the Public Sphere: A Contribution to the Critique of Actually Existing Democracy. Social Text 35, 25/26 (1990), 56--80. https://www.jstor.org/stable/466240",
      "doi": ""
    },
    {
      "text": "Batya Friedman and David G. Hendry. 2019. Value Sensitive Design: Shaping Technology with Moral Imagination . MIT Press.",
      "doi": ""
    },
    {
      "text": "Feliks Garcia. 2015. 8 times technology proved to be racist . Complex (11 2015). https://www.complex.com/life/2015/11/racist-technology/",
      "doi": ""
    },
    {
      "text": "Arthur H. Garrison. 2011. Disproportionate incarceration of African Americans: What history and the first decade of twenty-first century have brought . J. Institute of Justice & International Studies 11 (2011), 87--116. https://heinonline.org/HOL/Page?handle=hein.journals/jijis11&id=99",
      "doi": ""
    },
    {
      "text": "Dina Gerdeman. 2017. Minorities Who 'Whiten' Job Resumes Get More Interviews . Harvard Business Review Working Knowledge (5 2017). https://hbswk.hbs.edu/item/minorities-who-whiten-job-resumes-get-more-interviews",
      "doi": ""
    },
    {
      "text": "John Gramlich. 2019. The gap between the number of blacks and whites in prison is shrinking . (2019). https://www.pewresearch.org/fact-tank/2019/04/30/shrinking-gap-between-number-of-blacks-and-whites-in-prison/",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E. Grinter. 2008. EatWell . (2008), 87. http://dx.doi.org/10.1145/1460563.1460579",
      "doi": ""
    },
    {
      "text": "Andrea Grimes and Rebecca E. Grinter. 2007. Designing persuasion: health technology for low-income African American communities, Cees Midden Berry Eggen Yvonne De Kort, Wijnand Ijsselsteijn and B. J. Fogg (Eds.). Springer-Verlag, 24--35.",
      "doi": ""
    },
    {
      "text": "Ben Guarino. 2016. Google faulted for racial bias in image search results for black teenagers . Washington Post (6 2016). https://www.washingtonpost.com/news/morning-mix/wp/2016/06/10/google-faulted-for-racial-bias-in-image-search-results-for-black-teenagers/",
      "doi": ""
    },
    {
      "text": "Jessica Guynn. 2019. Facebook while black: Users call it getting `Zucked,' say talking about racism is censored as hate speech . USA Today (2019). https://www.usatoday.com/story/news/2019/04/24/facebook-while-black-zucked-users-say-they-get-blocked-racism-discussion/2859593002/",
      "doi": ""
    },
    {
      "text": "Josh Hafner. 2018. Police killings of black men in the U.S. and what happened to the officers . USA Today (2018). https://www.usatoday.com/story/news/nation-now/2018/03/29/police-killings-black-men-us-and-what-happened-officers/469467002/",
      "doi": ""
    },
    {
      "text": "David Hankerson, Andrea R. Marshall, Jennifer Booker, Houda El Mimouni, Imani Walker, and Jennifer A. Rode. 2016. Does technology have race?. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 473--486.",
      "doi": ""
    },
    {
      "text": "Christina N. Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions through Community-based Design Workshops . (2019), 1--15. http://dx.doi.org/10.1145/3290605.3300823",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J. Heine, and Ara Norenzayan. 2010. The weirdest people in the world? Behavioral and Brain Sciences 33, 2--3 (2010), 61--83. https://doi.org/10.1017/S0140525X0999152X",
      "doi": ""
    },
    {
      "text": "Donovan Hill, Jasmine Blunt, Terrence Pugh, Monika Monk, Ji-Sun Kim, Woodrow W Winchester, D. Scott McCrickard, Paul Estabrooks, and Felicia Doswell. 2011. Mobile technologies for promoting health and wellness among African American youth. In International Conference on Universal Access in Human-Computer Interaction. Springer, 36--45.",
      "doi": ""
    },
    {
      "text": "Kartik Hosanagar. A human's guide to machine intelligence : how algorithms are shaping our lives and how we can stay in control . 262 pages.",
      "doi": ""
    },
    {
      "text": "Woodrow W. Winchester III. 2018. Afrofuturism, inclusion, and the design imagination. Interactions 25, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Murray Jacobson. 2014. Google finally discloses its diversity record, and it's not good . PBS News Hour (2014). https://www.pbs.org/newshour/nation/google-discloses-workforce-diversity-data-good",
      "doi": ""
    },
    {
      "text": "Sonia K. Kang, Katherine A. DeCelles, Andras Tilcsik, and Sora Jun. 2016. Whitened Resumes: Race and Self-Presentation in the Labor Market . Administrative Science Quarterly 61, 3 (2016), 469--502. http://dx.doi.org/10.1177/0001839216639577",
      "doi": ""
    },
    {
      "text": "Os Keyes, Josephine Hoy, and Margaret Drouhard. 2019. Human-Computer Insurrection . Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19 (2019), 1--13. http://dx.doi.org/10.1145/3290605.3300569",
      "doi": "10.1145/3290605.3300569"
    },
    {
      "text": "Joe L. Kincheloe and Peter McLaren. 2011. Rethinking Critical Theory and Qualitative Research . Key Works in Critical Pedagogy 32 (2011), 285--326. http://dx.doi.org/10.1007/9789460913976_024",
      "doi": ""
    },
    {
      "text": "Ryan Scott King. 2006. Jim crow is alive and well in the 21st century: Felony disenfranchisement and the continuing struggle to silence the african-american voice . Souls 8, 2 (2006), 7--21. http://dx.doi.org/10.1080/10999940600680507",
      "doi": ""
    },
    {
      "text": "Rakesh Kochhar and Anthony Cilluffo. 2018. Income Inequality in the U.S. Is Rising Most Rapidly Among Asians . (7 2018). https://www.pewsocialtrends.org/wp-content/uploads/sites/3/2018/07/Pew_Research_Center_Inequality-Report_FINAL.pdf",
      "doi": ""
    },
    {
      "text": "David Kravets. 2017. Driver's license facial recognition tech leads to 4,000 New York arrests . Ars Technica (8 2017). https://arstechnica.com/tech-policy/2017/08/biometrics-leads-to-thousands-of-a-ny-arrests-for-fraud-identity-theft/",
      "doi": ""
    },
    {
      "text": "Leadership Lab. 2014. LEADERSHIP LAB: The Craft of Writing Effectively - YouTube. (2014). https://www.youtube.com/watch?v=vtIzMaLkCaM&list=WL&index=6&t=1755s",
      "doi": ""
    },
    {
      "text": "Cyndy Lane. 2018. Facial Recognition Is Now A Part Of The Driver's License Renewal Process. Here's What That Means . CapeCodToday.com (5 2018). http://www.capecodtoday.com/article/2018/05/03/239221-Facial-Recognition-Now-Part-Driver's-License-Renewal-Process-Heres-What",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15. ACM Press, New York, New York, USA, 1348--1358. http://dx.doi.org/10.1145/2675133.2675147",
      "doi": ""
    },
    {
      "text": "Steve Lohr, Mike Isaac, and Nathaniel Popper. 2019. Tech hearings: Congress unites to take aim at Amazon, Apple, Facebook and Google . New York Times (7 2019). https://www.nytimes.com/2019/07/16/technology/big-tech-antitrust-hearing.html",
      "doi": ""
    },
    {
      "text": "Sarah Lopez, Yi Yang, Kevin Beltran, Soo Jung Kim, Jennifer Cruz Hernandez, Chelsy Simran, Bingkun Yang, and Beste F. Yuksel. 2019. Investigating Implicit Gender Bias and Embodiment of White Males in Virtual Reality with Full Body Visuomotor Synchrony . (2019), 1--12. http://dx.doi.org/10.1145/3290605.3300787",
      "doi": ""
    },
    {
      "text": "Samantha Maldonado and The Associated Press. 2019. At Amazon, Google, and more, Big Tech employees are speaking out about bad company behavior . Fortune (2019). https://fortune.com/2019/08/26/at-amazon-google-and-more-big-tech-employees-are-speaking-out-about-bad-company-behavior/",
      "doi": ""
    },
    {
      "text": "Amade M'Charek. 2013. Beyond fact or fiction: On the materiality of race in practice . Cultural Anthropology 28, 3 (2013), 420--442. http://dx.doi.org/10.1111/cuan.12012",
      "doi": ""
    },
    {
      "text": "Charlton D. McIlwain. 2019. Black Software: The Internet & Racial Justice, from the AfroNet to Black Lives Matter. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Katherine McKittrick. 2016. Demonic Grounds: Black Women And The Cartographies Of Struggle . University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Fred Moten. 2017. Black and Blur . Duke University Press.",
      "doi": ""
    },
    {
      "text": "Gillian Mulvale, Sandra Moll, Ashleigh Miatello, Glenn Robert, Michael Larkin, Victoria J. Palmer, Alicia Powell, Chelsea Gable, and Melissa Girling. 2019. Codesigning health and other public services with vulnerable and disadvantaged populations: Insights from an international collaboration. (6 2019). http://dx.doi.org/10.1111/hex.12864",
      "doi": ""
    },
    {
      "text": "Alondra Nelson, Thuy Linh N. Tu, and Alicia Headlam Hines (Eds.). 2001. Technicolor: Race, Technology, and Everyday Life. New York University Press.",
      "doi": ""
    },
    {
      "text": "Jack L. Nelson and Valerie Ooka Pang. 2006. Racism, prejudice, and the social studies curriculum . The social studies curriculum: Purposes, problems, and possibilities 3 (2006), 115--135.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2019. Algorithms of Oppression . NYU Press. http://dx.doi.org/10.2307/j.ctt1pwt9w5",
      "doi": ""
    },
    {
      "text": "Sara Ashley O'Brien. 2018. Google has a hard time keeping its black employees . CNN (6 2018). https://money.cnn.com/2018/06/15/technology/google-diversity-report/",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Kentaro Toyama, and Tawanna R. Dillahunt. 2019. Towards an effective digital literacy intervention to assist returning citizens with job search . Conference on Human Factors in Computing Systems - Proceedings (2019), 1--12. http://dx.doi.org/10.1145/3290605.3300315",
      "doi": ""
    },
    {
      "text": "Jasper Tran O'Leary, Sara Zewde, Jennifer Mankoff, and Daniela K. Rosner. 2019. Who Gets to Future? Race, Representation, and Design Methods in Africatown. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM. https://doi.org/10.1145/3290605.3300791",
      "doi": ""
    },
    {
      "text": "Kara O'Neill. 2015. `Racist' tap will only give out soap to people with white skin thanks to 'discriminative' sensor . Mirror Online (9 2015). https://www.mirror.co.uk/news/weird-news/racist-tap-only-give-out-6375873",
      "doi": ""
    },
    {
      "text": "Tyler Pace. 2008. Can an Orc Catch a Cab in a Stormwind? Cybertype Preference in the World of Warcraft Character Creation Interface . Conference on Human Factors in Computing Systems Extended Abstracts 2011 (2008), 2493--2502.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2017. CHI4Good or Good4CHI. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM. http://doi.acm.org/10.1145/3027063.3052766",
      "doi": "10.1145/3027063.3052766"
    },
    {
      "text": "Cale J. Passmore, Max V. Birk, and Regan L. Mandryk. 2018. The Privilege of Immersion . (2018), 1--19. http://dx.doi.org/10.1145/3173574.3173957",
      "doi": ""
    },
    {
      "text": "Joan Petersilia. 2001. Prisoner Reentry: Public Safety and Reintegration Challenges . The Prison Journal 81, 3 (2001), 360--375. http://dx.doi.org/10.1177/0032885501081003004",
      "doi": ""
    },
    {
      "text": "Whitney Phillips. 2015. This Is Why We Can't Have Nice Things: Mapping the Relationship Between Online Trolling and Mainstream Culture . MIT Press.",
      "doi": ""
    },
    {
      "text": "Leslie H. Picca and Joe R. Feagin. 2007. Two-faced racism: Whites in the backstage and frontstage . (2007).",
      "doi": ""
    },
    {
      "text": "Sarah Pierce and Andrew Selee. 2017. Immigration under Trump: A Review of Policy Shifts in the Year Since the Election . Migration Policy Institute (2017).",
      "doi": ""
    },
    {
      "text": "Thomas Piketty. 2015. About capital in the twenty-first century. American Economic Review 205, 5 (2015), 48--53. 10.1257/aer.p20151060",
      "doi": ""
    },
    {
      "text": "Inioluwa Deborah Raji and Joy Buolamwini. Actionable Auditing: Investigating the Impact of Publicly Naming Biased Performance Results of Commercial AI Products . Technical Report. www.aaai.org",
      "doi": ""
    },
    {
      "text": "Yolanda A. Rankin and Jakita O. Thomas. 2019. Straighten up and fly right: rethinking intersectionality in HCI research. Interactions 26, 6 (2019), 64--68.",
      "doi": "10.1145/3363033"
    },
    {
      "text": "Cedric J. Robinson. 1983. Black Marxism: The Making of the Black Radical Tradition . University of North Carolina Press.",
      "doi": ""
    },
    {
      "text": "Adam Rose. 2010. Are face-detection cameras racist? Time (2010). http://content.time.com/time/business/article/0,8599,1954643,00.html",
      "doi": ""
    },
    {
      "text": "Lorna Roth. 2013. The fade-out of shirley, a once-ultimate norm: Colour balance, image technologies, and cognitive equity . In The Melanin Millennium: Skin Color as 21st Century International Discourse. Springer Netherlands, 273--286. http://dx.doi.org/10.1007/978--94-007--4608--4_18",
      "doi": ""
    },
    {
      "text": "Wendy D. Roth. 2016. The multiple dimensions of race . Ethnic and Racial Studies 39, 8 (2016), 1310--1338.",
      "doi": ""
    },
    {
      "text": "Camille L Ryan and Kurt Bauman. 2016. Educational Attainment in the United States: 2015 . Current Population Reports (3 2016). https://www.census.gov/content/dam/Census/library/publications/2016/demo/p20--578.pdf",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging identity through gender, race, and class. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2017-May. ACM Press, New York, New York, USA, 5412--5427. http://dx.doi.org/10.1145/3025453.3025766",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Kenton P. O'Hara, and Alex S. Taylor. 2018. Let's Talk About Race . (2018), 1--14. http://dx.doi.org/10.1145/3173574.3173889",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "SIGCHI. 2019. SIGCHI Conference History. (2019). https://sigchi.org/conferences/conference-history/CHI/",
      "doi": ""
    },
    {
      "text": "Daniel G. Soló rzano and Tara J. Yosso. 2002. Critical Race Methodology: Counter-Storytelling as an Analytical Framework for Education Research . Qualitative Inquiry 8, 1 (2 2002), 23--44. http://dx.doi.org/10.1177/107780040200800103",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Alex Ahmed, Jennifer A. Rode, Jed R. Brubaker, Gopinaath Kannabiran, Os Keyes, Ashley Marie Walker, Michael A. DeVito, Jeremy Birnholtz, Emeline Brulé , Ann Light, Pinar Barlas, and Jean Hardy. 2019. Queer(ing) HCI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA '19. ACM Press, New York, New York, USA, 1--4. http://dx.doi.org/10.1145/3290607.3311750",
      "doi": "10.1145/3290607.3311750"
    },
    {
      "text": "Edward Steinfeld and Jordana Maisel. 2012. Universal Design: Creating Inclusive Environments . Wiley Publishing.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Nazanin Andalibi, Lindsay Blackwell, David Nemer, and Wendy Moncur. 2019. Sensitive Research, Practice and Design in HCI . Conference on Human Factors in Computing Systems Extended Abstracts 2011 (2019).",
      "doi": "10.1145/3290607.3299003"
    },
    {
      "text": "Elizabeth Stowell, Mercedes C. Lyson, Herman Saksono, Reneé C. Wurth, Holly Jimison, Misha Pavel, and Andrea G. Parker. 2018. Designing and evaluating mHealth interventions for vulnerable populations: A systematic review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 15.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue. 2010. Microaggressions in everyday life: Race, gender, and sexual orientation . John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Latanya Sweeney. 2013. Discrimination in online Ad delivery . Commun. ACM 56, 5 (5 2013), 44--54. http://dx.doi.org/10.1145/2447976.2447990",
      "doi": ""
    },
    {
      "text": "Cristina Sylla, Pedro Branco, Clara Coutinho, and Maria Eduarda Coquet. 2009. Storytelling through drawings: evaluating tangible interfaces for children. In CHI'09 Extended Abstracts on Human Factors in Computing Systems. ACM, 3461--3466.",
      "doi": "10.1145/1520340.1520503"
    },
    {
      "text": "Theresa Jean Tanenbaum. 2014. Design fictional interactions: why HCI should care about stories. Interactions 21, 5 (2014). https://doi.org/10.1145/2648414",
      "doi": "10.1145/2648414"
    },
    {
      "text": "R. Roosevelt Thomas Jr. 1990. From affirmative action to affirming diversity. Harvard Business Review (Mar/Apr. 1990), 107--117.",
      "doi": ""
    },
    {
      "text": "New York Times. 2019a. The 1619 Project . (2019). https://www.nytimes.com/interactive/2019/08/14/magazine/1619-america-slavery.html",
      "doi": ""
    },
    {
      "text": "New York Times. 2019b. The Privacy Project . New York Times (2019). https://www.nytimes.com/series/new-york-times-privacy-project",
      "doi": ""
    },
    {
      "text": "Alexandra To, Joselyn McDonald, Jarrek Holmes, Geoff Kaufman, and Jessica Hammer. 2018. Character Diversity in Digital and Non-Digital Games. Transactions of the Digital Games Research Association 4, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek Heresy: Rescuing Social Change from the Cult of Technology. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Ryan Tracy and John D. McKinnon. 2019. Facebook penalty sends message to Big Tech . Wall Street Journal (7 2019). https://www.wsj.com/articles/facebook-agrees-to-pay-5-billion-in-ftc-settlement-11563971400",
      "doi": ""
    },
    {
      "text": "Jeremy C. Travis. 2005. But they all come back: facing the challenges of prisoner reentry . Urban Institute Press (2005), 391. http://dx.doi.org/10.1007/s11524-006--9046--5",
      "doi": ""
    },
    {
      "text": "Lornet Turnbull. 2019. Exposing the racist Facebook posts of city cops . (7 2019). https://www.citylab.com/equity/2019/07/police-social-media-facebook-racism-islamophobia-bias/593131/",
      "doi": ""
    },
    {
      "text": "Kim M. Unertl, Chris L. Schaefbauer, Terrance R. Campbell, Charles Senteio, Katie A. Siek, Suzanne Bakken, and Tiffany C. Veinot. 2016. Integrating community-based participatory research and informatics approaches to improve the engagement and health of underserved populations . Journal of the American Medical Informatics Association 23, 1 (2016), 60--73. http://dx.doi.org/10.1093/jamia/ocv094",
      "doi": ""
    },
    {
      "text": "Vicky Valet. 2018. After a year of secrecy, Laszlo Bock and Wayne Crosby break their silence on Humu . Forbes (5 2018). https://www.forbes.com/sites/vickyvalet/2018/05/01/after-a-year-of-secrecy-laszlo-bock-and-wayne-crosby-break-their-silence-on-humu/",
      "doi": ""
    },
    {
      "text": "Dustin Volz. 2018. U.S. girds for possible Russian meddling on election day . (2018). https://www.wsj.com/articles/u-s-girds-for-possible-russian-meddling-on-election-day-1541421000",
      "doi": ""
    },
    {
      "text": "Elizabeth Weise. 2014. Google discloses its (lack of) diversity . USA Today (2014). https://www.usatoday.com/story/tech/2014/05/28/google-releases-employee-diversity-figures/9697049/",
      "doi": ""
    },
    {
      "text": "David T. Wellman. 1993. Portraits of White Racism, Second Edition . Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Benjamin Wilson, Judy Hoffman, and Jamie Morgenstern. 2019. Predictive Inequity in Object Detection . (2 2019). http://arxiv.org/abs/1902.11097",
      "doi": ""
    },
    {
      "text": "Valerie Wilson and Zane Mokhiber. 2017. 2016 ACS shows stubbornly high Native American poverty and different degrees of economic well-being for Asian ethnic groups . (2017). https://www.epi.org/blog/2016-acs-shows-stubbornly-high-native-american-poverty-and-different-degrees-of-economic-well-being-for-asian-ethnic-groups/",
      "doi": ""
    },
    {
      "text": "Langdon Winner. 1999. Do artifacts have politics? In The Social Shaping of Technology (2nd ed.), Donld MacKenzie and Judy Wajcman (Eds.). Open University Press, UK, 28--40.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sarah E. Fox, Steven Rousso-Schindler, and Jeffrey Warshaw. 2018. A Qualitative Exploration of Perceptions of Algorithmic Fairness . (2018), 1--14. http://dx.doi.org/10.1145/3173574.3174230",
      "doi": ""
    },
    {
      "text": "Tim Wu. 2017. The attention merchants: The epic scramble to get inside our heads. Vintage.",
      "doi": ""
    },
    {
      "text": "S.P. Wyche, P.M. Aoki, and R.E. Grinter. 2008. Re-placing faith: Reconsidering the secular-religious use divide in the United States and Kenya . Conference on Human Factors in Computing Systems - Proceedings (2008), 11--20. http://dx.doi.org/10.1145/1357054.1357057",
      "doi": ""
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2012. Income, race, and class . (2012), 3041. http://dx.doi.org/10.1145/2207676.2208716",
      "doi": ""
    }
  ]
}