{
  "doi": "10.1145/3313831.3376544",
  "title": "GAZED– Gaze-guided Cinematic Editing of Wide-Angle Monocular Video Recordings",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "We present GAZED– eye GAZe-guided EDiting for videos captured by a solitary, static, wide-angle and high-resolution camera. Eye-gaze has been effectively employed in computational applications as a cue to capture interesting scene content; we employ gaze as a proxy to select shots for inclusion in the edited video. Given the original video, scene content and user eye-gaze tracks are combined to generate an edited video comprising cinematically valid actor shots and shot transitions to generate an aesthetic and vivid representation of the original narrative. We model cinematic video editing as an energy minimization problem over shot selection, whose constraints capture cinematographic editing conventions. Gazed scene locations primarily determine the shots constituting the edited video. Effectiveness of GAZED against multiple competing methods is demonstrated via a psychophysical study involving 12 users and twelve performance videos.",
  "tags": [
    "gaze potential",
    "static wide-angle recording",
    "dynamic programming",
    "eye gaze",
    "shot selection",
    "stage performance",
    "cinematic video editing"
  ],
  "authors": [
    {
      "name": "K. L. Bhanu Moorthy",
      "institution": "International Institute of Information Technology, Hyderabad, Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526422",
      "orcid": "missing"
    },
    {
      "name": "Moneish Kumar",
      "institution": "Samsung R&D Institute Bangalore, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659191611",
      "orcid": "missing"
    },
    {
      "name": "Ramanathan Subramanian",
      "institution": "Indian Institute of Technology Ropar, Ropar, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472650034",
      "orcid": "missing"
    },
    {
      "name": "Vineet Gandhi",
      "institution": "International Institute of Information Technology, Hyderabad, Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82658868957",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ido Arev, Hyun Soo Park, Yaser Sheikh, Jessica Hodgins, and Ariel Shamir. 2014. Automatic editing of footage from multiple social cameras. ACM Transactions on Graphics (TOG) 33, 4 (2014), 81.",
      "doi": "10.1145/2601097.2601198"
    },
    {
      "text": "Daniel Arijon. 1976. Grammar of the film language. (1976).",
      "doi": ""
    },
    {
      "text": "Michael Bianchi. 2004. Automatic video production of lectures using an intelligent and aware environment. In Proceedings of the 3rd international conference on Mobile and ubiquitous multimedia. ACM, 117--123.",
      "doi": "10.1145/1052380.1052397"
    },
    {
      "text": "Zhe Cao, Gines Hidalgo, Tomas Simon, Shih-En Wei, and Yaser Sheikh. 2018. OpenPose: realtime multi-person 2D pose estimation using Part Affinity Fields. In arXiv preprint arXiv:1812.08008.",
      "doi": ""
    },
    {
      "text": "Christine Chen, Oliver Wang, Simon Heinzle, Peter Carr, Aljoscha Smolic, and Markus H. Gross. 2013. Computational sports broadcasting: Automated director assistance for live sports. In Proceedings of the 2013 IEEE International Conference on Multimedia and Expo, ICME 2013, San Jose, CA, USA, July 15--19, 2013.",
      "doi": ""
    },
    {
      "text": "Fan Chen and Christophe De Vleeschouwer. 2010. Personalized production of basketball videos from multi-sensored data under limited display resolution. Computer Vision and Image Understanding 114, 6 (2010), 667--680.",
      "doi": "10.1016/j.cviu.2010.01.005"
    },
    {
      "text": "Jianhui Chen, Lili Meng, and James J Little. 2018. Camera Selection for Broadcasting Soccer Games. In 2018 IEEE Winter Conference on Applications of Computer Vision (WACV). IEEE, 427--435.",
      "doi": ""
    },
    {
      "text": "David B Christianson, Sean E Anderson, Li-wei He, David H Salesin, Daniel S Weld, and Michael F Cohen. 1996. Declarative camera control for automatic cinematography. In AAAI/IAAI, Vol. 1. 148--155.",
      "doi": "10.5555/1892875.1892897"
    },
    {
      "text": "James E Cutting and Ayse Candan. 2015. Shot durations, shot classes, and the increased pace of popular movies. (2015).",
      "doi": ""
    },
    {
      "text": "Shinji Daigo and Shinji Ozawa. 2004. Automatic pan control system for broadcasting ball games based on audience's face direction. In Proceedings of the 12th annual ACM international conference on Multimedia. ACM, 444--447.",
      "doi": "10.1145/1027527.1027634"
    },
    {
      "text": "Petr Doubek, Indra Geys, Tomá? Svoboda, and Luc Van Gool. 2004. Cinematographic rules applied to a camera network. In Omnivis2004: The fifth Workshop on Omnidirectional Vision, Camera Networks and Non-Classical Cameras. Prague, Czech Republic: Czech Technical University, 17--29.",
      "doi": ""
    },
    {
      "text": "David K Elson and Mark Riedl. 2007. A lightweight intelligent virtual cinematography system for machinima production. (2007).",
      "doi": ""
    },
    {
      "text": "Quentin Galvane, Rémi Ronfard, Christophe Lino, and Marc Christie. 2015. Continuity editing for 3D animation. In Twenty-Ninth AAAI Conference on Artificial Intelligence.",
      "doi": "10.5555/2887007.2887112"
    },
    {
      "text": "Vineet Gandhi, Remi Ronfard, and Michael Gleicher. 2014a. Multi-clip video editing from a single viewpoint. In Proceedings of the 11th European Conference on Visual Media Production. ACM, 9.",
      "doi": "10.1145/2668904.2668936"
    },
    {
      "text": "Vineet Gandhi, Remi Ronfard, and Michael Gleicher. 2014b. Multi-clip video editing from a single viewpoint. Proceedings of the 11th European Conference on Visual Media Production - CVMP 14 (2014). DOI: http://dx.doi.org/10.1145/2668904.2668936",
      "doi": "10.1145/2668904.2668936"
    },
    {
      "text": "Li-wei He, Michael F Cohen, and David H Salesin. 1996. The virtual cinematographer: a paradigm for automatic real-time camera control and directing. In Proceedings of the 23rd annual conference on Computer graphics and interactive techniques. ACM, 217--224.",
      "doi": ""
    },
    {
      "text": "Rachel Heck, Michael Wallick, and Michael Gleicher. 2007. Virtual videography. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 3, 1 (2007), 4.",
      "doi": "10.1145/1198302.1198306"
    },
    {
      "text": "Eakta Jain, Yaser Sheikh, Ariel Shamir, and Jessica Hodgins. 2015. Gaze-driven video re-editing. ACM Transactions on Graphics (TOG) 34, 2 (2015), 21.",
      "doi": "10.1145/2699644"
    },
    {
      "text": "M. Kleiner, D. Brainard, and D. Pelli. 2007. In Perception ECVP Abstract Supplement, Vol. 36.",
      "doi": ""
    },
    {
      "text": "Mackenzie Leake, Abe Davis, Anh Truong, and Maneesh Agrawala. 2017. Computational video editing for dialogue-driven scenes. ACM Trans. Graph. 36, 4 (2017), 130--1.",
      "doi": "10.1145/3072959.3073653"
    },
    {
      "text": "Christophe Lino, Mathieu Chollet, Marc Christie, and Rémi Ronfard. 2011. Computational model of film editing for interactive storytelling. In International Conference on Interactive Digital Storytelling. Springer, 305--308.",
      "doi": "10.1007/978-3-642-25289-1_35"
    },
    {
      "text": "Billal Merabti, Marc Christie, and Kadi Bouatouch. 2016. A Virtual Director Using Hidden Markov Models. In Computer Graphics Forum, Vol. 35. Wiley Online Library, 51--67.",
      "doi": ""
    },
    {
      "text": "Walter Murch. 2001. In the blink of an eye: A perspective on film editing. Silman-James Press.",
      "doi": ""
    },
    {
      "text": "Hyun S Park, Eakta Jain, and Yaser Sheikh. 2012. 3d social saliency from head-mounted cameras. In Advances in Neural Information Processing Systems. 422--430.",
      "doi": ""
    },
    {
      "text": "Kranthi Kumar Rachavarapu, Moneish Kumar, Vineet Gandhi, and Ramanathan Subramanian. 2018. Watch to Edit: Video Retargeting using Gaze. In Computer Graphics Forum, Vol. 37. Wiley Online Library, 205--215.",
      "doi": ""
    },
    {
      "text": "Subramanian Ramanathan, Harish Katti, Raymond Huang, Tat-Seng Chua, and Mohan Kankanhalli. 2009. Automated Localization of Affective Objects and Actions in Images via Caption Text-Cum-Eye Gaze Analysis. In ACM International Conference on Multimedia. 729--732.",
      "doi": "10.1145/1631272.1631399"
    },
    {
      "text": "Abhishek Ranjan, Jeremy Birnholtz, and Ravin Balakrishnan. 2008. Improving meeting capture by applying television production principles with audio and motion detection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 227--236.",
      "doi": ""
    },
    {
      "text": "Ramanathan Subramanian, Divya Shankar, Nicu Sebe, and David Melcher. 2014. Emotion modulates eye movement patterns and subsequent memory for the gist and details of movie scenes. Journal of vision 14, 3 (2014), 1--18.",
      "doi": ""
    },
    {
      "text": "Yoshinao Takemae, Kazuhiro Otsuka, and Naoki Mukawa. 2004. Impact of video editing based on participants' gaze in multiparty conversation. In CHI'04 extended abstracts on Human Factors in Computing Systems. ACM, 1333--1336.",
      "doi": "10.1145/985921.986057"
    },
    {
      "text": "Jinjun Wang, Changsheng Xu, Engsiong Chng, Hanqing Lu, and Qi Tian. 2008. Automatic composition of broadcast sports video. Multimedia Systems 14, 4 (2008), 179--193.",
      "doi": "10.1007/s00530-008-0112-6"
    },
    {
      "text": "Cha Zhang, Yong Rui, Jim Crawford, and Li-Wei He. 2008. An automated end-to-end lecture capture and broadcasting system. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 4, 1 (2008), 6.",
      "doi": ""
    }
  ]
}