{
  "doi": "10.1145/3313831.3376368",
  "title": "PV-Tiles: Towards Closely-Coupled Photovoltaic and Digital Materials for Useful, Beautiful and Sustainable Interactive Surfaces",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "The interactive, digital future with its seductive vision of Internet-of-Things connected sensors, actuators and displays comes at a high cost in terms of both energy demands and the clutter it brings to the physical world. But what if such devices were made of materials that enabled them to self-power their interactive features? And, what if those materials were directly used to build aesthetically pleasing environments and objects that met practical physical needs as well as digital ones? In this paper we introduce PV-Tiles ? a novel material that closely couples photovoltaic energy harvesting and light sensing materials with digital interface components. We consider potential contexts, use-cases and light gestures surfaced through co-creation workshops; and, present initial technological designs and prototypes. The work opens a new set of opportunities and collaborations between HCI and material science, stimulating technical and design pointers to accommodate and exploit the material's properties.",
  "tags": [
    "connected home",
    "self-powered devices",
    "internet of things",
    "interaction design",
    "sustainability"
  ],
  "authors": [
    {
      "name": "Yogesh Kumar Meena",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659333550",
      "orcid": "missing"
    },
    {
      "name": "Krishna Seunarine",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702406",
      "orcid": "missing"
    },
    {
      "name": "Deepak Ranjan Sahoo",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-99658704388/rel-imgonly/dsc_0054_413.jpeg",
      "acmid": "99658704388",
      "orcid": "missing"
    },
    {
      "name": "Simon Robinson",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81371592031/rel-imgonly/profile-small-rect.jpg",
      "acmid": "81371592031",
      "orcid": "0000-0001-9228-006X"
    },
    {
      "name": "Jennifer Pearson",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "Chi Zhang",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526893",
      "orcid": "missing"
    },
    {
      "name": "Matt Carnie",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527636",
      "orcid": "missing"
    },
    {
      "name": "Adam Pockett",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526441",
      "orcid": "missing"
    },
    {
      "name": "Andrew Prescott",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659322114",
      "orcid": "missing"
    },
    {
      "name": "Suzanne K. Thomas",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528519",
      "orcid": "missing"
    },
    {
      "name": "Harrison Ka Hin Lee",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528282",
      "orcid": "missing"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2015. Supporting Subtlety with Deceptive Devices and Illusory Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1489--1498. DOI: https://doi.org/10.1145/2702123.2702336",
      "doi": "10.1145/2702123.2702336"
    },
    {
      "text": "Colin D. Bailie, M. Greyson Christoforo, Jonathan P. Mailoa, Andrea R. Bowring, Eva L. Unger, William H. Nguyen, Julian Burschka, Norman Pellet, Jungwoo Z. Lee, Michael Grätzel, Rommel Noufi, Tonio Buonassisi, Alberto Salleo, and Michael D. McGehee. 2015. Semi-transparent perovskite solar cells for tandems with silicon and CIGS. Energy Environ. Sci. 8 (2015), 956--963. Issue 3. DOI: https://doi.org/10.1039/C4EE03322A",
      "doi": ""
    },
    {
      "text": "Yi-Hong Chen, Chang-Wen Chen, Zheng-Yu Huang, Wei-Chieh Lin, Li-Yen Lin, Francis Lin, Ken-Tsung Wong, and Hao-Wu Lin. 2014. Microcavity-Embedded, Colour-Tuneable, Transparent Organic Solar Cells. Advanced Materials 26, 7 (2014), 1129--1134. DOI: https://doi.org/10.1002/adma.201304658",
      "doi": ""
    },
    {
      "text": "Eria Chita, Yuta Sugiura, Sunao Hashimoto, Kai Kunze, Masahiko Inami, and Masa Ogata. 2015. Silhouette Interactions: Using the Hand Shadow As Interaction Modality. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, NY, NY, USA, 69--72. DOI: https://doi.org/10.1145/2800835.2800870",
      "doi": ""
    },
    {
      "text": "Lisa G. Cowan and Kevin A. Li. 2011. ShadowPuppets: Supporting Collocated Interaction with Mobile Projector Phones Using Hand Shadows. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2707--2716. DOI: https://doi.org/10.1145/1978942.1979340",
      "doi": ""
    },
    {
      "text": "M. A. Cowell, B. P. Lechene, P. Raffone, J. W. Evans, A. C. Arias, and P. K. Wright. 2016. Wireless sensor node demonstrating indoor-light energy harvesting and voltage-triggered duty cycling. Journal of Physics: Conference Series 773 (nov 2016), 012033. DOI: https://doi.org/10.1088/1742--6596/773/1/012033",
      "doi": ""
    },
    {
      "text": "Christine Dierk, Molly Jane Pearce Nicholas, and Eric Paulos. 2018. AlterWear: Battery-Free Wearable Displays for Opportunistic Interactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 220, 11 pages. DOI: https://doi.org/10.1145/3173574.3173794",
      "doi": "10.1145/3173574.3173794"
    },
    {
      "text": "Alix Goguey, Cameron Steer, Andrés Lucero, Laurence Nigay, Deepak Ranjan Sahoo, Céline Coutrix, Anne Roudaut, Sriram Subramanian, Yutaka Tokuda, Timothy Neate, Jennifer Pearson, Simon Robinson, and Matt Jones. 2019. PickCells: A Physically Reconfigurable Cell-composed Touchscreen. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 273, 14 pages. DOI: https://doi.org/10.1145/3290605.3300503",
      "doi": "10.1145/3290605.3300503"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Steve Hodges, Nicholas Chen, John Helmes, Stuart Taylor, James Scott, Josh Fromm, and David Sweeney. 2016. Exploring the Design Space for Energy-Harvesting Situated Displays. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 41--48. DOI: https://doi.org/10.1145/2984511.2984513",
      "doi": "10.1145/2984511.2984513"
    },
    {
      "text": "Mahina-Diana Kaholokula. 2016. Reusing Ambient Light to Recognize Hand Gestures (Technical Report TR2016--797). Dartmouth College Computer Science, 1--17.",
      "doi": ""
    },
    {
      "text": "Harrison K.H. Lee, Zhe Li, James R. Durrant, and Wing C. Tsoi. 2016. Is organic photovoltaics promising for indoor applications? Applied Physics Letters 108, 253301 (2016). DOI: https://doi.org/10.1063/1.4954268",
      "doi": ""
    },
    {
      "text": "Harrison Ka Hin Lee, Jérémy Barbé, Simone M P Meroni, Tian Du, Chieh-Ting Lin, Adam Pockett, Joel Troughton, Sagar M Jain, Francesca De Rossi, Jennifer Baker, Matthew J Carnie, Martyn A McLachlan, Trystan M Watson, James R Durrant, and Wing C Tsoi. 2019. Outstanding Indoor Performance of Perovskite Photovoltaic Cells -- Effect of Device Architectures and Interlayers. Solar RRL 3, 1 (2019), 1800207. DOI: https://doi.org/10.1002/solr.201800207",
      "doi": ""
    },
    {
      "text": "Yichen Li, Tianxing Li, Ruchir A. Patel, Xing-Dong Yang, and Xia Zhou. 2018. Self-Powered Gesture Recognition with Ambient Light. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 595--608. DOI: https://doi.org/10.1145/3242587.3242635",
      "doi": "10.1145/3242587.3242635"
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M. Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: Ubiquitous Gesture Sensing with Millimeter Wave Radar. ACM Trans. Graph. 35, 4, Article 142 (July 2016), 19 pages. DOI: https://doi.org/10.1145/2897824.2925953",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Andrés Lucero, Kirsikka Vaajakallio, and Peter Dalsgaard. 2012. The dialogue-labs method: process, space and materials as structuring elements to spark dialogue in co-design events. CoDesign 8, 1 (2012), 1--23. DOI: https://doi.org/10.1080/15710882.2011.609888",
      "doi": ""
    },
    {
      "text": "Dong Ma, Guohao Lan, Mahbub Hassan, Wen Hu, Mushfika Baishakhi Upama, Ashraf Uddin, and Moustafa Youssef. 2018. Gesture Recognition with Transparent Solar Cells: A Feasibility Study. In Proceedings of the 12th International Workshop on Wireless Network Testbeds, Experimental Evaluation & Characterization (WiNTECH '18). ACM, NY, NY, USA, 79--88. DOI: https://doi.org/10.1145/3267204.3267209",
      "doi": "10.1145/3267204.3267209"
    },
    {
      "text": "Dong Ma, Guohao Lan, Mahbub Hassan, Wen Hu, Mushfika B. Upama, Ashraf Uddin, and Moustafa Youssef. 2019. SolarGest: Ubiquitous and Battery-free Gesture Recognition Using Solar Cells. In The 25th Annual International Conference on Mobile Computing and Networking (MobiCom '19). ACM, NY, NY, USA, Article 12, 15 pages. DOI: https://doi.org/10.1145/3300061.3300129",
      "doi": "10.1145/3300061.3300129"
    },
    {
      "text": "Dong Hua Ma, Guohao Lan, Mahbub Hassan, Wen Hu, and Sajal K. Das. 2019. Optimizing Sensing, Computing, and Communication for Energy Harvesting IoTs: A Survey. CoRR abs/1905.03949 (2019).",
      "doi": ""
    },
    {
      "text": "Hiroyuki Manabe and Masaaki Fukumoto. 2012. Touch Sensing by Partial Shadowing of PV Module. In Adjunct Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST Adjunct Proceedings '12). ACM, NY, NY, USA, 7--8. DOI: https://doi.org/10.1145/2380296.2380301",
      "doi": "10.1145/2380296.2380301"
    },
    {
      "text": "I. Mathews, P. J. King, F. Stafford, and R. Frizzell. 2016. Performance of III--V Solar Cells as Indoor Light Energy Harvesters. IEEE Journal of Photovoltaics 6, 1 (Jan 2016), 230--235. DOI: https://doi.org/10.1109/JPHOTOV.2015.2487825",
      "doi": ""
    },
    {
      "text": "Rupert Meese, Shakir Ali, Emily-Clare Thorne, Steve D. Benford, Anthony Quinn, Richard Mortier, Boriana N. Koleva, Tony Pridmore, and Sharon L. Baurley. 2013. From Codes to Patterns: Designing Interactive Decoration for Tableware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). Association for Computing Machinery, New York, NY, USA, 931--940. DOI: https://doi.org/10.1145/2470654.2466119",
      "doi": ""
    },
    {
      "text": "William Morris. 1882. Hopes and Fears for Art. Ellis & White.",
      "doi": ""
    },
    {
      "text": "Joseph A. Paradiso and Mark Feldmeier. 2001. A Compact, Wireless, Self-Powered Pushbutton Controller. In Proceedings of the 3rd International Conference on Ubiquitous Computing (UbiComp '01). Springer-Verlag, Berlin, Heidelberg, 299--304. DOI: https://doi.org/10.1007/3- 540- 45427- 6_25",
      "doi": ""
    },
    {
      "text": "Vamsi Talla, Bryce Kellogg, Shyamnath Gollakota, and Joshua R. Smith. 2017. Battery-Free Cellphone. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 25 (June 2017), 20 pages. DOI: https://doi.org/10.1145/3090090",
      "doi": ""
    },
    {
      "text": "Ambuj Varshney, Andreas Soleiman, Luca Mottola, and Thiemo Voigt. 2017. Battery-free Visible Light Sensing. In Proceedings of the 4th ACM Workshop on Visible Light Communication Systems (VLCS '17). ACM, NY, NY, USA, 3--8. DOI: https://doi.org/10.1145/3129881.3129890",
      "doi": "10.1145/3129881.3129890"
    },
    {
      "text": "Raghav H. Venkatnarayan and Muhammad Shahzad. 2018. Gesture Recognition Using Ambient Light. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 40 (March 2018), 28 pages. DOI: https://doi.org/10.1145/3191772",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1999. The Computer for the 21st Century. SIGMOBILE Mob. Comput. Commun. Rev. 3, 3 (July 1999), 3--11. DOI: https://doi.org/10.1145/329124.329126",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "P. Worgan and M. Fraser. 2016. Garment level power distribution for wearables using inductive power transfer. In 2016 9th International Conference on Human System Interactions (HSI). IEEE Computer Society, Washington, DC, USA, 277--283. DOI: https://doi.org/10.1109/HSI.2016.7529644",
      "doi": ""
    },
    {
      "text": "Paul Worgan, Odysseas Pappas, Themis Omirou, and Michael Collett. 2015. Flexible On-body Coils for Inductive Power Transfer to IoT Garments and Wearables. In Proceedings of the 2015 IEEE 2nd World Forum on Internet of Things (WF-IoT) (WF-IOT '15). IEEE Computer Society, Washington, DC, USA, 297--298. DOI: https://doi.org/10.1109/WF-IoT.2015.7389069",
      "doi": "10.1109/WF-IoT.2015.7389069"
    },
    {
      "text": "Ligang Yuan, Zhaowei Wang, Ruomeng Duan, Peng Huang, Kaicheng Zhang, Qiaoyun Chen, Nageh K. Allam, Yi Zhou, Bo Song, and Yongfang Li. 2018. Semi-transparent perovskite solar cells: unveiling the trade-off between transparency and efficiency. J. Mater. Chem. A 6 (2018), 19696--19702. Issue 40. DOI: https://doi.org/10.1039/C8TA07318J",
      "doi": ""
    }
  ]
}