{
  "doi": "10.1145/3313831.3376596",
  "title": "Affect Recognition using Psychophysiological Correlates in High Intensity VR Exergaming",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "User experience estimation of VR exergame players by recognising their affective state could enable us to personalise and optimise their experience. Affect recognition based on psychophysiological measurements has been successful for moderate intensity activities. High intensity VR exergames pose challenges as the effects of exercise and VR headsets interfere with those measurements. We present two experiments that investigate the use of different sensors for affect recognition in a VR exergame. The first experiment compares the impact of physical exertion and gamification on psychophysiological measurements during rest, conventional exercise, VR exergaming, and sedentary VR gaming. The second experiment compares underwhelming, overwhelming and optimal VR exergaming scenarios. We identify gaze fixations, eye blinks, pupil diameter and skin conductivity as psychophysiological measures suitable for affect recognition in VR exergaming and analyse their utility in determining affective valence and arousal. Our findings provide guidelines for researchers of affective VR exergames.",
  "tags": [
    "affect recognition",
    "high intensity exercise",
    "psychophysiological correlates",
    "VR exergaming"
  ],
  "authors": [
    {
      "name": "Soumya C. Barathi",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261555",
      "orcid": "missing"
    },
    {
      "name": "Michael Proulx",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490649352",
      "orcid": "0000-0003-4066-3645"
    },
    {
      "name": "Eamonn O'Neill",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041277",
      "orcid": "0000-0002-1637-458X"
    },
    {
      "name": "Christof Lutteroth",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100238140",
      "orcid": "0000-0003-0634-7569"
    }
  ],
  "references": [
    {
      "text": "Konstantinos Alexandris, Charalambos Tsorbatzoudis, and George Grouios. 2002. Perceived constraints on recreational sport participation: Investigating their relationship with intrinsic motivation, extrinsic motivation and amotivation. Journal of Leisure Research 34, 3 (2002), 233.",
      "doi": ""
    },
    {
      "text": "Silke Anders, Martin Lotze, Michael Erb, Wolfgang Grodd, and Niels Birbaumer. 2004. Brain activity underlying emotional valence and arousal: A response-related fMRI study. Human brain mapping 23, 4 (2004), 200--209.",
      "doi": ""
    },
    {
      "text": "James Annesi. 2003. Effects of a cognitive behavioral treatment package on exercise attendance and drop out in fitness centers. European Journal of Sport Science 3, 2 (2003), 1--16.",
      "doi": ""
    },
    {
      "text": "James J Annesi. 1998. Effects of computer feedback on adherence to exercise. Perceptual and Motor Skills 87, 2 (1998), 723--730.",
      "doi": ""
    },
    {
      "text": "Deger Ayata, Yusuf Yaslan, and Mustafa Kama¸ sak. 2016. Emotion recognition via random forest and galvanic skin response: Comparison of time based feature sets, window sizes and wavelet approaches. In 2016 Medical Technologies National Congress (TIPTEKNO). IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Jonathan Z Bakdash and Laura R Marusich. 2017. Repeated measures correlation. Frontiers in Psychology 8 (2017), 456.",
      "doi": ""
    },
    {
      "text": "Fabrizio Balducci, Costantino Grana, and Rita Cucchiara. 2017. Affective level design for a role-playing videogame evaluated by a brain--computer interface and machine learning methods. The Visual Computer 33, 4 (2017), 413--427.",
      "doi": "10.1007/s00371-016-1320-2"
    },
    {
      "text": "Rosa M Banos, Patricia Escobar, Ausias Cebolla, Jaime Guixeres, Julio Alvarez Pitti, Juan Francisco Lisón, and Cristina Botella. 2016. Using virtual reality to distract overweight children from bodily sensations during exercise. Cyberpsychology, Behavior, and Social Networking 19, 2 (2016), 115--119.",
      "doi": ""
    },
    {
      "text": "Soumya C Barathi, Daniel J Finnegan, Matthew Farrow, Alexander Whaley, Pippa Heath, Jude Buckley, Peter W Dowrick, Burkhard C Wuensche, James LJ Bilzon, Eamonn O'Neill, and others. 2018. Interactive Feedforward for Improving Performance and Maintaining Intrinsic Motivation in VR Exergaming. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 408.",
      "doi": "10.1145/3173574.3173982"
    },
    {
      "text": "Soumya C. Barathi, Michael Proulx, Eamonn O'Neill, and Christof Lutteroth. 2020. Datasets and Analyses for \"Affect Recognition using Psychophysiological Correlates in High Intensity VR Exergaming\". University of Bath Research Data Archive, Bath, UK. https://doi.org/10.15125/BATH-00758.",
      "doi": ""
    },
    {
      "text": "Philipe de Souto Barreto. 2013. Why are we failing to promote physical activity globally? Bulletin of the World Health Organization 91, 6 (2013), 390--390A.",
      "doi": ""
    },
    {
      "text": "Martin J Barwood, Neil JV Weston, Richard Thelwell, and Jennifer Page. 2009. A motivational music and video intervention improves high-intensity exercise performance. Journal of Sports Science & Medicine 8, 3 (2009), 435.",
      "doi": ""
    },
    {
      "text": "Antonis S Billis, Evdokimos I Konstantinidis, Aristea I Ladas, Magda N Tsolaki, Costas Pappas, and Panagiotis D Bamidis. 2011. Evaluating affective usability experiences of an exergaming platform for seniors. In Biomedical Engineering, 2011 10th International Workshop on. IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Daniel T Bishop, Costas I Karageorghis, and Georgios Loizou. 2007. A grounded theory of young tennis players' use of music to manipulate emotional state. Journal of Sport and Exercise Psychology 29, 5 (2007), 584--607.",
      "doi": ""
    },
    {
      "text": "J Martin Bland and Douglas G Altman. 1995. Calculating correlation coefficients with repeated observations: Part 2-Correlation between subjects. Bmj 310, 6980 (1995), 633.",
      "doi": ""
    },
    {
      "text": "Paul Bliese. 2006. Multilevel Modeling in R (2.2)--A Brief Introduction to R, the multilevel package and the nlme package. (2006).",
      "doi": ""
    },
    {
      "text": "John Bolton, Mike Lambert, Denis Lirette, and Ben Unsworth. 2014. PaperDude: a virtual reality cycling exergame. In Proc. CHI Extended Abstracts. ACM, 475--478.",
      "doi": "10.1145/2559206.2574827"
    },
    {
      "text": "W Boucsein. 2012. Electrodermal activity: Springer Science+ Business Media. (2012).",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley, Laura Miccoli, Miguel A Escrig, and Peter J Lang. 2008. The pupil as a measure of emotional arousal and autonomic activation. Psychophysiology 45, 4 (2008), 602--607.",
      "doi": ""
    },
    {
      "text": "Jeanne H Brockmyer, Christine M Fox, Kathleen A Curtiss, Evan McBroom, Kimberly M Burkhart, and Jacquelyn N Pidruzny. 2009. The development of the Game Engagement Questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624--634.",
      "doi": ""
    },
    {
      "text": "Emily Brown and Paul Cairns. 2004. A grounded investigation of game immersion. In Proc. CHI extended abstracts. ACM, 1297--1300.",
      "doi": "10.1145/985921.986048"
    },
    {
      "text": "Kimberly A Brownley, Robert G McMurray, and Anthony C Hackney. 1995. Effects of music on physiological and affective responses to graded treadmill exercise in trained and untrained runners. International Journal of Psychophysiology 19, 3 (1995), 193--201.",
      "doi": ""
    },
    {
      "text": "John T Cacioppo, Richard E Petty, Mary E Losch, and Hai Sook Kim. 1986. Electromyographic activity over facial muscle regions can differentiate the valence and intensity of affective reactions. Journal of Personality and Social Psychology 50, 2 (1986), 260.",
      "doi": ""
    },
    {
      "text": "John T Cacioppo, Louis G Tassinary, and Gary Berntson. 2007. Handbook of psychophysiology. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Hande Çelikkanat, Hiroki Moriya, Takeshi Ogawa, Jukka-Pekka Kauppi, Motoaki Kawanabe, and Aapo Hyvärinen. 2017. Decoding emotional valence from electroencephalographic rhythmic activity. In 2017 39th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 4143--4146.",
      "doi": ""
    },
    {
      "text": "Georgios Christou. 2014. The interplay between immersion and appeal in video games. Computers in Human Behavior 32 (2014), 92--100.",
      "doi": "10.5555/2753876.2754006"
    },
    {
      "text": "Rachel B Clancy, Matthew P Herring, and Mark J Campbell. 2017. Motivation Measures in Sport: A Critical Review and Bibliometric Analysis. Frontiers in Psychology 8 (2017).",
      "doi": ""
    },
    {
      "text": "Avital Cnaan, Nan M Laird, and Peter Slasor. 1997. Using the general linear mixed model to analyse unbalanced repeated measures and longitudinal data. Statistics in Medicine 16, 20 (1997), 2349--2380.",
      "doi": ""
    },
    {
      "text": "Roddy Cowie, Ellen Douglas-Cowie, Nicolas Tsapatsoulis, George Votsis, Stefanos Kollias, Winfried Fellenz, and John G Taylor. 2001. Emotion recognition in human-computer interaction. IEEE Signal Processing Magazine 18, 1 (2001), 32--80.",
      "doi": ""
    },
    {
      "text": "Hugo D Critchley. 2002. Electrodermal responses: what happens in the brain. The Neuroscientist 8, 2 (2002), 132--142.",
      "doi": ""
    },
    {
      "text": "M Csikszentmihalyi. 1990. Flow. The Psychology of Optimal Experience. New York (HarperPerennial) 1990. (1990).",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 2014. Flow and the Foundations of Positive Psychology. Springer.",
      "doi": ""
    },
    {
      "text": "ISO DIS. 2009. 9241--210: 2010. Ergonomics of human system interaction-Part 210: Human-centered design for interactive systems. International Standardization Organization (ISO). Switzerland (2009).",
      "doi": ""
    },
    {
      "text": "Rod K Dishman. 1988. Exercise adherence: Its impact on public health. Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Stefan Engeser. 2012. Advances in flow research. Springer.",
      "doi": ""
    },
    {
      "text": "Fernanda Ferreira, Jens Apel, and John M Henderson. 2008. Taking a new look at looking at nothing. Trends in cognitive sciences 12, 11 (2008), 405--410.",
      "doi": ""
    },
    {
      "text": "Samantha Finkelstein, Andrea Nickel, Tiffany Barnes, and Evan A Suma. 2010. Astrojumper: Motivating children with autism to exercise using a VR game. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 4189--4194.",
      "doi": "10.1145/1753846.1754124"
    },
    {
      "text": "Canadian Fitness and Lifestyle Research Institute. 2005. 2005 Physical Activity Monitor. (2005).",
      "doi": ""
    },
    {
      "text": "Don C Fowles, Margaret J Christie, Robert Edelberg, William W Grings, David T Lykken, and Peter H Venables. 1981. Publication recommendations for electrodermal measurements. Psychophysiology 18, 3 (1981), 232--239.",
      "doi": ""
    },
    {
      "text": "Christina M Frederick and Richard M Ryan. 1993. Differences in motivation for sport and exercise and their relations with participation and mental health. Journal of Sport Behavior 16, 3 (1993), 124.",
      "doi": ""
    },
    {
      "text": "Tom Garner, Mark Grimshaw, and Debbie Abdel Nabi. 2010. A preliminary experiment to assess the fear value of preselected sound parameters in a survival horror game. In Proceedings of the 5th Audio Mostly Conference: A Conference on Interaction with Sound. ACM, 10.",
      "doi": "10.1145/1859799.1859809"
    },
    {
      "text": "Martin J Gibala, Jenna B Gillen, and Michael E Percival. 2014. Physiological and health-related adaptations to low-volume interval training: influences of nutrition and sex. Sports Medicine 44, 2 (2014), 127--137.",
      "doi": ""
    },
    {
      "text": "Martin J Gibala, Jonathan P Little, Maureen J MacDonald, and John A Hawley. 2012. Physiological adaptations to low-volume, high-intensity interval training in health and disease. The Journal of Physiology 590, 5 (2012), 1077--1084.",
      "doi": ""
    },
    {
      "text": "Martin J Gibala and Sean L McGee. 2008. Metabolic adaptations to short-term high-intensity interval training: a little pain for a lot of gain? Exercise and Sport Sciences Reviews 36, 2 (2008), 58--63.",
      "doi": ""
    },
    {
      "text": "Diane L Gill and Thomas E Deeter. 1988. Development of the sport orientation questionnaire. Research Quarterly for Exercise and Sport 59, 3 (1988), 191--202.",
      "doi": ""
    },
    {
      "text": "Kiel Gilleade, Alan Dix, and Jen Allanson. 2005. Affective videogames and modes of affective gaming: assist me, challenge me, emote me. DiGRA 2005: Changing Views--Worlds in Play. (2005).",
      "doi": ""
    },
    {
      "text": "Kiel M Gilleade and Alan Dix. 2004. Using frustration in the design of adaptive videogames. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in computer entertainment technology. ACM, 228--232.",
      "doi": "10.1145/1067343.1067372"
    },
    {
      "text": "S Navid Hajimirza, Michael J Proulx, and Ebroul Izquierdo. 2012. Reading users' minds from their eyes: a method for implicit image annotation. IEEE Transactions on Multimedia 14, 3 (2012), 805--815.",
      "doi": "10.1109/TMM.2012.2186792"
    },
    {
      "text": "Sandro Hardy, Stefan Göbel, Michael Gutjahr, Josef Wiemeyer, and Ralf Steinmetz. 2012. Adaptation model for indoor exergames. International Journal of Computer Science in Sport 11, 1 (2012).",
      "doi": ""
    },
    {
      "text": "Tilo Hartmann, Christoph Klimmt, and Peter Vorderer. 2010. Telepresence and media entertainment. Immersed in media: Telepresence in everyday life (2010), 137--157.",
      "doi": ""
    },
    {
      "text": "Richard L Hazlett. 2006. Measuring emotional valence during interactive experiences: boys at video game play. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 1023--1026.",
      "doi": "10.1145/1124772.1124925"
    },
    {
      "text": "Joel M Hektner, Jennifer A Schmidt, and Mihaly Csikszentmihalyi. 2007. Experience sampling method: Measuring the quality of everyday life. Sage.",
      "doi": ""
    },
    {
      "text": "John M Henderson, Wonil Choi, Steven G Luke, and Joseph Schmidt. 2018. Neural correlates of individual differences in fixation duration during natural reading. Quarterly Journal of Experimental Psychology 71, 1 (2018), 314--323.",
      "doi": ""
    },
    {
      "text": "John M Henderson and Steven G Luke. 2014. Stable individual differences in saccadic eye movements during reading, pseudoreading, scene viewing, and scene search. Journal of Experimental Psychology: Human Perception and Performance 40, 4 (2014), 1390.",
      "doi": ""
    },
    {
      "text": "Eckhard H Hess and James M Polt. 1960. Pupil size as related to interest value of visual stimuli. Science 132, 3423 (1960), 349--350.",
      "doi": ""
    },
    {
      "text": "Harrie F Hess and Jerry V Diller. 1969. Motivation for gambling as revealed in the marketing methods of the legitimate gambling industry. Psychological Reports 25, 1 (1969), 19--27.",
      "doi": ""
    },
    {
      "text": "Morris B Holbrook, Robert W Chestnut, Terence A Oliva, and Eric A Greenleaf. 1984. Play as a consumption experience: The roles of emotions, performance, and personality in the enjoyment of games. Journal of consumer research 11, 2 (1984), 728--739.",
      "doi": ""
    },
    {
      "text": "Sungpyo Hong, Joanna Narkiewicz, and Randy H Kardon. 2001. Comparison of pupil perimetry and visual perimetry in normal eyes: decibel sensitivity and variability. Investigative ophthalmology & visual science 42, 5 (2001), 957--965.",
      "doi": ""
    },
    {
      "text": "Robin Hunicke, Marc LeBlanc, and Robert Zubek. 2004. MDA: A formal approach to game design and game research. In Proc. AAAI Workshop on Challenges in Game AI, Vol. 4. 1722.",
      "doi": ""
    },
    {
      "text": "Christos Ioannou, Patrick Archard, Eamonn O'Neill, and Christof Lutteroth. 2019. Virtual Performance Augmentation in an Immersive Jump & Run Exergame. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 158.",
      "doi": "10.1145/3290605.3300388"
    },
    {
      "text": "Susan A Jackson and Herbert W Marsh. 1996. Development and validation of a scale to measure optimal experience: The Flow State Scale. Journal of Sport and Exercise Psychology 18, 1 (1996), 17--35.",
      "doi": ""
    },
    {
      "text": "Richard David Jacques. 1996. The nature of engagement and its role in hypermedia evaluation and design. Ph.D. Dissertation. South Bank University.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Anna L Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and defining the experience of immersion in games. International journal of human-computer studies 66, 9 (2008), 641--661.",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Jaime Kaminer, Alice S Powers, Kyle G Horn, Channing Hui, and Craig Evinger. 2011. Characterizing the spontaneous blink generator: an animal model. Journal of Neuroscience 31, 31 (2011), 11256--11267.",
      "doi": ""
    },
    {
      "text": "Costas I Karageorghis, Leighton Jones, and Daniel C Low. 2006a. Relationship between exercise heart rate and music tempo preference. Research quarterly for exercise and sport 77, 2 (2006), 240--250.",
      "doi": ""
    },
    {
      "text": "Costas I Karageorghis, David-Lee Priest, Peter C Terry, Nikos LD Chatzisarantis, and Andrew M Lane. 2006b. Redesign and initial validation of an instrument to assess the motivational qualities of music in exercise: The Brunel Music Rating Inventory-2. Journal of sports sciences 24, 8 (2006), 899--909.",
      "doi": ""
    },
    {
      "text": "Craig N Karson. 1983. Spontaneous eye-blink rates and dopaminergic systems. Brain 106, 3 (1983), 643--653.",
      "doi": ""
    },
    {
      "text": "Craig N Karson, Karen Faith Berman, Edward F Donnelly, Wallace B Mendelson, Joel E Kleinman, and Richard Jed Wyatt. 1981. Speaking, thinking, and blinking. Psychiatry research 5, 3 (1981), 243--246.",
      "doi": ""
    },
    {
      "text": "Marcus Kilpatrick, Edward Hebert, and John Bartholomew. 2005. College students' motivation for physical activity: differentiating men's and women's motives for sport participation and exercise. Journal of American college health 54, 2 (2005), 87--94.",
      "doi": ""
    },
    {
      "text": "Paul B Laursen and David G Jenkins. 2002. The scientific basis for high-intensity interval training. Sports medicine 32, 1 (2002), 53--73.",
      "doi": ""
    },
    {
      "text": "Felissa K Lee, Kennon M Sheldon, and Daniel B Turban. 2003. Personality and the goal-striving process: The influence of achievement goal patterns, goal level, and mental focus on performance and enjoyment. Journal of Applied Psychology 88, 2 (2003), 256.",
      "doi": ""
    },
    {
      "text": "Lili Liu, Rachael Ip, Anna Shum, and Christian Wagner. 2014. Learning effects of virtual game worlds: an empirical investigation of immersion, enjoyment and performance. (2014).",
      "doi": ""
    },
    {
      "text": "Fausto Massimini and Massimo Carli. 1988. The systematic assessment of flow in daily experience. (1988).",
      "doi": ""
    },
    {
      "text": "Fausto Massimini, Mihaly Csikszentmihalyi, and Massimo Carli. 1987. The monitoring of optimal experience: A tool for psychiatric rehabilitation. Journal of Nervous and Mental disease (1987).",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research Quarterly for Exercise and Sport 60, 1 (1989), 48--58.",
      "doi": ""
    },
    {
      "text": "Arlen C Moller, Brian P Meier, and Robert D Wall. 2010. Developing an experimental induction of flow: Effortless action in the lab. Effortless attention: A new perspective in the cognitive science of attention and action (2010), 191--204.",
      "doi": ""
    },
    {
      "text": "Javier Monedero, Elizabeth J Lyons, and Donal J O'Gorman. 2015. Interactive video game cycling leads to higher energy expenditure and is more enjoyable than conventional exercise in adults. PloS One 10, 3 (2015).",
      "doi": ""
    },
    {
      "text": "Larissa Müller, Arne Bernin, Sobin Ghose, Wojtek Gozdzielewski, Qi Wang, Christos Grecos, Kai von Luck, and Florian Vogt. 2016. Physiological data analysis for an emotional provoking exergame. In 2016 IEEE Symposium Series on Computational Intelligence (SSCI). IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Larissa Müller, Arne Bernin, Andreas Kamenz, Sobin Ghose, Kai von Luck, Christos Grecos, Qi Wang, and Florian Vogt. 2017. Emotional journey for an emotion provoking cycling exergame. In 2017 IEEE 4th International Conference on Soft Computing & Machine Intelligence (ISCMI). IEEE, 104--108.",
      "doi": ""
    },
    {
      "text": "Larissa Müller, Sebastian Zagaria, Arne Bernin, Abbes Amira, Naeem Ramzan, Christos Grecos, and Florian Vogt. 2015. Emotionbike: a study of provoking emotions in cycling exergames. In International Conference on Entertainment Computing. Springer, 155--168.",
      "doi": ""
    },
    {
      "text": "Lennart Nacke. 2009. Affective ludology: Scientific measurement of user experience in interactive entertainment. Ph.D. Dissertation. Blekinge Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Lennart E Nacke and Craig A Lindley. 2010. Affective ludology, flow and immersion in a first-person shooter: Measurement of player experience. arXiv preprint arXiv:1004.0248 (2010).",
      "doi": ""
    },
    {
      "text": "Lennart E Nacke, Sophie Stellmach, and Craig A Lindley. 2011. Electroencephalographic assessment of player experience: A pilot study in affective ludology. Simulation & Gaming 42, 5 (2011), 632--655.",
      "doi": ""
    },
    {
      "text": "Mohsen Naji, Mohammd Firoozabadi, and Parviz Azadfallah. 2014. Classification of music-induced emotions based on information fusion of forehead biosignals and electrocardiogram. Cognitive Computation 6, 2 (2014), 241--252.",
      "doi": ""
    },
    {
      "text": "Jeanne Nakamura and Mihaly Csikszentmihalyi. 2014. The concept of flow. In Flow and the Foundations of Positive Psychology. Springer, 239--263.",
      "doi": ""
    },
    {
      "text": "Simon Niedenthal. 2009. What we talk about when we talk about game aesthetics. (2009).",
      "doi": ""
    },
    {
      "text": "Pedro A Nogueira, Rui Rodrigues, and Eugénio Oliveira. 2013a. Real-time psychophysiological emotional state estimation in digital gameplay scenarios. In International Conference on Engineering Applications of Neural Networks. Springer, 243--252.",
      "doi": ""
    },
    {
      "text": "Pedro A Nogueira, Rui Rodrigues, Eugénio Oliveira, and Lennart E Nacke. 2013b. A hybrid approach at emotional state detection: Merging theoretical models of emotion with data-driven statistical classifiers. In Proceedings of the 2013 IEEE/WIC/ACM International Joint Conferences on Web Intelligence (WI) and Intelligent Agent Technologies (IAT)-Volume 02. IEEE Computer Society, 253--260.",
      "doi": "10.1109/WI-IAT.2013.117"
    },
    {
      "text": "Pedro A Nogueira, Rui Rodrigues, Eugénio Oliveira, and Lennart E Nacke. 2013c. A regression-based method for lightweight emotional state detection in interactive environments. In XVI Portuguese conference on artificial intelligence (EPIA).",
      "doi": ""
    },
    {
      "text": "American College of Sports Medicine. 2017. ACSM's guidelines for exercise testing and prescription. Lippincott Williams & Wilkins.",
      "doi": ""
    },
    {
      "text": "Stephen Olejnik and James Algina. 2003. Generalized eta and omega squared statistics: measures of effect size for some common research designs. Psychological methods 8, 4 (2003), 434.",
      "doi": ""
    },
    {
      "text": "Timo Partala and Veikko Surakka. 2003. Pupil size variation as an indication of affective processing. International journal of human-computer studies 59, 1--2 (2003), 185--198.",
      "doi": "10.1016/S1071-5819%2803%2900017-X"
    },
    {
      "text": "James L Peugh. 2010. A practical guide to multilevel modeling. Journal of school psychology 48, 1 (2010), 85--112.",
      "doi": ""
    },
    {
      "text": "Ryan E Rhodes, Darren ER Warburton, and Shannon SD Bredin. 2009. Predicting the effect of interactive video bikes on exercise adherence: An efficacy trial. Psychology, health & medicine 14, 6 (2009), 631--640.",
      "doi": ""
    },
    {
      "text": "Øivind Rognmo, Eva Hetland, Jan Helgerud, Jan Hoff, and Stig A Slørdahl. 2004. High intensity aerobic interval exercise is superior to moderate intensity exercise for increasing aerobic capacity in patients with coronary artery disease. European Journal of Cardiovascular Prevention & Rehabilitation 11, 3 (2004), 216--222.",
      "doi": ""
    },
    {
      "text": "Gordon Rugg and Marian Petre. 2007. A Gentle Guide to Research Methods. 1st. (2007).",
      "doi": ""
    },
    {
      "text": "James A Russell, Anna Weiss, and Gerald A Mendelsohn. 1989. Affect grid: a single-item scale of pleasure and arousal. Journal of Personality and Social psychology 57, 3 (1989), 493.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan. 1982. Control and information in the intrapersonal sphere: An extension of cognitive evaluation theory. Journal of Personality and Social Psychology 43, 3 (1982), 450--461.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, Christina M Frederick, Deborah Lepes, Noel Rubio, and Kennon M Sheldon. 1997. Intrinsic motivation and exercise adherence. International Journal of Sport Psychology 28, 4 (1997), 335--354.",
      "doi": ""
    },
    {
      "text": "Kenzo Sato and Richard L Dobson. 1970. Regional and individual variations in the function of the human eccrine sweat gland. Journal of Investigative Dermatology 54, 6 (1970), 443--449.",
      "doi": ""
    },
    {
      "text": "K Sato and F Sato. 1983. Individual variations in structure and function of human eccrine sweat gland. American Journal of Physiology-Regulatory, Integrative and Comparative Physiology 245, 2 (1983), R203--R208.",
      "doi": ""
    },
    {
      "text": "May-li Seah and Paul Cairns. 2008. From immersion to addiction in videogames. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction-Volume 1. British Computer Society, 55--63.",
      "doi": ""
    },
    {
      "text": "Jeff Sinclair, Philip Hingston, and Martin Masek. 2009. Exergame development using the dual flow model. In Proc. Australasian Conference on Interactive Entertainment. ACM.",
      "doi": "10.1145/1746050.1746061"
    },
    {
      "text": "Burrhus Frederic Skinner. 1953. Science and human behavior. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "John A Stern, Larry C Walrath, and Robert Goldstein. 1984. The endogenous eyeblink. Psychophysiology 21, 1 (1984), 22--33.",
      "doi": ""
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3, 3 (2005), 3--3.",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Jonathan Sykes and Simon Brown. 2003. Affective gaming: measuring emotion through the gamepad. In CHI'03 extended abstracts on Human factors in computing systems. ACM, 732--733.",
      "doi": "10.1145/765891.765957"
    },
    {
      "text": "Ching-I Teng. 2010. Customization, immersion satisfaction, and online gamer loyalty. Computers in Human Behavior 26, 6 (2010), 1547--1554.",
      "doi": "10.1016/j.chb.2010.05.029"
    },
    {
      "text": "Laura E Thomas and Alejandro Lleras. 2007. Moving eyes and moving thought: On the spatial compatibility between eye movements and cognition. Psychonomic bulletin & review 14, 4 (2007), 663--668.",
      "doi": ""
    },
    {
      "text": "Scott Thomas, Jeff Reading, and Roy J Shephard. 1992. Revision of the physical activity readiness questionnaire (PAR-Q). Canadian journal of sport sciences (1992).",
      "doi": ""
    },
    {
      "text": "Darren ER Warburton, Shannon SD Bredin, Leslie TL Horita, Dominik Zbogar, Jessica M Scott, Ben TA Esch, and Ryan E Rhodes. 2007. The health benefits of interactive video game exercise. Applied Physiology, Nutrition, and Metabolism 32, 4 (2007), 655--663.",
      "doi": ""
    },
    {
      "text": "Philip M Wilson, Wendy M Rodgers, Chris M Blanchard, and Joanne Gessell. 2003. The relationship between psychological needs, self-determined motivation, exercise attitudes, and physical fitness. Journal of Applied Social Psychology 33, 11 (2003), 2373--2392.",
      "doi": ""
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3 (1998), 225--240.",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Sandy Wolfson and Gill Case. 2000. The effects of sound and colour on responses to a computer game. Interacting with computers 13, 2 (2000), 183--192.",
      "doi": ""
    },
    {
      "text": "Haris Zacharatos, Christos Gatzoulis, Yiorgos Chrysanthou, and Andreas Aristidou. 2013. Emotion recognition for exergames using laban movement analysis. In Proceedings of Motion on Games. ACM, 61--66.",
      "doi": "10.1145/2522628.2522651"
    },
    {
      "text": "Jiri Zuzanek. 1999. Experience sampling method: Current and potential research applications. In Workshop on Measurement of and Research on Time Use, National Research Council, Washington, DC. 108.",
      "doi": ""
    }
  ]
}