{
  "doi": "10.1145/3313831.3376246",
  "title": "Sociality and Skill Sharing in the Garden",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Gardening is an activity that involves a number of dimensions of increasing interest to HCI and CSCW researchers, including recreation, sustainability, and engagement with nature. This paper considers the garden setting in order to understand the role that collaborative and social computing technologies might play for practitioners engaging in outdoor skilled activities. We conducted participant observations with nine experienced gardeners aged 22-71 years. Through this process, we find that gardeners continuously configure their environments to accommodate their preferences for sociality. They share embodied skills and help others attune to sensory information in person, but also influence learning through the features in their garden that are observed by others. This paper provides an understanding of sociality in the garden, highlights skill sharing as a key domain for design in this space, and contributes design considerations for collaborative technologies in outdoor settings.",
  "tags": [
    "participant observation",
    "sociality",
    "gardening",
    "skill sharing"
  ],
  "authors": [
    {
      "name": "Hanuma Teja Maddali",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214433",
      "orcid": "0000-0002-3941-0336"
    },
    {
      "name": "Amanda Lazar",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    }
  ],
  "references": [
    {
      "text": "2014. NGA Garden to Table Report. https://garden.org/special/pdf/2014-NGA-Garden-to-Table.pdf. (2014).",
      "doi": ""
    },
    {
      "text": "2019. Phenology Maps. https://www.usanpn.org/data/maps. (2019).",
      "doi": ""
    },
    {
      "text": "Catherine Alexander. 2002. The Garden as Occasional Domestic Space. Signs: Journal of Women in Culture and Society 27, 3 (2002), 857--871. http://dx.doi.org/10.1086/337930",
      "doi": ""
    },
    {
      "text": "Margaret Armar-Klemesu and others. 2000. Urban agriculture and food security, nutrition and health. Growing cities, growing food. Urban agriculture on the policy agenda (2000), 99--118.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the Implication is Not to Design (Technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2271--2274. http://dx.doi.org/10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Charles Bond. 1982. Social facilitation: A self-presentational view. Journal of Personality and Social Psychology 42 (06 1982), 1042--1050. http://dx.doi.org/10.1037/0022--3514.42.6.1042",
      "doi": ""
    },
    {
      "text": "Jessica L. Cappadonna, Margot Brereton, David M. Watson, and Paul Roe. 2016. Calls from the Wild: Engaging Citizen Scientist with Animal Sounds. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems (DIS '16 Companion). ACM, New York, NY, USA, 157--160. http://dx.doi.org/10.1145/2908805.2909413",
      "doi": "10.1145/2908805.2909413"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory . Sage. 388 pages.",
      "doi": ""
    },
    {
      "text": "Kristen L Davis and Lynn S Brann. 2017. Examining the Benefits and Barriers of Instructional Gardening Programs to Increase Fruit and Vegetable Intake among Preschool-Age Children. Journal of environmental and public health 2017 (2017), 2506864. http://dx.doi.org/10.1155/2017/2506864",
      "doi": ""
    },
    {
      "text": "Lilian de Greef, Meredith Morris, and Kori Inkpen. 2016. TeleTourist: Immersive Telepresence Tourism for Mobility-Restricted Participants. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW '16 Companion). ACM, New York, NY, USA, 273--276. http://dx.doi.org/10.1145/2818052.2869082",
      "doi": "10.1145/2818052.2869082"
    },
    {
      "text": "Audrey Desjardins, Saul Greenberg, Ron Wakkary, and Jeff Hambelton. 2016. Avalanche Beacon Parks: Skill Development and Team Coordination in a Technological Training Ground. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 872--886. http://dx.doi.org/10.1145/2818048.2835200",
      "doi": "10.1145/2818048.2835200"
    },
    {
      "text": "Janis L. Dickinson and Rhiannon L. Crain. 2014. Socially Networked Citizen Science and the Crowd-Sourcing of Pro-Environmental Collective Actions. Springer Vienna, Vienna, 133--152. http://dx.doi.org/10.1007/978--3--7091--1340-0_8",
      "doi": ""
    },
    {
      "text": "Robert M. Emerson, Rachel I. Fretz, and Linda L. Shaw. Writing ethnographic fieldnotes . 289 pages.",
      "doi": ""
    },
    {
      "text": "James Fogarty, Andrew J. Ko, Htet Htet Aung, Elspeth Golden, Karen P. Tang, and Scott E. Hudson. 2005. Examining Task Engagement in Sensor-based Statistical Models of Human Interruptibility. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 331--340. http://dx.doi.org/10.1145/1054972.1055018",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman and Daniela Rosner. 2011. From Garments to Gardens: Negotiating Material Relationships Online and 'by Hand'. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2257--2266. http://dx.doi.org/10.1145/1978942.1979273",
      "doi": "10.1145/1978942.1979273"
    },
    {
      "text": "Ping-Hsuan Han, Kuan-Wen Chen, Chen-Hsin Hsieh, Yu-Jie Huang, and Yi-Ping Hung. 2016. AR-Arm: Augmented Visualization for Guiding Arm Movement in the First-Person Perspective. In Proceedings of the 7th Augmented Human International Conference 2016 (AH '16). ACM, New York, NY, USA, Article 31, 4 pages. http://dx.doi.org/10.1145/2875194.2875237",
      "doi": "10.1145/2875194.2875237"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Rob Comber. 2018. Connected Seeds and Sensors: Co-designing Internet of Things for Sustainable Smart Cities with Urban Food-growing Communities. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial - Volume 2 (PDC '18). ACM, New York, NY, USA, Article 18, 5 pages. http://dx.doi.org/10.1145/3210604.3210620",
      "doi": "10.1145/3210604.3210620"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for Grassroots Urban Food-growing Communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13). ACM, New York, NY, USA, 255--264. http://dx.doi.org/10.1145/2541016.2541023",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Atsushi Hiyama, Hiroyuki Onimaru, Mariko Miyashita, Eikan Ebuchi, Masazumi Seki, and Michitaka Hirose. 2013. Augmented Reality System for Measuring and Learning Tacit Artisan Skills. In Human Interface and the Management of Information. Information and Interaction for Health, Safety, Mobility and Complex Environments, Sakae Yamamoto (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 85--91.",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Misha Sra, Jingru Guo, Rodrigo Marques, Raymond Wu, Justin Chiu, and Chris Schmandt. 2016. Immersive Terrestrial Scuba Diving Using Virtual Reality. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1563--1569. http://dx.doi.org/10.1145/2851581.2892503",
      "doi": "10.1145/2851581.2892503"
    },
    {
      "text": "Brennan Jones. 2018. Designing for Distributed Collaboration in Wilderness Search and Rescue. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '18). ACM, New York, NY, USA, 77--80. http://dx.doi.org/10.1145/3272973.3272978",
      "doi": "10.1145/3272973.3272978"
    },
    {
      "text": "P. H. Kahn, B. Friedman, I. S. Alexander, N. G. Freier, and S. L. Collett. 2005. The distant gardener: what conversations in the Telegarden reveal about human-telerobotic interaction. In ROMAN 2005. IEEE International Workshop on Robot and Human Interactive Communication, 2005. 13--18. http://dx.doi.org/10.1109/ROMAN.2005.1513749",
      "doi": ""
    },
    {
      "text": "Raine Kajastila, Leo Holsti, and Perttu H\"am\"al\"ainen. 2016. The Augmented Climbing Wall: High-Exertion Proximity Interaction on a Wall-Sized Interactive Surface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 758--769. http://dx.doi.org/10.1145/2858036.2858450",
      "doi": "10.1145/2858036.2858450"
    },
    {
      "text": "HyeongYeop Kang, Geonsun Lee, Seongsu Kwon, Ohung Kwon, Seongpil Kim, and JungHyun Han. 2018. Flotation Simulation in a Cable-driven Virtual Environment -- A Study with Parasailing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 632, 11 pages. http://dx.doi.org/10.1145/3173574.3174206",
      "doi": "10.1145/3173574.3174206"
    },
    {
      "text": "Hiromi Kobori, Janis L. Dickinson, Izumi Washitani, Ryo Sakurai, Tatsuya Amano, Naoya Komatsu, Wataru Kitamura, Shinichi Takagawa, Kazuo Koyama, Takao Ogawara, and A. J. Miller-Rushing. 2016. Citizen science: a new approach to advance ecology, education, and conservation. Ecological Research 31, 1 (01 Jan 2016), 1--19. http://dx.doi.org/10.1007/s11284-015--1314-y",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, Will Harrigan-Anderson, Haakon Faste, Scott E. Hudson, and Eric Paulos. 2013. Community Engagements with Living Sensing Systems. In Proceedings of the 9th ACM Conference on Creativity and Cognition (CC '13). ACM, New York, NY, USA, 213--222. http://dx.doi.org/10.1145/2466627.2466638",
      "doi": "10.1145/2466627.2466638"
    },
    {
      "text": "Stacey Kuznetsov, William Odom, James Pierce, and Eric Paulos. 2011. Nurturing Natural Sensors. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, New York, NY, USA, 227--236. http://dx.doi.org/10.1145/2030112.2030144",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "Stacey Kuznetsov, Christina J. Santana, and Elenore Long. 2016. Everyday Food Science As a Design Space for Community Literacy and Habitual Sustainable Practice. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1786--1797. http://dx.doi.org/10.1145/2858036.2858363",
      "doi": "10.1145/2858036.2858363"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2014. Physical Telepresence: Shape Capture and Display for Embodied, Computer-mediated Remote Collaboration. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 461--470. http://dx.doi.org/10.1145/2642918.2647377",
      "doi": "10.1145/2642918.2647377"
    },
    {
      "text": "J S Litt, S J Schmiege, J W Hale, M Buchenau, and F Sancar. 2015. Exploring ecological, emotional and social levers of self-rated health for urban gardeners and non-gardeners: A path analysis. Social science & medicine (1982) 144 (nov 2015), 1--8. http://dx.doi.org/10.1016/j.socscimed.2015.09.004",
      "doi": ""
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 40, 13 pages. http://dx.doi.org/10.1145/3173574.3173614",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2015. Growing Food in the City: Design Ideations for Urban Residential Gardeners. In Proceedings of the 7th International Conference on Communities and Technologies (C & T '15). ACM, New York, NY, USA, 89--97. http://dx.doi.org/10.1145/2768545.2768549",
      "doi": "10.1145/2768545.2768549"
    },
    {
      "text": "Matthew Mauriello, Michael Gubbels, and Jon E. Froehlich. 2014. Social Fabric Fitness: The Design and Evaluation of Wearable E-textile Displays to Support Group Running. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2833--2842. http://dx.doi.org/10.1145/2556288.2557299",
      "doi": ""
    },
    {
      "text": "William Odom. 2010. \"Mate, We Don't Need a Chip to Tell Us the Soil's Dry\": Opportunities for Designing Interactive Systems to Support Urban Food Production. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 232--235. http://dx.doi.org/10.1145/1858171.1858211",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "Kenton O'Hara. 2008. Understanding Geocaching Practices and Motivations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1177--1186. http://dx.doi.org/10.1145/1357054.1357239",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "Jon Pearce, Wally Smith, Bjorn Nansen, and John Murphy. 2009. SmartGardenWatering: Experiences of Using a Garden Watering Simulation. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7 (OZCHI '09). ACM, New York, NY, USA, 217--224. http://dx.doi.org/10.1145/1738826.1738861",
      "doi": "10.1145/1738826.1738861"
    }
  ]
}