{
  "doi": "10.1145/3313831.3376695",
  "title": "Exploring the Effects of Technological Writing Assistance for Support Providers in Online Mental Health Community",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Textual comments from peers with informational and emotional support are beneficial to members of online mental health communities (OMHCs). However, many comments are not of high quality in reality. Writing support technologies that assess (AS) the text or recommend (RE) writing examples on the fly could potentially help support providers to improve the quality of their comments. However, how providers perceive and work with such technologies are under-investigated. In this paper, we present a technological prototype MepsBot which offers providers in-situ writing assistance in either AS or RE mode. Results of a mixed-design study with 30 participants show that both types of MepsBots improve users' confidence in and satisfaction with their comments. The AS-mode MepsBot encourages users to refine expressions and is deemed easier to use, while the RE-mode one stimulates more support-related content re-editions. We report concerns on MepsBot and propose design considerations for writing support technologies in OMHCs.",
  "authors": [
    {
      "name": "Zhenhui Peng",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659275091",
      "orcid": "0000-0002-5700-3136"
    },
    {
      "name": "Qingyu Guo",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527752",
      "orcid": "0000-0002-8509-3933"
    },
    {
      "name": "Ka Wing Tsang",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526404",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "Tim Althoff, Kevin Clark, and Jure Leskovec. 2016. Large-scale Analysis of Counseling Conversations: An Application of Natural Language Processing to Mental Health. Transactions of the Association for Computational Linguistics 4 (2016), 463--476. DOI: http://dx.doi.org/10.1162/tacl_a_00111",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 3, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Responding to Sensitive Disclosures on Social Media: A Decision-Making Framework. ACM Trans. Comput.-Hum. Interact. 25, 6, Article 31 (Dec. 2018), 29 pages. DOI: http://dx.doi.org/10.1145/3241044",
      "doi": ""
    },
    {
      "text": "Gerhard Andersson and Nickolai Titov. 2014. Advantages and limitations of Internet-based interventions for common mental disorders. World psychiatry : official journal of the World Psychiatric Association (WPA) 13 (02 2014), 4--11. DOI: http://dx.doi.org/10.1002/wps.20083",
      "doi": ""
    },
    {
      "text": "Paul André, m.c. schraefel, Jaime Teevan, and Susan T. Dumais. 2009. Discovery is Never by Chance: Designing for (Un)Serendipity. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (C&C '09). ACM, NY, NY, USA, 305--314. DOI: http://dx.doi.org/10.1145/1640233.1640279",
      "doi": ""
    },
    {
      "text": "Jaime Arguello, Brian S. Butler, Elisabeth Joyce, Robert Kraut, Kimberly S. Ling, Carolyn Rosé, and Xiaoqing Wang. 2006. Talk to Me: Foundations for Successful Individual-group Interactions in Online Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 959--968. DOI: http://dx.doi.org/10.1145/1124772.1124916",
      "doi": "10.1145/1124772.1124916"
    },
    {
      "text": "MHFA Australia. 2019. Mental Health First Aid. (2019). Retrieved June 1, 2019 from https://mhfa.com.au/.",
      "doi": ""
    },
    {
      "text": "Shrey Bagroy, Ponnurangam Kumaraguru, and Munmun De Choudhury. 2017. A Social Media Based Index of Mental Well-Being in College Campuses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1634--1646. DOI: http://dx.doi.org/10.1145/3025453.3025909",
      "doi": "10.1145/3025453.3025909"
    },
    {
      "text": "Piet Bracke, Wendy Christiaens, and Mieke Verhaeghe. 2008. Self-Esteem, Self-Efficacy, and the Balance of Peer Support Among Persons With Chronic Mental Health Problems. Journal of Applied Social Psychology 38, 2 (2008), 436--459. DOI: http://dx.doi.org/10.1111/j.1559--1816.2008.00312.x",
      "doi": ""
    },
    {
      "text": "Michael Braun, Anja Mainz, Ronee Chadowitz, Bastian Pfleging, and Florian Alt. 2019. At Your Service: Designing Voice Assistant Personalities to Improve Automotive User Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 40, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300270",
      "doi": "10.1145/3290605.3300270"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Andrea Hu, and Munmun De Choudhury. 2018. Norms Matter: Contrasting Social Support Around Behavior Change in Online Weight Loss Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 666, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3174240",
      "doi": "10.1145/3173574.3174240"
    },
    {
      "text": "Stevie Chancellor, Yannis Kalantidis, Jessica A. Pater, Munmun De Choudhury, and David A. Shamma. 2017. Multimodal Classification of Moderated Online Pro-Eating Disorder Content. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3213--3226. DOI: http://dx.doi.org/10.1145/3025453.3025985",
      "doi": "10.1145/3025453.3025985"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan (Jerry) Lin, and Munmun De Choudhury. 2016a. \"This Post Will Just Get Taken Down\": Characterizing Removed Pro-Eating Disorder Social Media Content. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1157--1162. DOI: http://dx.doi.org/10.1145/2858036.2858248",
      "doi": "10.1145/2858036.2858248"
    },
    {
      "text": "Stevie Chancellor, Tanushree Mitra, and Munmun De Choudhury. 2016b. Recovery Amid Pro-Anorexia: Analysis of Recovery in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2111--2123. DOI: http://dx.doi.org/10.1145/2858036.2858246",
      "doi": "10.1145/2858036.2858246"
    },
    {
      "text": "Stevie Chancellor, George Nitzburg, Andrea Hu, Francisco Zampieri, and Munmun De Choudhury. 2019. Discovering Alternative Treatments for Opioid Use Recovery Using Social Media. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 124, 15 pages. DOI: http://dx.doi.org/10.1145/3290605.3300354",
      "doi": "10.1145/3290605.3300354"
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #Thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1201--1213. DOI: http://dx.doi.org/10.1145/2818048.2819963",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Pamara Chang, Janis Whitlock, and Natalya Bazarova. 2018. \"To Respond or not to Respond, that is the Question\": The Decision-Making Process of Providing Social Support to Distressed Posters on Facebook. Social Media + Society 4 (02 2018), 205630511875929. DOI: http://dx.doi.org/10.1177/2056305118759290",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Emre Kiciman. 2017. The Language of Social Support in Social Media and Its Effect on Suicidal Ideation Risk. Proceedings of the ... International AAAI Conference on Weblogs and Social Media. International AAAI Conference on Weblogs and Social Media 2017 (2017), 32--41.",
      "doi": ""
    },
    {
      "text": "Elizabeth Clark, Anne Spencer Ross, Chenhao Tan, Yangfeng Ji, and Noah A. Smith. 2018. Creative Writing with a Machine in the Loop: Case Studies on Slogans and Stories. In 23rd International Conference on Intelligent User Interfaces (IUI '18). ACM, NY, NY, USA, 329--340. DOI: http://dx.doi.org/10.1145/3172944.3172983",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J. Horvitz, and Aaron Hoff. 2014. Characterizing and Predicting Postpartum Depression from Shared Facebook Data. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 626--638. DOI: http://dx.doi.org/10.1145/2531602.2531675",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). Association for Computational Linguistics, Minneapolis, Minnesota, 4171--4186. DOI: http://dx.doi.org/10.18653/v1/N19--1423",
      "doi": ""
    },
    {
      "text": "Karthik Dinakar, Jackie Chen, Henry Lieberman, Rosalind Picard, and Robert Filbin. 2015. Mixed-Initiative Real-Time Topic Modeling & Visualization for Crisis Counseling. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, NY, NY, USA, 417--426. DOI: http://dx.doi.org/10.1145/2678025.2701395",
      "doi": "10.1145/2678025.2701395"
    },
    {
      "text": "Keith S. Dobson. 2010. Handbook of cognitive-behavioral therapies, 3rd ed. Guilford Press, New York, NY, US. xiv, 481--xiv, 481 pages.",
      "doi": ""
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with Online Mental Health Interventions: An Exploratory Clinical Study of a Treatment for Depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1421--1430. DOI: http://dx.doi.org/10.1145/2207676.2208602",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2019. Moderation Practices As Emotional Labor in Sustaining Online Communities: The Case of AAPI Identity Work on Reddit. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 142, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300372",
      "doi": "10.1145/3290605.3300372"
    },
    {
      "text": "Elasticsearch. 2019. Python Elasticsearch Client -- Elasticsearch 7.9.9 documentation. (2019). Retrieved May 23, 2019 from https://mhfa.com.au/.",
      "doi": ""
    },
    {
      "text": "John F M Gleeson, Mario Alvarez-Jimenez, and Reeva Lederman. 2012. Moderated Online Social Therapy for Recovery From Early Psychosis. Psychiatric services (Washington, D.C.) 63 (07 2012), 719. DOI: http://dx.doi.org/10.1176/appi.ps.20120p719",
      "doi": ""
    },
    {
      "text": "Noura Farra, Swapna Somasundaran, and Jill Burstein. 2015. Scoring Persuasive Essays Using Opinions and their Targets. In Proceedings of the Tenth Workshop on Innovative Use of NLP for Building Educational Applications. Association for Computational Linguistics, Denver, Colorado, 64--74. DOI: http://dx.doi.org/10.3115/v1/W15-0608",
      "doi": ""
    },
    {
      "text": "Jessica L. Feuston and Anne Marie Piper. 2019. Everyday Experiences: Small Stories and Mental Illness on Instagram. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 265, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300495",
      "doi": "10.1145/3290605.3300495"
    },
    {
      "text": "Anna Geraedts, Annet Kleiboer, Jos Twisk, Noortje Wiezer, Willem van Mechelen, and Pim Cuijpers. 2014. Long-Term Results of a Web-Based Guided Self-Help Intervention for Employees With Depressive Symptoms: Randomized Controlled Trial. Journal of Medical Internet Research (07 2014). DOI: http://dx.doi.org/10.2196/jmir.3539",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero and Lydia B. Chilton. 2019. Metaphoria: An Algorithmic Companion for Metaphor Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 296, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300526",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating Support Seeking from Peers for Pregnancy in Online Health Communities. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 50 (Dec. 2017), 19 pages. DOI: http://dx.doi.org/10.1145/3134685",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Tayebeh Fasihi Harandi, Maryam Mohammad Taghinasab, and Tayebeh Dehghan Nayeri. 2017. The correlation of social support with mental health: A meta-analysis. In Electronic physician.",
      "doi": ""
    },
    {
      "text": "Thomas K. Houston, Lisa A Cooper, and Daniel Ernest Ford. 2002. Internet support groups for depression: a 1-year prospective cohort study. The American journal of psychiatry 159 12 (2002), 2062--8.",
      "doi": ""
    },
    {
      "text": "Julie S. Hui, Darren Gergle, and Elizabeth M. Gerber. 2018. IntroAssist: A Tool to Support Writing Introductory Help Requests. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 22, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173596",
      "doi": ""
    },
    {
      "text": "Lisa J Barney, Kathleen Griffiths, and Michelle Banfield. 2011. Explicit and implicit information needs of people with depression: A qualitative investigation of problems reported on an online depression support forum. BMC psychiatry 11 (05 2011), 88. DOI: http://dx.doi.org/10.1186/1471--244X-11--88",
      "doi": ""
    },
    {
      "text": "Ryan Kelly, Daniel Gooch, and Leon Watts. 2018. 'It's More Like a Letter': An Exploration of Mediated Conversational Effort in Message Builder. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 87 (Nov. 2018), 23 pages. DOI: http://dx.doi.org/10.1145/3274356",
      "doi": "10.1145/3274356"
    },
    {
      "text": "Jan Kietzmann, Kristopher Hermkens, Ian McCarthy, and Bruno Silvestre. 2011. Social Media? Get Serious! Understanding the Functional Building Blocks of Social Media. Business Horizons 54 (05 2011), 241--251. DOI: http://dx.doi.org/10.1016/j.bushor.2011.01.005",
      "doi": ""
    },
    {
      "text": "Taewook Kim, Jungsoo Lee, Zhenhui Peng, and Xiaojuan Ma. 2019. Love in Lyrics: An Exploration of Supporting Textual Manifestation of Affection in Social Messaging. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 79 (Nov. 2019), 27 pages. DOI: http://dx.doi.org/10.1145/3359181",
      "doi": "10.1145/3359181"
    },
    {
      "text": "Joseph Lampel and Ajay Bhalla. 2007. The Role of Status Seeking in Online Communities: Giving the Gift of Experience. Journal of Computer-Mediated Communication 12, 2 (2007).",
      "doi": ""
    },
    {
      "text": "Reeva Lederman, Greg Wadley, John Gleeson, Sarah Bendall, and Mario Alvarez-Jimenez. 2014. Moderated Online Social Therapy: Designing and Evaluating Technology for Mental Health. ACM Transactions on Computer-Human Interaction (TOCHI) 21 (02 2014). DOI: http://dx.doi.org/10.1145/2513179",
      "doi": "10.1145/2513179"
    },
    {
      "text": "Minha Lee, Sander Ackermans, Nena van As, Hanwen Chang, Enzo Lucas, and Wijnand IJsselsteijn. 2019. Caring for Vincent: A Chatbot for Self-Compassion. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 702, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300932",
      "doi": "10.1145/3290605.3300932"
    },
    {
      "text": "Guo Li, Xiaomu Zhou, Tun Lu, Jiang Yang, and Ning Gu. 2016. SunForum: Understanding Depression in a Chinese Online Community. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 515--526. DOI: http://dx.doi.org/10.1145/2818048.2819994",
      "doi": "10.1145/2818048.2819994"
    },
    {
      "text": "Bernd Loewe, K Urt Kroenke, Wolfgang Herzog, and Kerstin Graefe. 2004. Measuring depression outcome with a brief self-report instrument: sensitivity to change of the Patient Health Questionnaire (PHQ-9). Journal of affective disorders 81 1 (2004), 61--6.",
      "doi": ""
    },
    {
      "text": "Ann Macaskill. 2013. The mental health of university students in the United Kingdom. British Journal of Guidance & Counselling 41, 4 (2013), 426--441. DOI: http://dx.doi.org/10.1080/03069885.2012.743110",
      "doi": ""
    },
    {
      "text": "Shery Mead, David Hilton, and Laurie Curtis. 2001. Peer Support: A Theoretical Perspective. Psychiatric rehabilitation journal 25 (02 2001), 134--41. DOI: http://dx.doi.org/10.1037/h0095032",
      "doi": ""
    },
    {
      "text": "Anne Moorhead, Diane Hazlett, Laura Harrison, Jennifer K Carroll, Anthea Irwin, and Ciska Hoving. 2013. A New Dimension of Health Care: Systematic Review of the Uses, Benefits, and Limitations of Social Media for Health Communication. Journal of medical Internet research 15 (04 2013), e85. DOI: http://dx.doi.org/10.2196/jmir.1933",
      "doi": ""
    },
    {
      "text": "Robert Morris, Stephen Schueller, and Rosalind Picard. 2015. Efficacy of a Web-Based, Crowdsourced Peer-To-Peer Cognitive Reappraisal Platform for Depression: Randomized Controlled Trial. Journal of Medical Internet Research 17 (03 2015), e72. DOI: http://dx.doi.org/10.2196/jmir.4167",
      "doi": ""
    },
    {
      "text": "Robert R. Morris, Kareem Kouddous, Rohan Kshirsagar, and Stephen Matthew Schueller. 2018. Towards an Artificially Empathic Conversational Agent for Mental Health Applications: System Design and User Perceptions. In Journal of medical Internet research.",
      "doi": ""
    },
    {
      "text": "John Naslund, Kelly Aschbrenner, LA Marsch, and Stephen Bartels. 2016. The future of mental health care: Peer-to-peer support and social media. Epidemiology and Psychiatric Sciences -1 (01 2016), 1--10. DOI: http://dx.doi.org/10.1017/S2045796015001067",
      "doi": ""
    },
    {
      "text": "Kathleen O'Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 1470--1484. DOI: http://dx.doi.org/10.1145/2998181.2998349",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Kathleen O'Leary, Stephen M. Schueller, Jacob O. Wobbrock, and Wanda Pratt. 2018. \"Suddenly, We Got to Become Therapists for Each Other\": Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 331, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173905",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "World Health Organization. 2017. Mental health: massive scale-up of resources needed if global targets are to be met. (2017). Retrieved June 12, 2019 from https://www.who.int/mental_health/evidence/atlas/ atlas_2017_web_note/en/.",
      "doi": ""
    },
    {
      "text": "Steffi Paepcke and Leila Takayama. 2010. Judging a bot by its cover: An experiment on expectation setting for personal robots. 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI) (2010), 45--52.",
      "doi": ""
    },
    {
      "text": "Sung Youl Park. 2009. An Analysis of the Technology Acceptance Model in Understanding University Students' Behavioral Intention to Use e-Learning. Educational Technology & Society 12 (07 2009), 150--162.",
      "doi": ""
    },
    {
      "text": "Zhenhui Peng, Yunhwan Kwon, Jiaan Lu, Ziming Wu, and Xiaojuan Ma. 2019. Design and Evaluation of Service Robot's Proactivity in Decision-Making Support Process. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 98, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300328",
      "doi": "10.1145/3290605.3300328"
    },
    {
      "text": "Yada Pruksachatkun, Sachin R. Pendse, and Amit Sharma. 2019. Moments of Change: Analyzing Peer-Based Cognitive Support in Online Mental Health Forums. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 64, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300294",
      "doi": "10.1145/3290605.3300294"
    },
    {
      "text": "Pushshift. 2019. Reddit Statistics - pushshift.io. (2019). Retrieved June 1, 2019 from https://pushshift.io/.",
      "doi": ""
    },
    {
      "text": "Yla R. Tausczik and James Pennebaker. 2010. The Psychological Meaning of Words: LIWC and Computerized Text Analysis Methods. Journal of Language and Social Psychology 29 (03 2010), 24--54. DOI: http://dx.doi.org/10.1177/0261927X09351676",
      "doi": ""
    },
    {
      "text": "Reddit. 2019a. Reddiquette: Please do and please don't. (2019). Retrieved September 2nd, 2019 from https://www.reddit.com/wiki/reddiquette/.",
      "doi": ""
    },
    {
      "text": "Reddit. 2019b. r/depression, a supportive space for anyone struggling with depression. (2019). Retrieved March 25, 2019 from https://www.reddit.com/r/depression/.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Alistair Morrison, and Dave Murray-Rust. 2019. Student Perspectives on Digital Phenotyping: The Acceptability of Using Smartphone Data to Assess Mental Health. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 425, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300655",
      "doi": "10.1145/3290605.3300655"
    },
    {
      "text": "Sherry Ruan, Liwei Jiang, Justin Xu, Bryce Joe-Kun Tham, Zhengneng Qiu, Yeshuang Zhu, Elizabeth L. Murnane, Emma Brunskill, and James A. Landay. 2019. QuizBot: A Dialogue-based Adaptive Learning System for Factual Knowledge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 357, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300587",
      "doi": "10.1145/3290605.3300587"
    },
    {
      "text": "Mark Salzer, Nicole Darr, Gina Calhoun, William Boyer, Randall Loss, Jerry Goessel, Edward Schwenk, and Eugene Brusilovskiy. 2013. Benefits of working as a certified peer specialist: Results from a statewide survey. Psychiatric rehabilitation journal 36 (09 2013), 219--21. DOI: http://dx.doi.org/10.1037/prj0000016",
      "doi": ""
    },
    {
      "text": "Shruti Sannon, Elizabeth L. Murnane, Natalya N. Bazarova, and Geri Gay. 2019. \"I Was Really, Really Nervous Posting It\": Communicating About Invisible Chronic Illnesses Across Social Media Platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 353, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300583",
      "doi": "10.1145/3290605.3300583"
    },
    {
      "text": "Catherine E. Schaefer, James Charles Coyne, and Richard Stanley Lazarus. 1981. The health-related functions of social support. Journal of Behavioral Medicine 4 (1981), 381--406.",
      "doi": ""
    },
    {
      "text": "Eva Sharma and Munmun De Choudhury. 2018. Mental Health Support and Its Relationship to Linguistic Accommodation in Online Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 641, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174215",
      "doi": "10.1145/3173574.3174215"
    },
    {
      "text": "Stefan Siersdorfer, Sergiu Chelaru, Wolfgang Nejdl, and Jose San Pedro. 2010. How Useful Are Your Comments?: Analyzing and Predicting Youtube Comments and Comment Ratings. In Proceedings of the 19th International Conference on World Wide Web (WWW '10). ACM, NY, NY, USA, 891--900. DOI: http://dx.doi.org/10.1145/1772690.1772781",
      "doi": "10.1145/1772690.1772781"
    },
    {
      "text": "Liuping Wang, Xiangmin Fan, Feng Tian, Lingjia Deng, Shuai Ma, Jun Huang, and Hongan Wang. 2018. mirrorU: Scaffolding Emotional Reflection via In-Situ Assessment and Interactive Feedback. In CHI Extended Abstracts.",
      "doi": ""
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A Field Trial of Privacy Nudges for Facebook. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2367--2376. DOI: http://dx.doi.org/10.1145/2556288.2557413",
      "doi": "10.1145/2556288.2557413"
    },
    {
      "text": "Yi-Chia Wang, Robert Kraut, and John M. Levine. 2012. To Stay or Leave?: The Relationship of Emotional and Informational Support to Commitment in Online Health Support Groups. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 833--842. DOI: http://dx.doi.org/10.1145/2145204.2145329",
      "doi": ""
    },
    {
      "text": "Jen-Her Wu and Shu-Ching Wang. 2005. What Drives Mobile Commerce? Inf. Manage. 42, 5 (July 2005), 719--729. DOI: http://dx.doi.org/10.1016/j.im.2004.07.001",
      "doi": ""
    },
    {
      "text": "Shaomei Wu, Lindsay Reynolds, Xian Li, and Francisco Guzmán. 2019. Design and Evaluation of a Social Media Writing Support Tool for People with Dyslexia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 516, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300746",
      "doi": "10.1145/3290605.3300746"
    },
    {
      "text": "Diyi Yang, Robert Kraut, and John M. Levine. 2017. Commitment of Newcomers and Old-timers to Online Health Support Communities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6363--6375. DOI: http://dx.doi.org/10.1145/3025453.3026008",
      "doi": ""
    },
    {
      "text": "Diyi Yang, Robert E. Kraut, Tenbroeck Smith, Elijah Mayfield, and Dan Jurafsky. 2019a. Seekers, Providers, Welcomers, and Storytellers: Modeling Social Roles in Online Health Communities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 344, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300574",
      "doi": "10.1145/3290605.3300574"
    },
    {
      "text": "Diyi Yang, Zheng Yao, Joseph Seering, and Robert Kraut. 2019b. The Channel Matters: Self-disclosure, Reciprocity and Social Support in Online Cancer Support Groups. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 31, 15 pages. DOI: http://dx.doi.org/10.1145/3290605.3300261",
      "doi": "10.1145/3290605.3300261"
    }
  ]
}