{
  "doi": "10.1145/3313831.3376472",
  "title": "Towards Inclusive External Communication of Autonomous Vehicles for Pedestrians with Vision Impairments",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "People with vision impairments (VIP) are among the most vulnerable road users in traffic. Autonomous vehicles are believed to reduce accidents but still demand some form of external communication signaling relevant information to pedestrians. Recent research on the design of vehicle-pedestrian communication (VPC) focuses strongly on concepts for a non-disabled population. Our work presents an inclusive user-centered design for VPC, beneficial for both vision impaired and seeing pedestrians. We conducted a workshop with VIP (N=6), discussing current issues in road traffic and comparing communication concepts proposed by literature. A thematic analysis unveiled two important themes: number of communicating vehicles and content (affecting duration). Subsequently, we investigated these in a second user study in virtual reality (N=33, 8 VIP) comparing the VPC between groups of abilities. We found that trust and understanding is enhanced and cognitive load reduced when all relevant vehicles communicate; high content messages also reduce cognitive load.",
  "authors": [
    {
      "name": "Mark Colley",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-99659260328/rel-imgonly/img_6166.jpg",
      "acmid": "99659260328",
      "orcid": "0000-0001-5207-5029"
    },
    {
      "name": "Marcel Walch",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557244156",
      "orcid": "missing"
    },
    {
      "name": "Jan Gugenheimer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Ali Askari",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526891",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Regulation No. 540/2014. 2014. Regulation (EU) No 540/2014 of the European Parliament and of the Council of 16 April 2014 on the sound level of motor vehicles and of replacement silencing systems, and amending Directive 2007/46/EC and repealing Directive 70/157/EEC Text with EEA relevance. (2014).",
      "doi": ""
    },
    {
      "text": "Claudia Ackermann, Matthias Beggiato, Sarah Schubert, and Josef F Krems. 2019. An experimental study to investigate design and assessment criteria: what is important for communication between pedestrians and automated vehicles? Applied ergonomics 75 (2019), 272--282.",
      "doi": ""
    },
    {
      "text": "Afnen Arfaoui, Geoffrey Edwards, Ernesto Morales, and Patrick Fougeyrollas. 2019. Understanding risk in daily life of diverse persons with physical and sensory impairments. Journal of Accessibility and Design for All 9, 1 (2019), 66--89.",
      "doi": ""
    },
    {
      "text": "Daniel H Ashmead, David Guth, Robert S Wall, Richard G Long, and Paul E Ponchillia. 2005. Street crossing by sighted and blind pedestrians at a modern roundabout. Journal of Transportation Engineering 131, 11 (2005), 812--821.",
      "doi": ""
    },
    {
      "text": "Pavlo Bazilinskyy, Dimitra Dodou, and JCF De Winter. 2019. Survey on eHMI concepts: The effect of text, color, and perspective. Manuscript submitted for publication (2019).",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a frame for assistive technology research and design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 161--173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Marc-Philipp Böckle, Anna Pernestål Brenden, Maria Klingegård, Azra Habibovic, and Martijn Bout. 2017. SAV2P: Exploring the Impact of an Interface for Shared Automated Vehicles on Pedestrians' Experience. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct. ACM, 136--140.",
      "doi": "10.1145/3131726.3131765"
    },
    {
      "text": "Jelte E Bos, Scott N MacKinnon, and Anthony Patterson. 2005. Motion sickness symptoms in a ship motion simulator: effects of inside, outside, and no view. Aviation, space, and environmental medicine 76, 12 (2005), 1111--1118.",
      "doi": ""
    },
    {
      "text": "Rupert RA Bourne, Seth R Flaxman, Tasanee Braithwaite, Maria V Cicinelli, Aditi Das, Jost B Jonas, Jill Keeffe, John H Kempen, Janet Leasher, Hans Limburg, and others. 2017. Magnitude, temporal trends, and projections of the global prevalence of blindness and distance and near vision impairment: a systematic review and meta-analysis. The Lancet Global Health 5, 9 (2017), e888--e897.",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1 (1994), 49--59.",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. The invisible work of accessibility: how blind employees manage accessibility in mixed-ability workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 163--171.",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Robin N Brewer and Vaishnav Kameswaran. 2018. Understanding the power of control in autonomous vehicles for people with vision impairment. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 185--197.",
      "doi": "10.1145/3234695.3236347"
    },
    {
      "text": "Christopher G Burns, Luis Oliveira, Peter Thomas, Sumeet Iyer, and Stewart Birrell. 2019. Pedestrian Decision-Making Responses to External Human-Machine Interface Designs for Autonomous Vehicles. In 2019 IEEE Intelligent Vehicles Symposium (IV). IEEE, 70--75.",
      "doi": ""
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Takeo Igarashi, Masahiro Miyata, and Yasuhiro Kobayashi. 2018. A Video-based Study Comparing Communication Modalities between an Autonomous Car and a Pedestrian. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 104--109.",
      "doi": "10.1145/3239092.3265950"
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Daisuke Sakamoto, and Takeo Igarashi. 2017. Eyes on a Car: an Interface Design for Communication between an Autonomous Car and a Pedestrian. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 65--73.",
      "doi": "10.1145/3122986.3122989"
    },
    {
      "text": "Vicky Charisi, Azra Habibovic, Jonas Andersson, Jamy Li, and Vanessa Evers. 2017. Children's views on identification and intention communication of self-driving vehicles. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 399--404.",
      "doi": "10.1145/3078072.3084300"
    },
    {
      "text": "Michael Clamann, Miles Aubert, and Mary L. Cummings. 2017. Evaluation of Vehicle-to-Pedestrian Communication Displays for Autonomous Vehicles. Evaluation of vehicle-to-pedestrian communication displays for autonomous vehicles (2017).",
      "doi": ""
    },
    {
      "text": "Mark Colley, Marcel Walch, and Enrico Rukzio. 2019. For a Better (Simulated) World: Considerations for VR in External Communication Research. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings (AutomotiveUI '19). Association for Computing Machinery, New York, NY, USA, 442--449. DOI: http://dx.doi.org/10.1145/3349263.3351523",
      "doi": "10.1145/3349263.3351523"
    },
    {
      "text": "BR Connell, M Jones, R Mace, J Mueller, A Mullick, E Ostroff, J Sanford, E Steinfeld, M Story, and G Vanderheiden. 1997. The principles of universal design, Version 2.0, Raleigh, NC. Center for Universal Design, North Carolina State University (1997).",
      "doi": ""
    },
    {
      "text": "Koen de Clercq, Andre Dietrich, Juan Pablo Nunez Velasco, Joost de Winter, and Riender Happee. 2019. External Human-Machine Interfaces on Automated Vehicles: Effects on Pedestrian Crossing Decisions. Human factors (2019), 0018720819836343.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W Carruth, Muztaba Fuad, Laura M Stanley, and Darren Frey. 2019. Comparison of Child and Adult Pedestrian Perspectives of External Features on Autonomous Vehicles Using Virtual Reality Experiment. In International Conference on Applied Human Factors and Ergonomics. Springer, 145--156.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Lesley J. Strawderman, and Daniel W. Carruth. 2018. Investigating pedestrian suggestions for external features on fully autonomous vehicles: A virtual reality experiment. Transportation research part F: traffic psychology and behaviour 59 (2018), 135--149.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, B. Warner, S. Poudel, and S. Bhandari. 2016. Identification of external design preferences in autonomous vehicles. In Proc. IIE Res. Conf. 69--44.",
      "doi": ""
    },
    {
      "text": "BMW Deutschland. 2016. Der BMW Vision M NEXT. (Sound by Hans Zimmer). https://www.youtube.com/watch?v=vFS2HvlHTp4. (2016). [Online; Accessed: 18-JULY-2019].",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Marieke Martens, Berry Eggen, and Jacques Terken. 2017. The impact of vehicle appearance and vehicle behavior on pedestrian interaction with autonomous vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct. ACM, 158--162.",
      "doi": "10.1145/3131726.3131750"
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques MB Terken. 2018. Interface Concepts for Intent Communication from Autonomous Vehicles to Vulnerable Road Users.. In AutomotiveUI (adjunct). 82--86.",
      "doi": ""
    },
    {
      "text": "Debargha Dey and Jacques Terken. 2017. Pedestrian interaction with vehicles: roles of explicit and implicit communication. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 109--113.",
      "doi": "10.1145/3122986.3123009"
    },
    {
      "text": "Addison Duvall. Accessed September 11, 2019. 5 Problems With 'Universal' Design. https://www.hongkiat.com/blog/universal-design-problems/.",
      "doi": ""
    },
    {
      "text": "Mica R Endsley. 2017. Toward a theory of situation awareness in dynamic systems. In Situational Awareness. Routledge, 9--42.",
      "doi": ""
    },
    {
      "text": "Daniel J Fagnant and Kara Kockelman. 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transportation Research Part A: Policy and Practice 77 (2015), 167--181.",
      "doi": ""
    },
    {
      "text": "Paulo Eduardo Kirrian Fiedler and Paulo Henrique Trombetta Zannin. 2015. Evaluation of noise pollution in urban traffic hubs-Noise maps and measurements. Environmental Impact Assessment Review 51 (2015), 1--9.",
      "doi": ""
    },
    {
      "text": "Evelyn Florentine, Mark Adam Ang, Scott Drew Pendleton, Hans Andersen, and Marcelo H. Ang Jr. 2016. Pedestrian notification methods in autonomous vehicles for multi-class mobility-on-demand service. In Proceedings of the Fourth International Conference on Human Agent Interaction. ACM, 387--392.",
      "doi": ""
    },
    {
      "text": "Lex Fridman, Bruce Mehler, Lei Xia, Yangyang Yang, Laura Yvonne Facusse, and Bryan Reimer. 2017. To walk or not to walk: Crowdsourced assessment of external vehicle-to-pedestrian displays. arXiv preprint arXiv:1707.02698 (2017).",
      "doi": ""
    },
    {
      "text": "Dominic Furniss, Ann Blandford, and Paul Curzon. 2011. Confessions from a grounded theory PhD: experiences and lessons learnt. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 113--122.",
      "doi": "10.1145/1978942.1978960"
    },
    {
      "text": "Pedram Gharani and Hassan A Karimi. 2017. Context-aware obstacle detection for navigation by visually impaired. Image and Vision Computing 64 (2017), 103--115.",
      "doi": "10.1016/j.imavis.2017.06.002"
    },
    {
      "text": "Hilke Groenewold. 2009. DIN 32975 - Kontraste. https://nullbarriere.de/din32975.htm. (2009). [Online; Accessed: 13-JULY-2019].",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139--183.",
      "doi": ""
    },
    {
      "text": "Shirin E Hassan. 2012. Are normally sighted, visually impaired, and blind pedestrians accurate and reliable at making street crossing decisions? Investigative ophthalmology & visual science 53, 6 (2012), 2593--2600.",
      "doi": ""
    },
    {
      "text": "Abdelsalam Helal, Steven Edwin Moore, and Balaji Ramachandran. 2001. Drishti: An integrated navigation system for visually impaired and disabled. In Proceedings fifth international symposium on wearable computers. IEEE, 149--156.",
      "doi": ""
    },
    {
      "text": "Christopher R. Hudson, Shuchisnigdha Deb, Daniel W. Carruth, John McGinley, and Darren Frey. 2018. Pedestrian Perception of Autonomous Vehicles with External Interacting Features. In International Conference on Applied Human Factors and Ergonomics. Springer, 33--39.",
      "doi": ""
    },
    {
      "text": "Ahmed Hussein, Fernando Garcia, Jose Maria Armingol, and Cristina Olaverri-Monreal. 2016. P2V and V2P Communication for Pedestrian Warning on the basis of Autonomous Vehicles. In 2016 IEEE 19th International Conference on Intelligent Transportation Systems (ITSC). IEEE, 2034--2039.",
      "doi": "10.1109/ITSC.2016.7795885"
    },
    {
      "text": "ISO/TR 23049:2018 2018. Road Vehicles: Ergonomic Aspects of External Visual Communication from Automated Vehicles to Other Road Users. Standard. International Organization for Standardization.",
      "doi": ""
    },
    {
      "text": "Volodymyr Ivanchenko, James Coughlan, and Huiying Shen. 2008. Crosswatch: a camera phone system for orienting visually impaired pedestrians at traffic intersections. In International Conference on Computers for Handicapped Persons. Springer, 1122--1128.",
      "doi": "10.1007/978-3-540-70540-6_168"
    },
    {
      "text": "Moritz Körber. 2018. Theoretical considerations and development of a questionnaire to measure trust in automation. In Congress of the International Ergonomics Association. Springer, 13--30.",
      "doi": ""
    },
    {
      "text": "Athanasios Koutsoklenis and Konstantinos Papadopoulos. 2011. Auditory cues used for wayfinding in urban environments by individuals with visual impairments. Journal of Visual Impairment & Blindness 105, 10 (2011), 703--714.",
      "doi": ""
    },
    {
      "text": "Tobias Lagstrom and Victor Malmsten Lundgren. 2015. AVIP-Autonomous vehicles interaction with pedestrians. Master of Science Thesis, Chalmers University of Technology (2015).",
      "doi": ""
    },
    {
      "text": "Yeti Li, Murat Dikmen, Thana G. Hussein, Yahui Wang, and Catherine Burns. 2018. To cross or not to cross: Urgency-based external warning displays on autonomous vehicles to improve pedestrian crossing safety. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 188--197.",
      "doi": "10.1145/3239060.3239082"
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How Should Automated Vehicles Interact with Pedestrians?: A Comparative Analysis of Interaction Concepts in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 262--274.",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Victor Malmsten Lundgren, Azra Habibovic, Jonas Andersson, Tobias Lagström, Maria Nilsson, Anna Sirkka, Johan Fagerlönn, Rikard Fredriksson, Claes Edgren, and Stas Krupenia. 2017. Will there be new communication needs when introducing automated vehicles to the urban context? Springer, 485--497.",
      "doi": ""
    },
    {
      "text": "Karthik Mahadevan, Elaheh Sanoubari, Sowmya Somanath, James E Young, and Ehud Sharlin. 2019. AV-Pedestrian Interaction Design Using a Pedestrian Mixed Traffic Simulator. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 475--486.",
      "doi": "10.1145/3322276.3322328"
    },
    {
      "text": "Karthik Mahadevan, Sowmya Somanath, and Ehud Sharlin. 2018. Communicating awareness and intent in autonomous vehicle-pedestrian interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 429.",
      "doi": "10.1145/3173574.3174003"
    },
    {
      "text": "Milecia Matthews, Girish Chowdhary, and Emily Kieson. 2017. Intent communication between autonomous vehicles and pedestrians. arXiv preprint arXiv:1708.07123 (2017).",
      "doi": ""
    },
    {
      "text": "Natasha Merat, Tyron Louw, Ruth Madigan, Marc Wilbrink, and Anna Schieben. 2018. What externally presented information do VRUs require when interacting with fully Automated Road Transport Systems in shared space? Accident Analysis & Prevention 118 (2018), 244--252.",
      "doi": ""
    },
    {
      "text": "Nicole Mirnig, Nicole Perterer, Gerald Stollnberger, and Manfred Tscheligi. 2017. Three strategies for autonomous car-to-pedestrian communication: A survival guide. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 209--210.",
      "doi": "10.1145/3029798.3038402"
    },
    {
      "text": "Ingunn Moser. 2005. On becoming disabled and articulating alternatives: The multiple modes of ordering disability and their interferences. Cultural Studies 19, 6 (2005), 667--700.",
      "doi": ""
    },
    {
      "text": "Taylor A Nelson, Andrew A Abeyta, and Clay Routledge. 2019. What makes life meaningful for theists and atheists? Psychology of Religion and Spirituality (2019).",
      "doi": ""
    },
    {
      "text": "Alan F Newell and Peter Gregor. 2000. 'User sensitive inclusive design\"-in search of a new paradigm. In Proceedings on the 2000 conference on Universal Usability. ACM, 39--44.",
      "doi": "10.1145/355460.355470"
    },
    {
      "text": "Kimihiro Noguchi, Yulia R Gel, Edgar Brunner, and Frank Konietschke. 2012. nparLD: an R software package for the nonparametric analysis of longitudinal data in factorial experiments. Journal of Statistical Software 50, 12 (2012).",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2018. Blindness and vision impairment. https://www.who.int/newsroom/fact-sheets/detail/blindness-and-visual-impairment. (2018). [Online; accessed: 07-JUNE-2019].",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. Deafness and hearing loss. https://www.who.int/ news-room/fact-sheets/detail/deafness-and-hearing-loss. (2019). [Online; accessed: 07-SEPTEMBER-2019].",
      "doi": ""
    },
    {
      "text": "Amir Rasouli, Iuliia Kotseruba, and John K Tsotsos. 2017. Understanding pedestrian behavior in complex traffic scenes. IEEE Transactions on Intelligent Vehicles 3, 1 (2017), 61--70.",
      "doi": ""
    },
    {
      "text": "Amir Rasouli and John K Tsotsos. 2019. Autonomous vehicles that interact with pedestrians: A survey of theory and practice. IEEE Transactions on Intelligent Transportation Systems (2019).",
      "doi": ""
    },
    {
      "text": "Ulrike Rau. 2019. Zwei-Sinne-Prinzip. https://nullbarriere.de/rau-barrierefrei-bauen-zwei-sinneprinzip.htm. (2019). [Online; Accessed: 18-JULY-2019].",
      "doi": ""
    },
    {
      "text": "Michael Rettenmaier, Moritz Pietsch, Jonas Schmidtler, and Klaus Bengler. 2019. Passing through the Bottleneck-The Potential of External Human-Machine Interfaces. In 2019 IEEE Intelligent Vehicles Symposium (IV). IEEE, 1687--1692.",
      "doi": ""
    },
    {
      "text": "Ryan L Robart and Lawrence D Rosenblum. 2009. Are hybrid cars too quiet? The Journal of the Acoustical Society of America 125, 4 (2009), 2744--2744.",
      "doi": ""
    },
    {
      "text": "Manaswi Saha, Alexander J Fiannaca, Melanie Kneisel, Edward Cutrell, and Meredith Ringel Morris. 2019. Closing the Gap: Designing for the Last-Few-Meters Wayfinding Problem for People with Visual Impairments. (2019).",
      "doi": ""
    },
    {
      "text": "Avilash Sahoo, Santosha K. Dwivedy, and P.S. Robi. 2019. Advancements in the field of autonomous underwater vehicle. Ocean Engineering 181 (2019), 145 -- 160. DOI: http://dx.doi.org/https://doi.org/10.1016/j.oceaneng.2019.04.011",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Sarah Schmidt and B Färber. 2009. Pedestrians at the kerb--Recognising the action intentions of humans. Transportation research part F: traffic psychology and behaviour 12, 4 (2009), 300--310.",
      "doi": ""
    },
    {
      "text": "JJ Scott and Robert Gray. 2008. A comparison of tactile, visual, and auditory warnings for rear-end collision prevention in simulated driving. Human factors 50, 2 (2008), 264--275.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 705--714.",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Andreas Sieß, Kathleen Hübel, Daniel Hepperle, Andreas Dronov, Christian Hufnagel, Julia Aktun, and Matthias Wölfel. 2015. Hybrid City Lighting-Improving Pedestrians' Safety through Proactive Street Lighting. In 2015 International Conference on Cyberworlds (CW). IEEE, 46--49.",
      "doi": "10.1109/CW.2015.51"
    },
    {
      "text": "Ye Eun Song, Christian Lehsing, Tanja Fuest, and Klaus Bengler. 2018. External HMIs and their effect on the interaction between pedestrians and automated vehicles. In International Conference on Intelligent Human Systems Integration. Springer, 13--18.",
      "doi": ""
    },
    {
      "text": "Laerd statistics. 2016. Mixed ANOVA using SPSS Statistics. https://statistics.laerd.com/ spss-tutorials/mixed-anova-using-spss-statistics.php. (2016). [Online; Accessed: 12-SEPTEMBER-2019].",
      "doi": ""
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2009. Estimation of detection thresholds for redirected walking techniques. IEEE transactions on visualization and computer graphics 16, 1 (2009), 17--27.",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Klaas-Jan Stol, Paul Ralph, and Brian Fitzgerald. 2016. Grounded theory in software engineering research: a critical review and guidelines. In 2016 IEEE/ACM 38th International Conference on Software Engineering (ICSE). IEEE, 120--131.",
      "doi": "10.1145/2884781.2884833"
    },
    {
      "text": "Helena Strömberg, Ingrid Pettersson, Jonas Andersson, Annie Rydström, Debargha Dey, Maria Klingegård, and Jodi Forlizzi. 2018. Designing for social experiences with and within autonomous vehicles--exploring methodological directions. Design Science 4 (2018).",
      "doi": ""
    },
    {
      "text": "Alireza Talebpour and Hani S Mahmassani. 2016. Influence of connected and autonomous vehicles on traffic flow stability and throughput. Transportation Research Part C: Emerging Technologies 71 (2016), 143--163.",
      "doi": ""
    },
    {
      "text": "Arenda F te Velde, John van der Kamp, José A Barela, and Geert JP Savelsbergh. 2005. Visual timing and adaptive behavior in a road-crossing simulation study. Accident Analysis & Prevention 37, 3 (2005), 399--406.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Cynthia L Bennett, Cecily Morrison, Edward Cutrell, and Alex S Taylor. 2018. I can do everything but see!--How People with Vision Impairments Negotiate their Abilities in Social Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 203.",
      "doi": "10.1145/3173574.3173777"
    },
    {
      "text": "Jean Toner. 2009. Small is not too small: Reflections concerning the validity of very small focus groups (VSFGs). Qualitative Social Work 8, 2 (2009), 179--192.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2019. Unity. (2019). https://unity.com/",
      "doi": ""
    },
    {
      "text": "Himanshu Verma, Guillaume Pythoud, Grace Eden, Denis Lalanne, and Florian Evéquoz. 2019. Pedestrians and Visual Signs of Intent: Towards Expressive Autonomous Passenger Shuttles. 3 (09 2019), 107:1. DOI: http://dx.doi.org/10.1145/3351265",
      "doi": "10.1145/3351265"
    },
    {
      "text": "Annette Werner. 2019. New colours for autonomous driving: An evaluation of chromaticities for the external lighting equipment of autonomous vehicles. Colour Turn 1 (2019).",
      "doi": ""
    },
    {
      "text": "WR Wiener and G Lawson. 1997. The use of traffic sounds to make street crossings by persons who are visually impaired. Journal of Visual Impairment & Blindness 91, 5 (1997).",
      "doi": ""
    },
    {
      "text": "Michele A Williams, Caroline Galbraith, Shaun K Kane, and Amy Hurst. 2014. Just let the cane hit it: how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 217--224.",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Michele A Williams, Amy Hurst, and Shaun K Kane. 2013. Pray before you step out: describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 28.",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Scooter Willis and Sumi Helal. 2005. RFID information grid for blind navigation and wayfinding. In Ninth IEEE International Symposium on Wearable Computers (ISWC'05). IEEE, 34--37.",
      "doi": "10.1109/ISWC.2005.46"
    },
    {
      "text": "Jacob O Wobbrock, Shaun K Kane, Krzysztof Z Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-based design: Concept, principles and examples. ACM Transactions on Accessible Computing (TACCESS) 3, 3 (2011), 9.",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Su Yang. 2017. Driver behavior impact on pedestrians' crossing experience in the conditionally autonomous driving context. (2017).",
      "doi": ""
    },
    {
      "text": "Jingyi Zhang, Erik Vinkhuyzen, and Melissa Cefkin. 2017. Evaluation of an autonomous vehicle external communication system concept: a survey study. In International Conference on Applied Human Factors and Ergonomics. Springer, 650--661.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Cynthia L Bennett, Hrvoje Benko, Edward Cutrell, Christian Holz, Meredith Ringel Morris, and Mike Sinclair. 2018. Enabling People with Visual Impairments to Navigate Virtual Reality with a Haptic and Auditory Cane Simulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 116.",
      "doi": "10.1145/3173574.3173690"
    },
    {
      "text": "Raphael Zimmermann and Reto Wettach. 2017. First step into visceral interaction with autonomous vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 58--64.",
      "doi": "10.1145/3122986.3122988"
    }
  ]
}