{
  "doi": "10.1145/3313831.3376716",
  "title": "Feminist Living Labs as Research Infrastructures for HCI: The Case of a Video Game Company",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "The number of women in IT is still low and companies struggle to integrate female professionals. The aim of our research is to provide methodological support for understanding and sharing experiences of gendered practices in the IT industry and encouraging sustained reflection about these matters over time. We established a Living Lab with that end in view, aiming to enhance female participation in the IT workforce and committing ourselves to a participatory approach to the sharing of women's experiences. Here, using the case of a German video game company which participated in our Lab, we detail our lessons learned. We show that this kind of long-term participation involves challenges over the lifetime of the project but can lead to substantial benefits for organizations. Our findings demonstrate that Living Labs are suitable for giving voice to marginalized groups, addressing their concerns and evoking change possibilities. Nevertheless, uncertainties about long-term sustainability remain.",
  "tags": [
    "participatory action research",
    "methodology",
    "ethnography",
    "feminist HCI",
    "feminist research",
    "gender",
    "living lab"
  ],
  "authors": [
    {
      "name": "Michael Ahmadi",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235366",
      "orcid": "missing"
    },
    {
      "name": "Rebecca Eilert",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474815",
      "orcid": "missing"
    },
    {
      "name": "Anne Weibert",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81464675689",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    },
    {
      "name": "Nicola Marsden",
      "institution": "Heilbronn University, Heilbronn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414621160",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joan Acker. 2006. Inequality regimes: Gender, class, and race in organizations. Gend. Soc. 20, 4 (2006), 441--464.",
      "doi": ""
    },
    {
      "text": "Joan Acker, Kate Barry, and Joke Esseveld. 1983. Objectivity and Truth: Problems in Doing Feminist Research. In Women's Studies International Forum, Elsevier, 423--435.",
      "doi": ""
    },
    {
      "text": "Michael Ahmadi, Rebecca Eilert, Anne Weibert, Volker Wulf, and Nicola Marsden. 2019. Hacking Masculine Cultures - Career Ambitions of Female Young Professionals in a Video Game Company. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19), ACM, NY, NY, USA, 413--426. DOI: https://doi.org/10.1145/3311350.3347186",
      "doi": "10.1145/3311350.3347186"
    },
    {
      "text": "Michael Ahmadi, Rebecca Eilert, Weibert, Anne, Volker Wulf, and Nicola Marsden. 2020. \"We want to push the industry via communication\"? Designing Communication Measures to Foster Gender Diversity in a Video Game Company. Proc. ACM Hum.-Comput. Interact. 4, GROUP (2020), 26. DOI: https://doi.org/10.1145/3375196",
      "doi": "10.1145/3375196"
    },
    {
      "text": "Michael Ahmadi, Anne Weibert, Corinna Ogonowski, Konstantin Aal, Kristian Gäckle, Nicola Marsden, and Volker Wulf. 2018. Challenges and lessons learned by applying living labs in gender and IT contexts. In Proceedings of the 4th Conference on Gender & IT, ACM, 239--249.",
      "doi": "10.1145/3196839.3196878"
    },
    {
      "text": "Lauren Alfrey and France Winddance Twine. 2017. Gender-Fluid Geek Girls: Negotiating Inequality Regimes in the Tech Industry. Gend. Soc. 31, 1 (February 2017), 28--50. DOI: https://doi.org/ 10.1177/0891243216680590",
      "doi": ""
    },
    {
      "text": "Esteve Almirall and Jonathan Wareham. 2008. Living Labs and Open Innovation: Roles and Applicability. Electron. J. Virtual Organ. Netw. 10, (2008).",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), ACM, New York, 1301--1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell. 2014. Utopias of Participation: Design, Criticality, and Emancipation. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC '14 - volume 2, ACM Press, Windhoek, Namibia, 189--190. DOI: https://doi.org/10.1145/2662155.2662213",
      "doi": "10.1145/2662155.2662213"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. 29th Annu. CHI Conf. Hum. Factors Comput. Syst. (2011), 675--684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Tone Bratteteig. 2002. Bringing Gender Issues to Technology Design. In Feminist Challenges in the Information Age. VS Verlag für Sozialwissenschaften, Wiesbaden, 91--105. DOI: https://doi.org/10.1007/978--3--322--94954--7_8",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qual. Res. Psychol. 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Rebecca Campbell and Sharon M Wasco. 2000. Feminist approaches to social science: Epistemological and methodological tenets. Am. J. Community Psychol. 28, 6 (2000), 773--791.",
      "doi": ""
    },
    {
      "text": "Justine Cassell. 2003. Genderizing HCI. In The Human-computer Interaction Handbook, Julie A. Jacko and Andrew Sears (eds.). L. Erlbaum Associates Inc., Hillsdale, NJ, USA, 401--412. Retrieved March 18, 2019 from http://dl.acm.org/citation.cfm?id=772072.772100",
      "doi": ""
    },
    {
      "text": "Sapna Cheryan, Allison Master, and Andrew N. Meltzoff. 2015. Cultural Stereotypes as Gatekeepers: Increasing Girls' Interest in Computer Science and Engineering by Diversifying Stereotypes. Front. Psychol. 6, (2015).",
      "doi": ""
    },
    {
      "text": "Jack Clark. 2016. Artificial Intelligence Has a 'Sea of Dudes' Problem. Retrieved March 11, 2019 from https://www.bloomberg.com/news/articles/2016-0623/artificial-intelligence-has-a-sea-of-dudes-problem",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins and Sirma Bilge. 2016. Intersectionality. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Angelo Corallo, Maria Elena Latino, and Grazia Neglia. 2013. Methodology for User-Centered Innovation in Industrial Living Lab. ISRN Ind. Eng. 2013, (2013), 1--8. DOI: https://doi.org/10.1155/ 2013/131596",
      "doi": ""
    },
    {
      "text": "Caroline Criado Perez. 2019. Invisible Women: Exposing data bias in a world designed for men. Chattoo & Windus, London.",
      "doi": ""
    },
    {
      "text": "Barbara Czarniawska. 1997. A narrative approach to organization studies. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Juri Dachtera, Dave Randall, and Volker Wulf. 2014. Research on Research: Design Research at the Margins: Academia, Industry and End-Users. 713--722. DOI: https://doi.org/10.1145/2556288.2557261",
      "doi": ""
    },
    {
      "text": "Claudio Dell'Era and Paolo Landoni. 2014. Living Lab: A Methodology between User-Centred Design and Participatory Design: Living Lab. Creat. Innov. Manag. 23, 2 (2014), 137--154. DOI: https://doi.org/ 10.1111/caim.12061",
      "doi": ""
    },
    {
      "text": "Marjorie L DeVault and Chrys Ingraham. 1999. Metaphors of silence and voice in feminist thought. In Liberating method: feminism and social research, Marjorie L DeVault (ed.). Temple University Press, Philadelphia, Pennsylvania, 175--186.",
      "doi": ""
    },
    {
      "text": "Marjorie L DeVault and Liza McCoy. 2004. Institutional Ethnography: Using Interviews to Investigate Ruling. Crit. Strateg. Soc. Res. (2004), 191.",
      "doi": ""
    },
    {
      "text": "Catherine D'Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: \"When I First Saw a Breast Pump I Was Wondering if It Was a Joke.\" In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), ACM, NY, NY, USA, 2612--2622. DOI: https://doi.org/10.1145/2858036.2858460",
      "doi": ""
    },
    {
      "text": "Bonnie Thornton Dill and Marla H Kohlman. 2012. Intersectionality: A transformative paradigm in feminist theory and social justice. Handb. Fem. Res. Theory Prax. 2, (2012), 154--174.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. In Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM, 541--550.",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Rosalind Edwards and Melanie Mauthner. 2002. Ethics and Feminist Research: Theory and Practice. In Ethics in Qualitative Research, Melanie Mauthner, Maxine Birch, Julie Jessop and Tina Miller (eds.). 14--31.",
      "doi": ""
    },
    {
      "text": "Mónica E. Edwards-Schachter, Cristian E. Matti, and Enrique Alcántara. 2012. Fostering Quality of Life through Social Innovation: A Living Lab Methodology Study Case: Social Innovation and Living Labs. Rev. Policy Res. 29, 6 (November 2012), 672--692. DOI: https://doi.org/10.1111/j.15411338.2012.00588.x",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 1993. Scandinavian Design: On Participation and Skill. In Participatory Design: Principles and Practices, Douglas Schuler and Aki Namioka (eds.). CRC Press, Boca Raton, 41--77.",
      "doi": ""
    },
    {
      "text": "Mats Eriksson and Seija Kulkki. 2005. State-of-the-Art in Utilizing Living Labs Approach to User-centric ICT Innovation -- A European Approach. Lulea: Center for Distance-Spanning Technology. Retrieved from http://84.88.32.6/openlivinglabs/documents/SOA_LivingLabs.pdf",
      "doi": ""
    },
    {
      "text": "Kim Etherington. 2004. Becoming a reflexive researcher: Using our selves in research. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Clare Farquhar and Rita Das. 1999. Are focus groups suitable for 'sensitive' topics. In Developing focus group research, Rosaline Barbour and Jenny Kitzinger (eds.). SAGE, London, 47--63.",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Shannon Morrison, and Amy S. Bruckman. 2016. An Archive of Their Own: A Case Study of Feminist HCI and Values in Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), ACM, NY, NY, USA, 2574--2585. DOI: https://doi.org/10.1145/2858036.2858409",
      "doi": "10.1145/2858036.2858409"
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), ACM, NY, NY, USA, 56--68. DOI: https://doi.org/10.1145/2675133.",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Wendy Frisby, Patricia Maguire, and Colleen Reid. 2009. The 'f' word has everything to do with it: How feminist theories inform action research. Action Res. 7, 1 (March 2009), 13--29. DOI: https://doi.org/ 10.1177/1476750308099595",
      "doi": ""
    },
    {
      "text": "Bev Gatenby and Maria Humphries. 2000. Feminist Participatory Action Research: Methodological and Ethical Issues. In Women's Studies International Forum, Elsevier, 89--105.",
      "doi": ""
    },
    {
      "text": "Con Gottfredson and Bob Mosher. 2011. Innovative performance support: Strategies and practices for learning in the workflow. McGraw Hill Professional.",
      "doi": ""
    },
    {
      "text": "Martyn Hammersley. 2004. Action research: a contradiction in terms? Oxf. Rev. Educ. 30, 2 (June 2004), 165--181. DOI: https://doi.org/10.1080/0305498042000215502",
      "doi": ""
    },
    {
      "text": "Martyn Hammersley. 2007. Educational research and evidence-based practice. SAGE, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Fem. Stud. 14, 3 (1988), 575-- 599.",
      "doi": ""
    },
    {
      "text": "Sandra Harding. 1986. The Science Question in Feminism. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Cedric Herring. 2009. Does Diversity Pay?: Race, Gender, and the Business Case for Diversity. Am. Sociol. Rev. 74, 2 (2009), 208--224.",
      "doi": ""
    },
    {
      "text": "Allen Higgins and Stefan Klein. 2011. Introduction to the Living Lab Approach. In Accelerating Global Supply Chains with IT-Innovation, Yao-Hua Tan, Niels Björn-Andersen, Stefan Klein and Boriana Rukanova (eds.). Springer, Berlin & Heidelberg, 31-- 36. DOI: https://doi.org/10.1007/978--3--642--156694_2",
      "doi": ""
    },
    {
      "text": "Karen Holtzblatt and Nicola Marsden. 2018. Retaining Women in Technology. In 2018 IEEE International Conference on Engineering, Technology and Innovation (ICE/ITMC), IEEE, 148-- 155.",
      "doi": ""
    },
    {
      "text": "Sara Kindon, Rachel Pain, and Mike Kesby. 2008. Participatory action research. In International encyclopaedia of human geography. Elsevier, 90--95.",
      "doi": ""
    },
    {
      "text": "Seppo Leminen and Mika Westerlund. 2012. Towards innovation in Living Labs networks. Int. J. Prod. Dev. 17, 1--2 (2012), 43--59.",
      "doi": ""
    },
    {
      "text": "Benedikt Ley, Corinna Ogonowski, Mu Mu, Jan Hess, Nicholas Race, David Randall, Mark Rouncefield, and Volker Wulf. 2015. At Home with Users: A Comparative View of Living Labs. Interact. Comput. 27, 1 (2015), 21--35.",
      "doi": ""
    },
    {
      "text": "Sara Logghe, Bastiaan Baccarne, and Dimitri Schuurman. 2014. An Exploration of User Motivations for Participation in Living Labs. In ISPIM Conference Proceedings, The International Society for Professional Innovation Management (ISPIM), 1.",
      "doi": ""
    },
    {
      "text": "Patricia Maguire. 1996. Proposing a More Feminist Participatory Research: Knowing and Being Embraced Openly. Particip. Res. Health Issues Exp. (1996), 27--39.",
      "doi": ""
    },
    {
      "text": "Patricia Maguire. 2001. Uneven Ground: Feminisms and Action Research. In Handbook of action research: participative inquiry and practice, Peter Reason and Hilary Bradbury (eds.). SAGE, London, 59--69. Retrieved March 12, 2019 from https://nls.ldls.org.uk/welcome.html?ark:/81055/vdc_ 100025506362.0x000001",
      "doi": ""
    },
    {
      "text": "Nicola Marsden. 2014. Doing gender in input fields. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14, ACM Press, Toronto, Ontario, Canada, 1399--1404. DOI: https://doi.org/10.1145/2559206.2581212",
      "doi": "10.1145/2559206.2581212"
    },
    {
      "text": "Nicola Marsden and Monika Pröbster. 2019. Personas and Identity: Looking at Multiple Identities to Inform the Construction of Personas. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, Glasgow, Scotland Uk, 1--14. DOI: https://doi.org/10.1145/3290605.3300565",
      "doi": "10.1145/3290605.3300565"
    },
    {
      "text": "Seonaidh McDonald. 2005. Studying actions in context: a qualitative shadowing method for organizational research. Qual. Res. 5, 4 (November 2005), 455--473. DOI: https://doi.org/10.1177/1468794105056923",
      "doi": ""
    },
    {
      "text": "Seonaidh McDonald and Barbara Simpson. 2014. Shadowing research in organizations: the methodological debates. Qual. Res. Organ. Manag. Int. J. 9, 1 (2014), 3--20. DOI: https://doi.org/10.1108/ QROM-02--2014--1204",
      "doi": ""
    },
    {
      "text": "Danaë Metaxa-Kakavouli, Kelly Wang, James A. Landay, and Jeff Hancock. 2018. Gender-Inclusive Design: Sense of Belonging and Bias in Web Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, Montreal QC, Canada, 1--6. DOI: https://doi.org/10.1145/3173574.3174188",
      "doi": "10.1145/3173574.3174188"
    },
    {
      "text": "Johanna Meurer, Claudia Müller, Carla Simone, Ina Wagner, and Volker Wulf. 2018. Designing for Sustainability: Key Issues of ICT Projects for Ageing at Home. Comput. Support. Coop. Work CSCW 27, 3--6 (December 2018), 495--537. DOI: https://doi.org/ 10.1007/s10606-018--9317--1",
      "doi": "10.1007/s10606-018-9317-1"
    },
    {
      "text": "Claudia Müller, Dominik Hornung, Theodor Hamm, and Volker Wulf. 2015. Measures and Tools for Supporting ICT Appropriation by Elderly and Non Tech-Savvy Persons in a Long-Term Perspective. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway, Nina Boulus-Rødje, Gunnar Ellingsen, Tone Bratteteig, Margunn Aanestad and Pernille Bjørn (eds.). Springer International Publishing, Cham, 263--281. DOI: https://doi.org/10.1007/978--3--319--20499--4_14",
      "doi": ""
    },
    {
      "text": "Fiona Dowling Næss. 2001. Narratives about Young Men and Masculinities in Organised Sport in Norway. Sport Educ. Soc. 6, 2 (October 2001), 125-- 142. DOI: https://doi.org/10.1080/13573320120084236",
      "doi": ""
    },
    {
      "text": "Corinna Ogonowski, Timo Jakobi, Claudia Müller, and Jan Hess. 2018. PRAXLABS: A Sustainable Framework for User-Centered ICT Development. In Socio Informatics -- A Practice?Based Perspective, Volker Wulf, Volkmar Pipek, Dave Randall, Markus Rohde, Kjeld Schmidt and Gunnar Stevens (eds.). Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Corinna Ogonowski, Benedikt Ley, Jan Hess, Lin Wan, and Volker Wulf. 2013. Designing for the living room: Long-term user involvement in a Living Lab. CHI 13 Proc. SIGCHI Conf. Hum. Factors Comput. Syst. (2013), 1539--1548.",
      "doi": "10.1145/2470654.2466205"
    },
    {
      "text": "Julie Prescott and Jan Bogg. 2011. Segregation in a male-dominated industry: Women working in the computer games industry. Int. J. Gend. Sci. Technol. 3, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Peter Reason and Hilary Bradbury. 2008. The SAGE Handbook of Action Research: Participative Inquiry and Practice (2nd ed.). SAGE, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Shulamit Reinharz and Lynn Davidman. 1992. Feminist methods in social research. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Jennifer Rode. 2011. A Theoretical Agenda for Feminist HCI. Interact. Comput. 23, 5 (2011), 393--400. DOI: https://doi.org/10.1016/j.intcom.2011.04.005",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Bonnie Ruder, Dwaine Plaza, Rebecca Warner, and Michelle Bothwell. 2018. STEM Women Faculty Struggling for Recognition and Advancement in a \"Men's Club\" Culture. In Exploring the Toxicity of Lateral Violence and Microaggressions, Christine L. Cho, Julie K. Corkett and Astrid Steele (eds.). Springer International Publishing, Cham, 121--149. DOI: https://doi.org/10.1007/978--3--319--74760--6_7",
      "doi": ""
    },
    {
      "text": "Hans Schaffers, Javier Garcia Guzman, and Christian Merz. 2008. An Action Research Approach to Rural Living Labs Innovation. Proc. Cunningham M Cunningham Eds Collab. Knowl. Econ. Issues Appl. Case Stud. IOS Press (2008), 617--624.",
      "doi": ""
    },
    {
      "text": "Dorothy E Smith. 1987. The everyday world as problematic: A feminist sociology. University of Toronto Press.",
      "doi": ""
    },
    {
      "text": "Dorothy E Smith. 2005. Institutional ethnography: A sociology for people. Rowman Altamira.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Alex Ahmed, Jennifer A. Rode, Jed R. Brubaker, Gopinaath Kannabiran, Os Keyes, Ashley Marie Walker, Michael A. DeVito, Jeremy Birnholtz, Emeline Brulé, Ann Light, P?nar Barlas, and Jean Hardy. 2019. Queer(ing) HCI: Moving Forward in Theory and Practice. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA '19, ACM Press, Glasgow, Scotland Uk, 1--4. DOI: https://doi.org/10.1145/3290607.3311750",
      "doi": "10.1145/3290607.3311750"
    },
    {
      "text": "Anna Ståhlbröst. 2013. A Living Lab as a Service: Creating Value for Micro-enterprises through Collaboration and Innovation. Technol. Innov. Manag. Rev. 3, (2013), 37--42.",
      "doi": ""
    },
    {
      "text": "Anna Ståhlbröst and Marita Holst. 2017. Reflecting on Actions in Living Lab Research. Technol. Innov. Manag. Rev. 7, 2 (2017).",
      "doi": ""
    },
    {
      "text": "Lucy Suchman (Ed.). 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Nancy Taber. 2010. Institutional ethnography, autoethnography, and narrative: An argument for incorporating multiple methodologies. Qual. Res. 10, 1 (2010), 5--25.",
      "doi": ""
    },
    {
      "text": "Andrea H. Tapia and Lynette Kvasny. 2004. Recruitment is Never Enough: Retention of Women and Minorities in the IT Workplace. In Proceedings of the 2004 SIGMIS Conference on Computer Personnel Research: Careers, Culture, and Ethics in a Networked Environment (SIGMIS CPR '04), ACM, NY, NY, USA, 84--91. DOI: https://doi.org/10.1145/982372.982392",
      "doi": ""
    },
    {
      "text": "Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the Wild: Lessons from Community Technology Handovers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, NY, NY, USA, 1549--1558. DOI: https://doi.org/10.1145/2470654.2466206",
      "doi": "10.1145/2470654.2466206"
    },
    {
      "text": "Melissa Tyler and Laurie Cohen. 2010. Spaces that matter: Gender performativity and organizational space. Organ. Stud. 31, 2 (2010), 175--198.",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Daryoush Daniel Vaziri, Konstantin Aal, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Exploring the Potential of Exergames to affect the Social and Daily Life of People with Dementia and their Caregivers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, Montreal QC, Canada, 1--15. DOI: https://doi.org/10.1145/3173574.3173636",
      "doi": "10.1145/3173574.3173636"
    },
    {
      "text": "Nancy A. Van House. 2011. Feminist HCI meets facebook: Performativity and social networking sites. Interact. Comput. 23, 5 (September 2011), 422--429. DOI: https://doi.org/10.1016/j.intcom.2011.03.003",
      "doi": "10.1016/j.intcom.2011.03.003"
    },
    {
      "text": "Mihaela Vorvoreanu, Lingyi Zhang, Yun-Han Huang, Claudia Hilderbrand, Zoe Steine-Hanson, and Margaret Burnett. 2019. From Gender Biases to Gender-Inclusive Design: An Empirical Investigation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, Glasgow, Scotland Uk, 1--14. DOI: https://doi.org/10.1145/3290605.3300283",
      "doi": "10.1145/3290605.3300283"
    },
    {
      "text": "Ina Wagner. 2018. Critical Reflections on Participation in Design. In Socio Informatics -- A Practice?Based Perspective, Volker Wulf, Volkmar Pipek, Dave Randall, Markus Rohde, Kjeld Schmidt and Gunnar Stevens (eds.). Oxford University Press, New York, 243--278.",
      "doi": ""
    },
    {
      "text": "Mika Westerlund and Seppo Leminen. 2014. The multiplicity of research on innovation through living labs. In ISPIM Conference Proceedings, The International Society for Professional Innovation Management (ISPIM), 1.",
      "doi": ""
    },
    {
      "text": "Johanna Weststar and Marie-Josée Legault. 2018. Women's Experiences on the Path to a Career in Game Development. In Feminism in Play, Kishonna L. Gray, Gerald Voorhees and Emma Vossen (eds.). Palgrave Macmillan, Cham, 105--123. DOI: https://doi.org/10.1007/978--3--319--90539--6?",
      "doi": ""
    },
    {
      "text": "Reginald Worthley, Brent MacNab, Richard Brislin, Kiyohiko Ito, and Elizabeth L. Rose. 2009. Workforce motivation in Japan: an examination of gender differences and management perceptions. Int. J. Hum. Resour. Manag. 20, 7 (July 2009), 1503--1520. DOI: https://doi.org/10.1080/09585190902983421",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2008. Empathy and experience in HCI. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08, ACM Press, Florence, Italy, 637. DOI: https://doi.org/10.1145/1357054.1357156",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Markus Rohde, Volkmar Pipek, and Gunnar Stevens. 2011. Engaging with Practices: Design Case Studies as a Research Framework in CSCW. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work, ACM, New York, 505--512.",
      "doi": "10.1145/1958824.1958902"
    }
  ]
}