{
  "doi": "10.1145/3313831.3376248",
  "title": "Autocomplete Element Fields",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Aggregate elements are ubiquitous in natural and man-made objects. Interactively authoring these elements with varying anisotropy and deformability can require high artistic skills and manual labor. To reduce input workload and enhance output quality, we present an autocomplete system that can help users distribute and align such elements over different domains. Through a brushing interface, users can place and mix a few elements, and let our system automatically populate more elements for the remaining output. Furthermore, aggregate elements often require proper direction/scalar fields for proper arrangements, but fully specifying such fields across entire domains can be difficult or inconvenient for ordinary users. To address this usability challenge, we formulate element fields that can smoothly orient all the elements based on partial user specifications without requiring full input fields in any step. We validate our prototype system with a pilot user study and show applications in design, collage, and modeling.",
  "authors": [
    {
      "name": "Chen-Yuan Hsu",
      "institution": "Bournemouth University, Poole, United Kingdom",
      "img": "/do/10.1145/contrib-99659222318/rel-imgonly/photo.jpg",
      "acmid": "99659222318",
      "orcid": "missing"
    },
    {
      "name": "Li-Yi Wei",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81452594229/rel-imgonly/yilan_card_head_square.png",
      "acmid": "81452594229",
      "orcid": "missing"
    },
    {
      "name": "Lihua You",
      "institution": "Bournemouth University, Poole, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100560420",
      "orcid": "missing"
    },
    {
      "name": "Jian Jun Zhang",
      "institution": "Bournemouth University, Poole, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339492799",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Zainab AlMeraj, Craig S. Kaplan, and Paul Asente. 2013. Patch-based Geometric Texture Synthesis. In CAE '13. 15--19.",
      "doi": ""
    },
    {
      "text": "Nina Amenta, Sunghee Choi, and Ravi Krishna Kolluri. 2001. The Power Crust. In SMA '01. 249--266.",
      "doi": ""
    },
    {
      "text": "F Aurenhammer. 1987. Power Diagrams: Properties, Algorithms and Applications. SIAM J. Comput. 16, 1 (1987), 78--96.",
      "doi": "10.1137/0216006"
    },
    {
      "text": "Cyprien Buron, Jean-Eudes Marvie, Gaël Guennebaud, and Xavier Granier. 2015. Dynamic On-mesh Procedural Generation. In GI '15. 17--24.",
      "doi": ""
    },
    {
      "text": "Guoning Chen, Vivek Kwatra, Li-Yi Wei, Charles D. Hansen, and Eugene Zhang. 2012. Design of 2D Time-Varying Vector Fields. IEEE Transactions on Visualization and Computer Graphics 18, 10 (2012), 1717--1730.",
      "doi": "10.1109/TVCG.2011.290"
    },
    {
      "text": "Weikai Chen, Yuexin Ma, Sylvain Lefebvre, Shiqing Xin, Jonàs Martínez, and wenping wang. 2017. Fabricable Tile Decors. ACM Trans. Graph. 36, 6, Article 175 (2017), 15 pages.",
      "doi": "10.1145/3130800.3130817"
    },
    {
      "text": "Jun Han Cho, Athena Xenakis, Stefan Gronsky, and Apurva Shah. 2007. Anyone Can Cook -- Inside Ratatouille's Kitchen. In SIGGRAPH 2007 Courses.",
      "doi": ""
    },
    {
      "text": "David Cohen-Steiner, Pierre Alliez, and Mathieu Desbrun. 2004. Variational Shape Approximation. ACM Trans. Graph. 23, 3 (2004), 905--914.",
      "doi": "10.1145/1015706.1015817"
    },
    {
      "text": "Teela Cunningham. 2015. How to Create Seamless Patterns in Illustrator. (2015). https://www.youtube.com/watch?v=ITRZ75OKrG0.",
      "doi": ""
    },
    {
      "text": "Ketan Dalal, Allison W. Klein, Yunjun Liu, and Kaleigh Smith. 2006. A Spectral Approach to NPR Packing. In NPAR '06. 71--78.",
      "doi": "10.1145/1124728.1124741"
    },
    {
      "text": "Timothy Davison, Faramarz Samavati, and Christian Jacob. 2019. Interactive example-palettes for discrete element texture synthesis. Computers & Graphics 78 (2019), 23 -- 36.",
      "doi": ""
    },
    {
      "text": "Song-Pei Du, Shi-Min Hu, and Ralph R. Martin. 2013. Semiregular Solid Texturing from 2D Image Exemplars. IEEE Transactions on Visualization and Computer Graphics 19, 3 (2013), 460--469.",
      "doi": "10.1109/TVCG.2012.129"
    },
    {
      "text": "Jérémie Dumas, Jonàs Martínez, Sylvain Lefebvre, and Li-Yi Wei. 2018. Printable Aggregate Elements. CoRR abs/1811.02626 (2018).",
      "doi": ""
    },
    {
      "text": "Arnaud Emilien, Ulysse Vimont, Marie-Paule Cani, Pierre Poulin, and Bedrich Benes. 2015. WorldBrush: Interactive Example-based Synthesis of Procedural Virtual Worlds. ACM Trans. Graph. 34, 4, Article 106 (2015), 11 pages.",
      "doi": "10.1145/2766975"
    },
    {
      "text": "Freepik. 2019. Graphic resources for everyone. (2019). https://www.freepik.com/.",
      "doi": ""
    },
    {
      "text": "Leonhard Frehse. 2018. AutoModeller Pro. (2018). http://www.automodeller.com/.",
      "doi": ""
    },
    {
      "text": "Ran Gal, Olga Sorkine, Tiberiu Popa, Alla Sheffer, and Daniel Cohen-Or. 2007. 3D Collage: Expressive Non-realistic Modeling. In NPAR '07. 7--14.",
      "doi": "10.1145/1274871.1274873"
    },
    {
      "text": "Clovis Gay. 2016a. PhysX Painter. (2016). http://www.scriptspot.com/3ds-max/scripts/physx-painter.",
      "doi": ""
    },
    {
      "text": "Clovis Gay. 2016b. PhysX Painter Teaser. (2016). https://vimeo.com/162046605.",
      "doi": ""
    },
    {
      "text": "Eric Guérin, Eric Galin, François Grosbellet, Adrien Peytavie, and Jean-David Génevaux. 2016. Efficient modeling of entangled details for natural scenes. Computer Graphics Forum 35, 7 (2016), 257--267.",
      "doi": "10.5555/3151666.3151693"
    },
    {
      "text": "Alejo Hausner. 2001. Simulating Decorative Mosaics. In SIGGRAPH '01. 573--580.",
      "doi": ""
    },
    {
      "text": "Aaron Hertzmann and Denis Zorin. 2000. Illustrating Smooth Surfaces. In SIGGRAPH '00. 517--526.",
      "doi": ""
    },
    {
      "text": "Chen-Yuan Hsu, Li-Yi Wei, Lihua You, and Jian Jun Zhang. 2018. Brushing Element Fields. In SIGGRAPH Asia 2018 Technical Briefs (SA '18). Article 6, 4 pages.",
      "doi": ""
    },
    {
      "text": "Shu-Wei Hsu and John Keyser. 2010. Piles of Objects. ACM Trans. Graph. 29, 6, Article 155 (2010), 6 pages.",
      "doi": "10.1145/1882261.1866181"
    },
    {
      "text": "Shu-Wei Hsu and John Keyser. 2012. Automated Constraint Placement to Maintain Pile Shape. ACM Trans. Graph. 31, 6, Article 150 (2012), 6 pages.",
      "doi": "10.1145/2366145.2366169"
    },
    {
      "text": "Wenchao Hu, Zhonggui Chen, Hao Pan, Yizhou Yu, Eitan Grinspun, and Wenping Wang. 2016. Surface Mosaic Synthesis with Irregular Tiles. IEEE Transactions on Visualization and Computer Graphics 22, 3 (2016), 1302--1313.",
      "doi": "10.1109/TVCG.2015.2498620"
    },
    {
      "text": "Hua Huang, Lei Zhang, and Hong-Chao Zhang. 2011. Arcimboldo-like Collage Using Internet Images. ACM Trans. Graph. 30, 6, Article 155 (2011), 8 pages.",
      "doi": "10.1145/2070781.2024189"
    },
    {
      "text": "Zhiyang Huang and Tao Ju. 2016. Extrinsically smooth direction fields. Computers & Graphics 58 (2016), 109--117.",
      "doi": "10.1016/j.cag.2016.05.015"
    },
    {
      "text": "Zhe Huang, Jiang Wang, Hongbo Fu, and Rynson W. H. Lau. 2014. Structured Mechanical Collage. IEEE Transactions on Visualization and Computer Graphics 20, 7 (2014), 1076--1082.",
      "doi": "10.1109/TVCG.2014.2303087"
    },
    {
      "text": "Takashi Ijiri, Radomír Mêch, Takeo Igarashi, and Gavin Miller. 2008. An Example-based Procedural System for Element Arrangement. Computer Graphics Forum 27, 2 (2008), 429--436.",
      "doi": ""
    },
    {
      "text": "Robert Jagnow, Julie Dorsey, and Holly Rushmeier. 2004. Stereological Techniques for Solid Textures. ACM Trans. Graph. 23, 3 (2004), 329--335.",
      "doi": "10.1145/1015706.1015724"
    },
    {
      "text": "Evangelos Kalogerakis, Derek Nowrouzezahrai, Simon Breslav, and Aaron Hertzmann. 2012. Learning Hatching for Pen-and-ink Illustration of Surfaces. ACM Trans. Graph. 31, 1, Article 1 (2012), 17 pages.",
      "doi": "10.1145/2077341.2077342"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, Shengdong Zhao, and George Fitzmaurice. 2014. Draco: Bringing Life to Illustrations with Kinetic Textures. In CHI '14. 351--360.",
      "doi": "10.1145/2556288.2556987"
    },
    {
      "text": "Rubaiat Habib Kazi, Takeo Igarashi, Shengdong Zhao, and Richard Davis. 2012. Vignette: Interactive Texture Design and Manipulation with Freeform Gestures for Pen-and-ink Illustration. In CHI '12. 1727--1736.",
      "doi": ""
    },
    {
      "text": "Junhwan Kim and Fabio Pellacini. 2002. Jigsaw Image Mosaics. ACM Trans. Graph. 21, 3 (2002), 657--664.",
      "doi": "10.1145/566654.566633"
    },
    {
      "text": "Yeojin Kim, Byungmoon Kim, and Young J. Kim. 2018. Dynamic Deep Octree for High-resolution Volumetric Painting in Virtual Reality. Computer Graphics Forum 37, 7 (2018), 179--190.",
      "doi": ""
    },
    {
      "text": "Johannes Kopf, Chi-Wing Fu, Daniel Cohen-Or, Oliver Deussen, Dani Lischinski, and Tien-Tsin Wong. 2007. Solid Texture Synthesis from 2D Exemplars. ACM Trans. Graph. 26, 3, Article 2 (2007).",
      "doi": "10.1145/1276377.1276380"
    },
    {
      "text": "Kin Chung Kwan, Lok Tsun Sinn, Chu Han, Tien-Tsin Wong, and Chi-Wing Fu. 2016. Pyramid of Arclength Descriptor for Generating Collage of Shapes. ACM Trans. Graph. 35, 6, Article 229 (2016), 12 pages.",
      "doi": "10.1145/2980179.2980234"
    },
    {
      "text": "Pierre-Edouard Landes, Bruno Galerne, and Thomas Hurtut. 2013. A Shape-aware Model for Discrete Texture Synthesis. In EGSR '13. Aire-la-Ville, Switzerland, Switzerland, 67--76.",
      "doi": "10.1111/cgf.12152"
    },
    {
      "text": "Moshe Levis. 2014. Tutorial on How to do a typography design of a woman's face in Photoshop CC. (2014). https://www.youtube.com/watch?v=LcZFp1s1AQI.",
      "doi": ""
    },
    {
      "text": "Pan Li, Bin Wang, Feng Sun, Xiaohu Guo, Caiming Zhang, and Wenping Wang. 2015. Q-MAT: Computing Medial Axis Transform By Quadratic Error Minimization. ACM Trans. Graph. 35, 1, Article 8 (2015), 16 pages.",
      "doi": "10.1145/2753755"
    },
    {
      "text": "Yuanyuan Li, Fan Bao, Eugene Zhang, Yoshihiro Kobayashi, and Peter Wonka. 2011. Geometry Synthesis on Surfaces Using Field-Guided Shape Grammars. IEEE Transactions on Visualization and Computer Graphics 17, 2 (2011), 231--243.",
      "doi": "10.1109/TVCG.2010.36"
    },
    {
      "text": "Hugo Loi, Thomas Hurtut, Romain Vergne, and Joëlle Thollot. 2013. Discrete Texture Design Using a Programmable Approach. In SIGGRAPH '13 Talks. Article 43, 1 pages.",
      "doi": "10.1145/2504459.2504513"
    },
    {
      "text": "Hugo Loi, Thomas Hurtut, Romain Vergne, and Joelle Thollot. 2017. Programmable 2D Arrangements for Element Texture Design. ACM Trans. Graph. 36, 3, Article 27 (2017), 17 pages.",
      "doi": "10.1145/2983617"
    },
    {
      "text": "Jingwan Lu, Connelly Barnes, Stephen DiVerdi, and Adam Finkelstein. 2013. RealBrush: Painting with Examples of Physical Media. ACM Trans. Graph. 32, 4, Article 117 (2013), 12 pages.",
      "doi": "10.1145/2461912.2461998"
    },
    {
      "text": "Jingwan Lu, Connelly Barnes, Connie Wan, Paul Asente, Radomir Mech, and Adam Finkelstein. 2014. DecoBrush: Drawing Structured Decorative Patterns by Example. ACM Trans. Graph. 33, 4, Article 90 (2014), 9 pages.",
      "doi": "10.1145/2601097.2601190"
    },
    {
      "text": "Jingwan Lu, Fisher Yu, Adam Finkelstein, and Stephen DiVerdi. 2012. HelpingHand: Example-based Stroke Stylization. ACM Trans. Graph. 31, 4, Article 46 (2012), 10 pages.",
      "doi": "10.1145/2185520.2185542"
    },
    {
      "text": "M. Luká c, J. Fier, P. Asente, J. Lu, E. Shechtman, and D. Sýkora. 2015. Brushables: Example-based Edge-aware Directional Texture Painting. Comput. Graph. Forum 34, 7 (2015), 257--267.",
      "doi": "10.1111/cgf.12764"
    },
    {
      "text": "Michal Lukás c, Jakub Fiber, Jean-Charles Bazin, Ondrej Jamrika, Alexander Sorkine-Hornung, and Daniel Sýkora. 2013. Painting by Feature: Texture Boundaries for Example-based Image Creation. ACM Trans. Graph. 32, 4, Article 116 (2013), 8 pages.",
      "doi": ""
    },
    {
      "text": "Chongyang Ma, Li-Yi Wei, Sylvain Lefebvre, and Xin Tong. 2013. Dynamic Element Textures. ACM Trans. Graph. 32, 4, Article 90 (2013), 10 pages.",
      "doi": "10.1145/2461912.2461921"
    },
    {
      "text": "Chongyang Ma, Li-Yi Wei, and Xin Tong. 2011. Discrete Element Textures. ACM Trans. Graph. 30, 4, Article 62 (2011), 10 pages.",
      "doi": "10.1145/2010324.1964957"
    },
    {
      "text": "K. Madsen, H. B. Nielsen, and O. Tingleff. 2004. Methods for Non-Linear Least Squares Problems (2nd ed.). (2004). http://www2.imm.dtu.dk/pubdb/views/ publication_details.php?id=3215.",
      "doi": ""
    },
    {
      "text": "Ron Maharik, Mikhail Bessmeltsev, Alla Sheffer, Ariel Shamir, and Nathan Carr. 2011. Digital Micrography. ACM Trans. Graph. 30, 4, Article 100 (2011), 12 pages.",
      "doi": "10.1145/2010324.1964995"
    },
    {
      "text": "Johannes Meng, Marios Papas, Ralf Habel, Carsten Dachsbacher, Steve Marschner, Markus Gross, and Wojciech Jarosz. 2015. Multi-scale Modeling and Rendering of Granular Materials. ACM Trans. Graph. 34, 4, Article 49 (2015), 13 pages.",
      "doi": "10.1145/2766949"
    },
    {
      "text": "Thomas Muller, Marios Papas, Markus Gross, Wojciech Jarosz, and Jan Novak. 2016. Efficient Rendering of Heterogeneous Polydisperse Granular Media. ACM Trans. Graph. 35, 6 (2016).",
      "doi": "10.1145/2980179.2982429"
    },
    {
      "text": "Jonathan Palacios, Lawrence Roy, Prashant Kumar, Chen-Yuan Hsu, Weikai Chen, Chongyang Ma, Li-Yi Wei, and Eugene Zhang. 2017. Tensor Field Design in Volumes. ACM Trans. Graph. 36, 6, Article 188 (2017), 15 pages.",
      "doi": "10.1145/3130800.3130844"
    },
    {
      "text": "Jonathan Palacios and Eugene Zhang. 2007. Rotational Symmetry Field Design on Surfaces. ACM Trans. Graph. 26, 3, Article 55 (2007).",
      "doi": "10.1145/1276377.1276446"
    },
    {
      "text": "Adrien Peytavie, Eric Galin, Jérôme Grosjean, and Stéphane Mérillou. 2009. Procedural generation of rock piles using aperiodic tiling. Computer Graphics Forum 28, 7 (2009), 1801--1809.",
      "doi": ""
    },
    {
      "text": "Charles Purdy. 2019. Make It, Sell It: Repeating Patterns in Adobe Illustrator. (2019). https://create. adobe.com/2019/4/2/make_it_sell_it_repe.html.",
      "doi": ""
    },
    {
      "text": "Xuejie Qin and Yee-Hong Yang. 2007. Aura 3D Textures. IEEE Transactions on Visualization and Computer Graphics 13, 2 (2007), 379--389.",
      "doi": "10.1109/TVCG.2007.31"
    },
    {
      "text": "Bernhard Reinert, Tobias Ritschel, and Hans-Peter Seidel. 2013. Interactive By-example Design of Artistic Packing Layouts. ACM Trans. Graph. 32, 6, Article 218 (2013), 7 pages.",
      "doi": "10.1145/2508363.2508409"
    },
    {
      "text": "Lincoln Ritter, Wilmot Li, Brian Curless, Maneesh Agrawala, and David Salesin. 2006. Painting with Texture. In EGSR '06. 371--376.",
      "doi": ""
    },
    {
      "text": "Riccardo Roveri, A. Cengiz Öztireli, Sebastian Martin, Barbara Solenthaler, and Markus Gross. 2015. Example Based Repetitive Structure Synthesis. Comput. Graph. Forum 34, 5 (2015), 39--52.",
      "doi": "10.1111/cgf.12695"
    },
    {
      "text": "Chris Rycroft. 2009. Voro++: A three-dimensional Voronoi cell library in C++. (2009). http://math.lbl.gov/voro++/.",
      "doi": ""
    },
    {
      "text": "K. Sakurai and K. Miyata. 2014. Modelling of Non-Periodic Aggregates Having a Pile Structure. Comput. Graph. Forum 33, 1 (2014), 190--198.",
      "doi": "10.1111/cgf.12266"
    },
    {
      "text": "Christian Santoni and Fabio Pellacini. 2016. gTangle: A Grammar for the Procedural Generation of Tangle Patterns. ACM Trans. Graph. 35, 6, Article 182 (2016), 11 pages.",
      "doi": "10.1145/2980179.2982417"
    },
    {
      "text": "Reza Saputra, Craig Kaplan, and Paul Asente. 2018. RepulsionPak: Deformation-Driven Element Packing with Repulsion Forces. In GI 2018. 10 -- 17.",
      "doi": ""
    },
    {
      "text": "Reza Adhitya Saputra, Craig S. Kaplan, Paul Asente, and Radomír Mech. 2017. FLOWPAK: Flow-based Ornamental Element Packing. In GI '17. 8--15.",
      "doi": ""
    },
    {
      "text": "Alexander Schiftner, Mathias Höbinger, Johannes Wallner, and Helmut Pottmann. 2009. Packing Circles and Spheres on Surfaces. ACM Trans. Graph. 28, 5, Article 139 (2009), 8 pages.",
      "doi": "10.1145/1618452.1618485"
    },
    {
      "text": "D. Schroeder, D. Coffey, and D. Keefe. 2010. Drawing with the Flow: A Sketch-based Interface for Illustrative Visualization of 2D Vector Fields. In SBIM '10. 49--56.",
      "doi": ""
    },
    {
      "text": "Martin Schwarz, Tobias Isenberg, Katherine Mason, and Sheelagh Carpendale. 2007. Modeling with Rendering Primitives: An Interactive Non-photorealistic Canvas. In NPAR '07. 15--22.",
      "doi": "10.1145/1274871.1274874"
    },
    {
      "text": "Maria Shugrina, Jingwan Lu, and Stephen Diverdi. 2017. Playful Palette: An Interactive Parametric Color Mixer for Artists. ACM Trans. Graph. 36, 4, Article 61 (2017), 10 pages.",
      "doi": "10.1145/3072959.3073690"
    },
    {
      "text": "Robert W. Sumner, Johannes Schmid, and Mark Pauly. 2007. Embedded Deformation for Shape Manipulation. ACM Trans. Graph. 26, 3, Article 80 (2007).",
      "doi": "10.1145/1276377.1276478"
    },
    {
      "text": "Kenshi Takayama, Makoto Okabe, Takashi Ijiri, and Takeo Igarashi. 2008. Lapped Solid Textures: Filling a Model with Anisotropic Textures. ACM Trans. Graph. 27, 3, Article 53 (2008), 9 pages.",
      "doi": "10.1145/1360612.1360652"
    },
    {
      "text": "Jean-Marc Thiery, Émilie Guy, and Tamy Boubekeur. 2013. Sphere-Meshes: Shape Approximation Using Spherical Quadric Error Metrics. ACM Trans. Graph. 32, 6, Article 178 (2013), 12 pages.",
      "doi": "10.1145/2508363.2508384"
    },
    {
      "text": "VideoLot. 2016. Adobe Illustrator Cs6 | Typography Portrait | Bruno Mars. (2016). https://www.youtube.com/watch?v=_kdhB-8tNeM.",
      "doi": ""
    },
    {
      "text": "Rui Wang, Kun Zhou, John Snyder, Xinguo Liu, Hujun Bao, Qunsheng Peng, and Baining Guo. 2006. Variational Sphere Set Approximation for Solid Objects. Vis. Comput. 22, 9 (2006), 612--621.",
      "doi": "10.1007/s00371-006-0052-0"
    },
    {
      "text": "Jun Xing, Rubaiat Habib Kazi, Tovi Grossman, Li-Yi Wei, Jos Stam, and George Fitzmaurice. 2016. Energy-Brushes: Interactive Tools for Illustrating Stylized Elemental Dynamics. In UIST '16. 755--766.",
      "doi": "10.1145/2984511.2984585"
    },
    {
      "text": "Jie Xu and Craig S. Kaplan. 2007. Calligraphic Packing. In GI '07. 43--50.",
      "doi": ""
    },
    {
      "text": "Jonas Zehnder, Stelian Coros, and Bernhard Thomaszewski. 2016. Designing Structurally-sound Ornamental Curve Networks. ACM Trans. Graph. 35, 4, Article 99 (2016), 10 pages.",
      "doi": "10.1145/2897824.2925888"
    },
    {
      "text": "Guo-Xin Zhang, Song-Pei Du, Yu-Kun Lai, Tianyun Ni, and Shi-Min Hu. 2011. Sketch guided solid texturing. Graphical Models 73, 3 (2011), 59--73.",
      "doi": ""
    },
    {
      "text": "Shizhe Zhou, Changyun Jiang, and Sylvain Lefebvre. 2014. Topology-constrained Synthesis of Vector Patterns. ACM Trans. Graph. 33, 6, Article 215 (2014), 11 pages.",
      "doi": "10.1145/2661229.2661238"
    },
    {
      "text": "Changqing Zou, Junjie Cao, Warunika Ranaweera, Ibraheem Alhashim, Ping Tan, Alla Sheffer, and Hao Zhang. 2016. Legible Compact Calligrams. ACM Trans. Graph. 35, 4, Article 122 (2016), 12 pages.",
      "doi": "10.1145/2897824.2925887"
    }
  ]
}