{
  "doi": "10.1145/3313831.3376175",
  "title": "\"I Hear You, I Feel You\": Encouraging Deep Self-disclosure through a Chatbot",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Chatbots have great potential to serve as a low-cost, effective tool to support people's self-disclosure. Prior work has shown that reciprocity occurs in human-machine dialog; however, whether reciprocity can be leveraged to promote and sustain deep self-disclosure over time has not been systematically studied. In this work, we design, implement and evaluate a chatbot that has self-disclosure features when it performs small talk with people. We ran a study with 47 participants and divided them into three groups to use different chatting styles of the chatbot for three weeks. We found that chatbot self-disclosure had a reciprocal effect on promoting deeper participant self-disclosure that lasted over the study period, in which the other chat styles without self-disclosure features failed to deliver. Chatbot self-disclosure also had a positive effect on improving participants' perceived intimacy and enjoyment over the study period. Finally, we reflect on the design implications of chatbots where deep self-disclosure is needed over time.",
  "tags": [
    "chatbot",
    "conversation",
    "self-disclosure, mental well-being"
  ],
  "authors": [
    {
      "name": "Yi-Chieh Lee",
      "institution": "University of Illinois at Urbana-Champaign & NTT Japan, Champaign, IL, USA",
      "img": "/do/10.1145/contrib-87958662957/rel-imgonly/citations.jpeg",
      "acmid": "87958662957",
      "orcid": "0000-0002-5484-6066"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Japan, Keihanna, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Yun Huang",
      "institution": "University of Illinois at Urbana-Champaign, Champaign, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658635613",
      "orcid": "0000-0003-0399-8032"
    },
    {
      "name": "Wai Fu",
      "institution": "University of Illinois at Urbana-Champaign, Champaign, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529742",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Irwin Altman and Dalmas A Taylor. 1973. Social penetration: The development of interpersonal relationships. Holt, Rinehart & Winston.",
      "doi": ""
    },
    {
      "text": "Arthur Aron, Edward Melinat, Elaine N Aron, Robert Darrin Vallone, and Renee J Bator. 1997. The experimental generation of interpersonal closeness: A procedure and some preliminary findings. Personality and Social Psychology Bulletin 23, 4 (1997), 363--377.",
      "doi": ""
    },
    {
      "text": "Azy Barak and Orit Gluck-Ofri. 2007. Degree and reciprocity of self-disclosure in online forums. CyberPsychology & Behavior 10, 3 (2007), 407--417.",
      "doi": ""
    },
    {
      "text": "Ellen Berscheid, Mark Snyder, and Allen M Omoto. 1989. The relationship closeness inventory: Assessing the closeness of interpersonal relationships. Journal of personality and Social Psychology 57, 5 (1989), 792.",
      "doi": ""
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 1999. Small talk and conversational storytelling in embodied conversational interface agents. In AAAI fall symposium on narrative intelligence. 87--92.",
      "doi": ""
    },
    {
      "text": "Timothy Bickmore and Amanda Gruber. 2010. Relational agents in clinical psychiatry. Harvard review of psychiatry 18, 2 (2010), 119--130.",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, and others. 2019. What Makes a Good Conversation?: Challenges in Designing Truly Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 475.",
      "doi": "10.1145/3290605.3300705"
    },
    {
      "text": "Patrick Corrigan. 2004. How stigma interferes with mental health care. American psychologist 59, 7 (2004), 614.",
      "doi": ""
    },
    {
      "text": "Paul C Cozby. 1973. Self-disclosure: a literature review. Psychological bulletin 79, 2 (1973), 73.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental health discourse on reddit: Self-disclosure, social support, and anonymity. In Eighth International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Valerian J Derlaga and John H Berg. 1987. Self-disclosure: Theory, research, and therapy. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "David DeVault, Ron Artstein, Grace Benn, Teresa Dey, Ed Fast, Alesia Gainer, Kallirroi Georgila, Jon Gratch, Arno Hartholt, Margaux Lhommet, and others. 2014. SimSensei Kiosk: A virtual human interviewer for healthcare decision support. In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems. International Foundation for Autonomous Agents and Multiagent Systems, 1061--1068.",
      "doi": "10.5555/2615731.2617415"
    },
    {
      "text": "Tamara Dinev and Paul Hart. 2006. Privacy concerns and levels of information exchange: An empirical investigation of intended e-services use. E-Service 4, 3 (2006), 25--60.",
      "doi": ""
    },
    {
      "text": "Gavin Doherty, David Coyle, and Mark Matthews. 2010. Design and evaluation guidelines for mental health technologies. Interacting with computers 22, 4 (2010), 243--252.",
      "doi": ""
    },
    {
      "text": "Robert A Emmons and Robin Stern. 2013. Gratitude as a psychotherapeutic intervention. Journal of clinical psychology 69, 8 (2013), 846--855.",
      "doi": ""
    },
    {
      "text": "Barry Alan Farber. 2006. Self-disclosure in psychotherapy. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Kathleen Kara Fitzpatrick, Alison Darcy, and Molly Vierhile. 2017. Delivering cognitive behavior therapy to young adults with symptoms of depression and anxiety using a fully automated conversational agent (Woebot): a randomized controlled trial. JMIR mental health 4, 2 (2017), e19.",
      "doi": ""
    },
    {
      "text": "Jean Hanson. 2005. Should your lips be zipped? How therapist self-disclosure and non-disclosure affects clients. Counselling and Psychotherapy Research 5, 2 (2005), 96--104.",
      "doi": ""
    },
    {
      "text": "Charles T Hill and Donald E Stull. 1987. Gender and self-disclosure. In Self-Disclosure. Springer, 81--100.",
      "doi": ""
    },
    {
      "text": "Hsin-Yi Huang. 2016. Examining the beneficial effects of individual's self-disclosure on the social network site. Computers in human behavior 57 (2016), 122--132.",
      "doi": ""
    },
    {
      "text": "Yun Huang, Ying Tang, and Yang Wang. 2015. Emotion map: A location-based mobile social system for improving emotion awareness and regulation. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 130--142.",
      "doi": "10.1145/2675133.2675173"
    },
    {
      "text": "Justin Hunt and Daniel Eisenberg. 2010. Mental health problems and help-seeking behavior among college students. Journal of adolescent health 46, 1 (2010), 3--10.",
      "doi": ""
    },
    {
      "text": "Emmi Ignatius and Marja Kokkonen. 2007. Factors contributing to verbal self-disclosure. Nordic Psychology 59, 4 (2007), 362--391.",
      "doi": ""
    },
    {
      "text": "Sidney M Jourard and Paul Lasakow. 1958. Some factors in self-disclosure. The Journal of Abnormal and Social Psychology 56, 1 (1958), 91.",
      "doi": ""
    },
    {
      "text": "Junhan Kim, Yoojung Kim, Byungjoon Kim, Sukyung Yun, Minjoon Kim, and Joongseek Lee. 2018. Can a Machine Tend to Teenagers' Emotional Needs?: A Study with Conversational Agents. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW018.",
      "doi": "10.1145/3170427.3188548"
    },
    {
      "text": "Soomin Kim, Joonhwan Lee, and Gahgene Gweon. 2019. Comparing Data from Chatbot and Web Surveys: Effects of Platform and Conversational Style on Survey Response Quality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 86, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300316",
      "doi": "10.1145/3290605.3300316"
    },
    {
      "text": "Hamutal Kreiner and Yossi Levi-Belz. 2019. Self-Disclosure Here and Now: Combining Retrospective Perceived Assessment With Dynamic Behavioral Measures. Frontiers in psychology 10 (2019).",
      "doi": ""
    },
    {
      "text": "Kira Kretzschmar, Holly Tyroll, Gabriela Pavarini, Arianna Manzini, Ilina Singh, and NeurOx Young People's Advisory Group. 2019. Can your phone be your therapist? Young people's ethical perspectives on the use of fully automated conversational agents (Chatbots) in mental health support. Biomedical informatics insights 11 (2019), 1178222619829083.",
      "doi": ""
    },
    {
      "text": "Christoph Lauber and Wulf Rössler. 2007. Stigma towards people with mental illness in developing countries in Asia. International review of psychiatry 19, 2 (2007), 157--178.",
      "doi": ""
    },
    {
      "text": "Minha Lee, Sander Ackermans, Nena van As, Hanwen Chang, Enzo LUniversity of Chinese Academy of Sciences, and Wijnand IJsselsteijn. 2019. Caring for Vincent: A Chatbot for Self-Compassion. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 702, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300932",
      "doi": "10.1145/3290605.3300932"
    },
    {
      "text": "SeoYoung Lee and Junho Choi. 2017. Enhancing user experience with conversational agent for movie recommendation: Effects of self-disclosure and reciprocity. International Journal of Human-Computer Studies 103 (2017), 95--105.",
      "doi": "10.1016/j.ijhcs.2017.02.005"
    },
    {
      "text": "Gale M LUniversity of Chinese Academy of Sciences, Jonathan Gratch, Aisha King, and Louis-Philippe Morency. 2014. It's only a computer: Virtual humans increase willingness to disclose. Computers in Human Behavior 37 (2014), 94--100.",
      "doi": "10.1016/j.chb.2014.04.043"
    },
    {
      "text": "Gale M LUniversity of Chinese Academy of Sciences, Albert Rizzo, Jonathan Gratch, Stefan Scherer, Giota Stratou, Jill Boberg, and Louis-Philippe Morency. 2017. Reporting mental health symptoms: breaking down barriers to care with virtual human interviewers. Frontiers in Robotics and AI 4 (2017), 51.",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Jeff Hancock, and Mor Naaman. 2016. Anonymity, Intimacy and Self-Disclosure in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3857--3869. DOI: http://dx.doi.org/10.1145/2858036.2858414",
      "doi": "10.1145/2858036.2858414"
    },
    {
      "text": "Lynn C Miller and David A Kenny. 1986. Reciprocity of self-disclosure at the individual and dyadic levels: A social relations analysis. Journal of Personality and Social Psychology 50, 4 (1986), 713.",
      "doi": ""
    },
    {
      "text": "Youngme Moon. 2000. Intimate exchanges: Using computers to elicit self-disclosure from consumers. Journal of consumer research 26, 4 (2000), 323--339.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 72--78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Melanie Nguyen, Yu Sun Bin, and Andrew Campbell. 2012. Comparing online and offline self-disclosure: A systematic review. Cyberpsychology, Behavior, and Social Networking 15, 2 (2012), 103--111.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker. 1995. Emotion, disclosure, & health. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Judith J Prochaska, Hai-Yen Sung, Wendy Max, Yanling Shi, and Michael Ong. 2012. Validity study of the K6 scale as a measure of moderate mental distress based on mental health treatment need and utilization. International journal of methods in psychiatric research 21, 2 (2012), 88--97.",
      "doi": ""
    },
    {
      "text": "Abhilasha Ravichander and Alan W Black. 2018. An Empirical Study of Self-Disclosure in Spoken Dialogue Systems. In Proceedings of the 19th Annual SIGdial Meeting on Discourse and Dialogue. 253--263.",
      "doi": ""
    },
    {
      "text": "Amy Reeves. 2005. Emotional intelligence: recognizing and regulating emotions. Aaohn Journal 53, 4 (2005), 172--176.",
      "doi": ""
    },
    {
      "text": "Kathryn Robertson and others. 2005. Active listening: more than just paying attention. Australian family physician 34, 12 (2005), 1053.",
      "doi": ""
    },
    {
      "text": "Yla R Tausczik and James W Pennebaker. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of language and social psychology 29, 1 (2010), 24--54.",
      "doi": ""
    },
    {
      "text": "Philip M Ullrich and Susan K Lutgendorf. 2002. Journaling about stressful events: Effects of cognitive processing and emotional expression. Annals of Behavioral Medicine 24, 3 (2002), 244--250.",
      "doi": ""
    },
    {
      "text": "Hans Van der Heijden. 2003. Factors influencing the usage of websites: the case of a generic portal in The Netherlands. Information & management 40, 6 (2003), 541--549.",
      "doi": ""
    },
    {
      "text": "Yi-Chia Wang, Moira Burke, and Robert Kraut. 2016. Modeling Self-Disclosure in Social Networking Sites. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 74--85. DOI: http://dx.doi.org/10.1145/2818048.2820010",
      "doi": "10.1145/2818048.2820010"
    },
    {
      "text": "Joseph Weizenbaum and others. 1966. ELIZA-a computer program for the study of natural language communication between man and machine. Commun. ACM 9, 1 (1966), 36--45.",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Lawrence R Wheeless and Janis Grotz. 1977. The measurement of trust and its relationship to self-disclosure. Human Communication Research 3, 3 (1977), 250--257.",
      "doi": ""
    },
    {
      "text": "Alex C. Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T. Iqbal, and Jaime Teevan. 2018. Supporting Workplace Detachment and Reattachment with Conversational Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 88, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173662",
      "doi": "10.1145/3173574.3173662"
    }
  ]
}