{
  "doi": "10.1145/3313831.3376788",
  "title": "Would you do it?: Enacting Moral Dilemmas in Virtual Reality for Understanding Ethical Decision-Making",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "A moral dilemma is a decision-making paradox without unambiguously acceptable or preferable options. This paper investigates if and how the virtual enactment of two renowned moral dilemmas---the Trolley and the Mad Bomber---influence decision-making when compared with mentally visualizing such situations. We conducted two user studies with two gender-balanced samples of 60 participants in total that compared between paper-based and virtual-reality (VR) conditions, while simulating 5 distinct scenarios for the Trolley dilemma, and 4 storyline scenarios for the Mad Bomber's dilemma. Our findings suggest that the VR enactment of moral dilemmas further fosters utilitarian decision-making, while it amplifies biases such as sparing juveniles and seeking retribution. Ultimately, we theorize that the VR enactment of renowned moral dilemmas can yield ecologically-valid data for training future Artificial Intelligence (AI) systems on ethical decision-making, and we elicit early design principles for the training of such systems.",
  "authors": [
    {
      "name": "Evangelos Niforatos",
      "institution": "Norwegian University of Science and Technology, Trondheim, Norway",
      "img": "/do/10.1145/contrib-81548019687/rel-imgonly/evanpicsmall.png",
      "acmid": "81548019687",
      "orcid": "missing"
    },
    {
      "name": "Adam Palma",
      "institution": "Robert Bosch, Ceske Budejovice, Czech Rep",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529283",
      "orcid": "missing"
    },
    {
      "name": "Roman Gluszny",
      "institution": "Solarwinds, Brno, Czech Rep",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528385",
      "orcid": "missing"
    },
    {
      "name": "Athanasios Vourvopoulos",
      "institution": "Instituto Superior Técnico, Lisbon, Portugal",
      "img": "/do/10.1145/contrib-81486654441/rel-imgonly/526164.jpg",
      "acmid": "81486654441",
      "orcid": "missing"
    },
    {
      "name": "Fotis Liarokapis",
      "institution": "Masaryk University, Brno, Czech Rep",
      "img": "/do/10.1145/contrib-81100172661/rel-imgonly/fotis.jpg",
      "acmid": "81100172661",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nikolaos Aletras, Dimitrios Tsarapatsanis, Daniel Preotiuc-Pietro, and Vasileios Lampos. 2016. Predicting judicial decisions of the European Court of Human Rights: A natural language processing perspective. Peer J Computer Science 2 (2016), e93. https://doi.org/10.7717/peerj-cs.93",
      "doi": ""
    },
    {
      "text": "Julia Annas. 1992. Ancient ethics and modern morality. Philosophical Perspectives 6 (1992), 119--136. DOI: http://dx.doi.org/10.2307/2214241",
      "doi": ""
    },
    {
      "text": "Edmond Awad, Sohan Dsouza, Richard Kim, Jonathan Schulz, Joseph Henrich, Azim Shariff, Jean-François Bonnefon, and Iyad Rahwan. 2018. The Moral Machine experiment. Nature 563, 7729 (2018), 59. DOI: http://dx.doi.org/10.1038/s41586-018-0637--6",
      "doi": ""
    },
    {
      "text": "Jeremy Bailenson. 2018. Experience on Demand: What Virtual Reality Is, how it Works, and what it Can Do. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Reuben Binns, Max Van Kleek, Michael Veale, Ulrik Lyngs, Jun Zhao, and Nigel Shadbolt. 2018. 'It's Reducing a Human Being to a Percentage': Perceptions of Justice in Algorithmic Decisions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 377. DOI: http://dx.doi.org/10.1145/3173574.3173951",
      "doi": "10.1145/3173574.3173951"
    },
    {
      "text": "Derek C Bok. 1976. Can ethics be taught? Change: The Magazine of Higher Learning 8, 9 (1976), 26--30. https://doi.org/10.1080/00091383.1976.10568973",
      "doi": ""
    },
    {
      "text": "Rich Caruana and Alexandru Niculescu-Mizil. 2006. An empirical comparison of supervised learning algorithms. In Proceedings of the 23rd international conference on Machine learning. ACM, 161--168. DOI: http://dx.doi.org/10.1145/1143844.1143865",
      "doi": "10.1145/1143844.1143865"
    },
    {
      "text": "Anne Colby and Lawrence Kohlberg. 2011. The measurement of moral judgment. Vol. 1. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Keith E Davis and Edward E Jones. 1960. Changes in interpersonal perception as a means of reducing cognitive dissonance. The Journal of Abnormal and Social Psychology 61, 3 (1960), 402. https://doi.org/10.1037/h0044214",
      "doi": ""
    },
    {
      "text": "Neal Desai, Andre Pineda, Majken Runquist, Mark Andrew Fusunyan, Katy Glenn, Gabrielle Kathryn Gould, Michelle Rachel Katz, Henry Lichtblau, Maggie Jean Morgan, Sophia Wen, and others. 2010. Torture at times: Waterboarding in the media. (2010). https://dash.harvard.edu/handle/1/4420886",
      "doi": ""
    },
    {
      "text": "Ernst Fehr and Simon Gächter. 2000. Fairness and retaliation: The economics of reciprocity. Journal of economic perspectives 14, 3 (2000), 159--181. DOI: http://dx.doi.org/10.1257/jep.14.3.159",
      "doi": ""
    },
    {
      "text": "Philippa Foot. 1967. The Problem of Abortion and the Doctrine of Double Effect. Oxford Review 5 (1967), 5--15. https://philpapers.org/rec/FOOTPO-2",
      "doi": ""
    },
    {
      "text": "Kathryn B. Francis, Charles Howard, Ian S. Howard, Michaela Gummerum, Giorgio Ganis, Grace Anderson, and Sylvia Terbeck. 2016. Virtual Morality: Transitioning from Moral Judgment to Moral Action? PLOS ONE 11, 10 (Oct. 2016), e0164374. DOI: http://dx.doi.org/10.1371/journal.pone.0164374",
      "doi": ""
    },
    {
      "text": "Dorothea Frede. 2017. Plato's Ethics: An Overview. In The Stanford Encyclopedia of Philosophy (winter 2017 ed.), Edward N. Zalta (Ed.). Metaphysics Research Lab, Stanford University. https://plato.stanford.edu/archives/win2017/entries/plato-ethics/",
      "doi": ""
    },
    {
      "text": "Samuel Freeman. 1994. Utilitarianism, Deontology, and the Priority of Right. Philosophy & Public Affairs 23, 4 (Oct. 1994), 313--349. DOI: http://dx.doi.org/10.1111/j.1088--4963.1994.tb00017.x",
      "doi": ""
    },
    {
      "text": "M Fumagalli, Roberta Ferrucci, F Mameli, Sara Marceglia, Simona Mrakic-Sposta, Stefano Zago, Claudio Lucchiari, D Consonni, F Nordio, G Pravettoni, and others. 2010. Gender-related differences in moral judgments. Cognitive processing 11, 3 (2010), 219--226. DOI: http://dx.doi.org/10.1016/j.jesp.2009.01.003",
      "doi": ""
    },
    {
      "text": "Victor Grassian. 1981. Moral reasoning: Ethical theory and some contemporary moral problems. Prentice-Hall Wilmington California.",
      "doi": ""
    },
    {
      "text": "Kurt Gray and Chelsea Schein. 2012. Two Minds Vs. Two Philosophies: Mind Perception Defines Morality and Dissolves the Debate Between Deontology and Utilitarianism. Review of Philosophy and Psychology 3, 3 (Sept. 2012), 405--423. DOI: http://dx.doi.org/10.1007/s13164-012-0112--5",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology, Peter A. Hancock and Najmedin Meshkati (Ed.). Human Mental Workload, Vol. 52. North-Holland, 139--183. http://www.sciencedirect.com/science/article/pii/S0166411508623869",
      "doi": ""
    },
    {
      "text": "Roslin V Hauck, H Atabakhsb, Pichai Ongvasith, Harsh Gupta, and Hsinchun Chen. 2002. Using Coplink to analyze criminal-justice data. Computer 35, 3 (2002), 30--37. DOI: http://dx.doi.org/10.1109/2.989927",
      "doi": "10.1109/2.989927"
    },
    {
      "text": "Patricia M King and Matthew J Mayhew. 2002. Moral judgement development in higher education: Insights from the Defining Issues Test. Journal of moral education 31, 3 (2002), 247--270. https://doi.org/10.1080/0305724022000008106",
      "doi": ""
    },
    {
      "text": "Judith Lichtenberg. 2001. The ethics of retaliation. Philosophy and Public Policy Quarterly 21, 4 (2001), 4--8. http://ojs2.gmu.edu/PPPQ/article/view/366",
      "doi": ""
    },
    {
      "text": "Patrick Lin. 2015. Why ethics matters for autonomous cars. In Autonomes fahren. Springer, 69--85. DOI: http://dx.doi.org/10.1007/978--3--662--48847--8",
      "doi": ""
    },
    {
      "text": "Caitlin Lustig, Katie Pine, Bonnie Nardi, Lilly Irani, Min Kyung Lee, Dawn Nafus, and Christian Sandvig. 2016. Algorithmic authority: the ethics, politics, and economics of algorithms that interpret, decide, and manage. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1057--1062. DOI: http://dx.doi.org/10.1145/2851581.2886426",
      "doi": "10.1145/2851581.2886426"
    },
    {
      "text": "Terrance McConnell. 2002. Moral Dilemmas. (April 2002). https://plato.stanford.edu/archives/fall2014/ entries/moral-dilemmas/",
      "doi": ""
    },
    {
      "text": "Lee Kwan Min and Jung Younbo. 2005. Evolutionary nature of virtual experience. Journal of Cultural and Evolutionary Psychology 3 (2005), 159--178. https://akademiai.com/doi/abs/10.1556/JCEP.3.2005.2.4",
      "doi": ""
    },
    {
      "text": "Alexander G Mirnig and Alexander Meschtscherjakov. 2019. Trolled by the Trolley Problem: On What Matters for Ethical Decision Making in Automated Vehicles. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 509. DOI: http://dx.doi.org/10.1145/3290605.3300739",
      "doi": "10.1145/3290605.3300739"
    },
    {
      "text": "United Nations. 1985. Convention against torture and other cruel, inhuman or degrading treatment or punishment. https://legal.un.org/avl/ha/catcidtp/catcidtp.html",
      "doi": ""
    },
    {
      "text": "C. David Navarrete, Melissa M. McDonald, Michael L. Mott, and Benjamin Asher. 2012. Virtual morality: Emotion and action in a simulated three-dimensional ?trolley problem\". Emotion 12, 2 (2012), 364--370. DOI: http://dx.doi.org/10.1037/a0025561",
      "doi": ""
    },
    {
      "text": "Indrajeet Patil, Carlotta Cogoni, Nicola Zangrando, Luca Chittaro, and Giorgia Silani. 2014. Affective basis of judgment-behavior discrepancy in virtual experiences of moral dilemmas. Social Neuroscience 9, 1 (Feb. 2014), 94--107. DOI: http://dx.doi.org/10.1080/17470919.2013.870091",
      "doi": ""
    },
    {
      "text": "Hernán Reyes. 2007. The worst scars are in the mind: psychological torture. International Review of the Red Cross 89, 867 (2007), 591--617. https://doi.org/10.1017/S1816383107001300",
      "doi": ""
    },
    {
      "text": "Barbara O Rothbaum, Larry F Hodges, David Ready, Ken Graap, and Renato D Alarcon. 2001. Virtual reality exposure therapy for Vietnam veterans with posttraumatic stress disorder. The Journal of clinical psychiatry (2001). https://doi.org/10.4088/JCP.v62n0808",
      "doi": ""
    },
    {
      "text": "Aitor Rovira, David Swapp, Bernhard Spanlang, and Mel Slater. 2009. The use of virtual reality in the study of people's responses to violent incidents. Frontiers in Behavioral Neuroscience 3 (2009). https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2802544/",
      "doi": ""
    },
    {
      "text": "Neal E Seymour, Anthony G Gallagher, Sanziana A Roman, Michael K O'brien, Vipin K Bansal, Dana K Andersen, and Richard M Satava. 2002. Virtual reality training improves operating room performance: results of a randomized, double-blinded study. Annals of surgery 236, 4 (2002), 458. DOI: http://dx.doi.org/10.1097/00000658--200210000-00008",
      "doi": ""
    },
    {
      "text": "Alexander Skulmowski, Andreas Bunge, Kai Kaspar, and Gordon Pipa. 2014. Forced-choice decision-making in modified trolley dilemma situations: a virtual reality and eye tracking study. Frontiers in Behavioral Neuroscience 8 (2014), 426. DOI: http://dx.doi.org/10.3389/fnbeh.2014.00426",
      "doi": ""
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A Framework for Immersive Virtual Environments (FIVE): Speculations on the Role of Presence in Virtual Environments. Presence: Teleoperators & Virtual Environments 6 (1997), 603--616. https://doi.org/10.1162/pres.1997.6.6.603",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Stephen J Thoma. 1986. Estimating gender differences in the comprehension and preference of moral issues. Developmental review 6, 2 (1986), 165--180. https://doi.org/10.1016/0273--2297(86)90010--9",
      "doi": ""
    },
    {
      "text": "Judith Jarvis Thomson. 1984. The Trolley Problem Comment. Yale Law Journal 94 (1984), 1395--1415. https://heinonline.org/HOL/P?h=hein.journals/ylr94&i=1415",
      "doi": ""
    },
    {
      "text": "John Torous, Maria K Wolters, Greg Wadley, and Rafael A Calvo. 2019. 4 th Symposium on Computing and Mental Health: Designing Ethical eMental Health Services. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Sym05. DOI: http://dx.doi.org/10.1145/3290607.3298997",
      "doi": "10.1145/3290607.3298997"
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and accountability design needs for algorithmic support in high-stakes public sector decision-making. In Proceedings of the 2018 chi conference on human factors in computing systems. ACM, 440. DOI: http://dx.doi.org/10.1145/3173574.3174014",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Allison Woodruff, Sarah E Fox, Steven Rousso-Schindler, and Jeffrey Warshaw. 2018. A qualitative exploration of perceptions of algorithmic fairness. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 656. DOI: http://dx.doi.org/10.1145/3173574.3174230",
      "doi": "10.1145/3173574.3174230"
    }
  ]
}