{
  "doi": "10.1145/3313831.3376662",
  "title": "Ownership, Privacy, and Control in the Wake of Cambridge Analytica: The Relationship between Attitudes and Awareness",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Has widespread news of abuse changed the public's perceptions of how user-contributed content from social networking sites like Facebook and LinkedIn can be used? We collected two datasets that reflect participants' attitudes about content ownership, privacy, and control, one in April 2018, while Cambridge Analytica was still in the news, and another in February 2019, after the event had faded from the headlines, and aggregated the data according to participants' awareness of the story, contrasting the attitudes of those who reported the greatest awareness with those who reported the least. Participants with the greatest awareness of the news story's details have more polarized attitudes about reuse, especially the reuse of content as data. They express a heightened desire for data mobility, greater concern about networked privacy rights, increased skepticism of algorithmically targeted advertising and news, and more willingness for social media platforms to demand corrections of inaccurate or deceptive content.",
  "tags": [
    "linkedin",
    "facebook",
    "data monetization",
    "data use",
    "cambridge analytica",
    "social media attitudes, ownership",
    "privacy"
  ],
  "authors": [
    {
      "name": "Frank M. Shipman",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/do/10.1145/contrib-81100155993/rel-imgonly/me-2009.jpg",
      "acmid": "81100155993",
      "orcid": "missing"
    },
    {
      "name": "Catherine C. Marshall",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100281009",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahler, D.J., Roush, C.E., and Sood, G. (2019) The Micro-Task Market for Lemons: Data Quality on Amazon's Mechanical Turk. Proc. 2019 Meeting of Midwest Political Science Assn, ret. July 22, 2019.",
      "doi": ""
    },
    {
      "text": "Baumer, E., Adams, P., Khovanskaya, V., Liao, T., Smith, M.E., Sosik, V., and Williams, K. (2013) Limiting, leaving, and (re)lapsing: an exploration of facebook non-use practices and experiences. Proc. CHI '13, ACM Press, NY, 3257--3266.",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Beck, J. (2018) People Are Changing the Way They Use Social Media. The Atlantic, June 7, 2018.",
      "doi": ""
    },
    {
      "text": "Beck, J. (2019) Facebook: Where Friendships Go to Never Quite Die. The Atlantic, February 4, 2019.",
      "doi": ""
    },
    {
      "text": "Bentley, F., Daskalova, N., and White, B. (2017) Comparing the Reliability of Amazon Mechanical Turk and Survey Monkey to Traditional Market Research Surveys. Proc. CHI EA '17. ACM, NY, NY, USA, 1092--1099.",
      "doi": ""
    },
    {
      "text": "boyd, d. and Heer, J. (2006). Profiles as conversation: networked identity performance on Friendster. In Proceedings of the Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Chandrasekharan, E., Samory, M. Jhaver, S., Charvat, H. Bruckman, A., Lampe, C., Eisenstein, J., and Gilbert, E. (2018), The Internet's Hidden Rules: An Empirical Study of Reddit Norm Violations at Micro, Meso, and Macro Scales. Proceedings of the ACM on Human-Computer Interaction, Vol. 2, Article No. 32.",
      "doi": "10.1145/3274301"
    },
    {
      "text": "Child, J. T., Pearson, J. C., & Petronio, S. (2009). Blogging, communication, and privacy management: Development of the blogging privacy management measure. Journal of the American Society for Information Science and Technology, 60 (10), 2079-- 2094.",
      "doi": "10.5555/1655884.1655894"
    },
    {
      "text": "Das, S. and Kramer, A. (2013) Self-censorship on Facebook. Proc. ICWSM 2013, 120--127.",
      "doi": ""
    },
    {
      "text": "Difallah, D., Filatova, E., and Ipeirotis, P. (2018) Demographics and Dynamics of Mechanical Turk Workers. Proc. WSDM'18, https://doi.org/10.1145/3159652.3159661.",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Duffy, B. E., and Chan, N. K. (2019) \"You never really know who's looking\": Imagined surveillance across social media platforms. New Media & Society, 21(1), 119--138.",
      "doi": ""
    },
    {
      "text": "Edwards, J.L. (2019) An Examination of Consumers' Social Media Trust In the Wake of the Facebook and Cambridge Analytica Scandal. Unpublished Thesis, Kalamazoo College.",
      "doi": ""
    },
    {
      "text": "Ellickson, R. (1994) Order Without Law. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Farnham S. & Churchill, E. (2011) Faceted identity, faceted lives: social and technical issues with being yourself online. Proc CSCW '11, 359--368.",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "Fiesler, C. and Bruckman, A.S. (2014) Remixers' Understandings of Fair Use Online. Proc. CSCW '14.",
      "doi": "10.1145/2531602.2531695"
    },
    {
      "text": "Fiesler, C. and Hallinan, B. (2018) \"We Are the Product\": Reactions to Online Data Sharing Controversies in the Media. Proc CHI 2018.",
      "doi": ""
    },
    {
      "text": "Fiesler, C., Lampe, C., and Bruckman, A. (2016) Reality and Perception of Copyright Terms of Service for Online Content Creation. Proc. CSCW'16.",
      "doi": "10.1145/2818048.2819931"
    },
    {
      "text": "Flintham, M., Karner, C., Bachour, K., Creswich, H., Gupta, N. & Moran, S. (2018) Falling for Fake News: Investigating the Consumption of News via Social Media. Proc. CHI '18, ACM Press, NY.",
      "doi": "10.1145/3173574.3173950"
    },
    {
      "text": "Granville, K. (2018) Facebook and Cambridge Analytica: What You Need to Know as Fallout Widens. The New York Times, March 19, 2018.",
      "doi": ""
    },
    {
      "text": "Grimmelmann, J. (2019) Continuity and Change in Internet Law. CACM, vol. 62, no. 5, 24--26.",
      "doi": "10.1145/3319077"
    },
    {
      "text": "Hewitt, A., & Forte, A. (2006). Crossing boundaries: Identity management and student/faculty relationships on the Facebook. ACM Special Interest Group on Computer-Supported Cooperative Work, Banff, Canada.",
      "doi": ""
    },
    {
      "text": "Isaak, J. and Hanna, M.J. (2018) User Data Privacy: Facebook, Cambridge Analytica, and Privacy Protection. Computer 51, 8 (August 2018), 56--59.",
      "doi": "10.1109/MC.2018.3191268"
    },
    {
      "text": "Jiang, J.A., Fiesler, C., and Brubaker, J.R. (2018) \"The Perfect One\": Understanding Communication Practices and Challenges with Animated GIFs. Proc. CSCW '18, ACM Press, NY.",
      "doi": "10.1145/3274349"
    },
    {
      "text": "Kang, R., Dabbish, L., Fruchter, N., and Kiesler, S. (2015) \"My Data Just Goes Everywhere\": User Mental Models of the Internet and Implications for Privacy and Security. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS) 2015.",
      "doi": ""
    },
    {
      "text": "Lindley, S., Marshall, C.C., Banks, R., Sellen, A. & Regan, T. (2013) Rethinking the web as a personal archive. In Proc. WWW 2013, 749--760.",
      "doi": "10.1145/2488388.2488454"
    },
    {
      "text": "Loveland, F. (1960) The Classification Program in the Federal Prison System: 1934--1960. Journal of Federal Probation, 24 (June 1960), 7--12.",
      "doi": ""
    },
    {
      "text": "MacCormick and Summers, (eds.) Interpreting Precedents, Ashgate/Dartmouth, 1997, 528--529.",
      "doi": ""
    },
    {
      "text": "Madden, M., & Smith, A. (2010) Reputation management and social media: How people monitor their identity and search for others online. Washington, D.C.: Pew Internet & American Life Project.",
      "doi": ""
    },
    {
      "text": "Marshall, C.C. & Lindley, S. (2014) Motivations and Strategies for Self-Search. Proc. CHI'14, 3675--3684.",
      "doi": ""
    },
    {
      "text": "Marshall, C.C. and Shipman, F.M. (2015) Exploring the Ownership and Persistent Value of Facebook Content. Proc. CSCW'15, ACM Press, NY.",
      "doi": ""
    },
    {
      "text": "Marshall, C.C. and Shipman, F.M. (2017) Who Owns the Social Web? Communications of the ACM 60, 5, 52--61.",
      "doi": "10.1145/2996181"
    },
    {
      "text": "Marshall, C.C. and Shipman, F.M. (2019) The Ownership and Control of Online Photos and Game Data. Proc. JCDL'19, IEEE Press.",
      "doi": ""
    },
    {
      "text": "Marwick, A. E. and boyd, d. (2014). Networked privacy: How teenagers negotiate context in social media. New Media & Society, 16(7), 1051--1067.",
      "doi": ""
    },
    {
      "text": "May, C. (2003). Digital rights management and the breakdown of social norms. First Monday, 8(11).",
      "doi": ""
    },
    {
      "text": "Micallef, N. and Misra, G. (2018) Towards designing a mobile app that creates avatars for privacy protection. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '18). ACM, NY, NY, USA, 79--86.",
      "doi": "10.1145/3236112.3236123"
    },
    {
      "text": "Nissenbaum, H. (2009). Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Norberg, P.A., Horne, D.R., and Horne, D.A. (2007) The privacy paradox: Personal information disclosure intentions versus behaviors. Journal of Consumer Affairs 41, 1 (2007), 100--126.",
      "doi": "10.1111/j.1745-"
    },
    {
      "text": "Perrin, A. (2018) Americans are changing their relationship with Facebook. Washington: Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Phelan. C., Lampe, C., and Resnick, P. (2016) It's Creepy, But It Doesn't Bother Me, Proceedings of CHI 2016, 5240--5251.",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "Pierce, J., Lee, L., Gilpin, E. (1994) Smoking Initiation by Adolescent Girls, 1944 through 1988: An Association with Targeted Advertising. JAMA 271(8), 608--611.",
      "doi": ""
    },
    {
      "text": "Rissland, E.L., (1989) Dimension-based Analysis of Hypotheticals from Supreme Court Oral Argument. Proc. ICAIL-89, ACM Press, pp. 111--120.",
      "doi": ""
    },
    {
      "text": "Smith, A. & Anderson, M. (2018) Social Media Use in 2018. Pew Research Center (Internet & Technology), March 1, 2018.",
      "doi": ""
    },
    {
      "text": "Strauss, A. and Corbin, J. (1998) Basics of Qualitative Research, Sage Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Stutzman F. & Kramer-Duffield, J. (2010) Friends only: examining a privacy-enhancing behavior in facebook. Proc. CHI '10, 1553--1562.",
      "doi": "10.1145/1753326.1753559"
    },
    {
      "text": "Tehranian, J. (2007) Infringement Nation: Copyright Reform and the Law/Norm Gap. Utah Law Review, vol. 3, 537--550.",
      "doi": ""
    },
    {
      "text": "Wang, Y., Komanduri, S., Leon, P. G., Norcie, G., Acquisti, A., and Cranor, L. (2011) \"I regretted the minute I pressed share\": A Qualitative Study of Regrets on Facebook. SOUPS'11,",
      "doi": "10.1145/2078827.2078841"
    },
    {
      "text": "Woodruff, A. (2014) Necessary, Unpleasant, and Disempowering: Reputation Management in the Internet Age. Proc. CHI '14, 149--158.",
      "doi": "10.1145/2556288.2557126"
    },
    {
      "text": "Zhao, X, Lampe, C, Ellison, NB (2016) The social media ecology: user perceptions, strategies and challenges. Proc. CHI'16, 89--100.",
      "doi": "10.1145/2858036.2858333"
    },
    {
      "text": "Zittrain, J. Meme patrol. Future of the Internet blog post dated March 21, 2012. Retrieved September 13, 2019.",
      "doi": ""
    }
  ]
}