{
  "doi": "10.1145/3313831.3376670",
  "title": "Vipo: Spatial-Visual Programming with Functions for Robot-IoT Workflows",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Mobile robots and IoT (Internet of Things) devices can increase productivity, but only if they can be programmed by workers who understand the domain. This is especially true in manufacturing. Visual programming in the spatial context of the operating environment can enable mental models at a familiar level of abstraction. However, spatial-visual programming is still in its infancy; existing systems lack IoT integration and fundamental constructs, such as functions, that are essential for code reuse, encapsulation, or recursive algorithms. We present Vipo, a spatial-visual programming system for robot-IoT workflows. Vipo was designed with input from managers at six factories using mobile robots. Our user study (n=22) evaluated efficiency, correctness, comprehensibility of spatial-visual programming with functions.",
  "authors": [
    {
      "name": "Gaoping Huang",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659184538",
      "orcid": "missing"
    },
    {
      "name": "Pawan S. Rao",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475513",
      "orcid": "missing"
    },
    {
      "name": "Meng-Han Wu",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659369948",
      "orcid": "missing"
    },
    {
      "name": "Xun Qian",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475205",
      "orcid": "0000-0003-1976-7992"
    },
    {
      "name": "Shimon Y. Nof",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100134693",
      "orcid": "missing"
    },
    {
      "name": "Karthik Ramani",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502255",
      "orcid": "0000-0001-8639-5135"
    },
    {
      "name": "Alexander J. Quinn",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526997",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Colin Archibald and Emil Petriu. 1993. Model for skills-oriented robot programming (SKORP). In Applications of Artifcial Intelligence 1993: Machine Vision and Robotics, Vol. 1964. International Society for Optics and Photonics, World Scientifc, Orlando, FL, 392--403.",
      "doi": ""
    },
    {
      "text": "Maria Bermudez-Edo, Tarek Elsaleh, Payam Barnaghi, and Kerry Taylor. 2016. IoT-Lite: a lightweight semantic model for the Internet of Things. In 2016 Intl IEEE Conferences on Ubiquitous Intelligence & Computing, Advanced and Trusted Computing, Scalable Computing and Communications, Cloud and Big Data Computing, Internet of People, and Smart World Congress (UIC/ATC/ScalCom/CBDCom/IoP/SmartWorld). IEEE, IEEE Computer Society, Washington, D.C., 90--97.",
      "doi": ""
    },
    {
      "text": "Aude Billard, Sylvain Calinon, Rüdiger Dillmann, and Stefan Schaal. 2008. Robot Programming by Demonstration. In Springer Handbook of Robotics, Bruno Siciliano and Oussama Khatib (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 1371--1394. DOI: http://dx.doi.org/10.1007/978--3--540--30301--5_60",
      "doi": ""
    },
    {
      "text": "Michael Blackstock and Rodger Lea. 2012. WoTKit: A Lightweight Toolkit for the Web of Things. In Proceedings of the Third International Workshop on the Web of Things (WOT '12). ACM, NY, NY, USA, 3:1--3:6. DOI: http://dx.doi.org/10.1145/2379756.2379759",
      "doi": ""
    },
    {
      "text": "Michael Blackstock and Rodger Lea. 2014. Toward a Distributed Data Flow Platform for the Web of Things (Distributed Node-RED). In Proceedings of the 5th International Workshop on Web of Things (WoT '14). ACM, NY, NY, USA, 34--39. DOI: http://dx.doi.org/10.1145/2684432.2684439",
      "doi": "10.1145/2684432.2684439"
    },
    {
      "text": "Alan F. Blackwell and Thomas R. G. Green. 2000. A Cognitive Dimensions questionnaire optimised for users. (2000). http://ppig.org/library/paper/ cognitive-dimensions-questionnaire-optimised-users",
      "doi": ""
    },
    {
      "text": "Thorsten Blecker and Nizar Abdelkaf. 2006. Mass Customization: State-of-the-Art and Challenges. In Mass Customization: Challenges and Solutions, Thorsten Blecker and Gerhard Friedrich (Eds.). Springer US, Boston, MA, 1--25. DOI: http://dx.doi.org/10.1007/0--387--32224--8_1",
      "doi": ""
    },
    {
      "text": "Blockly. Retrieved 2019. Blockly. (Retrieved 2019). https://developers.google.com/blockly/",
      "doi": ""
    },
    {
      "text": "Simon Bøgh, Oluf Skov Nielsen, Mikkel Rath Pedersen, Volker Krüger, and Ole Madsen. 2012. Does your robot have skills?. In Proceedings of the 43rd International Symposium on Robotics, Vol. 6. Verlag, VDE Verlag GMBH, Berlin, Germany, 1--6.",
      "doi": ""
    },
    {
      "text": "Yuanzhi Cao, Zhuangying Xu, Fan Li, Wentao Zhong, Ke Huo, and Karthik Ramani. 2019. V.Ra: An In-Situ Visual Authoring System for Robot-IoT Task Planning with Augmented Reality. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, NY, NY, USA, 1059--1070. DOI: http://dx.doi.org/10.1145/3322276.3322278",
      "doi": "10.1145/3322276.3322278"
    },
    {
      "text": "Stéphane Conversy, Jérémie Garcia, Guilhem Buisan, Mathieu Cousy, Mathieu Poirier, Nicolas Saporito, Damiano Taurino, Giuseppe Frau, and Johan Debattista. 2018. Vizir: A Domain-Specifc Graphical Language for Authoring and Operating Airport Automations. In UIST 2018, 31st ACM Symposium on User Interface Software and Technology (2018--10) (UIST '18 The 31st Annual ACM Symposium on User Interface Software and Technology). ACM SIGCHI, New York, NY, USA, Pages 261--273/ ISBN: 978--1--4503--5948--1. DOI: http://dx.doi.org/10.1145/3242587.3242623",
      "doi": "10.1145/3242587.3242623"
    },
    {
      "text": "C. Datta, C. Jayawardena, I. H. Kuo, and B. A. MacDonald. 2012. RoboStudio: A visual programming environment for rapid authoring and customization of complex services on a personal service robot. In 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems (2012--10). IEEE, Vilamoura, Algarve, Portugal, 2352--2357. DOI: http://dx.doi.org/10.1109/IROS.2012.6386105",
      "doi": ""
    },
    {
      "text": "J. P. Diprose, B. A. MacDonald, and J. G. Hosking. 2011. Ruru: A spatial and interactive visual programming language for novice robot programming. In 2011 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC) (2011-09). IEEE, New York, NY, USA, 25--32. DOI: http://dx.doi.org/10.1109/VLHCC.2011.6070374",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Fraser Anderson, Tovi Grossman, Michelle Annett, Pourang Irani, and George Fitzmaurice. 2017. Ivy: Exploring Spatially Situated Visual Programming for Authoring and Understanding Intelligent Environments. In Proceedings of the 43rd Graphics Interface Conference (2017) (GI '17). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 156--162. DOI: http://dx.doi.org/10.20380/GI2017.20 event-place: Edmonton, Alberta, Canada.",
      "doi": "10.5555/3141475.3141507"
    },
    {
      "text": "T. Fong, C. Thorpe, and C. Baur. 2003. Multi-Robot Remote Driving with Collaborative Control. IEEE Transactions on Industrial Electronics 50, 4 (Aug. 2003), 699--704. DOI: http://dx.doi.org/10.1109/TIE.2003.814768",
      "doi": ""
    },
    {
      "text": "L.A. Grieco, A. Rizzo, S. Colucci, S. Sicari, G. Piro, D. Di Paola, and G. Boggia. 2014. IoT-Aided Robotics Applications. Comput. Commun. 54, C (Dec. 2014), 32--47. DOI: http://dx.doi.org/10.1016/j.comcom.2014.07.013",
      "doi": ""
    },
    {
      "text": "Justin Huang and Maya Cakmak. 2017. Code3: A system for end-to-end programming of mobile manipulator robots for novices and experts. In 2017 12th ACM/IEEE International Conference on Human-Robot Interaction (HRI. IEEE, IEEE, New York, NY, USA, 453--462.",
      "doi": "10.1145/2909824.3020215"
    },
    {
      "text": "Justin Huang, Tessa Lau, and Maya Cakmak. 2016. Design and Evaluation of a Rapid Programming System for Service Robots. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 295--302. http://dl.acm.org/citation.cfm?id=2906831.2906883",
      "doi": "10.5555/2906831.2906883"
    },
    {
      "text": "Urs Hunkeler, Hong Linh Truong, and Andy Stanford-Clark. 2008. MQTT-S-A publish/subscribe protocol for GWireless Sensor Networks. In 2008 3rd International Conference on Communication Systems Software and Middleware and Workshops (COMSWARE'08). IEEE, IEEE, New York, NY, USA, 791--798.",
      "doi": ""
    },
    {
      "text": "Ke Huo, Yuanzhi Cao, Sang Ho Yoon, Zhuangying Xu, Guiming Chen, and Karthik Ramani. 2018. Scenariot: Spatially Mapping Smart Things Within Augmented Reality Scenes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 219, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173793",
      "doi": "10.1145/3173574.3173793"
    },
    {
      "text": "ifttt. Retrieved 2019. IFTTT. (Retrieved 2019). https://ifttt.com",
      "doi": ""
    },
    {
      "text": "J. Jackson. 2007. Microsoft robotics studio: A technical introduction. IEEE Robotics & Automation Magazine 14, 4 (2007), 82--87. DOI: http://dx.doi.org/10.1109/M-RA.2007.905745",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2014. Kitty: Sketching Dynamic and Interactive Illustrations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 395--405. DOI: http://dx.doi.org/10.1145/2642918.2647375",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "James Floyd Kelly. 2010. Lego Mindstorms NXT-G Programming Guide. Apress, New York City, New York, USA.",
      "doi": ""
    },
    {
      "text": "Kexi Liu, Daisuke Sakamoto, Masahiko Inami, and Takeo Igarashi. 2011. Roboshop: Multi-Layered Sketching Interface for Robot Housework Assignment and Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). Association for Computing Machinery, New York, NY, USA, 647--656. DOI: http://dx.doi.org/10.1145/1978942.1979035",
      "doi": "10.1145/1978942.1979035"
    },
    {
      "text": "Joaquin López, Diego Pérez, and Eduardo Zalama. 2011. A framework for building mobile single and multi-robot applications. Robotics and Autonomous Systems 59, 3--4 (2011), 151--162.",
      "doi": "10.1016/j.robot.2011.01.004"
    },
    {
      "text": "Eric Miller. 1998. An Introduction to the Resource Description Framework. Bulletin of the American Society for Information Science and Technology 25, 1 (1998), 15--19. DOI: http://dx.doi.org/10.1002/bult.105",
      "doi": ""
    },
    {
      "text": "Gérard Morel, Carlos Eduardo Pereira, and SY Nof. 2019. Historical survey and emerging challenges of manufacturing automation modeling and control: A systems architecting perspective. Annual Reviews in Control 47 (2019), 21--34.",
      "doi": ""
    },
    {
      "text": "Mikkel Rath Pedersen, Dennis Levin Herzog, and Volker Krüger. 2014. Intuitive skill-level programming of industrial handling tasks on a mobile manipulator. In 2014 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, IEEE, New York, NY, USA, 4523--4530.",
      "doi": ""
    },
    {
      "text": "Emmanuel Pot, Jérôme Monceaux, Rodolphe Gelin, and Bruno Maisonnier. 2009. Choregraphe: a graphical tool for humanoid robot programming. In RO-MAN 2009-The 18th IEEE International Symposium on Robot and Human Interactive Communication. IEEE, IEEE, New York, NY, USA, 46--51.",
      "doi": ""
    },
    {
      "text": "Morgan Quigley, Ken Conley, Brian Gerkey, Josh Faust, Tully Foote, Jeremy Leibs, Rob Wheeler, and Andrew Y. Ng. 2009. ROS: an open-source Robot Operating System. In ICRA workshop on open source software in robotics (2009), Vol. 3. IEEE, New York, NY, USA, 5.",
      "doi": ""
    },
    {
      "text": "Partha P. Ray. 2016. Internet of Robotic Things: Concept, Technologies, and Challenges. IEEE Access 4 (2016), 9489--9500. DOI: http://dx.doi.org/10.1109/ACCESS.2017.2647747",
      "doi": ""
    },
    {
      "text": "Michaela R Reisinger, Johann Schrammel, and Peter Fröhlich. 2017. Visual languages for smart spaces: End-user programming between data-fow and form-flling. In 2017 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, IEEE, New York, NY, USA, 165--169.",
      "doi": ""
    },
    {
      "text": "Leonard Richardson and Sam Ruby. 2008. RESTful web services. \" O'Reilly Media, Inc.\", Sebastopol, CA.",
      "doi": ""
    },
    {
      "text": "Fetch Robotics. Retrieved 2019. Cloud Robotics and Automation: FetchCore from Fetch Robotics. (Retrieved 2019). https://fetchrobotics.com/",
      "doi": ""
    },
    {
      "text": "Peter Saint-Andre. 2011. Extensible messaging and presence protocol (XMPP): Core. Technical Report. Cisco.",
      "doi": ""
    },
    {
      "text": "Zach Shelby, Klaus Hartke, and Carsten Bormann. 2014. The constrained application protocol (CoAP). Technical Report. Universitaet Bremen TZI.",
      "doi": ""
    },
    {
      "text": "Franz Steinmetz, Annika Wollschläger, and Roman Weitschat. 2018. RAZER-A HRI for Visual Task-Level Programming and Intuitive Skill Parameterization. IEEE Robotics and Automation Letters 3, 3 (2018), 1362--1369.",
      "doi": ""
    },
    {
      "text": "Daniel Szafr, Bilge Mutlu, and Terrence Fong. 2017. Designing planning and control interfaces to support user collaboration with fying robots. The International Journal of Robotics Research 36, 5--7 (2017), 514--542. DOI: http://dx.doi.org/10.1177/0278364916688256",
      "doi": ""
    },
    {
      "text": "Steve Vinoski. 2006. Advanced message queuing protocol. IEEE Internet Computing 10, 6 (2006), 87--89.",
      "doi": "10.1109/mic.2006.116"
    },
    {
      "text": "Igor Zubrycki, Marcin Kolesi´ nski, and Grzegorz Granosik. 2017. Graphical programming interface for enabling non-technical professionals to program robots and internet-of-things devices. In International Work-Conference on Artifcial Neural Networks. Springer, Springer, Cham, New York, NY, USA, 620--631.",
      "doi": ""
    }
  ]
}