{
  "doi": "10.1145/3313831.3376466",
  "title": "A Probabilistic Grammar of Graphics",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Visualizations depicting probabilities and uncertainty are used everywhere from medical risk communication to machine learning, yet these probabilistic visualizations are difficult to specify, prone to error, and their designs are cumbersome to explore. We propose a Probabilistic Grammar of Graphics (PGoG), an extension to Wilkinson's original framework. Inspired by the success of probabilistic programming languages, PGoG makes probability expressions, such as P(A|B), a first-class citizen in the language. PGoG abstractions also reflect the distinction between probability and frequency framing, a concept from the uncertainty communication literature. It is expressive, encompassing product plots, density plots, icon arrays, and dotplots, among other visualizations. Its coherent syntax ensures correctness (that the proportions of visual elements and their spatial placement reflect the underlying probability distribution) and reduces edit distance between probabilistic visualization specifications, potentially supporting more design exploration. We provide a proof-of-concept implementation of PGoG in R.",
  "authors": [
    {
      "name": "Xiaoying Pu",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-99659365409/rel-imgonly/bio-photo.jpg",
      "acmid": "99659365409",
      "orcid": "0000-0003-4619-7278"
    },
    {
      "name": "Matthew Kay",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659510709",
      "orcid": "0000-0001-9446-0419"
    }
  ],
  "references": [
    {
      "text": "2020. PAIR-Code/Facets. PAIR code. (Jan. 2020). https://github.com/PAIR-code/facets.",
      "doi": ""
    },
    {
      "text": "Corinne Abrams. 2019. \"You Have to Actually Cut Open Mumbai's Belly'-Inside One of the World's Most Audacious Transit Projects. Wall Street Journal (Jan. 2019). https://www.wsj.com/articles/through-monsoonsaround-slums-under-templesmumbai-builds-its-firstsubway-11546803877.",
      "doi": ""
    },
    {
      "text": "Sarah Almukhtar, Mike Andre, Wilson Andrews, Matthew Bloch, and et al. 2018. Live Forecast: Who Will Win the House? The New York Times (Nov. 2018). https://www.nytimes.com/interactive/2018/11/06/us/ elections/results-house-forecast.html,https://www.nytimes.com/interactive/2018/11/06/us/elections/ results-house-forecast.html.",
      "doi": ""
    },
    {
      "text": "Emily Badger, Claire Ann Miller, Adam Pearce, and Kevin Quealy. 2018. Income Mobility Charts for Girls, Asian-Americans and Other Groups. Or Make Your Own. New York Times (March 2018). https://www.nytimes.com/interactive/2018/03/27/upshot/ make-your-own-mobility-animation.html",
      "doi": ""
    },
    {
      "text": "Karin Binder, Stefan Krauss, and Georg Bruckmaier. 2015. Effects of visualizing statistical information -- an empirical study on tree diagrams and 2 × 2 tables. Frontiers in Psychology 6 (2015). DOI: http://dx.doi.org/10.3389/fpsyg.2015.01186",
      "doi": ""
    },
    {
      "text": "A. F. Blackwell, C. Britton, A. Cox, T. R. G. Green, C. Gurr, G. Kadoda, M. S. Kutar, M. Loomes, C. L. Nehaniv, M. Petre, C. Roast, C. Roe, A. Wong, and R. M. Young. 2001. Cognitive Dimensions of Notations: Design Tools for Cognitive Technology. In Cognitive Technology: Instruments of Mind, Meurig Beynon, Chrystopher L. Nehaniv, and Kerstin Dautenhahn (Eds.). Springer Berlin Heidelberg, 325--341.",
      "doi": ""
    },
    {
      "text": "Aaron Bycoffe and Rachael Dottle. 2019. The 2020 Endorsement Primary. https://projects.fivethirtyeight.com/2020endorsements/democratic-primary/. (Feb. 2019).",
      "doi": ""
    },
    {
      "text": "Sean Carmody. 2010. Risk Characteriztion Theatres (RCT). https://github.com/seancarmody/stubborn-mule. (2010).",
      "doi": ""
    },
    {
      "text": "Bob Carpenter, Andrew Gelman, Matthew D. Hoffman, Daniel Lee, Ben Goodrich, Michael Betancourt, Marcus Brubaker, Jiqiang Guo, Peter Li, and Allen Riddell. 2017. Stan: A probabilistic programming language. Journal of statistical software 76, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Michael Correll, Dominik Moritz, and Jeffrey Heer. 2018. Value-Suppressing Uncertainty Palettes. Conference on Human Factors in Computing Systems CHI '18 (2018). DOI: http://dx.doi.org/10.1145/3173574.3174216 ISBN: 9781450356206.",
      "doi": ""
    },
    {
      "text": "D. R. Cox. 1978. Some remarks on the role in statistics of graphical methods. Journal of the Royal Statistical Society: Series C (Applied Statistics) 27, 1 (1978), 4--9.",
      "doi": ""
    },
    {
      "text": "Alan Dix (Ed.). 2004. Human-computer interaction (3rd ed ed.). Pearson/Prentice-Hall, Harlow, England ; New York.",
      "doi": ""
    },
    {
      "text": "Michael Fernandes, Logan Walls, Sean Munson, Jessica Hullman, and Matthew Kay. 2018. Uncertainty Displays Using Quantile Dotplots or CDFs Improve Transit Decision-Making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 144:1--144:12. DOI: http://dx.doi.org/10.1145/3173574.3173718 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3173718"
    },
    {
      "text": "Baruch Fischhoff, Noel Brewer, and Julie Downs. 2012. Communicating Risks and Benefits: An Evidence-Based User's Guide. Technical Report. 242 pages.",
      "doi": ""
    },
    {
      "text": "Mirta Galesic, Rocio Garcia-Retamero, and Gerd Gigerenzer. 2009. Using Icon Arrays to Communicate Medical Risks: Overcoming Low Numeracy. Health Psychology 28, 2 (2009), 210--216. DOI: http://dx.doi.org/10.1037/a0014474 ISBN: 0278--6133.",
      "doi": ""
    },
    {
      "text": "A.W. Geiger. 2018. 18 striking findings from 2018. Technical Report. https://www.pewresearch.org/facttank/2018/12/13/18-striking-findings-from-2018/",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer and Ulrich Hoffrage. 1995. How to improve Bayesian reasoning without instruction: Frequency formats. Psychological Review 102, 4 (1995), 684--704. DOI: http://dx.doi.org/10.1037/0033--295X.102.4.684 ISBN: 0033--295X\\r1939--1471.",
      "doi": ""
    },
    {
      "text": "Andrew D. Gordon, Thore Graepel, Nicolas Rolland, Claudio Russo, Johannes Borgstrom, and John Guiver. 2014a. Tabular: A Schema-driven Probabilistic Programming Language. In Proceedings of the 41st ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL '14). ACM, NY, NY, USA, 321--334. DOI: http://dx.doi.org/10.1145/2535838.2535850 event-place: San Diego, California, USA.",
      "doi": "10.1145/2535838.2535850"
    },
    {
      "text": "Andrew D. Gordon, Thomas A. Henzinger, Aditya V. Nori, and Sriram K. Rajamani. 2014b. Probabilistic Programming. In Proceedings of the on Future of Software Engineering (FOSE 2014). ACM, NY, NY, USA, 167--181. DOI: http://dx.doi.org/10.1145/2593882.2593900 event-place: Hyderabad, India.",
      "doi": ""
    },
    {
      "text": "Shunan Guo, Fan Du, Sana Malik, Eunyee Koh, Sungchul Kim, Zhicheng Liu, Donghyun Kim, Hongyuan Zha, and Nan Cao. 2019. Visualizing Uncertainty and Alternatives in Event Sequence Predictions. (2019), 12.",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2016. ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. https://ggplot2.tidyverse.org",
      "doi": "10.5555/1795559"
    },
    {
      "text": "Sarah T. Hawley, Brian Zikmund-Fisher, Peter Ubel, Aleksandra Jancovic, Todd Lucas, and Angela Fagerlin. 2008. The impact of the format of graphical presentation on health-related knowledge and treatment choices. Patient Education and Counseling 73, 3 (2008), 448--455. DOI: http://dx.doi.org/10.1016/j.pec.2008.07.023 ISBN: 0738--3991 (Print)\\r0738--3991 (Linking).",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Stuart K. Card, and James A. Landay. 2005. Prefuse: A Toolkit for Interactive Information Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 421--430. DOI: http://dx.doi.org/10.1145/1054972.1055031 event-place: Portland, Oregon, USA.",
      "doi": "10.1145/1054972.1055031"
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive Dynamics for Visual Analysis. Queue 10, 2 (Feb. 2012), 30:30--30:55. DOI: http://dx.doi.org/10.1145/2133416.2146416",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Jessica Hullman, Paul Resnick, and Eytan Adar. 2015. Hypothetical Outcome Plots Outperform Error Bars and Violin Plots for Inferences about Reliability of Variable Ordering. PLOS ONE 10, 11 (Nov. 2015), e0142444. DOI: http://dx.doi.org/10.1371/journal.pone.0142444",
      "doi": ""
    },
    {
      "text": "Haley Jeppson, Heike Hofmann, and Di Cook. 2019. ggmosaic: Mosaic Plots in the 'ggplot2' Framework. http://github.com/haleyjeppson/ggmosaic R package version 0.2.1.",
      "doi": ""
    },
    {
      "text": "Brian Johnson. 1992. TreeViz: treemap visualization of hierarchically structured information. In CHI, Vol. 92. 369--370.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Tara Kola, Jessica R Hullman, and Sean A Munson. 2016. When (ish) is My Bus?: User-centered Visualizations of Uncertainty in Everyday, Mobile Predictive Systems. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. 5092--5103. DOI: http://dx.doi.org/10.1145/2858036.2858558",
      "doi": "10.1145/2858036.2858558"
    },
    {
      "text": "Matthew Kay, Dan Morris, Mc Schraefel, and Julie A Kientz. 2013. There's No Such Thing as Gaining a Pound: Reconsidering the Bathroom Scale User Interface. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13 (2013), 401--410. DOI: http://dx.doi.org/10.1145/2493432.2493456 ISBN: 9781450317702.",
      "doi": "10.1145/2493432.2493456"
    },
    {
      "text": "Younghoon Kim, Kanit Wongsuphasawat, Jessica Hullman, and Jeffrey Heer. 2017. GraphScape: A Model for Automated Reasoning About Visualization Similarity and Sequencing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2628--2638. DOI: http://dx.doi.org/10.1145/3025453.3025866 event-place: Denver, Colorado, USA.",
      "doi": "10.1145/3025453.3025866"
    },
    {
      "text": "G. Kindlmann and C. Scheidegger. 2014. An Algebraic Process for Visualization Design. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec. 2014), 2181--2190. DOI: http://dx.doi.org/10.1109/TVCG.2014.2346325",
      "doi": ""
    },
    {
      "text": "Niko Kommenda, Caelainn Barr, Josh Holder, Niko Kommenda, Caelainn Barr, and Josh Holder. 2018. Gender Pay Gap: What We Learned and How to Fix It. The Guardian (April 2018). https://www.theguardian.com/news/ng-interactive/2018/apr/05/ women-are-paid-less-than-men-heres-how-to-fix-it.",
      "doi": ""
    },
    {
      "text": "John Kruschke. 2014. Doing Bayesian data analysis: A tutorial with R, JAGS, and Stan. Academic Press.",
      "doi": ""
    },
    {
      "text": "L. Liu, L. Padilla, S. H. Creem-Regehr, and D. H. House. 2019. Visualizing Uncertain Tropical Cyclone Predictions using Representative Samples from Ensembles of Forecast Tracks. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 882--891. DOI: http://dx.doi.org/10.1109/TVCG.2018.2865193",
      "doi": "10.1109/TVCG.2018.2865018"
    },
    {
      "text": "Jock Mackinlay. 1986. Automating the design of graphical presentations of relational information. ACM Transactions on Graphics (TOG) 5, 2 (April 1986), 110--141. DOI: http://dx.doi.org/10.1145/22949.22950",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "Michelle McDowell, Gerd Gigerenzer, Odette Wegwarth, and Felix G. Rebitschek. 2019. Effect of Tabular and Icon Fact Box Formats on Comprehension of Benefits and Harms of Prostate Cancer Screening: A Randomized Trial. Medical Decision Making 39, 1 (Jan. 2019), 41--56. DOI: http://dx.doi.org/10.1177/0272989X18818166",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2008. Process and Pitfalls in Writing Information Visualization Research Papers. In Information Visualization. Vol. 4950. Springer Berlin Heidelberg, Berlin, Heidelberg, 134--153. DOI: http://dx.doi.org/10.1007/978--3--540--70956--5_6",
      "doi": ""
    },
    {
      "text": "Jurriaan P. Oudhoff and Daniëlle R. M. Timmermans. 2015. The Effect of Different Graphical and Numerical Likelihood Formats on Perception of Likelihood and Choice. Medical Decision Making 35, 4 (May 2015), 487--500. DOI: http://dx.doi.org/10.1177/0272989X15576487",
      "doi": ""
    },
    {
      "text": "Deokgun Park, Steven Mark Drucker, Roland Fernandez, and Niklas Elmqvist. 2017. ATOM: A Grammar for Unit Visualizations. IEEE Transactions on Visualization and Computer Graphics 2626, c (2017). DOI: http://dx.doi.org/10.1109/TVCG.2017.2785807",
      "doi": ""
    },
    {
      "text": "M.Elisabeth Paté-Cornell. 1996. Uncertainties in risk analysis: Six levels of treatment. Reliability Engineering & System Safety 54, 2 (1996), 95--111. DOI: http://dx.doi.org/10.1016/S0951--8320(96)00067--1 ISBN: 0951--8320.",
      "doi": ""
    },
    {
      "text": "Martyn Plummer. 2003. JAGS: A program for analysis of Bayesian graphical models using Gibbs sampling. Working Papers (2003), 8.",
      "doi": ""
    },
    {
      "text": "Nadja Popovich. 2019. America's Light Bulb Revolution. The New York Times (March 2019). https://www.nytimes.com/interactive/2019/03/08/ climate/light-bulb-efficiency.html,https://www.nytimes.com/interactive/2019/03/08/climate/ light-bulb-efficiency.html.",
      "doi": ""
    },
    {
      "text": "R Core Team. 2019. R: A language and environment for statistical computing. Vienna, Austria. https://www.R-project.org/ R Foundation for Statistical Computing.",
      "doi": ""
    },
    {
      "text": "D. Ren, B. Lee, and M. Brehmer. 2019. Charticulator: Interactive Construction of Bespoke Chart Layouts. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 789--799. DOI: http://dx.doi.org/10.1109/TVCG.2018.2865158",
      "doi": "10.1109/TVCG.2018.2865158"
    },
    {
      "text": "Valentina Romei, James Politi, Cale Tilford, and Billy Ehrenberg-Shannon. 2018. Italian Election Poll-Tracker 2018: Who Is Running and Why It Matters. Financial Times (Jan. 2018). https://ig.ft.com/italy-poll-tracker/.",
      "doi": ""
    },
    {
      "text": "Alastair Rushworth. 2019. Inspectdf: Inspection, Comparison and Visualisation of Data Frames. https://CRAN.R-project.org/package=inspectdf. (2019).",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 341--350. DOI: http://dx.doi.org/10.1109/TVCG.2016.2599030",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "David Spiegelhalter. 2017. Risk and Uncertainty Communication. Annual Review of Statistics and Its Application 4, 1 (March 2017), 31--60. DOI: http://dx.doi.org/10.1146/annurev-statistics-010814-020148",
      "doi": ""
    },
    {
      "text": "David J. Spiegelhalter, Andrew Thomas, Nicky G. Best, Wally Gilks, and D. Lunn. 1996. BUGS: Bayesian inference using Gibbs sampling. Version 0.5,(version ii) http://www.mrc-bsu. cam. ac. uk/bugs 19 (1996).",
      "doi": ""
    },
    {
      "text": "C. Stolte, D. Tang, and P. Hanrahan. 2002. Polaris: a system for query, analysis, and visualization of multidimensional relational databases. IEEE Transactions on Visualization and Computer Graphics 8, 1 (Jan. 2002), 52--65. DOI: http://dx.doi.org/10.1109/2945.981851",
      "doi": "10.1109/2945.981851"
    },
    {
      "text": "The Upshot Staff. 2018. What Is the Needle? The New York Times (Nov. 2018). https://www.nytimes.com/2018/ 11/05/upshot/needle-election-night-2018-midterms.html",
      "doi": ""
    },
    {
      "text": "Judi Thomson, Elizabeth Hetzler, Alan MacEachren, Mark Gahegan, and Misha Pavel. 2005. A typology for visualizing uncertainty. In Visualization and Data Analysis 2005, Vol. 5669. International Society for Optics and Photonics, 146--157. DOI: http://dx.doi.org/10.1117/12.587254",
      "doi": ""
    },
    {
      "text": "Martin Wattenberg, Fernanda Viégas, and Moritz Hardt. 2016. Attack Discrimination with Smarter Machine Learning. https://research.google.com/bigpicture/ attacking-discrimination-in-ml/. (2016). Retrieved on 1/5/2020.",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2010. A Layered grammar of graphics. Journal of Computational and Graphical Statistics 19, 1 (2010), 3--28. DOI: http://dx.doi.org/10.1198/jcgs.2009.07098 ISBN: 1061--8600.",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2014. Tidy Data. Journal of Statistical Software 59, 1 (Sept. 2014), 1--23. DOI: http://dx.doi.org/10.18637/jss.v059.i10",
      "doi": ""
    },
    {
      "text": "Hadley Wickham and Heike Hofmann. 2011. Product Plots. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2223--2230. DOI: http://dx.doi.org/10.1109/TVCG.2011.227",
      "doi": "10.1109/TVCG.2011.227"
    },
    {
      "text": "Claus O. Wilke. 2018. ggridges: Ridgeline Plots in 'ggplot2'. https://CRAN.R-project.org/package=ggridges R package version 0.5.1.",
      "doi": ""
    },
    {
      "text": "Leland Wilkinson. 2005. The Grammar of Graphics. Springer-Verlag, New York. http://link.springer.com/10.1007/0--387--28695-0",
      "doi": "10.5555/316575"
    },
    {
      "text": "Jingxiong Zhang, Michael F. Goodchild, and Michael F. Goodchild. 2002. Uncertainty in Geographical Information. CRC Press. DOI: http://dx.doi.org/10.1201/b12624",
      "doi": ""
    }
  ]
}