{
  "doi": "10.1145/3313831.3376843",
  "title": "Effects of Persuasive Dialogues: Testing Bot Identities and Inquiry Strategies",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Intelligent conversational agents, or chatbots, can take on various identities and are increasingly engaging in more human-centered conversations with persuasive goals. However, little is known about how identities and inquiry strategies influence the conversation's effectiveness. We conducted an online study involving 790 participants to be persuaded by a chatbot for charity donation. We designed a two by four factorial experiment (two chatbot identities and four inquiry strategies) where participants were randomly assigned to different conditions. Findings showed that the perceived identity of the chatbot had significant effects on the persuasion outcome (i.e., donation) and interpersonal perceptions (i.e., competence, confidence, warmth, and sincerity). Further, we identified interaction effects among perceived identities and inquiry strategies. We discuss the findings for theoretical and practical implications for developing ethical and effective persuasive chatbots. Our published data, codes, and analyses serve as the first step towards building competent ethical persuasive chatbots.",
  "authors": [
    {
      "name": "Weiyan Shi",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529231",
      "orcid": "missing"
    },
    {
      "name": "Xuewei Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529279",
      "orcid": "missing"
    },
    {
      "name": "Yoo Jung Oh",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527866",
      "orcid": "missing"
    },
    {
      "name": "Jingwen Zhang",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528412",
      "orcid": "missing"
    },
    {
      "name": "Saurav Sahay",
      "institution": "Intel Labs, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021534",
      "orcid": "missing"
    },
    {
      "name": "Zhou Yu",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659334289",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elisabeth André, Thomas Rist, Susanne Van Mulken, Martin Klesen, and Stefan Baldes. 2000. The automated design of believable dialogues for animated presentation teams. Embodied conversational agents (2000), 220--255.",
      "doi": ""
    },
    {
      "text": "Frank R Bentley, Nediyana Daskalova, and Brooke White. 2017. Comparing the reliability of Amazon Mechanical Turk and Survey Monkey to traditional market research surveys. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1092--1099.",
      "doi": "10.1145/3027063.3053335"
    },
    {
      "text": "Piotr Bojanowski, Edouard Grave, Armand Joulin, and Tomas Mikolov. 2017. Enriching Word Vectors with Subword Information. Transactions of the Association for Computational Linguistics 5 (2017), 135--146.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on psychological science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "J. Cieciuch and E. Davidov. 2012. A comparison of the invariance properties of the PVQ-40 and the PVQ-21 to measure human values across German and Polish Samples. Survey Research Methods 6, 1 (2012), 37--48. DOI: http://dx.doi.org/10.18148/srm/2012.v6i1.5091",
      "doi": ""
    },
    {
      "text": "Kevin Corti and Alex Gillespie. 2015. Revisiting Milgramâ's cyranoid method: experimenting with hybrid human agents. The Journal of social psychology 155, 1 (2015), 30--56.",
      "doi": ""
    },
    {
      "text": "Antonella De Angeli, Graham I Johnson, and Lynne Coventry. 2001. The unfriendly user: exploring social reactions to chatterbots. In Proceedings of The International Conference on Affective Human Factors Design, London. 467--474.",
      "doi": ""
    },
    {
      "text": "Chad Edwards, Autumn Edwards, Patric R Spence, and Ashleigh K Shelton. 2014. Is that a bot running the social media feed? Testing the differences in perceptions of communication quality for a human agent and a bot agent on Twitter. Computers in Human Behavior 33 (2014), 372--376.",
      "doi": "10.1016/j.chb.2013.08.013"
    },
    {
      "text": "Brian J Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 5.",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Eun Go and S Shyam Sundar. 2019. Humanizing chatbots: The effects of visual, identity and conversational cues on humanness perceptions. Computers in Human Behavior 97 (2019), 304--316.",
      "doi": "10.1016/j.chb.2019.01.020"
    },
    {
      "text": "Gaston Godin, Paschal Sheeran, Mark Conner, and Marc Germain. 2008. Asking questions changes behavior: mere measurement effects on frequency of blood donation. Health Psychology 27, 2 (2008), 179.",
      "doi": ""
    },
    {
      "text": "Lewis R. Goldberg. 1992. The development of markers for the Big-Five factor structure. Psychological Assessment 4, 1 (1992), 26--42. DOI: http://dx.doi.org/10.1037/1040--3590.4.1.26",
      "doi": ""
    },
    {
      "text": "California Governor. 2018. California new Autobot Law, Cal. Bus. & Prof. Code 17940, et seq. (SB 1001). (2018). https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201720180SB1001.",
      "doi": ""
    },
    {
      "text": "J. Graham, B. A. Nosek, J. Haidt, R. Iyer, S. Koleva, and P. H. Ditto. 2011. Mapping the moral domain. Journal of Personality and Social Psychology 101, 2 (2011), 366--385. DOI: http://dx.doi.org/10.1037/a0021847",
      "doi": ""
    },
    {
      "text": "Kurt Gray and Daniel M Wegner. 2012. Feeling robots and human zombies: Mind perception and the uncanny valley. Cognition 125, 1 (2012), 125--130.",
      "doi": ""
    },
    {
      "text": "Shih S. I. Hamilton, K. and S. Mohammed. 2016. The development and validation of the rational and intuitive decision styles scale. Journal of personality assessment 98, 5 (2016), 523--535.",
      "doi": ""
    },
    {
      "text": "He He, Derek Chen, Anusha Balakrishnan, and Percy Liang. 2018. Decoupling strategy and generation in negotiation dialogues. arXiv preprint arXiv:1808.09637 (2018).",
      "doi": ""
    },
    {
      "text": "Sally Hibbert, Andrew Smith, Andrea Davies, and Fiona Ireland. 2007. Guilt appeals: Persuasion knowledge and charitable giving. Psychology & Marketing 24, 8 (2007), 723--742.",
      "doi": ""
    },
    {
      "text": "Christopher Hidey, Elena Musi, Alyssa Hwang, Smaranda Muresan, and Kathy McKeown. 2017. Analyzing the semantic types of claims and premises in an online persuasive forum. In Proceedings of the 4th Workshop on Argument Mining. 11--21.",
      "doi": ""
    },
    {
      "text": "Christopher Thomas Hidey and Kathleen McKeown. 2018. Persuasive influence detection: The role of argument sequencing. In Thirty-Second AAAI Conference on Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Jacob B Hirsh, Sonia K Kang, and Galen V Bodenhausen. 2012. Personalized persuasion: Tailoring persuasive appeals to recipients-personality traits. Psychological science 23, 6 (2012), 578--581.",
      "doi": ""
    },
    {
      "text": "Annabell Ho, Jeff Hancock, and Adam S Miner. 2018. Psychological, relational, and emotional effects of self-disclosure after conversations with a chatbot. Journal of Communication 68, 4 (2018), 712--733.",
      "doi": ""
    },
    {
      "text": "Clayton J Hutto and Eric Gilbert. 2014. Vader: A parsimonious rule-based model for sentiment analysis of social media text. In Eighth international AAAI conference on weblogs and social media.",
      "doi": ""
    },
    {
      "text": "Siwei Lai, Liheng Xu, Kang Liu, and Jun Zhao. 2015. Recurrent Convolutional Neural Networks for Text Classification. In Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence (AAAI'15). AAAI Press, 2267--2273. http://dl.acm.org/citation.cfm?id=2886521.2886636",
      "doi": "10.5555/2886521.2886636"
    },
    {
      "text": "Jong-Eun Roselyn Lee and Clifford I Nass. 2010. Trust in computers: The computers-are-social-actors (CASA) paradigm and trustworthiness perception in human-computer communication. In Trust and technology in a ubiquitous modern environment: Theoretical and methodological perspectives. IGI Global, 1--15.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Ji Tae Kim, and Leah Lizarondo. 2017. A human-centered approach to algorithmic services: Considerations for fair and motivating smart community service management that allocates donations to non-profit organizations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3365--3376.",
      "doi": "10.1145/3025453.3025884"
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods 44, 1 (2012), 1--23.",
      "doi": ""
    },
    {
      "text": "Alexander Miller, Will Feng, Dhruv Batra, Antoine Bordes, Adam Fisch, Jiasen Lu, Devi Parikh, and Jason Weston. 2017. ParlAI: A Dialog Research Software Platform. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations. 79--84.",
      "doi": ""
    },
    {
      "text": "S Mori and CP Leblond. 1970. Electron microscopic identification of three classes of oligodendrocytes and a preliminary study of their proliferative activity in the corpus callosum of young rats. Journal of Comparative Neurology 139, 1 (1970), 1--29.",
      "doi": ""
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and mindlessness: Social responses to computers. Journal of social issues 56, 1 (2000), 81--103.",
      "doi": "10.1111/0022-4537.00153"
    },
    {
      "text": "Harri Oinas-Kukkonen and Marja Harjumaa. 2008. Towards deeper understanding of persuasion in software and information systems. In First international conference on advances in computer-human interaction. IEEE, 200--205.",
      "doi": "10.1109/ACHI.2008.31"
    },
    {
      "text": "Harri Oinas-Kukkonen and Marja Harjumaa. 2009. Persuasive systems design: Key issues, process model, and system features. Communications of the Association for Information Systems 24, 1 (2009), 28.",
      "doi": ""
    },
    {
      "text": "Rita Orji, Lennart E Nacke, and Chrysanne Di Marco. 2017. Towards personality-driven persuasive health games and gamified systems. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1015--1027.",
      "doi": "10.1145/3025453.3025577"
    },
    {
      "text": "Rita Orji, Gustavo F Tondello, and Lennart E Nacke. 2018. Personalizing persuasive strategies in gameful systems to gamification user types. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 435.",
      "doi": "10.1145/3173574.3174009"
    },
    {
      "text": "Rita Orji, Julita Vassileva, and Regan L Mandryk. 2014. Modeling the efficacy of persuasive strategies for different gamer types in serious games for health. User Modeling and User-Adapted Interaction 24, 5 (2014), 453--498.",
      "doi": "10.1007/s11257-014-9149-8"
    },
    {
      "text": "James W Pennebaker, Martha E Francis, and Roger J Booth. 2001. Linguistic inquiry and word count: LIWC 2001. Mahway: Lawrence Erlbaum Associates 71, 2001 (2001), 2001.",
      "doi": ""
    },
    {
      "text": "Aleksandra Przegalinska, Leon Ciechanowski, Mikolaj Magnuski, and Peter Gloor. 2018. Muse headband: Measuring tool or a collaborative gadget? In Collaborative Innovation Networks. Springer, 93--101.",
      "doi": ""
    },
    {
      "text": "Alec Radford, Rafal Jozefowicz, and Ilya Sutskever. 2017. Learning to generate reviews and discovering sentiment. arXiv preprint arXiv:1704.01444 (2017).",
      "doi": ""
    },
    {
      "text": "Carol A Scott. 1977. Modifying socially-conscious behavior: The foot-in-the-door technique. Journal of Consumer Research 4, 3 (1977), 156--164.",
      "doi": ""
    },
    {
      "text": "Paul W Sherman. 1980. The meaning of nepotism. The American Naturalist 116, 4 (1980), 604--606.",
      "doi": ""
    },
    {
      "text": "Weiyan Shi, Kun Qian, Xuewei Wang, and Zhou Yu. 2019. How to Build User Simulators to Train RL-based Dialog Systems. arXiv preprint arXiv:1909.01388 (2019).",
      "doi": ""
    },
    {
      "text": "Weiyan Shi and Zhou Yu. 2018. Sentiment adaptive end-to-end dialog systems. arXiv preprint arXiv:1804.10731 (2018).",
      "doi": ""
    },
    {
      "text": "David E Sprott, Eric R Spangenberg, Lauren G Block, Gavan J Fitzsimons, Vicki G Morwitz, and Patti Williams. 2006. The question--behavior effect: What we know and where we go from here. Social Influence 1, 2 (2006), 128--137.",
      "doi": ""
    },
    {
      "text": "Chenhao Tan, Vlad Niculae, Cristian Danescu-Niculescu-Mizil, and Lillian Lee. 2016. Winning arguments: Interaction dynamics and persuasion strategies in good-faith online discussions. In Proceedings of the 25th international conference on world wide web. International World Wide Web Conferences Steering Committee, 613--624.",
      "doi": "10.1145/2872427.2883081"
    },
    {
      "text": "Yla R Tausczik and James W Pennebaker. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of language and social psychology 29, 1 (2010), 24--54.",
      "doi": "10.1177/0261927x09351676"
    },
    {
      "text": "Xuewei Wang, Weiyan Shi, Richard Kim, Yoojung Oh, Sijia Yang, Jingwen Zhang, and Zhou Yu. 2019. Persuasion for Good: Towards a Personalized Persuasive Dialogue System for Social Good. arXiv preprint arXiv:1906.06725 (2019).",
      "doi": ""
    },
    {
      "text": "Adam Waytz, John Cacioppo, and Nicholas Epley. 2010. Who sees human? The stability and importance of individual differences in anthropomorphism. Perspectives on Psychological Science 5, 3 (2010), 219--232.",
      "doi": ""
    },
    {
      "text": "Patti Williams, Lauren G Block, and Gavan J Fitzsimons. 2006. Simply asking questions about health behaviors increases both healthy and unhealthy behaviors. Social Influence 1, 2 (2006), 117--127.",
      "doi": ""
    },
    {
      "text": "Diyi Yang, Jiaao Chen, Zichao Yang, Dan Jurafsky, and Eduard Hovy. 2019. Let's Make Your Request More Persuasive: Modeling Persuasive Strategies via Semi-Supervised Neural Nets on Crowdfunding Platforms. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). 3620--3630.",
      "doi": ""
    },
    {
      "text": "Zhou Yu, Xinrui He, Alan W Black, and Alexander I Rudnicky. 2016. User Engagement Study with Virtual Agents Under Different Cultural Contexts. In International Conference on Intelligent Virtual Agents. Springer, 364--368.",
      "doi": ""
    },
    {
      "text": "Tangming Yuan, David Moore, and Alec Grierson. 2008. A human-computer dialogue system for educational debate: A computational dialectics approach. International Journal of Artificial Intelligence in Education 18, 1 (2008), 3--26.",
      "doi": "10.5555/1454077.1454079"
    }
  ]
}