{
  "doi": "10.1145/3313831.3376421",
  "title": "FoodFab: Creating Food Perception Illusions using Food 3D Printing",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Personalization of eating such that everyone consumes only what they need allows improving our management of food waste. In this paper, we explore the use of food 3D printing to create perceptual illusions for controlling the level of perceived satiety given a defined amount of calories. We present FoodFab, a system that allows users to control their food intake through modifying a food's internal structure via two 3D printing parameters: infill pattern and infill density. In two experiments with a total of 30 participants, we studied the effect of these parameters on users' chewing time that is known to affect people's feeling of satiety. Our results show that we can indeed modify the chewing time by varying infill pattern and density, and thus control perceived satiety. Based on the results, we propose two computational models and integrate them into a user interface that simplifies the creation of personalized food structures.",
  "tags": [
    "personal fabrication",
    "food 3D printer",
    "food-interaction design",
    "food perception",
    "fabrication techniques"
  ],
  "authors": [
    {
      "name": "Ying-Ju Lin",
      "institution": "Osaka University, Toyonaka, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528716",
      "orcid": "missing"
    },
    {
      "name": "Parinya Punpongsanon",
      "institution": "Osaka University & Massachusetts Institute of Technology, Toyonaka, Osaka, Japan",
      "img": "/do/10.1145/contrib-84460390257/rel-imgonly/punpongsanon_18102017.png",
      "acmid": "84460390257",
      "orcid": "missing"
    },
    {
      "name": "Xin Wen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261496",
      "orcid": "missing"
    },
    {
      "name": "Daisuke Iwai",
      "institution": "Osaka University, Toyonaka, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81313481091",
      "orcid": "missing"
    },
    {
      "name": "Kosuke Sato",
      "institution": "Osaka University, Toyonaka, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498832",
      "orcid": "missing"
    },
    {
      "name": "Marianna Obrist",
      "institution": "Massachusetts Institute of Technology & University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81328489919/rel-imgonly/mariannaobrist.jpg",
      "acmid": "81328489919",
      "orcid": "0000-0002-4009-1627"
    },
    {
      "name": "Stefanie Mueller",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal Fabrication. Foundations and Trends in Human-Computer Interaction 10, 3--4 (2017), 165--293. DOI: http://dx.doi.org/10.1561/1100000055",
      "doi": ""
    },
    {
      "text": "John Bludell and France Bellisle. 2013. Satiation, Satiety and the Control of Food Intake (1 ed.). Series in Food Science, Vol. 4. Woodhead Publishing.",
      "doi": ""
    },
    {
      "text": "Wayne Cowart. 1998. Experimental Syntax: Applying Objective Methods to Sentence Judgments. Linguistic Society of America 74. DOI: http://dx.doi.org/10.1353/lan.1998.0200",
      "doi": ""
    },
    {
      "text": "Arianna Dick, Bhesh Bhandari, and Sangeeta Prakash. 2019. 3D printing of meat. Meat Science 153 (2019), 35 -- 44. DOI: http://dx.doi.org/10.1016/j.meatsci.2019.03.005",
      "doi": ""
    },
    {
      "text": "Miguel Fernandez-Vicente, Wilson Calle, Santiago Ferrandiz, and Andres Conejero. 2016. Effect of Infill Parameters on Tensile Mechanical Behavior in Desktop 3D Printing. 3D Printing and Additive Manufacturing 3, 3 (2016), 183--192. DOI: http://dx.doi.org/10.1089/3dp.2015.0036",
      "doi": ""
    },
    {
      "text": "Gerald H. Fisher and Jeremy J. Foster. 2016. Apparent Sizes of Different Shapes and the Facility with which they can be identified. Journal of Food Engineering 179 (2016), 1476 -- 4687. DOI: http://dx.doi.org/10.1038/219653c05",
      "doi": ""
    },
    {
      "text": "Y. Fujimoto. 2018. Projection Mapping for Enhancing the Perceived Deliciousness of Food. IEEE Access 6 (2018), 59975--59985. DOI: http://dx.doi.org/10.1109/ACCESS.2018.2875775",
      "doi": ""
    },
    {
      "text": "Kentaro Fukuchi, Kazuhiro Jo, Akifumi Tomiyama, and Shunsuke Takao. 2012. Laser Cooking: A Novel Culinary Technique for Dry Heating Using a Laser Cutter and Vision Technology. In Proceedings of the ACM Multimedia 2012 Workshop on Multimedia for Cooking and Eating Activities (CEA '12). ACM, NY, NY, USA, 55--58. DOI: http://dx.doi.org/10.1145/2390776.2390788",
      "doi": "10.1145/2390776.2390788"
    },
    {
      "text": "Fernanda C. Godoi, Sangeeta Prakash, and Bhesh R. Bhandari. 2016. 3d printing technologies applied for food design: Status and prospects. Journal of Food Engineering 179 (2016), 44 -- 54. DOI: http://dx.doi.org/10.1016/j.jfoodeng.2016.01.025",
      "doi": ""
    },
    {
      "text": "Masaharu Hirose, Karin Iwazaki, Kozue Nojiri, Minato Takeda, Yuta Sugiura, and Masahiko Inami. 2015. Gravitamine Spice: A System That Changes the Perception of Eating Through Virtual Weight Sensation. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, NY, NY, USA, 33--40. DOI: http://dx.doi.org/10.1145/2735711.2735795",
      "doi": "10.1145/2735711.2735795"
    },
    {
      "text": "P.S. Hogenkamp and H.B. Schiöth. 2013. Effect of oral processing behaviour on food intake and satiety. Trends in Food Science & Technology 34, 1 (2013), 67 -- 75. DOI: http://dx.doi.org/10.1016/j.tifs.2013.08.010",
      "doi": ""
    },
    {
      "text": "T. HORIO and Y. KAWAMURA. 1989. Effects of texture of food on chewing patterns in the human subject. Journal of Oral Rehabilitation 16, 2 (1989), 177--183. DOI: http://dx.doi.org/10.1111/j.1365--2842.1989.tb01331.x",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, David Lindlbauer, Philipp Herholz, Marc Alexa, and Patrick Baudisch. 2019. Understanding Metamaterial Mechanisms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 647, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300877",
      "doi": "10.1145/3290605.3300877"
    },
    {
      "text": "H. Iwata, H. Yano, T. Uemura, and T. Moriya. 2004. Food simulator: a haptic interface for biting. In IEEE Virtual Reality 2004. 51--57. DOI: http://dx.doi.org/10.1109/VR.2004.1310055",
      "doi": ""
    },
    {
      "text": "Yuhua Jin, Isabel Qamar, Michael Wessely, Aradhana Adhikari, Katarina Bulovic, Parinya Punpongsanon, and Stefanie Mueller. 2019. Photo-Chromeleon: Re-Programmable Multi-Color Textures Using Photochromic Dyes. In Proceedings of the 32Nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, NY, NY, USA, 701--712. DOI: http://dx.doi.org/10.1145/3332165.3347905",
      "doi": "10.1145/3332165.3347905"
    },
    {
      "text": "Rohit Ashok Khot, Deepti Aggarwal, Ryan Pennings, Larissa Hjorth, and Florian 'Floyd' Mueller. 2017. EdiPulse: Investigating a Playful Approach to Self-monitoring Through 3D Printed Chocolate Treats. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6593--6607. DOI: http://dx.doi.org/10.1145/3025453.3025980",
      "doi": "10.1145/3025453.3025980"
    },
    {
      "text": "Rohit Ashok Khot, Jeewon Lee, Deepti Aggarwal, Larissa Hjorth, and Florian 'Floyd' Mueller. 2015. TastyBeats: Designing Palatable Representations of Physical Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2933--2942. DOI: http://dx.doi.org/10.1145/2702123.2702197",
      "doi": "10.1145/2702123.2702197"
    },
    {
      "text": "Yui Kita and Jun Rekimoto. 2013. Spot-Light: Multimodal Projection Mapping on Food. In HCI International 2013 - Posters' Extended Abstracts, Constantine Stephanidis (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 652--655. DOI: http://dx.doi.org/10.1007/978--3--642--39476--8_131",
      "doi": ""
    },
    {
      "text": "Naoya Koizumi, Hidekazu Tanaka, Yuji Uema, and Masahiko Inami. 2011. Chewing Jockey: Augmented Food Texture by Using Sound Based on the Cross-modal Effect. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology (ACE '11). ACM, NY, NY, USA, Article 21, 4 pages. DOI: http://dx.doi.org/10.1145/2071423.2071449",
      "doi": "10.1145/2071423.2071449"
    },
    {
      "text": "Zhenbin Liu, Bhesh Bhandari, Sangeeta Prakash, and Min Zhang. 2018. Creation of internal structure of mashed potato construct by 3D printing and its textural properties. Food Research International 111 (2018), 534 -- 543. DOI: http://dx.doi.org/10.1016/j.foodres.2018.05.075",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2018. 3D Printing Technologies: A Third Wave Perspective. Springer International Publishing, Cham, 89--104. DOI: http://dx.doi.org/10.1007/978--3--319--73356--2_6",
      "doi": ""
    },
    {
      "text": "Bernard Lyman. 1989. A Psychology of Food. Springer Netherlands. DOI: http://dx.doi.org/10.1007/978--94-011--7033--8",
      "doi": ""
    },
    {
      "text": "Weiqing Min, Shuqiang Jiang, Linhu Liu, Yong Rui, and Ramesh Jain. 2019. A Survey on Food Computing. ACM Comput. Surv. 52, 5, Article 92 (Sept. 2019), 36 pages. DOI: http://dx.doi.org/10.1145/3329168",
      "doi": "10.1145/3329168"
    },
    {
      "text": "Moran Mizrahi, Amos Golan, Ariel Bezaleli Mizrahi, Rotem Gruber, Alexander Zoonder Lachnise, and Amit Zoran. 2016. Digital Gastronomy: Methods & Recipes for Hybrid Cooking. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 541--552. DOI: http://dx.doi.org/10.1145/2984511.2984528",
      "doi": "10.1145/2984511.2984528"
    },
    {
      "text": "Takuji Narumi, Yuki Ban, Takashi Kajinami, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Augmented Perception of Satiety: Controlling Food Consumption by Changing Apparent Size of Food with Augmented Reality. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 109--118. DOI: http://dx.doi.org/10.1145/2207676.2207693",
      "doi": "10.1145/2207676.2207693"
    },
    {
      "text": "Takuji Narumi, Shinya Nishizaka, Takashi Kajinami, Tomohiro Tanikawa, and Michitaka Hirose. 2011. Meta Cookie+: An Illusion-based Gustatory Display. In Proceedings of the 2011 International Conference on Virtual and Mixed Reality: New Trends - Volume Part I. Springer-Verlag, Berlin, Heidelberg, 260--269. DOI: http://dx.doi.org/10.1007/978--3--642--22021-0_29",
      "doi": ""
    },
    {
      "text": "Masahiro Nishizawa, Wanting Jiang, and Katsunori Okajima. 2016. Projective-AR System for Customizing the Appearance and Taste of Food. In Proceedings of the 2016 Workshop on Multimodal Virtual and Augmented Reality (MVAR '16). ACM, NY, NY, USA, Article 6, 6 pages. DOI: http://dx.doi.org/10.1145/3001959.3001966",
      "doi": "10.1145/3001959.3001966"
    },
    {
      "text": "Marianna Obrist, Patrizia Marti, Carlos Velasco, Yunwen (Tutu) Tu, Takuji Narumi, and Naja L. Holten Møller. 2018. The Future of Computing and Food: Extended Abstract. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces (AVI '18). ACM, NY, NY, USA, Article 5, 3 pages. DOI: http://dx.doi.org/10.1145/3206505.3206605",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Yunwen Tu, Lining Yao, and Carlos Velasco. 2019. Space Food Experiences: Designing Passenger's Eating Experiences for Future Space Travel Scenarios. Frontiers in Computer Science 1 (2019), 3. DOI: http://dx.doi.org/10.3389/fcomp.2019.00003",
      "doi": ""
    },
    {
      "text": "Katsunori Okajima and Charles Spence. 2011. Effects of Visual Food Texture on Taste Perception. i-Perception 2, 8 (2011), 966--966. DOI: http://dx.doi.org/10.1068/ic966",
      "doi": ""
    },
    {
      "text": "Parinya Punpongsanon, Xin Wen, David S. Kim, and Stefanie Mueller. 2018. ColorMod: Recoloring 3D Printed Objects Using Photochromic Inks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 213, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173787",
      "doi": "10.1145/3173574.3173787"
    },
    {
      "text": "Priya Raghubir and Aradhna Krishna. 1999. Vital Dimensions in Volume Perception: Can the Eye Fool the Stomach? Journal of Marketing Research 36, 3 (1999), 313--326.",
      "doi": ""
    },
    {
      "text": "Nimesha Ranasinghe and Ellen Yi-Luen Do. 2016. Digital Lollipop: Studying Electrical Stimulation on the Human Tongue to Simulate Taste Sensations. ACM Trans. Multimedia Comput. Commun. Appl. 13, 1, Article 5 (Oct. 2016), 22 pages. DOI: http://dx.doi.org/10.1145/2996462",
      "doi": "10.1145/2996462"
    },
    {
      "text": "Sho Sakurai, Takuji Narumi, Yuki Ban, Tomohiro Tanikawa, and Michitaka Hirose. 2013. Affecting Our Perception of Satiety by Changing the Size of Virtual Dishes Displayed with a Tabletop Display. In Virtual, Augmented and Mixed Reality. Systems and Applications, Randall Shumaker (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 90--99.",
      "doi": ""
    },
    {
      "text": "Sabrina Sandalo. 2019. Does Texture Impact Taste? Nendo Chocolate Explores. https://antedote.com/texture-impact-taste-nendo-chocolate-explores/. (2019).",
      "doi": ""
    },
    {
      "text": "Charles Spence. 2017. Gastrophysics: The New Science of Eating. Viking.",
      "doi": ""
    },
    {
      "text": "Wolfgang Stroebe, Wendy Mensink, Henk Aarts, Henk Schut, and Arie W. Kruglanski. 2008. Why dieters fail: Testing the goal conflict model of eating. Journal of Experimental Social Psychology 44, 1 (2008), 26 -- 36. DOI: http://dx.doi.org/10.1016/j.jesp.2007.01.005",
      "doi": ""
    },
    {
      "text": "Yuto Sugita, Keiichi Zempo, Yasumasa Ando, Yuya Kakutani, Koichi Mizutani, and Naoto Wakatsuki. 2018. Diet Gamification Toward Chewing Amount Control via Head Mounted Display. In SIGGRAPH Asia 2018 Posters (SA '18). ACM, NY, NY, USA, Article 41, 2 pages. DOI: http://dx.doi.org/10.1145/3283289.3283369",
      "doi": "10.1145/3283289.3283369"
    },
    {
      "text": "Jie Sun, Zhuo Peng, Weibiao Zhou, Jerry Y.H. Fuh, Geok Soon Hong, and Annette Chiu. 2015. A Review on 3D Printing for Customized Food Fabrication. Procedia Manufacturing (the 43rd North American Manufacturing Research Conference) 1 (2015), 308 -- 319. DOI: http://dx.doi.org/10.1016/j.promfg.2015.09.057",
      "doi": ""
    },
    {
      "text": "Eiji Suzuki, Takuji Narumi, Sho Sakurai, Tomohiro Tanikawa, and Michitaka Hirose. 2014. Illusion Cup: Interactive Controlling of Beverage Consumption Based on an Illusion of Volume Perception. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, NY, NY, USA, Article 41, 8 pages. DOI: http://dx.doi.org/10.1145/2582051.2582092",
      "doi": "10.1145/2582051.2582092"
    },
    {
      "text": "Eiji Suzuki, Takuji Narumi, Sho Sakurai, Tomohiro Tanikawa, and Michitaka Hirose. 2015. Changing Drinking Behavior and Beverage Consumption Using Augmented Reality. In Human Interface and the Management of Information. Information and Knowledge Design, Sakae Yamamoto (Ed.). Springer International Publishing, Cham, 648--660.",
      "doi": ""
    },
    {
      "text": "Cesar Torres, Tim Campbell, Neil Kumar, and Eric Paulos. 2015. HapticPrint: Designing Feel Aesthetics for Digital Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 583--591. DOI: http://dx.doi.org/10.1145/2807442.2807492",
      "doi": "10.1145/2807442.2807492"
    },
    {
      "text": "Sally Ann Turner, Aleksandra Luszczynska, Lisa Warner, and Ralf Schwarzer. 2010. Emotional and uncontrolled eating styles and chocolate chip cookie consumption. A controlled trial of the effects of positive mood enhancement. Appetite 54, 1 (2010), 143 -- 149. DOI: http://dx.doi.org/10.1016/j.appet.2009.09.020",
      "doi": ""
    },
    {
      "text": "Valérie Vancauwenberghe, Louise Katalagarianakis, Zi Wang, Mathieu Meerts, Maarten Hertog, Pieter Verboven, Paula Moldenaers, Marc E. Hendrickx, Jeroen Lammertyn, and Bart Nicolaï. 2017. Pectin based food-ink formulations for 3-D printing of customizable porous food simulants. Innovative Food Science & Emerging Technologies 42 (2017), 138 -- 150. DOI: http://dx.doi.org/10.1016/j.ifset.2017.06.011",
      "doi": ""
    },
    {
      "text": "Carlos Velasco, Marianna Obrist, Olivia Petit, and Charles Spence. 2018. Multisensory Technology for Flavor Augmentation: A Mini Review. Frontiers in Psychology 9 (2018), 26. DOI: http://dx.doi.org/10.3389/fpsyg.2018.00026",
      "doi": ""
    },
    {
      "text": "Yuji Wada, Daisuke Tsuzuki, Naoki Kobayashi, Fumiyo Hayakawa, and Kaoru Kohyama. 2007. Visual illusion in mass estimation of cut food. Appetite 49, 1 (2007), 183 -- 190. DOI: http://dx.doi.org/10.1016/j.appet.2007.01.009",
      "doi": ""
    },
    {
      "text": "Ian N. Wakeling and Halliday J.H. MacFie. 1995. Designing consumer trials balanced for first and higher orders of carry-over effect when only a subset of k samples from t may be tested. Food Quality and Preference (Second Sensometrics Meeting) 6, 4 (1995), 299 -- 308. DOI: http://dx.doi.org/10.1016/0950--3293(95)00032--1",
      "doi": ""
    },
    {
      "text": "Brian Wansink. 2010. Mindless Eating: Why We Eat More Than We Think. Bantam.",
      "doi": ""
    },
    {
      "text": "Fan Yang, Min Zhang, Sangeeta Prakash, and Yaping Liu. 2018. Physical properties of 3D printed baking dough as affected by different compositions. Innovative Food Science & Emerging Technologies 49 (2018), 202 -- 210. DOI: http://dx.doi.org/10.1016/j.ifset.2018.01.001",
      "doi": ""
    },
    {
      "text": "Martin R. Yeomans. 2017. Adverse effects of consuming high fat--sugar diets on cognition: implications for understanding obesity. Proceedings of the Nutrition Society 76, 4 (2017), 455--465. DOI: http://dx.doi.org/10.1017/S0029665117000805",
      "doi": ""
    },
    {
      "text": "M R Yeomans, R. Re, M. Wickham, H. Lundholm, and L. Chambers. 2016. Beyond expectations: the physiological basis of sensory enhancement of satiety. International Journal of Obesity 40, 11 (2016), 1693--1698. DOI: http://dx.doi.org/10.1038/ijo.2016.112",
      "doi": ""
    },
    {
      "text": "Haiming Zhao, Jufeng Wang, Xiaoyu Ren, Jingyuan Li, Yong-Liang Yang, and Xiaogang Jin. 2018. Personalized food printing for portrait images. Computers & Graphics 70 (2018), 188 -- 197. DOI: http://dx.doi.org/10.1016/j.cag.2017.07.012",
      "doi": ""
    },
    {
      "text": "Nicolien Zijlstra, René de Wijk, Monica Mars, Annette Stafleu, and Cees de Graaf. 2009. Effect of bite size and oral processing time of a semisolid food on satiation. The American Journal of Clinical Nutrition 90, 2 (06 2009), 269--275. DOI: http://dx.doi.org/10.3945/ajcn.2009.27694",
      "doi": ""
    },
    {
      "text": "Amit Zoran. 2019. Cooking With Computers: The Vision of Digital Gastronomy [Point of View]. Proc. IEEE 107, 8 (Aug 2019), 1467--1473. DOI: http://dx.doi.org/10.1109/JPROC.2019.2925262",
      "doi": ""
    },
    {
      "text": "Amit Zoran and Dror Cohen. 2018. Digital Konditorei: Programmable Taste Structures Using a Modular Mold. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 400, 9 pages. DOI: http://dx.doi.org/10.1145/3173574.3173974",
      "doi": "10.1145/3173574.3173974"
    }
  ]
}