{
  "doi": "10.1145/3313831.3376655",
  "title": "Kirigami Haptic Swatches: Design Methods for Cut-and-Fold Haptic Feedback Mechanisms",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Kirigami Haptic Swatches demonstrate how kirigami and origami based structures enable sophisticated haptic feedback through simple cut-and-fold fabrication techniques. We leverage four types of geometric patterns: rotational erection system (RES), split-fold waterbomb (SFWB), the overlaid structure of SFWB and RES (SFWB+RES), and cylindrical origami, to render different sets of haptic feedback (i.e. linear, bistable, bouncing snap-through, and rotational force behaviors, respectively). In each structure, not only the form factor but also the force feedback properties can be tuned through geometric parameters. We experimentally analyzed and modeled the structures, and implemented software to automatically generate 2D patterns for desired haptic properties. We also demonstrate five example applications including an assistive custom keyboard, rotational switch, multi-sensory toy, task checklist, and phone accessories. We believe the Kirigami Haptic Swatches helps tinkerers, designers, and even researchers to create interactions that enrich our haptic experience.",
  "tags": [
    "Kirigami structure",
    "haptics",
    "computational fabrication",
    "design methods",
    "paper button"
  ],
  "authors": [
    {
      "name": "Zekun Chang",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365542",
      "orcid": "missing"
    },
    {
      "name": "Tung D. Ta",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-99658745887/rel-imgonly/face_black_round_copy.png",
      "acmid": "99658745887",
      "orcid": "missing"
    },
    {
      "name": "Koya Narumi",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700935",
      "orcid": "missing"
    },
    {
      "name": "Heeju Kim",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365284",
      "orcid": "missing"
    },
    {
      "name": "Fuminori Okuya",
      "institution": "University of Tokyo, Hongo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179443",
      "orcid": "missing"
    },
    {
      "name": "Dongchi Li",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527491",
      "orcid": "missing"
    },
    {
      "name": "Kunihiro Kato",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658641922",
      "orcid": "missing"
    },
    {
      "name": "Jie Qi",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528812",
      "orcid": "missing"
    },
    {
      "name": "Yoshinobu Miyamoto",
      "institution": "Aichi Institute of Technology, Toyota, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365454",
      "orcid": "missing"
    },
    {
      "name": "Kazuya Saito",
      "institution": "Kyushu University, Minami-Ku, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319858",
      "orcid": "missing"
    },
    {
      "name": "Yoshihiro Kawahara",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100423171/rel-imgonly/bb10347-2.jpg",
      "acmid": "81100423171",
      "orcid": "0000-0002-0310-2577"
    }
  ],
  "references": [
    {
      "text": "Byoungkwon An, Ye Tao, Jianzhe Gu, Tingyu Cheng, Xiang 'Anthony' Chen, Xiaoxiao Zhang, Wei Zhao, Youngwook Do, Shigeo Takahashi, Hsiang-Yun Wu, Teng Zhang, and Lining Yao. 2018. Thermorph: Democratizing 4D Printing of Self-Folding Materials and Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 260, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173834",
      "doi": "10.1145/3173574.3173834"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 417--426. DOI: http://dx.doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Christian Frisson, Julien Decaudin, Thomas Pietrzak, Alexander Ng, Pauline Poncet, Fabrice Casset, Antoine Latour, and Stephen A. Brewster. 2017. Designing Vibrotactile Widgets with Printed Actuators and Sensors. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 11--13. DOI: http://dx.doi.org/10.1145/3131785.3131800",
      "doi": ""
    },
    {
      "text": "Daniel Groeger, Martin Feick, Anusha Withana, and Jürgen Steimle. 2019. Tactlets: Adding Tactile Feedback to 3D Objects Using Custom Printed Controls. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, NY, NY, USA, 923--936. DOI: http://dx.doi.org/10.1145/3332165.3347937",
      "doi": "10.1145/3332165.3347937"
    },
    {
      "text": "Daniel Groeger and Jürgen Steimle. 2018. ObjectSkin: Augmenting Everyday Objects with Hydroprinted Touch Sensors and Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 134 (Jan. 2018), 23 pages. DOI: http://dx.doi.org/10.1145/3161165",
      "doi": "10.1145/3161165"
    },
    {
      "text": "Jianzhe Gu, David E. Breen, Jenny Hu, Lifeng Zhu, Ye Tao, Tyson Van de Zande, Guanyun Wang, Yongjie Jessica Zhang, and Lining Yao. 2019. Geodesy: Self-rising 2.5D Tiles by Printing Along 2D Geodesic Closed Path. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 37, 10 pages. DOI: http://dx.doi.org/10.1145/3290605.3300267",
      "doi": "10.1145/3290605.3300267"
    },
    {
      "text": "Brandon H. Hanna, Spencer P. Magleby, Robert J. Lang, and Larry L. Howell. 2015. Force--Deflection Modeling for Generalized Origami Waterbomb-Base Mechanisms. Journal of Applied Mechanics 82, 8 (Aug 2015). DOI: http://dx.doi.org/10.1115/1.4030659",
      "doi": ""
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit Stickers: Peel-and-stick Construction of Interactive Electronic Prototypes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1743--1746. DOI: http://dx.doi.org/10.1145/2556288.2557150",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. TRANSFORM: Embodiment of \"Radical Atoms\" at Milano Design Week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 687--694. DOI: http://dx.doi.org/10.1145/2702613.2702969",
      "doi": "10.1145/2702613.2702969"
    },
    {
      "text": "Sungjune Jang, Lawrence H. Kim, Kesler Tanner, Hiroshi Ishii, and Sean Follmer. 2016. Haptic Edge Display for Mobile Tactile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3706--3716. DOI: http://dx.doi.org/10.1145/2858036.2858264",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Mustafa Emre Karagozler, Ivan Poupyrev, Gary K. Fedder, and Yuri Suzuki. 2013. Paper Generators: Harvesting Energy from Touching, Rubbing and Sliding. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 23--30. DOI: http://dx.doi.org/10.1145/2501988.2502054",
      "doi": "10.1145/2501988.2502054"
    },
    {
      "text": "Kunihiro Kato, Hiroki Ishizuka, Hiroyuki Kajimoto, and Homei Miyashita. 2018. Double-Sided Printed Tactile Display with Electro Stimuli and Electrostatic Forces and Its Assessment. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 450, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174024",
      "doi": "10.1145/3173574.3174024"
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2015. Extension Sticker: A Proposal for a Striped Pattern Sticker to Extend Touch Interfaces and Its Assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1851--1854. DOI: http://dx.doi.org/10.1145/2702123.2702500",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 363--372. DOI: http://dx.doi.org/10.1145/2493432.2493486",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Sunjun Kim and Geehyuk Lee. 2013. Haptic Feedback Design for a Virtual Button along Force-Displacement Curves. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 91--96. DOI: http://dx.doi.org/10.1145/2501988.2502041",
      "doi": "10.1145/2501988.2502041"
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2018. Pushables: A DIY Approach for Fabricating Customizable and Self-Contained Tactile Membrane Dome Switches. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST '18 Adjunct). ACM, NY, NY, USA, 1--4. DOI: http://dx.doi.org/10.1145/3266037.3266082",
      "doi": ""
    },
    {
      "text": "Biruta Kresling. 2008. Natural twist buckling in shells: From the hawkmoth's bellows to the deployable kresling-pattern and cylindrical miuraori. In Proceedings of the 6th International Conference on Computation of Shell and Spatial Structures, John F. Abel and J. Robert Cooke, eds., Ithaca, Vol. 11. 12--32.",
      "doi": ""
    },
    {
      "text": "Yi-Chi Liao, Sunjun Kim, and Antti Oulasvirta. 2018. One Button to Rule Them All: Rendering Arbitrary Force-Displacement Curves. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST '18 Adjunct). ACM, NY, NY, USA, 111--113. DOI: http://dx.doi.org/10.1145/3266037.3266118",
      "doi": "10.1145/3266037.3266118"
    },
    {
      "text": "Yoshinobu Miyamoto. 2015. Rotational Erection System (RES): Origami Extended with Cuts. Origami6 II: Technology Art, Education, Miura K (ed.), AMS (2015), 537--544.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Luke Vink, Jared Counts, Daniel Windham, Daniel Leithinger, Sean Follmer, and Hiroshi Ishii. 2016. Materiable: Rendering Dynamic Material Properties in Response to Direct Physical Touch with Shape Changing Interfaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2764--2772. DOI: http://dx.doi.org/10.1145/2858036.2858104",
      "doi": "10.1145/2858036.2858104"
    },
    {
      "text": "Koya Narumi, Steve Hodges, and Yoshihiro Kawahara. 2015. ConductAR: An Augmented Reality Based Tool for Iterative Design of Conductive Ink Circuits. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 791--800. DOI: http://dx.doi.org/10.1145/2750858.2804267",
      "doi": "10.1145/2750858.2804267"
    },
    {
      "text": "Masa Ogata. 2018. Magneto-Haptics: Embedding Magnetic Force Feedback for Physical Interactions. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 737--743. DOI: http://dx.doi.org/10.1145/3242587.3242615",
      "doi": "10.1145/3242587.3242615"
    },
    {
      "text": "Fuminori Okuya, Takuya Umedachi, Kazuo Saito, and Yoshihiro Kawahara. 2018. Crawling Cylindrical Origami Robot Driven by Single Actuator. Origami 7: Proceedings from the seventh meeting of Origami, Science, Mathematics and Education 3 (Sept. 2018), 949--964.",
      "doi": ""
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in Circuits: Designing and Building Electronics on Paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). Association for Computing Machinery, New York, NY, USA, 1713--1722. DOI: http://dx.doi.org/10.1145/2556288.2557391",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Austin Reid, Frederic Lechenault, Sergio Rica, and Mokhtar Adda-Bedia. 2017. Geometry and design of origami bellows with tunable response. Phys. Rev. E 95 (Jan 2017), 013002. Issue 1. DOI: http://dx.doi.org/10.1103/PhysRevE.95.013002",
      "doi": ""
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E. Mackay. 2018. Shape-Aware Material: Interactive Fabrication with ShapeMe. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 127--139. DOI: http://dx.doi.org/10.1145/3242587.3242619",
      "doi": ""
    },
    {
      "text": "Hiromi Yasuda, Tomohiro Tachi, Mia Lee, and Jinkyu Yang. 2017. Origami-based tunable truss structures for non-volatile mechanical memory operation. Nature Communications 8, 1, Article 962 (Oct. 2017), 7 pages. DOI: http://dx.doi.org/10.1038/s41467-017-00670-w",
      "doi": ""
    }
  ]
}