{
  "doi": "10.1145/3313831.3376627",
  "title": "Relational, Flexible, Everyday: Learning from Ethics in Dementia Research",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [],
  "abstract": "Engaging in participatory research in HCI raises numerous ethical complexities such as consent, researcher relationships, and participant compensation. Doing HCI work in the area of dementia amplifies these issues, and researchers in this area are modelling ethical stances to ensure researcher-participant relationships focus on meaningful engagement and care. This paper presents an insight into the kinds of ethical foci required when doing design research with people living with dementia and their carers. We interviewed 22 HCI researchers with experience working in dementia care contexts. Our qualitative analysis outlines subsequent lessons-learned, such as recognition of the participants, self-care, research impact, and subjectivity in ethical review boards. Furthermore, we found the complexity of navigating both \"everyday\" and more formal, institutional ethics in dementia research has implications beyond the context of working with people with dementia and outline key considerations for ethical practices in socially orientated HCI research.",
  "authors": [
    {
      "name": "James Hodge",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659261005/rel-imgonly/picture.png",
      "acmid": "99659261005",
      "orcid": "missing"
    },
    {
      "name": "Sarah Foley",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261534",
      "orcid": "missing"
    },
    {
      "name": "Rens Brankaert",
      "institution": "Fontys University of Applied Sciences, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068300",
      "orcid": "missing"
    },
    {
      "name": "Gail Kenning",
      "institution": "University of Technology Sydney, Sydney, NSW, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261298",
      "orcid": "missing"
    },
    {
      "name": "Amanda Lazar",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    },
    {
      "name": "Jennifer Boger",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81333487956",
      "orcid": "missing"
    },
    {
      "name": "Kellie Morrissey",
      "institution": "University of Limerick, Limerick, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059070757",
      "orcid": "0000-0002-6962-6920"
    }
  ],
  "references": [
    {
      "text": "ACM. Criteria for Authorship. Retrieved September 20, 2019 from https://www.acm.org/publications/policies/authorship",
      "doi": ""
    },
    {
      "text": "Jan Philipp Albrecht. 2016. How the GDPR Will Change the World. European Data Protection Law Review (EDPL), 3: 287--289.",
      "doi": ""
    },
    {
      "text": "Arlene Astell, Sarah Smith, and Philip Joddrell. 2019. Using Technology in Dementia Care: A Guide to Technology Solutions for Everyday Living. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Rachel E. Clarke, Charles Windlin, Anna Ståhl, Kristina Höök, and Geraldine Fitzpatrick. 2019. Emotion Work in Experience-Centered Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 602:1--602:12. https://doi.org/10.1145/3290605.3300832.",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 675--684. https://doi.org/10.1145/1978942.1979041.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Marguerite Barry, Kevin Doherty, Jose Marcano Belisario, Josip Car, Cecily Morrison, and Gavin Doherty. 2017. mHealth for Maternal Mental Health: Everyday Wisdom in Ethical Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 2708--2756. https://doi.org/10.1145/3025453.3025918.",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Mary Field Belenky, Blythe McVicker Clinchy, Nancy Rule Goldberger, and Jill Mattuck Tarule. 1986. Women's ways of knowing: The development of self, voice, and mind. Basic Books, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Kirsten Bell and Denielle Elliott. 2014. Censorship in the name of ethics: critical public health research in the age of human subjects regulation. Critical Public Health 24, 4: 385--391. https://doi.org/10.1080/09581596.2014.936727.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Bob Anderson, Rachel Jacobs, Mike Golembewski, Marina Jirotka, Bernd Carsten Stahl, Job Timmermans, Gabriella Giannachi, Matt Adams, Ju Row Farr, Nick Tandavanitj, and Kirsty Jennings. 2015. The Ethical Implications of HCI's Turn to the Cultural. ACM Trans. Comput.-Hum. Interact. 22, 5: 24:1--24:37. https://doi.org/10.1145/2775107.",
      "doi": "10.1145/2775107"
    },
    {
      "text": "Lynda Berends and Jennifer Johnston. 2005. Using multiple coders to enhance qualitative analysis: The case of interviews with consumers of drug treatment. Addiction Research & Theory 13, 4: 373--381. https://doi.org/10.1080/16066350500102237.",
      "doi": ""
    },
    {
      "text": "Pernille Bjorn, Casey Fiesler, Michael Muller, Jessica Pater, and Pamela Wisniewski. 2018. Research Ethics Town Hall Meeting. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (GROUP '18), 393--396. https://doi.org/10.1145/3148330.3154523.",
      "doi": "10.1145/3148330.3154523"
    },
    {
      "text": "Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06), 1--8. https://doi.org/10.1145/1182475.1182476.",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "John Bond. 1992. The medicalization of dementia. Journal of Aging Studies 6, 4: 397--403. https://doi.org/10.1016/0890--4065(92)90020--7.",
      "doi": ""
    },
    {
      "text": "Rita Maldonado Branco, Joana Quental, and Óscar Ribeiro. 2017. Personalised participation: an approach to involve people with dementia and their families in a participatory design project. CoDesign 13, 2: 127--143. https://doi.org/10.1080/15710882.2017.1310903.",
      "doi": ""
    },
    {
      "text": "Rens Brankaert, Gail Kenning, Daniel Welsh, Sarah Foley, James Hodge, and David Unbehaun. 2019. Intersections in HCI, Design and Dementia: Inclusivity in Participatory Approaches. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion (DIS '19 Companion), 357--360. https://doi.org/10.1145/3301019.3319997.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. https://doi.org/10.1191/1478088706qp063oa.",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Dawn Brooker. 2003. What is person-centred care in dementia? Reviews in Clinical Gerontology 13, 03: 215--222. https://doi.org/10.1017/S095925980400108X.",
      "doi": ""
    },
    {
      "text": "Dawn Brooker and Isabelle Latham. 2015. Person-Centred Dementia Care, Second Edition: Making Services Better with the VIPS Framework. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Amy S. Bruckman, Casey Fiesler, Jeff Hancock, and Cosmin Munteanu. 2017. CSCW Research Ethics Town Hall: Working Towards Community Norms. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion), 113--115. https://doi.org/10.1145/3022198.3022199.",
      "doi": "10.1145/3022198.3022199"
    },
    {
      "text": "Morten Kyng. 1995. Cooperative Design: Techniques and Experiences From the Scandinavian Scene. In Readings in Human--Computer Interaction, RONALD M. Baecker, JONATHAN Grudin, WILLIAM A. S. Buxton and SAUL Greenberg (eds.). Morgan Kaufmann, 215--224. https://doi.org/10.1016/B978-0-08-051574--8.50025-X.",
      "doi": ""
    },
    {
      "text": "Willig Carla. 2013. Introducing Qualitative Research In Psychology. McGraw-Hill Education (UK).",
      "doi": ""
    },
    {
      "text": "Hilary Davis and Jenny Waycott. 2015. Ethical Encounters: HCI Research in Sensitive and Complex Settings. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), 667--669. https://doi.org/10.1145/2838739.2838834.",
      "doi": "10.1145/2838739.2838834"
    },
    {
      "text": "DEEP. Dementia Enquirers. DEEP. Retrieved September 20, 2019 from https://www.dementiavoices.org.uk/dementia-enquirers/.",
      "doi": ""
    },
    {
      "text": "Jan Dewing. 2007. Participatory research: A method for process consent with persons who have dementia. Dementia 6, 1: 11--25. https://doi.org/10.1177/1471301207075625.",
      "doi": ""
    },
    {
      "text": "Jan Dewing. 2008. Personhood and dementia: revisiting Tom Kitwood's ideas. International Journal of Older People Nursing 3, 1: 3--13. https://doi.org/10.1111/j.1748--3743.2007.00103.x.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2014. Reading and Interpreting Ethnography. In Ways of Knowing in HCI, Judith S. Olson and Wendy A. Kellogg (eds.). Springer New York, New York, NY, 1--23. https://doi.org/10.1007/978--1--4939-0378--8_1.",
      "doi": ""
    },
    {
      "text": "Sue Eckstein (ed.). 2003. Operational guidelines for ethics committees that review biomedical research. In Manual for Research Ethics Committees. Cambridge University Press, Cambridge, 505--515. https://doi.org/10.1017/CBO9780511550089.069.",
      "doi": ""
    },
    {
      "text": "Sarah J. L. Edwards, Richard Ashcroft, and Simon Kirchin. 2004. Research ethics committees: differences and moral judgement. Bioethics 18, 5: 408--427.",
      "doi": ""
    },
    {
      "text": "Melanie Ehrenkranz. Men Try to \"Redefine\" Sexual Consent With Blockchain. Gizmodo. Retrieved September 20, 2019 from https://gizmodo.com/men-try-to-redefine-sexual-consent-with-blockchain-1821964907.",
      "doi": ""
    },
    {
      "text": "Ruth Elvish, Ian James, and Derek Milne. 2010. Lying in dementia care: an example of a culture that deceives in people's best interests. Aging & Mental Health 14, 3: 255--262. https://doi.org/10.1080/13607861003587610.",
      "doi": ""
    },
    {
      "text": "Ilker Etikan. 2016. Comparison of Convenience Sampling and Purposive Sampling. American Journal of Theoretical and Applied Statistics 5: 1. https://doi.org/10.11648/j.ajtas.20160501.11.",
      "doi": ""
    },
    {
      "text": "Sam Fazio, Douglas Pace, Janice Flinner, and Beth Kallmyer. 2018. The Fundamentals of Person-Centered Care for Individuals With Dementia. The Gerontologist 58, suppl_1: S10--S19. https://doi.org/10.1093/geront/gnx122.",
      "doi": ""
    },
    {
      "text": "Sarah Foley, John McCarthy, and Nadia Pantidi. 2019. The Struggle for Recognition in Advanced Dementia: Implications for Experience-Centered Design. ACM Transactions on Computer-Human Interaction 26, 6: 1--29. https://doi.org/10.1145/3359594.",
      "doi": "10.1145/3359594"
    },
    {
      "text": "Sarah Foley, Nadia Pantidi, and John McCarthy. 2019. Care and Design: An Ethnography of Mutual Recognition in the Context of Advanced Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 610:1--610:15. https://doi.org/10.1145/3290605.3300840.",
      "doi": "10.1145/3290605.3300840"
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 404:1--404:13. https://doi.org/10.1145/3290605.3300634.",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "Marcus Foth. Participatory Design and Action Research: Identical Twins or Synergetic Pair? .",
      "doi": ""
    },
    {
      "text": "Martin Fowler and Jim Highsmith. 2001. The Agile Manifesto. Dr. Dobb's. Retrieved December 24, 2019 from http://www.drdobbs.com/open-source/the-agile-manifesto/184414755.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Amy S. Bruckman, Cosmin Munteanu, Melissa Densmore, and Jenny Waycott. 2017. Research Ethics in HCI: A Town Hall Meeting. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 1295--1299. https://doi.org/10.1145/3027063.3051135.",
      "doi": "10.1145/3027063.3051135"
    },
    {
      "text": "Batya Friedman. 1996. Value-sensitive Design. interactions 3, 6: 16--23. https://doi.org/10.1145/242485.242493.",
      "doi": ""
    },
    {
      "text": "Kenneth J. Gergen. 1985. Social Constructionist Inquiry: Context and Implications. In The Social Construction of the Person, Kenneth J. Gergen and Keith E. Davis (eds.). Springer, New York, NY, 3--18. https://doi.org/10.1007/978--1--4612--5076-0_1.",
      "doi": ""
    },
    {
      "text": "Bernard Gert and Joshua Gert. 2017. The Definition of Morality. In The Stanford Encyclopedia of Philosophy (Fall 2017), Edward N. Zalta (ed.). Metaphysics Research Lab, Stanford University. Retrieved September 17, 2019 from https://plato.stanford.edu/archives/fall2017/entries/morality-definition/.",
      "doi": ""
    },
    {
      "text": "Critical Platform Studies Group, Lilly Irani, Niloufar Salehi, Joyojeet Pal, Andrés Monroy-Hernández, Elizabeth Churchill, and Sneha Narayan. 2019. Patron or Poison?: Industry Funding of HCI Research. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (CSCW '19), 111--115. https://doi.org/10.1145/3311957.3358610.",
      "doi": ""
    },
    {
      "text": "Maurice Hamington. 2019. Integrating Care Ethics and Design Thinking. Journal of Business Ethics 155, 1: 91--103. https://doi.org/10.1007/s10551-017--3522--6.",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Andrea Wilkinson, and Karin Slegers. 2014. Challenges in Doing Participatory Design with People with Dementia. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium Papers, and Keynote Abstracts - Volume 2 (PDC '14), 33--36. https://doi.org/10.1145/2662155.2662196.",
      "doi": "10.1145/2662155.2662196"
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--13. https://doi.org/10.1145/3173574.3174088.",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "James Hodge, Kyle Montague, Sandra Hastings, and Kellie Morrissey. 2019. Exploring Media Capture of Meaningful Experiences to Support Families Living with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 423:1--423:14. https://doi.org/10.1145/3290605.3300653.",
      "doi": "10.1145/3290605.3300653"
    },
    {
      "text": "Joanne Horton, Richard Macve, and Geert Struyven. 2004. Chapter 20 - Qualitative Research: Experiences in Using Semi-Structured Interviews1. In The Real Life Guide to Accounting Research, Christopher Humphrey and Bill Lee (eds.). Elsevier, Oxford, 339--357. https://doi.org/10.1016/B978-008043972--3/50022-0.",
      "doi": ""
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2019. Foregrounding Everyday Sounds in Dementia. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 71--83. https://doi.org/10.1145/3322276.3322287.",
      "doi": "10.1145/3322276.3322287"
    },
    {
      "text": "John Killick Claire Craig. 2012. Creativity and Communication in Persons With Dementia: A Practical Guide. Jessica Kingsley, London.",
      "doi": ""
    },
    {
      "text": "Tom Kitwood and Kathleen Bredin. 1992. Towards a Theory of Dementia Care: Personhood and Well-being. Ageing & Society 12, 3: 269--287. https://doi.org/10.1017/S0144686X0000502X.",
      "doi": ""
    },
    {
      "text": "Mark L Knapp and Judith A Hall. 2013. Nonverbal Communication in Human Interaction. 8th Edition. Retrieved from https://testbank24.com/pdf/Test-Bank-Nonverbal-Communication-in-Human-Interaction-8th-Edition-Knapp.pdf.",
      "doi": ""
    },
    {
      "text": "Pia C. Kontos and Gary Naglie. 2007. Expressions of Personhood in Alzheimer's Disease: An Evaluation of Research-Based Theatre as a Pedagogical Tool. Qualitative Health Research 17, 6: 799--811. https://doi.org/10.1177/1049732307302838.",
      "doi": ""
    },
    {
      "text": "Pia Kontos and Alisa Grigorovich. 2018. Integrating Citizenship, Embodiment, and Relationality: Towards a Reconceptualization of Dance and Dementia in Long-Term Care. The Journal of Law, Medicine & Ethics 46, 3: 717--723. https://doi.org/10.1177/1073110518804233.",
      "doi": ""
    },
    {
      "text": "Pia Kontos and Wendy Martin. 2013. Embodiment and dementia: Exploring critical narratives of selfhood, surveillance, and dementia care. Dementia 12, 3: 288--302. https://doi.org/10.1177/1471301213479787.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar. 2014. Using Technology to Increase Meaningful Engagement in a Memory Care Unit. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14), 255--257. https://doi.org/10.1145/2660398.2660433.",
      "doi": "10.1145/2660398.2660433"
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 2175--2188. https://doi.org/10.1145/3025453.3025522.",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. Supporting People with Dementia in Digital Social Sharing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 2149--2162. https://doi.org/10.1145/3025453.3025586.",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "V. Leuty, J. Boger, L. Young, J. Hoey, and A. Mihailidis. 2013. Engaging older adults with dementia in creative occupations using artificially intelligent assistive technology. Assistive technology?: the official journal of RESNA 25, 2: 72--79. https://doi.org/10.1080/10400435.2012.715113.",
      "doi": ""
    },
    {
      "text": "Jill Manthorpe and Kritika Samsi. 2016. Person-centered dementia care: current perspectives. Clinical Interventions in Aging 11: 1733--1740. https://doi.org/10.2147/CIA.S104618.",
      "doi": ""
    },
    {
      "text": "Matts Mattsson and Stephen Kemmis. 2007. Praxis?related research: serving two masters? Pedagogy, Culture & Society 15, 2: 185--214. https://doi.org/10.1080/14681360701403706.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2007. Technology As Experience. The MIT Press.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Johanna Meurer, Claudia Müller, Carla Simone, Ina Wagner, and Volker Wulf. 2018. Designing for Sustainability: Key Issues of ICT Projects for Ageing at Home. Computer Supported Cooperative Work (CSCW) 27, 3: 495--537. https://doi.org/10.1007/s10606-018--9317--1.",
      "doi": "10.5555/3269986.3270003"
    },
    {
      "text": "Kellie Morrissey and John McCarthy. 2015. Creative and Opportunistic Use of Everyday Music Technologies in a Dementia Care Unit. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15), 295--298. https://doi.org/10.1145/2757226.2757228.",
      "doi": "10.1145/2757226.2757228"
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1326--1338. https://doi.org/10.1145/3025453.3025527.",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Kellie Morrissey, Gavin Wood, David Green, Nadia Pantidi, and John McCarthy. 2016. \"I'm a rambler, I'm a gambler, I'm a long way from home.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, 1008--1020. https://doi.org/10.1145/2901790.2901798.",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Allison Druin. Participatory Design: The Third Space in HCI. 70.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Amy Bruckman, Michael Muller, Christopher Frauenberger, Casey Fiesler, Robert E. Kraut, Katie Shilton, and Jenny Waycott. 2019. SIGCHI Research Ethics Town Hall. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19), panel05:1--panel05:6. https://doi.org/10.1145/3290607.3311742.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, and John Vines. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 105--114. https://doi.org/10.1145/2702123.2702481.",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "NHS. NHS - Involving people in their own care. Retrieved December 24, 2019 from https://www.england.nhs.uk/ourwork/patient-participation/.",
      "doi": ""
    },
    {
      "text": "Alison Novak. 2014. Anonymity, Confidentiality, Privacy, and Identity: The Ties That Bind and Break in Communication Research. Review of Communication 14, 1: 36--48. https://doi.org/10.1080/15358593.2014.942351.",
      "doi": ""
    },
    {
      "text": "Lorelli S. Nowell, Jill M. Norris, Deborah E. White, and Nancy J. Moules. 2017. Thematic Analysis: Striving to Meet the Trustworthiness Criteria. International Journal of Qualitative Methods 16, 1: 1609406917733847. https://doi.org/10.1177/1609406917733847.",
      "doi": ""
    },
    {
      "text": "Chaim Noy. 2008. Sampling Knowledge: The Hermeneutics of Snowball Sampling in Qualitative Research. International Journal of Social Research Methodology 11, 4: 327--344. https://doi.org/10.1080/13645570701401305.",
      "doi": ""
    },
    {
      "text": "Femi Oyebode and Darren Shickle. 2005. The Mental Capacity Act 2005. Clinical Medicine 6, 2: 2005--2006. https://doi.org/10.1258/147775006776173309.",
      "doi": ""
    },
    {
      "text": "Nancy A. Pachana, Jacki Liddle, Nancye M. Peel, Elizabeth Beattie, Christine Juang, and Bob G. Knight. 2014. Can We Do Better? Researchers' Experiences with Ethical Review Boards on Projects with Later Life as a Focus. Journal of Alzheimer's Disease 43, 3: 701--707. https://doi.org/10.3233/JAD-141956.",
      "doi": ""
    },
    {
      "text": "Institute of Medicine (US) Committee on Assessing the System for Protecting Human Research Participants, Daniel D. Federman, Kathi E. Hanna, and Laura Lyman Rodriguez. 2002. Back to Basics: Scientific, Conflict of Interest, and Ethical Review of Research Protocols. National Academies Press (US). Retrieved September 19, 2019 from https://www.ncbi.nlm.nih.gov/books/NBK43564/.",
      "doi": ""
    },
    {
      "text": "Wanda Pillow. 2003. Confession, catharsis, or cure? Rethinking the uses of reflexivity as methodological power in qualitative research. International Journal of Qualitative Studies in Education 16, 2: 175--196. https://doi.org/10.1080/0951839032000060635.",
      "doi": ""
    },
    {
      "text": "Thomas Scanlon. 1998. What We Owe to Each Other. Belknap Press of Harvard University Press.",
      "doi": ""
    },
    {
      "text": "silicon. 2017. The battle for ethics at the cutting edge of technology. Silicon Republic. Retrieved September 20, 2019 from https://www.siliconrepublic.com/machines/ethics-technology-fiachra-o-brolchain-dcu.",
      "doi": ""
    },
    {
      "text": "Laura Stark. 2007. Victims in Our Own Minds? IRBs in Myth and Practice. Law & Society Review 41, 4: 777--786. https://doi.org/10.1111/j.1540--5893.2007.00323.x.",
      "doi": ""
    },
    {
      "text": "Sanna Talja, Kimmo Tuominen, and Reijo Savolainen. 2005. \"Isms\" in information science: constructivism, collectivism and constructionism. Journal of Documentation 61: 79--101. https://doi.org/10.1108/00220410510578023.",
      "doi": ""
    },
    {
      "text": "Maria Dolores C. Tongco. 2007. Purposive Sampling as a Tool for Informant Selection. https://doi.org/10.17348/era.5.0.147--158.",
      "doi": ""
    },
    {
      "text": "Austin L. Toombs, Andy Dow, John Vines, Colin M. Gray, Barbara Dennis, Rachel Clarke, and Ann Light. 2018. Designing for Everyday Care in Communities. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS '18 Companion), 391--394. https://doi.org/10.1145/3197391.3197394.",
      "doi": "10.1145/3197391.3197394"
    },
    {
      "text": "Cathy Treadaway and Gail Kenning. 2016. Sensor e-textiles: person centered co-design for people with late stage dementia. Working with Older People. https://doi.org/10.1108/WWOP-09--2015-0022.",
      "doi": ""
    },
    {
      "text": "Julia Twigg and Christina E. Buse. 2013. Dress, dementia and the embodiment of identity: Dementia. https://doi.org/10.1177/1471301213476504.",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Konstantin Aal, Daryoush Daniel Vaziri, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Facilitating Collaboration and Social Experiences with Videogames in Dementia: Results and Implications from a Participatory Design Study. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 175. https://doi.org/10.1145/3274444.",
      "doi": "10.1145/3274444"
    },
    {
      "text": "David Unbehaun, Daryoush Daniel Vaziri, Konstantin Aal, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Exploring the Potential of Exergames to affect the Social and Daily Life of People with Dementia and their Caregivers. 62. https://doi.org/10.1145/3173574.3173636.",
      "doi": ""
    },
    {
      "text": "John Vines, Roisin McNaney, Rachel Clarke, Stephen Lindsay, John McCarthy, Steve Howard, Mario Romero, and Jayne Wallace. 2013. Designing For- and With- Vulnerable People. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 3231--3234. https://doi.org/10.1145/2468356.2479654.",
      "doi": ""
    },
    {
      "text": "John Vines, Róisín McNaney, Amey Holden, Ivan Poliakov, Peter Wright, and Patrick Olivier. 2017. Our Year With the Glass: Expectations, Letdowns and Ethical Dilemmas of Technology Trials With Vulnerable People. Interacting with Computers 29, 1: 27--44. https://doi.org/10.1093/iwc/iww017.",
      "doi": ""
    },
    {
      "text": "Loïc Wacquant. 2015. For a Sociology of Flesh and Blood. Qualitative Sociology 38, 1: 1--11. https://doi.org/10.1007/s11133-014--9291-y.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace. 2013. Interaction Design, Heritage, and the Self. interactions 20, 5: 16--20. https://doi.org/10.1145/2500247.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 3441. https://doi.org/10.1145/2470654.2466473.",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, 2629. https://doi.org/10.1145/2207676.2208654.",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, 2629. https://doi.org/10.1145/2207676.2208654.",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A Design-led Inquiry into Personhood in Dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2617--2626. https://doi.org/10.1145/2470654.2481363.",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Lin Wan, Claudia Müller, Dave Randall, and Volker Wulf. 2016. Design of A GPS Monitoring System for Dementia Care and Its Challenges in Academia-Industry Project. ACM Trans. Comput.-Hum. Interact. 23, 5: 31:1--31:36. https://doi.org/10.1145/2963095.",
      "doi": "10.1145/2963095"
    },
    {
      "text": "Lin Wan, Claudia Müller, Volker Wulf, and David William Randall. 2014. Addressing the Subtleties in Dementia Care: Pre-study & Evaluation of a GPS Monitoring System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3987--3996. https://doi.org/10.1145/2556288.2557307.",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "Jenny Waycott, Hilary Davis, Anja Thieme, Stacy Branham, John Vines, and Cosmin Munteanu. 2015. Ethical Encounters in HCI: Research in Sensitive Settings. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 2369--2372. https://doi.org/10.1145/2702613.2702655.",
      "doi": "10.1145/2702613.2702655"
    },
    {
      "text": "Jenny Waycott, Greg Wadley, Stefan Schutt, Arthur Stabolidis, and Reeva Lederman. 2015. The Challenge of Technology Research in Sensitive Settings. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction on - OzCHI '15, 240--249. https://doi.org/10.1145/2838739.2838773.",
      "doi": "10.1145/2838739.2838773"
    },
    {
      "text": "Daniel Welsh, Kellie Morrissey, Sarah Foley, Roisin McNaney, Christos Salis, John McCarthy, and John Vines. 2018. Ticket to Talk: Supporting Conversation Between Young People and People with Dementia Through Digital Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 375:1--375:14. https://doi.org/10.1145/3173574.3173949.",
      "doi": "10.1145/3173574.3173949"
    },
    {
      "text": "Sarah Myers West. 2019. Data Capitalism: Redefining the Logics of Surveillance and Privacy. Business and Society 58, 1: 20--41. https://doi.org/10.1177/0007650317718185.",
      "doi": ""
    },
    {
      "text": "Symptoms. Alzheimer's Society. Retrieved September 19, 2019 from https://www.alzheimers.org.uk/about-dementia/symptoms-and-diagnosis/symptoms.",
      "doi": ""
    },
    {
      "text": "WMA - The World Medical Association-WMA Declaration of Helsinki -- Ethical Principles for Medical Research Involving Human Subjects. Retrieved September 17, 2019 from https://www.wma.net/policies-post/wma-declaration-of-helsinki-ethical-principles-for-medical-research-involving-human-subjects/.",
      "doi": ""
    },
    {
      "text": "Dementia Lab 2020 / Supporting Ability / The Conference. Retrieved December 24, 2019 from http://www.dementialabconference.com",
      "doi": ""
    }
  ]
}