{
  "doi": "10.1145/3313831.3376216",
  "title": "Officers Never Type: Examining the Persistence of Paper in e-Governance",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "The Global South has seen a proliferation of e-governance initiatives aimed at digitizing governmental service delivery. However, paper continues to remain the primary medium of bureaucracy. During ethnographic fieldwork at the CM Helpline, a state-wide e-governance initiative in central India, we observed that even tech-savvy bureaucrats who fully supported both the initiative and its paper-to-electronic transition ensured that paper continues to persist in abundance. Drawing upon scholarship from HCI, anthropology, and science & technology studies, we theorize this contradiction to uncover the circulations of power between people, paper, and electronic systems. We suggest that designers should recognize that new systems often disempower existing actors. The process of transition should integrate new systems into the existing ecosystem and plan for the graceful retirement of older technologies. In addition to machine errors, systems should be resilient to human errors. Finally, new systems should attend to sociocultural and historical specificities.",
  "tags": [
    "design",
    "e-governance",
    "power",
    "structural violence",
    "bureaucracy",
    "paper",
    "persistence"
  ],
  "authors": [
    {
      "name": "Megh Marathe",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658660109",
      "orcid": "missing"
    },
    {
      "name": "Priyank Chandra",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714851",
      "orcid": "0000-0003-4024-8871"
    }
  ],
  "references": [
    {
      "text": "Petra Auvinen, Hannele Palukka, and Ilkka Arminen. 2014. The document use as a situated practice in pre-hospital emergency care. A Matter Of Design. Making Society Through Science And Technology (2014), 1179.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic Hci. Synthesis Lectures on Human-Centered Informatics 8, 4 (2015), 1--185.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1301--1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Marc Berg. 1996. Practices of reading and writing: the constitutive role of the patient record in medical work. Sociology of health & illness 18, 4 (1996), 499--524.",
      "doi": ""
    },
    {
      "text": "Olha Bondarenko and Ruud Janssen. 2005. Documents at hand: Learning from paper to improve digital technologies. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 121--130.",
      "doi": "10.1145/1054972.1054990"
    },
    {
      "text": "Kristin Braa and Tone Sandahl. 2000. Introducing Digital Documents in Work Practices -- Challenges and Perspectives. Group Decision & Negotiation 9, 3 (2000), 189--203.",
      "doi": ""
    },
    {
      "text": "Dipanjan Chakraborty, Mohd Sultan Ahmad, and Aaditeshwar Seth. 2017. Findings from a Civil Society Mediated and Technology Assisted Grievance Redressal Model in Rural India. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development (ICTD '17). ACM, NY, NY, USA, Article 2, 12 pages. DOI: http://dx.doi.org/10.1145/3136560.3136574",
      "doi": "10.1145/3136560.3136574"
    },
    {
      "text": "Priyank Chandra. 2017. Informality and invisibility: Traditional technologies as tools for collaboration in an informal market. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4765--4775.",
      "doi": "10.1145/3025453.3025643"
    },
    {
      "text": "Kuang Chen, Akshay Kannan, Yoriyasu Yano, Joseph M. Hellerstein, and Tapan S. Parikh. 2012. Shreddr: pipelined paper digitization for low-resource organizations. Proceedings of the 2nd ACM Symposium on Computing for Development (2012). DOI: http://dx.doi.org/10.1145/2160601.2160605",
      "doi": "10.1145/2160601.2160605"
    },
    {
      "text": "Lars Rune Christensen and Pernille Bjorn. 2014. Documentscape: intertextuality, sequentiality, & autonomy at work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2451--2460.",
      "doi": "10.1145/2556288.2557305"
    },
    {
      "text": "J W Creswell. 2007. Qualitative Inquiry and Research Design: Choosing Among Five Approaches. SAGE Publications, Thousand Oaks, CA. https://books.google.com/books?id=DetLkgQeTJgC",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Nathan Breit, Timóteo Chaluco, Jessica Crawford, and Gaetano Borriello. 2012. Digitizing paper forms with mobile imaging technologies. Proceedings of the 2nd ACM Symposium on Computing for Development - ACM DEV '12 (2012), 1. DOI: http://dx.doi.org/10.1145/2160601.2160604",
      "doi": "10.1145/2160601.2160604"
    },
    {
      "text": "Nicola Dell, Trevor Perrier, Neha Kumar, Mitchell Lee, Rachel Powers, and Gaetano Borriello. 2015. Paper-Digital Workflows in Global Development Organizations. CSCW (2015), 1659--1669. DOI: http://dx.doi.org/10.1145/2675133.2675145",
      "doi": ""
    },
    {
      "text": "Mateusz Dolata and Gerhard Schwabe. 2017. Paper practices in institutional talk: How financial advisors impress their clients. Computer Supported Cooperative Work (CSCW) 26, 4--6 (2017), 769--805.",
      "doi": "10.1007/s10606-017-9279-8"
    },
    {
      "text": "Paul Dourish and Scott D Mainwaring. 2012. Ubicomp's colonial impulse. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 133--142.",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Richard H Dykstra, Joan S Ash, Emily Campbell, Dean F Sittig, Ken Guappone, James Carpenter, Joshua Richardson, Adam Wright, and Carmit McMullen. 2009. Persistent paper: the myth of \"going paperless\". In AMIA Annual Symposium Proceedings, Vol. 2009. American Medical Informatics Association, 158.",
      "doi": ""
    },
    {
      "text": "Robert Emerson, Rachel Fretz, and Linda Shaw. 2011. Writing Ethnographic Fieldnotes. University of Chicago Press, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Ylva Fernaeus, Martin Jonsson, and Jakob Tholander. 2012. Revisiting the jacquard loom: threads of history and current patterns in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1593--1602.",
      "doi": "10.1145/2207676.2208280"
    },
    {
      "text": "Megan Finn, Janaki Srinivasan, and Rajesh Veeraraghavan. 2014. Seeing with paper: Government documents and material participation. Proceedings of the Annual Hawaii International Conference on System Sciences (2014), 1515--1524. DOI: http://dx.doi.org/10.1109/HICSS.2014.195",
      "doi": "10.1109/HICSS.2014.195"
    },
    {
      "text": "Ishita Ghosh, Jay Chen, Joy Ming, and Azza Abouzied. 2015. The Persistence of Paper: A Case Study in Microfinance from Ghana. Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (2015), 13:1--13:10. DOI: http://dx.doi.org/10.1145/2737856.2738029",
      "doi": "10.1145/2737856.2738029"
    },
    {
      "text": "Akhil Gupta. 2012. Red Tape: Bureaucracy, Structural Violence, and Poverty in India. Duke University Press, Durham and London. 368 pages.",
      "doi": ""
    },
    {
      "text": "Martyn Hammersley and Paul Atkinson. 2007. Ethnography: Principles in practice. Routledge.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1997. Modest-Witness@SecondMillennium.FemaleMan-Meets-OncoMouseTM: Feminism and Technoscience. Routledge, New York. xi, 361 p. pages.",
      "doi": ""
    },
    {
      "text": "Christian Heath and Paul Luff. 1996. Documents and Professional Practice: \"bad\" Organisational Reasons for \"good\" Clinical Records.. In CSCW, Vol. 96. 354--363.",
      "doi": ""
    },
    {
      "text": "Matthew S Hull. 2012a. Documents and Bureaucracy*. Annual Review of Anthropology 41, 1 (2012), 251--267. DOI: http://dx.doi.org/10.1146/annurev.anthro.012809.104953",
      "doi": ""
    },
    {
      "text": "Matthew S Hull. 2012b. Government of Paper: The Materiality of Bureaucracy in Urban Pakistan. University of California Press. https://books.google.com/books?id=2ZqVvQN9PTwC",
      "doi": ""
    },
    {
      "text": "Matthew S Hull. 2013. The materiality of indeterminacy ... on paper, at least. HAU: Journal of Ethnographic Theory 3, 3 (dec 2013), 441--447. DOI: http://dx.doi.org/10.14318/hau3.3.030",
      "doi": ""
    },
    {
      "text": "Matthew S Hull. 2017. Satisfied Callers: Police and Corporate Customer Service Technology in India. (2017). Talk presented at the STS Speaker Series, University of Michigan.",
      "doi": ""
    },
    {
      "text": "Lilly Irani. 2019. Chasing Innovation: Making Entrepreneurial Citizens in Modern India. Vol. 22. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Nahoko Kameo and Jack Whalen. 2015. Organizing documents: Standard forms, person production and organizational action. Qualitative Sociology 38, 2 (2015), 205--229.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 1983. Give Me a Laboratory and I Will Raise the World. In Science observed: perspectives on the social study of science, Karin Knorr-Cetina and Michael J Mulkay (Eds.). Sage Publications, London : Beverly Hills, Calif.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2005. Reassembling the social : an introduction to actor-network-theory. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "J David Lewis and Andrew Weigert. 1985. Trust as a social reality. Social forces 63, 4 (1985), 967--985.",
      "doi": ""
    },
    {
      "text": "Paul Luff, Christian Heath, and David Greatbatch. 1992. Tasks-in-interaction: paper and screen based documentation in collaborative activity. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work. ACM, 163--170.",
      "doi": "10.1145/143457.143475"
    },
    {
      "text": "Paul Luff, Karola Pitsch, CC Heath, Peter Herdman, and Julian Wood. 2008. Creating Affinities between paper and digital resources. Proceedings of Social Interaction and Mundane Technologies (2008).",
      "doi": ""
    },
    {
      "text": "Niklas Luhmann. 2000. Familiarity, confidence, trust: Problems and alternatives. Trust: Making and breaking cooperative relations 6 (2000), 94--107.",
      "doi": ""
    },
    {
      "text": "Michael Lynch and Steve Woolgar. 1990. Representation in scientific practice. MIT Press, Cambridge, Mass. x, 365 p. pages.",
      "doi": ""
    },
    {
      "text": "Shirin Madon. 2009. e-Governance for Development. Palgrave Macmillan UK, London. DOI: http://dx.doi.org/10.1057/9780230250499",
      "doi": ""
    },
    {
      "text": "Megh Marathe, Jacki O'Neill, Paromita Pain, and William Thies. 2016. ICT-Enabled Grievance Redressal in Central India: A Comparative Analysis. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD '16). ACM, NY, NY, USA, 4:1--4:11. DOI: http://dx.doi.org/10.1145/2909609.2909653",
      "doi": ""
    },
    {
      "text": "M B Miles, A M Huberman, and Johnny Saldaña. 2014. Qualitative Data Analysis: A Methods Sourcebook. Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Guido Möllering. 2001. The nature of trust: From Georg Simmel to a theory of expectation, interpretation and suspension. Sociology 35, 2 (2001), 403--420.",
      "doi": ""
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner, and William Thies. 2012. Emergent Practices Around CGNet Swara, A Voice Forum for Citizen Journalism in Rural India. In ICTD. DOI: http://dx.doi.org/10.1145/2160673.2160695",
      "doi": ""
    },
    {
      "text": "Sriharini Narayanan. 2010. Accountability and the New Media: Use of ICTs in Governance in India. In ICTD. DOI: http://dx.doi.org/10.1145/2369220.2369246",
      "doi": ""
    },
    {
      "text": "Saeko Nomura, Edwin Hutchins, and Barbara Holder. A Multi-Cultural Study of Paper Use in the Flight Deck. Journal of Cognitive Science 20, 2 (????), 118--129.",
      "doi": ""
    },
    {
      "text": "Saeko Nomura, Edwin Hutchins, and Barbara E Holder. 2006. The uses of paper in commercial airline flight operations. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 249--258.",
      "doi": "10.1145/1180875.1180914"
    },
    {
      "text": "Tapan Parikh, Vijay Pratap Singh Aditya, and Muthu Velayutham. 2003. Automated Forms Processing and Paper User Interfaces for Data Collection from Village Microfinance Groups. Technical Report. http://people.ischool.berkeley.edu/",
      "doi": ""
    },
    {
      "text": "Tapan S Parikh, Paul S Javid, Sasikumar K, Kaushik Ghosh, and Kentaro Toyama. 2006. Mobile phones and paper documents: Evaluating a new approach for capturing microfinance data in rural India. In Proceedings of the SIGCHI conference on Human Factors in computing systems CHI 06. 551--560. DOI: http://dx.doi.org/10.1145/1124772.1124857",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Punjab Police. 2018. 181 Punjab Police Helpline website. (2018). www.181pph.com",
      "doi": ""
    },
    {
      "text": "Kiran Gopakumar Rajalekshmi. 2007. E-governance Services Through Telecenters: The Role of Human Intermediary and Issues of Trust. ITID 4, 1 (oct 2007). DOI: http://dx.doi.org/10.1162/itid.2007.4.1.19",
      "doi": ""
    },
    {
      "text": "Ursula Rao. 2013. Biometric Marginality: UID and the Shaping of Homeless Identities in the City. Economic & Political Weekly 48, 13 (2013), 71--77.",
      "doi": ""
    },
    {
      "text": "Ursula Rao. 2017. Writing, typing, and scanning. Distributive justice and the politics of visibility in the era of e-governance. In Media as Politics in South Asia, Sahana Udupa and Stephen D McDowell (Eds.). Routledge, London, 127--140.",
      "doi": ""
    },
    {
      "text": "Daniela K Rosner and Alex S Taylor. 2011. Antiquarian answers: book restoration as a resource for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2665--2668.",
      "doi": "10.1145/1978942.1979332"
    },
    {
      "text": "Kjeld Schmidt and Liam Bannon. 1992. Taking CSCW seriously. Computer Supported Cooperative Work (CSCW) 1, 1 (01 Mar 1992), 7--40. DOI: http://dx.doi.org/10.1007/BF00752449",
      "doi": ""
    },
    {
      "text": "Abigail Sellen and Richard Harper. 1997. Paper as an analytic resource for the design of new technologies. In CHI, Vol. 97. Citeseer, 319--326.",
      "doi": "10.1145/258549.258780"
    },
    {
      "text": "Abigail J Sellen and Richard H R Harper. 2003. The myth of the paperless office. MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/778158"
    },
    {
      "text": "Gursharan Singh, Leah Findlater, Kentaro Toyama, Scott Helmer, Rikin Gandhi, and Ravin Balakrishnan. 2009. Numeric paper forms for NGOs. In 2009 International Conference on Information and Communication Technologies and Development, ICTD 2009 - Proceedings. 406--416. DOI: http://dx.doi.org/10.1109/ICTD.2009.5426686",
      "doi": ""
    },
    {
      "text": "Janaki Srinivasan and Aditya Johri. 2013. Creating Machine Readable Men: Legitimizing the 'Aadhaar' Mega e-Infrastructure Project in India. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (ICTD '13). ACM, NY, NY, USA, 101--112. DOI: http://dx.doi.org/10.1145/2516604.2516625",
      "doi": "10.1145/2516604.2516625"
    },
    {
      "text": "State Agency for Public Services. 2018. CM Helpline website. (2018). http://cmhelpline.mp.gov.in",
      "doi": ""
    },
    {
      "text": "Laura Sterponi, Cristina Zucchermaglio, Francesca Alby, and Marilena Fatigante. 2017. Endangered Literacies? Affordances of Paper-Based Literacy in Medical Practice and Its Persistence in the Transition to Digital Technology. Written Communication 34, 4 (2017), 359--386.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2011. Technology as amplifier in international development. Proceedings of the 2011 iConference on - iConference '11 (2011), 75--82. DOI: http://dx.doi.org/10.1145/1940761.1940772",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Rajesh Veeraraghavan. 2013. Dealing with the digital panopticon: the use and subversion of ICT in an Indian bureaucracy. In ICTD. DOI: http://dx.doi.org/10.1145/2516604.2516631",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Arkadeep Kumar, Aditya Vishwanath, Naveena Karusala, Betsy DiSalvo, and Neha Kumar. 2018. Designing for intersections. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 45--58.",
      "doi": "10.1145/3196709.3196794"
    }
  ]
}