{
  "doi": "10.1145/3313831.3376218",
  "title": "ArguLens: Anatomy of Community Opinions On Usability Issues Using Argumentation Models",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "In open-source software (OSS), the design of usability is often influenced by the discussions among community members on platforms such as issue tracking systems (ITSs). However, digesting the rich information embedded in issue discussions can be a major challenge due to the vast number and diversity of the comments. We propose and evaluate ArguLens, a conceptual framework and automated technique leveraging an argumentation model to support effective understanding and consolidation of community opinions in ITSs. Through content analysis, we anatomized highly discussed usability issues from a large, active OSS project, into their argumentation components and standpoints. We then experimented with supervised machine learning techniques for automated argument extraction. Finally, through a study with experienced ITS users, we show that the information provided by ArguLens supported the digestion of usability-related opinions and facilitated the review of lengthy issues. ArguLens provides the direction of designing valuable tools for high-level reasoning and effective discussion about usability.",
  "authors": [
    {
      "name": "Wenting Wang",
      "institution": "McGill University, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365562",
      "orcid": "missing"
    },
    {
      "name": "Deeksha Arya",
      "institution": "McGill University, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659432216",
      "orcid": "missing"
    },
    {
      "name": "Nicole Novielli",
      "institution": "University of Bari Aldo Moro, Bari, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384600624",
      "orcid": "missing"
    },
    {
      "name": "Jinghui Cheng",
      "institution": "Polytechnique Montréal, Montréal, PQ, Canada",
      "img": "/do/10.1145/contrib-81548783656/rel-imgonly/profile2.png",
      "acmid": "81548783656",
      "orcid": "0000-0002-8474-5290"
    },
    {
      "name": "Jin L.C. Guo",
      "institution": "McGill University, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158840757",
      "orcid": "0000-0003-1782-1545"
    }
  ],
  "references": [
    {
      "text": "Rob Abbott, Marilyn Walker, Pranav Anand, Jean E. Fox Tree, Robeson Bowmani, and Joseph King. 2011. How Can You Say Such Things?!?: Recognizing Disagreement in Informal Political Argument. In Proceedings of the Workshop on Languages in Social Media (LSM '11). Association for Computational Linguistics, Stroudsburg, PA, USA, 2--11. http://dl.acm.org/citation.cfm?id=2021109.2021111",
      "doi": ""
    },
    {
      "text": "Amritanshu Agrawal, Wei Fu, and Tim Menzies. 2018. What is wrong with topic modeling? And how to fix it using search-based software engineering. Information and Software Technology 98 (2018), 74--88.",
      "doi": "10.1016/j.infsof.2018.02.005"
    },
    {
      "text": "Morten Andreasen, Henrik Nielsen, Simon Schrøder, and Jan Stage. 2006. Usability in open source software development: opinions and practice. Information technology and control 35, 3A (2006), 303--312. DOI: http://dx.doi.org/10.5755/j01.itc.35.3.11776",
      "doi": ""
    },
    {
      "text": "Deeksha Arya, Wenting Wang, Jin L. C. Guo, and Jinghui Cheng. 2019. Analysis and Detection of Information Types of Open Source Software Issue Discussions. In Proceedings of the 41st International Conference on Software Engineering (ICSE '19). IEEE Press, Piscataway, NJ, USA, 454--464. DOI: http://dx.doi.org/10.1109/ICSE.2019.00058",
      "doi": "10.1109/ICSE.2019.00058"
    },
    {
      "text": "Katie Atkinson, Trevor Bench-Capon, and Peter McBurney. 2006. Computational representation of practical argument. Synthese 152, 2 (2006), 157--206.",
      "doi": ""
    },
    {
      "text": "Paula M. Bach and John M. Carroll. 2009. FLOSS UX Design: An Analysis of User Experience Design in Firefox and OpenOffice.org. In Open Source Ecosystems: Diverse Communities Interacting, Cornelia Boldyreff, Kevin Crowston, Björn Lundell, and Anthony I. Wasserman (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 237--250.",
      "doi": ""
    },
    {
      "text": "Paula M Bach, Robert DeLine, and John M Carroll. 2009. Designers wanted: Participation and the User Experience in Open Source Software Development. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, New York, New York, USA, 985. DOI: http://dx.doi.org/10.1145/1518701.1518852",
      "doi": "10.1145/1518701.1518852"
    },
    {
      "text": "Akshat Bakliwal, Piyush Arora, Ankit Patil, and Vasudeva Varma. 2011. Towards Enhanced Opinion Classification using NLP Techniques. In Proceedings of the Workshop on Sentiment Analysis where AI meets Psychology (SAAIP 2011). Asian Federation of Natural Language Processing, Chiang Mai, Thailand, 101--107.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2008. An Empirical Evaluation of the System Usability Scale. International Journal of Human-Computer Interaction 24, 6 (2008), 574--594. DOI: http://dx.doi.org/10.1080/10447310802205776",
      "doi": ""
    },
    {
      "text": "Olga Baysal, Reid Holmes, and Michael W. Godfrey. 2014. No Issue Left Behind: Reducing Information Overload in Issue Tracking. In Proceedings of the 22Nd ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE 2014). ACM, NY, NY, USA, 666--677. DOI: http://dx.doi.org/10.1145/2635868.2635887",
      "doi": "10.1145/2635868.2635887"
    },
    {
      "text": "Jamal Bentahar, Bernard Moulin, and Micheline Bélanger. 2010. A taxonomy of argumentation models used for knowledge representation. Artificial Intelligence Review 33, 3 (2010), 211--259.",
      "doi": "10.1007/s10462-010-9154-1"
    },
    {
      "text": "Jamal Bentahar, Bernard Moulin, and Brahim Chaib-draa. 2004. Commitment and Argument Network: A New Formalism for Agent Communication. In Advances in Agent Communication, Frank Dignum (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 146--165.",
      "doi": ""
    },
    {
      "text": "Jamal Bentahar, Bernard Moulin, John-Jules Ch. Meyer, and Brahim Chaib-draa. 2005. A Computational Model for Conversation Policies for Agent Communication. In Computational Logic in Multi-Agent Systems, João Leite and Paolo Torroni (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 178--195.",
      "doi": ""
    },
    {
      "text": "Filip Boltui´ c and Jan Snajder. 2014. Back up your stance: Recognizing arguments in online discussions. In Proceedings of the First Workshop on Argumentation Mining. Association for Computational Linguistics, Baltimore, Maryland, 49--58.",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Tse-Hsun Chen, Stephen W Thomas, and Ahmed E Hassan. 2016. A survey on the use of topic models when mining software repositories. Empirical Software Engineering 21, 5 (2016), 1843--1919.",
      "doi": "10.1007/s10664-015-9402-8"
    },
    {
      "text": "Jinghui Cheng and Jin L.C. Guo. 2018. How Do the Open Source Communities Address Usability and UX Issues?: An Exploratory Study. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW523, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188467",
      "doi": ""
    },
    {
      "text": "Jinghui Cheng and Jin L. C. Guo. 2019. Activity-based Analysis of Open Source Software Contributors: Roles and Dynamics. In Proceedings of the 12th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE '19). IEEE Press, Piscataway, NJ, USA, 11--18. DOI: http://dx.doi.org/10.1109/CHASE.2019.00011",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement 20, 1 (1960), 37--46. DOI: http://dx.doi.org/10.1177/001316446002000104",
      "doi": ""
    },
    {
      "text": "Cristian Danescu-Niculescu-Mizil, Moritz Sudhof, Dan Jurafsky, Jure Leskovec, and Christopher Potts. 2013. A computational approach to politeness with application to social factors. In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Sofia, Bulgaria, 250--259. https://www.aclweb.org/anthology/P13--1025",
      "doi": ""
    },
    {
      "text": "Phan Minh Dung. 1995. On the acceptability of arguments and its fundamental role in nonmonotonic reasoning, logic programming and n-person games. Artificial intelligence 77, 2 (1995), 321--357.",
      "doi": ""
    },
    {
      "text": "Steffen Eger, Johannes Daxenberger, and Iryna Gurevych. 2017. Neural End-to-End Learning for Computational Argumentation Mining. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Vancouver, Canada, 11--22. DOI: http://dx.doi.org/10.18653/v1/P17--1002",
      "doi": ""
    },
    {
      "text": "S. Fakhoury, V. Arnaoudova, C. Noiseux, F. Khomh, and G. Antoniol. 2018. Keep it simple: Is deep learning good for linguistic smell detection?. In 2018 IEEE 25th International Conference on Software Analysis, Evolution and Reengineering (SANER). 602--611. DOI: http://dx.doi.org/10.1109/SANER.2018.8330265",
      "doi": ""
    },
    {
      "text": "Vanessa Wei Feng and Graeme Hirst. 2011. Classifying arguments by scheme. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Portland, Oregon, USA, 987--996. https://www.aclweb.org/anthology/P11--1099",
      "doi": "10.5555/2002472.2002597"
    },
    {
      "text": "Eirini Florou, Stasinos Konstantopoulos, Antonis Koukourikos, and Pythagoras Karampiperis. 2013. Argument extraction for supporting public policy formulation. In Proceedings of the 7th Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities. Association for Computational Linguistics, Sofia, Bulgaria, 49--54. https://www.aclweb.org/anthology/W13--2707",
      "doi": ""
    },
    {
      "text": "Kathleen Freeman. 1993. Toward Formalizing Dialectical Argumentation. Ph.D. Dissertation. University of Oregon, Eugene, OR, USA. UMI Order No. GAX94-05172.",
      "doi": ""
    },
    {
      "text": "Jerome Friedman, Trevor Hastie, and Robert Tibshirani. 2009. The elements of statistical learning (2nd ed.). Springer series in statistics, New York, USA.",
      "doi": ""
    },
    {
      "text": "Wei Fu and Tim Menzies. 2017. Easy over Hard: A Case Study on Deep Learning. In Proceedings of the 2017 11th Joint Meeting on Foundations of Software Engineering (ESEC/FSE 2017). Association for Computing Machinery, New York, NY, USA, 49--60. DOI: http://dx.doi.org/10.1145/3106237.3106256",
      "doi": "10.1145/3106237.3106256"
    },
    {
      "text": "GitHub. 2018. GitHub REST API. https://developer.github.com/v3/. (2018). Accessed: February 2019.",
      "doi": ""
    },
    {
      "text": "Theodosis Goudas, Christos Louizos, Georgios Petasis, and Vangelis Karkaletsis. 2014. Argument Extraction from News, Blogs, and Social Media. In Artificial Intelligence: Methods and Applications, Aristidis Likas, Konstantinos Blekas, and Dimitris Kalles (Eds.). Springer International Publishing, Cham, 287--299.",
      "doi": ""
    },
    {
      "text": "Ivan Habernal and Iryna Gurevych. 2017. Argumentation mining in user-generated web discourse. Computational Linguistics 43, 1 (2017), 125--179.",
      "doi": "10.1162/COLI_a_00276"
    },
    {
      "text": "James A Herrick. 2017. The history and theory of rhetoric: An introduction. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Netta Iivari. 2011. Participatory design in OSS development: interpretive case studies in company and community OSS development contexts. Behaviour & Information Technology 30, 3 (may 2011), 309--323. DOI: http://dx.doi.org/10.1080/0144929X.2010.503351",
      "doi": "10.1080/0144929X.2010.503351"
    },
    {
      "text": "Netta Iivari. 2013. \"Configuring the User and the Designer' -- A Critical Inquiry on Usability Work in the Company Open Source Software Development Context. In Nordic Contributions in IS Research, Margunn Aanestad and Tone Bratteteig (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 1--17.",
      "doi": ""
    },
    {
      "text": "Thorsten Joachims. 1998. Text Categorization with Support Vector Machines: Learning with Many Relevant Features. In Proceedings of the 10th European Conference on Machine Learning (ECML'98). Springer-Verlag, Berlin, Heidelberg, 137--142. DOI: http://dx.doi.org/10.1007/BFb0026683",
      "doi": "10.5555/645326.649721"
    },
    {
      "text": "Thorsten Joachims. 2006. Training Linear SVMs in Linear Time. In Proceedings of the 12th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '06). ACM, NY, NY, USA, 217--226. DOI: http://dx.doi.org/10.1145/1150402.1150429",
      "doi": "10.1145/1150402.1150429"
    },
    {
      "text": "Sotiris B Kotsiantis, I Zaharakis, and P Pintelas. 2007. Supervised machine learning: A review of classification techniques. Emerging artificial intelligence applications in computer engineering 160 (2007), 3--24.",
      "doi": "10.5555/1566770.1566773"
    },
    {
      "text": "Effie Lai-Chong Law and Ebba Thora Hvannberg. 2008. Consolidating Usability Problems with Novice Evaluators. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, NY, NY, USA, 495--498. DOI: http://dx.doi.org/10.1145/1463160.1463228",
      "doi": ""
    },
    {
      "text": "Elias J MacEwan. 1898. The essentials of argumentation. DC Heath & Company, Boston, USA.",
      "doi": ""
    },
    {
      "text": "Jim D Mackenzie. 1979. Question-begging in non-cumulative systems. Journal of philosophical logic 8, 1 (1979), 117--133.",
      "doi": ""
    },
    {
      "text": "Raquel Mochales and Marie-Francine Moens. 2011. Argumentation mining. Artificial Intelligence and Law 19, 1 (2011), 1--22.",
      "doi": "10.1007/s10506-010-9104-x"
    },
    {
      "text": "David Nichols and Michael Twidale. 2003. The Usability of Open Source Software. First Monday 8, 1 (2003). DOI: http://dx.doi.org/10.5210/fm.v8i1.1018",
      "doi": ""
    },
    {
      "text": "David Nichols and Michael Twidale. 2006. Usability processes in open source projects. Software Process: Improvement and Practice 11, 2 (mar 2006), 149--162. DOI: http://dx.doi.org/10.1002/spip.256",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1993. Usability Engineering. Morgan Kaufmann Publishers Inc, San Francisco, CA, USA.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Mie Nørgaard and Rune T. Høegh. 2008. Evaluating Usability: Using Models of Argumentation to Improve Persuasiveness of Usability Feedback. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS '08). ACM, NY, NY, USA, 212--221. DOI: http://dx.doi.org/10.1145/1394445.1394468",
      "doi": ""
    },
    {
      "text": "James W Pennebaker, Martha E Francis, and Roger J Booth. 2001. Linguistic inquiry and word count: LIWC 2001. Mahway: Lawrence Erlbaum Associates 71, 2001 (2001), 2001.",
      "doi": ""
    },
    {
      "text": "David Martin Powers. 2011. Evaluation: from precision, recall and F-measure to ROC, informedness, markedness and correlation. Journal of Machine Learning Technologies 2, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Mikko Rajanen and Netta Iivari. 2015. Power, Empowerment and Open Source Usability. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3413--3422. DOI: http://dx.doi.org/10.1145/2702123.2702441",
      "doi": "10.1145/2702123.2702441"
    },
    {
      "text": "Sarah Rastkar, Gail C. Murphy, and Gabriel Murray. 2010. Summarizing Software Artifacts: A Case Study of Bug Reports. In Proceedings of the 32Nd ACM/IEEE International Conference on Software Engineering Volume 1 (ICSE '10). ACM, NY, NY, USA, 505--514. DOI: http://dx.doi.org/10.1145/1806799.1806872",
      "doi": "10.1145/1806799.1806872"
    },
    {
      "text": "Jason D. M. Rennie, Lawrence Shih, Jaime Teevan, and David R. Karger. 2003. Tackling the Poor Assumptions of Naive Bayes Text Classifiers. In Proceedings of the Twentieth International Conference on International Conference on Machine Learning (ICML'03). AAAI Press, Washington, DC, USA, 616--623. http://dl.acm.org/citation.cfm?id=3041838.3041916",
      "doi": ""
    },
    {
      "text": "Gerard Salton and Christopher Buckley. 1988. Term-weighting approaches in automatic text retrieval. Information processing & management 24, 5 (1988), 513--523.",
      "doi": ""
    },
    {
      "text": "Christos Sardianos, Ioannis Manousos Katakis, Georgios Petasis, and Vangelis Karkaletsis. 2015. Argument Extraction from News. In Proceedings of the 2nd Workshop on Argumentation Mining. Association for Computational Linguistics, Denver, CO, 56--66. DOI: http://dx.doi.org/10.3115/v1/W15-0508",
      "doi": ""
    },
    {
      "text": "Jeff Sauro and Joseph S. Dumas. 2009. Comparison of Three One-question, Post-task Usability Questionnaires. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1599--1608. DOI: http://dx.doi.org/10.1145/1518701.1518946",
      "doi": "10.1145/1518701.1518946"
    },
    {
      "text": "Fabrizio Sebastiani. 2002. Machine Learning in Automated Text Categorization. ACM Comput. Surv. 34, 1 (March 2002), 1--47. DOI: http://dx.doi.org/10.1145/505282.505283",
      "doi": "10.1145/505282.505283"
    },
    {
      "text": "Christian Stab and Iryna Gurevych. 2014. Annotating Argument Components and Relations in Persuasive Essays. In Proceedings of COLING 2014, the 25th International Conference on Computational Linguistics: Technical Papers. Dublin City University and Association for Computational Linguistics, Dublin, Ireland, 1501--1510. https://www.aclweb.org/anthology/C14--1142",
      "doi": ""
    },
    {
      "text": "Christian Stab and Iryna Gurevych. 2017. Parsing Argumentation Structures in Persuasive Essays. Computational Linguistics 43, 3 (Sept. 2017), 619--659. DOI: http://dx.doi.org/10.1162/COLI_a_00295",
      "doi": ""
    },
    {
      "text": "Yla R Tausczik and James W Pennebaker. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of language and social psychology 29, 1 (2010), 24--54.",
      "doi": ""
    },
    {
      "text": "Michael Terry, Matthew Kay, and Ben Lafreniere. 2010. Perceptions and practices of usability in the free/open source software (FoSS) community. In Proceedings of the 28th international conference on Human factors in computing systems - CHI'10. ACM Press, New York, NY, USA, 999--1008. DOI: http://dx.doi.org/10.1145/1753326.1753476",
      "doi": "10.1145/1753326.1753476"
    },
    {
      "text": "Stephen E. Toulmin. 2003. The Uses of Argument (2 ed.). Cambridge University Press, Cambridge, UK. DOI: http://dx.doi.org/10.1017/CBO9780511840005",
      "doi": ""
    },
    {
      "text": "M.B. Twidale and D.M. Nichols. 2005. Exploring Usability Discussions in Open Source Development. In Proceedings of the 38th Annual Hawaii International Conference on System Sciences. IEEE, Big Island, HI, USA, 198c--198c. DOI: http://dx.doi.org/10.1109/HICSS.2005.266",
      "doi": "10.1109/HICSS.2005.266"
    },
    {
      "text": "Anthony J. Viera and Joanne M. Garrett. 2005. Understanding interobserver agreement: the kappa statistic. Family Medicine 37.5 (2005), 360--363.",
      "doi": ""
    },
    {
      "text": "Yiming Yang. 1999. An Evaluation of Statistical Approaches to Text Categorization. Inf. Retr. 1, 1--2 (May 1999), 69--90. DOI: http://dx.doi.org/10.1023/A:1009982220290",
      "doi": "10.1023/A%3A1009982220290"
    },
    {
      "text": "Tae Yano, Philip Resnik, and Noah A. Smith. 2010. Shedding (a Thousand Points of) Light on Biased Language. In Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon's Mechanical Turk (CSLDAMT '10). Association for Computational Linguistics, Stroudsburg, PA, USA, 152--158. http://dl.acm.org/citation.cfm?id=1866696.1866719",
      "doi": ""
    },
    {
      "text": "Nor Shahida Mohamad Yusop, John Grundy, and Rajesh Vasa. 2017. Reporting Usability Defects: A Systematic Literature Review. IEEE Transactions on Software Engineering 43, 9 (sep 2017), 848--867. DOI: http://dx.doi.org/10.1109/TSE.2016.2638427",
      "doi": ""
    },
    {
      "text": "René Zeelenberg and Diane Pecher. 2015. A method for simultaneously counterbalancing condition order and assignment of stimulus materials to conditions. Behavior Research Methods 47, 1 (01 Mar 2015), 127--133. DOI: http://dx.doi.org/10.3758/s13428-014-0476--9",
      "doi": ""
    }
  ]
}