{
  "doi": "10.1145/3313831.3376553",
  "title": "GRIDS: Interactive Layout Design with Integer Programming",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Grid layouts are used by designers to spatially organise user interfaces when sketching and wireframing. However, their design is largely time consuming manual work. This is challenging due to combinatorial explosion and complex objectives, such as alignment, balance, and expectations regarding positions. This paper proposes a novel optimisation approach for the generation of diverse grid-based layouts. Our mixed integer linear programming (MILP) model offers a rigorous yet efficient method for grid generation that ensures packing, alignment, grouping, and preferential positioning of elements. Further, we present techniques for interactive diversification, enhancement, and completion of grid layouts. These capabilities are demonstrated using GRIDS, a wireframing tool that provides designers with real-time layout suggestions. We report findings from a ratings study (N = 13) and a design study (N = 16), lending evidence for the benefit of computational grid generation during early stages of design.",
  "tags": [
    "creativity support",
    "computational design",
    "grid layouts",
    "design tools",
    "optimisation",
    "mixed-initiative"
  ],
  "authors": [
    {
      "name": "Niraj Ramesh Dayama",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261059",
      "orcid": "missing"
    },
    {
      "name": "Kashyap Todi",
      "institution": "Aalto University & Finnish Center for Artificial Intelligence FCAI, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81498660165/rel-imgonly/todi.jpg",
      "acmid": "81498660165",
      "orcid": "missing"
    },
    {
      "name": "Taru Saarelainen",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528150",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University & Finnish Center for Artificial Intelligence FCAI, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "Greg J. Badros, Alan Borning, and Peter J. Stuckey. 2001. The Cassowary Linear Arithmetic Constraint Solving Algorithm. ACM Trans. Comput.-Hum. Interact. 8, 4 (Dec. 2001), 267--306. DOI: http://dx.doi.org/10.1145/504704.504705",
      "doi": "10.1145/504704.504705"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Timo Kötzing, and Sabrina Hoppe. 2013. MenuOptimizer: Interactive Optimization of Menu Systems. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 331--342. DOI: http://dx.doi.org/10.1145/2501988.2502024",
      "doi": "10.1145/2501988.2502024"
    },
    {
      "text": "Helen Y. Balinsky, Jonathan R. Howes, and Anthony J. Wiley. 2009a. Aesthetically-driven Layout Engine. In Proceedings of the 9th ACM Symposium on Document Engineering (DocEng '09). ACM, NY, NY, USA, 119--122. DOI: http://dx.doi.org/10.1145/1600193.1600219",
      "doi": ""
    },
    {
      "text": "Helen Y. Balinsky, Anthony J. Wiley, and Matthew C. Roberts. 2009b. Aesthetic Measure of Alignment and Regularity. In Proceedings of the 9th ACM Symposium on Document Engineering (DocEng '09). ACM, NY, NY, USA, 56--65. DOI: http://dx.doi.org/10.1145/1600193.1600207",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114--123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Eric A. Bier and Maureen C. Stone. 1986. Snap-dragging. In Proceedings of the 13th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '86). ACM, NY, NY, USA, 233--240. DOI: http://dx.doi.org/10.1145/15922.15912",
      "doi": ""
    },
    {
      "text": "Alan Borning, Richard Lin, and Kim Marriott. 1997. Constraints for the Web. In Proceedings of the Fifth ACM International Conference on Multimedia (MULTIMEDIA '97). ACM, NY, NY, USA, 173--182. DOI: http://dx.doi.org/10.1145/266180.266361",
      "doi": "10.1145/266180.266361"
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Joel Chan, Pao Siangliulue, Denisa Qori McDonald, Ruixue Liu, Reza Moradinezhad, Safa Aman, Erin T Solovey, Krzysztof Z Gajos, and Steven P Dow. 2017. Semantically Far Inspirations Considered Harmful?: Accounting for Cognitive States in Collaborative Ideation. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition. ACM, 93--105.",
      "doi": "10.1145/3059454.3059455"
    },
    {
      "text": "Erin Cherry and Celine Latulipe. 2014. Quantifying the creativity support of digital tools through the creativity support index. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 4 (2014), 21.",
      "doi": "10.1145/2617588"
    },
    {
      "text": "Nicos Christofides and Eleni Hadjiconstantinou. 1995. An exact algorithm for orthogonal 2-D cutting problems using guillotine cuts. European Journal of Operational Research 83, 1 (1995), 21 -- 38. DOI: http://dx.doi.org/https://doi.org/10.1016/0377--2217(93)E0277--5",
      "doi": ""
    },
    {
      "text": "Nigel Cross. 2004. Expertise in design: an overview. Design Studies 25, 5 (2004), 427 -- 441. DOI: http://dx.doi.org/https://doi.org/10.1016/j.destud.2004.06.002 Expertise in Design.",
      "doi": ""
    },
    {
      "text": "Emilie Danna, Mary Fenelon, Zonghao Gu, and Roland Wunderling. 2007. Generating Multiple Solutions for Mixed Integer Programming Problems. In Integer Programming and Combinatorial Optimization, Matteo Fischetti and David P. Williamson (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 280--294.",
      "doi": ""
    },
    {
      "text": "Kees Dorst and Nigel Cross. 2001. Creativity in the design process: co-evolution of problem--solution. Design studies 22, 5 (2001), 425--437.",
      "doi": ""
    },
    {
      "text": "William Drenttel and Jessica Helfand. 1999. Method and system for computer screen layout based on a recombinant geometric modular structure. (Aug. 1999). https://patents.google.com/patent/US7124360B1/en",
      "doi": ""
    },
    {
      "text": "Mathys C. du Plessis and Lynette Barnard. 2008. Incorporating Layout Managers into an Evolutionary Programming Algorithm to Design Graphical User Interfaces. In Proceedings of the 2008 Annual Research Conference of the South African Institute of Computer Scientists and Information Technologists on IT Research in Developing Countries: Riding the Wave of Technology (SAICSIT '08). ACM, NY, NY, USA, 41--47. DOI: http://dx.doi.org/10.1145/1456659.1456665",
      "doi": ""
    },
    {
      "text": "Bjorn N. Freeman-Benson, John Maloney, and Alan Borning. 1990. An Incremental Constraint Solver. Commun. ACM 33, 1 (Jan. 1990), 54--63. DOI: http://dx.doi.org/10.1145/76372.77531",
      "doi": "10.1145/76372.77531"
    },
    {
      "text": "Mathias Frisch, Sebastian Kleinau, Ricardo Langner, and Raimund Dachselt. 2011. Grids & guides: multi-touch layout and alignment tools. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11. ACM Press, Vancouver, BC, Canada, 1615. DOI: http://dx.doi.org/10.1145/1978942.1979177",
      "doi": "10.1145/1978942.1979177"
    },
    {
      "text": "Krzysztof Gajos, David Christianson, Raphael Hoffmann, Tal Shaked, Kiera Henning, Jing Jing Long, and Daniel S Weld. 2005. Fast and robust interface generation for ubiquitous applications. In International Conference on Ubiquitous Computing. Springer, 37--55.",
      "doi": "10.1007/11551201_3"
    },
    {
      "text": "Krzysztof Gajos and Daniel S. Weld. 2004. SUPPLE: Automatically Generating User Interfaces. In Proceedings of the 9th International Conference on Intelligent User Interfaces (IUI '04). ACM, NY, NY, USA, 93--100. DOI: http://dx.doi.org/10.1145/964442.964461",
      "doi": ""
    },
    {
      "text": "Krzysztof Gajos and Daniel S Weld. 2005. Preference elicitation for interface optimization. In Proceedings of the 18th annual ACM symposium on User interface software and technology. ACM, 173--182.",
      "doi": "10.1145/1095034.1095063"
    },
    {
      "text": "Krzysztof Zygmunt Gajos and Daniel S Weld. 2008. Automatically generating personalized user interfaces. Citeseer.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z Gajos, Daniel S Weld, and Jacob O Wobbrock. 2008. Decision-Theoretic User Interface Generation.. In AAAI, Vol. 8. 1532--1536.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z Gajos, Jacob O Wobbrock, and Daniel S Weld. 2007. Automatically generating user interfaces adapted to users' motor and vision capabilities. In Proceedings of the 20th annual ACM symposium on User interface software and technology. ACM, 231--240.",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Krzysztof Z Gajos, Jacob O Wobbrock, and Daniel S Weld. 2008. Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 1257--1266.",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Michael Gleicher. 1992. Briar: A Constraint-based Drawing Program. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 661--662. DOI: http://dx.doi.org/10.1145/142750.143074",
      "doi": "10.1145/142750.143074"
    },
    {
      "text": "Stephen M. Hart and Liu Yi-Hsin. 1995. The application of integer linear programming to the implementation of a graphical user interface: a new rectangular packing problem. Applied Mathematical Modelling 19, 4 (1995), 244 -- 254. DOI: http://dx.doi.org/https://doi.org/10.1016/0307--904X(94)00033--3",
      "doi": ""
    },
    {
      "text": "Hiroshi Hosobe. 2001. A Modular Geometric Constraint Solver for User Interface Applications. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, NY, NY, USA, 91--100. DOI: http://dx.doi.org/10.1145/502348.502362",
      "doi": "10.1145/502348.502362"
    },
    {
      "text": "Scott E. Hudson and Chen-Ning Hsi. 1993. A synergistic approach to specifying simple number independent layouts by example. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '93. ACM Press, Amsterdam, The Netherlands, 285--292. DOI: http://dx.doi.org/10.1145/169059.169221",
      "doi": ""
    },
    {
      "text": "Allen Hurlburt. 1982. The Grid: A Modular System for the Design and Production of Newpapers, Magazines, and Books (1 edition ed.). Wiley, New York; Chichester.",
      "doi": ""
    },
    {
      "text": "Charles Jacobs, Wilmot Li, Evan Schrier, David Bargeron, and David Salesin. 2003. Adaptive Grid-Based Document Layout. ACM Trans. Graph. 22, 3 (July 2003), 838--847. DOI: http://dx.doi.org/10.1145/882262.882353",
      "doi": "10.1145/882262.882353"
    },
    {
      "text": "Andreas Karrenbauer and Antti Oulasvirta. 2014. Improvements to Keyboard Optimization with Integer Programming. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 621--626. DOI: http://dx.doi.org/10.1145/2642918.2647382",
      "doi": "10.1145/2642918.2647382"
    },
    {
      "text": "Janin Koch, Andrés Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI?: Design Ideation with Cooperative Contextual Bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 633.",
      "doi": "10.1145/3290605.3300863"
    },
    {
      "text": "K. Koffka. 2013. Principles Of Gestalt Psychology. Routledge. DOI: http://dx.doi.org/10.4324/9781315009292",
      "doi": ""
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer. 2010. Designing with Interactive Example Galleries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2257--2266. DOI: http://dx.doi.org/10.1145/1753326.1753667",
      "doi": ""
    },
    {
      "text": "Jianan Li, Jimei Yang, Aaron Hertzmann, Jianming Zhang, and Tingfa Xu. 2019. LayoutGAN: Generating Graphic Layouts with Wireframe Discriminators. In 7th International Conference on Learning Representations, ICLR 2019, New Orleans, LA, USA, May 6--9, 2019. https://openreview.net/forum?id=HJxB5sRcFQ",
      "doi": ""
    },
    {
      "text": "Andrea Lodi, Silvano Martello, and Michele Monaci. 2002. Two-dimensional packing problems: A survey. European Journal of Operational Research 141, 2 (2002), 241 -- 252. DOI: http://dx.doi.org/https://doi.org/10.1016/S0377--2217(02)00123--6",
      "doi": ""
    },
    {
      "text": "Simon Lok and Steven Feiner. 2001. A Survey of Automated Layout Techniques for Information Presentations.",
      "doi": ""
    },
    {
      "text": "Simon Lok, Steven Feiner, and Gary Ngai. 2004. Evaluation of Visual Balance for Automated Layout. In Proceedings of the 9th International Conference on Intelligent User Interfaces (IUI '04). ACM, NY, NY, USA, 101--108. DOI: http://dx.doi.org/10.1145/964442.964462",
      "doi": "10.1145/964442.964462"
    },
    {
      "text": "Ellen Lupton. 2014. Thinking with type: A critical guide for designers, writers, editors, & students. Chronicle Books.",
      "doi": ""
    },
    {
      "text": "Patrick J Lynch. 2008. Web style guide. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Silvano Martello and Daniele Vigo. 1998. Exact Solution of the Two-Dimensional Finite Bin Packing Problem. Management Science 44, 3 (1998), 388--399. DOI: http://dx.doi.org/10.1287/mnsc.44.3.388",
      "doi": "10.1287/mnsc.44.3.388"
    },
    {
      "text": "Aliaksei Miniukovich and Antonella De Angeli. 2015. Computation of interface aesthetics. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1163--1172.",
      "doi": "10.1145/2702123.2702575"
    },
    {
      "text": "Josef Müller-Brockmann. 1996. Grid Systems in Graphic Design: A Visual Communication Manual for Graphic Designers, Typographers and Three Dimensional Designers (bilingual edition ed.). Niggli, Zürich.",
      "doi": ""
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2015. DesignScape: Design with Interactive Layout Suggestions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1221--1224. DOI: http://dx.doi.org/10.1145/2702123.2702149",
      "doi": "10.1145/2702123.2702149"
    },
    {
      "text": "Stephen Oney, Brad Myers, and Joel Brandt. 2012. ConstraintJS: Programming Interactive Behaviors for the Web by Integrating Constraints and States. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 229--238. DOI: http://dx.doi.org/10.1145/2380116.2380146",
      "doi": "10.1145/2380116.2380146"
    },
    {
      "text": "Stephen Palmer and Irvin Rock. 1994. Rethinking perceptual organization: The role of uniform connectedness. Psychonomic bulletin & review 1, 1 (1994), 29--55.",
      "doi": ""
    },
    {
      "text": "Seonwook Park, Christoph Gebhardt, Roman Rädle, Anna Maria Feit, Hana Vrzakova, Niraj Ramesh Dayama, Hui-Shyong Yeo, Clemens N. Klokmose, Aaron Quigley, Antti Oulasvirta, and Otmar Hilliges. 2018. AdaM: Adapting Multi-User Interfaces for Collaborative Environments in Real-Time. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 184, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173758",
      "doi": "10.1145/3173574.3173758"
    },
    {
      "text": "Mothersill Philippa and Bove V Michael. 2018. An ontology of computational tools for design activities. In Proceedings of DRS.",
      "doi": ""
    },
    {
      "text": "David Pisinger and Mikkel Sigurd. 2005. The two-dimensional bin packing problem with variable bin sizes and costs. Discrete Optimization 2, 2 (2005), 154 -- 167. DOI: http://dx.doi.org/https://doi.org/10.1016/j.disopt.2005.01.002",
      "doi": "10.1016/j.disopt.2005.01.002"
    },
    {
      "text": "Juan C. Quiroz, Sergiu M. Dascalu, and Sushil J. Louis. 2007. Human Guided Evolution of XUL User Interfaces. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, NY, NY, USA, 2621--2626. DOI: http://dx.doi.org/10.1145/1240866.1241052",
      "doi": ""
    },
    {
      "text": "Andrew Sears. 1995. AIDE: A Step Toward Metric-based Interface Development Tools. In Proceedings of the 8th Annual ACM Symposium on User Interface and Software Technology (UIST '95). ACM, NY, NY, USA, 101--110. DOI: http://dx.doi.org/10.1145/215585.215704",
      "doi": "10.1145/215585.215704"
    },
    {
      "text": "Ivan E. Sutherland. 1963. Sketchpad: A Man-machine Graphical Communication System. In Proceedings of the May 21--23, 1963, Spring Joint Computer Conference (AFIPS '63 (Spring)). ACM, NY, NY, USA, 329--346. DOI: http://dx.doi.org/10.1145/1461551.1461591",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "Kesler Tanner and James Landay. 2019. \"I Know It When I See It\": How Experts and Novices Recognize Good Design. Springer International Publishing, Cham, 249--266. DOI: http://dx.doi.org/10.1007/978--3--319--97082-0_13",
      "doi": ""
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and Explore with a Layout Optimiser. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, NY, NY, USA, 543--555. DOI: http://dx.doi.org/10.1145/2901790.2901817",
      "doi": "10.1145/2901790.2901817"
    },
    {
      "text": "Andrew C. Trapp and Renata A. Konrad. 2015. Finding diverse optima and near-optima to binary integer programs. IIE Transactions 47, 11 (2015), 1300--1312. DOI: http://dx.doi.org/10.1080/0740817X.2015.1019161",
      "doi": ""
    },
    {
      "text": "L. Weitzman and Kent Wittenburg. 1994. Automatic Presentation of Multimedia Documents Using Relational Grammars. In Proceedings of the Second ACM International Conference on Multimedia (MULTIMEDIA '94). ACM, NY, NY, USA, 443--451. DOI: http://dx.doi.org/10.1145/192593.192718",
      "doi": "10.1145/192593.192718"
    },
    {
      "text": "Laurence A Wolsey. 1998. Integer programming. Wiley.",
      "doi": ""
    },
    {
      "text": "Pengfei Xu, Hongbo Fu, Takeo Igarashi, and Chiew-Lan Tai. 2014. Global Beautification of Layouts with Interactive Ambiguity Resolution. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 243--252. DOI: http://dx.doi.org/10.1145/2642918.2647398",
      "doi": "10.1145/2642918.2647398"
    },
    {
      "text": "Clemens Zeidler, Christof Lutteroth, and Gerald Weber. 2012a. Constraint Solving for Beautiful User Interfaces: How Solving Strategies Support Layout Aesthetics. In Proceedings of the 13th International Conference of the NZ Chapter of the ACM's Special Interest Group on Human-Computer Interaction (CHINZ '12). ACM, NY, NY, USA, 72--79. DOI: http://dx.doi.org/10.1145/2379256.2379268",
      "doi": "10.1145/2379256.2379268"
    },
    {
      "text": "Clemens Zeidler, Johannes Müller, Christof Lutteroth, and Gerald Weber. 2012b. Comparing the Usability of Grid-bag and Constraint-based Layouts. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12). ACM, NY, NY, USA, 674--682. DOI: http://dx.doi.org/10.1145/2414536.2414638",
      "doi": "10.1145/2414536.2414638"
    },
    {
      "text": "Xinru Zheng, Xiaotian Qiao, Ying Cao, and Rynson WH Lau. 2019. Content-aware generative modeling of graphic design layouts. ACM Transactions on Graphics (TOG) 38, 4 (2019), 133.",
      "doi": "10.1145/3306346.3322971"
    }
  ]
}