{
  "doi": "10.1145/3313831.3376529",
  "title": "Amazon vs. My Brother: How Users of Shared Smart Speakers Perceive and Cope with Privacy Risks",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "With the rapid adoption of smart speakers in people's homes, there is a corresponding increase in users' privacy and security concerns. In contrast to previous studies of users' concerns about smart speakers' divulging private information to their manufacturers, our study focused on investigating users' concerns with regard to housemates and external entities. We conducted semi-structured interviews with 26 participants living in 21 households. Our results suggest that users often have an inadequate understanding of what data their smart speakers makes available to all users and what is kept private. Although participants expressed different privacy concerns about their housemates and external entities, they adopted similar, yet suboptimal, risk management strategies. We provide recommendations for future speaker design to support more optimal coping with the perceived risks.",
  "tags": [
    "mitigation strategies",
    "shared smart speaker",
    "security and privacy concerns"
  ],
  "authors": [
    {
      "name": "Yue Huang",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527954",
      "orcid": "missing"
    },
    {
      "name": "Borke Obada-Obieh",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659246244",
      "orcid": "missing"
    },
    {
      "name": "Konstantin (Kosta) Beznosov",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81100388506/rel-imgonly/kosta_soups.jpg",
      "acmid": "81100388506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Noura Abdi, Kopo M. Ramokapane, and Jose M. Such. 2019. More Than Smart Speakers: Security and Privacy Perceptions of Smart Home Personal Assistants. In Proceedings of the Fifteenth USENIX Conference on Usable Privacy and Security (SOUPS'19). USENIX Association, Berkeley, CA, USA, 451--466. http://dl.acm.org/citation.cfm?id=3361476.3361510",
      "doi": ""
    },
    {
      "text": "Noura Aleisa and Karen Renaud. 2017. Privacy of the Internet of Things: a systematic literature review. In Proceedings of the 50th Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Abdulaziz Alhadlaq, Jun Tang, Marwan Almaymoni, and Aleksandra Korolova. 2017. Privacy in the Amazon Alexa Skills Ecosystem. In 10th Workshop on Hot Topics in Privacy Enhancing Technologies (HotPETs).",
      "doi": ""
    },
    {
      "text": "Amazon. 2019a. Alexa Skills Kit. (2019). https: //developer.amazon.com/en-US/alexa/alexa-skills-kit.",
      "doi": ""
    },
    {
      "text": "Amazon. 2019b. Require a Voice Code for Purchases with Alexa. (2019). https://www.amazon.ca/gp/help/customer/display.html?nodeId=GAA2RYUEDNT5ZSNK.",
      "doi": ""
    },
    {
      "text": "Amazon. 2019c. Set Up Contacts on Alexa App. (2019). https://www.amazonforum.com/forums/devices/echo-alexa/502091-set-up-contacts-on-alexa- app.",
      "doi": ""
    },
    {
      "text": "Mae Anderson. 2019. Facebook privacy scandal explained. (6 April 2019). https://www.ctvnews.ca/scitech/facebook-privacy-scandal-explained-1.3874533.",
      "doi": ""
    },
    {
      "text": "Joseph Bugeja, Andreas Jacobsson, and Paul Davidsson. 2016. On privacy and security challenges in smart connected homes. In Intelligence and Security Informatics Conference (EISIC), 2016 European. IEEE, Uppsala, Sweden, 172--175.",
      "doi": ""
    },
    {
      "text": "Nicholas Carlini, Pratyush Mishra, Tavish Vaidya, Yuankai Zhang, Micah Sherr, Clay Shields, David Wagner, and Wenchao Zhou. 2016. Hidden Voice Commands. In USENIX Security Symposium. USENIX Association, Berkeley, CA, USA, 513--530.",
      "doi": ""
    },
    {
      "text": "Hyunji Chung and Sangjin Lee. 2018. Intelligent Virtual Assistant knows Your Life. CoRR abs/1803.00466 (2018). http://arxiv.org/abs/1803.00466",
      "doi": ""
    },
    {
      "text": "Jamie Court. 2017. Google, Amazon Patent Filings Reveal Digital Home Assistant Privacy Problems. https://www.consumerwatchdog.org/sites/default/files/ 2017--12/Digital%20Assistants%20and%20Privacy.pdf. (2017). Last accessed: December 22, 2017.",
      "doi": ""
    },
    {
      "text": "Kiran K Edara. 2014. Key word determinations from voice data. (Aug. 5 2014). US Patent 8,798,995.",
      "doi": ""
    },
    {
      "text": "Pardis Emami-Naeini, Sruti Bhagavatula, Hana Habib, Martin Degeling, Lujo Bauer, Lorrie Faith Cranor, and Norman Sadeh. 2017. Privacy Expectations and Preferences in an IoT World. In Proceedings of the Thirteenth USENIX Conference on Usable Privacy and Security (SOUPS '17). USENIX Association, USA, 399--412.",
      "doi": "10.5555/3235924.3235956"
    },
    {
      "text": "Pardis Emami-Naeini, Henry Dixon, Yuvraj Agarwal, and Lorrie Faith Cranor. 2019. Exploring How Privacy and Security Factor into IoT Device Purchase Behavior. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 534, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300764",
      "doi": "10.1145/3290605.3300764"
    },
    {
      "text": "Chris Foxx and Dave Lee. 2016. Apple rejects order to unlock gunman's phone. (17 Feb. 2016). https://www.bbc.com/news/technology-35594245.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, David Hurley, Daniel C. Howe, Helen Nissenbaum, and Edward Felten. 2002. Users' Conceptions of Risks and Harms on the Web: A Comparative Study. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 614--615. DOI: http://dx.doi.org/10.1145/506443.506510",
      "doi": "10.1145/506443.506510"
    },
    {
      "text": "Nathaniel Fruchter and Ilaria Liccardi. 2018. Consumer Attitudes Towards Privacy and Security in Home Assistants. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW050, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188448",
      "doi": ""
    },
    {
      "text": "Chuhan Gao, Varun Chandrasekaran, Kassem Fawaz, and Suman Banerjee. 2018. Traversing the Quagmire That is Privacy in Your Smart Home. In Proceedings of the 2018 Workshop on IoT Security and Privacy (IoT S&P '18). ACM, NY, NY, USA, 22--28. DOI: http://dx.doi.org/10.1145/3229565.3229573",
      "doi": "10.1145/3229565.3229573"
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who's In Control?: Interactions In Multi-User Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 268, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300498",
      "doi": "10.1145/3290605.3300498"
    },
    {
      "text": "Dimitris Geneiatakis, Ioannis Kounelis, Ricardo Neisse, Igor Nai-Fovino, Gary Steri, and Gianmarco Baldini. 2017. Security and privacy issues for an IoT based smart home. In Information and Communication Technology, Electronics and Microelectronics (MIPRO), 2017 40th International Convention on. IEEE, Opatija, Croatia, 1292--1297. DOI: http://dx.doi.org/10.23919/MIPRO.2017.7973622",
      "doi": ""
    },
    {
      "text": "Barney G Glaser. 1978. Advances in the methodology of grounded theory: Theoretical sensitivity. (1978).",
      "doi": ""
    },
    {
      "text": "Stephanie Glen. 2016. Inter-rater Reliability IRR: Definition, Calculation. (2016). https://www.statisticshowto.datasciencecentral.com/ inter-rater-reliability/.",
      "doi": ""
    },
    {
      "text": "Google. 2019a. Allow personal results on your shared Assistant devices. (2019). https://support.google.com/assistant/answer/7684543.",
      "doi": ""
    },
    {
      "text": "Google. 2019b. Link your voice to your Google Assistant device with Voice Match. (2019). https://support.google.com/assistant/answer/9071681?hl.",
      "doi": ""
    },
    {
      "text": "Google. 2019c. Make calls on Google Home. https://goo.gl/uet3m2. (2019).",
      "doi": ""
    },
    {
      "text": "Weijia He, Maximilian Golla, Roshni Padhi, Jordan Ofek, Markus Dürmuth, Earlence Fernandes, and Blase Ur. 2018. Rethinking Access Control and Authentication for the Home Internet of Things (IoT). In Proceedings of the 27th USENIX Conference on Security Symposium (SEC'18). USENIX Association, Berkeley, CA, USA, 255--272.",
      "doi": "10.5555/3277203.3277223"
    },
    {
      "text": "Gary Horcher. 2019. Woman says her Amazon device recorded private conversation, sent it out to random contact. (2019). https://www.kiro7.com/news/local/woman-says-heramazon-device-recorded-private-conversation-sent-itout-to-random-contact/755507974/.",
      "doi": ""
    },
    {
      "text": "Catherine Jackson and Angela Orebaugh. 2018. A study of security and privacy issues associated with the Amazon Echo. International Journal of Internet of Things and Cyber-Assurance 1, 1 (2018), 91--100.",
      "doi": ""
    },
    {
      "text": "David Jonassen and Young Hoan Cho. 2008. Externalizing Mental Models with Mindtools. Springer, Boston, MA, 145--159. DOI: http://dx.doi.org/10.1007/978-0--387--76898--4_7",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My Data Just Goes Everywhere\": User Mental Models of the Internet and Implications for Privacy and Security. In Proceedings of the Eleventh USENIX Conference on Usable Privacy and Security (SOUPS '15). USENIX Association, Berkeley, CA, USA, 39--52. http://dl.acm.org/citation.cfm?id=3235866.3235870",
      "doi": "10.5555/3235866.3235870"
    },
    {
      "text": "Bret Kinsella. 2018. Amazon Alexa Now Has 50,000 Skills Worldwide, works with 20,000 Devices, Used by 3,500 Brands. https://voicebot.ai/2018/09/02/amazon-alexa-now-has-50000-skills-worldwide-is-on-20000-devices-used-by-3500-brands/. (2018). Last accessed: September 2, 2018.",
      "doi": ""
    },
    {
      "text": "Bret Kinsella. 2019. Loup Ventures Says 75% of U.S. Households Will Have Smart Speakers by 2025, Google to Surpass Amazon in Market Share. https://voicebot.ai/2019/06/18/loup-ventures-says-75of-u-s-households-will-have-smart-speakers-by-2025google-to-surpass-amazon-in-market-share/. (2019). Last accessed: June 18, 2019.",
      "doi": ""
    },
    {
      "text": "Bret Kinsella and Ava Mutchler. 2019. Smart Speaker Consumer Adoption Report 2019. https://voicebot.ai/wp-content/uploads/2019/03/smart_speaker_consumer_adoption_report_2019.pdf. (2019). Last accessed: March 20, 2019.",
      "doi": ""
    },
    {
      "text": "Todd Kulesza, Simone Stumpf, Margaret Burnett, and Irwin Kwan. 2012. Tell Me More?: The Effects of Mental Model Soundness on Personalizing an Intelligent Agent. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1--10. DOI: http://dx.doi.org/10.1145/2207676.2207678",
      "doi": "10.1145/2207676.2207678"
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, Are You Listening?: Privacy Perceptions, Concerns and Privacy-seeking Behaviors with Smart Speakers. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 102 (Nov. 2018), 31 pages. DOI: http://dx.doi.org/10.1145/3274371",
      "doi": "10.1145/3274371"
    },
    {
      "text": "Hosub Lee and Alfred Kobsa. 2016. Understanding user privacy in Internet of Things environments. In Internet of Things (WF-IoT), 2016 IEEE 3rd World Forum on. IEEE, Reston, VA, 407--412. DOI: http://dx.doi.org/10.1109/WF-IoT.2016.7845392",
      "doi": ""
    },
    {
      "text": "Hosub Lee and Alfred Kobsa. 2017. Privacy preference modeling and prediction in a simulated campuswide IoT environment. In Pervasive Computing and Communications (PerCom), 2017 IEEE International Conference on. IEEE, Kona, HI, 276--285.",
      "doi": ""
    },
    {
      "text": "X. Lei, G. Tu, A. X. Liu, C. Li, and T. Xie. 2018. The Insecurity of Home Digital Voice Assistants Vulnerabilities, Attacks and Countermeasures. In 2018 IEEE Conference on Communications and Network Security (CNS). 1--9. DOI: http://dx.doi.org/10.1109/CNS.2018.8433167",
      "doi": ""
    },
    {
      "text": "Irene Lopatovska, Katrina Rink, Ian Knight, Kieran Raines, Kevin Cosenza, Harriet Williams, Perachya Sorsche, David Hirsch, Qi Li, and Adrianna Martinez. 2019. Talk to me: Exploring user interactions with the Amazon Alexa. Journal of Librarianship and Information Science 51, 4 (2019), 984--997.",
      "doi": ""
    },
    {
      "text": "Nathan Malkin, Joe Deatrick, Allen Tong, Primal Wijesekera, Serge Egelman, and David Wagner. 2019. Privacy Attitudes of Smart Speaker Users. Proceedings on Privacy Enhancing Technologies 2019, 4 (2019), 250--271.",
      "doi": ""
    },
    {
      "text": "Lydia Manikonda, Aditya Deotale, and Subbarao Kambhampati. 2018. What's Up with Privacy?: User Preferences and Privacy Concerns in Intelligent Personal Assistants. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (AIES '18). ACM, NY, NY, USA, 229--235. DOI: http://dx.doi.org/10.1145/3278721.3278773",
      "doi": "10.1145/3278721.3278773"
    },
    {
      "text": "Benjamin Mayo. 2019. HomePod multi-user voice support and music handoff coming \"later this fall', new Ambient Sounds feature. https://9to5mac.com/2019/09/11/homepod-features-later/. (2019). Last accessed: December 25, 2019.",
      "doi": ""
    },
    {
      "text": "Terence V McCann and Eileen Clark. 2003. Grounded theory in nursing research: Part 1-Methodology. Nurse Researcher (through 2013) 11, 2 (2003), 7.",
      "doi": ""
    },
    {
      "text": "Ellen Nakashima. 2016. Apple vows to resist FBI demand to crack iPhone linked to San Bernardino attacks. (17 Feb. 2016). https://www.washingtonpost.com/world/nationalsecurity/us-wants-apple-to-help-unlock-iphone-usedby-san-bernardino-shooter/2016/02/16/69b903ee-d4d911e5--9823-02b905009f99_story.html.",
      "doi": ""
    },
    {
      "text": "Danny Palmer. 2018. Amazon's Alexa could be tricked into snooping on users, say security researchers. https://www.zdnet.com/article/amazons-alexa-could-betricked-into-snooping-on-users-say-securityresearchers/. (2018). Last accessed: April 25, 2018.",
      "doi": ""
    },
    {
      "text": "Fahimeh Raja, Kirstie Hawkey, and Konstantin Beznosov. 2009. Revealing Hidden Context: Improving Mental Models of Personal Firewall Users. In Proceedings of the 5th Symposium on Usable Privacy and Security (SOUPS '09). ACM, NY, NY, USA, 1:1--1:12. DOI: http://dx.doi.org/10.1145/1572532.1572534",
      "doi": ""
    },
    {
      "text": "Nirupam Roy, Haitham Hassanieh, and Romit Roy Choudhury. 2018a. BackDoor: Sounds that a microphone can record, but that humans can't hear. GetMobile: Mobile Computing and Communications 21, 4 (2018), 25--29.",
      "doi": "10.1145/3191789.3191799"
    },
    {
      "text": "Nirupam Roy, Sheng Shen, Haitham Hassanieh, and Romit Roy Choudhury. 2018b. Inaudible Voice Commands: The Long-Range Attack and Defense. In 15th USENIX Symposium on Networked Systems Design and Implementation (NSDI 18). USENIX Association, Renton, WA, 547--560. https://www.usenix.org/conference/nsdi18/presentation/roy",
      "doi": "10.5555/3307441.3307488"
    },
    {
      "text": "Paul Smith. 2018. Smart speakers and connected appliances the gateway drug as IoT goes mainstream. https://www.afr.com/technology/gadgets/home-entertainment/smart-speakers-and-connected-appliances-the-gatewaydrug-as-iot-goes-mainstream-20180513-h100i3. (2018). Last accessed: May 14, 2018.",
      "doi": ""
    },
    {
      "text": "Greg Sterling. 2019. Alexa devices maintain 70% market share in U.S. according to survey. (9 Aug. 2019). https://marketingland.com/alexa-devices-maintain-70market-share-in-u-s-according-to-survey-265180.",
      "doi": ""
    },
    {
      "text": "Madiha Tabassum, Tomasz Kosi´ nski, and Heather Richter Lipford. 2019. \"I Don'T Own the Data\": End User Perceptions of Smart Home Device Data Practices and Risks. In Proceedings of the Fifteenth USENIX Conference on Usable Privacy and Security (SOUPS'19). USENIX Association, Berkeley, CA, USA, 435--450.",
      "doi": ""
    },
    {
      "text": "Naomi van der Velde. 2019. Innovative Uses of Speech Recognition Today. https://www.globalme.net/blog/newtechnology-in-speech-recognition. (2019). Last accessed: July 08, 2019.",
      "doi": ""
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. 2019. Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 198:1--198:12. DOI: http://dx.doi.org/10.1145/3290605.3300428",
      "doi": ""
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. 2017. End User Security & Privacy Concerns with Smart Homes. In Proceedings of the Thirteenth USENIX Conference on Usable Privacy and Security (SOUPS '17). USENIX Association, Berkeley, CA, USA, 65--80. http://dl.acm.org/citation.cfm?id=3235924.3235931",
      "doi": "10.5555/3235924.3235931"
    },
    {
      "text": "Guoming Zhang, Chen Yan, Xiaoyu Ji, Tianchen Zhang, Taimin Zhang, and Wenyuan Xu. DolphinAttack: Inaudible Voice Commands. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (CCS '17). ACM, NY, NY, USA, 103--117. DOI: http://dx.doi.org/10.1145/3133956.3134052",
      "doi": ""
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. 2018. User Perceptions of Smart Home IoT Privacy. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 200 (Nov. 2018), 20 pages. DOI: http://dx.doi.org/10.1145/3274469",
      "doi": "10.1145/3274469"
    }
  ]
}