{
  "doi": "10.1145/3313831.3376136",
  "title": "AirTouch: 3D-printed Touch-Sensitive Objects Using Pneumatic Sensing",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "3D printing technology can be used to rapidly prototype the look and feel of 3D objects. However, the objects produced are passive. There has been increasing interest in making these objects interactive, yet they often require assembling components or complex calibration. In this paper, we contribute AirTouch, a technique that enables designers to fabricate touch-sensitive objects with minimal assembly and calibration using pneumatic sensing. AirTouch-enabled objects are 3D printed as a single structure using a consumer-level 3D printer. AirTouch uses pre-trained machine learning models to identify interactions with fabricated objects, meaning that there is no calibration required once the object has completed printing. We evaluate our technique using fabricated objects with various geometries and touch sensitive locations, obtaining accuracies of at least 90% with 12 interactive locations.",
  "authors": [
    {
      "name": "Carlos E. Tejada",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99659068879/rel-imgonly/99659068879.jpeg",
      "acmid": "99659068879",
      "orcid": "missing"
    },
    {
      "name": "Raf Ramakers",
      "institution": "Hasselt University, Hasselt, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578156",
      "orcid": "0000-0001-6466-0663"
    },
    {
      "name": "Sebastian Boring",
      "institution": "Aalborg University, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81331489074/rel-imgonly/mobilehci2015.jpg",
      "acmid": "81331489074",
      "orcid": "missing"
    },
    {
      "name": "Daniel Ashbrook",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100147905/rel-imgonly/me-in-bw-new-crop2-small.jpg",
      "acmid": "81100147905",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rafael Ballagas, Sarthak Ghosh, and James A Landay. 2018. The Design Space of 3D Printable Interactivity. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (July 2018), 61--21.",
      "doi": "10.1145/3214264"
    },
    {
      "text": "Daniel Bernoulli. 1738. Hydrodynamica: sive de viribus et motibus fluidorum commentarii. Johannis Reinholdi Dulseckeri.",
      "doi": ""
    },
    {
      "text": "Glenn O Brown. 2002. The History of the Darcy-Weisbach Equation for Pipe Flow Resistance. In Environmental and Water Resources History Sessions at ASCE Civil Engineering Conference and Exposition 2002. American Society of Civil Engineers, Washington, D.C., United States.",
      "doi": ""
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1C filter: a simple speed-based low-pass filter for noisy input in interactive systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 2527.",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Kristian Gohlke, Eva Hornecker, and Wolfgang Sattler. 2016. Pneumatibles: Exploring Soft Robotic Actuators for the Design of User Interfaces with Pneumotactile Feedback. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, New York, New York, USA, 308--315.",
      "doi": "10.1145/2839462.2839489"
    },
    {
      "text": "Timo Götzelmann and Christopher Althaus. 2016. TouchSurfaceModels: Capacitive Sensing Objects through 3D Printers. In Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments. ACM, New York, New York, USA, 22--8.",
      "doi": "10.1145/2910674.2910690"
    },
    {
      "text": "Chris Harrison and Scott E Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. In Proceedings of the 2009 CHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 299--308.",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Liang He, Gierad Laput, Eric Brockmeyer, and Jon E Froehlich. 2017. SqueezaPulse: Adding Interactive Input to Fabricated Objects Using Corrugated Tubes and Air Pulses. In International Conference on Tangible, Embedded, and Embodied Interaction. ACM, New York, New York, USA, 341--350.",
      "doi": "10.1145/3024969.3024976"
    },
    {
      "text": "Jonathan Hook, Peter Wright, Thomas Nappey, Steve Hodges, and Patrick Olivier. 2014. Making 3D printed objects interactive using wireless accelerometers. In CHI '14 Extended Abstracts on Human Factors in Computing Systems. ACM, 1435--1440.",
      "doi": "10.1145/2559206.2581137"
    },
    {
      "text": "Charles Hudin, Sabrina Panëels, and Steven Strachan. 2016. INTACT: Instant Interaction with 3D Printed Objects. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, New York, New York, USA, 2719--2725.",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 3227--3236.",
      "doi": ""
    },
    {
      "text": "Shohei Katakura and Keita Watanabe. 2018. ProtoHole: Prototyping Interactive 3D Printed Objects Using Holes and Acoustic Sensing. In CHI '18: Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, LBW112--6.",
      "doi": "10.1145/3170427.3188471"
    },
    {
      "text": "Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable mouse: volume-adjustable mouse with air-pressure-sensitive input and haptic feedback. In Proceeding of the twenty-sixth annual CHI conference extended abstracts. ACM, New York, New York, USA, 211--224.",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 2161--2170.",
      "doi": ""
    },
    {
      "text": "Dingzeyu Li, David I W Levin, Wojciech Matusik, and Changxi Zheng. 2016. Acoustic voxels: computational optimization of modular acoustic filters. ACM Transactions on Graphics (TOG) 35, 4 (July 2016), 88--12.",
      "doi": "10.1145/2897824.2925960"
    },
    {
      "text": "Roderick Murray-Smith, John Williamson, Stephen Hughes, and Torben Quaade. 2008. Stane: synthesized surfaces for tactile input. In CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. New York, New York, USA, 1299.",
      "doi": "10.1145/1357054.1357257"
    },
    {
      "text": "Kosuke Nakajima, Yuichi Itoh, Yusuke Hayashi, Kazuaki Ikeda, Kazuyuki Fujita, and Takao Onoye. 2013. Emoballoon. In Advances in Computer Entertainment. Springer, Cham, Cham, 182--197.",
      "doi": ""
    },
    {
      "text": "Ryuma Niiyama, Xu Sun, Cynthia Sung, Byoungkwon An, Daniela Rus, and Sangbae Kim. 2015a. Pouch Motors. Soft Robotics 2, 2 (June 2015), 59--70.",
      "doi": ""
    },
    {
      "text": "Ryuma Niiyama, Xu Sun, Lining Yao, Hiroshi Ishii, Daniela Rus, and Sangbae Kim. 2015b. Sticky Actuator. In Proceedings of the 8th International Conference on Tangible, Embedded, and Embodied Interaction. ACM Press, New York, New York, USA, 77--84.",
      "doi": ""
    },
    {
      "text": "Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. 2013. Touch & activate: adding interactivity to existing objects using active acoustic sensing. In UIST '13 Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, New York, New York, USA, 31--40.",
      "doi": "10.1145/2501988.2501989"
    },
    {
      "text": "Jifei Ou, Mélina Skouras, Nikolaos Vlavianos, Felix Heibeck, Chin-Yi Cheng, Jannik Peters, and Hiroshi Ishii. 2016. aeroMorph - Heat-sealing Inflatable Shape-change Materials for Interaction Design. In UIST '16: Proceedings of the 29th annual ACM symposium on User interface software and technology. ACM, New York, New York, USA, 121--132.",
      "doi": "10.1145/2984511.2984520"
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces using Actuators, Sensors and 3D Printing. In CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 409--419.",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Michel Rieutord. 2015. Fluid Dynamics. Springer International Publishing, Cham.",
      "doi": ""
    },
    {
      "text": "Jan Rod, David Collins, Daniel Wessolek, Thavishi Ilandara, Ye Ai, Hyowon Lee, and Suranga Nanayakkara. 2017. UTAP - Unique Topographies for Acoustic Propagation: Designing Algorithmic Waveguides for Sensing in Interactive Malleable Interfaces. In International Conference on Tangible, Embedded, and Embodied Interaction. ACM, New York, New York, USA, 141--152.",
      "doi": ""
    },
    {
      "text": "Harpreet Sareen, Udayan Umapathi, Patrick Shin, Yasuaki Kakehi, Jifei Ou, Hiroshi Ishii, and Pattie Maes. 2017. Printflatables: Printing Human-Scale, Functional and Dynamic Inflatable Objects. ACM, New York, New York, USA.",
      "doi": "10.1145/3025453.3025898"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. ACM, New York, New York, USA.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015a. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In UIST '15: Proceedings of the 28th annual ACM symposium on User interface software and technology. ACM Press, New York, New York, USA, 103--108.",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B Goldman, Gautham Mysore, and Wilmot Li. 2015b. Lamello: Passive Acoustic Sensing for Tangible Input Components. In CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 1277--1280.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A series of tubes: adding interactivity to 3D prints using internal pipes. In UIST '14: Proceedings of the 27th annual ACM symposium on User interface software and technology. New York, New York, USA, 3--12.",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. In UIST '15: Proceedings of the 28th annual ACM symposium on User interface software and technology. ACM Press, New York, New York, USA, 253--258.",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Martin Schmitz, Martin Stitz, Florian Müller, Markus Funk, and Max Mühlhäuser. 2019. ./trilaterate: A Fabrication Pipeline to Design and 3D Print Hover-, Touch-, and Force-Sensitive Objects. In CHI '19: Proceedings of the 37th Annual SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 454--13.",
      "doi": "10.1145/3290605.3300684"
    },
    {
      "text": "Lei Shi, Ross McLachlan, Yuhang Zhao, and Shiri Azenkot. 2016a. Magic Touch: Interacting with 3D Printed Graphics. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, New York, USA, 329--330.",
      "doi": "10.1145/2982142.2982153"
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016b. Tickers and Talker: An Accessible Labeling Toolkit for 3D Printed Models. In CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 4896--4907.",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Ronit Slyper and Jessica Hodgins. 2012. Prototyping robot appearance, movement, and interactions using flexible 3D printing and air pressure sensors. In 2012 RO-MAN: The 21st IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 6--11.",
      "doi": ""
    },
    {
      "text": "Carlos Tejada, Osamu Fujimoto, Zhiyuan Li, and Daniel Ashbrook. 2018. Blowhole: Blowing-Activated Tags for Interactive 3D-Printed Models. In Proceedings of the 44th Graphics Interface Conference GI Proceedings of the nd Graphics Interface Conference. 122--128.",
      "doi": ""
    },
    {
      "text": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E Hudson. 2015. 3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities. In CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 1295--1304.",
      "doi": "10.1145/2702123.2702569"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott E Hudson, and Ivan Poupyrev. 2012. Printed Optics: 3D Printing of Embedded Optical Elements for Interactive Devices. In UIST '12: Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM Press, New York, New York, USA, 589--598.",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Junichi Yamaoka, Ryuma Niiyama, and Yasuaki Kakehi. 2017. BlowFab: Rapid Prototyping for Rigid and Reusable Objects using Inflation of Laser-cut Surfaces. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, New York, New York, USA, 461--469.",
      "doi": "10.1145/3126594.3126624"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In UIST '13 Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, New York, New York, USA, 13--22.",
      "doi": "10.1145/2501988.2502037"
    }
  ]
}