{
  "doi": "10.1145/3313831.3376589",
  "title": "Optimizing User Interface Layouts via Gradient Descent",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Automating parts of the user interface (UI) design process has been a longstanding challenge. We present an automated technique for optimizing the layouts of mobile UIs. Our method uses gradient descent on a neural network model of task performance with respect to the model's inputs to make layout modifications that result in improved predicted error rates and task completion times. We start by extending prior work on neural network based performance prediction to 2-dimensional mobile UIs with an expanded interaction space. We then apply our method to two UIs, including one that the model had not been trained on, to discover layout alternatives with significantly improved predicted performance. Finally, we confirm these predictions experimentally, showing improvements up to 9.2 percent in the optimized layouts. This demonstrates the algorithm's efficacy in improving the task performance of a layout, and its ability to generalize and improve layouts of new interfaces.",
  "tags": [
    "performance modeling",
    "gradient descent",
    "data-driven design",
    "lstm",
    "optimization",
    "mobile interfaces",
    "deep learning"
  ],
  "authors": [
    {
      "name": "Peitong Duan",
      "institution": "Intel AI, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260550",
      "orcid": "missing"
    },
    {
      "name": "Casimir Wierzynski",
      "institution": "Intel AI, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367426",
      "orcid": "missing"
    },
    {
      "name": "Lama Nachman",
      "institution": "Intel Labs, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100309201",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2019. Android vs iPhone mobile owners in the U.S. 2013, by age. (2019). https://www.statista.com/statistics/271228/ android-vs-iphone-mobile-owners-age/",
      "doi": ""
    },
    {
      "text": "Khalid Alemerien and Kenneth Magel. GUIEvaluator: A Metric-tool for Evaluating the Complexity of Graphical User Interfaces.",
      "doi": ""
    },
    {
      "text": "Leena Arhippainen and Marika Tähti. 2003. Empirical evaluation of user experience in two adaptive mobile application prototypes. In MUM 2003. Proceedings of the 2nd International Conference on Mobile and Ubiquitous Multimedia. Linköping University Electronic Press, 27--34.",
      "doi": ""
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Duncan P Brumby, and Andrew Howes. 2014. Model of visual search and selection time in linear menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3865--3874.",
      "doi": "10.1145/2556288.2557093"
    },
    {
      "text": "Helen Balinsky. 2006. Evaluating interface aesthetics: measure of symmetry. In Digital Publishing, Vol. 6076. International Society for Optics and Photonics, 607608.",
      "doi": ""
    },
    {
      "text": "Helen Y Balinsky, Anthony J Wiley, and Matthew C Roberts. 2009. Aesthetic measure of alignment and regularity. In Proceedings of the 9th ACM symposium on Document engineering. ACM, 56--65.",
      "doi": "10.1145/1600193.1600207"
    },
    {
      "text": "Rachel Eardley, Anne Roudaut, Steve Gill, and Stephen J Thompson. 2017. Understanding Grip Shifts: How Form Factors Impact Hand Movements on Mobile Phones. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4680--4691.",
      "doi": "10.1145/3025453.3025835"
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "Krzysztof Gajos and Daniel S Weld. 2004. SUPPLE: automatically generating user interfaces. In Proceedings of the 9th international conference on Intelligent user interfaces. ACM, 93--100.",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Todd M Gureckis, Jay Martin, John McDonnell, Alexander S Rich, Doug Markant, Anna Coenen, David Halpern, Jessica B Hamrick, and Patricia Chan. 2016. psiTurk: An open-source framework for conducting replicable behavioral experiments online. Behavior research methods 48, 3 (2016), 829--842.",
      "doi": ""
    },
    {
      "text": "Curtis Hardyck and Lewis F Petrinovich. 1977. Left-handedness. Psychological bulletin 84, 3 (1977), 385.",
      "doi": ""
    },
    {
      "text": "Apple Inc. 2019. Adaptivity and Layout. (2019). https://developer.apple.com/design/ human-interface-guidelines/ios/visual-design/ adaptivity-and-layout/",
      "doi": ""
    },
    {
      "text": "Mohammad M Khajah, Brett D Roads, Robert V Lindsey, Yun-En Liu, and Michael C Mozer. 2016. Designing engaging games using bayesian optimization. In Proceedings of the 2016 chi conference on human factors in computing systems. ACM, 5571--5582.",
      "doi": "10.1145/2858036.2858253"
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014).",
      "doi": ""
    },
    {
      "text": "Christophe Leys, Christophe Ley, Olivier Klein, Philippe Bernard, and Laurent Licata. 2013. Detecting outliers: Do not use standard deviation around the mean, use absolute deviation around the median. Journal of Experimental Social Psychology 49, 4 (2013), 764--766.",
      "doi": ""
    },
    {
      "text": "Yang Li, Samy Bengio, and Gilles Bailly. 2018. Predicting human performance in vertical menu selection using deep learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 29.",
      "doi": "10.1145/3173574.3173603"
    },
    {
      "text": "J Derek Lomas, Jodi Forlizzi, Nikhil Poonwala, Nirmal Patel, Sharan Shodhan, Kishan Patel, Ken Koedinger, and Emma Brunskill. 2016. Interface design optimization as a multi-armed bandit problem. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4142--4153.",
      "doi": "10.1145/2858036.2858425"
    },
    {
      "text": "Risto Näsänen, Helena Ojanpää, and Ilpo Kojo. 2001. Effect of stimulus contrast on performance and eye movements in visual search. Vision Research 41, 14 (2001), 1817--1824.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1995. 10 usability heuristics for user interface design. Nielsen Norman Group 1, 1 (1995).",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 2001. Usability Metrics. (Jan 2001). https://www.nngroup.com/articles/usability-metrics/",
      "doi": ""
    },
    {
      "text": "Adam Paszke, Sam Gross, Soumith Chintala, and Gregory Chanan. 2017. Pytorch: Tensors and dynamic neural networks in python with strong gpu acceleration. PyTorch: Tensors and dynamic neural networks in Python with strong GPU acceleration 6 (2017).",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer and Yang Li. 2018. Analysis and Modeling of Grid Performance on Touchscreen Mobile Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 288.",
      "doi": "10.1145/3173574.3173862"
    },
    {
      "text": "Sergey Polyuk. 2019. A Guide to Interface Design for Older Adults. (Jun 2019). https://www.toptal.com/ designers/ui/ui-design-for-older-adults",
      "doi": ""
    },
    {
      "text": "Juan C Quiroz, Sushil J Louis, Anil Shankar, and Sergiu M Dascalu. 2007. Interactive genetic algorithms for user interface design. In 2007 IEEE congress on evolutionary computation. IEEE, 1366--1373.",
      "doi": ""
    },
    {
      "text": "Andrew L Sears. 1995. AIDE: A step toward metric-based interface development tools. In Proceedings of the 1995 8th Annual Symposium on User Interface Software and Technology, UIST'95. ACM, 101--110.",
      "doi": "10.1145/215585.215704"
    },
    {
      "text": "Amanda Swearngin and Yang Li. 2019. Modeling Mobile Interface Tappability Using Crowdsourcing and Deep Learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 75.",
      "doi": "10.1145/3290605.3300305"
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and explore with a layout optimiser. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 543--555.",
      "doi": "10.1145/2901790.2901817"
    }
  ]
}