{
  "doi": "10.1145/3313831.3376409",
  "title": "Levitation Simulator: Prototyping Ultrasonic Levitation Interfaces in Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present the Levitation Simulator, a system that enables researchers and designers to iteratively develop and prototype levitation interface ideas in Virtual Reality. This includes user tests and formal experiments. We derive a model of the movement of a levitating particle in such an interface. Based on this, we develop an interactive simulation of the levitation interface in VR, which exhibits the dynamical properties of the real interface. The results of a Fitts' Law pointing study show that the Levitation Simulator enables performance, comparable to the real prototype. We developed the first two interactive games, dedicated for levitation interfaces: LeviShooter and BeadBounce, in the Levitation Simulator, and then implemented them on the real interface. Our results indicate that participants experienced similar levels of user engagement when playing the games, in the two environments. We share our Levitation Simulator as Open Source, thereby democratizing levitation research, without the need for a levitation apparatus.",
  "tags": [
    "modeling",
    "ultrasonic levitation",
    "simulation",
    "vr",
    "virtual prototyping"
  ],
  "authors": [
    {
      "name": "Viktorija Paneva",
      "institution": "University of Bayreuth, Bayreuth, Germany",
      "img": "/do/10.1145/contrib-99659323476/rel-imgonly/img_1279_small.jpg",
      "acmid": "99659323476",
      "orcid": "missing"
    },
    {
      "name": "Myroslav Bachynskyi",
      "institution": "University of Bayreuth, Bayreuth, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558398056",
      "orcid": "missing"
    },
    {
      "name": "Jörg Müller",
      "institution": "University of Bayreuth, Bayreuth, Germany",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Antonino Gomes de Sá and Gabriel Zachmann. 1999. Virtual reality as a tool for verification of assembly and maintenance processes. Computers & Graphics 23, 3 (1999), 389--403. DOI: http://dx.doi.org/https://doi.org/10.1016/S0097--8493(99)00047--3",
      "doi": ""
    },
    {
      "text": "Myroslav Bachynskyi, Viktorija Paneva, and Jörg Müller. 2018. LeviCursor: Dexterous Interaction with a Levitating Object. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (ISS '18). ACM, NY, NY, USA, 253--262. DOI: http://dx.doi.org/10.1145/3279778.3279802",
      "doi": "10.1145/3279778.3279802"
    },
    {
      "text": "Leif P. Berg and Judy M. Vance. 2017. Industry use of virtual reality in product design and manufacturing: a survey. Virtual Reality 21, 1 (01 Mar 2017), 1--17. DOI: http://dx.doi.org/10.1007/s10055-016-0293--9",
      "doi": ""
    },
    {
      "text": "Henrik Bruus. 2012. Acoustofluidics 7: The Acoustic Radiation Force on Small Particles. Lab on a Chip 12, 6 (2012), 1014--1021.",
      "doi": ""
    },
    {
      "text": "Euan Freeman, Asier Marzo, Praxitelis B. Kourtelos, Julie R. Williamson, and Stephen Brewster. 2019. Enhancing Physical Objects with Actuated Levitating Particles. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (PerDis '19). ACM, NY, NY, USA, Article 2, 7 pages. DOI: http://dx.doi.org/10.1145/3321335.3324939",
      "doi": "10.1145/3321335.3324939"
    },
    {
      "text": "Euan Freeman, Julie Williamson, Sriram Subramanian, and Stephen Brewster. 2018. Point-and-Shake: Selecting from Levitating Object Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18). ACM, NY, NY, USA, Article 18, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3173592",
      "doi": "10.1145/3173574.3173592"
    },
    {
      "text": "Tatsuki Fushimi, Asier Marzo, Bruce W. Drinkwater, and Thomas L. Hill. 2019. Acoustophoretic volumetric displays using a fast-moving levitated particle. Applied Physics Letters 115, 6 (2019), 064101. DOI: http://dx.doi.org/10.1063/1.5113467",
      "doi": ""
    },
    {
      "text": "Seth Copen Goldstein, Jason Campbell, and Todd C. Mowry. 2005. Programmable matter. Computer 38, 6 (May 2005), 99--101. DOI: http://dx.doi.org/10.1109/MC.2005.198",
      "doi": "10.1109/MC.2005.198"
    },
    {
      "text": "Lev Petrovich Gor'kov. 1962. On the forces acting on a small particle placed int an acoustic field in an ideal liquid. Sov. Phys. Dokl. 6, 9 (1962), 773.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2004. Pointing at Trivariate Targets in 3D Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 447--454. DOI: http://dx.doi.org/10.1145/985692.985749",
      "doi": "10.1145/985692.985749"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139 -- 183. DOI: http://dx.doi.org/https://doi.org/10.1016/S0166--4115(08)62386--9",
      "doi": ""
    },
    {
      "text": "Ryuji Hirayama, Diego Martinez Plasencia, Nobuyuki Masuda, and Sriram Subramanian. 2019. A volumetric display for visual, tactile and audio presentation using acoustic trapping. Nature 575, 7782 (2019), 320--323.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical Atoms: Beyond Tangible Bits, Toward Transformable Materials. interactions 19, 1 (Jan. 2012), 38--51. DOI: http://dx.doi.org/10.1145/2065327.2065337",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Asier Marzo, Adrian Barnes, and Bruce W. Drinkwater. 2017. TinyLev: A multi-emitter single-axis acoustic levitator. Review of Scientific Instruments 88, 8 (2017), 085105. DOI: http://dx.doi.org/10.1063/1.4989995",
      "doi": ""
    },
    {
      "text": "Asier Marzo, Steven Kockaya, Euan Freeman, and Julie Williamson. 2019. Tangible Interactions with Acoustic Levitation. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA'19). ACM, NY, NY, USA, Article INT005, 4 pages. DOI: http://dx.doi.org/10.1145/3290607.3313265",
      "doi": ""
    },
    {
      "text": "Asier Marzo, Sue Ann Seah, Bruce W. Drinkwater, Deepak Ranjan Sahoo, Benjamin Long, and Sriram Subramanian. 2015. Holographic Acoustic Elements for Manipulation of Levitated Objects. Nature communications 6 (Oct. 2015), 8661. http://dx.doi.org/10.1038/ncomms9661",
      "doi": ""
    },
    {
      "text": "Rafael Morales, Asier Marzo, Sriram Subramanian, and Diego Martínez. 2019. LeviProps: Animating Levitated Optimized Fabric Structures Using Holographic Acoustic Tweezers. In Proceedings of the 32Nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, NY, NY, USA, 651--661. DOI: http://dx.doi.org/10.1145/3332165.3347882",
      "doi": "10.1145/3332165.3347882"
    },
    {
      "text": "Heather L. O'Brien, Paul Cairns, and Mark Hall. 2018. A practical approach to measuring user engagement with the refined user engagement scale (UES) and new UES short form. International Journal of Human-Computer Studies 112 (2018), 28--39. DOI: http://dx.doi.org/https://doi.org/10.1016/j.ijhcs.2018.01.004",
      "doi": ""
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshi, and Jun Rekimoto. 2014. Pixie Dust: Graphics Generated by Levitated and Animated Objects in Computational Acoustic-potential Field. ACM Trans. Graph. 33, 4, Article 85 (July 2014), 13 pages. DOI: http://dx.doi.org/10.1145/2601097.2601118",
      "doi": "10.1145/2601097.2601118"
    },
    {
      "text": "Themis Omirou, Marzo Asier Perez, Sriram Subramanian, and Anne Roudaut. 2016. Floating charts: Data plotting using free-floating acoustically levitated representations. In 2016 IEEE Symposium on 3D User Interfaces (3DUI). 187--190. DOI: http://dx.doi.org/10.1109/3DUI.2016.7460051",
      "doi": ""
    },
    {
      "text": "Deepak Ranjan Sahoo, Takuto Nakamura, Asier Marzo, Themis Omirou, Michihiro Asakawa, and Sriram Subramanian. 2016. JOLED: A Mid-air Display Based on Electrostatic Rotation of Levitated Janus Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 437--448. DOI: http://dx.doi.org/10.1145/2984511.2984549",
      "doi": "10.1145/2984511.2984549"
    },
    {
      "text": "Abhishek Seth, Judy M. Vance, and James H. Oliver. 2011. Virtual reality for assembly methods prototyping: a review. Virtual Reality 15, 1 (01 Mar 2011), 5--20. DOI: http://dx.doi.org/10.1007/s10055-009-0153-y",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies 61, 6 (2004), 751--789. DOI: http://dx.doi.org/https://doi.org/10.1016/j.ijhcs.2004.09.001 Fitts' law 50 years later: applications and contributions from human-computer interaction.",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Susanna Aromaa and Kaisa Väänänen. 2016. Suitability of virtual prototypes to support human factors/ergonomics evaluation during the design. Applied Ergonomics 56 (2016), 11--18. DOI: http://dx.doi.org/https://doi.org/10.1016/j.apergo.2016.02.015",
      "doi": ""
    }
  ]
}