{
  "doi": "10.1145/3313831.3376858",
  "title": "Interspecies Interactions Mediated by Technology: An Avian Case Study at the Zoo",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Enrichment is a methodology for caregivers to offer zoo animals improved psychological and physiological well-being. Although many species rely on auditory senses, sonic enrichment is rarely implemented. Zoo soundscapes are dominated by human-generated noises and do not respond meaningfully to animals' behavior. Designing interactive sonic enrichment systems for animals presents unique ergonomic, ethical, and agency-related challenges. We present a case study of such design. We deployed two novel interventions at the San Diego Zoo to allow Sampson, a music-savvy hyacinth macaw, to gain control over his sonic environment. Our results suggest that (1) the bird uses, understands, and benefits from the system, and (2) visitors play a major role in Sampson's engagement with this technology. With his new agency, the bird seemingly gains more control over his interactions with the public, creating an interspecies experience mediated by technology. The resulting animal-human-computer interaction may inform mediated interspecies experiences in the future.",
  "authors": [
    {
      "name": "Rébecca Kleinberger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548539156",
      "orcid": "0000-0002-5667-5598"
    },
    {
      "name": "Anne H. K. Harrington",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529377",
      "orcid": "missing"
    },
    {
      "name": "Lydia Yu",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529740",
      "orcid": "missing"
    },
    {
      "name": "Akito van Troyer",
      "institution": "Berklee College of Music, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486643251",
      "orcid": "0000-0002-1953-3320"
    },
    {
      "name": "David Su",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529084",
      "orcid": "missing"
    },
    {
      "name": "Janet M. Baker",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473922",
      "orcid": "missing"
    },
    {
      "name": "Gabriel Miller",
      "institution": "San Diego Zoo Global, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528302",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Birding Association. 2012. Code of ethics. http://www.aba.com",
      "doi": ""
    },
    {
      "text": "L Birke. 2002. Effects of browse, human visitors and noise on the behaviour of captive orang utans.",
      "doi": ""
    },
    {
      "text": "L Brent and others. 1996. Physiological & behavioral effects of radio music on singly housed baboons.",
      "doi": ""
    },
    {
      "text": "Richard W Byrne and others. 2010. Primate social cognition: uniquely primate, uniquely social, or just unique?",
      "doi": ""
    },
    {
      "text": "Malinda Carpenter and Josep Call. 2009. Comparing the imitative skills of children and nonhuman apes.",
      "doi": ""
    },
    {
      "text": "Marcus Carter and others. 2015. Naturalism and ACI: augmenting zoo enclosures with digital technology. In ACE.",
      "doi": ""
    },
    {
      "text": "AS Chamove. 1989. Cage design reduces emotionality in mice.",
      "doi": ""
    },
    {
      "text": "Julia Chosy and others. 2014. Behavioral and physiological responses in felids to exhibit construction.",
      "doi": ""
    },
    {
      "text": "Anna M Claxton. 2011. The potential of the human--animal relationship as an environmental enrichment for the welfare of zoo-housed animals.",
      "doi": ""
    },
    {
      "text": "Andrea W Clay and others. 2011. The use of technology to enhance zoological parks.",
      "doi": ""
    },
    {
      "text": "Peter Cook and others. 2013. A California sea lion can keep the beat: motor entrainment to rhythmic auditory stimuli in a non vocal mimic.",
      "doi": ""
    },
    {
      "text": "Shelley Cook. 1995. Interaction sequences between chimpanzees and human visitors at the zoo.",
      "doi": ""
    },
    {
      "text": "Alexandra Farrand. 2007. The effect of zoo visitors on the behaviour and welfare of zoo mammals.",
      "doi": ""
    },
    {
      "text": "Fiona French and others. 2018a. High tech cognitive and acoustic enrichment for captive elephants.",
      "doi": ""
    },
    {
      "text": "Fiona French and others. 2018b. SoundJam: acoustic design for auditory enrichment.",
      "doi": ""
    },
    {
      "text": "Olivier Friard and others. 2016. BORIS: a free, versatile open-source event-logging software for video/audio coding and live observations.",
      "doi": ""
    },
    {
      "text": "Reinhard Gupfinger and others. 2017. Sonic Experiments with Grey Parrots: A Report on Testing the Auditory Skills and Musical Preferences of Grey Parrots in Captivity.",
      "doi": ""
    },
    {
      "text": "Reinhard Gupfinger and others. 2018. Animals make music: A look at non-human musical expression.",
      "doi": ""
    },
    {
      "text": "G Gvaryahu and others. 1989. Filial imprinting, environmental enrichment, and music application effects on behavior and performance of meat strain chicks.",
      "doi": ""
    },
    {
      "text": "Ilyena Hirskyj-Douglas and others. 2016. Where HCI meets ACI. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM.",
      "doi": ""
    },
    {
      "text": "Marisa Hoeschele and others. 2015. Searching for the origins of musicality across species.",
      "doi": ""
    },
    {
      "text": "Geoff Hosey. 2008. A preliminary model of human--animal relationships in the zoo, 105--127.",
      "doi": ""
    },
    {
      "text": "Geoff Hosey and others. 2015. Are we ignoring neutral and negative human--animal relationships in zoos?",
      "doi": ""
    },
    {
      "text": "Julia M Hoy and others. 2010. Thirty years later: Enrichment practices for captive mammals.",
      "doi": ""
    },
    {
      "text": "RB Jones. 2004. EnvironmentaI enrichment: the need for practicaI strategies to improve pouItry weIfare, 215.",
      "doi": ""
    },
    {
      "text": "Caitlin R Kight and John P Swaddle. 2011. How and why environmental noise impacts animals: an integrative, mechanistic review.",
      "doi": ""
    },
    {
      "text": "Nicky NE Kim-McCormack and others. 2016. Is interactive technology a relevant and effective enrichment for captive great apes?",
      "doi": ""
    },
    {
      "text": "Vernon N Kisling. 2000. Zoo and aquarium history: Ancient animal collections to zoological gardens. CRC.",
      "doi": ""
    },
    {
      "text": "Donghyeon Ko and others. 2018. BubbleTalk: Enriching Experience with Fish by Supporting Human Behavior. In DIS'18. ACM.",
      "doi": ""
    },
    {
      "text": "Megan J Larsen and others. 2014. Number of nearby visitors and noise level affect vigilance in captive koalas.",
      "doi": ""
    },
    {
      "text": "Ping Lee and others. 2006. A mobile pet wearable computer and mixed reality system for human--poultry interaction through the internet.",
      "doi": ""
    },
    {
      "text": "Andrew U Luescher. 2006. Manual of parrot behavior.",
      "doi": ""
    },
    {
      "text": "Mark Nielsen. 2009. The imitative behaviour of children and chimpanzees: A window on the transmission of cultural traditions.",
      "doi": ""
    },
    {
      "text": "AJ Nimon and others. 1992. Cross-species interaction and communication: a study method applied to captive siamang and long-billed corella contacts with humans.",
      "doi": ""
    },
    {
      "text": "Frank Noz and Jinsoo An. 2011. Cat cat revolution: an interspecies gaming experience. In CHI'11. ACM.",
      "doi": "10.1145/1978942.1979331"
    },
    {
      "text": "C Owen. 2004. Do visitors affect the Asian short-clawed otter in a captive environment. In Proceedings of the 6th Annual Symposium on Zoo Research-BIAZA. 202--211.",
      "doi": ""
    },
    {
      "text": "Aniruddh D Patel and others. 2009. Experimental evidence for synchronization to a musical beat in a nonhuman animal.",
      "doi": ""
    },
    {
      "text": "Irene M Pepperberg. 2002. Cognitive and communicative abilities of grey parrots.",
      "doi": ""
    },
    {
      "text": "Irene M Pepperberg. 2009. The Alex studies: cognitive and communicative abilities of grey parrots.",
      "doi": ""
    },
    {
      "text": "Irene M Pepperberg and Mary A McLaughlin. 1996. Effect of avian--human joint attention in allospecific vocal learning by grey parrots (Psittacus erithacus).",
      "doi": ""
    },
    {
      "text": "Tomas Persson and others. 2018. Spontaneous cross-species imitation in interactions between chimpanzees and zoo visitors.",
      "doi": ""
    },
    {
      "text": "María Pifarré and others. 2012. The effect of zoo visitors on the behaviour and faecal cortisol of the Mexican wolf.",
      "doi": ""
    },
    {
      "text": "Patricia Pons and others. 2016. Sound to your objects: a novel design approach to evaluate orangutans' interest in sound-based stimuli. In ACI'16. ACM.",
      "doi": ""
    },
    {
      "text": "Sandra Quadros and others. 2014. Zoo visitor effect on mammal behaviour: Does noise matter?",
      "doi": ""
    },
    {
      "text": "Nikki S Rickard and others. 2005. The effect of music on cognitive performance: Insight from neurobiological and animal studies.",
      "doi": ""
    },
    {
      "text": "Sarah Elizabeth Ritvo. 2013. Music preference and discrimination in three Sumatran orangutans.",
      "doi": ""
    },
    {
      "text": "Becky Scheel. 2018. Designing digital enrichment for orangutans. In ACI'18. ACM.",
      "doi": "10.1145/3295598.3295603"
    },
    {
      "text": "David Sibley. 2011. The Proper Use of Playback in Birding. https://www.sibleyguides.com/2011/04/the-proper-use-of-playback-in-birding/",
      "doi": ""
    },
    {
      "text": "Marek ?pinka, Françoise Wemelsfelder, and others. 2011. Environmental challenge and animal agency, 27--43.",
      "doi": ""
    },
    {
      "text": "Stephanie Spinner. 2012. Alex the parrot: no ordinary bird. Knopf Books for Young Readers.",
      "doi": ""
    },
    {
      "text": "Austin Stewart. 2015. Second Livestock. http://www.theaustinstewart.com/secondlivestock.html",
      "doi": ""
    },
    {
      "text": "Thomas Suddendorf and Andrew Whiten. 2001. Mental evolution and development: Evidence for secondary representation in children, great apes, and other animals.",
      "doi": ""
    },
    {
      "text": "Dietmar Todt. 1975. Social learning of vocal patterns and modes of their application in grey parrots.",
      "doi": ""
    },
    {
      "text": "K Uetake and others. 1997. Effect of music on voluntary approach of dairy cows to an automatic milking system.",
      "doi": ""
    },
    {
      "text": "Elaine N Videan and others. 2007. Effects of two types and two genre of music on social behavior in captive chimpanzees (Pan troglodytes).",
      "doi": ""
    },
    {
      "text": "Lisa J Wallis and others. 2017. Utilising dog-computer interactions to provide mental stimulation in dogs especially during ageing. In ACI'17. ACM.",
      "doi": ""
    },
    {
      "text": "Samantha J Ward and Vicky Melfi. 2015. Keeper-animal interactions: Differences between the behaviour of zoo animals affect stockmanship.",
      "doi": ""
    },
    {
      "text": "Sarah Webber and others. 2016. HCI Goes to the Zoo:. In CHI'16.",
      "doi": ""
    },
    {
      "text": "Sarah Webber and others. 2017. Kinecting with orangutans: Zoo visitors' empathetic responses to animals? use of interactive technology. In CHI'17.",
      "doi": ""
    },
    {
      "text": "Deborah L Wells. 2009. The effects of animals on human health and well-being, 523--543.",
      "doi": ""
    },
    {
      "text": "Deborah L Wells and Rosie M Irwin. 2008. Auditory stimulation as enrichment for zoo-housed Asian elephants (Elephas maximus).",
      "doi": ""
    },
    {
      "text": "Michelle Westerlaken and Stefano Gualeni. 2014. Felino: The philosophical practice of making an interspecies videogame. In The Philosophy of Computer Games.",
      "doi": ""
    },
    {
      "text": "Isabelle Williams and others. 2017. The effect of auditory enrichment, rearing method and social environment on the behavior of zoo-housed psittacines (Aves: Psittaciformes); implications for welfare.",
      "doi": ""
    },
    {
      "text": "Robert Yanofsky and others. 1978. Changes in general behavior of two mandrills (Papio sphinx) concomitant with behavioral testing in the zoo.",
      "doi": ""
    }
  ]
}