{
  "doi": "10.1145/3313831.3376739",
  "title": "Novice-AI Music Co-Creation via AI-Steering Tools for Deep Generative Models",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "While generative deep neural networks (DNNs) have demonstrated their capacity for creating novel musical compositions, less attention has been paid to the challenges and potential of co-creating with these musical AIs, especially for novices. In a needfinding study with a widely used, interactive musical AI, we found that the AI can overwhelm users with the amount of musical content it generates, and frustrate them with its non-deterministic output. To better match co-creation needs, we developed AI-steering tools, consisting of Voice Lanes that restrict content generation to particular voices; Example-Based Sliders to control the similarity of generated content to an existing example; Semantic Sliders to nudge music generation in high-level directions (happy/sad, conventional/surprising); and Multiple Alternatives of generated content to audition and choose from. In a summative study (N=21), we discovered the tools not only increased users' trust, control, comprehension, and sense of collaboration with the AI, but also contributed to a greater sense of self-efficacy and ownership of the composition relative to the AI.",
  "authors": [
    {
      "name": "Ryan Louie",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-99659476551/rel-imgonly/ryanlouie.png",
      "acmid": "99659476551",
      "orcid": "missing"
    },
    {
      "name": "Andy Coenen",
      "institution": "Google Research, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527355",
      "orcid": "missing"
    },
    {
      "name": "Cheng Zhi Huang",
      "institution": "Independent Researcher, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529764",
      "orcid": "missing"
    },
    {
      "name": "Michael Terry",
      "institution": "Google Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100295906",
      "orcid": "0000-0003-1941-939X"
    },
    {
      "name": "Carrie J. Cai",
      "institution": "Google Research, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349280",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 3, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Kristina Andersen and Peter Knees. 2016. The Dial: Exploring Computational Strangeness. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). Association for Computing Machinery, New York, NY, USA, 1352--1358. DOI: http://dx.doi.org/10.1145/2851581.2892439",
      "doi": "10.1145/2851581.2892439"
    },
    {
      "text": "Yoav Benjamini and Yosef Hochberg. 1995. Controlling the False Discovery Rate: a Practical and Powerful Approach to Multiple Testing. Journal of the Royal Statistical Society: Series B (Methodological) 57, 1 (1995), 289--300.",
      "doi": ""
    },
    {
      "text": "Nicolas Boulanger-Lewandowski, Yoshua Bengio, and Pascal Vincent. 2012. Modeling Temporal Dependencies in High-Dimensional Sequences: Application to Polyphonic Music Generation and Transcription. International Conference on Machine Learning (2012).",
      "doi": "10.5555/3042573.3042813"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Carrie J. Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2019. \"Hello AI\": Uncovering the Onboarding Needs of Medical Practitioners for Human-AI Collaborative Decision-Making. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 104 (Nov. 2019), 24 pages. DOI: http://dx.doi.org/10.1145/3359206",
      "doi": "10.1145/3359206"
    },
    {
      "text": "Elizabeth Clark, Anne Spencer Ross, Chenhao Tan, Yangfeng Ji, and Noah A Smith. 2018. Creative Writing with a Machine in the Loop: Case Studies on Slogans and Stories. In Proceedings of the 23rd International Conference on Intelligent User Interfaces. ACM, 329--340.",
      "doi": "10.1145/3172944.3172983"
    },
    {
      "text": "Kate Compton and Michael Mateas. 2015. Casual Creators. In Proceedings of the Sixth International Conference on Computational Creativity (ICCC 2015), Hannu Toivonen, Simon Colton, Michael Cook, and Dan Ventura (Eds.). Brigham Young University, Park City, Utah, 228--235. http://computationalcreativity.net/iccc2015/proceedings/10_2Compton.pdf",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Chih-PIn Hsiao, Kunwar Yashraj Singh, Lisa Li, and Brian Magerko. 2016. Empirically Studying Participatory Sense-Making in Abstract Drawing with a Co-Creative Cognitive Agent. In Proceedings of the 21st International Conference on Intelligent User Interfaces (IUI '16). ACM, NY, NY, USA, 196--207. DOI: http://dx.doi.org/10.1145/2856767.2856795",
      "doi": "10.1145/2856767.2856795"
    },
    {
      "text": "Monica Dinculescu, Jesse Engel, and Adam Roberts. 2019. MidiMe: Personalizing a MusicVAE Model with User Data. In Workshop on Machine Learning for Creativity and Design, NeurIPS.",
      "doi": ""
    },
    {
      "text": "Monica Dinculescu and Cheng-Zhi Anna Huang. 2019. Coucou: An Expanded Interface for Interactive Composition with Coconet, through Flexible Inpainting. (2019). https://coconet.glitch.me/",
      "doi": ""
    },
    {
      "text": "Chris Donahue, Ian Simon, and Sander Dieleman. 2019. Piano Genie. In Proceedings of the 24th International Conference on Intelligent User Interfaces (IUI '19). ACM, NY, NY, USA, 160--164. DOI: http://dx.doi.org/10.1145/3301275.3302288",
      "doi": ""
    },
    {
      "text": "Douglas Eck and Juergen Schmidhuber. 2002. Finding Temporal Structure in Music: Blues Improvisation with LSTM Recurrent Networks. In Proceedings of the 12th IEEE Workshop on Neural Networks for Signal Processing.",
      "doi": ""
    },
    {
      "text": "Judith E Fan, Monica Dinculescu, and David Ha. 2019. collabdraw: An Environment for Collaborative Sketching with an Artificial Agent. In Proceedings of the 2019 on Creativity and Cognition. ACM, 556--561.",
      "doi": "10.1145/3325480.3326578"
    },
    {
      "text": "Morwaread M Farbood, Egon Pasztor, and Kevin Jennings. 2004. Hyperscore: a Graphical Sketchpad for Novice Composers. IEEE Computer Graphics and Applications 24, 1 (2004), 50--54.",
      "doi": "10.1109/MCG.2004.1255809"
    },
    {
      "text": "Rebecca Anne Fiebrink. 2011. Real-time Human Interaction with Supervised Learning Algorithms for Music Composition and Performance. PhD dissertation, Princeton University (2011).",
      "doi": "10.5555/2125776"
    },
    {
      "text": "Satoru Fukayama, Kazuyoshi Yoshii, and Masataka Goto. 2013. Chord-Sequence-Factory: A Chord Arrangement System Modifying Factorized Chord Sequence Probabilities. International Society for Music Information Retrieval (2013).",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero and Lydia B Chilton. 2019. Metaphoria: An Algorithmic Companion for Metaphor Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 296.",
      "doi": "10.1145/3290605.3300526"
    },
    {
      "text": "Jon Gillick, Adam Roberts, Jesse Engel, Douglas Eck, and David Bamman. 2019. Learning to Groove with Inverse Sequence Transformations. arXiv preprint arXiv:1905.06118 (2019).",
      "doi": ""
    },
    {
      "text": "Ian Goodfellow, Yoshua Bengio, and Aaron Courville. 2016. Deep Learning. MIT press.",
      "doi": "10.5555/3086952"
    },
    {
      "text": "James Granger, Mateo Aviles, Joshua Kirby, Austin Griffin, Johnny Yoon, Raniero Lara-Garduno, and Tracy Hammond. 2018. Lumanote: A Real-Time Interactive Music Composition Assistant. In Intelligent User Interfaces Workshops.",
      "doi": ""
    },
    {
      "text": "Florian Grote, Kristina Andersen, and Peter Knees. 2015. Collaborating with Intelligent Machines: Interfaces for Creative Sound. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). Association for Computing Machinery, New York, NY, USA, 2345--2348. DOI: http://dx.doi.org/10.1145/2702613.2702650",
      "doi": "10.1145/2702613.2702650"
    },
    {
      "text": "Matthew Guzdial, Nicholas Liao, Jonathan Chen, Shao-Yu Chen, Shukan Shah, Vishwa Shah, Joshua Reno, Gillian Smith, and Mark O. Riedl. 2019. Friend, Collaborator, Student, Manager: How Design of an AI-Driven Game Level Editor Affects Creators. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 624, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300854",
      "doi": ""
    },
    {
      "text": "Gaëtan Hadjeres, François Pachet, and Frank Nielsen. 2017. DeepBach: a Steerable Model for Bach Chorales Generation. In International Conference on Machine Learning. 1362--1371.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology. Vol. 52. Elsevier, 139--183.",
      "doi": ""
    },
    {
      "text": "Curtis Hawthorne, Andriy Stasyuk, Adam Roberts, Ian Simon, Cheng-Zhi Anna Huang, Sander Dieleman, Erich Elsen, Jesse Engel, and Douglas Eck. 2019. Enabling Factorized Piano Music Modeling and Generation with the MAESTRO Dataset. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Cheng-Zhi Anna Huang, Tim Cooijmnas, Adam Roberts, Aaron Courville, and Douglas Eck. 2017. Counterpoint by Convolution. International Society for Music Information Retrieval. (2017).",
      "doi": ""
    },
    {
      "text": "Cheng-Zhi Anna Huang, David Duvenaud, and Krzysztof Z Gajos. 2016. Chordripple: Recommending Chords to Help Novice Composers Go Beyond the Ordinary. In Proceedings of the 21st International Conference on Intelligent User Interfaces. ACM, 241--250.",
      "doi": "10.1145/2856767.2856792"
    },
    {
      "text": "Cheng-Zhi Anna Huang, Curtis Hawthorne, Adam Roberts, Monica Dinculescu, James Wexler, Leon Hong, and Jacob Howcroft. 2019a. The Bach Doodle: Approachable Music Composition with Machine Learning at Scale. International Society for Music Information Retrieval. (2019).",
      "doi": ""
    },
    {
      "text": "Cheng-Zhi Anna Huang, Ashish Vaswani, Jakob Uszkoreit, Ian Simon, Curtis Hawthorne, Noam Shazeer, Andrew M Dai, Matthew D Hoffman, Monica Dinculescu, and Douglas Eck. 2019b. Music Transformer. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Mikhail Jacob and Brian Magerko. 2015. Interaction-based Authoring for Scalable Co-creative Agents. In Proceedings of the Sixth International Conference on Computational Creativity (ICCC 2015), Hannu Toivonen, Simon Colton, Michael Cook, and Dan Ventura (Eds.). Brigham Young University, Park City, Utah, 236--243. http://computationalcreativity.net/iccc2015/proceedings/10_3Jacob.pdf",
      "doi": ""
    },
    {
      "text": "Pegah Karimi, Mary Lou Maher, Nicholas Davis, and Kazjon Grace. 2019. Deep Learning in a Computational Model for Conceptual Shifts in a Co-Creative Design System. arXiv preprint arXiv:1906.10188 (2019).",
      "doi": ""
    },
    {
      "text": "Janin Koch, Andrés Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI? Design Ideation with Cooperative Contextual Bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 633, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300863",
      "doi": "10.1145/3290605.3300863"
    },
    {
      "text": "Feynman Liang. 2016. BachBot: Automatic Composition in the Style of Bach Chorales. Masters thesis, University of Cambridge (2016).",
      "doi": ""
    },
    {
      "text": "Roger C Mayer, James H Davis, and F David Schoorman. 1995. An Integrative Model of Organizational Trust. Academy of Management Review 20, 3 (1995), 709--734.",
      "doi": "10.2307/258792"
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help but Only with Enough Details: Understanding User Experience of Co-Creation with Artificial Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 649, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174223",
      "doi": "10.1145/3173574.3174223"
    },
    {
      "text": "Christine Payne. 2019. MuseNet. (2019). https://openai.com/blog/musenet",
      "doi": ""
    },
    {
      "text": "Adam Roberts, Jesse Engel, Colin Raffel, Curtis Hawthorne, and Douglas Eck. 2018a. A Hierarchical Latent Vector Model for Learning Long-Term Structure in Music. In International Conference on Machine Learning (ICML). http://proceedings.mlr.press/v80/roberts18a.html",
      "doi": ""
    },
    {
      "text": "Adam Roberts, Curtis Hawthorne, and Ian Simon. 2018b. Magenta.js: A JavaScript API for Augmenting Creativity with Deep Learning. In Joint Workshop on Machine Learning for Music (ICML).",
      "doi": ""
    },
    {
      "text": "Ralf Schwarzer and Matthias Jerusalem. 1995. Generalized Self-efficacy Scale. Measures in Health Psychology: A User's Portfolio. Causal and Control Beliefs 1, 1 (1995), 35--37.",
      "doi": ""
    },
    {
      "text": "Ian Simon, Dan Morris, and Sumit Basu. 2008. MySong: Automatic Accompaniment Generation for Vocal Melodies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). Association for Computing Machinery, New York, NY, USA, 725--734. DOI: http://dx.doi.org/10.1145/1357054.1357169",
      "doi": "10.1145/1357054.1357169"
    },
    {
      "text": "Wikipedia contributors. 2019. Dixit (card game) - Wikipedia, The Free Encyclopedia. https://en.wikipedia.org/w/index.php?title=Dixit_ (card_game)&oldid=908027531. (2019). [Online; accessed 19-September-2019].",
      "doi": ""
    }
  ]
}