{
  "doi": "10.1145/3313831.3376128",
  "title": "Introducing Peripheral Awareness as a Neurological State for Human-computer Integration",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "In this work we introduce peripheral awareness as a neurological state for real-time human-computer integration, where the human is assisted by a computer to interact with the world. Changes to the field of view in peripheral awareness have been linked with quality of human performance. This instinctive narrowing of vision that occurs as a threat is perceived has implications in activities that benefit from the user having a wide field of view, such as cycling to navigate the environment. We present \"Ena\", a novel EEG-eBike system that draws from the user's neural activity to determine when the user is in a state of peripheral awareness to regulate engine support. A study with 20 participants revealed various themes and tactics suggesting that peripheral awareness as a neurological state is viable to align human-machine integration with internal bodily processes. Ena suggests that our work facilitates a safe and enjoyable human-computer integration experience.",
  "authors": [
    {
      "name": "Josh Andres",
      "institution": "Monash University & IBM Research, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658744130",
      "orcid": "missing"
    },
    {
      "name": "m.c. schraefel",
      "institution": "University of Southampton, Southampton, United Kingdom",
      "img": "/do/10.1145/contrib-81311483103/rel-imgonly/81311483103.jpg",
      "acmid": "81311483103",
      "orcid": "missing"
    },
    {
      "name": "Nathan Semertzidis",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365958",
      "orcid": "0000-0002-5625-5112"
    },
    {
      "name": "Brahmi Dwivedi",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529317",
      "orcid": "missing"
    },
    {
      "name": "Yutika C. Kulwe",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527470",
      "orcid": "missing"
    },
    {
      "name": "Juerg von Kaenel",
      "institution": "IBM Research, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100643947",
      "orcid": "missing"
    },
    {
      "name": "Florian Floyd Mueller",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    }
  ],
  "references": [
    {
      "text": "Dzmitry Aliakseyeu, Bernt Meerbeek, Jon Mason, Remco Magielse and Susanne Seitinger. Peripheral Interaction with Light. In Peripheral Interaction, Springer, 2016, 207--235. http://dx.doi.org/10.1145/10.1007/978--3--319--29523--7_10",
      "doi": ""
    },
    {
      "text": "Andres, et al. 2020. Future Inbodied: A Framework for Inbodied Interaction Design. In Proceedings of TEI Conference on Tangible, Embedded, and Embodied Interaction. http://dx.doi.org/10.1145/10.1145/3374920.3374969",
      "doi": ""
    },
    {
      "text": "Josh Andres, Julian de Hoog and Florian 'Floyd' Mueller. 2018. \"I Had Super-Powers When eBike Riding\" Towards Understanding the Design of Integrated Exertion. Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. http://dx.doi.org/10.1145/10.1145/3242671.3242688",
      "doi": "10.1145/3242671.3242688"
    },
    {
      "text": "Josh Andres, Tuomas Kari, Juerg von Kaenel and Florian 'Floyd' Mueller. 2019. \"Co-Riding with My Ebike to Get Green Lights\". In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 3322307, 1251--1263. http://dx.doi.org/10.1145/10.1145/3322276.3322307",
      "doi": "10.1145/3322276.3322307"
    },
    {
      "text": "Josh Andres, m.c. schraefel, Aaron Tabor and Eric B. Hekler. 2019. The Body as Starting Point: Applying inside Body Knowledge for Inbodied Design. In Proceedings of Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 3299023, 1--8. http://dx.doi.org/10.1145/10.1145/3290607.3299023",
      "doi": ""
    },
    {
      "text": "Azami, et al. 2012. An Improved Signal Segmentation Using Moving Average and Savitzky-Golay Filter. Journal of Signal and Information Processing 3, 01, 39. 10.4236/jsip.2012.31006",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Elise Hoven and Berry Eggen. 2015. Peripheral Interaction: Characteristics and Considerations. Personal and Ubiquitous Computing 19, 1, 239--254. opus.lib.uts.edu.au/handle/10453/33597",
      "doi": "10.1007/s00779-014-0775-2"
    },
    {
      "text": "Jared S. Bauer, Sunny Consolvo, Benjamin Greenstein, Jonathan Schooler, Eric Wu, Nathaniel F. Watson and Julie Kientz. 2012. Shuteye: Encouraging Awareness of Healthy Sleep Recommendations with a Mobile, Peripheral Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2208600, 1401--1410. http://dx.doi.org/10.1145/10.1145/2207676.2208600",
      "doi": ""
    },
    {
      "text": "Open BCI. 2019. Cyton Biosensing Board - Open BCI. https://shop.openbci.com/products/cyton-biosensing-board-8-channel?variant=38958638542.",
      "doi": ""
    },
    {
      "text": "Open BCI. 2019. Eeg Electrode Cap Kit. https://shop.openbci.com/products/openbci-eeg-electrocap.",
      "doi": ""
    },
    {
      "text": "AE Blandford. 2013. Semi-Structured Qualitative Studies Interaction Design Foundation. discovery.ucl.ac.uk/id/eprint/1436174/",
      "doi": ""
    },
    {
      "text": "Marc Boucher. 2004. Kinetic Synaesthesia: Experiencing Dance in Multimedia Scenographies. Contemporary Aesthetics 2, 1, 13. hdl.handle.net/2027/spo.7523862.0002.013",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. Using Thematic Analysis in Psychology. 2006. Qualitative research in psychology 3, 2, 77--101. http://dx.doi.org/10.1145/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Sasskia Brüers and Rufin VanRullen. 2018. Alpha Power Modulates Perception Independently of Endogenous Factors. Frontiers in Neuroscience 12, 279. http://dx.doi.org/10.1145/10.3389/fnins.2018.00279",
      "doi": ""
    },
    {
      "text": "Elizabeth Churchill. 2015. Mhealth+ Proactive Well-Being= Well Creation. interactions 22, 1, 60--63.",
      "doi": ""
    },
    {
      "text": "Eric Cobb. 2014. Peripheral Vision Training. https://youtu.be/aunC2sSjvC8",
      "doi": ""
    },
    {
      "text": "Ashley Colley, Lasse Virtanen, Pascal Knierim and Jonna Häkkilä. 2017. Investigating Drone Motion as Pedestrian Guidance. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia. ACM, 143--150. http://dx.doi.org/10.1145/10.1145/3152832.3152837",
      "doi": "10.1145/3152832.3152837"
    },
    {
      "text": "Daniel H De La Iglesia, Juan F De Paz, Gabriel Villarrubia González, Alberto L Barriuso, Javier Bajo and Juan M Corchado. 2018. Increasing the Intensity over Time of an Electric-Assist Bike Based on the User and Route: The Bike Becomes the Gym. Sensors 18, 1, 220. http://dx.doi.org/10.1145/10.3390/s18010220",
      "doi": ""
    },
    {
      "text": "Jennifer R Dunn and Maurice E Schweitzer. 2005. Feeling and Believing: The Influence of Emotion on Trust. Journal of personality and social psychology 88, 5, 736. 10.1037/0022--3514.88.5.736",
      "doi": ""
    },
    {
      "text": "Kevin Fan, Jochen Huber, Suranga Nanayakkara and Masahiko Inami. 2014. Spidervision: Extending the Human Field of View for Augmented Awareness. In Proceedings of the 5th Augmented Human International Conference. ACM, 2582100, 1--8. http://dx.doi.org/10.1145/10.1145/2582051.2582100",
      "doi": "10.1145/2582051.2582100"
    },
    {
      "text": "Umer Farooq and Jonathan Grudin. 2016. Human-Computer Integration. Interactions 23, 6, 26--32. http://dx.doi.org/10.1145/10.1145/3001896",
      "doi": "10.1145/3001896"
    },
    {
      "text": "Umer Farooq and Jonathan T. Grudin. 2017. Paradigm Shift from Human Computer Interaction to Integration. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3049285, 1360--1363. http://dx.doi.org/10.1145/10.1145/3027063.3049285",
      "doi": ""
    },
    {
      "text": "Elliot Fishman and Christopher Cherry. 2016. E-Bikes in the Mainstream: Reviewing a Decade of Research. Transport Reviews 36, 1, 72--91. http://dx.doi.org/10.1145/10.1080/01441647.2015.1069907",
      "doi": ""
    },
    {
      "text": "Wofgang Fuhl, Marc Tonsen, Andreas Bulling and Enkelejda Kasneci. 2016. Pupil Detection for Head-Mounted Eye Tracking in the Wild: An Evaluation of the State of the Art. Machine Vision and Applications 27, 8, 1275--1288. http://dx.doi.org/10.1145/10.10072Fs00138-016-0776--4",
      "doi": "10.1007/s00138-016-0776-4"
    },
    {
      "text": "Abdullah Ghasemi, Maryam Momeni, Ebrahim Jafarzadehpur, Meysam Rezaee and Hamid Taheri. 2011. Visual Skills Involved in Decision Making by Expert Referees. Perceptual and Motor Skills 112, 1, 161--171. http://dx.doi.org/10.1145/10.2466/05.22.24.27.PMS.112.1.161--171",
      "doi": ""
    },
    {
      "text": "Mhmoud Hassan, Florian Daiber, Frederik Wiehr, Felix Kosmalla and Antonio Krüger. 2017. Footstriker: An Ems-Based Foot Strike Assistant for Running. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 1, 2. http://dx.doi.org/10.1145/10.1145/3053332",
      "doi": "10.1145/3053332"
    },
    {
      "text": "Robert R Hoffman, Shane T Mueller, Gary Klein and Jordan Litman. 2018. Metrics for Explainable AI: Challenges and Prospects. arXiv preprint arXiv:1812.04608.",
      "doi": ""
    },
    {
      "text": "Kasper Hornb and Antti Oulasvirta. 2017. What Is Interaction? In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3025765, 5040--5052. http://dx.doi.org/10.1145/10.1145/3025453.3025765",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Safal Khanal. 2015. Impact of Visual Skills Training on Sports Performance: Current and Future Perspectives. http://dx.doi.org/10.1145/10.15406/aovs.2015.02.00032",
      "doi": ""
    },
    {
      "text": "Kyle Krafka, Aditya Khosla, Petr Kellnhofer, Harini Kannan, Suchendra Bhandarkar, Wojciech Matusik and Antonio Torralba. 2016. Eye Tracking for Everyone. In Proceedings of the IEEE conference on computer vision and pattern recognition. 2176--2184. dspace.mit.edu/handle/1721.1/111782",
      "doi": ""
    },
    {
      "text": "Brian Casey Langford, Jiaoli Chen and Christopher R Cherry. 2015. Risky Riding: Naturalistic Methods Comparing Safety Behavior from Conventional Bicycle Riders and Electric Bike Riders. Accident Analysis & Prevention 82, 220--226. http://dx.doi.org/10.1145/10.1016/j.aap.2015.05.016",
      "doi": ""
    },
    {
      "text": "Ken APM Lemmink, Baukje Dijkstra and Chris Visscher. 2005. Effects of Limited Peripheral Vision on Shuttle Sprint Performance of Soccer Players. Perceptual and motor skills 100, 1, 167--175. http://dx.doi.org/10.1145/10.2466/pms.100.1.167--175",
      "doi": ""
    },
    {
      "text": "Joeph Carl Robnett Licklider. 1960. Man-Computer Symbiosis. IRE transactions on human factors in electronics, 1, 4--11. 10.1109/THFE2.1960.4503259",
      "doi": ""
    },
    {
      "text": "Gag Luo, Fernando Vargas-Martin and Eli Peli. 2008. The Role of Peripheral Vision in Saccade Planning: Learning from People with Tunnel Vision. Journal of vision 8, 14, 25--25. http://dx.doi.org/10.1145/10.1167/8.14.25",
      "doi": ""
    },
    {
      "text": "Changxi Ma, Dong Yang, Jibiao Zhou, Zhongxiang Feng and Quan Yuan. 2019. Risk Riding Behaviors of Urban E-Bikes: A Literature Review. International journal of environmental research and public health 16, 13, 2308. http://dx.doi.org/10.1145/10.3390/ijerph16132308",
      "doi": ""
    },
    {
      "text": "Päivi Majaranta and Andreas Bulling. 2014. Eye Tracking and Eye-Based Human--Computer Interaction. In Advances in Physiological Computing, Springer, 39--65. http://dx.doi.org/10.1145/10.1109/MAMI.2015.7456615",
      "doi": ""
    },
    {
      "text": "Regan L Mandryk and Lennart E Nacke. 2016. Biometrics in Gaming and Entertainment Technologies. In Biometrics in a Data Driven World, Chapman and Hall/CRC, 215--248. http://dx.doi.org/10.1145/10.1201/9781315317083--7",
      "doi": ""
    },
    {
      "text": "Rafel Ibáñez Molinero and Juan Antonio García-Madruga. 2011. Knowledge and Question Asking.Psicothema 23, 1, 26--30. pubmed/21266138",
      "doi": ""
    },
    {
      "text": "Mueller, et al. Towards Designing Bodily Integrated Play. 2020. In Proceedings of TEI Conference on Tangible, Embedded, and Embodied Interaction.",
      "doi": ""
    },
    {
      "text": "Mueller, et al. 2011. Designing Sports: A Framework for Exertion Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2651--2660. http://dx.doi.org/10.1145/10.1145/1978942.1979330",
      "doi": ""
    },
    {
      "text": "Florian \"Floyd\" Mueller, Josh Andres, Joe Marshall, Dag Svan, m. c. schraefel, Kathrin Gerling, Jakob Tholander, Anna Lisa Martin-Niedecken, Elena M, rquez Segura, Elise van den Hoven, Nicholas Graham, Kristina H, and Corina Sas. 2018. Body-Centric Computing: Results from a Weeklong Dagstuhl Seminar in a German Castle. Interactions 25, 4, 34--39. 10.1145/3215854",
      "doi": ""
    },
    {
      "text": "Lennart Nacke, Michael Kalyn, Calvin Lough and Regan Lee Mandryk. 2011. Biofeedback Game Design: Using Direct and Indirect Physiological Control to Enhance Game Interaction. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 103--112. http://dx.doi.org/10.1145/10.1145/1978942.1978958",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Jeane Nakamura and Mihaly Csikszentmihalyi. 2002. The Concept of Flow. Handbook of positive psychology, 89--105. http://dx.doi.org/10.1145/10.1093/oxfordhb/9780195187243.013.0018",
      "doi": ""
    },
    {
      "text": "Wenya Nan, Daria Migotina, Feng Wan, Chin Ian Lou, João Rodrigues, João Semedo, Mang I Vai, Jose Gomes Pereira, Fernando Melicio and Agostinho C Da Rosa. 2014. Dynamic Peripheral Visual Performance Relates to Alpha Activity in Soccer Players. Frontiers in human neuroscience 8, 913. 10.3389/fnhum.2014.00913",
      "doi": ""
    },
    {
      "text": "Wenya Nan, Feng Wan, Chin Ian Lou, Mang I Vai and Agostinho Rosa. 2013. Peripheral Visual Performance Enhancement by Neurofeedback Training. Applied psychophysiology and biofeedback 38, 4, 285--291. 0.1007/s10484-013--9233--6",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Sue Ann Seah and Sriram Subramanian. 2005. Talking About Tactile Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1659--1668. http://dx.doi.org/10.1145/10.1145/2470654.2466220",
      "doi": ""
    },
    {
      "text": "OpenBCI. 2019. Openbci_GUI. https://github.com/OpenBCI/OpenBCI_GUI/tree/master/OpenBCI_GUI.",
      "doi": ""
    },
    {
      "text": "Jason Orlosky. 2014. Depth Based Interaction and Field of View Manipulation for Augmented Reality. In Proceedings s of the adjunct publication of the 27th annual ACM symposium on User interface software and technology. ACM, 2661164, 5--8. http://dx.doi.org/10.1145/10.1145/2658779.2661164",
      "doi": "10.1145/2658779.2661164"
    },
    {
      "text": "Patibanda, et al. Motor Memory in HCI. In Proceedings of Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Tibor Petzoldt, Katja Schleinitz, Sarah Heilmann and Tina Gehlert. 2017. Traffic Conflicts and Their Contextual Factors When Riding Conventional Vs. Electric Bicycles. Transportation research part F: traffic psychology and behaviour 46, 477--490. http://dx.doi.org/10.1145/10.1016/j.trf.2016.06.010",
      "doi": ""
    },
    {
      "text": "Rantakari, et al. 2016. Charting Design Preferences on Wellness Wearables. In Proceedings of the 7th Augmented Human International Conference 2016. ACM, 2875231, 1--4. http://dx.doi.org/10.1145/10.1145/2875194.2875231",
      "doi": ""
    },
    {
      "text": "IBM Research. 2018. Trusting AI. https://www.research.ibm.com/artificial-intelligence/publications/2018/trusting-ai/.",
      "doi": ""
    },
    {
      "text": "Ruth Rosenholtz. Capabilities and Limitations of Peripheral Vision. 2016. Annual Review of Vision Science 2, 437--457. http://dx.doi.org/10.1145/10.1146/annurev-vision-082114-035733",
      "doi": ""
    },
    {
      "text": "Esther Salmeron-Manzano and Francisco Manzano-Agugliaro. 2018. The Electric Bicycle: Worldwide Research Trends. Energies 11, 7, 1894.",
      "doi": ""
    },
    {
      "text": "Alrecht Schmidt. 2017. Augmenting Human Intellect and Amplifying Perception and Cognition. IEEE Pervasive Computing 16, 1, 6--10. http://dx.doi.org/10.1145/10.1109/MPRV.2017.8",
      "doi": "10.1109/MPRV.2017.8"
    },
    {
      "text": "m. c. schraefel, et al. 2020. Inbodied Interaction 102: Understanding the Selection and Application of Non-Invasive Neuro-Physio Measurements for Inbodied Interaction Design. In Proceedings of Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "m.c. schraefel. 2019. In5: A Model for Inbodied Interaction. In Proceedings of Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 3312977, 1--6. http://dx.doi.org/10.1145/10.1145/3290607.3312977",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, William Odom, Lyn Bartram and Carman Neustaedter. 2017. Time-Turner: Data Engagement through Everyday Objects in the Home. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems. ACM, 3079122, 72--78. http://dx.doi.org/10.1145/10.1145/3064857.3079122",
      "doi": "10.1145/3064857.3079122"
    },
    {
      "text": "Shaun Sweeney, Rodrigo Ordonez-Hurtado, Francesco Pilla, Giovanni Russo, David Timoney and Robert Shorten. 2017. Cyberphysics, Pollution Mitigation, and Pedelecs. arXiv preprint arXiv:1706.00646",
      "doi": ""
    },
    {
      "text": "Janet L. Taylor. 2016. Kinesthetic Inputs. In Neuroscience in the 21st Century: From Basic to Clinical, Donald W. Pfaff and Nora D. Volkow Eds. Springer New York (New York, NY), 1055--1089. http://dx.doi.org/10.1145/10.1007/978--1--4939--3474--4_31",
      "doi": ""
    },
    {
      "text": "Bhavin Trivedi, Matthew J Kesterke, Ritesh Bhattacharjee, William Weber, Karen Mynar and Likith V Reddy. 2019. Craniofacial Injuries Seen with the Introduction of Bike-Share Electric Scooters in an Urban Setting. Journal of Oral and Maxillofacial Surgery. http://dx.doi.org/10.1145/10.1016/j.joms.2019.07.014",
      "doi": ""
    },
    {
      "text": "Vaessa Vallejo, Dario Cazzoli, Luca Rampa, Giuseppe A Zito, Flurin Feuerstein, Nicole Gruber, René M Müri, Urs P Mosimann and Tobias Nef. 2016. Effects of Alzheimer's Disease on Visual Target Detection: A \"Peripheral Bias\". Frontiers in aging neuroscience 8, 200. http://dx.doi.org/10.1145/10.3389/fnagi.2016.00200",
      "doi": ""
    },
    {
      "text": "Naomi Vanlessen, Rudi De Raedt, Ernst HW Koster and Gilles Pourtois. 2016. Happy Heart, Smiling Eyes: A Systematic Review of Positive Mood Effects on Broadening of Visuospatial Attention. Neuroscience & Biobehavioral Reviews 68, 816--837. http://dx.doi.org/10.1145/10.1016/j.neubiorev.2016.07.001",
      "doi": ""
    },
    {
      "text": "Naomi Vanlessen, Rudi De Raedt, Ernst HW Koster and Gilles Pourtois. 2016. Happy Heart, Smiling Eyes: A Systematic Review of Positive Mood Effects on Broadening of Visuospatial Attention. Neuroscience & Biobehavioral Reviews 68, 816--837. http://dx.doi.org/10.1145/10.1016/j.neubiorev.2016.07.001",
      "doi": ""
    },
    {
      "text": "P Vermesch. 1994. The Explicitation Interview. Publisher: French original ESF. https://www.researchgate.net/publication/324976173_The_explicitation_interview",
      "doi": ""
    }
  ]
}