{
  "doi": "10.1145/3313831.3376137",
  "title": "Digital Liminalities: Understanding Isolated Communities on the Edge",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "This paper brings together three distinct case studies to explore how social isolation and notions of liminality shape ontological security within communities on \"the edge\" of society. Each case study exemplifies the differing nature of liminality in everyday contexts and the extent to which increased digitalisation perturbs it in multiple ways. Taking an ethnographic approach, the research engaged with seafarers onboard container ships in European waters, communities in Greenland and welfare claimants in the North East of England. It posits that technological innovation must attend to the routinisation of everyday life through which people establish ontological security if such innovation is to be supportive. The paper thus moves beyond existing HCI scholarship by foregrounding the contextual and relational aspects of social isolation rather than the technological. It does so by advocating a ground-up design process that considers ontological security in relation to notions of liminality among communities on the edge.",
  "tags": [
    "ethnography",
    "isolation",
    "liminality: ontological security",
    "communities",
    "design principles"
  ],
  "authors": [
    {
      "name": "Rikke Bjerg Jensen",
      "institution": "Royal Holloway University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260332",
      "orcid": "missing"
    },
    {
      "name": "Lizzie Coles-Kemp",
      "institution": "Royal Holloway University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448597617",
      "orcid": "missing"
    },
    {
      "name": "Nicola Wendt",
      "institution": "Royal Holloway University of London, Egham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528140",
      "orcid": "missing"
    },
    {
      "name": "Makayla Lewis",
      "institution": "University of the Arts London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958791457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Iris Acejo. 2012. Seafarers and transnationalism: Ways of belongingness ashore and aboard. Journal of intercultural studies 33, 1 (2012), 69--84.",
      "doi": ""
    },
    {
      "text": "Derek Armitage, Fikret Berkes, Aaron Dale, Erik Kocho-Schellenberg, and Eva Patton. 2011. Co-Management and the Co-Production of Knowledge: Learning to Adapt in Canada's Arctic. Global Environmental Change 21, 3 (8 2011), 995--1004.",
      "doi": ""
    },
    {
      "text": "Benett Axtell and Cosmin Munteanu. 2019. PhotoFlow in Action: Picture-Mediated Reminiscence Supporting Family Socio-Connectivity. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, INT050.",
      "doi": "10.1145/3290607.3313272"
    },
    {
      "text": "Ron Baecker, Kate Sellen, Sarah Crosskey, Veronique Boscart, and Barbara Barbosa Neves. 2014. Technology to reduce social isolation and loneliness. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 27--34.",
      "doi": "10.1145/2661334.2661375"
    },
    {
      "text": "Polina Baum-Talmor. 2014. From sea to shore: ethnographic account of seafarers' experience onboard merchant ships. SAGE Publications, Ltd.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1999. Contextual design. interactions 6, 1 (1999), 32--42.",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Nicola Bidwell and Dianna Hardy. 2009. Dilemmas in situating participation in rural ways of saying. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7. ACM, 145--152.",
      "doi": "10.1145/1738826.1738850"
    },
    {
      "text": "Nicola J. Bidwell and David Browning. 2009. Pursuing Genius Loci: Interaction Design and Natural Places. Personal & Ubiquitous Computing 14 (2009), 15--30.",
      "doi": "10.1007/s00779-009-0217-8"
    },
    {
      "text": "Diana Luskin Biordi and Nicholas R Nicholson. 2013. Social isolation. Chronic illness: Impact and intervention (2013), 85--115.",
      "doi": ""
    },
    {
      "text": "David Bissell. 2013. Pointless mobilities: rethinking proximity through the loops of neighbourhood. Mobilities 8, 3 (2013), 349--367.",
      "doi": ""
    },
    {
      "text": "William Bridges. 2004. Transitions: Making sense of life's changes. Da Capo Lifelong Books.",
      "doi": ""
    },
    {
      "text": "Jim Brown. 2014. TR Week Seven B. (2014). http://probationmatters.blogspot.com/2014/07/ tr-week-seven-b.html",
      "doi": ""
    },
    {
      "text": "Kynthia Brunette, Matthew Eisenstadt, Erik Pukinskis, and William Ryan. 2005. Meeteetse: social well-being through place attachment. In CHI'05 Extended Abstracts on Human Factors in Computing Systems. ACM, 2065--2069.",
      "doi": "10.1145/1056808.1057100"
    },
    {
      "text": "Bronwyn Lee Carlson, Lani V Jones, Michelle Harris, Nelia Quezada, and Ryan Frazer. 2017. Trauma, shared recognition and indigenous resistance on social media. Australasian Journal of Information Systems 21 (2017).",
      "doi": ""
    },
    {
      "text": "Mandy Cheetham, Suzanne Moffatt, Michelle Addison, and Alice Wiseman. 2019. Impact of Universal Credit in North East England: a qualitative study of claimants and support staff. BMJ open 9, 7 (2019), e029611.",
      "doi": ""
    },
    {
      "text": "Jacques Chevalier and Daniel Buckles. 2013. Handbook for Participatory Action Research, Planning and Evaluation. (2013).",
      "doi": ""
    },
    {
      "text": "Lizzie Coles-Kemp and René Rydhof Hansen. 2017. Walking the line: The everyday security ties that bind. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 464--480.",
      "doi": "10.1007/978-3-319-58460-7_32"
    },
    {
      "text": "Lizzie Coles-Kemp, Rikke Bjerg Jensen, and Reem Talhouk. 2018. In a New Land: Mobile Phones, Amplified Pressures and Reduced Capabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 584.",
      "doi": "10.1145/3173574.3174158"
    },
    {
      "text": "Stuart Croft. 2012. Constructing ontological insecurity: the insecuritization of Britain's Muslims. Contemporary security policy 33, 2 (2012), 219--235.",
      "doi": ""
    },
    {
      "text": "Stuart Croft and Nick Vaughan-Williams. 2017. Fit for purpose? Fitting ontological security studies 'into' the discipline of International Relations: Towards a vernacular turn. Cooperation and conflict 52, 1 (2017), 12--30.",
      "doi": ""
    },
    {
      "text": "Hilary Davis and Jane Farmer. 2018. Including the Rural Excluded: Digital Technology and Diverse Community Participation. In Digital Participation through Social Living Labs. Elsevier, 223--244.",
      "doi": ""
    },
    {
      "text": "Hilary Davis, Luke Hespanhol, Jane Farmer, Joel Fredericks, Glenda A Caldwell, and Marius Hoggenmueller. 2017. Designing Participation for the Digital Fringe. In Proceedings of the 8th International Conference on Communities and Technologies. ACM, 321--324.",
      "doi": "10.1145/3083671.3083714"
    },
    {
      "text": "Hilary Davis, Frank Vetere, Shawn Ashkanasy, Gavin Dyson, Penelope Schofield, Kate Thompson, Giselle Withers, and David Thomas. 2008a. Towards social connection for young people with cancer. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat. ACM, 319--322.",
      "doi": "10.1145/1517744.1517804"
    },
    {
      "text": "Hilary Davis, Frank Vetere, Shawn Ashkanasy, Gavin Dyson, Penelope Schofield, Kate Thompson, Giselle Withers, and David Thomas. 2008b. Towards social connection for young people with cancer. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat. ACM, 319--322.",
      "doi": "10.1145/1517744.1517804"
    },
    {
      "text": "Audrey Drolet, Thomas Lemonde-Marzell, Pablo Matos Da Silva, Kim Lamontagne, and Marjorie Bédard. 2019. SENTI ¯ O: Reconnect with Yourself to Better Connect with Others. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, SDC07.",
      "doi": "10.1145/3290607.3309689"
    },
    {
      "text": "Ann Fienup-Riordan. 1995. Freeze Frame : Alaska Eskimos in the Movies. University of Washington Press. 234 pages.",
      "doi": ""
    },
    {
      "text": "Greenlandic Agency for Digitization. 2014. Borgerne og IT i Grønland. Technical Report.",
      "doi": ""
    },
    {
      "text": "Helene Forsberg Madsen. 2016. Udsatte Grønlandske Kvinder i Danmark. Technical Report. Rådet for Socialt Udsatte, Copenhagen.",
      "doi": ""
    },
    {
      "text": "David M Frohlich, Christopher Lim, and Amr Ahmed. 2016. Co-designing a diversity of social media products with and for older people. In Proceedings of the 7th international conference on software development and technologies for enhancing accessibility and fighting info-exclusion. ACM, 323--330.",
      "doi": "10.1145/3019943.3019990"
    },
    {
      "text": "Futurenautics. 2018. The Crew Connectivity Survey. (2018).",
      "doi": ""
    },
    {
      "text": "Roderick G Galam. 2015. Gender, reflexivity, and positionality in male research in one's own community with Filipino seafarers' wives. In Forum Qualitative Sozialforschung/Forum: Qualitative Social Research, Vol. 16.",
      "doi": ""
    },
    {
      "text": "Anderson C Garcia and Silvana de Lara. 2018. Enabling aid in remote care for elderly people via mobile devices: the MobiCare case study. In Proceedings of the 8th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion. ACM, 270--277.",
      "doi": "10.1145/3218585.3218671"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions 6, 1 (1999), 21--29.",
      "doi": ""
    },
    {
      "text": "Anthony Giddens. 1984. The constitution of society: Outline of the theory of structure. Berkeley. (1984).",
      "doi": ""
    },
    {
      "text": "Anthony Giddens. 1991. Modernity and self-identity: Self and society in the late modern age. Stanford university press.",
      "doi": ""
    },
    {
      "text": "HM Government. 2012. Welfare Reform Act 2012. (2012).",
      "doi": ""
    },
    {
      "text": "Statistics Greenland. 2019. Population. (2019).",
      "doi": ""
    },
    {
      "text": "Oliver Haimson. 2018. Social media as social transition machinery. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 63.",
      "doi": "10.1145/3274332"
    },
    {
      "text": "Oliver Haimson, Jed Brubaker, Lynn Dombrowski, and Gillian Hayes. 2016. Digital footprints and changing networks during online identity transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2895--2907.",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Oliver L Haimson, Bryan Semaan, Brianna Dym, Joey Chiao-Yin Hsiao, Daniel Herron, and Wendy Moncur. 2019. Life Transitions and Social Technologies: Research and Design for Times of Life Change. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. ACM, 480--486.",
      "doi": "10.1145/3311957.3359431"
    },
    {
      "text": "Luke Hespanhol, Hilary Davis, Joel Fredericks, Glenda Amayo Caldwell, and Marius Hoggenmüller. 2018. The Digital Fringe and Social Participation through Interaction Design. The Journal of Community Informatics 14, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Nick Hine and John L Arnott. 2002. Assistive social interaction for non-speaking people living in the community. In Proceedings of the fifth international ACM conference on Assistive technologies. ACM, 162--169.",
      "doi": "10.1145/638249.638279"
    },
    {
      "text": "Nautilus International. 2017. An investigation into connectivity at sea. (2017).",
      "doi": ""
    },
    {
      "text": "David L Johnson, Veljko Pejovic, Elizabeth M Belding, and Gertjan Van Stam. 2011. Traffic characterization and internet usage in rural Africa. In Proceedings of the 20th international conference companion on World wide web. ACM, 493--502.",
      "doi": "10.1145/1963192.1963363"
    },
    {
      "text": "Stefan Jonsson. 2016. Where Humanism Finds its Ends: Lessons from Pia Arke and Katarina Pirak Sikku on the Difficulty of Narrating the Arctic. Studies in Travel Writing 20, 3 (2016), 226--236.",
      "doi": ""
    },
    {
      "text": "Azmina Karimi and Carman Neustaedter. 2012. From high connectivity to social isolation: communication practices of older adults in the digital age. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion. ACM, 127--130.",
      "doi": "10.1145/2141512.2141559"
    },
    {
      "text": "Kiel Long, Lyndsey L Bakewell, Roisin C McNaney, Konstantina Vasileiou, Mark Atkinson, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2017. Connecting those that care: Designing for transitioning, talking, belonging and escaping. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1339--1351.",
      "doi": "10.1145/3025453.3025715"
    },
    {
      "text": "Bill McSweeney. 1999. Security, identity and interests: a sociology of international relations. Vol. 69. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Alex Mellbye and Tim Carter. 2017. Seafarers depression and suicide. International maritime health 68, 2 (2017), 108--114.",
      "doi": ""
    },
    {
      "text": "Roberta M. Melvin, Andrea Bunt, Erick Oduor, and Carman Neustaedter. 2015. The Effect of Signal Expense and Dependability on Family Communication in Rural and Northern Canada. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 717--726.",
      "doi": "10.1145/2702123.2702301"
    },
    {
      "text": "Lydia Morris. 2019. Activating the welfare subject: the problem of agency. Sociology (2019).",
      "doi": ""
    },
    {
      "text": "Anna Moutafidou and Tharrenos Bratitsis. 2018. Digital storytelling: giving voice to socially excluded people in various contexts. In Proceedings of the 8th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion. ACM, 219--226.",
      "doi": "10.1145/3218585.3218684"
    },
    {
      "text": "Lasse O Nielsen, Hans J Krebs, Nancy M Albert, Nick Anderson, Sheryl Catz, Timothy M Hale, John Hansen, Lise Hounsgaard, Tae Youn Kim, David Lindeman, and others. 2017. Telemedicine in Greenland: Citizens' Perspectives. Telemedicine and e-Health 23, 5 (2017), 441--447.",
      "doi": ""
    },
    {
      "text": "Mark Nuttall. 1990. Greenlandic: political development of an Inuit language. Polar Record 26, 159 (1990), 331--333.",
      "doi": ""
    },
    {
      "text": "Elena Parmiggiani and Helena Karasti. 2018. Surfacing the arctic: politics of participation in infrastructuring. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial-Volume 2. ACM, 7.",
      "doi": "10.1145/3210604.3210625"
    },
    {
      "text": "Sonja Pedell, Frank Vetere, Lars Kulik, Elizabeth Ozanne, and Alan Gruner. 2010. Social isolation of older people: the role of domestic technologies. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction. ACM, 164--167.",
      "doi": "10.1145/1952222.1952255"
    },
    {
      "text": "Miguel Kiyoshy Nakamura Pinto, Ermanno Pietrosemoli, Marco Zennaro, Marco Rainone, Pietro Manzoni, and others. 2018. A LoRa enabled sustainable messaging system for isolated communities. In Proceedings of the 4th EAI International Conference on Smart Objects and Technologies for Social Good. ACM, 118--123.",
      "doi": ""
    },
    {
      "text": "Gina Porter, Kate Hampshire, Albert Abane, Alister Munthali, Elsbeth Robson, Mac Mashiri, and Augustine Tanle. 2012. Youth, mobility and mobile phones in Africa: findings from a three-country study. Information Technology for Development 18, 2 (2012), 145--162.",
      "doi": ""
    },
    {
      "text": "Paul Roe. 2008. The 'value' of positive security. Review of international studies 34, 4 (2008), 777--794.",
      "doi": ""
    },
    {
      "text": "Gillian Rose. 2016. Visual methodologies: An introduction to researching with visual materials. sage.",
      "doi": ""
    },
    {
      "text": "Koen Salemink, Dirk Strijker, and Gary Bosworth. 2017. Rural Development in the Digital Age: A Systematic Literature Review on Unequal ICT Availability, Adoption, and Use in Rural Area. Journal of Rural Studies 54 (2017), 360--371.",
      "doi": ""
    },
    {
      "text": "Helen Sampson. 2013. International seafarers and transnationalism in the twenty-first century. Manchester University Press.",
      "doi": ""
    },
    {
      "text": "Helen Sampson and Michelle Thomas. 2003. The social isolation of seafarers: causes, effects, and remedies. International maritime health 54, 1--4 (2003), 58--67.",
      "doi": ""
    },
    {
      "text": "Pedro C Santana, Marcela D Rodríguez, Víctor M González, Luís A Castro, and Ángel G Andrade. 2005. Supporting emotional ties among mexican elders and their families living abroad. In CHI'05 Extended Abstracts on Human Factors in Computing Systems. ACM, 2099--2103.",
      "doi": "10.1145/1056808.1057107"
    },
    {
      "text": "Kristina Sehlin MacNeil and Jillian Marsh. 2015. Indigenous Research Across Continents: A Comparison of Ethically and Culturally Sound Approaches to Research in Australia and Sweden. (2015).",
      "doi": ""
    },
    {
      "text": "Bryan Semaan, Lauren Britton, and Bryan Dosono. 2016. Transition resilience with ICTs:'Identity awareness' in veteran re-integration. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2882--2894.",
      "doi": "10.1145/2858036.2858109"
    },
    {
      "text": "Ruth Stalker-Firth. 2007. Inside your users' minds: The cultural probe. A List Apart (2007).",
      "doi": ""
    },
    {
      "text": "Olivia Swift and Rikke Bjerg Jensen. 2016. The mixed blessings of the internet. Nautilus Telegraph (2016), 20--21.",
      "doi": ""
    },
    {
      "text": "Gregory Taylor. 2018. Remote Rural Broadband Systems in Canada. Available at SSRN 3357266 (2018).",
      "doi": ""
    },
    {
      "text": "The Mission to Seafarers. 2018. Seafarers' Happiness Index. (2018).",
      "doi": ""
    },
    {
      "text": "Deborah L Trout. 1980. The role of social isolation in suicide. Suicide and Life-Threatening Behavior 10, 1 (1980), 10--23.",
      "doi": ""
    },
    {
      "text": "Victor Turner. 1969. Liminality and communitas. The ritual process: Structure and anti-structure 94, 113 (1969), 125--30.",
      "doi": ""
    },
    {
      "text": "Victor Turner. 1987. Betwixt and between: The liminal period in rites of passage. Betwixt and between: Patterns of masculine and feminine initiation (1987), 3--19.",
      "doi": ""
    },
    {
      "text": "Arnold Van Gennep. 1909. The Rites of Passage (1960 edition. (1909).",
      "doi": ""
    },
    {
      "text": "Nagendra R. Velaga, Mark Beecroft, John D. Nelson, David Corsar, and Peter Edwards. 2012. Transport Poverty Meets the Digital Divide: Accessibility and Connectivity in Rural Communities. Journal of Transport Geography 21 (2012), 102--112.",
      "doi": ""
    },
    {
      "text": "Fie Velghe. 2013. Literacy acquisition, informal learning and mobile phones in a South African township. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. ACM, 89--99.",
      "doi": "10.1145/2516604.2516615"
    },
    {
      "text": "Sameer Verma and John P. Ryan. 2016. A Framework for Information Access in Rural and Remote Communities. In 2016 IEEE International Symposium on Technology and Society (ISTAS). IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Amee Morgans, Elizabeth Ozanne, and Lars Kulik. 2016. Not for me: Older adults choosing not to participate in a social isolation intervention. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 745--757.",
      "doi": "10.1145/2858036.2858458"
    },
    {
      "text": "Stephen Wensveen, Kees Overbeeke, and Tom Djajadiningrat. 2000. Touch me, hit me and I know how you feel: a design approach to emotionally rich interaction. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques. ACM, 48--52.",
      "doi": "10.1145/347642.347661"
    },
    {
      "text": "Eviatar Zerubavel. 1985. Hidden rhythms: Schedules and calendars in social life. University of California Press.",
      "doi": ""
    },
    {
      "text": "Minghua Zhao. 2002. Emotional labour in a globalised labour market: Seafarers on cruise ships. (2002).",
      "doi": ""
    }
  ]
}