{
  "doi": "10.1145/3313831.3376302",
  "title": "Designing IoT Resources to Support Outdoor Play for Children",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We describe a Research-through-Design (RtD) project that explores the Internet of Things (IoT) as a resource for children's free play outdoors. Based on initial insights from a design ethnography, we developed four RtD prototypes for social play in different scenarios of use outdoors, including congregating on a street or in a park to play physical games with IoT. We observed these prototypes in use by children in their free play in two community settings, and report on the qualitative analysis of our fieldwork. Our findings highlight the designs' material qualities that encouraged social and physical play under certain conditions, suggesting social affordances that are central to the success of IoT designs for free play outdoors. We provide directions for future research that addresses the challenges faced when deploying IoT with children, contributing new considerations for interaction design with children in outdoor settings and free play contexts.",
  "tags": [
    "outdoor play",
    "free play, pervasive play",
    "children",
    "internet of things",
    "digital playing out"
  ],
  "authors": [
    {
      "name": "Thomas Dylan",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659258037",
      "orcid": "missing"
    },
    {
      "name": "Gavin Wood",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479648974",
      "orcid": "missing"
    },
    {
      "name": "Abigail C. Durrant",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488179",
      "orcid": "0000-0003-4752-5376"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    },
    {
      "name": "Pablo E. Torres",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365313",
      "orcid": "missing"
    },
    {
      "name": "Philip I. N. Ulrich",
      "institution": "Canterbury Christ Church University, Canterbury, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365801",
      "orcid": "missing"
    },
    {
      "name": "Mutlu Cukurova",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-99659014735/rel-imgonly/screenshot2017-01-18at15.46.03.png",
      "acmid": "99659014735",
      "orcid": "missing"
    },
    {
      "name": "Amanda Carr",
      "institution": "Canterbury Christ Church University, Canterbury, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81458647430",
      "orcid": "missing"
    },
    {
      "name": "Sena Çerçi",
      "institution": "Northumbria University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659442174/rel-imgonly/sc.jpg",
      "acmid": "99659442174",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Guy Claxton and Margaret Carr. 2004. A framework for teaching learning: the dynamics of disposition. Early Years 24, 1: 87--97. https://doi.org/10.1080/09575140320001790898",
      "doi": ""
    },
    {
      "text": "Jon Back, Caspar Heeffer, Susan Paget, Andreas Rau, Eva Lotta Sallnäs Pysander, and Annika Waern. 2016. Designing for children's outdoor play. DIS 2016 Proceedings of the 2016 ACM Conference on Designing Interactive Systems: Fuse: 28--38. https://doi.org/10.1145/2901790.2901875",
      "doi": "10.1145/2901790.2901875"
    },
    {
      "text": "Jon Back, Laia Turmo Vidal, Annika Waern, Susan Paget, and Eva Lotta Sallnäs Pysander. 2018. Playing close to home: Interaction and emerging play in outdoor play installations. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3173574.3173730",
      "doi": "10.1145/3173574.3173730"
    },
    {
      "text": "Ed Baines and Peter Blatchford. 2012. Children's Games and Playground Activities in School and Their Role in Development. In The Oxford Handbook of the Development of Play. https://doi.org/10.1093/oxfordhb/9780195393002.013.0020",
      "doi": ""
    },
    {
      "text": "BBC. 2019. \"Hackable\" karaoke and walkie talkie toys found by Which? Retrieved from https://www.bbc.co.uk/news/technology-50686543",
      "doi": ""
    },
    {
      "text": "Colin Boreham and Chris Riddoch. 2001. The physical activity, fitness and health of children. Journal of Sports Sciences 19, 12: 915--929. https://doi.org/10.1080/026404101317108426",
      "doi": ""
    },
    {
      "text": "Mark Bridge, Anna Lombardi, and Sam Joiner. 2018. Smart toys are spying on children. The Times. Retrieved from https://www.thetimes.co.uk/article/smart-toys-spyingon-children-nc03d8xbm",
      "doi": ""
    },
    {
      "text": "Hillary L. Burdette, Robert C. Whitaker, and Stephen R. Daniels. 2004. Parental Report of Outdoor Playtime as a Measure of Physical Activity in Preschool-aged Children. Archives of Pediatrics and Adolescent Medicine. https://doi.org/10.1001/archpedi.158.4.353",
      "doi": ""
    },
    {
      "text": "J Busby. 1994. The Importance of Free Play: A Research Study of 'Free Play Time' in a Playground. Early Years 15, 1: 54--58. https://doi.org/10.1080/0957514940150109tle",
      "doi": ""
    },
    {
      "text": "Joy Cullen. 1993. Preschool children's use and perceptions of outdoor play areas. Early Child Development and Care 89, 1: 45--56. https://doi.org/10.1080/0300443930890104",
      "doi": ""
    },
    {
      "text": "Thomas Dylan, Abigail Durrant, Gavin Wood, Sena Çerçi, Denise Downey, Jonny Scott, John Vines, and Shaun Lawson. 2019. Play Poles: Towards IoT Resources for Outdoor Play. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 1293--1305. https://doi.org/10.1145/3322276.3323693",
      "doi": "10.1145/3322276.3323693"
    },
    {
      "text": "Daniel Fallman. 2008. The Interaction Design Research Triangle of Design Practice, Design Studies, and Design Exploration. Design Issues 24, 3: 4--18. https://doi.org/10.1162/desi.2008.24.3.4",
      "doi": ""
    },
    {
      "text": "Frost J. 2006. the Dissolution of Children'S Outdoor Play. 1--26.",
      "doi": ""
    },
    {
      "text": "Karla I. Galaviz, Deena Zytnick, Michelle C. Kegler, and Solveig A. Cunningham. 2016. Parental perception of neighborhood safety and children's physical activity. Journal of Physical Activity and Health 13, 10: 1110--1116. https://doi.org/10.1123/jpah.2015-0557",
      "doi": ""
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated portfolios. Interactions. https://doi.org/10.1145/2212877.2212889",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design? In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Angela Hanscom. 2016. Balanced and Barefoot: How Unrestricted Outdoor Play Makes for Strong, Confident, and Capable Children. . New Harbinger, UK.",
      "doi": ""
    },
    {
      "text": "Juliana Gruenwald Henderson. 2018. Electronic Toy Maker VTech Settles FTC Allegations That it Violated Children's Privacy Law and the FTC Act. Federal Trade Comission. Retrieved from https://www.ftc.gov/news-events/pressreleases/2018/01/electronic-toy-maker-vtech-settlesftc-allegations-it-violated",
      "doi": ""
    },
    {
      "text": "Trina Hinkley, Helen Brown, Valerie Carson, and Megan Teychenne. 2018. Cross sectional associations of screen time and outdoor play with social skills in preschool children. PLoS ONE. https://doi.org/10.1371/journal.pone.0193700",
      "doi": ""
    },
    {
      "text": "Trina Hinkley, Megan Teychenne, Katherine L. Downing, Kylie Ball, Jo Salmon, and Kylie D. Hesketh. 2014. Early childhood physical activity, sedentary behaviors and psychosocial well-being: A systematic review. Preventive Medicine. https://doi.org/10.1016/j.ypmed.2014.02.007",
      "doi": ""
    },
    {
      "text": "Tom Hitron, Itamar Apelblat, Iddo Wald, Eitan Moriano, Andrey Grishko, Idan David, Avihay Bar, and Oren Zuckerman. 2017. Scratch nodes: Coding outdoor play experiences to enhance social-physical interaction. In IDC 2017 - Proceedings of the 2017 ACM Conference on Interaction Design and Children. https://doi.org/10.1145/3078072.3084331",
      "doi": "10.1145/3078072.3084331"
    },
    {
      "text": "Tom Hitron, Andrey Grishko, Idan David, Iddo Yehoshua Wald, Oren Zuckerman, Netta Ofer, and Hadas Erel. 2018. Digital Outdoor play: Benefits and risks from an interaction design perspective. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3173574.3173858",
      "doi": "10.1145/3173574.3173858"
    },
    {
      "text": "J. Howard and K. Mcinnes. 2013. The impact of children's perception of an activity as play rather than not play on emotional well-being. Child: Care, Health and Development 39, 5: 737--742. https://doi.org/10.1111/j.1365--2214.2012.01405.x",
      "doi": ""
    },
    {
      "text": "Pam Jarvis, Stephen Newman, and Louise Swiniarski. 2014. On ?becoming social': the importance of collaborative free play in childhood. International Journal of Play. https://doi.org/10.1080/21594937.2013.863440",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Sophie Beck, Joe Finney, James Devine, and Joseph Lindley. 2019. A Scenario-Based Methodology for Exploring Risks: Children and Programmable IoT. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 751--761. https://doi.org/10.1145/3322276.3322315",
      "doi": "10.1145/3322276.3322315"
    },
    {
      "text": "Solana Larsen, Sam Burton, Kasia Odrozek, Stefan Back, and Jairus Khan. 2019. *Privacy Included: Rethinking the Smart Home. Mozilla Internet Health Report. Retrieved from https://foundation.mozilla.org/en/privacy-included/",
      "doi": ""
    },
    {
      "text": "Helen Little. 2015. Mothers' beliefs about risk and risk-taking in children's outdoor play. Journal of Adventure Education and Outdoor Learning 15, 1: 24--39. https://doi.org/10.1080/14729679.2013.842178",
      "doi": ""
    },
    {
      "text": "Helen Little and Shirley Wyver. 2008. Outdoor Play: Does Avoiding the Risks Reduce the Benefits? Australian Journal of Early Childhood 33.",
      "doi": ""
    },
    {
      "text": "JOHN H. McKENDRICK, MICHAEL G. BRADFORD, and ANNA V. FIELDER. 2000. Kid Customer?: Commercialization of Playspace and the Commodification of Childhood. Childhood 7, 3: 295-- 314. https://doi.org/10.1177/0907568200007003004",
      "doi": ""
    },
    {
      "text": "Stephen Moss. 2012. Natural Childhood. Swindon, UK. Retrieved from https://www.nationaltrust.org.uk/documents/read-ournatural-childhood-report.pdf",
      "doi": ""
    },
    {
      "text": "OfCom. 2013. Children and Parents: Media Use and Attitudes. Ofcom, October: 220. Retrieved from http://stakeholders.ofcom.org.uk/binaries/research/me dia-literacy/october-2013/research07Oct2013.pdf",
      "doi": ""
    },
    {
      "text": "Netta Ofer, Idan David, Hadas Erel, and Oren Zuckerman. 2019. Coding for Outdoor Play: A Coding Platform for Children to Invent and Enhance Outdoor Play Experiences. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 164:1--164:12. https://doi.org/10.1145/3290605.3300394",
      "doi": "10.1145/3290605.3300394"
    },
    {
      "text": "Sharon Anne Ogilvie-whyte. 2004. An Actor-Network Theory Approach.",
      "doi": ""
    },
    {
      "text": "Caterina Pesce, Ilaria Masci, Rosalba Marchetti, Spyridoula Vazou, Arja Sääkslahti, and Phillip D. Tomporowski. 2016. Deliberate play and preparation jointly benefit motor and cognitive development: Mediated and moderated effects. Frontiers in Psychology 7, MAR. https://doi.org/10.3389/fpsyg.2016.00349",
      "doi": ""
    },
    {
      "text": "Sue Robson and Victoria Rowe. 2012. Observing young children's creative thinking: Engagement, involvement and persistence. International Journal of Early Years Education. https://doi.org/10.1080/09669760.2012.743098",
      "doi": ""
    },
    {
      "text": "Joan Santer, Carol Griffi, and Deborah Goodall. 2007. Free Play in Early Childhood: A Literature Review. Play England: Making Space for Play. Retrieved from http://www.playengland.org.uk/media/120426/freeplay-in-early-childhood.pdf",
      "doi": ""
    },
    {
      "text": "Iris Soute, Susanne Lagerström, and Panos Markopoulos. 2013. Rapid prototyping of outdoor games for children in an iterative design process. In ACM International Conference Proceeding Series. https://doi.org/10.1145/2485760.2485779",
      "doi": "10.1145/2485760.2485779"
    },
    {
      "text": "Iris Soute, Panos Markopoulos, and Remco Magielse. 2010. Head Up Games: Combining the best of both worlds by merging traditional and digital play. Personal and Ubiquitous Computing 14, 5: 435--444. https://doi.org/10.1007/s00779-009-0265-0",
      "doi": "10.1007/s00779-009-0265-0"
    },
    {
      "text": "Michelle R. Stone and Guy E.J. Faulkner. 2014. Outdoor play in children: Associations with objectively-measured physical activity, sedentary behavior and weight status. Preventive Medicine. https://doi.org/10.1016/j.ypmed.2014.05.008",
      "doi": ""
    },
    {
      "text": "Liz Sutton. 2008. The State of Play: Disadvantage, Play and Children's Well-Being. Social Policy and Society. https://doi.org/10.1017/s147474640800448x",
      "doi": ""
    },
    {
      "text": "H Tovey. 2014. Exploring outdoor play in the early years. In T Maynard and J Waters (eds.). Open University Press, Maidenhead, 16--28.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia: An enquiry into design in a hospital setting. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/2207676.2208654",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Gavin Wood, Thomas Dylan, Abigail Durrant, Pablo E Torres, Philip Ulrich, Amanda Carr, Mutlu Cukurova, Denise Downey, Phil McGrath, Madeline Balaam, and et al. 2019. Designing for Digital Playing Out. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). https://doi.org/10.1145/3290605.3300909",
      "doi": ""
    }
  ]
}