{
  "doi": "10.1145/3313831.3376191",
  "title": "See No Evil, Hear No Evil, Speak No Evil: How Collegiate Players Define, Experience and Cope with Toxicity",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Toxicity in online environments is a complex and a systemic issue. Collegiate esports communities seem to be particularly vulnerable to toxic behaviors. In esports games, negative behavior, such as harassment, can create barriers to players achieving high performance and can reduce enjoyment which may cause them to leave the game. The aim of this study is to investigate how players define, experience and deal with toxicity in esports games that they play. Our findings from an interview study and five monthly follow ups with 19 participants from a university esports club show that players define toxicity as behaviors disrupt their morale and team dynamics, and are inclined to normalize negative behaviors, rationalize it as part of the competitive game culture akin to traditional sports, and participate a form of gamer classism, believing that toxicity is more common in lower level play than in professional and collegiate esports. There are many coping mechanisms employed by collegiate esports players, including ignoring offenders, deescalating tense encounters, and using tools to mute offenders. Understanding the motivations behind collegiate esports players' engagement with toxicity may help the growing sport plot a positive trajectory towards healthy play.",
  "authors": [
    {
      "name": "Selen Türkay",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501680550",
      "orcid": "missing"
    },
    {
      "name": "Jessica Formosa",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526951",
      "orcid": "missing"
    },
    {
      "name": "Sonam Adinolf",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501685317",
      "orcid": "missing"
    },
    {
      "name": "Robert Cuthbert",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659492950",
      "orcid": "missing"
    },
    {
      "name": "Roger Altizer",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430609654",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2018. Honor 2018 delivers checkpoints and more rewards | League of Legends. (2018). https://na.leagueoflegends.com/en/featured/honor",
      "doi": ""
    },
    {
      "text": "2019a. List of Competitive Rulings. (2019). https://lol.gamepedia.com/List_of_Competitive_Rulings",
      "doi": ""
    },
    {
      "text": "2019b. training.gov.au - SISSCOP308A - Model the responsibilities of an elite athlete. (2019). https://training.gov.au/Training/Details/SISSCOP308A",
      "doi": ""
    },
    {
      "text": "2019c. What does Tryharding mean? - League of Legends Community. (2019). http://forums.euw.leagueoflegends.com/board/ showthread.php?t=859940",
      "doi": ""
    },
    {
      "text": "Leigh Achterbosch, Charlynn Miller, and Peter Vamplew. 2017. A taxonomy of griefer type by motivation in massively multiplayer online role-playing games. Behaviour & Information Technology 36, 8 (2017), 846--860.",
      "doi": "10.1080/0144929X.2017.1306109"
    },
    {
      "text": "Paul JC Adachi and Teena Willoughby. 2011. The effect of video game competition and violence on aggressive behavior: Which characteristic has the greatest influence? Psychology of violence 1, 4 (2011), 259.",
      "doi": ""
    },
    {
      "text": "Sonam Adinolf and Selen Turkay. 2018. Toxic Behaviors in Esports Games: Player Perceptions and Coping Strategies. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. ACM, 365--372.",
      "doi": "10.1145/3270316.3271545"
    },
    {
      "text": "Monica Anderson, Aaron Smith, and Haley Nolan. 2018. A majority of teens have experienced some form of cyberbullying. Technical Report. Pew Research Center. 18 pages.",
      "doi": ""
    },
    {
      "text": "Sarah Basford. 2018. Four Professional \"Overwatch\" Players Have Been Punished for Toxic Behaviour · Student Edge News. (March 2018). https:// studentedge.org/article/four-overwatch-professionalplayers-have-been-punished-for-toxic-behaviour",
      "doi": ""
    },
    {
      "text": "Max V Birk, Benjamin Buttlar, Jason T Bowey, Susanne Poeller, Shelby C Thomson, Nicola Baumann, and Regan L Mandryk. 2016. The effects of social exclusion on play experience and hostile cognitions in digital games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3007--3019.",
      "doi": "10.1145/2858036.2858061"
    },
    {
      "text": "Jeremy Blackburn and Haewoon Kwak. 2014. Stfu noob!: predicting crowdsourced decisions on toxic behavior in online games. In Proceedings of the 23rd international conference on World wide web. ACM, 877--888.",
      "doi": "10.1145/2566486.2567987"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Nicholas Brody and Anita L Vangelisti. 2016. Bystander intervention in cyberbullying. Communication Monographs 83, 1 (2016), 94--119.",
      "doi": ""
    },
    {
      "text": "Florence Chee. 2006. The games we play online and offline: Making Wang-tta in Korea. Popular Communication 4, 3 (2006), 225--239.",
      "doi": ""
    },
    {
      "text": "Thomas Chesney, Iain Coyne, Brian Logan, and Neil Madden. 2009a. Griefing in virtual worlds: causes, casualties and coping strategies. Information Systems Journal 19, 6 (2009), 525--548. DOI: http://dx.doi.org/10.1111/j.1365--2575.2009.00330.x",
      "doi": ""
    },
    {
      "text": "Thomas Chesney, Iain Coyne, Brian Logan, and Neil Madden. 2009b. Griefing in virtual worlds: causes, casualties and coping strategies. Information Systems Journal 19, 6 (Nov. 2009), 525--548. DOI: http://dx.doi.org/10.1111/j.1365--2575.2009.00330.x",
      "doi": ""
    },
    {
      "text": "Boungho Choi and Soowon Park. 2018. Who becomes a bullying perpetrator after the experience of bullying victimization? The moderating role of self-esteem. Journal of youth and adolescence 47, 11 (2018), 2414--2423.",
      "doi": ""
    },
    {
      "text": "Mia Consalvo. 2012. Confronting toxic gamer culture: A challenge for feminist game studies scholars. (Nov. 2012). https://adanewmedia.org/2012/11/issue1-consalvo/",
      "doi": ""
    },
    {
      "text": "Christine Cook, Juliette Schaafsma, and Marjolijn Antheunis. 2018. Under the bridge: An in-depth examination of online trolling in the gaming context. new media & society 20, 9 (2018), 3323--3340.",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2012. Counter-Strike: Global Offensive. (2012). http://blog.counter-strike.net",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2018. Dota 2. (2018). http://www.dota2.com/international/battlepass",
      "doi": ""
    },
    {
      "text": "Amanda C Cote. 2017. \"I Can Defend Myself\" Women's Strategies for Coping With Harassment While Gaming Online. Games and Culture 12, 2 (2017), 136--155.",
      "doi": ""
    },
    {
      "text": "Joaquim Alvino de Mesquita Neto and Karin Becker. 2018a. Relating conversational topics and toxic behavior effects in a MOBA game. Entertainment Computing 26 (2018), 10 -- 29. DOI: http://dx.doi.org/https://doi.org/10.1016/j.entcom.2017.12.004",
      "doi": ""
    },
    {
      "text": "Joaquim Alvino de Mesquita Neto and Karin Becker. 2018b. Relating conversational topics and toxic behavior effects in a MOBA game. Entertainment computing 26 (2018), 10--29.",
      "doi": ""
    },
    {
      "text": "Julian Dibbell. 1994. A rape in cyberspace or how an evil clown, a Haitian trickster spirit, two wizards, and a cast of dozens turned a database into a society. Ann. Surv. Am. L. (1994), 471.",
      "doi": ""
    },
    {
      "text": "Scott Donaldson. 2017a. I Predict a Riot: Making and Breaking Rules and Norms in League of Legends. In Proceedings of DiGRA 2017. 11.",
      "doi": ""
    },
    {
      "text": "Scott Donaldson. 2017b. Mechanics and Metagame: Exploring Binary Expertise in League of Legends. Games and Culture 12, 5 (July 2017), 426--444. DOI: http://dx.doi.org/10.1177/1555412015590063",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017. Online harassment 2017. (2017).",
      "doi": ""
    },
    {
      "text": "David R. Ewoldsen, Cassie A. Eno, Bradley M. Okdie, John A. Velez, Rosanna E. Guadagno, and Jamie DeCoster. 2012. Effect of Playing Violent Video Games Cooperatively or Competitively on Subsequent Cooperative Behavior. Cyberpsychology, Behavior, and Social Networking 15, 5 (May 2012), 277--280. DOI: http://dx.doi.org/10.1089/cyber.2011.0308",
      "doi": ""
    },
    {
      "text": "Chek Yang Foo and Elina M. I. Koivisto. 2004. Defining Grief Play in MMORPGs: Player and Developer Perceptions. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, NY, NY, USA, 245--250. DOI: http://dx.doi.org/10.1145/1067343.1067375",
      "doi": "10.1145/1067343.1067375"
    },
    {
      "text": "Jesse Fox, Michael Gilbert, and Wai Yen Tang. 2018. Player experiences in a massively multiplayer online game: A diary study of performance, motivation, and social interaction. New Media & Society 20, 11 (2018), 4056--4073.",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2017. eSports as an emerging research context at CHI: Diverse perspectives on definitions. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1601--1608.",
      "doi": "10.1145/3027063.3053158"
    },
    {
      "text": "Riot Games. 2018. League of Legends. (2018). https://na.leagueoflegends.com/en/",
      "doi": ""
    },
    {
      "text": "Riot Games. 2019. Tilt Types - Riot Games Player Support. (2019). https://tilttypes.riotgames.com/en-us/p/1",
      "doi": ""
    },
    {
      "text": "Emily Gera. 2019. EA Donates $1 Million to Fight Against Online Toxicity -- Variety. (2019). https://variety.com/2019/gaming/news/ea-onlinetoxicity-bullying-1203232413/",
      "doi": ""
    },
    {
      "text": "Martin Gibbs, Marcus Carter, David Cumming, Robbie Fordyce, and Emma Witkowski. 2018. Esports Spectatorship in Australia Networked Society Institute Research Paper. Research. 34 pages.",
      "doi": ""
    },
    {
      "text": "Juho Hamari and Max Sjöblom. 2017. What is eSports and why do people watch it? Internet research 27, 2 (2017), 211--232.",
      "doi": ""
    },
    {
      "text": "Vic Hood. 2017. Blizzard's Jeff Kaplan says toxic behaviour is slowing Overwatch development. (Sept. 2017). http://tiny.cc/d4i04y",
      "doi": ""
    },
    {
      "text": "Jeremy Hsu. 2015. Inside the Largest Virtual Psychology Lab in the World | Backchannel. Wired (Jan. 2015). https://www.wired.com/2015/01/inside-thelargest-virtual-psychology-lab-in-the-world/",
      "doi": ""
    },
    {
      "text": "Blizzard Inc. 2018a. Hearthstone. (2018). https://playhearthstone.com/en-us/",
      "doi": ""
    },
    {
      "text": "Blizzard Inc. 2018b. Overwatch. (2018). https://playoverwatch.com/en-us/",
      "doi": ""
    },
    {
      "text": "Michael M Kasumovic and Jeffrey H Kuznekoff. 2015. Insights into sexism: Male status and performance moderates female-directed hostile and amicable behaviour. PloS one 10, 7 (2015), e0131613.",
      "doi": ""
    },
    {
      "text": "Bastian Kordyaka. 2018. Digital Poison ?Approaching a Theory of Toxic Behavior in MOBA games. (2018).",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Xinning Gui, Shaozeng Zhang, and Bonnie Nardi. 2017. Managing Disruptive Behavior Through Non-Hierarchical Governance: Crowdsourcing in League of Legends and Weibo. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 62 (Dec. 2017), 17 pages. DOI: http://dx.doi.org/10.1145/3134697",
      "doi": "10.1145/3134697"
    },
    {
      "text": "Ben Kuchera. 2014. Blizzard silenced Hearthstone players, and it made the game amazing. (April 2014). https://www.polygon.com/2014/4/18/5625802/hearthstonechat-Blizzard",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak and Jeremy Blackburn. 2015. Linguistic Analysis of Toxic Behavior in an Online Video Game. In Social Informatics, Luca Maria Aiello and Daniel McFarland (Eds.). Springer International Publishing, Cham, 209--217.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015a. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3739--3748. DOI: http://dx.doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015b. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, Seoul, Republic of Korea, 3739--3748. DOI: http://dx.doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Jesse Ladanyi and Susann Doyle-Portillo. 2017. The development and validation of the Grief Play Scale (GPS) in MMORPGs. Personality and Individual Differences 114 (2017), 125--133.",
      "doi": ""
    },
    {
      "text": "Evan Lahti. 2016. If you type 'gg ez' in Overwatch, prepare to look like even more of a loser. (Aug. 2016). https://www.pcgamer.com/au/gg-ez-overwatch/",
      "doi": ""
    },
    {
      "text": "Holin Lin and Chuen-Tsai Sun. 2005. The \"White-Eyed\" Player Culture: Grief Play and Construction of Deviance in MMORPGs. In DiGRA Conference. http://summit.sfu.ca/item/238",
      "doi": ""
    },
    {
      "text": "Topias Mattinen and Joseph Macey. 2018. Online Abuse and Age in Dota 2. In Proceedings of the 22Nd International Academic Mindtrek Conference (Mindtrek '18). ACM, NY, NY, USA, 69--78. DOI: http://dx.doi.org/10.1145/3275116.3275149 event-place: Tampere, Finland.",
      "doi": "10.1145/3275116.3275149"
    },
    {
      "text": "P Maymin, Chief Analytics Officer, and Vantage Sports. An open-sourced optical tracking and advanced eSports analytics platform for League of Legends. In 2018 MIT Sloan Sports Analytics Conference, Vol. 18.",
      "doi": ""
    },
    {
      "text": "SGB Media. 2019. More Than 70 Percent Of Schools Considering An Esports Program | SGB Media Online. (2019). https://sgbonline.com/more-than-70-percent-ofschools-considering-an-esports-program/",
      "doi": ""
    },
    {
      "text": "Kathleen E Miller. 2009. Sport-related identities and the ?toxic jock\". Journal of Sport Behavior 32, 1 (2009), 69.",
      "doi": ""
    },
    {
      "text": "Joaquim AM Neto, Kazuki M Yokoyama, and Karin Becker. 2017. Studying toxic behavior influence and player chat in an online video game. In Proceedings of the International Conference on Web Intelligence. ACM, 26--33.",
      "doi": "10.1145/3106426.3106452"
    },
    {
      "text": "Thomas E Page, Afroditi Pina, and Roger Giner-Sorolla. 2016. \"It was only harmless banter!\" The development and preliminary validation of the moral disengagement in sexual harassment scale. Aggressive behavior 42, 3 (2016), 254--273.",
      "doi": ""
    },
    {
      "text": "Kunwoo Park, Meeyoung Cha, Haewoon Kwak, and Kuan-Ta Chen. 2017. Achievement and friends: Key factors of player retention vary across player levels in online multiplayer games. In Proceedings of the 26th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 445--453.",
      "doi": "10.1145/3041021.3054176"
    },
    {
      "text": "Antti Eemeli Pohjanen. 2018. Report, please! A survey on players' perceptions towards the tools for ghting toxic behavior in competitive online multiplayer video games. (2018), 92.",
      "doi": ""
    },
    {
      "text": "Psyonix. 2018. Rocket League. (2018). https://www.rocketleague.com/",
      "doi": ""
    },
    {
      "text": "Stephen D Reicher, Russell Spears, and Tom Postmes. 1995. A social identity model of deindividuation phenomena. European review of social psychology 6, 1 (1995), 161--198. DOI:http://dx.doi.org/10.1080/14792779443000049",
      "doi": ""
    },
    {
      "text": "Victoria L Rubin and Sarah C Camm. 2013. Deception in video games: examining varieties of griefing. Online Information Review 37, 3 (2013), 369--387.",
      "doi": ""
    },
    {
      "text": "David Schwartz. 2000. Subtypes of victims and aggressors in children's peer groups. Journal of abnormal child psychology 28, 2 (2000), 181--192.",
      "doi": ""
    },
    {
      "text": "Kenneth B. Shores, Yilin He, Kristina L. Swanenburg, Robert Kraut, and John Riedl. 2014. The Identification of Deviance and Its Impact on Retention in a Multiplayer Game. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1356--1365. DOI: http://dx.doi.org/10.1145/2531602.2531724",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Petr Slovák, Christopher Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective Practicum: A Framework of Sensitising Concepts to Design for Transformative Reflection. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, Denver, Colorado, USA, 2696--2707. DOI: http://dx.doi.org/10.1145/3025453.3025516",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "John Suler. 2004. The online disinhibition effect. Cyberpsychology & behavior 7, 3 (2004), 321--326.",
      "doi": ""
    },
    {
      "text": "Henri Tajfel, John C Turner, William G Austin, and Stephen Worchel. 1979. An integrative theory of intergroup conflict. Organizational identity: A reader (1979), 56--65.",
      "doi": ""
    },
    {
      "text": "Wai Yen Tang and Jesse Fox. 2016. Men's harassment behavior in online video games: Personality traits and game factors. Aggressive behavior 42, 6 (2016), 513--521.",
      "doi": ""
    },
    {
      "text": "T. L. Taylor. 2012. Raising the Stakes: E-Sports and the Professionalization of Computer Gaming. MIT Press. Google-Books-ID: CiL8aPrSeKcC.",
      "doi": "10.5555/2209770"
    },
    {
      "text": "Scott Thacker and Mark D Griffiths. 2012. An exploratory study of trolling in online video gaming. International Journal of Cyber Behavior, Psychology and Learning (IJCBPL) 2, 4 (2012), 17--33.",
      "doi": "10.4018/ijcbpl.2012100102"
    },
    {
      "text": "Selen Türkay and Sonam Adinolf. 2019. Friending toFlame: How Social Features Affect Player Behaviors in an Online Collectible Card Game. InProceedings of the2019 CHI Conference on Human Factors in ComputingSystems. ACM, Glasgow, 337.",
      "doi": ""
    },
    {
      "text": "April Tyack, Peta Wyeth, and Daniel Johnson. 2016. The appeal of MOBA games: What makes people start, stay, and stop. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, 313--325.",
      "doi": "10.1145/2967934.2968098"
    },
    {
      "text": "Kellie Vella, Madison Klarkowski, Selen Turkay, andDaniel Johnson. 2019. Making friends in online games:gender differences and designing for greater socialconnectedness.Behaviour & Information Technology(2019), 1--18.DOI:http://dx.doi.org/10.1080/0144929X.2019.1625442",
      "doi": ""
    },
    {
      "text": "Bernard Weiner. 1980. A cognitive (attribution)-emotion-action model of motivated behavior: An analysis of judgments of help-giving. Journal of Personality and Social psychology 39, 2 (1980), 186.",
      "doi": ""
    },
    {
      "text": "Emma Witkowski, Brett Hutchins, and Marcus Carter. 2013. E-sports on the Rise?: Critical Considerations on the Growth and Erosion of Organized Digital Gaming Competitions. In Proceedings of The 9th Australasian Conference on Interactive Entertainment: Matters of Life and Death (IE '13). ACM, NY, NY, USA, Article 43, 2 pages. DOI: http://dx.doi.org/10.1145/2513002.2513008",
      "doi": "10.1145/2513002.2513008"
    }
  ]
}