{
  "doi": "10.1145/3313831.3376594",
  "title": "Prehabilitation: Care Challenges and Technological Opportunities",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Millions of surgeries are performed in the US annually, and numbers are trending upwards. Traditional rehabilitative interventions are struggling to meet current demands, and researchers have turned to pre-operative interventions, or prehabilitation, to improve patient functions. However, existing literature primarily discusses efficacy or the use of commercial sensing devices, and lacks a clear comprehension of healthcare professionals' (HPs') needs and perspectives. User-centered stakeholder understandings are crucial for a technology's adoption, but prehabilitation literature lacks such understandings. Therefore we conduct semi-structured interviews with 12 prehabilitation healthcare professionals (HPs) to offer descriptions of care challenges, tool usage, and perspectives regarding suitable and effective technologies. These data can assist designers in fostering prehabilitation processes via tailored prehabilitation tools which meet HPs' needs and expectations.",
  "tags": [
    "surgical care",
    "physical health",
    "user-centered design",
    "prehabilitation",
    "rehabilitation",
    "psychological health",
    "nutritional health"
  ],
  "authors": [
    {
      "name": "Haining Zhu",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-99659161075/rel-imgonly/hainingzhu.jpg",
      "acmid": "99659161075",
      "orcid": "missing"
    },
    {
      "name": "Zachary J. Moffa",
      "institution": "Independent Researcher, Huntingdon, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659305418",
      "orcid": "missing"
    },
    {
      "name": "Xinning Gui",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-99658649184/rel-imgonly/with_melon_2.jpeg",
      "acmid": "99658649184",
      "orcid": "0000-0002-9436-7940"
    },
    {
      "name": "John M. Carroll",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2010. Surgery statistics. http://www.hopkinsmedicine.org/healthlibrary/conditions/ surgical_care/surgery_statistics_85,P01412/. (2010). Accessed: 2019-01--24.",
      "doi": ""
    },
    {
      "text": "2019. strong for surgery. https://www.facs.org/quality-programs/strong-for-surgery. (2019). Accessed: 2019-01--24.",
      "doi": ""
    },
    {
      "text": "Phil Adams, Elizabeth L Murnane, Michael Elfenbein, Elaine Wethington, and Geri Gay. 2017. Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1065--1077.",
      "doi": "10.1145/3025453.3025832"
    },
    {
      "text": "William B Applegate, John P Blass, and T Franklin Williams. 1990. Instruments for the functional assessment of older patients. New England Journal of Medicine 322, 17 (1990), 1207--1214.",
      "doi": ""
    },
    {
      "text": "Heather M Arthur, Charlotte Daniels, Robert McKelvie, Jack Hirsh, and Bonnie Rush. 2000. Effect of a preoperative intervention on preoperative and postoperative outcomes in low-risk patients awaiting elective coronary artery bypass graft surgery: a randomized, controlled trial. Annals of internal medicine 133, 4 (2000), 253--262.",
      "doi": ""
    },
    {
      "text": "Naveen Bagalkot and Tomas Sokoler. 2011a. MagicMirror: towards enhancing collaborative rehabilitation practices. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 593--596.",
      "doi": "10.1145/1958824.1958922"
    },
    {
      "text": "Naveen Bagalkot and Tomas Sokoler. 2011b. MyReDiary: co-designing for collaborative articulation in physical rehabilitation. In ECSCW 2011: Proceedings of the 12th European Conference on Computer Supported Cooperative Work, 24--28 September 2011, Aarhus Denmark. Springer, 121--132.",
      "doi": ""
    },
    {
      "text": "Gustavo Bajotto and Yoshiharu Shimomura. 2006. Determinants of disuse-induced skeletal muscle atrophy: exercise and nutrition countermeasures to prevent protein loss. Journal of nutritional science and vitaminology 52, 4 (2006), 233--247.",
      "doi": ""
    },
    {
      "text": "Fiona J Baldwin, Denise Hinge, Joanna Dorsett, and Owen F Boyd. 2009. Quality of life and persisting symptoms in intensive care unit survivors: implications for care after discharge. BMC research notes 2, 1 (2009), 160.",
      "doi": ""
    },
    {
      "text": "Olumuyiwa A Bamgbade, Timothy W Rutter, Olubukola O Nafiu, and Pema Dorje. 2007. Postoperative complications in obese and nonobese patients. World journal of surgery 31, 3 (2007), 556--560.",
      "doi": ""
    },
    {
      "text": "Margaux Barnes, E Plaisance, L Hanks, and K Casazza. 2016. Pre-habilitation-promoting exercise in adolescent and young adult cancer survivors for improving lifelong health-a narrative review. Cancer Res Front 2 (2016), 22--32.",
      "doi": ""
    },
    {
      "text": "Sandra F Bassett and Keith J Petrie. 1999. The effect of treatment goals on patient compliance with physiotherapy exercise programmes. Physiotherapy 85, 3 (1999), 130--137.",
      "doi": ""
    },
    {
      "text": "Muhammad S Beg, Arjun Gupta, Tyler Stewart, and Chad D Rethorst. 2017. Promise of wearable physical activity monitors in oncology practice. Journal of oncology practice 13, 2 (2017), 82--89.",
      "doi": ""
    },
    {
      "text": "ML Bird, J Cannell, ML Callisaya, E Moles, A Rathjen, K Lane, A Tyson, and S Smith. 2016. \"FIND Technology\": investigating the feasibility, efficacy and safety of controller-free interactive digital rehabilitation technology in an inpatient stroke population: study protocol for a randomized controlled trial. Trials 17, 1 (2016), 203.",
      "doi": ""
    },
    {
      "text": "Guillaume Bousquet-Dion, Rashami Awasthi, Sarah-Ève Loiselle, Enrico M Minnella, Ramanakumar V Agnihotram, Andreas Bergdahl, Francesco Carli, and Celena Scheede-Bergdahl. 2018. Evaluation of supervised multimodal prehabilitation programme in cancer patients undergoing colorectal resection: a randomized control trial. Acta Oncologica (2018), 1--11.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "ERJ Bruns, Bert van den Heuvel, CJ Buskens, P Van Duijvendijk, Sebastiaan Festen, EB Wassenaar, ES van der Zaag, WA Bemelman, and Barbara C van Munster. 2016. The effects of physical prehabilitation in elderly patients undergoing colorectal surgery: a systematic review. Colorectal Disease 18, 8 (2016), O267--O277.",
      "doi": ""
    },
    {
      "text": "Ay¸ se G Büyüktür and Mark S Ackerman. 2017. Information Work in Bone Marrow Transplant: Reducing Misalignment of Perspectives. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 1740--1752.",
      "doi": ""
    },
    {
      "text": "F Carli, P Charlebois, B Stein, L Feldman, G Zavorsky, DJ Kim, S Scott, and NE Mayo. 2010. Randomized clinical trial of prehabilitation in colorectal surgery. British Journal of Surgery 97, 8 (2010), 1187--1197.",
      "doi": ""
    },
    {
      "text": "Yu Chen, Yunan Chen, Mirana Michelle Randriambelonoro, Antoine Geissbuhler, and Pearl Pu. 2017. Design Considerations for Social Fitness Applications: Comparing Chronically Ill Patients and Healthy Adults. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 1753--1762.",
      "doi": "10.1145/2998181.2998350"
    },
    {
      "text": "Yunan Chen, Victor Ngo, Sidney Harrison, and Victoria Duong. 2011. Unpacking exam-room computing: negotiating computer-use in patient-physician interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3343--3352.",
      "doi": "10.1145/1978942.1979438"
    },
    {
      "text": "T Christensen, T Bendix, and H Kehlet. 1982. Fatigue and cardiorespiratory function following abdominal surgery. British Journal of Surgery 69, 7 (1982), 417--419.",
      "doi": ""
    },
    {
      "text": "Luis Cuadros, Hilmy Ismail, and Kwok Ho. 2017. Evaluation of reliability of MYZONE MZ-3 heart rate monitor: A study for the future of telephysiotherapy for preoperative prehabilitation in cancer patients. TELEMEDICINE and e-HEALTH 23, 4 (2017), 334--338.",
      "doi": ""
    },
    {
      "text": "JN Darvall, A Parker, and DA Story. 2016. Feasibility and acceptability of remotely monitored pedometer-guided physical activity. Anaesthesia and intensive care 44, 4 (2016), 501--506.",
      "doi": ""
    },
    {
      "text": "Aneta Dimoska, Phyllis N Butow, Jodi Lynch, Elizabeth Hovey, Meera Agar, Philip Beale, and Martin HN Tattersall. 2012. Implementing patient question-prompt lists into routine cancer care. Patient education and counseling 86, 2 (2012), 252--258.",
      "doi": ""
    },
    {
      "text": "Patrick Doiron-Cadrin, Dahlia Kairy, Pascal-André Vendittoli, Véronique Lowry, Stéphane Poitras, and François Desmeules. 2018. Feasibility and preliminary effects of a tele-prehabilitation program and an in-person prehablitation program compared to usual care for total hip or knee arthroplasty candidates: a pilot randomized controlled trial. Disability and rehabilitation (2018), 1--10.",
      "doi": ""
    },
    {
      "text": "Elisabeth J Driessen, Marieke E Peeters, Bart C Bongers, Huub A Maas, Gerbern P Bootsma, Nico L van Meeteren, and Maryska L Janssen-Heijnen. 2017. Effects of prehabilitation and rehabilitation including a home-based component on physical fitness, adherence, treatment tolerance, and recovery in patients with non-small cell lung cancer: A systematic review. Critical reviews in oncology/hematology 114 (2017), 63--76.",
      "doi": ""
    },
    {
      "text": "Vanessa Ferreira, Ramanakumar V Agnihotram, Andreas Bergdahl, Stefanus J van Rooijen, Rashami Awasthi, Francesco Carli, and Celena Scheede-Bergdahl. 2018. Maximizing patient adherence to prehabilitation: what do the patients say? Supportive Care in Cancer (2018), 1--7.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control, Prevention (CDC, and others. 2003. Trends in aging--United States and worldwide. MMWR. Morbidity and mortality weekly report 52, 6 (2003), 101.",
      "doi": ""
    },
    {
      "text": "Richard Frankel, Andrea Altschuler, Sheba George, James Kinsman, Holly Jimison, Nan R Robertson, and John Hsu. 2005. Effects of exam-room computing on clinician-patient communication. Journal of general internal medicine 20, 8 (2005), 677--682.",
      "doi": ""
    },
    {
      "text": "Thomas M Gill, Dorothy I Baker, Margaret Gottschalk, Evelyne A Gahbauer, Peter A Charpentier, Paul T de Regt, and Sarah J Wallace. 2003. A prehabilitation program for physically frail community-living older persons. Archives of physical medicine and rehabilitation 84, 3 (2003), 394--404.",
      "doi": ""
    },
    {
      "text": "Chelsia Gillis, Chao Li, Lawrence Lee, Rashami Awasthi, Berson Augustin, Ann Gamsa, A Sender Liberman, Barry Stein, Patrick Charlebois, Liane S Feldman, and others. 2014. Prehabilitation versus RehabilitationA Randomized Control Trial in Patients Undergoing Colorectal Resection for Cancer. The Journal of the American Society of Anesthesiologists 121, 5 (2014), 937--947.",
      "doi": ""
    },
    {
      "text": "Inger Hallberg, Agneta Ranerup, and K Kjellgren. 2016. Supporting the self-management of hypertension: Patients' experiences of using a mobile phone-based system. Journal of human hypertension 30, 2 (2016).",
      "doi": ""
    },
    {
      "text": "Yasser Hijazi, Umair Gondal, and Omer Aziz. 2017. A systematic review of prehabilitation programs in abdominal cancer surgery. International journal of surgery 39 (2017), 156--162.",
      "doi": ""
    },
    {
      "text": "Christopher S Hollenbeak, Judith R Lave, Timothy Zeddies, Yanfen Pei, Constance E Roland, and Eugene F Sun. 2006. Factors associated with risk of surgical wound infections. American Journal of Medical Quality 21, 6_suppl (2006), 29S--34S.",
      "doi": ""
    },
    {
      "text": "Erik HJ Hulzebos, Nico LU Van Meeteren, Rob A De Bie, Pieter C Dagnelie, and Paul JM Helders. 2003. Prediction of postoperative pulmonary complications on the basis of preoperative risk factors in patients who had undergone coronary artery bypass graft surgery. Physical Therapy 83, 1 (2003), 8.",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, Jeremy Johnson, and Elizabeth D Mynatt. 2018. MyPath: Investigating Breast Cancer Patients' Use of Personalized Health Information. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 78.",
      "doi": "10.1145/3274347"
    },
    {
      "text": "Elizabeth Kaziunas, Ayse G Buyuktur, Jasmine Jones, Sung W Choi, David A Hanauer, and Mark S Ackerman. 2015. Transition and reflection in the use of health information: the case of pediatric bone marrow transplant caregivers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1763--1774.",
      "doi": "10.1145/2675133.2675276"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack: A Flexible Self-Tracking Approach Leveraging Semi-Automated Tracking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 67.",
      "doi": "10.1145/3130930"
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3063--3072.",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Patrick Kortebein. 2009. Rehabilitation for hospital-associated deconditioning. American journal of physical medicine & rehabilitation 88, 1 (2009), 66--77.",
      "doi": ""
    },
    {
      "text": "Valerie A Lawrence, Helen P Hazuda, John E Cornell, Thomas Pederson, Patrick T Bradshaw, Cynthia D Mulrow, and Carey P Page. 2004. Functional independence after major abdominal surgery in the elderly. Journal of the American College of Surgeons 199, 5 (2004), 762--772.",
      "doi": ""
    },
    {
      "text": "Alison Luther, Joseph Gabriel, Richard P Watson, and Nader K Francis. 2018. The impact of total body prehabilitation on post-operative outcomes after major abdominal surgery: a systematic review. World journal of surgery 42, 9 (2018), 2781--2791.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 477--486.",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "F Michard, TJ Gan, and H Kehlet. 2017. Digital innovations and emerging technologies for enhanced recovery programmes. BJA: British Journal of Anaesthesia 119, 1 (2017), 31--39.",
      "doi": ""
    },
    {
      "text": "Truls Østbye, Kimberly SH Yarnall, Katrina M Krause, Kathryn I Pollak, Margaret Gradison, and J Lloyd Michener. 2005. Is there time for management of patients with chronic diseases in primary care? The Annals of Family Medicine 3, 3 (2005), 209--214.",
      "doi": ""
    },
    {
      "text": "Sun Young Park, So Young Lee, and Yunan Chen. 2012. The effects of EMR deployment on doctors' work practices: A qualitative study in the emergency department of a teaching hospital. International journal of medical informatics 81, 3 (2012), 204--217.",
      "doi": ""
    },
    {
      "text": "Shyamal Patel, Hyung Park, Paolo Bonato, Leighton Chan, and Mary Rodgers. 2012. A review of wearable sensors and systems with application in rehabilitation. Journal of neuroengineering and rehabilitation 9, 1 (2012), 21.",
      "doi": ""
    },
    {
      "text": "Thomas N Robinson, Daniel S Wu, Lauren Pointer, Christina L Dunn, Joseph C Cleveland Jr, and Marc Moss. 2013. Simple frailty score predicts postoperative complications across surgical specialties. The American Journal of Surgery 206, 4 (2013), 544--550.",
      "doi": ""
    },
    {
      "text": "Daniel S Rooks, Jie Huang, Benjamin E Bierbaum, Sarah A Bolus, James Rubano, Christine E Connolly, Sandra Alpert, Maura D Iversen, and Jeffrey N Katz. 2006. Effect of preoperative exercise on measures of functional status in men and women undergoing total hip and knee arthroplasty. Arthritis Care & Research: Official Journal of the American College of Rheumatology 55, 5 (2006), 700--708.",
      "doi": ""
    },
    {
      "text": "Leonard G Rowntree. 1942. Rehabilitation and Prehabilitation. Journal of the American Medical Association 119, 15 (1942), 1171--1175.",
      "doi": ""
    },
    {
      "text": "Kristen K Rumer, Anirudh Saraswathula, and Marc L Melcher. 2016. Prehabilitation in our most frail surgical patients: are wearable fitness devices the next frontier? Current opinion in organ transplantation 21, 2 (2016), 188--193.",
      "doi": ""
    },
    {
      "text": "Neha Sathe, Anil Hiwale, and Rashmi Phalnikar. 2018. Pre-Habilitation and Wellness through Gait Analysis using Body Worn Sensors. In Proceedings of the 2018 International Conference on Communication Engineering and Technology. ACM, 38--40.",
      "doi": "10.1145/3194244.3194258"
    },
    {
      "text": "Julie K Silver. 2014. Cancer rehabilitation and prehabilitation may reduce disability and early retirement. Cancer 120, 14 (2014), 2072--2076.",
      "doi": ""
    },
    {
      "text": "Julie K Silver. 2015. Cancer prehabilitation and its role in improving health outcomes and reducing health care costs. In Seminars in oncology nursing, Vol. 31. Elsevier, 13--30.",
      "doi": ""
    },
    {
      "text": "Julie K Silver and Jennifer Baima. 2013. Cancer prehabilitation: an opportunity to decrease treatment-related morbidity, increase cancer treatment options, and improve physical and psychological health outcomes. American Journal of Physical Medicine & Rehabilitation 92, 8 (2013), 715--727.",
      "doi": ""
    },
    {
      "text": "Jonathan P Singer, Allison Soong, Allan Bruun, Steven Hays, Jasleen Kukreja, Ayana Bracha, Gregory Chin, Paul J Wolters, Michael Peters, and Christine M Garvey. 2017. \"pre-Habilitation\" Of Frail Candidates For Lung Transplantation Using A Mobile Health Enabled Home-Based Intervention Is Feasible And Safe. In A70. PULMONARY REHABILITATION IN LUNG TRANSPLANTATION AND THE ACUTE SETTING. American Thoracic Society, A2342--A2342.",
      "doi": ""
    },
    {
      "text": "Enrique V Smith-Forbes, Dana M Howell, Jason Willoughby, Hilary Armstrong, Donald G Pitts, and Tim L Uhl. 2016. Adherence of individuals in upper extremity rehabilitation: a qualitative study. Archives of physical medicine and rehabilitation 97, 8 (2016), 1262--1268.",
      "doi": ""
    },
    {
      "text": "Dorothee Twardella, Henrike Merx, Harry Hahmann, Bernd Wüsten, Dietrich Rothenbacher, and Hermann Brenner. 2006. Long term adherence to dietary recommendations after inpatient rehabilitation: prospective follow up study of patients with coronary heart disease. Heart 92, 5 (2006), 635--640.",
      "doi": ""
    },
    {
      "text": "Giampaolo Ugolini, Federico Ghignone, Davide Zattoni, Giacomo Veronese, and Isacco Montroni. 2014. Personalized surgical management of colorectal cancer in elderly population. World journal of gastroenterology: WJG 20, 14 (2014), 3762.",
      "doi": ""
    },
    {
      "text": "Kenton T Unruh, Meredith Skeels, Andrea Civan-Hartzler, and Wanda Pratt. 2010. Transforming clinic environments into information workspaces for patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 183--192.",
      "doi": "10.1145/1753326.1753354"
    },
    {
      "text": "Karin Valkenet, Ingrid GL van de Port, Jaap J Dronkers, Wouter R de Vries, Eline Lindeman, and Frank JG Backx. 2011. The effects of preoperative exercise therapy on postoperative outcome: a systematic review. Clinical rehabilitation 25, 2 (2011), 99--111.",
      "doi": ""
    },
    {
      "text": "Gregg C Vanderheiden. 1987. Service delivery mechanisms in rehabilitation technology. American Journal of Occupational Therapy 41, 11 (1987), 703--710.",
      "doi": ""
    },
    {
      "text": "Christine Vogeli, Alexandra E Shields, Todd A Lee, Teresa B Gibson, William D Marder, Kevin B Weiss, and David Blumenthal. 2007. Multiple chronic conditions: prevalence, health consequences, and implications for quality, care management, and costs. Journal of general internal medicine 22, 3 (2007), 391--395.",
      "doi": ""
    },
    {
      "text": "René Vonlanthen, Ksenija Slankamenac, Stefan Breitenstein, Milo A Puhan, Markus K Muller, Dieter Hahnloser, Dimitri Hauri, Rolf Graf, and Pierre-Alain Clavien. 2011. The impact of complications on costs of major surgical procedures: a cost analysis of 1200 patients. Annals of surgery 254, 6 (2011), 907--913.",
      "doi": ""
    },
    {
      "text": "Paul Wicks, Stacey McCaffrey, Kim Goodwin, Ryan Black, Michael Hoole, and James Heywood. 2019. A Modular Health-Related Quality of Life Instrument for Electronic Assessment and Treatment Monitoring: Web-Based Development and Psychometric Validation of Core Thrive Items. Journal of medical Internet research 21, 1 (2019), e12075.",
      "doi": ""
    },
    {
      "text": "Lauren Wilcox, Dan Morris, Desney Tan, and Justin Gatewood. 2010. Designing patient-centric information displays for hospitals. In proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2123--2132.",
      "doi": "10.1145/1753326.1753650"
    },
    {
      "text": "RJT Wilson, S Davies, D Yates, J Redman, and M Stone. 2010. Impaired functional capacity is associated with all-cause mortality after major elective intra-abdominal surgery. British journal of anaesthesia 105, 3 (2010), 297--303.",
      "doi": ""
    },
    {
      "text": "Hiroaki Yano, Haruo Noma, Hiroo Iwata, and Tsutomu Miyasato. 2000. Shared walk environment using locomotion interfaces. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 163--170.",
      "doi": "10.1145/358916.358987"
    },
    {
      "text": "Haining Zhu and John M Carroll. 2018a. Healthcare Opportunities: Experts' Perspectives on Integrating Technology into Prehabilitation. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 149--152.",
      "doi": "10.1145/3272973.3274042"
    },
    {
      "text": "Haining Zhu and John M Carroll. 2018b. Multidisciplinary Care for Facial Paralysis Patients: Collaboration between Carers. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 189--192.",
      "doi": "10.1145/3272973.3274052"
    },
    {
      "text": "Haining Zhu, Joanna Colgan, Madhu Reddy, and Eun Kyoung Choe. 2016. Sharing patient-generated data in clinical practices: an interview study. In AMIA Annual Symposium Proceedings, Vol. 2016. American Medical Informatics Association, 1303.",
      "doi": ""
    },
    {
      "text": "Haining Zhu, Yuhan Luo, and Eun Kyoung Choe. 2017. Making Space for the Quality Care: Opportunities for Technology in Cognitive Behavioral Therapy for Insomnia. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5773--5786.",
      "doi": "10.1145/3025453.3025549"
    },
    {
      "text": "Haining Zhu, Zachary Moffa, Xiying Wang, Saeed Abdullah, Juxihong Julaiti, and John Carroll. 2018. Understanding Challenges in Prehabilitation for Patients with Multiple Chronic Conditions. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, 138--147.",
      "doi": "10.1145/3240925.3240959"
    }
  ]
}