{
  "doi": "10.1145/3313831.3376568",
  "title": "The Care Work of Access",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Current approaches to AI and Assistive Technology (AT) often foreground task completion over other encounters such as expressions of care. Our paper challenges and complements such task-completion approaches by attending to the care work of access-the continual affective and emotional adjustments that people make by noticing and attending to one another. We explore how this work impacts encounters among people with and without vision impairments who complete tasks together. We find that bound up in attempts to get things done are concerns for one another and how well people are doing together. Reading this work through emerging disability studies and feminist STS scholarship, we account for two important forms of work that give rise to access: (1) mundane attunements and (2) non-innocent authorizations. Together these processes work as sensitizing concepts to help HCI scholars account for the ways that intelligent ATs both produce access while sometimes subverting people with disabilities.",
  "tags": [
    "disability",
    "artificial intelligence",
    "blind",
    "care",
    "assistance",
    "vision impaired",
    "interdependence"
  ],
  "authors": [
    {
      "name": "Cynthia L. Bennett",
      "institution": "Carnegie Mellon University & University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358692957",
      "orcid": "0000-0003-1036-2497"
    },
    {
      "name": "Daniela K. Rosner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    },
    {
      "name": "Alex S. Taylor",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100517358/rel-imgonly/alex_taylor_profile.jpg",
      "acmid": "81100517358",
      "orcid": "0000-0001-6311-3967"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, William B. Easley, Michele A. Williams, Stacy Branham and Amy Hurst. 2017. Embracing Errors: Examining how Context of Use Impacts Blind Individuals' Acceptance of Navigation Aid Errors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4158--4169. https://doi.org/10.1145/3025453.3025528",
      "doi": "10.1145/3025453.3025528"
    },
    {
      "text": "ACM FAT* Conference. Retrieved September 18, 2019 from https://fatconference.org",
      "doi": ""
    },
    {
      "text": "Tousif Ahmed, Apu Kapadia, Venkatesh Potluri, and Manohar Swaminathan. 2018. Up to a Limit?: Privacy Concerns of Bystanders and Their Willingness to Share Additional Information with Visually Impaired Users of Assistive Technologies. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 89 (September 2018), 27 pages. DOI: https://doi.org/10.1145/3264899",
      "doi": "10.1145/3264899"
    },
    {
      "text": "Apple. Vision Accessibility: iPhone. Retrieved September 16, 2019 from https://www.apple.com/ accessibility/iphone/vision/",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018). Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18). ACM, New York, NY, USA, 161--173. DOI: https://doi.org/10.1145/3234695.3236348",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Burren Peil, and Daniela K. Rosner. 2019. Biographical Prototypes: Reimagining Recognition and Disability in Design. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, New York, NY, USA, 35--47. DOI: https://doi.org/10.1145/3322276.3322376",
      "doi": "10.1145/3322276.3322376"
    },
    {
      "text": "Andrew B. L. Berry, Catherine Lim, Andrea L. Hartzler, Tad Hirsch, Edward H. Wagner, Evette Ludman, and James D. Ralston. 2017. How Values Shape Collaboration Between Patients with Multiple Chronic Conditions and Spousal Caregivers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5257--5270. DOI: https://doi.org/10.1145/3025453.3025923",
      "doi": "10.1145/3025453.3025923"
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology, 333--342.",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Susanne Bodker. 2015. Third-wave HCI, 10 years later-participation and sharing. interactions 22, 5 (August 2015): 24--31.",
      "doi": ""
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. The invisible work of accessibility: how blind employees manage accessibility in mixed-ability workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, 163--171.",
      "doi": ""
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative accessibility: how blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2373--2382.",
      "doi": ""
    },
    {
      "text": "Clara Caldeira, Matthew Bietz, Marisol Vidauri, and Yunan Chen. 2017. Senior Care for Aging in Place: Balancing Assistance and Independence. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1605--1617. DOI: https://doi.org/10.1145/2998181.2998206",
      "doi": "10.1145/2998181.2998206"
    },
    {
      "text": "Lennard J. Davis. 1997. Constructing normalcy. The disability studies reader 3 (1997): 3--19.",
      "doi": ""
    },
    {
      "text": "Vinciane Despret. 2004. The Body We Care For: Figures of Anthropo-zoo-genesis. Body & Society 10, 2--3 (June 2004), 111--134.",
      "doi": ""
    },
    {
      "text": "Vinciane Despret. 2013. From Secret Agents to Interagency. History and Theory 52, 4 (2013): 29--44.",
      "doi": ""
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2019. Designing with Waste: A Situated Inquiry into the Material Excess of Making. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, New York, NY, USA, 1307--1319. DOI: https://doi.org/10.1145/3322276.3322320",
      "doi": "10.1145/3322276.3322320"
    },
    {
      "text": "Rebecca Fiebrink. 2010. Real-time interaction with supervised learning. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, New York, NY, USA, 2935--2938. DOI: https://doi.org/10.1145/1753846.1753889",
      "doi": "10.1145/1753846.1753889"
    },
    {
      "text": "Rebecca Fiebrink. 2017. Machine learning as meta-instrument: Human-machine partnerships shaping expressive instrumental creation.\" In Musical Instruments in the 21st Century, 137--151. Springer, Singapore.",
      "doi": ""
    },
    {
      "text": "Rebecca Fiebrink and Marco Gillies. 2018. Introduction to the Special Issue on Human-Centered Machine Learning. ACM Trans. Interact. Intell. Syst. 8, 2, Article 7 (June 2018), 7 pages. DOI: https://doi.org/10.1145/3205942",
      "doi": "10.1145/3205942"
    },
    {
      "text": "Kelly Fritsch. 2010. Intimate assemblages: Disability, intercorporeality, and the labour of attendant care. Critical Disability Discourses/Discours critiques dans le champ du handicap 2.",
      "doi": ""
    },
    {
      "text": "Kelly Fritsch, Clare O'connor, and Andrew Kieran Thompson, eds. 2016. Keywords for radicals: The contested vocabulary of late-capitalist struggle. AK Press.",
      "doi": ""
    },
    {
      "text": "Marco Gillies, Rebecca Fiebrink, Atau Tanaka, Jérémie Garcia, Frédéric Bevilacqua, Alexis Heloir, Fabrizio Nunnari, Wendy Mackay, Saleema Amershi, Bongshin Lee, Nicolas d'Alessandro, Joëlle Tilmanne, Todd Kulesza, and Baptiste Caramiaux. 2016. Human-Centred Machine Learning. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3558--3565. DOI: https://doi.org/10.1145/2851581.2856492",
      "doi": "10.1145/2851581.2856492"
    },
    {
      "text": "Eva Giraud , and Gregory Hollin. \"Care, Laboratory Beagles and Affective Utopia.\" Theory, Culture & Society 33, no. 4 (July 2016): 27--49.",
      "doi": ""
    },
    {
      "text": "Dan Goodley. 2014. Dis/ability studies: Theorising disablism and ableism. Routledge.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin, Marjorie H. Goodwin, and David Olsher. Producing Sense with Nonsense Syllables: Turn and Sequence in Conversations with a Man with Severe Aphasia. In The Language of Turn and Sequence, edited by Cecilia E. Ford, Barbara A. Fox, and Sandra A. Thompson, 56--80. Oxford: Oxford University Press, 2002.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 2004. A Competent Speaker Who Can't Speak: The Social Life of Aphasia. Journal of Linguistic Anthropology 14, 2 (December 2004) 151--170.",
      "doi": ""
    },
    {
      "text": "Google. Lookout. Retrieved September 16, 2019 from https://play.google.com/store/apps/details?id=com.google.android.apps.accessibility.reveal&hl=en_US",
      "doi": ""
    },
    {
      "text": "Aimi Hamraie. 2017. Building Access: Universal Design and the Politics of Disability. University of Minnesota Press, Minneapolis, MN.",
      "doi": ""
    },
    {
      "text": "Aimi Hamraie, and Kelly Fritsch. 2019. Crip technoscience manifesto. Catalyst: Feminism, Theory, Technoscience 5, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Michael Hardt and Antonio Negri. 2004. Multitude: War and Empire in the Age of Democracy. London, Penguin.",
      "doi": ""
    },
    {
      "text": "Christian Heath. 1986. Body movement and speech in medical interaction. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Christian Heath. 2011. Embodied action: Video and the analysis of social interaction. Qualitative research 3 (2011), 250--270.",
      "doi": ""
    },
    {
      "text": "Christian Heath, Jon Hindmarsh, and Paul Luff. 2010. Video in Qualitative Research. SAGE.",
      "doi": ""
    },
    {
      "text": "Louise Hickman. 2018. Access Workers, Transcription Machines, and Other Intimate Colleagues: Disability, Technology and Labor Practices in the Production of Knowledge (1956-Present). Doctoral Dissertation, University of California San Diego.",
      "doi": ""
    },
    {
      "text": "Anna Lauren Hoffmann. (2019) Where fairness fails: Data, algorithms, and the limits of antidiscrimination discourse. Information, Communication, & Society, 22, 7 (2019), 900--915.",
      "doi": ""
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of Knowing When Research Subjects Care. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Paper 97, 16 pages. DOI: https://doi.org/10.1145/3290605.3300327",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Lara Houston and Steven J. Jackson. 2016. Caring for the \"next billion\" mobile handsets: opening proprietary closures through the work of repair. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD '16). ACM, New York, NY, USA, Article 10, 11",
      "doi": ""
    },
    {
      "text": "Lara Houston, Steven J. Jackson, Daniela K. Rosner, Syed Ishtiaque Ahmed, Meg Young, and Laewoo Kang. 2016. Values in Repair. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1403--1414. DOI: https://doi.org/10.1145/2858036.2858470",
      "doi": "10.1145/2858036.2858470"
    },
    {
      "text": "Margaret Jack and Steven J. Jackson. 2016. Logistics as Care and Control: An Investigation into the UNICEF Supply Division. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2209--2219. DOI: https://doi.org/10.1145/2858036.2858503",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P Bigham. 2011. Supporting blind photography. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, 203--210.",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Hernisa Kacorri, Kris M. Kitani, Jeffrey P. Bigham, and Chieko Asakawa. 2017. People with Visual Impairment Training Personal Object Recognizers: Feasibility and Challenges. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 58395849. DOI: https://doi.org/10.1145/3025453.3025899",
      "doi": "10.1145/3025453.3025899"
    },
    {
      "text": "Alison Kafer. 2013. Feminist, queer, crip.Indiana University Press, Bloomington, IN.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Aditya Vishwanath, Arkadeep Kumar, Aman Mangal, and Neha Kumar. 2017. Care as a Resource in Underserved Learning Environments. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 104 (December 2017), 22 pages. DOI: https://doi.org/10.1145/3134739",
      "doi": "10.1145/3134739"
    },
    {
      "text": "Elizabeth Kaziunas, Mark S. Ackerman, Silvia Lindtner, and Joyce M. Lee. 2017. Caring through Data: Attending to the Social and Emotional Experiences of Health Datafication. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2260--2272. DOI: https://doi.org/10.1145/2998181.2998303",
      "doi": ""
    },
    {
      "text": "Christine Kelly. 2013, Building Bridges With Accessible Care: Disability Studies, Feminist Care Scholarship, and Beyond. Hypatia 28, 4 (November 2013) 784--800.",
      "doi": ""
    },
    {
      "text": "Christine Kelly. 2011. Making \"care'accessible: Personal assistance for disabled people and the politics of language. Critical Social Policy 31, 4 (November 2011): 562--582.",
      "doi": ""
    },
    {
      "text": "Os Keyes. 2018. The Misgendering Machines: Trans/HCI Implications of Automatic Gender Recognition. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 88 (November 2018), 22 pages. DOI: https://doi.org/10.1145/3274357",
      "doi": "10.1145/3274357"
    },
    {
      "text": "Leah Lakshmi Piepzna-Samarasinha. 2018. Care Work: Dreaming Disability Justice. Arsenal Pulp Press.",
      "doi": ""
    },
    {
      "text": "Kyungjun Lee, Jonggi Hong, Simone Pimento, Ebrima Jarju, and Hernisa Kacori. 2019. Revisiting Blind Photography in the context of Teachable Object Recognizers. In Proceedings of the 21th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '19). ACM, New York, NY, USA, to appear.",
      "doi": "10.1145/3308561.3353799"
    },
    {
      "text": "Kristina Lindström and Åsa Ståhl. 2016. Becoming response-able stakeholders: participatory design in times of uncertainties. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops - Volume 2 (PDC '16), Claus Bossen, Rachel Charlotte Smith, Anne Marie Kanstrup, Janet McDonnell, Maurizio Teli, and Keld Bødker (Eds.), Vol. 2. ACM, New York, NY, USA, 41--44. DOI: https://doi.org/10.1145/2948076.2948086",
      "doi": ""
    },
    {
      "text": "Kiel Long, Lyndsey L. Bakewell, Roisin C. McNaney, Konstantina Vasileiou, Mark Atkinson, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2017. Connecting Those That Care: Designing for Transitioning, Talking, Belonging and Escaping. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1339--1351. DOI: https://doi.org/10.1145/3025453.3025715",
      "doi": "10.1145/3025453.3025715"
    },
    {
      "text": "Paul Luff, Jon Hindmarsh, and Christian Heath, eds. 2000. Workplace studies: Recovering work practice and informing system design. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People's Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5988--5999. DOI: https://doi.org/10.1145/3025453.3025814",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Laura Mauldin. 2017. A Feminist Technoscientific Approach to Disability and Caregiving in the Family. In Disabling Domesticity. Springer, 139--161.",
      "doi": ""
    },
    {
      "text": "Microsoft. Seeing AI: Talking Camera App for Those with a Visual Impairment. Retrieved September 16, 2019 from https://www.microsoft.com/en-us/ai/seeing-ai",
      "doi": ""
    },
    {
      "text": "Jennie Middleton, and Hari Byles. 2019. Interdependent temporalities and the everyday mobilities of visually impaired young people. Geoforum 102 (2019), 76--85.",
      "doi": ""
    },
    {
      "text": "Mia Mingus. 2010. Reflections on an Opening: Disability Justice and Creating Collective Access in Detroit. Leaving Evidence. Retrieved September 17, 2019 from https://leavingevidence.wordpress.com/tag/collective-access/",
      "doi": ""
    },
    {
      "text": "Cecily Morrison, Edward Cutrell, Anupama Dhareshwar, Kevin Doherty, Anja Thieme, and Alex Taylor. 2017. Imagining Artificial Intelligence Applications with People with Visual Disabilities using Tactile Ideation. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, New York, NY, USA, 81--90. DOI: https://doi.org/10.1145/3132525.3132530",
      "doi": "10.1145/3132525.3132530"
    },
    {
      "text": "Ingunn Moser. 2005. On Becoming Disabled and Articulating Alternatives: The Multiple Modes of Ordering Disability and Their Interferences. Cultural Studies 19, 6 (November 2005) 667--700.",
      "doi": ""
    },
    {
      "text": "Ingunn Moser. 2011. Dementia and The Limits To Life: Anthropological Sensibilities, STS Interferences, and Possibilities For Action In Care. Science, Technology, & Human Values 36, 5 (September 2011): 704--722.",
      "doi": ""
    },
    {
      "text": "Ingunn Moser and John Law. 1999. Good Passages, Bad Passages. The Sociological Review 47, S1 (May 1999): 196--219.",
      "doi": ""
    },
    {
      "text": "Michelle Murphy. 2015. Unsettling Care: Troubling Transnational Itineraries of Care In Feminist Health Practices. Social Studies of Science 45, 5 (October 2015), 717--737.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Trans. Comput.-Hum. Interact. 22, 6, Article 33 (December 2015), 45 pages. DOI: https://doi.org/10.1145/2803173",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2018. Understanding the Mundane Nature of Self-care: Ethnographic Accounts of People Living with Parkinson's. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 402, 15 pages. DOI: https://doi.org/10.1145/3173574.3173976",
      "doi": "10.1145/3173574.3173976"
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT effect: how disability affects the perceived social acceptability of head-mounted display use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 4884--4895.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2011. Matters of Care in Technoscience: Assembling Neglected Things. Social Studies of Science 41, 1 (January 2011) 85--106.",
      "doi": ""
    },
    {
      "text": "Maria Puig de La Bellacasa. 2017. Matters of care: Speculative ethics in more than human worlds. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2012. \"Nothing Comes Without Its World\": Thinking With Care. The Sociological Review 60, 2 May (2012) 197--216.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Samantha Shorey, Brock R. Craft, and Helen Remick. 2018. Making Core Memory: Design Inquiry into Gendered Lega-cies of Engineering and Craftwork. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 531, 13 pages. DOI: https://doi.org/10.1145/3173574.3174105",
      "doi": "10.1145/3173574.3174105"
    },
    {
      "text": "Karen Ruhleder and Brigitte Jordan. 1999. Meaning-making across remote sites: How delays in transmission affect interaction. In ECSCW'99, 411--429. Springer, Dordrecht.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks, Emanuel A. Schegloff, and Gail Jefferson. 1978. A Simplest Systematics for the Organization of Turn-Taking for Conversation. Studies in the Organization Conversation Interaction, 50, 4 (January 1978) 7--55.",
      "doi": ""
    },
    {
      "text": "Jentery Sayers. 2015. Prototyping the Past. Visible Language 49, 3.",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff, and Harvey Sacks. 1978. Opening Up Closings. Semiotica 8, 4 (1973) 289--327.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Jacob M. Paul, and Jed R. Brubaker. 2019. How Computers See Gender: An Evaluation of Gender Classification in Commercial Facial Analysis and Image Labeling Services. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 144 (November 2019), 33 pages.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Kenton P. O'Hara, and Alex S. Taylor. 2018. Let's Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 315, 14 pages. DOI: https://doi.org/10.1145/3173574.3173889",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 705--714.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2016. Self-consciousor self-confident? A diary study. conceptualizing the social accessibility of assistive technology. ACM Transactions on Accessible Computing (TACCESS) 8, 2: 5.",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Lee Stearns and Anja Thieme. 2018. Automated Person Detection in Dynamic Scenes to Assist People with Vision Impairments: An Initial Investigation. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18). ACM, New York, NY, USA, 391--394. DOI: https://doi.org/10.1145/3234695.3241017",
      "doi": "10.1145/3234695.3241017"
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: a study of daily challenges of Low Vision people. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 61--72. DOI: http://dx.doi.org/10.1145/2971648.2971723",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Anja Thieme, Cynthia L. Bennett, Cecily Morrison, Edward Cutrell, and Alex S. Taylor. 2018. 'I can do everything but see!' -- How People with Vision Impairments Negotiate their Abilities in Social Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 203, 14 pages. DOI: https://doi.org/10.1145/3173574.3173777",
      "doi": ""
    },
    {
      "text": "Tanya Titchkosky. 2011. The question of access: Disability, space, meaning. University of Toronto Press.",
      "doi": ""
    },
    {
      "text": "Austin Toombs, Laura Devendorf, Patrick Shih, Elizabeth Kaziunas, David Nemer, Helena Mentis, and Laura Forlano. 2018. Sociotechnical Systems of Care. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '18). ACM, New York, NY, USA, 479--485. DOI: https://doi.org/10.1145/3272973.3273010",
      "doi": ""
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 629--638. DOI: https://doi.org/10.1145/2702123.2702522",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Shari Trewin. 2018. AI fairness for people with disabilities: Point of view. arXiv preprint arXiv:1811.10670 (2018).",
      "doi": ""
    },
    {
      "text": "Shari Trewin, Meredith Ringel Morris, Shiri Azenkot, Stacy Branham, Nicole Bleuel, Phill Jenkins, Jeffrey Bigham, Walter S. Lasecki. 2019. Workshop: AI Fairness for People with Disabilities. Retrieved September 18, 2019 from https://assets19.sigaccess.org/ai_fairness_workshop.html",
      "doi": ""
    },
    {
      "text": "Michele A. Williams, Caroline Galbraith, Shaun K. Kane, and Amy Hurst. 2014. Just let the cane hit it: how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility, 217--224.",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Rua M. Williams and Juan E. Gilbert. 2019. Cyborg Perspectives on Computing Research Reform. In Proceedings of CHI '19: CHI Conference on Human Factors in Computing Systems (CHI '19), May 04, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA, https://doi.org/10.1145/3290607.3310421",
      "doi": ""
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-text: Computergenerated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1180--1192. DOI: https://doi.org/10.1145/2998181.2998364",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Ellen Zegura, Carl DiSalvo, and Amanda Meng. 2018. Care and the Practice of Data Science for Social Good. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS '18). ACM, New York, NY, USA, Article 34, 9 pages. DOI: https://doi.org/10.1145/3209811.3209877",
      "doi": "10.1145/3209811.3209877"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, Jonathan Knighten, and Shiri Azenkot. 2016. CueSee: exploring visual cues for people with low vision to facilitate a visual search task. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 73--84. DOI: https://doi.org/10.1145/2971648.2971730",
      "doi": "10.1145/2971648.2971730"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2017. The Effect of Computer-Generated Descriptions on Photo-Sharing Experiences of People with Visual Impairments. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 121 (December 2017), 22 pages. DOI: https://doi.org/10.1145/3134756",
      "doi": "10.1145/3134756"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2018. A Face Recognition Application for People with Visual Impairments: Understanding Use Beyond the Lab. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 215, 14 pages. DOI: https://doi.org/10.1145/3173574.3173789",
      "doi": "10.1145/3173574.3173789"
    },
    {
      "text": "Yu Zhong, Pierre J. Garrigues, and Jeffrey P. Bigham. 2013. Real time object scanning using a mobile phone and cloud-based visual search engine. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 20 , 8 pages. DOI: http://dx.doi.org/10.1145/2513383.2513443",
      "doi": ""
    },
    {
      "text": "Yu Zhong, Walter S Lasecki, Erin Brady, and Jeffrey P Bigham. 2015. Regionspeak: Quick comprehensive spatial descriptions of complex images for blind users. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2353--2362.",
      "doi": "10.1145/2702123.2702437"
    },
    {
      "text": "Annuska Zolyomi, Anushree Shukla, and Jaime Snyder. 2017. Technology-Mediated Sight: A Case Study of Early Adopters of a Low Vision Assistive Technology. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 220--229.",
      "doi": "10.1145/3132525.3132552"
    }
  ]
}