{
  "doi": "10.1145/3313831.3376129",
  "title": "Venous Materials: Towards Interactive Fluidic Mechanisms",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Venous Materials is a novel concept and approach of an interactive material utilizing fluidic channels. We present a design method for fluidic mechanisms that respond to deformation by mechanical inputs from the user, such as pressure and bending. We designed a set of primitive venous structures that act as embedded analog fluidic sensors, displaying flow and color change. In this paper, we consider the fluid as the medium to drive tangible information triggered by deformation, and at the same time, to function as a responsive display of that information. To provide users with a simple way to create and validate designs of fluidic structures, we built a software platform and design tool UI. This design tool allows users to quickly design the geometry, and simulate the flow with intended mechanical force dynamically. We present a range of applications that demonstrate how Venous Materials can be utilized to augment interactivity of everyday physical objects.",
  "authors": [
    {
      "name": "Hila Mor",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659502766",
      "orcid": "missing"
    },
    {
      "name": "Tianyu Yu",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528656",
      "orcid": "0000-0003-0609-0994"
    },
    {
      "name": "Ken Nakagaki",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81488670562/rel-imgonly/ken-profile_may2022_square.jpg",
      "acmid": "81488670562",
      "orcid": "0000-0002-1351-6976"
    },
    {
      "name": "Benjamin Harvey Miller",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659501671",
      "orcid": "missing"
    },
    {
      "name": "Yichen Jia",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659502241",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Janelle R Anderson, Daniel T Chiu, Rebecca J Jackman, Oksana Cherniavskaya, J Cooper McDonald, Hongkai Wu, Sue H Whitesides, and George M Whitesides. 2000. Fabrication of topologically complex three-dimensional microfluidic systems in PDMS by rapid prototyping. Analytical chemistry 72, 14 (2000), 3158--3164.",
      "doi": ""
    },
    {
      "text": "Moritz Bächer, Emily Whiting, Bernd Bickel, and Olga Sorkine-Hornung. 2014. Spin-It: Optimizing Moment of Inertia for Spinnable Objects. ACM Trans. Graph. 33, 4, Article Article 96 (July 2014), 10 pages. DOI: http://dx.doi.org/10.1145/2601097.2601157",
      "doi": "10.1145/2601097.2601157"
    },
    {
      "text": "Christoph Bader, William G Patrick, Dominik Kolb, Stephanie G Hays, Steven Keating, Sunanda Sharma, Daniel Dikovsky, Boris Belocon, James C Weaver, Pamela A Silver, and others. 2016. Grown, printed, and biologically augmented: An additively manufactured microfluidic wearable, functionally templated for synthetic microbes. 3D Printing and Additive Manufacturing 3, 2 (2016), 79--89.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch, Stefanie Mueller, and others. 2017. Personal fabrication. Foundations and Trends® in Human--Computer Interaction 10, 3--4 (2017), 165--293.",
      "doi": ""
    },
    {
      "text": "Alberto Boem and Giovanni Maria Troiano. 2019. Non-Rigid HCI: A Review of Deformable Interfaces and Input. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 885--906.",
      "doi": "10.1145/3322276.3322347"
    },
    {
      "text": "Jungil Choi, Roozbeh Ghaffari, Lindsay B Baker, and John A Rogers. 2018. Skin-interfaced systems for sweat collection and analytics. Science advances 4, 2 (2018), eaar3921.",
      "doi": ""
    },
    {
      "text": "Jean-Baptiste Chossat, Hee-Sup Shin, Yong-Lae Park, and Vincent Duchaine. 2015. Soft tactile skin using an embedded ionic liquid and tomographic imaging. Journal of Mechanisms and Robotics 7, 2 (2015), 021008.",
      "doi": ""
    },
    {
      "text": "David C Duffy, J Cooper McDonald, Olivier JA Schueller, and George M Whitesides. 1998. Rapid prototyping of microfluidic systems in poly (dimethylsiloxane). Analytical chemistry 70, 23 (1998), 4974--4984.",
      "doi": ""
    },
    {
      "text": "Don Samitha Elvitigala, Denys JC Matthies, Löic David, Chamod Weerasinghe, and Suranga Nanayakkara. 2019. GymSoles: Improving Squats and Dead-Lifts by Visualizing the User's Center of Pressure. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 174.",
      "doi": "10.1145/3290605.3300404"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In Uist, Vol. 13. 417--426.",
      "doi": ""
    },
    {
      "text": "Jack Forman, Taylor Tabb, Youngwook Do, Meng-Han Yeh, Adrian Galvin, and Lining Yao. 2019. ModiFiber: Two-Way Morphing Soft Thread Actuators for Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 660.",
      "doi": "10.1145/3290605.3300890"
    },
    {
      "text": "FormLabs. FormLabs 3D Printer. https://formlabs.com/ - accessed Sep-20--2019.",
      "doi": ""
    },
    {
      "text": "Hiroshi Fudouzi and Tsutomu Sawada. 2006. Photonic rubber sheets with tunable color by elastic deformation. Langmuir 22, 3 (2006), 1365--1368.",
      "doi": ""
    },
    {
      "text": "M Garrad, G Soter, AT Conn, H Hauser, and J Rossiter. 2019. A soft matter computer for soft robots. Science Robotics 4, 33 (2019), eaaw6060.",
      "doi": ""
    },
    {
      "text": "Luc Geurts and Vero Vanden Abeele. 2012. Splash controllers: game controllers involving the uncareful manipulation of water. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction. ACM, 183--186.",
      "doi": "10.1145/2148131.2148170"
    },
    {
      "text": "Tomoko Hashida, Yasuaki Kakehi, and Takeshi Naemura. 2011. Photochromic sculpture: volumetric color-forming pixels. In ACM SIGGRAPH 2011 Emerging Technologies. ACM, 11.",
      "doi": "10.1145/2048259.2048270"
    },
    {
      "text": "Jussi Hiltunen, Christina Liedert, Marianne Hiltunen, Olli-Heikki Huttunen, Johanna Hiitola-Keinänen, Sanna Aikio, Mikko Harjanne, Marika Kurkinen, Leena Hakalahti, and Luke P. Lee. 2018. Roll-to-roll fabrication of integrated PDMS--paper microfluidics for nucleic acid amplification. Lab Chip 18 (2018), 1552--1559. Issue 11. DOI: http://dx.doi.org/10.1039/C8LC00269J",
      "doi": ""
    },
    {
      "text": "Andrew W Holle, Shih-Hui Chao, Mark R Holl, Jeffrey M Houkal, and Deirdre R Meldrum. 2007. Characterization of Program Controlled CO 2 Laser-Cut PDMS Channels for Lab-on-a-chip Applications. In 2007 IEEE International Conference on Automation Science and Engineering. IEEE, 621--627.",
      "doi": ""
    },
    {
      "text": "Yuki Inoue, Yuichi Itoh, and Takao Onoye. 2018. TuVe: a flexible display with a tube. In SIGGRAPH Asia 2018 Emerging Technologies. ACM, 16.",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 529--539.",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Alexandra Ion, Robert Kovacs, Oliver S Schneider, Pedro Lopes, and Patrick Baudisch. 2018. Metamaterial Textures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 336.",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Ludwig Wall, Robert Kovacs, and Patrick Baudisch. 2017. Digital mechanical metamaterials. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 977--988.",
      "doi": "10.1145/3025453.3025624"
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (2012), 38--51.",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. Transform: Embodiment of radical atoms at milano design week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 687--694.",
      "doi": "10.1145/2702613.2702969"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 234--241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and challenges for data physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3227--3236.",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Yvonne Jansen, Thorsten Karrer, and Jan Borchers. 2010. MudPad: Localized Tactile Feedback on Touch Surfaces. In Adjunct Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). Association for Computing Machinery, New York, NY, USA, 385--386. DOI: http://dx.doi.org/10.1145/1866218.1866232",
      "doi": ""
    },
    {
      "text": "Wonjin Jeon and Chee Burm Shin. 2009. Design and simulation of passive mixing in microfluidic systems with geometric variations. Chemical engineering journal 152, 2--3 (2009), 575--582.",
      "doi": ""
    },
    {
      "text": "Yuhua Jin, Isabel Qamar, Michael Wessely, Aradhana Adhikari, Katarina Bulovic, Parinya Punpongsanon, and Stefanie Mueller. 2019. Photo-Chromeleon: Re-Programmable Multi-Color Textures Using Photochromic Dyes. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, 701--712.",
      "doi": "10.1145/3332165.3347905"
    },
    {
      "text": "Viirj Kan, Emma Vargo, Noa Machover, Hiroshi Ishii, Serena Pan, Weixuan Chen, and Yasuaki Kakehi. 2017. Organic primitives: Synthesis and design of pH-reactive materials using molecular I/O for sensing, actuation, and interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 989--1000.",
      "doi": "10.1145/3025453.3025952"
    },
    {
      "text": "Hsin-Liu Cindy Kao, Manisha Mohan, Chris Schmandt, Joseph A Paradiso, and Katia Vega. 2016. Chromoskin: Towards interactive cosmetics using thermochromic pigments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3703--3706.",
      "doi": ""
    },
    {
      "text": "Byron Lahey, Audrey Girouard, Winslow Burleson, and Roel Vertegaal. 2011. PaperPhone: understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1303--1312.",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Cecilia Laschi. 2017. Octobot-A robot octopus points the way to soft robotics. IEEE Spectrum 54, 3 (2017), 38--43.",
      "doi": "10.1109/MSPEC.2017.7864755"
    },
    {
      "text": "David W Lee and Kevin S Gould. 2002. Why leaves turn red: pigments called anthocyanins probably protect leaves from light damage by direct shielding and by scavenging free radicals. American Scientist 90, 6 (2002), 524--531.",
      "doi": ""
    },
    {
      "text": "Johnny C Lee, Scott E Hudson, and Edward Tse. 2008. Foldable interactive displays. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 287--290.",
      "doi": "10.1145/1449715.1449763"
    },
    {
      "text": "Hao-Bing Liu and Hai-Qing Gong. 2009. Templateless prototyping of polydimethylsiloxane microfluidic structures using a pulsed CO2 laser. Journal of Micromechanics and Microengineering 19, 3 (2009), 037002.",
      "doi": ""
    },
    {
      "text": "Qiuyu Lu, Chengpeng Mao, Liyuan Wang, and Haipeng Mi. 2016. Lime: Liquid metal interfaces for non-rigid interaction. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 449--452.",
      "doi": "10.1145/2984511.2984562"
    },
    {
      "text": "Qiuyu Lu, Jifei Ou, João Wilbert, André Haben, Haipeng Mi, and Hiroshi Ishii. 2019. milliMorph--Fluid-Driven Thin Film Shape-Change Materials for Interaction Design. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, 663--672.",
      "doi": "10.1145/3332165.3347956"
    },
    {
      "text": "Stephen A Morin, Robert F Shepherd, Sen Wai Kwok, Adam A Stokes, Alex Nemiroski, and George M Whitesides. 2012. Camouflage and display for soft machines. Science 337, 6096 (2012), 828--832.",
      "doi": ""
    },
    {
      "text": "Sara Nabil, Jan Kuera, Nikoletta Karastathi, David S Kirk, and Peter Wright. 2019. Seamless Seams: Crafting Techniques for Embedding Fabrics with Interactive Actuation. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 987--999.",
      "doi": "10.1145/3322276.3322369"
    },
    {
      "text": "Ken Nakagaki, Pasquale Totaro, Jim Peraino, Thariq Shihipar, Chantine Akiyama, Yin Shuang, and Hiroshi Ishii. 2016. Hydromorph: Shape changing water membrane for display and interaction. In Proceedings of the TEI'16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 512--517.",
      "doi": "10.1145/2839462.2856517"
    },
    {
      "text": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis, and Hiroshi Ishii. 2016. Cilllia: 3D printed micro-pillar structures for surface texture, actuation and sensing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5753--5764.",
      "doi": "10.1145/2858036.2858257"
    },
    {
      "text": "Jifei Ou, Zhao Ma, Jannik Peters, Sen Dai, Nikolaos Vlavianos, and Hiroshi Ishii. 2018. KinetiX-designing auxetic-inspired deformable material structures. Computers & Graphics 75 (2018), 72--81.",
      "doi": "10.1016/j.cag.2018.06.003"
    },
    {
      "text": "Jifei Ou, Mélina Skouras, Nikolaos Vlavianos, Felix Heibeck, Chin-Yi Cheng, Jannik Peters, and Hiroshi Ishii. 2016. aeroMorph-heat-sealing inflatable shape-change materials for interaction design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 121--132.",
      "doi": "10.1145/2984511.2984520"
    },
    {
      "text": "Jifei Ou, Lining Yao, Daniel Tauber, Jürgen Steimle, Ryuma Niiyama, and Hiroshi Ishii. 2014. jamSheets: thin interfaces with tunable stiffness enabled by layer jamming. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 65--72.",
      "doi": ""
    },
    {
      "text": "Crystal E Owens and A John Hart. 2018. High-precision modular microfluidics by micromilling of interlocking injection-molded blocks. Lab on a Chip 18, 6 (2018), 890--901.",
      "doi": ""
    },
    {
      "text": "Y. Park, B. Chen, and R. J. Wood. 2012. Design and Fabrication of Soft Artificial Skin Using Embedded Microchannels and Liquid Conductors. IEEE Sensors Journal 12, 8 (Aug 2012), 2711--2718. DOI: http://dx.doi.org/10.1109/JSEN.2012.2200790",
      "doi": ""
    },
    {
      "text": "Jayson Paulose, Anne S. Meeussen, and Vincenzo Vitelli. 2015. Selective buckling via states of self-stress in topological metamaterials. Proceedings of the National Academy of Sciences 112, 25 (2015), 7639--7644. DOI: http://dx.doi.org/10.1073/pnas.1502939112",
      "doi": ""
    },
    {
      "text": "Panagiotis Polygerinos, Nikolaus Correll, Stephen A Morin, Bobak Mosadegh, Cagdas D Onal, Kirstin Petersen, Matteo Cianchetti, Michael T Tolley, and Robert F Shepherd. 2017. Soft robotics: Review of fluid-driven intrinsically soft devices; manufacturing, sensing, control, and applications in human-robot interaction. Advanced Engineering Materials 19, 12 (2017), 1700016.",
      "doi": ""
    },
    {
      "text": "Julian Pop. Bit Fall. https://vimeo.com/22396196 accessed Sep-20--2019.",
      "doi": ""
    },
    {
      "text": "Julian Pop. Bit Flow. https://vimeo.com/22390871 accessed Sep-20--2019.",
      "doi": ""
    },
    {
      "text": "Romain Prévost, Emily Whiting, Sylvain Lefebvre, and Olga Sorkine-Hornung. 2013. Make It Stand: Balancing Shapes for 3D Fabrication. ACM Trans. Graph. 32, 4, Article Article 81 (July 2013), 10 pages. DOI: http://dx.doi.org/10.1145/2461912.2461957",
      "doi": "10.1145/2461912.2461957"
    },
    {
      "text": "Parinya Punpongsanon, Xin Wen, David S. Kim, and Stefanie Mueller. 2018. ColorMod: Recoloring 3D Printed Objects Using Photochromic Inks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 213, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173787",
      "doi": "10.1145/3173574.3173787"
    },
    {
      "text": "Isabel PS Qamar, Rainer Groh, David Holman, and Anne Roudaut. 2018. HCI meets Material Science: A Literature Review of Morphing Materials for the Design of Shape-Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 374.",
      "doi": "10.1145/3173574.3173948"
    },
    {
      "text": "Jonathan T Reeder, Jungil Choi, Yeguang Xue, Philipp Gutruf, Justin Hanson, Mark Liu, Tyler Ray, Amay J Bandodkar, Raudel Avila, Wei Xia, and others. 2019. Waterproof, electronics-enabled, epidermal microfluidic devices for sweat collection, biomarker analysis, and thermography in aquatic settings. Science advances 5, 1 (2019), eaau6356.",
      "doi": ""
    },
    {
      "text": "Daniela K Rosner, Miwa Ikemiya, Diana Kim, and Kristin Koch. 2013. Designing with traces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1649--1658.",
      "doi": "10.1145/2470654.2466218"
    },
    {
      "text": "Semin Ryu, Jeong-Hoi Koo, Tae-Heon Yang, Dongbum Pyo, Ki-Uk Kyung, and Dong-Soo Kwon. 2016. Mechanical and psychophysical performance evaluation of a haptic actuator based on magnetorheological fluids. Journal of Intelligent Material Systems and Structures 27, 14 (2016), 1967--1975. DOI: http://dx.doi.org/10.1177/1045389X15620040",
      "doi": ""
    },
    {
      "text": "Daniel Saakes, Masahiko Inami, Takeo Igarashi, Naoya Koizumi, and Ramesh Raskar. 2012. Shader printer. In ACM SIGGRAPH 2012 Emerging Technologies. ACM, 18.",
      "doi": "10.1145/2343456.2343474"
    },
    {
      "text": "Yoshimitsu Sagara, Marc Karman, Atsushi Seki, Mehboobali Pannipara, Nobuyuki Tamaoki, and Christoph Weder. 2019. Rotaxane-Based Mechanophores Enable Polymers with Mechanically Switchable White Photoluminescence. ACS Central Science 5, 5 (2019), 874--881. DOI: http://dx.doi.org/10.1021/acscentsci.9b00173",
      "doi": ""
    },
    {
      "text": "Deepak Ranjan Sahoo, Timothy Neate, Yutaka Tokuda, Jennifer Pearson, Simon Robinson, Sriram Subramanian, and Matt Jones. 2018. Tangible drops: a visio-tactile display using actuated liquid-metal droplets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 177.",
      "doi": "10.1145/3173574.3173751"
    },
    {
      "text": "SHOCKWATCH. Impact and tilt indicators. https://www.shockwatch.com.au/product-category/impact-tilt/ - accessed Sep-20--2019.",
      "doi": ""
    },
    {
      "text": "Gabor Soter, Martin Garrad, Andrew T Conn, Helmut Hauser, and Jonathan Rossiter. 2019. Skinflow: A soft robotic skin based on fluidic transmission. In 2019 2nd IEEE International Conference on Soft Robotics (RoboSoft). IEEE, 355--360.",
      "doi": ""
    },
    {
      "text": "Skylar Tibbits. 2014. 4D printing: multi-material shape change. Architectural Design 84, 1 (2014), 116--121.",
      "doi": ""
    },
    {
      "text": "Yutaka Tokuda, Jose Luis Berna Moya, Gianluca Memoli, Timothy Neate, Deepak Ranjan Sahoo, Simon Robinson, Jennifer Pearson, Matt Jones, and Sriram Subramanian. 2017. Programmable liquid matter: 2D shape deformation of highly conductive liquid metals in a dynamic electric field. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces. ACM, 142--150.",
      "doi": "10.1145/3132272.3134132"
    },
    {
      "text": "Bhushan J Toley, Jessica A Wang, Mayuri Gupta, Joshua R Buser, Lisa K Lafleur, Barry R Lutz, Elain Fu, and Paul Yager. 2015. A versatile valving toolkit for automating fluidic operations in paper microfluidic devices. Lab on a Chip 15, 6 (2015), 1432--1444.",
      "doi": ""
    },
    {
      "text": "Udayan Umapathi, Patrick Shin, Ken Nakagaki, Daniel Leithinger, and Hiroshi Ishii. 2018. Programmable droplets for interaction. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, VS15.",
      "doi": "10.1145/3170427.3186607"
    },
    {
      "text": "Nobuyuki Umetani, Athina Panotopoulou, Ryan Schmidt, and Emily Whiting. 2016. Printone: Interactive Resonance Simulation for Free-form Print-wind Instrument Design. ACM SIGGRAPH Asia Computer Graphics 35 (09 2016). DOI: http://dx.doi.org/10.1145/2980179.2980250",
      "doi": "10.1145/2980179.2980250"
    },
    {
      "text": "Roel Vertegaal and Ivan Poupyrev. 2008. Organic user interfaces. Commun. ACM 51, 6 (2008), 26--30.",
      "doi": "10.1145/1349026.1349033"
    },
    {
      "text": "Dhaval Vyas, Wim Poelman, Anton Nijholt, and Arnout De Bruijn. 2012. Smart material interfaces: a new form of physical interaction. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 1721--1726.",
      "doi": "10.1145/2212776.2223699"
    },
    {
      "text": "Akira Wakita, Akito Nakano, and Nobuhiro Kobayashi. 2011. Programmable blobs: a rheologic interface for organic shape design. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction. ACM, 273--276.",
      "doi": "10.1145/1935701.1935760"
    },
    {
      "text": "Akira Wakita and Midori Shibutani. 2006. Mosaic textile: wearable ambient display with non-emissive color-changing modules. In Proceedings of the 2006 ACM SIGCHI international conference on Advances in computer entertainment technology. ACM, 48.",
      "doi": "10.1145/1178823.1178880"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 569.",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Guanyun Wang, Ye Tao, Ozguc Bertug Capunaman, Humphrey Yang, and Lining Yao. 2019. A-line: 4D Printing Morphing Linear Composite Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 426.",
      "doi": "10.1145/3290605.3300656"
    },
    {
      "text": "Guanyun Wang, Lining Yao, Wen Wang, Jifei Ou, Chin-Yi Cheng, and Hiroshi Ishii. 2016. xprint: A modularized liquid printer for smart materials deposition. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5743--5752.",
      "doi": "10.1145/2858036.2858281"
    },
    {
      "text": "Junchao Wang, Victor G. J. Rodgers, Philip Brisk, and William H. Grover. 2017. Instantaneous simulation of fluids and particles in complex microfluidic devices. PLOS ONE 12 (12 2017), 1--14. DOI: http://dx.doi.org/10.1371/journal.pone.0189429",
      "doi": ""
    },
    {
      "text": "L. Wang and E. Whiting. 2016. Buoyancy Optimization for Computational Fabrication. Computer Graphics Forum 35, 2 (2016), 49--58. DOI: http://dx.doi.org/10.1111/cgf.12810",
      "doi": ""
    },
    {
      "text": "Wen Wang, Lining Yao, Teng Zhang, Chin-Yi Cheng, Daniel Levine, and Hiroshi Ishii. 2017. Transformative appetite: shape-changing food transforms from 2D to 3D by water interaction through cooking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6123--6132.",
      "doi": "10.1145/3025453.3026019"
    },
    {
      "text": "Michael Wehner, Ryan L Truby, Daniel J Fitzgerald, Bobak Mosadegh, George M Whitesides, Jennifer A Lewis, and Robert J Wood. 2016. An integrated design and fabrication strategy for entirely soft, autonomous robots. Nature 536, 7617 (2016), 451.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21 st century. ACM SIGMOBILE mobile computing and communications review 3, 3 (1999), 3--11.",
      "doi": ""
    },
    {
      "text": "Tom White. 1998. Introducing liquid haptics in high bandwidth human computer interfaces. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "George M Whitesides. 2006. The origins and the future of microfluidics. Nature 442, 7101 (2006), 368.",
      "doi": ""
    },
    {
      "text": "Mikael Wiberg, Hiroshi Ishii, Paul Dourish, Daniela Rosner, Anna Vallgårda, Petra Sundström, Tobie Kerridge, and Mark Rolston. 2012. Material interactions: from atoms & bits to entangled practices. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 1147--1150.",
      "doi": "10.1145/2212776.2212408"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and Technology. ACM, 13--22.",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. BioLogic: natto cells as nanoactuators for shape changing interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1--10.",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Joo Chuan Yeo, Zhuangjian Liu, Zhi-Qian Zhang, Pan Zhang, Zhiping Wang, and Chwee Teck Lim. 2017. Wearable mechanotransduced tactile sensor for haptic perception. Advanced Materials Technologies 2, 6 (2017), 1700006.",
      "doi": ""
    }
  ]
}