{
  "doi": "10.1145/3313831.3376357",
  "title": "The Silent Conversation: Designing for Introspection and Social Play in Art Museums",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "This paper presents an attempt to design for a combination of social play and introspection using a ludic approach within an art museum setting. The field trial is described of a mobile web app called 'Never let me go', a two-player system enabling visitors to an art museum to create impromptu experiences in-situ for a companion. The study reveals that players used the app for communicating with each other during the visit, often without speaking. This led to deeply personal and introspective moments, as well as, lots of teasing and playing. The implications of allowing for social, personal and playful experiences in an art museum are discussed, as well as, the advantages and challenges of designing for improvisation.",
  "tags": [
    "social",
    "impromptu experience design",
    "introspective",
    "play",
    "affective",
    "experience",
    "museums",
    "personalisation",
    "art",
    "mobile"
  ],
  "authors": [
    {
      "name": "Karin Ryding",
      "institution": "IT University Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473738",
      "orcid": "0000-0001-7294-3129"
    }
  ],
  "references": [
    {
      "text": "Victor Alvarez-Cortes, Víctor H. Zárate, Jorge A. Ramírez Uresti, and Benjamin E. Zayas. 2009. Current Challenges and Applications for Adaptive User Interfaces. In I. Maurtua, ed., Human-Computer Interaction. IntechOpen. Retrieved August 30, 2019 from https://www.intechopen.com/books/human-computer-interaction/current-challenges-and-applications-for-adaptive-user-interfaces",
      "doi": ""
    },
    {
      "text": "Michael J. Apter. 1991. A structural-phenomenology of play. In M.J. Apter and J.H. Kerr, eds., Adult Play:A Reversal Theory Approach. Swets & Zeitlinger, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Liliana Ardissono, Tsvi Kuflik, and Daniela Petrelli. 2012. Personalization in cultural heritage: the road travelled and the one ahead. User Modeling and User-Adapted Interaction 22, 1--2: 73--99.",
      "doi": "10.1007/s11257-011-9104-x"
    },
    {
      "text": "Richard Bauman. 1975. Verbal Art as Performance. American Anthropologist 77, 290--311.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Gabriella Giannachi, Boriana Koleva, and Tom Rodden. 2009. From Interaction to Trajectories: Designing Coherent Journeys Through User Experiences. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 709--718.",
      "doi": "10.1145/1518701.1518812"
    },
    {
      "text": "Linda M. Blud. 1990. Social interaction and learning among family groups visiting a museum. Museum Management and Curatorship 9, 1: 43--51.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2006. When second wave HCI meets third wave challenges. Changing roles, ACM Press, 1--8.",
      "doi": ""
    },
    {
      "text": "Rika Burnham and Elliott Kai-Kee. 2005. The Art of Teaching in the Museum. The Journal of Aesthetic Education 39, 1: 65--76.",
      "doi": ""
    },
    {
      "text": "Roger Caillois. 2001. Man, Play and Games. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Janet Cardiff. 2005. Words Drawn in Water. Retrieved August 30, 2019 from https://www.cardiffmiller.com/artworks/walks/wordsdrawn.html",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi, Liam J. Bannon, and Mikael Fernström. 2008. Including Visitor Contributions in Cultural Heritage Installations: Designing for Participation. Museum Management and Curatorship 23, 4: 353--365.",
      "doi": ""
    },
    {
      "text": "Tanguy Coenen, Lien Mostmans, and Kris Naessens. 2013. MuseUs: Case Study of a Pervasive Cultural Heritage Serious Game. ACM Journal on Computing and Cultural Heritage (JOCCH) 6, 2. https://doi.org/10.1145/2460376.2460379",
      "doi": "10.1145/2460376.2460379"
    },
    {
      "text": "Dan Cosley, Jonathan Baxter, Soyoung Lee, et al. 2009. A Tag in the Hand: Supporting Semantic, Social, and Spatial Navigation in Museums. SIGCHI Conference on Human Factors in Computing Systems, ACM, 1953--1962.",
      "doi": "10.1145/1518701.1518999"
    },
    {
      "text": "Dan Cosley, Joel Lewenstein, Andrew Herman, et al. 2008. ArtLinks: Fostering Social Awareness and Reflection in Museums. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 403--412.",
      "doi": "10.1145/1357054.1357121"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1975. Beyond Boredom and Anxiety: Experiencing Flow in Work and Play. Jossey-Bass, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Mar Dixon. 2018. MuseumSelfieDay. Twitter. Retrieved September 9, 2019 from https://twitter.com/MuseumSelfieDay.",
      "doi": ""
    },
    {
      "text": "Satu Elo and Helvi Kyngäs. 2008. The qualitative content analysis process. J Adv Nurs 62, 1: 107--115.",
      "doi": ""
    },
    {
      "text": "John H. Falk and Lynn Diane Dierking. 2012. The Museum Experience Revisited. Routledge, London, England.",
      "doi": ""
    },
    {
      "text": "Erika Fischer-Lichte. 2008. The Transformative Power of Performance. Taylor And Francis.",
      "doi": ""
    },
    {
      "text": "Martin Forsberg and Jenny Nordberg. Doppelgänger. Retrieved August 30, 2019 from http://jenny-nordberg.com/node/40",
      "doi": ""
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, and Boriana Koleva. 2014. Gifting Personal Interpretations in Galleries. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 625--634.",
      "doi": "10.1145/2556288.2557259"
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva, and Patrick Brundell. 2013. 'See Me, Feel Me, Touch Me, Hear Me': Trajectories and Interpretation in a Sculpture Garden. CHI 2013: Changing Perspectives, ACM, 149--158.",
      "doi": "10.1145/2470654.2470675"
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, et al. 2004. The Drift Table: Designing for Ludic Engagement. CHI '04 Extended Abstracts on Human Factors in Computing Systems, ACM, 885--900.",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Carina González, Alberto Mora, and Pedro Toledo. 2014. Gamification in intelligent tutoring systems. Second International Conference on Technological Ecosystems for Enhancing Multiculturality, ACM, 221--225.",
      "doi": "10.1145/2669711.2669903"
    },
    {
      "text": "Rebecca E. Grinter, Paul M. Aoki, Margaret H. Szymanski, James D. Thornton, Allison Woodruff, and Amy Hurst. 2002. Revisiting the Visit: Understanding How Technology Can Shape the Museum Visit. Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work, ACM Press, 146--155.",
      "doi": "10.1145/587078.587100"
    },
    {
      "text": "Karin Hammarberg, Maggie Kirkman, and Sheryl de Lacey. 2016. Qualitative research methods: when touse them and how to judge them. Human Reproduction 31, 498--501.",
      "doi": ""
    },
    {
      "text": "Marek Hatala and Ron Wakkary. 2005. Ontology-based user modelling in an augmented audio reality system for museums. UMUAI 15, 3--4: 339--380.",
      "doi": ""
    },
    {
      "text": "Adrian Hazzard, Steve Benford, and Gary Burnett. 2015. Sculpting a mobile music soundtrack. SIGCHI Conference on Human Factors in Computing Systems, 387--396.",
      "doi": ""
    },
    {
      "text": "Christian Heath and Dirk Vom Lehn. 2004. Configuring reception. (Dis-)regarding the 'spectator' in museums and galleries. Theory, Culture & Society 21, 6: 43 -- 65.",
      "doi": ""
    },
    {
      "text": "George E. Hein. 1998. Learning in the Museum. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Thomas S. Henricks. 2015. Play and the Human Condition. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Janna Holmstedt. 2012. Limit-cruisers (#1 Sphere). Retrieved August 30, 2019 from http://www.jannaholmstedt.com/works/limitcruisers_weld.html",
      "doi": ""
    },
    {
      "text": "Eilean Hooper-Greenhill. 1992. Museums and the Shaping of Knowledge. Routledge.",
      "doi": ""
    },
    {
      "text": "Eilean Hooper-Greenhill. 2006. Studying visitors. In S. MacDonald, ed., A Companion to Museum Studies. Blackwell, Oxford, 362--376.",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 1998. Homo Ludens: a study of the play-element in culture. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Stefan Kaegi and Jörg Karrenbauer. Remote X. Retrieved August 30, 2019 from https://www.rimini-protokoll.de/website/en/project/remote-x",
      "doi": ""
    },
    {
      "text": "Tsvi Kuflik, Oliviero Stock, Massimo Zancanaro, et al. 2011. A Visitor's Guide in an Active Museum: Presentations, Communications, and Reflection. Journal on Computing and Cultural Heritage (JOCCH) 3, 3: 1--25.",
      "doi": "10.1145/1921614.1921618"
    },
    {
      "text": "S Makri and A Blandford. 2011. What is serendipity? -- A workshop report. Information Research 16, 3. Retrieved August 30, 2019 from http://www.informationr.net/ir/16--3/paper491.html",
      "doi": ""
    },
    {
      "text": "D. Mulcahy. 2016. \"Sticky\" learning: Assembling bodies, objects and affects at the museum and beyond. In J. Coffey, S. Budgeon, and H. Cahill, eds., Learning Bodies: The Body in Youth and Childhood Studies. Springer, Singapore, 207--222.",
      "doi": ""
    },
    {
      "text": "Jan Packer. 2008. Beyond learning: Exploring visitors' perceptions of the value and benefits of museum experiences. Curator 51, 33--54.",
      "doi": ""
    },
    {
      "text": "Andrew Pekarik, Zahava D. Doering, and David A. Karns. 1999. Exploring Satisfying Experiences in Museums. Curator: The Museum Journal 42, 2: 152--173.",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli and Elena Not. 2005. User-centred design of flexible hypermedia for a mobile guide: reflections on the hyperaudio experience. User Modeling and User-Adapted Interaction 15, 3--4: 303--338.",
      "doi": "10.1007/s11257-005-8816-1"
    },
    {
      "text": "Katie Salen and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Keith R. Sawyer. 1999. The emergence of creativity. Philosophical Psychology 12, 447--469.",
      "doi": ""
    },
    {
      "text": "Keith R. Sawyer. 2002. Unresolved tensions in sociocultural theory: analogies with contemporary sociological debates. Culture & Psychology 8, 3: 283--305.",
      "doi": ""
    },
    {
      "text": "Richard Schechner. 1988. Playing. Play & Culture 1, 1: 3--19.",
      "doi": ""
    },
    {
      "text": "Miguel Sicart. 2014. Play Matters. MIT Press.",
      "doi": ""
    },
    {
      "text": "Lois H. Silverman. 1995. Visitor Meaning? Making in Museums for a New Age. Curator: The Museum Journal 38, 3: 161--170.",
      "doi": ""
    },
    {
      "text": "Laurajane Smith, Margret Wetherell, and Gary Campbell, eds. 2018. Emotion, Affective Practices, and the Past in the Present. Routledge.",
      "doi": ""
    },
    {
      "text": "Lisa F. Smith, Jeffrey K. Smith, and Pablo P. L. Tinio. 2017. Time Spent Viewing Art and Reading Labels. Psychology of Aesthetics Creativity and the Arts 11, 1: 77--85.",
      "doi": ""
    },
    {
      "text": "Jocelyn Spence, Benjamin Bedwell, Michelle Coleman, et al. 2019. Seeing with New Eyes: Designing for In-the-Wild Museum Gifting. Proceedings of ACM CHI Conference on Human Factors in Computing Systems (CHI 2019), ACM 1--13.",
      "doi": "10.1145/3290605.3300235"
    },
    {
      "text": "Jakko Stenros. 2012. In Defence of a Magic Circle: The Social, Mental and Cultural Boundaries of Play. 2012 International DiGRA Nordic Conference, 1--19.",
      "doi": ""
    },
    {
      "text": "Oliviero Stock, Massimo Zancanaro, Paolo Busetta, et al. 2007. Adaptive, intelligent presentation of information for the museum visitor in PEACH. User Modeling and User-Adapted Interaction 17, 3: 257--304.",
      "doi": "10.1007/s11257-007-9029-6"
    },
    {
      "text": "Robyn Taylor, John Bowers, Bettina Nissen, et al. 2015. Making Magic: Designing for Open Interactions in Museum Settings. Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, 313--322.",
      "doi": "10.1145/2757226.2757241"
    },
    {
      "text": "Peter Tolmie, Steve Benford, Chris Greenhalgh, Tom Rodden, and Stuart Reeves. 2014. Supporting Group Interactions in Museum Visiting. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1049--1059.",
      "doi": "10.1145/2531602.2531619"
    },
    {
      "text": "Maria Vayanou, Yannis Ioannidis, George Loumos, and Antonis Kargas. 2019. How to play storytelling games with masterpieces: from art galleries to hybrid board games. Journal of Computers in Education 6, 1: 79--116.",
      "doi": ""
    },
    {
      "text": "Vassilios Vlahakis, Thomas Pliakas, Athanasios M. Demiris, and Nikolaos Ioannidis. 2003. Design and Application of an Augmented Reality System for continuous, context-sensitive guided tours of indoor and outdoor cultural sites and museums. VAST, 155--164.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary and Marek Hatala. 2007. Situated play in a tangible interface and adaptive audio museum guide. Personal and Ubiquitous Computing 11, 3: 171--191.",
      "doi": "10.1007/s00779-006-0101-8"
    },
    {
      "text": "James V. Wertsch. 1989. A Sociocultural Approach To Mind: Some Theoretical Considerations. Cultural Dynamics 2, 2: 140--161.",
      "doi": ""
    },
    {
      "text": "D Worts. 1992. Visitor-centered experiences. In A. Benefield, S. Bitgood, and H. Shettel, eds., Visitor studies: theory, research, and practice, volume 4. Center for Social Design, Jacksonville, Ala, 156--161.",
      "doi": ""
    },
    {
      "text": "Nikoleta Yiannoutsou, Ioanna Papadimitriou, Vassilis Komis, and Nikolaos Avouris. 2009. \"Playing with\" Museum Exhibits: Designing Educational Games Mediated by Mobile Technology. IDC 2009 -- Short Papers, 230--233.",
      "doi": "10.1145/1551788.1551837"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design as a Method for Interaction Design Research in HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 493--502.",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "2001. Can You See Me Now? Blast Theory. Retrieved August 30, 2019 from http://www.blasttheory.co.uk/projects/can-you-see-me-now/",
      "doi": ""
    },
    {
      "text": "The SFMOMA Audio App. SFMOMA.",
      "doi": ""
    }
  ]
}