{
  "doi": "10.1145/3313831.3376884",
  "title": "Autonomous Vehicle-Cyclist Interaction: Peril and Promise",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Autonomous vehicles (AVs) will redefine interactions between road users. Presently, cyclists and drivers communicate through implicit cues (vehicle motion) and explicit but imprecise signals (hand gestures, horns). Future AVs could consistently communicate awareness and intent and other feedback to cyclists based on their sensor data. We present an exploration of AV-cyclist interaction, starting with preliminary design studies which informed the implementation of an immersive VR AV-cyclist simulator, and the design and evaluation of a number of AV-cyclist interfaces. Our findings suggest that AV-cyclist interfaces can improve rider confidence in lane merging scenarios. We contribute an AV-cyclist immersive simulator, insights on trade-offs of various aspects of AV-cyclist interaction design including modalities, location, and complexity, and positive results suggesting improved rider confidence due to AV-cyclist interaction. While we are encouraged by the potential positive impact AV-cyclist interfaces can have on cyclist culture, we also emphasize the risks over-reliance can pose to cyclists.",
  "authors": [
    {
      "name": "Ming Hou",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528932",
      "orcid": "missing"
    },
    {
      "name": "Karthik Mahadevan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659246758",
      "orcid": "0000-0002-3178-267X"
    },
    {
      "name": "Sowmya Somanath",
      "institution": "University of Victoria, Victoria, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490691992",
      "orcid": "missing"
    },
    {
      "name": "Ehud Sharlin",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-81339528031/rel-imgonly/ehud.jpg",
      "acmid": "81339528031",
      "orcid": "missing"
    },
    {
      "name": "Lora Oehlberg",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436599468",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Peter Apasnore, Karim Ismail, and Ali Kassim. 2017. Bicycle-vehicle interactions at mid-sections of mixed traffic streets: Examining passing distance and bicycle comfort perception. Accident Analysis and Prevention 106 (sep 2017), 141--148. DOI: http://dx.doi.org/10.1016/j.aap.2017.05.003",
      "doi": ""
    },
    {
      "text": "Corey H. Basch, Danna Ethan, and Charles E. Basch. 2019. Bike Lane Obstructions in Manhattan, New York City: Implications for Bicyclist Safety. Journal of Community Health 44, 2 (apr 2019), 396--399. DOI: http://dx.doi.org/10.1007/s10900-018-00596--4",
      "doi": ""
    },
    {
      "text": "Silvia Bernardi and Federico Rupi. 2015. An analysis of bicycle travel speed and disturbances on off-street and on-street facilities. Transportation Research Procedia 5 (2015), 82--94. DOI: http://dx.doi.org/10.1016/j.trpro.2015.01.004",
      "doi": ""
    },
    {
      "text": "Bryan Botello, Ralph Buehler, Steve Hankey, Andrew Mondschein, and Zhiqiu Jiang. 2019. Planning for walking and cycling in an autonomous-vehicle future. Transportation Research Interdisciplinary Perspectives 1 (jun 2019), 100012. DOI: http://dx.doi.org/10.1016/j.trip.2019.100012",
      "doi": ""
    },
    {
      "text": "Eric Broer, BikePGHm, and Alexandria Shewczyk. 2019. AV Survey Results 2019. (2019). https://www.bikepgh.org/our-work/advocacy/save/ av-survey-results-2019/",
      "doi": ""
    },
    {
      "text": "Chris Cavacuiti. 2009. An Overview of Cycling Research: Selected Facts, Statistics, Citations and Quotations. Technical Report. 1--69 pages. www.sharetheroad.ca",
      "doi": ""
    },
    {
      "text": "Christine Chaloupka-Risser and Elisabeth Füssl. 2017. The importance of communication between cyclists and other traffic participants and its potential in reducing traffic safety-critical events. Transactions on Transport Sciences 8, 1 (apr 2017), 24--30. DOI: http://dx.doi.org/10.5507/tots.2017.004",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Lesley J. Strawderman, and Daniel W. Carruth. 2018. Investigating pedestrian suggestions for external features on fully autonomous vehicles: A virtual reality experiment. Transportation Research Part F: Traffic Psychology and Behaviour 59 (nov 2018), 135--149. DOI: http://dx.doi.org/10.1016/j.trf.2018.08.016",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques Terken. 2018. Interface concepts for intent communication from autonomous vehicles to vulnerable road users. In Adjunct Proceedings - 10th International ACM Conference on Automotive User Interfaces and Interactive Vehicular Applications, AutomotiveUI 2018. Association for Computing Machinery, Inc, 82--86. DOI: http://dx.doi.org/10.1145/3239092.3265946",
      "doi": "10.1145/3239092.3265946"
    },
    {
      "text": "Jennifer Dill and John Gliebe. 2008. Understanding and Measuring Bicycling Behavior: A Focus on Travel Time and Route choice. Technical Report December. 1--74 pages. DOI: http://dx.doi.org/OTREC-RR-08-03",
      "doi": ""
    },
    {
      "text": "Marjan P. Hagenzieker, Sander van der Kint, Luuk Vissers, Ingrid N.L.G. van Schagen, Jonathan de Bruin, Paul van Gent, and Jacques J.F. Commandeur. 2019. Interactions between cyclists and automated vehicles: Results of a photo experiment *. Journal of Transportation Safety and Security (2019). DOI: http://dx.doi.org/10.1080/19439962.2019.1591556",
      "doi": ""
    },
    {
      "text": "Henrik KretzschmarJiajun Zhu. 2014. Cyclist hand signal detection by an autonomous vehicle. (2014). https://patents.google.com/patent/US9014905B1/en",
      "doi": ""
    },
    {
      "text": "R. Herpers, W. Heiden, M. Kutz, D. Scherfgen, U. Hartmann, J. Bongartz, and O. Schulzyk. 2008. FIVIS bicycle simulator - An immersiv game platform for physical activities. In ACM Future Play 2008 International Academic Conference on the Future of Game Design and Technology, Future Play: Research, Play, Share. 244--247. DOI: http://dx.doi.org/10.1145/1496984.1497035",
      "doi": ""
    },
    {
      "text": "Joon Ki Kim, Sungyop Kim, Gudmundur F. Ulfarsson, and Luis A. Porrello. 2007. Bicyclist injury severities in bicycle-motor vehicle accidents. Accident Analysis and Prevention 39, 2 (mar 2007), 238--251. DOI: http://dx.doi.org/10.1016/j.aap.2006.07.002",
      "doi": ""
    },
    {
      "text": "Valerian Kwigizile, Jun-seok Oh, Pavel Ikonomov, Raed Hasan, Cole G Villalobos, Aous Hammad Kurdi, and Anil Shaw. 2017. Real Time Bicycle Simulation Study of Bicyclists ' Behaviors and their Implication on Safety FINAL REPORT. Technical Report. https://rosap.ntl.bts.gov/view/dot/34885",
      "doi": ""
    },
    {
      "text": "Brendan M. Lawrence, Jennifer A. Oxley, David B. Logan, and Mark R. Stevenson. 2018. Cyclist exposure to the risk of car door collisions in mixed function activity centers: A study in Melbourne, Australia. Traffic Injury Prevention 19 (feb 2018), S164--S168. DOI: http://dx.doi.org/10.1080/15389588.2017.1380306",
      "doi": ""
    },
    {
      "text": "Karthik Mahadevan, Elaheh Sanoubari, Sowmya Somanath, James E. Young, and Ehud Sharlin. 2019. AV-Pedestrian Interaction Design Using a Pedestrian Mixed Traffic Simulator. Association for Computing Machinery (ACM), 475--486. DOI: http://dx.doi.org/10.1145/3322276.3322328",
      "doi": ""
    },
    {
      "text": "Karthik Mahadevan, Sowmya Somanath, and Ehud Sharlin. 2018. Communicating awareness and intent in autonomous vehicle-pedestrian interaction. In Conference on Human Factors in Computing Systems Proceedings, Vol. 2018-April. Association for Computing Machinery. DOI: http://dx.doi.org/10.1145/3173574.3174003",
      "doi": "10.1145/3173574.3174003"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Shadan Sadeghian Borojeni, Yannick Feld, Wilko Heuten, and Susanne Boll. 2018. Augmenting bicycles and helmets with multimodal warnings for children. In MobileHCI 2018 - Beyond Mobile: The Next 20 Years 20th International Conference on Human-Computer Interaction with Mobile Devices and Services, Conference Proceedings. Association for Computing Machinery, Inc. DOI: http://dx.doi.org/10.1145/3229434.3229479",
      "doi": ""
    },
    {
      "text": "Peter Melinat, Tolja Kreuzkam, and Dirk Stamer. 2014. Information Overload : A Systematic Literature Review Theoretical Background : Information Overload. International Conference on Business Informatics Research (2014), 72--86. DOI: http://dx.doi.org/10.13140/2.1.4293.7606",
      "doi": ""
    },
    {
      "text": "Natasha Merat, Tyron Louw, Ruth Madigan, Marc Wilbrink, and Anna Schieben. 2018. What externally presented information do VRUs require when interacting with fully Automated Road Transport Systems in shared space? Accident Analysis and Prevention 118 (sep 2018), 244--252. DOI: http://dx.doi.org/10.1016/j.aap.2018.03.018",
      "doi": ""
    },
    {
      "text": "Adam Millard-Ball. 2018. Pedestrians, Autonomous Vehicles, and Cities. Journal of Planning Education and Research 38, 1 (mar 2018), 6--12. DOI: http://dx.doi.org/10.1177/0739456X16675674",
      "doi": ""
    },
    {
      "text": "Masayuki Miyadai, Teruo Uetake, and Masahiro Shimoda. 2012. How does a cyclist avoid obstacles? Journal of human ergology 41 (12 2012), 95--100.",
      "doi": ""
    },
    {
      "text": "Lars Möller, Malte Risto, and Colleen Emmenegger. 2016. The social behavior of autonomous vehicles. In UbiComp 2016 Adjunct - Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. Association for Computing Machinery, Inc, 686--689. DOI: http://dx.doi.org/10.1145/2968219.2968561",
      "doi": "10.1145/2968219.2968561"
    },
    {
      "text": "Michael J. Muller. 1991. PICTIVE - An exploration in participatory design. Conference on Human Factors in Computing Systems - Proceedings (1991), 225--231. DOI: http://dx.doi.org/10.1145/108844.108896",
      "doi": "10.1145/108844.108896"
    },
    {
      "text": "Mohsen Nazemi, Michael A.B. van Eggermond, Alexander Erath, and Kay W. Axhausen. 2019. Studying cyclists' behavior in a non-naturalistic experiment utilizing cycling simulator with immersive virtual reality. TRB Annual Meeting Online (2019), 19--02954. DOI: http://dx.doi.org/10.3929/ETHZ-B-000297131",
      "doi": ""
    },
    {
      "text": "Ontario Ministry of Transportation. 2015. Cycling Skills: Ontario's Guide to Safe Cycling. Technical Report. 1--40 pages. www.mto.gov.on.ca",
      "doi": ""
    },
    {
      "text": "Praveena Penmetsa, Emmanuel Kofi Adanu, Dustin Wood, Teng Wang, and Steven L. Jones. 2019. Perceptions and expectations of autonomous vehicles â ? A¸ S A snapshot of vulnerable road user opinion. Technological Forecasting and Social Change 143 (jun 2019), 9--13. DOI: http://dx.doi.org/10.1016/j.techfore.2019.02.010",
      "doi": ""
    },
    {
      "text": "Amir Rasouli and John K. Tsotsos. 2019. Autonomous Vehicles That Interact With Pedestrians: A Survey of Theory and Practice. IEEE Transactions on Intelligent Transportation Systems (mar 2019), 1--19. DOI: http://dx.doi.org/10.1109/tits.2019.2901817",
      "doi": ""
    },
    {
      "text": "Carlos Sun and Zhu Qing. 2018. Design and Construction of a Virtual Bicycle Simulator for Evaluating Sustainable Facilities Design. Advances in Civil Engineering 2018 (2018). DOI: http://dx.doi.org/10.1155/2018/5735820",
      "doi": ""
    },
    {
      "text": "A. Y.J. Szeto, N. C. Valerio, and R. E. Novak. 1991. Audible pedestrian traffic signals: Part 3. Detectability. Journal of Rehabilitation Research and Development 28, 2 (1991), 71--78. DOI: http://dx.doi.org/10.1682/JRRD.1991.04.0065",
      "doi": ""
    },
    {
      "text": "Mathias Trefzger, Tanja Blascheck, Michael Raschke, Sarah Hausmann, and Thomas Schlegel. 2018. A visual comparison of gaze behavior from pedestrians and cyclists. In Eye Tracking Research and Applications Symposium (ETRA). Association for Computing Machinery. DOI: http://dx.doi.org/10.1145/3204493.3204553",
      "doi": ""
    },
    {
      "text": "Sergio A. Useche, Luis Montoro, Jaime Sanmartin, and Francisco Alonso. 2019. Healthy but risky: A descriptive study on cyclists' encouraging and discouraging factors for using bicycles, habits and safety outcomes. Transportation Research Part F: Traffic Psychology and Behaviour 62 (apr 2019), 587--598. DOI: http://dx.doi.org/10.1016/j.trf.2019.02.014",
      "doi": ""
    },
    {
      "text": "Nithya Vijayakumar and Cherise Burda. 2015. Cycle Cities Supporting cycling in Canadian cities. Technical Report.",
      "doi": ""
    },
    {
      "text": "Luuk Vissers, Sander Van Der Kint, Ingrid Van Schagen, and Marjan P Hagenzieker. 2017. Safe interaction between. January (2017). DOI: http://dx.doi.org/10.13140/RG.2.2.23988.86408",
      "doi": ""
    }
  ]
}