{
  "doi": "10.1145/3313831.3376145",
  "title": "\"Hey Model!\" – Natural User Interactions and Agency in Accessible Interactive 3D Models",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "While developments in 3D printing have opened up opportunities for improved access to graphical information for people who are blind or have low vision (BLV), they can provide only limited detailed and contextual information. Interactive 3D printed models (I3Ms) that provide audio labels and/or a conversational agent interface potentially overcome this limitation. We conducted a Wizard-of-Oz exploratory study to uncover the multi-modal interaction techniques that BLV people would like to use when exploring I3Ms, and investigated their attitudes towards different levels of model agency. These findings informed the creation of an I3M prototype of the solar system. A second user study with this model revealed a hierarchy of interaction, with BLV users preferring tactile exploration, followed by touch gestures to trigger audio labels, and then natural language to fill in knowledge gaps and confirm understanding.",
  "tags": [
    "accessibility",
    "individuals with disabilities & assistive technologies",
    "input techniques",
    "touch/haptic/pointing/gesture"
  ],
  "authors": [
    {
      "name": "Samuel Reinders",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659476359",
      "orcid": "missing"
    },
    {
      "name": "Matthew Butler",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508687882",
      "orcid": "0000-0002-7950-5495"
    },
    {
      "name": "Kim Marriott",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320492504",
      "orcid": "0000-0002-9813-0377"
    }
  ],
  "references": [
    {
      "text": "Nazatul Naquiah Abd Hamid and Alistair D.N. Edwards. 2013. Facilitating Route Learning Using Interactive Audio-tactile Maps for Blind and Visually Impaired People. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 37--42. DOI: http://dx.doi.org/10.1145/2468356.2468364",
      "doi": "10.1145/2468356.2468364"
    },
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M. Branham. 2018. \"Siri Talks at You\": An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18). ACM, NY, NY, USA, 249--258. DOI: http://dx.doi.org/10.1145/3234695.3236344",
      "doi": "10.1145/3234695.3236344"
    },
    {
      "text": "David Akers. 2006. Wizard of Oz for Participatory Design: Inventing a Gestural Interface for 3D Selection of Neural Pathway Estimates. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 454--459. DOI: http://dx.doi.org/10.1145/1125451.1125552",
      "doi": "10.1145/1125451.1125552"
    },
    {
      "text": "Vikas Ashok, Yevgen Borodin, Svetlana Stoyanchev, Yuri Puzis, and I. V. Ramakrishnan. 2014. Wizard-of-Oz Evaluation of Speech-driven Web Browsing Interface for People with Vision Impairments. In Proceedings of the 11th Web for All Conference (W4A '14). ACM, NY, NY, USA, Article 12, 9 pages. DOI: http://dx.doi.org/10.1145/2596695.2596699",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Nicole B. Lee. 2013. Exploring the Use of Speech Input by Blind People on Mobile Devices. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, NY, NY, USA, Article 11, 8 pages. DOI: http://dx.doi.org/10.1145/2513383.2513440",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "Saminda Sundeepa Balasuriya, Laurianne Sitbon, Andrew A. Bayor, Maria Hoogstrate, and Margot Brereton. 2018. Use of Voice Activated Interfaces by People with Intellectual Disability. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI '18). ACM, NY, NY, USA, 102--112. DOI: http://dx.doi.org/10.1145/3292147.3292161",
      "doi": "10.1145/3292147.3292161"
    },
    {
      "text": "Christoph Bartneck, Dana Kuli´ c, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement Instruments for the Anthropomorphism, Animacy, Likeability, Perceived Intelligence, and Perceived Safety of Robots. International Journal of Social Robotics 1, 1 (01 Jan 2009), 71--81. DOI: http://dx.doi.org/10.1007/s12369-008-0001--3",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore, Daniel Schulman, and Candace Sidner. 2013. Automated interventions for multiple health behaviors using conversational agents. Patient Education and Counseling 92, 2 (2013), 142 -- 148. DOI: http://dx.doi.org/https://doi.org/10.1016/j.pec.2013.05.011",
      "doi": ""
    },
    {
      "text": "Syed Masum Billah, Vikas Ashok, and IV Ramakrishnan. 2018. Write-it-Yourself with the Aid of Smartwatches: A Wizard-of-Oz Experiment with Blind People. In 23rd International Conference on Intelligent User Interfaces (IUI '18). ACM, NY, NY, USA, 427--431. DOI: http://dx.doi.org/10.1145/3172944.3173005",
      "doi": "10.1145/3172944.3173005"
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: Automatically Generated Tactile Visualizations of Coordinate Spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 131--138. DOI: http://dx.doi.org/10.1145/2148131.2148160",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frederic Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 445--457. DOI: http://dx.doi.org/10.1145/2858036.2858375",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Trans. Access. Comput. 8, 3, Article 11 (March 2016), 28 pages. DOI: http://dx.doi.org/10.1145/2870640",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Matthew Butler, Leona Holloway, Kim Marriott, and Cagatay Goncu. 2017. Understanding the graphical challenges faced by vision-impaired students in Australian universities. Higher Education Research & Development 36, 1 (2017), 59--72. DOI: http://dx.doi.org/10.1080/07294360.2016.1177001",
      "doi": ""
    },
    {
      "text": "Justine Cassell. 2000. More than just another pretty face: Embodied conversational interface agents. Commun. ACM 43, 4 (2000), 70--78.",
      "doi": "10.1145/332051.332075"
    },
    {
      "text": "Alistair D. N. Edwards, Nazatul Naquiah Abd Hamid, and Helen Petrie. 2015. Exploring Map Orientation with Interactive Audio-Tactile Maps. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 72--79.",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud, Anke M Brock, Marc J-M Macé, and Christophe Jouffrais. 2017. Map learning with a 3D printed interactive small-scale model: Improvement of space and text memorization in visually impaired students. Frontiers in Psychology 8, 930 (2017). DOI: http://dx.doi.org/10.3389/fpsyg.2017.00930",
      "doi": ""
    },
    {
      "text": "Cagatay Goncu and Kim Marriott. 2011. GraVVITAS: Generic Multi-touch Presentation of Accessible Graphics. In Human-Computer Interaction -- INTERACT 2011, Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 30--48.",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann. 2016. LucentMaps: 3D Printed Audiovisual Tactile Maps for Blind and Visually Impaired People. In Proc. ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '16). ACM, 81--90. DOI: http://dx.doi.org/10.1145/2982142.2982163",
      "doi": "10.1145/2982142.2982163"
    },
    {
      "text": "Timo Götzelmann and Aleksander Pavkovic. 2014. Towards Automatically Generated Tactile Detail Maps by 3D Printers for Blind Persons. In Computers Helping People with Special Needs, Klaus Miesenberger, Deborah Fels, Dominique Archambault, Petr Penáz, and Wolfgang Zagler (Eds.). Springer International Publishing, 1--7. DOI: http://dx.doi.org/10.1007/978--3--319-08599--9_1",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, Joaquim Lloverás, and Lola Merino. 2012. Visual Impairment and urban orientation. Pilot study with tactile maps produced through 3D Printing. Psyecology 3, 2 (2012), 239--250.",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Matthew Butler, and Kim Marriott. 2018. Accessible maps for the blind: Comparing 3D printed models with tactile graphics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '18). ACM. DOI: http://dx.doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Michele Hu. 2015. Exploring New Paradigms for Accessible 3D Printed Graphs. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, NY, NY, USA, 365--366. DOI: http://dx.doi.org/10.1145/2700648.2811330",
      "doi": "10.1145/2700648.2811330"
    },
    {
      "text": "Peter H. Kahn, Nathan G. Freier, Takayuki Kanda, Hiroshi Ishiguro, Jolina H. Ruckert, Rachel L. Severson, and Shaun K. Kane. 2008. Design Patterns for Sociality in Human-robot Interaction. In Proceedings of the 3rd ACM/IEEE International Conference on Human Robot Interaction (HRI '08). ACM, NY, NY, USA, 97--104. DOI: http://dx.doi.org/10.1145/1349822.1349836",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking@ stemxcomet: teaching programming to blind students via 3D printing, crisis management, and twitter. In Proceedings of the 45th ACM technical symposium on Computer science education. ACM, 247--252.",
      "doi": ""
    },
    {
      "text": "J. F. Kelley. 1984. An Iterative Design Methodology for User-friendly Natural Language Office Information Applications. ACM Trans. Inf. Syst. 2, 1 (Jan. 1984), 26--41. DOI: http://dx.doi.org/10.1145/357417.357420",
      "doi": "10.1145/357417.357420"
    },
    {
      "text": "Jeeeun Kim and Tom Yeh. 2015. Toward 3D-printed movable tactile pictures for children with visual impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2815--2824.",
      "doi": "10.1145/2702123.2702144"
    },
    {
      "text": "Liliana Laranjo, Adam G Dunn, Huong Ly Tong, Ahmet Baki Kocaballi, Jessica Chen, Rabia Bashir, Didi Surian, Blanca Gallego, Farah Magrabi, Annie Y S Lau, and Enrico Coiera. 2018. Conversational agents in healthcare: a systematic review. Journal of the American Medical Informatics Association 25, 9 (07 2018), 1248--1258. DOI: http://dx.doi.org/10.1093/jamia/ocy072",
      "doi": ""
    },
    {
      "text": "Richard Mayer, Kristina Sobko, and Patricia D. Mautone. 2003. Social Cues in Multimedia Learning: Role of Speaker's Voice. Journal of Educational Psychology 95 (06 2003), 419--425. DOI: http://dx.doi.org/10.1037/0022-0663.95.2.419",
      "doi": ""
    },
    {
      "text": "Samantha McDonald, Joshua Dutterer, Ali Abdolrahmani, Shaun K. Kane, and Amy Hurst. 2014. Tactile Aids for Visually Impaired Graphical Design Education. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, NY, NY, USA, 275--276. DOI: http://dx.doi.org/10.1145/2661334.2661392",
      "doi": "10.1145/2661334.2661392"
    },
    {
      "text": "Roxana Moreno, Richard E. Mayer, Hiller A. Spires, and James C. Lester. 2001. The Case for Social Agency in Computer-Based Teaching: Do Students Learn More Deeply When They Interact With Animated Pedagogical Agents? Cognition and Instruction 19, 2 (2001), 177--213. DOI: http://dx.doi.org/10.1207/S1532690XCI1902_02",
      "doi": ""
    },
    {
      "text": "Svetlana Nikitina, Sara Callaioli, and Marcos Baez. 2018. Smart Conversational Agents for Reminiscence. In Proceedings of the 1st International Workshop on Software Engineering for Cognitive Services (SE4COG '18). ACM, NY, NY, USA, 52--57. DOI: http://dx.doi.org/10.1145/3195555.3195567",
      "doi": "10.1145/3195555.3195567"
    },
    {
      "text": "National Federation of the Blind. 2009. The Braille Literacy Crisis in America: Facing the Truth, Reversing the Trend, Empowering the Blind. (2009). Available from https://nfb.org/images/nfb/documents/pdf/ braille_literacy_report_web.pdf.",
      "doi": ""
    },
    {
      "text": "Helen Petrie, Christoph Schlieder, Paul Blenkhorn, Gareth Evans, Alasdair King, Anne-Marie O'Neill, George T. Ioannidis, Blaithin Gallagher, David Crombie, Rolf Mager, and Maurizio Alafaci. 2002. TeDUB: A System for Presenting and Exploring Technical Drawings for Blind People. In Computers Helping People with Special Needs, Klaus Miesenberger, Joachim Klaus, and Wolfgang Zagler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 537--539.",
      "doi": ""
    },
    {
      "text": "Benjamin Poppinga, Charlotte Magnusson, Martin Pielot, and Kirsten Rassmus-Gröhn. 2011. TouchOver Map: Audio-tactile Exploration of Interactive Maps. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 545--550. DOI: http://dx.doi.org/10.1145/2037373.2037458",
      "doi": "10.1145/2037373.2037458"
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. \"Accessibility Came by Accident\": Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 459, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174033",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "Joshua Rader, Troy McDaniel, Artemio Ramirez, Shantanu Bala, and Sethuraman Panchanathan. 2014. A Wizard of Oz Study Exploring How Agreement/Disagreement Nonverbal Cues Enhance Social Interactions for Individuals Who Are Blind. In HCI International 2014 - Posters' Extended Abstracts, Constantine Stephanidis (Ed.). Springer International Publishing, Cham, 243--248.",
      "doi": ""
    },
    {
      "text": "Leah M. Reeves, Jennifer Lai, James A. Larson, Sharon Oviatt, T. S. Balaji, Stéphanie Buisine, Penny Collings, Phil Cohen, Ben Kraal, Jean-Claude Martin, Michael McTear, TV Raman, Kay M. Stanney, Hui Su, and Qian Ying Wang. 2004. Guidelines for Multimodal User Interface Design. Commun. ACM 47, 1 (Jan. 2004), 57--59. DOI: http://dx.doi.org/10.1145/962081.962106",
      "doi": "10.1145/962081.962106"
    },
    {
      "text": "Andreas Reichinger, Anton Fuhrmann, Stefan Maierhofer, and Werner Purgathofer. 2016. Gesture-Based Interactive Audio Guide on Tactile Reliefs. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 91--100. DOI: http://dx.doi.org/10.1145/2982142.2982176",
      "doi": "10.1145/2982142.2982176"
    },
    {
      "text": "V. Rossetti, Francesco Furfari, B. Leporini, S. Pelagatti, A. Quarta, V. Rossetti, F. Furfari, B. Leporini, Susanna Pelagatti, and A. Quarta. 2018. Enabling Access to Cultural Heritage for the visually impaired: an Interactive 3D model of a Cultural Site. Procedia Computer Science 130 (2018), 383--391.",
      "doi": "10.1016/j.procs.2018.04.057"
    },
    {
      "text": "Jonathan Rowell and Simon Ungar. 2003. The world of touch: an international survey of tactile maps. Part 1: production. British Journal of Visual Impairment 21, 3 (2003), 98--104. DOI: http://dx.doi.org/10.1177/026461960302100303",
      "doi": ""
    },
    {
      "text": "Noah L. Schroeder, Olusola O. Adesope, and Rachel Barouch Gilbert. 2013. How Effective are Pedagogical Agents for Learning? A Meta-Analytic Review. Journal of Educational Computing Research 49, 1 (2013), 1--39. DOI: http://dx.doi.org/10.2190/EC.49.1.a",
      "doi": ""
    },
    {
      "text": "Lei Shi, Holly Lawson, Zhuohao Zhang, and Shiri Azenkot. 2019. Designing Interactive 3D Printed Models with Teachers of the Visually Impaired. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 197, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300427",
      "doi": "10.1145/3290605.3300427"
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and Talker: An accessible labeling toolkit for 3D printed models. In Proceedings of the 34rd Annual ACM Conference on Human Factors in Computing Systems (CHI'16). DOI: http://dx.doi.org/10.1145/2858036.2858507",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017a. Designing Interactions for 3D Printed Models with Blind People. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, NY, NY, USA, 200--209. DOI: http://dx.doi.org/10.1145/3132525.3132549",
      "doi": "10.1145/3132525.3132549"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017b. Markit and Talkit: A Low-Barrier Toolkit to Augment 3D Printed Models with Audio Annotations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 493--506. DOI: http://dx.doi.org/10.1145/3126594.3126650",
      "doi": "10.1145/3126594.3126650"
    },
    {
      "text": "Abigale Stangl, Chia-Lo Hsu, and Tom Yeh. 2015. Transcribing Across the Senses: Community Efforts to Create 3D Printable Accessible Tactile Pictures for Young Children with Visual Impairments. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, NY, NY, USA, 127--137. DOI: http://dx.doi.org/10.1145/2700648.2809854",
      "doi": "10.1145/2700648.2809854"
    },
    {
      "text": "Brandon T. Taylor, Anind K. Dey, Dan P. Siewiorek, and Asim Smailagic. 2015. TactileMaps.net: A web interface for generating customized 3D-printable tactile maps. In Proc. ACM SIGACCESS Conference on Computers & Accessibility. ACM, 427--428. DOI: http://dx.doi.org/10.1145/2700648.2811336",
      "doi": "10.1145/2700648.2811336"
    },
    {
      "text": "Alexandra Vtyurina and Adam Fourney. 2018. Exploring the Role of Conversational Cues in Guided Task Support with Virtual Assistants. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 208, 7 pages. DOI: http://dx.doi.org/10.1145/3173574.3173782",
      "doi": "10.1145/3173574.3173782"
    },
    {
      "text": "Alice Watson, Timothy Bickmore, Abby Cange, Ambar Kulshreshtha, and Joseph Kvedar. 2012. An Internet-Based Virtual Coach to Promote Physical Activity Adherence in Overweight Adults: Randomized Controlled Trial. J Med Internet Res 14, 1 (26 Jan 2012), e1. DOI: http://dx.doi.org/10.2196/jmir.1629",
      "doi": ""
    },
    {
      "text": "Henry B Wedler, Sarah R Cohen, Rebecca L Davis, Jason G Harrison, Matthew R Siebert, Dan Willenbring, Christian S Hamann, Jared T Shaw, and Dean J Tantillo. 2012. Applied computational chemistry for the blind and visually impaired. Journal of Chemical Education 89, 11 (2012), 1400--1404.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1083--1092. DOI: http://dx.doi.org/10.1145/1518701.1518866",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}