{
  "doi": "10.1145/3313831.3376458",
  "title": "Supporting the Supporters of Unaccompanied Migrant Youth: Designing for Social-ecological Resilience",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Unaccompanied migrant youth, fleeing to a new country without their parents, are exposed to mental health risks. Resilience interventions mitigate such risks, but access can be hindered by systemic and personal barriers. While much work has recently addressed designing technology to promote mental health, none has focused on the needs of these populations. This paper presents the results of interviews with 18 professional/ volunteer support workers and 5 unaccompanied migrant youths, followed by three design workshops. The results point to the diverse systems that can facilitate youths' resilience development. The relationship between the youth and volunteers acting as mentors is particularly important for increasing resilience but comes with challenges. This suggests the relevance of a social-ecological model of resilience with a focus on designing technology to support the mentors in order to help them better support the youth. We conclude by mapping out the design space for mentor support.",
  "authors": [
    {
      "name": "Franziska Tachtler",
      "institution": "TU Wien, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020044",
      "orcid": "missing"
    },
    {
      "name": "Toni Michel",
      "institution": "TU Wien, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528125",
      "orcid": "missing"
    },
    {
      "name": "Petr Slovák",
      "institution": "King's College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611500",
      "orcid": "missing"
    },
    {
      "name": "Geraldine Fitzpatrick",
      "institution": "TU Wien, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Asam Almohamed, Dhaval Vyas, and Jinglan Zhang. 2017. Rebuilding Social Capital: Engaging Newly Arrived Refugees in Participatory Design. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (OZCHI '17). ACM, NY, NY, USA, 59--67. DOI: http://dx.doi.org/10.1145/3152771.3152778",
      "doi": "10.1145/3152771.3152778"
    },
    {
      "text": "Asam Almohamed, Dhaval Vyas, and Jinglan Zhang. 2018. Designing for Refugees: Insights from Design Workshop. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI '18). ACM, NY, NY, USA, 92--96. DOI: http://dx.doi.org/10.1145/3292147.3292196",
      "doi": "10.1145/3292147.3292196"
    },
    {
      "text": "Fernando Estrada Martinez de Alva, Greg Wadley, and Reeva Lederman. 2015. It Feels Different from Real Life: Users' Opinions of Mobile Applications for Mental Health. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, NY, NY, USA, 598--602. DOI: http://dx.doi.org/10.1145/2838739.2838806",
      "doi": "10.1145/2838739.2838806"
    },
    {
      "text": "Ofra Amir, Barbara J. Grosz, Krzysztof Z. Gajos, Sonja M. Swenson, and Lee M. Sanders. 2015. From Care Plans to Care Coordination: Opportunities for Computer Support of Teamwork in Complex Healthcare. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1419--1428. DOI: http://dx.doi.org/10.1145/2702123.2702320",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked Empowerment on Facebook Groups for Parents of Children with Special Needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2805--2814. DOI: http://dx.doi.org/10.1145/2702123.2702324",
      "doi": "10.1145/2702123.2702324"
    },
    {
      "text": "APA. 2020. The Road to Resilience. (2020). Retrieved January 7, 2020 from https://www.apa.org/helpcenter/road-resilience.",
      "doi": ""
    },
    {
      "text": "Asylkoordination. 2016. Nr. 3 Übersicht zum Asylverfahren. (2016). Retrieved January 7, 2020 from https://www.asyl.at/adincludes/dld.php?datei=173.01. ma,asylverfahren2016.pdf.",
      "doi": ""
    },
    {
      "text": "Asylkoordination. 2019. Nr. 3a Asylverfahren Stand Juni 2019. (2019). Retrieved January 7, 2020 from https://www.asyl.at/adincludes/dld.php?datei=173.02. ma,asylkoordinaten_2019_asylverfahren_web.pdf.",
      "doi": ""
    },
    {
      "text": "Bonnie Bernard. 1993. Fostering resiliency in kids. Educational leadership 51, 3 (1993), 44--48.",
      "doi": ""
    },
    {
      "text": "Bonnie Bernard. 1995. Fostering resilience in children (Report No. EDO-PS-95--9). Washington, DC: Department of Education.(ERIC Document Reproduction Service No. 386327) (1995).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. (2012).",
      "doi": ""
    },
    {
      "text": "Urie Bronfenbrenner. 1979. The ecology of human development. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Alice V. Brown and Jaz Hee-jeong Choi. 2018. Refugee and the Post-trauma Journeys in the Fuzzy Front End of Co-creative Practices. In Proceedings of the 15th Participatory Design Conference: Full Papers - Volume 1 (PDC '18). ACM, NY, NY, USA, Article 15, 11 pages. DOI: http://dx.doi.org/10.1145/3210586.3210598",
      "doi": "10.1145/3210586.3210598"
    },
    {
      "text": "Alice V Brown, Jaz Hee-Jeong Choi, and Jane Shakespeare-Finch. 2019. Care towards posttraumatic growth in the era of digital economy. CoDesign 15, 3 (2019), 212--227.",
      "doi": ""
    },
    {
      "text": "Deana Brown and Rebecca E. Grinter. 2016. Designing for Transient Use: A Human-in-the-loop Translation Platform for Refugees. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/2858036.2858230",
      "doi": ""
    },
    {
      "text": "Ana Maria Bustamante Duarte, Nina Brendel, Auriol Degbelo, and Christian Kray. 2018. Participatory Design and Participatory Research: An HCI Case Study with Young Forced Migrants. ACM Trans. Comput.-Hum. Interact. 25, 1, Article 3 (Feb. 2018), 39 pages. DOI: http://dx.doi.org/10.1145/3145472",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for Caregivers: Designing for Integrality. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 91--102. DOI: http://dx.doi.org/10.1145/2441776.2441789",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Lizzie Coles-Kemp and Rikke Bjerg Jensen. 2019. Accessing a New Land: Designing for a Social Conceptualisation of Access. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 181, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300411",
      "doi": "10.1145/3290605.3300411"
    },
    {
      "text": "David Coyle, Nicola McGlade, Gavin Doherty, and Gary O'Reilly. 2011. Exploratory Evaluations of a Computer Game Supporting Cognitive Behavioural Therapy for Adolescents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2937--2946. DOI: http://dx.doi.org/10.1145/1978942.1979378",
      "doi": "10.1145/1978942.1979378"
    },
    {
      "text": "Christopher A. Le Dantec. 2012. Participation and publics: supporting community engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1351--1360.",
      "doi": "10.1145/2207676.2208593"
    },
    {
      "text": "Christopher A. Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2 (2013), 241--264.",
      "doi": ""
    },
    {
      "text": "Tara Donker, Katherine Petrie, Judy Proudfoot, Janine Clarke, Mary-Rose Birch, and Helen Christensen. 2013. Smartphones for smarter delivery of mental health programs: a systematic review. Journal of medical Internet research 15, 11 (2013), e247.",
      "doi": ""
    },
    {
      "text": "Seyda Eruyar, Julia Huemer, and Panos Vostanis. 2018. How should child mental health services respond to the refugee crisis? Child and Adolescent Mental Health 23, 4 (2018), 303--312.",
      "doi": ""
    },
    {
      "text": "Mina Fazel and Theresa S Betancourt. 2018. Preventive mental health interventions for refugee children and adolescents in high-income settings. The Lancet Child & Adolescent Health 2, 2 (2018), 121--132.",
      "doi": ""
    },
    {
      "text": "Joseph Firth, John Torous, Jennifer Nicholas, Rebekah Carney, Abhishek Pratap, Simon Rosenbaum, and Jerome Sarris. 2017. The efficacy of smartphone-based mental health interventions for depressive symptoms: a meta-analysis of randomized controlled trials. World Psychiatry 16, 3 (2017), 287--298.",
      "doi": ""
    },
    {
      "text": "Karen E. Fisher, Katya Yefimova, and Eiad Yafi. 2016. Future's Butterflies: Co-Designing ICT Wayfaring Technology with Refugee Syrian Youth. In Proceedings of the The 15th International Conference on Interaction Design and Children (IDC '16). ACM, NY, NY, USA, 25--36. DOI: http://dx.doi.org/10.1145/2930674.2930701",
      "doi": "10.1145/2930674.2930701"
    },
    {
      "text": "Pin Sym Foong, Shengdong Zhao, Kelsey Carlson, and Zhe Liu. 2017. VITA: Towards Supporting Volunteer Interactions with Long-Term Care Residents with Dementia. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6195--6207. DOI: http://dx.doi.org/10.1145/3025453.3025776",
      "doi": "10.1145/3025453.3025776"
    },
    {
      "text": "Peter Gough. 21 May 2018. Providing access to Healthcare for Refugees and other Migrants arriving in the UK. Conference Talk. (21 May 2018). http://www.healthcareconferencesuk.co.uk/presentations.",
      "doi": ""
    },
    {
      "text": "Headspace. 2019. Our guide to health and happiness. (2019). Retrieved January 7, 2020 from https://www.headspace.com/.",
      "doi": ""
    },
    {
      "text": "Matthew Hodes and Panos Vostanis. 2019. Practitioner Review: Mental health problems of refugee children and adolescents and their management. Journal of child psychology and psychiatry 60, 7 (2019), 716--731.",
      "doi": ""
    },
    {
      "text": "Hwajung Hong, Jennifer G. Kim, Gregory D. Abowd, and Rosa I. Arriaga. 2012. SocialMirror: Motivating Young Adults with Autism to Practice Life Skills in a Social World. In Proceedings of the ACM 2012 Conf. on Computer Supported Cooperative Work Companion (CSCW '12). ACM, NY, NY, USA, 41--42. DOI: http://dx.doi.org/10.1145/2141512.2141533",
      "doi": ""
    },
    {
      "text": "Julia Huemer, Niranjan Karnik, and Hans Steiner. 2009a. Unaccompanied refugee children. The Lancet 373, 9664 (2009), 612--614.",
      "doi": ""
    },
    {
      "text": "Julia Huemer, Niranjan S Karnik, Sabine Voelkl-Kernstock, Elisabeth Granditsch, Kanita Dervic, Max H Friedrich, and Hans Steiner. 2009b. Mental health issues in unaccompanied refugee minors. Child and adolescent psychiatry and mental health 3, 1 (2009), 13.",
      "doi": ""
    },
    {
      "text": "Jane Hunt. 21 May 2018. Helen Bamber Foundation: The Refugee Perspective. Conference Talk. (21 May 2018). http://www.healthcareconferencesuk.co.uk/presentations.",
      "doi": ""
    },
    {
      "text": "Lisa M Keating, Michelle A Tomishima, Sharon Foster, Michael Alessandri, and others. 2002. The effects of a mentoring program on at-risk youth. Adolescence-San Diego 37 (2002), 717--734.",
      "doi": ""
    },
    {
      "text": "Dorothy King and Glorianne Said. 2019. Working with unaccompanied asylum-seeking young people: cultural considerations and acceptability of a cognitive behavioural group approach. the Cognitive Behaviour Therapist 12 (2019). DOI: http://dx.doi.org/doi:10.1017/S1754470X18000260",
      "doi": ""
    },
    {
      "text": "Colin Lago. 2011. The handbook of transcultural counselling and psychotherapy. McGraw-Hill Education (UK).",
      "doi": ""
    },
    {
      "text": "Clive Leach and Suzy Green. 2016. Integrating coaching and positive psychology in education. Coaching in professional contexts (2016), 169--186.",
      "doi": ""
    },
    {
      "text": "Reeva Lederman, John Gleeson, Greg Wadley, Simon D'alfonso, Simon Rice, Olga Santesteban-Echarri, and Mario Alvarez-Jimenez. 2019. Support for Carers of Young People with Mental Illness: Design and Trial of a Technology-Mediated Therapy. ACM Trans. Comput.-Hum. Interact. 26, 1, Article 4 (Feb. 2019), 33 pages. DOI: http://dx.doi.org/10.1145/3301421",
      "doi": "10.1145/3301421"
    },
    {
      "text": "Brighter Futures London. 2013. Wellbeing Toolkit Know Yourself. (2013). Retrieved January 7, 2020 from http://www.brighterfutureslondon.co.uk/ wellbeingtoolkit/know-yourself/.",
      "doi": ""
    },
    {
      "text": "Kiel Long, Lyndsey L Bakewell, Roisin C McNaney, Konstantina Vasileiou, Mark Atkinson, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2017. Connecting those that care: Designing for transitioning, talking, belonging and escaping. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1339--1351.",
      "doi": "10.1145/3025453.3025715"
    },
    {
      "text": "House Of Lords. 2016. Children in crisis: unaccompanied migrant children in the EU. (2016).",
      "doi": ""
    },
    {
      "text": "Noella Mackenzie and Sally Knipe. 2006. Research dilemmas: Paradigms, methods and methodology. Issues in educational research 16, 2 (2006), 193--205.",
      "doi": ""
    },
    {
      "text": "Pallab Majumder, Michelle O'Reilly, Khalid Karim, and Panos Vostanis. 2015. \"This doctor, I not trust him, I'm not safe\": The perceptions of mental health and services by unaccompanied refugee adolescents. International journal of social psychiatry 61, 2 (2015), 129--136.",
      "doi": ""
    },
    {
      "text": "Elizabeth L Murnane, Tara G Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal informatics in interpersonal contexts: towards the design of technology that supports the social ecologies of long-term mental health management. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 127.",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's Not That I Don'T Have Problems, I'm Just Not Putting Them on Facebook: Challenges and Opportunities in Using Online Social Networks for Health. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, NY, NY, USA, 341--350. DOI: http://dx.doi.org/10.1145/1958824.1958876",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Kathleen O'Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 1470--1484. DOI: http://dx.doi.org/10.1145/2998181.2998349",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Kathleen O'Leary, Stephen M. Schueller, Jacob O. Wobbrock, and Wanda Pratt. 2018. 'Suddenly, We Got to Become Therapists for Each Other\": Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 331, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173905",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Elisa Pfeiffer. 2 July 2019. Social Workers implementing a trauma-focused group intervention for young refugees: the role of self-efficacy. Conference Talk. (2 July 2019). https://www.escap-congress.org/scientific-programme/ online-programme.html#!/details/abstract/117.",
      "doi": ""
    },
    {
      "text": "Sandra Prince-Embury and Donald H. Saklofske. 2013. Resilience in Children, Adolescents, and Adults. Springer, New York. DOI: http://dx.doi.org/https://doi.org/10.1007/978--1--4614--4939--3",
      "doi": ""
    },
    {
      "text": "Jean Rhodes and Sarah Ryan Lowe. 2008. Youth mentoring and resilience: Implications for practice. Child care in practice 14, 1 (2008), 9--17.",
      "doi": ""
    },
    {
      "text": "Anthony Robert Sandre and K Bruce Newbold. 2016. Telemedicine: bridging the gap between refugee Health and Health services accessibility in Hamilton, Ontario. Refuge: Canada's Journal on Refugees 32, 3 (2016), 108--118.",
      "doi": ""
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those Who Are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 787--799. DOI: http://dx.doi.org/10.1145/2818048.2819999",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Jessica Schroeder, Chelsey Wilkes, Kael Rowan, Arturo Toledo, Ann Paradiso, Mary Czerwinski, Gloria Mark, and Marsha M. Linehan. 2018. Pocket Skills: A Conversational Mobile Web App To Support Dialectical Behavioral Therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 398, 15 pages. DOI: http://dx.doi.org/10.1145/3173574.3173972",
      "doi": "10.1145/3173574.3173972"
    },
    {
      "text": "Steven M Southwick, Lauren Sippel, John Krystal, Dennis Charney, Linda Mayes, and Robb Pietrzak. 2016. Why are some individuals more resilient than others: the role of social support. World Psychiatry 15, 1 (2016), 77.",
      "doi": ""
    },
    {
      "text": "Hannah Strohmeier and Willem F Scholte. 2015. Trauma-related mental health problems among national humanitarian staff: A systematic review of the literature. European journal of psychotraumatology 6, 1 (2015), 28541.",
      "doi": ""
    },
    {
      "text": "SuperBetter. 2019. Everyone has heroic potential. (2019). Retrieved January 7, 2020 from https://www.superbetter.com/.",
      "doi": ""
    },
    {
      "text": "Reem Talhouk, Konstantin Aal, Anne Weibert, Max Krüger, Volker Wulf, Karen Fisher, Franziska Tachtler, Suleman Shahid, Syed Ishtiaque Ahmed, and Ana Maria Bustamante Duarte. 2019. Refugees & HCI SIG: Situating HCI Within Humanitarian Research. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article SIG14, 4 pages. DOI: http://dx.doi.org/10.1145/3290607.3311754",
      "doi": "10.1145/3290607.3311754"
    },
    {
      "text": "Reem Talhouk, Sandra Mesmar, Anja Thieme, Madeline Balaam, Patrick Olivier, Chaza Akik, and Hala Ghattas. 2016. Syrian Refugees and Digital Health in Lebanon: Opportunities for Improving Antenatal Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 331--342. DOI: http://dx.doi.org/10.1145/2858036.2858331",
      "doi": "10.1145/2858036.2858331"
    },
    {
      "text": "Roslyn Thomas. 2011. Managing Transitions between 'Field'& 'Home': Facing the Psychological Impact of Humanitarian Crisis. Psychological Impact (2011), 226.",
      "doi": ""
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for Respite and Support: Technological Opportunities for Spousal Caregivers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, NY, NY, USA, 1155--1158. DOI: http://dx.doi.org/10.1145/2702123.2702563",
      "doi": "10.1145/2702123.2702563"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. \"Counting on the Group\": Reconciling Online and Offline Social Support Among Older Informal Caregivers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, NY, NY, USA, 3545--3558. DOI: http://dx.doi.org/10.1145/2858036.2858477",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Michael Ungar. 2011a. The social ecology of resilience: A handbook of theory and practice. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Michael Ungar. 2011b. The social ecology of resilience: Addressing contextual and cultural ambiguity of a nascent construct. American Journal of Orthopsychiatry 81, 1 (2011), 1.",
      "doi": ""
    },
    {
      "text": "Michael Ungar. 2012. Researching and theorizing resilience across cultures and contexts. Preventive Medicine 55, 5 (2012), 387.",
      "doi": ""
    },
    {
      "text": "Michael Ungar, Mehdi Ghazinour, and Jörg Richter. 2013. Annual research review: What is resilience within the social ecology of human development? Journal of child psychology and psychiatry 54, 4 (2013), 348--366.",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: on how we involve people in design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 429--438.",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Greg Wadley, Reeva Lederman, John Gleeson, and Mario Alvarez-Jimenez. 2013. Participatory Design of an Online Therapy for Youth Mental Health. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13). ACM, NY, NY, USA, 517--526. DOI: http://dx.doi.org/10.1145/2541016.2541030",
      "doi": "10.1145/2541016.2541030"
    },
    {
      "text": "Anne Weibert and Volker Wulf. 2010. \"All of a Sudden We Had This Dialogue...\": Intercultural Computer Clubs' Contribution to Sustainable Integration. In Proceedings of the 3rd International Conference on Intercultural Collaboration (ICIC '10). ACM, NY, NY, USA, 93--102. DOI: http://dx.doi.org/10.1145/1841853.1841868",
      "doi": "10.1145/1841853.1841868"
    },
    {
      "text": "Natasha Whitfield and Deborah Kanter. 2014. Helpers in distress: Preventing secondary trauma. Reclaiming Children and Youth 22, 4 (2014), 59.",
      "doi": ""
    },
    {
      "text": "Woebot. 2019. Hi, I'm Woebot. (2019). Retrieved January 7, 2020 from https://woebot.io/.",
      "doi": ""
    },
    {
      "text": "Wysa. 2019. Meet Wysa. (2019). Retrieved January 7, 2020 from https://www.wysa.io/.",
      "doi": ""
    },
    {
      "text": "Eiad Yaf, Katya Yefmova, and Karen E. Fisher. 2018. Young Hackers: Hacking Technology at Za'Atari Syrian Refugee Camp. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article CS21, 8 pages. DOI: http://dx.doi.org/10.1145/3170427.3174363",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the Conflicting Demands of Family Caregivers Caring for Depressed Family Members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13). ACM, NY, NY, USA, 2637--2646. DOI: http://dx.doi.org/10.1145/2470654.2481365",
      "doi": "10.1145/2470654.2481365"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Takashi Kudo, Keiji Hirata, Eiji Aramaki, and Kazuki Hattori. 2018. How Information Sharing About Care Recipients by Family Caregivers Impacts Family Communication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 222, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173796",
      "doi": "10.1145/3173574.3173796"
    },
    {
      "text": "Diyi Yang, Robert Kraut, and John M. Levine. 2017. Commitment of Newcomers and Old-timers to Online Health Support Communities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6363--6375. DOI: http://dx.doi.org/10.1145/3025453.3026008",
      "doi": ""
    },
    {
      "text": "Staci M Zolkoski and Lyndal M Bullock. 2012. Resilience in children and youth: A review. Children and youth services review 34, 12 (2012), 2295--2303.",
      "doi": ""
    }
  ]
}