{
  "doi": "10.1145/3313831.3376327",
  "title": "GUIComp: A GUI Design Assistant with Real-Time, Multi-Faceted Feedback",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Users may face challenges while designing graphical user interfaces, due to a lack of relevant experience and guidance. This paper aims to investigate the issues users face during the design process, and how to resolve them. To this end, we conducted semi-structured interviews, based on which we built a GUI prototyping assistance tool called GUIComp. This tool can be connected to GUI design software as an extension, and it provides real-time, multi-faceted feedback on a user's current design. Additionally, we conducted two user studies, in which we asked participants to create mobile GUIs with or without GUIComp, and requested online workers to assess the created GUIs. The experimental results show that GUIComp facilitated iterative designs and the participants with GUIComp had better a user experience and produced more acceptable designs than those who did not use it.",
  "tags": [
    "gui design",
    "design feedback"
  ],
  "authors": [
    {
      "name": "Chunggi Lee",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659439370",
      "orcid": "missing"
    },
    {
      "name": "Sanghoon Kim",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659439616",
      "orcid": "missing"
    },
    {
      "name": "Dongyun Han",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527207",
      "orcid": "missing"
    },
    {
      "name": "Hongjun Yang",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527401",
      "orcid": "missing"
    },
    {
      "name": "Young-Woo Park",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/do/10.1145/contrib-81413599235/rel-imgonly/untitled-1.jpg",
      "acmid": "81413599235",
      "orcid": "0000-0003-2257-9394"
    },
    {
      "name": "Bum Chul Kwon",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659830458",
      "orcid": "0000-0002-9391-6274"
    },
    {
      "name": "Sungahn Ko",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490650398",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AdobeXD. 2019. (August 2019). Retrieved August 14, 2019 from https://www.adobe.com/creativecloud.html",
      "doi": ""
    },
    {
      "text": "Saeema Ahmed, Ken M Wallace, and Lucienne T Blessing. 2003. Understanding the differences between how novice and experienced designers approach design tasks. Research in engineering design 14, 1 (2003), 1--11.",
      "doi": ""
    },
    {
      "text": "William Albert and Thomas Tullis. 2013. Measuring the user experience: collecting, analyzing, and presenting usability metrics. Newnes.",
      "doi": ""
    },
    {
      "text": "Axure. 2019. (August 2019). Retrieved August 14, 2019 from https://www.axure.com/",
      "doi": ""
    },
    {
      "text": "Tony Beltramelli. 2017. pix2code: Generating code from a graphical user interface screenshot. In Proceedings of the ACM SIGCHI Symposium on Engineering Interactive Computing Systems. 1--6.",
      "doi": ""
    },
    {
      "text": "Bootstrap. 2019. (August 2019). Retrieved August 14, 2019 from https://getbootstrap.com/",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Zoya Bylinskii, Nam Wook Kim, Peter O'Donovan, Sami Alsheikh, Spandan Madan, Hanspeter Pfster, Fredo Durand, Bryan Russell, and Aaron Hertzmann. 2017. Learning Visual Importance for Graphic Designs and Data Visualizations. In Proceedings of ACM Symposium on User Interface Software and Technology. 57--69.",
      "doi": "10.1145/3126594.3126653"
    },
    {
      "text": "Kerry Shih-Ping Chang and Brad A Myers. 2012. WebCrystal: understanding and reusing examples in web authoring. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 3205--3214.",
      "doi": ""
    },
    {
      "text": "D3.js. 2019. (August 2019). Retrieved August 14, 2019 from https://d3js.org/",
      "doi": ""
    },
    {
      "text": "Michael Deininger, Shanna R Daly, Kathleen H Sienko, and Jennifer C Lee. 2017. Novice designers' use of prototypes in engineering design. Design studies 51 (2017), 25--65.",
      "doi": ""
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of ACM Symposium on User Interface Software and Technology. 845--854.",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, and Ranjitha Kumar. 2016. ERICA: Interaction Mining Mobile Apps. In Proceedings of the Symposium on User Interface Software and Technology. 767--776.",
      "doi": "10.1145/2984511.2984581"
    },
    {
      "text": "Django. 2019. Django. (August 2019). Retrieved August 14, 2019 from https://www.djangoproject.com/",
      "doi": ""
    },
    {
      "text": "Bardia Doosti, Tao Dong, Biplab Deka, and Jeffrey Nichols. 2018. A Computational Method for Evaluating UI Patterns. arXiv preprint arXiv:1807.04191 (2018).",
      "doi": ""
    },
    {
      "text": "Steven Dow, Julie Fortuna, Dan Schwartz, Beth Altringer, Daniel L. Schwartz, and Scott R. Klemmer. 2011. Prototyping dynamics: sharing multiple designs improves exploration, group rapport, and results. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 2807--2816.",
      "doi": ""
    },
    {
      "text": "Steven P. Dow, Alana Glassco, Jonathan Kass, Melissa Schwarz, Daniel L. Schwartz, and Scott R. Klemmer. 2010. Parallel prototyping leads to better design results, more divergence, and increased self-effcacy. ACM Transactions on Computer-Human Interaction 17, 4 (2010), 1--24.",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Drag-Mock. 2019. (August 2019). Retrieved August 14, 2019 from https://github.com/andywer/drag-mock",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2019. (August 2019). Retrieved August 14, 2019 from https://developer.chrome.com/extensions",
      "doi": ""
    },
    {
      "text": "App Success Stories from Beginner App Developers! 2019. (August 2019). Retrieved August 14, 2019 from https://codewithchris.com/success-stories/",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Daniel MacDougall, Joel Brandt, and Scott R. Klemmer. 2010. What would other programmers do: suggesting solutions to error messages.. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 1019--1028.",
      "doi": ""
    },
    {
      "text": "John Hattie and Helen Timperley. 2007. The Power of Feedback. Review of Educational Research 77, 1 (2007), 81--112.",
      "doi": ""
    },
    {
      "text": "Scarlett R Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P Bailey. 2009. Getting inspired!: understanding how and why examples are used in creative design practice. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 87--96.",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "html2canvas. 2019. (August 2019). Retrieved August 14, 2019 from https://html2canvas.hertzen.com/",
      "doi": ""
    },
    {
      "text": "html2json. 2019. (August 2019). Retrieved August 14, 2019 from https://github.com/Jxck/html2json",
      "doi": ""
    },
    {
      "text": "Neil Hurley and Mi Zhang. 2011. Novelty and diversity in top-n recommendation--analysis and evaluation. ACM Transactions On Internet Technology (TOIT) 10, 4 (2011), 14.",
      "doi": "10.1145/1944339.1944341"
    },
    {
      "text": "Gasmi Ines, Soui Makram, Chouchane Mabrouka, and Abed Mourad. 2017. Evaluation of Mobile Interfaces as an Optimization Problem. Procedia Computer Science 112 (2017), 235 -- 248.",
      "doi": "10.1016/j.procs.2017.08.234"
    },
    {
      "text": "InVision. 2019. (August 2019). Retrieved August 14, 2019 from https://www.invisionapp.com/",
      "doi": ""
    },
    {
      "text": "Melody Y Ivory, Rashmi R Sinha, and Marti A Hearst. 2001. Empirically validated web page design metrics. In Proceedings of ACM CHI Conference on Human factors in Computing Systems. 53--60.",
      "doi": "10.1145/365024.365035"
    },
    {
      "text": "KakaoOven. 2019. (August 2019). Retrieved August 14, 2019 from https://ovenapp.io/",
      "doi": ""
    },
    {
      "text": "Keras. 2019. (August 2019). Retrieved August 14, 2019 from https://keras.io/",
      "doi": ""
    },
    {
      "text": "Hammad Khalid, Emad Shihab, Meiyappan Nagappan, and Ahmed E Hassan. 2014. What do mobile app users complain about? IEEE Software 32, 3 (2014), 70--77.",
      "doi": "10.1109/MS.2014.50"
    },
    {
      "text": "Janin Koch and Antti Oulasvirta. 2016. Computational Layout Perception using Gestalt Laws. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1423--1429.",
      "doi": "10.1145/2851581.2892537"
    },
    {
      "text": "Chinmay Kulkarni, Steven P Dow, and Scott R Klemmer. 2014. Early and repeated exposure to examples improves creative work. In Design thinking research. 49--62.",
      "doi": ""
    },
    {
      "text": "Chinmay E Kulkarni, Michael S Bernstein, and Scott R Klemmer. 2015. PeerStudio: rapid peer feedback emphasizes revision and improves performance. In Proceedings of the ACM conference on learning@ scale. 75--84.",
      "doi": "10.1145/2724660.2724670"
    },
    {
      "text": "Ranjitha Kumar, Jerry O Talton, Salman Ahmad, and Scott R Klemmer. 2011. Bricolage: example-based retargeting for web design. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 2197--2206.",
      "doi": "10.1145/1978942.1979262"
    },
    {
      "text": "Bum Chul Kwon, Brian Fisher, and Ji Soo Yi. 2011. Visual Analytic Roadblocks for Novice Investigators. In IEEE Conference on Visual Analytics Science and Technology (VAST). 3--11.",
      "doi": ""
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R Klemmer. 2010. Designing with interactive example galleries. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 2257--2266.",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Thomas F Liu, Mark Craft, Jason Situ, Ersin Yumer, Radomir Mech, and Ranjitha Kumar. 2018. Learning Design Semantics for Mobile Apps. In Proceedings of ACM Symposium on User Interface Software and Technology. 569--579.",
      "doi": "10.1145/3242587.3242650"
    },
    {
      "text": "Arnold Lund. 2001. Measuring Usability with the USE Questionnaire. Usability Interface 8, 2 (2001), 3--6.",
      "doi": ""
    },
    {
      "text": "Aliaksei Miniukovich and Antonella De Angeli. 2014. Visual impressions of mobile app interfaces. In Proceedings of Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. 31--40.",
      "doi": "10.1145/2639189.2641219"
    },
    {
      "text": "Aliaksei Miniukovich and Antonella De Angeli. 2015. Computation of interface aesthetics. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 1163--1172.",
      "doi": "10.1145/2702123.2702575"
    },
    {
      "text": "Kevin Moran, Carlos Bernal-Cárdenas, Michael Curcio, Richard Bonett, and Denys Poshyvanyk. 2018a. Machine Learning-Based Prototyping of Graphical User Interfaces for Mobile Apps. arXiv preprint arXiv:1802.02312 (2018).",
      "doi": ""
    },
    {
      "text": "Kevin Moran, Boyang Li, Carlos Bernal-Cárdenas, Dan Jelf, and Denys Poshyvanyk. 2018b. Automated Reporting of GUI Design Violations for Mobile Apps. In Proceedings of International Conference on Software Engineering. 165--175.",
      "doi": "10.1145/3180155.3180246"
    },
    {
      "text": "Michael Muller. 2014. Curiosity, creativity, and surprise as analytic tools: Grounded theory method. In Ways of Knowing in HCI. Springer, 25--48.",
      "doi": ""
    },
    {
      "text": "Vinod Nair and Geoffrey E. Hinton. 2010. Rectifed Linear Units Improve Restricted Boltzmann Machines. In Proceedings of International Conference on Machine Learning. 807--814.",
      "doi": ""
    },
    {
      "text": "Tricia J Ngoon, C Ailie Fraser, Ariel S Weingarten, Mira Dontcheva, and Scott Klemmer. 2018. Interactive Guidance Techniques for Improving Creative Feedback. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 55.",
      "doi": "10.1145/3173574.3173629"
    },
    {
      "text": "Jakob Nielsen. 1993. Iterative user-interface design. Computer 26, 11 (1993), 32--41.",
      "doi": "10.1109/2.241424"
    },
    {
      "text": "Jakob Nielsen, Bush, Rita M., Tom Dayton, Mond, Nancy E., Muller, Michael J., Root, and Robert W. 1992. Teaching Experienced Developers to Design Graphical User Interfaces. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 557--564.",
      "doi": ""
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2014. Learning Layouts for Single-Page Graphic Designs. IEEE Transaction on Vissualization and Computer Graphics 20, 8 (2014), 1200--1213.",
      "doi": "10.1109/TVCG.2014.48"
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2015. Designscape: Design with interactive layout suggestions. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 1221--1224.",
      "doi": "10.1145/2702123.2702149"
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help but Only with Enough Details: Understanding User Experience of Co-Creation with Artifcial Intelligence. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 1--13.",
      "doi": "10.1145/3173574.3174223"
    },
    {
      "text": "OpenCV. 2019. (August 2019). Retrieved August 14, 2019 from https://opencv.org/",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Samuli De Pascale, Janin Koch, Thomas Langerak, Jussi Jokinen, Kashyap Todi, Markku Laine, Manoj Kristhombuge, Yuxi Zhu, Aliaksei Miniukovich, and others. 2018. Aalto Interface Metrics (AIM): a service and codebase for computational GUI evaluation. In In Proceedings of ACM Symposium on User Interface Software and Technology. 16--19.",
      "doi": "10.1145/3266037.3266087"
    },
    {
      "text": "Adobe Photoshop. 2019. (August 2019). Retrieved August 14, 2019 from https://www.adobe.com/products/photoshopfamily.html",
      "doi": ""
    },
    {
      "text": "Principle. 2019. (August 2019). Retrieved August 14, 2019 from http://principleformac.com/",
      "doi": ""
    },
    {
      "text": "Proto.io. 2019. (August 2019). Retrieved August 14, 2019 from https://proto.io/",
      "doi": ""
    },
    {
      "text": "Pearl Pu, Li Chen, and Rong Hu. 2011. A user-centric evaluation framework for recommender systems. In In Proceedings of ACM conference on Recommender systems. 157--164.",
      "doi": "10.1145/2043932.2043962"
    },
    {
      "text": "Katharina Reinecke, Tom Yeh, Luke Miratrix, Rahmatri Mardiko, Yuechen Zhao, Jenny Liu, and Krzysztof Z Gajos. 2013. Predicting users' frst impressions of website aesthetics with a quantifcation of perceived visual complexity and colorfulness. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 2049--2058.",
      "doi": ""
    },
    {
      "text": "Andreas Riegler and Clemens Holzmann. 2015. UI-CAT: Calculating User Interface Complexity Metrics for Mobile Applications. In Proceedings of the International Conference on Mobile and Ubiquitous Multimedia. 390--394.",
      "doi": "10.1145/2836041.2841214"
    },
    {
      "text": "Andreas Riegler and Clemens Holzmann. 2018. Measuring Visual User Interface Complexity of Mobile Applications With Metrics. Interacting with Computers 30, 3 (2018), 207--223.",
      "doi": ""
    },
    {
      "text": "Daniel Ritchie, Ankita Arvind Kejriwal, and Scott R Klemmer. 2011. d. tour: Style-based exploration of design example galleries. In Proceedings of ACM Symposium on User Interface Software and Technology. 165--174.",
      "doi": ""
    },
    {
      "text": "D Royce Sadler. 1989. Formative assessment and the design of instructional systems. Instructional Science 18 (1989), 119--144.",
      "doi": ""
    },
    {
      "text": "Sketch. 2019. (August 2019). Retrieved August 14, 2019 from https://www.sketchapp.com/",
      "doi": ""
    },
    {
      "text": "Amanda Swearngin, Mira Dontcheva, Wilmot Li, Joel Brandt, Morgan Dixon, and Andrew J. Ko. 2018. Rewire: Interface Design Assistance from Examples. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 1--12.",
      "doi": ""
    },
    {
      "text": "Kashyap Todi, Jussi Jokinen, Kris Luyten, and Antti Oulasvirta. 2018. Familiarisation: Restructuring Layouts with Visual Learning Models. In 23rd International Conference on Intelligent User Interfaces. ACM, 547--558.",
      "doi": "10.1145/3172944.3172949"
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and explore with a layout optimiser. In In Proceedings of ACM Conference on Designing Interactive Systems. 543--555.",
      "doi": "10.1145/2901790.2901817"
    },
    {
      "text": "Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. Getting the right design and the design right. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 1243--1252.",
      "doi": "10.1145/1124772.1124960"
    },
    {
      "text": "Ming-Jyh Tsai and Deng-Jyi Chen. 2007. Generating user interface for mobile phone devices using template-based approach and generic software framework. Journal of Information Science and Engineering 23, 4 (2007), 1189--1211.",
      "doi": ""
    },
    {
      "text": "UXPin. 2019. (August 2019). Retrieved August 14, 2019 from https://www.uxpin.com/",
      "doi": ""
    },
    {
      "text": "Susan Weinschenk. 2011. 100 things every designer needs to know about people. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Ziming Wu, Taewook Kim, Quan Li, and Xiaojuan Ma. 2019. Understanding and Modeling User-Perceived Brand Personality from Mobile Application UIs. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 213.",
      "doi": "10.1145/3290605.3300443"
    },
    {
      "text": "Alvin Yuan, Kurt Luther, Markus Krause, Sophie Isabel Vennix, Steven P. Dow, and Björn Hartmann. 2016. Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques. In Proceedings of ACM Conference on Computer-Supported Cooperative Work & Social Computing. 1003--1015.",
      "doi": "10.1145/2818048.2819953"
    },
    {
      "text": "Dongsong Zhang and Boonlit Adipat. 2005. Challenges, methodologies, and issues in the usability testing of mobile applications. International journal of human-computer interaction 18, 3 (2005), 293--308.",
      "doi": ""
    }
  ]
}