{
  "doi": "10.1145/3313831.3376132",
  "title": "BlyncSync: Enabling Multimodal Smartwatch Gestures with Synchronous Touch and Blink",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Input techniques have been drawing abiding attention along with the continual miniaturization of personal computers. In this paper, we present BlyncSync, a novel multi-modal gesture set that leverages the synchronicity of touch and blink events to augment the input vocabulary of smartwatches with a rapid gesture, while at the same time, offers a solution to the false activation problem of blink-based input. BlyncSync contributes the concept of a mutual delimiter, where two modalities are used to jointly delimit the intention of each other's input. A study shows that BlyncSync is 33% faster than using a baseline input delimiter (physical smartwatch button), with only 150ms in overhead cost compared to traditional touch events. Furthermore, our data indicates that the gesture can be tuned to elicit a true positive rate of 97% and a false positive rate of 1.68%.",
  "tags": [
    "blyncsync",
    "wearables",
    "mobile hci",
    "smartwatch",
    "gaze ui",
    "mutual delimiter"
  ],
  "authors": [
    {
      "name": "Bryan Wang",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529079",
      "orcid": "0000-0001-9016-038X"
    },
    {
      "name": "Tovi Grossman",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Mosa'ad Al-Abdulmunem and Stella T. Briggs. 1999. Spontaneous Blink Rate of a Normal Population Sample in International Contact Lens Clinic Volume 26, Issue 2, March--April 1999, Pages 29--32 DOI: https://doi.org/10.1016/S0892--8967(99)00016--4",
      "doi": ""
    },
    {
      "text": "Hassoumi Almoctar, Pourang Irani, Vsevolod Peysakhovich, and Christophe Hurter. 2018. Path Word: A Multimodal Password Entry Method for Adhoc Authentication Based on Digits' Shape and Smooth Pursuit Eye Movements. In Proceedings of the 20th ACM International Conference on Multimodal Interaction (ICMI '18). DOI: https://doi.org/10.1145/3242969.3243008",
      "doi": "10.1145/3242969.3243008"
    },
    {
      "text": "Ashbrook, D. L. (2010). Enabling mobile microinteractions (Doctoral dissertation, Georgia Institute of Technology).",
      "doi": ""
    },
    {
      "text": "Daniel L. Ashbrook, James R. Clawson, Kent Lyons, Thad E. Starner, and Nirmal Patel. 2008. Quickdraw: the impact of mobility and on-body placement on device access time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 219--222. DOI: https://doi.org/10.1145/1357054.1357092",
      "doi": "10.1145/1357054.1357092"
    },
    {
      "text": "Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An investigation into round touchscreen wristwatch interaction. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI '08). ACM, NY, NY, USA, 311--314. DOI= http://dx.doi.org/10.1145/1409240.1409276",
      "doi": "10.1145/1409240.1409276"
    },
    {
      "text": "Behrooz Ashtiani and I. Scott MacKenzie. 2010. BlinkWrite2: an improved text entry method using eye blinks. In Proceedings of the 2010 Symposium on EyeTracking Research & Applications (ETRA '10). ACM, NY, NY, USA, 339--345. DOI= http://dx.doi.org/10.1145/1743666.1743742",
      "doi": "10.1145/1743666.1743742"
    },
    {
      "text": "Olivier Bau and Wendy E. Mackay. 2008. OctoPocus: a dynamic guide for learning gesture-based command sets. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, NY, NY, USA, 37--46. DOI: https://doi.org/10.1145/1449715.1449724",
      "doi": ""
    },
    {
      "text": "Benedetto, Simone & Pedrotti, Marco & Minin, Luca & Baccino, Thierry & Re, Alessandra & Montanari, Roberto. (2011). Driver workload and eye blink duration. Transportation Research Part F: Traffic Psychology and Behaviour. 14. 199--208. DOI: 10.1016/j.trf.2010.12.00 1",
      "doi": ""
    },
    {
      "text": "Matteo Bologna, Rocco Agostino, Bruno Gregori, Daniele Belvisi, Donatella Ottaviani, Carlo Colosimo, Giovanni Fabbrini, Alfredo Berardelli, Voluntary, spontaneous and reflex blinking in patients with clinically probable progressive supranuclear palsy, Brain, Volume 132, Issue 2, February 2009, Pages 502--510, https://doi.org/10.1093/brain/awn317",
      "doi": ""
    },
    {
      "text": "Xiang Cao and Shumin Zhai. 2007. Modeling human performance of pen stroke gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1495--1504. DOI: https://doi.org/10.1145/1240624.1240850",
      "doi": "10.1145/1240624.1240850"
    },
    {
      "text": "Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: a text entry technique for ultra-small interfaces that supports novice to expert transitions. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, NY, NY, USA, 615--620. DOI: https://doi.org/10.1145/2642918.2647354",
      "doi": "10.1145/2642918.2647354"
    },
    {
      "text": "Flaviu Cristian. 1989. Probabilistic clock synchronization. In Distributed Computing. https://doi.org/10.1007/BF01784024",
      "doi": ""
    },
    {
      "text": "Harishchandra Dubey, Jon C. Goldberg, Mohammadreza Abtahi, Leslie Mahler, and Kunal Mankodiya. 2015. EchoWear: smartwatch technology for voice and speech treatments of patients with Parkinson's disease. In Proceedings of the conference on Wireless Health (WH '15). ACM, NY, NY, USA, Article 15, 8 pages. DOI: https://doi.org/10.1145/2811780.2811957",
      "doi": "10.1145/2811780.2811957"
    },
    {
      "text": "Augusto Esteves, Eduardo Velloso, Andreas Bulling, and Hans Gellersen. 2015. Orbits: Gaze Interaction for Smart Watches using Smooth Pursuit Eye Movements. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 457--466. DOI: https://doi.org/10.1145/2807442.2807499",
      "doi": "10.1145/2807442.2807499"
    },
    {
      "text": "Emilien Ghomi, Guillaume Faure, Stéphane Huot, Olivier Chapuis, and Michel Beaudouin-Lafon. 2012. Using rhythmic patterns as an input method. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1253--1262. DOI: https://doi.org/10.1145/2207676.2208579",
      "doi": "10.1145/2207676.2208579"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, NY, NY, USA, 121--124. DOI: https://doi.org/10.1145/1622176.1622199",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Ken Hinckley. 2003. Synchronous gestures for multiple persons and computers. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03). Association for Computing Machinery, New York, NY, USA, 149-- 158. DOI: https://doi.org/10.1145/964696.964713",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Ken Hinckley, Patrick Baudisch, and Gonzalo Ramos, Francois Guimbretiere. 2005. Design and analysis of delimiters for selection-action pen gesture phrases in scriboli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 451--460. DOI: https://doi.org/10.1145/1054972.1055035",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Holmquist L.E., Mattern F., Schiele B., Alahuhta P., Beigl5 M., Gellersen HW. (2001) Smart-Its Friends: A Technique for Users to Easily Establish Connections between Smart Artefacts. In: Abowd G.D., Brumitt B., Shafer S. (eds) Ubicomp 2001: Ubiquitous Computing. UbiComp 2001. Lecture Notes in Computer Science, vol 2201. Springer, Berlin, Heidelberg",
      "doi": ""
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 581--590. DOI: https://doi.org/10.1145/1753326.1753413",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Da-Yuan Huang, Ming-Chang Tsai, Ying-Chao Tung, Min-Lun Tsai, Yen-Ting Yeh, Liwei Chan, Yi-Ping Hung, and Mike Y. Chen. 2014. TouchSense: expanding touchscreen input vocabulary using different areas of users' finger pads. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 189192. DOI: https://doi.org/10.1145/2556288.2557258",
      "doi": ""
    },
    {
      "text": "Shoya Ishimaru, Kai Kunze, Katsuma Tanaka, Yuji Uema, Koichi Kise, and Masahiko Inami. 2015. Smart Eyewear for Interaction and Activity Recognition. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 307--310. DOI: https://doi.org/10.1145/2702613.2725449",
      "doi": "10.1145/2702613.2725449"
    },
    {
      "text": "Robert J. K. Jacob. 1990. What you look at is what you get: eye movement-based interaction techniques. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90), Jane Carrasco Chew and John Whiteside (Eds.). ACM, NY, NY, USA, 11--18. DOI= http://dx.doi.org/10.1145/97243.97246",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Mohamed Khamis, Florian Alt, Mariam Hassib, Emanuel von Zezschwitz, Regina Hasholzner, and Andreas Bulling. 2016. GazeTouchPass: Multimodal Authentication Using Gaze and Touch on Mobile Devices. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 2156--2164. DOI: https://doi.org/10.1145/2851581.2892314",
      "doi": "10.1145/2851581.2892314"
    },
    {
      "text": "Mohamed Khamis, Mariam Hassib, Emanuel von Zezschwitz, Andreas Bulling, and Florian Alt. 2017. GazeTouchPIN: protecting sensitive data on mobile devices using secure multimodal authentication. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (ICMI '17). ACM, NY, NY, USA, 446--450. DOI: https://doi.org/10.1145/3136755.3136809",
      "doi": "10.1145/3136755.3136809"
    },
    {
      "text": "Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact free Gesture based Wrist Interface. In Proceedings of the 2007 11th IEEE International Symposium on Wearable Computers (ISWC '07). IEEE Computer Society, Washington, DC, USA, 1--8. DOI: 10.1109/ISWC.2007.4373770",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "Kowalczyk, P. & Sawicki, D. Blink and wink detection as a control tool in multimodal interaction Multimedia Tools Appl (2019) 78: 13749. https://doi.org/10.1007/s11042-018--6554--8",
      "doi": ""
    },
    {
      "text": "Sven Kratz and Michael Rohs. 2009. Hoverflow: exploring around-device interaction with IR distance sensors. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, NY, NY, USA, , Article 42 , 4 pages. DOI= http://dx.doi.org/10.1145/1613858.1613912",
      "doi": "10.1145/1613858.1613912"
    },
    {
      "text": "Królak, A., P. (2012). Eye-blink detection system for human--computer interaction. Universal Access in the Information Society, 11(4), 409--419. https://doi.org/10.1007/s10209-011-0256--6",
      "doi": "10.1007/s10209-011-0256-6"
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. 1991. Issues in combining marking and direct manipulation techniques. In Proceedings of the 4th annual ACM symposium on User interface software and technology (UIST '91). ACM, NY, NY, USA, 137--144. DOI= http://dx.doi.org/10.1145/120782.120797",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors. In Proceedings of the 27th annual ACM symposium on User interface software and technology(UIST '14) ACM, NY, NY, USA, 389--394. DOI: https://doi.org/10.1145/2642918.2647356",
      "doi": "10.1145/2642918.2647356"
    },
    {
      "text": "Juyoung Lee, Shaurye Aggarwal, Jason Wu, Thad Starner, and Woontack Woo. 2019. SelfSync: exploring self-synchronous body-based hotword gestures for initiating interaction. In Proceedings of the 23rd International Symposium on Wearable Computers (ISWC '19). Association for Computing Machinery, New York, NY, USA, 123--128. DOI: https://doi.org/10.1145/3341163.3347745",
      "doi": "10.1145/3341163.3347745"
    },
    {
      "text": "Wei Liu, Dragomir Anguelov, Dumitru Erhan, Christian Szegedy, Scott E. Reed, Cheng-Yang Fu, and Alexander C. Berg. 2015. SSD: Single Shot MultiBox Detector. CoRR abs/1512.02325 (2015).",
      "doi": ""
    },
    {
      "text": "Xing Liu, Tianyu Chen, Feng Qian, Zhixiu Guo, Felix Xiaozhu Lin, Xiaofeng Wang, and Kai Chen. 2017. Characterizing Smartwatch Usage in the Wild. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '17). ACM, NY, NY, USA, 385--398. DOI: https://doi.org/10.1145/3081333.308135 1",
      "doi": "10.1145/3081333.3081351"
    },
    {
      "text": "Ho-Man Colman Leung, Chi-Wing Fu, and Pheng-Ann Heng. 2018. TwistIn: Tangible Authentication of Smart Devices via Motion Co-analysis with a Smartwatch. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2, Article 72 (July 2018), 24 pages. DOI: https://doi.org/10.1145/3214275",
      "doi": ""
    },
    {
      "text": "Kent Lyons, David Nguyen, Daniel Ashbrook, and Sean White. 2012. Facet: a multi-segment wrist worn system. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 123--130 ACM, NY, NY, USA, 123--130. DOI: https://doi.org/10.1145/2380116.2380134",
      "doi": "10.1145/2380116.2380134"
    },
    {
      "text": "I. Scott MacKenzie and Behrooz Ashtiani. 2011. BlinkWrite: efficient text entry using eye blinks. Univers. Access Inf. Soc. 10, 1 (March 2011), 69--80. DOI: 10.1007/s10209-010-0188--6",
      "doi": ""
    },
    {
      "text": "Eric Missimer and Margrit Betke. 2010. Blink and wink detection for mouse pointer control. In Proceedings of the 3rd International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '10), Fillia Makedon, Ilias Maglogiannis, and Sarantos Kapidakis (Eds.) ACM, NY, NY, USA, , Article 23 , 8 pages. DOI= http://dx.doi.org/10.1145/1839294.1839322",
      "doi": "10.1145/1839294.1839322"
    },
    {
      "text": "Mukherjee, K., & Chatterjee, D. (2015, January). Augmentative and alternative communication device based on eye-blink detection and conversion to Morsecode to aid paralyzed individuals. In 2015 International Conference on Communication, Information & Computing Technology (ICCICT) (pp. 1--5). IEEE. DOI:10.1109/iccict.2015.7045754",
      "doi": ""
    },
    {
      "text": "Ian Oakley and Doyoung Lee. 2014. Interaction on the edge: offset sensing for small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 169--178. DOI: https://doi.org/10.1145/2556288.2557138",
      "doi": "10.1145/2556288.2557138"
    },
    {
      "text": "Ian Oakley, DoYoung Lee, MD. Rasel Islam, and Augusto Esteves. 2015. Beats: Tapping Gestures for Smart Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 12371246. DOI: https://doi.org/10.1145/2702123.2702226",
      "doi": "10.1145/2702123.2702226"
    },
    {
      "text": "Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: a diminutive qwerty soft keyboard using iterative zooming for ultra-small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13) ACM, NY, NY, USA, 2799--2802. DOI: https://doi.org/10.1145/2470654.2481387",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "Sharon Oviatt. 1999. Mutual disambiguation of recognition errors in a multimodal architecture. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 576--583. DOI= http://dx.doi.org/10.1145/302979.303163",
      "doi": "10.1145/302979.303163"
    },
    {
      "text": "Lyelle L. Palmer. Inability to Wink an Eye and Eye Dominance. 1976. In Perceptual and Motor Skills. DOI: 10.2466/pms.1976.42.3.825",
      "doi": ""
    },
    {
      "text": "Jerome Pasquero, Scott J. Stobbe, and Noel Stonehouse. 2011. A haptic wristwatch for eyes-free interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3257--3266. DOI: https://doi.org/10.1145/1978942.1979425",
      "doi": "10.1145/1978942.1979425"
    },
    {
      "text": "Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: simple gestures and eyesfree interaction for wristwatches and bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1451--1460. DOI: https://doi.org/10.1145/2470654.2466192",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, Ming Ki Chong, and Hans Gellersen. 2014. Gaze-touch: combining gaze with multi-touch for interaction on the same surface. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, NY, NY, USA, 509--518. DOI: https://doi.org/10.1145/2642918.2647397",
      "doi": "10.1145/2642918.2647397"
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, Ming Ki Chong, Yanxia Zhang, and Hans Gellersen. 2015. GazeShifting: Direct-Indirect Input with Pen and Touch Modulated by Gaze. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). Association for Computing Machinery, New York, NY, USA, 373--383. DOI: https://doi.org/10.1145/2807442.2807460",
      "doi": "10.1145/2807442.2807460"
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in vivo. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5456--5469. DOI: https://doi.org/10.1145/2858036.2858522",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Gonzalo Ramos, Kenneth Hinckley, Andy Wilson & Raman Sarin (2009) Synchronous Gestures in MultiDisplay Environments, Human--Computer Interaction, 24:1--2, 117--169, DOI: 10.1080/07370020902739288",
      "doi": ""
    },
    {
      "text": "Joseph Redmon and Ali Farhadi. 2016. YOLO9000: Better, Faster, Stronger. CoRR abs/1612.08242 (2016). http://arxiv.org/abs/1612.08242",
      "doi": ""
    },
    {
      "text": "Rekimoto J., Ayatsuka Y., Kohno M. (2003) SyncTap: An Interaction Technique for Mobile Networking. In: Chittaro L. (eds) Human-Computer Interaction with Mobile Devices and Services. Mobile HCI 2003. Lecture Notes in Computer Science, vol 2795. Springer, Berlin, Heidelberg",
      "doi": ""
    },
    {
      "text": "Gabriel Reyes, Jason Wu, Nikita Juneja, Maxim Goldshtein, W. Keith Edwards, Gregory D. Abowd, and Thad Starner. 2018. SynchroWatch: One-Handed Synchronous Smartwatch Gestures Using Correlation and Magnetic Sensing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 158 (Jan. 2018), 26 pages. https://doi.org/10.1145/3161162",
      "doi": "10.1145/3161162"
    },
    {
      "text": "Jeffrey S. Shell, Roel Vertegaal, and Alexander W. Skaburskis. 2003. EyePliances: attention-seeking devices that respond to visual attention. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 770--771. DOI= http://dx.doi.org/10.1145/765891.765981",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Shell, Roel Vertegaal, Daniel Cheng, Alexander W. Skaburskis, Changuk Sohn, A. James Stewart, Omar Aoudeh, and Connor Dickie. 2004. ECSGlasses and EyePliances: using attention to open sociable windows of interaction. In Proceedings of the 2004 symposium on Eye tracking research & applications (ETRA '04). ACM, NY, NY, USA, 93--100. DOI: https://doi.org/10.1145/968363.968384",
      "doi": "10.1145/968363.968384"
    },
    {
      "text": "Stern, J. A., Boyer, D., & Schroeder, D. (1994). Blink Rate: A Possible Measure of Fatigue. Human Factors, 36(2), 285--297. https://doi.org/10.1177/001872089403600209",
      "doi": ""
    },
    {
      "text": "Eduardo Velloso, Marcus Carter, Joshua Newn, Augusto Esteves, Christopher Clarke, and Hans Gellersen. 2017. Motion Correlation: Selecting Objects by Matching Their Movement. ACM Trans. Comput.Hum. Interact. 24, 3, Article 22 (April 2017), 35 pages. DOI: https://doi.org/10.1145/3064937",
      "doi": "10.1145/3064937"
    },
    {
      "text": "Eduardo Velloso, Markus Wirth, Christian Weichel, Augusto Esteves, and Hans Gellersen. 2016. AmbiGaze: Direct Control of Ambient Devices by Gaze. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, NY, NY, USA, 812--817. DOI: https://doi.org/10.1145/2901790.2901867",
      "doi": "10.1145/2901790.2901867"
    },
    {
      "text": "Roel Vertegaal, Aadil Mamuji, Changuk Sohn, and Daniel Cheng. 2005. Media eyepliances: using eye tracking for remote control focus selection of appliances. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1861--1864. DOI= http://dx.doi.org/10.1145/1056808.1057041",
      "doi": "10.1145/1056808.1057041"
    },
    {
      "text": "Mélodie Vidal, Andreas Bulling, and Hans Gellersen. 2013. Pursuits: spontaneous interaction with displays based on smooth pursuit eye movement and moving targets. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, NY, NY, USA, 439--448. DOI: https://doi.org/10.1145/2493432.2493477",
      "doi": "10.1145/2493432.2493477"
    },
    {
      "text": "Jacob Otto Wobbrock. 2009. TapSongs: tapping rhythm-based passwords on a single binary sensor. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, NY, NY, USA, 93--96. DOI: https://doi.org/10.1145/1622176.1622194",
      "doi": "10.1145/1622176.1622194"
    },
    {
      "text": "Jason Wu, Cooper Colglazier, Adhithya Ravishankar, Yuyan Duan, Yuanbo Wang, Thomas Ploetz, and Thad Starner. 2018. Seesaw: Rapid One-Handed Synchronous Gesture Interface for Smartwatches. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (ISWC '18). ACM, NY, NY, USA, 17--20. https://doi.org/10.1145/3267242.3267251",
      "doi": "10.1145/3267242.3267251"
    },
    {
      "text": "Haijun Xia, Tovi Grossman, and George Fitzmaurice. 2015. NanoStylus: Enhancing Input on Ultra-Small Displays with a Finger-Mounted Stylus. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 447--456. DOI: https://doi.org/10.1145/2807442.2807500",
      "doi": "10.1145/2807442.2807500"
    },
    {
      "text": "Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 193--196. DOI: https://doi.org/10.1145/2556288.2557017",
      "doi": "10.1145/2556288.2557017"
    },
    {
      "text": "York M, Ong J, Robbins JC: Variation in blink rate associated with contact lens wear and task difficulty. Am J Optom Am Acad Optom 1971;48:461--466.",
      "doi": ""
    },
    {
      "text": "Shumin Zhai, Carlos Morimoto, and Steven Ihde. 1999. Manual and gaze input cascaded (MAGIC) pointing. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 246--253. DOI=http://dx.doi.org/10.1145/302979.303053",
      "doi": "10.1145/302979.303053"
    },
    {
      "text": "Cheng Zhang, Xiaoxuan Wang, Anandghan Waghmare, Sumeet Jain, Thomas Ploetz, Omer T. Inan, Thad E. Starner, and Gregory D. Abowd. 2017. FingOrbits: Interaction with Wearables Using Synchronized Thumb Movements. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (ISWC '17). ACM, NY, NY, USA, 62--65. https://doi.org/10.1145/3123021.3123041",
      "doi": ""
    },
    {
      "text": "Qiaohui Zhang, Atsumi Imamiya, Kentaro Go, Xiaoyang Mao. A Gaze and Speech Multimodal Interface. 2004. In Proceedings of the 24th International Conference on Distributed Computing Systems Workshops (ICDCSW'04) DOI: 10.1109/ICDCSW.2004.1284033",
      "doi": ""
    },
    {
      "text": "Junhan Zhou, Yang Zhang, Gierad Laput, and Chris Harrison. 2016. AuraSense: Enabling Expressive Around-Smartwatch Interactions with Electric Field Sensing. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 81--86. DOI: https://doi.org/10.1145/2984511.2984568",
      "doi": "10.1145/2984511.2984568"
    }
  ]
}