{
  "doi": "10.1145/3313831.3376753",
  "title": "ScreenTrack: Using a Visual History of a Computer Screen to Retrieve Documents and Web Pages",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Computers are used for various purposes and frequent context switch is inevitable. In this setting, retrieving the documents, files, and web pages that have been used for a task can be a challenge. While modern applications provide a history of recent documents for users to resume work, this is not sufficient to retrieve all the digital resources relevant to a given primary document. The histories currently available - file names, web page titles, or URLs - does not take into account the complex dependencies that exist among resources across applications. To address this problem, we tested the idea of using a visual history of a computer screen to retrieve digital resources within a few days through the development of ScreenTrack. ScreenTrack is software that captures screenshots of a computer at regular intervals. It then generates a time-lapse video from the captured screenshots and lets users retrieve a recently opened document or web page from a screenshot that they recognize from its visuals. Through a controlled user study, it was found that participants were able to retrieve requested information more quickly with ScreenTrack than under the control condition. A follow-up study showed that the participants used ScreenTrack to retrieve previously used resources, in order to resume interrupted tasks.",
  "tags": [
    "productivity",
    "self-tracking",
    "task resumption"
  ],
  "authors": [
    {
      "name": "Donghan Hu",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475329",
      "orcid": "missing"
    },
    {
      "name": "Sang Won Lee",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659579861",
      "orcid": "0000-0002-1026-315X"
    }
  ],
  "references": [
    {
      "text": "Piotr D. Adamczyk and Brian P. Bailey. 2004. If Not Now, when?: The Effects of Interruption at Different Moments Within Task Execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 271--278. DOI: http://dx.doi.org/10.1145/985692.985727",
      "doi": ""
    },
    {
      "text": "Liam Bannon, Allen Cypher, Steven Greenspan, and Melissa L. Monty. 1983. Evaluation and Analysis of Users' Activity Organization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '83). ACM, NY, NY, USA, 54--57. DOI: http://dx.doi.org/10.1145/800045.801580",
      "doi": ""
    },
    {
      "text": "Liam J. Bannon. 2006. Forgetting as a feature, not a bug: the duality of memory and implications for ubiquitous computing. CoDesign 2, 1 (2006), 3--15. DOI: http://dx.doi.org/10.1080/15710880600608230",
      "doi": ""
    },
    {
      "text": "Louise Barkuus and Anind Dey. 2003. Location-Based Services for Mobile Telephony: a Study of Users' Privacy Concerns. In IN 9TH IFIP TC13 INTERNATIONAL CONFERENCE ON HUMAN-COMPUTER INTERACTION, INTERACT 2003.",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Jeff Shrager, and Terry Winograd. 2008. Taskposé: Exploring Fluid Boundaries in an Associative Window Visualization. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 231--234. DOI: http://dx.doi.org/10.1145/1449715.1449753",
      "doi": "10.1145/1449715.1449753"
    },
    {
      "text": "Timothy F. Brady, Talia Konkle, George A. Alvarez, and Aude Oliva. 2008. Visual long-term memory has a massive storage capacity for object details. Proceedings of the National Academy of Sciences 105, 38 (2008), 14325--14329. DOI: http://dx.doi.org/10.1073/pnas.0803390105",
      "doi": ""
    },
    {
      "text": "Gaston R. Cangiano and James D. Hollan. 2009. Capturing and Restoring the Context of Everyday Work: A Case Study at a Law Office. In Human Centered Design, Masaaki Kurosu (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 945--954.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding Quantified-selfers' Practices in Collecting and Exploring Personal Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1143--1152. DOI: http://dx.doi.org/10.1145/2556288.2557372",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Michael G. Christel, Alexander G. Hauptmann, Howard D. Wactlar, and Tobun D. Ng. 2002. Collages As Dynamic Summaries for News Video. In Proceedings of the Tenth ACM International Conference on Multimedia (MULTIMEDIA '02). ACM, NY, NY, USA, 561--569. DOI: http://dx.doi.org/10.1145/641007.641120",
      "doi": ""
    },
    {
      "text": "Martin A. Conway. 2009. Episodic memories. Neuropsychologia 47, 11 (2009), 2305 -- 2313. DOI: http://dx.doi.org/https://doi.org/10.1016/j.neuropsychologia.2009.02.003 Episodic Memory and the Brain.",
      "doi": ""
    },
    {
      "text": "Louis Coraggio. 1990. Deleterious effects of intermittent interruptions on the task performance of knowledge workers: A laboratory investigation. (1990).",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A Diary Study of Task Switching and Interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 175--182. DOI: http://dx.doi.org/10.1145/985692.985715",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Mary Czerwinski and Eric Horvitz. 2002. An Investigation of Memory for Daily Computing Events. In People and Computers XVI - Memorable Yet Invisible, Xristine Faulkner, Janet Finlay, and Françoise Détienne (Eds.). Springer London, London, 229--245.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish and Robert E. Kraut. 2004. Controlling Interruptions: Awareness Displays and Social Motivation for Coordination. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 182--191. DOI: http://dx.doi.org/10.1145/1031607.1031638",
      "doi": ""
    },
    {
      "text": "Wei Ding, Gary Marchionini, and Dagobert Soergel. 1999. Multimodal Surrogates for Video Browsing. CoRR cs.DL/9902019 (1999). http://arxiv.org/abs/cs.DL/9902019",
      "doi": ""
    },
    {
      "text": "Anton N. Dragunov, Thomas G. Dietterich, Kevin Johnsrude, Matthew McLaughlin, Lida Li, and Jonathan L. Herlocker. 2005. TaskTracer: A Desktop Environment to Support Multi-tasking Knowledge Workers. In Proceedings of the 10th International Conference on Intelligent User Interfaces (IUI '05). ACM, NY, NY, USA, 75--82. DOI: http://dx.doi.org/10.1145/1040830.1040855",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015. From \"Nobody Cares\" to \"Way to Go!\": A Design Framework for Social Sharing in Personal Informatics. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1622--1636. DOI: http://dx.doi.org/10.1145/2675133.2675135",
      "doi": ""
    },
    {
      "text": "Adam Fouse, Nadir Weibel, Edwin Hutchins, and James D. Hollan. 2011. ChronoViz: A System for Supporting Navigation of Time-coded Data. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 299--304. DOI: http://dx.doi.org/10.1145/1979742.1979706",
      "doi": ""
    },
    {
      "text": "Eric Freeman and David Gelernter. 1996. Lifestreams: A Storage Model for Personal Data. SIGMOD Rec. 25, 1 (March 1996), 80--86. DOI: http://dx.doi.org/10.1145/381854.381893",
      "doi": "10.1145/381854.381893"
    },
    {
      "text": "Victor M. González, Gloria Mark, and Gloria Mark. 2004. \"Constant, Constant, Multi-tasking Craziness\": Managing Multiple Working Spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/985692.985707",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2010. Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 143--152. DOI: http://dx.doi.org/10.1145/1866029.1866054",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Joshua Hailpern, Nicholas Jitkoff, Andrew Warr, Karrie Karahalios, Robert Sesek, and Nik Shkrob. 2011. YouPivot: Improving Recall with Contextual Search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1521--1530. DOI: http://dx.doi.org/10.1145/1978942.1979165",
      "doi": "10.1145/1978942.1979165"
    },
    {
      "text": "L. Hattori, M. D'Ambros, M. Lanza, and M. Lungu. 2011. Software Evolution Comprehension: Replay to the Rescue. In 2011 IEEE 19th International Conference on Program Comprehension. 161--170. DOI: http://dx.doi.org/10.1109/ICPC.2011.39",
      "doi": "10.1109/ICPC.2011.39"
    },
    {
      "text": "Atlas Informatics. 2016. ATLAS Recall. https://www.youtube.com/watch?v=fGev9Zo6y-I. (2016).",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2007. Understanding and Developing Models for Detecting and Differentiating Breakpoints During Interactive Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 697--706. DOI: http://dx.doi.org/10.1145/1240624.1240732",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and Recovery of Computing Tasks: Field Study, Analysis, and Directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 677--686. DOI: http://dx.doi.org/10.1145/1240624.1240730",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Quintus R. Jett and Jennifer M. George. 2003. Work Interrupted: A Closer Look at the Role of Interruptions in Organizational Life. Academy of Management Review 28, 3 (2003), 494--507. DOI: http://dx.doi.org/10.5465/amr.2003.10196791",
      "doi": ""
    },
    {
      "text": "Steven Jeuris, Steven Houben, and Jakob Bardram. 2014. Laevo: A Temporal Desktop Interface for Integrated Knowledge Work. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 679--688. DOI: http://dx.doi.org/10.1145/2642918.2647391",
      "doi": "10.1145/2642918.2647391"
    },
    {
      "text": "Jaemin Jo, Bohyoung Kim, and Jinwook Seo. 2015. EyeBookmark: Assisting Recovery from Interruption During Reading. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2963--2966. DOI: http://dx.doi.org/10.1145/2702123.2702340",
      "doi": "10.1145/2702123.2702340"
    },
    {
      "text": "Shaun Kaasten, Saul Greenberg, and Christopher Edwards. 2002. How people recognise previously seen Web pages from titles, URLs and thumbnails. In People and Computers XVI-Memorable Yet Invisible. Springer, 247--265.",
      "doi": ""
    },
    {
      "text": "Andrew J. Ko, Htet Aung, and Brad A. Myers. 2005. Eliciting Design Requirements for Maintenance-oriented IDEs: A Detailed Study of Corrective and Perfective Maintenance Tasks. In Proceedings of the 27th International Conference on Software Engineering (ICSE '05). ACM, NY, NY, USA, 126--135. DOI: http://dx.doi.org/10.1145/1062455.1062492",
      "doi": ""
    },
    {
      "text": "Judy Kopp. 1988. Self-monitoring: A literature review of research and practice. In Social Work Research and Abstracts, Vol. 24. Oxford University Press, 8--20.",
      "doi": ""
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2018. Rotating Online Behavior Change Interventions Increases Effectiveness But Also Increases Attrition. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 95 (Nov. 2018), 25 pages. DOI: http://dx.doi.org/10.1145/3274364",
      "doi": ""
    },
    {
      "text": "Mik Lamming and Mike Flynn. 1994. \"Forget-me-not\" Intimate Computing in Support of Human Memory. 125--128.",
      "doi": ""
    },
    {
      "text": "Michael G Lamming and William M Newman. 1992. Activity-based Information Retrieval: Technology in Support of Personal Memory.. In IFIP Congress (3), Vol. 14. 68--81.",
      "doi": ""
    },
    {
      "text": "Andrew Large, Jamshid Beheshti, Alain Breuleux, and Andre Renaud. 1995. Multimedia and comprehension: The relationship among text, animation, and captions. Journal of the American Society for Information Science 46, 5 (June 1995), 340--347. https://ideas.repec.org/a/bla/jamest/v46y1995i5p340--347.html",
      "doi": ""
    },
    {
      "text": "Sang Won Lee and Georg Essl. 2015. Live writing: Asynchronous playback of live coding and writing. In Proceedings of the International Conference on Live Coding.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2016. You are Your Data: Self-Tracking Practices and Concepts of Data. Springer Fachmedien Wiesbaden, Wiesbaden, 61--79. DOI: http://dx.doi.org/10.1007/978--3--658--13137--1_4",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Gloria Mark, Victor M. Gonzalez, and Justin Harris. 2005. No Task Left Behind?: Examining the Nature of Fragmented Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/1054972.1055017",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Jaap M. J. Murre and Joeri Dros. 2015. Replication and Analysis of Ebbinghaus's Forgetting Curve. PLOS ONE 10, 7 (07 2015), 1--23. DOI: http://dx.doi.org/10.1371/journal.pone.0120644",
      "doi": ""
    },
    {
      "text": "Gina Neff and Dawn Nafus. 2016. Self-Tracking (1st ed.). The MIT Press.",
      "doi": ""
    },
    {
      "text": "Cal Newport. 2019. Digital Minimalism: Choosing a Focused Life in a Noisy World. Penguin.",
      "doi": ""
    },
    {
      "text": "Chris Parnin and Robert DeLine. 2010. Evaluating Cues for Resuming Interrupted Programming Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 93--102. DOI: http://dx.doi.org/10.1145/1753326.1753342",
      "doi": "10.1145/1753326.1753342"
    },
    {
      "text": "C. Parnin and S. Rugaber. 2009. Resumption strategies for interrupted programming tasks. In 2009 IEEE 17th International Conference on Program Comprehension. 80--89. DOI: http://dx.doi.org/10.1109/ICPC.2009.5090030",
      "doi": ""
    },
    {
      "text": "Leslie A. Perlow. 1999. The Time Famine: Toward a Sociology of Work Time. Administrative Science Quarterly 44, 1 (1999), 57--81. DOI: http://dx.doi.org/10.2307/2667031",
      "doi": ""
    },
    {
      "text": "Mika Raento and Antti Oulasvirta. 2008. Designing for Privacy and Self-presentation in Social Awareness. Personal Ubiquitous Comput. 12, 7 (Oct. 2008), 527--542. DOI: http://dx.doi.org/10.1007/s00779-008-0200--9",
      "doi": "10.1007/s00779-008-0200-9"
    },
    {
      "text": "Jun Rekimoto. 1999. Time-machine Computing: A Time-centric Approach for the Information Environment. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology (UIST '99). ACM, NY, NY, USA, 45--54. DOI: http://dx.doi.org/10.1145/320719.322582",
      "doi": "10.1145/320719.322582"
    },
    {
      "text": "Adam Rule, Aurélien Tabard, Karen Boyd, and Jim Hollan. 2015. Restoring the Context of Interrupted Work with Desktop Thumbnails. In 37th Annual Meeting of the Cognitive Science Society. Cognitive Science Society, Pasadena, United States, 1--6. https://hal.archives-ouvertes.fr/hal-01213708",
      "doi": ""
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and Jim Hollan. 2017. Using Visual Histories to Reconstruct the Mental Context of Suspended Activities. Hum.-Comput. Interact. 32, 5--6 (Nov. 2017), 511--558. DOI: http://dx.doi.org/10.1080/07370024.2017.1300063",
      "doi": "10.1080/07370024.2017.1300063"
    },
    {
      "text": "Daniel M. Russell and Ed H. Chi. 2014. Looking Back: Retrospective Study Methods for HCI. Springer New York, New York, NY, 373--393. DOI: http://dx.doi.org/10.1007/978--1--4939-0378--8_15",
      "doi": ""
    },
    {
      "text": "D. M. Russell and M. Oren. 2009. Retrospective Cued Recall: A Method for Accurately Recalling Previous User Behaviors. In 2009 42nd Hawaii International Conference on System Sciences. 1--9. DOI: http://dx.doi.org/10.1109/HICSS.2009.370",
      "doi": ""
    },
    {
      "text": "Izzet Safer and Gail C. Murphy. 2007. Comparing Episodic and Semantic Interfaces for Task Boundary Identification. In Proceedings of the 2007 Conference of the Center for Advanced Studies on Collaborative Research (CASCON '07). IBM Corp., Riverton, NJ, USA, 229--243. DOI: http://dx.doi.org/10.1145/1321211.1321235",
      "doi": "10.1145/1321211.1321235"
    },
    {
      "text": "Dario D. Salvucci. 2010. On Reconstruction of Task Context After Interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 89--92. DOI: http://dx.doi.org/10.1145/1753326.1753341",
      "doi": "10.1145/1753326.1753341"
    },
    {
      "text": "Stacey D. Scott, Stephane Mercier, M. L. Cummings, and Enlie Wang. 2006. Assisting Interruption Recovery in Supervisory Control of Multiple Uavs. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 5 (2006), 699--703. DOI: http://dx.doi.org/10.1177/154193120605000518",
      "doi": ""
    },
    {
      "text": "Greg Smith, Patrick Baudisch, George Robertson, Mary Czerwinski, Brian Meyers, Daniel Robbins, and Donna Andrews. 2003. Groupbar: The taskbar evolved. In Proceedings of OZCHI, Vol. 3. 10.",
      "doi": ""
    },
    {
      "text": "Lionel Standing, Jerry Conezio, and Ralph Norman Haber. 1970. Perception and memory for pictures: Single-trial learning of 2500 visual stimuli. Psychonomic Science 19, 2 (01 Aug 1970), 73--74. DOI: http://dx.doi.org/10.3758/BF03337426",
      "doi": ""
    },
    {
      "text": "Bin Xu, Pamara Chang, Christopher L. Welker, Natalya N. Bazarova, and Dan Cosley. 2016. Automatic Archiving Versus Default Deletion: What Snapchat Tells Us About Ephemerality in Design. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1662--1675. DOI: http://dx.doi.org/10.1145/2818048.2819948",
      "doi": "10.1145/2818048.2819948"
    },
    {
      "text": "Y. Yoon, B. A. Myers, and S. Koo. 2013. Visualization of fine-grained code change history. In 2013 IEEE Symposium on Visual Languages and Human Centric Computing. 119--126. DOI: http://dx.doi.org/10.1109/VLHCC.2013.6645254",
      "doi": ""
    }
  ]
}