{
  "doi": "10.1145/3313831.3376801",
  "title": "Food Literacy while Shopping: Motivating Informed Food Purchasing Behaviour with a Situated Gameful App",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Establishing healthy eating patterns early in life is critical and has implications for lifelong health. Situated interventions are a promising approach to improve eating patterns. However, HCI research has emphasized calorie control and weight loss, potentially leading consumers to prioritize caloric intake over healthy eating patterns. To support healthy eating more holistically, we designed a gameful app called Pirate Bri's Grocery Adventure (PBGA) that seeks to improve food literacy—meaning the interconnected combination of food-related knowledge, skills, and behaviours that empower an individual to make informed food choices— through a situated approach to grocery shopping. Findings from our three-week field study revealed that PBGA was effective for improving players' nutrition knowledge and motivation for healthier food choices and reducing their impulse purchases. Our findings highlight that nutrition apps should promote planning and shopping based on balance, variety, and moderation.",
  "tags": [
    "gameful design",
    "healthy eating",
    "grocery shopping",
    "situated app",
    "nutrition",
    "food literacy"
  ],
  "authors": [
    {
      "name": "Marcela C. C. Bomfim",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-99659515261/rel-imgonly/marcela-profile-2019-360x480.jpg",
      "acmid": "99659515261",
      "orcid": "missing"
    },
    {
      "name": "Sharon I. Kirkpatrick",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527345",
      "orcid": "missing"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    },
    {
      "name": "James R. Wallace",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81311486022/rel-imgonly/4016_portrait_-_oct_2013_-_small.jpg",
      "acmid": "81311486022",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Junho Ahn, James Williamson, Mike Gartrell, Richard Han, Qin Lv, and Shivakant Mishra. 2015. Supporting Healthy Grocery Shopping via Mobile Augmented Reality. ACM Trans. Multimedia Comput. Commun. Appl. 12, 1s, Article 16 (Oct. 2015), 24 pages. DOI: http://dx.doi.org/10.1145/2808207",
      "doi": "10.1145/2808207"
    },
    {
      "text": "Sanjay Basu, Paula Yoffe, Nancy Hills, and Robert H Lustig. 2013. The relationship of sugar to population-level diabetes prevalence: an econometric analysis of repeated cross-sectional data. PloS one 8, 2 (2013), e57873.",
      "doi": ""
    },
    {
      "text": "Sapna Bedi, Javier Diaz Ruvalcaba, Zoltan Foley-Fisher, Noreen Kamal, and Vincent Tsao. 2010. Health Shelf: Interactive Nutritional Labels. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 4405--4410. DOI: http://dx.doi.org/10.1145/1753846.1754161",
      "doi": "10.1145/1753846.1754161"
    },
    {
      "text": "Silvia Bellini, Maria Grazia Cardinali, and Benedetta Grandi. 2017. A structural equation model of impulse buying behaviour in grocery retailing. Journal of Retailing and Consumer Services 36 (2017), 164--171.",
      "doi": ""
    },
    {
      "text": "Marcela C. C. Bomfim and James R. Wallace. 2018. Pirate Bri's Grocery Adventure: Teaching Food Literacy Through Shopping. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW068, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188496",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Sarah Campos, Juliana Doxey, and David Hammond. 2011. Nutrition labels on pre-packaged foods: a systematic review. Public health nutrition 14, 8 (2011), 1496--1506.",
      "doi": ""
    },
    {
      "text": "Health Canada. 2018. My Food Guide - Google Play. (2018). No longer available on Google Play Store.",
      "doi": ""
    },
    {
      "text": "Health Canada. 2019a. Canada's Food Guide. (2019). https://food-guide.canada.ca/en/.",
      "doi": ""
    },
    {
      "text": "Health Canada. 2019b. Food and Nutrition. (2019). https://www.canada.ca/en/services/health/food-nutrition.html.",
      "doi": ""
    },
    {
      "text": "Mary J Christoph, Nicole I Larson, Megan R Winkler, Melanie M Wall, and Dianne Neumark-Sztainer. 2019. Longitudinal trajectories and prevalence of meeting dietary guidelines during the transition from adolescence to young adulthood. The American journal of clinical nutrition 109, 3 (2019), 656--664.",
      "doi": ""
    },
    {
      "text": "Deborah A Cohen and Susan H Babey. 2012. Candy at the cash register - a risk factor for obesity and chronic disease. New England Journal of Medicine 367, 15 (2012), 1381--1383.",
      "doi": ""
    },
    {
      "text": "Sarah Colatruglio and Joyce Slater. 2016. Challenges to acquiring and utilizing food literacy: Perceptions of young Canadian adults. Canadian Food Studies 3, 1 (2016), 96--118.",
      "doi": ""
    },
    {
      "text": "Fátima Cruz, Elisabete Ramos, Carla Lopes, and Joana Araújo. 2018. Tracking of food and nutrient intake from adolescence into early adulthood. Nutrition 55 (2018), 84--90.",
      "doi": ""
    },
    {
      "text": "Tracy Cullen, Janelle Hatch, Wanda Martin, Joan Wharf Higgins, and Rosanna Sheppard. 2015. Food literacy: definition and framework for action. Canadian Journal of Dietetic Practice and Research 76, 3 (2015), 140--145.",
      "doi": ""
    },
    {
      "text": "Katherine Cullerton, Helen A Vidgen, and Danielle Gallegos. 2012. A review of food literacy interventions targeting disadvantaged young people. (2012).",
      "doi": ""
    },
    {
      "text": "Ellen Desjardins and E Azevedo. 2013. Making something out of nothing: Food literacy among youth, young pregnant women and young parents who are at risk for poor health. Locally Driven Collaborative Projects Food Skills Ontario (2013), 1--89.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, NY, NY, USA, 9--15. DOI: http://dx.doi.org/10.1145/2181037.2181040",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Davor Dujak, Marta Botkuljak, and Jelena Franjkovic. 2018. The Influence of Grocery Store's Space Determinants on Impulse Buying Tendency. In 32nd International Business Information Management Association Conference (IBIMA).",
      "doi": ""
    },
    {
      "text": "Elizabeth V. Eikey and Madhu C. Reddy. 2017. \"It's Definitely Been a Journey\": A Qualitative Study on How Women with Eating Disorders Use Weight Loss Apps. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 642--654. DOI: http://dx.doi.org/10.1145/3025453.3025591",
      "doi": "10.1145/3025453.3025591"
    },
    {
      "text": "American Institute for Cancer Research. 2018. Diet, Nutrition, Physical Activity and Cancer: A Global Perspective. (2018). https://www.wcrf.org/sites/default/files/Summary-of-Third-Expert-Report-2018.pdf.",
      "doi": ""
    },
    {
      "text": "Danielle Gallegos, Rebecca Ramsey, and Kai Wen Ong. 2014. Food insecurity: is it an issue among tertiary students? Higher Education 67, 5 (2014), 497--510.",
      "doi": ""
    },
    {
      "text": "Feng Gao, Enrico Costanza, and M. C. Schraefel. 2012. \"Honey=Sugar\" Means Unhealthy: Investigating How People Apply Knowledge to Rate Food's Healthiness. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 71--80. DOI: http://dx.doi.org/10.1145/2370216.2370228",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Vasudhara Kantroo, and Rebecca E. Grinter. 2010. Let's Play!: Mobile Health Games for Adults. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (UbiComp '10). ACM, NY, NY, USA, 241--250. DOI: http://dx.doi.org/10.1145/1864349.1864370",
      "doi": ""
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow technology--designing for reflection. Personal and ubiquitous computing 5, 3 (2001), 201--212.",
      "doi": ""
    },
    {
      "text": "Melanie Hingle and Heather Patrick. 2016. There are thousands of apps for that: navigating mobile technology for nutrition education and behavior. Journal of nutrition education and behavior 48, 3 (2016), 213--218.",
      "doi": ""
    },
    {
      "text": "Maria L. Hwang and Lena Mamykina. 2017. Monster Appetite: Effects of Subversive Framing on Nutritional Choices in a Digital Game Environment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4082--4096. DOI: http://dx.doi.org/10.1145/3025453.3026052",
      "doi": ""
    },
    {
      "text": "Shakeela N Jayasinghe, Rozanne Kruger, Daniel CI Walsh, Guojiao Cao, Stacey Rivers, Marilize Richter, and Bernhard H Breier. 2017. Is sweet taste perception associated with sweet food liking and intake? Nutrients 9, 7 (2017), 750.",
      "doi": ""
    },
    {
      "text": "Daniel Johnson, Sebastian Deterding, Kerri-Ann Kuhn, Aleksandra Staneva, Stoyan Stoyanov, and Leanne Hides. 2016. Gamification for health and wellbeing: A systematic review of the literature. Internet interventions 6 (2016), 89--106.",
      "doi": ""
    },
    {
      "text": "Dennis L. Kappen and Rita Orji. 2017. Gamified and Persuasive Systems As Behavior Change Agents for Health and Wellness. XRDS 24, 1 (Sept. 2017), 52--55. DOI: http://dx.doi.org/10.1145/3123750",
      "doi": "10.1145/3123750"
    },
    {
      "text": "Nathalie Kliemann, Jane Wardle, Fiona Johnson, and Helen Croker. 2016. Reliability and validity of a revised version of the General Nutrition Knowledge Questionnaire. European journal of clinical nutrition 70, 10 (2016), 1174.",
      "doi": ""
    },
    {
      "text": "Paul Krebs and Dustin T Duncan. 2015. Health app use among US mobile phone owners: a national survey. JMIR mHealth and uHealth 3, 4 (2015).",
      "doi": ""
    },
    {
      "text": "Charalampos Kyfonidis and Marilyn Lennon. 2019. Making Diabetes Education Interactive: Tangible Educational Toys for Children with Type-1 Diabetes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 441, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300671",
      "doi": "10.1145/3290605.3300671"
    },
    {
      "text": "Christine Logel, Danu Anthony Stinson, and Paula M Brochu. 2015. Weight loss is not the answer: A well-being solution to the \"obesity problem\". Social and Personality Psychology Compass 9, 12 (2015), 678--695.",
      "doi": ""
    },
    {
      "text": "Jean-Claude Moubarac, Ana Paula Bortoletto Martins, Rafael Moreira Claro, Renata Bertazzi Levy, Geoffrey Cannon, and Carlos Augusto Monteiro. 2013. Consumption of ultra-processed foods and likely impact on human health. Evidence from Canada. Public Health Nutrition 16, 12 (2013), 2240--2248.",
      "doi": ""
    },
    {
      "text": "Barry Mulrooney, Mairéad McDermott, and Nick Earley. 2006. NutraStick: Portable Diet Assistant. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 1855--1860. DOI: http://dx.doi.org/10.1145/1125451.1125802",
      "doi": "10.1145/1125451.1125802"
    },
    {
      "text": "Scott Nicholson. 2015. A recipe for meaningful gamification. In Gamification in education and business. Springer, 1--20.",
      "doi": ""
    },
    {
      "text": "Martin J O'donnell, Denis Xavier, Lisheng Liu, Hongye Zhang, Siu Lim Chin, Purnima Rao-Melacini, Sumathy Rangarajan, Shofiqul Islam, Prem Pais, Matthew J McQueen, and others. 2010. Risk factors for ischaemic and intracerebral haemorrhagic stroke in 22 countries (the INTERSTROKE study): a case-control study. The Lancet 376, 9735 (2010), 112--123.",
      "doi": ""
    },
    {
      "text": "Canadian Council on Learning. 2010. Canadian Council on Learning. Challenges in Canadian Post-secondary Education. Navigating Post-secondary Education in Canada: The Challenge of a Changing Landscape. (2010). http://en.copian.ca/library/research/ccl/costs/costs.pdf.",
      "doi": ""
    },
    {
      "text": "Rita Orji and Regan L Mandryk. 2014. Developing culturally relevant design guidelines for encouraging healthy eating behavior. International Journal of Human-Computer Studies 72, 2 (2014), 207--223.",
      "doi": "10.1016/j.ijhcs.2013.08.012"
    },
    {
      "text": "Rita Orji, Regan L. Mandryk, and Julita Vassileva. 2017. Improving the Efficacy of Games for Change Using Personalization Models. ACM Trans. Comput.-Hum. Interact. 24, 5, Article 32 (Oct. 2017), 22 pages. DOI: http://dx.doi.org/10.1145/3119929",
      "doi": "10.1145/3119929"
    },
    {
      "text": "Rita Orji, Julita Vassileva, and Regan L. Mandryk. 2013. LunchTime: A Slow-casual Game for Long-term Dietary Behavior Change. Personal Ubiquitous Comput. 17, 6 (Aug. 2013), 1211--1221. DOI: http://dx.doi.org/10.1007/s00779-012-0590--6",
      "doi": "10.1007/s00779-012-0590-6"
    },
    {
      "text": "Esther K Papies. 2016. Goal priming as a situated intervention tool. Current Opinion in Psychology 12 (2016), 12--16.",
      "doi": ""
    },
    {
      "text": "Joongsin Park, Bon-chang Koo, Jundong Cho, and Byung-Chull Bae. 2015. SnackBreaker: A Game Promoting Healthy Choice of Snack Foods. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 673--678. DOI: http://dx.doi.org/10.1145/2793107.2810331",
      "doi": "10.1145/2793107.2810331"
    },
    {
      "text": "Louisa Pavey and Sue Churchill. 2014. Promoting the avoidance of high-calorie snacks: priming autonomy moderates message framing effects. PloS one 9, 7 (2014), e103892.",
      "doi": ""
    },
    {
      "text": "Wei Peng. 2009. Design and evaluation of a computer game to promote a healthy diet for young adults. Health communication 24, 2 (2009), 115--127.",
      "doi": ""
    },
    {
      "text": "Tarra L Penney and Sara FL Kirk. 2015. The health at every size paradigm and obesity: missing empirical evidence may help push the reframing obesity debate forward. American journal of public health 105, 5 (2015), e38--e42.",
      "doi": ""
    },
    {
      "text": "Elsie Azevedo Perry, Heather Thomas, H Ruby Samra, Shannon Edmonstone, Lyndsay Davidson, Amy Faulkner, Lisa Petermann, Elizabeth Manafò, and Sharon I Kirkpatrick. 2017. Identifying attributes of food literacy: A scoping review. Public health nutrition 20, 13 (2017), 2406--2415.",
      "doi": ""
    },
    {
      "text": "Tauhidur Rahman, Mary Czerwinski, Ran Gilad-Bachrach, and Paul Johns. 2016. Predicting \"About-to-Eat\" Moments for Just-in-Time Eating Intervention. In Proceedings of the 6th International Conference on Digital Health Conference (DH '16). ACM, NY, NY, USA, 141--150. DOI: http://dx.doi.org/10.1145/2896338.2896359",
      "doi": "10.1145/2896338.2896359"
    },
    {
      "text": "Chad Richards, Craig W. Thompson, and Nicholas Graham. 2014. Beyond Designing for Motivation: The Importance of Context in Gamification. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 217--226. DOI: http://dx.doi.org/10.1145/2658537.2658683",
      "doi": "10.1145/2658537.2658683"
    },
    {
      "text": "Irwin M Rosenstock. 1974. The health belief model and preventive health behavior. Health education monographs 2, 4 (1974), 354--386.",
      "doi": ""
    },
    {
      "text": "Ralf Schwarzer and Reinhard Fuchs. 1996. Self-efficacy and health behaviours. Predicting health behavior: Research and practice with social cognition models (1996), 163--196.",
      "doi": ""
    },
    {
      "text": "Mariya Shiyko, Sean Hallinan, Magy Seif El-Nasr, Shree Subramanian, and Carmen Castaneda-Sceppa. 2016. Effects of playing a serious computer game on body mass index and nutrition knowledge in women. JMIR serious games 4, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Kami J Silk, John Sherry, Brian Winn, Nicole Keesecker, Mildred A Horodynski, and Aylin Sayir. 2008. Increasing nutrition literacy: testing the effectiveness of print, web site, and game modalities. Journal of nutrition education and behavior 40, 1 (2008), 3--10.",
      "doi": ""
    },
    {
      "text": "Frances Sienkiewicz Sizer, Leonard A Piché, Eleanor Noss Whitney, and Ellie Whitney. 2017. Nutrition: concepts and controversies (4th edition). Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Statista. 2019. Age breakdown of video game players in the United States in 2019. (2019). https://www.statista.com/statistics/189582/age-of-us-video-game-players-since-2010/.",
      "doi": ""
    },
    {
      "text": "Na ¯ da Terzimehi´ c, Christina Schneegass, and Heinrich Hussmann. 2018. Towards Finding Windows of Opportunity for Ubiquitous Healthy Eating Interventions. In International Conference on Persuasive Technology, Jaap Ham, Evangelos Karapanos, Plinio P. Morita, and Catherine M. Burns (Eds.). 99--112.",
      "doi": ""
    },
    {
      "text": "Kristian Torning and Harri Oinas-Kukkonen. 2009. Persuasive System Design: State of the Art and Future Directions. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive '09). ACM, NY, NY, USA, Article 30, 8 pages. DOI: http://dx.doi.org/10.1145/1541948.1541989",
      "doi": "10.1145/1541948.1541989"
    },
    {
      "text": "Emily Truman and Charlene Elliott. 2019. Barriers to food literacy: A conceptual model to explore factors inhibiting proficiency. Journal of nutrition education and behavior 51, 1 (2019), 107--111.",
      "doi": ""
    },
    {
      "text": "Rimante Vaitkeviciute, Lauren E Ball, and Neil Harris. 2015. The relationship between food literacy and dietary intake in adolescents: a systematic review. Public health nutrition 18, 4 (2015), 649--658.",
      "doi": ""
    },
    {
      "text": "Helen Anna Vidgen and Danielle Gallegos. 2014. Defining food literacy and its components. Appetite 76 (2014), 50--59.",
      "doi": ""
    },
    {
      "text": "Christopher M Wharton, Carol S Johnston, Barbara K Cunningham, and Danielle Sterner. 2014. Dietary self-monitoring, but not dietary quality, improves with use of smartphone app technology in an 8-week weight loss trial. Journal of nutrition education and behavior 46, 5 (2014), 440--444.",
      "doi": ""
    },
    {
      "text": "Judy B Wilkinson, J Barry Mason, and Christie H Paksoy. 1982. Assessing the impact of short-term supermarket strategy variables. Journal of Marketing Research (1982), 72--86.",
      "doi": ""
    },
    {
      "text": "Quanhe Yang, Zefeng Zhang, Edward W Gregg, W Dana Flanders, Robert Merritt, and Frank B Hu. 2014. Added sugar intake and cardiovascular diseases mortality among US adults. JAMA internal medicine 174, 4 (2014), 516--524.",
      "doi": ""
    },
    {
      "text": "Zhiyong Zhang and Xiefu Zhang. 2011. Salt taste preference, sodium intake and gastric cancer in China. Asian Pacific journal of cancer prevention: APJCP 12, 5 (2011), 1207--1210.",
      "doi": ""
    }
  ]
}