{
  "doi": "10.1145/3313831.3376184",
  "title": "Reading with the Tongue: Individual Differences Affect the Perception of Ambiguous Stimuli with the BrainPort",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "There is an increasing interest in non-visual interfaces for HCI to take advantage of the information processing capability of the other sensory modalities. The BrainPort is a vision-to-tactile sensory substitution device that conveys information through electro-stimulation on the tongue. As the tongue is a horizontal surface, it makes for an interesting platform to study the brain's representation of space. But which way is up on the tongue? We provided participants with perceptually ambiguous stimuli and measured how often different perspectives were adopted; furthermore, whether camera orientation and gender had an effect. Additionally, we examined whether personality (trait extraversion and openness) could predict the perspective taken. We found that self-centered perspectives were predominantly adopted, and that trait openness may predict perspective. This research demonstrates how individual differences can affect the usability of sensory substitution devices, and highlights the need for flexible and customisable interfaces.",
  "tags": [
    "sensory substitution",
    "individual differences in computing",
    "user preferences",
    "tactile interfaces"
  ],
  "authors": [
    {
      "name": "Mike L. Richardson",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526518",
      "orcid": "missing"
    },
    {
      "name": "Tayfun Lloyd-Esenkaya",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529123",
      "orcid": "missing"
    },
    {
      "name": "Karin Petrini",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553402456",
      "orcid": "0000-0001-5354-5600"
    },
    {
      "name": "Michael J. Proulx",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490649352",
      "orcid": "0000-0003-4066-3645"
    }
  ],
  "references": [
    {
      "text": "Abboud, S., Hanassy, S., Levy-Tzedek, S., Maidenbaum, S. and Amedi, A. 2014. EyeMusic: Introducing a \"visual\" colorful experience for the blind using auditory sensory substitution. Restorative Neurology and Neuroscience. 32, 2 (Jan. 2014), 247--257. DOI: https://doi.org/10.3233/RNN130338.",
      "doi": ""
    },
    {
      "text": "Abdullah, M., Kim, M., Hassan, W., Kuroda, Y. and Jeon, S. 2017. HapticDrone: An Encountered-Type Kinesthetic Haptic Interface with Controllable Force Feedback: Initial Example for 1D Haptic Feedbac. Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology - UIST '17 (New York, New York, USA, 2017),115--117. DOI: https://doi.org/10.1145/3131785.3131821",
      "doi": "10.1145/3131785.3131821"
    },
    {
      "text": "Amedi, A., Stern, W.M., Camprodon, J.A., Bermpohl, F., Merabet, L., Rotman, S., Hemond, C., Meijer, P. and Pascual-Leone, A. 2007. Shape conveyed by visual-to-auditory sensory substitution activates the lateral occipital complex. Nature Neuroscience. 10, 6 (Jun. 2007), 687--689. DOI: https://doi.org/10.1038/nn1912.",
      "doi": ""
    },
    {
      "text": "Arnold, G., Spence, C. and Auvray, M. 2017. A unity of the self or a multiplicity of locations? How the graphesthesia task sheds light on the role of spatial perspectives in bodily self-consciousness. Consciousness and Cognition. 56, (Nov. 2017), 100-- 114. DOI: https://doi.org/10.1016/J.CONCOG.2017.06.0 12.",
      "doi": ""
    },
    {
      "text": "Arnold, G., Spence, C. and Auvray, M. 2016. Taking someone else's spatial perspective: Natural stance or effortful decentring? Cognition. 148, (Mar. 2016), 27--33. DOI: https://doi.org/10.1016/J.COGNITION.2015.1 2.006.",
      "doi": ""
    },
    {
      "text": "Bach-y-rita, P. 2004. Tactile Sensory Substitution Studies. Annals of the New York Academy of Sciences. 1013, 1 (2004), 83--91. DOI: https://doi.org/10.1 196/annals.1305.006.",
      "doi": ""
    },
    {
      "text": "Bach-y-Rita, P. and Kercel, S. 2003. Sensory substitution and the human--machine interface. Trends in Cognitive Sciences. 7, 12 (Dec. 2003), 541--546. DOI: https://doi.org/10.1016/J.TICS.2003.10.013.",
      "doi": ""
    },
    {
      "text": "Bertossa, F., Besa, M., Ferrari, R. and Ferri, F. 2008. Point Zero: A Phenomenological Inquiry into the Seat of Consciousness. Perceptual and Motor Skills. 107, 2 (Oct. 2008), 323--335. DOI: https://doi.org/10.2466/pms.107.2.323--335.",
      "doi": ""
    },
    {
      "text": "Birk, M. and Mandryk, R.L. 2013. Control your game-self. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (New York, New York, USA, 2013), 685. DOI: https://doi.org/10.1145/2470654.2470752",
      "doi": ""
    },
    {
      "text": "Van Boven, R.W. and Johnson, K.O. 1994. The limit of tactile spatial resolution in humans: grating orientation discrimination at the lip, tongue, and finger. Neurology. 44, 12 (Dec. 1994), 2361--6. DOI: https://doi.org/10.1212/wnl.44.12.2361.",
      "doi": ""
    },
    {
      "text": "Brown, D., Macpherson, T. and Ward, J. 2011. Seeing with Sound? Exploring Different Characteristics of a Visual-to-Auditory Sensory Substitution Device. Perception. 40, 9 (Sep. 2011), 1120--1135. DOI: https://doi.org/10.1068/p6952.",
      "doi": ""
    },
    {
      "text": "Carton, A. and Dunne, L.E. 2013. Tactile distance feedback for firefighters. Proceedings of the 4th Augmented Human International Conference on AH '13 (New York, New York, USA, 2013), 58--64. DOI: http://dx.doi.org/10.1145/2459236.2459247",
      "doi": ""
    },
    {
      "text": "Chebat, D.-R., Rainville, C., Kupers, R. and Ptito, M. 2007. Tactile--'visual' acuity of the tongue in early blind individuals. NeuroReport. 18, 18 (Dec. 2007), 1901--1904. DOI: https://doi.org/10.1097/WNR.0b013e3282f2a6 3.",
      "doi": ""
    },
    {
      "text": "Danilov, Y. and Tyler, M. 2005. BrainPort: An Alternative Input to the Brain. Journal of Integrative Neuroscience. 04, 04 (Dec. 2005), 537--550. DOI: https://doi.org/10.1142/S0219635205000914.",
      "doi": ""
    },
    {
      "text": "Dublon, G. and Paradiso, J.A. 2012. Tongueduino. (2012), 1453. DOI: https://doi.org/10.1145/2212776.2212482",
      "doi": ""
    },
    {
      "text": "Eysenck, H.J. 1961. Personality and Social Attitudes. The Journal of Social Psychology. 53, 2 (Apr. 1961), 243--248. DOI: https://doi.org/10.1080/00224545.1961.99221 22.",
      "doi": ""
    },
    {
      "text": "Ferrè, E.R., Lopez, C. and Haggard, P. 2014. Anchoring the Self to the Body. Psychological Science. 25, 11 (Nov. 2014), 2106--2108. DOI: https://doi.org/10.1177/0956797614547917.",
      "doi": ""
    },
    {
      "text": "Field, A. 2013. Discovering Statistics using IBM SPSS Statistics. Sage.",
      "doi": "10.5555/2502692"
    },
    {
      "text": "Funk, M. 2018. Human-drone interaction. Interactions. 25, 3 (Apr. 2018), 78--81. DOI: https://doi.org/10.1145/3194317.",
      "doi": "10.1145/3194317"
    },
    {
      "text": "Grant, P., Spencer, L., Arnoldussen, A., Hogle, R., Nau, A., Szlyk, J., Nussdorf, J., Fletcher, D.C., Gordon, K. and Seiple, W. 2016. The Functional Performance of the BrainPort V100 Device in Persons who Are Profoundly Blind. Journal of Visual Impairment & Blindness. 110, 2 (Mar. 2016), 77--88. DOI: https://doi.org/10.1177/0145482X1611000202 .",
      "doi": ""
    },
    {
      "text": "Hoy, M.B. 2018. Alexa, Siri, Cortana, and More: An Introduction to Voice Assistants. Medical Reference Services Quarterly. 37, 1 (Jan. 2018), 81--88. DOI: https://doi.org/10.1080/02763869.2018.14043 91.",
      "doi": ""
    },
    {
      "text": "John, O.P., Donahue, E.M. and Kentle, R.L. 1991. The big five inventory-versions 4a and 54. Berkeley, CA: University of California, Berkeley, Institute of Personality.",
      "doi": ""
    },
    {
      "text": "McCrae, R.R. 1996. Social consequences of experiential openness. Psychological Bulletin. 120, 3 (1996), 323--337. DOI: https://doi.org/10.1037/0033--2909.120.3.323.",
      "doi": ""
    },
    {
      "text": "Nau, A., Bach, M. and Fisher, C. 2013. Clinical Tests of Ultra-Low Vision Used to Evaluate Rudimentary Visual Perceptions Enabled by the BrainPort Vision Device. Translational Vision Science & Technology. 2, 3 (Jun. 2013), 1. DOI: https://doi.org/10.1167/tvst.2.3.1.",
      "doi": ""
    },
    {
      "text": "Parsons, L.M. and Shimojo, S. 1987. Perceived spatial organization of cutaneous patterns on surfaces of the human body in various positions. Journal of Experimental Psychology: Human Perception and Performance. 13, 3 (1987), 488--504. DOI: https://doi.org/10.1037/0096--1523.13.3.488.",
      "doi": ""
    },
    {
      "text": "Richardson, M., Thar, J., Borchers, J., Ward, J. and Hamilton-Fletcher, G. 2019. How much spatial information is lost in the sensory substitution process? Comparing visual, tactile, and auditory approaches. Perception. (2019). DOI: https://doi.org/10.1177/0301006619873194",
      "doi": ""
    },
    {
      "text": "Sampaio, E., Maris, S. and Bach-y-Rita, P. 2001. Brain plasticity: 'visual' acuity of blind persons via the tongue. Brain Research. 908, 2 (Jul. 2001), 204-- 207. DOI: https://doi.org/10.1016/S00068993(01)02667--1.",
      "doi": ""
    },
    {
      "text": "Schober, M.F. 1993. Spatial perspective-taking in conversation. Cognition. 47, 1 (Jan. 1993), 1--24. DOI: https://doi.org/10.1016/0010-0277(93)900609.",
      "doi": ""
    },
    {
      "text": "Sekiyama, K. 1991. Importance of head axes in perception of cutaneous patterns drawn on vertical body surfaces. Perception & Psychophysics. 49, 5 (Sep. 1991), 481--492. DOI: https://doi.org/10.3758/BF03212182.",
      "doi": ""
    },
    {
      "text": "Shelton, A.L., Clements-Stephens, A.M., Lam, W.Y., Pak, D.M. and Murray, A.J. 2012. Should social savvy equal good spatial skills? The interaction of social skills with spatial perspective taking. Journal of Experimental Psychology: General. 141, 2 (2012), 199--205. DOI: https://doi.org/10.1037/a0024617.",
      "doi": ""
    },
    {
      "text": "Stronks, H.C., Mitchell, E.B., Nau, A.C. and Barnes, N. 2016. Visual task performance in the blind with the BrainPort V100 Vision Aid. Expert Review of Medical Devices. 13, 10 (Oct. 2016), 919--931. DOI: https://doi.org/10.1080/17434440.2016.12372 87.",
      "doi": ""
    },
    {
      "text": "Tarampi, M.R., Heydari, N. and Hegarty, M. 2016. A Tale of Two Types of Perspective Taking. Psychological Science. 27, 11 (Nov. 2016), 1507-- 1516. DOI: https://doi.org/10.1177/0956797616667459.",
      "doi": ""
    },
    {
      "text": "Ward, J. and Meijer, P. 2010. Visual experiences in the blind induced by an auditory sensory substitution device. Consciousness and Cognition. 19, 1 (Mar. 2010), 492--500. DOI: https://doi.org/10.1016/j.concog.2009.10.006.",
      "doi": ""
    }
  ]
}