{
  "doi": "10.1145/3313831.3376592",
  "title": "Understanding Viewport- and World-based Pointing with Everyday Smart Devices in Immersive Augmented Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Personal smart devices have demonstrated a variety of efficient techniques for pointing and selecting on physical displays. However, when migrating these input techniques to augmented reality, it is both unclear what the relative performance of different techniques will be given the immersive nature of the environment, and it is unclear how viewport-based versus world-based pointing methods will impact performance. To better understand the impact of device and viewing perspectives on pointing in augmented reality, we present the results of two controlled experiments comparing pointing conditions that leverage various smartphone- and smartwatch-based external display pointing techniques and examine viewport-based versus world-based target acquisition paradigms. Our results demonstrate that viewport-based techniques offer faster selection and that both smartwatch- and smartphone-based pointing techniques represent high-performance options for performing distant target acquisition tasks in augmented reality.",
  "tags": [
    "augmented reality",
    "virtual reality",
    "3D pointing",
    "input devices",
    "mobile devices"
  ],
  "authors": [
    {
      "name": "Yuan Chen",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528266",
      "orcid": "missing"
    },
    {
      "name": "Keiko Katsuragawa",
      "institution": "University of Waterloo & National Research Council of Canada, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659026841",
      "orcid": "missing"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo & Inria & University of Lille, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    }
  ],
  "references": [
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. A survey of 3D object selection techniques for virtual environments. Computers & Graphics 37, 3 (2013), 121 -- 136. DOI: http://dx.doi.org/10.1016/j.cag.2012.12.003",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Teo Babic, Harald Reiterer, and Michael Haller. 2018. Pocket6: A 6DoF Controller Based On A Simple Smartphone Application. In Proceedings of the Symposium on Spatial User Interaction (SUI '18). ACM, NY, NY, USA, 2--10. DOI: http://dx.doi.org/10.1145/3267782.3267785",
      "doi": "10.1145/3267782.3267785"
    },
    {
      "text": "Louis-Pierre Bergé, Emmanuel Dubois, and Mathieu Raynal. 2015. Design and Evaluation of an \"Around the SmartPhone\" Technique for 3D Manipulations on Distant Display. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (SUI '15). ACM, NY, NY, USA, 69--78. DOI: http://dx.doi.org/10.1145/2788940.2788941",
      "doi": "10.1145/2788940.2788941"
    },
    {
      "text": "T. Bleeker, Gun Lee, and M. Billinghurst. 2013. Egoand Exocentric interaction for mobile AR conferencing. In 2013 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). 1--6. DOI: http://dx.doi.org/10.1109/ISMAR.2013.6671823",
      "doi": ""
    },
    {
      "text": "Sebastian Boring, Dominikus Baur, Andreas Butz, Sean Gustafson, and Patrick Baudisch. 2010. Touch Projector: Mobile Interaction Through Video. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2287--2296. DOI: http://dx.doi.org/10.1145/1753326.1753671",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Sebastian Boring, David Ledo, Xiang 'Anthony' Chen, Nicolai Marquardt, Anthony Tang, and Saul Greenberg. 2012. The Fat Thumb: Using the Thumb's Contact Size for Single-handed Mobile Interaction. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 39--48. DOI: http://dx.doi.org/10.1145/2371574.2371582",
      "doi": "10.1145/2371574.2371582"
    },
    {
      "text": "F. Bork, C. Schnelzer, U. Eck, and N. Navab. 2018. Towards Efficient Visual Guidance in Limited Field-of-View Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics 24, 11 (Nov 2018), 2983--2992. DOI: http://dx.doi.org/10.1109/TVCG.2018.2868584",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman, Chadwick A. Wingrave, J. M. Campbell, and V. Q. Ly. 2001. Using Pinch Gloves(TM) for both Natural and Abstract Interaction Techniques in Virtual Environments.",
      "doi": ""
    },
    {
      "text": "C. Christou, A. Tzanavari, K. Herakleous, and C. Poullis. 2016. Navigation in virtual reality: Comparison of gaze-directed and pointing motion control. In 2016 18th Mediterranean Electrotechnical Conference (MELECON). 1--6. DOI: http://dx.doi.org/10.1109/MELCON.2016.7495413",
      "doi": ""
    },
    {
      "text": "Nathan Cournia, John D. Smith, and Andrew T. Duchowski. 2003. Gazevs. Hand-based Pointing in Virtual Environments. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 772--773. DOI: http://dx.doi.org/10.1145/765891.765982",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Fraser Anderson, Tovi Grossman, Michelle Annett, Pourang Irani, and George Fitzmaurice. 2017. Ivy: Exploring Spatially Situated Visual Programming for Authoring and Understanding Intelligent Environments. In Proceedings of the 43rd Graphics Interface Conference (GI '17). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 156--162. DOI: http://dx.doi.org/10.20380/GI2017.20",
      "doi": "10.5555/3141475.3141507"
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (June 1954), 381--391.",
      "doi": ""
    },
    {
      "text": "Clifton Forlines, Daniel Vogel, and Ravin Balakrishnan. 2006. HybridPointing: Fluid Switching Between Absolute and Relative Pointing with a Direct Input Device. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 211--220. DOI: http://dx.doi.org/10.1145/1166253.1166286",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Uwe Gruenefeld, Dag Ennenga, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2017. EyeSee360: Designing a Visualization Technique for Out-of-view Objects in Head-mounted Augmented Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (SUI '17). ACM, NY, NY, USA, 109--118. DOI: http://dx.doi.org/10.1145/3131277.3132175",
      "doi": "10.1145/3131277.3132175"
    },
    {
      "text": "Faizan Haque, Mathieu Nancel, and Daniel Vogel. 2015. Myopoint: Pointing and Clicking Using Forearm Mounted Electromyography and Inertial Motion Sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3653--3656. DOI: http://dx.doi.org/10.1145/2702123.2702133",
      "doi": "10.1145/2702123.2702133"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (2006), 904--908. DOI: http://dx.doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Teresa Hirzle, Jan Rixen, Jan Gugenheimer, and Enrico Rukzio. 2018. WatchVR: Exploring the Usage of a Smartwatch for Interaction in Mobile Virtual Reality. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW634, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188629",
      "doi": "10.1145/3170427.3188629"
    },
    {
      "text": "HTC. 2019. HTC Vive. (2019). https://www.vive.com/us/.",
      "doi": ""
    },
    {
      "text": "Keiko Katsuragawa, Krzysztof Pietroszek, James R. Wallace, and Edward Lank. 2016. Watchpoint: Freehand Pointing with a Smartwatch in a Ubiquitous Display Environment. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, NY, NY, USA, 128--135. DOI: http://dx.doi.org/10.1145/2909132.2909263",
      "doi": "10.1145/2909132.2909263"
    },
    {
      "text": "Daniel Kharlamov, Brandon Woodard, Liudmila Tahai, and Krzysztof Pietroszek. 2016. TickTockRay: Smartwatch-based 3D Pointing for Smartphone-based Virtual Reality. In Proceedings of the 22Nd ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM, NY, NY, USA, 365--366. DOI: http://dx.doi.org/10.1145/2993369.2996311",
      "doi": "10.1145/2993369.2996311"
    },
    {
      "text": "Volodymyr V. Kindratenko. 2000. A Survey of Electromagnetic Position Tracker Calibration Techniques. Virtual Real. 5, 3 (Sept. 2000), 169--182. DOI: http://dx.doi.org/10.1007/BF01409422",
      "doi": "10.1007/BF01409422"
    },
    {
      "text": "Pascal Knierim, Valentin Schwind, Anna Maria Feit, Florian Nieuwenhuizen, and Niels Henze. 2018. Physical Keyboards in Virtual Reality: Analysis of Typing Performance and Effects of Avatar Hands. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 345, 9 pages. DOI: http://dx.doi.org/10.1145/3173574.3173919",
      "doi": "10.1145/3173574.3173919"
    },
    {
      "text": "Mikko Kytö, Barrett Ens, Thammathip Piumsomboon, Gun A. Lee, and Mark Billinghurst. 2018. Pinpointing: Precise Head- and Eye-Based Target Selection for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 81, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173655",
      "doi": "10.1145/3173574.3173655"
    },
    {
      "text": "Jiandong Liang and Mark Green. 1994. JDCAD: A highly interactive 3D modeling system. Computers & Graphics 18, 4 (1994), 499 -- 506. DOI: http://dx.doi.org/10.1016/0097--8493(94)90062-0",
      "doi": ""
    },
    {
      "text": "Microsoft. 2017. Mixed Reality Toolkit-Unity. (6 Oct 2017). https://github.com/microsoft/MixedRealityToolkit-Unity/releases/tag/v1.2017.1.2.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2019. Microsoft Hololens. (2019). https://www.microsoft.com/en-us/hololens.",
      "doi": ""
    },
    {
      "text": "Peter Mohr, Markus Tatzgern, Tobias Langlotz, Andreas Lang, Dieter Schmalstieg, and Denis Kalkofen. 2019. TrackCap: Enabling Smartphones for 3D Interaction on Mobile Head-Mounted Displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 585, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300815",
      "doi": "10.1145/3290605.3300815"
    },
    {
      "text": "Mathieu Nancel, Olivier Chapuis, Emmanuel Pietriga, Xing-Dong Yang, Pourang P. Irani, and Michel Beaudouin-Lafon. 2013. High-precision Pointing on Large Wall Displays Using Small Handheld Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 831--840. DOI: http://dx.doi.org/10.1145/2470654.2470773",
      "doi": "10.1145/2470654.2470773"
    },
    {
      "text": "Mathieu Nancel, Daniel Vogel, and Edward Lank. 2015. Clutching Is Not (Necessarily) the Enemy. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 4199--4202. DOI: http://dx.doi.org/10.1145/2702123.2702134",
      "doi": "10.1145/2702123.2702134"
    },
    {
      "text": "Oculus. 2019. Oculus Rift S. (2019). https://www.oculus.com/rift-s/.",
      "doi": ""
    },
    {
      "text": "Alexander Pacha. 2015. Sensor Fusion for Robust Outdoor Augmented Reality Tracking on Mobile Devices. GRIN Verlag, USA.",
      "doi": ""
    },
    {
      "text": "J. Karen Parker, Regan L. Mandryk, and Kori M. Inkpen. 2005. TractorBeam: Seamless Integration of Local and Remote Pointing for Tabletop Displays. In Proceedings of Graphics Interface 2005 (GI '05). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 33--40. http://dl.acm.org/citation.cfm?id=1089508.1089515",
      "doi": "10.5555/1089508.1089515"
    },
    {
      "text": "Julian Petford, Miguel A. Nacenta, and Carl Gutwin. 2018. Pointing All Around You: Selection Performance of Mouse and Ray-Cast Pointing in Full-Coverage Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 533, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3174107",
      "doi": "10.1145/3173574.3174107"
    },
    {
      "text": "Krzysztof Pietroszek, Anastasia Kuzminykh, James R. Wallace, and Edward Lank. 2014. Smartcasting: A Discount 3D Interaction Technique for Public Displays. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, NY, NY, USA, 119--128. DOI: http://dx.doi.org/10.1145/2686612.2686629",
      "doi": "10.1145/2686612.2686629"
    },
    {
      "text": "Krzysztof Pietroszek, James R. Wallace, and Edward Lank. 2015. Tiltcasting: 3D Interaction on Large Displays Using a Mobile Device. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 57--62. DOI: http://dx.doi.org/10.1145/2807442.2807471",
      "doi": "10.1145/2807442.2807471"
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The Go-go Interaction Technique: Non-linear Mapping for Direct Manipulation in VR. In Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology (UIST '96). ACM, NY, NY, USA, 79--80. DOI: http://dx.doi.org/10.1145/237091.237102",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Shaishav Siddhpuria, Sylvain Malacria, Mathieu Nancel, and Edward Lank. 2018. Pointing at a Distance with Everyday Smart Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 173, 11 pages. DOI: http://dx.doi.org/10.1145/3173574.3173747",
      "doi": "10.1145/3173574.3173747"
    },
    {
      "text": "Frank Steinicke, Timo Ropinski, and Klaus H. Hinrichs. 2004. Object Selection in Virtual Environments using an Improved Virtual Pointer Metaphor. In ICCVG.",
      "doi": ""
    },
    {
      "text": "Vildan Tanriverdi and Robert J. K. Jacob. 2000. Interacting with Eye Movements in Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 265--272. DOI: http://dx.doi.org/10.1145/332040.332443",
      "doi": ""
    },
    {
      "text": "Unity. 2019. Unity 2017.4.27. (10 May 2019). https://unity3d.com/unity/whats-new/2017.4.27.",
      "doi": ""
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with Soli: Exploring Fine-Grained Dynamic Gesture Recognition in the Radio-Frequency Spectrum. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 851--860. DOI: http://dx.doi.org/10.1145/2984511.2984565",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Ej Williams. 1949. Experimental Designs Balanced for the Estimation of Residual Effects of Treatments. DOI: http://dx.doi.org/10.1071/CH9490149",
      "doi": ""
    },
    {
      "text": "H. P. Wyss, R. Blach, and M. Bues. 2006. iSith Intersection-based Spatial Interaction for Two Hands. In 3D User Interfaces (3DUI'06). 59--61. DOI: http://dx.doi.org/10.1109/VR.2006.93",
      "doi": ""
    },
    {
      "text": "Yukang Yan, Chun Yu, Xiaojuan Ma, Shuai Huang, Hasan Iqbal, and Yuanchun Shi. 2018. Eyes-Free Target Acquisition in Interaction Space Around the Body for Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 42, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173616",
      "doi": "10.1145/3173574.3173616"
    }
  ]
}