{
  "doi": "10.1145/3313831.3376817",
  "title": "Optimizing for Happiness and Productivity: Modeling Opportune Moments for Transitions and Breaks at Work",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Information workers perform jobs that demand constant multitasking, leading to context switches, productivity loss, stress, and unhappiness. Systems that can mediate task transitions and breaks have the potential to keep people both productive and happy. We explore a crucial initial step for this goal: finding opportune moments to recommend transitions and breaks without disrupting people during focused states. Using affect, workstation activity, and task data from a three-week field study (N=25), we build models to predict whether a person should continue their task, transition to a new task, or take a break. The R-squared values of our models are as high as 0.7, with only 15% error cases. We ask users to evaluate the timing of recommendations provided by a recommender that relies on these models. Our study shows that users find our transition and break recommendations to be well-timed, rating them as 86% and 77% accurate, respectively. We conclude with a discussion of the implications for intelligent systems that seek to guide task transitions and manage interruptions at work.",
  "tags": [
    "workplace",
    "affect",
    "productivity",
    "recommendations"
  ],
  "authors": [
    {
      "name": "Harmanpreet Kaur",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658753868",
      "orcid": "missing"
    },
    {
      "name": "Alex C. Williams",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-99659130748/rel-imgonly/screen_shot_2022-03-21_at_5.16.58_pm.png",
      "acmid": "99659130748",
      "orcid": "missing"
    },
    {
      "name": "Daniel McDuff",
      "institution": "Microsoft Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490688111",
      "orcid": "missing"
    },
    {
      "name": "Mary Czerwinski",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100280834/rel-imgonly/marycz.jpg",
      "acmid": "81100280834",
      "orcid": "0000-0003-0881-401X"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    }
  ],
  "references": [
    {
      "text": "Mark S. Ackerman. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human-Computer Interaction 15, 2--3 (2000), 179--203. DOI: http://dx.doi.org/10.1207/S15327051HCI1523_5",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Rachel F. Adler and Raquel Benbunan-Fich. 2013. Self-interruptions in discretionary multitasking. Computers in Human Behavior 29, 4 (2013), 1441--1449. DOI: http://dx.doi.org/10.1016/j.chb.2013.01.040",
      "doi": "10.1016/j.chb.2013.01.040"
    },
    {
      "text": "Ane Alberdi, Asier Aztiria, and Adrian Basarab. 2016. Towards an automatic early stress recognition system for office environments based on multimodal measurements: A review. Journal of Biomedical Informatics 59 (2016), 49--75. DOI: http://dx.doi.org/10.1016/j.jbi.2015.11.007",
      "doi": "10.1016/j.jbi.2015.11.007"
    },
    {
      "text": "Brian P. Bailey and Shamsi T. Iqbal. 2008. Understanding Changes in Mental Workload during Execution of Goal-Directed Tasks and Its Application for Interruption Management. ACM Trans. Comput.-Hum. Interact. 14, 4, Article 21 (Jan 2008), 28 pages. DOI: http://dx.doi.org/10.1145/1314683.1314689",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Brian P. Bailey and Joseph A. Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior 22, 4 (2006), 685--708. DOI: http://dx.doi.org/10.1016/j.chb.2005.12.009",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett, Ralph Adolphs, Stacy Marsella, Aleix M. Martinez, and Seth D. Pollak. 2019. Emotional Expressions Reconsidered: Challenges to Inferring Emotion From Human Facial Movements. Psychological Science in the Public Interest 20, 1 (2019), 1--68. DOI: http://dx.doi.org/10.1177/1529100619832930",
      "doi": ""
    },
    {
      "text": "Emad Barsoum, Cha Zhang, Cristian Canton Ferrer, and Zhengyou Zhang. 2016. Training Deep Networks for Facial Expression Recognition with Crowd-Sourced Label Distribution. In Proceedings of the 18th ACM International Conference on Multimodal Interaction (ICMI '16). Association for Computing Machinery, New York, NY, USA, 279--283. DOI: http://dx.doi.org/10.1145/2993148.2993165",
      "doi": "10.1145/2993148.2993165"
    },
    {
      "text": "James \"Bo\" Begole, Nicholas E. Matsakis, and John C. Tang. 2004. Lilsys: Sensing Unavailability. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). Association for Computing Machinery, New York, NY, USA, 511--514. DOI: http://dx.doi.org/10.1145/1031607.1031691",
      "doi": ""
    },
    {
      "text": "Raquel Benbunan-Fich and Gregory E. Truman. 2009. Multitasking with Laptops during Meetings. Commun. ACM 52, 2 (Feb. 2009), 139--141. DOI: http://dx.doi.org/10.1145/1461928.1461963",
      "doi": ""
    },
    {
      "text": "Derek S Burkland. 2013. The effects of taking a short break: task difficulty, need for recovery and task performance. Ph.D. Dissertation. University of Wisconsin--Stout.",
      "doi": ""
    },
    {
      "text": "Scott A. Cambo, Daniel Avrahami, and Matthew L. Lee. 2017. BreakSense: Combining Physiological and Location Sensing to Promote Mobility During Work-Breaks. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3595--3607. DOI: http://dx.doi.org/10.1145/3025453.3026021",
      "doi": "10.1145/3025453.3026021"
    },
    {
      "text": "Daniel Chen, Jamie Hart, and Roel Vertegaal. 2007. Towards a Physiological Model of User Interruptability. In Human-Computer Interaction -- INTERACT 2007, Cécilia Baranauskas, Philippe Palanque, Julio Abascal, and Simone Diniz Junqueira Barbosa (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 439--451.",
      "doi": ""
    },
    {
      "text": "Jan Chong and Rosanne Siino. 2006. Interruptions on Software Teams: A Comparison of Paired and Solo Programmers. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06). ACM, NY, NY, USA, 29--38. DOI: http://dx.doi.org/10.1145/1180875.1180882",
      "doi": "10.1145/1180875.1180882"
    },
    {
      "text": "Francesco Cirillo. 2006. The pomodoro technique (the pomodoro). Agile Processes in Software Engineering and 54, 2 (2006).",
      "doi": ""
    },
    {
      "text": "Russell Cropanzano and Thomas A Wright. 2001. When a \"happy\" worker is really a \"productive\" worker: A review and further refinement of the happy-productive worker thesis. Consulting Psychology Journal: Practice and Research 53, 3 (2001), 182--199. DOI: http://dx.doi.org/10.1037/1061--4087.53.3.182",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1997. Finding Flow: The psychology of engagement with everyday life. Basic Books.",
      "doi": ""
    },
    {
      "text": "Edward B. Cutrell, Mary Czerwinski, and Eric Horvitz. 2000. Effects of Instant Messaging Interruptions on Computing Tasks. In CHI '00 Extended Abstracts on Human Factors in Computing Systems (CHI EA '00). ACM, NY, NY, USA, 99--100. DOI: http://dx.doi.org/10.1145/633292.633351",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A Diary Study of Task Switching and Interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 175--182. DOI: http://dx.doi.org/10.1145/985692.985715",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Awwad J. Dababneh, Naomi Swanson, and Richard L. Shell. 2001. Impact of added rest breaks on the productivity and well being of workers. Ergonomics 44, 2 (2001), 164--174. DOI: http://dx.doi.org/10.1080/00140130121538",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Gloria Mark, and Víctor M. González. 2011. Why Do i Keep Interrupting Myself? Environment, Habit and Self-Interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). Association for Computing Machinery, New York, NY, USA, 3127--3130. DOI: http://dx.doi.org/10.1145/1978942.1979405",
      "doi": ""
    },
    {
      "text": "Giuseppe Destefanis, Marco Ortu, Steve Counsell, Stephen Swift, Michele Marchesi, and Roberto Tonelli. 2016. Software development: do good manners matter? PeerJ Computer Science 2 (July 2016), e73. DOI: http://dx.doi.org/10.7717/peerj-cs.73",
      "doi": ""
    },
    {
      "text": "Belinda H.W. Eijckelhof, Maaike A. Huysmans, Birgitte M. Blatter, Priscilla C. Leider, Peter W. Johnson, and Jaap H. van Die}. 2014. Office workers' computer use patterns are associated with workplace stressors. Applied Ergonomics 45, 6 (2014), 1660--1667. DOI: http://dx.doi.org/10.1016/j.apergo.2014.05.013",
      "doi": ""
    },
    {
      "text": "Paul Ekman, E Richard Sorenson, and Wallace V Friesen. 1969. Pan-cultural elements in facial displays of emotion. Science 164, 3875 (1969), 86--88. DOI: http://dx.doi.org/10.1126/science.164.3875.86",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Daniel Avrahami, and Jacob T. Biehl. 2016. Taking 5: Work-Breaks, Productivity, and Opportunities for Personal Informatics for Knowledge Workers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 673--684. DOI: http://dx.doi.org/10.1145/2858036.2858066",
      "doi": "10.1145/2858036.2858066"
    },
    {
      "text": "James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 119--146. DOI: http://dx.doi.org/10.1145/1057237.1057243",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "Pamela S Galluch, Varun Grover, and Jason Bennett Thatcher. 2015. Interrupting the workplace: Examining stressors in an information technology context. Journal of the Association for Information Systems 16, 1 (2015), 1. DOI: http://dx.doi.org/10.17705/1jais.00387",
      "doi": ""
    },
    {
      "text": "Malcolm Gladwell. 2002. The naked face. The New Yorker 5 (2002), 38--49.",
      "doi": ""
    },
    {
      "text": "Victor M. González and Gloria Mark. 2004. \"Constant, Constant, Multi-Tasking Craziness\": Managing Multiple Working Spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). Association for Computing Machinery, New York, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/985692.985707",
      "doi": ""
    },
    {
      "text": "Nanna Gorm and Irina Shklovski. 2016. Sharing Steps in the Workplace: Changing Privacy Concerns Over Time. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 4315--4319. DOI: http://dx.doi.org/10.1145/2858036.2858352",
      "doi": "10.1145/2858036.2858352"
    },
    {
      "text": "Daniel Graziotin, Fabian Fagerholm, Xiaofeng Wang, and Pekka Abrahamsson. 2017. On the Unhappiness of Software Developers. In Proceedings of the 21st International Conference on Evaluation and Assessment in Software Engineering (EASE'17). Association for Computing Machinery, New York, NY, USA, 324--333. DOI: http://dx.doi.org/10.1145/3084226.3084242",
      "doi": "10.1145/3084226.3084242"
    },
    {
      "text": "Daniel Graziotin, Xiaofeng Wang, and Pekka Abrahamsson. 2014. Happy software developers solve problems better: psychological measurements in empirical software engineering. PeerJ 2 (2014), e289. DOI: http://dx.doi.org/10.7717/peerj.289",
      "doi": ""
    },
    {
      "text": "James J Gross. 1998. The emerging field of emotion regulation: An integrative review. Review of general psychology 2, 3 (1998), 271--299. DOI: http://dx.doi.org/10.1037/1089--2680.2.3.271",
      "doi": ""
    },
    {
      "text": "Barry Gruenberg. 1980. The happy worker: An analysis of educational and occupational differences in determinants of job satisfaction. American journal of sociology 86, 2 (1980), 247--271. DOI: http://dx.doi.org/10.1086/227238",
      "doi": ""
    },
    {
      "text": "Fangfang Guo, Yu Li, Mohan S. Kankanhalli, and Michael S. Brown. 2013. An Evaluation of Wearable Activity Monitoring Devices. In Proceedings of the 1st ACM International Workshop on Personal Data Meets Distributed Multimedia (PDM '13). Association for Computing Machinery, New York, NY, USA, 31--34. DOI: http://dx.doi.org/10.1145/2509352.2512882",
      "doi": ""
    },
    {
      "text": "Eija Haapalainen, SeungJun Kim, Jodi F. Forlizzi, and Anind K. Dey. 2010. Psycho-Physiological Measures for Assessing Cognitive Load. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (UbiComp '10). Association for Computing Machinery, New York, NY, USA, 301--310. DOI: http://dx.doi.org/10.1145/1864349.1864395",
      "doi": ""
    },
    {
      "text": "F. Maxwell Harper, Funing Xu, Harmanpreet Kaur, Kyle Condiff, Shuo Chang, and Loren Terveen. 2015. Putting Users in Control of Their Recommendations. In Proceedings of the 9th ACM Conference on Recommender Systems (RecSys '15). Association for Computing Machinery, New York, NY, USA, 3--10. DOI: http://dx.doi.org/10.1145/2792838.2800179",
      "doi": "10.1145/2792838.2800179"
    },
    {
      "text": "Jennifer Healey, Rosalind W Picard, and others. 2005. Detecting stress during real-world driving tasks using physiological sensors. IEEE Transactions on intelligent transportation systems 6, 2 (2005), 156--166. DOI: http://dx.doi.org/10.1109/tits.2005.848368",
      "doi": "10.1109/TITS.2005.848368"
    },
    {
      "text": "Robert A Henning, Pierre Jacques, George V Kissel, Anne B Sullivan, and Sabina M Alteras-Webb. 1997. Frequent short rest breaks from computer work: effects on productivity and well-being at two field sites. Ergonomics 40, 1 (1997), 78--91. DOI: http://dx.doi.org/10.1080/001401397188396",
      "doi": ""
    },
    {
      "text": "Nis Hjortskov, Dag Rissén, Anne Katrine Blangsted, Nils Fallentin, Ulf Lundberg, and Karen Søgaard. 2004. The effect of mental stress on heart rate variability and blood pressure during computer work. European Journal of Applied Physiology 92, 1 (01 Jun 2004), 84--89. DOI: http://dx.doi.org/10.1007/s00421-004--1055-z",
      "doi": ""
    },
    {
      "text": "Eric Horvitz, Paul Koch, and Johnson Apacible. 2004. BusyBody: Creating and Fielding Personalized Models of the Cost of Interruption. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 507--510. DOI: http://dx.doi.org/10.1145/1031607.1031690",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "James M. Hudson, Jim Christensen, Wendy A. Kellogg, and Thomas Erickson. 2002. \"I'd Be Overwhelmed, but It's Just One More Thing to Do\": Availability and Interruption in Research Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, NY, NY, USA, 97--104. DOI: http://dx.doi.org/10.1145/503376.503394",
      "doi": "10.1145/503376.503394"
    },
    {
      "text": "Christophe Hurter, Benjamin R. Cowan, Audrey Girouard, and Nathalie Henry Riche. 2012. Active Progress Bar: Aiding the Switch to Temporary Activities. In Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers (BCS-HCI '12). BCS Learning Development Ltd., Swindon, GBR, 99--108.",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal, Piotr D. Adamczyk, Xianjun Sam Zheng, and Brian P. Bailey. 2005. Towards an Index of Opportunity: Understanding Changes in Mental Workload during Task Execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). Association for Computing Machinery, New York, NY, USA, 311--320. DOI: http://dx.doi.org/10.1145/1054972.1055016",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2011. Oasis: A Framework for Linking Notification Delivery to the Perceptual Structure of Goal-Directed Tasks. ACM Trans. Comput.-Hum. Interact. 17, 4, Article Article 15 (Dec. 2011), 28 pages. DOI: http://dx.doi.org/10.1145/1879831.1879833",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and Recovery of Computing Tasks: Field Study, Analysis, and Directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). Association for Computing Machinery, New York, NY, USA, 677--686. DOI: http://dx.doi.org/10.1145/1240624.1240730",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and Awareness: A Field Study of Alert Usage and Preferences. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). Association for Computing Machinery, New York, NY, USA, 27--30. DOI: http://dx.doi.org/10.1145/1718918.1718926",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal, Xianjun Sam Zheng, and Brian P. Bailey. 2004. Task-Evoked Pupillary Response to Mental Workload in Human-Computer Interaction. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). Association for Computing Machinery, New York, NY, USA, 1477--1480. DOI: http://dx.doi.org/10.1145/985921.986094",
      "doi": "10.1145/985921.986094"
    },
    {
      "text": "Youxuan Jiang, Jonathan K. Kummerfeld, and Walter S. Lasecki. 2017. Understanding Task Design Trade-offs in Crowdsourced Paraphrase Collection. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers). 103--109.",
      "doi": ""
    },
    {
      "text": "Jing Jin and Laura A. Dabbish. 2009. Self-interruption on the Computer: A Typology of Discretionary Task Interleaving. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1799--1808. DOI: http://dx.doi.org/10.1145/1518701.1518979",
      "doi": ""
    },
    {
      "text": "Pamela Karr-Wisniewski and Ying Lu. 2010. When more is too much: Operationalizing technology overload and exploring its impact on knowledge worker productivity. Computers in Human Behavior 26, 5 (2010), 1061--1072. DOI: http://dx.doi.org/10.1016/j.chb.2010.03.008",
      "doi": "10.1016/j.chb.2010.03.008"
    },
    {
      "text": "Ioanna Katidioti, Jelmer P. Borst, Douwe J. Bierens de Haan, Tamara Pepping, Marieke K. van Vugt, and Niels A. Taatgen. 2016. Interrupted by Your Pupil: An Interruption Management System Based on Pupil Dilation. International Journal of Human-Computer Interaction 32, 10 (2016), 791--801. DOI: http://dx.doi.org/10.1080/10447318.2016.1198525",
      "doi": ""
    },
    {
      "text": "Jana Kühnel, Hannes Zacher, Jessica De Bloom, and Ronald Bledow. 2017. Take a break! Benefits of sleep and short breaks for daily work engagement. European Journal of Work and Organizational Psychology 26, 4 (2017), 481--491. DOI: http://dx.doi.org/10.1080/1359432X.2016.1269750",
      "doi": ""
    },
    {
      "text": "Craig R Littler. 1978. Understanding taylorism. British Journal of Sociology (1978), 185--202.",
      "doi": ""
    },
    {
      "text": "Yuhan Luo, Bongshin Lee, Donghee Yvette Wohn, Amanda L. Rebar, David E. Conroy, and Eun Kyoung Choe. 2018. Time for Break: Understanding Information Workers' Sedentary Behavior Through a Break Prompting System. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 127, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173701",
      "doi": "10.1145/3173574.3173701"
    },
    {
      "text": "Mika Mäntylä, Bram Adams, Giuseppe Destefanis, Daniel Graziotin, and Marco Ortu. 2016. Mining Valence, Arousal, and Dominance: Possibilities for Detecting Burnout and Productivity?. In Proceedings of the 13th International Conference on Mining Software Repositories (MSR '16). Association for Computing Machinery, New York, NY, USA, 247--258. DOI: http://dx.doi.org/10.1145/2901739.2901752",
      "doi": "10.1145/2901739.2901752"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The Cost of Interrupted Work: More Speed and Stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 107--110. DOI: http://dx.doi.org/10.1145/1357054.1357072",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, Aroused, but So Distractible: Temporal Perspectives on Multitasking and Communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 903--916. DOI: http://dx.doi.org/10.1145/2675133.2675221",
      "doi": "10.1145/2675133.2675221"
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored Mondays and Focused Afternoons: The Rhythm of Attention and Online Activity in the Workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). Association for Computing Machinery, New York, NY, USA, 3025--3034. DOI: http://dx.doi.org/10.1145/2556288.2557204",
      "doi": "10.1145/2556288.2557204"
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, Paul Johns, and Akane Sano. 2016. Neurotics Can't Focus: An in Situ Study of Online Multitasking in the Workplace. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1739--1744. DOI: http://dx.doi.org/10.1145/2858036.2858202",
      "doi": "10.1145/2858036.2858202"
    },
    {
      "text": "Daniel McDuff, Sarah Gontarek, and Rosalind W Picard. 2014. Improvements in remote cardiopulmonary measurement using a five band digital camera. IEEE Transactions on Biomedical Engineering 61, 10 (2014), 2593--2601. DOI: http://dx.doi.org/10.1109/tbme.2014.2323695",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Kael Rowan, Piali Choudhury, Jessica Wolk, ThuVan Pham, and Mary Czerwinski. 2019. A Multimodal Emotion Sensing Platform for Building Emotion-Aware Applications. arXiv preprint arXiv:1903.12133 (2019).",
      "doi": ""
    },
    {
      "text": "Daniel McFarlane and Kara Latorella. 2002. The Scope and Importance of Human Interruption in Human-Computer Interaction Design. Human-computer Interaction 17 (03 2002), 1--61. DOI: http://dx.doi.org/10.1207/S15327051HCI1701_1",
      "doi": ""
    },
    {
      "text": "Wesley P. McTernan, Maureen F. Dollard, and Anthony D. LaMontagne. 2013. Depression in the workplace: An economic cost analysis of depression-related productivity loss attributable to job strain and bullying. Work & Stress 27, 4 (2013), 321--338. DOI: http://dx.doi.org/10.1080/02678373.2013.846948",
      "doi": ""
    },
    {
      "text": "Brid O'Conaill and David Frohlich. 1995. Timespace in the Workplace: Dealing with Interruptions. In Conference Companion on Human Factors in Computing Systems (CHI '95). ACM, NY, NY, USA, 262--263. DOI: http://dx.doi.org/10.1145/223355.223665",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Marco Ortu, Bram Adams, Giuseppe Destefanis, Parastou Tourani, Michele Marchesi, and Roberto Tonelli. 2015. Are Bullies More Productive? Empirical Study of Affectiveness vs. Issue Fixing Time. In Proceedings of the 12th Working Conference on Mining Software Repositories (MSR '15). IEEE Press, 303--313.",
      "doi": ""
    },
    {
      "text": "Leslie A Perlow. 1999. The time famine: Toward a sociology of work time. Administrative science quarterly 44, 1 (1999).",
      "doi": ""
    },
    {
      "text": "June J. Pilcher, Douglas R. Ginter, and Brigitte Sadowsky. 1997. Sleep quality versus sleep quantity: Relationships between sleep and measures of health, well-being and sleepiness in college students. Journal of Psychosomatic Research 42, 6 (1997), 583--596. DOI: http://dx.doi.org/10.1016/S0022--3999(97)00004--4",
      "doi": ""
    },
    {
      "text": "Ming-Zher Poh, Daniel J McDuff, and Rosalind W Picard. 2011. Advancements in noncontact, multiparameter physiological measurements using a webcam. IEEE transactions on biomedical engineering 58, 1 (2011), 7--11. DOI: http://dx.doi.org/10.1109/tbme.2010.2086456",
      "doi": ""
    },
    {
      "text": "Michael I Posner, Mary Jo Nissen, and William C Ogden. 1978. Attended and unattended processing modes: The role of set for spatial location. Modes of perceiving and processing information 137, 158 (1978), 2.",
      "doi": ""
    },
    {
      "text": "Peter Richter, Thomas Wagner, Ralf Heger, and Gunther Weise. 1998. Psychophysiological analysis of mental load during driving on rural roads-a quasi-experimental field study. Ergonomics 41, 5 (1998), 593--609. DOI: http://dx.doi.org/10.1080/001401398186775",
      "doi": ""
    },
    {
      "text": "Joshua S. Rubinstein, David Meyer, and Jeffrey E. Evans. 2001. Executive Control of Cognitive Processes in Task Switching. 27 (Sept 2001), 763--97. DOI: http://dx.doi.org/10.1037/0096--1523.27.4.763",
      "doi": ""
    },
    {
      "text": "Greg Smith, Patrick Baudisch, George Robertson, Mary Czerwinski, Brian Meyers, Daniel Robbins, and Donna Andrews. 2003. GroupBar: The TaskBar Evolved. In Proceedings of OZCHI 2003. 34--43.",
      "doi": ""
    },
    {
      "text": "Barry M Staw. 1986. Organizational psychology and the pursuit of the happy/productive worker. California Management Review 28, 4 (1986), 40--53.",
      "doi": ""
    },
    {
      "text": "Kenneth T Strongman and Christopher DB Burt. 2000. Taking breaks from work: An exploratory inquiry. The Journal of psychology 134, 3 (2000), 229--242. DOI: http://dx.doi.org/10.1080/00223980009600864",
      "doi": ""
    },
    {
      "text": "Toon W. Taris and Paul J.G. Schreurs. 2009. Well-being and organizational performance: An organizational-level test of the happy-productive worker hypothesis. Work & Stress 23, 2 (2009), 120--136. DOI: http://dx.doi.org/10.1080/02678370903072555",
      "doi": ""
    },
    {
      "text": "Vincent W.-S. Tseng, Matthew L. Lee, Laurent Denoue, and Daniel Avrahami. 2019. Overcoming Distractions During Transitions from Break to Work Using a Conversational Website-Blocking System. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 467, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300697",
      "doi": "10.1145/3290605.3300697"
    },
    {
      "text": "Antoine U Viola, Lynette M James, Luc JM Schlangen, and Derk-Jan Dijk. 2008. Blue-enriched white light in the workplace improves self-reported alertness, performance and sleep quality. Scandinavian journal of work, environment & health (2008), 297--306.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of personality and social psychology 54, 6 (1988), 1063.",
      "doi": ""
    },
    {
      "text": "Christopher D. Wickens. 2008. Multiple Resources and Mental Workload. Human Factors 50, 3 (2008), 449--455. DOI: http://dx.doi.org/10.1518/001872008X288394",
      "doi": ""
    },
    {
      "text": "Alex C. Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T. Iqbal, and Jaime Teevan. 2018. Supporting Workplace Detachment and Reattachment with Conversational Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 88, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173662",
      "doi": "10.1145/3173574.3173662"
    },
    {
      "text": "Thomas A Wright and Russell Cropanzano. 1997. Well-being, Satisfaction and Job Performance: Another Look at the Happy/Productive Worker Thesis. In Academy of Management Proceedings, Vol. 1997. Academy of Management Briarcliff Manor, NY 10510, 364--368. DOI: http://dx.doi.org/10.5465/ambpp.1997.4988986",
      "doi": ""
    },
    {
      "text": "Thomas A Wright and Barry M Staw. 1999. Affect and favorable work outcomes: two longitudinal tests of the happy--productive worker thesis. Journal of Organizational Behavior: The International Journal of Industrial, Occupational and Organizational Psychology and Behavior 20, 1 (1999), 1--23. DOI: http://dx.doi.org/10.1002/(SICI)1099--1379(199901)20: 11::AID-JOB8853.0.CO;2-W",
      "doi": ""
    },
    {
      "text": "Biqiao Zhang and Emily Mower Provost. 2019. Automatic recognition of self-reported and perceived emotions. In Multimodal Behavior Analysis in the Wild. Elsevier, 443--470. DOI: http://dx.doi.org/10.1016/B978-0--12--814601--9.00027--4",
      "doi": ""
    },
    {
      "text": "Manuela Züger, Sebastian C. Müller, André N. Meyer, and Thomas Fritz. 2018. Sensing Interruptibility in the Office: A Field Study on the Use of Biometric and Computer Interaction Sensors. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 591, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3174165",
      "doi": "10.1145/3173574.3174165"
    }
  ]
}