{
  "doi": "10.1145/3313831.3376154",
  "title": "TalkingBoogie: Collaborative Mobile AAC System for Non-verbal Children with Developmental Disabilities and Their Caregivers",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Augmentative and alternative communication (AAC) technologies are widely used to help non-verbal children enable communication. For AAC-aided communication to be successful, caregivers should support children with consistent intervention strategies in various settings. As such, caregivers need to continuously observe and discuss children's AAC usage to create a shared understanding of these strategies. However, caregivers often find it challenging to effectively collaborate with one another due to a lack of family involvement and the unstructured process of collaboration. To address these issues, we present TalkingBoogie, which consists of two mobile apps: TalkingBoogie-AAC for caregiver-child communication, and TalkingBoogie-coach supporting caregiver collaboration. Working together, these applications provide contextualized layouts for symbol arrangement, scaffold the process of sharing and discussing observations, and induce caregivers' balanced participation. A two-week deployment study with four groups (N=11) found that TalkingBoogie helped increase mutual understanding of strategies and encourage balanced participation between caregivers with reduced cognitive loads.",
  "authors": [
    {
      "name": "Donghoon Shin",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/do/10.1145/contrib-99659528693/rel-imgonly/donghoon_acm.jpg",
      "acmid": "99659528693",
      "orcid": "0000-0001-9689-7841"
    },
    {
      "name": "Jaeyoon Song",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366362",
      "orcid": "missing"
    },
    {
      "name": "Seokwoo Song",
      "institution": "Samsung Research, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158785657",
      "orcid": "missing"
    },
    {
      "name": "Jisoo Park",
      "institution": "SK Broadband, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528378",
      "orcid": "missing"
    },
    {
      "name": "Joonhwan Lee",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502746040",
      "orcid": "0000-0002-3115-4024"
    },
    {
      "name": "Soojin Jun",
      "institution": "Yonsei University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658978020",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Erna Alant, Annette Champion, and Erin Colone Peabody. 2013. Exploring Interagency Collaboration in AAC Intervention. Communication Disorders Quarterly 34, 3 (2013), 172--183. DOI: http://dx.doi.org/10.1177/1525740112455432",
      "doi": ""
    },
    {
      "text": "Meryl Alper. 2017. Giving Voice: Mobile Communication, Disability, and Inequality. MIT Press.",
      "doi": ""
    },
    {
      "text": "UW Augcomm. 2004. Rate Enhancement. (2004). http://depts.washington.edu/augcomm/02_features/04d_ rateenhance.htm",
      "doi": ""
    },
    {
      "text": "Rita L. Bailey, Julie B. Stoner, Howard P. Parette, and Maureen E. Angell. 2006. AAC Team Perceptions: Augmentative and Alternative Communication Device Use. Education and Training in Developmental Disabilities 41, 2 (2006), 139--154. http://www.jstor.org/stable/23880176",
      "doi": ""
    },
    {
      "text": "Andrew R. Beigel. 2000. Assistive Technology Assessment: More Than the Device. Intervention in School and Clinic 35, 4 (2000), 237--243. DOI: http://dx.doi.org/10.1177/105345120003500407",
      "doi": ""
    },
    {
      "text": "David Beukelman, Jackie McGinnis, and Deanna Morrow. 1991. Vocabulary selection in augmentative and alternative communication. Augmentative and Alternative Communication 7, 3 (1991), 171--185. DOI: http://dx.doi.org/10.1080/07434619112331275883",
      "doi": ""
    },
    {
      "text": "David Beukelman and Pat Mirenda. 2013. Augmentative and Alternative Communication: Supporting Children and Adults with Complex Communication Needs. Paul H. Brookes Pub.",
      "doi": ""
    },
    {
      "text": "Cathy Binger and Janice Light. 2008. The Morphology and Syntax of Individuals who use AAC: Research Review and Implications for Effective Practice. Augmentative and Alternative Communication 24, 2 (2008), 123--138. DOI: http://dx.doi.org/10.1080/07434610701830587",
      "doi": ""
    },
    {
      "text": "Rolf Black, Annalu Waller, Nava Tintarev, Ehud Reiter, and Joseph Reddington. 2011. A Mobile Phone Based Personal Narrative System. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '11). Association for Computing Machinery, New York, NY, USA, 171--178. DOI: http://dx.doi.org/10.1145/2049536.2049568",
      "doi": "10.1145/2049536.2049568"
    },
    {
      "text": "Nancy C. Brady, Susan Bruce, Amy Goldman, Karen Erickson, Beth Mineo, Bill T. Ogletree, Diane Paul, Mary Ann Romski, Rose Sevcik, Ellin Siegel, Judith Schoonover, Marti Snell, Lorraine Sylvester, and Krista Wilkinson. 2016. Communication Services and Supports for Individuals With Severe Disabilities: Guidance for Assessment and Intervention. American Journal on Intellectual and Developmental Disabilities 121, 2 (2016), 121--138. DOI: http://dx.doi.org/10.1352/1944--7558--121.2.121",
      "doi": ""
    },
    {
      "text": "Aimee Dietz, Wendy Quach, Shelley K. Lund, and Miechelle McKelvey. 2012. AAC Assessment and Clinical-Decision Making: The Impact of Experience. Augmentative and Alternative Communication 28, 3 (2012), 148--159. DOI: http://dx.doi.org/10.3109/07434618.2012.704521",
      "doi": ""
    },
    {
      "text": "Marilyn Espe-Sherwindt. 2008. Family-centred practice: collaboration, competency and evidence. Support for Learning 23, 3 (2008), 136--143. DOI: http://dx.doi.org/10.1111/j.1467--9604.2008.00384.x",
      "doi": ""
    },
    {
      "text": "Alexander Fiannaca, Ann Paradiso, Mira Shah, and Meredith Ringel Morris. 2017. AACrobat: Using Mobile Devices to Lower Communication Barriers and Provide Autonomy with Gaze-Based AAC. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). Association for Computing Machinery, New York, NY, USA, 683--695. DOI: http://dx.doi.org/10.1145/2998181.2998215",
      "doi": "10.1145/2998181.2998215"
    },
    {
      "text": "Lise Fox, Glen Dunlap, and Lisa Cushing. 2002. Early Intervention, Positive Behavior Support, and Transition to School. Journal of Emotional and Behavioral Disorders 10, 3 (2002), 149--157. DOI: http://dx.doi.org/10.1177/10634266020100030301",
      "doi": ""
    },
    {
      "text": "Melanie Fried-Oken, Lynn Fox, Marie T. Rau, Jill Tullman, Glory Baker, Mary Hindal, Nancy Wile, and Jau-Shin Lou. 2006. Purposes of AAC device use for persons with ALS as reported by caregivers. Augmentative and Alternative Communication 22, 3 (2006), 209--221. DOI: http://dx.doi.org/10.1080/07434610600650276",
      "doi": ""
    },
    {
      "text": "J. K. Gona, C. R. Newton, S. Hartley, and K. Bunning. 2014. A home-based intervention using augmentative and alternative communication (AAC) techniques in rural Kenya: what are the caregivers' experiences? Child: Care, Health and Development 40, 1 (2014), 29--41. DOI: http://dx.doi.org/10.1111/cch.12031",
      "doi": ""
    },
    {
      "text": "Seray B. Ibrahim, Asimina Vasalou, and Michael Clarke. 2018. Design Opportunities for AAC and Children with Severe Speech and Physical Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 227, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173801",
      "doi": "10.1145/3173574.3173801"
    },
    {
      "text": "Kyung Hea Jeon, Seok Jeong Yeon, Young Tae Kim, Seokwoo Song, and John Kim. 2014. Robot-Based Augmentative and Alternative Communication for Nonverbal Children with Communication Disorders. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). Association for Computing Machinery, New York, NY, USA, 853--859. DOI: http://dx.doi.org/10.1145/2632048.2636078",
      "doi": "10.1145/2632048.2636078"
    },
    {
      "text": "Julie A. Kientz, Rosa I. Arriaga, Marshini Chetty, Gillian R. Hayes, Jahmeilah Richardson, Shwetak N. Patel, and Gregory D. Abowd. 2007. Grow and Know: Understanding Record-Keeping Needs for Tracking the Development of Young Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). Association for Computing Machinery, New York, NY, USA, 1351--1360. DOI: http://dx.doi.org/10.1145/1240624.1240830",
      "doi": ""
    },
    {
      "text": "Cliff Kushler. 1998. AAC: Using a Reduced Keyboard. (1998).",
      "doi": ""
    },
    {
      "text": "Janice Light. 1989. Toward a definition of communicative competence for individuals using augmentative and alternative communication systems. Augmentative and Alternative Communication 5, 2 (1989), 137--144. DOI: http://dx.doi.org/10.1080/07434618912331275126",
      "doi": ""
    },
    {
      "text": "Janice Light, David Beukelman, and Joe Reichle. 2003. Communicative Competence for Individuals who Use AAC: From Research to Effective Practice. Brookes Publishing Company.",
      "doi": ""
    },
    {
      "text": "Janice Light and Kathryn Drager. 2007. AAC technologies for young children with complex communication needs: State of the science and future research directions. Augmentative and Alternative Communication 23, 3 (2007), 204--216. DOI: http://dx.doi.org/10.1080/07434610701553635",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2012a. The Changing Face of Augmentative and Alternative Communication: Past, Present, and Future Challenges. Augmentative and Alternative Communication 28, 4 (2012), 197--204. DOI: http://dx.doi.org/10.3109/07434618.2012.737024",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2012b. Supporting the Communication, Language, and Literacy Development of Children with Complex Communication Needs: State of the Science and Future Research Priorities. Assistive Technology 24, 1 (2012), 34--44. DOI: http://dx.doi.org/10.1080/10400435.2011.648717",
      "doi": ""
    },
    {
      "text": "Janice Light and David Mcnaughton. 2015. Designing AAC Research and Intervention to Improve Outcomes for Individuals with Complex Communication Needs. Augmentative and Alternative Communication 31, 2 (2015), 85--96. DOI: http://dx.doi.org/10.3109/07434618.2015.1036458",
      "doi": ""
    },
    {
      "text": "Catherine Lord, Susan Risi, and Andrew Pickles. 2004. Trajectory of Language Development in Autistic Spectrum Disorders. Lawrence Erlbaum Associates Publishers, 7--29. DOI: http://dx.doi.org/10.4324/9781410610881",
      "doi": ""
    },
    {
      "text": "Alan Newell, Stefan Langer, and Marianne Hickey. 1998. The role of natural language processing in alternative and augmentative communication. Natural Language Engineering 4, 1 (1998), 1--16. DOI: http://dx.doi.org/10.1017/S135132499800182X",
      "doi": "10.1017/S135132499800182X"
    },
    {
      "text": "OECD. 2015. How's Life? 2015 Measuring Well-being: Measuring Well-being. OECD Publishing.",
      "doi": ""
    },
    {
      "text": "Howard P. Parette, Mary Blake Huer, and Mary Jane Brotherson. 2001. Related Service Personnel Perceptions of Team AAC Decision-Making Across Cultures. Education and Training in Mental Retardation and Developmental Disabilities 36, 1 (2001), 69--82. http://www.jstor.org/stable/24481615",
      "doi": ""
    },
    {
      "text": "Eun Hye Park, Young Tae Kim, Ki Hyung Hong, Seok Jeong Yeon, Kyung Yang Kim, and Jang Hyun Lim. 2016. Development of Korean Ewha-AAC symbols: Validity of vocabulary and graphic symbols. AAC Research & Practice 4, 2 (2016), 19--40. DOI: http://dx.doi.org/10.14818/aac.2016.12.4.2.19",
      "doi": ""
    },
    {
      "text": "Jisoo Park. 2017. Research of Interaction for Construction of Co-presence Experience in Smart Mobile Device based AAC. Master's thesis. Yonsei University, Seoul, Republic of Korea.",
      "doi": ""
    },
    {
      "text": "Ralf Schlosser and Parimala Raghavendra. 2004. Evidence-Based Practice in Augmentative and Alternative Communication. Augmentative and Alternative Communication 20, 1 (2004), 1--21. DOI: http://dx.doi.org/10.1080/07434610310001621083",
      "doi": ""
    },
    {
      "text": "Seokwoo Song, Juho Kim, Bumsoo Kang, Wonjeong Park, and John Kim. 2018. BebeCODE: Collaborative Child Development Tracking System. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 540, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174114",
      "doi": "10.1145/3173574.3174114"
    },
    {
      "text": "Gloria Soto, Eve Müller, Pam Hunt, and Lori Goetz. 2001. Professional Skills for Serving Students Who Use AAC in General Education Classrooms. Language, Speech, and Hearing Services in Schools 32, 1 (2001), 51--56. DOI: http://dx.doi.org/10.1044/0161--1461(2001/005)",
      "doi": ""
    },
    {
      "text": "Amy Starble, Tiffany Hutchins, Mary Alice Favro, Patricia Prelock, and Brooke Bitner. 2005. Family-Centered Intervention and Satisfaction With AAC Device Training. Communication Disorders Quarterly 27, 1 (2005), 47--54. DOI: http://dx.doi.org/10.1177/15257401050270010501",
      "doi": ""
    },
    {
      "text": "Julia B. Stoner, Maureen E. Angell, and Rita L. Bailey. 2010. Implementing Augmentative and Alternative Communication in Inclusive Educational Settings: A Case Study. Augmentative and Alternative Communication 26, 2 (2010), 122--135. DOI: http://dx.doi.org/10.3109/07434618.2010.481092",
      "doi": ""
    },
    {
      "text": "Keith Trnka, John McCaw, Debra Yarrington, Kathleen F. McCoy, and Christopher Pennington. 2008. Word Prediction and Communication Rate in AAC. In Proceedings of the IASTED International Conference on Telehealth/Assistive Technologies (Telehealth/AT '08). ACTA Press, USA, 19--24. DOI: http://dx.doi.org/10.5555/1722763.1722768",
      "doi": "10.5555/1722763.1722768"
    },
    {
      "text": "Gyula Vörös, Peter Rabi, Balázs Pintér, András Sárkány, Daniel Sonntag, and A. Lorincz. 2014. Recommending Missing Symbols of Augmentative and Alternative Communication by Means of Explicit Semantic Analysis. https://www.aaai.org/ocs/index.php/FSS/ FSS14/paper/view/9137",
      "doi": ""
    },
    {
      "text": "Karl Wiegand and Rupal Patel. 2014. DigitCHAT: Enabling AAC Input at Conversational Speed. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). Association for Computing Machinery, New York, NY, USA, 343--344. DOI: http://dx.doi.org/10.1145/2661334.2661422",
      "doi": "10.1145/2661334.2661422"
    }
  ]
}