{
  "doi": "10.1145/3313831.3376374",
  "title": "WeDA: Designing and Evaluating A Scale-driven Wearable Diagnostic Assessment System for Children with ADHD",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is one of the most common mental disorders affecting children. Because the etiology of ADHD is complex and its symptoms are not specific, there is a lack of feasible quantitative diagnostic methods. Pursuing objective and non-invasive detection methods and standards is of great practical significance to prevent the development of the disease. In this study, we aim to address one specific concern about the objectivity and quantification of ADHD diagnosis. Over a year, we iteratively designed and tested WeDA, a scale-driven wearable diagnostic assessment system. This system contains an Android computer machine with a large touchscreen, a suite of 3D printed interactive devices, and six wearable motion sensors. We implement ten diagnostic tasks drawing on the symptoms of ADHD based on DSM-5. The experimental results of classifying children with ADHD and typically developing children and subjective evaluations from doctors, parents, and children validate the effectiveness and acceptability of WeDA.",
  "tags": [
    "diagnostic assessment",
    "scale-driven",
    "wearable computing",
    "attention deficit hyperactivity disorder (adhd)",
    "neurodevelopmental disorder"
  ],
  "authors": [
    {
      "name": "Xinlong Jiang",
      "institution": "Institute of Computing Technology, CAS & Beijing Key Laboratory of Mobile Computing and Pervasive Device, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658636175",
      "orcid": "missing"
    },
    {
      "name": "Yiqiang Chen",
      "institution": "Institute of Computing Technology, CAS & Beijing Key Laboratory of Mobile Computing and Pervasive Device, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474685631",
      "orcid": "missing"
    },
    {
      "name": "Wuliang Huang",
      "institution": "Institute of Computing Technology, CAS & Beijing Key Laboratory of Mobile Computing and Pervasive Device, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527981",
      "orcid": "missing"
    },
    {
      "name": "Teng Zhang",
      "institution": "Institute of Computing Technology, CAS & Beijing Key Laboratory of Mobile Computing and Pervasive Device, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528943",
      "orcid": "missing"
    },
    {
      "name": "Chenlong Gao",
      "institution": "Institute of Computing Technology, CAS & Beijing Key Laboratory of Mobile Computing and Pervasive Device, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529052",
      "orcid": "missing"
    },
    {
      "name": "Yunbing Xing",
      "institution": "Institute of Computing Technology, CAS & Beijing Key Laboratory of Mobile Computing and Pervasive Device, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529463",
      "orcid": "missing"
    },
    {
      "name": "Yi Zheng",
      "institution": "Beijing Anding Hospital Capital Medical University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527878",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Howard B. Abikoff, Peter S. Jensen, L.L. Eugene Arnold, Betsy Hoza, Lily Hechtman, Simcha Pollack, Diane Martin, Jose Alvir, John S. March, Stephen Hinshaw, and others. 2002. Observed classroom behavior of children with ADHD: Relationship to gender and comorbidity. Journal of abnormal child psychology 30, 4 (2002), 349--359.",
      "doi": ""
    },
    {
      "text": "Thomas M Achenbach, Leslie A Rescorla, and ME Maruish. 2004. The Achenbach system of empirically based assessment (ASEBA) for ages 1.5 to 18 years. The use of psychological testing for treatment planning and outcomes assessment 2 (2004), 179--213.",
      "doi": ""
    },
    {
      "text": "Alaa Eddin Alchalabi, Mohamed Elsharnouby, Shervin Shirmohammadi, and Amer Nour Eddin. 2017. Feasibility of detecting ADHD patients' attention levels by classifying their EEG signals. In 2017 IEEE International Symposium on Medical Measurements and Applications (MeMeA). IEEE, 314--319.",
      "doi": "10.1109/MeMeA.2017.7985895"
    },
    {
      "text": "Alaa Eddin Alchalabi, Shervin Shirmohammadi, Amer Nour Eddin, and Mohamed Elsharnouby. 2018. Focus: Detecting adhd patients by an eeg-based serious game. IEEE Transactions on Instrumentation and Measurement 67, 7 (2018), 1512--1520.",
      "doi": ""
    },
    {
      "text": "R Matt Alderson, Mark D. Rapport, Dustin E Sarver, and Michael J. Kofler. 2008. ADHD and behavioral inhibition: a re-examination of the stop-signal task. Journal of abnormal child psychology 36, 7 (2008), 989--998.",
      "doi": ""
    },
    {
      "text": "Daniel G. Amen and Blake D. Carmichael. 1997. High-resolution brain SPECT imaging in ADHD. Annals of Clinical Psychiatry 9, 2 (1997), 81--86.",
      "doi": ""
    },
    {
      "text": "James A. Arnett and Seth S. Labovitz. 1995. Effect of physical layout in performance of the Trail Making Test. Psychological Assessment 7, 2 (1995), 220.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association and others. 2013. Diagnostic and statistical manual of mental disorders (DSM-5®). American Psychiatric Pub.",
      "doi": ""
    },
    {
      "text": "Russell A Barkley. 1998. Attention-deficit hyperactivity disorder. Scientific American 279, 3 (1998), 66--71.",
      "doi": ""
    },
    {
      "text": "Miguel Angel Bautista, Antonio Hernández-Vela, Sergio Escalera, Laura Igual, Oriol Pujol, Josep Moya, Verónica Violant, and María T Anguera. 2015. A gesture recognition system for detecting behavioral patterns of ADHD. IEEE transactions on cybernetics 46, 1 (2015), 136--147.",
      "doi": ""
    },
    {
      "text": "Esta A Berg. 1948. A simple objective technique for measuring flexibility in thinking. The Journal of general psychology 39, 1 (1948), 15--22.",
      "doi": ""
    },
    {
      "text": "Karin C. Brocki, Carin M. Tillman, and Gunilla Bohlin. 2010. CPT performance, motor activity, and continuous relations to ADHD symptom domains: A developmental study. European Journal of Developmental Psychology 7, 2 (2010), 178--197.",
      "doi": ""
    },
    {
      "text": "Regina Bussing, Melanie Fernandez, Michelle Harwood, Wei Hou, Cynthia Wilson Garvan, Sheila M. Eyberg, and James M. Swanson. 2008. Parent and teacher SNAP-IV ratings of attention deficit hyperactivity disorder symptoms: psychometric properties and normative ratings from a school district sample. Assessment 15, 3 (2008), 317--328.",
      "doi": ""
    },
    {
      "text": "Samuele Cortese, Clare Kelly, Camille Chabernaud, Erika Proal, Adriana Di Martino, Michael P Milham, and F Xavier Castellanos. 2012. Toward systems neuroscience of ADHD: a meta-analysis of 55 fMRI studies. American Journal of Psychiatry 169, 10 (2012), 1038--1055.",
      "doi": ""
    },
    {
      "text": "Naomi O. Davis, Jeffrey Bower, and Scott H Kollins. 2018. Proof-of-concept study of an at-home, engaging, digital intervention for pediatric ADHD. PloS one 13, 1 (2018), e0189749.",
      "doi": ""
    },
    {
      "text": "George J DuPaul and Russell A Barkley. 1992. Situational variability of attention problems: Psychometric properties of the Revised Home and School Situations Questionnaires. Journal of Clinical Child Psychology 21, 2 (1992), 178--188.",
      "doi": ""
    },
    {
      "text": "Jeffery N Epstein, Alaatin Erkanli, C Keith Conners, John Klaric, Jane E Costello, and Adrian Angold. 2003. Relations between continuous performance test performance measures and ADHD behaviors. Journal of abnormal child psychology 31, 5 (2003), 543--554.",
      "doi": ""
    },
    {
      "text": "Anna Marie Farrace-Di Zinno, Graham Douglas, Stephen Houghton, Vivienne Lawrence, John West, and Ken Whiting. 2001. Body movements of boys with attention deficit hyperactivity disorder (ADHD) during computer video game play. British Journal of Educational Technology 32, 5 (2001), 607--618.",
      "doi": ""
    },
    {
      "text": "Jens Forster and Markus Denzler. 2012. Sense Creative! The Impact of Global and Local Vision, Hearing, Touching, Tasting and Smelling on Creative and Analytic Thought. (2012).",
      "doi": ""
    },
    {
      "text": "Carlinha S. Fujiwara, Carlos M Aderaldo, H Raimir Filho, and Diego AA Chaves. 2017. The Internet of Things as a Helping Tool in the Daily Life of Adult Patients with ADHD. In GLOBECOM 2017--2017 IEEE Global Communications Conference. IEEE, 1--6.",
      "doi": "10.1109/GLOCOM.2017.8254442"
    },
    {
      "text": "Hannah Gilbert, Ling Qin, Dandan Li, Xuehua Zhang, and Stuart J Johnstone. 2016. Aiding the diagnosis of AD/HD in childhood: using actigraphy and a continuous performance test to objectively quantify symptoms. Research in developmental disabilities 59 (2016), 35--42.",
      "doi": ""
    },
    {
      "text": "Y Gong and T Cai. 1993. Wechsler intelligence scale for children (Chinese Revised) Changsha. (1993).",
      "doi": ""
    },
    {
      "text": "Jann Goschenhofer, Franz MJ Pfister, Kamer Ali Yuksel, Bernd Bischl, Urban Fietzek, and Janek Thomas. 2019. Wearable-based Parkinson's Disease Severity Monitoring using Deep Learning. arXiv preprint arXiv:1904.10829 (2019).",
      "doi": ""
    },
    {
      "text": "Charles H Goyette, C. Keith Conners, and Richard F. Ulrich. 1978. Normative data on revised Conners parent and teacher rating scales. Journal of abnormal child psychology 6, 2 (1978), 221--236.",
      "doi": ""
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H Witten. 2009. The WEKA data mining software: an update. ACM SIGKDD explorations newsletter 11, 1 (2009), 10--18.",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Elizabeth Hotham, Miranda Haberfield, Susan Hillier, Jason M. White, and Gabrielle Todd. 2018. Upper limb function in children with attention-deficit/hyperactivity disorder (ADHD). Journal of Neural Transmission 125, 4 (2018), 713--726.",
      "doi": ""
    },
    {
      "text": "J. Illes, A. Antle, H. Lou, H Longstaff, V. Rahimzadeh, P.J. McDonald, and H.F.M. der Loos Van. 2019. Involving children with neurodevelopmental disorders in biomedical research. The Lancet. Child & adolescent health 3, 3 (2019), 143--144.",
      "doi": ""
    },
    {
      "text": "Stuart J. Johnstone, Aneta Dimoska, Janette L. Smith, Robert J. Barry, Carly B Pleffer, Dale Chiswick, and Adam R. Clarke. 2007. The development of stop-signal and Go/Nogo response inhibition in children aged 7--12 years: performance and event-related potential indices. International Journal of Psychophysiology 63, 1 (2007), 25--38.",
      "doi": ""
    },
    {
      "text": "Hye Jin Kam, Kiyoung Lee, Sun-Mi Cho, Yun-Mi Shin, and Rae Woong Park. 2011. High-resolution actigraphic analysis of ADHD: A wide range of movement variability observation in three school courses-a pilot study. Healthcare informatics research 17, 1 (2011), 29--37.",
      "doi": ""
    },
    {
      "text": "Steven H. Klee and Barry D. Garfinkel. 1983. The computerized continuous performance task: A new measure of inattention. Journal of abnormal child psychology 11, 4 (1983), 487--495.",
      "doi": ""
    },
    {
      "text": "D. Martín-Martínez, P. Casaseca-De-La-Higuera, S. Alberola-López, J Andrés-de Llano, J.A. López-Villalobos, J. Ardura-Fernández, and C. Alberola-López. 2012. Nonlinear analysis of actigraphic signals for the assessment of the attention-deficit/hyperactivity disorder (ADHD). Medical engineering & physics 34, 9 (2012), 1317--1329.",
      "doi": ""
    },
    {
      "text": "Mario Muñoz-Organero, Lauren Powell, Ben Heller, Val Harpin, and Jack Parker. 2018. Automatic extraction and detection of characteristic movement patterns in children with ADHD based on a convolutional neural network (CNN) and acceleration images. Sensors 18, 11 (2018), 3924.",
      "doi": ""
    },
    {
      "text": "Eduardo Ayala Pérez and Andy Liu Mengxi. 2012. A wearable interface that helps the diagnosis of ADHD behavior based on biofeedback technology. Student Literature (2012).",
      "doi": ""
    },
    {
      "text": "K. Schwartz and P. Verhaeghen. 2008. ADHD and Stroop interference from age 9 to age 41 years: a meta-analysis of developmental effects. Psychological Medicine 38, 11 (2008), 1607--1616.",
      "doi": ""
    },
    {
      "text": "Ariane Sroubek, Mary Kelly, and Xiaobo Li. 2013. Inattentiveness in attention-deficit/hyperactivity disorder. Neuroscience bulletin 29, 1 (2013), 103--110.",
      "doi": ""
    },
    {
      "text": "J. Ridley Stroop. 1935. Studies of interference in serial verbal reactions. Journal of experimental psychology 18, 6 (1935), 643.",
      "doi": ""
    },
    {
      "text": "Barbara L. Trommer, Jo-Ann B. Hoeppner, Rudy Lorber, and Kevin J. Armstrong. 1988. The Go-No-Go paradigm in attention deficit disorder. Annals of neurology 24, 5 (1988), 610--614.",
      "doi": ""
    },
    {
      "text": "Lisa L. Weyandt, John A. Rice, Ian Linterman, Linda Mitzlaff, and Erik Emert. 1998. Neuropsychological performance of a sample of adults with ADHD, developmental reading disorder, and controls. Developmental neuropsychology 14, 4 (1998), 643--656.",
      "doi": ""
    },
    {
      "text": "Steven Paul Woods, David W. Lovejoy, and J.D. Ball. 2002. Neuropsychological characteristics of adults with ADHD: A comprehensive review of initial studies. The Clinical Neuropsychologist 16, 1 (2002), 12--34.",
      "doi": ""
    },
    {
      "text": "Xuehua Zhang. 2012. A quantitative study of hyperactivity/impulse in attention deficit hyperactivity disorder. Master's thesis. Guangxi Medical University.",
      "doi": ""
    }
  ]
}