{
  "doi": "10.1145/3313831.3376576",
  "title": "Senorita: A Chorded Keyboard for Sighted, Low Vision, and Blind Mobile Users",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Senorita is a novel two-thumb virtual chorded keyboard for mobile devices. It arranges the letters on eight keys in a single row by the bottom edge of the device based on letter frequencies and the anatomy of the thumbs. Unlike most chorded methods, it provides visual cues to perform the chording actions in sequence, instead of simultaneously, when the actions are unknown, facilitating \"learning by doing\". Its compact design leaves most of the screen available and its position near the edge accommodates eyes-free text entry. In a longitudinal study with a smartphone, Senorita yielded on average 14 wpm. In a short-term study with a tablet, it yielded on average 9.3 wpm. In the final longitudinal study, it yielded 3.7 wpm with blind users, surpassing their Qwerty performance. Low vision users yielded 5.8 wpm. Further, almost all users found Senorita effective, easy to learn, and wanted to keep use it.",
  "authors": [
    {
      "name": "Gulnar Rakhmetulla",
      "institution": "University of California, Merced, Merced, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528098",
      "orcid": "0000-0001-8637-5759"
    },
    {
      "name": "Ahmed Sabbir Arif",
      "institution": "University of California, Merced, Merced, CA, USA",
      "img": "/do/10.1145/contrib-81460652875/rel-imgonly/1632569177136_sq_col_sm.jpg",
      "acmid": "81460652875",
      "orcid": "0000-0002-8384-4764"
    }
  ],
  "references": [
    {
      "text": "Mohammad Ali Alamdar Yazdi, Ashkan Negahban, Lora Cavuoto, and Fadel M Megahed. 2019. Optimization of split keyboard design for touchscreen devices. International Journal of Human-Computer Interaction 35, 6 (2019), 468--477.",
      "doi": ""
    },
    {
      "text": "Maraim Alnfiai and Srinivas Sampalli. 2016. An evaluation of SingleTapBraille keyboard: a text entry method that utilizes braille patterns on touchscreen devices. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 161--169. DOI: http://dx.doi.org/10.1145/2982142.2982161",
      "doi": "10.1145/2982142.2982161"
    },
    {
      "text": "Ahmed Sabbir Arif and Ali Mazalek. 2016. WebTEM: a web application to record text entry metrics. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 415--420. DOI: http://dx.doi.org/10.1145/2992154.2996791",
      "doi": "10.1145/2992154.2996791"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of text entry performance metrics. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH). 100--105. DOI: http://dx.doi.org/10.1109/TIC-STH.2009.5444533",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2014. User adaptation to a faulty unistroke-based text entry technique by switching to an alternative gesture set. In Proceedings of Graphics Interface 2014 (GI '14). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 183--192. http://dl.acm.org/citation.cfm?id=2619648.2619679",
      "doi": "10.5555/2619648.2619679"
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 251--260. DOI: http://dx.doi.org/10.1145/2371574.2371612",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Nikola Banovic, Koji Yatani, and Khai N. Truong. 2013. Escape-keyboard: a sight-free one-handed text entry method for mobile touch-screen devices. International Journal of Mobile Human Computer Interaction (IJMHCI) 5, 3 (2013), 42--61.",
      "doi": "10.4018/jmhci.2013070103"
    },
    {
      "text": "Xiaojun Bi, Ciprian Chelba, Tom Ouyang, Kurt Partridge, and Shumin Zhai. 2012. Bimanual gesture keyboard. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 137--146. DOI: http://dx.doi.org/10.1145/2380116.2380136",
      "doi": "10.1145/2380116.2380136"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2016. IJQwerty: what difference does one key change make? Gesture typing keyboard optimization bounded by one key position change from Qwerty. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 49--58. DOI: http://dx.doi.org/10.1145/2858036.2858421",
      "doi": "10.1145/2858036.2858421"
    },
    {
      "text": "Syed Masum Billah, Yu-Jung Ko, Vikas Ashok, Xiaojun Bi, and IV Ramakrishnan. 2019. Accessible gesture typing for non-visual text entry on smartphones. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 376:1--376:12. DOI: http://dx.doi.org/10.1145/3290605.3300606",
      "doi": ""
    },
    {
      "text": "Matthew N. Bonner, Jeremy T. Brudvik, Gregory D. Abowd, and W. Keith Edwards. 2010. No-look notes: accessible eyes-free multi-touch text entry. In International Conference on Pervasive Computing. Springer, 409--426.",
      "doi": ""
    },
    {
      "text": "Rony Aldhea Dwi Cahya, Anik Nur Handayani, and Aji Prasetya Wibawa. 2018. Mobile Braille Touch Application for Visually Impaired People using Double Diamond Approach. In MATEC Web of Conferences, Vol. 197. EDP Sciences, 15007.",
      "doi": ""
    },
    {
      "text": "John M. Carroll and Caroline Carrithers. 1984. Training wheels in a user interface. Commun. ACM 27, 8 (Aug. 1984), 800--806. DOI: http://dx.doi.org/10.1145/358198.358218",
      "doi": "10.1145/358198.358218"
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 1986. Paradox of the active user. In Interfacing Thought: Cognitive Aspects of Human-Computer interaction (1 ed.), John M. Carroll (Ed.). MIT Press, Cambridge, MA, USA, Chapter 5, 80--111.",
      "doi": ""
    },
    {
      "text": "Li Deng and Xuedong Huang. 2004. Challenges in adopting speech recognition. Commun. ACM 47, 1 (2004), 69--75.",
      "doi": "10.1145/962081.962108"
    },
    {
      "text": "Android Developers. 2017. TextToSpeech. (2017). https://developer.android.com/reference/android/speech/tts/TextToSpeech.",
      "doi": ""
    },
    {
      "text": "Wenrui Diao, Xiangyu Liu, Zhe Zhou, and Kehuan Zhang. 2014. Your voice assistant is mine: how to abuse speakers to steal information and control your phone. In Proceedings of the 4th ACM Workshop on Security and Privacy in Smartphones & Mobile Devices (SPSM '14). ACM, NY, NY, USA, 63--74. DOI: http://dx.doi.org/10.1145/2666620.2666623",
      "doi": "10.1145/2666620.2666623"
    },
    {
      "text": "Andrew Fowler, Kurt Partridge, Ciprian Chelba, Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2015. Effects of language modeling and its personalization on touchscreen typing performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 649--658. DOI: http://dx.doi.org/10.1145/2702123.2702503",
      "doi": "10.1145/2702123.2702503"
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: using hand posture information to improve mobile touch screen text entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2795--2798. DOI: http://dx.doi.org/10.1145/2470654.2481386",
      "doi": ""
    },
    {
      "text": "Nathan Green, Jan Kruger, Chirag Faldu, and Robert St. Amant. 2004. A reduced Qwerty keyboard for mobile text entry. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 1429--1432. DOI: http://dx.doi.org/10.1145/985921.986082",
      "doi": "10.1145/985921.986082"
    },
    {
      "text": "Anna-Maria Gueorguieva, Gulnar Rakhmetulla, and Ahmed Sabbir Arif. 2018. Enabling input on tiny/headless systems using morse code. (Oct. 2018). https://www.asarif.com/pub/Gueorguieva_CCBM2018_ Morse_Code.pdf",
      "doi": ""
    },
    {
      "text": "João Guerreiro, André Rodrigues, Kyle Montague, Tiago Guerreiro, Hugo Nicolau, and Daniel Goncalves. 2015. TabLETS get physical: non-visual text entry on tablet devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15. ACM Press, Seoul, Republic of Korea, 39--42. DOI: http://dx.doi.org/10.1145/2702123.2702373",
      "doi": "10.1145/2702123.2702373"
    },
    {
      "text": "Tiago Guerreiro, Paulo Lagoá, Hugo Nicolau, Daniel Gonçalves, and Joaquim A Jorge. 2008. From tapping to touching: making touch screens accessible to blind users. IEEE MultiMedia 15, 4 (2008), 48--50.",
      "doi": "10.1109/MMUL.2008.88"
    },
    {
      "text": "Lilit Hakobyan, Jo Lumsden, Dympna O'Sullivan, and Hannah Bartlett. 2013. Mobile assistive technologies for the visually impaired. Survey of ophthalmology 58, 6 (2013), 513--528.",
      "doi": ""
    },
    {
      "text": "Jianwei Lai, Dongsong Zhang, Sen Wang, Isil Doga Yakut Kilic, and Lina Zhou. 2019. ThumbStroke: a virtual keyboard in support of sight-free and one-handed text entry on touchscreen mobile devices. ACM Transactions on Management Information Systems (TMIS) 10, 3 (2019), 11.",
      "doi": ""
    },
    {
      "text": "Jianwei Lai, Dongsong Zhang, Sen Wang, Isil Yakut Kilic, and Lina Zhou. 2018. A thumb stroke-based virtual keyboard for sight-free text entry on touch-screen mobile phones. In Proceedings of the 51st Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Leon. 2008. Frequency of Character Pairs in English Language Text, Codes and Cryptography. (2008). http://homepages.math.uic.edu/~leon/mcs425-s08/handouts/char_freq2.pdf.",
      "doi": ""
    },
    {
      "text": "Stefan Leuthold, Javier A Bargas-Avila, and Klaus Opwis. 2008. Beyond web content accessibility guidelines: Design of enhanced text user interfaces for blind internet users. International Journal of Human-Computer Studies 66, 4 (2008), 257--270.",
      "doi": "10.1016/j.ijhcs.2007.10.006"
    },
    {
      "text": "Frank Chun Yat Li, Leah Findlater, and Khai N. Truong. 2013. Effects of hand drift while typing on touchscreens. In Proceedings of Graphics Interface 2013 (GI '13). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 95--98. http://dl.acm.org/citation.cfm?id=2532129.2532146",
      "doi": ""
    },
    {
      "text": "Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1Line keyboard: a Qwerty layout in a single line. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 461--470. DOI: http://dx.doi.org/10.1145/2047196.2047257",
      "doi": ""
    },
    {
      "text": "Stan J. Liebowitz and Stephen E. Margolis. 1990. The fable of the keys. The Journal of Law and Economics 33, 1 (1990), 1--25.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754--755. DOI: http://dx.doi.org/10.1145/765891.765971",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and Kumiko Tanaka-Ishii. 2007. Text Entry Systems: Mobility, Accessibility, Universality. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/1296062"
    },
    {
      "text": "I. Scott MacKenzie and Shawn X. Zhang. 1999. The Design and Evaluation of a High-performance Soft Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 25--31. DOI: http://dx.doi.org/10.1145/302979.302983",
      "doi": "10.1145/302979.302983"
    },
    {
      "text": "Sergio Mascetti, Cristian Bernareggi, and Matteo Belotti. 2012. TypeInBraille: quick eyes-free typing on smartphones. In International Conference on Computers for Handicapped Persons. Springer, 615--622.",
      "doi": "10.1007/978-3-642-31534-3_90"
    },
    {
      "text": "National Federation of the Blind (NFB). 2009. The Braille literacy crisis in America. Technical Report. National Federation of the Blind (NFB), Baltimore, MD, USA. https://nfb.org/images/nfb/documents/pdf/braille_literacy_report_web.pdf.",
      "doi": ""
    },
    {
      "text": "João Oliveira, Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2011. Blind people and mobile touch-based text-entry: acknowledging the need for different flavors. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '11). ACM, NY, NY, USA, 179--186. DOI: http://dx.doi.org/10.1145/2049536.2049569",
      "doi": "10.1145/2049536.2049569"
    },
    {
      "text": "Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen, and Per Ola Kristensson. 2013. Improving two-thumb text entry on touchscreen devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13). ACM, NY, NY, USA, 2765--2774. DOI: http://dx.doi.org/10.1145/2470654.2481383",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Kyudong Park, Taedong Goh, and Hyo-Jeong So. 2014. Toward accessible mobile application design: developing mobile application accessibility guidelines for people with visual impairment. In Proceedings of HCI Korea (HCIK '15). Hanbit Media, Inc., South Korea, 31--38. http://dl.acm.org/citation.cfm?id=2729485.2729491",
      "doi": "10.5555/2729485.2729491"
    },
    {
      "text": "Keith B. Perry and Juan Pablo Hourcade. 2008. Evaluating one handed thumb tapping on mobile touchscreen devices. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 57--64. http://dl.acm.org/citation.cfm?id=1375714.1375725",
      "doi": "10.5555/1375714.1375725"
    },
    {
      "text": "Marco Romano, Luca Paolino, Genoveffa Tortora, and Giuliana Vitiello. 2014. The tap and slide keyboard: A new interaction method for mobile device text entry. International Journal of Human-Computer Interaction 30, 12 (2014), 935--945.",
      "doi": ""
    },
    {
      "text": "Anthony Savidis and Constantine Stephanidis. 2004. Unified user interface development: the software engineering of universally accessible interactions. Univers. Access Inf. Soc. 3, 3--4 (Oct. 2004), 165--193. DOI: http://dx.doi.org/10.1007/s10209-004-0096--8",
      "doi": ""
    },
    {
      "text": "George S Snoddy. 1926. Learning and stability: a psychophysiological analysis of a case of motor learning with clinical applications. Journal of Applied Psychology 10, 1 (1926), 1.",
      "doi": ""
    },
    {
      "text": "Mads Soegaard. 2019. Accessibility: Usability for all. Interaction Design Foundation. (2019). https://www.interaction-design.org/literature/article/accessibility-usability-for-all.",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2003. Metrics for text entry research: an evaluation of MSD and KSPC, and a new unified error metric. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/642611.642632",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "Caleb Southern, James Clawson, Brian Frey, Gregory Abowd, and Mario Romero. 2012. An evaluation of BrailleTouch: mobile touchscreen text entry for the visually impaired. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. ACM, 317--326.",
      "doi": "10.1145/2371574.2371623"
    },
    {
      "text": "Thomas S Tullis and Jacqueline N Stetson. 2004. A comparison of questionnaires for assessing website usability. In Usability professional association conference, Vol. 1. Minneapolis, USA.",
      "doi": ""
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: investigating fast mobile text entry using sentence-based decoding of touchscreen keyboard input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 659--668. DOI: http://dx.doi.org/10.1145/2702123.2702135",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: a technique for operating pen-based interfaces using touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 657--666. DOI: http://dx.doi.org/10.1145/1240624.1240727",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "World Health Organization (WHO). 2008. Change the definition of blindness. (2008), 5 pages. http://www.who.int/blindness/Change%20the% 20Definition%20of%20Blindness.pdf.",
      "doi": ""
    },
    {
      "text": "Daniel Wigdor and Ravin Balakrishnan. 2004. A comparison of consecutive and concurrent input text entry techniques for mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 81--88. DOI: http://dx.doi.org/10.1145/985692.985703",
      "doi": "10.1145/985692.985703"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, and John A. Kembel. 2003. EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 61--70. DOI: http://dx.doi.org/10.1145/964696.964703",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Suwen Zhu, Tianyao Luo, Xiaojun Bi, and Shumin Zhai. 2018. Typing on an invisible keyboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 439, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174013",
      "doi": "10.1145/3173574.3174013"
    }
  ]
}