{
  "doi": "10.1145/3313831.3376762",
  "title": "Investigating Roleplaying and Identity Transformation in a Virtual Reality Narrative Experience",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper we describe the design and evaluation of The Next Fairy Tale (TNFT) VR, a theatrical interactive storytelling system created in virtual reality and informed by performing arts theories. TNFT was designed to produce opportunities for interactors to experience role-taking and character identification using design principles drawn from actor training and theatrical performance. We report the results of a pilot qualitative study of interactors using TNFT to explore the elements of the design that supported or hindered roleplaying behavior. We identify four design patterns that supported roleplaying in the system: (1) using explicit roles to set player expectations, (2) embracing the \"mask and the mirror\" effect, (3) attending to visual and interactional details, and (4) easing the player gently into the roleplaying experience. These patterns speak to a broader need to support roleplay through explicit scaffolding of desired player behaviors in digital narrative experiences.",
  "tags": [
    "roleplaying",
    "narrative",
    "interactive performance",
    "interactive digital storytelling",
    "drama",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Saumya Gupta",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261234",
      "orcid": "missing"
    },
    {
      "name": "Theresa Jean Tanenbaum",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81388594272/rel-imgonly/20210704_104248.jpg",
      "acmid": "81388594272",
      "orcid": "missing"
    },
    {
      "name": "Meena Devii Muralikumar",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320718",
      "orcid": "missing"
    },
    {
      "name": "Aparajita S. Marathe",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528085",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ruth Aylett, Marco Vala, Pedro Sequeira, and Ana Paiva. 2007. FearNot! -- An Emergent Narrative Approach to Virtual Dramas for Anti-bullying Education. In Virtual Storytelling. Using Virtual Reality Technologies for Storytelling (Lecture Notes in Computer Science), 202--205. https://doi.org/10.1007/978--3--540--77039--8_19",
      "doi": ""
    },
    {
      "text": "Jon Back, Elena Márquez Segura, and Annika Waern. 2017. Designing for Transformative Play. ACM Trans. Comput.-Hum. Interact. 24, 3: 18:1-- 18:28. https://doi.org/10.1145/3057921",
      "doi": "10.1145/3057921"
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2001. Equilibrium Theory Revisited: Mutual Gaze and Personal Space in Virtual Environments. Presence 10, 6: 583--598.",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2003. Interpersonal Distance in Immersive Virtual Environments. Personality and Social Psychology Bulletin 29: 819-- 833.",
      "doi": "10.1145/3452918.3458804"
    },
    {
      "text": "Sasha A. Barab, Melissa Gresalfi, Anna Arici, Patrick Pettyjohn, and Adam Ingram-Goble. 2010. Transformative Play: Games As 21st Century Curriculum. In Proceedings of the 9th International Conference of the Learning Sciences - Volume 2 (ICLS '10), 93--100. Retrieved October 24, 2014 from http://dl.acm.org/citation.cfm?id=1854509.1854548",
      "doi": ""
    },
    {
      "text": "Sasha A. Barab, Melissa Gresalfi, and Adam IngramGoble. 2010. Transformational Play Using Games to Position Person, Content, and Context. Educational Researcher 39, 7: 525--536. https://doi.org/10.3102/0013189X10386593",
      "doi": ""
    },
    {
      "text": "Barbara Becker and Gloria Mark. 1998. Social Conventions in Collaborative Virtual Environments.",
      "doi": ""
    },
    {
      "text": "Robert Benedetti. 1997. The Actor At Work. Allyn and Bacon.",
      "doi": ""
    },
    {
      "text": "Leslie Bishko. 2004. Laban for Animators: Overview of Laban Movement Analysis.",
      "doi": ""
    },
    {
      "text": "Jim Bizzocchi, Ben Lin, and Theresa Jean Tanenbaum. 2011. Games, Narrative, and the Design of Interface. International Journal of Art and Technology (IJART) 4, 4: 460--479.",
      "doi": ""
    },
    {
      "text": "Marc Cavazza, Ruth Aylett, Kerstin Dautenhahn, Clive Fencott, and Fred Charles. 2000. Interactive Storytelling in Virtual Environments: Building the ?Holodeck.\"",
      "doi": ""
    },
    {
      "text": "Kurt Daw. 2004. Acting: Thought into Action. Heinemann, Portsmouth, NH, USA.",
      "doi": ""
    },
    {
      "text": "Disney On Broadway. \"Circle of Life\" in 360o | THE LION KING on Broadway. Retrieved March 12, 2019 from https://www.youtube.com/watch?v=7T57kzGQGto",
      "doi": ""
    },
    {
      "text": "Petra Fagerberg, Anna Ståhl, and Kristina Höök. 2004. eMoto: Emotionally Engaging Interaction. Personal Ubiquitous Comput. 8, 5: 377--381. https://doi.org/10.1007/s00779-004-0301-z",
      "doi": ""
    },
    {
      "text": "Joshua A. Fisher. 2017. Empathic Actualities: Toward a Taxonomy of Empathy in Virtual Reality. In Interactive Storytelling (Lecture Notes in Computer Science), 233--244.",
      "doi": ""
    },
    {
      "text": "Keith Johnstone. 1992. Impro: Improvisation and the Theatre. Routledge / Theatre Arts Books, New York, New York.",
      "doi": ""
    },
    {
      "text": "Keith Johnstone. 1999. Impro for Storytellers. Routledge/Theatre Arts Books.",
      "doi": ""
    },
    {
      "text": "Martijn JL Kors, Erik D. van der Spek, Gabriele Ferri, and Ben AM Schouten. 2018. You; the Observer, Partaker or Victim. Delineating Three Perspectives to Empathic Engagement in Persuasive Games Using Immersive Technologies. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (CHI PLAY '18 Extended Abstracts), 493--501. https://doi.org/10.1145/3270316.3271547",
      "doi": ""
    },
    {
      "text": "David Krasner. 2000. I Hate Strasberg: Method Bashing in the Academy. In Method Acting Reconsidered, David Krasner (ed.). St. Martin's Press, New York, NY, 3--39.",
      "doi": ""
    },
    {
      "text": "Brenda Laurel. 1986. Toward the Design of a Computer-Based Interactive Fantasy System. Ohio State University, Ohio, USA. Retrieved from https://etd.ohiolink.edu/!etd.send_file?accession=osu 1487265143146814&disposition=inline",
      "doi": ""
    },
    {
      "text": "Brenda Laurel. 1993. Computers as Theatre. Addison-Wesley Longman Publishing Co., Inc., Boston, MA.",
      "doi": "10.5555/529145"
    },
    {
      "text": "Cheryl-Jean Leo, Eric Tsai, Arim Yoon, Kyungik Lee, and Jingyu Liu. 2015. An Ant's Life: Storytelling in Virtual Reality. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15), 779--782. https://doi.org/10.1145/2793107.2810264",
      "doi": "10.1145/2793107.2810264"
    },
    {
      "text": "Sandy Louchart and Ruth Aylett. 2007. Building Synthetic Actors for Interactive Drama. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Brian Magerko, Casey Fiesler, Allan Baumer, and Daniel Fuller. 2010. Bottoms Up: Improvisational Micro-Agents. ACM Press.",
      "doi": "10.1145/1822309.1822317"
    },
    {
      "text": "Michael Mateas. 2004. A Preliminary Poetics for Interactive Drama and Games. In First Person: New Media As Story, Performance, and Game, Noah Wardrip-Fruin and Pat Harrigan (eds.). The MIT Press, Cambridge, Massachusetts; London, England, 19--33.",
      "doi": ""
    },
    {
      "text": "Michael Mateas and Andrew Stern. 2003. Facade: An experiment in building a fully-realized interactive drama. 82. Retrieved October 30, 2013 from http://classes.soe.ucsc.edu/cmps148/Spring08/Mateas SternGDC03.pdf",
      "doi": ""
    },
    {
      "text": "Josh McCoy, Mike Treanor, Ben Samuel, Noah Wardrip-Fruin, and Michael Mateas. 2011. Comme Il Faut: A System for Authoring Playable Social Models. In Proceedings of the Seventh AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment (AIIDE'11), 158--163. Retrieved from http://dl.acm.org/citation.cfm?id=3014589.3014617",
      "doi": "10.5555/3014589.3014617"
    },
    {
      "text": "Janet Murray. 1997. Hamlet on the Holodeck: the future of narrative in cyberspace. The MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/572887"
    },
    {
      "text": "Janet Murray. 2004. From Game-Story to Cyberdrama. In First Person: New Media as Story, Performance, and Game, Noah Wardrip-Fruin and Pat Harrigan (eds.). The MIT Press, Cambridge, Massachusetts; London, England, 2--11.",
      "doi": ""
    },
    {
      "text": "Mark J. Nelson, Michael Mateas, David L. Roberts, and Charles L. Isbell Jr. 2006. Declarative Optimization-Based Drama Management in Interactive Fiction. IEEE Computer Graphics and Applications 26, 3: 32--41.",
      "doi": "10.1109/MCG.2006.55"
    },
    {
      "text": "Jayesh S. Pillai, Azif Ismail, and Herold P. Charles. 2017. Grammar of VR Storytelling: Visual Cues. In Proceedings of the Virtual Reality International Conference - Laval Virtual 2017 (VRIC '17), 7:1-- 7:4. https://doi.org/10.1145/3110292.3110300",
      "doi": ""
    },
    {
      "text": "Bradley Plaxen, Zoe Qi, Melissa R. Schoeller, and Sharon You. 2018. One of the Family: An Exploratory 3rd Person Branching Narrative for Virtual Reality. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18), D407:1--D407:4. https://doi.org/10.1145/3170427.3186529",
      "doi": ""
    },
    {
      "text": "Brant L. Pope. 2000. Redefining Acting: The Implications of the Meisner Method. In Method Acting Reconsidered, David Krasner (ed.). St. Martin's Press, New York, NY, 147--157.",
      "doi": ""
    },
    {
      "text": "Sheri Graner Ray. 2010. Tutorials: Learning to Play. Gamasutra.",
      "doi": ""
    },
    {
      "text": "Mark Riedl, C. J. Saretto, and R. Michael Young. 2003. Managing interaction between users and agents in a multi-agent storytelling environment. 741--748.",
      "doi": ""
    },
    {
      "text": "James A. Russell. 1980. A circumplex model of affect. Journal of Personality and Social Psychology 39, 6: 1161--1178. https://doi.org/10.1037/h0077714",
      "doi": ""
    },
    {
      "text": "David Z. Saltz. 2000. The Reality of Doing: Real Speech Acts in the Theatre. In Method Acting Reconsidered, David Krasner (ed.). St. Martin's Press, New York, NY, 61--79.",
      "doi": ""
    },
    {
      "text": "Ben Samuel, James Ryan, Adam J. Summerville, Michael Mateas, and Noah Wardrip-Fruin. 2016. Bad News: An Experiment in Computationally Assisted Performance. In Interactive Storytelling (Lecture Notes in Computer Science), 108--120.",
      "doi": ""
    },
    {
      "text": "Nicola S. Schutte and Emma J. Stilinovic. 2017. Facilitating empathy through virtual reality. Motivation and Emotion 41, 6: 708--712. https://doi.org/10.1007/s11031-017--9641--7",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr. 2004. A User-centric Adaptive Story Architecture: Borrowing from Acting Theories. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04), 109--116. https://doi.org/10.1145/1067343.1067356",
      "doi": "10.1145/1067343.1067356"
    },
    {
      "text": "Magy Seif El-Nasr. 2004. An Interactive Narrative Architecture based on Filmmaking Theory. International Journal on Games and Simulation 3, 1: 29--36.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr. 2007. Interaction, Narrative, and Drama Creating an Adaptive Interactive Narrative using Performance Art Theories. Interaction Studies 8, 2.",
      "doi": ""
    },
    {
      "text": "Donghee Shin. 2018. Empathy and embodied experience in virtual environment: To what extent can virtual reality stimulate empathy and embodied experience? Computers in Human Behavior 78: 64-- 73. https://doi.org/10.1016/j.chb.2017.09.012",
      "doi": "10.1016/j.chb.2017.09.012"
    },
    {
      "text": "Mei Si, Stacy C. Marsella, and David V. Pynadath. 2005. Thespian: Using Multi-agent Fitting to Craft Interactive Drama. In Proceedings of the Fourth International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS '05), 21-- 28. https://doi.org/10.1145/1082473.1082477",
      "doi": ""
    },
    {
      "text": "Murray Smith. 1995. Engaging Characters: Fiction, Emotion, and the Cinema. Clarendon Press.",
      "doi": ""
    },
    {
      "text": "Constantin Stanislavski. 1936. An Actor Prepares. Theater Arts Inc, New York.",
      "doi": ""
    },
    {
      "text": "Constantin Stanislavski. 2013. Building a Character. A&C Black.",
      "doi": ""
    },
    {
      "text": "Ivo Swartjes and Mariët Theune. 2009. An Experiment in Improvised Interactive Drama. In (Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering.), 234--239.",
      "doi": ""
    },
    {
      "text": "Nicolas Szilas. 2003. IDtension: A narrative engine for Interactive Drama. In Conference on Technologies for Interactive Digital Storytelling and Entertainment. Retrieved from https://www.academia.edu/21023655/IDtension_a_na rrative_engine_for_Interactive_Drama",
      "doi": ""
    },
    {
      "text": "Nicolas Szilas. 2005. The Future of Interactive Drama. Creativity & Cognition Studios Press.",
      "doi": ""
    },
    {
      "text": "Nicolas Szilas and Manolya Kavakli. 2006. PastMaster@Storytelling: A Controlled Interface for Interactive Drama. In Proceedings of the 11th International Conference on Intelligent User Interfaces (IUI '06), 288--290. https://doi.org/10.1145/1111449.1111513",
      "doi": "10.1145/1111449.1111513"
    },
    {
      "text": "Theresa Jean Tanenbaum. 2011. Being in the Story: Readerly Pleasure, Acting Theory, and Performing a Role. In Interactive Storytelling, Mei Si, David Thue, Elisabeth André, James C. Lester, Theresa Jean Tanenbaum and Veronica Zammitto (eds.). Springer Berlin Heidelberg, 55--66. Retrieved May 21, 2014 from http://link.springer.com.proxy.lib.sfu.ca/chapter/10.1 007/978--3--642--25289--1_7",
      "doi": "10.1007/978-3-642-25289-1_7"
    },
    {
      "text": "Theresa Jean Tanenbaum. 2013. How I Learned to Stop Worrying and Love the Gamer: Reframing Subversive Play in Story-Based Games. In DiGRA 2013: DeFragging Game Studies. Retrieved from http://www.digra.org/wp-content/uploads/digitallibrary/paper_136.pdf",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum. 2015. Identity Transformation and Agency in Digital Narratives and Story Based Games. Simon Fraser University, Surrey, British Columbia, Canada. Retrieved from http://summit.sfu.ca/item/15285",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Magy Seif El-Nasr, and Michael Nixon. 2014. Nonverbal Communication in Virtual Worlds: Understanding and Designing Expressive Characters. ETC Press. Retrieved from http://press.etc.cmu.edu/content/nonverbalcommunication-virtual-worlds-understanding-anddesigning-expressive-characters",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum and Karen Tanenbaum. 2008. Improvisation and Performance as Models for Interacting with Stories. In (Lecture Notes in Computer Science), 250--263.",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum and Karen Tanenbaum. 2015. Empathy and Identity in Digital Games: Towards a New Theory of Transformative Play. In Foundations of Digital Games, 2015. Retrieved from http://www.fdg2015.org/papers/fdg2015_paper_49.p df",
      "doi": ""
    },
    {
      "text": "Sharon Tettegah, Kona Taylor, Eun Won Whang, Simon Meistninkas, and Robert Chamot. 2006. Can Virtual Reality Simulations Be Used As a Research Tool to Study Empathy, Problems Solving and Perspective Taking of Educators?: Theory, Method and Application. In ACM SIGGRAPH 2006 Educators Program (SIGGRAPH '06). https://doi.org/10.1145/1179295.1179331",
      "doi": "10.1145/1179295.1179331"
    },
    {
      "text": "Jeff Wirth. 1994. Interactive Acting: Acting, Improvisation, and Interacting for Audience Participatory Theatre. Fall Creek Press, Fall Creek, OR.",
      "doi": ""
    },
    {
      "text": "Qiong Wu, Pierre Boulanger, Maryia Kazakevich, and Robyn Taylor. 2010. A Real-time Performance System for Virtual Theater. In Proceedings of the 2010 ACM Workshop on Surreal Media and Virtual Cloning (SMVC '10), 3--8. https://doi.org/10.1145/1878083.1878087",
      "doi": "10.1145/1878083.1878087"
    },
    {
      "text": "VR APP. Retrieved March 12, 2019 from https://www.cirquedusoleil.com/en/other-activities/Vr-app",
      "doi": ""
    }
  ]
}