{
  "doi": "10.1145/3313831.3376685",
  "title": "Makers in Healthcare: The Role of Occupational Therapists in the Design of DIY Assistive Technology",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Advancements in personal fabrication technologies (e.g. 3D printing) resulted in a rising interest in 'do-it-yourself assistive technology' (DIY AT). Clinical knowledge is considered fundamental for DIY AT design, but research into making DIY AT by clinicians is limited. In this paper, we explore occupational therapists' attitudes towards 3D printing both before and after gaining hands-on experience with 3D modelling software. In addition, as clinicians indicate to prefer collaborations with experienced designers, we organized a codesign study with occupational therapists and professional designers to conceptualize a feasible collaborative DIY-AT design process. The results of our studies show an overall enthusiasm of occupational therapists towards 3D printing, but the perceived impact of 3D printing on their job performance decreased after gaining hands-on experience. Collaborating with designers seems a viable way forward. We propose a model for a collaborative design process, highlighting different phases and the roles that occupational therapists and designers play.",
  "authors": [
    {
      "name": "Karin Slegers",
      "institution": "Tilburg University & KU Leuven, Tilburg, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442598065",
      "orcid": "missing"
    },
    {
      "name": "Kristel Kouwenberg",
      "institution": "Tilburg University, Tilburg, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527033",
      "orcid": "missing"
    },
    {
      "name": "Tereza Loučova",
      "institution": "Tilburg University, Tilburg, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529223",
      "orcid": "missing"
    },
    {
      "name": "Ramon Daniels",
      "institution": "Zuyd University of Applied Sciences, Heerlen, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527034",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, et al. 2015. Sharing is caring: Assistive technology designs on thingiverse. Conference on Human Factors in Computing Systems - Proceedings, ACM Press, 525-- 534.",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Transactions on Accessible Computing 8, 3: 1--28.",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: Opportunities and obstacles to 3D printing in special education environments. ASSETS14 Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility, ACM Press, 107--114.",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Lieven de Couvreur and Richard Goossens. 2011. Design for (every)one: Co-creation as a bridge between universal design and rehabilitation engineering. CoDesign 7, 2: 107--121.",
      "doi": ""
    },
    {
      "text": "Katrien Dreessen, Liesbeth Huybrechts, Thomas Laureyssens, and Selina Schepers. 2011. MAP-it. A participatory mapping toolkit. Acco, Leuven.",
      "doi": ""
    },
    {
      "text": "D. T. P. Van Hassel and R. J. Kenens. 2014. Cijfers uit de registratie van ergotherapeuten: peiling 1 januari 2014. | Nivel. Retrieved December 13, 2019 from https://www.nivel.nl/nl/publicatie/cijfers-uit-deregistratie-van-ergotherapeuten-peiling-1-januari-2014.",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Julie Burke, Jon Pearlman, et al. 2016. Clinical and Maker Perspectives on the Design of Assistive Technology with Rapid Prototyping Technologies. Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16, ACM Press, 251--256.",
      "doi": "10.1145/2982142.2982181"
    },
    {
      "text": "Megan Hofmann, Kristin Williams, Toni Kaplan, et al. 2019. \"Occupational therapy is making\": Clinical rapid prototyping and digital fabrication. Conference on Human Factors in Computing Systems - Proceedings, ACM Press, 1--13.",
      "doi": "10.1145/3290605.3300544"
    },
    {
      "text": "Jonathan Hook, Sanne Verbaan, Abigail Durrant, Patrick Olivier, and Peter Wright. 2014. A study of the challenges related to DIY assistive technology in the context of children with disabilities. Proceedings of the 2014 conference on Designing interactive systems - DIS '14, ACM Press, 597--606.",
      "doi": "10.1145/2598510.2598530"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '11, ACM Press, 11.",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Liesbeth Huybrechts, Katrien Dreessen, and Selina Schepers. 2012. Mapping design practices. Proceedings of the 12th Participatory Design Conference on Exploratory Papers Workshop Descriptions Industry Cases - Volume 2 - PDC '12, ACM Press, 29.",
      "doi": "10.1145/2348144.2348155"
    },
    {
      "text": "Lili Liu, Antonio Miguel Cruz, Adriana Rios Rincon, Vickie Buttar, Quentin Ranson, and Darrell Goertzen. 2015. What factors determine therapists' acceptance of new technologies for rehabilitation -- a study using the Unified Theory of Acceptance and Use of Technology (UTAUT). Disability and Rehabilitation 37, 5: 447-- 455.",
      "doi": ""
    },
    {
      "text": "MAP-it. 2011. www.MAP-it.be. Retrieved September 14, 2019 from http://map-it.be/.",
      "doi": ""
    },
    {
      "text": "Samantha McDonald, Niara Comrie, Erin Buehler, et al. 2016. Uncovering Challenges and Opportunities for 3D Printing Assistive Technology with Physical Therapists. Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16, ACM Press, 131--139.",
      "doi": "10.1145/2982142.2982162"
    },
    {
      "text": "Argyro Moraiti, Vero Vanden Abeele, Erwin Vanroye, and Luc Geurts. 2015. Empowering Occupational Therapists with a DIY-toolkit for Smart Soft Objects. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14, ACM Press, 387--394.",
      "doi": "10.1145/2677199.2680598"
    },
    {
      "text": "Nictiz. 2009. Procesbeschrijving Hulpmiddelenzorg. Nictiz, Den Haag, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Belinda Paulovich. 2015. Design to Improve the Health Education Experience: using participatory design methods in hospitals with clinicians and patients. Visible Language 49, 1/2: 144--159.",
      "doi": ""
    },
    {
      "text": "Mary Vining Radomski and Catherine A. Trombly Latham. Occupational therapy for physical dysfunction.",
      "doi": ""
    },
    {
      "text": "Louise K. Schaper and Graham P. Pervan. 2007. ICT and OTs: A model of information and communication technology acceptance and utilisation by occupational therapists. International Journal of Medical Informatics 76: S212--S221.",
      "doi": ""
    },
    {
      "text": "Therese Schmid. 2004. Meanings of creativity within occupational therapy practice. Australian Occupational Therapy Journal 51, 2: 80--88.",
      "doi": ""
    },
    {
      "text": "Venkatesh, Morris, Davis, and Davis. 2003. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly 27, 3: 425.",
      "doi": ""
    }
  ]
}