{
  "doi": "10.1145/3313831.3376569",
  "title": "\"Nobody Speaks that Fast!\" An Empirical Study of Speech Rate in Conversational Agents for People with Vision Impairments",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The number of people with vision impairments using Conversational Agents (CAs) has increased because of the potential of this technology to support them. As many visually impaired people are accustomed to understanding fast speech, most screen readers or voice assistant systems offer speech rate settings. However, current CAs are designed to interact at a human-like speech rate without considering their accessibility. In this study, we tried to understand how people with vision impairments use CA at a fast speech rate. We conducted a 20-day in-home study that examined the CA use of 10 visually impaired people at default and fast speech rates. We investigated the difference in visually impaired people's CA use with different speech rates and their perception toward CA at each rate. Based on these findings, we suggest considerations for the future design of CA speech rate for those with visual impairments.",
  "tags": [
    "conversational agents",
    "speech rate",
    "accessibility",
    "people with vision impairments"
  ],
  "authors": [
    {
      "name": "Dasom Choi",
      "institution": "KAIST, Daejoen, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526494",
      "orcid": "0000-0002-3392-6243"
    },
    {
      "name": "Daehyun Kwak",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527851",
      "orcid": "missing"
    },
    {
      "name": "Minji Cho",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701911",
      "orcid": "missing"
    },
    {
      "name": "Sangsu Lee",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81416594796/rel-imgonly/profile.jpg",
      "acmid": "81416594796",
      "orcid": "0000-0002-3793-6801"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M. Branham. 2018. \"Siri Talks at You\": An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. In Proceedings of the 20thInternational ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18). ACM, New York, NY, USA, 249--258. DOI: http://dx.doi.org/10.1145/3234695.3236344",
      "doi": ""
    },
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Amy Hurst. 2016.An Empirical Investigation of the Situationally-induced Impairments Experienced by Blind Mobile Device Users. In Proceedings of the 13th Web for All Conference (W4A'16). ACM, New York, NY, USA, Article 21, 8 pages. DOI: http://dx.doi.org/10.1145/2899475.2899482",
      "doi": "10.1145/2899475.2899482"
    },
    {
      "text": "Faisal Ahmed, Yevgen Borodin, Yury Puzis, and I. V.Ramakrishnan. 2012a. Why Read if You Can Skim: Towards Enabling Faster Screen Reading. In Proceedings of the International Cross-Disciplinary Conference on Web Accessibility (W4A '12). ACM, New York, NY, USA, Article 39, 10 pages. DOI: http://dx.doi.org/10.1145/2207016.2207052",
      "doi": "10.1145/2207016.2207052"
    },
    {
      "text": "Faisal Ahmed, Yevgen Borodin, Andrii Soviak, Muhammad Islam, I.V. Ramakrishnan, and Terri Hedgpeth. 2012b. Accessible Skimming: Faster Screen Reading of Web Pages. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 367--378. DOI: http://dx.doi.org/10.1145/2380116.2380164",
      "doi": "10.1145/2380116.2380164"
    },
    {
      "text": "Faisal Ahmed, Andrii Soviak, Yevgen Borodin, and I.V. Ramakrishnan. 2013. Non-visual Skimming on Touch-screen Devices. In Proceedings of the 2013 International Conference on Intelligent User Interfaces(IUI '13). ACM, New York, NY, USA, 435--444. DOI: http://dx.doi.org/10.1145/2449396.2449452",
      "doi": ""
    },
    {
      "text": "Chieko Asakawa, Hironobu Takagi, Shuichi Ino, and Tohru Ifukube. 2003. Maximum listening speeds for the blind. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Nicole B. Lee. 2013. Exploring the Use of Speech Input by Blind People on Mobile Devices. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS '13). ACM, New York, NY, USA, Article 11, 8 pages. DOI: http://dx.doi.org/10.1145/2513383.2513440",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 91 (Sept. 2018), 24 pages. DOI: http://dx.doi.org/10.1145/3264901",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Apoorva Bhalla. 2018. An Exploratory Study Understanding the Appropriated Use of Voice-based Search and Assistants. In Proceedings of the 9th Indian Conference on Human Computer Interaction(IndiaHCI'18). ACM, New York, NY, USA, 90--94. DOI: http://dx.doi.org/10.1145/3297121.3297136",
      "doi": "10.1145/3297121.3297136"
    },
    {
      "text": "Jeffrey P. Bigham, Irene Lin, and Saiph Savage. 2017. The Effects of \"Not Knowing What You Don't Know\" on Web Accessibility for Blind Web Users. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS'17). ACM, New York, NY, USA, 101--109. DOI: http://dx.doi.org/10.1145/3132525.3132533",
      "doi": "10.1145/3132525.3132533"
    },
    {
      "text": "The Amazon Blog. 2019. \"Alexa, speak slower\" Customers can now adjust the speed of Alexa's speech.(07 August 2019). https://blog.aboutamazon.com/devices/alexa-speak-slower.",
      "doi": ""
    },
    {
      "text": "Emily C. Bouck, Sara Flanagan, Gauri S. Joshi, Waseem Sheikh, and Dave Schleppenbach. 2011. Speaking Math- A Voice Input, Speech Output Calculator for Students with Visual Impairments. Journal of Special Education Technology 26, 4 (2011), 1--14. DOI: http://dx.doi.org/10.1177/016264341102600401",
      "doi": ""
    },
    {
      "text": "Danielle Bragg, Cynthia Bennett, Katharina Reinecke, and Richard Ladner. 2018. A Large Inclusive Study of Human Listening Rates. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI '18). ACM, New York, NY, USA, Article 444, 12 pages. DOI:http://dx.doi.org/10.1145/3173574.3174018",
      "doi": "10.1145/3173574.3174018"
    },
    {
      "text": "Stacy M. Branham, Ali Abdolrahmani, William Easley, Morgan Scheuerman, Erick Ronquillo, and Amy Hurst. 2017. \"Is Someone There? Do They Have a Gun\": How Visual Information About Others Can Improve Personal Safety Management for Blind Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS'17). ACM, New York, NY, USA, 260--269.DOI:http://dx.doi.org/10.1145/3132525.3132534",
      "doi": "10.1145/3132525.3132534"
    },
    {
      "text": "Stacy M. Branham and Antony Rishin Mukkath Roy. 2019. Reading Between the Guidelines: How Commercial Voice Assistant Guidelines Hinder Accessibility for Blind Users. InThe 21st International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '19). Association for Computing Machinery, New York, NY, USA, 446--458. DOI: http://dx.doi.org/10.1145/3308561.3353797",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal. 2003. Emotion and sociable humanoid robots.International Journal of Human-Computer Studies59, 1 (2003), 119 -- 155. DOI: http://dx.doi.org/https://doi.org/10.1016/S1071--5819(03)00018--1 Applicationsof Affective Computing in Human-Computer Interaction.",
      "doi": ""
    },
    {
      "text": "A. Bruce, I. Nourbakhsh, and R. Simmons. 2002. The role of expressiveness and attention in human-robot interaction. In Proceedings 2002 IEEE International Conference on Robotics and Automation (Cat.No.02CH37292), Vol. 4. 4138--4142 vol. 4. DOI: http://dx.doi.org/10.1109/ROBOT.2002.1014396",
      "doi": ""
    },
    {
      "text": "Angelo Cafaro, Nadine Glas, and Catherine Pelachaud. 2016. The Effects of Interrupting Behavior on Interpersonal Attitude and Engagement in Dyadic Interactions. In Proceedings of the 2016 International Conference on Autonomous Agents & Multiagent Systems (AAMAS '16). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 911--920.http://dl.acm.org/citation.cfm?id=2936924.2937059",
      "doi": "10.5555/2936924.2937059"
    },
    {
      "text": "Minji Cho, Sang-su Lee, and Kun-Pyo Lee. 2019. Once a Kind Friend is Now a Thing: Understanding How Conversational Agents at Home Are Forgotten. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, New York, NY,USA, 1557--1569. DOI: http://dx.doi.org/10.1145/3322276.3322332",
      "doi": "10.1145/3322276.3322332"
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, Vincent Wade, and Benjamin R. Cowan. 2019. What Makes a Good Conversation?: Challenges in Designing Truly Conversational Agents. In Proceedings of the2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 475, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300705",
      "doi": ""
    },
    {
      "text": "Michael H Cohen, Michael Harris Cohen, James P Giangola, and Jennifer Balogh. 2004. Voice user interface design. Addison-Wesley Professional.",
      "doi": "10.5555/975074"
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley,and Natasha Bandeira. 2017. \"What Can I Help Youwith?\": Infrequent Users' Experiences of Intelligent Personal Assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI '17). ACM, New York, NY, USA, Article43, 12 pages. DOI: http://dx.doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \"Hey Google is It OK if I EatYou?\": Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, New York, NY,USA, 595--600.DOI:http://dx.doi.org/10.1145/3078072.3084330",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Jinjuan Feng, Shaojian Zhu, Ruimin Hu, and Andrew Sears. 2011. Speech-based navigation and error correction: a comprehensive comparison of two solutions.Universal Access in the Information Society10, 1 (01 Mar 2011), 17--31. DOI: http://dx.doi.org/10.1007/s10209-010-0185--9",
      "doi": ""
    },
    {
      "text": "The National Center for Voice and Speech. 2015. NCVS.(2015).http://www.ncvs.org/index.html/.",
      "doi": ""
    },
    {
      "text": "Prathik Gadde and Davide Bolchini. 2013. WebNexter: Dynamic Guided Tours for Screen Readers. In Proceedings of the Adjunct Publication of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13 Adjunct). ACM, New York, NY, USA, 85--86. DOI: http://dx.doi.org/10.1145/2508468.2514722",
      "doi": "10.1145/2508468.2514722"
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007),38--56.",
      "doi": ""
    },
    {
      "text": "Leilani H. Gilpin, Danielle M. Olson, and Tarfah Alrashed. 2018. Perception of Speaker Personality Traits Using Speech Signals. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA,Article LBW514, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188557",
      "doi": ""
    },
    {
      "text": "João Guerreiro and Daniel Gonçalves. 2015. Faster Text-to-Speeches: Enhancing Blind People's Information Scanning with Faster Concurrent Speech. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS'15). ACM, New York, NY, USA, 3--11. DOI: http://dx.doi.org/10.1145/2700648.2809840",
      "doi": "10.1145/2700648.2809840"
    },
    {
      "text": "Zixuan Guo and Tomoo Inoue. 2019. Using a Conversational Agent to Facilitate Non-native Speaker's Active Participation in Conversation. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Article LBW1216, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3313075",
      "doi": "10.1145/3290607.3313075"
    },
    {
      "text": "Apple Help. Accessed 2019a. Voice Over commands and gestures. (Accessed 2019). https://help.apple.com/voiceover/mac/10.15/?lang=en#/vo28030.",
      "doi": ""
    },
    {
      "text": "Apple Help. Accessed 2019b. Voice Over User Guide.(Accessed 2019). https://help.apple.com/voiceover/mac/10.14/?lang=en/.",
      "doi": ""
    },
    {
      "text": "Android Accessibility Help. Accessed 2019c. Turn on Talk Back. (Accessed 2019). https://support.google.com/accessibility/android/#topic=6007234/.",
      "doi": ""
    },
    {
      "text": "Android Google Assistant Help. 2018. Choose the voice of your Google Assistant. (2018). https://support.google.com/assistant/answer/7544506?hl=en&co=GENIE.Platform=Android.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Brian Frey, and Jacob O. Wobbrock. 2013. Access Lens: A Gesture-based Screen Reader for Real-world Documents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '13). ACM, New York, NY, USA, 347--350. DOI: http://dx.doi.org/10.1145/2470654.2470704",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People:Understanding Preference and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 413--422. DOI: http://dx.doi.org/10.1145/1978942.1979001",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User Experience over Time: An Initial Framework. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 729--738. DOI:http://dx.doi.org/10.1145/1518701.1518814",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Hankyung Kim, Dong Yoon Koh, Gaeun Lee, Jung-Mi Park, and Youn-kyung Lim. 2019. Designing Personalities of Conversational Agents. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Article LBW1321, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3312887",
      "doi": ""
    },
    {
      "text": "Yoshinori Kuno, Kazuhisa Sadazuka, Michie Kawashima, Keiichi Yamazaki, Akiko Yamazaki, and Hideaki Kuzuoka. 2007. Museum Guide Robot Based on Sociological Interaction Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY,USA, 1191--1194. DOI: http://dx.doi.org/10.1145/1240624.1240804",
      "doi": "10.1145/1240624.1240804"
    },
    {
      "text": "Jonathan Lazar, Aaron Allen, Jason Kleinman, and Chris Malarkey. 2007. What Frustrates Screen Reader Users on the Web: A Study of 100 Blind Users.International Journal of Human-Computer Interaction 22, 3 (2007), 247--269. DOI: http://dx.doi.org/10.1080/10447310709336964",
      "doi": ""
    },
    {
      "text": "Nara Lee, Jiyoung Shin, Doyoung Yoo, and Kyung Wha Kim. 2017. Speech rate in Korean across region, genderand generation. Phonetics and Speech Sciences9, 1(2017), 27--39.",
      "doi": ""
    },
    {
      "text": "Sunok Lee, Sungbae Kim, and Sangsu Lee. 2019. \"What Does Your Agent Look Like?\": A Drawing Study toUnderstand Users' Perceived Persona of ConversationalAgent. In Extended Abstracts of the 2019 CHIConference on Human Factors in Computing Systems(CHI EA '19). ACM, New York, NY, USA, Article LBW0143, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3312796",
      "doi": "10.1145/3290607.3312796"
    },
    {
      "text": "Guilherme V. Leobas, Breno C. F. Guimarães, and Fernando M. Q. Pereira. 2018. More Than Meets the Eye: Invisible Instructions. In Proceedings of the XXII Brazilian Symposium on Programming Languages(SBLP '18). ACM, New York, NY, USA, 27--34.DOI:http://dx.doi.org/10.1145/3264637.3264641",
      "doi": ""
    },
    {
      "text": "Barbara Leporini, Maria Claudia Buzzi, and MarinaBuzzi. 2012. Interacting with Mobile Devices via Voice Over: Usability and Accessibility Issues. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12). ACM, New York,NY, USA, 339--348. DOI: http://dx.doi.org/10.1145/2414536.2414591",
      "doi": "10.1145/2414536.2414591"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having aReally Bad PA\": The Gulf Between User Expectationand Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NewYork, NY, USA, 5286--5297. DOI: http://dx.doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Michal Luria, Samantha Reig, Xiang Zhi Tan, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2019. Re-Embodiment and Co-Embodiment: Exploration of Social Presence for Robots and Conversational Agents. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, New York, NY,USA, 633--644. DOI: http://dx.doi.org/10.1145/3322276.3322340",
      "doi": "10.1145/3322276.3322340"
    },
    {
      "text": "Sarah Mennicken, Oliver Zihler, Frida Juldaschewa,Veronika Molnar, David Aggeler, and Elaine MayHuang. 2016. \"It's Like Living with a Friendly Stranger\": Perceptions of Personality Traits in a Smart Home. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 120--131. DOI: http://dx.doi.org/10.1145/2971648.2971757",
      "doi": "10.1145/2971648.2971757"
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L. Vu. 2015. Privacy Concerns for Use of Voice Activated PersonalAssistant in the Public Space. International Journal of Human-Computer Interaction 31, 4 (2015), 307--335. DOI: http://dx.doi.org/10.1080/10447318.2014.986642",
      "doi": ""
    },
    {
      "text": "Ted McCarthy MSc, Joyojeet Pal PhD, and Edward Cutrell PhD. 2013. The \"Voice\" Has It: ScreenReader Adoption and Switching Behavior Among Vision Impaired Persons in India. Assistive Technology 25, 4 (2013), 222--229. DOI: http://dx.doi.org/10.1080/10400435.2013.768719PMID: 24620705.",
      "doi": ""
    },
    {
      "text": "Emma Murphy, Ravi Kuber, Graham McAllister, Philip Strain, and Wai Yu. 2008. An empirical investigation into the difficulties experienced by visually impaired Internet users. Universal Access in the Information Society 7, 1 (01 Apr 2008), 79--91. DOI: http://dx.doi.org/10.1007/s10209-007-0098--4",
      "doi": ""
    },
    {
      "text": "Clifford Ivar Nass and Scott Brave. 2005. Wired forspeech: How voice activates and advances the human-computer relationship. MIT press Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Naver. Accessed 2019. Clova. (Accessed 2019). https://clova.ai/ko.",
      "doi": ""
    },
    {
      "text": "NVDA. Accessed 2019. NV Access. (Accessed 2019). https://www.nvaccess.org/.",
      "doi": ""
    },
    {
      "text": "Cathy Pearl. 2016. Designing Voice User Interfaces: Principles of Conversational Experiences. \"O'Reilly Media, Inc.\".",
      "doi": "10.5555/3086829"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 640, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "François Portet, Michel Vacher, Caroline Golanski, Camille Roux, and Brigitte Meillon. 2013. Design and Evaluation of a Smart Home Voice Interface for the Elderly: Acceptability and Objection Aspects. Personal Ubiquitous Comput. 17, 1 (Jan. 2013), 127--144. DOI: http://dx.doi.org/10.1007/s00779-011-0470--5",
      "doi": "10.1007/s00779-011-0470-5"
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. \"Accessibility Came by Accident\": Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHIConference on Human Factors in Computing Systems(CHI '18). ACM, New York, NY, USA, Article 459, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174033",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "Amanda Purington, Jessie G. Taft, Shruti Sannon,Natalya N. Bazarova, and Samuel Hardman Taylor. 2017. \"Alexa is My New BFF\": Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA '17). ACM, New York, NY, USA, 2853--2859. DOI: http://dx.doi.org/10.1145/3027063.3053246",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Aung Pyae and Tapani N. Joelsson. 2018. Investigating the Usability and User Experiences of Voice User Interface: A Case of Google Home Smart Speaker. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '18). ACM, New York, NY, USA, 127--131. DOI: http://dx.doi.org/10.1145/3236112.3236130",
      "doi": "10.1145/3236112.3236130"
    },
    {
      "text": "Dragon Speech Recognition. Accessed 2019. Get MoreDone by Voice | Nuance. (Accessed 2019). https://www.nuance.com/dragon.html/.",
      "doi": ""
    },
    {
      "text": "Kambiz Saffarizadeh, Maheshwar Boodraj, and Tawfiq M Alashoor. 2017. Conversational assistants: investigating privacy concerns, trust, and self-disclosure.(2017).",
      "doi": ""
    },
    {
      "text": "Freedom Scientific. Accessed 2019. JAWS. (Accessed2019). https://www.freedomscientific.com/products/software/.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I.Hong. 2018. \"Hey Alexa, What's Up?\": AMixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 857--868. DOI: http://dx.doi.org/10.1145/3196709.3196772",
      "doi": ""
    },
    {
      "text": "Waseem Sheikh, Dave Schleppenbach, and Dennis Leas. 2018. Math Speak: a non-ambiguous language for audio rendering of MathML. International Journal of Learning Technology 13, 1 (2018), 3--25.",
      "doi": ""
    },
    {
      "text": "Derrick W. Smith and Stacy M. Kelly. 2014. Chapter Two - Assistive Technology for Students with Visual Impairments: A Research Agenda. InCurrent Issues in the Education of Students with Visual Impairments, Deborah D. Hatton (Ed.). International Review of Research in Developmental Disabilities, Vol. 46. Academic Press, 23 -- 53. DOI: http://dx.doi.org/https://doi.org/10.1016/B978-0--12--420039--5.00003--4",
      "doi": ""
    },
    {
      "text": "Jaeyoon Song, Kiroong Choe, Jaemin Jo, and Jinwook Seo. 2019. Sound Glance: Briefing the Glanceable Cuesof Web Pages for Screen Reader Users. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Article LBW1821, 6 pages. DOI:http://dx.doi.org/10.1145/3290607.3312865",
      "doi": ""
    },
    {
      "text": "Amanda Stent, Ann Syrdal, and Taniya Mishra. 2011. On the Intelligibility of Fast Synthesized Speech for Individuals with Early-onset Blindness. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS'11). ACM, New York, NY, USA, 211--218. DOI:http://dx.doi.org/10.1145/2049536.2049574",
      "doi": ""
    },
    {
      "text": "Isaac Wang, Jesse Smith, and Jaime Ruiz. 2019. Exploring Virtual Agents for Augmented Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 281, 12 pages. DOI:http://dx.doi.org/10.1145/3290605.3300511",
      "doi": "10.1145/3290605.3300511"
    },
    {
      "text": "Jacqueline M. Kory Westlund, Hae Won Park, Randi Williams, and Cynthia Breazeal. 2018. Measuring Young Children's Long-term Relationships with SocialRobots. In Proceedings of the 17th ACM Conference onInteraction Design and Children (IDC '18). ACM, NewYork, NY, USA, 207--218. DOI: http://dx.doi.org/10.1145/3202185.3202732",
      "doi": "10.1145/3202185.3202732"
    },
    {
      "text": "Linda Wulf, Markus Garschall, Julia Himmelsbach, and Manfred Tscheligi. 2014. Hands Free - Care Free:Elderly People Taking Advantage of Speech-only Interaction. In Proceedings of the 8th Nordic Conferenceon Human-Computer Interaction: Fun, Fast,Foundational (NordiCHI '14). ACM, New York, NY, USA, 203--206. DOI: http://dx.doi.org/10.1145/2639189.2639251",
      "doi": "10.1145/2639189.2639251"
    },
    {
      "text": "Masahide Yuasa, Naoki Mukawa, Koji Kimura, Hiroko Tokunaga, and Hitoshi Terai. 2010. An Utterance Attitude Model in Human-agent Communication: From Good Turn-taking to Better Human-agent Understanding. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, New York, NY, USA, 3919--3924. DOI:http://dx.doi.org/10.1145/1753846.1754079",
      "doi": "10.1145/1753846.1754079"
    },
    {
      "text": "Yu Zhong, T. V. Raman, Casey Burkhardt, Fadi Biadsy, and Jeffrey P. Bigham. 2014. Just Speak: Enabling Universal Voice Control on Android. In Proceedings of the 11th Web for All Conference (W4A '14). ACM, New York, NY, USA, Article 36, 4 pages. DOI:http://dx.doi.org/10.1145/2596695.2596720",
      "doi": ""
    },
    {
      "text": "Randall Ziman and Greg Walsh. 2018. Factors Affecting Seniors' Perceptions of Voice-enabled User Interfaces. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article LBW 591, 6 pages. DOI:http://dx.doi.org/10.1145/3170427.3188575",
      "doi": ""
    }
  ]
}