{
  "doi": "10.1145/3313831.3376202",
  "title": "G-ID: Identifying 3D Prints Using Slicing Parameters",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We present G-ID, a method that utilizes the subtle patterns left by the 3D printing process to distinguish and identify objects that otherwise look similar to the human eye. The key idea is to mark different instances of a 3D model by varying slicing parameters that do not change the model geometry but can be detected as machine-readable differences in the print. As a result, G-ID does not add anything to the object but exploits the patterns appearing as a by-product of slicing, an essential step of the 3D printing pipeline. We introduce the G-ID slicing and labeling interface that varies the settings for each instance, and the G-ID mobile app, which uses image processing techniques to retrieve the parameters and their associated labels from a photo of the 3D printed object. Finally, we evaluate our method's accuracy under different lighting conditions, when objects were printed with different filaments and printers, and with pictures taken from various positions and angles.",
  "tags": [
    "personal fabrication",
    "identification",
    "tags",
    "3d printing",
    "making"
  ],
  "authors": [
    {
      "name": "Mustafa Doga Dogan",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-99659366162/rel-imgonly/mustafa_doga_dogan2.jpg",
      "acmid": "99659366162",
      "orcid": "missing"
    },
    {
      "name": "Faraz Faruqi",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528434",
      "orcid": "missing"
    },
    {
      "name": "Andrew Day Churchill",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526859",
      "orcid": "missing"
    },
    {
      "name": "Kenneth Friedman",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636065",
      "orcid": "missing"
    },
    {
      "name": "Leon Cheng",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526700",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    },
    {
      "name": "Stefanie Mueller",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    }
  ],
  "references": [
    {
      "text": "Marc Alexa, Kristian Hildebrand, and Sylvain Lefebvre. 2017. Optimal discrete slicing. ACM Trans. Graph. 36, 1. https://doi.org/10.1145/2999536",
      "doi": "10.1145/3072959.2999536"
    },
    {
      "text": "Daniel G. Aliaga and Mikhail J. Atallah. 2009. Genuinity signatures: Designing signatures for verifying 3D object genuinity. Computer Graphics Forum 28, 2: 437--446. https://doi.org/10.1111/j.14678659.2009.01383.x",
      "doi": ""
    },
    {
      "text": "Vahid Babaei, Kiril Vidime, Michael Foshey, Alexandre Kaspar, Piotr Didyk, and Wojciech Matusik. 2017. Color contoning for 3D printing. ACM Trans. Graph. 36, 4: 124:1--124:15. https://doi.org/10.1145/3072959.3073605",
      "doi": "10.1145/3072959.3073605"
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal fabrication. Foundations and Trends in Human-Computer Interaction 10, 3--4: 165--293. https://doi.org/10.1561/1100000055",
      "doi": ""
    },
    {
      "text": "Fei Chen, Yuxi Luo, Nektarios Georgios Tsoutsos, Michail Maniatakos, Khaled Shahin, and Nikhil Gupta. 2018. Embedding tracking codes in additive manufactured parts for product authentication. Advanced Engineering Materials 0, 0: 1800495. https://doi.org/10.1002/adem.201800495",
      "doi": ""
    },
    {
      "text": "Haiyong Chen, Yue Pang, Qidi Hu, and Kun Liu. 2018b. Solar Cell Surface Defect Inspection Based on Multispectral Convolutional Neural Network. Journal of Intelligent Manufacturing (12 2018), 1--16.",
      "doi": ""
    },
    {
      "text": "Hung-Kuo Chu, Chia-Sheng Chang, Ruen-Rone Lee, and Niloy J. Mitra. 2013. Halftone QR codes. ACM Trans. Graph. 32, 6: 217:1--217:8. https://doi.org/10.1145/2508363.2508408",
      "doi": "10.1145/2508363.2508408"
    },
    {
      "text": "Adam Dachowicz, Siva Chaitanya Chaduvula, Mikhail Atallah, and Jitesh H. Panchal. 2017. Microstructurebased counterfeit detection in metal part manufacturing. JOM 69, 11: 2390--2396. https://doi.org/10.1007/s11837-017--2502--8",
      "doi": ""
    },
    {
      "text": "Csaba Domokos and Zoltan Kato. 2010. Parametric estimation of affine deformations of planar shapes. Pattern Recogn. 43, 3 (March 2010), 569--578. http://dx.doi.org/10.1016/j.patcog.2009.08.013",
      "doi": "10.1016/j.patcog.2009.08.013"
    },
    {
      "text": "Csaba Domokos and Zoltan Kato. 2012. Simultaneous affine registration of multiple shapes. In 21st International Conference on Pattern Recognition (ICPR). IEEE Computer Society, Los Alamitos, CA, 9--12",
      "doi": ""
    },
    {
      "text": "M. Fiala. 2005. ARTag, a fiducial marker system using digital techniques. In 2005 IEEE computer society conference on computer vision and pattern recognition (cvpr'05), 590--596 vol. 2. https://doi.org/10.1109/CVPR.2005.74",
      "doi": ""
    },
    {
      "text": "Paul Filiatrault. 2009. Does colour-coded labelling reduce the risk of medication errors? Canadian Journal of Hospital Pharmacy 62, 2: 154--155. https://doi.org/10.4212/cjhp.v62i2.446",
      "doi": ""
    },
    {
      "text": "Formlabs. SLA vs. DLP. https://formlabs.com/blog/3dprinting-technology-comparison-sla-dlp/",
      "doi": ""
    },
    {
      "text": "Blaise Gassend, Dwaine Clarke, Marten van Dijk, and Srinivas Devadas. 2002. Silicon physical random functions. In Proceedings of the 9th ACM conference on computer and communications security (CCS '02), 148--160. https://doi.org/10.1145/586110.586132",
      "doi": "10.1145/586110.586132"
    },
    {
      "text": "Tony Hall and Liam Bannon. 2005. Designing ubiquitous computing to enhance children's interaction in museums. In Proceedings of the 2005 conference on interaction design and children (IDC '05), 62--69. https://doi.org/10.1145/1109540.1109549",
      "doi": "10.1145/1109540.1109549"
    },
    {
      "text": "Chris Harrison, Robert Xiao, and Scott Hudson. 2012. Acoustic barcodes: Passive, durable and inexpensive notched identification tags. In Proceedings of the 25th annual ACM symposium on user interface software and technology (UIST '12), 563--568. https://doi.org/10.1145/2380116.2380187",
      "doi": "10.1145/2380116.2380187"
    },
    {
      "text": "Liang He, Gierad Laput, Eric Brockmeyer, and Jon E. Froehlich. 2017. SqueezaPulse: Adding interactive input to fabricated objects using corrugated tubes and air pulses. In Proceedings of the eleventh international conference on tangible, embedded, and embodied interaction (TEI '17), 341--350. https://doi.org/10.1145/3024969.3024976",
      "doi": ""
    },
    {
      "text": "J. Hou, D. Kim, and H. Lee. 2017. Blind 3D mesh watermarking for 3D printed model by analyzing layering artifact. IEEE Transactions on Information Forensics and Security 12, 11: 2712--2725. https://doi.org/10.1109/TIFS.2017.2718482",
      "doi": "10.1109/TIFS.2017.2718482"
    },
    {
      "text": "Jong-Uk Hou, Do-Gon Kim, Sunghee Choi, and Heung-Kyu Lee. 2015. 3D print-scan resilient watermarking using a histogram-based circular shift coding structure. In Proceedings of the 3rd ACM workshop on information hiding and multimedia security,115--121. https://doi.org/10.1145/2756601.2756607",
      "doi": "10.1145/2756601.2756607"
    },
    {
      "text": "Meng-Ju Hsieh, Rong-Hao Liang, Da-Yuan Huang, Jheng-You Ke, and Bing-Yu Chen. 2018. RFIBricks: Interactive building blocks based on RFID. In Proceedings of the 2018 CHI conference on human factors in computing systems (CHI '18), 189:1--189:10. https://doi.org/10.1145/3173574.3173763",
      "doi": "10.1145/3173574.3173763"
    },
    {
      "text": "3D Hubs. https://www.3dhubs.com/",
      "doi": ""
    },
    {
      "text": "Z. C. Kennedy, D. E. Stephenson, J. F. Christ, T. R. Pope, B. W. Arey, C. A. Barrett, and M. G. Warner. 2017. Enhanced anti-counterfeiting measures for additive manufacturing: Coupling lanthanide nanomaterial chemical signatures with blockchain technology. J. Mater. Chem. C 5, 37: 9570--9578. https://doi.org/10.1039/C7TC03348F",
      "doi": ""
    },
    {
      "text": "Ryosuke Kikuchi, Sora Yoshikawa, Pradeep Kumar Jayaraman, Jianmin Zheng, and Takashi Maekawa. 2018. Embedding QR codes onto b-spline surfaces for 3D printing. Computer-Aided Design 102: 215--223. https://doi.org/10.1016/j.cad.2018.04.025",
      "doi": "10.1016/j.cad.2018.04.025"
    },
    {
      "text": "Yuki Kubo, Kana Eguchi, Ryosuke Aoki, Shigekuni Kondo, Shozo Azuma, and Takuya Indo. 2019. FabAuth: Printed objects identification using resonant properties of their inner structures. In Extended Abstracts of the 2019 CHI conference on human factors in computing systems (CHI EA '19), LBW2215:1-- LBW2215:6. https://doi.org/10.1145/3290607.3313005",
      "doi": "10.1145/3290607.3313005"
    },
    {
      "text": "Dingzeyu Li, David I. W. Levin, Wojciech Matusik, and Changxi Zheng. 2016. Acoustic voxels: Computational optimization of modular acoustic filters. ACM Trans. Graph. 35, 4: 88:1--88:12. https://doi.org/10.1145/2897824.2925960",
      "doi": "10.1145/2897824.2925960"
    },
    {
      "text": "Dingzeyu Li, Avinash S. Nair, Shree K. Nayar, and Changxi Zheng. 2017. AirCode: Unobtrusive physical tags for digital fabrication. In Proceedings of the 30th annual ACM symposium on user interface software and technology (UIST '17), 449--460. https://doi.org/10.1145/3126594.3126635",
      "doi": "10.1145/3126594.3126635"
    },
    {
      "text": "Zhengxiong Li, Aditya Singh Rathore, Chen Song, Sheng Wei, Yanzhi Wang, and Wenyao Xu. 2018. PrinTracker: Fingerprinting 3D printers using commodity scanners. In Proceedings of the 2018 ACM sigsac conference on computer and communications security (CCS '18), 1306--1323. https://doi.org/10.1145/3243734.3243735",
      "doi": "10.1145/3243734.3243735"
    },
    {
      "text": "Henrique Teles Maia, Dingzeyu Li, Yuan Yang, and Changxi Zheng. 2019. LayerCode: Optical barcodes for 3D printed shapes. ACM Trans. Graph. 38, 4: 112:1--112:14. https://doi.org/10.1145/3306346.3322960",
      "doi": "10.1145/3306346.3322960"
    },
    {
      "text": "Makexyz, LLC. https://www.makexyz.com/",
      "doi": ""
    },
    {
      "text": "Kasper Marstal, Floris F. Berendsen, Marius Staring, and Stefan Klein. 2016. SimpleElastix: A userfriendly, multi-lingual library for medical image registration. 2016 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW): 574-- 582.",
      "doi": ""
    },
    {
      "text": "A. Mittal. 2017. Generating visually appealing QR codes using colour image embedding. The Imaging Science Journal 65, 1: 1--13. https://doi.org/10.1080/13682199.2016.1241941",
      "doi": ""
    },
    {
      "text": "National Optical Astronomy Observatory (NOAO). Recommended light levels (illuminance) for outdoor and indoor venues. Association of Universities for Research in Astronomy. Retrieved from https://www.noao.edu/education/QLTkit/ACTIVITY_Documents/Safety/LightLevels_outdo or indoor.pdf",
      "doi": ""
    },
    {
      "text": "Nintendo Amiibo. Retrieved from https://www.nintendo.com/amiibo/",
      "doi": ""
    },
    {
      "text": "NiteCore Tini. Retrieved from https://flashlight.nitecore.com/product/tini",
      "doi": ""
    },
    {
      "text": "Fei Peng, Jing Yang, Zi-Xing Lin, and Min Long. 2019. Source identification of 3D printed objects based on inherent equipment distortion. Computers & Security 82: 173--183. https://doi.org/http://doi.org/10.1016/j.cose.2018.12.01",
      "doi": ""
    },
    {
      "text": "Siyuan Qiao, Xiaoxin Fang, Bin Sheng, Wen Wu, and Enhua Wu. 2015. Structure-aware QR code abstraction. Vis. Comput. 31, 6--8: 1123--1133. https://doi.org/10.1007/s00371-015--1107-x.",
      "doi": "10.1007/s00371-015-1107-x"
    },
    {
      "text": "Tim Reiner, Nathan Carr, Radomír Mech, Ondrej St'ava, Carsten Dachsbacher, and Gavin Miller. 2014. Dual-color mixing for fused deposition modeling printers. Comput. Graph. Forum 33, 2: 479--486. https://doi.org/10.1111/cgf.12319",
      "doi": "10.1111/cgf.12319"
    },
    {
      "text": "M. S. Rzeszotarski, F. L. Royer, and G. C. Gilmore. 1983. Introduction to two-dimensional Fourier analysis. Behavior Research Methods & Instrumentation 15, 2: 308--318. https://doi.org/10.3758/BF03203566",
      "doi": ""
    },
    {
      "text": "Martin Schmitz, Martin Herbers, Niloofar Dezfuli, Sebastian Günther, and Max Mühlhäuser. 2018. Off-line sensing: Memorizing interactions in passive 3Dprinted objects. In Proceedings of the 2018 chi conference on human factors in computing systems (CHI '18), 182:1--182:8. https://doi.org/10.1145/3173574.3173756",
      "doi": "10.1145/3173574.3173756"
    },
    {
      "text": "Ruchir Y Shah, Prajesh N Prajapati, and Y K Agrawal. 2010. Anticounterfeit packaging technologies. Journal of Advanced Pharmaceutical Technology & Research 1, 4: 368--373. https://doi.org/10.4103/01105558.76434",
      "doi": ""
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and talker: An accessible labeling toolkit for 3D printed models. In Proceedings of the 2016 chi conference on human factors in computing systems (CHI '16), 4896--4907. https://doi.org/10.1145/2858036.2858507",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Piyarat Silapasuphakornwong, Masahiro Suzuki, Hiroshi Unno, Hideyuki Torii, Kazutake Uehira, and Youichi Takashima. 2016. Nondestructive readout of copyright information embedded in objects fabricated with 3-d printers. In Digital-forensics and watermarking, 232--238.",
      "doi": ""
    },
    {
      "text": "Samsung ISOCELL Bright HMX. https://www.samsung.com/semiconductor/image-sensor/mobile-imagesensor/S5KHMX/",
      "doi": ""
    },
    {
      "text": "Chen Song, Zhengxiong Li, Wenyao Xu, Chi Zhou, Zhanpeng Jin, and Kui Ren. 2018. My smartphone recognizes genuine QR codes!: Practical unclonable qr code via 3D printing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2: 83:1--83:20. https://doi.org/10.1145/3214286",
      "doi": "10.1145/3214286"
    },
    {
      "text": "Hai-Chuan Song and Sylvain Lefebvre. 2017. Colored fused filament fabrication. CoRR abs/1709.09689. Retrieved from http://arxiv.org/abs/1709.09689",
      "doi": ""
    },
    {
      "text": "Andrew Spielberg, Alanson Sample, Scott E. Hudson, Jennifer Mankoff, and James McCann. 2016. RapID: A framework for fabricating low-latency interactive objects with RFID tags. In Proceedings of the 2016 chi conference on human factors in computing systems (CHI '16), 5897--5908. https://doi.org/10.1145/2858036.2858243",
      "doi": "10.1145/2858036.2858243"
    },
    {
      "text": "Carlos Tejada, Osamu Fujimoto, Zhiyuan Li, and Daniel Ashbrook. 2018. Blowhole: Blowing-activated tags for interactive 3D-printed models. In Proceedings of graphics interface 2018 (GI 2018), 131--137. https://doi.org/10.20380/GI2018.18",
      "doi": ""
    },
    {
      "text": "Thingiverse. https://www.thingiverse.com/",
      "doi": ""
    },
    {
      "text": "Rachel Thomas. 2017. Fourier transforms of images. Plus. Retrieved from https://plus.maths.org/content/fourier-transforms-images",
      "doi": ""
    },
    {
      "text": "Kazutake Uehira, Masahiro Suzuki, Piyarat Silapasuphakornwong, Hideyuki Torii, and Youichi Takashima. 2017. Copyright protection for 3D printing by embedding information inside 3D-printed objects. In Digital forensics and watermarking, 370--378.",
      "doi": ""
    },
    {
      "text": "Ultimaker. 2019. CuraEngine. GitHub. Retrieved from https://github.com/Ultimaker/CuraEngine",
      "doi": ""
    },
    {
      "text": "Ingrid Verbauwhede and Roel Maes. 2011. Physically unclonable functions: Manufacturing variability as an unclonable device identifier. In Proceedings of the 21st edition of the great lakes symposium on great lakes symposium on VLSI (GLSVLSI '11), 455--460. https://doi.org/10.1145/1973009.1973111",
      "doi": "10.1145/1973009.1973111"
    },
    {
      "text": "Karl D. D. Willis and Andrew D. Wilson. 2013. InfraStructs: Fabricating information inside physical objects for imaging in the terahertz region. ACM Trans. Graph. 32, 4: 138:1--138:10. https://doi.org/10.1145/2461912.2461936",
      "doi": "10.1145/2461912.2461936"
    },
    {
      "text": "Zhe Yang, Yuting Bao, Chuhao Luo, Xingya Zhao, Siyu Zhu, Chunyi Peng, Yunxin Liu, and Xinbing Wang. 2016. ARTcode: Preserve art and code in any image. In Proceedings of the 2016 ACM international joint conference on pervasive and ubiquitous computing (UbiComp '16), 904--915. https://doi.org/10.1145/2971648.2971733",
      "doi": "10.1145/2971648.2971733"
    },
    {
      "text": "Nikoleta Yiannoutsou, Ioanna Papadimitriou, Vassilis Komis, and Nikolaos Avouris. 2009. ?Playing with\" museum exhibits: Designing educational games mediated by mobile technology. In Proceedings of the 8th international conference on interaction design and children (IDC '09), 230--233. https://doi.org/10.1145/1551788.1551837",
      "doi": "10.1145/1551788.1551837"
    },
    {
      "text": "Qinbang Zhou, Renwen Chen, Huang Bin, Chuan Liu, Jie Yu, and Xiaoqing Yu. 2019. An Automatic Surface Defect Inspection System for Automobiles Using Machine Vision Methods. Sensors 19 (02 2019), 644.",
      "doi": ""
    },
    {
      "text": "Qingnan Zhou and Alec Jacobson. 2016. Thingi10K: A Dataset of 10,000 3D-Printing Models. arXiv preprint arXiv:1605.04797 (2016).",
      "doi": ""
    }
  ]
}