{
  "doi": "10.1145/3313831.3376163",
  "title": "Does Smartphone Use Drive our Emotions or vice versa? A Causal Analysis",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper, we demonstrate the existence of a bidirectional causal relationship between smartphone application use and user emotions. In a two-week long in-the-wild study with 30 participants we captured 502,851 instances of smartphone application use in tandem with corresponding emotional data from facial expressions. Our analysis shows that while in most cases application use drives user emotions, multiple application categories exist for which the causal effect is in the opposite direction. Our findings shed light on the relationship between smartphone use and emotional states. We furthermore discuss the opportunities for research and practice that arise from our findings and their potential to support emotional well-being.",
  "tags": [
    "mobile interaction",
    "emotional well-being",
    "emotion detection",
    "emotions",
    "smartphones",
    "mobile application use"
  ],
  "authors": [
    {
      "name": "Zhanna Sarsenbayeva",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659071217",
      "orcid": "missing"
    },
    {
      "name": "Gabriele Marini",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320516",
      "orcid": "missing"
    },
    {
      "name": "Niels van Berkel",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/do/10.1145/contrib-99658743711/rel-imgonly/niels_van_berkel_2022.jpg",
      "acmid": "99658743711",
      "orcid": "0000-0001-5106-7692"
    },
    {
      "name": "Chu Luo",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-99658747844/rel-imgonly/7025643.jpeg",
      "acmid": "99658747844",
      "orcid": "missing"
    },
    {
      "name": "Weiwei Jiang",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-99659319971/rel-imgonly/me.jpg",
      "acmid": "99659319971",
      "orcid": "missing"
    },
    {
      "name": "Kangning Yang",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526614",
      "orcid": "missing"
    },
    {
      "name": "Greg Wadley",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81309499961/rel-imgonly/greg.jpg",
      "acmid": "81309499961",
      "orcid": "0000-0003-4230-3440"
    },
    {
      "name": "Tilman Dingler",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81472653974/rel-imgonly/lichtbild.jpg",
      "acmid": "81472653974",
      "orcid": "0000-0001-6180-7033"
    },
    {
      "name": "Vassilis Kostakos",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100283202/rel-imgonly/vassilis_kostakos2.jpg",
      "acmid": "81100283202",
      "orcid": "missing"
    },
    {
      "name": "Jorge Goncalves",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488650470",
      "orcid": "0000-0002-0117-0322"
    }
  ],
  "references": [
    {
      "text": "Amelia Aldao, Susan Nolen-Hoeksema, and Susanne Schweizer. 2010. Emotion-regulation strategies across psychopathology: A meta-analytic review. Clinical psychology review 30, 2 (2010), 217--237.",
      "doi": ""
    },
    {
      "text": "Siamak Aram, Amedeo Troiano, and Eros Pasero. 2012. Environment sensing using smartphone. In 2012 IEEE Sensors Applications Symposium Proceedings. IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L. Cox, and Yunan Chen. 2017. Quantifying the body and caring for the mind: self-tracking in multiple sclerosis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6889--6901.",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Jeremy N. Bailenson, Nick Yee, Scott Brave, Dan Merget, and David Koslow. 2007. Virtual interpersonal touch: expressing and recognizing emotions through haptic devices. Human--Computer Interaction 22, 3 (2007), 325--353.",
      "doi": "10.5555/1466603.1466606"
    },
    {
      "text": "Eytan Bakshy, Solomon Messing, and Lada A. Adamic. 2015. Exposure to ideologically diverse news and opinion on Facebook. Science 348, 6239 (2015), 1130--1132.",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, and Gabriela Marcu. 2012. The MONARCA self-assessment system: a persuasive personal monitoring system for bipolar patients. In Proceedings of the 2nd ACM SIGHIT International Health Informatics Symposium. ACM, 21--30.",
      "doi": "10.1145/2110363.2110370"
    },
    {
      "text": "Adriana Bianchi and James G. Phillips. 2005. Psychological predictors of problem mobile phone use. CyberPsychology & Behavior 8, 1 (2005), 39--51.",
      "doi": ""
    },
    {
      "text": "Nataly Birbeck, Shaun Lawson, Kellie Morrissey, Tim Rapley, and Patrick Olivier. 2017. Self Harmony: rethinking hackathons to design and critique digital technologies for those affected by self-harm. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 146--157.",
      "doi": "10.1145/3025453.3025931"
    },
    {
      "text": "Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage. In Proceedings of the 13th international conference on Human computer interaction with mobile devices and services. ACM, 47--56.",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Tibor Bosse and Frank P.J. De Lange. 2008. Estimating emotion regulation capabilities. In Proceedings of the 1st international conference on PErvasive Technologies Related to Assistive Environments. ACM, 93.",
      "doi": ""
    },
    {
      "text": "Michelle Nicole Burns, Mark Begale, Jennifer Duffecy, Darren Gergle, Chris J. Karr, Emily Giangrande, and David C. Mohr. 2011. Harnessing context sensing to develop a mobile intervention for depression. Journal of medical Internet research 13, 3 (2011).",
      "doi": ""
    },
    {
      "text": "Paul Cairns, Pratyush Pandab, and Christopher Power. 2014. The influence of emotion on number entry errors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2293--2296.",
      "doi": "10.1145/2556288.2557065"
    },
    {
      "text": "Rafael A. Calvo, Sidney D'Mello, Jonathan Matthew Gratch, and Arvid Kappas. 2015. The Oxford handbook of affective computing. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Scott A. Cambo, Daniel Avrahami, and Matthew L. Lee. 2017. BreakSense: Combining physiological and location sensing to promote mobility during work-breaks. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3595--3607.",
      "doi": ""
    },
    {
      "text": "John M. Carroll. 1997. Human-computer interaction: psychology as a science of design. Annual review of psychology 48, 1 (1997), 61--83.",
      "doi": ""
    },
    {
      "text": "Keng-hao Chang, Drew Fisher, John Canny, and Björn Hartmann. 2011. How's my mood and stress?: an efficient speech analysis library for unobtrusive monitoring on mobile phones. In Proceedings of the 6th International Conference on Body Area Networks. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 71--77.",
      "doi": ""
    },
    {
      "text": "Weixuan Chen and Rosalind W. Picard. 2017. Eliminating physiological information from facial videos. In Automatic Face & Gesture Recognition (FG 2017), 2017 12th IEEE International Conference on. IEEE, 48--55.",
      "doi": ""
    },
    {
      "text": "Erika Chuang and Christoph Bregler. 2005. Mood swings: expressive speech animation. ACM Transactions on Graphics (TOG) 24, 2 (2005), 331--347.",
      "doi": "10.1145/1061347.1061355"
    },
    {
      "text": "Emily Collins and Anna L. Cox. 2014. Switch on to games: Can digital games aid post-work recovery? International Journal of Human-Computer Studies 72, 8--9 (2014), 654--662.",
      "doi": "10.1016/j.ijhcs.2013.12.006"
    },
    {
      "text": "Stephen A. Coombes, Christopher M. Janelle, and Aaron R. Duley. 2005. Emotion and motor control: Movement attributes following affective picture processing. Journal of motor behavior 37, 6 (2005), 425--436.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Reed Larson. 2014. Validity and Reliability of the Experience-Sampling Method. Springer Netherlands, Dordrecht, 35--54. DOI: http://dx.doi.org/10.1007/978--94-017--9088--8_3",
      "doi": ""
    },
    {
      "text": "Raymond J. Dolan. 2002. Emotion, cognition, and behavior. Science 298, 5596 (2002), 1191--1194.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace V. Friesen. 1976. Measuring facial movement. Environmental psychology and nonverbal behavior 1, 1 (1976), 56--75.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Dacher Keltner. 1997. Universal facial expressions of emotion. Segerstrale U, P. Molnar P, eds. Nonverbal communication: Where nature meets culture (1997), 27--46.",
      "doi": ""
    },
    {
      "text": "Clayton Epp, Michael Lippold, and Regan L. Mandryk. 2011. Identifying emotional states using keystroke dynamics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 715--724.",
      "doi": ""
    },
    {
      "text": "Hossein Falaki, Ratul Mahajan, Srikanth Kandula, Dimitrios Lymberopoulos, Ramesh Govindan, and Deborah Estrin. 2010. Diversity in smartphone usage. In Proceedings of the 8th international conference on Mobile systems, applications, and services. ACM, 179--194.",
      "doi": "10.1145/1814433.1814453"
    },
    {
      "text": "Denzil Ferreira, Jorge Goncalves, Vassilis Kostakos, Louise Barkhuus, and Anind K. Dey. 2014. Contextual experience sampling of mobile application micro-usage. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. ACM, 91--100.",
      "doi": ""
    },
    {
      "text": "Denzil Ferreira, Vassilis Kostakos, and Anind K. Dey. 2015. AWARE: mobile context instrumentation framework. Frontiers in ICT 2 (2015), 6.",
      "doi": ""
    },
    {
      "text": "Alan J. Fridlund. 2014. Human facial expression: An evolutionary view. Academic Press.",
      "doi": ""
    },
    {
      "text": "E. Friesen and Paul Ekman. 1978. Facial action coding system: a technique for the measurement of facial movement. Palo Alto 3 (1978).",
      "doi": ""
    },
    {
      "text": "Nico H. Frijda. 1986. The emotions. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Mads Frost, Gabriela Marcu, Rene Hansen, Karoly Szaántó, and Jakob E. Bardram. 2011. The MONARCA self-assessment system: Persuasive personal monitoring for bipolar patients. In 2011 5th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth) and Workshops. IEEE, 204--205.",
      "doi": ""
    },
    {
      "text": "Yuan Gao, Nadia Bianchi-Berthouze, and Hongying Meng. 2012. What does touch tell us about emotions in touchscreen-based gameplay? ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4 (2012), 31.",
      "doi": "10.1145/2395131.2395138"
    },
    {
      "text": "William W. Gaver. 1991. Technology Affordances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM, NY, NY, USA, 79--84. DOI: http://dx.doi.org/10.1145/108844.108856",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Leah Findlater, and Jacob O. Wobbrock. 2012. WalkType: Using Accelerometer Data to Accomodate Situational Impairments in Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2687--2696. DOI: http://dx.doi.org/10.1145/2207676.2208662",
      "doi": ""
    },
    {
      "text": "Jorge Goncalves, Pratyush Pandab, Denzil Ferreira, Mohammad Ghahramani, Guoying Zhao, and Vassilis Kostakos. 2014. Projective testing of diurnal collective emotion. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 487--497.",
      "doi": "10.1145/2632048.2636067"
    },
    {
      "text": "Kendall Goodrich and Marieke De Mooij. 2014. How 'social' are social media? A cross-cultural comparison of online and offline purchase decision influences. Journal of Marketing Communications 20, 1--2 (2014), 103--116.",
      "doi": ""
    },
    {
      "text": "C.W.J. Granger. 1988. Causality, cointegration, and control. Journal of Economic Dynamics and Control 12, 2 (1988), 551 -- 559. DOI: http://dx.doi.org/https://doi.org/10.1016/0165--1889(88)90055--3",
      "doi": ""
    },
    {
      "text": "James J. Gross. 1998. The emerging field of emotion regulation: An integrative review. Review of general psychology 2, 3 (1998), 271--299.",
      "doi": ""
    },
    {
      "text": "James J. Gross. 2015. Emotion regulation: Current status and future prospects. Psychological Inquiry 26, 1 (2015), 1--26.",
      "doi": ""
    },
    {
      "text": "James J. Gross and Oliver P. John. 2003. Individual differences in two emotion regulation processes: implications for affect, relationships, and well-being. Journal of personality and social psychology 85, 2 (2003), 348.",
      "doi": ""
    },
    {
      "text": "Richard L. Hazlett. 2006. Measuring Emotional Valence During Interactive Experiences: Boys at Video Game Play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1023--1026. DOI: http://dx.doi.org/10.1145/1124772.1124925",
      "doi": "10.1145/1124772.1124925"
    },
    {
      "text": "Chin-Lung Hsu and Hsi-Peng Lu. 2004. Why do people play on-line games? An extended TAM with social influences and flow experience. Information Management 41, 7 (2004), 853 -- 868. DOI: http://dx.doi.org/https://doi.org/10.1016/j.im.2003.08.014",
      "doi": "10.1016/j.im.2003.08.014"
    },
    {
      "text": "Galen Chin-Lun Hung, Pei-Ching Yang, Chia-Chi Chang, Jung-Hsien Chiang, and Ying-Yeh Chen. 2016. Predicting negative emotions based on mobile phone usage patterns: an exploratory study. JMIR research protocols 5, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Alice M. Isen, Andrew S. Rosenzweig, and Mark J. Young. 1991. The influence of positive affect on clinical problem solving. Medical Decision Making 11, 3 (1991), 221--227.",
      "doi": ""
    },
    {
      "text": "Mohamed Khamis, Anita Baier, Niels Henze, Florian Alt, and Andreas Bulling. 2018. Understanding Face and Eye Visibility in Front-Facing Cameras of Smartphones used in the Wild. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 280.",
      "doi": "10.1145/3173574.3173854"
    },
    {
      "text": "Preeti Khanna and Mukundan Sasikumar. 2010. Recognising emotions from keyboard stroke pattern. International journal of computer applications 11, 9 (2010), 1--5.",
      "doi": ""
    },
    {
      "text": "Adam D. Kramer, Jamie E. Guillory, and Jeffrey T. Hancock. 2014. Experimental evidence of massive-scale emotional contagion through social networks. Proceedings of the National Academy of Sciences 111, 24 (2014), 8788--8790.",
      "doi": ""
    },
    {
      "text": "Amanda E. Krause, Adrian C. North, and Lauren Y. Hewitt. 2015. Music-listening in everyday life: Devices and choice. Psychology of music 43, 2 (2015), 155--170.",
      "doi": ""
    },
    {
      "text": "Peter J. Lang, Mark K. Greenwald, Margaret M. Bradley, and Alfons O. Hamm. 1993. Looking at pictures: Affective, facial, visceral, and behavioral reactions. Psychophysiology 30, 3 (1993), 261--273.",
      "doi": ""
    },
    {
      "text": "Oliver Langner, Ron Dotsch, Gijsbert Bijlstra, Daniel H.J. Wigboldus, Skyler T. Hawk, and Ad Van Knippenberg. 2010. Presentation and validation of the Radboud Faces Database. Cognition and emotion 24, 8 (2010), 1377--1388.",
      "doi": ""
    },
    {
      "text": "Reed Larson, Bernard Hecker, and Julie Norem. 1985. Students' experience with research projects: Pains, enjoyment and success. The High School Journal 69, 1 (1985), 61--69.",
      "doi": ""
    },
    {
      "text": "Richard S. Lazarus. 1991. Emotion and adaptation. Oxford University Press on Demand.",
      "doi": ""
    },
    {
      "text": "Hosub Lee, Young Sang Choi, Sunjae Lee, and I.P. Park. 2012. Towards unobtrusive emotion recognition for affective social communication. In Consumer Communications and Networking Conference (CCNC), 2012 IEEE. IEEE, 260--264.",
      "doi": ""
    },
    {
      "text": "Peter Leijdekkers, Valerie Gay, and Frederick Wong. 2013. CaptureMyEmotion: A mobile app to improve emotion learning for autistic children using sensors. In Computer-Based Medical Systems (CBMS), 2013 IEEE 26th International Symposium on. IEEE, 381--384.",
      "doi": ""
    },
    {
      "text": "Robert LiKamWa, Yunxin Liu, Nicholas D. Lane, and Lin Zhong. 2013. Moodscope: Building a mood sensor from smartphone usage patterns. In Proceeding of the 11th annual international conference on Mobile systems, applications, and services. ACM, 389--402.",
      "doi": ""
    },
    {
      "text": "Manas K. Mandal, Rakesh Pandey, and Akhouri B. Prasad. 1998. Facial expressions of emotions and schizophrenia: a review. Schizophrenia bulletin 24, 3 (1998), 399--412.",
      "doi": ""
    },
    {
      "text": "Mitsuhiro Matsumoto, Ryozo Kiyohara, Hidenori Fukui, Masayuki Numao, and Satoshi Kurihara. 2008. Proposition of the context-aware interface for cellular phone operations. In Networked Sensing Systems, 2008. INSS 2008. 5th International Conference on. IEEE, 233--233.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology As Experience. Interactions 11, 5 (Sept. 2004), 42--43. DOI: http://dx.doi.org/10.1145/1015530.1015549",
      "doi": "10.1145/1015530.1015549"
    },
    {
      "text": "Daniel McDuff, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: A Cross-Platform Real-Time Multi-Face Expression Recognition Toolkit. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 3723--3726. DOI: http://dx.doi.org/10.1145/2851581.2890247",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Abhinav Mehrotra, Sandrine R. Müller, Gabriella M. Harari, Samuel D. Gosling, Cecilia Mascolo, Mirco Musolesi, and Peter J. Rentfrow. 2017a. Understanding the role of places and activities on mobile phone interaction and usage patterns. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 84.",
      "doi": "10.1145/3131901"
    },
    {
      "text": "Abhinav Mehrotra, Fani Tsapeli, Robert Hendley, and Mirco Musolesi. 2017b. MyTraces: investigating correlation and causation between users' emotional states and mobile phone interaction. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 83.",
      "doi": "10.1145/3130948"
    },
    {
      "text": "Alistair Morrison, Xiaoyu Xiong, Matthew Higgs, Marek Bell, and Matthew Chalmers. 2018. A Large-Scale Study of iPhone App Launch Behaviour. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 344.",
      "doi": "10.1145/3173574.3173918"
    },
    {
      "text": "Aske Mottelson and Kasper Hornbæk. 2016. An affect detection technique using mobile commodity sensors in the wild. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 781--792.",
      "doi": "10.1145/2971648.2971654"
    },
    {
      "text": "Jessica Gall Myrick. 2015. Emotion regulation, procrastination, and watching cat videos online: Who watches Internet cats, why, and to what effect? Computers in human behavior 52 (2015), 168--176.",
      "doi": "10.1016/j.chb.2015.06.001"
    },
    {
      "text": "Evangelos Niforatos and Evangelos Karapanos. 2015. EmoSnaps: a mobile application for emotion recall from facial expressions. Personal and Ubiquitous Computing 19, 2 (2015), 425--444.",
      "doi": "10.1007/s00779-014-0777-0"
    },
    {
      "text": "Donald A. Norman. 1986. Cognitive Engineering. Lawrence Erlbaum Associates, 31--61.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2004. Emotional design: Why we love (or hate) everyday things. Basic Civitas Books.",
      "doi": ""
    },
    {
      "text": "Michal Olszanowski, Grzegorz Pochwatko, Krzysztof Kuklinski, Michal Scibor-Rylski, Peter Lewinski, and Rafal K. Ohme. 2015. Warsaw set of emotional facial expression pictures: a validation study of facial display photographs. Frontiers in psychology 5 (2015), 1516.",
      "doi": ""
    },
    {
      "text": "Milan Palu, Anna Krakovská, Jozef Jakubík, and Martina Chvosteková. 2018. Causality, dynamical systems and the arrow of time. Chaos: An Interdisciplinary Journal of Nonlinear Science 28, 7 (2018), 075307.",
      "doi": ""
    },
    {
      "text": "Reinhard Pekrun, Thomas Goetz, Wolfram Titz, and Raymond P. Perry. 2002. Positive emotions in education. (2002).",
      "doi": ""
    },
    {
      "text": "Ella Peltonen, Eemil Lagerspetz, Jonatan Hamberg, Abhinav Mehrotra, Mirco Musolesi, Petteri Nurmi, and Sasu Tarkoma. 2018. The hidden image of mobile apps: geographic, demographic, and cultural factors in mobile usage. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 10.",
      "doi": "10.1145/3229434.3229474"
    },
    {
      "text": "Rosalind W. Picard. 2009. Future affective technology for autism and emotion communication. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3575--3584.",
      "doi": ""
    },
    {
      "text": "Ming-Zher Poh, Daniel J. McDuff, and Rosalind W. Picard. 2011. Advancements in noncontact, multiparameter physiological measurements using a webcam. IEEE transactions on biomedical engineering 58, 1 (2011), 7--11.",
      "doi": ""
    },
    {
      "text": "John P. Pollak, Phil Adams, and Geri Gay. 2011. PAM: a photographic affect meter for frequent, in situ measurement of affect. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 725--734.",
      "doi": "10.1145/1978942.1979047"
    },
    {
      "text": "Eric Postma and Marie Nilsenova. 2016. Measuring the causal dynamics of facial interaction. In Proceedings of the Cognitive Science Conference.",
      "doi": ""
    },
    {
      "text": "Michael J. Power and Tim Dalgleish. 1999. Handbook of cognition and emotion. Wiley.",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Shahid Ali, Tanzeem Choudhury, and Ethan Berke. 2011. Passive and in-situ assessment of mental and physical well-being using mobile sensors. In Proceedings of the 13th international conference on Ubiquitous computing. ACM, 385--394.",
      "doi": "10.1145/2030112.2030164"
    },
    {
      "text": "Johnmarshall Reeve. 2014. Understanding motivation and emotion. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "James A. Russell. 1980. A circumplex model of affect. Journal of personality and social psychology 39, 6 (1980), 1161.",
      "doi": ""
    },
    {
      "text": "Zhanna Sarsenbayeva, Denzil Ferreira, Niels van Berkel, Chu Luo, Mikko Vaisanen, Vassilis Kostakos, and Jorge Goncalves. 2017. Vision-based Happiness Inference: A Feasibility Case-study. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, NY, NY, USA, 494--499. DOI: http://dx.doi.org/10.1145/3123024.3124438",
      "doi": "10.1145/3123024.3124438"
    },
    {
      "text": "Zhanna Sarsenbayeva, Niels van Berkel, Danula Hettiachchi, Weiwei Jiang, Tilman Dingler, Eduardo Velloso, Vassilis Kostakos, and Jorge Goncalves. 2019. Measuring the Effects of Stress on Mobile Interaction. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1, Article 24 (March 2019), 18 pages. DOI: http://dx.doi.org/10.1145/3314411",
      "doi": "10.1145/3314411"
    },
    {
      "text": "Zhanna Sarsenbayeva, Niels van Berkel, Eduardo Velloso, Vassilis Kostakos, and Jorge Goncalves. 2018. Effect of Distinct Ambient Noise Types on Mobile Interaction. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2, Article 82 (July 2018), 23 pages. DOI: http://dx.doi.org/10.1145/3214285",
      "doi": "10.1145/3214285"
    },
    {
      "text": "Zhanna Sarsenbayeva, Niels van Berkel, Aku Visuri, Sirkka Rissanen, Hannu Rintamäki, Vassilis Kostakos, and Jorge Goncalves. 2017. Sensing Cold-Induced Situational Impairments in Mobile Interaction Using Battery Temperature. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 98 (Sept. 2017), 9 pages. DOI: http://dx.doi.org/10.1145/3130963",
      "doi": "10.1145/3130963"
    },
    {
      "text": "Nikolaos Savva and Nadia Bianchi-Berthouze. 2011. Automatic recognition of affective body movement in a video game scenario. In International Conference on Intelligent Technologies for interactive entertainment. Springer, 149--159.",
      "doi": ""
    },
    {
      "text": "Choonsung Shin, Jin-Hyuk Hong, and Anind K. Dey. 2012. Understanding and prediction of mobile application usage for smart phones. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 173--182.",
      "doi": ""
    },
    {
      "text": "Thiago H. Silva, Pedro O.S. Vaz de Melo, Jussara M. Almeida, Mirco Musolesi, and Antonio A.F. Loureiro. 2014. You are what you eat (and drink): Identifying cultural boundaries by analyzing food and drink habits in foursquare. In Eighth International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Wook Song, Yeseong Kim, Hakbong Kim, Jehun Lim, and Jihong Kim. 2014. Personalized optimization for android smartphones. ACM Transactions on Embedded Computing Systems (TECS) 13, 2s (2014), 60.",
      "doi": "10.1145/2544375.2544380"
    },
    {
      "text": "Aaron Springer, Victoria Hollis, and Steve Whittaker. 2018. Mood modeling: accuracy depends on active logging and reflection. Personal and Ubiquitous Computing 22, 4 (2018), 723--737.",
      "doi": "10.1007/s00779-018-1123-8"
    },
    {
      "text": "Sabrina Stöckli, Michael Schulte-Mecklenbeck, Stefan Borer, and Andrea C. Samson. 2018. Facial expression analysis with AFFDEX and FACET: A validation study. Behavior research methods 50, 4 (2018), 1446--1460.",
      "doi": ""
    },
    {
      "text": "Arthur A. Stone, Stefan Schneider, and James K. Harter. 2012. Day-of-week mood patterns in the United States: On the existence of 'Blue Monday','Thank God it's Friday' and weekend effects. The Journal of Positive Psychology 7, 4 (2012), 306--314.",
      "doi": ""
    },
    {
      "text": "George Sugihara, Robert May, Hao Ye, Chih-hao Hsieh, Ethan Deyle, Michael Fogarty, and Stephan Munch. 2012. Detecting causality in complex ecosystems. Science 338, 6106 (2012), 496--500.",
      "doi": ""
    },
    {
      "text": "Boyuan Sun, Qiang Ma, Shanfeng Zhang, Kebin Liu, and Yunhao Liu. 2017. iSelf: Towards Cold-Start Emotion Labeling Using Transfer Learning with Smartphones. ACM Trans. Sen. Netw. 13, 4, Article 30 (Sept. 2017), 22 pages. DOI: http://dx.doi.org/10.1145/3121049",
      "doi": "10.1145/3121049"
    },
    {
      "text": "Maxime Taquet, Jordi Quoidbach, Yves-Alexandre De Montjoye, Martin Desseilles, and James J. Gross. 2016. Hedonism and the choice of everyday activities. Proceedings of the National Academy of Sciences 113, 35 (2016), 9769--9773.",
      "doi": ""
    },
    {
      "text": "Robert E. Thayer, J. Robert Newman, and Tracey M. McClain. 1994. Self-regulation of mood: Strategies for changing a bad mood, raising energy, and reducing tension. Journal of personality and social psychology 67, 5 (1994), 910.",
      "doi": ""
    },
    {
      "text": "Lucia R. Valmaggia, Leila Latif, Matthew J. Kempton, and Maria Rus-Calafell. 2016. Virtual reality in the psychological treatment for mental health problems: an systematic review of recent evidence. Psychiatry Research 236 (2016), 189--195.",
      "doi": ""
    },
    {
      "text": "Niels van Berkel, Simon Dennis, Michael Zyphur, Jinjing Li, Andrew Heathcote, and Vassilis Kostakos. 2020. Modelling Interaction as a Complex System. Human-Computer Interaction (2020), to appear.",
      "doi": ""
    },
    {
      "text": "Niels van Berkel, Jorge Goncalves, Peter Koval, Simo Hosio, Tilman Dingler, Denzil Ferreira, and Vassilis Kostakos. 2019. Context-Informed Scheduling and Analysis: Improving Accuracy of Mobile Self-Reports. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/3290605.3300281",
      "doi": "10.1145/3290605.3300281"
    },
    {
      "text": "Job Van Der Schalk, Skyler T. Hawk, Agneta H. Fischer, and Bertjan Doosje. 2011. Moving faces, looking places: validation of the Amsterdam Dynamic Facial Expression Set (ADFES). Emotion 11, 4 (2011), 907.",
      "doi": ""
    },
    {
      "text": "Aku Visuri, Zhanna Sarsenbayeva, Jorge Goncalves, Evangelos Karapanos, and Simon Jones. 2016. Impact of mood changes on application selection. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. ACM, 535--540.",
      "doi": "10.1145/2968219.2968317"
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T. Campbell. 2014. StudentLife: assessing mental health, academic performance and behavioral trends of college students using smartphones. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 3--14.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of personality and social psychology 54, 6 (1988), 1063.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1993. Ubiquitous computing. Computer 10 (1993), 71--72.",
      "doi": "10.1109/2.237456"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-based design: Concept, principles and examples. ACM Transactions on Accessible Computing (TACCESS) 3, 3 (2011), 9.",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Ye Xu, Mu Lin, Hong Lu, Giuseppe Cardone, Nicholas Lane, Zhenyu Chen, Andrew Campbell, and Tanzeem Choudhury. 2013. Preference, context and communities: a multi-faceted approach to predicting smartphone app usage patterns. In Proceedings of the 2013 International Symposium on Wearable Computers. ACM, 69--76.",
      "doi": "10.1145/2493988.2494333"
    },
    {
      "text": "Hao Ye and et al. 2016. Package rEDM. (2016). https://cran.r-project.org/web/packages/rEDM/",
      "doi": ""
    },
    {
      "text": "Ligang Zhang and Dian Tjondronegoro. 2011. Facial expression recognition using facial movement features. IEEE Transactions on Affective Computing 2, 4 (2011), 219--229.",
      "doi": "10.1109/T-AFFC.2011.13"
    },
    {
      "text": "Xiao Zhang, Wenzhong Li, Xu Chen, and Sanglu Lu. 2018. MoodExplorer: Towards Compound Emotion Detection via Smartphone Sensing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 176 (Jan. 2018), 30 pages. DOI: http://dx.doi.org/10.1145/3161414",
      "doi": "10.1145/3161414"
    }
  ]
}