{
  "doi": "10.1145/3313831.3376874",
  "title": "Race, Gender and Beauty: The Effect of Information Provision on Online Hiring Biases",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "We conduct a study of hiring bias on a simulation platform where we ask Amazon MTurk participants to make hiring decisions for a mathematically intensive task. Our findings suggest hiring biases against Black workers and less attractive workers, and preferences towards Asian workers, female workers and more attractive workers. We also show that certain UI designs, including provision of candidates' information at the individual level and reducing the number of choices, can significantly reduce discrimination. However, provision of candidate's information at the subgroup level can increase discrimination. The results have practical implications for designing better online freelance marketplaces.",
  "tags": [
    "discrimination",
    "gig economy",
    "hiring"
  ],
  "authors": [
    {
      "name": "Weiwen Leung",
      "institution": "Unaffiliated, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659232258",
      "orcid": "missing"
    },
    {
      "name": "Zheng Zhang",
      "institution": "University of Rochester, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366270",
      "orcid": "missing"
    },
    {
      "name": "Daviti Jibuti",
      "institution": "CERGE-EI, Prague, Czech Rep",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526713",
      "orcid": "missing"
    },
    {
      "name": "Jinhao Zhao",
      "institution": "Unaffiliated, None, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659231979",
      "orcid": "missing"
    },
    {
      "name": "Maximilian Klein",
      "institution": "Unaffiliated, , MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488654027",
      "orcid": "missing"
    },
    {
      "name": "Casey Pierce",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659305030",
      "orcid": "missing"
    },
    {
      "name": "Lionel Robert",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81414603416/rel-imgonly/1ca59x5s1.jpg",
      "acmid": "81414603416",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    }
  ],
  "references": [
    {
      "text": "Moshe Ben-Akiva and Michel Bierlaire. 1999. Handbook of Transportation Science. Vol. 23. Springer, Boston, MA, Chapter Discrete Choice Methods and their Applications to Short Term Travel Decisions, 5--33.",
      "doi": ""
    },
    {
      "text": "Moshe Ben-Akiva and Bruno Boccara. 1995. Discrete choice models with latent choice sets. International Journal of Research in Marketing 12, 1 (May 1995), 9--24.",
      "doi": ""
    },
    {
      "text": "Marianne Bertrand and Esther Duflo. 2016. Handbook of Field Experiments. Vol. 2. North Holland, Chapter Field Experiments on Discrimination.",
      "doi": ""
    },
    {
      "text": "Marianne Bertrand and Sendhil Mullainathan. 2004. Are Emily and Greg More Employable Than Lakisha and Jamal? A Field Experiment on Labor Market Discrimination. American Economic Review 94, 4 (2004), 991--1013.",
      "doi": ""
    },
    {
      "text": "Iris Bohnet, Alexandra van Geen, and Max Bazerman. 2016. When Performance Trumps Gender Bias: Joint vs. Separate Evaluation. Management Science 62, 5 (2016), 1225--1531.",
      "doi": ""
    },
    {
      "text": "Aislinn Bohren, Alex Imas, and Michael Rosenberg. 2019. The Dynamics of Discrimination: Theory and Evidence. American Economic Review (2019).",
      "doi": ""
    },
    {
      "text": "Colin Cameron and Douglas Miller. 2015. A Practitioner's Guide to Cluster-Robust Inference. Journal of Human Resources 50, 2 (2015), 317--372.",
      "doi": ""
    },
    {
      "text": "Alexander Cherneva, Ulf Buckenholt, and Joseph Goodman. 2015. Choice overload: A conceptual review and meta-analysis. Journal of Consumer Psychology 25, 2 (2015), 333--358.",
      "doi": ""
    },
    {
      "text": "Katherine Coffman, Christine Exley, and Muriel Niederle. 2019. When gender discrimination is not about gender. Working Paper (2019).",
      "doi": ""
    },
    {
      "text": "Benjamin Edelman, Michael Luca, and Dan Svirsky. 2017. Racial Discrimination in the Sharing Economy: Evidence from a Field Experiment. American Economic Journal: Applied Economics 9, 2 (2017), 1--22.",
      "doi": ""
    },
    {
      "text": "Naomi Ellemers. 2018. Gender stereotypes. Annual review of psychology 69 (2018), 275--298.",
      "doi": ""
    },
    {
      "text": "Jonathan Guryan and Kerwin Kofi Charles. 2013. Taste-based or statistical discrimination: the economics of discrimination returns to its roots. The Economic Journal 123, 572 (2013), F417--F432.",
      "doi": ""
    },
    {
      "text": "Aniko Hannak, Claudia Wagner, David Garcia, Alan Mislove, Markus Strohmaier, and Christo Wilson. 2017. Bias in online freelance marketplaces: Evidence from Taskrabbit and Fiverr. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (2017), 1914--1933.",
      "doi": "10.1145/2998181.2998327"
    },
    {
      "text": "Christoph Hube, Besnik Fetahu, and Ujwal Gadiraju. 2019. Understanding and Mitigating Worker Biases in the Crowdsourced Collection of Subjective Judgments. CHI 1, 1 (2019), 407.",
      "doi": ""
    },
    {
      "text": "Sheena Iyengar and Emir Kamenica. 2010. Choice proliferation, simplicity seeking, and asset allocation. Journal of Public Economics 94, 7 (2010), 530--539.",
      "doi": ""
    },
    {
      "text": "Sheena Iyengar and Mark Lepper. 2000. When Choice is Demotivating: Can One Desire Too Much of a Good Thing? . Journal of Personality and Social Psychology 79, 6 (2000), 995--1006.",
      "doi": ""
    },
    {
      "text": "Christina Jenq, Jessica Pan, and Walter Theseira. 2015. Beauty, weight, and skin color in charitable giving. Journal of Economic Behavior and Organization 119 (2015), 234--253.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking fast and slow. Farrar, Straus and Giroux.",
      "doi": ""
    },
    {
      "text": "Emily Lancsar and Jordan Louviere. 2008. Conducting Discrete Choice Experiments to Inform Healthcare Decision Making. PharmacoEconomics 26, 8 (2008), 661--677.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining behavioral economics to design persuasive technology for healthy choices. CHI 1, 1 (2011), 325--334.",
      "doi": ""
    },
    {
      "text": "Markus Mobius and Tanya Rosenblat. 2006. Why Beauty Matters. American Economic Review 96, 1 (2006), 222--235.",
      "doi": ""
    },
    {
      "text": "Fiona Scott Morton, Florian Zettelmeyer, and Jorge Silva-Risso. 2003. Consumer Information and Discrimination: Does the Internet Affect the Pricing of New Cars to Women and Minorities? Quantitative Marketing and Economics 1, 1 (2003), 65--92.",
      "doi": ""
    },
    {
      "text": "Aviv Nevo. 2000. A Practitioner's Guide to Estimation of Random-Coefficients Logit Models of Demand. Journal of Economics & Management Strategy 9, 4 (2000), 513--548.",
      "doi": ""
    },
    {
      "text": "Devin Pope, Joseph Price, and Justin Wolfers. 2018. Awareness Reduces Racial Bias. Management Science 64, 11 (2018), 4967--5460.",
      "doi": "10.1287/mnsc.2017.2901"
    },
    {
      "text": "Devin Pope and Justin Sydnor. 2011. What's in a Picture? Evidence of Discrimination from Prosper.com. Journal of Human Resources 46, 1 (2011), 53--92.",
      "doi": ""
    },
    {
      "text": "Joseph Price and Justin Wolfers. 2010. Racial Discrimination Among NBA Referees. Quarterly Journal of Economics 125, 4 (2010), 859--1887.",
      "doi": ""
    },
    {
      "text": "Lincoln Quillian, Devah Pager, Ole Hexel, and Arnfinn H. MidtbÃÿen. 2017. Meta-analysis of field experiments shows no change in racial discrimination in hiring over time. PNAS 1, 1 (2017), 1--6.",
      "doi": ""
    },
    {
      "text": "Isabelle Regner, Catherine Thinus-Blanc, Agnes Netter, Toni Schmader, and Pascal Huguet. 2019. Committees with implicit biases promote fewer women when they do not believe gender bias exists. Nature Human Behaviour 3 (2019), 1171--1179.",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2016. Gig Work, Online Selling and Home Sharing. (2016).",
      "doi": ""
    },
    {
      "text": "Shiliang Tang, Xinyi Zhang, Jenna Cryan, Miriam Metzger, Haitao Zheng, and Ben Y. Zhao. 2017. Gender bias in the job market: A longitudinal analysis. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing 1, 2 (2017).",
      "doi": ""
    },
    {
      "text": "Richard Thaler and Cass Sunstein. 2009. Nudge: Improving Decisions About Health, Wealth, and Happiness. Penguin.",
      "doi": ""
    },
    {
      "text": "Jeffrey Wooldridge. 2019. Introductory Econometrics: A Modern Approach. South-Western College Pub.",
      "doi": ""
    }
  ]
}