{
  "doi": "10.1145/3313831.3376258",
  "title": "It Is Your Turn: Collaborative Ideation With a Co-Creative Robot through Sketch",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Co-creative systems have been widely explored in the field of computational creativity. However, existing AI partners of these systems are mostly virtual agents. As sketching on paper with embodied robots could be more engaging for designers' early-stage ideation and collaborative practices, we envision the possibility of Cobbie, a mobile robot that ideates iteratively with designers by generating creative and diverse sketches. To evaluate the differences in co-creativity and user experience between the co-creative robots and virtual agents, we conducted a comparative experiment and analyzed the data collected from quantitative scales, observation, and semi-structured interview. The results reveal that Cobbie is more satisfying in motivating exploration, provoking unexpected ideas and engaging designers in the collaborative ideation process. Based on these findings, we discussed the prospects of co-creative robots for future developments of human-AI collaborative systems.",
  "tags": [
    "co-creative system",
    "human-ai collaboration",
    "ideation",
    "creative robot",
    "early-stage design"
  ],
  "authors": [
    {
      "name": "Yuyu Lin",
      "institution": "Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366271",
      "orcid": "missing"
    },
    {
      "name": "Jiahao Guo",
      "institution": "Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526451",
      "orcid": "missing"
    },
    {
      "name": "Yang Chen",
      "institution": "Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365873",
      "orcid": "missing"
    },
    {
      "name": "Cheng Yao",
      "institution": "Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87258818557",
      "orcid": "0000-0001-6572-0242"
    },
    {
      "name": "Fangtian Ying",
      "institution": "China Academy of Art, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474669644",
      "orcid": "0000-0001-9047-0257"
    }
  ],
  "references": [
    {
      "text": "Ali Algarni. 2019. Exploring Neuroscience of Creativity Theories in designing Co-creative Agents. In Proceedings of the 2019 on Creativity and Cognition (C&C'19). ACM, NY, NY, USA, 686--690. DOI: https://doi.org/10.1145/3325480.3326559",
      "doi": "10.1145/3325480.3326559"
    },
    {
      "text": "Patrí cia Alves-Oliveira, Patrí cia Arriaga, Ana Paiva, and Guy Hoffman. 2017. YOLO, a Robot for Creativity: A Co-Design Study with Children. In Proceedings of the 2017 Conference on Interaction Design and Children (CHI'17). ACM, NY, NY, USA, 423--429. DOI: http://dx.doi.org/10.1145/3078072.3084304",
      "doi": "10.1145/3078072.3084304"
    },
    {
      "text": "Sule Anjomshoae, Amro Najjar, Davide Calvaresi, and Kary Framling. 2019. Explainable Agents and Robots: Results from a Systematic Literature Review. In Proceedings of the 18th International Conference on Autonomous Agents and MultiAgent Systems (AAMAS'19). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 1078--1088.",
      "doi": ""
    },
    {
      "text": "Patti Bao, Elizabeth Gerber, Darren Gergle, and David Hoffman. 2010. Momentum: getting and staying on topic during a brainstorm. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). ACM, NY, NY, USA, 12331236. DOI: https://doi.org/10.1145/1753326.1753511",
      "doi": "10.1145/1753326.1753511"
    },
    {
      "text": "Luca Benedetti, Holger Winnemoller, Massimiliano Corsini, and Roberto Scopigno. 2014. Painting with Bob: assisted creativity for novices. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST'14). ACM, NY, NY, USA, 419--428. DOI: http://dx.doi.org/10.1145/2642918.2647415",
      "doi": "10.1145/2642918.2647415"
    },
    {
      "text": "Peter Brandl, Clifton Forlines, Daniel Wigdor, Michael Haller, and Chia Shen. 2008. Combining and Measuring the Benefits of Bimanual Pen and DirectTouch Interaction on Horizontal Interfaces. In Proceedings of the working conference on Advanced visual interfaces (AVI'08). ACM, NY, NY, USA, 154--161. DOI: https://doi.org/10.1145/1385569.1385595",
      "doi": "10.1145/1385569.1385595"
    },
    {
      "text": "Erin A. Carroll, Celine Latulipe, Richard Fung, and Michael Terry. 2009. Creativity factor evaluation: towards a standardized survey metric for creativity support. In Proceedings of the seventh ACM conference on Creativity and cognition (C&C'09). ACM, NY, NY, USA, 127--136. DOI: https://doi.org/10.1145/1640233.1640255",
      "doi": "10.1145/1640233.1640255"
    },
    {
      "text": "Sung-En Chien, Li Chu, Hsing-Hao Lee, Chien-Chun Yang, Fo-Hui Lin, Pei-Ling Yang, Te-Mei Wang, and Su-Ling Yeh. 2019. Age Difference in Perceived Ease of Use, Curiosity, and Implicit Negative Attitude toward Robots. ACM Trans. Hum.-Robot Interact. 8, 2, Article 9 (May 2019). DOI: https://doi.org/10.1145/3311788",
      "doi": "10.1145/3311788"
    },
    {
      "text": "Brock Craft and Paul Cairns. 2009. Sketching sketching: outlines of a collaborative design method. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCS-HCI'09). BCS Learning & Development Ltd. Swindon, UK, 65--72.",
      "doi": "10.5555/1671011.1671019"
    },
    {
      "text": "Jim Davies, Ashok K. Goel, and Nancy J. Nersessian 2009. A Computational Model of Visual Analogies in Design. Cognitive Systems Research: Special Issue on Analogies 10, 3(2009), 204--215. DOI: https://doi.org/10.1016/j.cogsys.2008.09.006",
      "doi": "10.1016/j.cogsys.2008.09.006"
    },
    {
      "text": "Nicholas Davis, Chih-Pin Hsiao, Kunwar Yashraj Singh, and Brian Magerko. 2016. Co-Creative Drawing Agent with Object Recognition. In Twelfth Artificial Intelligence and Interactive Digital Entertainment Conference.",
      "doi": ""
    },
    {
      "text": "Nicholas Davis. An Enactive Approach to Facilitate Interactive Machine Learning for Co-Creative Agents. 2015. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C'15). ACM, NY, NY, USA, 345--346. DOI: https://doi.org/10.1145/2757226.2764773",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Chih-Pin Hsiao, Kunwar Yashraj Singh, Lisa Li, and Brian Magerko. 2016. Empirically Studying Participatory Sense-Making in Abstract Drawing with a Co-Creative Cognitive Agent. In Proceedings of the 21st Interactional Conference on Intelligent User Interfaces (IUI'16). ACM, NY, NY, USA, 196--207. DOI: http://dx.doi.org/10.1145/2856767.2856795",
      "doi": "10.1145/2856767.2856795"
    },
    {
      "text": "Sebastian Deterding, Jonathan Hook, Rebecca Fiebrink, Marco Gillies, Jeremy Gow, Memo Akten, Gillian Smith, Antonios Liapis, and Kate Compton. 2017. Mixed-Initiative Creative Interfaces. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'17). ACM, NY, NY, USA, 628--635. DOI: http://dx.doi.org/10.1145/3027063.3027072",
      "doi": "10.1145/3027063.3027072"
    },
    {
      "text": "Daniel Dixon, Manoj Prasad, and Tracy Hammond. 2010. iCanDraw: using sketch recognition and corrective feedback to assist a user in drawing human faces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). ACM, NY, NY, USA, 897--906. DOI: https://doi.org/10.1145/1753326.1753459",
      "doi": "10.1145/1753326.1753459"
    },
    {
      "text": "Judith E. Fan, Monica Dinculescu, and David Ha. 2019. collabdraw: An Environment for Collaborative Sketching with an Artificial Agent. In Proceedings of the 2019 on Creativity and Cognition (C&C'19). ACM, NY, NY, USA, 556--561. DOI: https://doi.org/10.1145/3325480.3326578",
      "doi": "10.1145/3325480.3326578"
    },
    {
      "text": "Juan Fasola and Maja J Mataric. 2013. Experimental Robotics. Springer, Heidelberg, Chapter Socially Assistive Robot Exercise Coach: Motivating Older Adults to Engage in Physical exercise, 463--479.",
      "doi": ""
    },
    {
      "text": "Mary Ellen Forster, Andre Gaschler, Manuel Giuliani, Amy Isard, Maria Pateraki, and Ronald P.A. Petrick. 2012. Two People Walk Into a Bar: Dynamic MultiParty Social Interaction with a Robot Agent. In Proceedings of the 14th ACM international conference on Multimodal interaction (ICMI'12). ACM, NY, NY, USA, 3--10. DOI: https://doi.org/10.1145/2388676.2388680",
      "doi": ""
    },
    {
      "text": "Alex Graves. 2013. Generating Sequences With Recurrent Neural Networks. Computer Science (2013). arXiv: 1308.0850 [cs.NE]",
      "doi": ""
    },
    {
      "text": "Matthew Guzdial, Nicholas Liao, Jonathan Chen, Shao-Yu Chen, Shukan Shah, Vishwa Shah, Joshua Reno, Gillian Smith, and Mark O. Riedl. 2019. Friend, Collaborator, Student, Manager: How Design of an AIDriven Game Level Editor Affects Creators. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). ACM, NY, NY, USA, Paper No. 624. DOI: https://doi.org/10.1145/3290605.3300854",
      "doi": ""
    },
    {
      "text": "Joshua T. Gyory, Jonathan Cagan, and Kenneth Kotovsky. 2018. Are you better off alone? Mitigating the underperformance of engineering teams during conceptual design through adaptive process management. Research in Engineering Design 30, 85102(2019). DOI: https://doi.org/10.1007/s00163-01800303--3",
      "doi": ""
    },
    {
      "text": "David Ha and Douglas Eck. 2017. A Neural Representation of Sketch Drawings. arXiv: 1704.03477 [cs.NE]",
      "doi": ""
    },
    {
      "text": "Chipp Jansen and Elizabeth Sklar. 2019. Co-creative Physical Drawing Systems. ICRA.",
      "doi": ""
    },
    {
      "text": "Jonas Jongejan, Henry Rowley, Takashi Kawashima, Jongmin Kim, and Nick Fox-Gieg. 2016. The Quick, Draw! -A.I. Experiment. (2016). https://quickdraw.withgoogle.com/",
      "doi": ""
    },
    {
      "text": "Deny W. Junaidy and Yukari Nagai. 2013. Co-Creation Model for Traditional Artisans in the Current Creative Environment. In Proceedings of the 9th ACM Conference on Creativity & Cognition (C&C'13). ACM, NY, NY, USA, 324--327. DOI: https://doi.org/10.1145/2466627.2466669",
      "doi": ""
    },
    {
      "text": "Peter H. Kahn, Jr., Takayuki Kanda, Hiroshi Ishiguro, Brian T. Gill, Solace Shen, Jolina H. Ruckert, and Heather E. Gary. 2016. Human Creativity Can be Facilitated Through Interacting With a Social Robot. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 173--180.",
      "doi": ""
    },
    {
      "text": "Pegah Karimi, Nicholas Davis, Mary Lou Maher, Kazjon Frace, and Lina Lee. 2019. Relating Cognitive Models of Design Creativity to the Similarity of Sketches Generated by an AI Partner. In Proceedings of the 2019 on Creativity and Cognition (C&C'19). ACM, NY, NY, USA, 259--270. DOI: https://doi.org/10.1145/3325480.3325488",
      "doi": "10.1145/3325480.3325488"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Hyunmin Cheong, Ali Hashemi, and George Fitzmaurice. 2017. DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST'17). ACM, NY, NY, USA, 401--414. DOI: https://doi.org/10.1145/3126594.3126662",
      "doi": "10.1145/3126594.3126662"
    },
    {
      "text": "Janin Koch, Andres Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI? Design Ideation with Cooperative Contextual Bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). ACM, NY, NY, USA, 1--12. DOI: https://doi.org/10.1145/3290605.3300863",
      "doi": "10.1145/3290605.3300863"
    },
    {
      "text": "Pavlos Koulouris and Evangelia V. Dimaraki. 2014. Digital Gaming for Co-Creativity in Learning: TheoryFramed Co-Design with School Communities. In Proceedings of the 18th Panhellenic Conference on Informatics (PCI'14). ACM, NY, NY, USA, 16. DOI: http://dx.doi.org/10.1145/2645791.2645816",
      "doi": ""
    },
    {
      "text": "Eun Kwon, Gerard J. Kim. 2010. Humanoid Robot vs. Projector Robot: Exploring an Indirect Approach to Human Robot Interaction. In Proceedings of the 5th ACM/IEEE international conference on Human-robot interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 157--158.",
      "doi": ""
    },
    {
      "text": "Matthew V. Law, JiHyun Jeong, Amritansh Kwatra, Malte F. Jung, and Guy Hoffman. 2019. Negotiating the Creative Space in Human-Robot Collaborative Design. In Proceedings of 2019 on Designing Interactive Systems Conference (DIS'19). ACM, NY, NY, USA, 645--657. DOI: https://doi.org/10.1145/3322276.3322343",
      "doi": "10.1145/3322276.3322343"
    },
    {
      "text": "Matthew V. Law, Nikhil Dhawan, Hyunseung Bang, So-Yeon Yoon, Daniel Selva, and Guy Hoffman. 2018. Side-by-side Human-computer Design Using a Tangible User Interface. In Design Computing and Cognition '18. DCC 2018. Springer, Cham. DOI: https://doi.org/10.1007/978--3-030-05363--5_9",
      "doi": ""
    },
    {
      "text": "Duri Long, Mikhail Jacob, and Brian Magerko. 2019. Designing Co-Creative AI for Public Spaces. In Proceedings of the 2019 on Creativity and Cognition (C&C'19). ACM, NY, NY, USA, 271--284. DOI: https://doi.org/10.1145/3325480.3325504",
      "doi": "10.1145/3325480.3325504"
    },
    {
      "text": "Arnold Lund. 2001. Measuring Usability with the USE Questionnaire. Usability and User Experience Newsletter of the STC Usability SIG. 8(2001).",
      "doi": ""
    },
    {
      "text": "Makoto Nakajima, Daisuke Sakamoto, and Takeo Igarashi. 2014. Offline Painted Media for Digital Animation Authoring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/2556288.2557062",
      "doi": "10.1145/2556288.2557062"
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help But Only with Enough Details: Understanding the User Experience of Co-Creation with Artificial Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18). ACM, NY, NY, USA, 1--13. DOI: https://doi.org/10.1145/3173574.3174223",
      "doi": "10.1145/3173574.3174223"
    },
    {
      "text": "Ayberk Ozgur, Wafa Johal, Francesco Mondada, and Pierre Dillenbourg. 2017. Haptic-Enabled Handheld Mobile Robots: Design and Analysis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17). ACM, NY, NY, USA, 2449--2461. DOI: http://dx.doi.org/10.1145/3025453.3025994",
      "doi": "10.1145/3025453.3025994"
    },
    {
      "text": "Eujin Pei, Ian Campbell, and Mark Evans. 2011. A Taxonomic Classification of Visual Design Representations Used by Industrial Designers and Engineering Designers. The Design Journal 14, 1 (2011), 64--91. DOI: http://dx.doi.org/10.2752/175630610X1287738583880",
      "doi": ""
    },
    {
      "text": "Cecil Piya, Vinayak, Senthil Chandrasegaran, Niklas Elmqvist, and Karthik Ramani. 2017. Co-3Deator: A Team-First Collaborative 3D Design Ideation Tool. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17). ACM, NY, NY, USA, 6581--6592. DOI: http://dx.doi.org/10.1145/3025453.3025825",
      "doi": "10.1145/3025453.3025825"
    },
    {
      "text": "Aaron Powers, Sara Kiesler, Susan Fussell, and Cristen Torrey. 2007. Comparing a Computer Agent with a Humanoid Robot. In Proceedings of the ACM/IEEE international conference on Human-robot interaction (HRI'07). ACM, NY, NY, USA, 145--152. DOI: https://doi.org/10.1145/1228716.1228736",
      "doi": "10.1145/1228716.1228736"
    },
    {
      "text": "Prashanth Thattai Ravikumar. 2017. Notational Communication with Co-creative Systems: Studying Improvements to Musical Coordination. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition (C&C'17). ACM, NY, NY, USA, 518--523. DOI: http://dx.doi.org/10.1145/3059454.3078702",
      "doi": "10.1145/3059454.3078702"
    },
    {
      "text": "Ruth Schulz, Philipp Kratzer, and Marc Toussaint. 2017. Building a Bridge with a Robot: A System for Collaborative On-table Task Execution. In Proceedings of the 5th International Conference on Human Agent Interaction (HAI'17). ACM, NY, NY, USA, 399--403. DOI: http://dx.doi.org/10.1145/3125739.3132606",
      "doi": "10.1145/3125739.3132606"
    },
    {
      "text": "Ticha Sethapakdi and James McCann. 2019. Painting with CATS: Camera-Aided Texture Synthesis. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). ACM, NY, NY, USA, 1--9. DOI: https://doi.org/10.1145/3290605.3300287",
      "doi": "10.1145/3290605.3300287"
    },
    {
      "text": "Ching-Long Shih and Li-Chen Lin. 2017. Trajectory Planning and Tracking Control of a Differential-Drive Mobile Robot in a Picture Drawing Application. Robotics. 6, 3(8, 2017). DOI: https://doi.org/10.3390/robotics6030017",
      "doi": ""
    },
    {
      "text": "Hyunyoung Song, Francois Guimbretiere, Tovi Grossman, and George Fitzmaurice. 2010. MouseLight: Bimanual Interactions on Digital Paper Using a Pen and a Spatially-Aware Mobile Projector. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). ACM, NY, NY, USA, 2451--2460. DOI: https://doi.org/10.1145/1753326.1753697",
      "doi": "10.1145/1753326.1753697"
    },
    {
      "text": "Hyunyoung Song, Tovi Grossman, George Fitzmaurice, Francois Guimbretiere, Azam Khan, Ramtin Attar, and Gordon Kurtenbach. 2009. PenLight: Combining a Mobile Projector and a Digital Pen for Dynamic Visual Overlay. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09). ACM, NY, NY, USA, 143152. DOI: https://doi.org/10.1145/1518701.1518726",
      "doi": "10.1145/1518701.1518726"
    },
    {
      "text": "Masaki Suwa, John S. Gero, and Terry A. Purcell. 1998. The Roles of Sketches in Early Conceptual Design Processes. In Proceedings of Twentieth Annual Meeting of the Cognitive Science Society. Lawrence Erlbaum Hillsdale, New Jersey, 1043--1048.",
      "doi": ""
    },
    {
      "text": "Theophanis Tsandilas, Magdalini Grammatikou, and Stephane Huot. 2015. BricoSketch: Mixing Paper and Computer Drawing Tools in Professional Illustration. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS'15). ACM, NY, NY, USA, 127--136. DOI: http://dx.doi.org/10.1145/2817721.2817729",
      "doi": "10.1145/2817721.2817729"
    },
    {
      "text": "Pierre Wellner. 1991. The DigitalDesk calculator: tangible manipulation on a desk top display. In Proceedings of the 4th annual ACM symposium on User interface software and technology (UIST'91). ACM, NY, NY, USA, 27--33. DOI: https://doi.org/10.1145/120782.120785",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Blake Williford, Abhay Doke, and Michel Pahud. 2019. DrawMyPhoto: Assisting Novices in Drawing from Photographs. In Proceedings of the 2019 on Creativity and Cognition (C&C'19). ACM, NY, NY, USA, 198--209. DOI: https://doi.org/10.1145/3325480.3325507",
      "doi": "10.1145/3325480.3325507"
    },
    {
      "text": "Yang Zhang, Chris Harrison. 2018. Pulp Nonfiction: Low-Cost Touch Tracking for Paper. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18). ACM, NY, NY, USA, Paper No. 117. DOI: https://doi.org/10.1145/3173574.3173691",
      "doi": "10.1145/3173574.3173691"
    },
    {
      "text": "OPEN AI LAB. 2019. Tengine. https://github.com/OAID/Tengine",
      "doi": ""
    }
  ]
}