{
  "doi": "10.1145/3313831.3376511",
  "title": "\"It's a scavenger hunt\": Usability of Websites' Opt-Out and Data Deletion Choices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We conducted an in-lab user study with 24 participants to explore the usefulness and usability of privacy choices offered by websites. Participants were asked to find and use choices related to email marketing, targeted advertising, or data deletion on a set of nine websites that differed in terms of where and how these choices were presented. They struggled with several aspects of the interaction, such as selecting the correct page from a site's navigation menu and understanding what information to include in written opt-out requests. Participants found mechanisms located in account settings pages easier to use than options contained in privacy policies, but many still consulted help pages or sent email to request assistance. Our findings indicate that, despite their prevalence, privacy choices like those examined in this study are difficult for consumers to exercise in practice. We provide design and policy recommendations for making these website opt-out and deletion choices more useful and usable for consumers.",
  "tags": [
    "privacy",
    "data deletion",
    "privacy controls",
    "email marketing",
    "usability",
    "targeted advertising"
  ],
  "authors": [
    {
      "name": "Hana Habib",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019881",
      "orcid": "0000-0003-3743-7858"
    },
    {
      "name": "Sarah Pearman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160332",
      "orcid": "missing"
    },
    {
      "name": "Jiamin Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529468",
      "orcid": "missing"
    },
    {
      "name": "Yixin Zou",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260611",
      "orcid": "missing"
    },
    {
      "name": "Alessandro Acquisti",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496675247",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Norman Sadeh",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100339054/rel-imgonly/n.sadeh.png",
      "acmid": "81100339054",
      "orcid": "missing"
    },
    {
      "name": "Florian Schaub",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, and others. 2017. Nudges for Privacy and Security: Understanding and Assisting Users' Choices Online. ACM Computing Surveys (CSUR) 50, 3 (2017), 44.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Terence S Andre, H Rex Hartson, Steven M Belz, and Faith A McCreary. 2001. The User Action Framework: A Reliable Foundation for Usability Engineering Support Tools. International Journal of Human-Computer Studies 54, 1 (2001), 107--136.",
      "doi": "10.1006/ijhc.2000.0441"
    },
    {
      "text": "BackgroundChecks.org. 2019. JustDelete.me. (2019). https://justdeleteme.xyz.",
      "doi": ""
    },
    {
      "text": "California State Legislature Website. 2018. SB-1121 California Consumer Privacy Act of 2018. (2018). https://leginfo.legislature.ca.gov/faces/ billTextClient.xhtml?bill_id=201720180SB1121.",
      "doi": ""
    },
    {
      "text": "Martin Degeling, Christine Utz, Christopher Lentzsch, Henry Hosseini, Florian Schaub, and Thorsten Holz. 2019. We Value Your Privacy... Now Take Some Cookies: Measuring the GDPR's Impact on Web Privacy. In Proceedings of Network and Distributed System Security Symposium (NDSS).",
      "doi": ""
    },
    {
      "text": "Digital Advertising Alliance. 2009. Self-Regulatory Principles for Online Behavioral Advertising. (July 2009). http://digitaladvertisingalliance.org/principles.",
      "doi": ""
    },
    {
      "text": "Pardis Emami-Naeini, Henry Dixon, Yuvraj Agarwal, and Lorrie Faith Cranor. 2019. Exploring How Privacy and Security Factor Into IoT Device Purchase Behavior. In Proceedings of the Conference on Human Factors in Computing Systems (CHI).",
      "doi": "10.1145/3290605.3300764"
    },
    {
      "text": "European Commission. 2018a. Article 29 Data Protection Working Party. Guidelines on Transparency under regulation 2016/679. (2018). http://europa.eu/rapid/press-release_SPEECH-11--461_en.htm.",
      "doi": ""
    },
    {
      "text": "European Commission. 2018b. EU Data Protection Rules. (2018). https://ec.europa.eu/commission/priorities/ justice-and-fundamental-rights/data-protection/ 2018-reform-eu-data-protection-rules_en.",
      "doi": ""
    },
    {
      "text": "Benjamin Fabian, Tatiana Ermakova, and Tino Lentz. 2017. Large-Scale Readability Analysis of Privacy Policies. In Proceedings of the International Conference on Web Intelligence (WI). 18--25.",
      "doi": "10.1145/3106426.3106427"
    },
    {
      "text": "Federal Trade Commission. 2009. CAN-SPAM Act: A Compliance Guide for Business. (2009). https://www.ftc.gov/tips-advice/business-center/guidance/can-spam-act-compliance-guide-business.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2017. Children's Online Privacy Protection Rule: A Six-Step Compliance Plan for Your Business. (2017). https://www.ftc.gov/tips-advice/business-center/guidance/childrens-online-privacy-protection-rule-six-step-compliance.",
      "doi": ""
    },
    {
      "text": "Stacia Garlach and Daniel Suthers. 2018. 'I'm supposed to see that?' AdChoices Usability in the Mobile Environment. In Proceedings of the Hawaii International Conference on System Sciences (HICSS).",
      "doi": ""
    },
    {
      "text": "Global Privacy Enforcement Network. 2017. GPEN Sweep 2017: User Controls over Personal information. (2017). https://www.privacyenforcement.net/system/files/2017% 20GPEN%20Sweep%20-%20International%20Report_0.pdf.",
      "doi": ""
    },
    {
      "text": "Colin M Gray, Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L Toombs. 2018. The Dark (Patterns) Side of UX Design. In Proceedings of the Conference on Human Factors in Computing Systems (CHI).",
      "doi": "10.1145/3173574.3174108"
    },
    {
      "text": "Hana Habib, Yixin Zou, Aditi Jannu, Neha Sridhar, Chelse Swoopes, Alessandro Acquisti, Lorrie Faith Cranor, Norman Sadeh, and Florian Schaub. 2019. An Empirical Analysis of Data Deletion and Opt-Out Choices on 150 Websites. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Jovanni Hernandez, Akshay Jagadeesh, and Jonathan Mayer. 2011. Tracking the Trackers: The AdChoices Icon. (2011). http://cyberlaw.stanford.edu/blog/2011/08/tracking-trackers-adchoices-icon.",
      "doi": ""
    },
    {
      "text": "IAB Europe. 2011. EU Framework for Online Behavioural Advertising. (2011). https://www.edaa.eu/wp-content/uploads/2012/10/ 2013--11--11-IAB-Europe-OBA-Framework_.pdf.",
      "doi": ""
    },
    {
      "text": "IAB Europe. 2019. GDPR Transparency and Consent Framework. (2019). https://iabtechlab.com/standards/gdpr-transparency-and-consent-framework/.",
      "doi": ""
    },
    {
      "text": "Saranga Komanduri, Richard Shay, Greg Norcie, and Blase Ur. 2011. AdChoices? Compliance with Online Behavioral Advertising Notice and Choice Requirements. A Journal of Law and Policy for the Information Society 7 (2011).",
      "doi": ""
    },
    {
      "text": "Pedro Giovanni Leon, Justin Cranshaw, Lorrie Faith Cranor, Jim Graves, Manoj Hastak, Blase Ur, and Guzi Xu. 2012. What Do Online Behavioral Advertising Privacy Disclosures Communicate to Users?. In Proceedings of the Workshop on Privacy in the Electronic Society (WPES).",
      "doi": "10.1145/2381966.2381970"
    },
    {
      "text": "Thomas Linden, Hamza Harkous, and Kassem Fawaz. 2018. The Privacy Policy Landscape After the GDPR. arXiv:1809.08396 (2018).",
      "doi": ""
    },
    {
      "text": "Mary Madden and Lee Rainie. 2015. Americans' Attitudes About Privacy, Security and Surveillance. (2015).",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Jessica Vitak, Arvind Narayanan, and Marshini Chetty. 2018. Characterizing the use of browser-based blocking extensions to prevent online tracking. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Jonathan R Mayer and John C Mitchell. 2012. Third-Party Web Tracking: Policy and Technology. In Proceedings of the IEEE Symposium on Security and Privacy (S&P).",
      "doi": "10.1109/SP.2012.47"
    },
    {
      "text": "Aleecia M McDonald and Lorrie Faith Cranor. 2010. Americans' Attitudes About Internet Behavioral Advertising Practices. In Proceedings of the Workshop on Privacy in the Electronic Society (WPES).",
      "doi": "10.1145/1866919.1866929"
    },
    {
      "text": "William Melicher, Mahmood Sharif, Joshua Tan, Lujo Bauer, Mihai Christodorescu, and Pedro Giovanni Leon. 2016. (Do Not) Track Me Sometimes: Users' Contextual Preferences for Web Tracking. Proceedings on Privacy Enhancing Technologies 2016, 2 (2016), 135--154.",
      "doi": ""
    },
    {
      "text": "Michael Morgan, Daniel Gottlieb, Matthew Cin, Jonathan Ende, Amy Pimentel, and Li Wang. 2018. California Enacts a Groundbreaking New Privacy Law. (2018). https://www.mwe.com/en/thought-leadership/publications/2018/06/california-enacts-groundbreaking-new-privacy-law.",
      "doi": ""
    },
    {
      "text": "Ambar Murillo, Andreas Kramm, Sebastian Schnorf, and Alexander De Luca. 2018. \"If I press delete, it's gone\" - User Understanding of Online Data Deletion and Expiration. Proceedings of the Symposium on Usable Privacy and Security (SOUPS) (2018).",
      "doi": ""
    },
    {
      "text": "Network Advertising Initiative. 2018. NAI Code of Conduct. (2018). https://www.networkadvertising.org/sites/default/files/nai_code2018.pdf.",
      "doi": ""
    },
    {
      "text": "Nielsen Norman Group. 2018. Top 10 Design Mistakes in the Unsubscribe Experience. (2018). https://www.nngroup.com/articles/unsubscribe-mistakes/.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 1986. Cognitive Engineering. In User Centered System Design: New Perspectives on Human-Computer Interaction. Lawrence Erlbaum Associates, 31--61.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 1990. The Design of Everyday Things. Doubleday.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Norwegian Consumer Council. 2018. Deceived by Design: How Tech Companies Use Dark Patterns to Discourage Us from Exercising Our Rights to Privacy. (2018). https://fil.forbrukerradet.no/wp-content/uploads/2018/06/2018-06--27-deceived-by-design-final.pdf.",
      "doi": ""
    },
    {
      "text": "Online Trust Alliance. 2018. Email Marketing & Unsubscribe Audit. (2018). https://www.internetsociety.org/resources/ota/2018/2018-email-marketing-unsubscribe-audit/.",
      "doi": ""
    },
    {
      "text": "Enric Pujol, Oliver Hohlfeld, and Anja Feldmann. 2015. Annoyed Users: Ads and Ad-Block Usage in the Wild. In Proceedings of the Internet Measurement Conference.",
      "doi": "10.1145/2815675.2815705"
    },
    {
      "text": "Iskander Sanchez-Rola, Matteo Dell'Amico, Platon Kotzias, Davide Balzarotti, Leyla Bilge, Pierre-Antoine Vervier, and Igor Santos. 2019. Can I Opt Out Yet?: GDPR and the Global Illusion of Cookie Control. In Proceedings of the ACM Asia Conference on Computer and Communications Security.",
      "doi": "10.1145/3321705.3329806"
    },
    {
      "text": "Florian Schaub, Aditya Marella, Pranshu Kalvani, Blase Ur, Chao Pan, Emily Forney, and Lorrie Faith Cranor. 2016. Watching Them Watching Me: Browser Extensions' Impact on User Privacy Awareness and Concern. In Proceedings of NDSS Workshop on Usable Security (USEC).",
      "doi": ""
    },
    {
      "text": "Fatemeh Shirazi and Melanie Volkamer. 2014. What Deters Jane from Preventing Identification and Tracking on the Web?. In Proceedings of the Workshop on Privacy in the Electronic Society (WPES).",
      "doi": "10.1145/2665943.2665963"
    },
    {
      "text": "United States Congress. 1999. S.900 Gramm-Leach-Bliley Act. (1999). https://www.congress.gov/bill/106th-congress/senate-bill/00900.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS).",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "Christine Utz, Martin Degeling, Sascha Fahl, Florian Schaub, and Thorsten Holz. 2019. (Un)informed Consent: Studying GDPR Consent Notices in the Field. In Proceedings of Conference on Computer and Communications Security (CCS).",
      "doi": "10.1145/3319535.3354212"
    },
    {
      "text": "Ari Ezra Waldman. 2019. There is No Privacy Paradox: How Cognitive Biases and Design Dark Patterns Affect Online Disclosure. Current Opinion in Psychology (2019).",
      "doi": ""
    }
  ]
}