{
  "doi": "10.1145/3313831.3376465",
  "title": "\"Like Shock Absorbers\": Understanding the Human Infrastructures of Technology-Mediated Mental Health Support",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Significant research in HCI and beyond has sought to understand end-user needs in formal and informal technology-mediated mental health support (TMMHS) systems. However, little work has been done to understand the experiences and needs of the individuals who power or support these systems, particularly in the Global South. We present a qualitative study of one of the most accessible forms of mental health care in India — helplines. Through in-depth interviews conducted with 12 helpline volunteers, we research the human infrastructure responsible for the functioning of helplines. We foreground the often invisible labor involved in erecting and maintaining the institutional, interpersonal, and individual boundaries that are critical to realizing the goals of these helplines. Finally, we discuss the implications of our research for future work examining human infrastructures, particularly in mental health settings, and for the design of future TMMHS systems that deliver on-demand care to diverse, underserved, and stigmatized populations.",
  "authors": [
    {
      "name": "Sachin R. Pendse",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366119",
      "orcid": "missing"
    },
    {
      "name": "Faisal M. Lalani",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480955",
      "orcid": "missing"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    },
    {
      "name": "Amit Sharma",
      "institution": "Microsoft Research India, Bengaluru, India",
      "img": "/do/10.1145/contrib-60000000084/rel-imgonly/amitsharma_photo.jpg",
      "acmid": "60000000084",
      "orcid": "missing"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Ashok Agarwal, Myriam Hamdallah, Suvakanta N Swain, Sonali Mukherjee, Neetu Singh, Sudip Mahapatra, Elizabeth J King, Julie Pulerwitz, and Ibou Thior. 2015. Implementation of a confidential helpline for men having sex with men in India. JMIR mHealth and uHealth 3, 1 (2015), e17.",
      "doi": ""
    },
    {
      "text": "Gregory Armstrong, Michelle Kermode, Shoba Raja, Sujatha Suja, Prabha Chandra, and Anthony F Jorm. 2011. A mental health training program for community health workers in India: impact on knowledge and attitudes. International journal of mental health systems 5, 1 (2011), 17.",
      "doi": ""
    },
    {
      "text": "David Bakker, Nikolaos Kazantzis, Debra Rickwood, and Nikki Rickard. 2016. Mental health smartphone apps: review and evidence-based recommendations for future developments. JMIR mental health 3, 1 (2016), e7.",
      "doi": ""
    },
    {
      "text": "Harald Baumeister, Lars Reichler, Marie Munzinger, and Jiaxi Lin. 2014. The impact of guidance on Internet-based mental health interventions-A systematic review. internet Interventions 1, 4 (2014), 205--215.",
      "doi": ""
    },
    {
      "text": "Dror Ben-Zeev, Benjamin Buck, Phuonguyen Vu Chu, Lisa Razzano, Nicole Pashka, and Kevin A Hallgren. 2019. Transdiagnostic Mobile Health: Smartphone Intervention Reduces Depressive Symptoms in People With Mood and Psychotic Disorders. JMIR mental health 6, 4 (2019), e13202.",
      "doi": ""
    },
    {
      "text": "Arpita Bhattacharya, Calvin Liang, Emily Y Zeng, Kanishk Shukla, Miguel ER Wong, Sean A Munson, and Julie A Kientz. 2019. Engaging Teenagers in Asynchronous Online Groups to Design for Stress Management. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. ACM, 26--37.",
      "doi": "10.1145/3311927.3323140"
    },
    {
      "text": "Patrick Biernacki and Dan Waldorf. 1981. Snowball sampling: Problems and techniques of chain referral sampling. Sociological methods & research 10, 2 (1981), 141--163.",
      "doi": ""
    },
    {
      "text": "Neena Bohra, Indira Sharma, Shruti Srivastava, MS Bhatia, Uday Chaudhuri, Sonia Parial, Avdesh Sharma, and Dinesh Kataria. 2015. Violence against women. Indian journal of psychiatry 57, Suppl 2 (2015), S333.",
      "doi": ""
    },
    {
      "text": "Rebecca Braun, Caricia Catalani, Julian Wimbush, and Dennis Israelski. 2013. Community health workers and mobile technology: a systematic review of the literature. PloS one 8, 6 (2013), e65772.",
      "doi": ""
    },
    {
      "text": "Rakesh K Chadda, Vivek Agarwal, Megha Chandra Singh, and Deepak Raheja. 2001. Help seeking behaviour of psychiatric patients before seeking care at a mental hospital. International Journal of Social Psychiatry 47, 4 (2001), 71--78.",
      "doi": ""
    },
    {
      "text": "Bir Singh Chavan, Rohit Garg, and Rachna Bhargava. 2012. Role of 24 hour telephonic helpline in delivery of mental health services. Indian journal of medical sciences 66 (2012).",
      "doi": ""
    },
    {
      "text": "Pamela Y Collins, Vikram Patel, Sarah S Joestl, Dana March, Thomas R Insel, Abdallah S Daar, Isabel A Bordin, E Jane Costello, Maureen Durkin, Christopher Fairburn, and others. 2011. Grand challenges in global mental health. Nature 475, 7354 (2011), 27.",
      "doi": ""
    },
    {
      "text": "Catherine M Coveney, Kristian Pollock, Sarah Armstrong, and John Moore. 2012. Callers' experiences of contacting a national suicide prevention helpline. Crisis (2012).",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media. In Seventh international AAAI conference on weblogs and social media.",
      "doi": ""
    },
    {
      "text": "Brian DeRenzi, Gaetano Borriello, Jonathan Jackson, Vikram S Kumar, Tapan S Parikh, Pushwaz Virk, and Neal Lesh. 2011. Mobile phone tools for field-based health care workers in low-income countries. Mount Sinai Journal of Medicine: A Journal of Translational and Personalized Medicine 78, 3 (2011), 406--418.",
      "doi": ""
    },
    {
      "text": "Brian DeRenzi, Leah Findlater, Jonathan Payne, Benjamin Birnbaum, Joachim Mangilima, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving community health worker performance through automated SMS. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. ACM, 25--34.",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Tara Donker, Katherine Petrie, Judy Proudfoot, Janine Clarke, Mary-Rose Birch, and Helen Christensen. 2013. Smartphones for smarter delivery of mental health programs: a systematic review. Journal of medical Internet research 15, 11 (2013), e247.",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye, David Nemer, Josiah Mangiameli, Amy S Bruckman, and Neha Kumar. 2018. El Paquete Semanal: The Week's Internet in Havana. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 639.",
      "doi": "10.1145/3173574.3174213"
    },
    {
      "text": "Paula England, Michelle Budig, and Nancy Folbre. 2002. Wages of virtue: The relative pay of care work. Social problems 49, 4 (2002), 455--473.",
      "doi": ""
    },
    {
      "text": "F Euteneuer, K Dannehl, A Del Rey, H Engler, M Schedlowski, and W Rief. 2017. Immunological effects of behavioral activation with exercise in major depression: an exploratory randomized controlled trial. Translational psychiatry 7, 5 (2017), e1132.",
      "doi": ""
    },
    {
      "text": "Candi P Feller and R Rocco Cottone. 2003. The importance of empathy in the therapeutic alliance. The Journal of Humanistic Counseling, Education and Development 42, 1 (2003), 53--61.",
      "doi": ""
    },
    {
      "text": "The Live Love Laugh Foundation. 2019. (2019). https://www.thelivelovelaughfoundation.org/helpline.html",
      "doi": ""
    },
    {
      "text": "Doris A Fuller, H Richard Lamb, Michael Biasotti, and John Snook. 2015. Overlooked in the undercounted: The role of mental illness in fatal law enforcement encounters. Treatment Advocacy Center (2015).",
      "doi": ""
    },
    {
      "text": "Madelyn S Gould, Jimmie LH Munfakh, Marjorie Kleinman, and Alison M Lake. 2012. National suicide prevention lifeline: enhancing mental health care for suicidal individuals and other people in crisis. Suicide and Life-Threatening Behavior 42, 1 (2012), 22--35.",
      "doi": ""
    },
    {
      "text": "Kathleen M Griffiths, Andrew J Mackinnon, Dimity A Crisp, Helen Christensen, Kylie Bennett, and Louise Farrer. 2012. The effectiveness of an online support group for members of the community with depression: a randomised controlled trial. PloS one 7, 12 (2012), e53244.",
      "doi": ""
    },
    {
      "text": "L Hector and RTP Aguirre. 2009. Why do people choose to volunteer for crisis hotlines. International Journal of Volunteer Administration 26, 3 (2009), 42--50.",
      "doi": ""
    },
    {
      "text": "Katherine W Hobbs, Patrick J Monette, Praise Owoyemi, Courtney Beard, Scott L Rauch, Kerry J Ressler, and Ipsit V Vahia. 2019. Incorporating Information From Electronic and Social Media Into Psychiatric and Psychotherapeutic Patient Care: Survey Among Clinicians. Journal of medical Internet research 21, 7 (2019), e13218.",
      "doi": ""
    },
    {
      "text": "Befrienders India. 2019. (2019). http://www.befriendersindia.net/helpline-details.php",
      "doi": ""
    },
    {
      "text": "Stephanie Ingram, Jay L Ringle, Kristen Hallstrom, David E Schill, Virginia M Gohr, and Ronald W Thompson. 2008. Coping with crisis across the lifespan: The role of a telephone hotline. Journal of Child and Family Studies 17, 5 (2008), 663--674.",
      "doi": ""
    },
    {
      "text": "Loree A Johnson and Benjamin E Caldwell. 2011. Race, gender, and therapist confidence: Effects on satisfaction with the therapeutic relationship in MFT. The American Journal of Family Therapy 39, 4 (2011), 307--324.",
      "doi": ""
    },
    {
      "text": "Esther Jung, Martin Wiesjahn, Winfried Rief, and Tania M Lincoln. 2015. Perceived therapist genuineness predicts therapeutic alliance in cognitive behavioural therapy for psychosis. British Journal of Clinical Psychology 54, 1 (2015), 34--48.",
      "doi": ""
    },
    {
      "text": "Ritsuko Kakuma, Harry Minas, Nadja Van Ginneken, Mario R Dal Poz, Keshav Desiraju, Jodi E Morris, Shekhar Saxena, and Richard M Scheffler. 2011. Human resources for mental health care: current situation and strategies for action. The Lancet 378, 9803 (2011), 1654--1663.",
      "doi": ""
    },
    {
      "text": "Karin Källander, James K Tibenderana, Onome J Akpogheneta, Daniel L Strachan, Zelee Hill, Augustinus HA ten Asbroek, Lesong Conteh, Betty R Kirkwood, and Sylvia R Meek. 2013. Mobile health (mHealth) approaches and lessons for increased performance and retention of community health workers in low-and middle-income countries: a review. Journal of medical Internet research 15, 1 (2013), e17.",
      "doi": ""
    },
    {
      "text": "Walid KH Fakhoury. 2002. Suicidal callers to a national helpline in the UK: A comparison of depressive and psychotic sufferers. Archives of Suicide Research 6, 4 (2002), 363--371.",
      "doi": ""
    },
    {
      "text": "Arthur Kleinman. 1978. Concepts and a model for the comparison of medical systems as cultural systems. Social Science & Medicine. Part B: Medical Anthropology 12 (1978), 85--93.",
      "doi": ""
    },
    {
      "text": "David Allen Knickerbocker. 1974. Lay volunteer and professional trainee therapeutic functioning and outcomes in a suicide and crisis intervention service. (1974).",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Azra Ismail, Samyukta Sherugar, and Rajesh Chandwani. 2019. Restoration Work: Responding to Everyday Challenges of HIV Outreach. Proceedings of the ACM on Human-Computer Interaction CSCW (2019).",
      "doi": "10.1145/3359156"
    },
    {
      "text": "Michael J Lambert and Dean E Barley. 2001. Research summary on the therapeutic relationship and psychotherapy outcome. Psychotherapy: Theory, research, practice, training 38, 4 (2001), 357.",
      "doi": ""
    },
    {
      "text": "Reeva Lederman, John Gleeson, Greg Wadley, Simon D'alfonso, Simon Rice, Olga Santesteban-Echarri, and Mario Alvarez-Jimenez. 2019. Support for carers of young people with mental illness: design and trial of a technology-mediated therapy. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 1 (2019), 4.",
      "doi": "10.1145/3301421"
    },
    {
      "text": "Charlotte P Lee, Paul Dourish, and Gloria Mark. 2006. The human infrastructure of cyberinfrastructure. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 483--492.",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Crisis Text Line. 2019. (May 2019). https://www.crisistextline.org/",
      "doi": ""
    },
    {
      "text": "Nilima Mehta. 2008. Child protection and juvenile justice system. Mumbai, Childline India Foundation (2008).",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam and Robin S Grenier. 2019. Qualitative research in practice: Examples for discussion and analysis. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Konrad Ed Michel and David A Jobes. 2011. Building a therapeutic alliance with the suicidal patient. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Howard L Miller, David W Coombs, JAMES D Leeper, and STEPHEN N Barton. 1984. An analysis of the effects of suicide prevention facilities on suicide rates in the United States. American Journal of Public Health 74, 4 (1984), 340--343.",
      "doi": ""
    },
    {
      "text": "Robert R Morris, Stephen M Schueller, and Rosalind W Picard. 2015. Efficacy of a web-based, crowdsourced peer-to-peer cognitive reappraisal platform for depression: randomized controlled trial. Journal of medical Internet research 17, 3 (2015), e72.",
      "doi": ""
    },
    {
      "text": "Elizabeth L Murnane, Tara G Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal informatics in interpersonal contexts: towards the design of technology that supports the social ecologies of long-term mental health management. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 127.",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Sharon Myers. 2000. Empathic listening: Reports on the experience of being heard. Journal of Humanistic Psychology 40, 2 (2000), 148--173.",
      "doi": ""
    },
    {
      "text": "John A Naslund, Kelly A Aschbrenner, Ricardo Araya, Lisa A Marsch, Jürgen Unützer, Vikram Patel, and Stephen J Bartels. 2017. Digital technology for treating and preventing mental disorders in low-income and middle-income countries: a narrative review of the literature. The Lancet Psychiatry 4, 6 (2017), 486--500.",
      "doi": ""
    },
    {
      "text": "John A Naslund, Rahul Shidhaye, and Vikram Patel. 2019. Digital Technology for Building Capacity of Nonspecialist Health Workers for Task Sharing and Scaling Up Mental Health Care Globally. Harvard review of psychiatry 27, 3 (2019), 181--192.",
      "doi": ""
    },
    {
      "text": "Mark Nichter. 1981. Idioms of distress: Alternatives in the expression of psychosocial distress: A case study from South India. Culture, medicine and psychiatry 5, 4 (1981), 379--408.",
      "doi": ""
    },
    {
      "text": "Devyani Nighoskar. 2018. 40 Unanswered Calls Show Us The Grim Reality Of Suicide Helplines In India. Homegrown (2018).",
      "doi": ""
    },
    {
      "text": "7 Cups of Tea. 2019. (May 2019). https://www.7cups.com/",
      "doi": ""
    },
    {
      "text": "Office of the Surgeon General (US, National Action Alliance for Suicide Prevention (US, and others. 2012. 2012 national strategy for suicide prevention: goals and objectives for action: a report of the US Surgeon General and of the National Action Alliance for Suicide Prevention. (2012).",
      "doi": ""
    },
    {
      "text": "Kathleen O'Leary, Stephen M Schueller, Jacob O Wobbrock, and Wanda Pratt. 2018. \"Suddenly, we got to become therapists for each other\": Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 331.",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Vikram Patel, Mario Maj, Alan J Flisher, Mary J De Silva, MIRJA KOSCHORKE, Martin Prince, WPA Zonal, Member Society Representatives, Raymond Tempier, Michelle Riba, Mauricio Sanchez, and others. 2010. Reducing the treatment gap for mental disorders: a WPA survey. World Psychiatry 9, 3 (2010), 169--176.",
      "doi": ""
    },
    {
      "text": "Vikram Patel, Shekhar Saxena, Crick Lund, Graham Thornicroft, Florence Baingana, Paul Bolton, Dan Chisholm, Pamela Y Collins, Janice L Cooper, Julian Eaton, and others. 2018. The Lancet Commission on global mental health and sustainable development. The Lancet 392, 10157 (2018), 1553--1598.",
      "doi": ""
    },
    {
      "text": "Vikram Patel, Helen A Weiss, Neerja Chowdhary, Smita Naik, Sulochana Pednekar, Sudipto Chatterjee, Mary J De Silva, Bhargav Bhat, Ricardo Araya, Michael King, and others. 2010. Effectiveness of an intervention led by lay health counsellors for depressive and anxiety disorders in primary care in Goa, India (MANAS): a cluster randomised controlled trial. The Lancet 376, 9758 (2010), 2086--2095.",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Naveena Karusala, Divya Siddarth, Pattie Gonsalves, Seema Mehrotra, John A Naslund, Mamta Sood, Neha Kumar, and Amit Sharma. 2019. Mental health in the global south: challenges and opportunities in HCI for development. In Proceedings of the Conference on Computing & Sustainable Societies. ACM, 22--36.",
      "doi": "10.1145/3314344.3332483"
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging pregnant women in Kenya with a hybrid computer-human SMS communication system. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1429--1438.",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Yada Pruksachatkun, Sachin R Pendse, and Amit Sharma. 2019. Moments of Change: Analyzing Peer-Based Cognitive Support in Online Mental Health Forums. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 64.",
      "doi": "10.1145/3290605.3300294"
    },
    {
      "text": "Patrick J Raue, Marvin R Goldfried, and Michael Barkham. 1997. The therapeutic alliance in psychodynamic-interpersonal and cognitive-behavioral therapy. Journal of Consulting and Clinical Psychology 65, 4 (1997), 582.",
      "doi": ""
    },
    {
      "text": "Carl Ransom Rogers and others. 1959. A theory of therapy, personality, and interpersonal relationships: As developed in the client-centered framework. Vol. 3. McGraw-Hill New York.",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Benjamin Sugar, John Torous, Bruno Abrahao, and Munmun De Choudhury. 2019. A Social Media Study on the Effects of Psychiatric Medication Use. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 440--451.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The human infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. ACM, 40.",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Gayatri Saraf, Prabha S Chandra, Geetha Desai, and Girish N Rao. 2018. What adolescent girls know about mental health: findings from a mental health literacy survey from an urban slum setting in India. Indian journal of psychological medicine 40, 5 (2018), 433.",
      "doi": ""
    },
    {
      "text": "I Seidman. 2006. A guide for researchers in education and the social sciences. (2006).",
      "doi": ""
    },
    {
      "text": "Jay Shore. 2015. The evolution and history of telepsychiatry and its impact on psychiatric care: current implications for psychiatrists and psychiatric organizations. International Review of Psychiatry 27, 6 (2015), 469--475.",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Nikki Theofanopoulou, Alessia Cecchet, Peter Cottrell, Ferran Altarriba Bertran, Ella Dagan, Julian Childs, and Katherine Isbister. 2018. I just let him cry...: Designing Socio-Technical Interventions in Families to Prevent Mental Health Disorders. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 160.",
      "doi": "10.1145/3274429"
    },
    {
      "text": "Lucy Smith, Jane EM Callaghan, and Lisa C Fellin. 2018. A qualitative study exploring the experience and motivations of UK Samaritan volunteers: \"Why do we do it?\". British Journal of Guidance & Counselling (2018), 1--11.",
      "doi": ""
    },
    {
      "text": "Sujata Sriram, Aparna Joshi, and Paras Sharma. 2016. Telephone Counselling in India: Lessons from iCALL. In Counselling in India. Springer, 201--216.",
      "doi": ""
    },
    {
      "text": "Amresh Srivastava, Megan Johnston, Larry Stitt, Meghana Thanksr, Sunita Iyer, and others. 2013. Suicidal ideation in callers to a crisis hotline in Mumbai. Journal of Public Health 5, 7 (2013), 305--308.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Jeffery C. Bowker. 1999. The ethnography of infrastructure. American behavioral scientist 43, 3 (1999), 377--391.",
      "doi": ""
    },
    {
      "text": "TalkSpace. 2019. (May 2019). https://www.talkspace.com/",
      "doi": ""
    },
    {
      "text": "Tigest Tamrat and Stan Kachnowski. 2012. Special delivery: an analysis of mHealth in maternal and newborn health programs and their outcomes around the world. Maternal and child health journal 16, 5 (2012), 1092--1101.",
      "doi": ""
    },
    {
      "text": "Chad Varah. 1973. The Samaritans in the '70s: To befriend the suicidal and despairing. Constable.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet swara: A community-moderated voice forum in rural india. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 417--426.",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2637--2646.",
      "doi": "10.1145/2470654.2481365"
    }
  ]
}