{
  "doi": "10.1145/3313831.3376194",
  "title": "Dynamics of Aimed Mid-air Movements",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Mid-air arm movements are ubiquitous in VR, AR, and gestural interfaces. While mouse movements have received some attention, the dynamics of mid-air movements are understudied in HCI. In this paper we present an exploratory analysis of the dynamics of aimed mid-air movements. We explore the 3rd order lag (3OL) and existing 2nd order lag (2OL) models for modeling these dynamics. For a majority of movements the 3OL model captures mid-air dynamics better, in particular acceleration. The models can effectively predict the complete time series of position, velocity and acceleration of aimed movements given an initial state and a target using three (2OL) or four (3OL) free parameters.",
  "tags": [
    "movement dynamics",
    "aimed movements",
    "control theory",
    "mid-air movements"
  ],
  "authors": [
    {
      "name": "Myroslav Bachynskyi",
      "institution": "University of Bayreuth, Bayreuth, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558398056",
      "orcid": "missing"
    },
    {
      "name": "Jörg Müller",
      "institution": "University of Bayreuth, Bayreuth, Germany",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "William Abend, Emilio Bizzi, and Pietro Morasso. 1982. Human arm trajectory formation. Brain: a journal of neurology 105, Pt 2 (1982), 331--348.",
      "doi": ""
    },
    {
      "text": "Stanislav Aranovskiy, Rosane Ushirobira, Denis Efimov, and Géry Casiez. 2016. Modeling pointing tasks in mouse-based human-computer interactions. In Decision and Control (CDC), 2016 IEEE 55th Conference on. IEEE, 6595--6600.",
      "doi": "10.1109/CDC.2016.7799284"
    },
    {
      "text": "Christopher G Atkeson and John M Hollerbach. 1985. Kinematic features of unrestrained vertical arm movements. Journal of Neuroscience 5, 9 (1985), 2318--2330.",
      "doi": ""
    },
    {
      "text": "Myroslav Bachynskyi, Antti Oulasvirta, Gregorio Palmas, and Tino Weinkauf. 2014. Is motion capture-based biomechanical simulation valid for HCI studies?: Study and implications. In Proc. CHI. ACM, 3215--3224.",
      "doi": "10.1145/2556288.2557027"
    },
    {
      "text": "Myroslav Bachynskyi, Gregorio Palmas, Antti Oulasvirta, and Tino Weinkauf. 2015. Informing the Design of Novel Input Methods with Muscle Coactivation Clustering. ACM Trans. Comput.-Hum. Interact. 21, 6, Article 30 (Jan. 2015), 25 pages. DOI: http://dx.doi.org/10.1145/2687921",
      "doi": "10.1145/2687921"
    },
    {
      "text": "Jean Blouin, Normand Teasdale, Chantal Bard, and Michelle Fleury. 1993. Directional control of rapid arm movements: The role of the kinetic visual feedback system. Canadian Journal of Experimental Psychology/Revue canadienne de psychologie expérimentale 47, 4 (1993), 678.",
      "doi": ""
    },
    {
      "text": "Otmar Bock. 1990. Load compensation in human goal-directed arm movements. Behavioural Brain Research 41, 3 (1990), 167 -- 177. DOI: http://dx.doi.org/https://doi.org/10.1016/0166--4328(90)90106-O",
      "doi": ""
    },
    {
      "text": "Reinoud J. Bootsma, Laure Fernandez, and Denis Mottet. 2004. Behind Fitts' law: kinematic patterns in goal-directed movements. International Journal of Human-Computer Studies 61, 6 (2004), 811--821.",
      "doi": "10.1016/j.ijhcs.2004.09.004"
    },
    {
      "text": "Daniel Bullock and Stephen Grossberg. 1988. Neural dynamics of planned arm movements: emergent invariants and speed-accuracy properties during trajectory formation. Psychological review 95, 1 (1988), 49.",
      "doi": ""
    },
    {
      "text": "Richard G. Costello. 1968. The surge model of the well-trained human operator in simple manual control. IEEE Transactions on Man--Machine Systems 9, 1 (1968).",
      "doi": ""
    },
    {
      "text": "ERFW Crossman. 1957. The speed and accuracy of simple hand movements. The nature and acquisition of industrial skills (1957).",
      "doi": ""
    },
    {
      "text": "E. R. F. W. Crossman and P. J. Goodeve. 1983. Feedback control of hand-movement and Fitts' law. The Quarterly Journal of Experimental Psychology 35, 2 (1983), 251--278.",
      "doi": ""
    },
    {
      "text": "Menashe Dornay, Yoji Uno, Mitsuo Kawato, and Ryoji Suzuki. 1996. Minimum muscle-tension change trajectories predicted by using a 17-muscle model of the monkey's arm. Journal of motor behavior 28, 2 (1996), 83--100.",
      "doi": ""
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381--391.",
      "doi": ""
    },
    {
      "text": "Tamar Flash and Neville Hogan. 1985. The Coordination of Arm Movements: An Experimentally Confirmed Mathematical Model. Journal of neuroscience 5 (1985), 1688--1703.",
      "doi": ""
    },
    {
      "text": "Tamar Flash, Yaron Meirovitch, and Avi Barliya. 2013. Models of human movement: Trajectory planning and inverse kinematics studies. Robotics and Autonomous Systems 61, 4 (2013), 330 -- 339. DOI: http://dx.doi.org/https://doi.org/10.1016/j.robot.2012.09.020 Models and Technologies for Multi-modal Skill Training.",
      "doi": "10.1016/j.robot.2012.09.020"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2004. Pointing at Trivariate Targets in 3D Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). Association for Computing Machinery, New York, NY, USA, 447--454. DOI: http://dx.doi.org/10.1145/985692.985749",
      "doi": "10.1145/985692.985749"
    },
    {
      "text": "Yves Guiard. 1993. On Fitts's and Hooke's laws: Simple harmonic movement in upper-limb cyclical aiming. Acta psychologica 82, 1 (1993), 139--159.",
      "doi": ""
    },
    {
      "text": "Christopher M Harris and Daniel M Wolpert. 1998. Signal-dependent noise determines motor planning. Nature 394, 6695 (1998), 780.",
      "doi": ""
    },
    {
      "text": "Neville Hogan and Tamar Flash. 1987. Moving gracefully: quantitative theories of motor coordination. Trends in Neurosciences 10, 4 (1987), 170 -- 174. DOI: http://dx.doi.org/https://doi.org/10.1016/0166--2236(87)90043--9",
      "doi": ""
    },
    {
      "text": "J. M. Hollerbach, S. P. Moore, and C. G. Atkeson. 1987. Workspace Effect in Arm Movement Kinematics Derived by Joint Interpolation. Springer US, Boston, MA, 197--208. DOI: http://dx.doi.org/10.1007/978--1--4615--7508--5_34",
      "doi": ""
    },
    {
      "text": "C.I. Howarth, W.D.A. Beggs, and J.M. Bowden. 1971. The relationship between speed and accuracy of movement aimed at a target. Acta Psychologica 35, 3 (1971), 207 -- 218. DOI: http://dx.doi.org/https://doi.org/10.1016/0001--6918(71)90022--9",
      "doi": ""
    },
    {
      "text": "Richard J. Jagacinski and John M. Flach. 2003. Control Theory for Humans: Quantitative approaches to modeling performance. Lawrence Erlbaum, Mahwah, New Jersey.",
      "doi": ""
    },
    {
      "text": "Mitsuo Kawato. 1988. Adaptation and learning in control of voluntary movement by the central nervous system. Advanced Robotics 3, 3 (1988), 229--249. DOI: http://dx.doi.org/10.1163/156855389X00127",
      "doi": ""
    },
    {
      "text": "Francesco Lacquaniti, Carlo Terzuolo, and Paolo Viviani. 1983. The law relating the kinematic and figural aspects of drawing movements. Acta Psychologica 54, 1 (1983), 115 -- 130. DOI: http://dx.doi.org/https://doi.org/10.1016/0001--6918(83)90027--6",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie. 1992. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7, 1 (1992), 91--139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Duane T. McRuer and Henry R. Jex. 1967. A review of quasi-linear pilot models. IEEE Trans. on Human Factors in Electronics 8, 3 (1967), 231--249.",
      "doi": ""
    },
    {
      "text": "David E. Meyer, J. E. Keith Smith, Sylvan Kornblum, Richard A. Abrams, and Charles. E. Wright. 1990. Speed-accuracy trade-offs in aimed movements: Toward a theory of rapid voluntary action. M. Jeannerod (Ed.), Attention and Performance XIII (1990), 173--226.",
      "doi": ""
    },
    {
      "text": "Denis Mottet and Reinoud J. Bootsma. 1999. The dynamics of goal-directed rhythmical aiming. Biological cybernetics 80, 4 (1999), 235--245.",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Antti Oulasvirta, and Roderick Murray-Smith. 2017. Control Theoretic Models of Pointing. ACM Trans. Comput.-Hum. Interact. 24, 4, Article 27 (Aug. 2017), 36 pages. DOI: http://dx.doi.org/10.1145/3121431",
      "doi": "10.1145/3121431"
    },
    {
      "text": "K. M. Newell, L. G. Carlton, Seonjin Kim, and Chung-Hee Chung. 1993. Space-Time Accuracy of Rapid Movements. Journal of Motor Behavior 25, 1 (1993), 8--20. DOI: http://dx.doi.org/10.1080/00222895.1993.9941635 PMID: 12730037.",
      "doi": ""
    },
    {
      "text": "Rieko Osu, Yoji Uno, Yasuharu Koike, and Mitsuo Kawato. 1997. Possible explanations for trajectory curvature in multijoint arm movements. Journal of Experimental Psychology: Human Perception and Performance 23, 3 (1997), 890.",
      "doi": ""
    },
    {
      "text": "Rejean Plamondon. 1998. A kinematic theory of rapid human movements: Part III. Kinetic outcomes. Biological Cybernetics 78, 2 (1998), 133--145. DOI: http://dx.doi.org/10.1007/s004220050420",
      "doi": ""
    },
    {
      "text": "Réjean Plamondon and Adel M Alimi. 1997. Speed/accuracy trade-offs in target-directed movements. Behavioral and brain sciences 20, 02 (1997), 279--303.",
      "doi": ""
    },
    {
      "text": "Réjean Plamondon and Moussa Djioua. 2006. A multi-level representation paradigm for handwriting stroke generation. Human Movement Science 25, 4 (2006), 586 -- 607. DOI: http://dx.doi.org/https://doi.org/10.1016/j.humov.2006.07.004 Advances in Graphonomics: Studies on Fine Motor Control, Its Development and Disorders.",
      "doi": ""
    },
    {
      "text": "Frank E. Pollick and Gensel Ishimura. 1996. The Three-Dimensional Curvature of Straight-Ahead Movements. Journal of Motor Behavior 28, 3 (1996), 271--279. DOI: http://dx.doi.org/10.1080/00222895.1996.9941751 PMID: 12529209.",
      "doi": ""
    },
    {
      "text": "Stefan Schaal and Dagmar Sternad. 2001. Origins and violations of the 2/3 power law in rhythmic three-dimensional arm movements. Experimental brain research 136, 1 (2001), 60--72.",
      "doi": ""
    },
    {
      "text": "Richard A. Schmidt and Timothy D. Lee. 2005. Motor Control and Learning. Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Thomas B. Sheridan and William R. Ferrell. 1974. Man-machine Systems: Information, Control, and Decision Models of Human Performance. M.I.T. Press, Cambridge, USA.",
      "doi": ""
    },
    {
      "text": "R.W. Soukoreff and I.S. MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. IJHCS 61, 6 (2004), 751--789. DOI: http://dx.doi.org/10.1016/j.ijhcs.2004.09.001 Fitts' Law 50 Years Later: Applications and Contributions from Human-Computer Interaction.",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Emanuel Todorov. 2004. Optimality principles in sensorimotor control. Nature neuroscience 7, 9 (2004), 907.",
      "doi": ""
    },
    {
      "text": "Emanuel Todorov and Michael I Jordan. 2002. Optimal feedback control as a theory of motor coordination. Nature neuroscience 5, 11 (2002), 1226.",
      "doi": ""
    },
    {
      "text": "Emanuel Todorov and Weiwei Li. 2003. Optimal control methods suitable for biomechanical systems. In Proceedings of the 25th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (IEEE Cat. No. 03CH37439), Vol. 2. IEEE, 1758--1761.",
      "doi": ""
    },
    {
      "text": "Emanuel Todorov, Weiwei Li, and Xiuchuan Pan. 2005. From task parameters to motor synergies: A hierarchical framework for approximately optimal control of redundant manipulators. Journal of Robotic Systems 22, 11 (2005), 691--710. DOI: http://dx.doi.org/10.1002/rob.20093",
      "doi": "10.5555/1093567.1093575"
    },
    {
      "text": "Francisco J. Valero-Cuevas, Madhusudhan Venkadesan, and Emanuel Todorov. 2009. Structured Variability of Muscle Activations Supports the Minimal Intervention Principle of Motor Control. Journal of Neurophysiology 102, 1 (2009), 59--68. DOI: http://dx.doi.org/10.1152/jn.90324.2008 PMID: 19369362.",
      "doi": ""
    },
    {
      "text": "Paolo Viviani and Tamar Flash. 1995. Minimum-Jerk, Two-Thirds Power Law, and Isochrony: Converging Approaches to Movement Planning. Journal of Experimental Psychology: Human Perception and Performance 21, 1 (1995), 32--53. DOI: http://dx.doi.org/10.1037/0096--1523.21.1.32",
      "doi": ""
    },
    {
      "text": "P. Viviani and C. Terzuolo. 1982. Trajectory determines movement dynamics. Neuroscience 7, 2 (1982), 431 -- 437. DOI: http://dx.doi.org/https://doi.org/10.1016/0306--4522(82)90277--9",
      "doi": ""
    },
    {
      "text": "A.T. Welford, A.H. Norris, and N.W. Shock. 1969. Speed and accuracy of movement and their changes with age. Acta Psychologica 30 (1969), 3 -- 15. DOI: http://dx.doi.org/https://doi.org/10.1016/0001--6918(69)90034--1",
      "doi": ""
    },
    {
      "text": "Daniel M Wolpert. 1997. Computational approaches to motor control. Trends in cognitive sciences 1, 6 (1997), 209--216.",
      "doi": ""
    },
    {
      "text": "Daniel M Wolpert and Zoubin Ghahramani. 2000. Computational principles of movement neuroscience. Nature neuroscience 3, 11s (2000), 1212.",
      "doi": ""
    }
  ]
}