{
  "doi": "10.1145/3313831.3376746",
  "title": "Spinneret: Aiding Creative Ideation through Non-Obvious Concept Associations",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Mind mapping is a popular way to explore a design space in creative thinking exercises, allowing users to form associations between concepts. Yet, most existing digital tools for mind mapping focus on authoring and organization, with little support for addressing the challenges of mind mapping such as stagnation and design fixation. We present Spinneret, a functional approach to aid mind mapping by providing suggestions based on a knowledge graph. Spinneret uses biased random walks to explore the knowledge graph in the neighborhood of an existing concept node in the mind map, and provides \"suggestions\" for the user to add to the mind map. A comparative study with a baseline mind-mapping tool reveals that participants created more diverse and distinct concepts with Spinneret, and reported that the suggestions inspired them to think of ideas they would otherwise not have explored.",
  "tags": [
    "creativity",
    "knowledge graph",
    "suggestion",
    "mind mapping"
  ],
  "authors": [
    {
      "name": "Suyun Sandra Bae",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527372",
      "orcid": "0000-0002-2023-6219"
    },
    {
      "name": "Oh-Hyun Kwon",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528319",
      "orcid": "missing"
    },
    {
      "name": "Senthil Chandrasegaran",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549216656",
      "orcid": "0000-0003-0561-2148"
    },
    {
      "name": "Kwan-Liu Ma",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452595774",
      "orcid": "0000-0001-8086-0366"
    }
  ],
  "references": [
    {
      "text": "Faez Ahmed, Mark Fuge, and Lev D Gorbunov. 2016. Discovering diverse, high quality design ideas from a large corpus. In ASME International Design Engineering Technical Conferences and Computers and Information in Engineering Conference. V007T06A008--V007T06A008. DOI: http://dx.doi.org/10.1115/detc2016--59926",
      "doi": ""
    },
    {
      "text": "Salvatore Andolina, Hendrik Schneider, Joel Chan, Khalil Klouche, Giulio Jacucci, and Steven Dow. 2017. Crowdboard: augmenting in-person idea generation with real-time crowds. In Proceedings of the ACM SIGCHI Conference on Creativity and Cognition. 106--118. DOI: http://dx.doi.org/10.1145/3059454.3059477",
      "doi": "10.1145/3059454.3059477"
    },
    {
      "text": "William Benjamin, Senthil Chandrasegaran, Devarajan Ramanujan, Niklas Elmqvist, SVN Vishwanathan, and Karthik Ramani. 2014. Juxtapoze: supporting serendipity and creative expression in clipart compositions. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 341--350. DOI: http://dx.doi.org/0.1145/2556288.2557327",
      "doi": "10.1145/2556288.2557327"
    },
    {
      "text": "Matt R Bohm, Jayson P Vucovich, and Robert B Stone. 2008. Using a design repository to drive concept generation. Journal of Computing and Information Science in Engineering 8, 1 (2008), 014502. DOI: http://dx.doi.org/10.1115/1.2830844",
      "doi": ""
    },
    {
      "text": "Vincent R Brown and Paul B Paulus. 2002. Making group brainstorming more effective: Recommendations from an associative memory perspective. Current Directions in Psychological Science 11, 6 (2002), 208--212. DOI: http://dx.doi.org/10.1111/1467--8721.00202",
      "doi": ""
    },
    {
      "text": "Edgar Brunner and Ullrich Munzel. 2000. The Nonparametric Behrens-Fisher Problem: Asymptotic Theory and a Small-Sample Approximation. Biometrical Journal 42, 1 (2000), 17--25. DOI: http://dx.doi.org/10.1002/(SICI)1521--4036(200001)42: 117::AID-BIMJ173.0.CO;2-U",
      "doi": ""
    },
    {
      "text": "Tony Buzan. 1974. Use both sides ofyour brain. New York: EP Dutton.",
      "doi": ""
    },
    {
      "text": "Tony Buzan and Barry Buzan. 1993. The mind map book. BBC Books, London.",
      "doi": ""
    },
    {
      "text": "Ting-Ju Chen, Sai Ganesh Subramanian, and Vinayak R Krishnamurthy. 2019. Mini-map: Mixed-initiative mind-mapping via contextual query expansion. In AIAA Scitech Forum. 2347. DOI: http://dx.doi.org/10.2514/6.2019--2347",
      "doi": ""
    },
    {
      "text": "Andrew Clayphan, Anthony Collins, Christopher Ackad, Bob Kummerfeld, and Judy Kay. 2011. Firestorm: a brainstorming application for collaborative group work at tabletops. In Proceedings of the ACM international conference on interactive tabletops and surfaces. 162--171. DOI: http://dx.doi.org/10.1145/2076354.2076386",
      "doi": "10.1145/2076354.2076386"
    },
    {
      "text": "Jeff Conklin and Michael L Begeman. 1987. gIBIS: A hypertext tool for team design deliberation. In Proceedings of the ACM conference on Hypertext. 247--251. DOI: http://dx.doi.org/10.1145/317426.317444",
      "doi": "10.1145/317426.317444"
    },
    {
      "text": "George W. Divine, H. James Norton, Anna E. Barón, and Elizabeth Juarez-Colunga. 2018. The Wilcoxon-Mann--Whitney Procedure Fails as a Test of Medians. The American Statistician 72, 3 (2018), 278--286. DOI: http://dx.doi.org/10.1080/00031305.2017.1305291",
      "doi": ""
    },
    {
      "text": "Karl Duncker and Lynne S Lees. 1945. On problem-solving. Psychological monographs 58, 5 (1945), 1--112. DOI: http://dx.doi.org/10.1037/h0093599",
      "doi": ""
    },
    {
      "text": "Martin J Eppler. 2006. A comparison between concept maps, mind maps, conceptual diagrams, and visual metaphors as complementary tools for knowledge construction and sharing. Information visualization 5, 3 (2006), 202--210. DOI: http://dx.doi.org/10.1057/palgrave.ivs.9500131",
      "doi": ""
    },
    {
      "text": "Morten W. Fagerland and Leiv Sandvik. 2009. The Wilcoxon--Mann--Whitney test under scrutiny. Statistics in Medicine 28, 10 (2009), 1487--1497. DOI: http://dx.doi.org/10.1002/sim.3561",
      "doi": ""
    },
    {
      "text": "John H Flavell, Allan Cooper, and Robert H Loiselle. 1958. Effect of the number of pre-utilization functions on functional fixedness in problem solving. Psychological Reports 4, 3 (1958), 343--350. DOI: http://dx.doi.org/10.2466/PR0.4.3.343--350",
      "doi": ""
    },
    {
      "text": "Jonathan L Freedman. 1965. Increasing creativity by free-association training. Journal of experimental psychology 69, 1 (1965), 89. DOI: http://dx.doi.org/10.1037/h0021659",
      "doi": ""
    },
    {
      "text": "Florian Geyer, Jochen Budzinski, and Harald Reiterer. 2012. IdeaVis: a hybrid workspace and interactive visualization for paper-based collaborative sketching sessions. In Proceedings of the ACM Nordic Conference on Human-Computer Interaction. 331--340. DOI: http://dx.doi.org/10.1145/2399016.2399069",
      "doi": "10.1145/2399016.2399069"
    },
    {
      "text": "Victor Girotto, Erin Walker, and Winslow Burleson. 2017. The effect of peripheral micro-tasks on crowd ideation. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 1843--1854. DOI: http://dx.doi.org/10.1145/3025453.3025464",
      "doi": "10.1145/3025453.3025464"
    },
    {
      "text": "Victor Girotto, Erin Walker, and Winslow Burleson. 2019. CrowdMuse: Supporting Crowd Idea Generation through User Modeling and Adaptation. In Proceedings of the ACM Conference on Creativity and Cognition. 95--106. DOI: http://dx.doi.org/10.1145/3325480.3325497",
      "doi": "10.1145/3325480.3325497"
    },
    {
      "text": "M Gonçalves, C Cardoso, and P Badke-Schaub. 2012. How far is too far? Using different abstraction levels in textual and visual stimuli. In Proceedings of the International Design Conference.",
      "doi": ""
    },
    {
      "text": "Mark D. Gross and Ellen Yi-Luen Do. 1996. Ambiguous Intentions: A Paper-like Interface for Creative Design. In Proceedings of the ACM Symposium on User Interface Software and Technology. 183--192. DOI: http://dx.doi.org/10.1145/237091.237119",
      "doi": ""
    },
    {
      "text": "Aditya Grover and Jure Leskovec. 2016. node2vec: Scalable feature learning for networks. In Proceedings of the ACM SIGKDD international conference on Knowledge discovery and data mining. 855--864. DOI: http://dx.doi.org/10.1145/2939672.2939754",
      "doi": "10.1145/2939672.2939754"
    },
    {
      "text": "Joy Paul Guilford. 1956. The structure of intellect. Psychological bulletin 53, 4 (1956), 267. DOI: http://dx.doi.org/10.1037/h0040755",
      "doi": ""
    },
    {
      "text": "Joshua Hailpern, Erik Hinterbichler, Caryn Leppert, Damon Cook, and Brian P Bailey. 2007. TEAM STORM: demonstrating an interaction model for working with multiple ideas during creative group work. In Proceedings of the ACM Conference on Creativity & Cognition. 193--202. DOI: http://dx.doi.org/10.1145/1254960.1254987",
      "doi": "10.1145/1254960.1254987"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. 139--183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9",
      "doi": ""
    },
    {
      "text": "David G Jansson and Steven M Smith. 1991. Design fixation. Design studies 12, 1 (1991), 3--11. DOI: http://dx.doi.org/10.1016/0142--694X(91)90003-F",
      "doi": ""
    },
    {
      "text": "Stephen G Kobourov, Tamara Mchedlidze, and Laura Vonessen. 2015. Gestalt principles in graph drawing. In International Symposium on Graph Drawing. 558--560. DOI: http://dx.doi.org/10.1007/978--3--319--27261-0_50",
      "doi": "10.1007/978-3-319-27261-0_50"
    },
    {
      "text": "Vasilije Kokotovich. 2008. Problem analysis and thinking tools: an empirical study of non-hierarchical mind mapping. Design studies 29, 1 (2008), 49--69. DOI: http://dx.doi.org/10.1016/j.destud.2007.09.001",
      "doi": ""
    },
    {
      "text": "B Kudrowitz and Caitlin Dippo. 2013. When does a paper clip become a sundial? Exploring the progression of originality in the alternative uses test. Journal of Integrated Design and Process Science 17, 4 (2013), 3--18. DOI: http://dx.doi.org/10.3233/jid-2013-0018",
      "doi": "10.5555/2692121.2692123"
    },
    {
      "text": "Barry Kudrowitz and David Wallace. 2010. Improvisational Comedy and Product Design Ideation: Making Non-Obvious Connections between Seemingly Unrelated Things. In Proceedings of the International Conference on Design and Emotion. Chicago. DOI: http://dx.doi.org/10.5281/zenodo.2596847",
      "doi": ""
    },
    {
      "text": "Thomas D LaToza, Micky Chen, Luxi Jiang, Mengyao Zhao, and André Van Der Hoek. 2015. Borrowing from the crowd: A study of recombination in software design competitions. In IEEE International Conference on Software Engineering, Vol. 1. 551--562.",
      "doi": ""
    },
    {
      "text": "Alex Julian Leeds, Barry Kudrowitz, and Jieun Kwon. 2019. Mapping associations: exploring divergent thinking through mind mapping. International Journal of Design Creativity and Innovation 7, 1--2 (2019), 16--29. DOI: http://dx.doi.org/10.1080/21650349.2018.1463178",
      "doi": ""
    },
    {
      "text": "Julie S Linsey and Blake Becker. 2011. Effectiveness of brainwriting techniques: comparing nominal groups to real teams. In Design creativity 2010. 165--171. DOI: http://dx.doi.org/10.1007/978-0--85729--224--7_22",
      "doi": ""
    },
    {
      "text": "Abraham S Luchins. 1942. Mechanization in problem solving: The effect of Einstellung. Psychological monographs 54, 6 (1942), i. DOI: http://dx.doi.org/10.1037/h0093502",
      "doi": ""
    },
    {
      "text": "Geke DS Ludden, Barry M Kudrowitz, Hendrik NJ Schifferstein, and Paul Hekkert. 2012. Surprise and humor in product design. Humor 25, 3 (2012), 285--309. DOI: http://dx.doi.org/10.1515/humor-2012-0015",
      "doi": ""
    },
    {
      "text": "Kenneth R MacCrimmon and Christian Wagner. 1994. Stimulating ideas through creative software. Management science 40, 11 (1994), 1514--1532. DOI: http://dx.doi.org/10.1287/mnsc.40.11.1514",
      "doi": ""
    },
    {
      "text": "Irving Maltzman. 1960. On the training of originality. Psychological review 67, 4 (1960), 229. DOI: http://dx.doi.org/10.1037/h0046364",
      "doi": ""
    },
    {
      "text": "Sarnoff Mednick. 1962. The associative basis of the creative process. Psychological review 69, 3 (1962), 220--232. DOI: http://dx.doi.org/10.1037/h0048850",
      "doi": ""
    },
    {
      "text": "Mindmeister. 2019. (2019). https://www.mindmeister.com/ Accessed: 2019-09--16.",
      "doi": ""
    },
    {
      "text": "MindNode. 2019. (2019). https://mindnode.com/ Accessed: 2019-09--16.",
      "doi": ""
    },
    {
      "text": "Mindomo. 2019. (2019). https://www.mindomo.com/ Accessed: 2019-09--16.",
      "doi": ""
    },
    {
      "text": "Karin Neubert and Edgar Brunner. 2007. A Studentized Permutation Test for the Non-parametric Behrens-Fisher Problem. Computational Statistics and Data Analysis 51, 10 (June 2007), 5192--5204. DOI: http://dx.doi.org/10.1016/j.csda.2006.05.024",
      "doi": "10.1016/j.csda.2006.05.024"
    },
    {
      "text": "Joseph D Novak. 1998. Learning, creating, and using knowledge: Concept maps as facilitative tools in schools and corporations. Lawrence Erlbaum Associates, NJ.",
      "doi": ""
    },
    {
      "text": "Alex Osborn. 1953. Applied Imagination-Principles and Procedures of Creative Writing. Scribner, Oxford.",
      "doi": ""
    },
    {
      "text": "Cecil Piya, Senthil Chandrasegaran, Niklas Elmqvist, Karthik Ramani, and others. 2017. Co-3Deator: A Team-First Collaborative 3D Design Ideation Tool. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 6581--6592. DOI: http://dx.doi.org/10.1145/3025453.3025825",
      "doi": "10.1145/3025453.3025825"
    },
    {
      "text": "Ma Araceli Ruiz-Primo. 2000. On the use of concept maps as an assessment tool in science: What we have learned so far. Revista Electrónica de Investigación Educativa 2, 1 (2000), 29--53.",
      "doi": ""
    },
    {
      "text": "Jami J Shah, Steve M Smith, and Noe Vargas-Hernandez. 2003. Metrics for measuring ideation effectiveness. Design studies 24, 2 (2003), 111--134. DOI: http://dx.doi.org/10.1016/S0142--694X(02)00034-0",
      "doi": ""
    },
    {
      "text": "Jami J Shah, NOE Vargas-Hernandez, Joshua D Summers, and Santosh Kulkarni. 2001. Collaborative Sketching (C-Sketch)-An idea generation technique for engineering design. The Journal of Creative Behavior 35, 3 (2001), 168--198. DOI: http://dx.doi.org/10.1002/j.2162--6057.2001.tb01045.x",
      "doi": ""
    },
    {
      "text": "Yang Shi, Yang Wang, Ye Qi, John Chen, Xiaoyao Xu, and Kwan-Liu Ma. 2017. IdeaWall: improving creative collaboration through combinatorial visual stimuli. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing. 594--603. DOI: http://dx.doi.org/10.1145/2998181.2998208",
      "doi": "10.1145/2998181.2998208"
    },
    {
      "text": "Pao Siangliulue, Kenneth C Arnold, Krzysztof Z Gajos, and Steven P Dow. 2015a. Toward collaborative ideation at scale: Leveraging ideas from others to generate more creative and diverse ideas. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing. 937--945. DOI: http://dx.doi.org/10.1145/2675133.2675239",
      "doi": "10.1145/2675133.2675239"
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Krzysztof Z Gajos, and Steven P Dow. 2015b. Providing timely examples improves the quantity and quality of generated ideas. In Proceedings of the ACM SIGCHI Conference on Creativity and Cognition. 83--92. DOI: http://dx.doi.org/10.1145/2757226.2757230",
      "doi": "10.1145/2757226.2757230"
    },
    {
      "text": "Robyn Speer, Joshua Chin, and Catherine Havasi. 2017. ConceptNet 5.5: An Open Multilingual Graph of General Knowledge. In AAAI. 4444--4451.",
      "doi": ""
    },
    {
      "text": "Christine A Toh and Scarlett R Miller. 2016. Choosing creativity: the role of individual risk and ambiguity aversion on creative concept selection in engineering design. Research in Engineering Design 27, 3 (2016), 195--219. DOI: http://dx.doi.org/10.1007/s00163-015-0212--1",
      "doi": ""
    },
    {
      "text": "David G Ullman, Thomas G Dietterich, and Larry A Stauffer. 1988. A model of the mechanical design process based on empirical data. Artificial Intelligence in Engineering, Design, Analysis, and Manufacturing 2, 1 (1988), 33--52. DOI: http://dx.doi.org/10.1017/S0890060400000536",
      "doi": ""
    },
    {
      "text": "Hao-Chuan Wang, Dan Cosley, and Susan R Fussell. 2010. Idea expander: supporting group brainstorming with conversationally triggered visual thinking stimuli. In Proceedings of the ACM conference on Computer supported cooperative work. 103--106. DOI: http://dx.doi.org/10.1145/1718918.1718938",
      "doi": "10.1145/1718918.1718938"
    },
    {
      "text": "Zhenpeng Zhao, Sriram Karthik Badam, Senthil Chandrasegaran, Deok Gun Park, Niklas LE Elmqvist, Lorraine Kisselburgh, and Karthik Ramani. 2014. skWiki: a multimedia sketching system for collaborative creativity. In Proceedings of the ACM conference on Human factors in computing systems. 1235--1244. DOI: http://dx.doi.org/10.1145/2556288.2557394",
      "doi": "10.1145/2556288.2557394"
    },
    {
      "text": "Fritz Zwicky. 1967. The morphological approach to discovery, invention, research and construction. In New methods of thought and procedure. 273--297. DOI: http://dx.doi.org/10.1007/978--3--642--87617--2_14",
      "doi": ""
    }
  ]
}