{
  "doi": "10.1145/3313831.3376281",
  "title": "MaraVis: Representation and Coordinated Intervention of Medical Encounters in Urban Marathon",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "There is an increased use of Internet-of-Things and wearable sensing devices in the urban marathon to ensure effective response to unforeseen medical needs. However, the massive amount of real-time, heterogeneous movement and psychological data of runners impose great challenges on prompt medical incident analysis and intervention. Conventional approaches compile such data into one dashboard visualization to facilitate rapid data absorption but fail to support joint decision-making and operations in medical encounters. In this paper, we present MaraVis, a real-time urban marathon visualization and coordinated intervention system. It first visually summarizes real-time marathon data to facilitate the detection and exploration of possible anomalous events. Then, it calculates an optimal camera route with an arrangement of shots to guide offline effort to catch these events in time with a smooth view transition. We conduct a within-subjects study with two baseline systems to assess the efficacy of MaraVis.",
  "authors": [
    {
      "name": "Quan Li",
      "institution": "WeBank, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528631",
      "orcid": "missing"
    },
    {
      "name": "Huanbin Lin",
      "institution": "WeBank, ShenZhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528152",
      "orcid": "missing"
    },
    {
      "name": "Xiguang Wei",
      "institution": "WeBank, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528799",
      "orcid": "missing"
    },
    {
      "name": "Yangkun Huang",
      "institution": "WeBank, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527956",
      "orcid": "missing"
    },
    {
      "name": "Lixin Fan",
      "institution": "WeBank, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659736177",
      "orcid": "missing"
    },
    {
      "name": "Jian Du",
      "institution": "Tencent, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528833",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    },
    {
      "name": "Tianjian Chen",
      "institution": "WeBank, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659345281",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Edward Anstead, Steve Benford, and Robert Houghton. 2016. MarathOn multiscreen: group television watching and interaction in a viewing ecology. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 405--417.",
      "doi": "10.1145/2818048.2820003"
    },
    {
      "text": "William H Bares, Somying Thainimit, Scott McDermott, and C Boudreaux. 2000. A model for constraint-based camera planning. In Proceedings of AAAI spring symposium on smart graphics. 84--91.",
      "doi": ""
    },
    {
      "text": "Vic Barnett and Toby Lewis. 1974. Outliers in statistical data. Wiley.",
      "doi": ""
    },
    {
      "text": "Mehmet Basdere, Gabriel Caniglia, Charles Collar, Christian Rozolis, George Chiampas, Michael Nishi, and Karen Smilowitz. 2019. SAFE: A Comprehensive Data Visualization System. Interfaces (2019).",
      "doi": ""
    },
    {
      "text": "Mehmet Ba¸ sdere, Colleen Ross, Jennifer L Chan, Sanjay Mehrotra, Karen Smilowitz, and George Chiampas. 2014. Acute incident rapid response at a mass-gathering event through comprehensive planning systems: a case report from the 2013 Shamrock Shuffle. Prehospital and disaster medicine 29, 3 (2014), 320--325.",
      "doi": ""
    },
    {
      "text": "Stephen D Bay and Mark Schwabacher. 2003. Mining distance-based outliers in near linear time with randomization and a simple pruning rule. In Proceedings of the ninth ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 29--38.",
      "doi": "10.1145/956750.956758"
    },
    {
      "text": "Lauren C Benson, Christian A Clermont, Eva Bo?njak, and Reed Ferber. 2018. The use of wearable devices for walking and running gait analysis outside of the lab: A systematic review. Gait & posture 63 (2018), 124--138.",
      "doi": ""
    },
    {
      "text": "Jim Blinn. 1988. Where am I? What am I looking at? (cinematography). IEEE Computer Graphics and Applications 8, 4 (1988), 76--81.",
      "doi": "10.1109/38.7751"
    },
    {
      "text": "Markus M Breunig, Hans-Peter Kriegel, Raymond T Ng, and Jörg Sander. 2000. LOF: identifying density-based local outliers. In ACM sigmod record, Vol. 29. ACM, 93--104.",
      "doi": "10.1145/342009.335388"
    },
    {
      "text": "Yunqiang Chen, Xiang Sean Zhou, and Thomas S Huang. 2001. One-class SVM for learning in image retrieval.. In ICIP (1). Citeseer, 34--37.",
      "doi": ""
    },
    {
      "text": "George Chiampas and Carrie A Jaworski. 2009. Preparing for the surge: perspectives on marathon medical preparedness. Current sports medicine reports 8, 3 (2009), 131--135.",
      "doi": ""
    },
    {
      "text": "Dorin Comaniciu and Peter Meer. 2002. Mean shift: A robust approach toward feature space analysis. IEEE Transactions on Pattern Analysis & Machine Intelligence 5 (2002), 603--619.",
      "doi": "10.1109/34.1000236"
    },
    {
      "text": "Oliver Faust, Alex Shenfield, Murtadha Kareem, Tan Ru San, Hamido Fujita, and U Rajendra Acharya. 2018. Automated detection of atrial fibrillation using long short-term memory network with RR interval signals. Computers in biology and medicine 102 (2018), 327--335.",
      "doi": ""
    },
    {
      "text": "Martin D Flintham, Raphael Velt, Max L Wilson, Edward J Anstead, Steve Benford, Anthony Brown, Timothy Pearce, Dominic Price, and James Sprinks. 2015. Run spot run: capturing and tagging footage of a race by crowds of spectators. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 747--756.",
      "doi": "10.1145/2702123.2702463"
    },
    {
      "text": "Taylor Hanken, Sam Young, Karen Smilowitz, George Chiampas, and David Waskowski. 2016. Developing a data visualization system for the Bank of America Chicago Marathon (Chicago, Illinois USA). Prehospital and disaster medicine 31, 5 (2016), 572--577.",
      "doi": ""
    },
    {
      "text": "Gabriel A Hare, Keith Mertens, Matias Perez, ROY Neeloy, and David Holz. 2018. Non-linear motion capture using Frenet-Serret frames. (Jan. 2 2018). US Patent 9,857,876.",
      "doi": ""
    },
    {
      "text": "Ville Hautamaki, Ismo Karkkainen, and Pasi Franti. 2004. Outlier detection using k-nearest neighbour graph. In Proceedings of the 17th International Conference on Pattern Recognition, 2004. ICPR 2004., Vol. 3. IEEE, 430--433.",
      "doi": ""
    },
    {
      "text": "Simon Hawkins, Hongxing He, Graham Williams, and Rohan Baxter. 2002. Outlier detection using replicator neural networks. In International Conference on Data Warehousing and Knowledge Discovery. Springer, 170--180.",
      "doi": "10.5555/646111.679466"
    },
    {
      "text": "Christina R Hollis, Rachel M Koldenhoven, Jacob E Resch, and Jay Hertel. 2019. Running biomechanics as measured by wearable sensors: effects of speed and surface. Sports biomechanics (2019), 1--11.",
      "doi": ""
    },
    {
      "text": "Andreas Kind, Marc Ph Stoecklin, and Xenofontas Dimitropoulos. 2009. Histogram-based traffic anomaly detection. IEEE Transactions on Network and Service Management 6, 2 (2009), 110--121.",
      "doi": "10.1109/TNSM.2009.090604"
    },
    {
      "text": "Joseph B Kruskal. 1964. Multidimensional scaling by optimizing goodness of fit to a nonmetric hypothesis. Psychometrika 29, 1 (1964), 1--27.",
      "doi": ""
    },
    {
      "text": "Pavel Laskov, Konrad Rieck, Christin Schäfer, and Klaus-Robert Müller. 2005. Visualization of anomaly detection using prediction sensitivity.. In Sicherheit, Vol. 2. 197--208.",
      "doi": ""
    },
    {
      "text": "Quan Li, Kristanto Sean Njotoprawiro, Hammad Haleem, Qiaoan Chen, Chris Yi, and Xiaojuan Ma. 2018. EmbeddingVis: A Visual Analytics Approach to Comparative Network Embedding Inspection. arXiv preprint arXiv:1808.09074 (2018).",
      "doi": ""
    },
    {
      "text": "Quan Li, Qiaomu Shen, Yao Ming, Peng Xu, Yun Wang, Xiaojuan Ma, and Huamin Qu. 2017. A visual analytics approach for understanding egocentric intimacy network evolution and impact propagation in MMORPGs. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 31--40.",
      "doi": ""
    },
    {
      "text": "Jessica Lin, Eamonn Keogh, and Stefano Lonardi. 2005. Visualizing and discovering non-trivial patterns in large time series databases. Information visualization 4, 2 (2005), 61--82.",
      "doi": ""
    },
    {
      "text": "Christophe Lino and Marc Christie. 2015. Intuitive and efficient camera control with the toric space. ACM Transactions on Graphics (TOG) 34, 4 (2015), 82.",
      "doi": "10.1145/2766965"
    },
    {
      "text": "Christophe Lino, Marc Christie, Fabrice Lamarche, Guy Schofield, and Patrick Olivier. 2010. A real-time cinematography system for interactive 3d environments. In Proceedings of the 2010 ACM SIGGRAPH/Eurographics Symposium on Computer Animation. Eurographics Association, 139--148.",
      "doi": "10.5555/1921427.1921449"
    },
    {
      "text": "Fei Tony Liu, Kai Ming Ting, and Zhi-Hua Zhou. 2008. Isolation forest. In 2008 Eighth IEEE International Conference on Data Mining. IEEE, 413--422.",
      "doi": "10.1109/ICDM.2008.17"
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of machine learning research 9, Nov (2008), 2579--2605.",
      "doi": ""
    },
    {
      "text": "Matthew V Mahoney and Philip K Chan. 2003. Learning rules for anomaly detection of hostile network traffic. Technical Report.",
      "doi": ""
    },
    {
      "text": "Danielle M McCarthy, George T Chiampas, Sanjeev Malik, Kendra Cole, Patricia Lindeman, and James G Adams. 2011. Enhancing community disaster resilience through mass sporting events. Disaster medicine and public health preparedness 5, 4 (2011), 310--315.",
      "doi": ""
    },
    {
      "text": "George Moody. 1983. A new method for detecting atrial fibrillation using RR intervals. Computers in Cardiology (1983), 227--230.",
      "doi": ""
    },
    {
      "text": "Heather L O'Brien, Paul Cairns, and Mark Hall. 2018. A practical approach to measuring user engagement with the refined user engagement scale (UES) and new UES short form. International Journal of Human-Computer Studies 112 (2018), 28--39.",
      "doi": ""
    },
    {
      "text": "Jim O'Donoghue, Mark Roantree, Bryan Cullen, Niall Moyna, Conor O'Sullivan, and Andrew McCarren. 2015. Anomaly and event detection for unsupervised athlete performance data. (2015).",
      "doi": ""
    },
    {
      "text": "PhysioToolkit PhysioBank. 2000. PhysioNet: components of a new research resource for complex physiologic signals. Circulation. v101 i23. e215-e220 (2000).",
      "doi": ""
    },
    {
      "text": "Monika Pobiruchin, Julian Suleder, Richard Zowalla, and Martin Wiesner. 2017. Accuracy and adoption of wearable technology used by active citizens: a marathon event field study. JMIR mHealth and uHealth 5, 2 (2017), e24.",
      "doi": ""
    },
    {
      "text": "Fayez Qureshi and Sridhar Krishnan. 2018. Wearable Hardware Design for the Internet of Medical Things (IoMT). Sensors 18, 11 (2018), 3812.",
      "doi": ""
    },
    {
      "text": "Roberto Ranon and Tommaso Urli. 2014. Improving the efficiency of viewpoint composition. IEEE Transactions on Visualization and Computer Graphics 20, 5 (2014), 795--807.",
      "doi": "10.1109/TVCG.2013.2297932"
    },
    {
      "text": "Nandakumar Selvaraj, Ashok Jaryal, Jayashree Santhosh, Kishore K Deepak, and Sneh Anand. 2008. Assessment of heart rate variability derived from finger-tip photoplethysmography as compared to electrocardiography. Journal of medical engineering & technology 32, 6 (2008), 479--484.",
      "doi": ""
    },
    {
      "text": "Ekrem Serin, Serdar Hasan Adali, and Selim Balcisoy. 2012. Automatic path generation for terrain navigation. Computers & Graphics 36, 8 (2012), 1013--1024.",
      "doi": "10.1016/j.cag.2012.08.006"
    },
    {
      "text": "Mei-Ling Shyu, Shu-Ching Chen, Kanoksri Sarinnapakorn, and LiWu Chang. 2003. A novel anomaly detection scheme based on principal component classifier. Technical Report. MIAMI UNIV CORAL GABLES FL DEPT OF ELECTRICAL AND COMPUTER ENGINEERING.",
      "doi": ""
    },
    {
      "text": "Dmitry Sokolov and Dimitri Plemenos. 2008. Virtual world explorations by using topological and semantic knowledge. The Visual Computer 24, 3 (2008), 173--185.",
      "doi": "10.1007/s00371-007-0182-z"
    },
    {
      "text": "Pere-Pau Vázquez, Miquel Feixas, Mateu Sbert, and Wolfgang Heidrich. 2001. Viewpoint selection using viewpoint entropy.. In VMV, Vol. 1. 273--280.",
      "doi": "10.5555/647260.718491"
    },
    {
      "text": "Yun Wang, Zhutian Chen, Quan Li, Xiaojuan Ma, Qiong Luo, and Huamin Qu. 2016. Animated narrative visualization for video clickstream data. In SIGGRAPH Asia 2016 Symposium on Visualization. ACM, 11.",
      "doi": "10.1145/3002151.3002155"
    },
    {
      "text": "Stephan Weibelzahl. 2001. Evaluation of adaptive systems. In International Conference on User Modeling. Springer, 292--294.",
      "doi": "10.5555/647664.760620"
    },
    {
      "text": "Weng-Keen Wong, Andrew W Moore, Gregory F Cooper, and Michael M Wagner. 2003. Bayesian network anomaly pattern detection for disease outbreaks. In Proceedings of the 20th International Conference on Machine Learning (ICML-03). 808--815.",
      "doi": ""
    },
    {
      "text": "Ke Xie, Hao Yang, Shengqiu Huang, Dani Lischinski, Marc Christie, Kai Xu, Minglun Gong, Daniel Cohen-Or, and Hui Huang. 2018. Creating and chaining camera moves for qadrotor videography. ACM Transactions on Graphics (TOG) 37, 4 (2018), 88.",
      "doi": "10.1145/3197517.3201284"
    },
    {
      "text": "Ke Xu, Yun Wang, Leni Yang, Yifang Wang, Bo Qiao, Si Qin, Yong Xu, Haidong Zhang, and Huamin Qu. 2019. CloudDet: Interactive Visual Analysis of Anomalous Performances in Cloud Computing Systems. arXiv preprint arXiv:1907.13187 (2019).",
      "doi": ""
    },
    {
      "text": "Kenji Yamanishi, Jun-Ichi Takeuchi, Graham Williams, and Peter Milne. 2004. On-line unsupervised outlier detection using finite mixtures with discounting learning algorithms. Data Mining and Knowledge Discovery 8, 3 (2004), 275--300.",
      "doi": "10.1023/B%3ADAMI.0000023676.72185.7c"
    }
  ]
}