{
  "doi": "10.1145/3313831.3376734",
  "title": "In-game and Out-of-game Social Anxiety Influences Player Motivations, Activities, and Experiences in MMORPGs",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Socializing is an important part of why people choose to play games and is at the core of many game mechanics. Anxiety and fear about social interactions can lead to withdrawal from socializing in the physical world, yet players with social anxiety preferentially choose MMORPGs — a highly social genre — raising questions of whether social anxiety expresses differently during in-game interactions. In the present study (N=181), we explore whether and how social anxiety translates into MMORPGs. By developing a measure of in-game social anxiety, we find that although fear and apprehension of socializing in the physical and game worlds are related, they differently affect preferences, behaviours, and experiences. Social anxiety in the physical world drives reasons for playing, whereas in-game anxiety affects behaviours, reducing participation in activities related to socializing and difficult in-game challenges. Our findings can inform the design of social games and the links between social anxiety and social gaming.",
  "tags": [
    "social anxiety",
    "online gaming",
    "MMORPG",
    "socializing"
  ],
  "authors": [
    {
      "name": "Martin Dechant",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659229134",
      "orcid": "missing"
    },
    {
      "name": "Susanne Poeller",
      "institution": "University of Trier, Trier, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022338",
      "orcid": "missing"
    },
    {
      "name": "Colby Johanson",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019578",
      "orcid": "missing"
    },
    {
      "name": "Katelyn Wiley",
      "institution": "University of Saskatchewn, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526885",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lynn E. Alden and Charles T. Taylor. 2004. Interpersonal processes in social phobia. Clinical Psychology Review. https://doi.org/10.1016/j.cpr.2004.07.006",
      "doi": ""
    },
    {
      "text": "Sultan A. Alharthi, Ruth C. Torres, Ahmed S. Khalaf, Zachary O. Toups, Igor Dolgov, and Lennart E. Nacke. 2018. Investigating the impact of annotation interfaces on player performance In distributed multiplayer games. In Conference on Human Factors in Computing Systems Proceedings. https://doi.org/10.1145/3173574.3173888",
      "doi": ""
    },
    {
      "text": "Yunus Alkis, Zafer Kadirhan, and Mustafa Sat. 2017. Development and Validation of Social Anxiety Scale for Social Media Users. In Computers in Human Behavior. https://doi.org/10.1016/j.chb.2017.03.011",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. 2013. Diagnostic and statistical manual of mental disorders?: DSM-5. American Psychiatric Association. https://doi.org/10.1176/appi.books.9780890425596.7440",
      "doi": ""
    },
    {
      "text": "Vishag A. Badrinarayanan, Jeremy J. Sierra, and Harry A. Taute. 2014. Determinants and outcomes of online brand tribalism: Exploring communities of massively multiplayer online role playing games (MMORPGs). Psychology and Marketing. https://doi.org/10.1002/mar.20739",
      "doi": ""
    },
    {
      "text": "David S Baldwin and Christel Buis. 2004. Burden of social anxiety disorder. In Social anxiety disorder. CRC Press, 74--82.",
      "doi": ""
    },
    {
      "text": "Mary Elizabeth Ballard and Kelly Marie Welch. 2017. Virtual Warfare: Cyberbullying and Cyber-Victimization in MMOG Play. Games and Culture. https://doi.org/10.1177/1555412015592473",
      "doi": ""
    },
    {
      "text": "Jane Barnett and Mark Coulson. 2010. Virtually Real: A Psychological Perspective on Massively Multiplayer Online Games. Review of General Psychology. https://doi.org/10.1037/a0019442",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister and Mark R Leary. 1995. The Need to Belong?: Desire for Interpersonal Attachments as a Fundamental Human Motivation. 117, 3: 497--529.",
      "doi": ""
    },
    {
      "text": "Joël Billieux, Martial Van Der Linden, Sophia Achab, Yasser Khazaal, Laura Paraskevopoulos, Daniele Zullino, and Gabriel Thorens. 2013. Why do you play World of Warcraft? An in-depth exploration of self-reported motivations to play online and in-game behaviours in the virtual world of Azeroth. Computers in Human Behavior. https://doi.org/10.1016/j.chb.2012.07.021",
      "doi": ""
    },
    {
      "text": "Staffan Björk. 2008. Games, gamers, and gaming understanding game research. In MindTrek - 12th International MindTrek Conference: Entertainment and Media in the Ubiquitous Era. https://doi.org/10.1145/1457199.1457213",
      "doi": ""
    },
    {
      "text": "Susan M. Bögels, Lynn Alden, Deborah C. Beidel, Lee Anna Clark, Daniel S. Pine, Murray B. Stein, and Marisol Voncken. 2010. Social anxiety disorder: Questions and answers for the DSM-V. Depression and Anxiety. https://doi.org/10.1002/da.20670",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Klaus Opwis, and Elisa D. Mekler. 2018. \"An odd kind of pleasure\": Differentiating emotional challenge in digital games. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3173574.3173615",
      "doi": ""
    },
    {
      "text": "Jason T. Bowey, Max V. Birk, and Regan L. Mandryk. 2015. Manipulating leaderboards to induce player experience. In CHI PLAY 2015 - Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. https://doi.org/10.1145/2793107.2793138",
      "doi": ""
    },
    {
      "text": "Jason T Bowey, Ansgar E Depping, and Regan L Mandryk. 2017. Don't Talk Dirty to Me: How Sexist Beliefs Affect Experience in Sexist Games. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3025453.3025563",
      "doi": "10.1145/3025453.3025563"
    },
    {
      "text": "Nicholas David Bowman and Daniel Schultheiss. 2008. Community vs. Soloplaying in Multiplayer Internetgames A Typology of Internet Games. The Player Conference.",
      "doi": ""
    },
    {
      "text": "Kirk Warren Brown and Richard M. Ryan. 2003. The Benefits of Being Present: Mindfulness and Its Role in Psychological Well-Being. Journal of Personality and Social Psychology. https://doi.org/10.1037/00223514.84.4.822",
      "doi": ""
    },
    {
      "text": "Julia D. Buckner, Norman B. Schmidt, Alan R. Lang, Jason W. Small, Robert C. Schlauch, and Peter M. Lewinsohn. 2008. Specificity of social anxiety disorder as a risk factor for alcohol and cannabis dependence. Journal of Psychiatric Research. https://doi.org/10.1016/j.jpsychires.2007.01.002",
      "doi": ""
    },
    {
      "text": "Mark G Chen. 2009. Communication, Coordination, and Camaraderie in World of Warcraft. 47--73.",
      "doi": ""
    },
    {
      "text": "Boreum Choi, Inseong Lee, Dongseong Choi, and Jinwoo Kim. 2007. Collaborate and share: An experimental study of the effects of task and reward interdependencies in online games. Cyberpsychology and Behavior. https://doi.org/10.1089/cpb.2007.9985",
      "doi": ""
    },
    {
      "text": "Vítor Alexandre Coelho and Ana Maria Romão. 2018. The relation between social anxiety, social withdrawal and (cyber)bullying roles: A multilevel analysis. Computers in Human Behavior. https://doi.org/10.1016/j.chb.2018.04.048",
      "doi": ""
    },
    {
      "text": "Helena Cole and Mark D. Griffiths. 2007. Social interactions in massively multiplayer online role-playing gamers. Cyberpsychology and Behavior. https://doi.org/10.1089/cpb.2007.9988",
      "doi": ""
    },
    {
      "text": "Sadie H. Cole and Jill M. Hooley. 2013. Clinical and Personality Correlates of MMO Gaming: Anxiety and Absorption in Problematic Internet Use. Social Science Computer Review. https://doi.org/10.1177/0894439312475280",
      "doi": ""
    },
    {
      "text": "Samantha Cuming and Ronald M. Rapee. 2010. Social anxiety and self-protective communication style in close relationships. Behaviour Research and Therapy. https://doi.org/10.1016/j.brat.2009.09.010",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping, Colby Johanson, and Regan L. Mandryk. 2018. Designing for friendship: Modeling properties of play, in-game social capital, and psychological well-being. In CHI PLAY 2018 Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play, 87--100. https://doi.org/10.1145/3242671.3242702",
      "doi": ""
    },
    {
      "text": "Emese Domahidi, Johannes Breuer, Rachel Kowert, Ruth Festl, and Thorsten Quandt. 2018. A Longitudinal Analysis of Gaming- and Non-Gaming-Related Friendships and Social Support among Social Online Game Players. Media Psychology 21, 2: 288--307. https://doi.org/10.1080/15213269.2016.1257393",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication. https://doi.org/10.1111/j.1083--6101.2007.00367.x",
      "doi": ""
    },
    {
      "text": "ESA and Entertainment Software Assotiation. 2015. 2015 Essential Facts About the Computer and Video Game Industry. Retrieved from http://www.theesa.com/facts/pdfs/ESA_EF_2008.pdf",
      "doi": ""
    },
    {
      "text": "ESA, Entertainment Software Assotiation, ESA, and Entertainment Software Assotiation. 2019. 2019 Essential Facts About the Computer and Video Game Industry. Retrieved from http://www.theesa.com/facts/pdfs/ESA_EF_2008.pdf",
      "doi": ""
    },
    {
      "text": "Chek Yang Foo and Elina M.I. Koivisto. 2004. Defining grief play in MMORPGs: Player and developer perceptions. In ACM International Conference Proceeding Series.",
      "doi": ""
    },
    {
      "text": "D. M. Fresco, M. E. Coles, R. G. Heimberg, M. R. Liebowitz, S. Hami, M. B. Stein, and D. Goetz. 2001. The Liebowitz Social Anxiety Scale: A comparison of the psychometric properties of self-report and clinician administered formats. Psychological Medicine. https://doi.org/10.1017/S0033291701004056",
      "doi": ""
    },
    {
      "text": "Luis-Joaquin Garcia-Lopez, Maria do Ceu Salvador, and Andres De Los Reyes. 2015. Assessment of Social Anxiety in Adolescents. In Social Anxiety and Phobia in Adolescents: Development, Manifestation and Intervention Strategies, Klaus Ranta, Annette M La Greca, Luis-Joaquin Garcia-Lopez and Mauri Marttunen (eds.). Springer International Publishing, Cham, 121--150. https://doi.org/10.1007/978--3--319--16703--9_6",
      "doi": ""
    },
    {
      "text": "Dimitri Gavriloff and Joanne Lusher. 2015. Social Anxiety and Mindfulness in Online Gamers. The Computer Games Journal. https://doi.org/10.1007/s40869-015-0010-z",
      "doi": ""
    },
    {
      "text": "James Gee. 2004. Learning by design: Games as learning machines. Interactive Educational Multimedia.",
      "doi": ""
    },
    {
      "text": "Annette M. La Greca and Nadja Lopez. 1998. Social Anxiety among Adolescents: Linkages with peer relations and friendships. Journal of Abnormal Child Psychology. https://doi.org/10.1023/A:1022684520514",
      "doi": ""
    },
    {
      "text": "Mark D. Griffiths, Mark N.O. Davies, and Darren Chappell. 2004. Demographic factors and playing variables in online computer gaming. Cyberpsychology and Behavior. https://doi.org/10.1089/cpb.2004.7.479",
      "doi": ""
    },
    {
      "text": "Mark D. Griffiths, Orsolya Király, Halley M. Pontes, and Zsolt Demetrovics. 2015. An Overview of Problematic Gaming. In Mental Health in the Digital Age. https://doi.org/10.1093/med/9780199380183.003.0002",
      "doi": ""
    },
    {
      "text": "Mark D Griffiths, Daria J Kuss, Olatz Lopez-Fernandez, and Halley M Pontes. 2017. Problematic gaming exists and is an example of disordered gaming: Commentary on: Scholars' open debate paper on the World Health Organization ICD-11 Gaming Disorder proposal (Aarseth et al.). Journal of Behavioral Addictions. https://doi.org/http://dx.doi.org/10.1556/2006.6.2017.037",
      "doi": ""
    },
    {
      "text": "Frederik De Grove, Verolien Cauberghe, and Jan Van Looy. 2016. Development and Validation of an Instrument for Measuring Individual Motives for Playing Digital Games. Media Psychology. https://doi.org/10.1080/15213269.2014.902318",
      "doi": ""
    },
    {
      "text": "David Hauser, Gabriele Paolacci, and Jesse Chandler. 2019. Common concerns with mturk as a participant pool: Evidence and solutions. In Handbook of Research Methods in Consumer Psychology. https://doi.org/10.4324/9781351137713",
      "doi": ""
    },
    {
      "text": "Erik Hedman, Brjánn Ljótsson, Christian Rück, Tomas Furmark, Per Carlbring, Nils Lindefors, and Gerhard Andersson. 2010. Internet administration of self-report measures commonly used in research on social anxiety disorder: A psychometric evaluation. Computers in Human Behavior. https://doi.org/10.1016/j.chb.2010.01.010",
      "doi": ""
    },
    {
      "text": "Richard G. Heimberg. 2002. Cognitive-behavioral therapy for social anxiety disorder: Current status and future directions. Biological Psychiatry. https://doi.org/10.1016/S0006--3223(01)01183-0",
      "doi": ""
    },
    {
      "text": "Isto Huvila, Kim Holmberg, Stefan Ek, and Gunilla Widén-Wulff. 2010. Social capital in second life. Online Information Review. https://doi.org/10.1108/14684521011037007",
      "doi": ""
    },
    {
      "text": "Colby Johanson, Carl Gutwin, and Regan L. Mandryk. 2017. The Effects of Navigation Assistance on Spatial Learning and Performance in a 3D Game. In CHI PLAY 2017 - Proceedings of the Annual Symposium on Computer-Human Interaction in Play. https://doi.org/10.1145/3116595.3116602",
      "doi": ""
    },
    {
      "text": "P. O. Johnson and J. Neyman. 1936. Tests of certain linear hypotheses and their application to some educational problems. Statistical Research Memoirs.",
      "doi": ""
    },
    {
      "text": "Emma Matson Josefine Fahlström. 2014. Preventing Toxic Behavior through Game Mechanics Munson. Degree Project in Game Design, 15 ECTS CreditsGame Design and Graphics alt. Game Design and Programming.",
      "doi": ""
    },
    {
      "text": "Isabel L. Kampmann, Paul M.G. Emmelkamp, and Nexhmedin Morina. 2016. Meta-analysis of technology assisted interventions for social anxiety disorder. Journal of Anxiety Disorders. https://doi.org/10.1016/j.janxdis.2016.06.007",
      "doi": ""
    },
    {
      "text": "Mitchell B. Karpman. 1983. The Johnson-Neyman Technique Using SPSS or BMDP. Educational and Psychological Measurement. https://doi.org/10.1177/001316448304300117",
      "doi": ""
    },
    {
      "text": "Ronald C. Kessler, Patricia Berglund, Olga Demler, Robert Jin, Kathleen R. Merikangas, and Ellen E. Walters. 2005. Lifetime prevalence and age-of-onset distributions of DSM-IV disorders in the national comorbidity survey replication. Archives of General Psychiatry. https://doi.org/10.1001/archpsyc.62.6.593",
      "doi": ""
    },
    {
      "text": "Ronald A. Kleinknecht, Dale L. Dinnel, Erica E. Kleinknecht, Natsuki Hiruma, and Nozomi Harada. 1997. Cultural factors in social anxiety: A comparison of social phobia symptoms and Taijin Kyofusho. Journal of Anxiety Disorders. https://doi.org/10.1016/S08876185(97)00004--2",
      "doi": ""
    },
    {
      "text": "Rachel Kowert, Emese Domahidi, Ruth Festl, and Thorsten Quandt. 2014. Computers in Human Behavior Social gaming, lonely life?? The impact of digital game play on adolescents' social circles. Computers in Human Behavior 36: 385--390. https://doi.org/10.1016/j.chb.2014.04.003",
      "doi": "10.1016/j.chb.2014.04.003"
    },
    {
      "text": "Rachel Kowert, Emese Domahidi, and Thorsten Quandt. 2014. The relationship between online video game involvement and gaming-related friendships among emotionally sensitive individuals. Cyberpsychology, Behavior, and Social Networking. https://doi.org/10.1089/cyber.2013.0656",
      "doi": ""
    },
    {
      "text": "Rachel Kowert, Ruth Festl, and Thorsten Quandt. 2014. Unpopular, overweight, and socially inept: Reconsidering the stereotype of online gamers. Cyberpsychology, Behavior, and Social Networking. https://doi.org/10.1089/cyber.2013.0118",
      "doi": ""
    },
    {
      "text": "Rachel Kowert and Linda K. Kaye. 2012. Video Games Are Not Socially Isolating. 185--195.",
      "doi": ""
    },
    {
      "text": "Rachel Kowert and Julian A. Oldmeadow. 2015. Computers in Human Behavior Playing for social comfort?: Online video game play as a social accommodator for the insecurely attached. Computers in Human Behavior 53: 556--566. https://doi.org/10.1016/j.chb.2014.05.004",
      "doi": "10.1016/j.chb.2014.05.004"
    },
    {
      "text": "Rachel Kowert, Jens Vogelgesang, Ruth Festl, and Thorsten Quandt. 2015. Psychosocial causes and consequences of online video game play. Computers in Human Behavior. https://doi.org/10.1016/j.chb.2014.11.074",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring cyberbullying and other toxic behavior in team competition online games. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Alex Leavitt, Brian C Keegan, and Joshua Clark. 2016. Ping to Win?: Non-Verbal Communication and Team Performance in Competitive Online Multiplayer Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4337--4350. https://doi.org/10.1145/2858036.2858132",
      "doi": "10.1145/2858036.2858132"
    },
    {
      "text": "Shiang Shiang Li, Yevvon Yi Chi Chang, and Wen Bin Chiou. 2017. Things online social networking can take away: Reminders of social networking sites undermine the desirability of offline socializing and pleasures. Scandinavian Journal of Psychology. https://doi.org/10.1111/sjop.12348",
      "doi": ""
    },
    {
      "text": "Michael R Liebowitz. 1987. Social Phobia. Modern problems of pharmacopsychiatry. https://doi.org/10.1159/000414022",
      "doi": ""
    },
    {
      "text": "Marcel Marton?ik and Ján Lok?a. 2016. Do World of Warcraft (MMORPG) players experience less loneliness and social anxiety in online world (virtual environment) than in real world (offline)? Computers in Human Behavior. https://doi.org/10.1016/j.chb.2015.11.035",
      "doi": ""
    },
    {
      "text": "Evan Mayo-Wilson, Sofia Dias, Ifigeneia Mavranezouli, Kayleigh Kew, David M. Clark, A. E. Ades, and Stephen Pilling. 2014. Psychological and pharmacological interventions for social anxiety disorder in adults: A systematic review and network meta-analysis. The Lancet Psychiatry. https://doi.org/10.1016/S22150366(14)70329--3",
      "doi": ""
    },
    {
      "text": "Gregor McEwan and Carl Gutwin. 2016. Chess as a conversation: Artefact-based communication in online competitive board games. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work. https://doi.org/10.1145/2957276.2957314",
      "doi": "10.1145/2957276.2957314"
    },
    {
      "text": "A. C. Miers, A. W. Blöte, M. De Rooij, C. L. Bokhorst, and P. M. Westenberg. 2013. Trajectories of social anxiety during adolescence and relations with cognition, social competence, and temperament. Journal of Abnormal Child Psychology. https://doi.org/10.1007/s10802-012--9651--6",
      "doi": ""
    },
    {
      "text": "Patricia L Obst, Xiang Zhao, Katherine M. White, Erin L. O. Connor, Huon Longman, and Sc Hons. 2018. Game Identity-Based Motivations of Playing World of Warcraft and Their Psychological Outcomes. 21, 10: 655--660. https://doi.org/10.1089/cyber.2018.0185",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci and Jesse Chandler. 2014. Inside the Turk: Understanding Mechanical Turk as a Participant Pool. Current Directions in Psychological Science. https://doi.org/10.1177/0963721414531598",
      "doi": ""
    },
    {
      "text": "Jeong Ha Park, Doug Hyun Han, Bung Nyun Kim, Jae Hoon Cheong, and Young Sik Lee. 2016. Correlations among social anxiety, self-esteem, impulsivity, and game genre in patients with problematic online game playing. Psychiatry Investigation. https://doi.org/10.4306/pi.2016.13.3.297",
      "doi": ""
    },
    {
      "text": "Cale J. Passmore and Regan L. Mandryk. 2018. An about face: Diverse self-representation in games. In CHI PLAY 2018 - Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. https://doi.org/10.1145/3270316.3271552",
      "doi": ""
    },
    {
      "text": "Matt Peckham. 2013. The Inexorable Decline of World of Warcraft. Techland. Retrieved from http://techland.time.com/2013/05/09/the-inexorabledecline-of-world-of-warcraft/",
      "doi": ""
    },
    {
      "text": "Shiri Prizant-Passal, Tomer Shechner, and Idan M. Aderka. 2016. Social anxiety and internet use -- A meta-analysis: What do we know? What are we missing? Computers in Human Behavior 62: 221--229. https://doi.org/https://doi.org/10.1016/j.chb.2016.04.003",
      "doi": "10.1016/j.chb.2016.04.003"
    },
    {
      "text": "Klaus Ranta, Riittakerttu Kaltiala-Heino, Sari Fröjd, and Mauri Marttunen. 2013. Peer victimization and social phobia: A follow-up study among adolescents. Social Psychiatry and Psychiatric Epidemiology. https://doi.org/10.1007/s00127-012-0583--9",
      "doi": ""
    },
    {
      "text": "Klaus Ranta, Riittakerttu Kaltiala-Heino, Mirjami Pelkonen, and Mauri Marttunen. 2009. Associations between peer victimization, self-reported depression and social phobia among adolescents: The role of comorbidity. Journal of Adolescence. https://doi.org/10.1016/j.adolescence.2007.11.005",
      "doi": ""
    },
    {
      "text": "Ronald M. Rapee and Susan H. Spence. 2004. The etiology of social phobia: Empirical evidence and an initial model. Clinical Psychology Review. https://doi.org/10.1016/j.cpr.2004.06.004",
      "doi": ""
    },
    {
      "text": "Nina K. Rytwinski, David M. Fresco, Richard G. Heimberg, Meredith E. Coles, Michael R. Liebowitz, Shadha Cissell, Murray B. Stein, and Stefan G. Hofmann. 2009. Screening for social anxiety disorder with the selfreport version of the liebowitz social anxiety scale. Depression and Anxiety. https://doi.org/10.1002/da.20503",
      "doi": ""
    },
    {
      "text": "Diane J. Schiano, Bonnie Nardi, Thomas Debeauvais, Nicolas Ducheneaut, and Nicholas Yee. 2014. The \"lonely gamer\" revisited. Entertainment Computing. https://doi.org/10.1016/j.entcom.2013.08.002",
      "doi": ""
    },
    {
      "text": "Ashley M. Shaw, Kiara R. Timpano, Tanya B. Tran, and Jutta Joormann. 2015. Correlates of Facebook usage patterns: The relationship between passive Facebook use, social anxiety symptoms, and brooding. Computers in Human Behavior. https://doi.org/10.1016/j.chb.2015.02.003",
      "doi": ""
    },
    {
      "text": "Cuihua Shen and Dmitri Williams. 2011. Unpacking time online: Connecting internet and massively multiplayer online game use with psychosocial well-being. Communication Research. https://doi.org/10.1177/0093650210377196",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Mandy Holbrook, Ponnurangam Kumaraguru, Lorrie Faith Cranor, and Julie Downs. 2010. Who falls for phish? A demographic analysis of phishing susceptibility and effectiveness of interventions. In Conference on Human Factors in Computing Systems Proceedings. https://doi.org/10.1145/1753326.1753383",
      "doi": "10.1145/1753326.1753383"
    },
    {
      "text": "Jeffry A. Simpson, John S. Kim, Jennifer Fillo, William Ickes, W. Steven Rholes, M. Minda Oriña, and Heike A. Winterheld. 2011. Attachment and the management of empathic accuracy in relationship-threatening situations. Personality and Social Psychology Bulletin. https://doi.org/10.1177/0146167210394368",
      "doi": ""
    },
    {
      "text": "Jeffrey G. Snodgrass, Andrew Bagwell, Justin M. Patry, H. J.Francois Dengah, Cheryl Smarr-Foster, Max Van Oostenburg, and Michael G. Lacy. 2018. The partial truths of compensatory and poor-get-poorer internet use theories: More highly involved videogame players experience greater psychosocial benefits. Computers in Human Behavior. https://doi.org/10.1016/j.chb.2017.09.020",
      "doi": ""
    },
    {
      "text": "Susan H. Spence and Ronald M. Rapee. 2016. The etiology of social anxiety disorder: An evidence-based model. Behaviour Research and Therapy. https://doi.org/10.1016/j.brat.2016.06.007",
      "doi": ""
    },
    {
      "text": "Statistica. 2019. World of Warcraft Subscribers per Quater. Retrieved from https://www.statista.com/statistics/276601/number-ofworld-of-warcraft-subscribers-by-quarter/",
      "doi": ""
    },
    {
      "text": "Constance A Steinkuehler and Dmitri Williams. 2006. Where Everybody Knows Your ( Screen ) Name?: Online Games as '\"Third Places.\"' 11: 885--909. https://doi.org/10.1111/j.1083--6101.2006.00300.x",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros, Janne Paavilainen, and Frans Mäyrä. 2009. The many faces of sociability and social play in games. MindTrek 2009 - 13th International Academic MindTrek Conference: Everyday Life in the Ubiquitous Era: 82--89. https://doi.org/10.1145/1621841.1621857",
      "doi": ""
    },
    {
      "text": "Charles T. Taylor and Lynn E. Alden. 2011. To see ourselves as others see us: An experimental integration of the intra and interpersonal consequences of self-protection in social anxiety disorder. Journal of Abnormal Psychology. https://doi.org/10.1037/a0022127",
      "doi": ""
    },
    {
      "text": "Gabriel Thorens, Joel Billieux, Pierre Megevand, Daniele Zullino, Stéphane Rothen, Sophia Achab, and Yasser Khazaal. 2016. Capitalizing upon the attractive and addictive properties of massively multiplayer online roleplaying games to promote wellbeing. Frontiers in Psychiatry. https://doi.org/10.3389/fpsyt.2016.00167",
      "doi": ""
    },
    {
      "text": "Maria Tillfors, Stefan Persson, Maria Willén, and William J. Burk. 2012. Prospective links between social anxiety and adolescent peer relations. Journal of Adolescence. https://doi.org/10.1016/j.adolescence.2012.04.008",
      "doi": ""
    },
    {
      "text": "Zachary O. Toups, Jessica Hammer, William A. Hamilton, Ahmad Jarrah, William Graves, and Oliver Garretson. 2014. A framework for cooperative communication game mechanics from grounded theory. In CHI PLAY 2014 Proceedings of the 2014 Annual Symposium on ComputerHuman Interaction in Play. https://doi.org/10.1145/2658537.2658681",
      "doi": "10.1145/2658537.2658681"
    },
    {
      "text": "Sabine Trepte, Leonard Reinecke, and Keno Juechems. 2012. The social side of gaming: How playing online computer games creates online and offline social support. Computers in Human Behavior 28, 3: 832--839. https://doi.org/10.1016/j.chb.2011.12.003",
      "doi": "10.1016/j.chb.2011.12.003"
    },
    {
      "text": "Sara Ventura, Rosa M. Baños, and Cristina Botella. 2018. Virtual and Augmented Reality: New Frontiers for Clinical Psychology. State of the Art Virtual Reality and Augmented Reality Knowhow. https://doi.org/10.5772/intechopen.74344",
      "doi": ""
    },
    {
      "text": "Aaron C. Weidman, Katya C. Fernandez, Cheri A. Levinson, Adam A. Augustine, Randy J. Larsen, and Thomas L. Rodebaugh. 2012. Compensatory internet use among individuals higher in social anxiety and its implications for well-being. Personality and Individual Differences. https://doi.org/10.1016/j.paid.2012.03.003",
      "doi": ""
    },
    {
      "text": "Dmitri Williams. 2006. On and Off the Net?: Scales for Social Capital in an Online Era. 11: 593--628. https://doi.org/10.1111/j.1083--6101.2006.00029.x",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From tree house to barracks: The social life of guilds in World of Warcraft. Games and Culture. https://doi.org/10.1177/1555412006292616",
      "doi": ""
    },
    {
      "text": "WORLD HEALTH ORGANIZATION. 2018. ICD-11 INTERNATIONAL CLASSIFICATION FOR MORTALITY AND MORBIDITY STATISTICS. WHO.",
      "doi": ""
    },
    {
      "text": "Emriye Hilal Yayan, Duygu Arikan, Fatma Saban, Nazan Gürarslan Ba?, and Özlem Özel Özcan. 2017. Examination of the Correlation Between Internet Addiction and Social Phobia in Adolescents. Western Journal of Nursing Research. https://doi.org/10.1177/0193945916665820",
      "doi": ""
    }
  ]
}