{
  "doi": "10.1145/3313831.3376282",
  "title": "Emotional Footprints of Email Interruptions",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Working in an environment with constant interruptions is known to affect stress, but how do interruptions affect emotional expression? Emotional expression can have significant impact on interactions among coworkers. We analyzed the video of 26 participants who performed an essay task in a laboratory while receiving either continual email interruptions or receiving a single batch of email. Facial videos of the participants were run through a convolutional neural network to determine the emotional mix via decoding of facial expressions. Using a novel co-occurrence matrix analysis, we showed that with batched email, a neutral emotional state is dominant with sadness being a distant second, and with continual interruptions, this pattern is reversed, and sadness is mixed with fear. We discuss the implications of these results for how interruptions can impact employees' well-being and organizational climate.",
  "tags": [
    "co-occurence matrix",
    "convolutional neural network",
    "email interruptions",
    "emotions",
    "facial expressions"
  ],
  "authors": [
    {
      "name": "Christopher Blank",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529630",
      "orcid": "missing"
    },
    {
      "name": "Shaila Zaman",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/do/10.1145/contrib-99659366570/rel-imgonly/img_6145_low_res.jpg",
      "acmid": "99659366570",
      "orcid": "missing"
    },
    {
      "name": "Amanveer Wesley",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/do/10.1145/contrib-99659365461/rel-imgonly/99659365461.jpg",
      "acmid": "99659365461",
      "orcid": "missing"
    },
    {
      "name": "Panagiotis Tsiamyrtzis",
      "institution": "Politechnico di Milano, Milan, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317501327",
      "orcid": "missing"
    },
    {
      "name": "Dennis R. Da Cunha Silva",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366720",
      "orcid": "missing"
    },
    {
      "name": "Ricardo Gutierrez-Osuna",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100001355",
      "orcid": "missing"
    },
    {
      "name": "Gloria Mark",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279599",
      "orcid": "missing"
    },
    {
      "name": "Ioannis Pavlidis",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100120272",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fatema Akbar, Ayse Elvan Bayraktaroglu, Pradeep Buddharaju, Dennis Rodrigo Da Cunha Silva, Ge Gao, Ted Grover, Ricardo Gutierrez-Osuna, Nathan Cooper Jones, Gloria Mark, Ioannis Pavlidis, and et al. 2019. Email makes you sweat: Examining email interruptions and stress using thermal imaging. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 668, 14 pages.",
      "doi": ""
    },
    {
      "text": "Ane Alberdi, Asier Aztiria, and Adrian Basarab. 2016. Towards an automatic early stress recognition system for office environments based on multimodal measurements: A review. Journal of Biomedical Informatics 59 (2016), 49--75.",
      "doi": "10.1016/j.jbi.2015.11.007"
    },
    {
      "text": "Neal M Ashkanasy, Charmine EJ Härtel, and Catherine S Daus. 2002. Diversity and emotion: The new frontiers in organizational behavior research. Journal of Management 28, 3 (2002), 307--338.",
      "doi": ""
    },
    {
      "text": "Tadas Baltruaitis, Daniel McDuff, Ntombikayise Banda, Marwa Mahmoud, Rana El Kaliouby, Peter Robinson, and Rosalind Picard. 2011. Real-time inference of mental states from facial expressions and upper body gestures. In Face and Gesture 2011. IEEE, Piscataway, NJ, USA, 909--914.",
      "doi": ""
    },
    {
      "text": "Stephen R Barley, Debra E Meyerson, and Stine Grodal. 2011. E-mail as a source and symbol of stress. Organization Science 22, 4 (2011), 887--906.",
      "doi": "10.1287/orsc.1100.0573"
    },
    {
      "text": "Sigal Barsade and Olivia A O'Neill. 2016. Manage your emotional culture. Harvard Business Review 94, 1 (2016), 14.",
      "doi": ""
    },
    {
      "text": "Sigal G Barsade. 2002. The ripple effect: Emotional contagion and its influence on group behavior. Administrative Science Quarterly 47, 4 (2002), 644--675.",
      "doi": ""
    },
    {
      "text": "Sigal G Barsade, Constantinos GV Coutifaris, and Julianna Pillemer. 2018. Emotional contagion in organizational life. Research in Organizational Behavior 38 (2018), 137--151.",
      "doi": ""
    },
    {
      "text": "Duncan P Brumby, Helena Du Toit, Harry J Griffin, Ana Tajadura-Jiménez, and Anna L Cox. 2014. Working with the television on: An investigation into media multitasking. In CHI '14 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1807--1812.",
      "doi": "10.1145/2559206.2581210"
    },
    {
      "text": "Pierre-Luc Carrier and Aaron Courville. 2013. Facial Expression Recognition (FER) Dataset. https://www.kaggle.com/c/challenges-in-representation-lear ning-facial-expression-recognition-challenge/data. (2013).",
      "doi": ""
    },
    {
      "text": "Ciprian Adrian Corneanu, Marc Oliu Simón, Jeffrey F Cohn, and Sergio Escalera Guerrero. 2016. Survey on RGB, 3D, thermal, and multimodal approaches for facial expression recognition: History, trends, and affect-related applications. IEEE Transactions on Pattern Analysis and Machine Intelligence 38, 8 (2016), 1548--1568.",
      "doi": "10.1109/TPAMI.2016.2515606"
    },
    {
      "text": "Jean Costa, Alexander T Adams, Malte F Jung, François Guimbretière, and Tanzeem Choudhury. 2016. EmotionCheck: Leveraging bodily signals and false feedback to regulate our emotions. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. Association for Computing Machinery, New York, NY, USA, 758--769.",
      "doi": "10.1145/2971648.2971752"
    },
    {
      "text": "Mary Czerwinski, Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 175--182.",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Laura A Dabbish and Robert E Kraut. 2006. Email overload at work: An analysis of factors associated with email strain. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work. Association for Computing Machinery, New York, NY, USA, 431--440.",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Richard J Davidson, Klaus R Sherer, and H Hill Goldsmith. 2009. Handbook of Affective Sciences. Oxford University Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Scott Counts. 2013. Understanding affect in the workplace via social media. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work. Association for Computing Machinery, New York, NY, USA, 303--316.",
      "doi": "10.1145/2441776.2441812"
    },
    {
      "text": "Danyel Fisher, AJ Brush, Eric Gleave, and Marc A Smith. 2006. Revisiting Whittaker & Sidner's \"email overload\" ten years later. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work. Association for Computing Machinery, New York, NY, USA, 309--312.",
      "doi": "10.1145/1180875.1180922"
    },
    {
      "text": "Nicholas Fitz, Kostadin Kushlev, Ranjan Jagannathan, Terrel Lewis, Devang Paliwal, and Dan Ariely. 2019. Batching smartphone notifications can improve well-being. Computers in Human Behavior 101 (2019), 84--94.",
      "doi": ""
    },
    {
      "text": "Keaton A Fletcher, Sean M Potter, and Britany N Telford. 2018. Stress outcomes of four types of perceived interruptions. Human Factors 60, 2 (2018), 222--235.",
      "doi": ""
    },
    {
      "text": "Jennifer M George. 1990. Personality, affect, and behavior in groups. Journal of Applied Psychology 75, 2 (1990), 107.",
      "doi": ""
    },
    {
      "text": "Victor M González and Gloria Mark. 2004. Constant, constant, multi-tasking craziness: Managing multiple working spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 113--120.",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Ian J Goodfellow, Dumitru Erhan, Pierre Luc Carrier, Aaron Courville, Mehdi Mirza, Ben Hamner, Will Cukierski, Yichuan Tang, David Thaler, Dong-Hyun Lee, and others. 2015. Challenges in representation learning: A report on three machine learning contests. Neural Networks 64 (2015), 59--63.",
      "doi": "10.1016/j.neunet.2014.09.005"
    },
    {
      "text": "The Radicati Group. 2015. Email Statistics Report 2015--2019. Developer's Online Log. (2015). Retrieved from http://www.radicati.com/wp/wp-content/uploads /2015/02/Email-Statistics-Report-2015--2019-Executiv e-Summary.pdf.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Human Mental Workload, Peter A Hancock and Najmedin Meshkati (Eds.). North-Holland, Amsterdam, 139--183.",
      "doi": ""
    },
    {
      "text": "Javier Hernandez, Rob R Morris, and Rosalind W Picard. 2011. Call center stress recognition with person-specific models. In International Conference on Affective Computing and Intelligent Interaction. Springer, Berlin, Germany, 125--134.",
      "doi": ""
    },
    {
      "text": "Yun Huang, Ying Tang, and Yang Wang. 2015. Emotion map: A location-based mobile social system for improving emotion awareness and regulation. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. Association for Computing Machinery, New York, NY, USA, 130--142.",
      "doi": "10.1145/2675133.2675173"
    },
    {
      "text": "Shamsi T Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: Field study, analysis, and directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Vol. 7. Association for Computing Machinery, New York, NY, USA, 677--686.",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Robert-Paul Juster, Bruce S McEwen, and Sonia J Lupien. 2010. Allostatic load biomarkers of chronic stress and impact on health and cognition. Neuroscience & Biobehavioral Reviews 35, 1 (2010), 2--16.",
      "doi": ""
    },
    {
      "text": "Amy K Karlson, Shamsi T Iqbal, Brian Meyers, Gonzalo Ramos, Kathy Lee, and John C Tang. 2010. Mobile taskflow in context: A screenshot study of smartphone usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2009--2018.",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Kostadin Kushlev and Elizabeth W Dunn. 2015. Checking email less frequently reduces stress. Computers in Human Behavior 43 (2015), 220--228.",
      "doi": "10.1016/j.chb.2014.11.005"
    },
    {
      "text": "James A Levine, Ioannis T Pavlidis, Leslie MacBride, Zhen Zhu, and Panagiotis Tsiamyrtzis. 2009. Description and clinical studies of a device for the instantaneous detection of office-place stress. Work 34, 3 (2009), 359--364.",
      "doi": ""
    },
    {
      "text": "David M Levy, Jacob O Wobbrock, Alfred W Kaszniak, and Marilyn Ostergren. 2012. The effects of mindfulness meditation training on multitasking in a high-stress information environment. In Proceedings of Graphics Interface 2012. Canadian Information Processing Society, CAN, 45--52.",
      "doi": ""
    },
    {
      "text": "André Teixeira Lopes, Edilson de Aguiar, Alberto F De Souza, and Thiago Oliveira-Santos. 2017. Facial expression recognition with convolutional neural networks: Coping with few data and the training sample order. Pattern Recognition 61 (2017), 610--628.",
      "doi": "10.1016/j.patcog.2016.07.026"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: More speed and stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 107--110.",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, and Akane Sano. 2016a. Neurotics can't focus: An in situ study of online multitasking in the workplace. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1739--1744.",
      "doi": "10.1145/2858036.2858202"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016b. Email duration, batching and self-interruption: Patterns of email use on productivity and stress. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1717--1728.",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Gloria Mark, Stephen Voida, and Armand Cardello. 2012. A pace not dictated by electrons: An empirical study of work without email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 555--564.",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Daniel McDuff, Amy Karlson, Ashish Kapoor, Asta Roseway, and Mary Czerwinski. 2012. AffectAura: An intelligent system for emotional memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 849--858.",
      "doi": "10.1145/2207676.2208525"
    },
    {
      "text": "Daniel McDuff, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: A cross-platform real-time multi-face expression recognition toolkit. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3723--3726.",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Andre N Meyer, Laura E Barton, Gail C Murphy, Thomas Zimmermann, and Thomas Fritz. 2017. The work life of developers: Activities, switches and perceived productivity. IEEE Transactions on Software Engineering 43, 12 (2017), 1178--1193.",
      "doi": "10.1109/TSE.2017.2656886"
    },
    {
      "text": "Shervin Minaee and Amirali Abdolrashidi. 2019. Deep-Emotion: Facial expression recognition using attentional convolutional network. arXiv e-prints (02 2019), arXiv:1902.01019.",
      "doi": ""
    },
    {
      "text": "Stephan J Motowidlo, John S Packard, and Michael R Manning. 1986. Occupational stress: Its causes and consequences for job performance. Journal of Applied Psychology 71, 4 (1986), 618.",
      "doi": ""
    },
    {
      "text": "Roland Neumann and Fritz Strack. 2000. ?Mood contagion\": The automatic transfer of mood between persons. Journal of Personality and Social Psychology 79, 2 (2000), 211.",
      "doi": ""
    },
    {
      "text": "Michael R Parke and Myeong-Gu Seo. 2017. The role of affect climate in organizational effectiveness. Academy of Management Review 42, 2 (2017), 334--360.",
      "doi": ""
    },
    {
      "text": "Karen Renaud, Judith Ramsay, and Mario Hair. 2006. \"You've got e-mail!\"... shall I deal with it now? Electronic mail from the recipient's perspective. International Journal of Human-Computer Interaction 21, 3 (2006), 313--332.",
      "doi": ""
    },
    {
      "text": "Sefik Ilkin Serengil. 2018. Facial Expression Recognition with Keras. Developer's Online Log. (1 January 2018). Retrieved September 10, 2019 from https://sefiks.com/2018/01/01/facial-expression-reco gnition-with-keras/.",
      "doi": ""
    },
    {
      "text": "Barry M Staw, Robert I Sutton, and Lisa H Pelled. 1994. Employee positive emotion and favorable outcomes at the workplace. Organization Science 5, 1 (1994), 51--71.",
      "doi": "10.5555/2842023.2842027"
    },
    {
      "text": "Chiew Seng Sean Tan, Johannes Schöning, Kris Luyten, and Karin Coninx. 2013. Informing intelligent user interfaces by inferring affective states from body postures in ubiquitous computing environments. In Proceedings of the 2013 International Conference on Intelligent User Interfaces. Association for Computing Machinery, New York, NY, USA, 235--246.",
      "doi": "10.1145/2449396.2449427"
    },
    {
      "text": "Joseph A Veech. 2013. A probabilistic model for analysing species co-occurrence. Global Ecology and Biogeography 22, 2 (2013), 252--260.",
      "doi": ""
    },
    {
      "text": "Amanveer Wesley, Shaila Zaman, Christopher Blank, and Ioannis Pavlidis. 2020. Displayed Emotions Dataset on Dual Task. Open Science Framework https://doi.org/10.17605/osf.io/mhdgt. (2020).",
      "doi": ""
    },
    {
      "text": "Steve Whittaker and Candace Sidner. 1997. Email overload: Exploring personal information management of email. In Culture of the Internet, Sarah Kiesler (Ed.). Lawrence Erlbaum Associates, Hillsdale, NJ, USA, 277--295.",
      "doi": ""
    },
    {
      "text": "Robert B Zajonc, Sheila T Murphy, and Marita Inglehart. 1989. Feeling and facial efference: Implications of the vascular theory of emotion. Psychological Review 96, 3 (1989), 395.",
      "doi": ""
    },
    {
      "text": "Shaila Zaman, Amanveer Wesley, Dennis Rodrigo Da Cunha Silva, Pradeep Buddharaju, Fatema Akbar, Ge Gao, Gloria Mark, Ricardo Gutierrez-Osuna, and Ioannis Pavlidis. 2019. Stress and productivity patterns of interrupted, synergistic, and antagonistic office activities. Scientific Data 6, 1 (2019), 1--18. DOI: http://dx.doi.org/10.1038/s41597-019-0249--5",
      "doi": ""
    }
  ]
}