{
  "doi": "10.1145/3313831.3376787",
  "title": "Toward Immersive Self-Driving Simulations: Reports from a User Study across Six Platforms",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "As self-driving car technology matures, autonomous vehicle research is moving toward building more human-centric interfaces and accountable experiences. Driving simulators avoid many ethical and regulatory concerns about self-driving cars and play a key role in testing new interfaces or autonomous driving scenarios. However, apart from validity studies for manual driving simulation, the capabilities of driving simulators in replicating the experience of self-driving cars have not been widely investigated. In this paper, we build six self-driving simulation platforms with varying levels of visual and motion fidelities ranging from a screen-based in-lab simulator to the mixed-reality on-road simulator we propose. We compare the sense of presence and simulator sickness for each simulator composition, as well as its visual and motion fidelities with a user study. Our novel mixed-reality automotive driving simulator, named MAXIM, showed highest fidelity and presence. Our findings suggest how visual and motion configurations affect experience in autonomous driving simulators.",
  "authors": [
    {
      "name": "Dohyeon Yeo",
      "institution": "Gwangju Institute of Science and Technology, Gwangju, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528995",
      "orcid": "missing"
    },
    {
      "name": "Gwangbin Kim",
      "institution": "Gwangju Institute of Science and Technology, Gwangju, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527180",
      "orcid": "missing"
    },
    {
      "name": "Seungjun Kim",
      "institution": "Gwangju Institute of Science and Technology, Gwangju, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474711",
      "orcid": "0000-0003-0470-2483"
    }
  ],
  "references": [
    {
      "text": "R. Wade Allen, George D. Park, and Marcia L. Cook. 2010. Simulator fidelity and validity in a transfer-oftraining context. Transportation Research Record: Journal of the Transportation Research Board. 2185, 1 (January 2010), 40--47. DOI: https://doi.org/10.3141%2F2185-06",
      "doi": ""
    },
    {
      "text": "Sonia Baltodano, Srinath Sibi, Nikolas Martelaro, Nikhil Gowda, and Wendy Ju. 2015. The RRADS platform: a real road autonomous driving simulator. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 281--288. DOI: https://doi.org/10.1145/2799250.2799288",
      "doi": "10.1145/2799250.2799288"
    },
    {
      "text": "Francesco Bella. 2008. Driving simulator for speed research on two-lane rural roads. Accident Analysis & Prevention. 40, 3 (May 2008), 1078--1087. DOI: https://doi.org/10.1016/j.aap.2007.10.015",
      "doi": ""
    },
    {
      "text": "Shadan Sadeghian Borojeni, Lewis Chuang, Wilko Heuten, and Susanne Boll. 2016. Assisting Drivers with Ambient Take-Over Requests in Highly Automated Driving. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Automotive'UI 16). ACM, NY, NY, USA, 237--244. DOI: https://doi.org/10.1145/3003715.3005409",
      "doi": "10.1145/3003715.3005409"
    },
    {
      "text": "V.D. Calhoun and G.D. Pearlson. 2012. A selective review of simulated driving studies: Combining naturalistic and hybrid paradigms, analysis approaches, and future directions. Neuroimage. 59, 1 (January 2012), 25--35. DOI: https://doi.org/10.1016/j.neuroimage.2011.06.037",
      "doi": ""
    },
    {
      "text": "Sue V. G. Cobb, Sarah Nichols, Amanda Ramsey, and John R. Wilson. 1999. Virtual Reality-Induced Symptoms and Effects (VRISE). Presence: Teleoperators & Virtual Environments 8. 2. 169--186. DOI: https://doi.org/10.1162/105474699566152",
      "doi": "10.1162/105474699566152"
    },
    {
      "text": "Nils Dahlbaeck, Arne Joensson, and Lars Ahrenberg. 1993. Wizard of Oz studies-why and how. Knowledgebased systems. 6, 4. 258--266. DOI: https://doi.org/10.1016/0950--7051(93)90017-N",
      "doi": ""
    },
    {
      "text": "Cyriel Diels and Jelte E. Bos. 2015. User interface considerations to prevent self-driving carsickness. In Adjunct Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '15). ACM, NY, NY, USA, 14--19. DOI: https://doi.org/10.1145/2809730.2809754",
      "doi": ""
    },
    {
      "text": "Cyriel Diels, Jelte E. Bos. 2016. Self-driving carsickness. Applied Ergonomics 53, 374--382",
      "doi": ""
    },
    {
      "text": "Joshua E Domeyer, Nicholas D Cassavaugh, and Richard W Backs. 2013. The use of adaptation to reduce simulator sickness in driving assessment and research. Accident Analysis & Prevention. 53, 1 (April 2013), 127--132. DOI: https://doi.org/10.1016/j.aap.2012.12.039",
      "doi": ""
    },
    {
      "text": "David Goedicke, Jamy Li, Vanessa Evers, and Wendy Ju. 2018. VR-OOM: Virtual Reality On-rOad driving siMulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 165, 11 pages. DOI: https://doi.org/10.1145/3173574.3173739",
      "doi": "10.1145/3173574.3173739"
    },
    {
      "text": "Natassia Goode, Paul M. Salmon, and Michael G. Lenne. 2013. Simulation-based driver and vehicle crew training: Applications, efficacy and future directions. Applied Ergonomics. 44, 3 (May 2013), 435--444. DOI: https://doi.org/10.1016/j.apergo.2012.10.007",
      "doi": ""
    },
    {
      "text": "Tove Helldin, Göran Falkman, Maria Riveiro, and Staffan Davidsson. 2013. Presenting system uncertainty in automotive UIs for supporting trust calibration in autonomous driving. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13). ACM, NY, NY, USA, 210--217. DOI: http://dx.doi.org/10.1145/2516540.2516554",
      "doi": "10.1145/2516540.2516554"
    },
    {
      "text": "Philipp Hock, Johannes Kraus, Marcel Walch, Nina Lang, and Martin Baumann. 2016. Elaborating Feedback Strategies for Maintaining Automation in Highly Automated Driving. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Automotive'UI 16). ACM, NY, NY, USA, 105--112. DOI: https://doi.org/10.1145/3003715.3005414",
      "doi": "10.1145/3003715.3005414"
    },
    {
      "text": "Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR: Enabling In-Car Virtual Reality Entertainment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 40344044. DOI: https://doi.org/10.1145/3025453.3025665",
      "doi": "10.1145/3025453.3025665"
    },
    {
      "text": "Philipp Hock, Johannes Kraus, Franziska Babel, Marcel Walch, Enrico Rukzio, and Martin Baumann. 2018. How to Design Valid Simulator Studies for Investigating User Experience in Automated Driving: Review and Hands-On Considerations. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '18). ACM, NY, NY, USA, 105--117. DOI: https://doi.org/10.1145/3239060.3239066",
      "doi": "10.1145/3239060.3239066"
    },
    {
      "text": "A. Hamish Jamson, Natasha Merat, Oliver M.J. Carsten, Frank C.H. Lai. 2013. Behavioural changes in drivers experiencing highly-automated vehicle control in varying traffic conditions. Transportation research part C: emerging technologies. Elsevier, 30, 116--125. DOI: https://doi.org/10.1016/j.trc.2013.02.008",
      "doi": ""
    },
    {
      "text": "Jason Jerald. 2016. The VR Book Human-Centered Design for Virtual Reality. Association for Computing Machinery and Morgan & Claypool, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Nico A. Kaptein, Jan Theeuwes, Richard van der Horst. 1996. Driving Simulator Validity: Some Considerations. Transportation Research Record: Journal of the Transportation Research Board. 1550, 1 (January 1996), 30--36. DOI: https://doi.org/10.1177%2F0361198196155000105",
      "doi": ""
    },
    {
      "text": "Juffrizal Bin Karjanto, Nidzamuddin Md. Yusof, Chow Wang, Frank Delbressine, Matthias Rauterberg, Jacques Terken, and Alberto Martini. 2017. Situation Awareness and Motion Sickness in Automated Vehicle Driving Experience: A Preliminary Study of Peripheral Visual Information. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct (AutomotiveUI '17). ACM, NY, NY, USA, 57--61. DOI: https://doi.org/10.1145/3131726.3131745",
      "doi": "10.1145/3131726.3131745"
    },
    {
      "text": "Andras Kemeny,Francesco Panerai. 2003. Evaluating perception in driving simulation experiments. Trends in cognitive sciences 7. 1, 31--37. DOI: https://doi.org/10.1016/S1364--6613(02)00011--6",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993 Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3, 203--220. DOI: https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": ""
    },
    {
      "text": "Behrang Keshavarz and Heiko Hecht. 2011. Validating an Efficient Method to Quantify Motion Sickness. Human Factors: The Journal of the Human Factors and Ergonomics Society. 53, 4 (April 2011), 415--426. DOI: https://doi.org/10.1177%2F0018720811403736",
      "doi": ""
    },
    {
      "text": "Mark McGill and Stephen A. Brewster. 2017. I Am The Passenger: Challenges in Supporting AR/VR HMDs In-Motion. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct (AutomotiveUI '17). ACM, NY, NY, USA, 251--251. DOI: https://doi.org/10.1145/3131726.3131876",
      "doi": ""
    },
    {
      "text": "Lynn Meuleners and Michelle Fraser. 2015. A validation study of driving errors using a driving simulator. Transportation Research Part F: Traffic Psychology and Behaviour. 30 (February 2015), 14--21. DOI: https://doi.org/10.1016/j.trf.2014.11.009",
      "doi": ""
    },
    {
      "text": "Isabelle Milleville-Pennel and Camilo Charron. 2015. Driving for real or on a fixed-base simulator: Is it so different? An explorative study. Presence: Teleoperators and Virtual Environments. 24, 1 (May 2015), 7491. DOI: https://doi.org/10.1162/PRES_a_00216",
      "doi": "10.1162/PRES_a_00216"
    },
    {
      "text": "Natalie Owen, Antony Graham Leadbetter, and Lucy Yardley. 1998. Relationship between postural control and motionsickness in healthy subjects. Brain Research Bulletin 47.5, 471--474",
      "doi": ""
    },
    {
      "text": "Nico Pallamin, Cyril Bossard. 2016. Presence, Behavioural Realism and Performances in Driving Simulation. IFAC-PapersOnLine, 49(19), 408--413.",
      "doi": ""
    },
    {
      "text": "Philippe Perrin, Alexis Lion, Gilles Bosser, Gérome Gauchard, and Claude Meistelman. 2013. Motion Sickness in Rally Car Co-Drivers. Aviation, space, and environmental medicine 84.5, 473--477. DOI: https://doi.org/10.3357/ASEM.3523.2013",
      "doi": ""
    },
    {
      "text": "Albert J. Rehmann, Robert D. Mitman, Michael C. Reynolds. 1995. A Handbook of flight Simulation Fidelity Requirements for Human Factors Research. CREW SYSTEM ERGONOMICS INFORMATION ANALYSIS CENTER WRIGHT-PATTERSON AFB OH.",
      "doi": ""
    },
    {
      "text": "R.T. Reinhard, M. Kleer, and K. Drebler. 2019. The impact of individual simulator experiences on usability and driving behavior in a moving base driving simulator. Transportation Research Part F: Traffic Psychology and Behaviour. 61 (February 2019), 131--140. DOI: https://doi.org/10.1016/j.trf.2018.01.004",
      "doi": ""
    },
    {
      "text": "Andreas Riener. 2010. Assessment of simulator fidelity and validity in simulator and on-the-road studies. International Journal on Advances in Systems and Measurements 3.3.",
      "doi": ""
    },
    {
      "text": "Adi Ronen and Nitzan Yair. 2013. The adaptation period to a driving simulator. Transportation Research Part F: Traffic Psychology and Behaviour. 18 (May 2013), 94--106. DOI: https://doi.org/10.1016/j.trf.2012.12.007",
      "doi": ""
    },
    {
      "text": "Dirk Rothenbuicher, Jamy Li, David Sirkin, Brian Mok, and Wendy Ju. 2016. Ghost driver: A field study investigating the interaction between pedestrains and driverless vehicles. In 2016 25th IEEE Interactional Symposium on Robot and Human Interactive Communication (RO-MAN), 795--802. DOI: https://doi.org/10.1109/ROMAN.2016.7745210",
      "doi": "10.1109/ROMAN.2016.7745210"
    },
    {
      "text": "G. Schmidt, M.Kiss, E.Babbel, and A.Galla. 2008. The Wizard on Wheels:Rapid Prototyping and User Testing of Future Driver Assistance Using Wizard of Oz Technique in a Vehicle. In Proceedings of the FISITA 2008 World Automotive Congress.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, Anthony Steed. 1994. Depth of presence in virtual environments. Presence: Teleoperators & Virtual Environments 3.2. 130--144. DOI: https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Mel Slater, Anthony Steed. 2000. A virtual presence counter. Presence: Teleoperators & Virtual Environments, 9(5), 413--434.",
      "doi": "10.1162/105474600566925"
    },
    {
      "text": "JJ Slob. 2008. State-of-the-art driving simulators, a literature survey. DCT report 107 (2008)",
      "doi": ""
    },
    {
      "text": "Daniele Sportilo, Alexis Paljic, Luciano Ojeda, 2019. On-Road Evaluation of Autonomous Driving Training. ACM/IEEE Conference on Human-Robot Interaction (HRI ?19), 182--190. DOI: https://doi.org/ 10.1109/HRI.2019.8673277",
      "doi": ""
    },
    {
      "text": "Jonathan A. Stevens and J. Peter Kincaid. 2015. The relationship between presence and performance in virtual simulation training. Open Journal of Modeling and Simulation 3.02 (April 2015), 41--48. DOI: http://dx.doi.org/10.4236/ojmsi.2015.32005",
      "doi": ""
    },
    {
      "text": "Peter Wang, Srinath Sibi, Brian Mok, and Wendy Ju. 2017. Marionette: Enabling on-road wizard-of-oz autonomous driving studies. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 234--243. DOI: https://doi.org/10.1145/2909824.3020256",
      "doi": "10.1145/2909824.3020256"
    },
    {
      "text": "J. De Winter, P. Wieringa, J. Dankelman, M. Mulder, M. Van Paassen, and S. De Groot. 2007. Driving simulator fidelity and training effectiveness. In Proceedings of the 26th European Annual Conference on Human Decision Making and Manual Control.",
      "doi": ""
    },
    {
      "text": "Bob G Witmer, Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3, 225--240. DOI: https://doi.org/10.1162/105474698565686",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Dohyeon Yeo, Gwangbin Kim, SeungJun Kim. 2019. MAXIM: Mixed-reality Automotive driving XIMulation. In 2019 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE. 431--435.",
      "doi": ""
    },
    {
      "text": "Kristie L. Young, Michael A. Regan, and John D. lee. 2009. Measuring the effects of driver distraction: Direct driving performance methods and measures. CRC Press, Boca Raton, FL.",
      "doi": ""
    },
    {
      "text": "Meiping Yun, Jing Zhao, Jianzhen Zhao, Xuyan Weng, and Xiaoguang Yang. 2017. Impact of in-vehicle navigation information on lane-change behavior in urban expressway diverge segments. Accident Analysis & Prevention. 106 (September 2017), 53--66. DOI: https://doi.org/10.1016/j.aap.2017.05.025",
      "doi": ""
    }
  ]
}