{
  "doi": "10.1145/3313831.3376354",
  "title": "Clash of Times: Respectful Technology Space for Integrating Community Stories in Intangible Exhibits",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Emerging research in Human Computer Interaction (HCI) has considered the use of technology to preserve Intangible Cultural Heritage (ICH) while wrestling with the dilemma of local participation in the face of post-colonialism. There remains a need to understand how ICH is portrayed by museums and texts, how communities regard these representations, and how technology would affect preservation. We conducted a study in the North Rift region of Kenya to understand how ICH is preserved and disseminated by the museum in comparison with the community. The findings describe a respectful technology space where community needs and museum needs can co-exist. We also articulate social challenges that should be considered by designers when recommending or designing technological solutions. This paper concludes by recommending ways for researchers to smoothly integrate technology with ICH through community participation and an awareness of the respectful space.",
  "authors": [
    {
      "name": "Lindah Kotut",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/do/10.1145/contrib-83458639357/rel-imgonly/kotut.png",
      "acmid": "83458639357",
      "orcid": "missing"
    },
    {
      "name": "Neelma Bhatti",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528184",
      "orcid": "missing"
    },
    {
      "name": "Morva Saaty",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527175",
      "orcid": "missing"
    },
    {
      "name": "Derek Haqq",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659490272",
      "orcid": "missing"
    },
    {
      "name": "Timothy L. Stelter",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/do/10.1145/contrib-99659235429/rel-imgonly/tim.jpg",
      "acmid": "99659235429",
      "orcid": "missing"
    },
    {
      "name": "D. Scott McCrickard",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488655792",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hilma N. Aludhilu and Nicola J. Bidwell. 2018. Home is Not Egumbo: Language, Identity and Web Design. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (AfriCHI '18). ACM, NY, NY, USA, Article 2, 11 pages. DOI: http://dx.doi.org/10.1145/3283458.3283460",
      "doi": ""
    },
    {
      "text": "Kagonya Awori, Frank Vetere, and Wally Smith. 2016. Sessions with Grandma: Fostering Indigenous Knowledge Through Video Mediated Communication. In Proceedings of the First African Conference on Human Computer Interaction (AfriCHI'16). ACM, NY, NY, USA, 1--11. DOI: http://dx.doi.org/10.1145/2998581.2998585",
      "doi": "10.1145/2998581.2998585"
    },
    {
      "text": "Nicola J. Bidwell. 2009. Anchoring Design in Rural Customs of Doing and Saying. In Proceedings of the 12th IFIP TC 13 International Conference on Human-Computer Interaction: Part I (INTERACT '09). Springer-Verlag, Berlin, Heidelberg, 686--699. DOI: http://dx.doi.org/10.1007/978--3--642-03655--2_75",
      "doi": "10.1007/978-3-642-03655-2_75"
    },
    {
      "text": "Nicola J. Bidwell. 2016. Moving the centre to design social media in rural Africa. AI & SOCIETY 31, 1 (01 Feb 2016), 51--77. DOI: http://dx.doi.org/10.1007/s00146-014-0564--5",
      "doi": ""
    },
    {
      "text": "Barnabas Bii and Philip Bwayo. 2016. Museum that also offers couples space to chill out. Daily Nation (14 Apr 2016). https://bit.ly/2U1tH5l",
      "doi": ""
    },
    {
      "text": "Janet Blake. 2000. On defining the cultural heritage. International & Comparative Law Quarterly 49, 1 (2000), 61--85.",
      "doi": ""
    },
    {
      "text": "Janet Blake. 2008. UNESCOs 2003 Convention on Intangible Cultural Heritage: the implications of community involvement in 'safeguarding'. In Intangible heritage. Routledge, 59--87.",
      "doi": ""
    },
    {
      "text": "Felix Boateng. 1983. African Traditional Education: A Method of Disseminating Cultural Values. Journal of Black Studies 13, 3 (1983), 321--336. http://www.jstor.org/stable/2784292",
      "doi": ""
    },
    {
      "text": "Deidre Brown and George Nicholas. 2012. Protecting indigenous cultural property in the age of digital democracy: Institutional and communal responses to Canadian First Nations and M ¯ aori heritage concerns. Journal of Material Culture 17, 3 (2012), 307--324. DOI: http://dx.doi.org/10.1177/1359183512454065",
      "doi": ""
    },
    {
      "text": "David Browning, Nicola J Bidwell, Dianna Hardy, and P-M Standley. 2008. Rural Encounters: Cultural Translations Through Video. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08). ACM, NY, NY, USA, 148--155. DOI: http://dx.doi.org/10.1145/1517744.1517790",
      "doi": "10.1145/1517744.1517790"
    },
    {
      "text": "Jane Chege, Ian Askew, and Jennifer Liku. 2001. An assessment of the alternative rites approach for encouraging abandonment of female genital mutilation in Kenya. FRONTIERS Final Report - (2001), 1--57. DOI: http://dx.doi.org/10.31899/rh1.1009",
      "doi": ""
    },
    {
      "text": "Edwin Cheserek. 2013. Kalenjin elders angered by rite footage at International Criminal Court. (12 Sept. 2013). https://bit.ly/2ZgJyxW",
      "doi": ""
    },
    {
      "text": "Grace J Cheserek, VAO Odenyo, and P Omondi. 2012. Nature and causes of cattle rustling among some pastoral communities in Kenya. Journal of Emerging Trends in Economics and Management Sciences 3, 2 (2012), 173--179.",
      "doi": ""
    },
    {
      "text": "Kimberly Christen. 2005. Gone Digital: Aboriginal Remix and the Cultural Commons. International Journal of Cultural Property 12, 3 (2005), 315--345. DOI: http://dx.doi.org/10.1017/S0940739105050186",
      "doi": ""
    },
    {
      "text": "Roald Dahl. 1986. Going Solo. Farrar Straus Giroux.",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Scott D. Mainwaring. 2012. Ubicomp's Colonial Impulse. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 133--142. DOI: http://dx.doi.org/10.1145/2370216.2370238",
      "doi": ""
    },
    {
      "text": "Peter Gallert, Colin Stanley, and Kasper Rodil. 2018. Perspectives on Safeguarding Indigenous Knowledge and Intangible Cultural Heritage. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (AfriCHI '18). ACM, NY, NY, USA, Article 52, 4 pages. DOI: http://dx.doi.org/10.1145/3283458.3283520",
      "doi": "10.1145/3283458.3283520"
    },
    {
      "text": "Danilo Giglitto, Shaimaa Lazem, and Anne Preston. 2018. In the Eye of the Student: An Intangible Cultural Heritage Experience, with a Human-Computer Interaction Twist. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 290, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173864",
      "doi": "10.1145/3173574.3173864"
    },
    {
      "text": "Baringo County Government. 2017. County Treasury and Economic Planning: Annual Development Plan 2018/2019. (Aug. 2017). http://www.baringo.go.ke/images/downloads/Budget_ Documents/ADP/ADP-2018--2019.pdf.",
      "doi": ""
    },
    {
      "text": "Edward Twitchell Hall. 1983. The Dance of Life: The Other Dimension of Time. Anchor Press Garden City, NY.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1311--1320. DOI: http://dx.doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "NTV Kenya. 2017. Baringo county holds cultural festival for local communities. (4 Nov. 2017). https://www.youtube.com/watch?v=NRywmqHQYLk.",
      "doi": ""
    },
    {
      "text": "David Killingray and Martin Plaut. 2012. Fighting for Britain: African Soldiers in the Second World War. Boydell & Brewer Ltd, Rochester, NY, USA.",
      "doi": ""
    },
    {
      "text": "Stanley Kimuge and Barnabas Bii. 2019. Museum in memory of Nandi warrior who led fight against British rule. Daily Nation (26 July 2019). https://bit.ly/2ZqEGpX",
      "doi": ""
    },
    {
      "text": "Barbara Kirshenblatt-Gimblett. 2004. Intangible Heritage as Metacultural Production1. Museum International 56, 1--2 (2004), 52--65. DOI: http://dx.doi.org/10.1111/j.1350-0775.2004.00458.x",
      "doi": ""
    },
    {
      "text": "Lindah Kotut, Ann Hoang, Jennifer Shenk, Havisha Panda, and D. Scott McCrickard. 2018. Technology at the Museum: The Missing Voice. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (AfriCHI '18). ACM, NY, NY, USA, Article 20, 5 pages. DOI: http://dx.doi.org/10.1145/3283458.3283491",
      "doi": "10.1145/3283458.3283491"
    },
    {
      "text": "Lindah Kotut, Michael Horning, Timothy L. Stelter, and D. Scott McCrickard. 2020. Preparing for the Unexpected: Community Framework for Social Media Use and Social Support by Trail Thru-Hikers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '20). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/3313831.3376391",
      "doi": "10.1145/3313831.3376391"
    },
    {
      "text": "Abraham Kibet Arap Lagat. 1995. The historical process of Nandi movement into Uasin Gishu district of the Kenya highlands: 1906--1933. Master's thesis. University of Nairobi, Nairobi, Kenya.",
      "doi": ""
    },
    {
      "text": "Butler W. Lampson. 1974. Protection. SIGOPS Oper. Syst. Rev. 8, 1 (Jan. 1974), 18--24. DOI: http://dx.doi.org/10.1145/775265.775268",
      "doi": "10.1145/775265.775268"
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research Methods in Human-Computer Interaction. Morgan Kaufmann, Cambridge, MA, USA.",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Meave G Leakey and Richard E Leakey. 1978. Koobi Fora research project. Vol. 1. Clarendon Press Oxford, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Federico Lenzerini. 2011. Intangible Cultural Heritage: The Living Culture of Peoples. European Journal of International Law 22, 1 (02 2011), 101--120. DOI: http://dx.doi.org/10.1093/ejil/chr006",
      "doi": ""
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. \"I Feel It is My Responsibility to Stream\": Streaming and Engaging with Intangible Cultural Heritage Through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 229, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300459",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Rupi Mangat. 2014. Tugen way of life at the Koroto Cultural Festival. The East African (25 Apr 2014). https://bit.ly/2Zco6Pp",
      "doi": ""
    },
    {
      "text": "Gary Marsen, Katherine Malan, and Edwin Blake. 2002. Using Digital Technology to Access and Store African Art. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 528--529. DOI: http://dx.doi.org/10.1145/506443.506464",
      "doi": "10.1145/506443.506464"
    },
    {
      "text": "Isaac Mbiti and David N Weil. 2015. Mobile banking: The impact of M-Pesa in Kenya. In African Successes, Volume III: Modernization and Development. University of Chicago Press, Chicago, IL, USA, 247--293.",
      "doi": ""
    },
    {
      "text": "Virginia Morell. 1989. Leakey: The Trials Of Building Kenya's National Museums. The Scientist (May 1989). https://bit.ly/2TW5BZX",
      "doi": ""
    },
    {
      "text": "Reese Muntean, Kate Hennessy, Alissa Antle, Brendan Matkin, Susan Rowley, and Jordan Wilson. 2016. Design Interactions in ?el9wkw: Belongings. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, NY, NY, USA, 582--594. DOI: http://dx.doi.org/10.1145/2901790.2901912",
      "doi": "10.1145/2901790.2901912"
    },
    {
      "text": "Osinde Obare. 2019. Museums reclaim 60 acres grabbed in Kitale. The Standard (08 May 2019). https://bit.ly/33TlRPR",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, Tejinder K. Judge, Kate Hennessy, Carolyn Pang, and Serena Hillman. 2014. How Technology Supports Family Communication in Rural, Suburban, and Urban Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2705--2714. DOI: http://dx.doi.org/10.1145/2556288.2557277",
      "doi": "10.1145/2556288.2557277"
    },
    {
      "text": "National Museums of Kenya. 2010. National Museums of Kenya Strategic Plan 2009--2014. (2010). http://www.museums.or.ke/wp-content/uploads/2016/08/ Strategic_Plan.pdf",
      "doi": ""
    },
    {
      "text": "National Museums of Kenya. 2013. Kitale Museum: Historical Background. (11 Nov. 2013). https://bit.ly/2zfGuYh.",
      "doi": ""
    },
    {
      "text": "Fred Oluoch. 2017. Kenya museums to soon go virtual. Daily Nation (05 June 2017). https://bit.ly/33WC6vl",
      "doi": ""
    },
    {
      "text": "Dennis Ouma. 2009. Theft of artefacts leads to change of focus at museum. Daily Nation (26 Aug 2009). https://bit.ly/2Z9fB7X",
      "doi": ""
    },
    {
      "text": "Konstantinos Papangelis, Alan Chamberlain, and Hai-Ning Liang. 2016. New Directions for Preserving Intangible Cultural Heritage Through the Use of Mobile Technologies. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, NY, NY, USA, 964--967. DOI: http://dx.doi.org/10.1145/2957265.2962643",
      "doi": "10.1145/2957265.2962643"
    },
    {
      "text": "Mike Pflanz. 2006. Kenyans welcome home sacred relics stolen by British. The Telegraph (15 April 2006). https://bit.ly/2Zroc58",
      "doi": ""
    },
    {
      "text": "Kasper Rodil. 2017. A perspective on Systems Design in the Digitisation of Intangible Cultural Heritage. International Journal of Intangible Heritage 12 (4 2017), 190--198.",
      "doi": ""
    },
    {
      "text": "Norman W. Sheehan. 2011. Indigenous Knowledge and Respectful Design: An Evidence-Based Approach. Design Issues 27, 4 (2011), 68--80. http://www.jstor.org/stable/41261957",
      "doi": ""
    },
    {
      "text": "Milo Marsfeldt Skovfoged, Martin Viktor, Miroslav Kalinov Sokolov, Anders Hansen, Helene Høgh Nielsen, and Kasper Rodil. 2018. The Tales of the Tokoloshe: Safeguarding Intangible Cultural Heritage Using Virtual Reality. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (AfriCHI '18). ACM, NY, NY, USA, Article 66, 4 pages. DOI: http://dx.doi.org/10.1145/3283458.3283484",
      "doi": "10.1145/3283458.3283484"
    },
    {
      "text": "Laurajane Smith. 2006. Uses of Heritage. Routledge.",
      "doi": ""
    },
    {
      "text": "Ramesh Srinivasan and Jeffrey Huang. 2005. Fluid ontologies for digital museums. International journal on digital libraries 5, 3 (2005), 193--204.",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor. 2011. Out There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 685--694. DOI: http://dx.doi.org/10.1145/1978942.1979042",
      "doi": ""
    },
    {
      "text": "Jennyfer Lawrence Taylor, Alessandro Soro, Paul Roe, Anita Lee Hong, and Margot Brereton. 2017. Situational When: Designing for Time Across Cultures. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6461--6474. DOI: http://dx.doi.org/10.1145/3025453.3025936",
      "doi": "10.1145/3025453.3025936"
    },
    {
      "text": "Kentaro Toyama. 2011. Technology As Amplifier in International Development. In Proceedings of the 2011 iConference (iConference '11). ACM, NY, NY, USA, 75--82. DOI: http://dx.doi.org/10.1145/1940761.1940772",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Kenya Citizen TV. 2018. Thousands attend festival at Onobmoi village in Baringo. (2 Jan. 2018). https://www.youtube.com/watch?v=mMKh_CYhyL0.",
      "doi": ""
    },
    {
      "text": "UNESCO. 2003. Text of the Convention for the Safeguarding of the Intangible Cultural Heritage. (2003). https://ich.unesco.org/en/convention.",
      "doi": ""
    },
    {
      "text": "UNESCO. 2011. 2003 Convention for the Safeguarding of the Intangible Cultural Heritage. (2011). https://ich.unesco.org/doc/src/15164-EN.pdf.",
      "doi": ""
    },
    {
      "text": "UNESCO and Hampaté Bâ. 2003. The intangible heritage (Archived). (2003). https://web.archive.org/web/20030817054300/http://mirror-us.unesco.org/culture/heritage/intangible/ html_eng/index_en.shtml.",
      "doi": ""
    },
    {
      "text": "Kevin Walker, Joshua Underwood, Tim Waema, Lynne Dunckley, José Abdelnour-Nocera, Rosemary Luckin, Cecilia Oyugi, and Souleymane Camara. 2008. A Resource Kit for Participatory Socio-technical Design in Rural Kenya. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, NY, NY, USA, 2709--2714. DOI: http://dx.doi.org/10.1145/1358628.1358749",
      "doi": "10.1145/1358628.1358749"
    },
    {
      "text": "Heike Winschiers-Theophilus, Nicola J. Bidwell, Shilumbe Chivuno-Kuria, and Gereon Koch Kapuire. 2010. Determining Requirements Within an Indigenous Knowledge System of African Rural Communities. In Proceedings of the 2010 Annual Research Conference of the South African Institute of Computer Scientists and Information Technologists (SAICSIT '10). ACM, NY, NY, USA, 332--340. DOI: http://dx.doi.org/10.1145/1899503.1899540",
      "doi": "10.1145/1899503.1899540"
    },
    {
      "text": "Susan Wyche, Nightingale Simiyu, and Martha E. Othieno. 2016. Mobile Phones As Amplifiers of Social Inequality Among Rural Kenyan Women. ACM Trans. Comput.-Hum. Interact. 23, 3, Article 14 (June 2016), 19 pages. DOI: http://dx.doi.org/10.1145/2911982",
      "doi": "10.1145/2911982"
    }
  ]
}