{
  "doi": "10.1145/3313831.3376876",
  "title": "Understanding the Heisenberg Effect of Spatial Interaction: A Selection Induced Error for Spatially Tracked Input Devices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "Virtual and augmented reality head-mounted displays (HMDs) are currently heavily relying on spatially tracked input devices (STID) for interaction. These STIDs are all prone to the phenomenon that a discrete input (e.g. button press) will disturb the position of the tracker, resulting in a different selection point during ray-cast interaction (Heisenberg Effect of Spatial Interaction). Besides the knowledge of its existence, there is currently a lack of a deeper understanding of its severity, structure and impact on throughput and angular error during a selection task. In this work, we present a formal evaluation of the Heisenberg effect and the impact of body posture, arm position and STID degrees of freedom on its severity. In a Fitt's Law inspired user study (N=16), we found that the Heisenberg effect is responsible for 30.45% of the overall errors occurring during a pointing task, but can be reduced by 25.4% using a correction function.",
  "tags": [
    "pointing",
    "selection",
    "correction",
    "vr",
    "stid",
    "heisenberg effect",
    "offset"
  ],
  "authors": [
    {
      "name": "Dennis Wolf",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658733790",
      "orcid": "missing"
    },
    {
      "name": "Jan Gugenheimer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Marco Combosch",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529367",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Mayra Donaji Barrera Machuca and Wolfgang Stuerzlinger. 2019. The Effect of Stereo Display Deficiencies on Virtual Hand Pointing. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 207, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300437",
      "doi": "10.1145/3290605.3300437"
    },
    {
      "text": "Anil Ufuk Batmaz and Wolfgang Stuerzlinger. 2019. The Effect of Rotational Jitter on 3D Pointing Tasks. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article LBW2112, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3312752",
      "doi": "10.1145/3290607.3312752"
    },
    {
      "text": "Doug Bowman, Chadwick Wingrave, Joshua Campbell, and Vinh Ly. 2001. Using pinch gloves for both natural and abstract interaction techniques in virtual environments. Proceedings of HCI International (01 2001).",
      "doi": ""
    },
    {
      "text": "William Buxton, Ralph Hill, and Peter Rowley. 1985. Issues and Techniques in Touch-sensitive Tablet Input. SIGGRAPH Comput. Graph. 19, 3 (July 1985), 215--224. DOI: http://dx.doi.org/10.1145/325165.325239",
      "doi": "10.1145/325165.325239"
    },
    {
      "text": "Alex Olwal Steven Feiner. 2003. The flexible pointer: An interaction technique for selection in augmented and virtual reality. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST'03). 81--82.",
      "doi": ""
    },
    {
      "text": "C.C.A.M. Gielen, E. J. Vrijenhoek, T. Flash, and S.F.W. Neggers. 1997. Arm Position Constraints During Pointing and Reaching in 3-D Space. Journal of Neurophysiology 78, 2 (1997), 660--673. DOI: http://dx.doi.org/10.1152/jn.1997.78.2.660 PMID: 9307103.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2006. The Design and Evaluation of Selection Techniques for 3D Volumetric Displays. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 3--12. DOI: http://dx.doi.org/10.1145/1166253.1166257",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Niels Henze, Enrico Rukzio, and Susanne Boll. 2011. 100,000,000 Taps: Analysis and Improvement of Touch Performance in the Large. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 133--142. DOI: http://dx.doi.org/10.1145/2037373.2037395",
      "doi": "10.1145/2037373.2037395"
    },
    {
      "text": "Ricardo Jota, Miguel A. Nacenta, Joaquim A. Jorge, Sheelagh Carpendale, and Saul Greenberg. 2010. A Comparison of Ray Pointing Techniques for Very Large Displays. In Proceedings of Graphics Interface 2010 (GI '10). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 269--276. http://dl.acm.org/citation.cfm?id=1839214.1839261",
      "doi": "10.5555/1839214.1839261"
    },
    {
      "text": "Luv Kohli and Mary Whitton. 2005. The Haptic Hand: Providing User Interface Feedback with the Non-dominant Hand in Virtual Environments. In Proceedings of Graphics Interface 2005 (GI '05). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 1--8. http://dl.acm.org/citation.cfm?id=1089508.1089510",
      "doi": ""
    },
    {
      "text": "Werner A. König, Jens Gerken, Stefan Dierdorf, and Harald Reiterer. 2009. Adaptive Pointing -- Design and Evaluation of a Precision Enhancing Technique for Absolute Pointing Devices. In Human-Computer Interaction -- INTERACT 2009, Tom Gross, Jan Gulliksen, Paula Kotzé, Lars Oestreicher, Philippe Palanque, Raquel Oliveira Prates, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 658--671.",
      "doi": "10.1007/978-3-642-03655-2_73"
    },
    {
      "text": "Regis Kopper, Doug A. Bowman, Mara G. Silva, and Ryan P. McMahan. 2010. A human motor behavior model for distal pointing tasks. International Journal of Human-Computer Studies 68, 10 (2010), 603 -- 615. DOI: http://dx.doi.org/https://doi.org/10.1016/j.ijhcs.2010.05.001",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "I. Scott MacKenzie. 1992. Fitts' Law As a Research and Design Tool in Human-computer Interaction. Humam-Computer Interaction 7, 1 (March 1992), 91--139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Ville Mäkelä, Tomi Heimonen, and Markku Turunen. 2014. Magnetic Cursor: Improving Target Selection in Freehand Pointing Interfaces. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, NY, NY, USA, Article 112, 6 pages. DOI: http://dx.doi.org/10.1145/2611009.2611025",
      "doi": "10.1145/2611009.2611025"
    },
    {
      "text": "Sven Mayer, Valentin Schwind, Robin Schweigert, and Niels Henze. 2018. The Effect of Offset Correction and Cursor on Mid-Air Pointing in Real and Virtual Environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 653, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174227",
      "doi": "10.1145/3173574.3174227"
    },
    {
      "text": "L. E. Miller, M. Theeuwen, and C. C. A. M. Gielen. 1992. The control of arm pointing movements in three dimensions. Experimental Brain Research 90, 2 (01 Aug 1992), 415--426. DOI: http://dx.doi.org/10.1007/BF00227256",
      "doi": ""
    },
    {
      "text": "Salim Nana-Ibrahim, Stéphane Vieilledent, Pierre Leroyer, Fabrice Viale, and Maurice Zattara. 2008. Target size modifies anticipatory postural adjustments and subsequent elementary arm pointing. Experimental Brain Research 184, 2 (01 Jan 2008), 255--260. DOI: http://dx.doi.org/10.1007/s00221-007--1178--7",
      "doi": ""
    },
    {
      "text": "Mathieu Nancel, Emmanuel Pietriga, Olivier Chapuis, and Michel Beaudouin-Lafon. 2015. Mid-Air Pointing on Ultra-Walls. ACM Trans. Comput.-Hum. Interact. 22, 5, Article 21 (Aug. 2015), 62 pages. DOI: http://dx.doi.org/10.1145/2766448",
      "doi": "10.1145/2766448"
    },
    {
      "text": "Andriy Pavlovych and Wolfgang Stuerzlinger. 2009. The Tradeoff Between Spatial Jitter and Latency in Pointing Tasks. In Proceedings of the 1st ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '09). ACM, NY, NY, USA, 187--196. DOI: http://dx.doi.org/10.1145/1570433.1570469",
      "doi": "10.1145/1570433.1570469"
    },
    {
      "text": "E. S. Pearson, R. B. D'Agostino, and K. O. Bowman. 1977. Tests for departure from normality: Comparison of powers. Biometrika 64, 2 (08 1977), 231--246. DOI: http://dx.doi.org/10.1093/biomet/64.2.231",
      "doi": ""
    },
    {
      "text": "Jean-François Pilon, Sophie J. De Serres, and Anatol G. Feldman. 2007. Threshold position control of arm movement with anticipatory increase in grip force. Experimental Brain Research 181, 1 (01 Jul 2007), 49--67. DOI: http://dx.doi.org/10.1007/s00221-007-0901--8",
      "doi": ""
    },
    {
      "text": "Katrin Plaumann, Matthias Weing, Christian Winkler, Michael Müller, and Enrico Rukzio. 2018. Towards Accurate Cursorless Pointing: The Effects of Ocular Dominance and Handedness. Personal Ubiquitous Comput. 22, 4 (Aug. 2018), 633--646. DOI: http://dx.doi.org/10.1007/s00779-017--1100--7",
      "doi": "10.1007/s00779-017-1100-7"
    },
    {
      "text": "I. Poupyrev, T. Ichikawa, S. Weghorst, and M. Billinghurst. 1998. Egocentric Object Manipulation in Virtual Environments: Empirical Evaluation of Interaction Techniques. Computer Graphics Forum 17, 3 (1998), 41--52.",
      "doi": ""
    },
    {
      "text": "Shashi Shekhar, Steven K. Feiner, and Walid G. Aref. 2015. Spatial Computing. Commun. ACM 59, 1 (Dec. 2015), 72--81. DOI: http://dx.doi.org/10.1145/2756547",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies 61, 6 (2004), 751 -- 789. DOI: http://dx.doi.org/https://doi.org/10.1016/j.ijhcs.2004.09.001 Fitts' law 50 years later: applications and contributions from human-computer interaction.",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "R. J. Teather, A. Pavlovych, W. Stuerzlinger, and I. S. MacKenzie. 2009. Effects of tracking technology, latency, and spatial jitter on object movement. In 2009 IEEE Symposium on 3D User Interfaces. 43--50. DOI: http://dx.doi.org/10.1109/3DUI.2009.4811204",
      "doi": "10.1109/3DUI.2009.4811204"
    },
    {
      "text": "IBM Van der Fits, AWJ Klip, LA Van Eykern, and M Hadders-Algra. 1998. Postural adjustments accompanying fast pointing movements in standing, sitting and lying adults. Experimental Brain Research 120, 2 (1998), 202--216.",
      "doi": ""
    },
    {
      "text": "T. S. Young, R. J. Teather, and I. S. MacKenzie. 2017. An arm-mounted inertial controller for 6DOF input: Design and evaluation. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). 26--35. DOI: http://dx.doi.org/10.1109/3DUI.2017.7893314",
      "doi": ""
    }
  ]
}