{
  "doi": "10.1145/3313831.3376325",
  "title": "Color and Animation Preferences for a Light Band eHMI in Interactions Between Automated Vehicles and Pedestrians",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper, we report user preferences regarding color and animation patterns to support the interaction between Automated Vehicles (AVs) and pedestrians through an external Human-Machine-Interface (eHMI). Existing concepts of eHMI differ -- among other things -- in their use of colors or animations to express an AV's yielding intention. In the absence of empirical research, there is a knowledge gap regarding which color and animation leads to highest usability and preferences in traffic negotiation situations. We conducted an online survey (N=400) to investigate the comprehensibility of a light band eHMI with a combination of 5 color and 3 animation patterns for a yielding AV. Results show that cyan is considered a neutral color for communicating a yielding intention. Additionally, a uniformly flashing or pulsing animation is preferred compared to any pattern that animates sideways. These insights can contribute in the future design and standardization of eHMIs.",
  "authors": [
    {
      "name": "Debargha Dey",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/do/10.1145/contrib-99659205251/rel-imgonly/enlight420.jpeg",
      "acmid": "99659205251",
      "orcid": "missing"
    },
    {
      "name": "Azra Habibovic",
      "institution": "Research Institutes of Sweden (RISE), Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659182098",
      "orcid": "missing"
    },
    {
      "name": "Bastian Pfleging",
      "institution": "Eindhoven University of Technology & Ludwig Maximilian University of Munich, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651934",
      "orcid": "missing"
    },
    {
      "name": "Marieke Martens",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87058614957",
      "orcid": "missing"
    },
    {
      "name": "Jacques Terken",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/do/10.1145/contrib-81100650173/rel-imgonly/jacques-foto2.jpg",
      "acmid": "81100650173",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Claudia Ackermann, Matthias Beggiato, Sarah Schubert, and Josef F Krems. 2019. An experimental study to investigate design and assessment criteria: What is important for communication between pedestrians and automated vehicles? Applied Ergonomics 75 (2019), 272--282. DOI: http://dx.doi.org/10.1016/j.apergo.2018.11.002",
      "doi": ""
    },
    {
      "text": "Jonas Andersson, Azra Habibovic, Maria Klingegård, Cristofer Englund, and Victor Malmsten-Lundgren. 2017. Hello Human, can you read my mind? ERCIM News (109) (2017), 36--37. http://urn.kb.se/resolve?urn=urn:nbn:se:ri:diva-29618",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Claudia Witzlack, and Josef F Krems. 2017a. Gap acceptance and time-to-arrival estimates as basis for informal communication between pedestrians and vehicles. In AutomotiveUI 2017 - 9th International ACM Conference on Automotive User Interfaces and Interactive Vehicular Applications, Proceedings. Oldenburg, 50--57. DOI: http://dx.doi.org/10.1145/3122986.3122995",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Claudia Witzlack, Sabine Springer, and Josef Krems. 2017b. The Right Moment for Braking as Informal Communication Signal Between Automated Vehicles and Pedestrians in Crossing Situations. In AHFE 2017. Advances in Intelligent Systems and Computing, vol 597, Vol. 1. 1072 -- 1081. DOI: http://dx.doi.org/10.1007/978--3--319--60441--1",
      "doi": ""
    },
    {
      "text": "Ola Benderius, Christian Berger, and Victor Malmsten Lundgren. 2018. The Best Rated Human-Machine Interface Design for Autonomous Vehicles in the 2016 Grand Cooperative Driving Challenge. IEEE Transactions on Intelligent Transportation Systems 19, 4 (2018), 1302--1307. DOI: http://dx.doi.org/10.1109/TITS.2017.2749970",
      "doi": ""
    },
    {
      "text": "BMW AG. 2016. BMW Vision Next 100. (2016). https://www.bmwgroup.com/en/next100/brandvisions.html",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon's mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on Psychological Science 6, 1 (jan 2011), 3--5. DOI: http://dx.doi.org/10.1177/1745691610393980",
      "doi": ""
    },
    {
      "text": "Daimler AG. 2015. The Mercedes-Benz F 015 Luxury in Motion. (2015). https://www.mercedes-benz.com/en/mercedes-benz/ innovation/research-vehicle-f-015-luxury-in-motion/",
      "doi": ""
    },
    {
      "text": "Koen de Clercq, Andre Dietrich, Juan Pablo Núñez Velasco, Joost de Winter, and Riender Happee. 2019. External Human-Machine Interfaces on Automated Vehicles: Effects on Pedestrian Crossing Decisions. Human Factors (2019). DOI: http://dx.doi.org/10.1177/0018720819836343",
      "doi": ""
    },
    {
      "text": "J. C. F. De Winter and D. Dodou. 2010. FivePoint Likert Items: t test versus MannWhitneyWilcoxon. Practical Assessment, Research & Evaluation 15, 11 (2010), 1--16. https://pareonline.net/pdf/v15n11.pdf",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Lesley Strawderman, Daniel W. Carruth, Janice DuBien, Brian Smith, and Teena M. Garrison. 2017. Development and validation of a questionnaire to assess pedestrian receptivity toward fully autonomous vehicles. Transportation Research Part C: Emerging Technologies 84 (nov 2017), 178--195. DOI: http://dx.doi.org/10.1016/j.trc.2017.08.029",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques Terken. 2018. Interface Concepts for Intent Communication from Autonomous Vehicles to Vulnerable Road Users. In Adjunct Proceedings of the 10th International ACM Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '18). Toronto, Canada, 82--86. DOI: http://dx.doi.org/10.1145/3239092.3265946",
      "doi": "10.1145/3239092.3265946"
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and dynamics of Mechanical Turk workers. In WSDM 2018 - Proceedings of the 11th ACM International Conference on Web Search and Data Mining, Vol. 2018-Febua. 135--143. DOI: http://dx.doi.org/10.1145/3159652.3159661",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Stefanie M. Faas and Martin Baumann. 2019. Yielding Light Signal Evaluation for Self-driving Vehicle and Pedestrian Interaction. In In: Ahram T., Karwowski W., Pickl S., Taiar R. (eds) Human Systems Engineering and Design II. IHSED 2019. Advances in Intelligent Systems and Computing, Vol. 1026. Springer International Publishing, 189--194. DOI: http://dx.doi.org/10.1007/978--3-030--27928--8_29",
      "doi": ""
    },
    {
      "text": "Berthold Färber. 2016. Communication and communication problems between autonomous vehicles and human drivers.. In Autonomous Driving. Springer, Berlin, 125--144.",
      "doi": ""
    },
    {
      "text": "Andy Field. 2018a. GLM 4: Repeated-Measures Designs. In Discovering Statistics Using IBM SPSS 5th Edition. SAGE Publications, 649--702.",
      "doi": ""
    },
    {
      "text": "Andy Field. 2018b. GLM 5: Mixed Designs. In Discovering Statistics Using IBM SPSS 5th Edition. SAGE Publications, 703--734.",
      "doi": ""
    },
    {
      "text": "Ford Motor Corporation. 2017. Ford, Virginia Tech Go Undercover to Develop Signals That Enable Autonomous Vehicles to Communicate with People. (2017). https://media.ford.com/content/fordmedia/fna/ us/en/news/2017/09/13/ ford-virginia-tech-autonomous-vehicle-human-testing. html",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen and Céline Jacob. 2002. Direct Look Versus Evasive Glance and Compliance With a Request. The Journal of Social Psychology 142, 3 (2002), 393--396. DOI: http://dx.doi.org/10.1080/00224540209603907",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen, Sébastien Meineri, and Chloé Eyssartier. 2015. A pedestrian's stare and drivers' stopping behavior: A field experiment at the pedestrian crossing. Safety Science 75 (2015), 87--89. DOI: http://dx.doi.org/10.1016/j.ssci.2015.01.018",
      "doi": ""
    },
    {
      "text": "Azra Habibovic, Jonas Andersson, Victor Malmsten Lundgren, Maria Klingegård, Cristofer Englund, and Sofia Larsson. 2018a. External Vehicle Interfaces for Communication with Other Road Users? Road Vehicles Automation 5, Lecture Notes in Mobility (2018), 91--102. DOI: http://dx.doi.org/10.1007/978--3--319--60934--8",
      "doi": ""
    },
    {
      "text": "Azra Habibovic, Victor Malmsten Lundgren, Jonas Andersson, Maria Klingegård, Tobias Lagström, Anna Sirkka, Johan Fagerlönn, Claes Edgren, Rikard Fredriksson, Stas Krupenia, Dennis Saluäär, and Pontus Larsson. 2018b. Communicating Intent of Automated Vehicles to Pedestrians. Frontiers in Psychology 9, August (2018). DOI: http://dx.doi.org/10.3389/fpsyg.2018.01336",
      "doi": ""
    },
    {
      "text": "Michael Hamm, Wolfgang Huhn, and Johannes Reschke. 2018. Ideas for Next Lighting Generations in Digitalization and Autonomous Driving - Technocal Paper 2018-01--1038. SAE Technical Papers 2018-April (2018), 1--8. DOI: http://dx.doi.org/10.4271/2018-01--1038",
      "doi": ""
    },
    {
      "text": "A Hensch, I Neumann, M Beggiato, J Halama, and J F Krems. 2019a. Steady, Flashing, Sweeping - An exploratory evaluation of light signals as an eHMI in automated driving. (2019). https://www.hfes-europe. org/wp-content/uploads/2019/10/Hensch2019poster.pdf",
      "doi": ""
    },
    {
      "text": "Ann-Christin Hensch, Isabel Neumann, Matthias Beggiato, Josephine Halama, and Josef F. Krems. 2019b. How Should Automated Vehicles Communicate -- Effects of a Light-Based Communication Approach in a Wizard-of-Oz Study. In AHFE 2019. Advances in Intelligent Systems and Computing, vol 964, Vol. 964. Springer International Publishing, 79--91. DOI: http://dx.doi.org/10.1007/978--3-030--20503--4",
      "doi": ""
    },
    {
      "text": "Kai Holländer, Ashley Colley, Florian Alt, Christian Mai, and Bastian Pfleging. 2019. Investigating the Influence of External Car Displays on Pedestrians ' Crossing Behavior in Virtual Reality. In International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '19).",
      "doi": "10.1145/3338286.3340138"
    },
    {
      "text": "International Organization for Standardization (ISO)/TR 23049. 2018. TECHNICAL REPORT ISO: Road Vehicles -- Ergonomic aspects of external visual communication from automated vehicles to other road users. Technical Report. https://www.iso.org/obp/ui/#iso:std:iso:tr:23049:ed-1:v1:en",
      "doi": ""
    },
    {
      "text": "Tobias Lagström and Victor Malmsten Lundgren. 2015. AVIP - Autonomous vehicles' interaction with pedestrians: An investigation of pedestrian-driver communication and development of a vehicle external interface. (2015). http://publications.lib.chalmers.se/ records/fulltext/238401/238401.pdf",
      "doi": ""
    },
    {
      "text": "Yee Mun Lee, Ruth Madigan, Jorge Garcia, Andrew Tomlinson, Albert Solernou, Richard Romano, Gustav Markkula, Natasha Merat, and Jim Uttley. 2019. Understanding the Messages Conveyed by Automated Vehicles. In 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '19). 134--143. DOI: http://dx.doi.org/10.1145/3342197.3344546",
      "doi": "10.1145/3342197.3344546"
    },
    {
      "text": "Kelly Lin. 2018. 2019 Toyota Avalon Has Sequential Turn Signals. (2018). https://www.motortrend.com/news/ 2019-toyota-avalon-sequential-turn-signals/",
      "doi": ""
    },
    {
      "text": "Constantin Mircioiu and Jeffrey Atkinson. 2017. A Comparison of Parametric and Non-Parametric Methods Applied to a Likert Scale. Pharmacy 5, 4 (may 2017), 26. DOI: http://dx.doi.org/10.3390/pharmacy5020026",
      "doi": ""
    },
    {
      "text": "Jacqueline Murray. 2013. Likert Data: What to Use, Parametric or Non-Parametric? International Journal of Business and Social Science 4, 11 (2013).",
      "doi": ""
    },
    {
      "text": "Nissan Motor Corporation. 2015. Nissan IDS Concept: Nissan's vision for the future of EVs and autonomous driving. (2015). https://europe.nissannews.com/en-GB/ releases/release-139047",
      "doi": ""
    },
    {
      "text": "Tibor Petzoldt, Katja Schleinitz, and Rainer Banse. 2018. Potential safety effects of a frontal brake light for motor vehicles. In IET Intelligent Transport Systems, Vol. 12. 449--453. DOI: http://dx.doi.org/10.1049/iet-its.2017.0321",
      "doi": ""
    },
    {
      "text": "Amir Rasouli, Iuliia Kotseruba, and John K. Tsotsos. 2017. Agreeing to cross: How drivers and pedestrians communicate. In IEEE Intelligent Vehicles Symposium, Proceedings. Redondo Beach, CA, 264--269. DOI: http://dx.doi.org/10.1109/IVS.2017.7995730",
      "doi": ""
    },
    {
      "text": "Malte Risto, Colleen Emmenegger, Erik Vinkhuyzen, Melissa Cefkin, and Jim Hollan. 2017. Human-Vehicle Interfaces: The Power of Vehicle Movement Gestures in Human Road User Coordination. In Driving Assessment: The Ninth International Driving Symposium on Human Factors in Driver Assessment, Training and Vehicle Design. Manchester Village, Vermont.",
      "doi": ""
    },
    {
      "text": "SAE Lighting Standard Practices Committee. 2016. Color Specification (J578 Ground Vehicle Standard) SAE Mobilus. Technical Report. SAE. https://saemobilus.sae.org/content/J578",
      "doi": ""
    },
    {
      "text": "SAE Standards Works. 2018. J3134 Automated Driving System (ADS) Lamps Task Force. (2018). https://www.sae.org/works/committeeHome.do?comtID=TEVLCS5Z",
      "doi": ""
    },
    {
      "text": "S Schmidt and B Färber. 2009. Pedestrians at the kerb Recognising the action intentions of humans. Transportation Research Part F: Traffic Psychology and Behaviour 12, 4 (2009), 300--310. DOI: http://dx.doi.org/10.1016/j.trf.2009.02.003",
      "doi": ""
    },
    {
      "text": "Friederike Schneemann and Irene Gohl. 2016. Analyzing driver-pedestrian interaction at crosswalks: A contribution to autonomous driving in urban environments. In IEEE Intelligent Vehicles Symposium, Proceedings. 38--43. DOI: http://dx.doi.org/10.1109/IVS.2016.7535361",
      "doi": "10.1109/IVS.2016.7535361"
    },
    {
      "text": "Semcon. 2016. The Smiling Car. (2016). http://semcon.com/smilingcar/",
      "doi": ""
    },
    {
      "text": "Lenja Sorokin, Nina Kauffmann, and Ronee Chadowitz. 2019. A change of perspective: Designing the automated vehicle as a new social actor in a public space. In CHI'19 Extended AbstractsCHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI'19 Extended Abstracts). DOI: http://dx.doi.org/10.1145/3290607.3299044",
      "doi": "10.1145/3290607.3299044"
    },
    {
      "text": "Matús ucha, Daniel Dostal, and Ralf Risser. 2017. Pedestrian-driver communication and decision strategies at marked crossings. Accident Analysis and Prevention 102 (2017), 41--50. DOI: http://dx.doi.org/10.1016/j.aap.2017.02.018",
      "doi": ""
    },
    {
      "text": "Helmut Tiesler-Wittig. 2019. Functional Application, Regulatory Requirements and Their Future Opportunities for Lighting of Automated Driving Systems. Technical Report. DOI: http://dx.doi.org/10.4271/2019-01-0848",
      "doi": ""
    },
    {
      "text": "UNECE (United Nations Economic Commission for Europe). 2011. UNECE R65 Regulation - Uniform provisions concerning the approval of special warning lamps for power-driven vehicles and their trailers. Technical Report December. UNECE. 1--29 pages.",
      "doi": ""
    },
    {
      "text": "UNECE (United Nations Economic Commission for Europe). 2018. Autonomous Vehicle Signalling Requirements (AVSR) Taskforce. (2018). https://wiki. unece.org/pages/viewpage.action?pageId=73925596",
      "doi": ""
    },
    {
      "text": "Viknesh Vijayenthiran. 2013. Audi Shows Sequential Turn Signal Of 2015 A8. (2013). https://www.motorauthority.com/news/1086249",
      "doi": ""
    },
    {
      "text": "Erik Vinkhuyzen and Melissa Cefkin. 2016. Developing Socially Acceptable Autonomous Vehicles. Proceedings of the Ethnographic Praxis in Industry Conference (EPIC) (2016), 423--435.",
      "doi": ""
    },
    {
      "text": "Annette Werner. 2018. New Colours for Autonomous Driving: An Evaluation of Chromaticities for the External Lighting Equipment of Autonomous Vehicles. ColourTurn 10, 3 (2018), 183--193. DOI: http://dx.doi.org/10.25538/tct.v0i1.692",
      "doi": ""
    },
    {
      "text": "Christopher D Wickens, John Lee, Viii Uu, and Sallie Gordon Becker. 2004. An Introduction to Human Factors Engineering Second Edition (2 ed.). Pearson.",
      "doi": ""
    }
  ]
}