{
  "doi": "10.1145/3313831.3376139",
  "title": "Replicate and Reuse: Tangible Interaction Design for Digitally-Augmented Physical Media Objects",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Technology has transformed our physical interactions into infinitely more scalable and flexible digital ones. We can peruse an infinite number of photos, news articles, and books. However, these digital experiences lack the physical experience of paging through an album, reading a newspaper, or meandering through a bookshelf. Overlaying physical objects with digital content using augmented reality is a promising avenue towards bridging this gap. In this paper, we investigate the interaction design for such digital-overlaid physical objects and their varying levels of tangibility. We first conduct a user evaluation of a physical photo album that uses tangible interactions to support physical and digital operations. We further prototype multiple objects including bookshelves and newspapers and probe users on their usage, capabilities, and interactions. We then conduct a qualitative investigation of three interaction designs with varying tangibility that use three different input modalities. Finally, we discuss the insights from our investigations and recommend design guidelines.",
  "tags": [
    "physical objects",
    "design",
    "tangible interaction",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Aakar Gupta",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548039279",
      "orcid": "0000-0001-6435-3583"
    },
    {
      "name": "Bo Rui Lin",
      "institution": "University of Waterloo & Pinterest Inc., Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526896",
      "orcid": "missing"
    },
    {
      "name": "Siyi Ji",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529694",
      "orcid": "missing"
    },
    {
      "name": "Arjav Patel",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527537",
      "orcid": "missing"
    },
    {
      "name": "Daniel Vogel",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    }
  ],
  "references": [
    {
      "text": "Anand Agarawala and Ravin Balakrishnan. 2006. Keepin' It Real: Pushing the Desktop Metaphor with Physics, Piles and the Pen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1283--1292. DOI: http://dx.doi.org/10.1145/1124772.1124965",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "W Ark, Christopher Dryer, T Selker, and Shumin Zhai. 2018. Representation Matters: The Effect of 3 Dimensional Objects and Spatial Metaphor in a Graphical User Interface. (04 2018).",
      "doi": ""
    },
    {
      "text": "Oriel Bergig, Eyal Soreq, Nate Hagbi, Kirill Pevzner, Nati Levi, Shoham Blau, Yulia Smelansky, and Jihad El-Sana. 2011. Out of the Cube: Augmented Rubik's Cube. Int. J. Comput. Games Technol. 2011 (2011), 1--7. DOI: http://dx.doi.org/10.1155/2011/570210",
      "doi": "10.1155/2011/570210"
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato, and Ivan Poupyrev. 2001. The MagicBook: a transitional AR interface. Comput. Graph. 25, 5 (oct 2001), 745--753. DOI: http://dx.doi.org/10.1016/S0097--8493(01)00117-0",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato, Ivan Poupyrev, and others. 2008. Tangible augmented reality. ACM SIGGRAPH ASIA 7 (2008).",
      "doi": ""
    },
    {
      "text": "M. Billinghurst, S. Weghorst, and T. Furness. 1998. Shared space: An augmented reality approach for computer supported collaborative work. Virtual Reality 3, 1 (01 Mar 1998), 25--36. DOI: http://dx.doi.org/10.1007/BF01409795",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "VP Curtis. 2011. Photographic memory: The album in the age of photography. (2011). https://scholar.google.ca/scholar?hl=en",
      "doi": ""
    },
    {
      "text": "R Dachselt and S Al-Saiegh. 2011. Interacting with printed books using digital pens and smart mobile projection. Proc. Work. Mob. ... (2011). http://old-v1.imld.de/forschung/publikationen/data/ 2011/2011-CHI-ProjectiveAugmentedBooks.pdf",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2004. Combining Crossing-based and Paper-based Interaction Paradigms for Dragging and Dropping Between Overlapping Windows. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 193--196. DOI: http://dx.doi.org/10.1145/1029632.1029667",
      "doi": "10.1145/1029632.1029667"
    },
    {
      "text": "M. Fjeld and B. M. Voegtli. 2002. Augmented Chemistry: an interactive educational workbench. In Proceedings. International Symposium on Mixed and Augmented Reality. 259--321. DOI: http://dx.doi.org/10.1109/ISMAR.2002.1115100",
      "doi": ""
    },
    {
      "text": "Raphael Grasset, Andreas Duenser, Hartmut Seichter, and Mark Billinghurst. 2007. The mixed reality book. In CHI '07 Ext. Abstr. Hum. factors Comput. Syst. - CHI '07. ACM Press, New York, New York, USA, 1953. DOI: http://dx.doi.org/10.1145/1240866.1240931",
      "doi": ""
    },
    {
      "text": "J. Han, S. Heo, H. E. Lee, and G. Lee. 2014. The IrPen: A 6-DOF Pen for Interaction with Tablet Computers. IEEE Computer Graphics and Applications 34, 3 (May 2014), 22--29. DOI: http://dx.doi.org/10.1109/MCG.2014.19",
      "doi": ""
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing Reality: Enabling Opportunistic Use of Everyday Objects As Tangible Proxies in Augmented Reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1957--1967. DOI: http://dx.doi.org/10.1145/2858036.2858134",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "Terje Hillesund. 2010. Digital reading spaces: How expert readers handle books, the Web and electronic paper. First Monday 15, 4 (apr 2010). DOI: http://dx.doi.org/10.5210/fm.v15i4.2762",
      "doi": ""
    },
    {
      "text": "David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus Troje, and Derek Johns. 2005. Paper Windows: Interaction Techniques for Digital Paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 591--599. DOI: http://dx.doi.org/10.1145/1054972.1055054",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Hyun-Tae Jeong, Dong-Woo Lee, Gi-Su Heo, and Cheol-Hoon Lee. 2012. Live Book: A mixed reality book using a projection system. In 2012 IEEE Int. Conf. Consum. Electron. IEEE, 680--681. DOI: http://dx.doi.org/10.1109/ICCE.2012.6162026",
      "doi": ""
    },
    {
      "text": "Sylvia Irawati, Scott Green, Mark Billinghurst, Andreas Duenser, and Heedong Ko. 2006. An Evaluation of an Augmented Reality Multimodal Interface Using Speech and Paddle Gestures. Springer, Berlin, Heidelberg, 272--283. DOI: http://dx.doi.org/10.1007/11941354_28",
      "doi": ""
    },
    {
      "text": "Maria Karam and M. C. Schraefel. 2005. A taxonomy of gestures in human computer interactions. Technical Report.",
      "doi": ""
    },
    {
      "text": "H. Kato, M. Billinghurst, I. Poupyrev, K. Imamoto, and K. Tachibana. 2000. Virtual object manipulation on a table-top AR environment. In Proceedings IEEE and ACM International Symposium on Augmented Reality (ISAR 2000). 111--119. DOI: http://dx.doi.org/10.1109/ISAR.2000.880934",
      "doi": ""
    },
    {
      "text": "KAWASHIMA and T. 2001. Magic Paddle : A Tangible Augmented Reality Interface for Object Manipulation. Proc. 2nd Int. Symp. Mix. Reality, 2001 (2001). https://ci.nii.ac.jp/naid/10022426812",
      "doi": ""
    },
    {
      "text": "Eike Kleiner, Roman Rädle, and Harald Reiterer. 2013. Blended shelf. In CHI '13 Ext. Abstr. Hum. Factors Comput. Syst. - CHI EA '13. ACM Press, New York, New York, USA, 577. DOI: http://dx.doi.org/10.1145/2468356.2468458",
      "doi": ""
    },
    {
      "text": "Gun A. Lee, Mark Billinghurst, and Gerard Jounghyun Kim. 2004. Occlusion based interaction methods for tangible augmented reality environments. In Proc. 2004 ACM SIGGRAPH Int. Conf. Virtual Real. Contin. its Appl. Ind. - VRCAI '04. ACM Press, New York, New York, USA, 419. DOI: http://dx.doi.org/10.1145/1044588.1044680",
      "doi": "10.1145/1044588.1044680"
    },
    {
      "text": "Gun A. Lee, Gerard J. Kim, and Mark Billinghurst. 1. Interaction Design for Tangible Augmented Reality Applications. In Emerg. Technol. Augment. Real. IGI Global, 261--282. DOI: http://dx.doi.org/10.4018/978--1--59904-066-0.ch013",
      "doi": ""
    },
    {
      "text": "David Lindlbauer, Jörg Mueller, and Marc Alexa. 2017. Changing the Appearance of Real-World Objects By Modifying Their Surroundings. In Proc. 2017 CHI Conf. Hum. Factors Comput. Syst. - CHI '17. ACM Press, New York, New York, USA, 3954--3965. DOI: http://dx.doi.org/10.1145/3025453.3025795",
      "doi": "10.1145/3025453.3025795"
    },
    {
      "text": "Julian Conrad Alan Looser. 2007. Ar magic lenses: Addressing the challenge of focus and context in augmented reality. (2007).",
      "doi": ""
    },
    {
      "text": "George Margetis, Xenophon Zabulis, Panagiotis Koutlemanis, Margherita Antona, and Constantine Stephanidis. 2013. Augmented interaction with physical books in an Ambient Intelligence learning environment. Multimed. Tools Appl. 67, 2 (nov 2013), 473--495. DOI: http://dx.doi.org/10.1007/s11042-011-0976-x",
      "doi": "10.1007/s11042-011-0976-x"
    },
    {
      "text": "Chris McDonald and Gerhard Roth. 2003. Replacing a mouse with hand gesture in a plane-based augmented reality system. National Research Council of Canada.",
      "doi": ""
    },
    {
      "text": "H Mehmet. 2016. The classification of augmented reality books: a literature review. In Proceedings of INTED2016 Conference. 4110--4118.",
      "doi": ""
    },
    {
      "text": "Meta 2. 2018. Augmented Reality Glasses. (2018). https://www.metavision.com/",
      "doi": ""
    },
    {
      "text": "Thomas Pietrzak, Sylvain Malacria, and Éric Lecolinet. 2012. S-Notebook: Augmenting Mobile Devices with Interactive Paper for Data Management. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, NY, NY, USA, 733--736. DOI: http://dx.doi.org/10.1145/2254556.2254696",
      "doi": "10.1145/2254556.2254696"
    },
    {
      "text": "Ben Piper, Carlo Ratti, and Hiroshi Ishii. 2002. Illuminating clay. In Proc. SIGCHI Conf. Hum. factors Comput. Syst. Chang. our world, Chang. ourselves - CHI '02. ACM Press, New York, New York, USA, 355. DOI: http://dx.doi.org/10.1145/503376.503439",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "POUPYREV and I. 2001. Tiles : A Mixed Reality Authoring Interface. Human-Computer Interact. INTERACT'01 (2001). https://ci.nii.ac.jp/naid/10020982585/",
      "doi": ""
    },
    {
      "text": "A. Rauber and H. Bina. 1999. A metaphor graphics based representation of digital libraries on the World Wide Web: using the libViewer to make metadata visible. In Proceedings. Tenth Int. Work. Database Expert Syst. Appl. DEXA 99. IEEE, 286--290. DOI: http://dx.doi.org/10.1109/DEXA.1999.795181",
      "doi": ""
    },
    {
      "text": "ShelvAR. 2013. ShelvAR. (2013). http://www.shelvar.com/",
      "doi": ""
    },
    {
      "text": "Jinwook Shim, Yoonsik Yang, Nahyung Kang, Jonghoon Seo, and Tack-Don Han. 2016. Gesture-based interactive augmented reality content authoring system using HMD. Virtual Reality 20, 1 (2016), 57--69.",
      "doi": "10.1007/s10055-016-0282-z"
    },
    {
      "text": "Carol Tenopir, Donald W. King, Sheri Edwards, and Lei Wu. 2009. Electronic journals and changes in scholarly article seeking and reading patterns. Aslib Proc. 61, 1 (jan 2009), 5--32. DOI: http://dx.doi.org/10.1108/00012530910932267",
      "doi": ""
    },
    {
      "text": "Lucia Terrenghi, David Kirk, Abigail Sellen, and Shahram Izadi. 2007. Affordances for manipulation of physical versus digital media on interactive surfaces. In Proc. SIGCHI Conf. Hum. factors Comput. Syst. - CHI '07. ACM Press, New York, New York, USA, 1157. DOI: http://dx.doi.org/10.1145/1240624.1240799",
      "doi": "10.1145/1240624.1240799"
    },
    {
      "text": "E. J. Umlauf, H. Piringer, G. Reitmayr, and D. Schmalstieg. 2002. ARLib: the augmented library. In The First IEEE International Workshop Agumented Reality Toolkit,. 2 pp.--. DOI: http://dx.doi.org/10.1109/ART.2002.1106996",
      "doi": ""
    },
    {
      "text": "Nancy A. Van House. 2011. Personal photography, digital technologies and the uses of the visual. Vis. Stud. 26, 2 (jun 2011), 125--134. DOI: http://dx.doi.org/10.1080/1472586X.2011.571888",
      "doi": ""
    },
    {
      "text": "Vuforia. Vuforia | Augmented Reality. (????). https://www.vuforia.com/",
      "doi": ""
    },
    {
      "text": "Pierre Wellner. 1993. Interacting with Paper on the DigitalDesk. Commun. ACM 36, 7 (July 1993), 87--96. DOI: http://dx.doi.org/10.1145/159544.159630",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "David West, Aaron Quigley, and Judy Kay. 2007. MEMENTO: a digital-physical scrapbook for memory sharing. Personal and Ubiquitous Computing 11, 4 (01 Apr 2007), 313--328. DOI: http://dx.doi.org/10.1007/s00779-006-0090--7",
      "doi": ""
    },
    {
      "text": "J. Wijnen and E.A.W.H. van den Hoven. 2011. Connected sketchbook : linking digital files to physical pages. (2011). http://repository.tue.nl/730757",
      "doi": ""
    },
    {
      "text": "Chih-Sung (Andy) Wu, Susan J. Robinson, and Ali Mazalek. 2008. Turning a page on the digital annotation of physical books. In Proc. 2nd Int. Conf. Tangible Embed. Interact. - TEI '08. ACM Press, New York, New York, USA, 109. DOI: http://dx.doi.org/10.1145/1347390.1347414",
      "doi": "10.1145/1347390.1347414"
    },
    {
      "text": "Po-Chen Wu, Robert Wang, Kenrick Kin, Christopher Twigg, Shangchen Han, Ming-Hsuan Yang, and Shao-Yi Chien. 2017. DodecaPen: Accurate 6DoF Tracking of a Passive Stylus. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 365--374. DOI: http://dx.doi.org/10.1145/3126594.3126664",
      "doi": "10.1145/3126594.3126664"
    }
  ]
}