{
  "doi": "10.1145/3313831.3376415",
  "title": "Taking Data Out of Context to Hyper-Personalize Ads: Crowdworkers' Privacy Perceptions and Decisions to Disclose Private Information",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Data brokers and advertisers increasingly collect data in one context and use it in another. When users encounter a misuse of their data, do they subsequently disclose less information? We report on human-subjects experiments with 25 in-person and 280 online participants. First, participants provided personal information amidst distractor questions. A week later, while participants completed another survey, they received either a robotext or online banner ad seemingly unrelated to the study. Half of the participants received an ad containing their name, partner's name, preferred cuisine, and location; others received a generic ad. We measured how many of 43 potentially invasive questions participants subsequently chose to answer. Participants reacted negatively to the personalized ad, yet answered nearly all invasive questions accurately. We unpack our results relative to the privacy paradox, contextual integrity, and power dynamics in crowdworker platforms.",
  "tags": [
    "targeted advertising",
    "hyper-personalization",
    "creepy",
    "user study"
  ],
  "authors": [
    {
      "name": "Julia Hanson",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659496043",
      "orcid": "missing"
    },
    {
      "name": "Miranda Wei",
      "institution": "University of Washington & University of Chicago, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260179",
      "orcid": "0000-0003-2539-0730"
    },
    {
      "name": "Sophie Veys",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527359",
      "orcid": "missing"
    },
    {
      "name": "Matthew Kugler",
      "institution": "Northwestern University, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528430",
      "orcid": "missing"
    },
    {
      "name": "Lior Strahilevitz",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527675",
      "orcid": "missing"
    },
    {
      "name": "Blase Ur",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Leslie K. John, and George Loewenstein. 2012. The Impact of Relative Standards on the Propensity to Disclose. Journal of Marketing Research (2012).",
      "doi": ""
    },
    {
      "text": "Idris Adjerid, Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2013. Sleights of Privacy: Framing, Disclosures, and the Limits of Transparency. In Proc. SOUPS.",
      "doi": "10.1145/2501604.2501613"
    },
    {
      "text": "Adam L. Alter and Daniel M. Oppenheimer. 2009. Suppressing Secrecy Through Metacognitive Ease Cognitive Fluency Encourages Self-Disclosure. Psychological Science 20, 11 (October 2009), 1414--1420.",
      "doi": ""
    },
    {
      "text": "Muhammad Ahmad Bashir, Umar Farooq, Maryam Shahid, Muhammad Fareed Zaffar, and Christo Wilson. 2019. Quantity vs. Quality: Evaluating User Interest Profiles Using Ad Preference Managers. In Proc. NDSS.",
      "doi": ""
    },
    {
      "text": "Muhammad Ahmad Bashir and Christo Wilson. 2018. Diffusion of User Tracking Data in the Online Advertising Ecosystem. PoPETS 2018, 4 (2018), 85--103.",
      "doi": ""
    },
    {
      "text": "Tom Clark. 2010. On 'Being Researched': Why Do People Engage With Qualitative Research? Qualitative Research (2010).",
      "doi": ""
    },
    {
      "text": "Mary J. Culnan and Pamela K. Armstrong. 1999. Information Privacy Conerns, Procedural Fairness, and Impersonal Trust: An Empirical Investigation. Organization Science 10, 1 (1999).",
      "doi": ""
    },
    {
      "text": "Amit Datta, Michael Carl Tschantz, and Anupam Datta. 2015. Automated Experiments on Ad Privacy Settings. PoPETS 2015, 1 (2015), 92--112.",
      "doi": ""
    },
    {
      "text": "Deborah Davis, Assaf Soref, J. Guillermo Villalobos, and Mario Mikulincer. 2016. Priming States of Mind Can Affect Disclosure of Threatening Self-Information: Effects of Self-Affirmation, Mortality Salience, and Attachment Orientations. Law and Human Behavior 40, 4 (2016), 351--361.",
      "doi": ""
    },
    {
      "text": "AJ Dellinger. 2019. Americans Received A Record 5.7 Billion Robocalls In October. Forbes. (November 2019).",
      "doi": ""
    },
    {
      "text": "Tamara Dinev and Paul Hart. 2006. An Extended Privacy Calculus Model for E-Commerce Transactions. Information Systems Research 17, 1 (2006).",
      "doi": ""
    },
    {
      "text": "Claire Dolin, Ben Weinshel, Shawn Shan, Chang Min Hahn, Euirim Choi, Michelle L. Mazurek, and Blase Ur. 2018. Unpacking Perceptions of Data-Driven Inferences Underlying Online Targeting and Personalization. In Proc. CHI.",
      "doi": "10.1145/3173574.3174067"
    },
    {
      "text": "Charles Duhigg. 2012. How Companies Learn Your Secrets. New York Times. (February 2012). https://www.nytimes.com/2012/02/19/magazine/shoppinghabits.html.",
      "doi": ""
    },
    {
      "text": "Steven Englehardt, Jeffrey Han, and Arvind Narayanan. 2018. I Never Signed Up For This! Privacy Implications of Email Tracking. PoPETS 2018, 1 (2018), 109--126.",
      "doi": ""
    },
    {
      "text": "Steven Englehardt and Arvind Narayanan. 2016. Online Tracking: A 1-Million-Site Measurement and Analysis. In Proc. CCS.",
      "doi": "10.1145/2976749.2978313"
    },
    {
      "text": "Motahhare Eslami, Sneha R. Krishna Kumaran, Christian Sandvig, and Karrie Karahalios. 2018. Communicating Algorithmic Process in Online Behavioral Advertising. In Proc. CHI.",
      "doi": "10.1145/3173574.3174006"
    },
    {
      "text": "Alisa Frik and Alexia Gaudeul. 2016. The Relation Between Privacy Protection and Risk Attitudes, with a New Experimental Method to Elicit the Emplicit Monetary Value of Privacy. CEGE Discussion Papers 296 (November 2016).",
      "doi": ""
    },
    {
      "text": "Nina Gerber, Paul Gerber, and Melanie Volkamer. 2018. Explaining the Privacy Paradox: A Systematic Review of Literature Investigating Privacy Attitude and Behavior. Computers & Security 77 (2018), 226--261.",
      "doi": "10.1016/j.cose.2018.04.002"
    },
    {
      "text": "Avi Goldfarb and Catherine E. Tucker. 2011. Privacy Regulation and Online Advertising. Management Science 57, 1 (2011), 57--71.",
      "doi": "10.1287/mnsc.1100.1246"
    },
    {
      "text": "Kashmir Hill. 2012. How Target Figured Out A Teen Girl Was Pregnant Before Her Father Did. Forbes. (February 2012). https://www.forbes.com/sites/ kashmirhill/2012/02/16/how-target-figured-out-ateen-girl-was-pregnant-before-her-father-did.",
      "doi": ""
    },
    {
      "text": "Kashmir Hill. 2019. I Got Access to My Secret Consumer Score. Now You Can Get Yours, Too. New York Times. (November 2019). https://www.nytimes.com/2019/11/04/business/secretconsumer-score-access.html.",
      "doi": ""
    },
    {
      "text": "Kai-Lung Hui, Bernard C.Y. Tan, and Chyan-Yee Goh. 2006. Online Information Disclosure: Motivators and Measurements. ACM TOIT 6, 4 (January 2006), 415--441.",
      "doi": ""
    },
    {
      "text": "Jim Isaak and Mina J Hanna. 2018. User Data Privacy: Facebook, Cambridge Analytica, and Privacy Protection. Computer 51, 8 (2018), 56--59.",
      "doi": "10.1109/MC.2018.3191268"
    },
    {
      "text": "Leslie K. John, Alessandro Acquisti, and George Loewenstein. 2011. Strangers on a Plane: Context-Dependent Willingness to Divulge Sensitive Information. Journal of Consumer Research 37, 5 (February 2011), 858--873.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In Proc. SOUPS.",
      "doi": ""
    },
    {
      "text": "N. Kaufmann, Thimo Schulze, and Daniel Veit. 2011. More Than Fun and Money. Worker Motivation in Crowdsourcing--A Study on Mechanical Turk. In Proc. AMCIS.",
      "doi": ""
    },
    {
      "text": "Kyle Kercher. 1992. Assessing Subjective Well-Being in the Old-Old: The PANAS as a Measure of Orthogonal Dimensions of Positive and Negative Affect. Research on Aging 14, 2 (June 1992), 131--168.",
      "doi": ""
    },
    {
      "text": "Freya De Keyzer, Nathalie Dens, and Patrick De Pelsmacker. 2015. Is This For Me? How Consumers Respond to Personalized Advertising on Social Network Sites. Journal of Interactive Advertising 15, 2 (2015), 1--11.",
      "doi": ""
    },
    {
      "text": "Balachander Krishnamurthy, Delfina Malandrino, and Craig E. Wills. 2007. Measuring Privacy Loss and the Impact of Privacy Protection in Web Browsing. In Proc. SOUPS.",
      "doi": ""
    },
    {
      "text": "Mathias Lecuyer, Riley Spahn, Yannis Spiliopolous, Augustin Chaintreau, Roxana Geambasu, and Daniel Hsu. 2015. Sunlight: Fine-Grained Targeting Detection at Scale With Statistical Confidence. In Proc. CCS.",
      "doi": "10.1145/2810103.2813614"
    },
    {
      "text": "Pedro G. Leon, Blase Ur, Rebecca Balebako, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Why Johnny Can't Opt Out: A Usability Evaluation of Tools to Limit Online Behavioral Advertising. In Proc. CHI.",
      "doi": "10.1145/2207676.2207759"
    },
    {
      "text": "Adam Lerner, Anna Kornfeld Simpson, Tadayoshi Kohno, and Franziska Roesner. 2016. Internet Jones and the Raiders of the Lost Trackers: An Archaeological Study of Web Tracking From 1996 to 2016. In Proc. USENIX Security.",
      "doi": ""
    },
    {
      "text": "John Maindonald and John Braun. 2010. Data Analysis and Graphics Using R -- An Example-Based Approach (3 ed.). Cambridge University Press. https://maths-people.anu.edu.au/~johnm/rbook/2edn/xtras/mlm-lme.pdf.",
      "doi": ""
    },
    {
      "text": "Miguel Malheiros, Charlene Jennett, Snehalee Patel, Sacha Brostoff, and M. Angela Sasse. 2012. Too Close for Comfort: A Study of the Effectiveness and Acceptability of Rich-Media Personalized Advertising. In Proc. CHI.",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Jessica Vitak, Arvind Narayanan, and Marshini Chetty. 2018. Characterizing the Use of Browser-Based Blocking Extensions to Prevent Online Tracking. In Proc. SOUPS.",
      "doi": ""
    },
    {
      "text": "Jonathan R. Mayer and John C. Mitchell. 2012. Third-Party Web Tracking: Policy and Technology. In Proc. IEEE S&P.",
      "doi": ""
    },
    {
      "text": "Georg Merzdovnik, Markus Huber, Damjan Buhov, Nick Nikiforakis, Sebastian Neuner, Martin Schmiedecker, and Edgar Weippl. 2017. Block Me If You Can: A Large-Scale Study of Tracker-Blocking Tools. In Proc. EuroS&P.",
      "doi": ""
    },
    {
      "text": "Rachel Metz. 2018. The Scientist Who Gave Cambridge Analytica Its Facebook Data Got Lousy Reviews Online. MIT Technology Review. (March 2018). https://www.technologyreview.com/f/610598/thescientist-who-gave-cambridge-analytica-its-facebookdata-got-lousy-reviews/.",
      "doi": ""
    },
    {
      "text": "Stanely Milgram. 1965. Some Conditions of Obedience and Disobedience to Authority. Human Relations (1965).",
      "doi": ""
    },
    {
      "text": "Jason C. Miller. 2009. Regulating Robocalls: Are Automated Calls the Sound of, or a Threat to, Democracy. Michigan Technology Law Review 16, 1 (2009), 213--253.",
      "doi": ""
    },
    {
      "text": "Youngme Moon. 2000. Intimate Exchanges: Using Computers to Elicit Self-Disclosure from Consumers. Journal of Consumer Research 26, 4 (March 2000), 323--339.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as Contextual Integrity. Washington Law Review 79, 1 (2 2004), 119--157.",
      "doi": ""
    },
    {
      "text": "Lukasz Olejnik, Minh-Dung Tran, and Claude Castelluccia. 2014. Selling Off Privacy at Auction. In Proc. NDSS.",
      "doi": ""
    },
    {
      "text": "Stefan Palan and Christian Schitter. 2018. Prolific.ac-A Subject Pool for Online Experiments. Journal of Behavioral and Experimental Finance 17 (December 2018), 22--27.",
      "doi": ""
    },
    {
      "text": "Angelisa C. Plane, Elissa M. Redmiles, Michelle L. Mazurek, and Michael Carl Tschantz. 2017. Exploring User Perceptions of Discrimination in Online Targeted Advertising. In Proc. USENIX Security.",
      "doi": ""
    },
    {
      "text": "Tyson Quick. 2017. The Advertising Personalization Classification System. Medium. (January 2017). https://medium.com/@tysonquick/the-advertisingpersonalization-classification-system-4ea1dd794d19.",
      "doi": ""
    },
    {
      "text": "Edith Ramirez, Julie Brill, Maureen K. Ohlhausen, Joshua D. Wright, and Terrell McSweeny. 2015. Data Brokers A Call for Transparency and Accountability. Technical Report. FTC.",
      "doi": ""
    },
    {
      "text": "Franziska Roesner, Tadayoshi Kohno, and David Wetherall. 2012. Detecting and Defending Against Third-Party Tracking on the Web. In Proc. NSDI.",
      "doi": "10.5555/2228298.2228315"
    },
    {
      "text": "Camille L. Ryan and Kurt Bauman. 2016. Educational Attainment in the United States: 2015. Technical Report. US Census.",
      "doi": ""
    },
    {
      "text": "Shruti Sannon and Dan Cosley. 2019. Privacy, Power, and Invisible Labor on Amazon Mechanical Turk. In Proc. CHI.",
      "doi": "10.1145/3290605.3300512"
    },
    {
      "text": "Tyler Shanahan, Trang P. Tran, and Erik C. Taylor. 2019. Getting to Know You: Social Media Personalization as a Means of Enhancing Brand Loyalty and Perceived Quality. Journal of Retailing and Consumer Services 47 (March 2019), 57--65.",
      "doi": ""
    },
    {
      "text": "Roseanna Sommers and Vanessa K. Bohns. 2019. The Voluntariness of Voluntary Consent: Consent Searches and the Psychology of Compliance. Yale Law Journal 128, 7 (2019).",
      "doi": ""
    },
    {
      "text": "Sarah Spiekermann, Jens Grossklags, and Bettina Berendt. 2001. E-privacy in 2nd Generation E-Commerce: Privacy Preferences versus Actual Behavior. In Proc. EC.",
      "doi": "10.1145/501158.501163"
    },
    {
      "text": "Latanya Sweeney. 2013. Discrimination in Online Ad Delivery. ACM Queue 11, 3 (April 2013).",
      "doi": "10.1145/2460276.2460278"
    },
    {
      "text": "The AAAA and ANA and BBB and DMA and IAB. 2009. Self-Regulatory Principles for Online Behavioral Advertising. Technical Report.",
      "doi": ""
    },
    {
      "text": "Roger Tourangeau and Ting Yan. 2007. Sensitive Questions in Surveys. Psychological Bulletin 133, 5 (2007), 859--883.",
      "doi": ""
    },
    {
      "text": "Sabine Trepte, Michael Scharkow, and Tobias Dienlin. 2019. The Privacy Calculus Contextualized: The Influence of Affordances. Computers in Human Behavior (2019).",
      "doi": ""
    },
    {
      "text": "Huahong Tu, Adam Doupé, Ziming Zhao, and Gail-Joon Ahn. 2016. SoK: Everyone Hates Robocalls: A Survey of Techniques against Telephone Spam. In Proc. IEEE S&P.",
      "doi": ""
    },
    {
      "text": "Catherine Tucker. 2014. Social Networks, Personalized Advertising and Privacy Controls. Journal of Marketing Research 51, 5 (October 2014), 546--562.",
      "doi": ""
    },
    {
      "text": "Joseph Turow, Jennifer King, Chris Jay Hoofnagle, Amy Bleakley, and Michael Hennessy. 2009. Americans Reject Tailored Advertising and Three Activities That Enable It. SSRN (September 2009).",
      "doi": ""
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Proc. SOUPS.",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "David Watson and Lee Anna Clark. 1999. The PANAS-X: Manual for the Positive and Negative Affect Schedule Expanded Form.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and Validation of Brief Measures of Positive and Negative Affect: The PANAS Scales. Journal of Personality and Social Psychology 54, 6 (June 1988), 1063--1070.",
      "doi": ""
    },
    {
      "text": "Ben Weinshel, Miranda Wei, Mainack Mondal, Euirim Choi, Shawn Shan, Claire Dolin, Michelle L. Mazurek, and Blase Ur. 2019. Oh, the Places You've Been! User Reactions to Longitudinal Transparency About Third-Party Web Tracking and Inferencing. In Proc. CCS.",
      "doi": "10.1145/3319535.3363200"
    },
    {
      "text": "Allison Woodruff, Vasyl Pihur, Sunny Consolvo, Lauren Schmidt, Laura Brandimarte, and Alessandro Acquisti. 2014. Would a Privacy Fundamentalist Sell Their DNA for $1000... If Nothing Bad Happened as a Result? The Westin Categories, Behavioral Intentions, and Consequences. In Proc. SOUPS.",
      "doi": ""
    },
    {
      "text": "Huichuan Xia, Yang Wang, Yun Huang, and Anuj Shah. 2017. \"Our Privacy Needs to Be Protected at All Costs\": Crowd Workers' Privacy Experiences on Amazon Mechanical Turk. PACM HCI 1, Article 113 (Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Yaxing Yao, Davide Lo Re, and Yang Wang. 2017. Folk Models of Online Behavioral Advertising. In Proc. CSCW.",
      "doi": "10.1145/2998181.2998316"
    },
    {
      "text": "Jay (Hyunjae) Yu and Brenda Cude. 2009. Hello, Mrs. Sarah Jones! We Recommend This Product! Consumers' Perceptions About Personalized Advertising: Comparisons Across Advertisements Delivered via Three Different Types of Media. International Journal of Consumer Studies 33, 4 (June 2009), 503--514.",
      "doi": ""
    }
  ]
}