{
  "doi": "10.1145/3313831.3376252",
  "title": "ARMath: Augmenting Everyday Life with Math Learning",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "We introduce ARMath, a mobile Augmented Reality (AR) system that allows ch ildren to discover mathematical concepts in familiar, ord inary objects and engage with math problems in meaningful contexts. Leveraging advanced computer vision, ARMath recognizes everyday objects, visualizes their mathematical attributes, and turns them into tangible or virtual manipulatives. Using the manipulatives, children can solve problems that situate math operations or concepts in specific everyday contexts. Informed by four participatory design sessions with teachers and children, we developed five ARMath modules to support basic arithmetic and 2D geometry. We also conducted an exploratory evaluation of ARMath with 27 children (ages 5-8) at a local children's museum. Our findings demonstrate how ARMath engages children in math learning, how failures in AI can be used as learning opportunities, and challenges that children face when using ARMath.",
  "tags": [
    "learning",
    "human-ai interaction",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Seokbin Kang",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701718",
      "orcid": "missing"
    },
    {
      "name": "Ekta Shokeen",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526952",
      "orcid": "missing"
    },
    {
      "name": "Virginia L. Byrne",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160502",
      "orcid": "missing"
    },
    {
      "name": "Leyla Norooz",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-82259251157/rel-imgonly/img_20140309_190317.jpg",
      "acmid": "82259251157",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Bonsignore",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641019",
      "orcid": "missing"
    },
    {
      "name": "Caro Williams-Pierce",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526405",
      "orcid": "missing"
    },
    {
      "name": "Jon E. Froehlich",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81331492504/rel-imgonly/81331492504.jpg",
      "acmid": "81331492504",
      "orcid": "0000-0001-8291-3353"
    }
  ],
  "references": [
    {
      "text": "Martín Abadi, Paul Barham, Jianmin Chen, Zhifeng Chen, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Geoffrey Irving, Michael Isard, Manjunath Kudlur, Josh Levenberg, Rajat Monga, Sherry Moore, Derek G. Murray, Benoit Steiner, Paul Tucker, Vijay Vasudevan, Pete Warden, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2016. TensorFlow: A system for large-scale machine learning. 265--283.",
      "doi": ""
    },
    {
      "text": "Wafa Almukadi and A. LUniversity of Chinese Academy of Sciences Stephane. 2015. BlackBlocks: Tangible Interactive System for Children to Learn 3-Letter Words and Basic Math. Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces - ITS '15: 421--424. https://doi.org/10.1145/2817721.2823482",
      "doi": ""
    },
    {
      "text": "Ann Anderson. 1997. Families and mathematics: A study of parent-child interactions. Journal for Research in Mathematics Education 28, 4: 484--811. https://doi.org/10.2307/749684",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and alexa. Conference on Human Factors in Computing Systems - Proceedings: 1--13. https://doi.org/10.1145/3290605.3300473",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Ceylan Besevli, Hakan Urey, Elif Salman, Ozuzhan Özcan, and Tilbe Goksun. 2019. MaR-T: Designing a projection-based mixed reality system for nonsymbolic math development of preschoolers: Guided by theories of cognition and learning. Proceedings of the 18th ACM International Conference on Interaction Design and Children, IDC 2019: 280--292. https://doi.org/10.1145/3311927.3323147",
      "doi": "10.1145/3311927.3323147"
    },
    {
      "text": "Alex Bewley, Zongyuan Ge, Lionel Ott, Fabio Ramos, and Ben Upcroft. 2016. Simple online and realtime tracking. Proceedings - International Conference on Image Processing, ICIP 2016--Augus: 3464--3468. https://doi.org/10.1109/ICIP.2016.7533003",
      "doi": ""
    },
    {
      "text": "M. Billinghurst, H. Kato, and I. Poupyrev. 2001. The MagicBook- Moving Seamlessly between Reality and Virtuality. IEEE Computer Graphics and Applications 21, 1: 6--9. https://doi.org/10.1109/38.920621",
      "doi": "10.5555/616070.618818"
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato, and Ivan Poupyrev. 2001. The MagicBook: A transitional AR interface. Computers and Graphics (Pergamon) 25, 5: 745--753. https://doi.org/10.1016/S0097--8493(01)00117-0",
      "doi": ""
    },
    {
      "text": "Emily C. Bouck, Rajiv Satsangi, Teresa Taber Doughty, and William T. Courtney. 2014. Virtual and concrete manipulatives: A comparison of approaches for solving mathematics problems for students with autism spectrum disorder. Journal of Autism and Developmental Disorders 44, 1: 180--193. https://doi.org/10.1007/s10803-013--1863--2",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. Retrieved July 11, 2014 from http://www.tandfonline.com/doi/abs/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Murray S Britt and Kathryn C Irwin. 2008. Algebraic thinking with and without algebraic representation: a three-year longitudinal study. ZDM 40, 1: 39--53.",
      "doi": ""
    },
    {
      "text": "Keith R. Bujak, Iulian Radu, Richard Catrambone, Blair MacIntyre, Ruby Zheng, and Gary Golubski. 2013. A psychological perspective on augmented reality in the mathematics classroom. Computers and Education 68: 536--544. https://doi.org/10.1016/j.compedu.2013.02.017",
      "doi": "10.5555/2974070.2974228"
    },
    {
      "text": "Yvonne M. Caldera, Anne Mc Donald Culp, Marion O'Brien, Rosemarie T. Truglio, Mildred Alvarez, and Aletha C. Huston. 1999. Children's play preferences, construction play with blocks, and visual-spatial skills: Are they related? International Journal of Behavioral Development 23, 4: 855--872. https://doi.org/10.1080/016502599383577",
      "doi": ""
    },
    {
      "text": "Julie Carmigniani, Borko Furht, Marco Anisetti, Paolo Ceravolo, Ernesto Damiani, and Misa Ivkovic. 2011. Augmented reality technologies, systems and applications. Multimedia Tools and Applications 51, 1: 341--377. https://doi.org/10.1007/s11042-010-0660--6",
      "doi": "10.1007/S11042-010-0660-6"
    },
    {
      "text": "Randall I Charles. 2005. Big Ideas and Understandings as the Foundation for Elementary and Middle School Mathematics. 7, 3: 9--24.",
      "doi": ""
    },
    {
      "text": "Yi Cheng, Kate Yen, Yeqi Chen, Sijin Chen, and Alexis Hiniker. 2018. Why doesn't it work? Voice-driven interfaces and young children's communication repair strategies. IDC 2018 - Proceedings of the 2018 ACM Conference on Interaction Design and Children: 337--348. https://doi.org/10.1145/3202185.3202749",
      "doi": ""
    },
    {
      "text": "Tosti H C Chiang, Stephen J H Yang, Gwo-jen Hwang, Tosti H C Chiang, Stephen J H Yang, and Gwo-jen Hwang. 2017. An Augmented Reality-based Mobile Learning System to Improve Students ' Learning Achievements and Motivations in Natural Science Inquiry Activities An Augmented Reality-based Mobile Learning System t. 17, 4.",
      "doi": ""
    },
    {
      "text": "Sébastien Cuendet, Quentin Bonnard, Son Do-Lenh, and Pierre Dillenbourg. 2013. Designing augmented reality for the classroom. Computers and Education 68: 557--569. https://doi.org/10.1016/j.compedu.2013.02.015",
      "doi": ""
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry: developing new technologies for children with children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 592--599. Retrieved March 8, 2013 from http://dl.acm.org/citation.cfm?id=302979.303166",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Andreas Dünser, Lawrence Walker, Heather Horner, and Daniel Bentall. 2012. Creating interactive physics education books with augmented reality. Proceedings of the 24th Australian Computer-Human Interaction Conference on - OzCHI '12: 107--114. https://doi.org/10.1145/2414536.2414554",
      "doi": "10.1145/2414536.2414554"
    },
    {
      "text": "Noel Enyedy, Joshua A. Danish, Girlie Delacruz, and Melissa Kumar. 2012. Learning physics through play in an augmented reality environment. International Journal of Computer-Supported Collaborative Learning 7, 3: 347--378. Retrieved September 7, 2015 from http://link.springer.com/10.1007/s11412-012--9150--3",
      "doi": ""
    },
    {
      "text": "Anne Estapa and Larysa Nadolny. 2015. The Effect of an Augmented Reality Enhanced Mathematics Lesson on Student Achievement and Motivation. Journal of STEM Education 16, 3: 40--49.",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails, Mona Leigh Guha, Allison Druin, and others. 2013. Methods and techniques for involving children in the design of new technology for children. Foundations and Trends®in Human-Computer Interaction 6, 2: 85--166.",
      "doi": ""
    },
    {
      "text": "Taciana Pontual Falcão, Christine Ulrich, Andre Klemke, and Madeleine Schüler. 2018. Tangible Tens?: Evaluating a Training of Basic Numerical Competencies with an Interactive Tabletop. 1--12.",
      "doi": ""
    },
    {
      "text": "Morten Fjeld, Jonas Fredriksson, Martin Ejdestig, Florin Duca, Kristina Bötschi, Benedikt Voegtli, and Patrick Juchli. 2007. Tangible user interface for chemistry education: comparative evaluation and re-design. In Proceedings of the SIGCHI conference on Human factors in computing systems, 805--808.",
      "doi": "10.1145/1240624.1240745"
    },
    {
      "text": "Julie Gainsburg. 2008. Real-world connections in secondary mathematics teaching. Journal of Mathematics Teacher Education 11, 3: 199--219. https://doi.org/10.1007/s10857-007--9070--8",
      "doi": ""
    },
    {
      "text": "Alexandre Gillet, Michel Sanner, Daniel Stoffler, David Goodsell, and Arthur Olson. 2004. Augmented Reality with Tangible Auto-Fabricated Models for Molecular Biology Applications. IEEE Visualization: 235--241. https://doi.org/10.1109/VISUAL.2004.7",
      "doi": "10.1109/VISUAL.2004.7"
    },
    {
      "text": "Google. 2019. ARCore.",
      "doi": ""
    },
    {
      "text": "Lynne Hall, Colette Hume, and Sarah Tazzyman. 2016. Five degrees of happiness: effective smiley face Likert Scales for evaluating with children. In Proceedings of the The 15th International Conference on Interaction Design and Children, 311--321.",
      "doi": "10.1145/2930674.2930719"
    },
    {
      "text": "John A Hartigan and Manchek A Wong. 1979. Algorithm AS 136: A k-means clustering algorithm. Journal of the Royal Statistical Society. Series C (Applied Statistics) 28, 1: 100--108.",
      "doi": "10.5555/540298"
    },
    {
      "text": "Kaiming He, Georgia Gkioxari, Piotr Dollar, and Ross Girshick. 2017. Mask R-CNN. Proceedings of the IEEE International Conference on Computer Vision 2017--Octob: 2980--2988. https://doi.org/10.1109/ICCV.2017.322",
      "doi": ""
    },
    {
      "text": "S Henderson and S Feiner. 2010. Opportunistic Tangible User Interfaces for Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 16, 1: 4--16. https://doi.org/10.1109/TVCG.2009.91",
      "doi": "10.1109/TVCG.2009.91"
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing Reality: Enabling Opportunistic Use of Everyday Objects as Tangible Proxies in Augmented Reality. To appear in Proceedings of the 2016 ACM annual conference on Human Factors in Computing Systems - CHI '16. https://doi.org/10.1145/2858036.2858134",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade. 2007. Interaction Design and Children. Foundations and Trends® in Human-Computer Interaction 1, 4: 277--392. https://doi.org/10.1561/1100000006",
      "doi": ""
    },
    {
      "text": "Jonathan Huang, Vivek Rathod, Chen Sun, Menglong Zhu, Anoop Korattikara, Alireza Fathi, Ian Fischer, Zbigniew Wojna, Yang Song, Sergio Guadarrama, and Kevin Murphy. 2017. Speed/accuracy trade-offs for modern convolutional object detectors. Proceedings - 30th IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2017 2017--Janua: 3296--3305. https://doi.org/10.1109/CVPR.2017.351",
      "doi": ""
    },
    {
      "text": "María Blanca Ibáñez, Ángela Di Serio, Diego Villarán, and Carlos Delgado Kloos. 2014. Experimenting with electromagnetism using augmented reality: Impact on flow student experience and educational effectiveness. Computers and Education 71: 1--13. https://doi.org/10.1016/j.compedu.2013.09.004",
      "doi": "10.1016/j.compedu.2013.09.004"
    },
    {
      "text": "Elaine B Johnson. 2002. Contextual teaching and learning: What it is and why it's here to stay. Corwin Press.",
      "doi": ""
    },
    {
      "text": "Carmen Juan, Raffaela Canu, and Miguel Giménez. 2008. Augmented Reality interactive storytelling systems using tangible cubes for edutainment. Proceedings - The 8th IEEE International Conference on Advanced Learning Technologies, ICALT 2008, July: 233--235. https://doi.org/10.1109/ICALT.2008.122",
      "doi": "10.1109/ICALT.2008.122"
    },
    {
      "text": "Nurul Farhana Jumaat and Zaidatun Tasir. 2014. Instructional scaffolding in online learning environment: A meta-analysis. Proceedings - 2014 International Conference on Teaching and Learning in Computing and Engineering, LATICE 2014, July 2015: 74--77. https://doi.org/10.1109/LaTiCE.2014.22",
      "doi": "10.1109/LaTiCE.2014.22"
    },
    {
      "text": "Amy M. Kamarainen, Shari Metcalf, Tina Grotzer, Allison Browne, Diana Mazzuca, M. Shane Tutwiler, and Chris Dede. 2013. EcoMOBILE: Integrating augmented reality and probeware with environmental education field trips. Computers and Education 68: 545--556. https://doi.org/10.1016/j.compedu.2013.02.018",
      "doi": "10.5555/2974070.2974213"
    },
    {
      "text": "Seokbin Kang, Leyla Norooz, Elizabeth Bonsignore, Virginia Byrne, Tamara Clegg, and Jon E Froehlich. 2019. PrototypAR: Prototyping and Simulating Complex Systems with Paper Craft and Augmented Reality. In Proceedings of the 18th ACM International Conference on Interaction Design and Children, 253--266.",
      "doi": "10.1145/3311927.3323135"
    },
    {
      "text": "Seokbin Kang, Leyla Norooz, Virginia Byrne, Tamara Clegg, and Jon E Froehlich. 2018. Prototyping and Simulating Complex Systems with Paper Craft and Augmented Reality: An Initial Investigation. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18), 320--328. https://doi.org/10.1145/3173225.3173264",
      "doi": "10.1145/3173225.3173264"
    },
    {
      "text": "Seokbin Kang, Leyla Norooz, Vanessa Oguamanam, Angelisa C. Plane, Tamara L. Clegg, and Jon E. Froehlich. 2016. SharedPhys: Live Physiological Sensing, Whole-Body Interaction, and Large-Screen Visualizations to Support Shared Inquiry Experiences. Proceedings of the The 15th International Conference on Interaction Design and Children - IDC '16: 275--287. https://doi.org/10.1145/2930674.2930710",
      "doi": ""
    },
    {
      "text": "Hannes Kaufmann and Bernd Meyer. 2008. Simulating educational physical experiments in augmented reality. ACM SIGGRAPH ASIA 2008 educators programme on - SIGGRAPH Asia '08. https://doi.org/10.1145/1507713.1507717",
      "doi": "10.1145/1507713.1507717"
    },
    {
      "text": "Hannes Kaufmann and Dieter Schmalstieg. 2003. Mathematics and geometry education with collaborative augmented reality. Computers and Graphics (Pergamon) 27, 3: 339--345. https://doi.org/10.1016/S0097--8493(03)00028--1",
      "doi": ""
    },
    {
      "text": "D.W.F. Van W F Van Dwf Van Krevelen, R. Poelman, D W F Van Krevelen, R. Poelman, D.W.F. Van W F Van Dwf Van Krevelen, Ihsan Rabbi, and Sehat Ullah. 2010. A survey of Augmented Reality Technologies, Applications and Limitations. The International Journal of Virtual Reality 9, 2: 1--20. https://doi.org/10.1155/2011/721827",
      "doi": ""
    },
    {
      "text": "Jean Lave. 1988. Cognition in practice: Mind, mathematics and culture in everyday life. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Hong Quan Le and Jee In Kim. 2017. An augmented reality application with hand gestures for learning 3D geometry. 2017 IEEE International Conference on Big Data and Smart Computing, BigComp 2017, May: 34--41. https://doi.org/10.1109/BIGCOMP.2017.7881712",
      "doi": ""
    },
    {
      "text": "Zeina Atrash Leong and Michael S. Horn. 2011. Representing equality. Proceedings of the 10th International Conference on Interaction Design and Children - IDC '11: 173--176. https://doi.org/10.1145/1999030.1999054",
      "doi": ""
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. 2014. Microsoft coco: Common objects in context. In European conference on computer vision, 740--755.",
      "doi": ""
    },
    {
      "text": "Yvonna S Lincoln. 1985. Naturalistic inquiry. The Blackwell Encyclopedia of Sociology.",
      "doi": ""
    },
    {
      "text": "Mary Montgomery Lindquist. 1989. Results from the Fourth Mathematics Assessment of the National Assessment of Educational Progress. ERIC.",
      "doi": ""
    },
    {
      "text": "Allison S. Liu and Christian D. Schunn. 2017. Applying math onto mechanisms: mechanistic knowledge is associated with the use of formal mathematical strategies. Cognitive Research: Principles and Implications 2, 1: 1--13. https://doi.org/10.1186/s41235-016-0044--1",
      "doi": ""
    },
    {
      "text": "Wei Liu, Dragomir Anguelov, Dumitru Erhan, Christian Szegedy, Scott Reed, Cheng Yang Fu, and Alexander C. Berg. 2016. SSD: Single shot multibox detector. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 9905 LNCS: 21--37. https://doi.org/10.1007/978--3--319--46448-0_2",
      "doi": ""
    },
    {
      "text": "Joanne Lobato, Amy Ellis, and Rose Mary Zbiek. 2010. Developing Essential Understanding of Ratios, Proportions, and Proportional Reasoning for Teaching Mathematics: Grades 6--8. ERIC.",
      "doi": ""
    },
    {
      "text": "Silvia B. Lovato, Anne Marie Piper, and Ellen A. Wartella. 2019. Hey Google, Do Unicorns Exist? 301--313. https://doi.org/10.1145/3311927.3323150",
      "doi": ""
    },
    {
      "text": "Donald E Lytle. 2003. Play and educational theory and practice. Greenwood Publishing Group.",
      "doi": ""
    },
    {
      "text": "Andrew Manches, Claire O'Malley, and Steve Benford. 2010. The role of physical representations in solving number problems: A comparison of young children's use of physical and virtual materials. Computers and Education 54, 3: 622--640. https://doi.org/10.1016/j.compedu.2009.09.023",
      "doi": "10.1016/j.compedu.2009.09.023"
    },
    {
      "text": "Florian Mannus, Jan Rubel, Clemens Wagner, Florian Bingel, and Andre Hinkenjann. 2011. Augmenting magnetic field lines for school experiments. 2011 10th IEEE International Symposium on Mixed and Augmented Reality, October: 263--264. https://doi.org/10.1109/ISMAR.2011.6143893",
      "doi": ""
    },
    {
      "text": "Audrey Mbogho, Lori L Scarlatos, Bedford Ave, and Magdalena Jaworska. 2005. Teaching with Tangibles?: A Tool for Defining Dichotomous Sorting Activities. Children.",
      "doi": ""
    },
    {
      "text": "Nicole Mcneil and Linda Jarvin. 2007. When Theories Don't Add Up?: Disentangling the Manipulatives Debate. Theory into practice 46, 4: 309--316. https://doi.org/10.1080/00405840701593899",
      "doi": ""
    },
    {
      "text": "Nicole M. McNeil and Linda Jarvin. 2007. When theories don't add up: Disentangling the manipulatives debate. Theory into Practice 46, 4: 309--316. https://doi.org/10.1080/00405840701593899",
      "doi": ""
    },
    {
      "text": "S Patricia Moyer, JJ Bolyard, and MA Spikell. 2002. What Are Virtual Manipulatives. Teaching children mathematics 8, 6: 372--377.",
      "doi": ""
    },
    {
      "text": "National Council of Teachers of Mathematics. 2006. Curriculum focal points.",
      "doi": ""
    },
    {
      "text": "National Council of Teachers of Mathematics. 2000. Principles and standards for school mathematics. National Council of Teachers of.",
      "doi": ""
    },
    {
      "text": "John V. Pavlik and Frank Bridges. 2013. The Emergence of Augmented Reality (AR) as a Storytelling Medium in Journalism. Journalism and Communication Monographs 15, 1: 4--59. https://doi.org/10.1177/1522637912470819",
      "doi": ""
    },
    {
      "text": "Haim Permuter, Joseph Francos, and Ian Jermyn. 2006. A study of Gaussian mixture models of color and texture features for image classification and segmentation. Pattern Recognition 39, 4: 695--706. https://doi.org/10.1016/j.patcog.2005.10.028",
      "doi": "10.1016/j.patcog.2005.10.028"
    },
    {
      "text": "Inc. Photomath. 2018. Photomath.",
      "doi": ""
    },
    {
      "text": "Remo Pillat, Arjun Nagendran, and Robb Lindgren. 2012. Design requirements for using embodied learning and whole-body metaphors in a mixed reality simulation game. In 2012 IEEE International Symposium on Mixed and Augmented Reality - Arts, Media, and Humanities (ISMAR-AMH '12), 105--106. https://doi.org/10.1109/ISMAR-AMH.2012.6484003",
      "doi": ""
    },
    {
      "text": "D M W Powers. 2011. Evaluation: From Precision, Recall and F-Measure To Roc, Informedness, Markedness & Correlation. Journal of Machine Learning Technologies ISSN 2, 1: 2229--3981.",
      "doi": ""
    },
    {
      "text": "D Selvianiresa and S Prabawanto. 2017. Contextual Teaching and Learning Approach of Mathematics in Primary Schools Contextual Teaching and Learning Approach of Mathematics in Primary Schools. International Conference on Mathematics and Science Education (ICMScE).",
      "doi": ""
    },
    {
      "text": "Iulian Radu and Blair Macintyre. 2012. Using Children ' s Developmental Psychology to Guide Augmented-Reality Design and Usability. IEEE International Symposium on Mixed and Augmented Reality 2012: 227--236. https://doi.org/10.1109/ISMAR.2012.6402561",
      "doi": "10.1109/ISMAR.2012.6402561"
    },
    {
      "text": "Ali Sharif Razavian, Hossein Azizpour, Josephine Sullivan, and Stefan Carlsson. 2014. CNN features off-the-shelf: An astounding baseline for recognition. IEEE Computer Society Conference on Computer Vision and Pattern Recognition Workshops: 512--519. https://doi.org/10.1109/CVPRW.2014.131",
      "doi": "10.1109/CVPRW.2014.131"
    },
    {
      "text": "Teresa Restivo, Fátima Chouzal, José Rodrigues, Paulo Menezes, and J. Bernardino Lopes. 2014. Augmented reality to improve STEM motivation. IEEE Global Engineering Education Conference, EDUCON, April: 803--806. https://doi.org/10.1109/EDUCON.2014.6826187",
      "doi": ""
    },
    {
      "text": "Bethany Rittle-Johnson and Kenneth R. Koedinger. 2005. Designing knowledge scaffolds to support mathematical problem solving. Cognition and Instruction 23, 3: 313--349. https://doi.org/10.1207/s1532690xci2303_1",
      "doi": ""
    },
    {
      "text": "Elisa Romano, Lyzon Babchishin, Linda S. Pagani, and Dafna Kohen. 2010. School readiness and later achievement: Replication and extension using a nationwide Canadian Survey. Developmental Psychology 46, 5: 995--1007. https://doi.org/10.1037/a0018880",
      "doi": ""
    },
    {
      "text": "Geoffrey B Saxe. 2015. Culture and cognitive development: Studies in mathematical understanding. Psychology Press.",
      "doi": ""
    },
    {
      "text": "L L Scarlatos, S S Landy, J Breban, R Horowitz, and C Sandberg. 2002. On the Effectiveness of Tangible Interfaces in Collaborative Learning Environments.",
      "doi": ""
    },
    {
      "text": "Lori L. Scarlatos. 2006. Tangible math. Interactive Technology and Smart Education 3, 4: 293--309. https://doi.org/10.1108/17415650680000069",
      "doi": ""
    },
    {
      "text": "Bertrand Schneider, Paulo Blikstein, and Wendy Mackay. 2012. Combinatorix: Tangible user interface that supports collaborative learning of probabilities. ITS '12 Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces: 129--132. https://doi.org/10.1145/2396636.2396656",
      "doi": "10.1145/2396636.2396656"
    },
    {
      "text": "Douglas Schuler and Aki Namioka. 1993. Participatory design: Principles and practices. CRC Press.",
      "doi": "10.5555/563076"
    },
    {
      "text": "Kyoung-Hye Seo and Herbert P Ginsburg. 2004. What is developmentally appropriate in early childhood mathematics education? Lessons from new research. Engaging young children in mathematics: Standards for early childhood mathematics education: 91--104.",
      "doi": ""
    },
    {
      "text": "Kyohyun Song, Gunhee Kim, Inkyu Han, Jeongyoung Lee, Ji-Hyung Park, and Sungdo Ha. 2011. CheMO. Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems - CHI EA '11: 2305. https://doi.org/10.1145/1979742.1979907",
      "doi": ""
    },
    {
      "text": "Sharon Spall. 1998. Peer debriefing in qualitative research: Emerging operational models. Qualitative Inquiry 4, 2: 280--292. https://doi.org/10.1177/107780049800400208",
      "doi": ""
    },
    {
      "text": "Jennifer Suh and Patricia S Moyer. 2007. Developing students' representational fluency using virtual and physical algebra balances. Journal of Computers in Mathematics and Science Teaching 26: 155.",
      "doi": ""
    },
    {
      "text": "Satoshi Suzuki and Keiichi A. be. 1985. Topological structural analysis of digitized binary images by border following. Computer Vision, Graphics and Image Processing 30, 1: 32--46. https://doi.org/10.1016/0734--189X(85)90016--7",
      "doi": ""
    },
    {
      "text": "The United States Department of Education. 2016. STEM 2026: A Vision for Innovation in STEM Education. U.S. Department of Education Workshop: 55. Retrieved from https://innovation.ed.gov/files/2016/09/AIR-STEM2026_Report_2016.pdf",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2019. Unity3D.",
      "doi": ""
    },
    {
      "text": "David H. Uttal and Kathyrn V. Scudder. 1997. Manipulatives as Symbols?: A New Perspective on the Use of Concrete Objects to Teach Mathematics. Journal of applied developmental psychology: 37--54.",
      "doi": ""
    },
    {
      "text": "Anita A. Wager and Amy Noelle Parks. 2018. Through Play Through Play. March: 31--36.",
      "doi": ""
    },
    {
      "text": "David Wheeler. 1982. Mathematization Matters. For the Learning of Mathematics 3, 1: 45--47.",
      "doi": ""
    },
    {
      "text": "Wanty Widjaja. 2013. the Use of Contextual Problems To Support. IndoMS-JME 4, 2: 151--159.",
      "doi": ""
    },
    {
      "text": "Monica Wijers, Vincent Jonker, and Paul Drijvers. 2010. MobileMath: Exploring mathematics outside the classroom. ZDM - International Journal on Mathematics Education 42, 7: 789--799. https://doi.org/10.1007/s11858-010-0276--3",
      "doi": ""
    },
    {
      "text": "Terri L Woods, Sarah Reed, Sherry Hsi, John A Woods, and Michael R Woods. 2016. Pilot study using the augmented reality sandbox to teach topographic maps and surficial processes in introductory geology labs. Journal of Geoscience Education 64, 3: 199--214.",
      "doi": ""
    },
    {
      "text": "Hsin-kai Wu, Silvia Wen-yu Lee, Hsin-yi Chang, and Jyh-chong Liang. 2013. Current status, opportunities and challenges of augmented reality in education. Computers & Education 62: 41--49. https://doi.org/10.1016/j.compedu.2012.10.024",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofana, Justin Park, and Alexis Hiniker. 2019. Laughing is scary, but farting is cute a conceptual model of children's perspectives of creepy technologies. Conference on Human Factors in Computing Systems - Proceedings: 1--15. https://doi.org/10.1145/3290605.3300303",
      "doi": ""
    },
    {
      "text": "2018. OpenCVSharp. Retrieved from https://github.com/shimat/opencvsharp",
      "doi": ""
    }
  ]
}