{
  "doi": "10.1145/3313831.3376782",
  "title": "InChorus: Designing Consistent Multimodal Interactions for Data Visualization on Tablet Devices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "While tablet devices are a promising platform for data visualization, supporting consistent interactions across different types of visualizations on tablets remains an open challenge. In this paper, we present multimodal interactions that function consistently across different visualizations, supporting common operations during visual data analysis. By considering standard interface elements (e.g., axes, marks) and grounding our design in a set of core concepts including operations, parameters, targets, and instruments, we systematically develop interactions applicable to different visualization types. To exemplify how the proposed interactions collectively facilitate data exploration, we employ them in a tablet-based system, InChorus that supports pen, touch, and speech input. Based on a study with 12 participants performing replication and factchecking tasks with InChorus, we discuss how participants adapted to using multimodal input and highlight considerations for future multimodal visualization systems.",
  "authors": [
    {
      "name": "Arjun Srinivasan",
      "institution": "Microsoft Research & Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196818",
      "orcid": "0000-0001-8901-1256"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Nathalie Henry Riche",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502798938",
      "orcid": "missing"
    },
    {
      "name": "Steven M. Drucker",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090466",
      "orcid": "0000-0002-5022-9343"
    },
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    }
  ],
  "references": [
    {
      "text": "Jillian Aurisano, Abhinav Kumar, Alberto Gonzalez, Jason Leigh, Barbara DiEugenio, and Andrew Johnson. 2016. Articulate2: Toward a conversational interface for visual data exploration. In Posters of IEEE VIS '16.",
      "doi": ""
    },
    {
      "text": "Dominikus Baur, Bongshin Lee, and Sheelagh Carpendale. 2012. TouchWave: kinetic multi-touch manipulation for hierarchical stacked graphs. In Proceedings of ACM ITS '12. 255--264.",
      "doi": "10.1145/2396636.2396675"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental interaction: an interaction model for designing post-WIMP user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 446--453.",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Richard A Bolt. 1980. \"Put-that-there\": Voice and gesture at the graphics interface. SIGGRAPH Comput. Graph. 14, 3 (July 1980), 262--270. DOI: http://dx.doi.org/10.1145/965105.807503",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 data-driven documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2301--2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Jeffrey Browne, Bongshin Lee, Sheelagh Carpendale, Nathalie Riche, and Timothy Sherwood. 2011. Data analysis on interactive whiteboards through sketch-based interaction. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces. ACM, 154--157.",
      "doi": "10.1145/2076354.2076383"
    },
    {
      "text": "Philip R Cohen, Michael Johnston, David McGee, Sharon Oviatt, Jay Pittman, Ira Smith, Liang Chen, and Josh Clow. 1997. QuickSet: Multimodal interaction for simulation set-up and control. In Proceedings of the ACL Conference on Applied Natural Language Processing '97. 20--24.",
      "doi": "10.3115/974557.974562"
    },
    {
      "text": "Kenneth Cox, Rebecca E Grinter, Stacie L Hibino, Lalita Jategaonkar Jagadeesan, and David Mantilla. 2001. A multi-modal natural language interface to an information visualization environment. International Journal of Speech Technology 4, 3--4 (2001), 297--314.",
      "doi": ""
    },
    {
      "text": "Steven M Drucker, Danyel Fisher, Ramik Sadana, Jessica Herron, and m.c. schraefel. 2013. TouchViz: a case study comparing two interfaces for data analytics on tablets. In Proceedings of ACM CHI '13. 2301--2310.",
      "doi": "10.1145/2470654.2481318"
    },
    {
      "text": "Niklas Elmqvist, Andrew Vande Moere, Hans-Christian Jetter, Daniel Cernea, Harald Reiterer, and TJ Jankun-Kelly. 2011. Fluid interaction for information visualization. Information Visualization 10, 4 (2011), 327--340.",
      "doi": "10.1177/1473871611413180"
    },
    {
      "text": "Mathias Frisch, Jens Heydekorn, and Raimund Dachselt. 2009. Investigating multi-touch and pen gestures for diagram editing on interactive surfaces. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces. ACM, 149--156.",
      "doi": "10.1145/1731903.1731933"
    },
    {
      "text": "Anushay Furqan, Chelsea Myers, and Jichen Zhu. 2017. Learnability through adaptive discovery tools in voice user interfaces. In ACM CHI '17 Extended Abstracts. 1617--1623.",
      "doi": "10.1145/3027063.3053166"
    },
    {
      "text": "Tong Gao, Mira Dontcheva, Eytan Adar, Zhicheng Liu, and Karrie G Karahalios. 2015. Datatone: Managing ambiguity in natural language interfaces for data visualization. In Proceedings of ACM UIST '15. 489--500.",
      "doi": "10.1145/2807442.2807478"
    },
    {
      "text": "Jeffrey Heer, Maneesh Agrawala, and Wesley Willett. 2008. Generalized selection via interactive query relaxation. In Proceedings of ACM CHI '08. 959--968.",
      "doi": "10.1145/1357054.1357203"
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive dynamics for visual analysis. Queue 10, 2 (2012), 30.",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddington, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko, and Bill Buxton. 2010. Pen+ touch= new tools. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 27--36.",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Enamul Hoque, Vidya Setlur, Melanie Tory, and Isaac Dykeman. 2018. Applying pragmatics principles for interaction with visual analytics. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 309--318.",
      "doi": ""
    },
    {
      "text": "Petra Isenberg and Danyel Fisher. 2009. Collaborative Brushing and Linking for Co-located Visual Analytics of Document Collections. In Computer Graphics Forum, Vol. 28. Wiley Online Library, 1031--1038.",
      "doi": ""
    },
    {
      "text": "Jaemin Jo, Bongshin Lee, and Jinwook Seo. 2015. WordlePlus: expanding wordle's use through natural interaction and animation. IEEE computer graphics and applications 35, 6 (2015), 20--28.",
      "doi": ""
    },
    {
      "text": "Jaemin Jo, Sehi L'Yi, Bongshin Lee, and Jinwook Seo. 2017. TouchPivot: blending WIMP & post-WIMP interfaces for data exploration on tablet devices. In Proceedings of ACM CHI '17. 2660--2671.",
      "doi": "10.1145/3025453.3025752"
    },
    {
      "text": "Jan-Frederik Kassel and Michael Rohs. 2018. Valletto: A Multimodal Interface for Ubiquitous Visual Analytics. In ACM CHI '18 Extended Abstracts.",
      "doi": "10.1145/3170427.3188445"
    },
    {
      "text": "Nam Wook Kim, Nathalie Henry Riche, Benjamin Bach, Guanpeng Xu, Matthew Brehmer, Ken Hinckley, Michel Pahud, Haijun Xia, Michael J McGuffin, and Hanspeter Pfister. 2019a. DataToon: Drawing Dynamic Network Comics With Pen+ Touch Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 105.",
      "doi": "10.1145/3290605.3300335"
    },
    {
      "text": "Yea-Seul Kim, Nathalie Henry Riche, Bongshin Lee, Matthew Brehmer, Michel Pahud, Ken Hinckley, and Jessica Hullman. 2019b. Inking Your Insights: Investigating Digital Externalization Behaviors During Data Analysis. In Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces. ACM, 255--267.",
      "doi": "10.1145/3343055.3359714"
    },
    {
      "text": "Bongshin Lee, Petra Isenberg, Nathalie Henry Riche, and Sheelagh Carpendale. 2012. Beyond mouse and keyboard: Expanding design considerations for information visualization interactions. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2689--2698.",
      "doi": "10.1109/TVCG.2012.204"
    },
    {
      "text": "Bongshin Lee, Rubaiat Habib Kazi, and Greg Smith. 2013. SketchStory: Telling more engaging stories with data through freeform sketching. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2416--2425.",
      "doi": "10.1109/TVCG.2013.191"
    },
    {
      "text": "Bongshin Lee, Greg Smith, Nathalie Henry Riche, Amy Karlson, and Sheelagh Carpendale. 2015. SketchInsight: Natural data exploration on interactive whiteboards leveraging pen and touch interaction. In 2015 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 199--206.",
      "doi": ""
    },
    {
      "text": "Yang Li, Ken Hinckley, Ken Hinckley, Zhiwei Guan, and James A Landay. 2005. Experimental analysis of mode switching techniques in pen-based user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 461--470.",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Jean-Claude Martin. 1998. TYCOON: Theoretical framework and software tools for multimodal interfaces. Intelligence and Multimodality in Multimedia interfaces (1998), 1--25.",
      "doi": ""
    },
    {
      "text": "Jesse Mu and Advait Sarkar. 2019. Do We Need Natural Language?: Exploring Restricted Language Interfaces for Complex Domains.. In CHI Extended Abstracts.",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt. 1999. Ten myths of multimodal interaction. Commun. ACM 42, 11 (1999), 74--74.",
      "doi": "10.1145/319382.319398"
    },
    {
      "text": "Sharon Oviatt, Björn Schuller, Philip Cohen, Daniel Sonntag, and Gerasimos Potamianos. 2017. The Handbook of Multimodal-Multisensor Interfaces, Volume 1: Foundations, User Modeling, and Common Modality Combinations. Morgan & Claypool. 403--448 pages.",
      "doi": ""
    },
    {
      "text": "J Raskin. 2000. Meanings, modes, monotony, and myths. In The humane interface: new directions for designing interactive systems. Addison-Wesley, 33--70.",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts, Panagiotis D Ritsos, Sriram Karthik Badam, Dominique Brodbeck, Jessie Kennedy, and Niklas Elmqvist. 2014. Visualization beyond the desktop--the next big thing. IEEE Computer Graphics and Applications 34, 6 (2014), 26--34.",
      "doi": ""
    },
    {
      "text": "Hugo Romat, Nathalie Henry Riche, Ken Hinckley, Bongshin Lee, Caroline Appert, Emmanuel Pietriga, and Christopher Collins. 2019. Activeink:(th) inking with data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 42.",
      "doi": "10.1145/3290605.3300272"
    },
    {
      "text": "Jeffrey M Rzeszotarski and Aniket Kittur. 2014. Kinetica: naturalistic multi-touch data visualization. In Proceedings of ACM CHI '14. 897--906.",
      "doi": "10.1145/2556288.2557231"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2014. Designing and implementing an interactive scatterplot visualization for a tablet computer. In Proceedings of AVI '14. 265--272.",
      "doi": "10.1145/2598153.2598163"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2016a. Designing multiple coordinated visualizations for tablets. In Computer Graphics Forum, Vol. 35. 261--270.",
      "doi": "10.5555/3071534.3071563"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2016b. Expanding selection for information visualization systems on tablet devices. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces. ACM, 149--158.",
      "doi": "10.1145/2992154.2992157"
    },
    {
      "text": "Sebastian Schmidt, Miguel A Nacenta, Raimund Dachselt, and Sheelagh Carpendale. 2010. A set of multi-touch graph interaction techniques. In ACM International Conference on Interactive Tabletops and Surfaces. ACM, 113--116.",
      "doi": "10.1145/1936652.1936673"
    },
    {
      "text": "Vidya Setlur, Sarah E Battersby, Melanie Tory, Rich Gossweiler, and Angel X Chang. 2016. Eviza: A natural language interface for visual analysis. In Proceedings of ACM UIST '16. 365--377.",
      "doi": "10.1145/2984511.2984588"
    },
    {
      "text": "Vidya Setlur, Melanie Tory, and Alex Djalali. 2019. Inferencing underspecified natural language utterances in visual analysis.. In Proceedings of ACM IUI '19. 40--51.",
      "doi": "10.1145/3301275.3302270"
    },
    {
      "text": "Arjun Srinivasan, Mira Dontcheva, Eytan Adar, and Seth Walker. 2019. Discovering Natural Language Commands in Multimodal Interfaces. In Proceedings of ACM IUI '19. 661--672.",
      "doi": "10.1145/3301275.3302292"
    },
    {
      "text": "Arjun Srinivasan and John Stasko. 2018. Orko: Facilitating multimodal interaction for visual exploration and analysis of networks. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 511--521.",
      "doi": ""
    },
    {
      "text": "Hariharan Subramonyam and Eytan Adar. 2018. SmartCues: A Multitouch Query Approach for Details-on-Demand through Dynamically Computed Overlays. IEEE transactions on visualization and computer graphics 25, 1 (2018), 597--607.",
      "doi": ""
    },
    {
      "text": "Yiwen Sun, Jason Leigh, Andrew Johnson, and Sangyoon Lee. 2010. Articulate: A semi-automated model for translating natural language queries into meaningful visualizations. In Proceedings of the International Symposium on Smart Graphics. Springer, 184--195.",
      "doi": ""
    },
    {
      "text": "John Thompson, Arjun Srinivasan, and John Stasko. 2018. Tangraphe: interactive exploration of network visualizations using single hand, multi-touch gestures. In Proceedings of AVI '18.",
      "doi": "10.1145/3206505.3206519"
    },
    {
      "text": "Andries Van Dam. 1997. Post-WIMP user interfaces. Commun. ACM 40, 2 (1997), 63--67.",
      "doi": "10.1145/253671.253708"
    },
    {
      "text": "Minh Tue Vo and Alex Waibel. 1993. Multimodal human-computer interaction. Proceedings of ISSD 93 (1993).",
      "doi": ""
    },
    {
      "text": "Jagoda Walny, Bongshin Lee, Paul Johns, Nathalie Henry Riche, and Sheelagh Carpendale. 2012. Understanding pen and touch interaction for data exploration on interactive whiteboards. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2779--2788.",
      "doi": "10.1109/TVCG.2012.275"
    },
    {
      "text": "Web Speech API 2019. https://developer.mozilla.org/ en-US/docs/Web/API/Web_Speech_API. (2019).",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Nathalie Henry Riche, Fanny Chevalier, Bruno De Araujo, and Daniel Wigdor. 2018. DataInk: Direct and creative data-oriented drawing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 223.",
      "doi": "10.1145/3173574.3173797"
    },
    {
      "text": "Ji Soo Yi, Youn ah Kang, and John Stasko. 2007. Toward a deeper understanding of the role of interaction in information visualization. IEEE Transactions on Visualization and Computer Graphics 13, 6 (2007), 1224--1231.",
      "doi": "10.1109/TVCG.2007.70515"
    },
    {
      "text": "Bowen Yu and Cláudio T Silva. 2019. FlowSense: A Natural Language Interface for Visual Data Exploration within a Dataflow System. IEEE transactions on visualization and computer graphics (2019).",
      "doi": ""
    },
    {
      "text": "Emanuel Zgraggen, Robert Zeleznik, and Steven M Drucker. 2014. PanoramicData: Data analysis through pen & touch. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2112--2121.",
      "doi": ""
    }
  ]
}