{
  "doi": "10.1145/3313831.3376350",
  "title": "A Comparison of Geographical Propagation Visualizations",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Geographical propagation phenomena occur in multiple domains, such as in epidemiology and social media. Propagation dynamics are often complex, and visualizations play a key role in helping subject-matter experts understand and analyze them. However, there is little empirical data about the effectiveness of the various strategies used to visualize geographical propagation. To fill this gap, we conduct an experiment to evaluate the effectiveness of three strategies: an animated map, small-multiple maps, and a single map with glyphs. We compare them under five tasks that vary in one of the following dimensions: propagation scope, direction, speed, peaks, and spatial jumps. Our results show that small-multiple maps perform best overall, but that the effectiveness of each visualization varies depending on the task considered.",
  "authors": [
    {
      "name": "Vanessa Peña-Araya",
      "institution": "Université Paris-Saclay, CNRS, Inria, LRI, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658740789",
      "orcid": "missing"
    },
    {
      "name": "Anastasia Bezerianos",
      "institution": "Université Paris-Saclay, CNRS, Inria, LRI, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659165855",
      "orcid": "0000-0002-7142-2548"
    },
    {
      "name": "Emmanuel Pietriga",
      "institution": "Université Paris-Saclay, CNRS, Inria, LRI, Orsay, France",
      "img": "/do/10.1145/contrib-81100222004/rel-imgonly/id2013.jpg",
      "acmid": "81100222004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "G. Andrienko, N. Andrienko, G. Fuchs, and J. M. C. Garcia. 2018. Clustering Trajectories by Relevant Parts for Air Traffic Analysis. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan 2018), 34--44. DOI: http://dx.doi.org/10.1109/TVCG.2017.2744322",
      "doi": ""
    },
    {
      "text": "Gennady Andrienko, Natalia Andrienko, and Marco Heurich. 2011. An event-based conceptual model for context-aware movement analysis. International Journal of Geographical Information Science 25, 9 (2011), 1347--1370. DOI: http://dx.doi.org/10.1080/13658816.2011.556120",
      "doi": "10.1080/13658816.2011.556120"
    },
    {
      "text": "Gennady Andrienko, Natalia Andrienko, Heidrun Schumann, and Christian Tominski. 2014. Visualization of Trajectory Attributes in Space--Time Cube and Trajectory Wall. Springer Berlin Heidelberg, Berlin, Heidelberg, 157--163. DOI: http://dx.doi.org/10.1007/978--3--642--32618--9_11",
      "doi": ""
    },
    {
      "text": "Natalia Andrienko and Gennady Andrienko. 2013. Visual analytics of movement: An overview of methods, tools and procedures. Information Visualization 12, 1 (2013), 3--24. DOI: http://dx.doi.org/10.1177/1473871612457601",
      "doi": "10.1177/1473871612457601"
    },
    {
      "text": "Daniel Archambault, Helen Purchase, and Bruno Pinaud. 2010. Animation, small multiples, and the effect of mental map preservation in dynamic graphs. IEEE Transactions on Visualization and Computer Graphics 17, 4 (2010), 539--552. DOI: http://dx.doi.org/10.1109/TVCG.2010.78",
      "doi": "10.1109/TVCG.2010.78"
    },
    {
      "text": "Benjamin Bach, Emmanuel Pietriga, and Jean-Daniel Fekete. 2014. GraphDiaries: Animated Transitions and Temporal Navigation for Dynamic Networks. IEEE Transactions on Visualization and Computer Graphics 20, 5 (May 2014), 740--754. DOI: http://dx.doi.org/10.1109/TVCG.2013.254",
      "doi": "10.1109/TVCG.2013.254"
    },
    {
      "text": "Duygu Balcan, Vittoria Colizza, Bruno Gonçalves, Hao Hu, José J. Ramasco, and Alessandro Vespignani. 2009. Multiscale mobility networks and the spatial spreading of infectious diseases. Proceedings of the National Academy of Sciences 106, 51 (2009), 21484--21489. DOI: http://dx.doi.org/10.1073/pnas.0906910106",
      "doi": ""
    },
    {
      "text": "Roger Beecham, Jason Dykes, Wouter Meulemans, Aidan Slingsby, Cagatay Turkay, and Jo Wood. 2017. Map LineUps: Effects of spatial structure on graphical inference. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 391--400. DOI: http://dx.doi.org/10.1109/TVCG.2016.2598862",
      "doi": "10.1109/TVCG.2016.2598862"
    },
    {
      "text": "Julio A. Benavides, William Valderrama, and Daniel G. Streicker. 2016. Spatial expansions and travelling waves of rabies in vampire bats. Proceedings of the Royal Society B: Biological Sciences 283, 1832 (2016), 20160328. DOI: http://dx.doi.org/10.1098/rspb.2016.0328",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301--2309. DOI: http://dx.doi.org/10.1109/TVCG.2011.185",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Ilya Boyandin, Enrico Bertini, and Denis Lalanne. 2012. A Qualitative Study on the Exploration of Temporal Changes in Flow Maps with Animation and Small-Multiples. Computer Graphics Forum 31, 3pt2 (2012), 1005--1014. DOI: http://dx.doi.org/10.1111/j.1467--8659.2012.03093.x",
      "doi": ""
    },
    {
      "text": "M. Brehmer, B. Lee, P. Isenberg, and E. K. Choe. 2020. A Comparative Evaluation of Animation and Small Multiples for Trend Visualization on Mobile Phones. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan 2020), 364--374. DOI: http://dx.doi.org/10.1109/TVCG.2019.2934397",
      "doi": ""
    },
    {
      "text": "J. Buchmüller, D. Jäckle, E. Cakmak, U. Brandes, and D. A. Keim. 2019. MotionRugs: Visualizing Collective Trends in Space and Time. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 76--86. DOI: http://dx.doi.org/10.1109/TVCG.2018.2865049",
      "doi": "10.1109/TVCG.2018.2865049"
    },
    {
      "text": "N. Cao, Y. Lin, X. Sun, D. Lazer, S. Liu, and H. Qu. 2012. Whisper: Tracing the Spatiotemporal Process of Information Diffusion in Real Time. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec 2012), 2649--2658. DOI: http://dx.doi.org/10.1109/TVCG.2012.291",
      "doi": ""
    },
    {
      "text": "Segolene Charaudeau, Khashayar Pakdaman, and Pierre-Yves Boëlle. 2014. Commuter Mobility and the Spread of Infectious Diseases: Application to Influenza in France. PLOS ONE 9, 1 (01 2014), 1--9. DOI: http://dx.doi.org/10.1371/journal.pone.0083002",
      "doi": ""
    },
    {
      "text": "S. Chen, X. Yuan, Z. Wang, C. Guo, J. Liang, Z. Wang, X. Zhang, and J. Zhang. 2016. Interactive Visual Discovering of Movement Patterns from Sparsely Sampled Geo-tagged Social Media Data. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 270--279. DOI: http://dx.doi.org/10.1109/TVCG.2015.2467619",
      "doi": "10.1109/TVCG.2015.2467619"
    },
    {
      "text": "G. Christakos, R.A. Olea, and H.-L. Yu. 2007. Recent results on the spatiotemporal modelling and comparative analysis of Black Death and bubonic plague epidemics. Public Health 121, 9 (2007), 700 -- 720. DOI: http://dx.doi.org/10.1016/j.puhe.2006.12.011",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. HARK No More: On the Preregistration of CHI Experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, Article 141, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173715",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "P. Craig, N. R. Seïler, and A. D. O. Cervantes. 2014. Animated Geo-temporal Clusters for Exploratory Search in Event Data Document Collections. In 2014 18th International Conference on Information Visualisation. 157--163. DOI: http://dx.doi.org/10.1109/IV.2014.69",
      "doi": ""
    },
    {
      "text": "Geoff Cumming. 2014. The New Statistics: Why and How. Psychological Science 25, 1 (2014), 7--29. DOI: http://dx.doi.org/10.1177/0956797613504966",
      "doi": ""
    },
    {
      "text": "Z. Deng, D. Weng, J. Chen, R. Liu, Z. Wang, J. Bao, Y. Zheng, and Y. Wu. 2020. AirVis: Visual Analytics of Air Pollution Propagation. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan 2020), 800--810. DOI: http://dx.doi.org/10.1109/TVCG.2019.2934670",
      "doi": ""
    },
    {
      "text": "Doantam Phan, Ling Xiao, R. Yeh, and P. Hanrahan. 2005. Flow map layout. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. 219--224. DOI: http://dx.doi.org/10.1109/INFVIS.2005.1532150",
      "doi": ""
    },
    {
      "text": "Simon Dobson. 2017--2018. epydemic: Epidemic simulations on networks in Python. https://github.com/simoninireland/epydemic. (2017--2018).",
      "doi": ""
    },
    {
      "text": "Somayeh Dodge, Robert Weibel, and Anna-Katharina Lautenschütz. 2008. Towards a taxonomy of movement patterns. Information visualization 7, 3--4 (2008), 240--252. DOI: http://dx.doi.org/10.1057/PALGRAVE.IVS.9500182",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair statistical communication in HCI. In Modern Statistical Methods for HCI, Judy Robertson and Maurits Kaptein (Eds.). Springer International Publishing, Chapter 13, 291--330. DOI: http://dx.doi.org/10.1007/978--3--319--26633--6_13",
      "doi": ""
    },
    {
      "text": "Gytis Dudas, Luiz Max Carvalho, ..., and Andrew Rambaut. 2017. Virus genomes reveal factors that spread and sustained the Ebola epidemic. Nature 544, 7650 (2017), 309. DOI: http://dx.doi.org/10.1038/nature22040",
      "doi": ""
    },
    {
      "text": "Alexander Dunkel, Gennady Andrienko, Natalia Andrienko, Dirk Burghardt, Eva Hauthal, and Ross Purves. 2019. A conceptual framework for studying collective reactions to events in location-based social media. International Journal of Geographical Information Science 33, 4 (2019), 780--804. DOI: http://dx.doi.org/10.1080/13658816.2018.1546390",
      "doi": ""
    },
    {
      "text": "Jacob Eisenstein, Brendan T. O'Connor, Noah A. Smith, and Eric P. Xing. 2014. Diffusion of Lexical Change in Social Media. In PloS one. DOI: http://dx.doi.org/10.1371/journal.pone.0113114",
      "doi": ""
    },
    {
      "text": "Daniel T. Gillespie. 1977. Exact stochastic simulation of coupled chemical reactions. The Journal of Physical Chemistry 81, 25 (1977), 2340--2361. DOI: http://dx.doi.org/10.1021/j100540a008",
      "doi": ""
    },
    {
      "text": "Graells-Garrido, Eduardo, Caro, Diego, and Parra, Denis. 2018. Inferring modes of transportation using mobile phone data. EPJ Data Sci. 7, 1 (2018), 49. DOI: http://dx.doi.org/10.1140/epjds/s13688-018-0177--1",
      "doi": ""
    },
    {
      "text": "Amy L Griffin, Alan M MacEachren, Frank Hardisty, Erik Steiner, and Bonan Li. 2006. A comparison of animated maps with static small-multiple maps for visually identifying space-time clusters. Annals of the Association of American Geographers 96, 4 (2006), 740--753. DOI: http://dx.doi.org/10.1111/j.1467--8306.2006.00514.x",
      "doi": ""
    },
    {
      "text": "Joachim Gudmundsson, Patrick Laube, and Thomas Wolle. 2008. Movement Patterns in Spatio-Temporal Data. In Encyclopedia of GIS. DOI: http://dx.doi.org/10.1007/978--3--319--17885--1_823",
      "doi": ""
    },
    {
      "text": "Aric A. Hagberg, Daniel A. Schult, and Pieter J. Swart. 2008. Exploring Network Structure, Dynamics, and Function using NetworkX. http://conference.scipy. org/proceedings/SciPy2008/paper_2/. In Proceedings of the 7th Python in Science Conference. 11 -- 15.",
      "doi": ""
    },
    {
      "text": "Mark Harrower and Sara Fabrikant. 2008. The Role of Map Animation for Geographic Visualization. John Wiley & Sons, Ltd, 49--65. DOI: http://dx.doi.org/10.1002/9780470987643.ch4",
      "doi": ""
    },
    {
      "text": "Krishna Y Kamath, James Caverlee, Kyumin Lee, and Zhiyuan Cheng. 2013. Spatio-temporal dynamics of online memes: a study of geo-tagged tweets. In Proceedings of the 22nd international conference on World Wide Web. ACM, 667--678. DOI: http://dx.doi.org/10.1145/2488388.2488447",
      "doi": "10.1145/2488388.2488447"
    },
    {
      "text": "William Ogilvy Kermack and Anderson G McKendrick. 1927. A contribution to the mathematical theory of epidemics. Proceedings of the royal society of london. Series A, Containing papers of a mathematical and physical character 115, 772 (1927), 700--721. DOI: http://dx.doi.org/10.1098/rspa.1927.0118",
      "doi": ""
    },
    {
      "text": "Sungye Kim, Ross Maciejewski, Abish Malik, Yun Jang, David S Ebert, and Tobias Isenberg. 2013. Bristle Maps: a multivariate abstraction technique for geovisualization. IEEE Transactions on Visualization and Computer Graphics 19, 9 (Sept. 2013), 1438--1454. DOI: http://dx.doi.org/10.1109/TVCG.2013.66",
      "doi": "10.1109/TVCG.2013.66"
    },
    {
      "text": "Andreas Kjellin, Lars Winkler Pettersson, Stefan Seipel, and Mats Lind. 2010. Different Levels of 3D: An Evaluation of Visualized Discrete Spatiotemporal Data in Space-Time Cubes. Information Visualization 9, 2 (2010), 152--164. DOI: http://dx.doi.org/10.1057/ivs.2009.8",
      "doi": "10.1145/1890886.1890891"
    },
    {
      "text": "A. Koussoulakou and M.J. Kraak. 1992. Spatia-temporal maps and cartographic communication. The Cartographic Journal 29, 2 (1992), 101--108. DOI: http://dx.doi.org/10.1179/000870492787859745",
      "doi": ""
    },
    {
      "text": "Menno-Jan Kraak. 2003. The space-time cube revisited from a geovisualization perspective. In Proceedings of the 21st International Cartographic Conference (ICC). 1988--1996.",
      "doi": ""
    },
    {
      "text": "John C Lang, Hans De Sterck, Jamieson L Kaiser, and Joel C Miller. 2018. Analytic models for SIR disease spread on random spatial networks. Journal of Complex Networks 6, 6 (03 2018), 948--970. DOI: http://dx.doi.org/10.1093/comnet/cny004",
      "doi": ""
    },
    {
      "text": "X. Liang, R. Aggarwal, A. Cherif, A. Gumel, G. Mascaro, and R. Maciejewski. 2016. Visualizing Malaria Spread Under Climate Variability. In Proceedings of the Workshop on Visualisation in Environmental Sciences (EnvirVis '16). Eurographics Association, Goslar Germany, Germany, 29--33. DOI: http://dx.doi.org/10.2312/envirvis.20161104",
      "doi": ""
    },
    {
      "text": "Mark A Livingston and Jonathan W Decker. 2011. Evaluation of trend localization with multi-variate visualizations. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2053--2062. DOI: http://dx.doi.org/10.1109/TVCG.2011.194",
      "doi": "10.1109/TVCG.2011.194"
    },
    {
      "text": "Amy Lobben. 2008. Influence of Data Properties on Animated Maps. Annals of the Association of American Geographers 98, 3 (2008), 583--603. DOI: http://dx.doi.org/10.1080/00045600802046577",
      "doi": ""
    },
    {
      "text": "María-Jesús Lobo, Caroline Appert, and Emmanuel Pietriga. 2019. Animation Plans for Before-and-After Satellite Images. IEEE Transactions on Visualization and Computer Graphics (TVCG) 25, 2 (Feb 2019), 1347--1360. DOI: http://dx.doi.org/10.1109/TVCG.2018.2796557",
      "doi": ""
    },
    {
      "text": "Ross Maciejewski, Philip Livengood, Stephen Rudolph, Timothy F. Collins, David S. Ebert, Robert T. Brigantic, Courtney D. Corley, George A. Muller, and Stephen W. Sanders. 2011. A pandemic influenza modeling and visualization tool. Journal of Visual Languages & Computing 22, 4 (2011), 268 -- 278. DOI: http://dx.doi.org/10.1016/j.jvlc.2011.04.002",
      "doi": "10.1016/j.jvlc.2011.04.002"
    },
    {
      "text": "Seth A. Marvel, Travis Martin, Charles R. Doering, David Lusseau, and M. E. J. Newman. 2013. The small-world effect is a modern phenomenon. https://arxiv.org/abs/1310.2636, arXiv e-prints (Oct 2013), arXiv:1310.2636.",
      "doi": ""
    },
    {
      "text": "Naoki Masuda, Hiroyoshi Miwa, and Norio Konno. 2005. Geographical threshold graphs with small-world and scale-free properties. Phys. Rev. E 71 (Mar 2005), 036108. Issue 3. DOI: http://dx.doi.org/10.1103/PhysRevE.71.036108",
      "doi": ""
    },
    {
      "text": "Wouter Meulemans, Jason Dykes, Aidan Slingsby, Cagatay Turkay, and Jo Wood. 2017. Small Multiples with Gaps. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 381--390. DOI: http://dx.doi.org/10.1109/TVCG.2016.2598542",
      "doi": "10.1109/TVCG.2016.2598542"
    },
    {
      "text": "Mark EJ Newman. 2002. Spread of epidemic disease on networks. Physical review E 66, 1 (2002), 016128. DOI: http://dx.doi.org/10.1103/PhysRevE.66.016128",
      "doi": ""
    },
    {
      "text": "S. Nusrat, M. J. Alam, and S. Kobourov. 2018a. Evaluating Cartogram Effectiveness. IEEE Transactions on Visualization and Computer Graphics 24, 2 (Feb 2018), 1077--1090. DOI: http://dx.doi.org/10.1109/TVCG.2016.2642109",
      "doi": ""
    },
    {
      "text": "Sabrina Nusrat, Muhammad Jawaherul Alam, Carlos Scheidegger, and Stephen Kobourov. 2018b. Cartogram Visualization for Bivariate Geo-Statistical Data. IEEE Transactions on Visualization and Computer Graphics 24, 10 (Oct. 2018), 2675--2688. DOI: http://dx.doi.org/10.1109/TVCG.2017.2765330",
      "doi": "10.1109/TVCG.2017.2765330"
    },
    {
      "text": "WorldHealth Organization. 2019. Ebola Virus Disease. https://www.who.int/en/news-room/fact-sheets/detail/ebola-virus-disease. (2019). Last accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Christine Parent, Stefano Spaccapietra, Chiara Renso, Gennady Andrienko, Natalia Andrienko, Vania Bogorny, Maria Luisa Damiani, Aris Gkoulalas-Divanis, Jose Macedo, Nikos Pelekis, Yannis Theodoridis, and Zhixian Yan. 2013. Semantic Trajectories Modeling and Analysis. ACM Comput. Surv. 45, 4, Article 42 (Aug. 2013), 32 pages. DOI: http://dx.doi.org/10.1145/2501654.2501656",
      "doi": ""
    },
    {
      "text": "V. Peña-Araya, E. Pietriga, and A. Bezerianos. 2019. A Comparison of Visualizations for Identifying Correlation over Space and Time. IEEE Transactions on Visualization and Computer Graphics (2019), 1--1. DOI: http://dx.doi.org/10.1109/TVCG.2019.2934807",
      "doi": ""
    },
    {
      "text": "Jonathan C. Roberts. 2007. State of the Art: Coordinated & Multiple Views in Exploratory Visualization. In Proceedings of the Fifth International Conference on Coordinated and Multiple Views in Exploratory Visualization (CMV '07). IEEE Computer Society, 61--71. DOI: http://dx.doi.org/10.1109/CMV.2007.20",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "George Robertson, Roland Fernandez, Danyel Fisher, Bongshin Lee, and John Stasko. 2008. Effectiveness of animation in trend visualization. IEEE transactions on visualization and computer graphics 14, 6 (2008), 1325--1332. DOI: http://dx.doi.org/10.1109/TVCG.2008.125",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Hugo Romat, Dylan Lebout, Emmanuel Pietriga, and Caroline Appert. 2019. Influence of Color and Size of Particles on Their Perceived Speed in Node-Link Diagrams. In Human-Computer Interaction -- INTERACT 2019. Springer International Publishing, Cham, 619--637. DOI: http://dx.doi.org/10.1007/978--3-030--29384-0_37",
      "doi": ""
    },
    {
      "text": "Terry A. Slocum, Robert S. Sluter, Fritz Connor Kessler, and Stephen C. Yoder. 2004. A qualitative evaluation of maptime, a program for exploring spatiotemporal point data. Cartographica 39, 3 (1 1 2004), 43--68. DOI: http://dx.doi.org/10.3138/92T3-T928--8105--88X7",
      "doi": ""
    },
    {
      "text": "Loes Soetens, Susan Hahné, and Jacco Wallinga. 2017. Dot map cartograms for detection of infectious disease outbreaks: an application to Q fever, the Netherlands and pertussis, Germany. Eurosurveillance 22, 26 (2017). DOI: http://dx.doi.org/10.2807/1560--7917.ES.2017.22.26.30562",
      "doi": ""
    },
    {
      "text": "D. A. Szafir. 2018. Modeling Color Difference for Visualization Design. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan 2018), 392--401. DOI: http://dx.doi.org/10.1109/TVCG.2017.2744359",
      "doi": ""
    },
    {
      "text": "Barbara Tversky, Julie Bauer Morrison, and Mireille Betrancourt. 2002. Animation: Can It Facilitate? Int. J. Hum.-Comput. Stud. 57, 4 (Oct. 2002), 247--262. DOI: http://dx.doi.org/10.1006/ijhc.2002.1017",
      "doi": "10.1006/ijhc.2002.1017"
    },
    {
      "text": "Cécile Viboud, Ottar N. Bjørnstad, David L. Smith, Lone Simonsen, Mark A. Miller, and Bryan T. Grenfell. 2006. Synchrony, Waves, and Spatial Hierarchies in the Spread of Influenza. Science 312, 5772 (2006), 447--451. DOI: http://dx.doi.org/10.1126/science.1125237",
      "doi": ""
    },
    {
      "text": "Javier Vidal-Mateo, Ugo Mellone, Pascual López-López, Javier De La Puente, Clara García-Ripollés, Ana Bermejo, and Vicente Urios. 2016. Wind effects on the migration routes of trans-Saharan soaring raptors: geographical, seasonal, and interspecific variation. Current Zoology 62, 2 (03 2016), 89--97. DOI: http://dx.doi.org/10.1093/cz/zow008",
      "doi": ""
    },
    {
      "text": "T. von Landesberger, F. Brodkorb, P. Roskosch, N. Andrienko, G. Andrienko, and A. Kerren. 2016. MobilityGraphs: Visual Analysis of Mass Mobility Dynamics via Spatio-Temporal Graphs and Clustering. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 11--20. DOI: http://dx.doi.org/10.1109/TVCG.2015.2468111",
      "doi": "10.1109/TVCG.2015.2468111"
    },
    {
      "text": "Z. Wang, M. Lu, X. Yuan, J. Zhang, and H. v. d. Wetering. 2013. Visual Traffic Jam Analysis Based on Trajectory Data. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2159--2168. DOI: http://dx.doi.org/10.1109/TVCG.2013.228",
      "doi": "10.1109/TVCG.2013.228"
    },
    {
      "text": "Jo Wood, Jason Dykes, and Aidan Slingsby. 2010. Visualisation of Origins, Destinations and Flows with OD Maps. The Cartographic Journal 47, 2 (2010), 117--129. DOI: http://dx.doi.org/10.1179/000870410X12658023467367",
      "doi": ""
    },
    {
      "text": "Y. Yang, T. Dwyer, S. Goodwin, and K. Marriott. 2017. Many-to-Many Geographically-Embedded Flow Visualisation: An Evaluation. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan 2017), 411--420. DOI: http://dx.doi.org/10.1109/TVCG.2016.2598885",
      "doi": ""
    }
  ]
}