{
  "doi": "10.1145/3313831.3376828",
  "title": "RunAhead: Exploring Head Scanning based Navigation for Runners",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Navigation systems for runners commonly provide turn-by-turn directions via voice and/or map-based visualizations. While voice directions require permanent attention, map-based guidance requires regular consultation. Both disrupt the running activity. To address this, we designed RunAhead, a navigation system using head scanning to query for navigation feedback, and we explored its suitability for runners in an outdoor experiment. In our design, we provide the runner with simple and intuitive navigation feedback on the path s/he is looking at through three different feedback modes: haptic, music and audio cues. In our experiment, we compare the resulting three versions of RunAhead with a baseline voice-based navigation system. We find that demand and error are equivalent across all four conditions. However, the head scanning based haptic and music conditions are preferred over the baseline and these preferences are impacted by runners' habits. With this study we contribute insights for designing navigation support for runners.",
  "authors": [
    {
      "name": "Danilo Gallo",
      "institution": "Naver Labs Europe, Grenoble, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441870",
      "orcid": "missing"
    },
    {
      "name": "Shreepriya Shreepriya",
      "institution": "Naver Labs Europe, Grenoble, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659442286",
      "orcid": "missing"
    },
    {
      "name": "Jutta Willamowski",
      "institution": "Naver Labs Europe, Grenoble, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100162667",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Running & Jogging - Statistics & Facts (18 October 2018). Retrieved September 9, 2019 from https://www.statista.com/topics/1743/runningand-jogging/.",
      "doi": ""
    },
    {
      "text": "RunAhead Audio Cues -- Positive Signal. Audio. https://drive.google.com/file/d/1U1gkz5qp0duSfMl_19HsXINQ1M0zdykQ/view?usp=sharing",
      "doi": ""
    },
    {
      "text": "RunAhead Audio Cues -- Negative Signal. Audio. https://drive.google.com/file/d/1c6FEaq80rnRzpmIFWmvsqV09Kiw3oXz2/view?usp=sharing",
      "doi": ""
    },
    {
      "text": "RunAhead Music -- Playlist. Audio. https://drive.google.com/file/d/1ub1hWiiWym2tfRmrkgx3sveF8rcwLw5Y/view?usp=sharing",
      "doi": ""
    },
    {
      "text": "RunAhead Warning Signal. Audio. https://drive.google.com/file/d/15ECsBADmbEdAanT9oy_CfBWEkfnpBemu/view?usp=sharing",
      "doi": ""
    },
    {
      "text": "Apple Maps. https://www.apple.com/ios/maps/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "ARVA. https://www.arva-equipment.com/en/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139-- 183.",
      "doi": ""
    },
    {
      "text": "John Brooke et al. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "RunGo App. https://www.rungoapp.com/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Smarthalo. https://www.smarthalo.bike/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Hammerhead4. https://www.hammerhead.io/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Arduino Board. https://store.arduino.cc/mkr-wifi1010/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Trail Running Headlight OnNight 710 Black and Orange 300 Lumens Kalenji. https://www.decathlon.fr/onnight-710-noire-etorange-id_8370255.html/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Processing. https://processing.org/. Accessed on September 9, 2019.",
      "doi": ""
    },
    {
      "text": "Teemu Tuomas Ahmaniemi and Vuokko Tuulikki Lantz. 2009. Augmented Reality Target Finding Based on Tactile Cues. In Proceedings of the 2009 International Conference on Multimodal Interfaces (ICMI-MLMI '09), 335--342. https://doi.org/10.1145/1647314.1647383",
      "doi": "10.1145/1647314.1647383"
    },
    {
      "text": "Robert Albrecht, Riitta Väänänen, and Tapio Lokki. 2016. Guided by Music: Pedestrian and Cyclist Navigation with Route and Beacon Guidance. Personal Ubiquitous Comput. 20, 1: 121--145. https://doi.org/10.1007/s00779-0160906-z",
      "doi": "10.1007/s00779-016-0906-z"
    },
    {
      "text": "Berardina De Carolis and Giuseppe Palestra. 2016. Gaze-based Interaction with a Shop Window. In Proceedings of the International Working Conference on Advanced Visual Interfaces - AVI '16, 304--305. https://doi.org/10.1145/2909132.2926080",
      "doi": "10.1145/2909132.2926080"
    },
    {
      "text": "Alois Ferscha, Bernadette Emsenhuber, Andreas Riener, Clemens Holzmann, Manfred Hechinger, and Dominik Hochreiter. 2008. Vibrotactile space-awareness. (2008).",
      "doi": ""
    },
    {
      "text": "Ioannis Giannopoulos, Peter Kiefer, and Martin Raubal. 2015. GazeNav: Gaze-Based Pedestrian Navigation. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15), 337--346. https://doi.org/10.1145/2785830.2785873",
      "doi": "10.1145/2785830.2785873"
    },
    {
      "text": "Simon Holland, David R. Morse, and Henrik Gedenryd. 2002. AudioGPS: Spatial Audio Navigation with a Minimal Attention Interface. Personal Ubiquitous Comput. 6, 4: 253--259. https://doi.org/10.1007/s007790200025",
      "doi": "10.1007/s007790200025"
    },
    {
      "text": "Antti Jylhä, Yi-Ta Hsieh, Valeria Orso, Salvatore Andolina, Luciano Gamberini, and Giulio Jacucci. 2015. A Wearable Multimodal Interface for Exploring Urban Points of Interest. In Proceedings of the 2015 ACM on International Conference on Multimodal Interaction (ICMI '15), 175--182. https://doi.org/10.1145/2818346.2820763",
      "doi": "10.1145/2818346.2820763"
    },
    {
      "text": "Francisco Kiss, Pawel W. Wozniak, Felix Scheerer, Julia Dominiak, Andrzej Romanowski, and Albrecht Schmidt. 2019. Clairbuoyance: Improving Directional Perception for Swimmers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--12. https://doi.org/10.1145/3290605.3300467",
      "doi": "10.1145/3290605.3300467"
    },
    {
      "text": "Andreas Komninos, Peter Barrie, Vassilios Stefanis, and Athanasios Plessas. 2012. Urban Exploration Using Audio Scents. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12), 349--358. https://doi.org/10.1145/2371574.2371629",
      "doi": "10.1145/2371574.2371629"
    },
    {
      "text": "Mats Liljedahl and Stefan Lindberg. 2011. Sound Parameters for Expressing Geographic Distance in a Mobile Navigation Application. In Proceedings of the 6th Audio Mostly Conference: A Conference on Interaction with Sound (AM '11), 1--7. https://doi.org/10.1145/2095667.2095668",
      "doi": "10.1145/2095667.2095668"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2019. NaviBike: Comparing Unimodal Navigation Cues for Child Cyclists. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--12. https://doi.org/10.1145/3290605.3300850",
      "doi": "10.1145/3290605.3300850"
    },
    {
      "text": "David McGookin, Stephen Brewster, and Pablo Priego. 2009. Audio Bubbles: Employing Nonspeech Audio to Support Tourist Wayfinding. In Haptic and Audio Interaction Design, M. Ercan Altinsoy, Ute Jekosch and Stephen Brewster (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 41--50. https://doi.org/10.1007/978--3642-04076--4_5",
      "doi": ""
    },
    {
      "text": "David K. McGookin and Stephen A. Brewster. 2013. Investigating and Supporting Undirected Navigation for Runners. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 1395--1400. https://doi.org/10.1145/2468356.2468605",
      "doi": ""
    },
    {
      "text": "Martin Pielot and Susanne Boll. 2010. Tactile Wayfinder: Comparison of Tactile Waypoint Navigation with Commercial Pedestrian Navigation Systems. In Proceedings of the 8th International Conference on Pervasive Computing (Pervasive'10), 76--93. https://doi.org/10.1007/978--3--642--12654--3_5",
      "doi": "10.1007/978-3-642-12654-3_5"
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2011. A Tactile Compass for Eyes-free Pedestrian Navigation. In Proceedings of the 13th IFIP TC 13 International Conference on Human-computer Interaction - Volume Part II (INTERACT'11), 640--656. Retrieved February 7, 2019 from http://dl.acm.org/citation.cfm?id=2042118.204217",
      "doi": "10.5555/2042118.2042179"
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2012. Tacticycle: supporting exploratory bicycle trips. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services MobileHCI '12, 369. https://doi.org/10.1145/2371574.2371631",
      "doi": "10.1145/2371574.2371631"
    },
    {
      "text": "Benjamin Poppinga, Martin Pielot, and Susanne Boll. 2009. Tacticycle: a tactile display for supporting tourists on a bicycle trip. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '09, 1. https://doi.org/10.1145/1613858.1613911",
      "doi": "10.1145/1613858.1613911"
    },
    {
      "text": "Raisamo, Roope, Tomi Nukarinen, Johannes Pystynen, Erno Mäkinen, and Johan Kildal. \"Orientation Inquiry: A New Haptic Interaction Technique for Non-Visual Pedestrian Navigation.\" In Haptics: Perception, Devices, Mobility, and Communication, edited by Poika Isokoski and Jukka Springare, 7283:139--44. Berlin, Heidelberg: Springer Berlin Heidelberg, 2012. https://doi.org/10.1007/978--3--642--31404--9_24.",
      "doi": ""
    },
    {
      "text": "Jussi Rantala, Jari Kangas, and Roope Raisamo. 2017. Directional Cueing of Gaze with a Vibrotactile Headband. In Proceedings of the 8th Augmented Human International Conference (AH '17), 7:1--7:7. https://doi.org/10.1145/3041164.3041176",
      "doi": "10.1145/3041164.3041176"
    },
    {
      "text": "Simon Robinson, Matt Jones, Parisa Eslambolchilar, Roderick Murray-Smith, and Mads Lindborg. 2010. \"I Did It My Way\": Moving Away from the Tyranny of Turn-by-turn Pedestrian Navigation. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10), 341--344. https://doi.org/10.1145/1851600.1851660",
      "doi": "10.1145/1851600.1851660"
    },
    {
      "text": "Maximilian Schirmer, Johannes Hartmann, Sven Bertel, and Florian Echtler. 2015. Shoe Me the Way: A Shoe-Based Tactile Interface for EyesFree Urban Navigation. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15), 327--336. https://doi.org/10.1145/2785830.2785832",
      "doi": "10.1145/2785830.2785832"
    },
    {
      "text": "Shreepriya Shreepriya, Danilo Gallo, Sruthi Viswanathan, and Jutta Willamowski. (2019). Situationally Induced Impairment in Navigation Support for Runners. In CHI'19 Workshop: Addressing the Challenges of Situationally Induced Impairments and Disabilities in Mobile Interaction. ArXiv, abs/1904.06131.",
      "doi": ""
    },
    {
      "text": "Shreepriya Shreepriya, Jutta Willamowski, and Danilo Gallo. 2019. Supporting Natural Navigation for Running in Unknown Places. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion - DIS '19 Companion, 277--281. https://doi.org/10.1145/3301019.3323895",
      "doi": ""
    },
    {
      "text": "Haska Steltenpohl and Anders Bouwer. 2013. Vibrobelt: Tactile Navigation Support for Cyclists. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13), 417--426. https://doi.org/10.1145/2449396.2449450",
      "doi": "10.1145/2449396.2449450"
    },
    {
      "text": "Steven Strachan, Parisa Eslambolchilar, Roderick Murray-Smith, Stephen Hughes, and Sile O'Modhrain. 2005. GpsTunes: Controlling Navigation via Audio Feedback. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices & Services (MobileHCI '05), 275--278. https://doi.org/10.1145/1085777.1085831",
      "doi": "10.1145/1085777.1085831"
    },
    {
      "text": "Hung-Yu Tseng, Rong-Hao Liang, Liwei Chan, and Bing-Yu Chen. 2015. LEaD: Utilizing Light Movement as Peripheral Visual Guidance for Scooter Navigation. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services MobileHCI '15, 323--326. https://doi.org/10.1145/2785830.2785831",
      "doi": "10.1145/2785830.2785831"
    },
    {
      "text": "Koji Tsukada and Michiaki Yasumura. 2004. Activebelt: Belt-type wearable tactile display for directional navigation. In International Conference on Ubiquitous Computing. Springer, 384--399. https://doi.org/10.1007/978--3--54030119--6_23",
      "doi": ""
    },
    {
      "text": "Nigel Warren, Matt Jones, Steve Jones, and David Bainbridge. 2005. Navigation via Continuously Adapted Music. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1849--1852. https://doi.org/10.1145/1056808.1057038",
      "doi": "10.1145/1056808.1057038"
    }
  ]
}