{
  "doi": "10.1145/3313831.3376822",
  "title": "Eyes on the Road: Detecting Phone Usage by Drivers Using On-Device Cameras",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Using a phone while driving is distracting and dangerous. It increases the accident chances by 400%. Several techniques have been proposed in the past to detect driver distraction due to phone usage. However, such techniques usually require instrumenting the user or the car with custom hardware. While detecting phone usage in the car can be done by using the phone's GPS, it is harder to identify whether the phone is used by the driver or one of the passengers. In this paper, we present a lightweight, software-only solution that uses the phone's camera to observe the car's interior geometry to distinguish phone position and orientation. We then use this information to distinguish between driver and passenger phone use. We collected data in 16 different cars with 33 different users and achieved an overall accuracy of 94% when the phone is held in hand and 92.2% when the phone is docked (1 sec. delay). With just a software upgrade, this work can enable smartphones to proactively adapt to the user's context in the car and and substantially reduce distracted driving incidents.",
  "tags": [
    "position sensing",
    "situational impairments",
    "driver detection",
    "in-car behavior"
  ],
  "authors": [
    {
      "name": "Rushil Khurana",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503644074",
      "orcid": "missing"
    },
    {
      "name": "Mayank Goel",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500642496",
      "orcid": "0000-0003-1237-7545"
    }
  ],
  "references": [
    {
      "text": "National Highway Traffic Safety Administration. 2016. Distracted Driving 2014. (2016). https://crashstats. nhtsa.dot.gov/api/public/viewpublication/812260",
      "doi": ""
    },
    {
      "text": "Rafael A Berri, Alexandre G Silva, Rafael S Parpinelli, Elaine Girardi, and Rangel Arthur. 2014. A pattern recognition system for detecting use of mobile phones while driving. In Computer Vision Theory and Applications (VISAPP), 2014 International Conference on, Vol. 2. IEEE, 411--418.",
      "doi": ""
    },
    {
      "text": "Cheng Bo, Xuesi Jian, Xiang-Yang Li, Xufei Mao, Yu Wang, and Fan Li. 2013. You're driving and texting: detecting drivers using personal smart phones by leveraging inertial sensors. In Proceedings of the 19th annual international conference on Mobile computing & networking. ACM, 199--202.",
      "doi": "10.1145/2500423.2504575"
    },
    {
      "text": "Hon Chu, Vijay Raman, Jeffrey Shen, Aman Kansal, Victor Bahl, and Romit Roy Choudhury. 2014. I am a smartphone and I know my user is driving. In Communication Systems and Networks (COMSNETS), 2014 Sixth International Conference on. IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Paul Dietz and Darren Leigh. 2001. DiamondTouch: a multi-user touch technology. In Proceedings of the 14th annual ACM symposium on User interface software and technology. ACM, 219--226.",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Paul H Dietz, Bret Harsham, Clifton Forlines, Darren Leigh, William Yerazunis, Sam Shipman, Bent Schmidt-Nielsen, and Kathy Ryall. 2005. DT controls: adding identity to physical interfaces. In Proceedings of the 18th annual ACM symposium on User interface software and technology. ACM, 245--252.",
      "doi": "10.1145/1095034.1095075"
    },
    {
      "text": "Mayank Goel, Jacob Wobbrock, and Shwetak Patel. 2012. GripSense: using built-in sensors to detect hand posture and pressure on commodity mobile phones. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 545--554.",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Zongjian He, Jiannong Cao, Xuefeng Liu, and Shaojie Tang. 2014. Who sits where? Infrastructure-free in-vehicle cooperative positioning via smartphones. Sensors 14, 7 (2014), 11605--11628.",
      "doi": ""
    },
    {
      "text": "Rushil Khurana, Karan Ahuja, Zac Yu, Jennifer Mankoff, Chris Harrison, and Mayank Goel. 2018. GymCam: Detecting, Recognizing and Tracking Simultaneous Exercises in Unconstrained Scenes. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 185.",
      "doi": "10.1145/3287063"
    },
    {
      "text": "Hemank Lamba, Varun Bharadhwaj, Mayank Vachher, Divyansh Agarwal, Megha Arora, and Ponnurangam Kumaraguru. 2016. Me, Myself and My Killfie: Characterizing and Preventing Selfie Deaths. arXiv preprint arXiv:1611.01911 (2016).",
      "doi": ""
    },
    {
      "text": "Luyang Liu, Cagdas Karatas, Hongyu Li, Sheng Tan, Marco Gruteser, Jie Yang, Yingying Chen, and Richard P Martin. 2015. Toward detection of unsafe driving with wearables. In Proceedings of the 2015 workshop on Wearable Systems and Applications. ACM, 27--32.",
      "doi": "10.1145/2753509.2753518"
    },
    {
      "text": "Alex Mariakakis, Vijay Srinivasan, Kiran Rachuri, and Abhishek Mukherji. 2016. Watchudrive: Differentiating drivers and passengers using smartwatches. In Pervasive Computing and Communication Workshops (PerCom Workshops), 2016 IEEE International Conference on. IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Mihai Negru and Sergiu Nedevschi. 2013. Image based fog detection and visibility estimation for driving assistance systems. In Intelligent Computer Communication and Processing (ICCP), 2013 IEEE International Conference on. IEEE, 163--168.",
      "doi": ""
    },
    {
      "text": "Stanley Rabu. 2014. Detecting docking status of a portable device using motion sensor data. (March 25 2014). US Patent 8,682,399.",
      "doi": ""
    },
    {
      "text": "Andrew Sears, Min Lin, Julie Jacko, and Yan Xiao. 2003. When computers fade: Pervasive computing and situationally-induced impairments and disabilities. In HCI International, Vol. 2. 1298--1302.",
      "doi": ""
    },
    {
      "text": "Keshav Seshadri, Felix Juefei-Xu, Dipan K Pal, Marios Savvides, and Craig P Thor. 2015. Driver cell phone usage detection on strategic highway research program (SHRP2) face view videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops. 35--43.",
      "doi": ""
    },
    {
      "text": "Chun-Che Wang, Shih-Shinh Huang, and Li-Chen Fu. 2005. Driver assistance system for lane detection and vehicle recognition with night vision. In Intelligent Robots and Systems, 2005.(IROS 2005). 2005 IEEE/RSJ International Conference on. IEEE, 3530--3535.",
      "doi": ""
    },
    {
      "text": "Edward Jay Wang, Jake Garrison, Eric Whitmire, Mayank Goel, and Shwetak Patel. 2017. Carpacio: Repurposing capacitive sensors to distinguish driver and passenger touches on in-vehicle screens. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 49--55.",
      "doi": "10.1145/3126594.3126623"
    },
    {
      "text": "Yan Wang, Yingying Jennifer Chen, Jie Yang, Marco Gruteser, Richard P Martin, Hongbo Liu, Luyang Liu, and Cagdas Karatas. 2016. Determining driver phone use by exploiting smartphone integrated sensors. IEEE Transactions on Mobile Computing 15, 8 (2016), 1965--1981.",
      "doi": "10.1109/TMC.2015.2483501"
    },
    {
      "text": "Robert Xiao, Scott Hudson, and Chris Harrison. 2016. CapCam: Enabling Rapid, Ad-Hoc, Position-Tracked Interactions Between Devices. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces. ACM, 169--178.",
      "doi": "10.1145/2992154.2992182"
    },
    {
      "text": "Jie Yang, Simon Sidhom, Gayathri Chandrasekaran, Tam Vu, Hongbo Liu, Nicolae Cecan, Yingying Chen, Marco Gruteser, and Richard P Martin. 2011. Detecting driver phone use leveraging car speakers. In Proceedings of the 17th annual international conference on Mobile computing and networking. ACM, 97--108.",
      "doi": "10.1145/2030613.2030625"
    }
  ]
}