{
  "doi": "10.1145/3313831.3376510",
  "title": "Integrating the Digital and the Traditional to Deliver Therapy for Depression: Lessons from a Pragmatic Study",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Traditional approaches to psychotherapy emphasise face-to-face contact between patients and therapists. In contrast, current computerised approaches tend to minimise this contact. This can limit the range of mental health difficulties for which computerised approaches are effective. Here, we explore an alternative approach that integrates face-to-face contact, electronic contact, online collaboration, and support for between-session activities. Our discussion is grounded in the design of a platform to deliver psychotherapy for depression. We report findings of an 11-month pragmatic study in which 17 patients received treatment for depression via the platform. Results show how design decisions had a significant impact on the dynamics of therapeutic sessions and the establishment of patient-therapist relationships. For example, the use of instant messaging for synchronous, in-session contact slowed communication, but also provided a valuable space for reflection and helped to maintain session focus. We discuss the impact of flexibility and the potential of integrated approaches to both enhance and reduce patient engagement.",
  "authors": [
    {
      "name": "Katarzyna Stawarz",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81502805650/rel-imgonly/k-stawarz-300x300-q100.jpg",
      "acmid": "81502805650",
      "orcid": "missing"
    },
    {
      "name": "Chris Preist",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100643653",
      "orcid": "0000-0002-5094-5294"
    },
    {
      "name": "Deborah Tallon",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529176",
      "orcid": "missing"
    },
    {
      "name": "Laura Thomas",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528439",
      "orcid": "missing"
    },
    {
      "name": "Katrina Turner",
      "institution": "University of Bristol & NIHR Collaboration for Leadership in Applied Health Research and Care West, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529214",
      "orcid": "missing"
    },
    {
      "name": "Nicola Wiles",
      "institution": "University of Bristol & NIHR Bristol Biomedical Research Centre, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526623",
      "orcid": "missing"
    },
    {
      "name": "David Kessler",
      "institution": "University of Bristol & NIHR Bristol Biomedical Research Centre, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444602034",
      "orcid": "missing"
    },
    {
      "name": "Roz Shafran",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527933",
      "orcid": "missing"
    },
    {
      "name": "David Coyle",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81333488106/rel-imgonly/davidcoyle.jpg",
      "acmid": "81333488106",
      "orcid": "0000-0002-5103-0379"
    }
  ],
  "references": [
    {
      "text": "Gerhard Andersson and Pim Cuijpers. 2009. Internet-based and other computerized psychological treatments for adult depression: A meta-analysis. Cognitive Behaviour Therapy 38, 4 (2009), 196--205.",
      "doi": ""
    },
    {
      "text": "Gerhard Andersson, Alexander Rozental, Roz Shafran, and Per Carlbring. 2018. Long-term effects of internet-supported cognitive behaviour therapy. Expert Review of Neurotherapeutics 18, 1 (2018), 21--28.",
      "doi": ""
    },
    {
      "text": "Carl Baker. 2018. Mental Health Statistics For England: Prevalence, Services And Funding. House of Commons Library. (2018). https://researchbriefings.parliament.uk/ ResearchBriefing/Summary/SN06988",
      "doi": ""
    },
    {
      "text": "Jakob E Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing mobile health technology for bipolar disorder: a field trial of the monarca system. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2627--2636.",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Marguerite Barry, Kevin Doherty, Jose Marcano Belisario, Josip Car, Cecily Morrison, and Gavin Doherty. 2017. mHealth for maternal mental health: everyday wisdom in ethical design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2708--2756.",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Angela Beattie, Alison Shaw, Surinder Kaur, and David Kessler. 2009. Primary-care patients' expectations and experiences of online cognitive behavioural therapy for depression: A qualitative study. Health Expectations 12, 1 (2009), 45--59.",
      "doi": ""
    },
    {
      "text": "A. T. Beck, A. J. Rush, B. F. Shaw, and G Emery. 1979. Cognitive Therapy of Depression. Wiley.",
      "doi": ""
    },
    {
      "text": "Aaron T Beck, Robert A Steer, and Gregory K Brown. 1996. Beck Depression Inventory-II. Psychological Corporation, San Antonio, TX.",
      "doi": ""
    },
    {
      "text": "Judith S Beck. 1995. Cognitive Therapy: Basics and Beyond. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Nina Bendelin, Hugo Hesser, Johan Dahl, Per Carlbring, Karin Zetterqvist Nelson, and Gerhard Andersson. 2011. Experiences of guided Internet-based cognitive-behavioural treatment for depression: a qualitative study. BMC Psychiatry 11, 1 (2011), 107.",
      "doi": ""
    },
    {
      "text": "R Churchill, V Hunot, R Corney, M Knapp, H McGuire, A Tylee, and S Wessely. 2001. A systematic review of controlled trials of the effectiveness and cost-effectiveness of brief psychological treatments for depression. Health Technology Assessment 5, 35 (2001), 1--173.",
      "doi": ""
    },
    {
      "text": "Kerry A Collins, Henny A Westra, David JA Dozois, and David D Burns. 2004. Gaps in accessing treatment for anxiety and depression: challenges for the delivery of care. Clinical Psychology Review 24, 5 (2004), 583--616.",
      "doi": ""
    },
    {
      "text": "David Coyle, Gavin Doherty, Mark Matthews, and John Sharry. 2007. Computers in talk-based mental health interventions. Interacting with Computers 19, 4 (2007), 545--562.",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "David Coyle, Nicola McGlade, Gavin Doherty, and Gary O'Reilly. 2011. Exploratory evaluations of a computer game supporting cognitive behavioural therapy for adolescents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2937--2946.",
      "doi": "10.1145/1978942.1979378"
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended functions of emojis in US messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 504--509.",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1421--1430. DOI: http://dx.doi.org/10.1145/2207676.2208602",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "ehubHealth. n.d. MoodGYM. (n.d.). https://www.moodgym.com.au/",
      "doi": ""
    },
    {
      "text": "NHS England. 2018. Psychological Therapies, Annual report on the use of IAPT services - England, 2017--18. https://digital.nhs.uk/data-and-information/publications/ statistical/psychological-therapies-annual-reportson-the-use-of-iapt-services/annual-report-2017--18",
      "doi": ""
    },
    {
      "text": "NHS England and Heath Education England. 2015. Adult IAPT Workforce Census Report. (2015). https://www.england.nhs.uk/mental-health/adults/iapt/ workforce/",
      "doi": ""
    },
    {
      "text": "Rahhal Errattahi, Asmaa El Hannani, and Hassan Ouahmane. 2018. Automatic speech recognition errors detection and correction: A review. Procedia Computer Science 128 (2018), 32--37.",
      "doi": ""
    },
    {
      "text": "National Institute for Health and Care Excellence (NICE). 2009. Depression in adults (update). Depression: the treatment and management of depression in adults. https://www.nice.org.uk/guidance/cg90",
      "doi": ""
    },
    {
      "text": "Pooria Sarrami Foroushani, Justine Schneider, and Neda Assareh. 2011. Meta-review of the effectiveness of computerised CBT in treating depression. BMC Psychiatry 11, 1 (2011), 131. DOI: http://dx.doi.org/10.1186/1471--244X-11--131",
      "doi": ""
    },
    {
      "text": "Simon Gilbody, Sally Brabyn, Karina Lovell, David Kessler, Thomas Devlin, Lucy Smith, Ricardo Araya, Michael Barkham, Peter Bower, Cindy Cooper, Sarah Knowles, Elizabeth Littlewood, David A. Richards, Debbie Tallon, David White, and Gillian Worthy. 2017. Telephone-supported computerised cognitive-behavioural therapy: REEACT-2 large-scale pragmatic randomised controlled trial. British Journal of Psychiatry 210, 5 (2017), 362--367. DOI: http://dx.doi.org/10.1192/bjp.bp.116.192435",
      "doi": ""
    },
    {
      "text": "Simon Gilbody, Elizabeth Littlewood, Catherine Hewitt, Gwen Brierley, Puvan Tharmanathan, Ricardo Araya, Michael Barkham, Peter Bower, Cindy Cooper, Linda Gask, and others. 2015. Computerised cognitive behaviour therapy (cCBT) as treatment for depression in primary care (REEACT trial): large scale pragmatic randomised controlled trial. BMJ 351 (2015), h5627.",
      "doi": ""
    },
    {
      "text": "Cornelius Glackin, Nazim Dugan, Nigel Cannings, and Julie Wall. 2019. Smart Transcription. In Proceedings of the 31st European Conference on Cognitive Ergonomics (ECCE 2019). ACM, NY, NY, USA, 134--137. DOI: http://dx.doi.org/10.1145/3335082.3335114",
      "doi": ""
    },
    {
      "text": "Sylvia Helbig and Lydia Fehm. 2004. Problems with homework in CBT: Rare exception or rather frequent? Behavioural and Cognitive Psychotherapy 32, 3 (2004), 291--301.",
      "doi": ""
    },
    {
      "text": "Sandra Hollinghurst, Tim J. Peters, Surinder Kaur, Nicola Wiles, Glyn Lewisand, and David Kessler. 2010. Cost-effectiveness of therapist-delivered online cognitive-behavioural therapy for depression: randomised controlled trial. British Journal of Psychiatry 197, 4 (oct 2010), 297--304. DOI: http://dx.doi.org/10.1192/bjp.bp.109.073080",
      "doi": ""
    },
    {
      "text": "Ieso Digital Health Ltd. n.d. Ieso. (n.d.). https://www.iesohealth.com/en-gb",
      "doi": ""
    },
    {
      "text": "Eirini Karyotaki, Heleen Riper, Jos Twisk, Adriaan Hoogendoorn, Annet Kleiboer, Adriana Mira, Andrew MacKinnon, Björn Meyer, Cristina Botella, Elizabeth Littlewood, Gerhard Andersson, Helen Christensen, Jan P. Klein, Johanna Schröder, Juana Bretón-López, Justine Scheider, Kathy Griffiths, Louise Farrer, Marcus J.H. Huibers, Rachel Phillips, Simon Gilbody, Steffen Moritz, Thomas Berger, Victor Pop, Viola Spek, and Pim Cuijpers. 2017. Efficacy of self-guided internet-based cognitive behavioral therapy in the treatment of depressive symptoms a meta-analysis of individual participant data. JAMA Psychiatry 74, 4 (2017), 351--359.",
      "doi": ""
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for mental wellness: understanding expert perspectives and student experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 629--641.",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Robin MF Kenter, Peter M van de Ven, Pim Cuijpers, Ger Koole, Safar Niamat, Rob S Gerrits, Mark Willems, and Annemieke van Straten. 2015. Costs and effects of Internet cognitive behavioral treatment blended with face-to-face treatment: results from a naturalistic study. Internet Interventions 2, 1 (2015), 77--83.",
      "doi": ""
    },
    {
      "text": "Sarah J Kertz, J MacLaren Kelly, Kimberly T Stevens, Matthew Schrock, and Sara B Danitz. 2017. A review of free iPhone applications designed to target anxiety and worry. Journal of Technology in Behavioral Science 2, 2 (2017), 61--70.",
      "doi": ""
    },
    {
      "text": "David Kessler, Glyn Lewis, Surinder Kaur, Nicola Wiles, Michael King, Scott Weich, Debbie J Sharp, Ricardo Araya, Sandra Hollinghurst, and Tim J Peters. 2009. Therapist-delivered internet psychotherapy for depression in primary care: a randomised controlled trial. The Lancet 374, 9690 (2009), 628--634.",
      "doi": ""
    },
    {
      "text": "Sarah E Knowles, Karina Lovell, Peter Bower, Simon Gilbody, Elizabeth Littlewood, and Helen Lester. 2015. Patient experience of computerised therapy for depression in primary care. BMJ Open 5, 11 (2015), e008581.",
      "doi": ""
    },
    {
      "text": "Lisa C Kooistra, Jeroen Ruwaard, Jenneke E Wiersma, Patricia van Oppen, Rosalie van der Vaart, Julia EWC van Gemert-Pijnen, and Heleen Riper. 2016. Development and initial evaluation of blended cognitive behavioural treatment for major depression in routine specialized mental health care. Internet Interventions 4 (2016), 61--71.",
      "doi": ""
    },
    {
      "text": "Kurt Kroenke and Robert L Spitzer. 2002. The PHQ-9 : A New Depression Measure. Psychiatric Annals 32, 9 (2002), 509--515.",
      "doi": ""
    },
    {
      "text": "Reeva Lederman, Greg Wadley, John Gleeson, Sarah Bendall, and Mario Álvarez-Jiménez. 2014. Moderated online social therapy: Designing and evaluating technology for mental health. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 1 (2014), 5.",
      "doi": "10.1145/2513179"
    },
    {
      "text": "Glyn Lewis. 1994. Assessing psychiatric disorder with a human interviewer or a computer. Journal of Epidemiology & Community Health 48, 2 (1994), 207--210.",
      "doi": ""
    },
    {
      "text": "Glyn Lewis, Anthony J Pelosi, Ricardo Araya, and Graham Dunn. 1992. Measuring psychiatric disorder in the community: a standardized assessment for use by lay interviewers. Psychological Medicine 22, 2 (1992), 465--486.",
      "doi": ""
    },
    {
      "text": "Joyce HL Lui, David K Marcus, and Christopher T Barry. 2017. Evidence-based apps? A review of mental health mobile applications in a psychotherapy context. Professional Psychology: Research and Practice 48, 3 (2017), 199.",
      "doi": ""
    },
    {
      "text": "Kristoffer N T Månsson, Erica Skagius Ruiz, Elisabet Gervind, Mats Dahlin, and Gerhard Andersson. 2013. Development and initial evaluation of an internet-based support system for face-to-face cognitive behavior therapy: A proof of concept study. Journal of Medical Internet Research 15, 12 (2013), e280.",
      "doi": ""
    },
    {
      "text": "Mark Matthews and Gavin Doherty. 2011. In the mood: engaging teenagers in psychotherapy using mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2947--2956.",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Mark Matthews, Elizabeth Murnane, and Jaime Snyder. 2017. Quantifying the Changeable Self: The role of self-tracking in coming to terms with and managing bipolar disorder. Human--Computer Interaction 32, 5--6 (2017), 413--446.",
      "doi": "10.1080/07370024.2017.1294983"
    },
    {
      "text": "Brent T Mausbach, Raeanne Moore, Scott Roesch, Veronica Cardenas, and Thomas L Patterson. 2010. The relationship between homework compliance and therapy outcomes: An updated meta-analysis. Cognitive Therapy and Research 34, 5 (2010), 429--438.",
      "doi": ""
    },
    {
      "text": "Lisa M McDermott and Klaus P Ebmeier. 2009. A meta-analysis of depression severity and cognitive function. Journal of Affective Disorders 119, 1--3 (2009), 1--8.",
      "doi": ""
    },
    {
      "text": "Mind. 2013. We still need to talk. A report on access to talking therapies. (2013). https://www.mind.org.uk/media/ 494424/we-still-need-to-talk_report.pdf",
      "doi": ""
    },
    {
      "text": "Mind. 2014. Commissioning talking therapies to meet need. A brie?ng from the We Need to Talk coalition. (2014). https://www.mind.org.uk/media/1748954/we-needto-talk_briefing-for-commissioners.pdf",
      "doi": ""
    },
    {
      "text": "David C Mohr, Enid Montague, Colleen Stiles-Shields, Susan M Kaiser, Christopher Brenner, Eric Carty-Fickes, Hannah Palac, and Jenna Duffecy. 2015. MedLink: a mobile intervention to address failure points in the treatment of depression in general medicine. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare. ICST, 100--107.",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Ken R. Weingardt, Madhu Reddy, and Stephen M. Schueller. 2017. Three Problems With Current Digital Mental Health Research . . . and Three Things We Can Do About Them. Psychiatric Services 68, 5 (2017), 427--429. DOI: http://dx.doi.org/10.1176/appi.ps.201600541",
      "doi": ""
    },
    {
      "text": "Michelle G Newman, Lauren E Szkodny, Sandra J Llera, and Amy Przeworski. 2011. A review of technology-assisted self-help and minimal contact therapies for anxiety and depression: is human contact necessary for therapeutic efficacy? Clinical Psychology Review 31, 1 (2011), 89--103.",
      "doi": ""
    },
    {
      "text": "Department of Health. 2011. Talking therapies: A four-year plan of action. (2011). https://www.gov.uk/government/publications/talkingtherapies-a-4-year-plan-of-action",
      "doi": ""
    },
    {
      "text": "Kathleen O'Leary, Stephen M Schueller, Jacob O Wobbrock, and Wanda Pratt. 2018. \"Suddenly, we got to become therapists for each other\": Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 331.",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Health Quality Ontario and others. 2019. Internet-delivered cognitive behavioural therapy for major depression and anxiety disorders: a health technology assessment. Ontario health technology assessment series 19, 6 (2019), 1.",
      "doi": ""
    },
    {
      "text": "Vikas N O'Reilly-Shah, Grant C Lynde, and Craig S Jabaley. 2018. Is it time to start using the emoji in biomedical literature? BMJ 363 (2018), k5033.",
      "doi": ""
    },
    {
      "text": "World Health Organization and others. 2017. Depression and other common mental disorders: global health estimates. Technical Report. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Stefan Rennick-Egglestone, Sarah Knowles, Gill Toms, Penny Bee, Karina Lovell, and Peter Bower. 2016. Health Technologies 'In the Wild': Experiences of Engagement with Computerised CBT. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2124--2135.",
      "doi": "10.1145/2858036.2858128"
    },
    {
      "text": "Derek Richards and Thomas Richardson. 2012. Computer-based psychological treatments for depression: A systematic review and meta-analysis. Clinical Psychology Review 32, 4 (jun 2012), 329--342. DOI: http://dx.doi.org/10.1016/j.cpr.2012.02.004",
      "doi": ""
    },
    {
      "text": "Jane Ritchie and Liz Spencer. 2002. Qualitative data analysis for applied policy research. The qualitative researcher's companion 573, 2002 (2002), 305--29.",
      "doi": ""
    },
    {
      "text": "Anthony Roth and Peter Fonagy. 2006. What works for whom?: A critical review of psychotherapy research. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Axel Janson, Pavel Karpashevich, Camille Nadal, Chengcheng Qu, Claudia Daudén Roquet, Muhammad Umair, Charles Windlin, Gavin Doherty, Kristina Höök, and others. 2019. HCI and Affective Health: Taking stock of a decade of studies and charting future research directions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 245.",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "Jessica Schroeder, Chelsey Wilkes, Kael Rowan, Arturo Toledo, Ann Paradiso, Mary Czerwinski, Gloria Mark, and Marsha M Linehan. 2018. Pocket skills: A conversational mobile web app to support dialectical behavioral therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 398.",
      "doi": "10.1145/3173574.3173972"
    },
    {
      "text": "Nelson Shen, Michael-Jane Levitan, Andrew Johnson, Jacqueline Lorene Bender, Michelle Hamilton-Page, Alejandro Alex R Jadad, and David Wiljer. 2015. Finding a depression app: a review and content analysis of the depression app marketplace. JMIR mHealth and uHealth 3, 1 (2015), e16.",
      "doi": ""
    },
    {
      "text": "Silvercloud. n.d. Silvercloud. (n.d.). https://www.silvercloudhealth.com/uk",
      "doi": ""
    },
    {
      "text": "Julius Sim. 2019. Should treatment effects be estimated in pilot and feasibility studies? Pilot and Feasibility Studies 5, 1 (2019), 107.",
      "doi": ""
    },
    {
      "text": "Diane J Skiba. 2016. Face with tears of joy is word of the year: are emoji a sign of things to come in health care? Nursing Education Perspectives 37, 1 (2016), 56--57.",
      "doi": ""
    },
    {
      "text": "Mirai So, Sosei Yamaguchi, Sora Hashimoto, Mitsuhiro Sado, Toshi A Furukawa, and Paul McCrone. 2013. Is computerised CBT really helpful for adult depression? A meta-analytic re-evaluation of cCBT for adult depression in terms of clinical implementation and methodological validity. BMC Psychiatry 13, 1 (2013), 113.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Chris Preist, and David Coyle. 2019. Use of Smartphone Apps, Social Media, and Web-Based Resources to Support Mental Health and Well-Being: Online Survey. JMIR Mental Health 6, 7 (2019), e12546.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Chris Preist, Debbie Tallon, Nicola Wiles, and David Coyle. 2018. User experience of cognitive behavioral therapy apps for depression: an analysis of app functionality and user reviews. Journal of Medical Internet Research 20, 6 (2018), e10120.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Chris Preist, Deborah Tallon, Nicola Wiles, David Kessler, and David Coyle. under review. Design Considerations for the Integrated Delivery of Cognitive Behavioral Therapy for Depression: A User-Centered Design Study. (under review). DOI: http://dx.doi.org/doi:10.2196/15972 Submitted to Journal of Medical Internet Research. Preprint: https://preprints.jmir.org/preprint/15972.",
      "doi": ""
    },
    {
      "text": "Tony Z Tang and Robert J DeRubeis. 1999. Reconsidering rapid early response in cognitive behavioral therapy for depression. Clinical Psychology: Science and Practice 6, 3 (1999), 283--288.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Paula Johnson, John McCarthy, Siân Lindley, Peter Wright, Patrick Olivier, and Thomas D Meyer. 2013. Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2647--2656.",
      "doi": "10.1145/2470654.2481366"
    },
    {
      "text": "Garreth W Tigwell and David R Flatla. 2016. Oh that's what you meant!: reducing emoji misunderstanding. In Proceedings of the 18th international conference on human-computer interaction with mobile devices and services adjunct. ACM, 859--866.",
      "doi": "10.1145/2957265.2961844"
    },
    {
      "text": "Ingrid Titzler, Karina Saruhanjan, Matthias Berking, Heleen Riper, and David Daniel Ebert. 2018. Barriers and facilitators for the implementation of blended psychotherapy for depression: A qualitative pilot study of therapists' perspective. Internet Interventions 12 (2018), 150--164.",
      "doi": ""
    },
    {
      "text": "University College London. n.d.a. CBT Map. (n.d.). http://www.ucl.ac.uk/clinical-psychology/competencymaps/cbt-map",
      "doi": ""
    },
    {
      "text": "University College London. n.d.b. Cognitive and Behavioural Therapy. (n.d.). https://www.ucl.ac.uk/pals/ research/cehp/research-groups/core/competenceframeworks/cognitive-and-behavioural-therapy",
      "doi": ""
    },
    {
      "text": "Rosalie van der Vaart, Marjon Witting, Heleen Riper, Lisa Kooistra, Ernst T Bohlmeijer, and Lisette JEWC van Gemert-Pijnen. 2014. Blending online therapy into regular face-to-face therapy for depression: content, ratio and preconditions according to patients and therapists using a Delphi study. BMC Psychiatry 14, 1 (2014), 355. https://doi.org/10.1186/s12888-014-0355-z",
      "doi": ""
    },
    {
      "text": "Jobke Wentzel, Rosalie van der Vaart, Ernst T Bohlmeijer, and Julia E W C van Gemert-Pijnen. 2016. Mixing Online and Face-to-Face Therapy: How to Bene?t From Blended Care in Mental Health Care. JMIR mental health 3, 1 (feb 2016), e9. DOI: http://dx.doi.org/10.2196/mental.4534",
      "doi": ""
    },
    {
      "text": "Henny A Westra, David JA Dozois, and Madalyn Marcus. 2007. Expectancy, homework compliance, and initial change in cognitive-behavioral therapy for anxiety. Journal of Consulting and Clinical Psychology 75, 3 (2007), 363.",
      "doi": ""
    },
    {
      "text": "Harvey A Whiteford, Louisa Degenhardt, Jürgen Rehm, Amanda J Baxter, Alize J Ferrari, Holly E Erskine, Fiona J Charlson, Rosana E Norman, Abraham D Flaxman, Nicole Johns, and others. 2013. Global burden of disease attributable to mental and substance use disorders: ?ndings from the Global Burden of Disease Study 2010. The Lancet 382, 9904 (2013), 1575--1586.",
      "doi": ""
    },
    {
      "text": "Nicola Wiles, Laura Thomas, Anna Abel, Nicola Ridgway, Nicholas Turner, John Campbell, Anne Garland, Sandra Hollinghurst, Bill Jerrom, David Kessler, Willem Kuyken, Jill Morrison, Katrina Turner, Chris Williams, Tim Peters, and Glyn Lewis. 2013. Cognitive behavioural therapy as an adjunct to pharmacotherapy for primary care based patients with treatment resistant depression: results of the CoBalT randomised controlled trial. The Lancet 381 (2013), 375--384.",
      "doi": ""
    },
    {
      "text": "Kirsten Ziman, Andrew C Heusser, Paxton C Fitzpatrick, Campbell E Field, and Jeremy R Manning. 2018. Is automatic speech-to-text transcription ready for use in psychological experiments? Behavior Research Methods 50, 6 (2018), 2597--2605.",
      "doi": ""
    }
  ]
}