{
  "doi": "10.1145/3313831.3376255",
  "title": "Smart Home Beyond the Home: A Case for Community-Based Access Control",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "As smart devices are becoming commonplace in homes, we need to explore the needs of not just the residents of the home, but also of secondary stakeholders who may be granted access to these devices from outside of the home. We conducted a mixed methods study, which included a survey of 163 smart home device owners and a follow-up interview with 13 individuals who currently share their smart home devices with others outside of their home. Nearly half (47.8%) of our survey participants shared at least one smart home device with someone that did not live with them. Individuals sought greater safety and security by providing remote access to trusted family members or friends. By understanding users' perspectives about privacy and trust in relation to sharing smart home devices beyond the home, we build a case for community-based access control of smart home devices in the Internet of Things.",
  "authors": [
    {
      "name": "Madiha Tabassum",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659045262",
      "orcid": "missing"
    },
    {
      "name": "Jess Kropczynski",
      "institution": "University of Cincinnati, Cincinnati, OH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259293957",
      "orcid": "0000-0002-7458-6003"
    },
    {
      "name": "Pamela Wisniewski",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/do/10.1145/contrib-81498641142/rel-imgonly/wisniewski.jpg",
      "acmid": "81498641142",
      "orcid": "0000-0002-6223-1029"
    },
    {
      "name": "Heather Richter Lipford",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385595946",
      "orcid": "0000-0002-5261-0148"
    }
  ],
  "references": [
    {
      "text": "Michael Caccavale. The impact of the digital revolution on the smart home industry. http://bit.ly/2MY6FKy. Accessed: 2019-09--20.",
      "doi": ""
    },
    {
      "text": "Sarah Perez. 47.3 million u.s. adults have access to a smart speaker, report says. https://tcrn.ch/2MSx2S8. Accessed: 2019-09--20.",
      "doi": ""
    },
    {
      "text": "Ring. Ring neighborhood watch. https://shop.ring.com/pages/neighbors. Accessed: 2019-09--20.",
      "doi": ""
    },
    {
      "text": "AJ Brush, Jaeyeon Jung, Ratul Mahajan, and Frank Martinez. Digital neighborhood watch: Investigating the sharing of camera data amongst neighbors. In Proceedings of the 2013 conference on Computer supported cooperative work, pages 693--700. ACM, 2013.",
      "doi": "10.1145/2441776.2441853"
    },
    {
      "text": "James Garofalo and Maureen McLeod. The structure and operations of neighborhood watch programs in the united states. Crime & Delinquency, 35(3):326--344, 1989.",
      "doi": ""
    },
    {
      "text": "Dennis P Rosenbaum. The theory and research behind neighborhood watch: Is it a sound fear and crime reduction strategy? Crime & Delinquency, 33(1):103--134, 1987.",
      "doi": ""
    },
    {
      "text": "Tim O'reilly. What is web 2.0: Design patterns and business models for the next generation of software. Communications & strategies, (1):17, 2007.",
      "doi": ""
    },
    {
      "text": "Ralf De Wolf, Koen Willaert, and Jo Pierson. Managing privacy boundaries together: Exploring individual and group privacy management strategies in facebook. Computers in Human Behavior, 35:444--454, 2014.",
      "doi": ""
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. End user security and privacy concerns with smart homes. In Thirteenth Symposium on Usable Privacy and Security ({SOUPS} 2017), pages 65--80, 2017.",
      "doi": "10.5555/3235924.3235931"
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. User perceptions of smart home iot privacy. Proceedings of the ACM on Human-Computer Interaction, 2(CSCW):200, 2018.",
      "doi": "10.1145/3274469"
    },
    {
      "text": "Xinru Page, Paritosh Bahirat, Muhammad Safi, Bart Knijnenburg, and Pamela Wisniewski. The internet of what?: Understanding differences in perceptions and adoption for the internet of things. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 2:1--22, 12 2018.",
      "doi": "10.1145/3287061"
    },
    {
      "text": "AJ Bernheim Brush and Kori M Inkpen. Yours, mine and ours? sharing and use of technology in domestic environments. In International Conference on Ubiquitous Computing, pages 109--126. Springer, 2007.",
      "doi": ""
    },
    {
      "text": "Michelle L Mazurek, JP Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, et al. Access control for home data sharing: Attitudes, needs and practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 645--654. ACM, 2010.",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Vassilios Lekakis, Yunus Basagalar, and Pete Keleher. Don't trust your roommate or access control and replication protocols in \"home\" environments. In In Proc. HotStorage. Citeseer, 2012.",
      "doi": ""
    },
    {
      "text": "Steven K Firth, Farid Fouchal, Tom Kane, Vanda Dimitriou, and Tarek M Hassan. Decision support systems for domestic retrofit provision using smart home data streams. CIB, 2013.",
      "doi": ""
    },
    {
      "text": "Matthew Johnson and Frank Stajano. Usability of security management: Defining the permissions of guests. In International Workshop on Security Protocols, pages 276--283. Springer, 2006.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. Intruders versus intrusiveness: teens' and parents' perspectives on home-entryway surveillance. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, pages 129--139. ACM, 2014.",
      "doi": "10.1145/2632048.2632107"
    },
    {
      "text": "Stuart Schechter. The user is the enemy, and (s)he keeps reaching for that bright shiny power button! In Proceedings of the Workshop on Home Usable Privacy and Security (HUPS), July 2013.",
      "doi": ""
    },
    {
      "text": "A.J. Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. Home automation in the wild: Challenges and opportunities. ACM Conference on Computer-Human Interaction, May 2011.",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Colin Dixon, Ratul Mahajan, Sharad Agarwal, AJ Brush, Bongshin Lee, Stefan Saroiu, and Paramvir Bahl. An operating system for the home. In Proceedings of the 9th USENIX conference on Networked Systems Design and Implementation, pages 25--25. USENIX Association, 2012.",
      "doi": "10.5555/2228298.2228332"
    },
    {
      "text": "Tiffany Hyun-Jin Kim, Lujo Bauer, James Newsome, Adrian Perrig, and Jesse Walker. Challenges in access right assignment for secure home networks. In HotSec, 2010.",
      "doi": ""
    },
    {
      "text": "Tiffany Hyun-Jin Kim, Lujo Bauer, James Newsome, Adrian Perrig, and Jesse Walker. Access right assignment mechanisms for secure home networks. Journal of Communications and Networks, 13(2):175--186, 2011.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. The current state of access control for smart devices in homes. In Workshop on Home Usable Privacy and Security (HUPS). HUPS 2014, 2013.",
      "doi": ""
    },
    {
      "text": "Dave Randall. Living inside a smart home: A case study. In Inside the smart home, pages 227--246. Springer, 2003.",
      "doi": ""
    },
    {
      "text": "Kari Kostiainen, Olli Rantapuska, Seamus Moloney, Virpi Roto, Ursula Holmstrom, and Kristiina Karvonen. Usable access control inside home networks. In 2007 IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, pages 1--6. IEEE, 2007.",
      "doi": ""
    },
    {
      "text": "Ring Help. Controlling ring devices through multiple devices or sharing control with other users. http://bit.ly/39NC24f. Accessed: 2019-09--20.",
      "doi": ""
    },
    {
      "text": "Google Nest Help. Learn about family accounts and how to share access to your nest home. https://support.google.com/googlenest/answer/9304271?co=GENIE.Platform%3DAndroid&hl=en. Accessed: 2019-09--20.",
      "doi": ""
    },
    {
      "text": "Christine Geeng and Franziska Roesner. Who's in control?: Interactions in multi-user smart homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 268. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Weijia He, Maximilian Golla, Roshni Padhi, Jordan Ofek, Markus Dürmuth, Earlence Fernandes, and Blase Ur. Rethinking access control and authentication for the home internet of things (iot). In 27th USENIX Security Symposium (USENIX Security 18), pages 255--272, 2018.",
      "doi": ""
    },
    {
      "text": "Eric Zeng and Franziska Roesner. Understanding and improving security and privacy in multi-user smart homes: A design exploration and in-home user study. In 28th USENIX Security Symposium (USENIX Security 19), pages 159--176, 2019.",
      "doi": ""
    }
  ]
}