{
  "doi": "10.1145/3313831.3376442",
  "title": "Wrex: A Unified Programming-by-Example Interaction for Synthesizing Readable Code for Data Scientists",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Data wrangling is a difficult and time-consuming activity in computational notebooks, and existing wrangling tools do not fit the exploratory workflow for data scientists in these environments. We propose a unified interaction model based on programming-by-example that generates readable code for a variety of useful data transformations, implemented as a Jupyter notebook extension called Wrex. User study results demonstrate that data scientists are significantly more effective and efficient at data wrangling with Wrex over manual programming. Qualitative participant feedback indicates that Wrex was useful and reduced barriers in having to recall or look up the usage of various data transform functions. The synthesized code allowed data scientists to verify the intended data transformation, increased their trust and confidence in Wrex, and fit seamlessly within their cell-based notebook workflows. This work suggests that presenting readable code to professional data scientists is an indispensable component of offering data wrangling tools in notebooks.",
  "authors": [
    {
      "name": "Ian Drosos",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659285356",
      "orcid": "missing"
    },
    {
      "name": "Titus Barik",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279029",
      "orcid": "missing"
    },
    {
      "name": "Philip J. Guo",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488891",
      "orcid": "missing"
    },
    {
      "name": "Robert DeLine",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350602833",
      "orcid": "0000-0001-8885-8367"
    },
    {
      "name": "Sumit Gulwani",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100315615",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apache. 2019. Zeppelin. (2019). https://zeppelin.apache.org/",
      "doi": ""
    },
    {
      "text": "Carbide. 2019. Carbide Alpha. (2019). https://alpha.trycarbide.com/",
      "doi": ""
    },
    {
      "text": "Sarah E. Chasins, Maria Mueller, and Rastislav Bodik. 2018. Rousillon: Scraping Distributed Hierarchical Web Data. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). 963--975. DOI: http://dx.doi.org/10.1145/3242587.3242661",
      "doi": "10.1145/3242587.3242661"
    },
    {
      "text": "Tamraparni Dasu and Theodore Johnson. 2003. Exploratory Data Mining and Data Cleaning (1 ed.). DOI: http://dx.doi.org/10.1002/0471448354",
      "doi": ""
    },
    {
      "text": "Databricks. 2019. databricks. (2019). https://databricks.com/",
      "doi": ""
    },
    {
      "text": "Robert DeLine, Danyel Fisher, Badrish Chandramouli, Jonathan Goldstein, Michael Barnett, James F Terwilliger, and John Wernsing. 2015. Tempe: Live scripting for live data. In 2015 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '15). 137--141. DOI: http://dx.doi.org/10.1109/VLHCC.2015.7357208",
      "doi": ""
    },
    {
      "text": "Yu Feng, Ruben Martins, Jacob Van Geffen, Isil Dillig, and Swarat Chaudhuri. 2017. Component-based Synthesis of Table Consolidation and Transformation Tasks from Examples. In Proceedings of the 38th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI '17). 422--436. DOI: http://dx.doi.org/10.1145/3062341.3062351",
      "doi": "10.1145/3062341.3062351"
    },
    {
      "text": "Google. 2019. OpenRefne. (2019). https://openrefine.org/",
      "doi": ""
    },
    {
      "text": "Sumit Gulwani. 2011. Automating String Processing in Spreadsheets Using Input-output Examples. In Proceedings of the 38th Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL '11). 317--330. DOI: http://dx.doi.org/10.1145/1926385.1926423",
      "doi": "10.1145/1926385.1926423"
    },
    {
      "text": "Sumit Gulwani. 2012. Synthesis from Examples: Interaction Models and Algorithms. In Proceedings of the 2012 14th International Symposium on Symbolic and Numeric Algorithms for Scientifc Computing (SYNASC '12). 8--14. DOI: http://dx.doi.org/10.1109/SYNASC.2012.69",
      "doi": "10.1109/SYNASC.2012.69"
    },
    {
      "text": "Sumit Gulwani, William R. Harris, and Rishabh Singh. 2012. Spreadsheet Data Manipulation Using Examples. Commun. ACM 55, 8 (Aug. 2012), 97--105. DOI: http://dx.doi.org/10.1145/2240236.2240260",
      "doi": "10.1145/2240236.2240260"
    },
    {
      "text": "Sumit Gulwani and Mark Marron. 2014. NLyze: Interactive Programming by Natural Language for Spreadsheet Data Analysis and Manipulation. In Proceedings of the 2014 ACM SIGMOD International Conference on Management of Data (SIGMOD '14). 803--814. DOI: http://dx.doi.org/10.1145/2588555.2612177",
      "doi": "10.1145/2588555.2612177"
    },
    {
      "text": "Sumit Gulwani, Kunal Pathak, Arjun Radhakrishna, Ashish Tiwari, and Abhishek Udupa. 2019. Quantitative Programming by Examples. arXiv e-prints (Sep. 2019), arXiv:1909.05964.",
      "doi": ""
    },
    {
      "text": "Philip J. Guo, Sean Kandel, Joseph M. Hellerstein, and Jeffrey Heer. 2011. Proactive Wrangling: Mixed-initiative End-user Programming of Data Transformation Scripts. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). 65--74. DOI: http://dx.doi.org/10.1145/2047196.2047205",
      "doi": "10.1145/2047196.2047205"
    },
    {
      "text": "William R. Harris and Sumit Gulwani. 2011. Spreadsheet Table Transformations from Examples. In Proceedings of the 32nd ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI '11). 317--328. DOI: http://dx.doi.org/10.1145/1993498.1993536",
      "doi": ""
    },
    {
      "text": "Hideo Hattori. 2019. autopep8. (2019). https://github.com/hhatto/autopep8/",
      "doi": ""
    },
    {
      "text": "Yeye He, Kris Ganjam, Kukjin Lee, Yue Wang, Vivek Narasayya, Surajit Chaudhuri, Xu Chu, and Yudian Zheng. 2018. Transform-Data-by-Example (TDE): Extensible Data Transformation in Excel. In Proceedings of the 2018 International Conference on Management of Data (SIGMOD '18). 1785--1788. DOI: http://dx.doi.org/10.1145/3183713.3193539",
      "doi": "10.1145/3183713.3193539"
    },
    {
      "text": "Jetbrains. 2019. Datalore. (2019). https://datalore.io/",
      "doi": ""
    },
    {
      "text": "Zhongjun Jin, Michael R. Anderson, Michael Cafarella, and H. V. Jagadish. 2017. Foofah: Transforming Data By Example. In Proceedings of the 2017 ACM International Conference on Management of Data (SIGMOD '17). 683--698. DOI: http://dx.doi.org/10.1145/3035918.3064034",
      "doi": ""
    },
    {
      "text": "Jupyter. 2019. Jupyter Notebook. (2019). https://jupyter.org/",
      "doi": ""
    },
    {
      "text": "Niranjan Kamat, Eugene Wu, and Arnab Nandi. 2016. TrendQuery: A System for Interactive Exploration of Trends. In Proceedings of the Workshop on Human-In-the-Loop Data Analytics (HILDA '16). Article 12, 4 pages. DOI: http://dx.doi.org/10.1145/2939502.2939514",
      "doi": "10.1145/2939502.2939514"
    },
    {
      "text": "Sean Kandel, Jeffrey Heer, Catherine Plaisant, Jessie Kennedy, Frank van Ham, Nathalie Henry Riche, Chris Weaver, Bongshin Lee, Dominique Brodbeck, and Paolo Buono. 2011a. Research Directions in Data Wrangling: Visualizations and Transformations for Usable and Credible Data. Information Visualization 10, 4 (Oct. 2011), 271--288. DOI: http://dx.doi.org/10.1177/1473871611415994",
      "doi": "10.1177/1473871611415994"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011b. Wrangler: Interactive Visual Specification of Data Transformation Scripts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 3363--3372. DOI: http://dx.doi.org/10.1145/1978942.1979444",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph M. Hellerstein, and Jeffrey Heer. 2012. Enterprise Data Analysis and Visualization: An Interview Study. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec. 2012), 2917--2926. DOI: http://dx.doi.org/10.1109/TVCG.2012.219",
      "doi": "10.1109/TVCG.2012.219"
    },
    {
      "text": "Mary Beth Kery, Marissa Radensky, Mahima Arya, Bonnie E. John, and Brad A. Myers. 2018. The Story in the Notebook: Exploratory Data Science Using a Literate Programming Tool. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Article 174, 11 pages. DOI: http://dx.doi.org/10.1145/3173574.3173748",
      "doi": ""
    },
    {
      "text": "Thomas Kluyver, Benjamin Ragan-Kelley, Fernando Pérez, Brian E. Granger, Matthias Bussonnier, Jonathan Frederic, Kyle Kelley, Jessica B. Hamrick, Jason Grout, Sylvain Corlay, Paul Ivanov, Damián Avila, Safa Abdalla, Carol Willing, and et al. 2016. Jupyter Notebooks - a publishing format for reproducible computational workfows. In Proceedings of the 20th International Conference on Electronic Publishing (ELPUB '16). DOI: http://dx.doi.org/10.3233/978--1--61499--649--1--87",
      "doi": ""
    },
    {
      "text": "Tim Kraska. 2018. Northstar: An Interactive Data Science System. Proceedings of the VLDB Endowment 11, 12 (Aug. 2018), 2150--2164. DOI: http://dx.doi.org/10.14778/3229863.3240493",
      "doi": "10.14778/3229863.3240493"
    },
    {
      "text": "Vu Le and Sumit Gulwani. 2014. FlashExtract: A Framework for Data Extraction by Examples. In Proceedings of the 35th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI '14). 542--553. DOI: http://dx.doi.org/10.1145/2594291.2594333",
      "doi": "10.1145/2666356.2594333"
    },
    {
      "text": "Microsoft. 2019. PROSE SDK. (2019). https://microsoft.github.io/prose/",
      "doi": ""
    },
    {
      "text": "Mozilla. 2019. Iodide. (2019). https://alpha.iodide.io/",
      "doi": ""
    },
    {
      "text": "Observable. 2019. Observable. (2019). https://observablehq.com/",
      "doi": ""
    },
    {
      "text": "pandas-dev. 2019. The pandas project. (2019). https://pandas.pydata.org/",
      "doi": ""
    },
    {
      "text": "Quantopian. 2019. Qgrid. (2019). https://github.com/quantopian/qgrid/",
      "doi": ""
    },
    {
      "text": "Rishabh Singh and Sumit Gulwani. 2012a. Learning Semantic String Transformations from Examples. Proceedings of the VLDB Endowment 5, 8 (April 2012), 740--751. DOI: http://dx.doi.org/10.14778/2212351.2212356",
      "doi": "10.14778/2212351.2212356"
    },
    {
      "text": "Rishabh Singh and Sumit Gulwani. 2012b. Synthesizing Number Transformations from Input-Output Examples. In Computer Aided Verification. 634--651. DOI: http://dx.doi.org/10.1007/978--3--642--31424--7_44",
      "doi": ""
    },
    {
      "text": "Trifacta. 2019. Wrangler. (2019). https://www.trifacta.com/products/wrangler-editions/",
      "doi": ""
    },
    {
      "text": "Navid Yaghmazadeh, Xinyu Wang, and Isil Dillig. 2018. Automated Migration of Hierarchical Data to Relational Tables Using Programming-by-example. Proceedings of the VLDB Endowment 11, 5 (Jan. 2018), 580--593. DOI: http://dx.doi.org/10.1145/3187009.3177735",
      "doi": "10.1145/3187009.3177735"
    },
    {
      "text": "Kuat Yessenov, Shubham Tulsiani, Aditya Menon, Robert C. Miller, Sumit Gulwani, Butler Lampson, and Adam Kalai. 2013. A Colorful Approach to Text Processing by Example. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). 495--504. DOI: http://dx.doi.org/10.1145/2501988.2502040",
      "doi": "10.1145/2501988.2502040"
    },
    {
      "text": "Xiong Zhang and Philip J. Guo. 2017. DS.Js: Turn Any Webpage into an Example-Centric Live Programming Environment for Learning Data Science. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). 691--702. DOI: http://dx.doi.org/10.1145/3126594.3126663",
      "doi": ""
    }
  ]
}