{
  "doi": "10.1145/3313831.3376189",
  "title": "3D-Auth: Two-Factor Authentication with Personalized 3D-Printed Items",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Two-factor authentication is a widely recommended security mechanism and already offered for different services. However, known methods and physical realizations exhibit considerable usability and customization issues. In this paper, we propose 3D-Auth, a new concept of two-factor authentication. 3D-Auth is based on customizable 3D-printed items that combine two authentication factors in one object. The object bottom contains a uniform grid of conductive dots that are connected to a unique embedded structure inside the item. Based on the interaction with the item, different dots turn into touch-points and form an authentication pattern. This pattern can be recognized by a capacitive touchscreen. Based on an expert design study, we present an interaction space with six categories of possible authentication interactions. In a user study, we demonstrate the feasibility of 3D-Auth items and show that the items are easy to use and the interactions are easy to remember.",
  "authors": [
    {
      "name": "Karola Marky",
      "institution": "Technische Universität Darmstadt & Keio University, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659225101",
      "orcid": "missing"
    },
    {
      "name": "Martin Schmitz",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-87958634757/rel-imgonly/martin_foto.jpg",
      "acmid": "87958634757",
      "orcid": "0000-0002-7332-3287"
    },
    {
      "name": "Verena Zimmermann",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659297138",
      "orcid": "missing"
    },
    {
      "name": "Martin Herbers",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260973",
      "orcid": "missing"
    },
    {
      "name": "Kai Kunze",
      "institution": "Keio University, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81372592910/rel-imgonly/kai-small-profile.jpg",
      "acmid": "81372592910",
      "orcid": "0000-0003-2294-3774"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    }
  ],
  "references": [
    {
      "text": "Bernd Bickel, Moritz Bächer, Miguel a. Otaduy, Hyunho Richard Lee, Hanspeter Pfister, Markus Gross, and Wojciech Matusik. 2010. Design and Fabrication of Materials with Desired Deformation Behavior. ACM Transactions on Graphics 29, 4 (July 2010), 1. DOI: http://dx.doi.org/10.1145/1833351.1778800",
      "doi": "10.1145/1778765.1778800"
    },
    {
      "text": "Joseph Bonneau, Cormac Herley, Paul C. Van Oorschot, and Frank Stajano. 2012. The Quest to Replace Passwords: A Framework for Comparative Evaluation of Web Authentication Schemes. In Proceedings of the IEEE Symposium on Security and Privacy. IEEE, Piscataway, NJ, USA, 553--567. DOI: http://dx.doi.org/10.1109/SP.2012.44",
      "doi": "10.1109/SP.2012.44"
    },
    {
      "text": "Eric Brockmeyer, Ivan Poupyrev, and Scott Hudson. 2013. PAPILLON: Designing Curved Display Surfaces with Printed Optics. In Proceedings of the Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 457--462. DOI: http://dx.doi.org/10.1145/2501988.2502027",
      "doi": "10.1145/2501988.2502027"
    },
    {
      "text": "Jesse Burstyn, Nicholas Fellion, and Paul Strohmeier. 2015. PrintPut: Resistive and Capacitive Input Widgets for Interactive 3D Prints. Vol. 9296. Springer, Cham, Switzerland. DOI: http://dx.doi.org/10.1007/978--3--319--22701--6 Series Title: Lecture Notes in Computer Science Publication Title: INTERACT 2015.",
      "doi": ""
    },
    {
      "text": "Elie Bursztein. 2018. The Bleak Picture of Two-Factor Authentication Adoption in the Wild. https://elie.net/blog/security/ the-bleak-picture-of-twofactor- authentication-adoption-in-the-wild/. (2018). [Online; accessed: 22-August-2019].",
      "doi": ""
    },
    {
      "text": "Swati Chaudhari, SS Tomar, and Anil Rawat. 2011. Design, Implementation and Analysis of Multi Layer, Multi Factor Authentication (MFA) Setup for Webmail Access in Multi Trust Networks. In Proceedings of the International Conference on Emerging Trends in Networks and Computer Communications (ETNCC). IEEE, Piscataway, NJ, USA, 27--32.",
      "doi": ""
    },
    {
      "text": "YuQun Chen and Michael Sinclair. 2008. Tangible Security for Mobile Devices. In Proceedings of the Annual International Conference on Mobile and Ubiquitous Systems: Computing, Networking, and Services (Mobiquitous '08). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, Article 19, 4 pages. DOI: http://dx.doi.org/10.4108/ICST.MOBIQUITOUS2008.3936",
      "doi": "10.4108/ICST.MOBIQUITOUS2008.3936"
    },
    {
      "text": "Stéphane Ciolino, Simon Parkin, and Paul Dunphy. 2019. Of Two Minds about Two-Factor: Understanding Everyday FIDO U2F Usability through Device Comparison and Experience Sampling. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). USENIX Association, Berkeley, CA, US, 339--356. https://www.usenix.org/conference/ soups2019/presentation/ciolino",
      "doi": ""
    },
    {
      "text": "Jessica Colnago, Summer Devlin, Maggie Oates, Chelse Swoopes, Lujo Bauer, Lorrie Cranor, and Nicolas Christin. 2018. \"It's Not Actually That Horrible\": Exploring Adoption of Two-Factor Authentication at a University. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 456, 11 pages. DOI: http://dx.doi.org/10.1145/3173574.3174030",
      "doi": "10.1145/3173574.3174030"
    },
    {
      "text": "Federal Financial Institutions Examination Council. 2005. Authentication in an Internet Banking Environment. Retrieved June 28 (2005), 2006.",
      "doi": ""
    },
    {
      "text": "Sanchari Das, Andrew Dingman, and L. Jean Camp. 2018. Why Johnny Doesn't Use Two Factor a Two-Phase Usability Study of the Fido u2f Security Key. In Proceedings of the International Conference on Financial Cryptography and Data Security (FC). Springer, Cham, Switzerland, 1--20. DOI: http://dx.doi.org/10.1007/978--3--662--58387--6_9",
      "doi": ""
    },
    {
      "text": "Sanchari Das, Bingxing Wang, Zachary Tingle, and L Jean Camp. 2019. Evaluating User Perception of Multi-Factor Authentication: A Systematic Review. arXiv preprint arXiv:1908.05901 (2019).",
      "doi": ""
    },
    {
      "text": "Emiliano De Cristofaro, Honglu Du, Julien Freudiger, and Greg Norcie. 2013. A Comparative Usability Study of Two-Factor Authentication. arXiv preprint arXiv:1309.5344 (2013).",
      "doi": ""
    },
    {
      "text": "Lada Gorlenko and Roland Merrick. 2003. No Wires Attached: Usability Challenges in the Connected Mobile World. IBM Systems Journal 42, 4 (2003), 639--651. DOI: http://dx.doi.org/10.1147/sj.424.0639",
      "doi": "10.1147/sj.424.0639"
    },
    {
      "text": "Paul A. Grassi, James L. Fenton, and Michael E. Garcia. 2017. Digital Identity Guidelines [Including Updates as of 12-01--2017]. Technical Report. NIST Special Publication 800--63--3.",
      "doi": ""
    },
    {
      "text": "Nancie Gunson, Diarmid Marshall, Hazel Morton, and Mervyn Jack. 2011. User Perceptions of Security and Usability of Single-Factor and Two-Factor Authentication in Automated Telephone Banking. Computers & Security 30, 4 (2011), 208--220.",
      "doi": "10.1016/j.cose.2010.12.001"
    },
    {
      "text": "Jonathan Hook, Thomas Nappey, Steve Hodges, Peter Wright, and Patrick Olivier. 2014. Making 3D Printed Objects Interactive Using Wireless Accelerometers. In Proceedings of the Extended Abstracts of the Conference on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 1435--1440. DOI: http://dx.doi.org/10.1145/2559206.2581137",
      "doi": "10.1145/2559206.2581137"
    },
    {
      "text": "Scott E. Hudson. 2014. Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 459--468. DOI: http://dx.doi.org/10.1145/2556288.2557338",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Yoshio Ishiguro and Ivan Poupyrev. 2014. 3D Printed Interactive Speakers. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1733--1742. DOI: http://dx.doi.org/10.1145/2556288.2557046",
      "doi": "10.1145/2556288.2557046"
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2016. 3D Printed Physical Interfaces That Can Extend Touch Devices. In Proceedings of the Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 47--49. DOI: http://dx.doi.org/10.1145/2984751.2985700",
      "doi": "10.1145/2984751.2985700"
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2161--2170. DOI: http://dx.doi.org/10.1145/2702123.2702414",
      "doi": ""
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In Proceedings of the HCI and Usability for Education and Work. Springer, Berlin/Heidelberg, Germany, 63--76. DOI: http://dx.doi.org/10.1007/978--3--540--89350--9_6",
      "doi": ""
    },
    {
      "text": "Simon J. Leigh, Robert J. Bradley, Christopher P. Purssell, Duncan R. Billson, and David a Hutchins. 2012. A Simple, Low-Cost Conductive Composite Material for 3D Printing of Electronic Sensors. PLoS ONE 7, 11 (Nov. 2012), e49365. DOI: http://dx.doi.org/10.1371/journal.pone.0049365",
      "doi": ""
    },
    {
      "text": "Marte Loge, Markus Duermuth, and Lillian Rostad. 2016. On User Choice for Android Unlock Patterns. In Proceedings of the EuroUSEC European Workshop on Usable Security. Internet Society, Reston, VA, USA.",
      "doi": ""
    },
    {
      "text": "Sana Maqsood, Sonia Chiasson, and Audrey Girouard. 2016. Bend Passwords: Using Gestures to Authenticate on Flexible Devices. Personal Ubiquitous Comput. 20, 4 (Aug. 2016), 573--600. DOI: http://dx.doi.org/10.1007/s00779-016-0928--6",
      "doi": "10.1007/s00779-016-0928-6"
    },
    {
      "text": "Philipp Mayring. 2010. Qualitative Inhaltsanalyse. In Handbuch qualitative Forschung in der Psychologie. Springer, Cham, Switzerland, 601--613.",
      "doi": ""
    },
    {
      "text": "Martez Mott, Thomas Donahue, G. Michael Poor, and Laura Leventhal. 2012. Leveraging Motor Learning for a Tangible Password System. In Extended Abstracts of the CHI conference on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 2597--2602. DOI: http://dx.doi.org/10.1145/2212776.2223842",
      "doi": "10.1145/2212776.2223842"
    },
    {
      "text": "Jakob Nielsen. 1992. Finding Usability Problems Through Heuristic Evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 373--380. DOI: http://dx.doi.org/10.1145/142750.142834",
      "doi": "10.1145/142750.142834"
    },
    {
      "text": "Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. 2013. Touch & Activate: Adding Interactivity to Existing Objects Using Active Acoustic Sensing. In Proceedings of the Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 31--40. DOI: http://dx.doi.org/10.1145/2501988.2501989",
      "doi": "10.1145/2501988.2501989"
    },
    {
      "text": "Julian Panetta, Qingnan Zhou, Luigi Malomo, Nico Pietroni, Paolo Cignoni, and Denis Zorin. 2015. Elastic Textures for Additive Fabrication. ACM Transactions on Graphics 34, 4 (2015), 135:1--135:12. DOI: http://dx.doi.org/10.1145/2766937",
      "doi": "10.1145/2766937"
    },
    {
      "text": "Jesús Pérez, Bernhard Thomaszewski, Stelian Coros, Bernd Bickel, José A. Canabal, Robert Sumner, and Miguel A. Otaduy. 2015. Design and Fabrication of Flexible Rod Meshes. ACM Transactions on Graphics 34, 4 (July 2015), 138:1--138:12. DOI: http://dx.doi.org/10.1145/2766998",
      "doi": "10.1145/2766998"
    },
    {
      "text": "Thanasis Petsas, Giorgos Tsirantonakis, Elias Athanasopoulos, and Sotiris Ioannidis. 2015. Two-factor Authentication: Is the World Ready?: Quantifying 2FA Adoption. In Proceedings of the EuroSec European Workshop on System Security (EuroSec '15). ACM, NY, NY, USA, Article 4, 7 pages. DOI: http://dx.doi.org/10.1145/2751323.2751327",
      "doi": "10.1145/2751323.2751327"
    },
    {
      "text": "Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: Enhancing Touch Interaction on Humans, Screens, Liquids, and Everyday Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 483. DOI: http://dx.doi.org/10.1145/2207676.2207743",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: Embedded Single-Camera Sensing of Printed Physical User Interfaces. In Proceedings of the Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 447--456. DOI: http://dx.doi.org/10.1145/2501988.2501992",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 3--12. DOI: http://dx.doi.org/10.1145/2642918.2647374",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "Martin Schmitz, Martin Herbers, Niloofar Dezfuli, Sebastian Günther, and Max Mühlhäuser. 2018. Off-Line Sensing: Memorizing Interactions in Passive 3D-Printed Objects. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 182, 8 pages. DOI: http://dx.doi.org/10.1145/3173574.3173756",
      "doi": "10.1145/3173574.3173756"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. In Proceedings of the Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 253--258. DOI: http://dx.doi.org/10.1145/2807442.2807503",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Martin Schmitz, Andreas Leister, Niloofar Dezfuli, Jan Riemann, Florian Müller, and Max Mühlhäuser. 2016. Liquido: Embedding Liquids into 3D Printed Objects to Sense Tilting and Motion. In Proceedings of the CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 2688--2696. DOI: http://dx.doi.org/10.1145/2851581.2892275",
      "doi": "10.1145/2851581.2892275"
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. 2017. Flexibles: Deformation-Aware 3D-Printed Tangibles for Capacitive Touchscreens. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1001--1014. DOI: http://dx.doi.org/10.1145/3025453.3025663",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Martin Schmitz, Martin Stitz, Florian Müller, Markus Funk, and Max Mühlhäuser. 2019. ./Trilaterate: A Fabrication Pipeline to Design and 3D Print Hover-, Touch-, and Force-Sensitive Objects. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 454, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300684",
      "doi": "10.1145/3290605.3300684"
    },
    {
      "text": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to Control Elasticity in 3D Printing. ACM Transactions on Graphics 34, 4 (July 2015), 136:1--136:13. DOI: http://dx.doi.org/10.1145/2766926",
      "doi": "10.1145/2766926"
    },
    {
      "text": "DUO Security. 2019. Security Tokens. https://duo.com/ product/trusted-users/two-factor-authentication/ authentication-methods/security-tokens. (2019). [Online; accessed: 22-August-2019].",
      "doi": ""
    },
    {
      "text": "International Organization For Standardization. 1998. ISO 9241--11: Ergonomics of Human System Interaction -- Part 11: Guidance on Usability. (1998).",
      "doi": ""
    },
    {
      "text": "Statista. 2018. Cybersecurity & Cloud 2018. (August 2018). https://de.statista.com/statistik/studie/id/ 58204/dokument/cybersecurity-und-cloud/ (accessed 16 September 2019).",
      "doi": ""
    },
    {
      "text": "Elizabeth Stobert and Robert Biddle. 2014. The Password Life Cycle: User Behaviour in Managing Passwords. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). USENIX Association, Berkeley, CA, US, 243--255.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Fumiko Noma, Jonathan Bees, Sean M. Segreti, Richard Shay, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2015. \"I Added'!'at the End to Make It Secure\": Observing Password Creation in the Lab. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). USENIX Association, Berkeley, CA, US, 123--140.",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, Ruthie Berman, and Zac Wellmer. 2016. Understanding Password Choices: How Frequently Entered Passwords Are Re-used Across Websites. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). USENIX Association, Berkeley, CA, US, 175--188.",
      "doi": ""
    },
    {
      "text": "Jake Weidman and Jens Grossklags. 2017. I Like It, but I Hate It: Employee Perceptions Towards an Institutional Transition to BYOD Second-Factor Authentication. In Proceedings of the Annual Computer Security Applications Conference (ACSAC 2017). ACM, NY, NY, USA, 212--224. DOI: http://dx.doi.org/10.1145/3134600.3134629",
      "doi": "10.1145/3134600.3134629"
    },
    {
      "text": "Catherine S. Weir, Gary Douglas, Martin Carruthers, and Mervyn Jack. 2009. User Perceptions of Security, Convenience and Usability for Ebanking Authentication Tokens. Computers & Security 28, 1--2 (2009), 47--62. DOI: http://dx.doi.org/10.1016/j.cose.2008.09.008",
      "doi": "10.1016/j.cose.2008.09.008"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed Optics: 3D Printing of Embedded Optical Elements for Interactive Devices. In Proceedings of the Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 589. DOI: http://dx.doi.org/10.1145/2380116.2380190",
      "doi": "10.1145/2380116.2380190"
    }
  ]
}