{
  "doi": "10.1145/3313831.3376383",
  "title": "Synthesized Social Signals: Computationally-Derived Social Signals from Account Histories",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Social signals are crucial when we decide if we want to interact with someone online. However, social signals are typically limited to the few that platform designers provide, and most can be easily manipulated. In this paper, we propose a new idea called synthesized social signals (S3s): social signals computationally derived from an account's history, and then rendered into the profile. Unlike conventional social signals such as profile bios, S3s use computational summarization to reduce receiver costs and raise the cost of faking signals. To demonstrate and explore the concept, we built Sig, an extensible Chrome extension that computes and visualizes S3s. After a formative study, we conducted a field deployment of Sig on Twitter, targeting two well-known problems on social media: toxic accounts and misinformation. Results show that Sig reduced receiver costs, added important signals beyond conventionally available ones, and that a few users felt safer using Twitter as a result. We conclude by reflecting on the opportunities and challenges S3s provide for augmenting interaction on social platforms.",
  "tags": [
    "social signals",
    "social computing",
    "social media",
    "social platform"
  ],
  "authors": [
    {
      "name": "Jane Im",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320250",
      "orcid": "0000-0002-9614-6535"
    },
    {
      "name": "Sonali Tandon",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321140",
      "orcid": "missing"
    },
    {
      "name": "Eshwar Chandrasekharan",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163032",
      "orcid": "missing"
    },
    {
      "name": "Taylor Denby",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529088",
      "orcid": "missing"
    },
    {
      "name": "Eric Gilbert",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489255",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Marjolijn L. Antheunis and Alexander P. Schouten. 2011. The effects of other-generated and system-generated cues on adolescents' perceived attractiveness on social network sites. Journal of Computer-Mediated Communication 16, 3 (2011), 391--406.",
      "doi": ""
    },
    {
      "text": "Saeideh Bakhshi, David A Shamma, and Eric Gilbert. 2014. Faces engage us: Photos with faces attract more likes and comments on instagram. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 965--974.",
      "doi": "10.1145/2556288.2557403"
    },
    {
      "text": "Albert Bandura. 2001. Social cognitive theory: An agentic perspective. Annual review of psychology 52, 1 (2001), 1--26.",
      "doi": ""
    },
    {
      "text": "Michael Barthel, Amy Mitchell, and Jesse Holcomb. 2016. Many Americans believe fake news is sowing confusion. Pew Research Center 15 (2016), 12.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in Social Virtual Reality: Challenges for Platform Governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (2019), 100.",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Yazan Boshmaf, Ildar Muslukhov, Konstantin Beznosov, and Matei Ripeanu. 2011. The socialbot network: when bots socialize for fame and money. In Proceedings of the 27th annual computer security applications conference. ACM, 93--102.",
      "doi": "10.1145/2076732.2076746"
    },
    {
      "text": "Alexandre Bovet and Hernán A Makse. 2019. Influence of fake news in Twitter during the 2016 US presidential election. Nature communications 10, 1 (2019), 7.",
      "doi": ""
    },
    {
      "text": "Danah Michele Boyd. 2004. Friendster and publicly articulated social networking. In Conference on Human Factors in Computing Systems: CHI'04 extended abstracts on Human factors in computing systems, Vol. 24. 1279--1282.",
      "doi": "10.1145/985921.986043"
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Shagun Jhaver, Hunter Charvat, Amy Bruckman, Cliff Lampe, Jacob Eisenstein, and Eric Gilbert. 2018. The Internet's Hidden Rules: An Empirical Study of Reddit Norm Violations at Micro, Meso, and Macro Scales. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 32.",
      "doi": "10.1145/3274301"
    },
    {
      "text": "Clayton Allen Davis, Onur Varol, Emilio Ferrara, Alessandro Flammini, and Filippo Menczer. 2016. Botornot: A system to evaluate social bots. In Proceedings of the 25th International Conference Companion on World Wide Web. International World Wide Web Conferences Steering Committee, 273--274.",
      "doi": "10.1145/2872518.2889302"
    },
    {
      "text": "Marian Stamp Dawkins and Tim Guilford. 1991. The corruption of honest signalling. Animal Behaviour 41, 5 (1991), 865--873.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Munmun De Choudhury, and Mor Naaman. 2012. Finding and assessing social media information sources in the context of journalism. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2451--2460.",
      "doi": "10.1145/2207676.2208409"
    },
    {
      "text": "Judith Donath. 2007. Signals in social supernets. Journal of Computer-Mediated Communication 13, 1 (2007), 231--251.",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Judith Donath and Danah Boyd. 2004. Public displays of connection. bt technology Journal 22, 4 (2004), 71--82.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017. Online harassment 2017. (2017).",
      "doi": ""
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing impressions online: Self-presentation processes in the online dating environment. Journal of computer-mediated communication 11, 2 (2006), 415--441.",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Jeffrey T Hancock, and Catalina L Toma. 2012. Profile as promise: A framework for conceptualizing veracity in online dating self-presentations. new media & society 14, 1 (2012), 45--62.",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of computer-mediated communication 12, 4 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. I always assumed that I wasn't really that close to [her]: Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 153--162.",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Asle Fagerstrøm, Sanchit Pawar, Valdimar Sigurdsson, Gordon R Foxall, and Mirella Yani-de Soriano. 2017. That personal profile image might jeopardize your rental opportunity! On the relative impact of the seller's facial expressions upon buying behavior on Airbnb. Computers in Human Behavior 72 (2017), 123--131.",
      "doi": "10.1016/j.chb.2017.02.029"
    },
    {
      "text": "Alan Grafen. 1990. Biological signals as handicaps. Journal of theoretical biology 144, 4 (1990), 517--546.",
      "doi": ""
    },
    {
      "text": "Tim Guilford and Marian Stamp Dawkins. 1991. Receiver psychology and the evolution of animal signals. Animal behaviour 42, 1 (1991), 1--14.",
      "doi": ""
    },
    {
      "text": "Tim Guilford and Marian Stamp Dawkins. 1995. What are conventional signals? Animal Behaviour 49, 6 (1995), 1689--1695.",
      "doi": ""
    },
    {
      "text": "Sara Hajian, Francesco Bonchi, and Carlos Castillo. 2016. Algorithmic bias: From discrimination discovery to fairness-aware data mining. In Proceedings of the 22nd ACM SIGKDD international conference on knowledge discovery and data mining. ACM, 2125--2126.",
      "doi": "10.1145/2939672.2945386"
    },
    {
      "text": "Jeffrey T Hancock and Philip J Dunham. 2001. Impression formation in computer-mediated communication revisited: An analysis of the breadth and intensity of impressions. Communication research 28, 3 (2001), 325--347.",
      "doi": ""
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond being there. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 119--125.",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Benjamin D. Horne, Sara Khedr, and Sibel Adali. 2018. Sampling the news producers: A large news and feature data set for the study of the complex media landscape. In Twelfth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Mi Rosie Jahng and Jeremy Littau. 2016. Interacting is believing: Interactivity, social cue, and perceptions of journalistic credibility on twitter. Journalism & Mass Communication Quarterly 93, 1 (2016), 38--58.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Sucheta Ghoshal, Amy Bruckman, and Eric Gilbert. 2018. Online harassment and content moderation: The case of blocklists. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 2 (2018), 12.",
      "doi": "10.1145/3185593"
    },
    {
      "text": "Cliff Lampe, Nicole Ellison, and Charles Steinfield. 2007. A familiar face (book): profile elements as signals in an online social network. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 435--444.",
      "doi": "10.1145/1240624.1240695"
    },
    {
      "text": "Kevin Munger. 2017. Tweetment effects on the tweeted: Experimentally reducing racist harassment. Political Behavior 39, 3 (2017), 629--649.",
      "doi": ""
    },
    {
      "text": "Dietmar Offenhuber and Judith Donath. 2007. Comment flow: visualizing communication along network path. Poster presented at IEEE InfoVis 7 (2007).",
      "doi": ""
    },
    {
      "text": "Maarten Sap, Dallas Card, Saadia Gabriel, Yejin Choi, and Noah A Smith. 2019. The risk of racial bias in hate speech detection. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics. 1668--1678.",
      "doi": ""
    },
    {
      "text": "Cuihua Shen, Peter Monge, and Dmitri Williams. 2014. Virtual brokerage and closure: Network structure and social capital in a massively multiplayer online game. Communication Research 41, 4 (2014), 459--480.",
      "doi": ""
    },
    {
      "text": "Aaron Smith, Laura Silver, Shawnee Cohn, and Stefan Cornibert. 2019. Publics in Emerging Economies Worry Social Media Sow Division, Even as They Offer New Chances for Political Engagement. (2019).",
      "doi": ""
    },
    {
      "text": "John Maynard Smith and DGC Harper. 1988. The evolution of aggression: can selection generate variability? Philosophical Transactions of the Royal Society of London. B, Biological Sciences 319, 1196 (1988), 557--570.",
      "doi": ""
    },
    {
      "text": "John Maynard Smith and David Harper. 2003. Animal signals. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Maynard J Smith and David GC Harper. 1995. Animal signals: models and terminology. Journal of theoretical biology 177, 3 (1995), 305--311.",
      "doi": ""
    },
    {
      "text": "Michael Spence. 1978. Job market signaling. In Uncertainty in economics. Elsevier, 281--306.",
      "doi": ""
    },
    {
      "text": "Nitasha Tiku and Casey Newton. 2015. Twitter CEO: ?We suck at dealing with abuse.\". The Verge 4, 2 (2015), 2015.",
      "doi": ""
    },
    {
      "text": "Stephanie Tom Tong, Brandon Van Der Heide, Lindsey Langwell, and Joseph B Walther. 2008. Too much of a good thing? The relationship between number of friends and interpersonal impressions on Facebook. Journal of computer-mediated communication 13, 3 (2008), 531--549.",
      "doi": ""
    },
    {
      "text": "Sonja Utz. 2010. Show me your friends and I will tell you what type of person you are: How one's profile, number of friends, and type of friends influence impression formation on social network sites. Journal of Computer-Mediated Communication 15, 2 (2010), 314--335.",
      "doi": ""
    },
    {
      "text": "Onur Varol, Emilio Ferrara, Clayton A Davis, Filippo Menczer, and Alessandro Flammini. 2017. Online human-bot interactions: Detection, estimation, and characterization. arXiv preprint arXiv:1703.03107 (2017).",
      "doi": ""
    },
    {
      "text": "Thorstein Veblen. 2017. The theory of the leisure class. Routledge.",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1996. Computer-mediated communication: Impersonal, interpersonal, and hyperpersonal interaction. Communication research 23, 1 (1996), 3--43.",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther and Malcolm R. Parks. 2002. Cues filtered out, cues filtered in. Handbook of interpersonal communication 3 (2002), 529--563.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther, Brandon Van Der Heide, Lauren M Hamel, and Hillary C Shulman. 2009. Self-generated versus other-generated statements and impressions in computer-mediated communication: A test of warranting theory using Facebook. Communication research 36, 2 (2009), 229--253.",
      "doi": ""
    },
    {
      "text": "Gang Wang, Manish Mohanlal, Christo Wilson, Xiao Wang, Miriam Metzger, Haitao Zheng, and Ben Y Zhao. 2012. Social turing tests: Crowdsourcing sybil detection. arXiv preprint arXiv:1205.3856 (2012).",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex machina: Personal attacks seen at scale. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1391--1399.",
      "doi": "10.1145/3038912.3052591"
    },
    {
      "text": "Amotz Zahavi. 1977. The cost of honesty (further remarks on the handicap principle). Journal of theoretical Biology 67, 3 (1977), 603--605.",
      "doi": ""
    },
    {
      "text": "Aaron Robert Zinman. 2011. Me, myself, and my hyperego: understanding people through the aggregation of their digital footprints. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    }
  ]
}