{
  "doi": "10.1145/3313831.3376745",
  "title": "Lawful Users: Copyright Circumvention and Legal Constraints on Technology Use",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "The study of human-computer interaction requires consideration of aspects of interactions with technology that may be outside of the control of both user and designer. One example of when a user's question of \"can I do this?\" may have an answer beyond technological affordances is that of legal constraints. This paper considers an example of this phenomenon: section 1201 of the Digital Millennium Copyright Act (DMCA) in the United States, which criminalizes circumventing copyright protection such as digital rights management (DRM). The DMCA also includes a triennial policymaking process that considers exemptions to the law to protect \"lawful users\" from adverse effects. Through an analysis of public comments of support for exemptions, this paper explores the ways in which users see the law as a hindrance to desired uses of technology. This analysis sheds light on users' expectations for rights of use, how these expectations clash with policy, and what this might mean for technology designers. Drawing lessons from the infrastructure problem in HCI, this paper concludes with laying out solutions that can both work within policy constraints, and more importantly, work to change them.",
  "tags": [
    "copyright",
    "policy",
    "infrastructure",
    "drm",
    "ownership",
    "law",
    "accessibility",
    "dmca"
  ],
  "authors": [
    {
      "name": "Casey Fiesler",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81464672606/rel-imgonly/caseyfiesler.jpg",
      "acmid": "81464672606",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark Ackerman. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human-Computer Interaction 15, (sep 2000), 179--203.",
      "doi": ""
    },
    {
      "text": "Todd C Adelmann. 2010. Are Your Bits Worn Out: The DMCA, Replacement Parts, and Forced Repeat Software Purchases. Journal on Telecommunications and High Technology Law 8 (2010), 185--214.",
      "doi": ""
    },
    {
      "text": "Nate Anderson. 2009. Landmark Study: DRM Truly Does Make Pirates Out of Us All. (2009). https://arstechnica.com/tech-policy/2009/05/ landmark-study-drm-truly-does-make-pirates-out-of-us-all/",
      "doi": ""
    },
    {
      "text": "Krzyztof Bebenek. 2016. Strong Wills, Weak Locks: Consumer Expectations and the DMCA Anticircumvention Regime. Berkeley Technology Law Journal 26, 3 (2016), 1457--1488.",
      "doi": ""
    },
    {
      "text": "Marek Bell, Matthew Chalmers, Louise Barkhuus, Malcolm Hall, Scott Sherwood, Paul Tennent, Barry Brown, Duncan Rowland, Steve Benford, Mauricio Capra, and others. 2006. Interweaving mobile games with everyday life. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. ACM, 417--426.",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Berco Beute. 2005. Mobile DRM - Usability Out the Door? Telematics and Informatics 22, 1--2 (2005), 83--96.",
      "doi": "10.1016/j.tele.2004.06.007"
    },
    {
      "text": "Alan F. Blackwell. 2006. The reification of metaphor as a design tool. ACM Transactions on Computer-Human Interaction 13, 4 (2006), 490--530.",
      "doi": "10.1145/1188816.1188820"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (apr 2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Joyram Chakraborty and Nirali M Chakraborty. 2015. Public policy and violence in video games. interactions 22, 1 (2015), 64--67.",
      "doi": ""
    },
    {
      "text": "Karen Temple Claggett. 2017. Section 1201 of Title 17: A Report of the Register of Copyrights. Technical Report. United States Copyright Office. https://www.copyright. gov/policy/1201/section-1201-full-report.pdf",
      "doi": ""
    },
    {
      "text": "W. Keith Edwards, Mark W. Newman, and Erika Shehan Poole. 2010. The Infrastructure Problem in HCI. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. Atlanta, GA, 423--432.",
      "doi": "10.1145/1753326.1753390"
    },
    {
      "text": "Casey Fiesler and Amy S. Bruckman. 2014. Remixers' Understandings of Fair Use Online. In Proceedings of the ACM CSCW Conference on Computer-Supported Cooperative Work & Social Computing. ACM Press, Baltimore, MD, 1023--1032.",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Jessica Feuston, and Amy S. Bruckman. 2015. Understanding Copyright Law in Online Creative Communities. In Proceedings of the ACM CSCW Conference on Computer-Supported Cooperative Work & Social Computing. Vancouver, BC, Canada, 116--129.",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Cliff Lampe, and Amy S. Bruckman. 2016. Reality and Perception of Copyright Terms of Service for Online Content Creation. In Proceedings of the ACM CSCW Conference on Computer-Supported Cooperative Work & Social Computing. 1450--1461.",
      "doi": ""
    },
    {
      "text": "Casey Fiesler and Nicholas Proferes. 2018. \"Participant\" Perceptions of Twitter Research Ethics. Social Media+ Society 4, 1 (2018), 2056305118763366.",
      "doi": ""
    },
    {
      "text": "Jon Garon. 2008. What If DRM Fails?: Seeking Patronage in the iWasteland and the Virtual O. Michigan State Law Review (2008), 103--151.",
      "doi": ""
    },
    {
      "text": "Urs Gasser and John Palfrey. 2007. Case Study: DRM-protected Music Interoperability and e-Innovation. Technical Report. Berkman Center Publication Series. 1--61 pages.",
      "doi": ""
    },
    {
      "text": "Anthony G. Giannoumi, Molly Land, Wondwossen M. Beyene, and Peter Blanck. 2017. Web Accessibility and Technology Protection Measures: Harmonizing the Rights of Persons with Cognitive Disabilities and Copyright Protections on the Web. Cyberpsychology 11, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Dan Goldstein, Eve Hill, Jonathan Lazar, David Lepofsky, Alice Siempelkamp, and Anne Taylor. 2011. Increasing Legal Requirements for Interface Accessibility. In Extended Abstracts of the ACM CHI Conference on Human Factors in Computing Systems. Vancouver, BC, Canada, 745--748.",
      "doi": ""
    },
    {
      "text": "James Grimmelmann. 2005. Regulation By Software. Yale Law Journal 114, 7 (2005), 1719--1758.",
      "doi": ""
    },
    {
      "text": "Alan Hedge. 2013. Ergonomics and US public policy. interactions 20, 1 (2013), 64--67.",
      "doi": ""
    },
    {
      "text": "Bill D. Herman and Oscar H. Gandy. 2006. Catch 2101: A Legislative History and Content Analysis of the DMCA Exemption Proceedings. Cardozo Arts & Entertainment Law Journal 24 (2006), 121--190.",
      "doi": ""
    },
    {
      "text": "Philip Inglesant and M Angela Sasse. 2007. Usability is the best policy: public policy and the lived experience of transport systems in London. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI... but not as we know it-Volume 1. British Computer Society, 35--44.",
      "doi": ""
    },
    {
      "text": "Steven J Jackson, Tarleton Gillespie, and Sandy Payette. 2014. The Policy Knot: Re-integrating Policy , Practice and Design in CSCW Studies of Social Computing. In Proceedings of the ACM CSCW Conference on Computer-Supported Cooperative Work & Social Computing. Baltimore, MD, 588--602.",
      "doi": "10.1145/2531602.2531674"
    },
    {
      "text": "Christopher Kelty. 2005. Trust Among the Algorithms: Ownership, Identity, and the Collaborative Stewardship of Information. In CODE: Collaborative Ownership and the Digital Economy. 127--154.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar. 2014. Engaging in Information Science Research That Informs Public Policy. The Library Quarterly: Information, Community, Policy 84, 4 (2014), 451--459.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Paul T Jaeger, Anthony Adams, Anthony Angelozzi, John Manohar, James Marciniak, Justin Murphy, Pouria Norasteh, Charles Olsen, Evangelos Poneres, and others. 2010. Up in the air: Are airlines following the new DOT rules on equal pricing for people with disabilities when websites are inaccessible? Government Information Quarterly 27, 4 (2010), 329--336.",
      "doi": ""
    },
    {
      "text": "Lawrence Lessig. 2006. Code: And other Laws of Cyberspace, Version 2.0. Basic Books, New York, NY.",
      "doi": "10.5555/556848"
    },
    {
      "text": "Ewa Luger, Lachlan Urquhart, Tom Rodden, and Michael Golembewski. 2015. Playing the Legal Card: Using Ideation Cards to Raise Data Protection Issues within the Design Process. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. Seoul, Korea, 457--466.",
      "doi": "10.1145/2702123.2702142"
    },
    {
      "text": "Jennifer A Nekuda Malik. 2017. Scientists initiate grassroots efforts to show importance of STEM to US government. MRS Bulletin 42, 8 (2017), 554--556.",
      "doi": ""
    },
    {
      "text": "Corinne L. Miller. 2008. The Video Game Industry and Video Game Culture Dichotomy: Reconciling Gaming Culture Norms with the Anti-Circumvention Measures of the DMCA. Texas Intellectual Property Law Journal 16, 453--480 (2008).",
      "doi": ""
    },
    {
      "text": "Deirde K. Mulligan, John Han, and Aaron J. Burstein. 2003. How DRM-based Content Delivery Systems Disrupt Expectations of Personal uUe. Proceedings of the ACM Workshop on Digital Rights Management (2003), 77--89.",
      "doi": "10.1145/947380.947391"
    },
    {
      "text": "William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012. Lost in Translation: Understanding the Possession of Digital Things in the Cloud. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. Austin, TX, 781--790.",
      "doi": "10.1145/2207676.2207789"
    },
    {
      "text": "Stephen J. Payne. 2003. Users' Mental Models: The Very Ideas. In HCI Models, Theories, and Frameworks: Toward a Multidisciplinary Science, John M. Carroll (Ed.). Morgan Kaufmann Publishers, San Francisco, CA, 135--156.",
      "doi": ""
    },
    {
      "text": "R. Anthony Reese. 2003. The First Sale Doctrine in the Era of Digital Networks. Boston University Law Review 44 (2003), 577--652.",
      "doi": ""
    },
    {
      "text": "P Samuelson. 1989. Protecting User Interfaces through Copyright: The Debate. Proceedings of the ACM CHI Conference on Human Factors in Computing Systems (1989), 97--104.",
      "doi": "10.1145/67449.67470"
    },
    {
      "text": "Pamela Samuelson. 2016a. Freedom to Tinker. Theoretical Inquiries in Law 17, 2 (2016), 563--600.",
      "doi": ""
    },
    {
      "text": "Pamela Samuelson. 2016b. New Exemptions to Anti-Circumvention Rules. Commun. ACM 59, 3 (2016), 24--26.",
      "doi": "10.1145/3000608"
    },
    {
      "text": "Molly Sauter. 2014. The Coming Swarm: DDOS Actions, Hacktivism, and Civil Disobedience on the Internet. Bloomsbury Publishing, New York, NY.",
      "doi": ""
    },
    {
      "text": "Truan Savage. 2014. Avoiding the Next Napster: Copyright Infringement and Investor Liability in the Age of User Generated Content. Michigan Business & Entrepreneurial Law Review 4, 2 (2014), 261--292.",
      "doi": ""
    },
    {
      "text": "Priti Trivedi. 2010. Writing The Wrong: What The E-Book Industry Can Learn From Digital Music's Mistakes With DRM. Journal of Law and Policy 18, 2 (2010), 925--967.",
      "doi": ""
    },
    {
      "text": "Lachlan Urquhart and Tom Rodden. 2017. New directions in information technology law: learning from human?computer interaction. International Review of Law, Computers and Technology 31, 2 (2017), 150--169.",
      "doi": "10.1080/13600869.2017.1298501"
    },
    {
      "text": "Jessica Vitak, Katie Shilton, and Z. Ashktorab. 2016. Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community. In Proceedings of the ACM CSCW Conference on Computer Supported Cooperative Work & Social Computing. San Franciso, CA, 941--953.",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). Redmond, WA, 1--16.",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Katherine Weigle. 2017. How the Digital Millennium Copyright Act Affects Cybersecurity. American University Intellectual Property Brief 9, 1 (2017), 1--24.",
      "doi": ""
    },
    {
      "text": "Langdon Winner. 1986. Do Artifacts Have Politics? In The Whale and the Reactor: A Search for Limits in the Age of High Technology. University of Chicago Press, Chicago, IL, 19--39.",
      "doi": ""
    }
  ]
}