{
  "doi": "10.1145/3313831.3376226",
  "title": "An Interaction Design for Machine Teaching to Develop AI Tutors",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Intelligent tutoring systems (ITSs) have consistently been shown to improve the educational outcomes of students when used alone or combined with traditional instruction. However, building an ITS is a time-consuming process which requires specialized knowledge of existing tools. Extant authoring methods, including the Cognitive Tutor Authoring Tools' (CTAT) example-tracing method and SimStudent's Authoring by Tutoring, use programming-by-demonstration to allow authors to build ITSs more quickly than they could by hand programming with model-tracing. Yet these methods still suffer from long authoring times or difficulty creating complete models. In this study, we demonstrate that Simulated Learners built with the Apprentice Learner (AL) Framework can be combined with a novel interaction design that emphasizes model transparency, input flexibility, and problem solving control to enable authors to achieve greater model completeness in less time than existing authoring methods.",
  "authors": [
    {
      "name": "Daniel Weitekamp",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527778",
      "orcid": "missing"
    },
    {
      "name": "Erik Harpstead",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81556624856/rel-imgonly/img_1675c.jpg",
      "acmid": "81556624856",
      "orcid": "missing"
    },
    {
      "name": "Ken R. Koedinger",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100484653/rel-imgonly/img_3518.jpeg",
      "acmid": "81100484653",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Vincent Aleven, Bruce M. McLaren, Jonathan Sewall, and Kenneth R. Koedinger. 2006. The Cognitive Tutor Authoring Tools (CTAT): Preliminary Evaluation of Efficiency Gains. In International Conference on Intelligent Tutoring Systems. Springer, 61--70.",
      "doi": ""
    },
    {
      "text": "Vincent Aleven, Bruce M. McLaren, Jonathan Sewall, Martin Van Velsen, Octav Popescu, Sandra Demi, Michael Ringenberg, and Kenneth R Koedinger. 2016. Example-Tracing Tutors: Intelligent Tutor Development for Non-Programmers. International Journal of Artificial Intelligence in Education 26, 1 (2016), 224--269.",
      "doi": ""
    },
    {
      "text": "John R. Anderson. 1996. ACT: A Simple Theory of Complex Cognition. American Psychologist 51, 4 (1996), 355.",
      "doi": ""
    },
    {
      "text": "Leo Breiman. 2017. Classification and Regression Trees. Routledge.",
      "doi": ""
    },
    {
      "text": "Albert T. Corbett, John R. Anderson, and Alison T. O'Brien. 1995. Student Modeling in the ACT Programming Tutor. Cognitively Diagnostic Assessment (1995), 19--41.",
      "doi": ""
    },
    {
      "text": "Allen Cypher and Daniel Conrad Halbert. 1993. Watch What I Do: Programming by Demonstration. MIT press.",
      "doi": "10.5555/168080"
    },
    {
      "text": "Kenneth R Koedinger, John R Anderson, William H Hadley, and Mary A Mark. 1997. Intelligent Tutoring Goes To School in the Big City. (1997).",
      "doi": ""
    },
    {
      "text": "Kenneth R Koedinger, Noboru Matsuda, Christopher J. MacLellan, and Elizabeth A. McLaughlin. 2015. Methods for Evaluating Simulated Learners: Examples from SimStudent.. In AIED Workshops.",
      "doi": ""
    },
    {
      "text": "John E. Laird, Kevin Gluck, John Anderson, Kenneth D. Forbus, Odest Chadwicke Jenkins, Christian Lebiere, Dario Salvucci, Matthias Scheutz, Andrea Thomaz, Greg Trafton, Robert E. Wray, Shiwali Mohan, and James R. Kirk. 2017. Interactive Task Learning. IEEE Intelligent Systems 32, 4 (2017), 6--21. DOI: http://dx.doi.org/10.1109/MIS.2017.3121552",
      "doi": "10.1109/MIS.2017.3121552"
    },
    {
      "text": "Tessa Lau, Steven A. Wolfman, Pedro Domingos, and Daniel S. Weld. 2001. Learning Repetitive Text-editing Procedures with SMARTedit. In Your Wish is My Command. Elsevier, 209--XI.",
      "doi": "10.5555/369505.369519"
    },
    {
      "text": "Toby Jia-Jun Li, Amos Azaria, and Brad A. Myers. 2017. SUGILITE: Creating Multimodal Smartphone Automation by Demonstration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6038--6049.",
      "doi": ""
    },
    {
      "text": "Wenting Ma, Olusola O Adesope, John C Nesbit, and Qing Liu. 2014. Intelligent Tutoring Systems and Learning Outcomes: A Meta-Analysis. Journal of Educational Psychology 106, 4 (2014), 901.",
      "doi": ""
    },
    {
      "text": "Christopher J MacLellan. 2017. Computational Models of Human Learning: Applications for Tutor Development, Behavior Prediction, and Theory Testing. Ph.D. Dissertation. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Christopher J MacLellan, Erik Harpstead, Robert P Marinier III, and Kenneth R Koedinger. 2018. A Framework for Natural Cognitive System Training Interactions. Advances in Cognitive Systems 6 (2018), 1--16.",
      "doi": ""
    },
    {
      "text": "Christopher J Maclellan, Erik Harpstead, Rony Patel, and Kenneth R Koedinger. 2016. The Apprentice Learner Architecture: Closing the Loop between Learning Theory and Educational Data. International Educational Data Mining Society (2016).",
      "doi": ""
    },
    {
      "text": "Christopher J MacLellan, Erik Harpstead, Eliane Stampfer Wiese, Mengfan Zou, Noboru Matsuda, Vincent Aleven, and Kenneth R Koedinger. 2015. Authoring Tutors with Complex Solutions: A Comparative Analysis of Example Tracing and SimStudent. In The 2nd AIED Workshop on Simulated Learners. CEUR-WS.org, Madrid, Spain.",
      "doi": ""
    },
    {
      "text": "Christopher J MacLellan, Kenneth R Koedinger, and Noboru Matsuda. 2014. Authoring Tutors with SimStudent: An Evaluation of Efficiency and Model Quality. In International Conference on Intelligent Tutoring Systems. Springer, 551--560.",
      "doi": ""
    },
    {
      "text": "Noboru Matsuda, William W Cohen, and Kenneth R Koedinger. 2015. Teaching the Teacher: Tutoring SimStudent Leads to More Effective Cognitive Tutor Authoring. International Journal of Artificial Intelligence in Education 25, 1 (2015), 1--34.",
      "doi": ""
    },
    {
      "text": "Richard G McDaniel and Brad A Myers. 1997. Gamut: Demonstrating Whole Applications. In Symposium on User Interface Software and Technology: Proceedings of the 10 th annual ACM symposium on User interface software and technology, Vol. 14. 81--82.",
      "doi": ""
    },
    {
      "text": "Tom M Mitchell. 1982. Generalization as Search. Artificial Intelligence 18, 2 (1982), 203--226.",
      "doi": ""
    },
    {
      "text": "Stephen Muggleton. 1991. Inductive Logic Programming. New Generation Computing 8, 4 (1991), 295--318.",
      "doi": "10.1007/BF03037089"
    },
    {
      "text": "Tom Murray. 2003. An Overview of Intelligent Tutoring System Authoring Tools: Updated Analysis of the State of the Art. In Authoring Tools for Advanced Technology Learning Environments. Springer, 491--544.",
      "doi": ""
    },
    {
      "text": "Brad A Myers. 1986. Visual Programming, Programming by Example, and Program Visualization: a Taxonomy. In ACM SIGCHI Bulletin, Vol. 17. ACM, 59--66.",
      "doi": "10.1145/22627.22349"
    },
    {
      "text": "John F. Pane, Beth Ann Griffin, Daniel F. McCaffrey, and Rita Karam. 2014. Effectiveness of Cognitive Tutor Algebra I at Scale. Educational Evaluation and Policy Analysis 36, 2 (2014), 127--144.",
      "doi": ""
    },
    {
      "text": "Steven Ritter, John R. Anderson, Kenneth R. Koedinger, and Albert Corbett. 2007. Cognitive Tutor: Applied Research in Mathematics Education. Psychonomic Bulletin & Review 14, 2 (2007), 249--255.",
      "doi": ""
    },
    {
      "text": "Herbert A Simon. 1983. Why Should Machines Learn? In Machine Learning. Elsevier, 25--37.",
      "doi": ""
    },
    {
      "text": "Kurt VanLehn. 2006. The Behavior of Tutoring Systems. International Journal of Artificial Intelligence in Education 16, 3 (2006), 227--265.",
      "doi": "10.5555/1435351.1435353"
    }
  ]
}