{
  "doi": "10.1145/3313831.3376692",
  "title": "Design Investigation of Embroidered Interactive Elements on Non-Wearable Textile Interfaces",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "As smart textiles are becoming more present in our lives, investigating and designing textile interfaces has started getting more and more attention. Still, very little research has been done on how to design interactive elements for non-wearable textile interfaces for the best recognition, perception, and interaction. In this paper, we present initial assumptions for designing such interfaces, which we derived from working intensively with our partners from the industry. These have been further explored with experts from the field during interviews, and finally tested in a user study. As a conclusion of the study, we define five design recommendations for textile interfaces and present several prototypes that demonstrate them in practice. Our recommendations cover tactile contrast between textures, heights, and shapes; minimal recognizable size of elements; perception of concave and convex shapes as interactive elements; indication of interaction through shape; and recognition of tactile symbols.",
  "tags": [
    "non-wearables",
    "smart textiles",
    "embroidery",
    "textile interfaces",
    "expert interviews",
    "design recommendations",
    "user study"
  ],
  "authors": [
    {
      "name": "Sara Mlakar",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527747",
      "orcid": "missing"
    },
    {
      "name": "Michael Haller",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/do/10.1145/contrib-81100048383/rel-imgonly/michael_-_closeup640.jpg",
      "acmid": "81100048383",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Atkinson, D., Baurley, S., Petreca, B.B., Berthouze, N.B. and Watkins, P. 2016. The tactile triangle: a design research framework demonstrated through tactile comparisons of textile materials. J. of Design Research. 14, 2 (Jun. 2016), 142. DOI:https://doi.org/10.1504/JDR.2016.077015.",
      "doi": ""
    },
    {
      "text": "Breitschaft, S.J., Clarke, S. and Carbon, C.-C. 2019. A Theoretical Framework of Haptic Processing in Automotive User Interfaces and Its Implications on Design and Engineering. Frontiers in Psychology. 10, (Jul. 2019). DOI:https://doi.org/10.3389/fpsyg.2019.01470.",
      "doi": ""
    },
    {
      "text": "Carter, J. and Erp, J. 2006. Ergonomics of Tactile and Haptic Interactions. Proceedings of the Human Factors and Ergonomics Society Annual Meeting. 50, 5 (Oct. 2006), 674--675. DOI:https://doi.org/10.1177/154193120605000512.",
      "doi": ""
    },
    {
      "text": "Challis, B.P. and Edwards, A.D.N. 2001. Design principles for tactile interaction. 17--24.",
      "doi": ""
    },
    {
      "text": "Chang, D., Nesbitt, K. V and Wilkins, K. 2007. The Gestalt Principles of Similarity and Proximity Apply to Both the Haptic and Visual Grouping of Elements. Proceedings of the Eight Australasian Conference on User Interface - Volume 64 (Darlinghurst, Australia, Australia, 2007), 79--86.",
      "doi": ""
    },
    {
      "text": "Chouvardas, V.G., Miliou, A.N. and Hatalis, M.K. 2005. Tactile display applications: a state of the art survey. in Proc. 2nd Balkan Conf. in Informatics. January (2005), 290--303.",
      "doi": ""
    },
    {
      "text": "Dakova, S. and Dumont, N. An Overview of Textile Interfaces.",
      "doi": ""
    },
    {
      "text": "Devendorf, L., Ryokai, K., Lo, J., Howell, N., Lee, J.L., Gong, N.-W., Karagozler, M.E., Fukuhara, S., Poupyrev, I. and Paulos, E. 2016. ?I don't Want to Wear a Screen.\" Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (New York, New York, USA, 2016), 6028--6039.",
      "doi": ""
    },
    {
      "text": "Gilliland, S., Komor, N., Starner, T. and Zeagler, C. 2010. The Textile Interface Swatchbook: Creating graphical user interface-like widgets with conductive embroidery. International Symposium on Wearable Computers (ISWC) 2010 (Oct. 2010), 1--8.",
      "doi": ""
    },
    {
      "text": "Hamdan, N.A., Voelker, S. and Borchers, J. 2018. Sketch&Stitch. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (New York, New York, USA, New York, USA, 2018), 1--13.",
      "doi": ""
    },
    {
      "text": "Holleis, P., Schmidt, A., Paasovaara, S., Puikkonen, A. and Häkkilä, J. 2008. Evaluating capacitive touch input on clothes. Proceedings of the 10th international conference on Human computer interaction with mobile devices and services - MobileHCI '08 (New York, New York, USA, 2008), 81.",
      "doi": "10.1145/1409240.1409250"
    },
    {
      "text": "Holloway, L., Marriott, K. and Butler, M. 2018. Accessible Maps for the Blind. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (New York, New York, USA, 2018), 1--13.",
      "doi": ""
    },
    {
      "text": "Kalantari, F., Grisoni, L., Giraud, F. and Rekik, Y. 2016. Finding the Minimum Perceivable Size of a Tactile Element on an Ultrasonic Based Haptic Tablet. Proceedings of the 2016 ACM on Interactive Surfaces and Spaces - ISS '16 (New York, New York, USA, 2016), 379--384.",
      "doi": "10.1145/2992154.2996785"
    },
    {
      "text": "Learn to Create Accessible Websites with the Principles of Universal Design: 2019. https://www.interaction-design.org/literature/article/learn-to-create-accessible-websites-with-the-principles-of-universal-design. Accessed: 2019-09-09.",
      "doi": ""
    },
    {
      "text": "Lederman, S.J. and Kinch, D.H. 1979. Texture in tactual maps and graphics for the visualy handicapped. Journal of Visual Impairment & Blindness. 73, 6 (1979), 217--227.",
      "doi": ""
    },
    {
      "text": "Lederman, S.J. and Klatzky, R.L. 2009. Haptic perception: A tutorial. Attention, Perception & Psychophysics. 71, 7 (Oct. 2009), 1439--1459. DOI:https://doi.org/10.3758/APP.71.7.1439.",
      "doi": ""
    },
    {
      "text": "Lee, S. \"Claire\" and Starner, T. 2010. BuzzWear. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10 (New York, New York, USA, 2010), 433.",
      "doi": ""
    },
    {
      "text": "Leong, J., Parzer, P., Perteneder, F., Babic, T., Rendl, C., Vogl, A., Egger, H., Olwal, A. and Haller, M. 2016. proCover. Proceedings of the 29th Annual Symposium on User Interface Software and Technology - UIST '16 (New York, New York, USA, 2016), 335--346.",
      "doi": ""
    },
    {
      "text": "Loss, C., Gonçalves, R., Lopes, C., Pinho, P. and Salvado, R. 2016. Smart Coat with a Fully-Embedded Textile Antenna for IoT Applications. Sensors. 16, 6 (Jun. 2016), 938. DOI:https://doi.org/10.3390/s16060938.",
      "doi": ""
    },
    {
      "text": "MacLean, K.E. 2008. Haptic Interaction Design for Everyday Interfaces. Reviews of Human Factors and Ergonomics. 4, 1 (Oct. 2008), 149--194. DOI:https://doi.org/10.1518/155723408X342826.",
      "doi": ""
    },
    {
      "text": "McDonald, S., Dutterer, J., Abdolrahmani, A., Kane, S.K. and Hurst, A. 2014. Tactile aids for visually impaired graphical design education. Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility - ASSETS '14 (New York, New York, USA, 2014), 275--276.",
      "doi": "10.1145/2661334.2661392"
    },
    {
      "text": "Mečnika, V. and Dipl, M.H. 2014. Smart textiles for healthcare?: applications and technologies. Rural Environment, Education, Personality. (2014), 7--8.",
      "doi": ""
    },
    {
      "text": "Miller, G.A. 1956. The magical number seven, plus or minus two: some limits on our capacity for processing information. Psychological Review. 63, 2 (1956), 81--97. DOI:https://doi.org/10.1037/h0043158.",
      "doi": ""
    },
    {
      "text": "Ng, A. and Brewster, S.A. 2016. Investigating Pressure Input and Haptic Feedback for In-Car Touchscreens and Touch Surfaces. Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications - Automotive'UI 16 (New York, New York, USA, 2016), 121--128.",
      "doi": "10.1145/3003715.3005420"
    },
    {
      "text": "Nolan, C.Y. and Morris, J.E. 1971. Improvement of Tactual Symbols for Blind Children. Final Report. (1971), 88.",
      "doi": ""
    },
    {
      "text": "Norman, D. 2013. The Design of Everyday Things: Revised and Expanded Edition. Basic Books.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Poupyrev, I., Gong, N.-W., Fukuhara, S., Karagozler, M.E., Schwesig, C. and Robinson, K.E. 2016. Project Jacquard. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (New York, New York, USA, 2016), 4216--4227.",
      "doi": ""
    },
    {
      "text": "Tactile Interaction: https://www.interaction-design.org/literature/book/the-encyclopedia-of-human-computer-interaction-2nd-ed/tactile-interaction. Accessed: 2019-08-05.",
      "doi": ""
    },
    {
      "text": "The MAYA Principle: Design for the Future, but Balance it with Your Users' Present: 2019. https://www.interaction-design.org/literature/article/design-for-the-future-but-balance-it-with-your-users-present.",
      "doi": ""
    },
    {
      "text": "Tomico, O. and Wilde, D. 2016. Soft, embodied, situated & connected: enriching interactions with soft wearables. mUX: The Journal of Mobile User Experience. 5, 1 (Dec. 2016), 3. DOI:https://doi.org/10.1186/s13678-016-0006-z.",
      "doi": ""
    },
    {
      "text": "Zeagler, C., Gilliland, S., Profita, H. and Starner, T. 2012. Textile Interfaces: Embroidered Jog-Wheel, Beaded Tilt Sensor, Twisted Pair Ribbon, and Sound Sequins. 2012 16th International Symposium on Wearable Computers (Jun. 2012), 60--63.",
      "doi": "10.1109/ISWC.2012.29"
    }
  ]
}