{
  "doi": "10.1145/3313831.3376387",
  "title": "Sensock: 3D Foot Reconstruction with Flexible Sensors",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Capturing 3D foot models is important for applications such as manufacturing customized shoes and creating clubfoot orthotics. In this paper, we propose a novel prototype, Sensock, to offer a fully wearable solution for the task of 3D foot reconstruction. The prototype consists of four soft stretchable sensors, made from silk fibroin yarn. We identify four characteristic foot girths based on the existing knowledge of foot anatomy, and measure their lengths with the resistance value of the stretchable sensors. A learning-based model is trained offline and maps the foot girths to the corresponding 3D foot shapes. We compare our method with existing solutions using red-green-blue (RGB) or RGBD (RGB-depth) cameras, and show the advantages of our method in terms of both efficiency and accuracy. In the user experiment, we find that the relative error of Sensock is lower than 0.55%. It performs consistently across different trials and is considered comfortable and suitable for long-term wearing.",
  "tags": [
    "3d reconstruction",
    "flexible sensors",
    "foot modeling"
  ],
  "authors": [
    {
      "name": "Hechuan Zhang",
      "institution": "Xiamen University, Xiamen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528553",
      "orcid": "missing"
    },
    {
      "name": "Zhiyong Chen",
      "institution": "Xiamen University, Xiamen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526593",
      "orcid": "missing"
    },
    {
      "name": "Shihui Guo",
      "institution": "Xiamen University, Xiamen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81554587256",
      "orcid": "missing"
    },
    {
      "name": "Juncong Lin",
      "institution": "Xiamen University, Xiamen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556497656",
      "orcid": "missing"
    },
    {
      "name": "Yating Shi",
      "institution": "Xiamen University, Xiamen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529000",
      "orcid": "missing"
    },
    {
      "name": "Xiangyang Liu",
      "institution": "Xiamen University, Xiamen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527039",
      "orcid": "missing"
    },
    {
      "name": "Yong Ma",
      "institution": "Jiangxi Normal University, Nanchang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529650",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Deepti Aggarwal, Weiyi Zhang, Thuong Hoang, Bernd Ploderer, Frank Vetere, and Mark Bradford. Sophy: a wearable technology for lower limb assessment in video consultations of physiotherapy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, pages 3916--3928. ACM, 2017.",
      "doi": "10.1145/3025453.3025489"
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. Digital fabrication of soft actuated objects by machine knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 184. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Swamy Ananthanarayan, Miranda Sheh, Alice Chien, Halley Profita, and Katie Siek. Pt viz: towards a wearable device for visualizing knee rehabilitation exercises. In Proceedings of the 2013 CHI Conference on Human Factors in Computing Systems, pages 1247--1250. ACM, 2013.",
      "doi": "10.1145/2470654.2466161"
    },
    {
      "text": "Moritz Bächer, Benjamin Hepp, Fabrizio Pece, Paul G Kry, Bernd Bickel, Bernhard Thomaszewski, and Otmar Hilliges. Defsense: Computational design of customized deformable input devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, pages 3806--3816. ACM, 2016.",
      "doi": "10.1145/2858036.2858354"
    },
    {
      "text": "Alfredo Ballester, Eduardo Parrilla, Julio A Vivas, Ana Pierola, Jordi Uriel, Sergio A Puigcerver, Paola Piqueras, C Solve, Marisol Rodriguez, Juan C Gonzalez, et al. Low-cost data-driven 3d reconstruction and its applications. In Proceedings of 6th International Conference on 3D Body Scanning Technologies, Lugano, Switzerland, 2015.",
      "doi": ""
    },
    {
      "text": "Alfredo BALLESTER, Ana PIÉROLA, Eduardo PARRILLA, Mateo IZQUIERDO, Jordi URIEL, Beatriz NÁCHER, Vicent ORTIZ, Juan C GONZÁLEZ, Álvaro F PAGE, and Sandra ALEMANY. Fast, portable and low-cost 3d foot digitizers: Validity and reliability of measurements. In 8th International Conference and Exhibition on 3D Body Scanning and Processing Technologies, pages 1--8. 3DBODY.TECH2019, 2017.",
      "doi": ""
    },
    {
      "text": "John Brooke et al. Sus-a quick and dirty usability scale. Usability Evaluation in Industry, 189(194):4--7, 1996.",
      "doi": ""
    },
    {
      "text": "Feng-Tsung Cheng and Der-Baau Perng. A systematic approach for developing a foot size information system for shoe last design. International Journal of Industrial Ergonomics, 25(2):171--185, 2000.",
      "doi": ""
    },
    {
      "text": "Instituto de Biomecanica de Valencia. 3d avatar feet. https://antropometria.ibv.org/en/3d-avatar-feet-en/. Accessed Sep 19, 2019.",
      "doi": ""
    },
    {
      "text": "Artem Dementyev, Hsin-Liu Cindy Kao, and Joseph A Paradiso. Sensortape: Modular and programmable 3d-aware dense sensor network on a tape. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, pages 649--658. ACM, 2015.",
      "doi": "10.1145/2807442.2807507"
    },
    {
      "text": "Jiachun Du, Panos Markopoulos, Qi Wang, Marina Toeters, and Ting Gong. Shapetex: implementing shape-changing structures in fabric for wearable actuation. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction, pages 166--176. ACM, 2018.",
      "doi": "10.1145/3173225.3173245"
    },
    {
      "text": "Lucy E Dunne. Making with fabric: Foundations of soft goods and e-textiles fabrication. In Proceedings of the 2019 CHI Conference Extended Abstracts on Human Factors in Computing Systems, page C02. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Gao Fei, Wang Qing, Geng Weidong, and Pan Yunhe. Acquisition of time-varying 3d foot shapes from video. Scientia Sinica Informationis, 41(6):659--674, 2011.",
      "doi": ""
    },
    {
      "text": "Tiago Fernández-Caramés and Paula Fraga-Lamas. Towards the internet-of-smart-clothing: A review on iot wearables and garments for creating intelligent connected e-textiles. Electronics, 7(12):405, 2018.",
      "doi": ""
    },
    {
      "text": "Rachel Freire, Paul Strohmeier, Cedric Honnet, Jarrod Knibbe, and Sophia Brueckner. Designing etextiles for the body: Shape, volume & motion. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction, pages 728--731. ACM, 2018.",
      "doi": "10.1145/3173225.3173331"
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. Adacad: Crafting software for smart textiles design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 345. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Oliver Glauser, Daniele Panozzo, Otmar Hilliges, and Olga Sorkine-Hornung. Deformation capture via soft and stretchable sensor arrays. ACM Transactions on Graphics (TOG), 38(2):16, 2019.",
      "doi": ""
    },
    {
      "text": "Oliver Glauser, Shihao Wu, Daniele Panozzo, Otmar Hilliges, and Olga Sorkine-Hornung. Interactive hand pose estimation using a stretch-sensing soft glove. ACM Transactions on Graphics (TOG), 38(4):41, 2019.",
      "doi": ""
    },
    {
      "text": "Kristian Gohlke and Eva Hornecker. A stretch-flexible textile multitouch sensor for user input on inflatable membrane structures & non-planar surfaces. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings, pages 191--193. ACM, 2018.",
      "doi": "10.1145/3266037.3271647"
    },
    {
      "text": "Carlos Gonçalves, Alexandre Ferreira da Silva, João Gomes, and Ricardo Simoes. Wearable e-textile technologies: A review on sensors, actuators and control elements. Inventions, 3(1):14, 2018.",
      "doi": ""
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. Sketch&stitch: Interactive embroidery for e-textiles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, page 82. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Chen Hou, Zijie Xu, Wu Qiu, Ronghui Wu, Yanan Wang, Qingchi Xu, Xiang Yang Liu, and Wenxi Guo. A biodegradable and stretchable protein-based sensor as artificial electronic skin for human motion detection. Small, 15(11):1805084, 2019.",
      "doi": ""
    },
    {
      "text": "Matija Jezersek and Janez Mozina. High-speed measurement of foot shape based on multiple-laser-plane triangulation. Optical Engineering, 48(11):113604, 2009.",
      "doi": ""
    },
    {
      "text": "Makoto Kimura, Masaaki Mochimaru, and Takeo Kanade. 3d measurement of feature cross-sections of foot while walking. Machine Vision and Applications, 22(2):377--388, 2011.",
      "doi": "10.1007/s00138-009-0238-3"
    },
    {
      "text": "Joanne Leong, Patrick Parzer, Florian Perteneder, Teo Babic, Christian Rendl, Anita Vogl, Hubert Egger, Alex Olwal, and Michael Haller. procover: sensory augmentation of prosthetic limbs using smart textile covers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, pages 335--346. ACM, 2016.",
      "doi": "10.1145/2984511.2984572"
    },
    {
      "text": "Ameersing Luximon and Ravindra S Goonetilleke. Foot shape modeling. Human Factors, 46(2):304--315, 2004.",
      "doi": ""
    },
    {
      "text": "Ameersing Luximon, Ravindra S Goonetilleke, and Ming Zhang. 3d foot shape generation from 2d information. Ergonomics, 48(6):625--641, 2005.",
      "doi": ""
    },
    {
      "text": "Jussi Mikkonen and Riikka Townsend. Frequency-based design of smart textiles. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 294. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Steven Nagels, Raf Ramakers, Kris Luyten, and Wim Deferme. Silicone devices: A scalable diy approach for fabricating self-contained multi-layered soft circuits using microfluidics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, page 188. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Botjan Novak, Janez Moina, and Matija Jezerek. 3d laser measurements of bare and shod feet during walking. Gait & posture, 40(1):87--93, 2014.",
      "doi": ""
    },
    {
      "text": "Alex Olwal, Jon Moeller, Greg Priest-Dorman, Thad Starner, and Ben Carroll. I/o braid: Scalable touch-sensitive lighted cords using spiraling, repeating sensing textiles and fiber optics. In The 31st Annual ACM Symposium on User Interface Software and Technology, pages 485--497. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Daniel Oran, Don Derek Haddad, Joseph Paradiso, and Hiroshi Ishii. Sensorknit: Architecting textile sensors with machine knitting. 3D Printing and Additive Manufacturing, 6(1):1--11, 2019.",
      "doi": ""
    },
    {
      "text": "Eduardo Parrilla, Alfredo Ballester, Clara Solves-Camallonga, Beatriz Nácher, Sergio Antonio Puigcerver, Jordi Uriel, Ana Piérola, Juan Carlos González, and Sandra Alemany. Low-cost 3d foot scanner using a mobile app. Footwear Science, 7(sup1):S26--S28, 2015.",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, et al. Resi: A highly flexible, pressure-sensitive, imperceptible textile interface based on resistive yarns. In The 31st Annual ACM Symposium on User Interface Software and Technology, pages 745--756. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal, and Michael Haller. Flextiles: a flexible, stretchable, formable, pressure-sensitive, tactile input sensor. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, pages 3754--3757. ACM, 2016.",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. Smartsleeve: real-time sensing of surface and deformation gestures on flexible, interactive textiles, using a hybrid gesture detection pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology, pages 565--577. ACM, 2017.",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E Robinson. Project jacquard: interactive digital textiles at scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, pages 4216--4227. ACM, 2016.",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Kathleen M Robinette, Hans Daanen, and Eric Paquet. The caesar project: a 3-d surface anthropometry survey. In Second International Conference on 3-D Digital Imaging and Modeling (Cat. No. PR00062), pages 380--386. IEEE, 1999.",
      "doi": ""
    },
    {
      "text": "María José Rupérez, Carlos Monserrat, Sandra Alemany, Mari C Juan, and M Alcañíz. Contact model, fit process and, foot animation for the virtual simulator of the footwear comfort. Computer-Aided Design, 42(5):425--431, 2010.",
      "doi": "10.1016/j.cad.2009.09.003"
    },
    {
      "text": "Timo Schmeltzpfenning, Clemens Plank, Inga Krauss, Petra Aswendt, and Stefan Grau. Dynamic foot scanning: A new approach for measurement of the human foot shape while walking. 2009.",
      "doi": ""
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. Flexibles: deformation-aware 3d-printed tangibles for capacitive touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, pages 1001--1014. ACM, 2017.",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Stefan Schneegass and Alexandra Voit. Gesturesleeve: using touch sensitive fabrics for gestural input on the forearm for controlling smartwatches. In Proceedings of the 2016 ACM International Symposium on Wearable Computers, pages 108--115. ACM, 2016.",
      "doi": "10.1145/2971763.2971797"
    },
    {
      "text": "Fereshteh Shahmiri, Chaoyu Chen, Anandghan Waghmare, Dingtian Zhang, Shivan Mittal, Steven L Zhang, Yi-Cheng Wang, Zhong Lin Wang, Thad E Starner, and Gregory D Abowd. Serpentine: A self-powered reversibly deformable cord sensor for human input. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 545. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Sophie Skach, Rebecca Stewart, and Patrick GT Healey. Smart arse: Posture classification with textile sensors in trousers. In Proceedings of the 2018 on International Conference on Multimodal Interaction, pages 116--124. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Robert W Sumner and Jovan Popovi´ c. Deformation transfer for triangle meshes. ACM Transactions on graphics (TOG), 23(3):399--405, 2004.",
      "doi": ""
    },
    {
      "text": "Zahari Taha, Mohd Azri Aris, Zulkifli Ahmad, Mohd Hasnun Arif Hassan, and Nina Nadia Sahim. A low cost 3d foot scanner for custom-made sports shoes. In Applied Mechanics and Materials, volume 440, pages 369--372. Trans Tech Publ, 2014.",
      "doi": ""
    },
    {
      "text": "Chung-Shing Wang. An analysis and evaluation of fitness for shoe lasts and human feet. Computers in industry, 61(6):532--540, 2010.",
      "doi": "10.1016/j.compind.2010.03.003"
    },
    {
      "text": "Jiahui Wang, Hideo Saito, Makoto Kimura, Masaaki Mochimaru, and Takeo Kanade. Shape reconstruction of human foot from multi-camera images based on pca of human shape database. In Fifth International Conference on 3-D Digital Imaging and Modeling (3DIM'05), pages 424--431. IEEE, 2005.",
      "doi": "10.1109/3DIM.2005.73"
    },
    {
      "text": "Mo Wang, Xin'an Wang, Zhuochen Fan, Sixu Zhang, Chen Peng, and Zhong Liu. A 3d foot shape feature parameter measurement algorithm based on kinect2. EURASIP Journal on Image and Video Processing, 2018(1):119, 2018.",
      "doi": ""
    },
    {
      "text": "Qi Wang, Marina Toeters, Wei Chen, Annick Timmermans, and Panos Markopoulos. Zishi: a smart garment for posture monitoring. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, pages 3792--3795. ACM, 2016.",
      "doi": "10.1145/2851581.2890262"
    },
    {
      "text": "Martin Weigel and Jürgen Steimle. Deformwear: Deformation input on tiny wearable devices. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 1(2):28, 2017.",
      "doi": ""
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E Mackay. Stretchis: Fabricating highly stretchable user interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, pages 697--704. ACM, 2016.",
      "doi": "10.1145/2984511.2984521"
    },
    {
      "text": "Ronghui Wu, Liyun Ma, Chen Hou, Zhaohui Meng, Wenxi Guo, Weidong Yu, Rui Yu, Fan Hu, and Xiang Yang Liu. Silk composite electronic textile sensor for high space precision 2d combo temperature--pressure sensing. Small, page 1901558, 2019.",
      "doi": ""
    },
    {
      "text": "Roshna E Wunderlich and Peter R Cavanagh. Gender differences in adult foot shape: implications for shoe design. Medicine and Science in Sports and Exercise, 33(4):605--611, 2001.",
      "doi": ""
    },
    {
      "text": "Sang Ho Yoon, Ke Huo, Yunbo Zhang, Guiming Chen, Luis Paredes, Subramanian Chidambaram, and Karthik Ramani. isoft: a customizable soft sensor with real-time continuous contact and stretching sensing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology, pages 665--678. ACM, 2017.",
      "doi": "10.1145/3126594.3126654"
    },
    {
      "text": "Yuji Yoshida, Shunta Saito, Yoshimitsu Aoki, Makiko Kouchi, and Masaaki Mochimaru. Shape completion and modeling of 3d foot shape while walking. In 2012 International Symposium on Optomechatronic Technologies (ISOT 2012), pages 1--3. IEEE, 2012.",
      "doi": ""
    }
  ]
}