{
  "doi": "10.1145/3313831.3376337",
  "title": "\"I Feel Like This is a Bad Thing\": Investigating Disassembly in Action for Novices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Materials are dynamic-they can be shaped and changed. Often however, our tools and technologies appear to fix materials in place. Disassembly is one practice that provides openings to explore and understand the dynamic nature of material. In this research, we investigate possibilities that emerge from disassembly. Specifically, we studied how novices disassembled a common digital artifact-desktop printers. We worked with 21 young people and family members across two evening workshops at a middle school. We report on the workshop interactions, categories of actions of disassembly, and four in-depth vignettes showcasing disassembly in action. In the discussion, we reflect on disassembly and permission, sustainability, the joy of disassembling, and design considerations in support of disassembly. Our contributions include: (1) extending existing theoretical framings about artifacts and materials; (2) an empirical study documenting the process by which novices disassemble; and (3) preliminary design and policy considerations that enable disassembly.",
  "authors": [
    {
      "name": "Nick Logler",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261966",
      "orcid": "missing"
    },
    {
      "name": "Caroline Pitt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659045615/rel-imgonly/option-2.jpg",
      "acmid": "99659045615",
      "orcid": "missing"
    },
    {
      "name": "Xin Gao",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366354",
      "orcid": "missing"
    },
    {
      "name": "Allison Marie Hishikawa",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366066",
      "orcid": "missing"
    },
    {
      "name": "Jason Yip",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Batya Friedman",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636215",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "June Ahn, Tamara Clegg, Jason Yip, Elizabeth Bonsignore, Daniel Pauw, Lautaro Cabrera, Kenna Hernly, Caroline Pitt, Kelly Mills, Arturo Salazar, Diana Griffing, Jeff Rick, and Rachael Marr. 2018. Science Everywhere: Designing Public, Tangible Displays to Connect Youth Learning Across Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), ACM, NY, NY, USA, 278:1--278:12. DOI: https://doi.org/10.1145/3173574.3173852",
      "doi": "10.1145/3173574.3173852"
    },
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not? In Proceedings of the Extended Abstracts of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14), ACM, NY, NY, USA, 1087-- 1092. DOI: https://doi.org/10.1145/2559206.2579405",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Cindy Lin, Silvia Lindtner, and Austin Toombs. 2017. HCI's Making Agendas. Found. Trends® Human--Computer Interact. 11, 3 (December 2017), 126--200. DOI: https://doi.org/10.1561/1100000066",
      "doi": "10.1561/1100000066"
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal Fabrication. Found. Trends® Human--Computer Interact. 10, 3--4 (May 2017), 165--293. DOI: https://doi.org/10.1561/1100000055",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), ACM, NY, NY, USA, 243:1--243:13. DOI: https://doi.org/10.1145/3290605.3300473",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), ACM, NY, NY, USA, 503--512. DOI: https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Robert Bogue. 2007. Design for disassembly: A critical twenty-first century discipline. Assem. Autom. 27, (October 2007), 285--289. DOI: https://doi.org/10.1108/01445150710827069",
      "doi": ""
    },
    {
      "text": "Alan Borning, Batya Friedman, and Nick Logler. In Press. The \"invisible\" materiality of information technology. Commun. ACM (In Press).",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Hannah Perner-Wilson. 2012. Crafting Technology: Reimagining the Processes, Materials, and Cultures of Electronics. ACM Trans Comput-Hum Interact 19, 3 (October 2012), 21:1-- 21:21. DOI: https://doi.org/10.1145/2362364.2362369",
      "doi": "10.1145/2362364.2362369"
    },
    {
      "text": "Elliot J. Chikofsky and James H. Cross. 1990. Reverse engineering and design recovery: a taxonomy. IEEE Softw. 7, 1 (January 1990), 13--17. DOI: https://doi.org/10.1109/52.43044",
      "doi": "10.1109/52.43044"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2007. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory (3rd edition ed.). SAGE Publications, Inc, Los Angeles, Calif.",
      "doi": ""
    },
    {
      "text": "Sharon J. Derry, Roy D. Pea, Brigid Barron, Randi A. Engle, Frederick Erickson, Ricki Goldman, Rogers Hall, Timothy Koschmann, Jay L. Lemke, Miriam Gamoran Sherin, and Bruce L. Sherin. 2010. Conducting Video Research in the Learning Sciences: Guidance on Selection, Analysis, Technology, and Ethics. J. Learn. Sci. 19, 1 (January 2010), 3--53. DOI: https://doi.org/10.1080/10508400903452884",
      "doi": ""
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2018. Lessons from the Woodshop: Cultivating Design with Living Materials. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), ACM, NY, NY, USA, 585:1--585:12. DOI: https://doi.org/10.1145/3173574.3174159",
      "doi": ""
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2019. Designing with Waste: A Situated Inquiry into the Material Excess of Making. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), ACM, NY, NY, USA, 1307--1319. DOI: https://doi.org/10.1145/3322276.3322320",
      "doi": "10.1145/3322276.3322320"
    },
    {
      "text": "Kristin N. Dew, Samantha Shorey, and Daniela Rosner. 2018. Making Within Limits: Towards Salvage Fabrication. In Proceedings of the 2018 Workshop on Computing Within Limits (LIMITS '18), ACM, NY, NY, USA, 7:1--7:11. DOI: https://doi.org/10.1145/3232617.3232626",
      "doi": ""
    },
    {
      "text": "Eleanor Duckworth. 1972. The Having of Wonderful Ideas. Harv. Educ. Rev. 42, 2 (July 1972), 217--231. DOI: https://doi.org/10.17763/haer.42.2.g71724846u52 5up3",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), ACM, NY, NY, USA, 56--68. DOI: https://doi.org/10.1145/2675133.2675223",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Batya Friedman and David G. Hendry. 2019. Value Sensitive Design: Shaping technology with moral imagination. The MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Manfred Tscheligi, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Andreas Reiter, and Pernille Bjorn. 2016. Fabrication & HCI: Hobbyist Making, Industrial Production, and Beyond. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), ACM, NY, NY, USA, 3550--3557. DOI: https://doi.org/10.1145/2851581.2856491",
      "doi": "10.1145/2851581.2856491"
    },
    {
      "text": "Garnet Hertz, Gillian Hayes, and Amelia Guimarin. 2014. Toy Hacking: Preliminary Results in Creative Electronic Workshops for Informal Science Education.",
      "doi": ""
    },
    {
      "text": "Bill Gaver. 2002. Designing for Homo Ludens. I3 Magazine 12, 2--6.",
      "doi": ""
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The Drift Table: Designing for Ludic Engagement. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04), ACM, NY, NY, USA, 885--900. DOI: https://doi.org/10.1145/985921.985947",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Qubais Reed Ghazala. 2004. The Folk Music of Chance Electronics: Circuit-Bending the Modern Coconut. Leonardo Music J. 14, (December 2004), 97--104. DOI: https://doi.org/10.1162/0961121043067271",
      "doi": ""
    },
    {
      "text": "Batya Goodman. 1999. Honey, I Shrink-Wrapped the Consumer: The Shrink-Wrap Agreement as an Adhesion Contract Note. Cardozo Law Rev. 1 (2000 1999), 319--360.",
      "doi": ""
    },
    {
      "text": "Usman Haque and Adam Somlai-Fischer. 2005. Lowtech Sensors and Actuators. Retrieved September 18, 2019 from http://lowtech.propositions.org.uk/",
      "doi": ""
    },
    {
      "text": "T. Harjula, B. Rapoza, W. A. Knight, and G. Boothroyd. 1996. Design for Disassembly and the Environment. CIRP Ann. 45, 1 (January 1996), 109--114. DOI: https://doi.org/10.1016/S0007--8506(07)63027--3",
      "doi": ""
    },
    {
      "text": "Garnet Hertz and Jussi Parikka. 2012. Zombie Media: Circuit Bending Media Archaeology into an Art Method. Leonardo 45, 5 (July 2012), 424--430. DOI: https://doi.org/10.1162/LEON_a_00438",
      "doi": ""
    },
    {
      "text": "Ian M. Hutchings and Graham D. Martin. 2013. Introduction to inkjet printing for manufacturing. In Inkjet Technology for Digital Fabrication. John Wiley $ Sons Ltd, 1--20.",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2007. Materials Against Materiality. Archaeol. Dialogues 14, 1 (June 2007), 1--16. DOI: https://doi.org/10.1017/S1380203807002127",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2013. Making: Anthropology, Archaeology, Art and Architecture (1 edition ed.). Routledge, London?; New York.",
      "doi": ""
    },
    {
      "text": "Stephen J. Jackson. 2014. Rethinking Repair. In Media technologies: Essays on communication, materiality, and society. MIT Press, 221--239.",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson and Laewoo Kang. 2014. Breakdown, Obsolescence and Reuse: HCI and the Art of Repair. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM, NY, NY, USA, 449--458. DOI: https://doi.org/10.1145/2556288.2557332",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair Worlds: Maintenance, Repair, and ICT for Development in Rural Namibia. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), ACM, NY, NY, USA, 107--116. DOI: https://doi.org/10.1145/2145204.2145224",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Brigitte Jordan and Austin Henderson. 1995. Interaction Analysis: Foundations and Practice. J. Learn. Sci. 4, 1 (January 1995), 39--103. DOI: https://doi.org/10.1207/s15327809jls0401_2",
      "doi": ""
    },
    {
      "text": "Jason Koebler. 2015. How to Fix Everything. Motherboard: Tech by Vice. Retrieved September 18, 2019 from https://www.vice.com/en_us/article/8q89wb/how-tofix-everything",
      "doi": ""
    },
    {
      "text": "Jason Koebler. 2016. How Sony, Microsoft, and Other Gadget Makers Violate Federal Warranty Law. Vice. Retrieved September 18, 2019 from https://www.vice.com/en_us/article/gv5ddm/warrantyvoid-if-removed-stickers-are-illegal",
      "doi": ""
    },
    {
      "text": "Beth Kolko, Alexis Hope, Brook Sattler, Kate MacCorkle, and Behzod Sirjani. 2012. Hackademia: Building Functional Rather Than Accredited Engineers. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1 (PDC '12), ACM, NY, NY, USA, 129--138. DOI: https://doi.org/10.1145/2347635.2347654",
      "doi": "10.1145/2347635.2347654"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the Utopian Vision of Making: HCI After Technosolutionism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), ACM, NY, NY, USA, 1390--1402. DOI: https://doi.org/10.1145/2858036.2858506",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "David A. Mellis and Leah Buechley. 2014. Do-ityourself Cellphones: An Investigation into the Possibilities and Limits of High-tech Diy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM, NY, NY, USA, 1723--1732. DOI: https://doi.org/10.1145/2556288.2557309",
      "doi": ""
    },
    {
      "text": "David A. Mellis, Leah Buechley, Mitchel Resnick, and Björn Hartmann. 2016. Engaging Amateurs in the Design, Fabrication, and Assembly of Electronic Devices. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), ACM, NY, NY, USA, 1270--1281. DOI: https://doi.org/10.1145/2901790.2901833",
      "doi": "10.1145/2901790.2901833"
    },
    {
      "text": "Sharan B. Merriam. 2009. Qualitative Research: A Guide to Design and Implementation (3 edition ed.). Jossey-Bass, San Francisco.",
      "doi": ""
    },
    {
      "text": "Martin Murer. 2018. Making Things Apart: Gaining Material Understanding. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), ACM, NY, NY, USA, 497--509. DOI: https://doi.org/10.1145/3196709.3196806",
      "doi": "10.1145/3196709.3196806"
    },
    {
      "text": "Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2015. Deconstructivist Interaction Design: Interrogating Expression and Form. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (CA '15), Aarhus University Press, 33--36. DOI: https://doi.org/10.7146/aahcc.v1i1.21313",
      "doi": "10.7146/aahcc.v1i1.21313"
    },
    {
      "text": "Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2017. Un-Crafting: De-Constructive Engagements with Interactive Artifacts. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17), ACM, NY, NY, USA, 67--77. DOI: https://doi.org/10.1145/3024969.3024993",
      "doi": "10.1145/3024969.3024993"
    },
    {
      "text": "Martin Murer, Mattias Jacobsson, Siri Skillgate, and Petra Sundström. 2014. Taking Things Apart: Reaching Common Ground and Shared Material Understanding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM, NY, NY, USA, 469--472. DOI: https://doi.org/10.1145/2556288.2557267",
      "doi": "10.1145/2556288.2557267"
    },
    {
      "text": "Don Norman. 2013. The Design of Everyday Things: Revised and Expanded Edition (Revised, Expanded edition ed.). Basic Books, New York, New York.",
      "doi": ""
    },
    {
      "text": "Eric Paulos. 2012. You Amateur! interactions 19, 1 (January 2012), 52--57. DOI: https://doi.org/10.1145/2065327.2065338",
      "doi": ""
    },
    {
      "text": "Nadya Peek, James Coleman, Ilan Moyer, and Neil Gershenfeld. 2017. Cardboard Machine Kit: Modules for the Rapid Prototyping of Rapid Prototyping Machines. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), ACM, NY, NY, USA, 3657--3668. DOI: https://doi.org/10.1145/3025453.3025491",
      "doi": "10.1145/3025453.3025491"
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting Textile Interfaces from a Kit-of-no-parts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11), ACM, NY, NY, USA, 61--68. DOI: https://doi.org/10.1145/1935701.1935715",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Nathan Proctor and David Peters. 2018. Warranties in the Void. Retrieved September 18, 2019 from https://uspirg.org/sites/pirg/files/reports/Warranties%2 0in%20the%20Void%20%20U.S.%20PIRG%20Education%20Fund%20%20Oct2018.pdf",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick. 2007. All I Really Need to Know (About Creative Thinking) I Learned (by Studying How Children Learn) in Kindergarten. In Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition (C&C '07), ACM, NY, NY, USA, 1-- 6. DOI: https://doi.org/10.1145/1254960.1254961",
      "doi": "10.1145/1254960.1254961"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés MonroyHernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun ACM 52, 11 (November 2009), 60--67. DOI: https://doi.org/10.1145/1592761.1592779",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2016. \"I'm Not Just a Mom\": Parents Developing Multiple Roles in Creative Computing. In ICLS 2016, International Society of the Learning Sciences, Singapore, 663--670.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner and Morgan Ames. 2014. Designing for Repair?: Infrastructures and Materialities of Breakdown. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), ACM, NY, NY, USA, 319--331. DOI: https://doi.org/10.1145/2531602.2531692",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Silvia Lindtner, Ingrid Erickson, Laura Forlano, Steven J. Jackson, and Beth Kolko. 2014. Making Cultures: Building Things & Building Communities. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW Companion '14), ACM, NY, NY, USA, 113--116. DOI: https://doi.org/10.1145/2556420.2556852",
      "doi": "10.1145/2556420.2556852"
    },
    {
      "text": "Reed Stevens, Tom Satwicz, and Laurie McCarthy. 2008. In-Game, In-Room, In-World: Reconnecting Video Game Play to the Rest of Kids' Lives. Ecol. Games Connect. Youth Games Learn. 9, (2008), 41--66. DOI: https://doi.org/10.1162/dmal.9780262693646.041",
      "doi": ""
    },
    {
      "text": "Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, NY, NY, USA, 2603--2612. DOI: https://doi.org/10.1145/2470654.2481360",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Vasiliki Tsaknaki and Ylva Fernaeus. 2016. Expanding on Wabi-Sabi As a Design Resource in HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), ACM, NY, NY, USA, 5970--5983. DOI: https://doi.org/10.1145/2858036.2858459",
      "doi": "10.1145/2858036.2858459"
    },
    {
      "text": "Anna Vallgårda and Ylva Fernaeus. 2015. Interaction Design As a Bricolage Practice. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), ACM, NY, NY, USA, 173--180. DOI: https://doi.org/10.1145/2677199.2680594",
      "doi": "10.1145/2677199.2680594"
    },
    {
      "text": "Marc Weiser. 1994. The World is Not a Desktop. interactions 1, 1 (January 1994), 7--8. DOI: https://doi.org/10.1145/174800.174801",
      "doi": ""
    },
    {
      "text": "Marc Weiser. 2002. The computer for the 21st Century. IEEE Pervasive Comput. 1, 1 (January 2002), 19--25. DOI: https://doi.org/10.1109/MPRV.2002.993141",
      "doi": "10.1109/MPRV.2002.993141"
    },
    {
      "text": "Kyle Wiens. 2019. Your Power Button Won't Last Forever. Medium. Retrieved September 18, 2019 from https://onezero.medium.com/your-power-button-wontlast-forever-dd746d482190",
      "doi": ""
    },
    {
      "text": "Terry Winograd and Fernando Flores. 1987. Understanding Computers and Cognition: A New Foundation for Design. Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA.",
      "doi": "10.5555/576359"
    },
    {
      "text": "Corinna Wu. 2008. Some Disassembly Required. ASEE Prism 18, 2 (2008), 56--59.",
      "doi": ""
    },
    {
      "text": "Robert K. Yin. 2017. Case Study Research and Applications: Design and Methods (Sixth edition ed.). SAGE Publications, Inc, Los Angeles.",
      "doi": ""
    },
    {
      "text": "E. Zussman, A. Kriwet, and G. Seliger. 1994. Disassembly-Oriented Assessment Methodology to Support Design for Recycling. CIRP Ann. 43, 1 (January 1994), 9--14. DOI: https://doi.org/10.1016/S0007--8506(07)62152-0",
      "doi": ""
    },
    {
      "text": "iFixit: The Free Repair Manual. Retrieved September 18, 2019 from https://www.ifixit.com/",
      "doi": ""
    }
  ]
}