{
  "doi": "10.1145/3313831.3376319",
  "title": "Personal Space in Play: Physical and Digital Boundaries in Large-Display Cooperative and Competitive Games",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "As multi-touch displays grow in size and shrink in price, they are more commonly used as gaming devices. When co-located users play games on a single, large display, establishing and maintaining their physical and digital territories poses a social challenge to their interaction. To gain insight into the mechanisms of establishing and maintaining users' physical and digital territories, we analyze territorial interactions in cooperative and competitive multiplayer gameplay. Participants reported weighing each game interaction based on perceived intent to determine how socially acceptable they deemed each behaviour. In light of our observations, we contribute and discuss implications for the design of multi-user, large display, co-located, touchscreen games that consider display properties, digital and physical space, permeability of boundaries, and asymmetry of play to create interactions between players.",
  "authors": [
    {
      "name": "Rina R. Wehbe",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81557657556/rel-imgonly/side.jpg",
      "acmid": "81557657556",
      "orcid": "missing"
    },
    {
      "name": "Terence Dickson",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526437",
      "orcid": "missing"
    },
    {
      "name": "Anastasia Kuzminykh",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658687173",
      "orcid": "0000-0002-5941-4641"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo and Inria & University of Lille, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    }
  ],
  "references": [
    {
      "text": "1957. Risk. Game [Board]. (1957).",
      "doi": ""
    },
    {
      "text": "Travis Alley. 2017. Pokemon Go: Emerging Liability Arising from Virtual Trespass for Augmented Reality Applications. Tex. A&M J. Prop. L. 4 (2017), 273.",
      "doi": ""
    },
    {
      "text": "Alec Azad, Jaime Ruiz, Daniel Vogel, Mark Hancock, and Edward Lank. 2012. Territoriality and Behaviour on and Around Large Vertical Publicly-shared Displays. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 468--477. DOI: http://dx.doi.org/10.1145/2317956.2318025",
      "doi": "10.1145/2317956.2318025"
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 121--130. DOI: http://dx.doi.org/10.1145/1936652.1936676",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Po Bhattacharyya, Yein Jo, Ketki Jadhav, Radha Nath, and Jessica Hammer. 2019. Brick: A Synchronous Multiplayer Augmented Reality Game for Mobile Phones. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). Association for Computing Machinery, New York, NY, USA, Article Paper INT009, 4 pages. DOI: http://dx.doi.org/10.1145/3290607.3313257",
      "doi": ""
    },
    {
      "text": "Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Eran Tiza, Bugra Can Sefercik, Idil Bostan, Oguz Turan Buruk, Tilbe Göksun, and Oguzhan Özcan. 2016. Sensation: measuring the effects of a human-to-human social touch based controller on the player experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3944--3955.",
      "doi": "10.1145/2858036.2858418"
    },
    {
      "text": "Alan Chatham and Florian 'Floyd' Müller. 2013. Adding an Interactive Display to a Public Basketball Hoop Can Motivate Players and Foster Community. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 667--676. DOI: http://dx.doi.org/10.1145/2493432.2493478",
      "doi": "10.1145/2493432.2493478"
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative sociology 13, 1 (1990), 3--21.",
      "doi": ""
    },
    {
      "text": "Liliana Vale Costa, Ana Isabel Veloso, and Óscar Mealha. 2017. A Review of Proxemics in 'Smart Game-Playing'. In Conference on Smart Learning Ecosystems and Regional Development. Springer, 219--226.",
      "doi": ""
    },
    {
      "text": "Dickson, Terence. 2017. HybridPointing Touch: A Technique to Switch Between Absolute and Relative Pointing on Large Touch Screens. (2017). http://hdl.handle.net/10012/12593 Master's Thesis.",
      "doi": ""
    },
    {
      "text": "Andre Doucette, Carl Gutwin, Regan L. Mandryk, Miguel Nacenta, and Sunny Sharma. 2013. Sometimes when We Touch: How Arm Embodiments Change Reaching and Collaboration on Digital Tables. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 193--202. DOI: http://dx.doi.org/10.1145/2441776.2441799",
      "doi": "10.1145/2441776.2441799"
    },
    {
      "text": "Clifton Forlines, Daniel Vogel, and Ravin Balakrishnan. Hybridpointing: Fluid Switching between Absolute and Relative Pointing with a Direct Input Device. In Proceedings of the 19th annual ACM Symposium on User Interface Software and Technology (2006). ACM, 211--220. http://dl.acm.org/citation.cfm?id=1166286",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Brian Gajadhar, Yvonne de Kort, and Wijnand Ijsselsteijn. 2008a. Influence of Social Setting on Player Experience of Digital Games. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, NY, NY, USA, 3099--3104. DOI: http://dx.doi.org/10.1145/1358628.1358814",
      "doi": ""
    },
    {
      "text": "Brian J. Gajadhar, Yvonne A. Kort, and Wijnand A. Ijsselsteijn. 2008b. Shared Fun Is Doubled Fun: Player Enjoyment As a Function of Social Setting. In Proceedings of the 2Nd International Conference on Fun and Games. Springer-Verlag, Berlin, Heidelberg, 106--117. DOI: http://dx.doi.org/10.1007/978--3--540--88322--7_11",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions 6, 1 (January 1999), 21--29. DOI: http://dx.doi.org/10.1145/291224.291235",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicomp? interactions 18, 1 (Jan. 2011), 42--50. DOI: http://dx.doi.org/10.1145/1897239.1897250",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Edward T Hall. 1963. A system for the notation of proxemic behavior. American anthropologist 65, 5 (1963), 1003--1026.",
      "doi": ""
    },
    {
      "text": "Jane Henderson, Shaishav Siddhpuria, Keiko Katsuragawa, and Edward Lank. 2017. Fostering Large Display Engagement Through Playful Interactions. In Proceedings of the 6th ACM International Symposium on Pervasive Displays (PerDis '17). ACM, NY, NY, USA, Article 20, 8 pages. DOI: http://dx.doi.org/10.1145/3078810.3078818",
      "doi": "10.1145/3078810.3078818"
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 437--446.",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, and Edward F Melcer. 2018. Social Affordances at Play: Game Design Toward Socio-Technical Innovation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 372.",
      "doi": "10.1145/3173574.3173946"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2016. Negotiating for Space?: Collaborative Work Using a Wall Display with Mouse and Touch Input. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2050--2061. DOI: http://dx.doi.org/10.1145/2858036.2858158",
      "doi": ""
    },
    {
      "text": "Dennis L. Kappen, John Gregory, Daniel Stepchenko, Rina R. Wehbe, and Lennart E. Nacke. 2013. Exploring Social Interaction in Co-located Multiplayer Games. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 1119--1124. DOI: http://dx.doi.org/10.1145/2468356.2468556",
      "doi": ""
    },
    {
      "text": "Daniel Klinkhammer, Magdalena Mateescu, Carmen Zahn, and Harald Reiterer. 2018. Mine, Yours, Ours: Coordination through Workspace Arrangements and Territoriality in Tabletop Interaction. (2018), 171--182. DOI: http://dx.doi.org/10.1145/3282894.3282902",
      "doi": ""
    },
    {
      "text": "Team17 Digital Limited. 2008. Overcooked 2. Game [Nintendo Switch, PlayStation 4, Xbox One, Microsoft Windows, macOS, Linux, Macintosh operating systems]. (2008).",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2012. MobiComics: Collaborative Use of Mobile Phones and Large Displays for Public Expression. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 383--392. DOI: http://dx.doi.org/10.1145/2371574.2371634",
      "doi": "10.1145/2371574.2371634"
    },
    {
      "text": "Joe Marshall, Conor Linehan, and Adrian Hazzard. 2016. Designing brutal multiplayer video games. In Proceedings of the 2016 chi conference on human factors in computing systems. ACM, 2669--2680.",
      "doi": "10.1145/2858036.2858080"
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2017. Touchomatic: interpersonal touch gaming in the wild. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 417--428.",
      "doi": "10.1145/3064663.3064727"
    },
    {
      "text": "Paul Marshall, Richard Morris, Yvonne Rogers, Stefan Kreitmayer, and Matt Davies. 2011. Rethinking 'Multi-user': An In-the-wild Study of How Groups Approach a Walk-up-and-use Tabletop Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3033--3042. DOI: http://dx.doi.org/10.1145/1978942.1979392",
      "doi": "10.1145/1978942.1979392"
    },
    {
      "text": "Sven Mayer, Lars Lischke, Jens Emil Grønbæk, Zhanna Sarsenbayeva, Jonas Vogelsang, Pawel W Wo´ zniak, Niels Henze, and Giulio Jacucci. 2018. Pac-many: Movement behavior when playing collaborative and competitive games on large displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 539.",
      "doi": "10.1145/3173574.3174113"
    },
    {
      "text": "Timothy Merritt, Christine Linding Nielsen, Frederik Lund Jakobsen, and Jens Emil Grønbæk. 2017. Glowphones: designing for proxemics play with low-resolution displays in location-based games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, 69--81.",
      "doi": "10.1145/3116595.3116598"
    },
    {
      "text": "Florian Mueller, Sophie Stellmach, Saul Greenberg, Andreas Dippon, Susanne Boll, Jayden Garner, Rohit Khot, Amani Naseem, and David Altimira. 2014. Proxemics play: understanding proxemics for designing digital play experiences. In Proceedings of the 2014 conference on Designing interactive systems. ACM, 533--542.",
      "doi": "10.1145/2598510.2598532"
    },
    {
      "text": "Florian 'Floyd' Müller, Martin R Gibbs, Frank Vetere, and Darren Edge. 2017. Designing for bodily interplay in social exertion games. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 3 (2017), 24.",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Robert Walter, Gilles Bailly, Michael Nischt, and Florian Alt. 2012. Looking Glass: A Field Study on Noticing Interactivity of a Shop Window. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 297--306. DOI: http://dx.doi.org/10.1145/2207676.2207718",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "pages=638 year=2019 organization=ACM Müller, Florian Floyd and Li, Zhuying and Byrne, Richard and Mehta, Yash Dhanpal and Arnold, Peter and Kari, Tuomas, booktitle=Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. A 2nd Person Social Perspective on Bodily Play.",
      "doi": ""
    },
    {
      "text": "Michelle R Nelson. 2005. Exploring consumer response to \"advergaming\". Online consumer psychology: Understanding and influencing consumer behavior in the virtual world (2005), 156--182.",
      "doi": ""
    },
    {
      "text": "Michelle R Nelson, Heejo Keum, and Ronald A Yaros. 2004. Advertainment or adcreep game players' attitudes toward advertising and product placements in computer games. Journal of Interactive Advertising 5, 1 (2004), 3--21.",
      "doi": ""
    },
    {
      "text": "BANDAI NAMCO Studio Nintendo R&D1, BANDAI NAMCO Entertainment and Sora Ltd. 2008. Super Smash Brothers Ultimate. Game [Nintendo Switch]. (7 December 2008). Nintendo, Kyoto, Japan.",
      "doi": ""
    },
    {
      "text": "Kenton O'Hara, Maxine Glancy, and Simon Robertshaw. 2008. Understanding Collective Play in an Urban Screen Game. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 67--76. DOI: http://dx.doi.org/10.1145/1460563.1460576",
      "doi": "10.1145/1460563.1460576"
    },
    {
      "text": "Konstantinos Papangelis, Melvin Metzger, Yiyang Sheng, Hai-Ning Liang, Alan Chamberlain, and Vassilis-Javed Khan. 2017. Get Off My Lawn!: Starting to Understand Territoriality in Location Based Mobile Games. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1955--1961.",
      "doi": "10.1145/3027063.3053154"
    },
    {
      "text": "Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It's Mine, Don'T Touch!: Interactions at a Large Multi-touch Display in a City Centre. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1285--1294. DOI: http://dx.doi.org/10.1145/1357054.1357255",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Yuriko Sakakibara, Yoshio Matsuda, Takashi Komuro, and Kayo Ogawa. 2019. Simultaneous Interaction with a Large Display by Many Users. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (PerDis '19). ACM, NY, NY, USA, Article 34, 2 pages. DOI: http://dx.doi.org/10.1145/3321335.3329680",
      "doi": "10.1145/3321335.3329680"
    },
    {
      "text": "Katie Salen, Katie Salen Tekinba¸ s, and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.",
      "doi": ""
    },
    {
      "text": "Dominik Schmidt, Ming Ki Chong, and Hans Gellersen. 2010. HandsDown: Hand-contour-based User Identification for Interactive Surfaces. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, NY, NY, USA, 432--441. DOI: http://dx.doi.org/10.1145/1868914.1868964",
      "doi": "10.1145/1868914.1868964"
    },
    {
      "text": "Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 294--303. DOI: http://dx.doi.org/10.1145/1031607.1031655",
      "doi": ""
    },
    {
      "text": "Anton Sigitov. 2016. Effects of Workspace Awareness and Territoriality in Environments with Large, Shared Displays. In Proceedings of the 2016 ACM Companion on Interactive Surfaces and Spaces (ISS Companion '16). ACM, NY, NY, USA, 1--6. DOI: http://dx.doi.org/10.1145/3009939.3009940",
      "doi": "10.1145/3009939.3009940"
    },
    {
      "text": "Robert Sommer. 1959. Studies in personal space. Sociometry 22, 3 (1959), 247--260.",
      "doi": ""
    },
    {
      "text": "Robert Sommer. 1969. Personal Space. The Behavioral Basis of Design. (1969).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1994. Grounded theory methodology. Handbook of qualitative research 17 (1994), 273--85.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1997. Grounded theory in practice. Sage.",
      "doi": ""
    },
    {
      "text": "Emily Sun, Mark Matthews, Geri Gay, Margaret E. Morris, and Douglas Carmean. 2014. Playing with Emotions: Sentiment Design for Public Space. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 439--440. DOI: http://dx.doi.org/10.1145/2658537.2661317",
      "doi": "10.1145/2658537.2661317"
    },
    {
      "text": "Deepika Vaddi, Zachary Toups, Igor Dolgov, Rina Wehbe, and Lennart Nacke. 2016. Investigating the Impact of Cooperative Communication Mechanics on Player Performance in Portal 2. In Proceedings of Graphics Interface 2016 (GI 2016). Canadian Human-Computer Communications Society / Société canadienne du dialogue humain-machine, 41--48. DOI: http://dx.doi.org/10.20380/GI2016.06",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive Public Ambient Displays: Transitioning from Implicit to Explicit, Public to Personal, Interaction with Multiple Users. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 137--146. DOI: http://dx.doi.org/10.1145/1029632.1029656",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii All Play: The Console Game As a Computational Meeting Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1559--1568. DOI: http://dx.doi.org/10.1145/1518701.1518940",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Ulrich von Zadow, Daniel Bösel, Duc Dung Dam, Anke Lehmann, Patrick Reipschläger, and Raimund Dachselt. 2016. Miners: Communication and Awareness in Collaborative Gaming at an Interactive Display Wall. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 235--240. DOI: http://dx.doi.org/10.1145/2992154.2992174",
      "doi": "10.1145/2992154.2992174"
    },
    {
      "text": "James R. Wallace, Nancy Iskander, and Edward Lank. 2016. Creating Your Bubble: Personal Space On and Around Large Public Displays. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2087--2092. DOI: http://dx.doi.org/10.1145/2858036.2858118",
      "doi": "10.1145/2858036.2858118"
    },
    {
      "text": "James R. Wallace, Daniel Vogel, and Edward Lank. 2014. Effect of Bezel Presence and Width on Visual Search. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, NY, NY, USA, Article 118, 6 pages. DOI: http://dx.doi.org/10.1145/2611009.2611019",
      "doi": "10.1145/2611009.2611019"
    },
    {
      "text": "James R. Wallace, Ariel Weingarten, and Edward Lank. 2017. Subtle and Personal Workspace Requirements for Visual Search Tasks on Public Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6760--6764. DOI: http://dx.doi.org/10.1145/3025453.3025500",
      "doi": "10.1145/3025453.3025500"
    },
    {
      "text": "Diane Watson, Mark Hancock, Regan L. Mandryk, and Max Birk. 2013. Deconstructing the Touch Experience. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, NY, NY, USA, 199--208. DOI: http://dx.doi.org/10.1145/2512349.2512819",
      "doi": "10.1145/2512349.2512819"
    },
    {
      "text": "Andrew M. Webb, Michel Pahud, Ken Hinckley, and Bill Buxton. 2016. Wearables As Context for Guiard-abiding Bimanual Touch. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 287--300. DOI: http://dx.doi.org/10.1145/2984511.2984564",
      "doi": "10.1145/2984511.2984564"
    },
    {
      "text": "Rina R. Wehbe, Edward Lank, and Lennart E. Nacke. 2017. Left Them 4 Dead: Perception of Humans Versus Non-Player Character Teammates in Cooperative Gameplay. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 403--415. DOI: http://dx.doi.org/10.1145/3064663.3064712",
      "doi": ""
    },
    {
      "text": "Rina R. Wehbe and Lennart E. Nacke. 2015. Towards Understanding the Importance of Co-Located Gameplay. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 733--738. DOI: http://dx.doi.org/10.1145/2793107.2810312",
      "doi": ""
    },
    {
      "text": "Derek Yu and Mossmouth LLC. 2008. Spelunky. game [PlayStation 4, PlayStation 3, Xbox 360, PlayStation Vita, Microsoft Windows, PlayStation 3 Models]. (2008).",
      "doi": ""
    }
  ]
}