{
  "doi": "10.1145/3313831.3376303",
  "title": "Knock on Wood: Combining Redirected Touching and Physical Props for Tool-Based Interaction in Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "When physical props serve as proxies for virtual tools used to manipulate the virtual environment, it is challenging to provide appropriate haptic feedback. Redirected tool-mediated manipulation addresses this challenge by distorting the mapping between physical and virtual tools to provide a sensation of manipulating the virtual environment, when the physical tool comes into contact with another physical prop. For example, a virtual hammer's position can be offset to ensure that physical impacts accompany each strike of a virtual nail. We demonstrate the idea by showing that it can be used to create sensations of impact and resistance when driving a virtual nail into a surface, when tightening a virtual screw, and when sawing through a virtual plank. The results of a user study indicate that the proposed approach is perceived as more realistic than interaction with a single physical prop or controller and no notable detriments to precision were observed.",
  "authors": [
    {
      "name": "Patrick L. Strandholt",
      "institution": "Aalborg University Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659324425",
      "orcid": "missing"
    },
    {
      "name": "Oana A. Dogaru",
      "institution": "Aalborg University Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659325717",
      "orcid": "missing"
    },
    {
      "name": "Niels C. Nilsson",
      "institution": "Aalborg University Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502709264",
      "orcid": "missing"
    },
    {
      "name": "Rolf Nordahl",
      "institution": "Aalborg University Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456609632",
      "orcid": "missing"
    },
    {
      "name": "Stefania Serafin",
      "institution": "Aalborg University Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100453403",
      "orcid": "0000-0001-6971-1132"
    }
  ],
  "references": [
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI'16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Eindhoven, Netherlands, 218--226.",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Federico Avanzini, Davide Rocchesso, and Stefania Serafn. 2004. Friction sounds for sensory substitution. In Proceedings of the 2004 International Conference on Auditory Display. Georgia Institute of Technology, International Community for Auditory Display, Sydney, Australia, 1--8.",
      "doi": ""
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D Wilson. 2016. Haptic retargeting: Dynamic repurposing of passive haptics for enhanced virtual reality experiences. In Proceedings of the 2016 chi conference on human factors in computing systems. ACM, San Jose, California, USA, 1968--1979.",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Rosa María Baños, Cristina Botella, Azucena Garcia-Palacios, Helena Villa, Concepción Perpiñá, and Mariano Alcaniz. 2000. Presence and reality judgment in virtual environments: a unitary construct? CyberPsychology & Behavior 3, 3 (2000), 327--335.",
      "doi": ""
    },
    {
      "text": "Joanna Bergström, Aske Mottelson, and Jarrod Knibbe. 2019. Resized Grasping in VR: Estimating Thresholds for Object Discrimination. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New Orleans, LA, USA, 1175--1183.",
      "doi": "10.1145/3332165.3347939"
    },
    {
      "text": "Lung-Pan Cheng, Li Chang, Sebastian Marwecki, and Patrick Baudisch. 2018. iTurk: Turning Passive Haptics into Active Haptics by Making Users Reconfgure Props in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 89.",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017a. Mutual Human Actuation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, Quebec City, QC, Canada, 797--805.",
      "doi": "10.1145/3126594.3126667"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D Wilson. 2017b. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 3718--3728.",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. Turkdeck: Physical virtual reality based on people. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, Charlotte, NC, USA, 417--426.",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Anton Franzluebbers and Kyle Johnsen. 2018. Performance Benefts of High-Fidelity Passive Haptic Feedback in Virtual Reality Training. In Proceedings of the Symposium on Spatial User Interaction. ACM, Berlin, Germany, 16--24.",
      "doi": "10.1145/3267782.3267790"
    },
    {
      "text": "Eisuke Fujinawa, Shigeo Yoshida, Yuki Koyama, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2017. Computational design of hand-held VR controllers using haptic shape illusion. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology. ACM, Gothenburg, Sweden, 28.",
      "doi": "10.1145/3139131.3139160"
    },
    {
      "text": "Netta Gurari, Katherine J Kuchenbecker, and Allison M Okamura. 2009. Stiffness discrimination with visual and proprioceptive cues. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, Salt Lake City, UT, USA, 121--126.",
      "doi": "10.1109/WHC.2009.4810845"
    },
    {
      "text": "Dustin T Han, Mohamed Suhail, and Eric D Ragan. 2018. Evaluating Remapped Physical Reach for Hand Interactions with Passive Haptics in Virtual Reality. IEEE Transactions on Visualization & Computer Graphics 24, 4 (2018), 1467--1476.",
      "doi": "10.1109/TVCG.2018.2794659"
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing reality: Enabling opportunistic use of everyday objects as tangible proxies in augmented reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose, California, USA, 1957--1967.",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "Matthias Hoppe, Pascal Knierim, Thomas Kosch, Markus Funk, Lauren Futami, Stefan Schneegass, Niels Henze, Albrecht Schmidt, and Tonja Machulla. 2018. VRHapticDrones: Providing Haptics in Virtual Reality through Quadcopters. In Proceedings of the 17th International Conference on Mobile and Ubiquitous Multimedia. ACM, Cairo, Egypt, 7--18.",
      "doi": "10.1145/3282894.3282898"
    },
    {
      "text": "Brent Edward Insko, M Meehan, M Whitton, and F Brooks. 2001. Passive haptics signifcantly enhances virtual environments. Ph.D. Dissertation. University of North Carolina at Chapel Hill.",
      "doi": ""
    },
    {
      "text": "Seokhee Jeon and Seungmoon Choi. 2009. Haptic augmented reality: Taxonomy and an example of stiffness modulation. Presence: Teleoperators and Virtual Environments 18, 5 (2009), 387--408.",
      "doi": "10.1162/pres.18.5.387"
    },
    {
      "text": "Pascal Knierim, Thomas Kosch, Valentin Schwind, Markus Funk, Francisco Kiss, Stefan Schneegass, and Niels Henze. 2017. Tactile drones-providing immersive tactile feedback in virtual reality through quadcopters. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, Denver, Colorado, 433--436.",
      "doi": "10.1145/3027063.3050426"
    },
    {
      "text": "Luv Kohli. 2010. Redirected touching: Warping space to remap passive haptics. In 3D User Interfaces (3DUI), 2010 IEEE Symposium on. IEEE, Waltham, MA, USA, 129--130.",
      "doi": ""
    },
    {
      "text": "Luv Kohli, Eric Burns, Dorian Miller, and Henry Fuchs. 2005. Combining passive haptics with redirected walking. In Proceedings of the 2005 international conference on Augmented tele-existence. ACM, Christchurch, New Zealand, 253--254.",
      "doi": "10.1145/1152399.1152451"
    },
    {
      "text": "Luv Kohli, Mary C Whitton, and Frederick P Brooks. 2012. Redirected touching: The effect of warping space on task performance. In 3D User Interfaces (3DUI), 2012 IEEE Symposium on. IEEE, Costa Mesa, CA, USA, 105--112.",
      "doi": ""
    },
    {
      "text": "Luv Kohli, Mary C Whitton, and Frederick P Brooks. 2013. Redirected Touching: Training and adaptation in warped virtual spaces. In 3D User Interfaces (3DUI), 2013 IEEE Symposium on. IEEE, Orlando, FL, USA, 79--86.",
      "doi": ""
    },
    {
      "text": "Anatole Lécuyer. 2009. Simulating haptic feedback using vision: A survey of research and applications of pseudo-haptic feedback. Presence: Teleoperators and Virtual Environments 18, 1 (2009), 39--53.",
      "doi": "10.1162/pres.18.1.39"
    },
    {
      "text": "Anatole Lecuyer, Sabine Coquillart, Abderrahmane Kheddar, Paul Richard, and Philippe Coiffet. 2000. Pseudo-haptic feedback: Can isometric input devices simulate force feedback?. In Virtual Reality, 2000. Proceedings. IEEE. IEEE, New Brunswick, NJ, USA, 83--90.",
      "doi": ""
    },
    {
      "text": "Myungho Lee, Kangsoo Kim, Salam Daher, Andrew Raij, Ryan Schubert, Jeremy Bailenson, and Greg Welch. 2016. The wobbly table: Increased social presence via subtle incidental movement of a real-virtual table. In Virtual Reality (VR), 2016 IEEE. IEEE, Greenville, SC, USA, 11--17.",
      "doi": ""
    },
    {
      "text": "Andreas L Lohse, Christoffer K Kjær, Ervin Hamulic, Ingrid GA Lima, Tilde H Jensen, Luis E Bruni, and Niels C Nilsson. 2019. Leveraging Change Blindness for Haptic Remapping in Virtual Environments. In 2019 IEEE 5th Workshop on Everyday Virtual Reality (WEVR). IEEE, Osaka, Japan, 1--5.",
      "doi": ""
    },
    {
      "text": "John C McClelland, Robert J Teather, and Audrey Girouard. 2017. HaptoBend: shape-changing passive haptic feedback in virtual reality. In Proceedings of the 5th Symposium on Spatial User Interaction. ACM, Brighton, United Kingdom, 82--90.",
      "doi": "10.1145/3131277.3132179"
    },
    {
      "text": "Ryan Patrick McMahan. 2011. Exploring the effects of higher-fdelity display and interaction for virtual reality games. Ph.D. Dissertation. Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Niels Christian Nilsson, Tabitha Peck, Gerd Bruder, Eri Hodgson, Stefania Serafn, Mary Whitton, Frank Steinicke, and Evan Suma Rosenberg. 2018. 15 Years of Research on Redirected Walking in Immersive Virtual Environments. IEEE computer graphics and applications 38, 2 (2018), 44--56.",
      "doi": "10.1109/MCG.2018.111125628"
    },
    {
      "text": "Alexis Paljic, J-M Burkhardtt, and Sabine Coquillart. 2004. Evaluation of pseudo-haptic feedback for simulating torque: a comparison between isometric and elastic input devices. In 12th International Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2004. HAPTICS'04. Proceedings. IEEE, Chicago, IL, USA, 216--223.",
      "doi": ""
    },
    {
      "text": "Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. 2015. Softar: Visually manipulating haptic softness perception in spatial augmented reality. IEEE transactions on visualization and computer graphics 21, 11 (2015), 1279--1288.",
      "doi": ""
    },
    {
      "text": "Michael Rietzler, Florian Geiselhart, Jan Gugenheimer, and Enrico Rukzio. 2018. Breaking the Tracking: Enabling Weight Perception using Perceivable Tracking Offsets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 128.",
      "doi": "10.1145/3173574.3173702"
    },
    {
      "text": "Majed Samad, Elia Gatti, Anne Hermes, Hrvoje Benko, and Cesare Parise. 2019. Pseudo-Haptic Weight: Changing the Perceived Weight of Virtual Objects By Manipulating Control-Display Ratio. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland, UK, 320.",
      "doi": "10.1145/3290605.3300550"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland, UK, 11.",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Adalberto L Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional reality: Using the physical environment to design virtual reality experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul, Republic of Korea, 3307--3316.",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Mel Slater and Maria V Sanchez-Vives. 2016. Enhancing our lives with immersive virtual reality. Frontiers in Robotics and AI 3 (2016), 74.",
      "doi": ""
    },
    {
      "text": "Jonas Spillmann, Stefan Tuchschmid, and Matthias Harders. 2013. Adaptive space warping to enhance passive haptics in an arthroscopy surgical simulator. IEEE transactions on visualization and computer graphics 19, 4 (2013), 626--633.",
      "doi": "10.1109/TVCG.2013.23"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of detection thresholds for redirected walking techniques. IEEE transactions on visualization and computer graphics 16, 1 (2010), 17--27.",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Evan A Suma, Seth Clark, Samantha L Finkelstein, and Zachary Wartell. 2010. Exploiting change blindness to expand walkable space in a virtual environment. In Virtual Reality Conference (VR), 2010 IEEE. IEEE, Waltham, MA, USA, 305--306.",
      "doi": "10.1109/VR.2010.5444752"
    },
    {
      "text": "Jackie Junrui Yang, Hiroshi Horii, Alexander Thayer, and Rafael Ballagas. 2018. VR Grabbers: Ungrounded Haptic Retargeting for Precision Grabbing Tools. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, Berlin, Germany, 889--899.",
      "doi": "10.1145/3242587.3242643"
    },
    {
      "text": "Andre Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE transactions on visualization and computer graphics 23, 4 (2017), 1285--1294.",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2019. Drag:On: A Virtual Reality Controller Providing Haptic Feedback Based on Drag and Weight Shift. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland, UK, 211.",
      "doi": "10.1145/3290605.3300441"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2019. Estimating Detection Thresholds for Desktop-Scale Hand Redirection in Virtual Reality. In Virtual Reality and 3D User Interfaces 2019. IEEE, Osaka, Japan, 47--55.",
      "doi": ""
    },
    {
      "text": "Yiwei Zhao and Sean Follmer. 2018. A Functional Optimization Based Approach for Continuous 3D Retargeted Touch of Arbitrary, Complex Boundaries in Haptic Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 544.",
      "doi": "10.1145/3173574.3174118"
    },
    {
      "text": "Kening Zhu, Taizhou Chen, Feng Han, and Yi-Shiun Wu. 2019. HapTwist: creating interactive haptic proxies in virtual reality using low-cost twistable artefacts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland, UK, 693.",
      "doi": "10.1145/3290605.3300923"
    }
  ]
}