{
  "doi": "10.1145/3313831.3376130",
  "title": "Considering Parents in Coding Kit Design: Understanding Parents' Perspectives and Roles",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "As education researchers, policymakers, and industry leaders recognize the importance of computing, many coding kits (toys and apps) have emerged to help young children learn to code at home. However, how parents perceive and support their children's use of the kits at home are less understood. In this study, we performed semi-structured interviews with eighteen parents who obtained coding kits for their young children for home use. The results show parents expected their kids to have fun and meaningful interactions with the kits. In supporting the play, parents took on various roles, mostly acting as spectator, scaffolder, and teacher. While parents perceived benefits of coding kits like a changed perspective on coding, they also reported concerns, such as their limited programming knowledge to provide help. Finally, we reflect on design and research implications to develop coding kits that consider parents' perspectives and important roles in supporting young children's exploration with computational thinking.",
  "tags": [
    "informal learning",
    "coding toys and kits",
    "young children",
    "educational technology",
    "parent roles",
    "parents' perspectives"
  ],
  "authors": [
    {
      "name": "Junnan Yu",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-99659276681/rel-imgonly/cute_kittens-wide.jpg",
      "acmid": "99659276681",
      "orcid": "0000-0002-0869-0304"
    },
    {
      "name": "Chenke Bai",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528877",
      "orcid": "missing"
    },
    {
      "name": "Ricarose Roque",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502704620",
      "orcid": "0000-0003-3100-2466"
    }
  ],
  "references": [
    {
      "text": "Anja Austermann, Seiji Yamada, Kotaro Funakoshi, and Mikio Nakano. 2010. How Do Users Interact with a Pet-robot And a umanoid. In CHI '10 Extended Abstracts on Human Factors in Computing Systems. ACM, Atlanta, Georgia, USA, 3727. DOI: http://dx.doi.org/10.1145/1753846.1754046",
      "doi": "10.1145/1753846.1754046"
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as Learning Partners in the Development of Technological Fluency. International Journal of Learning and Media 1, 2 (2009), 55--77. DOI: http://dx.doi.org/10.1162/ijlm.2009.0021",
      "doi": ""
    },
    {
      "text": "Marina Bers, Iris Ponte, K Juelich, A Vera, and J Schenker. 2002. Teachers as Designers: Integrating Robotics in Early Childhood Education. Information Technology in Childhood Education Annual 2002, 1 (2002), 123--145. https://www.learntechlib.org/primary/p/8850/",
      "doi": ""
    },
    {
      "text": "Marina Umaschi Bers. 2017. Coding as a playground: Programming and computational thinking in the early childhood classroom. Routledge.",
      "doi": ""
    },
    {
      "text": "Lizzy Bleumers, Karen Mouws, Jonathan Huyghe, Maarten Van Mechelen, Ilse Mariën, and Bieke Zaman. 2015. Sensitivity to parental play beliefs and mediation in young children's hybrid play activities. In Proceedings of the 14th International Conference on Interaction Design and Children. ACM, Boston, 170--177. DOI: http://dx.doi.org/10.1145/2771839.2771857",
      "doi": "10.1145/2771839.2771857"
    },
    {
      "text": "Bee Bot. 2019. https://www.tts-group.co.uk/ bee-bot-programmable-floor-robot/1015268.html. (2019).",
      "doi": ""
    },
    {
      "text": "Jeroen Bourgonjon, Martin Valcke, Ronald Soetaert, Bram De Wever, and Tammy Schellens. 2011. Parental acceptance of digital game-based learning. Computers and Education 57, 1 (2011), 1434--1444. DOI: http://dx.doi.org/10.1016/j.compedu.2010.12.012",
      "doi": "10.1016/j.compedu.2010.12.012"
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. In annual American Educational Research Association meeting, Vancouver, BC, Canada. 1--25. DOI: http://dx.doi.org/10.1.1.296.6602",
      "doi": ""
    },
    {
      "text": "J. Cassell and K. Ryokai. 2001. Making Space for Voice: Technologies to Support Children's Fantasy and Storytelling. Personal and Ubiquitous Computing 5, 3 (2001), 169--190. DOI: http://dx.doi.org/10.1007/PL00000018",
      "doi": "10.1007/PL00000018"
    },
    {
      "text": "Erin Cejka, Chris Rogers, and Merredith Portsmore. 2006. Kindergarten Robotics : Using Robotics to Motivate Math , Science , and Engineering Literacy in Elementary School. International Journal of Engineering Education 22, 4 (2006), 711--722.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis. SAGE Publications. 224 pages.",
      "doi": ""
    },
    {
      "text": "Lynn Schofield Clark. 2011. Parental Mediation Theory for the Digital Age. Communication Theory 21, 4 (2011), 323--343. DOI: http://dx.doi.org/10.1111/j.1468--2885.2011.01391.x",
      "doi": "10.1111/j.1468-"
    },
    {
      "text": "Douglas H. Clements and Dominic F. Gullo. 1984. Effects of computer programming on young children's cognition. Journal of Educational Psychology 76(6) (1984), 1051--1058. DOI: http://dx.doi.org/10.1037/0022-0663.76.6.1051",
      "doi": ""
    },
    {
      "text": "Code-a-pillar. 2019. https://www.target.com/p/ fisher-price-think-learn-code-a-pillar/-/A-50720193. (2019).",
      "doi": ""
    },
    {
      "text": "Coding Awbie. 2019. https://www.playosmo.com/en/coding/. (2019).",
      "doi": ""
    },
    {
      "text": "Yeshe Colliver. 2016. Mothers' Perspectives on Learning through Play in the Home. Australasian Journal of Early Childhood 41, 1 (2016). DOI: http://dx.doi.org/https://doi.org/10.1177/183693911604100102",
      "doi": ""
    },
    {
      "text": "Yeshe Colliver, Maria Hatzigianni, and Ben Davies. 2019. Why can't I find quality apps for my child? A model to understand all stakeholders' perspectives on quality learning through digital play. Early Child Development and Care (2019), 1--15. DOI: http://dx.doi.org/10.1080/03004430.2019.1596901",
      "doi": ""
    },
    {
      "text": "Cubelets. 2019. https://www.modrobotics.com/cubelets/. (2019).",
      "doi": ""
    },
    {
      "text": "Cubetto. 2019. https://www.primotoys.com/. (2019).",
      "doi": ""
    },
    {
      "text": "Jan Cuny, Larry Snyder, and Jeannette M. Wing. 2010. Demystifying Computational Thinking for Non-Computer Scientists. Unpublished manuscript in progress (2010).",
      "doi": ""
    },
    {
      "text": "Annwesa Dasgupta, Anastasia Marie Rynearson, Senay Purzer, Hoda Ehsan, and Monica E Cardella. 2017. Computational Thinking in K-2 Classrooms : Evidence from Student Arti- facts ( Fundamental ). In 2017 ASEE Annual Conference & Exposition. Columbus, Ohio, 22. https://peer.asee.org/28062",
      "doi": ""
    },
    {
      "text": "Dash & Dot. 2019. https://www.makewonder.com/. (2019).",
      "doi": ""
    },
    {
      "text": "H Ehsan, C Beebe, and M E Cardella. 2017. Promoting computational thinking in children using apps. In ASEE Annual Conference and Exposition, Conference Proceedings, Vol. 2017-June. https://www.scopus.com/ inward/record.uri?eid=2-s2.0--85030538569&partnerID= 40&md5=fd46714b61a8323926a755f4bace060d",
      "doi": ""
    },
    {
      "text": "Lina Eklund and Karin Helmersson Bergmark. 2013. Parental Mediation of Digital Gaming and Internet Use. In FDG 2013: The 8th International Conference on the Foundations of Digital Games. 63--70. http://su.diva-portal.org/smash/record.jsf?pid=diva2:",
      "doi": ""
    },
    {
      "text": "Nermeen E. El Nokali, Heather J. Bachman, and Elizabeth Votruba-Drzal. 2010. Parent involvement and children's academic and social development in elementary school. Child Development 81, 3 (2010), 988--1005. DOI: http://dx.doi.org/10.1111/j.1467--8624.2010.01447.x",
      "doi": ""
    },
    {
      "text": "Louise P. Flannery, Elizabeth R. Kazakoff, Paula Bontá, Brian Silverman, Marina Umaschi Bers, Mitchel Resnick, Elizabeth R. Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: Support for Early Childhood Learning Through Computer Programming. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). 1--10. DOI: http://dx.doi.org/10.1145/2485760.2485785",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "Jill J. Francis, Marie Johnston, Clare Robertson, Liz Glidewell, Vikki Entwistle, Martin P. Eccles, and Jeremy M. Grimshaw. 2010. What is an adequate sample size? Operationalising data saturation for theory-based interview studies. Psychology and Health 25, 10 (2010), 1229--1245. DOI: http://dx.doi.org/10.1080/08870440903194015",
      "doi": ""
    },
    {
      "text": "Janet Go, Rafael Ballagas, and Mirjana Spasojevic. 2012. Brothers and Sisters at Play: Exploring Game Play with Siblings. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, Seattle, Washington, USA, 739--748. DOI: http://dx.doi.org/10.1145/2145204.2145316",
      "doi": "10.1145/2145204.2145316"
    },
    {
      "text": "Shayl F Griffith and David H Arnold. 2018. Home learning in the new mobile age : parent-child interactions during joint play with educational apps in the US. Journal of Children and Media 13, 1 (2018), 1--19. DOI: http://dx.doi.org/10.1080/17482798.2018.1489866",
      "doi": ""
    },
    {
      "text": "Diley Hernandez, Shaheen Rana, Meltem Alemdar, Analia Rao, and Marion Usselman. 2016. Latino Parents' Educational Values and STEM Beliefs. Journal for Multicultural Education 10, 3 (2016), 354--367. DOI: http://dx.doi.org/https://doi.org/10.1108/JME-12--2015-0042",
      "doi": ""
    },
    {
      "text": "Brianna Hightower and Ellen Wartella. 2019. Exploring Parent Use of Early STEM Media to Inform Design for Children. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. ACM, Boise, ID, USA, 102--108. DOI: http://dx.doi.org/10.1145/3311927.3323124",
      "doi": "10.1145/3311927.3323124"
    },
    {
      "text": "Alexis Hiniker, Bongshin Lee, Julie A Kientz, and Jenny S Radesky. 2018. Let's Play! Digital and Analog Play Patterns between Preschoolers and Parents. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3174233",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Bongshin Lee, Kiley Sobel, and Eun Kyoung Choe. 2017. Plan & Play: Supporting Intentional Media Use in Early Childhood. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, Stanford, CA, USA, 85--95. DOI: http://dx.doi.org/10.1145/3078072.3079752",
      "doi": "10.1145/3078072.3079752"
    },
    {
      "text": "Kathy Hirsh-Pasek, Jennifer M. Zosh, Roberta Michnick Golinkoff, James H. Gray, Michael B. Robb, and Jordy Kaufman. 2015. Putting Education in \"Educational\" Apps: Lessons From the Science of Learning. Vol. 16. 3--34 pages. DOI: http://dx.doi.org/10.1177/1529100615569721",
      "doi": ""
    },
    {
      "text": "Michael S Horn, Sarah Alsulaiman, and Jaime Koh. 2013. Translating Roberto to Omar : Computational Literacy , Stickerbooks , and Cultural Forms. In Proceedings of the 12th International Conference on Interaction Design and Children - IDC '13. 120--127. DOI: http://dx.doi.org/10.1145/2485760.2485773",
      "doi": "10.1145/2485760.2485773"
    },
    {
      "text": "Michael S Horn, Erin Treacy Solovey, R Jordan Crouser, and Robert J K Jacob. 2009. Comparing the use of tangible and graphical programming languages for informal science education. In Proceedings of the 27th international conference on Human factors in computing systems CHI 09, Vol. 32. 975. DOI: http://dx.doi.org/10.1145/1518701.1518851",
      "doi": "10.1145/1518701.1518851"
    },
    {
      "text": "Nesrin Isikoglu Erdogan, James E. Johnson, Pool Ip Dong, and Zhihui Qiu. 2019. Do Parents Prefer Digital Play? Examination of Parental Preferences and Beliefs in Four Nations. Early Childhood Education Journal 47, 2 (2019), 131--142. DOI: http://dx.doi.org/10.1007/s10643-018-0901--2",
      "doi": ""
    },
    {
      "text": "Mizuko Ito, Sonja Baumer, Matteo Bittanti, Rachel Cody, Becky Herr Stephenson, Heather A Horst, Patricia G Lange, Dilan Mahendran, Katynka Z Martínez, CJ Pascoe, Dan Perkel, Laura Robinson, Christo Sims, and Lisa Tripp. 2009. Hanging out, messing around, and geeking out: Kids living and learning with new media. MIT press, Cambridge, MA, USA. 440 pages.",
      "doi": ""
    },
    {
      "text": "Daniel Keyser, Haksoon Ahn, and Jay Unick. 2017. Predictors of behavioral problems in young children 3 to 9 years old: The role of maternal and child factors. Children and Youth Services Review 82, May (2017), 149--155. DOI: http://dx.doi.org/10.1016/j.childyouth.2017.09.018",
      "doi": ""
    },
    {
      "text": "Jerome Kirk and Marc L Miller. 1986. Reliability and validity in qualitative research. Vol. 1. Sage.",
      "doi": ""
    },
    {
      "text": "Lawrence A. Kutner, Cheryl K. Olson, Dorothy E. Warner, and Sarah M. Hertzog. 2007. Parents' and Sons' Perspectives on Video Game Play: A Qualitative Study. Journal of Adolescent Research 23, 1 (2007), 76--96. DOI: http://dx.doi.org/10.1177/0743558407310721",
      "doi": ""
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1 (1977), 159--174. DOI: http://dx.doi.org/10.1109/ICDMA.2010.328",
      "doi": ""
    },
    {
      "text": "Lightbot. 2019. http://lightbot.com/index.html. (2019).",
      "doi": ""
    },
    {
      "text": "Thomas R Lindlof and Bryan C Taylor. 2017. Qualitative communication research methods. Sage publications.",
      "doi": ""
    },
    {
      "text": "Caitlin K Martin, Nichole Pinkard, Sheena Erete, and Jim Sandherr. 2016. Connections at the family level: Supporting parents and caring adults to engage youth in learning about computers and technology. In Moving Students of Color from Consumers to Producers of Technology. IGI Global, 220--244. DOI: http://dx.doi.org/0.4018/978--1--5225--2005--4.ch011",
      "doi": ""
    },
    {
      "text": "Jane Mavoa, Marcus Carter, and Martin Gibbs. 2017. Beyond Addiction: Positive and Negative Parent Perceptions of Minecraft Play. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '17. 171--181. DOI: http://dx.doi.org/10.1145/3116595.3116638",
      "doi": "10.1145/3116595.3116638"
    },
    {
      "text": "Micro:bit. 2019. https://microbit.org/. (2019).",
      "doi": ""
    },
    {
      "text": "Move the Turtle. 2019. http://movetheturtle.com/. (2019).",
      "doi": ""
    },
    {
      "text": "National Research Council. 2011. Report of a workshop on the pedagogical aspects of computational thinking. National Academies Press.",
      "doi": ""
    },
    {
      "text": "Docile J. Niemeyer. 2016. Four employed, middle-class, suburban mothers' understanding and acceptance of the learning potential of videogames. Ph.D. Dissertation. Sam Houston State University. https://colorado.idm.oclc.org/login?url=https://search. proquest.com/docview/1860923647?accountid=14503",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Marjon Schols. 2015. How and Why Parents Guide the Media Use of Young Children. Journal of Child and Family Studies 24, 11 (2015), 3423--3435. DOI: http://dx.doi.org/10.1007/s10826-015-0144--4",
      "doi": ""
    },
    {
      "text": "Stamatios Papadakis, Michail Kalogiannakis, and Nicholas Zaranis. 2016. Developing fundamental programming concepts and computational thinking with ScratchJr in preschool education: a case study. International Journal of Mobile Learning and Organisation 10, 3 (2016), 187. DOI: http://dx.doi.org/10.1504/IJMLO.2016.077867",
      "doi": "10.1504/IJMLO.2016.077867"
    },
    {
      "text": "Sandra Petersen, Susan Houston, Huanying Qin, Corey Tague, and Jill Studley. 2017. The Utilization of Robotic Pets in Dementia Care. Journal of Alzheimer's Disease 55, 2 (2017), 569--574. DOI: http://dx.doi.org/10.3233/JAD-160703",
      "doi": ""
    },
    {
      "text": "Marc Prensky. 2008. Programming : The New Literacy. Edutopia (2008), 1--5.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque. 2016. Family Creative Learning. In Makeology in K-12, Higher, and Informal Education. Routeledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2016. I'm Not Just a Mom: Parents Developing Multiple Roles in Creative Computing. In 12th International Conference of the Learning Sciences. 663--671.",
      "doi": ""
    },
    {
      "text": "Kimiko Ryokai, Hayes Raffle, and Robert Kowalski. 2012. StoryFaces: Pretend-play with Ebooks to Support Social-Emotional Storytelling. In Proceedings of the 11th International Conference on Interaction Design and Children. 125--133. DOI: http://dx.doi.org/10.1145/2307096.2307111",
      "doi": "10.1145/2307096.2307111"
    },
    {
      "text": "Ofir Sadka and Oren Zuckerman. 2017. From Parents to Mentors: Parent-Child Interaction in Co-Making Activities. In Proceedings of the 2017 Conference on Interaction Design and Children. 609--615. DOI: http://dx.doi.org/10.1145/3078072.3084332",
      "doi": "10.1145/3078072.3084332"
    },
    {
      "text": "ScratchJr. 2019. http://scratchjr.org. (2019).",
      "doi": ""
    },
    {
      "text": "Katerina Sergi, Ronald Gatewood, Anastasia Elder, and Jianzhong Xu. 2017. Parental Perspectives on Children's Use of Portable Digital Devices. Behaviour and Information Technology 36, 11 (2017), 1148--1161. DOI: http://dx.doi.org/10.1080/0144929X.2017.1360941",
      "doi": "10.5555/3159771.3159776"
    },
    {
      "text": "Kiley Sobel, Arpita Bhattacharya, Alexis Hiniker, Jin Ha Lee, Julie A. Kiemtz, and Jason C. Yip. 2017. \"It wasn't really about the Pokémon\": Parents' Perspectives on a Location-Based Mobile Game. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 1483--1496. DOI: http://dx.doi.org/10.1145/3025453.3025761",
      "doi": ""
    },
    {
      "text": "Kiley Sobel, Kate Yen, Yi Cheng, Yeqi Chen, and Alexis Hiniker. 2019. No touch pig! Investigating child-parent use of a system for training executive function. In Proceedings of the 18th ACM International Conference on Interaction Design and Children, IDC 2019. 339--351. DOI: http://dx.doi.org/10.1145/3311927.3323132",
      "doi": ""
    },
    {
      "text": "Sphero. 2019. https://www.sphero.com/. (2019).",
      "doi": ""
    },
    {
      "text": "Amanda Strawhacker, Melissa Lee, and Marina Umaschi Bers. 2018. Teaching Tools, Teachers' Rules: Exploring the Impact of Teaching Styles on Young Children's Programming Knowledge in ScratchJr. International Journal of Technology and Design Education 28, 2 (2018), 347--376. DOI: http://dx.doi.org/10.1007/s10798-017--9400--9",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi and Reed Stevens. 2011. The New Coviewing: Designing for Learning through Joint Media Engagement. Technical Report. The Joan Ganz Cooney Center, New York.",
      "doi": ""
    },
    {
      "text": "The Toy Association. 2017. STEM/STEAM Formula for Success. Technical Report. 24 pages. https://www.toyassociation.org/App",
      "doi": ""
    },
    {
      "text": "L. S. Vygotsky. 1980. Mind in Society: The Development of Higher Psychological Processes. Harvard University Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Ellen Wartella. 2013. Parenting in the Age of Technology. Technical Report. Northwestern University. https://contemporaryfamilies.org/wp-content/uploads/ 2014/04/Wartella.pdf",
      "doi": ""
    },
    {
      "text": "J M Wing. 2006. Computational Thinking. Commun. ACM 49, 3 (2006), 33--35.",
      "doi": "10.1145/1118178.1118215"
    },
    {
      "text": "David Wood, Jerome S. Bruner, and Gail Ross. 1976. The Role of Tutoring in Problem Solving. Journal of Child Psychology & Psychiatry 17, 2 (1976), 89--100. https://doi.org/10.1111/j.1469--7610.1976.tb00381.x",
      "doi": ""
    },
    {
      "text": "Nicola Yelland and Jennifer Masters. 2007. Rethinking Scaffolding in the Information Age. Computers and Education 48, 3 (2007), 362--382. DOI: http://dx.doi.org/10.1016/j.compedu.2005.01.010",
      "doi": "10.1016/j.compedu.2005.01.010"
    },
    {
      "text": "J. Yu and R. Roque. 2019. A review of computational toys and kits for young children. International Journal of Child-Computer Interaction 21 (2019), 17--36. DOI: http://dx.doi.org/10.1016/j.ijcci.2019.04.001",
      "doi": "10.1016/j.ijcci.2019.04.001"
    }
  ]
}