{
  "doi": "10.1145/3313831.3376859",
  "title": "Technology for Situated and Emergent Play: A Bridging Concept and Design Agenda",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Despite the capacity of play to spontaneously emerge in our daily life, the scope of application of play design in HCI is generally narrower, specifically targeting areas of pure leisure, or wholly utilitarian and productive play. Here we focus on the value of play design to respond to and support our natural gravitation towards emergent play that helps to meet our social and emotional needs. We present a bridging concept: Technology for Situated and Emergent Play, i.e. technology design that supports playful engagement that emerges interwoven with our everyday activities outside leisure, and that enriches these activities with socio-emotional value. Our intermediate-level contribution has value as a synthesis piece: it weaves together theories of play and play design and bridges them with concrete design examples. As a bridging concept, it contributes: i) theoretical grounding; ii) inspiring design exemplars that illustrate the theory and foreground its value; and iii) design articulations in the form of valuable experiential qualities and design features. Our work can help to focus design agendas for playful technology and inspire future designs in this space.",
  "authors": [
    {
      "name": "Ferran Altarriba Bertran",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277137",
      "orcid": "missing"
    },
    {
      "name": "Elena Márquez Segura",
      "institution": "Uppsala University, Uppsala, Sweden",
      "img": "/do/10.1145/contrib-99659077589/rel-imgonly/99659077589.jpg",
      "acmid": "99659077589",
      "orcid": "missing"
    },
    {
      "name": "Katherine Isbister",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-99659489823/rel-imgonly/ella-square.jpg",
      "acmid": "99659489823",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ferran Altarriba Bertran and James Miller. 2014. What if you were in?. Retrieved on November 30, 2018 from http://ferranaltarriba.com/projects/wiywi/",
      "doi": ""
    },
    {
      "text": "Ferran Altarriba Bertran, Elena Márquez Segura, Jared Duval, and Katherine Isbister. 2019. Chasing Play Potentials: Towards an Increasingly Situated and Emergent Approach to Everyday Play Design. In Proceedings of the 2019 Designing Interactive Systems Conference 2019. ACM.",
      "doi": "10.1145/3322276.3322325"
    },
    {
      "text": "Jon Back, Elena Márquez Segura, and Annika Waern. 2017. Designing for Transformative Play. ACM Trans. Comput.-Hum. Interact. 24, 3: 18:1--18:28. https://doi.org/10.1145/3057921",
      "doi": "10.1145/3057921"
    },
    {
      "text": "Susanne Bødker. 2006, October. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles (pp. 1--8). ACM.",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Susanne Bødker. 2015. Third-wave HCI, 10 years later--participation and sharing. Interactions, 22(5), 24--31.",
      "doi": "10.1145/2804405"
    },
    {
      "text": "Ian Bogost. 2016. Play anything: The pleasure of limits, the uses of boredom, and the secret of games. Basic Books.",
      "doi": ""
    },
    {
      "text": "Stuart L. Brown. 2009. Play: How it shapes the brain, opens the imagination, and invigorates the soul. Penguin.",
      "doi": ""
    },
    {
      "text": "Barry Brown and Oskar Juhlin. 2015. Enjoying machines. Mit Press.",
      "doi": ""
    },
    {
      "text": "Oliver Burkeman. 2018. The Promise of Play. NewPhilosopher, Issue 20, May-July 2018.",
      "doi": ""
    },
    {
      "text": "Roger Caillois. 2001. Man, play, and games. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Nuno Castelhano and Licínio Roque. 2017. Lessons From Designing a Game to Support Playfulness in Multisensory Stimulation Environments. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 57--68. DOI: https://doi.org/10.1145/3116595.3116599",
      "doi": "10.1145/3116595.3116599"
    },
    {
      "text": "Simon Critchley. 2018. Being Outside of Yourself. NewPhilosopher, Issue 20, May-July 2018.",
      "doi": ""
    },
    {
      "text": "João P. Costa, Rina R. Wehbe, James Robb, and Lennart E. Nacke. 2013. Time's up: studying leaderboards for engaging punctual behaviour. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Gamification '13). ACM, NY, NY, USA, 26--33. DOI=http://dx.doi.org/10.1145/2583008.2583012",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1997. Finding flow: The psychology of engagement with everyday life. Basic Books.",
      "doi": ""
    },
    {
      "text": "Ella Dagan, Elena Márquez Segura, Ferran Altarriba Bertran, Miguel Flores, and Katherine Isbister. In Press. Designing \"True Colors': A Social Wearable that Affords Vulnerability. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19).",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Christian Dindler. 2014. Between theory and practice: bridging concepts in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1635--1644. DOI=http://dx.doi.org/10.1145/2556288.2557342",
      "doi": "10.1145/2556288.2557342"
    },
    {
      "text": "Bernard DeKoven. 2013. The Well-Played Game: A Player's Philosophy. The MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/2535025"
    },
    {
      "text": "Sebastian Deterding. 2009. The Game Frame: Systemizing a Goffmanian Approach to Video Game Theory.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining \"gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, NY, NY, USA, 9--15. DOI: https://doi.org/10.1145/2181037.2181040",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Sebastian Deterding. 2015. A Manifesto, With Footnotes. A Review of Miguel Sicart's ?Play Matters\". Game Studies, 15(1).",
      "doi": ""
    },
    {
      "text": "Fred O. Donaldson and Ole V. Lassen. 2002. Playing by heart: The vision and practice of belonging. Danmarks Blindebibliotek.",
      "doi": ""
    },
    {
      "text": "Sandro Engel and Amelie Künzler. 2012. StreetPong. Retrieved on November 16, 2018 from http://www.streetpong.info.",
      "doi": ""
    },
    {
      "text": "Traci L. Galinsky, Roger R. Rosa, Joel S. Warm, and William N. Dember. 1993. Psychophysical Determinants of Stress in Sustained Attention. Human Factors 35, 4: 603--614. https://doi.org/10.1177/001872089303500402",
      "doi": ""
    },
    {
      "text": "Sarah Gallacher, Jenny O'Connor, Jon Bird, Yvonne Rogers, Licia Capra, Daniel Harrison, and Paul Marshall. 2015. Mood Squeezer: Lightening up the Workplace through Playful and Lightweight Interactions. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 891--902. DOI: https://doi.org/10.1145/2675133.2675170",
      "doi": "10.1145/2675133.2675170"
    },
    {
      "text": "Bill Gaver. 2002. Designing for Homo Ludens. I3 Magazine 12. Retrieved from https://www.gold.ac.uk/media/documentsbysection/departments/research-centresandunits/research-units/interactionresearchstudio/27gaver.ludens.02.pdf",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 233--240. DOI=http://dx.doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The drift table: designing for ludic engagement. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 885--900. DOI: https://doi.org/10.1145/985921.985947",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 937946. DOI: https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Erving Goffman. 1986. Frame Analysis: An Essay on the Organization of Experience. Northeastern University Press.",
      "doi": ""
    },
    {
      "text": "Melissa Gregg. 2011. Work's Intimacy. Polity Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Melissa Gregg. 2014. Presence Bleed: Performing Professionalism Online. Retrieved January 4, 2019 from https://www.academia.edu/1513344/Presence_Bleed_P erforming_Professionalism_Online",
      "doi": ""
    },
    {
      "text": "Begoña Gros. 2007. Digital games in education: The design of games-based learning environments. Journal of research on technology in education, 40(1), 23--38.",
      "doi": ""
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow Technology -- Designing for Reflection. Personal Ubiquitous Comput. 5, 3 (January 2001), 201--212. DOI=http://dx.doi.org/10.1007/PL00000019",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Luther Halsey Gulick. 1920. A philosophy of play. McGrath Publishing Company.",
      "doi": ""
    },
    {
      "text": "Deepi Harish. 2017. #FoodPorn Is Changing The Way Millennials Eat. In Huffington Post. Published on March 24th, 2017. Accessed on October 23rd, 2018 at https://www.huffingtonpost.ca/deepi-harish/foodporneating-habits_b_15574714.html",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007, April. The three paradigms of HCI. In Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA (pp. 1--18).",
      "doi": ""
    },
    {
      "text": "Mads Hobye. 2014. Designing for Homo Explorens: open social play in performative frames. Faculty of Culture and Society Malmö University.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on ComputerHuman Interaction (TOCHI), 19(3), 23.",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 3131--3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline C. M. Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Floyd Müller, Marianne Graves Petersen, Thecla Schiphorst, Elena Márquez Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1: 8. https://doi.org/10.3390/informatics5010008",
      "doi": ""
    },
    {
      "text": "Xiyuan Hou and Olga Sourina. 2013. Emotion-enabled haptic-based serious game for post stroke rehabilitation. In Proceedings of the 19th ACM Symposium on Virtual Reality Software and Technology (VRST '13). ACM, NY, NY, USA, 31--34. DOI: https://doi.org/10.1145/2503713.2503738",
      "doi": "10.1145/2503713.2503738"
    },
    {
      "text": "Johan Huizinga. 1950. Homo Ludens: A Study of the Play Element in Culture. Beacon Press.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. 2011. Emotion and Motion: Games As Inspiration for Shaping the Future of Interface. interactions 18, 5: 24--27. https://doi.org/10.1145/2008176.2008184",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. 2016. How games move us: Emotion by design. MIT Press.",
      "doi": "10.5555/2927483"
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, and Edward F. Melcer. 2018. Social Affordances at Play: Game Design Toward Socio-Technical Innovation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 372, 10 pages. DOI: https://doi.org/10.1145/3173574.3173946",
      "doi": ""
    },
    {
      "text": "Jaakkoo Stenros. 2012. In Defence of a Magic Circle: The Social and Mental Boundaries of Play. In DIGRA 2012. Retrieved from http://www.digra.org/wpcontent/uploads/digital-library/12168.43543.pdf",
      "doi": ""
    },
    {
      "text": "Carl Gustav Jung. 1924. Psychological types. New York.",
      "doi": ""
    },
    {
      "text": "Druv Khullar. 2016. How social isolation is killing us. New York Times, Dec 22, 2016.",
      "doi": ""
    },
    {
      "text": "Carol Kranowitz. 2006. The Out-of-Sync Child Has Fun, Revised Edition: Activities for Kids with Sensory Processing Disorder. Penguin.",
      "doi": ""
    },
    {
      "text": "Nicole Lazzaro. 2004. Why we play games: Four keys to more emotion without story.",
      "doi": ""
    },
    {
      "text": "Conor Linehan, Sabine Harrer, Ben Kirman, Shaun Lawson, and Marcus Carter. 2015. Games Against Health: A Player-Centered Design Philosophy. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 589--600. DOI: https://doi.org/10.1145/2702613.2732514",
      "doi": "10.1145/2702613.2732514"
    },
    {
      "text": "Can Liu, Ben Bengler, Danilo Di Cuia, Katie Seaborn, Giovanna Nunes Vilaza, Sarah Gallacher, Licia Capra, and Yvonne Rogers. 2018. Pinsight: A Novel Way of Creating and Sharing Digital Content through 'Things' in the Wild. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 1169--1181. DOI: https://doi.org/10.1145/3196709.3196782",
      "doi": "10.1145/3196709.3196782"
    },
    {
      "text": "Jonas Löwgren. 2013. Annotated portfolios and other forms of intermediate-level knowledge. Interactions, 20(1), 30--34.",
      "doi": "10.1145/2405716.2405725"
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Luis Márquez Segura, and David López Recio. 2016. Playification: The PhySeEar case. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 376388. DOI: https://doi.org/10.1145/2967934.2968099",
      "doi": "10.1145/2967934.2968099"
    },
    {
      "text": "Elena Márquez Segura, James Fey, Ella Dagan, Samvid Niravbhai Jhaveri, Jared Pettitt, Miguel Flores, and Katherine Isbister. 2018. Designing Future Social Wearables with Live Action Role Play (Larp) Designers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 462, 14 pages. DOI: https://doi.org/10.1145/3173574.3174036",
      "doi": "10.1145/3173574.3174036"
    },
    {
      "text": "Joe Marshall and Conor Linehan. 2017. Misrepresentation of Health Research in Exertion Games Literature. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4899--4910. DOI: https://doi.org/10.1145/3025453.3025691",
      "doi": "10.1145/3025453.3025691"
    },
    {
      "text": "Jane McGonigal. 2011. Reality is broken: Why games make us better and how they can change the world. Penguin.",
      "doi": "10.5555/1972527"
    },
    {
      "text": "Karl Meier. 1980. An Affair of Flutes: An Appreciation of Play. Journal of the Philosophy of Sport, 7:1, 24--45.",
      "doi": ""
    },
    {
      "text": "David R. Michael and Sandra Chen. 2005. Serious games: Games that educate, train, and inform. Muska & Lipman/Premier-Trade.",
      "doi": ""
    },
    {
      "text": "Robb Mitchell, Alexandra Papadimitriou, Youran You, and Laurens Boer. 2015. Really eating together: a kinetic table to synchronise social dining experiences. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, NY, NY, USA, 173--174. DOI: http://dx.doi.org/10.1145/2735711.2735822",
      "doi": "10.1145/2735711.2735822"
    },
    {
      "text": "Ivan Mosca. 2012. + 10! Gamification and Degamification. G| A| M| E Games as Art, Media, Entertainment, 1(1).",
      "doi": ""
    },
    {
      "text": "Casey O'Donnell. 2014. Getting played: Gamification, bullshit, and the rise of algorithmic surveillance. Surveillance & Society, 12(3), 349.",
      "doi": ""
    },
    {
      "text": "Julian Oliver and Danja Vasiliev. 2011. Newstweek. Retrieved on November 12, 2018 from https://newstweek.com.",
      "doi": ""
    },
    {
      "text": "Ash Perrin. 2018. The Power of Play. TEDx Talks. Retrieved on November 30, 2018 from https://www.youtube.com/watch?v=VNAtVKLxjnA.",
      "doi": ""
    },
    {
      "text": "Rey, P. J. (2015). Gamification and post-fordist capitalism. The gameful world: Approaches, issues, applications, 277--296.",
      "doi": ""
    },
    {
      "text": "Holly Robbins and Katherine Isbister. 2014. Pixel Motion: A surveillance camera-enabled public digital game. In FDG.",
      "doi": ""
    },
    {
      "text": "Bertrand Russell. 1932. In Praise of Idleness.",
      "doi": ""
    },
    {
      "text": "Eric Sanchez, Shawn Young and Caroline JouneauSion. 2017. Classcraft: from gamification to ludicization of classroom management. Education and Information Technologies , 22(2), 497--513.",
      "doi": "10.1007/s10639-016-9489-6"
    },
    {
      "text": "Greg Satell. 2013. What Can We Expect From The Next Decade of Technology?. In Forbes. Retrieved on January 4, 2019 from https://www.forbes.com/sites/gregsatell/2013/06/29/what-can-we-expect-from-the-next-decade-of-technology",
      "doi": ""
    },
    {
      "text": "Kieran Setiya. 2017. Midlife: A Philosophical Guide. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "John Sharp and David Thomas. 2019. Fun, Taste, & Games: An Aesthetics of the Idle, Unproductive, and Otherwise Playful. MIT Press.",
      "doi": ""
    },
    {
      "text": "Miguel Sicart. 2014. Play matters. MIT Press.",
      "doi": "10.5555/2678068"
    },
    {
      "text": "Dewi Simon. 2016. Dinner with twenty fellow travellers. In blog.klm.com. Retreived on January 2, 2019 from https://blog.klm.com/dinner-with-twentyfellow-travellers/",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Nikki Theofanopoulou, Alessia Cecchet, Peter Cottrell, Ferran Altarriba Bertran, Ella Dagan, Julian Childs, and Katherine Isbister. 2018. \"I just let him cry...: Designing Socio-Technical Interventions in Families to Prevent Mental Health Disorders. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 160 (November 2018), 34 pages. DOI: https://doi.org/10.1145/3274429",
      "doi": "10.1145/3274429"
    },
    {
      "text": "Ed Smith. 2018. Play Like a Child. NewPhilosopher, Issue 20, May-July 2018.",
      "doi": ""
    },
    {
      "text": "Henrik Sproedt. 2012. Play. Learn. Innovate. Books on Demand.",
      "doi": ""
    },
    {
      "text": "J. Staff. 2014. Why is everyone so busy. The Economist. Retrieved from http://www.economist.com/news/christmasspecials/21636612-time-povertyproblempartly-perception-and-partly-distributionwhy.",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros. 2014. In defence of a magic circle: the social, mental and cultural boundaries of play.",
      "doi": ""
    },
    {
      "text": "Bernard Suits. 1978. The Grasshopper: Games, Life, and Utopia.",
      "doi": ""
    },
    {
      "text": "Pekka Sulkunen. 2009. The saturated society: Governing risk & lifestyles in consumer culture. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Brian Sutton-Smith. 2009. The ambiguity of play. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Rob Tieben, Tilde Bekker, and Ben Schouten. 2011. Curiosity and interaction: making people curious through interactive systems. In Proceedings of the 25th BCS Conference on Human-Computer Interaction (BCS-HCI '11). British Computer Society, Swinton, UK, UK, 361--370.",
      "doi": "10.5555/2305316.2305378"
    },
    {
      "text": "Mattia Thibault. 2017. Play as a Modelling System -- a Semiotic Analysis of the Overreaching Prestige of Games. In GamiFIN Conference 2017, Pori, Finland, May 9--10, 2017.",
      "doi": ""
    },
    {
      "text": "Debbe Thompson, Tom Baranowski, Richard Buday Janice Baranowski, Victoria Thompson, Russell Jago and Melissa Juliano Griffith. 2010. Serious video games for health: How behavioral science guided the development of a serious video game. Simulation & gaming, 41(4), 587--606.",
      "doi": ""
    },
    {
      "text": "Alfonso Troisi, Sergio Belsanti, Anna R. Bucci, Cristina Mosco, Fabiola Sinti, and Monica Verucci. 2000. Affect regulation in alexithymia: an ethological study of displacement behavior during psychiatric interviews. The Journal of Nervous and Mental Disease 188, 1: 13--18.",
      "doi": ""
    },
    {
      "text": "Stacey Watson, Julio César Bahamón, Harini Ramaprasad, and Heather Richter Lipford. 2018. Developing Soft Skills with a Classroom Behavior Management Game. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education (SIGCSE '18). ACM, NY, NY, USA, 1092--1092. DOI: https://doi.org/10.1145/3159450.3162247",
      "doi": "10.1145/3159450.3162247"
    },
    {
      "text": "Eric Zimmerman. 2015. Manifesto for a ludic century. The gameful world: Approaches, issues, applications, 19--22.",
      "doi": ""
    }
  ]
}