{
  "doi": "10.1145/3313831.3376313",
  "title": "Gripmarks: Using Hand Grips to Transform In-Hand Objects into Mixed Reality Input",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "We introduce Gripmarks, a system that enables users to opportunistically use objects they are already holding as input surfaces for mixed reality head-mounted displays (HMD). Leveraging handheld objects reduces the need for users to free up their hands or acquire a controller to interact with their HMD. Gripmarks associate a particular hand grip with the shape primitive of the physical object without the need of object recognition or instrumenting the object. From the grip pose and shape primitive we can infer the surface of the object. With an activation gesture, we can enable the object for use as input to the HMD. With five gripmarks we demonstrate a recognition rate of 94.2%; we show that our grip detection benefits from the physical constraints of holding an object. We explore two categories of input objects 1) tangible surfaces and 2) tangible tools and present two representative applications. We discuss the design and technical challenges for expanding the concept.",
  "authors": [
    {
      "name": "Qian Zhou",
      "institution": "Facebook Reality Labs & University of British Columbia, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161417",
      "orcid": "missing"
    },
    {
      "name": "Sarah Sykes",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958969457",
      "orcid": "missing"
    },
    {
      "name": "Sidney Fels",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327488395",
      "orcid": "0000-0001-9279-9021"
    },
    {
      "name": "Kenrick Kin",
      "institution": "Facebook Reality Labs, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435604849",
      "orcid": "0000-0002-3956-9793"
    }
  ],
  "references": [
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D Wilson. 2016. Haptic retargeting: Dynamic repurposing of passive haptics for enhanced virtual reality experiences. In Proceedings of the 2016 chi conference on human factors in computing systems. ACM, 1968--1979. DOI: http://dx.doi.org/10.1145/2858036.2858226",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Hong Cheng, Lu Yang, and Zicheng Liu. 2015. Survey on 3D hand gesture recognition. IEEE transactions on circuits and systems for video technology 26, 9 (2015), 1659--1673. DOI: http://dx.doi.org/10.1109/TCSVT.2015.2469551",
      "doi": ""
    },
    {
      "text": "Kai-Yin Cheng, Rong-Hao Liang, Bing-Yu Chen, Rung-Huei Laing, and Sy-Yen Kuo. 2010. iCon: utilizing everyday objects as additional, auxiliary and instant tabletop controllers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1155--1164. DOI: http://dx.doi.org/10.1145/1753326.1753499",
      "doi": "10.1145/1753326.1753499"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D Wilson. 2017. Sparse haptic proxy: Touch feedback in virtual environments using a general passive prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3718--3728. DOI: http://dx.doi.org/10.1145/3025453.3025753",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Ming Jin Cheok, Zaid Omar, and Mohamed Hisham Jaward. 2019. A review of hand gesture and sign language recognition techniques. International Journal of Machine Learning and Cybernetics 10, 1 (2019), 131--153. DOI: http://dx.doi.org/10.1007/s13042-017-0705--5",
      "doi": ""
    },
    {
      "text": "Christian Corsten, Ignacio Avellino, Max Möllers, and Jan Borchers. 2013. Instant user interfaces: repurposing everyday objects as input devices. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces. ACM, 71--80. DOI: http://dx.doi.org/10.1145/2512349.2512799",
      "doi": "10.1145/2512349.2512799"
    },
    {
      "text": "Andy Crabtree and Peter Tolmie. 2016. A Day in the Life of Things in the Home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1738--1750. DOI: http://dx.doi.org/10.1145/2818048.2819954",
      "doi": "10.1145/2818048.2819954"
    },
    {
      "text": "John Dudley, Hrvoje Benko, Daniel Wigdor, and Per Ola Kristensson. 2019. Performance envelopes of virtual keyboard text input strategies in virtual reality. In Proceedings of the 17th IEEE International Symposium on Mixed and Augmented Reality. 289--300. DOI: http://dx.doi.org/10.1109/ISMAR.2019.00027",
      "doi": ""
    },
    {
      "text": "Rachel Eardley, Anne Roudaut, Steve Gill, and Stephen J Thompson. 2018. Designing for Multiple Hand Grips and Body Postures within the UX of a moving Smartphone. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 611--621. DOI: http://dx.doi.org/10.1145/3196709.3196711",
      "doi": "10.1145/3196709.3196711"
    },
    {
      "text": "Sean Gustafson, Daniel Bierwirth, and Patrick Baudisch. 2010. Imaginary interfaces: spatial interaction with empty hands and without visual feedback. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 3--12. DOI: http://dx.doi.org/10.1145/1866029.1866033",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Shangchen Han, Beibei Liu, Robert Wang, Yuting Ye, Christopher D Twigg, and Kenrick Kin. 2018. Online optical marker-based hand tracking with deep labels. ACM Transactions on Graphics (TOG) 37, 4 (2018), 166. DOI: http://dx.doi.org/10.1145/3197517.3201399",
      "doi": "10.1145/3197517.3201399"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology. ACM, 441--450. DOI: http://dx.doi.org/10.1145/2047196.2047255",
      "doi": ""
    },
    {
      "text": "Steven J Henderson and Steven Feiner. 2008. Opportunistic controls: leveraging natural affordances as tangible user interfaces for augmented reality. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology. ACM, 211--218. DOI: http://dx.doi.org/10.1145/1450579.1450625",
      "doi": "10.1145/1450579.1450625"
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing reality: Enabling opportunistic use of everyday objects as tangible proxies in augmented reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1957--1967. DOI: http://dx.doi.org/10.1145/2858036.2858134",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 234--241. DOI: http://dx.doi.org/10.1145/258549.258715",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Luv Kohli, Mary C Whitton, and Frederick P Brooks. 2013. Redirected Touching: Training and adaptation in warped virtual spaces. In 2013 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 79--86. DOI: http://dx.doi.org/10.1109/3DUI.2013.6550201",
      "doi": ""
    },
    {
      "text": "Magic Leap. 2019. Magic Leap One: Creator Edition | Magic Leap. (2019). https://www.magicleap.com/magic-leap-one.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2019. Microsoft HoloLens | Mixed Reality Technology for Business. (2019). https://www.microsoft.com/en-us/hololens.",
      "doi": ""
    },
    {
      "text": "Matei Negulescu and Joanna McGrenere. 2015. Grip change as an information side channel for mobile touch interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1519--1522. DOI: http://dx.doi.org/10.1145/2702123.2702185",
      "doi": "10.1145/2702123.2702185"
    },
    {
      "text": "Oculus. 2019. Oculus. (2019). https://www.oculus.com.",
      "doi": ""
    },
    {
      "text": "Siddharth S Rautaray and Anupam Agrawal. 2015. Vision based hand gesture recognition for human computer interaction: a survey. Artificial intelligence review 43, 1 (2015), 1--54. DOI: http://dx.doi.org/10.1007/s10462-012--9356--9",
      "doi": "10.1007/s10462-012-9356-9"
    },
    {
      "text": "Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 483--492. DOI: http://dx.doi.org/10.1145/2207676.2207743",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Adalberto L Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional reality: Using the physical environment to design virtual reality experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3307--3316. DOI: http://dx.doi.org/10.1145/2702123.2702389",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Mohamed Soliman, Franziska Mueller, Lena Hegemann, Joan Sol Roo, Christian Theobalt, and Jürgen Steimle. 2018. FingerInput: Capturing Expressive Single-Hand Thumb-to-Finger Microgestures. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces. ACM, 177--187. DOI: http://dx.doi.org/10.1145/3279778.3279799",
      "doi": "10.1145/3279778.3279799"
    },
    {
      "text": "Hyunyoung Song, Hrvoje Benko, Francois Guimbretiere, Shahram Izadi, Xiang Cao, and Ken Hinckley. 2011. Grips and gestures on a multi-touch pen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1323--1332. DOI: http://dx.doi.org/10.1145/1978942.1979138",
      "doi": "10.1145/1978942.1979138"
    },
    {
      "text": "Brandon T Taylor and V Michael Bove Jr. 2009. Graspables: grasp-recognition as a user interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 917--926. DOI: http://dx.doi.org/10.1145/1518701.1518842",
      "doi": "10.1145/1518701.1518842"
    },
    {
      "text": "Margarita Vergara, JL Sancho-Bru, V Gracia-Ibáñez, and A Pérez-González. 2014. An introductory study of common grasps used by adults during performance of activities of daily living. Journal of Hand Therapy 27, 3 (2014), 225--234. DOI: http://dx.doi.org/10.1016/j.jht.2014.04.002",
      "doi": ""
    },
    {
      "text": "James A Walsh, Stewart Von Itzstein, and Bruce H Thomas. 2014. Ephemeral interaction using everyday objects. In Proceedings of the Fifteenth Australasian User Interface Conference-Volume 150. Australian Computer Society, Inc., 29--37. http://dl.acm.org/citation.cfm?id=2667657.2667661",
      "doi": "10.5555/2667657.2667661"
    },
    {
      "text": "Raphael Wimmer. 2011. Grasp sensing for human-computer interaction. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction. ACM, 221--228. DOI: http://dx.doi.org/10.1145/1935701.1935745",
      "doi": "10.1145/1935701.1935745"
    },
    {
      "text": "Raphael Wimmer and Sebastian Boring. 2009. HandSense: discriminating different ways of grasping and holding a tangible user interface. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction. ACM, 359--362. DOI: http://dx.doi.org/10.1145/1517664.1517736",
      "doi": "10.1145/1517664.1517736"
    },
    {
      "text": "Robert Xiao, Julia Schwarz, Nick Throm, Andrew D Wilson, and Hrvoje Benko. 2018. MRTouch: adding touch input to head-mounted mixed reality. IEEE transactions on visualization and computer graphics 24, 4 (2018), 1653--1660. DOI: http://dx.doi.org/10.1109/TVCG.2018.2794222",
      "doi": ""
    },
    {
      "text": "Dongwook Yoon, Ken Hinckley, Hrvoje Benko, François Guimbretière, Pourang Irani, Michel Pahud, and Marcel Gavriliu. 2015. Sensing tablet grasp+ micro-mobility for active reading. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 477--487. DOI: http://dx.doi.org/10.1145/2807442.2807510",
      "doi": "10.1145/2807442.2807510"
    },
    {
      "text": "Joshua Z Zheng, Sara De La Rosa, and Aaron M Dollar. 2011. An investigation of grasp type and frequency in daily household and machine shop tasks. In 2011 IEEE International Conference on Robotics and Automation. IEEE, 4169--4175. DOI: http://dx.doi.org/10.1109/ICRA.2011.5980366",
      "doi": ""
    }
  ]
}