{
  "doi": "10.1145/3313831.3376402",
  "title": "Exploring Human-Robot Interaction with the Elderly: Results from a Ten-Week Case Study in a Care Home",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Ageing societies and the associated pressure on the care systems are major drivers for new developments in socially assistive robotics. To understand better the real-world potential of robot-based assistance, we undertook a 10-week case study in a care home involving groups of residents, caregivers and managers as stakeholders. We identified both, enablers and barriers to the potential implementation of robot systems. The study employed the robot platform Pepper, which was deployed with a view to understanding better multi-domain interventions with a robot supporting physical activation, cognitive training and social facilitation. We employed the robot in a group setting in a care facility over the course of 10 weeks and 20 sessions, observing how stakeholders, including residents and caregivers, appropriated, adapted to, and perceived the robot. We also conducted interviews with 11 residents and caregivers. Our results indicate that the residents were positively engaged in the training sessions that were moderated by the robot. The study revealed that such humanoid robots can work in a care home but that there is a moderating person needed, that is in control of the robot.",
  "authors": [
    {
      "name": "Felix Carros",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527079",
      "orcid": "missing"
    },
    {
      "name": "Johanna Meurer",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958827657",
      "orcid": "missing"
    },
    {
      "name": "Diana Löffler",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358879357",
      "orcid": "missing"
    },
    {
      "name": "David Unbehaun",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235403",
      "orcid": "missing"
    },
    {
      "name": "Sarah Matthies",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529487",
      "orcid": "missing"
    },
    {
      "name": "Inga Koch",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529101",
      "orcid": "missing"
    },
    {
      "name": "Rainer Wieching",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078272",
      "orcid": "missing"
    },
    {
      "name": "Dave Randall",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659489828",
      "orcid": "0000-0001-8613-3477"
    },
    {
      "name": "Marc Hassenzahl",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-81452610719/rel-imgonly/hassenzahl.jpg",
      "acmid": "81452610719",
      "orcid": "0000-0001-9798-1762"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Jordan Abdi, Ahmed Al-Hindawi, Tiffany Ng, and Marcela P. Vizcaychipi. 2018. Scoping review on the use of socially assistive robot technology in elderly care. BMJ open 8, 2, e018815. DOI: https://doi.org/10.1136/bmjopen-2017-018815.",
      "doi": ""
    },
    {
      "text": "Laura Albornos-Muñoz, María T. Moreno-Casbas, Clara Sánchez-Pablo, Ana Bays-Moneo, Juan C. Fernández-Domínguez, Manuel Rich-Ruiz, and Montserrat Gea-Sánchez. 2018. Efficacy of the Otago Exercise Programme to reduce falls in community-dwelling adults aged 65--80 years old when delivered as group or individual training. Journal of advanced nursing 74, 7, 1700--1711. DOI: https://doi.org/10.1111/jan.13583.",
      "doi": ""
    },
    {
      "text": "Stefanie Baisch, Thorsten Kolling, Arthur Schall, Saskia Rühl, Stefanie Selic, Ziyon Kim, Holger Rossberg, Barbara Klein, Johannes Pantel, and Frank Oswald. 2017. Acceptance of social robots by elder people: does psychosocial functioning matter? International Journal of Social Robotics 9, 2, 293-- 307.",
      "doi": ""
    },
    {
      "text": "Roger Bemelmans, Gert J. Gelderblom, Pieter Jonker, and Luc de Witte. 2012. Socially assistive robots in elderly care: a systematic review into effects and effectiveness. Journal of the American Medical Directors Association 13, 2, 114--120.e1. DOI: https://doi.org/10.1016/j.jamda.2010.10.002.",
      "doi": ""
    },
    {
      "text": "Patrick Boissy, Hélène Corriveau, François Michaud, Daniel Labonté, and Marie-Pier Royer. 2007. A qualitative study of in-home robotic telepresence for home care of community-living elderly subjects. Journal of telemedicine and telecare 13, 2, 79--84. DOI: https://doi.org/10.1258/135763307780096195.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2, 77--101. DOI: https://doi.org/10.1191/1478088706qp063oa.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Cynthia L. Breazeal. 2002. Designing sociable robots. Intelligent robots and autonomous agents. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "E. Broadbent, R. Stafford, and B. MacDonald. 2009. Acceptance of Healthcare Robots for the Older Population: Review and Future Directions. International Journal of Social Robotics 1, 4, 319-- 330. DOI: https://doi.org/10.1007/s12369-009-00306.",
      "doi": ""
    },
    {
      "text": "J. Broekens, M. Heerink, and H. Rosendal. 2009. Assistive social robots in elderly care: a review. Gerontechnology 8, 2. DOI: https://doi.org/10.4017/gt.2009.08.02.002.00.",
      "doi": ""
    },
    {
      "text": "Maurizio Bussolo, Johannes Koettl, and Emily Sinnott. 2015. Golden Aging: Prospects for Healthy, Active, and Prosperous Aging in Europe and Central Asia. The World Bank.",
      "doi": ""
    },
    {
      "text": "Ed H. Chi. 2009. A Position Paper on 'Living Laboratories': Rethinking Ecological Designs and Experimentation in Human-Computer Interaction. In New trends, Julie A. Jacko, Ed. Lecture Notes in Computer Science, 5610. Springer, Berlin, 597--605. DOI: https://doi.org/10.1007/978--3--642-025747_67.",
      "doi": ""
    },
    {
      "text": "Torbjørn Dahl and Maged Boulos. 2014. Robots in Health and Social Care: A Complementary Technology to Home Care and Telehealthcare? Robotics 3, 1, 1--21. DOI: https://doi.org/10.3390/robotics3010001.",
      "doi": ""
    },
    {
      "text": "N. Dahlbäck, A. Jönsson, and L. Ahrenberg. 1993. Wizard of Oz studies - why and how. KnowledgeBased Systems 6, 4, 258--266. DOI: https://doi.org/10.1016/0950--7051(93)90017-N.",
      "doi": "10.1016/0950-7051%2893%2990017-N"
    },
    {
      "text": "Michael Decker, Mathias Gutmann, and Julia Knifka. 2015. Evolutionary Robotics, Organic Computing and Adaptive Ambience: Epistemological and Ethical Implications of Technomorphic Descriptions of Technologies. Lit.",
      "doi": ""
    },
    {
      "text": "Janice J. Eng. 2010. Fitness and Mobility Exercise (FAME) Program for stroke. Topics in geriatric rehabilitation 26, 4, 310--323. DOI: https://doi.org/10.1097/TGR.0b013e3181fee736.",
      "doi": ""
    },
    {
      "text": "Kathleen England and Natasha Azzopardi-Muscat. 2017. Demographic trends and public health in Europe. European journal of public health 27, suppl_4, 9--13. DOI: https://doi.org/10.1093/eurpub/ckx159.",
      "doi": ""
    },
    {
      "text": "Juan Fasola and Maja J. Mataric. 2010. Robot exercise instructor: A socially assistive robot system to monitor and encourage physical exercise for the elderly. 19th International Symposium in Robot and Human Interactive Communication, 416--421.",
      "doi": ""
    },
    {
      "text": "Shinya Fujie, Yoichi Matsuyama, Hikaru Taniyama, and Tetsunori Kobayashi, Eds. 2009. Conversation robot participating in and activating a group communication.",
      "doi": ""
    },
    {
      "text": "J. Goetz, S. Kiesler, and A. Powers. 2003. Matching robot appearance and behavior to tasks to improve human-robot cooperation. In RO-MAN 2003. The 12th IEEE International Workshop on Robot and Human Interactive Communication : proceedings : October 31-November 2, 2003, Millbrae, California, USA. IEEE, Piscataway, N.J, 55--60. DOI: https://doi.org/10.1109/ROMAN.2003.1251796.",
      "doi": ""
    },
    {
      "text": "Cristopher Gómez, Matías Mattamala, Tim Resink, and Javier Ruiz-del-Solar. 2018. Visual SLAM-based Localization and Navigation for Service Robots: The Pepper Case https://arxiv.org/pdf/1811.08414. Retrieved from.",
      "doi": ""
    },
    {
      "text": "Birgit Graf, Matthias Hans, and Rolf D. Schraft. 2004. Care-O-bot II-Development of a next generation robotic home assistant. Autonomous robots 16, 2, 193--205.",
      "doi": ""
    },
    {
      "text": "Gregory D. Abowd, Aaron F. Bobick, Irfan A. Essa, Elizabeth D. Mynatt, and Wendy A. Rogers. 2002. The aware home: A living laboratory for technologies for successful aging, Proceedings of the AAAI-02 Workshop \"Automation as Caregiver\".",
      "doi": ""
    },
    {
      "text": "Peter Griffiths, Chiara Dall'Ora, Michael Simon, Jane Ball, Rikard Lindqvist, Anne-Marie Rafferty, Lisette Schoonhoven, Carol Tishelman, and Linda H. Aiken. 2014. Nurses' shift length and overtime working in 12 European countries: the association with perceived quality of care and patient safety. Medical care 52, 11, 975--981. DOI: https://doi.org/10.1097/MLR.0000000000000233.",
      "doi": ""
    },
    {
      "text": "Ulrike Höhmann, Manuela Lautenschläger, and Laura Schwarz. 2016. Belastungen im Pflegeberuf: Bedingungsfaktoren, Folgen und Desiderate. PflegeReport, 73--89.",
      "doi": ""
    },
    {
      "text": "Sumio Ishii. 2003. Meal-assistance Robot \"My Spoon\". Journal of the Robotics Society of Japan 21, 4, 378--381. DOI: https://doi.org/10.7210/jrsj.21.378.",
      "doi": ""
    },
    {
      "text": "Klaus Jacobs, Adelheid Kuhlmey, Stefan Greß, Jürgen Klauber, Antje Schwinger, and Denise Becka. 2016. Schwerpunkt: Die Pflegenden im Fokus. Pflege-Report, 2016. Schattauer, Stuttgart.",
      "doi": ""
    },
    {
      "text": "Reza Kachouie, Sima Sedighadeli, Rajiv Khosla, and Mei-Tai Chu. 2014. Socially Assistive Robots in Elderly Care: A Mixed-Method Systematic Literature Review. International Journal of HumanComputer Interaction 30, 5, 369--393. DOI: https://doi.org/10.1080/10447318.2013.873278.",
      "doi": ""
    },
    {
      "text": "Masao Kanamori, Mizue Suzuki, and Misao Tanaka. 2002. Maintenance and improvement of quality of life among elderly patients using a pet-type robot. Nihon Ronen Igakkai zasshi. Japanese journal of geriatrics 39, 2, 214--218.",
      "doi": ""
    },
    {
      "text": "Rajiv Khosla, Khanh Nguyen, and Mei-Tai Chu. 2017. Human Robot Engagement and Acceptability in Residential Aged Care. International Journal of Human-Computer Interaction 33, 6, 510--522. DOI: https://doi.org/10.1080/10447318.2016.1275435.",
      "doi": ""
    },
    {
      "text": "C. D. Kidd, W. Taggart, and S. Turkle. 2006. A sociable robot to encourage social interaction among the elderly. In Proceedings / 2006 IEEE International Conference on Robotics and Automation, 2006, ICRA 2006. May 15 - 19, 2006, [Orlando, Florida. IEEE Operations Center, Piscataway, NJ, 3972--3976. DOI: https://doi.org/10.1109/ROBOT.2006.1642311.",
      "doi": ""
    },
    {
      "text": "R. H. Krishnan and S. Pugazhenthi. 2014. Mobility assistive devices and self-transfer robotic systems for elderly, a review. Intelligent Service Robotics 7, 1, 37--49.",
      "doi": "10.1007/s11370-013-0142-6"
    },
    {
      "text": "Lee, H. R., Sabanovic, S., Chang, W. L., Hakken, D., Nagata, S., Piatt, J., & Bennett, C. 2017. Steps Toward Participatory Design of Social Robots: Mutual Learning with Older Adults with Depression. March 6--9, 2017, Vienna, Austria. HRI'17 : proceedings of the ACM/IEEE International Conference on Human-Robot Interaction : March 69, 2017, Vienna, Austria, 1.",
      "doi": ""
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-User Development: An Emerging Paradigm. In End User Development, Henry Lieberman, Fabio Paternò and Volker Wulf, Eds. Human-Computer Interaction Series, v. 9. Springer, Dordrecht, 1--8. DOI: https://doi.org/10.1007/1--4020--5386-X_1.",
      "doi": ""
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, and Volker Wulf, Eds. 2006. End User Development. HumanComputer Interaction Series, v. 9. Springer, Dordrecht. DOI: https://doi.org/10.1007/1--40205386-X.",
      "doi": ""
    },
    {
      "text": "David Maulsby, Saul Greenberg, and Richard Mander. 1993. Prototyping an intelligent agent through Wizard of Oz. In CHI '93: Proceedings of the INTERACT '93 and CHI '93 conference on Human factors in computing systems. ACM, [S.l.], 277--284. DOI: https://doi.org/10.1145/169059.169215.",
      "doi": "10.1145/169059.169215"
    },
    {
      "text": "Rob McCarney, James Warner, Steve Iliffe, Robbert van Haselen, Mark Griffin, and Peter Fisher. 2007. The Hawthorne Effect: a randomised, controlled trial. BMC medical research methodology 7, 1, 30.",
      "doi": ""
    },
    {
      "text": "Claudia Müller, Cornelius Neufeldt, David Randall, and Volker Wulf. 2012. ICT-development in residential care settings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, 2639. DOI: https://doi.org/10.1145/2207676.2208655.",
      "doi": "10.1145/2207676.2208655"
    },
    {
      "text": "Maurice Mulvenna, Suzanne Martin, Donal McDade, Eileen Beamish, A. de Oliveira, and Anna Kivilehto. 2011. TRAIL Living Labs Survey 2011: A survey of the ENOLL living labs. 18592324.",
      "doi": ""
    },
    {
      "text": "Toyoshiro Nakashima, Goro Fukutome, and Naohiro Ishii. 2010. Healing Effects of Pet Robots at an Elderly-Care Facility. In IEEE/ACIS 9th International Conference on Computer and Information Science (ICIS), 2010. 18 - 20 Aug. 2010, Kaminoyama, Yamagata, Japan ; proceedings ; [including workshop papers. IEEE, Piscataway, NJ, 407--412. DOI: https://doi.org/10.1109/ICIS.2010.53.",
      "doi": "10.1109/ICIS.2010.53"
    },
    {
      "text": "Amit K. Pandey and Rodolphe Gelin. 2018. A massproduced sociable humanoid robot: pepper: the first machine of its kind. IEEE Robotics & Automation Magazine 25, 3, 40--48.",
      "doi": ""
    },
    {
      "text": "Maribel Pino, Mélodie Boulay, François Jouen, and Anne-Sophie Rigaud. 2015. ?Are we ready for robots that care for us?\" Attitudes and opinions of older adults toward socially assistive robots. Frontiers in Aging Neuroscience 7. DOI: https://doi.org/10.3389/fnagi.2015.00141.",
      "doi": ""
    },
    {
      "text": "Martha E. Pollack, Laura Brown, Dirk Colbry, Cheryl Orosz, Bart Peintner, Sailesh Ramakrishnan, Sandra Engberg, Judith T. Matthews, Jacqueline Dunbar-Jacob, and Colleen E. McCarthy, Eds. 2002. Pearl: A mobile robotic assistant for the elderly.",
      "doi": ""
    },
    {
      "text": "Akanksha Prakash, Jenay M. Beer, Travis Deyle, Cory-Ann Smarr, Tiffany L. Chen, Tracy L. Mitzner, Charles C. Kemp, and Wendy A. Rogers. 2013. Older Adults' Medication Management in the Home: How can Robots Help? Proceedings of the \" ACM SIGCHI. ACM Conference on Human-Robot Interaction 2013, 283--290. DOI: https://doi.org/10.1109/HRI.2013.6483600.",
      "doi": ""
    },
    {
      "text": "Lihui Pu, Wendy Moyle, Cindy Jones, and Michael Todorovic. 2019. The Effectiveness of Social Robots for Older Adults: A Systematic Review and MetaAnalysis of Randomized Controlled Studies. The Gerontologist 59, 1, e37-e51. DOI: https://doi.org/10.1093/geront/gny046.",
      "doi": ""
    },
    {
      "text": "Selma Sabanovic, Casey C. Bennett, Wan-Ling Chang, and Lesa Huber, Eds. 2013. PARO robot affects diverse interaction modalities in group sensory therapy for older adults with dementia. IEEE 13th International Conference on Rehabilitation Robotics (ICORR).",
      "doi": ""
    },
    {
      "text": "Statistik der Bundesagentur für Arbeit. 2019. Berichte: Blickpunkt Arbeitsmarkt -- Arbeitsmarktsituation im Pflegebereich, Nürnberg.",
      "doi": ""
    },
    {
      "text": "Priyesh Tiwari, Jim Warren, Karen Day, Bruce MacDonald, Chandimal Jayawardena, I. H. Kuo, Aleksandar Igic, and Chandan Datta, Eds. 2011. Feasibility study of a robotic medication assistant for the elderly. Australian Computer Society, Inc.",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Konstantin Aal, Felix Carros, Rainer Wieching, and Volker Wulf. Creative and Cognitive Activities in Social Assistive Robots and Older Adults: Results from an Exploratory Field Study with Pepper. DOI: https://doi.org/10.18420/ECSCW2019_P07.",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Konstantin Aal, Daryoush D. Vaziri, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Facilitating Collaboration and Social Experiences with Videogames in Dementia. Proc. ACM Hum.-Comput. Interact. 2, CSCW, 1--23. DOI: https://doi.org/10.1145/3274444.",
      "doi": "10.1145/3274444"
    },
    {
      "text": "David Unbehaun, Daryoush D. Vaziri, Konstantin Aal, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Exploring the Potential of Exergames to affect the Social and Daily Life of People with Dementia and their Caregivers. In CHI 2018. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, April 21--26, 2018, Montreal, QC, Canada. ACM, NY, NY, 1-- 15. DOI: https://doi.org/10.1145/3173574.3173636.",
      "doi": "10.1145/3173574.3173636"
    },
    {
      "text": "K. Wada and T. Shibata. 2007. Living With Seal Robots-Its Sociopsychological and Physiological Influences on the Elderly at a Care House. IEEE Trans. Robot. 23, 5, 972--980. DOI: https://doi.org/10.1109/TRO.2007.906261.",
      "doi": "10.1109/TRO.2007.906261"
    }
  ]
}