{
  "doi": "10.1145/3313831.3376881",
  "title": "Understanding Cybersecurity Practices in Emergency Departments",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2020,
  "badges": [],
  "abstract": "Emergency departments (EDs) have unique operational requirements within hospitals. They have strong availability demands, are staffed by rotating personnel, and must provide services as quickly as possible. Modern EDs are also heavily computerized, and as such cybersecurity practices play a key role in meeting the expected operational standards. To better understand the cybersecurity challenges in EDs, we conducted a survey asking 347 ED personnel across Canada about their cybersecurity practices. The survey collected information relating to authentication and password management, use of personal devices for handling patient data, Internet connectivity on personal and hospital systems, and institutional security policies. Our results show that across multiple hospitals, deployed computer security systems fail to integrate with the requirements of staff and patients, leading to interruptions and inefficiencies.",
  "authors": [
    {
      "name": "Elizabeth Stobert",
      "institution": "Carleton University, Ottawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447603889",
      "orcid": "missing"
    },
    {
      "name": "David Barrera",
      "institution": "Carleton University, Ottawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470649704",
      "orcid": "missing"
    },
    {
      "name": "Valérie Homier",
      "institution": "McGill University, Montreal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528711",
      "orcid": "missing"
    },
    {
      "name": "Daniel Kollek",
      "institution": "McMaster University, Dundas, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529352",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahmed I. Albarrak. 2012. Information Security Behavior among Nurses. HealthMED 6, 7 (2012).",
      "doi": ""
    },
    {
      "text": "Ahmed AlKalbani, Hepu Deng, and Booi Kam. 2015. Investigating the Role of Socio-organizational Factors in the Information Security Compliance in Organizations. In Australasian Conference on Information Systems.",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram. 2000. Temporal Coordination - On Time and Coordination of Collaborative Activities at a Surgical Department. Computer Supported Cooperative Work (CSCW) 9, 2 (May 2000), 157--187. DOI: http://dx.doi.org/10.1023/A:1008748724225",
      "doi": "10.1023/A%3A1008748724225"
    },
    {
      "text": "Jakob E. Bardram. 2005. The trouble with login: on usability and computer security in ubiquitous computing. Personal and Ubiquitous Computing 9, 6 (Nov. 2005), 357--367. DOI: http://dx.doi.org/10.1007/s00779-005-0347--6",
      "doi": "10.1007/s00779-005-0347-6"
    },
    {
      "text": "Jakob E. Bardram. 2009. Activity-based computing for medical work in hospitals. ACM Transactions on Computer-Human Interaction 16, 2 (June 2009), 1--36. DOI: http://dx.doi.org/10.1145/1534903.1534907",
      "doi": "10.1145/1534903.1534907"
    },
    {
      "text": "Jim Blythe, Ross Koppel, and Sean W. Smith. 2013. Circumvention of Security: Good Users Do Bad Things. IEEE Security & Privacy 11, 5 (Sept. 2013), 80--83. DOI: http://dx.doi.org/10.1109/MSP.2013.110",
      "doi": "10.1109/MSP.2013.110"
    },
    {
      "text": "Google. 2019. Distribution Dashboard. (May 2019). https://developer.android.com/about/dashboards",
      "doi": ""
    },
    {
      "text": "Government of Canada. 2018. Canada Health Act. (Dec. 2018). https://www.canada.ca/en/health-canada/ services/health-care-system/canada-health-caresystem-medicare/canada-health-act.html",
      "doi": ""
    },
    {
      "text": "Rosa Heckle. 2011. Security Dilemma: Healthcare Clinicians at Work. IEEE Security & Privacy 9, 6 (Nov. 2011), 14--19. DOI: http://dx.doi.org/10.1109/MSP.2011.74",
      "doi": "10.1109/MSP.2011.74"
    },
    {
      "text": "Karin Hedström, Ella Kolkowska, Fredrik Karlsson, and J.P. Allen. 2011. Value conflicts for information security management. The Journal of Strategic Information Systems 20, 4 (Dec. 2011), 373--384. DOI: http://dx.doi.org/10.1016/j.jsis.2011.06.001",
      "doi": "10.1016/j.jsis.2011.06.001"
    },
    {
      "text": "Ross Koppel, Sean W Smith, Jim Blythe, and Vijay Kothari. 2015. Workarounds to Computer Access in Healthcare Organizations: You Want My Password or a Dead Patient? Studies in Health Technology and Informatics (2015), 215--220. DOI: http://dx.doi.org/10.3233/978--1--61499--488--6--215",
      "doi": ""
    },
    {
      "text": "Ross Koppel, T. Wetterneck, J. L. Telles, and B.-T. Karsh. 2008. Workarounds to Barcode Medication Administration Systems: Their Occurrences, Causes, and Threats to Patient Safety. Journal of the American Medical Informatics Association 15, 4 (July 2008), 408--423. DOI: http://dx.doi.org/10.1197/jamia.M2616",
      "doi": ""
    },
    {
      "text": "Diana S. Kusunoki and Aleksandra Sarcevic. 2015. Designing for Temporal Awareness: The Role of Temporality in Time-Critical Medical Teamwork. In ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW). 1465--1476. DOI: http://dx.doi.org/10.1145/2675133.2675279",
      "doi": ""
    },
    {
      "text": "C.P. Nemeth, R.I. Cook, M. O'Connor, and P.A. Klock. 2004. Using Cognitive Artifacts to Understand Distributed Cognition. IEEE Transactions on Systems, Man, and Cybernetics - Part A: Systems and Humans 34, 6 (Nov. 2004), 726--735. DOI: http://dx.doi.org/10.1109/TSMCA.2004.836798",
      "doi": "10.1109/TSMCA.2004.836798"
    },
    {
      "text": "Yukari Niimi and Katsumasa Ota. 2014. Privacy Recognition by Nurses and Necessity of Their Information Security Education. In International Conference on Education Reform and Modern Management. Atlantis Press. DOI: http://dx.doi.org/10.2991/ermm-14.2014.97",
      "doi": ""
    },
    {
      "text": "Priyadarshini R. Pennathur, Ann M. Bisantz, Rollin J. Fairbanks, Shawna J. Perry, Frank Zwemer, and Robert L. Wears. 2007. Assessing the Impact of Computerization on Work Practice: Information Technology in Emergency Departments. In Proceedings of the Human Factors and Ergonomics Society 51st Annual Meeting (4), Vol. 51. 377--381. DOI: http://dx.doi.org/10.1177/154193120705100448",
      "doi": ""
    },
    {
      "text": "Kopo M. Ramokapane, Awais Rashid, and Jose M. Such. 2017. \"I feel stupid I can't delete\": A Study of Users' Cloud Deletion Practices and Coping Strategies. In USENIX SOUPS.",
      "doi": ""
    },
    {
      "text": "J. Reardon, D. Basin, and S. Capkun. 2013. SoK: Secure Data Deletion. In IEEE Symposium on Security and Privacy. DOI: http://dx.doi.org/10.1109/SP.2013.28",
      "doi": ""
    },
    {
      "text": "Beth Ann Savage. 2017. A Qualitative Exploration of the Security Practices of Registered Nurses. Ph.D. Thesis. Walden University.",
      "doi": ""
    },
    {
      "text": "William Smart. 2018. Lessons learned review of the WannaCry Ransomware Cyber Attack. Technical Report. 42 pages. https://www.england.nhs.uk/wp-content/ uploads/2018/02/lessons-learned-review-wannacryransomware-cyber-attack-cio-review.pdf",
      "doi": ""
    },
    {
      "text": "Sean W Smith and Ross Koppel. 2014. Healthcare information technology's relativity problems: a typology of how patients' physical reality, clinicians' mental models, and healthcare information technology differ. Journal of the American Medical Informatics Association 21, 1 (Jan. 2014), 117--131. DOI: http://dx.doi.org/10.1136/amiajnl-2012-001419",
      "doi": ""
    },
    {
      "text": "Statistics Canada. 2017. Canadian Survey of Cyber Security and Cybercrime (CSoCC). (Nov. 2017). http://www23.statcan.gc.ca/imdb/p2SV.pl?Function= getSurvey&Id=359489",
      "doi": ""
    },
    {
      "text": "Alma Whitten and JD Tygar. 1999. Why Johnny Can't Encrypt: A Usability Evaluation of PGP 5.0. In USENIX Security.",
      "doi": ""
    }
  ]
}