{
  "doi": "10.1145/3313831.3376665",
  "title": "Genie in the Bottle: Anthropomorphized Perceptions of Conversational Agents",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "This paper presents a qualitative multi-phase study seeking to identify patterns in users' anthropomorphized perceptions of conversational agents. Through a comparative analysis of behavioral perceptions and visual conceptions of three agents - Alexa, Google Assistant, and Siri - we first show that the perceptions of an agent's character are structured according to five categories: approachability, sentiment toward a user, professionalism, intelligence, and individuality. We then explore visualizations of the agents' appearance and discuss the specifics assigned to each agent. Finally, we analyze associative explanations for these perceptions. We demonstrate that the anthropomorphized behavioral and visual perceptions of agents yield structural consistency and discuss how these perceptions are linked with each other and system features.",
  "authors": [
    {
      "name": "Anastasia Kuzminykh",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658687173",
      "orcid": "0000-0002-5941-4641"
    },
    {
      "name": "Jenny Sun",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527823",
      "orcid": "missing"
    },
    {
      "name": "Nivetha Govindaraju",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527753",
      "orcid": "missing"
    },
    {
      "name": "Jeff Avery",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658642355",
      "orcid": "missing"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo & Inria (& University of Lille), Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    }
  ],
  "references": [
    {
      "text": "Timothy Bickmore and Justine Cassell. 2005. Social dialongue with embodied conversational agents. In Advances in natural multimodal dialogue systems. Springer, 23--54.",
      "doi": ""
    },
    {
      "text": "Ben Bland. 2018. Alexa, Hug Me: Exploring Human-Machine Emotional Relations. (1 2018). Retrieved August 21, 2019 from https://medium.com/@ben.bland/ alexa-hug-me-exploring-human-machine-emotional= -relations-1f0f6e04e1db.",
      "doi": ""
    },
    {
      "text": "Jim Blascovich, Jack Loomis, Andrew C Beall, Kimberly R Swinth, Crystal L Hoyt, and Jeremy N Bailenson. 2002. Immersive virtual environment technology as a methodological tool for social psychology. Psychological Inquiry 13, 2 (2002), 103--124.",
      "doi": ""
    },
    {
      "text": "Sheryl Brahnam and Antonella De Angeli. 2012. Gender affordances of conversational agents. Interacting with Computers 24, 3 (2012), 139--153.",
      "doi": "10.1016/j.intcom.2012.05.001"
    },
    {
      "text": "Sheryl Brahnam and Margaret Weaver. 2015. Re/Framing Virtual Conversational Partners: A Feminist Critique and Tentative Move Towards a New Design Paradigm. In International Conference of Design, User Experience, and Usability. Springer, 172--183.",
      "doi": "10.1007/978-3-319-20898-5_17"
    },
    {
      "text": "Cynthia Breazeal. 2003. Toward sociable robots. Robotics and Autonomous Systems 42, 3 (2003), 167 -- 175. DOI: http://dx.doi.org/https://doi.org/10.1016/S0921--8890(02)00373--1 Socially Interactive Robots.",
      "doi": ""
    },
    {
      "text": "Raluca Budiu and Page Laubheimer. 2018a. Intelligent Assistants: Creepy, Childish, or a Tool? Users' Attitudes Toward Alexa, Google Assistant, and Siri. (8 2018). Retrieved February 22, 2019 from https://www.nngroup.com/articles/voice-assistant-attitudes/?lm= intelligent-assistants-poor-usability-high-adoption& pt=article.",
      "doi": ""
    },
    {
      "text": "Raluca Budiu and Page Laubheimer. 2018b. Intelligent Assistants Have Poor Usability: A User Study of Alexa, Google Assistant, and Siri. (7 2018). Retrieved February 21, 2019 from https://www.nngroup.com/articles/ intelligent-assistant-usability/.",
      "doi": ""
    },
    {
      "text": "Raluca Budiu and Kathryn Whitenton. 2018. The Paradox of Intelligent Assistants: Poor Usability, High Adoption. (9 2018). Retrieved February 21, 2019 from https://www.nngroup.com/articles/ intelligent-assistants-poor-usability-high-adoption/.",
      "doi": ""
    },
    {
      "text": "Richard Catrambone, John Stasko, and Jun Xiao. 2002. Anthropomorphic agents as a user interface paradigm: Experimental findings and a framework for research. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 24.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2017. Nearly half of Americans use digital voice assistants, mostly on their smartphones. (12 2017). Retrieved February 28, 2019 from https://www.pewresearch.org/fact-tank/2017/12/12/ nearly-half-of-americans-use-digital-voice-assistants= -mostly-on-their-smartphones/.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. Sage.",
      "doi": ""
    },
    {
      "text": "Ewart J de Visser, Samuel S Monfort, Ryan McKendrick, Melissa AB Smith, Patrick E McKnight, Frank Krueger, and Raja Parasuraman. 2016. Almost human: Anthropomorphism increases trust resilience in cognitive agents. Journal of Experimental Psychology: Applied 22, 3 (2016), 331.",
      "doi": ""
    },
    {
      "text": "Brian R Duffy. 2003a. Anthropomorphism and the social robot. Robotics and autonomous systems 42, 3--4 (2003), 177--190.",
      "doi": ""
    },
    {
      "text": "Brian R Duffy. 2003b. Anthropomorphism and the social robot. Robotics and autonomous systems 42, 3--4 (2003), 177--190.",
      "doi": ""
    },
    {
      "text": "Nicholas Epley, Scott Akalis, Adam Waytz, and John T Cacioppo. 2008. Creating social connection through inferential reproduction: Loneliness and perceived agency in gadgets, gods, and greyhounds. Psychological science 19, 2 (2008), 114--120.",
      "doi": ""
    },
    {
      "text": "N. Epley, A. Waytz, and J. T. Cacioppo. 2007. On seeing human: A three-factor theory of anthropomorphism. In Psychological Review, Vol. 114. 864--886. DOI: http://dx.doi.org/10.1037/0033--295X.114.4.864",
      "doi": "10.1037/0033-"
    },
    {
      "text": "F. Eyssel, L. de Ruiter, D. Kuchenbrandt, S. Bobinger, and F. Hegel. 2012. ?If you sound like me, you must be more human': On the interplay of robot and user features on human-robot acceptance and anthropomorphism. In 2012 7th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 125--126. DOI: http://dx.doi.org/10.1145/2157689.2157717",
      "doi": ""
    },
    {
      "text": "Friederike Eyssel, Laura De Ruiter, Dieta Kuchenbrandt, Simon Bobinger, and Frank Hegel. 2012. ?If you sound like me, you must be more human': On the interplay of robot and user features on human-robot acceptance and anthropomorphism. In 2012 7th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 125--126.",
      "doi": "10.1145/2157689.2157717"
    },
    {
      "text": "Friederike Eyssel and Frank Hegel. 2012. (s) he's got the look: Gender stereotyping of robots 1. Journal of Applied Social Psychology 42, 9 (2012), 2213--2230.",
      "doi": ""
    },
    {
      "text": "Julia Fink. 2012. Anthropomorphism and human likeness in the design of robots and human-robot interaction. In International Conference on Social Robotics. Springer, 199--208.",
      "doi": "10.1007/978-3-642-34103-8_20"
    },
    {
      "text": "Rosemary Flanagan and Robert W Motta. 2007. Figure drawings: A popular method. Psychology in the Schools 44, 3 (2007), 257--270.",
      "doi": ""
    },
    {
      "text": "Yang Gao, Zhengyu Pan, Honghao Wang, and Guanling Chen. 2018a. Alexa, My Love: Analyzing Reviews of Amazon Echo. In 2018 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI). IEEE, 372--380.",
      "doi": ""
    },
    {
      "text": "Y. Gao, Z. Pan, H. Wang, and G. Chen. 2018b. Alexa, My Love: Analyzing Reviews of Amazon Echo. In 2018 IEEE SmartWorld, Ubiquitous Intelligence Computing, Advanced Trusted Computing, Scalable Computing Communications, Cloud Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI). 372--380. DOI: http://dx.doi.org/10.1109/SmartWorld.2018.00094",
      "doi": ""
    },
    {
      "text": "Nick Haslam. 2006. Dehumanization: An integrative review. Personality and social psychology review 10, 3 (2006), 252--264.",
      "doi": ""
    },
    {
      "text": "Kari Daniel Karjalainen, Anna Elisabeth Sofia Romell, Photchara Ratsamee, Asim Evren Yantac, Morten Fjeld, and Mohammad Obaid. 2017. Social drone companion for the home environment: A user-centric exploration. In Proceedings of the 5th International Conference on Human Agent Interaction. ACM, 89--96.",
      "doi": "10.1145/3125739.3125774"
    },
    {
      "text": "Aelee Kim, Jooyun Han, Younbo Jung, and Kwanmin Lee. 2013. The effects of familiarity and robot gesture on user acceptance of information. In Human-Robot Interaction (HRI), 2013 8th ACM/IEEE International Conference on. IEEE, 159--160.",
      "doi": ""
    },
    {
      "text": "Bomyeong Kim, Hyun Young Kim, and Jinwoo Kim. 2016. Getting home safely with drone. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. ACM, 117--120.",
      "doi": "10.1145/2968219.2971426"
    },
    {
      "text": "Cornell Social Media Lab. 2017. What Makes Us Love Alexa? (1 2017). Retrieved February 28, 2019 from https://medium.com/social-media-stories/ what-makes-us-love-alexa-dd86e61be936.",
      "doi": ""
    },
    {
      "text": "SeoYoung Lee and Junho Choi. 2017. Enhancing user experience with conversational agent for movie recommendation: Effects of self-disclosure and reciprocity. International Journal of Human-Computer Studies 103 (2017), 95--105.",
      "doi": "10.1016/j.ijhcs.2017.02.005"
    },
    {
      "text": "Marvin Leibowitz. 2013. Interpreting projective drawings: A self-psychological approach. Routledge.",
      "doi": ""
    },
    {
      "text": "Séverin Lemaignan, Julia Fink, and Pierre Dillenbourg. 2014. The dynamics of anthropomorphism in robotics. In 2014 9th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 226--227.",
      "doi": "10.1145/2559636.2559814"
    },
    {
      "text": "Irene Lopatovska, Katrina Rink, Ian Knight, Kieran Raines, Kevin Cosenza, Harriet Williams, Perachya Sorsche, David Hirsch, Qi Li, and Adrianna Martinez. 2018. Talk to me: Exploring user interactions with the Amazon Alexa. Journal of Librarianship and Information Science (2018), 0961000618759414.",
      "doi": ""
    },
    {
      "text": "Irene Lopatovska and Harriet Williams. 2018. Personification of the Amazon Alexa: BFF or a Mindless Companion. In Proceedings of the 2018 Conference on Human Information Interaction&Retrieval. ACM, 265--268.",
      "doi": "10.1145/3176349.3176868"
    },
    {
      "text": "Karl F MacDorman and Debaleena Chattopadhyay. 2016. Reducing consistency in human realism increases the uncanny valley effect; increasing category uncertainty does not. Cognition 146 (2016), 190--205.",
      "doi": ""
    },
    {
      "text": "Karl F MacDorman and Hiroshi Ishiguro. 2006. The uncanny advantage of using androids in cognitive and social science research. Interaction Studies 7, 3 (2006), 297--337.",
      "doi": ""
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2001. Does computer-synthesized speech manifest personality? Experimental tests of recognition, similarity-attraction, and consistency-attraction. Journal of experimental psychology: applied 7, 3 (2001), 171.",
      "doi": ""
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and Mindlessness: Social Responses to Computers. 56, 1 (2000). DOI: http://dx.doi.org/10.1111/0022--4537.00153",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Youngme Moon, and Nancy Green. 1997. Are machines gender neutral? Gender-stereotypic responses to computers with voices. Journal of applied social psychology 27, 10 (1997), 864--876.",
      "doi": "10.1111/j.1559-1816"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 72--78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Jean A. Pratt, Karina Hauser, Zsolt Ugray, and Olga Patterson. 2007. Looking at Human-computer Interface Design: Effects of Ethnicity in Computer Agents. Interact. Comput. 19, 4 (July 2007), 512--523. DOI: http://dx.doi.org/10.1016/j.intcom.2007.02.003",
      "doi": "10.1016/j.intcom.2007.02.003"
    },
    {
      "text": "Amanda Purington, Jessie G. Taft, Shruti Sannon, Natalya N. Bazarova, and Samuel Hardman Taylor. 2017a. \"Alexa is My New BFF\": Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 2853--2859. DOI: http://dx.doi.org/10.1145/3027063.3053246",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Amanda Purington, Jessie G Taft, Shruti Sannon, Natalya N Bazarova, and Samuel Hardman Taylor. 2017b. Alexa is my new BFF: social roles, user satisfaction, and personification of the amazon echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2853--2859.",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Lingyun Qiu and Izak Benbasat. 2009. Evaluating anthropomorphic product recommendation agents: A social relationship perspective to designing information systems. Journal of Management Information Systems 25, 4 (2009), 145--182.",
      "doi": "10.2753/MIS0742-1222250405"
    },
    {
      "text": "Laurel D Riek, Tal-Chen Rabinowitch, Bhismadev Chakrabarti, and Peter Robinson. 2009. How anthropomorphism affects empathy toward robots. In Proceedings of the 4th ACM/IEEE international conference on Human robot interaction. ACM, 245--246.",
      "doi": "10.1145/1514095.1514158"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018a. \"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 857--868. DOI: http://dx.doi.org/10.1145/3196709.3196772",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I Hong. 2018b. Hey Alexa, What's Up?: A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018. ACM, 857--868.",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "James C Thompson, J Gregory Trafton, and Patrick McKnight. 2011. The perception of humanness from the movements of synthetic agents. Perception 40, 6 (2011), 695--704.",
      "doi": ""
    },
    {
      "text": "Alladi Venkatesh. 1996. Computers and Other Interactive Technologies for the Home. Commun. ACM 39, 12 (Dec. 1996), 47--54. DOI: http://dx.doi.org/10.1145/240483.240491",
      "doi": "10.1145/240483.240491"
    },
    {
      "text": "Adam Waytz, John Cacioppo, and Nicholas Epley. 2010a. Who sees human? The stability and importance of individual differences in anthropomorphism. Perspectives on Psychological Science 5, 3 (2010), 219--232.",
      "doi": ""
    },
    {
      "text": "Adam Waytz, Nicholas Epley, and John T Cacioppo. 2010b. Social cognition unbound: Insights into anthropomorphism and dehumanization. Current Directions in Psychological Science 19, 1 (2010), 58--62.",
      "doi": ""
    },
    {
      "text": "Mark West, Rebecca Kraut, and Han Ei Chew. 2019. I'd blush if I could: closing gender divides in digital skills through education. (2019).",
      "doi": ""
    },
    {
      "text": "Eva Wiese, Agnieszka Wykowska, Jan Zwickel, and Hermann J Müller. 2012. I see what you mean: how attentional selection is shaped by ascribing intentions to others. PloS one 7, 9 (2012), e45391.",
      "doi": ""
    }
  ]
}