{
  "doi": "10.1145/3313831.3376663",
  "title": "Ecology Meets Computer Science: Designing Tools to Reconcile People, Data, and Practices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Ecoacoustics draws together computer scientists and ecologists to achieve an understanding of ecosystems and wildlife using acoustic recordings of the environment. Computer scientists are challenged to manage increasingly large datasets while developing analytic and visualisation tools. Ecologists struggle to find and use tools that answer highly heterogeneous research questions. These two fields are naturally drawn together at the tool interface, however, less attention has been paid to how their practices influence tool design and use. We interviewed and collected email correspondence from four computer scientists and eight ecologists to learn how their practices indicate opportunities for reconciling difference through design. We found that different temporal rhythms, relationships to data, and data-driven questions demand tool configuration, data integration, and standardisation. This research outlines interfacing opportunities for new ecological research utilising large acoustic datasets, and also contributes to evolving HCI approaches in areas making use of big data and human-in-the-loop processes.",
  "tags": [
    "design",
    "interface",
    "interdisciplinary",
    "human-computer interaction",
    "ecology",
    "ecoacoustics",
    "computer science"
  ],
  "authors": [
    {
      "name": "Kellie Vella",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503685970",
      "orcid": "0000-0002-1125-5530"
    },
    {
      "name": "Jessica L. Oliver",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659234402",
      "orcid": "missing"
    },
    {
      "name": "Tshering Dema",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659035306",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    },
    {
      "name": "Paul Roe",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338049",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A2O. 2019. The Australian Acoustic Observatory: A network to monitor biodiversity. Retrieved 28 August, 2019 from: https://acousticobservatory.org/wpcontent/uploads/2018/12/australian-acousticobservatory-brochure_dec20181.pdf.",
      "doi": ""
    },
    {
      "text": "S.W. Aboelela, et al. 2007. Defining interdisciplinary research: Conclusions from a critical review of the literature. Health Serv Res. 42(1), 329--346. https://doi.org/10.1111/j.14756773.2006.00621.x",
      "doi": ""
    },
    {
      "text": "A.F. Blackwell. 2015. Filling the big hole in HCI research. Interactions. 22(6), 37--41. https://doi.org/10.1145/2830317",
      "doi": "10.1145/2830317"
    },
    {
      "text": "V. Braun and V. Clarke. 2006. Using thematic analysis in psychology. Qual Res Psychol. 3(2), 77101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "L. Bromham, R. Dinnage, and X. Hua. 2016. Interdisciplinary research has consistently lower funding success. Nature. 534(7609), 684--687. https://doi.org/10.1038/nature18315",
      "doi": ""
    },
    {
      "text": "M. Cartwright, G. Dove, A.E.M. Méndez, and J.P. Bello. 2019. Crowdsourcing multi-label audio annotation tasks with citizen scientists. In Proceedings of 2019 CHI Conference on Human Factors in Computing Systems, 4--9.",
      "doi": ""
    },
    {
      "text": "M. Cartwright, et al. 2017. Seeing sound: Investigating the effects of visualizations and complexity on crowdsourced audio annotations In Proceedings of ACM on Human-Computer Interaction, 1--21. https://doi.org/10.1145/3134664",
      "doi": ""
    },
    {
      "text": "J. Choi and Y. Tausczik. 2017. Characteristics of collaboration in the emerging practice of open data analysis. In Proceedings of 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 835--846. https://doi.org/10.1145/2998181.2998265",
      "doi": ""
    },
    {
      "text": "M. Cottman-Fields, M. Brereton, J. Wimmer, and P. Roe. 2014. Collaborative extension of biodiversity monitoring protocols in the bird watching community. In Proceedings of 13th Participatory Design Conference (PDC 2014), https://doi.org/10.1145/2662155.2662193",
      "doi": ""
    },
    {
      "text": "T. Dema, M. Brereton, J.L. Cappadonna, P. Roe, A. Truskinger, and D. Zhang. 2017. Collaborative exploration and sensemaking of big environmental sound data. Comp Support Comp W. 26(4--6), 693731. https://doi.org/10.1007/s10606-017--9286--9",
      "doi": ""
    },
    {
      "text": "T. Dema, et al. 2018. Acoustic detection and acoustic habitat characterisation of the critically endangered white-bellied heron (Ardea insignis) in Bhutan. Freshwat Biol. 0(0). https://doi.org/10.1111/fwb.13217",
      "doi": ""
    },
    {
      "text": "T. Dema, L. Zhang, M.W. Towsey, A. Truskinger, J. Zhang, M. Brereton, and P. Roe. 2017. An investigation into acoustic analysis methods for endangered species monitoring. In Proceedings of 2017 IEEE 13th International Conference on eScience, https://doi.org/10.1109/eScience.2017.30",
      "doi": ""
    },
    {
      "text": "A. Digby, M. Towsey, B.D. Bell, and P.D. Teal. 2013. A practical comparison of manual and autonomous methods for acoustic monitoring. Methods Ecol Evol. 4(7), 675--683. https://doi.org/10.1111/2041--210X.12060",
      "doi": ""
    },
    {
      "text": "S.E. Domino, Y.R. Smith, and T.R.B. Johnson. 2007. Opportunities and challenges of interdisciplinary research career development: Implementation of a women's health research training program. J Womens Health. 16(2), 256261. https://doi.org/10.1089/jwh.2006.0129",
      "doi": ""
    },
    {
      "text": "P. Dugan, M. Pourhomayoun, Y. Shiu, R. Paradis, A. Rice, and C. Clark. 2013. Using high performance computing to explore large complex bioacoustic soundscapes: Case study for right whale acoustics. Procedia Computer Science. 20(156--162. https://doi.org/10.1016/j.procs.2013.09.254",
      "doi": ""
    },
    {
      "text": "P.N. Edwards, M.S. Mayernik, A.L. Batcheller, G.C. Bowker, and C.L. Borgman. 2011. Science friction: Data, metadata, and collaboration. Soc. Stud. Sci. 41(5), 667--690. https://doi.org/10.1177/0306312711413314",
      "doi": ""
    },
    {
      "text": "A. Farina. 2018. Ecoacoustic codes and ecological complexity. Biosystems. 164(147--154. https://doi.org/https://doi.org/10.1016/j.biosystems. 2017.09.003",
      "doi": ""
    },
    {
      "text": "R. Gibb, E. Browning, P. Glover-Kapfer, and K.E. Jones. 2019. Emerging opportunities and challenges for passive acoustics in ecological assessment and monitoring. Methods Ecol. Evol. 10(2), 169--185. https://doi.org/10.1111/2041--210X.13101",
      "doi": ""
    },
    {
      "text": "P. Gillingham and T. Graham. 2017. Big data in social welfare: The development of a critical perspective on social work's latest \"electronic turn\". Australian Social Work. 70(2), 135--147. https://doi.org/10.1080/0312407X.2015.1134606",
      "doi": ""
    },
    {
      "text": "W.E. Gómez, C.V. Isaza, and J.M. Daza. 2018. Identifying disturbed habitats: A new method from acoustic indices. Ecol Inform. 45(16--25. https://doi.org/https://doi.org/10.1016/j.ecoinf.2018. 03.001",
      "doi": ""
    },
    {
      "text": "S.E. Hampton, et al. 2013. Big data and the future of ecology. Front. Ecol. Environ. 11(3), 156--162. https://doi.org/10.1890/120103",
      "doi": ""
    },
    {
      "text": "A. Holzinger. 2016. Interactive machine learning for health informatics: When do we need the human-in-the-loop? Brain Informatics. 3(2), 119131. https://doi.org/10.1007/s40708-016-0042--6",
      "doi": ""
    },
    {
      "text": "J.R. Hunt, D.D. Baldocchi, and C. Van Ingen. 2009. Redefining ecological science using data, in The fourth paradigm: Data intensive scientific discovery, T. Hey, S. Tansley, and K. Tolle (eds.), Microsoft Research: Redmond, Washington.",
      "doi": ""
    },
    {
      "text": "S.J. Jackson and S. Barbrow. 2015. Standards and/as innovation: Protocols, creativity, and interactive systems development in ecology. In Proceedings of 33rd Annual ACM Conference on Human Factors in Computing Systems, 1769--1778. https://doi.org/10.1145/2702123.2702564",
      "doi": ""
    },
    {
      "text": "S.J. Jackson, D. Ribes, A. Buyuktur, and G.C. Bowker. 2011. Collaborative rhythm: temporal dissonance and alignment in collaborative scientific work. In Proceedings of ACM 2011 Conference on Computer Supported Cooperative Work, 245--254. https://doi.org/10.1145/1958824.1958861",
      "doi": ""
    },
    {
      "text": "X. Jin, B.W. Wah, X. Cheng, and Y. Wang. 2015. Significance and challenges of big data research. Big Data Research. 2(2), 59--64. https://doi.org/https://doi.org/10.1016/j.bdr.2015.01. 006",
      "doi": "10.1016/j.bdr.2015.01.006"
    },
    {
      "text": "F.C. Jorge, C.G. Machado, S.S. da Cunha Nogueira, and S.L.G. Nogueira-Filho. 2018. The effectiveness of acoustic indices for forest monitoring in Atlantic rainforest fragments. Ecol Indic. 91(71--76. https://doi.org/https://doi.org/10.1016/j.ecolind.201 8.04.001",
      "doi": ""
    },
    {
      "text": "B. Knapp, et al. 2015. Ten simple rules for a successful cross-disciplinary collaboration. PLoS Comput. Biol. 11(4), e1004214. https://doi.org/10.1371/journal.pcbi.1004214",
      "doi": ""
    },
    {
      "text": "K. Kuutti and L.J. Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems, 3543--3552. https://doi.org/10.1145/2556288.2557111",
      "doi": ""
    },
    {
      "text": "C.P. Lee. 2007. Boundary negotiating artifacts: Unbinding the routine of boundary objects and embracing chaos in collaborative work. 16(3), 307339. https://doi.org/10.1007/s10606-007--9044--5",
      "doi": ""
    },
    {
      "text": "O. Mac Aodha, et al. 2018. Bat detective-Deep learning tools for bat acoustic signal detection. PLoS Comput. Biol. 14(3), e1005995. https://doi.org/10.1371/journal.pcbi.1005995",
      "doi": ""
    },
    {
      "text": "O. Mac Aodha, V. Stathopoulos, G.J. Brostow, M. Terry, M. Girolami, and K.E. Jones. 2014. Putting the Scientist in the Loop -- Accelerating Scientific Progress with Interactive Machine Learning. In Proceedings of 22nd International Conference on Pattern Recognition, 9--17. https://doi.org/10.1109/ICPR.2014.12",
      "doi": ""
    },
    {
      "text": "A.E.M. Méndez, M. Cartwright, and J.P. Bello. 2019. Machine-Crowd-Expert Model for Increasing User Engagement and Annotation Quality. In Proceedings of Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, 1--6. https://doi.org/10.1145/3290607.3313054",
      "doi": ""
    },
    {
      "text": "K.Y. Ngiam and I.W. Khor. 2019. Big data and machine learning algorithms for health-care delivery. The Lancet Oncology. 20(5), e262-e273. https://doi.org/https://doi.org/10.1016/S14702045(19)30149--4",
      "doi": ""
    },
    {
      "text": "J.L. Oliver, M. Brereton, D.M. Watson, and P. Roe. 2018. Visualisations elicit knowledge to refine citizen science technology design: Spectrograms resonate with birders. In Proceedings of 30th Australian Conference on Computer-Human Interaction, 133--144. https://doi.org/10.1145/3292147.3292171",
      "doi": ""
    },
    {
      "text": "S. Passi and S.J. Jackson. 2018. Trust in data science: Collaboration, translation, and accountability in corporate data science projects. 2(CSCW), 1--28. https://doi.org/10.1145/3274405",
      "doi": ""
    },
    {
      "text": "Y.F. Phillips, M. Towsey, and P. Roe. 2018. Revealing the ecological content of long-duration audio-recordings of the environment through clustering and visualisation. PLoS ONE. 13(3), e0193345. https://doi.org/10.1371/journal.pone.0193345",
      "doi": ""
    },
    {
      "text": "N. Priyadarshani, S. Marsland, and I. Castro. 2018. Automated birdsong recognition in complex acoustic environments: a review. Journal of Avian Biology. 49(5). https://doi.org/10.1111/jav.01447",
      "doi": ""
    },
    {
      "text": "M.A. Roch, et al. 2016. Management of acoustic metadata for bioacoustics. Ecol. Inform. 31(C), 122136. https://doi.org/10.1016/j.ecoinf.2015.12.002",
      "doi": ""
    },
    {
      "text": "L.H.S. Rocha, L.S. Ferreira, B.C. Paula, F.H.G. Rodrigues, and R.S. Sousa-Lima. 2015. An evaluation of manual and automated methods for detecting sounds of maned wolves (Chrysocyon brachyurus Illiger 1815). Bioacoustics. 24(2), 185198. https://doi.org/10.1080/09524622.2015.1019361",
      "doi": ""
    },
    {
      "text": "M. Sankupellay, M. Towsey, A. Truskinger, and P. Roe. 2015. Visual fingerprints of the acoustic environment: The use of acoustic indices to characterise natural habitats. In Proceedings of 2015 Big Data Visual Analytics (BDVA), 1--8. https://doi.org/10.1109/BDVA.2015.7314306",
      "doi": ""
    },
    {
      "text": "S.L. Star and J.R. Griesemer. 1989. Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkeley's Museum of Vertebrate Zoology, 1907--39. Soc. Stud. Sci. 19(3), 387--420. https://doi.org/10.1177/030631289019003001",
      "doi": ""
    },
    {
      "text": "J. Sueur and A. Farina. 2015. Ecoacoustics: the ecological investigation and interpretation of environmental sound. Biosemiotics. 8(3), 493--502. https://doi.org/10.1007/s12304-015--9248-x",
      "doi": ""
    },
    {
      "text": "J. Sueur, S. Pavoine, O. Hamerlynck, and S. Duvail. 2009. Rapid acoustic survey for biodiversity appraisal. PLOS ONE. 3(12), e4065. https://doi.org/10.1371/journal.pone.0004065",
      "doi": ""
    },
    {
      "text": "M. Towsey, B. Planitz, A. Nantes, J. Wimmer, and P. Roe. 2012. A toolbox for animal call recognition. Bioacoustics. 21(2), 107--125. https://doi.org/10.1080/09524622.2011.648753",
      "doi": ""
    },
    {
      "text": "M. Towsey, L. Zhang, M. Cottman-Fields, J. Wimmer, J. Zhang, and P. Roe. 2014. Visualization of long-duration acoustic recordings of the environment. Procedia Comput. Sci. 29(C), 703712. https://doi.org/10.1016/j.procs.2014.05.063",
      "doi": ""
    },
    {
      "text": "M. Towsey, et al. 2018. Long-duration, false-colour spectrograms for detecting species in large audio data-sets. Journal of Ecoacoustics. 2(1--13. https://doi.org/10.22261/JEA.IUSWUI",
      "doi": ""
    },
    {
      "text": "M.W. Towsey, A. Truskinger, and P. Roe. 2015. The navigation and visualisation of environmental audio using zooming spectrograms. In Proceedings of 2015 IEEE International Conference on Data Mining Workshop (ICDMW), https://doi.org/10.1109/ICDMW.2015.118",
      "doi": "10.1109/ICDMW.2015.118"
    },
    {
      "text": "A. Truskinger, M. Brereton, and P. Roe. 2018. Visualizing five decades of environmental acoustic data. In Proceedings of 2018 IEEE 14th International Conference on e-Science (e-Science), 1--10. https://doi.org/10.1109/eScience.2018.00140",
      "doi": ""
    },
    {
      "text": "A. Truskinger, M. Cottman-Fields, D. Johnson, and P. Roe. 2013. Rapid scanning of spectrograms for efficient identification of bioacoustic events in big data. In Proceedings of 2013 IEEE 9th International Conference on e-Science, 270--277. https://doi.org/10.1109/eScience.2013.25",
      "doi": "10.1109/eScience.2013.25"
    }
  ]
}