{
  "doi": "10.1145/3313831.3376740",
  "title": "Callisto: Capturing the \"Why\" by Connecting Conversations with Computational Narratives",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "When teams of data scientists collaborate on computational notebooks, their discussions often contain valuable insight into their design decisions. These discussions not only explain analysis in the current notebook but also alternative paths, which are often poorly documented. However, these discussions are disconnected from the notebooks for which they could provide valuable context. We propose Callisto, an extension to computational notebooks that captures and stores contextual links between discussion messages and notebook elements with minimal effort from users. Callisto allows notebook readers to better understand the current notebook content and the overall problem-solving process that led to it, by making it possible to browse the discussions and code history relevant to any part of the notebook. This is particularly helpful for onboarding new notebook collaborators to avoid misinterpretations and duplicated work, as we found in a two-stage evaluation with 32 data science students.",
  "authors": [
    {
      "name": "April Yi Wang",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481726",
      "orcid": "0000-0001-8724-4662"
    },
    {
      "name": "Zihan Wu",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528286",
      "orcid": "missing"
    },
    {
      "name": "Christopher Brooks",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100076780",
      "orcid": "0000-0003-0875-0204"
    },
    {
      "name": "Steve Oney",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81453662914/rel-imgonly/81453662914.jpg",
      "acmid": "81453662914",
      "orcid": "0000-0002-5823-1499"
    }
  ],
  "references": [
    {
      "text": "2013. ShareDB. (2013). https://github.com/share/sharedb. **Callisto's source is available at github.com/littleaprilfool/callisto",
      "doi": ""
    },
    {
      "text": "2019. Autolinked references and URLs - GitHub Help. (2019). https://help.github.com/en/articles/ autolinked-references-and-urls",
      "doi": ""
    },
    {
      "text": "2019. Deepnote. (2019). https://www.deepnote.com.",
      "doi": ""
    },
    {
      "text": "2019. Google Colaboratory. (2019). https://colab.research.google.com.",
      "doi": ""
    },
    {
      "text": "2019. JSFiddle. (2019). https://jsfiddle.net.",
      "doi": ""
    },
    {
      "text": "Adrian Bachmann and Abraham Bernstein. 2009. Software process data quality and characteristics: a historical view on open and closed source projects. In Proceedings of the joint international and annual ERCIM workshops on Principles of software evolution (IWPSE) and software evolution (Evol) workshops. ACM, 119--128.",
      "doi": "10.1145/1595808.1595830"
    },
    {
      "text": "Raymond PL Buse and Westley Weimer. 2010. Automatically documenting program changes.. In ASE, Vol. 10. 33--42.",
      "doi": ""
    },
    {
      "text": "Yan Chen, Sang Won Lee, Yin Xie, YiWei Yang, Walter S Lasecki, and Steve Oney. 2017. Codeon: On-Demand Software Development Assistance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3025453.3025972"
    },
    {
      "text": "Parmit K. Chilana, Nathaniel Hudson, Srinjita Bhaduri, Prashant Shashikumar, and Shaun Kane. 2018. Supporting Remote Real-Time Expert Help: Opportunities and Challenges for Novice 3D Modelers. In 2018 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 157--166. DOI: http://dx.doi.org/10.1109/VLHCC.2018.8506568",
      "doi": ""
    },
    {
      "text": "Parmit K. Chilana, Amy J. Ko, and Jacob O. Wobbrock. 2012. LemonAid: Selection-based Crowdsourced Contextual Help for Web Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1549--1558. DOI: http://dx.doi.org/10.1145/2207676.2208620",
      "doi": "10.1145/2207676.2208620"
    },
    {
      "text": "Soon Hau Chua, Toni-Jan Keith Palma Monserrat, Dongwook Yoon, Juho Kim, and Shengdong Zhao. 2017. Korero: Facilitating Complex Referencing of Visual Materials in Asynchronous Discussion Interface. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 34 (Dec. 2017), 19 pages. DOI: http://dx.doi.org/10.1145/3134669",
      "doi": "10.1145/3134669"
    },
    {
      "text": "Sarah D'Angelo and Andrew Begel. 2017. Improving communication between pair programmers using shared gaze awareness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6245--6290.",
      "doi": "10.1145/3025453.3025573"
    },
    {
      "text": "Susan R Fussell and Robert M Krauss. 1992. Coordination of knowledge in communication: Effects of speakers' assumptions about what others know. Journal of personality and Social Psychology 62, 3 (1992), 378.",
      "doi": ""
    },
    {
      "text": "Susan R Fussell, Robert E Kraut, and Jane Siegel. 2000. Coordination of communication: Effects of shared visual context on collaborative work. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 21--30.",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "Philip J. Guo. 2012. Software tools to facilitate research programming. Ph.D. Dissertation. Stanford University Stanford, CA.",
      "doi": ""
    },
    {
      "text": "Pavel Gurevich, Joel Lanir, Benjamin Cohen, and Ran Stone. 2012. TeleAdvisor: A Versatile Augmented Reality Tool for Remote Assistance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 619--622. DOI: http://dx.doi.org/10.1145/2207676.2207763",
      "doi": "10.1145/2207676.2207763"
    },
    {
      "text": "David Haney. 2014. Introducing Runnable JavaScript, CSS, and HTML Code Snippets. (2014). Retrieved September 15, 2019 from https://stackoverflow.blog/2014/09/16/introducingrunnable-javascript-css-and-html-code-snippets/.",
      "doi": ""
    },
    {
      "text": "Andrew Head, Fred Hohman, Titus Barik, Steven M. Drucker, and Robert DeLine. 2019. Managing Messes in Computational Notebooks. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 270, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300500",
      "doi": "10.1145/3290605.3300500"
    },
    {
      "text": "Project Jupyter. 2015. Project Jupyter: Computational Narratives as the Engine of Collaborative Data Science. (2015). Retrieved September 15, 2019 from https://blog.jupyter.org/project-jupytercomputational-narratives-as-the-engine-ofcollaborative-data-science-2b5fb94c3c58.",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery, Amber Horvath, and Brad Myers. 2017. Variolite: Supporting Exploratory Programming by Data Scientists. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1265--1276. DOI: http://dx.doi.org/10.1145/3025453.3025626",
      "doi": "10.1145/3025453.3025626"
    },
    {
      "text": "Mary Beth Kery, Bonnie E. John, Patrick O'Flaherty, Amber Horvath, and Brad A. Myers. 2019. Towards Effective Foraging by Data Scientists to Find Past Analysis Choices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 92, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300322",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery and Brad A. Myers. 2017. Exploring exploratory programming. In 2017 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC) (2017--10). 25--29. DOI: http://dx.doi.org/10.1109/VLHCC.2017.8103446",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery, Marissa Radensky, Mahima Arya, Bonnie E. John, and Brad A. Myers. 2018. The Story in the Notebook: Exploratory Data Science Using a Literate Programming Tool. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 174, 11 pages. DOI: http://dx.doi.org/10.1145/3173574.3173748",
      "doi": ""
    },
    {
      "text": "Miryung Kim, Thomas Zimmermann, Robert DeLine, and Andrew Begel. 2016. The Emerging Role of Data Scientists on Software Development Teams. In Proceedings of the 38th International Conference on Software Engineering (2016) (ICSE '16). ACM, 96--107. DOI: http://dx.doi.org/10.1145/2884781.2884783",
      "doi": "10.1145/2884781.2884783"
    },
    {
      "text": "Thomas Kluyver, Benjamin Ragan-Kelley, Fernando Pérez, Brian E Granger, Matthias Bussonnier, Jonathan Frederic, Kyle Kelley, Jessica B Hamrick, Jason Grout, Sylvain Corlay, and others. 2016. Jupyter Notebooks-a publishing format for reproducible computational workflows.. In ELPUB. 87--90.",
      "doi": ""
    },
    {
      "text": "Donald E. Knuth. 1984. Literate Programming. Comput. J. 27, 2 (1984), 97--111. DOI: http://dx.doi.org/10.1093/comjnl/27.2.97",
      "doi": "10.1093/comjnl/27.2.97"
    },
    {
      "text": "Laura Koesten, Emilia Kacprzak, Jeni Tennison, and Elena Simperl. 2019. Collaborative Practices with Structured Data: Do Tools Support What Users Need?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 100, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300330",
      "doi": "10.1145/3290605.3300330"
    },
    {
      "text": "David R Krathwohl. 2002. A revision of Bloom's taxonomy: An overview. Theory into practice 41, 4 (2002), 212--218.",
      "doi": ""
    },
    {
      "text": "Sean Kross and Philip J. Guo. 2019. Practitioners Teaching Data Science in Industry and Academia: Expectations, Workflows, and Challenges. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. DOI: http://dx.doi.org/10.1145/3290605.3300493",
      "doi": ""
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018. ConceptScape: Collaborative Concept Mapping for Video Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 387, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173961",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Walid Maalej and Hans-Jorg Happel. 2009. From work to word: How do software developers describe their work?. In 2009 6th IEEE International Working Conference on Mining Software Repositories. IEEE, 121--130.",
      "doi": "10.1109/MSR.2009.5069490"
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q. Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How Data Science Workers Work with Data: Discovery, Capture, Curation, Design, Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 126, 15 pages. DOI: http://dx.doi.org/10.1145/3290605.3300356",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Steve Oney, Christopher Brooks, and Paul Resnick. 2018. Creating Guided Code Explanations with chat. codes. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 131.",
      "doi": ""
    },
    {
      "text": "Soya Park, Amy X. Zhang, and David R. Karger. 2018. Post-literate Programming: Linking Discussion and Code in Software Development Teams. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST '18 Adjunct). ACM, NY, NY, USA, 51--53. DOI: http://dx.doi.org/10.1145/3266037.3266098",
      "doi": "10.1145/3266037.3266098"
    },
    {
      "text": "Samir Passi and Steven J. Jackson. 2018. Trust in Data Science: Collaboration, Translation, and Accountability in Corporate Data Science Projects. 2 (2018), 136:1--136:28. Issue CSCW. DOI: http://dx.doi.org/10.1145/3274405",
      "doi": ""
    },
    {
      "text": "Jeffrey M. Perkel. 2018. Why Jupyter is data scientists' computational notebook of choice. Nature 563 (2018), 145. DOI: http://dx.doi.org/10.1038/d41586-018-07196--1",
      "doi": ""
    },
    {
      "text": "Bernadette M. Randles, Irene V. Pasquetto, Milena S. Golshan, and Christine L. Borgman. 2017. Using the Jupyter Notebook as a Tool for Open Science: An Empirical Study. In 2017 ACM/IEEE Joint Conference on Digital Libraries (JCDL). 1--2. DOI: http://dx.doi.org/10.1109/JCDL.2017.7991618",
      "doi": ""
    },
    {
      "text": "Adam Rule, Ian Drosos, Aurélien Tabard, and James D. Hollan. 2018a. Aiding Collaborative Reuse of Computational Notebooks with Annotated Cell Folding. Proc. ACM Hum.-Comput. Interact. 2 (2018), 150:1--150:12. Issue CSCW. DOI: http://dx.doi.org/10.1145/3274419",
      "doi": ""
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and James D. Hollan. 2018b. Exploration and Explanation in Computational Notebooks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 32, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173606",
      "doi": ""
    },
    {
      "text": "Adam Carl Rule. 2018. Design and Use of Computational Notebooks. Ph.D. Dissertation. University of California San Diego.",
      "doi": ""
    },
    {
      "text": "James Tam and Saul Greenberg. 2006. A Framework for Asynchronous Change Awareness in Collaborative Documents and Workspaces. Int. J. Hum.-Comput. Stud. 64, 7 (July 2006), 583--598. DOI: http://dx.doi.org/10.1016/j.ijhcs.2006.02.004",
      "doi": "10.1016/j.ijhcs.2006.02.004"
    },
    {
      "text": "April Yi Wang, Anant Mittal, Christopher Brooks, and Steve Oney. 2019. How Data Scientists Use Computational Notebooks for Real-Time Collaboration. 3 (2019), 39:1--39:30. Issue CSCW. DOI: http://dx.doi.org/10.1145/3359141",
      "doi": "10.1145/3359141"
    },
    {
      "text": "Matin Yarmand, Dongwook Yoon, Samuel Dodson, Ido Roll, and Sidney S. Fels. 2019. ?Can You Believe [1:21]?!\": Content and Time-Based Reference Patterns in Video Comments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 489, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300719",
      "doi": ""
    },
    {
      "text": "Amy X. Zhang and Justin Cranshaw. 2018. Making Sense of Group Chat Through Collaborative Tagging and Summarization. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 196 (Nov. 2018), 27 pages. DOI: http://dx.doi.org/10.1145/3274465",
      "doi": "10.1145/3274465"
    },
    {
      "text": "Sacha Zyto, David Karger, Mark Ackerman, and Sanjoy Mahajan. 2012. Successful Classroom Deployment of a Social Document Annotation System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1883--1892. DOI: http://dx.doi.org/10.1145/2207676.2208326",
      "doi": "10.1145/2207676.2208326"
    }
  ]
}