{
  "doi": "10.1145/3313831.3376262",
  "title": "Button Simulation and Design via FDVV Models",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Designing a push-button with desired sensation and performance is challenging because the mechanical construction must have the right response characteristics. Physical simulation of a button's force-displacement (FD) response has been studied to facilitate prototyping; however, the simulations' scope and realism have been limited. In this paper, we extend FD modeling to include vibration (V) and velocity-dependence characteristics (V). The resulting FDVV models better capture tactility characteristics of buttons, including snap. They increase the range of simulated buttons and the perceived realism relative to FD models. The paper also demonstrates methods for obtaining these models, editing them, and simulating accordingly. This end-to-end approach enables the analysis, prototyping, and optimization of buttons, and supports exploring designs that would be hard to implement mechanically.",
  "authors": [
    {
      "name": "Yi-Chi Liao",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-99658749625/rel-imgonly/_chichi2.png",
      "acmid": "99658749625",
      "orcid": "missing"
    },
    {
      "name": "Sunjun Kim",
      "institution": "Aalto University & KAIST, Espoo, Finland",
      "img": "/do/10.1145/contrib-81460641074/rel-imgonly/sunjun.png",
      "acmid": "81460641074",
      "orcid": "missing"
    },
    {
      "name": "Byungjoo Lee",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503945",
      "orcid": "0000-0003-0341-448X"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "Victoria. E. Abraira and David. D. Ginty. 2013. The Sensory Neurons of Touch. Neuron 79, 4 (2013), 618 -- 639. DOI: http://dx.doi.org/10.1016/j.neuron.2013.07.051",
      "doi": ""
    },
    {
      "text": "Kenichi Akagi. 1992. A Computer Keyboard Key Feel Study in Performance and Preference. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 36, 5 (1992), 523--527. DOI: http://dx.doi.org/10.1177/154193129203600511",
      "doi": ""
    },
    {
      "text": "B. Allotta, V. Colla, and G. Bioli. 1999. A mechatronic device for simulating push-buttons and knobs. In Proceedings IEEE International Conference on Multimedia Computing and Systems, Vol. 1. 636--642 vol.1. DOI: http://dx.doi.org/10.1109/MMCS.1999.779274",
      "doi": "10.1109/MMCS.1999.779274"
    },
    {
      "text": "M. Angerilli, A. Frisoli, F. Salsedo, S. Marcheschi, and M. Bergamasco. 2001. Haptic simulation of an automotive manual gearshift. In Proceedings 10th IEEE International Workshop on Robot and Human Interactive Communication. ROMAN 2001 (Cat. No.01TH8591). 170--175. DOI: http://dx.doi.org/10.1109/ROMAN.2001.981897",
      "doi": ""
    },
    {
      "text": "Jonathan Becedas, Gabriela Mamani, Vicente Feliu, and Hebertt Sira-Ramírez. 2009. Estimation of Mass-Spring-Dumper Systems. Springer Netherlands, Dordrecht, 411--422. DOI: http://dx.doi.org/10.1007/978--1--4020--8919-0_28",
      "doi": ""
    },
    {
      "text": "Jonathan Becedas, Gabriela Mamani, Vicente Feliu-Batlle, and Hebertt Sira-Ramírez. 2007. Algebraic Identification Method for Mass-Spring-Damper System.",
      "doi": ""
    },
    {
      "text": "Ingvars Birznieks, Per Jenmalm, Antony W. Goodwin, and Roland S. Johansson. 2001. Encoding of Direction of Fingertip Forces by Human Tactile Afferents. Journal of Neuroscience 21, 20 (2001), 8222--8237. DOI: http://dx.doi.org/10.1523/JNEUROSCI.21--20-08222.2001",
      "doi": ""
    },
    {
      "text": "Stephen P. Boyd and Craig H. Barratt. 1991. Linear Controller Design: Limits of Performance. Prentice-Hall, Inc., Upper Saddle River, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Andy Clark. 2013. Whatever next? Predictive brains, situated agents, and the future of cognitive science. Behavioral and Brain Sciences 36, 3 (2013), 181--204. DOI: http://dx.doi.org/10.1017/S0140525X12000477",
      "doi": ""
    },
    {
      "text": "David Clark. 1982. High-Resolution Subjective Testing Using a Double-Blind Comparator. J. Audio Eng. Soc 30, 5 (1982), 330--338. http://www.aes.org/e-lib/browse.cfm?elib=3839",
      "doi": ""
    },
    {
      "text": "M. B. Colton and J. M. Hollerbach. 2005. Identification of nonlinear passive devices for haptic simulations. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics Conference. 363--368. DOI: http://dx.doi.org/10.1109/WHC.2005.77",
      "doi": "10.1109/WHC.2005.77"
    },
    {
      "text": "Matthew J. C. Crump and Gordon D. Logan. 2010. Warning: This keyboard will deconstruct- The role of the keyboard in skilled typewriting. Psychonomic Bulletin & Review 17, 3 (01 Jun 2010), 394--399. DOI: http://dx.doi.org/10.3758/PBR.17.3.394",
      "doi": ""
    },
    {
      "text": "R. S. Dahiya, G. Metta, M. Valle, and G. Sandini. 2010. Tactile Sensing-From Humans to Humanoids. IEEE Transactions on Robotics 26, 1 (Feb 2010), 1--20. DOI: http://dx.doi.org/10.1109/TRO.2009.2033627",
      "doi": "10.1109/TRO.2009.2033627"
    },
    {
      "text": "C. Doerrer and R. Werthschuetzky. 2002. Simulating Push-Buttons Using a Haptic Display: Requirements on Force Resolution and Force-Displacement Curve. (2002).",
      "doi": ""
    },
    {
      "text": "K. FUJITA. 2001. A New Softness Display Interface by Dynamic Fingertip Contact Area Control. 5th World Multiconference on Systemics, Cybernetics and Informatics, 2001 (2001), 78--82. https://ci.nii.ac.jp/naid/10031028472/en/",
      "doi": ""
    },
    {
      "text": "Nico Galoppo, Serhat Tekin, Miguel A. Otaduy, Markus Gross, and Ming C. Lin. 2007. Interactive Haptic Rendering of High-Resolution Deformable Objects. In Virtual Reality, Randall Shumaker (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 215--223.",
      "doi": ""
    },
    {
      "text": "T. Hachisu, G. Cirio, M. Marchal, A. Lécuyer, and H. Kajimoto. 2011. Pseudo-haptic feedback augmented with visual and tactile vibrations. In 2011 IEEE International Symposium on VR Innovation. 327--328. DOI: http://dx.doi.org/10.1109/ISVRI.2011.5759662",
      "doi": ""
    },
    {
      "text": "T. Hachisu and H. Kajimoto. 2017. Vibration Feedback Latency Affects Material Perception During Rod Tapping Interactions. IEEE Transactions on Haptics 10, 2 (April 2017), 288--295. DOI: http://dx.doi.org/10.1109/TOH.2016.2628900",
      "doi": "10.1109/TOH.2016.2628900"
    },
    {
      "text": "Vincent Hayward and Brian Armstrong. 2000. A new computational model of friction applied to haptic rendering. In Experimental Robotics VI. Springer London, London, 403--412.",
      "doi": ""
    },
    {
      "text": "Robert D. Howe and Mark R. Cutkosky. 1989. Sensing skin acceleration for slip and texture perception. Proceedings, 1989 International Conference on Robotics and Automation (1989), 145--150 vol.1.",
      "doi": ""
    },
    {
      "text": "Yoshiaki Ikeda and Kinya Fujita. 2004. Display of Soft Elastic Object by Simultaneous Control of Fingertip Contact Area and Reaction Force. Transactions of the Virtual Reality Society of Japan 9, 2 (2004), 187--194. DOI: http://dx.doi.org/10.18974/tvrsj.9.2_187",
      "doi": ""
    },
    {
      "text": "Devin L Jindrich, Aruna D Balakrishnan, and Jack T Dennerlein. 2004. Effects of keyswitch design and finger posture on finger joint kinematics and dynamics during tapping on computer keyswitches. Clinical Biomechanics 19, 6 (2004), 600 -- 608. DOI: http://dx.doi.org/https://doi.org/10.1016/j.clinbiomech.2004.03.003",
      "doi": ""
    },
    {
      "text": "Hiroyuki Kajimoto, Naoki Kawakami, Taro Maeda, and Susumu Tachi. 2001. Electro-Tactile Display with Force Feedback.",
      "doi": ""
    },
    {
      "text": "Krueger L. (Ed.) Krueger L. (Ed.) Katz, D. 1989. The World of Touch.",
      "doi": ""
    },
    {
      "text": "Johan Kildal. 2010. 3D-press: Haptic Illusion of Compliance when Pressing on a Rigid Surface. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI '10). ACM, NY, NY, USA, Article 21, 8 pages. DOI: http://dx.doi.org/10.1145/1891903.1891931",
      "doi": "10.1145/1891903.1891931"
    },
    {
      "text": "Jeong Ho Kim, Lovenoor Aulck, Michael C. Bartha, Christy A. Harper, and Peter W. Johnson. 2014a. Differences in typing forces, muscle activity, comfort, and typing performance among virtual, notebook, and desktop keyboards. Applied Ergonomics 45, 6 (2014), 1406 -- 1413. DOI: http://dx.doi.org/https://doi.org/10.1016/j.apergo.2014.04.001",
      "doi": ""
    },
    {
      "text": "Jeong Ho Kim, Lovenoor S. Aulck, Michael C. Bartha, Christy A. Harper, and Peter W. Johnson. 2014b. Differences in typing forces, muscle activity, comfort, and typing performance among virtual, notebook, and desktop keyboards. Applied ergonomics 45 6 (2014), 1406--13.",
      "doi": ""
    },
    {
      "text": "Sunjun Kim, Byungjoo Lee, and Antti Oulasvirta. 2018. Impact Activation Improves Rapid Button Pressing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 571, 8 pages. DOI: http://dx.doi.org/10.1145/3173574.3174145",
      "doi": "10.1145/3173574.3174145"
    },
    {
      "text": "Sunjun Kim and Geehyuk Lee. 2013. Haptic Feedback Design for a Virtual Button Along Force-displacement Curves. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 91--96. DOI: http://dx.doi.org/10.1145/2501988.2502041",
      "doi": "10.1145/2501988.2502041"
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: Making a Touch Screen Keyboard More Touchable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 553--562. DOI: http://dx.doi.org/10.1145/2470654.2470733",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Sadanori Konishi and Genshiro Kitagawa. 2007. Information Criteria and Statistical Modeling (1st ed.). Springer Publishing Company, Incorporated.",
      "doi": ""
    },
    {
      "text": "K. J. Kuchenbecker, J. Fiene, and G. Niemeyer. 2006. Improving contact realism through event-based haptic feedback. IEEE Transactions on Visualization and Computer Graphics 12, 2 (March 2006), 219--230. DOI: http://dx.doi.org/10.1109/TVCG.2006.32",
      "doi": "10.1109/TVCG.2006.32"
    },
    {
      "text": "Byungjoo Lee, Sunjun Kim, Antti Oulasvirta, Jong-In Lee, and Eunji Park. 2018. Moving Target Selection: A Cue Integration Model. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 230, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173804",
      "doi": "10.1145/3173574.3173804"
    },
    {
      "text": "Byungjoo Lee and Antti Oulasvirta. 2016. Modelling Error Rates in Temporal Pointing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1857--1868. DOI: http://dx.doi.org/10.1145/2858036.2858143",
      "doi": "10.1145/2858036.2858143"
    },
    {
      "text": "James R Lewis, Kathleen M Potosnak, and Regis L Magyar. 1997. Keys and keyboards. In Handbook of human-computer interaction. Elsevier, 1285--1315.",
      "doi": ""
    },
    {
      "text": "Yi-Chi Liao, Yen-Chiu Chen, Liwei Chan, and Bing-Yu Chen. 2017. Dwell+: Multi-Level Mode Selection Using Vibrotactile Cues. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 5--16. DOI: http://dx.doi.org/10.1145/3126594.3126627",
      "doi": "10.1145/3126594.3126627"
    },
    {
      "text": "Yi-Chi Liao, Sunjun Kim, and Antti Oulasvirta. 2018. One Button to Rule Them All: Rendering Arbitrary Force-Displacement Curves. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST '18 Adjunct). ACM, NY, NY, USA, 111--113. DOI: http://dx.doi.org/10.1145/3266037.3266118",
      "doi": "10.1145/3266037.3266118"
    },
    {
      "text": "Karon E. MacLean and William K. Durfee. 1995. Apparatus to study the emulation of haptic feedback. In ASME Dynamic Systems and Control Division, Vol. 57--2. ASME, 615--621.",
      "doi": ""
    },
    {
      "text": "Karon E. MacLean. 1996. The\"Haptic Camera\": a technique for characterizing and playing back haptic properties of real envi.",
      "doi": ""
    },
    {
      "text": "Richard W. Marklin and Mark L. Nagurka. 2000a. Measurement of Stiffness and Damping Characateristics of Computer Keyboard Keys. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 44, 6 (2000), 678--681. DOI: http://dx.doi.org/10.1177/154193120004400637",
      "doi": ""
    },
    {
      "text": "Richard W. Marklin and Mark L. Nagurka. 2000b. Measurement of Stiffness and Damping Characateristics of Computer Keyboard Keys. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 44, 6 (2000), 678--681. DOI: http://dx.doi.org/10.1177/154193120004400637",
      "doi": ""
    },
    {
      "text": "Thomas H. Massie and J. K. Salisbury. 1994. The PHANToM haptic interface: A device for probing virtual objects. In Proceedings of the ASME Dynamic Systems and Control Division. 295--301.",
      "doi": ""
    },
    {
      "text": "Carr B. Carr B. Meilgaard, M. 2007. Sensory Evaluation Techniques (4th edition ed.). Boca Raton: CRC Press. DOI: http://dx.doi.org/https://doi.org/10.1201/b16452",
      "doi": ""
    },
    {
      "text": "Leonard Meirovitch. 1997. Principles and techniques of vibrations. Vol. 1. Prentice Hall New Jersey.",
      "doi": ""
    },
    {
      "text": "G. Moy, C. Wagner, and R. S. Fearing. 2000. A compliant tactile display for teletaction. In Proceedings 2000 ICRA. Millennium Conference. IEEE International Conference on Robotics and Automation. Symposia Proceedings (Cat. No.00CH37065), Vol. 4. 3409--3415 vol.4. DOI: http://dx.doi.org/10.1109/ROBOT.2000.845247",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Daniel Fitzgerald, Zhiyao (John) Ma, Luke Vink, Daniel Levine, and Hiroshi Ishii. 2019. inFORCE: Bi-directional 'Force' Shape Display for Haptic Interaction. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 615--623. DOI: http://dx.doi.org/10.1145/3294109.3295621",
      "doi": "10.1145/3294109.3295621"
    },
    {
      "text": "Daichi Ogawa, Vibol Yem, Taku Hachisu, and Hiroyuki Kajimoto. 2015. Multiple Texture Button by Adding Haptic Vibration and Displacement Sensing to the Physical Button. In SIGGRAPH Asia 2015 Haptic Media And Contents Design (SA '15). ACM, NY, NY, USA, Article 12, 2 pages. DOI: http://dx.doi.org/10.1145/2818384.2818394",
      "doi": "10.1145/2818384.2818394"
    },
    {
      "text": "A. M. Okamura, M. R. Cutkosky, and J. T. Dennerlein. 2001. Reality-based models for vibration feedback in virtual environments. IEEE/ASME Transactions on Mechatronics 6, 3 (Sep. 2001), 245--252. DOI: http://dx.doi.org/10.1109/3516.951362",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Sunjun Kim, and Byungjoo Lee. 2018. Neuromechanics of a Button Press. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 508, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174082",
      "doi": "10.1145/3173574.3174082"
    },
    {
      "text": "Dinesh K. Pai, Austin Rothwell, Pearson Wyder-Hodge, Alistair Wick, Ye Fan, Egor Larionov, Darcy Harrison, Debanga Raj Neog, and Cole Shing. 2018. The Human Touch: Measuring Contact with Real Human Soft Tissues. ACM Trans. Graph. 37, 4, Article 58 (July 2018), 12 pages. DOI: http://dx.doi.org/10.1145/3197517.3201296",
      "doi": "10.1145/3197517.3201296"
    },
    {
      "text": "Gunhyuk Park and Seungmoon Choi. 2018. PhysVib: Physically Plausible Vibrotactile Feedback Library to Collisions on a Mobile Device. In Haptic Interaction, Shoichi Hasegawa, Masashi Konyo, Ki-Uk Kyung, Takuya Nojima, and Hiroyuki Kajimoto (Eds.). Springer Singapore, Singapore, 409--413.",
      "doi": ""
    },
    {
      "text": "Gunhyuk Park, Seungmoon Choi, Kyunghun Hwang, Sunwook Kim, Jaecheon Sa, and Moonchae Joung. 2011. Tactile Effect Design and Evaluation for Virtual Buttons on a Mobile Device Touchscreen. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). Association for Computing Machinery, New York, NY, USA, 11--20. DOI: http://dx.doi.org/10.1145/2037373.2037376",
      "doi": "10.1145/2037373.2037376"
    },
    {
      "text": "David Posada and Thomas R. Buckley. 2004. Model Selection and Model Averaging in Phylogenetics: Advantages of Akaike Information Criterion and Bayesian Approaches Over Likelihood Ratio Tests. Systematic Biology 53, 5 (10 2004), 793--808. DOI: http://dx.doi.org/10.1080/10635150490522304",
      "doi": ""
    },
    {
      "text": "Robert G. Radwin and One-Jang Jeng. 1997. Activation Force and Travel effects on Overexertion in Repetitive Key Tapping. Human Factors 39, 1 (1997), 130--140. DOI: http://dx.doi.org/10.1518/001872097778940605 PMID: 9302885.",
      "doi": ""
    },
    {
      "text": "David Rempel, Elaine Serina, Edward Klinenberg, Bernard J. Martin, Thomas J. Armstrong, James A. Foulke, and Sivakumaran Natarajan. 1997. The effect of keyboard keyswitch make force on applied force and finger flexor muscle activity. Ergonomics 40, 8 (1997), 800--808. DOI: http://dx.doi.org/10.1080/001401397187793 PMID: 9336104.",
      "doi": ""
    },
    {
      "text": "Bruno H. Repp. 2005. Sensorimotor synchronization: A review of the tapping literature. Psychonomic Bulletin & Review 12, 6 (01 Dec 2005), 969--992. DOI: http://dx.doi.org/10.3758/BF03206433",
      "doi": ""
    },
    {
      "text": "Yann Roudaut, Aurélie Lonigro, Bertrand Coste, Jizhe Hao, Patrick Delmas, and Marcel Crest. 2012. Touch sense. Channels 6, 4 (2012), 234--245. DOI: http://dx.doi.org/10.4161/chan.22213 PMID: 23146937.",
      "doi": ""
    },
    {
      "text": "J. K. Salisbury and M. A. Srinivasan. 1997. Phantom-based haptic interaction with virtual objects. IEEE Computer Graphics and Applications 17, 5 (Sep. 1997), 6--10. DOI: http://dx.doi.org/10.1109/MCG.1997.1626171",
      "doi": "10.1109/MCG.1997.1626171"
    },
    {
      "text": "Robert A. Scheidt, Michael A. Conditt, Emanuele L. Secco, and Ferdinando A. Mussa-Ivaldi. 2005. Interaction of Visual and Proprioceptive Feedback During Adaptation of Human Reaching Movements. Journal of Neurophysiology 93, 6 (2005), 3200--3213. DOI: http://dx.doi.org/10.1152/jn.00947.2004 PMID: 15659526.",
      "doi": ""
    },
    {
      "text": "E. P. Scilingo, M. Bianchi, G. Grioli, and A. Bicchi. 2010. Rendering Softness: Integration of Kinesthetic and Cutaneous Information in a Haptic Device. IEEE Transactions on Haptics 3, 2 (April 2010), 109--118. DOI: http://dx.doi.org/10.1109/TOH.2010.2",
      "doi": "10.1109/TOH.2010.2"
    },
    {
      "text": "Bobak Shahriari, Kevin Swersky, Ziyu Wang, Ryan P Adams, and Nando De Freitas. 2015. Taking the human out of the loop: A review of Bayesian optimization. Proc. IEEE 104, 1 (2015), 148--175.",
      "doi": ""
    },
    {
      "text": "Aiguo Song, Jia Liu, and Juan Wu. 2008. Softness Haptic Display Device for Human- Computer Interaction. In Human Computer Interaction, Ioannis Pavlidis (Ed.). IntechOpen, Rijeka, Chapter 16. DOI: http://dx.doi.org/10.5772/6299",
      "doi": ""
    },
    {
      "text": "Paul Strohmeier and Kasper Hornbæk. 2017. Generating Haptic Textures with a Vibrotactile Actuator. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4994--5005. DOI: http://dx.doi.org/10.1145/3025453.3025812",
      "doi": "10.1145/3025453.3025812"
    },
    {
      "text": "Seiya Takei, Ryo Watanabe, Ryuta Okazaki, Taku Hachisu, and Hiroyuki Kajimoto. 2015. Presentation of Softness Using Film-Type Electro-Tactile Display and Pressure Distribution Measurement. Springer Japan, Tokyo, 91--96. DOI: http://dx.doi.org/10.1007/978--4--431--55690--9_17",
      "doi": ""
    },
    {
      "text": "A. B. Vallbo and Roland Johansson. 1999. Properties of cutaneous mechanoreceptors in the human hand-related to touch sensation.",
      "doi": ""
    },
    {
      "text": "Wenping Wang, Helmut Pottmann, and Yang Liu. 2006. Fitting B-spline Curves to Point Clouds by Curvature-based Squared Distance Minimization. ACM Trans. Graph. 25, 2 (April 2006), 214--238. DOI: http://dx.doi.org/10.1145/1138450.1138453",
      "doi": "10.1145/1138450.1138453"
    },
    {
      "text": "D. W. Weir, M. Peshkin, J. E. Colgate, P. Buttolo, J. Rankin, and M. Johnston. 2004. The haptic profile: capturing the feel of switches. In 12th International Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2004. HAPTICS '04. Proceedings. 186--193. DOI: http://dx.doi.org/10.1109/HAPTIC.2004.1287195",
      "doi": ""
    },
    {
      "text": "Parris S. Wellman and Robert D. Howe. 1995. Towards Realistic Vibrotactile Display In Virtual Environments.",
      "doi": ""
    },
    {
      "text": "K.J. Åström and T. Hägglund. 2001. The future of PID control. Control Engineering Practice 9, 11 (2001), 1163 -- 1175. DOI: http://dx.doi.org/https://doi.org/10.1016/S0967-0661(01)00062--4",
      "doi": ""
    }
  ]
}