{
  "doi": "10.1145/3313831.3376871",
  "title": "Future Opportunities for IoT to Support People with Parkinson's",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Recent years have seen an explosion of internet of things (IoT) technologies being released to the market. There has also been an emerging interest in the potentials of IoT devices to support people with chronic health conditions. In this paper, we describe the results of engagements to scope the future potentials of IoT for supporting people with Parkinson's (PwP). We ran a 2-day multi-disciplinary event with professionals with expertise in Parkinson's and IoT, to explore the opportunities, challenges and benefits. We then ran 4 workshops, engaging 13 PwP and caregivers, to scope out the needs, values and desires that the community has for utilizing IoT to monitor their symptoms. This work contributes considerations for future IoT solutions that might support PwP in better understanding their condition, through the provision of objective measurements that correspond to their, currently unmeasured, subjective experiences.",
  "authors": [
    {
      "name": "Roisin McNaney",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658582",
      "orcid": "0000-0003-3761-296X"
    },
    {
      "name": "Emmanuel Tsekleves",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81365596558",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Synnott",
      "institution": "Ulster University, Belfast, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658679145",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Somayeh Aghanavesi, Dag Nyholm, Marina Senek, Filip Bergquist, Mevludin Memedia (2017). A smartphone-based system to quantify dexterity in Parkinson's disease patients. Informatics in Medicine Unlocked. 9, 11--17. DOI: https://doi.org/10.1016/j.imu.2017.05.005.",
      "doi": ""
    },
    {
      "text": "Oliver Assad, Robert Hermann, Damian Lilla, Björn Mellies, Ronald Meyer, Liron Shevach, Sandra Siegel et al (2011). WuppDi!-Supporting Physiotherapy of Parkinson's Disease Patients via Motion-based Gaming. Mensch & Computer 2011: überMEDIEN|ÜBERmorgen. Ed. M. (Hrsg.) Eibl. Oldenbourg Verlag: München, 469--478.",
      "doi": ""
    },
    {
      "text": "Marc Bachlin, Meir Plotnik, Daniel Roggen, Inbal Maidan, Jeffrey M. Hausdorff, Nir Giladi, and Gerhard Troster (2010). Wearable assistant for Parkinson's disease patients with the freezing of gait symptom. IEEE Transactions on Information Technology in Biomedicine. 436--446",
      "doi": "10.1109/TITB.2009.2036165"
    },
    {
      "text": "Claire Bale. How Many People have Parkinson's?, https://medium.com/parkinsons-uk/how-manypeople-have-parkinsons-61d04979a770.",
      "doi": ""
    },
    {
      "text": "Andrea Bandini, Silvia Orlandi, Fabio Giovannelli, Andrea Felici, Massimo Cincotta, Daniela Clemente, Paola Vanni, Gaetano Zaccara, Claudia Manfredi. Markerless Analysis of Articulatory Movements in Patients With Parkinson's Disease. Journal of Voice 30(6), 766.e1--766.e11. DOI: https://doi.org/10.1016/j.jvoice.2015.10.014.",
      "doi": ""
    },
    {
      "text": "Diogo Branco, Raquel Bouça, Joaquim Ferreira, and Tiago Guerreiro. 2019. Designing Free-Living Reports for Parkinson's Disease. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Paper LBW1715, 6 pages. DOI: https://doi.org/10.1145/3290607.3313032",
      "doi": "10.1145/3290607.3313032"
    },
    {
      "text": "Victoria Braun and Virginia Clarke (2006). Using thematic analysis in psychology. Qualitative Research in Psychology. 3(2), 77--101.",
      "doi": ""
    },
    {
      "text": "Filippo Casamassima, Alberto Ferrari, Bojan Milosevic, Laura Rocchi, and Elisabetta Farella (2013). Wearable audio-feedback system for gait rehabilitation in subjects with Parkinson's disease. In proceedings of Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication (UbiComp '13 Adjunct. New York, NY, USA: ACM. 275--278.",
      "doi": "10.1145/2494091.2494178"
    },
    {
      "text": "Cenvigo. Kanopy: A smart bed sensor developed for continuous observation of weight and sleep, http://cenvigo.com/en/kanopy/",
      "doi": ""
    },
    {
      "text": "Shih-Hao Chang, Rui-Dong Chiang, Shih-Jung Wu, and Wei-Ting Chang (2016). A contextaware, interactive M-health system for diabetics. IT Professional, 14--22, DOI: http://doi.ieeecomputersociety.org/10.1109/MITP. 2016.48.",
      "doi": ""
    },
    {
      "text": "Ana Correia de Barros, João Cevada, Àngels Bayés, Sheila Alcaine, and Berta Mestre (2013). User-centred design of a mobile self-management solution for Parkinson's disease. In proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). New York, NY, USA, ACM. article 23, 10 pages.",
      "doi": "10.1145/2541831.2541839"
    },
    {
      "text": "Sankalp Deshkar, R. A. Thanseeh, and Varun G. Menon (2017). A Review on IoT based m-Health Systems for Diabetes. International Journal of Computer Science and Telecommunications 8(1), 13--18.",
      "doi": ""
    },
    {
      "text": "James Dieffenderfer, Henry Goodell, Brinnae Bent, Eric Beppler, Rochana Jayakumar, Murat Yokus, Jesse S. Jur, Alper Bozkurt, and David Peden (2015). Wearable wireless sensors for chronic respiratory disease monitoring. Wearable and Implantable Body Sensor Networks (BSN), 2015 IEEE 12th International Conference. IEEE. 1--6.",
      "doi": ""
    },
    {
      "text": "Emily Downward. Motor Symtpoms of Parkinson's, https://parkinsonsdisease.net/symptoms/motor/.",
      "doi": ""
    },
    {
      "text": "Fiona J. R. Eccles, Craig Murray & Jane Simpson (2011). Perceptions of cause and control in people with Parkinson's disease. Disability and Rehabilitation, 33(15--16), 1409--1420, DOI: 10.3109/09638288.2010.533241.",
      "doi": ""
    },
    {
      "text": "Moataz Eltoukhy, Christopher Kuenze, Jeonghoon Oh, Marco Jacopetti, Savannah Wooten, Joseph Signorile (2017). Microsoft Kinect can distinguish differences in over-ground gait between older persons with and without Parkinson's disease. Medical Engineering and Physics. 44, 1--7. DOI: https://doi.org/10.1016/j.medengphy.2017.03.007.",
      "doi": ""
    },
    {
      "text": "Felipe Fernandez, George C. Pallis (2014). Opportunities and challenges of the Internet of Things for healthcare: Systems engineering perspective. EAI 4th International Conference on Wireless Mobile Communication and Healthcare (Mobihealth). IEEE, 263--266.",
      "doi": ""
    },
    {
      "text": "James M. Fisher, Nils Y. Hammerla, Lynn Rochester, Peter Andras, and Richard W. Walker (2016). Body-Worn Sensors in Parkinson's Disease: Evaluating Their Acceptability to Patients. Telemedicine Journal and e-Health. 22(1), 63--69. DOI: 10.1089/tmj.2015.0026.",
      "doi": ""
    },
    {
      "text": "Jing Gao, Feng Tian, Junjun Fan, Dakuo Wang, Xiangmin Fan, Yicheng Zhu, Shuai Ma, Jin Huang, and Hongan Wang (2018). Implicit Detection of Motor Impairment in Parkinson's Disease from Everyday Smartphone Interactions. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems,. ACM, LBW043.",
      "doi": "10.1145/3170427.3188502"
    },
    {
      "text": "Global Kinetics, Global Kinetic Corporation: The PKG System, https://www.globalkineticscorporation.com.au/.",
      "doi": ""
    },
    {
      "text": "Christopher Goetz, Barbara Tilley, Stephanie Shaftman, Glenn Stebbins, Stanley Fahn, Pablo Martinez-Martin, et al (2015). Movement Disorder Society-Sponsored Revision of the Unified Parkinson's Disease Rating Scale (MDS-UPDRS): Scale Presentation and Clinimetric Testing Results. Movement Disorders. 23(15), 2129--2170, DOI: 10.1002/mds.22340.",
      "doi": ""
    },
    {
      "text": "Ho, A. K., Iansek, R., Marigliani, C., Bradshaw, J. L., & Gates, S (1998). Speech impairment in a large sample of patients with Parkinson's disease.\" Behavioural Neurology 11, 131-- 137. http://doi.org/10.1155/1999/327643.",
      "doi": ""
    },
    {
      "text": "Robert Istepanian, SH, Sijung Hu, Nada Y. Philip, and Ala Sungoor (2011). The potential of Internet of m-health Things ?m-IoT\" for non-invasive glucose level sensing. In proceedings of the Engineering in medicine and biology society, EMBC, 2011 annual international conference of the IEEE. IEEE, 5264--5266.",
      "doi": ""
    },
    {
      "text": "Dae-Young Kim, Sun-ho Hwang, Min-Gyu Kim, Joon-Hyun Song, Sin-Woong Lee, Il Kon Kim (2017). Development of Parkinson Patient Generated Data Collection Platform Using FHIR and IoT Devices. MEDINFO 2017: Precision Healthcare through Informatics. International Medical Informatics Association (IMIA). 141--145.",
      "doi": ""
    },
    {
      "text": "Elina Kuosmanen, Valerii Kan, Aku Visuri, Julio Vega, Yuuki Nishiyama, Anind K. Dey, Simon Harper, and Denzil Ferreira. 2018. Mobile-based Monitoring of Parkinson's Disease. In Proceedings of the 17th International Conference on Mobile and Ubiquitous Multimedia (MUM 2018), Slim Abdennadher and Florian Alt (Eds.). ACM, NY, NY, USA, 441--448. DOI: https://doi.org/10.1145/3282894.3289737",
      "doi": "10.1145/3282894.3289737"
    },
    {
      "text": "Sinziana Mazilu, Alberto Calatroni, Eran Gazit, Anat Mirelman, Jeffrey M. Hausdorff, and Gerhard Tröster (2015). Prediction of Freezing of Gait in Parkinson's from physiological wearables: an exploratory study. IEEE journal of biomedical and health informatics. 19(6), 1843--1854.",
      "doi": ""
    },
    {
      "text": "Sinziana Mazilu, Ulf Blanke, Michael Hardegger, Gerhard Tröster, Eran Gazit, and Jeffrey M. Hausdorff (2014). GaitAssist: a daily-life support and training system for parkinson's disease patients with freezing of gait. In proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). New York, NY, USA: ACM. 2531--2540.",
      "doi": ""
    },
    {
      "text": "Roisin McNaney, Madeline Balaam, Amey Holden, Guy Schofield, Daniel Jackson, Mary Webster, Brook Galna, Gillian Barry, Lynn Rochester, and Patrick Olivier (2015). Designing for and with People with Parkinson's: A Focus on Exergaming. In proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). New York, NY, USA. 501--510.",
      "doi": "10.1145/2702123.2702310"
    },
    {
      "text": "Roisin McNaney, Stephen Lindsay, Karim Ladha, Cassim Ladha, Guy Schofield, Thomas Ploetz, Nils Hammerla, Daniel Jackson, Richard Walker, Nick Miller, and Patrick Olivier (2011). Cueing for drooling in Parkinson's disease. SIGCHI Conference on Human Factors in Computing Systems (CHI '11). New York, NY, USA. 619--622.",
      "doi": "10.1145/1978942.1979030"
    },
    {
      "text": "Roisin McNaney, Mohammad Othman, Dan Richardson, Paul Dunphy, Telmo Amaral, Nick Miller, Helen Stringer, Patrick Olivier, and John Vines (2016). Speeching: Mobile Crowdsourced Speech Assessment to Support Self-Monitoring and Management for People with Parkinson's.In proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). New York, NY, USA: ACM. 4464--4476.",
      "doi": ""
    },
    {
      "text": "Roisin McNaney, Ivan Poliakov, John Vines, Madeline Balaam, Pengfei Zhang, and Patrick Olivier (2015). LApp: A Speech Loudness Application for People with Parkinson's on Google Glass. In proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). New York, NY, USA. 497--500.",
      "doi": "10.1145/2702123.2702292"
    },
    {
      "text": "Roisin McNaney, John Vines, Andy Dow, Harry Robinson, Heather Robinson, Kate McDonald, Leslie Brown, Peter Santer, Don Murray, Janice Murray, David Green, and Peter Wright (2018). Enabling the Participation of People with Parkinson's and their Caregivers in Co-Inquiry around Collectivist Health Technologies.In proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). New York, NY, USA,: ACM. Paper 491, 14 pages.",
      "doi": ""
    },
    {
      "text": "Roisin McNaney, John Vines, Daniel Roggen, Madeline Balaam, Pengfei Zhang, Ivan Poliakov, and Patrick Olivier. \"Exploring the acceptability of google glass as an everyday assistive device for people with parkinson's (2014). In proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). New York, NY, USA: ACM. 2551--2554.",
      "doi": ""
    },
    {
      "text": "Mevludin Memedi, Gaki Tshering, Martin Fogelberg, Ilir Jusufi, Ella Kolkowska and Gunnar Klein (2018). An Interface for IoT: Feeding Back Health-Related Data to Parkinson's Disease Patients. Journal of Sensor and Actuator Networks. 7(14), doi:10.3390/jsan7010014.",
      "doi": ""
    },
    {
      "text": "Helena M. Mentis, Rita Shewbridge, Sharon Powell, Melissa Armstrong, Paul Fishman & Lisa Shulman (2016). Co-Interpreting Movement With Sensors: Assessing Parkinson's Patients' Deep Brain Stimulation Programming. Journal Human-- Computer Interaction. 31(3--4), DOI: https://doi.org/10.1080/07370024.2015.1073592.",
      "doi": ""
    },
    {
      "text": "Nick Miller, Katherine H. O. Deane, Diana Jones, Emma Noble, Catherine Gibb (2011). National survey of speech and language therapy provision for people with Parkinson's disease in the United Kingdom: therapists' practices. International Journal of Language and Communication Disorders. 46(2), 189--201. DOI: https://doi.org/10.3109/13682822.2010.484849 .",
      "doi": ""
    },
    {
      "text": "Bhuvan Molparia, Brian N. Schrader, Eli Cohen, Jennifer L. Wagner, Sandeep R. Gupta, Sherrie Gould, Nelson Hwynn, Emily G. Spencer, Ali Torkamani (2018). Combined accelerometer and genetic analysis to differentiate essential tremor from Parkinson's disease. Peer J. 6, e5308, DOI: https://doi.org/10.7717/peerj.5308.",
      "doi": ""
    },
    {
      "text": "Tavel, Morton (2014). The Placebo Effect: the Good, the Bad, and the Ugly. The American Journal of Medicine. 127(6), 484--488. DOI: https://doi.org/10.1016/j.amjmed.2014.02.002.",
      "doi": ""
    },
    {
      "text": "Sung Min Nam, Jung Hoon Choi, Dae Young Yoo, Woosuk Kim, Hyo Young Jung, Jong Whi Kim, Miyoung Yoo, Sanghee Lee, Chul Jung Kim, Yeo Sung Yoon, and In Koo Hwang (2014). Effects of curcumin (Curcuma longa) on learning and spatial memory as well as cell proliferation and neuroblast differentiation in adult and aged mice by upregulating brain-derived neurotrophic factor and CREB signaling. Journal of Medicinal Food. 17(6), 641--649. DOI: 10.1089/jmf.2013.2965.",
      "doi": ""
    },
    {
      "text": "National Institute for Health and Care Excellence (Nice). NG71: Parkinson's disease in adults, https://www.nice.org.uk/guidance/ng71/chapter/Re commendations",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Tariq Andersen, Geradine Fitzpatrick (2017). The agency of patients and carers in medical care and self-care technologies for interacting with doctors. Health Informatics Journal. 1--20, https://doi.org/10.1177/1460458217712054.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Geraldine Fitzpatrick (2018). Understanding the Mundane Nature of Self-care: Ethnographic Accounts of People Living with Parkinson's. In proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 402. DOI: https://doi.org/10.1145/3173574.3173976.",
      "doi": "10.1145/3173574.3173976"
    },
    {
      "text": "Katherine H O'Deane, Helen Flaherty, David J Daley, Roland Pascoe, Bridget Penhale, Carl E Clarke, Catherine Sackley, Stacey Storey (2014). Priority setting partnership to identify the top 10 research priorities for the management of Parkinson's disease. British Medical Journal (BMJ Open). 4(12), e006434. DOI: 1136/bmjopen-2014006434.",
      "doi": ""
    },
    {
      "text": "Chang-Se Oh, Min-Seok Seo, Jung-Hyuck Lee, Sang-Hyun Kim, Young-Don Kim, and Hyun-Ju Park (2015). Indoor air quality monitoring systems in the IoT environment. The Journal of Korean Institute of Communications and Information Sciences. 40(5), 886--891.",
      "doi": ""
    },
    {
      "text": "Alex Osborn (1957. Applied imagination : principles and procedures of creative problemsolving. Scribner: New York",
      "doi": ""
    },
    {
      "text": "Parkinson's Foundation. Non-Motor Symptoms, http://www.parkinson.org/UnderstandingParkinsons/Non-Motor-Symptoms.",
      "doi": ""
    },
    {
      "text": "Parkinson's UK. Anna's Story- Finding a Job with Parkinson's. https://www.parkinsons.org.uk/information-andsupport/annas-story-finding-job-parkinsons.",
      "doi": ""
    },
    {
      "text": "Parkinson's UK. Shamsa's Story- Diagnosed at 28, https://www.parkinsons.org.uk/information-andsupport/shamsas-story-diagnosed-28.",
      "doi": ""
    },
    {
      "text": "Parkinson's UK. Wearing off and Dyskinesia, https://www.parkinsons.org.uk/information-andsupport/wearing-and-dyskinesia.",
      "doi": ""
    },
    {
      "text": "Parkinson's UK. What Causes Parkinson's?, https://www.parkinsons.org.uk/information-andsupport/what-causes-parkinsons.",
      "doi": ""
    },
    {
      "text": "Cristian F. Pasluosta, Heiko Gassner, Juergen Winkler, Jochen Klucken, and Bjoern M. Eskofier (2015). An Emerging Era in the Management of Parkinson's disease: Wearable Technologies and the Internet of Things. IEEE Journal of Biomedical and Health Informatics. 2168--2194, DOI 10.1109/JBHI.2015.2461555.",
      "doi": ""
    },
    {
      "text": "Carlos Perez-Lopez, Albert Sama, Daniel Rodriguez-Martin, Andreu Catala, Joan Cabestany, Juan Manuel Moreno-Arostegui, Eva de Mingo, Alejandro Rodríguez-Molinero (2016). Assessing Motor Fluctuations in Parkinson's Disease Patients Based on a Single Inertial Sensor. Sensors (Basel). 6(12) 2132. DOI: 10.3390/s16122132.",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, Leah Findlater (2018). ?Accessibility Came by Accident\": Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities.In proceeding of the CHI Conference on Human Factors in Computing Systems (CHI '18). New York, NY, USA,: ACM. 13.",
      "doi": ""
    },
    {
      "text": "Marco Prenassi, Lorenzo Rossi, Sara Marceglia (2017). Assessing the feasibility of using a commercially available bracelet to detect motor symptoms for home telemonitoring in patients with Parkinson's disease. International Journal of Integrated Care. 17(5), 1--8, DOI: dx.doi.org/10.5334/ijic.3904.",
      "doi": ""
    },
    {
      "text": "Rahman, Ruhani Ab, Nur Shima Abdul Aziz, Murizah Kassim, and Mat Ikram Yusof (2017). IoT-based personal health care monitoring device for diabetic patients. In Proceedings of Computer Applications & Industrial Electronics (ISCAIE), 2017 IEEE Symposium. IEEE, 168--173.",
      "doi": ""
    },
    {
      "text": "Raji, A., P. Kanchana Devi, P. Golda Jeyaseeli, and N. Balaganesh (2016). Respiratory monitoring system for asthma patients based on IoT. In proceedings of Green Engineering and Technologies (IC-GET), 2016 Online International Conference. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Rajput, D. S., & Gour, R (2016). An IoT Framework for healthcare monitoring systems. International Journal of Computer Science and Information Security, 14(5), 451.",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R Mishra, James Fogarty, Sean A Munson, Julie A Kientz (2016). A framework for selfexperimentation in personalized health. Journal of the American Medical Informatics Association. 23(3), 440--448.",
      "doi": ""
    },
    {
      "text": "Amy Reeve, Eve Simcox, Doug Turnbull (2014). Ageing and Parkinson's disease: why is advancing age the biggest risk factor? . Ageing Research Review. 14(100), 19--30.",
      "doi": ""
    },
    {
      "text": "Seth Roberts (2004). Self-experimentation as a source of new ideas: Ten examples about sleep, mood, health, and weight. Behavioral and brain sciences. 27(2), 227--262.",
      "doi": ""
    },
    {
      "text": "Luis Sanchez-Perez, Luis Sanchez-Fernandez, Adnan Shaout, Juan M. Martinez-Hernandez, Maria J. Alvarez-Noriega (2018). Rest Tremor Quantification Based on Fuzzy Inference Systems and Wearable Sensors. International Journal of Medical Informatics. 114, 6--7. DOI: 10.1016/j.ijmedinf.2018.03.002.",
      "doi": ""
    },
    {
      "text": "Gunter Schreier (2014). The internet of things for personalized health. Studies in Health Technology and Informatic.s 200, 22--31. DOI: 0.3233/978--161499--393--3--22.",
      "doi": ""
    },
    {
      "text": "Philip Seeman (2009). Chapter 1: Historical overview: Introduction to the dopamine receptors. Neve, Kim. The Dopamine Receptors. Vols. pp. 1-- 22. Springer. ISBN 978--1--60327--333--6. vols.",
      "doi": ""
    },
    {
      "text": "Sensidose, About Sensidose, https://sensidose.se/en/.",
      "doi": ""
    },
    {
      "text": "Kemal Serdaroglu, Gamze Uslu, and Sebnem Baydere (2015). Medication intake adherence with real time activity recognition on IoT. In proceedings of Wireless and Mobile Computing, Networking and Communications (WiMob), 2015 IEEE 11th International Conference. IEEE. 230237.",
      "doi": ""
    },
    {
      "text": "Anika Smith, Kathryn Wade, Robert Alexander, Kirsty Penkman, Daniel Baker (2017). Dietary modulation of cortical excitation and inhibition. Journal of Psychopharmacology. 632--637. ISSN 1461--7285.",
      "doi": ""
    },
    {
      "text": "Melanie Swan (2009). Emerging patient-driven health care models: an examination of health social networks, consumer personalized medicine and quantified self-tracking. International journal of environmental research and public health. 6(2), 492--525.",
      "doi": ""
    },
    {
      "text": "Melanie Swan (2012a). Crowdsourced health research studies: an important emerging complement to clinical trials in the public health research ecosystem. Journal of medical Internet research. 14(2).",
      "doi": ""
    },
    {
      "text": "Melanie Swan (2012b). Health 2050: The realization of personalized medicine through crowdsourcing, the quantified self, and the participatory biocitizen. Journal of personalized medicine. 2(3), 93--118.",
      "doi": ""
    },
    {
      "text": "Pawel Swiatek, Andrzej Rucinski (2013). IoT as a service system for eHealth. In proceedings of the 2013 IEEE 15th International Conference on eHealth Networking, Applications and Services (Healthcom 2013). IEEE. DOI: 10.1109/HealthCom.2013.6720643.",
      "doi": ""
    },
    {
      "text": "Jonathan Synnott, Liming Chen, Chris. D. Nugent, George Moore (2012). WiiPD-Objective Home Assessment of Parkinson's Disease Using the Nintendo Wii Remote. IEEE Transactions on Information Technology in Biomedicine. 16(6), 1304 - 1312. DOI: 10.1109/TITB.2012.2215878.",
      "doi": "10.1109/TITB.2012.2215878"
    },
    {
      "text": "Christoph Thuemmler, and Chunxue Bai (2017). Health 4.0: Application of industry 4.0 design principles in future asthma management. Health 4.0: How Virtualization and Big Data are Revolutionizing Healthcare. Cham: Springer. 2327.",
      "doi": ""
    },
    {
      "text": "The Telegraph. Marmite may boost brain and help stave off dementia, https://www.telegraph.co.uk/news/2017/04/05/mar mite-may-boost-brain-even-help-stave-dementia/.",
      "doi": ""
    },
    {
      "text": "Helena Tendedez, Roisin McNaney, Maria Angela Ferrario, Jon Whittle (2018). Scoping the Design Space for Data Supported Decision-Making Tools in Respiratory Care : Needs, Barriers and Future Aspirations. In proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM.",
      "doi": "10.1145/3240925.3240983"
    },
    {
      "text": "Evanthia E. Tripoliti, Alexandros T. Tzallas, Markos G. Tsipouras, George Rigas, Panagiota Bougia, Michael Leontiou, Spiros Konitsiotis, Maria Chondrogiorgi, Sofia Tsouli, Dimitrios I. Fotiadis (2013). Automatic detection of freezing of gait events in patients with Parkinson's disease.\" Computer Methods and Programs in Biomedicine 1(10), 12--26. DOI: https://doi.org/10.1016/j.cmpb.2012.10.016.",
      "doi": "10.1016/j.cmpb.2012.10.016"
    },
    {
      "text": "Tumerix. What are the benefits of turmeric powder?, https://buyturmerix.com/au/benefitshealing-properties-uses-of-tumeric/.",
      "doi": ""
    },
    {
      "text": "Uduak Williams, Oliver Bandmann, and Richard Walker (2018). Parkinson's Disease in SubSaharan Africa: A Review of Epidemiology, Genetics and Access to Care. Journal of Movement Disorders. 11(2), 53--64. DOI: 10.14802/jmd.17028.",
      "doi": ""
    },
    {
      "text": "Janet M.T. van Uem, Johan Marinus, Colleen Canning, Rob van Lummel, Richard Dodel, Inga Liepelt-Scarfone, Daniela Berg, Meg E.Morris, Walter Maetzler (2015). Health-Related Quality of Life in patients with Parkinson's disease-A systematic review based on the ICF model. Neuroscience & Biobehavioral Reviews. 61, 2634, DOI: https://doi.org/10.1016/j.neubiorev.2015.11.014.",
      "doi": ""
    },
    {
      "text": "Julio Vega, Samuel Couth, Ellen Poliakoff, Sonja Kotz, Matthew Sullivan, Caroline Jay, Market Vigo, and Simon Harper (2018). Back to Analogue: Self-Reporting for Parkinson's Disease. In proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Ney York, NY, USA: ACM. 74.",
      "doi": "10.1145/3173574.3173648"
    },
    {
      "text": "Julio Vega, Caroline Jay, Markel Vigo, and Simon Harper (2017). Unobtrusive Monitoring of Parkinson's Disease Based on Digital Biomarkers of Human Behaviour. In proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS'17). New York, NY, USA: ACM. 351--352.",
      "doi": "10.1145/3132525.3134782"
    },
    {
      "text": "Xia, F., Yang, L. T., Wang, L., & Vinel, A (2012). Internet of things. International Journal of Communication Systems. 25(9), 1101.",
      "doi": "10.1002/dac.2417"
    },
    {
      "text": "Samir V. Zanjal, and Girish R. Talmale (2016). Medicine reminder and monitoring system for secure health using IOT. Procedia Computer Science. 78, 471--476.",
      "doi": "10.1016/j.procs.2016.02.090"
    },
    {
      "text": "Zhan, A, Mohan, S, Tarolli, C, Schneider, RB, Adams, JL, Sharma, S, Elson, MJ, Spear, KL, Glidden, AM, Little, MA, Terzis, A, Dorsey, ER & Saria, S (2018). Using Smartphones and Machine Learning to Quantify Parkinson Disease Severity: The Mobile Parkinson Disease Score. JAMA Neurology. DOI:10.1001/jamaneurol.2018.0809.",
      "doi": ""
    }
  ]
}