{
  "doi": "10.1145/3313831.3376798",
  "title": "Composing Flexibly-Organized Step-by-Step Tutorials from Linked Source Code, Snippets, and Outputs",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Programming tutorials are a pervasive, versatile medium for teaching programming. In this paper, we report on the content and structure of programming tutorials, the pain points authors experience in writing them, and a design for a tool to help improve this process. An interview study with 12 experienced tutorial authors found that they construct documents by interleaving code snippets with text and illustrative outputs. It also revealed that authors must often keep related artifacts of source programs, snippets, and outputs consistent as a program evolves. A content analysis of 200 frequently-referenced tutorials on the web also found that most tutorials contain related artifacts—duplicate code and outputs generated from snippets—that an author would need to keep consistent with each other. To address these needs, we designed a tool called Torii with novel authoring capabilities. An in-lab study showed that tutorial authors can successfully use the tool for the unique affordances identified, and provides guidance for designing future tools for tutorial authoring.",
  "tags": [
    "authoring",
    "consistency",
    "programming tutorials",
    "code evolution",
    "code editors",
    "literate programming"
  ],
  "authors": [
    {
      "name": "Andrew Head",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99658703835/rel-imgonly/img_13703.jpg",
      "acmid": "99658703835",
      "orcid": "0000-0002-1523-3347"
    },
    {
      "name": "Jason Jiang",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527407",
      "orcid": "missing"
    },
    {
      "name": "James Smith",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260848",
      "orcid": "missing"
    },
    {
      "name": "Marti A. Hearst",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    },
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    }
  ],
  "references": [
    {
      "text": "Abdulaziz Alaboudi and Thomas D. LaToza. An Exploratory Study of Live-Streamed Programming. In VL/HCC'19. 5--13.",
      "doi": ""
    },
    {
      "text": "Joel Brandt, Philip J. Guo, Joel Lewenstein, Mira Dontcheva, and Scott R. Klemmer. Two Studies of Opportunistic Programming: Interleaving Web Foraging, Learning, and Writing Code. In CHI'09. 1589--1598.",
      "doi": ""
    },
    {
      "text": "Raymond P.L. Buse and Westley Weimer. Synthesizing API Usage Examples. In ICSE '12. 782--792.",
      "doi": ""
    },
    {
      "text": "Charles Chen and Philip J. Guo. Improv: Teaching Programming at Scale via Live Coding. In Learning@Scale'19. 1--10.",
      "doi": ""
    },
    {
      "text": "Barthélémy Dagenais and Martin P. Robillard. Creating and Evolving Developer Documentation: Understanding the Decisions of Open Source Contributors. In FSE '10. 127--136.",
      "doi": ""
    },
    {
      "text": "Michiel de Wit, Andy Zaidman, and Arie Van Deursen. Managing Code Clones Using Dynamic Change Tracking and Resolution. In ICSM'09. 169--178.",
      "doi": ""
    },
    {
      "text": "Robert DeLine, Danyel Fisher, Badrish Chandramouli, Jonathan Goldstein, Michael Barnett, James Terwilliger, and John Wernsing. Tempe: Live Scripting for Live Data. In VL/HCC '15. 137--141.",
      "doi": ""
    },
    {
      "text": "Shiry Ginosar, Luis Fernando De Pombo, Maneesh Agrawala, and Björn Hartmann. Authoring Multi-Stage Code Examples with Editable Code Histories. In UIST '13. 485--494.",
      "doi": ""
    },
    {
      "text": "Mitchell Gordon and Philip J. Guo. Codepourri: Creating Visual Coding Tutorials Using a Volunteer Crowd of Learners. In VL/HCC '15. 13--21.",
      "doi": ""
    },
    {
      "text": "Hacker Rank Developer Skills Survey 2018. https://research.hackerrank.com/developer-skills/2018",
      "doi": ""
    },
    {
      "text": "Andrew Head, Elena L. Glassman, Björn Hartmann, and Marti A. Hearst. Interactive Extraction of Examples from Existing Code. In CHI '18. Article 85.",
      "doi": ""
    },
    {
      "text": "Daqing Hou, Patricia Jablonski, and Ferosh Jacob. CnP: Towards an Environment for the Proactive Management of Copy-and-Paste Programming. In ICPC '09. 238--242.",
      "doi": ""
    },
    {
      "text": "Javadoc Tool. https://www.oracle.com/technetwork/java/javase/documentation/index-jsp-135444.html",
      "doi": ""
    },
    {
      "text": "Kyle Kelley and Brian Granger. 2017. Jupyter Frontends: From the Classic Jupyter Notebook to JupyterLab, nteract, and Beyond. Video. In JupyterCon. https://www.youtube.com/watch?v=YKmJvHjTGAM",
      "doi": ""
    },
    {
      "text": "Ada S. Kim and Amy J. Ko. A Pedagogical Analysis of Online Coding Tutorials. In SIGCSE '17. 321--326.",
      "doi": ""
    },
    {
      "text": "Donald E. Knuth. 1984. Literate Programming. The Computer Journal 27, 2 (1984), 97--111.",
      "doi": "10.1093/comjnl/27.2.97"
    },
    {
      "text": "Klaus Krippendorff. 2012. Content Analysis: An Introduction to Its Methodology (third ed.). SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Laura MacLeod, Andreas Bergen, and Margaret-Anne Storey. 2017. Documenting and sharing software knowledge using screencasts. Empirical Software Engineering 22, 3 (2017), 1478--1507.",
      "doi": "10.1007/s10664-017-9501-9"
    },
    {
      "text": "Mark Mahoney. 2018. Storyteller: a tool for creating worked examples. Journal of Computing Sciences in Colleges 34, 1 (2018), 137--144.",
      "doi": "10.5555/3280489.3280511"
    },
    {
      "text": "Markdown Preview Enhanced. https://github.com/shd101wyy/markdown-preview-enhanced",
      "doi": ""
    },
    {
      "text": "Laura Moreno, Gabriele Bavota, Massimiliano Di Penta, Rocco Oliveto, and Andrian Marcus. How Can I Use This Method?. In ICSE '15. 880--890.",
      "doi": "10.5555/2818754.2818860"
    },
    {
      "text": "Alok Mysore and Philip J. Guo. Torta: Generating Mixed-Media GUI and Command-Line App Tutorials Using Operating-System-Wide Activity Tracing. In UIST '17. 703--714.",
      "doi": ""
    },
    {
      "text": "Seyed Mehdi Nasehi, Jonathan Sillito, Frank Maurer, and Chris Burns. What Makes a Good Code Example?: A Study of Programming Q&A in StackOverflow. In ICSM '12. 25--34.",
      "doi": ""
    },
    {
      "text": "Steve Oney, Christopher Brooks, and Paul Resnick. 2018. Creating Guided Code Explanations with chat.codes. Proceedings of the ACM on Human-Computer Interaction 2, CSCW, Article 131 (2018).",
      "doi": "10.1145/3274400"
    },
    {
      "text": "Chris Parnin, Christoph Treude, and Margaret-Anne Storey. Blogging Developer Knowledge: Motivations, Challenges, and Future Directions. In ICPC '13. 211--214.",
      "doi": ""
    },
    {
      "text": "Roman Rädle, Midas Nouwens, Kristian Antonsen, James R. Eagan, and Clemens N. Klokmose. Codestrates: Literate Computing with Webstrates. In UIST '17. 715--725.",
      "doi": ""
    },
    {
      "text": "Ray Wenderlich. https://www.raywenderlich.com",
      "doi": ""
    },
    {
      "text": "Martin P. Robillard and Robert DeLine. 2011. A field study of API learning obstacles. Empirical Software Engineering 16, 6 (2011), 703--732.",
      "doi": "10.1007/s10664-010-9150-8"
    },
    {
      "text": "Huascar Sanchez, Jim Whitehead, and Martin Schäf. Multistaging to Understand: Distilling the Essence of Java Code Examples. In ICPC '16. 1--10.",
      "doi": ""
    },
    {
      "text": "S M Sohan, Craig Anslow, and Frank Maurer. SpyREST: Automated RESTful API Documentation using an HTTP Proxy Server. In ASE '15. 271--276.",
      "doi": ""
    },
    {
      "text": "Giriprasad Sridhara, Emily Hill, Divya Muppaneni, Lori Pollock, and K. Vijay-Shanker. Towards Automatically Generating Summary Comments for Java Methods. In ASE '10. 43--52.",
      "doi": ""
    },
    {
      "text": "Siddharth Subramanian, Laura Inozemtseva, and Reid Holmes. Live API Documentation. In ICSE '14. 643--652.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki. Interactive and Collaborative Source Code Annotation. In ICSE '15, Vol. 2. 799--800.",
      "doi": ""
    },
    {
      "text": "Al Sweigart. Automate the Boring Stuff with Python: Practical Programming for Total Beginners. https://automatetheboringstuff.com/",
      "doi": ""
    },
    {
      "text": "Lisa Tagliaferri. How to Code in Python 3. https://www.digitalocean.com/community/tutorial_series/how-to-code-in-python-3",
      "doi": ""
    },
    {
      "text": "Rebecca Tiarks and Walid Maalej. How Does a Typical Tutorial for Mobile Development Look Like?. In MSR '14. 272--281.",
      "doi": ""
    },
    {
      "text": "Michael Toomim, Andrew Begel, and Susan L. Graham. Managing Duplicated Code with Linked Editing. In VL/HCC '04. 173--180.",
      "doi": ""
    },
    {
      "text": "VSCode. https://code.visualstudio.com",
      "doi": ""
    },
    {
      "text": "Robert S. Weiss. 1995. Learning from Strangers: The Art and Method of Qualitative Interview Studies. Free Press.",
      "doi": ""
    },
    {
      "text": "Wikibooks. A Beginner's Python Tutorial/Classes - Wikibooks, The Free Textbook Project. https://en.wikibooks.org/w/index.php?title=A_Beginner%27s_Python_Tutorial/Classes",
      "doi": ""
    }
  ]
}