{
  "doi": "10.1145/3313831.3376271",
  "title": "Cheat Sheets for Data Visualization Techniques",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "This paper introduces the concept of 'cheat sheets' for data visualization techniques, a set of concise graphical explanations and textual annotations inspired by infographics, data comics, and cheat sheets in other domains. Cheat sheets aim to address the increasing need for accessible material that supports a wide audience in understanding data visualization techniques, their use, their fallacies and so forth. We have carried out an iterative design process with practitioners, teachers and students of data science and visualization, resulting six types of cheat sheet (anatomy, construction, visual patterns, pitfalls, false-friends and well-known relatives) for six types of visualization, and formats for presentation. We assess these with a qualitative user study using 11 participants that demonstrates the readability and usefulness of our cheat sheets.",
  "tags": [
    "cheat sheet",
    "visualization literacy"
  ],
  "authors": [
    {
      "name": "Zezhong Wang",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260383",
      "orcid": "missing"
    },
    {
      "name": "Lovisa Sundin",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659295886",
      "orcid": "missing"
    },
    {
      "name": "Dave Murray-Rust",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436598350",
      "orcid": "0000-0001-6098-7861"
    },
    {
      "name": "Benjamin Bach",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482661013",
      "orcid": "0000-0002-9201-7744"
    }
  ],
  "references": [
    {
      "text": "2017. Cheat Sheets for AI, Neural Networks, Machine Learning, Deep Learning & Big Data. https://www.mercuryminds.com/blog/cheatsheets-ai-neural-networks-machine-learning-deeplearning-big-data/. (2017). Last access: 2019-03--11.",
      "doi": ""
    },
    {
      "text": "2019. Box and whisker plot. https://www.brainingcamp.com/lessons/box-and-whisker-plots/lesson.php. (2019). last access: 2019-03-07.",
      "doi": ""
    },
    {
      "text": "2019. Car parameters. https://stackoverflow.com/questions/19213961/parallelcoordinates-program-written-with-processing-cantshow-anything-in-mac. (2019). last access: 2019-03--12.",
      "doi": ""
    },
    {
      "text": "2019. Chartdoctor. https://github.com/ft-interactive/ chart-doctor/blob/master/visual-vocabulary/ Visual-vocabulary.pdf. (2019). last access: 2019-03-07.",
      "doi": ""
    },
    {
      "text": "2019. Data and Visualization Hazards. http:// visualizingrights.org/kit/hazards/index.html. (2019).",
      "doi": ""
    },
    {
      "text": "2019a. DataCamp. https://www.datacamp.com/community/data-science-cheatsheets. (2019).",
      "doi": ""
    },
    {
      "text": "2019b. DataVizProject. https://datavizproject.com. (2019).",
      "doi": ""
    },
    {
      "text": "2019. Fisher's irish data. https://en.wikipedia.org/wiki/File: ParCorFisherIris.png. (2019). last access: 2019-03--12.",
      "doi": ""
    },
    {
      "text": "2019. Olympics athlete ages in summer 1908. http://www.zingchart.com/gallery/chart/#!vertical-boxplot-html-tooltip. (2019). last access: 2019-03--12.",
      "doi": ""
    },
    {
      "text": "2019. oxford dictionaries. https://en.oxforddictionaries.com/definition. (2019). Last access: 2019-03--12.",
      "doi": ""
    },
    {
      "text": "2019. Parallel coordinates. https://en.wikipedia.org/wiki/Parallel_coordinates. (2019).",
      "doi": ""
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Andres Monroy-Hernandez, and Pourang Irani. 2017. Authoring data-driven videos with dataclips. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 501--510.",
      "doi": "10.1109/TVCG.2016.2598647"
    },
    {
      "text": "Benjamin Bach, Natalie Kerracher, Kyle Wm Hall, Sheelagh Carpendale, Jessie Kennedy, and Nathalie Henry Riche. 2016. Telling stories about dynamic networks with graph comics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3670--3682.",
      "doi": "10.1145/2858036.2858387"
    },
    {
      "text": "Benjamin Bach, Emmanuel Pietriga, and Jean-Daniel Fekete. 2014. Visualizing dynamic networks with matrix cubes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 877--886.",
      "doi": "10.1145/2556288.2557010"
    },
    {
      "text": "Benjamin Bach, Nathalie Henry Riche, Sheelagh Carpendale, and Hanspeter Pfister. 2017a. The emerging genre of data comics. IEEE Computer Graphics and Applications 37, 3 (2017), 6--13.",
      "doi": "10.1109/MCG.2017.33"
    },
    {
      "text": "Benjamin Bach, Nathalie Henry Riche, Christophe Hurter, Kim Marriott, and Tim Dwyer. 2017b. Towards unambiguous edge bundling: Investigating confluent drawings for network visualization. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 541--550.",
      "doi": "10.1109/TVCG.2016.2598958"
    },
    {
      "text": "Benjamin Bach, Conglei Shi, Nicolas Heulot, Tara Madhyastha, Tom Grabowski, and Pierre Dragicevic. 2016. Time curves: Folding time to visualize patterns of temporal evolution in data. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 559--568.",
      "doi": "10.1109/TVCG.2015.2467851"
    },
    {
      "text": "Benjamin Bach, Zezhong Wang, Matteo Farinella, Dave Murray-Rust, and Nathalie Henry Riche. 2018. Design patterns for data comics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 38.",
      "doi": "10.1145/3173574.3173612"
    },
    {
      "text": "Ashok R Basawapatna, Kyu Han Koh, and Alexander Repenning. 2010. Using scalable game design to teach computer science from middle school to graduate school. In Proceedings of the fifteenth annual conference on Innovation and technology in computer science education. ACM, 224--228.",
      "doi": "10.1145/1822090.1822154"
    },
    {
      "text": "Scott Bateman, Regan L Mandryk, Carl Gutwin, Aaron Genest, David McDine, and Christopher Brooks. 2010. Useful junk?: the effects of visual embellishment on comprehension and memorability of charts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2573--2582.",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "Michael Behrisch, Benjamin Bach, Nathalie Henry Riche, Tobias Schreck, and Jean-Daniel Fekete. 2016. Matrix reordering methods for table and network visualization. In Computer Graphics Forum, Vol. 35. Wiley Online Library, 693--716.",
      "doi": ""
    },
    {
      "text": "Jacques Bertin, William J Berg, and Howard Wainer. 1983. Semiology of graphics: diagrams, networks, maps. Vol. 1. University of Wisconsin press Madison.",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Katy Börner, Adam Maltese, Russell Nelson Balliet, and Joe Heimlich. 2016. Investigating aspects of data visualization literacy using 20 information visualizations and 273 science museum visitors. Information Visualization 15, 3 (2016), 198--213.",
      "doi": "10.1177/1473871615594652"
    },
    {
      "text": "Mike Bostock. 2012. Les Misérables Co-occurrence. https://bost.ocks.org/mike/miserables/. (2012). last access: 2019-03--12.",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Ronald A Rensink, Enrico Bertini, and Jean-Daniel Fekete. 2014. A principled way of assessing visualization literacy. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1963--1972.",
      "doi": ""
    },
    {
      "text": "Valerie J Bristor and Suzanne V Drake. 1994. Linking the language arts and content areas through visual technology. THE Journal (Technological Horizons In Education) 22, 2 (1994), 74.",
      "doi": ""
    },
    {
      "text": "Alberto Cairo. 2012. The Functional Art: An introduction to information graphics and visualization. New Riders.",
      "doi": ""
    },
    {
      "text": "Alberto Cairo. 2016. The truthful art: Data, charts, and maps for communication. New Riders.",
      "doi": ""
    },
    {
      "text": "David Carr. 1999. Guidelines for designing information visualization applications. In ECUE'99: 01/12/1999-03/12/1999.",
      "doi": ""
    },
    {
      "text": "Chunlei Chang, Benjamin Bach, Tim Dwyer, and Kim Marriott. 2017. Evaluating perceptually complementary views for network exploration tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1397--1407.",
      "doi": "10.1145/3025453.3026024"
    },
    {
      "text": "Thomas N Dorsel and Gary W Cundiff. 1979. The cheat-sheet: Efficient coding device or indispensable crutch? The Journal of Experimental Education 48, 1 (1979), 39--42.",
      "doi": ""
    },
    {
      "text": "Brigitte Erbe. 2007. Reducing test anxiety while increasing learning: The cheat sheet. College teaching 55, 3 (2007), 96--98.",
      "doi": ""
    },
    {
      "text": "Stephanie D. H. Evergreen and Gavin McMahon. 2019. Data visualization chart chooser cards. http://chartchoosercards.com/. (2019).",
      "doi": ""
    },
    {
      "text": "Matteo Farinella. 2018. The potential of comics in science communication. Journal of science communication 17, 1 (2018), Y01.",
      "doi": ""
    },
    {
      "text": "Stephen Few. 2012. Designing Effective Tables and Graphs. (2012).",
      "doi": ""
    },
    {
      "text": "Steve Franconeri. 2018. Which Visualization? A quick reference. http://experception.net. (2018). Last access: 2019-03--11.",
      "doi": ""
    },
    {
      "text": "Steve Haroz, Robert Kosara, and Steven L Franconeri. 2016. The connected scatterplot for presenting paired time series. IEEE Transactions on Visualization and Computer Graphics 22, 9 (2016), 2174--2186.",
      "doi": "10.1109/TVCG.2015.2502587"
    },
    {
      "text": "Conor Healy. 2019. data-to-viz.com. https://www.data-to-viz.com/. (2019).",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Nicholas Kong, and Maneesh Agrawala. 2009. Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1303--1312.",
      "doi": "10.1145/1518701.1518897"
    },
    {
      "text": "Nathalie Henry and Jean-Daniel Fekete. 2006. Matrixexplorer: a dual-representation system to explore social networks. IEEE Transactions on Visualization and Computer Graphics 12, 5 (2006), 677--684.",
      "doi": "10.1109/TVCG.2006.160"
    },
    {
      "text": "Sarada Herke. 2019. Graph Theory FAQs: 03. Isomorphism Using Adjacency Matrix. https://www.youtube.com/watch?v=UCle3Smvh1s&t=27s. (2019).",
      "doi": ""
    },
    {
      "text": "I-Han Hsiao and Claudia López. 2016. Lessons Learned from Students' Cheat Sheets: Generic Models for Designing Programming Study Guides. In 2016 IEEE 16th International Conference on Advanced Learning Technologies (ICALT). IEEE, 209--211.",
      "doi": ""
    },
    {
      "text": "Noah Iliinsky. 2019. Visualization Design Thinking for Effective Data Visualization. https://datascientistinsights.com/2012/12/ 05/design-thinking-for-effective-data-visualization/. (2019).",
      "doi": ""
    },
    {
      "text": "Gerald Everett Jones. 2011. How to lie with charts. LaPuerta Books and Media.",
      "doi": ""
    },
    {
      "text": "Jiyoon Kim, Min Suk Chung, Hae Gwon Jang, and Beom Sun Chung. 2017. The use of educational comics in learning anatomy among multiple student groups. Anatomical sciences education 10, 1 (2017), 79--86.",
      "doi": ""
    },
    {
      "text": "Andy Kirk. 2016. Data visualisation: a handbook for data driven design. Sage.",
      "doi": ""
    },
    {
      "text": "Grady Klein and Alan Dabney. 2013. The cartoon introduction to statistics. Hill and Wang, a Division of Farrar, Straus and Giroux.",
      "doi": ""
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and slants in titles of visualizations on controversial topics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 438.",
      "doi": "10.1145/3173574.3174012"
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, Ya-Hsin Hung, Heidi Lam, Youn-ah Kang, and Ji Soo Yi. 2016. How do people make sense of unfamiliar visualizations?: A grounded model of novice's information visualization sensemaking. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 499--508.",
      "doi": "10.1109/TVCG.2015.2467195"
    },
    {
      "text": "Makayla Lewis. 2018. Sketchnotes in UX Design cheat sheet. https://makaylalewis.files.wordpress.com/2018/09/uxcambridge-2018-cheat-sheet.pdf. (2018). Last access: 2019-03--11.",
      "doi": ""
    },
    {
      "text": "Matt Madden. 99. ways to tell a story: Exercises in style. New York, NY: Chamberlain Bros (99).",
      "doi": ""
    },
    {
      "text": "Adam V Maltese, Joseph A Harsh, and Dubravka Svetina. 2015. Data visualization literacy: Investigating data interpretation along the novice-expert continuum. Journal of College Science Teaching 45, 1 (2015), 84--90.",
      "doi": ""
    },
    {
      "text": "Michael C Medlock, Dennis Wixon, Mick McGee, and Dan Welsh. 2005. The rapid iterative test and evaluation method: Better products in less time. In Cost-Justifying Usability. Elsevier, 489--517.",
      "doi": ""
    },
    {
      "text": "Mark Monmonier. 2018. How to lie with maps. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Randall Munroe. 2015. Thing explainer: complicated stuff in simple words. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization analysis and design. AK Peters/CRC Press.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Katharina Rall, Margaret L Satterthwaite, Oded Nov, and Enrico Bertini. 2015. How deceptive are deceptive visualizations?: An empirical analysis of common distortion techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1469--1478.",
      "doi": "10.1145/2702123.2702608"
    },
    {
      "text": "Sandra Rendgen, Julius Wiedemann, Paolo Ciuccarelli, Richard Saul Wurman, Simon Rogers, and Nigel Holmes. 2012. Information graphics. Taschen Cologne, Germany.",
      "doi": ""
    },
    {
      "text": "Severino Ribecca. 2019. The data visualization catalogue. https://datavizcatalogue.com. (2019). last access: 2019-03-07.",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts, Chris Headleand, and Panagiotis D Ritsos. 2016. Sketching designs using the five designsheet methodology. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 419--428.",
      "doi": "10.1109/TVCG.2015.2467271"
    },
    {
      "text": "Puripant Ruchikachorn and Klaus Mueller. 2015. Learning visualizations by analogy: Promoting visual literacy through visualization morphing. IEEE Transactions on Visualization and Computer Graphics 21, 9 (2015), 1028--1044.",
      "doi": "10.1109/TVCG.2015.2413786"
    },
    {
      "text": "Milo Schield. 2004. Information literacy, statistical literacy and data literacy. In IASSIST QUARTERLY (IQ). Citeseer.",
      "doi": ""
    },
    {
      "text": "Jon Schwabish. 2016. The Graphic Continuum Flash Cards. https://policyviz.com/2016/10/31/introducinggraphic-continuum-flash-cards/. (2016).",
      "doi": ""
    },
    {
      "text": "Jon Schwabish. 2019. Core Principles of Data Visualization Cheatsheet. https://policyviz.com/product/coreprinciples-of-data-visualization-cheatsheet/. (2019).",
      "doi": ""
    },
    {
      "text": "Woollcott Smith and Larry Gonick. 2005. The cartoon guide to statistics. Collins Reference.",
      "doi": ""
    },
    {
      "text": "Yang Song and David Thuente. 2015. A quantitative case study in engineering of the efficacy of quality cheat-sheets. In 2015 IEEE Frontiers in Education Conference (FIE). IEEE, 1--7.",
      "doi": "10.1109/FIE.2015.7344082"
    },
    {
      "text": "Yoav Wachsman and others. 2002. Should cheat sheets be used as study aids in economics tests. Economics Bulletin 1, 1 (2002), 1--10.",
      "doi": ""
    },
    {
      "text": "Qianwen Wang, Zhen Li, Siwei Fu, Weiwei Cui, and Huamin Qu. 2018. Narvis: Authoring Narrative Slideshows for Introducing Data Visualization Designs. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2018), 779--788.",
      "doi": "10.1109/TVCG.2018.2865232"
    },
    {
      "text": "Zezhong Wang, Shunming Wang, Matteo Farinella, Dave Murray-Rust, Nathalie Henry Riche, and Benjamin Bach. 2019. Comparing Effectiveness and Engagement of Data Comics and Infographics. (2019).",
      "doi": ""
    },
    {
      "text": "Hadley Wickham and Lisa Stryjewski. 2011. 40 years of boxplots. Am. Statistician (2011).",
      "doi": ""
    },
    {
      "text": "Leland Wilkinson. 2012. The grammar of graphics. In Handbook of Computational Statistics. Springer, 375--414.",
      "doi": ""
    },
    {
      "text": "Leland Wilkinson, Anushka Anand, and Robert Grossman. 2005. Graph-theoretic scagnostics. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. IEEE, 157--164.",
      "doi": ""
    },
    {
      "text": "Zhenpeng Zhao, Rachael Marr, and Niklas Elmqvist. 2015. Data Comics: Sequential Art for Data-Driven Storytelling. tech. report (2015).",
      "doi": ""
    },
    {
      "text": "Zhenpeng Zhao, Rachael Marr, Jason Shaffer, and Niklas Elmqvist. 2019. Understanding Partitioning and Sequence in Data-Driven Storytelling. In International Conference on Information. Springer, 327--338.",
      "doi": ""
    }
  ]
}