{
  "doi": "10.1145/3313831.3376767",
  "title": "Reframing Disability as Competency: Unpacking Everyday Technology Practices of People with Visual Impairments",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "More than a billion people in the world live with some form of visual impairment, and a wide variety of technologies are now routinely used by them in the course of 'getting on' in everyday life. However, little is known about the ways in which assistive and non-assistive technologies are brought to bear on material practices. We present findings from a four-month ethnographic study facilitated by a local branch of a UK charity that supports people with visual impairments. Our study explores mainstream and assistive technology use within their everyday lives. We identify three main sites for technology use: social relations and communication practices, textual reading practices, and mobility practices. Via an ethnographic approach we contribute to understanding how people accomplish such practices, and in doing so, uncover the practical competencies that enable people with visual impairments to conduct their everyday activities. Thus we investigate how disability can be thought of in terms of competencies, arguing that understanding of competencies can enrich the design of technologies that fit the needs of people with visual impairments.",
  "authors": [
    {
      "name": "Gisela Reyes-Cruz",
      "institution": "University of Nottingham, Nottingham, Nottinghamshire, United Kingdom",
      "img": "/do/10.1145/contrib-99659527282/rel-imgonly/giselareyescruz_photo.jpg",
      "acmid": "99659527282",
      "orcid": "missing"
    },
    {
      "name": "Joel E. Fischer",
      "institution": "University of Nottingham, Nottingham, Nottinghamshire, United Kingdom",
      "img": "/do/10.1145/contrib-81416603014/rel-imgonly/joel.jpg",
      "acmid": "81416603014",
      "orcid": "missing"
    },
    {
      "name": "Stuart Reeves",
      "institution": "University of Nottingham, Nottingham, Nottinghamshire, United Kingdom",
      "img": "/do/10.1145/contrib-81100228688/rel-imgonly/headshot2-2016.jpg",
      "acmid": "81100228688",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M. Branham. 2018. \"Siri Talks at You\": An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '18, ACM Press, 249--258.",
      "doi": ""
    },
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Amy Hurst. 2016. An empirical investigation of the situationally-induced impairments experienced by blind mobile device users. Proceedings of the 13th Web for All Conference on - W4A '16, ACM Press, 1--8.",
      "doi": "10.1145/2899475.2899482"
    },
    {
      "text": "Mauro Avila, Katrin Wolf, Anke Brock, and Niels Henze. 2016. Remote Assistance for Blind Users in Daily Life: A Survey about Be My Eyes. Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments - PETRA '16, ACM Press, 1--2.",
      "doi": "10.1145/2910674.2935839"
    },
    {
      "text": "Shiri Azenkot and Nicole B. Lee. 2013. Exploring the use of speech input by blind people on mobile devices. Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '13, ACM Press, 1--8.",
      "doi": ""
    },
    {
      "text": "Rachel Bartlett, Yi Xuan Khoo, Juan Pablo Hourcade, and Kyle K. Rector. 2019. Exploring the Opportunities for Technologies to Enhance Quality of Life with People who have Experienced Vision Loss. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, 1--8.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '18, ACM Press, 161--173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Cynthia L. Bennett, Burren Peil, and Daniela K. Rosner. 2019. Biographical Prototypes: Reimagining Recognition and Disability in Design. Proceedings of the 2019 on Designing Interactive Systems Conference - DIS '19, ACM Press, 35--47.",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Alexy Bhowmick and Shyamanta M. Hazarika. 2017. An insight into assistive technology for the visually impaired and blind people: state-of-the-art and future trends. Journal on Multimodal User Interfaces 11, 2: 149--172.",
      "doi": ""
    },
    {
      "text": "Danielle Bragg, Cynthia Bennett, Katharina Reinecke, and Richard Ladner. 2018. A Large Inclusive Study of Human Listening Rates. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, 1--12.",
      "doi": "10.1145/3173574.3174018"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility: How Blind and Sighted Companions Co-Create Accessible Home Spaces. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, 2373--2382.",
      "doi": ""
    },
    {
      "text": "Michele A. Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P. Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility, 135--142.",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Andrew Crabtree, Mark Rouncefield, and Peter Tolmie. 2012. Doing design ethnography. Springer.",
      "doi": ""
    },
    {
      "text": "Michael D. Crossland, Rui S. Silva, and Antonio F. Macedo. 2014. Smartphone, tablet computer and e-reader use by people with vision impairment. Ophthalmic and Physiological Optics 34, 5: 552--557.",
      "doi": ""
    },
    {
      "text": "Rafael Jeferson Pezzuto Damaceno, Juliana Cristina Braga, and Jesús Pascual Mena-Chalco. 2018. Mobile device accessibility for the visually impaired: problems mapping and recommendations. Universal Access in the Information Society 17, 2: 421--435.",
      "doi": "10.1007/s10209-017-0540-1"
    },
    {
      "text": "Guy Dewsbury, Karen Clarke, Dave Randall, Mark Rouncefield, and Ian Sommerville. 2004. The anti-social model of disability. Disability & Society 19, 2: 145--158.",
      "doi": ""
    },
    {
      "text": "Brian L Due and Simon Bierring Lange. 2018. Troublesome Objects: Unpacking Ocular-Centrism in Urban Environments by Studying Blind Navigation Using Video Ethnography and Ethnomethodology. Sociological Research Online: 136078041881196.",
      "doi": ""
    },
    {
      "text": "Brian Due and Simon Lange. 2018. Semiotic resources for navigation: A video ethnographic study of blind people's uses of the white cane and a guide dog for navigating in urban areas. Semiotica 2018, 222: 287--312.",
      "doi": ""
    },
    {
      "text": "Silvia B. Fajardo-Flores, Laura S. Gaytán-Lugo, Pedro C. Santana-Mancilla, and Miguel A. Rodríguez-Ortiz. 2017. Mobile Accessibility for People with Combined Visual and Motor Impairment: A case Study. Proceedings of the 8th Latin American Conference on Human-Computer Interaction - CLIHC '17, ACM Press, 1--4.",
      "doi": ""
    },
    {
      "text": "Heather A. Faucett, Kate E. Ringland, Amanda L. L. Cullen, and Gillian R. Hayes. 2017. (In)Visibility in Disability and Assistive Technology. ACM Transactions on Accessible Computing 10, 4: 1--17.",
      "doi": "10.1145/3132040"
    },
    {
      "text": "Christopher Frauenberger. 2015. Disability and Technology: A Critical Realist Perspective. Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility - ASSETS '15, ACM Press, 89--96.",
      "doi": "10.1145/2700648.2809851"
    },
    {
      "text": "Harold Garfinkel. 1967. Studies in ethnomethodology. Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel and Anne Warfield Rawls. 2002. Ethnomethodology's program: working out Durkeim's aphorism. Rowman & Littlefield Publishers, Lanham, Md.",
      "doi": ""
    },
    {
      "text": "Rosemarie Garland-Thomson. 2005. Feminist Disability Studies. Signs: Journal of Women in Culture and Society 30, 2: 1557--1587.",
      "doi": ""
    },
    {
      "text": "João Guerreiro, Dragan Ahmetovic, Daisuke Sato, Kris Kitani, and Chieko Asakawa. 2019. Airport Accessibility and Navigation Assistance for People with Visual Impairments. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, 1--14.",
      "doi": "10.1145/3290605.3300246"
    },
    {
      "text": "João Guerreiro and Daniel Gonçalves. 2014. Text-to-speeches: evaluating the perception of concurrent speech by blind people. Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility - ASSETS '14, ACM Press, 169--176.",
      "doi": "10.1145/2661334.2661367"
    },
    {
      "text": "Tiago Guerreiro, Joaquim Jorge, and Daniel Gonçalves. 2010. Identifying the relevant individual attributes for a successful non-visual mobile experience. Proceedings of the 28th Annual European Conference on Cognitive Ergonomics - ECCE '10, ACM Press, 27.",
      "doi": "10.1145/1962300.1962309"
    },
    {
      "text": "Alison Kafer. 2013. Feminist, queer, crip. Indiana University Press, Bloomington, Indiana.",
      "doi": ""
    },
    {
      "text": "Vaishnav Kameswaran, Jatin Gupta, Joyojeet Pal, et al. 2018. \"We can go anywhere\": Understanding Independence through a Case Study of Ride-hailing Use by People with Visual Impairments in metropolitan India. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 1--24.",
      "doi": "10.1145/3274354"
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide rule: making mobile touch screens accessible to blind people using multi-touch interaction techniques. Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility - Assets '08, ACM Press, 73.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. Proceeding of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS '09, ACM Press, 115.",
      "doi": ""
    },
    {
      "text": "Dirk vom Lehn. 2010. Discovering 'Experience-ables': Socially including visually impaired people in art museums. Journal of Marketing Management 26, 7--8: 749--769.",
      "doi": ""
    },
    {
      "text": "Barbara Leporini, Maria Claudia Buzzi, and Marina Buzzi. 2012. Interacting with mobile devices via VoiceOver: usability and accessibility issues. Proceedings of the 24th Australian Computer-Human Interaction Conference, 339--348.",
      "doi": "10.1145/2414536.2414591"
    },
    {
      "text": "Julie Miller, Samantha Brady, Chaiwoo Lee, et al. 2018. How The \"Oldest Old\" Experience and Adapt to Vision and Hearing Loss Through the Use of Assistive Technologies. Proceedings of the Technology, Mind, and Society on ZZZ - TechMindSociety '18, ACM Press, 1--5.",
      "doi": "10.1145/3183654.3183688"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With most of it being pictures now, I rarely use it\": Understanding Twitter's Evolving Accessibility to Blind Users. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 5506--5516.",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "A. F. Newell and P. Gregor. 1999. Extra-Ordinary Human-Machine Interaction: What can be Learned from People with Disabilities? Cognition, Technology & Work 1, 2: 78--85.",
      "doi": ""
    },
    {
      "text": "João Oliveira, Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2011. Blind people and mobile touch-based text-entry: acknowledging the need for different flavors. The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, 179--186.",
      "doi": "10.1145/2049536.2049569"
    },
    {
      "text": "Mike Oliver. 2013. The social model of disability: thirty years on. Disability & Society 28, 7: 1024--1026.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2011. World report on disability 2011. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Anandhi Viswanathan, Priyank Chandra, et al. 2017. Agency in Assistive Technology Adoption: Visual Impairment and Smartphone Use in Bangalore. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 5929--5940.",
      "doi": "10.1145/3025453.3025895"
    },
    {
      "text": "Umesh Persad, Patrick Langdon, and John Clarkson. 2007. Characterising user capabilities to support inclusive design evaluation. Universal Access in the Information Society 6, 2: 119--135.",
      "doi": "10.1007/s10209-007-0083-y"
    },
    {
      "text": "Leah Lakshmi Piepzna-Samarasinha. 2018. Care work: Dreaming disability justice. arsenal pulp press.",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. \"Accessibility Came by Accident\": Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, 1--13.",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "David Randall, Richard Harper, and Mark Rouncefield. 2007. Fieldwork for design: theory and practice. Springer Science & Business Media.",
      "doi": "10.5555/1296077"
    },
    {
      "text": "André Rodrigues, Kyle Montague, Hugo Nicolau, and Tiago Guerreiro. 2015. Getting Smartphones to Talkback: Understanding the Smartphone Adoption Process of Blind Users. Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility - ASSETS '15, ACM Press, 23--32.",
      "doi": "10.1145/2700648.2809842"
    },
    {
      "text": "Jaime Sánchez and Héctor Flores. 2003. Memory enhancement through audio. Proceedings of the 6th international ACM SIGACCESS conference on Computers and accessibility, 24--31.",
      "doi": "10.1145/1029014.1028636"
    },
    {
      "text": "Zhanna Sarsenbayeva, Vassilis Kostakos, and Jorge Goncalves. 2019. Situationally-Induced Impairments and Disabilities Research. arXiv preprint arXiv:1904.06128.",
      "doi": ""
    },
    {
      "text": "Sami Schalk. 2018. Bodyminds Reimagined:(Dis) ability, Race, and Gender in Black Women's Speculative Fiction. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Josh Tenenberg. 2007. Observing Sara: a case study of a blind person's interactions with technology. Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility - Assets '07, ACM Press, 171.",
      "doi": "10.1145/1296843.1296873"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, 705.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2016. Self-Conscious or Self-Confident? A Diary Study Conceptualizing the Social Accessibility of Assistive Technology. ACM Transactions on Accessible Computing 8, 2: 1--31.",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Berglind F. Smaradottir, Jarle A. Håland, and Santiago G. Martinez. 2018. User Evaluation of the Smartphone Screen Reader VoiceOver with Visually Disabled Participants. Mobile Information Systems 2018: 1--9.",
      "doi": ""
    },
    {
      "text": "Ji-Won Song and Sung-Ho Yang. 2010. Touch your way: haptic sight for visually impaired people to walk with independence. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA '10, ACM Press, 3343.",
      "doi": "10.1145/1753846.1753982"
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16, ACM Press, 171--180.",
      "doi": ""
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: a study of daily challenges of low vision people. Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '16, ACM Press, 61--72.",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Anja Thieme, Cynthia L. Bennett, Cecily Morrison, Edward Cutrell, and Alex S. Taylor. 2018. ?I can do everything but see!\" -- How People with Vision Impairments Negotiate their Abilities in Social Contexts. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, 1--14.",
      "doi": ""
    },
    {
      "text": "Shannon M. Tomlinson. 2016. Perceptions of accessibility and usability by blind or visually impaired persons: A pilot study: Perceptions of Accessibility and Usability by Blind or Visually Impaired Persons: A Pilot Study. Proceedings of the Association for Information Science and Technology 53, 1: 1--4.",
      "doi": ""
    },
    {
      "text": "Shari Trewin, John Richards, Rachel Bellamy, et al. 2010. Toward modeling auditory information seeking strategies on the web. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA '10, ACM Press, 3973.",
      "doi": "10.1145/1753846.1754088"
    },
    {
      "text": "Marynel Vázquez and Aaron Steinfeld. 2012. Helping visually impaired users properly aim a camera. Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '12, ACM Press, 95.",
      "doi": "10.1145/2384916.2384934"
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW '16, ACM Press, 1582--1593.",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Herman Wahidin, Jenny Waycott, and Steven Baker. 2018. The challenges in adopting assistive technologies in the workplace for people with visual impairments. Proceedings of the 30th Australian Conference on Computer-Human Interaction - OzCHI '18, ACM Press, 432--442.",
      "doi": "10.1145/3292147.3292175"
    },
    {
      "text": "Susan Wendell. 2013. The Rejected Body: Feminist Philosophical Reflections on Disability. Routledge.",
      "doi": ""
    },
    {
      "text": "Brian Wentz and Jonathan Lazar. 2011. Usability evaluation of email applications by blind users. Journal of Usability Studies 6, 2: 75--89.",
      "doi": "10.5555/2010380.2010384"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Transactions on Accessible Computing 3, 3: 1--27.",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Hanlu Ye, Meethu Malu, Uran Oh, and Leah Findlater. 2014. Current and future mobile and wearable device use by people with visual impairments. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, 3123--3132.",
      "doi": "10.1145/2556288.2557085"
    },
    {
      "text": "Yuhang Zhao, Elizabeth Kupferstein, Doron Tal, and Shiri Azenkot. 2018. \"It Looks Beautiful but Scary\": How Low Vision People Navigate Stairs and Other Surface Level Changes. Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '18, ACM Press, 307--320.",
      "doi": "10.1145/3234695.3236359"
    },
    {
      "text": "Annuska Zolyomi, Anushree Shukla, and Jaime Snyder. 2017. Technology-Mediated Sight: A Case Study of Early Adopters of a Low Vision Assistive Technology. Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '17, ACM Press, 220--229.",
      "doi": "10.1145/3132525.3132552"
    }
  ]
}