{
  "doi": "10.1145/3313831.3376149",
  "title": "Computing Students' Learning Difficulties in HCI Education",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Software developers often make interface design decisions and work with designers. Therefore, computing students who seek to become developers need some education about interface design. While prior work has studied difficulties that educators face when teaching design to computing students, there is comparatively little work on the difficulties computing students face when learning HCI design skills. To uncover these difficulties, we conducted two qualitative studies consisting of surveys and interviews with (1) computing students and (2) educators who teach interface design to computing students. Qualitative analysis of their responses revealed 18 types of learning difficulties students might experience in HCI design education, including difficulties around the mechanics of design work, project management skills, the wicked nature of design problems, and distorted perspectives on design.",
  "tags": [
    "learning difficulties",
    "hci education",
    "pedagogical content knowledge",
    "interface design education"
  ],
  "authors": [
    {
      "name": "Alannah Oleson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659020818/rel-imgonly/avi_new_sq.jpg",
      "acmid": "99659020818",
      "orcid": "missing"
    },
    {
      "name": "Meron Solomon",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526574",
      "orcid": "missing"
    },
    {
      "name": "Amy J. Ko",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2018. CS Discoveries Curriculum Guide 2018 - 2019. (2018). https://curriculum.code.org/csd-18/",
      "doi": ""
    },
    {
      "text": "LUniversity of Chinese Academy of Sciences F. Abreu, Glivia A.R. Barbosa, Ismael S. Silva, and Natalia S. Santos. 2016. Characterizing Software Requirements Elicitation Processes: A Systematic Literature Review. In Proceedings of the XII Brazilian Symposium on Information Systems: Information Systems in the Cloud Computing Era - Volume 1 (SBSI 2016). Brazilian Computer Society, Porto Alegre, Brazil, Brazil, 26:192--26:199. http://dl.acm.org/citation.cfm?id=3021955.3021988",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2010. Self-efficacy. The Corsini encyclopedia of psychology (2010), 1--3.",
      "doi": ""
    },
    {
      "text": "R. J. Barnes, D. C. Gause, and E. C. Way. 2008. Teaching the Unknown and the Unknowable in Requirements Engineering Education. In 2008 Requirements Engineering Education and Training. 30--37. DOI: http://dx.doi.org/10.1109/REET.2008.6",
      "doi": ""
    },
    {
      "text": "Engin Bozdag. 2013. Bias in Algorithmic Filtering and Personalization. Ethics and information technology 15, 3 (2013), 209--227. DOI: http://dx.doi.org/10.1007/s10676-013--9321--6",
      "doi": ""
    },
    {
      "text": "Ofra Brandes and Michal Armoni. 2019. Using Action Research to Distill Research-Based Segments of Pedagogical Content Knowledge of K-12 Computer Science Teachers. In Proceedings of the 2019 ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE '19). ACM, NY, NY, USA, 485--491. DOI: http://dx.doi.org/10.1145/3304221.3319773 event-place: Aberdeen, Scotland Uk.",
      "doi": "10.1145/3304221.3319773"
    },
    {
      "text": "Carol B. Brandt, Katherine Cennamo, Sarah Douglas, Mitzi Vernon, Margarita McGrath, and Yolanda Reimer. 2013. A Theoretical Framework for the Studio as a Learning Environment. International Journal of Technology and Design Education 23, 2 (2013), 329--348.",
      "doi": ""
    },
    {
      "text": "John D. Bransford, Ann L. Brown, Rodney R. Cocking, and others. 2000. How People Learn. Vol. 11. Washington, DC: National academy press.",
      "doi": ""
    },
    {
      "text": "Robin Braun, Wayne Brookes, Roger Hadgraft, and Zenon Chaczko. 2019. Assessment Design for Studio-Based Learning. In Proceedings of the Twenty-First Australasian Computing Education Conference (ACE '19). ACM, NY, NY, USA, 106--111. DOI: http://dx.doi.org/10.1145/3286960.3286973",
      "doi": "10.1145/3286960.3286973"
    },
    {
      "text": "Samantha Breslin and Bimlesh Wadhwa. 2014. Exploring Nuanced Gender Perspectives Within the HCI Community. In Proceedings of the India HCI 2014 Conference on Human Computer Interaction (IndiaHCI '14). ACM, NY, NY, USA, 45:45--45:54. DOI: http://dx.doi.org/10.1145/2676702.2676709",
      "doi": ""
    },
    {
      "text": "Samantha Breslin and Bimlesh Wadhwa. 2015. Towards a Gender HCI Curriculum. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 1091--1096. DOI: http://dx.doi.org/10.1145/2702613.2732923",
      "doi": "10.1145/2702613.2732923"
    },
    {
      "text": "Tim Brown and others. 2008. Design thinking. Harvard Business Review 86, 6 (2008), 84.",
      "doi": ""
    },
    {
      "text": "Margaret Burnett, Anicia Peters, Charles Hill, and Noha Elarief. 2016. Finding Gender-Inclusiveness Software Issues with GenderMag: A Field Investigation. In Proceedings of the 2016 CHI conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2586--2598. DOI: http://dx.doi.org/10.1145/2858036.2858274",
      "doi": "10.1145/2858036.2858274"
    },
    {
      "text": "Parmit K. Chilana, Rishabh Singh, and Philip J. Guo. 2016. Understanding Conversational Programmers: A Perspective from the Software Industry. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM Press, Santa Clara, California, USA, 1462--1472. DOI: http://dx.doi.org/10.1145/2858036.2858323",
      "doi": ""
    },
    {
      "text": "Elizabeth F. Churchill, Anne Bowser, and Jennifer Preece. 2013. Teaching and Learning Human-computer Interaction: Past, Present, and Future. interactions 20, 2 (March 2013), 44--53. DOI: http://dx.doi.org/10.1145/2427076.2427086",
      "doi": "10.1145/2427076.2427086"
    },
    {
      "text": "Alma Leora Culén. 2015. HCI Education: Innovation, Creativity and Design Thinking. International Conferences on Advances in Computer-Human Interactions (2015), 125--130. https://www.duo.uio.no/handle/10852/46215",
      "doi": ""
    },
    {
      "text": "Alistair D. N. Edwards, Peter Wright, and Helen Petrie. 2006. HCI Education: We are Failing - Why?. In In Proceedings of HCI Educators Workshop 2006. 23--24.",
      "doi": ""
    },
    {
      "text": "Anthony Faiola. 2007. The Design Enterprise: Rethinking the HCI Education Paradigm. Design Issues 23, 3 (2007), 30--45. DOI: http://dx.doi.org/https://doi.org/10.1162/desi.2007.23.3.30",
      "doi": ""
    },
    {
      "text": "Julie Gess-Newsome. 1999. Pedagogical Content Knowledge: An Introduction and Orientation. In Examining Pedagogical Content Knowledge: The Construct and its Implications for Science Education, Julie Gess-Newsome and Norman G. Lederman (Eds.). Springer Netherlands, Dordrecht, 3--17. DOI: http://dx.doi.org/10.1007/0--306--47217--1_1",
      "doi": ""
    },
    {
      "text": "Guiseppe Getto and Fred Beecher. 2016. Toward a Model of UX Education: Training UX Designers within the Academy. IEEE Transactions on Professional Communication 59, 2 (2016), 153--164. DOI: http://dx.doi.org/10.1109/TPC.2016.2561139",
      "doi": ""
    },
    {
      "text": "Susannah Go and Brian Dorn. 2016. Thanks for Sharing: CS Pedagogical Content Knowledge Sharing in Online Environments. In Proceedings of the 11th Workshop in Primary and Secondary Computing Education on ZZZ WiPSCE '16. ACM Press, Münster, Germany, 27--36. DOI: http://dx.doi.org/10.1145/2978249.2978253",
      "doi": "10.1145/2978249.2978253"
    },
    {
      "text": "J. A. Goguen and C. Linde. 1993. Techniques for Requirements Elicitation. In [1993] Proceedings of the IEEE International Symposium on Requirements Engineering. 152--164. DOI: http://dx.doi.org/10.1109/ISRE.1993.324822",
      "doi": ""
    },
    {
      "text": "Gabriela Goldschmidt and Anat Litan Sever. 2011. Inspiring Design Ideas with Texts. Design Studies 32, 2 (March 2011), 139--155. DOI: http://dx.doi.org/10.1016/j.destud.2010.09.006",
      "doi": ""
    },
    {
      "text": "Joanna Goode and Gail Chapman. 2011. Exploring Computer Science. Technical Report. Computer Science Equity Alliance. 296 pages. http://www.exploringcs.org/wp-content/uploads/ 2010/08/ExploringComputerScience-v4.0.pdf",
      "doi": ""
    },
    {
      "text": "Sukeshini Grandhi. 2015. Educating Ourselves on HCI Education. interactions 22, 6 (Oct. 2015), 69--71. DOI: http://dx.doi.org/10.1145/2834811",
      "doi": ""
    },
    {
      "text": "Colin M. Gray. 2014. Evolution of Design Competence in UX Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1645--1654. DOI: http://dx.doi.org/10.1145/2556288.2557264",
      "doi": "10.1145/2556288.2557264"
    },
    {
      "text": "Colin M. Gray, Austin L. Toombs, and Shad Gross. 2015. Flow of Competence in UX Design Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3285--3294. DOI: http://dx.doi.org/10.1145/2702123.2702579",
      "doi": "10.1145/2702123.2702579"
    },
    {
      "text": "Tom Gross. 2014. Human-Computer Interaction Education and Diversity. In Human-Computer Interaction. Theories, Methods, and Tools (Lecture Notes in Computer Science), Masaaki Kurosu (Ed.). Springer International Publishing, 187--198.",
      "doi": ""
    },
    {
      "text": "Jan H. van Driel, Nico Verloop, and Wobbe de Vos. 1998. Developing Science Teachers' Pedagogical Content Knowledge. Journal of Research in Science Teaching - J RES SCI TEACH 35 (1998), 673--695. DOI: http://dx.doi.org/https://doi.org/10.1002/(SICI)1098--2736(199808)35: 6673::AID-TEA5&gt;3.0.CO;2-J",
      "doi": ""
    },
    {
      "text": "Rich Halstead-Nussloch and Han Reichgelt. 2013. Teaching HCI in a \"Crowded\" Computing Curriculum. J. Comput. Sci. Coll. 29, 2 (Dec. 2013), 184--190. http://dl.acm.org/citation.cfm?id=2535418.2535447",
      "doi": "10.5555/2535418.2535447"
    },
    {
      "text": "David Hammer and Leema K. Berland. 2014. Confusing Claims for Data: A Critique of Common Practices for Presenting Qualitative Research on Learning. Journal of the Learning Sciences 23, 1 (2014), 37--46.",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Deborah Tatar. 2011. On Methods. Interactions 18, 2 (March 2011), 10--11. DOI: http://dx.doi.org/10.1145/1925820.1925823",
      "doi": "10.1145/1925820.1925823"
    },
    {
      "text": "Chenglie Hu. 2016. Can Students Design Software?: The Answer Is More Complex Than You Think. In Proceedings of the 47th ACM Technical Symposium on Computing Science Education (SIGCSE '16). ACM, NY, NY, USA, 199--204. DOI: http://dx.doi.org/10.1145/2839509.2844563",
      "doi": "10.1145/2839509.2844563"
    },
    {
      "text": "Peter Hubwieser, Marc Berges, Johannes Magenheim, Niclas Schaper, Kathrin Bröker, Melanie Margaritis, Sigrid Schubert, and Laura Ohrndorf. 2013a. Pedagogical Content Knowledge for Computer Science in German Teacher Education Curricula. In Proceedings of the 8th Workshop in Primary and Secondary Computing Education (WiPSE '13). ACM, NY, NY, USA, 95--103. DOI: http://dx.doi.org/10.1145/2532748.2532753 event-place: Aarhus, Denmark.",
      "doi": "10.1145/2532748.2532753"
    },
    {
      "text": "Peter Hubwieser, Johannes Magenheim, Andreas Mühling, and Alexander Ruf. 2013b. Towards a Conceptualization of Pedagogical Content Knowledge for Computer Science. In Proceedings of the ninth annual international ACM conference on international computing education research (ICER '13). ACM, NY, NY, USA, 1--8. DOI: http://dx.doi.org/10.1145/2493394.2493395",
      "doi": "10.1145/2493394.2493395"
    },
    {
      "text": "C. D. Hundhausen, D. Fairbrother, and M. Petre. 2012. An Empirical Study of the \"Prototype Walkthrough\": A Studio-Based Activity for HCI Education. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4 (Dec. 2012), 26:1--26:36. DOI: http://dx.doi.org/10.1145/2395131.2395133",
      "doi": "10.1145/2395131.2395133"
    },
    {
      "text": "N. H. Ibrahim, J. Surif, A. H. Abdullah, and N. A. S. Sabtu. 2014. Comparison of Pedagogical Content Knowledge between Expert and Novice Lecturers in Teaching and Learning Process. In 2014 International Conference on Teaching and Learning in Computing and Engineering. 240--246. DOI: http://dx.doi.org/10.1109/LaTiCE.2014.53",
      "doi": "10.1109/LaTiCE.2014.53"
    },
    {
      "text": "David G. Jansson and Steven M. Smith. 1991. Design Fixation. Design Studies 12, 1 (1991), 3--11.",
      "doi": ""
    },
    {
      "text": "Yvonne Kao, Katie D'Silva, Aleata Hubbard, Joseph Green, and Kimkinyona Cully. 2018. Applying the Mathematical Work of Teaching Framework to Develop a Computer Science Pedagogical Content Knowledge Assessment. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education (SIGCSE '18). ACM, NY, NY, USA, 888--893. DOI: http://dx.doi.org/10.1145/3159450.3159521",
      "doi": "10.1145/3159450.3159521"
    },
    {
      "text": "Cazembe Kennedy and Eileen T. Kraemer. 2018. What Are They Thinking?: Eliciting Student Reasoning About Troublesome Concepts in Introductory Computer Science. In Proceedings of the 18th Koli Calling International Conference on Computing Education Research (Koli Calling '18). ACM, NY, NY, USA, 7:1--7:10. DOI: http://dx.doi.org/10.1145/3279720.3279728",
      "doi": ""
    },
    {
      "text": "Amy J. Ko. 2017. A Three-Year Participant Observation of Software Startup Software Evolution. In Proceedings of the 39th International Conference on Software Engineering: Software Engineering in Practice Track. IEEE Press, 3--12. DOI: http://dx.doi.org/10.1109/ICSE-SEIP.2017.29",
      "doi": "10.1109/ICSE-SEIP.2017.29"
    },
    {
      "text": "Amy J Ko and Parmit K Chilana. 2011. Design, Discussion, and Dissent in Open Bug Reports. In Proceedings of the 2011 iConference. ACM, 106--113. DOI: http://dx.doi.org/10.1145/1940761.1940776",
      "doi": "10.1145/1940761.1940776"
    },
    {
      "text": "Amy J. Ko and Richard E. Ladner. 2016. AccessComputing Promotes Teaching Accessibility. ACM Inroads 7, 4 (2016), 65--68. DOI: http://dx.doi.org/10.1145/2968453",
      "doi": "10.1145/2968453"
    },
    {
      "text": "Aubrey Lawson, Eileen T. Kraemer, S. Megan Che, and Cazembe Kennedy. 2019. A Multi-Level Study of Undergraduate Computer Science Reasoning About Concurrency. In Proceedings of the 2019 ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE '19). ACM, NY, NY, USA, 210--216. DOI: http://dx.doi.org/10.1145/3304221.3319763 event-place: Aberdeen, Scotland Uk.",
      "doi": "10.1145/3304221.3319763"
    },
    {
      "text": "Sarah Lewthwaite and David Sloan. 2016. Exploring Pedagogical Culture for Accessibility Education in Computing Science. In Proceedings of the 13th Web for All Conference (W4A '16). ACM, NY, NY, USA, 3:1--3:4. DOI: http://dx.doi.org/10.1145/2899475.2899490",
      "doi": ""
    },
    {
      "text": "Paul Luo Li, Amy J Ko, and Andrew Begel. 2017. Cross-Disciplinary Perspectives on Collaborations with Software Engineers. In Cooperative and Human Aspects of Software Engineering (CHASE), 2017 IEEE/ACM 10th International Workshop on. IEEE, 2--8. DOI: http://dx.doi.org/10.1109/CHASE.2017.3",
      "doi": "10.1109/CHASE.2017.3"
    },
    {
      "text": "Neomi Liberman, Yifat Ben-David Kolikant, and Catriel Beeri. 2009. In-service Teachers Learning of a New Paradigm: A Case Study. In Proceedings of the Fifth International Workshop on Computing Education Research Workshop (ICER '09). ACM, NY, NY, USA, 43--50. DOI: http://dx.doi.org/10.1145/1584322.1584329",
      "doi": "10.1145/1584322.1584329"
    },
    {
      "text": "D. Scott McCrickard, C. M. Chewar, and Jacob Somervell. 2004. Design, Science, and Engineering Topics?: Teaching HCI with a Unified Method. In Proceedings of the 35th SIGCSE technical symposium on computer science education (SIGCSE '04). ACM, NY, NY, USA, 31--35. DOI: http://dx.doi.org/10.1145/971300.971314",
      "doi": "10.1145/971300.971314"
    },
    {
      "text": "Tom McKlin, Taneisha Lee, Dana Wanzer, Brian Magerko, Doug Edwards, Sabrina Grossman, Emily Bryans, and Jason Freeman. 2019. Accounting for Pedagogical Content Knowledge in a Theory of Change Analysis. In Proceedings of the 2019 ACM Conference on International Computing Education Research (ICER '19). ACM, NY, NY, USA, 157--165. DOI: http://dx.doi.org/10.1145/3291279.3339412",
      "doi": "10.1145/3291279.3339412"
    },
    {
      "text": "Punyashloke Mishra and Matthew J. Koehler. 2006. Technological Pedagogical Content Knowledge: A Framework for Teacher Knowledge. DOI: http://dx.doi.org/10.1111/j.1467--9620.2006.00684.x",
      "doi": ""
    },
    {
      "text": "Eduardo Navas, Owen Gallagher, and Borrough, xtine. 2014. The Routledge companion to Remix studies. Routledge.",
      "doi": ""
    },
    {
      "text": "Laura Ohrndorf and Sigrid Schubert. 2013. Measurement of Pedagogical Content Knowledge: Students' Knowledge and Conceptions. In Proceedings of the 8th Workshop in Primary and Secondary Computing Education (WiPSE '13). ACM, NY, NY, USA, 104--107. DOI: http://dx.doi.org/10.1145/2532748.2532758",
      "doi": "10.1145/2532748.2532758"
    },
    {
      "text": "Alannah Oleson, Christopher Mendez, Zoe Steine-Hanson, Claudia Hilderbrand, Christopher Perdriau, Margaret Burnett, and Amy J. Ko. 2018. Pedagogical Content Knowledge for Teaching Inclusive Design. In Proceedings of the 2018 ACM Conference on International Computing Education Research (ICER '18). ACM, NY, NY, USA, 69--77. DOI: http://dx.doi.org/10.1145/3230977.3230998",
      "doi": ""
    },
    {
      "text": "Hye Park and Seda McKilligan. 2018. A Systematic Literature Review for Human-Computer Interaction and Design Thinking Process Integration. In Design, User Experience, and Usability: Theory and Practice (Lecture Notes in Computer Science), Aaron Marcus and Wentao Wang (Eds.). Springer International Publishing, 725--740.",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative Research & Evaluation Methods: Integrating Theory and Practice. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Marian Petre and Andre Van Der Hoek. 2013. Software Designers in Action: A Human-Centric Look at Design Work (1st ed.). Chapman & Hall/CRC.",
      "doi": ""
    },
    {
      "text": "Henry Petroski. 2006. Success Through Failure: The Paradox of Design. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Peter Pirolli and Stuart Card. 1995. Information Foraging in Information Access Environments. In Chi, Vol. 95. 51--58.",
      "doi": ""
    },
    {
      "text": "Chris Proctor, Maxwell Bigman, and Paulo Blikstein. 2019. Defining and Designing Computer Science Education in a K12 Public School District. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education (SIGCSE '19). ACM, NY, NY, USA, 314--320. DOI: http://dx.doi.org/10.1145/3287324.3287440",
      "doi": "10.1145/3287324.3287440"
    },
    {
      "text": "Yolanda Jacobs Reimer and Sarah A. Douglas. 2003. Teaching HCI Design with the Studio Approach. Computer Science Education 13, 3 (2003), 191--205.",
      "doi": ""
    },
    {
      "text": "Horst W J Rittel. 1987. The Reasoning of Designers. (1987), 12.",
      "doi": ""
    },
    {
      "text": "Luciana Salgado, Roberto Pereira, and Isabela Gasparini. 2015. Cultural Issues in HCI: Challenges and Opportunities. In Human-Computer Interaction: Design and Evaluation (Lecture Notes in Computer Science), Masaaki Kurosu (Ed.). Springer International Publishing, 60--70.",
      "doi": ""
    },
    {
      "text": "Lee Shulman. 1987. Knowledge and Teaching: Foundations of the New Reform. Harvard Educational Review 57, 1 (1987), 1--23. DOI: http://dx.doi.org/https://doi.org/10.17763/haer.57.1.j463w79r56455411",
      "doi": ""
    },
    {
      "text": "Martin A. Siegel and Erik Stolterman. 2008. Metamorphosis: Transforming Non-Designers into Designers, Vol. 378. Sheffield, UK: Sheffield Hallam University, 1--13.",
      "doi": ""
    },
    {
      "text": "Charles Thevathayan and Margaret Hamilton. 2017. Imparting Software Engineering Design Skills. In Proceedings of the Nineteenth Australasian Computing Education Conference (ACE '17). ACM, NY, NY, USA, 95--102. DOI: http://dx.doi.org/10.1145/3013499.3013511",
      "doi": "10.1145/3013499.3013511"
    },
    {
      "text": "Anna Vallgarda and Ylva Fernaeus. 2015. Interaction Design As a Bricolage Practice. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 173--180. DOI: http://dx.doi.org/10.1145/2677199.2680594",
      "doi": "10.1145/2677199.2680594"
    },
    {
      "text": "Rebecca Vivian and Katrina Falkner. 2019. Identifying Teachers' Technological Pedagogical Content Knowledge for Computer Science in the Primary Years. In Proceedings of the 2019 ACM Conference on International Computing Education Research (ICER '19). ACM, NY, NY, USA, 147--155. DOI: http://dx.doi.org/10.1145/3291279.3339410",
      "doi": "10.1145/3291279.3339410"
    },
    {
      "text": "Lauren Wilcox, Betsy DiSalvo, Dick Henneman, and Qiaosi Wang. 2019. Design in the HCI Classroom: Setting a Research Agenda. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, NY, NY, USA, 871--883. DOI: http://dx.doi.org/10.1145/3322276.3322381",
      "doi": "10.1145/3322276.3322381"
    },
    {
      "text": "Aman Yadav and Marc Berges. 2019. Computer Science Pedagogical Content Knowledge: Characterizing Teacher Performance. ACM Trans. Comput. Educ. 19, 3 (May 2019), 29:1--29:24. DOI: http://dx.doi.org/10.1145/3303770",
      "doi": "10.1145/3303770"
    },
    {
      "text": "Helen Z. Zhang, Charles Xie, and Saeid Nourian. 2018. Are their Designs Iterative or Fixated? Investigating Design Patterns from Student Digital Footprints in Computer-Aided Design Software. International Journal of Technology and Design Education 28, 3 (Sept. 2018), 819--841. DOI: http://dx.doi.org/10.1007/s10798-017--9408--1",
      "doi": ""
    }
  ]
}