{
  "doi": "10.1145/3313831.3376673",
  "title": "RestoreVR: Generating Embodied Knowledge and Situated Experience of Dunhuang Mural Conservation via Interactive Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "In Dunhuang Mogao Grottoes, unique Buddhist murals of ancient China are preserved. Unfortunately, the exquisite murals are suffering from degradation. Experts have been trying to enhance public's awareness of mural protection, but there's no efficacious means to attract interest and popularize knowledge yet. In this paper, we propose RestoreVR, an interactive virtual reality (VR) system engaging users to experience Dunhuang mural restoration in a digital tour in the cave. Based on an online survey with the public and in-depth interviews with five Dunhuang experts, we derive a set of design requirements for generating embodied knowledge and situated experience in VR to bridge the gap between highly specialized experts and general audiences. Accordingly, we design RestoreVR and conduct a between-subjects user study to compare our system with traditional methods. The results suggest that RestoreVR significantly improves user experience and awareness of CH protection over existing methods.",
  "authors": [
    {
      "name": "Xinyi Fu",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526823",
      "orcid": "missing"
    },
    {
      "name": "Yaxin Zhu",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528827",
      "orcid": "missing"
    },
    {
      "name": "Zhijing Xiao",
      "institution": "Beijing Normal University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527859",
      "orcid": "missing"
    },
    {
      "name": "Yingqing Xu",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659643290",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "2017. Lotus Sutra Exhibition in Singapore. http://www.iop.or.jp/ExhibitionSingapore2017.html. (2017). Accessed: 2019-09--10.",
      "doi": ""
    },
    {
      "text": "2017. Sacred Art of the Silk Road Exhibition. https:// www.psta.org.uk/news-and-events/dunhuang-exhibition. (2017). Accessed: 2019-09--10.",
      "doi": ""
    },
    {
      "text": "2017. Tongji University VR Dunhuang. http://www.jfdaily.com/news/detail?id=48500. (2017). Accessed: 2019-09--10.",
      "doi": ""
    },
    {
      "text": "Dunhuang Academy. 2015. Digital Dunhuang. (2015). https://www.e-dunhuang.com/index.htm [Accessed: 2019-09--10].",
      "doi": ""
    },
    {
      "text": "Carmelo Ardito, Paolo Buono, Maria Francesca Costabile, Rosa Lanzilotti, and Antonio Piccinno. 2009. Enabling Interactive Exploration of Cultural Heritage: An Experience of Designing Systems for Mobile Devices. Knowledge Technology & Policy 22, 1 (2009), 79--86.",
      "doi": ""
    },
    {
      "text": "Piero Baglioni, Luigi Dei, Francesca Piqué, Giuseppe Sarti, and Enzo Ferroni. 1997. New autogenous lime-based grouts used in the conservation of lime-based wall paintings. Studies in Conservation 42, 1 (1997), 43--54.",
      "doi": ""
    },
    {
      "text": "S Baldissini and M Gaiani. 2014. Interacting with the Andrea Palladio Works: The History of Palladian Information System Interfaces. Journal on Computing & Cultural Heritage 7, 2 (2014), 1--26.",
      "doi": "10.1145/2611374"
    },
    {
      "text": "Miri Barak, Orit Herscoviz, Zvia Kaberman, and Yehudit J Dori. 2009. MOSAICA: A web-2.0 based system for the preservation and presentation of cultural heritage. Computers & Education 53, 3 (2009), 841--852.",
      "doi": "10.1016/j.compedu.2009.05.004"
    },
    {
      "text": "S. Gonizzi Barsanti, G. Caruso, L. L. Micoli, M. Covarrubias Rodriguez, and G. Guidi. 2015. 3D Visualization of Cultural Heritage Artefacts with Virtual Reality devices. ISPRS - International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences XL-5/W7 (2015), 165--172.",
      "doi": ""
    },
    {
      "text": "Mafkereseb Kassahun Bekele, Roberto Pierdicca, Emanuele Frontoni, Eva Savina Malinverni, and James Gain. 2018. A survey of augmented, virtual, and mixed reality for cultural heritage. Journal on Computing and Cultural Heritage (JOCCH) 11, 2 (2018), 7.",
      "doi": "10.1145/3145534"
    },
    {
      "text": "Danilo Bersani, Gianni Antonioli, Pier Paolo Lottici, L Fornari, and Marcello Castrichini. 2001. Restoration of a Parmigianino's fresco: a micro-Raman investigation of the pictorial surface. In Laser Techniques and Systems in Art Conservation, Vol. 4402. International Society for Optics and Photonics, 221--226.",
      "doi": ""
    },
    {
      "text": "Marcelo Bertalmio, Luminita Vese, Guillermo Sapiro, and Stanley Osher. 2003. Simultaneous structure and texture image inpainting. IEEE transactions on image processing 12, 8 (2003), 882--889.",
      "doi": "10.1109/TIP.2003.815261"
    },
    {
      "text": "Jan Blacek, Barbara Zitová, Miroslav Bene?, and Janka Hradilová. 2009. Fresco restoration: Digital image processing approach. In 2009 17th European Signal Processing Conference. IEEE, 1210--1214.",
      "doi": ""
    },
    {
      "text": "Emiliano Carretti, Rodorico Giorgi, Debora Berti, and Piero Baglioni. 2007. Oil-in-water nanocontainers as low environmental impact cleaning tools for works of art: Two case studies. Langmuir 23, 11 (2007), 6396--6403.",
      "doi": ""
    },
    {
      "text": "Gangquan Chen, Zaixuan Fan, Qunli Yu, Bomin Su, Yanfei Li, Hai Qiao, and Wei Tang. 2009. Primary Test of Desalination to Treat the Disrupted Wall Painting in Cang Jie Temple of Baishui. Dunhuang Research 2009, 6 (2009), 8--12.",
      "doi": ""
    },
    {
      "text": "Zhenwang Chen and Jinshi Fan. 2016. Application of Cultural and Technological Convergence in Cultural Heritage Protection-A Case Study. Dunhuang Research 002 (2016), 100--107.",
      "doi": ""
    },
    {
      "text": "Antonio Criminisi, Patrick Pérez, and Kentaro Toyama. 2004. Region flling and object removal by exemplar-based image inpainting. IEEE Transactions on image processing 13, 9 (2004), 1200--1212.",
      "doi": "10.1109/TIP.2004.833105"
    },
    {
      "text": "Tom Djajadiningrat, Kees Overbeeke, and Stephan Wensveen. 2002. But how, Donald, tell us how?: on the creation of meaning in interaction design through feedforward and inherent feedback. In Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques. ACM, 285--291.",
      "doi": "10.1145/778712.778752"
    },
    {
      "text": "S. F. El-Hakim, J. A. Beraldin, M Picard, and G Godin. 2004. Detailed 3D reconstruction of large-scale heritage sites with integrated techniques. Computer Graphics & Applications IEEE 24, 3 (2004), 21--29.",
      "doi": "10.1109/MCG.2004.1318815"
    },
    {
      "text": "Jinshi Fan. 2005. Mogao Grottoes Conservation and Contrariety with Tourism and Its Counter-Measure. Dunhuang Research 2005, 4 (2005), 1--3.",
      "doi": ""
    },
    {
      "text": "Jinshi Fan. 2015. Maintaining the Heritage Management System of Dunhuang Mogao Grottoes. Dunhuang Research 004 (2015), 1--4.",
      "doi": ""
    },
    {
      "text": "Jianping Fan, David KY Yau, Ahmed K Elmagarmid, and Walid G Aref. 2001. Automatic image segmentation by integrating color-edge extraction and seeded region growing. IEEE transactions on image processing 10, 10 (2001), 1454--1466.",
      "doi": ""
    },
    {
      "text": "ZX Fan, GQ Chen, BM Su, YF Li, H Qiao, and W Tang. 2009. The testing study for repairing the disruption wall paintings in Cave 98 at Mogao Grottoes. Dunhuang Res 6 (2009), 4--7.",
      "doi": ""
    },
    {
      "text": "Zaixuan Fan, Stephen Rickerby, Lisa Shekede, Hai Qiao, Wei Tang, and Jinjian Yang. 2008. The technique measurement for repairing the mural -paintings in Cave 85 at Mogao Grottoes. Dunhuang Research 6 (2008), 19--22.",
      "doi": ""
    },
    {
      "text": "XY Fu, Y Han, ZJ Sun, XJ Ma, and YQ Xu. 2017. Line-drawing enhanced interactive mural restoration for Dunhuang Mogao Grottoes. ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences 4 (2017), 99.",
      "doi": ""
    },
    {
      "text": "Youxu Fu, Heqiang Niu, Jing Ma, Zaixuan Fan, Fasi Wu, Linyi Zhao, Wanyu Zhu, and Wanfu Wang. 2015. The Conservation and Restoration of Cave 98 of Mogao Grottoes, Dunhuang. Studies of the Cave Temples 0 (2015), 424--439.",
      "doi": ""
    },
    {
      "text": "Ioannis Giakoumis, Nikos Nikolaidis, and Ioannis Pitas. 2005. Digital image processing techniques for the detection and removal of cracks in digitized paintings. IEEE Transactions on Image Processing 15, 1 (2005), 178--188.",
      "doi": "10.1109/TIP.2005.860311"
    },
    {
      "text": "Alvaro Guevara, Christian Conrad, and Rudolf Mester. 2011. Boosting segmentation results by contour relaxation. In 2011 18th IEEE International Conference on Image Processing. IEEE, 1405--1408.",
      "doi": ""
    },
    {
      "text": "Diego Gutierrez, Francisco J Seron, Juan A Magallon, Emilio J Sobreviela, and Pedro Latorre. 2004. Archaeological and cultural heritage: bringing life to an unearthed Muslim suburb in an immersive environment. Journal of Cultural Heritage 5, 1 (2004), 63--74.",
      "doi": ""
    },
    {
      "text": "Mahmoud Haydar, David Roussel, Madjid Maïdi, Samir Otmane, and Malik Mallem. 2011. Virtual and augmented reality for cultural computing and heritage: a case study of virtual exploration of underwater archaeological sites (preprint). Virtual Reality 15, 4 (2011), 311--327.",
      "doi": "10.5555/3113178.3113278"
    },
    {
      "text": "Kim H.K., Park J., Choi Y., and Choe M. 2018. Virtual reality sickness questionnaire (VRSQ): Motion sickness measurement index in a virtual reality environment. Applied Ergonomics 69, January (2018), 66--73.",
      "doi": ""
    },
    {
      "text": "Sara Invitto, Italo Spada, Dario Turco, and Genuario Belmonte. 2014. Easy Perception Lab: Evolution, Brain and Virtual and Augmented Reality in Museum Environment. Lecture Notes in Computer Science 8853 (2014), 302--310.",
      "doi": ""
    },
    {
      "text": "K Manikanta Prasanth Kumar, Mayank Kumar, BVS Bhargav, and Mrinmoy Ghorai. 2014. Digital Restoration of Deteriorated Mural Images. In 2014 Fifth International Conference on Signal and Image Processing. IEEE, 36--41.",
      "doi": ""
    },
    {
      "text": "J Lalley and R Miller. 2007. The learning pyramid: Does it point teachers in the right direction. Education 128, 1 (2007), 16.",
      "doi": ""
    },
    {
      "text": "Jiamin Li, Hui Zhang, Zaixuan Fan, Xiang He, Shimin He, Mingyuan Sun, Yimin Ma, Shiqiang Fang, Huabing Zhang, and Bingjian Zhang. 2013. Investigation of the renewed diseases on murals at Mogao Grottoes. Heritage Science 1, 1 (2013), 31.",
      "doi": ""
    },
    {
      "text": "James Jeng Weei Lin, Henry B.L. Duh, Donald E. Parker, Habib Abi-Rached, and Thomas A. Furness. 2002. Effects of feld of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. Proceedings - Virtual Reality Annual International Symposium February (2002), 164--171.",
      "doi": ""
    },
    {
      "text": "Marco P Locatelli, Davide L Rinaldi, Carla Simone, and Giuseppe Vizzari. 2012. Supporting valorization of cultural heritage documentation: The TIVal portal approach. In 2012 18th International Conference on Virtual Systems and Multimedia. IEEE, 453--460.",
      "doi": ""
    },
    {
      "text": "Michela Mortara, Chiara Eva Catalano, Francesco Bellotti, Giusy Fiucci, Minica Houry-Panchetti, and Panagiotis Petridis. 2014. Learning cultural heritage by serious games. Journal of Cultural Heritage 15, 3 (2014), 318--325.",
      "doi": ""
    },
    {
      "text": "Gero Müller, Gerhard H. Bendels, and Reinhard Klein. 2005. Rapid Synchronous Acquisition of Geometry and Appearance of Cultural Heritage Artefacts. In International Conference on Virtual Reality.",
      "doi": ""
    },
    {
      "text": "Milind G Padalkar and Manjunath V Joshi. 2015. Auto-inpainting heritage scenes: a complete framework for detecting and inflling cracks in images and videos with quantitative assessment. Machine Vision and Applications 26, 2--3 (2015), 317--337.",
      "doi": "10.1007/s00138-015-0661-6"
    },
    {
      "text": "Markku Reunanen, Lily Diaz, and Tommi Horttana. 2015. A Holistic User-Centered Approach to Immersive Digital Cultural Heritage Installations. Journal on Computing & Cultural Heritage 7, 4 (2015), 1--16.",
      "doi": "10.1145/2637485"
    },
    {
      "text": "Carla Simone, Marco Martini, Susanna Bortolotto, Gabriele Guidi, Marco Malagodi, Maria Teresa Mazzilli, Marco Morandotti, Goffredo Haus, and Pasquale Tucci. 2012. The TIVAL project: Integrating multidisciplinary perspectives. In 2012 18th International Conference on Virtual Systems and Multimedia. IEEE, 491--498.",
      "doi": ""
    },
    {
      "text": "Elizabeth A Smith. 2001. The role of tacit and explicit knowledge in the workplace. Journal of knowledge Management 5, 4 (2001), 311--321.",
      "doi": ""
    },
    {
      "text": "G Schirripa Spagnolo and Fabrizia Somma. 2010. Virtual restoration of cracks in digitized image of paintings. In Journal of Physics: Conference Series, Vol. 249. IOP Publishing, 012059.",
      "doi": ""
    },
    {
      "text": "Mariagrazia Tortora, Stefano Sfarra, Marco Chiarini, Valeria Daniele, Giuliana Taglieri, and Giorgio Cerichelli. 2016. Non-destructive and micro-invasive testing techniques for characterizing materials, structures and restoration problems in mural paintings. Applied Surface Science 387 (2016), 971--985.",
      "doi": ""
    },
    {
      "text": "Naman Turakhia, Ruchin Shah, and Manjunath Joshi. 2012. Automatic crack detection in heritage site images for image inpainting. In Proceedings of the Eighth Indian Conference on Computer Vision, Graphics and Image Processing. ACM, 68.",
      "doi": "10.1145/2425333.2425401"
    },
    {
      "text": "Fei Yue Wang. 2009. Is Culture Computable? IEEE Intelligent Systems 24, 2 (2009), 2--3.",
      "doi": "10.1109/MIS.2009.107"
    },
    {
      "text": "Wanfu Wang, Zanfeng Ma, Linyi Zhao, Qiangqiang Pei, and Zaixuan Fan. 2008. Practice and applying of the theory of the design procedure for conservative restoration of the wall. Dunhuang Research 2008, 6 (2008), 13--18.",
      "doi": ""
    },
    {
      "text": "Xudong Wang. 2011. Exploration and Practice of the Methodology for Wall Painting Conservation Based Upon Principles for the Conservation of Heritage Sites in China. Dunhuang Research 6 (2011), 3.",
      "doi": ""
    },
    {
      "text": "Roderick Whitfeld, Susan Whitfeld, and Neville Agnew. 2015. Cave Temples of Mogao at Dunhuang: Art History on the Silk Road. Getty Publications.",
      "doi": ""
    },
    {
      "text": "DD Zhang. 2015. Tacit knowledge: the microscopic perspective of design innovation research on traditional crafts. ZhuangShi 266 (2015), 117--119.",
      "doi": ""
    },
    {
      "text": "LI Zui-xiong. 2004. Sixty Years On The Conservation of The Dunhuang Grottoes [J]. Dunhuang Research 3 (2004), 10--26.",
      "doi": ""
    }
  ]
}