{
  "doi": "10.1145/3313831.3376445",
  "title": "Co-Designing Checklists to Understand Organizational Challenges and Opportunities around Fairness in AI",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Many organizations have published principles intended to guide the ethical development and deployment of AI systems; however, their abstract nature makes them difficult to operationalize. Some organizations have therefore produced AI ethics checklists, as well as checklists for more specific concepts, such as fairness, as applied to AI systems. But unless checklists are grounded in practitioners' needs, they may be misused. To understand the role of checklists in AI ethics, we conducted an iterative co-design process with 48 practitioners, focusing on fairness. We co-designed an AI fairness checklist and identified desiderata and concerns for AI fairness checklists in general. We found that AI fairness checklists could provide organizational infrastructure for formalizing ad-hoc processes and empowering individual advocates. We highlight aspects of organizational culture that may impact the efficacy of AI fairness checklists, and suggest future design directions.",
  "authors": [
    {
      "name": "Michael A. Madaio",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714622",
      "orcid": "0000-0001-5772-0488"
    },
    {
      "name": "Luke Stark",
      "institution": "Microsoft Research, Montreal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659681778",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Wortman Vaughan",
      "institution": "Microsoft Research, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758671157",
      "orcid": "missing"
    },
    {
      "name": "Hanna Wallach",
      "institution": "Microsoft Research, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315492225",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrew Abbott. 1983. Professional Ethics. Amer. J. Sociology 88, 5 (March 1983), 855--885.",
      "doi": ""
    },
    {
      "text": "Gabriel Abend. 2014. The Moral Background. Princeton University Press, Princeton, NJ and Oxford.",
      "doi": ""
    },
    {
      "text": "Alekh Agarwal, Alina Beygelzimer, Miroslav Dudik, John Langford, and Hanna Wallach. 2018. A Reductions Approach to Fair Classification. In Proceedings of the 2019 International Conference on Machine Learning. 60--69.",
      "doi": ""
    },
    {
      "text": "Ifeoma Ajunwa and Daniel Greene. 2019. Platforms at Work: Automated Hiring Platforms and Other New Intermediaries in the Organization of Work. In Work and Labor in the Digital Age. Emerald Publishing Limited, 61--91.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human--AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1--13. DOI: http://dx.doi.org/https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Chelsea Barabas, Madars Virza, Karthik Dinakar, Joichi Ito, and Jonathan Zittrain. 2018. Interventions over Predictions: Reframing the Ethical Debate for Actuarial Risk Assessment. Proceedings of Machine Learning Research 81 (Jan. 2018), 1--15.",
      "doi": ""
    },
    {
      "text": "Beijing Academy of Artificial Intelligence. 2019. Beijing AI Principles. (2019). https://www.baai.ac.cn/blog/beijing-ai-principles",
      "doi": ""
    },
    {
      "text": "Rachel K. E. Bellamy, Kuntal Dey, Michael Hind, Samuel C. Hoffman, Stephanie Houde, Kalapriya Kannan, Pranay Lohia, Jacquelyn Martino, Sameep Mehta, Aleksandra Mojsilovic, Seema Nagar, Karthikeyan Natesan Ramamurthy, John Richards, Diptikalyan Saha, Prasanna Sattigeri, Moninder Singh, Kush R. Varshney, and Yunfeng Zhang. 2018. AI Fairness 360: An Extensible Toolkit for Detecting, Understanding, and Mitigating Unwanted Algorithmic Bias. (Oct. 2018). https://arxiv.org/abs/1810.01943",
      "doi": ""
    },
    {
      "text": "Emily M. Bender and Batya Friedman. 2018. Data Statements for Natural Language Processing: Toward Mitigating System Bias and Enabling Better Science. Transactions of the Association for Computational Linguistics 6 (2018), 587--604.",
      "doi": ""
    },
    {
      "text": "Richard Berk, Hoda Heidari, Shahin Jabbari, Michael Kearns, and Aaron Roth. 2018. Fairness in criminal justice risk assessments: The state of the art. Sociological Methods & Research (2018), 0049124118782533.",
      "doi": ""
    },
    {
      "text": "Elettra Bietti. 2020. From Ethics Washing to Ethics Bashing: A View on Tech Ethics from Within Moral Philosophy. In Proceedings of the Confernce on Fairness, Accountability, and Transparency (FAT*).",
      "doi": ""
    },
    {
      "text": "Wiebe E. Bijker. 1997. Introduction. In Of Bicycles, Bakelite, and Bulbs: Toward a Theory of Sociotechnical Change. The MIT Press, Cambridge, MA, 1--17.",
      "doi": ""
    },
    {
      "text": "Annegret Borchard, David LB Schwappach, Aline Barbir, and Paula Bezzola. 2012. A systematic review of the effectiveness, compliance, and critical factors for implementation of safety checklists in surgery. Annals of surgery 256, 6 (2012), 925--933.",
      "doi": ""
    },
    {
      "text": "Paul Bowie, Julie Ferguson, Marion MacLeod, Susan Kennedy, Carl de Wet, Duncan McNab, Moya Kelly, John McKay, and Sarah Atkinson. 2015. Participatory design of a preliminary safety checklist for general practice. Br J Gen Pract 65, 634 (2015), e330--e343.",
      "doi": ""
    },
    {
      "text": "Bill Brykczynski. 1999. A survey of software inspection checklists. ACM SIGSOFT Software Engineering Notes 24, 1 (1999), 82.",
      "doi": "10.1145/308769.308798"
    },
    {
      "text": "Barbara K Burian. 2006. Design guidance for emergency and abnormal checklists in aviation. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 50. Sage Publications: Los Angeles, CA, 106--110.",
      "doi": ""
    },
    {
      "text": "Barbara K Burian, Anna Clebone, Key Dismukes, and Keith J Ruskin. 2018. More than a tick box: medical checklist development, design, and use. Anesthesia & Analgesia 126, 1 (2018), 223--232.",
      "doi": ""
    },
    {
      "text": "Center for Democracy and Technology. 2019. Digital Decisions Tool. (2019). https://cdt.org/blog/digital-decisions-tool/",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2008. Grounded theory as an emergent method. Handbook of emergent methods 155 (2008), 172.",
      "doi": ""
    },
    {
      "text": "Alexandra Chouldechova, Emily Putnam-Hornstein, Diana Benavides-Prado, Oleksandr Fialko, and Rhema Vaithianathan. 2018. A case study of algorithm-assisted decision making in child maltreatment hotline screening decisions. Proceedings of Machine Learning Research 81 (Jan. 2018), 1--15.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Jean Garcia-Gathright, Sravana Reddy, Aaron Springer, and Romain Takeo Bouyer. 2019. Translation, Tracks & Data: an Algorithmic Bias Effort in Practice. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1--8. DOI: http://dx.doi.org/10.1145/3290607.3299057",
      "doi": "10.1145/3290607.3299057"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In International Conference on Ubiquitous Computing. Springer, 429--446.",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Asaf Degani and Earl L Wiener. 1991. Human Factors of Flight Deck Checklists: The Normal Checklist. In NASA Contractor Report 177549; Contract NCC2--377. National Aeronautics and Space Administration, Ames Research Center, Moffett Field, California.",
      "doi": ""
    },
    {
      "text": "Asaf Degani and Earl L Wiener. 1993. Cockpit checklists: Concepts, design, and use. Human factors 35, 2 (1993), 345--359.",
      "doi": ""
    },
    {
      "text": "Nicole M Deterding and Mary C Waters. 2018. Flexible coding of in-depth interviews: A twenty-first-century approach. Sociological methods & research (2018), 1--32.",
      "doi": ""
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX design innovation: Challenges for working with machine learning as a design material. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 278--288. DOI: http://dx.doi.org/10.1145/3025453.3025739",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "DrivenData. 2019. Deon: An ethics checklist for data scientists. (2019). http://deon.drivendata.org/",
      "doi": ""
    },
    {
      "text": "Bob Duncan and Mark Whittington. 2014. Reflecting on whether checklists can tick the box for cloud security. In 2014 IEEE 6th International Conference on Cloud Computing Technology and Science. IEEE, 805--810.",
      "doi": "10.1109/CloudCom.2014.165"
    },
    {
      "text": "Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard Zemel. 2012. Fairness through awareness. (2012), 214--226. https://arxiv.org/abs/1104.3913",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork and Deirdre K. Mulligan. 2013. It's Not Privacy, and It's Not Fair. Stanford Law Review Online 66 (Sept. 2013), 35--40.",
      "doi": ""
    },
    {
      "text": "Frank Elberzhager, Alexander Klaus, and Marek Jawurek. 2009. Software inspections using guided checklists to ensure security goals. In 2009 International Conference on Availability, Reliability and Security. IEEE, 853--858.",
      "doi": ""
    },
    {
      "text": "Virgina Eubanks. 2018. Automating Inequality: How High-Tech Tools Profile, Police, and Punish the Poor. St. Martin's Press, New York.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Johns Hopkins Center for Government Excellence. 2019. Ethics & Algorithms Toolkit. (2019). http://ethicstoolkit.ai/",
      "doi": ""
    },
    {
      "text": "Mary Flanagan and Helen Nissenbaum. 2014. Values at Play in Digital Games. The MIT Press, Cambridge, MA.",
      "doi": "10.5555/2635976"
    },
    {
      "text": "Organisation for Economic Co-operation and Development. 2019. OECD AI Principles. (2019). https://www.oecd.org/going-digital/ai/principles/",
      "doi": ""
    },
    {
      "text": "Lincoln H Forbes and Syed M Ahmed. 2010. Modern construction: lean project delivery and integrated practices. CRC Press, Boca Raton, FL.",
      "doi": ""
    },
    {
      "text": "Aude Fourcade, Jean-Louis Blache, Catherine Grenier, Jean-Louis Bourgain, and Etienne Minvielle. 2012. Barriers to staff adoption of a surgical safety checklist. BMJ Quality and Safety 21, 3 (2012), 191--197.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and David G. Hendry. 2019. Value Sensitive Design. The MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and Helen Nissenbaum. 1996. Bias in Computer Systems. ACM Transactions on Information Systems 14, 3 (Sept. 1996), 330--347.",
      "doi": "10.1145/230538.230561"
    },
    {
      "text": "Atul Gawande. 2009. The Checklist Manifesto: How to Get Things Right. Metropolitan Books, New York.",
      "doi": ""
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumeé III, and Kate Crawford. 2018. Datasheets for Datasets. CoRR arXiv:1803.09010. (2018).",
      "doi": ""
    },
    {
      "text": "David P Gilliam, Thomas L Wolfe, Joseph S Sherif, and Matt Bishop. 2003. Software security checklist for the software life cycle. In WET ICE 2003. Proceedings. Twelfth IEEE International Workshops on Enabling Technologies: Infrastructure for Collaborative Enterprises, 2003. IEEE, 243--248.",
      "doi": ""
    },
    {
      "text": "Colin M Gray and Shruthi Sai Chivukula. 2019. Ethical Mediation in UX Practice. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 178. DOI: http://dx.doi.org/10.1145/3290605.3300408",
      "doi": "10.1145/3290605.3300408"
    },
    {
      "text": "Daniel Greene, Anna Lauren Hoffmann, and Luke Stark. 2019. Better, Nicer, Clearer, Fairer. In Proceedings of the 52nd Hawaii International Conference on System Sciences (HICSS), T X Bui and R H Sprague (Eds.). 2122--2131.",
      "doi": ""
    },
    {
      "text": "Miguel Guevara. 2019. Enabling developers and organizations to use differential privacy. (September 2019). https://developers.googleblog.com/2019/09/enablingdevelopers-and-organizations.html",
      "doi": ""
    },
    {
      "text": "Seda Gürses and Joris van Hoboken. 2017. Privacy After the Agile Turn. In Cambridge Handbook of Consumer Privacy, Jules Polonetsky, Omer Tene, and Evan Selinger (Eds.). Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Brigette M Hales and Peter J Pronovost. 2006. The checklist: A tool for error management and performance improvement. Journal of Critical Care 21, 3 (2006), 231--235.",
      "doi": ""
    },
    {
      "text": "Alex B Haynes, Thomas G Weiser, William R Berry, Stuart R Lipsitz, Abdel-Hadi S Breizat, E Patchen Dellinger, Teodoro Herbosa, Sudhir Joseph, Pascience L Kibatala, Marie Carmela M Lapitan, and others. 2009. A surgical safety checklist to reduce morbidity and mortality in a global population. New England Journal of Medicine 360, 5 (2009), 491--499.",
      "doi": ""
    },
    {
      "text": "European Union High-level Expert Group. 2019. Ethics Guidelines for Trustworthy AI: Building trust in human-centric AI. (2019). https://ec.europa.eu/futurium/en/ai-allianceconsultation/guidelines",
      "doi": ""
    },
    {
      "text": "Sarah Holland, Ahmed Hosny, Sarah Newman, Joshua Joseph, and Kasia Chmielinski. 2018. The Dataset Nutrition Label: A Framework To Drive Higher Data Quality Standards. CoRR arXiv:1805.03677. (2018).",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Bruce M McLaren, and Vincent Aleven. 2019a. Designing for Complementarity: Teacher and Student Needs for Orchestration Support in AI-Enhanced Classrooms. In International Conference on Artificial Intelligence in Education (AIED) 2019 Proceedings. Springer, 157--171.",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Jennifer Wortman Vaughan, Hal Daumé III, Miro Dudik, and Hanna Wallach. 2019b. Improving fairness in machine learning systems: What do industry practitioners need?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1--18. DOI: http://dx.doi.org/10.1145/3290605.3300830",
      "doi": "10.1145/3290605.3300830"
    },
    {
      "text": "Machine Intelligence. 2019. AI Ethics Framework. (2019). https://www.migarage.ai/ethics-framework/",
      "doi": ""
    },
    {
      "text": "Abigail Z. Jacobs and Hanna Wallach. 2019. Measurement and Fairness. arXiv:1912.05511. (2019).",
      "doi": ""
    },
    {
      "text": "Martin Jaeger and Desmond Adair. 2012. Communication simulation in construction management education: Evaluating learning effectiveness. Australasian Journal of Engineering Education 18, 1 (2012), 1--14.",
      "doi": ""
    },
    {
      "text": "Anna Jobin, Marcello Ienca, and Effy Vayena. 2019. The global landscape of AI ethics guidelines. Nature Machine Intelligence (Sept. 2019), 1--11.",
      "doi": ""
    },
    {
      "text": "Heidi S Kramer and Frank A Drews. 2017. Checking the lists: A systematic review of electronic checklist use in health care. Journal of biomedical informatics 71 (2017), S6--S12.",
      "doi": "10.1016/j.jbi.2016.09.006"
    },
    {
      "text": "Pei-Yi Kuo, Rajiv Saran, Marissa Argentina, Michael Heung, Jennifer L Bragg-Gresham, Dinesh Chatoth, Brenda Gillespie, Sarah Krein, Rebecca Wingard, Kai Zheng, and Tiffany Veinot. 2019. Development of a Checklist for the Prevention of Intradialytic Hypotension in Hemodialysis Care: Design Considerations Based on Activity Theory. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1--14. DOI: http://dx.doi.org/10.1145/3290605.3300872",
      "doi": "10.1145/3290605.3300872"
    },
    {
      "text": "Lorelei Lingard, Sherry Espin, B Rubin, Sarah Whyte, M Colmenares, GR Baker, Diane Doran, E Grober, B Orser, J Bohnen, and others. 2005. Getting teams to talk: development and pilot implementation of a checklist to promote interprofessional communication in the OR. BMJ Quality & Safety 14, 5 (2005), 340--346.",
      "doi": ""
    },
    {
      "text": "Mike Loukides, Hilary Mason, and DJ Patil. 2018. Of Oaths and Checklists. (2018). https://www.oreilly.com/ideas/of-oaths-and-checklists",
      "doi": ""
    },
    {
      "text": "Michael A Madaio, Fabrice Tanoh, Axel Blahoua Seri, Kaja Jasinska, and Amy Ogan. 2019. \"Everyone Brings Their Grain of Salt\": Designing for Low-Literate Parental Engagement with a Mobile Literacy Technology in Côte d'Ivoire. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1--15. DOI: http://dx.doi.org/10.1145/3290605.3300695",
      "doi": "10.1145/3290605.3300695"
    },
    {
      "text": "Noëmi Manders-Huits and Michael Zimmer. 2009. Values and Pragmatic Action: The Challenges of Introducing Ethical Intelligence in Technical Design Communities. International Review of Information Ethics (Jan. 2009), 1--8.",
      "doi": ""
    },
    {
      "text": "J Nathan Matias. 2019. The American Museum of Exploding Cars and Toys That Kill You Everyone in tech should visit this museum , and so should you . (2019), 1--11. https://medium.com/berkman-kleincenter/the-american-museum-of-exploding-cars-andtoys-that-kill-you-5123f35cb271",
      "doi": ""
    },
    {
      "text": "Andrew McNamara, Justin Smith, and Emerson Murphy-Hill. 2018. Does ACM's code of ethics change ethical decision making in software development?. In Proceedings of the 2018 26th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering. ACM, 729--733.",
      "doi": "10.1145/3236024.3264833"
    },
    {
      "text": "Jacob Metcalf. 2014. Ethics Codes: History, Context, and Challenges. Council for Big Data, Ethics, and Society (2014). http://bdes.datasociety.net/counciloutput/ethics-codes-history-context-and-challenges/",
      "doi": ""
    },
    {
      "text": "Jacob Metcalf, Emanuel Moss, and others. 2019. Owning Ethics: Corporate Logics, Silicon Valley, and the Institutionalization of Ethics. Social Research: An International Quarterly 86, 2 (2019), 449--476.",
      "doi": ""
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model cards for model reporting. In Proceedings of the Conference on Fairness, Accountability, and Transparency. ACM, 220--229. DOI: http://dx.doi.org/10.1145/3287560.3287596",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "Brent Mittelstadt. 2019. AI Ethics--Too Principled to Fail? CoRR arXiv:1906.06668, (2019).",
      "doi": ""
    },
    {
      "text": "Brent Daniel Mittelstadt, Patrick Allo, Mariarosaria Taddeo, Sandra Wachter, and Luciano Floridi. 2016. The ethics of algorithms: Mapping the debate. Big Data & Society 3, 2 (Sept. 2016), 205395171667967--21.",
      "doi": ""
    },
    {
      "text": "Michael Muller. 2014. Curiosity, creativity, and surprise as analytic tools: Grounded theory method. In Ways of Knowing in HCI. Springer, 25--48.",
      "doi": ""
    },
    {
      "text": "Arvind Narayanan. 2018. Translation tutorial: 21 fairness definitions and their politics. In Proceedings of the Conference on Fairness, Accountability, and Transparency (FAT*). New York.",
      "doi": ""
    },
    {
      "text": "Harsha Nori, Samuel Jenkins, Paul Koch, and Rich Caruana. 2019. InterpretML: A Unified Framework for Machine Learning Interpretability. arXiv preprint arXiv:1909.09223 (2019).",
      "doi": ""
    },
    {
      "text": "Partnership on AI. 2017. AI Tenets. Partnership on AI (2017). https://www.partnershiponai.org/2016/09/industryleaders-establish-partnership-on-ai-best-practices/",
      "doi": ""
    },
    {
      "text": "Cathy O'Neil. 2017. Weapons of Math Destruction. Broadway Books, New York.",
      "doi": ""
    },
    {
      "text": "Google Research. 2019. What if Tool. (2019). https://pair-code.github.io/what-if-tool/",
      "doi": ""
    },
    {
      "text": "Pedro Saleiro, Benedict Kuester, Loren Hinkson, Jesse London, Abby Stevens, Ari Anisfeld, Kit T. Rodolfa, and Rayid Ghani. 2018. Aequitas: A Bias and Fairness Audit Toolkit. 2018 (2018). http://arxiv.org/abs/1811.05577",
      "doi": ""
    },
    {
      "text": "Andrew D Selbst, Danah Boyd, Sorelle A Friedler, Suresh Venkatasubramanian, and Janet Vertesi. 2019. Fairness and abstraction in sociotechnical systems. (2019), 59--68.",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2013. Values levers: Building ethics into design. Science, Technology, & Human Values 38, 3 (2013), 374--397.",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2018. Values and Ethics in Human-Computer Interaction. Foundations and Trends in Human--Computer Interaction 12, 2 (2018), 107--171.",
      "doi": "10.1561/1100000073"
    },
    {
      "text": "Luke Stark and Anna Lauren Hoffmann. 2019. Data Is the New What? Popular Metaphors & Professional Ethics in Emerging Data Culture. Journal of Cultural Analytics (May 2019).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Øyvind Thomassen, Ansgar Storesund, Eirik Søfteland, and Guttorm Brattebø. 2014. The effects of safety checklists in medicine: a systematic review. Acta Anaesthesiologica Scandinavica 58, 1 (2014), 5--18.",
      "doi": ""
    },
    {
      "text": "United Kingdom, Department of Digital, Culture, Media and Sport. 2019. Data Ethics Workbook. (2019). https://www.gov.uk/government/publications/dataethics-workbook/data-ethics-workbook",
      "doi": ""
    },
    {
      "text": "Shannon Vallor. 2019. An Ethical Toolkit for Engineering / Design Practice. (2019). https://www.scu.edu/ethics-in-technologypractice/ethical-toolkit/",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and accountability design needs for algorithmic support in high-stakes public sector decision-making. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1--14. DOI: http://dx.doi.org/10.1145/3173574.3174014",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Thomas G Weiser and William R Berry. 2013. Perioperative checklist methodologies. Canadian Journal of Anesthesia/Journal canadien d'anesthésie 60, 2 (2013), 136--142.",
      "doi": ""
    },
    {
      "text": "Thomas G Weiser, Alex B Haynes, Angela Lashoher, Gerald Dziekan, Daniel J Boorman, William R Berry, and Atul A Gawande. 2010. Perspectives in quality: designing the WHO Surgical Safety Checklist. International journal for quality in health care 22, 5 (2010), 365--370.",
      "doi": ""
    },
    {
      "text": "Christine T Wolf. 2019. Conceptualizing Care in the Everyday Work Practices of Machine Learning Developers. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion. ACM, 331--335. DOI: http://dx.doi.org/10.1145/3301019.3323879",
      "doi": "10.1145/3301019.3323879"
    },
    {
      "text": "Qian Yang. 2018. Machine Learning as a UX Design Material: How Can We Imagine Beyond Automation, Recommenders, and Reminders?. In 2018 AAAI Spring Symposium Series.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating how experienced UX designers effectively work with machine learning. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 585--596. DOI: http://dx.doi.org/10.1145/3196709.3196730",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Daisy Yoo, Alina Huldtgren, Jill Palzkill Woelfer, David G Hendry, and Batya Friedman. 2013. A value sensitive action-reflection model: evolving a co-design space with stakeholder and designer prompts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 419--428. DOI: http://dx.doi.org/10.1145/2470654.2470715",
      "doi": "10.1145/2470654.2470715"
    },
    {
      "text": "Daisy Yoo, John Zimmerman, Aaron Steinfeld, and Anthony Tomasic. 2010. Understanding the space for co-design in riders' interactions with a transit service. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1797--1806. DOI: http://dx.doi.org/10.1145/1753326.1753596",
      "doi": "10.1145/1753326.1753596"
    },
    {
      "text": "Haiyi Zhu, Bowen Yu, Aaron Halfaker, and Loren Terveen. 2018. Value-sensitive algorithm design: method, case study, and lessons. Proceedings of the ACM on Human-Computer Interaction 2 (2018), 194. DOI: http://dx.doi.org/10.1145/3274463",
      "doi": "10.1145/3274463"
    }
  ]
}