{
  "doi": "10.1145/3313831.3376559",
  "title": "Chameleon: Bringing Interactivity to Static Digital Documents",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Documents such as presentations, instruction manuals, and research papers are disseminated using various file formats, many of which barely support the incorporation of interactive content. To address this lack of interactivity, we present Chameleon, a system-wide tool that combines computer vision algorithms used for image identification with an open database format to allow for the layering of dynamic content. Using Chameleon, static documents can be easily upgraded by layering user-generated interactive content on top of static images, all while preserving the original static document format and without modifying existing applications. We describe the development of Chameleon, including the design and evaluation of vision-based image replacement algorithms, the new document-creation pipeline as well as a user study evaluating Chameleon.",
  "tags": [
    "interactivity",
    "augmented documents",
    "feature matching"
  ],
  "authors": [
    {
      "name": "Damien Masson",
      "institution": "University of Waterloo & Inria, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659488683",
      "orcid": "0000-0002-9482-8639"
    },
    {
      "name": "Sylvain Malacria",
      "institution": "Inria & University of Lille, Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414620309",
      "orcid": "0000-0002-5201-5875"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo & Inria, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    },
    {
      "name": "Géry Casiez",
      "institution": "Univ. Lille, UMR 9189 - CRIStAL, Inria & Institut Universitaire de France (IUF) & University of Waterloo, Lille, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    }
  ],
  "references": [
    {
      "text": "Adobe. 2015. Flash, HTML5 and Open Web Standards. (2015). Retrieved April 7th, 2019 from https://theblog.adobe.com/flash-html5-and-open-web-standards/",
      "doi": ""
    },
    {
      "text": "Adobe. 2017. Flash and The Future of Interactive Content. (2017). Retrieved April 7th, 2019 from https://theblog.adobe.com/adobe-flash-update/",
      "doi": ""
    },
    {
      "text": "Motilal Agrawal, Kurt Konolige, and Morten Rufus Blas. 2008. CenSurE: Center Surround Extremas for Realtime Feature Detection and Matching. In Computer Vision -- ECCV 2008, David Forsyth, Philip Torr, and Andrew Zisserman (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 102--115.",
      "doi": "10.1007/978-3-540-88693-8_8"
    },
    {
      "text": "Apple. 2007a. Accessibility on macOS. (2007). Retrieved April 7th, 2019 from https://developer.apple.com/accessibility/macos/",
      "doi": ""
    },
    {
      "text": "Apple. 2007b. CGWindowListCreateImage. (2007). Retrieved April 7th, 2019 from https://developer.apple.com/documentation/ coregraphics/1454852-cgwindowlistcreateimage",
      "doi": ""
    },
    {
      "text": "T. K. Attwood, D. B. Kell, P. McDermott, J. Marsh, S. R. Pettifer, and D. Thorne. 2010. Utopia documents: linking scholarly literature with research data. Bioinformatics 26, 18 (2010), i568--i574. DOI: http://dx.doi.org/10.1093/bioinformatics/btq383",
      "doi": "10.1093/bioinformatics/btq383"
    },
    {
      "text": "S. K. Badam, Z. Liu, and N. Elmqvist. 2019. Elastic Documents: Coupling Text and Tables through Contextual Visualizations for Enhanced Document Reading. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 661--671. DOI: http://dx.doi.org/10.1109/TVCG.2018.2865119",
      "doi": "10.1109/TVCG.2018.2865119"
    },
    {
      "text": "Herbert Bay, Andreas Ess, Tinne Tuytelaars, and Luc Van Gool. 2008. Speeded-Up Robust Features (SURF). Comput. Vis. Image Underst. 110, 3 (June 2008), 346--359. DOI: http://dx.doi.org/10.1016/j.cviu.2007.09.014",
      "doi": "10.1016/j.cviu.2007.09.014"
    },
    {
      "text": "Michael K. Buckland. 1998. What is a \"document\"? Journal of the American Society for Information Science 48, 9 (1998), 804--809. DOI: http://dx.doi.org/10.1002/(SICI)1097--4571(199709)48: 9804::AID-ASI53.0.CO;2-V",
      "doi": ""
    },
    {
      "text": "Christopher Andreas Clark and Santosh Divvala. 2015. Looking Beyond Text: Extracting Figures, Tables and Captions from Computer Science Papers. In AAAI Workshops. AAAI, USA, 423--434. http://aaai.org/ocs/index.php/WS/AAAIW15/paper/view/10092",
      "doi": ""
    },
    {
      "text": "Allen Cypher, Mira Dontcheva, Tessa Lau, and Jeffrey Nichols. 2010. No Code Required: Giving Users Tools to Transform the Web. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/1805911"
    },
    {
      "text": "Andreas Dieberger, Cameron Miner, and Dulce Ponceleon. 2001. Supporting Narrative Flow in Presentation Software. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 137--138. DOI: http://dx.doi.org/10.1145/634067.634151",
      "doi": ""
    },
    {
      "text": "die.net. 1987. XGetImage. (1987). Retrieved April 7th, 2019 from https://linux.die.net/man/3/xgetimage",
      "doi": ""
    },
    {
      "text": "Morgan Dixon and James Fogarty. 2010. Prefab: Implementing Advanced Behaviors Using Pixel-based Reverse Engineering of Interface Structure. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1525--1534. DOI: http://dx.doi.org/10.1145/1753326.1753554",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier. 2018. Explorable Multiverse Analyses. (2018). Retrieved August 1st, 2019 from https://explorablemultiverse.github.io/",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier. 2019. Increasing the Transparency of Research Papers with Explorable Multiverse Analyses. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 65, 15 pages. DOI: http://dx.doi.org/10.1145/3290605.3300295",
      "doi": "10.1145/3290605.3300295"
    },
    {
      "text": "Fewer and Faster. 2010. Speaker Deck. (2010). Retrieved April 7th, 2019 from https://speakerdeck.com/",
      "doi": ""
    },
    {
      "text": "Martin A. Fischler and Robert C. Bolles. 1987. Random Sample Consensus: A Paradigm for Model Fitting with Applications to Image Analysis and Automated Cartography. In Readings in Computer Vision, Martin Fischler and Oscar Firschein (Eds.). Morgan Kaufmann, San Francisco (CA), 726 -- 740. DOI: http://dx.doi.org/10.1016/B978-0-08-051581--6.50070--2",
      "doi": ""
    },
    {
      "text": "P. E. Forssen. 2007. Maximally Stable Colour Regions for Recognition and Matching. In 2007 IEEE Conference on Computer Vision and Pattern Recognition. IEEE, USA, 1--8. DOI: http://dx.doi.org/10.1109/CVPR.2007.383120",
      "doi": ""
    },
    {
      "text": "Jun Fujima, Aran Lunzer, Kasper Hornbæk, and Yuzuru Tanaka. 2004. Clip, Connect, Clone: Combining Application Elements to Build Custom Interfaces for Information Access. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 175--184. DOI: http://dx.doi.org/10.1145/1029632.1029664",
      "doi": "10.1145/1029632.1029664"
    },
    {
      "text": "Emmanouil Giannisakis, Gilles Bailly, Sylvain Malacria, and Fanny Chevalier. 2017. IconHK: Using Toolbar Button Icons to Communicate Keyboard Shortcuts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4715--4726. DOI: http://dx.doi.org/10.1145/3025453.3025595",
      "doi": "10.1145/3025453.3025595"
    },
    {
      "text": "GNOME. 2011. Assistive Technology Service Provider Interface. (2011). Retrieved April 7th, 2019 from https://github.com/GNOME/at-spi2-atk",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 281--290. DOI: http://dx.doi.org/10.1145/1054972.1055012",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Tovi Grossman, Fanny Chevalier, and Rubaiat Habib Kazi. 2015. Your Paper is Dead!: Bringing Life to Research Articles with Animated Figures. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 461--475. DOI: http://dx.doi.org/10.1145/2702613.2732501",
      "doi": "10.1145/2702613.2732501"
    },
    {
      "text": "François Guimbretière. 2003. Paper Augmented Digital Documents. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 51--60. DOI: http://dx.doi.org/10.1145/964696.964702",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Chris Harris and Mike Stephens. 1988. A combined corner and edge detector. In In Proc. of Fourth Alvey Vision Conference. IEEE, USA, 147--151.",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Leslie Wu, Kevin Collins, and Scott R. Klemmer. 2007. Programming by a Sample: Rapidly Creating Web Applications with D.Mix. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, NY, NY, USA, 241--250. DOI: http://dx.doi.org/10.1145/1294211.1294254",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "IPFS. 2015. IPFS is the Distributed Web. (2015). Retrieved June 24th, 2019 from https://ipfs.io",
      "doi": ""
    },
    {
      "text": "Marcin Iwanowski, Arkadiusz Cacko, and Grzegorz Sarwas. 2016. Comparing Images for Document Plagiarism Detection. In Computer Vision and Graphics, Leszek J. Chmielewski, Amitava Datta, Ryszard Kozera, and Konrad Wojciechowski (Eds.). Springer International Publishing, Cham, 532--543.",
      "doi": ""
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 280--290. DOI: http://dx.doi.org/10.1145/2807442.2807446",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "N. Kong and M. Agrawala. 2012. Graphical Overlays: Using Layered Elements to Aid Chart Reading. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec 2012), 2631--2638. DOI: http://dx.doi.org/10.1109/TVCG.2012.229",
      "doi": "10.1109/TVCG.2012.229"
    },
    {
      "text": "Stefan Leutenegger, Margarita Chli, and Roland Y. Siegwart. 2011. BRISK: Binary Robust Invariant Scalable Keypoints. In Proceedings of the 2011 International Conference on Computer Vision (ICCV '11). IEEE Computer Society, Washington, DC, USA, 2548--2555. DOI: http://dx.doi.org/10.1109/ICCV.2011.6126542",
      "doi": "10.1109/ICCV.2011.6126542"
    },
    {
      "text": "Chunyuan Liao, François Guimbretière, Ken Hinckley, Ken Hinckley, and Jim Hollan. 2008. Papiercraft: A Gesture-based Command System for Interactive Paper. ACM Trans. Comput.-Hum. Interact. 14, 4, Article 18 (Jan. 2008), 27 pages. DOI: http://dx.doi.org/10.1145/1314683.1314686",
      "doi": "10.1145/1314683.1314686"
    },
    {
      "text": "David G. Lowe. 2004. Distinctive Image Features from Scale-Invariant Keypoints. Int. J. Comput. Vision 60, 2 (Nov. 2004), 91--110. DOI: http://dx.doi.org/10.1023/B:VISI.0000029664.99615.94",
      "doi": "10.1023/B%3AVISI.0000029664.99615.94"
    },
    {
      "text": "Min Lu, Jie Liang, Yu Zhang, Guozheng Li, Siming Chen, Zongru Li, and X. Yuan. 2017. Interaction+: Interaction enhancement for web-based visualizations. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, USA, 61--70. DOI: http://dx.doi.org/10.1109/PACIFICVIS.2017.8031580",
      "doi": ""
    },
    {
      "text": "J Matas, O Chum, M Urban, and T Pajdla. 2004. Robust wide-baseline stereo from maximally stable extremal regions. Image and Vision Computing 22, 10 (2004), 761 -- 767. DOI: http://dx.doi.org/10.1016/j.imavis.2004.02.006 British Machine Vision Computing 2002.",
      "doi": ""
    },
    {
      "text": "Norman Meuschke, Christopher Gondek, Daniel Seebacher, Corinna Breitinger, Daniel Keim, and Bela Gipp. 2018. An Adaptive Image-based Plagiarism Detection Approach. In Proceedings of the 18th ACM/IEEE on Joint Conference on Digital Libraries (JCDL '18). ACM, NY, NY, USA, 131--140. DOI: http://dx.doi.org/10.1145/3197026.3197042",
      "doi": "10.1145/3197026.3197042"
    },
    {
      "text": "K. Mikolajczyk and C. Schmid. 2005. A performance evaluation of local descriptors. IEEE Transactions on Pattern Analysis and Machine Intelligence 27, 10 (Oct 2005), 1615--1630. DOI: http://dx.doi.org/10.1109/TPAMI.2005.188",
      "doi": "10.1109/TPAMI.2005.188"
    },
    {
      "text": "K. Mikolajczyk, T. Tuytelaars, C. Schmid, A. Zisserman, J. Matas, F. Schaffalitzky, T. Kadir, and L. Van Gool. 2005. A Comparison of Affine Region Detectors. Int. J. Comput. Vision 65, 1--2 (Nov. 2005), 43--72. DOI: http://dx.doi.org/10.1007/s11263-005--3848-x",
      "doi": "10.1007/s11263-005-3848-x"
    },
    {
      "text": "Theodor Holm Nelson. 1995. The Heart of Connection: Hypermedia Unified by Transclusion. Commun. ACM 38, 8 (Aug. 1995), 31--33. DOI: http://dx.doi.org/10.1145/208344.208353",
      "doi": "10.1145/208344.208353"
    },
    {
      "text": "Daniel Nüst, Markus Konkol, Edzer Pebesma, Christian Kray, Marc Schutzeichel, Holger Przibytzin, and Jörg Lorenz. 2017. Opening the Publication Process with Executable Research Compendia. D-Lib Magazine 23 (01 2017). DOI: http://dx.doi.org/10.1045/january2017-nuest",
      "doi": ""
    },
    {
      "text": "Plotly. 2012. Plotly. (2012). Retrieved August 1st, 2019 from https://plot.ly/",
      "doi": ""
    },
    {
      "text": "Qt. 2008. QWebEngineView. (2008). Retrieved April 7th, 2019 from https://doc.qt.io/qt-5/qwebengineview.html",
      "doi": ""
    },
    {
      "text": "E. Rosten, R. Porter, and T. Drummond. 2010. Faster and Better: A Machine Learning Approach to Corner Detection. IEEE Transactions on Pattern Analysis and Machine Intelligence 32, 1 (Jan 2010), 105--119. DOI: http://dx.doi.org/10.1109/TPAMI.2008.275",
      "doi": "10.1109/TPAMI.2008.275"
    },
    {
      "text": "Ethan Rublee, Vincent Rabaud, Kurt Konolige, and Gary Bradski. 2011. ORB: An Efficient Alternative to SIFT or SURF. In Proceedings of the 2011 International Conference on Computer Vision (ICCV '11). IEEE Computer Society, Washington, DC, USA, 2564--2571. DOI: http://dx.doi.org/10.1109/ICCV.2011.6126544",
      "doi": "10.1109/ICCV.2011.6126544"
    },
    {
      "text": "Eric Saund, David Fleet, Daniel Larner, and James Mahoney. 2003. Perceptually-supported Image Editing of Text and Graphics. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 183--192. DOI: http://dx.doi.org/10.1145/964696.964717",
      "doi": "10.1145/964696.964717"
    },
    {
      "text": "Jianbo Shi and C. Tomasi. 1994. Good features to track. In 1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. IEEE, USA, 593--600. DOI: http://dx.doi.org/10.1109/CVPR.1994.323794",
      "doi": ""
    },
    {
      "text": "Desney S. Tan, Brian Meyers, and Mary Czerwinski. 2004. WinCuts: Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 1525--1528. DOI: http://dx.doi.org/10.1145/985921.986106",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Bret Victor. 2011. Explorable Explanations. (2011). Retrieved April 7th, 2019 from http://worrydream.com/ExplorableExplanations/",
      "doi": ""
    },
    {
      "text": "Bret Victor. 2014. Humane Representation of Thought: A Trail Map for the 21st Century. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 699--699. DOI: http://dx.doi.org/10.1145/2642918.2642920",
      "doi": "10.1145/2642918.2642920"
    },
    {
      "text": "Michelle Q. Wang Baldonado, Allison Woodruff, and Allan Kuchinsky. 2000. Guidelines for Using Multiple Views in Information Visualization. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '00). ACM, NY, NY, USA, 110--119. DOI: http://dx.doi.org/10.1145/345513.345271",
      "doi": "10.1145/345513.345271"
    },
    {
      "text": "Wikipedia. 2005. DTrace. (2005). Retrieved April 7th, 2019 from https://en.wikipedia.org/wiki/DTrace",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2007. EPUB. (2007). Retrieved April 7th, 2019 from https://en.wikipedia.org/wiki/EPUB",
      "doi": ""
    },
    {
      "text": "Ron Yeh, Chunyuan Liao, Scott Klemmer, François Guimbretière, Brian Lee, Boyko Kakaradov, Jeannie Stamberger, and Andreas Paepcke. 2006. ButterflyNet: A Mobile Capture and Access System for Field Biology Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 571--580. DOI: http://dx.doi.org/10.1145/1124772.1124859",
      "doi": "10.1145/1124772.1124859"
    },
    {
      "text": "Tom Yeh, Tsung-Hsiang Chang, and Robert C. Miller. 2009. Sikuli: Using GUI Screenshots for Search and Automation. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 183--192. DOI: http://dx.doi.org/10.1145/1622176.1622213",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "Luke S. Zettlemoyer and Robert St. Amant. 1999. A Visual Medium for Programmatic Control of Interactive Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 199--206. DOI: http://dx.doi.org/10.1145/302979.303039",
      "doi": ""
    }
  ]
}