{
  "doi": "10.1145/3313831.3376522",
  "title": "Designing Voice Interfaces: Back to the (Curriculum) Basics",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Voice user interfaces (VUIs) are rapidly increasing in popularity in the consumer space. This leads to a concurrent explosion of available applications for such devices, with many industries rushing to offer voice interactions for their products. This pressure is then transferred to interface designers; however, a large majority of designers have been only trained to handle the usability challenges specific to Graphical User Interfaces (GUIs). Since VUIs differ significantly in design and usability from GUIs, we investigate in this paper the extent to which current educational resources prepare designers to handle the specific challenges of VUI design. For this, we conducted a preliminary scoping scan and syllabi meta review of HCI curricula at more than twenty top international HCI departments, revealing that the current offering of VUI design training within HCI education is rather limited. Based on this, we advocate for the updating of HCI curricula to incorporate VUI design, and for the development of VUI-specific pedagogical artifacts to be included in new curricula.",
  "tags": [
    "speech",
    "conversational interface",
    "hci curriculum",
    "voice user interface",
    "vui design",
    "hci education"
  ],
  "authors": [
    {
      "name": "Christine Murad",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659302769",
      "orcid": "missing"
    },
    {
      "name": "Cosmin Munteanu",
      "institution": "University of Toronto Mississauga, Mississauga, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100559377",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Matthew P. Aylett, Per Ola Kristensson, Steve Whittaker, and Yolanda Vazquez-Alvarez. 2014. None of a CHInd. Proc. of CHI EA '14: 749--760. https://doi.org/10.1145/2559206.2578868",
      "doi": "10.1145/2559206.2578868"
    },
    {
      "text": "Ali Bicak, Michelle Liu, and Diane Murphy. 2015. Cybersecurity Curriculum Development: Introducing Specialties in a Graduate Program. Retrieved from www.aitp-edsig.org/www.isedj.org",
      "doi": ""
    },
    {
      "text": "Michael Brandse and Kiyoshi Tomimatsu. 2014. Challenge Design and Categorization in Video Game Design. In Proceedings of the Third International Conference on Design, User Experience, and Usability. User Experience Design for Diverse Interaction Platforms and Environments - Volume 8518, 669--677. https://doi.org/10.1007/978--3--31907626--3_63",
      "doi": "10.1007/978-3-319-07626-3_63"
    },
    {
      "text": "Raluca Budiu and Page Laubheimer. Intelligent Assistants Have Poor Usability: A User Study of Alexa, Google Assistant, and Siri. Nielsen Norman Group. Retrieved October 26, 2018 from https://www.nngroup.com/articles/intelligent-assistantusability/",
      "doi": ""
    },
    {
      "text": "Elizabeth Buie, Susan Dray, Keith Instone, Jhilmil Jain, Gitte Lindgaard, and Arnie Lund. 2010. How to bring HCI research and practice closer together. In Proc. of CHI EA '10, 3181. https://doi.org/10.1145/1753846.1753951",
      "doi": "10.1145/1753846.1753951"
    },
    {
      "text": "Eric S Chung, Jason I Hong, James Lin, Madhu K Prabaker, James A Landay, and Alan L Liu. Development and Evaluation of Emerging Design Patterns for Ubiquitous Computing. 10.",
      "doi": ""
    },
    {
      "text": "Elizabeth F Churchill, Anne Bowser, and Jennifer Preece. 2003. Teaching and Learning HumanComputer Interaction: Past, Present, and Future. In Interactions, 20, 2: 44--53",
      "doi": "10.1145/2427076.2427086"
    },
    {
      "text": "Leigh Clark, Phillip Doyle, Diego Garaialde, Emer Gilmartin, Stephan Schlögl, Jens Edlund, Matthew Aylett, João Cabral, Cosmin Munteanu, and Benjamin Cowan. 2018. The State of Speech in HCI: Trends, Themes and Challenges. Proc. of CHI '18. Retrieved November 20, 2018 from http://arxiv.org/abs/1810.06828",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Astrid Weber. 2016. What can I say? Addressing user experience challenges of a mobile voice user interface for accessibility. Proc. of MobileHCI '16: 72--82. https://doi.org/10.1145/2935334.2935386",
      "doi": "10.1145/2935334.2935386"
    },
    {
      "text": "Benjamin R Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. ?What Can I Help You With?\": Infrequent Users' Experiences of Intelligent Personal Assistants. Proc. of MobileHCI '17: 1--12. https://doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Colleen E Crangle, Lawrence M Fagan, Robert W Carlson, Mark S Erlbaum, David D Sherertz, and Mark S Tuttle. 1998. Collaborative conversational interfaces. International Journal of Speech Technology 2: 187--200. https://doi.org/10.1007/BF02111207",
      "doi": ""
    },
    {
      "text": "Sukeshini Grandhi. 2015. Educating ourselves on HCI education. Interactions. Retrieved January 6, 2020 from https://dl.acm.org/doi/abs/10.1145/2834811",
      "doi": ""
    },
    {
      "text": "Thomas T. Hewett, Ronald Baecker, Stuart Card, Tom Carey, Jean Gasen, Marilyn Mantei, Gary Perlman, Gary Strong, and William Verplank. 1992. ACM SIGCHI Curricula for Human-Computer Interaction. Association for Computing Machinery, New York, NY, USA.",
      "doi": "10.1145/2594128"
    },
    {
      "text": "Zayira Jordan, Jose Abdelnour Nocera, Anicia Peters, Susan Dray, and Stephen Kimani. 2016. A Living HCI Curriculum. In Proceedings of the First African Conference on Human Computer Interaction AfriCHI'16, 229--232. https://doi.org/10.1145/2998581.2998623",
      "doi": "10.1145/2998581.2998623"
    },
    {
      "text": "Panayiotis Koutsabasis and Spyros Vosinakis. 2012. Rethinking HCI Education for Design: Problem-Based Learning and Virtual Worlds at an HCI Design Studio. International Journal of Human-Computer Interaction 28, 8: 485--499. https://doi.org/10.1080/10447318.2012.687664",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16: 5286--5297. https://doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Murni Mahmud, Idyawati Hussein, Abu Osman, Md Tap, and Laila Md Noor. 2013. HCI KnowledgeMissing in Practice? https://doi.org/10.1145/2541016.2541077",
      "doi": ""
    },
    {
      "text": "Marilyn Mantei. 1989. An HCI continuing education curriculum for industry. ACM SIGCHI Bulletin. Retrieved January 7, 2020 from https://dl.acm.org/doi/abs/10.1145/67900.67902",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu. 2018. HCI Curriculum Across Disciplinary Borders: a Case Study of Teaching UX outside the Computing Sciences. 4.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu and Gerald Penn. 2018. Speech and Hands-free Interaction: Myths, Challenges, and Opportunities. In Proc of CHI EA '18, 1--4. https://doi.org/10.1145/3170427.3170660",
      "doi": "10.1145/3170427.3170660"
    },
    {
      "text": "Christine Murad and Cosmin Munteanu. 2019. Teaching for Voice: The State of VUI Design in HCI Education. Proceedings of EduCHI 2019 Symposium.",
      "doi": ""
    },
    {
      "text": "Christine Murad, Cosmin Munteanu, Leigh Clark, and Benjamin R. Cowan. 2018. Design guidelines for hands-free speech interaction. In Proc. of MobileHCI '18, 269--276. https://doi.org/10.1145/3236112.3236149",
      "doi": ""
    },
    {
      "text": "Christine Murad, Cosmin Munteanu, Benjamin R. Cowan, and Leigh Clark. 2019. Revolution or Evolution? Speech Interaction and HCI Design Guidelines. IEEE Pervasive Computing 18, 2: 33--45. https://doi.org/10.1109/MPRV.2019.2906991",
      "doi": "10.1109/MPRV.2019.2906991"
    },
    {
      "text": "Jakob Nielsen. 1994. Enhancing the explanatory power of usability heuristics. Proc. of CHI '94: 152-- 158. https://doi.org/10.1145/191666.191729",
      "doi": ""
    },
    {
      "text": "Donald Norman. 1988. The Design of Everyday Things. Doubled Currency.",
      "doi": ""
    },
    {
      "text": "Zeljko Obrenovic. 2012. Rethinking HCI education: teaching interactive computing concepts based on the experiential learning paradigm. In Interactions 19, 3: 66. https://doi.org/10.1145/2168931.2168945",
      "doi": "10.1145/2168931.2168945"
    },
    {
      "text": "Anicia Peters, Zayira Jordan, Luiz Merkle, Mario Moreno Rocha, Jose Abdelnour Nocera, Gerrit C. van der Veer, Susan Dray, Jennifer Preece, and Elizabeth Churchill. 2016. Teaching HCI: A Living Curriculum? In Proc. of AfriCHI'16, 267--270. https://doi.org/10.1145/2998581.2998618",
      "doi": ""
    },
    {
      "text": "Yolanda Jacobs Reimer and Sarah A. Douglas. 2003. Teaching HCI Design With the Studio Approach. Computer Science Education 13, 3: 191--205. https://doi.org/10.1076/csed.13.3.191.14945",
      "doi": ""
    },
    {
      "text": "Helen Sharp, Yvonne Rogers, and Jenny Preece. 2007. Interaction design: beyond human-computer interaction. Book 11: 773. https://doi.org/10.1162/leon.2005.38.5.401",
      "doi": ""
    },
    {
      "text": "J Sherwani, Dong Yu, and Tim Paek. 2007. Voicepedia: towards speech-based access to unstructured information. Interspeech: 2--5. Retrieved from http://research.microsoft.com/pubs/78835/VoicePedia-Interspeech2007.pdf",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2000. The limits of speech recognition. Communications of the ACM 43, 9: 63-- 65. https://doi.org/10.1145/348941.348990",
      "doi": "10.1145/348941.348990"
    },
    {
      "text": "Ben Shneiderman and Catherine Plaisant. 2010. Designing the User Interface: Strategies for Effective Human-Computer Interaction. https://doi.org/10.1016/0166--3615(93)90066-A",
      "doi": ""
    },
    {
      "text": "Olivier St-Cyr, Elizabeth F Churchill, and Craig M MacDonald. EduCHI 2019 Symposium: Global Perspectives on HCI Education. 2019: 7.",
      "doi": ""
    },
    {
      "text": "TJ Strickland. 1995. An information systems perspective of the SIGCHI curricula. ACM SIGCHI Bulletin. Retrieved January 7, 2020 from https://dl.acm.org/doi/abs/10.1145/202511.202513",
      "doi": ""
    },
    {
      "text": "Bernhard Suhm. 2003. Towards Best Practices for Speech User Interface Design. Proc. of EuroSpeech '03: 2217--2220.",
      "doi": ""
    },
    {
      "text": "Alistair Sutcliffe and Brian Gault. 2004. Heuristic evaluation of virtual reality applications. Interacting with Computers 16, 4: 831--849. https://doi.org/10.1016/j.intcom.2004.05.001",
      "doi": ""
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 2000. Emerging frameworks for tangible user interfaces. IBM Systems Journal 39, 3.4: 915--931. https://doi.org/10.1147/sj.393.0915",
      "doi": "10.1147/sj.393.0915"
    },
    {
      "text": "Margaret Urban and Stephen Mailey. 2019. Conversation Design: Principles, Strategies, and Practical Application. In Proc. of CHI EA '19, 1--3. https://doi.org/10.1145/3290607.3298821",
      "doi": "10.1145/3290607.3298821"
    },
    {
      "text": "Zhuxiaona Wei and James Landay. 2018. Evaluating Speech-Based Smart Devices Using New Usability Heuristics. IEEE Pervasive Computing 17, 2: 84--96. https://doi.org/10.1109/MPRV.2018.022511249",
      "doi": "10.1109/MPRV.2018.022511249"
    },
    {
      "text": "Lauren Wilcox, Betsy DiSalvo, Dick Henneman, and Qiaosi Wang. 2019. Design in the HCI Classroom. 871--883. https://doi.org/10.1145/3322276.3322381",
      "doi": ""
    },
    {
      "text": "Lauren Wilcox, Betsy DiSalvo, Richard Henneman, and Lindsay Kelly. 2018. Design and the Future of the HCI Classroom: Lessons Learned from an International Survey on HCI Education. 4.",
      "doi": ""
    },
    {
      "text": "Nicole Yankelovich. 1998. Designing speech user interfaces. In Proceedings of ACM CHI 98, 18--23.",
      "doi": ""
    },
    {
      "text": "Nicole Yankelovich, Gina-Anne Levow, and Matt Marx. 1995. Designing SpeechActs. Proc. of CHI '95: 369--376. https://doi.org/10.1145/223904.223952",
      "doi": ""
    },
    {
      "text": "EduCHI 2019. Retrieved April 11, 2019 from https://educhi2019.hcilivingcurriculum.org/",
      "doi": ""
    },
    {
      "text": "HCI Education Workshop | CHI 2018. Retrieved April 11, 2019 from https://chi2018.hcilivingcurriculum.org/",
      "doi": ""
    },
    {
      "text": "Institutions at CHI 2018. Retrieved February 15, 2019 from http://www.kashyaptodi.com/chi2018/institutions",
      "doi": ""
    },
    {
      "text": "Institutions at CHI 2019. Retrieved January 7, 2020 from http://www.kashyaptodi.com/chi2019/institutions",
      "doi": ""
    },
    {
      "text": "UsableBots - A Tutorial For Better Conversational User Interfaces. Retrieved January 5, 2020 from https://usablebots.tech/",
      "doi": ""
    },
    {
      "text": "Tutorials -- MobileHCI 2018. Retrieved January 6, 2020 from https://mobilehci.acm.org/2018/2018/06/23/tutorials/",
      "doi": ""
    },
    {
      "text": "MCI -- Tutorials -- Mensch und Computer 2019. Retrieved January 5, 2020 from https://muc2019.mensch-und-computer.de/mcitutorials/",
      "doi": ""
    }
  ]
}