{
  "doi": "10.1145/3313831.3376768",
  "title": "Understanding Privacy-Related Questions on Stack Overflow",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "We analyse Stack Overflow (SO) to understand challenges and confusions developers face while dealing with privacy-related topics. We apply topic modelling techniques to 1,733 privacy-related questions to identify topics and then qualitatively analyse a random sample of 315 privacy-related questions. Identified topics include privacy policies, privacy concerns, access control, and version changes. Results show that developers do ask SO for support on privacy-related issues. We also find that platforms such as Apple and Google are defining privacy requirements for developers by specifying what \"sensitive\" information is and what types of information developers need to communicate to users (e.g. privacy policies). We also examine the accepted answers in our sample and find that 28% of them link to official documentation and more than half are answered by SO users without references to any external resources.",
  "tags": [
    "usable privacy",
    "software developers",
    "stack overflow"
  ],
  "authors": [
    {
      "name": "Mohammad Tahaei",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-99659444566/rel-imgonly/0a043614-5f87-40b6-a4bb-04b32c289bda.jpeg",
      "acmid": "99659444566",
      "orcid": "0000-0001-9666-2663"
    },
    {
      "name": "Kami Vaniea",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81335498861/rel-imgonly/81335498861.jpg",
      "acmid": "81335498861",
      "orcid": "missing"
    },
    {
      "name": "Naomi Saphra",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650912",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Yasemin Acar, Michael Backes, Sascha Fahl, Simson Garfinkel, Doowon Kim, Michelle L Mazurek, and Christian Stransky. 2017. Comparing the Usability of Cryptographic APIs. In 2017 IEEE Symposium on Security and Privacy (SP). 154--171. DOI: http://dx.doi.org/10.1109/SP.2017.52",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Michael Backes, Sascha Fahl, Doowon Kim, Michelle L Mazurek, and Christian Stransky. 2016. You Get Where You're Looking for: The Impact of Information Sources on Code Security. In 2016 IEEE Symposium on Security and Privacy (SP). 289--305. DOI: http://dx.doi.org/10.1109/SP.2016.25",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Michael Backes, Sascha Fahl, Doowon Kim, Michelle L Mazurek, and Christian Stransky. 2017. How Internet Resources Might Be Helping You Develop Faster but Less Securely. IEEE Security Privacy 15, 2 (March 2017), 50--60. DOI: http://dx.doi.org/10.1109/MSP.2017.24",
      "doi": "10.1109/MSP.2017.24"
    },
    {
      "text": "Alexa. 2019. stackoverflow.com. Retrieved September 2019 from https://www.alexa.com/siteinfo/stackoverflow.com",
      "doi": ""
    },
    {
      "text": "Miltiadis Allamanis and Charles Sutton. 2013. Why, when, and what: Analyzing Stack Overflow questions by topic, type, and code. In 2013 10th Working Conference on Mining Software Repositories (MSR). 53--56. DOI: http://dx.doi.org/10.1109/MSR.2013.6624004",
      "doi": ""
    },
    {
      "text": "Le An, Ons Mlouki, Foutse Khomh, and Giuliano Antoniol. 2017. Stack Overflow: A code laundering platform?. In 2017 IEEE 24th International Conference on Software Analysis, Evolution and Reengineering (SANER). 283--293. DOI: http://dx.doi.org/10.1109/SANER.2017.7884629",
      "doi": ""
    },
    {
      "text": "Benjamin Andow, Samin Yaseer Mahmud, Wenyu Wang, Justin Whitaker, William Enck, Bradley Reaves, Kapil Singh, and Tao Xie. 2019. PolicyLint: Investigating Internal Privacy Policy Contradictions on Google Play. In 28th USENIX Security Symposium (USENIX Security 19). USENIX Association, Santa Clara, CA, 585--602. https://www.usenix.org/ conference/usenixsecurity19/presentation/andow",
      "doi": ""
    },
    {
      "text": "Apple App Store. 2019. App Review. Retrieved September 2019 from https://developer.apple.com/app-store/review",
      "doi": ""
    },
    {
      "text": "Apple Developer Documentation. 2019. Accessing Protected Resources. Retrieved September 2019 from https://developer.apple.com/documentation/uikit/protecting_ the_user_s_privacy/accessing_protected_resources",
      "doi": ""
    },
    {
      "text": "Hala Assal and Sonia Chiasson. 2018. Security in the Software Development Lifecycle. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, 281--296. https://www.usenix.org/conference/soups2018/ presentation/assal",
      "doi": ""
    },
    {
      "text": "Hala Assal and Sonia Chiasson. 2019. \"Think Secure from the Beginning': A Survey with Software Developers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 289, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300519",
      "doi": "10.1145/3290605.3300519"
    },
    {
      "text": "Hala Assal, Sonia Chiasson, and Robert Biddle. 2016. Cesar: Visual representation of source code vulnerabilities. In 2016 IEEE Symposium on Visualization for Cyber Security (VizSec). 1--8. DOI: http://dx.doi.org/10.1109/VIZSEC.2016.7739576",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako and Lorrie Cranor. 2014. Improving App Privacy: Nudging App Developers to Protect User Privacy. IEEE Security Privacy 12, 4 (July 2014), 55--58. DOI: http://dx.doi.org/10.1109/MSP.2014.70",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Abigail Marsh, Jialiu Lin, Jason I Hong, and Lorrie Cranor. 2014. The privacy and security behaviors of smartphone app developers. In Workshop on Usable Security (USEC'14). Internet Society. DOI: http://dx.doi.org/10.14722/usec.2014.23006",
      "doi": ""
    },
    {
      "text": "Derek E. Bambauer. 2013. Privacy versus Security. Journal of Criminal Law and Criminology 103 (2013), 667--684. https://ssrn.com/abstract=2208824",
      "doi": ""
    },
    {
      "text": "Anton Barua, Stephen W. Thomas, and Ahmed E. Hassan. 2014. What are developers talking about? An analysis of topics and trends in Stack Overflow. Empirical Software Engineering 19, 3 (Jun 2014), 619--654. DOI: http://dx.doi.org/10.1007/s10664-012--9231-y",
      "doi": "10.1007/s10664-012-9231-y"
    },
    {
      "text": "Kathrin Bednar, Sarah Spiekermann, and Marc Langheinrich. 2019. Engineering Privacy by Design: Are engineers ready to live up to the challenge? The Information Society 35, 3 (2019), 122--142. DOI: http://dx.doi.org/10.1080/01972243.2019.1583296",
      "doi": ""
    },
    {
      "text": "Stefanie Beyer and Martin Pinzger. 2014. A Manual Categorization of Android App Development Issues on Stack Overflow. In 2014 IEEE International Conference on Software Maintenance and Evolution. 531--535. DOI: http://dx.doi.org/10.1109/ICSME.2014.88",
      "doi": "10.1109/ICSME.2014.88"
    },
    {
      "text": "David M. Blei, Andrew Y. Ng, and Michael I. Jordan. 2003. Latent Dirichlet Allocation. Journal of Machine Learning Research 3 (March 2003), 993--1022. http://dl.acm.org/citation.cfm?id=944919.944937",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Ann Cavoukian. 2009. Privacy by design: The 7 foundational principles. Information and Privacy Commissioner of Ontario, Canada 5 (2009). https://iab.org/wp-content/IAB-uploads/2011/03/fred_ carter.pdf",
      "doi": ""
    },
    {
      "text": "Ann Cavoukian, Scott Taylor, and Martin E. Abrams. 2010. Privacy by Design: essential for organizational accountability and strong business practices. Identity in the Information Society 3, 2 (01 Aug 2010), 405--413. DOI: http://dx.doi.org/10.1007/s12394-010-0053-z",
      "doi": ""
    },
    {
      "text": "Lisa Nguyen Quang Do, Karim Ali, Benjamin Livshits, Eric Bodden, Justin Smith, and Emerson Murphy-Hill. 2017. Just-in-time Static Analysis. In Proceedings of the 26th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2017). ACM, NY, NY, USA, 307--317. DOI: http://dx.doi.org/10.1145/3092703.3092705",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Ken Anderson. 2006. Collective Information Practice: Exploring Privacy and Security as Social and Cultural Phenomena. Human-Computer Interaction 21, 3 (2006), 319--342. DOI: http://dx.doi.org/10.1207/s15327051hci2103_2",
      "doi": "10.1207/s15327051hci2103_2"
    },
    {
      "text": "Manuel Egele, David Brumley, Yanick Fratantonio, and Christopher Kruegel. 2013. An Empirical Study of Cryptographic Misuse in Android Applications. In Proceedings of the 2013 ACM SIGSAC Conference on Computer & Communications Security (CCS '13). ACM, NY, NY, USA, 73--84. DOI: http://dx.doi.org/10.1145/2508859.2516693",
      "doi": "10.1145/2508859.2516693"
    },
    {
      "text": "Sascha Fahl, Marian Harbach, Henning Perl, Markus Koetter, and Matthew Smith. 2013. Rethinking SSL Development in an Appified World. In Proceedings of the 2013 ACM SIGSAC Conference on Computer & Communications Security (CCS '13). ACM, NY, NY, USA, 49--60. DOI: http://dx.doi.org/10.1145/2508859.2516655",
      "doi": "10.1145/2508859.2516655"
    },
    {
      "text": "Felix Fischer, Konstantin Böttinger, Huang Xiao, Christian Stransky, Yasemin Acar, Michael Backes, and Sascha Fahl. 2017. Stack Overflow Considered Harmful? The Impact of Copy Paste on Android Application Security. In 2017 IEEE Symposium on Security and Privacy (SP). 121--136. DOI: http://dx.doi.org/10.1109/SP.2017.31",
      "doi": ""
    },
    {
      "text": "Martin Georgiev, Subodh Iyengar, Suman Jana, Rishita Anubhai, Dan Boneh, and Vitaly Shmatikov. 2012. The Most Dangerous Code in the World: Validating SSL Certificates in Non-browser Software. In Proceedings of the 2012 ACM Conference on Computer and Communications Security (CCS '12). ACM, NY, NY, USA, 38--49. DOI: http://dx.doi.org/10.1145/2382196.2382204",
      "doi": "10.1145/2382196.2382204"
    },
    {
      "text": "Google. 2019. Privacy & Terms. Retrieved September 2019 from https://policies.google.com/terms",
      "doi": ""
    },
    {
      "text": "Google Developers. 2019. Manifest.permission. Retrieved September 2019 from https://developer.android.com/reference/android/ Manifest.permission.html",
      "doi": ""
    },
    {
      "text": "Matthew Green and Matthew Smith. 2016. Developers Are Not the Enemy!: The Need for Usable Security APIs. IEEE Security and Privacy 14, 5 (Sept. 2016), 40--46. DOI: http://dx.doi.org/10.1109/MSP.2016.111",
      "doi": "10.1109/MSP.2016.111"
    },
    {
      "text": "Daniel Greene and Katie Shilton. 2018. Platform privacies: Governance, collaboration, and the different meanings of \"privacy\" in iOS and Android development. New Media & Society 20, 4 (2018), 1640--1657. DOI: http://dx.doi.org/10.1177/1461444817702397",
      "doi": ""
    },
    {
      "text": "Seda Gürses, Carmela Troncoso, and Claudia Diaz. 2011. Engineering privacy by design. Computers, Privacy & Data Protection 14, 3 (2011), 25. https://software.imdea.org/~carmela.troncoso/papers/ Gurses-CPDP11.pdf",
      "doi": ""
    },
    {
      "text": "Irit Hadar, Tomer Hasson, Oshrat Ayalon, Eran Toch, Michael Birnhack, Sofia Sherman, and Arod Balissa. 2018. Privacy by designers: software developers' privacy mindset. Empirical Software Engineering 23, 1 (Feb 2018), 259--289. DOI: http://dx.doi.org/10.1007/s10664-017--9517--1",
      "doi": "10.1007/s10664-017-9517-1"
    },
    {
      "text": "Hamza Harkous, Kassem Fawaz, Rémi Lebret, Florian Schaub, Kang G. Shin, and Karl Aberer. 2018. Polisis: Automated Analysis and Presentation of Privacy Policies Using Deep Learning. In 27th USENIX Security Symposium (USENIX Security 18). USENIX Association, Baltimore, MD, 531--548. https://www.usenix.org/conference/usenixsecurity18/ presentation/harkous",
      "doi": "10.5555/3277203.3277243"
    },
    {
      "text": "Jaap-Henk Hoepman. 2019. Privacy Design Strategies (The Little Blue Book). Radboud University. https://cs.ru.nl/~jhh/publications/pds-booklet.pdf",
      "doi": ""
    },
    {
      "text": "Nasif Imtiaz, Akond Rahman, Effat Farhana, and Laurie Williams. 2019. Challenges with Responding to Static Analysis Tool Alerts. In Proceedings of the 16th International Conference on Mining Software Repositories (MSR '19). IEEE Press, Piscataway, NJ, USA, 245--249. DOI: http://dx.doi.org/10.1109/MSR.2019.00049",
      "doi": "10.1109/MSR.2019.00049"
    },
    {
      "text": "Shubham Jain, Janne Lindqvist, and others. 2014. Should I protect you? Understanding developers' behavior to privacy-preserving APIs. In Workshop on Usable Security (USEC'14). Internet Society. DOI: http://dx.doi.org/10.14722/usec.2014.23045",
      "doi": ""
    },
    {
      "text": "Brittany Johnson, Yoonki Song, Emerson Murphy-Hill, and Robert Bowdidge. 2013. Why Don't Software Developers Use Static Analysis Tools to Find Bugs?. In Proceedings of the 2013 International Conference on Software Engineering (ICSE '13). IEEE Press, Piscataway, NJ, USA, 672--681. DOI: http://dx.doi.org/10.1109/ICSE.2013.6606613",
      "doi": "10.5555/2486788.2486877"
    },
    {
      "text": "Bert-Jaap Koops, Jaap-Henk Hoepman, and Ronald Leenes. 2013. Open-source intelligence and privacy by design. Computer Law & Security Review 29, 6 (2013), 676 -- 688. http://www.sciencedirect.com/science/ article/pii/S0267364913001672",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Chapter 8 - Interviews and focus groups. In Research Methods in Human Computer Interaction (second edition ed.), Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser (Eds.). Morgan Kaufmann, Boston, 187 -- 228. DOI: http://dx.doi.org/10.1016/B978-0--12--805390--4.00008-X",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Tianshi Li, Yuvraj Agarwal, and Jason I. Hong. 2018. Coconut: An IDE Plugin for Developing Privacy-Friendly Apps. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4, Article 178 (Dec. 2018), 35 pages. DOI: http://dx.doi.org/10.1145/3287056",
      "doi": ""
    },
    {
      "text": "Yuanchun Li, Fanglin Chen, Toby Jia-Jun Li, Yao Guo, Gang Huang, Matthew Fredrikson, Yuvraj Agarwal, and Jason I. Hong. 2017. PrivacyStreams: Enabling Transparency in Personal Data Processing for Mobile Apps. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 76 (Sept. 2017), 26 pages. DOI: http://dx.doi.org/10.1145/3130941",
      "doi": ""
    },
    {
      "text": "Tamara Lopez, Thein Tun, Arosha Bandara, Mark Levine, Bashar Nuseibeh, and Helen Sharp. 2019. An Anatomy of Security Conversations in Stack Overflow. In Proceedings of the 41st International Conference on Software Engineering: Software Engineering in Society (ICSE-SEIS '10). IEEE Press, Piscataway, NJ, USA, 31--40. DOI: http://dx.doi.org/10.1109/ICSE-SEIS.2019.00012",
      "doi": "10.1109/ICSE-SEIS.2019.00012"
    },
    {
      "text": "Tamara Lopez, Thein T. Tun, Arosha Bandara, Mark Levine, Bashar Nuseibeh, and Helen Sharp. 2018. An Investigation of Security Conversations in Stack Overflow: Perceptions of Security and Community Involvement. In Proceedings of the 1st International Workshop on Security Awareness from Design to Deployment (SEAD '18). ACM, NY, NY, USA, 26--32. DOI: http://dx.doi.org/10.1145/3194707.3194713",
      "doi": "10.1145/3194707.3194713"
    },
    {
      "text": "Lena Mamykina, Bella Manoim, Manas Mittal, George Hripcsak, and Björn Hartmann. 2011. Design Lessons from the Fastest Q&A Site in the West. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2857--2866. DOI: http://dx.doi.org/10.1145/1978942.1979366",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Abraham H. Mhaidli, Yixin Zou, and Florian Schaub. 2019. \"We Can't Live Without Them!\" App Developers' Adoption of Ad Networks and Their Considerations of Consumer Risks. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). USENIX Association, Santa Clara, CA. https://www.usenix.org/ conference/soups2019/presentation/mhaidli",
      "doi": ""
    },
    {
      "text": "Sarah Nadi, Stefan Krüger, Mira Mezini, and Eric Bodden. 2016. Jumping Through Hoops: Why Do Java Developers Struggle with Cryptography APIs?. In 2016 IEEE/ACM 38th International Conference on Software Engineering (ICSE). 935--946. DOI: http://dx.doi.org/10.1145/2884781.2884790",
      "doi": "10.1145/2884781.2884790"
    },
    {
      "text": "Seyed Mehdi Nasehi, Jonathan Sillito, Frank Maurer, and Chris Burns. 2012. What makes a good code example?: A study of programming Q A in StackOverflow. In 2012 28th IEEE International Conference on Software Maintenance (ICSM). 25--34. DOI: http://dx.doi.org/10.1109/ICSM.2012.6405249",
      "doi": "10.1109/ICSM.2012.6405249"
    },
    {
      "text": "Duc Cuong Nguyen, Dominik Wermke, Yasemin Acar, Michael Backes, Charles Weir, and Sascha Fahl. 2017. A Stitch in Time: Supporting Android Developers in WritingSecure Code. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (CCS '17). ACM, NY, NY, USA, 1065--1077. DOI: http://dx.doi.org/10.1145/3133956.3133977",
      "doi": "10.1145/3133956.3133977"
    },
    {
      "text": "OWASP. 2017. Top 10 - 2017 The ten most critical web application security risks. Technical Report. The OWASP Foundation. https://www.owasp.org/index.php/Category: OWASP_Top_Ten_Project",
      "doi": ""
    },
    {
      "text": "Chris Parnin, Christoph Treude, Lars Grammel, and Margaret-Anne Storey. 2012. Crowd documentation: Exploring the coverage and the dynamics of API discussions on Stack Overflow. Georgia Institute of Technology, Tech. Rep 11 (2012). http://citeseerx.ist. psu.edu/viewdoc/summary?doi=10.1.1.371.6263",
      "doi": ""
    },
    {
      "text": "Nikhil Patnaik, Joseph Hallett, and Awais Rashid. 2019. Usability Smells: An Analysis of Developers' Struggle With Crypto Libraries. In Fifteenth Symposium on Usable Privacy and Security (SOUPS). USENIX Association. https://www.usenix.org/conference/ soups2019/presentation/patnaik",
      "doi": ""
    },
    {
      "text": "Olgierd Pieczul, Simon Foley, and Mary Ellen Zurko. 2017. Developer-centered Security and the Symmetry of Ignorance. In Proceedings of the 2017 New Security Paradigms Workshop (NSPW 2017). ACM, NY, NY, USA, 46--56. DOI: http://dx.doi.org/10.1145/3171533.3171539",
      "doi": "10.1145/3171533.3171539"
    },
    {
      "text": "Chaiyong Ragkhitwetsagul, Jens Krinke, Matheus Paixao, Giuseppe Bianco, and Rocco Oliveto. 2019. Toxic Code Snippets on Stack Overflow. IEEE Transactions on Software Engineering (2019), 1--22. DOI: http://dx.doi.org/10.1109/TSE.2019.2900307",
      "doi": ""
    },
    {
      "text": "Akond Rahman, Asif Partho, Patrick Morrison, and Laurie Williams. 2018. What Questions Do Programmers Ask About Configuration As Code?. In Proceedings of the 4th International Workshop on Rapid Continuous Software Engineering (RCoSE '18). ACM, NY, NY, USA, 16--22. DOI: http://dx.doi.org/10.1145/3194760.3194769",
      "doi": "10.1145/3194760.3194769"
    },
    {
      "text": "Christoffer Rosen and Emad Shihab. 2016. What are mobile developers asking about? A large scale study using stack overflow. Empirical Software Engineering 21, 3 (Jun 2016), 1192--1223. DOI: http://dx.doi.org/10.1007/s10664-015--9379--3",
      "doi": "10.1007/s10664-015-9379-3"
    },
    {
      "text": "Neil Salkind. 2019. Encyclopedia of Research Design. (Sept. 2019). DOI: http://dx.doi.org/10.4135/9781412961288",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, and Lorrie Faith Cranor. 2017. Designing Effective Privacy Notices and Controls. IEEE Internet Computing 21, 3 (May 2017), 70--77. DOI: http://dx.doi.org/10.1109/MIC.2017.75",
      "doi": "10.1109/MIC.2017.75"
    },
    {
      "text": "Awanthika Senarath and Nalin A. G. Arachchilage. 2018. Why Developers Cannot Embed Privacy into Software Systems?: An Empirical Investigation. In Proceedings of the 22Nd International Conference on Evaluation and Assessment in Software Engineering 2018 (EASE'18). ACM, NY, NY, USA, 211--216. DOI: http://dx.doi.org/10.1145/3210459.3210484",
      "doi": ""
    },
    {
      "text": "Katie Shilton and Daniel Greene. 2019. Linking Platforms, Practices, and Developer Ethics: Levers for Privacy Discourse in Mobile Application Development. Journal of Business Ethics 155, 1 (Mar 2019), 131--146. DOI: http://dx.doi.org/10.1007/s10551-017--3504--8",
      "doi": ""
    },
    {
      "text": "H. Jeff Smith, Tamara Dinev, and Heng Xu. 2011. Information Privacy Research: An Interdisciplinary Review. MIS Q. 35, 4 (Dec. 2011), 989--1016. http://dl.acm.org/citation.cfm?id=2208940.2208950",
      "doi": ""
    },
    {
      "text": "Daniel J Solove. 2005. A taxonomy of privacy. University of Pennsylvania Law Review 154 (2005), 477--560. https://ssrn.com/abstract=667622",
      "doi": ""
    },
    {
      "text": "spaCy. 2019. spaCy - Industrial-strength Natural Language Processing in Python. Retrieved September 2019 from https://spacy.io",
      "doi": ""
    },
    {
      "text": "Sarah Spiekermann and Lorrie Faith Cranor. 2009. Engineering Privacy. IEEE Transactions on Software Engineering 35, 1 (Jan 2009), 67--82. DOI: http://dx.doi.org/10.1109/TSE.2008.88",
      "doi": "10.1109/tse.2008.88"
    },
    {
      "text": "Stack Exchange. 2019. Stack Exchange Data Explorer. Retrieved September 2019 from https://data.stackexchange.com",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2019a. About. Retrieved September 2019 from https://stackoverflow.com/company",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2019b. Developer Survey Results. Retrieved August 2019 from https://insights.stackoverflow.com/survey/2019",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2019c. What does it mean when an answer is \"accepted\"? Retrieved September 2019 from https://stackoverflow.com/help/accepted-answer",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2019d. Where Developers Learn, Share, & Build Careers. Retrieved September 2019 from https://stackoverflow.com",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei and Kami Vaniea. 2019. A Survey on Developer-Centred Security. In 2019 IEEE European Symposium on Security and Privacy Workshops (EuroS PW). 129--138. DOI: http://dx.doi.org/10.1109/EuroSPW.2019.00021",
      "doi": ""
    },
    {
      "text": "Christoph Treude, Ohad Barzilay, and Margaret-Anne Storey. 2011. How Do Programmers Ask and Answer Questions on the Web? (NIER Track). In Proceedings of the 33rd International Conference on Software Engineering (ICSE '11). ACM, NY, NY, USA, 804--807. DOI: http://dx.doi.org/10.1145/1985793.1985907",
      "doi": "10.1145/1985793.1985907"
    },
    {
      "text": "Yung Shin Van Der Sype and Walid Maalej. 2014. On lawful disclosure of personal user data: What should app developers do?. In 2014 IEEE 7th International Workshop on Requirements Engineering and Law (RELAW). 25--34. DOI: http://dx.doi.org/10.1109/RELAW.2014.6893479",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2019. Bringing Design to the Privacy Table: Broadening \"Design\" in \"Privacy by Design\" Through the Lens of HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 262, 17 pages. DOI: http://dx.doi.org/10.1145/3290605.3300492",
      "doi": ""
    },
    {
      "text": "Yuhao Wu, Shaowei Wang, Cor-Paul Bezemer, and Katsuro Inoue. 2019. How do developers utilize source code from stack overflow? Empirical Software Engineering 24, 2 (Apr 2019), 637--673. DOI: http://dx.doi.org/10.1007/s10664-018--9634--5",
      "doi": "10.1007/s10664-018-9634-5"
    },
    {
      "text": "Jing Xie, Heather Richter Lipford, and Bill Chu. 2011. Why do programmers make security errors?. In 2011 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 161--164. DOI: http://dx.doi.org/10.1109/VLHCC.2011.6070393",
      "doi": ""
    },
    {
      "text": "Xin-Li Yang, David Lo, Xin Xia, Zhi-Yuan Wan, and Jian-Ling Sun. 2016. What Security Questions Do Developers Ask? A Large-Scale Study of Stack Overflow Posts. Journal of Computer Science and Technology 31, 5 (Sep 2016), 910--924. DOI: http://dx.doi.org/10.1007/s11390-016--1672-0",
      "doi": ""
    },
    {
      "text": "Sebastian Zimmeck, Peter Story, Daniel Smullen, Abhilasha Ravichander, Ziqi Wang, Joel Reidenberg, N. Cameron Russell, and Norman Sadeh. 2019. MAPS: Scaling Privacy Compliance Analysis to a Million Apps. Proceedings on Privacy Enhancing Technologies 2019, 3 (2019), 66 -- 86. DOI: http://dx.doi.org/10.2478/popets-2019-0037",
      "doi": ""
    }
  ]
}