{
  "doi": "10.1145/3313831.3376856",
  "title": "Household Surface Interactions: Understanding User Input Preferences and Perceived Home Experiences",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Households contain a variety of surfaces that are used in a number of activity contexts. As ambient technology becomes commonplace in our homes, it is only a matter of time before these surfaces become linked to computer systems for Household Surface Interaction (HSI). However, little is known about the user experience attached to HSI, and the potential acceptance of HSI within modern homes. To address this problem, we ran a mixed methods user study with 39 participants to examine HSI using nine household surfaces and five common gestures (tap, press, swipe, drag, and pinch). We found that under the right conditions, surfaces with some amount of texture can enhance HSI. Furthermore, perceived good and poor user experience varied among participants for surface type indicating individual preferences. We present findings and design considerations based on surface characteristics and the challenges that users perceive they may have with HSI within their homes.",
  "authors": [
    {
      "name": "Garreth W. Tigwell",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-99659067691/rel-imgonly/img_20170512_13473021.09.44.jpg",
      "acmid": "99659067691",
      "orcid": "0000-0002-3123-6361"
    },
    {
      "name": "Michael Crabb",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-81556562156/rel-imgonly/200x200.png",
      "acmid": "81556562156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hamed S. Alavi, Elizabeth F. Churchill, Mikael Wiberg, Denis Lalanne, Peter Dalsgaard, Ava Fatah Gen Schieck, and Yvonne Rogers. 2019. Introduction to Human-Building Interaction (HBI): Interfacing HCI with Architecture and Urban Design. ACM Trans. Comput.-Hum. Interact. 26, 2, Article 6 (March 2019), 10 pages. DOI: http://dx.doi.org/10.1145/3309714",
      "doi": "10.1145/3309714"
    },
    {
      "text": "Olivier Bau and Ivan Poupyrev. 2012. REVEL: Tactile Feedback Technology for Augmented Reality. ACM Trans. Graph. 31, 4, Article 89 (July 2012), 11 pages. DOI: http://dx.doi.org/10.1145/2185520.2185585",
      "doi": "10.1145/2185520.2185585"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2011. Lessons Learned from the WILD Room, a Multisurface Interactive Environment. In Proceedings of the 23rd Conference on L'Interaction Homme-Machine (IHM '11). ACM, NY, NY, USA, Article 18, 8 pages. DOI: http://dx.doi.org/10.1145/2044354.2044376",
      "doi": "10.1145/2044354.2044376"
    },
    {
      "text": "Hrvoje Benko, Ricardo Jota, and Andrew Wilson. 2012. MirageTable: Freehand Interaction on a Projected Augmented Reality Tabletop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 199--208. DOI: http://dx.doi.org/10.1145/2207676.2207704",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "O. Bimber, A. Emmerling, and T. Klemmer. 2005. Embedded entertainment with smart projectors. Computer 38, 1 (Jan 2005), 48--55. DOI: http://dx.doi.org/10.1109/MC.2005.17",
      "doi": "10.1109/MC.2005.17"
    },
    {
      "text": "Leonardo Bonanni and Chia-Hsun Lee. 2004. The Kitchen As a Graphical User Interface. In ACM SIGGRAPH 2004 Art Gallery (SIGGRAPH '04). ACM, NY, NY, USA, 109--111. DOI: http://dx.doi.org/10.1145/1185884.1185989",
      "doi": "10.1145/1185884.1185989"
    },
    {
      "text": "Leonardo Bonanni, Chia-Hsun Lee, and Ted Selker. 2005. Cooking with the Elements: Intuitive Immersive Interfaces for Augmented Reality Environments. In Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (INTERACT'05). Springer-Verlag, Berlin, Heidelberg, 1022--1025. DOI: http://dx.doi.org/10.1007/11555261_95",
      "doi": "10.1007/11555261_95"
    },
    {
      "text": "Keith Bright and Geoff Cook. 2010. The colour, light and contrast manual: designing and managing inclusive built environments. Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "Gabe Cohn, Daniel Morris, Shwetak N. Patel, and Desney S. Tan. 2011. Your Noise is My Command: Sensing Gestures Using the Body As an Antenna. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 791--800. DOI: http://dx.doi.org/10.1145/1978942.1979058",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Peter Tolmie. 2016. A Day in the Life of Things in the Home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). Association for Computing Machinery, New York, NY, USA, 1738--1750. DOI: http://dx.doi.org/10.1145/2818048.2819954",
      "doi": "10.1145/2818048.2819954"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K. Dey. 2006. Principles of Smart Home Control. In UbiComp 2006: Ubiquitous Computing, Paul Dourish and Adrian Friday (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 19--34. DOI: http://dx.doi.org/10.1007/11853565_2",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Tanja Döring. 2016. The Interaction Material Profile: Understanding and Inspiring How Physical Materials Shape Interaction. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 2446--2453. DOI: http://dx.doi.org/10.1145/2851581.2892516",
      "doi": "10.1145/2851581.2892516"
    },
    {
      "text": "Tanja Döring, Axel Sylvester, and Albrecht Schmidt. 2012. Exploring Material-centered Design Concepts for Tangible Interaction. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 1523--1528. DOI: http://dx.doi.org/10.1145/2212776.2223666",
      "doi": ""
    },
    {
      "text": "Peter Elliott and Graeme Hawthorne. 2005. Imputing missing repeated measures data: how should we proceed? Australian and New Zealand Journal of Psychiatry 39, 7 (2005), 575--582. DOI: http://dx.doi.org/10.1080/j.1440--1614.2005.01629.x",
      "doi": ""
    },
    {
      "text": "Andy Field. 2013. Discovering statistics using IBM SPSS statistics. sage.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z. Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2008. Improving the Performance of Motor-Impaired Users with Automatically-Generated, Ability-Based Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). Association for Computing Machinery, New York, NY, USA, 1257--1266. DOI: http://dx.doi.org/10.1145/1357054.1357250",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Elisa Giaccardi and Elvin Karana. 2015. Foundations of Materials Experience: An Approach for HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2447--2456. DOI: http://dx.doi.org/10.1145/2702123.2702337",
      "doi": "10.1145/2702123.2702337"
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: Using Hand Posture Information to Improve Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). Association for Computing Machinery, New York, NY, USA, 2795--2798. DOI: http://dx.doi.org/10.1145/2470654.2481386",
      "doi": ""
    },
    {
      "text": "Barry G Green, Susan J Lederman, and Joseph C Stevens. 1979. The effect of skin temperature on the perception of roughness. Sensory processes 3, 4 (1979), 327--333.",
      "doi": ""
    },
    {
      "text": "Jonna Häkkilä and Ashley Colley. 2016. Towards a Design Space for Liquid User Interfaces. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, NY, NY, USA, Article 34, 4 pages. DOI: http://dx.doi.org/10.1145/2971485.2971537",
      "doi": "10.1145/2971485.2971537"
    },
    {
      "text": "Jonna Häkkila, Yun He, and Ashley Colley. 2015. Experiencing the Elements -- User Study with Natural Material Probes. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 324--331.",
      "doi": "10.1007/978-3-319-22701-6_24"
    },
    {
      "text": "Jonna Häkkilä, Olli Koskenranta, Maaret Posti, and Yun He. 2013. City Landmark As an Interactive Installation: Experiences with Stone, Water and Public Space. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, NY, NY, USA, 221--224. DOI: http://dx.doi.org/10.1145/2540930.2540980",
      "doi": "10.1145/2540930.2540980"
    },
    {
      "text": "Sarah Hayes, Trevor Hogan, and Kieran Delaney. 2017. Exploring the Materials of TUIs: A Multi-Method Approach. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, NY, NY, USA, 55--60. DOI: http://dx.doi.org/10.1145/3064857.3079119",
      "doi": "10.1145/3064857.3079119"
    },
    {
      "text": "A. Hryniowski, I. B. Daya, A. Gawish, M. Lamm, A. Wong, and P. Fieguth. 2018. Multi-projector Resolution Enhancement Through Biased Interpolation. In 2018 15th Conference on Computer and Robot Vision (CRV). 190--197. DOI: http://dx.doi.org/10.1109/CRV.2018.00035",
      "doi": ""
    },
    {
      "text": "E. A. Johnson. 1965. Touch display--a novel input/output device for computers. Electronics Letters 1, 8 (October 1965), 219--220. DOI: http://dx.doi.org/10.1049/el:19650200",
      "doi": ""
    },
    {
      "text": "Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: Peripheral Projected Illusions for Interactive Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 869--878. DOI: http://dx.doi.org/10.1145/2470654.2466112",
      "doi": ""
    },
    {
      "text": "Wendy Ju, Leonardo Bonanni, Richard Fletcher, Rebecca Hurwitz, Tilke Judd, Rehmi Post, Matthew Reynolds, and Jennifer Yoon. 2002. Origami Desk: Integrating Technological Innovation and Human-centric Design. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, NY, NY, USA, 399--405. DOI: http://dx.doi.org/10.1145/778712.778770",
      "doi": "10.1145/778712.778770"
    },
    {
      "text": "Heekyoung Jung and Erik Stolterman. 2010. Material Probe: Exploring Materiality of Digital Artifacts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). Association for Computing Machinery, New York, NY, USA, 153--156. DOI: http://dx.doi.org/10.1145/1935701.1935731",
      "doi": "10.1145/1935701.1935731"
    },
    {
      "text": "Heekyoung Jung and Erik Stolterman. 2011. Form and Materiality in Interaction Design: A New Approach to HCI. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 399--408. DOI: http://dx.doi.org/10.1145/1979742.1979619",
      "doi": "10.1145/1979742.1979619"
    },
    {
      "text": "Hideki Koike, Yoichi Sato, Yoshinori Kobayashi, Hiroaki Tobita, and Motoki Kobayashi. 2000. Interactive Textbook and Interactive Venn Diagram: Natural and Intuitive Interfaces on Augmented Desk System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 121--128. DOI: http://dx.doi.org/10.1145/332040.332415",
      "doi": "10.1145/332040.332415"
    },
    {
      "text": "S J Lederman. 1976. The \"callus-thenics\" of touching. (1976). DOI: http://dx.doi.org/10.1037/h0082051",
      "doi": ""
    },
    {
      "text": "Chia-Hsun Lee, Leonardo Bonnani, and Ted Selker. 2005. Augmented Reality Kitchen: Enhancing Human Sensibility in Domestic Life. In ACM SIGGRAPH 2005 Posters (SIGGRAPH '05). ACM, NY, NY, USA, Article 60. DOI: http://dx.doi.org/10.1145/1186954.1187022",
      "doi": "10.1145/1186954.1187022"
    },
    {
      "text": "David Lindlbauer, Jens Emil Grønbæk, Morten Birk, Kim Halskov, Marc Alexa, and Jörg Müller. 2016. Combining Shape-Changing Interfaces and Spatial Augmented Reality Enables Extended Object Appearance. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 791--802. DOI: http://dx.doi.org/10.1145/2858036.2858457",
      "doi": "10.1145/2858036.2858457"
    },
    {
      "text": "Nobuyuki Matsushita and Jun Rekimoto. 1997. HoloWall: Designing a Finger, Hand, Body, and Object Sensitive Wall. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (UIST '97). ACM, NY, NY, USA, 209--210. DOI: http://dx.doi.org/10.1145/263407.263549",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "Shree K Nayar, Harish Peri, Michael D Grossberg, and Peter N Belhumeur. A projection system with radiometric compensation for screen imperfections. Citeseer.",
      "doi": ""
    },
    {
      "text": "Ofcom. 2018. The Communications Market Report. (2018). https://www.ofcom.org.uk/research-and-data/multi-sector-research/cmr/cmr-2018",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Shigeaki Maruyama, and Jun Rekimoto. 2002. Ambient Touch: Designing Tactile Interfaces for Handheld Devices. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, NY, NY, USA, 51--60. DOI: http://dx.doi.org/10.1145/571985.571993",
      "doi": "10.1145/571985.571993"
    },
    {
      "text": "Ramesh Raskar and Kok-Lim Low. 2001. Interacting with Spatially Augmented Reality. In Proceedings of the 1st International Conference on Computer Graphics, Virtual Reality and Visualisation (AFRIGRAPH '01). ACM, NY, NY, USA, 101--108. DOI: http://dx.doi.org/10.1145/513867.513889",
      "doi": "10.1145/513867.513889"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, Matt Cutts, Adam Lake, Lev Stesin, and Henry Fuchs. 1998. The Office of the Future: A Unified Approach to Image-based Modeling and Spatially Immersive Displays. In Proceedings of the 25th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). ACM, NY, NY, USA, 179--188. DOI: http://dx.doi.org/10.1145/280814.280861",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Jun Rekimoto. 2002. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/503376.503397",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Munehiko Sato, Shigeo Yoshida, Alex Olwal, Boxin Shi, Atsushi Hiyama, Tomohiro Tanikawa, Michitaka Hirose, and Ramesh Raskar. 2015. SpecTrans: Versatile Material Classification for Interaction with Textureless, Specular and Transparent Surfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2191--2200. DOI: http://dx.doi.org/10.1145/2702123.2702169",
      "doi": "10.1145/2702123.2702169"
    },
    {
      "text": "T. Schiphorst, N. Motamedi, and N. Jaffe. 2007. Applying an Aesthetic Framework of Touch for Table-Top Interactions. In Second Annual IEEE International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP'07). 71--74. DOI: http://dx.doi.org/10.1109/TABLETOP.2007.20",
      "doi": ""
    },
    {
      "text": "Magdalena Schmid, Sonja Rümelin, and Hendrik Richter. 2013. Empowering Materiality: Inspiring the Design of Tangible Interactions. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, NY, NY, USA, 91--98. DOI: http://dx.doi.org/10.1145/2460625.2460639",
      "doi": "10.1145/2460625.2460639"
    },
    {
      "text": "Sony. 2018. Sony Xperia Touch. (2018). https://www.sonymobile.com/gb/products/smart-products/xperia-touch",
      "doi": ""
    },
    {
      "text": "Sebastian Stein and Stephen J. McKenna. 2013. Combining Embedded Accelerometers with Computer Vision for Recognizing Food Preparation Activities. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 729--738. DOI: http://dx.doi.org/10.1145/2493432.2493482",
      "doi": ""
    },
    {
      "text": "Julia M. Thornbury and Charlotte M. Mistretta. 1981. Tactile Sensitivity as a Function of Age1. Journal of Gerontology 36, 1 (01 1981), 34--39. DOI: http://dx.doi.org/10.1093/geronj/36.1.34",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell, David R. Flatla, and Rachel Menzies. 2018a. It's Not Just the Light: Understanding the Factors Causing Situational Visual Impairments During Mobile Interaction. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI '18). ACM, NY, NY, USA, 338--351. DOI: http://dx.doi.org/10.1145/3240167.3240207",
      "doi": "10.1145/3240167.3240207"
    },
    {
      "text": "Garreth W. Tigwell, Rachel Menzies, and David R. Flatla. 2018b. Designing for Situational Visual Impairments: Supporting Early-Career Designers of Mobile Content. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 387--399. DOI: http://dx.doi.org/10.1145/3196709.3196760",
      "doi": "10.1145/3196709.3196760"
    },
    {
      "text": "Garreth W. Tigwell, Zhanna Sarsenbayeva, Benjamin M. Gorman, David R. Flatla, Jorge Goncalves, Yeliz Yesilada, and Jacob O. Wobbrock. 2019. Addressing the Challenges of Situationally-Induced Impairments and Disabilities in Mobile Interaction. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article W30, 8 pages. DOI: http://dx.doi.org/10.1145/3290607.3299029",
      "doi": "10.1145/3290607.3299029"
    },
    {
      "text": "Christian Tonn, Frank Petzold, Oliver Bimber, Anselm Grundhaufer, and Dirk Donath. 2008. Spatial Augmented Reality for Architecture Designing and Planning with and within Existing Buildings. International Journal of Architectural Computing 6, 1 (2008), 41--58. DOI: http://dx.doi.org/10.1260/147807708784640126",
      "doi": ""
    },
    {
      "text": "Sarah J. Tracy. 2013. Qualitative Research Methods: Collecting Evidence, Crafting Analysis, Communicating Impact. Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "Ying-Chao Tung, Mayank Goel, Isaac Zinda, and Jacob O. Wobbrock. 2018. RainCheck: Overcoming Capacitive Interference Caused by Rainwater on Smartphones. In Proceedings of the 20th ACM International Conference on Multimodal Interaction (ICMI '18). Association for Computing Machinery, New York, NY, USA, 464--471. DOI: http://dx.doi.org/10.1145/3242969.3243028",
      "doi": ""
    },
    {
      "text": "Leena Ventä-Olkkonen, Panu AAkerman, Arto Puikkonen, Ashley Colley, and Jonna Häkkilä. 2014. Touching the Ice: In-the-wild Study of an Interactive Icewall. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, NY, NY, USA, 129--132. DOI: http://dx.doi.org/10.1145/2686612.2686630",
      "doi": "10.1145/2686612.2686630"
    },
    {
      "text": "Craig Villamor, Dan Willis, and Luke Wroblewski. 2010. Touch gesture reference guide. Touch Gesture Reference Guide (2010). http://www.lukew.com/touch/",
      "doi": ""
    },
    {
      "text": "Jorick Vissers and David Geerts. 2015. TUIkit: Evaluating Physical and Functional Experiences of Tangible User Interface Prototypes. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1267--1276. DOI: http://dx.doi.org/10.1145/2702123.2702478",
      "doi": "10.1145/2702123.2702478"
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, Sabrina Hauser, Henry Lin, Cheng Cao, Leo Ma, and Tijs Duel. 2017. Morse Things: A Design Inquiry into the Gap Between Things and Us. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). Association for Computing Machinery, New York, NY, USA, 503--514. DOI: http://dx.doi.org/10.1145/3064663.3064734",
      "doi": "10.1145/3064663.3064734"
    },
    {
      "text": "Roy Want, Kenneth P. Fishkin, Anuj Gujar, and Beverly L. Harrison. 1999. Bridging Physical and Virtual Worlds with Electronic Tags. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 370--377. DOI: http://dx.doi.org/10.1145/302979.303111",
      "doi": ""
    },
    {
      "text": "Mikael Wiberg. 2016. Interaction, new materials & computing -- Beyond the disappearing computer, towards material interactions. Materials & Design 90 (2016), 1200 -- 1206. DOI: http://dx.doi.org/https://doi.org/10.1016/j.matdes.2015.05.032",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock. 2006. The future of mobile device research in HCI. In CHI 2006 workshop proceedings: what is the next generation of human-computer interaction. 131--134.",
      "doi": ""
    },
    {
      "text": "Hui-Shyong Yeo, Gergely Flamich, Patrick Schrempf, David Harris-Birtill, and Aaron Quigley. 2016. RadarCat: Radar Categorization for Input & Interaction. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 833--841. DOI: http://dx.doi.org/10.1145/2984511.2984515",
      "doi": "10.1145/2984511.2984515"
    },
    {
      "text": "Hui-Shyong Yeo, Juyoung Lee, Andrea Bianchi, David Harris-Birtill, and Aaron Quigley. 2017. SpeCam: Sensing Surface Color and Material with the Front-facing Camera of a Mobile Device. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, NY, NY, USA, Article 25, 9 pages. DOI: http://dx.doi.org/10.1145/3098279.3098541",
      "doi": "10.1145/3098279.3098541"
    },
    {
      "text": "Stefanie Zollmann, Tobias Langlotz, and Oliver Bimber. 2007. Passive-active geometric calibration for view-dependent projections onto arbitrary surfaces. JVRB-Journal of Virtual Reality and Broadcasting 4, 6 (2007). DOI: http://dx.doi.org/10.20385/1860--2037/4.2007.6",
      "doi": ""
    }
  ]
}