{
  "doi": "10.1145/3313831.3376150",
  "title": "Evaluating 'Prefer not to say' Around Sensitive Disclosures",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As people's offline and online lives become increasingly entwined, the sensitivity of personal information disclosed online is increasing. Disclosures often occur through structured disclosure fields (e.g., drop-down lists). Prior research suggests these fields may limit privacy, with non-disclosing users being presumed to be hiding undesirable information. We investigated this around HIV status disclosure in online dating apps used by men who have sex with men. Our online study asked participants (N=183) to rate profiles where HIV status was either disclosed or undisclosed. We tested three designs for displaying undisclosed fields. Visibility of undisclosed fields had a significant effect on the way profiles were rated, and other profile information (e.g., ethnicity) could affect inferences that develop around undisclosed information. Our research highlights complexities around designing for non-disclosure and questions the voluntary nature of these fields. Further work is outlined to ensure disclosure control is appropriately implemented around online sensitive information disclosures.",
  "authors": [
    {
      "name": "Mark Warner",
      "institution": "University College London & Northumbria University, London & Newcastle, United Kingdom",
      "img": "/do/10.1145/contrib-99659321441/rel-imgonly/99659321441.jpg",
      "acmid": "99659321441",
      "orcid": "0000-0002-7494-6275"
    },
    {
      "name": "Agnieszka Kitkowska",
      "institution": "Karlstad University, Karlstad, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527806",
      "orcid": "missing"
    },
    {
      "name": "Jo Gibbs",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259197357",
      "orcid": "0000-0001-5696-0260"
    },
    {
      "name": "Juan F. Maestre",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659233507",
      "orcid": "0000-0002-5403-9387"
    },
    {
      "name": "Ann Blandford",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100644401/rel-imgonly/p1010038.jpg",
      "acmid": "81100644401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A Acquisti and R Gross. 2006. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In International workshop on privacy enhancing technologies. Springer, 36--58. http://link.springer.com/10.1007/11957454",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "George A Akerlof. 1978. The market for \"lemons\": Quality uncertainty and the market mechanism. In Uncertainty in Economics. Elsevier, 235--251.",
      "doi": ""
    },
    {
      "text": "Anita L Allen. 1999. Privacy-as-data control: Conceptual, practical, and moral limits of the paradigm. Conn. L. Rev. 32 (1999), 861.",
      "doi": ""
    },
    {
      "text": "Irwin Altman and Dalmas Taylor. 1987. Communication in interpersonal relationships: Social penetration theory. Interpersonal processes: New directions in communication research (1987), 257--277.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing pregnancy loss on Facebook: A decision-making framework for stigmatized disclosures on identified social network sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 158.",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi, Margaret Morris, and Andrea Forte. 2018. Testing Waters, Sending Clues: Indirect Disclosures of Socially Stigmatized Experiences on Social Media. Proceedings in ACM Human Computer Interaction CSCW (2018), 24. https://doi.org/10.1145/3274288",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Paul M Aoki and Allison Woodruff. 2005. Making space for stories: ambiguity in the design of personal communication systems. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 181--190.",
      "doi": "10.1145/1054972.1054998"
    },
    {
      "text": "Peter Michael Bak. 2010. Sex differences in the attractiveness halo effect in the online dating environment. Journal of Business and Media Psychology 1, 1 (2010), 1--7.",
      "doi": ""
    },
    {
      "text": "Volker Benndorf, Dorothea Kübler, and Hans Theo Normann. 2015. Privacy concerns, voluntary disclosure of information, and unraveling: An experiment. European Economic Review 75 (2015), 43--59. DOI: http://dx.doi.org/10.1016/j.euroecorev.2015.01.005",
      "doi": ""
    },
    {
      "text": "Charles R Berger and Richard J Calabrese. 1974. Some explorations in initial interaction and beyond: Toward a developmental theory of interpersonal communication. Human communication research 1, 2 (1974), 99--112.",
      "doi": ""
    },
    {
      "text": "Kenneth Bettenhausen and J Keith Murnighan. 1985. The emergence of norms in competitive decision-making groups. Administrative science quarterly (1985), 350--372.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner and Jeffrey T Hancock. 2006. Advancing ambiguity. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 103--106.",
      "doi": "10.1145/1124772.1124789"
    },
    {
      "text": "Geoffrey C Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT press.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Danah Boyd and Alice Marwick. 2011. Social steganography: Privacy in networked publics. International Communication Association, Boston, MA (2011), 93.",
      "doi": ""
    },
    {
      "text": "AE Brown, S Nash, N Connor, PD Kirwan, D Ogaz, S Croxford, D De Angelis, and VC Delpech. 2017. Towards elimination of HIV transmission, AIDS and HIV-related deaths in the UK. HIV medicine (2017).",
      "doi": ""
    },
    {
      "text": "J. C. Buitelaar. 2014. Privacy and Narrativity in the Internet Era. The Information Society 30, 4 (2014), 266--281. DOI: http://dx.doi.org/10.1080/01972243.2014.915278",
      "doi": "10.1080/01972243.2014.915278"
    },
    {
      "text": "Alex Carballo-Diéguez, Michael Miner, Curtis Dolezal, BR Simon Rosser, and Scott Jacoby. 2006. Sexual negotiation, HIV-status disclosure, and sexual risk behavior among Latino men who use the internet to seek sex with other men. Archives of sexual behavior 35, 4 (2006), 473--481.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2019. HIV among Gay and Bisexual Men (Fact Sheet). (2019). https://www.cdc.gov/nchhstp/newsroom/docs/factsheets/ cdc-msm-508.pdf",
      "doi": ""
    },
    {
      "text": "Judith A. Clair, Joy E. Beatty, and Tammy L. Maclean. 2005. Out of sight but not out of mind: Managing invisible social identities in the workplace. Academy of Management Review 30, 1 (2005), 78--95. DOI: http://dx.doi.org/10.5465/AMR.2005.15281431",
      "doi": ""
    },
    {
      "text": "Constantinos K Coursaris and Ming Liu. 2009. An analysis of social support exchanges in online HIV/AIDS self-help groups. Computers in Human Behavior 25, 4 (2009), 911--918.",
      "doi": "10.1016/j.chb.2009.03.006"
    },
    {
      "text": "Jennifer L Doleac and Benjamin Hansen. 2016. Does \"ban the box\" help or hurt low-skilled workers? Statistical discrimination and employment outcomes when criminal histories are hidden. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Judith Donath. 2014. The social machine: designs for living online. MIT Press.",
      "doi": "10.5555/2621981"
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing impressions online: Self-presentation processes in the online dating environment. Journal of computer-mediated communication 11, 2 (2006), 415--441.",
      "doi": ""
    },
    {
      "text": "Daniel C Feldman. 1984. The development and enforcement of group norms. Academy of management review 9, 1 (1984), 47--53.",
      "doi": ""
    },
    {
      "text": "Andy Field. 2013. Discovering statistics using IBM SPSS statistics. sage.",
      "doi": ""
    },
    {
      "text": "Robert Forsythe, R Mark Isaac, and Thomas R Palfrey. 1989. Theories and tests of \"blind bidding\" in sealed-bid auctions. The Rand Journal of Economics (1989), 214--238.",
      "doi": ""
    },
    {
      "text": "Charles Fried. 1968. Privacy. Yale Law Journal 77 (1968), 21.",
      "doi": ""
    },
    {
      "text": "HM Government. 2018. Help Shape Our Future: The 2021 Census of Population and Housing in England and Wales. Technical Report December.",
      "doi": ""
    },
    {
      "text": "Sanford J Grossman. 1981. The informational role of warranties and private disclosure about product quality. The Journal of Law and Economics 24, 3 (1981), 461--483.",
      "doi": ""
    },
    {
      "text": "Severin Hacker and Luis Von Ahn. 2009. Matchin: Eliciting User Preferences with an Online Game. In Proc. Int'l Conf on Human Factors in Computing Systems (CHI). DOI: http://dx.doi.org/10.1145/1518701.1518882",
      "doi": "10.1145/1518701.1518882"
    },
    {
      "text": "Oliver L Haimson, Nazanin Andalibi, Munmun De Choudhury, and Gillian R Hayes. 2018. Relationship breakup disclosures and media ideologies on Facebook. New Media & Society 20, 5 (2018), 1931--1952.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Courtney Loder, Lynn Dombrowski, and Gillian R Hayes. 2015. User Response to Facebook's Custom Gender Options. iConference 2015 Proceedings (2015).",
      "doi": ""
    },
    {
      "text": "Mark J. Handel and Irina Shklovski. 2012. Disclosure, ambiguity and risk reduction in real-time dating sites. Proceedings of the 17th ACM international conference on Supporting group work - GROUP '12 (2012), 175. DOI: http://dx.doi.org/10.1145/2389176.2389203",
      "doi": ""
    },
    {
      "text": "Christopher M. Hoadley, Heng Xu, Joey J. Lee, and Mary Beth Rosson. 2010. Privacy as information access and illusory control: The case of the Facebook News Feed privacy outcry. Electronic Commerce Research and Applications 9, 1 (2010), 50--60. DOI: http://dx.doi.org/10.1016/j.elerap.2009.05.001",
      "doi": ""
    },
    {
      "text": "Ginger Zhe Jin, Michael Luca, and Daniel Martin. 2015. Is no news (perceived as) bad news? An experimental investigation of information disclosure. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Adam N. Joinson, Carina Paine, Tom Buchanan, and Ulf Dietrich Reips. 2008. Measuring self-disclosure online: Blurring and non-response to sensitive items in web-based surveys. Computers in Human Behavior 24, 5 (2008), 2158--2171. DOI: http://dx.doi.org/10.1016/j.chb.2007.10.005",
      "doi": "10.1016/j.chb.2007.10.005"
    },
    {
      "text": "Emiko Kamitani, Megan E Wichser, Adebukola H Adegbite, Mary M Mullins, Wayne D Johnson, Pierre-Cedric Crouch, and Theresa Ann Sipe. 2018. Increasing prevalence of self-reported HIV preexposure prophylaxis use in published surveys: a systematic review and meta-analysis. Aids 32, 17 (2018), 2633--2635.",
      "doi": ""
    },
    {
      "text": "Hanna Krasnova, Oliver Günther, Sarah Spiekermann, and Ksenia Koroleva. 2009. Privacy concerns and identity in online social networks. Identity in the Information Society 2, 1 (2009), 39--63. DOI: http://dx.doi.org/10.1007/s12394-009-0019--1",
      "doi": ""
    },
    {
      "text": "Karen Levy and Solon Barocas. 2017. Designing against discrimination in online markets. Berkeley Tech. LJ 32 (2017), 1183.",
      "doi": ""
    },
    {
      "text": "Gregory Lewis. 2011. Asymmetric information, adverse selection and online disclosure: The case of eBay motors. American Economic Review 101, 4 (2011), 1535--46.",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Jeffery T Hancock, Kenneth Lim Mingjie, and Mor Naaman. 2017. Self-disclosure and perceived trustworthiness of Airbnb host profiles. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 2397--2409.",
      "doi": "10.1145/2998181.2998269"
    },
    {
      "text": "Alice E Marwick and Danah Boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New media & society 13, 1 (2011), 114--133.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick and Danah Boyd. 2014. Networked privacy: How teenagers negotiate context in social media. New media & society 16, 7 (2014), 1051--1067.",
      "doi": ""
    },
    {
      "text": "Paul R Milgrom. 1981. Good news and bad news: Representation theorems and applications. The Bell Journal of Economics (1981), 380--391.",
      "doi": ""
    },
    {
      "text": "Phoenix KH Mo and Neil S Coulson. 2010. Empowering processes in online support groups among people living with HIV/AIDS: A comparative analysis of 'lurkers' and 'posters'. Computers in Human Behavior 26, 5 (2010), 1183--1193.",
      "doi": "10.1016/j.chb.2010.03.028"
    },
    {
      "text": "S Nash, S Desai, S Croxford, L Guerra, C Lowndes, N Connor, and ON Gill. 2018. Progress towards ending the HIV epidemic in the United Kingdom: 2018 report. Technical Report November 2018. Public Health England, London. 67 pages. https://www.gov.uk/ government/publications/hiv-in-the-united-kingdom",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Christopher Y Olivola and Alexander Todorov. 2010. Fooled by first impressions? Reexamining the diagnostic value of appearance-based inferences. Journal of Experimental Social Psychology 46, 2 (2010), 315--324.",
      "doi": ""
    },
    {
      "text": "Joint United Nations Programme on HIV/AIDS (UNAIDS) and others. 2015. On the Fast-Track to end AIDS by 2030: Focus on location and population. Geneva: UNAIDS 2030 (2015).",
      "doi": ""
    },
    {
      "text": "Scott R Peppet. 2011. Unraveling privacy: The personal prospectus and the threat of a full-disclosure future. Nw. UL Rev. 105 (2011), 1153.",
      "doi": ""
    },
    {
      "text": "Jennifer L Peterson. 2009. \"You have to be positive.\" Social support processes of an online support group for men living with HIV. Communication Studies 60, 5 (2009), 526--541.",
      "doi": ""
    },
    {
      "text": "Jennifer L Peterson. 2010. The challenges of seeking and receiving support for women living with HIV. Health Communication 25, 5 (2010), 470--479.",
      "doi": ""
    },
    {
      "text": "Sandra Petronio. 2010. Communication privacy management theory: What do we know about family privacy regulation? Journal of family theory & review 2, 3 (2010), 175--196.",
      "doi": ""
    },
    {
      "text": "Stephen A Rains. 2014. The implications of stigma and anonymity for self-disclosure in health blogs. Health communication 29, 1 (2014), 23--31.",
      "doi": ""
    },
    {
      "text": "Patricia M Reeves. 2000. Coping in cyberspace: the impact of Internet use on the ability of HIV-positive individuals to deal with their illness. Journal of Health communication 5, sup1 (2000), 47--59.",
      "doi": ""
    },
    {
      "text": "Alison Rodger, Tina Bruun, Valentina Cambiano, Pietro Vernazza, V Strada, Jan Van Lunzen, and others. 2014. 153LB: HIV transmission risk through condomless sex if HIV+ partner on suppressive ART: PARTNER Study. In 21st Conference on Retroviruses and Oppotunistic Infections. 3--6.",
      "doi": ""
    },
    {
      "text": "Alison Rodger, Valentina Cambiano, Tina Bruun, Pietro Vernazza, Simon Collins, Olaf Degen, and others. 2018. HIV transmission risk through condomless sex in gay couples with suppressive ART: The PARTNER2 Study extended results in gay men. (2018). https://www.chip. dk/Studies/PARTNER/PARTNER-press-release-2018 AIDS2018.",
      "doi": ""
    },
    {
      "text": "Julianne Serovich, Sandra Reed, Judy Kimberly, and Dana Putney. 2014. Disclosure strategies, comfort with disclosure, and HIV transmission risk among HIV-positive MSM. Sexually Transmitted Diseases 41 (2014), 82639.",
      "doi": ""
    },
    {
      "text": "Julianne M Serovich, Daniel G Oliver, Sarah a Smith, and Tina L Mason. 2005. Methods of HIV disclosure by men who have sex with men to casual sexual partners. AIDS patient care and STDs 19, 12 (2005), 823--832. DOI: http://dx.doi.org/10.1089/apc.2005.19.823",
      "doi": ""
    },
    {
      "text": "Peter J Smit, Michael Brady, Michael Carter, Ricardo Fernandes, Lance Lamore, Michael Meulbroek, Michel Ohayon, Tom Platteau, Peter Rehberg, Jürgen K Rockstroh, and others. 2012. HIV-related stigma within communities of gay men: a literature review. AIDS care 24, 4 (2012), 405--412.",
      "doi": ""
    },
    {
      "text": "A Michael Spence. 1973. Time and communication in economic and social interaction. The Quarterly Journal of Economics 87, 4 (1973), 651--660.",
      "doi": ""
    },
    {
      "text": "Erin L. Spottswood and Jeffrey T. Hancock. 2017. Should I Share That? Prompting Social Norms That Influence Privacy Behaviors on a Social Networking Site. Journal of Computer-Mediated Communication 22, 2 (2017), 55--70. DOI: http://dx.doi.org/10.1111/jcc4.12182",
      "doi": "10.1111/jcc4.12182"
    },
    {
      "text": "James P Stevens. 2012. Applied multivariate statistics for the social sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Tiffany Veinot. 2009. \"A lot of people didn't have a chance to support us because we never told them\" Stigma management, information poverty and HIV/AIDS information/help networks. Proceedings of the American Society for Information Science and Technology 46, 1 (2009), 1--20.",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M. Angela Sasse, and Ann Blandford. 2018. Privacy Unraveling Around Explicit HIV Status Disclosure Fields in the Online Geosocial Hookup App Grindr. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 181 (Nov. 2018), 22 pages. DOI: http://dx.doi.org/10.1145/3274450",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Mark Warner, Juan F Maestre, Jo Gibbs, Chia-Fang Chung, and Ann Blandford. 2019. Signal Appropriation of Explicit HIV Status Disclosure Fields in Sex-Social Apps used by Gay and Bisexual Men. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Glasgow, Scotland UK. DOI: http://dx.doi.org/10.1145/3290605.3300922",
      "doi": "10.1145/3290605.3300922"
    },
    {
      "text": "Alan F Westin. 1968. Privacy and freedom. Washington and Lee Law Review 25, 1 (1968), 166.",
      "doi": ""
    },
    {
      "text": "Stacey L Williams and Kristin D Mickelson. 2008. A paradox of support seeking and rejection among the stigmatized. Personal Relationships 15, 4 (2008), 493--509.",
      "doi": ""
    },
    {
      "text": "Heng Xu. 2007. The effects of self-construal and perceived control on privacy concerns. ICIS 2007 proceedings (2007), 125.",
      "doi": ""
    }
  ]
}