{
  "doi": "10.1145/3313831.3376468",
  "title": "Adults' and Children's Mental Models for Gestural Interactions with Interactive Spherical Displays",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Interactive spherical displays offer numerous opportunities for engagement and education in public settings. Prior work established that users' touch-gesture patterns on spherical displays differ from those on flatscreen tabletops, and speculated that these differences stem from dissimilarity in how users conceptualize interactions with these two form factors. We analyzed think-aloud data collected during a gesture elicitation study to understand adults' and children's (ages 7 to 11) conceptual models of interaction with spherical displays and compared them to conceptual models of interaction with tabletop displays from prior work. Our findings confirm that the form factor strongly influenced users' mental models of interaction with the sphere. For example, participants conceptualized that the spherical display would respond to gestures in a similar way as real-world spherical objects like physical globes. Our work contributes new understanding of how users draw upon the perceived affordances of the sphere as well as prior touchscreen experience during their interactions.",
  "tags": [
    "interactive spherical displays",
    "touchscreen displays",
    "children",
    "mental models",
    "adults",
    "touchscreen gestures"
  ],
  "authors": [
    {
      "name": "Nikita Soni",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/do/10.1145/contrib-99659365830/rel-imgonly/99659365830.jpg",
      "acmid": "99659365830",
      "orcid": "missing"
    },
    {
      "name": "Schuyler Gleaves",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365478",
      "orcid": "missing"
    },
    {
      "name": "Hannah Neff",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366040",
      "orcid": "missing"
    },
    {
      "name": "Sarah Morrison-Smith",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/do/10.1145/contrib-87958779557/rel-imgonly/hamilton2.jpg",
      "acmid": "87958779557",
      "orcid": "missing"
    },
    {
      "name": "Shaghayegh Esmaeili",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/do/10.1145/contrib-99659320337/rel-imgonly/img_1968.jpg",
      "acmid": "99659320337",
      "orcid": "missing"
    },
    {
      "name": "Ian Mayne",
      "institution": "Elon University, Elon, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659431364",
      "orcid": "missing"
    },
    {
      "name": "Sayli Bapat",
      "institution": "Maharashtra Institute of Technology, Pune, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365509",
      "orcid": "missing"
    },
    {
      "name": "Carrie Schuman",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365240",
      "orcid": "missing"
    },
    {
      "name": "Kathryn A. Stofer",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/do/10.1145/contrib-99659058964/rel-imgonly/stofer_k_webphoto2013_6x7.5in.jpg",
      "acmid": "99659058964",
      "orcid": "missing"
    },
    {
      "name": "Lisa Anthony",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/do/10.1145/contrib-81100196272/rel-imgonly/lisa-anthony-headshot-2018.jpg",
      "acmid": "81100196272",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Robert B. Allen. 1997. Mental Models and User Models. In Handbook of Human-Computer Interaction. North Holland, 49--63.",
      "doi": ""
    },
    {
      "text": "Benedikte S. Als, Janne J. Jensen, and Mikael B. Skov. 2005. Comparison of Think-aloud and Constructive Interaction in Usability Testing with Children. In Proceedings of the Conference on Interaction Design and Children (IDC '05), 9--16.",
      "doi": ""
    },
    {
      "text": "Amanda Harris, Jochen Rick, Victoria Bonnett, Nicola Yuill, Rowanne Fleck, Paul Marshall, and Yvonne Rogers. 2009. Around the Table: Are Multiple-Touch Surfaces Better than Single-Touch for Children's Collaborative Interactions? In Proceedings of the Conference on Computer Supported Collaborative Learning (CSCL'09), 335--344.",
      "doi": "10.5555/1600053.1600104"
    },
    {
      "text": "Lisa Anthony, Quincy Brown, Jaye Nias, Berthel Tate, and Shreya Mohan. 2012. Interaction and Recognition Challenges in Interpreting Children's Touch and Gesture Input on Mobile devices. In Proceedings of the Conference on Interactive Tabletops and Surfaces (ITS'12), 225--234.",
      "doi": "10.1145/2396636.2396671"
    },
    {
      "text": "Lisa Anthony, Kathryn A. Stofer, Annie Luc, and Jacob O. Wobbrock. 2016. Gestures by Children and Adults on Touch Tables and Touch Walls in a Public Science Center. In Proceedings of the Conference on Interaction Design and Children (IDC'16), 344--355.",
      "doi": ""
    },
    {
      "text": "Nor Azah Abdul Aziz, Firat Batmaz, Roger Stone, and Paul Wai Hing Chung. 2013. Selection of Touch Gestures for Children's Applications. In Science and Information Conference (SAI'13), 721--726.",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko. 2009. Beyond Flat Surface Computing: Challenges of Depth-Aware and Curved Interfaces. In Proceedings of the Conference on Multimedia (MM '09), 935--944.",
      "doi": "10.1145/1631272.1631462"
    },
    {
      "text": "Hrvoje Benko and Andrew D. Wilson. 2009. Design Challenges of Interactive Spherical User Interfaces. In Workshop on Programming Reality, Conference on Computer Human Interaction (CHI'09), 4 pages.",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, Andrew D. Wilson, and Ravin Balakrishnan. 2008. Sphere: Multi-touch Interactions on a Spherical Display. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST'08), 77--86.",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "John Bolton, Kibum Kim, and Roel Vertegaal. 2012. A Comparison of Competitive and Cooperative Task Performance using Spherical and Flat Displays. In Proceedings of the Conference on Computer Supported Cooperative Work (CSCW'12), 529--538.",
      "doi": "10.1145/2145204.2145286"
    },
    {
      "text": "Victoria Clarke and Virginia Braun. 2013. Successful Qualitative Research: A Practical Guide for Beginners. SAGE.",
      "doi": ""
    },
    {
      "text": "Kate Haley Goldman, Cheryl Kessler, and Elizabeth Danter. 2010. Science On a Sphere®. Retrieved December 31, 2018 from https://sos.noaa.gov/What_is_SOS/",
      "doi": ""
    },
    {
      "text": "Sherry Hsi and Michael Eisenberg. 2012. Math on a Sphere: Using Public Displays to Support Children's Creativity and Computational Thinking on 3D Surfaces. In Proceedings of the Conference on Interaction Design and Children (IDC '12), 248--251.",
      "doi": "10.1145/2307096.2307137"
    },
    {
      "text": "Meredith Ringel Morris, Jacob O. Wobbrock, and Andrew D. Wilson. 2010. Understanding Users' Preferences for Surface Gestures. In Proceedings of the Conference on Graphics Interface (GI'10), 276-- 268.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, and Jacob O. Wobbrock. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. Interactions 21, 40--45.",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Donald A. Norman. 1999. Affordance, Conventions, and Design. Interactions 6, 3: 38--43.",
      "doi": "10.1145/301153.301168"
    },
    {
      "text": "Donald A. Norman. 2010. Natural User Interfaces are Not Natural. Interactions 17, 3: 6--10.",
      "doi": "10.1145/1744161.1744163"
    },
    {
      "text": "Donald A. Norman. 2014. Some Observations on Mental Models. In Mental Models. Psychology Press, 15--22.",
      "doi": ""
    },
    {
      "text": "Karen Rust, Meethu Malu, Lisa Anthony, and Leah Findlater. 2014. Understanding Child-Defined Gestures and Children's Mental Models for Touchscreen Tabletop Interaction. In Proceedings of the Conference on Interaction Design and Children (IDC'14), 201--204.",
      "doi": ""
    },
    {
      "text": "Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the Conference on Computer Supported Cooperative Work (CSCW'04), 294--303.",
      "doi": ""
    },
    {
      "text": "Nikita Soni, Sayli Bapat, Schuyler Gleaves, Alice Darrow, Carrie Schuman, Hannah Neff, Peter Chang, Kathryn A. Stofer, and Lisa Anthony. 2019. Towards Understanding Interactions with Multi-Touch Spherical Displays. In Proceedings of the Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'19), Paper no. LBW0238.",
      "doi": "10.1145/3290607.3313063"
    },
    {
      "text": "Nikita Soni, Schuyler Gleaves, Hannah Neff, Sarah Morrison-Smith, Shaghayegh Esmaeili, Ian Mayne, Sayli Bapat, Carrie Schuman, Kathryn A. Stofer, and Lisa Anthony. 2019. Do User-Defined Gestures for Flatscreens Generalize to Interactive Spherical Displays for Adults and Children? In Proceedings of the ACM International Symposium on Pervasive Displays (PerDis '19), 7 pages.",
      "doi": "10.1145/3321335.3324941"
    },
    {
      "text": "Mike Tissenbaum, Matthew Berland, and Leilah Lyons. 2017. DCLM Framework: Understanding Collaboration in Open-ended Tabletop Learning Environments. International Journal of Computer Supported Collababorative Learning 12, 1: 35--64.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu and Ionut-Alexandru Zaiti. 2014. Leap Gestures for TV: Insights from an Elicitation Study. In Proceedings of the Conference on Interactive Experiences for TV and Online Video (TVX '14), 131--138.",
      "doi": "10.1145/2602299.2602316"
    },
    {
      "text": "Julie R. Williamson, Daniel Sundén, and Jay Bradley. 2015. GlobalFestival: Evaluating Real World Interaction on a Spherical Display. In Proceedings of the Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'15), 1251--1261.",
      "doi": "10.1145/2750858.2807518"
    },
    {
      "text": "Julie R. Williamson, Daniel Sundén, and Keith Hamilton. 2016. The Lay of the Land: Techniques for Displaying Discrete and Continuous Content on a Spherical Display. In Proceedings of the ACM International Symposium on Pervasive Displays (PerDis '16), 38--44.",
      "doi": "10.1145/2914920.2915005"
    },
    {
      "text": "Julie R. Williamson, John Williamson, Daniel Sundén, and Jay Bradley. 2015. Multi-Player Gaming on Spherical Displays. In Proceedings of the Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'15), 355--358.",
      "doi": "10.1145/2702613.2725447"
    },
    {
      "text": "Andrew D. Wilson, Shahram Izadi, Otmar Hilliges, Armando Garcia-Mendoza, and David Kirk. 2008. Bringing Physics to the Surface. In Proceedings of the Symposium on User Interface Software and Technology (UIST '08), 67--76.",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Markus L. Wittorf and Mikkel R. Jakobsen. 2016. Eliciting Mid-Air Gestures for Wall-Display Interaction. In Proceedings of the Nordic Conference on Human-Computer Interaction (NordiCHI '16), 1-- 4.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the Guessability of Symbolic Input. In Extended Abstracts on Human Factors in Computing Systems (CHI EA' 05), 1869--1872.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. In Proceedings of the Conference on Human Factors in Computing Systems (CHI'09), 1083--1092.",
      "doi": ""
    },
    {
      "text": "Pufferfish. Puffertouch Displays. Retrieved December 31, 2018 from https://pufferfishdisplays.com/solution/puffertouch-2/",
      "doi": ""
    },
    {
      "text": "NASA's Jet Propulsion Laboratory. JPL Shares Excitement of Exploration at Open House. Retrieved September 12, 2019 from https://www.jpl.nasa.gov/news/news.php?feature=299",
      "doi": ""
    },
    {
      "text": "Interaction Design Foundation. The Glossary of Human Computer Interaction: WIMP. Retrieved September 16, 2019 from https://www.interactiondesign.org/literature/book/the-glossary-of-humancomputer-interaction/wimp",
      "doi": ""
    },
    {
      "text": "2017. Common Sense Media. The Common Sense Census: Media Use by Kids Age Zero to Eight 2017. Retrieved January 2, 2020 from https://www.commonsensemedia.org/research/thecommon-sense-census-media-use-by-kids-age-zeroto-eight-2017",
      "doi": ""
    },
    {
      "text": "2019. Pew Research Center. Demographics of Mobile Device Ownership and Adoption in the United States. Retrieved January 2, 2020 from https://www.pewresearch.org/internet/factsheet/mobile/",
      "doi": ""
    }
  ]
}