{
  "doi": "10.1145/3313831.3376418",
  "title": "Toward Automated Feedback on Teacher Discourse to Enhance Teacher Learning",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Like anyone, teachers need feedback to improve. Due to the high cost of human classroom observation, teachers receive infrequent feedback which is often more focused on evaluating performance than on improving practice. To address this critical barrier to teacher learning, we aim to provide teachers with detailed and actionable automated feedback. Towards this end, we developed an approach that enables teachers to easily record high-quality audio from their classes. Using this approach, teachers recorded 142 classroom sessions, of which 127 (89%) were usable. Next, we used speech recognition and machine learning to develop teacher-generalizable computer-scored estimates of key dimensions of teacher discourse. We found that automated models were moderately accurate when compared to human coders and that speech recognition errors did not influence performance. We conclude that authentic teacher discourse can be recorded and analyzed for automatic feedback. Our next step is to incorporate the automatic models into an interactive visualization tool that will provide teachers with objective feedback on the quality of their discourse.",
  "tags": [
    "natural language processing",
    "classroom discourse",
    "automatic speech recognition",
    "audio recording",
    "dialogic instruction"
  ],
  "authors": [
    {
      "name": "Emily Jensen",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-99659527110/rel-imgonly/engineerin_grad_portraits-35-min.jpg",
      "acmid": "99659527110",
      "orcid": "missing"
    },
    {
      "name": "Meghan Dale",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529661",
      "orcid": "missing"
    },
    {
      "name": "Patrick J. Donnelly",
      "institution": "Oregon State University, Bend, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479652681",
      "orcid": "missing"
    },
    {
      "name": "Cathlyn Stone",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659350236",
      "orcid": "missing"
    },
    {
      "name": "Sean Kelly",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658761974",
      "orcid": "missing"
    },
    {
      "name": "Amanda Godley",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528625",
      "orcid": "missing"
    },
    {
      "name": "Sidney K. D'Mello",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567903",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alibali, M.W. et al. 2014. How teachers link ideas in mathematics instruction using speech and gesture: a corpus analysis. Cognition and Instruction. 32, 1 (2014), 65--100. DOI: https://doi.org/10.1080/07370008.2013.85816 1.",
      "doi": ""
    },
    {
      "text": "Archer, J. et al. 2016. Better Feedback for Better Teaching: A Practical Guide to Improving Classroom Observations.",
      "doi": ""
    },
    {
      "text": "Aslan, S. et al. 2019. Investigating the impact of a real-time, multimodal student engagement analytics technology in authentic classrooms. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19 (New York, New York, USA, 2019), 1--12. DOI: https://doi.org/10.1145/3290605.3300534.",
      "doi": "10.1145/3290605.3300534"
    },
    {
      "text": "Azevedo, R. and Bernard, R.M. 1995. A metaanalysis of the effects of feedback in computer-based instruction. Journal of Educational Computing Research. 13, 2 (1995), 111--127. DOI: https://doi.org/10.2190/9lmd-3u28--3a0g-ftqt.",
      "doi": ""
    },
    {
      "text": "Ball, D.L. and Cohen, D.K. 1999. Developing practice, developing practitioners: toward a practicebased theory of professional education. Teaching as the learning profession: Handbook of policy and practice. G. Sykes and L. Darling-Hammond, eds. Jossey-Bass Inc. 3--32.",
      "doi": ""
    },
    {
      "text": "Birman, B.F. et al. 2007. State and local implementation of the no child left behind act. Volume II - Teacher Quality Under NCLB: Interim Report. U.S. Department of Education.",
      "doi": ""
    },
    {
      "text": "Blanchard, N. et al. 2016. Automatic detection of teacher questions from audio in live classrooms. Proceedings of the 9th International Conference on Educational Data Mining (EDM 2016) (2016).",
      "doi": ""
    },
    {
      "text": "Borko, H. 2004. Professional development and teacher learning: mapping the terrain. Educational Researcher. 33, 8 (2004), 3--15. DOI: https://doi.org/10.3102/0013189X033008003.",
      "doi": ""
    },
    {
      "text": "Bransford, J.D. et al. eds. 2000. How people learn: brain, mind, experience, and school. National Academy Press.",
      "doi": ""
    },
    {
      "text": "Brill, E. 1992. A simple rule-based part of speech tagger. Proceedings of the Workshop on Speech and Natural Language (Harriman, NY, 1992), 112--116. DOI: https://doi.org/10.3115/1075527.1075553.",
      "doi": "10.3115/1075527.1075553"
    },
    {
      "text": "Cantrell, S. and Kane, T.J. 2013. Ensuring Fair and Reliable Measures of Effective Teaching: Culminating Findings from the MET Project's Three-Year Study.",
      "doi": ""
    },
    {
      "text": "Church, K.W. and Hanks, P. 1990. Word association norms, mutual information, and lexicography. Computational Linguistics. 16, 1 (1990), 76--83. DOI: https://doi.org/10.3115/981623.981633.",
      "doi": ""
    },
    {
      "text": "Cook, C. et al. 2018. An open vocabulary approach for estimating teacher use of authentic questions in classroom discourse. Proceedings of the 11th International Conference on Educational Data Mining (2018).",
      "doi": ""
    },
    {
      "text": "D'Mello, S.K. et al. 2010. Expert tutors' feedback is immediate, direct, and discriminating. Proceedings of the 23rd International Florida Artificial Intelligence Research Society Conference, FLAIRS23 (Menlo Park, CA, 2010), 504--509.",
      "doi": ""
    },
    {
      "text": "D'Mello, S.K. et al. 2015. Multimodal capture of teacher-student interactions for automated dialogic analysis in live classrooms. Proceedings of the 2015 ACM on International Conference on Multimodal Interaction - ICMI '15 (New York, New York, USA, 2015), 557--566. DOI: https://doi.org/10.1145/2818346.2830602.",
      "doi": "10.1145/2818346.2830602"
    },
    {
      "text": "Danielson, C. 2012. Observing classroom practice. Educational Leadership. 70, 2 (2012), 32--37.",
      "doi": ""
    },
    {
      "text": "Donnelly, P.J. et al. 2016. Automatic teacher modeling from live classroom audio. Proceedings of the 24th Conference on User Modeling, Adaptation, and Personalization (UMAP 2016) (2016).",
      "doi": "10.1145/2930238.2930250"
    },
    {
      "text": "Donnelly, P.J. et al. 2017. Words matter: automatic detection of questions in classroom discourse using linguistics, paralinguistics, and context. LAK '17: Proceedings of the Seventh International Conference on Learning Analytics and Knowledge (2017).",
      "doi": ""
    },
    {
      "text": "Duckworth, A.L. et al. 2010. Deliberate practice spells success: why grittier competitors triumph at the national spelling bee. Social Psychological and Personality Science. 2, 2 (2010), 174--181. DOI: https://doi.org/10.1177/1948550610385872.",
      "doi": ""
    },
    {
      "text": "Duke, N. et al. 2012. Reading and writing genre with purpose in a k-8 classroom. Heinemann.",
      "doi": ""
    },
    {
      "text": "Ericsson, K.A. 2006. The influence of experience and deliberate practice on the development of superior expert performance. The Cambridge Handbook of Expertise and Expert Performance. K.A. Ericsson et al., eds. Cambridge University Press. 685--706.",
      "doi": ""
    },
    {
      "text": "Ericsson, K.A. et al. 1993. The role of deliberate practice in the acquisition of expert performance. Psychological Review. 100, 3 (1993), 363--406. DOI: https://doi.org/10.1037/0033--295x.100.3.363.",
      "doi": ""
    },
    {
      "text": "Eyben, F. et al. 2013. Recent developments in opensmile, the munich open-source multimedia feature extractor. Proceedings of the 21st ACM international conference on Multimedia - MM '13 (New York, New York, USA, 2013), 835--838. DOI: https://doi.org/10.1145/2502081.2502224.",
      "doi": "10.1145/2502081.2502224"
    },
    {
      "text": "Fadde, P.J. and Klein, G.A. 2010. Deliberate performance: accelerating expertise in natural settings. Performance Improvement. 49, 9 (2010), 5-- 14. DOI: https://doi.org/10.1002/pfi.",
      "doi": ""
    },
    {
      "text": "Ford, M. et al. 2008. The LENA Language Environment Analysis System.",
      "doi": ""
    },
    {
      "text": "Gamoran, A. and Nystrand, M. 1992. Taking students seriously. Student Engagement and Achievement in American Secondary Schools. F.M. Newmann, ed. Teachers College Press. 40--61.",
      "doi": ""
    },
    {
      "text": "Garet, M.S. et al. 2011. Middle School Mathematics Professional Development Impact Study: Findings After the Second Year of Implementation.",
      "doi": ""
    },
    {
      "text": "Garet, M.S. et al. 2008. The Impact of Two Professional Development Interventions on Early Reading Instruction and Achievement.",
      "doi": ""
    },
    {
      "text": "Goldman, R. et al. eds. Video research in the learning sciences. Erlbaum.",
      "doi": ""
    },
    {
      "text": "Graesser, A.C. et al. 2009. What is a good question? Threads of coherence in research on the development of reading ability. M.G. McKeown and L. Kucan, eds. Guilford Press. 112--141.",
      "doi": ""
    },
    {
      "text": "Grossman, P. et al. 2013. Measure for measure: the relationship between measures of instructional practice in middle school english language arts and teachers' value-added scores. American Journal of Education. 119, 3 (2013), 445--470. DOI: https://doi.org/10.1086/669901.",
      "doi": ""
    },
    {
      "text": "Gwet, K.L. 2008. Computing inter-rater reliability and its variance in the presence of high agreement. British Journal of Mathematical and Statistical Psychology. 61, (2008), 29--48.",
      "doi": ""
    },
    {
      "text": "Hill, H.C. et al. 2008. Mathematical knowledge for teaching and the mathematical quality of instruction: an exploratory study. Cognition and Instruction. 26, 4 (2008), 430--511.",
      "doi": ""
    },
    {
      "text": "Ho, A.D. and Kane, T.J. 2013. The Reliability of Classroom Observations by School Personnel.",
      "doi": ""
    },
    {
      "text": "Hochreiter, S. and Schmidhuber, J. 1997. Long short-term memory. Neural Computation. 9, 8 (Nov. 1997), 1735--1780. DOI: https://doi.org/10.1162/neco.1997.9.8.1735.",
      "doi": "10.1162/neco.1997.9.8.1735"
    },
    {
      "text": "Holstein, K. et al. 2018. Student learning benefits of a mixed-reality teacher awareness tool in aienhanced classrooms. Artificial Intelligence in Education (2018), 154--168. DOI: https://doi.org/10.1007/978--3--319--938431_12.",
      "doi": ""
    },
    {
      "text": "Juzwik, M.M. et al. 2013. Inspiring dialogue: talking to learn in the english classroom. Teachers College Press.",
      "doi": ""
    },
    {
      "text": "Kelly, S. et al. 2018. Automatically measuring question authenticity in real-world classrooms. Educational Researcher. 47, 7 (2018), 451--464.",
      "doi": ""
    },
    {
      "text": "Kelly, S. 2007. Classroom discourse and the distribution of student engagement. Social Psychology of Education. 10, 3 (2007), 331--352.",
      "doi": ""
    },
    {
      "text": "Lemaître, G. et al. 2017. Imbalanced-learn: a python toolbox to tackle the curse of imbalanced datasets in machine learning. The Journal of Machine Learning Research. 18, (2017), 559--563. DOI: https://doi.org/http://www.jmlr.org/papers/vol ume18/16--365/16--365.pdf.",
      "doi": ""
    },
    {
      "text": "Mikolov, T. et al. 2013. Distributed representations of words and phrases and their compositionality. Advances in neural information processing systems (2013), 3111--3119.",
      "doi": ""
    },
    {
      "text": "Molenaar, I. and Knoop-van Campen, C. 2017. Teacher dashboards in practice: usage and impact. 12th European Conference on Technology Enhanced Learning, EC-TEL 2017 (Tallinn, Estonia, 2017), 125--138. DOI: https://doi.org/10.1007/978--3319--66610--5_10.",
      "doi": ""
    },
    {
      "text": "Molenaar, I. and Knoop-van Campen, C.A.N. 2019. How teachers make dashboard information actionable. IEEE Transactions on Learning Technologies. 12, 3 (Jul. 2019), 347--355. DOI: https://doi.org/10.1109/TLT.2018.2851585.",
      "doi": "10.1109/TLT.2018.2851585"
    },
    {
      "text": "Murphy, P.K. et al. 2009. Examining the effects of classroom discussion on students' comprehension of text: a meta-analysis. Journal of Educational Psychology. 101, 3 (2009), 740--764. DOI: https://doi.org/10.1037/a0015576.",
      "doi": ""
    },
    {
      "text": "Newman, F.M. et al. 1992. The significance and sources of student engagement. Student Engagement and Achievement in American Secondary Schools. F.M. Newman, ed. Teachers College Press. 11--39.",
      "doi": ""
    },
    {
      "text": "Nystrand, M. et al. 1997. Opening dialogue: understanding the dynamics of language and learning in the english classroom. Teachers College Press.",
      "doi": ""
    },
    {
      "text": "Nystrand, M. et al. 2003. Questions in time: investigating the structure and dynamics of unfolding classroom discourse. Discourse Processes. 35, 2 (Mar. 2003), 135--198. DOI: https://doi.org/10.1207/S15326950DP3502_3.",
      "doi": ""
    },
    {
      "text": "Olney, A.M. et al. 2017. Assessing the dialogic properties of classroom discourse: proportion models for imbalanced classes. Proceedings of the 10th International Conference on Educational Data Mining (2017), 162--167.",
      "doi": ""
    },
    {
      "text": "Olney, A.M. et al. 2003. Utterance classification in autotutor. Proceedings of the HLT-NAACL 03 workshop on Building educational applications using natural language processing (2003), 1--8. DOI: https://doi.org/10.3115/1118894.1118895.",
      "doi": ""
    },
    {
      "text": "Pedregosa, F. et al. 2011. Scikit-learn: machine learning in python. Journal of Machine Learning Research. 12, (2011), 2825--2830. DOI: https://doi.org/10.1007/s13398-014-0173--7.2.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Pennington, J. et al. 2014. Glove: global vectors for word representation. Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP) (2014), 1532--1543.",
      "doi": ""
    },
    {
      "text": "Ramakrishnan, A. et al. 2019. Toward automated classroom observation?: predicting positive and negative climate. IEEE Conference on Automatic Face and Gesture Recognition (2019).",
      "doi": ""
    },
    {
      "text": "Raudenbush, S.W. et al. 1993. Higher order instructional goals in secondary schools: class, teacher, and school influences. American Educational Research Journal. 30, 3 (Jan. 1993), 523--553. DOI: https://doi.org/10.3102/00028312030003523.",
      "doi": ""
    },
    {
      "text": "Resnick, L.B. and Schantz, F. 2015. Re-thinking intelligence: schools that build the mind. European Journal of Education. 50, 3 (2015), 340--349. DOI: https://doi.org/10.1111/ejed.12139.",
      "doi": ""
    },
    {
      "text": "Rodriguez-Triana, M.J. et al. 2017. Monitoring, awareness and reflection in blended technology enhanced learning: a systematic review. IJTEL. 9, 2-- 3 (2017), 126--150.",
      "doi": ""
    },
    {
      "text": "Samei, B. et al. 2014. Domain independent assessment of dialogic properties of classroom discourse. Proceedings of the 7th International Conference on Educational Data Mining (EDM). (2014), 233--236.",
      "doi": ""
    },
    {
      "text": "Samei, B. et al. 2015. Modeling classroom discourse: do models that predict dialogic instruction properties generalize across populations? Proceedings of the 8th International Conference on Educational Data Mining (2015), 444--447.",
      "doi": ""
    },
    {
      "text": "Saon, G. et al. 2015. The ibm 2015 english conversational telephone speech recognition system. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH (Dresden, Germany, 2015), 3140-- 3144. DOI: https://doi.org/10.21437/Interspeech.20161460.",
      "doi": ""
    },
    {
      "text": "Schuller, B. et al. 2009. The interspeech 2009 emotion challenge. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH. (2009), 312--315.",
      "doi": ""
    },
    {
      "text": "Shernoff, D.J. 2013. Optimal learning environments to promote student engagement. Springer New York.",
      "doi": ""
    },
    {
      "text": "Shernoff, D.J. et al. 2016. Student engagement as a function of environmental complexity in high school classrooms. Learning and Instruction. 43, (2016), 52--60. DOI: https://doi.org/10.1016/j.learninstruc.2015.12. 003.",
      "doi": ""
    },
    {
      "text": "Shernoff, D.J. et al. 2003. Student engagement in high school classrooms from the perspective of flow theory. School Psychology Quarterly. 18, 2 (2003), 158.",
      "doi": ""
    },
    {
      "text": "Shute, V.J. 2008. Focus on formative feedback. Review of Educational Research. 78, 1 (2008), 153-- 189. DOI: https://doi.org/10.3102/0034654307313795.",
      "doi": ""
    },
    {
      "text": "Stigler, J.W. et al. 1999. The TIMSS Videotape Classroom Study: Methods and Findings from an Exploratory Research Project on Eighth-Grade Mathematics Instruction in Germany, Japan, and the United States. A Research and Development Report.",
      "doi": ""
    },
    {
      "text": "Stigler, J.W. and Miller, K.F. 2018. Expertise and expert performance in teaching. The Cambridge Handbook of Expertise and Expert Performance. K.A. Ericsson et al., eds. Cambridge University Press. 431--452.",
      "doi": ""
    },
    {
      "text": "Stone, C. et al. 2019. Utterance-level modeling of indicators of engaging classroom discourse. The 12th International Conference on Educational Data Mining (Montreal, Canada, 2019), 420--425.",
      "doi": ""
    },
    {
      "text": "Suresh, A. et al. 2019. Automating analysis and feedback to improve mathematics' teachers' classroom discourse. Proceedings of the Ninth Symposium on Educational Advances in Artificial Intelligence (EAAI) (2019).",
      "doi": ""
    },
    {
      "text": "Suresh, A. et al. 2018. Using deep learning to automatically detect talk moves in teachers'mathematics lessons. Proceedings - 2018 IEEE International Conference on Big Data, Big Data 2018. (2018), 5445--5447. DOI: https://doi.org/10.1109/BigData.2018.8621901 .",
      "doi": ""
    },
    {
      "text": "Taylor, B.M. et al. 2003. The influence of teacher practices that encourage cognitive engagement in literacy learning. The Elementary School Journal. 104, 1 (2003), 3--28.",
      "doi": ""
    },
    {
      "text": "TNTP 2015. The Mirage: Confronting the Hard Truth About Our Quest for Teacher Development.",
      "doi": ""
    },
    {
      "text": "Vaswani, A. et al. 2017. Attention is all you need. Advances in neural information processing systems (2017), 5998--6008.",
      "doi": ""
    },
    {
      "text": "Wang, Z. et al. 2013. Using the lena in teacher training: promoting student involvement through automated feedback. Unterrichtswissenshaft. 4, (2013), 290--305.",
      "doi": ""
    },
    {
      "text": "Xhakaj, F. et al. 2017. Effects of a teacher dashboard for an intelligent tutoring system on teacher knowledge, lesson planning, lessons and student learning. EC-TEL. 315--329.",
      "doi": ""
    }
  ]
}