{
  "doi": "10.1145/3313831.3376652",
  "title": "\"In VR, everything is possible!\": Sketching and Simulating Spatially-Aware Interactive Spaces in Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [],
  "abstract": "We propose using virtual reality (VR) as a design tool for sketching and simulating spatially-aware interactive spaces. Using VR, designers can quickly experience their envisioned spaces and interactions by simulating technologies such as motion tracking, multiple networked devices, or unusual form factors such as spherical touchscreens or bezel-less display tiles. Design ideas can be rapidly iterated without restrictions by the number, size, or shape and availability of devices or sensors in the lab. To understand the potentials and challenges of designing in VR, we conducted a user study with 12 interaction designers. As their tool, they used a custom-built virtual design environment with finger tracking and physics simulations for natural interactions with virtual devices and objects. Our study identified the designers' experience of space in relation to their own bodies and playful design explorations as key opportunities. Key challenges were the complexities of building a usable yet versatile VR-based \"World Editor\".",
  "tags": [
    "interactive spaces",
    "simulation",
    "interaction design",
    "spatial awareness",
    "design tools",
    "prototyping",
    "sketching",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Hans-Christian Jetter",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/do/10.1145/contrib-81361609796/rel-imgonly/029_hanschristianjetterdr_6307_small.jpg",
      "acmid": "81361609796",
      "orcid": "0000-0001-6502-7114"
    },
    {
      "name": "Roman Rädle",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81416608648/rel-imgonly/roman.jpeg",
      "acmid": "81416608648",
      "orcid": "missing"
    },
    {
      "name": "Tiare Feuchtner",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-87958930557/rel-imgonly/87958930557.jpg",
      "acmid": "87958930557",
      "orcid": "0000-0002-9922-5538"
    },
    {
      "name": "Christoph Anthes",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100578026",
      "orcid": "missing"
    },
    {
      "name": "Judith Friedl",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320669",
      "orcid": "missing"
    },
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sang-Gyun An, Yongkwan Kim, Joon Hyub Lee, and Seok-Hyung Bae. 2017. Collaborative Experience Prototyping of Automotive Interior in VR with 3D Sketching and Haptic Helpers. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM Press, Oldenburg, Germany, 83--192. DOI: http://dx.doi.org/10.1145/3122986.3123002",
      "doi": "10.1145/3122986.3123002"
    },
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Fraser Anderson, Tovi Grossman, Karan Singh, and George Fitzmaurice. 2017. Experimental Evaluation of Sketching on Surfaces in VR. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5643--5654. DOI: http://dx.doi.org/10.1145/3025453.3025474",
      "doi": "10.1145/3025453.3025474"
    },
    {
      "text": "Peter Astheimer, Wolfgang Felger, and Stefan Müller. 1993. Virtual design: A generic VR system for industrial applications. Computers & Graphics 17, 6 (Nov 1993), 671--677. DOI: http://dx.doi.org/10.1016/0097--8493(93)90116-q",
      "doi": ""
    },
    {
      "text": "Peter Astheimer and Martin Göbel. 1995. Virtual Design II - an advanced VR development environment. In Eurographics. Springer Vienna, Monte Carlo, Monaco, 247--272. DOI: http://dx.doi.org/10.1007/978--3--7091--9433--1_21",
      "doi": ""
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 1968--1979. DOI: http://dx.doi.org/10.1145/2858036.2858226",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Sriram Karthik Badam and Niklas Elmqvist. 2014. PolyChrome: A Cross-Device Framework for Collaborative Web Visualization. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, NY, NY, USA, 109--118. DOI: http://dx.doi.org/10.1145/2669485.2669518",
      "doi": "10.1145/2669485.2669518"
    },
    {
      "text": "Blaine Bell, Steven Feiner, and Tobias Höllerer. 2001. View Management for Virtual and Augmented Reality. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, NY, NY, USA, 101--110. DOI: http://dx.doi.org/10.1145/502348.502363",
      "doi": "10.1145/502348.502363"
    },
    {
      "text": "Hrvoje Benko, Andrew D. Wilson, and Ravin Balakrishnan. 2008. Sphere: Multi-touch Interactions on a Spherical Display. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 77--86. DOI: http://dx.doi.org/10.1145/1449715.1449729",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "Eric A. Bier. 1990. Snap-dragging in Three Dimensions. In Proceedings of the 1990 Symposium on Interactive 3D Graphics (I3D '90). ACM, NY, NY, USA, 193--204. DOI: http://dx.doi.org/10.1145/91385.91446",
      "doi": "10.1145/91385.91446"
    },
    {
      "text": "Monica Bordegoni, Francesco Ferrise, and Joseba Lizaranzu. 2011. The use of interactive Virtual Prototypes for products specification in the concept design phase. In 2011 IEEE Virtual Reality Conference. IEEE, Singapore, Singapore. DOI: http://dx.doi.org/10.1109/vr.2011.5759466",
      "doi": "10.1109/VR.2011.5759466"
    },
    {
      "text": "Gerd Bruder, Frank Steinicke, and Wolfgang Sturzlinger. 2013. To Touch or Not to Touch?: Comparing 2D Touch and 3D Mid-air Interaction on Stereoscopic Tabletop Surfaces. In Proceedings of the 1st Symposium on Spatial User Interaction (SUI '13). ACM, NY, NY, USA, 9--16. DOI: http://dx.doi.org/10.1145/2491367.2491369",
      "doi": "10.1145/2491367.2491369"
    },
    {
      "text": "Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3718--3728. DOI: http://dx.doi.org/10.1145/3025453.3025753",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3923--3932. DOI: http://dx.doi.org/10.1145/2702123.2702451",
      "doi": "10.1145/2702123.2702451"
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Yang Li, and Björn Hartmann. 2016. Enhancing Cross-Device Interaction Scripting with Interactive Illustrations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5482--5493. DOI: http://dx.doi.org/10.1145/2858036.2858382",
      "doi": "10.1145/2858036.2858382"
    },
    {
      "text": "Pascal Chiu, Kazuki Takashima, Kazuyuki Fujita, and Yoshifumi Kitamura. 2019. Pursuit Sensing: Extending Hand Tracking Space in Mobile VR Applications. In Symposium on Spatial User Interaction (SUI '19). ACM, NY, NY, USA, 1--5. DOI: http://dx.doi.org/10.1145/3357251.3357578",
      "doi": ""
    },
    {
      "text": "James E. Cutting. 1997. How the eye measures reality and virtual reality. Behavior Research Methods, Instruments, & Computers 29, 1 (mar 1997), 27--36. DOI: http://dx.doi.org/10.3758/bf03200563",
      "doi": ""
    },
    {
      "text": "F. Dai, W. Felger, T. Frühauf, M. Göbel, D. Reiners, and Gabriel Zachmann. 1996. Virtual Prototyping Examples for Automotive Industries. In Virtual Reality World. Computerwoche Verlag, Stuttgart, Germany.",
      "doi": ""
    },
    {
      "text": "Michael F. Deering. 1995. HoloSketch: a virtual reality sketching/animation tool. ACM Transactions on Computer-Human Interaction 2, 3 (Sep 1995), 220--238. DOI: http://dx.doi.org/10.1145/210079.210087",
      "doi": "10.1145/210079.210087"
    },
    {
      "text": "Michael F. Deering. 1996. The HoloSketch VR sketching system. Commun. ACM 39, 5 (May 1996), 54--61. DOI: http://dx.doi.org/10.1145/229459.229466",
      "doi": "10.1145/229459.229466"
    },
    {
      "text": "Giuseppe Desolda, Carmelo Ardito, Hans-Christian Jetter, and Rosa Lanzilotti. 2019. Exploring spatially-aware cross-device interaction techniques for mobile collaborative sensemaking. Int. J. Hum.-Comput. Stud. 122 (2019), 1--20. DOI: http://dx.doi.org/10.1016/j.ijhcs.2018.08.006",
      "doi": ""
    },
    {
      "text": "Tao Dong, Elizabeth F. Churchill, and Jeffrey Nichols. 2016. Understanding the Challenges of Designing and Developing Multi-Device Experiences. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, NY, NY, USA, 62--72. DOI: http://dx.doi.org/10.1145/2901790.2901851",
      "doi": "10.1145/2901790.2901851"
    },
    {
      "text": "Phillip S. Dunston, Laura L. Arns, James D. Mcglothlin, Gregory C. Lasker, and Adam G. Kushner. 2011. An Immersive Virtual Reality Mock-Up for Design Review of Hospital Patient Rooms. In Collaborative Design in Virtual Environments. Springer Netherlands, 167--176. DOI: http://dx.doi.org/10.1007/978--94-007-0605--7_15",
      "doi": ""
    },
    {
      "text": "Tiare Feuchtner and Jörg Müller. 2018. Ownershift: Facilitating Overhead Interaction in Virtual Reality with an Ownership-Preserving Hand Space Shift. In ACM User Interface Software and Technology Symposium (UIST '18). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/3242587.3242594",
      "doi": "10.1145/3242587.3242594"
    },
    {
      "text": "George W Fitzmaurice, Azam Khan, William Buxton, Gordon Kurtenbach, and Ravin Balakrishnan. 2003. Sentient Data Access via a Diverse Society of Devices. Queue 1, 8 (2003), 52--62. DOI: http://dx.doi.org/10.1145/966712.966721",
      "doi": "10.1145/966712.966721"
    },
    {
      "text": "I. Gibson, D .Brown, S. Cobb, and R. Eastgate. 1993. Virtual Reality and Rapid Prototyping: Conflicting or Complimentary?. In 1993 International Solid Freeform Fabrication Symposium. University of Texas at Austin, 113--120. DOI: http://dx.doi.org/10.15781/t2qv3cm8t",
      "doi": ""
    },
    {
      "text": "Tony Gjerlufsen, Clemens Nylandsted Klokmose, James Eagan, Clément Pillias, and Michel Beaudouin-Lafon. 2011. Shared substance: developing flexible multi-surface applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3383--3392. DOI: http://dx.doi.org/10.1145/1978942.1979446",
      "doi": "10.1145/1978942.1979446"
    },
    {
      "text": "Antonino Gomes de Sá and Gabriel Zachmann. 1999. Virtual Reality as a Tool for Verification of Assembly and Maintenance Processes. Computers & Graphics 23, 3 (1999), 389 --403. DOI: http://dx.doi.org/10.1016/S0097--8493(99)00047--3",
      "doi": ""
    },
    {
      "text": "Jens Grubert, Matthias Kranz, and Aaron J. Quigley. 2016. Challenges in Mobile Multi-Device Ecosystems. CoRR abs/1605.07760 (2016). DOI: http://dx.doi.org/10.1186/s13678-016-0007-y",
      "doi": ""
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An inexpensive and lightweight mechanical exoskeleton for motion capture and force feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1991--1995. DOI: http://dx.doi.org/10.1145/2858036.2858487",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Sinem Güven and Steven Feiner. 2003. Authoring 3D Hypermedia for Wearable Augmented and Virtual Reality. In Proceedings of the 7th IEEE International Symposium on Wearable Computers (ISWC '03). IEEE Computer Society, Washington, DC, USA, 118--. http://dl.acm.org/citation.cfm?id=946249.946908",
      "doi": "10.5555/946249.946908"
    },
    {
      "text": "Victor Haefner. 2014. PolyVR - A Virtual Reality Authoring System. In EuroVR 2014 - Conference and Exhibition of the European Association of Virtual and Augmented Reality, Jerome Perret, Valter Basso, Francesco Ferrise, Kaj Helin, Vincent Lepetit, James Ritchie, Christoph Runde, Mascha van der Voort, and Gabriel Zachmann (Eds.). The Eurographics Association. DOI: http://dx.doi.org/10.2312/eurovr.20141343",
      "doi": ""
    },
    {
      "text": "Michael Haller, Jakob Leitner, Thomas Seifried, James R. Wallace, Stacey D. Scott, Christoph Richter, Peter Brandl, Adam Gokcezade, and Seth Hunter. 2010. The NiCE Discussion Room: Integrating Paper and Digital Media to Support Co-Located Group Meetings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 609--618. DOI: http://dx.doi.org/10.1145/1753326.1753418",
      "doi": "10.1145/1753326.1753418"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: enabling and understanding cross-device interaction. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 2773--2782. DOI: http://dx.doi.org/10.1145/2556288.2557170",
      "doi": ""
    },
    {
      "text": "Alastair Hampshire, Hartmut Seichter, Raphaël Grasset, and Mark Billinghurst. 2006. Augmented Reality Authoring: Generic Context from Programmer to Designer. In Proceedings of the 18th Australia Conference on Computer-Human Interaction: Design: Activities, Artefacts and Environments (OZCHI '06). ACM, NY, NY, USA, 409--412. DOI: http://dx.doi.org/10.1145/1228175.1228259",
      "doi": "10.1145/1228175.1228259"
    },
    {
      "text": "Rex Hartson and Pardha S Pyla. 2012. The UX Book: Process and guidelines for ensuring a quality user experience. Elsevier.",
      "doi": "10.5555/2207824"
    },
    {
      "text": "Ronan Hinchet, Velko Vechev, Herbert Shea, and Otmar Hilliges. 2018. DextrES: Wearable Haptic Feedback for Grasping in VR via a Thin Form-Factor Electrostatic Brake. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 901--912. DOI: http://dx.doi.org/10.1145/3242587.3242657",
      "doi": "10.1145/3242587.3242657"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1247--1256. DOI: http://dx.doi.org/10.1145/2702123.2702215",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Thomas Howard, Maud Marchal, Anatole Lécuyer, and Claudio Pacchierotti. 2019. PUMAH: Pan-tilt Ultrasound Mid-Air Haptics for larger interaction workspace in virtual reality. IEEE Transactions on Haptics (2019). DOI: http://dx.doi.org/10.1109/TOH.2019.2963028",
      "doi": ""
    },
    {
      "text": "Maria Husmann, Michael Spiegel, Alfonso Murolo, and Moira C. Norrie. 2016. UI Testing Cross-Device Applications. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 179--188. DOI: http://dx.doi.org/10.1145/2992154.2992177",
      "doi": ""
    },
    {
      "text": "Giulio Iacucci, Carlo Iacucci, and Kari Kuutti. 2002. Imagining and Experiencing in Design, the Role of Performances. In Proceedings of the Second Nordic Conference on Human-computer Interaction (NordiCHI '02). ACM, NY, NY, USA, 167--176. DOI: http://dx.doi.org/10.1145/572020.572040",
      "doi": "10.1145/572020.572040"
    },
    {
      "text": "Victoria Interrante, Brian Ries, and Lee Anderson. 2006. Distance Perception in Immersive Virtual Environments, Revisited. In Proceedings of the IEEE Conference on Virtual Reality (VR '06). IEEE Computer Society, Washington, DC, USA, 3--10. DOI: http://dx.doi.org/10.1109/VR.2006.52",
      "doi": "10.1109/VR.2006.52"
    },
    {
      "text": "Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems (CHI '08). ACM Press, New York, New York, USA, 201. DOI: http://dx.doi.org/10.1145/1357054.1357089",
      "doi": ""
    },
    {
      "text": "Sankar Jayaram, Hugh I Connacher, and Kevin W Lyons. 1997. Virtual assembly using virtual reality techniques. Computer-Aided Design 29, 8 (aug 1997), 575--584. DOI: http://dx.doi.org/10.1016/s0010--4485(96)00094--2",
      "doi": ""
    },
    {
      "text": "Hans-Christian Jetter, Harald Reiterer, and Florian Geyer. 2014. Blended Interaction: Understanding Natural Human--Computer Interaction in post-WIMP Interactive Spaces. Personal Ubiquitous Comput. 18, 5 (June 2014), 1139--1158. DOI: http://dx.doi.org/10.1007/s00779-013-0725--4",
      "doi": "10.1007/s00779-013-0725-4"
    },
    {
      "text": "Hans-Christian Jetter, Michael Zöllner, Jens Gerken, and Harald Reiterer. 2012. Design and Implementation of Post-WIMP Distributed User Interfaces with ZOIL. International Journal of Human--Computer Interaction 28, 11 (2012), 737--747. DOI: http://dx.doi.org/10.1080/10447318.2012.715539",
      "doi": ""
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbæk. 2015. Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 147--156. DOI: http://dx.doi.org/10.1145/2807442.2807475",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "Joseph J. LaViola Jr., Ernst Kruijff, Ryan P. McMahan, Doug Bowman, and Ivan P. Poupyrev. 2017. 3D User Interfaces: Theory and Practice (2nd Edition) (Usability). Addison-Wesley Professional.",
      "doi": ""
    },
    {
      "text": "Clemens N Klokmose, James R Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: shareable dynamic media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, 280--290. DOI: http://dx.doi.org/10.1145/2807442.2807446",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Stan Kurkovsky. 2015. Teaching Software Engineering with LEGO Serious Play. In Proceedings of the 2015 ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE '15). ACM, NY, NY, USA, 213--218. DOI: http://dx.doi.org/10.1145/2729094.2742604",
      "doi": "10.1145/2729094.2742604"
    },
    {
      "text": "Ricardo Langner, Tom Horak, and Raimund Dachselt. 2018. VisTiles: Coordinating and Combining Co-located Mobile Devices for Visual Data Exploration. IEEE transactions on visualization and computer graphics 24, 1 (2018), 626--636. DOI: http://dx.doi.org/10.1109/TVCG.2017.2744019",
      "doi": ""
    },
    {
      "text": "Youn-Kyung Lim, Erik Stolterman, and Josh Tenenberg. 2008. The Anatomy of Prototypes: Prototypes As Filters, Prototypes As Manifestations of Design Ideas. ACM Trans. Comput.-Hum. Interact. 15, 2, Article 7 (July 2008), 27 pages. DOI: http://dx.doi.org/10.1145/1375761.1375762",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Robert W. Lindeman, John L. Sibert, and James K. Hahn. 1999. Towards Usable VR: An Empirical Study of User Interfaces for Immersive Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 64--71. DOI: http://dx.doi.org/10.1145/302979.302995",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: collaborative use of mobile phones for photo sharing. In Proceedings of the 2011 annual conference on Human factors in computing systems (CHI '11). ACM Press, New York, New York, USA, 1787. DOI: http://dx.doi.org/10.1145/1978942.1979201",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "Nicolai Marquardt, Frederik Brudy, Can Liu, Ben Bengler, and Christian Holz. 2018. Surface Constellations: A Modular Hardware Platform for Ad-Hoc Reconfigurable Cross-Device Workspaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 354:1--354:14. DOI: http://dx.doi.org/10.1145/3173574.3173928",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The Proximity Toolkit: Prototyping Proxemic Interactions in Ubiquitous Computing Ecologies. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 315--326. DOI: http://dx.doi.org/10.1145/2047196.2047238",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device interaction via micro-mobility and f-formations. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM Press, New York, New York, USA, 13. DOI: http://dx.doi.org/10.1145/2380116.2380121",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Joshua McVeigh-Schultz, Max Kreminski, Keshav Prasad, Perry Hoberman, and Scott S. Fisher. 2018. Immersive Design Fiction: Using VR to Prototype Speculative Interfaces and Interaction Rituals Within a Virtual Storyworld. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 817--829. DOI: http://dx.doi.org/10.1145/3196709.3196793",
      "doi": ""
    },
    {
      "text": "Paul Merrell, Eric Schkufza, Zeyang Li, Maneesh Agrawala, and Vladlen Koltun. 2011. Interactive Furniture Layout Using Interior Design Guidelines. ACM Trans. Graph. 30, 4, Article 87 (July 2011), 10 pages. DOI: http://dx.doi.org/10.1145/2010324.1964982",
      "doi": "10.1145/2010324.1964982"
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4574--4584. DOI: http://dx.doi.org/10.1145/3025453.3025547",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling and Anind K. Dey. 2016. XDBrowser: User-Defined Cross-Device Web Page Designs. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5494--5505. DOI: http://dx.doi.org/10.1145/2858036.2858048",
      "doi": ""
    },
    {
      "text": "Michael Nebeling, Maria Husmann, Christoph Zimmerli, Giulio Valente, and Moira C. Norrie. 2015. XDSession: Integrated Development and Testing of Cross-device Applications. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '15). ACM, NY, NY, USA, 22--27. DOI: http://dx.doi.org/10.1145/2774225.2775075",
      "doi": ""
    },
    {
      "text": "Michael Nebeling, Theano Mintsi, Maria Husmann, and Moira Norrie. 2014. Interactive Development of Cross-device User Interfaces. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2793--2802. DOI: http://dx.doi.org/10.1145/2556288.2556980",
      "doi": "10.1145/2556288.2556980"
    },
    {
      "text": "Rui Nóbrega and Nuno Correia. 2012. Magnetic Augmented Reality: Virtual Objects in Your Space. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, NY, NY, USA, 332--335. DOI: http://dx.doi.org/10.1145/2254556.2254620",
      "doi": "10.1145/2254556.2254620"
    },
    {
      "text": "N. Nomoto, J. Omura, K. Awada, K. Mamura, and M. Agamachi. 1995. Kitchen planning system using kansei VR. In Symbiosis of Human and Artifact, Yuichiro Anzai, Katsuhiko Ogawa, and Hirohiko Mori (Eds.). Advances in Human Factors/Ergonomics, Vol. 20. Elsevier, 185 -- 190. DOI: http://dx.doi.org/https://doi.org/10.1016/S0921--2647(06)80032--8",
      "doi": ""
    },
    {
      "text": "Benjamin Nuernberger, Eyal Ofek, Hrvoje Benko, and Andrew D. Wilson. 2016. SnapToReality: Aligning Augmented Reality to the Real World. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1233--1244. DOI: http://dx.doi.org/10.1145/2858036.2858250",
      "doi": ""
    },
    {
      "text": "Ji-Young Oh, Wolfgang Stuerzlinger, and John Danahy. 2006. SESAME: Towards Better 3D Conceptual Design Systems. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, NY, NY, USA, 80--89. DOI: http://dx.doi.org/10.1145/1142405.1142419",
      "doi": "10.1145/1142405.1142419"
    },
    {
      "text": "Thies Pfeiffer and Nadine Pfeiffer-Leßmann. 2018. Virtual Prototyping of Mixed Reality Interfaces with Internet of Things (IoT) Connectivity. i-com 17, 2 (Aug 2018), 179--186. DOI: http://dx.doi.org/10.1515/icom-2018-0025",
      "doi": ""
    },
    {
      "text": "Nadine Pfeiffer-Leßmann and Thies Pfeiffer. 2018. ExProtoVAR: A Lightweight Tool for Experience-Focused Prototyping of Augmented Reality Applications Using Virtual Reality. In HCI International 2018 -- Posters' Extended Abstracts, Constantine Stephanidis (Ed.). Springer International Publishing, Cham, 311--318. DOI: http://dx.doi.org/10.1007/978--3--319--92279--9_42",
      "doi": ""
    },
    {
      "text": "Wayne Piekarski and Bruce H. Thomas. 2001. Tinmith-Metro: New Outdoor Techniques for Creating City Models with an Augmented Reality Wearable Computer. In Proceedings of the 5th IEEE International Symposium on Wearable Computers (ISWC '01). IEEE Computer Society, Washington, DC, USA, 31--. http://dl.acm.org/citation.cfm?id=580581.856546",
      "doi": ""
    },
    {
      "text": "Thomas Plank, Hans-Christian Jetter, Roman Rädle, Clemens Nylandsted Klokmose, Thomas Luger, and Harald Reiterer. 2017. Is Two Enough?! Studying Benefits, Barriers, and Biases of Multi-Tablet Use for Collaborative Visualization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). 4548--4560. DOI: http://dx.doi.org/10.1145/3025453.3025537",
      "doi": "10.1145/3025453.3025537"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Jonathan Fischer, Inti Gabriel, Clemens N. Klokmose, Harald Reiterer, and Christian Holz. 2018. PolarTrack: Optical Outside-In Device Tracking That Exploits Display Polarization. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 497, 9 pages. DOI: http://dx.doi.org/10.1145/3173574.3174071",
      "doi": "10.1145/3173574.3174071"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces - ITS '14. ACM Press, New York, New York, USA, 45--54. DOI: http://dx.doi.org/10.1145/2669485.2669500",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 3913--3922. DOI: http://dx.doi.org/10.1145/2702123.2702287",
      "doi": "10.1145/2702123.2702287"
    },
    {
      "text": "E. Ragan, C. Wilkes, D.A. Bowman, and T. Hollerer. 2009. Simulation of Augmented Reality Systems in Purely Virtual Environments. In 2009 IEEE Virtual Reality Conference. IEEE. DOI: http://dx.doi.org/10.1109/vr.2009.4811058",
      "doi": ""
    },
    {
      "text": "Donghao Ren, Tibor Goldschwendt, YunSuk Chang, and Tobias Hollerer. 2016. Evaluating wide-field-of-view augmented reality with mixed reality simulation. In 2016 IEEE Virtual Reality (VR). IEEE. DOI: http://dx.doi.org/10.1109/vr.2016.7504692",
      "doi": ""
    },
    {
      "text": "G. Robles-De-La-Torre. 2006. The importance of the sense of touch in virtual and real environments. IEEE MultiMedia 13, 3 (July 2006), 24--30. DOI: http://dx.doi.org/10.1109/MMUL.2006.69",
      "doi": ""
    },
    {
      "text": "Samuel B. Schorr and Allison M. Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3115--3119. DOI: http://dx.doi.org/10.1145/3025453.3025744",
      "doi": ""
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators & Virtual Environments 6, 6 (1997), 603--616. DOI: http://dx.doi.org/10.1162/pres.1997.6.6.603",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, Ao Yu, Bowen Zhang, Haihua Zhang, Janet Nebeling, and Michael Nebeling. 2018. XD-AR: Challenges and Opportunities in Cross-Device Augmented Reality Application Development. Proc. ACM Hum.-Comput. Interact. 2, EICS, Article 7 (June 2018), 24 pages. DOI: http://dx.doi.org/10.1145/3229089",
      "doi": "10.1145/3229089"
    },
    {
      "text": "Martin Spindler, Marcel Martsch, and Raimund Dachselt. 2012. Going Beyond the Surface: Studying Multi-layer Interaction Above the Tabletop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1277--1286. DOI: http://dx.doi.org/10.1145/2207676.2208583",
      "doi": "10.1145/2207676.2208583"
    },
    {
      "text": "Norbert A. Streitz, Jörg Geißler, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz, and Ralf Steinmetz. 1999. i-LAND: an interactive landscape for creativity and innovation. In Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit (CHI '99). ACM Press, New York, New York, USA, 120--127. DOI: http://dx.doi.org/10.1145/302979.303010",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Robert J. Teather, Andriy Pavlovych, Wolfgang Stuerzlinger, and I. Scott MacKenzie. 2009. Effects of Tracking Technology, Latency, and Spatial Jitter on Object Movement. In Proceedings of the 2009 IEEE Symposium on 3D User Interfaces (3DUI '09). IEEE Computer Society, Washington, DC, USA, 43--50. DOI: http://dx.doi.org/10.1109/3DUI.2009.4811204",
      "doi": "10.1109/3DUI.2009.4811204"
    },
    {
      "text": "G. Gary Wang. 2002. Definition and Review of Virtual Prototyping. Journal of Computing and Information Science in Engineering 2, 3 (2002), 232. DOI: http://dx.doi.org/10.1115/1.1526508",
      "doi": ""
    },
    {
      "text": "M Weiser. 1991. The computer for the 21st century. Scientific American 3, 3 (1991), 94--104. DOI: http://dx.doi.org/10.1145/329124.329126",
      "doi": ""
    },
    {
      "text": "Malte Weiss, Simon Voelker, Christine Sutter, and Jan Borchers. 2010. BendDesk: Dragging Across the Curve. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 1--10. DOI: http://dx.doi.org/10.1145/1936652.1936654",
      "doi": "10.1145/1936652.1936654"
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfigurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 86, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173660",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "Daniel Wigdor, Hao Jiang, Clifton Forlines, Michelle Borkin, and Chia Shen. 2009. WeSpace: The Design Development and Deployment of a Walk-up and Share Multi-surface Visual Collaboration System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1237--1246. DOI: http://dx.doi.org/10.1145/1518701.1518886",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Daniel Wigdor, Chia Shen, Clifton Forlines, and Ravin Balakrishnan. 2006. Table-Centric Interactive Spaces for Real-Time Collaboration. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, NY, NY, USA, 103--107. DOI: http://dx.doi.org/10.1145/1133265.1133286",
      "doi": "10.1145/1133265.1133286"
    },
    {
      "text": "Graham Wilson, Mark McGill, Matthew Jamieson, Julie R. Williamson, and Stephen A. Brewster. 2018. Object Manipulation in Virtual Reality Under Increasing Levels of Translational Gain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 99, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173673",
      "doi": ""
    },
    {
      "text": "John R. Wilson. 1999. Virtual environments applications and applied ergonomics. Applied Ergonomics 30, 1 (Feb 1999), 3--9. DOI: http://dx.doi.org/10.1016/s0003--6870(98)00040--4",
      "doi": ""
    },
    {
      "text": "Raphael Wimmer, Fabian Hennecke, Florian Schulz, Sebastian Boring, Andreas Butz, and Heinrich Hußmann. 2010. Curve: Revisiting the Digital Desk. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, NY, NY, USA, 561--570. DOI: http://dx.doi.org/10.1145/1868914.1868977",
      "doi": "10.1145/1868914.1868977"
    },
    {
      "text": "Pawel Wozniak, Nitesh Goyal, Przemyslaw Kucharski, Lars Lischke, Sven Mayer, and Morten Fjeld. 2016. RAMPARTS: Supporting Sensemaking with Spatially-Aware Mobile Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2447--2460. DOI: http://dx.doi.org/10.1145/2858036.2858491",
      "doi": "10.1145/2858036.2858491"
    },
    {
      "text": "Chi-Jui Wu, Steven Houben, and Nicolai Marquardt. 2017. EagleSense: Tracking People and Devices in Interactive Spaces Using Real-Time Top-View Depth-Sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3929--3942. DOI: http://dx.doi.org/10.1145/3025453.3025562",
      "doi": "10.1145/3025453.3025562"
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Roman Rädle, Hans-Christian Jetter, Clemens Klokmose, and Harald Reiterer. 2016. When tablets meet tabletops: The effect of tabletop size. In Conference on Human Factors in Computing Systems - Proceedings (CHI '16). DOI: http://dx.doi.org/10.1145/2858036.2858224",
      "doi": ""
    }
  ]
}