{
  "doi": "10.1145/3313831.3376483",
  "title": "KeyMap: Improving Keyboard Shortcut Vocabulary Using Norman's Mapping",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "We introduce a new shortcut interface called KeyMap that is designed to leverage Norman's principle of natural mapping. Rather than displaying shortcut command labels in linear menus, KeyMap displays a virtual keyboard with command labels displayed directly on its keys. A crowdsourced experiment compares KeyMap to Malacria et al.'s ExposeHK using an extension of their protocol to also test recall. Results show KeyMap users remembered 1 more shortcut than ExposeHK immediately after training, and this advantage increased to 4.5 more shortcuts when tested again after 24 hours. KeyMap users also incidentally learned more shortcuts that they had never practised. We demonstrate how KeyMap can be added to existing web-based applications using a Chrome extension.",
  "authors": [
    {
      "name": "Blaine Lewis",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314639",
      "orcid": "0000-0002-8825-5782"
    },
    {
      "name": "Greg d'Eon",
      "institution": "Universiy of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480509",
      "orcid": "missing"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Daniel Vogel",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    }
  ],
  "references": [
    {
      "text": "Jonathan Aceituno and Nicolas Roussel. 2014. The Hotkey Palette: Flexible Contextual Retrieval of Chosen Documents and Windows. In Proceedings of the 26th Conference on L'Interaction Homme-Machine (IHM'14). ACM, NY, NY, USA, 55--59. DOI: http://dx.doi.org/10.1145/2670444.2670452",
      "doi": "10.1145/2670444.2670452"
    },
    {
      "text": "Jason Alexander and Andy Cockburn. 2008. An Empirical Characterisation of Electronic Document Navigation. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 123--130. http://dl.acm.org/citation.cfm?id=1375714.1375736",
      "doi": "10.5555/1375714.1375736"
    },
    {
      "text": "Fraser Anderson and Walter F. Bischof. 2013. Learning and Performance with Gesture Guides. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1109--1118. DOI: http://dx.doi.org/10.1145/2470654.2466143",
      "doi": ""
    },
    {
      "text": "Alan D. Baddeley, Michael W. Eysenck, and Mike Anderson. 2009. Memory. Psychology Press.",
      "doi": ""
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 1987. Interfacing Thought: Cognitive Aspects of Human-computer Interaction. MIT Press, Cambridge, MA, USA, Chapter Paradox of the Active User, 80--111. http://dl.acm.org/citation.cfm?id=28446.28451",
      "doi": "10.5555/28446.28451"
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2004. A Comparison of Static, Adaptive, and Adaptable Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 89--96. DOI: http://dx.doi.org/10.1145/985692.985704",
      "doi": "10.1145/985692.985704"
    },
    {
      "text": "Paul M. Fitts and Charles M. Seeger. 1953. S-R compatibility: spatial characteristics of stimulus and response codes. Journal of Experimental Psychology 46, 3 (1953), 199--210.",
      "doi": ""
    },
    {
      "text": "Emmanouil Giannisakis, Gilles Bailly, Sylvain Malacria, and Fanny Chevalier. 2017. IconHK: Using Toolbar Button Icons to Communicate Keyboard Shortcuts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4715--4726. DOI: http://dx.doi.org/10.1145/3025453.3025595",
      "doi": "10.1145/3025453.3025595"
    },
    {
      "text": "Wayne D. Gray and John K. Lindstedt. 2017. Plateaus, Dips, and Leaps: Where to Look for Inventions and Discoveries During Skilled Performance. Cognitive Science 41, 7 (2017), 1838--1870.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, Pierre Dragicevic, and Ravin Balakrishnan. 2007. Strategies for Accelerating On-line Learning of Hotkeys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1591--1600. DOI: http://dx.doi.org/10.1145/1240624.1240865",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "Brian Krisler and Richard Alterman. 2008. Training Towards Mastery: Overcoming the Active User Paradox. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, NY, NY, USA, 239--248. DOI: http://dx.doi.org/10.1145/1463160.1463186",
      "doi": "10.1145/1463160.1463186"
    },
    {
      "text": "David M. Lane, H. Albert Napier, S. Camille Peres, and Aniko Sandor. 2005. Hidden Costs of Graphical User Interfaces: Failure to Make the Transition from Menus and Icon Toolbars to Keyboard Shortcuts. International Journal of Human Computer Interaction 18, 2 (2005), 133--144. DOI: http://dx.doi.org/10.1207/s15327590ijhc1802_1",
      "doi": ""
    },
    {
      "text": "Sylvain Malacria, Gilles Bailly, Joel Harrison, Andy Cockburn, and Carl Gutwin. 2013a. Promoting Hotkey Use Through Rehearsal with ExposeHK. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 573--582. DOI: http://dx.doi.org/10.1145/2470654.2470735",
      "doi": "10.1145/2470654.2470735"
    },
    {
      "text": "Sylvain Malacria, Joey Scarr, Andy Cockburn, Carl Gutwin, and Tovi Grossman. 2013b. Skillometers: Reflective Widgets That Motivate and Help Users to Improve Performance. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/2501988.2501996",
      "doi": "10.1145/2501988.2501996"
    },
    {
      "text": "Hugh McLoone, Ken Hinckley, and Ed Cutrell. 2003. Bimanual Interaction on the Microsoft Office Keyboard. (September 2003), 49--56. https://www.microsoft.com/en-us/research/publication/bimanual-interaction-on-the-microsoft-office-keyboard/",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books, Inc., New York, NY, USA.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Daniel L. Odell, Richard C. Davis, Andrew Smith, and Paul K. Wright. 2004. Toolglasses, Marking Menus, and Hotkeys: A Comparison of One and Two-handed Command Selection Techniques. In Proceedings of Graphics Interface 2004 (GI '04). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 17--24. http://dl.acm.org/citation.cfm?id=1006058.1006061",
      "doi": "10.5555/1006058.1006061"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, and Carl Gutwin. 2013. Supporting and Exploiting Spatial Memory in User Interfaces. Foundations and Trends in Human-Computer Interaction 6, 1 (2013), 1--84. DOI: http://dx.doi.org/10.1561/1100000046",
      "doi": "10.1561/1100000046"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Philip Quinn. 2011. Dips and Ceilings: Understanding and Supporting Transitions to Expertise in User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2741--2750. DOI: http://dx.doi.org/10.1145/1978942.1979348",
      "doi": "10.1145/1978942.1979348"
    },
    {
      "text": "Richard M. Shiffrin and Walter Schneider. 1977. Controlled and automatic human information processing: II. Perceptual learning, automatic attending and a general theory. Psychological Review 84, 2 (1977), 127--190.",
      "doi": ""
    },
    {
      "text": "H A Simon. 1956. Rational choice and the structure of the environment. (1956). DOI: http://dx.doi.org/10.1037/h0042769",
      "doi": ""
    },
    {
      "text": "S. Tak, P. Westendorp, and I. van Rooij. 2013. Satisficing and the Use of Keyboard Shortcuts: Being Good Enough Is Enough? Interacting with Computers 25, 5 (Sept 2013), 404--416. DOI: http://dx.doi.org/10.1093/iwc/iwt016",
      "doi": ""
    },
    {
      "text": "Mike Tucker and Rob Ellis. 1998. On the Relations Between Seen Objects and Components of Potential Actions. Journal of Experimental Psychology: Human Perception and Performance 24, 3 (1998), 830--846.",
      "doi": ""
    },
    {
      "text": "Md. Sami Uddin, Carl Gutwin, and Andy Cockburn. 2017. The Effects of Artificial Landmarks on Learning and Performance in Spatial-Memory Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3843--3855. DOI: http://dx.doi.org/10.1145/3025453.3025497",
      "doi": "10.1145/3025453.3025497"
    },
    {
      "text": "Jordana S. Wynn, Michael B. Bone, Michelle C. Dragan, Kari L. Hoffman, Bradley R. Buchsbaum, and Jennifer D. Ryan. 2016. Selective scanpath repetition during memory-guided visual search. Visual cognition 24, 1 (02 Jan 2016), 15--37. DOI: http://dx.doi.org/10.1080/13506285.2016.1175531 27570471[pmid].",
      "doi": ""
    }
  ]
}