{
  "doi": "10.1145/3313831.3376860",
  "title": "An Experimental Study of Bias in Platform Worker Ratings: The Role of Performance Quality and Gender",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We study how the ratings people receive on online labor platforms are influenced by their performance, gender, their rater's gender, and displayed ratings from other raters. We conducted a deception study in which participants collaborated on a task with a pair of simulated workers, who varied in gender and performance level, and then rated their performance. When the performance of paired workers was similar, low-performing females were rated lower than their male counterparts. Where there was a clear performance difference between paired workers, low-performing females were preferred over a similarly-performing male peer. Furthermore, displaying an average rating from other raters made ratings more extreme, resulting in high performing workers receiving significantly higher ratings and low performers lower ratings compared to when average ratings were absent. This work contributes an empirical understanding of when biases in ratings manifest, and offers recommendations for how online work platforms can counter these biases.",
  "tags": [
    "digital ratings",
    "bias in ratings",
    "bias in gig platforms",
    "social mimicry",
    "gender discrimination"
  ],
  "authors": [
    {
      "name": "Farnaz Jahanbakhsh",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160423",
      "orcid": "0000-0003-0492-3040"
    },
    {
      "name": "Justin Cranshaw",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438597110",
      "orcid": "missing"
    },
    {
      "name": "Scott Counts",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398596",
      "orcid": "0000-0003-1507-5200"
    },
    {
      "name": "Walter S. Lasecki",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490695200",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    }
  ],
  "references": [
    {
      "text": "2010. Overview of Race and Hispanic Origin: 2010. (2010). https://www.census.gov/prod/cen2010/briefs/c2010br-02.pdf",
      "doi": ""
    },
    {
      "text": "2018. Popular Baby Names | NYC Open Data. (2018). https://data.cityofnewyork.us/Health/Popular-Baby-Names/25th-nujf",
      "doi": ""
    },
    {
      "text": "Bruno Abrahao, Karen Cook, and others. 2016. Power Imbalance and Rating Systems. In Tenth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib, Michael S Bernstein, and Margaret Levi. 2017. Examining crowd work and gig work through the historical lens of piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4599--4616.",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Joseph G Altonji and Rebecca M Blank. 1999. Race and gender in the labor market. Handbook of labor economics 3 (1999), 3143--3259.",
      "doi": ""
    },
    {
      "text": "Sinan Aral. 2014. The problem with online ratings. MIT Sloan Management Review 55, 2 (2014), 47.",
      "doi": ""
    },
    {
      "text": "Ian Ayres and Peter Siegelman. 1995. Race and gender discrimination in bargaining for a new car. The American Economic Review (1995), 304--321.",
      "doi": ""
    },
    {
      "text": "Rajiv D Banker and Iny Hwang. 2008. Importance of Measures of Past Performance: Empirical Evidence on Quality of e-Service Providers. Contemporary Accounting Research 25, 2 (2008), 307--337.",
      "doi": ""
    },
    {
      "text": "Marianne Bertrand and Sendhil Mullainathan. 2004. Are Emily and Greg more employable than Lakisha and Jamal? A field experiment on labor market discrimination. American economic review 94, 4 (2004), 991--1013.",
      "doi": ""
    },
    {
      "text": "Emilio J Castilla. 2008. Gender, race, and meritocracy in organizational careers. Amer. J. Sociology 113, 6 (2008), 1479--1526.",
      "doi": ""
    },
    {
      "text": "Jason Chan and Jing Wang. 2014. Hiring biases in online labor markets: The case of gender stereotyping. Proceedings of the International Conference on Information Systems (ICIS) (2014).",
      "doi": ""
    },
    {
      "text": "Liang Chen. 2018. Exploring Gender Effects on Peer Rating in Open Innovation and Crowdsourcing: A Case of Website Evaluation. (2018).",
      "doi": ""
    },
    {
      "text": "Mary Ellen Cline, David S Holmes, and Jana C Werner. 1977. Evaluations of the work of men and women as a function of the sex of the judge and type of work. Journal of Applied Social Psychology 7, 1 (1977), 89--93.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. The effect size index: d. Statistical power analysis for the behavioral sciences 2 (1988), 284--288.",
      "doi": ""
    },
    {
      "text": "Jean M Converse, Converse Jean McDonnell, and Stanley Presser. 1986. Survey questions: Handcrafting the standardized questionnaire. Vol. 63. Sage.",
      "doi": ""
    },
    {
      "text": "Nick Craswell, Onno Zoeter, Michael Taylor, and Bill Ramsey. 2008. An experimental comparison of click position-bias models. In Proceedings of the 2008 international conference on web search and data mining. ACM, 87--94.",
      "doi": "10.1145/1341531.1341545"
    },
    {
      "text": "Geoff Cumming. 2008. Replication and p intervals: p values predict the future only vaguely, but confidence intervals do much better. Perspectives on Psychological Science 3, 4 (2008), 286--300.",
      "doi": ""
    },
    {
      "text": "Geoff Cumming and Robert Calin-Jageman. 2016. Introduction to the new statistics: Estimation, open science, and beyond. Routledge.",
      "doi": ""
    },
    {
      "text": "Kay Deaux and Janet Taynor. 1973. Evaluation of male and female ability: Bias works two ways. Psychological reports 32, 1 (1973), 261--262.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt and Amelia R Malone. 2015. The promise of the sharing economy among disadvantaged communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2285--2294.",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Alice H Eagly, Mona G Makhijani, and Bruce G Klonsky. 1992. Gender and the evaluation of leaders: A meta-analysis. Psychological bulletin 111, 1 (1992), 3.",
      "doi": ""
    },
    {
      "text": "Benjamin G Edelman and Michael Luca. 2014. Digital discrimination: The case of Airbnb. com. Harvard Business School NOM Unit Working Paper 14-054 (2014).",
      "doi": ""
    },
    {
      "text": "Naomi Ellemers, Henriette Van den Heuvel, Dick De Gilder, Anne Maass, and Alessandra Bonvini. 2004. The underrepresentation of women in science: Differential commitment or the queen bee syndrome? British Journal of Social Psychology 43, 3 (2004), 315--338.",
      "doi": ""
    },
    {
      "text": "Michael Fay and Lesley Williams. 1993. Gender bias and the availability of business loans. Journal of Business Venturing 8, 4 (1993), 363--376.",
      "doi": ""
    },
    {
      "text": "Apostolos Filippas, John J Horton, and Joseph Golden. 2017. Reputation in the long-run. (2017).",
      "doi": ""
    },
    {
      "text": "Peter Glick and Susan T Fiske. 1997. Hostile and benevolent sexism: Measuring ambivalent sexist attitudes toward women. Psychology of women quarterly 21, 1 (1997), 119--135.",
      "doi": ""
    },
    {
      "text": "Mareike Glöss, Moira McGregor, and Barry Brown. 2016. Designing for labour: uber and the on-demand mobile workforce. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 1632--1643.",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Philip Goldberg. 1968. Are women prejudiced against women? Trans-action 5, 5 (1968), 28--30.",
      "doi": ""
    },
    {
      "text": "Laura Gonzalez and Yuliya Komarova Loureiro. 2014. When can a photo increase credit? The impact of lender and borrower profiles on online peer-to-peer loans. Journal of Behavioral and Experimental Finance 2 (2014), 44--58.",
      "doi": ""
    },
    {
      "text": "Mary L Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The crowd is a collaborative network. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. ACM, 134--147.",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "Mihajlo Grbovic. 2017. Search ranking and personalization at Airbnb. In Proceedings of the Eleventh ACM Conference on Recommender Systems. ACM, 339--340.",
      "doi": "10.1145/3109859.3109920"
    },
    {
      "text": "Randi L Hagen and Arnold Kahn. 1975. Discrimination Against Competent Women 1. Journal of Applied Social Psychology 5, 4 (1975), 362--376.",
      "doi": ""
    },
    {
      "text": "Anikó Hannák, Claudia Wagner, David Garcia, Alan Mislove, Markus Strohmaier, and Christo Wilson. 2017. Bias in Online Freelance Marketplaces: Evidence from TaskRabbit and Fiverr. In CSCW. 1914--1933.",
      "doi": ""
    },
    {
      "text": "WIIIAMT HEIR. 2000. Minimizing workplace gender and racial bias. Psychology 37 (2000), 233--56.",
      "doi": ""
    },
    {
      "text": "Yili Hong and Paul A Pavlou. 2012. Are global online labor markets truly “flat”? Global frictions and global labor arbitrage. Technical Report. SSRN Working Paper.",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M Silberman. 2013. Turkopticon: Interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 611--620.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Nicolas Jones, Armelle Brun, and Anne Boyer. 2011. Comparisons instead of ratings: Towards more stable preferences. In 2011 IEEE/WIC/ACM International Conferences on Web Intelligence and Intelligent Agent Technology, Vol. 1. IEEE, 451--456.",
      "doi": "10.1109/WI-IAT.2011.13"
    },
    {
      "text": "Robert L Kaufman. 2010. Race, gender, and the labor market: Inequalities at work. Lynne Rienner Publishers Boulder, CO.",
      "doi": ""
    },
    {
      "text": "Rex B Kline. 2013. Beyond significance testing: Statistics reform in the behavioral sciences. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Farshad Kooti, Mihajlo Grbovic, Luca Maria Aiello, Nemanja Djuric, Vladan Radosavljevic, and Kristina Lerman. 2017. Analyzing Uber's ride-sharing economy. In Proceedings of the 26th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 574--582.",
      "doi": "10.1145/3041021.3054194"
    },
    {
      "text": "Tamar Kricheli-Katz and Tali Regev. 2016. How many cents on the dollar? Women and men in product markets. Science advances 2, 2 (2016), e1500599.",
      "doi": ""
    },
    {
      "text": "Cliff Lampe and R Kelly Garrett. 2007. It's all news to me: The effect of instruments on ratings provision. In 2007 40th Annual Hawaii International Conference on System Sciences (HICSS'07). IEEE, 180b--180b.",
      "doi": "10.1109/HICSS.2007.308"
    },
    {
      "text": "Jacqueline Landau. 1995. The relationship of race and gender to managers' ratings of promotion potential. Journal of Organizational Behavior 16, 4 (1995), 391--400.",
      "doi": ""
    },
    {
      "text": "Walter S Lasecki, Juho Kim, Nick Rafter, Onkur Sen, Jeffrey P Bigham, and Michael S Bernstein. 2015. Apparition: Crowdsourced user interfaces that come to life as you sketch them. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1925--1934.",
      "doi": "10.1145/2702123.2702565"
    },
    {
      "text": "Walter S Lasecki, Kyle I Murray, Samuel White, Robert C Miller, and Jeffrey P Bigham. 2011. Real-time crowd control of existing interfaces. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 23--32.",
      "doi": "10.1145/2047196.2047200"
    },
    {
      "text": "Russell V Lenth. 2001. Some practical guidelines for effective sample size determination. The American Statistician 55, 3 (2001), 187--193.",
      "doi": ""
    },
    {
      "text": "Hanna Levenson, Brent Burford, Bobbie Bonno, and Loren Davis. 1975. Are women still prejudiced against women? A replication and extension of Goldberg's study. The journal of Psychology 89, 1 (1975), 67--71.",
      "doi": ""
    },
    {
      "text": "Debbie S Ma, Joshua Correll, and Bernd Wittenbrink. 2015. The Chicago face database: A free stimulus set of faces and norming data. Behavior research methods 47, 4 (2015), 1122--1135.",
      "doi": ""
    },
    {
      "text": "Dan Marom, Alicia Robb, and Orly Sade. 2016. Gender dynamics in crowdfunding (Kickstarter): Evidence on entrepreneurs, investors, deals and taste-based discrimination. Investors, Deals and Taste-Based Discrimination (February 23, 2016) (2016).",
      "doi": ""
    },
    {
      "text": "Wendy W Moe and Michael Trusov. 2011. The value of social dynamics in online product ratings forums. Journal of Marketing Research 48, 3 (2011), 444--456.",
      "doi": ""
    },
    {
      "text": "Corinne A Moss-Racusin, John F Dovidio, Victoria L Brescoll, Mark J Graham, and Jo Handelsman. 2012. Science faculty's subtle gender biases favor male students. Proceedings of the National Academy of Sciences 109, 41 (2012), 16474--16479.",
      "doi": ""
    },
    {
      "text": "Lev Muchnik, Sinan Aral, and Sean J Taylor. 2013. Social influence bias: A randomized experiment. Science 341, 6146 (2013), 647--651.",
      "doi": ""
    },
    {
      "text": "Veronica F Nieva and Barbara A Gutek. 1980. Sex effects on evaluation. Academy of management Review 5, 2 (1980), 267--276.",
      "doi": ""
    },
    {
      "text": "Amanda Pallais. 2014. Inefficient hiring in entry-level labor markets. American Economic Review 104, 11 (2014), 3565--99.",
      "doi": ""
    },
    {
      "text": "Gail I Pheterson, Sara B Kiesler, and Philip A Goldberg. 1971. Evaluation of the performance of women as a function of their sex, achievement, and personal history. Journal of Personality and Social Psychology 19, 1 (1971), 114.",
      "doi": ""
    },
    {
      "text": "Devin G Pope and Justin R Sydnor. 2011. What's in a Picture? Evidence of Discrimination from Prosper.com. Journal of Human resources 46, 1 (2011), 53--92.",
      "doi": ""
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 75--85.",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Joel Ross, Lilly Irani, M Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who are the crowdworkers?: shifting demographics in mechanical turk. In CHI'10 extended abstracts on Human factors in computing systems. ACM, 2863--2872.",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Niloufar Salehi, Lilly C Irani, Michael S Bernstein, Ali Alkhatib, Eva Ogbe, Kristy Milland, and others. 2015. We are dynamo: Overcoming stalling and friction in collective action for crowd workers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 1621--1630.",
      "doi": "10.1145/2702123.2702508"
    },
    {
      "text": "Matthew J Salganik and Duncan J Watts. 2008. Leading the herd astray: An experimental study of self-fulfilling prophecies in an artificial cultural market. Social psychology quarterly 71, 4 (2008), 338--355.",
      "doi": ""
    },
    {
      "text": "Janet Swim, Eugene Borgida, Geoffrey Maruyama, and David G Myers. 1989. Joan McKay versus John McKay: Do gender stereotypes bias evaluations? Psychological Bulletin 105, 3 (1989), 409.",
      "doi": ""
    },
    {
      "text": "Josh Terrell, Andrew Kofink, Justin Middleton, Clarissa Rainear, Emerson Murphy-Hill, Chris Parnin, and Jon Stallings. 2017. Gender differences and bias in open source: Pull request acceptance of women versus men. PeerJ Computer Science 3 (2017), e111.",
      "doi": ""
    },
    {
      "text": "Jacob Thebault-Spieker, Daniel Kluver, Maximilian A Klein, Aaron Halfaker, Brent Hecht, Loren Terveen, and Joseph A Konstan. 2017a. Simulation Experiments On (The Absence of) Ratings Bias in Reputation Systems. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 101.",
      "doi": "10.1145/3134736"
    },
    {
      "text": "Jacob Thebault-Spieker, Loren Terveen, and Brent Hecht. 2017b. Toward a geographic understanding of the sharing economy: Systemic biases in UberX and TaskRabbit. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 3 (2017), 21.",
      "doi": "10.1145/3058499"
    },
    {
      "text": "Bruce Thompson. 1987. Five Methodology Errors in Educational Research: The. psychology 45 (1987), 721--734.",
      "doi": ""
    },
    {
      "text": "Bogdan Vasilescu, Andrea Capiluppi, and Alexander Serebrenik. 2012. Gender, representation and online participation: A quantitative study of stackoverflow. In 2012 International Conference on Social Informatics. IEEE, 332--338.",
      "doi": "10.1109/SocialInformatics.2012.81"
    },
    {
      "text": "Ming Yin, Mary L Gray, Siddharth Suri, and Jennifer Wortman Vaughan. 2016. The communication network within the crowd. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1293--1303.",
      "doi": "10.1145/2872427.2883036"
    }
  ]
}