{
  "doi": "10.1145/3313831.3376364",
  "title": "Designing Distributed Ledger Technologies for Social Change: The Case of CariCrop",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Distributed ledger technologies (DLTs) have been celebrated for promoting transparency, trust, and efficiency in several domains. However, recent research has also pointed out the potential of these technologies to increase power asymmetries and deepen social inequality. In this paper, we contribute to this discussion by reporting on a collective effort of academics, development partners, local authorities, businesses, and farming groups to look at the potential of DLTs, particularly Blockchains, to support socio-economic development in rural communities in the Caribbean. We present a series of design concepts resulting from this effort and reflect on a method to facilitate stakeholders' experience of possible implementations and enable them to voice concerns, preferences, and expectations. Results from workshops with different groups of stakeholders contribute insights into opportunities and limitations of these applications to enable social development and to level the playing field in agricultural exchanges in developing countries.",
  "authors": [
    {
      "name": "Larissa Pschetz",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339522880",
      "orcid": "missing"
    },
    {
      "name": "Billy Dixon",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526947",
      "orcid": "missing"
    },
    {
      "name": "Kruakae Pothong",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658970790",
      "orcid": "missing"
    },
    {
      "name": "Arlene Bailey",
      "institution": "University of the West Indies, Mona, Jamaica",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467651188",
      "orcid": "missing"
    },
    {
      "name": "Allister Glean",
      "institution": "Inter-American Institute for Cooperation on Agriculture, Castries, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526888",
      "orcid": "missing"
    },
    {
      "name": "Luis Lourenço Soares",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528092",
      "orcid": "missing"
    },
    {
      "name": "Jessica A. Enright",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336488892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AgUnity. Accessed: Dec 2019. Connecting the last mile. https://www.agunity.com",
      "doi": ""
    },
    {
      "text": "ALEX. Accessed: Dec 2019. The Agrilinkages Exchange. https://www.agrilinkages.com/",
      "doi": ""
    },
    {
      "text": "Arc-net. Accessed: Dec 2019. Brand protection through security and transparency. https://arc-net.io/",
      "doi": ""
    },
    {
      "text": "Sinafikeh Asrat, Mahmud Yesuf, Fredrik Carlsson, and Edilegnaw Wale. 2010. Farmers' preferences for crop variety traits: Lessons for on-farm conservation and technology adoption. Ecological Economics 69, 12 (2010), 2394--2401.",
      "doi": ""
    },
    {
      "text": "Arati Baliga. 2017. Understanding blockchain consensus models. In Persistent.",
      "doi": ""
    },
    {
      "text": "Rajiv D. Banker and Sabyasachi Mitra. 2007. Procurement models in the agricultural supply chain: A case study of online coffee auctions in India. Electronic Commerce Research and Applications 6, 3 (2007), 309--321.",
      "doi": "10.1016/j.elerap.2006.06.002"
    },
    {
      "text": "Bext360. Accessed: Dec 2019. Transparency that is good for everyone. https://www.bext360.com",
      "doi": ""
    },
    {
      "text": "Bill Bodell. 2016. FarmShare: Blockchain Community-Supported Agriculture. (2016). https://www.academia.edu/16673793/FarmShare_ Blockchain_Community-Supported_Agriculture",
      "doi": ""
    },
    {
      "text": "Simon Bolwig, Stefano Ponte, Andries du Toit, Lone Riisgaard, and Niels Halberg. 2010. Integrating poverty and environmental concerns into value-chain analysis: A conceptual framework. Development Policy Review 28, 2 (3 2010), 173--194.",
      "doi": ""
    },
    {
      "text": "Vitalik Buterin and others. 2014. A next-generation smart contract and decentralized application platform. white paper 3 (2014), 37.",
      "doi": ""
    },
    {
      "text": "Jennifer Clapp. 2014. Financialization, distance and global food politics. Journal of Peasant Studies 41, 5 (2014), 797--814.",
      "doi": ""
    },
    {
      "text": "CTA. 2017, Retrieved: Dec 2019. Perspectives for ICT and Agribusiness in ACP countries: Start-up financing, 3D printing and blockchain | E-Agriculture. https://s3-eu-west-1.amazonaws.com/cta-scr-media/ 91e974bc-eebe-4558-ba02-fe0006606bbf.pdf&usg= AOvVaw0LLEq1yCu3tSjEcnPW6c9p",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Arthi Manohar, Jo Briggs, Mike Harding, Chris Speed, and John Vines. 2018. Making sense of blockchain applications: A typology for HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 458.",
      "doi": "10.1145/3173574.3174032"
    },
    {
      "text": "Chris Elsden, Ludwig Trotter, Mike Harding, Nigel Davies, Chris Speed, and John Vines. 2019. Programmable Donations: Exploring Escrow-based Conditional Giving. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 379.",
      "doi": "10.1145/3290605.3300609"
    },
    {
      "text": "FairCoop. Accessed: Dec 2019. Earth's Cooperative ecosystem for a fair economy. https://fair.coop/en",
      "doi": ""
    },
    {
      "text": "Marcus Foth. 2017. The promise of blockchain technology for interaction design. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. ACM, 513--517.",
      "doi": "10.1145/3152771.3156168"
    },
    {
      "text": "David Franquesa Griso and Leandro Navarro Moldes. 2017. Sustainability and participation in the digital commons. Interactions (New York): new visions of human-computer interactions 24, 3 (2017), 66--69.",
      "doi": ""
    },
    {
      "text": "Marco Iansiti and Karim R Lakhani. 2017. The truth about blockchain. Harvard Business Review 95, 1 (2017), 118--127.",
      "doi": ""
    },
    {
      "text": "Andreas Kamilaris, Agusti Fonts, and Francesc X. Prenafeta-Boldú. 2019. The rise of blockchain technology in agriculture and food supply chains. Trends in Food Science Technology 91 (2019), 640 -- 652.",
      "doi": ""
    },
    {
      "text": "Andreas Kamilaris, Andreas Kartakoullis, and Francesc X Prenafeta-Boldú. 2017. A review on the practice of big data analysis in agriculture. Computers and Electronics in Agriculture 143 (2017), 23--37.",
      "doi": "10.1016/j.compag.2017.09.037"
    },
    {
      "text": "Ethan Kane. 2017. Is Blockchain a General Purpose Technology? SSRN Electronic Journal (4 2017).",
      "doi": ""
    },
    {
      "text": "Raphael Kaplinsky. 2010. The role of standards in global value chains. The World Bank.",
      "doi": ""
    },
    {
      "text": "Cara Lapointe and Lara Fishbane. 2019. The Blockchain Ethical Design Framework. Innovations: Technology, Governance, Globalization 12, 3--4 (2019), 50--71.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2005. Reassembling the Social: An Introduction to Actor-Network-Theory. OUP Oxford.",
      "doi": ""
    },
    {
      "text": "Joonkoo Lee, Gary Gereffi, and Janet Beauvais. 2012. Global value chains and agrifood standards: Challenges and possibilities for smallholders in developing countries. Proceedings of the National Academy of Sciences 109, 31 (2012), 12326--12331.",
      "doi": ""
    },
    {
      "text": "Ramsay Liem and Paula Rayman. 1982. Health and social costs of unemployment: Research and policy considerations. American Psychologist 37, 10 (10 1982), 1116--1123.",
      "doi": ""
    },
    {
      "text": "Sarah Manski. 2017. Building the blockchain world: Technological commonwealth or just more of the same? Strategic Change 26, 5 (9 2017), 511--522.",
      "doi": ""
    },
    {
      "text": "Sarah Manski and Ben Manski. 2018. No Gods, No Masters, No Coders? The Future of Sovereignty in a Blockchain World. Law and Critique 29, 2 (7 2018), 151--162.",
      "doi": ""
    },
    {
      "text": "Ajit Maru, Dan Berne, Jeremy De Beer, Peter G Ballantyne, Valeria Pesce, Stephen Kalyesubula, Nicolene Fourie, Chris Addison, Anneliza Collett, and Juanita Chavez. 2018. Digital and data-driven agriculture: Harnessing the power of data for smallholders. Global Forum on Agricultural Research and Innovation.",
      "doi": ""
    },
    {
      "text": "Deborah Maxwell, Chris Speed, and Dug Campbell. 2015. 'Effing'the ineffable: opening up understandings of the blockchain. In Proceedings of the 2015 British HCI Conference. ACM, 208--209.",
      "doi": "10.1145/2783446.2783593"
    },
    {
      "text": "Philip McMichael. 2013. Value-chain agriculture and debt relations: contradictory outcomes. Third World Quarterly 34, 4 (2013), 671--690.",
      "doi": ""
    },
    {
      "text": "Philip McMichael and Mindi Schneider. 2011. Food security politics and the Millennium Development Goals. Third World Quarterly 32, 1 (2011), 119--139.",
      "doi": ""
    },
    {
      "text": "Jeff Neilson. 2008. Global private regulation and value-chain restructuring in Indonesian smallholder coffee systems. World Development 36, 9 (2008), 1607--1622.",
      "doi": ""
    },
    {
      "text": "Jamaica Gleaner News. 2014, Accessed: Dec 2019. Montague wants hotels delinquent in payments denied import licences . http://jamaica-gleaner.com/gleaner/ 20140224/news/news2.html",
      "doi": ""
    },
    {
      "text": "Bettina Nissen, Larissa Pschetz, Dave Murray-Rust, Hadi Mehrpouya, Shaune Oosthuizen, and Chris Speed. 2018. Geocoin: Supporting ideation and collaborative design with smart contracts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 163.",
      "doi": "10.1145/3173574.3173737"
    },
    {
      "text": "Planning Institute of Jamaica. 2009, Retrieved: Dec 2019. Agriculture Sector Plan, Vision 2030 Jamaica National Development Plan. Technical Report. http://www.vision2030.gov.jm/portals/0/ndp/vision%202030% 20jamaica%20ndp%20full%20no%20cover%20(web).pdf",
      "doi": ""
    },
    {
      "text": "Svein Olnes, Jolien Ubacht, and Marijn Janssen. 2017. Blockchain in government: Benefits and implications of distributed ledger technology for information sharing. Government Information Quarterly 34, 3 (2017), 355 -- 364.",
      "doi": ""
    },
    {
      "text": "Prabhu L. Pingali. 2012. Green revolution: Impacts, limits, andthe path ahead. In Proceedings of the National Academy of Sciences of the United States of America, Vol. 109. 12302--12308.",
      "doi": ""
    },
    {
      "text": "Provenance. Accessed: Dec 2019. Every product has a story. https://www.provenance.org/",
      "doi": ""
    },
    {
      "text": "Larissa Pschetz, Kruakae Pothong, and Chris Speed. 2019. Autonomous Distributed Energy Systems: Problematising the Invisible through Design, Drama and Deliberation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 387.",
      "doi": "10.1145/3290605.3300617"
    },
    {
      "text": "Alan Renwick, MD Islam, Steven Thomson, and others. 2012. Power in global agriculture: Economics, politics, and natural resources. International Journal of Agricultural Management 2, 1 (2012), 31--48.",
      "doi": ""
    },
    {
      "text": "Commonwealth Secretariat. 2002, Accessed: Dec 2019. Master Plan for Sustainable Tourism Development in Jamaica. https://www.tpdco.org/wp-content/uploads/2016/07/ Master-Plan-for-Sustainable-Tourism-Development.pdf",
      "doi": ""
    },
    {
      "text": "Melanie Swan. 2015. Blockchain: Blueprint for a new economy. O'Reilly Media, Inc.",
      "doi": "10.5555/3006358"
    },
    {
      "text": "Melanie Swan. 2017. Anticipating the Economic Benefits of Blockchain. Technology Innovation Management Review 7, 10 (10 2017), 6--13.",
      "doi": ""
    },
    {
      "text": "Don Tapscott and Alex Tapscott. 2016. Blockchain revolution: how the technology behind bitcoin is changing money, business, and the world. Penguin.",
      "doi": "10.5555/3051781"
    },
    {
      "text": "Maurizio Teli, Silvia Bordin, María Menéndez Blanco, Giusi Orabona, and Antonella De Angeli. 2015. Public design of digital commons in urban places: a case study. International Journal of Human-Computer Studies 81 (2015), 17--30.",
      "doi": "10.1016/j.ijhcs.2015.02.003"
    },
    {
      "text": "Mischa Tripoli and Josef Schmidhuber. 2018. Emerging Opportunities for the Application of Blockchain in the Agri-food Industry. FAO and ICTSD: Rome and Geneva. Licence: CC BY-NC-SA 3 (2018).",
      "doi": ""
    },
    {
      "text": "Eric Wagner, Achim Völker, Frederik Fuhrmann, Roman Matzutt, and Klaus Wehrle. 2019. Dispute Resolution for Smart Contract-based Two-Party Protocols. (2019). https://www.researchgate.net/ profile/Roman_Matzutt/publication/331821898_Dispute_ Resolution_for_Smart_Contract-based_Two-Party_ Protocols/links/5c8e3e7692851c1df946dc24/ Dispute-Resolution-for-Smart-Contract-based-% Two-Party-Protocols.pdf",
      "doi": ""
    },
    {
      "text": "Kevin Werbach. 2018. Trust, but verify: Why the blockchain needs the law. Berkeley Tech. LJ 33 (2018), 487.",
      "doi": ""
    },
    {
      "text": "Xiwei Xu, Ingo Weber, Mark Staples, Xiwei Xu, Ingo Weber, and Mark Staples. 2019. Case Study: originChain. In Architecture for Blockchain Applications. Springer International Publishing, 279--293.",
      "doi": ""
    }
  ]
}