{
  "doi": "10.1145/3313831.3376862",
  "title": "Understanding the Use of Crisis Informatics Technology among Older Adults",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Mass emergencies increasingly pose significant threats to human life, with a disproportionate burden being incurred by older adults. Research has explored how mobile technology can mitigate the effects of mass emergencies. However, less work has examined how mobile technologies support older adults during emergencies, considering their unique needs. To address this research gap, we interviewed 16 older adults who had recent experience with an emergency evacuation to understand the perceived value of using mobile technology during emergencies. We found that there was a lack of awareness and engagement with existing crisis apps. Our findings characterize the ways in which our participants did and did not feel crisis informatics tools address human values, including basic needs and esteem needs. We contribute an understanding of how older adults used mobile technology during emergencies and their perspectives on how well such tools address human values.",
  "authors": [
    {
      "name": "Yixuan Zhang",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659482107",
      "orcid": "missing"
    },
    {
      "name": "Nurul Suhaimi",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659109063",
      "orcid": "0000-0002-4318-5805"
    },
    {
      "name": "Rana Azghandi",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659286397",
      "orcid": "missing"
    },
    {
      "name": "Mary Amulya Joseph",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528705",
      "orcid": "missing"
    },
    {
      "name": "Miso Kim",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526540",
      "orcid": "0000-0002-3058-3388"
    },
    {
      "name": "Jacqueline Griffin",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659121142",
      "orcid": "0000-0001-7729-1748"
    },
    {
      "name": "Andrea G. Parker",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556858356",
      "orcid": "0000-0002-2362-7717"
    }
  ],
  "references": [
    {
      "text": "Federal Emergency Management Agency. 2004. Are you ready?: An in-depth guide to citizen preparedness. (2004).",
      "doi": ""
    },
    {
      "text": "Hajer Al-Dahash, Menaha Thayaparan, and Udayangani Kulatunga. 2016. Understanding the terminologies: Disaster, crisis and emergency. In Proceedings of the 32nd Annual ARCOM Conference, ARCOM 2016. London South Bank University, 1191--1200.",
      "doi": ""
    },
    {
      "text": "David A Alexander and Susan Klein. 2001. Ambulance personnel and critical incidents: impact of accident and emergency work on mental health and emotional well-being. The British Journal of Psychiatry 178, 1 (2001), 76--81.",
      "doi": ""
    },
    {
      "text": "Claudia K Allen, Sarah L Austin, Sandra K David, O MHE, Deane B McCraith, and Linda Riska-Williams. 2007. Manual for the Allen cognitive level screen-5 (ACLS-5) and Large Allen cognitive level screen-5 (LACLS-5). J. Occup. Therapy 56 (2007), 609--639.",
      "doi": ""
    },
    {
      "text": "Monica Anderson and Andrew Perrin. 2017. Tech Adoption Climbs Among Older Adults. (March 2017). Retrieved August 30, 2019 from https://www.pewinternet.org/2017/05/17/ tech-adoption-climbs-among-older-adults",
      "doi": ""
    },
    {
      "text": "Apple Inc. 2019. Use Emergency SOS on your iPhone. (2019). Retrieved August 30, 2019 from https://support.apple.com/en-us/HT208076",
      "doi": ""
    },
    {
      "text": "Oberiri Destiny Apuke and Elif Asude Tunca. 2018. Social Media and Crisis Management: A Review and Analysis of Existing Studies. LAÜ Sosyal Bilimler Dergisi 9, 2 (2018), 199--215.",
      "doi": ""
    },
    {
      "text": "Amanda S Barusch. 2011. Disaster, vulnerability, and older adults: Toward a social work response. (2011).",
      "doi": ""
    },
    {
      "text": "B Wayne Blanchard. 2008. Guide to emergency management and related terms, definitions, concepts, acronyms, organizations, programs, guidance, executive orders & legislation: A tutorial on emergency management, broadly defined, past and present. In United States. Federal Emergency Management Agency. United States. Federal Emergency Management Agency.",
      "doi": ""
    },
    {
      "text": "National Transportation Safety Board. 2018. Natural Gas Distribution System Project Development and Review (Urgent). (2018). Retrieved September 2, 2019 from https://www.ntsb.gov/investigations/ AccidentReports/Reports/PSR1802.pdf",
      "doi": ""
    },
    {
      "text": "Jason Burnett, Carmel Dyer, and Sabrina Pickins. 2007. Rapid needs assessments for older adults in disasters. Generations 31, 4 (2007), 10--15.",
      "doi": ""
    },
    {
      "text": "PEW RESEARCH CENTER. 2018. Mobile Fact Sheet. (2018). Retrieved August 30, 2019 from https://www.pewinternet.org/fact-sheet/mobile/",
      "doi": ""
    },
    {
      "text": "Anita Chandra, Malcolm Williams, Alonzo Plough, Alix Stayton, Kenneth B Wells, Mariana Horta, and Jennifer Tang. 2013. Getting actionable about community resilience: The Los Angeles county community disaster resilience project. American journal of public health 103, 7 (2013), 1181--1189.",
      "doi": ""
    },
    {
      "text": "Elizabeth Cloyd and Carmel B Dyer. 2010. Catastrophic events and older adults. Critical care nursing clinics of North America 22, 4 (2010), 501--513.",
      "doi": ""
    },
    {
      "text": "Matthew Collins, Karen Neville, William Hynes, and Martina Madden. 2016. Communication in a disaster-the development of a crisis communication tool within the S-HELP project. Journal of Decision Systems 25, sup1 (2016), 160--170.",
      "doi": ""
    },
    {
      "text": "Commonwealth of Massachusetts. 2019. Massachusetts Alerts Smartphone App. (2019). https://www.mass.gov/ service-details/massachusetts-alerts-smartphone-app",
      "doi": ""
    },
    {
      "text": "Silvia Planella Conrado, Karen Neville, Simon Woodworth, and Sheila O'Riordan. 2016. Managing social media uncertainty to support the decision making process during emergencies. Journal of Decision Systems 25, sup1 (2016), 171--181.",
      "doi": ""
    },
    {
      "text": "Sara J Czaja, Neil Charness, Arthur D Fisk, Christopher Hertzog, Sankaran N Nair, Wendy A Rogers, and Joseph Sharit. 2006. Factors predicting the use of technology: findings from the Center for Research and Education on Aging and Technology Enhancement (CREATE). Psychology and aging 21, 2 (2006), 333.",
      "doi": ""
    },
    {
      "text": "Kourosh Eshghi and Richard C Larson. 2008. Disasters: lessons from the past 105 years. Disaster Prevention and Management: An International Journal 17, 1 (2008), 62--82.",
      "doi": ""
    },
    {
      "text": "Facebook. 2019. Crisis Response. (2019). Retrieved August 30, 2019 from https://www.facebook.com/about/crisisresponse/",
      "doi": ""
    },
    {
      "text": "Federal Emergency Management Agency. 2019. Mobile App. (2019). Retrieved September 02, 2019 from https://www.fema.gov/mobile-app/",
      "doi": ""
    },
    {
      "text": "Susan Jeanne Ferguson and Andrea D Goodwin. 2010. Optimism and well-being in older adults: The mediating role of social support and perceived control. The International Journal of Aging and Human Development 71, 1 (2010), 43--68.",
      "doi": ""
    },
    {
      "text": "Lauren S Fernandez, Deana Byard, Chien-Chih Lin, Samuel Benson, and Joseph A Barbera. 2002. Frail elderly as disaster victims: emergency management strategies. Prehospital and disaster medicine 17, 2 (2002), 67--74.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter H Kahn, and Alan Borning. 2008. Value sensitive design and information systems. The handbook of information and computer ethics (2008), 69--101.",
      "doi": ""
    },
    {
      "text": "Isabel Paidamwoyo Gambura and Oberiri Destiny Apuke. 2018. Two sides of a coin: explicating the place of social media in crisis management. Journal of Media Critiques [JMC] 4, 13 (2018).",
      "doi": ""
    },
    {
      "text": "Briony Gray and others. 2018. Supporting situational awareness during disasters: the case of hurricane Irma. (2018).",
      "doi": ""
    },
    {
      "text": "George Haddow and Kim S Haddow. 2013. Disaster communications in a changing media world. Butterworth-Heinemann.",
      "doi": ""
    },
    {
      "text": "Christine Hagar. 2010. Crisis informatics: Introduction. Bulletin of the American Society for Information Science and Technology (2010), 6.",
      "doi": ""
    },
    {
      "text": "Sharona Hoffman. 2008. Preparing for disaster: Protecting the most vulnerable in emergencies. UC Davis L. Rev. 42 (2008), 1491.",
      "doi": ""
    },
    {
      "text": "Alexis Hope, Ted Schwaba, and Anne Marie Piper. 2014. Understanding digital and material social communications for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3903--3912.",
      "doi": "10.1145/2556288.2557133"
    },
    {
      "text": "Amanda Howard, Kylie Agllias, Miriam Bevis, and Tamara Blakemore. 2017. ?They'll tell us when to evacuate\": The experiences and expectations of disaster-related communication in vulnerable groups. International journal of disaster risk reduction 22 (2017), 139--146.",
      "doi": ""
    },
    {
      "text": "Susan Hrostowski and Timothy Rehner. 2012. Five years later: resiliency among older adult survivors of Hurricane Katrina. Journal of gerontological social work 55, 4 (2012), 337--351.",
      "doi": ""
    },
    {
      "text": "Naoko Iwasaki. 2013. Usability of ICT applications for elderly people in disaster reduction. Journal of E-Governance 36, 2 (2013), 73--78.",
      "doi": "10.5555/2595296.2595305"
    },
    {
      "text": "Cynthia S Jacelon, Thomas W Connelly, Rana Brown, Kathy Proulx, and Thuy Vo. 2004. A concept analysis of dignity for older adults. Journal of advanced nursing 48, 1 (2004), 76--83.",
      "doi": ""
    },
    {
      "text": "Yan Jin, Brooke Fisher Liu, and Lucinda L Austin. 2014. Examining the role of social media in effective crisis management: The effects of crisis origin, information form, and source on publics' crisis responses. Communication research 41, 1 (2014), 74--94.",
      "doi": ""
    },
    {
      "text": "Bran Knowles and Vicki L Hanson. 2018. Older Adults' Deployment of ?Distrust'. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 4 (2018), 21.",
      "doi": "10.1145/3196490"
    },
    {
      "text": "Gregory Korte. 2018. Senators: Natural gas pressure was 12 times normal level before Massachusetts explosions. (2018). Retrieved September 2, 2019 from https://bit.ly/2k5FB0F",
      "doi": ""
    },
    {
      "text": "Alexis Kuerbis, Adina Mulliken, Frederick Muench, Alison A Moore, and Daniel Gardner. 2017. Older adults and mobile technology: Factors that enhance and inhibit utilization in the context of behavioral health. (2017).",
      "doi": ""
    },
    {
      "text": "Margie E Lachman and Suzanne L Weaver. 1998. The sense of control as a moderator of social class differences in health and well-being. Journal of personality and social psychology 74, 3 (1998), 763.",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 2001. Legitimate peripheral participation in communities of practice. In Supporting lifelong learning. Routledge, 121--136.",
      "doi": ""
    },
    {
      "text": "Jean Lave, Etienne Wenger, and others. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Bruce R Lindsay. 2011. Social media and disasters: Current uses, future options, and policy considerations. (2011).",
      "doi": ""
    },
    {
      "text": "Kathleen A Martin, Mark R Leary, and W Jack Rejeski. 2000. Self-presentational concerns in older adults: Implications for health and well-being. Basic and Applied Social Psychology 22, 3 (2000), 169--179.",
      "doi": ""
    },
    {
      "text": "Saul McLeod. 2007. Maslow's hierarchy of needs. Simply psychology 1 (2007).",
      "doi": ""
    },
    {
      "text": "Rowland S Miller. 1992. The nature and severity of self-reported embarrassing circumstances. Personality and Social Psychology Bulletin 18, 2 (1992), 190--198.",
      "doi": ""
    },
    {
      "text": "Tracy L Mitzner, Julie B Boron, Cara Bailey Fausset, Anne E Adams, Neil Charness, Sara J Czaja, Katinka Dijkstra, Arthur D Fisk, Wendy A Rogers, and Joseph Sharit. 2010. Older adults talk technology: Technology usage and attitudes. Computers in human behavior 26, 6 (2010), 1710--1721.",
      "doi": ""
    },
    {
      "text": "National Institute on Aging, U.S. Department of Health and Human Services. 2019. Supporting Older Patients with Chronic Conditions. (2019). www.nia.nih.gov/ health/supporting-older-patients-chronic-conditions/",
      "doi": ""
    },
    {
      "text": "Ehren B Ngo. 2001. When disasters and age collide: Reviewing vulnerability of the elderly. Natural Hazards Review 2, 2 (2001), 80--89.",
      "doi": ""
    },
    {
      "text": "The Office of the High Commissioner for Human Rights. 1991. United Nations Principles for Older Persons. (1991). Retrieved August 30, 2019 from https://www.ohchr.org/en/professionalinterest/pages/ olderpersons.aspx.",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Sarah Vieweg, Sophia B Liu, and Amanda Lee Hughes. 2009. Crisis in a networked world: Features of computer-mediated communication in the April 16, 2007, Virginia Tech event. Social Science Computer Review 27, 4 (2009), 467--480.",
      "doi": "10.1177/0894439309332302"
    },
    {
      "text": "Danielle C Perry, Maureen Taylor, and Marya L Doerfel. 2003. Internet-based communication in crisis management. Management communication quarterly 17, 2 (2003), 206--232.",
      "doi": ""
    },
    {
      "text": "Ronald W Perry, Michael K Lindell, and Kathleen J Tierney. 2001. Facing the unexpected: Disaster preparedness and response in the United States. Joseph Henry Press.",
      "doi": ""
    },
    {
      "text": "Volkmar Pipek, Sophia B Liu, and Andruid Kerne. 2014. Crisis informatics and collaboration: a brief introduction. Computer Supported Cooperative Work (CSCW) 23, 4--6 (2014), 339--345.",
      "doi": "10.1007/s10606-014-9211-4"
    },
    {
      "text": "Christian Reuter, Amanda Lee Hughes, and Marc-André Kaufhold. 2018. Social media in crisis management: An evaluation and analysis of crisis informatics research. International Journal of Human--Computer Interaction 34, 4 (2018), 280--294.",
      "doi": ""
    },
    {
      "text": "Christian Reuter, Marc Kaufhold, Inken Leopold, and Hannah Knipp. 2017. Katwarn, Nina, or Fema? Multi-method study on distribution, use, and public views on crisis apps. (2017).",
      "doi": ""
    },
    {
      "text": "Wendy A Rogers, Aideen J Stronge, and Arthur D Fisk. 2005. Technology and aging. Reviews of human factors and ergonomics 1, 1 (2005), 130--171.",
      "doi": ""
    },
    {
      "text": "Marc Rothman and Lisa Brown. 2007. The vulnerable geriatric casualty: medical needs of frail older adults during disasters. Generations 31, 4 (2007), 16--20.",
      "doi": ""
    },
    {
      "text": "Regina A Shih, Joie D Acosta, Emily K Chen, Eric G Carbone, Lea Xenakis, David M Adamson, and Anita Chandra. 2018. Improving disaster resilience among older adults: insights from public health departments and aging-in-place efforts. Rand health quarterly 8, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Tomer Simon, Avishay Goldberg, and Bruria Adini. 2015. Socializing in emergencies-A review of the use of social media in emergency situations. International Journal of Information Management 35, 5 (2015), 609--619.",
      "doi": "10.1016/j.ijinfomgt.2015.07.001"
    },
    {
      "text": "Smart911. 2019. Plan Ahead For Any Emergency. (2019). https://www.smart911.com/",
      "doi": ""
    },
    {
      "text": "Aaron Smith and Monica Anderson. 2018. Social Media Use in 2018. (March 2018). Retrieved August 30, 2019 from https://www.pewinternet.org/2018/03/01/ social-media-use-in-2018/",
      "doi": ""
    },
    {
      "text": "Kate Starbird, Leysia Palen, Amanda L Hughes, and Sarah Vieweg. 2010. Chatter on the red: what hazards threat reveals about the social life of microblogged information. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 241--250.",
      "doi": "10.1145/1718918.1718965"
    },
    {
      "text": "Toddi A Steelman, Sarah M McCaffrey, Anne-Lise Knox Velez, and Jason Alexander Briefel. 2015. What information do people use, trust, and find useful during a disaster? Evidence from five large wildfires. Natural Hazards 76, 1 (2015), 615--634.",
      "doi": ""
    },
    {
      "text": "Lesley Strawderman, Arash Salehi, Kari Babski-Reeves, Tonya Thornton-Neaves, and Arthur Cosby. 2012. Reverse 911 as a complementary evacuation warning system. Natural hazards review 13, 1 (2012), 65--73.",
      "doi": ""
    },
    {
      "text": "Yifan Sun and Kaushik R Chowdhury. 2014. Enabling emergency communication through a cognitive radio vehicular network. IEEE Communications Magazine 52, 10 (2014), 68--75.",
      "doi": ""
    },
    {
      "text": "Marion Lara Tan, Raj Prasanna, Kristin Stock, Emma Hudson-Doyle, Graham Leonard, and David Johnston. 2017. Mobile applications in crisis informatics literature: A systematic review. International journal of disaster risk reduction 24 (2017), 297--311.",
      "doi": ""
    },
    {
      "text": "Andrea H Tapia and Kathleen Moore. 2014. Good enough is good enough: Overcoming disaster response organizations' slow social media data adoption. Computer supported cooperative work (CSCW) 23, 4--6 (2014), 483--512.",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Robyn Tuohy and Christine Stephens. 2012. Older adults' narratives about a flood disaster: Resilience, coherence, and personal identity. Journal of Aging studies 26, 1 (2012), 26--34.",
      "doi": ""
    },
    {
      "text": "Robyn Tuohy, Christine Stephens, and David Johnston. 2014. Older adults' disaster preparedness in the context of the September 2010--December 2012 Canterbury earthquake sequence. International journal of disaster risk reduction 9 (2014), 194--203.",
      "doi": ""
    },
    {
      "text": "Twitter. 2019. Twitter Alerts from FEMA Critical information on your phone in real time. (2019). Retrieved April 02, 2019 from https://twitter.com/fema/alerts",
      "doi": ""
    },
    {
      "text": "Tiffany C Veinot, Hannah Mitchell, and Jessica S Ancker. 2018. Good intentions are not enough: how informatics interventions can worsen inequality. Journal of the American Medical Informatics Association 25, 8 (2018), 1080--1088.",
      "doi": ""
    },
    {
      "text": "Sarah Vieweg, Leysia Palen, Sophia B Liu, Amanda L Hughes, and Jeannette N Sutton. 2008. Collective intelligence in disaster: Examination of the phenomenon in the aftermath of the 2007 Virginia Tech shooting. University of Colorado Boulder, CO.",
      "doi": ""
    },
    {
      "text": "Kerryellen G Vroman, Sajay Arthanat, and Catherine Lysack. 2015. \"Who over 65 is online?\" Older adults' dispositions toward information communication technology. Computers in Human Behavior 43 (2015), 156--166.",
      "doi": "10.1016/j.chb.2014.10.018"
    },
    {
      "text": "Ken Walsh and Inge Kowanko. 2002. Nurses' and patients' perceptions of dignity. International journal of nursing practice 8, 3 (2002), 143--151.",
      "doi": ""
    },
    {
      "text": "Connie M White. 2016. Social media, crisis communication, and emergency management: Leveraging Web 2.0 technologies. CRC press.",
      "doi": ""
    },
    {
      "text": "Lea Winerman. 2009. Social networking: Crisis communication. Nature News 457, 7228 (2009), 376--378.",
      "doi": ""
    },
    {
      "text": "Yu Xiao, Qunying Huang, and Kai Wu. 2015. Understanding social media data for disaster management. Natural hazards 79, 3 (2015), 1663--1679.",
      "doi": ""
    }
  ]
}