{
  "doi": "10.1145/3313831.3376603",
  "title": "Join.Love: A Sociotechnical Genealogy of the Legalization of Same-Sex Marriage",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "HCI researchers interested in enhancing democracy have introduced methods and technologies that support democratic political processes, such as voting, and more broadly on empowering people to more fully participate in an increasingly technologized world. The aspiration for technologies to support meaningful democratic outcomes is not misplaced. In 2019, headlines around the world announced that Taiwan had become the first Asian country to legalize same-sex marriage, an impressive political achievement. But it was also an impressive technical achievement, the outcome of a concerted effort to develop responsive and impactful direct democracy platforms. We offer a sociotechnical genealogy of the process, informed by theory of deliberative democracy. We identify three opportunities for future HCI contributions: supporting less visible consensus-es, developing civic journeys, and engaging in deliberative experience design.",
  "tags": [
    "same-sex marriage",
    "sociotechnical ecology",
    "citizen journeys",
    "deliberative democracy",
    "deliberative experience design"
  ],
  "authors": [
    {
      "name": "Jeffrey Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057577",
      "orcid": "missing"
    },
    {
      "name": "Guo Freeman",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639182",
      "orcid": "0000-0001-5107-7794"
    },
    {
      "name": "Shaowen Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    },
    {
      "name": "Pei-Ying Chen",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659229642",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1694--1703. DOI: https://doi.org/10.1145/2675133.2675156",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Tanja Aitamurto and Helene E. Landemore. 2015. Five design principles for crowdsourced policymaking: Assessing the case of crowdsourced off-road traffic law in Finland. Journal of Social Media for Organizations, 2, 1, 1--19.",
      "doi": ""
    },
    {
      "text": "Tanja Aitamurto and Jorge Saldivar. 2017. Motivating Participation in Crowdsourced Policymaking: The Interplay of Epistemic and Interactive Aspects. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 18 (December 2017), 22 pages. DOI: https://doi.org/10.1145/3134653",
      "doi": "10.1145/3134653"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. The user reconfigured: on subjectivities of information. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, Aarhus University Press, 133144.",
      "doi": "10.7146/aahcc.v1i1.21298"
    },
    {
      "text": "Seyla Benhabib. 1992. Situating the Self: Gender, Community, and Postmodernism in Contemporary Ethics. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure during Shifting Social Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 610--622. DOI: https://doi.org/10.1145/2858036.2858342",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "James Bohman. 1998. The coming of age of deliberative democracy. Journal of political philosophy, 6, 4, 400--425.",
      "doi": ""
    },
    {
      "text": "Bonnie A. Nardi and Vicki O'Day. 1999. Information ecologies: Using technology with heart. MIT Press.",
      "doi": "10.5555/299579"
    },
    {
      "text": "Glenn A. Bowen. 2009. Document analysis as a qualitative research method. Qualitative research journal, 9, 2, 27--40",
      "doi": ""
    },
    {
      "text": "Dung-sheng Chen, Kuo-ming Lin, and M. H. HsinHuang. 2006. The prospects of deliberative democracy in Taiwan. Asian new democracies: The Philippines, South Korea and Taiwan compared, 289--304.",
      "doi": ""
    },
    {
      "text": "Dung-Sheng Chen and Chung-Yeh Deng. 2007. Interaction between citizens and experts in public deliberation: A case study of consensus conferences in Taiwan. East Asian Science, Technology and Society: An International Journal, 1, 1, 77--97.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3573--3582. DOI: https://doi.org/10.1145/2556288.2557100",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Lincoln Dahlberg. 2011. Re-constructing digital democracy: An outline of four ?positions'. New Media & Society, 13, 6, 855--872.",
      "doi": ""
    },
    {
      "text": "John Dewey. 1939. Creative Democracy-The Task Before Us. In Robert B. Talisse and Scott F. Aikin, eds., The Pragmatism Reader. Princeton, NJ: Princeton University Press, 2011.",
      "doi": ""
    },
    {
      "text": "Tawanna Dillahunt. 2014. Toward a deeper understanding of sustainability within HCI. In Workshop on Sustainability. http://socialinnovations.us/assets/papers/Dillahunt-sustainability-workshop-2014-finalonwebsite.pdf",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt. 2014. Fostering social capital in economically distressed communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 531--540. DOI: https://doi.org/10.1145/2556288.2557123",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2397--2406. DOI: https://doi.org/10.1145/2556288.2557359",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2018. Identity Work as Deliberation: AAPI Political Discourse in the 2016 US Presidential Election. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 633, 12 pages. DOI: https://doi.org/10.1145/3173574.3174207",
      "doi": "10.1145/3173574.3174207"
    },
    {
      "text": "Jennifer L. Eagan. 2007. Deliberative democracy. Encyclopedia Britannica.",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social Inequality and HCI: The View from Political Economy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4997--5002. DOI: https://doi.org/10.1145/2858036.2858343",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Lawrence Ferber. 2015. Is Taipei Asia's most LGBTfriendly city? Retrieved March 28, 2019 from https://www.cntraveler.com/stories/2015-03-03/whatdo-do-in-taipei-asia-most-lgbt-friendly-city",
      "doi": ""
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating rigor using thematic analysis: A hybrid approach of inductive and deductive coding and theme development. International journal of qualitative methods, 5, 1, 80--92.",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, and Shaowen Bardzell. 2017. Aspirational Design and Messy Democracy: Partisanship, Policy, and Hope in an Asian City. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 404416. DOI: https://doi.org/10.1145/2998181.2998291",
      "doi": "10.1145/2998181.2998291"
    },
    {
      "text": "Guo Freeman, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Bottom-Up Imaginaries: The Cultural-Technical Practice of Inventing Regional Advantage through IT R&D. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 325, 11 pages. DOI: https://doi.org/10.1145/3173574.3173899",
      "doi": "10.1145/3173574.3173899"
    },
    {
      "text": "James A. Gardner. 1996. Shut Up and Vote: A Critique of Deliberative Democracy and the Life of Talk, 63 Tenn. L. Rev. 421, Available at: https://digitalcommons.law.buffalo.edu/journal_articles/208",
      "doi": ""
    },
    {
      "text": "Judith M. Green. 2006. Pluralism and deliberative democracy: A pragmatist approach. In J. R. Shook & J. Margolis (Eds.), A Companion to Pragmatism. Blackwell, 301--316.",
      "doi": ""
    },
    {
      "text": "Amy Gutmann and Dennis F. Thompson. 2009. Why deliberative democracy?. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Jürgen Habermas, Sara Lennox, and Frank Lennox. 1974. The public sphere: An encyclopedia article (1964). New German Critique, 3, 49--55.",
      "doi": ""
    },
    {
      "text": "Kenneth L. Hacker and Jan van Dijk. 2000. Digital democracy: Issues of theory and practice. Sage.",
      "doi": ""
    },
    {
      "text": "Libby Hemphill and Andrew J. Roback. 2014. Tweet acts: how constituents lobby congress via Twitter. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 12001210. DOI: https://doi.org/10.1145/2531602.2531735",
      "doi": ""
    },
    {
      "text": "Harry Hochheiser and Jonathan Lazar. 2007. HCI and societal issues: A framework for engagement.\" International Journal of Human-Computer Interaction 23, 3, 339--374.",
      "doi": ""
    },
    {
      "text": "Tong-yi Huang and Chung-an Hsieh. 2013. Practicing Deliberative Democracy in Taiwan Processes, Impacts, and Challenges. Taïwan Journal of Democracy, 9, 2. http://www.tfd.org.tw/export/sites/tfd/files/publication/journal/dj0902/004.pdf",
      "doi": ""
    },
    {
      "text": "Judicial Yuan Interpretation 748. 2017. http://cons.judicial.gov.tw/jcc/en-us/jep03/show?expno=748#secEleven",
      "doi": ""
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating friction: infrastructuring civic engagement in everyday life. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (CA '15). Aarhus University Press 145--156. DOI: https://doi.org/10.7146/aahcc.v1i1.21198",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Travis Kriplean, Jonathan Morgan, Deen Freelon, Alan Borning, and Lance Bennett. 2012. Supporting reflective public thought with considerit. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 265--274. DOI: https://doi.org/10.1145/2145204.2145249",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Jess Kropczynski, Guoray Cai, and John M. Carroll. 2015. Characterizing democratic deliberation in an online forum. Information polity, 20, 2, 3, 151--165.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec, Kari E. Watkins, Russ Clark, and Elizabeth Mynatt. 2015. Cycle Atlanta and OneBusAway: Driving innovation through the data ecosystems of civic computing. In International Conference on Human-Computer Interaction, pp. 327--338. Springer.",
      "doi": ""
    },
    {
      "text": "Liberty Times Net. 2016. The Love Story Behind Jacques Picoux's Suicide. Retrieved March 28, 2019 from https://news.ltn.com.tw/news/society/breakingnews/1858280",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 439448. DOI: https://doi.org/10.1145/2556288.2557132",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design and Intervention in the Age of \"No Alternative\". Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 109 (November 2018), 21 pages. DOI: https://doi.org/10.1145/3274378",
      "doi": "10.1145/3274378"
    },
    {
      "text": "James Mahoney and Dietrich Rueschemeyer. 2003. Comparative historical analysis in the social sciences. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Jane Mansbridge, James Bohman, Simone Chambers, David Estlund, Andreas Føllesdal, Archon Fung, Cristina Lafont, Bernard Manin, and José Luis Martí. 2010. The place of self-interest and the role of power in deliberative democracy. Journal of political philosophy, 18, 1, 64--100.",
      "doi": ""
    },
    {
      "text": "Narges Mahyar, Michael R. James, Michelle M. Ng, Reginald A. Wu, and Steven P. Dow. 2018. CommunityCrit: Inviting the Public to Improve and Evaluate Urban Design Ideas through Micro-Activities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 195, 14 pages. DOI: https://doi.org/10.1145/3173574.3173769",
      "doi": "10.1145/3173574.3173769"
    },
    {
      "text": "Gloria Mark and Bryan Semaan. 2008. Resilience in collaboration: technology as a resource for new patterns of action. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, NY, NY, USA, 137146. DOI: https://doi.org/10.1145/1460563.1460585",
      "doi": "10.1145/1460563.1460585"
    },
    {
      "text": "Matti Nelimarkka. 2019. A Review of Research on Participation in Democratic Decision-Making Presented at SIGCHI Conferences. Toward an Improved Trading Zone Between Political Science and HCI. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 139 (November 2019), 29 pages. DOI: https://doi.org/10.1145/3359241",
      "doi": "10.1145/3359241"
    },
    {
      "text": "John McCarthy and Peter Wright. 2007. Technology as experience. MIT press.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Lydia Michie, Madeline Balaam, John McCarthy, Timur Osadchiy, and Kellie Morrissey. 2018. From Her Story, to Our Story: Digital Storytelling as Public Engagement around Abortion Rights Advocacy in Ireland. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 357, 15 pages. DOI: https://doi.org/10.1145/3173574.3173931",
      "doi": "10.1145/3173574.3173931"
    },
    {
      "text": "Chantal Mouffe. 1999. Deliberative democracy or agonistic pluralism?. Social Research, 66, 3, 745--758.",
      "doi": ""
    },
    {
      "text": "National Development Council. 2019. Taiwan 2020 Policy: White Paper.Retrieved March 28, 2019 from https://www.ndc.gov.tw/en/Content_List.aspx?n=9ED4619202FF31CC#",
      "doi": ""
    },
    {
      "text": "Chris Risdon and Patrick Quattlebaum. 2018. Orchestrating Experiences: Collaborative Design for Complexity. Rosenfeld Media.",
      "doi": ""
    },
    {
      "text": "Bryan C. Semaan, Scott P. Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres: towards depolarization. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1409--1421. DOI: https://doi.org/10.1145/2531602.2531605",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama, and Sara Douglas. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3167--3176. DOI: https://doi.org/10.1145/2702123.2702403",
      "doi": "10.1145/2702123.2702403"
    },
    {
      "text": "Leo Graiden Stewart, Ahmer Arif, A. Conrad Nied, Emma S. Spiro, and Kate Starbird. 2017. Drawing the Lines of Contention: Networked Frame Contests Within #BlackLivesMatter Discourse. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 96 (December 2017), 23 pages. DOI: https://doi.org/10.1145/3134920",
      "doi": "10.1145/3134920"
    },
    {
      "text": "Anselm L. Strauss. 1987. Qualitative analysis for social scientists. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Jesper Strömbäck. 2005. In search of a standard: Four models of democracy and their normative implications for journalism. Journalism Studies, 6, 3, 331--345.",
      "doi": ""
    },
    {
      "text": "Terence Hua Tai and Wen-Tsong Chiou. 2008. Equality and community in public deliberation: genetic democracy in Taiwan. In Genetic democracy, Springer, 105--120.",
      "doi": ""
    },
    {
      "text": "W. Ben Towne, and James D. Herbsleb. 2012. Design considerations for online deliberation systems. Journal of Information Technology & Politics, 9, 1, 97--115.",
      "doi": ""
    },
    {
      "text": "Zeynep Tufekci. 2008. Can you see me now? Audience and disclosure regulation in online social network sites. Bulletinof Science, Technology & Society, 28, 1, 20-- 36.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. 'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 1409--1418. DOI: https://doi.org/10.1145/2441776.2441935",
      "doi": "10.1145/2441776"
    },
    {
      "text": "Lu Xiao, Weiyu Zhang, Anna Przybylska, Anna De Liddo, Gregorio Convertino, Todd Davies, and Mark Klein. 2015. Design for Online Deliberative Processes and Technologies: Towards a Multidisciplinary Research Agenda. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 865--868.",
      "doi": "10.1145/2702613.2727687"
    },
    {
      "text": "Iris Marion Young. 2003. Activist Challenges to Deliberative Democracy. In James S. Fishkin and Peter Laslett (Eds.), Debating Deliberative Democracy, vol. 7 in the series Philosophy, Politics and Society, Oxford: Blackwell: 102--20.",
      "doi": ""
    }
  ]
}