{
  "doi": "10.1145/3313831.3376593",
  "title": "Scout: Rapid Exploration of Interface Layout Alternatives through High-Level Design Constraints",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Although exploring alternatives is fundamental to creating better interface designs, current processes for creating alternatives are generally manual, limiting the alternatives a designer can explore. We present Scout, a system that helps designers rapidly explore alternatives through mixed-initiative interaction with high-level constraints and design feedback. Prior constraint-based layout systems use low-level spatial constraints and generally produce a single design. Tosupport designer exploration of alternatives, Scout introduces high-level constraints based on design concepts (e.g.,~semantic structure, emphasis, order) and formalizes them into low-level spatial constraints that a solver uses to generate potential layouts. In an evaluation with 18 interface designers, we found that Scout: (1) helps designers create more spatially diverse layouts with similar quality to those created with a baseline tool and (2) can help designers avoid a linear design process and quickly ideate layouts they do not believe they would have thought of on their own.",
  "authors": [
    {
      "name": "Amanda Swearngin",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81488669260/rel-imgonly/avatar.jpg",
      "acmid": "81488669260",
      "orcid": "missing"
    },
    {
      "name": "Chenglong Wang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659164755",
      "orcid": "missing"
    },
    {
      "name": "Alannah Oleson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659020818/rel-imgonly/avi_new_sq.jpg",
      "acmid": "99659020818",
      "orcid": "missing"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142271",
      "orcid": "missing"
    },
    {
      "name": "Amy J. Ko",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2016. Emphasis: Setting up the focal point of your design | Interaction Design Foundation. (2016). https://www.interaction-design.org/literature/article/emphasis-setting-up-the-focal-point-of-your-design",
      "doi": ""
    },
    {
      "text": "2018. Material Design Guidelines. https://material.io/design/. (2018).",
      "doi": ""
    },
    {
      "text": "Nick Babich. 2017. Building Better UI Designs With Layout Grids. (Dec 2017). https://www.smashingmagazine.com/2017/12/building-better-ui-designs-layout-grids/",
      "doi": ""
    },
    {
      "text": "Greg J Badros, Alan Borning, Kim Marriott, and Peter Stuckey. 1999. Constraint Cascading Stylesheets for the Web. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology. ACM, 73--82.",
      "doi": ""
    },
    {
      "text": "Joey Benedek and Trish Miner. 2002. Measuring Desirability: New Methods for Evaluating Desirability in a Usability Lab Setting. Proceedings of Usability Professionals Association 2003, 8--12 (2002), 57.",
      "doi": ""
    },
    {
      "text": "Pavol Bielik, Marc Fischer, and Martin Vechev. 2018. Robust Relational Layout Synthesis from Examples for Android. Proceedings of the ACM on Programming Languages 2, OOPSLA, Article 156 (Oct. 2018), 29 pages. DOI: http://dx.doi.org/10.1145/3276526",
      "doi": "10.1145/3276526"
    },
    {
      "text": "Alan Borning, Richard Kuang-Hsu Lin, and Kim Marriott. 2000. Constraint-based Document Layout for the Web. Multimedia Systems 8, 3 (Oct 2000), 177--189. DOI: http://dx.doi.org/10.1007/s005300000043",
      "doi": "10.1007/s005300000043"
    },
    {
      "text": "William Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design. Elsevier/Morgan Kaufmann. 443 pages.",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Kerry Shih-Ping Chang and Brad A. Myers. 2012. WebCrystal: Understanding and Reusing Examples in Web Authoring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 3205--3214. DOI: http://dx.doi.org/10.1145/2207676.2208740",
      "doi": ""
    },
    {
      "text": "Larry L Constantine and Lucy AD Lockwood. 1999. Software for Use: A Practical Guide to the Models and Methods of Usage-Centered Design. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Leonardo De Moura and Nikolaj Bjørner. 2008. Z3: An Efficient SMT Solver. Tools and Algorithms for the Construction and Analysis of Systems (2008), 337--340.",
      "doi": "10.5555/1792734.1792766"
    },
    {
      "text": "Steven P. Dow, Julie Fortuna, Dan Schwartz, Beth Altringer, Daniel L. Schwartz, and Scott R. Klemmer. 2012a. Prototyping Dynamics: Sharing Multiple Designs Improves Exploration, Group Rapport, and Results. In Design Thinking Research. Springer Berlin Heidelberg, Berlin, Heidelberg, 47--70. DOI: http://dx.doi.org/10.1007/978--3--642--31991--4_4",
      "doi": ""
    },
    {
      "text": "Steven P. Dow, Alana Glassco, Jonathan Kass, Melissa Schwarz, Daniel L. Schwartz, and Scott R. Klemmer. 2012b. Parallel Prototyping Leads to Better Design Results, More Divergence, and Increased Self-efficacy. In Design Thinking Research. Springer Berlin Heidelberg, Berlin, Heidelberg, 127--153. DOI: http://dx.doi.org/10.1007/978--3--642--21643--5_8",
      "doi": ""
    },
    {
      "text": "Krzysztof Gajos, Anthony Wu, and Daniel S Weld. 2005. Cross-Device Consistency in Automatically Generated User Interfaces. In Proceedings of the 2nd Workshop on Multi-User and Ubiquitous User Interfaces. 7--8.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z. Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2007. Automatically Generating User Interfaces Adapted to Users' Motor and Vision Capabilities. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM Press, New York, New York, USA, 231. DOI: http://dx.doi.org/10.1145/1294211.1294253",
      "doi": ""
    },
    {
      "text": "Ulrike Hahn, Nick Chater, and Lucy B Richardson. 2003. Similarity as Transformation. Cognition 87, 1 (2003), 1--32.",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Leslie Wu, Kevin Collins, and Scott R. Klemmer. 2007. Programming by a Sample: Rapidly Creating Web Applications with D.Mix. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, NY, NY, USA, 241--250. DOI: http://dx.doi.org/10.1145/1294211.1294254",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R. Klemmer. 2008. Design as Exploration: Creating Interface Alternatives through Parallel Authoring and Runtime Tuning. In Proceedings of the 21st Annual ACM symposium on User Interface Software and Technology (UIST '08). ACM Press, New York, New York, USA, 91. DOI: http://dx.doi.org/10.1145/1449715.1449732",
      "doi": ""
    },
    {
      "text": "Scarlett R. Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P. Bailey. 2009. Getting Inspired!: Understanding How and Why Examples Are Used in Creative Design Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 87--96. DOI: http://dx.doi.org/10.1145/1518701.1518717",
      "doi": ""
    },
    {
      "text": "Thibaud Hottelier, Ras Bodik, and Kimiko Ryokai. 2014. Programming by Manipulation for Layout. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 231--241. DOI: http://dx.doi.org/10.1145/2642918.2647378",
      "doi": "10.1145/2642918.2647378"
    },
    {
      "text": "Apple Inc. 2018. Building Adaptive User Interfaces Apple Developer. (2018). https://developer.apple.com/design/adaptivity/",
      "doi": ""
    },
    {
      "text": "David G. Jansson and Steven M. Smith. 1991. Design Fixation. Design Studies 12, 1 (jan 1991), 3--11. DOI: http://dx.doi.org/10.1016/0142--694X(91)90003-F",
      "doi": ""
    },
    {
      "text": "Yue Jiang, Ruofei Du, Christof Lutteroth, and Wolfgang Stuerzlinger. 2019. ORC Layout: Adaptive GUI Layout with OR-Constraints. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 413, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300643",
      "doi": "10.1145/3290605.3300643"
    },
    {
      "text": "Solange Karsenty, Chris Weikart, and James A. Landay. 1993. Inferring Graphical Constraints with Rockit. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '93). ACM Press, New York, New York, USA, 531. DOI: http://dx.doi.org/10.1145/169059.169528",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Hyunmin Cheong, Ali Hashemi, and George Fitzmaurice. 2017. DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 401--414. DOI: http://dx.doi.org/10.1145/3126594.3126662",
      "doi": "10.1145/3126594.3126662"
    },
    {
      "text": "Wolfgang Kohler. 1967. Gestalt psychology. Psychological Research 31, 1 (1967), XVIII--XXX. DOI: http://dx.doi.org/10.1007/BF00422382",
      "doi": ""
    },
    {
      "text": "Ranjitha Kumar, Jerry O. Talton, Salman Ahmad, and Scott R. Klemmer. 2011. Bricolage: Example-Based Retargeting for Web Design. In Proceedings of the SIGCHI Conference Human Factors in Computing Systems (CHI '11). ACM Press, New York, New York, USA, 2197. DOI: http://dx.doi.org/10.1145/1978942.1979262",
      "doi": ""
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer. 2010. Designing with Interactive Example Galleries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Syfstems (CHI '10). ACM, NY, NY, USA, 2257--2266. DOI: http://dx.doi.org/10.1145/1753326.1753667",
      "doi": ""
    },
    {
      "text": "Jianan Li, Tingfa Xu, Jianming Zhang, Aaron Hertzmann, and Jimei Yang. 2018. LayoutGAN: Generating Graphic Layouts with Wireframe Discriminator. (2018).",
      "doi": ""
    },
    {
      "text": "William Lidwell. 2003. Universal Principles of Design. (2003).",
      "doi": ""
    },
    {
      "text": "James Lin and James A. Landay. 2008. Employing Patterns and Layers for Early-Stage Design and Prototyping of Cross-Device User Interfaces. In Proceeding of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM Press, New York, New York, USA, 1313. DOI: http://dx.doi.org/10.1145/1357054.1357260",
      "doi": ""
    },
    {
      "text": "Aran Lunzer and Kasper Hornbæk. 2008. Subjunctive Interfaces: Extending Applications to Support Parallel Setup, Viewing and Control of Alternative Scenarios. ACM Transactions on Computer-Human Interaction 14, 4 (January 2008), 1--44. DOI: http://dx.doi.org/10.1145/1314683.1314685",
      "doi": "10.1145/1314683.1314685"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream Lens: Exploration and Visualization of Large-Scale Generative Design Datasets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM Press, New York, NY, USA, Article Paper 369, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173943",
      "doi": "10.1145/3173574.3173943"
    },
    {
      "text": "Aliaksei Miniukovich and Antonella De Angeli. 2015. Visual Diversity and User Interface Quality. In Proceedings of the 2015 British HCI Conference. ACM, 101--109.",
      "doi": "10.1145/2783446.2783580"
    },
    {
      "text": "Dominik Moritz, Chenglong Wang, Greg L Nelson, Halden Lin, Adam M Smith, Bill Howe, and Jeffrey Heer. 2019. Formalizing Visualization Design Knowledge as Constraints: Actionable and Extensible Models in Draco. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2019), 438--448.",
      "doi": "10.1109/TVCG.2018.2865240"
    },
    {
      "text": "Jeffrey Nichols, Brad A. Myers, and Kevin Litwack. 2004. Improving Automatic Interface Generation with Smart Templates. In Proceedings of the 9th International Conference on Intelligent User Interfaces (IUI '04). ACM Press, New York, New York, USA, 286. DOI: http://dx.doi.org/10.1145/964442.964507",
      "doi": "10.1145/964442.964507"
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic Evaluation of User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90). ACM Press, New York, New York, USA, 249--256. DOI: http://dx.doi.org/10.1145/97243.97281",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2015. DesignScape: Design with Interactive Layout Suggestions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). ACM Press, New York, New York, USA, 1221--1224. DOI: http://dx.doi.org/10.1145/2702123.2702149",
      "doi": "10.1145/2702123.2702149"
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative Research & Evaluation Methods: Integrating Theory and Practice. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Andreas Riegler and Clemens Holzmann. 2018. Measuring Visual User Interface Complexity of Mobile Applications With Metrics. Interacting with Computers 30, 3 (2018), 207--223.",
      "doi": ""
    },
    {
      "text": "Stuart J Russell and Peter Norvig. 2002. Artificial Intelligence: A Modern Approach. Prentice Hall.",
      "doi": "10.5555/193191"
    },
    {
      "text": "Piyawadee Sukaviriya, James D. Foley, and Todd Griffith. 1993. A Second Generation User Interface Design Environment: The Model and the Runtime Architecture. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '93). ACM Press, New York, New York, USA, 375--382. DOI: http://dx.doi.org/10.1145/169059.169299",
      "doi": "10.1145/169059.169299"
    },
    {
      "text": "Amanda Swearngin, Mira Dontcheva, Wilmot Li, Joel Brandt, Morgan Dixon, and Amy J. Ko. 2018. Rewire: Interface Design Assistance from Examples. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 504, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174078",
      "doi": ""
    },
    {
      "text": "Pedro Szekely, Ping Luo, and Robert Neches. 1993. Beyond Interface Builders: Model-Based Interface Tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '93). ACM, New York, New York, USA, 383--390. DOI: http://dx.doi.org/10.1145/169059.169305",
      "doi": "10.1145/169059.169305"
    },
    {
      "text": "Michael Terry and Elizabeth D. Mynatt. 2002. Side views: Persistent, On-Demand Previews for Open-Ended Tasks. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM Press, New York, New York, USA, 71. DOI: http://dx.doi.org/10.1145/571985.571996",
      "doi": ""
    },
    {
      "text": "Michael Terry, Elizabeth D Mynatt, Kumiyo Nakakoji, and Yasuhiro Yamamoto. 2004. Variation in Element and Action: Supporting Simultaneous Development of Alternative Solutions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, New York, USA, 711--718.",
      "doi": "10.1145/985692.985782"
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and Explore with a Layout Optimiser. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM Press, New York, New York, USA, 543--555. DOI: http://dx.doi.org/10.1145/2901790.2901817",
      "doi": "10.1145/2901790.2901817"
    },
    {
      "text": "Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. Getting the Right Design and the Design Right. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM Press, New York, New York, USA, 1243. DOI: http://dx.doi.org/10.1145/1124772.1124960",
      "doi": "10.1145/1124772.1124960"
    },
    {
      "text": "Khoi Vinh. 2010. Ordering Disorder: Grid Principles for Web Design. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Alex W White. 2011. The Elements of Graphic Design: Space, Unity, Page Architecture, and Type. Skyhorse Publishing, Inc.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 143--146. DOI: http://dx.doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Pengfei Xu, Hongbo Fu, Takeo Igarashi, and Chiew-Lan Tai. 2014. Global Beautification of Layouts With Interactive Ambiguity Resolution. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM Press, New York, New York, USA, 243--252. DOI: http://dx.doi.org/10.1145/2642918.2647398",
      "doi": "10.1145/2642918.2647398"
    },
    {
      "text": "Loutfouz Zaman, Wolfgang Stuerzlinger, Christian Neugebauer, Rob Woodbury, Maher Elkhaldi, Naghmi Shireen, and Michael Terry. 2015. GEM-NI: A System for Creating and Managing Alternatives In Generative Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). ACM Press, New York, New York, USA, 1201--1210. DOI: http://dx.doi.org/10.1145/2702123.2702398",
      "doi": "10.1145/2702123.2702398"
    },
    {
      "text": "Brad Vander Zanden and Brad A. Myers. 1990. Automatic, Look-and-Feel Independent Dialog Creation for Graphical User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90). ACM Press, New York, New York, USA, 27--34. DOI: http://dx.doi.org/10.1145/97243.97248",
      "doi": ""
    },
    {
      "text": "Brad Vander Zanden and Brad A. Myers. 1991. The Lapidary Graphical Interface Design Tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM Press, New York, New York, USA, 465--466. DOI: http://dx.doi.org/10.1145/108844.109005",
      "doi": ""
    },
    {
      "text": "Clemens Zeidler, Christof Lutteroth, Wolfgang Sturzlinger, and Gerald Weber. 2013. The Auckland Layout Editor: An Improved GUI Layout Specification Process. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM Press, New York, New York, USA, 343--352. DOI: http://dx.doi.org/10.1145/2501988.2502007",
      "doi": "10.1145/2501988.2502007"
    },
    {
      "text": "Clemens Zeidler, Gerald Weber, Wolfgang Stuerzlinger, and Christof Lutteroth. 2017. Automatic Generation of User Interface Layouts for Alternative Screen Orientations. In Human-Computer Interaction (INTERACT 2017). Springer International Publishing, Cham, 13--35.",
      "doi": ""
    }
  ]
}