{
  "doi": "10.1145/3313831.3376373",
  "title": "PuffPacket: A Platform for Unobtrusively Tracking the Fine-grained Consumption Patterns of E-cigarette Users",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "The proliferation of e-cigarettes and portable vaporizers presents new opportunities for accurately and unobtrusively tracking e-cigarette use. PuffPacket is a hardware and soft-ware research platform that leverages the technology built into vaporizers, e-cigarettes and other electronic drug delivery devices to ubiquitously track their usage. The system piggybacks on the signals these devices use to directly measure and track the nicotine consumed by users. PuffPacket augments e-cigarettes with Bluetooth to calculate the frequency, intensity, and duration of each inhalation. This information is augmented with smartphone-based location and activity information to help identify potential contextual triggers. Puff-Packet is generalizable to a wide variety of electronic nicotine,THC, and other drug delivery devices currently on the mar-ket. The hardware and software for PuffPacket is open-source so it can be expanded upon and leveraged for mobile health tracking research.",
  "authors": [
    {
      "name": "Alexander T. Adams",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556747956",
      "orcid": "missing"
    },
    {
      "name": "Ilan Mandel",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320416",
      "orcid": "missing"
    },
    {
      "name": "Anna Shats",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526579",
      "orcid": "missing"
    },
    {
      "name": "Alina Robin",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527651",
      "orcid": "missing"
    },
    {
      "name": "Tanzeem Choudhury",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100078026",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adafruit. 2014. Micro-Lipo Battery Charger. http://bit.ly/37HV0r5. (2014).",
      "doi": ""
    },
    {
      "text": "Alexander T. Adams, Jean Costa, Malte F. Jung, and Tanzeem Choudhury. 2015. Mindless Computing: Designing Technologies to Subtly Influence Behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 719--730.",
      "doi": "10.1145/2750858.2805843"
    },
    {
      "text": "C Ague. 1973. Smoking patterns, nicotine intake at different times of day and changes in two cardiovascular variables while smoking cigarettes. Psychopharmacologia 30, 2 (1973), 135--144.",
      "doi": ""
    },
    {
      "text": "Amin Ahsan Ali, Syed Monowar Hossain, Karen Hovsepian, Md Mahbubur Rahman, Kurt Plarre, and Santosh Kumar. 2012. mPuff: automated detection of cigarette smoking puffs from respiration measurements. In Proceedings of the 11th international conference on Information Processing in Sensor Networks. ACM, 269--280.",
      "doi": "10.1145/2185677.2185741"
    },
    {
      "text": "Jon-Patrick Allem, Likhit Dharmapuri, Jennifer B Unger, and Tess Boley Cruz. 2018. Characterizing JUUL-related posts on Twitter. Drug and alcohol dependence 190 (2018), 1--5.",
      "doi": ""
    },
    {
      "text": "Apple. 2018a. Core Location. https://developer.apple.com/documentation/corelocation?language=objc. (2018).",
      "doi": ""
    },
    {
      "text": "Apple. 2018b. Core Motion. (2018). https://developer. apple.com/documentation/coremotion?language=objc",
      "doi": ""
    },
    {
      "text": "CDC. 2018. About Electronic Cigarettes (E-Cigarettes). https://www.cdc.gov/tobacco/basic_information/e-cigarettes/about-e-cigarettes.html. (2018).",
      "doi": ""
    },
    {
      "text": "CDC. 2019. Economic Trends in Tobacco. http://bit.ly/2sVIp4S. (2019).",
      "doi": ""
    },
    {
      "text": "Siddharth Chandra, Deborah Scharf, and Saul Shiffman. 2011. Within-day temporal patterns of smoking, withdrawal symptoms, and craving. Drug and alcohol dependence 117, 2--3 (2011), 118--125.",
      "doi": ""
    },
    {
      "text": "Siddharth Chandra, Saul Shiffman, Deborah M Scharf, Qianyu Dang, and William G Shadel. 2007. Daily smoking patterns, their determinants, and implications for quitting. Experimental and clinical psychopharmacology 15, 1 (2007), 67.",
      "doi": ""
    },
    {
      "text": "Nicholas A Christakis and James H Fowler. 2008. The collective dynamics of smoking in a large social network. New England journal of medicine 358, 21 (2008), 2249--2258.",
      "doi": ""
    },
    {
      "text": "Kar-Hai Chu, Jon-Patrick Allem, Tess Boley Cruz, and Jennifer B Unger. 2017. Vaping on Instagram: cloud chasing, hand checks and product placement. Tobacco control 26, 5 (2017), 575--578.",
      "doi": ""
    },
    {
      "text": "Gabe Cohn, Sidhant Gupta, Tien-Jui Lee, Dan Morris, Joshua R Smith, Matthew S Reynolds, Desney S Tan, and Shwetak N Patel. 2012. An ultra-low-power human body motion sensor using static electric field sensing. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 99--102.",
      "doi": "10.1145/2370216.2370233"
    },
    {
      "text": "Gabe Cohn, Daniel Morris, Shwetak N Patel, and Desney S Tan. 2011. Your noise is my command: sensing gestures using the body as an antenna. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 791--800.",
      "doi": "10.1145/1978942.1979058"
    },
    {
      "text": "TE Connectivity. 2017. MS583702BA. http://bit.ly/2T3hZss. (2017).",
      "doi": ""
    },
    {
      "text": "Jean Costa, Alexander T. Adams, Malte F. Jung, François Guimbretière, and Tanzeem Choudhury. 2016. EmotionCheck: Leveraging Bodily Signals and False Feedback to Regulate Our Emotions. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, NY, NY, USA, 758--769.",
      "doi": "10.1145/2971648.2971752"
    },
    {
      "text": "Jinqi Cui, Liang Wang, Tao Gu, Xianping Tao, and Jian Lu. 2016. An audio-based hierarchical smoking behavior detection system based on a smart neckband platform. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services. ACM, 190--199.",
      "doi": "10.1145/2994374.2994384"
    },
    {
      "text": "Karen A. Cullen, Bridget K. Ambrose, Andrea S. Gentzke, Benjamin J. Apelberg, Ahmed Jamal, and Brian A. King. 2018. Notes from the Field: Increase in use of electronic cigarettes and any tobacco product among middle and high school students. https://www.cdc.gov/mmwr/volumes/67/wr/mm6745a5.htm. (2018).",
      "doi": ""
    },
    {
      "text": "Daniel Eisenberg, Ezra Golberstein, and Janis L Whitlock. 2014. Peer effects on risky behaviors: New evidence from college roommate assignments. Journal of health economics 33 (2014), 126--138.",
      "doi": ""
    },
    {
      "text": "Abdallah El Ali, Andrii Matviienko, Yannick Feld, Wilko Heuten, and Susanne Boll. 2016. VapeTracker: Tracking vapor consumption to help e-cigarette users quit. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2049--2056.",
      "doi": "10.1145/2851581.2892318"
    },
    {
      "text": "Sherry L Emery, Lisa Vera, Jidong Huang, and Glen Szczypka. 2014. Wanna know about vaping? Patterns of message exposure, seeking and sharing information about e-cigarettes across media platforms. Tobacco control 23, suppl 3 (2014), iii17--iii25.",
      "doi": ""
    },
    {
      "text": "Enovap. 2016. Enovap Shop: Enovap Personal Vaporizer. https://www.enovap.com/en/shop/enovap. (2016).",
      "doi": ""
    },
    {
      "text": "FDA. 2018. Vaporizers, E-Cigarettes, and other Electronic Nicotine Delivery Systems (ENDS). http://bit.ly/2FsYLED. (2018).",
      "doi": ""
    },
    {
      "text": "Alessandro Fenicio and Gaëlle Calvary. 2015. Persuasion Through an Ambient Device: Proof of Concept and Early Evaluation of CRegrette, a Smoking Cessation System. In European Conference on Ambient Intelligence. Springer, 252--267.",
      "doi": ""
    },
    {
      "text": "Maciej L. Goniewicz, Danielle M. Smith, Kathryn C. Edwards, Benjamin C. Blount, Kathleen L. Caldwell, Jun Feng, Lanqing Wang, Carol Christensen, Bridget Ambrose, Nicolette Borek, Dana van Bemmel, Karen Konkel, Gladys Erives, Cassandra A. Stanton, Elizabeth Lambert, Heather L. Kimmel, Dorothy Hatsukami, Stephen S. Hecht, Raymond S. Niaura, Mark Travers, Charles Lawrence, and Andrew J. Hyland. 2018. Comparison of Nicotine and Toxicant Exposure in Users of Electronic Cigarettes and Combustible Cigarettes. JAMA Network Open 1, 8 (12 2018).",
      "doi": ""
    },
    {
      "text": "David Hammond, Geoffrey T. Fong, K. Michael Cummings, and Andrew Hyland. 2005. Smoking Topography, Brand Switching, and Nicotine Delivery: Results from an In vivo Study. Cancer Epidemiology and Prevention Biomarkers 14, 6 (2005), 1370--1375. https://cebp.aacrjournals.org/content/14/6/1370",
      "doi": ""
    },
    {
      "text": "Todd F Heatherton, Lynn T Kozlowski, Richard C Frecker, William Rickert, and Jack Robinson. 1989. Measuring the heaviness of smoking: using self-reported time to the first cigarette of the day and number of cigarettes smoked per day. British journal of addiction 84, 7 (1989), 791--800.",
      "doi": ""
    },
    {
      "text": "Bo-Jhang Ho and Mani B Srivastava. 2014. Poster: M-Seven: monitoring smoking event by considering time sequence information via iPhone M7 API. In Proceedings of the 12th annual international conference on Mobile systems, applications, and services. ACM, 372--372.",
      "doi": "10.1145/2594368.2601451"
    },
    {
      "text": "Syed Monowar Hossain, Amin Ahsan Ali, Md Mahbubur Rahman, Emre Ertin, David Epstein, Ashley Kennedy, Kenzie Preston, Annie Umbricht, Yixin Chen, and Santosh Kumar. 2014. Identifying drug (cocaine) intake events from acute physiological response in the presence of free-living physical activity. In Proceedings of the 13th international symposium on Information processing in sensor networks. IEEE Press, 71--82.",
      "doi": "10.5555/2602339.2602348"
    },
    {
      "text": "Grace C Huang, Jennifer B Unger, Daniel Soto, Kayo Fujimoto, Mary Ann Pentz, Maryalice Jordan-Marsh, and Thomas W Valente. 2014. Peer influences: the impact of online and offline friendship networks on adolescent smoking and alcohol use. Journal of Adolescent Health 54, 5 (2014), 508--514.",
      "doi": ""
    },
    {
      "text": "Jidong Huang, Zongshuan Duan, Julian Kwok, Steven Binns, Lisa E Vera, Yoonsang Kim, Glen Szczypka, and Sherry L Emery. 2019a. Vaping versus JUULing: how the extraordinary growth and marketing of JUUL transformed the US retail e-cigarette market. Tobacco control 28, 2 (2019), 146--151.",
      "doi": ""
    },
    {
      "text": "Jidong Huang, Zongshuan Duan, Julian Kwok, Steven Binns, Lisa E Vera, Yoonsang Kim, Glen Szczypka, and Sherry L Emery. 2019b. Vaping versus JUULing: how the extraordinary growth and marketing of JUUL transformed the US retail e-cigarette market. Tobacco Control 28, 2 (2019), 146--151.",
      "doi": ""
    },
    {
      "text": "Texas Instruments. 2008. INA219 Zero-Drift, Bidirectional Current/Power Monitor With I2C Interface. http://www.ti.com/lit/ds/symlink/ina219.pdf. (2008).",
      "doi": ""
    },
    {
      "text": "Joytech. 2018. eCom BT. https://www.joyetech.com/product/ecom-bt/?bluetooth?/. (2018).",
      "doi": ""
    },
    {
      "text": "JUUL. 2019. The Smoking Alternative, unlike any E-Cigarette or Vape. https://www.juul.ca/en-CA/shop/devices/juul-c1. (2019).",
      "doi": ""
    },
    {
      "text": "Andrew T Kaczynski, Stephen R Manske, Roger C Mannell, and Keerat Grewal. 2008. Smoking and physical activity: a systematic review. American journal of health behavior 32, 1 (2008), 93--110.",
      "doi": ""
    },
    {
      "text": "Sara Kalkhoran and Stanton A Glantz. 2016. E-cigarettes and smoking cessation in real-world and clinical settings: a systematic review and meta-analysis. The Lancet Respiratory Medicine 4, 2 (2016), 116--128.",
      "doi": ""
    },
    {
      "text": "Helen Keane, Megan Weier, Doug Fraser, and Coral Gartner. 2017. 'Anytime, anywhere': vaping as social practice. Critical Public Health 27, 4 (2017), 465--476.",
      "doi": ""
    },
    {
      "text": "G Mangiaracina and L Palumbo. 2007. Smoking while driving and its consequences on road safety. Annali di igiene: medicina preventiva e di comunita 19, 3 (2007), 253--267.",
      "doi": ""
    },
    {
      "text": "Robert C McMillen, Mark A Gottlieb, Regina M Whitmore Shaefer, Jonathan P Winickoff, and Jonathan D Klein. 2014. Trends in electronic cigarette use among US adults: use is increasing in both smokers and nonsmokers. Nicotine & Tobacco Research 17, 10 (2014), 1195--1202.",
      "doi": ""
    },
    {
      "text": "Peter M Miller, Lee W Frederiksen, and Robert L Hosford. 1979. Social interaction and smoking topography in heavy and light smokers. Addictive behaviors 4, 2 (1979), 147--153.",
      "doi": ""
    },
    {
      "text": "Susan Moran, Henry Wechsler, and Nancy A Rigotti. 2004. Social smoking among US college students. Pediatrics 114, 4 (2004), 1028--1034.",
      "doi": ""
    },
    {
      "text": "Annamalai Natarajan, Gustavo Angarita, Edward Gaiser, Robert Malison, Deepak Ganesan, and Benjamin M Marlin. 2016. Domain adaptation methods for improving lab-to-field generalization of cocaine detection using wearable ECG. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 875--885.",
      "doi": "10.1145/2971648.2971666"
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Umachanger Brinthaparan,Lars Lichon, Stephan Rasmussen, Nirojan Srikandaraja,Wally Smith, Greg Wadley, and Bernd Ploderer. 2014.Quitty: using technology to persuade smokers to quit. InProceedings of the 8th Nordic Conference onHuman-Computer Interaction: Fun, Fast, Foundational.551--560.",
      "doi": "10.1145/2639189.2639195"
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Mikael B Skov, NirojanSrikandarajah, and Umachanger Brinthaparan. 2015.Personal Counseling on Smart Phones For SmokingCessation. InProceedings of the 33rd Annual ACMConference Extended Abstracts on Human Factors inComputing Systems. 1427--1432.",
      "doi": ""
    },
    {
      "text": "Abhinav Parate, Meng-Chieh Chiu, Chaniel Chadowitz, Deepak Ganesan, and Evangelos Kalogerakis. 2014. Risq: Recognizing smoking gestures with inertial sensors on a wristband. In Proceedings of the 12th annual international conference on Mobile systems, applications, and services. ACM, 149--161.",
      "doi": "10.1145/2594368.2594379"
    },
    {
      "text": "Mitesh S. Patel, David A. Asch, and Kevin G. Volpp. 2015. Wearable Devices as Facilitators, Not Drivers, of Health Behavior Change. JAMA 313, 5 (02 2015), 459--460.",
      "doi": ""
    },
    {
      "text": "Shwetak N Patel, Sidhant Gupta, and Matthew S Reynolds. 2010. The design and evaluation of an end-user-deployable, whole house, contactless power consumption sensor. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 2471--2480.",
      "doi": "10.1145/1753326.1753700"
    },
    {
      "text": "Tauhidur Rahman, Alexander T. Adams, Ruth Vinisha Ravichandran, Mi Zhang, Shwetak N. Patel, Julie A. Kientz, and Tanzeem Choudhury. 2015. DoppleSleep: A Contactless Unobtrusive Sleep Sensing System Using Short-range Doppler Radar. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 39--50.",
      "doi": "10.1145/2750858.2804280"
    },
    {
      "text": "RFDigital. 2015. https://github.com/RFduino/RFduino. (2015).",
      "doi": ""
    },
    {
      "text": "Abi Rimmer and Gareth Iacobucci. 2019. Vaping: CDC investigation continues after patient dies from severe lung injuries. BMJ 366 (2019). https://www.bmj.com/content/366/bmj.l5320",
      "doi": ""
    },
    {
      "text": "Nazir Saleheen, Amin Ahsan Ali, Syed Monowar Hossain, Hillol Sarker, Soujanya Chatterjee, Benjamin Marlin, Emre Ertin, Mustafa Al'Absi, and Santosh Kumar. 2015. puffMarker: a multi-sensor approach for pinpointing the timing of first lapse in smoking cessation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 999--1010.",
      "doi": "10.1145/2750858.2806897"
    },
    {
      "text": "Philipp M Scholl, Nagihan Kücükyildiz, and Kristof Van Laerhoven. 2013. When do you light a fire?: capturing tobacco use with situated, wearable sensors. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication. ACM, 1295--1304.",
      "doi": ""
    },
    {
      "text": "K.J. Schuh and Maxine L. Stitzer. 1995. Desire to smoke during spaced smoking intervals. Psychopharmacology 120, 3 (1995), 289--295.",
      "doi": ""
    },
    {
      "text": "Saul Shiffman. 2009. How many cigarettes did you smoke? Assessing cigarette consumption by global report, Time-Line Follow-Back, and ecological momentary assessment. Health Psychology 28, 5 (2009), 519.",
      "doi": ""
    },
    {
      "text": "Marilyn D. Skinner and Henri-Jean Aubin. 2010. Craving's place in addiction theory: contributions of the major models. Neuroscience & Biobehavioral Reviews 34, 4 (2010), 606--623.",
      "doi": ""
    },
    {
      "text": "Tomasz R. Sosnowski and Katarzyna Kramek-Romanowska. 2016. Predicted deposition of e-cigarette aerosol in the human lungs. Journal of aerosol medicine and pulmonary drug delivery 29, 3 (2016), 299--309.",
      "doi": ""
    },
    {
      "text": "Statista. 2018. Electronic cigarettes (e-cigarettes) dollar sales in the United States from 2014 to 2018 (in billion U.S. dollars). https://www.statista.com/statistics/285143/us-e-cigarettes-dollar-sales/. (2018).",
      "doi": ""
    },
    {
      "text": "Andy SL Tan and Cabral A Bigman. 2014. E-cigarette awareness and perceived harmfulness: prevalence and associations with smoking-cessation outcomes. American journal of preventive medicine 47, 2 (2014), 141--149.",
      "doi": ""
    },
    {
      "text": "Qu Tang, Damon J Vidrine, Eric Crowder, andStephen S Intille. 2014. Automated detection of puffingand smoking with wrist accelerometers. InProceedingsof the 8th International Conference on PervasiveComputing Technologies for Healthcare. 80--87.",
      "doi": ""
    },
    {
      "text": "Saurabh Singh Thakur and Ram Babu Roy. 2018. A mobile app based smoking cessation assistance using automated detection of smoking activity. In Proceedings of the ACM India Joint International Conference on Data Science and Management of Data. ACM, 352--355.",
      "doi": "10.1145/3152494.3167989"
    },
    {
      "text": "Kathryn A Urberg, Shiang-Jeou Shyu, and Jersey Liang. 1990. Peer influence in adolescent cigarette smoking. Addictive behaviors 15, 3 (1990), 247--255.",
      "doi": ""
    },
    {
      "text": "Jill M Williams, Kunal K Gandhi, Shou-En Lu, Supriya Kumar, Marc L Steinberg, Brett Cottler, and Neal L Benowitz. 2011. Shorter interpuff interval is associated with higher nicotine intake in smokers with schizophrenia. Drug and alcohol dependence 118, 2--3 (2011), 313--319.",
      "doi": ""
    },
    {
      "text": "Chuang-Wen You, Ya-Fang Lin, Cheng-Yuan Li, Yu-Lun Tsai, Ming-Chyi Huang, Chao-Hui Lee, Hao-Chuan Wang, and Hao-Hua Chu. 2016. KeDiary: Using Mobile Phones to Assist Patients in Recovering from Drug Addiction. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 5704--5709.",
      "doi": "10.1145/2858036.2858185"
    }
  ]
}