{
  "doi": "10.1145/3313831.3376168",
  "title": "What is this URL's Destination? Empirical Evaluation of Users' URL Reading",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Common anti-phishing advice tells users to mouse over links, look at the URL, and compare to the expected destination, implicitly assuming that they are able to read the URL. To test this assumption, we conducted a survey with 1929 participants recruited from the Amazon Mechanical Turk and Prolific Academic platforms. Participants were shown 23 URLs with various URL structures. For each URL, participants were asked via a multiple choice question where the URL would lead and how safe they feel clicking on it would be. Using latent class analysis, participants were stratified by self-reported technology use. Participants were strongly biased towards answering that the URL would lead to the website of the organization whose name appeared in the URL, regardless of its position in the URL structure. The group with the highest technology use was only minorly better at URL reading.",
  "authors": [
    {
      "name": "Sara Albakry",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527620",
      "orcid": "missing"
    },
    {
      "name": "Kami Vaniea",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81335498861/rel-imgonly/81335498861.jpg",
      "acmid": "81335498861",
      "orcid": "missing"
    },
    {
      "name": "Maria K. Wolters",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81100428841/rel-imgonly/img_3457.jpg",
      "acmid": "81100428841",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alan Agresti. 2002. Categorical Data Analysis (2 ed.). John Wiley, New York, NY.",
      "doi": ""
    },
    {
      "text": "Aiping Xiong, Robert W. Proctor, Weining Yang and Ninghui Li. 2017. Is Domain Highlighting Actually Helpful in Identifying Phishing Web Pages? Aiping. Human Factors (2017). http://journals.sagepub.com/ doi/pdf/10.1177/0018720816684064",
      "doi": ""
    },
    {
      "text": "Sara Albakry, Kami Vaniea, and Maria Wolters. 2020. Opinions on Weblinks. (2020). DOI: http://dx.doi.org/10.7488/ds/2749",
      "doi": ""
    },
    {
      "text": "Mohamed Alsharnouby, Furkan Alaca, and Sonia Chiasson. 2015. Why Phishing Still Works. Int. J. Hum.-Comput. Stud. 82, C (Oct. 2015), 69--82. DOI: http://dx.doi.org/10.1016/j.ijhcs.2015.05.005",
      "doi": ""
    },
    {
      "text": "Demetris Antoniades and Thomas Karagiannis. 2011. we.b: The web of short URLs. In e International World Wide Web Conference Committee (IW3C2). http://bit.ly/dv82ka.",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software 67, 1 (2015), 1--48. DOI: http://dx.doi.org/10.18637/jss.v067.i01",
      "doi": ""
    },
    {
      "text": "Tim Berners-Lee. 2000. Frequently Asked Questions. World Wide Web Consortium (2000).",
      "doi": ""
    },
    {
      "text": "T. Berners-Lee, L. Masinter, and M. McCahill. 1994. RFC1738: Uniform Resource Locators (URL). (December 1994). https://www.w3.org/Addressing/rfc1738.txt https://www.w3.org/Addressing/rfc1738.txt.",
      "doi": "10.17487/RFC1738"
    },
    {
      "text": "Gamze Canova, Melanie Volkamer, Clemens Bergmann, and Roland Borza. 2014. NoPhish: an anti-phishing education app. In International Workshop on Security and Trust Management. Springer, 188--192.",
      "doi": ""
    },
    {
      "text": "Gamze Canova, Melanie Volkamer, Clemens Bergmann, and Benjamin Reinheimer. 2015. NoPhish app evaluation: lab and retention study. In NDSS workshop on usable security.",
      "doi": ""
    },
    {
      "text": "Sidharth Chhabra, Anupama Aggarwal, Fabricio Benevenuto, and Ponnurangam Kumaraguru. 2011a. Phi.Sh/$oCiaL: The Phishing Landscape Through Short URLs. In Proceedings of the 8th Annual Collaboration, Electronic Messaging, Anti-Abuse and Spam Conference (CEAS '11). ACM, NY, NY, USA, 92--101. DOI: http://dx.doi.org/10.1145/2030376.2030387",
      "doi": "10.1145/2030376.2030387"
    },
    {
      "text": "Sidharth Chhabra, Anupama Aggarwal, Fabricio Benevenuto, and Ponnurangam Kumaraguru. 2011b. Phi.sh/$oCiaL: The Phishing Landscape through Short URLs. In CEAS. ACM. http://www.barracudalabs.com/downloads/",
      "doi": ""
    },
    {
      "text": "Chromium. 2017. Chromium Project: IDN in Google Chrome. (2017). https://www.chromium.org/developers/ design-documents/idn-in-google-chrome Accessed 28 Aug, 2017.",
      "doi": ""
    },
    {
      "text": "Rachna Dhamija, J Doug Tygar, and Marti Hearst. 2006. Why phishing works. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 581--590.",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Brandon E. Gavett, Rui Zhao, Samantha E. John, Cara A. Bussell, Jennifer R. Roberts, and Chuan Yue. 2017. Phishing suspiciousness in older and younger adults: The role of executive functioning. PLOS ONE 12, 2 (feb 2017), e0171620. DOI: http://dx.doi.org/10.1371/journal.pone.0171620",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Jennifer Hill. 2007. Data Analysis Using Regression and Multilevel/Hierarchical Models. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Yu-Sung Su. 2018. arm: Data Analysis Using Regression and Multilevel/Hierarchical Models. https://CRAN.R-project.org/package=arm R package version 1.10--1.",
      "doi": ""
    },
    {
      "text": "Samuel Gibbs. 2017. Facebook and Google were conned out of $100m in phishing scheme | Technology | The Guardian. (2017). https://www.theguardian.com/technology/2017/apr/28/ facebook-google-conned-100m-phishing-scheme",
      "doi": ""
    },
    {
      "text": "Chris Grier, Kurt Thomas, Vern Paxson, and Michael Zhang. 2010. @spam: The Underground on 140 Characters or Less * General Terms. In Proceedings of the 17th ACM conference on Computer and communications security. ACM, 27--37. http://apiwiki.twitter.com/Twitter-API-Documentation",
      "doi": "10.1145/1866307.1866311"
    },
    {
      "text": "Neha Gupta, Anupama Aggarwal, and Ponnurangam Kumaraguru. 2014. bit.ly/malicious: Deep Dive into Short URL based e-Crime Detection. In eCrime Researchers Summit, eCrime, Vol. 2014-Janua. 14--24. DOI: http://dx.doi.org/10.1109/ECRIME.2014.6963161",
      "doi": ""
    },
    {
      "text": "Cormac Herley. 2009. So Long, And No Thanks for the Externalities: The rational rejection of security advice by users. In Proceedings of NSPW'09.",
      "doi": "10.1145/1719030.1719050"
    },
    {
      "text": "Jason Hong. 2012. The State of Phishing Attacks. Comm. ACM 55, 1 (Jan. 2012), 74--81. DOI: http://dx.doi.org/10.1145/2063176.2063197",
      "doi": "10.1145/2063176.2063197"
    },
    {
      "text": "Torsten Hothorn, Kurt Hornik, Mark van de Wiel, and Achim Zeileis. 2008. Implementing a class of permutation tests: The coin package. Journal of Statistical Software 28, 8 (2008), 1--23.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In Symposium On Usable Privacy and Security (SOUPS '14). 37--49.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru and Lorrie Faith Cranor. 2005. Privacy indexes: A survey of Westin's studies. Technical Report. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Steve Sheng, Alessandro Acquisti, Lorrie Faith Cranor, and Jason Hong. 2008. Lessons From a Real World Evaluation of Anti-Phishing Training. e-Crime Researchers Summit, Anti-Phishing Working Group (October 2008). http://precog.iiitd. edu.in/Publications_files/eCrime_APWG_08.pdf",
      "doi": ""
    },
    {
      "text": "Nhien-An Le-Khac and Tahar Kechadi. 2015. Security Threats of URL Shortening: A User's Perspective. Journal of Advances in Computer Networks 3, 3 (2015).",
      "doi": ""
    },
    {
      "text": "Eric Lin, Saul Greenberg, Eileah Trotter, David Ma, and John Aycock. 2011. Does Domain Highlighting Help People Identify Phishing Sites?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2075--2084. http://grouplab.cpsc. ucalgary.ca/grouplab/uploads/Publications/ Publications/2011-DomainHighlighting.CHI.pdf",
      "doi": "10.1145/1978942.1979244"
    },
    {
      "text": "Drew A. Linzer and Jeffrey B. Lewis. 2011. poLCA: An R Package for Polytomous Variable Latent Class Analysis. Journal of Statistical Software 42, 10 (2011), 1--29. http://www.jstatsoft.org/v42/i10/",
      "doi": ""
    },
    {
      "text": "Federico Maggi, Alessandro Frossi, Stefano Zanero, Gianluca Stringhini, Brett Stone-Gross, Christopher Kruegel, and Giovanni Vigna. 2013. Two Years of Short URLs Internet Measurement: Security Threats and Countermeasures. In Proceedings of the 22nd international conference on World Wide Web - WWW '13. 861--872. http://point.to/redir.html",
      "doi": "10.1145/2488388.2488463"
    },
    {
      "text": "Max-Emanuel Maurer and Lukas Höfer. 2012. Sophisticated Phishers Make More Spelling Mistakes: Using URL Similarity against Phishing.. In CSS. Springer, 414--426.",
      "doi": ""
    },
    {
      "text": "Nick Nikiforakis, Federico Maggi, Gianluca Stringhini, M. Zubair Rafique, Wouter Joosen, Christopher Kruegel, Frank Piessens, Giovanni Vigna, and Stefano Zanero. 2014. Stranger Danger: Exploring the Ecosystem of Ad-based URL Shortening Services. Proceedings of the 23rd international conference on World wide web WWW '14 (2014), 51--62. DOI: http://dx.doi.org/10.1145/2566486.2567983",
      "doi": "10.1145/2566486.2567983"
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153--163.",
      "doi": ""
    },
    {
      "text": "PhishLabs. 2018. 2018 Phishing Trends & Intelligence Rport: Hacking the Human. Technical Report. Ecrime Management Strategies, Inc.",
      "doi": ""
    },
    {
      "text": "Ponemon. 2018. Cost of Cyber Crime Study: Insights on the security investments that make a difference. Technical Report.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Amelia R Malone, and Michelle L Mazurek. 2016. I Think They're Trying to Tell Me Something: Advice Sources and Selection for Digital Security. In 2016 IEEE Symposium on Security and Privacy (SP). IEEE, 272--288. DOI: http://dx.doi.org/10.1109/SP.2016.24",
      "doi": ""
    },
    {
      "text": "R. Reeder, I. Ion, and S. Consolvo. 2017. 152 Simple Steps to Stay Safe Online: Security Advice for Non-tech-savvy Users. IEEE Security Privacy PP, 99 (2017), 1--1. DOI: http://dx.doi.org/10.1109/MSP.2017.265093101",
      "doi": "10.1109/MSP.2017.3681050"
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who Are the Crowdworkers?: Shifting Demographics in Mechanical Turk. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 2863--2872.",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Steve Sheng, Bryant Magnien, Ponnurangam Kumaraguru, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Anti-Phishing Phil: The Design and Evaluation of a Game That Teaches People Not to Fall for Phish. In Proceedings of the 3rd Symposium on Usable Privacy and Security (SOUPS '07). ACM, NY, NY, USA, 88--99. DOI: http://dx.doi.org/10.1145/1280680.1280692",
      "doi": "10.1145/1280680.1280692"
    },
    {
      "text": "The Federal Bureau of Investigation (FBI), Internet Crime Complaint Center. 2017. 2017 Internet Crime Report. Technical Report. https://pdf.ic3.gov/2017_IC3Report.pdf.",
      "doi": ""
    },
    {
      "text": "Yue Zhang, Serge Egelman, Lorrie Cranor, and Jason Hong. 2007. Phinding Phish: Evaluating Anti-Phishing Tools. (2007). http://lorrie.cranor.org/pubs/ndss-phish-tools-final.pdf",
      "doi": ""
    }
  ]
}