{
  "doi": "10.1145/3313831.3376505",
  "title": "Glissade: Generating Balance Shifting Feedback to Facilitate Auxiliary Digital Pen Input",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper introduces Glissade, a digital pen that generates balance shifting feedback by changing the weight distribution of the pen. A pulley system shifts a brass mass inside the pen to change the pen's center of mass and moment of inertia. When the mass is stationary, the pen delivers a constant yet natural sensation of weight, which can be used to convey a status. The pen can also generate a variety of haptic clues by actuating the mass according to the tilt or rotation of the pen, two commonly-used auxiliary pen input channels. Glissade demonstrates new possibilities that balance shifting feedback can bring to digital pen interactions. We validated the usability of this feedback by determining the recognizability of six balance patterns – a mix of static and dynamic patterns chosen based on our design considerations – in two controlled experiments. The results show that, on average, the participants could distinguish between the patterns with a 94.25% accuracy. At the end, we demonstrate a set of novel interactions enabled by Glissade and discuss the directions for future research.",
  "tags": [
    "digital pen",
    "balance shifting feedback",
    "sensation of weight",
    "haptics"
  ],
  "authors": [
    {
      "name": "Kai-Chieh Huang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529700",
      "orcid": "missing"
    },
    {
      "name": "Chen-Kuo Sun",
      "institution": "National Chiao Tung University & National Taiwan University, Hsinchu & Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314707",
      "orcid": "missing"
    },
    {
      "name": "Da-Yuan Huang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/do/10.1145/contrib-81551198756/rel-imgonly/81551198756.jpg",
      "acmid": "81551198756",
      "orcid": "missing"
    },
    {
      "name": "Yu-Chun Chen",
      "institution": "National Chiao Tung University & National Taiwan University, Hsinchu & Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528264",
      "orcid": "0000-0002-9484-986X"
    },
    {
      "name": "Ruei-Che Chang",
      "institution": "National Chiao Tung University, HsinChu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475234",
      "orcid": "0000-0001-7545-4136"
    },
    {
      "name": "Shuo-wen Hsu",
      "institution": "National Chiao Tung University, Hsin-chu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473888",
      "orcid": "missing"
    },
    {
      "name": "Chih-Yun Yang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659512697",
      "orcid": "missing"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    }
  ],
  "references": [
    {
      "text": "Atakan Arasan, Cagatay Basdogan, and Tevfik Metin Sezgin. 2013. Haptic stylus with inertial and vibro-tactile feedback. In World Haptics Conference (WHC), 2013. IEEE, 425--430.",
      "doi": ""
    },
    {
      "text": "Xiaojun Bi, Tomer Moscovich, Gonzalo Ramos, Ravin Balakrishnan, and Ken Hinckley. 2008. An Exploration of Pen Rolling for Pen-based Interaction. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 191--200. DOI: http://dx.doi.org/10.1145/1449715.1449745",
      "doi": "10.1145/1449715.1449745"
    },
    {
      "text": "Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D Input Using Two Magnetic Sensors. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 237--244. DOI: http://dx.doi.org/10.1145/2501988.2502035",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Youngjun Cho, Andrea Bianchi, Nicolai Marquardt, and Nadia Bianchi-Berthouze. 2016. RealPen: Providing Realism in Handwriting Tasks on Touch Surfaces Using Auditory-Tactile Feedback. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 195--205. DOI: http://dx.doi.org/10.1145/2984511.2984550",
      "doi": "10.1145/2984511.2984550"
    },
    {
      "text": "Heather Culbertson, Juliette Unwin, Benjamin E Goodman, and Katherine J Kuchenbecker. 2013. Generating haptic texture models from unconstrained tool-surface interactions. In 2013 World Haptics Conference (WHC). IEEE, 295--300.",
      "doi": ""
    },
    {
      "text": "Ravindra S Goonetilleke, Errol R Hoffmann, and Ameersing Luximon. 2009. Effects of pen design on drawing and writing performance. Applied ergonomics 40, 2 (2009), 292--301.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, Ken Hinckley, Patrick Baudisch, Maneesh Agrawala, and Ravin Balakrishnan. 2006. Hover Widgets: Using the Tracking State to Extend the Capabilities of Pen-operated Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 861--870. DOI: http://dx.doi.org/10.1145/1124772.1124898",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Jaehyun Han, Seongkook Heo, Hyong-Euk Lee, and Geehyuk Lee. 2014. The irpen: A 6-dof pen for interaction with tablet computers. IEEE Computer Graphics and Applications 34, 3 (2014), 22--29.",
      "doi": ""
    },
    {
      "text": "Khalad Hasan, Xing-Dong Yang, Andrea Bunt, and Pourang Irani. 2012. A-coord Input: Coordinating Auxiliary Input Streams for Augmenting Contextual Pen-based Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 805--814. DOI: http://dx.doi.org/10.1145/2207676.2208519",
      "doi": "10.1145/2207676.2208519"
    },
    {
      "text": "Fabian Hemmert, Susann Hamann, Matthias Löwe, Josefine Zeipelt, and Gesche Joost. 2010a. Weight-shifting Mobiles: Automatic Balancing in Mobile Phones. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 3081--3086. DOI: http://dx.doi.org/10.1145/1753846.1753921",
      "doi": ""
    },
    {
      "text": "Fabian Hemmert, Susann Hamann, Matthias Löwe, Josefine Zeipelt, and Gesche Joost. 2010b. Weight-shifting Mobiles: Two-dimensional Gravitational Displays in Mobile Phones. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 3087--3092. DOI: http://dx.doi.org/10.1145/1753846.1753922",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Xiang 'Anthony' Chen, and Hrvoje Benko. 2013. Motion and Context Sensing Techniques for Pen Computing. In Proceedings of Graphics Interface 2013 (GI '13). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 71--78. http://dl.acm.org/citation.cfm?id=2532129.2532143",
      "doi": "10.5555/2532129.2532143"
    },
    {
      "text": "Masaharu Hirose, Karin Iwazaki, Kozue Nojiri, Minato Takeda, Yuta Sugiura, and Masahiko Inami. 2015. Gravitamine Spice: A System That Changes the Perception of Eating Through Virtual Weight Sensation. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, NY, NY, USA, 33--40. DOI: http://dx.doi.org/10.1145/2735711.2735795",
      "doi": "10.1145/2735711.2735795"
    },
    {
      "text": "Sho Kamuro, Kouta Minamizawa, Naoki Kawakami, and Susumu Tachi. 2009. Pen de touch. In ACM SIGGRAPH 2009 Emerging Technologies. ACM, 17.",
      "doi": "10.1145/1597956.1597973"
    },
    {
      "text": "Katherine J. Kuchenbecker. 2008. Haptography: Capturing the Feel of Real Objects to Enable Authentic Haptic Rendering. In Proceedings of the 2008 Ambi-Sys Workshop on Haptic User Interfaces in Ambient Media Systems (HAS '08). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, Article 3, 3 pages. http://dl.acm.org/citation.cfm?id=1413907.1413910",
      "doi": ""
    },
    {
      "text": "Ki-Uk Kyung and Jun-Young Lee. 2008. wUbi-Pen: Windows Graphical User Interface Interacting with Haptic Feedback Stylus. In ACM SIGGRAPH 2008 New Tech Demos (SIGGRAPH '08). ACM, NY, NY, USA, Article 42, 4 pages. DOI: http://dx.doi.org/10.1145/1401615.1401657",
      "doi": "10.1145/1401615.1401657"
    },
    {
      "text": "Ki-Uk Kyung and Jun-Young Lee. 2009. Ubi-Pen: A haptic interface with texture and vibrotactile display. IEEE Computer Graphics and Applications 29, 1 (2009), 56--64.",
      "doi": "10.5555/1669271.1669278"
    },
    {
      "text": "Ki-Uk Kyung, Jun-Young Lee, and Junseok Park. 2008. Haptic stylus and empirical studies on braille, button, and texture display. BioMed Research International 2008 (2008).",
      "doi": ""
    },
    {
      "text": "Ki-Uk Kyung, Jun-Young Lee, and Mandayam A Srinivasan. 2009. Precise manipulation of GUI on a touch screen with haptic cues. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 202--207.",
      "doi": "10.1109/WHC.2009.4810865"
    },
    {
      "text": "Johnny C. Lee, Paul H. Dietz, Darren Leigh, William S. Yerazunis, and Scott E. Hudson. 2004. Haptic Pen: A Tactile Feedback Stylus for Touch Screens. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 291--294. DOI: http://dx.doi.org/10.1145/1029632.1029682",
      "doi": ""
    },
    {
      "text": "Yang Li, Ken Hinckley, Zhiwei Guan, and James A. Landay. 2005. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 461--470. DOI: http://dx.doi.org/10.1145/1054972.1055036",
      "doi": ""
    },
    {
      "text": "Chunyuan Liao, François Guimbretière, and Corinna E. Loeckenhoff. 2006. Pen-top Feedback for Paper-based Interfaces. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 201--210. DOI: http://dx.doi.org/10.1145/1166253.1166285",
      "doi": ""
    },
    {
      "text": "Motoki Miura and Susumu Kunifuji. 2006. RodDirect: Two-dimensional Input with Stylus Knob. In Proceedings of the 8th Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/1152215.1152240",
      "doi": "10.1145/1152215.1152240"
    },
    {
      "text": "Su-Min Park, Kwangyong Lee, and Ki-Uk Kyung. 2011. A new stylus for touchscreen devices. In 2011 IEEE International Conference on Consumer Electronics (ICCE). IEEE, 491--492.",
      "doi": ""
    },
    {
      "text": "Zhan Fan Quek, Samuel B Schorr, Ilana Nisky, Allison M Okamura, and William R Provancher. 2014. Augmentation of stiffness perception with a 1-degree-of-freedom skin stretch device. IEEE Transactions on Human-Machine Systems 44, 6 (2014), 731--742.",
      "doi": ""
    },
    {
      "text": "Zhan Fan Quek, Samuel B Schorr, Ilana Nisky, William R Provancher, and Allison M Okamura. 2015. Sensory substitution and augmentation using 3-degree-of-freedom skin deformation feedback. IEEE transactions on haptics 8, 2 (2015), 209--221.",
      "doi": "10.1109/TOH.2015.2398448"
    },
    {
      "text": "Gonzalo A. Ramos and Ravin Balakrishnan. 2007. Pressure Marks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1375--1384. DOI: http://dx.doi.org/10.1145/1240624.1240834",
      "doi": ""
    },
    {
      "text": "Matthias Rath and Michael Rohs. 2006. Explorations in Sound for Tilting-based Interfaces. In Proceedings of the 8th International Conference on Multimodal Interfaces (ICMI '06). ACM, NY, NY, USA, 295--301. DOI: http://dx.doi.org/10.1145/1180995.1181052",
      "doi": "10.1145/1180995.1181052"
    },
    {
      "text": "Xiangshi Ren, Jibin Yin, Shengdong Zhao, and Yang Li. 2007. The adaptive hybrid cursor: A pressure-based target selection technique for pen-based user interfaces. In IFIP Conference on Human-Computer Interaction. Springer, 310--323.",
      "doi": ""
    },
    {
      "text": "Joseph M. Romano and Katherine J. Kuchenbecker. 2009. The AirWand: Design and Characterization of a Large-workspace Haptic Device. In Proceedings of the 2009 IEEE International Conference on Robotics and Automation (ICRA'09). IEEE Press, Piscataway, NJ, USA, 1010--1015. http://dl.acm.org/citation.cfm?id=1703435.1703599",
      "doi": ""
    },
    {
      "text": "Joseph M Romano and Katherine J Kuchenbecker. 2012. Creating realistic virtual textures from contact acceleration data. IEEE Transactions on Haptics 5, 2 (2012), 109--119.",
      "doi": "10.1109/TOH.2011.38"
    },
    {
      "text": "Shahabedin Sagheb, Alireza Bahremand, Robert LiKamWa, and Byron Lahey. 2019. SWISH: Shifting Weight-based Interfaces for Simulated Hydrodynamics in Mixed-Reality Fluid Vessels. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 213--221. DOI: http://dx.doi.org/10.1145/3294109.3300988",
      "doi": "10.1145/3294109.3300988"
    },
    {
      "text": "Kang Shi, Pourang Irani, Sean Gustafson, and Sriram Subramanian. 2008. PressureFish: A Method to Improve Control of Discrete Pressure-based Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1295--1298. DOI: http://dx.doi.org/10.1145/1357054.1357256",
      "doi": "10.1145/1357054.1357256"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Taiju Aoki, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2018. Transcalibur: Dynamic 2D Haptic Shape Illusion of Virtual Object by Weight Moving VR Controller. In ACM SIGGRAPH 2018 Posters (SIGGRAPH '18). ACM, NY, NY, USA, Article 29, 2 pages. DOI: http://dx.doi.org/10.1145/3230744.3230804",
      "doi": "10.1145/3230744.3230804"
    },
    {
      "text": "J Ridley Stroop. 1935. Studies of interference in serial verbal reactions. Journal of experimental psychology 18, 6 (1935), 643.",
      "doi": ""
    },
    {
      "text": "Sriram Subramanian, Dzimitry Aliakseyeu, and Andrés Lucero. 2006. Multi-layer Interaction for Digital Tables. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 269--272. DOI: http://dx.doi.org/10.1145/1166253.1166295",
      "doi": "10.1145/1166253.1166295"
    },
    {
      "text": "Yu Suzuki, Kazuo Misue, and Jiro Tanaka. 2007. Stylus enhancement to enrich interaction with computers. In International Conference on Human-Computer Interaction. Springer, 133--142.",
      "doi": ""
    },
    {
      "text": "Colin Swindells, Alex Unden, and Tao Sang. 2003. TorqueBAR: An Ungrounded Haptic Feedback Device. In Proceedings of the 5th International Conference on Multimodal Interfaces (ICMI '03). ACM, NY, NY, USA, 52--59. DOI: http://dx.doi.org/10.1145/958432.958445",
      "doi": "10.1145/958432.958445"
    },
    {
      "text": "Feng Tian, Xiang Ao, Hongan Wang, Vidya Setlur, and Guozhong Dai. 2007. The tilt cursor: enhancing stimulus-response compatibility by providing 3d orientation cue of pen. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 303--306.",
      "doi": "10.1145/1240624.1240675"
    },
    {
      "text": "Feng Tian, Lishuang Xu, Hongan Wang, Xiaolong Zhang, Yuanyuan Liu, Vidya Setlur, and Guozhong Dai. 2008. Tilt Menu: Using the 3D Orientation Information of Pen Devices to Extend the Selection Capability of Pen-based User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1371--1380. DOI: http://dx.doi.org/10.1145/1357054.1357269",
      "doi": "10.1145/1357054.1357269"
    },
    {
      "text": "Qinglong Wang, Xiangshi Ren, Sayan Sarcar, and Xiaoying Sun. 2016. EV-Pen: Leveraging Electrovibration Haptic Feedback in Pen Interaction. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 57--66. DOI: http://dx.doi.org/10.1145/2992154.2992161",
      "doi": "10.1145/2992154.2992161"
    },
    {
      "text": "Qinglong Wang, Xiangshi Ren, and Xiaoying Sun. 2017. Enhancing Pen-based Interaction Using Electrovibration and Vibration Haptic Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3746--3750. DOI: http://dx.doi.org/10.1145/3025453.3025555",
      "doi": "10.1145/3025453.3025555"
    },
    {
      "text": "Anusha Withana, Makoto Kondo, Yasutoshi Makino, Gota Kakehi, Maki Sugimoto, and Masahiko Inami. 2010. ImpAct: Immersive Haptic Stylus to Enable Direct Touch and Manipulation for Surface Computing. Comput. Entertain. 8, 2, Article 9 (Dec. 2010), 16 pages. DOI: http://dx.doi.org/10.1145/1899687.1899691",
      "doi": ""
    },
    {
      "text": "Fong-Gong Wu and Shuyi Luo. 2006. Performance study on touch-pens size in three screen tasks. Applied Ergonomics 37, 2 (2006), 149--158.",
      "doi": ""
    },
    {
      "text": "Yizhong Xin, Xiaojun Bi, and Xiangshi Ren. 2011. Acquiring and Pointing: An Empirical Study of Pen-tilt-based Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 849--858. DOI: http://dx.doi.org/10.1145/1978942.1979066",
      "doi": "10.1145/1978942.1979066"
    },
    {
      "text": "Andre Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (2017), 1285--1294.",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}