{
  "doi": "10.1145/3313831.3376587",
  "title": "Attenuated Access: Accounting for Startup, Maintenance, and Affective Costs in Resource-Constrained Communities",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "The term \"digital divide\" indexes a body of research at the intersection of digital technology and social equity, including research on inequality that criticizes and recapitulates the original concept. Based on a qualitative study at a community literacy center serving resettled refugees and immigrants, we show that the digital divide framework rests on a distributive logic, one that implies that distributing access to digital technology constitutes a form of social equity. Because this framework only considers valorized goods, skills, and uses, research has frequently ignored the startup, maintenance, and affective costs we found accompanied digital access for our participants. To account for these costs, we propose a theoretical adjustment to the digital divide framework, one where design is an act of configuring both costs and benefits together. We argue that considering such costs enables HCI researchers to engage more effectively with host communities in the non-innocent work of confronting inequity.",
  "tags": [
    "social justice",
    "equity",
    "immigrants and resettled refugees",
    "digital divide",
    "digital access"
  ],
  "authors": [
    {
      "name": "Lucy Pei",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365312",
      "orcid": "missing"
    },
    {
      "name": "Roderic Crooks",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658949854",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Khorshed Alam and Sophia Imran. 2015. The digital divide and social inclusion among refugee migrants: A case in regional Australia. Information Technology & People 28, 2 (June 2015), 344--365. DOI: http://dx.doi.org/10.1108/ITP-04--2014-0083 2019-08-09.",
      "doi": ""
    },
    {
      "text": "Arvind Ashok and Christian Beck. 2007. Using activity theory to develop a design framework for rural development. In CHI '07 extended abstracts on Human factors in computing systems - CHI '07. ACM Press, San Jose, CA, USA, 2255. DOI: http://dx.doi.org/10.1145/1240866.1240990 2019-07--11.",
      "doi": ""
    },
    {
      "text": "Jennifer Baranoff, R. Israel Gonzales, Jay Liu, Heidi Yang, and Jimin Zheng. 2015. Lantern: Empowering refugees through community-generated guidance using near feld communication. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 7--12. 2019-07--18.",
      "doi": "10.1145/2702613.2726950"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, Atlanta, Georgia, USA, 1301. DOI: http://dx.doi.org/10.1145/1753326.1753521 2019-09-09.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Luis Fernando Baron, Moriah Neils, and Ricardo Gomez. 2014. Crossing new borders: computers, mobile phones, transportation, and English language among Hispanic day laborers in Seattle, Washington. Journal of the Association for Information Science and Technology 65, 1 (Jan. 2014), 98--108. DOI: http://dx.doi.org/10.1002/asi.22949",
      "doi": "10.1002/asi.22949"
    },
    {
      "text": "Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, leaving, and (re)lapsing: an exploration of facebook non-use practices and experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, Paris, France, 3257. DOI: http://dx.doi.org/10.1145/2470654.2466446 2019-08--28.",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Eric P.S. Baumer, Morgan G. Ames, Jenna Burrell, Jed R. Brubaker, and Paul Dourish. 2015. Why study technology non-use? First Monday 20, 11 (Nov. 2015). DOI: http://dx.doi.org/10.5210/fm.v20i11.6310",
      "doi": ""
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and \"democratizing innovation\". In Proceedings of the 11th Biennial Participatory Design Conference on - PDC '10. ACM Press, Sydney, Australia, 41. DOI: http://dx.doi.org/10.1145/1900441.1900448",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Caitlin G. Bletscher. 2019. Communication Technology and Social Integration: Access and Use of Communication Technologies Among Floridian Resettled Refugees. Journal of International Migration and Integration (March 2019). DOI: http://dx.doi.org/10.1007/s12134-019-00661--4",
      "doi": ""
    },
    {
      "text": "Nadine Bol, Tobias Dienlin, Sanne Kruikemeier, Marijn Sax, Sophie C Boerman, Joanna Strycharz, Natali Helberger, and Claes H de Vreese. 2018. Understanding the Effects of Personalization as a Privacy Calculus: Analyzing Self-Disclosure Across Health, News, and Commerce Contexts. Journal of Computer-Mediated Communication 23, 6 (Nov. 2018), 370--388. DOI: http://dx.doi.org/10.1093/jcmc/zmy020",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2009. The Field Site as a Network: A Strategy for Locating Ethnographic Research. Field Methods 21, 2 (May 2009), 181--199. DOI: http://dx.doi.org/10.1177/1525822X08329699",
      "doi": ""
    },
    {
      "text": "Jenna Burrell and Ken Anderson. 2008. \"I have great desires to look beyond my world': trajectories of information and communication technology use among Ghanaians living abroad. New Media & Society 10, 2 (April 2008), 203--224. DOI: http://dx.doi.org/10.1177/1461444807086472",
      "doi": ""
    },
    {
      "text": "Aditya Chand and Anind K. Dey. 2006. Jadoo: a paper user interface for users unfamiliar with computers. In CHI '06 extended abstracts on Human factors in computing systems - CHI EA '06. ACM Press, Montreal, Quebec, Canada, 1625. DOI: http://dx.doi.org/10.1145/1125451.1125747 2019-07--15.",
      "doi": ""
    },
    {
      "text": "Alexander Cho, Roxana Herrera, Luis Chaidez, and Adilene Uriostegui. 2019. The \"Comadre\" Project: An Asset-Based Design Approach to Connecting Low-Income Latinx Families to Out-of-School Learning Opportunities. In 2019 CHI Conference on Human Factors in Computing Systems Proceedings. ACM, Glasgow, Scotland, UK, 14. 2019-03--18.",
      "doi": "10.1145/3290605.3300837"
    },
    {
      "text": "Lizzie Coles-Kemp and Rikke Bjerg Jensen. 2019. Accessing a New Land: Designing for a Social Conceptualisation of Access. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, Glasgow, Scotland Uk, 1--12. DOI: http://dx.doi.org/10.1145/3290605.3300411 2019-08-05.",
      "doi": "10.1145/3290605.3300411"
    },
    {
      "text": "Lizzie Coles-Kemp, Rikke Bjerg Jensen, and Reem Talhouk. 2018. In a New Land: Mobile Phones, Amplifed Pressures and Reduced Capabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, Montreal QC, Canada, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3174158 2019-04-09.",
      "doi": "10.1145/3173574.3174158"
    },
    {
      "text": "Benjamin M. Compaine (Ed.). 2001. The digital divide: facing a crisis or creating a myth? MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Roderic N. Crooks. 2019. Times Thirty: Access, Maintenance, and Justice. Science, Technology, & Human Values 44, 1 (Jan. 2019), 118--142. DOI: http://dx.doi.org/10.1177/0162243918783053 2018--12--17.",
      "doi": ""
    },
    {
      "text": "Débora de Castro Leal, Max Krüger, Kaoru Misaki, David Randall, and Volker Wulf. 2019. Guerilla Warfare and the Use of New (and Some Old) Technology: Lessons from FARC's Armed Struggle in Colombia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, Glasgow, Scotland Uk, 1--12. DOI: http://dx.doi.org/10.1145/3290605.3300810",
      "doi": "10.1145/3290605.3300810"
    },
    {
      "text": "Paul Dimaggio, Eszter Hargittai, Coral Celeste, and Steven Shafer. 2004. Digital inequality: From unequal access to differentiated use. Social Inequality (2004), 355--400.",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16. ACM Press, Brisbane, QLD, Australia, 656--671. DOI: http://dx.doi.org/10.1145/2901790.2901861 2019-09-04.",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Lynn Dombrowski, Amy Voida, Gillian R. Hayes, and Melissa Mazmanian. 2012. The labor practices of service mediation: a study of the work practices of food assistance outreach. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press, Austin, Texas, USA, 1977. DOI: http://dx.doi.org/10.1145/2207676.2208342 2019-03--21.",
      "doi": "10.1145/2207676.2208342"
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (April 2018), 66--69. DOI: http://dx.doi.org/10.1145/3194349 2019-09--14.",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Karen E. Fisher, Ann Peterson Bishop, Lassana Magassa, and Phil Fawcett. 2014. Action!: codesigning interactive technology with immigrant teens. In Proceedings of the 2014 conference on Interaction design and children - IDC '14. ACM Press, Aarhus, Denmark, 345--348. DOI: http://dx.doi.org/10.1145/2593968.2610488",
      "doi": "10.1145/2593968.2610488"
    },
    {
      "text": "S. M. Gifford and R. Wilding. 2013. Digital Escapes? ICTs, Settlement and Belonging among Karen Youth in Melbourne, Australia. Journal of Refugee Studies 26, 4 (Dec. 2013), 558--575. DOI: http://dx.doi.org/10.1093/jrs/fet020",
      "doi": ""
    },
    {
      "text": "Eric Gilbert, Karrie Karahalios, and Christian Sandvig. 2008. The network in the garden: an empirical analysis of social media in rural life. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08. ACM Press, Florence, Italy, 1603. DOI: http://dx.doi.org/10.1145/1357054.1357304 2019-05--29.",
      "doi": ""
    },
    {
      "text": "Ricardo Gomez, Ivette Bayo, Philip Reed, Cherry Cong Wang, and Marisol Silva. 2013a. Fearless Cards: A Low-Tech Solution to Help Overcome Emotional Barriers to ICT Adoption Among Marginalized Populations. The Electronic Journal of Information Systems in Developing Countries 56, 1 (April 2013), 1--15. DOI: http://dx.doi.org/10.1002/j.1681--4835.2013.tb00397.x",
      "doi": ""
    },
    {
      "text": "Ricardo Gomez, Ivette Bayo, Philip J. Reed, Cong Wang, and Marisol Silva. 2013b. Fearless cards: addressing emotional barriers to computer learning among extremely marginalized populations. In CHI '13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA '13. ACM Press, Paris, France, 631. DOI: http://dx.doi.org/10.1145/2468356.2468468",
      "doi": "10.1145/2468356.2468468"
    },
    {
      "text": "Amy Gonzales. 2017. Technology Maintenance: A New Frame for Studying Poverty and Marginalization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, Denver, Colorado, USA, 289--294. DOI: http://dx.doi.org/10.1145/3025453.3025475 2019-04--23.",
      "doi": "10.1145/3025453.3025475"
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H. Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a Low Profle?: Technology, Risk and Privacy among Undocumented Immigrants. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, Montreal QC, Canada, 1--15. DOI: http://dx.doi.org/10.1145/3173574.3173688 2019-02--24.",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. 2016. Staying with the trouble: making kin in the Chthulucene. Duke University Press, Durham. 2019-08--27.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai. 2002. Second-Level Digital Divide: Differences in People's Online Skills. First Monday 7, 4 (April 2002). DOI: http://dx.doi.org/10.5210/fm.v7i4.942",
      "doi": ""
    },
    {
      "text": "Serena Hillman, Alexandra Hillman, Carman Neustaedter, and Carolyn Pang. 2019. \"I Have a Life\": Teacher Communication & Management Outside the Classroom. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems CHI EA '19. ACM Press, Glasgow, Scotland Uk, 1--6. DOI: http://dx.doi.org/10.1145/3290607.3312943",
      "doi": "10.1145/3290607.3312943"
    },
    {
      "text": "Juan Pablo Hourcade, Daiana Beitler, Fernando Cormenzana, and Pablo Flores. 2008. Early olpc experiences in a rural uruguayan school. In Proceeding of the twenty-sixth annual CHI conference extended abstracts on Human factors in computing systems - CHI '08. ACM Press, Florence, Italy, 2503. DOI: http://dx.doi.org/10.1145/1358628.1358707 2019-06-02.",
      "doi": ""
    },
    {
      "text": "Joey Chiao-Yin Hsiao and Tawanna R. Dillahunt. 2018. Technology to Support Immigrant Access to Social Capital and Adaptation to a New Country. In Proceedings of the ACM on Human- Computer Interaction, Vol. 2. 21. 2019-07--18.",
      "doi": ""
    },
    {
      "text": "Azalea Irani, Kriti Nelavelli, Kristin Hare, Paula Bondal, and Neha Kumar. 2018. Refuge Tech: An Assets-Based Approach to Refugee Resettlement. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW554. 2018--10--25.",
      "doi": "10.1145/3170427.3188680"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, Atlanta, Georgia, USA, 1311. DOI: http://dx.doi.org/10.1145/1753326.1753522 2018--11--11.",
      "doi": ""
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2019. Empowerment on the Margins: The Online Experiences of Community Health Workers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems CHI '19. ACM Press, Glasgow, Scotland Uk, 1--15. DOI: http://dx.doi.org/10.1145/3290605.3300329 2019-08--28.",
      "doi": "10.1145/3290605.3300329"
    },
    {
      "text": "Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2011. Things fall apart: maintenance, repair, and technology for education initiatives in rural Namibia. In Proceedings of the 2011 iConference on - iConference '11. ACM Press, Seattle, Washington, 83--90. DOI: http://dx.doi.org/10.1145/1940761.1940773 2018--11--2.",
      "doi": "10.1145/1940761.1940773"
    },
    {
      "text": "Anirudha Joshi, Ashish Ganu, Aditya Chand, Vikram Parmar, and Gaurav Mathur. 2004. Keylekh: a keyboard for text entry in indic scripts. In Extended abstracts of the 2004 conference on Human factors and computing systems - CHI '04. ACM Press, Vienna, Austria, 928. DOI: http://dx.doi.org/10.1145/985921.985950",
      "doi": ""
    },
    {
      "text": "Matthew Kam, Akhil Mathur, Anuj Kumar, and John Canny. 2009. Designing digital games for rural children: a study of traditional village games in India. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, Boston, MA, USA, 31. DOI: http://dx.doi.org/10.1145/1518701.1518707 2019-05--27.",
      "doi": "10.1145/1518701.1518707"
    },
    {
      "text": "Matthew Kam, Divya Ramachandran, Varun Devanathan, Anuj Tewari, and John Canny. 2007. Localized iterative design for language learning in underdeveloped regions: the PACE framework. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, San Jose, California, USA, 1097. DOI: http://dx.doi.org/10.1145/1240624.1240791 2019--7--11.",
      "doi": "10.1145/1240624.1240791"
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory Design: Issues and Concerns. Computer Supported Cooperative Work (CSCW) 7, 3 (Sept. 1998), 167--185. https://doi.org/10.1023/A:1008689307411 2018--11--30.",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Kai Lukoff, Cissy Yu, Julie Kientz, and Alexis Hiniker. 2018. What Makes Smartphone Use Meaningful or Meaningless? Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (March 2018), 1--26. DOI: http://dx.doi.org/10.1145/3191754 2019-07--11.",
      "doi": "10.1145/3191754"
    },
    {
      "text": "Gloria Mark, Mary Czerwinski, and Shamsi T. Iqbal. 2018. Effects of Individual Differences in Blocking Workplace Distractions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems CHI '18. ACM Press, Montreal QC, Canada, 1--12. DOI: http://dx.doi.org/10.1145/3173574.3173666",
      "doi": ""
    },
    {
      "text": "Gary Marsden, Robert Cherry, and Alan Haefele. 2002. Small screen access to digital libraries. In CHI '02 extended abstracts on Human factors in computing systems - CHI '02. ACM Press, Minneapolis, Minnesota, USA, 786. DOI: http://dx.doi.org/10.1145/506443.506597",
      "doi": ""
    },
    {
      "text": "Michelle Murphy. 2015. Unsettling care: Troubling transnational itineraries of care in feminist health practices. Social Studies of Science 45, 5 (Oct. 2015), 717--737. DOI: http://dx.doi.org/10.1177/0306312715589136",
      "doi": ""
    },
    {
      "text": "Joseph Nesbitt and AnnMarie Thomas. 2010. Bridging the digital divide one tweet at a time: twitter-enabled devices for family communication. In Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA '10. ACM Press, Atlanta, Georgia, USA, 3949. DOI: http://dx.doi.org/10.1145/1753846.1754084 2019-05--27.",
      "doi": "10.1145/1753846.1754084"
    },
    {
      "text": "Bryce Clayton Newell, Ricardo Gomez, and Verónica E. Guajardo. 2016. Information seeking, technology use, and vulnerability among migrants at the United States Mexico border. The Information Society 32, 3 (May 2016), 176--191. DOI: http://dx.doi.org/10.1080/01972243.2016.1153013",
      "doi": "10.1080/01972243.2016.1153013"
    },
    {
      "text": "Chris Norval, John L. Arnott, and Vicki L. Hanson. 2014. What's on your mind?: investigating recommendations for inclusive social networking and older adults. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, Toronto, Ontario, Canada, 3923--3932. DOI: http://dx.doi.org/10.1145/2556288.2556992 2019-04--23.",
      "doi": ""
    },
    {
      "text": "United States Department of Commerce National Telecommunications and Information Administration. 1995. FALLING THROUGH THE NET: A Survey of the \"Have Nots\" in Rural and Urban America. (1995). https://www.ntia.doc.gov/ntiahome/fallingthru.html",
      "doi": ""
    },
    {
      "text": "Judith S. Olson and Wendy Kellogg (Eds.). 2014. Ways of knowing in HCI. Springer, New York. OCLC: ocn879418401.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2017. CHI4Good or Good4CHI. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems CHI EA '17. ACM Press, Denver, Colorado, USA, 709--721. DOI: http://dx.doi.org/10.1145/3027063.3052766 2019-04--15.",
      "doi": "10.1145/3027063.3052766"
    },
    {
      "text": "Anastasia N. Panagakos and Heather A. Horst. 2006. Return to Cyberia: technology and the social worlds of transnational migrants. Global Networks 6, 2 (April 2006), 109--124. DOI: http://dx.doi.org/10.1111/j.1471-0374.2006.00136.x",
      "doi": ""
    },
    {
      "text": "Lucy Pei and Bonnie Nardi. 2019. We Did It Right, But It Was Still Wrong: Toward Assets-Based Design. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA '19. ACM Press, Glasgow, Scotland Uk, 1--11. DOI: http://dx.doi.org/10.1145/3290607.3310434",
      "doi": "10.1145/3290607.3310434"
    },
    {
      "text": "Ann Peterson Bishop and Karen E. Fisher. 2015. Using ICT design to learn about immigrant teens from Myanmar. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development - ICTD '15. ACM Press, Singapore, Singapore, 1--4. DOI: http://dx.doi.org/10.1145/2737856.2737903",
      "doi": ""
    },
    {
      "text": "James Pierce. 2012. Undesigning technology: considering the negation of design by design. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press, Austin, Texas, USA, 957. DOI: http://dx.doi.org/10.1145/2207676.2208540",
      "doi": "10.1145/2207676.2208540"
    },
    {
      "text": "Divya Ramachandran, Matthew Kam, Jane Chiu, John Canny, and James F. Frankel. 2007. Social dynamics of early stage co-design in developing regions. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, San Jose, California, USA, 1087. DOI: http://dx.doi.org/10.1145/1240624.1240790 2019-06-02.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2017. Where is the Digital Divide?: A Survey of Security, Privacy, and Socioeconomics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, Denver, Colorado, USA, 931--936. DOI: http://dx.doi.org/10.1145/3025453.3025673 2019-04--23.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. OCLC: 953858633.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan. 2019. The remarkable illusions of technology for social good. Interactions 26, 3 (April 2019), 64--66. DOI: http://dx.doi.org/10.1145/3319378 2019-09-08.",
      "doi": "10.1145/3319378"
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, Atlanta, Georgia, USA, 2583. DOI: http://dx.doi.org/10.1145/1753326.1753718 2019-03--25.",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Sayan Sarcar, Cosmin Munteanu, Jussi Jokinen, Antti Oulasvirta, Neil Charness, Mark Dunlop, and Xiangshi Ren. 2018. Designing Interactions for the Ageing Populations. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems CHI '18. ACM Press, Montreal QC, Canada, 1--5. DOI: http://dx.doi.org/10.1145/3170427.3170607",
      "doi": ""
    },
    {
      "text": "Sayan Sarcar, Cosmin Munteanu, Jussi P. P. Jokinen, Antti Oulasvirta, Chaklam Silpasuwanchai, Neil Charness, Mark Dunlop, and Xiangshi Ren. 2017. Designing Mobile Interactions for the Ageing Populations. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM Press, Denver, Colorado, USA, 506--509. DOI: http://dx.doi.org/10.1145/3027063.3027074 2019-04--26.",
      "doi": "10.1145/3027063.3027074"
    },
    {
      "text": "Ben Shneiderman. 2001. Design: CUU: bridging the digital divide with universal usability. interactions 8, 2 (March 2001), 11--15. DOI: http://dx.doi.org/10.1145/361897.361905 2019-04--27.",
      "doi": ""
    },
    {
      "text": "Deepesh Das Shrestha. 2015. Resettlement of Bhutanese refugees surpasses 100,000 mark. (Nov. 2015). https://www.unhcr.org/news/latest/2015/11/564dded46/ resettlement-bhutanese-refugees-surpasses-100000-mark. html",
      "doi": ""
    },
    {
      "text": "Geeta Shroff and Matthew Kam. 2011. Towards a design model for women's empowerment in the developing world. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11. ACM Press, Vancouver, BC, Canada, 2867. DOI: http://dx.doi.org/10.1145/1978942.1979368 2019-05--26.",
      "doi": "10.1145/1978942.1979368"
    },
    {
      "text": "Christo Sims. 2013. Is it time to rethink 'digital inequality' (again)? AoIR Selected Papers of Internet Research 3, 0 (2013). https://firstmonday.org/ojs/ index.php/spir/article/view/8693",
      "doi": ""
    },
    {
      "text": "Christo Sims. 2014. From differentiated use to differentiating practices: negotiating legitimate participation and the production of privileged identities. Information, Communication & Society 17, 6 (July 2014), 670--682. DOI: http://dx.doi.org/10.1080/1369118X.2013.808363 2019-09-01.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman and Libby Bishop. 2000. Problematizing 'Innovation' as a Critical Project. Technology Analysis & Strategic Management 12, 3 (Sept. 2000), 327--333. DOI: http://dx.doi.org/10.1080/713698477 2018--11--17.",
      "doi": ""
    },
    {
      "text": "Emeline Therias, Jon Bird, and Paul Marshall. 2015. Más Tecnologia, Más Cambio?: Investigating an Educational Technology Project in Rural Peru. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, Seoul, Republic of Korea, 447--456. DOI: http://dx.doi.org/10.1145/2702123.2702595 2019-04--30.",
      "doi": "10.1145/2702123.2702595"
    },
    {
      "text": "Kentaro Toyama. 2011. Technology as amplifer in international development. In Proceedings of the 2011 iConference on - iConference '11. ACM Press, Seattle, Washington, 75--82. DOI: http://dx.doi.org/10.1145/1940761.1940772 2019-03--11.",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Kentaro Toyama. 2018. From needs to aspirations in information technology for development. Information Technology for Development 24, 1 (Jan. 2018), 15--36. DOI: http://dx.doi.org/10.1080/02681102.2017.1310713 2018--11--24.",
      "doi": ""
    },
    {
      "text": "Panayiota Tsatsou. 2011. Digital divides revisited: what is new about divides and their research? Media, Culture & Society 33, 2 (March 2011), 317--331. DOI: http://dx.doi.org/10.1177/0163443710393865 2019-04-08.",
      "doi": ""
    },
    {
      "text": "William D. Tucker. 2004. Connecting bridges across the digital divide. In Extended abstracts of the 2004 conference on Human factors and computing systems CHI '04. ACM Press, Vienna, Austria, 1039. DOI: http://dx.doi.org/10.1145/985921.985968",
      "doi": ""
    },
    {
      "text": "Alexander JAM van Deursen and Jan AGM van Dijk. 2019. The frst-level digital divide shifts from inequalities in physical access to inequalities in material access. New Media & Society 21, 2 (Feb. 2019), 354--375. DOI: http://dx.doi.org/10.1177/1461444818797082",
      "doi": ""
    },
    {
      "text": "Earnest Wheeler and Tawanna R. Dillahunt. 2018. Navigating the Job Search as a Low-Resourced Job Seeker. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, Montreal QC, Canada, 1--10. DOI: http://dx.doi.org/10.1145/3173574.3173622 2019-04--29.",
      "doi": ""
    },
    {
      "text": "Earnest Wheeler, Tawanna R. Dillahunt, and Soo Young Rieh. 2017. Opportunities to Address Information Poverty with Social Search. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM Press, Denver, Colorado, USA, 2224--2231. DOI: http://dx.doi.org/10.1145/3027063.3053167 2019-04--25.",
      "doi": "10.1145/3027063.3053167"
    },
    {
      "text": "Marisol Wong-Villacres, Arkadeep Kumar, Aditya Vishwanath, Naveena Karusala, Betsy DiSalvo, and Neha Kumar. 2018. Designing for Intersections. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18. ACM Press, Hong Kong, China, 45--58. DOI: http://dx.doi.org/10.1145/3196709.3196794 2019-09--10.",
      "doi": "10.1145/3196709.3196794"
    },
    {
      "text": "Marisol Wong-Villacres, Neha Kumar, and Betsy DiSalvo. 2019. The Parenting Actor-Network of Latino Immigrants in the United States. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, Glasgow, Scotland Uk, 1--12. DOI: http://dx.doi.org/10.1145/3290605.3300914",
      "doi": "10.1145/3290605.3300914"
    },
    {
      "text": "Susan Wyche, Nightingale Simiyu, and Martha E. Othieno. 2016. Mobile Phones as Amplifers of Social Inequality among Rural Kenyan Women. ACM Transactions on Computer-Human Interaction 23, 3 (June 2016), 1--19. DOI: http://dx.doi.org/10.1145/2911982 2019-09-06.",
      "doi": "10.1145/2911982"
    },
    {
      "text": "Jason C. Yip, Carmen Gonzalez, and Vikki Katz. 2016. The learning experiences of youth online information brokers. Singapore: International Society of the Learning Sciences. 2019-03--18.",
      "doi": ""
    }
  ]
}