{
  "doi": "10.1145/3313831.3376393",
  "title": "Exploring Eyes-free Bezel-initiated Swipe on Round Smartwatches",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Bezel-based gestures expand the interaction space of touch-screen devices (e.g., smartphones and smartwatches). Existing works have mainly focused on bezel-initiated swipe (BIS) on square screens. To investigate the usability of BIS on round smartwatches, we design six different circular bezel layouts, by dividing the bezel into 6, 8, 12, 16, 24, and 32 segments. We evaluate the user performance of BIS on these layouts in an eyes-free situation. The results show that the performance of BIS is highly orientation dependent, and varies significantly among users. Using the Support-Vector-Machine (SVM) model significantly increases the accuracy on 6-, 8-, 12-, and 16-segment layouts. We then compare the performance of personal and general SVM models, and find that personal models significantly improve the accuracy for 8-, 12-, 16-, and 24-segment layouts. Lastly, we discuss the potential smartwatch applications enabled by the BIS.",
  "authors": [
    {
      "name": "Pui Chung Wong",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659090080",
      "orcid": "missing"
    },
    {
      "name": "Kening Zhu",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81455605722",
      "orcid": "0000-0001-6740-4921"
    },
    {
      "name": "Xing-Dong Yang",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481651",
      "orcid": "missing"
    },
    {
      "name": "Hongbo Fu",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/do/10.1145/contrib-84458824857/rel-imgonly/hongbo_headshot_2023__small_.png",
      "acmid": "84458824857",
      "orcid": "0000-0002-0284-726X"
    }
  ],
  "references": [
    {
      "text": "Sunggeun Ahn, Jaeyeon Lee, Keunwoo Park, and Geehyuk Lee. 2018. Evaluation of Edge-based Interaction on a Square Smartwatch. Int. J. Hum.-Comput. Stud. 109, C (Jan. 2018), 68--78. DOI: http://dx.doi.org/10.1016/j.ijhcs.2017.08.004",
      "doi": "10.1016/j.ijhcs.2017.08.004"
    },
    {
      "text": "Kohei Akita, Toshimitsu Tanaka, and Yuji Sagawa. 2018. SliT: Character Input System Using Slide-in and Tap for Smartwatches. 3--16. DOI: http://dx.doi.org/10.1007/978--3--319--91250--9_1",
      "doi": ""
    },
    {
      "text": "Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An Investigation into Round Touchscreen Wristwatch Interaction. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08). ACM, NY, NY, USA, 311--314. DOI: http://dx.doi.org/10.1145/1409240.1409276",
      "doi": "10.1145/1409240.1409276"
    },
    {
      "text": "Gabor Blasko and Steven Feiner. 2004. An Interaction System for Watch Computers Using Tactile Guidance and Bidirectional Segmented Strokes. In Proceedings of the Eighth International Symposium on Wearable Computers (ISWC '04). IEEE Computer Society, Washington, DC, USA, 120--123. DOI: http://dx.doi.org/10.1109/ISWC.2004.6",
      "doi": "10.1109/ISWC.2004.6"
    },
    {
      "text": "Chen Chen, Simon T. Perrault, Shengdong Zhao, and Wei Tsang Ooi. 2014. BezelCopy: An Efficient Cross-application Copy-paste Technique for Touchscreen Smartphones. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, NY, NY, USA, 185--192. DOI: http://dx.doi.org/10.1145/2598153.2598162",
      "doi": "10.1145/2598153.2598162"
    },
    {
      "text": "Victor Cheung, Alex Keith Eady, and Audrey Girouard. 2017. Exploring Eyes-free Interaction with Wrist-Worn Deformable Materials. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, NY, NY, USA, 521--528. DOI: http://dx.doi.org/10.1145/3024969.3025087",
      "doi": "10.1145/3024969.3025087"
    },
    {
      "text": "Jun Gong, Zheer Xu, Qifan Guo, Teddy Seyed, Xiang 'Anthony' Chen, Xiaojun Bi, and Xing-Dong Yang. 2018. WrisText: One-handed Text Entry on Smartwatch Using Wrist Gestures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 181, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173755",
      "doi": "10.1145/3173574.3173755"
    },
    {
      "text": "Jun Gong, Xing-Dong Yang, and Pourang Irani. 2016. WristWhirl: One-handed Continuous Smartwatch Input Using Wrist Gestures. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 861--872. DOI: http://dx.doi.org/10.1145/2984511.2984563",
      "doi": "10.1145/2984511.2984563"
    },
    {
      "text": "Mitchell Gordon, Tom Ouyang, and Shumin Zhai. 2016. WatchWriter: Tap and Gesture Typing on a Smartwatch Miniature Keyboard with Statistical Decoding. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3817--3821. DOI: http://dx.doi.org/10.1145/2858036.2858242",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Anhong Guo and Tim Paek. 2016. Exploring Tilt for No-touch, Wrist-only Interactions on Smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, NY, NY, USA, 17--28. DOI: http://dx.doi.org/10.1145/2935334.2935345",
      "doi": "10.1145/2935334.2935345"
    },
    {
      "text": "Teng Han, Jiannan Li, Khalad Hasan, Keisuke Nakamura, Randy Gomez, Ravin Balakrishnan, and Pourang Irani. 2018. PageFlip: Leveraging Page-Flipping Gestures for Efficient Command and Value Selection on Smartwatches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 529, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174103",
      "doi": "10.1145/3173574.3174103"
    },
    {
      "text": "Teresa Hirzle, Jan Rixen, Jan Gugenheimer, and Enrico Rukzio. 2018. WatchVR: Exploring the Usage of a Smartwatch for Interaction in Mobile Virtual Reality. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article LBW634, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188629",
      "doi": "10.1145/3170427.3188629"
    },
    {
      "text": "Mohit Jain and Ravin Balakrishnan. 2012. User Learning and Performance with Bezel Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2221--2230. DOI: http://dx.doi.org/10.1145/2207676.2208376",
      "doi": "10.1145/2207676.2208376"
    },
    {
      "text": "Daniel Kharlamov, Brandon Woodard, Liudmila Tahai, and Krzysztof Pietroszek. 2016. TickTockRay: Smartwatch-based 3D Pointing for Smartphone-based Virtual Reality. In Proceedings of the 22Nd ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM, NY, NY, USA, 365--366. DOI: http://dx.doi.org/10.1145/2993369.2996311",
      "doi": "10.1145/2993369.2996311"
    },
    {
      "text": "Sangtae Kim, Jaejeung Kim, and Soobin Lee. 2013. Bezel-flipper: Design of a Light-weight Flipping Interface for e-Books. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 1719--1724. DOI: http://dx.doi.org/10.1145/2468356.2468664",
      "doi": "10.1145/2468356.2468664"
    },
    {
      "text": "Yuki Kubo, Buntarou Shizuki, and Jiro Tanaka. 2016. B2B-Swipe: Swipe Gesture for Rectangular Smartwatches from a Bezel to a Bezel. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3852--3856. DOI: http://dx.doi.org/10.1145/2858036.2858216",
      "doi": "10.1145/2858036.2858216"
    },
    {
      "text": "Hiroki Kurosawa, Daisuke Sakamoto, and Tetsuo Ono. 2018. MyoTilt: A Target Selection Method for Smartwatches Using the Tilting Operation and Electromyography. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, NY, NY, USA, Article 43, 11 pages. DOI: http://dx.doi.org/10.1145/3229434.3229457",
      "doi": "10.1145/3229434.3229457"
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. 1993. The Limits of Expert Performance Using Hierarchic Marking Menus. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93). ACM, NY, NY, USA, 482--487. DOI: http://dx.doi.org/10.1145/169059.169426",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Gordon P. Kurtenbach, Abigail J. Sellen, and William A. S. Buxton. 1993. An Empirical Evaluation of Some Articulatory and Cognitive Aspects of Marking Menus. Hum.-Comput. Interact. 8, 1 (March 1993), 1--23. DOI: http://dx.doi.org/10.1207/s15327051hci0801_1",
      "doi": "10.1207/s15327051hci0801_1"
    },
    {
      "text": "Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin Buttons: Cheap, Small, Low-powered and Clickable Fixed-icon Laser Projectors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 389--394. DOI: http://dx.doi.org/10.1145/2642918.2647356",
      "doi": "10.1145/2642918.2647356"
    },
    {
      "text": "Wing Ho Andy Li, Hongbo Fu, and Kening Zhu. 2016. BezelCursor: Bezel-Initiated Cursor for One-Handed Target Acquisition on Mobile Touch Screens. Int. J. Mob. Hum. Comput. Interact. 8, 1 (Jan. 2016), 1--22. DOI: http://dx.doi.org/10.4018/IJMHCI.2016010101",
      "doi": "10.4018/IJMHCI.2016010101"
    },
    {
      "text": "Wing Ho Andy Li, Kening Zhu, and Hongbo Fu. 2017. Exploring the Design Space of Bezel-Initiated Gestures for Mobile Interaction. Int. J. Mob. Hum. Comput. Interact. 9, 1 (Jan. 2017), 16--29. DOI: http://dx.doi.org/10.4018/IJMHCI.2017010102",
      "doi": ""
    },
    {
      "text": "Yiqin Lu, Chun Yu, Xin Yi, Yuanchun Shi, and Shengdong Zhao. 2017. BlindType: Eyes-Free Text Entry on Handheld Touchpad by Leveraging Thumb's Muscle Memory. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 18 (June 2017), 24 pages. DOI: http://dx.doi.org/10.1145/3090083",
      "doi": "10.1145/3090083"
    },
    {
      "text": "Andrés Lucero and Akos Vetek. 2014. NotifEye: Using Interactive Glasses to Deal with Notifications While Walking in Public. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (ACE '14). ACM, NY, NY, USA, Article 17, 10 pages. DOI: http://dx.doi.org/10.1145/2663806.2663824",
      "doi": "10.1145/2663806.2663824"
    },
    {
      "text": "Jakob Nielsen. 1994. Usability engineering. Elsevier.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Ian Oakley, DoYoung Lee, MD. Rasel Islam, and Augusto Esteves. 2015. Beats: Tapping Gestures for Smart Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1237--1246. DOI: http://dx.doi.org/10.1145/2702123.2702226",
      "doi": "10.1145/2702123.2702226"
    },
    {
      "text": "Masa Ogata, Ryosuke Totsuka, and Michita Imai. 2015. SkinWatch: Adapting Skin As a Gesture Surface. In SIGGRAPH Asia 2015 Emerging Technologies (SA '15). ACM, NY, NY, USA, Article 22, 2 pages. DOI: http://dx.doi.org/10.1145/2818466.2818496",
      "doi": "10.1145/2818466.2818496"
    },
    {
      "text": "Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1451--1460. DOI: http://dx.doi.org/10.1145/2470654.2466192",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Volker Roth and Thea Turner. 2009. Bezel Swipe: Conflict-free Scrolling and Multiple Selection on Mobile Touch Screen Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1523--1526. DOI: http://dx.doi.org/10.1145/1518701.1518933",
      "doi": "10.1145/1518701.1518933"
    },
    {
      "text": "Anne Roudaut, Stéphane Huot, and Eric Lecolinet. 2008. TapTap and MagStick: Improving One-handed Target Acquisition on Small Touch-screens. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, NY, NY, USA, 146--153. DOI: http://dx.doi.org/10.1145/1385569.1385594",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Franca Alexandra Rupprecht, Achim Ebert, Andreas Schneider, and Bernd Hamann. 2017. Virtual Reality Meets Smartwatch: Intuitive, Natural, and Multi-Modal Interaction. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 2884--2890. DOI: http://dx.doi.org/10.1145/3027063.3053194",
      "doi": "10.1145/3027063.3053194"
    },
    {
      "text": "Marcos Serrano, Eric Lecolinet, and Yves Guiard. 2013. Bezel-Tap Gestures: Quick Activation of Commands from Sleep Mode on Tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3027--3036. DOI: http://dx.doi.org/10.1145/2470654.2481421",
      "doi": "10.1145/2470654.2481421"
    },
    {
      "text": "Ke Sun, Yuntao Wang, Chun Yu, Yukang Yan, Hongyi Wen, and Yuanchun Shi. 2017. Float: One-Handed and Touch-Free Target Selection on Smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 692--704. DOI: http://dx.doi.org/10.1145/3025453.3026027",
      "doi": "10.1145/3025453.3026027"
    },
    {
      "text": "Infiniti Technology. 2015. TouchOne Keyboard. (2015). https://play.google.com/store/apps/details?id=net. infiniti.touchone.nimbus&hl=en_US",
      "doi": ""
    },
    {
      "text": "Feng Wang, Xiang Cao, Xiangshi Ren, and Pourang Irani. 2009. Detecting and Leveraging Finger Orientation for Interaction with Direct-touch Surfaces. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 23--32. DOI: http://dx.doi.org/10.1145/1622176.1622182",
      "doi": "10.1145/1622176.1622182"
    },
    {
      "text": "Pui Chung Wong, Kening Zhu, and Hongbo Fu. 2018. FingerT9: Leveraging Thumb-to-finger Interaction for Same-side-hand Text Entry on Smartwatches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 178, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3173752",
      "doi": "10.1145/3173574.3173752"
    },
    {
      "text": "Hui-Shyong Yeo, Juyoung Lee, Andrea Bianchi, and Aaron Quigley. 2016. WatchMI: Pressure Touch, Twist and Pan Gesture Input on Unmodified Smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, NY, NY, USA, 394--399. DOI: http://dx.doi.org/10.1145/2935334.2935375",
      "doi": "10.1145/2935334.2935375"
    },
    {
      "text": "Xin Yi, Chun Yu, Weijie Xu, Xiaojun Bi, and Yuanchun Shi. 2017. COMPASS: Rotational Keyboard on Non-Touch Smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 705--715. DOI: http://dx.doi.org/10.1145/3025453.3025454",
      "doi": "10.1145/3025453.3025454"
    },
    {
      "text": "Shengdong Zhao and Ravin Balakrishnan. 2004. Simple vs. Compound Mark Hierarchical Marking Menus. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 33--42. DOI: http://dx.doi.org/10.1145/1029632.1029639",
      "doi": "10.1145/1029632.1029639"
    },
    {
      "text": "Jun Gong Te-Yen Wu Aditya Shekhar Nittala Xiaojun Bi Jürgen Steimle Hongbo Fu Kening Zhu Xing-Dong Yang Zheer Xu, Pui Chung Wong. 2019. TipText:Eyes Free Text Entry on a Fingertip Keyboard. In Proceedings of the 32th Annual Symposium on User Interface Software and Technology (UIST '19). ACM, NY, NY, USA.",
      "doi": ""
    },
    {
      "text": "Kening Zhu, Morten Fjeld, and Ayça Ünlüer. 2018a. WristOrigami: Exploring Foldable Design for Multi-Display Smartwatch. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 1207--1218. DOI: http://dx.doi.org/10.1145/3196709.3196713",
      "doi": "10.1145/3196709.3196713"
    },
    {
      "text": "Kening Zhu, Xiaojuan Ma, Haoyuan Chen, and Miaoyin Liang. 2017. Tripartite Effects: Exploring Users' Mental Model of Mobile Gestures under the Influence of Operation, Handheld Posture, and Interaction Space. International Journal of Human--Computer Interaction 33, 6 (2017), 443--459.",
      "doi": ""
    },
    {
      "text": "Suwen Zhu, Tianyao Luo, Xiaojun Bi, and Shumin Zhai. 2018b. Typing on an Invisible Keyboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 439, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174013",
      "doi": "10.1145/3173574.3174013"
    }
  ]
}