{
  "doi": "10.1145/3313831.3376164",
  "title": "EAST: Early Autism Screening Tool for Preschoolers",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "We describe the iterative co-design process and evaluation of an early autism screening tool (EAST). EAST is an intermediary interactive tablet based app that assists in the early-detection of Autism Spectrum Disorder (ASD) by screening preschoolers in Pakistan through play-based activities in a home, school or clinical setting. Medical professionals, parents of autistic children and teachers were surveyed through focus groups to understand the reasons that contribute to the increasing number of missed early detections, and late- or misdiagnoses. We also evaluate the acceptability, usability and validity of our tool. We tested EAST with both typically developed and autistic children on how they relate to people, imitation, motor skills, visual and intellectual response. They were scored via time taken, the number of wrong attempts, or incorrect answers and audiovisual feedback. This paper contributes towards a digital autism screening tool that delivers insights into the child's behaviour and enables collaboration among parents, teachers and medical professionals.",
  "tags": [
    "digital tool",
    "autism screening",
    "preschool children"
  ],
  "authors": [
    {
      "name": "Muhammad Bilal Arshad",
      "institution": "Lahore University of Management and Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529351",
      "orcid": "missing"
    },
    {
      "name": "Muhammad Farhan Sarwar",
      "institution": "Lahore University of Management and Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529004",
      "orcid": "missing"
    },
    {
      "name": "Meher Fatima Zaidi",
      "institution": "Lahore University of Management and Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161439",
      "orcid": "missing"
    },
    {
      "name": "Suleman Shahid",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591550",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Psychiatric Association and American Psychiatric Association, eds. 2013. Diagnostic and statistical manual of mental disorders: DSM-5. American Psychiatric Association, Washington, D.C.",
      "doi": ""
    },
    {
      "text": "L. Zwaigenbaum, M. L. Bauman, W. L. Stone, N. Yirmiya, A. Estes, R. L. Hansen, J. C. McPartland, M. R. Natowicz, R. Choueiri, D. Fein, C. Kasari, K. Pierce, T. Buie, A. Carter, P. A. Davis, D. Granpeesheh, Z. Mailloux, C. Newschaffer, D. Robins, S. S. Roley, S. Wagner, and A. Wetherby. 2015. Early Identification of Autism Spectrum Disorder: Recommendations for Practice and Research. PEDIATRICS 136, Supplement: S10--S40. https://doi.org/10.1542/peds.2014--3667C",
      "doi": ""
    },
    {
      "text": "Emerson, E., & Baines, S. (n.d.). The Estimated Prevalence of Autism among Adults with Learning Disabilities in England. 18.",
      "doi": ""
    },
    {
      "text": "Guifeng Xu, Lane Strathearn, Buyun Liu, and Wei Bao. 2018. Prevalence of Autism Spectrum Disorder Among US Children and Adolescents, 2014--2016. JAMA 319, 1: 81. https://doi.org/10.1001/jama.2017.17812",
      "doi": ""
    },
    {
      "text": "Michael D. Kogan, Catherine J. Vladutiu, Laura A. Schieve, Reem M. Ghandour, Stephen J. Blumberg, Benjamin Zablotsky, James M. Perrin, Paul Shattuck, Karen A. Kuhlthau, Robin L. Harwood, and Michael C. Lu. 2018. The Prevalence of Parent-Reported Autism Spectrum Disorder Among US Children. Pediatrics 142, 6: e20174161. https://doi.org/10.1542/peds.2017-",
      "doi": ""
    },
    {
      "text": "Pakistan Country Report -- Autism. [n.d.]. www.nise.go.jp/kenshuka/josa/kankobutsu/pub_d/d292/d-292_19.pdf",
      "doi": ""
    },
    {
      "text": "Suhail, K. and Zafar, F., 2008. Prevalence of autism in special education schools of Lahore. Pakistan Journal of Psychological Research, 23(2).",
      "doi": ""
    },
    {
      "text": "Nazish Imran and Muhammad Waqar Azeem. 2014. Autism Spectrum Disorders: Perspective from Pakistan. In Comprehensive Guide to Autism, Vinood B. Patel, Victor R. Preedy and Colin R. Martin (eds.). Springer New York, New York, NY, 2483--2496. https://doi.org/10.1007/978--1--4614--4788--7_152",
      "doi": ""
    },
    {
      "text": "Pakistan Economic Survey - Ministry of Finance. 2019. http://finance.gov.pk/survey/chapters_19/Economic_S urvey_2018_19.pdf",
      "doi": ""
    },
    {
      "text": "Muhammad Salar Anwar, Mahnoor Tahir, Khushboo Nusrat, and Muhammad R Khan. 2018. Knowledge, Awareness, and Perceptions Regarding Autism Among Parents in Karachi, Pakistan. Cureus. https://doi.org/10.7759/cureus.3299",
      "doi": ""
    },
    {
      "text": "Simon Baron-Cohen, Fiona J. Scott, Carrie Allison, Joanna Williams, Patrick Bolton, Fiona E. Matthews, and Carol Brayne. 2009. Prevalence of autism-spectrum conditions: UK school-based population study. British Journal of Psychiatry 194, 6: 500--509. https://doi.org/10.1192/bjp.bp.108.059345",
      "doi": ""
    },
    {
      "text": "Young Shin Kim, Bennett L. Leventhal, Yun-Joo Koh, Eric Fombonne, Eugene Laska, Eun-Chung Lim, KeunAh Cheon, Soo-Jeong Kim, Young-Key Kim, HyunKyung Lee, Dong-Ho Song, and Roy Richard Grinker. 2011. Prevalence of Autism Spectrum Disorders in a Total Population Sample. American Journal of Psychiatry 168, 9: 904--912. https://doi.org/10.1176/appi.ajp.2011.10101532",
      "doi": ""
    },
    {
      "text": "Alokananda Rudra, Matthew K. Belmonte, Parmeet Kaur Soni, Saoni Banerjee, Shaneel Mukerji, and Bhismadev Chakrabarti. 2017. Prevalence of autism spectrum disorder and autistic symptoms in a schoolbased cohort of children in Kolkata, India: Prevalence of ASD in India. Autism Research 10, 10: 1597--1605. https://doi.org/10.1002/aur.1812",
      "doi": ""
    },
    {
      "text": "Michelle Heys, Felicity Gibbons, Ed Haworth, Emilie Medeiros, Kirti Man Tumbahangphe, Mary Wickenden, Merina Shrestha, Anthony Costello, Dharma Manandhar, and Elizabeth Pellicano. 2018. The Estimated Prevalence of Autism in School-Aged Children Living in Rural Nepal Using a PopulationBased Screening Tool. Journal of Autism and Developmental Disorders 48, 10: 3483--3498. https://doi.org/10.1007/s10803-018--3610--1",
      "doi": ""
    },
    {
      "text": "James C. McPartland, Brian Reichow, and Fred R. Volkmar. 2012. Sensitivity and Specificity of Proposed DSM-5 Diagnostic Criteria for Autism Spectrum Disorder. Journal of the American Academy of Child & Adolescent Psychiatry 51, 4: 368--383. https://doi.org/10.1016/j.jaac.2012.01.007",
      "doi": ""
    },
    {
      "text": "Farin Soleimani, Ali Khakshour, Zohreh Abasi, Samira Khayat, Seyede Zahra Ghaemi, and Nayereh Azam Hajikhani Golchin. 2014. Review of Autism Screening Tests. International Journal of Pediatrics: 11.",
      "doi": ""
    },
    {
      "text": "C. P. Johnson, S. M. Myers, and the Council on Children with Disabilities. 2007. Identification and Evaluation of Children with Autism Spectrum Disorders. PEDIATRICS 120, 5: 1183--1215. https://doi.org/10.1542/peds.2007--2361",
      "doi": ""
    },
    {
      "text": "Matson, J. L. (Ed.). 2016. Handbook of assessment and diagnosis of autism spectrum disorder. Cham: Springer.",
      "doi": ""
    },
    {
      "text": "Torbjörn Falkmer, Katie Anderson, Marita Falkmer, and Chiara Horlin. 2013. Diagnostic procedures in autism spectrum disorders: a systematic literature review. European Child & Adolescent Psychiatry 22, 6: 329--340. https://doi.org/10.1007/s00787-013-0375-0",
      "doi": ""
    },
    {
      "text": "Johnny L. Matson, Jonathan Wilkins, and Melissa González. 2008. Early identification and diagnosis in autism spectrum disorders in young children and infants: How early is too early? Research in Autism Spectrum Disorders 2, 1: 75--84. https://doi.org/10.1016/j.rasd.2007.03.002",
      "doi": ""
    },
    {
      "text": "Marianne L. Barton, Thyde Dumont-Mathieu, and Deborah Fein. 2012. Screening Young Children for Autism Spectrum Disorders in Primary Practice. Journal of Autism and Developmental Disorders 42, 6: 1165--1174. https://doi.org/10.1007/s10803-011--1343-",
      "doi": ""
    },
    {
      "text": "Elizabeth Mawle and Peter Griffiths. 2006. Screening for autism in pre-school children in primary care: Systematic review of English Language tools. International Journal of Nursing Studies 43, 5: 623-- 636. https://doi.org/10.1016/j.ijnurstu.2005.11.011",
      "doi": ""
    },
    {
      "text": "Diana L Robins, Deborah Fein, Marianne L Barton, and James A. Green. The Modified Checklist for Autism in Toddlers: An Initial Study Investigating the Early Detection of Autism and Pervasive Developmental Disorders. 14.",
      "doi": ""
    },
    {
      "text": "Bonnie Auyeung, Simon Baron-Cohen, Sally Wheelwright, and Carrie Allison. 2008. The Autism Spectrum Quotient: Children's Version (AQ-Child). Journal of Autism and Developmental Disorders 38, 7: 1230--1240. https://doi.org/10.1007/s10803-007-0504z",
      "doi": ""
    },
    {
      "text": "A. Phillips, J. Morrison, and R. W. Davis. 2004. General practitioners' educational needs in intellectual disability health. Journal of Intellectual Disability Research 48, 2: 142--149. https://doi.org/10.1111/j.13652788.2004.00503.x",
      "doi": ""
    },
    {
      "text": "Mohammad Hossein Rahbar, Khalid Ibrahim, and Parisa Assassi. 2011. Knowledge and Attitude of General Practitioners Regarding Autism in Karachi, Pakistan. Journal of Autism and Developmental Disorders 41, 4: 465--474. https://doi.org/10.1007/s10803-010--1068-x",
      "doi": ""
    },
    {
      "text": "Humphrey, N., & Lewis, S. 2008. 'Make me normal': The views and experiences of pupils on the autistic spectrum in mainstream secondary schools. Autism, 12(1), 23--46. https://doi.org/10.1177/1362361307085267",
      "doi": ""
    },
    {
      "text": "Paula Morales-Hidalgo, Carmen Hernández-Martínez, Núria Voltas, and Josefa Canals. 2017. EDUTEA: A DSM-5 teacher screening questionnaire for autism spectrum disorder and social pragmatic communication disorder. International Journal of Clinical and Health Psychology 17, 3: 269--281. https://doi.org/10.1016/j.ijchp.2017.05.002",
      "doi": ""
    },
    {
      "text": "Gnanathusharan Rajendran and Peter Mitchell. 2007. Cognitive theories of autism. Developmental Review 27, 2: 224--260. https://doi.org/10.1016/j.dr.2007.02.001",
      "doi": ""
    },
    {
      "text": "Sally Ozonoff, Beth L. Goodlin-Jones, and Marjorie Solomon. 2005. Evidence-Based Assessment of Autism Spectrum Disorders in Children and Adolescents. Journal of Clinical Child & Adolescent Psychology 34, 3: 523--540. https://doi.org/10.1207/s15374424jccp3403_8",
      "doi": ""
    },
    {
      "text": "Torbjörn Falkmer, Katie Anderson, Marita Falkmer, and Chiara Horlin. 2013. Diagnostic procedures in autism spectrum disorders: a systematic literature review. European Child & Adolescent Psychiatry 22, 6: 329--340. https://doi.org/10.1007/s00787-013-0375-0",
      "doi": ""
    },
    {
      "text": "C. Gillberg, V. Nordin, and S. Ehlers. 1996. Early detection of autism. Diagnostic instruments for clinicians. European Child & Adolescent Psychiatry 5, 2: 67--74. https://doi.org/10.1007/BF01989498",
      "doi": ""
    },
    {
      "text": "Wendy L Stone, Elaine E Coonrod, and Opal Y Ousley. Brief Report: Screening Tool for Autism in Two-Year-Olds (STAT): Development and Preliminary Data. 6.",
      "doi": ""
    },
    {
      "text": "Patricia O. Towle and Patricia A. Patrick. 2016. Autism Spectrum Disorder Screening Instruments for Very Young Children: A Systematic Review. Autism Research and Treatment 2016: 1--29. https://doi.org/10.1155/2016/4624829",
      "doi": ""
    },
    {
      "text": "Sarah Kuriakose and Rebecca Shalev. 2016. Early Diagnostic Assessment. In Early Intervention for Young Children with Autism Spectrum Disorder, Russell Lang, Terry B. Hancock and Nirbhay N. Singh (eds.). Springer International Publishing, Cham, 15--46. https://doi.org/10.1007/978--3--319--30925--5_2",
      "doi": ""
    },
    {
      "text": "C. P. Johnson, S. M. Myers, and and the Council on Children with Disabilities. 2007. Identification and Evaluation of Children with Autism Spectrum Disorders. PEDIATRICS 120, 5: 1183--1215. https://doi.org/10.1542/peds.2007--2361",
      "doi": ""
    },
    {
      "text": "Robert E. Nickel and Lark Huang-Storms. 2017. Early Identification of Young Children with Autism Spectrum Disorder. The Indian Journal of Pediatrics 84, 1: 53-- 60. https://doi.org/10.1007/s12098-015--1894-0",
      "doi": ""
    },
    {
      "text": "Qandeel Tariq, Jena Daniels, Jessey Nicole Schwartz, Peter Washington, Haik Kalantarian, and Dennis Paul Wall. 2018. Mobile detection of autism through machine learning on home video: A development and prospective validation study. PLOS Medicine 15, 11: e1002705. https://doi.org/10.1371/journal.pmed.1002705",
      "doi": ""
    },
    {
      "text": "Halim Abbas, Ford Garberson, Eric Glover, and Dennis P. Wall. 2017. Machine learning approach for early detection of autism by combining questionnaire and home video screening. arXiv:1703.06076 [cs]. Retrieved July 13, 2019 from http://arxiv.org/abs/1703.06076",
      "doi": ""
    },
    {
      "text": "Guillermo Sapiro, Jordan Hashemi, and Geraldine Dawson. 2019. Computer vision and behavioral phenotyping: an autism case study. Current Opinion in Biomedical Engineering 9: 14--20. https://doi.org/10.1016/j.cobme.2018.12.002",
      "doi": ""
    },
    {
      "text": "Jordan Hashemi, Geraldine Dawson, Kimberly L.H. Carpenter, Kathleen Campbell, Qiang Qiu, Steven Espinosa, Samuel Marsan, Jeffery P. Baker, Helen L. Egger, and Guillermo Sapiro. 2018. Computer Vision Analysis for Quantification of Autism Risk Behaviors. IEEE Transactions on Affective Computing: 1--1. https://doi.org/10.1109/TAFFC.2018.2868196",
      "doi": ""
    },
    {
      "text": "Haik Kalantarian, Khaled Jedoui, Peter Washington, Qandeel Tariq, Kaiti Dunlap, Jessey Schwartz, and Dennis P. Wall. 2019. Labeling Images with Facial Emotion. Artificial Intelligence in Medicine. https://doi.org/10.1016/j.artmed.2019.06.004",
      "doi": ""
    },
    {
      "text": "Vincent A. Fusaro, Jena Daniels, Marlena Duda, Todd F. DeLuca, Olivia D'Angelo, Jenna Tamburello, James Maniscalco, and Dennis P. Wall. 2014. The Potential of Accelerating Early Detection of Autism through Content Analysis of YouTube Videos. PLOS ONE 9, 4: e93533. https://doi.org/10.1371/journal.pone.0093533",
      "doi": ""
    },
    {
      "text": "Beibin Li, Quan Wang, Marilena Mademtzi, Mary Best, Frederick Shic, Adham Atyabi, Minah Kim, Erin Barney, Amy Yeojin Ahn, Yawen Luo, Madeline Aubertine, Sarah Corrigan, and Tanya St. John. 2018. Social Influences on Executive Functioning in Autism: Design of a Mobile Gaming Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18), 1--13. https://doi.org/10.1145/3173574.3174017",
      "doi": "10.1145/3173574.3174017"
    },
    {
      "text": "Jingying Chen, Guangshuai Wang, Kun Zhang, Guanghai Wang, and Leyuan Liu. 2019. A pilot study on evaluating children with autism spectrum disorder using computer games. Computers in Human Behavior 90: 204--214. https://doi.org/10.1016/j.chb.2018.08.057",
      "doi": ""
    },
    {
      "text": "Ankit Koirala, Zhiwei Yu, Hillary Schiltz, Amy Van Hecke, Kathleen A Koth, and Zhi Zheng. 2019. An Exploration of Using Virtual Reality to Assess the Sensory Abnormalities in Children with Autism Spectrum Disorder. In Proceedings of the Interaction Design and Children on ZZZ (IDC '19), 293--300. https://doi.org/10.1145/3311927.3323118",
      "doi": "10.1145/3311927.3323118"
    },
    {
      "text": "James G. Kahn, Joshua S. Yang, and James S. Kahn. 2010. 'Mobile' Health Needs and Opportunities in Developing Countries. Health Affairs 29, 2: 252--258. https://doi.org/10.1377/hlthaff.2009.0965",
      "doi": ""
    },
    {
      "text": "Joaquin A. Blaya, Hamish S.F. Fraser, and Brian Holt. 2010. E-Health Technologies Show Promise in Developing Countries. Health Affairs 29, 2: 244--251. https://doi.org/10.1377/hlthaff.2009.0894",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Julia Makhaeva, and Katharina Spiel. 2017. Blending Methods: Developing Participatory Design Sessions for Autistic Children. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC'17), 39--49. https://doi.org/10.1145/3078072.3079727",
      "doi": "10.1145/3078072.3079727"
    },
    {
      "text": "Cara Wilson. 2019. Co-Designing Digital Technologies to Support Minimally-Verbal Children on the Autism Spectrum. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA'19), 1--6. https://doi.org/10.1145/3290607.3299076a",
      "doi": "10.1145/3290607.3299076"
    },
    {
      "text": "Amani Indunil Soysa, Abdullah Al Mahmud, and Blair Kuys. 2018. Co-designing tablet computer applications with Sri Lankan practitioners to support children with ASD. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 413--419. https://doi.org/10.1145/3202185.3202764",
      "doi": "10.1145/3202185.3202764"
    },
    {
      "text": "Muneeb Imtiaz Ahmad and Suleman Shahid. 2015. Design and Evaluation of Mobile Learning Applications for Autistic Children in Pakistan. In Human-Computer Interaction (INTERACT 2015), 436--444.",
      "doi": "10.1007/978-3-319-22701-6_32"
    },
    {
      "text": "Karl Frederick Braekkan Payne, Heather Wharrad, and Kim Watts. 2012. Smartphone and medical related App use among medical students and junior doctors in the United Kingdom (UK): a regional survey. BMC Medical Informatics and Decision Making 12, 1. https://doi.org/10.1186/1472--6947--12--121",
      "doi": ""
    },
    {
      "text": "Nazish Imran, Mansoor R Chaudry, Muhammad W Azeem, Muhammad R Bhatti, Zaidan I Choudhary, and Mohsin A Cheema. 2011. A survey of Autism knowledge and attitudes among the healthcare professionals in Lahore, Pakistan. BMC Pediatrics 11, 1. https://doi.org/10.1186/1471--2431--11--107",
      "doi": ""
    },
    {
      "text": "Howard C. Shane and Patti Ducoff Albert. 2008. Electronic Screen Media for Persons with Autism Spectrum Disorders: Results of a Survey. Journal of Autism and Developmental Disorders 38, 8: 1499-- 1508. https://doi.org/10.1007/s10803-007-0527--5",
      "doi": ""
    },
    {
      "text": "Gráinne C. Brady, Joanna Goodrich, and Justin W. G. Roe. 2019. Using experience-based co-design to improve the pre-treatment care pathway for people diagnosed with head and neck cancer. Supportive Care in Cancer. https://doi.org/10.1007/s00520-019-04877-z",
      "doi": ""
    },
    {
      "text": "Partington Behavior Analyst. 2006. https://partingtonbehavioranalysts.com/products/abllsr-the-assessment-of-basic-language-and-learningskills-revised",
      "doi": ""
    },
    {
      "text": "Malinda Carpenter, Bruce F Pennington, and Sally J Rogers. 2002. Interrelations among social-cognitive skills in young children with autism. Journal of autism and developmental disorders, 32(2), 91--106.",
      "doi": ""
    },
    {
      "text": "Brie Yama, Tom Freeman, Erin Graves, Su Yuan, and M. Karen Campbell. 2012. Examination of the Properties of the Modified Checklist for Autism in Toddlers (M-CHAT) in a Population Sample. Journal of Autism and Developmental Disorders 42, 1: 23--34. https://doi.org/10.1007/s10803-011--1211--3",
      "doi": ""
    },
    {
      "text": "Kenneth G Shipley and Julie G McAfee. 2016. Assessment in Speech-Language Pathology: A Resource Manual. 738.",
      "doi": ""
    },
    {
      "text": "Chelsea A. Vaughan. 2011. Test Review: E. Schopler, M. E. Van Bourgondien, G. J. Wellman, & S. R. Love Childhood Autism Rating Scale (2nd ed.). Los Angeles, CA: Western Psychological Services, 2010. Journal of Psychoeducational Assessment 29, 5: 489--493. https://doi.org/10.1177/0734282911400873",
      "doi": ""
    },
    {
      "text": "Beth Provost, Brian R. Lopez, and Sandra Heimerl. 2007. A Comparison of Motor Delays in Young Children: Autism Spectrum Disorder, Developmental Delay, and Developmental Concerns. Journal of Autism and Developmental Disorders 37, 2: 321--328. https://doi.org/10.1007/s10803-006-0170--6",
      "doi": ""
    },
    {
      "text": "Baron-Cohen, Simon. 2000. Theory of mind and autism: A fifteen year review. Understanding other minds: Perspectives from developmental cognitive neuroscience 2: 3--20.",
      "doi": ""
    },
    {
      "text": "Simon Baron-Cohen, Ruth Campbell, Annette Karmiloff-Smith, Julia Grant, and Jane Walker. 1995. Are children with autism blind to the mentalistic significance of the eyes? British Journal of Developmental Psychology 13, 4: 379--398. https://doi.org/10.1111/j.2044--835X.1995.tb00687.x",
      "doi": ""
    },
    {
      "text": "Charmaz, K. 2014. Constructing grounded theory (2nd ed.). London, England: Sage.",
      "doi": ""
    },
    {
      "text": "Glaser, B., & Strauss, A. 1967. The discovery of grounded theory: Strategies for qualitative research. Chicago, IL: Aldine.",
      "doi": ""
    },
    {
      "text": "Urquhart, C. 2013. Grounded theory for qualitative research: A practical guide. London, England: Sage.",
      "doi": ""
    },
    {
      "text": "Alessandro Crippa, Sara Forti, Paolo Perego, and Massimo Molteni. 2013. Eye-Hand Coordination in Children with High Functioning Autism and Asperger's Disorder Using a Gap-Overlap Paradigm. Journal of Autism and Developmental Disorders 43, 4: 841--850. https://doi.org/10.1007/s10803-012--1623--8",
      "doi": ""
    },
    {
      "text": "Kimberly Andrews Espy, Paul M. Kaufmann, Martha L. Glisky, and Melanie D. McDiarmid. 2001. New Procedures to Assess Executive Functions in Preschool Children*. The Clinical Neuropsychologist 15, 1: 46-- 58. https://doi.org/10.1076/clin.15.1.46.1908",
      "doi": ""
    },
    {
      "text": "Claire Hughes and Rosie Ensor. 2005. Executive Function and Theory of Mind in 2 Year Olds: A Family Affair? Developmental Neuropsychology 28, 2: 645-- 668. https://doi.org/10.1207/s15326942dn2802_5",
      "doi": ""
    },
    {
      "text": "Michael T. Willoughby, Clancy B. Blair, R. J. Wirth, Mark Greenberg, and The Family Life Project Investigators. 2010. The measurement of executive function at age 3 years: Psychometric properties and criterion validity of a new battery of tasks. Psychological Assessment 22, 2: 306--317. https://doi.org/10.1037/a0018708",
      "doi": ""
    },
    {
      "text": "Valérie Courchesne, Andrée-Anne S Meilleur, MariePier Poulin-Lord, Michelle Dawson, and Isabelle Soulières. 2015. Autistic children at risk of being underestimated: school-based pilot study of a strengthinformed assessment. Molecular Autism 6, 1: 12. https://doi.org/10.1186/s13229-015-0006--3",
      "doi": ""
    },
    {
      "text": "Rhonda D. L. Booth and Francesca G. E. Happé. 2018. Evidence of Reduced Global Processing in Autism Spectrum Disorder. Journal of Autism and Developmental Disorders 48, 4: 1397--1408. https://doi.org/10.1007/s10803-016--2724--6",
      "doi": ""
    },
    {
      "text": "Tiago Bara, Antonio Carlos Farias, Erico Felden, and Mara Cordeiro. 2017. Receiver operating characteristic curve analysis of the Child Behavior Checklist and Teacher's Report Form for assessing autism spectrum disorder in preschool-aged children. Neuropsychiatric Disease and Treatment Volume 14: 95--102. https://doi.org/10.2147/NDT.S151185",
      "doi": ""
    },
    {
      "text": "W-Y Lin, L-T Lee, C-Y Chen, H Lo, H-H Hsia, I-L Liu, R-S Lin, W-Y Shau, and K-C Huang. 2002. Optimal cut-off values for obesity: using simple anthropometric indices to predict cardiovascular risk factors in Taiwan. International Journal of Obesity 26, 9: 1232--1238. https://doi.org/10.1038/sj.ijo.0802040",
      "doi": ""
    },
    {
      "text": "Ilker Unal. 2017. Defining an Optimal Cut-Point Value in ROC Analysis: An Alternative Approach. Computational and Mathematical Methods in Medicine 2017: 1--14. https://doi.org/10.1155/2017/3762651",
      "doi": ""
    },
    {
      "text": "Zsuzsa Kaldy, Ivy Giserman, Alice S. Carter, and Erik Blaser. 2016. The Mechanisms Underlying the ASD Advantage in Visual Search. Journal of Autism and Developmental Disorders 46, 5: 1513--1527. https://doi.org/10.1007/s10803-013--1957-x",
      "doi": ""
    },
    {
      "text": "Dennis A. Adams, R. Ryan Nelson, and Peter A. Todd. 1992. Perceived Usefulness, Ease of Use, and Usage of Information Technology: A Replication. MIS Quarterly 16, 2: 227. https://doi.org/10.2307/249577",
      "doi": "10.2307/249577"
    },
    {
      "text": "Agatha M. Conrad and Don Munro. 2008. Relationships between Computer Self-Efficacy, Technology, Attitudes and Anxiety: Development of the Computer Technology Use Scale (CTUS). Journal of Educational Computing Research 39, 1: 51--73. https://doi.org/10.2190/EC.39.1.d",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes, Sen Hirano, Gabriela Marcu, Mohamad Monibi, David H. Nguyen, and Michael Yeganyan. 2010. Interactive visual supports for children with autism. Personal and Ubiquitous Computing 14, 7: 663--680. https://doi.org/10.1007/s00779-010-0294--8",
      "doi": "10.1007/s00779-010-0294-8"
    }
  ]
}