{
  "doi": "10.1145/3313831.3376460",
  "title": "Storytelling to Sensemaking: A Systematic Framework for Designing Auditory Description Display for Interactives",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Auditory description display is verbalized text typically used to describe live, recorded, or graphical displays to support access for people who are blind or visually impaired. Significant prior research has resulted in guidelines for auditory description for non-interactive or minimally interactive contexts. A lack of auditory description for complex interactive environments remains a tremendous barrier to access for people with visual impairments. In this work, we present a systematic design framework for designing auditory description within complex interactive environments. We illustrate how modular descriptions aligned with this framework can result in an interactive storytelling experience constructed through user interactions. This framework has been used in a set of published and widely used interactive science simulations, and in its generalized form could be applied to a variety of contexts.",
  "tags": [
    "non-visual access",
    "description design",
    "auditory description display",
    "interactive information spaces"
  ],
  "authors": [
    {
      "name": "Taliesin L. Smith",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659079181",
      "orcid": "missing"
    },
    {
      "name": "Emily B. Moore",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707036",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Diagram Center. 2012. POET Training Tool, A Benetech Inititiative. (2012). https://poet.diagramcenter.org/index.html",
      "doi": ""
    },
    {
      "text": "Diagram Center. 2015. Image Description Guidelines. (2015). http://diagramcenter.org/table-of-contents-2.html",
      "doi": ""
    },
    {
      "text": "Joanmarie Diggs, Shane McCarron, Michael Cooper, Richard Schwerdtfeger, and James Craig. 2017. Accessible Rich Internet Applications (WAI-ARIA) 1.1. (Dec. 2017). https://www.w3.org/TR/wai-aria-1.1/",
      "doi": ""
    },
    {
      "text": "M. Fakrudeen, M. Ali, S. Yousef, and A. H. Hussein. 2013. Analysing the Mental Modal of Blind Users in Mobile Touch Screen Devices for Usability. In Proceedings of the World Congress on Engineering, Vol. 2. IAENG, Springer, London, U.K., unknown.",
      "doi": ""
    },
    {
      "text": "Steve Faulkner, Arron Eicholz, Travis Leithead, Alex Danilo, and Sangwhan Moon. 2017. HTML 5.2. (Dec. 2017). https://www.w3.org/TR/html52/",
      "doi": ""
    },
    {
      "text": "Leo Ferres, Gitte Lindgaard, Livia Sumegi, and Bruce Tsuji. 2013. Evaluating a Tool for Improving Accessibility to Charts and Graphs. ACM Transactions on Computer-Human Interaction 20, 5 (Nov. 2013), 1--32. DOI: http://dx.doi.org/10.1145/2533682.2533683",
      "doi": "10.1145/2533682.2533683"
    },
    {
      "text": "Donal Fitzpatrick, A. Jonathan R. Godfrey, and Volker Sorge. 2017. Producing Accessible Statistics Diagrams in R. In W4A '17 Proceedings of the 14th Web for All Conference on the The Future of Accessible Work. ACM Press, Perth, Australia, 1--4. DOI: http://dx.doi.org/10.1145/3058555.3058564",
      "doi": ""
    },
    {
      "text": "Nahum Gershon and Ward Page. 2001. What storytelling can do for information visualization. Commun. ACM 44, 8 (Aug. 2001), 31--37. DOI: http://dx.doi.org/10.1145/381641.381653",
      "doi": "10.1145/381641.381653"
    },
    {
      "text": "Andrew Holland. 2009. Audio Description in the Theatre and the Visual Arts: Images into Words. In Audiovisual Translation, Jorge Dìaz Cintas and Gunilla Anderman (Eds.). Palgrave Macmillan UK, London, 170--185. DOI: http://dx.doi.org/10.1057/9780230234581_13",
      "doi": ""
    },
    {
      "text": "T. de Jong. 2006. COMPUTER SIMULATIONS: Technological Advances in Inquiry Learning. Science 312, 5773 (April 2006), 532--533. DOI: http://dx.doi.org/10.1126/science.1127750",
      "doi": ""
    },
    {
      "text": "Kyle Keane. 2014. Interactive Scientific Graphics Recommended Practices for Verbal Description. Research. Wolfram Research, Inc., Champaign, IL. 53 pages. http://diagramcenter.org/ accessible-dynamic-scientific-graphics.html",
      "doi": ""
    },
    {
      "text": "Edward Kim and Kathleen F. McCoy. 2018. Multimodal Deep Learning using Images and Text for Information Graphic Classification. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '18. ACM Press, Galway, Ireland, 143--148. DOI: http://dx.doi.org/10.1145/3234695.3236357",
      "doi": ""
    },
    {
      "text": "Andrew Kirkpatrick, Joshua O Connor, Alistair Campbell, and Michael Cooper. 2018. Web Content Accessibility Guidelines (WCAG) 2.1. (June 2018). https://www.w3.org/TR/WCAG21/",
      "doi": ""
    },
    {
      "text": "Sri H. Kurniawan, Alistair G. Sutcliffe, Paul L. Blenkhorn, and Jae-Eun Shin. 2003. Investigating the usability of a screen reader and mental models of blind users in the Windows environment. International Journal of Rehabilitation Research 26, 2 (2003), 145--147. http://journals.lww.com/intjrehabilres/ Abstract/2003/06000/Investigating_the_usability_of_a_ screen_reader_and.11.aspx",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Alison Oldfield, Taimur Ahmed, Antonis Vafeas, and Sunny Miglani. 2019. Voice User Interfaces in Schools: Co-designing for Inclusion with Visually-Impaired and Sighted Pupils. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, Glasgow, Scotland Uk, 1--15. DOI: http://dx.doi.org/10.1145/3290605.3300608",
      "doi": "10.1145/3290605.3300608"
    },
    {
      "text": "Emily B. Moore, Taliesin L. Smith, and Emily Randall. 2016. Exploring the Relationship Between Implicit Scaffolding and Inclusive Design in Interactive Science Simulations. In Universal Access in Human-Computer Interaction. Users and Context Diversity, Margherita Antona and Constantine Stephanidis (Eds.). Lecture Notes in Computer Science, Vol. 9739. Springer International Publishing, Cham, 112--123. http://link.springer.com/10.1007/978--3--319--40238--3_12",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt and W. Keith Edwards. 1995. Audio GUIs: interacting with graphical applications in an auditory world. In Conference companion on Human factors in computing systems - CHI '95. ACM Press, Denver, Colorado, United States, 85--86. DOI: http://dx.doi.org/10.1145/223355.223441",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 1987. Some observations on mental models. In Readings in human-computer interaction: a multidisciplinary approach, Ronald M. Baecker and William A. S. Buxton (Eds.). M. Kaufmann, Los Altos, Calif, 241--244.",
      "doi": ""
    },
    {
      "text": "Tor Ole B. Odden and Rosemary S. Russ. 2018. Defining sensemaking: Bringing clarity to a fragmented theoretical construct. Science Education 103, 1 (Jan. 2018), 187--205. DOI: http://dx.doi.org/10.1002/sce.21452",
      "doi": ""
    },
    {
      "text": "Jaclyn Packer, Katie Vizenor, and Joshua A. Miele. 2015. An Overview of Video Description: History, Benefits, and Guidelines. Journal of Visual Impairment & Blindness 109, 2 (March 2015), 83--93. DOI: http://dx.doi.org/10.1177/0145482X1510900204",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2008. PhET Simulation Design Process. (2008). https://phet.colorado.edu/ publications/phet_design_process.pdf",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2015. Research and Design, Accessibility. (2015). https://phet.colorado.edu/en/accessibility/research",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2019a. A11y View: Resistance in a Wire. (Dec. 2019). https://phet-dev.colorado.edu/html/resistance-in-a-wire/1. 7.0-dev.4/phet/resistance-in-a-wire_a11y_view.html",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2019b. Balloons and Static Electricity. (Oct. 2019). http://phet.colorado. edu/en/simulation/balloons-and-static-electricity Version 1.4.14.",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2019c. Friction. (Oct. 2019). https://phet.colorado.edu/en/simulation/friction Version 1.5.10.",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2019d. Gravity Force Lab: Basics. (Oct. 2019). https://phet.colorado.edu/en/ simulation/gravity-force-lab-basics Version 1.0.0.",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2019e. John Travoltage. (Oct. 2019). https://phet.colorado.edu/en/simulation/john-travoltage Version 1.5.12.",
      "doi": ""
    },
    {
      "text": "PhET Interactive Simulations. 2019f. Resistance in a Wire. (Oct. 2019). http://phet.colorado.edu/en/ simulation/resistance-in-a-wire Version 1.6.9.",
      "doi": ""
    },
    {
      "text": "William Pike and Mark Gahegan. 2007. Beyond ontologies: Toward situated representations of scientific knowledge. International Journal of Human-Computer Studies 65, 7 (July 2007), 674--688. DOI: http://dx.doi.org/10.1016/j.ijhcs.2007.03.002",
      "doi": "10.1016/j.ijhcs.2007.03.002"
    },
    {
      "text": "William A. Pike, John Stasko, Remco Chang, and Theresa A. O'Connell. 2009. The Science of Interaction. Information Visualization 8, 4 (Jan. 2009), 263--274. DOI: http://dx.doi.org/10.1057/ivs.2009.22",
      "doi": "10.1057/ivs.2009.22"
    },
    {
      "text": "Noah S. Podolefsky, Emily B. Moore, and Katherine K. Perkins. 2013. Implicit scaffolding in interactive simulations: Design strategies to support multiple educational goals. arXiv preprint arXiv:1306.6544 (2013). http://arxiv.org/abs/1306.6544",
      "doi": ""
    },
    {
      "text": "DCMP (Described and Captioned Media Program). 1994. Captioning Key. (1994). https://www.captioningkey.org/quality_captioning.html",
      "doi": ""
    },
    {
      "text": "Jaime Sànchez, Nelson Baloian, Tiago Hassler, and Ulrich Hoppe. 2003. AudioBattleship: blind learners collaboration through sound. In CHI '03 extended abstracts on Human factors in computing systems ­ CHI '03. ACM Press, Ft. Lauderdale, Florida, USA, 798. DOI: http://dx.doi.org/10.1145/765891.765998",
      "doi": ""
    },
    {
      "text": "Taliesin Smith, Michael Kauzmann, and PhET Interactive Simulations. 2019. Dynamic Phrase Manipulator. (June 2019). https://htmlpreview.github.io/?https://github.com/phetsims/a11y-research/blob/master/js/ phrase-builder/phrase-builder.html",
      "doi": ""
    },
    {
      "text": "Taliesin L. Smith. 2016. Access, Action, & Agency: Inclusive Design for the Non-visual Use of a Highly Interactive Simulation. Master Research Project. OCAD University, Toronto, Ontario. http://openresearch.ocadu.ca/id/eprint/713",
      "doi": ""
    },
    {
      "text": "Taliesin L. Smith, Jesse Greenberg, Sam Reid, and Emily B. Moore. 2018. Parallel DOM Architecture for Accessible Interactive Simulations. In Proceedings of the Internet of Accessible Things on - W4A '18. ACM Press, Lyon, France, 1--8. DOI: http://dx.doi.org/10.1145/3192714.3192817",
      "doi": ""
    },
    {
      "text": "Taliesin L. Smith, Clayton Lewis, and Emily B. Moore. 2016. Demonstration: Screen Reader Support for a Complex Interactive Science Simulation. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM New York, NY, USA, Reno, Nevada, USA, 319--320. DOI: http://dx.doi.org/10.1145/2982142.2982154",
      "doi": ""
    },
    {
      "text": "Taliesin L. Smith, Clayton Lewis, and Emily B. Moore. 2017. Description Strategies to Make an Interactive Science Simulation Accessible. Journal on Technology & Persons with Disabilities 5, 22 (2017), 225--238. http://scholarworks.calstate.edu/handle/10211.3/190214",
      "doi": ""
    },
    {
      "text": "Volker Sorge, Mark Lee, and Sandy Wilkinson. 2015. End-to-end solution for accessible chemical diagrams. In Proceedings of the 12th Web for All Conference. ACM Press, Florence, Italy, 1--10. DOI: http://dx.doi.org/10.1145/2745555.2746667",
      "doi": "10.1145/2745555.2746667"
    },
    {
      "text": "Brianna J. Tomlinson, Prakriti Kaini, Bruce N. Walker, Jared M. Batterman, and Emily B. Moore. 2018. Supporting Simulation Use for Students with Intellectual and Developmental Disabilities. Journal on Technology & Persons with Disabilities Volume 6, 2018 (2018), 202 -- 218. http://hdl.handle.net/10211.3/202996",
      "doi": ""
    },
    {
      "text": "Brianna J. Tomlinson, Bruce N. Walker, and Emily B. Moore. 2020. Auditory Display in Interactive Science Simulations: Description and Sonifcation Support Interaction and Enhance Opportunities for Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu, HI, USA. DOI: http://dx.doi.org/10.1145/3313831.3376886",
      "doi": ""
    },
    {
      "text": "Hong Zou and Jutta Treviranus. 2015. ChartMaster: A Tool for Interacting with Stock Market Charts using a Screen Reader. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM New York, NY, USA, Lisbon, Portugal, 107--115. DOI: http://dx.doi.org/10.1145/2700648.2809862",
      "doi": "10.1145/2700648.2809862"
    }
  ]
}