{
  "doi": "10.1145/3313831.3376208",
  "title": "Utilizing Participant Voice in Volunteer Training",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Delivering training to volunteers is a huge challenge for non-governmental organisations (NGOs). Traditional classroom-based approaches that dominate training are problematic due to the limited participation they offer to trainees. Peer-led approaches however, have shown promise in helping NGOs utilise trainee experiences within training. Although technologies are playing an increasing role in training, their benefits are not well understood. We describe our experience of designing peer-led training for community volunteers in rural India. Working alongside an NGO involved in community regeneration and social action, we collaboratively delivered a ten-day training workshop, deploying audio technologies to engage the participants in sharing lived experiences. We draw on reflections from trainers and trainees on how utilising participant voice can enhance training. We highlight opportunities around the usage of audio technologies for engaging with participant voice, including the ability to reclaim trainee agency within training and to work within cultural barriers.",
  "authors": [
    {
      "name": "Delvin Varghese",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-99659153172/rel-imgonly/picked_img_0051_cw.jpg",
      "acmid": "99659153172",
      "orcid": "0000-0002-7806-1001"
    },
    {
      "name": "Jay Rainey",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367245",
      "orcid": "missing"
    },
    {
      "name": "Kyle Montague",
      "institution": "Newcastle University, Newcastle, United Kingdom",
      "img": "/do/10.1145/contrib-81472655898/rel-imgonly/xsmall_profile.jpg",
      "acmid": "81472655898",
      "orcid": "missing"
    },
    {
      "name": "Tom Bartindale",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81416597993/rel-imgonly/81416597993.jpg",
      "acmid": "81416597993",
      "orcid": "0000-0002-0476-3422"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    },
    {
      "name": "Matt Baillie Smith",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659575748",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Winfred Arthur, Winston Bennett, Pamela S. Edens, and Suzanne T. Bell. 2003. Effectiveness of training in organizations: A meta-analysis of design and evaluation features. Journal of Applied Psychology 88, 2 (2003), 234--245. DOI: http://dx.doi.org/10.1037/0021--9010.88.2.234",
      "doi": ""
    },
    {
      "text": "Stephen G Atkins. 2012. Smartening-up Voluntourism: SmartAid's Expansion of the Personality-focused Performance Requirements Form (PPRF). International Journal of Tourism Research 14, 4 (2012), 369--390. DOI: http://dx.doi.org/10.1002/jtr.875",
      "doi": ""
    },
    {
      "text": "Matt Baillie Smith and Nina Laurie. 2011. International volunteering and development: Global citizenship and neoliberal professionalisation today. Transactions of the Institute of British Geographers 36, 4 (2011), 545--559. DOI: http://dx.doi.org/10.1111/j.1475--5661.2011.00436.x",
      "doi": ""
    },
    {
      "text": "Tom Bartindale, Guy Schofield, Clara Crivellaro, and Peter Wright. 2016. TryFilm: Situated Support for Interactive Media Productions. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1412--1422. DOI: http://dx.doi.org/10.1145/2818048.2819929",
      "doi": "10.1145/2818048.2819929"
    },
    {
      "text": "Rosanna Bellini, Jay Rainey, Andrew Garbett, and Pamela Briggs. 2019. Vocalising Violence: Using Violent Mens' Voices for Service Delivery and Feedback. In Proceedings of the 9th International Conference on Communities & Technologies Transforming Communities (C&T '19). ACM, NY, NY, USA, 210--217. DOI: http://dx.doi.org/10.1145/3328320.3328405",
      "doi": "10.1145/3328320.3328405"
    },
    {
      "text": "Alex Bowyer, Kyle Montague, Stuart Wheater, Ruth McGovern, Raghu Lingam, and Madeline Balaam. 2018. Understanding the Family Perspective on the Storage, Sharing and Handling of Family Civic Data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, Vol. 18. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3173710",
      "doi": ""
    },
    {
      "text": "Paul Brand and Anke Schwittay. 2006. The missing piece: Human-driven design and research in ICT and development. In 2006 International Conference on Information and Communication Technology and Development, ICTD2006. 2--10. DOI: http://dx.doi.org/10.1109/ICTD.2006.301830",
      "doi": ""
    },
    {
      "text": "Virginia Braun, Victoria Clarke, Nikki Hayfield, and Gareth Terry. 2018. Thematic analysis. Handbook of research methods in health social sciences (2018), 1--18. DOI: http://dx.doi.org/https://doi.org/10.1007/978--981--10--2779--6_103--1",
      "doi": ""
    },
    {
      "text": "Ernest W Brewer, Jacquelyn O DeJonge, and Vickie J Stout. 2001. Moving to online: Making the transition from traditional instruction and communication strategies. Corwin Press.",
      "doi": ""
    },
    {
      "text": "Deana Brown and Rebecca E. Grinter. 2016. Designing for Transient Use: A Human-in-the-loop Translation Platform for Refugees. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/2858036.2858230",
      "doi": ""
    },
    {
      "text": "Jacqueline Butcher. 2003. A humanistic perspective on the volunteer-recipient relationship. In The values of volunteering. Springer, 111--125. DOI: http://dx.doi.org/10.1007/978--1--4615-0145--9_7",
      "doi": ""
    },
    {
      "text": "Hanna Celina, Ahmed Kharrufa, Anne Preston, Rob Comber, and Patrick Olivier. 2016. SOLE meets MOOC. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16. ACM Press, New York, New York, USA, 484--496. DOI: http://dx.doi.org/10.1145/2901790.2901848",
      "doi": "10.1145/2901790.2901848"
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The Ins and Outs of HCI for Development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2220--2232. DOI: http://dx.doi.org/10.1145/2858036.2858081",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. \"Yours is better!\": Participant response bias in HCI. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12 (2012), 1321--1330. DOI: http://dx.doi.org/10.1145/2207676.2208589",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Brian DeRenzi, Benjamin Birnbaum, Leah Findlater, Joachim Mangilima, Jonathan Payne, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving community health worker performance through automated SMS. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development - ICTD '12. ACM Press, New York, New York, USA, 25. DOI: http://dx.doi.org/10.1145/2160673.2160677",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Ll Dodson, S Sterling, and Jk Bennett. 2013. Minding the gaps: cultural, technical and gender-based barriers to mobile use in oral-language Berber communities in Morocco. Proceedings of the Sixth International Conference on Information and Communication Technologies and Development 1 (2013), 79--88. DOI: http://dx.doi.org/10.1145/2516604.2516626",
      "doi": "10.1145/2516604.2516626"
    },
    {
      "text": "Andy Dow, John Vines, Rob Comber, and Rob Wilson. 2016. ThoughtCloud: Exploring the role of feedback technologies in care organisations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3625--3636. DOI: http://dx.doi.org/10.1145/2858036.2858105",
      "doi": "10.1145/2858036.2858105"
    },
    {
      "text": "M Edwards. 1997. Organizational learning in non--governmental organizations: What have we learned? Public Administration and Development: The International Journal of Management Research and Practice 17, 2 (1997), 235--250. http://onlinelibrary.wiley.com/doi/10.1002/",
      "doi": ""
    },
    {
      "text": "I S Eimhjellen. 2014. Internet Communication: Does It Strengthen Local Voluntary Organizations? Nonprofit and Voluntary Sector. Nonprofit and Voluntary Sector Quarterly 43, 5 (2014), 890--909. DOI: http://dx.doi.org/10.1177/0899764013487996",
      "doi": ""
    },
    {
      "text": "Edim Azom Emmanuel. 2014. Speech User Interface for Low Literacy Users of Ict Services. European Journal of Computer Science and Information Technology 2, 1 (2014), 18--29.",
      "doi": ""
    },
    {
      "text": "Marie-Hélène Ferrer, Jacob Hodges, and Nathalie Bonnardel. 2013. The MoLE project. In Proceedings of the 31st European Conference on Cognitive Ergonomics - ECCE '13. ACM Press, New York, New York, USA, 1. DOI: http://dx.doi.org/10.1145/2501907.2501963",
      "doi": "10.1145/2501907.2501963"
    },
    {
      "text": "Henry Findley, Allison Reynolds, Bethany Davis, and William Belcher. 2013. Evolution of and current trends in training. Journal of Business and Economics 4, 8 (2013), 675--689. http://www.aabri.com/NO2013Manuscripts/NO13056.pdf",
      "doi": ""
    },
    {
      "text": "P.S. Foong, S. Zhao, F. Tan, and J.J. Williams. 2018. Harvesting caregiving knowledge: Design considerations for integrating volunteer input in dementia care. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018), 1--12. DOI: http://dx.doi.org/10.1145/3173574.3173653",
      "doi": "10.1145/3173574.3173653"
    },
    {
      "text": "J Kevin Ford and Tyler Meyer. 2014. Advances in training technology: Meeting the workplace challenges of talent development, deep specialization and collaborative learning. In The psychology of workplace technology, Michael D. Coovert and Lori Foster Thompson (Eds.). 43--76.",
      "doi": ""
    },
    {
      "text": "Kirrin Gill, Kim Brooks, Janna McDougall, Payal Patel, and Aslihan Kes. 2010. Bridging the gender divide. How technology can advance women economically. Technical Report. ICRW. https://www.icrw.org/publications/ bridging-the-gender-divide/",
      "doi": ""
    },
    {
      "text": "Trina Gorman, Emma Rose, Judith Yaaqoubi, Andrew Bayor, and Beth Kolko. 2011. Adapting usability testing for oral, rural users. In Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11. ACM Press, New York, New York, USA, 1437. DOI: http://dx.doi.org/10.1145/1978942.1979153",
      "doi": "10.1145/1978942.1979153"
    },
    {
      "text": "Tobias Grundgeiger and Julian Hester. 2017. Beyond Knowledge Acquisition : Medical Device Training as a Cooperative Process. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 187--190. DOI: http://dx.doi.org/10.1145/3022198.3026315",
      "doi": "10.1145/3022198.3026315"
    },
    {
      "text": "Nancy Hafkin, Nancy Taggart, and Others. 2001. Gender, information technology, and developing countries: An analytic study. Office of Women in Development, Bureau for Global Programs, Field Support and Research, United States Agency for International Development.",
      "doi": ""
    },
    {
      "text": "Emily Harburg, Julie Hui, Michael Greenberg, and Elizabeth M Gerber. 2015. Understanding the Effects of Crowdfunding on Entrepreneurial Self-Efficacy. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15. ACM Press, New York, New York, USA, 3--16. DOI: http://dx.doi.org/10.1145/2675133.2675142",
      "doi": "10.1145/2675133.2675142"
    },
    {
      "text": "Jesse M. Heines, Jeff L. Popyack, Briana Morrison, Kate Lockwood, and Doug Baldwin. 2015. Panel on Flipped Classrooms. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGCSE '15). ACM, NY, NY, USA, 174--175. DOI: http://dx.doi.org/10.1145/2676723.2677328",
      "doi": "10.1145/2676723.2677328"
    },
    {
      "text": "Kenneth T Henson. 1993. Methods and strategies for teaching in secondary and middle schools. Longman Publishing Group, New York.",
      "doi": ""
    },
    {
      "text": "Samuel Hickey and Giles Mohan. 2004. Participation--from tyranny to transformation?: Exploring new approaches to participation in development. Zed books, London, UK. DOI: http://dx.doi.org/10.1111/j.0012--155x.2005.00410.x",
      "doi": ""
    },
    {
      "text": "Julie S Hui and Elizabeth M Gerber. 2017. Developing Makerspaces as Sites of Entrepreneurship. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing CSCW '17. ACM Press, New York, New York, USA, 2023--2038. DOI: http://dx.doi.org/10.1145/2998181.2998264",
      "doi": "10.1145/2998181.2998264"
    },
    {
      "text": "Philip Ice, Reagan Curtis, Perry Phillips, and John Wells. 2007. Using Asynchronous Audio Feedback to Enhance Teaching Presence and Students' Sense of Community. Journal of Asynchronous Learning ... (2007), 3--25. DOI: http://dx.doi.org/10.24059/olj.v11i2.1724",
      "doi": ""
    },
    {
      "text": "International Federation of Red Cross and Red Crescent Societies. 2014. Global Review on Volunteering. Technical Report. https://www.ifrc.org/what-we-do/ volunteers/global-review-on-volunteering/",
      "doi": ""
    },
    {
      "text": "into23.com. 2019. Top 6 Asian Digital Trends in Digital 2019. https://into23.com/2019/05/29/ top-6-asian-trends-in-digital-2019/. (2019). [Online; accessed 09-August-2019].",
      "doi": ""
    },
    {
      "text": "Miyeon Jung, Ju Hwan Kim, Juhwan Kim, and Hyo-Jeong So. 2016. Mark-On: Encouraging Student Questions in Class. In Proceedings of HCI Korea 2016. 79--86. DOI: http://dx.doi.org/10.17210/hcik.2016.01.79",
      "doi": ""
    },
    {
      "text": "Cecilia Katzeff and Vanessa Ware. 2006. Video storytelling as mediation of organizational learning. NordiCHI '06 Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles October (2006), 311--320. DOI: http://dx.doi.org/10.1145/1182475.1182508",
      "doi": "10.1145/1182475.1182508"
    },
    {
      "text": "Jane Kaye, Edgar A Whitley, Nadja Kanellopoulou, Sadie Creese, Kay J Hughes, and David Lund. 2011. Dynamic consent: a solution to a perennial problem?. In BMC, Vol. 343. BMJ Publishing Group.",
      "doi": ""
    },
    {
      "text": "Konstantinos Kazakos, Siddhartha Asthana, Madeline Balaam, Mona Duggal, Amey Holden, Limalemla Jamir, Nanda Kishore Kannuri, Saurabh Kumar, Amarendar Reddy Manindla, Subhashini Arcot Manikam, G V S Murthy, Papreen Nahar, Peter Phillimore, Shreyaswi Sathyanath, Pushpendra Singh, Meenu Singh, Pete Wright, Deepika Yadav, and Patrick Olivier. 2016. A Real-Time IVR Platform for Community Radio. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 343--354. DOI: http://dx.doi.org/10.1145/2858036.2858585",
      "doi": "10.1145/2858036.2858585"
    },
    {
      "text": "Kemp, Simon. 2019. Digital trends 2019: Every single stat you need to know about the internet. https://bit.ly/35VfSuE. (2019). [Online; accessed 09-August-2019].",
      "doi": ""
    },
    {
      "text": "Zahir Koradia, Piyush Aggarwal, Luthra Gaurav, and Aaditeshwar Seth. 2013. Gurgaon Idol : A singing competition over Community Radio and IVRS. Dev (2013). DOI: http://dx.doi.org/10.1145/2442882.2442890",
      "doi": ""
    },
    {
      "text": "M Kristensen, M Kyng, and L Palen. 2006. Participatory Design in Emergency Medical Service : Designing for Future Practice. Proceedings of the SIGCHI conference on Human factors in computing systems (2006), 161--170. DOI: http://dx.doi.org/10.1145/1124772.1124798",
      "doi": "10.1145/1124772.1124798"
    },
    {
      "text": "Kari Kuutti and Liam J Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3543--3552. DOI: http://dx.doi.org/10.1145/2556288.2557111",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Stephan Lukosch, Michael Klebl, and Tanja Buttler. 2011. Utilizing Verbally Told Stories for Informal Knowledge Management. Group Decision and Negotiation 20, 5 (2011), 615--642. DOI: http://dx.doi.org/10.1007/s10726-011--9237--7",
      "doi": ""
    },
    {
      "text": "Meghana Marathe, Jacki O'Neill, Paromita Pain, and William Thies. 2015. Revisiting CGNet Swara and its impact in rural India. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development - ICTD '15. ACM Press, New York, New York, USA, 1--10. DOI: http://dx.doi.org/10.1145/2737856.2738026",
      "doi": "10.1145/2737856.2738026"
    },
    {
      "text": "Wilbert McKeachie and Marilla Svinicki. 2010. McKeachie's teaching tips: Strategies, research, and theory for college and university teachers. Cengage Learning. 416 pages.",
      "doi": ""
    },
    {
      "text": "Indrani Medhi, Somani Patnaik, Emma Brunskill, S.N. Nagasena Gautama, William Thies, and Kentaro Toyama. 2011. Designing mobile interfaces for novice and low-literacy users. ACM Transactions on Computer-Human Interaction 18, 1 (apr 2011), 1--28. DOI: http://dx.doi.org/10.1145/1959022.1959024",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Indrani Medhi-Thies, Pedro Ferreira, Nakull Gupta, Jacki O'Neill, and Edward Cutrell. 2015. KrishiPustak: A Social Networking System for Low-Literate Farmers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1670--1681. DOI: http://dx.doi.org/10.1145/2675133.2675224",
      "doi": "10.1145/2675133.2675224"
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner, and William Thies. 2013. Swara : A Voice Forum for Citizen Journalism in Rural India. International Conference on Information and Communication Technologies and Development 9, 2 (2013), 65--79. DOI: http://dx.doi.org/10.1145/2160673.2160695",
      "doi": ""
    },
    {
      "text": "Michael J Muller. 2009. Participatory design: the third space in HCI. In Human-computer interaction. CRC press, 181--202. DOI: http://dx.doi.org/10.1201/9781420088892.ch9",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt and Philip Cohen. 2000. Perceptual user interfaces: multimodal interfaces that process what comes naturally. Commun. ACM 43, 3 (mar 2000), 45--53. DOI: http://dx.doi.org/10.1145/330534.330538",
      "doi": "10.1145/330534.330538"
    },
    {
      "text": "L Patel. 2010. ASTD State of the industry report 2010. Alexandria, VA: American Society for Training & Development (2010).",
      "doi": ""
    },
    {
      "text": "N Patel, D Chittamuru, A Jain, P Dave, and T S Parikh. 2010. Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. In Proceedings of the 28th International Conference on Human Factors in Computing Systems - CHI '10. 733--742. DOI: http://dx.doi.org/10.1145/1753326.1753434",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Gregory C. Petty and Ernest W. Brewer. 2011. Comparing Lecturing and Small Group Discussions. Encyclopedia of Information Communication Technologies and Adult Education Integration (2011), 396--414. DOI: http://dx.doi.org/10.4018/978--1--61692--906-0.ch024",
      "doi": ""
    },
    {
      "text": "Gregory C Petty, Doo H Lim, and Jeff Zulauf. 2007. Training Transfer between CD-ROM Based Instruction and Traditional Classroom Instruction. Journal of Technology Studies 33, 1 (2007), 48--56.",
      "doi": ""
    },
    {
      "text": "V Pipek, V Wulf, and A Johri. 2012. Bridging artifacts and actors: Expertise sharing in organizational ecosystems. Computer Supported Cooperative Work 21, 2--3 (2012), 261--282. DOI: http://dx.doi.org/10.1007/s10606-011--9138-y",
      "doi": "10.1007/s10606-011-9138-y"
    },
    {
      "text": "Jay Rainey, Kyle Montague, Pamela Briggs, Robert Anderson, Thomas Nappey, and Patrick Olivier. 2019. Gabber: Supporting Voice in Participatory Qualitative Practices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 377, 377:1--377:12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300607",
      "doi": "10.1145/3290605.3300607"
    },
    {
      "text": "Eliza Marguerite Raymond and C Michael Hall. 2008. The Development of Cross-Cultural (Mis)Understanding Through Volunteer Tourism. Journal of Sustainable Tourism 16, 5 (dec 2008), 530. DOI: http://dx.doi.org/10.2167/jost796.0",
      "doi": ""
    },
    {
      "text": "Aa Raza, Farhan Ul Haq, and Zain Tariq. 2013. Job opportunities through entertainment: virally spread speech-based services for low-literate users. Proceedings of the ... (2013), 2803--2812. DOI: http://dx.doi.org/10.1145/2470654.2481389",
      "doi": ""
    },
    {
      "text": "Eduardo Salas and Janis A Cannon-bowers. 2001. The Science of Training: A Decade of Progress. Annual review of psychology (2001). DOI: http://dx.doi.org/10.1146/annurev.psych.52.1.471",
      "doi": ""
    },
    {
      "text": "Eduardo Salas, Scott I Tannenbaum, Kurt Kraiger, and Kimberly A Smith-jentsch. 2012. The Science of Training and Development in Organizations : What Matters in Practice. Psychological Science in the Public Interest 13, 2 (2012), 74--101. DOI: http://dx.doi.org/10.2307/23484697",
      "doi": ""
    },
    {
      "text": "T Schümmer and J M Haake. 2008. Supporting Social Practice Learning in NGOs. In Proceedings of the hypertext 2008 workshop on Collaboration and collective intelligence. 17--21. DOI: http://dx.doi.org/10.1145/1379157.1379163",
      "doi": "10.1145/1379157.1379163"
    },
    {
      "text": "Jahanzeb Sherwani, Nosheen Ali, Carolyn Penstein Rosé, and Roni Rosenfeld. 2009a. Orality-grounded HCID: Understanding the oral user. Information Technologies & International Development 5, 4 (2009), pp--37.",
      "doi": ""
    },
    {
      "text": "Jahanzeb Sherwani, Sooraj Palijo, Sarwat Mirza, Tanveer Ahmed, Nosheen Ali, and Roni Rosenfeld. 2009b. Speech vs. touch-tone: Telephony interfaces for information access by low literate users. 2009 International Conference on Information and Communication Technologies and Development, ICTD 2009 - Proceedings (2009), 447--457. DOI: http://dx.doi.org/10.1109/ictd.2009.5426682",
      "doi": ""
    },
    {
      "text": "Cláudia Silva, Valentina Nisi, and Joseph D Straubhaar. 2017. Share Yourself First: Exploring Strategies for the Creation of Locative Content for and by Low-literacy Communities. Proceedings of the 8th International Conference on Communities and Technologies (2017), 236--245. DOI: http://dx.doi.org/10.1145/3083671.3083698",
      "doi": "10.1145/3083671.3083698"
    },
    {
      "text": "Brian Keith Simpkins. 2015. First Responder Training Transfer: Does Training delivery method matter? Ph.D. Dissertation. Eastern Kentucky University. http://encompass.eku.edu/etd/425/",
      "doi": ""
    },
    {
      "text": "K Smith, H Hamerton, S Hunt, and RJ Sargisson. 2016. Local volunteers respond to the Rena oil spill in Maketu, ¯ New Zealand. In K¯ otuitui: New Zealand Journal of Social Sciences Online. Vol. 11. 1--10. DOI: http://dx.doi.org/10.1080/1177083X.2015.1009474",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design within a patriarchal society: Opportunities and challenges in designing for rural women in bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 536. DOI: http://dx.doi.org/10.1145/3173574.3174110",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Reem Talhouk, Sandra Mesmar, Anja Thieme, Madeline Balaam, Patrick Olivier, Chaza Akik, and Hala Ghattas. 2016. Syrian Refugees and Digital Health in Lebanon. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 331--342. DOI: http://dx.doi.org/10.1145/2858036.2858331",
      "doi": "10.1145/2858036.2858331"
    },
    {
      "text": "Max Van Manen. 2016. Researching lived experience: Human science for an action sensitive pedagogy. Routledge, New York, USA. DOI: http://dx.doi.org/10.29173/pandp15124",
      "doi": ""
    },
    {
      "text": "Delvin Varghese, Patrick Olivier, and Madeline Balaam. 2017. Citizen Tagger: Exploring social tagging of conversational audio. In IFIP Conference on Human-Computer Interaction. Mumbai, 116--125. DOI: http://dx.doi.org/10.1007/978--3--319--68059-0_7",
      "doi": "10.1007/978-3-319-68059-0_7"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet Swara. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 417--426. DOI: http://dx.doi.org/10.1145/2702123.2702191",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, and Peter Wright. 2013. Configuring participation: on how we involve people in design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 20, 1 (2013), 429--438. DOI: http://dx.doi.org/10.1016/S0142--694X(98)00026-X",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Frederick Weber, Kalika Bali, Roni Rosenfeld, and Kentaro Toyama. 2008. Unexplored directions in spoken language technology for development. In 2008 IEEE Spoken Language Technology Workshop, Vol. 81. 1--4. DOI: http://dx.doi.org/10.1109/SLT.2008.4777825",
      "doi": ""
    },
    {
      "text": "N Winters and K Toyama. 2009. From the Guest Editors: Human-Computer Interaction for Development: Mapping the Terrain. Information Technologies and International Development 5, 4 (2009), iII--viii.",
      "doi": ""
    },
    {
      "text": "Worth, Jonathan. 2016. Connecting Classes #CClasses. https://jonathanworth.org/connecting_classes/. (2016). [Online; accessed 09-August-2019].",
      "doi": ""
    },
    {
      "text": "Barry J. Zimmerman. 2000. Self-Efficacy: An Essential Motive to Learn. Contemporary Educational Psychology 25, 1 (2000), 82--91. DOI: http://dx.doi.org/10.1006/ceps.1999.1016",
      "doi": ""
    }
  ]
}