{
  "doi": "10.1145/3313831.3376283",
  "title": "Nationality and Gender Biases in Multicultural Online Learning Environments: The Effects of Anonymity",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Online learning environments eliminate geographical barriers and enable new forms of collaboration between students at large scale. Self-presentation within such environments affects how students interact with learning content and with each other. We explore how anonymity/identifiability in user profile design impacts student interactions in a large multicultural classroom across two geographical locations. After triangulating 150,000 online interactions with questionnaires and focus groups, we provide three major findings. First, being identifiable had a significant impact on how students accessed and rated content created by their peers. Second, when identifiable, cultural differences became more prominent, leading some students to avoid content created by classmates of certain nationalities. Finally, when students interacted with their real identities, there were significant and negative gender effects which were absent when students were anonymous. These findings contribute to our understanding of social dynamics within multicultural learning environments, and raise practical implications for tool design.",
  "tags": [
    "gender bias",
    "oles",
    "peerwise",
    "nationality bias",
    "online learning environments",
    "computer-mediated communication",
    "peer ratings",
    "anonymity",
    "identity",
    "online education",
    "vles"
  ],
  "authors": [
    {
      "name": "Gabriela Morales-Martinez",
      "institution": "The University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526419",
      "orcid": "missing"
    },
    {
      "name": "Paul Latreille",
      "institution": "The University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529428",
      "orcid": "missing"
    },
    {
      "name": "Paul Denny",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81361598505/rel-imgonly/paul.jpg",
      "acmid": "81361598505",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Khalid Al-Sulaiti and Michael J. Baker. 1998. Country of origin effects: a literature review. Marketing Intelligence & Planning 16, 3 (jan 1998), 150--199. DOI: http://dx.doi.org/10.1108/02634509810217309",
      "doi": ""
    },
    {
      "text": "Maryam Alavi and R. Brent Gallupe. 2011. Using Information Technology in Learning: Case Studies in Business and Management Education Programs. Academy of Management Learning & Education 2, 2 (2011), 139--153. DOI: http://dx.doi.org/10.5465/amle.2003.9901667",
      "doi": ""
    },
    {
      "text": "Philip G. Altbach, Liz Reisberg, and Laura E. Rumbley. 2009. Trends in Global Higher Education: Tracking an Academic Revolution. Technical Report. 22 pages. DOI: http://dx.doi.org/10.1016/j.bse.2004.04.006",
      "doi": ""
    },
    {
      "text": "Yair Amichai-Hamburger, Béatrice S. Hasler, and Tal Shani-Sherman. 2015. Structured and Unstructured Intergroup Contact in the Digital Age. Comput. Hum. Behav. 52, C (Nov. 2015), 515--522. DOI: http://dx.doi.org/10.1016/j.chb.2015.02.022",
      "doi": ""
    },
    {
      "text": "John A. Bargh, Katelyn Y. A. McKenna, and Grainne M. Fitzsimons. 2002. Can You See the Real Me? Activation and Expression of the \"True Self\" on the Internet. Journal of Social Issues 58, 1 (2002), 33--48. DOI: http://dx.doi.org/10.1111/1540--4560.00247",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2008. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2008), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Julia Cambre, Scott Klemmer, and Chinmay Kulkarni. 2018. Juxtapeer: Comparative Peer Review Yields Higher Quality Feedback and Promotes Deeper Reflection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 294, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173868",
      "doi": "10.1145/3173574.3173868"
    },
    {
      "text": "Calvin Chan, Mamata Bhandar, Lih-Bin Oh, and Hock-Chuan Chan. 2004. Recognition and Participation in a Virtual Community. Hawaii International Conference on System Sciences 7 (2004), 70194b. DOI: http://dx.doi.org/10.1109/HICSS.2004.1265460",
      "doi": ""
    },
    {
      "text": "Andrea Chester and Gillian Gwynne. 1998. Online Teaching: Encouraging Collaboration through Anonymity. Journal of Computer-Mediated Communication 4, 2 (1998). DOI: http://dx.doi.org/10.1111/j.1083--6101.1998.tb00096.x",
      "doi": ""
    },
    {
      "text": "James M. Conway and Charles E. Lance. 2010. What reviewers should expect from authors regarding common method bias in organizational research. Journal of Business and Psychology 25, 3 (2010), 325--334. DOI: http://dx.doi.org/10.1007/s10869-010--9181--6",
      "doi": ""
    },
    {
      "text": "Joost C. F. de Winter and Dimitra Dodou. 2010. Five-Point Likert Items: t test versus Mann-Whitney-Wilcoxon. Practical Assessment, Research & Evaluation 15, 11 (2010), 1--16. DOI: http://dx.doi.org/citeulike-article-id:10781922",
      "doi": ""
    },
    {
      "text": "Chrysanthos Dellarocas. 2003. The Digitization of Word of Mouth: Promise and Challenges of Online Feedback Mechanisms. Management Science 49, 10 (2003), 1407--1424. DOI: http://dx.doi.org/10.1287/mnsc.49.10.1407.17308",
      "doi": "10.1287/mnsc.49.10.1407.17308"
    },
    {
      "text": "Paul Denny. 2015. Generating Practice Questions As a Preparation Strategy for Introductory Programming Exams. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGCSE '15). ACM, NY, NY, USA, 278--283. DOI: http://dx.doi.org/10.1145/2676723.2677253",
      "doi": "10.1145/2676723.2677253"
    },
    {
      "text": "Paul Denny, John Hamer, Andrew Luxton-Reilly, and Helen Purchase. 2008. PeerWise: Students Sharing Their Multiple Choice Questions. In Proceedings of the Fourth International Workshop on Computing Education Research (ICER '08). Association for Computing Machinery, New York, NY, USA, 51--58. DOI: http://dx.doi.org/10.1145/1404520.1404526",
      "doi": "10.1145/1404520.1404526"
    },
    {
      "text": "Paul Denny, Fiona McDonald, Ruth Empson, Philip Kelly, and Andrew Petersen. 2018. Empirical Support for a Causal Relationship Between Gamification and Learning Outcomes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 311, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173885",
      "doi": "10.1145/3173574.3173885"
    },
    {
      "text": "Paul Denny, Ewan Tempero, Dawn Garbett, and Andrew Petersen. 2017. Examining a Student-Generated Question Activity Using Random Topic Assignment. In Proceedings of the 2017 ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE '17). ACM, NY, NY, USA, 146--151. DOI: http://dx.doi.org/10.1145/3059009.3059033",
      "doi": "10.1145/3059009.3059033"
    },
    {
      "text": "Karen M. Douglas and Craig McGarty. 2001. Identifability and self-presentation : Computer-mediated communication and intergroup interaction. British Journal of Social Psychology 40 (2001), 399--416. DOI: http://dx.doi.org/10.1348/014466601164894",
      "doi": ""
    },
    {
      "text": "Jacob Eisenberg, Hyun-Jung Lee, Frank Brück, Barbara Brenner, Marie-Therese Claes, Jacek Mironski, and Roger Bell. 2013. Can business schools make students culturally competent? Effects of cross-cultural management courses on cultural intelligence. Academy of Management Learning and Education 12, 4 (2013), 603--621. DOI: http://dx.doi.org/10.5465/amle.2012.0022",
      "doi": ""
    },
    {
      "text": "Robin J. Ely, Herminia Ibarra, and Deborah M. Kolb. 2011. Taking Gender Into Account: Theory and Design for Women's Leadership Development Programs. Academy of Management Learning and Education 10, 3 (2011), 474--493. DOI: http://dx.doi.org/10.5465/amle.2010.0046",
      "doi": ""
    },
    {
      "text": "Miriam Erez, Alon Lisak, Raveh Harush, Ella Glikson, Rikki Nouri, and Efrat Shokef. 2013. Going global: Developing management students'cultural intelligence and global identity in culturally diverse virtual teams. Academy of Management Learning and Education 12, 3 (2013), 330--355. DOI: http://dx.doi.org/10.5465/amle.2012.0200",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A. Kellogg. 2000. Social Translucence: An Approach to Designing Systems That Support Social Processes. ACM Trans. Comput.-Hum. Interact. 7, 1 (March 2000), 59--83. DOI: http://dx.doi.org/10.1145/344949.345004",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Golpira Eshghi. 1985. Nationality Bias and Performance Evaluation in Multinational Corporations. Academy of Management Proceedings 1985, 1 (1985), 93--97. DOI: http://dx.doi.org/10.5465/ambpp.1985.4978719",
      "doi": ""
    },
    {
      "text": "Andy Field. 2013. Discovering Statistics Using IBM SPSS Statistics (4th edition ed.). Sage Publications. 422 pages.",
      "doi": "10.5555/2502692"
    },
    {
      "text": "Andrea Forte, Nazanin Andalibi, and Rachel Greenstadt. 2017. Privacy, Anonymity, and Perceived Risk in Open Collaboration. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17 (2017), 1800--1811. DOI: http://dx.doi.org/10.1145/2998181.2998273",
      "doi": "10.1145/2998181.2998273"
    },
    {
      "text": "Cristina B. Gibson and Jennifer L. Gibbs. 2006. Unpacking the Concept of Virtuality: The Effects of Geographic Dispersion, Electronic Dependence, Dynamic Structure, and National Diversity on Team Innovation. Administrative Science Quarterly 51, 3 (2006), 451--495. DOI: http://dx.doi.org/10.2189/asqu.51.3.451",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The presentation of self in everyday life. Penguin-1990, London. 247 pages.",
      "doi": ""
    },
    {
      "text": "Dale Hancock, Nicole Hare, Paul Denny, and Gareth Denyer. 2018. Improving large class performance and engagement through student-generated question banks. Biochemistry and Molecular Biology Education 46, 4 (2018), 306--317. DOI: http://dx.doi.org/10.1002/bmb.21119",
      "doi": ""
    },
    {
      "text": "Madeline E. Heilman. 2012. Gender stereotypes and workplace bias. Research in Organizational Behavior 32 (2012), 113 -- 135. DOI: http://dx.doi.org/https://doi.org/10.1016/j.riob.2012.11.003",
      "doi": ""
    },
    {
      "text": "Christopher Plekss Hoadley. 2002. Creating context: Design-based research in creating and understanding CSCL. Engineering Education (2002), 453--462.",
      "doi": ""
    },
    {
      "text": "Ian Hosack. 2003. The effects of anonymous feedback on Japanese university students' attitudes towards peer review. Ritsumeikanhougaku bessatsu 1 (2003), 297--322. http://www.ritsumei.ac.jp/acd/cg/law/lex/ kotoba04/IanHosack.pdf",
      "doi": ""
    },
    {
      "text": "Craig D. Howard, Andrew F. Barrett, and Theodore W. Frick. 2010. Anonymity to Promote Peer Feedback: Pre-Service Teachers' Comments in Asynchronous Computer-Mediated Communication. Journal of Educational Computing Research 43, 1 (2010), 89--112. DOI: http://dx.doi.org/10.2190/EC.43.1.f",
      "doi": ""
    },
    {
      "text": "Michael Inzlicht and Talia Ben-Zeev. 2003. Do High-Achieving Female Students Underperform in Private? The Implications of Threatening Environments on Intellectual Processing. Journal of Educational Psychology 95, 4 (2003), 796--805.",
      "doi": ""
    },
    {
      "text": "Li-Ning Huang Hayg Oshagan J. Michael Jaffe Young-Eum Lee. 1999. Gender Identification, Interdependence, and Pseudonyms in CMC: Language Patterns in an Electronic Conference. The Information Society 15, 4 (1999), 221--234. DOI: http://dx.doi.org/10.1080/019722499128385",
      "doi": ""
    },
    {
      "text": "Andreas M. Kaplan and Michael Haenlein. 2010. Users of the world, unite! The challenges and opportunities of Social Media. Business Horizons 53, 1 (2010), 59--68. DOI: http://dx.doi.org/10.1016/j.bushor.2009.09.003",
      "doi": ""
    },
    {
      "text": "Matthew R. Kelley, Elizabeth K. Chapman-Orr, Susanna Calkins, and Robert J. Lemke. 2019. Generation and Retrieval Practice Effects in the Classroom Using PeerWise. Teaching of Psychology 46, 2 (2019), 121--126. DOI: http://dx.doi.org/10.1177/0098628319834174",
      "doi": ""
    },
    {
      "text": "Jan H. Kietzmann, Kristopher Hermkens, Ian P. McCarthy, and Bruno S. Silvestre. 2011. Social media? Get serious! Understanding the functional building blocks of social media. Business Horizons 54, 3 (2011), 241--251. DOI: http://dx.doi.org/10.1016/j.bushor.2011.01.005",
      "doi": ""
    },
    {
      "text": "Jan H Kietzmann, Bruno S Silvestre, Ian P Mccarthy, and Leyland F Pitt. 2012. Unpacking the social media phenomenon: towards a research agenda. Journal of Public Affairs 12, 2 (2012), 109--119. DOI: http://dx.doi.org/10.1002/pa.1412",
      "doi": ""
    },
    {
      "text": "Peter G Kilner and Christopher M Hoadley. 2005. Anonymity options and professional participation in an online community of practice. In Proceedings of the International Conference on Computer Supported Collaborative Learning 2005. 272--280. https://dl.acm.org/citation.cfm?id=1149328",
      "doi": ""
    },
    {
      "text": "René F Kizilcec and Andrew J Saltarelli. 2019. Psychologically Inclusive Design: Cues Impact Women's Participation in STEM Education. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 474:1--474:10. DOI: http://dx.doi.org/10.1145/3290605.3300704",
      "doi": ""
    },
    {
      "text": "Lan Li. 2017. The role of anonymity in peer assessment. Assessment and Evaluation in Higher Education 42, 4 (2017), 645--656. DOI: http://dx.doi.org/10.1080/02602938.2016.1174766",
      "doi": ""
    },
    {
      "text": "Ruiling Lu and Linda Bol. 2007. A Comparison of Anonymous Versus Identifiable e-Peer Review on College Student Writing Performance and the Extent of Critical Feedback. Journal of Interactive Online Learning 6, 2 (2007), 100--115. DOI: http://dx.doi.org/10.1017/CBO9781107415324.004",
      "doi": ""
    },
    {
      "text": "Lillian MacNell, Adam Driscoll, and Andrea Hunt. 2015. What's in a Name: Exposing Gender Bias in Student Ratings of Teaching. Innovative Higher Education 40, 4 (2015), 291--303.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Benjamin Mako Hill, Rachel Greenstadt, and Andrea Forte. 2019. Privacy, Anonymity, and Perceived Risk in Open Collaboration: A Study of Service Providers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 671:1--671:12. DOI: http://dx.doi.org/10.1145/3290605.3300901",
      "doi": ""
    },
    {
      "text": "Paola Medel and Vahab Pournaghshband. 2017. Eliminating Gender Bias in Computer Science Education Materials. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education (SIGCSE '17). ACM, NY, NY, USA, 411--416. DOI: http://dx.doi.org/10.1145/3017680.3017794",
      "doi": "10.1145/3017680.3017794"
    },
    {
      "text": "Ma Meng and Ritu Agarwal. 2007. Through a glass darkly: Information technology design, identity verification, and knowledge contribution in online communities. Information Systems Research 18, 1 (2007), 42--67. DOI: http://dx.doi.org/10.1287/isre.1070.0113",
      "doi": "10.1287/isre.1070.0113"
    },
    {
      "text": "David R Millen and John F Patterson. 2003. Identity Disclosure and the Creation of Social Capital. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 720--721. DOI: http://dx.doi.org/10.1145/765891.765950",
      "doi": ""
    },
    {
      "text": "Terumi Miyazoe and Terry Anderson. 2011. Anonymity in Blended Learning: Who Would You Like to Be? Journal of Educational Technology & Society 14, 2 (2011), 175--187. https://www.jstor.org/stable/10.2307/jeductechsoci.14.2.175",
      "doi": ""
    },
    {
      "text": "Mary C. Murphy, Claude M. Steele, and James J. Gross. 2007. Signaling Threat: How Situational Cues Affect Women in Math, Science, and Engineering Settings. Psychological Science 18, 10 (2007), 879--885. DOI: http://dx.doi.org/10.1111/j.1467--9280.2007.01995.x",
      "doi": ""
    },
    {
      "text": "Rikki Nouri, Miriam Erez, Thomas Rockstuhl, Soon Ang, Lee Leshem-Calif, and Anat Rafaeli. 2013. Taking the bite out of culture: The impact of task structure and task type on overcoming impediments to cross-cultural team performance. Journal of Organizational Behavior 34, 6 (2013), 739--763.",
      "doi": ""
    },
    {
      "text": "Lindsay Redpath. 2012. Confronting the bias against on-line learning in management education. Academy of Management Learning and Education 11, 1 (2012), 125--140. DOI: http://dx.doi.org/10.5465/amle.2010.0044",
      "doi": ""
    },
    {
      "text": "Christoph Riedl, Ivo Blohm, Jan Marco Leimeister, and Helmut Krcmar. 2010. Rating Scales for Collective Intelligence in Innovation Communities: Why Quick and Easy Decision Making Does Not Get it Right. Thirty First International Conference on Information Systems (2010), 98--104. DOI: http://dx.doi.org/10.2139/ssrn.1714524",
      "doi": ""
    },
    {
      "text": "Christoph Riedl, Ivo Blohm, Jan Marco Leimeister, and Helmut Krcmar. 2013. The Effect of Rating Scales on Decision Quality and User Attitudes in Online Innovation Communities. International Journal of Electronic Commerce 17, 3 (2013), 7--36. DOI: http://dx.doi.org/10.2753/JEC1086--4415170301",
      "doi": ""
    },
    {
      "text": "Bart Rienties, Simon Beausaert, Therese Grohnert, Susan Niemantsverdriet, and Piet Kommers. 2012. Understanding academic performance of international students: the role of ethnicity, academic and social integration. Higher Education 63, 6 (June 2012), 685--700.",
      "doi": ""
    },
    {
      "text": "Henry L. Roediger and Andrew C. Butler. 2011. The Critical Role of Retrieval Practice in Long-Term Retention. Trends in Cognitive Sciences 15, 1 (2011), 20 -- 27. DOI: http://dx.doi.org/10.1016/j.tics.2010.09.003",
      "doi": ""
    },
    {
      "text": "Henry L. Roediger and Andrew C. Butler. 2013. Retrieval Practice (Testing) Effect. In H. L. Pashler (Ed.), Encyclopedia of the Mind, Sage Publishing Co. (2013), 660--661.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Amna Batool, Nova Ahmed, Tara Matthews, Kurt Thomas, Laura Sanely Gaytán-Lugo, David Nemer, Elie Bursztein, Elizabeth Churchill, and Sunny Consolvo. 2019. They Don't Leave Us Alone Anywhere We Go: Gender and Digital Abuse in South Asia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, 2:1--2:14. DOI: http://dx.doi.org/10.1145/3290605.3300232",
      "doi": "10.1145/3290605.3300232"
    },
    {
      "text": "Hope Jensen Schau and Mary C. Gilly. 2003. We Are What We Post? Self-Presentation in Personal Web Space. Journal of Consumer Research 30, 3 (2003), 385--404. DOI: http://dx.doi.org/10.1086/378616",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Eshwar Chandrasekharan, Christina A Masden, Amy S Bruckman, W Keith Edwards, and Rebecca E Grinter. 2017. Situated Anonymity: Impacts of Anonymity, Ephemerality, and Hyper-Locality on Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6912--6924. DOI: http://dx.doi.org/10.1145/3025453.3025682",
      "doi": "10.1145/3025453.3025682"
    },
    {
      "text": "Dhawal Shah. 2019. Year of MOOC-based Degrees: A Review of MOOC Stats and Trends in 2018. (2019). https://www.edsurge.com/news/",
      "doi": ""
    },
    {
      "text": "Geoffrey M. Stephenson. 1981. Intergroup Bargaining and Negotiation. In Intergroup Behaviour (reprinted ed.), J C Turner and H Giles (Eds.). Basil Blackwell, Oxford, Chapter 6, 277. https://books.google.co.uk/books?id=FVCIQgAACAAJ",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The Online Disinhibition Effect. CyberPsychology & Behavior 7, 3 (2004), 321--326. DOI: http://dx.doi.org/10.1089/1094931041291295",
      "doi": ""
    },
    {
      "text": "John R Suler. 2002. Identity Management in Cyberspace. Journal of Applied Psychoanalytic Studies 4, 4 (2002), 455--459. DOI: http://dx.doi.org/10.1023/A:1020392231924",
      "doi": ""
    },
    {
      "text": "Nabil Sultan and Sylvia van de Bunt-Kokhuis. 2014. Transcultural Challenges for Open Online Learning. Academy of Management Proceedings 2014, 1 (jan 2014), 12715. DOI: http://dx.doi.org/10.5465/ambpp.2014.12715abstract",
      "doi": ""
    },
    {
      "text": "Na Sun, Mary Beth Rosson, and John M. Carroll. 2018. Where is Community Among Online Learners?: Identity, Efficacy and Personal Ties. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 292, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173866",
      "doi": ""
    },
    {
      "text": "Henri Tajfel. 1974. Social identity and intergroup behaviour. Social Science Information 13, 2 (1974), 65--93. DOI: http://dx.doi.org/10.1177/053901847401300204",
      "doi": ""
    },
    {
      "text": "Henry Tajfel. 1978. Differentiation between social groups: studies in the social psychology of intergroup relations. Academic Press, London. 474 pages. https://books.google.co.uk/books?id=Cfi2AAAAIAAJ",
      "doi": ""
    },
    {
      "text": "H Tajfel and J Turner. 1979. An Integrative Theory of Intergroup Conflict. In The Social Psychology of Intergroup Relations, William G. Austin and Stephen Worchel (Eds.). Brooks/Cole Pub. Co., Chapter 3, 33--47. DOI: http://dx.doi.org/10.1016/S0065--2601(05)37005--5",
      "doi": ""
    },
    {
      "text": "Jacob Thebault-Spieker, Daniel Kluver, Maximilian A. Klein, Aaron Halfaker, Brent Hecht, Loren Terveen, and Joseph A. Konstan. 2017. Simulation Experiments on (the Absence of) Ratings Bias in Reputation Systems. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article Article 101 (Dec. 2017), 25 pages. DOI: http://dx.doi.org/10.1145/3134736",
      "doi": ""
    },
    {
      "text": "William M. K. Trochim, James P. Donnelly, and Kanika. Arora. 2016. Research Methods: The Essential Knowledge Base (2nd edition ed.). Cengage Learning. 422 pages.",
      "doi": ""
    },
    {
      "text": "John C Turner. 1984. Social identification and psychological group formation. In The Social Dimension: European Developments in Social Psychology. European Studies in Social Psychology, Vol. 2. Cambridge University Press, Cambridge, 518--538. DOI: http://dx.doi.org/DOI:10.1017/CBO9780511759154.008",
      "doi": ""
    },
    {
      "text": "John C. Turner and Katherine J. Reynolds. 2012. Self-categorization theory. In Handbook of Theories of Social Psychology. Number January 2012. 399--417. DOI: http://dx.doi.org/10.4135/9781446249222.n46",
      "doi": ""
    },
    {
      "text": "Bogdan Vasilescu, Andrea Capiluppi, and Alexander Serebrenik. 2013. Gender, Representation and Online Participation: A Quantitative Study. Interacting with Computers 26, 5 (09 2013), 488--511. DOI: http://dx.doi.org/10.1093/iwc/iwt047",
      "doi": ""
    },
    {
      "text": "Mihaela Vorvoreanu, Lingyi Zhang, Yun-Han Huang, Claudia Hilderbrand, Zoe Steine-Hanson, and Margaret Burnett. 2019. From Gender Biases to Gender-Inclusive Design: An Empirical Investigation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). ACM, NY, NY, USA, 53:1--53:14. DOI: http://dx.doi.org/10.1145/3290605.3300283",
      "doi": ""
    },
    {
      "text": "Colleen Ward, Yutaka Okura, Antony Kennedy, and Takahiro Kojima. 1998. The U-Curve on trial: a longitudinal study of psychological and sociocultural adjustment during Cross-Cultural transition. International Journal of Intercultural Relations 22, 3 (1998), 277--291.",
      "doi": ""
    },
    {
      "text": "Jonathan Whitaker, J. Randolph New, and R. Duane Ireland. 2016. MOOCs and the Online Delivery of Business Education What's new? What's not? What now? Academy of Management Learning & Education 15, 2 (2016), 345--365. DOI: http://dx.doi.org/10.5465/amle.2013.0021",
      "doi": ""
    },
    {
      "text": "David Wilkinson and Mike Thelwall. 2012. Trending Twitter Topics in English: An International Comparison. Journal of the American Society for Information Science and Technology 63, 8 (2012), 1631--1646. DOI: http://dx.doi.org/10.1002/asi.22713",
      "doi": "10.1002/asi.22713"
    },
    {
      "text": "Martin Wood, Jon Hales, Susan Purdon, Tanja Sejersen, and Oliver Hayllar. 2009. A test for racial discrimination in recruitment practice in British cities. Department for Work and Pensions Research Report No 607 607 (2009), 1--69. http://www.natcen.ac.uk/media/20541/ test-for-racial-discrimination.pdf",
      "doi": ""
    },
    {
      "text": "Shanyang Zhao, Sherri Grasmuck, and Jason Martin. 2008. Identity construction on Facebook: Digital empowerment in anchored relationships. Computers in Human Behavior 24, 5 (2008), 1816--1836. DOI: http://dx.doi.org/10.1016/j.chb.2008.02.012",
      "doi": "10.1016/j.chb.2008.02.012"
    },
    {
      "text": "Y Zhou, D Jindal-Snape, K Topping, and J Todman. 2008. Theoretical models of culture shock and adaptation in international students in higher education. Studies In Higher Education 33, 1 (2008), 63--75.",
      "doi": ""
    }
  ]
}