{
  "doi": "10.1145/3313831.3376254",
  "title": "The Experience of Guided Online Therapy: A Longitudinal, Qualitative Analysis of Client Feedback in a Naturalistic RCT",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Internet-delivered Cognitive Behavioural Therapy (iCBT) is an effective treatment for depression and anxiety disorders. However longitudinal qualitative research into the client's subjective experience of this form of treatment ?in the wild' is relatively scarce. We present an analysis of secondary outcomes in a naturalistic RCT conducted within the UK's Improving Access to Psychological Therapies programme. We evaluated clients' expectations, experience, and context of usage of iCBT, across three timepoints. Results are discussed in terms of the creation of a therapeutic space online, the impact of hope, expectations and personal factors on the therapeutic experience, iCBT as \"therapy on the go\" and developing skills for life. While iCBT on the whole provides a positive, supportive and therapeutic experience for clients, the study identified managing expectations, polarized preferences, momentary help-seeking and long-term support as important aspects of the experience to consider in future design.",
  "tags": [
    "user experience",
    "mental health",
    "icbt",
    "longitudinal study"
  ],
  "authors": [
    {
      "name": "Jacinta Jardine",
      "institution": "SilverCloud Health, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529020",
      "orcid": "missing"
    },
    {
      "name": "Caroline Earley",
      "institution": "SilverCloud Health & Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528003",
      "orcid": "missing"
    },
    {
      "name": "Derek Richards",
      "institution": "SilverCloud Health & Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528271",
      "orcid": "missing"
    },
    {
      "name": "Ladislav Timulak",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529106",
      "orcid": "missing"
    },
    {
      "name": "Jorge E. Palacios",
      "institution": "SilverCloud Health & Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659095530",
      "orcid": "missing"
    },
    {
      "name": "Daniel Duffy",
      "institution": "SilverCloud Health & Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528493",
      "orcid": "missing"
    },
    {
      "name": "Karen Tierney",
      "institution": "SilverCloud Health, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526725",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "F. E. M. de Alva, G. Wadley, and R. Lederman. 2015. \" It feels different from real life '\": Users ' Opinions of Mobile Applications for Mental Health. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, 598--602. DOI: https://doi.org/10.1145/2838739.2838806",
      "doi": ""
    },
    {
      "text": "Mikhail Mikhailovich Bakhtin. 2010. Toward a Philosophy of the Act. University of Texas Press.",
      "doi": ""
    },
    {
      "text": "Marguerite Barry, Kevin Doherty, Jose Marcano Bellisario, Josip Car, Cecily Morrison, and Gavin Doherty. 2017. mHealth for Maternal Mental Health?: Everyday Wisdom in Ethical Design. In CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2708-- 2720.",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Angela Beattie, Alison Shaw, Surinder Kaur, and David Kessler. 2009. Primary-care patients expectations and experiences of online cognitive behavioural therapy for depression?: a qualitative study. Heal. Expect. (2009), 45--59. DOI: https://doi.org/10.1111/j.13697625.2008.00531.x",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Jo Gibbs, Nikki Newhouse, Olga Perski, Aneesha Singh, and Elizabeth Murray. 2018. Seven lessons for interdisciplinary research on interactive digital health interventions. Digit. Heal. 4, (2018), 1--13. DOI: https://doi.org/10.1177/2055207618770325",
      "doi": ""
    },
    {
      "text": "Cristina Botella, Giuseppe Riva, Andrea Gaggioli, Brenda K. Wiederhold, Mariano Alcaniz, and Rosa M. Baños. 2012. The Present and Future of Positive Technologies. Cyberpsychology, Behav. Soc. Netw. 15, 2 (2012), 78--84. DOI: https://doi.org/10.1089/cyber.2011.0140",
      "doi": ""
    },
    {
      "text": "John Burke, Derek Richards, and Ladislav Timulak. 2018. Helpful and Hindering Events in InternetDelivered Cognitive Behavioural Treatment for Generalized Anxiety. Behav. Cogn. Psychother. (2018). DOI: https://doi.org/10.1017/S1352465818000504",
      "doi": ""
    },
    {
      "text": "Rafael A. Calvo and Dorian Peters. 2014. Positive Computing: Technology for wellbeing and human potential. MIT Press, Cambridge, London.",
      "doi": "10.5555/2627995"
    },
    {
      "text": "B. Cludius, J. Schröder, and S. Moritz. 2018. Expectancy effects in self-help depression treatment: first evidence that the rationale given for an online study impacts the outcome. Behav. Cogn. Psychother. 46, 2 (2018), 195--208.",
      "doi": ""
    },
    {
      "text": "P. Cuijpers, A. van Straten, P. van Oppen, and G. Andersson. 2008. Are psychological and pharmacologic interventions equally effective in the treatment of adult depressive disorders? A metaanalysis of comparative studies. J. Clin. Psychiatry (2008).",
      "doi": ""
    },
    {
      "text": "John Dewey. 2005. Art as Experience. The Penguin Group, New York.",
      "doi": ""
    },
    {
      "text": "Gavin Doherty, David Coyle, and Mark Matthews. 2010. Design and evaluation guidelines for mental health technologies. Interact. Comput. 22, 4 (2010), 243--252. DOI: https://doi.org/10.1016/j.intcom.2010.02.006",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with Online Mental Health Interventions?: An Exploratory Clinical Study of a Treatment for Depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1421--1430.",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. The Construal of Experience in HCI?: Understanding Self-Reports. Int. J. Hum. Comput. Stud. (2018), 63-- 74. DOI: https://doi.org/10.1016/j.ijhcs.2017.10.006.the",
      "doi": "10.1016/j.ijhcs.2017.10.006"
    },
    {
      "text": "Liesje Donkin and Nick Glozier. 2012. Motivators and Motivations to Persist With Online Psychological Interventions?: A Qualitative Study of Treatment Completers. J. Med. Internet Res. 14, 3 (2012). DOI: https://doi.org/10.2196/jmir.2100",
      "doi": ""
    },
    {
      "text": "C Earley, C Joyce, J Mcelvaney, D Richards, and L Timulak. 2017. Preventing depression?: Qualitatively examining the benefits of depressionfocused iCBT for participants who do not meet clinical thresholds. Internet Interv. 9, July (2017), 82--87. DOI: https://doi.org/10.1016/j.invent.2017.07.003",
      "doi": ""
    },
    {
      "text": "J Fernández-álvarez, A Díaz-garcía, A Gonzálezrobles, R Baños, and A García-palacios. 2017. Dropping out of a transdiagnostic online intervention?: A qualitative analysis of client ' s experiences. Internet Interv. 10, May (2017), 29--38. DOI: https://doi.org/10.1016/j.invent.2017.09.001",
      "doi": ""
    },
    {
      "text": "Theresa Fleming, Lynda Bavin, Mathijs LUniversity of Chinese Academy of Sciencessen, Karolina Stasiak, Sarah Hopkins, and Sally Merry. 2018. Beyond the trial: Systematic review of realworld uptake and engagement with digital self-help interventions for depression, low mood, or anxiety. J. Med. Internet Res. 20, 6 (2018), 1--11. DOI: https://doi.org/10.2196/jmir.9275",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi and Katja Battarbee. 2004. Understanding Experience in Interactive Systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, 261--268.",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Jodi Forlizzi and Shannon Ford. 2000. The Building Blocks of Experience?: An Early Framework for Interaction Designers. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques.",
      "doi": "10.1145/347642.347800"
    },
    {
      "text": "Lina Gega, Joanna Smith, and Shirley Reynolds. 2013. Cognitive behaviour therapy ( CBT ) for depression by computer vs . therapist?: Patient experiences and therapeutic processes. Psychother. Res. 23, 2 (2013).",
      "doi": ""
    },
    {
      "text": "S. A. H. Gerhards, T. A. Abma, A. Arntz, L. E. De. Graaf, S. M. A. A. Evers, M. J. H. Huibers, and G. A. M. Widdershoven. 2011. Improving adherence and effectiveness of computerised cognitive behavioural therapy without support for depression?: A qualitative study on patient experiences. J. Affect. Disord. 129, 1--3 (2011), 117--125. DOI: https://doi.org/10.1016/j.jad.2010.09.012",
      "doi": ""
    },
    {
      "text": "Franz Gravenhorst, Amir Muaremi, Jakob Bardram, Agnes Grunerbl, Oscar Mayora, Gabriel Wurzer, Mads Frost, Venet Osmani, Bert Arnrich, Paul Lukowicz, and Gerhard Troster. 2015. Mobile phones as medical devices in mental disorder treatment?: an overview. Pers. Ubiquitous Comput. 19, 2 (2015), 335--353. DOI: https://doi.org/10.1007/s00779-014-0829--5",
      "doi": "10.1007/s00779-014-0829-5"
    },
    {
      "text": "Marc Hassenzahl. 2004. The Interplay of Beauty , Goodness , and Usability in Interactive. HumanComputer Interact. 19, (2004), 319--349. DOI: https://doi.org/10.1207/s15327051hci1904",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "Kristin E Heron and Joshua M Smyth. 2010. Ecological momentary interventions: incorporating mobile technology into psychosocial and health behaviour treatments. Br. J. Health Psychol. 15, Pt 1 (2010), 1--39. DOI: https://doi.org/10.1348/135910709X466063",
      "doi": ""
    },
    {
      "text": "Victoria Hollis, Artie Konrad, Aaron Springer, Matthew Antoun, Christopher Antoun, Rob Martin, and Steve Whittaker. 2017. What Does All This Data Mean for My Future Mood? Actionable Analytics and Targeted Reflection for Emotional Well-Being. Human--Computer Interact. 32, 5--6 (2017), 208-- 267. DOI: https://doi.org/10.1080/07370024.2016.12777",
      "doi": ""
    },
    {
      "text": "Anna Holst, Shabnam Nejati, Cecilia Björkelund, Maria C M Eriksson, Dominique Hange, Marie Kivi, Carl Wikberg, and Eva-lisa Petersson. 2017. Patients ' experiences of a computerised self-help program for treating depression -- a qualitative study of Internet mediated cognitive behavioural therapy in primary care. Scand. J. Prim. Health Care 35, 1 (2017), 46--53. DOI: https://doi.org/10.1080/02813432.2017.12888",
      "doi": ""
    },
    {
      "text": "Mahsa Honary and Fiona Lobban. 2018. Designing Video Stories Around the Lived Experience of Severe Mental Illness. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction, 25--38.",
      "doi": "10.1145/3240167.3240188"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes From the Past?: How Technology Mediated Reflection Improves WellBeing. In Proceedings of the SIGCHI conference on human factors in computing systems (pp. 10711080). ACM., 1071--1080.",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Daniel Kahneman, Barbara L Fredrickson, Charles A Schreiber, and Donald A Redelmeier. 1993. When More Pain Is Preferred To Less: Adding a Better End. Psychol. Sci. 4, 6 (1993). DOI: https://doi.org/10.1111/j.14679280.1993.tb00589.x",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-bernard Martens. 2009. User Experience Over Time?: An Initial Framework. In Proceedings of the SIGCHI conference on human factors in computing systems, 729--738.",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Saskia Kelders, Robin Niels Kok, Hans Ossebaard, and J. E. W. C van Gemert-Pijnen. 2012. Persuasive System Design Does Matter?: A Systematic Review of Adherence to Web-Based Interventions. J. Med. Internet Res. 14, 6 (2012). DOI: https://doi.org/10.2196/jmir.2104",
      "doi": ""
    },
    {
      "text": "Saskia M Kelders, Ernst T Bohlmeijer, and Julia EWC Van Gemert-Pijnen. 2013. Participants , Usage , and Use Patterns of a Web-Based Intervention for the Prevention of Depression Within a Randomized Controlled Trial Corresponding Author?: J. Med. Internet Res. 15, 8 (2013). DOI: https://doi.org/10.2196/jmir.2258",
      "doi": ""
    },
    {
      "text": "Sarah E Knowles, Karina Lovell, Peter Bower, Simon Gilbody, Elizabeth Littlewood, and Helen Lester. 2015. Patient experience of computerised therapy for depression in primary care. BMJ Open (2015). DOI: https://doi.org/10.1136/bmjopen-2015008581",
      "doi": ""
    },
    {
      "text": "Robert Kohn, Shekhar Saxena, Itzhak Levav, and Benedetto Saraceno. 2004. The treatment gap in mental health care. Bull. World Health Organ. 82, 11 (2004), 858--866.",
      "doi": ""
    },
    {
      "text": "R. Lederman, G. Wadley, J. Gleeson, S. Bendall, and M. Álvarez-Jiménez. 2014. Moderated Online Social Therapy?: Designing and Evaluating Technology for Mental Health. ACM Trans. Comput. Interact. 21, 1 (2014), 1--26.",
      "doi": "10.1145/2513179"
    },
    {
      "text": "Heidi M Levitt, Andrew Pomerville, and Francisco I Surace. 2016. A Qualitative Meta-Analysis Examining Clients ' Experiences of Psychotherapy?: A New Agenda. Psychol. Bull. 142, 8 (2016), 801-- 830.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2014. Beyond Techno-Utopia: Critical Approaches to Digital Health Technologies. Societies 4, (2014), 706--711. DOI: https://doi.org/10.3390/soc4040706",
      "doi": ""
    },
    {
      "text": "M. Magni, M. S. Taylor, and V. Venkatesh. 2010. 'To play or not to play': A cross-temporal investigation using hedonic and instrumental perspectives to explain user intentions to explore a technology. Int. J. Hum. Comput. Stud. 68, 9 (2010), 572--588.",
      "doi": "10.1016/j.ijhcs.2010.03.004"
    },
    {
      "text": "J. McCarthy and P. Wright. 2004. Technology as Experience. The MIT Press, Cambridge, Massachusetts. DOI: https://doi.org/10.1145/1015530.1015549",
      "doi": ""
    },
    {
      "text": "Kathryn McHugh, Sarah W. Whitton, Andrew D. Peckham, Jeffrey A. Welge, and Michael W. Otto. 2013. Patient Preference for Psychological vs. Pharmacological Treatment of Psychiatric Disorders: A Meta-Analytic Review. J. Clin. Psychiatry 74, 6 (2013), 595--602. DOI: https://doi.org/10.4088/JCP.12r07757.Patient",
      "doi": ""
    },
    {
      "text": "William R Miller and Stephen Rollnick. 2004. Talking Oneself Into Change?: Motivational Interviewing , Stages of Change , and Therapeutic Process. J. Cogn. Psychother. An Int. Q. 18, 4 (2004), 2004.",
      "doi": ""
    },
    {
      "text": "David C Mohr, Stacey L Hart, Isa Howard, Laura Julian, Lea Vella, Claudine Catledge, and Mitchell D. Feldman. 2006. Barriers to Psychotherapy among Depressed and Nondepressed Primary Care Patients. Ann. Behav. Med. 32, 3 (2006), 254--258. DOI: https://doi.org/10.1207/s15324796abm3203",
      "doi": ""
    },
    {
      "text": "National Institute for Health and Care Excellence. 2009. The treatment and management of depression in adults. Clinical guideline [CG90]. London: UK. Retrieved from https://www.nice.org.uk/guidance/cg90",
      "doi": ""
    },
    {
      "text": "Janine V Olthuis, Margo C Watt, Kristen Bailey, Jill A Hayden, and Sherry H Stewart. 2015. Therapistsupported Internet cognitive behavioural therapy for anxiety disorders in adults. Cochrane Database Syst. Rev. January (2015). DOI: https://doi.org/10.1002/14651858.CD011565",
      "doi": ""
    },
    {
      "text": "Ramesh P Perera-delcourt and Gemma Sharkey. 2019. Patient experience of supported computerized CBT in an inner-city IAPT service?: a qualitative study. Cogn. Behav. Ther. 12, e13 (2019), 1--23. DOI: https://doi.org/10.1017/S1754470X18000284",
      "doi": ""
    },
    {
      "text": "James O. Prochaska, Colleen A. Redding, and Kerry E. Evers. 2015. The transtheoretical model and stages of change. In Health behavior: Theory, research, and practice. 97.",
      "doi": ""
    },
    {
      "text": "Chengcheng Qu, Corina Sas, and Gavin Doherty. 2019. Exploring and Designing for Memory Impairments in Depression. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1--14.",
      "doi": "10.1145/3290605.3300740"
    },
    {
      "text": "Stefan Rennick-Egglestone, Sarah Knowles, Gill Toms, Penny Bee, Karina Lovell, and Pete Bower. 2016. Health Technologies ? In the Wild ': Experiences of Engagement with Computerised CBT. Proc. 2016 CHI Conf. Hum. Factors Comput. Syst. 2016, May (2016), 2124--2135.",
      "doi": "10.1145/2858036.2858128"
    },
    {
      "text": "J. Richards, D., Enrique, E., & Palacios. 2019. Internet-delivered cognitive behaviour therapy. In The Handbook of Brief Therapies: A Practical Guide, S. Parry (ed.). SAGE, 248.",
      "doi": ""
    },
    {
      "text": "Derek Richards, Mairead Dowling, Emma O'Brien, Noemi Vigano, and Ladislav Timulak. 2018. Significant events in an Internet-delivered ( Space from Depression ) intervention for depression. Couns. Psychother. Res. 18, 1 (2018), 35--48. DOI: https://doi.org/10.1002/capr.12142",
      "doi": ""
    },
    {
      "text": "Derek Richards, Daniel Duffy, Brid Blackburn, Caroline Earley, Angel Enrique, Jorge Palacios, Matthew Franklin, Gabriella Clarke, Sarah Sollesse, Sarah Connell, and Ladislav Timulak. 2018. Digital IAPT?: the effectiveness & cost- effectiveness of internet-delivered interventions for depression and anxiety disorders in the Improving Access to Psychological Therapies programme?: study protocol for a randomised control trial. BMC Psychiatry 18, 1 (2018), 59.",
      "doi": ""
    },
    {
      "text": "Derek Richards, L Timulak, E O'Brien, C Hayes, N Vigano, J Sharry, and G Doherty. 2015. A randomized controlled trial of an internet-delivered treatment?: Its potential as a low-intensity community intervention for adults with symptoms of depression. Behav. Res. Ther. 75, (2015), 20--31. DOI: https://doi.org/10.1016/j.brat.2015.10.005",
      "doi": ""
    },
    {
      "text": "Derek Richards and Ladislav Timulak. 2012. Clientidentified helpful and hindering events in therapistdelivered vs . self-administered online cognitivebehavioural treatments for depression in college students. Couns. Psychol. Q. August 2012 (2012), 37--41. DOI: https://doi.org/10.1080/09515070.2012.70312",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva, Rosa M. Baños, Cristina Botella, Brenda K. Wiederhold, and Andrea Gaggioli. 2012. Positive Technology: Using Interactive Technologies to Promote Positive Functioning. Cyberpsychology, Behav. Soc. Netw. 15, 2 (2012), 69--77. DOI: https://doi.org/10.1089/cyber.2011.0139",
      "doi": ""
    },
    {
      "text": "D. A. Rohani, N. Tuxen, A. Q. Lopategui, M. Faurholt-Jepsen, L. V. Kessing, and J. E. Bardram. 2019. Personalizing Mental Health?: A Feasibility Study of a Mobile Behavioral Activation Tool for Depressed Patients. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare, 282--291.",
      "doi": ""
    },
    {
      "text": "Theresia Rost, Janine Stein, Margrit Löbner, Anette Kersting, Claudia Luck-Sikorski, and Steffi G Riedel-Heller. 2017. User Acceptance of Computerized Cognitive Behavioral Therapy for Depression?: Systematic Review. J. Med. Internet Res. 19, (2017), 1--13. DOI: https://doi.org/10.2196/jmir.7662",
      "doi": ""
    },
    {
      "text": "Sune Rubak, Annelli Sandbæk, Torsten Lauritzen And, and Bo Christensen. 2005. Motivational interviewing?: a systematic review and metaanalysis. Br. J. Gen. Pract. April (2005), 305--312.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Pavel Karpashevich, Gavin Doherty, Axel Janson, Charles Windlin, Corina Sas, Camille Nadal, and Kristina Höök. 2019. HCI and Affective Health Taking stock of a decade of studies and charting future research directions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 245.",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "R. C. Schank. 1995. Tell me a story: Narrative and intelligence. Northwestern University Press, Evanston, Illinois.",
      "doi": ""
    },
    {
      "text": "Justine Schneider, Pooria Sarrami Foroushani, Paul Grime, and Graham Thornicroft. 2014. Acceptability of Online Self-Help to People With Depression?: Users ' Views of MoodGYM Versus Informational Websites. J. Med. Internet Res. 16, 3 (2014). DOI: https://doi.org/10.2196/jmir.2871",
      "doi": ""
    },
    {
      "text": "Stephen M Schueller and David C Mohr. 2015. Initial Field Trial of a Coach-Supported Web-Based Depression Treatment. In International Conference on Pervasive Computing Technologies for Healthcare. DOI: https://doi.org/10.4108/icst.pervasivehealth.20 15.260115",
      "doi": ""
    },
    {
      "text": "C R Snyder. 2002. Hope Theory?: Rainbows in the Mind. Psychol. Inq. 13, 4 (2002), 249--275.",
      "doi": ""
    },
    {
      "text": "Aaron Springer, Victoria Hollis, and Steve Whittaker. 2018. Mood Modeling?: Accuracy Depends on Active Logging and Reflection. Pers. Ubiquitous Comput. 22, 4 (2018), 723--737. DOI: https://doi.org/https://doi.org/10.1007/s00779018--1123--8",
      "doi": "10.1007/s00779-018-1123-8"
    },
    {
      "text": "Katarzyna Stawarz, Chris Preist, Debbie Tallon, Nicola Wiles, and David Coyle. 2018. User Experience of Cognitive Behavioral Therapy Apps for Depression?: An Analysis of App Functionality and User Reviews. J. Med. Internet Res. 20, 6 (2018).",
      "doi": ""
    },
    {
      "text": "Deborah Tatar. 2007. The Design Tensions Framework. Human-Computer Interact. 22, (2007), 413--451.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Thomas D Meyer, and Patrick Olivier. 2015. Designing for Mental Wellbeing?: Towards a More Holistic Approach in the Treatment and Prevention of Mental Illness. In Proceedings of the 2015 British HCI Conference, 1-- 10.",
      "doi": "10.1145/2783446.2783586"
    },
    {
      "text": "Ladislav Timulak. 2007. Identifying core categories of client-identified impact of helpful events in psychotherapy?: A qualitative meta-analysis. Psychother. Res. 17, May (2007), 310--321. DOI: https://doi.org/10.1080/10503300600608116",
      "doi": ""
    },
    {
      "text": "Ladislav Timulak and Robert Elliott. 2019. Taking stock of descriptive -- interpretative qualitative psychotherapy research?: Issues and observations from the front line. Couns. Psychother. Res. 19, 1 (2019), 8--15. DOI: https://doi.org/10.1002/capr.12197",
      "doi": ""
    },
    {
      "text": "Noam Tractinsky and Dror Zmiri. 2006. Exploring Attributes of Skins as Potential Antecedents of Emotion in HCI. In Aesthetic computing, P. Fishwick (ed.). MIT Press, Cambridge, 405--422.",
      "doi": ""
    },
    {
      "text": "Nash Unsworth. 2016. Working Memory Capacity and Recall From Long-Term Memory?: Examining the Influences of Encoding Strategies , Study Time Allocation , Search Efficiency , and Monitoring Abilities. J. Exp. Psychol. Learn. Mem. Cogn. 42, 1 (2016), 50--61.",
      "doi": ""
    },
    {
      "text": "Daniel Vigo, Graham Thornicroft, and Rifat Atun. 2016. ESTIMATING THE TRUE GLOBAL BURDEN OF MENTAL ILLNESS. Lancet Psychiatry 3, 2 (2016), 171--178.",
      "doi": ""
    },
    {
      "text": "Q. Wang. 2016. Remembering the self in cultural contexts: A cultural dynamic theory of autobiographical memory. Mem. Stud. 9, 3 (2016), 295--304.",
      "doi": ""
    },
    {
      "text": "Henny A Westra and David J A Dozois. 2006. Preparing Clients for Cognitive Behavioral Therapy?: A Randomized Pilot Study of Motivational Interviewing for Anxiety. Cognit. Ther. Res. 30, 4 (2006), 481--498. DOI: https://doi.org/10.1007/s10608-006--9016-y",
      "doi": ""
    },
    {
      "text": "H.A. Whiteford, L. Degenhardt, J. Rehm, A.J. Baxter, A.J. Ferrari, H.E. Erskine, F.J. Charlson, R.E. Norman, A.D. Flaxman, N. Johns, and R Burstein. 2013. Global burden of disease attributable to mental and substance use disorders: findings from the global burden of disease study 2010. Lancet 382, 9904 (2013), 1575--86.",
      "doi": ""
    },
    {
      "text": "Maja Wilhelmsen, Kjersti Lillevoll, Mette Bech Risør, Ragnhild Høifødt, May-lill Johansen, Knut Waterloo, Martin Eisemann, and Nils Kolstrup. 2013. Motivation to persist with internet-based cognitive behavioural treatment using blended care?: a qualitative study. BMC Psychiatry 13, (2013), 296.",
      "doi": ""
    },
    {
      "text": "Cara Wilson, Steve Draper, Margot Brereton, and Daniel Johnson. 2017. Towards Thriving?: Extending Computerised Cognitive Behavioural Therapy. In Proceedings of the 29th Australian Conference on Computer-Human Interaction, 285-- 295.",
      "doi": "10.1145/3152771.3152802"
    },
    {
      "text": "J.H. Wright, J.J. Owen, D. Richards, T.D. Eells, T. Richardson, G.K. Brown, M. Barrett, M.A. Rasku, G. Polser, and M.E. Thase. 2019. Computer-Assisted Cognitive-Behavior Therapy for Depression: A Systematic Review and Meta-Analysis. J. Clin. Psychiatry 80, 2 (2019).",
      "doi": ""
    },
    {
      "text": "A. S. Young, R. Klap, C. D. Sherbourne, and K. B. Wells. 2001. The quality of care for depressive and anxiety disorders in the United States. Arch. Gen. Psychiatry 58, 1 (2001), 55--61.",
      "doi": ""
    }
  ]
}