{
  "doi": "10.1145/3313831.3376496",
  "title": "Framing Effects Influence Interface Feature Decisions",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Studies in psychology have shown that framing effects, where the positive or negative attributes of logically equivalent choices are emphasised, influence people's decisions. When outcomes are uncertain, framing effects also induce patterns of choice reversal, where decisions tend to be risk averse when gains are emphasised and risk seeking when losses are emphasised. Studies of these effects typically use potent framing stimuli, such as the mortality of people suffering from diseases or personal financial standing. We examine whether these effects arise in users' decisions about interface features, which typically have less visceral consequences, using a crowd-sourced study based on snap-to-grid drag-and-drop tasks (n = 842). The study examined several framing conditions: those similar to prior psychological research, and those similar to typical interaction choices (enabling/disabling features). Results indicate that attribute framing strongly influences users' decisions, that these decisions conform to patterns of risk seeking for losses, and that patterns of choice reversal occur.",
  "tags": [
    "risky choice framing",
    "interface decisions",
    "framing effects",
    "attribute framing"
  ],
  "authors": [
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Blaine Lewis",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314639",
      "orcid": "0000-0002-8825-5782"
    },
    {
      "name": "Philip Quinn",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351595064",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Roy F. Baumeister, Ellen Bratslavsky, Catrin Finkenauer, and Kathleen D. Vohs. 2001. Bad is stronger than good. Review of General Psychology 5, 4 (2001), 323--370. DOI: https://doi.org/10.1037/1089--2680.5.4.",
      "doi": ""
    },
    {
      "text": "André Calero Valdez, Martina Ziefle, and Katrien Verbert. 2016. HCI for Recommender Systems: The Past, the Present and the Future. In Proceedings of the 10th ACM Conference on Recommender Systems (RecSys '16). ACM, NY, NY, 123--126. DOI: https://doi.org/10.1145/2959100.2959158",
      "doi": "10.1145/2959100.2959158"
    },
    {
      "text": "Eun Kyoung Choe, Jaeyeon Jung, Bongshin Lee, and Kristie Fisher. 2013. Nudging People Away from Privacy-Invasive Mobile Apps through Visual Framing. In Human-Computer Interaction -- INTERACT 2013 (Lecture Notes in Computer Science), Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.), Vol. 8119. Springer, Berlin/Heidelberg, Germany, 74--91. DOI: https://doi.org/10.1007/978--3--642--40477--1_5",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Shyong K. Lam, Istvan Albert, Joseph A. Konstan, and John Riedl. 2003. Is Seeing Believing?: How Recommender System Interfaces Affect Users' Opinions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, 585--592. DOI: https://doi.org/10.1145/642611.642713",
      "doi": "10.1145/642611.642713"
    },
    {
      "text": "Antonella De Angeli, Alistair Sutcliffe, and Jan Hartmann. 2006. Interaction, Usability and Aesthetics: What Influences Users' Preferences?. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS'06). ACM, NY, NY, 271--280. DOI: https://doi.org/10.1145/1142405.1142446",
      "doi": "10.1145/1142405.1142446"
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Tuomas Pakkanen. 2014. Do Persuasive Technologies Persuade? - A Review of Empirical Studies. In Persuasive Technology, Anna Spagnolli, Luca Chittaro, and Luciano Gamberini (Eds.). Springer International Publishing, Cham, Germany, 118--136. DOI: https://doi.org/10.1007/978--3--319-07127--5_11",
      "doi": ""
    },
    {
      "text": "Richard J. Harris. 1973. Answering questions containing marked and unmarked adjectives and adverbs. Journal of Experimental Psychology 97, 3 (1973), 399--401. DOI: https://doi.org/10.1037/h0034165",
      "doi": ""
    },
    {
      "text": "Jan Hartmann, Antonella De Angeli, and Alistair Sutcliffe. 2008. Framing the User Experience: Information Biases on Website Quality Judgement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, 855--864. DOI: https://doi.org/10/ fktzv4",
      "doi": "10.1145/1357054.1357190"
    },
    {
      "text": "Jan Hartmann, Alistair Sutcliffe, and Antonella De Angeli. 2007. Investigating Attractiveness in Web User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, 387--396. DOI: https://doi.org/10.1145/1240624.1240687",
      "doi": "10.1145/1240624.1240687"
    },
    {
      "text": "Jan Hartmann, Alistair Sutcliffe, and Antonella De Angeli. 2008. Towards a Theory of User Judgment of Aesthetics and User Interface Quality. ACM Transactions on Computer-Human Interaction 15, 4, Article 15 (2008), 30 pages. DOI: https://doi.org/10/b57cf9",
      "doi": "10.1145/1460355.1460357"
    },
    {
      "text": "Maria L. Hwang and Lena Mamykina. 2017. Monster Appetite: Effects of Subversive Framing on Nutritional Choices in a Digital Game Environment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, 4082--4096. DOI: https://doi.org/10.1145/3025453.3026052",
      "doi": ""
    },
    {
      "text": "Anthony Jameson, Bettina Berendt, Silvia Gabrielli, Federica Cena, Cristina Gena, Fabiana Vernero, and Katharina Reinecke. 2014. Choice Architecture for Human-Computer Interaction. Foundations and Trends in Human-Computer Interaction 7, 1--2 (2014), 1--235. DOI: https://doi.org/10.1561/1100000028",
      "doi": "10.1561/1100000028"
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 1984. Choices, Values, and Frames. American Psychologist 39, 4 (1984), 341--350. DOI: https://doi.org/10.1037/ 0003-066X.39.4.341",
      "doi": ""
    },
    {
      "text": "Gideon B. Keren and Jeroen G. W. Raaijmakers. 1988. On between-subjects versus within-subjects comparisons in testing utility theory. Organizational Behavior and Human Decision Processes 41, 2 (1988), 233--247. DOI: https://doi.org/10/b2nkrd",
      "doi": ""
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY. DOI: https://doi.org/10.1145/2858036.2858428",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Irwin P. Levin. 1987. Associative effects of information framing. Bulletin of the Psychonomic Society 25, 2 (1987), 85--86. DOI: https://doi.org/10.3758/ BF03330291",
      "doi": ""
    },
    {
      "text": "Irwin P. Levin and Gary J. Gaeth. 1988. How Consumers Are Affected by the Framing of Attribute Information Before and After Consuming the Product. Journal of Consumer Research 15, 3 (1988), 374--378. DOI: https://doi.org/10.1086/209174",
      "doi": ""
    },
    {
      "text": "Irwin P. Levin, Sandra L. Schneider, and Gary J. Gaeth. 1998. All Frames Are Not Created Equal: A Typology and Critical Analysis of Framing Effects. Organizational Behavior and Human Decision Processes 76, 2 (1998), 149--188. DOI: https://doi.org/10/bzntst",
      "doi": ""
    },
    {
      "text": "Irwin P. Levin, Sara K. Schnittjer, and Shannon L. Thee. 1988. Information framing effects in social and personal decisions. Journal of Experimental Social Psychology 24, 6 (1988), 520--529. DOI: https://doi.org/10.1016/0022--1031(88)90050--9",
      "doi": ""
    },
    {
      "text": "Elizabeth F. Loftus. 1975. Leading questions and the eyewitness report. Cognitive Psychology 7, 4 (1975), 560--572. DOI: https://doi.org/10.1016/0010-0285(75)90023--7",
      "doi": ""
    },
    {
      "text": "Theresa M. Marteau. 1989. Framing of information: Its influence upon decisions of doctors and patients. British Journal of Social Psychology 28, 1 (1989), 89--94. DOI: https://doi.org/10.1111/j.2044--8309.1989. tb00849.x",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Wei Li, Tovi Grossman, and George Fitzmaurice. 2009. CommunityCommands: Command Recommendations for Software Applications. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST'09). ACM, NY, NY, 193--202. DOI: https://doi.org/10.1145/1622176.1622214",
      "doi": "10.1145/1622176.1622214"
    },
    {
      "text": "Samuel Messick and Douglas N. Jackson. 1961. Acquiescence and the factorial interpretation of the MMPI. Psychological Bulletin 58, 4 (1961), 299--304. DOI: https://doi.org/10.1037/h0043979",
      "doi": ""
    },
    {
      "text": "Tobias Nyström and Moyen M. Mustaquim. 2015. Managing Framing Effects in Persuasive Design for Sustainability. In Proceedings of the 19th International Academic Mindtrek Conference (AcademicMindTrek '15). ACM, NY, NY, 122--129. DOI: https://doi.org/10.1145/2818187.2818277",
      "doi": ""
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Mikael B. Skov, Lars Lichon, and Stephan Rasmussen. 2015. Understanding Individual Differences for Tailored Smoking Cessation Apps. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, 1699--1708. DOI: https://doi.org/10.1145/2702123.2702321",
      "doi": "10.1145/2702123.2702321"
    },
    {
      "text": "Philip Quinn and Andy Cockburn. 2016. When Bad Feels Good: Assistance Failures and Interface Preferences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, 4005--4010. DOI: https://doi.org/10/bhqq",
      "doi": "10.1145/2858036.2858074"
    },
    {
      "text": "Eeva Raita and Antti Oulasvirta. 2011. Too good to be bad: Favorable product expectations boost subjective usability ratings. Interacting with Computers 23, 4 (2011), 363--371. DOI: https://doi.org/10.1016/j.intcom.2011.04.002",
      "doi": ""
    },
    {
      "text": "Eldar Shafir. 1993. Choosing versus rejecting: Why some options are both better and worse than others. Memory & Cognition 21, 4 (1993), 546--556. DOI: https://doi.org/10.3758/BF03197186",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2014. Don't Forget Your Pill!: Designing Effective Medication Reminder Apps That Support Users' Daily Routines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, 2269--2278. DOI: https://doi.org/10.1145/2556288.2557079",
      "doi": "10.1145/2556288.2557079"
    },
    {
      "text": "Kristian Torning and Harri Oinas-Kukkonen. 2009. Persuasive System Design: State of the Art and Future Directions. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive '09). ACM, NY, NY, Article 30, 8 pages. DOI: https://doi.org/10.1145/1541948.1541989",
      "doi": "10.1145/1541948.1541989"
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1981. The framing of decisions and the psychology of choice. Science 211, 4481 (1981), 453--458. DOI: https://doi.org/10/fj3z3r",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1986. Rational Choice and the Framing of Decisions. The Journal of Business 59, 4, Pt. 2 (1986), S251--S278.",
      "doi": ""
    },
    {
      "text": "Ronald L. Wasserstein, Allen L. Schirm, and Nicole A. Lazar. 2019. Moving to a World Beyond p < 0.05\". The American Statistician 73 (2019), 1--19. DOI: https://doi.org/10.1080/00031305.2019.1583913",
      "doi": ""
    }
  ]
}