{
  "doi": "10.1145/3313831.3376480",
  "title": "Toward the Design of Enjoyable Games for Children with Fetal Alcohol Spectrum Disorder",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Fetal Alcohol Spectrum Disorder (FASD) is a heterogeneous and complex set of disorders caused by prenatal alcohol exposure, estimated to affect 2-5% of the North American population. Deficits associated with FASD affect social skill development and executive function, including emotional regulation and impulse control. These deficits can increase the difficulty of playing digital games. While considerable research has been performed in understanding how to design games for people with neurodevelopmental disorders in general, there is little data on how to design engaging games for children with FASD. We conducted a ten-week in-school gaming trial with eleven elementary-aged children with diagnosed or suspected FASD. Participants enjoyed playing together and responded well to the in-game reward system, while some game elements caused unexpected frustration. Based on our observations, we advise that games for FASD be designed to have low cost of failure, avoid retracting options, account for taking breaks when needed, show progression in rewards, and enable cooperative play.",
  "authors": [
    {
      "name": "Adrian L. Jessup Schneider",
      "institution": "Queen's University, Kingston, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658651470",
      "orcid": "0000-0002-0719-1722"
    },
    {
      "name": "Kathy Keiver",
      "institution": "University of the Fraser Valley, Abbotsford, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258687557",
      "orcid": "missing"
    },
    {
      "name": "Alison Pritchard Orr",
      "institution": "University of the Fraser Valley, Chilliwack, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528144",
      "orcid": "missing"
    },
    {
      "name": "James N. Reynolds",
      "institution": "Queen's University, Kingston, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659043545",
      "orcid": "missing"
    },
    {
      "name": "Neven Golubovich",
      "institution": "Queen's University, Kingston, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526661",
      "orcid": "missing"
    },
    {
      "name": "T.C. Nicholas Graham",
      "institution": "Queen's University, Kingston, ON, Canada",
      "img": "/do/10.1145/contrib-81392599672/rel-imgonly/81392599672.png",
      "acmid": "81392599672",
      "orcid": "0000-0001-6723-1936"
    }
  ],
  "references": [
    {
      "text": "The AbleGamers Foundation. 2012. Includification: A Practical Guide to Game Accessibility. Retrieved Aug. 18, 2019 from https://accessible.games/includification/",
      "doi": ""
    },
    {
      "text": "Clare S. Allely and Piersanti Gebbia. 2016. Studies Investigating Fetal Alcohol Spectrum Disorders in the Criminal Justice System: A Systematic PRISMA Review. SOJ Psychology 3, 1 (Feb. 2016), 1--11. DOI: http://dx.doi.org/10.15226/2374--6874/3/1/00123",
      "doi": ""
    },
    {
      "text": "Robyn M. Amos-Kroohs, Birgit A. Fink, Carol J. Smith, Lyanne Chin, Sandra C. Van Calcar, Jeffrey R. Wozniak, and Susan M. Smith. 2016. Abnormal Eating Behaviors Are Common in Children with Fetal Alcohol Spectrum Disorder. The Journal of Pediatrics 169 (Feb. 2016), 194--200. DOI: https://dx.doi.org/10.1016%2Fj.jpeds.2015.10.049",
      "doi": ""
    },
    {
      "text": "David W. Bartle. 2012. Development of Cognitive Video Games for Children with Attention and Memory Impairment. Master's thesis. University of Victoria (UVic) Victoria, British Columbia, Canada.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut and Robert J. Moore. 2005. More than just ?XP': learning social skills in massively multiplayer online games. Interactive Technology and Smart Education 2, 2, 89--100. DOI: https://doi.org/10.1108/17415650580000035",
      "doi": ""
    },
    {
      "text": "Encyclopedia of Mental Disorders. 2019. Executive function. Retrieved Aug. 18, 2019 from http://www.minddisorders.com/Del-Fi/Executivefunction.html",
      "doi": ""
    },
    {
      "text": "Katherine Flannigan, Kathy Unsworth, and Kelly Harding. 2018. The Prevalence of Fetal Alcohol Spectrum Disorder. CanFASD Issue Paper. Canada FASD Research Network, Canada.",
      "doi": ""
    },
    {
      "text": "Game Accessibility Guidelines. 2019. Game Accessibility Guidelines. Retrieved Aug. 18 from http://gameaccessibilityguidelines.com/",
      "doi": ""
    },
    {
      "text": "Courtney R. Green, Jocelynn L. Cook, Jacqueline Pei. 2016. Computer Game Interventions for Individuals with FASD. CanFASD Issue Paper. Canada FASD Research Network, Canada.",
      "doi": ""
    },
    {
      "text": "Hamilton A. Hernandez, T.C. Nicholas Graham, Darcy Fehlings, Lauren Switzer, Zi Ye, Quentin Bellay, Md Ameer Hamza, Cheryl Savery, and Tadeusz Stach. 2012. Design of an Exergaming Station for Children with Cerebral Palsy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2619--2628. DOI: https://doi.org/10.1145/2207676.2208652",
      "doi": "10.1145/2207676.2208652"
    },
    {
      "text": "Hamilton A. Hernandez, Mallory Ketcheson, Adrian Schneider, Zi Ye, Darcy Fehlings, Lauren Switzer, Virginia Wright, Shelly K. Bursick, Chad Richards, and T.C. Nicholas Graham. 2014. Design and Evaluation of a Networked Game to Support Social Connection of Youth with Cerebral Palsy. In Proceedings of the 16th international ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, NY, NY, USA, 161--168. DOI: https://doi.org/10.1145/2661334.2661370",
      "doi": ""
    },
    {
      "text": "Maximus D. Kaos, Mark R. Beauchamp, Shelly Bursick, Amy E. Latimer-Cheung, Hamilton Hernandez, Darren E.R. Warburton, Christopher Yao, Zi Ye, T.C. Nicholas Graham, and Ryan E. Rhodes. 2018. Efficacy of Online Multi-Player Versus SinglePlayer Exergames on Adherence Behaviors Among Children: A Nonrandomized Control Trial. Annals of Behavioral Medicine 52, 10 (Oct. 2018), 878--889. DOI: https://doi.org/10.1093/abm/kax061",
      "doi": ""
    },
    {
      "text": "Maximus D. Kaos, Ryan E. Rhodes, Perttu Hämäläinen, T.C. Nicholas Graham. 2019. Social Play in an Exergame: How the Need to Belong Predicts Adherence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, Glasgow, Scotland, UK, paper 430. DOI: https://doi.org/10.1145/3290605.3300660",
      "doi": "10.1145/3290605.3300660"
    },
    {
      "text": "Kimberly A. Kerns, Jennifer MacSween, Shelly Vander Wekken, and Vincenza Gruppuso. 2010. Investigating the efficacy of an attention training programme in children with foetal alcohol spectrum disorder. Developmental Neurorehabilitation 13, 6 (Oct. 2010), 413--422. DOI: http://dx.doi.org/10.3109/17518423.2010.511421",
      "doi": ""
    },
    {
      "text": "Kimberly A. Kerns, Sarah Macoun, Jenny MacSween, Jacqueline Pei, and Marnie Hutchison. 2016. Attention and working memory training: A feasibility study in children with neurodevelopmental disorders. Applied Neuropsychology: Child 6, 2 (Apr. 2016), 120--137. DOI: https://doi.org/10.1080/21622965.2015.1109513",
      "doi": ""
    },
    {
      "text": "Gillian King, Beata Batorowicz, Patty Rigby, Margot McMain-Klein, Laura Thompson, and Madhu Pinto. 2014. Development of a Measure to Assess Youth Self-reported Experiences of Activity Settings (SEAS). International Journal of Disability, Development and Education 61, 1 (Mar. 2014), 44--66. DOI: https://doi.org/10.1080/1034912X.2014.878542",
      "doi": ""
    },
    {
      "text": "Shannon Knights, Nicholas Graham, Lauren Switzer, Hamilton Hernandez, Zi Ye, Briar Findlay, Wen Yan Xie, Virginia Wright, and Darcy Fehlings. 2014. An innovative cycling exergame to promote cardiovascular fitness in youth with cerebral palsy: A brief report. Developmental Neurorehabilitation 16, 2 (Jun. 2014), 135--140. DOI: http://dx.doi.org/10.3109/17518423.2014.923056",
      "doi": ""
    },
    {
      "text": "Piyadasa W. Kodituwakku. 2007. Defining the behavioral phenotype in children with fetal alcohol spectrum disorders: A review. Neuroscience & Biobehavioral Reviews 31, 2, 192--201. DOI: https://doi.org/10.1016/j.neubiorev.2006.06.020",
      "doi": ""
    },
    {
      "text": "Piyadasa W. Kodituwakku. 2009. Neurocognitive profile in children with fetal alcohol spectrum disorders. Developmental Disabilities Research Reviews 15, 3 (Sep. 2009), 218--224. DOI: https://doi.org/10.1002/ddrr.73",
      "doi": ""
    },
    {
      "text": "Regan L. Mandryk, Shane Dielschneider, Michael R. Kalyn, Christopher P. Bertram, Michael Gaetz, Andre Doucette, Brett A. Taylor, Alison Pritchard Orr, and Kathy Keiver. 2013. Games as Neurofeedback Training for Kids with FASD. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, NY, NY, USA, 165--172. DOI: https://doi.org/10.1145/2485760.2485762",
      "doi": "10.1145/2485760.2485762"
    },
    {
      "text": "Sarah N. Mattson, Nicole Crocker, and Tanya T. Nguyen. 2011. Fetal Alcohol Spectrum Disorders: Neuropsychological and Behavioral Features. Neuropsychology Review 21, 2 (Apr. 2011), 81--101. DOI: https://doi.org/10.1007/s11065-011--9167--9",
      "doi": ""
    },
    {
      "text": "Julie A. Millar, Janet Thompson, Dorothy Schwab, Ana Hanlon-Dearman, Deborah Goodman, Gal Koren, and Paul Masotti. 2017. Educating students with FASD: linking policy, research and practice. Journal of Research in Special Educational Needs 17 1 (Jan. 2017), 3--17. DOI: https://doi.org/10.1111/14713802.12090",
      "doi": ""
    },
    {
      "text": "Mary J. O'Connor, Elizabeth A. Laugeson, Catherine Mogil, Evy Lowe, Kathleen Welch-Torres, Vivien Keil, and Blair Paley. 2011. Translation of an Evidence-Based Social Skills Intervention for Children with Prenatal Alcohol Exposure in a Community Mental Health Setting. Alcoholism: Clinical and Experimental Research 36, 1 (Jul. 2011), 141--152. DOI: https://doi.org/10.1111/j.15300277.2011.01591.x",
      "doi": ""
    },
    {
      "text": "Lynne S. Padgett, Dorothy Strickland, and Claire D. Coles. 2006. Case Study: Using a Virtual Reality Computer Game to Teach Fire Safety Skills to Children Diagnosed with Fetal Alcohol Syndrome. Journal of Pediatric Psychology 31, 1, 65--70. DOI: https://doi.org/10.1093/jpepsy/jsj030",
      "doi": ""
    },
    {
      "text": "Jacqueline Pei and Kimberly Kerns. 2012. Using Games to Improve Functioning in Children with Fetal Alcohol Spectrum Disorders. Games for Health Journal 1, 4 (Aug. 2012), 308--311. DOI: https://doi.org/10.1089/g4h.2012.0036",
      "doi": ""
    },
    {
      "text": "Svetlana Popova, Shannon Lange, Larry Burd, Albert E. Chudley, Sterling K. Clarren, and Jürgen Rehm. 2013. Cost of Fetal Alcohol Spectrum Disorder Diagnosis in Canada. PLoS One 8, 4 (Apr. 2013). DOI: https://dx.doi.org/10.1371%2Fjournal.pone.0060434",
      "doi": ""
    },
    {
      "text": "Carmen Rasmussen, Rosalyn McAuley, and Gail Andrew. 2007. Parental ratings of children with Fetal Alcohol Spectrum Disorder on the Behavior Rating Inventory of Executive Function (BRIEF). Journal of FAS International 5, 2 (Feb. 2007).",
      "doi": ""
    },
    {
      "text": "Carmen Rasmussen. 2005. Executive Functioning and Working Memory in Fetal Alcohol Spectrum Disorder. Alcoholism: Clinical and Experimental Research 29, 8 (Aug. 2005), 1359--1367. DOI: http://dx.doi.org/10.1097/01.alc.0000175040.91007.d0",
      "doi": ""
    },
    {
      "text": "R.E. Rhodes, M.D. Kaos, M.R. Beauchamp, S.K. Bursick, A.E. Latimer-Cheung, H. Hernandez, D.E.R. Warburton, Z. Ye, T.C. Nicholas Graham. 2018. Effects of home-based exergaming on child social cognition and subsequent prediction of behavior. Scandinavian Journal of Medicine & Science in Sports 28, 10 (Oct. 2018). DOI: https://doi.org/10.1111/sms.13225",
      "doi": ""
    },
    {
      "text": "Janet C. Read, Stuart MacFarlane. 2006. Using the Fun Toolkit and Other Survey Methods to Gather Opinions in Child Computer Interaction. In Proceedings of the 2006 Conference on Interaction Design and Children (IDC '06). ACM, Tampere, Finland, 81--88. DOI: https://doi.org/10.1145/1139073.1139096",
      "doi": "10.1145/1139073.1139096"
    },
    {
      "text": "Naomi B. Robbins, Richard M. Heiberger. 2011. Plotting Likert and Other Rating Scales. In Proceedings of the 2011 Joint Statistical Meetings. Miami Beach, FL, USA, 1058--1066.",
      "doi": ""
    },
    {
      "text": "James C. Rosser Jr, Paul J. Lynch, Laurie Cuddihy, Douglas A. Gentile, Jonathan Klonsky, and Ronald Merrell. 2007. The Impact of Video Games on Training Surgeons in the 21st Century. Archives of Surgery 142, 2 (Feb. 2007), 181--186. DOI: https://doi.org/10.1001/archsurg.142.2.181",
      "doi": ""
    },
    {
      "text": "Lilach Shalev, Yehoshua Tsal, and Carmel Mevorach. 2007. Computerized Progressive Attentional Training (CPAT) Program: Effective Direct Intervention for Children with ADHD. Child Neuropsychology 13, 4 (Jun. 2007), 382--388. DOI: https://doi.org/10.1080/09297040600770787",
      "doi": ""
    },
    {
      "text": "Ian Spence and Jing Feng. 2010. Video games and spatial cognition. Review of General Psychology 14, 2, 92--104.",
      "doi": ""
    },
    {
      "text": "Rita M. Tomé, João M. Pereira, and Manuel Oliveira. 2014. Using Serious Games for Cognitive Disabilities. In Proceedings of the 5th International Conference of Serious Games Development and Applications (SGDA 2014). Berlin, Germany, 34--47. DOI: http://dx.doi.org/10.1007/978--3--319--11623--5_4",
      "doi": ""
    },
    {
      "text": "Christy M. Walcott and Steven Landau. 2004. The Relation Between Disinhibition and Emotion Regulation in Boys With Attention Deficit Hyperactivity Disorder. Journal of Clinical Child and Adolescent Psychology 33, 4, 772--782. DOI: https://doi.org/10.1207/s15374424jccp3304_12",
      "doi": ""
    },
    {
      "text": "Hao Wang and Chuen-Tsai Sun. 2012. Game Reward Systems: Gaming Experiences and Social Meanings. In Proceedings of the 2011 DiGRA International Conference: Think Design Play (DiGRA '11). Springer, Hilversum, The Netherlands, 1--12.",
      "doi": ""
    },
    {
      "text": "Thomas Westin, Kevin Bierre, Dimitris Gramenos, and Michelle Hinn. 2011. Advances in Game Accessibility from 2005 to 2010. In Proceedings of the 6th International Conference on Universal Access in Human-Computer Interaction: Users Diversity (UAHCI '11). Springer, Orlando, FL, USA, 400--409. DOI: https://doi.org/10.1007/978--3--642--21663--3_43",
      "doi": "10.5555/2027376.2027422"
    },
    {
      "text": "Elisabeth M. Whyte, Joshua M. Smyth, and K. Suzanne Scherf. 2014. Designing Serious Game Interventions for Individuals with Autism. Journal of Autism and Developmental Disorders 45, 12 (Dec. 2014), 38203831. DOI: https://doi.org/10.1007/s10803-014--2333--1",
      "doi": ""
    },
    {
      "text": "Bei Yuan, Eelke Folmer, and Frederick C. Harris Jr.. 2011. Game accessibility: a survey. Universal Access in the Information Society 10, 1 (Mar. 2011), 81--100. DOI: https://doi.org/10.1007/s10209-010-0189--5",
      "doi": "10.1007/s10209-010-0189-5"
    }
  ]
}