{
  "doi": "10.1145/3313831.3376637",
  "title": "XRDirector: A Role-Based Collaborative Immersive Authoring System",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Immersive authoring is an increasingly popular technique to design AR/VR scenes because design and testing can be done concurrently. Most existing systems, however, are single-user and limited to either AR or VR, thus constrained in the interaction techniques. We present XRDirector, a role-based collaborative immersive authoring system that enables designers to freely express interactions using AR and VR devices as puppets to manipulate virtual objects in 3D physical space. In XRDirector, we adapt roles known from filmmaking to structure the authoring process and help coordinate multiple designers in immersive authoring tasks. We study how novice AR/VR creators can take advantage of the roles and modes in XRDirector to prototype complex scenes with animated 3D characters, light effects, and camera movements, and also simulate interactive system behavior in a Wizard of Oz style. XRDirector's design was informed by case studies around complex 3D movie scenes and AR/VR games, as well as workshops with novice AR/VR creators. We show that XRDirector makes it easier and faster to create AR/VR scenes without the need for coding, characterize the issues in coordinating designers between AR and VR, and identify the strengths and weaknesses of each role and mode to mitigate the issues.",
  "tags": [
    "ar/vr",
    "immersive authoring",
    "mixed-reality collaboration"
  ],
  "authors": [
    {
      "name": "Michael Nebeling",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640607",
      "orcid": "0000-0003-3743-2387"
    },
    {
      "name": "Katy Lewis",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529108",
      "orcid": "missing"
    },
    {
      "name": "Yu-Cheng Chang",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529312",
      "orcid": "missing"
    },
    {
      "name": "Lihan Zhu",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527399",
      "orcid": "missing"
    },
    {
      "name": "Michelle Chung",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526674",
      "orcid": "missing"
    },
    {
      "name": "Piaoyang Wang",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528976",
      "orcid": "missing"
    },
    {
      "name": "Janet Nebeling",
      "institution": "University of Michigan - Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261164",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Raphael Anderegg, Loïc Ciccone, and Robert W.Sumner. 2018. PuppetPhone: puppeteering virtualcharacters using a smartphone. InProc. MIG. 5:1--5:6.",
      "doi": ""
    },
    {
      "text": "Connelly Barnes, David E. Jacobs, Jason Sanders, Dan B. Goldman, Szymon Rusinkiewicz, Adam Finkelstein, and Maneesh Agrawala. 2008. Video puppetry: a performative interface for cutout animation. TOG 27, 5 (2008), 124:1--124:9.",
      "doi": "10.1145/1457515.1409077"
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 1999. Collaborative mixed reality. In Proc. ISMAR. 261--284.",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic turk: a motion platform based on people. In Proc. CHI. DOI: http://dx.doi.org/10.1145/2556288.2557101",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Mutual Human Actuation. In Proc. UIST. 797--805.",
      "doi": "10.1145/3126594.3126667"
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. TurkDeck: Physical Virtual Reality Based on People. In Proc. UIST. 417--426.",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Richard C. Davis, Brien Colwell, and James A. Landay. 2008. K-sketch: a 'kinetic' sketch pad for novice animators. In Proc. CHI. 413--422.",
      "doi": ""
    },
    {
      "text": "Mira Dontcheva, Gary D. Yngve, and Zoran Popovic. 2003. Layered acting for character animation. TOG 22, 3 (2003), 409--416. DOI: http://dx.doi.org/10.1145/882262.882285",
      "doi": "10.1145/882262.882285"
    },
    {
      "text": "Steven Dow, Jaemin Lee, Christopher Oezbek, Blair MacIntyre, Jay David Bolter, and Maribeth Gandy. 2005a. Wizard of Oz interfaces for mixed reality applications. In Proc. CHI Extended Abstracts. 1339--1342.",
      "doi": "10.1145/1056808.1056911"
    },
    {
      "text": "Steven Dow, Blair MacIntyre, Jaemin Lee, Christopher Oezbek, Jay David Bolter, and Maribeth Gandy. 2005b. Wizard of Oz support throughout an iterative design process. IEEE Pervasive Computing 4, 4 (2005), 18--26.",
      "doi": "10.1109/MPRV.2005.93"
    },
    {
      "text": "Barrett Ens, Joel Lanir, Anthony Tang, Scott Bateman, Gun Lee, Thammathip Piumsomboon, and Mark Billinghurst. 2019. Revisiting collaboration through mixed reality: The evolution of groupware. IJHCS 131 (2019).",
      "doi": ""
    },
    {
      "text": "Jamie Feltham. 2017. Disney Is Using VR To Help Film The Lion King Remake. Available from uploadVR at https://uploadvr.com/disney-using-vr-film-lion-king-remake/. (July 2017).",
      "doi": ""
    },
    {
      "text": "Maribeth Gandy and Blair MacIntyre. 2014. Designer's augmented reality toolkit, ten years later: implications for new media authoring tools. In Proc. UIST.",
      "doi": "10.1145/2642918.2647369"
    },
    {
      "text": "Taejin Ha, Woontack Woo, Youngho Lee, Junhun Lee, Jeha Ryu, Hankyun Choi, and Kwanheng Lee. 2010. ARtalet: tangible user interface based immersive augmented reality authoring tool for Digilog book. In Proc. ISUVR. 40--43.",
      "doi": "10.1109/ISUVR.2010.20"
    },
    {
      "text": "Robert Held, Ankit Gupta, Brian Curless, and Maneesh Agrawala. 2012. 3D puppetry: a kinect-based interface for 3D animation.. In Proc. UIST. 423--434.",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Andrew J. Hunsucker, Kelly McClinton, Jennifer Wang, and Erik Stolterman. 2017. Augmented Reality Prototyping For Interaction Design Students. In Proc. CHI Extended Abstracts. 1018--1023.",
      "doi": "10.1145/3027063.3053684"
    },
    {
      "text": "Annie Kelly, R. Benjamin Shapiro, Jonathan de Halleux, and Thomas Ball. 2018. ARcadia: A Rapid Prototyping Platform for Real-time Tangible Interfaces. In Proc. CHI.",
      "doi": ""
    },
    {
      "text": "Boriana Koleva, Ian Taylor, Steve Benford, Mike Fraser, Chris Greenhalgh, Holger Schnädelbach, Dirk vom Lehn, Christian Heath, Ju Row-Farr, and Matt Adams. 2001. Orchestrating a mixed reality performance. In Proc. CHI. 38--45.",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Walter S. Lasecki, Juho Kim, Nick Rafter, Onkur Sen, Jeffrey P. Bigham, and Michael S. Bernstein. 2015. Apparition: Crowdsourced User Interfaces that Come to Life as You Sketch Them. In Proc. CHI.",
      "doi": ""
    },
    {
      "text": "Gun A. Lee, Claudia Nelles, Mark Billinghurst, and Gerard Jounghyun Kim. 2004. Immersive Authoring of Tangible Augmented Reality Applications. In Proc. ISMAR. 172--181.",
      "doi": "10.1109/ISMAR.2004.34"
    },
    {
      "text": "Sang Won Lee, Yujin Zhang, Isabelle Wong, Yi Wei Yang, Stephanie D. O'Keefe, and Walter S. Lasecki. 2017. SketchExpress: Remixing Animations for More Effective Crowd-Powered Prototyping of Interactive Interfaces. In Proc. UIST. 817--828.",
      "doi": ""
    },
    {
      "text": "Germán Leiva and Michel Beaudouin-Lafon. 2018. Montage: A Video Prototyping System to Reduce Re-Shooting and Increase Re-Usability. In Proc. UIST. 675--682.",
      "doi": "10.1145/3242587.3242613"
    },
    {
      "text": "David Lindlbauer and Andy D. Wilson. 2018. Remixed Reality: Manipulating Space and Time in Augmented Reality. In Proc. CHI. 129.",
      "doi": ""
    },
    {
      "text": "Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: a toolkit for rapid design exploration of augmented reality experiences. In Proc. UIST.",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "Jens Müller, Roman Rädle, and Harald Reiterer. 2016. Virtual Objects as Spatial Cues in Collaborative Mixed Reality Environments: How They Shape Communication Behavior and User Task Load. In Proc. CHI. 1245--1249.",
      "doi": "10.1145/2858036.2858043"
    },
    {
      "text": "Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality Augmented Reality Prototypes from Paper. In Proc. CHI.",
      "doi": "10.1145/3290605.3300826"
    },
    {
      "text": "Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proc. CHI.",
      "doi": "10.1145/3173574.3173927"
    },
    {
      "text": "Michael Nebeling and Maximilian Speicher. 2018. The Trouble with Augmented Reality/Virtuality Reality Authoring Tools. In Proc. ISMAR Adjunct.",
      "doi": ""
    },
    {
      "text": "Michael Nitsche and Sanjeev Nayak. 2012. Cell Phone Puppets: Turning Mobile Phones into Performing Objects. In Proc. ICEC. 363--372.",
      "doi": "10.1007/978-3-642-33542-6_32"
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The Go-Go Interaction Technique: Non-Linear Mapping for Direct Manipulation in VR. In Proc. UIST. 79--80.",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Dieter Schmalstieg, Anton Fuhrmann, Gerd Hesina, Zsolt Szalavári, L Miguel Encarnaçao, Michael Gervautz, and Werner Purgathofer. 2002. The studierstube augmented reality project. Presence: Teleoperators & Virtual Environments 11, 1 (2002), 33--54.",
      "doi": "10.1162/105474602317343640"
    },
    {
      "text": "Harrison Jesse Smith and Michael Neff. 2018. Communication Behavior in Embodied Virtual Reality. In Proc. CHI. 289.",
      "doi": "10.1145/3173574.3173863"
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, and Michael Nebeling. 2019. What is Mixed Reality?. In Proc. CHI.",
      "doi": "10.1145/3290605.3300767"
    },
    {
      "text": "Maximilian Speicher and Michael Nebeling. 2018. GestureWiz: A Human-Powered Gesture Design Environment for User Interface Prototypes. In Proc. CHI.",
      "doi": "10.1145/3173574.3173681"
    },
    {
      "text": "Jia Wang, Owen Leach, and Robert W. Lindeman. 2013. DIY World Builder: An immersive level-editing system. In Proc. 3DUI. 195--196.",
      "doi": ""
    }
  ]
}