{
  "doi": "10.1145/3313831.3376601",
  "title": "Closer Object Looks Smaller: Investigating the Duality of Size Perception in a Spherical Fish Tank VR Display",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2020,
  "badges": [],
  "abstract": "Fish Tank Virtual Reality (FTVR) displays provide compelling 3D experiences by rendering view-dependent imagery on a 2D screen. While users perceive a 3D object in space, they are actually looking at pixels on a 2D screen, thus, a perceptual duality exists between the object's pixels and the 3D percept potentially interfering with the experience. To investigate, we conducted an experiment to see whether the on-screen size of the 2D imagery affects the perceived object size in 3D space with different viewing conditions, including stereopsis. We found that the size of on-screen imagery significantly influenced object size perception, causing 83.3% under/overestimation of perceived size when viewing without stereopsis and reducing to 64.7% with stereopsis. Contrary to reality, objects look smaller when the viewer gets closer. Understanding the perceptual duality helps us to provide accurate perception of real-world objects depicted in the virtual environment and pave the way for 3D applications.",
  "authors": [
    {
      "name": "Qian Zhou",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161417",
      "orcid": "missing"
    },
    {
      "name": "Fan Wu",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527738",
      "orcid": "missing"
    },
    {
      "name": "Sidney Fels",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327488395",
      "orcid": "0000-0001-9279-9021"
    },
    {
      "name": "Ian Stavness",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-81319501712/rel-imgonly/ianstavness.jpg",
      "acmid": "81319501712",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roland Arsenault and Colin Ware. 2004. The importance of stereo and eye-coupled perspective for eye-hand coordination in fish tank VR. Presence: Teleoperators and Virtual Environments 13, 5 (2004), 549--559.",
      "doi": "10.1162/1054746042545300"
    },
    {
      "text": "Kevin W Arthur, Kellogg S Booth, and Colin Ware. 1993. Evaluating 3d task performance for fish tank virtual worlds. ACM Transactions on Information Systems (TOIS) 11, 3 (1993), 239--265.",
      "doi": "10.1145/159161.155359"
    },
    {
      "text": "Hrvoje Benko, Andrew D Wilson, and Federico Zannier. 2014. Dyadic projected spatial augmented reality. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 645--655.",
      "doi": "10.1145/2642918.2647402"
    },
    {
      "text": "Mark F Bradshaw, Andrew D Parton, and Richard A Eagle. 1998. The interaction of binocular disparity and motion parallax in determining perceived depth and perceived size. Perception 27, 11 (1998), 1317--1331.",
      "doi": ""
    },
    {
      "text": "Carolina Cruz-Neira, Daniel J Sandin, and Thomas A DeFanti. 1993. Surround-screen projection-based virtual reality: the design and implementation of the CAVE. In Proceedings of the 20th annual conference on Computer graphics and interactive techniques. ACM, 135--142.",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Robert G Eggleston, William P Janson, and Kenneth A Aldrich. 1996. Virtual reality system effects on size-distance judgements in a virtual environment. In Virtual Reality Annual International Symposium, 1996., Proceedings of the IEEE 1996. IEEE, 139--146.",
      "doi": ""
    },
    {
      "text": "Kevin W Elner and Helen Wright. 2015. Phenomenal regression to the real object in physical and virtual worlds. Virtual Reality 19, 1 (2015), 21--31.",
      "doi": "10.1007/s10055-014-0257-x"
    },
    {
      "text": "Dylan Fafard, Ian Stavness, Martin Dechant, Regan Mandryk, Qian Zhou, and Sidney Fels. 2019. FTVR in VR: Evaluation of 3D Perception With a Simulated Volumetric Fish-Tank Virtual Reality Display. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 533.",
      "doi": "10.1145/3290605.3300763"
    },
    {
      "text": "Dylan Fafard, Andrew Wagemakers, Ian Stavness, Qian Zhou, Gregor Miller, and Sidney S Fels. 2017. Calibration Methods for Effective Fish Tank VR in Multi-screen Displays. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 373--376.",
      "doi": "10.1145/3027063.3052963"
    },
    {
      "text": "Dylan Brodie Fafard, Qian Zhou, Chris Chamberlain, Georg Hagemann, Sidney Fels, and Ian Stavness. 2018. Design and implementation of a multi-person fish-tank virtual reality display. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology. ACM, 5.",
      "doi": "10.1145/3281505.3281540"
    },
    {
      "text": "Davide Gadia, Gianfranco Garipoli, Cristian Bonanomi, Luigi Albani, and Alessandro Rizzi. 2014. Assessing stereo blindness and stereo acuity on digital displays. Displays 35, 4 (2014), 206--212.",
      "doi": ""
    },
    {
      "text": "James J Gibson. 1971. The information available in pictures. Leonardo 4, 1 (1971), 27--35.",
      "doi": ""
    },
    {
      "text": "Ralph Norman Haber. 1980. How We Perceive Depth from Flat Pictures: The inherent dual reality in pictorial art enables us to perceive a scene as three dimensional at the same time we see that the painting or photograph is actually flat. American Scientist 68, 4 (1980), 370--380.",
      "doi": ""
    },
    {
      "text": "Jonathan W Kelly, Lucia A Cherep, and Zachary D Siegel. 2017. Perceived space in the HTC vive. ACM Transactions on Applied Perception (TAP) 15, 1 (2017), 2.",
      "doi": ""
    },
    {
      "text": "Jonathan W Kelly, Lisa S Donaldson, Lori A Sjolund, and Jacob B Freiberg. 2013. More than just perception--action recalibration: Walking through a virtual environment causes rescaling of perceived space. Attention, Perception, & Psychophysics 75, 7 (2013), 1473--1485.",
      "doi": ""
    },
    {
      "text": "Robert V Kenyon, Daniel Sandin, Randall C Smith, Richard Pawlicki, and Thomas Defanti. 2007. Size-constancy in the CAVE. Presence: Teleoperators and Virtual Environments 16, 2 (2007), 172--187.",
      "doi": "10.1162/pres.16.2.172"
    },
    {
      "text": "Kibum Kim, John Bolton, Audrey Girouard, Jeremy Cooperstock, and Roel Vertegaal. 2012. TeleHuman: effects of 3d perspective on gaze and pose estimation with a life-size cylindrical telepresence pod. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2531--2540.",
      "doi": "10.1145/2207676.2208640"
    },
    {
      "text": "Sirisilp Kongsilp and Matthew N Dailey. 2017. Motion parallax from head movement enhances stereoscopic displays by improving presence and decreasing visual fatigue. Displays 49 (2017), 72--79.",
      "doi": ""
    },
    {
      "text": "Billy Lam, Yichen Tang, Ian Stavness, and Sidney Fels. 2011. A 3D cubic puzzle in pCubee. In 3D User Interfaces (3DUI), 2011 IEEE Symposium on. IEEE, 135--136.",
      "doi": ""
    },
    {
      "text": "Xun Luo, Robert Kenyon, Derek Kamper, Daniel Sandin, and Thomas DeFanti. 2007. The effects of scene complexity, stereovision, and motion parallax on size constancy in a virtual environment. In Virtual Reality Conference, 2007. VR'07. IEEE. IEEE, 59--66.",
      "doi": ""
    },
    {
      "text": "Kevin Ponto, Michael Gleicher, Robert G Radwin, and Hyun Joon Shin. 2013. Perceptual calibration for immersive display environments. IEEE transactions on visualization and computer graphics 19, 4 (2013), 691--700.",
      "doi": "10.1109/TVCG.2013.36"
    },
    {
      "text": "Zachary D Siegel, Jonathan W Kelly, and Lucia A Cherep. 2017. Rescaling of perceived space transfers across virtual environments. Journal of Experimental Psychology: Human Perception and Performance 43, 10 (2017), 1805.",
      "doi": ""
    },
    {
      "text": "Ian Stavness, Billy Lam, and Sidney Fels. 2010. pCubee: a perspective-corrected handheld cubic display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1381--1390.",
      "doi": "10.1145/1753326.1753535"
    },
    {
      "text": "Ian Stavness, Florian Vogt, and Sidney Fels. 2006. Cubee: a cubic 3D display for physics-based interaction. In ACM SIGGRAPH 2006 Sketches. ACM, 165.",
      "doi": "10.1145/1179849.1180055"
    },
    {
      "text": "Jeanine K Stefanucci, Sarah H Creem-Regehr, William B Thompson, David A Lessard, and Michael N Geuss. 2015. Evaluating the accuracy of size perception on screen-based displays: Displayed objects appear smaller than real objects. Journal of Experimental Psychology: Applied 21, 3 (2015), 215.",
      "doi": ""
    },
    {
      "text": "Maurice HPH van Beurden, Andre Kuijsters, and Wijnand A IJsselsteijn. 2010. Performance of a path tracing task using stereoscopic and motion based depth cues. In 2010 Second International Workshop on Quality of Multimedia Experience (QoMEX). IEEE, 176--181.",
      "doi": ""
    },
    {
      "text": "D Vishwanath. 2011. Information in surface and depth perception: Reconciling pictures and reality. Perception beyond inference (2011), 201--240.",
      "doi": ""
    },
    {
      "text": "Andrew Wagemakers, Dylan Fafard, and Ian Stavness. 2017, to appear. Interactive visual calibration of volumetric head-tracked 3D displays. In 2017 SIGCHI Conference on Human Factors in Computing Systems (CHI '17). ACM.",
      "doi": "10.1145/3025453.3025685"
    },
    {
      "text": "Andrew John Wagemakers, Dylan Brodie Fafard, and Ian Stavness. 2017. Interactive visual calibration of volumetric head-tracked 3d displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3943--3953.",
      "doi": "10.1145/3025453.3025685"
    },
    {
      "text": "Leonard C Wanger, James A Ferwerda, and Donald P Greenberg. 1992. Perceiving spatial relationships in computer-generated images. IEEE Computer Graphics and Applications 3 (1992), 44--51.",
      "doi": "10.1109/38.135913"
    },
    {
      "text": "Colin Ware. 2006. 3D contour perception for flow visualization. In Proceedings of the 3rd symposium on Applied perception in graphics and visualization. ACM, 101--106.",
      "doi": "10.1145/1140491.1140512"
    },
    {
      "text": "Colin Ware. 2012. Information visualization: perception for design. Elsevier.",
      "doi": "10.5555/2285540"
    },
    {
      "text": "Colin Ware and Glenn Franck. 1996. Evaluating stereo and motion cues for visualizing information nets in three dimensions. ACM Transactions on Graphics (TOG) 15, 2 (1996), 121--140.",
      "doi": "10.1145/234972.234975"
    },
    {
      "text": "Qian Zhou, Georg Hagemann, Dylan Fafard, Ian Stavness, and Sidney Fels. 2019. An Evaluation of Depth and Size Perception on a Spherical Fish Tank Virtual Reality Display. IEEE transactions on visualization and computer graphics 25, 5 (2019), 2040--2049.",
      "doi": ""
    },
    {
      "text": "Qian Zhou, Georg Hagemann, Sidney Fels, Dylan Fafard, Andrew Wagemakers, Chris Chamberlain, and Ian Stavness. 2018. Coglobe: a co-located multi-person FTVR experience. In ACM SIGGRAPH 2018 Emerging Technologies. ACM, 5.",
      "doi": "10.1145/3214907.3214914"
    },
    {
      "text": "Qian Zhou, Gregor Miller, Kai Wu, Daniela Correa, and Sidney Fels. 2017. Automatic calibration of a multiple-projector spherical fish tank vr display. In Applications of Computer Vision (WACV), 2017 IEEE Winter Conference on. IEEE, 1072--1081.",
      "doi": ""
    }
  ]
}