{
  "doi": "10.1145/3313831.3376331",
  "title": "Investigating the Effects of Self-Avatars and Story-Relevant Avatars on Children's Creative Storytelling",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Storytelling is a critical step in the cognitive development of children. Particularly, this requires children to mentally project into the story context and to identify with the thoughts of the characters in their stories. We propose to support free imagination in creative storytelling through an enactment-based approach that allows children to embody an avatar and perform as the story character. We designed our story creation interface with two modes of avatar: the story-relevant avatar and the self-avatar, to investigate the effects of avatar design on the quality of children's creative products. In our study with 20 child participants, the results indicate that self-avatars can create a stronger sense of identification and embodied presence, while story-relevant avatars can provide a scaffold for mental projection.",
  "tags": [
    "storytelling",
    "expressive writing",
    "embodied interaction",
    "virtual reality",
    "creativity"
  ],
  "authors": [
    {
      "name": "Niloofar Zarei",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706183",
      "orcid": "missing"
    },
    {
      "name": "Sharon Lynn Chu",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758728357",
      "orcid": "missing"
    },
    {
      "name": "Francis Quek",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100361835",
      "orcid": "missing"
    },
    {
      "name": "Nanjie 'Jimmy' Rao",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528682",
      "orcid": "missing"
    },
    {
      "name": "Sarah Anne Brown",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529059",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Teresa M. Amabile, Regina Conti, Heather Coon, Jeffrey Lazenby, and Michael Herron. 1996. Assessing the work environment for creativity. Academy of management journal 39, 5 (1996), 1154--1184.",
      "doi": ""
    },
    {
      "text": "Hamlet Autman and Stephanie Kelly. 2017. Reexamining the writing apprehension measure. Business and Professional Communication Quarterly 80, 4 (2017), 516--529.",
      "doi": ""
    },
    {
      "text": "Rachel Bailey, Kevin Wise, and Paul Bolls. 2009. How avatar customizability affects children's arousal and subjective presence during junk food--sponsored online video games. CyberPsychology & Behavior 12, 3 (2009), 277--283.",
      "doi": ""
    },
    {
      "text": "Marion Boberg, Petri Piippo, and Elina Ollila. 2008. Designing avatars. In Proceedings of the 3rd international conference on Digital Interactive Media in Entertainment and Arts. ACM, 232--239.",
      "doi": "10.1145/1413634.1413679"
    },
    {
      "text": "S. Chu and Francis Quek. 2013. Maia: A methodology for assessing imagination in action. In CHI 2013 Workshop on Evaluation Methods for Creativity Support Environments.",
      "doi": ""
    },
    {
      "text": "Sharon Lynn Chu, Francis Quek, and Kumar Sridharamurthy. 2014. Ready... action!: a performative authoring system for children to create animated stories. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology. ACM, 52.",
      "doi": "10.1145/2663806.2663858"
    },
    {
      "text": "Sharon Lynn Chu, Francis Quek, and Kumar Sridharamurthy. 2015. Augmenting Children's Creative Self-Efficacy and Performance through Enactment-Based Animated Storytelling. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 209--216.",
      "doi": "10.1145/2677199.2680602"
    },
    {
      "text": "Sharon Lynn Chu, Francis Quek, and Joshua Tanenbaum. 2013. Performative authoring: nurturing storytelling in children through imaginative enactment. In International Conference on Interactive Digital Storytelling. Springer, 144--155.",
      "doi": "10.1007/978-3-319-02756-2_18"
    },
    {
      "text": "Jonathan Cohen. 2001. Defining identification: A theoretical look at the identification of audiences with media characters. Mass communication & society 4, 3 (2001), 245--264.",
      "doi": ""
    },
    {
      "text": "Alwin de Rooij, Sarah van der Land, and Shelly van Erp. 2017. The creative Proteus Effect: How self-similarity, embodiment, and priming of creative stereotypes with avatars influences creative ideation. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition. ACM, 232--236.",
      "doi": ""
    },
    {
      "text": "James E Deal, Charles F Halverson Jr, Roy P Martin, James Victor, and Spencer Baker. 2007. The Inventory of Children's Individual Differences: Development and validation of a short version. Journal of Personality Assessment 89, 2 (2007), 162--166.",
      "doi": ""
    },
    {
      "text": "MG Dias and Paul L Harris. 1988. The effect of make-believe play on deductive reasoning. British journal of developmental psychology 6, 3 (1988), 207--221.",
      "doi": ""
    },
    {
      "text": "Mara Dionisio, Paulo Bala, Valentina Nisi, and Nuno Nunes. 2017. Fragments of laura: incorporating mobile virtual reality in location aware mobile storytelling experiences. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia. ACM, 165--176.",
      "doi": "10.1145/3152832.3152868"
    },
    {
      "text": "Augusto Esteves, Elise van den Hoven, and Ian Oakley. 2013. Physical games or digital games?: comparing support for mental projection in tangible and virtual representations of a problem-solving task. In Proceedings of the 7th international conference on tangible, embedded and embodied interaction. ACM, 167--174.",
      "doi": ""
    },
    {
      "text": "Garry Falloon. 2010. Using avatars and virtual environments in learning: What do they have to offer? British Journal of Educational Technology 41, 1 (2010), 108--122.",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Jeremy N Bailenson. 2009. Virtual self-modeling: The effects of vicarious reinforcement and identification on exercise behaviors. Media Psychology 12, 1 (2009), 1--25.",
      "doi": ""
    },
    {
      "text": "Franca Garzotto. 2014. Interactive storytelling for children: a survey. International Journal of Arts and Technology 7, 1 (2014), 5--16.",
      "doi": ""
    },
    {
      "text": "Jérôme Guegan, Stéphanie Buisine, Fabrice Mantelet, Nicolas Maranzana, and Frédéric Segonds. 2016. Avatar-mediated creativity: When embodying inventors makes engineers more creative. Computers in Human Behavior 61 (2016), 165--175.",
      "doi": "10.1016/j.chb.2016.03.024"
    },
    {
      "text": "VS Gupta. 2003. Elements of news story-5Ws and 1H. Handbook of Reporting and Communication Skills 25 (2003).",
      "doi": ""
    },
    {
      "text": "WA IJsselsteijn, YAW De Kort, and Karolien Poels. 2013. The game experience questionnaire. Eindhoven: Technische Universiteit Eindhoven (2013).",
      "doi": ""
    },
    {
      "text": "Changsoo Kim, Sang-Gun Lee, and Minchoel Kang. 2012. I became an attractive person in the virtual world: Users' identification with virtual communities and avatars. Computers in Human Behavior 28, 5 (2012), 1663--1669.",
      "doi": "10.1016/j.chb.2012.04.004"
    },
    {
      "text": "David Kirsh. 2009. Projection, problem space and anchoring. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 31.",
      "doi": ""
    },
    {
      "text": "David Kirsh. 2010. Thinking with external representations. Ai & Society 25, 4 (2010), 441--454.",
      "doi": "10.5555/1894703.1894709"
    },
    {
      "text": "Dong Dong Li, Albert Kien Liau, and Angeline Khoo. 2013. Player--Avatar Identification in video gaming: Concept and measurement. Computers in Human Behavior 29, 1 (2013), 257--263.",
      "doi": "10.1016/j.chb.2012.09.002"
    },
    {
      "text": "Fei Lu, Feng Tian, Yingying Jiang, Xiang Cao, Wencan Luo, Guang Li, Xiaolong Zhang, Guozhong Dai, and Hongan Wang. 2011. ShadowStory: creative and collaborative digital storytelling inspired by cultural heritage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1919--1928.",
      "doi": "10.1145/1978942.1979221"
    },
    {
      "text": "Vonnie C McLoyd. 1983. The effects of the structure of play objects on the pretend play of low-income preschool children. Child Development (1983), 626--635.",
      "doi": ""
    },
    {
      "text": "Paul R Messinger, Xin Ge, Eleni Stroulia, Kelly Lyons, Kristen Smirnov, and Michael Bone. 2008. On the relationship between my avatar and myself. Journal For Virtual Worlds Research 1, 2 (2008).",
      "doi": ""
    },
    {
      "text": "State of Texas Assessments of Academic Readiness. 2019. Personal Narrative Writing Rubric - Grade 4. https://tea.texas.gov/sites/default/files/Rubric-WritingGr04.pdf. (2019).",
      "doi": ""
    },
    {
      "text": "Hannah Park, Sarah Brown, and Sharon Lynn Chu. 2019. Understanding Avatar Identification Through Visual Similarity for Richer Story Creation. In International Conference on Human-Computer Interaction. Springer, 423--431.",
      "doi": ""
    },
    {
      "text": "Jackie Peck. 1989. Using storytelling to promote language and literacy development. The Reading Teacher 43, 2 (1989), 138.",
      "doi": ""
    },
    {
      "text": "Mary A Pulaski. 1973. Toys and imaginative play. The child's world of make-believe (1973), 74--103.",
      "doi": ""
    },
    {
      "text": "Lisa M Register and Tracy B Henley. 1992. The phenomenology of intimacy. Journal of Social and Personal Relationships 9, 4 (1992), 467--481.",
      "doi": ""
    },
    {
      "text": "Astrida L Seja and Sandra W Russ. 1999. Children's fantasy play and emotional understanding. Journal of clinical child psychology 28, 2 (1999), 269--277.",
      "doi": ""
    },
    {
      "text": "Unity Asset Store. 2019. RootMotion: FinalIK. https://assetstore.unity.com/packages/tools/animation/final-ik-14290. (2019).",
      "doi": ""
    },
    {
      "text": "Masanori Sugimoto, Toshitaka Ito, Tuan Ngoc Nguyen, and Shigenori Inagaki. 2009. GENTORO: a system for supporting children's storytelling using handheld projectors and a robot. In Proceedings of the 8th International Conference on Interaction Design and Children. ACM, 214--217.",
      "doi": "10.1145/1551788.1551832"
    },
    {
      "text": "Cristina Sylla, Clara Coutinho, and Pedro Branco. 2014. A digital manipulative for embodied \"stage-narrative\" creation. Entertainment Computing 5, 4 (2014), 495--507.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2019. Unity3D. https://unity.com. (2019).",
      "doi": ""
    },
    {
      "text": "Pamela Tierney and Steven M Farmer. 2002. Creative self-efficacy: Its potential antecedents and relationship to creative performance. Academy of Management journal 45, 6 (2002), 1137--1148.",
      "doi": ""
    },
    {
      "text": "Jan Van Looy, Cédric Courtois, Melanie De Vocht, and Lieven De Marez. 2012. Player identification in online games: Validation of a scale for measuring identification in MMOGs. Media Psychology 15, 2 (2012), 197--221.",
      "doi": ""
    },
    {
      "text": "Asimina Vasalou, Adam N Joinson, and Jeremy Pitt. 2007. Constructing my online self: avatars that increase self-focused attention. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 445--448.",
      "doi": "10.1145/1240624.1240696"
    },
    {
      "text": "Astrid M Von der Pütten, Nicole C Krämer, Jonathan Gratch, and Sin-Hwa Kang. 2010. It doesn't matter what you are! Explaining social effects of agents and avatars. Computers in Human Behavior 26, 6 (2010), 1641--1650.",
      "doi": "10.1016/j.chb.2010.06.012"
    },
    {
      "text": "Lev Semenovich Vygotsky. 2004. Imagination and creativity in childhood. Journal of Russian & East European Psychology 42, 1 (2004), 7--97.",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271--290.",
      "doi": ""
    },
    {
      "text": "Lei Zhang, Doug A Bowman, and Caroline N Jones. 2019. Exploring Effects of Interactivity on Learning with Interactive Storytelling in Immersive Virtual Reality. In 2019 11th International Conference on Virtual Worlds and Games for Serious Applications (VS-Games). IEEE, 1--8.",
      "doi": ""
    }
  ]
}