{
  "doi": "10.1145/3313831.3376332",
  "title": "Restorative Play: Videogames Improve Player Wellbeing After a Need-Frustrating Event",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "People often use videogames to restore wellbeing after negative experiences in day-to-day life. Although some research suggests that play can restore wellbeing, few studies have investigated the means by which restoration occurs. We employed self-determination theory (SDT) to understand how and to what degree play improves wellbeing after a need-frustrating event, and how players understand experiences of competence in play. Sixty-five participants worked at a competence manipulation task prior to playing a competence-satisfying videogame. Competence, affect, and vitality improved during play, and in-game experiences of need frustration were observed to effectively predict post-play negative affect. Post-experiment interviews indicate that videogames are seen to support competence relative to perceived skill, extending our knowledge of how design can support competence and restoration. We demonstrate that play can restore wellbeing, present need frustration as a means to explain negative experiences with interactive systems, and discuss effects of design on competence.",
  "tags": [
    "need frustration",
    "player experience",
    "restoration",
    "self-determination theory",
    "wellbeing",
    "video games"
  ],
  "authors": [
    {
      "name": "April Tyack",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078187",
      "orcid": "missing"
    },
    {
      "name": "Peta Wyeth",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100401053",
      "orcid": "missing"
    },
    {
      "name": "Daniel Johnson",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100455670",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paul JC Adachi and Teena Willoughby. 2015. From the Couch to the Sports Field: The Longitudinal Associations Between Sports Video Game Play, Self-Esteem, and Involvement in Sports. Psychology of Popular Media Culture 4, 4, 329--341.",
      "doi": ""
    },
    {
      "text": "James W. Adie, Joan L. Duda, and Nikos Ntoumanis. 2008. Autonomy Support, Basic Need Satisfaction and the Optimal Functioning of Adult Male and Female Sport Participants: A Test of Basic Needs Theory. Motivation and Emotion 32, 3, 189--199.",
      "doi": ""
    },
    {
      "text": "Johnie J. Allen and Craig A. Anderson. 2018. Satisfaction and Frustration of Basic Psychological Needs in the Real World and in Video Games Predict Internet Gaming Disorder Scores and Well-Being. Computers in Human Behavior 84, 220--229.",
      "doi": "10.1016/j.chb.2018.02.034"
    },
    {
      "text": "Kimberley J. Bartholomew, Nikos Ntoumanis, Ricardo Cuevas, and Chris Lonsdale. 2014. Job Pressure and Ill-Health in Physical Education Teachers: The Mediating Role of Psychological Need Thwarting. Teaching and Teacher Education 37, 101--107.",
      "doi": ""
    },
    {
      "text": "Kimberley J. Bartholomew, Nikos Ntoumanis, Athanasios Mouratidis, Ermioni Katartzi, Cecilie Thøgersen-Ntoumani, and Symeon Vlachopoulos. 2018. Beware of Your Teaching Style: A School-Year Long Investigation of Controlling Teaching and Student Motivational Experiences. Learning and Instruction 53, 50--63.",
      "doi": ""
    },
    {
      "text": "Kimberley J. Bartholomew, Nikos Ntoumanis, Richard M. Ryan, Jos A. Bosch, and Cecilie Thøgersen-Ntoumani. 2011. Self-Determination Theory and Diminished Functioning: The Role of Interpersonal Control and Psychological Need Thwarting. Personality and Social Psychology Bulletin 37, 11, 1459--1473.",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Ioanna Iacovides, Daniel Johnson, and Regan L. Mandryk. 2015. The False Dichotomy Between Positive and Negative Affect in Game Play. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, 799--804.",
      "doi": ""
    },
    {
      "text": "Max V. Birk and Regan L. Mandryk. 2013. Control Your Game-Self: Effects of Controller Type on Enjoyment, Motivation, and Personality in Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 685--694.",
      "doi": ""
    },
    {
      "text": "Keith Blount, Lee Powell, Tihomir Dolapchiev, Ioa Petra'ka, Janik Baumgartner, David Vignoni, and Kenichi Yoshida. 2016. Scrivener for Windows and Linux [Version 1.9.7]. Literature and Latte.",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Elisa D. Mekler, and Klaus Opwis. 2016. Negative Emotion, Positive Experience?: Emotionally Moving Moments in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2996--3006.",
      "doi": "10.1145/2858036.2858227"
    },
    {
      "text": "Julia Ayumi Bopp, Klaus Opwis, and Elisa D. Mekler. 2018. \"An Odd Kind of Pleasure\": Differentiating Emotional Challenge in Digital Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Terence J. Bostic, Doris McGartland Rubio, and Mark Hood. 2000. A Validation of the Subjective Vitality Scale Using Structural Equation Modeling. Social Indicators Research 52, 3, 313--324.",
      "doi": ""
    },
    {
      "text": "Jeroen Bourgonjon, Geert Vandermeersche, Bram De Wever, Ronald Soetaert, and Martin Valcke. 2016. Players' Perspectives on the Positive Impact of Video Games: A Qualitative Content Analysis of Online Forum Discussions. New Media & Society 18, 8, 1732--1749.",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman and Ron Tamborini. 2015. \"In the Mood to Game\": Selective Exposure and Mood Management Processes in Computer Game Play. New Media & Society 17, 3, 375--393.",
      "doi": ""
    },
    {
      "text": "G. E. P. Box and D. R. Cox. 1964. An Analysis of Transformations. Journal of the Royal Statistical Society 26, 2, 211--252.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 77--101.",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Florian Brühlmann and Gian-Marco Schmid. 2015. How to Measure the Game Experience? Analysis of the Factor Structure of Two Questionnaires. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1181--1186.",
      "doi": ""
    },
    {
      "text": "Center for Self-Determination Theory. n.d. Intrinsic Motivation Inventory (IMI). Accessed 22 August, 2019 from https://selfdeterminationtheory.org/intrinsicmotivation-inventory/.",
      "doi": ""
    },
    {
      "text": "Beiwen Chen, Maarten Vansteenkiste, Wim Beyers, Liesbet Boone, Edward L. Deci, Jolene Van der Kaap-Deeder, Bart Duriez, Willy Lens, Lennia Matos, Athanasios Mouratidis, Richard M. Ryan, Kennon M. Sheldon, Bart Soenens, Stijn Van Petegem, and Joke Verstuyf. 2015. Basic Psychological Need Satisfaction, Need Frustration, and Need Strength Across Four Cultures. Motivation and Emotion 39, 2, 216--236.",
      "doi": "10.1007/s11031-014-"
    },
    {
      "text": "Tom Cole, Paul Cairns, and Marco Gillies. 2015. Emotional and Functional Challenge in Core and Avant-garde Games. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, 121--126.",
      "doi": "10.1145/2793107.2793147"
    },
    {
      "text": "Emily Collins and Anna L. Cox. 2014. Switch On to Games: Can Digital Games Aid Post-Work Recovery? International Journal of Human-Computer Studies 72, 654--662.",
      "doi": "10.1016/j.ijhcs.2013.12.006"
    },
    {
      "text": "Pedro Cordeiro, Paula Paixão, Willy Lens, Marlies Lacante, and Kennon M. Sheldon. 2016. Factor Structure and Dimensionality of the Balanced Measure of Psychological Needs Among Portuguese High School Students. Relations to Well-Being and Ill-Being. Learning and Individual Differences 47, 51--60.",
      "doi": ""
    },
    {
      "text": "Richard B. Darlington and Andrew F. Hayes. 2016. Regression Analysis and Linear Models: Concepts, Applications, and Implementation. Guilford Press, New York, USA.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci, Robert E. Driver, Lucinda Hotchkiss, Robert J. Robbins, and Ilona McDougal Wilson. 1993. The Relation of Mothers' Controlling Vocalisations to Children's Intrinsic Motivation. Journal of Experimental Child Psychology 55, 2, 151--162.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The \"What\" and \"Why\" of Goal Pursuits: Human Needs and Self-Determination of Behavior. Psychological Inquiry 11, 4, 227--268.",
      "doi": ""
    },
    {
      "text": "Anita DeLongis, James C. Coyne, Gayle Dakof, Susan Folkman, and Richard S. Lazarus. 1982. Relationship of Daily Hassles, Uplifts, and Major Life Events to Health Status. Health Psychology 1, 2, 119--136.",
      "doi": ""
    },
    {
      "text": "Alena Denisova, Christian Guckelsberger, and David Zendle. 2017. Challenge in Digital Games: Towards Developing a Measurement Tool. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2511--2519.",
      "doi": "10.1145/3027063.3053209"
    },
    {
      "text": "Alena Denisova, A. Imran Nordin, and Paul Cairns. 2016. The Convergence of Player Experience Questionnaires. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM.",
      "doi": "10.1145/2967934.2968095"
    },
    {
      "text": "Ed Diener and Robert A. Emmons. 1984. The Independence of Positive and Negative Affect. Journal of Personality and Social Psychology 47, 5, 1105--1117.",
      "doi": ""
    },
    {
      "text": "Anders Drachen. 2015. Behavioral Telemetry in Games User Research. In Game User Experience Evaluation, Regina Bernhaupt (Ed.). Springer International, Switzerland, 135--165.",
      "doi": ""
    },
    {
      "text": "Stephen R. Earl, Ian M. Taylor, Carla Meijen, and Louis Passfield. 2017. Autonomy and Competence Frustration in Young Adolescent Classrooms: Different Associations with Active and Passive Disengagement. Learning and Instruction 49, 32--40.",
      "doi": ""
    },
    {
      "text": "Malte Elson and Thorsten Quandt. 2016. Digital Games in Laboratory Experiments: Controlling a Complex Stimulus Through Modding. Psychology of Popular Media Culture 5, 1, 52--65.",
      "doi": ""
    },
    {
      "text": "Andy Field, Jeremy Miles, and Zoë Field. 2012. Exploring Assumptions. In Discovering Statistics Using R. Sage, London, England, 166--204.",
      "doi": ""
    },
    {
      "text": "Matthew Fish, Carmen V. Russoniello, and Kevin O'Brien. 2014. The Efficacy of Prescribed Casual Videogame Play in Reducing Symptoms of Anxiety: A Randomized Controlled Study. Games for Health Journal 3, 5, 291--295.",
      "doi": ""
    },
    {
      "text": "Nicolas Gillet, Jacques Forest, Charles Benabou, and Kathleen Bentein. 2015a. The Effects of Organizational Factors, Psychological Need Satisfaction and Thwarting, and Affective Commitment on Workers' Well-Being and Turnover Intentions. Le Travail Humain 78, 2, 119--140.",
      "doi": ""
    },
    {
      "text": "Nicolas Gillet, Evelyne Fouquereau, Tiphaine Huyghebaert, and Philippe Colombat. 2015b. The Effects of Job Demands and Organizational Resources through Psychological Need Satisfaction and Thwarting. The Spanish Journal of Psychology 18.",
      "doi": ""
    },
    {
      "text": "Nicolas Gillet, Marc-André K. Lafrenière, Robert J. Vallerand, Isabelle Huart, and Evelyne Fouquereau. 2014. The Effects of Autonomous and Controlled Regulation of Performance-Approach Goals on Well-Being: A Process Model. British Journal of Social Psychology 53, 1, 154--174.",
      "doi": ""
    },
    {
      "text": "Katie E. Gunnell, Peter R. E. Crocker, Philip M. Wilson, Diane E. Mack, and Bruno D. Zumbo. 2013. Psychological Need Satisfaction and Thwarting: A Test of Basic Psychological Needs Theory in Physical Activity Contexts. Psychology of Sport and Exercise 14, 5, 599--607.",
      "doi": ""
    },
    {
      "text": "Leen Haerens, Nathalie Aelterman, Maarten Vansteenkiste, Bart Soenens, and Stijn Van Petegem. 2015. Do Perceived Autonomy-Supportive and Controlling Teaching Relate to Physical Education Students' Motivational Experiences Through Unique Pathways? Distinguishing Between the Bright and Dark Side of Motivation. Psychology of Sport and Exercise 16, 3, 26--36.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides and Elisa D. Mekler. 2019. The Role of Gaming During Difficult Life Experiences. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Hyungshim Jang, Eun Joo Kim, and Johnmarshall Reeve. 2016. Why Students Become More Engaged or More Disengaged During the Semester: A Self-Determination Theory Dual-Process Model. Learning and Instruction 43, 27--38.",
      "doi": ""
    },
    {
      "text": "JASP Team. 2017. JASP [Version 0.8.5.1]. University of Amsterdam, Netherlands. https://jasp-stats.org/.",
      "doi": ""
    },
    {
      "text": "Darshana Jayemanne. 2017. Performativity in Art, Literature, and Videogames. Springer International, Cham, Switzerland.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett. 2010. Is Game Immersion Just Another Form of Selective Attention? An Empirical Investigation of Real World Dissociation in Computer Game Immersion. Thesis.",
      "doi": ""
    },
    {
      "text": "Daniel Johnson and John Gardner. 2010. Personality, Motivation and Video Games. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction. ACM, 276--279.",
      "doi": "10.1145/1952222.1952281"
    },
    {
      "text": "Daniel Johnson, M. John Gardner, and Ryan Perry. 2018. Validation of Two Game Experience Scales: The Player Experience of Need Satisfaction (PENS) and Game Experience Questionnaire (GEQ). International Journal of Human-Computer Studies 118, 38--46.",
      "doi": ""
    },
    {
      "text": "Will Kalkhoff, Reef Youngreen, Leda Nath, and Michael J. Lovaglia. 2014. Human Participants in Laboratory Experiments in the Social Sciences. In Laboratory Experiments in the Social Sciences, Murray Webster and Jane Sell (Eds.). Elsevier, 103--126.",
      "doi": ""
    },
    {
      "text": "Allen D. Kanner, James C. Coyne, Catherine Schaefer, and Richard S. Lazarus. 1981. Comparison of Two Modes of Stress Measurement: Daily Hassles and Uplifts Versus Major Life Events. Journal of Behavioral Medicine 4, 1, 1--39.",
      "doi": ""
    },
    {
      "text": "Maximus D. Kaos, Ryan E. Rhodes, Perttu Hämäläinen, and T. C. Graham. 2019. Social Play in an Exergame: How the Need to Belong Predicts Adherence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Ken Kelley and Sunthud Pornprasertmanit. 2016. Confidence Intervals for Population Reliability Coefficients: Evaluation of Methods, Recommendations, and Software for Composite Measures. Psychological Methods 21, 1, 69--92.",
      "doi": ""
    },
    {
      "text": "Brendan Keogh. 2018a. A Play of Bodies: How We Perceive Videogames. MIT, Cambridge, USA.",
      "doi": ""
    },
    {
      "text": "Brendan Keogh. 2018b. With Thumbs in Mind. In A Play of Bodies: How We Perceive Videogames. MIT, Cambridge, USA, 75--108.",
      "doi": ""
    },
    {
      "text": "Madison Klarkowski, Daniel Johnson, Peta Wyeth, Mitchell McEwan, Cody Phillips, and Simon Smith. 2016. Operationalising and Evaluating Sub-Optimal and Optimal Play Experiences through Challenge-Skill Manipulation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5583--5594.",
      "doi": "10.1145/2858036.2858563"
    },
    {
      "text": "Madison Klarkowski, Daniel Johnson, Peta Wyeth, Simon Smith, and Cody Phillips. 2015. Operationalising and Measuring Flow in Video Games. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. ACM, 114--118.",
      "doi": "10.1145/2838739.2838826"
    },
    {
      "text": "Klei Entertainment. 2012. Mark of the Ninja. Videogame [PC]. Microsoft Studios, Washington, USA.",
      "doi": ""
    },
    {
      "text": "Andrew Kuo, Richard J. Lutz, and Jacob L. Hiler. 2016. Brave New World of Warcraft: A Conceptual Framework for Active Escapism. Journal of Consumer Marketing 33, 7, 498--506.",
      "doi": ""
    },
    {
      "text": "Effie L.-C. Law, Florian Brühlmann, and Elisa D. Mekler. 2018. Systematic Review and Validation of the Game Experience Questionnaire (GEQ) -- Implications for Citation and Reporting Practice. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, 257--270.",
      "doi": ""
    },
    {
      "text": "Ylenio Longo, Alexander Gunz, Guy J. Curtis, and Tom Farsides. 2016. Measuring Need Satisfaction and Frustration in Educational and Work Contexts: The Need Satisfaction and Frustration Scale (NSFS). Journal of Happiness Studies 17, 1, 295--317.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Stefan Rank, Sharon T. Steinemann, Max V. Birk, and Ioanna Iacovides. 2016. Designing for Emotional Complexity in Games: The Interplay of Positive and Negative Affect. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. ACM, 367--371.",
      "doi": "10.1145/2968120.2968126"
    },
    {
      "text": "Metacritic. 2013. Mark of the Ninja Critic Reviews for PC. https://www.metacritic.com/game/pc/mark-of-theninja/critic-reviews (Accessed 21 December, 2018).",
      "doi": ""
    },
    {
      "text": "Alexander Muscat and Jonathan Duckworth. 2018. WORLD4: Designing Ambiguity for First-Person Exploration Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, 341--351.",
      "doi": "10.1145/3242671.3242705"
    },
    {
      "text": "Bonnie Nardi and Justin Harris. 2006. Strangers and Friends: Collaborative Play in World of Warcraft. In Proceedings of the 2006 Conference on Computer Supported Cooperative Work. ACM, 149--158.",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Christopher A. Oswald, Chris Prorock, and Shane M. Murphy. 2014. The Perceived Meaning of the Video Game Experience: An Exploratory Study. Psychology of Popular Media Culture 3, 2, 110--126.",
      "doi": ""
    },
    {
      "text": "Cale J. Passmore and Regan L. Mandryk. 2018. An About Face: Diverse Representation in Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, 365--380.",
      "doi": ""
    },
    {
      "text": "Nicole Peever, Daniel Johnson, and John Gardner. 2012. Personality & Video Game Genre Preferences. In Proceedings of The 8th Australasian Conference on Interactive Entertainment. ACM.",
      "doi": "10.1145/2336727.2336747"
    },
    {
      "text": "Cody Phillips, Daniel Johnson, Madison Klarkowski, Melanie Jade White, and Leanne Hides. 2018. The Impact of Rewards and Trait Reward Responsiveness on Player Motivation. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, 393--404.",
      "doi": "10.1145/3242671.3242713"
    },
    {
      "text": "Andrew K. Przybylski and Netta Weinstein. 2017. A Large-Scale Test of the Goldilocks Hypothesis: Quantifying the Relations Between Digital-Screen Use and the Mental Well-Being of Adolescents. Psychological Science 28, 2, 204--215.",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski and Netta Weinstein. 2019. Investigating the Motivational and Psychosocial Dynamics of Dysregulated Gaming: Evidence From a Preregistered Cohort Study. Clinical Psychological Science 7, 6, 1257--1265.",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, Netta Weinstein, Richard M. Ryan, and C. Scott Rigby. 2009. Having to Versus Wanting to Play: Background and Consequences of Harmonious Versus Obsessive Engagement in Video Games. CyberPsychology & Behavior 12, 5, 485--492.",
      "doi": ""
    },
    {
      "text": "R Core Team. 2018. R: A Language and Environment for Statistical Computing [Version 3.5.0]. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org.",
      "doi": ""
    },
    {
      "text": "Rémi Radel, Philippe Sarrazin, Pascal Legrain, and Lucie Gobancé. 2009. Subliminal Priming of Motivational Orientation in Educational Settings: Effect on Academic Performance Moderated by Mindfulness. Journal of Research in Personality 43, 4, 695--698.",
      "doi": ""
    },
    {
      "text": "Johnmarshall Reeve, Glen Nix, and Diane Hamm. 2003. Testing Models of the Experience of Self-Determination in Intrinsic Motivation and the Conundrum of Choice. Journal of Educational Psychology 95, 2, 375--392.",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke. 2009. Games and Recovery: The Use of Video and Computer Games to Recuperate from Stress and Strain. Journal of Media Psychology 21, 3, 126--142.",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke, Jennifer Klatt, and Nicole C Krämer. 2011. Entertaining Media Use and the Satisfaction of Recovery Needs: Recovery Outcomes Associated With the Use of Interactive and Noninteractive Entertaining Media. Media Psychology 14, 2, 192--215.",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke, Ron Tamborini, Matthew Grizzard, Robert Lewis, Allison Eden, and Nicholas David Bowman. 2012. Characterizing Mood Management as Need Satisfaction: The Effects of Intrinsic Needs on Selective Exposure and Mood Repair. Journal of Communication 62, 3, 437--453.",
      "doi": ""
    },
    {
      "text": "Diana Rieger, Lena Frischlich, Tim Wulf, Gary Bente, and Julia Kneer. 2015. Eating Ghosts: The Underlying Mechanisms of Mood Repair Via Interactive and Noninteractive Media. Psychology of Popular Media Culture 4, 2, 138--154.",
      "doi": ""
    },
    {
      "text": "Meredith Rocchi, Luc Pelletier, and Philippe Desmarais. 2017. The Validity of the Interpersonal Behaviors Questionnaire (IBQ) in Sport. Measurement in Physical Education and Exercise Science 21, 1.",
      "doi": ""
    },
    {
      "text": "Saul Rosenzweig. 1944. An Outline of Frustration Theory. In Personality and the Behavior Disorders, J. McV. Hunt (Ed.). Ronald Press, New York, USA, 379--388. https://archive.org/details/personalityandth031639mbp",
      "doi": ""
    },
    {
      "text": "Carmen V. Russoniello, Matthew Fish, and Kevin O'Brien. 2013. The Efficacy of Casual Videogame Play in Reducing Clinical Depression: A Randomized Controlled Study. Games for Health Journal 2, 6, 341--346.",
      "doi": ""
    },
    {
      "text": "Carmen V. Russoniello, Kevin O'Brien, and Jennifer M. Parks. 2009. The Effectiveness of Casual Video Games in Improving Mood and Decreasing Stress. Journal of CyberTherapy and Rehabilitation 2, 1, 53--66.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2017a. Basic Psychological Needs Theory: Satisfaction and Frustration of Autonomy, Competence, and Relatedness in Relation to Psychological Wellness and Full Functioning. In Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness. Guilford, New York, NY, 239--271.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2017b. Motivation and Need Satisfaction in Video Games and Virtual Environments. In Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness. Guilford, New York, NY, 508--531.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2017c. Self-Determination Theory: An Introduction and Overview. In Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness. Guilford, New York, NY, 3--25.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Christina Frederick. 1997. On Energy, Personality, and Health: Subjective Vitality as a Dynamic Reflection of Well-Being. Journal of Personality 65, 3, 529--565.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, Valerie Mims, and Richard Koestner. 1983. Relation of Reward Contingency and Interpersonal Context to Intrinsic Motivation: A Review and Test using Cognitive Evaluation Theory. Journal of Personality and Social Psychology 45, 4, 736--750.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4, 344--360.",
      "doi": "10.1007/s11031-006-9051-8"
    },
    {
      "text": "Kennon M. Sheldon. 2018. Understanding The Good Life: Eudaimonic Living Involves Well-Doing, Not Well-Being. In The Social Psychology of Living Well, Joseph P. Forgas and Roy F. Baumeister (Eds.). 116--136.",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon and Vincent Filak. 2008. Manipulating Autonomy, Competence, and Relatedness Support in a Game-Learning Context: New Evidence that All Three Needs Matter. British Journal of Social Psychology 47, 2, 267--283.",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon and Jonathan C. Hilpert. 2012. The Balanced Measure of Psychological Needs (BMPN) Scale: An Alternative Domain General Measure of Need Satisfaction. Motivation and Emotion 36, 4, 439--451.",
      "doi": ""
    },
    {
      "text": "Jeffrey G. Snodgrass, Michael G. Lacy, H. J. Francois Dengah, and Jesse Fagan. 2011. Enhancing One Life Rather than Living Two: Playing MMOs with Offline Friends. Computers in Human Behavior 27, 3, 1211--1222.",
      "doi": "10.1016/j.chb.2011.01.001"
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: A Model for Evaluating Player Enjoyment in Games. Computers in Entertainment 3, 3.",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "István Tóth-Király, Beáta Bothe, Anett Neszta Márki, Adrien Rigó, and Gábor Orosz. 2019. Two Sides of the Same Coin: The Differentiating Role of Need Satisfaction and Frustration in Passion for Screen-Based Activities. European Journal of Social Psychology 49, 6, 1190--1205.",
      "doi": ""
    },
    {
      "text": "Selen Türkay and Sonam Adinolf. 2018. Understanding Online Collectible Card Game Players' Motivations: A Survey Study with Two Games. In Proceedings of the 30th Australian Conference on Computer-Human Interaction. ACM, 501--505.",
      "doi": "10.1145/3292147.3292216"
    },
    {
      "text": "April Tyack and Elisa D. Mekler. 2020. Self-Determination Theory in HCI Games Research: Current Uses and Open Questions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "April Tyack and Peta Wyeth. 2017. Exploring Relatedness in Single-Player Video Game Play. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. ACM, 422--427.",
      "doi": "10.1145/3152771.3156149"
    },
    {
      "text": "April Tyack, Peta Wyeth, and Daniel Johnson. 2016. The Appeal of MOBA Games: What Makes People Start, Stay, and Stop. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, 313--325.",
      "doi": "10.1145/2967934.2968098"
    },
    {
      "text": "April Tyack, Peta Wyeth, and Madison Klarkowski. 2018. Video Game Selection Procedures For Experimental Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3173574.3173760"
    },
    {
      "text": "Wenceslao Unanue, Konrad Rempel, Marcos E. Gómez, and Anja Van den Broeck. 2017. When and Why Does Materialism Relate to Employees' Attitudes and Well-being: The Mediational Role of Need Satisfaction and Need Frustration. Frontiers in Psychology 8.",
      "doi": ""
    },
    {
      "text": "Valve Corporation. Mark of the Ninja on Steam. store.steampowered.com/app/214560/Mark_of_the_Ninja (Accessed 21 December, 2018).",
      "doi": ""
    },
    {
      "text": "Anja Van den Broeck, D. Lance Ferris, Chu-Hsiang Chang, and Christopher C. Rosen. 2016. A Review of Self-Determination Theory's Basic Psychological Needs at Work. Journal of Management 42, 5, 1195--1229.",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Daniel Johnson, and Leanne Hides. 2015. Playing Alone, Playing With Others: Differences in Player Experience and Indicators of Wellbeing. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. 3--12.",
      "doi": "10.1145/2793107.2793118"
    },
    {
      "text": "Kellie Vella, Madison Klarkowski, Daniel Johnson, Leanne Hides, and Peta Wyeth. 2016. The Social Context of Video Game Play: Challenges and Strategies. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 761--772.",
      "doi": "10.1145/2901790.2901823"
    },
    {
      "text": "Kellie Vella, Madison Klarkowski, Selen Türkay, and Daniel Johnson. 2019. Making Friends in Online Games: Gender Differences and Designing for Greater Social Connectedness. Behaviour & Information Technology.",
      "doi": ""
    },
    {
      "text": "Douglas Wilson and Miguel Sicart. 2010. Now it's Personal: On Abusive Game Design. In Proceedings of the International Academic Conference on the Future of Game Design and Technology. ACM, 40--47.",
      "doi": "10.1145/1920778.1920785"
    }
  ]
}