{
  "doi": "10.1145/3313831.3376434",
  "title": "Camera Adversaria",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2020,
  "badges": [],
  "abstract": "In this paper we introduce Camera Adversaria; a mobile app designed to disrupt the automatic surveillance of personal photographs by technology companies. The app leverages the brittleness of deep neural networks with respect to high-frequency signals, adding generative adversarial perturbations to users' photographs. These perturbations confound image classification systems but are virtually imperceptible to human viewers. Camera Adversaria builds on methods developed by machine learning researchers as well as a growing body of work, primarily from art and design, which transgresses contemporary surveillance systems. We map the design space of responses to surveillance and identify an under-explored region where our project is situated. Finally we show that the language typically used in the adversarial perturbation literature serves to affirm corporate surveillance practices and malign resistance. This raises significant questions about the function of the research community in countenancing systems of surveillance.",
  "authors": [
    {
      "name": "Kieran Browne",
      "institution": "Australian National University, Canberra, ACT, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261606",
      "orcid": "missing"
    },
    {
      "name": "Ben Swift",
      "institution": "Australian National University, Canberra, ACT, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342513190",
      "orcid": "missing"
    },
    {
      "name": "Terhi Nurmikko-Fuller",
      "institution": "Australian National University, Canberra, ACT, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "60000000474",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark Andrejevic. 2002. The work of being watched: Interactive media and the exploitation of self-disclosure. Critical studies in media communication 19, 2 (2002), 230--248.",
      "doi": ""
    },
    {
      "text": "Anish Athalye, Nicholas Carlini, and David Wagner. 2018. Obfuscated Gradients Give a False Sense of Security: Circumventing Defenses to Adversarial Examples. arXiv:1802.00420 [cs] (Feb. 2018).",
      "doi": ""
    },
    {
      "text": "Jason Bailey. 2019. Bye Bye Camera - an App for the Post-human Era. https://www.artnome.com/news/2019/6/ 24/bye-bye-camera-an-app-for-the-post-human-era, Artnome (2019). Accessed: 16 September 2019.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is critical about critical design?. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 3297--3306.",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Battista Biggio and Fabio Roli. 2018. Wild Patterns: Ten Years after the Rise of Adversarial Machine Learning. 84 (2018), 317--331. DOI: http://dx.doi.org/10.1016/j.patcog.2018.07.023",
      "doi": "10.1145/3243734.3264418"
    },
    {
      "text": "James Bridle. 2017. Every CCTV Camera (CC). https://jamesbridle.com/works/every-cctv-camera-cc. (2017).",
      "doi": ""
    },
    {
      "text": "Kieran Browne. 2019. Camera Adversaria Source Code. https://github.com/kieranbrowne/camera-adversaria, GitHub repository (2019).",
      "doi": ""
    },
    {
      "text": "Kieran Browne, Ben Swift, and Henry Gardner. 2018. Critical Challenges for the Visual Representation of Deep Neural Networks. In Human and Machine Learning. Springer, Switzerland, 119--136.",
      "doi": ""
    },
    {
      "text": "Finn Brunton and Helen Nissenbaum. 2011. Vernacular resistance to data collection and analysis: A political theory of obfuscation. First Monday 16, 5 (2011).",
      "doi": ""
    },
    {
      "text": "Nicholas Carah and Daniel Angus. 2018. Algorithmic brand culture: participatory labour, machine learning and branding on social media. Media, Culture & Society 40, 2 (2018), 178--194.",
      "doi": ""
    },
    {
      "text": "Kenneth T Co, Luis Muñoz-González, and Emil C Lupu. 2018. Procedural Noise Adversarial Examples for Black-Box Attacks on Deep Neural Networks. arXiv preprint arXiv:1810.00470 (2018).",
      "doi": ""
    },
    {
      "text": "Julie E Cohen. 2019. Between Truth and Power: The Legal Constructions of Informational Capitalism. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial Design. MIT Press.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2001. Design noir: The secret life of electronic objects. Birkhäuser.",
      "doi": ""
    },
    {
      "text": "Luis A Fernandez and Laura Huey. 2009. Is resistance futile? Thoughts on resisting surveillance. Surveillance & Society 6, 3 (2009), 199--202.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 2012. Discipline and Punish: The Birth of the Prison. Vintage.",
      "doi": ""
    },
    {
      "text": "Ian J. Goodfellow, Jonathon Shlens, and Christian Szegedy. 2014. Explaining and Harnessing Adversarial Examples. (2014). http://arxiv.org/abs/1412.6572",
      "doi": ""
    },
    {
      "text": "Adam Harvey. 2010. CV Dazzle: Camouflage from face detection. http://cvdazzle.com/. (2010). Accessed: 13 September 2019.",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, Eman Hassan, Yifang Li, Kelly Caine, David J Crandall, Roberto Hoyle, and Apu Kapadia. 2018. Viewer experience of obscuring scene elements in photos to enhance privacy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3173574.3173621"
    },
    {
      "text": "Rakibul Hasan, Yifang Li, Eman Hassan, Kelly Caine, David J Crandall, Roberto Hoyle, and Apu Kapadia. 2019. Can Privacy Be Satisfying?: On Improving Viewer Satisfaction for Privacy-Enhanced Photos Using Aesthetic Transforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3290605.3300597"
    },
    {
      "text": "Alex Hern. 2017. Vibrator maker ordered to pay out C$4m for tracking users' sexual activity. https://www.theguardian.com/technology/2017/mar/14/ we-vibe-vibrator-tracking-users-sexual-habits, The Guardian (14 March 2017). Accessed: 7 January 2020.",
      "doi": ""
    },
    {
      "text": "Andrew G Howard, Menglong Zhu, Bo Chen, Dmitry Kalenichenko, Weijun Wang, Tobias Weyand, Marco Andreetto, and Hartwig Adam. 2017. Mobilenets: Efficient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017).",
      "doi": ""
    },
    {
      "text": "Daniel C Howe and Helen Nissenbaum. 2009. TrackMeNot: Resisting surveillance in web search. In Lessons from the Identity trail: Anonymity, privacy, and identity in a networked society, Ian Kerr, Carole Lucock, and Valerie Steeves (Eds.). Oxford University Press, 417--436.",
      "doi": ""
    },
    {
      "text": "Sandy Huang, Nicolas Papernot, Ian Goodfellow, Yan Duan, and Pieter Abbeel. 2017. Adversarial Attacks on Neural Network Policies. (2017). http://arxiv.org/abs/1702.02284",
      "doi": ""
    },
    {
      "text": "Håkon Hukkelås, Rudolf Mester, and Frank Lindseth. 2019. DeepPrivacy: A Generative Adversarial Network for Face Anonymization. arXiv preprint arXiv:1909.04538 (2019).",
      "doi": ""
    },
    {
      "text": "Alex Kauffmann. 2017. Introducing Appsperiments: Exploring the Potentials of Mobile Photography. https://ai.googleblog.com/2017/12/ introducing-appsperiments-exploring.html, Google AI Blog (2017). Accessed: 16 September 2019.",
      "doi": ""
    },
    {
      "text": "Spyros Kokolakis. 2017. Privacy attitudes and privacy behaviour: A review of current research on the privacy paradox phenomenon. Computers & security 64 (2017), 122--134.",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev. Stop Nigmas: Experimental Speculative Design Through Pragmatic Aesthetics and Public Art. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (2016) (NordiCHI '16). ACM, 76:1--76:10. DOI: http://dx.doi.org/10.1145/2971485.2993921",
      "doi": ""
    },
    {
      "text": "Winner Langdon. 1986. The Whale and the Reactor: A search for limits in an age of high technology. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Marc Levoy. 2017. Portrait mode on the Pixel 2 and Pixel 2 XL smartphones. https://ai.googleblog.com/2017/10/ portrait-mode-on-pixel-2-and-pixel-2-xl.html, Google AI Blog (2017). Accessed: 16 September 2019.",
      "doi": ""
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Bart P Knijnenburg, Hongxin Hu, and Kelly Caine. 2017. Effectiveness and users' experience of obfuscation as a privacy-enhancing technology for sharing photos. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 67.",
      "doi": "10.1145/3134702"
    },
    {
      "text": "Richard McPherson, Reza Shokri, and Vitaly Shmatikov. 2016. Defeating image obfuscation with deep learning. arXiv preprint arXiv:1609.00408 (2016).",
      "doi": ""
    },
    {
      "text": "Torin Monahan. 2015. The right to hide? Anti-surveillance camouflage and the aestheticization of resistance. Communication and Critical/Cultural Studies 12, 2 (2015), 159--178.",
      "doi": ""
    },
    {
      "text": "Torin Monahan. 2018. Ways of being seen: surveillance art and the interpellation of viewing subjects. Cultural Studies 32, 4 (2018), 560--581.",
      "doi": ""
    },
    {
      "text": "Seyed-Mohsen Moosavi-Dezfooli, Alhussein Fawzi, Omar Fawzi, and Pascal Frossard. 2017a. Universal adversarial perturbations. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1765--1773.",
      "doi": ""
    },
    {
      "text": "Seyed-Mohsen Moosavi-Dezfooli, Alhussein Fawzi, Omar Fawzi, and Pascal Frossard. 2017b. Universal adversarial perturbations. (2017). https://youtu.be/jhOu5yhe0rc",
      "doi": ""
    },
    {
      "text": "Lewis Mumford. 1964. Authoritarian and democratic technics. Technology and culture 5, 1 (1964), 1--8.",
      "doi": ""
    },
    {
      "text": "Guardian News. 2019. Anti-surveillance protesters tear down 'smart' lamp-post in Hong Kong. (2019). https://youtu.be/u1Ji7wonUhE",
      "doi": ""
    },
    {
      "text": "George Orwell. 2009. Nineteen Eighty-Four. Everyman's Library.",
      "doi": ""
    },
    {
      "text": "Yong Jin Park. 2013. Digital Literacy and Privacy Behavior Online. Communication Research 40, 2 (April 2013), 215--236. DOI: http://dx.doi.org/10.1177/0093650211418338",
      "doi": ""
    },
    {
      "text": "James Pethokoukis. 2019. In praise of surveillance capitalism. http://www.aei.org/publication/ in-praise-of-surveillance-capitalism/, AEIdeas Blog (2019). Accessed: 16 September 2019.",
      "doi": ""
    },
    {
      "text": "Moo-Ryong Ra, Ramesh Govindan, and Antonio Ortega. 2013. P3: Toward privacy-preserving photo sharing. In Presented as part of the 10th {USENIX} Symposium on Networked Systems Design and Implementation ({NSDI} 13). 515--528.",
      "doi": ""
    },
    {
      "text": "Chuck Rosenberg. 2013. Improving Photo Search: A Step Across the Semantic Gap. https://ai.googleblog.com/2013/06/improving-photo-search-step-across.html, Google AI Blog (2013). Accessed: 16 September 2019.",
      "doi": ""
    },
    {
      "text": "Matthew Rosenberg, Nicholas Confessore, and Carole Cadwalladr. 2018. How Trump Consultants Exploited the Facebook Data of Millions. https://www.nytimes.com/2018/03/17/us/politics/ cambridge-analytica-trump-campaign.html, NY Times (17 March 2018). Accessed: 7 January 2020.",
      "doi": ""
    },
    {
      "text": "Narges Roshanbin and James Miller. 2011. Finding homoglyphs-a step towards detecting unicode-based visual spoofing attacks. In International Conference on Web Information Systems Engineering. Springer, 1--14.",
      "doi": ""
    },
    {
      "text": "James B Rule. 2012. 'Needs' for Surveillance and the Movement to Protect Privacy. In Routledge handbook of surveillance studies, Kirstie Ball, Kevin D Haggerty, and David Lyon (Eds.). Routledge, 64--71.",
      "doi": ""
    },
    {
      "text": "Emre Sarigol, David Garcia, and Frank Schweitzer. 2014. Online privacy as a collective phenomenon. In Proceedings of the second ACM conference on Online social networks. ACM, 95--106.",
      "doi": "10.1145/2660460.2660470"
    },
    {
      "text": "Christian Szegedy, Wojciech Zaremba, Ilya Sutskever, Joan Bruna, Dumitru Erhan, Ian Goodfellow, and Rob Fergus. 2014. Intriguing properties of neural networks. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Matt Tierney, Ian Spiro, Christoph Bregler, and Lakshminarayanan Subramanian. 2013. Cryptagram: Photo privacy for online social media. In Proceedings of the first ACM conference on Online social networks. ACM, 75--88.",
      "doi": "10.1145/2512938.2512939"
    },
    {
      "text": "David Murakami Wood and Torin Monahan. 2019. Platform Surveillance. Surveillance & Society 17, 1/2 (2019), 1--6.",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 2019. The Age of Surveillance Capitalism: The fight for a human future at the new frontier of power. Profile Books.",
      "doi": ""
    }
  ]
}