{
  "doi": "10.1145/3313831.3376501",
  "title": "Exploring the Design Space of User-System Communication for Smart-home Routine Assistants",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "AI-enabled smart-home agents that automate household routines are increasingly viable, but the design space of how and what such systems should communicate with their users remains underexplored. Through a user-enactment study, we identified various interpretations of and feelings toward such a system's confidence in its automated acts. That confidence and their own mental models influenced what and how the participants wanted the system to communicate, as well as how they would assess, diagnose, and subsequently improve it. Automated acts resulted from false predictions were not generally considered improper, provided that they were perceived as reasonable or potentially useful. The participants' improvement strategies were of four general types, all of which will be discussed. Factors affecting their preferred levels of involvement in automated acts and their interest in system confidence were also identified. We conclude by making practical design recommendations for the user-system communication design spaces of smart-home routine assistants.",
  "authors": [
    {
      "name": "Yi-Shyuan Chiang",
      "institution": "National Tsing Hua University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528589",
      "orcid": "missing"
    },
    {
      "name": "Ruei-Che Chang",
      "institution": "National Tsing Hua University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475234",
      "orcid": "0000-0001-7545-4136"
    },
    {
      "name": "Yi-Lin Chuang",
      "institution": "National Tsing Hua University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528904",
      "orcid": "missing"
    },
    {
      "name": "Shih-Ya Chou",
      "institution": "National Tsing Hua University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528544",
      "orcid": "missing"
    },
    {
      "name": "Hao-Ping Lee",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/do/10.1145/contrib-99659200192/rel-imgonly/99659200192.jpg",
      "acmid": "99659200192",
      "orcid": "missing"
    },
    {
      "name": "I-Ju Lin",
      "institution": "National Tsing Hua University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529726",
      "orcid": "missing"
    },
    {
      "name": "Jian-Hua Jiang Chen",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527948",
      "orcid": "missing"
    },
    {
      "name": "Yung-Ju Chang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019794",
      "orcid": "0000-0001-6956-3459"
    }
  ],
  "references": [
    {
      "text": "Alper Turan Alan, Mike Shann, Enrico Costanza, Sarvapali Dyanand Ramchurn, and Sven Seuken. 2016. It is Too Hot: An In-Situ Study of Three Designs for Heating. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, NY, NY, USA, 5262--5273. DOI: http://dx.doi.org/10.1145/2858036.2858222",
      "doi": "10.1145/2858036.2858222"
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI'19). ACM, NY, NY, USA, Article 3, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Louise Barkhuus and Anind Dey. 2003. Is Context-Aware Computing Taking Control away from the User? Three Levels of Interactivity Examined. In UbiComp 2003: Ubiquitous Computing, Anind K. Dey, Albrecht Schmidt, and Joseph F. McCarthy (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 149--156.",
      "doi": ""
    },
    {
      "text": "Fred Beisse. 2009. A Guide to Computer User Support for Help Desk and Support Specialists (4th ed.). Course Technology Press, Boston, MA, United States.",
      "doi": ""
    },
    {
      "text": "Julia Brich, Marcel Walch, Michael Rietzler, Michael Weber, and Florian Schaub. 2017. Exploring End User Programming Needs in Home Automation. ACM Trans. Comput.-Hum. Interact. 24, 2, Article 11 (April 2017), 35 pages. DOI: http://dx.doi.org/10.1145/3057858",
      "doi": "10.1145/3057858"
    },
    {
      "text": "Ryan Brotman, Winslow Burleson, Jodi Forlizzi, William Heywood, and Jisoo Lee. 2015. Building Change: Constructive Design of Smart Domestic Environments for Goal Achievement. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, NY, NY, USA, 3083--3092. DOI: http://dx.doi.org/10.1145/2702123.2702602",
      "doi": "10.1145/2702123.2702602"
    },
    {
      "text": "A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home Automation in the Wild: Challenges and Opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2115--2124. DOI: http://dx.doi.org/10.1145/1978942.1979249",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Andrea Bunt, Matthew Lount, and Catherine Lauzon. 2012. Are Explanations Always Important?: A Study of Deployed, Low-cost Intelligent Interactive Systems. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI'12). ACM, NY, NY, USA, 169--178. DOI: http://dx.doi.org/10.1145/2166966.2166996",
      "doi": "10.1145/2166966.2166996"
    },
    {
      "text": "Nico Castelli, Corinna Ogonowski, Timo Jakobi, Martin Stein, Gunnar Stevens, and Volker Wulf. 2017. What Happened in My Home?: An End-User Development Approach for Smart Home Data Visualization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 853--866. DOI: http://dx.doi.org/10.1145/3025453.3025485",
      "doi": "10.1145/3025453.3025485"
    },
    {
      "text": "International Data Corporation. 2019. Double-Digit Growth Expected in the Smart Home Market, Says IDC. (2019). https://www.idc.com/getdoc.jsp?containerId=prUS44971219.",
      "doi": ""
    },
    {
      "text": "Nils Dahlbäck, Arne Jönsson, and Lars Ahrenberg. 1993. Wizard of Oz Studies: Why and How. In Proceedings of the 1st International Conference on Intelligent User Interfaces (IUI'93). ACM, NY, NY, USA, 193--200. DOI: http://dx.doi.org/10.1145/169891.169968",
      "doi": "10.1145/169891.169968"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K Dey, and John Zimmerman. 2007. Rapidly Exploring Application Design Through Speed Dating. In Proceedings of the 9th International Conference on Ubiquitous Computing (UbiComp '07). Springer-Verlag, Berlin, Heidelberg, 429--446. http://dl.acm.org/citation.cfm?id=1771592.1771617",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Maartje de Graaf and Bertram Malle. 2017. How People Explain Action (and Autonomous Intelligent Systems Should Too). (2017). https://aaai.org/ocs/index.php/FSS/FSS17/paper/view/16009",
      "doi": ""
    },
    {
      "text": "Jennifer deWinter and Ryan M Moeller. 2016. Computer Games and Technical Communication: Critical Methods and Applications at the Intersection. Taylor & Francis. https://books.google.com.tw/books?id=N0s3DAAAQBAJ",
      "doi": ""
    },
    {
      "text": "Jillian D'Onfro. 2019. AI 50 Founders Say This Is What People Get Wrong About Artificial Intelligence. (2019). Retrieved November 9, 2019 from https://www.forbes.com/sites/jilliandonfro/2019/09/17/ai-50-founders-say-this-is-what-people-get-wrong-about-artificia #5dacc35c7077",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Pradyumna Tambwekar, Larry Chan, Brent Harrison, and Mark O Riedl. 2019. Automated Rationale Generation: A Technique for Explainable AI and Its Effects on Human Perceptions. In Proceedings of the 24th International Conference on Intelligent User Interfaces (IUI '19). ACM, NY, NY, USA, 263--274. DOI: http://dx.doi.org/10.1145/3301275.3302316",
      "doi": "10.1145/3301275.3302316"
    },
    {
      "text": "Telefonaktiebolaget L. M. Ericsson. 2018. Internet of Things forecast. (2018). https://www.ericsson.com/en/mobility-report/internet-of-things-forecast.",
      "doi": ""
    },
    {
      "text": "Google APIs for Android. 2019. Detected Activity. (2019). Retrieved September 12, 2019 from https://developers.google.com/android/reference/com/google/android/gms/location/DetectedActivity",
      "doi": ""
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who's In Control?: Interactions In Multi-User Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 268, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300498",
      "doi": "10.1145/3290605.3300498"
    },
    {
      "text": "Google. 2019. People+AI Guidebook: Explainability + Trust. (2019). Retrieved June 3, 2019 from https://pair.withgoogle.com/chapter/explainability-trust/",
      "doi": ""
    },
    {
      "text": "Mateusz Halawa and Marta Olco´ n-Kubicka. 2018. Digital householding: calculating and moralizing domestic life through homemade spreadsheets. Journal of Cultural Economy 11, 6 (2018), 514--534.",
      "doi": ""
    },
    {
      "text": "Chris Harrison, John Horstman, Gary Hsieh, and Scott Hudson. 2012. Unlocking the Expressivity of Point Lights. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1683--1692. DOI: http://dx.doi.org/10.1145/2207676.2208296",
      "doi": "10.1145/2207676.2208296"
    },
    {
      "text": "Google Nest Help. 2019. Set up manage Routines. (2019). Retrieved September 12, 2019 from https://support.google.com/googlenest/answer/7029585? co=GENIE.Platform%3DAndroid&hl=en",
      "doi": ""
    },
    {
      "text": "Chuan-Che (Jeff) Huang, Sheng-Yuan Liang, Bing-Hsun Wu, and Mark Webster Newman. 2017. Reef: Exploring the Design Opportunity of Comfort-Aware Eco-Coaching Thermostats. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 191--202. DOI: http://dx.doi.org/10.1145/3064663.3064685",
      "doi": "10.1145/3064663.3064685"
    },
    {
      "text": "Rikke Hagensby Jensen, Yolande Strengers, Jesper Kjeldskov, Larissa Nicholls, and Mikael B Skov. 2018. Designing the Desirable Smart Home: A Study of Household Experiences and Energy Consumption Impacts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 4, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173578",
      "doi": "10.1145/3173574.3173578"
    },
    {
      "text": "Jenny Kennedy, Bjorn Nansen, Michael Arnold, Rowan Wilken, and Martin Gibbs. 2015. Digital housekeepers and domestic expertise in the networked home. Convergence 21, 4 (2015), 408--422.",
      "doi": ""
    },
    {
      "text": "Da-jung Kim and Youn-kyung Lim. 2019. Co-Performing Agent: Design for Building User-Agent Partnership in Learning and Adaptive Services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 484, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300714",
      "doi": ""
    },
    {
      "text": "Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. 2015. Principles of Explanatory Debugging to Personalize Interactive Machine Learning. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, NY, NY, USA, 126--137. DOI: http://dx.doi.org/10.1145/2678025.2701399",
      "doi": "10.1145/2678025.2701399"
    },
    {
      "text": "Todd Kulesza, Simone Stumpf, Margaret Burnett, and Irwin Kwan. 2012. Tell Me More?: The Effects of Mental Model Soundness on Personalizing an Intelligent Agent. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1--10. DOI: http://dx.doi.org/10.1145/2207676.2207678",
      "doi": "10.1145/2207676.2207678"
    },
    {
      "text": "Dounia Lahoual and Myriam Frejus. 2019. When Users Assist the Voice Assistants: From Supervision to Failure Resolution. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article CS08, 8 pages. DOI: http://dx.doi.org/10.1145/3290607.3299053",
      "doi": "10.1145/3290607.3299053"
    },
    {
      "text": "Min Kyung Lee, Sara Kielser, Jodi Forlizzi, Siddhartha Srinivasa, and Paul Rybski. 2010. Gracefully Mitigating Breakdowns in Robotic Services. In Proceedings of the 5th ACM/IEEE International Conference on Human-robot Interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 203--210. http://dl.acm.org/citation.cfm?id=1734454.1734544",
      "doi": "10.5555/1734454.1734544"
    },
    {
      "text": "Yoga Liu, Ya-Han Lee, Yaliang Chuang, Rung-Huei Liang, and Lin-Lin Chen. 2017. Designing the Expressive Point Lights to Enhance User's Situated Awareness of Smart Systems. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, NY, NY, USA, 333--336. DOI: http://dx.doi.org/10.1145/3064857.3079187",
      "doi": "10.1145/3064857.3079187"
    },
    {
      "text": "Irene Lopatovska and Harriet Williams. 2018. Personification of the Amazon Alexa: BFF or a Mindless Companion. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval (CHIIR '18). ACM, NY, NY, USA, 265--268. DOI: http://dx.doi.org/10.1145/3176349.3176868",
      "doi": "10.1145/3176349.3176868"
    },
    {
      "text": "Andrés Lucero. 2015. Using Affinity Diagrams to Evaluate Interactive Prototypes. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 231--248.",
      "doi": "10.1007/978-3-319-22668-2_19"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf Between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5286--5297. DOI: http://dx.doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Gabriel Machado Lunardi, Fadi Al Machot, Vladimir A. Shekhovtsov, Vinícius Maran, Guilherme Medeiros Machado, Alencar Machado, Heinrich C. Mayr, and José Palazzo M. de Oliveira. 2018. IoT-based human action prediction and support. Internet of Things 3--4 (2018), 52 -- 68. DOI: http://dx.doi.org/https://doi.org/10.1016/j.iot.2018.09.007",
      "doi": ""
    },
    {
      "text": "Michal Luria, Guy Hoffman, and Oren Zuckerman. 2017. Comparing Social Robot, Screen and Voice Interfaces for Smart-Home Control. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 580--628. DOI: http://dx.doi.org/10.1145/3025453.3025786",
      "doi": "10.1145/3025453.3025786"
    },
    {
      "text": "Ilias Maglogiannis, Kostas Delibasis, Dimitrios Kosmopoulos, Theodosios Goudas, and Charalampos Doukas. 2014. Activity Recognition in Assistive Environments: The STHENOS Approach. In Universal Access in Human-Computer Interaction. Aging and Assistive Environments, Constantine Stephanidis and Margherita Antona (Eds.). Springer International Publishing, Cham, 525--536.",
      "doi": ""
    },
    {
      "text": "Mitchell Mason. 2019. IBM Watson: How To Set the Optimal Confidence Threshold for Your Assistant. (2019). Retrieved September 12, 2019 from https://medium.com/ibm-watson/how-to-set-the-optimal-confidence-threshold-for_ your-assistant-bbb1be6f294f",
      "doi": ""
    },
    {
      "text": "Jon McCormack, Toby Gifford, Patrick Hutchings, Maria Teresa Llano Rodriguez, Matthew Yee-King, and Mark d'Inverno. 2019. In a Silent Way: Communication Between AI and Improvising Musicians Beyond Sound. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 38, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300268",
      "doi": "10.1145/3290605.3300268"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M Huang. 2014a. From Today's Augmented Houses to Tomorrow's Smart Homes: New Directions for Home Automation Research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 105--115. DOI: http://dx.doi.org/10.1145/2632048.2636076",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M Huang. 2014b. From Today's Augmented Houses to Tomorrow's Smart Homes: New Directions for Home Automation Research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 105--115. DOI: http://dx.doi.org/10.1145/2632048.2636076",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Sarah Mennicken, Oliver Zihler, Frida Juldaschewa, Veronika Molnar, David Aggeler, and Elaine May Huang. 2016. \"It's Like Living with a Friendly Stranger\": Perceptions of Personality Traits in a Smart Home. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, NY, NY, USA, 120--131. DOI: http://dx.doi.org/10.1145/2971648.2971757",
      "doi": "10.1145/2971648.2971757"
    },
    {
      "text": "Merriam-Webster. 2019. Confidence. (2019). https://www.merriam-webster.com/dictionary/confidence.",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2017. Explanation in Artificial Intelligence: Insights from the Social Sciences. CoRR abs/1706.07269 (2017). http://arxiv.org/abs/1706.07269",
      "doi": ""
    },
    {
      "text": "Mamun Bin Ibne Reaz Muhammad Raisul Alam and Mohd Alauddin Mohd Al. 2012. A Review of Smart Homes-Past, Present, and Future. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 42, 6 (Nov 2012), 1190--1203. DOI: http://dx.doi.org/10.1109/TSMCC.2012.2189204",
      "doi": ""
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 6, 7 pages. DOI: http://dx.doi.org/10.1145/3173574.3173580",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and Mindlessness: Social Responses to Computers. Journal of Social Issues 56 (03 2000), 81--103. DOI: http://dx.doi.org/10.1111/0022--4537.00153",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic Evaluation of User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90). ACM, NY, NY, USA, 249--256. DOI: http://dx.doi.org/10.1145/97243.97281",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Don A Norman. 1987. Human-computer Interaction. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, Chapter Some Observations on Mental Models, 241--244. http://dl.acm.org/citation.cfm?id=58076.58097",
      "doi": "10.5555/58076.58097"
    },
    {
      "text": "Donald A Norman. 1990. The 'problem'with automation: inappropriate feedback and interaction, not 'over-automation'. Philosophical Transactions of the Royal Society of London. B, Biological Sciences 327, 1241 (1990), 585--593.",
      "doi": ""
    },
    {
      "text": "William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K. Dey, and Min Kyung Lee. 2012. A Fieldwork of the Future with User Enactments. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 338--347. DOI: http://dx.doi.org/10.1145/2317956.2318008",
      "doi": "10.1145/2317956.2318008"
    },
    {
      "text": "William Odom, John Zimmerman, Jodi Forlizzi, Hajin Choi, Stephanie Meier, and Angela Park. 2014. Unpacking the Thinking and Making Behind a User Enactments Project. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 513--522. DOI: http://dx.doi.org/10.1145/2598510.2602960",
      "doi": "10.1145/2598510.2602960"
    },
    {
      "text": "J. Rafferty, C. D. Nugent, J. Liu, and L. Chen. 2017. From Activity Recognition to Intention Recognition for Assisted Living Within Smart Homes. IEEE Transactions on Human-Machine Systems 47, 3 (June 2017), 368--379. DOI: http://dx.doi.org/10.1109/THMS.2016.2641388",
      "doi": ""
    },
    {
      "text": "Tom A Rodden, Joel E. Fischer, Nadia Pantidi, Khaled Bachour, and Stuart Moran. 2013. At Home with Agents: Exploring Attitudes Towards Future Smart Energy Infrastructures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1173--1182. DOI: http://dx.doi.org/10.1145/2470654.2466152",
      "doi": "10.1145/2470654.2466152"
    },
    {
      "text": "Jennifer A Rode and Erika Shehan Poole. 2018. Putting the gender back in digital housekeeping. In Proceedings of the 4th Conference on Gender & IT. ACM, 79--90.",
      "doi": "10.1145/3196839.3196845"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I-An Hong. 2018. \"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 857--868. DOI: http://dx.doi.org/10.1145/3196709.3196772",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Simone Stumpf. 2019. Horses For Courses: Making The Case For Persuasive Engagement In Smart Systems. In Joint Proceedings of the ACM IUI 2019 Workshops co-located with the 24th ACM Conference on Intelligent User Interfaces (ACM IUI 2019), Los Angeles, USA, March 20, 2019. (CEUR Workshop Proceedings), Christoph Trattner, Denis Parra, and Nathalie Riche (Eds.), Vol. 2327. CEUR-WS.org. http://ceur-ws.org/Vol-2327/IUI19WS-ExSS2019--4.pdf",
      "doi": ""
    },
    {
      "text": "Joe Tullio, Anind K. Dey, Jason Chalecki, and James Fogarty. 2007. How It Works: A Field Study of Non-technical Users Interacting with an Intelligent System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'07). ACM, NY, NY, USA, 31--40. DOI: http://dx.doi.org/10.1145/1240624.1240630",
      "doi": "10.1145/1240624.1240630"
    },
    {
      "text": "Michele Turner. 2019. Lights, TV, even the backyard: how the Assistant helps you at home. (2019). Retrieved September 19, 2019 from https://www.blog.google/products/assistant/lights-tv-even-backyard-how-assistant-helps-you-home/",
      "doi": ""
    },
    {
      "text": "Ning Wang, David Varghese Pynadath, and Susan G Hill. 2016. Trust Calibration Within a Human-Robot Team: Comparing Automatically Generated Explanations. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 109--116. http://dl.acm.org/citation.cfm?id=2906831.2906852",
      "doi": ""
    },
    {
      "text": "Robert H Wortham, Andreas Theodorou, and Joanna J Bryson. 2016. What Does the Robot Think? Transparency as A Fundamental Design Requirement for Intelligent Systems. In Ijcai-2016 ethics for artificial intelligence workshop.",
      "doi": ""
    },
    {
      "text": "Chu-Yao Wu. 2018. A Study of Timing Issues for Multimodal Human Machine Interface for Smart Home. Master's thesis. Japan Advanced Institute of Science and Technology, Stockholm(JAIST), Ishikawa, Japan.",
      "doi": ""
    },
    {
      "text": "Heetae Yang, Wonji Lee, and Hwansoo Lee. 2018. IoT Smart Home Adoption: The Importance of Proper Level Automation. Journal of Sensors 2018 (2018).",
      "doi": ""
    },
    {
      "text": "Rayoung Yang and Mark Webster Newman. 2013. Learning from a Learning Thermostat: Lessons for Intelligent Systems for the Home. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 93--102. DOI: http://dx.doi.org/10.1145/2493432.2493489",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. 2019. Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 198, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300428",
      "doi": "10.1145/3290605.3300428"
    },
    {
      "text": "Yu Zhao, Xihui Zhang, and John Crabtree. 2016. Human-Computer Interaction and User Experience in Smart Home Research: A Critical Analysis. Issues in Information Systems 17, 3 (2016).",
      "doi": ""
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2017. Speed Dating: Providing a Menu of Possible Futures. She Ji: The Journal of Design, Economics, and Innovation 3, 1 (2017), 430--450.",
      "doi": ""
    }
  ]
}