{
  "doi": "10.1145/3313831.3376706",
  "title": "Towards Standardized Processes for Physical Therapists to Quantify Patient Rehabilitation",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Physical rehabilitation typically requires therapists to make judgements about patient movement and functional improvement using subjective observation. This process makes it challenging to quantitatively track, compute and predict long-term patient improvement. We therefore propose a novel methodical approach to the standardized and interpretable quantification of patient movement during rehabilitation. We describe the expert-led development of a movement assessment rubric and an accompanying quantitative rating system. We present our movement capture and annotation computational tools designed to implement the rubric and assist therapists in the quantitative documentation and assessment of rehabilitation. We describe results from a movement capture study of the tool with nine stroke survivors and a movement rating study with four therapists. Findings from these studies highlight potential optimal methodical process paths for individuals engaged in capturing, understanding and predicting human movement performance.",
  "tags": [
    "human movement capture",
    "home based rehabilitation therapy",
    "stroke rehabilitation",
    "human movement assessment"
  ],
  "authors": [
    {
      "name": "Aisling Kelliher",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/do/10.1145/contrib-81319494744/rel-imgonly/aisling_headshot.jpg",
      "acmid": "81319494744",
      "orcid": "missing"
    },
    {
      "name": "Setor Zilevu",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659279490",
      "orcid": "missing"
    },
    {
      "name": "Thanassis Rikakis",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100270405",
      "orcid": "missing"
    },
    {
      "name": "Tamim Ahmed",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529199",
      "orcid": "missing"
    },
    {
      "name": "Yen Truong",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528472",
      "orcid": "missing"
    },
    {
      "name": "Steven L. Wolf",
      "institution": "Emory University, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82659082957",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gazihan Alankus, Rachel Proffitt, Caitlin Kelleher, and Jack Engsberg, Stroke Therapy through Motion-Based Games: A Case Study. ACM Trans. Access. Comput., 2011. 4(1): p. 1--35.",
      "doi": ""
    },
    {
      "text": "Craig Anderson, et al., Home or hospital for stroke rehabilitation? results of a randomized controlled trial : I: health outcomes at 6 months. Stroke, 2000. 31(5): p. 1024--31.",
      "doi": ""
    },
    {
      "text": "Craig Anderson, Cliona Ni Mhurchu, PM Brown, and K Carter, Stroke rehabilitation services to accelerate hospital discharge and provide homebased care: an overview and cost analysis. Pharmacoeconomics, 2002. 20(8): p. 537--52.",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, et al., Motivating mobility: designing for lived motivation in stroke rehabilitation, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2011, ACM: Vancouver, BC, Canada. p. 3073--3082.",
      "doi": "10.1145/1978942.1979397"
    },
    {
      "text": "Michael Baran, et al., Design of a home-based adaptive mixed reality rehabilitation system for stroke survivors. Conf Proc IEEE Eng Med Biol Soc, 2011. 2011: p. 7602--5.",
      "doi": ""
    },
    {
      "text": "Michael Baran, et al., Interdisciplinary concepts for design and implementation of mixed reality interactive neurorehabilitation systems for stroke. Phys Ther, 2015. 95(3): p. 449--60.",
      "doi": ""
    },
    {
      "text": "John Beard, et al., The World report on ageing and health: a policy framework for healthy ageing. Lancet, 2016. 387(10033): p. 2145--2154.",
      "doi": ""
    },
    {
      "text": "Emeilia Benjamin, et al., Heart Disease and Stroke Statistics-2017 Update: A Report From the American Heart Association. Circulation, 2017. 135(10): p. e146-e603.",
      "doi": ""
    },
    {
      "text": "Yinpeng Chen, Michael Baran, Hari Sundaram, and Thanassis Rikakis, A low cost, adaptive mixed reality system for home-based stroke rehabilitation. Conf Proc IEEE Eng Med Biol Soc, 2011. 2011: p. 1827--30.",
      "doi": ""
    },
    {
      "text": "Yinpeng Chen, et al., A Computational Framework for Quantitative Evaluation of Movement during Rehabilitation, in AIP Conferernce. 2011. p. 317--326.",
      "doi": ""
    },
    {
      "text": "Karen Chua and Christopher Kuah, Innovating With Rehabilitation Technology in the Real World: Promises, Potentials, and Perspectives. Am J Phys Med Rehabil, 2017. 96(10 Suppl 1): p. S150-S156.",
      "doi": ""
    },
    {
      "text": "Carmen Cirstea and Mindy Levin, Improvement of arm movement patterns and endpoint control depends on type of feedback during practice in stroke survivors. Neurorehabil Neural Repair, 2007. 21(5): p. 398--411.",
      "doi": ""
    },
    {
      "text": "Margaret Duff, et al., An adaptive mixed reality training system for stroke rehabilitation. IEEE Trans Neural Syst Rehabil Eng, 2010. 18(5): p. 531--41.",
      "doi": ""
    },
    {
      "text": "Margaret Duff, et al., Adaptive mixed reality rehabilitation improves quality of reaching movements more than traditional reaching therapy following stroke. Neurorehabil Neural Repair, 2013. 27(4): p. 306--15.",
      "doi": ""
    },
    {
      "text": "Pamela Duncan, et al., Adherence to Postacute Rehabilitation Guidelines Is Associated With Functional Recovery in Stroke. Stroke. 33(1): p. 167--178.",
      "doi": ""
    },
    {
      "text": "Aviv Elor, Mircea Teodorescu, and Sri Kurniawan, Project Star Catcher: A Novel Immersive Virtual Reality Experience for Upper Limb Rehabilitation. ACM Trans. Access. Comput., 2018. 11(4): p. 1--25.",
      "doi": ""
    },
    {
      "text": "Elisa Ferrara, Sonia Nardotto, Serena Ponte, and Silvana G. Dellepiane, Infrastructure for data management and user centered rehabilitation in Rehab@Home project, in Proceedings of the 7th International Conference on PErvasive Technologies Related to Assistive Environments. 2014, ACM: Rhodes, Greece. p. 1--8.",
      "doi": "10.1145/2674396.2674419"
    },
    {
      "text": "Axel Fugl-Meyer, Lisbeth Jaasko, Ingegerd Leyman, Sigyn Olsson, and Solveig Steglind, The post-stroke hemiplegic patient. 1. a method for evaluation of physical performance. Scand J Rehabil Med, 1975. 7(1): p. 13--31.",
      "doi": ""
    },
    {
      "text": "Brian Hanley, Catherine Tucker, and Athanassios Bissas, Differences between motion capture and video analysis systems in calculating knee angles in elite-standard race walking. J Sports Sci., 2018. 36(11): p. 1250 - 1255.",
      "doi": ""
    },
    {
      "text": "Jocelyn Harris and Janice Eng, Paretic upper-limb strength best explains arm activity in people with stroke. . Phys Ther, 2007. 87: p. 88--97.",
      "doi": ""
    },
    {
      "text": "Samar Hatem, et al., Rehabilitation of Motor Function after Stroke: A Multiple Systematic Review Focused on Techniques to Stimulate Upper Extremity Recovery. Front Hum Neurosci, 2016. 10: p. 442.",
      "doi": ""
    },
    {
      "text": "Sarah Housman, Kelly Scott, and David Reinkensmeyer, A randomized controlled trial of gravity-supported, computer-enhanced arm exercise for individuals with severe hemiparesis. Neurorehabil Neural Repair, 2009. 23(5): p. 50514.",
      "doi": ""
    },
    {
      "text": "Huey Huang, et al., Novel design of interactive multimodal biofeedback system for neurorehabilitation. Conf Proc IEEE Eng Med Biol Soc, 2006. 1: p. 4925--8.",
      "doi": ""
    },
    {
      "text": "Aisling Kelliher, Jinwoo Choi, Jia-Bin Huang, Thanassis Rikakis, and Kris Kitani, HOMER: An Interactive System for Home Based Stroke Rehabilitation, in Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 2017, ACM: Baltimore, Maryland, USA. p. 379--380.",
      "doi": "10.1145/3132525.3134807"
    },
    {
      "text": "Aisling Kelliher and Barbara Barry, Designing Therapeutic Experiences with AI in Mind, in AAAI 2018 Symposium, Designing the User Experience of Artificial Intelligence. 2018: Stanford, CA.",
      "doi": ""
    },
    {
      "text": "Aisling Kelliher, Andrew Gibson, Eric Bottelsen, and Edward Coe, Designing Modular Rehabilitation Objects for Interactive Therapy in the Home, in Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. 2019, ACM: Tempe, Arizona, USA. p. 251--257.",
      "doi": "10.1145/3294109.3300983"
    },
    {
      "text": "Faisal Khan, Bilge Mutlu, and Zhu Jerry. How Do Humans Teach: On Curriculum Learning and Teaching Dimension. in Advances in Neural Information Processing Systems 2011. 2011.",
      "doi": ""
    },
    {
      "text": "Silvia Koton, et al., Stroke incidence and mortality trends in US communities, 1987 to 2011. JAMA, 2014. 312(3): p. 259--68.",
      "doi": ""
    },
    {
      "text": "John Krakauer, Arm function after stroke: from physiology to recovery. Semin Neurol, 2005. 25(4): p. 384--95.",
      "doi": ""
    },
    {
      "text": "John Krakauer, Motor learning: its relevance to stroke recovery and neurorehabilitation. Curr Opin Neurol, 2006. 19(1): p. 84--90.",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff Computing Krippendorff's alpha reliability. 2007. 43.",
      "doi": ""
    },
    {
      "text": "Gert Kwakkel, Boudewijn Kollen, Jay van der Grond, and Arie Prevo, Probability of regaining dexterity in the flaccid upper limb: impact of severity of paresis and time since onset in acute stroke. Stroke, 2003. 34(9): p. 2181--6.",
      "doi": ""
    },
    {
      "text": "Gert Kwakkel, Boudewijn Kollen, and Eline Lindeman, Understanding the pattern of functional recovery after stroke: facts and theories. Restor Neurol Neurosci, 2004. 22(3--5): p. 281--99.",
      "doi": ""
    },
    {
      "text": "Mikko Kytö, Laura Maye, and David McGookin, Using Both Hands: Tangibles for Stroke Rehabilitation in the Home, in Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 2019, ACM: Glasgow, Scotland Uk. p. 1--14.",
      "doi": "10.1145/3290605.3300612"
    },
    {
      "text": "N. Lehrer, S. Attygalle, S. L. Wolf, and T. Rikakis, Exploring the bases for a mixed reality stroke rehabilitation system, part I: a unified approach for representing action, quantitative evaluation, and interactive feedback. J Neuroeng Rehabil, 2011. 8: p. 51.",
      "doi": ""
    },
    {
      "text": "Mindy Levin, Jeff Kleim, and Steven Wolf, What do motor recovery and compensation mean in patients following stroke? Neurorehabilitation and neural repair, 2008.",
      "doi": ""
    },
    {
      "text": "Michelle McDonnell, Action research arm test. Aust J Physiother, 2008. 54(3): p. 220.",
      "doi": ""
    },
    {
      "text": "Lewis Morgenstern, et al., Persistent ischemic stroke disparities despite declining incidence in Mexican Americans. Ann Neurol, 2013. 74(6): p. 778--85.",
      "doi": ""
    },
    {
      "text": "A. Nordin, M. Alt Murphy, and A. Danielsson, Intra-rater and inter-rater reliability at the item level of the Action Research Arm Test for patients with stroke. J Rehabil Med, 2014. 46(8): p. 73845.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman, The design of everyday things. 1st Doubleday/Currency ed. 1990, New York: Doubleday. xv, 257 p.",
      "doi": ""
    },
    {
      "text": "Cristina Ramírez-Fernández, Alberto L. Morán, Eloísa García-Canseco, and Felipe Orihue la Espina, Design Factors of Virtual Environments for Upper Limb Motor Rehabilitation of Stroke Patients, in Proceedings of the 5th Mexican Conference on Human-Computer Interaction. 2014, ACM: Oaxaca, Mexico, Mexico. p. 22--25.",
      "doi": "10.1145/2676690.2676700"
    },
    {
      "text": "D. J. Reinkensmeyer, et al., Computational neurorehabilitation: modeling plasticity and learning to predict recovery. J Neuroeng Rehabil, 2016. 13(1): p. 42.",
      "doi": ""
    },
    {
      "text": "David Reinkensmeyer and Michael Boninger, Technologies and combination therapies for enhancing movement training for people with a disability. J Neuroeng Rehabil, 2012. 9: p. 17.",
      "doi": ""
    },
    {
      "text": "Thanassis Rikakis, et al., Semi-automated homebased therapy for the upper extremity of stroke survivors, in ACM PErvasive Technologies Related to Assistive Environments (PETRA '18). 2018: Corfu.",
      "doi": ""
    },
    {
      "text": "Thanassis Rikakis, et al., Semi-automated homebased therapy for the upper extremity of stroke survivors, in Proceedings of the 11th PErvasive Technologies Related to Assistive Environments Conference. 2018, ACM: Corfu, Greece. p. 249256.",
      "doi": "10.1145/3197768.3197777"
    },
    {
      "text": "A. Schwarz, C. M. Kanzler, O. Lambercy, A. R. Luft, and J. M. Veerbeek, Systematic Review on Kinematic Assessments of Upper Limb Movements After Stroke. Stroke, 2019. 50(3): p. 718--727.",
      "doi": ""
    },
    {
      "text": "D. Son, et al., Multifunctional wearable devices for diagnosis and therapy of movement disorders. Nat Nanotechnol, 2014. 9(5): p. 397--404.",
      "doi": ""
    },
    {
      "text": "Standifird TW, et al., Influence of Total Knee Arthroplasty on Gait Mechanics of the Replaced and Non-Replaced Limb During Stair Negotiation. J Arthroplasty, 2016. 31(1): p. 278--283.",
      "doi": ""
    },
    {
      "text": "Richard Tang, Xing-Dong Yang, Scott Bateman, Joaquim Jorge, and Anthony Tang, Physio@Home: Exploring Visual Guidance and Feedback Techniques for Physiotherapy Exercises, in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2015, ACM: Seoul, Republic of Korea. p. 4123--4132.",
      "doi": "10.1145/2702123.2702401"
    },
    {
      "text": "Vinay Venkataraman, et al., Decision support for stroke rehabilitation therapy via describable attribute-based decision trees. Conf Proc IEEE Eng Med Biol Soc, 2014. 2014: p. 3154--9.",
      "doi": ""
    },
    {
      "text": "David Wade, R. Langton-Hewer, V. A. Wood, Clive Skilbeck, and H. M. Ismail, The hemiplegic arm after stroke: measurement and recovery. J Neurol Neurosurg Psychiatry, 1983. 46(6): p. 5214.",
      "doi": ""
    },
    {
      "text": "David Webster and Ozkan Celik, Systematic review of Kinect applications in elderly care and stroke rehabilitation. J Neuroeng Rehabil, 2014. 11: p. 108.",
      "doi": ""
    },
    {
      "text": "Steven Wolf, et al., Assessing wolf motor function test as outcome measure for research in patients after stroke. Stroke, 2001. 32(7): p. 1635--1639.",
      "doi": ""
    },
    {
      "text": "Steven Wolf, et al., Effect of constraint- induced movement therapy on upper extremity function 3 to 9 months after stroke: the excite randomized clinical trial. J. Jama, 2006. 296(17): p. 2095--2104.",
      "doi": ""
    },
    {
      "text": "Ching-Yi Wu, Catherine Trombly, Keh-Chung Lin, and Linda Tickle-Degnen, Effects of object affordances on reaching performance in persons with and without cerebrovascular accident. Am J Occup Ther, 1998. 52(6): p. 447--56.",
      "doi": ""
    },
    {
      "text": "Y. Yoshida, J. Zeni, and L. Snyder-Mackler, Do Patients Achieve Normal Gait Patterns 3 Years After Total Knee Arthroplasty? Journal of orthopaedic & sports physical therapy, 2012. 42(12): p. 1039--1049.",
      "doi": ""
    }
  ]
}