{
  "doi": "10.1145/3313831.3376369",
  "title": "Celebrating Everyday Success: Improving Engagement and Motivation using a System for Recording Daily Highlights",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "The demands of daily work offer few opportunities for workers to take stock of their own progress, big or small, which can lead to lower motivation, engagement, and higher risk of burnout. We present Highlight Matome, a personal online tool that encourages workers to quickly record and rank a single work highlight each day, helping them gain awareness of their own successes. We describe results from a field experiment investigating our tool's effectiveness for improving workers' engagement, perceptions, and affect. Thirty-three knowledge workers in Japan and the U.S. used Highlight Matome for six weeks. Our results show that using our tool for less than one minute each day significantly increased measures of work engagement, dedication, and positivity. A qualitative analysis of the highlights offers a window into participants' emotions and perceptions. We discuss implications for theories of inner work life and worker well-being.",
  "authors": [
    {
      "name": "Daniel Avrahami",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367734",
      "orcid": "missing"
    },
    {
      "name": "Kristin Williams",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99658696545/rel-imgonly/williams-003.jpg",
      "acmid": "99658696545",
      "orcid": "missing"
    },
    {
      "name": "Matthew L. Lee",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81372592158/rel-imgonly/lee_m.jpg.jpeg",
      "acmid": "81372592158",
      "orcid": "missing"
    },
    {
      "name": "Nami Tokunaga",
      "institution": "Fuji Xerox, Yokohama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321442",
      "orcid": "missing"
    },
    {
      "name": "Yulius Tjahjadi",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481813",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Marlow",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482656556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Teresa Amabile and Steven Kramer. 2011. The progress principle: Using small wins to ignite joy, engagement, and creativity at work. Harvard Business Press.",
      "doi": ""
    },
    {
      "text": "Teresa M. Amabile, Sigal G. Barsade, Jennifer S. Mueller, and Barry M. Staw. 2005. Affect and creativity at work. Administrative science quarterly 50, 3 (2005), 367--403.",
      "doi": ""
    },
    {
      "text": "Arnold B. Bakker and Evangelia Demerouti. 2007. The Job Demands-Resources model: state of the art. Journal of Managerial Psychology; Bradford 22, 3 (2007), 309--328. DOI: http://dx.doi.org/10.1108/02683940710733115",
      "doi": ""
    },
    {
      "text": "Arnold B. Bakker and Evangelia Demerouti. 2014. Job demands--resources theory. Wellbeing: A complete reference guide (2014), 1--28.",
      "doi": ""
    },
    {
      "text": "Arnold B. Bakker and Evangelia Demerouti. 2017. Job demands--resources theory: Taking stock and looking forward. Journal of Occupational Health Psychology 22, 3 (2017), 273.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1977. Self-efficacy: Toward a unifying theory of behavioral change. Psychological Review 84, 2 (March 1977), 191--215. DOI: http://dx.doi.org/10.1037/0033--295X.84.2.191",
      "doi": "10.1037/0033-295x.84.2.191"
    },
    {
      "text": "Bootstrap. 2020. https://getbootstrap.com/. (Retrieved",
      "doi": ""
    },
    {
      "text": "January 2020). [8] Chad M Burton and Laura A King. 2004. The health benefits of writing about intensely positive experiences. Journal of research in personality 38, 2 (2004), 150--163.",
      "doi": ""
    },
    {
      "text": "Chad M. Burton and Laura A. King. 2008. Effects of (very) brief writing on health: The two-minute miracle. British Journal of Health Psychology 13, 1 (2008), 9--14.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James A. Landay. 2008. Flowers or a Robot Army?: Encouraging Awareness & Activity with Personal, Mobile Displays. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08). ACM, NY, NY, USA, 54--63.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, and James A. Landay. 2009. Theory-driven Design Strategies for Technologies That Support Behavior Change in Everyday Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 405--414.",
      "doi": ""
    },
    {
      "text": "Demerouti, Evangelia, Arnold B. Bakker, Friedhlem Nachreiner, and Wilmar Schaufeli. 2001. The job demands-resources model of burnout. Journal of Applied Psychology 86, 3 (2001), 499--512. https://doi.org/10.1037/0021--9010.86.3.499",
      "doi": ""
    },
    {
      "text": "Flask. 2020. https://www.fullstackpython.com/flask.html. (Retrieved 8 January 2020).",
      "doi": ""
    },
    {
      "text": "Flask-Babel. 2020. https://pythonhosted.org/Flask-Babel/. (Retrieved 8 January 2020).",
      "doi": ""
    },
    {
      "text": "Rowanne Fleck and Geraldine Fitzpatrick. 2010. Reflecting on Reflection: Framing a Design Landscape. In Proceedings of the 22Nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction (OZCHI '10). ACM, NY, NY, USA, 216--223. DOI: http://dx.doi.org/10.1145/1952222.1952269",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "Barbara L Fredrickson. 2001. The role of positive emotions in positive psychology: The broaden-and-build theory of positive emotions. American psychologist 56, 3 (2001), 218.",
      "doi": ""
    },
    {
      "text": "Claudia Gama. 2001. Helping students to help themselves:. In Proceedings of CINTEC International Conference (CINTEC International Conference).",
      "doi": ""
    },
    {
      "text": "Eric L. Garland, Barbara Fredrickson, Ann M. Kring, David P. Johnson, Piper S. Meyer, and David L. Penn. 2010. Upward spirals of positive emotions counter downward spirals of negativity: Insights from the broaden-and-build theory and affective neuroscience on the treatment of emotion dysfunctions and deficits in psychopathology. Clinical Psychology Review 30, 7 (Nov. 2010), 849--864. DOI: http://dx.doi.org/10.1016/j.cpr.2010.03.002",
      "doi": ""
    },
    {
      "text": "James K Harter, Frank L Schmidt, Emily A Killham, and Sangeeta Agrawal. 2006. Q12® Meta-Analysis: The Relationship Between Engagement at Work and Organizational Outcomes. (2006), 36.",
      "doi": ""
    },
    {
      "text": "Victoria Hollis, Artie Konrad, Aaron Springer, Matthew Antoun, Christopher Antoun, Rob Martin, and Steve Whittaker. 2017. What Does All This Data Mean for My Future Mood? Actionable Analytics and Targeted Reflection for Emotional Well-Being. Human-Computer Interaction 32, 5--6 (Nov. 2017), 208--267. DOI: http://dx.doi.org/10.1080/07370024.2016.1277724",
      "doi": "10.1080/07370024.2016.1277724"
    },
    {
      "text": "Victoria Hollis, Artie Konrad, and Steve Whittaker. 2015. Change of Heart: Emotion Tracking to Promote Behavior Change. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2643--2652. DOI: http://dx.doi.org/10.1145/2702123.2702196",
      "doi": "10.1145/2702123.2702196"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the Past: How Technology Mediated Reflection Improves Well-being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1071--1080. DOI: http://dx.doi.org/10.1145/2470654.2466137",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Alice M. Isen and Johnmarshall Reeve. 2005. The influence of positive affect on intrinsic and extrinsic motivation: Facilitating enjoyment of play, responsible work behavior, and self-control. Motivation and emotion 29, 4 (2005), 295--323.",
      "doi": ""
    },
    {
      "text": "Jinja2. 2020. https://jinja.palletsprojects.com/en/2.10.x/. (Retrieved 8 January 2020).",
      "doi": ""
    },
    {
      "text": "Timothy A. Judge and Remus Ilies. 2004. Affect and Job Satisfaction: A Study of Their Relationship at Work and at Home. Journal of Applied Psychology 89, 4 (2004), 661--673. DOI: http://dx.doi.org/10.1037/0021--9010.89.4.661",
      "doi": ""
    },
    {
      "text": "William A Kahn. 1990. Psychological conditions of personal engagement and disengagement at work. Academy of management journal 33, 4 (1990), 692--724.",
      "doi": ""
    },
    {
      "text": "Ruth Kanfer. 1990. Motivation Theory and Industrial and Organizational Psychology. In Handbook of Industrial and Organizational Psychology. Vol. 1. 75--170.",
      "doi": ""
    },
    {
      "text": "Jahanvash Karim, Robert Weisz, and Shafiq Ur Rehman. 2011. International positive and negative affect schedule short-form (I-PANAS-SF): Testing for factorial invariance across cultures. Procedia - Social and Behavioral Sciences 15 (Jan. 2011), 2016--2022. DOI: http://dx.doi.org/10.1016/j.sbspro.2011.04.046",
      "doi": ""
    },
    {
      "text": "Laura A King. 2001. The health benefits of writing about life goals. Personality and Social Psychology Bulletin 27, 7 (2001), 798--807.",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Daniel Avrahami, Jennifer Marlow, Di Lu, and Gary Hsieh. 2018a. Designing for Workplace Reflection: A Chat and Voice-Based Conversational Agent. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 881--894. DOI: http://dx.doi.org/10.1145/3196709.3196784",
      "doi": "10.1145/3196709.3196784"
    },
    {
      "text": "Rafal Kocielnik, Lillian Xiao, Daniel Avrahami, and Gary Hsieh. 2018b. Reflection Companion: A Conversational System for Engaging Users in Reflection on Physical Activity. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2 (July 2018), 70:1--70:26. DOI: http://dx.doi.org/10.1145/3214273",
      "doi": "10.1145/3214273"
    },
    {
      "text": "Mary J. Kwasny, Stephen M. Schueller, Emily Lattie, Elizabeth L. Gray, and David C. Mohr. 2019. Exploring the Use of Multiple Mental Health Apps Within a Platform: Secondary Analysis of the IntelliCare Field Trial. JMIR Mental Health 6, 3 (2019), e11572. DOI: http://dx.doi.org/10.2196/11572",
      "doi": ""
    },
    {
      "text": "Marjolein Lips-Wiersma and Sarah Wright. 2012. Measuring the meaning of meaningful work: Development and validation of the Comprehensive Meaningful Work Scale (CMWS). Group & Organization Management 37, 5 (2012), 655--685.",
      "doi": ""
    },
    {
      "text": "Di Lu, Jennifer Marlow, Rafal Kocielnik, and Daniel Avrahami. 2018. Challenges and Opportunities for Technology-Supported Activity Reporting in the Workplace. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 170:1--170:12. DOI: http://dx.doi.org/10.1145/3173574.3173744",
      "doi": ""
    },
    {
      "text": "Christina Maslach and Susan E. Jackson. 1981. The measurement of experienced burnout. Journal of Organizational Behavior 2, 2 (1981), 99--113. DOI: http://dx.doi.org/10.1002/job.4030020205",
      "doi": ""
    },
    {
      "text": "Christina Maslach, Wilmar B. Schaufeli, and Michael P. Leiter. 2001. Job burnout. Annual Review of Psychology 52 (2001), 397--422. https://doi.org/10.1146/annurev.psych.52.1.397",
      "doi": ""
    },
    {
      "text": "Kaspar D. Naegele and Erving Goffman. 1956. The Presentation of Self in Everyday Life. American Sociological Review 21, 5 (Oct. 1956), 631. DOI: http://dx.doi.org/10.2307/2089106",
      "doi": ""
    },
    {
      "text": "Deborah Nazarian and Joshua M Smyth. 2013. An experimental test of instructional manipulations in expressive writing interventions: Examining processes of change. Journal of Social and Clinical Psychology 32, 1 (2013), 71--96.",
      "doi": ""
    },
    {
      "text": "Greg R. Oldham and J. Richard Hackman. 2010. Not what it was and not what it will be: The future of job design research. Journal of Organizational Behavior 31, 2--3 (Feb. 2010), 463--479. DOI: http://dx.doi.org/10.1002/job.678",
      "doi": ""
    },
    {
      "text": "Pablo Paredes, Ran Gilad-Bachrach, Mary Czerwinski, Asta Roseway, Kael Rowan, and Javier Hernandez. 2014. PopTherapy: Coping with Stress Through Pop-culture. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '14). 109--117. DOI: http://dx.doi.org/10.4108/icst.pervasivehealth.2014.255070",
      "doi": "10.4108/icst.pervasivehealth.2014.255070"
    },
    {
      "text": "James W Pennebaker. 1997. Writing about emotional experiences as a therapeutic process. Psychological science 8, 3 (1997), 162--166.",
      "doi": ""
    },
    {
      "text": "Verónica Rivera-Pelayo, Angela Fessl, Lars Müller, and Viktoria Pammer. 2017. Introducing Mood Self-Tracking at Work: Empirical Insights from Call Centers. ACM Trans. Comput.-Hum. Interact. 24, 1 (Feb. 2017), 3:1--3:28. DOI: http://dx.doi.org/10.1145/3014058",
      "doi": "10.1145/3014058"
    },
    {
      "text": "Matthias Romppel, Christoph Herrmann-Lingen, Rolf Wachter, Frank Edelmann, Hans-Dirk Düngen, Burkert Pieske, and Gesine Grande. 2013. A short form of the General Self-Efficacy Scale (GSE-6): Development, psychometric properties and validity in an intercultural non-clinical sample and a sample of patients at risk for heart failure. GMS Psycho-Social-Medicine 10 (Feb. 2013). DOI: http://dx.doi.org/10.3205/psm000091",
      "doi": ""
    },
    {
      "text": "Wilmar Schaufeli. 2015. Engaging leadership in the job demands-resources model. Career Development International 20, 5 (2015), 446--463. https://doi.org/10.1108/CDI-02--2015-0025",
      "doi": ""
    },
    {
      "text": "Wilmar B. Schaufeli and Arnold B. Bakker. 2010. Defining and measuring work engagement: Bringing clarity to the concept. Work engagement: A handbook of essential theory and research 12 (2010), 10--24.",
      "doi": ""
    },
    {
      "text": "Wilmar B. Schaufeli, Arnold B. Bakker, and Marisa Salanova. 2006. The measurement of work engagement with a short questionnaire: A cross-national study. Educational and psychological measurement 66, 4 (2006), 701--716.",
      "doi": ""
    },
    {
      "text": "Wilmar B. Schaufeli, Marisa Salanova, Vicente González-romá, and Arnold B. Bakker. 2002. The Measurement of Engagement and Burnout: A Two Sample Confirmatory Factor Analytic Approach. Journal of Happiness Studies 3, 1 (March 2002), 71--92. DOI: http://dx.doi.org/10.1023/A:1015630930326",
      "doi": ""
    },
    {
      "text": "Wilmar B. Schaufeli, Akihito Shimazu, Jari Hakanen, Marisa Salanova, and Hans De Witte. 2017. An Ultra-Short Measure for Work Engagement: The UWES-3 validation across five countries. European Journal of Psychological Assessment (2017), No Pagination Specified--No Pagination Specified. DOI: http://dx.doi.org/10.1027/1015--5759/a000430",
      "doi": ""
    },
    {
      "text": "Akihito Shimazu, W. B. Schaufeli, S. Kosugi, A. Suzuki, H. Nashiwa, A. Kato, M. Sakamoto, H. Irimajiri, S. Amano, and K. Hirohata. 2008. Work engagement in Japan: validation of the Japanese version of the Utrecht Work Engagement Scale. Applied Psychology 57, 3 (2008), 510--523.",
      "doi": ""
    },
    {
      "text": "Joshua M Smyth. 1998. Written emotional expression: effect sizes, outcome types, and moderating variables. Journal of consulting and clinical psychology 66, 1 (1998), 174.",
      "doi": ""
    },
    {
      "text": "SQLAlchemy. 2020. https://www.sqlalchemy.org/. (Retrieved 8 January 2020).",
      "doi": ""
    },
    {
      "text": "Edmund R. Thompson. 2007. Development and Validation of an Internationally Reliable Short-Form of the Positive and Negative Affect Schedule (PANAS). Journal of Cross-Cultural Psychology 38, 2 (March 2007), 227--242. DOI: http://dx.doi.org/10.1177/0022022106297301",
      "doi": ""
    },
    {
      "text": "Alex C. Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T. Iqbal, and Jaime Teevan. 2018. Supporting Workplace Detachment and Reattachment with Conversational Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 88:1--88:13. DOI: http://dx.doi.org/10.1145/3173574.3173662",
      "doi": ""
    },
    {
      "text": "Jeffrey M. Zacks, Nicole K. Speer, Khena M. Swallow, Todd S. Braver, and Jeremy R. Reynolds. 2007. Event perception: A mind-brain perspective. Psychological Bulletin 133, 2 (March 2007), 273--293. DOI: http://dx.doi.org/10.1037/0033--2909.133.2.273",
      "doi": ""
    }
  ]
}