{
  "doi": "10.1145/3313831.3376234",
  "title": "MagTouch: Robust Finger Identification for a Smartwatch Using a Magnet Ring and a Built-in Magnetometer",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Completing tasks on smartwatches often requires multiple gestures due to the small size of the touchscreens and the lack of sufficient number of touch controls that are easily accessible with a finger. We propose to increase the number of functions that can be triggered with the touch gesture by enabling a smartwatch to identify which finger is being used. We developed MagTouch, a method that uses a magnetometer embedded in an off-the-shelf smartwatch. It measures the magnetic field of a magnet fixed to a ring worn on the middle finger. By combining the measured magnetic field and the touch location on the screen, MagTouch recognizes which finger is being used. The tests demonstrated that MagTouch can differentiate among the three fingers used to make contacts at a success rate of 95.03%.",
  "authors": [
    {
      "name": "Keunwoo Park",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659211427",
      "orcid": "missing"
    },
    {
      "name": "Daehwa Kim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-99659528957/rel-imgonly/20190227_211038.jpg",
      "acmid": "99659528957",
      "orcid": "missing"
    },
    {
      "name": "Seongkook Heo",
      "institution": "University of Virginia, Charlottesville, VA, USA",
      "img": "/do/10.1145/contrib-81484643096/rel-imgonly/81484643096.jpg",
      "acmid": "81484643096",
      "orcid": "0000-0003-2004-4812"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Daniel Ashbrook, Patrick Baudisch, and Sean White. 2011. Nenya: Subtle and Eyes-free Mobile Input with a Magnetically-tracked Finger Ring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2043--2046. http://dx.doi.org/10.1145/1978942.1979238",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Daniel L. Ashbrook. 2010. Enabling Mobile Microinteractions. Ph.D. Dissertation. Atlanta, GA, USA. Advisor(s) Starner, Thad E. AAI3414437.",
      "doi": "10.5555/1970601"
    },
    {
      "text": "Daniel L. Ashbrook, James R. Clawson, Kent Lyons, Thad E. Starner, and Nirmal Patel. 2008. Quickdraw: The Impact of Mobility and On-body Placement on Device Access Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'08). ACM, New York, NY, USA, 219--222. http://dx.doi.org/10.1145/1357054.1357092",
      "doi": "10.1145/1357054.1357092"
    },
    {
      "text": "Halim Cagri Ates, Ilias Apostolopoulos, and Eelke Folmer. 2015. Expanding the Vocabulary of Multitouch Input using Magnetic Fingerprints. CoRR abs/1501.03218 (2015). http://arxiv.org/abs/1501.03218",
      "doi": ""
    },
    {
      "text": "Oscar Kin-Chung Au and Chiew-Lan Tai. 2010. Multitouch Finger Registration and Its Applications. In Proceedings of the 22Nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction (OZCHI '10). ACM, New York, NY, USA, 41--48. http://dx.doi.org/10.1145/1952222.1952233",
      "doi": ""
    },
    {
      "text": "Allison A. Bailey and Peter L. Hurd. 2005. Finger length ratio (2D:4D) correlates with physical aggression in men but not in women. Biological Psychology 68, 3 (2005), 215 -- 222. http://dx.doi.org/https://doi.org/10.1016/j.biopsycho.2004.05.001",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, T. Scott Saponas, Dan Morris, and Desney Tan. 2009. Enhancing Input on and Above the Interactive Surface with Muscle Sensing. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, New York, NY, USA, 93--100. http://dx.doi.org/10.1145/1731903.1731924",
      "doi": "10.1145/1731903.1731924"
    },
    {
      "text": "Chih-Chung Chang and Chih-Jen Lin. 2011. LIBSVM: A Library for Support Vector Machines. ACM Trans. Intell. Syst. Technol. 2, 3, Article 27 (May 2011), 27 pages. http://dx.doi.org/10.1145/1961189.1961199",
      "doi": "10.1145/1961189.1961199"
    },
    {
      "text": "Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D Input Using Two Magnetic Sensors. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 237--244. http://dx.doi.org/10.1145/2501988.2502035",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Ke-Yu Chen, Shwetak N. Patel, and Sean Keller. 2016. Finexus: Tracking Precise Motions of Multiple Fingertips Using Magnetic Sensing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1504--1514. http://dx.doi.org/10.1145/2858036.2858125",
      "doi": "10.1145/2858036.2858125"
    },
    {
      "text": "Victor Cheung and Audrey Girouard. 2018. Exploring Around-Device Tangible Interactions for Mobile Devices with a Magnetic Ring. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, New York, NY, USA, 108--114. http://dx.doi.org/10.1145/3173225.3173283",
      "doi": "10.1145/3173225.3173283"
    },
    {
      "text": "Ashley Colley and Jonna H\"akkil\"a. 2014. Exploring Finger Specific Touch Screen Interaction for Mobile Phone User Interfaces. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, New York, NY, USA, 539--548. http://dx.doi.org/10.1145/2686612.2686699",
      "doi": "10.1145/2686612.2686699"
    },
    {
      "text": "Philipp Ewerling, Alexander Kulik, and Bernd Froehlich. 2012. Finger and Hand Detection for Multi-touch Interfaces Based on Maximally Stable Extremal Regions. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 173--182. http://dx.doi.org/10.1145/2396636.2396663",
      "doi": "10.1145/2396636.2396663"
    },
    {
      "text": "Bingfei Fan, Qingguo Li, Chao Wang, and Tao Liu. 2017. An Adaptive Orientation Estimation Method for Magnetic and Inertial Sensors in the Presence of Magnetic Disturbances. Sensors 17, 5 (2017). http://dx.doi.org/10.3390/s17051161",
      "doi": ""
    },
    {
      "text": "Hyunjae Gil, DoYoung Lee, Seunggyu Im, and Ian Oakley. 2017. TriTap: Identifying Finger Touches on Smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3879--3890. http://dx.doi.org/10.1145/3025453.3025561",
      "doi": "10.1145/3025453.3025561"
    },
    {
      "text": "Alix Goguey, Géry Casiez, Daniel Vogel, Fanny Chevalier, Thomas Pietrzak, and Nicolas Roussel. 2014. A Three-step Interaction Pattern for Improving Discoverability in Finger Identification Techniques. In Proceedings of the Adjunct Publication of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST'14 Adjunct). ACM, New York, NY, USA, 33--34. http://dx.doi.org/10.1145/2658779.2659100",
      "doi": "10.1145/2658779.2659100"
    },
    {
      "text": "Aakar Gupta, Muhammed Anwar, and Ravin Balakrishnan. 2016. Porous Interfaces for Small Screen Multitasking Using Finger Identification. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 145--156. http://dx.doi.org/10.1145/2984511.2984557",
      "doi": "10.1145/2984511.2984557"
    },
    {
      "text": "Aakar Gupta and Ravin Balakrishnan. 2016. DualKey: Miniature Screen Text Entry via Finger Identification. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 59--70. http://dx.doi.org/10.1145/2858036.2858052",
      "doi": "10.1145/2858036.2858052"
    },
    {
      "text": "Xinying Han, Hiroaki Seki, Yoshitsugu Kamiya, and Masatoshi Hikizu. 2007. Wearable handwriting input device using magnetic field. In SICE Annual Conference 2007. 365--368. http://dx.doi.org/10.1109/SICE.2007.4421009",
      "doi": ""
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Abracadabra: Wireless, High-precision, and Unpowered Finger Input for Very Small Mobile Devices. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 121--124. http://dx.doi.org/10.1145/1622176.1622199",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Janne Haverinen and Anssi Kemppainen. 2009. Global indoor self-localization based on the ambient magnetic field. Robotics and Autonomous Systems 57, 10 (2009), 1028--1035.",
      "doi": "10.1016/j.robot.2009.07.018"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2013. Fiberio: A Touchscreen That Senses Fingerprints. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 41--50. http://dx.doi.org/10.1145/2501988.2502021",
      "doi": "10.1145/2501988.2502021"
    },
    {
      "text": "Azusa Kadomura and Itiro Siio. 2015. MagNail: User Interaction with Smart Device Through Magnet Attached to Fingernail. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 309--312. http://dx.doi.org/10.1145/2800835.2800859",
      "doi": ""
    },
    {
      "text": "Hamed Ketabdar, Mehran Roshandel, and Kamer Ali Yüksel. 2010. Towards Using Embedded Magnetic Field Sensor for Around Mobile Device 3D Interaction. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 153--156. http://dx.doi.org/10.1145/1851600.1851626",
      "doi": "10.1145/1851600.1851626"
    },
    {
      "text": "J. Lee, J. Lim, and J. Lee. 2018. Compensated Heading Angles for Outdoor Mobile Robots in Magnetically Disturbed Environment. IEEE Transactions on Industrial Electronics 65, 2 (Feb 2018), 1408--1419. http://dx.doi.org/10.1109/TIE.2017.2726958",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-free Near-surface Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1391--1400. http://dx.doi.org/10.1145/2470654.2466185",
      "doi": "10.1145/2470654.2466185"
    },
    {
      "text": "Xin Liu, Katia Vega, Pattie Maes, and Joe A. Paradiso. 2016. Wearability Factors for Skin Interfaces. In Proceedings of the 7th Augmented Human International Conference 2016 (AH'16). ACM, New York, NY, USA, Article 21, 8 pages. http://dx.doi.org/10.1145/2875194.2875248",
      "doi": ""
    },
    {
      "text": "S. O. H. Madgwick, A. J. L. Harrison, and R. Vaidyanathan. 2011. Estimation of IMU and MARG orientation using a gradient descent algorithm. In 2011 IEEE International Conference on Rehabilitation Robotics. 1--7. http://dx.doi.org/10.1109/ICORR.2011.5975346",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Johannes Kiemer, and Saul Greenberg. 2010. What Caused That Touch?: Expressive Interaction with a Surface Through Fiduciary-tagged Gloves. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, New York, NY, USA, 139--142. http://dx.doi.org/10.1145/1936652.1936680",
      "doi": "10.1145/1936652.1936680"
    },
    {
      "text": "Nicolai Marquardt, Johannes Kiemer, David Ledo, Sebastian Boring, and Saul Greenberg. 2011. Designing User-, Hand-, and Handpart-aware Tabletop Interactions with the TouchID Toolkit. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, New York, NY, USA, 21--30. http://dx.doi.org/10.1145/2076354.2076358",
      "doi": "10.1145/2076354.2076358"
    },
    {
      "text": "Damien Masson, Alix Goguey, Sylvain Malacria, and Géry Casiez. 2017. WhichFingers: Identifying Fingers on Touch Surfaces and Keyboards Using Vibration Sensors. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 41--48. http://dx.doi.org/10.1145/3126594.3126619",
      "doi": "10.1145/3126594.3126619"
    },
    {
      "text": "J. McCann, R. Hurford, and A. Martin. 2005. A design process for the development of innovative smart clothing that addresses end-user needs from technical, functional, aesthetic and cultural view points. In Ninth IEEE International Symposium on Wearable Computers (ISWC'05). 70--77. http://dx.doi.org/10.1109/ISWC.2005.3",
      "doi": "10.1109/ISWC.2005.3"
    },
    {
      "text": "Jess McIntosh, Paul Strohmeier, Jarrod Knibbe, Sebastian Boring, and Kasper Hornbæk. 2019. Magnetips: Combining Fingertip Tracking and Haptic Feedback for Around-Device Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 408, 12 pages. http://dx.doi.org/10.1145/3290605.3300638",
      "doi": "10.1145/3290605.3300638"
    },
    {
      "text": "Donald McMillan, Barry Brown, Airi Lampinen, Moira McGregor, Eve Hoggan, and Stefania Pizza. 2017. Situating Wearables: Smartwatch Use in Context. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3582--3594. http://dx.doi.org/10.1145/3025453.3025993",
      "doi": "10.1145/3025453.3025993"
    },
    {
      "text": "Sundar Murugappan, Vinayak, Niklas Elmqvist, and Karthik Ramani. 2012. Extended Multitouch: Recovering Touch Posture and Differentiating Users Using a Depth Camera. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 487--496. http://dx.doi.org/10.1145/2380116.2380177",
      "doi": "10.1145/2380116.2380177"
    },
    {
      "text": "Jeyaseelan Nadankutty, Norashikin Mohd Shaharuddin, Phavitra Jeyabalan, Rodney Arnold, Lourdes Thomas, Thasha Thiruselvam, and Yasini Ramaiah. 2014. Digit ratio, 2D: 4D (Index finger: Ring finger) in the right and left hand of males and females in Malaysia. Open Science Repository Anthropology open-access (2014), e45011806.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Sakari Tamminen, Virpi Roto, and Jaana Kuorelahti. 2005. Interaction in 4-second Bursts: The Fragmented Nature of Attentional Resources in Mobile HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 919--928. http://dx.doi.org/10.1145/1054972.1055101",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Keunwoo Park and Geehyuk Lee. 2019. FingMag: Finger Identification Method for Smartwatch. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Article LBW2216, 6 pages. http://dx.doi.org/10.1145/3290607.3312982",
      "doi": "10.1145/3290607.3312982"
    },
    {
      "text": "Michael Peters, Kevin Mackenzie, and Pam Bryden. 2002. Finger length and distal finger extent patterns in humans. American Journal of Physical Anthropology: The Official Publication of the American Association of Physical Anthropologists 117, 3 (2002), 209--217.",
      "doi": ""
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in Vivo. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5456--5469. http://dx.doi.org/10.1145/2858036.2858522",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2010. Gesture and Voice Prototyping for Early Evaluations of Social Acceptability in Multimodal Interfaces. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI '10). ACM, New York, NY, USA, Article 16, 9 pages. http://dx.doi.org/10.1145/1891903.1891925",
      "doi": ""
    },
    {
      "text": "Quentin Roy, Yves Guiard, Gilles Bailly, Éric Lecolinet, and Olivier Rioul. 2015. Glass",
      "doi": ""
    },
    {
      "text": "Skin: An Empirical Evaluation of the Added Value of Finger Identification to Basic Single-Touch Interaction on Touch Screens. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 55--71.",
      "doi": ""
    },
    {
      "text": "A. Solin, M. Kok, N. Wahlström, T. B. Schön, and S. S\"arkk\"a. 2018. Modeling and Interpolation of the Ambient Magnetic Field by Gaussian Processes. IEEE Transactions on Robotics 34, 4 (Aug 2018), 1112--1127. http://dx.doi.org/10.1109/TRO.2018.2830326",
      "doi": "10.1109/TRO.2018.2830326"
    },
    {
      "text": "Srinath Sridhar, Anders Markussen, Antti Oulasvirta, Christian Theobalt, and Sebastian Boring. 2017. WatchSense: On- and Above-Skin Input Sensing Through a Wearable Depth Sensor. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3891--3902. http://dx.doi.org/10.1145/3025453.3026005",
      "doi": "10.1145/3025453.3026005"
    },
    {
      "text": "Atsushi Sugiura and Yoshiyuki Koseki. 1998. A User Interface Using Fingerprint Recognition: Holding Commands and Data Objects on Fingers. In Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology (UIST '98). ACM, New York, NY, USA, 71--79. http://dx.doi.org/10.1145/288392.288575",
      "doi": "10.1145/288392.288575"
    },
    {
      "text": "Julie Wagner, Eric Lecolinet, and Ted Selker. 2014. Multi-finger Chords for Hand-held Tablets: Recognizable and Memorable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2883--2892. http://dx.doi.org/10.1145/2556288.2556958",
      "doi": "10.1145/2556288.2556958"
    },
    {
      "text": "Jingtao Wang and John Canny. 2004. FingerSense: Augmenting Expressiveness to Physical Pushing Button by Fingertip Identification. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 1267--1270. http://dx.doi.org/10.1145/985921.986040",
      "doi": "10.1145/985921.986040"
    },
    {
      "text": "Nagesh Yadav and Chris Bleakley. 2014. Accurate Orientation Estimation Using AHRS under Conditions of Magnetic Distortion. Sensors 14, 11 (2014), 20008--20024. http://dx.doi.org/10.3390/s141120008",
      "doi": ""
    },
    {
      "text": "Sang Ho Yoon, Yunbo Zhang, Ke Huo, and Karthik Ramani. 2016. TRing: Instant and Customizable Interactions with Objects Using an Embedded Magnet and a Finger-Worn Device. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 169--181. http://dx.doi.org/10.1145/2984511.2984529",
      "doi": "10.1145/2984511.2984529"
    },
    {
      "text": "Jingjie Zheng and Daniel Vogel. 2016. Finger-Aware Shortcuts. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4274--4285. http://dx.doi.org/10.1145/2858036.2858355",
      "doi": ""
    }
  ]
}