{
  "doi": "10.1145/3313831.3376700",
  "title": "A Skin-Stroke Display on the Eye-Ring Through Head-Mounted Displays",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present the Skin-Stroke Display, a system mounted on the lens inside the head-mounted display, which exerts subtle yet recognizable tactile feedback on the eye-ring using a motorized air jet. To inform our design of noticeable air-jet haptic feedback, we conducted a user study to identify absolute detection thresholds. Our results show that the tactile sensation had different sensitivity around the eyes, and we determined a standard intensity (8 mbar) to prevent turbulent airflow blowing into the eyes. In the second study, we asked participants to adjust the intensity around the eye for equal sensation based on standard intensity. Next, we investigated the recognition of point and stroke stimuli with or without inducing cognitive load on eight directions on the eye-ring. Our longStroke stimulus can achieve an accuracy of 82.6% without cognitive load and 80.6% with cognitive load simulated by the Stroop test. Finally, we demonstrate example applications using the skin-stroke display as the off-screen indicator, tactile I/O progress display, and tactile display.",
  "authors": [
    {
      "name": "Wen-Jie Tseng",
      "institution": "National Chiao Tung University & Institut Polytechnique de Paris, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314915",
      "orcid": "0000-0002-3887-6388"
    },
    {
      "name": "Yi-Chen Lee",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529679",
      "orcid": "missing"
    },
    {
      "name": "Roshan Lalintha Peiris",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385592390",
      "orcid": "0000-0002-4191-3565"
    },
    {
      "name": "Liwei Chan",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659142992",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L A Jones and S J Lederman. 2006. Human Hand Function. Vol. 32. http://dx.doi.org/10.1093/acprof:oso/9780195173154.001.0001",
      "doi": ""
    },
    {
      "text": "K. Bark, J. W. Wheeler, S. Premakumar, and M. R. Cutkosky . 2008. Comparison of Skin Stretch and Vibrotactile Stimulation for Feedback of Proprioceptive Information. In 2008 Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 71--78. http://dx.doi.org/10.1109/HAPTICS.2008.4479916",
      "doi": ""
    },
    {
      "text": "Hong-Yu Chang, Wen-Jie Tseng, Chia-En Tsai, Hsin-Yu Chen, Roshan Lalintha Peiris, and Liwei Chan. 2018. FacePush: Introducing Normal Force on Face with Head-Mounted Displays. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA, 927--935. http://dx.doi.org/10.1145/3242587.3242588",
      "doi": "10.1145/3242587.3242588"
    },
    {
      "text": "Zikun Chen, Roshan Lalintha Peiris, and Kouta Minamizawa. 2017. A thermal pattern design for providing dynamic thermal feedback on the face with head mounted displays. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 381--388.",
      "doi": "10.1145/3024969.3025060"
    },
    {
      "text": "Jannick P. Rolland Craig W. Pansing, Hong Hua. 2005. Optimization of illumination schemes in a head-mounted display integrated with eye tracking capabilities. (2005). http://dx.doi.org/10.1117/12.617937",
      "doi": ""
    },
    {
      "text": "J Dargahi and S Najarian. 2004. Human tactile perception as a standard for artificial tactile sensing-a review. The International Journal of Medical Robotics and Computer Assisted Surgery 1, 1 (2004), 23--35. http://dx.doi.org/10.1002/rcs.3",
      "doi": ""
    },
    {
      "text": "V. A. de Jesus Oliveira, L. Brayda, L. Nedel, and A. Maciel . 2017. Experiencing guidance in 3D spaces with a vibrotactile head-mounted display. In 2017 IEEE Virtual Reality (VR). 453--454. http://dx.doi.org/10.1109/VR.2017.7892375",
      "doi": ""
    },
    {
      "text": "Artem Dementyev and Christian Holz. 2017. DualBlink: A Wearable Device to Continuously Detect, Track, and Actuate Blinking For Alleviating Dry Eyes and Computer Vision Syndrome. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 1, Article 1 (March 2017), 19 pages. http://dx.doi.org/10.1145/3053330",
      "doi": "10.1145/3053330"
    },
    {
      "text": "Neil A. Dodgson. 2004. Variation and extrema of human interpupillary distance. (2004). http://dx.doi.org/10.1117/12.529999",
      "doi": ""
    },
    {
      "text": "Eckovation. 2018. VR 360textdegree Solar System. Video. (23 November 2018). Retrieved August 15, 2019 from https://youtu.be/h5hC1T1A1HU.",
      "doi": ""
    },
    {
      "text": "Skydive Fyrosity. 2019. Iva Vassilev 360textdegree VR Camera. Video. (6 March 2019). Retrieved August 15, 2019 from https://vimeo.com/321746668.",
      "doi": ""
    },
    {
      "text": "Hyunjae Gil, Hyungki Son, Jin Ryong Kim, and Ian Oakley. 2018. Whiskers: Exploring the Use of Ultrasonic Haptic Cues on the Face. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 658, 13 pages. http://dx.doi.org/10.1145/3173574.3174232",
      "doi": "10.1145/3173574.3174232"
    },
    {
      "text": "B. T. Gleeson, S. K. Horschel, and W. R. Provancher. 2009. Communication of direction through lateral skin stretch at the fingertip. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 172--177. http://dx.doi.org/10.1109/WHC.2009.4810804",
      "doi": "10.1109/WHC.2009.4810804"
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality Using Head Worn Flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 227--232. http://dx.doi.org/10.1145/2984511.2984535",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "A. L. Guinan, N. C. Hornbaker, M. N. Montandon, A. J. Doxon , and W. R. Provancher. 2013. Back-to-back skin stretch feedback for communicating five degree-of-freedom direction cues. In 2013 World Haptics Conference (WHC). 13--18. http://dx.doi.org/10.1109/WHC.2013.6548377",
      "doi": ""
    },
    {
      "text": "Sidhant Gupta, Dan Morris, Shwetak N. Patel, and Desney Tan. 2013. AirWave: Non-contact Haptic Feedback Using Air Vortex Rings. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 419--428. http://dx.doi.org/10.1145/2493432.2493463",
      "doi": "10.1145/2493432.2493463"
    },
    {
      "text": "J. C. Gwilliam, A. Degirmenci, M. Bianchi, and A. M. Okamura . 2012. Design and control of an air-jet lump display. In 2012 IEEE Haptics Symposium (HAPTICS). 45--49. http://dx.doi.org/10.1109/HAPTIC.2012.6183768",
      "doi": ""
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 488, 14 pages. http://dx.doi.org/10.1145/3290605.3300718",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "A. Haynes, M. F. Simons, T. Helps, Y. Nakamura, and J. Rossiter. 2019. A Wearable Skin-Stretching Tactile Interface for Human--Robot and Human--Human Communication. IEEE Robotics and Automation Letters 4, 2 (April 2019), 1641--1646. http://dx.doi.org/10.1109/LRA.2019.2896933",
      "doi": ""
    },
    {
      "text": "Felix Hülsmann, Nikita Mattar, Julia Fröhlich, and Ipke Wachsmuth. 2014. Simulating Wind and Warmth in Virtual Reality: Conception, Realization and Evaluation for a CAVE Environment. Journal of Virtual Reality and Broadcasting 11(2014), 10 (2014). http://dx.doi.org/10.20385/1860--2037/11.2014.10",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Edward Jay Wang, and Patrick Baudisch. 2015. Skin Drag Displays: Dragging a Physical Tactor Across the User's Skin Produces a Stronger Tactile Stimulus Than Vibrotactile. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2501--2504. http://dx.doi.org/10.1145/2702123.2702459",
      "doi": "10.1145/2702123.2702459"
    },
    {
      "text": "Seungwoo Je, Brendan Rooney, Liwei Chan, and Andrea Bianchi. 2017. tactoRing: A Skin-Drag Discrete Display. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3106--3114. http://dx.doi.org/10.1145/3025453.3025703",
      "doi": "10.1145/3025453.3025703"
    },
    {
      "text": "L. A. Jones and H. Z. Tan. 2013. Application of Psychophysical Techniques to Haptic Research. IEEE Transactions on Haptics 6, 3 (July 2013), 268--284. http://dx.doi.org/10.1109/TOH.2012.74",
      "doi": "10.1109/TOH.2012.74"
    },
    {
      "text": "Takayuki Kameoka, Yuki Kon, Takuto Nakamura, and Hiroyuki Kajimoto. 2018. Haptopus: Transferring the Touch Sense of the Hand to the Face Using Suction Mechanism Embedded in HMD. In Proceedings of the Symposium on Spatial User Interaction (SUI '18). ACM, New York, NY, USA, 11--15. http://dx.doi.org/10.1145/3267782.3267789",
      "doi": "10.1145/3267782.3267789"
    },
    {
      "text": "Oliver Beren Kaul, Kevin Meier, and Michael Rohs. 2017. Increasing Presence in Virtual Reality with a Vibrotactile Grid Around the Head. In Human-Computer Interaction -- INTERACT 2017, Regina Bernhaupt, Girish Dalvi, Anirudha Joshi, Devanuj K. Balkrishan, Jacki O'Neill, and Marco Winckler (Eds.). Springer International Publishing, Cham, 289--298.",
      "doi": "10.1007/978-3-319-68059-0_19"
    },
    {
      "text": "Oliver Beren Kaul and Michael Rohs. 2017. HapticHead: A Spherical Vibrotactile Grid Around the Head for 3D Guidance in Virtual and Augmented Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3729--3740. http://dx.doi.org/10.1145/3025453.3025684",
      "doi": "10.1145/3025453.3025684"
    },
    {
      "text": "Jungho Kim, Yadav Sunil Kumar, Jisang Yoo, and Soonchul Kwon. 2018. Change of Blink Rate in Viewing Virtual Reality with HMD. Symmetry 2018 10, 9 (Sept. 2018). http://dx.doi.org/10.3390/sym10090400",
      "doi": ""
    },
    {
      "text": "Yuichiro Kojima, Yuki Hashimoto, and Hiroyuki Kajimoto. 2009. A Novel Wearable Device to Present Localized Sensation of Wind. In Proceedings of the International Conference on Advances in Computer Entertainment Technology (ACE '09). ACM, New York, NY, USA, 61--65. http://dx.doi.org/10.1145/1690388.1690399",
      "doi": "10.1145/1690388.1690399"
    },
    {
      "text": "Y. Kon, T. Nakamura, R. Sakuraqi, H. Shlonolrl, V. Yem, and H. Kajirnoto. 2018. HangerOVER: Development of HMO-Embedded Haptic Display Using the Hanger Reflex and VR Application. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE Computer Society, Los Alamitos, CA, USA, 765--766. http://dx.doi.org/10.1109/VR.2018.8446524",
      "doi": ""
    },
    {
      "text": "Jaeyeon Lee, Jaehyun Han, and Geehyuk Lee. 2015. Investigating the Information Transfer Efficiency of a 3x3 Watch-back Tactile Display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1229--1232. http://dx.doi.org/10.1145/2702123.2702530",
      "doi": "10.1145/2702123.2702530"
    },
    {
      "text": "Jaeyeon Lee and Geehyuk Lee. 2016. Designing a Non-contact Wearable Tactile Display Using Airflows. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 183--194. http://dx.doi.org/10.1145/2984511.2984583",
      "doi": "10.1145/2984511.2984583"
    },
    {
      "text": "Marjorie R. Leek. 2001. Adaptive procedures in psychophysical research. Perception & Psychophysics 63, 8 (01 Nov 2001), 1279--1292. http://dx.doi.org/10.3758/BF03194543",
      "doi": ""
    },
    {
      "text": "Kevin A. Li, Patrick Baudisch, William G. Griswold, and James D. Hollan. 2008. Tapping and Rubbing: Exploring New Dimensions of Tactile Feedback with Voice Coil Motors. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 181--190. http://dx.doi.org/10.1145/1449715.1449744",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Müller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive Interaction. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 175--175. http://dx.doi.org/10.1145/2702613.2732490",
      "doi": ""
    },
    {
      "text": "Marina Mitani and Yasuaki Kakehi. 2014. Tearsense: A Sensor System for Illuminating and Recording Teardrops. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, New York, NY, USA, Article 2, 4 pages. http://dx.doi.org/10.1145/2582051.2582053",
      "doi": "10.1145/2582051.2582053"
    },
    {
      "text": "Taeyong Moon and Gerard J. Kim. 2004. Design and Evaluation of a Wind Display for Virtual Reality. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '04). ACM, New York, NY, USA, 122--128. http://dx.doi.org/10.1145/1077534.1077558",
      "doi": ""
    },
    {
      "text": "Dae Hwan Park, Won Seok Choi, Sean Hyuck Yoon, and Chul Hong Song. 2008. Anthropometry of Asian Eyelids by Age. (2008), 1405--1413. http://dx.doi.org/10.1097/01.prs.0000304608.33432.67",
      "doi": ""
    },
    {
      "text": "Roshan Lalitha Peiris, Yuan-Ling Feng, Liwei Chan, and Kouta Minamizawa. 2019. Thermal Bracelet: Exploring Thermal Haptic Feedback Around the Wrist. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Article 170, 11 pages. http://dx.doi.org/10.1145/3290605.3300400",
      "doi": "10.1145/3290605.3300400"
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, Liwei Chan, and Kouta Minamizawa. 2017b. ThermoVR: Exploring Integrated Thermal Haptic Feedback with Head Mounted Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5452--5456. http://dx.doi.org/10.1145/3025453.3025824",
      "doi": "10.1145/3025453.3025824"
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, and Kouta Minamizawa. 2017a. Exploration of cuing methods for localization of spatial cues using thermal haptic feedback on the forehead. In 2017 IEEE World Haptics Conference (WHC). IEEE, 400--405.",
      "doi": ""
    },
    {
      "text": "Henning Pohl and Kasper Hornbæk. 2018. ElectricItch: Skin Irritation As a Feedback Modality. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA, 765--778. http://dx.doi.org/10.1145/3242587.3242647",
      "doi": "10.1145/3242587.3242647"
    },
    {
      "text": "W. R. Provancher and N. D. Sylvester. 2009. Fingerpad Skin Stretch Increases the Perception of Virtual Friction. IEEE Transactions on Haptics 2, 4 (Oct 2009), 212--223. http://dx.doi.org/10.1109/TOH.2009.34",
      "doi": "10.1109/TOH.2009.34"
    },
    {
      "text": "Z. F. Quek, S. B. Schorr, I. Nisky, W. R. Provancher, and A. M. Okamura. 2014. Sensory substitution using 3-degree-of-freedom tangential and normal skin deformation feedback. In 2014 IEEE Haptics Symposium (HAPTICS). 27--33. http://dx.doi.org/10.1109/HAPTICS.2014.6775429",
      "doi": ""
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1731--1742. http://dx.doi.org/10.1145/3025453.3025723",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Nguyen Thi Ngoc Tram, Koon Chuan Raymond Koh, David Tolley, Shienny Karwita, Lin Lien-Ya, Yan Liangkun, Kala Shamaiah, Chow Eason Wai Tung, Ching Chiuan Yen, and Ellen Yi-Luen Do. 2018. Season Traveller: Multisensory Narration for Enhancing the Virtual Reality Experience. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 577, 13 pages. http://dx.doi.org/10.1145/3173574.3174151",
      "doi": "10.1145/3173574.3174151"
    },
    {
      "text": "Michael Rietzler, Katrin Plaumann, Taras Kranzle, Marcel Erath, Alexander Stahl, and Enrico Rukzio. 2017. VaiR: Simulating 3D Airflows in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5669--5677. http://dx.doi.org/10.1145/3025453.3026009",
      "doi": "10.1145/3025453.3026009"
    },
    {
      "text": "Yuka Sato and Ryoko Ueoka. 2017. Investigating Haptic Perception of and Physiological Responses to Air Vortex Rings on a User's Cheek. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3083--3094. http://dx.doi.org/10.1145/3025453.3025501",
      "doi": "10.1145/3025453.3025501"
    },
    {
      "text": "Rajinder Sodhi, Ivan Poupyrev, Matthew Glisson, and Ali Israr. 2013. AIREAL: Interactive Tactile Experiences in Free Air. ACM Trans. Graph. 32, 4, Article 134 (July 2013), 10 pages. http://dx.doi.org/10.1145/2461912.2462007",
      "doi": "10.1145/2461912.2462007"
    },
    {
      "text": "J. R. Stroop. 1935. Studies of interference in serial verbal reactions. Journal of Experimental Psychology 18 (1935), 643--662.",
      "doi": ""
    },
    {
      "text": "Y. Suzuki and M. Kobayashi. 2005. Air jet driven force feedback in virtual reality. IEEE Computer Graphics and Applications 25, 1 (Jan 2005), 44--47. http://dx.doi.org/10.1109/MCG.2005.1",
      "doi": "10.1109/MCG.2005.1"
    },
    {
      "text": "David Tolley, Thi Ngoc Tram Nguyen, Anthony Tang, Nimesha Ranasinghe, Kensaku Kawauchi, and Ching Chiuan Yen. 2019. WindyWall: Exploring Creative Wind Simulations. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, New York, NY, USA, 635--644. http://dx.doi.org/10.1145/3294109.3295624",
      "doi": "10.1145/3294109.3295624"
    },
    {
      "text": "Chi Wang, Da-Yuan Huang, Shuo-wen Hsu, Chu-En Hou, Yeu-Luen Chiu, Ruei-Che Chang, Jo-Yu Lo, and Bing-Yu Chen. 2019. Masque: Exploring Lateral Skin Stretch Feedback on the Face with Head-Mounted Displays. In Proceedings of the 32Nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, New York, NY, USA, 439--451. http://dx.doi.org/10.1145/3332165.3347898",
      "doi": "10.1145/3332165.3347898"
    },
    {
      "text": "D. Wolf, M. Rietzler, L. Hnatek, and E. Rukzio. 2019. Face/On: Multi-Modal Haptic Feedback for Head-Mounted Displays in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 25, 11 (Nov 2019), 3169--3177. http://dx.doi.org/10.1109/TVCG.2019.2932215",
      "doi": ""
    }
  ]
}