{
  "doi": "10.1145/3313831.3376451",
  "title": "Tempura: Query Analysis with Structural Templates",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Analyzing queries from search engines and intelligent assistants is difficult. A key challenge is organizing queries into interpretable, context-preserving, representative, and flexible groups. We present structural templates, abstract queries that replace tokens with their linguistic feature forms, as a query grouping method. The templates allow analysts to create query groups with structural similarity at different granularities. We introduce Tempura, an interactive tool that lets analysts explore a query dataset with structural templates. Tempura summarizes a query dataset by selecting a representative subset of templates to show the query distribution. The tool also helps analysts navigate the template space by suggesting related templates likely to yield further explorations. Our user study shows that Tempura helps analysts examine the distribution of a query dataset, find labeling errors, and discover model error patterns and outliers.",
  "tags": [
    "natural language processing",
    "query analysis",
    "error analysis"
  ],
  "authors": [
    {
      "name": "Tongshuang Wu",
      "institution": "University of Washington & Apple Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659439447",
      "orcid": "missing"
    },
    {
      "name": "Kanit Wongsuphasawat",
      "institution": "Apple Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548549056",
      "orcid": "missing"
    },
    {
      "name": "Donghao Ren",
      "institution": "Apple Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526797",
      "orcid": "missing"
    },
    {
      "name": "Kayur Patel",
      "institution": "Apple Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350576909",
      "orcid": "missing"
    },
    {
      "name": "Chris DuBois",
      "institution": "Apple Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527970",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mehdi Allahyari, Seyedamin Pouriyeh, Mehdi Asseff, Saied Safaei, Elizabeth D Trippe, Juan B Gutierrez, and Krys Kochut. 2017. A brief survey of text mining: Classification, clustering and extraction techniques. arXiv preprint arXiv:1707.02919 (2017).",
      "doi": ""
    },
    {
      "text": "Stanislaw Antol, Aishwarya Agrawal, Jiasen Lu, Margaret Mitchell, Dhruv Batra, C Lawrence Zitnick, and Devi Parikh. 2015. Vqa: Visual question answering. In Proceedings of the IEEE international conference on computer vision. 2425--2433.",
      "doi": "10.1109/ICCV.2015.279"
    },
    {
      "text": "Jaime Arguello, Fernando Diaz, Jamie Callan, and Jean-Francois Crespo. 2009. Sources of evidence for vertical selection. In Proceedings of the 32nd international ACM SIGIR conference on Research and development in information retrieval. ACM, 315--322.",
      "doi": "10.1145/1571941.1571997"
    },
    {
      "text": "Jay Budzik and Kristian J Hammond. 2000. User interactions with everyday applications as context for just-in-time information access. In Proceedings of the 5th international conference on intelligent user interfaces. ACM, 44--51.",
      "doi": "10.1145/325737.325776"
    },
    {
      "text": "Gabriele Capannini, Franco Maria Nardini, Raffaele Perego, and Fabrizio Silvestri. 2011. Efficient diversification of web search results. Proceedings of the VLDB Endowment 4, 7 (2011), 451--459.",
      "doi": "10.14778/1988776.1988781"
    },
    {
      "text": "Jason Chuang, Margaret E Roberts, Brandon M Stewart, Rebecca Weiss, Dustin Tingley, Justin Grimmer, and Jeffrey Heer. 2015. TopicCheck: Interactive alignment for assessing topic model stability. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 175--184.",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805 (2018).",
      "doi": ""
    },
    {
      "text": "Lisa Ehrlinger and Wolfram Wöß. 2016. Towards a Definition of Knowledge Graphs. SEMANTiCS (Posters, Demos, SuCCESS) 48 (2016).",
      "doi": ""
    },
    {
      "text": "Cristian Felix, Anshul Vikram Pandey, and Enrico Bertini. 2017. TextTile: an interactive visualization tool for seamless exploratory analysis of structured data and unstructured text. IEEE transactions on visualization and computer graphics 23, 1 (2017), 161--170.",
      "doi": ""
    },
    {
      "text": "Adam Fourney and Susan T Dumais. 2016. Automatic identification and contextual reformulation of implicit system-related queries. In Proceedings of the 39th International ACM SIGIR conference on Research and Development in Information Retrieval. ACM, 761--764.",
      "doi": "10.1145/2911451.2914701"
    },
    {
      "text": "Kuzman Ganchev, Keith Hall, Ryan McDonald, and Slav Petrov. 2012. Using search-logs to improve query tagging. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Short Papers-Volume 2. Association for Computational Linguistics, 238--242.",
      "doi": "10.5555/2390665.2390723"
    },
    {
      "text": "Sonal Gupta, Diana L MacLean, Jeffrey Heer, and Christopher D Manning. 2014. Induced lexico-syntactic patterns improve information extraction from online medical forums. Journal of the American Medical Informatics Association 21, 5 (2014), 902--909.",
      "doi": ""
    },
    {
      "text": "Suchin Gururangan, Swabha Swayamdipta, Omer Levy, Roy Schwartz, Samuel Bowman, and Noah A. Smith. 2018. Annotation Artifacts in Natural Language Inference Data. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers). Association for Computational Linguistics, New Orleans, Louisiana, 107--112. DOI: http://dx.doi.org/10.18653/v1/N18--2017",
      "doi": ""
    },
    {
      "text": "Jiawei Han, Hong Cheng, Dong Xin, and Xifeng Yan. 2007. Frequent pattern mining: current status and future directions. Data mining and knowledge discovery 15, 1 (2007), 55--86.",
      "doi": ""
    },
    {
      "text": "Marti A Hearst. 1992. Automatic acquisition of hyponyms from large text corpora. In Proceedings of the 14th conference on Computational linguistics-Volume 2. Association for Computational Linguistics, 539--545.",
      "doi": "10.3115/992133.992154"
    },
    {
      "text": "Raphael Hoffmann, Luke Zettlemoyer, and Daniel S Weld. 2015. Extreme extraction: Only one hour per relation. arXiv preprint arXiv:1506.06418 (2015).",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Jennifer Wortman Vaughan, Hal Daumé III, Miro Dudik, and Hanna Wallach. 2019. Improving fairness in machine learning systems: What do industry practitioners need?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 600.",
      "doi": "10.1145/3290605.3300830"
    },
    {
      "text": "Enamul Hoque, Vidya Setlur, Melanie Tory, and Isaac Dykeman. 2017. Applying pragmatics principles for interaction with visual analytics. IEEE transactions on visualization and computer graphics 24, 1 (2017), 309--318.",
      "doi": ""
    },
    {
      "text": "Mengdie Hu, Krist Wongsuphasawat, and John Stasko. 2017. Visualizing social media content with sententree. IEEE transactions on visualization and computer graphics 23, 1 (2017), 621--630.",
      "doi": "10.1109/TVCG.2016.2598590"
    },
    {
      "text": "Mandar Joshi, Eunsol Choi, Daniel S Weld, and Luke Zettlemoyer. 2017. Triviaqa: A large scale distantly supervised challenge dataset for reading comprehension. arXiv preprint arXiv:1705.03551 (2017).",
      "doi": ""
    },
    {
      "text": "Kushal Kaffe and Christopher Kanan. 2017. An analysis of visual question answering algorithms. In Proceedings of the IEEE International Conference on Computer Vision. 1965--1973.",
      "doi": ""
    },
    {
      "text": "Tom Kwiatkowski, Jennimaria Palomaki, Olivia Redfield, Michael Collins, Ankur Parikh, Chris Alberti, Danielle Epstein, Illia Polosukhin, Jacob Devlin, Kenton Lee, and others. 2019. Natural questions: a benchmark for question answering research. Transactions of the Association for Computational Linguistics 7 (2019), 453--466.",
      "doi": ""
    },
    {
      "text": "Xiao Li. 2010. Understanding the semantic structure of noun phrase queries. In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics. Association for Computational Linguistics, 1337--1345.",
      "doi": ""
    },
    {
      "text": "Rensis Likert. 1932. A technique for the measurement of attitudes. Archives of psychology (1932).",
      "doi": ""
    },
    {
      "text": "Andrew McCallum. 2005. Information extraction: Distilling structured data from unstructured text. Queue 3, 9 (2005), 4.",
      "doi": "10.1145/1105664.1105679"
    },
    {
      "text": "Sewon Min, Victor Zhong, Richard Socher, and Caiming Xiong. 2018. Efficient and robust question answering from minimal context over documents. arXiv preprint arXiv:1805.08092 (2018).",
      "doi": ""
    },
    {
      "text": "Alaa Mohasseb, Mohamed Bader-El-Den, and Mihaela Cocea. 2018. Analysis of the syntactical structure of web queries. In 2018 International Conference on Machine Learning and Cybernetics (ICMLC), Vol. 2. IEEE, 557--562.",
      "doi": ""
    },
    {
      "text": "Tri Nguyen, Mir Rosenberg, Xia Song, Jianfeng Gao, Saurabh Tiwary, Rangan Majumder, and Li Deng. 2016. MS MARCO: A Human-Generated MAchine Reading COmprehension Dataset. (2016).",
      "doi": ""
    },
    {
      "text": "Marius Pasca and Benjamin Van Durme. 2007. What You Seek Is What You Get: Extraction of Class Attributes from Query Logs.. In IJCAI, Vol. 7. 2832--2837.",
      "doi": ""
    },
    {
      "text": "Ana-Maria Popescu and Orena Etzioni. 2007. Extracting product features and opinions from reviews. In Natural language processing and text mining. Springer, 9--28.",
      "doi": ""
    },
    {
      "text": "Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. Squad: 100,000+ questions for machine comprehension of text. arXiv preprint arXiv:1606.05250 (2016).",
      "doi": ""
    },
    {
      "text": "Alexander Ratner, Stephen H Bach, Henry Ehrenberg, Jason Fries, Sen Wu, and Christopher Ré. 2017. Snorkel: Rapid training data creation with weak supervision. Proceedings of the VLDB Endowment 11, 3 (2017), 269--282.",
      "doi": "10.14778/3157794.3157797"
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2018. Semantically equivalent adversarial rules for debugging nlp models. In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). 856--865.",
      "doi": ""
    },
    {
      "text": "Mattia Samory and Tanushree Mitra. 2019. SENPAI: Supporting Exploratory Text Analysis through Semantic & Syntactic Pattern Inspection. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 452--462.",
      "doi": ""
    },
    {
      "text": "Vidya Setlur, Melanie Tory, and Alex Djalali. 2019. Inferencing underspecified natural language utterances in visual analysis.. In IUI. 40--51.",
      "doi": ""
    },
    {
      "text": "Dou Shen, Jian-Tao Sun, Qiang Yang, and Zheng Chen. 2006. Building bridges for web query classification. In Proceedings of the 29th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 131--138.",
      "doi": "10.1145/1148170.1148196"
    },
    {
      "text": "Yelong Shen, Xiaodong Liu, Kevin Duh, and Jianfeng Gao. 2017. An empirical analysis of multiple-turn reasoning strategies in reading comprehension tasks. arXiv preprint arXiv:1711.03230 (2017).",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1996. The eyes have it: A task by data type taxonomy for information visualizations. In Proceedings 1996 IEEE symposium on visual languages. IEEE, 336--343.",
      "doi": ""
    },
    {
      "text": "Soumya Wadhwa, Khyathi Raghavi Chandu, and Eric Nyberg. 2018. Comparative Analysis of Neural QA models on SQuAD. arXiv preprint arXiv:1806.06972 (2018).",
      "doi": ""
    },
    {
      "text": "Peng Wang, Jiaming Xu, Bo Xu, Chenglin Liu, Heng Zhang, Fangyuan Wang, and Hongwei Hao. 2015. Semantic clustering and convolutional neural network for short text categorization. In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing (Volume 2: Short Papers). 352--357.",
      "doi": ""
    },
    {
      "text": "Tongshuang Wu, Marco Tulio Ribeiro, Jeffrey Heer, and Daniel S Weld. 2019. Errudite: Scalable, Reproducible, and Testable Error Analysis. In Proceedings of the 57th Conference of the Association for Computational Linguistics. 747--763.",
      "doi": ""
    },
    {
      "text": "Runqi Yang, Jianhai Zhang, Xing Gao, Feng Ji, and Haiqing Chen. 2019. Simple and Effective Text Matching with Richer Alignment Features. In Association for Computational Linguistics (ACL).",
      "doi": ""
    },
    {
      "text": "Neal E Young. 2008. Greedy Set-Cover Algorithms: 1974--1979; Chvátal, Johnson, Lovász, Stein. Encyclopedia of algorithms (2008), 379--381.",
      "doi": ""
    },
    {
      "text": "Jiawei Zhang, Yang Wang, Piero Molino, Lezhi Li, and David S Ebert. 2018. Manifold: A model-agnostic framework for interpretation and diagnosis of machine learning models. IEEE transactions on visualization and computer graphics 25, 1 (2018), 364--373.",
      "doi": ""
    }
  ]
}