{
  "doi": "10.1145/3313831.3376749",
  "title": "Review of Quantitative Empirical Evaluations of Technology for People with Visual Impairments",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Addressing the needs of visually impaired people is of continued interest in Human Computer Interaction (HCI) research. Yet, one of the major challenges facing researchers in this field continues to be how to design adequate quantitative empirical evaluation for these users in HCI. In this paper, we analyse a corpus of 178 papers on technologies designed for people with visual impairments, published since 1988, and including at least one quantitative empirical evaluation (243 evaluations in total). To inform future research in this area, we provide an overview, historic trends and a unified terminology to design and report quantitative empirical evaluations. We identify open issues and propose a set of guidelines to address them. Our analysis aims to facilitate and stimulate future research on this topic.",
  "authors": [
    {
      "name": "Emeline Brulé",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658765641",
      "orcid": "missing"
    },
    {
      "name": "Brianna J. Tomlinson",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639687",
      "orcid": "missing"
    },
    {
      "name": "Oussama Metatla",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418592476",
      "orcid": "0000-0002-3882-3243"
    },
    {
      "name": "Christophe Jouffrais",
      "institution": "CNRS, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377594403",
      "orcid": "0000-0002-0768-1019"
    },
    {
      "name": "Marcos Serrano",
      "institution": "Univ of Toulouse, Toulouse, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    }
  ],
  "references": [
    {
      "text": "2019. Human Computer Interaction - Google Scholar Metrics. (2019). https://scholar.google.com/citations?view_op=top_venues&hl=en&vq=eng_humancomputerinteraction",
      "doi": ""
    },
    {
      "text": "Iyad Abu Doush, Enrico Pontelli, Dominic Simon, Tran Cao Son, and Ou Ma. 2009. Making Microsoft Excelc: multimodal presentation of charts. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility. ACM, 147--154.",
      "doi": ""
    },
    {
      "text": "Jérémy Albouys-Perrois, Jérémy Laviole, Carine Briant, and Anke M Brock. 2018. Towards a multisensory augmented reality map for blind and low vision people: A participatory design approach. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 629.",
      "doi": "10.1145/3173574.3174203"
    },
    {
      "text": "Farhan Khashim Alswailmi. 2018. Global prevalence and causes of visual impairment with special reference to the general population of Saudi Arabia. Pakistan journal of medical sciences 34, 3 (2018), 751.",
      "doi": ""
    },
    {
      "text": "Catherine L Backman and Susan R Harris. 1999. Case Studies, Single-Subject Research, and N of 1 Randomized Trials: Comparisons and Contrasts1. American Journal of Physical Medicine & Rehabilitation 78, 2 (1999), 170--176.",
      "doi": ""
    },
    {
      "text": "Suzanne Balik, Sean Mealin, Matthias Stallmann, Robert Rodman, Michelle Glatz, and Veronica Sigler. 2014. Including blind people in computing through access to graphs. ASSETS14 - Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility (10 2014), 91--98. DOI: http://dx.doi.org/10.1145/2661334.2661364",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T Kortum, and James T Miller. 2008. An empirical evaluation of the system usability scale. Intl. Journal of Human--Computer Interaction 24, 6 (2008), 574--594.",
      "doi": ""
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, and Christophe Jouffrais. 2016. From Tactile to Virtual: Using a Smartwatch to Improve Spatial Map Exploration for Visually Impaired Users. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, NY, NY, USA, 100--111. DOI: http://dx.doi.org/10.1145/2935334.2935342",
      "doi": "10.1145/2935334.2935342"
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, Simon Perrault, Shengdong Zhao, and Christophe Jouffrais. 2019. Investigating Feedback for Two-Handed Exploration of Digital Maps Without Vision. In IFIP Conference on Human-Computer Interaction. Springer, 305--324.",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus and Jennifer A. Rode. 2007. From Mice to Men - 24 Years of Evaluation in CHI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, Article 1. DOI: http://dx.doi.org/10.1145/1240624.2180963",
      "doi": "10.1145/1240624.2180963"
    },
    {
      "text": "Cynthia L. Bennett and Daniela K. Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the \"Other\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 298, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300528",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Alexy Bhowmick and Shyamanta M Hazarika. 2017. An insight into assistive technology for the visually impaired and blind people: state-of-the-art and future trends. Journal on Multimodal User Interfaces 11, 2 (2017), 149--172.",
      "doi": ""
    },
    {
      "text": "Syed Masum Billah, Yu-Jung Ko, Vikas Ashok, Xiaojun Bi, and IV Ramakrishnan. 2019. Accessible Gesture Typing for Non-Visual Text Entry on Smartphones. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 376, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300606",
      "doi": "10.1145/3290605.3300606"
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1077--1086.",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Sebastian K Boell and Dubravka Cecez-Kecmanovic. 2010. Literature reviews and the hermeneutic circle. Australian Academic & Research Libraries 41, 2 (2010), 129--144.",
      "doi": ""
    },
    {
      "text": "Danielle Bragg, Cynthia Bennett, Katharina Reinecke, and Richard Ladner. 2018. A Large Inclusive Study of Human Listening Rates. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 444, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174018",
      "doi": "10.1145/3173574.3174018"
    },
    {
      "text": "Andy Brown, Steve Pettifer, and Robert Stevens. 2003. Evaluation of a Non-visual Molecule Browser. SIGACCESS Access. Comput. 77--78 (Sept. 2003), 40--47. DOI: http://dx.doi.org/10.1145/1029014.1028639",
      "doi": ""
    },
    {
      "text": "Emeline Brulé and Christophe Jouffrais. 2016. Representing children living with visual impairments in the design process: A case study with personae. In Designing Around People. Springer, 23--32.",
      "doi": ""
    },
    {
      "text": "Emeline Brulé, Oussama Metatla, Katta Spiel, Ahmed Kharrufa, and Charlotte Robinson. 2019. Evaluating Technologies with and for Disabled Children. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article SIG08, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3311757",
      "doi": ""
    },
    {
      "text": "Colleen M Carpinella, Alisa B Wyman, Michael A Perez, and Steven J Stroessner. 2017. The robotic social attributes scale (rosas): Development and validation. In Proceedings of the 2017 ACM/IEEE International Conference on human-robot interaction. ACM, 254--262.",
      "doi": "10.1145/2909824.3020208"
    },
    {
      "text": "Anna Cavender, Shari Trewin, and Vicki Hanson. 2014. Accessible writing guide. https://www.sigaccess.org/welcome-tosigaccess/resources/accessible-writing-guide/ (2014).",
      "doi": ""
    },
    {
      "text": "John A Collins and Bart CJM Fauser. 2005. Balancing the strengths of systematic and narrative reviews. (2005).",
      "doi": ""
    },
    {
      "text": "Ticianne GR Darin, Rossana Andrade, Lotif B Merabet, and Jaime Hernán Sánchez. 2017. Investigating the Mode in Multimodal Video Games: Usability Issues for Learners who are Blind. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2487--2495.",
      "doi": "10.1145/3027063.3053177"
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair statistical communication in HCI. In Modern Statistical Methods for HCI. Springer, 291--330.",
      "doi": ""
    },
    {
      "text": "Julie Ducasse, Marc Macé, Bernard Oriola, and Christophe Jouffrais. 2018. BotMap: Non-Visual Panning and Zooming with an Actuated Tabletop Tangible Interface. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 4 (2018), 24.",
      "doi": "10.1145/3204460"
    },
    {
      "text": "Julie Ducasse, Marc J-M Macé, Marcos Serrano, and Christophe Jouffrais. 2016. Tangible Reels: Construction and Exploration of Tangible Maps by Visually Impaired Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2186--2197. DOI: http://dx.doi.org/10.1145/2858036.2858058",
      "doi": "10.1145/2858036.2858058"
    },
    {
      "text": "Naomi Friedlander, Kevin Schlueter, and Marilyn Mantei. 1998. Bullseye! when Fitts' law doesn't it. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 257--264.",
      "doi": "10.1145/274644.274681"
    },
    {
      "text": "Prathik Gadde and Davide Bolchini. 2014. From screen reading to aural glancing: towards instant access to key page sections. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 67--74.",
      "doi": "10.1145/2661334.2661363"
    },
    {
      "text": "Thomas Gallagher, Elyse Wise, Hoe Chee Yam, Binghao Li, Euan Ramsey-Stewart, Andrew G Dempster, and Chris Rizos. 2014. Indoor navigation for people who are blind or vision impaired: where are we and where are we going? Journal of Location Based Services 8, 1 (2014), 54--73.",
      "doi": "10.1080/17489725.2014.895062"
    },
    {
      "text": "Morton Ann Gernsbacher. 2017. Editorial Perspective: The use of person-first language in scholarly writing may accentuate stigma. Journal of Child Psychology and Psychiatry 58, 7 (2017), 859--861. DOI: http://dx.doi.org/10.1111/jcpp.12706",
      "doi": ""
    },
    {
      "text": "Monica Gori, Giulia Cappagli, Alessia Tonelli, Gabriel Baud-Bovy, and Sara Finocchietti. 2016. Devices for visually impaired people: High technological devices with low user acceptance and no adaptability for children. Neuroscience & Biobehavioral Reviews 69 (2016), 79--88.",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann. 2018. Autonomous Selection and Printing of 3D Models for People Who Are Blind. ACM Transactions on Accessible Computing (TACCESS) 11, 3 (2018), 14.",
      "doi": ""
    },
    {
      "text": "Wayne D Gray and Marilyn C Salzman. 1998. Damaged merchandise? A review of experiments that compare usability evaluation methods. Human-computer interaction 13, 3 (1998), 203--261.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability evaluation considered harmful (some of the time). In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 111--120.",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "João Guerreiro, Dragan Ahmetovic, Kris M. Kitani, and Chieko Asakawa. 2017. Virtual Navigation for Blind People: Building Sequential Representations of the Real-World. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, NY, NY, USA, 280--289. DOI: http://dx.doi.org/10.1145/3132525.3132545",
      "doi": "10.1145/3132525.3132545"
    },
    {
      "text": "Kim Halskov and Nicolai Brodersen Hansen. 2015. The diversity of participatory design research practice at PDC 2002--2012. International Journal of Human-Computer Studies 74 (2015), 81--92.",
      "doi": "10.1016/j.ijhcs.2014.09.003"
    },
    {
      "text": "Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage publications Sage CA: Los Angeles, CA, 904--908.",
      "doi": ""
    },
    {
      "text": "Marion Hersh and Michael A Johnson. 2010. Assistive technology for visually impaired and blind people. Springer Science & Business Media.",
      "doi": "10.5555/1795896"
    },
    {
      "text": "Jonggi Hong, Alisha Pradhan, Jon E. Froehlich, and Leah Findlater. 2017. Evaluating Wrist-Based Haptic Feedback for Non-Visual Target Finding and Path Tracing on a 2D Surface. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, NY, NY, USA, 210--219. DOI: http://dx.doi.org/10.1145/3132525.3132538",
      "doi": "10.1145/3132525.3132538"
    },
    {
      "text": "Hernisa Kacorri, Eshed Ohn-Bar, Kris M Kitani, and Chieko Asakawa. 2018. Environmental factors in indoor navigation based on real-world trajectories of blind users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 56.",
      "doi": "10.1145/3173574.3173630"
    },
    {
      "text": "Seita Kayukawa, Keita Higuchi, João Guerreiro, Shigeo Morishima, Yoichi Sato, Kris Kitani, and Chieko Asakawa. 2019. BBeep: A Sonic Collision Avoidance System for Blind Travellers and Nearby Pedestrians. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 52.",
      "doi": "10.1145/3290605.3300282"
    },
    {
      "text": "Stacy M Kelly and Derrick W Smith. 2011. The impact of assistive technology on the educational performance of students with visual impairments: A synthesis of the research. Journal of Visual Impairment & Blindness 105, 2 (2011), 73--83.",
      "doi": ""
    },
    {
      "text": "Barbara Kitchenham. 2004. Procedures for performing systematic reviews. Keele, UK, Keele University 33, 2004 (2004), 1--26.",
      "doi": ""
    },
    {
      "text": "Jesper Kjeldskov and Mikael B Skov. 2014. Was it worth the hassle?: ten years of mobile HCI research discussions on lab and ?eld evaluations. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. Acm, 43--52.",
      "doi": "10.1145/2628363.2628398"
    },
    {
      "text": "Steven La Grow and others. 1999. The use of the Sonic Pathfinder as a secondary mobility aid for travel in business environments: a single-subject design. Journal of rehabilitation research and development 36, 4 (1999), 333--340.",
      "doi": ""
    },
    {
      "text": "Heidi Lam, Enrico Bertini, Petra Isenberg, Catherine Plaisant, and Sheelagh Carpendale. 2011. Seven guiding scenarios for information visualization evaluation. (2011).",
      "doi": ""
    },
    {
      "text": "Shachar Maidenbaum, Sami Abboud, and Amir Amedi. 2014. Sensory substitution: closing the gap between basic research and widespread practical visual rehabilitation. Neuroscience & Biobehavioral Reviews 41 (2014), 3--15.",
      "doi": ""
    },
    {
      "text": "Ahtsham Manzoor, Safa Arooj, Shaban Zul?qar, Murayyiam Parvez, Suleman Shahid, and Asim Karim. 2019. ALAP: Accessible LaTeX Based Mathematical Document Authoring and Presentation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 504, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300734",
      "doi": "10.1145/3290605.3300734"
    },
    {
      "text": "Sergio Mascetti, Andrea Gerino, Cristian Bernareggi, and Lorenzo Picinali. 2017. On the evaluation of novel sonification techniques for non-visual shape exploration. ACM Transactions on Accessible Computing (TACCESS) 9, 4 (2017), 13.",
      "doi": ""
    },
    {
      "text": "Joseph E McGrath. 1995. Methodology matters: Doing research in the behavioral and social sciences. In Readings in Human--Computer Interaction. Elsevier, 152--169.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Marcos Serrano, Christophe Jouffrais, Anja Thieme, Shaun Kane, Stacy Branham, Émeline Brulé, and Cynthia L. Bennett. 2018a. Inclusive Education Technologies: Emerging Opportunities for People with Visual Impairments. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article W13, 8 pages. DOI: http://dx.doi.org/10.1145/3170427.3170633",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Anja Thieme, Emeline Brulé, Cynthia Bennett, Marcos Serrano, and Christophe Jouffrais. 2018b. Toward Classroom Experiences Inclusive of Students with Disabilities. Interactions 26, 1 (Dec. 2018), 40--45. DOI: http://dx.doi.org/10.1145/3289485",
      "doi": "10.1145/3289485"
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic evaluation of user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 249--256.",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Joyojeet Pal, Anandhi Viswanathan, Priyank Chandra, Anisha Nazareth, Vaishnav Kameswaran, Hariharan Subramonyam, Aditya Johri, Mark S Ackerman, and Sile O'Modhrain. 2017. Agency in assistive technology adoption: visual impairment and smartphone use in Bangalore. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5929--5940.",
      "doi": "10.1145/3025453.3025895"
    },
    {
      "text": "Peter Parente. 2004. Audio Enriched Links: Web Page Previews for Blind Users. In Proceedings of the 6th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '04). ACM, NY, NY, USA, 2--8. DOI: http://dx.doi.org/10.1145/1028630.1028633",
      "doi": "10.1145/1028630.1028633"
    },
    {
      "text": "Amy T Parker. 2009. Orientation and mobility with persons who are deaf-blind: An initial examination of single-subject design research. Journal of Visual Impairment & Blindness 103, 6 (2009), 372--377.",
      "doi": ""
    },
    {
      "text": "Donatella Pascolini and Silvio Paolo Mariotti. 2012. Global estimates of visual impairment: 2010. British Journal of Ophthalmology 96, 5 (2012), 614--618.",
      "doi": ""
    },
    {
      "text": "Adam Perer and Ben Shneiderman. 2009. Integrating statistics and visualization for exploratory power: From long-term case studies to design guidelines. IEEE Computer Graphics and Applications 29, 3 (2009), 39--51.",
      "doi": "10.5555/1669295.1669302"
    },
    {
      "text": "Helen Petrie and N Bevan. 2009. The evaluation of accessibility, usability, and user experience. 20--1.",
      "doi": ""
    },
    {
      "text": "Andreas Reichinger, Helena Garcia Carrizosa, Joanna Wood, Svenja Schröder, Christian Löw, Laura Rosalia Luidolt, Maria Schimkowitsch, Anton Fuhrmann, Stefan Maierhofer, and Werner Purgathofer. 2018. Pictures in your mind: using interactive gesture-controlled reliefs to explore art. ACM Transactions on Accessible Computing (TACCESS) 11, 1 (2018), 2.",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez. 2003. Software Usability for Blind Children Questionnaire (SUBC). Usability evaluation test, University of Chile (2003).",
      "doi": ""
    },
    {
      "text": "Daisuke Sato, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. Navcog3: An evaluation of a smartphone-based blind indoor navigation assistant with semantic features in a large-scale environment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 270--279.",
      "doi": "10.1145/3132525.3132535"
    },
    {
      "text": "Jeff Sauro and Joseph S Dumas. 2009. Comparison of three one-question, post-task usability questionnaires. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1599--1608.",
      "doi": "10.1145/1518701.1518946"
    },
    {
      "text": "Victor R Schinazi, Tyler Thrash, and Daniel-Robert Chebat. 2016. Spatial navigation by congenitally blind individuals. WIREs Cognitive Science (2016).",
      "doi": ""
    },
    {
      "text": "Jean Scholtz. 2004. Usability evaluation. National Institute of Standards and Technology 1 (2004).",
      "doi": ""
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2014. Applying the user experience questionnaire (UEQ) in different evaluation scenarios. In International Conference of Design, User Experience, and Usability. Springer, 383--392.",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Vicki L. Hanson. 2012. Representing Users in Accessibility Research. ACM Trans. Access. Comput. 4, 2, Article 7 (March 2012), 6 pages. DOI: http://dx.doi.org/10.1145/2141943.2141945",
      "doi": "10.1145/2141943.2141945"
    },
    {
      "text": "Ben Shneiderman. 1986. Designing the User Interface: Strategies for Effective Human-computer Interaction. Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA.",
      "doi": "10.5555/3033040"
    },
    {
      "text": "Andrii Soviak, Anatoliy Borodin, Vikas Ashok, Yevgen Borodin, Yury Puzis, and I.V. Ramakrishnan. 2016. Tactile Accessibility: Does Anyone Need a Haptic Glove?. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 101--109. DOI: http://dx.doi.org/10.1145/2982142.2982175",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Emeline Brulé, Christopher Frauenberger, Gilles Bailly, and Geraldine Fitzpatrick. 2018. Micro-ethics for participatory design with marginalised children.",
      "doi": ""
    },
    {
      "text": "Katharina Spiel, Christopher Frauenberger, Eva Hornecker, and Geraldine Fitzpatrick. 2017. When empathy is not enough: Assessing the experiences of autistic children with technologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2853--2864.",
      "doi": "10.1145/3025453.3025785"
    },
    {
      "text": "Robert D Stevens and Alistair DN Edwards. 1996. An approach to the evaluation of assistive technology. In ACM SIGACCESS Conference on Assistive Technologies: Proceedings of the second annual ACM conference on Assistive technologies, Vol. 11. 64--71.",
      "doi": "10.1145/228347.228359"
    },
    {
      "text": "Saiganesh Swaminathan, Thijs Roumen, Robert Kovacs, David Stangl, Stefanie Mueller, and Patrick Baudisch. 2016. Linespace: A sensemaking platform for the blind. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2175--2185.",
      "doi": "10.1145/2858036.2858245"
    },
    {
      "text": "Joe Tekli, Youssef Bou Issa, and Richard Chbeir. 2018. Evaluating Touch-screen Vibration Modality for Blind Users to Access Simple Shapes and Graphics. Int. J. Hum.-Comput. Stud. 110, C (Feb. 2018), 115--133. DOI: http://dx.doi.org/10.1016/j.ijhcs.2017.10.009",
      "doi": "10.1016/j.ijhcs.2017.10.009"
    },
    {
      "text": "Brianna J Tomlinson, Jared Batterman, Yee Chieh Chew, Ashley Henry, and Bruce N Walker. 2016. Exploring auditory graphing software in the classroom: The effect of auditory graphs on the classroom environment. ACM Transactions on Accessible Computing (TACCESS) 9, 1 (2016), 3.",
      "doi": ""
    },
    {
      "text": "Shari Trewin, Diogo Marques, and Tiago Guerreiro. 2015. Usage of subjective scales in accessibility research. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 59--67.",
      "doi": "10.1145/2700648.2809867"
    },
    {
      "text": "Michel Vacher, Sybille Cafau, François Portet, Brigitte Meillon, Camille Roux, Elena Elias, Benjamin Lecouteux, and Pedro Chahuara. 2015. Evaluation of a context-aware voice interface for Ambient Assisted Living: qualitative user study vs. quantitative system evaluation. ACM Transactions on Accessible Computing (TACCESS) 7, 2 (2015), 5.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet swara: A community-moderated voice forum in rural india. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 417--426.",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Bruce N Walker, Jeffrey Lindsay, and Justin Godfrey. 2004. The audio abacus: representing numerical values with nonspeech sound for the visually impaired. In ACM SIGACCESS Accessibility and Computing. ACM, 9--15.",
      "doi": ""
    },
    {
      "text": "Ruolin Wang, Chun Yu, Xing-Dong Yang, Weijie He, and Yuanchun Shi. 2019. EarTouch: Facilitating Smartphone Use for Visually Impaired People in Mobile and Public Scenarios. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 24.",
      "doi": "10.1145/3290605.3300254"
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of personality and social psychology 54, 6 (1988), 1063.",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A. Brewster. 2016. Using Dynamic Audio Feedback to Support Peripersonal Reaching in Young Visually Impaired People. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 209--218. DOI: http://dx.doi.org/10.1145/2982142.2982160",
      "doi": ""
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3 (1998), 225--240.",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Jacob O. Wobbrock and Julie A. Kientz. 2016. Research Contributions in Human-computer Interaction. Interactions 23, 3 (April 2016), 38--44. DOI: http://dx.doi.org/10.1145/2907069",
      "doi": "10.1145/2907069"
    },
    {
      "text": "Tao Yang, Jared Linder, and Davide Bolchini. 2012. DEEP: design-oriented evaluation of perceived usability. International Journal of Human-Computer Interaction 28, 5 (2012), 308--346.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Glasses. In Proceedings of the 2017 CHI Conference on Azenkot. 2017. Understanding Low Vision People's Human Factors in Computing Systems. ACM, Visual Perception on Commercial Augmented Reality 4170--4181.",
      "doi": ""
    }
  ]
}