{
  "doi": "10.1145/3313831.3376182",
  "title": "\"On Finsta, I can say 'Hail Satan'\": Being Authentic but Disagreeable on Instagram",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We use personality theory to compare self-presentation between multiple Instagram accounts, investigating authenticity and consistency. Many studies claim social media promote inauthentic self-presentation focused on socially desirable traits. At the same time, affordances suggest that self-presentation should be relatively consistent within one social medium. For 88 participants, we examine personality traits for 'real Instagram' ('Rinsta') versus 'fake Instagram' ('Finsta') accounts, comparing these with people's offline traits using mixed-methods. Counterintuitively, we find Finsta accounts often present socially undesirable traits. Furthermore, different accounts on the same social medium reveal quite different styles of self-presentation. Overall Finstas are more Extraverted, less Conscientious, and less Agreeable than Rinstas, although equally Neurotic as offline. Interviews indicate trait differences arise from differing audience perceptions. A large anonymous Rinsta audience promotes a carefully curated self. In contrast, a small but trusted Finsta audience can engender more authentic, but negative self-presentation. We discuss design and theory implications.",
  "tags": [
    "personality",
    "instagram",
    "rinsta",
    "finsta",
    "traits",
    "social media",
    "affordances",
    "self-presentation",
    "self-perception"
  ],
  "authors": [
    {
      "name": "Lee Taber",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-99659260509/rel-imgonly/img_3093_-_copy.jpg",
      "acmid": "99659260509",
      "orcid": "missing"
    },
    {
      "name": "Steve Whittaker",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amichai-Hamburger, Y. and Vinitzky, G. 2010. Social network use and personality. Computers in Human Behavior. 26, 6 (2010), 1289--1295. DOI: https://doi.org/10.1016/j.chb.2010.03.018.",
      "doi": "10.1016/j.chb.2010.03.018"
    },
    {
      "text": "Andalibi, N., Ozturk, P. and Forte, A. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17 (Portland, Oregon, USA, 2017), 1485--1500.",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Ayass, R. and Gerhardt, C. eds. 2012. The appropriation of media in everyday life. John Benjamins Pub. Co.",
      "doi": ""
    },
    {
      "text": "Back, M.D., Stopfer, J.M., Vazire, S., Gaddis, S., Schmukle, S.C., Egloff, B. and Gosling, S.D. 2010. Facebook Profiles Reflect Actual Personality, Not Self-Idealization. Psychological Science. 21, 3 (2010), 372--374. DOI: https://doi.org/10.1177/0956797609360756.",
      "doi": ""
    },
    {
      "text": "Barkhi, R. 2002. Cognitive style may mitigate the impact of communication mode. Information & Management. 39, 8 (Sep. 2002), 677--688. DOI: https://doi.org/10.1016/S0378--7206(01)001148.",
      "doi": "10.1016/S0378-7206%2801%2900114-8"
    },
    {
      "text": "Bayer, J.B., Ellison, N.B., Schoenebeck, S.Y. and Falk, E.B. 2015. Sharing the small moments: ephemeral social interaction on Snapchat. Information, Communication & Society. 4462, January (2015), 1--22. DOI: https://doi.org/10.1080/1369118X.2015.108434 9.",
      "doi": ""
    },
    {
      "text": "Bernstein, M.S., Bakshy, E., Burke, M. and Karrer, B. 2013. Quantifying the invisible audience in social networks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3, (2013), 21-- 30. DOI: https://doi.org/10.1145/2470654.2470658.",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "boyd, danah 2010. Social Network Sites as Networked Publics: Affordances, Dynamics, and Implications. Networked Self: Identity, Community, and Culture on Social Network Sites. (2010), 39--58. DOI: https://doi.org/10.1162/dmal.9780262524834.11",
      "doi": ""
    },
    {
      "text": "[9] Boyd, D.M. and Ellison, N.B. 2007. Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication. 13, 1 (2007), 210--230. DOI: https://doi.org/10.1111/j.10836101.2007.00393.x.",
      "doi": "10.1111/j.1083-6101.2007.00393.x"
    },
    {
      "text": "Braun, V., Clarke, V., Hayfield, N. and Terry, G. 2018. Thematic Analysis. Handbook of Research Methods in Health Social Sciences. P. Liamputtong, ed. Springer Singapore. 1--18.",
      "doi": ""
    },
    {
      "text": "Burke, M. and Kraut, R. 2014. Growing closer on Facebook: Changes in tie strength through social network site use. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. (2014), 4187--4196. DOI: https://doi.org/10.1145/2556288.2557094.",
      "doi": "10.1145/2556288.2557094"
    },
    {
      "text": "Chou, H.-T.G. and Edge, N. 2012. \"They Are Happier and Having Better Lives than I Am\": The Impact of Using Facebook on Perceptions of Others' Lives. Cyberpsychology, Behavior, and Social Networking. 15, 2 (2012), 117--121. DOI: https://doi.org/10.1089/cyber.2011.0324.",
      "doi": ""
    },
    {
      "text": "Coles, B.A. and West, M. 2016. Trolling the trolls: Online forum users constructions of the nature and properties of trolling. Computers in Human Behavior. 60, (2016), 233--244. DOI: https://doi.org/10.1016/j.chb.2016.02.070.",
      "doi": ""
    },
    {
      "text": "Costa, P. and McCrae, R.R. 1995. Inventory Domains and Facets?: Hierarchical Personality Assessment Using the Revised NEO Personality Inventory. Journal of Personality Assessment. 64, 1 (1995), 21-- 50. DOI: https://doi.org/10.1207/s15327752jpa6401.",
      "doi": ""
    },
    {
      "text": "DeVito, M.A., Birnholtz, J. and Hancock, J.T. 2017. Platforms, people, and perception: Using affordances to understand self-presentation on social media. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. (2017), 740-- 754. DOI: https://doi.org/10.1145/2998181.2998192.",
      "doi": ""
    },
    {
      "text": "Digman, J.M. 1990. Personality Structure: Emergence of the Five-Factor Model. Annual Review of Psychology. 41, 1 (1990), 417--440. DOI: https://doi.org/10.1146/annurev.ps.41.020190.0 02221.",
      "doi": ""
    },
    {
      "text": "Dunlop, W.L. and Hanley, G.E. 2019. Contextualizing personality: Personality within and across social roles and conceptual levels. Journal of Personality. 87, 4 (2019), 903--914. DOI: https://doi.org/10.1111/jopy.12443.",
      "doi": ""
    },
    {
      "text": "Ellison, N., Heino, R. and Gibbs, J. 2006. Managing Impressions Online: Self-Presentation Processes in the Online Dating Environment. Journal of ComputerMediated Communication. 11, 2 (2006), 415--441. DOI: https://doi.org/10.1111/j.10836101.2006.00020.x.",
      "doi": ""
    },
    {
      "text": "Ellison, N.B., Hancock, J.T. and Toma, C.L. 2011. Profile as promise?: A framework for conceptualizing veracity in online dating self- presentations. (2011). DOI: https://doi.org/10.1177/1461444811410395.",
      "doi": ""
    },
    {
      "text": "Ellison, N.B., Steinfield, C. and Lampe, C. 2007. The benefits of facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication. 12, 4 (2007), 1143--1168. DOI: https://doi.org/10.1111/j.10836101.2007.00367.x.",
      "doi": ""
    },
    {
      "text": "Ellison, N.B. and Vitak, J. 2015. Social Network Site Affordances and Their Relationship to Social Capital Processes. The Handbook of the Psychology of Communication Technology. 203--227.",
      "doi": ""
    },
    {
      "text": "Feuston, J.L. and Piper, A.M. 2019. Everyday Experiences: Small Stories and Mental Illness on Instagram. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19 (Glasgow, Scotland Uk, 2019), 1--14.",
      "doi": ""
    },
    {
      "text": "Fiore, A.T. and Donath, J.S. 2004. Online personals: an overview. Extended abstracts of the 2004 conference on Human factors and computing systems - CHI '04 (Vienna, Austria, 2004), 1395.",
      "doi": ""
    },
    {
      "text": "Fox, J. and McEwan, B. 2017. Distinguishing technologies for social interaction: The perceived social affordances of communication channels scale. Communication Monographs. 84, 3 (Jul. 2017), 298-- 318. DOI: https://doi.org/10.1080/03637751.2017.1332418 .",
      "doi": ""
    },
    {
      "text": "Gibson, J.J. 1986. Gibson Theory of Affordances.pdf. Chapter Eight The Theory of Affordances. (1986), 127--136. DOI: https://doi.org/citeulike-articleid:3508530.",
      "doi": ""
    },
    {
      "text": "Goffman, E. 1982. The presentation of self in everyday life. The Presentation of Self in Everyday Life. (1982), 1--10.",
      "doi": ""
    },
    {
      "text": "Gosling, S.D. 2009. Snoop: What your stuff says about you. Basic Books.",
      "doi": ""
    },
    {
      "text": "Gosling, S.D., Augustine, A.A., Vazire, S., Holtzman, N. and Gaddis, S. 2011. Manifestations of Personality in Online Social Networks: Self-Reported FacebookRelated Behaviors and Observable Profile Information. Cyberpsychology, Behavior, and Social Networking. 14, 9 (2011), 483--488. DOI: https://doi.org/10.1089/cyber.2010.0087.",
      "doi": ""
    },
    {
      "text": "Gosling, S.D., Ko, S.J., Mannarelli, T. and Morris, M.E. 2002. A room with a cue: Personality judgments based on offices and bedrooms. Journal of Personality and Social Psychology. 82, 3 (2002), 379--398. DOI: https://doi.org/10.1037/0022--3514.82.3.379.",
      "doi": ""
    },
    {
      "text": "Grieve, R. and Watkinson, J. 2016. The Psychological Benefits of Being Authentic on Facebook. CyberPsychology, Behavior & Social Networking. 19, 7 (Jul. 2016), 420--425. DOI: https://doi.org/10.1089/cyber.2016.0010.",
      "doi": ""
    },
    {
      "text": "Halpern, D., Katz, J.E. and Carril, C. 2017. The online ideal persona vs. the jealousy effect: Two explanations of why selfies are associated with lower-quality romantic relationships. Telematics and Informatics. 34, 1 (2017), 114--123. DOI: https://doi.org/10.1016/j.tele.2016.04.014.",
      "doi": "10.1016/j.tele.2016.04.014"
    },
    {
      "text": "Hiltz, S.R. and Turoff, M. 1993. The Network Nation: Human Communication Via Computer. MIT Press.",
      "doi": ""
    },
    {
      "text": "Hirsh, J.B. and Peterson, J.B. 2009. Personality and language use in self-narratives. Journal of Research in Personality. 43, 3 (2009), 524--527. DOI: https://doi.org/10.1016/j.jrp.2009.01.006.",
      "doi": ""
    },
    {
      "text": "Hogan, B. 2010. The Presentation of Self in the Age of Social Media: Distinguishing Performances and Exhibitions Online. Bulletin of Science, Technology & Society. 30, 6 (2010), 377--386. DOI: https://doi.org/10.1177/0270467610385893.",
      "doi": ""
    },
    {
      "text": "Hughes, D.J., Rowe, M., Batey, M. and Lee, A. 2012. A tale of two sites: Twitter vs. Facebook and the personality predictors of social media usage. Computers in Human Behavior. 28, 2 (2012), 561-- 569. DOI: https://doi.org/10.1016/j.chb.2011.11.001.",
      "doi": "10.1016/j.chb.2011.11.001"
    },
    {
      "text": "Jackson, C.A. and Luchner, A.F. 2018. Selfpresentation mediates the relationship between Selfcriticism and emotional response to Instagram feedback. Personality and Individual Differences. 133, (Oct. 2018), 1--6. DOI: https://doi.org/10.1016/j.paid.2017.04.052.",
      "doi": ""
    },
    {
      "text": "Jennifer Charteris, Sue Gregory, Y.M. 2014. Snapchat 'selfies': The case of disappearing data. Critical perspectives on educational tehnology. 1995 (2014), 1--5. DOI: https://doi.org/10.1177/0959354305053217.RE ADS.",
      "doi": ""
    },
    {
      "text": "John, O.P., Naumann, L.P. and Soto, C.J. 2008. Paradigm shift to the integrative Big Five Trait taxonomy. Handbook of personality: Theory and research. (2008), 114--158. DOI: https://doi.org/10.1016/S0191--8869(97)810008.",
      "doi": ""
    },
    {
      "text": "Kang, J. and Wei, L. 2019. Let me be at my funniest: Instagram users' motivations for using Finsta (a.k.a., fake Instagram). The Social Science Journal. (Jan. 2019). DOI: https://doi.org/10.1016/j.soscij.2018.12.005.",
      "doi": ""
    },
    {
      "text": "Kim, J. and Lee, J.-E.R. 2010. The Facebook Paths to Happiness: Effects of the Number of Facebook Friends and Self-Presentation on Subjective WellBeing. Cyberpsychology, Behavior, and Social Networking. 14, 6 (Nov. 2010), 359--364. DOI: https://doi.org/10.1089/cyber.2010.0374.",
      "doi": ""
    },
    {
      "text": "Kosinski, M., Stillwell, D. and Graepel, T. 2013. Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences of the United States of America. 110, 15 (2013), 5802--5. DOI: https://doi.org/10.1073/pnas.1218772110.",
      "doi": ""
    },
    {
      "text": "Kosinski, M., Stillwell, D., Kohli, P., Bachrach, Y. and Graepel, T. 2012. Personality and Website Choice. WebSci. (2012), 0--3.",
      "doi": ""
    },
    {
      "text": "Litt, E. 2012. Knock, Knock. Who's There? The Imagined Audience. Journal of Broadcasting and Electronic Media. 56, 3 (2012), 330--345. DOI: https://doi.org/10.1080/08838151.2012.705195.",
      "doi": ""
    },
    {
      "text": "Litt, E., Spottswood, E., Birnholtz, J., Hancock, J.T., Smith, M.E. and Reynolds, L. 2014. Awkward Encounters of an \"Other\" Kind: Collective Selfpresentation and Face Threat on Facebook. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing. (2014), 449--460. DOI: https://doi.org/10.1145/2531602.2531646.",
      "doi": ""
    },
    {
      "text": "Ma, H., Smith, C.E., He, L., Narayanan, S., Giaquinto, R.A., Evans, R., Hanson, L. and Yarosh, S. 2017. Write for Life: Persisting in Online Health Communities through Expressive Writing and Social Support. Proceedings of the ACM on HumanComputer Interaction. 1, CSCW (Dec. 2017), 1--24. DOI: https://doi.org/10.1145/3134708.",
      "doi": ""
    },
    {
      "text": "Marwick, A.E. and boyd, danah 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society. 13, 1 (2011), 114--133. DOI: https://doi.org/10.1177/1461444810365313.",
      "doi": ""
    },
    {
      "text": "McAdams, D.P. 2013. The Psychological Self as Actor, Agent, and Author. Perspectives on Psychological Science. 8, 3 (May 2013), 272--295. DOI: https://doi.org/10.1177/1745691612464657.",
      "doi": ""
    },
    {
      "text": "McRoberts, S., Ma, H., Hall, A. and Yarosh, S. 2017. Share First, Save Later: Performance of Self through Snapchat Stories. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 6902--6911.",
      "doi": ""
    },
    {
      "text": "Mehdizadeh, S. Self-Presentation 2.0: Narcissism and Self-Esteem on Facebook. 8.",
      "doi": ""
    },
    {
      "text": "Michikyan, M., Dennis, J. and Subrahmanyam, K. 2015. Can You Guess Who I Am? Real, Ideal, and False Self-Presentation on Facebook Among Emerging Adults. Emerging Adulthood. 3, 1 (Feb. 2015), 55--64. DOI: https://doi.org/10.1177/2167696814532442.",
      "doi": ""
    },
    {
      "text": "Mischel, W. 1968. Personality and assessment. John Wiley.",
      "doi": ""
    },
    {
      "text": "Mischel, W. and Shoda, Y. 1995. A cognitiveaffective system theory of personality: Reconceptualizing situations, dispositions, dynamics, and invariance in personality structure. Psychological Review. 102, 2 (1995), 246--268. DOI: https://doi.org/10.1037/0033--295X.102.2.246.",
      "doi": ""
    },
    {
      "text": "Naumann, L.P., Vazire, S., Rentfrow, P.J. and Gosling, S.D. 2009. Personality Judgments Based on Physical Appearance. Personality and Social Psychology Bulletin. 35, 12 (2009), 1661--1671. DOI: https://doi.org/10.1177/0146167209346309.",
      "doi": ""
    },
    {
      "text": "Ngwenyama, O.K. and Lee, A.S. 1997. Communication Richness in Electronic Mail: Critical Social Theory and the Contextuality of Meaning. MIS Quarterly. 21, 2 (Jun. 1997), 145. DOI: https://doi.org/10.2307/249417.",
      "doi": ""
    },
    {
      "text": "Oliver P John and Sanjay Srivastava Big Five Trait Taxonomy.",
      "doi": ""
    },
    {
      "text": "Park, G., Andrew Schwartz, H., Eichstaedt, J.C., Kern, M.L., Kosinski, M., Stillwell, D.J., Ungar, L.H. and Seligman, M.E.P. 2015. Automatic personality assessment through social media language. Journal of Personality and Social Psychology. 108, 6 (2015). DOI: https://doi.org/10.1037/pspp0000020.",
      "doi": ""
    },
    {
      "text": "Park, G., Schwartz, H.A., Eichstaedt, J.C., Kern, M.L., Kosinski, M., Stillwell, D.J., Ungar, L.H. and Seligman, M.E.P. 2015. Automatic personality assessment through social media language. Journal of Personality and Social Psychology. 108, 6 (2015). DOI: https://doi.org/10.1037/pspp0000020.",
      "doi": ""
    },
    {
      "text": "Perrin, A. and Anderson, M. 2019. Share of U.S. adults using social media, including Facebook, is mostly unchanged since 2018. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Pew Research Center 2016. Social Media Update 2016.",
      "doi": ""
    },
    {
      "text": "Pitcan, M., Marwick, A.E. and boyd, danah 2018. Performing a Vanilla Self: Respectability Politics, Social Class, and the Digital World. Journal of Computer-Mediated Communication. 23, 3 (May 2018), 163--179. DOI: https://doi.org/10.1093/jcmc/zmy008.",
      "doi": ""
    },
    {
      "text": "Pittman, M. and Reich, B. 2016. Social media and loneliness: Why an Instagram picture may be worth more than a thousand Twitter words. Computers in Human Behavior. 62, (Sep. 2016), 155--167. DOI: https://doi.org/10.1016/j.chb.2016.03.084.",
      "doi": ""
    },
    {
      "text": "Piwek, L. and Joinson, A. 2016. \"What do they snapchat about?\" Patterns of use in time-limited instant messaging service. Computers in Human Behavior. 54, (2016), 358--367. DOI: https://doi.org/10.1016/j.chb.2015.08.026.",
      "doi": ""
    },
    {
      "text": "Reich, W.A., Sangiorgio, C. and Young, J. 2019. SelfRole Integration: A Person-Specific Predictor of Life Satisfaction and Prosocial Behavior. The Journal of Psychology. 153, 6 (Aug. 2019), 649--666. DOI: https://doi.org/10.1080/00223980.2019.1590297 .",
      "doi": ""
    },
    {
      "text": "Reinecke, L. and Trepte, S. 2014. Authenticity and well-being on social network sites: A two-wave longitudinal study on the effects of online authenticity and the positivity bias in SNS communication. Computers in Human Behavior. 30, (2014), 95--102. DOI: https://doi.org/10.1016/j.chb.2013.07.030.",
      "doi": ""
    },
    {
      "text": "Seidman, G. 2014. Expressing the \"true Self\" on Facebook. Computers in Human Behavior. 31, 1 (2014), 367--372. DOI: https://doi.org/10.1016/j.chb.2013.10.052.",
      "doi": "10.1016/j.chb.2013.10.052"
    },
    {
      "text": "Sherlock, M. and Wagstaff, D.L. 2018. Exploring the relationship between frequency of Instagram use, exposure to idealized images, and psychological wellbeing in women. Psychology of Popular Media Culture. (Apr. 2018). DOI: https://doi.org/10.1037/ppm0000182.",
      "doi": ""
    },
    {
      "text": "Soto, C.J. and John, O.P. 2016. The Next Big Five Inventory ( BFI-2 ): Developing and Assessing a Hierarchical Model With 15 Facets to Enhance Bandwidth ... The Next Big Five Inventory ( BFI-2 ): Developing and Assessing a Hierarchical Model With 15 Facets to Enhance Bandwidth , Fidelit. 113, June (2016), 117--143. DOI: https://doi.org/10.1037/pspp0000096.",
      "doi": ""
    },
    {
      "text": "Swann, W.B. and Read, S.J. 1981. Self-verification processes: How we sustain our self-conceptions. Journal of Experimental Social Psychology. 17, 4 (Jul. 1981), 351--372. DOI: https://doi.org/10.1016/00221031(81)90043--3.",
      "doi": ""
    },
    {
      "text": "Taber, L. and Whittaker, S. 2018. Personality Depends on The Medium: Differences in Self-Perception on Snapchat, Facebook and Offline. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (Montreal QC, Canada, 2018), 1--13.",
      "doi": ""
    },
    {
      "text": "Toma, C.L. 2010. Affirming the Self through Online Profiles?: Beneficial Effects of Social Networking Sites. Network. 62, 2 (2010), 1749--1752. DOI: https://doi.org/10.1145/1753326.1753588.",
      "doi": ""
    },
    {
      "text": "Treem, J.W. and Leonardi, P.M. 2012. Social Media use in organizations. Communication Yearbook. (2012), 143--189. DOI: https://doi.org/10.2139/ssrn.2129853.",
      "doi": ""
    },
    {
      "text": "Uski, S. and Lampinen, A. 2016. Social norms and self-presentation on social network sites: Profile work in action. New Media & Society. 18, 3 (Mar. 2016), 447--464. DOI: https://doi.org/10.1177/1461444814543164.",
      "doi": ""
    },
    {
      "text": "Utz, S., Tanis, M. and Vermeulen, I. 2012. It Is All About Being Popular: The Effects of Need for Popularity on Social Network Site Use. Cyberpsychology, Behavior, and Social Networking. 15, 1 (2012), 37--42. DOI: https://doi.org/10.1089/cyber.2010.0651.",
      "doi": ""
    },
    {
      "text": "Van Gelder, L. 1996. The Strange Case of the Electronic Lover. Computerization and Controversy. Elsevier. 533--546.",
      "doi": ""
    },
    {
      "text": "Vaterlaus, J.M., Barnett, K., Roche, C. and Young, J.A. 2016. \"Snapchat is more personal\": An exploratory study on Snapchat behaviors and young adult interpersonal relationships. Computers in Human Behavior. 62, (2016), 594--601. DOI: https://doi.org/10.1016/j.chb.2016.04.029.",
      "doi": ""
    },
    {
      "text": "Vazire, S. 2010. Who knows what about a person? The self--other knowledge asymmetry (SOKA) model. Journal of Personality and Social Psychology. 98, 2 (Feb. 2010), 281--300. DOI: https://doi.org/10.1037/a0017908.",
      "doi": ""
    },
    {
      "text": "Vries, D.A. de, Möller, A.M., Wieringa, M.S., Eigenraam, A.W. and Hamelink, K. 2018. Social Comparison as the Thief of Joy: Emotional Consequences of Viewing Strangers' Instagram Posts. Media Psychology. 21, 2 (Apr. 2018), 222--245. DOI: https://doi.org/10.1080/15213269.2016.1267647 .",
      "doi": ""
    },
    {
      "text": "Wang, Y., Hinsberger, H. and Kraut, R.E. 2016. Does Saying This Make Me Look Good? How Posters and Outsiders Evaluate Facebook Updates. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 125--129.",
      "doi": ""
    },
    {
      "text": "Wang, Y.-C., Kraut, R. and Levine, J.M. 2012. To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW '12 (Seattle, Washington, USA, 2012), 833.",
      "doi": ""
    },
    {
      "text": "Waterloo, S.F., Baumgartner, S.E., Peter, J. and Valkenburg, P.M. 2018. Norms of online expressions of emotion: Comparing Facebook, Twitter, Instagram, and WhatsApp. New Media & Society. 20, 5 (May 2018), 1813--1831. DOI: https://doi.org/10.1177/1461444817707349.",
      "doi": ""
    },
    {
      "text": "Yau, J.C. and Reich, S.M. 2019. \"It's Just a Lot of Work\": Adolescents' Self-Presentation Norms and Practices on Facebook and Instagram. Journal of Research on Adolescence. 29, 1 (2019), 196--209. DOI: https://doi.org/10.1111/jora.12376.",
      "doi": ""
    }
  ]
}