{
  "doi": "10.1145/3313831.3376134",
  "title": "Phasking on Paper: Accessing a Continuum of PHysically Assisted SKetchING",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "When sketching, we must choose between paper (expressive ease, ruler and eraser) and computational assistance (parametric support, a digital record). PHysically Assisted SKetching provides both, with a pen that displays force constraints with which the sketcher interacts as they draw on paper. Phasking provides passive, \"bound\" constraints (like a ruler); or actively \"brings\" the sketcher along a commanded path (e.g., a curve), which they can violate for creative variation. The sketcher modulates constraint strength (control sharing) by bearing down on the pen-tip. Phasking requires untethered, graded force-feedback, achieved by modifying a ballpoint drive that generates force through rolling surface contact. To understand phasking's viability, we implemented its interaction concepts, related them to sketching tasks and measured device performance. We assessed the experience of 10 sketchers, who could understand, use and delight in phasking, and who valued its control-sharing and digital twinning for productivity, creative control and learning to draw.",
  "authors": [
    {
      "name": "Soheil Kianzad",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529707",
      "orcid": "missing"
    },
    {
      "name": "Yuxiang Huang",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527957",
      "orcid": "missing"
    },
    {
      "name": "Robert Xiao",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81548910156/rel-imgonly/img_6433x_cropped_large.jpeg",
      "acmid": "81548910156",
      "orcid": "0000-0003-4306-8825"
    },
    {
      "name": "Karon E. MacLean",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    }
  ],
  "references": [
    {
      "text": "David A. Abbink, Mark Mulder, and Erwin R. Boer. 2012. Haptic shared control: smoothly shifting control authority. Cognition, Technology Work 14, 1 (2012), 19--28. http://dx.doi.org/10.1007/s10111-011-0192--5",
      "doi": "10.1007/s10111-011-0192-5"
    },
    {
      "text": "Carlo A. Avizzano, Massimo Satler, Giovanni Cappiello, Andrea Scoglio, Emanuele Ruffaldi, and Massimo Bergamasco. 2011. MOTORE: A mobile haptic interface for neuro-rehabilitation. In 2011 RO-MAN. IEEE, 383--388.",
      "doi": ""
    },
    {
      "text": "B. Bayart, A. Pocheville, and A. Kheddar. 2005. An adaptive haptic guidance software module for I-TOUCH: example through a handwriting teaching simulation and a 3D maze. In IEEE International Workshop on Haptic Audio Visual Environments and their Applications. 6 pp.--. DOI: http://dx.doi.org/10.1109/HAVE.2005.1545651",
      "doi": ""
    },
    {
      "text": "BOSCH. 2015. Absolute orientation sensor. (2015). https://www.bosch-sensortec.com/bst/products/all_ products/bno055",
      "doi": ""
    },
    {
      "text": "J.E. Colgate, W. Wannasuphoprasit, and M.A. Peshkin. 1996. Cobots: Robots for Collaboration with Human Operators. In the 5th Ann. Symp. on Haptic Interfaces for Virtual Environment and Teleoperator Systems, ASME/IMECE, Vol. DSC:58. Atlanta, GA, 443--439.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson and Katherine J Kuchenbecker. 2017. Ungrounded Haptic Augmented Reality System for Displaying Roughness and Friction. IEEE/ASME Transactions on Mechatronics 22, 4 (2017), 1839--1849. https://ieeexplore.ieee.org/abstract/document/7917356",
      "doi": ""
    },
    {
      "text": "Daniel Dixon, Manoj Prasad, and Tracy Hammond. 2010. iCanDraw: Using Sketch Recognition and Corrective Feedback to Assist a User in Drawing Human Faces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Atlanta, Georgia, USA New York, NY, USA, 897--906.",
      "doi": "10.1145/1753326.1753459"
    },
    {
      "text": "Mohamad A. Eid, Mohamed Mansour, Abdulmotaleb H. El Saddik, and Rosa Iglesias. 2007. A Haptic Multimedia Handwriting Learning System. In Proceedings of the International Workshop on Educational Multimedia and Multimedia Education (Emme '07). ACM, NY, NY, USA, 103--108. DOI: http://dx.doi.org/10.1145/1290144.1290161",
      "doi": "10.1145/1290144.1290161"
    },
    {
      "text": "Pololu Rootics & Electronics. 2019. Micro Metal Gearmotors. (2019). https://www.pololu.com/category/60/micro-metal-gearmotors",
      "doi": ""
    },
    {
      "text": "Piyum Fernando, Roshan Lalintha Peiris, and Suranga Nanayakkara. 2014. I-Draw: Towards a Freehand Drawing Assistant. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures the Future of Design - OzCHI'14. ACM Press, New York, New York, USA, 208--211.",
      "doi": "10.1145/2686612.2686644"
    },
    {
      "text": "Ben Forsyth and Karon E. MacLean. 2006. Predictive Haptic Guidance: Intelligent User Assistance for the Control of Dynamic Tasks. IEEE Trans on Visualization and Computer Graphics 12, 1 (2006), 103--113. http:// www.computer.org/csdl/trans/tg/2006/01/v0103-abs.html",
      "doi": "10.1109/TVCG.2006.11"
    },
    {
      "text": "Paul Griffiths and R. Brent Gillespie. 2004. Shared Control between Human and Machine: Haptic Display of Automation during Manual Control of Vehicle Heading. In the 12th International Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (HAPTICS'04). 358--366.",
      "doi": ""
    },
    {
      "text": "Anoto Inc. 2017. Anoto Digital Pen. (2017). http://www.anoto.com/",
      "doi": ""
    },
    {
      "text": "Neo Smartpen Inc. 2018. Neo smartpen M1. (2018). https://www.neosmartpen.com",
      "doi": ""
    },
    {
      "text": "Oliver Beren Kaul, Max Pfeiffer, and Michael Rohs. 2016. Follow the Force: Steering the Index Finger Towards Targets Using EMS. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 2526--2532. DOI: http://dx.doi.org/10.1145/2851581.2892352",
      "doi": "10.1145/2851581.2892352"
    },
    {
      "text": "Soheil Kianzad and Karon E MacLean. 2018. Harold's purple crayon rendered in haptics: Large-stroke, handheld ballpoint force feedback. In 2018 IEEE Haptics Symposium (HAPTICS). 106--111. DOI: http://dx.doi.org/10.1109/HAPTICS.2018.8357161",
      "doi": ""
    },
    {
      "text": "Yong Jae Lee, C. Lawrence Zitnick, and Michael F. Cohen. 2011. ShadowDraw: Real-time User Guidance for Freehand Drawing. ACM Trans. Graph. 30, 4 (2011), 27:1--27:10.",
      "doi": "10.1145/2010324.1964922"
    },
    {
      "text": "Golan Levin. 2000. Painterly Interfaces for Audiovisual Performance. Ph.D. Dissertation. Massachusetts Institute of Technology, Cambridge.",
      "doi": ""
    },
    {
      "text": "Y. Li, J. C. Huegel, V. Patoglu, and M. K. O'Malley. 2009. Progressive shared control for training in virtual environments. In 3rd Worldhaptics Conference (WHC '09). IEEE Press, Salt Lake City, UT, 332--337.",
      "doi": "10.1109/WHC.2009.4810873"
    },
    {
      "text": "Riverbank Computing Limited. 2019. PyQT. (2019). https://riverbankcomputing.com/software/pyqt/intro",
      "doi": ""
    },
    {
      "text": "Long-Fei Lin, Shan-Yuan Teng, Rong-Hao Liang, and Bing-Yu Chen. 2016. Stylus Assistant: Designing Dynamic Constraints for Facilitating Stylus Inputs on Portable Displays. In SIGGRAPH ASIA 2016 Emerging Technologies (SA '16). ACM, NY, NY, USA, Article 14, 2 pages. DOI: http://dx.doi.org/10.1145/2988240.2988255",
      "doi": "10.1145/2988240.2988255"
    },
    {
      "text": "Pedro Lopes, Doaa Yuksel, Francois Guimbretiere, and Patrick Baudisch. 2016. Muscle-plotter: an Interactive System based on Electrical Muscle Stimulation that Produces Spatial Output. In 29th Annual Symposium on User Interface Software and Technology. ACM Press, New York, New York, USA, 207--217.",
      "doi": "10.1145/2984511.2984530"
    },
    {
      "text": "Pam A. Mueller and Daniel M. Oppenheimer. 2014. The Pen Is Mightier Than the Keyboard: Advantages of Longhand Over Laptop Note Taking. Psychological Science 25, 6 (2014), 1159--1168. https://doi.org/10.1177/0956797614524581",
      "doi": ""
    },
    {
      "text": "J. Mullins, C. Mawson, and S. Nahavandi. 2005. Haptic handwriting aid for training and rehabilitation. In 2005 IEEE International Conference on Systems, Man and Cybernetics, Vol. 3. 2690--2694 Vol. 3. DOI: http://dx.doi.org/10.1109/ICSMC.2005.1571556",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki and Yasuaki Kakehi. 2014. Comp*Pass: A Compass-based Drawing Interface. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 447--450. DOI: http://dx.doi.org/10.1145/2559206.2574766",
      "doi": "10.1145/2559206.2574766"
    },
    {
      "text": "Akira Nomoto, Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2016. Supporting Precise Manual-handling Task Using Visuo-haptic Interaction. In Proceedings of the 7th Augmented Human International Conference 2016 (AH '16). ACM, NY, NY, USA, Article 10, 8 pages. DOI: http://dx.doi.org/10.1145/2875194.2875216",
      "doi": "10.1145/2875194.2875216"
    },
    {
      "text": "Ayberk Özgür, Wafa Johal, Francesco Mondada, and Pierre Dillenbourg. 2017. Haptic-Enabled Handheld Mobile Robots: Design and Analysis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2449--2461. DOI: http://dx.doi.org/10.1145/3025453.3025994",
      "doi": "10.1145/3025453.3025994"
    },
    {
      "text": "S. Papert. 1980. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, New York.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Mark Price and Frank C. Sup. 2016. A robotic touchscreen totem for two-dimensional haptic force display. In 2016 IEEE Haptics Symposium (HAPTICS). IEEE, 72--77.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Robert Berg, Rick Borovoy, Vanessa Colella, Kwin Kramer, and Brian Silverman. 1998. Digital Manipulatives: New Toys to Think with. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press/Addison-Wesley Publishing Co., Los Angeles, California, USA New York, NY, USA, 281--287.",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Hasti Seifi, Gunhyuk Park, Farimah Fazlollahi, John Sastrillo, Jessica Ip, Ashutosh Agrawal, Katherine Kuchenbecher, and Karon E. MacLean. 2019. Haptipedia: Accelerating Haptic Device Discovery to Support Interaction Engineering Design. In Conference on Human Factors in Computing Systems (CHI'19). ACM, Glasgow, UK, 12 pgs.",
      "doi": ""
    },
    {
      "text": "Yu shan Chang, Mavis Yi-Ching Chen, Meng-Jung Chuang, and Chia hui Chou. 2019. Improving creative self-efficacy and performance through computer-aided design application. Thinking Skills and Creativity 31 (2019), 103 -- 111. DOI: http://dx.doi.org/https://doi.org/10.1016/j.tsc.2018.11.007",
      "doi": ""
    },
    {
      "text": "Scott Snibbe, Sean Anderson, and Bill Verplank. 1998. Springs and Constraints for 3D Drawing. In Third Phantom User's Group, Vol. M.I.T. Artificial Intelligence Laboratory Technical Report AITR-1643. 1--4.",
      "doi": ""
    },
    {
      "text": "Hyunyoung Song, Tovi Grossman, George Fitzmaurice, François Guimbretiere, Azam Khan, Ramtin Attar, and Gordon Kurtenbach. 2009. PenLight: Combining a Mobile Projector and a Digital Pen for Dynamic Visual Overlay. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 143--152. DOI: http://dx.doi.org/10.1145/1518701.1518726",
      "doi": "10.1145/1518701.1518726"
    },
    {
      "text": "Jürgen Steimle. 2009. Designing pen-and-paper user interfaces for interaction with documents. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction - TEI '09. ACM Press, New York, New York, USA, 197--204.",
      "doi": "10.1145/1517664.1517707"
    },
    {
      "text": "A Teranishi, G Korres, W Park, and M Eid. 2018. Combining Full and Partial Haptic Guidance Improves Handwriting Skills Development. IEEE Transactions on Haptics 11, 4 (2018), 509--517. https://ieeexplore.ieee.org/abstract/document/8400473",
      "doi": "10.1109/TOH.2018.2851511"
    },
    {
      "text": "P. Vandoren, T. Van Laerhoven, L. Claesen, J. Taelman, C. Raymaekers, and F. Van Reeth. 2008. IntuPaint: Bridging the gap between physical and digital painting. In 2008 3rd IEEE International Workshop on Horizontal Interactive Human Computer Systems. 65--72. DOI: http://dx.doi.org/10.1109/TABLETOP.2008.4660185",
      "doi": ""
    },
    {
      "text": "Junichi Yamaoka and Yasuaki Kakehi. 2013. dePENd: Augmented Handwriting System Using Ferromagnetism of a Ballpoint Pen. In 26th Annual ACM Symposium on User Interface Software and Technology. ACM, St. Andrews, Scotland, United Kingdom New York, NY, USA, 203--210.",
      "doi": ""
    },
    {
      "text": "Raphael F Zory, Delphine Boërio, Marc Jubeau, and Nicola A Maffiuletti. 2005. Central and peripheral fatigue of the knee extensor muscles induced by electromyostimulation. International journal of sports medicine 26 10 (2005), 847--53.",
      "doi": ""
    }
  ]
}