{
  "doi": "10.1145/3313831.3376500",
  "title": "GridAlert: Using a Sensor-Based Technology to Monitor Power Blackouts in Kenyan Homes",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Power blackouts (outages) are a common occurrence in Kenyan households. They affect people's livelihoods, and damage their property (household electrical items). We explore the role of GridAlert-a sensor-based technology we designed-in monitoring power blackouts. We worked with local technicians to design GridAlert's housing and integrate GridAlert with Kenya's electricity infrastructure. Then, we used interview, observation, diary, and data logging methods to understand 18 households' experiences using the system. Our findings provide insights for using sensor-based technology to monitor power usage and blackouts in Kenyan households. We also present participants' thoughts about GridAlert's housing, and about how it influenced their actions when using the system. We use these findings to discuss design insights for power monitoring systems, and to offer new perspectives on the role of technology in monitoring blackouts in Kenyan households.",
  "tags": [
    "sensors",
    "kenya",
    "domestic technology",
    "hardware",
    "blackouts",
    "monitoring",
    "electricity"
  ],
  "authors": [
    {
      "name": "George Hope Chidziwisano",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261869",
      "orcid": "missing"
    },
    {
      "name": "Susan Wyche",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/do/10.1145/contrib-81314492849/rel-imgonly/wyche__susan-2021-1-2.jpg.headshot.small.jpg",
      "acmid": "81314492849",
      "orcid": "missing"
    },
    {
      "name": "Erick Oduor",
      "institution": "IBM Research Africa, Nairobi, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548358456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Syed Ishtiaque Ahmed, Nusrat Jahan Mim, and Steven J. Jackson. 2015. Residual Mobilities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15: 437--446. https://doi.org/10.1145/2702123.2702573",
      "doi": ""
    },
    {
      "text": "Konstantin Bauman, Alexander Tuzhilin, and Ryan Zaczynski. 2017. Using Social Sensors for Detecting Power Outages in the Electrical Utility Industry. ACM Trans. Manage. Inf. Syst. 8, 2: 1--15. https://doi.org/10.1145/3052931",
      "doi": "10.1145/3052931"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2: 149--173. https://doi.org/10.1145/1067860.1067862",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Patrick Biernacki and Dan Waldorf. 1981. Snowball sampling: Problems and techniques of chain referral sampling. Sociological methods & research 10, 2: 141--163. https://doi.org/10.1177/004912418101000205",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Andrew Monk, and Jisoo Park. 2002. Technology biographies: Field study techniques for home use product development. Conference on Human Factors in Computing Systems - Proceedings: 658--659. https://doi.org/10.1.1.130.279",
      "doi": ""
    },
    {
      "text": "Joseph Breda and Jay Taneja. 2018. Fancy That: Measuring Electricity Grid Voltage Using a Phone and a Fan. In Proceedings ofACMCOMPASSconference (COMPASS'18). https://doi.org/10.1145/3209811.3209864",
      "doi": "10.1145/3209811.3209864"
    },
    {
      "text": "Marshini Chetty, Hyojoon Kim, Srikanth Sundaresan, Sam Burnett, Nick Feamster, and W Keith Edwards. 2015. uCap: An Internet Data Management Tool For The Home. Proceedings of the ACM CHI'15 Conference on Human Factors in Computing Systems 1: 3093--3102. https://doi.org/10.1145/2702123.2702218",
      "doi": "10.1145/2702123.2702218"
    },
    {
      "text": "George Hope Chidziwisano and Susan. Wyche. 2018. M-Kulinda: Using a sensor-based technology probe to explore domestic security in rural Kenya. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3173574.3173584",
      "doi": "10.1145/3173574.3173584"
    },
    {
      "text": "Santiago Correa, Noah Klugman, and Jay Taneja. 2018. Deployment Strategies for Crowdsourced Power Outage Detection. 2018 IEEE International Conference on Communications, Control, and Computing Technologies for Smart Grids, SmartGridComm 2018: 1--6. https://doi.org/10.1109/SmartGridComm.2018.8587566",
      "doi": ""
    },
    {
      "text": "Santiago Correa, Noah Klugman, and Jay Taneja. 2018. How Many Smartphones Does It Take To Detect A Power Outage? Proceedings of the Ninth International Conference on Future Energy Systems. ACM, 2018.: 75--79. https://doi.org/10.1145/3208903.3208942",
      "doi": "10.1145/3208903.3208942"
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The ins and outs of HCI for development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2220--2232. https://doi.org/10.1145/2858036.2858081",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Tawanna Dillahunt, Jennifer Mankoff, and Eric Paulos. 2010. Understanding conflict between landlords and tenants: Implications for energy sensing and feedback. UbiComp'10 - Proceedings of the 2010 ACM Conference on Ubiquitous Computing: 149--158. https://doi.org/10.1145/1864349.1864376",
      "doi": ""
    },
    {
      "text": "Tawanna Dillahunt, Jennifer Mankoff, Eric Paulos, and Susan Fussell. 2009. It ' s Not All About \" Green \": Energy Use in Low-Income Communities. Proceedings of the 11th international conference on Ubiquitous computing. https://doi.org/10.1145/1620545.1620583",
      "doi": "10.1145/1620545.1620583"
    },
    {
      "text": "Anton Eberhard, Vivien Foster, Cecilia Briceño-Garmendia, Fatimata Ouedraogo, Daniel Camos, and Maria Shkaratan. 2008. Underpowered?: The State of the Power Sector in Sub-Saharan Africa. Background Paper 6, Africa Infrastructure Country Diagnostic, May: 54. Retrieved from https://openknowledge.worldbank.org/bitstream/handle/10986/7833/482140ESW0P11110Power0Sector0Review.pdf'sequence=1",
      "doi": ""
    },
    {
      "text": "Carolynne Hultquist, Mark Simpson, Guido Cervone, and Qunying Huang. 2015. Using nightlight remote sensing imagery and twitter data to study power outages. In Proceedings of the 1st ACM SIGSPATIAL International Workshop on the Use of GIS in Emergency Management, 6. https://doi.org/10.1145/2835596.2835601",
      "doi": "10.1145/2835596.2835601"
    },
    {
      "text": "Steven J Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair Worlds?: Maintenance , Repair , and I C T for Development in Rural Namibia. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work: 1--10. https://doi.org/10.1145/2145204.2145224",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Nelly Juma and Joseph Otieno. 2017. Linkages between Rural Poverty and Land Use in Nyando and Muhoroni Sub Counties Kenya. Journal of Economics and Sustainable Development 8, 10: 141--147.",
      "doi": ""
    },
    {
      "text": "M. Kemibaro. 2016. Kenya's Latest 2016 Mobile & Internet Statistics. Retrieved May 8, 2018 from http://www.moseskemibaro.com/2016/10/01/kenyas-latest-2016-mobile-internet-statistics/",
      "doi": ""
    },
    {
      "text": "Kenya Association of Bankers. 2015. Home Ownership Survey.",
      "doi": ""
    },
    {
      "text": "Jesper Kjeldskov, Mikael B. Skov, Jeni Paay, and Rahuvaran Pathmanathan. 2012. Using mobile phones to support sustainability: A field study of residential electricity consumption. Conference on Human Factors in Computing Systems - Proceedings: 2347--2356. https://doi.org/10.1145/2207676.2208395",
      "doi": "10.1145/2207676.2208395"
    },
    {
      "text": "Noah Klugman, Joshua Adkins, Susanna Berkouwer, Ivan Bobashev, Pat Pannuto, Matthew Podolsky, Aldo Suseno, and Jay Taneja. 2019. Hardware , Apps , and Surveys at Scale?: Insights from Measuring Grid Reliability in Accra , Ghana. Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies, COMPASS 2019.: 134--144. https://doi.org/https://doi.org/10.1145/3314344.3332482",
      "doi": "10.1145/3314344.3332482"
    },
    {
      "text": "Noah Klugman, Javier Rosa, Pat Pannuto, Matthew Podolsky, William Huang, Prabal Dutta, and Ann Arbor. Grid Watch?: Mapping Blackouts with Smart Phones Categories and Subject Descriptors. Proceedings of the 15th Workshop on Mobile Computing Systems and Applications. ACM, 2014. https://doi.org/http://dx.doi.org/10.1145/2565585.2565607",
      "doi": "10.1145/2565585.2565607"
    },
    {
      "text": "Kenya National Bureau of Statistics (KNBS). 2018. Kenya Integrated Household Budget Survey (KIHBS) 2015/16.",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Brent Schlotfeldt, and Marshini Chetty. 2015. A mixed-methods study of mobile users' data usage practices in South Africa. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 1209--1220. https://doi.org/10.1145/2750858.2804292",
      "doi": "10.1145/2750858.2804292"
    },
    {
      "text": "Steve Matthewman and Hugh Byrd. 2014. Blackouts: a sociology of electrical power failure. Social Space: 1--25.",
      "doi": ""
    },
    {
      "text": "William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. 1053. https://doi.org/10.1145/1518701.1518862",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Peninah Waweru, Jonathan Lenchner, and Carman Neustaedter. 2018. Practices and Technology Needs of a Network of Farmers in Tharaka Nithi, Kenya. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, April: 1--11. https://doi.org/10.1145/3173574.3173613",
      "doi": "10.1145/3173574.3173613"
    },
    {
      "text": "Shwetak N. Patel, Sidhant Gupta, and Matthew S. Reynolds. 2010. The design and evaluation of an end-user-deployable, whole house, contactless power consumption sensor. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10: 2471. https://doi.org/10.1145/1753326.1753700",
      "doi": ""
    },
    {
      "text": "James Pierce, Diane J. Schiano, and Eric Paulos. 2010. Home, habits, and energy: Examining domestic interactions and energy consumption. Conference on Human Factors in Computing Systems - Proceedings 3, December 2013: 1985--1994. https://doi.org/10.1145/1753326.1753627",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Basina Deepak Raj, Satish Kumar, Sambit Padhi, Arnab Sarkar, Arijit Mondal, and Krithi Ramamritham. 2018. Brownout Based Blackout Avoidance Strategies in Smart Grids. n Proceedings of the Ninth International Conference on Future Energy Systems: 456--458. https://doi.org/10.1145/3208903.3212059",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Paul Lee, Greg Hecht, Paul M Aoki, Jenny Chen, Michael Youssefmir, Maria-ines Carrera, David Cohn, Pete Kruskall, Everett Wetchler, and Astrid Twenebowa Larssen. 2015. SmartBrowse?: Design and Evaluation of a Price. Information Technologies & International Development 11, 1: 21--40.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard Anderson Samia Ibtasam, Lubna Razaq, HaiderW. Anwar, Hamid Mehmood, Kushal Shah, Jennifer Webster. 2018. Knowledge , Access , and Decision-Making?: Women ' s Financial Inclusion In Pakistan. In COMPASS '18. https://doi.org/10.1145/3209811.3209819",
      "doi": ""
    },
    {
      "text": "Jay Taneja. 2016. Measuring Electricity Reliability in Kenya. 6. Retrieved from http://blogs.umass.edu/jtaneja/files/2017/05/outages.pdf",
      "doi": ""
    },
    {
      "text": "The World Bank. 2016. Doing Business 2016: Measuring Regulatory Quality and Efficiency. https://doi.org/10.1596/978--1--4648-0667--4",
      "doi": ""
    },
    {
      "text": "US EIA. 2018. Today Energy. US Energy Information Administration Independent Analysis and Statistics. Retrieved August 8, 2019 from https://www.eia.gov/todayinenergy/detail.php?id=35652",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making design probes work. Conference on Human Factors in Computing Systems - Proceedings: 3441--3450. https://doi.org/10.1145/2470654.2466473",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Galen Weld, Trevor Perrier, Jenny Aker, Joshua E. Blumenstock, Brian Dillon, Adalbertus Kamanzi, Editha Kokushubira, Jennifer Webster, and Richard J. Anderson. 2018. eKichabi: Information Access through Basic Mobile Phones in Rural Tanzania. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 2018-April: 1--12. https://doi.org/10.1145/3173574.3173707",
      "doi": ""
    },
    {
      "text": "V Wiseman, L Conteh, and F Matovu. 2005. Using diaries to collect data in resource-poor settings: questions on design and implementation. Health Policy and Planning 20, 6: 394--404.",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Hope Chidziwisano, and Florence Uwimbabazi. 2018. Defamiliarizing the Domestic?: Exploring \" M-Kopa Solar \" and Sustainable Practices in Rural Kenyan Households. https://doi.org/10.1145/3209811.3211888",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Tawanna R Dillahunt, Nightingale Simiyu, and Sharon Alaka. 2015. \"If God gives me the chance I will design my own phone\": Exploring Mobile Phone Repair and Postcolonial Approaches to Design in Rural Kenya. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 463--473. https://doi.org/10.1145/2750858.2804249",
      "doi": "10.1145/2750858.2804249"
    },
    {
      "text": "Susan Wyche, Nightingale Simiyu, and Martha E. Othieno. 2016. Mobile Phones as Amplifiers of Social Inequality among Rural Kenyan Women. ACM Transactions on Computer-Human Interaction 23, 3: 1--19. https://doi.org/10.1145/2911982",
      "doi": "10.1145/2911982"
    },
    {
      "text": "Susan Wyche and Charles Steinfield. 2015. Why Don't Farmers Use Cell Phones to Access Market Prices? Technology Affordances and Barriers to Market Information Services Adoption in Rural Kenya. Information Technology for Development 1102, July 2015: 1--14. https://doi.org/10.1080/02681102.2015.1048184",
      "doi": ""
    }
  ]
}