{
  "doi": "10.1145/3313831.3376779",
  "title": "ThreadSense: Locating Touch on an Extremely Thin Interactive Thread",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We propose a new sensing technique for one-dimensional touch input workable on an interactive thread of less than 0.4 mm thick. Our technique locates up to two touches using impedance sensing with a spacing resolution unachievable by the existing methods. Our approach is also unique in that it locates a touch based on a mathematical model describing the change in thread impedance in relation to the touch locations. This allows the system to be easily calibrated by the user touching a known location(s) on the thread. The system can thus quickly adapt to various environmental settings and users. A system evaluation showed that our system could track the slide motion of a finger with an average error distance of 6.13 mm and 4.16 mm using one and five touches for calibration, respectively. The system could also distinguish between single touch and two concurrent touches with an accuracy of 99% and could track two concurrent touches with an average error distance of 8.55 mm. We demonstrate new interactions enabled by our sensing approach in several unique applications.",
  "tags": [
    "impedance sensing",
    "fabric",
    "touch input",
    "thread"
  ],
  "authors": [
    {
      "name": "Pin-Sung Ku",
      "institution": "Dartmouth College & National Taiwan University, Hanover; Taipei, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161133",
      "orcid": "missing"
    },
    {
      "name": "Qijia Shao",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659358493",
      "orcid": "missing"
    },
    {
      "name": "Te-Yen Wu",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658755390",
      "orcid": "missing"
    },
    {
      "name": "Jun Gong",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081291",
      "orcid": "missing"
    },
    {
      "name": "Ziyan Zhu",
      "institution": "Dartmouth College & University of Science and Technology of China, Hanover; Hefei, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526738",
      "orcid": "missing"
    },
    {
      "name": "Xia Zhou",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/do/10.1145/contrib-89758922657/rel-imgonly/img_20160221_103126.jpg",
      "acmid": "89758922657",
      "orcid": "missing"
    },
    {
      "name": "Xing-Dong Yang",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481651",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Carles Aliau-Bonet and Ramon Pallas-Areny. 2014. Effects of stray capacitance to ground in bipolar material impedance measurements based on directcontact electrodes. IEEE Transactions on Instrumentation and Measurement, 63 (10). 2414--2421. DOI: https://doi.org/10.1109/TIM.2014.2310033",
      "doi": ""
    },
    {
      "text": "Analog Devices. 1 MSPS, 12-Bit Impedance Converter, Network Analyzer. AD5933. Retrieved January 5, 2020 from https://www.analog.com/media/en/technicaldocumentation/data-sheets/AD5933.pdf",
      "doi": ""
    },
    {
      "text": "Ultimaker BV. Ultimaker 3. Retrieved January 5, 2020 from https://ultimaker.com/3d-printers/ultimaker-3",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos and Kimiko Ryokai. 2016. I don't want to wear a screen: probing perceptions of and possibilities for dynamic displays on clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '16), 60286039. DOI: https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Christine Dierk, Sarah Sterman, Molly Jane Pearce Nicholas and Eric Paulos. 2018. Häiriö: Human hair as interactive material. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18), 148--157. DOI: https://doi.org/10.1145/3173225.3173232",
      "doi": "10.1145/3173225.3173232"
    },
    {
      "text": "Chuhan Gao, Xinyu Zhang and Suman Banerjee. 2018. Conductive Inkjet Printed Passive 2D TrackPad for VR Interaction. In Proceedings of the 24th Annual International Conference on Mobile Computing and Networking (MobiCom '18), 83--98. DOI: https://doi.org/10.1145/3241539.3241546",
      "doi": "10.1145/3241539.3241546"
    },
    {
      "text": "Chris Harrison, Munehiko Sato and Ivan Poupyrev. 2012. Capacitive fingerprinting: exploring user differentiation by sensing electrical properties of the human body. In Proceedings of the 25th annual ACM symposium on User interface software and technology, 537--544. DOI: https://doi.org/10.1145/2380116.2380183",
      "doi": "10.1145/2380116.2380183"
    },
    {
      "text": "David Holman and Roel Vertegaal. 2011. TactileTape: low-cost touch sensing on curved surfaces. In Proceedings of the 24th annual ACM symposium adjunct on User interface software and technology, 1718. DOI: https://doi.org/10.1145/2046396.2046406",
      "doi": "10.1145/2046396.2046406"
    },
    {
      "text": "Arthur Edwin Kennelly. 1899. The equivalence of triangles and three-pointed stars in conducting networks. Electrical world and engineer, 34 (12). 413414.",
      "doi": ""
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2018. ARCord: Visually Augmented Interactive Cords for Mobile Interaction. In CHI '18 Extended Abstracts on Human Factors in Computing Systems (CHI EA '18), LBW623. DOI: https://doi.org/10.1145/3170427.3188456",
      "doi": "10.1145/3170427.3188456"
    },
    {
      "text": "Yuying Li. 1993. Centering, Trust Region, Reflective Techniques for Nonlinear Minimization Subject to Bounds. Technical Report. Cornell University, USA.",
      "doi": ""
    },
    {
      "text": "Alex Olwal, Jon Moeller, Greg Priest-Dorman, Thad Starner and Ben Carroll. 2018. I/O Braid: Scalable Touch-Sensitive Lighted Cords Using Spiraling, Repeating Sensing Textiles and Fiber Optics. In Proceedings of The 31st Annual ACM Symposium on User Interface Software and Technology, 485--497. DOI: https://doi.org/10.1145/3242587.3242638",
      "doi": "10.1145/3242587.3242638"
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner and Siegfried Bauer. 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of The 31st Annual ACM Symposium on User Interface Software and Technology, 745--756. DOI: https://doi.org/10.1145/3242587.3242664",
      "doi": "10.1145/3242587.3242664"
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal and Michael Haller. 2016. FlexTiles: a flexible, stretchable, formable, pressure-sensitive, tactile input sensor. In CHI '16 Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 3754--3757. DOI: https://doi.org/10.1145/2851581.2890253",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal and Michael Haller. 2017. SmartSleeve: real-time sensing of surface and deformation gestures on flexible, interactive textiles, using a hybrid gesture detection pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology, 565--577. DOI: https://doi.org/10.1145/3126594.3126652",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Alex Pentland. 2000. Looking at People: Sensing for Ubiquitous and Wearable Computing. IEEE Trans. Pattern Anal. Mach. Intell. 22, 107--119. DOI: https://doi.org/10.1109/34.824823",
      "doi": "10.1109/34.824823"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig and Karen E Robinson. 2016. Project Jacquard: interactive digital textiles at scale. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '16), 4216--4227. DOI: https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Proto-pasta. Electrically Conductive Composite PLA. CDP11705. Retrieved January 5, 2020 from https://www.proto-pasta.com/products/conductive-pla",
      "doi": ""
    },
    {
      "text": "M. Sato, I. Poupyrev and C. Harrison. 2012. Touché: Enhancing Touch Interaction on Humans, Screens, Liquids, and EverydayObjects. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '12), 483--492. DOI: https://doi.org/10.1145/2207676.2207743",
      "doi": ""
    },
    {
      "text": "Munehiko Sato, Rohan S Puri, Alex Olwal, Yosuke Ushigome, Lukas Franciszkiewicz, Deepak Chandra, Ivan Poupyrev and Ramesh Raskar. 2017. Zensei: Embedded, multi-electrode bioimpedance sensing for implicit, ubiquitous user recognition. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '17), 3972--3985. DOI: https://doi.org/10.1145/3025453.3025536",
      "doi": "10.1145/3025453.3025536"
    },
    {
      "text": "Stefan Schneegass and Alexandra Voit. 2016. GestureSleeve: using touch sensitive fabrics for gestural input on the forearm for controlling smartwatches. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (ISWC '16), 108--115. DOI: https://doi.org/10.1145/2971763.2971797",
      "doi": "10.1145/2971763.2971797"
    },
    {
      "text": "Philipp Schoessler, Sang-won Leigh, Krithika Jagannath, Patrick van Hoof and Hiroshi Ishii. 2015. Cord UIs: controlling devices with augmented cables. in Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), 395--398. DOI: https://doi.org/10.1145/2677199.2680601",
      "doi": "10.1145/2677199.2680601"
    },
    {
      "text": "Julia Schwarz, Chris Harrison, Scott Hudson and Jennifer Mankoff. 2010. Cord input: an intuitive, highaccuracy, multi-degree-of-freedom input method for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '10) 1657--1660. DOI: https://doi.org/10.1145/1753326.1753573",
      "doi": "10.1145/1753326.1753573"
    },
    {
      "text": "Cátia Sousa and Ian Oakley. 2011. Integrating feedback into wearable controls. In IFIP Conference on Human-Computer Interaction, 556--559. DOI: https://doi.org/10.1007/978--3--642--23768--3_81",
      "doi": ""
    },
    {
      "text": "Anita Vogl, Patrick Parzer, Teo Babic, Joanne Leong, Alex Olwal, and Michael Haller. 2017. StretchEBand: Enabling Fabric-based Interactions through Rapid Fabrication of Textile Stretch Sensors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). DOI: https://doi.org/10.1145/3025453.3025938",
      "doi": "10.1145/3025453.3025938"
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21st century. SIGMOBILE Mob. Comput. Commun. Rev. 3, 3--11. DOI: https://doi.org/10.1145/329124.329126",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Raphael Wimmer and Patrick Baudisch. 2011. Modular and deformable touch-sensitive surfaces based on time domain reflectometry. In Proceedings of the 24th annual ACM symposium on User interface software and technology, 517--526. DOI: https://doi.org/10.1145/2047196.2047264",
      "doi": "10.1145/2047196.2047264"
    },
    {
      "text": "Sang Ho Yoon, Ke Huo, Yunbo Zhang, Guiming Chen, Luis Paredes, Subramanian Chidambaram and Karthik Ramani. 2017. iSoft: a customizable soft sensor with real-time continuous contact and stretching sensing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology, 665--678. DOI: https://doi.org/10.1145/3126594.3126654",
      "doi": "10.1145/3126594.3126654"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2018. Pulp nonfiction: Low-cost touch tracking for paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '18), 117. DOI: https://doi.org/10.1145/3173574.3173691",
      "doi": "10.1145/3173574.3173691"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2015. Tomo: Wearable, low-cost electrical impedance tomography for hand gesture recognition. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology, 67--173. DOI: https://doi.org/10.1145/2807442.2807480",
      "doi": "10.1145/2807442.2807480"
    },
    {
      "text": "Yang Zhang, Gierad Laput and Chris Harrison. 2017. Electrick: Low-cost touch sensing using electric field tomography. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '17), 114. DOI: https://doi.org/10.1145/3173574.3173691",
      "doi": "10.1145/3025453.3025842"
    },
    {
      "text": "Yang Zhang, Robert Xiao and Chris Harrison. 2016. Advancing hand gesture recognition with high resolution electrical impedance tomography. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, 843--85 DOI: https://doi.org/10.1145/2984511.2984574",
      "doi": "10.1145/2984511.2984574"
    }
  ]
}