{
  "doi": "10.1145/3313831.3376784",
  "title": "Fake News on Facebook and Twitter: Investigating How People (Don't) Investigate",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "With misinformation proliferating online and more people getting news from social media, it is crucial to understand how people assess and interact with low-credibility posts. This study explores how users react to fake news posts on their Facebook or Twitter feeds, as if posted by someone they follow. We conducted semi-structured interviews with 25 participants who use social media regularly for news, temporarily caused fake news to appear in their feeds with a browser extension unbeknownst to them, and observed as they walked us through their feeds. We found various reasons why people do not investigate low-credibility posts, including taking trusted posters' content at face value, as well as not wanting to spend the extra time. We also document people's investigative methods for determining credibility using both platform affordances and their own ad-hoc strategies. Based on our findings, we present design recommendations for supporting users when investigating low-credibility posts.",
  "tags": [
    "twitter",
    "social media",
    "trust",
    "misinformation",
    "verification",
    "disinformation",
    "Facebook",
    "fake news"
  ],
  "authors": [
    {
      "name": "Christine Geeng",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365634",
      "orcid": "missing"
    },
    {
      "name": "Savanna Yee",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529528",
      "orcid": "missing"
    },
    {
      "name": "Franziska Roesner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467642436",
      "orcid": "0000-0001-8735-4810"
    }
  ],
  "references": [
    {
      "text": "Alliance for Securing Democracy. 2017. Hamilton 68: Tracking Russian Influence Operations on Twitter. (2017). http://dashboard.securingdemocracy.org/.",
      "doi": ""
    },
    {
      "text": "Michelle A. Amazeen and Bartosz W. Wojdynski. 2019. Reducing Native Advertising Deception: Revisiting the Antecedents and Consequences of Persuasion Knowledge in Digital News Contexts. Mass Communication and Society 22, 2 (2019), 222--247. DOI: http://dx.doi.org/10.1080/15205436.2018.1530792",
      "doi": ""
    },
    {
      "text": "Athanasios Andreou, Giridhari Venkatadri, Oana Goga, Krishna P. Gummadi, Patrick Loiseau, and Alan Mislove. 2018. Investigating Ad Transparency Mechanisms in Social Media: A Case Study of Facebook's Explanations. In Network and Distributed System Security Symposium (NDSS). DOI: http://dx.doi.org/10.14722/ndss.2018.23204",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, Leo Graiden Stewart, and Kate Starbird. 2018. Acting the Part: Examining Information Operations Within #BlackLivesMatter Discourse. Proceedings of the ACM on Human-Computer Interaction (CSCW) 2, Article 20 (Nov. 2018), 27 pages. DOI: http://dx.doi.org/10.1145/3274289",
      "doi": "10.1145/3274289"
    },
    {
      "text": "Pablo Barberá, John Jost, Jonathan Nagler, Joshua Tucker, and Richard Bonneau. 2015. Tweeting From Left to Right: Is Online Political Communication More Than an Echo Chamber? Psychological science 26 (08 2015). DOI: http://dx.doi.org/10.1177/0956797615594620",
      "doi": ""
    },
    {
      "text": "Leticia Bode and Emily K. Vraga. 2015. In Related News, That Was Wrong: The Correction of Misinformation Through Related Stories Functionality in Social Media. Journal of Communication 65, 4 (2015), 619--638. DOI: http://dx.doi.org/10.1111/jcom.12166",
      "doi": ""
    },
    {
      "text": "David A. Broniatowski, Amelia Jamison, SiHua Qi, Lulwah Alkulaib, Tao Chen, Adrian Benton, Sandra Crouse Quinn, and Mark Dredze. 2018. Weaponized Health Communication: Twitter Bots and Russian Trolls Amplify the Vaccine Debate. American Journal of Public Health 108 10 (2018), 1378--1384. DOI: http://dx.doi.org/10.2105/AJPH.2018.304567",
      "doi": ""
    },
    {
      "text": "Mike Caulfield. 2017. Web Literacy for Student Fact-Checkers. (2017). https://webliteracy.pressbooks.com/.",
      "doi": ""
    },
    {
      "text": "Shelley Chaiken. 1980. Heuristic Versus Systematic Information Processing and the Use of Source Versus Message Cues in Persuasion. Journal of Personality and Social Psychology 39, 5 (1980), 752--766. DOI: http://dx.doi.org/10.1037/0022--3514.39.5.752",
      "doi": ""
    },
    {
      "text": "Pranav Dixit and Ryan Mac. 2018. How WhatsApp Destroyed A Village. Buzzfeed News. (Sept. 2018). https://www.buzzfeednews.com/article/pranavdixit/whatsapp-destroyed-village-lynchings-rainpada-india.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan and Aaron Smith. 2016. The Political Environment on Social Media. (2016). https://www.pewinternet.org/2016/10/25/the-politicalenvironment-on-social-media/.",
      "doi": ""
    },
    {
      "text": "David Emery. 2019a. Did California Democrats Introduce an LGBTQ Bill to \"Protect Pedophiles Who Rape Children\"? (Feb. 2019). https://www.snopes.com/fact-check/ca-democrats-lgbtq-bill-pedophiles/.",
      "doi": ""
    },
    {
      "text": "David Emery. 2019b. Does This Photograph Depict an Actual \"Abortion Barbie\" Doll? (April 2019). https://www.snopes.com/fact-check/abortion-barbie-doll/.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. \"I Always Assumed That I Wasn't Really That Close to [Her]\": Reasoning About Invisible Algorithms in News Feeds. In 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). DOI: http://dx.doi.org/10.1145/2702123.2702556",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Jonathan Evans. 2008. Dual-Processing Accounts of Reasoning, Judgment, and Social Cognition. Annual review of psychology 59 (02 2008), 255--78. DOI: http://dx.doi.org/10.1146/annurev.psych.59.103006.093629",
      "doi": ""
    },
    {
      "text": "Dan Evon. 2019a. Does U.S. Rep. Ocasio-Cortez Oppose Daylight Saving Time Because It Speeds Up Climate Change? (March 2019). https://www.snopes.com/fact-check/aoc-daylight-saving-time/.",
      "doi": ""
    },
    {
      "text": "Dan Evon. 2019b. Is This 450-Pound Dog Real? (April 2019). https://www.snopes.com/fact-check/450-pound-dog/.",
      "doi": ""
    },
    {
      "text": "Dan Evon. 2019c. Is this a Photograph of a Large Storm Over Sydney? (April 2019). https://www.snopes.com/fact-check/storm-over-sydney/.",
      "doi": ""
    },
    {
      "text": "Dan Evon. 2019d. Is this Crystal Methodist Church Sign in Effing, SC, Real? (March 2019). https://www.snopes.com/fact-check/crystal-methodistchurch-sign/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2017a. New Test to Provide Context About Articles. (Oct. 2017). https://newsroom.fb.com/news/2017/10/news-feed-fyinew-test-to-provide-context-about-articles/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2017b. New Test With Related Articles. (April 2017). https://newsroom.fb.com/news/2017/04/news-feed-fyi-new-test-with-related-articles/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2017c. New Updates to Reduce Clickbait Headlines. (May 2017). https://newsroom.fb.com/news/2017/05/news-feed-fyinew-updates-to-reduce-clickbait-headlines/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2017d. Replacing Disputed Flags With Related Articles. (Dec. 2017). https://newsroom.fb.com/news/2017/12/news-feed-fyiupdates-in-our-fight-against-misinformation/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2018a. Helping Ensure News on Facebook Is From Trusted Sources. (Jan. 2018). https://newsroom.fb.com/news/2018/01/trusted-sources/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2018b. Helping People Better Assess the Stories They See in News Feed with the Context Button. (2018). https://newsroom.fb.com/news/2018/04/newsfeed-fyi-more-context/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2018c. Making Ads and Pages More Transparent. (April 2018). https://newsroom.fb.com/news/2018/04/transparent-ads-and-pages/.",
      "doi": ""
    },
    {
      "text": "Facebook. 2019. Combatting Vaccine Misinformation. (March 2019). https://newsroom.fb.com/news/2019/03/combatting-vaccine-misinformation/.",
      "doi": ""
    },
    {
      "text": "FactCheck.org. 2017. Misinformation Directory. (2017). https://www.factcheck.org/2017/07/websites-post-fakesatirical-stories/.",
      "doi": ""
    },
    {
      "text": "Factmata. 2019. Trusted News. (2019). https://trusted-news.com/.",
      "doi": ""
    },
    {
      "text": "Robert M. Faris, Hal Roberts, Bruce Etling, Nikki Bourassa, Ethan Zuckerman, and Yochai Benkler. 2017. Partisanship, Propaganda, and Disinformation: Online Media and the 2016 U.S. Presidential Election. Technical Report. Berkman Klein Center for Internet & Society Research Paper.",
      "doi": ""
    },
    {
      "text": "Andrew Flanagin and Miriam Metzger. 2008. Digital Media and Youth: Unparalleled Opportunity and Unprecedented Responsibility. The MacArthur Foundation Digital Media and Learning Initiative (2008).",
      "doi": ""
    },
    {
      "text": "Seth Flaxman, Sharad Goel, and Justin M. Rao. 2016. Filter Bubbles, Echo Chambers, and Online News Consumption. Public Opinion Quarterly 80, S1 (2016), 298--320. DOI: http://dx.doi.org/10.1093/poq/nfw006",
      "doi": "10.1093/poq"
    },
    {
      "text": "Martin Flintham, Christian Karner, Khaled Bachour, Helen Creswick, Neha Gupta, and Stuart Moran. 2018. Falling for Fake News: Investigating the Consumption of News via Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 376, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3173950",
      "doi": "10.1145/3173574.3173950"
    },
    {
      "text": "B. J. Fogg, Cathy Soohoo, David R. Danielson, Leslie Marable, Julianne Stanford, and Ellen R. Tauber. 2003. How Do Users Evaluate the Credibility of Web Sites?: A Study with over 2,500 Participants. In Proceedings of the 2003 Conference on Designing for User Experiences (DUX '03). ACM, NY, NY, USA, 1--15. DOI: http://dx.doi.org/10.1145/997078.997097",
      "doi": ""
    },
    {
      "text": "Adam Fourney, Miklos Racz, Gireeja Ranade, Markus Mobius, and Eric Horvitz. 2017. Geographic and Temporal Trends in Fake News Consumption During the 2016 US Presidential Election. 2071--2074. DOI: http://dx.doi.org/10.1145/3132847.3133147",
      "doi": ""
    },
    {
      "text": "Dilrukshi Gamage, Humphrey Obuobi, Bill Skeet, Annette Greiner, Amy X. Zhang, and Jenny Fan. 2019. What does it take to design for a user experience (UX) of credibility? (2019). https://misinfocon.com/what-does-it-take-to-design-for-auser-experience-ux-of-credibility-f07425940808.",
      "doi": ""
    },
    {
      "text": "Jeff Gary and Ashkan Soltani. 2019. First Things First: Online Advertising Practices and Their Effects on Platform Speech. (2019). https://knightcolumbia.org/content/first-things-first-online-advertisingpractices-and-their-effects-on-platform-speech.",
      "doi": ""
    },
    {
      "text": "Nathaniel Gleicher. 2019. Removing Coordinated Inauthentic Behavior From China. (2019). https://newsroom.fb.com/news/2019/08/removing-cib-china/.",
      "doi": ""
    },
    {
      "text": "Andrew Guess, Jonathan Nagler, and Joshua Tucker. 2019. Less than you think: Prevalence and predictors of fake news dissemination on Facebook. Science Advances 5 (01 2019), eaau4586. DOI: http://dx.doi.org/10.1126/sciadv.aau4586",
      "doi": ""
    },
    {
      "text": "David A. Hyman, David J. Franklyn, Calla Yee, and Mohammad Rahmati. 2017. Going Native: Can Consumers Recognize Native Advertising? Does it Matter? 19 Yale J.L. & Tech. 77. (2017).",
      "doi": ""
    },
    {
      "text": "Poynter Institute. 2019. What is MediaWise? (2019). https://www.poynter.org/mediawise/.",
      "doi": ""
    },
    {
      "text": "Shanto Iyengar and Kyu Hahn. 2009. Red Media, Blue Media: Evidence of Ideological Selectivity in Media Use. Journal of Communication 59 (03 2009), 19--39. DOI: http://dx.doi.org/10.1111/j.1460--2466.2008.01402.x",
      "doi": ""
    },
    {
      "text": "Caroline Jack. 2017. Lexicon of Lies: Terms for Problematic Information. Data & Society. (Aug. 2017).",
      "doi": ""
    },
    {
      "text": "Edson C. Tandoc Jr. 2019. Tell Me Who Your Sources Are. Journalism Practice 13, 2 (2019), 178--190. DOI: http://dx.doi.org/10.1080/17512786.2017.1423237",
      "doi": ""
    },
    {
      "text": "A-Reum Jung and Jun Heo. 2019. Ad Disclosure vs. Ad Recognition: How Persuasion Knowledge Influences Native Advertising Evaluation. Journal of Interactive Advertising 19, 1 (2019), 1--14. DOI: http://dx.doi.org/10.1080/15252019.2018.1520661",
      "doi": ""
    },
    {
      "text": "Alex Kasprak. 2018. Did a Harvard Study Prove That \"Unvaccinated Children Pose No Ris\" to Other Kids? (Aug. 2018). https://www.snopes.com/fact-check/harvard-study-unvaccinated-children/.",
      "doi": ""
    },
    {
      "text": "Kim Lacapria. 2017. During a Hurricane, Should You Store Important Items in Your Dishwasher? (Sept. 2017). https://www.snopes.com/fact-check/dishwasher-hurricane/.",
      "doi": ""
    },
    {
      "text": "David Lazer, Matthew A. Baum, Yochai Benkler, Adam J. Berinsky, Kelly M. Greenhill, Filippo Menczer, Miriam J. Metzger, Brendan Nyhan, Gordon Pennycook, David Rothschild, Michael Schudson, Steven A. Sloman, Cass R. Sunstein, Emily Thorson, Duncan J. Watts, and Jonathan Zittrain. 2018. The science of fake news. Science 359 (2018), 1094--1096. DOI: http://dx.doi.org/10.1126/science.aao2998",
      "doi": ""
    },
    {
      "text": "Ji Young Lee and S. Shyam Sundar. 2013. To Tweet or to Retweet? That Is the Question for Health Professionals on Twitter. Health Communication 28, 5 (2013), 509--524. DOI: http://dx.doi.org/10.1080/10410236.2012.700391 PMID: 22873787.",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky, Ullrich K. H. Ecker, Colleen M. Seifert, Norbert Schwarz, and John Cook. 2012. Misinformation and Its Correction: Continued Influence and Successful Debiasing. Psychological Science in the Public Interest 13, 3 (2012), 106--131. DOI: http://dx.doi.org/10.1177/1529100612451018 PMID: 26173286.",
      "doi": ""
    },
    {
      "text": "C. G. Lord, L. Ross, and M. R. Lepper. 1979. Biased assimilation and attitude polarization: The effects of prior theories on subsequently considered evidence. Journal of Personality and Social Psychology 37 (1979). Issue 11. DOI: http://dx.doi.org/10.1037/0022--3514.37.11.2098",
      "doi": ""
    },
    {
      "text": "Dan MacGuill. 2019a. Did Lettuce Kill More People in the U.S. in 2018 Than Undocumented Immigrants Did? (Jan. 2019). https://www.snopes.com/fact-check/lettucedeaths-illegal-immigrants/.",
      "doi": ""
    },
    {
      "text": "Dan MacGuill. 2019b. Did New Zealand Take Fox News or Sky News Off the Air in Response to Mosque Shooting Coverage? (March 2019). https://www.snopes.com/fact-check/fox-new-zealand-mosque/.",
      "doi": ""
    },
    {
      "text": "Dan MacGuill. 2019c. Did Rep. Alexandria Ocasio-Cortez Say it Was \"Wrong\" for Billionaires to Exist? (Feb. 2019). https://www.snopes.com/fact-check/aoc-alexandria-ocasio-cortez-wrong-billionaires/.",
      "doi": ""
    },
    {
      "text": "Dan MacGuill. 2019d. Was Bernie Sanders Arrested for Throwing Eggs at Civil Rights Protesters? (Feb. 2019). https://www.snopes.com/fact-check/bernie-sandersthrowing-eggs/.",
      "doi": ""
    },
    {
      "text": "Dan MacGuill. 2019e. Was Canada Under an E. Coli-Related Boil Water Notice in the Spring of 2019? (May 2019). https://www.snopes.com/fact-check/canada-water-ecoli/.",
      "doi": ""
    },
    {
      "text": "Alice Marwick and Rebecca Lewis. 2017. Media Manipulation and Disinformation Online. Data & Society. (May 2017). https://datasociety.net/pubs/oh/DataAndSociety_MediaManipulationAndDisinformationOnline.pdf.",
      "doi": ""
    },
    {
      "text": "Lee C. McIntyre. 2018. Post-Truth. MIT Press.",
      "doi": ""
    },
    {
      "text": "Merriam-Webster. 2019. (2019). https://www.merriam-webster.com/dictionary/meme.",
      "doi": ""
    },
    {
      "text": "Solomon Messing and Sean J. Westwood. 2014. Selective Exposure in the Age of Social Media: Endorsements Trump Partisan Source Affiliation When Selecting News Online. Communication Research 41, 8 (2014), 1042--1063. DOI: http://dx.doi.org/10.1177/0093650212466406",
      "doi": ""
    },
    {
      "text": "Miriam J. Metzger and Andrew J. Flanagin. 2013. Credibility and trust of information in online environments: The use of cognitive heuristics. Journal of Pragmatics 59 (2013), 210 -- 220. DOI: http://dx.doi.org/https://doi.org/10.1016/j.pragma.2013.07.012 Biases and constraints in communication: Argumentation, persuasion and manipulation.",
      "doi": ""
    },
    {
      "text": "Miriam J. Metzger, Andrew J. Flanagin, and Ryan B. Medders. 2010. Social and Heuristic Approaches to Credibility Evaluation Online. Journal of Communication 60, 3 (2010), 413--439. DOI: http://dx.doi.org/10.1111/j.1460--2466.2010.01488.x",
      "doi": ""
    },
    {
      "text": "NewsGuard. 2019. NewsGuard: Restoring Trust & Accountability. (2019). https://www.newsguardtech.com/.",
      "doi": ""
    },
    {
      "text": "Brendan Nyhan and Jason Reifler. 2010. When Corrections Fail: The persistence of political misperceptions. Political Behavior 32 (June 2010), 303--330. Issue 2. DOI: http://dx.doi.org/10.1007/s11109-010--9112--2",
      "doi": ""
    },
    {
      "text": "Observatory on Social Media (OSoMe). 2019. BotSlayer. Indiana University. (2019). https://osome.iuni.iu.edu/tools/botslayer/.",
      "doi": ""
    },
    {
      "text": "Bethania Palma. 2019. Did the Texas Governor Tweet a Fake BBC Page with False Information About a Convicted Rapist? (Feb. 2019). https://www.snopes.com/fact-check/texas-governor-tweet-rapist/.",
      "doi": ""
    },
    {
      "text": "Richard E. Petty and John T. Cacioppo. 1986. The Elaboration Likelihood Model of Persuasion. Advances in Experimental Social Psychology, Vol. 19. Academic Press, 123 -- 205. DOI: http://dx.doi.org/https://doi.org/10.1016/S0065--2601(08)60214--2",
      "doi": ""
    },
    {
      "text": "Politifact. 2019. Fact-checking U.S. politics. (2019). https://www.politifact.com/.",
      "doi": ""
    },
    {
      "text": "David P. Redlawsk, Andrew J. W. Civettini, and Karen M. Emmerson. 2010. The Affective Tipping Point: Do Motivated Reasoners Ever AIJGet It Political Psychology 31, 4 (2010), 563--593. DOI: http://dx.doi.org/10.1111/j.1467--9221.2010.00772.x",
      "doi": ""
    },
    {
      "text": "Jon Roozenbeek and Sander van der Linden. 2019. Fake news game confers psychological resistance against online misinformation. Palgrave Communications 5, 1 (2019), 65. DOI: http://dx.doi.org/10.1057/s41599-019-0279--9",
      "doi": ""
    },
    {
      "text": "Yoel Roth and Del Harvey. 2018. How Twitter is fighting spam and malicious automation. (2018). https://blog.twitter.com/en_us/topics/company/2018/how-twitter-is-fighting-spam-and-maliciousautomation.html.",
      "doi": ""
    },
    {
      "text": "Victoria L. Rubin, Yimin Chen, and Niall J. Conroy. 2015. Deception Detection for News: Three Types of Fakes. In Proceedings of the 78th ASIS&T Annual Meeting: Information Science with Impact: Research in and for the Community (ASIST '15). American Society for Information Science, Silver Springs, MD, USA, Article 83, 4 pages. DOI: http://dx.doi.org/10.1002/pra2.2015.145052010083",
      "doi": ""
    },
    {
      "text": "Ryan Gallagher. 2019. Twitter Helped Chinese Government Promote Disinformation On Repression Of Uighurs. (Aug. 2019). https://theintercept.com/2019/08/19/twitter-ads-china-uighurs/.",
      "doi": ""
    },
    {
      "text": "Twitter Safety. 2019. Information operations directed at Hong Kong. (2019). https://blog.twitter.com/en_us/topics/company/2019/information_operations_directed_at_Hong_Kong.html.",
      "doi": ""
    },
    {
      "text": "Chengcheng Shao, Giovanni Luca Ciampaglia, Alessandro Flammini, and Filippo Menczer. 2016. Hoaxy: A Platform for Tracking Online Misinformation. In Proceedings of the 25th International Conference Companion on World Wide Web (WWW '16 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 745--750. DOI: http://dx.doi.org/10.1145/2872518.2890098",
      "doi": "10.1145/2872518.2890098"
    },
    {
      "text": "Chengcheng Shao, Giovanni Luca Ciampaglia, Onur Varol, Kaicheng Yang, Alessandro Flammini, and Filippo Menczer. 2018. The spread of low-credibility content by social bots. In Nature Communications. DOI: http://dx.doi.org/10.1038/s41467-018-06930--7",
      "doi": ""
    },
    {
      "text": "Elisa Shearer and Jeffrey Gottfried. 2017. News Use Across Social Media Platforms 2017. (2017). http://https://www.journalism.org/2017/09/07/newsuse-across-social-media-platforms-2017.",
      "doi": ""
    },
    {
      "text": "Snopes Media Group. 2019. Snopes. (2019). https://www.snopes.com/.",
      "doi": ""
    },
    {
      "text": "Kate Starbird, Ahmer Arif, Tom Wilson, Katherine Van Koevering, Katya Yefimova, and Daniel Scarnecchia. 2018. Ecosystem or Echo-System? Exploring Content Sharing across Alternative Media Domains. In International AAAI Conference on Web and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Shyam Sundar. 2007. The MAIN Model : A Heuristic Approach to Understanding Technology Effects on Credibility.",
      "doi": ""
    },
    {
      "text": "The Media Insight Project. 2017. \"Who Shared It?\": How Americans Decide What News to Trust on Social Media. (March 2017). https://www.americanpressinstitute.org/publications/ reports/survey-research/trust-social-media/.",
      "doi": ""
    },
    {
      "text": "Yannis Theocharis and Will Lowe. 2016. Does Facebook increase political participation? Evidence from a field experiment. Information, Communication & Society 19, 10 (2016), 1465--1486. DOI: http://dx.doi.org/10.1080/1369118X.2015.1119871",
      "doi": ""
    },
    {
      "text": "Tony Romm. 2018. \"Pro-Beyoncé\" vs. \"Anti-Beyoncé\": 3,500 Facebook ads show the scale of Russian manipulation. (May 2018). https://washingtonpost.com/news/the-switch/wp/2018/ 05/10/here-are-the-3400-facebook-ads-purchased-byrussias-online-trolls-during-the-2016-election/.",
      "doi": ""
    },
    {
      "text": "Joshua Tucker, Andrew Guess, Pablo Barbera, Cristian Vaccari, Alexandra Siegel, Sergey Sanovich, Denis Stukal, and Brendan Nyhan. 2018. Social Media, Political Polarization, and Political Disinformation: A Review of the Scientific Literature. SSRN Electronic Journal (01 2018). DOI: http://dx.doi.org/10.2139/ssrn.3144139",
      "doi": ""
    },
    {
      "text": "Twitter. 2017. Our approach to bots and misinformation. (June 2017). https://blog.twitter.com/en_us/topics/company/2017/Our-Approach-Bots-Misinformation.html.",
      "doi": ""
    },
    {
      "text": "Twitter. 2019. Helping you find reliable public health information on Twitter. (May 2019). https://blog.twitter.com/en_us/topics/company/2019/helping-you-find-reliable-public-health-informationon-twitter.html.",
      "doi": ""
    },
    {
      "text": "Tavish Vaidya, Daniel Votipka, Michelle L. Mazurek, and Micah Sherr. 2019. Does Being Verified Make You More Credible?: Account Verification's Effect on Tweet Credibility. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 525, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300755",
      "doi": "10.1145/3290605.3300755"
    },
    {
      "text": "Claire Wardle and Hossein Derakhshan. 2017. Information Disorder: Toward an interdisciplinary framework for research and policymaking. Technical Report. Council of Europe.",
      "doi": ""
    },
    {
      "text": "Elizabeth J. Wilson and Daniel L. Sherrell. 1993. Source Effects in Communication and Persuasion Research: A Meta-Analysis of Effect Size. Journal of the Academy of Marketing Science 21, 2 (1993), 101--112. DOI: http://dx.doi.org/10.1177/009207039302100202",
      "doi": ""
    },
    {
      "text": "Bartosz W. Wojdynski. 2016. The Deceptiveness of Sponsored News Articles: How Readers Recognize and Perceive Native Advertising. American Behavioral Scientist 60, 12 (2016), 1475--1491. DOI: http://dx.doi.org/10.1177/0002764216660140",
      "doi": ""
    },
    {
      "text": "Bartosz W. Wojdynski and Nathaniel J. Evans. 2016. Going Native: Effects of Disclosure Position and Language on the Recognition and Evaluation of Online Native Advertising. Journal of Advertising 45, 2 (2016), 157--168. DOI: http://dx.doi.org/10.1080/00913367.2015.1115380",
      "doi": ""
    },
    {
      "text": "Thomas Wood and Ethan Porter. 2018. The Elusive Backfire Effect: Mass Attitudes' Steadfast Factual Adherence. Political Behavior 41 (01 2018). DOI: http://dx.doi.org/10.1007/s11109-018--9443-y",
      "doi": ""
    }
  ]
}