{
  "doi": "10.1145/3313831.3376849",
  "title": "Keep it Simple: How Visual Complexity and Preferences Impact Search Efficiency on Websites",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "We conducted an online study with 165 participants in which we tested their search efficiency and information recall. We confirm that the visual complexity of a website has a significant negative effect on search efficiency and information recall. However, the search efficiency of those who preferred simple websites was more negatively affected by highly complex websites than those who preferred high visual complexity. Our results suggest that diverse visual preferences need to be accounted for when assessing search response time and information recall in HCI experiments, testing software, or A/B tests.",
  "tags": [
    "visual appeal",
    "user interface",
    "information recall",
    "design",
    "search efficiency",
    "usability",
    "visual complexity"
  ],
  "authors": [
    {
      "name": "Amanda Baughan",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527940",
      "orcid": "0000-0003-2217-6974"
    },
    {
      "name": "Tal August",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260385",
      "orcid": "0000-0001-6726-4009"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Laboratories, Keihanna, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Katharina Reinecke",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583575",
      "orcid": "0000-0001-7897-9325"
    }
  ],
  "references": [
    {
      "text": "Daniel E. Berlyne. 1974. Studies in the new experimental aesthetics: Steps toward an objective psychology of aesthetic appreciation. Hemisphere.",
      "doi": ""
    },
    {
      "text": "George David Birkhoff. 1933. Aesthetic Measure. Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Michelle A. Borkin, Azalea A. Vo, Zoya Bylinskii, Phillip Isola, Shashank Sunkavalli, Aude Oliva, and Hanspeter Pfister. 2013. What makes a visualization memorable? IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2306--2315.",
      "doi": "10.1109/TVCG.2013.234"
    },
    {
      "text": "Gordon C. Bruner and Anand Kumar. 2000. Web commercials and advertising hierarchy-of-effects. Journal of Advertising Research 40, 1--2 (2000), 35--42.",
      "doi": ""
    },
    {
      "text": "Tam K. Dao, Donghyuck Lee, and Huang L. Chang. 2007. Acculturation level, perceived English fluency, perceived social support level, and depression among Taiwanese international students. College Student Journal 41, 2 (2007).",
      "doi": ""
    },
    {
      "text": "Maria Douneva, Rafael Jaron, and Meinald T. Thielsch. 2016. Effects of Different Website Designs on First Impressions, Aesthetic Judgements and Memory Performance after Short Presentation. Interacting with Computers 28, 4 (2016), 552--567.",
      "doi": ""
    },
    {
      "text": "Gary L Geissler, George M Zinkhan, and Richard T Watson. 2006. The influence of home page complexity on consumer attention, attitudes, and purchase intent. Journal of Advertising 35, 2 (2006), 69--80.",
      "doi": ""
    },
    {
      "text": "Jan Hartmann, Alistair Sutcliffe, and Antonella De Angeli. 2007. Investigating attractiveness in web user interfaces. In Proceedings of the 2007 SIGCHI conference on Human Factors in Computing Systems (CHI '07). ACM, 387--396.",
      "doi": "10.1145/1240624.1240687"
    },
    {
      "text": "John R Hauser, Glen L Urban, Guilherme Liberali, and Michael Braun. 2009. Website morphing. Marketing Science 28, 2 (2009), 202--223.",
      "doi": "10.5555/2875390.2875391"
    },
    {
      "text": "Angela V Hausman and Jeffrey Sam Siekpe. 2009. The effect of web interface features on consumer online purchase intentions. Journal of Business Research 62, 1 (2009), 5--13.",
      "doi": ""
    },
    {
      "text": "John M Henderson, Myriam Chanceaux, and Tim J Smith. 2009. The influence of clutter on real-world scene search: Evidence from search efficiency and eye movements. Journal of Vision 9, 1 (2009), 32--32.",
      "doi": ""
    },
    {
      "text": "Simeon Keates and Shari Trewin. 2005. Effect of age and Parkinson's disease on cursor positioning using a mouse. In Proceedings of the 7th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '05). 68--75.",
      "doi": "10.1145/1090785.1090800"
    },
    {
      "text": "Gitte Lindgaard. 2007. Aesthetics, visual appeal, usability and user satisfaction: what do the user's eyes tell the user's brain? Australian Journal of Emerging Technologies & Society 5, 1 (2007).",
      "doi": ""
    },
    {
      "text": "Gitte Lindgaard, Cathy Dudek, Devjani Sen, Livia Sumegi, and Patrick Noonan. 2011. An exploration of relations between visual appeal, trustworthiness and perceived usability of homepages. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 1 (2011), 1--10.",
      "doi": "10.1145/1959022.1959023"
    },
    {
      "text": "Gitte Lindgaard, Gary Fernandes, Cathy Dudek, and Judith M. Brown. 2006. Attention web designers: You have 50 milliseconds to make a good first impression! Behaviour & Information Technology 25, 2 (2006), 115--126.",
      "doi": ""
    },
    {
      "text": "AH Maslow. 1937. The influence of familiarization on preference. Journal of Experimental Psychology 21, 2 (1937), 162.",
      "doi": ""
    },
    {
      "text": "Eleni Michailidou, Simon Harper, and Sean Bechhofer. 2008. Visual complexity and aesthetic perception of web pages. In Proceedings of the 26th Annual ACM International Conference on Design of Communication (SIGDOC '08). 215--224.",
      "doi": "10.1145/1456536.1456581"
    },
    {
      "text": "Morten Moshagen, Jochen Musch, and Anja S Göritz. 2009. A blessing, not a curse: Experimental evidence for beneficial effects of visual aesthetics on performance. Ergonomics 52, 10 (2009), 1311--1320.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1995. 10 usability heuristics for user interface design. Nielsen Norman Group 1, 1 (1995).",
      "doi": ""
    },
    {
      "text": "Richard E Nisbett, Kaiping Peng, Incheol Choi, and Ara Norenzayan. 2001. Culture and systems of thought: holistic versus analytic cognition. Psychological Review 108, 2 (2001), 291.",
      "doi": ""
    },
    {
      "text": "Manuel Nordhoff, Tal August, Nigini Abilio Oliveira, and Katharina Reinecke. 2018. A case for design localization: Diversity of website aesthetics in 44 countries. In Proceedings of the 2018 SIGCHI Conference on Human Factors in Computing Systems (CHI '18). 337.",
      "doi": "10.1145/3173574.3173911"
    },
    {
      "text": "Alvitta Ottley, Huahai Yang, and Remco Chang. 2015. Personality As a Predictor of User Strategy: How Locus of Control Affects Search Strategies on Tree Visualizations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3251--3254. DOI: http://dx.doi.org/10.1145/2702123.2702590",
      "doi": "10.1145/2702123.2702590"
    },
    {
      "text": "Muzeyyen Pandir and John Knight. 2006. Homepage aesthetics: The search for preference factors and the challenges of subjectivity. Interacting with Computers 18, 6 (2006), 1351--1370.",
      "doi": "10.1016/j.intcom.2006.03.007"
    },
    {
      "text": "Rolf Reber, Norbert Schwarz, and Piotr Winkielman. 2004. Processing fluency and aesthetic pleasure: Is beauty in the perceiver's processing experience? Personality and Social Psychology Review 8, 4 (2004), 364--382.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying visual preferences around the world. In Proceedings of the 2014 SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 11--20.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z Gajos. 2015. LabintheWild: Conducting large-scale online experiments with uncompensated samples. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1364--1378.",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "Katharina Reinecke, Tom Yeh, Luke Miratrix, Rahmatri Mardiko, Yuechen Zhao, Jenny Liu, and Krzysztof Z. Gajos. 2013. Predicting users' first impressions of website aesthetics with a quantification of perceived visual complexity and colorfulness. In Proceedings of the 2013 SIGCHI Conference on Human Factors in Computing Systems (CHI '13).",
      "doi": ""
    },
    {
      "text": "Irene Reppa and Siné McDougall. 2015. When the going gets tough the beautiful get going: aesthetic appeal facilitates task performance. Psychonomic Bulletin & Review 22, 5 (2015), 1243--1254.",
      "doi": ""
    },
    {
      "text": "Ruth Rosenholtz, Yuanzhen Li, and Lisa Nakano. 2007. Measuring visual clutter. Journal of Vision 7, 2 (2007), 17--17.",
      "doi": ""
    },
    {
      "text": "Carolyn Salimun, Helen C Purchase, David R Simmons, and Stephen Brewster. 2010. The effect of aesthetically pleasing composition on visual search performance. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction (NORDICHI '10). 422--431.",
      "doi": "10.1145/1868914.1868963"
    },
    {
      "text": "Juergen Sauer and Andreas Sonderegger. 2011. The influence of product aesthetics and user state in usability testing. Behaviour & Information Technology 30, 6 (2011), 787--796.",
      "doi": ""
    },
    {
      "text": "Andreas Sonderegger and Juergen Sauer. 2010. The influence of design aesthetics in usability testing: Effects on user performance and perceived usability. Applied Ergonomics 41, 3 (2010), 403--410.",
      "doi": ""
    },
    {
      "text": "Julie S Stevenson, Gordon C Bruner, and Anand Kumar. 2000. Webpage background and viewer attitudes. Journal of Advertising Research 40, 1--2 (2000), 29--34.",
      "doi": ""
    },
    {
      "text": "Manfred Thüring and Sascha Mahlke. 2007. Usability, aesthetics and emotions in human--technology interaction. International Journal of Psychology 42, 4 (2007), 253--264.",
      "doi": ""
    },
    {
      "text": "Alexandre Tuch, S Roth, Kasper Hornbaek, Klaus Opwis, and Javier Bargas-Avila. 2012b. Toward understanding the relation between usability, aesthetics, and affect in HCI. Computers in Human Behavior [manuscript under revision] (04 2012).",
      "doi": ""
    },
    {
      "text": "Alexandre N Tuch, Javier A Bargas-Avila, Klaus Opwis, and Frank H Wilhelm. 2009. Visual complexity of websites: Effects on users' experience, physiology, performance, and memory. International Journal of Human-Computer Studies 67, 9 (2009), 703--715.",
      "doi": "10.1016/j.ijhcs.2009.04.002"
    },
    {
      "text": "Alexandre N Tuch, Eva E Presslaber, Markus StöCklin, Klaus Opwis, and Javier A Bargas-Avila. 2012a. The role of visual complexity and prototypicality regarding first impression of websites: Working towards understanding aesthetic judgments. International Journal of Human-Computer Studies 70, 11 (2012), 794--811.",
      "doi": "10.1016/j.ijhcs.2012.06.003"
    },
    {
      "text": "Neff Walker, David A. Philbin, and Arthur D. Fisk. 1997. Age-related differences in movement control: Adjusting submovement structure to optimize performance. Journals of Gerontology - Series B Psychological Sciences and Social Sciences 52, 1 (1997).",
      "doi": ""
    },
    {
      "text": "Huaitang Wang, Takahiko Masuda, Kenichi Ito, and Marghalara Rashid. 2012. How much information? East Asian and North American cultural products and information search performance. Personality and Social Psychology Bulletin 38, 12 (2012), 1539--1551.",
      "doi": ""
    },
    {
      "text": "Christine Yeh and Mayuko Inose. 2003. International students' reported English fluency, social support satisfaction, and social connectedness as predictors of acculturative stress. Counselling Psychology Quarterly 16 (03 2003), 15--28.",
      "doi": ""
    },
    {
      "text": "Xianjun Sam Zheng, Ishani Chakraborty, James Jeng-Weei Lin, and Robert Rauschenberger. 2009. Correlating low-level image statistics with users-rapid aesthetic and affective judgments of web pages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, 1--10.",
      "doi": "10.1145/1518701.1518703"
    }
  ]
}