{
  "doi": "10.1145/3313831.3376455",
  "title": "Integrated Development Environment with Interactive Scatter Plot for Examining Statistical Modeling",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2020,
  "badges": [],
  "abstract": "The development of a statistical modeling program requires example data to observe and verify the behavior of the program. Such example data are either taken from an existing dataset or synthesized using commands. Programmers may want to directly design an arbitrary dataset or modify it interactively, but it is difficult to do so in current development environments. We therefore propose combining a code editor with an interactive scatter plot editor to efficiently understand the behavior of statistical modeling algorithms. The user interactively creates and modifies the dataset on the scatter plot editor, while the system continuously executes the code in the editor, taking the data as input, and shows the result in the editor. This paper presents the design rationale behind the system and introduces several usage scenarios.",
  "tags": [
    "interactive data design and editing",
    "statistical modeling",
    "live programming"
  ],
  "authors": [
    {
      "name": "Kentaro Asai",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473904",
      "orcid": "missing"
    },
    {
      "name": "Tsukasa Fukusato",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81504688282",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659190029",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2019a. A Comparison Framework for Clustering Algorithms. https://pdfs.semanticscholar.org/7b95/44c73a30e15dab1caf66582b1f4b784542eb.pdf.",
      "doi": ""
    },
    {
      "text": "2019b. A Comparison of Various Clustering Methods and Algorithms in Data Mining. https://www.researchgate.net/profile/Rebika_Rai/post/ How_to_measure_the_difference_between_two_clusteclus_results/attachment/59d651fd79197b80779aa5b6/AS% 3A510117940793344%401498633002357/downldow/1.pdf.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. Clustering Basic Benchmark. https://cs.joensuu.fi/sipu/datasets/.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. D3js. https://d3js.org/.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. DBGen. https://github.com/electrum/tpch-dbgen/.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. matplotlib. https://matplotlib.org/.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. NumPy. https://docs.scipy.org/doc/numpy/.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. plotly. https://plot.ly/.",
      "doi": ""
    },
    {
      "text": "Online; accessed 01-April-2019. Scikit-Learn Machine Learning in Python. https://scikit-learn.org/stable/.",
      "doi": ""
    },
    {
      "text": "AdobeSystemsInc. 2019a. Adobe Illustrator CC. https://www.adobe.com/products/illustrator.html.",
      "doi": ""
    },
    {
      "text": "AdobeSystemsInc. 2019b. Adobe Photoshop CC. https://www.adobe.com/products/photoshop.html.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Andre Spritzer, Evelyne Lutton, and Jean-Daniel Fekete. 2012. Interactive Random Graph Generation with Evolutionary Algorithms. In International Symposium on Graph Drawing. Springer, 541--552.",
      "doi": ""
    },
    {
      "text": "Richard A Becker and William S Cleveland. 1987. Brushing Scatterplots. Technometrics 29, 2 (1987), 127--142.",
      "doi": "10.2307/1269768"
    },
    {
      "text": "Carolina Cruz-Neira, Daniel J Sandin, and Thomas A DeFanti. 1993. Surround-screen Projection-based Virtual Reality: the Design and Implementation of the CAVE. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques. Citeseer, 135--142.",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Koumei Fukahori, Daisuke Sakamoto, Jun Kato, and Takeo Igarashi. 2014. CapStudio: an Interactive Screencast for Visual Application Development. In Proceedings of the Extended Abstracts of the 32nd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1453--1458.",
      "doi": "10.1145/2559206.2581138"
    },
    {
      "text": "Brian Hempel and Ravi Chugh. 2016. Semi-Automated SVG Programming via Direct Manipulation. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, 379--390.",
      "doi": "10.1145/2984511.2984575"
    },
    {
      "text": "Brian Hempel, Justin Lubin, and Ravi Chugh. 2019. Sketch-n-Sketch: Output-Directed Programming for SVG. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, 281--292.",
      "doi": "10.1145/3332165.3347925"
    },
    {
      "text": "Jane Hoffswell, Arvind Satyanarayan, and Jeffrey Heer. 2018. Augmenting Code with in Situ Visualizations to Aid Program Understanding. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 532:1--532:12.",
      "doi": "10.1145/3173574.3174106"
    },
    {
      "text": "Hyeonsu Kang and Philip J Guo. 2017. Omnicode: A Novice-Oriented Live Programming Environment with Always-on Run-Time Value Visualizations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, 737--745.",
      "doi": "10.1145/3126594.3126632"
    },
    {
      "text": "Jun Kato and Takeo Igarashi. 2014. VisionSketch: Integrated Support for Example-centric Programming of Image Processing Applications. In Proceedings of the 2014 Graphics Interface Conference (GI '14). Canadian Information Processing Society, 115--122.",
      "doi": ""
    },
    {
      "text": "Jun Kato, Sean McDirmid, and Xiang Cao. 2012. DejaVu: Integrated Support for Developing Interactive Camera-Based Programs. In Proceedings of the 25th Annual ACM symposium on User Interface Software and Technology (UIST '12). ACM, 189--196.",
      "doi": "10.1145/2380116.2380142"
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research 9, Nov (2008), 2579--2605.",
      "doi": ""
    },
    {
      "text": "Miro Mannino and Azza Abouzied. 2018. Expressive Time Series Querying with Hand-drawn Scale-free Sketches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 388.",
      "doi": "10.1145/3173574.3173962"
    },
    {
      "text": "Mariana Mara¸ soiu, Alan F Blackwell, Advait Sarkar, and Martin Spott. 2016. Clarifying Hypotheses by Sketching Data. In Proceedings of the Eurographics/IEEE VGTC Conference on Visualization: Short Papers. Eurographics Association, 125--129.",
      "doi": ""
    },
    {
      "text": "Justin Matejka and George Fitzmaurice. 2017. Same Stats, Different Graphs: Generating Datasets with Varied Appearance and Identical Statistics through Simulated Annealing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 1290--1294.",
      "doi": "10.1145/3025453.3025912"
    },
    {
      "text": "Mikaël Mayer, Viktor Kuncak, and Ravi Chugh. 2018. Bidirectional Evaluation with Direct Manipulation. Proceedings of the ACM on Programming Languages 2 (2018), 127:1--127:28.",
      "doi": "10.1145/3276497"
    },
    {
      "text": "Dan Maynes-Aminzade, Terry Winograd, and Takeo Igarashi. 2007. Eyepatch: Prototyping Camera-based Interaction through Examples. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, 33--42.",
      "doi": "10.1145/1294211.1294219"
    },
    {
      "text": "Leland McInnes, John Healy, and James Melville. 2018. Umap: Uniform Manifold Approximation and Projection for Dimension Reduction. arXiv preprint arXiv:1802.03426 (2018).",
      "doi": ""
    },
    {
      "text": "Leonard A Stefanski. 2007. Residual (sur) realism. The American Statistician 61, 2 (2007), 163--177.",
      "doi": ""
    },
    {
      "text": "Zhiyuan Zhang, Kevin T McDonnell, Erez Zadok, and Klaus Mueller. 2015. Visual Correlation Analysis of Numerical and Categorical Data on the Correlation Map. IEEE Transactions on Visualization and Computer Graphics 21, 2 (2015), 289--303.",
      "doi": "10.1109/TVCG.2014.2350494"
    }
  ]
}