{
  "doi": "10.1145/3313831.3376486",
  "title": "FamilyStories: Asynchronous Audio Storytelling for Family Members Across Time Zones",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Family members who are separated across time zones can easily miss out on feeling connected. We designed and studied the usage of an asynchronous storytelling system, called FamilyStories, to explore the use of audio-based sharing. FamilyStories allows family members to share activities and experiences over distance in different time zones using three different devices that contain different contextual features. To evaluate the design, we conducted a five-week long field study with two family member pairs. Our results show the value of slow, flexible, and non-suggestive interfaces for asynchronous audio communication. We also found ephemerality helped in the sharing of 'instant' feelings, while large time zone differences could be 'synchronized' with time delayed messages. We raise these as design opportunities for asynchronous audio storytelling systems.",
  "authors": [
    {
      "name": "Yasamin Heshmat",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440620776",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Kyle McCaffrey",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528185",
      "orcid": "missing"
    },
    {
      "name": "William Odom",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    },
    {
      "name": "Ron Wakkary",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81100283877/rel-imgonly/img_3637_400x400.jpeg",
      "acmid": "81100283877",
      "orcid": "0000-0003-2073-715X"
    },
    {
      "name": "Zikun Yang",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526852",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rafael Ballagas, and Hayes Raffle. 2013. \"Reading, laughing, and connecting with young children.\" In Connecting Families, pp. 159--172. Springer, London.",
      "doi": ""
    },
    {
      "text": "Jeremy Barksdale, Kori Inkpen, Mary Czerwinski, Aaron Hoff, Paul Johns, Asta Roseway, and Gina Venolia. 2012. Video threads: asynchronous video sharing for temporally distributed teams. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1101--1104. DOI=http://doi.org/10.1145/2145204.214536",
      "doi": "10.1145/2145204.2145367"
    },
    {
      "text": "A.J. Bernheim Brush, Kori M. Inkpen, and Kimberly Tee. 2008. SPARCS: exploring sharing suggestions to enhance family connectedness. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, NY, NY, USA, 629- 638.",
      "doi": "10.1145/1460563.1460661"
    },
    {
      "text": "Leonardo Bonanni, Cati Vaucelle, Jeff Lieberman, and Orit Zuckerman. 2006. PlayPals: tangible interfaces for remote communication and play. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 574--579. DOI=http://doi.org/10.1145/1125451.1125572.",
      "doi": "10.1145/1125451.1125572"
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on shared experiences: moving beyond the camera in video communication. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 96--105. DOI=10.1145/2317956.2317973",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Xiang Cao. 2013. \"Connecting Families across Time Zones.\" In Connecting Families, pp. 127139. Springer London, 2013.",
      "doi": ""
    },
    {
      "text": "Xiang Cao, Abigail Sellen, A.J. Bernheim Brush, David Kirk, Darren Edge, and Xianghua Ding. 2010. Understanding family communication across time zones. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, NY, NY, USA, 155--158. DOI: https://doi.org/10.1145/1718918.1718947",
      "doi": "10.1145/1718918.1718947"
    },
    {
      "text": "Angela Chang, Ben Resner, Brad Koerner, XingChen Wang, and Hiroshi Ishii. 2001. LumiTouch: an emotional communication device. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 313--314. DOI: https://doiorg/10.1145/634067.634252",
      "doi": "10.1145/634067.634252"
    },
    {
      "text": "Chun-Yi Chen, Jodi Forlizzi, and Pamela Jennings. 2006. ComSlipper: an expressive design to support awareness and availability. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 369--374. DOI=http://doi.org/10.1145/1125451.1125531",
      "doi": "10.1145/1125451.1125531"
    },
    {
      "text": "Justin Cheng, Akshay Bapat, Gregory Thomas, Kevin Tse, Nikhil Nawathe, Jeremy Crockett, and Gilly Leshed. 2011. GoSlow: designing for slowness, reflection and solitude. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 429--438. DOI: https://doi.org/10.1145/1979742.1979622",
      "doi": "10.1145/1979742.1979622"
    },
    {
      "text": "Hyemin Chung, Chia-Hsun Jackie Lee, and Ted Selker. 2006. Lover's cups: drinking interfaces as new communication channels. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 375--380. DOI=http://doi.org/10.1145/1125451.1125532",
      "doi": "10.1145/1125451.1125532"
    },
    {
      "text": "Honglu Du, Kori Inkpen, Konstantinos Chorianopoulos, Mary Czerwinski, Paul Johns, Aaron Hoff, Asta Roseway, Sarah Morlidge, John Tang, and Tom Gross. 2011. VideoPal: exploring asynchronous video-messaging to enable crosscultural friendships. In ECSCW 2011: Proceedings of the 12th European Conference on Computer Supported Cooperative Work, 24--28 September 2011, Aarhus Denmark (pp. 273--292). Springer, London.",
      "doi": ""
    },
    {
      "text": "Azadeh Forghani, Carman Neustaedter, Manh C. Vu, Tejinder K. Judge, and Alissa N. Antle. 2018. G2G: The Design and Evaluation of a Shared Calendar and Messaging System for Grandparents and Grandchildren. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 155, 12 pages. DOI: https://doi.org/10.1145/3173574.3173729",
      "doi": "10.1145/3173574.3173729"
    },
    {
      "text": "Azadeh Forghani, Gina Venolia, and Kori Inkpen. 2014. Media2gether: Sharing Media during a Call. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14). ACM, NY, NY, USA, 142--151. DOI: https://doi.org/10.1145/2660398.2660417",
      "doi": "10.1145/2660398.2660417"
    },
    {
      "text": "Daniel Gooch and Leon Watts. 2012. YourGloves, hothands and hotmits: devices to hold hands at a distance. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 157--166. DOI: https://doi.org/10.1145/2380116.2380138",
      "doi": "10.1145/2380116.2380138"
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow Technology -- Designing for Reflection. Personal Ubiquitous Comput. 5, 3 (January 2001), 201--212. DOI=http://doi.org10.1007/PL00000019",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Richard Harper, Sean Rintel, Rod Watson, and Kenton O'Hara. 2017. The 'Interrogative Gaze':making video calling and messaging 'accountable', in Harper, R., Licoppe, C. & Watson, D., Pragmatics, Special Issue: Interpersonal video communication as a site of human sociality (2017) Vol 27: 3. September.",
      "doi": ""
    },
    {
      "text": "Dan Hawkins, Jason Procyk, and Carman Neustaedter. 2014. Postulater: slowing the pace of media sharing. In Proceedings of the 2014 companion publication on Designing interactive systems (DIS Companion '14). ACM, NY, NY, USA, 89--92.",
      "doi": "10.1145/2598784.2602790"
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. 2017. The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 675--687. DOI: https://doi.org/10.1145/3064663.3064759",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, Lillian Yang, and Thecla Schiphorst. 2017. Connecting Family Members Across Time Through Shared Media. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). Association for Computing Machinery, New York, NY, USA, 2630--2637. DOI: https://doi.org/10.1145/3027063.3053205",
      "doi": "10.1145/3027063.3053205"
    },
    {
      "text": "Yasamin Heshmat, Lillian Yang & Carman Neustaedter. 2018. Quality 'Alone' Time through Conversations and Storytelling: Podcast Listening Behaviors and Routine Proceedings of the Graphics Interface (GI) Conference. New York, NY, USA, ACM Press",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björnn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24. DOI=http://doi.org/10.1145/",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Kori Inkpen, Honglu Du, Asta Roseway, Aaron Hoff, and Paul Johns. 2012. Video kids: augmenting close friendships with asynchronous video conversations in videopal. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2387--2396. DOI: https://doi.org. /10.1145/2207676.2208400",
      "doi": "10.1145/2207676.2208400"
    },
    {
      "text": "Jasmine Jones, David Merritt, and Mark S. Ackerman. 2017. KidKeeper: Design for Capturing Audio Mementos of Everyday Life for Parents of Young Children. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 1864--1875. DOI: https://doi.org/10.1145/2998181.2998348",
      "doi": ""
    },
    {
      "text": "Tejinder K. Judge, Carman Neustaedter, and Andrew F. Kurtz. 2010. The family window: the design and evaluation of a domestic media space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2361--2370. DOI=http://doi.org/10.1145/1753326.175368",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Hyesook Kim, Andrew Monk, Gavin Wood, Mark Blythe, Jayne Wallace, and Patrick Olivier. 2013.\"TimelyPresent: Connecting families across continents.\" International Journal of HumanComputer Studies 71, no. 10 :1003--1011.",
      "doi": "10.1016/j.ijhcs.2013.05.001"
    },
    {
      "text": "Simon King and Jodi Forlizzi. 2007. Slow messaging: intimate communication for couples living at a distance. In Proceedings of the 2007 conference on Designing pleasurable products and interfaces (DPPI '07). ACM, NY, NY, USA, 451--454. DOI: https://doi.org/10.1145/1314161.1314204",
      "doi": "10.1145/1314161.1314204"
    },
    {
      "text": "David S. Kirk, Abigail Sellen, and Xiang Cao. 2010. Home video communication: mediating 'closeness'. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, NY, NY, USA, 135--144. DOI: https://doi.org/10.1145/1718918.1718945",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "Danielle Lottridge, Nicolas Masson, and Wendy Mackay. 2009. Sharing empty moments: design for remote couples. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 2329--2338. DOI: https://doi.org./10.1145/1518701.1519058",
      "doi": "10.1145/1518701.1519058"
    },
    {
      "text": "Michael Massimi and Carman Neustaedter. 2014. Moving from talking heads to newlyweds: exploring video chat use during major life events. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 43--52. DOI: https://doi.org/10.1145/2598510.2598570",
      "doi": "10.1145/2598510.2598570"
    },
    {
      "text": "Florian 'Floyd' Mueller, Frank Vetere, Martin R. Gibbs, Jesper Kjeldskov, Sonja Pedell, and Steve Howard. 2005. Hug over a distance. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1673--1676. DOI=10.1145/1056808.1056994",
      "doi": ""
    },
    {
      "text": "Mamoun Nawahdah and Tomoo Inoue. 2013. Virtually dining together in time-shifted environment: KIZUNA design. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 779--788. DOI=http://doi.org/10.1145/2441776.2441863",
      "doi": "10.1145/2441776.2441863"
    },
    {
      "text": "Carman Neustaedter, Kathryn Elliot, and Saul Greenberg. \"Interpersonal awareness in the domestic realm.\" In Proceedings of the 18th Australia conference on Computer-Human Interaction: Design: Activities, Artefacts and Environments, pp. 15--22. ACM, 2006.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Elena Fedorovskaya. 2009. Understanding and improving flow in digital photo ecosystems. In Proceedings of Graphics Interface 2009 (GI '09). Canadian Information Processing Society, Toronto, Ont., Canada, 191198.",
      "doi": "10.5555/1555880.1555922"
    },
    {
      "text": "Carman Neustaedter, Steve Harrison, and Abigail Sellen.2013. Connecting families: An introduction. In Connecting Families (pp. 1--12). Springer London.",
      "doi": ""
    },
    {
      "text": "William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: an Investigation of Experiences with FutureMe. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 575--584. DOI: https://doi.org./10.1145/2702123.2702221",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1053--1062. DOI: https://doi.org./10.1145/1518701.1518862",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and revisitation: a long term field study of the photobox. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1961--1970. DOI=https://doi.org/10.1145/2556288.2557178",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "William Odom, Ron Wakkary, Jeroen Hol, Bram Naus, Pepijn Verburg, Tal Amram, and Amy Yo Sue Chen. 2019. Investigating Slowness as a Frame to Design Longer-Term Experiences with Personal Data: A Field Study of Olly. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Paper 34, 16 pages. DOI: https://doi.org /10.1145/3290605.3300264",
      "doi": "10.1145/3290605.3300264"
    },
    {
      "text": "Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday dwelling with WhatsApp. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1131--1143. DOI: https://doi.org./10.1145/2531602.2531679",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Gerard Oleksik and Lorna M. Brown. 2008. Sonic gems: exploring the potential of audio recording as a form of sentimental memory capture. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction - Volume 1 (BCSHCI '08), Vol. 1. British Computer Society, Swinton, UK, UK, 163--172.",
      "doi": "10.5555/1531514.1531537"
    },
    {
      "text": "Gerard Oleksik, David Frohlich, Lorna M. Brown, and Abigail Sellen. 2008. Sonic interventions: understanding and extending the domestic soundscape. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1419--1428. DOI: 10.1145/1357054.1357277",
      "doi": "10.1145/1357054.1357277"
    },
    {
      "text": "Daniela Petrelli, Nicolas Villar, Vaiva Kalnikaite, Lina Dib, and Steve Whittaker. 2010. FM radio: family interplay with sonic mementos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2371--2380. DOI: https://doi.org/10.1145/1753326.1753683",
      "doi": "10.1145/1753326.1753683"
    },
    {
      "text": "Jeff Pittam. Voice in social interaction. Vol. 5. Sage, 1994.",
      "doi": ""
    },
    {
      "text": "Pousman, Zachary, and John Stasko. 2006. \"A taxonomy of ambient information systems: four patterns of design.\" In Proceedings of the working conference on Advanced visual interfaces, pp. 6774. ACM.",
      "doi": ""
    },
    {
      "text": "Jason Procyk, Carman Neustaedter, Carolyn Pang, Anthony Tang, and Tejinder K. Judge. 2014. Exploring video streaming in public settings: shared geocaching over distance using mobile video chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2163--2172. DOI: https://10.1145/2556288.2557198",
      "doi": ""
    },
    {
      "text": "Larissa Pschetz, and Michelle Bastian.2018. \"Temporal Design: Rethinking time in design.\" Design Studies 56 (2018): 169--184.",
      "doi": ""
    },
    {
      "text": "Natalia Romero, Panos Markopoulos, Joy Baren, Boris Ruyter, Wijnand Ijsselsteijn, and Babak Farshchian. 2007. Connecting the family with awareness systems. Personal Ubiquitous Comput. 11, 4 (April 2007), 299--312. DOI=http://doi.org/10.1007/s00779-006-0089-0",
      "doi": "10.1007/s00779-006-0089-0"
    },
    {
      "text": "Jim Rowan and Elizabeth D. Mynatt. 2005. Digital Family Portrait Field Trial: Support for Aging in Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 521--530. DOI: https://doi.org/10.1145/1054972.1055044",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Yee Loong Ooi, Alissa N. Antle, and Brendan Matkin. 2017. Flex-N-Feel: The Design and Evaluation of Emotive Gloves for Couples to Support Touch Over Distance. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 98--110. DOI: https://doi.org/10.1145/2998181.2998247",
      "doi": "10.1145/2998181.2998247"
    },
    {
      "text": "Kimberly Tee, AJ Bernheim Brush, and Kori M. Inkpen.2009. \"Exploring communication and sharing between extended families.\" International Journal of Human-Computer Studies 67, no. 2: 128--138.",
      "doi": "10.1016/j.ijhcs.2008.09.007"
    },
    {
      "text": "Hitomi Tsujita, Svetlana Yarosh, and Gregory D. Abowd. 2010. CU-Later: a communication system considering time difference. In Proceedings of the 12th ACM internatonal conference adjunct papers on Ubiquitous computing - Adjunct (UbiComp '10 Adjunct). ACM, NY, NY, USA, 435--436. DOI=http://doi.org/10.1145/1864431.1864474",
      "doi": ""
    },
    {
      "text": "Gina Venolia, John C. Tang, and Kori Inkpen. 2015. SeeSaw: I See You Saw My Video Message. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, NY, NY, USA, 244--253. DOI=http://doi.org/10.1145/2785830.2785847",
      "doi": "10.1145/2785830.2785847"
    },
    {
      "text": "AustraliaRené Vutborg, Jesper Kjeldskov, Jeni Paay, Sonja Pedell, and Frank Vetere. 2011. Supporting young children's communication with adult relatives across time zones. In Proceedings of the 23rd Australian Computer-Human Interaction Conference (OzCHI '11). ACM, NY, NY, USA, 291--300. DOI=http://doi.org/10.1145/2071536.2071583",
      "doi": "10.1145/2071536.2071583"
    },
    {
      "text": "Julia Werner, Reto Wettach, and Eva Hornecker. 2008. United-pulse: feeling your partner's pulse. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI '08). ACM, NY, NY, USA, 535--538. DOI=10.1145/1409240.1409338.",
      "doi": "10.1145/1409240.1409338"
    },
    {
      "text": "Bin Xu, Pamara Chang, Christopher L. Welker, Natalya N. Bazarova, and Dan Cosley. 2016. Automatic Archiving versus Default Deletion: What Snapchat Tells Us About Ephemerality in Design. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1662--1675. DOI: https://doi.org/10.1145/2818048.2819948",
      "doi": "10.1145/2818048.2819948"
    },
    {
      "text": "Svetlana Yarosh, and Gregory D. Abowd. \"Enriching virtual visitation in divorced families.\" In Connecting Families, pp. 75--93. Springer, London, 2013.",
      "doi": ""
    },
    {
      "text": "Rui Zhou, Zhonghe Wen, Muchao Tang, and Betsy DiSalvo. 2017. Navigating Media Use: Chinese Parents and Their Overseas Adolescent Children on WeChat. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 1025--1037. DOI: https://doi.org/10.1145/3064663.3064701",
      "doi": "10.1145/3064663.3064701"
    }
  ]
}