{
  "doi": "10.1145/3313831.3376335",
  "title": "Vibrotactile Funneling Illusion and Localization Performance on the Head",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "The vibrotactile funneling illusion is the sensation of a single (non-existing) stimulus somewhere in-between the actual stimulus locations. Its occurrence depends upon body location, distance between the actuators, signal synchronization, and intensity. Related work has shown that the funneling illusion may occur on the forehead. We were able to reproduce these findings and explored five further regions to get a more complete picture of the occurrence of the funneling illusion on the head. The results of our study (24 participants) show that the actuator distance, for which the funneling illusion occurs, strongly depends upon the head region. Moreover, we evaluated the centralizing bias (smaller perceived than actual actuator distances) for different head regions, which also showed widely varying characteristics. We computed a detailed heat map of vibrotactile localization accuracies on the head. The results inform the design of future tactile head-mounted displays that aim to support the funneling illusion.",
  "authors": [
    {
      "name": "Oliver Beren Kaul",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-99659019796/rel-imgonly/kaulberen2.jpg",
      "acmid": "99659019796",
      "orcid": "missing"
    },
    {
      "name": "Michael Rohs",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-81314494694/rel-imgonly/mr-120.jpg",
      "acmid": "81314494694",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Simon",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528885",
      "orcid": "missing"
    },
    {
      "name": "Kerem Can Demir",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527744",
      "orcid": "missing"
    },
    {
      "name": "Kamillo Ferry",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528648",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "David S. Alles. 1970. Information Transmission by Phantom Sensations. IEEE Transactions on Man-Machine Systems 11, 1 (1970), 85--91. DOI: http://dx.doi.org/10.1109/TMMS.1970.299967",
      "doi": ""
    },
    {
      "text": "Anonymous. 2019. Pigpio library. (2019). http://abyz.me.uk/rpi/pigpio/",
      "doi": ""
    },
    {
      "text": "Ahmad Barghout, Jongeun Cha, Abdulmotaleb El Saddik, Julius Kammerl, and Eckehard Steinbach. 2009. Spatial resolution of vibrotactile perception on the human forearm when exploiting funneling illusion. In 2009 IEEE International Workshop on Haptic Audio visual Environments and Games. IEEE, 19--23. DOI: http://dx.doi.org/10.1109/HAVE.2009.5356122",
      "doi": ""
    },
    {
      "text": "Christopher C. Berger and Mar Gonzalez-Franco. 2018. Expanding the sense of touch outside the body. Proceedings - SAP 2018: ACM Symposium on Applied Perception (2018). DOI: http://dx.doi.org/10.1145/3225153.3225172",
      "doi": ""
    },
    {
      "text": "Matthias Berning, Florian Braun, Till Riedel, and Michael Beigl. 2015. ProximityHat. In Proceedings of the 2015 ACM International Symposium on Wearable Computers - ISWC '15. ACM Press, New York, New York, USA, 31--38. DOI: http://dx.doi.org/10.1145/2802083.2802088",
      "doi": ""
    },
    {
      "text": "Alvaro Cassinelli, Carson Reynolds, and Masatoshi Ishikawa. 2007. Augmenting spatial awareness with haptic radar. Proceedings - International Symposium on Wearable Computers, ISWC (2007), 61--64. DOI: http://dx.doi.org/10.1109/ISWC.2006.286344",
      "doi": ""
    },
    {
      "text": "Jongeun Cha, Lara Rahal, and Abdulmotaleb El Saddik. 2008. A pilot study on simulating continuous sensation with two vibrating motors. In 2008 IEEE International Workshop on Haptic Audio visual Environments and Games. IEEE, 143--147. DOI: http://dx.doi.org/10.1109/HAVE.2008.4685314",
      "doi": ""
    },
    {
      "text": "Victor Adriel de Jesus Oliveira, Luca Brayda, Luciana Nedel, and Anderson Maciel. 2017. Designing a Vibrotactile Head-Mounted Display for Spatial Awareness in 3D Spaces. IEEE Transactions on Visualization and Computer Graphics 23, 4 (apr 2017), 1409--1417. DOI: http://dx.doi.org/10.1109/TVCG.2017.2657238",
      "doi": "10.1109/TVCG.2017.2657238"
    },
    {
      "text": "Victor Adriel De Jesus Oliveira, Luciana Nedel, Anderson Maciel, and Luca Brayda. 2016. Spatial discrimination of vibrotactile stimuli around the head. In IEEE Haptics Symposium, HAPTICS. DOI: http://dx.doi.org/10.1109/HAPTICS.2016.7463147",
      "doi": ""
    },
    {
      "text": "Vincent Diener, Michael Beigl, Matthias Budde, and Erik Pescara. 2017. VibrationCap. In Proceedings of the 2017 ACM International Symposium on Wearable Computers - ISWC '17. ACM Press, New York, New York, USA, 82--89. DOI: http://dx.doi.org/10.1145/3123021.3123047",
      "doi": ""
    },
    {
      "text": "Michal Karol Dobrzynski, Seifeddine Mejri, Steffen Wischmann, and Dario Floreano. 2012. Quantifying Information Transfer Through a Head-Attached Vibrotactile Display: Principles for Design and Control. IEEE Transactions on Biomedical Engineering 59, 7 (jul 2012), 2011--2018. DOI: http://dx.doi.org/10.1109/TBME.2012.2196433",
      "doi": ""
    },
    {
      "text": "Frank A. Geldard. 1957. Adventures in tactile literacy. American Psychologist 12, 3 (1957), 115--124.",
      "doi": ""
    },
    {
      "text": "Kirby Gilliland and Robert E. Schlegel. 1994. Tactile Stimulation of the Human Head for Information Display. Human Factors: The Journal of the Human Factors and Ergonomics Society 36, 4 (1994), 700--717. DOI: http://dx.doi.org/10.1177/001872089403600410",
      "doi": ""
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011a. Control space of apparent haptic motion. 2011 IEEE World Haptics Conference, WHC 2011 (2011), 457--462. DOI: http://dx.doi.org/10.1109/WHC.2011.5945529",
      "doi": ""
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011b. Tactile brush. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11. ACM Press, New York, New York, USA, 2019. DOI: http://dx.doi.org/10.1145/1978942.1979235",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Jeonggoo Kang, Kwangsu Cho, Heewon Kim, Semyung Wang, Jongsuh Lee, and Jeha Ryu. 2012. Smooth Vibrotactile Flow Generation Using Two Piezoelectric Actuators. IEEE Transactions on Haptics 5, 1 (2012), 21--32. DOI: http://dx.doi.org/10.1109/toh.2012.1",
      "doi": "10.1109/TOH.2012.1"
    },
    {
      "text": "Lynette A. Jones and Nadine B. Sarter. 2008. Tactile Displays: Guidance for Their Design and Application. Human Factors: The Journal of the Human Factors and Ergonomics Society 50, 1 (feb 2008), 90--111. DOI: http://dx.doi.org/10.1518/001872008X250638",
      "doi": ""
    },
    {
      "text": "Jeonggoo Kang, Junghwan Kook, Kwangsu Cho, Semyung Wang, and Jeha Ryu. 2012. Effects of amplitude modulation on vibrotactile fow displays on piezo-actuated thin touch screen. International Journal of Control, Automation and Systems 10, 3 (2012), 582--588. DOI: http://dx.doi.org/10.1007/s12555-012-0315--7",
      "doi": ""
    },
    {
      "text": "Oliver Beren Kaul, Leonard Hansing, and Michael Rohs. 2019. 3DTactileDraw. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA '19. ACM Press, New York, New York, USA, 1--6. DOI: http://dx.doi.org/10.1145/3290607.3313030",
      "doi": "10.1145/3290607.3313030"
    },
    {
      "text": "Oliver Beren Kaul, Kevin Meier, and Michael Rohs. 2017. Increasing Presence in Virtual Reality with a Vibrotactile Grid Around the Head. Springer International Publishing, Cham, 289--298. DOI: http://dx.doi.org/10.1007/978--3--319--68059-0_19",
      "doi": "10.1007/978-3-319-68059-0_19"
    },
    {
      "text": "Oliver Beren Kaul, Max Pfeiffer, and Michael Rohs. 2016. Follow the Force. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 2526--2532. DOI: http://dx.doi.org/10.1145/2851581.2892352",
      "doi": "10.1145/2851581.2892352"
    },
    {
      "text": "Oliver Beren Kaul and Michael Rohs. 2017. HapticHead: A Spherical Vibrotactile Grid around the Head for 3D Guidance in Virtual and Augmented Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 3729--3740. DOI: http://dx.doi.org/10.1145/3025453.3025684",
      "doi": "10.1145/3025453.3025684"
    },
    {
      "text": "Hamideh Kerdegari, Yeongmi Kim, and Tony J. Prescott. 2016. Head-Mounted Sensory Augmentation Device: Comparing Haptic and Audio Modality. Springer International Publishing, 107--118. DOI: http://dx.doi.org/10.1007/978--3--319--42417-0_11",
      "doi": ""
    },
    {
      "text": "Hamideh Kerdegari, Yeongmi Kim, Tom Stafford, and Tony J. Prescott. 2014. Centralizing bias and the vibrotactile funneling illusion on the forehead. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artifcial Intelligence and Lecture Notes in Bioinformatics), Vol. 8619. Springer Verlag, 55--62.",
      "doi": ""
    },
    {
      "text": "M Kim, A Abdulali, and S Jeon. 2018. Rendering Vibrotactile Flow on Backside of the Head: Initial Study. In 2018 IEEE Games, Entertainment, Media Conference (GEM). 1--250. DOI: http://dx.doi.org/10.1109/GEM.2018.8516545",
      "doi": ""
    },
    {
      "text": "Sang Youn Kim and Jeong Cheol Kim. 2012. Vibrotactile rendering for a traveling vibrotactile wave based on a haptic processor. IEEE Transactions on Haptics 5, 1 (2012), 14--20. DOI: http://dx.doi.org/10.1109/TOH.2011.72",
      "doi": "10.1109/TOH.2011.72"
    },
    {
      "text": "Sang Youn Kim, Jae Oh Kim, and Kyu Yong Kim. 2009. Traveling vibrotactile wave - A new vibrotactile rendering method for mobile devices. IEEE Transactions on Consumer Electronics 55, 3 (2009), 1032--1038. DOI: http://dx.doi.org/10.1109/TCE.2009.5277952",
      "doi": "10.1109/TCE.2009.5277952"
    },
    {
      "text": "Youngsun Kim, Jaedong Lee, and Gerard J. Kim. 2015a. Designing of 2D illusory tactile feedback for hand-held tablets. Lecture Notes in Computer Science (including subseries Lecture Notes in Artifcial Intelligence and Lecture Notes in Bioinformatics) 9299 (2015), 10--17. DOI: http://dx.doi.org/10.1007/978--3--319--22723--8_2",
      "doi": ""
    },
    {
      "text": "Youngsun Kim, Jaedong Lee, and Gerard J. Kim. 2015b. Extending \"out of the body\" tactile phantom sensations to 2D and applying it to mobile interaction. Personal and Ubiquitous Computing 19, 8 (2015), 1295--1311. DOI: http://dx.doi.org/10.1007/s00779-015-0894--4",
      "doi": "10.1007/s00779-015-0894-4"
    },
    {
      "text": "Youngsun Kim, Jaedong Lee, and Gerard Jounghyun Kim. 2017. Design and application of 2D illusory vibrotactile feedback for hand-held tablets. Journal on Multimodal User Interfaces 11, 2 (2017), 133--148. DOI: http://dx.doi.org/10.1007/s12193-016-0234--7",
      "doi": ""
    },
    {
      "text": "Jaedong Lee, Youngsun Kim, and Gerard Kim. 2012. Funneling and saltation effects for tactile interaction with virtual objects. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '12 (2012), 3141--3148. DOI: http://dx.doi.org/10.1145/2207676.2208729",
      "doi": "10.1145/2207676.2208729"
    },
    {
      "text": "Jaedong Lee, Youngsun Kim, and Gerard J. Kim. 2015. Applying \"Out of Body\" Vibrotactile illusion to Two-Finger interaction for perception of object Dynamics. Lecture Notes in Computer Science (including subseries Lecture Notes in Artifcial Intelligence and Lecture Notes in Bioinformatics) 9299 (2015), 506--509. DOI: http://dx.doi.org/10.1007/978--3--319--22723--8_49",
      "doi": ""
    },
    {
      "text": "M. Miyazaki, M. Hirashima, and D. Nozaki. 2010. The \"Cutaneous Rabbit\" Hopping out of the Body. Journal of Neuroscience 30, 5 (2010), 1856--1860. DOI: http://dx.doi.org/10.1523/jneurosci.3887-09.2010",
      "doi": ""
    },
    {
      "text": "Kimberly Myles and Joel T. Kalb. 2009. Vibrotactile Sensitivity of the Head. (2009).",
      "doi": ""
    },
    {
      "text": "Kimberly Myles and Joel T. Kalb. 2010. Guidelines for Head Tactile Communication. March (2010). http://oai.dtic.mil/oai/oai?verb=getRecord",
      "doi": ""
    },
    {
      "text": "K. Myles and J. T. Kalb. 2013. Head Tactile Communication: Promising Technology With the Design of a Head-Mounted Tactile Display. Ergonomics in Design: The Quarterly of Human Factors Applications 21, 2 (apr 2013), 4--8. DOI: http://dx.doi.org/10.1177/1064804613477861",
      "doi": ""
    },
    {
      "text": "Kimberly Myles, Joel T. Kalb, Janea Lowery, and Bheem P. Kattel. 2015. The effect of hair density on the coupling between the tactor and the skin of the human head. Applied Ergonomics 48 (2015), 177--185. DOI: http://dx.doi.org/10.1016/j.apergo.2014.11.007",
      "doi": ""
    },
    {
      "text": "Tomi Nukarinen, Jussi Rantala, Ahmed Farooq, and Roope Raisamo. 2015. Delivering directional haptic cues through eyeglasses and a seat. In 2015 IEEE World Haptics Conference (WHC). IEEE, 345--350. DOI: http://dx.doi.org/10.1109/WHC.2015.7177736",
      "doi": ""
    },
    {
      "text": "Gunhyuk Park and Seungmoon Choi. 2018. Tactile Information Transmission by 2D Stationary Phantom Sensations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. DOI: http://dx.doi.org/10.1145/3173574.3173832",
      "doi": "10.1145/3173574.3173832"
    },
    {
      "text": "Jaeyoung Park, Jaeha Kim, Yonghwan Oh, and Hong Z. Tan. 2016. Rendering moving tactile stroke on the palm using a sparse 2D array. Lecture Notes in Computer Science (including subseries Lecture Notes in Artifcial Intelligence and Lecture Notes in Bioinformatics) 9774 (2016), 47--56. DOI: http://dx.doi.org/10.1007/978--3--319--42321-0_5",
      "doi": ""
    },
    {
      "text": "Dario Pittera, Marianna Obrist, and Ali Israr. 2017. Hand-to-hand: an intermanual illusion of movement. Proceedings of the 19th ACM International Conference on Multimodal Interaction (2017), 73--81. DOI: http://dx.doi.org/10.1145/3136755.3136777",
      "doi": "10.1145/3136755.3136777"
    },
    {
      "text": "Jukka Raisamo, Roope Raisamo, and Veikko Surakka. 2009. Evaluating the effect of temporal parameters for vibrotactile saltatory patterns. (2009), 319. DOI: http://dx.doi.org/10.1145/1647314.1647381",
      "doi": ""
    },
    {
      "text": "Jukka Raisamo, Roope Raisamo, and V. Surakka. 2013. Comparison of Saltation, Amplitude Modulation, and a Hybrid Method of Vibrotactile Stimulation. IEEE Transactions on Haptics 6, 4 (2013), 517--521. DOI: http://dx.doi.org/10.1109/TOH.2013.25",
      "doi": "10.1109/TOH.2013.25"
    },
    {
      "text": "Dongseok Ryu, Gi Hun Yang, and Sungchul Kang. 2009. T-hive : Vibrotactile Interface Presenting Spatial Information on Handle Surface. Proceedings - IEEE International Conference on Robotics and Automation (2009), 683--688. DOI: http://dx.doi.org/10.1109/ROBOT.2009.5152740",
      "doi": ""
    },
    {
      "text": "Jongman Seo and Seungmoon Choi. 2013. Perceptual analysis of vibrotactile fows on a mobile device. IEEE Transactions on Haptics 6, 4 (2013), 522--527. DOI: http://dx.doi.org/10.1109/TOH.2013.24",
      "doi": "10.1109/TOH.2013.24"
    },
    {
      "text": "Jongman Seo and Seungmoon Choi. 2015. Edge fows: Improving information transmission in mobile devices using two-dimensional vibrotactile fows. IEEE World Haptics Conference, WHC 2015 (2015), 25--30. DOI: http://dx.doi.org/10.1109/WHC.2015.7177686",
      "doi": ""
    },
    {
      "text": "Katherine O. Sofa and Lynette Jones. 2013. Mechanical and psychophysical studies of surface wave propagation during vibrotactile stimulation. IEEE Transactions on Haptics 6, 3 (2013), 320--329. DOI: http://dx.doi.org/10.1109/TOH.2013.1",
      "doi": "10.1109/TOH.2013.1"
    },
    {
      "text": "Unity Technologies. 2019. Unity - Game Engine. (2019). https://unity3d.com/",
      "doi": ""
    },
    {
      "text": "Gi Hun Yang, Moon Sub Jin, Yeonsub Jin, and Sungchul Kang. 2010. T-mobile: Vibrotactile display pad with spatial and directional information for hand-held device. IEEE/RSJ 2010 International Conference on Intelligent Robots and Systems, IROS 2010 - Conference Proceedings (2010), 5245--5250. DOI: http://dx.doi.org/10.1109/IROS.2010.5651759",
      "doi": ""
    },
    {
      "text": "Gi Hun Yang, Dongseok Ryu, and Sungchul Kang. 2009. Vibrotactile display for hand-held input device providing spatial and directional information. Proceedings - 3rd Joint EuroHaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, World Haptics 2009 (2009), 79--84. DOI: http://dx.doi.org/10.1109/WHC.2009.4810831",
      "doi": "10.1109/WHC.2009.4810831"
    },
    {
      "text": "Koji Yatani and KN Truong. 2009. SemFeel: a user interface with semantic tactile feedback for mobile touch-screen devices. 22nd annual ACM symposium on User interface (2009), 111--120. http://portal.acm.org/citation.cfm?id=1622198",
      "doi": "10.1145/1622176.1622198"
    },
    {
      "text": "Siyan Zhao, Ali Israr, and Roberta Klatzky. 2015. Intermanual apparent tactile motion on handheld tablets. IEEE World Haptics Conference, WHC 2015 (2015), 241--247. DOI: http://dx.doi.org/10.1109/WHC.2015.7177720",
      "doi": ""
    }
  ]
}