{
  "doi": "10.1145/3313831.3376446",
  "title": "Recognizing Affiliation: Using Behavioural Traces to Predict the Quality of Social Interactions in Online Games",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [],
  "abstract": "Online social interactions in multiplayer games can be supportive and positive or toxic and harmful; however, few methods can easily assess interpersonal interaction quality in games. We use behavioural traces to predict affiliation between dyadic strangers, facilitated through their social interactions in an online gaming setting. We collected audio, video, in-game, and self-report data from 23 dyads, extracted 75 features, trained Random Forest and Support Vector Machine models, and evaluated their performance predicting binary (high/low) as well as continuous affiliation toward a partner. The models can predict both binary and continuous affiliation with up to 79.1% accuracy (F1) and 20.1% explained variance (R2) on unseen data, with features based on verbal communication demonstrating the highest potential. Our findings can inform the design of multiplayer games and game communities, and guide the development of systems for matchmaking and mitigating toxic behaviour in online games.",
  "authors": [
    {
      "name": "Julian Frommel",
      "institution": "Ulm University & University of Saskatchewan, Ulm, Germany",
      "img": "/do/10.1145/contrib-88159458857/rel-imgonly/jf_2020_12_17_400x400.jpg",
      "acmid": "88159458857",
      "orcid": "missing"
    },
    {
      "name": "Valentin Sagl",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529226",
      "orcid": "missing"
    },
    {
      "name": "Ansgar E. Depping",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022433",
      "orcid": "missing"
    },
    {
      "name": "Colby Johanson",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019578",
      "orcid": "missing"
    },
    {
      "name": "Matthew K. Miller",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958615957",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rajendra D. Badgaiyan. 2010. Dopamine is released in the striatum during human emotional processing. Neuroreport 21, 18 (2010), 1172. DOI: http://dx.doi.org/10.1097/wnr.0b013e3283410955",
      "doi": ""
    },
    {
      "text": "Marian Stewart Bartlett, Gianluca Donato, Javier R Movellan, Joseph C Hager, Paul Ekman, and Terrence J Sejnowski. 1999. Face image analysis for expression measurement and detection of deceit. In Proceedings of the sixth joint symposium on neural computation. 8--15.",
      "doi": ""
    },
    {
      "text": "Claudia Beleites, Richard Baumgartner, Christopher Bowman, Ray Somorjai, Gerald Steiner, Reiner Salzer, and Michael G. Sowa. 2005. Variance reduction in estimating classification error using sparse datasets. Chemometrics and Intelligent Laboratory Systems 79, 1 (2005), 91 -- 100. DOI: http://dx.doi.org/10.1016/j.chemolab.2005.04.008",
      "doi": ""
    },
    {
      "text": "Alessio Benavoli, Giorgio Corani, Janez Demar, and Marco Zaffalon. 2017. Time for a change: a tutorial for comparing multiple classifiers through Bayesian analysis. The Journal of Machine Learning Research 18, 1 (2017), 2653--2688.",
      "doi": "10.5555/3122009.3176821"
    },
    {
      "text": "Dianne Bevelander and Michael John Page. 2011. Ms. Trust: Gender, Networks and Trust--Implications for Management and Education. Academy of Management Learning & Education 10, 4 (2011), 623--642. DOI: http://dx.doi.org/10.5465/amle.2009.0138",
      "doi": ""
    },
    {
      "text": "Remco R Bouckaert. 2003. Choosing between two learning algorithms based on calibrated tests. In ICML, Vol. 3. 51--58.",
      "doi": ""
    },
    {
      "text": "Leo Breiman. 2001. Random forests. Machine Learning 45, 1 (2001), 5--32.",
      "doi": "10.1023/a%3A1010933404324"
    },
    {
      "text": "Jason Brownlee. 2014. How To Get Baseline Results And Why They Matter. https://machinelearningmastery.com/how-to-get-baselineresults-and-why-they-matter/. Accessed: 2019-09--11. (2014).",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data? Perspectives on Psychological Science 6, 1 (2011), 3--5. DOI: http://dx.doi.org/10.1177/1745691610393980 PMID: 26162106.",
      "doi": ""
    },
    {
      "text": "Stef van Buuren and Karin Groothuis-Oudshoorn. 2010. mice: Multivariate imputation by chained equations in R. Journal of statistical software (2010), 1--68. DOI: http://dx.doi.org/10.18637/jss.v045.i03",
      "doi": ""
    },
    {
      "text": "Rickard Carlsson, Ulrich Schimmack, Donald R. Williams, and Paul-Christian Bürkner. 2017. Bayes Factors From Pooled Data Are No Substitute for Bayesian Meta-Analysis: Commentary on Scheibehenne, Jamil, and Wagenmakers (2016). Psychological Science 28, 11 (2017), 1694--1697. DOI: http://dx.doi.org/10.1177/0956797616684682 PMID: 28910202.",
      "doi": ""
    },
    {
      "text": "Guillaume Chanel, Cyril Rebetez, Mireille Bétrancourt, and Thierry Pun. 2008. Boredom, Engagement and Anxiety as Indicators for Adaptation to Difficulty in Games. In Proceedings of the 12th international conference on Entertainment and media in the ubiquitous era. ACM, 13--17. DOI: http://dx.doi.org/10.1145/1457199.1457203",
      "doi": "10.1145/1457199.1457203"
    },
    {
      "text": "Guillaume Chanel, Cyril Rebetez, Mireille Bétrancourt, and Thierry Pun. 2011. Emotion assessment from physiological signals for adaptation of game difficulty. IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans 41, 6 (2011), 1052--1063. DOI: http://dx.doi.org/10.1109/tsmca.2011.2116000",
      "doi": "10.1109/TSMCA.2011.2116000"
    },
    {
      "text": "François Chollet and others. 2015. Keras. https://keras.io. (2015).",
      "doi": ""
    },
    {
      "text": "April K. Clark and Marie A. Eisenstein. 2013. Interpersonal trust: An age-period-cohort analysis revisited. Social Science Research 42, 2 (2013), 361 -- 375. DOI: http://dx.doi.org/10.1016/j.ssresearch.2012.09.006",
      "doi": ""
    },
    {
      "text": "Adam Cook. 2018. How games as a service are changing the way we play. https://www.redbull.com/ie-en/games-asa-service-changing-gaming-forever. Accessed: 2019-09--18. (2018).",
      "doi": ""
    },
    {
      "text": "Corinna Cortes and Vladimir Vapnik. 1995. Support-vector networks. Machine Learning 20, 3 (1995), 273--297.",
      "doi": ""
    },
    {
      "text": "Roddy Cowie, Ellen Douglas-Cowie, Nicolas Tsapatsoulis, George Votsis, Stefanos Kollias, Winfried Fellenz, and John G Taylor. 2001. Emotion recognition in human-computer interaction. IEEE Signal processing magazine 18, 1 (2001), 32--80.",
      "doi": ""
    },
    {
      "text": "Rachel Croson and Uri Gneezy. 2009. Gender differences in preferences. Journal of Economic literature 47, 2 (2009), 448--74.",
      "doi": ""
    },
    {
      "text": "Frederik De Grove, Johannes Breuer, Vivian Hsueh Hua Chen, Thorsten Quandt, Rabindra Ratan, and Jan Van Looy. 2017. Validating the digital games motivation scale for comparative research between countries. Communication Research Reports 34, 1 (2017), 37--47. DOI: http://dx.doi.org/10.1080/08824096.2016.1250070",
      "doi": ""
    },
    {
      "text": "Janez Dem?ar. 2006. Statistical comparisons of classifiers over multiple data sets. Journal of Machine Learning Research 7, Jan (2006), 1--30.",
      "doi": ""
    },
    {
      "text": "Ansgar E Depping, Colby Johanson, and Regan L Mandryk. 2018. Designing for Friendship: Modeling Properties of Play, In-Game Social Capital, and Psychological Well-being. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, 87--100.",
      "doi": "10.1145/3242671.3242702"
    },
    {
      "text": "Ansgar E. Depping and Regan L. Mandryk. 2017. Cooperation and Interdependence: How Multiplayer Games Increase Social Closeness. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '17. ACM Press. DOI: http://dx.doi.org/10.1145/3116595.3116639",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping, Regan L. Mandryk, Colby Johanson, Jason T. Bowey, and Shelby C. Thomson. 2016. Trust Me: Social Games Are Better Than Social Icebreakers at Building Trust. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 116--129. DOI: http://dx.doi.org/10.1145/2967934.2968097",
      "doi": ""
    },
    {
      "text": "Thomas G Dietterich. 1998. Approximate statistical tests for comparing supervised classification learning algorithms. Neural computation 10, 7 (1998), 1895--1923. DOI: http://dx.doi.org/10.1162/089976698300017197",
      "doi": ""
    },
    {
      "text": "Josep Domingo-Ferrer. 2009. The functionality-security-privacy game. In International Conference on Modeling Decisions for Artificial Intelligence. Springer, 92--101.",
      "doi": "10.1007/978-3-642-04820-3_9"
    },
    {
      "text": "Jennifer R Dunn and Maurice E Schweitzer. 2005. Feeling and believing: the influence of emotion on trust. Journal of personality and social psychology 88, 5 (2005), 736. DOI: http://dx.doi.org/10.1037/e617892011-029",
      "doi": ""
    },
    {
      "text": "Mark G. Ehrhart, Karen Holcombe Ehrhart, Scott C. Roesch, Beth G Chung-Herrera, Kristy Nadler, and Kelsey Bradshaw. 2009. Testing the latent factor structure and construct validity of the Ten-Item Personality Inventory. Personality and individual Differences 47, 8 (2009), 900--905. DOI: http://dx.doi.org/10.1016/j.paid.2009.07.012",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1992. An argument for basic emotions. Cognition & emotion 6, 3--4 (1992), 169--200.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace Friesen. 1978. Facial action coding system: a technique for the measurement of facial movement. Consulting Psychologists, San Francisco (1978).",
      "doi": ""
    },
    {
      "text": "Entertainment Software Association. 2017. Essential Facts About the Computer and Video Game Industry. (2017).",
      "doi": ""
    },
    {
      "text": "Anthony M Evans and William Revelle. 2008. Survey and behavioral measurements of interpersonal trust. Journal of Research in Personality 42, 6 (2008), 1585--1593.",
      "doi": ""
    },
    {
      "text": "Chek Yang Foo and Elina M. I. Koivisto. 2004. Defining Grief Play in MMORPGs: Player and Developer Perceptions. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, NY, NY, USA, 245--250. DOI: http://dx.doi.org/10.1145/1067343.1067375",
      "doi": "10.1145/1067343.1067375"
    },
    {
      "text": "Nikos Fragopanagos and John G Taylor. 2005. Emotion recognition in human--computer interaction. Neural Networks 18, 4 (2005), 389--405. DOI: http://dx.doi.org/10.1016/j.neunet.2005.03.006",
      "doi": "10.1016/j.neunet.2005.03.006"
    },
    {
      "text": "Julian Frommel, Katja Rogers, Julia Brich, Daniel Besserer, Leonard Bradatsch, Isabel Ortinau, Ramona Schabenberger, Valentin Riemer, Claudia Schrader, and Michael Weber. 2015. Integrated questionnaires: maintaining presence in game environments for self-reported data acquisition. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, 359--368. DOI: http://dx.doi.org/10.1145/2793107.2793130",
      "doi": "10.1145/2793107.2793130"
    },
    {
      "text": "Julian Frommel, Claudia Schrader, and Michael Weber. 2018. Towards Emotion-based Adaptive Games: Emotion Recognition Via Input and Performance Features. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 173--185. DOI: http://dx.doi.org/10.1145/3242671.3242672",
      "doi": "10.1145/3242671.3242672"
    },
    {
      "text": "Maria Frostling-Henningsson. 2009. First-person shooter games as a way of connecting to people:\"Brothers in blood\". CyberPsychology & Behavior 12, 5 (2009), 557--562. DOI: http://dx.doi.org/10.1089/cpb.2008.0345",
      "doi": ""
    },
    {
      "text": "Darren George and Paul Mallery. 1999. SPSS for Windows Step by Step: A simple guide and reference. Allyn & Bacon.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert and Karrie Karahalios. 2009. Predicting tie strength with social media. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 211--220.",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Isabelle Guyon, Jason Weston, Stephen Barnhill, and Vladimir Vapnik. 2002. Gene selection for cancer classification using support vector machines. Machine Learning 46, 1--3 (2002), 389--422.",
      "doi": "10.1023/A%3A1012487302797"
    },
    {
      "text": "John Harris and Mark Hancock. 2019. To Asymmetry and Beyond!: Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 9, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300239",
      "doi": "10.1145/3290605.3300239"
    },
    {
      "text": "Robin Hunicke. 2005. The case for dynamic difficulty adjustment in games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology. ACM, 429--433. DOI: http://dx.doi.org/10.1145/1178477.1178573",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "Isto Huvila, Kim Holmberg, Stefan Ek, and Gunilla Widén-Wulff. 2010. Social capital in second life. Online Information Review 34, 2 (2010), 295--316.",
      "doi": ""
    },
    {
      "text": "Itseez. 2015. Open Source Computer Vision Library. https://github.com/itseez/opencv. (2015).",
      "doi": ""
    },
    {
      "text": "Jeroen Jansz and Lonneke Martens. 2005. Gaming at a LAN event: the social context of playing video games. New media & society 7, 3 (2005), 333--355. DOI: http://dx.doi.org/10.1177/1461444805052280",
      "doi": ""
    },
    {
      "text": "Jeroen Jansz and Martin Tanis. 2007. Appeal of playing online first person shooter games. Cyberpsychology & behavior 10, 1 (2007), 133--136. DOI: http://dx.doi.org/10.1089/cpb.2006.9981",
      "doi": ""
    },
    {
      "text": "Sirkka L Jarvenpaa and Dorothy E Leidner. 1999. Communication and trust in global virtual teams. Organization science 10, 6 (1999), 791--815. DOI: http://dx.doi.org/10.1111/j.1083--6101.1998.tb00080.x",
      "doi": "10.1287/orsc.10.6.791"
    },
    {
      "text": "JASP Team. 2018. JASP (Version 0.9)[Computer software]. (2018). https://jasp-stats.org/",
      "doi": ""
    },
    {
      "text": "Harold Jeffreys. 1961. Theory of Probability (3rd ed. ed.). Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Cynthia Johnson-George and Walter C Swap. 1982. Measurement of specific interpersonal trust: Construction and validation of a scale to assess trust in a specific other. Journal of personality and Social Psychology 43, 6 (1982), 1306. DOI: http://dx.doi.org/10.1037/0022--3514.43.6.1306",
      "doi": ""
    },
    {
      "text": "Adam N Joinson, Ulf-Dietrich Reips, Tom Buchanan, and Carina B Paine Schofield. 2010. Privacy, trust, and self-disclosure online. Human--Computer Interaction 25, 1 (2010), 1--24.",
      "doi": ""
    },
    {
      "text": "Bryant J Jongkees and Lorenza S Colzato. 2016. Spontaneous eye blink rate as predictor of dopamine-related cognitive function--A review. Neuroscience & Biobehavioral Reviews 71 (2016), 58--82. DOI: http://dx.doi.org/10.1016/j.neubiorev.2016.08.020",
      "doi": ""
    },
    {
      "text": "Jeff Kaplan. 2017. Developer Update | Play Nice, Play Fair | Overwatch (Online Video). (2017). https://www.youtube.com/watch?v=rnfzzz8pIBE",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453--456. DOI: http://dx.doi.org/10.1145/1357054.1357127",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Ron Kohavi. 1995. A study of cross-validation and bootstrap for accuracy estimation and model selection. In International Joint Conference on Artificial Intelligence, Vol. 14. Montreal, Canada, 1137--1145.",
      "doi": ""
    },
    {
      "text": "Igor Kononenko and Matja Kukar. 2007. Machine learning and data mining: introduction to principles and algorithms. Horwood Publishing.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2014. Playing with Strangers: Understanding Temporary Teams in League of Legends. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 161--169. DOI: http://dx.doi.org/10.1145/2658537.2658538",
      "doi": "10.1145/2658537.2658538"
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring cyberbullying and other toxic behavior in team competition online games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3739--3748. DOI: http://dx.doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Robert E. Larzelere and Ted L. Huston. 1980. The Dyadic Trust Scale: Toward Understanding Interpersonal Trust in Close Relationships. Journal of Marriage and Family 42, 3 (1980), 595--604. http://www.jstor.org/stable/351903",
      "doi": ""
    },
    {
      "text": "Michael D Lee and Eric-Jan Wagenmakers. 2013. Bayesian cognitive modeling: A practical course. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Yannick LeJacq. 2015. League Of Legends Is Bringing Back An Old System To Deal With Jerks. https://kotaku.com/league-of-legends-is-bringing-backan-old-system-to-dea-1702108970. (2015). Accessed: 2018-09--12.",
      "doi": ""
    },
    {
      "text": "Changchun Liu, Pramila Agrawal, Nilanjan Sarkar, and Shuo Chen. 2009. Dynamic difficulty adjustment in computer games through real-time anxiety-based affective feedback. International Journal of Human-Computer Interaction 25, 6 (2009), 506--529. DOI: http://dx.doi.org/10.1080/10447310902963944",
      "doi": ""
    },
    {
      "text": "Ricardo Lopes and Rafael Bidarra. 2011. Adaptivity challenges in games and simulations: a survey. IEEE Transactions on Computational Intelligence and AI in Games 3, 2 (2011), 85--99. DOI: http://dx.doi.org/10.1109/tciaig.2011.2152841",
      "doi": ""
    },
    {
      "text": "Luis López, Miguel París, Santiago Carot, Boni García, Micael Gallego, Francisco Gortázar, Raul Benítez, Jose A. Santos, David Fernández, Radu Tom Vlad, Iván Gracia, and Francisco Javier López. 2016. Kurento: The WebRTC Modular Media Server. In Proceedings of the 2016 ACM on Multimedia Conference (MM '16). ACM, NY, NY, USA, 1187--1191. DOI: http://dx.doi.org/10.1145/2964284.2973798",
      "doi": "10.1145/2964284.2973798"
    },
    {
      "text": "Thomas W. Malone. 1980. What makes things fun to learn? Heuristics for designing instructional computer games. In Proceedings of the 3rd ACM SIGSMALL symposium and the first SIGPC symposium on Small systems. ACM, 162--169. DOI: http://dx.doi.org/10.1145/800088.802839",
      "doi": "10.1145/800088.802839"
    },
    {
      "text": "Regan L. Mandryk. 2005. Modeling user emotion in interactive play environments: A fuzzy physiological approach. Ph.D. Dissertation. School of Computing Science-Simon Fraser University.",
      "doi": "10.5555/1237311"
    },
    {
      "text": "Regan L. Mandryk and M. Stella Atkins. 2007. A fuzzy physiological approach for continuously modeling emotion during interaction with play technologies. International Journal of Human-Computer Studies 65, 4 (2007), 329 -- 347. DOI: http://dx.doi.org/j.ijhcs.2006.11.011 Evaluating affective interactions.",
      "doi": "10.1016/j.ijhcs.2006.11.011"
    },
    {
      "text": "Regan L. Mandryk, M. Stella Atkins, and Kori M. Inkpen. 2006. A Continuous and Objective Evaluation of Emotional Experience with Interactive Play Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1027--1036. DOI: http://dx.doi.org/10.1145/1124772.1124926",
      "doi": "10.1145/1124772.1124926"
    },
    {
      "text": "Regan L Mandryk and Max V Birk. 2017. Toward game-based digital mental health interventions: player habits and preferences. Journal of Medical Internet Research 19, 4 (2017). DOI: http://dx.doi.org/10.2196/jmir.6906",
      "doi": ""
    },
    {
      "text": "Regan L Mandryk and Kori M Inkpen. 2004. Physiological indicators for the evaluation of co-located collaborative play. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work. ACM, 102--111. DOI: http://dx.doi.org/10.1145/1031607.1031625",
      "doi": "10.1145/1031607.1031625"
    },
    {
      "text": "Marcus Märtens, Siqi Shen, Alexandru Iosup, and Fernando Kuipers. 2015. Toxicity detection in multiplayer online games. In Network and Systems Support for Games (NetGames), 2015 International Workshop on. IEEE, 1--6. DOI: http://dx.doi.org/10.1109/netgames.2015.7382991",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1 (2012), 1--23. DOI: http://dx.doi.org/10.3758/s13428-011-0124--6",
      "doi": ""
    },
    {
      "text": "Iris B. Mauss and Michael D. Robinson. 2009. Measures of emotion: A review. Cognition and Emotion 23, 2 (2009), 209--237. DOI: http://dx.doi.org/10.1080/02699930802204677 PMID: 19809584.",
      "doi": ""
    },
    {
      "text": "Max Kobbert and Ravensburger. 1986. Labyrinth. Game [Boardgame]. (1986). Ravensburger, Ravensburg, Germany.",
      "doi": ""
    },
    {
      "text": "David C McClelland. 1985. How motives, skills, and values determine what people do. American Psychologist 40, 7 (1985), 812.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: a cross-platform real-time multi-face expression recognition toolkit. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3723--3726. DOI: http://dx.doi.org/10.1145/2851581.2890247",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Gregor McEwan and Carl Gutwin. 2016. Chess as a Conversation: Artefact-Based Communication in Online Competitive Board Games. 21--30. DOI: http://dx.doi.org/10.1145/2957276.2957314",
      "doi": ""
    },
    {
      "text": "Matthew K. Miller, Regan L Mandryk, Max V. Birk, Ansgar E. Depping, and Tushita Patel. 2017. Through the Looking Glass: The Effects of Feedback on Self-Awareness and Conversational Behaviour During Video Chat. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5271--5283. DOI: http://dx.doi.org/10.1145/3025453.3025548",
      "doi": "10.1145/3025453.3025548"
    },
    {
      "text": "Todd Mooradian, Birgit Renzl, and Kurt Matzler. 2006. Who trusts? Personality, trust and knowledge sharing. Management learning 37, 4 (2006), 523--540. DOI: http://dx.doi.org/10.1177/1350507606073424",
      "doi": ""
    },
    {
      "text": "Lennart E Nacke, Chris Bateman, and Regan L Mandryk. 2014. BrainHex: A neurobiological gamer typology survey. Entertainment computing 5, 1 (2014), 55--62. DOI: http://dx.doi.org/10.1016/j.entcom.2013.06.002",
      "doi": ""
    },
    {
      "text": "Faham Negini, Regan L Mandryk, and Kevin G Stanley. 2014. Using affective state to adapt characters, NPCs, and the environment in a first-person shooter game. In Games Media Entertainment (GEM), 2014 IEEE. IEEE, 1--8. DOI: http://dx.doi.org/10.1109/gem.2014.7048094",
      "doi": ""
    },
    {
      "text": "André Nieoullon and Antoine Coquerel. 2003. Dopamine: a key regulator to adapt action, emotion, motivation and cognition. Current Opinion in Neurology 16 (2003), S3--S9. DOI: http://dx.doi.org/10.1097/00019052--200312002-00002",
      "doi": ""
    },
    {
      "text": "Thais Mayumi Oshiro, Pedro Santoro Perez, and José Augusto Baranauskas. 2012. How many trees in a random forest?. In International Workshop on Machine Learning and Data Mining in Pattern Recognition. Springer, 154--168. DOI: http://dx.doi.org/10.1007/978--3--642--31537--4_13",
      "doi": "10.1007/978-3-642-31537-4_13"
    },
    {
      "text": "Gabriele Paolacci, Jesse Chandler, Panagiotis G Ipeirotis, and others. 2010. Running experiments on Amazon Mechanical Turk. Judgment and Decision Making 5, 5 (2010), 411--419.",
      "doi": ""
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825--2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "James W Pennebaker, Ryan L Boyd, Kayla Jordan, and Kate Blackburn. 2015. The development and psychometric properties of LIWC2015. UT Faculty/Researcher Works (2015). DOI: http://dx.doi.org/10.15781/T29G6Z",
      "doi": ""
    },
    {
      "text": "Susanne Poeller, Max V. Birk, Nicola Baumann, and Regan L. Mandryk. 2018. Let Me Be Implicit: Using Motive Disposition Theory to Predict and Explain Behaviour in Digital Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 190, 15 pages. DOI: http://dx.doi.org/10.1145/3173574.3173764",
      "doi": ""
    },
    {
      "text": "Shaun Prescott. 2017. Overwatch's Jeff Kaplan on toxic behavior: 'the community needs to take a deep look inwards'. https://www.pcgamer.com/overwatchs-jeffkaplan-on-toxic-behavior-the-community-needs-to-take-adeep-look-inwards/. (2017). Accessed: 2018-09--17.",
      "doi": ""
    },
    {
      "text": "Daniel S Quintana and Donald R Williams. 2018. Bayesian alternatives for common null-hypothesis significance tests in psychiatry: a non-technical guide using JASP. BMC psychiatry 18, 1 (2018), 178. DOI: http://dx.doi.org/10.1186/s12888-018--1761--4",
      "doi": ""
    },
    {
      "text": "John K Rempel, John G Holmes, and Mark P Zanna. 1985. Trust in close relationships. Journal of personality and social psychology 49, 1 (1985), 95. DOI: http://dx.doi.org/10.1037/0022--3514.49.1.95",
      "doi": ""
    },
    {
      "text": "Guido Rossum. 1995. Python Reference Manual. Technical Report. Amsterdam, The Netherlands, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Jeffrey N Rouder, Paul L Speckman, Dongchu Sun, Richard D Morey, and Geoffrey Iverson. 2009. Bayesian t tests for accepting and rejecting the null hypothesis. Psychonomic bulletin & review 16, 2 (2009), 225--237. DOI: http://dx.doi.org/10.3758/pbr.16.2.225",
      "doi": ""
    },
    {
      "text": "Ellen Rusman, Jan Van Bruggen, Peter Sloep, and Rob Koper. 2010. Fostering trust in virtual project teams: Towards a design framework grounded in a TrustWorthiness ANtecedents (TWAN) schema. International Journal of Human-Computer Studies 68, 11 (2010), 834--850. DOI: http://dx.doi.org/10.1016/j.ijhcs.2010.07.003",
      "doi": "10.1016/j.ijhcs.2010.07.003"
    },
    {
      "text": "Jörn P.W Scharlemann, Catherine C Eckel, Alex Kacelnik, and Rick K Wilson. 2001. The value of a smile: Game theory with a human face. Journal of Economic Psychology 22, 5 (2001), 617--640. DOI: http://dx.doi.org/10.1016/S0167--4870(01)00059--9",
      "doi": ""
    },
    {
      "text": "Diane J. Schiano, Bonnie Nardi, Thomas Debeauvais, Nicolas Ducheneaut, and Nicholas Yee. 2014. The \"lonely gamer\" revisited. Entertainment Computing 5, 1 (2014), 65 -- 70. DOI: http://dx.doi.org/10.1016/j.entcom.2013.08.002",
      "doi": ""
    },
    {
      "text": "Claudia Schrader, Julia Brich, Julian Frommel, Valentin Riemer, and Katja Rogers. 2017. Rising to the Challenge: An Emotion-Driven Approach Toward Adaptive Serious Games. In Serious Games and Edutainment Applications. Springer International Publishing, 3--28. DOI: http://dx.doi.org/10.1007/978--3--319--51645--5_1",
      "doi": ""
    },
    {
      "text": "scikit-learn developers. 2018. Feature Selection - Recursive feature elimination. https://scikitlearn.org/stable/modules/feature_selection.html#rfe. (2018). Accessed: 2019-02--19.",
      "doi": ""
    },
    {
      "text": "Thibaud Sénéchal, Jay Turcot, and Rana El Kaliouby. 2013. Smile or smirk? automatic detection of spontaneous asymmetric smiles to understand viewer experience. In Automatic Face and Gesture Recognition (FG), 2013 10th IEEE International Conference and Workshops on. IEEE, 1--8. DOI: http://dx.doi.org/10.1109/fg.2013.6553776",
      "doi": ""
    },
    {
      "text": "Fengyi Song, Xiaoyang Tan, Xue Liu, and Songcan Chen. 2014. Eyes closeness detection from still images with multi-scale histograms of principal oriented gradients. Pattern Recognition 47, 9 (2014), 2825--2838.",
      "doi": ""
    },
    {
      "text": "Constance A Steinkuehler and Dmitri Williams. 2006. Where everybody knows your (screen) name: Online games as \"third places\". Journal of computer-mediated communication 11, 4 (2006), 885--909. DOI: http://dx.doi.org/10.1111/j.1083--6101.2006.00300.x",
      "doi": ""
    },
    {
      "text": "Adam Summerville, Julian R. H. Mariño, Sam Snodgrass, Santiago Ontañón, and Levi H. S. Lelis. 2017. Understanding Mario: An Evaluation of Design Metrics for Platformers. In Proceedings of the 12th International Conference on the Foundations of Digital Games (FDG '17). ACM, NY, NY, USA, Article 8, 10 pages. DOI: http://dx.doi.org/10.1145/3102071.3102080",
      "doi": ""
    },
    {
      "text": "Xiaoning Sun, Susan Wiedenbeck, Thippaya Chintakovid, and Qiping Zhang. 2007a. The effect of gender on trust perception and performance in computer-mediated virtual environments. Proceedings of the American Society for Information Science and Technology 44, 1 (2007), 1--14. DOI: http://dx.doi.org/10.1002/meet.1450440211",
      "doi": ""
    },
    {
      "text": "Xiaoning Sun, Susan Wiedenbeck, Thippaya Chintakovid, and Qiping Zhang. 2007b. Gender talk: differences in interaction style in CMC. In IFIP Conference on Human-Computer Interaction. Springer, 215--218. DOI: http://dx.doi.org/10.1007/978--3--540--74800--7_17",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2018. The Multiplayer High Level API. https://docs.unity3d.com/Manual/UNetUsingHLAPI.html. (2018). Accessed: 2018-09--12.",
      "doi": ""
    },
    {
      "text": "Joseph J Thompson, Betty HM Leung, Mark R Blair, and Maite Taboada. 2017. Sentiment analysis of player chat messaging in the video game StarCraft 2: Extending a lexicon-based model. Knowledge-Based Systems 137 (2017), 149 -- 162. DOI: http://dx.doi.org/10.1016/j.knosys.2017.09.022",
      "doi": "10.1016/j.knosys.2017.09.022"
    },
    {
      "text": "Tim Tijs, Dirk Brokken, and Wijnand IJsselsteijn. 2008a. Creating an emotionally adaptive game. In International Conference on Entertainment Computing. Springer, 122--133. DOI: http://dx.doi.org/10.1007/978--3--540--89222--9_14",
      "doi": "10.1007/978-3-540-89222-9_14"
    },
    {
      "text": "Tim Tijs, Dirk Brokken, and Wijnand A IJsselsteijn. 2008b. Dynamic game balancing by recognizing affect. In Fun and games. Springer, 88--93. DOI: http://dx.doi.org/10.1007/978--3--540--88322--7_9",
      "doi": ""
    },
    {
      "text": "Sabine Trepte, Leonard Reinecke, and Keno Juechems. 2012. The social side of gaming: How playing online computer games creates online and offline social support. Computers in Human Behavior 28, 3 (2012), 832--839.",
      "doi": "10.1016/j.chb.2011.12.003"
    },
    {
      "text": "Michael Tscholl, John McCarthy, and Jeremiah Scholl. 2005. The effect of video-augmented chat on collaborative learning with cases. In Proceedings of th 2005 conference on Computer support for collaborative learning: learning 2005: the next 10 years! International Society of the Learning Sciences, 682--686. DOI: http://dx.doi.org/10.3115/1149293.1149383",
      "doi": "10.5555/1149293.1149383"
    },
    {
      "text": "Unity Technologies. 2018. Unity (Version 2017.3.1)[Computer software]. (2018). https://unity3d.com",
      "doi": ""
    },
    {
      "text": "Gitte Vanwinckelen and Hendrik Blockeel. 2012. On estimating model accuracy with repeated cross-validation. In BeneLearn 2012: Proceedings of the 21st Belgian-Dutch Conference on Machine Learning. 39--44.",
      "doi": ""
    },
    {
      "text": "Pascal Vrticka. 2012. Interpersonal Closeness and Social Reward Processing. Journal of Neuroscience 32, 37 (2012), 12649--12650.",
      "doi": ""
    },
    {
      "text": "Pascal Vrticka and Patrik Vuilleumier. 2012. Neuroscience of human social interactions and adult attachment style. Frontiers in human neuroscience 6 (July 2012), 212--212. DOI: http://dx.doi.org/10.3389/fnhum.2012.00212",
      "doi": ""
    },
    {
      "text": "Eric-Jan Wagenmakers, Jonathon Love, Maarten Marsman, Tahira Jamil, Alexander Ly, Josine Verhagen, Ravi Selker, Quentin F. Gronau, Damian Dropmann, Bruno Boutin, Frans Meerhoff, Patrick Knight, Akash Raj, Erik-Jan van Kesteren, Johnny van Doorn, Sacha Epskamp, Alexander Etz, Dora Matzke, Tim de Jong, Don van den Bergh, Alexandra Sarafoglou, Helen Steingroever, Koen Derks, Jeffrey N. Rouder, and Richard D. Morey. 2018a. Bayesian inference for psychology. Part II: Example applications with JASP. Psychonomic Bulletin & Review 25, 1 (01 Feb 2018), 58--76. DOI: http://dx.doi.org/10.3758/s13423-017--1323--7",
      "doi": ""
    },
    {
      "text": "Eric-Jan Wagenmakers, Maarten Marsman, Tahira Jamil, Alexander Ly, Josine Verhagen, Jonathon Love, Ravi Selker, Quentin F. Gronau, Sacha Epskamp, Dora Matzke, Jeffrey N. Rouder, and Richard D. Morey. 2018b. Bayesian inference for psychology. Part I: Theoretical advantages and practical ramifications. Psychonomic Bulletin & Review 25, 1 (01 Feb 2018), 35--57. DOI: http://dx.doi.org/10.3758/s13423-017--1343--3",
      "doi": ""
    },
    {
      "text": "Wim Westera. 2016. Performance assessment in serious games: Compensating for the effects of randomness. Education and Information Technologies 21, 3 (01 May 2016), 681--697. DOI: http://dx.doi.org/10.1007/s10639-014--9347--3",
      "doi": ""
    },
    {
      "text": "Dmitri Williams. 2006. Groups and goblins: The social and civic impact of an online game. Journal of Broadcasting & Electronic Media 50, 4 (2006), 651--670. DOI: http://dx.doi.org/10.1207/s15506878jobem5004_5",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From tree house to barracks: The social life of guilds in World of Warcraft. Games and culture 1, 4 (2006), 338--361. DOI: http://dx.doi.org/10.1177/1555412006292616",
      "doi": ""
    },
    {
      "text": "Michele Williams. 2001. In whom we trust: Group membership as an affective context for trust development. Academy of management review 26, 3 (2001), 377--396. DOI: http://dx.doi.org/10.2307/259183",
      "doi": ""
    },
    {
      "text": "Toshio Yamagishi and Midori Yamagishi. 1994. Trust and commitment in the United States and Japan. Motivation and Emotion 18, 2 (01 Jun 1994), 129--166. DOI: http://dx.doi.org/10.1007/BF02249397",
      "doi": ""
    },
    {
      "text": "Georgios N Yannakakis and Julian Togelius. 2011. Experience-driven procedural content generation. IEEE Transactions on Affective Computing 2, 3 (2011), 147--161. DOI: http://dx.doi.org/10.1109/t-affc.2011.6",
      "doi": "10.1109/T-AFFC.2011.6"
    }
  ]
}