{
  "doi": "10.1145/3313831.3376711",
  "title": "How We Type: Eye and Finger Movement Strategies in Mobile Typing",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Relatively little is known about eye and finger movement in typing with mobile devices. Most prior studies of mobile typing rely on log data, while data on finger and eye movements in typing come from studies with physical keyboards. This paper presents new findings from a transcription task with mobile touchscreen devices. Movement strategies were found to emerge in response to sharing of visual attention: attention is needed for guiding finger movements and detecting typing errors. In contrast to typing on physical keyboards, visual attention is kept mostly on the virtual keyboard, and glances at the text display are associated with performance. When typing with two fingers, although users make more errors, they manage to detect and correct them more quickly. This explains part of the known superiority of two-thumb typing over one-finger typing. We release the extensive dataset on everyday typing on smartphones.",
  "authors": [
    {
      "name": "Xinhui Jiang",
      "institution": "Kochi University of Technology, Kami, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526909",
      "orcid": "missing"
    },
    {
      "name": "Yang Li",
      "institution": "Kochi University of Technology, Kami, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528789",
      "orcid": "missing"
    },
    {
      "name": "Jussi P.P. Jokinen",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689597",
      "orcid": "missing"
    },
    {
      "name": "Viet Ba Hirvola",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365414",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University; Finnish Center for Artificial Intelligence, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kami, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "John R. Anderson, Lynne M. Reder, and Christian Lebiere. 1996. Working Memory: Activation Limitations on Retrieval. Cognitive Psychology 30, 3 (June 1996), 221--256. DOI: http://dx.doi.org/10.1006/cogp.1996.0007",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif, Sunjun Kim, Wolfgang Stuerzlinger, Geehyuk Lee, and Ali Mazalek. 2016. Evaluation of a Smart-Restorable Backspace Technique to Facilitate Text Entry Error Correction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5151--5162. DOI: http://dx.doi.org/10.1145/2858036.2858407",
      "doi": "10.1145/2858036.2858407"
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 251--260. DOI: http://dx.doi.org/10.1145/2371574.2371612",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Dana H Ballard, Mary M Hayhoe, Feng Li, and Steven D Whitehead. 1992. Hand-eye coordination during sequential tasks. Philosophical Transactions of the Royal Society of London. Series B: Biological Sciences 337, 1281 (1992), 331--339. DOI: http://dx.doi.org/10.1098/rstb.1992.0111",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Varun Rao, Abinaya Saravanan, Anind K Dey, and Jennifer Mankoff. 2017. Quantifying Aversion to Costly Typing Errors in Expert Mobile Text Entry. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4229--4241. DOI: http://dx.doi.org/10.1145/3025453.3025695",
      "doi": "10.1145/3025453.3025695"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Antti Oulasvirta, and Stephen Brewster. 2011. The effects of walking speed on target acquisition on a touchscreen interface. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services. ACM, 143--146.",
      "doi": "10.1145/2037373.2037396"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts Law: Modeling Finger Touch with Fitts' Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1363--1372. DOI: http://dx.doi.org/10.1145/2470654.2466180",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Matthew Michael Botvinick. 2012. Hierarchical reinforcement learning and decision making. Current Opinion in Neurobiology 22, 6 (2012), 956--962.",
      "doi": ""
    },
    {
      "text": "Shi Cao, Anson Ho, and Jibo He. 2018. Modeling and predicting mobile phone touchscreen transcription typing using an integrated cognitive architecture. International Journal of Human--Computer Interaction 34, 6 (2018), 544--556. DOI: http://dx.doi.org/10.1080/10447318.2017.1373463",
      "doi": ""
    },
    {
      "text": "Tania Cerni, Marieke Longcamp, and Remo Job. 2016. Two thumbs and one index: A comparison of manual coordination in touch-typing and mobile-typing. Acta Psychologica 167 (June 2016), 16--23. DOI: http://dx.doi.org/10.1016/j.actpsy.2016.03.007",
      "doi": ""
    },
    {
      "text": "Mary J. Chapman, Alice F. Healy, and James A. Kole. 2016. Memory load as a cognitive antidote to performance decrements in data entry. Memory 24, 9 (2016), 1182--1196. DOI: http://dx.doi.org/10.1080/09658211.2015.1086380 PMID: 26390366.",
      "doi": ""
    },
    {
      "text": "Edward Clarkson, Kent Lyons, James Clawson, and Thad Starner. 2007. Revisiting and Validating a Model of Two-thumb Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 163--166. DOI: http://dx.doi.org/10.1145/1240624.1240650",
      "doi": "10.1145/1240624.1240650"
    },
    {
      "text": "James W Cortada. 2000. Before the computer: IBM, NCR, Burroughs, and Remington Rand and the industry they created, 1865--1956. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Vivek Dhakal, Anna Maria Feit, Per Ola Kristensson, and Antti Oulasvirta. 2018. Observations on Typing from 136 Million Keystrokes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 646, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174220",
      "doi": "10.1145/3173574.3174220"
    },
    {
      "text": "M.D. Dunlop and M. Montgomery Masters. 2009. Pickup usability dominates: a brief history of mobile text entry research and adoption. International Journal of Mobile Human Computer Interaction 1, 1 (2009), 42--59.",
      "doi": ""
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How We Type: Movement Strategies and Performance in Everyday Typing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4262--4273. DOI: http://dx.doi.org/10.1145/2858036.2858233",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381. DOI: http://dx.doi.org/10.1037/h0055392",
      "doi": ""
    },
    {
      "text": "Samuel J Gershman, Eric J Horvitz, and Joshua B Tenenbaum. 2015. Computational rationality: A converging paradigm for intelligence in brains, minds, and machines. Science 349, 6245 (2015), 273--278. DOI: http://dx.doi.org/10.1126/science.aac6076",
      "doi": ""
    },
    {
      "text": "John D Gould, Sharon L Greene, Stephen J Boies, Antonia Meluson, and Marwan Rasamny. 1990. Using a touchscreen for simple tasks. Interacting with computers 2, 1 (1990), 59--74.",
      "doi": ""
    },
    {
      "text": "Patricia Marks Greenfield. 1984. Mind and Media: The Effects of Television, Video Games, and Computers. (1984).",
      "doi": ""
    },
    {
      "text": "Patricia M Greenfield, Patricia DeWinstanley, Heidi Kilpatrick, and Daniel Kaye. 1994. Action video games and informal education: Effects on strategies for dividing visual attention. Journal of applied developmental psychology 15, 1 (1994), 105--123. DOI: http://dx.doi.org/10.1016/0193--3973(94)90008--6",
      "doi": ""
    },
    {
      "text": "Yves Guiard, Halla B. Olafsdottir, and Simon T. Perrault. 2011. Fitt's Law As an Explicit Time/Error Trade-off. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1619--1628. DOI: http://dx.doi.org/10.1145/1978942.1979179",
      "doi": ""
    },
    {
      "text": "Eve Hoggan, Stephen A. Brewster, and Jody Johnston. 2008. Investigating the Effectiveness of Tactile Feedback for Mobile Touchscreens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1573--1582. DOI: http://dx.doi.org/10.1145/1357054.1357300",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "Paul Holleis, Friederike Otto, Heinrich Hussmann, and Albrecht Schmidt. 2007. Keystroke-level Model for Advanced Mobile Phone Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1505--1514. DOI: http://dx.doi.org/10.1145/1240624.1240851",
      "doi": "10.1145/1240624.1240851"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2011. Understanding Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2501--2510. DOI: http://dx.doi.org/10.1145/1978942.1979308",
      "doi": ""
    },
    {
      "text": "Marc Jeannerod. 1988. The neural and behavioural organization of goal-directed movements. Clarendon Press/Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Charles F. Jekel, Gerhard Venter, Martin P. Venter, Nielen Stander, and Raphael T. Haftka. 2019. Similarity measures for identifying material parameters from hysteresis loops using inverse analysis. International Journal of Material Forming 12, 3 (01 May 2019), 355--378. DOI: http://dx.doi.org/10.1007/s12289-018--1421--8",
      "doi": ""
    },
    {
      "text": "jkielty. 2019. Viewport, resolution, diagonal screen size and DPI for the most popular smartphones. (Jul 2019). https://deviceatlas.com/blog/viewport-resolution-dia gonal-screen-size-and-dpi-most-popular-smartphones",
      "doi": ""
    },
    {
      "text": "Roger Johansson, Åsa Wengelin, Victoria Johansson, and Kenneth Holmqvist. 2010. Looking at the keyboard or the monitor: relationship with text production processes. Reading and Writing 23, 7 (01 Aug 2010), 835--851. DOI: http://dx.doi.org/10.1007/s11145-009--9189--3",
      "doi": ""
    },
    {
      "text": "Jussi Jokinen. 2017. Touch Screen Text Entry as Cognitively Bounded Rationality. In Proceedings of the Annual Cognitive Science Society Meeting.",
      "doi": ""
    },
    {
      "text": "Jussi P. P. Jokinen, Sayan Sarcar, Antti Oulasvirta, Chaklam Silpasuwanchai, Zhenxin Wang, and Xiangshi Ren. 2017. Modelling Learning of New Keyboard Layouts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4203--4215. DOI: http://dx.doi.org/10.1145/3025453.3025580",
      "doi": "10.1145/3025453.3025580"
    },
    {
      "text": "Charles M Judd, Jacob Westfall, and David A Kenny. 2012. Treating stimuli as a random factor in social psychology: A new and comprehensive solution to a pervasive but largely ignored problem. Journal of personality and social psychology 103, 1 (2012), 54. DOI: http://dx.doi.org/10.1037/a0028347",
      "doi": ""
    },
    {
      "text": "Kevin S. Killourhy and Roy A. Maxion. 2012. Free vs. Transcribed Text for Keystroke-dynamics Evaluations. In Proceedings of the 2012 Workshop on Learning from Authoritative Security Experiment Results (LASER '12). ACM, NY, NY, USA, 1--8. DOI: http://dx.doi.org/10.1145/2379616.2379617",
      "doi": ""
    },
    {
      "text": "Per Ola Kristensson. 2009. Five challenges for intelligent text entry methods. AI Magazine 30, 4 (2009), 85--85. DOI: http://dx.doi.org/10.1609/aimag.v30i4.2269",
      "doi": ""
    },
    {
      "text": "Tuomo Kujala, Jakke Mäkelä, Ilkka Kotilainen, and Timo Tokkonen. 2016. The attentional demand of automobile driving revisited: occlusion distance as a function of task-relevant event density in realistic driving scenarios. Human factors 58, 1 (2016), 163--180. DOI: http://dx.doi.org/10.1177/0018720815595901",
      "doi": ""
    },
    {
      "text": "Richard L Lewis, Andrew Howes, and Satinder Singh. 2014. Computational rationality: Linking mechanism and behavior through bounded utility maximization. Topics in cognitive science 6, 2 (2014), 279--311. DOI: http://dx.doi.org/10.1111/tops.12086",
      "doi": ""
    },
    {
      "text": "Yilin Li, Baochang Zhang, Yao Cao, Sanqiang Zhao, Yongsheng Gao, and Jianzhuang Liu. 2011. Study on the BeiHang Keystroke Dynamics Database. In 2011 International Joint Conference on Biometrics (IJCB). IEEE. DOI: http://dx.doi.org/10.1109/ijcb.2011.6117485",
      "doi": ""
    },
    {
      "text": "Gordon D. Logan. 2018. Automatic control: How experts act without thinking. Psychological Review 125, 4 (July 2018), 453--485. DOI: http://dx.doi.org/10.1037/rev0000100",
      "doi": ""
    },
    {
      "text": "Gordon D Logan and Matthew JC Crump. 2011. Hierarchical control of cognitive processes: The case for skilled typewriting. In Psychology of learning and motivation. Vol. 54. Elsevier, 1--27. DOI: http://dx.doi.org/10.1016/b978-0--12--385527--5.00001--2",
      "doi": ""
    },
    {
      "text": "Yiqin Lu, Chun Yu, Shuyi Fan, Xiaojun Bi, and Yuanchun Shi. 2019. Typing on Split Keyboards with Peripheral Vision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 200, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300430",
      "doi": "10.1145/3290605.3300430"
    },
    {
      "text": "I Scott MacKenzie and R William Soukoreff. 2002a. A model of two-thumb text entry. In Graphics interface. 117--124.",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie and R William Soukoreff. 2002b. Text entry for mobile computing: Models and methods, theory and practice. Human--Computer Interaction 17, 2--3 (2002), 147--198.",
      "doi": ""
    },
    {
      "text": "John A Michon. 1985. A critical view of driver behavior models: what do we know, what should we do? In Human behavior and traffic safety. Springer, 485--524.",
      "doi": ""
    },
    {
      "text": "Urpo Nikanne. 2017. Finite Sentences In Finnish: Word Order, Morphology, And Information Structure. (2017). DOI: http://dx.doi.org/10.5281/zenodo.1117710",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen, and Per Ola Kristensson. 2013. Improving Two-thumb Text Entry on Touchscreen Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2765--2774. DOI: http://dx.doi.org/10.1145/2470654.2481383",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Antti Oulasvirta, Sakari Tamminen, Virpi Roto, and Jaana Kuorelahti. 2005. Interaction in 4-second Bursts: The Fragmented Nature of Attentional Resources in Mobile HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 919--928. DOI: http://dx.doi.org/10.1145/1054972.1055101",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Kseniia Palin, Anna Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How do People Type on Mobile Devices? Observations from a Study with 37,000 Volunteers. In Proceedings of 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'19). ACM. DOI: http://dx.doi.org/https://doi.org/10.475/123_4",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "Alexandra Papoutsaki, Aaron Gokaslan, James Tompkin, Yuze He, and Jeff Huang. 2018. The Eye of the Typer: A Benchmark and Analysis of Gaze Behavior During Typing. In Proceedings of the 2018 ACM Symposium on Eye Tracking Research & Applications (ETRA '18). ACM, NY, NY, USA, Article 16, 9 pages. DOI: http://dx.doi.org/10.1145/3204493.3204552",
      "doi": "10.1145/3204493.3204552"
    },
    {
      "text": "Ken Pfeuffer and Yang Li. 2018. Analysis and Modeling of Grid Performance on Touchscreen Mobile Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 288, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173862",
      "doi": "10.1145/3173574.3173862"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 83--88. DOI: http://dx.doi.org/10.1145/2858036.2858305",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Shyam Reyal, Shumin Zhai, and Per Ola Kristensson. 2015. Performance and user experience of touchscreen and gesture keyboards in a lab setting and in the wild. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 679--688.",
      "doi": "10.1145/2702123.2702597"
    },
    {
      "text": "Martina Rieger and Victoria Bart. 2016. Typing Style and the Use of Different Sources of Information during Typing: An Investigation Using Self-Reports. Frontiers in Psychology 7 (12 2016), 1--12. DOI: http://dx.doi.org/10.3389/fpsyg.2016.01908",
      "doi": ""
    },
    {
      "text": "Uta Sailer, J Randall Flanagan, and Roland S Johansson. 2005. Eye--hand coordination during learning of a novel visuomotor task. Journal of Neuroscience 25, 39 (2005), 8833--8842. DOI: http://dx.doi.org/10.1523/jneurosci.2658-05.2005",
      "doi": ""
    },
    {
      "text": "Timothy A. Salthouse. 1984. Effects of age and skill in typing. Journal of Experimental Psychology: General 113, 3 (1984), 345--371. DOI: http://dx.doi.org/10.1037/0096--3445.113.3.345",
      "doi": ""
    },
    {
      "text": "Timothy A. Salthouse. 1986. Perceptual, cognitive, and motoric aspects of transcription typing. Psychological Bulletin 99, 3 (1986), 303--319. DOI: http://dx.doi.org/10.1037/0033--2909.99.3.303",
      "doi": ""
    },
    {
      "text": "Sayan Sarcar, Jussi PP Jokinen, Antti Oulasvirta, Zhenxin Wang, Chaklam Silpasuwanchai, and Xiangshi Ren. 2018. Ability-based optimization of touchscreen interactions. IEEE Pervasive Computing 17, 1 (2018), 15--26. DOI: http://dx.doi.org/10.1109/mprv.2018.011591058",
      "doi": "10.1109/mprv.2018.011591058"
    },
    {
      "text": "Andrew Sears, Julie A Jacko, Josey Chu, and Francisco Moro. 2001. The role of visual search in the design of effective soft keyboards. Behaviour & Information Technology 20, 3 (2001), 159--166. DOI: http://dx.doi.org/10.1080/01449290110049790",
      "doi": ""
    },
    {
      "text": "Amanda L Smith and Barbara S Chaparro. 2015. Smartphone text input method performance, usability, and preference with younger and older adults. Human factors 57, 6 (2015), 1015--1028. DOI: http://dx.doi.org/10.1177/0018720815575644",
      "doi": ""
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. A versatile dataset for text entry evaluations based on genuine mobile emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services. ACM, ACM Press, 295--298. DOI: http://dx.doi.org/10.1145/2037373.2037418",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Pierre Weill-Tessier and Hans Gellersen. 2018. Touch Input and Gaze Correlation on Tablets. In Intelligent Decision Technologies 2017, Ireneusz Czarnowski, Robert J. Howlett, and Lakhmi C. Jain (Eds.). Springer International Publishing, Cham, 287--296.",
      "doi": ""
    },
    {
      "text": "Pierre Weill-Tessier, Jayson Turner, and Hans Gellersen. 2016. How Do You Look at What You Touch?: A Study of Touch Interaction and Gaze Correlation on Tablets. In Proceedings of the Ninth Biennial ACM Symposium on Eye Tracking Research & Applications (ETRA '16). ACM, NY, NY, USA, 329--330. DOI: http://dx.doi.org/10.1145/2857491.2888592",
      "doi": "10.1145/2857491.2888592"
    },
    {
      "text": "R William Soukoreff and I Scott Mackenzie. 1995. Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard. Behaviour & Information Technology 14, 6 (1995), 370--379. DOI: http://dx.doi.org/10.1080/01449299508914656",
      "doi": ""
    },
    {
      "text": "Katharina Witowski and Nielen Stander. 2012. Parameter Identification of Hysteretic Models Using Partial Curve Mapping. In 12th AIAA Aviation Technology, Integration, and Operations (ATIO) Conference and 14th AIAA/ISSMO Multidisciplinary Analysis and Optimization Conference. American Institute of Aeronautics and Astronautics. DOI: http://dx.doi.org/10.2514/6.2012--5580",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock. 2007. Measures of Text Entry Performance. In Text Entry Systems. Elsevier, 47--74. DOI: http://dx.doi.org/10.1016/b978-012373591--1/50003--6",
      "doi": ""
    },
    {
      "text": "Motonori Yamaguchi and Gordon D. Logan. 2014. Pushing typists back on the learning curve: Revealing chunking in skilled typewriting. Journal of Experimental Psychology: Human Perception and Performance 40, 2 (2014), 592--612. DOI: http://dx.doi.org/10.1037/a0033809",
      "doi": ""
    }
  ]
}