{
  "doi": "10.1145/3313831.3376823",
  "title": "Support Strategies for Remote Guides in Assisting People with Visual Impairments for Effective Indoor Navigation",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "People with visual impairments often require mobility assistance of sighted guides but they are not always available. Recent technological strides have opened up new directions for sighted guidance services, assigning guides from a network of remote workers to provide real-time assistance via audio/video communication. However, little has been known regarding desirable support characteristics of remote guides or challenges experienced in guide practices without the requisite expertise. To recommend support strategies that contribute to facilitating a successful platform for remote sighted guidance, this paper presents a comparative study of the performance of trained and untrained sighted guides who are recruited for a remote scenario in assisting people with visual impairments in indoor navigation. As an outcome of this research, we provide a deeper understanding of design opportunities for HCI to scaffold requirements of remote guides, such that their collaborative efforts and environmental knowledge influence the user experience. Based on our empirical insights, we suggest to develop the expertise of remote guides through: a) preliminary guidance cooperation awareness b) guidelines for verbal description methods, and c) approaches to compensate for the lack of environmental knowledge.",
  "tags": [
    "indoor navigation",
    "remote assistance",
    "visual impairment",
    "collaboration"
  ],
  "authors": [
    {
      "name": "Rie Kamikubo",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214535",
      "orcid": "0000-0002-0060-6681"
    },
    {
      "name": "Naoya Kato",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526900",
      "orcid": "missing"
    },
    {
      "name": "Keita Higuchi",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482650519",
      "orcid": "missing"
    },
    {
      "name": "Ryo Yonetani",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474703871",
      "orcid": "missing"
    },
    {
      "name": "Yoichi Sato",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100565790",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mauro Avila, Katrin Wolf, Anke Brock, and Niels Henze. 2016. Remote assistance for blind users in daily life: A survey about be my eyes. In Proceedings of the 9th ACM International Conference on Pervasive Technologies Related to Assistive Environments. ACM, 85.",
      "doi": "10.1145/2910674.2935839"
    },
    {
      "text": "Jan Balata, Jakub Franc, Zdenek Mikovec, and Pavel Slavik. 2014. Collaborative navigation of visually impaired. Journal on Multimodal User Interfaces 8, 2 (2014), 175--185.",
      "doi": ""
    },
    {
      "text": "Jan Balata, Zdenek Mikovec, and Ivo Maly. 2015. Navigation problems in blind-to-blind pedestrians tele-assistance navigation. In Human-Computer Interaction. Springer, 89--109.",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Rachel L Franz, Khai N Truong, Jennifer Mankoff, and Anind K Dey. 2013. Uncovering information needs for independent spatial learning for users who are visually impaired. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 24.",
      "doi": "10.1145/2513383.2513445"
    },
    {
      "text": "Przemyslaw Baranski and Pawel Strumillo. 2015. Field trials of a teleassistance system for the visually impaired. In Human System Interactions (HSI), 2015 8th International Conference on. IEEE, 173--179.",
      "doi": ""
    },
    {
      "text": "Amy Barrett-Lennard and others. 2016. The ROAM Project Part 1: Exploring new frontiers in video conferencing to expand the delivery of remote O&M services in regional Western Australia. International Journal of Orientation & Mobility 8, 1 (2016), 101--118.",
      "doi": ""
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and others. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 333--342.",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Nicholas A Bradley and Mark D Dunlop. 2002. Investigating context-aware clues to assist navigation for visually impaired people. In Proceedings of Workshop on Building Bridges: Interdisciplinary Context-Sensitive Computing, University of Glasgow.",
      "doi": ""
    },
    {
      "text": "Nicholas A Bradley and Mark D Dunlop. 2005. An experimental investigation into wayfinding directions for visually impaired people. Personal and Ubiquitous Computing 9, 6 (2005), 395--403.",
      "doi": "10.1007/s00779-005-0350-y"
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2373--2382.",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "M Bujacz, P Baranski, M Moranski, P Strumillo, and A Materka. 2008. Remote guidance for the blind - A proposed teleassistance system and navigation trials. In Human System Interactions, 2008 Conference on. IEEE, 888--892.",
      "doi": ""
    },
    {
      "text": "Babar Chaudary, Iikka Paajala, Eliud Keino, and Petri Pulli. 2017. Tele-guidance based navigation system for the visually impaired and blind persons. In eHealth 360. Springer, 9--16.",
      "doi": ""
    },
    {
      "text": "Judy Cohen and Yvette Silver. 2006. Disability Etiquette. (2006).",
      "doi": ""
    },
    {
      "text": "Hong Phangia Dewald, Catherine A Smyth, and others. 2013. Feasibility of Orientation and Mobility Services for Young Children with Vision Impairment using Teleintervention. International Journal of Orientation & Mobility 6, 1 (2013), 83--92.",
      "doi": ""
    },
    {
      "text": "William Easley, Michele A Williams, Ali Abdolrahmani, Caroline Galbraith, Stacy M Branham, Amy Hurst, and Shaun K Kane. 2016. Let's Get Lost: Exploring Social Norms In Predominately Blind Environments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2034--2040.",
      "doi": "10.1145/2851581.2892470"
    },
    {
      "text": "Vanja Garaj, Rommanee Jirawimut, Piotr Ptasinski, Franjo Cecelja, and Wamadeva Balachandran. 2003. A system for remote sighted guidance of visually impaired pedestrians. British Journal of Visual Impairment 21, 2 (2003), 55--63.",
      "doi": ""
    },
    {
      "text": "João Guerreiro, Dragan Ahmetovic, Daisuke Sato, Kris Kitani, and Chieko Asakawa. 2019. Airport Accessibility and Navigation Assistance for People with Visual Impairments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 16.",
      "doi": "10.1145/3290605.3300246"
    },
    {
      "text": "Everett W Hill and Purvis Ponder. 1976. Orientation and mobility techniques: A guide for the practitioner. American Foundation for the Blind.",
      "doi": ""
    },
    {
      "text": "Nicole Holmes, Kelly Prentice, and others. 2015. iPhone video link facetime as an orientation tool: remote O&M for people with vision impairment. IJOM 7 (2015), 60--7.",
      "doi": ""
    },
    {
      "text": "Bill Holton. 2013. A review of the taptapsee, camfind, and talking goggles object identification apps for the iphone. AFB AccessWorld Magazine 14 (2013).",
      "doi": ""
    },
    {
      "text": "Bill Holton. 2015a. Crowdviz: Remote video assistance on your iphone. (2015).",
      "doi": ""
    },
    {
      "text": "Bill Holton. 2015b. A Review of the Be My Eyes Remote Sighted Helper App for Apple iOS. AFB AccessWorld Magazine 16, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Bill Holton. 2016. BeSpecular: A New Remote Assistant Service. AFB AccessWorld Magazine 17, 7 (2016).",
      "doi": ""
    },
    {
      "text": "Ziad Hunaiti, Vanja Garaj, and Wamadeva Balachandran. 2006. A remote vision guidance system for visually impaired pedestrians. The journal of navigation 59, 3 (2006), 497--504.",
      "doi": ""
    },
    {
      "text": "S. Ikehata, H. Yang, and Y. Furukawa. 2015. Structured Indoor Modeling. In 2015 IEEE International Conference on Computer Vision (ICCV). 1323--1331. DOI: http://dx.doi.org/10.1109/ICCV.2015.156",
      "doi": ""
    },
    {
      "text": "Dhruv Jain. 2014. Path-guided indoor navigation for the visually impaired using minimal building retrofitting. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 225--232.",
      "doi": "10.1145/2661334.2661359"
    },
    {
      "text": "Seita Kayukawa, Keita Higuchi, João Guerreiro, Shigeo Morishima, Yoichi Sato, Kris Kitani, and Chieko Asakawa. 2019. BBeep: A Sonic Collision Avoidance System for Blind Travellers and Nearby Pedestrians. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, Article 52, 12 pages.",
      "doi": "10.1145/3290605.3300282"
    },
    {
      "text": "Bing Li, J Pablo Munoz, Xuejian Rong, Jizhong Xiao, Yingli Tian, and Aries Arditi. 2016. ISANA: wearable context-aware indoor assistive navigation with obstacle avoidance for the blind. In European Conference on Computer Vision. Springer, 448--462.",
      "doi": ""
    },
    {
      "text": "Brian J Nguyen, Yeji Kim, Kathryn Park, Allison J Chen, Scarlett Chen, Donald Van Fossan, and Daniel L Chao. 2018. Improvement in Patient-Reported Quality of Life Outcomes in Severely Visually Impaired Individuals Using the Aira Assistive Technology System. Translational vision science & technology 7, 5 (2018), 30--30.",
      "doi": ""
    },
    {
      "text": "Paymon Rafian and Gordon E Legge. 2017. Remote Sighted Assistants for Indoor Location Sensing of Visually Impaired Pedestrians. ACM Transactions on Applied Perception (TAP) 14, 3 (2017), 19.",
      "doi": "10.1145/3047408"
    },
    {
      "text": "Sandra Rosen. 2014. Human Guide Techniques: Study Guide. In STEP-BY-STEP: A Guide to Mobility Techniques. American Printing House for the Blind.",
      "doi": ""
    },
    {
      "text": "Elisabeth Salzhauer Axel, Virginia Hooper, Teresa Kardoulias, Sarah Stephenson Keyes, and Francesca Rosenberg. 2003. ABS's Guidelines for Verbal Description. In Art Beyond Sight: A Resource Guide to Art, Creativity, and Visual Impairment. American Foundation for the Blind, 229--237.",
      "doi": ""
    },
    {
      "text": "Daisuke Sato, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. Navcog3: An evaluation of a smartphone-based blind indoor navigation assistant with semantic features in a large-scale environment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 270--279.",
      "doi": "10.1145/3132525.3132535"
    },
    {
      "text": "Morgan Klaus Scheuerman, William Easley, Ali Abdolrahmani, Amy Hurst, and Stacy Branham. 2017. Learning the language: The importance of studying written directions in designing navigational technologies for the blind. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2922--2928.",
      "doi": "10.1145/3027063.3053260"
    },
    {
      "text": "Martin Swobodzinski and Martin Raubal. 2009. An indoor routing algorithm for the blind: development and comparison to a routing algorithm for the sighted. International Journal of Geographical Information Science 23, 10 (2009), 1315--1343.",
      "doi": ""
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: a study of daily challenges of low vision people. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 61--72.",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Anja Thieme, Cynthia L Bennett, Cecily Morrison, Edward Cutrell, and Alex S Taylor. 2018. I can do everything but see!--How People with Vision Impairments Negotiate their Abilities in Social Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 203.",
      "doi": "10.1145/3173574.3173777"
    },
    {
      "text": "Simon Ungar. 2000. Cognitive mapping without visual experience. Cognitive mapping: past, present, and future 4 (2000), 221.",
      "doi": ""
    },
    {
      "text": "William R Wiener, Richard L Welsh, and Bruce B Blasch. 2010. Foundations of orientation and mobility. Vol. 1. American Foundation for the Blind.",
      "doi": ""
    },
    {
      "text": "Michele A Williams, Caroline Galbraith, Shaun K Kane, and Amy Hurst. 2014. Just let the cane hit it: how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 217--224.",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Michele A Williams, Amy Hurst, and Shaun K Kane. 2013. Pray before you step out: describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 28.",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Chien Wen Yuan, Benjamin V Hanrahan, Sooyeon Lee, Mary Beth Rosson, and John M Carroll. 2017. I Didn'T Know That You Knew I Knew: Collaborative Shopping Practices Between People with Visual Impairment and People with Vision. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 118.",
      "doi": "10.1145/3134753"
    },
    {
      "text": "Michael Zöllner, Stephan Huber, Hans-Christian Jetter, and Harald Reiterer. 2011. NAVI--a proof-of-concept of a mobile navigational aid for visually impaired based on the microsoft kinect. In IFIP Conference on Human-Computer Interaction. Springer, 584--587.",
      "doi": ""
    }
  ]
}