{
  "doi": "10.1145/3313831.3376795",
  "title": "Multimodal and Mixed Control of Robotic Endoscopes",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Bedside robotic endoscopes render surgeons autonomous from assistants, potentially improving surgical outcome and decreasing costs. Why then have they not been widely adopted? We take a step back and first characterize classic (non-robotic) endoscope use through observations, literature and a domain expert interview. We review the literature on bedside robotic endoscopes and find that existing controls, individually, do not have the power to support both intended and appropriated endoscope uses. We thus explore combining controls to support this diversity of uses. Through an iterative cycle, we design and implement a multimodal and mixed-initiative technique that combines two user controls and one system control. Our evaluations confirm that individual controls do not satisfy the diversity of endoscope uses, and also that our technique indeed does so. Our work highlights the relevance of HCI research in the medical domain through robotic systems.",
  "authors": [
    {
      "name": "Ignacio Avellino",
      "institution": "Sorbonne Université, CNRS, ISIR, Paris, France",
      "img": "/do/10.1145/contrib-83059048357/rel-imgonly/8383498_headshotcropped.jpeg",
      "acmid": "83059048357",
      "orcid": "0000-0002-1496-3794"
    },
    {
      "name": "Gilles Bailly",
      "institution": "Sorbonne Université, CNRS, ISIR, Paris, France",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    },
    {
      "name": "Mario Arico",
      "institution": "Sorbonne Université, CNRS, ISIR, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526940",
      "orcid": "missing"
    },
    {
      "name": "Guillaume Morel",
      "institution": "Sorbonne Université, CNRS, ISIR, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100034775",
      "orcid": "missing"
    },
    {
      "name": "Geoffroy Canlorbe",
      "institution": "Hôpital Universitaire de la Pitié-Salpêtrière, AP-HP & Sorbonne Université, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365103",
      "orcid": "0000-0003-2653-4097"
    }
  ],
  "references": [
    {
      "text": "Latif Al-Hakim, Ming Wang, Jiaquan Xiao, Dennis Gyomber, and Shomik Sengupta. 2019. Hierarchical task analysis for identification of interrelationships between ergonomic, external disruption, and internal disruption in complex laparoscopic procedures. Surgical Endoscopy Article not assigned to an issue (Jan. 2019), 1--15. DOI: http://dx.doi.org/10.1007/s00464-018-06656-z",
      "doi": ""
    },
    {
      "text": "M. E. Allaf, S. V. Jackman, P. G. Schulam, J. A. Cadeddu, B. R. Lee, R. G. Moore, and L. R. Kavoussi. 1998. Laparoscopic visual field. Surgical Endoscopy 12, 12 (Dec. 1998), 1415--1418. DOI: http://dx.doi.org/10.1007/s004649900871",
      "doi": ""
    },
    {
      "text": "J. E. Allen, C. I. Guinn, and E. Horvtz. 1999. Mixed-initiative interaction. IEEE Intelligent Systems and their Applications 14, 5 (Sept. 1999), 14--23. DOI: http://dx.doi.org/10.1109/5254.796083",
      "doi": ""
    },
    {
      "text": "Ignacio Avellino, Gilles Bailly, Geoffroy Canlorbe, Jérémie Belgihti, Guillaume Morel, and Marie-Aude Vitrani. 2019. Impacts of Telemanipulation in Robotic Assisted Surgery. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 583:1--583:15. DOI: http://dx.doi.org/10.1145/3290605.3300813 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290605.3300813"
    },
    {
      "text": "Andreas Bihlmaier. 2016. Endoscope Robots and Automated Camera Guidance. In Learning Dynamic Spatial Relations: The Case of a Knowledge-based Endoscopic Camera Guidance Robot, Andreas Bihlmaier (Ed.). Springer Fachmedien Wiesbaden, Wiesbaden, 23--102. DOI: http://dx.doi.org/10.1007/978--3--658--14914--7_2",
      "doi": ""
    },
    {
      "text": "F. Bourger, C. Doignon, P. Zanne, and M. de Mathelin. 2007. A Model-free Vision-based Robot Control for Minimally Invasive Surgery using ESM Tracking and Pixels Color Selection. In Proceedings 2007 IEEE International Conference on Robotics and Automation. IEEE, New York, NY, USA, 3579--3584. DOI: http://dx.doi.org/10.1109/ROBOT.2007.364026",
      "doi": ""
    },
    {
      "text": "G. F. Buess, A. Arezzo, M. O. Schurr, F. Ulmer, H. Fisher, L. Gumb, T. Testa, and C. Nobman. 2000. A new remote-controlled endoscope positioning system for endoscopic solo surgery. The FIPS endoarm. Surgical Endoscopy 14, 4 (April 2000), 395--399. DOI: http://dx.doi.org/10.1007/s004640020066",
      "doi": ""
    },
    {
      "text": "C. G. Cao, C. L. MacKenzie, J. A. Ibbotson, L. J. Turner, N. P. Blair, and A. G. Nagy. 1999. Hierarchical decomposition of laparoscopic procedures. Studies in Health Technology and Informatics 62 (1999), 83--89.",
      "doi": ""
    },
    {
      "text": "Chan Jason Y. K., Leung Iris, Navarro-Alarcon David, Lin Weiyang, Li Peng, Lee Dennis L. Y., Liu Yun-hui, and Tong Michael C. F. 2015. Foot-controlled robotic-enabled endoscope holder for endoscopic sinus surgery: A cadaveric feasibility study. The Laryngoscope 126, 3 (Sept. 2015), 566--569. DOI: http://dx.doi.org/10.1002/lary.25634",
      "doi": ""
    },
    {
      "text": "Amy Cheatle, Hannah Pelikan, Malte Jung, and Steven Jackson. 2019. Sensing (Co)Operations: Articulation and Compensation in the Robotic Operating Room. Proc. ACM Hum.-Comput. Interact. 3, CSCW (Nov. 2019), 225:1--225:26. DOI: http://dx.doi.org/10.1145/3359327",
      "doi": "10.1145/3359327"
    },
    {
      "text": "Hanyu Chen, Bin Ma, Peng Gao, Hongchi Wang, Yongxi Song, Linhao Tong, Peiwen Li, and Zhenning Wang. 2017. Laparoscopic intersphincteric resection versus an open approach for low rectal cancer: a meta-analysis. World Journal of Surgical Oncology 15, 1 (Dec. 2017), 229. DOI: http://dx.doi.org/10.1186/s12957-017--1304--3",
      "doi": ""
    },
    {
      "text": "M. W. Dobson, D. Geisler, V. Fazio, F. Remzi, T. Hull, and J. Vogel. 2011. Minimally invasive surgical wound infections: laparoscopic surgery decreases morbidity of surgical site infections and decreases the cost of wound care. Colorectal Disease 13, 7 (2011), 811--815. DOI: http://dx.doi.org/10.1111/j.1463--1318.2010.02302.x",
      "doi": ""
    },
    {
      "text": "Lin Dong and Guillaume Morel. 2016. Robust trocar detection and localization during robot-assisted endoscopic surgery. In 2016 IEEE International Conference on Robotics and Automation (ICRA). IEEE, New York, NY, USA, 4109--4114. DOI: http://dx.doi.org/10.1109/ICRA.2016.7487602",
      "doi": "10.1109/ICRA.2016.7487602"
    },
    {
      "text": "Patrick Finlay. 1996. Clinical experience with a goniometric head-controlled laparoscope manipulator. (1996).",
      "doi": ""
    },
    {
      "text": "Patrick Finlay. 2001. A robotic camera holder for laparoscopy. In Proceedings of 10th International Conference on Advanced Robotics. Workshop 2 on Medical Robotics, 2001. IEEE, New York, NY, USA, 129--132.",
      "doi": ""
    },
    {
      "text": "P. A. Finlay and M. H. Ornstein. 1995. Controlling the movement of a surgical laparoscope. IEEE Engineering in Medicine and Biology Magazine 14, 3 (May 1995), 289--291. DOI: http://dx.doi.org/10.1109/51.391775",
      "doi": ""
    },
    {
      "text": "Anthony G. Gallagher, Musallam Al-Akash, Neal E. Seymour, and Richard M. Satava. 2008. An ergonomic analysis of the effects of camera rotation on laparoscopic performance. Surgical Endoscopy 23, 12 (Dec. 2008), 2684. DOI: http://dx.doi.org/10.1007/s00464-008-0261-x",
      "doi": ""
    },
    {
      "text": "Quentin Galvane, Rémi Ronfard, Marc Christie, and Nicolas Szilas. 2014. Narrative-driven Camera Control for Cinematic Replay of Computer Games. In Proceedings of the Seventh International Conference on Motion in Games (MIG '14). ACM, NY, NY, USA, 109--117. DOI: http://dx.doi.org/10.1145/2668064.2668104 event-place: Playa Vista, California.",
      "doi": "10.1145/2668064.2668104"
    },
    {
      "text": "Robert Geiger and Jürgen Scherr. 2009. Surgery assistance system for guiding a surgical instrument. U.S. Patent 8433389B2. (20 March 2009). https://patents.google.com/patent/US8433389B2/en Filed March 20, 2009.",
      "doi": ""
    },
    {
      "text": "Andrew A. Gumbs, Fernando Crovari, Clement Vidal, Patrick Henri, and Brice Gayet. 2007. Modified Robotic Lightweight Endoscope (ViKY) Validation In Vivo in a Porcine Model. Surgical Innovation 14, 4 (Dec. 2007), 261--264. DOI: http://dx.doi.org/10.1177/1553350607310281",
      "doi": ""
    },
    {
      "text": "G. S. Guthart and J. K. Salisbury. 2000. The Intuitive(TM) telesurgery system: overview and application. In Proceedings 2000 ICRA. Millennium Conference. IEEE International Conference on Robotics and Automation. Symposia Proceedings (Cat. No.00CH37065), Vol. 1. IEEE, San Francisco, CA, USA, 618--621 vol.1. DOI: http://dx.doi.org/10.1109/ROBOT.2000.844121",
      "doi": ""
    },
    {
      "text": "Chris Harrison and Anind K. Dey. 2008. Lean and Zoom: Proximity-aware User Interface and Content Magnification. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 507--510. DOI: http://dx.doi.org/10.1145/1357054.1357135",
      "doi": ""
    },
    {
      "text": "Surgical Intuitive. 2016. Intuitive Surgical Announces Preliminary Fourth Quarter and Full Year 2015 Results. (Jan. 2016). https://isrg.intuitive.com/news-releases/ news-release-details/ intuitive-surgical-announces-preliminary-fourth-quarter-and-1",
      "doi": ""
    },
    {
      "text": "Surgical Intuitive. 2019. Intuitive Surgical Announces Preliminary Fourth Quarter and Full Year 2018 Results. (Jan. 2019). https://isrg.intuitive.com/news-releases/ news-release-details/ intuitive-surgical-announces-preliminary-fourth-quarter-and-4",
      "doi": ""
    },
    {
      "text": "Thibaut Jacob, Gilles Bailly, Eric Lecolinet, Géry Casiez, and Marc Teyssier. 2016. Desktop Orbital Camera Motions Using Rotational Head Movements. In In proceedings of SUI'16, the ACM Symposium on Spatial User Interaction. Tokyo, Japan, 139--148. DOI: http://dx.doi.org/10.1145/2983310.2985758",
      "doi": ""
    },
    {
      "text": "Thomas Jaschinski, Christoph G. Mosch, Michaela Eikermann, Edmund Am Neugebauer, and Stefan Sauerland. 2018. Laparoscopic versus open surgery for suspected appendicitis. The Cochrane Database of Systematic Reviews 11 (2018), CD001546. DOI: http://dx.doi.org/10.1002/14651858.CD001546.pub4",
      "doi": ""
    },
    {
      "text": "Sing Bing Kang. 1999. Hands-free interface to a virtual reality environment using head tracking. U.S. Patent 6009210A. (Dec. 1999). https://patents.google.com/patent/US6009210A/en Filled March 05, 1997.",
      "doi": ""
    },
    {
      "text": "Brady W. King, Luke A. Reisner, Abhilash K. Pandya, Anthony M. Composto, R. Darin Ellis, and Michael D. Klein. 2013. Towards an Autonomous Robot for Camera Control During Laparoscopic Surgery. Journal of Laparoendoscopic & Advanced Surgical Techniques 23, 12 (Nov. 2013), 1027--1030. DOI: http://dx.doi.org/10.1089/lap.2013.0304",
      "doi": ""
    },
    {
      "text": "Julia Kristin, Robert Geiger, Peter Kraus, and Thomas Klenzner. 2015. Assessment of the endoscopic range of motion for head and neck surgery using the SOLOASSIST endoscope holder. The International Journal of Medical Robotics and Computer Assisted Surgery 11, 4 (2015), 418--423. DOI: http://dx.doi.org/10.1002/rcs.1643",
      "doi": ""
    },
    {
      "text": "Cheolwhan Lee, Yuan-Fang Wang, D.R. Uecker, and Yulun Wang. 1994. Image analysis for automated tracking in robot-assisted endoscopic surgery. In Proceedings of 12th International Conference on Pattern Recognition, Vol. 1. IEEE, New York, NY, USA, 88--92 vol.1. DOI: http://dx.doi.org/10.1109/ICPR.1994.576232",
      "doi": ""
    },
    {
      "text": "L. MacKenzie, J. A. Ibbotson, C. G. L. Cao, and A. J. Lomax. 2001. Hierarchical decomposition of laparoscopic surgery: a human factors approach to investigating the operating room environment. Minimally Invasive Therapy & Allied Technologies 10, 3 (Jan. 2001), 121--127. DOI: http://dx.doi.org/10.1080/136457001753192222",
      "doi": ""
    },
    {
      "text": "Helena M. Mentis, Kenton O'Hara, Gerardo Gonzalez, Abigail Sellen, Robert Corish, Antonio Criminisi, Rikin Trivedi, and Pierre Theodore. 2015. Voice or Gesture in the Operating Room. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 773--780. DOI: http://dx.doi.org/10.1145/2702613.2702963",
      "doi": "10.1145/2702613.2702963"
    },
    {
      "text": "L. Mettler, M. Ibrahim, and W. Jonat. 1998. One year of experience working with the aid of a robotic assistant (the voice-controlled optic holder AESOP) in gynaecological endoscopic surgery. Human Reproduction 13, 10 (Oct. 1998), 2748--2750. DOI: http://dx.doi.org/10.1093/humrep/13.10.2748",
      "doi": ""
    },
    {
      "text": "A. Mirbagheri, F. Farahmand, A. Meghdari, and F. Karimian. 2011. Design and development of an effective low-cost robotic cameraman for laparoscopic surgery: RoboLens. Scientia Iranica 18, 1 (Feb. 2011), 105--114. DOI: http://dx.doi.org/10.1016/j.scient.2011.03.012",
      "doi": ""
    },
    {
      "text": "Katie Moon and Deborah Blackman. 2014. A Guide to Understanding Social Science Research for Natural Scientists. Conservation Biology 28, 5 (2014), 1167--1177. DOI: http://dx.doi.org/10.1111/cobi.12326",
      "doi": ""
    },
    {
      "text": "Pedro Ballester Nebot, Yatin Jain, Kevin Haylett, Robert Stone, and Rory McCloy. 2003. Comparison of Task Performance of the Camera-Holder Robots EndoAssist and Aesop. Surgical Laparoscopy Endoscopy & Percutaneous Techniques 13, 5 (Oct. 2003), 334. https://journals.lww.com/surgical-laparoscopy/ Abstract/2003/10000/Comparison_of_Task_Performance_ of_the.10.aspx",
      "doi": ""
    },
    {
      "text": "E. Neugebauer, H. Troidl, C. K. Kum, E. Eypasch, M. Miserez, and A. Paul. 1995. The E.A.E.S. Consensus development conferences on laparoscopic cholecystectomy, appendectomy, and hernia repair. Surgical Endoscopy 9, 5 (May 1995), 550--563. DOI: http://dx.doi.org/10.1007/BF00206852",
      "doi": ""
    },
    {
      "text": "A. Nishikawa, T. Hosoi, K. Koara, D. Negoro, A. Hikita, S. Asano, H. Kakutani, F. Miyazaki, M. Sekimoto, M. Yasui, Y. Miyake, S. Takiguchi, and M. Monden. 2003. FAce MOUSe: A novel human-machine interface for controlling the position of a laparoscope. IEEE Transactions on Robotics and Automation 19, 5 (Oct. 2003), 825--841. DOI: http://dx.doi.org/10.1109/TRA.2003.817093",
      "doi": ""
    },
    {
      "text": "Atsushi Nishikawa, Hiroaki Nakagoe, Kazuhiro Taniguchi, Yasuo Yamada, Mitsugu Sekimoto, Shuji Takiguchi, Morito Monden, and Fumio Miyazaki. 2008. How Does the Camera Assistant Decide the Zooming Ratio of Laparoscopic Images? Analysis and Implementation. In Medical Image Computing and Computer-Assisted Intervention -- MICCAI 2008 (MICCAI '08), Dimitris Metaxas, Leon Axel, Gabor Fichtinger, and Gábor Székely (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 611--618. DOI: http://dx.doi.org/10.1007/978--3--540--85990--1_73",
      "doi": ""
    },
    {
      "text": "Ilana Nisky, Felix Huang, Amit Milstein, Carla M. Pugh, Ferdinando A. Mussa-ivaldi, and Amir Karniel. 2012. Perception of Stiffness in Laparoscopy -- the Fulcrum Effect. Studies in health technology and informatics 173 (2012), 313--319. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4102265/",
      "doi": ""
    },
    {
      "text": "Kenton O'Hara, Gerardo Gonzalez, Abigail Sellen, Graeme Penney, Andreas Varnavas, Helena Mentis, Antonio Criminisi, Robert Corish, Mark Rouncefield, Neville Dastur, and Tom Carrell. 2014. Touchless Interaction in Surgery. Commun. ACM 57, 1 (Jan. 2014), 70--77. DOI: http://dx.doi.org/10.1145/2541883.2541899",
      "doi": "10.1145/2541883.2541899"
    },
    {
      "text": "T. Osa, C. Staub, and A. Knoll. 2010. Framework of automatic robot surgery system using Visual servoing. In 2010 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, New York, NY, USA, 1837--1842. DOI: http://dx.doi.org/10.1109/IROS.2010.5650301",
      "doi": ""
    },
    {
      "text": "Hannah R. M. Pelikan, Amy Cheatle, Malte F. Jung, and Steven J. Jackson. 2018. Operating at a Distance - How a Teleoperated Surgical Robot Reconfigures Teamwork in the Operating Room. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018), 138:1--138:28. DOI: http://dx.doi.org/10.1145/3274407",
      "doi": ""
    },
    {
      "text": "C. Perin, P. Dragicevic, and J. Fekete. 2014. Revisiting Bertin Matrices: New Interactions for Crafting Tabular Visualizations. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec. 2014), 2082--2091. DOI: http://dx.doi.org/10.1109/TVCG.2014.2346279",
      "doi": ""
    },
    {
      "text": "I. Rivas-Blanco, B. Estebanez, M. Cuevas-Rodriguez, E. Bauzano, and V. F. Muñoz. 2014. Towards a cognitive camera robotic assistant. In 5th IEEE RAS/EMBS International Conference on Biomedical Robotics and Biomechatronics. IEEE, New York, NY, USA, 739--744. DOI: http://dx.doi.org/10.1109/BIOROB.2014.6913866",
      "doi": ""
    },
    {
      "text": "J. M. Sackier and Y. Wang. 1994. Robotically assisted laparoscopic surgery. Surgical Endoscopy 8, 1 (Jan. 1994), 63--66. DOI: http://dx.doi.org/10.1007/BF02909496",
      "doi": ""
    },
    {
      "text": "Daniel J. Scott, Patricia C. Bergen, Robert V. Rege, Royce Laycock, Seifu T. Tesfay, R. James Valentine, David M. Euhus, D. Rohan Jeyarajah, William M. Thompson, and Daniel B. Jones. 2000. Laparoscopic training on bench models: better and more cost effective than operating room experience? 1. Journal of the American College of Surgeons 191, 3 (Sept. 2000), 272--283. DOI: http://dx.doi.org/10.1016/S1072--7515(00)00339--2",
      "doi": ""
    },
    {
      "text": "Daniel J. Scott, William N. Young, Seifu T. Tesfay, William H. Frawley, Robert V. Rege, and Daniel B. Jones. 2001. Laparoscopic skills training. The American Journal of Surgery 182, 2 (Aug. 2001), 137--142. DOI: http://dx.doi.org/10.1016/S0002--9610(01)00669--9",
      "doi": ""
    },
    {
      "text": "Anna Serur, Rebecca Rhee, and Matthew M. Philp. 2015. The Role of a Bedside Assistant. In Robotic Approaches to Colorectal Surgery, Howard Ross, Sang Lee, Bradley J. Champagne, Alessio Pigazzi, and David E. Rivadeneira (Eds.). Springer International Publishing, Cham, 111--117. DOI: http://dx.doi.org/10.1007/978--3--319-09120--4_9",
      "doi": ""
    },
    {
      "text": "J. Bryan Sexton, Martin A. Makary, Anthony R. Tersigni, David Pryor, Ann Hendrich, Eric J. Thomas, Christine G. Holzmueller, Andrew P. Knight, Yun Wu, and Peter J. Pronovost. 2006. Teamwork in the operating room: frontline perspectives among hospitals and operating room personnel. Anesthesiology 105, 5 (Nov. 2006), 877--884.",
      "doi": ""
    },
    {
      "text": "Torben Sko and Henry J. Gardner. 2009. Head Tracking in First-Person Games: Interaction Using a Web-Camera. In Proceedings of the 12th IFIP TC 13 International Conference on Human-Computer Interaction: Part I (INTERACT '09). Springer-Verlag, Berlin, Heidelberg, 342--355. DOI: http://dx.doi.org/10.1007/978--3--642-03655--2_38",
      "doi": ""
    },
    {
      "text": "Karem Slim and Michel Canis. 2017. La chirurgie robotique. Peut-on (doit-on) nager à contre-courant -- La Presse Médicale 46, 6 (June 2017), 557 -- 560. DOI: http://dx.doi.org/10.1016/j.lpm.2017.04.004",
      "doi": ""
    },
    {
      "text": "Jens-Uwe Stolzenburg, Toni Franz, Panagiotis Kallidonis, Do Minh, Anja Dietel, James Hicks, Martin Nicolaus, Abdulrahman Al-Aown, and Evangelos Liatsikos. 2011. Comparison of the FreeHand® robotic camera holder with human assistants during endoscopic extraperitoneal radical prostatectomy. BJU International 107, 6 (2011), 970--974. DOI: http://dx.doi.org/10.1111/j.1464--410X.2010.09656.x",
      "doi": ""
    },
    {
      "text": "R. H. Taylor, J. Funda, B. Eldridge, S. Gomory, K. Gruben, D. LaRose, M. Talamini, L. Kavoussi, and J. Anderson. 1995. A telerobotic assistant for laparoscopic surgery. IEEE Engineering in Medicine and Biology Magazine 14, 3 (May 1995), 279--288. DOI: http://dx.doi.org/10.1109/51.391776",
      "doi": ""
    },
    {
      "text": "Charlotte Tsui, Rachel Klein, and Matthew Garabrant. 2013. Minimally invasive surgery: national trends in adoption and future directions for hospital strategy. Surgical Endoscopy 27, 7 (July 2013), 2253--2257. DOI: http://dx.doi.org/10.1007/s00464-013--2973--9",
      "doi": ""
    },
    {
      "text": "F. A. Voorhorst, D. W. Meijer, and C. J. Overbeeke. 1999. Head-controlled laparoscopy: experiment, prototype, and preliminary results. Journal of Laparoendoscopic & Advanced Surgical Techniques. Part A 9, 5 (Oct. 1999), 379--388. DOI: http://dx.doi.org/10.1089/lap.1999.9.379",
      "doi": ""
    },
    {
      "text": "Colin Ware, Kevin Arthur, and Kellogg S. Booth. 1993. Fish Tank Virtual Reality. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93). ACM, NY, NY, USA, 37--42. DOI: http://dx.doi.org/10.1145/169059.169066",
      "doi": ""
    },
    {
      "text": "Guo-Qing Wei, K. Arbter, and G. Hirzinger. 1997. Real-time visual servoing for laparoscopic surgery. Controlling robot motion with color image segmentation. IEEE Engineering in Medicine and Biology Magazine 16, 1 (Jan. 1997), 40--45. DOI: http://dx.doi.org/10.1109/51.566151",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, AungHtet Htet, and Edmund F. LoPresti. 2003. Text entry from power wheelchairs: edgewrite for joysticks and touchpads. ACM SIGACCESS Accessibility and Computing (Sept. 2003). https://dl.acm.org/doi/abs/10.1145/1029014.1028650",
      "doi": ""
    },
    {
      "text": "Kota Yamaguchi, Takashi Komuro, and Masatoshi Ishikawa. 2009. Ptz Control with Head Tracking for Video Chat. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, NY, NY, USA, 3919--3924. DOI: http://dx.doi.org/10.1145/1520340.1520594",
      "doi": ""
    },
    {
      "text": "Piaopiao Ye, Na Zhao, Jing Shu, Heping Shen, Yanpeng Wang, Lifeng Chen, and Xiaojian Yan. 2019. Laparoscopy versus open surgery for adnexal masses in pregnancy: a meta-analytic review. Archives of Gynecology and Obstetrics 299, 3 (March 2019), 625--634. DOI: http://dx.doi.org/10.1007/s00404-018-05039-y",
      "doi": ""
    },
    {
      "text": "Xiaoli Zhang and Shahram Payandeh. 2002. Application of visual tracking for robot-assisted laparoscopic surgery. Journal of Robotic Systems 19, 7 (2002), 315--328. DOI: http://dx.doi.org/10.1002/rob.10043",
      "doi": ""
    }
  ]
}