{
  "doi": "10.1145/3313831.3376495",
  "title": "When Design Novices and LEGO® Meet: Stimulating Creative Thinking for Interface Design",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Design thinking is an iterative, human-centered approach to innovation. Its success rests on collaboration within a multidisciplinary project team going through cycles of divergent and convergent ideations. In these teams, nondesigners risk diminishing the divergent reach because they are generally reluctant to sketch, thus missing out on theambiguous, imprecise early conceptual divergent phases. We hypothesized that LEGO® could advantageously be a substitute to sketching. In this comparative study, 44 nondesigners randomly paired in 22 dyads did two conceptual ideations of healthcare landing pages, one using pen/paper (spontaneously writing words on sticky notes) and the other using LEGO, assessed through Torrance and Guilford frameworks for divergent thinking. Results show that LEGO interfaces gathered significantly higher divergent thinking scores because their concepts were significantly more elaborated. Furthermore, when using LEGO, teams who generated more elements were likely to also generate more ideas, more categories of ideas and more original ideas.",
  "authors": [
    {
      "name": "Simon Bourdeau",
      "institution": "ESG-UQAM, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660551984",
      "orcid": "missing"
    },
    {
      "name": "Annemarie Lesage",
      "institution": "HEC Montréal, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414621630",
      "orcid": "missing"
    },
    {
      "name": "Béatrice Couturier Caron",
      "institution": "HEC Montréal, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527133",
      "orcid": "missing"
    },
    {
      "name": "Pierre-Majorique Léger",
      "institution": "HEC Montréal, Montréal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344493946",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Edith Ackermann, David Gauntlett and Cecilia Weckstrom. 2009. Defining systematic creativity. LEGO Learning Institute, Billund, Denmark.",
      "doi": ""
    },
    {
      "text": "Teresa M Amabile. 1982. Social psychology of creativity: A consensual assessment technique. Journal of personality and social psychology 43, 5 (1982), 997. http://dx.doi.org/10.1037/0022--3514.43.5.997",
      "doi": ""
    },
    {
      "text": "Bonnie B Armbruster. 1989. Metacognition in creativity. In Handbook of creativity, J.A. Glover et al. Eds. Springer, Boston, MA, 177--182. http://dx.doi.org/10.1007/978--1--4757--5356--1_10",
      "doi": ""
    },
    {
      "text": "Sondra Bacharach and Roy T Cook. 2017. Introduction: Play Well, Philosophize Well! In Lego® and Philosophy: Constructing Reality Brick by Brick, Roy T. Cook and Sondra Bacharach Eds. Wiley Blackwell, Hoboken, NJ, 1--3.",
      "doi": ""
    },
    {
      "text": "Christian Bason and Robert D Austin. 2019. The right way to lead design thinking. Harvard Business Review 97, 2 (2019), 82--91.",
      "doi": ""
    },
    {
      "text": "Patrick Bateson. 2015. Playfulness and creativity. Current Biology 25, 1 (2015), R12-R16. http://dx.doi.org/10.1016/j.cub.2014.09.009",
      "doi": ""
    },
    {
      "text": "Patrick Bateson and Paul Martin. 2013. Play, playfulness, creativity and innovation. Cambridge University Press,",
      "doi": ""
    },
    {
      "text": "Patrick Bateson and Daniel Nettle. 2014. Playfulness, ideas, and creativity: A Survey. Creativity Research Journal 26, 2 (2014), 219--222. http://dx.doi.org/10.1080/10400419.2014.901091",
      "doi": ""
    },
    {
      "text": "Joran W Booth, Elkin A Taborda, Karthik Ramani and Tahira Reid. 2016. Interventions for teaching sketching skills and reducing inhibition for novice engineering designers. Design Studies 43 (2016), 1--23. http://dx.doi.org/10.1016/j.destud.2015.11.002",
      "doi": ""
    },
    {
      "text": "Simon Bowen, Abigail Durrant, Bettina Nissen, John Bowers and Peter Wright. 2016. The value of designers' creative practice within complex collaborations. Design Studies 46 (2016), 174--198. http://dx.doi.org/10.1016/j.destud.2016.06.001",
      "doi": ""
    },
    {
      "text": "Nicolai Brodersen Hansen, Peter Dalsgaard and Kim Halskov. 2017. Design tools and materials in creative work. In Proceedings of Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (2017). ACM, 376--379. http://dx.doi.org/10.1145/3064857.3064869",
      "doi": "10.1145/3064857.3064869"
    },
    {
      "text": "Tim Brown. 2009. Change by Design: How Design Thinking Transforms Organizations and Inspires Innovation. Harper Business, New York, NY.",
      "doi": ""
    },
    {
      "text": "Tim Brown and Barry Katz. 2011. Change by design. Journal of product innovation management 28, 3 (2011), 381--383. http://dx.doi.org/10.1111/j.15405885.2011.00806.x",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann,",
      "doi": ""
    },
    {
      "text": "Arthur Cropley. 2006. In praise of convergent thinking. Creativity research journal 18, 3 (2006), 391--404. http://dx.doi.org/10.1207/s15326934crj1803_13",
      "doi": ""
    },
    {
      "text": "Alma L Culén and Asbjørn Følstad. 2014. Innovation in HCI: what can we learn from design thinking? In Proceedings of Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, 849--852. http://dx.doi.org/10.1145/2639189.2654845",
      "doi": "10.1145/2639189.2654845"
    },
    {
      "text": "Peter Dalsgaard. 2017. Instruments of inquiry: Understanding the nature and role of tools in design. International Journal of Design 11, 1 (2017), 21--33.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard, Kim Halskov and Alexander Wiethoff. 2016. Designing media architecture: Tools and approaches for addressing the main design challenges. In Proceedings of CHI '16 Conference on Human Factors in Computing Systems (CHI '16). ACM, 2562--2573. http://dx.doi.org/10.1145/2858036.2858318",
      "doi": "10.1145/2858036.2858318"
    },
    {
      "text": "Alan Dix and Layda Gongora. 2011. Externalisation and design. In Proceedings of Procedings of the second conference on creativity and innovation in design (2011). ACM, 31--42. http://dx.doi.org/10.1145/2079216.2079220",
      "doi": "10.1145/2079216.2079220"
    },
    {
      "text": "Kees Dorst. 2011. The core of 'design thinking'and its application. Design studies 32, 6), 521--532.",
      "doi": ""
    },
    {
      "text": "Graham Dove, Sille Julie Abildgaard, Michael Mose Biskjær, Nicolai Brodersen Hansen, Bo T Christensen and Kim Halskov. 2018. Grouping notes through nodes: The functions of post-it notes in design team cognition. Design Studies 57 (2018), 112--134. http://dx.doi.org/10.1016/j.destud.2018.03.008",
      "doi": ""
    },
    {
      "text": "Clive L Dym, Alice M Agogino, Ozgur Eris, Daniel D Frey and Larry J Leifer. 2005. Engineering design thinking, teaching, and learning. Journal of engineering education 94, 1 (2005), 103--120. http://dx.doi.org/10.1002/j.2168--9830.2005.tb00832.x",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2003. Design-oriented humancomputer interaction. In Proceedings of Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '03). ACM, 225--232. http://dx.doi.org/10.1145/642611.642652",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Gerhard Fischer, Elisa Giaccardi, Hal Eden, Masanori Sugimoto and Yunwen Ye. 2005. Beyond binary choices: Integrating individual and social creativity. International Journal of Human-Computer Studies 63, 4--5 (2005), 482--512. http://dx.doi.org/10.1016/j.ijhcs.2005.04.014",
      "doi": "10.1016/j.ijhcs.2005.04.014"
    },
    {
      "text": "Courtney Lynn Gallagher. 2017. Sketching for Ideation: A Structured Approach for Increasing Divergent Thinking. In Proceedings of Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI '17). ACM, 106--111. http://dx.doi.org/10.1145/3027063.3048424",
      "doi": "10.1145/3027063.3048424"
    },
    {
      "text": "Raghu Garud, Sanjay Jain and Philipp Tuertscher. 2008. Incomplete by design and designing for incompleteness. Organization studies 29, 3 (2008), 351371. http://dx.doi.org/10.1177/0170840607088018",
      "doi": ""
    },
    {
      "text": "David Gauntlett. 2007. Creative exploration - New approaches to identities and audiences. Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "David Gauntlett. 2014. The LEGO System as a tool for thinking, creativity, and changing the world. In LEGO Studies: Examining the Building Blocks of a Transmedial Phenomenon, Mark J. P. Wolf Ed. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "David Gauntlett. 2018. Making is Connecting: The social power of creativity, from craft and knitting to digital everything. John Wiley & Sons, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Vinod Goel. 1995. Sketches of thought. MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Gabriela Goldschmidt. 1991. The dialectics of sketching. Creativity research journal 4, 2 (1991), 123--143. http://dx.doi.org/10.1080/10400419109534381",
      "doi": ""
    },
    {
      "text": "Gabriela Goldschmidt. 2016. Linkographic evidence for concurrent divergent and convergent thinking in creative design. Creativity research journal 28, 2 (2016), 115--122. http://dx.doi.org/10.1080/10400419.2016.1162497",
      "doi": ""
    },
    {
      "text": "Mark D Gross and Ellen Do. 1996. Ambiguous intentions: a paper-like interface for creative design. In Proceedings of In Proceedings of ACM Symposium on User Interface Software and Technology (UIST '96). ACM Press, 183--192 http://dx.doi.org/10.1145/237091.237119",
      "doi": "10.1145/237091.237119"
    },
    {
      "text": "Gunnar Harboe and Elaine M Huang. 2015. Realworld affinity diagramming practices: Bridging the paperdigital gap. In Proceedings of Proceedings of the 33rd annual ACM conference on human factors in computing systems (CHI '15). ACM, 95--104. http://dx.doi.org/10.1145/2702123.2702561",
      "doi": ""
    },
    {
      "text": "Helena Hashemi Farzaneh, Maria Katharina Kaiser and Udo Lindemann. 2012. Creative processes in groupsrelating communication, cognitive processes and solution ideas. In Proceedings of The 2nd International Conference on Design Creativity (ICDC2012)). 13--22.",
      "doi": ""
    },
    {
      "text": "Armand Hatchuel and Benoit Weil. Year. A new approach of innovative Design: an introduction to CK theory. In Proceedings of DS 31: Proceedings of ICED 03, the 14th International Conference on Engineering Design, Stockholm (2003).",
      "doi": ""
    },
    {
      "text": "Kyung Hee Kim. 2006. Is creativity unidimensional or multidimensional? Analyses of the Torrance Tests of Creative Thinking. Creativity Research Journal 18, 3 (2006), 251--259. http://dx.doi.org/10.1207/s15326934crj1803_2",
      "doi": ""
    },
    {
      "text": "Giulio Jacucci and Ina Wagner. 2007. Performative roles of materiality for collective creativity. In Proceedings of Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition (2007). ACM, 73--82. http://dx.doi.org/10.1145/1254960.1254971",
      "doi": "10.1145/1254960.1254971"
    },
    {
      "text": "Natasha Jen. 2017. Design Thinking Is Bullsh*t. Retrieved September, 4th 2019 from https://99u.adobe.com/videos/55967/natasha-jen-designthinking-is-bullshit.",
      "doi": ""
    },
    {
      "text": "Mads Møller Jensen, Roman Rädle, Clemens N Klokmose and Susanne Bodker. 2018. Remediating a design tool: Implications of digitizing sticky notes. In Proceedings of Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 224. http://dx.doi.org/10.1145/3173574.3173798",
      "doi": "10.1145/3173574.3173798"
    },
    {
      "text": "Mads Møller Jensen, Sarah-Kristin Thiel, Eve Hoggan and Susanne Bødker. 2018. Physical Versus Digital Sticky Notes in Collaborative Ideation. Computer Supported Cooperative Work (CSCW) 27, 3--6 (2018), 609645. http://dx.doi.org/10.1007/s10606-018--9325--1",
      "doi": "10.1007/s10606-018-9325-1"
    },
    {
      "text": "Ulla Johansson-Sköldberg, Jill Woodilla and Mehves Çetinkaya. 2013. Design thinking: past, present and possible futures. Creativity and innovation management 22, 2 (2013), 121--146. http://dx.doi.org/doi.org/10.1111/caim.12023",
      "doi": ""
    },
    {
      "text": "Heekyoung Jung, Heather Wiltse, Mikael Wiberg and Erik Stolterman. 2017. Metaphors, materialities, and affordances: Hybrid morphologies in the design of interactive artifacts. Design Studies 53 (2017), 24--46. http://dx.doi.org/10.1016/j.destud.2017.06.004",
      "doi": ""
    },
    {
      "text": "Manolya Kavakli and John S Gero. 2001. Sketching as mental imagery processing. Design studies 22, 4 (2001), 347--364. http://dx.doi.org/10.1016/S0142694X(01)00002--3",
      "doi": ""
    },
    {
      "text": "Jieun Kim and Hokyoung Ryu. 2014. A design thinking rationality framework: Framing and solving design problems in early concept generation. Human--Computer Interaction 29, 5--6 (2014), 516--553. http://dx.doi.org/10.1080/07370024.2014.896706",
      "doi": ""
    },
    {
      "text": "Michael J. Kirton. 1976. Adaptors and innovators: A description and measure. Journal of applied psychology 61, 5 (1976), 622. http://dx.doi.org/10.1037/00219010.61.5.622",
      "doi": "10.1037/0021-"
    },
    {
      "text": "Michael J. Kirton. 1999. Kirton adaptioninnovation inventory feedback booklet. Occupational Research Centre, Berkhamsted, UK).",
      "doi": ""
    },
    {
      "text": "Micheal J. Kirton. 2003. Adaptation-innovation in the context of diversity and change. Routledge, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Maaike Kleinsmann and Rianne Valkenburg. 2008. Barriers and enablers for creating shared understanding in co-design projects. Design studies 29, 4 (2008), 369--386. http://dx.doi.org/10.1016/j.destud.2008.03.003",
      "doi": ""
    },
    {
      "text": "Tore Kristensen. 2004. The physical context of creativity. Creativity and innovation management 13, 2 (2004), 89--96. http://dx.doi.org/10.1111/j.09631690.2004.00297.x",
      "doi": ""
    },
    {
      "text": "Per Kristiansen and Robert Rasmussen. 2014. Building a Better Business Using the Lego Serious Play Method. John Wiley & Sons, Hoboken, New Jersey.",
      "doi": ""
    },
    {
      "text": "Annemarie Lesage, Hubert-David Au-Yeung, Simon Bourdeau, Béatrice C Caron and Pierre-Majorique Léger. 2019. Sketch or Play?: LEGO® Stimulates Divergent Thinking for Non-sketchers in HCI Conceptual Ideation. In Proceedings of Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, LBW0144. http://dx.doi.org/10.1145/3290607.3313023",
      "doi": "10.1145/3290607.3313023"
    },
    {
      "text": "Angela K-y Leung, Suntae Kim, Evan Polman, Lay See Ong, Lin Qiu, Jack A Goncalo and Jeffrey Sanchez-Burks. 2012. Embodied metaphors and creative 'acts\". Psychological science 23, 5 (2012), 502--509. http://dx.doi.org/10.1177/0956797611429801",
      "doi": ""
    },
    {
      "text": "Jeanne Liedtka. 2015. Perspective: Linking design thinking with innovation outcomes through cognitive bias reduction. Journal of Product Innovation Management 32, 6 (2015), 925--938. http://dx.doi.org/10.1111/jpim.12163",
      "doi": ""
    },
    {
      "text": "Youn-Kyung Lim, Erik Stolterman and Josh Tenenberg. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Transactions on Computer-Human Interaction (TOCHI) 15, 2 (2008), 7. http://dx.doi.org/10.1145/1375761.1375762",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Michael Michalko. 2006. Thinkertoys: A handbook of creative-thinking techniques. Ten Speed Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Michael J Muller. 2009. Participatory design: the third space in HCI. In Human-computer interaction, CRC press, 181--202.",
      "doi": ""
    },
    {
      "text": "Jonas Oppenlaender, Naghmi Shireen, Maximilian Mackeprang, Halil Erhan, Jorge Goncalves and Simo Hosio. 2019. Crowd-powered Interfaces for Creative Design Thinking. In Proceedings of the 2019 on Creativity and Cognition (2019). ACM, 722--729. http://dx.doi.org/10.1145/3325480.3326556",
      "doi": "10.1145/3325480.3326553"
    },
    {
      "text": "Jill Pable. 2008. In search of speed, accuracy and student confidence: Results from two perspective sketching exercice methods In Proceedings of South Regional IDEC Conference Conference (2008). Auburn, Alabama, 18--24.",
      "doi": ""
    },
    {
      "text": "Seymour A. Papert. 1993. Mindstorms: Children, computers, and powerful ideas. Basic Books, New York.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Gerard J Puccio, Donald J Treffinger and Reginald J Talbot. 1995. Exploratory examination of relationships between creativity styles and creative products. Creativity Research Journal 8, 2 (1995), 157--172. http://dx.doi.org/10.1207/s15326934crj0802_4",
      "doi": ""
    },
    {
      "text": "A Terry Purcell and John S Gero. 1998. Drawings and the design process: A review of protocol studies in design and other disciplines and related research in cognitive psychology. Design studies 19, 4), 389--430.",
      "doi": ""
    },
    {
      "text": "James Richards. 2013. Freehand Drawing and Discovery, Enhanced Edition: Urban Sketching and Concept Drawing for Designers. John Wiley & Sons, Hoboken, NJ.",
      "doi": ""
    },
    {
      "text": "Mark A Runco and Selcuk Acar. 2012. Divergent thinking as an indicator of creative potential. Creativity Research Journal 24, 1 (2012), 66--75. http://dx.doi.org/10.1080/10400419.2012.652929",
      "doi": ""
    },
    {
      "text": "Mark A Runco and Garrett J Jaeger. 2012. The standard definition of creativity. Creativity Research Journal 24, 1), 92--96.",
      "doi": ""
    },
    {
      "text": "Mark A Runco, Garnet Millar, Selcuk Acar and Bonnie Cramond. 2010. Torrance tests of creative thinking as predictors of personal and public achievement: A fiftyyear follow-up. Creativity Research Journal 22, 4 (2010), 361--368. http://dx.doi.org/10.1080/10400419.2010.523393",
      "doi": ""
    },
    {
      "text": "D. A. Schön. 1993. Generative metaphor: A perspective on problem-setting in social policy. In Metaphor and Thought, A. Ortony Ed. Cambridge University Press, Cambridge, 137--163. http://dx.doi.org/10.1017/CBO9781139173865.011",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1983. The reflective practitioner: How professionals think in action. Basic books,",
      "doi": ""
    },
    {
      "text": "Shung J. Shin, Tae-Yeol Kim, Jeong-Yeon Lee and Lin Bian. 2012. Cognitive Team Diversity and Individual Team Member Creativity: Cross-Level Interaction. Academy of Management Journal 55, 1 (2012), 197. http://dx.doi.org/10.5465/amj.2010.0270",
      "doi": ""
    },
    {
      "text": "Miguel Sicart. 2014. Play matters. MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/2678068"
    },
    {
      "text": "Paul J Silvia and Roger E Beaty. 2012. Making creative metaphors: The importance of fluid intelligence for creative thought. Intelligence 40, 4 (2012), 343--351. http://dx.doi.org/10.1016/j.intell.2012.02.005",
      "doi": ""
    },
    {
      "text": "Paul J Silvia, Beate P Winterstein, John T Willse, Christopher M Barona, Joshua T Cram, Karl I Hess, Jenna L Martinez and Crystal A Richard. 2008. Assessing creativity with divergent thinking tasks: Exploring the reliability and validity of new subjective scoring methods. Psychology of Aesthetics, Creativity, and the Arts 2, 2 (2008), 68. http://dx.doi.org/10.1037/1931--3896.2.2.68",
      "doi": ""
    },
    {
      "text": "Stephen Skalicky, Scott A Crossley, Danielle S McNamara and Kasia Muldner. 2017. Identifying creativity during problem solving using linguistic features. Creativity Research Journal 29, 4 (2017), 343--353. http://dx.doi.org/10.1080/10400419.2017.1376490",
      "doi": ""
    },
    {
      "text": "Michael Smyth, Ingi Helgason, Frank Kresin, Mara Balestrini, Andreas B Unteidig, Shaun Lawson, Mark Gaved, Nick Taylor, James Auger and Lone Koefoed Hansen. 2018. Maker movements, do-it-yourself cultures and participatory design: Implications for HCI research. In Proceedings of Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, W32. http://dx.doi.org/10.1145/3170427.3170604",
      "doi": "10.1145/3170427.3170604"
    },
    {
      "text": "Steven S Taylor and Matt Statler. 2014. Material matters: Increasing emotional engagement in learning. Journal of Management Education 38, 4 (2014), 586--607. http://dx.doi.org/10.1177/1052562913489976",
      "doi": ""
    },
    {
      "text": "Lisa Thurlow and Peter B Ford. 2018. Ideal Ideation: A Framework for the Management of Sketch Inhibition Among Undergraduate Designers. In Proceedings of International Design Conference - Design 2018 (2018). Dubrovnik, Croatia, 2517--2528. http://dx.doi.org/10.21278/idc.2018.0153",
      "doi": ""
    },
    {
      "text": "E Paul Torrance. 1980. Creativity and style of learning and thinking characteristics of adaptors and innovators. Creative Child & Adult Quarterly (1980).",
      "doi": ""
    },
    {
      "text": "E Paul Torrance. 1988. The nature of creativity as manifest in its testing. In The nature of creativity Comtemporary psychological perspective, Robert J. Sternberg Ed. Cambridge University Press, Cambridge, 4375.",
      "doi": ""
    },
    {
      "text": "Ellis Paul Torrance. 1966. Torrance tests of creative thinking: Norms-technical manual: Verbal tests, forms a and b: Figural tests, forms a and b. Personal Press, Incorporated,",
      "doi": ""
    },
    {
      "text": "Ellis Paul Torrance. 1976. Tests de pensée créative: manuel. Centre de psychologie appliquée, Paris, France.",
      "doi": ""
    },
    {
      "text": "Kaan Turnali. 2015. What Is Design Thinking? Retrieved September 16th 2019 from https://www.forbes.com/sites/sap/2015/05/10/what-isdesign-thinking/#1693fccf471f.",
      "doi": ""
    },
    {
      "text": "Willemien Visser. 2006. The cognitive artifacts of designing. CRC Press,",
      "doi": ""
    },
    {
      "text": "Vimal K Viswanathan and Julie S Linsey. 2012. Physical models and design thinking: A study of functionality, novelty and variety of ideas. Journal of Mechanical Design 134, 9). http://dx.doi.org/10.1115/1.4007148",
      "doi": ""
    },
    {
      "text": "Dhaval Vyas, Gerrit van der Veer and Anton Nijholt. 2013. Creative practices in the design studio culture: collaboration and communication. Cognition, Technology & Work 15, 4 (2013), 415--443. http://dx.doi.org/10.1007/s10111-012-0232--9",
      "doi": "10.1007/s10111-012-0232-9"
    },
    {
      "text": "Robert C Wilson, Joy P Guilford and Paul R Christensen. 1953. The measurement of individual differences in originality. Psychological Bulletin 50, 5 (1953), 362. http://dx.doi.org/10.1037/h0060857",
      "doi": ""
    },
    {
      "text": "Tom Wujec. 2010. The marshmallow challenge. Retrieved November 12), 2013.",
      "doi": ""
    },
    {
      "text": "Maria C Yang and Jorge G Cham. 2007. An analysis of sketching skill and its role in early stage engineering design. Journal of Mechanical Design 129, 5 (2007), 476--482. http://dx.doi.org/10.1115/1.2712214",
      "doi": ""
    },
    {
      "text": "Dvora Yanow and Haridimos Tsoukas. 2009. What is reflection-in-action? A phenomenological account. Journal of management studies 46, 8 (2009), 1339--1364. http://dx.doi.org/10.1111/j.1467--6486.2009.00859.x",
      "doi": ""
    },
    {
      "text": "Robert J Youmans. 2011. The effects of physical prototyping and group work on the reduction of design fixation. Design Studies 32, 2 (2011), 115--138. http://dx.doi.org/10.1016/j.destud.2010.08.001",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of Proceedings of the SIGCHI conference on Human factors in computing systems (CHI ?07). ACM, 493--502. http://dx.doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}