{
  "doi": "10.1145/3313831.3376526",
  "title": "Expanding Modes of Reflection in Design Futuring",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Design futuring approaches, such as speculative design, design fiction and others, seek to (re)envision futures and explore alternatives. As design futuring becomes established in HCI design research, there is an opportunity to expand and develop these approaches. To that end, by reflecting on our own research and examining related work, we contribute five modes of reflection. These modes concern formgiving, temporality, researcher positionality, real-world engagement, and knowledge production. We illustrate the value of each mode through careful analysis of selected design exemplars and provide questions to interrogate the practice of design futuring. Each reflective mode offers productive resources for design practitioners and researchers to articulate their work, generate new directions for their work, and analyze their own and others' work.",
  "authors": [
    {
      "name": "Sandjar Kozubaev",
      "institution": "Geogria Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-99659082270/rel-imgonly/99659082270.jpg",
      "acmid": "99659082270",
      "orcid": "missing"
    },
    {
      "name": "Chris Elsden",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-89758813157/rel-imgonly/headshotcrop.jpg",
      "acmid": "89758813157",
      "orcid": "missing"
    },
    {
      "name": "Noura Howell",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81554353756/rel-imgonly/img_8543_crop-square_web_smaller.jpg",
      "acmid": "81554353756",
      "orcid": "missing"
    },
    {
      "name": "Marie Louise Juul Søndergaard",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658708108",
      "orcid": "0000-0002-9884-0205"
    },
    {
      "name": "Nick Merrill",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659085848/rel-imgonly/headshot.jpg",
      "acmid": "99659085848",
      "orcid": "0000-0003-3669-1387"
    },
    {
      "name": "Britta Schulte",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659071628",
      "orcid": "missing"
    },
    {
      "name": "Richmond Y. Wong",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99658688813/rel-imgonly/glasses_profile_pic_square.jpg",
      "acmid": "99658688813",
      "orcid": "0000-0001-8613-0380"
    }
  ],
  "references": [
    {
      "text": "Vincanne Adams, Michelle Murphy and Adele E Clarke. 2009. Anticipation: Technoscience, Life, Affect, Temporality. Subjectivity 28, 1, 246--265. http://dx.doi.org/https://doi.org/10.1057/sub.2009.18",
      "doi": ""
    },
    {
      "text": "James Auger. 2013. Speculative Design: Crafting the Speculation. Digital Creativity 24, 1, 11--35. http://dx.doi.org/https://doi.org/10.1080/14626268.2013.767276",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bradzell. 2013. What Is Critical About Critical Design. In Proceedings of ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, 3297--3306. http://dx.doi.org/10.1145/2470654.2466451",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist Hci: Taking Stock and Outlining an Agenda for Design. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Atlanta, Georgia, USA, 1301--1310. http://dx.doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Karl Baumann, Benjamin Stokes, François Bar and Ben Caldwell. 2017. Infrastructures of the Imagination: Community Design for Speculative Urban Technologies. In Proceedings of Proceedings of the 8th International Conference on Communities and Technologies. ACM, Troyes, France, 266--269. http://dx.doi.org/10.1145/3083671.3083700",
      "doi": "10.1145/3083671.3083700"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday's Tomorrows: Notes on Ubiquitous Computing's Dominant Vision. Personal Ubiquitous Comput. 11, 2, 133--143. http://dx.doi.org/10.1007/s00779-006-0071-x",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Wendell Bell. 2003. Foundations of Futures Studies Human Science for a New Era. Volume 1. History, Purposes and Knowledge. . Transaction Publishers, New Brunswick, NJ.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Andy Crabtree, Martin Flintham, Adam Drozd, Rob Anastasi, Mark Paxton, Nick Tandavanitj, Matt Adams and Ju Row-Farr. 2006. Can You See Me Now? ACM Trans. Comput.-Hum. Interact. 13, 1, 100--133. http://dx.doi.org/10.1145/1143518.1143522",
      "doi": "10.1145/1143518.1143522"
    },
    {
      "text": "Steve Benford, Gabriella Giannachi, Boriana Koleva and Tom Rodden. 2009. From Interaction to Trajectories: Designing Coherent Journeys through User Experiences. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Boston, MA, USA, 709--718. http://dx.doi.org/10.1145/1518701.1518812",
      "doi": "10.1145/1518701.1518812"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Andy Crabtree, Martin Flintham, Brendan Walker, Joe Marshall, Boriana Koleva, Stefan Rennick Egglestone, Gabriella Giannachi, Matt Adams, Nick Tandavanitj and Ju Row Farr. 2013. Performance-Led Research in the Wild. ACM Trans. Comput.-Hum. Interact. 20, 3, 1--22. http://dx.doi.org/10.1145/2491500.2491502",
      "doi": "10.1145/2491500.2491502"
    },
    {
      "text": "Alan F. Blackwell. 2006. The Reification of Metaphor as a Design Tool. ACM Trans. Comput.-Hum. Interact. 13, 4, 490--530. http://dx.doi.org/10.1145/1188816.1188820",
      "doi": "10.1145/1188816.1188820"
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A Short Essay on Design, Science, Fact and Fiction Retrieved from http://www.nearfuturelaboratory.com.",
      "doi": ""
    },
    {
      "text": "Mark A. Blythe and Peter C. Wright. 2006. Pastiche Scenarios: Fiction as a Resource for User Centred Design. Interacting with Computers 18, 5, 1139--1164. http://dx.doi.org/10.1016/j.intcom.2006.02.001",
      "doi": "10.1016/j.intcom.2006.02.001"
    },
    {
      "text": "Mark Blythe and Enrique Encinas. 2016. The Co-Ordinates of Design Fiction: Extrapolation, Irony, Ambiguity and Magic. In Proceedings of Proceedings of the 19th International Conference on Supporting Group Work. ACM, Sanibel Island, Florida, USA, 345--354. http://dx.doi.org/10.1145/2957276.2957299",
      "doi": "10.1145/2957276.2957299"
    },
    {
      "text": "Mark Blythe, Enrique Encinas, Jofish Kaye, Miriam Lueck Avery, Rob McCabe and Kristina Andersen. 2018. Imaginary Design Workbooks: Constructive Criticism and Practical Provocation. In Proceedings of Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 1--12. http://dx.doi.org/10.1145/3173574.3173807",
      "doi": "10.1145/3173574.3173807"
    },
    {
      "text": "Augusto Boal. 2008. Theater of the Oppressed. Pluto Press,",
      "doi": ""
    },
    {
      "text": "Lera Boroditsky. 2011. How Languages Construct Time. In Space, Time and Number in the Brain, Stanislas Dehaene and Elizabeth Brannon Eds. Oxford University Press, 333--341.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Alexandra Weilenmann, Donald McMillan and Airi Lampinen. 2016. Five Provocations for Ethical HCI Research. In Proceedings of Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose, California, USA, 852--863. http://dx.doi.org/10.1145/2858036.2858313",
      "doi": "10.1145/2858036.2858313"
    },
    {
      "text": "Stuart Candy. 2010. The Futures of Everyday Life: Politics and Design of Experiential Scenarios. . thesis. University of Hawai'i Manoa,",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Jake Dunagan. 2017. Designing an Experiential Scenario: The People Who Vanished. Futures 86, 136--153. http://dx.doi.org/https://doi.org/10.1016/j.futures.2016.05.006",
      "doi": ""
    },
    {
      "text": "John M. Carroll. 2000. Making Use: Scenario-Based Design of Human-Computer Interactions. MIT Press, Cambridge, MA.",
      "doi": "10.5555/517699"
    },
    {
      "text": "Rachel Clarke and Pete Wright. 2012. Evocative of Experience: Crafting Cross-Cultural Digital Narratives through Stories and Portraits. In Proceedings of Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. ACM, Copenhagen, Denmark, 318--321. http://dx.doi.org/10.1145/2399016.2399066",
      "doi": "10.1145/2399016.2399066"
    },
    {
      "text": "Coulton P., Burnett, D., Gradinar, A. 2016. Games as Speculative Design: Allowing Players to Consider Alternate Presents and Plausible Futures. In Proceedings of Brighton UK.",
      "doi": ""
    },
    {
      "text": "Coulton P., Lindley, J., Ali, H. 2016. Design Fiction: Does the Search for Plausibility Lead to Deception? . In Proceedings of Proceedings of DRS 2016, Design Research Society 50th Anniversary Conference. Brighton, UK.",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Joseph Lindley, Miriam Sturdee and Mike Stead. 2017. Design Fiction as World Building. In Proceedings of Research Through Design Conference. Edinburgh, UK, 163--179. http://dx.doi.org/10.6084/m9.figshare.4746964",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins, Jeremy E. Viny, Cayla Key and Nouela Johnston. 2019. Alternative Avenues for Iot: Designing with Non-Stereotypical Homes. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--13. http://dx.doi.org/10.1145/3290605.3300581",
      "doi": "10.1145/3290605.3300581"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, Brisbane, QLD, Australia, 656--671. http://dx.doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Anthony Dunne. 2005. Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C Durrant, Andrew Garbett, Bettina Nissen, John Vines and David S Kirk. 2017. On Speculative Enactments. In Proceedings of Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5386--5399. http://dx.doi.org/10.1145/3025453.3025503",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting and David S. Kirk. 2017. Designing Documentary Informatics. Association for Computing Machinery, Edinburgh, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail Durrant, David Chatting, David Green and David Kirk. 2019. Abacus Datagraphy: A Speculative Enactment. In Proceedings of RTD Conference. http://dx.doi.org/10.6084/m9.figshare.4746961.v1",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk and John Vines. 2016. Metadating: Exploring the Romance and Future of Personal Data. Association for Computing Machinery, San Jose, California, USA.",
      "doi": ""
    },
    {
      "text": "Tom Feltwell, Shaun Lawson, Enrique Encinas, Conor Linehan, Ben Kirman, Deborah Maxwell, Tom Jenkins and Stacey Kuznetsov. 2018. \"Grand Visions\" for Post-Capitalist Human-Computer Interaction. In Proceedings of Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 1--8. http://dx.doi.org/10.1145/3170427.3170609",
      "doi": "10.1145/3170427.3170609"
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong and Franchesca Spektor. 2019. Vivewell: Speculating near-Future Menstrual Tracking through Current Data Practices. In Proceedings of Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego, CA, USA, 541--552. http://dx.doi.org/10.1145/3322276.3323695",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart and Nicola Dell. 2018. \"A Stalker's Paradise\": How Intimate Partner Abusers Exploit Technology. In Proceedings of Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 1--13. http://dx.doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Tony Fry. 2019. Design Futuring : Sustainability, Ethics and New Practice.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2007. Cultural Commentators: Non-Native Interpretations as Resources for Polyphonic Assessment. International Journal of Human-Computer Studies 65, 4, 292--305. http://dx.doi.org/https://doi.org/10.1016/j.ijhcs.2006.11.014",
      "doi": "10.1016/j.ijhcs.2006.11.014"
    },
    {
      "text": "William Gaver, Andy Boucher, Nadine Jarvis, David Cameron, Mark Hauenstein, Sarah Pennington, John Bowers, James Pike, Robin Beitra and Liliana Ovalle. 2016. The Datacatcher: Batch Deployment and Documentation of 130 Location-Aware, Mobile Devices That Put Sociopolitically-Relevant Big Data in People's Hands: Polyphonic Interpretation at Scale. In Proceedings of Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1597--1607. http://dx.doi.org/10.1145/2858036.2858472",
      "doi": "10.1145/2858036.2858472"
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Feminist Studies 14, 3, 575--599. http://dx.doi.org/10.2307/3178066",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. 2016. Staying with the Trouble : Making Kin in the Chthulucene. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl. 2010. Experience Design: Technology for All the Right Reasons. Morgan and Claypool Publishers,",
      "doi": "10.5555/1855019"
    },
    {
      "text": "Karey Helms and Ylva Fernaeus. 2018. Humor in Design Fiction to Suspend Disbelief and Belief. In Proceedings of Proceedings of the 10th Nordic Conference on Human-Computer Interaction. ACM, Oslo, Norway, 801--818. http://dx.doi.org/10.1145/3240167.3240271",
      "doi": "10.1145/3240167.3240271"
    },
    {
      "text": "bell hooks. 2015. Feminist Theory : From Margin to Center.",
      "doi": ""
    },
    {
      "text": "Noura Howell, John Chuang, Abigail De Kosnik, Greg Niemeyer and Kimiko Ryokai. 2018. Emotional Biosensing: Exploring Critical Alternatives. Proc. ACM Hum.-Comput. Interact. 2, CSCW, 1--25. http://dx.doi.org/10.1145/3274338",
      "doi": "10.1145/3274338"
    },
    {
      "text": "Sheila Jasanoff. 2015. Future Imperfect: Science, Technology, and the Imaginations of Modernity. In Dreamscapes of Modernity: Sociotechnical Imaginaries and the Fabrication of Power, University of Chicago Press, Chicago, 1--29.",
      "doi": ""
    },
    {
      "text": "Lindley Joseph, Dhruv Sharma and Robert Potts. 2014. Anticipatory Ethnography: Design Fiction as an Input to Design Ethnography. Ethnographic Praxis in Industry Conference Proceedings 2014, 1, 237--253. http://dx.doi.org/10.1111/1559--8918.01030",
      "doi": ""
    },
    {
      "text": "Os Keyes, Josephine Hoy and Margaret Drouhard. 2019. Human-Computer Insurrection: Notes on an Anarchist HCI. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--13. http://dx.doi.org/10.1145/3290605.3300569",
      "doi": "10.1145/3290605.3300569"
    },
    {
      "text": "David Kirby. 2010. The Future Is Now: Diegetic Prototypes and the Role of Popular Films in Generating Real-World Technological Development. Social Studies of Science 40, 1, 41--70. http://dx.doi.org/https://doi.org/10.1177/0306312709338325",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev. 2016. Stop Nigmas: Experimental Speculative Design through Pragmatic Aesthetics and Public Art. In Proceedings of NordiCHI '16. ACM, Gothenburg, Sweden, 1--10. http://dx.doi.org/10.1145/2971485.2993921",
      "doi": "10.1145/2971485.2993921"
    },
    {
      "text": "Sandjar Kozubaev. 2018. Futures as Design: Explorations, Images, and Participations. Interactions 25, 2, 46--51. http://dx.doi.org/10.1145/3178554",
      "doi": "10.1145/3178554"
    },
    {
      "text": "George Lakoff and Mark Johnson. 1981. Metaphors We Live By. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Daniel Lambton-Howard, Robert Anderson, Kyle Montague, Andrew Garbett, Shaun Hazeldine, Carlos Alvarez, John A. Sweeney, Patrick Olivier, Ahmed Kharrufa and Tom Nappey. 2019. Whatfutures: Designing Large-Scale Engagements on Whatsapp. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--14. http://dx.doi.org/10.1145/3290605.3300389",
      "doi": "10.1145/3290605.3300389"
    },
    {
      "text": "Shaun Lawson, Ben Kirman, Conor Linehan, Tom Feltwell and Lisa Hopkins. 2015. Problematising Upstream Technology through Speculative Design: The Case of Quantified Cats and Dogs. In Proceedings of Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul, Republic of Korea, 2663--2672. http://dx.doi.org/10.1145/2702123.2702260",
      "doi": "10.1145/2702123.2702260"
    },
    {
      "text": "Ann Light, Alison Powell and Irina Shklovski. 2017. Design for Existential Crisis in the Anthropocene Age. In Proceedings of Proceedings of the 8th International Conference on Communities and Technologies. ACM, Troyes, France, 270--279. http://dx.doi.org/10.1145/3083671.3083688",
      "doi": "10.1145/3083671.3083688"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Back to the Future: 10 Years of Design Fiction. In Proceedings of Proceedings of the 2015 British HCI Conference. ACM, Lincoln, Lincolnshire, United Kingdom, 210--211. http://dx.doi.org/10.1145/2783446.2783592",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "Joseph Lindley, Paul Coulton and Miriam Sturdee. 2017. Implications for Adoption. In Proceedings of Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 265--277. http://dx.doi.org/10.1145/3025453.3025742",
      "doi": "10.1145/3025453.3025742"
    },
    {
      "text": "Dan Lockton and Stuart Candy. 2018. A Vocabulary for Visions in Designing for Transitions. In Proceedings of DRS 2018. Limerick. http://dx.doi.org/10.21606/dma.2018.558",
      "doi": ""
    },
    {
      "text": "Dan Lockton, Devika Singh, Saloni Sabnis, Michelle Chou, Sarah Foley and Alejandro Pantoja. 2019. New Metaphors: A Workshop Method for Generating Ideas and Reframing Problems in Design and Beyond. In Proceedings of Proceedings of the 2019 on Creativity and Cognition. ACM, San Diego, CA, USA, 319--332. http://dx.doi.org/10.1145/3325480.3326570",
      "doi": "10.1145/3325480.3326570"
    },
    {
      "text": "Nick Logler, Daisy Yoo and Batya Friedman. 2018. Metaphor Cards: A How-to-Guide for Making and Using a Generative Metaphorical Design Toolkit. In Proceedings of Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong, China, 1373--1386. http://dx.doi.org/10.1145/3196709.3196811",
      "doi": "10.1145/3196709.3196811"
    },
    {
      "text": "Trieuvy Luu, Martijn van den Broeck and Marie Louise Juul Søndergaard. 2018. Data Economy: Interweaving Storytelling and World Building in Design Fiction. In Proceedings of Proceedings of the 10th Nordic Conference on Human-Computer Interaction. ACM, Oslo, Norway, 771--786. http://dx.doi.org/10.1145/3240167.3240270",
      "doi": ""
    },
    {
      "text": "Sus Lyckvi, Yiying Wu, Maria Huusko and Virpi Roto. 2018. Eagons, Exoskeletons and Ecologies: On Expressing and Embodying Fictions as Workshop Tasks. In Proceedings of Proceedings of the 10th Nordic Conference on Human-Computer Interaction. ACM, Oslo, Norway, 754--770. http://dx.doi.org/10.1145/3240167.3240269",
      "doi": "10.1145/3240167.3240269"
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures: Staying with the Trouble of Digital Personal Assistants through Design Fiction. In Proceedings of Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong, China, 869--880. http://dx.doi.org/10.1145/3196709.3196766",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Ramia Maze. 2016. Design and the Future: Temporal Politics of \"Making a Difference.'. In Design Anthropological Futures, Rachel Charlotte Smith et al. Eds. Bloomsbury Academic.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as Experience. MIT Press, Cambridge, MA.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Mike Michael. 2000. Futures of the Present: From Performativity to Prehension. In Contested Futures: A Sociology of Prospective Techno-Science, Routledge, New York, 21--39.",
      "doi": ""
    },
    {
      "text": "Renee Noortman, Britta F. Schulte, Paul Marshall, Saskia Bakker and Anna L. Cox. 2019. Hawkeye - Deploying a Design Fiction Probe. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--14. http://dx.doi.org/10.1145/3290605.3300652",
      "doi": ""
    },
    {
      "text": "Nicholas Nova. 2019. Nicolas Nova: We Are Interested in Mundane Situations to Express Futures. Retrieved September 10, 2019 from http://speculativeedu.eu/interview-nicolas-nova/.",
      "doi": ""
    },
    {
      "text": "Rafael E. Núñez and Eve Sweetser. 2006. With the Future Behind Them: Convergent Evidence from Aymara Language and Gesture in the Crosslinguistic Comparison of Spatial Construals of Time. Cognitive science 2006, 30, 401--450. http://dx.doi.org/10.1207/s15516709cog0000_62",
      "doi": ""
    },
    {
      "text": "Jasper Tran O'Leary, Sara Zewde, Jennifer Mankoff and Daniela K. Rosner. 2019. Who Gets to Future?: Race, Representation, and Design Methods in Africatown. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--13. http://dx.doi.org/10.1145/3290605.3300791",
      "doi": ""
    },
    {
      "text": "William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: An Investigation of Experiences with Futureme. In Proceedings of Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul, Republic of Korea, 575--584. http://dx.doi.org/10.1145/2702123.2702221",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "William Odom, Siân Lindley, Larissa Pschetz, Vasiliki Tsaknaki, Anna Vallgårda, Mikael Wiberg and Daisy Yoo. 2018. Time, Temporality, and Slowness: Future Directions for Design Research. In Proceedings of Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems. ACM, Hong Kong, China, 383--386. http://dx.doi.org/10.1145/3197391.3197392",
      "doi": "10.1145/3197391.3197392"
    },
    {
      "text": "William Odom, Ron Wakkary, Jeroen Hol, Bram Naus, Pepijn Verburg, Tal Amram and Amy Yo Sue Chen. 2019. Investigating Slowness as a Frame to Design Longer-Term Experiences with Personal Data: A Field Study of Olly. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--16. http://dx.doi.org/10.1145/3290605.3300264",
      "doi": "10.1145/3290605.3300264"
    },
    {
      "text": "William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K Dey and Min Kyung Lee. 2012. A Fieldwork of the Future with User Enactments. In Proceedings of Proceedings of the Designing Interactive Systems Conference. ACM, 338--347. http://dx.doi.org/10.1145/2317956.2318008",
      "doi": "10.1145/2317956.2318008"
    },
    {
      "text": "James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul, Republic of Korea, 2083--2092. http://dx.doi.org/10.1145/2702123.2702438",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "Luiza Prado and Pedro Oliveira. 2014. Questioning the \"Critical\" in Speculative and Critical Design. Retrieved September 10, 2019 from https://medium.com/a-parede/questioning-the-critical-in-speculative-critical-design-5a355cac2ca4#.jb56pv4y7.",
      "doi": ""
    },
    {
      "text": "L. Pschetz, Bastian, M., Speed, C. 2016. Temporal Design: Looking at Time as Social Coordination. In Proceedings of Proceedings of DRS 2016, Design Research Society 50th Anniversary Conference. Brighton, UK.",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2012. Envisioning Ubiquitous Computing. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin, Texas, USA, 1573--1582. http://dx.doi.org/10.1145/2207676.2208278",
      "doi": "10.1145/2207676.2208278"
    },
    {
      "text": "Daniela K. Rosner, Saba Kawas, Wenqi Li, Nicole Tilly and Yi-Chen Sung. 2016. Out of Time, out of Place: Reflections on Design Workshops as a Research Method. In Proceedings of Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco, California, USA, 1131--1141. http://dx.doi.org/10.1145/2818048.2820021",
      "doi": "10.1145/2818048.2820021"
    },
    {
      "text": "Felix Salmon. 2018. The Creepy Rise of Real Companies Spawning Fictional Design. Retrieved September 2, 2019 from https://www.wired.com/story/the-creepy-rise-of-real-companies-spawning-fictional-design/.",
      "doi": ""
    },
    {
      "text": "Ziauddin Sardar. 2010. The Namesake: Futures; Futures Studies; Futurology; Futuristic; Foresight-What's in a Name? Futures 42, 3, 177--184. http://dx.doi.org/https://doi.org/10.1016/j.futures.2009.11.001",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 5412--5427. http://dx.doi.org/10.1145/3025453.3025766",
      "doi": ""
    },
    {
      "text": "Britta F. Schulte, Paul Marshall and Anna L. Cox. 2016. Homes for Life: A Design Fiction Probe. In Proceedings of Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM, Gothenburg, Sweden, 1--10. http://dx.doi.org/10.1145/2971485.2993925",
      "doi": ""
    },
    {
      "text": "Cynthia Selin. 2008. The Sociology of the Future: Tracing Stories of Technology and Time. Sociology Compass 2, 6, 1878--1895. http://dx.doi.org/10.1111/j.1751--9020.2008.00147.x",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers. 2011. What I Learned on Change Islands: Reflections on It and Pace of Life. interactions 18, 2, 40--48. http://dx.doi.org/10.1145/1925820.1925830",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David and Joseph 'Jofish' Kaye. 2005. Reflective Design. In Proceedings of Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility. ACM, Aarhus, Denmark, 49--58. http://dx.doi.org/10.1145/1094562.1094569",
      "doi": ""
    },
    {
      "text": "Rachel Charlotte Smith, Kasper Tang Vangkilde, Mette Gislev Kjærsgaard, Ton Otto, Joachim Halse and Thomas Binder. 2016. Design Anthropological Futures. Bloomsbury Publishing,",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2016. Periodshare: A Bloody Design Fiction. In Proceedings of Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM, Gothenburg, Sweden, 1--6. http://dx.doi.org/10.1145/2971485.2996748",
      "doi": "10.1145/2971485.2996748"
    },
    {
      "text": "Alessandro Soro, Jennyfer Lawrence Taylor and Margot Brereton. 2019. Designing the Past. In Proceedings of Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--10. http://dx.doi.org/10.1145/3290607.3310424",
      "doi": "10.1145/3290607.3310424"
    },
    {
      "text": "Anne Spaa, Abigail Durrant, Chris Elsden and John Vines. 2019. Understanding the Boundaries between Policymaking and HCI. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1--15. http://dx.doi.org/10.1145/3290605.3300314",
      "doi": "10.1145/3290605.3300314"
    },
    {
      "text": "Erik Stolterman. 2008. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design 2, 1.",
      "doi": ""
    },
    {
      "text": "Darko Suvin. 2014. Estrangement and Cognition. Strange Horizons, 24 November, 2014.",
      "doi": ""
    },
    {
      "text": "Joshua Tanenbaum. 2014. Design Fictional Interactions: Why HCI Should Care About Stories. interactions 21, 5, 22--23. http://dx.doi.org/10.1145/2648414",
      "doi": ""
    },
    {
      "text": "Bruce M. Tharp and Stephanie M. Tharp. 2018. Discursive Design : Critical, Speculative, and Alternative Things.",
      "doi": ""
    },
    {
      "text": "Cameron Tonkinwise. 2014. How We Intend to Future: Review of Anthony Dunne and Fiona Raby, Speculative Everything: Design, Fiction, and Social Dreaming. Design Philosophy Papers 12, 2, 169--187. http://dx.doi.org/10.2752/144871314X14159818597676",
      "doi": ""
    },
    {
      "text": "John Vines, Tess Denman-Cleaver, Paul Dunphy, Peter Wright and Patrick Olivier. 2014. Experience Design Theatre: Exploring the Role of Live Theatre in Scaffolding Design Dialogues. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto, Ontario, Canada, 683--692. http://dx.doi.org/10.1145/2556288.2556960",
      "doi": "10.1145/2556288.2556960"
    },
    {
      "text": "Joseph Voros. 2017. Big History and Anticipation. In Handbook of Anticipation: Theoretical and Applied Aspects of the Use of Future in Decision Making, Roberto Poli Ed. Springer International Publishing, Cham, 1--40. http://dx.doi.org/10.1007/978--3--319--31737--3_95--1",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz and Henry Lin. 2015. Material Speculation: Actual Artifacts for Critical Inquiry. In Proceedings of Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives. Aarhus University Press, Aarhus, Denmark, 97--108. http://dx.doi.org/10.7146/aahcc.v1i1.21299",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "M. Weiser. 2002. The Computer for the 21st Century. IEEE Pervasive Computing 1, 1, 19--25. http://dx.doi.org/10.1109/mprv.2002.993141",
      "doi": "10.1109/MPRV.2002.993141"
    },
    {
      "text": "Richmond Y. Wong, Nick Merrill and John Chuang. 2018. When BCIs Have APIs: Design Fictions of Everyday Brain-Computer Interface Adoption. In Proceedings of Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong, China, 1359--1371. http://dx.doi.org/10.1145/3196709.3196746",
      "doi": "10.1145/3196709.3196746"
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2016. When a Product Is Still Fictional: Anticipating and Speculating Futures through Concept Videos. In Proceedings of Proceedings of the 2016 ACM Conference on Designing Interactive Systems. Association for Computing Machinery, Brisbane, QLD, Australia, 121--133. http://dx.doi.org/10.1145/2901790.2901801",
      "doi": ""
    }
  ]
}