{
  "doi": "10.1145/3313831.3376731",
  "title": "To Write Code: The Cultural Fabrication of Programming Notation and Practice",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Writing and its means have become detached. Unlike written and drawn practices developed prior to the 20th century, notation for programming computers developed in concert and conflict with discretizing infrastructure such as the shift-key typewriter and data processing pipelines. In this paper, I recall the emergence of high-level notation for representing computation. I show how the earliest inventors of programming notations borrowed from various written cultural practices, some of which came into conflict with the constraints of digitizing machines, most prominently the typewriter. As such, I trace how practices of \"writing code\" were fabricated along social, cultural, and material lines at the time of their emergence. By juxtaposing early visions with the modern status quo, I question long-standing terminology, dichotomies, and epistemological tendencies in the field of computer programming. Finally, I argue that translation work is a fundamental property of the practice of writing code by advancing an intercultural lens on programming practice rooted in history.",
  "authors": [
    {
      "name": "Ian Arawjo",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658651953",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cycling '74. 2019. Max/Msp/Jitter. (2019). https://cycling74.com",
      "doi": ""
    },
    {
      "text": "Amal Ahmed. 2015. Verified Compilers for a Multi-Language World. In 1st Summit on Advances in Programming Languages (SNAPL 2015) (Leibniz International Proceedings in Informatics (LIPIcs)), Vol. 32. Schloss Dagstuhl--Leibniz-Zentrum fuer Informatik, Dagstuhl, Germany, 15--31. DOI: http://dx.doi.org/10.4230/LIPIcs.SNAPL.2015.15",
      "doi": ""
    },
    {
      "text": "Atsushi Akera. 2008. Calculating a natural world: scientists, engineers, and computers during the rise of US Cold War research. MIT Press.",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib, Michael S. Bernstein, and Margaret Levi. 2017. Examining Crowd Work and Gig Work Through The Historical Lens of Piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17). ACM, NY, NY, USA, 4599--4616. DOI: http://dx.doi.org/10.1145/3025453.3025974",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Ben Allen. 2017. Critical Approaches to the Materiality of Source Code: Between Text and Machine. Ph.D. Dissertation. Stanford University.",
      "doi": ""
    },
    {
      "text": "Marie Amalric and Stanislas Dehaene. 2016. Origins of the brain networks for advanced mathematics in expert mathematicians. Proceedings of the National Academy of Sciences 113, 18 (2016), 4909--4917.",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames. 2018. Hackers, Computers, and Cooperation: A Critical History of Logo and Constructionist Learning. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article Article 18 (Nov. 2018), 19 pages. DOI: http://dx.doi.org/10.1145/3274287",
      "doi": "10.1145/3274287"
    },
    {
      "text": "Morgan G. Ames, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Lilly Nguyen, Syed Ishtiaque Ahmed, Nusrat Jahan, Steven J. Jackson, and Paul Dourish. 2018. Making or making do? Challenging the mythologies of making and hacking. Journal of Peer Production 12 (2018).",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab, Justin D. Weisz, and Maryam Ashoori. 2019. Thinking Too Classically: Research Topics in Human-Quantum Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article Paper 256, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300486",
      "doi": "10.1145/3290605.3300486"
    },
    {
      "text": "William Aspray. 1990. Computing before computers. Iowa State University Press.",
      "doi": ""
    },
    {
      "text": "John W. Backus. 1951--2. Problem #29 Flow Chart for IBM SSEC. (1951--2). John W. Backus Papers, Library of Congress Manuscripts Division, box OV1, item 71.",
      "doi": ""
    },
    {
      "text": "John W. Backus. 1978a. Can programming be liberated from the von Neumann style?: a functional style and its algebra of programs. Commun. ACM 21, 8 (1978), 613--641.",
      "doi": "10.1145/359576.359579"
    },
    {
      "text": "John W. Backus. 1978b. The history of Fortran I, II, and III. ACM Sigplan Notices 13, 8 (1978), 165--180.",
      "doi": "10.1145/960118.808380"
    },
    {
      "text": "John W. Backus, R.J. Beeber, S. Best, R. Goldberg, H.L. Herrick, R.A. Hughes, L.B. Mitchell, R.A. Nelson, R. Nutt, D. Sayre, and others. 1956. The FORTRAN Automatic Coding System for the IBM 704 EDPM: Programmer's Reference Manual. Applied Science Division and Programming Research Department, International Business Machines Corporation 590 (1956).",
      "doi": ""
    },
    {
      "text": "John W. Backus, Robert J. Beeber, Sheldon Best, Richard Goldberg, L. Mitchell Haibt, Harlan L. Herrick, Robert A. Nelson, David Sayre, Peter B. Sheridan, H. Stern, and others. 1957. The FORTRAN automatic coding system. In Papers presented at the February 26--28, 1957, Western Joint Computer Conference: Techniques for reliability. ACM, 188--198.",
      "doi": ""
    },
    {
      "text": "John W. Backus and Harlan Herrick. 1954. IBM 701 Speedcoding and other automatic-programming systems. In Symposium on Automatic Programming for Digital Computers, Washington, DC, Vol. 13. 106--113.",
      "doi": ""
    },
    {
      "text": "John W. Backus, Harlan Herrick, and Irving Ziller. 1954. Preliminary Report, Specifications for the IBM Mathematical FORmula TRANslating System, FORTRAN. Applied Science Division, IBM (1954).",
      "doi": ""
    },
    {
      "text": "Thierry Bardini. 2000. Bootstrapping: Douglas Engelbart, coevolution, and the origins of personal computing. Stanford University Press.",
      "doi": "10.5555/359530"
    },
    {
      "text": "William Barnes, Myles Gartland, and Martin Stack. 2004. Old habits die hard: path dependency and behavioral lock-in. Journal of Economic Issues 38, 2 (2004), 371--377.",
      "doi": ""
    },
    {
      "text": "Jean Jennings Bartik. 2013. Pioneer programmer: Jean Jennings Bartik and the computer that changed the world. Truman State University Press.",
      "doi": ""
    },
    {
      "text": "F. L. Bauer and H. Wössner. 1972. The \"Plankalkül\" of Konrad Zuse: A Forerunner of Today's Programming Languages. Commun. ACM 15, 7 (July 1972), 678--685. DOI: http://dx.doi.org/10.1145/361454.361515",
      "doi": ""
    },
    {
      "text": "Harold H. Beverage. 1937. Signaling. (Oct. 5 1937). US Patent 2,095,050 (Filed Apr. 26, 1933).",
      "doi": ""
    },
    {
      "text": "Nicola J. Bidwell. 2016. Moving the centre to design social media in rural Africa. AI & Society 31, 1 (2016), 51--77.",
      "doi": "10.1007/s00146-014-0564-5"
    },
    {
      "text": "Wiebe E. Bijker, Thomas Parke Hughes, and Trevor J. Pinch. 1989. The social construction of technological systems: New directions in the sociology and history of technology. MIT Press.",
      "doi": ""
    },
    {
      "text": "College Board. 2019. AP Computer Science A. (2019). https://apcentral.collegeboard.org/courses/ap-computer-science-a/course",
      "doi": ""
    },
    {
      "text": "Corrado Böhm. 1951. On encoding logical-mathematical formulas using the machine itself during program conception. Translated 2016 by Peter Sestoft from Corrado Böhm: Calculatrices digitales. Du déchiffrage de formules logico-mathématiques par la machine même dans la conception du programme. ETH Zürich (1951). PhD dissertation. French original published in Bologna 1954.",
      "doi": ""
    },
    {
      "text": "Grady Booch. 2006. Oral History of John Backus. (2006). Computer History Museum.",
      "doi": ""
    },
    {
      "text": "Marat Boshernitsan and Michael Sean Downes. 2004. Visual programming languages: A survey. Citeseer.",
      "doi": ""
    },
    {
      "text": "Frederick P. Brooks. 1975. The Mythical Man-Month: Essays on Software Engineering, Anniversary Edition. Addison-Wesley (1975).",
      "doi": ""
    },
    {
      "text": "Arthur Walter Burks. 1947. Electronic computing circuits of the ENIAC. Proceedings of the IRE 35, 8 (1947), 756--767.",
      "doi": ""
    },
    {
      "text": "Florian Cajori. 1929. A History of Mathematical Notations (Vol. I and II). Chicago: Open Court Pub. Co.",
      "doi": ""
    },
    {
      "text": "Daniel Chandler. 1992. The phenomenology of writing by hand. Digital Creativity (Intelligent Tutoring Media) 3, 2--3 (1992), 65--74.",
      "doi": ""
    },
    {
      "text": "Bob Coecke and Aleks Kissinger. 2017. Picturing quantum processes. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "I. Bernard Cohen, Robert V. Campbell, Gregory W. Welch, and Robert V.D. Campbell. 1999. Makin'numbers: Howard Aiken and the computer. MIT Press.",
      "doi": ""
    },
    {
      "text": "Michael Cole, Distributive Literacy Consortium, and others. 2006. The fifth dimension: An after-school program built on diversity. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "James W. Cortada. 2000. Before the computer: IBM, NCR, Burroughs, and Remington Rand and the industry they created, 1865--1956. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Adam Curtis. 2016. HyperNormalisation. BBC Documentary (2016). Film.",
      "doi": ""
    },
    {
      "text": "Subrata Dasgupta. 2014. It Began with Babbage: The Genesis of Computer Science. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Paul A. David. 1985. Clio and the Economics of QWERTY. The American economic review 75, 2 (1985), 332--337.",
      "doi": ""
    },
    {
      "text": "Lisa Delpit. 2006. Other people's children: Cultural conflict in the classroom. The New Press.",
      "doi": ""
    },
    {
      "text": "Jacques Derrida. 1976. Of Grammatology, trans. Gayatri Chakravorty Spivak. (1976).",
      "doi": ""
    },
    {
      "text": "Lexico (Oxford Dictionary). 2019. Definition of Programmer in English. (2019). Retrieved September 17, 2019 from https://www.lexico.com/en/definition/programmer",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2015. Not the internet, but this internet: how othernets illuminate our feudal internet. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives. Aarhus University Press, 157--168.",
      "doi": "10.7146/aahcc.v1i1.21200"
    },
    {
      "text": "Paul Dourish. 2017. The stuff of bits: An essay on the materialities of information. MIT Press.",
      "doi": "10.5555/3159007"
    },
    {
      "text": "Paul Dourish and Scott D. Mainwaring. 2012. Ubicomp's Colonial Impulse. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 133--142. DOI: http://dx.doi.org/10.1145/2370216.2370238",
      "doi": ""
    },
    {
      "text": "Thomas O. Ellis, John F. Heafner, and William L. Sibley. 1969. The GRAIL Project: An experiment in man-machine communications. Technical Report. RAND Corp. Retrieved Aug. 8, 2019 from https://www.rand.org/pubs/research_memoranda/RM5999.html",
      "doi": ""
    },
    {
      "text": "Nathan Ensmenger. 2016. The multiple meanings of a flowchart. Information & Culture 51, 3 (2016), 321--351.",
      "doi": ""
    },
    {
      "text": "Matthias Felleisen. 1991. On the expressive power of programming languages. Science of computer programming 17, 1--3 (1991), 35--75.",
      "doi": ""
    },
    {
      "text": "Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, Shriram Krishnamurthi, Eli Barzilay, Jay McCarthy, and Sam Tobin-Hochstadt. 2015. The Racket Manifesto. In 1st Summit on Advances in Programming Languages (SNAPL 2015) (Leibniz International Proceedings in Informatics (LIPIcs)), Vol. 32. Schloss Dagstuhl--Leibniz-Zentrum fuer Informatik, Dagstuhl, Germany, 113--128. DOI: http://dx.doi.org/10.4230/LIPIcs.SNAPL.2015.113",
      "doi": ""
    },
    {
      "text": "Dale Fisk. 2005. Programming with punched cards. Columbia University, Computing History Archives. Retrieved August 10 2019 from http://www.columbia.edu/cu/computinghistory/fisk.pdf",
      "doi": ""
    },
    {
      "text": "Jay Forrester and others. 1953a. Reports of MIT Project WHIRLWIND (Biweekly Report for Nov. 16, 1953). Technical Report. MIT Digital Computer Laboratory.",
      "doi": ""
    },
    {
      "text": "Jay Forrester and others. 1953b. Reports of MIT Project WHIRLWIND (Summary Report No. 33). Technical Report. MIT Digital Computer Laboratory.",
      "doi": ""
    },
    {
      "text": "Gottlob Frege. 1879. Begriffsschrift: eine der arithmetischen nachgebildete Formelsprache des reinen Denkens. Halle.",
      "doi": ""
    },
    {
      "text": "W. K. Giloi. 1997. Konrad Zuse's Plankalkül: the First High-level, \"non-von Neumann\" Programming Language. IEEE Annals of the History of Computing 19, 2 (April 1997), 17--24. DOI: http://dx.doi.org/10.1109/85.586068",
      "doi": "10.1109/85.586068"
    },
    {
      "text": "Adele Goldstine and John von Neumann. Dec. 4, 1947. Monte Carlo Flow Diagram. (Dec. 4, 1947). John von Neumann Papers, Library of Congress Manuscripts Division box 12, folder 6.",
      "doi": ""
    },
    {
      "text": "Herman H. Goldstine. 1993. The computer from Pascal to von Neumann. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Herman H. Goldstine and John Von Neumann. 1947. Planning and coding of problems for an electronic computing instrument. Technical Report. Moore School of Electrical Engineering, University of Pennsylvania.",
      "doi": ""
    },
    {
      "text": "Philip J. Guo. 2018. Non-Native English Speakers Learning Computer Programming: Barriers, Desires, and Design Opportunities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article Paper 396, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173970",
      "doi": "10.1145/3173574.3173970"
    },
    {
      "text": "Mark Guzdial. 2019. We Should Stop Saying \"Language Independent.' We Don't Know How To Do That. Communications of the ACM Blog (13 Aug 2019).",
      "doi": ""
    },
    {
      "text": "Thomas Haigh. 2014. Actually, Turing did not invent the computer. Commun. ACM 57, 1 (2014), 36--41.",
      "doi": "10.1145/2542504"
    },
    {
      "text": "Thomas Haigh and Mark Priestley. 2015. Where code comes from: Architectures of automatic control from Babbage to algol. Commun. ACM 59, 1 (2015), 39--44.",
      "doi": "10.1145/2846088"
    },
    {
      "text": "Thomas Haigh, Peter Mark Priestley, Mark Priestley, and Crispin Rope. 2016. ENIAC in action: Making and remaking the modern computer. MIT Press.",
      "doi": ""
    },
    {
      "text": "Mitchell R. Hammer and Milton Bennett. 2012. The intercultural development inventory. Student learning abroad (2012), 115--136.",
      "doi": ""
    },
    {
      "text": "Rebecca L. Hao and Elena L. Glassman. 2019. Approaching polyglot programming: what can we learn from bilingualism studies? (2019).",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist studies 14, 3 (1988), 575--599.",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with Computers 23, 5 (2011), 385--392.",
      "doi": "10.1016/j.intcom.2011.03.005"
    },
    {
      "text": "David Hilbert and Wilhelm Ackerman. 1928. Grundzüge der Theoretischen Logik (2 ed.). Springer-Verlag.",
      "doi": ""
    },
    {
      "text": "Andrew Hodges. 2012. Alan Turing: The Enigma. Random House.",
      "doi": ""
    },
    {
      "text": "Frances E. Holberton. 1983. Personal interview. 14 Apr. 1983, OH 50. Oral history interview by James Baker Ross, Potomac, Maryland. Charles Babbage Institute. University of Minnesota, Minneapolis (1983).",
      "doi": ""
    },
    {
      "text": "Ellen Huet. 2014. Camp Grounded: Where People Pay $570 To Have Their Smartphones Taken Away From Them. Forbes (Jun 2014).",
      "doi": ""
    },
    {
      "text": "Edwin L. Hutchins, James D. Hollan, and Donald A. Norman. 1985. Direct manipulation interfaces. Human-computer interaction 1, 4 (1985), 311--338.",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2013. Making: Anthropology, archaeology, art and architecture. Routledge.",
      "doi": ""
    },
    {
      "text": "Tim Ingold. 2016. Lines: a brief history. Routledge.",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and Paul Dourish. 2009. Postcolonial Interculturality. In Proceedings of the 2009 International Workshop on Intercultural Collaboration (IWIC '09). ACM, NY, NY, USA, 249--252. DOI: http://dx.doi.org/10.1145/1499224.1499268",
      "doi": ""
    },
    {
      "text": "Kenneth Iverson. 1987. Notation as a Tool of Thought, ACM Turing Award Lecture, 1979. ACM Turing Award Lectures, The first twenty years. (1987).",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson and Sarah Barbrow. 2015. Standards and/As Innovation: Protocols, Creativity, and Interactive Systems Development in Ecology. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1769--1778. DOI: http://dx.doi.org/10.1145/2702123.2702564",
      "doi": ""
    },
    {
      "text": "Sheila Jasanoff and others. 2004. States of knowledge: the co-production of science and the social order. Routledge.",
      "doi": ""
    },
    {
      "text": "John L. Jones. 1954. A survey of automatic coding techniques for digital computers. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Victor Kaptelinin and Bonnie A. Nardi. 2006. Acting with technology: Activity theory and interaction design. MIT Press.",
      "doi": "10.5555/1196435"
    },
    {
      "text": "Alan Kay. 1987. Doing with Images Makes Symbols: Communicating with Computers. (1987). University Video Communications. Film.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Lynn Dombrowski, Ellie Harmon, Matthias Korn, Ann Light, Michael Stewart, and Amy Voida. 2018. Designing against the status quo. interactions 25, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Friedrich A. Kittler. 1999. Gramophone, film, typewriter. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Donald E. Knuth and Luis Trabb Pardo. 1980. The early development of programming languages. In A history of computing in the twentieth century. Elsevier, 197--273.",
      "doi": ""
    },
    {
      "text": "Philip Kraft. 2012. Programmers and managers: The routinization of computer programming in the United States. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "David Landy and Robert L. Goldstone. 2007. Formal notations are diagrams: Evidence from a production task. Memory & cognition 35, 8 (2007), 2033--2040.",
      "doi": ""
    },
    {
      "text": "J. Halcombe Laning and Neal Zierler. 1954. A program for translation of mathematical equations for Whirlwind I. Instrumentation Laboratory, Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2005. Reassembling the Social: an Introduction to Actor-Network-Theory. Oxford University Press (2005).",
      "doi": ""
    },
    {
      "text": "Jennifer S. Light. 1999. When computers were women. Technology and culture 40, 3 (1999), 455--483.",
      "doi": ""
    },
    {
      "text": "Seongtaek Lim, Rama Adithya Varanasi, and Tapan Parikh. 2018. GLIDE (Git-Learning IDE; Integrated Development Environment): In-class Collaboration in Web Engineering Curriculum for Youths (Abstract Only). In Proceedings of the 49th ACM Technical Symposium on Computer Science Education (SIGCSE '18). ACM, NY, NY, USA, 1112--1112. DOI: http://dx.doi.org/10.1145/3159450.3162203",
      "doi": "10.1145/3159450.3162203"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the Utopian Vision of Making: HCI After Technosolutionism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1390--1402. DOI: http://dx.doi.org/10.1145/2858036.2858506",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design and Intervention in the Age of \"No Alternative\". Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article Article 109 (Nov. 2018), 21 pages. DOI: http://dx.doi.org/10.1145/3274378",
      "doi": "10.1145/3274378"
    },
    {
      "text": "Peter Lyman. 1984. Reading, writing and word processing: Toward a phenomenology of the computer age. Qualitative Sociology 7, 1--2 (1984), 75--89.",
      "doi": ""
    },
    {
      "text": "Jacob Matthews and Robert Bruce Findler. 2009. Operational Semantics for Multi-Language Programs. ACM Trans. Program. Lang. Syst. 31, 3, Article Article 12 (April 2009), 44 pages. DOI: http://dx.doi.org/10.1145/1498926.1498930",
      "doi": "10.1145/1498926.1498930"
    },
    {
      "text": "Edward F. Melcer and Katherine Isbister. 2018. Bots & (Main)Frames: Exploring the Impact of Tangible Blocks and Collaborative Play in an Educational Programming Game. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article Paper 266, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173840",
      "doi": ""
    },
    {
      "text": "Richard L. Mendelsohn. 2005. The Philosophy of Gottlob Frege. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Stephen J. Morris and OCZ Gotel. 2006. Flow diagrams: rise and fall of the first software engineering notation. In International Conference on Theory and Application of Diagrams. Springer, 130--144.",
      "doi": ""
    },
    {
      "text": "Thomas S. Mullaney. 2017. The Chinese typewriter: A history. MIT Press.",
      "doi": ""
    },
    {
      "text": "Kyle Muzyka. 2018. A Hawaiian team's mission to translate programming language to their Native language. (2018). Retrieved August 13, 2019 from https://bit.ly/2lXWnzr",
      "doi": ""
    },
    {
      "text": "Ramsey Nasser. 2012. Qalb. (2012). Retrieved September 17 2019 from http://nas.sr/%D9%82%D9%84%D8%A8/",
      "doi": ""
    },
    {
      "text": "Hans Neukom. 2005. ERMETH: The first Swiss computer. IEEE Annals of the History of Computing 27, 4 (2005), 5--22.",
      "doi": "10.5555/1106274.1106279"
    },
    {
      "text": "David Nofre, Mark Priestley, and Gerard Alberts. 2014. When technology became language: The origins of the linguistic conception of computer programming, 1950--1960. Technology and Culture 55, 1 (2014), 40--75.",
      "doi": ""
    },
    {
      "text": "Walter J. Ong. 2013. Orality and literacy. Routledge.",
      "doi": ""
    },
    {
      "text": "Wanda J. Orlikowski. 1991. Integrated information environment or matrix of control? The contradictory implications of information technology. Accounting, Management and Information Technologies 1, 1 (1991), 9--42.",
      "doi": ""
    },
    {
      "text": "V.D. Parondzhanov. 1995. Visual syntax of the DRAKON language. Programming and Computer Software 21, 3 (1995).",
      "doi": ""
    },
    {
      "text": "Samir Passi and Steven Jackson. 2017. Data Vision: Learning to See Through Algorithmic Abstraction. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 2436--2447. DOI: http://dx.doi.org/10.1145/2998181.2998331",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Samir Passi and Steven J. Jackson. 2018. Trust in Data Science: Collaboration, Translation, and Accountability in Corporate Data Science Projects. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article Article 136 (Nov. 2018), 28 pages. DOI: http://dx.doi.org/10.1145/3274405",
      "doi": ""
    },
    {
      "text": "Norman Peitek, Janet Siegmund, Sven Apel, Christian Kästner, Chris Parnin, Anja Bethmann, Thomas Leich, Gunter Saake, and André Brechmann. 2018. A look into programmers' heads. IEEE Transactions on Software Engineering (2018).",
      "doi": ""
    },
    {
      "text": "Kavita Philip, Lilly Irani, and Paul Dourish. 2012. Postcolonial computing: A tactical survey. Science, Technology, & Human Values 37, 1 (2012), 3--29.",
      "doi": ""
    },
    {
      "text": "Andrew Pickering. 1995. The Mangle of Practice: Time, Agency, and Science. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Mark Priestley. 2018a. The mathematical origins of modern computing. In Technology and Mathematics. Springer, 107--135.",
      "doi": ""
    },
    {
      "text": "Mark Priestley. 2018b. Routines of Substitution: John von Neumann's Work on Software Development, 1945--1948. Springer.",
      "doi": ""
    },
    {
      "text": "Remington Rand. 1952. Remington-Rand Presents the UNIVAC. (1952). Computer History Museum. Film.",
      "doi": ""
    },
    {
      "text": "Raúl Rojas, Cüneyt Göktekin, Gerald Friedland, Mike Krüger, Olaf Langmack, and Denis Kuniß. 2000. Plankalkül: The first high-level programming language and its implementation. Freie Universität Berlin (2000).",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner. 2018. Critical Fabulations: Reworking the Methods and Margins of Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Samantha Shorey, Brock R. Craft, and Helen Remick. 2018. Making Core Memory: Design Inquiry into Gendered Legacies of Engineering and Craftwork. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article Paper 531, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174105",
      "doi": "10.1145/3173574.3174105"
    },
    {
      "text": "Heinz Rutishauser. 1952. Automatische Rechenplanfertigung bei programmgesteuerten Rechenmaschinen. Zeitschrift für angewandte Mathematik und Physik ZAMP 3, 4 (1952), 312--313.",
      "doi": "10.1007/BF02009622"
    },
    {
      "text": "Larry Saphire. Dec. 15, 1967. Interview with John W. Backus. (Dec. 15, 1967). John W. Backus Papers, Library of Congress Manuscripts Division, box 1, item 7.",
      "doi": ""
    },
    {
      "text": "Toby Schachman. March 1, 2018. \"We've been playing with editing printed code by just pointing a keyboard at a page and typing.\" Tweet. (March 1, 2018). Retrieved November 23 2018 from https://twitter.com/mandy3284/status/969286629281087488's=20",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information systems research 7, 1 (1996), 111--134.",
      "doi": ""
    },
    {
      "text": "Valerie Strauss. 2018. Students protest Zuckerberg-backed digital learning program and ask him: \"What gives you this right?'. The Washington Post (Nov 2018).",
      "doi": ""
    },
    {
      "text": "Sharon Hartman Strom. 1989. \"Light manufacturing\": The feminization of American office work, 1900--1930. ILR Review 43, 1 (1989), 53--71.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2002. Located accountabilities in technology production. Scandinavian journal of information systems 14, 2 (2002), 7.",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Joshua Sunshine, Elena Glassman, and Sarah Chasins. 2019. PLATEAU Workshop. (2019). https://plateau-workshop.org/",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor. 2011. Out there. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 685--694.",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "Matti Tedre. 2014. The science of computing: shaping a discipline. Chapman and Hall/CRC.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek heresy: Rescuing social change from the cult of technology. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Jasper Tran O'Leary and Nadya Peek. 2019. Machine-o-Matic: A Programming Environment for Prototyping Digital Fabrication Workflows. In The Adjunct Publication of the 32nd Annual ACM Symposium on User Interface Software and Technology. 134--136.",
      "doi": ""
    },
    {
      "text": "Alan M. Turing. 1937. On computable numbers, with an application to the Entscheidungsproblem. Proceedings of the London mathematical society 2, 1 (1937), 230--265.",
      "doi": ""
    },
    {
      "text": "Alan M. Turing. 1950. Computing Machinery and Intelligence. Mind 59, 236 (1950), 433--460.",
      "doi": "10.5555/601134"
    },
    {
      "text": "Annette Vee. 2017. Coding literacy: How computer programming is changing writing. MIT Press.",
      "doi": "10.5555/3152562"
    },
    {
      "text": "Helen Verran. 2001. Science and an African logic. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Bret Victor, Paula Te, Josh Horowitz, Luke Iannini, Toby Schachman, and Virginia McArthur. 2017. DynamicLand. (2017). Retrieved November 23 2018 from https://dynamicland.org",
      "doi": ""
    },
    {
      "text": "John Von Neumann. 1987. Papers of John von Neumann on computing and computer theory. Vol. 12. MIT Press.",
      "doi": ""
    },
    {
      "text": "John Von Neumann. 1993. First Draft of a Report on the EDVAC. IEEE Annals of the History of Computing 15, 4 (1993), 27--75.",
      "doi": "10.1109/85.238389"
    },
    {
      "text": "Ngug Wa Thiong'o. 1993. Moving the centre: The struggle for cultural freedoms. James Currey.",
      "doi": ""
    },
    {
      "text": "Langdon Winner. 1980. Do artifacts have politics? Daedalus (1980), 121--136.",
      "doi": ""
    },
    {
      "text": "Terry Winograd, Fernando Flores, and Fernando F. Flores. 1986. Understanding computers and cognition: A new foundation for design. Intellect Books.",
      "doi": "10.5555/576359"
    },
    {
      "text": "Alexei Yurchak. 2013. Everything was forever, until it was no more: The last Soviet generation. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Konrad Zuse. 1945a. Der Plankalkül. (1945). Transcribed report. Courtesy of Konrad Zuse Internet Archive (http://zuse.zib.de).",
      "doi": ""
    },
    {
      "text": "Konrad Zuse. 1945b. Urschrift des Plankalküls. (1945). Original notebook (scanned). Courtesy of Konrad Zuse Internet Archive (http://zuse.zib.de).",
      "doi": ""
    },
    {
      "text": "Konrad Zuse. 1993. The computer-my life. Springer Science & Business Media.",
      "doi": ""
    }
  ]
}