{
  "doi": "10.1145/3313831.3376608",
  "title": "Scenario Co-Creation Cards: A Culturally Sensitive Tool for Eliciting Values",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Values are an integral part of human identity and have a pervasive impact upon human behavior. This makes understanding them a central concern in the design of technology, as exemplified by approaches such as Value Sensitive Design (\"VSD\"). Identifying and concreting the values held by a given population can be a difficult endeavor, especially where there is a cultural barrier limiting an effective discussion of them, for example in societies where freedom of expression is discouraged. Addressing this concern requires an in-depth consideration of appropriate value elicitation methods, which responds to the fact that it is not possible to understand values detached from their cultural context. We introduce a novel implicit method, Scenario Co-Creation Cards, and show how it can be used to incorporate existing models of culture in the value elicitation process. We demonstrate this in a case study of Saudi women's visibility in the digital media.",
  "tags": [
    "vsd",
    "method",
    "saudi arabia",
    "user research",
    "scenarios",
    "value elicitation",
    "values",
    "cards"
  ],
  "authors": [
    {
      "name": "Taghreed Alshehri",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527367",
      "orcid": "0000-0002-6075-8652"
    },
    {
      "name": "Reuben Kirkham",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458712957",
      "orcid": "0000-0002-1902-549X"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Norah Abokhodair, Adam Hodges, and Sarah Vieweg. 2017. Photo Sharing in the Arab Gulf: Expressing the Collective and Autonomous Selves. In Proceedings of CSCW 2017, 696--711. https://doi.org/10.1145/2998181.2998338",
      "doi": "10.1145/2998181.2998338"
    },
    {
      "text": "Norah Abokhodair and Sarah Vieweg. 2016. Privacy & Social Media in the Context of the Arab Gulf. In DIS '16 Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 672--683. https://doi.org/10.1145/2901790.2901873",
      "doi": ""
    },
    {
      "text": "Linda Alcoff. 1991. The problem of speaking for others. Cultural critique, 20: 5--32.",
      "doi": ""
    },
    {
      "text": "Adel Al-Dawood, Norah Abokhodair, Houda El mimouni, and Svetlana Yarosh. 2017. ?Against Marrying a Stranger\": Marital Matchmaking Technologies in Saudi Arabia. In Proceedings of the 2017 Conference on Designing Interactive Systems DIS '17, 1013--1024. https://doi.org/10.1145/3064663.3064683",
      "doi": "10.1145/3064663.3064683"
    },
    {
      "text": "Madawi Al-Rasheed. 2013. A Most Masculine State: Gender, Politics, and Religion in Saudi Arabia. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Tamara Alsheikh, Jennifer A Rode, and Siân E Lindley. 2011. (Whose) value-sensitive design: a study of longdistance relationships in an Arabic cultural context. In Proceedings of the ACM 2011 conference on Computer supported cooperative work, 75--84.",
      "doi": "10.1145/1958824.1958836"
    },
    {
      "text": "Tag Alsheri, Norah Abokhodair, and Patrick Olivier. 2019. Understanding Culture with a Transnational Population: a Value-Sensitive Approach. SocArXiv. https://doi.org/10.31235/osf.io/kpz2r",
      "doi": ""
    },
    {
      "text": "Clive Boddy. 2005. Projective techniques in market research: valueless subjectivity or insightful reality. International Journal of Market Research 47, 3: 239-- 254.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction changing roles - NordiCHI '06, 1--8. https://doi.org/10.1145/1182475.1182476",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the SIGCHI conference on human factors in computing systems, 1125--1134.",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Eva Brandt and Jörn Messeter. 2004. Facilitating collaboration through design games. In Proceedings of the 8th Conference on Participatory Design: Artful Integration: Interweaving Media, Materials and Practices vol. 1, 121--131. https://doi.org/10.1145/1011870.1011885",
      "doi": "10.1145/1011870.1011885"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4: 589--597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2011. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann, Amsterdam.",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Paul Chippendale. 2001. On Values, Ethics, Morals & Principles. A Values Inventory (AVI): 6.",
      "doi": ""
    },
    {
      "text": "Nathan Crilly, Alan F. Blackwell, and P. John Clarkson. 2006. Graphic elicitation: using research diagrams as interview stimuli. Qualitative Research 6, 3: 341--366. https://doi.org/10.1177/1468794106065007",
      "doi": ""
    },
    {
      "text": "Alexei Czeskis, Ivayla Dermendjieva, Hussein Yapit, Alan Borning, Batya Friedman, Brian Gill, and Tadayoshi Kohno. 2010. Parenting from the pocket: value tensions and technical directions for secure and private parent-teen mobile safety. In Proceedings of the Sixth Symposium on Usable Privacy and Security SOUPS '10, 1. https://doi.org/10.1145/1837110.1837130",
      "doi": "10.1145/1837110.1837130"
    },
    {
      "text": "Tamara Denning, Alan Borning, Batya Friedman, Brian T Gill, Tadayoshi Kohno, and William H Maisel. 2010. Patients, pacemakers, and implantable defibrillators: Human values and security for wireless implantable medical devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 917--926.",
      "doi": "10.1145/1753326.1753462"
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2007. Fictional Inquiry-design collaboration in a shared narrative space. CoDesign 3, 4: 213--234. https://doi.org/10.1080/15710880701500187",
      "doi": ""
    },
    {
      "text": "Susan Doherty and Roy Nelson. 2010. Using projective techniques to tap into consumers' feelings, perceptions and attitudes... getting an honest opinion. International journal of consumer studies 34, 4: 400--404.",
      "doi": ""
    },
    {
      "text": "Iris Epstein, Bonnie Stevens, Patricia McKeever, and Sylvain Baruchel. 2006. Photo Elicitation Interview (PEI): Using Photos to Elicit Children's Perspectives. International Journal of Qualitative Methods 5, 3: 1-- 11. https://doi.org/10.1177/160940690600500301",
      "doi": ""
    },
    {
      "text": "Tal Eyal, Michael D. Sagristano, Yaacov Trope, Nira Liberman, and Shelly Chaiken. 2009. When values matter: Expressing values in behavioral intentions for the near vs. distant future. Journal of Experimental Social Psychology 45, 1: 35--43. https://doi.org/10.1016/j.jesp.2008.07.023",
      "doi": ""
    },
    {
      "text": "Kenneth R. Fleischmann. 2013. Information and Human Values. Synthesis Lectures on Information Concepts, Retrieval, and Services 5, 5: 1--99. https://doi.org/10.2200/S00545ED1V01Y201310ICR0",
      "doi": ""
    },
    {
      "text": "Uwe Flick, Ernst von Kardorff, and Ines Steinke (eds.). 2004. A companion to qualitative research. Sage Publications, London; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Batya Friedman. 1996. Value-sensitive design. Interactions 3, 6: 16--23. https://doi.org/10.1145/242485.242493",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Batya Friedman and David Hendry. 2012. The envisioning cards: a toolkit for catalyzing humanistic and technical imaginations. In Proceedings of the SIGCHI conference on human factors in computing systems, 1145--1148.",
      "doi": "10.1145/2207676.2208562"
    },
    {
      "text": "Batya Friedman, David Hendry, and Alan Borning. A Survey of Value Sensitive Design. Methods. Foundations and Trends in Human-Computer Interaction 11, 23: 63--25.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and David G. Hendry. 2019. Value Sensitive Design: Shaping technology with moral imagination. MIT Press.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Kristina Hook, Brian Gill, Lina Eidmar, Catherine Sallmander Prien, and Rachel Severson. 2008. Personlig integritet: A comparative study of perceptions of privacy in public places in Sweden and the United States. In Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges, 142--151.",
      "doi": "10.1145/1463160.1463176"
    },
    {
      "text": "Batya Friedman, David Hurley, Daniel C Howe, Edward Felten, and Helen Nissenbaum. 2002. Users' Conceptions of Web Security: A Comparative Study. In Ext. Abs. CHI (2002), 2.",
      "doi": "10.1145/506443.506577"
    },
    {
      "text": "Lawrence H. Ganong and Marilyn Coleman. 2006. Multiple Segment Factorial Vignette Designs. Journal of Marriage and Family 68, 2: 455--468. https://doi.org/10.1111/j.1741--3737.2006.00264.x",
      "doi": ""
    },
    {
      "text": "F. Gregory Gause. 2011. Saudi Arabia in the New Middle East. Council on Foreign Relation.",
      "doi": ""
    },
    {
      "text": "Kim Halskov and Peter Dalsgård. 2006. Inspiration card workshops. In DIS '06, ACM (2006), 2. https://doi.org/10.1145/1142405.1142409",
      "doi": "10.1145/1142405.1142409"
    },
    {
      "text": "Michael Hechter. 1994. The Role of Values in Rational Choice Theory. Rationality and Society 6, 3: 318--333. https://doi.org/10.1177/1043463194006003003",
      "doi": ""
    },
    {
      "text": "Michael D. Hills. 2002. Kluckhohn and Strodtbeck's Values Orientation Theory. Online Readings in Psychology and Culture 4, 4. https://doi.org/10.9707/2307-0919.1040",
      "doi": ""
    },
    {
      "text": "Steven Hitlin and Jane Allyn Piliavin. 2004. Values: Reviving a Dormant Concept. Annual Review of Sociology 30, 1: 359--393. https://doi.org/10.1146/annurev.soc.30.012703.110640",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 1981. Culture and organizations.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. What about Saudi Arabia? Retrieved August 26, 2019 from https://geert-hofstede.com/saudiarabia.html",
      "doi": ""
    },
    {
      "text": "Emily S Holman, Catherine K Harbour, Rosa Valéria Azevedo Said, and Maria Elena Figueroa. 2016. Regarding realities: Using photo-based projective techniques to elicit normative and alternative discourses on gender, relationships, and sexuality in Mozambique. Global public health 11, 5--6: 719--741.",
      "doi": ""
    },
    {
      "text": "Eva Hornecker. 2010. Creative idea exploration within the structure of a guiding framework: the card brainstorming game. TEI 2010: 8.",
      "doi": ""
    },
    {
      "text": "Jeroen van den Hoven, Pieter E. Vermaas, and Ibo Van de Poel (eds.). 2015. Handbook of Ethics, Values, and Technological Design Sources, Theory, Values and Application Domains. Springer Science+Business Media Dordrecht 2015, Delft, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Alina Huldtgren. 2014. Design for Values in ICT. In Handbook of Ethics, Values, and Technological Design, Jeroen van den Hoven, Pieter E. Vermaas and Ibo van de Poel (eds.). Springer Netherlands, Dordrecht, 1--24. https://doi.org/10.1007/978--94-007--6994--6_35--1",
      "doi": ""
    },
    {
      "text": "Janine A. Clark. 2006. Field Research Methods in the Middle East. PS: Political Science and Politics 39, 3: 417--423.",
      "doi": ""
    },
    {
      "text": "Dev Jootun, Gerry McGhee, and Glenn Marland. 2009. Reflexivity: Promoting rigor in qualitative research. Nursing Standard 23, 23: 42--46.",
      "doi": ""
    },
    {
      "text": "Orit Karnieli-Miller, Geffen Nissim, and Miriam Goldberg. 2017. \"It's in the Cards\" The Contribution of Illustrated Metaphor Cards to Exploring Values Within Narratives. Qualitative health research 27, 1: 138--151.",
      "doi": ""
    },
    {
      "text": "Ralph H. Kilmann. 1981. Toward a Unique/Useful Concept of Values for Interpersonal Behavior: A Critical Review of the Literature on Value. Psychological Reports 48, 3: 939--959. https://doi.org/10.2466/pr0.1981.48.3.939",
      "doi": ""
    },
    {
      "text": "Krzysztof Kubacki and Dariusz Siemieniako. 2011. Innovation in social marketing research methods: What can collages add to a multimethod research project exploring alcohol consumption among young people? Journal of Nonprofit & Public Sector Marketing 23, 4: 387--407.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec, Erika Shehan Poole, and Susan P Wyche. 2009. Values as lived experience: evolving value sensitive design in support of value discovery. In Proceedings of the SIGCHI conference on human factors in computing systems, 1141--1150.",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Tuck Wah Leong and Ole Sejer Iversen. 2015. Valuesled Participatory Design as a Pursuit of Meaningful Alternatives. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, 314--323. https://doi.org/10.1145/2838739.2838784",
      "doi": "10.1145/2838739.2838784"
    },
    {
      "text": "M. Lockwood. 1999. Humans Valuing Nature: Synthesising Insights from Philosophy, Psychology and Economics. Environmental Values 8, 3: 381--401. https://doi.org/10.3197/096327199129341888",
      "doi": ""
    },
    {
      "text": "Jessica K. Miller, Batya Friedman, and Gavin Jancke. 2007. Value tensions in design: the value sensitive design, development, and appropriation of a corporation's groupware system. In GROUP, 281. https://doi.org/10.1145/1316624.1316668",
      "doi": ""
    },
    {
      "text": "Milton Rokeach. 1973. The nature of human values. Free Press, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Steve Mulder. 2006. Chapter 3: Approaches to Creating Personas. In The User is Always Right: A Practical Guide to Creating and Using Personas for the Web. 10.",
      "doi": ""
    },
    {
      "text": "Michael Muller. 2014. Whose Values? Whose Design? In Proc. CSCW 2014Workshop on Co-creating and Identity-Making in CSCW.",
      "doi": ""
    },
    {
      "text": "Carlyle Murphy. 2012. A Kingdom's Future: Saudi Arabia through the eyes of its twentysomethimgs. Wilson International Center for Scholars, Washington, D.C. Retrieved from www.wilsoncenter.org/middleeast",
      "doi": ""
    },
    {
      "text": "Lisa P. Nathan, Predrag V. Klasnja, and Batya Friedman. 2007. Value scenarios: a technique for envisioning systemic effects of new technologies. In Ext. Abstracts CHI 2007, 2585. https://doi.org/10.1145/1240866.1241046",
      "doi": ""
    },
    {
      "text": "Daphna Oyserman. 2011. Culture as situated cognition: Cultural mindsets, cultural fluency, and meaning making. European review of social psychology 22, 1: 164--214.",
      "doi": ""
    },
    {
      "text": "Roberto Pereira and Maria Cecília Calani Baranauskas. 2015. A value-oriented and culturally informed approach to the design of interactive systems. International Journal of Human-Computer Studies 80: 66--82. https://doi.org/10.1016/j.ijhcs.2015.04.001",
      "doi": "10.1016/j.ijhcs.2015.04.001"
    },
    {
      "text": "Christopher Pich and Dianne Dean. 2015. Qualitative projective techniques in political brand image research from the perspective of young adults. Qualitative Market Research: An International Journal 18, 1: 115-- 144.",
      "doi": ""
    },
    {
      "text": "Caroline Porr, Maria Mayan, Guendalina Graffigna, Sarah Wall, and Edgar Ramos Vieira. 2011. The evocative power of projective techniques for the elicitation of meaning. International Journal of Qualitative Methods 10, 1: 30--41.",
      "doi": ""
    },
    {
      "text": "Steve Portigal. 2013. Interviewing users: how to uncover compelling insights. Rosenfeld Media, Brooklyn, New York.",
      "doi": ""
    },
    {
      "text": "Mary Beth Rosson and John M. Carroll. 2002. ScenarioBased Design. In Human-Computer Interaction: Development Process. Lawrence Erlbaum Associates, Virginia Tech, Blacksburg VA.",
      "doi": ""
    },
    {
      "text": "E. B.-N. Sanders. 2000. Generative Tools for Codesigning. In Collaborative Design, Stephen A. R. Scrivener, Linden J. Ball and Andrée Woodcock (eds.). Springer London, London, 3--12. https://doi.org/10.1007/978--1--4471-0779--8_1",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Bo Westerlund. 2011. Experiencing, Exploring and Experimenting in and with Co-Design Spaces. Nordic Design Research Conference.",
      "doi": ""
    },
    {
      "text": "Shalom H. Schwartz. 2012. An Overview of the Schwartz Theory of Basic Values. Online Readings in Psychology and Culture 2, 1. https://doi.org/10.9707/2307-0919.1116",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2006. Interviewing as qualitative research: a guide for researchers in education and the social sciences. Teachers College Press, New York.",
      "doi": ""
    },
    {
      "text": "Jeffrey W Sherman and Leigh A Frost. 2000. On the encoding of stereotype-relevant information under cognitive load. Personality and Social Psychology Bulletin 26, 1: 26--34.",
      "doi": ""
    },
    {
      "text": "Katie Shilton, Jes A. Koepfler, and Kenneth R. Fleischmann. 2014. How to see values in social computing: methods for studying values dimensions. 426--435. https://doi.org/10.1145/2531602.2531625",
      "doi": ""
    },
    {
      "text": "Jaime Snyder, Katie Shilton, and Sara Anderson. 2016. Observing the Materiality of Values in Information Systems Research. In System Sciences (HICSS), 2016 49th Hawaii International Conference on, 2017--2026.",
      "doi": "10.1109/HICSS.2016.254"
    },
    {
      "text": "Megan Stodel. 2015. But What Will People Think?: Getting beyond Social Desirability Bias by Increasing Cognitive Load. International Journal of Market Research 57, 2: 313--322. https://doi.org/10.2501/IJMR-2015-024",
      "doi": ""
    },
    {
      "text": "Barbara Sutton. 2011. Playful cards, serious talk: a qualitative research technique to elicit women's embodied experiences. Qualitative research 11, 2: 177-- 196.",
      "doi": ""
    },
    {
      "text": "Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. User sketches: a quick, inexpensive, and effective way to elicit more reflective user feedback. In Proceedings of the 4th Nordic conference on Human-computer interaction changing roles - NordiCHI '06, 105--114. https://doi.org/10.1145/1182475.1182487",
      "doi": "10.1145/1182475.1182487"
    },
    {
      "text": "Martin Tomitsch, Cara Wrigley, Naseem Ahmadpour, Jessica Frawley, A. Baki Kocaballi, Claudia NunezPacheco, Karla Straker, and Lian Loke. 2018. Design. Think. Make. Break. Repeat. A Handbook of Methods. BIS Publishers, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Jin-Yi Wang, Robert Ramberg, and Hannu Kuoppala. 2012. User Participatory Sketching: A Complementary Approach. In 10th Asia Pacific Conference on Computer Human Interaction (APCHI '12), 10.",
      "doi": ""
    },
    {
      "text": "H. N. Weaver. 1998. Indigenous People in a Multicultural Society: Unique Issues for Human Services. Social Work 43, 3: 203--211. https://doi.org/10.1093/sw/43.3.203",
      "doi": ""
    },
    {
      "text": "H. N. Weaver. 1999. Indigenous People and the Social Work Profession: Defining Culturally Competent Services. Social Work 44, 3: 217--225. https://doi.org/10.1093/sw/44.3.217",
      "doi": ""
    },
    {
      "text": "Jill Palzkill Woelfer and David G. Hendry. 2009. Stabilizing homeless young people with information and place. Journal of the American Society for Information Science and Technology 60, 11: 2300-- 2312. https://doi.org/10.1002/asi.21146",
      "doi": "10.5555/1656289.1656295"
    },
    {
      "text": "Jill Palzkill Woelfer, Amy Iverson, David G Hendry, Batya Friedman, and Brian T Gill. 2011. Improving the safety of homeless young people with mobile phones: values, form and function. In Proc CHI 2011, 10.",
      "doi": "10.1145/1978942.1979191"
    },
    {
      "text": "Christiane Wölfel and Timothy Merritt. 2013. Method Card Design Dimensions: A Survey of Card-Based Design Tools. In Human-Computer Interaction -- INTERACT 2013, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson and Marco Winckler (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 479-- 486. https://doi.org/10.1007/978--3--642--40483--2_34",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong, Deirdre K. Mulligan, Ellen Van Wyk, James Pierce, and John Chuang. 2017. Eliciting Values Reflections by Engaging Privacy Futures Using Design Workbooks. Proceedings of the ACM on Human-Computer Interaction 1, CSCW: 1--26. https://doi.org/10.1145/3134746",
      "doi": "10.1145/3134746"
    },
    {
      "text": "Daisy Yoo, Alina Huldtgren, and Jp Woelfer. 2013. A Value Sensitive Action-Reflection Model: Evolving a Co-Design Space with Stakeholder and Designer Prompts. Chi 2013: 419--428. https://doi.org/10.1145/2470654.2470715",
      "doi": ""
    },
    {
      "text": "2018. 10 Years of Arab Youth Survey: \"A Decade of Hopes & Fears.\" ASDA'A Burson-Marsteller.",
      "doi": ""
    }
  ]
}