{
  "doi": "10.1145/3313831.3376240",
  "title": "User Experiences with Online Status Indicators",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Online status indicators (OSIs) improve online communication by helping users convey and assess availability, but they also let users infer potentially sensitive information about one another. We surveyed 200 smartphone users to understand the extent to which users are aware of information shared via OSIs and the extent to which this shapes their behavior. Despite familiarity with OSIs, participants misunderstand many aspects of OSIs, and they describe carefully curating and seeking to control their self-presentation via OSIs. Some users further report leveraging OSI-conveyed information for problematic and malicious purposes. Drawing on existing constructs of app dependence (i.e., when users contort their behavior to meet an app's demands) and app enablement (i.e., when apps enable users to engage in behaviors they feel good about), we demonstrate that current OSI design patterns promote app dependence, and we call for a shift toward OSI designs that are more enabling for users.",
  "tags": [
    "mobile apps",
    "social computing",
    "privacy",
    "online status"
  ],
  "authors": [
    {
      "name": "Camille Cobb",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502730639",
      "orcid": "missing"
    },
    {
      "name": "Lucy Simko",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81485657839",
      "orcid": "missing"
    },
    {
      "name": "Tadayoshi Kohno",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100058677",
      "orcid": "0000-0002-4899-226X"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    }
  ],
  "references": [
    {
      "text": "Daniel Avrahami and Scott E. Hudson. 2006. Responsiveness in Instant Messaging: Predictive Models Supporting Inter-personal Communication. In CHI.",
      "doi": ""
    },
    {
      "text": "James \"Bo\" Begole, Nicholas E. Matsakis, and John C. Tang. 2004. Lilsys: Sensing Unavailability. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04).",
      "doi": ""
    },
    {
      "text": "James \"Bo\" Begole, John C. Tang, Randall B. Smith, and Nicole Yankelovich. 2002. Work Rhythms: Analyzing Visualizations of Awareness Histories of Distributed Groups. In CSCW.",
      "doi": "10.1145/587078.587125"
    },
    {
      "text": "Michael Benisch, Patrick Gage Kelley, Norman Sadeh, and Lorrie Faith Cranor. 2011. Capturing Location-privacy Preferences: Quantifying Accuracy and User-burden Tradeoffs. Personal Ubiquitous Comput. (2011).",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the Invisible Audience in Social Networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13).",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Igor Bilogrevic, Kévin Huguenin, Berker Agir, Murtuza Jadliwala, and Jean-Pierre Hubaux. 2013. Adaptive Information-sharing for Privacy-aware Mobile Social Networks. In UbiComp.",
      "doi": ""
    },
    {
      "text": "Sara A. Bly, Steve R. Harrison, and Susan Irwin. 1993. Media Spaces: Bringing People Together in a Video, Audio, and Computing Environment. Commun. ACM 36, 1 (Jan. 1993).",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling Asleep with Angry Birds, Facebook and Kindle: A Large Scale Study on Mobile Application Usage. In MobileHCI.",
      "doi": ""
    },
    {
      "text": "Andreas Buchenscheit, Bastian Könings, Andreas Neubert, Florian Schaub, Matthias Schneider, and Frank Kargl. 2014. Privacy Implications of Presence Sharing in Mobile Messaging Applications. In MUM.",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18).",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Camille Cobb. 2019. User-to-User Privacy in Social and Communications Applications. Ph.D. Dissertation. University of Washington.",
      "doi": ""
    },
    {
      "text": "Camille Cobb and Tadayoshi Kohno. 2017. How Public Is My Private Life?: Privacy in Online Dating. In WWW.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Ian E. Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. 2005. Location Disclosure to Social Relations: Why, when, & What People Want to Share. In CHI.",
      "doi": ""
    },
    {
      "text": "Edward S. De Guzman, Margaret Yau, Anthony Gagliano, Austin Park, and Anind K. Dey. 2004. Exploring the Design and Use of Peripheral Displays of Awareness Information. In CHI EA.",
      "doi": ""
    },
    {
      "text": "Trinh Minh Tri Do, Jan Blom, and Daniel Gatica-Perez. 2011. Smartphone Usage in the Wild: A Large-scale Analysis of Applications and Context. In ICMI.",
      "doi": ""
    },
    {
      "text": "Howard Gardner and Katie Davis. 2013. The app generation: How today's youth navigate identity, intimacy, and imagination in a digital world. Yale University Press.",
      "doi": "10.5555/2588192"
    },
    {
      "text": "Erving Goffman. 1949. The presentation of self in everyday life. Amer. J. Sociology (1949).",
      "doi": ""
    },
    {
      "text": "Saul Greenberg. 1996. Peepholes: Low Cost Awareness of One's Community. In Conference Companion on Human Factors in Computing Systems (CHI '96).",
      "doi": "10.1145/257089.257283"
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H. Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a Low Profile?: Technology, Risk and Privacy Among Undocumented Immigrants. In CHI.",
      "doi": ""
    },
    {
      "text": "Shion Guha and Jeremy Birnholtz. 2013. Can You See Me Now?: Location, Visibility and the Management of Impressions on Foursquare. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13).",
      "doi": "10.1145/2493190.2493209"
    },
    {
      "text": "Jeff Hancock, Jeremy Birnholtz, Natalya Bazarova, Jamie Guillory, Josh Perlin, and Barrett Amos. 2009. Butler Lies: Awareness, Deception and Design. In CHI.",
      "doi": "10.1145/1518701.1518782"
    },
    {
      "text": "Stacie Hibino and Audris Mockus. 2002. handiMessenger: Awareness-Enhanced Universal Communication for Mobile Users. In Proceedings of the 4th International Symposium on Mobile Human-Computer Interaction (Mobile HCI '02).",
      "doi": ""
    },
    {
      "text": "Eric Horvitz, Paul Koch, Carl Myers Kadie, and Andy Jacobs. 2013. Coordinates: Probabilistic Forecasting of Presence and Availability. CoRR abs/1301.0573 (2013).",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Srijita Das, Apu Kapadia, Adam J. Lee, and Kami Vaniea. 2017. Was My Message Read?: Privacy and Signaling on Facebook Messenger. In CHI.",
      "doi": ""
    },
    {
      "text": "Leslie K John, Alessandro Acquisti, and George Loewenstein. 2011. Strangers on a plane: Context-dependent willingness to divulge sensitive information. Journal of consumer research (2011).",
      "doi": ""
    },
    {
      "text": "Maritza Johnson, Serge Egelman, and Steven M. Bellovin. 2012. Facebook and Privacy: It's Complicated. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12).",
      "doi": "10.1145/2335356.2335369"
    },
    {
      "text": "Scott Lederer, Jennifer Mankoff, and Anind K. Dey. 2003. Who Wants to Know What When? Privacy Preference Determinants in Ubiquitous Computing. In CHI EA.",
      "doi": ""
    },
    {
      "text": "Heather Richter Lipford, Andrew Besmer, and Jason Watson. 2008. Understanding Privacy Settings in Facebook with an Audience View. In Proceedings of the 1st Conference on Usability, Psychology, and Security (UPSEC'08).",
      "doi": "10.5555/1387649.1387651"
    },
    {
      "text": "Yabing Liu, Krishna P. Gummadi, Balachander Krishnamurthy, and Alan Mislove. 2011. Analyzing Facebook Privacy Settings: User Expectations vs. Reality. In IMC.",
      "doi": ""
    },
    {
      "text": "M. Madejski, M. Johnson, and S. M. Bellovin. 2012. A study of privacy settings errors in an online social network. In 2012 IEEE International Conference on Pervasive Computing and Communications Workshops.",
      "doi": ""
    },
    {
      "text": "Alice Marwick. 2012. The Public Domain: Surveillance in Everyday Life. Surveillance Society 9 (06 2012). DOI: http://dx.doi.org/10.24908/ss.v9i4.4342",
      "doi": ""
    },
    {
      "text": "Alice E. Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society (2011).",
      "doi": ""
    },
    {
      "text": "Alice E Marwick and danah boyd. 2014. Networked privacy: How teenagers negotiate context in social media. New Media & Society (2014).",
      "doi": ""
    },
    {
      "text": "Bonnie A Nardi, Steve Whittaker, and Erin Bradner. 2000. Interaction and outeraction: instant messaging in action. In CSCW.",
      "doi": ""
    },
    {
      "text": "Sarita Schoenebeck, Nicole B. Ellison, Lindsay Blackwell, Joseph B. Bayer, and Emily B. Falk. 2016. Playful Backstalking and Serious Impression Management: How Young Adults Reflect on Their Past Identities on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16).",
      "doi": ""
    },
    {
      "text": "Katherine Strater and Heather Richter Lipford. 2008. Strategies and Struggles with Privacy in an Online Social Networking Community. In Proceedings of the 22Nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction Volume 1 (BCS-HCI '08).",
      "doi": ""
    },
    {
      "text": "Eran Toch and Inbal Levi. 2013. Locality and Privacy in People-nearby Applications. In Ubicomp.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Stacy Blasiola, Eden Litt, and Sameer Patil. 2015. Balancing Audience and Privacy Tensions on Social Network Sites: Strategies of Highly Engaged Users. International Journal of Communication 9 (05 2015).",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Cliff Lampe, Rebecca Gray, and Nicole B. Ellison. 2012. \"Why Won't You Be My Facebook Friend?\": Strategies for Managing Context Collapse in the Workplace. In iConference.",
      "doi": ""
    },
    {
      "text": "Jusik Woo. 2006. The right not to be identified: privacy and anonymity in the interactive media environment. New Media & Society (2006).",
      "doi": ""
    }
  ]
}