{
  "doi": "10.1145/3313831.3376339",
  "title": "Privacy and Activism in the Transgender Community",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Transgender people are marginalized, facing specific privacy concerns and high risk of online and offline harassment, discrimination, and violence. They also benefit tremendously from technology. We conducted semi-structured interviews with 18 transgender people from 3 U.S. cities about their computer security and privacy experiences broadly construed. Participants frequently returned to themes of activism and prosocial behavior, such as protest organization, political speech, and role-modeling transgender identities, so we focus our analysis on these themes. We identify several prominent risk models related to visibility, luck, and identity that participants used to analyze their own risk profiles, often as distinct or extreme. These risk perceptions may heavily influence transgender people's defensive behaviors and self-efficacy, jeopardizing their ability to defend themselves or gain technology's benefits. We articulate design lessons emerging from these ideas, contrasting and relating them to lessons about other marginalized groups whenever possible.",
  "tags": [
    "presentation management",
    "transgender",
    "privacy",
    "gender identity",
    "social networks",
    "user-centered design",
    "security"
  ],
  "authors": [
    {
      "name": "Ada Lerner",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659216237",
      "orcid": "missing"
    },
    {
      "name": "Helen Yuxun He",
      "institution": "Oberlin College, Oberlin, OH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528198",
      "orcid": "missing"
    },
    {
      "name": "Anna Kawakami",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527690",
      "orcid": "missing"
    },
    {
      "name": "Silvia Catherine Zeamer",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527436",
      "orcid": "missing"
    },
    {
      "name": "Roberto Hoyle",
      "institution": "Oberlin College, Oberlin, OH, USA",
      "img": "/do/10.1145/contrib-81554085356/rel-imgonly/rhoyle-cropped.jpg",
      "acmid": "81554085356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alex A. Ahmed, Teresa Almeida, Judeth Oden Choi, Jon Pincus, and Kelly Ireland. 2018. What's at Issue: Sex, Stigma, and Politics in ACM Publishing. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article alt07, 10 pages.",
      "doi": "10.1145/3170427.3188400"
    },
    {
      "text": "Tousif Ahmed, Roberto Hoyle, Kay Connelly, David Crandall, and Apu Kapadia. 2015. Privacy concerns and behaviors of people with visual impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3523--3532.",
      "doi": "10.1145/2702123.2702334"
    },
    {
      "text": "Tousif Ahmed, Roberto Hoyle, Patrick Shaffer, Kay Connelly, David Crandall, and Apu Kapadia. 2017. Understanding the Physical Safety, Security, and Privacy Concerns of People with Visual Impairments. IEEE Internet Computing 21, 3 (May/June 2017), 56--63.",
      "doi": "10.1109/MIC.2017.77"
    },
    {
      "text": "Kevin L Ard and Harvey J Makadon. 2011. Addressing Intimate Partner Violence in Lesbian, Gay, Bisexual, and Transgender Patients. Journal of General Internal Medicine 26, 8 (March 2011), 930--933.",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot, Kyle Rector, Richard Ladner, and Jacob Wobbrock. 2012. PassChords: secure multi-touch authentication for blind people. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '12). ACM, NY, NY, USA, 159--166.",
      "doi": "10.1145/2384916.2384945"
    },
    {
      "text": "MV Lee Badgett, Laura E Durso, and Alyssa Schneebaum. 2013. New patterns of poverty in the lesbian, gay, and bisexual community. (2013).",
      "doi": ""
    },
    {
      "text": "Rosanna Bellini, Angelika Strohmayer, Ebtisam Alabdulqader, Alex A. Ahmed, Katta Spiel, Shaowen Bardzell, and Madeline Balaam. 2018. Feminist HCI: Taking Stock, Moving Forward, and Engaging Community. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Article SIG02, 4 pages.",
      "doi": "10.1145/3170427.3185370"
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT parents and social media: Advocacy, privacy, and disclosure during shifting social movements. In Proceedings of the 2016 CHI conference on human factors in computing systems (CHI '16). ACM, NY, NY, USA, 610--622.",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P Bigham. 2013. Visual challenges in the everyday lives of blind people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2117--2126.",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Burcu Bulgurcu, Hasan Cavusoglu, and Izak Benbasat. 2010. Information security policy compliance: an empirical study of rationality-based beliefs and information security awareness. MIS quarterly 34, 3 (2010), 523--548.",
      "doi": ""
    },
    {
      "text": "Michael P Carey and Andrew D Forsyth. 2019. Teaching Tip Sheet: Self-Efficacy. (2019). https://www.apa.org/pi/aids/resources/education/self-efficacy Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 250.",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Anthony D'Augelli. 1998. Lesbian, gay, and bisexual youth and their families: disclosure of sexual orientation and its consequences. In American Journal of Orthopsychiatry, Vol. 68.",
      "doi": ""
    },
    {
      "text": "Michael A DeVito, Ashley Marie Walker, and Jeremy Birnholtz. 2018. 'Too Gay for Facebook' Presenting LGBTQ+ Identity Throughout the Personal Social Media Ecosystem. Proceedings of the ACM on Human-Computer Interaction Vol. 2, CSCW (Nov. 2018), 1--23.",
      "doi": "10.1145/3274313"
    },
    {
      "text": "Franco Dispenza, Laurel B Watson, Y Barry Chung, and Greg Brack. 2012. Experience of career-related discrimination for female-to-male transgender persons: A qualitative study. The Career Development Quarterly 60, 1 (March 2012), 65--81.",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay. 2016. \"He has a way gayer Facebook than I do\": Investigating sexual identity disclosure and context collapse on a social networking site. New Media & Society 18, 6 (2016), 891--907.",
      "doi": ""
    },
    {
      "text": "Ame Elliott and Sara Brody. 2015. Straight Talk: New Yorkers On Mobile Messaging And Implications For Privacy. (2015), 13.",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Rachel Ralston. 2016. Queer identity online: Informal learning and teaching experiences of LGBTQ individuals on social media. Computers in Human Behavior 65 (Dec 2016), 635--642.",
      "doi": "10.1016/J.CHB.2016.06.009"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. \"A Stalker's Paradise\": How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 667.",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Samantha Friedman, Angela Reynolds, Susan Scovill, Florence Brassier, Ron Campbell, and McKenzie Ballou. 2013. An estimate of housing discrimination against same-sex couples. (2013).",
      "doi": ""
    },
    {
      "text": "Lesbian Gay, Straight Education Network, and others. 2013. Out online: The experiences of lesbian, gay, bisexual and transgender youth on the Internet. (2013). https://www.glsen.org/news/out-online-experiences-lgbt-youth-internet Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "GLAAD. 2018. Glossary of Terms - Transgender. (2018). https://www.glaad.org/reference/transgender Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1956. The presentation of self in everyday life. Anchor Books, New York, New York.",
      "doi": ""
    },
    {
      "text": "Google. 2019. Advanced Protection Program. (2019). https://landing.google.com/advancedprotection/. Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "Jaime M Grant, Lisa Mottet, Justin Edward Tanis, Jack Harrison, Jody Herman, and Mara Keisling. 2011. Injustice at every turn: A report of the national transgender discrimination survey. (2011).",
      "doi": ""
    },
    {
      "text": "Ann P Haas, Philip L Rodgers, and Jody L Herman. 2014. Suicide attempts among transgender and gender non-conforming adults. work 50 (2014), 59.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson. 2019. Mapping gender transition sentiment patterns via social media data: toward decreasing transgender mental health disparities. Journal of the American Medical Informatics Association (2019).",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1176--1190.",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2016. Digital footprints and changing networks during online identity transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2895--2907.",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Oliver L Haimson and Gillian R Hayes. 2017. Changes in social media affect, disclosure, and sociality for a sample of transgender Americans in 2016's political climate. In Proceedings of Eleventh International AAAI Conference on Web and Social Media (ICWSM '17). The AAAI Press.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson and Anna Lauren Hoffmann. 2016. Constructing and enforcing\" authentic\" identity online: Facebook, real names, and non-normative identities. First Monday 21, 6 (2016).",
      "doi": ""
    },
    {
      "text": "Foad Hamidi, Morgan Klaus Scheuerman, and Stacy M Branham. 2018. Gender Recognition or Gender Reductionism?: The Social Implications of Embedded Gender Recognition Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 8.",
      "doi": "10.1145/3173574.3173582"
    },
    {
      "text": "Md Munirul Haque, Shams Zawoad, and Ragib Hasan. 2013. Secure techniques and methods for authenticating visually impaired mobile phone users. In 2013 IEEE International Conference on Technologies for Homeland Security (HST). IEEE, 735--740.",
      "doi": ""
    },
    {
      "text": "Amanda Holpuch. 2014. Victory for drag queens as Facebook apologises for 'real-name' policy. (2014). https://www.theguardian.com/technology/2014/oct/01/victory-drag-queens-facebook-apologises-real-name-policy Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "Stephanie Ann Hooker. 2013. Self-Blame. Springer New York, New York, NY, 1731--1732.",
      "doi": ""
    },
    {
      "text": "Farnaz Irannejad Bisafar, Lina Itzel Martinez, and Andrea G Parker. 2018. Social Computing-Driven Activism in Youth Empowerment Organizations: Challenges and Opportunities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 183.",
      "doi": "10.1145/3173574.3173757"
    },
    {
      "text": "Sandy E James and Jody Herman. 2017. The Report of the 2015 US Transgender Survey: Executive Summary. (2017).",
      "doi": ""
    },
    {
      "text": "Shanna K. Kattari, Darren L. Whitfield, N. Eugene Walls, Lisa Langenderfer-Magruder, and Daniel Ramos. 2016. Policing Gender Through Housing and Employment Discrimination: Comparison of Discrimination Experiences of Transgender and Cisgender LGBQ Individuals. Journal of the Society for Social Work and Research 7, 3 (Sept. 2016), 427--447.",
      "doi": ""
    },
    {
      "text": "Mark J Keith, Courtenay Maynes, Paul Benjamin Lowry, and Jeffry Babb. 2014. Privacy fatigue: The effect of privacy control complexity on consumer electronic information disclosure. In International Conference on Information Systems (ICIS 2014), Auckland, New Zealand, December. 14--17.",
      "doi": ""
    },
    {
      "text": "Ronald C Kessler, Guilherme Borges, and Ellen E Walters. 1999. Prevalence of and risk factors for lifetime suicide attempts in the National Comorbidity Survey. Archives of general psychiatry 56, 7 (1999), 617--626.",
      "doi": ""
    },
    {
      "text": "Alex S Keuroghlian, Derri Shtasel, and Ellen L Bassuk. 2014. Out on the street: a public health and policy agenda for lesbian, gay, bisexual, and transgender youth who are homeless. American Journal of Orthopsychiatry 84, 1 (2014), 66.",
      "doi": ""
    },
    {
      "text": "Joseph G. Kosciw, Neal A. Palmer, and Ryan M. Kull. 2014. Reflecting Resiliency: Openness About Sexual Orientation and/or Gender Identity and Its Relationship to Well-Being and Educational Outcomes for LGBT Students. American Journal of Community Psychology 55, 1--2 (April 2014), 167--178.",
      "doi": ""
    },
    {
      "text": "lamblint (Urban Dictionary user). 2017. Truscum. (2017). https://www.urbandictionary.com/define.php?term=truscum Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "Hanlin Li, Disha Bora, Sagar Salvi, and Erin Brady. 2018. Slacktivists or Activists?: Identity Work in the Virtual Disability March. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 225, 13 pages.",
      "doi": "10.1145/3173574.3173799"
    },
    {
      "text": "Emilia L Lombardi, Riki Anne Wilchins, Dana Priesing, and Diana Malouf. 2002. Gender violence: Transgender experiences with violence and discrimination. Journal of homosexuality 42, 1 (2002), 89--101.",
      "doi": ""
    },
    {
      "text": "Mary Madden. 2017. Privacy, Security, and Digital Inequality. (2017).",
      "doi": ""
    },
    {
      "text": "Mary Madden, Michele Gilman, Karen Levy, and Alice Marwick. 2017. Privacy, poverty, and big data: A matrix of vulnerabilities for poor Americans. Wash. UL Rev. 95 (2017), 53.",
      "doi": ""
    },
    {
      "text": "Alice E. Marwick and danah boyd. 2010. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (July 2010), 114--133.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F Churchill, and Sunny Consolvo. 2017. Stories from survivors: Privacy & security practices when coping with intimate partner abuse. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, NY, NY, USA.",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Lydia Michie, Madeline Balaam, John McCarthy, Timur Osadchiy, and Kellie Morrissey. 2018. From her story, to our story: Digital storytelling as public engagement around abortion rights advocacy in Ireland. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 357.",
      "doi": "10.1145/3173574.3173931"
    },
    {
      "text": "Brian Mustanski, Rebecca Andrews, and Jae A. Puckett. 2016. The Effects of Cumulative Victimization on Mental Health Among Lesbian, Gay, Bisexual, and Transgender Adolescents and Young Adults. American Journal of Public Health 106, 3 (March 2016).",
      "doi": ""
    },
    {
      "text": "Brian Mustanski, Michael Newcomb, and Robert Garofalo. 2011. Mental health of lesbian, gay, and bisexual youth: A developmental resiliency perspective. Journal of Gay & Lesbian Social Services 23, 2 (Jan. 2011).",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 79. Privacy as Contextual Integrity. Washington Law Review.",
      "doi": ""
    },
    {
      "text": "Matthew K Nock and Ronald C Kessler. 2006. Prevalence of and risk factors for suicide attempts versus suicide gestures: analysis of the National Comorbidity Survey. Journal of abnormal psychology 115, 3 (2006), 616.",
      "doi": ""
    },
    {
      "text": "ProPublica. 2019. When Transgender Travelers Walk Into Scanners, Invasive Searches Sometimes Wait on the Other Side. (2019). https://www.propublica.org/article/tsa-transgender-travelers-scanners-invasive-searches\\ \\-often-wait-on-the-other-side Accessed 17-December-2019.",
      "doi": ""
    },
    {
      "text": "Marcus Renner and Ellen Taylor-Powell. 2003. Analyzing qualitative data. Programme Development & Evaluation, University of Wisconsin-Extension Cooperative Extension (2003), 1--10.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places: Unpacking Technology-Mediated Experiences of Safety and Harm with Transgender People. Proceedings of the ACM on Human-Computer Interaction 2, CSCW, Article 155 (Nov. 2018), 27 pages.",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Katie A Siek, Yvonne Rogers, and Kay H Connelly. 2005. Fat finger worries: how older and younger users physically interact with PDAs. In IFIP Conference on Human-Computer Interaction (INTERACT '05). Springer, 267--280.",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Janaki Srinivasan, Savita Bailur, Emrys Schoemaker, and Sarita Seshagiri. 2018. Privacy at the margins| The poverty of privacy: Understanding privacy trade-offs from identity infrastructure users in India. International Journal of Communication 12 (2018), 20.",
      "doi": ""
    },
    {
      "text": "Sarah E Ullman. 1996. Social reactions, coping strategies, and self-blame attributions in adjustment to sexual assault. Psychology of women quarterly 20, 4 (1996), 505--526.",
      "doi": ""
    },
    {
      "text": "Stephen Whittle. 1998. The trans-cyberian mail way. Social & Legal Studies 7, 3 (1998), 389--408.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Heng Xu, Mary Beth Rosson, Daniel F. Perkins, and John M. Carroll. 2016. Dear Diary: Teens Reflect on Their Weekly Online Risk Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3919--3930.",
      "doi": ""
    },
    {
      "text": "Pamela J Wisniewski, Heng Xu, Mary Beth Rosson, and John M Carroll. 2014. Adolescent online safety: The \"Moral\" of the Story. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, New York, USA, 1258--1271.",
      "doi": "10.1145/2531602.2531696"
    },
    {
      "text": "Shaomei Wu and Lada A Adamic. 2014. Visually impaired users on an online social network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3133--3142.",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Jillian C York and Dia Kayyali. 2014. Facebook's 'Real Name' Policy Can Cause Real-World Harm for the LGBTQ Community. (2014). https://www.eff.org/deeplinks/2014/09/facebooks-real-name-policy-can-cause-real-world-\\ \\harm-lgbtq-community Accessed 17-December-2019.",
      "doi": ""
    }
  ]
}