{
  "doi": "10.1145/3313831.3376829",
  "title": "Design Study \"Lite\" Methodology: Expediting Design Studies and Enabling the Synergy of Visualization Pedagogy and Social Good",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Design studies are frequently used to conduct problem-driven visualization research by working with real-world domain experts. In visualization pedagogy, design studies are often introduced but rarely practiced due to their large time requirements. This limits students to a classroom curriculum, often involving projects that may not have implications beyond the classroom. Thus we present the Design Study \"Lite\" Methodology, a novel framework for implementing design studies with novice students in 14 weeks. We utilized the Design Study \"Lite\" Methodology in conjunction with Service-Learning to teach five Data Visualization courses and demonstrate that it benefits not only the students but also the community through service to non-profit partners. In this paper, we provide a detailed breakdown of the methodology and how Service-Learning can be incorporated with it. We also include an extensive reflection on the methodology and provide recommendations for future applications of the framework for teaching visualization courses and research.",
  "tags": [
    "design studies",
    "service-learning",
    "theory and methods",
    "visualization",
    "pedagogy"
  ],
  "authors": [
    {
      "name": "Uzma Haque Syeda",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659200280",
      "orcid": "missing"
    },
    {
      "name": "Prasanth Murali",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319376",
      "orcid": "missing"
    },
    {
      "name": "Lisa Roe",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527102",
      "orcid": "missing"
    },
    {
      "name": "Becca Berkey",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527383",
      "orcid": "missing"
    },
    {
      "name": "Michelle A. Borkin",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585455",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michael Sedlmair, Miriah Meyer, and Tamara Munzner. Design study methodology: Reflections from the trenches and the stacks. IEEE Transactions on Visualization and Computer Graphics,18(12):2431--2440, 2012.",
      "doi": "10.1109/TVCG.2012.213"
    },
    {
      "text": "Michelle A. Borkin, Zirui Yan, Britton Horn, Lisa Roe, and Becca Berkey. Visualization education through social impact: A service-learning approach for visualization pedagogy. Proceedings of the Pedagogy of Data Visualization Workshop (PDVW 2017), IEEE VIS Conference, 2017.",
      "doi": ""
    },
    {
      "text": "Michael Sedlmair. Visual Analysis of In-Car Communication Networks. PhD thesis, lmu, 2010.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner, Qiang Kong, Raymond T Ng, Jordan Lee, Janek Klawe, Dragana Radulovic, and Carson K Leung. Visual mining of power sets with large alphabets. Department of Computer Science, The University of British Columbia, 2, 2005.",
      "doi": ""
    },
    {
      "text": "Miriah Meyer and Jason Dykes. Criteria for rigor in visualization design study. CoRR, abs/1907.08495, 2019.",
      "doi": ""
    },
    {
      "text": "John Hughes, Val King, Tom Rodden, and Hans Andersen. Moving out from the control room: ethnography in system design. In Proceedings of the 1994 ACM conference on Computer supported cooperative work, pages 429--439. ACM, 1994.",
      "doi": "10.1145/192844.193065"
    },
    {
      "text": "John A Hughes, Jon O'Brien, Tom Rodden, Mark Rouncefield, and Steve Blythin. Designing with ethnography: a presentation framework for design. In Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques, pages 147--158. ACM, 1997.",
      "doi": "10.1145/263552.263598"
    },
    {
      "text": "Andrew Crabtree, Tom Rodden, Peter Tolmie, and Graham Button. Ethnography considered harmful. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 879--888. ACM,2009.",
      "doi": "10.1145/1518701.1518835"
    },
    {
      "text": "Gillian R Hayes. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction (TOCHI), 18(3):15, 2011.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, Helen Sharp, and Jenny Preece. Interaction design-beyond human-computer interaction,2012.",
      "doi": ""
    },
    {
      "text": "Richard Wiseman. 59 seconds: think a little, change a lot. Random House Canada, 2010.",
      "doi": ""
    },
    {
      "text": "Francis Crick. The impact of linus pauling on molecular biology: A reminiscence. The chemical bond: Structure and dynamics, pages 87--98, 1992.",
      "doi": ""
    },
    {
      "text": "Daniel F Keefe, Daniel Acevedo, Jadrian Miles, Fritz Drury, Sharon M Swartz, and David H Laidlaw. Scientific sketching for collaborative vr visualization design. IEEE Transactions on Visualization and Computer Graphics, 14(4):835--847, 2008.",
      "doi": "10.1109/TVCG.2008.31"
    },
    {
      "text": "Tamara Munzner. A nested model for visualization design and validation. IEEE Transactions on Visualization and Computer Graphics, 15(6):921--928,2009.",
      "doi": "10.1109/TVCG.2009.111"
    },
    {
      "text": "G Elisabeta Marai. Activity-centered domain characterization for problem-driven scientific visualization. IEEE Transactions on Visualization and Computer Graphics, 24(1):913--922, 2017.",
      "doi": ""
    },
    {
      "text": "Don Norman. The design of everyday things: Revised and expanded edition. Basic books, 2013.",
      "doi": ""
    },
    {
      "text": "Sean McKenna, Dominika Mazur, James Agutter, and Miriah Meyer. Design activity framework for visualization design. IEEE Transactions on Visualization and Computer Graphics, 20(12):2191--2200, 2014.",
      "doi": ""
    },
    {
      "text": "David Lloyd and Jason Dykes. Human-centered approaches in geovisualization design: Investigating multiple methods through a long-term case study. IEEE Transactions on Visualization and Computer Graphics, 17(12):2498--2507, 2011.",
      "doi": "10.1109/TVCG.2011.209"
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. Low-level components of analytic activity in information visualization. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005., pages 111--117. IEEE, 2005.",
      "doi": ""
    },
    {
      "text": "Jarke J Van Wijk. Views on visualization. IEEE Transactions on Visualization and Computer Graphics, 12(4):421--432, 2006.",
      "doi": "10.1109/TVCG.2006.80"
    },
    {
      "text": "Heidi Lam, Enrico Bertini, Petra Isenberg, Catherine Plaisant, and Sheelagh Carpendale. Empirical studies in information visualization: Seven scenarios. IEEE Transactions on Visualization and Computer Graphics, 18(9):1520--1536, 2011.",
      "doi": "10.1109/TVCG.2011.279"
    },
    {
      "text": "Sheelagh Carpendale. Evaluating information visualizations. In Information visualization, pages 19--45. Springer, 2008.",
      "doi": "10.1007/978-3-540-70956-5_2"
    },
    {
      "text": "Zezhong Wang, Harvey Dingwall, and Benjamin Bach. Teaching data visualization and storytelling with data comic workshops. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, page CS26. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts, Panagiotis D Ritsos, James Jackson, and Chris Headleand. The explanatory visualization framework: An active learning framework for teaching creative. IEEE Transactions on Visualization and Computer Graphics, 10.",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts. The five design-sheet (fds) approach for sketching information visualization designs. In Eurographics (Education Papers), pages 29--36, 2011.",
      "doi": ""
    },
    {
      "text": "Design Council. Eleven lessons: Managing design in eleven global companies-desk research report. Design Council, 2007.",
      "doi": ""
    },
    {
      "text": "Ken Schwaber and Mike Beedle. Agile software development with Scrum, volume 1. Prentice Hall Upper Saddle River, 2002.",
      "doi": "10.5555/559553"
    },
    {
      "text": "Ben Shneiderman. Creating creativity: user interfaces for supporting innovation. ACM Transactions on Computer-Human Interaction (TOCHI), 7(1):114--138, 2000.",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. Co-creation and the new landscapes of design. Co-design, 4(1):5--18, 2008.",
      "doi": ""
    },
    {
      "text": "Lauren Wilcox, Betsy DiSalvo, Dick Henneman, and Qiaosi Wang. Design in the hci classroom: Setting a research agenda. In Proceedings of the 2019 on Designing Interactive Systems Conference, pages 871--883. ACM, 2019.",
      "doi": "10.1145/3322276.3322381"
    },
    {
      "text": "Jonathan Lazar, Jenny Preece, Jean Gasen, Terry Winograd, and Terry Winograd. New issues in teaching hci: pinning a tail on a moving donkey. In CHI'02 Extended Abstracts on Human Factors in Computing Systems, pages 696--697. ACM, 2002.",
      "doi": "10.1145/506443.506551"
    },
    {
      "text": "Khai N Truong, Gillian R Hayes, and Gregory D Abowd. Storyboarding: an empirical determination of best practices and effective guidelines. In Proceedings of the 6th conference on Designing Interactive systems, pages 12--21. ACM, 2006.",
      "doi": "10.1145/1142405.1142410"
    },
    {
      "text": "Káthia Marçal de Oliveira, Patrick Girard, Taisa Guidini Gonçalves, Sophie Lepreux, and Christophe Kolski. Teaching task analysis for user interface design: lessons learned from three pilot studies. In Proceedings of the 27th Conference on l'Interaction Homme-Machine, page 31. ACM, 2015.",
      "doi": ""
    },
    {
      "text": "Rui Chen, Po-Jui Ray Chen, Rui Feng, Yilin Elaine Liu, Andy Wu, and Ali Mazalek. Scisketch: a tabletop collaborative sketching system. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, pages 247--250. ACM, 2014.",
      "doi": ""
    },
    {
      "text": "Chase Felker, Radka Slamova, and Janet Davis. Integrating ux with scrum in an undergraduate software development project. In Proceedings of the 43rd ACM Technical Symposium on Computer Science Education, pages 301--306. ACM, 2012.",
      "doi": "10.1145/2157136.2157226"
    },
    {
      "text": "Beryl Plimmer and Robert Amor. Peer teaching extends hci learning. In ACM Sigcse Bulletin, volume 38, pages 53--57. ACM, 2006.",
      "doi": "10.1145/1140124.1140141"
    },
    {
      "text": "Mary Beth Rosson, John M Carroll, and Con M Rodi. Case studies for teaching usability engineering. In ACM SIGCSE Bulletin, volume 36, pages 36--40. ACM, 2004.",
      "doi": "10.1145/971300.971315"
    },
    {
      "text": "D Scott McCrickard, Christa M Chewar, and Jacob Somervell. Design, science, and engineering topics?: teaching hci with a unified method. In ACM SIGCSE Bulletin, volume 36, pages 31--35. ACM, 2004.",
      "doi": "10.1145/971300.971314"
    },
    {
      "text": "Xristine Faulkner and Fintan Culwin. Enter the usability engineer: integrating hci and software engineering. In ACM SIGCSE Bulletin, volume 32, pages 61--64. ACM, 2000.",
      "doi": "10.1145/343048.343076"
    },
    {
      "text": "Eli Blevis, Yvonne Rogers, Martin Siegel, William Hazlewood, and Amanda Stephano. Integrating hci and design: Hci/d at iub, a design education case story. In Zimmerman, J., Evenson, S., Baumann, K., & Purgathofer, P. Workshop on the relationship between design and HCI. ACM CHI 2004 Conference on Human Factors and Computing Systems. Vienna, Austria. http://k2. iguw. tuwien. ac. at, volume 8080, 2004.",
      "doi": ""
    },
    {
      "text": "Mihaela Vorvoreanu, Colin M Gray, Paul Parsons, and Nancy Rasche. Advancing ux education: A model for integrated studio pedagogy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, pages 1441--1446. ACM, 2017.",
      "doi": "10.1145/3025453.3025726"
    },
    {
      "text": "Piotr D Adamczyk and Michael B Twidale. Supporting multidisciplinary collaboration: requirements from novel hci education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 1073--1076. ACM, 2007.",
      "doi": "10.1145/1240624.1240787"
    },
    {
      "text": "Uzma Haque Syeda, Prasanth Murali, and Michelle Borkin. Chester square park: A case study of visualization for social good using design study \"lite\" methodology. In Posters presented at the IEEE Conference on Visualization (IEEE VIS 2019), Vancouver, Canada, October, 2019.",
      "doi": ""
    },
    {
      "text": "Andrew Furco. Service-learning: A balanced approach to experiential education. 1996.",
      "doi": ""
    },
    {
      "text": "Barbara Jacoby et al. Service-Learning in Higher Education: Concepts and Practices. The Jossey-Bass Higher and Adult Education Series. ERIC, 1996.",
      "doi": ""
    },
    {
      "text": "Robert Sigmon. Service-learning: Three principles. Synergist, 8(1):9--11, 1979.",
      "doi": ""
    },
    {
      "text": "Janet Eyler and Dwight E Giles Jr. Where's the Learning in Service-Learning? Jossey-Bass Higher and Adult Education Series. ERIC, 1999.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. Visualization analysis and design. A K Peters Visualization Series, CRC Press, 2014.",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. A multi-level typology of abstract visualization tasks. IEEE Transactions on Visualization and Computer Graphics, 19(12):2376--2385, 2013.",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Hsiu-Fang Hsieh and Sarah E Shannon. Three approaches to qualitative content analysis. Qualitative health research, 15(9):1277--1288, 2005.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. Using thematic analysis in psychology. Qualitative research in psychology, 3(2):77--101, 2006.",
      "doi": ""
    },
    {
      "text": "Valerie Mendoza and David G Novick. Usability over time. In Proceedings of the 23rd annual International Conference on Design of Communication: Documenting & Designing for Pervasive Information, pages 151--158. ACM, 2005.",
      "doi": "10.1145/1085313.1085348"
    },
    {
      "text": "Michael Correll. Ethical dimensions of visualization research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 188. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. Data is personal: Attitudes and perceptions of data visualization in rural pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, page 244. ACM, 2019.",
      "doi": ""
    }
  ]
}