{
  "doi": "10.1145/3313831.3376780",
  "title": "Bureaucracy as a Lens for Analyzing and Designing Algorithmic Systems",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Scholarship on algorithms has drawn on the analogy between algorithmic systems and bureaucracies to diagnose shortcomings in algorithmic decision-making. We extend the analogy further by drawing on Michel Crozier's theory of bureaucratic organizations to analyze the relationship between algorithmic and human decision-making power. We present algorithms as analogous to impartial bureaucratic rules for controlling action, and argue that discretionary decision-making power in algorithmic systems accumulates at locations where uncertainty about the operation of algorithms persists. This key point of our essay connects with Alkhatib and Bernstein's theory of 'street-level algorithms', and highlights that the role of human discretion in algorithmic systems is to accommodate uncertain situations which inflexible algorithms cannot handle. We conclude by discussing how the analysis and design of algorithmic systems could seek to identify and cultivate important sources of uncertainty, to enable the human discretionary work that enhances systemic resilience in the face of algorithmic errors.",
  "authors": [
    {
      "name": "Juho Pääkkönen",
      "institution": "University of Helsinki & Aalto University, Helsinki & Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527487",
      "orcid": "missing"
    },
    {
      "name": "Matti Nelimarkka",
      "institution": "University of Helsinki & Aalto University, Helsinki & Espoo, Finland",
      "img": "/do/10.1145/contrib-81384619987/rel-imgonly/norma.jpg",
      "acmid": "81384619987",
      "orcid": "missing"
    },
    {
      "name": "Jesse Haapoja",
      "institution": "University of Helsinki & Aalto University, Helsinki & Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659309442",
      "orcid": "missing"
    },
    {
      "name": "Airi Lampinen",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81430677521/rel-imgonly/2014-09-1710.28.00.jpg",
      "acmid": "81430677521",
      "orcid": "0000-0002-9100-3826"
    }
  ],
  "references": [
    {
      "text": "Ali Alkhatib and Michael Bernstein. 2019. Street-Level Algorithms: A Theory at the Gaps Between Policy and Decisions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, Glasgow, Scotland Uk, 1--13. DOI: http://dx.doi.org/10.1145/3290605.3300760",
      "doi": "10.1145/3290605.3300760"
    },
    {
      "text": "Ali Alkhatib, Michael S. Bernstein, and Margaret Levi. 2017. Examining Crowd Work and Gig Work Through The Historical Lens of Piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, Denver, Colorado, USA, 4599--4616. DOI: http://dx.doi.org/10.1145/3025453.3025974",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Mike Ananny. 2016. Toward an Ethics of Algorithms: Convening, Observation, Probability, and Timeliness. Science, Technology, & Human Values 41, 1 (Jan. 2016), 93--117. DOI: http://dx.doi.org/10.1177/0162243915606523",
      "doi": ""
    },
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. New Media & Society 20, 3 (March 2018), 973--989. DOI: http://dx.doi.org/10.1177/1461444816676645",
      "doi": ""
    },
    {
      "text": "Julia Angwin, Jeff Larson, Surya Mattu, and Lauren Kirchner. 2016. Machine Bias. ProPublica (2016). https://www.propublica.org/article/ machine-bias-risk-assessments-in-criminal-sentencing",
      "doi": ""
    },
    {
      "text": "Jane Bambauer and Tal Zarsky. 2018. The Algorithm Game. 94 Notre Dame Law Review 1; Arizona Legal Studies Discussion Paper No. 18-09 (2018). https://ssrn.com/abstract=3135949",
      "doi": ""
    },
    {
      "text": "Jens Beckert. 2016. Imagined Futures. Harvard University Press. Google-Books-ID: BhSSjgEACAAJ.",
      "doi": ""
    },
    {
      "text": "David Beer. 2016. Metric Power. Palgrave Macmillan Limited, London, UNITED KINGDOM.",
      "doi": ""
    },
    {
      "text": "Mark Bovens and Stavros Zouridis. 2002. From Street-Level to System-Level Bureaucracies: How Information and Communication Technology is Transforming Administrative Discretion and Constitutional Control. Public Administration Review 62, 2 (2002), 174--184. DOI: http://dx.doi.org/10.1111/0033--3352.00168",
      "doi": ""
    },
    {
      "text": "Geoffrey C. Bowker and Susan Leigh Star. 1999. Sorting things out: Classification and its consequences. MIT Press, Cambridge, Mass. http://www.worldcat.org/title/ sorting-things-out-classification-and-its-consequences/ oclc/41273009&referer=brief_results",
      "doi": "10.5555/380681"
    },
    {
      "text": "Jeffrey Bradshaw, Maarten Sierhuis, Alessandro Acquisti, Paul Feltovich, Robert Hoffman, Renia Jeffers, Debbie Prescott, Niranjan Suri, Andrzej Uszok, and Ron Van Hoof. 2003. Adjustable Autonomy and Human-Agent Teamwork in Practice: An Interim Report on Space Applications. In Agent Autonomy. Multiagent Systems, Artificial Societies, and Simulated Organizations (International Book Series), vol 7, Henry Hexmoor, Cristiano Castelfranchi, and Rino Falcone (Eds.). Springer, 243--280.",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2012. Want to be on the top? Algorithmic power and the threat of invisibility on Facebook. New Media & Society 14, 7 (Nov. 2012), 1164--1180. DOI: http://dx.doi.org/10.1177/1461444812440159",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2017. The algorithmic imaginary: Exploring the ordinary affects of Facebook algorithms. Information, Communication & Society 20, 1 (Jan. 2017), 30--44. DOI: http://dx.doi.org/10.1080/1369118X.2016.1154086",
      "doi": ""
    },
    {
      "text": "Robyn Caplan and danah boyd. 2018. Isomorphism through algorithms: Institutional dependencies in the case of Facebook. Big Data & Society 5, 1 (2018). DOI: http://dx.doi.org/10.1177/2053951718757253",
      "doi": ""
    },
    {
      "text": "Angèle Christin. 2017. Algorithms in practice: Comparing web journalism and criminal justice. Big Data & Society 4, 2 (Dec. 2017), 2053951717718855. DOI: http://dx.doi.org/10.1177/2053951717718855",
      "doi": ""
    },
    {
      "text": "Harry M. Collins and Martin Kusch. 1998. The Shape of Actions: What Humans and Machines Can Do. MIT Press. Google-Books-ID: W2IYF9RWpQwC.",
      "doi": ""
    },
    {
      "text": "Kelley Cotter. 2018. Playing the visibility game: How digital influencers and algorithms negotiate influence on Instagram. New Media & Society 21, 4 (2018).",
      "doi": ""
    },
    {
      "text": "Michel Crozier. 1964. The Bureaucratic Phenomenon. Tavistock.",
      "doi": ""
    },
    {
      "text": "Michel Crozier and Erhard Friedberg. 1980. Actors and Systems: The Politics of Collective Action. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2016. Algorithms and their others: Algorithmic culture in context. Big Data & Society (2016). DOI: http://dx.doi.org/10.1177/2053951716665128",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I \"like\" it, then I hide it. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. 2371--2382. DOI: http://dx.doi.org/10.1145/2858036.2858494",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Virginia Eubanks. 2018. Automating Inequality: How High-Tech Tools Profile, Police, and Punish the Poor. St. Martin's Press, New York, NY.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Batya Friedman, Peter H Kahn, and Alan Borning. 2008. Value sensitive design and information systems. The handbook of information and computer ethics (2008), 69--101.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2014. The Relevance of Algorithms. In Media technologies: Essays on communication, materiality, and society. The MIT Press. http://mitpress.universitypressscholarship.com/view/ 10.7551/mitpress/9780262525374.001.0001/ upso-9780262525374-chapter-9",
      "doi": "10.5555/2500954"
    },
    {
      "text": "Tarleton Gillespie. 2017. Algorithmically recognizable: Santorum's Google problem, and Google's Santorum problem. Information, Communication & Society 20, 1 (Jan. 2017), 63--80. DOI: http://dx.doi.org/10.1080/1369118X.2016.1199721",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the Internet: Platforms, content moderation, and the hidden decisions that shape social media. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Bryce Goodman. 2016. A Step Towards Accountable Algorithms?: Algorithmic Discrimination and the European Union General Data Protection. 29th Conference on Neural Information Processing Systems (NIPS 2016), Barcelona, Spain. Nips (2016), 1--7.",
      "doi": ""
    },
    {
      "text": "Mary L. Gray and Siddharth Suri. 2019. Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass. Houghton Mifflin Harcourt.",
      "doi": ""
    },
    {
      "text": "Mary L. Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The Crowd is a Collaborative Network. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 134--147. DOI: http://dx.doi.org/10.1145/2818048.2819942",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "Jesse Haapoja and Airi Lampinen. 2018. 'Datafied' reading: Framing behavioral data and algorithmic news recommendations. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction NordiCHI '18. ACM Press. DOI: http://dx.doi.org/10.1145/3240167.3240194",
      "doi": "10.1145/3240167.3240194"
    },
    {
      "text": "Orit Halpern, Robert Mitchell, and Bernard Dionysius Geoghegan. 2017. The Smartness Mandate: Notes toward a Critique. Grey Room 68 (Sept. 2017), 106--129. DOI: http://dx.doi.org/10.1162/GREY_a_00221",
      "doi": ""
    },
    {
      "text": "C S Holling. 1973. Resilience and Stability of Ecological Systems. Annual Review of Ecology and Systematics 4, 1 (1973), 1--23. DOI: http://dx.doi.org/10.1146/annurev.es.04.110173.000245",
      "doi": ""
    },
    {
      "text": "Eric Horvitz. 1999. Principles of Mixed-initiative User Interfaces. Proceedings of the 1999 CHI Conference on Human Factors in Computing Systems - CHI '99 (1999), 159--166. DOI: http://dx.doi.org/10.1145/302979.303030",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Lucas D. Introna. 2011. The Enframing of Code: Agency, Originality and the Plagiarist. Theory, Culture & Society 28, 6 (Nov. 2011), 113--141. DOI: http://dx.doi.org/10.1177/0263276411418131",
      "doi": ""
    },
    {
      "text": "Lucas D. Introna. 2016. Algorithms, Governance, and Governmentality: On Governing Academic Writing. Science, Technology, & Human Values 41, 1 (Jan. 2016), 17--49. DOI: http://dx.doi.org/10.1177/0162243915587360",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson. 2014. Rethinking Repair. In Media technologies : essays on communication, materiality, and society. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Gabriella Jansson and Gissur Ó Erlingsson. 2014. More E-Government, Less Street-Level Bureaucracy? On Legitimacy and the Human Side of Public Administration. Journal of Information Technology & Politics 11, 3 (July 2014), 291--308. DOI: http://dx.doi.org/10.1080/19331681.2014.908155",
      "doi": ""
    },
    {
      "text": "Elliott Jaques. 1976. A general theory of bureaucracy. Heinemann; New York: Halsted Press.",
      "doi": ""
    },
    {
      "text": "Sanjay Kairam and Jeffrey Heer. 2016. Parting Crowds: Characterizing Divergent Interpretations in Crowdsourced Annotation Tasks. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1637--1648. DOI: http://dx.doi.org/10.1145/2818048.2820016",
      "doi": "10.1145/2818048.2820016"
    },
    {
      "text": "Eugene C Kim. 2007. YouTube: Testing the safe harbors of digital copyright law. S. Cal. Interdisc. LJ 17 (2007), 139.",
      "doi": ""
    },
    {
      "text": "Ulrike Klinger and Jakob Svensson. 2018. The End of Media Logics? On Algorithms and Agency. New Media & Society 20, 12 (12 2018), 4653--4670. DOI: http://dx.doi.org/10.1177/1461444818779750",
      "doi": ""
    },
    {
      "text": "Frank Knight. 1921. Risk, Uncertainty, and Profit. Dover Publications.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 1603--1612. DOI: http://dx.doi.org/10.1145/2702123.2702548",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Michael Lipsky. 1983. Street-Level Bureaucracy: The Dilemmas of the Individual in Public Service. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Caitlin Lustig, Katie Pine, Bonnie Nardi, Lilly Irani, Min Kyung Lee, Dawn Nafus, and Christian Sandvig. 2016. Algorithmic Authority: The Ethics, Politics, and Economics of Algorithms That Interpret, Decide, and Manage. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 1057--1062. DOI: http://dx.doi.org/10.1145/2851581.2886426",
      "doi": "10.1145/2851581.2886426"
    },
    {
      "text": "Claire Maiers. 2017. Analytics in action: users and predictive data in the neonatal intensive care unit. Information Communication and Society 20, 6 (2017), 915--929. DOI: http://dx.doi.org/10.1080/1369118X.2017.1291701",
      "doi": ""
    },
    {
      "text": "Brian McInnis, Dan Cosley, Chaebong Nam, and Gilly Leshed. 2016. Taking a HIT: Designing Around Rejection, Mistrust, Risk, and Workers' Experiences in Amazon Mechanical Turk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2271--2282. DOI: http://dx.doi.org/10.1145/2858036.2858539",
      "doi": "10.1145/2858036.2858539"
    },
    {
      "text": "Anne Milgram. 2013. Why smart statistics are the key to fighting crime. (2013). https://www.ted.com/talks/anne_milgram_why_smart_ statistics_are_the_key_to_fighting_crime",
      "doi": ""
    },
    {
      "text": "Gareth Morgan. 2006. Images of organization: The executive edition. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Judith Möller, Damian Trilling, Natali Helberger, and Bram van Es. 2018. Do not blame it on the algorithm: An empirical assessment of multiple recommender systems and their impact on content diversity. Information, Communication & Society 21, 7 (July 2018), 959--977. DOI: http://dx.doi.org/10.1080/1369118X.2018.1444076",
      "doi": ""
    },
    {
      "text": "Daniel Neyland and Norma Möllers. 2017. Algorithmic IF ... THEN rules and the conditions and consequences of power. Information, Communication & Society 20, 1 (Jan. 2017), 45--62. DOI: http://dx.doi.org/10.1080/1369118X.2016.1156141",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2005. Values in Technical Design. In Encyclopedia of Science, Technology, and Ethics, Carl Mitcham (Ed.). MacMillan, New York, lxvi--lxx.",
      "doi": ""
    },
    {
      "text": "Cathy O'Neil. 2016. Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy. Crown/Archetype.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2016. HCI Research as Problem-Solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 4956--4967. DOI: http://dx.doi.org/10.1145/2858036.2858283",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "Sarah Pink, Minna Ruckenstein, Robert Willim, and Melisa Duque. 2018. Broken data: Conceptualising data in an emerging world. Big Data & Society 5, 1 (Jan. 2018), 2053951717753228. DOI: http://dx.doi.org/10.1177/2053951717753228",
      "doi": ""
    },
    {
      "text": "Theodore M. Porter. 1995. Trust in Numbers: The Pursuit of Objectivity in Science and Public Life. Princeton University Press. http://www.jstor.org/stable/j.ctt7sp8x",
      "doi": ""
    },
    {
      "text": "Emilee Rader and Rebecca Gray. 2015. Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (2015), 173--182. DOI: http://dx.doi.org/10.1145/2702123.2702174",
      "doi": "10.1145/2702123.2702174"
    },
    {
      "text": "David Randall, Richard Harper, and Mark Rouncefield. 2007. Fieldwork for design: theory and practice. Springer Science & Business Media.",
      "doi": "10.5555/1296077"
    },
    {
      "text": "Luis Ignacio Reyes-Galindo. 2016. Automating the Horae: Boundary-work in the age of computers. Social Studies of Science (2016). https://arxiv.org/pdf/1603.03824.pdf",
      "doi": ""
    },
    {
      "text": "Minna Ruckenstein and Natasha Schüll. 2017. The Datafication of Health. Annual Review of Anthropology 46, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Nick Seaver. 2018. What should an anthropology of algorithms do? Cultural anthropology 33, November (aug 2018), 1--8. DOI: http://dx.doi.org/10.14506/ca33.3.04",
      "doi": ""
    },
    {
      "text": "Herbert A Simon. 1972. Theories of bounded rationality. Decision and organization 1, 1 (1972), 161--176.",
      "doi": ""
    },
    {
      "text": "Rashmi Sinha and Kirsten Swearingen. 2002. The Role of Transparency in Recommender Systems. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 830--831. DOI: http://dx.doi.org/10.1145/506443.506619",
      "doi": ""
    },
    {
      "text": "Linda Skitka, Kathleen Mosier, and Mark Burdick. 1999. Does automation bias decision-making? International Journal of Human-Computer Studies 51, 5 (1999).",
      "doi": "10.1006/ijhc.1999.0252"
    },
    {
      "text": "Linda Skitka, Kathleen Mosier, and Mark Burdick. 2000. Accountability and automation bias. International Journal of Human-Computer Studies 52, 4 (2000).",
      "doi": "10.1006/ijhc.1999.0349"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. Computer Supported Cooperative Work (CSCW) 8, 1 (March 1999), 9--30. DOI: http://dx.doi.org/10.1023/A:1008651105359",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Anselm Strauss. 1988. The Articulation of Project Work: An Organizational Process. The Sociological Quarterly 29 (1988).",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and Situated Actions: The Problem of Human-Machine Communication (2 edition ed.). Cambridge University Press, Cambridge Cambridgeshire ; New York.",
      "doi": ""
    },
    {
      "text": "Suzanne L Thomas, Dawn Nafus, and Jamie Sherman. 2018. Algorithms as fetish: Faith and possibility in algorithmic work. Big Data & Society 5, 1 (6 2018), 205395171775155. DOI: http://dx.doi.org/10.1177/2053951717751552",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, James Pycock, Tim Diggins, Allan MacLean, and Alain Karsenty. 2002. Unremarkable Computing. Proceedings of the 2002 SIGCHI Conference on Human Factors in Computing Systems CHI '02 (2002). DOI: http://dx.doi.org/10.1145/503376.503448",
      "doi": ""
    },
    {
      "text": "Max Weber. 2013. Bureacracy. Routledge, 196--244.",
      "doi": ""
    },
    {
      "text": "Michele Willson. 2017. Algorithms (and the) everyday. Information, Communication & Society 20, 1 (Jan. 2017), 137--150. DOI: http://dx.doi.org/10.1080/1369118X.2016.1200645",
      "doi": ""
    },
    {
      "text": "Qian Yang. 2018. Machine Learning as a UX Design Material: How Can We Imagine Beyond Automation, Recommenders, and Reminders? 2018 AAAI Spring Symposium Series (2018). https://www.aaai.org/ocs/ index.php/SSS/SSS18/paper/view/17471",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfel, and John Zimmerman. 2019. Unremarkable AI: Fitting Intelligent Decision Support into Critical, Clinical Decision-Making Processes. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19 (2019). DOI: http://dx.doi.org/10.1145/3290605.3300468",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Malte Ziewitz. 2019. Rethinking gaming: The ethical work of optimization in web search engines. Social Studies of Science (aug 2019), 030631271986560. DOI: http://dx.doi.org/10.1177/0306312719865607",
      "doi": ""
    },
    {
      "text": "Indre ?liobaite. 2017. Measuring discrimination in algorithmic decision making. Data Mining and Knowledge Discovery 31, 4 (2017), 1060--1089.",
      "doi": "10.1007/s10618-017-0506-1"
    }
  ]
}