{
  "doi": "10.1145/3313831.3376493",
  "title": "Giving Voice to Silent Data: Designing with Personal Music Listening History",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2020,
  "badges": [],
  "abstract": "Music streaming services collect listener data to support personalization and discovery of their extensive catalogs. Yet this data is typically used in ways that are not immediately apparent to listeners. We conducted design workshops with ten Spotify listeners to imagine future voice assistant (VA) interactions leveraging logged music data. We provided participants with detailed personal music listening data, such as play-counts and temporal patterns, which grounded their design ideas in their current behaviors. In the interactions participants designed, VAs did not simply speak their data out loud; instead, participants envisioned how data could implicitly support introspection, behavior change, and exploration. We present reflections on how VAs could evolve from voice-activated remote controls to intelligent music coaches and how personal data can be leveraged as a design resource.",
  "tags": [
    "participatory design",
    "speculative design",
    "personal informatics",
    "co-design",
    "voice assistants",
    "music"
  ],
  "authors": [
    {
      "name": "Jordan Wirfs-Brock",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365564",
      "orcid": "missing"
    },
    {
      "name": "Sarah Mennicken",
      "institution": "Spotify, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655382",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Thom",
      "institution": "Spotify, Boston, MA, USA",
      "img": "/do/10.1145/contrib-81100334243/rel-imgonly/jenn_badge__2_.jpeg",
      "acmid": "81100334243",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y. Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 3 (2019), 17.",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 28.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti and Keith Edwards. 2001. Intelligibility and accountability: human considerations in context-aware systems. Human--Computer Interaction 16, 2--4 (2001), 193--212.",
      "doi": "10.1207/S15327051HCI16234_05"
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottrjdge. 2018. Understanding the long-term use of smart speaker assistants. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 91.",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1999. Contextual design. interactions 6, 1 (1999), 32--42.",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Ava Mutchler Bret Kinsella. 2019. Smart Speaker Consumer Adoption Report. Technical Report.",
      "doi": ""
    },
    {
      "text": "Praveen Chandar, Jean Garcia-Gathright, Christine Hosey, Brian St. Thomas, and Jennifer Thom. 2019. Developing Evaluation Metrics for Instant Search Using Mixed Methods Methods. In Proceedings of the 42Nd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR'19). ACM, NY, NY, USA, 925--928. DOI: http://dx.doi.org/10.1145/3331184.3331293",
      "doi": "10.1145/3331184.3331293"
    },
    {
      "text": "Amy Yo Sue Chen, William Odom, Ce Zhong, Henry Lin, and Tal Amram. 2019. Chronoscope: Designing Temporally Diverse Interactions with Personal Digital Photo Collections. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 799--812.",
      "doi": "10.1145/3322276.3322301"
    },
    {
      "text": "EunJeong Cheon, Stephen Tsung-Han Sher, Selma Sabanovi´ c, and Norman Makoto Su. 2019. I Beg to Differ: Soft Conflicts in Collaborative Design Using Design Fictions. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 201--214.",
      "doi": "10.1145/3322276.3322350"
    },
    {
      "text": "EunJeong Cheon and Norman Makoto Su. 2018. Futuristic autobiographies: Weaving participant narratives to elicit values around robots. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 388--397.",
      "doi": "10.1145/3171221.3171244"
    },
    {
      "text": "NPR Edison Research. 2019. The Smart Audio Report. Technical Report. Somerville, NJ.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines. 2016. Metadating: exploring the romance and future of personal data. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 685--698.",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Daniel A Epstein, An Ping, James Fogarty, and Sean A Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 731--742.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Daniel Fitton, Janet C Read, Gavin Sim, and Brendan Cassidy. 2018. Co-designing voice user interfaces with teenagers in the context of smart homes. In Proceedings of the 17th ACM Conference on Interaction Design and Children. ACM, 55--66.",
      "doi": "10.1145/3202185.3202744"
    },
    {
      "text": "Anushay Furqan, Chelsea Myers, and Jichen Zhu. 2017. Learnability through adaptive discovery tools in voice user interfaces. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1617--1623.",
      "doi": "10.1145/3027063.3053166"
    },
    {
      "text": "Rebecca Gulotta, Alex Sciuto, Aisling Kelliher, and Jodi Forlizzi. 2015. Curatorial Agents: How Systems Shape Our Understanding of Personal and Familial Digital Information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3453--3462. DOI: http://dx.doi.org/10.1145/2702123.2702297",
      "doi": "10.1145/2702123.2702297"
    },
    {
      "text": "David Hargreaves, Dorothy Miell, and Raymond Macdonald. 2002. What are musical identities, and why are they important. Musical Identities (01 2002).",
      "doi": ""
    },
    {
      "text": "David J. Hargreaves and Adrian C. North. 1999. The Functions of Music in Everyday Life: Redefining the Social in Music Psychology. Psychology of Music 27, 1 (1999), 71--83. DOI: http://dx.doi.org/10.1177/0305735699271007",
      "doi": ""
    },
    {
      "text": "Thomas Hermann, Andy Hunt, and John G Neuhoff. 2011. The sonification handbook. Logos Verlag Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Lars Erik Holmquist. 2004. User-driven innovation in the future applications lab. In CHI'04 Extended Abstracts on Human Factors in Computing Systems. ACM, 1091--1092.",
      "doi": "10.1145/985921.985995"
    },
    {
      "text": "Christine Hosey, Lara Vujovi´ c, Brian St. Thomas, Jean Garcia-Gathright, and Jennifer Thom. 2019. Just Give Me What I Want: How People Use and Evaluate Music Search. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 299, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300529",
      "doi": "10.1145/3290605.3300529"
    },
    {
      "text": "Samuel Huron, Sheelagh Carpendale, Alice Thudt, Anthony Tang, and Michael Mauerer. 2014. Constructive visualization. In Proceedings of the 2014 conference on Designing interactive systems. ACM, 433--442.",
      "doi": "10.1145/2598510.2598566"
    },
    {
      "text": "Nam Wook Kim, Hyejin Im, Nathalie Henry Riche, Alicia Wang, Krzysztof Gajos, and Hanspeter Pfister. 2019. DataSelfie: Empowering People to Design Personalized Visuals to Represent Their Data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 79.",
      "doi": "10.1145/3290605.3300309"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 557--566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286--5297.",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Giorgia Lupi and Stefanie Posavec. 2016. Dear data. Chronicle Books.",
      "doi": ""
    },
    {
      "text": "Ben Lyall and Brady Robards. 2018. Tool, toy and tutor: Subjective experiences of digital self-tracking. Journal of Sociology 54, 1 (2018), 108--124.",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M Huang. 2014. From today's augmented houses to tomorrow's smart homes: new directions for home automation research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 105--115.",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Oussama Metatla, Alison Oldfield, Taimur Ahmed, Antonis Vafeas, and Sunny Miglani. 2019. Voice User Interfaces in Schools: Co-designing for Inclusion With Visually-Impaired and Sighted Pupils. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 378.",
      "doi": "10.1145/3290605.3300608"
    },
    {
      "text": "Bonnie M Muir. 1994. Trust in automation: Part I. Theoretical issues in the study of trust and human intervention in automated systems. Ergonomics 37, 11 (1994), 1905--1922.",
      "doi": ""
    },
    {
      "text": "Michael J Muller. 2007. Participatory design: the third space in HCI. In The human-computer interaction handbook. CRC press, 1087--1108.",
      "doi": ""
    },
    {
      "text": "Chelsea M. Myers, Anushay Furqan, and Jichen Zhu. 2019. The Impact of User Characteristics and Preferences on Performance with an Unfamiliar Voice User Interface. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 47, 9 pages. DOI: http://dx.doi.org/10.1145/3290605.3300277",
      "doi": "10.1145/3290605.3300277"
    },
    {
      "text": "Adrian C. North, David J. Hargreaves, and Jon J. Hargreaves. 2004. Uses of Music in Everyday Life. Music Perception: An Interdisciplinary Journal 22, 1 (2004), 41--77. DOI: http://dx.doi.org/10.1525/mp.2004.22.1.41",
      "doi": ""
    },
    {
      "text": "William Odom and Tijs Duel. 2018. On the Design of OLO Radio: Investigating Metadata As a Design Material. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 104, 9 pages. DOI: http://dx.doi.org/10.1145/3173574.3173678",
      "doi": "10.1145/3173574.3173678"
    },
    {
      "text": "William Odom, Ron Wakkary, Jeroen Hol, Bram Naus, Pepijn Verburg, Tal Amram, and Amy Yo Sue Chen. 2019. Investigating Slowness As a Frame to Design Longer-Term Experiences with Personal Data: A Field Study of Olly. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 34, 16 pages. DOI: http://dx.doi.org/10.1145/3290605.3300264",
      "doi": "10.1145/3290605.3300264"
    },
    {
      "text": "Sabine Payr. 2013. Virtual butlers and real people: styles and practices in long-term use of a companion. In Your Virtual Butler. Springer, 134--178.",
      "doi": ""
    },
    {
      "text": "Toni Robertson and Jesper Simonsen. 2012. Challenges and opportunities in contemporary participatory design. Design Issues 28, 3 (2012), 3--9.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1163--1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility. ACM, 49--58.",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Katie Shilton. 2012. Participatory personal data: An emerging research challenge for the information sciences. Journal of the American Society for Information Science and Technology 63, 10 (2012), 1905--1915.",
      "doi": "10.1002/asi.22655"
    },
    {
      "text": "Yolande A.A. Strengers. 2011. Designing Eco-feedback Systems for Everyday Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2135--2144. DOI: http://dx.doi.org/10.1145/1978942.1979252",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Yorick Wilks. 2004. Artificial companions. In International Workshop on Machine Learning for Multimodal Interaction. Springer, 36--45.",
      "doi": ""
    },
    {
      "text": "Tiffany Wun, Lora Oehlberg, Miriam Sturdee, and Sheelagh Carpendale. 2019. You say Potato, I say Po-Data: Physical Template Tools for Authoring Visualizations. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 297--306.",
      "doi": "10.1145/3294109.3295627"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2014. Research Through Design in HCI. In Ways of Knowing in HCI, Judith .S. Olson and Wendy.A. Kellogg (Eds.). Springer, New York, NY, 167--190.",
      "doi": ""
    }
  ]
}