{
  "doi": "10.1145/3313831.3376324",
  "title": "Predicting and Diagnosing User Engagement with Mobile UI Animation via a Data-Driven Approach",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Animation, a common design element in user interfaces (UI), can impact user engagement (UE) with mobile applications. To avoid impairing UE due to improper design of animation, designers rely on resource-intensive evaluation methods like user studies or expert reviews. To alleviate this burden, we propose a data-driven approach to assisting designers in examining UE issues with their animation designs. We first crowdsource UE assessments of mobile UI animations. Based on the collected data, we then build a novel deep learning model that captures both spatial and temporal features of animations to predict their UE levels. Evaluations show that our model achieves a reasonable accuracy. We further leverage the animation feature encoded by our model and a sample set of expert reviews to derive potential UE issues of a particular animation. Finally, we develop a proof-of-concept tool and evaluate its potential usage in actual design practices with experts",
  "tags": [
    "data-driven approach",
    "mobile ui animation",
    "user engagement"
  ],
  "authors": [
    {
      "name": "Ziming Wu",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161463",
      "orcid": "missing"
    },
    {
      "name": "Yulun Jiang",
      "institution": "Wuhan University, Wuhan, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527121",
      "orcid": "missing"
    },
    {
      "name": "Yiding Liu",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528101",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "2016. UX animation: When to use it, when to lose it. https://techbeacon.com/app-dev-testing/ ux-animation-when-use-it-when-lose-it. (Febuary 2016).",
      "doi": ""
    },
    {
      "text": "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. Neural machine translation by jointly learning to align and translate. arXiv preprint arXiv:1409.0473 (2014).",
      "doi": ""
    },
    {
      "text": "Saeideh Bakhshi, David A. Shamma, and Eric Gilbert. 2014. Faces Engage Us: Photos with Faces Attract More Likes and Comments on Instagram. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 965--974. DOI: http://dx.doi.org/10.1145/2556288.2557403",
      "doi": "10.1145/2556288.2557403"
    },
    {
      "text": "Nikola Banovic, Antti Oulasvirta, and Per Ola Kristensson. 2019. Computational Modeling in Human-Computer Interaction. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, W26.",
      "doi": ""
    },
    {
      "text": "John J Bartko. 1966. The intraclass correlation coefficient as a measure of reliability. Psychological reports 19, 1 (1966), 3--11.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Jonathan Carlton, Andy Brown, Caroline Jay, and John Keane. 2019. Inferring User Engagement from Interaction Data. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article LBW1212, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3313009",
      "doi": "10.1145/3290607.3313009"
    },
    {
      "text": "Bay-Wei Chang and David Ungar. 1995. Animation: from cartoons to the user interface. (1995).",
      "doi": ""
    },
    {
      "text": "Aline Chevalier and Melody Y Ivory. 2003. Web site designs: Influences of designer's expertise and design constraints. International Journal of Human-Computer Studies 58, 1 (2003), 57--87.",
      "doi": "10.1016/S1071-5819%2802%2900126-X"
    },
    {
      "text": "Fanny Chevalier, Nathalie Henry Riche, Catherine Plaisant, Amira Chalbi, and Christophe Hurter. 2016. Animations 25 years later: New roles and opportunities. In Proceedings of the International Working Conference on Advanced Visual Interfaces. ACM, 280--287.",
      "doi": "10.1145/2909132.2909255"
    },
    {
      "text": "Domenic V Cicchetti. 1994. Guidelines, criteria, and rules of thumb for evaluating normed and standardized assessment instruments in psychology. Psychological assessment 6, 4 (1994), 284.",
      "doi": ""
    },
    {
      "text": "Rene V Dawis. 1987. Scale construction. Journal of Counseling Psychology 34, 4 (1987), 481.",
      "doi": ""
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 845--854. DOI: http://dx.doi.org/10.1145/3126594.3126651",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Cyril Goutte and Eric Gaussier. 2005. A probabilistic interpretation of precision, recall and F-score, with implication for evaluation. In European Conference on Information Retrieval. Springer, 345--359.",
      "doi": "10.1007/978-3-540-31865-1_25"
    },
    {
      "text": "Alex Graves, Abdel-rahman Mohamed, and Geoffrey Hinton. 2013. Speech recognition with deep recurrent neural networks. In 2013 IEEE international conference on acoustics, speech and signal processing. IEEE, 6645--6649.",
      "doi": ""
    },
    {
      "text": "David Gunning. 2017. Explainable artificial intelligence (xai). Defense Advanced Research Projects Agency (DARPA), nd Web (2017).",
      "doi": ""
    },
    {
      "text": "Bo Han, Quanming Yao, Xingrui Yu, Gang Niu, Miao Xu, Weihua Hu, Ivor Tsang, and Masashi Sugiyama. 2018. Co-teaching: Robust training of deep neural networks with extremely noisy labels. In Advances in neural information processing systems. 8527--8537.",
      "doi": ""
    },
    {
      "text": "Jan Hartmann, Alistair Sutcliffe, and Antonella De Angeli. 2008. Towards a Theory of User Judgment of Aesthetics and User Interface Quality. ACM Trans. Comput.-Hum. Interact. 15, 4, Article 15 (Dec. 2008), 30 pages. DOI: http://dx.doi.org/10.1145/1460355.1460357",
      "doi": "10.1145/1460355.1460357"
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 770--778.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and George Robertson. 2007. Animated transitions in statistical data graphics. IEEE transactions on visualization and computer graphics 13, 6 (2007), 1240--1247.",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Elad Hoffer and Nir Ailon. 2015. Deep metric learning using triplet network. In International Workshop on Similarity-Based Pattern Recognition. Springer, 84--92.",
      "doi": ""
    },
    {
      "text": "Weiyin Hong, James YL Thong, and Kar Yan Tam. 2007. How do Web users respond to non-banner-ads animation? The effects of task type and user experience. Journal of the American Society for Information Science and Technology 58, 10 (2007), 1467--1482.",
      "doi": "10.5555/1285300.1285310"
    },
    {
      "text": "Matt C Howard. 2016. A review of exploratory factor analysis decisions and overview of current practices: What we are doing and how can we improve? International Journal of Human-Computer Interaction 32, 1 (2016), 51--62.",
      "doi": ""
    },
    {
      "text": "Jussi Huhtala, Ari-Heikki Sarjanoja, Jani Mäntyjärvi, Minna Isomursu, and Jonna Häkkilä. 2010. Animated UI Transitions and Perception of Time: A User Study on Animated Effects on a Mobile Screen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1339--1342. DOI: http://dx.doi.org/10.1145/1753326.1753527",
      "doi": "10.1145/1753326.1753527"
    },
    {
      "text": "Kevin Keeker. 1997. Improving web site usability and appeal. Retrieved May 19 (1997), 2002.",
      "doi": ""
    },
    {
      "text": "Young Hoon Kim, Dan J Kim, and Kathy Wachter. 2013. A study of mobile user engagement (MoEN): Engagement motivations, perceived value, satisfaction, and continued engagement intention. Decision Support Systems 56 (2013), 361--370.",
      "doi": "10.1016/j.dss.2013.07.002"
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014).",
      "doi": ""
    },
    {
      "text": "Jonas F Kraft and Jörn Hurtienne. 2017. Transition animations support orientation in mobile interfaces without increased user effort. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 17.",
      "doi": "10.1145/3098279.3098566"
    },
    {
      "text": "Alex Krizhevsky, Ilya Sutskever, and Geoffrey E. Hinton. 2017. ImageNet Classification with Deep Convolutional Neural Networks. Commun. ACM 60, 6 (May 2017), 84--90. DOI: http://dx.doi.org/10.1145/3065386",
      "doi": "10.1145/3065386"
    },
    {
      "text": "Brenda Laurel and S Joy Mountford. 1990. The art of human-computer interface design. Addison-Wesley Longman Publishing Co., Inc.",
      "doi": "10.5555/575201"
    },
    {
      "text": "Yang Li, Samy Bengio, and Gilles Bailly. 2018. Predicting human performance in vertical menu selection using deep learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 29.",
      "doi": "10.1145/3173574.3173603"
    },
    {
      "text": "Daniel Liddle. 2016a. Emerging Guidelines for Communicating with Animation in Mobile User Interfaces. In Proceedings of the 34th ACM International Conference on the Design of Communication (SIGDOC '16). ACM, NY, NY, USA, Article 16, 9 pages. DOI: http://dx.doi.org/10.1145/2987592.2987614",
      "doi": "10.1145/2987592.2987614"
    },
    {
      "text": "Daniel Liddle. 2016b. Emerging guidelines for communicating with animation in mobile user interfaces. In Proceedings of the 34th ACM International Conference on the Design of Communication. ACM, 16.",
      "doi": "10.1145/2987592.2987614"
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of machine learning research 9, Nov (2008), 2579--2605.",
      "doi": ""
    },
    {
      "text": "Aliaksei Miniukovich and Antonella De Angeli. 2015. Computation of Interface Aesthetics. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1163--1172. DOI: http://dx.doi.org/10.1145/2702123.2702575",
      "doi": "10.1145/2702123.2702575"
    },
    {
      "text": "David Novick, Joseph Rhodes, and Wervyn Wert. 2011. The communicative functions of animation in user interfaces. In Proceedings of the 29th ACM international conference on Design of communication. ACM, 1--8.",
      "doi": "10.1145/2038476.2038478"
    },
    {
      "text": "Heather L O'Brien. 2011. Exploring user engagement in online news interactions. Proceedings of the American society for information science and technology 48, 1 (2011), 1--10.",
      "doi": ""
    },
    {
      "text": "Heather L O'Brien, Paul Cairns, and Mark Hall. 2018. A practical approach to measuring user engagement with the refined user engagement scale (UES) and new UES short form. International Journal of Human-Computer Studies 112 (2018), 28--39.",
      "doi": ""
    },
    {
      "text": "Jeeyun Oh and S Shyam Sundar. 2016. User engagement with interactive media: A communication perspective. In Why Engagement Matters. Springer, 177--198.",
      "doi": ""
    },
    {
      "text": "Adam Paszke, Sam Gross, Soumith Chintala, Gregory Chanan, Edward Yang, Zachary DeVito, Zeming Lin, Alban Desmaison, Luca Antiga, and Adam Lerer. 2017. Automatic differentiation in PyTorch. (2017).",
      "doi": ""
    },
    {
      "text": "Scott Reed, Honglak Lee, Dragomir Anguelov, Christian Szegedy, Dumitru Erhan, and Andrew Rabinovich. 2014. Training deep neural networks on noisy labels with bootstrapping. arXiv preprint arXiv:1412.6596 (2014).",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences Around the World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 11--20. DOI: http://dx.doi.org/10.1145/2556288.2557052",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "George G Robertson, Stuart K Card, and Jock D Mackinlay. 1993. Information visualization using 3D interactive animation. Commun. ACM 36, 4 (1993), 56--72.",
      "doi": "10.1145/255950.153577"
    },
    {
      "text": "Ruth Rosenholtz, Amal Dorai, and Rosalind Freeman. 2011. Do predictions of visual perception aid design? ACM Transactions on Applied Perception (TAP) 8, 2 (2011), 12.",
      "doi": ""
    },
    {
      "text": "Holly M Rus and Linda D Cameron. 2016. Health communication in social media: message features predicting user engagement on diabetes-related Facebook pages. Annals of behavioral medicine 50, 5 (2016), 678--689.",
      "doi": ""
    },
    {
      "text": "Céline Schlienger, Stéphane Conversy, Stéphane Chatty, Magali Anquetil, and Christophe Mertz. 2007. Improving users' comprehension of changes with animation and sound: An empirical assessment. In IFIP Conference on Human-Computer Interaction. Springer, 207--220.",
      "doi": ""
    },
    {
      "text": "Karen Simonyan and Andrew Zisserman. 2014. Two-stream convolutional networks for action recognition in videos. In Advances in neural information processing systems. 568--576.",
      "doi": ""
    },
    {
      "text": "Amanda Swearngin and Yang Li. 2019. Modeling Mobile Interface Tappability Using Crowdsourcing and Deep Learning. arXiv preprint arXiv:1902.11247 (2019).",
      "doi": ""
    },
    {
      "text": "Bruce H Thomas and Paul Calder. 2001. Applying cartoon animation techniques to graphical user interfaces. ACM Transactions on Computer-Human Interaction (TOCHI) 8, 3 (2001), 198--222.",
      "doi": "10.1145/502907.502909"
    },
    {
      "text": "Noam Tractinsky, Ohad Inbar, Omer Tsimhoni, and Thomas Seder. 2011. Slow Down, You Move Too Fast: Examining Animation Aesthetics to Promote Eco-driving. In Proceedings of the 3rd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '11). ACM, NY, NY, USA, 193--202. DOI: http://dx.doi.org/10.1145/2381416.2381447",
      "doi": "10.1145/2381416.2381447"
    },
    {
      "text": "Marcus Trapp and René Yasmin. 2013. Addressing animated transitions already in mobile app storyboards. In International Conference of Design, User Experience, and Usability. Springer, 723--732.",
      "doi": "10.1007/978-3-642-39253-5_81"
    },
    {
      "text": "Barbara Tversky, Julie Bauer Morrison, and Mireille Betrancourt. 2002. Animation: can it facilitate? International journal of human-computer studies 57, 4 (2002), 247--262.",
      "doi": ""
    },
    {
      "text": "Limin Wang, Yuanjun Xiong, Zhe Wang, Yu Qiao, Dahua Lin, Xiaoou Tang, and Luc Van Gool. 2016. Temporal segment networks: Towards good practices for deep action recognition. In European conference on computer vision. Springer, 20--36.",
      "doi": ""
    },
    {
      "text": "Jane Webster and Hayes Ho. 1997. Audience engagement in multimedia presentations. ACM SIGMIS Database: the DATABASE for Advances in Information Systems 28, 2 (1997), 63--77.",
      "doi": "10.1145/264701.264706"
    },
    {
      "text": "Ziming Wu, Taewook Kim, Quan Li, and Xiaojuan Ma. 2019. Understanding and Modeling User-Perceived Brand Personality from Mobile Application UIs. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 213, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300443",
      "doi": "10.1145/3290605.3300443"
    },
    {
      "text": "Anbang Xu, Shih-Wen Huang, and Brian Bailey. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-experts. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1433--1444. DOI: http://dx.doi.org/10.1145/2531602.2531604",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Xiaojin Zhu, Zoubin Ghahramani, and John D Lafferty. 2003. Semi-supervised learning using gaussian fields and harmonic functions. In Proceedings of the 20th International conference on Machine learning (ICML-03). 912--919.",
      "doi": "10.5555/3041838.3041953"
    }
  ]
}