{
  "doi": "10.1145/3313831.3376347",
  "title": "Sensor Illumination: Exploring Design Qualities and Ethical Implications of Smart Cameras and Image/Video Analytics",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2020,
  "badges": [],
  "abstract": "Drawing analogies between smart cameras and electric lighting, we highlight and extrapolate design trends towards always-on sensing in intimate contexts, and the functional expansion of smart cameras as general-purpose and multi-functional devices. Employing a research through design (RtD) approach, we extrapolate these trends using speculative scenarios, materialize the scenarios by designing and constructing lighting-inspired smart camera fixtures, and self-experiment with these fixtures to introduce and exacerbate privacy and security issues, and inspire creative workarounds and design opportunities for sensor-level regulation. We synthesize our insights by presenting 8 smart camera sensing design qualities for addressing privacy, security, and related social and ethical issues.",
  "authors": [
    {
      "name": "James Pierce",
      "institution": "University of California, Berkeley & California College of the Arts, Berkeley & San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    },
    {
      "name": "Richmond Y. Wong",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99658688813/rel-imgonly/glasses_profile_pic_square.jpg",
      "acmid": "99658688813",
      "orcid": "0000-0001-8613-0380"
    },
    {
      "name": "Nick Merrill",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659085848/rel-imgonly/headshot.jpg",
      "acmid": "99659085848",
      "orcid": "0000-0003-3669-1387"
    }
  ],
  "references": [
    {
      "text": "Aipperspach, Ryan, Ben Hooker, and Allison Woodruff. \"The Heterogeneous Home.\" In Proceedings of the 10th International Conference on Ubiquitous Computing, 222--231. UbiComp '08. New York, NY, USA: ACM, 2008. https://doi.org/10.1145/1409635.1409666.",
      "doi": ""
    },
    {
      "text": "Ammari, Tawfiq, Jofish Kaye, Janice Y. Tsai, and Frank Bentley. \"Music, Search, and IoT: How People (Really) Use Voice Assistants.\" ACM Transactions on Computer-Human Interaction (TOCHI) 26, no. 3 (2019): 17.",
      "doi": ""
    },
    {
      "text": "Arvola, Mattias. \"Interaction Design Qualities: Theory and Practice.\" In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, 595--598. ACM, 2010.",
      "doi": ""
    },
    {
      "text": "Amazon. \"International Centre for Missing & Exploited Children Case Study.\" Amazon Web Services, Inc. Accessed September 11, 2019. https://aws.amazon.com/solutions/case-studies/icmec/.",
      "doi": ""
    },
    {
      "text": "Amazon. \"Amazon Rekognition Improves Face Analysis.\" Amazon Web Services, Inc. Accessed September 11, 2019. https://aws.amazon.com/about-aws/whats-new/2019/08/amazon-rekognition-improves-face-analysis/.",
      "doi": ""
    },
    {
      "text": "Andrea, I., Chrysostomou, C., Hadjichristofi, G., 2015. Internet of Things: Security vulnerabilities and challenges, in: Computers and Communication (ISCC), 2015 IEEE Symposium On. IEEE, pp. 180--187.",
      "doi": ""
    },
    {
      "text": "Barati, Bahareh, Elisa Giaccardi, and Elvin Karana. \"The Making of Performativity in Designing [with] Smart Material Composites.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 5. ACM, 2018",
      "doi": ""
    },
    {
      "text": "Bardzell, Shaowen, Daniela K. Rosner, and Jeffrey Bardzell. \"Crafting Quality in Design: Integrity, Creativity, and Public Sensibility.\" In Proceedings of the Designing Interactive Systems Conference, 11--20. ACM, 2012.",
      "doi": ""
    },
    {
      "text": "Baumer, Eric P.S. \"Usees.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3295--3298. CHI '15. New York, NY, USA: ACM, 2015. https://doi.org/10.1145/2702123.2702147.",
      "doi": ""
    },
    {
      "text": "Bell, Genevieve, Mark Blythe, and Phoebe Sengers. \"Making by Making Strange: Defamiliarization and the Design of Domestic Technologies.\" ACM Trans. Comput.-Hum. Interact. 12, no. 2 (June 2005): 149--173. https://doi.org/10.1145/1067860.1067862.",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Bellini, Rosanna, Angelika Strohmayer, Patrick Olivier, and Clara Crivellaro. \"Mapping the Margins: Navigating the Ecologies of Domestic Violence Service Provision.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 122:1--122:13. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300352.",
      "doi": ""
    },
    {
      "text": "Biddle, Sam. \"For Owners of Amazon's Ring Security Cameras, Strangers May Have Been Watching Too.\" The Intercept (blog), January 10, 2019. https://theintercept.com/2019/01/10/amazon-ring-security-camera/.",
      "doi": ""
    },
    {
      "text": "Birks, Melanie, Ysanne Chapman, and Karen Francis. \"Memoing in Qualitative Research: Probing Data and Processes.\" Journal of Research in Nursing 13, no. 1 (January 1, 2008): 68--75. https://doi.org/10.1177/1744987107081254.",
      "doi": ""
    },
    {
      "text": "Brayne, Sarah, Karen Levy, and Bryce Clayton Newell. \"Visual Data and the Law.\" Law & Social Inquiry 43, no. 4 (2018): 1149--1163.",
      "doi": ""
    },
    {
      "text": "Berger, Arne, Aloha Hufana Ambe, Alessandro Soro, Dries De Roeck, and Margot Brereton. \"The Stories People Tell About The Home Through IoT Toolkits.\" In Proceedings of the 2019 on Designing Interactive Systems Conference, 7--19. DIS '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3322276.3322308.",
      "doi": ""
    },
    {
      "text": "Berger, Arne, William Odom, Michael Storz, Andreas Bischof, Albrecht Kurze, and Eva Hornecker. \"The Inflatable Cat: Idiosyncratic Ideation of Smart Objects for the Home.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 401:1--401:12. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300631.",
      "doi": ""
    },
    {
      "text": "Blythe, Mark, Enrique Encinas, Jofish Kaye, Miriam Lueck Avery, Rob McCabe, and Kristina Andersen. \"Imaginary Design Workbooks: Constructive Criticism and Practical Provocation.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 233:1--233:12. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3173807.",
      "doi": ""
    },
    {
      "text": "Boucher, Andy, Dean Brown, Bill Gaver, Naho Matsuda, Liliana Ovalle, Andy Sheen, and Michail Vanis. \"ProbeTools: Unconventional Cameras and Audio Devices for User Research.\" Interactions 26, no. 2 (February 2019): 26--35. https://doi.org/10.1145/3305358.",
      "doi": "10.1145/3305358"
    },
    {
      "text": "Boucher, Andy, Dean Brown, Liliana Ovalle, Andy Sheen, Mike Vanis, William Odom, Doenja Oogjes, and William Gaver. \"TaskCam: Designing and Testing an Open Tool for Cultural Probes Studies.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 71:1--71:12. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3173645.",
      "doi": ""
    },
    {
      "text": "Boucher, Andy, David Cameron, and Nadine Jarvis. \"Power to the People: Dynamic Energy Management Through Communal Cooperation.\" In Proceedings of the Designing Interactive Systems Conference, 612--620. DIS '12. New York, NY, USA: ACM, 2012. https://doi.org/10.1145/2317956.2318048.",
      "doi": ""
    },
    {
      "text": "Bowles, Nellie. \"Thermostats, Locks and Lights: Digital Tools of Domestic Abuse - The New York Times.\" New York Times. 2018. Accessed September 15, 2019. https://www.nytimes.com/2018/06/23/technology/smart-home-devices-domestic-abuse.html.",
      "doi": ""
    },
    {
      "text": "Biddle, Sam. \"Troubling Study Says Artificial Intelligence Can Predict Who Will Be Criminals Based on Facial Features.\" The Intercept (blog), November 18, 2016. https://theintercept.com/2016/11/18/troubling-study-says-artificial-intelligence-can-predict-who-will-be-criminals-based-on-facial-features/.",
      "doi": ""
    },
    {
      "text": "Browne, Simone. Dark Matters: On the Surveillance of Blackness. Duke University Press, 2015.",
      "doi": ""
    },
    {
      "text": "Burt, Chris. \"Amazon Provides Facial Recognition for New Platform to Locate Missing Children.\" Biometric Update, November 28, 2018. https://www.biometricupdate.com/201811/amazon-provides-facial-recognition-for-new-platform-to-locate-missing-children.",
      "doi": ""
    },
    {
      "text": "Busso, Carlos, Zhigang Deng, Serdar Yildirim, Murtaza Bulut, Chul Min Lee, Abe Kazemzadeh, Sungbok Lee, Ulrich Neumann, and Shrikanth Narayanan. \"Analysis of Emotion Recognition Using Facial Expressions, Speech and Multimodal Information.\" In Proceedings of the 6th International Conference on Multimodal Interfaces, 205--211. ICMI '04. New York, NY, USA: ACM, 2004. https://doi.org/10.1145/1027933.1027968.",
      "doi": ""
    },
    {
      "text": "Canada, Office of the Privacy Commissioner of. \"The Internet of Things - An Introduction to Privacy Issues with a Focus on the Retail and Home Environments,\" February 17, 2016. https://www.priv.gc.ca/en/opc-actions-and-decisions/research/explore-privacy-research/2016/iot_201602/.",
      "doi": ""
    },
    {
      "text": "Cheng, Yu-Ting, Mathias Funk, Wenn-Chieh Tsai, and Lin-Lin Chen. \"Peekaboo Cam: Designing an Observational Camera for Home Ecologies Concerning Privacy.\" In Proceedings of the 2019 on Designing Interactive Systems Conference, 823--836. DIS '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3322276.3323699.",
      "doi": ""
    },
    {
      "text": "Cheon, EunJeong. \"Alternative Vision of Living with IoT.\" In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion, 81--84. DIS '19 Companion. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3301019.3324881.",
      "doi": ""
    },
    {
      "text": "Chung, Hyunji, Michaela Iorga, Jeffrey Voas, and Sangjin Lee. \"Alexa, Can I Trust You?\" Computer 50, no. 9 (September 2017): 100--104. https://doi.org/10.1109/MC.2017.3571053.",
      "doi": "10.1109/MC.2017.3571053"
    },
    {
      "text": "Cila, Nazli, Iskander Smit, Elisa Giaccardi, and Ben Kröse. \"Products As Agents: Metaphors for Designing the Products of the IoT Age.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 448--459. CHI '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3025453.3025797.",
      "doi": ""
    },
    {
      "text": "Cisco, \"Cisco Visual Networking Index: Forecast and Trends, 2017--2022 White Paper.\" Cisco. Accessed September 16, 2019. https://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/white-paper-c11--741490.html.",
      "doi": ""
    },
    {
      "text": "Citron, Danielle. Hate Crimes in Cyberspace. Harvard University Press, 2016.",
      "doi": ""
    },
    {
      "text": "Carroll, John M., Robert L. Mack, and Wendy A. Kellogg. \"Chapter 3 - Interface Metaphors and User Interface Design.\" In Handbook of Human-Computer Interaction, edited by MARTIN Helander, 67--85. Amsterdam: North-Holland, 1988. https://doi.org/10.1016/B978-0--444--70536--5.50008--7.",
      "doi": ""
    },
    {
      "text": "Crabtree, Andy. \"Design in the Absence of Practice: Breaching Experiments.\" In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, 59--68. DIS '04. New York, NY, USA: ACM, 2004. https://doi.org/10.1145/1013115.1013125.",
      "doi": ""
    },
    {
      "text": "Chatting, David, David S. Kirk, Abigail C. Durrant, Chris Elsden, Paulina Yurman, and Jo-Anne Bichard. \"Making Ritual Machines: The Mobile Phone As a Networked Material for Research Products.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 435--447. CHI '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3025453.3025630.",
      "doi": ""
    },
    {
      "text": "Chesney, Robert, and Danielle Citron. \"Deep Fakes: A Looming Crisis for National Security, Democracy and Privacy? - Lawfare.\" Accessed September 16, 2019. https://www.lawfareblog.com/deep-fakes-looming-crisis-national-security-democracy-and-privacy.",
      "doi": ""
    },
    {
      "text": "Choe, Eun Kyoung, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, and Julie A. Kientz. \"Living in a Glass House: A Survey of Private Moments in the Home.\" In Proceedings of the 13th International Conference on Ubiquitous Computing, 41--44. UbiComp '11. New York, NY, USA: ACM, 2011. https://doi.org/10.1145/2030112.2030118.",
      "doi": ""
    },
    {
      "text": "Clifford, Stephanie, and Quentin Hardy. \"Attention, Shoppers: Store Is Tracking Your Cell - The New York Times.\" Accessed September 11, 2019. https://www.nytimes.com/2013/07/15/business/attention-shopper-stores-are-tracking-your-cell.html.",
      "doi": ""
    },
    {
      "text": "Devendorf, Laura, and Kimiko Ryokai. \"Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2477--2486. CHI '15. New York, NY, USA: ACM, 2015. https://doi.org/10.1145/2702123.2702547.",
      "doi": ""
    },
    {
      "text": "Desjardins, Audrey, Cayla Key, Heidi R. Biggs, and Kelsey Aschenbeck. \"Bespoke Booklets: A Method for Situated Co-Speculation.\" In Proceedings of the 2019 on Designing Interactive Systems Conference, 697--709. DIS '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3322276.3322311.",
      "doi": ""
    },
    {
      "text": "Desjardins, Audrey, Jeremy E. Viny, Cayla Key, and Nouela Johnston. \"Alternative Avenues for IoT: Designing with Non-Stereotypical Homes.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 351:1--351:13. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300581.",
      "doi": ""
    },
    {
      "text": "DiSalvo, Carl, and Tom Jenkins. \"Fruit Are Heavy: A Prototype Public IoT System to Support Urban Foraging.\" In Proceedings of the 2017 Conference on Designing Interactive Systems, 541--553. DIS '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3064663.3064748.",
      "doi": ""
    },
    {
      "text": "Desjardins, Audrey, and Aubree Ball. \"Revealing Tensions in Autobiographical Design in HCI.\" In Proceedings of the 2018 Designing Interactive Systems Conference, 753--764. DIS '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3196709.3196781.",
      "doi": ""
    },
    {
      "text": "Dourish, Paul, and Ken Anderson. \"Collective Information Practice: Exploring Privacy and Security as Social and Cultural Phenomena.\" Human-Computer Interaction 21, no. 3 (2006): 319--342.",
      "doi": "10.1207/s15327051hci2103_2"
    },
    {
      "text": "Elsden, Chris, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. \"On Speculative Enactments,\" 5386--99. ACM, 2017. https://doi.org/10.1145/3025453.3025503.",
      "doi": ""
    },
    {
      "text": "Emami-Naeini, Pardis, Henry Dixon, Yuvraj Agarwal, and Lorrie Faith Cranor. \"Exploring How Privacy and Security Factor into IoT Device Purchase Behavior.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 534:1--534:12. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300764.",
      "doi": ""
    },
    {
      "text": "European Commission. \"Internet of Things Privacy and Security Workshop's Report | Digital Single Market.\" Accessed September 15, 2019. https://ec.europa.eu/digital-single-market/en/news/internet-things-privacy-and-security-workshops-report.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission (FTC). \"Internet of Things: Privacy & Security in a Connected World.\" Washington, DC: Federal Trade Commission, 2015. https://www.ftc.gov/system/files/documents/reports/federal-trade-commission-staff-report-november-2013-workshop-entitled-internet-things-privacy/150127iotrpt.pdf",
      "doi": ""
    },
    {
      "text": "Fox, Sarah, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: Speculating Near-Future Menstrual Tracking through Current Data Practices. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS '19, 541--552. https://doi.org/10.1145/3322276.3323695",
      "doi": ""
    },
    {
      "text": "Fox, Sarah E., Rafael M.L. Silva, and Daniela K. Rosner. \"Beyond the Prototype: Maintenance, Collective Responsibility, and Public IoT.\" In Proceedings of the 2018 Designing Interactive Systems Conference, 21--32. DIS '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3196709.3196710.",
      "doi": ""
    },
    {
      "text": "Fox, Sarah E., Kiley Sobel, and Daniela K. Rosner. \"Managerial Visions: Stories of Upgrading and Maintaining the Public Restroom with IoT.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 493:1--493:15. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300723.",
      "doi": ""
    },
    {
      "text": "Fox-Brewster, Thomas. \"Amazon Is Now A \"Cheap Mass Surveillance' Dealer--It's Selling Facial Recognition To U.S. Cops.\" Forbes. Accessed September 11, 2019. https://www.forbes.com/sites/thomasbrewster/2018/05/22/amazon-now-sells-facial-recognition-to-american-police/.",
      "doi": ""
    },
    {
      "text": "Flanagan, Mary, and Helen Nissenbaum. Values at Play in Digital Games. MIT Press, 2014.",
      "doi": ""
    },
    {
      "text": "Freed, Diana, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. \"?A Stalker's Paradise': How Intimate Partner Abusers Exploit Technology.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 667:1--667:13. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3174241.",
      "doi": ""
    },
    {
      "text": "Friedman, Batya, and David G. Hendry. Value Sensitive Design: Shaping Technology with Moral Imagination. Mit Press, 2019.",
      "doi": ""
    },
    {
      "text": "Frik, Alisa, Leysan Nurgalieva, Julia Bernd, Joyce Lee, Florian Schaub, and Serge Egelman. \"Privacy and Security Threat Models and Mitigation Strategies of Older Adults,\" 2019. https://www.usenix.org/conference/soups2019/presentation/frik.",
      "doi": ""
    },
    {
      "text": "Fritsch, Ester, Irina Shklovski, and Rachel Douglas-Jones. \"Calling for a Revolution: An Analysis of IoT Manifestos.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 302:1--302:13. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3173876.",
      "doi": ""
    },
    {
      "text": "Froehlich, Jon, Leah Findlater, and James Landay. \"The Design of Eco-Feedback Technology.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1999--2008. CHI '10. New York, NY, USA: ACM, 2010. https://doi.org/10.1145/1753326.1753629.",
      "doi": ""
    },
    {
      "text": "Furr, Nathan, Jeffrey H. Dyer, and Kyle Nel. \"When Your Moon Shots Don't Take Off.\" Harvard Business Review, January 1, 2019. https://hbr.org/2019/01/when-your-moon-shots-dont-take-off.",
      "doi": ""
    },
    {
      "text": "Gavetti, Giovanni, Daniel A. Levinthal, and Jan W. Rivkin. \"Strategy Making in Novel and Complex Worlds: The Power of Analogy.\" Strategic Management Journal 26, no. 8 (2005): 691--712. https://doi.org/10.1002/smj.475.",
      "doi": ""
    },
    {
      "text": "Gaver, William, Andy Boucher, Michail Vanis, Andy Sheen, Dean Brown, Liliana Ovalle, Naho Matsuda, Amina Abbas-Nazari, and Robert Phillips. \"My Naturewatch Camera: Disseminating Practice Research with a Cheap and Easy DIY Design.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 302:1--302:13. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300532.",
      "doi": ""
    },
    {
      "text": "Gaver, William. \"What Should We Expect from Research through Design?\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 937--946. ACM, 2012.",
      "doi": ""
    },
    {
      "text": "Gaver, William, Andy Boucher, Michail Vanis, Andy Sheen, Dean Brown, Liliana Ovalle, Naho Matsuda, Amina Abbas-Nazari, and Robert Phillips. \"My Naturewatch Camera: Disseminating Practice Research with a Cheap and Easy DIY Design.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 302:1--302:13. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300532.",
      "doi": ""
    },
    {
      "text": "Gaver, William, John Bowers, Tobie Kerridge, Andy Boucher, and Nadine Jarvis. \"Anatomy of a Failure: How We Knew When Our Design Went Wrong, and What We Learned from It,\" 2213--22. ACM, 2009. https://doi.org/10.1145/1518701.1519040.",
      "doi": ""
    },
    {
      "text": "Gaver, William W. \"The Video Window: My Life with a Ludic System.\" Personal and Ubiquitous Computing 10, no. 2 (April 1, 2006): 60--65. https://doi.org/10.1007/s00779-005-0002--2.",
      "doi": ""
    },
    {
      "text": "Gaver, Bill, Tony Dunne, and Elena Pacenti. \"Design: Cultural Probes.\" Interactions 6, no. 1 (January 1999): 21--29. https://doi.org/10.1145/291224.291235.",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Gaver, Bill, and Heather Martin. \"Alternatives: Exploring Information Appliances Through Conceptual Design Proposals.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 209--216. CHI '00. New York, NY, USA: ACM, 2000. https://doi.org/10.1145/332040.332433.",
      "doi": ""
    },
    {
      "text": "Giaccardi, Elisa, Nazli Cila, Chris Speed, and Melissa Caldwell. \"Thing Ethnography: Doing Design Research with Non-Humans.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 377--387. ACM, 2016.",
      "doi": ""
    },
    {
      "text": "Goldenfein, Jake, Deirdre Mulligan, and Helen Nissenbaum. \"Through the Handoff Lens: Are Autonomous Vehicles No-Win for Users,\" 2019, 39.",
      "doi": ""
    },
    {
      "text": "Google Nest, \"Car. Pool. Mystery Solved.\" Accessed September 15, 2019. https://www.youtube.com/watch?v=PJOhZxFgfcI&feature=youtu.be.",
      "doi": ""
    },
    {
      "text": "Google Nest Cam Indoor, \"Nest Cam Indoor - Home Security Camera - Google Store.\" Accessed September 15, 2019. https://store.google.com/us/product/nest_cam?hl=en-US.",
      "doi": ""
    },
    {
      "text": "Grand View Research. \"Video Analytics Market Size Worth $9.4 Billion By 2025 | CAGR: 22.8%.\" Accessed September 16, 2019. https://www.grandviewresearch.com/press-release/global-video-analytics-market.",
      "doi": ""
    },
    {
      "text": "Gray, Colin M., Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L. Toombs. \"The Dark (Patterns) Side of UX Design.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 534:1--534:14. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3174108.",
      "doi": ""
    },
    {
      "text": "Greenberg, Saul, Sebastian Boring, Jo Vermeulen, and Jakub Dostal. \"Dark Patterns in Proxemic Interactions: A Critical Perspective.\" In Proceedings of the 2014 Conference on Designing Interactive Systems, 523--532. DIS '14. New York, NY, USA: ACM, 2014. https://doi.org/10.1145/2598510.2598541.",
      "doi": ""
    },
    {
      "text": "Gustaveson, Ron G. Webcam cover. United States USD708657S1, filed October 5, 2012, and issued July 8, 2014. https://patents.google.com/patent/USD708657S1/en.",
      "doi": ""
    },
    {
      "text": "Harrison, Steve R., and Paul Dourish. \"Re-Place-Ing Space: The Roles of Place and Space in Collaborative Systems.\" In CSCW, 96:67--76, 1996.",
      "doi": ""
    },
    {
      "text": "Harwell, Drew. \"Oregon Became a Testing Ground for Amazon's Facial-Recognition Policing. But What If Rekognition Gets It Wrong?\" Washington Post, April 30, 2019, sec. Technology. https://www.washingtonpost.com/technology/2019/04/30/amazons-facial-recognition-technology-is-supercharging-local-police/.",
      "doi": ""
    },
    {
      "text": "Harwell, Drew. \"Doorbell-Camera Firm Ring Has Partnered with 400 Police Forces, Extending Surveillance Concerns.\" Washington Post, August 28, 2019, sec. Technology. https://www.washingtonpost.com/technology/2019/08/28/doorbell-camera-firm-ring-has-partnered-with-police-forces-extending-surveillance-reach/.",
      "doi": ""
    },
    {
      "text": "Heres, C. J., Etemadieh, A., Baker, M., Nielsen, H., 2014. \"Hack All the Things: 20 Devices in 45 Minutes.\" Presentation in DEFCON, 2014. Accessed November, 12, 2018. https://www.youtube.com/watch?v=h5PRvBpLuJs",
      "doi": ""
    },
    {
      "text": "Hildebrandt, Mireille. Smart Technologies and the End (s) of Law: Novel Entanglements of Law and Technology. Edward Elgar Publishing, 2015.",
      "doi": ""
    },
    {
      "text": "Hildebrandt, Mireille, and Bert-Jaap Koops. \"The Challenges of Ambient Law and Legal Protection in the Profiling Era.\" The Modern Law Review 73, no. 3 (2010): 428--460.",
      "doi": ""
    },
    {
      "text": "Howell, Noura, John Chuang, Abigail De Kosnik, Greg Niemeyer, and Kimiko Ryokai. \"Emotional Biosensing: Exploring Critical Alternatives.\" Proc. ACM Hum.-Comput. Interact. 2, no. CSCW (November 2018): 69:1--69:25. https://doi.org/10.1145/3274338.",
      "doi": ""
    },
    {
      "text": "Hutchinson, Hilary, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, et al. \"Technology Probes: Inspiring Design for and with Families.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 17--24. CHI '03. New York, NY, USA: ACM, 2003. https://doi.org/10.1145/642611.642616.",
      "doi": ""
    },
    {
      "text": "Hu, Tung-Hui. A Prehistory of the Cloud. MIT Press, 2015.",
      "doi": ""
    },
    {
      "text": "Introna, Lucas D., and Helen Nissenbaum. \"Facial Recognition Technology: A Survey of Policy and Implementation Issues.\" SSRN Scholarly Paper. Rochester, NY: Social Science Research Network, July 22, 2009. https://papers.ssrn.com/abstract=1437730.",
      "doi": ""
    },
    {
      "text": "Isbister, Katherine, and Kristina Höök. \"On Being Supple: In Search of Rigor without Rigidity in Meeting New Design and Evaluation Challenges for HCI Practitioners.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2233--2242. ACM, 2009.",
      "doi": ""
    },
    {
      "text": "Ishii, Hiroshi, and Brygg Ullmer. \"Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms.\" In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, 234--241. CHI '97. New York, NY, USA: ACM, 1997. https://doi.org/10.1145/258549.258715.",
      "doi": ""
    },
    {
      "text": "Jenkins, Tom. \"Cohousing IoT: Design Prototyping for Community Life.\" In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction, 667--673. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Jing, Q., Vasilakos, A.V., Wan, J., Lu, J., Qiu, D., 2014. Security of the Internet of Things: perspectives and challenges. Wireless Networks 20, 2481--2501.",
      "doi": ""
    },
    {
      "text": "Kelley, Patrick Gage, Joanna Bresee, Lorrie Faith Cranor, and Robert W. Reeder. \"A Nutrition Label for Privacy.\" In Proceedings of the 5th Symposium on Usable Privacy and Security, 4. ACM, 2009.",
      "doi": ""
    },
    {
      "text": "Koskinen, Ilpo, John Zimmerman, Thomas Binder, Johan Redstrom, and Stephan Wensveen. Design Research through Practice: From the Lab, Field, and Showroom. Elsevier, 2011.",
      "doi": ""
    },
    {
      "text": "Kozubaev, Sandjar, Fernando Rochaix, Carl DiSalvo, and Christopher A. Le Dantec. \"Spaces and Traces: Implications of Smart Technology in Public Housing.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 439:1--439:13. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300669.",
      "doi": ""
    },
    {
      "text": "Knabb, K (ed and trans). Situationist International Anthology. 1981. ISBN 978-0--939682-04--1 https://libcom.org/files/Situationist%20International%20Anthology.pdf",
      "doi": ""
    },
    {
      "text": "Knobel, Cory, and Geoffrey C. Bowker. \"Values in Design.\" Commun. ACM 54, no. 7 (July 2011): 26--28. https://doi.org/10.1145/1965724.1965735.",
      "doi": "10.1145/1965724.1965735"
    },
    {
      "text": "Knowles, Bran, Sophie Beck, Joe Finney, James Devine, and Joseph Lindley. \"A Scenario-Based Methodology for Exploring Risks: Children and Programmable IoT.\" In Proceedings of the 2019 on Designing Interactive Systems Conference, 751--761. DIS '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3322276.3322315.",
      "doi": ""
    },
    {
      "text": "Kroll, Joshua A., Solon Barocas, Edward W. Felten, Joel R. Reidenberg, David G. Robinson, and Harlan Yu. \"Accountable Algorithms.\" U. Pa. L. Rev. 165 (2016): 633.",
      "doi": ""
    },
    {
      "text": "Kuijer, Lenneke, Annelise de Jong, and Daan van Eijk. \"Practices As a Unit of Design: An Exploration of Theoretical Guidelines in a Study on Bathing.\" ACM Trans. Comput.-Hum. Interact. 20, no. 4 (September 2013): 21:1--21:22. https://doi.org/10.1145/2493382.",
      "doi": ""
    },
    {
      "text": "Lau, Josephine, Benjamin Zimmerman, and Florian Schaub. \"Alexa, Are You Listening?: Privacy Perceptions, Concerns and Privacy-Seeking Behaviors with Smart Speakers.\" Proc. ACM Hum.-Comput. Interact. 2, no. CSCW (November 2018): 102:1--102:31. https://doi.org/10.1145/3274371.",
      "doi": ""
    },
    {
      "text": "Leahu, Lucian, and Phoebe Sengers. \"Freaky: Performing Hybrid Human-Machine Emotion.\" In Proceedings of the 2014 Conference on Designing Interactive Systems, 607--616. DIS '14. New York, NY, USA: ACM, 2014. https://doi.org/10.1145/2598510.2600879.",
      "doi": ""
    },
    {
      "text": "Le Dantec, Christopher A., Erika Shehan Poole, and Susan P. Wyche. \"Values as Lived Experience: Evolving Value Sensitive Design in Support of Value Discovery.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1141--1150. ACM, 2009.",
      "doi": ""
    },
    {
      "text": "Lim, Youn-kyung, Sang-Su Lee, and Da-jung Kim. \"Interactivity Attributes for Expression-Oriented Interaction Design.\" International Journal of Design 5, no. 3, 2011.",
      "doi": ""
    },
    {
      "text": "Lockton, Dan, Devika Singh, Saloni Sabnis, Michelle Chou, Sarah Foley, and Alejandro Pantoja. \"New Metaphors: A Workshop Method for Generating Ideas and Reframing Problems in Design and Beyond.\" In Proceedings of the 2019 on Creativity and Cognition, 319--332. C&C '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3325480.3326570.",
      "doi": ""
    },
    {
      "text": "Logler, Nick, Daisy Yoo, and Batya Friedman. \"Metaphor Cards: A How-to-Guide for Making and Using a Generative Metaphorical Design Toolkit.\" In Proceedings of the 2018 Designing Interactive Systems Conference, 1373--1386. DIS '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3196709.3196811.",
      "doi": ""
    },
    {
      "text": "Löwgren, Jonas and Erik Stolterman. Thoughtful Interaction Design: A Design Perspective on Information Technology. MIT Press, 2004.",
      "doi": ""
    },
    {
      "text": "Lyon, David. Surveillance Society: Monitoring Everyday Life. McGraw-Hill Education (UK), 2001.",
      "doi": ""
    },
    {
      "text": "Machuletz, Dominique, Henrik Sendt, Stefan Laube, and Rainer Böhme. \"Users Protect Their Privacy If They Can: Determinants of Webcam Covering Behavior.\" In Proceedings of the European Workshop on Usable Security (EuroUSEC'16). Internet Society, Reston, VA, USA, 2016.",
      "doi": ""
    },
    {
      "text": "Malkin, Nathan, Joe Deatrick, Allen Tong, Primal Wijesekera, Serge Egelman, and David Wagner. \"Privacy Attitudes of Smart Speaker Users.\" Proceedings on Privacy Enhancing Technologies 2019, no. 4 (2019): 250--271.",
      "doi": ""
    },
    {
      "text": "Mataskis, Louise. \"How the West Got China's Social Credit System Wrong.\" Wired. Accessed September 16, 2019. https://www.wired.com/story/china-social-credit-score-system/.",
      "doi": ""
    },
    {
      "text": "Matthews, Tara, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F. Churchill, and Sunny Consolvo. \"Stories from Survivors: Privacy & Security Practices When Coping with Intimate Partner Abuse.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2189--2201. CHI '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3025453.3025875.",
      "doi": ""
    },
    {
      "text": "McReynolds, Emily, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. \"Toys That Listen: A Study of Parents, Children, and Internet-Connected Toys.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 5197--5207. CHI '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3025453.3025735.",
      "doi": ""
    },
    {
      "text": "Menegus, Bryan. \"Amazon Rekognition Can Now Identify the Emotion It Provokes in Rational People.\" Gizmodo. Accessed September 11, 2019. https://gizmodo.com/amazon-rekognition-can-now-identify-the-emotion-it-prov-1837214151.",
      "doi": ""
    },
    {
      "text": "Mora, Simone, Francesco Gianni, and Monica Divitini. \"Tiles: A Card-Based Ideation Toolkit for the Internet of Things.\" In Proceedings of the 2017 Conference on Designing Interactive Systems, 587--598. DIS '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3064663.3064699.",
      "doi": ""
    },
    {
      "text": "Myagmar, Suvda, Adam J. Lee, and William Yurcik. \"Threat Modeling as a Basis for Security Requirements.\" In Symposium on Requirements Engineering for Information Security (SREIS). University of Pittsburgh, 2005. http://www.cs.pitt.edu/~adamlee/pubs/2005/lacsi05integrity.pdf.",
      "doi": ""
    },
    {
      "text": "Nest.com.?The Nestie Awards, Year Two | Nest.\" Accessed December 22, 2017. https://nest.com/blog/2017/03/08/the-nestieawards-year-two/.",
      "doi": ""
    },
    {
      "text": "Nest.com. \"Video | Nest.\" Accessed December 22, 2017. https://nest.com/video/category/security/",
      "doi": ""
    },
    {
      "text": "Neustaedter, Carman, and Phoebe Sengers. \"Autobiographical Design in HCI Research: Designing and Learning Through Use-It-Yourself.\" In Proceedings of the Designing Interactive Systems Conference, 514--523. DIS '12. New York, NY, USA: ACM, 2012. https://doi.org/10.1145/2317956.2318034.",
      "doi": ""
    },
    {
      "text": "Nissenbaum, Helen. \"Privacy as Contextual Integrity.\" Wash. L. Rev. 79 (2004): 119.",
      "doi": ""
    },
    {
      "text": "Odom, William, Mark Selby, Abigail Sellen, David Kirk, Richard Banks, and Tim Regan. \"Photobox: On the Design of a Slow Technology.\" In Proceedings of the Designing Interactive Systems Conference, 665--668. DIS '12. New York, NY, USA: ACM, 2012. https://doi.org/10.1145/2317956.2318055.",
      "doi": ""
    },
    {
      "text": "Odom, William, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K. Dey, and Min Kyung Lee. \"A Fieldwork of the Future with User Enactments.\" In Proceedings of the Designing Interactive Systems Conference, 338--347. DIS '12. New York, NY, USA: ACM, 2012. https://doi.org/10.1145/2317956.2318008.",
      "doi": ""
    },
    {
      "text": "Oogjes, Doenja, William Odom, and Pete Fung. \"Designing for an Other Home: Expanding and Speculating on Different Forms of Domestic Life.\" In Proceedings of the 2018 Designing Interactive Systems Conference, 313--326. DIS '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3196709.3196810.",
      "doi": ""
    },
    {
      "text": "Pierce, James. \"Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 45. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Pierce, James. \"Leaky sensor fields: Deviating, accelerating, and restraining the smart home.\" In Proc. of the 2019 Biennial Research through Design Conference, 2019. https://figshare.com/articles/Leaky_sensor_fields_Deviating_accelerating_and_restraining_the_smart_home/7855892",
      "doi": ""
    },
    {
      "text": "Pierce, James, Sarah Fox, Nick Merrill, and Richmond Wong. \"Differential Vulnerabilities and a Diversity of Tactics: What Toolkits Teach Us About Cybersecurity.\" Proc. ACM Hum.-Comput. Interact. 2, no. CSCW (November 2018): 139:1--139:24. https://doi.org/10.1145/3274408.",
      "doi": ""
    },
    {
      "text": "Pierce, James, and Carl DiSalvo. \"Addressing Network Anxieties with Alternative Design Metaphors.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 549. ACM, 2018.",
      "doi": ""
    },
    {
      "text": "Pierce, James, and Eric Paulos. \"Making Multiple Uses of the Obscura 1C Digital Camera: Reflecting on the Design, Production, Packaging and Distribution of a Counterfunctional Device.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2103--2112. CHI '15. New York, NY, USA: ACM, 2015. https://doi.org/10.1145/2702123.2702405.",
      "doi": ""
    },
    {
      "text": "Pierce, James, and Eric Paulos. \"Some Variations on a Counterfunctional Digital Camera.\" In Proceedings of the 2014 Conference on Designing Interactive Systems, 131--140. DIS '14. New York, NY, USA: ACM, 2014. https://doi.org/10.1145/2598510.2602968.",
      "doi": ""
    },
    {
      "text": "Pradhan, Alisha, Kanika Mehta, and Leah Findlater. \"\"Accessibility Came by Accident': Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 459:1--459:13. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3174033.",
      "doi": ""
    },
    {
      "text": "\"Realeyes.\" Accessed September 11, 2019. https://www.realeyesit.com/.",
      "doi": ""
    },
    {
      "text": "Rector, Kyle, Cynthia L. Bennett, and Julie A. Kientz. \"Eyes-Free Yoga: An Exergame Using Depth Cameras for Blind & Low Vision Exercise.\" In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility, 12:1--12:8. ASSETS '13. New York, NY, USA: ACM, 2013. https://doi.org/10.1145/2513383.2513392.",
      "doi": ""
    },
    {
      "text": "Rinner, B., T. Winkler, W. Schriebl, M. Quaritsch, and W. Wolf. \"The Evolution from Single to Pervasive Smart Cameras.\" In 2008 Second ACM/IEEE International Conference on Distributed Smart Cameras, 1--10, 2008. https://doi.org/10.1109/ICDSC.2008.463567.",
      "doi": ""
    },
    {
      "text": "Rogers, Jon, Loraine Clarke, Martin Skelly, Nick Taylor, Pete Thomas, Michelle Thorne, Solana Larsen, et al. \"Our Friends Electric: Reflections on Advocacy and Design Research for the Voice Enabled Internet.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 114:1--114:13. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300344.",
      "doi": ""
    },
    {
      "text": "Romero, Mario, Zachary Pousman, and Michael Mateas. \"Tableau Machine: An Alien Presence in the Home.\" In CHI '06 Extended Abstracts on Human Factors in Computing Systems, 1265--1270. CHI EA '06. New York, NY, USA: ACM, 2006. https://doi.org/10.1145/1125451.1125687.",
      "doi": ""
    },
    {
      "text": "Romero, Mario, Zachary Pousman, and Michael Mateas. \"Alien Presence in the Home: The Design of Tableau Machine.\" Personal Ubiquitous Comput. 12, no. 5 (June 2008): 373--382. https://doi.org/10.1007/s00779-007-0190-z.",
      "doi": "10.1007/s00779-007-0190-z"
    },
    {
      "text": "Rosner, Daniela K. Critical Fabulations: Reworking the Methods and Margins of Design. MIT Press, 2018.",
      "doi": ""
    },
    {
      "text": "u/samthemuffinman, (2019) Reddit/R/Nest, \"My Hello Doorbell Caught One of the Most Depressing Moments of My Life.\" reddit. Accessed September 15, 2019. https://www.reddit.com/r/Nest/comments/cgw1zw/my_hello_doorbell_caught_one_of_the_most/.",
      "doi": ""
    },
    {
      "text": "Schaub, Florian, Rebecca Balebako, Adam L. Durity, and Lorrie Faith Cranor. \"A Design Space for Effective Privacy Notices,\" 1--17, 2015. https://www.usenix.org/conference/soups2015/proceedings/presentation/schaub.",
      "doi": ""
    },
    {
      "text": "Scott, Kakee, Conny Bakker, and Jaco Quist. \"Designing Change by Living Change.\" Design Studies 33, no. 3 (May 1, 2012): 279--97. https://doi.org/10.1016/j.destud.2011.08.002.",
      "doi": ""
    },
    {
      "text": "Sedenberg, Elaine, Richmond Wong, and John Chuang. 2018. A window into the soul. In Surveillance, Privacy and Public Space, Bryce Newell, Tjerk Timan and Bert-Jaap Koops (eds.). Routledge, 75--98. https://doi.org/10.4324/9781315200811--5",
      "doi": ""
    },
    {
      "text": "Shilton, Katie, Jes A. Koepfler, and Kenneth R. Fleischmann. \"How to See Values in Social Computing: Methods for Studying Values Dimensions.\" In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, 426--435. CSCW '14. New York, NY, USA: ACM, 2014. https://doi.org/10.1145/2531602.2531625.",
      "doi": ""
    },
    {
      "text": "Shamma, David A., Jennifer Marlow, and Laurent Denoue. \"Interacting with Smart Consumer Cameras: Exploring Gesture, Voice, and AI Control in Video Streaming.\" In Proceedings of the 2019 ACM International Conference on Interactive Experiences for TV and Online Video, 137--144. ACM, 2019.",
      "doi": ""
    },
    {
      "text": "Shklovski, Irina, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. \"Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use.\" In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, 2347--2356. CHI '14. New York, NY, USA: ACM, 2014. https://doi.org/10.1145/2556288.2557421.",
      "doi": ""
    },
    {
      "text": "Shklovsky, Viktor. \"Art as Technique.\" Russian Formalist Criticism?: Four Essays, 1965.",
      "doi": ""
    },
    {
      "text": "Singer, Natasha. \"Amazon's Facial Recognition Wrongly Identifies 28 Lawmakers, A.C.L.U. Says.\" The New York Times, July 26, 2018, sec. Technology. https://www.nytimes.com/2018/07/26/technology/amazon-aclu-facial-recognition-congress.html.",
      "doi": ""
    },
    {
      "text": "Singer, Natasha. \"Amazon Is Pushing Facial Technology That a Study Says Could Be Biased.\" The New York Times, January 24, 2019, sec. Technology. https://www.nytimes.com/2019/01/24/technology/amazon-facial-technology-study.html.",
      "doi": ""
    },
    {
      "text": "Snow, Jacob. \"Amazon's Face Recognition Falsely Matched 28 Members of Congress With Mugshots.\" American Civil Liberties Union. Accessed September 11, 2019. https://www.aclu.org/blog/privacy-technology/surveillance-technologies/amazons-face-recognition-falsely-matched-28.",
      "doi": ""
    },
    {
      "text": "Soden, Robert, Michael Skirpan, Casey Fiesler, Zahra Ashktorab, Eric P. S. Baumer, Mark Blythe, and Jasmine Jones. 2019. CHI4EVIL: Creative Speculation on the Negative Impacts of HCI Research. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Paper W29, 8 pages. DOI: https://doi.org/10.1145/3290607.3299033",
      "doi": ""
    },
    {
      "text": "Søndergaard, Marie Louise Juul, and Lone Koefoed Hansen. \"Intimate Futures: Staying with the Trouble of Digital Personal Assistants Through Design Fiction.\" In Proceedings of the 2018 Designing Interactive Systems Conference, 869--880. DIS '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3196709.3196766.",
      "doi": ""
    },
    {
      "text": "Stark, Luke, and Karen Levy. \"The Surveillant Consumer.\" Media, Culture & Society 40, no. 8 (2018): 1202--1220.",
      "doi": ""
    },
    {
      "text": "Strategy Analytics. \"Smart Home Reports.\" Accessed September 16, 2019. https://www.strategyanalytics.com/access-services/devices/connected-home/smart-home/reports/report-detail/global-smart-home-surveillance-camera-market-forecast-2012-to-2023'slid=918459&spg=4.",
      "doi": ""
    },
    {
      "text": "Strengers, Yolande, Jenny Kennedy, Paula Arcari, Larissa Nicholls, and Melissa Gregg. \"Protection, Productivity and Pleasure in the Smart Home: Emerging Expectations and Gendered Insights from Australian Early Adopters,\" 645. ACM, 2019. https://doi.org/10.1145/3290605.3300875.",
      "doi": ""
    },
    {
      "text": "Sundström, Petra, Alex Taylor, Katja Grufberg, Niklas Wirström, Jordi Solsona Belenguer, and Marcus Lundén. \"Inspirational Bits: Towards a Shared Understanding of the Digital Material.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1561--1570. ACM, 2011.",
      "doi": ""
    },
    {
      "text": "Singer, Natasha. \"Amazon's Facial Recognition Wrongly Identifies 28 Lawmakers, A.C.L.U. Says.\" The New York Times, July 26, 2018, sec. Technology. https://www.nytimes.com/2018/07/26/technology/amazon-aclu-facial-recognition-congress.html.",
      "doi": ""
    },
    {
      "text": "Spaa, Anne, Abigail Durrant, Chris Elsden, and John Vines. \"Understanding the Boundaries Between Policymaking and HCI.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 84:1--84:15. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300314",
      "doi": ""
    },
    {
      "text": "Stappers, Pieter Jan, and Elisa Giaccardi. \"Research through Design | The Encyclopedia of Human-Computer Interaction, 2nd Ed.\" Accessed September 18, 2019. https://www.interaction-design.org/literature/book/the-encyclopedia-of-human-computer-interaction-2nd-ed/research-through-design.",
      "doi": ""
    },
    {
      "text": "Thurber, J., 1933. The car we had to push. My Life and Hard Times. The New Yorker, 1933. https://www.newyorker.com/magazine/1933/07/15/my-life-and-hard-times-the-car-we-had-to-push",
      "doi": ""
    },
    {
      "text": "Tolmie, Peter, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. \"\"This Has to Be the Cats': Personal Data Legibility in Networked Sensing Systems.\" In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 491--502. CSCW '16. New York, NY, USA: ACM, 2016. https://doi.org/10.1145/2818048.2819992.",
      "doi": ""
    },
    {
      "text": "Torres, Cesar, Jasper O'Leary, Molly Nicholas, and Eric Paulos. \"Illumination Aesthetics: Light As a Creative Material Within Computational Design.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6111--6122. CHI '17. New York, NY, USA: ACM, 2017. https://doi.org/10.1145/3025453.3025466.",
      "doi": ""
    },
    {
      "text": "TWICE: The Business of Consumer Electronics. \"61% Of Smart-Home Revenue Came From Security Cameras In The Last Year.\" Twice. Accessed September 16, 2019. https://www.twice.com/research/61-smart-home-revenue-came-security-cameras-last-year-62470.",
      "doi": ""
    },
    {
      "text": "Ur, Blase, Jaeyeon Jung, and Stuart Schechter. \"Intruders Versus Intrusiveness: Teens' and Parents' Perspectives on Home-Entryway Surveillance.\" In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 129--139. UbiComp '14. New York, NY, USA: ACM, 2014. https://doi.org/10.1145/2632048.2632107.",
      "doi": ""
    },
    {
      "text": "Viller, Stephen, Peter Worthy, Marie Bodén, Jason Weigel, Geraldine Fitzpatrick, Tom Rodden, and Ben Matthews. \"IoT: Designing for Human Values.\" In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems, 61--64. DIS '16 Companion. New York, NY, USA: ACM, 2016. https://doi.org/10.1145/2908805.2913019.",
      "doi": ""
    },
    {
      "text": "Wakkary, Ron, and et al. \"Material Speculation: Actual Artifacts for Critical Inquiry,\" 2015.",
      "doi": ""
    },
    {
      "text": "Waldman, Diane. \"Collage, Assemblage, and the Found Object,\" 1992.",
      "doi": ""
    },
    {
      "text": "Wallace, Jayne, Jon Rogers, Michael Shorter, Pete Thomas, Martin Skelly, and Richard Cook. \"The SelfReflector: Design, IoT and the High Street.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 423:1--423:12. CHI '18. New York, NY, USA: ACM, 2018. https://doi.org/10.1145/3173574.3173997.",
      "doi": ""
    },
    {
      "text": "Wingfield, Nick. \"Amazon Pushes Facial Recognition to Police. Critics See Surveillance Risk.\" The New York Times, May 22, 2018, sec. Technology. https://www.nytimes.com/2018/05/22/technology/amazon-facial-recognition.html.",
      "doi": ""
    },
    {
      "text": "Wheeler, Tom. \"Why 5G Requires New Approaches to Cybersecurity,\" Brookings, 2019. https://www.brookings.edu/research/why-5g-requires-new-approaches-to-cybersecurity/.",
      "doi": ""
    },
    {
      "text": "Wang, Y., 2017. The Third Wave?: Inclusive Privacy and Security, in: Proceedings of the 2017 New Security Paradigms Workshop (NSPW 2017). ACM, pp. 122--130.",
      "doi": ""
    },
    {
      "text": "Watch a Bear Break Into Home to Play the Piano. Accessed September 15, 2019. https://www.youtube.com/watch?v=Gz7pRGMdbWE&feature=youtu.be.",
      "doi": ""
    },
    {
      "text": "Weiser, Mark. \"Creating the Invisible Interface: (Invited Talk).\" In Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology, 1--. UIST '94. New York, NY, USA: ACM, 1994. https://doi.org/10.1145/192426.192428.",
      "doi": ""
    },
    {
      "text": "Wong, Richmond Y., and Deirdre K. Mulligan. \"Bringing Design to the Privacy Table: Broadening \"Design' in \"Privacy by Design' Through the Lens of HCI.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 262:1--262:17. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300492.",
      "doi": ""
    },
    {
      "text": "Wong, Richmond Y., Deirdre K. Mulligan, Ellen Van Wyk, James Pierce, and John Chuang. \"Eliciting Values Reflections by Engaging Privacy Futures Using Design Workbooks.\" Proceedings of the ACM on Human-Computer Interaction 1, no. CSCW (2017): 111.",
      "doi": ""
    },
    {
      "text": "Worthy, Peter, Ben Matthews, and Stephen Viller. \"Trust Me: Doubts and Concerns Living with the Internet of Things.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 427--434. DIS '16. New York, NY, USA: ACM, 2016. https://doi.org/10.1145/2901790.2901890.",
      "doi": ""
    },
    {
      "text": "Wu, Xiaolin, and Xi Zhang. \"Responses to Critiques on Machine Learning of Criminality Perceptions (Addendum of ArXiv:1611.04135).\" ArXiv:1611.04135 [Cs], November 2016. http://arxiv.org/abs/1611.04135.",
      "doi": ""
    },
    {
      "text": "Yao, Yaxing, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. \"Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 198:1--198:12. CHI '19. New York, NY, USA: ACM, 2019. https://doi.org/10.1145/3290605.3300428.",
      "doi": ""
    },
    {
      "text": "Zeng, Eric, Shrirang Mare, and Franziska Roesner. \"End User Security and Privacy Concerns with Smart Homes,\" 65--80, 2017. https://www.usenix.org/conference/soups2017/technical-sessions/presentation/zeng.",
      "doi": ""
    },
    {
      "text": "Zimmerman, John, Jodi Forlizzi, and Shelley Evenson. \"Research through Design as a Method for Interaction Design Research in HCI.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 493--502. ACM, 2007.",
      "doi": ""
    },
    {
      "text": "Zuboff, Shoshana. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power. Profile Books, 2019.",
      "doi": ""
    }
  ]
}