{
  "doi": "10.1145/3313831.3376267",
  "title": "Emoji Accessibility for Visually Impaired People",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Emoji are graphical symbols that appear in many aspects of our lives. Worldwide, around 36 million people are blind and 217 million have a moderate to severe visual impairment. This portion of the population may use and encounter emoji, yet it is unclear what accessibility challenges emoji introduce. We first conducted an online survey with 58 visually impaired participants to understand how they use and encounter emoji online, and the challenges they experience. We then conducted 11 interviews with screen reader users to understand more about the challenges reported in our survey findings. Our interview findings demonstrate that technology is both an enabler and a barrier, emoji descriptors can hinder communication, and therefore the use of emoji impacts social interaction. Using our findings from both studies, we propose best practice when using emoji and recommendations to improve the future accessibility of emoji for visually impaired people.",
  "authors": [
    {
      "name": "Garreth W. Tigwell",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-99659067691/rel-imgonly/img_20170512_13473021.09.44.jpg",
      "acmid": "99659067691",
      "orcid": "0000-0002-3123-6361"
    },
    {
      "name": "Benjamin M. Gorman",
      "institution": "Bournemouth University, Bournemouth, United Kingdom",
      "img": "/do/10.1145/contrib-99658650473/rel-imgonly/ben2018.jpeg",
      "acmid": "99658650473",
      "orcid": "missing"
    },
    {
      "name": "Rachel Menzies",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496660122",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2000. Section 508. Government of the United States of America. access-board.gov/guidelines-andstandards/communications-and-it/about-the-section508-standards/section-508-standards Accessed: 2019-09--17.",
      "doi": ""
    },
    {
      "text": "2010. The Equality Act. London: The Stationary Office. legislation.gov.uk/ukpga/2010/15/contents Accessed: 2019-09--17.",
      "doi": ""
    },
    {
      "text": "2019. Unicode® Emoji Chart Format. https://unicode.org/emoji/format.html#col-name. (2019). Accessed: 2019-03--22.",
      "doi": ""
    },
    {
      "text": "Jessalyn Alvina, Carla F. Griggio, Xiaojun Bi, and Wendy E. Mackay. 2017. CommandBoard: Creating a General-Purpose Command Gesture Input Space for Soft Keyboard. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). Association for Computing Machinery, New York, NY, USA, 17--28. DOI: http://dx.doi.org/10.1145/3126594.3126639",
      "doi": ""
    },
    {
      "text": "David Armstrong, Ann Gosling, John Weinman, and Theresa Marteau. 1997. The place of inter-rater reliability in qualitative research: an empirical study. Sociology 31, 3 (1997), 597--606. DOI: http://dx.doi.org/10.1177/0038038597031003015",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot, Cynthia L. Bennett, and Richard E. Ladner. 2013. DigiTaps: Eyes-free Number Entry on Touchscreens with Minimal Audio Feedback. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 85--90. DOI: http://dx.doi.org/10.1145/2501988.2502056",
      "doi": "10.1145/2501988.2502056"
    },
    {
      "text": "Syed Masum Billah, Vikas Ashok, Donald E. Porter, and I.V. Ramakrishnan. 2017. Ubiquitous Accessibility for People with Visual Impairments: Are We There Yet?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5862--5868. DOI: http://dx.doi.org/10.1145/3025453.3025731",
      "doi": ""
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013. Visual Challenges in the Everyday Lives of Blind People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2117--2126. DOI: http://dx.doi.org/10.1145/2470654.2481291",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, and Barbara Leporini. 2011. Web 2.0: Twitter and the Blind. In Proceedings of the 9th ACM SIGCHI Italian Chapter International Conference on Computer-Human Interaction: Facing Complexity (CHItaly). ACM, NY, NY, USA, 151--156. DOI: http://dx.doi.org/10.1145/2037296.2037333",
      "doi": "10.1145/2037296.2037333"
    },
    {
      "text": "Yuri Choi, Kyung Hoon Hyun, and Ji-Hyun Lee. 2017. Image-Based Tactile Emojis: Improved Interpretation of Message Intention and Subtle Nuance for Visually Impaired Individuals. Human--Computer Interaction 0, 0 (2017), 1--30. DOI: http://dx.doi.org/10.1080/07370024.2017.1324305",
      "doi": ""
    },
    {
      "text": "Moodle Education Claudia Dent. 2017. Enhance your online communications through more support for emoji characters in Moodle 3.3. https://moodle.com/news/enhance-onlinecommunications-support-emoji-characters-moodle-3--3. (2017). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Barry L Cole. 2004. The handicap of abnormal colour vision. Clinical and Experimental Optometry 87, 4--5 (2004), 258--275.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended Functions of Emojis in US Messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, NY, NY, USA, 504--509. DOI: http://dx.doi.org/10.1145/2935334.2935370",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Daantje Derks, Arjan ER Bos, and Jasper Von Grumbkow. 2007. Emoticons and social interaction on the Internet: the importance of social context. Comput hum behav 23, 1 (2007), 842--849.",
      "doi": ""
    },
    {
      "text": "Jill P. Dimond, Casey Fiesler, Betsy DiSalvo, Jon Pelc, and Amy S. Bruckman. 2012. Qualitative Data Collection Technologies: A Comparison of Instant Messaging, Email, and Phone. In Proceedings of the 17th ACM International Conference on Supporting Group Work (GROUP '12). ACM, NY, NY, USA, 277--280. DOI: http://dx.doi.org/10.1145/2389176.2389218",
      "doi": ""
    },
    {
      "text": "Abdallah El Ali, Torben Wallbaum, Merlin Wasmann, Wilko Heuten, and Susanne CJ Boll. 2017. Face2Emoji: Using Facial Emotional Expressions to Filter Emojis. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 1577--1584. DOI: http://dx.doi.org/10.1145/3027063.3053086",
      "doi": ""
    },
    {
      "text": "emojipedia. 2017. 5 Billion Emojis Sent Daily on Messenger. https://blog.emojipedia.org/5-billionemojis-sent-daily-on-messenger/. (2017). Accessed: 2019-08--28.",
      "doi": ""
    },
    {
      "text": "Instagram Engineering. 2015. Emojineering Part 1: Machine Learning for Emoji Trends. https://instagram-engineering.com/emojineering-part-1machine-learning-for-emoji-trendsmachine-learningfor-emoji-trends-7f5f9cb979ad. (2015). Accessed: 2019-08--28.",
      "doi": ""
    },
    {
      "text": "World Health Organisation (WHO) Programme for the Prevention of Blindness and Deafness. 2003. Consultation on development of standards for characterization of vision loss and visual functioning. https://apps.who.int/iris/handle/10665/68601. (2003). Accessed: 2019-09-03.",
      "doi": ""
    },
    {
      "text": "Justin Garrity. 2016. How Custom Emojis Crowned Twitter the Hashtag Registrar. https://medium.com/@justinogarrity/how-customemojis-crowned-twitter-the-hashtag-registrar43e5fa60c557. (2016). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Cameron Cassidy, Meredith Ringel Morris, Kris M. Kitani, and Jeffrey P. Bigham. 2019. \"It's Almost Like They're Trying to Hide It\": How User-Provided Image Descriptions Have Failed to Make Twitter Accessible. In The World Wide Web Conference (WWW '19). ACM, NY, NY, USA, 549--559. DOI: http://dx.doi.org/10.1145/3308558.3313605",
      "doi": "10.1145/3308558.3313605"
    },
    {
      "text": "Eric Goldman. 2018. Emojis and the Law. Wash. L. Rev. 93 (2018), 1227.",
      "doi": ""
    },
    {
      "text": "Benjamin M. Gorman and David R. Flatla. 2017. A Framework for Speechreading Acquisition Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 519--530. DOI: http://dx.doi.org/10.1145/3025453.3025560",
      "doi": "10.1145/3025453.3025560"
    },
    {
      "text": "Tim Highfield and Tama Leaver. 2016. Instagrammatics and digital methods: Studying visual social media, from selfies and GIFs to memes and emoji. Communication Research and Practice 2, 1 (2016), 47--62.",
      "doi": ""
    },
    {
      "text": "Albert H Huang, David C Yen, and Xiaoni Zhang. 2008. Exploring the potential effects of emoticons. Inform Manage 45, 7 (2008), 466--473.",
      "doi": "10.1016/j.im.2008.07.001"
    },
    {
      "text": "Unicode Inc. 2019a. Emoji Data for UTS. https://www.unicode.org/Public/emoji/12.0/emojidata.txt. (2019). Accessed: 2019-08--28.",
      "doi": ""
    },
    {
      "text": "Unicode Inc. 2019b. Unicode® Full Emoji List, v12.0. . (2019). Accessed: 2019-09--18.",
      "doi": ""
    },
    {
      "text": "Unicode Inc. 2019c. Unicode® Technical Standard #51 Design Guidelines. unicode.org/reports/tr51/#Design_Guidelines. (2019). Accessed: 2019-09--18.",
      "doi": ""
    },
    {
      "text": "(UTC) Unicode Inc. 2019d. Working Draft for Proposed Update Unicode® Technical Standard #51. unicode.org/L2/L2019/19203r2-wd-uts51--17draft.pdf#page=31. (2019). Accessed: 2019-09--18.",
      "doi": ""
    },
    {
      "text": "Simon Keates John Clarkson, Roger Coleman and Cherie Lebbon. 2003. Inclusive Design: Designing for the Whole Population. Springer-Verlag London. DOI: http://dx.doi.org/10.1007/978--1--4471-0001-0",
      "doi": ""
    },
    {
      "text": "Sigrid Kelsey and Kirk St. Amant. 2008. Handbook of Research on Computer Mediated Communication. IGI Global, Hershey, PA.",
      "doi": ""
    },
    {
      "text": "Adam Kendon. 1967. Some functions of gaze-direction in social interaction. Acta Psychologica 26 (1967), 22 -- 63. DOI: http://dx.doi.org/https://doi.org/10.1016/0001--6918(67)90005--4",
      "doi": ""
    },
    {
      "text": "Philippe Kimura-Thollander and Neha Kumar. 2019. Examining the \"Global\" Language of Emojis: Designing for Cultural Representation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 495, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300725",
      "doi": "10.1145/3290605.3300725"
    },
    {
      "text": "Elizabeth Kirley and Marilyn McMahon. 2017. The emoji factor: Humanizing the emerging law of digital speech. Tenn. L. Rev. 85 (2017), 517.",
      "doi": ""
    },
    {
      "text": "Matthew Knott. 2015. Emoji diplomacy? DFAT asked meaning behind Julie Bishop's use of a red-faced emoji to describe Vladimir Putin. Sydney Morning Herald, https://www.smh.com.au/politics/federal/emojidiplomacy-dfat-asked-meaning-behind-julie-bishopsuse-of-a-redfaced-emoji-to-describe-vladimir-putin20151022-gkfgoc.html. (2015). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Justin Kruger, Nicholas Epley, Jason Parker, and Zhi-Wen Ng. 2005. Egocentrism over e-mail: Can we communicate as well as we think? J. Pers. Soc. Psychol. 89, 6 (2005), 925--936. DOI: http://dx.doi.org/10.1037/0022--3514.89.6.925",
      "doi": ""
    },
    {
      "text": "Howard Lake. 2019. RNIB Aims to Redesign Emojis for Visually Impaired Users. fundraising.co.uk/2019/07/17/rnib-aims-to-redesignemojis-for-visually-impaired-users. (2019). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Weijian Li, Yuxiao Chen, Tianran Hu, and Jiebo Luo. 2018. Mining the Relationship between Emoji Usage Patterns and Personality. In Twelfth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Shao-Kang Lo. 2008. The nonverbal communication functions of emoticons in computer-mediated communication. CyberPsychology & Behavior 11, 5 (2008), 595--597.",
      "doi": ""
    },
    {
      "text": "Xuan Lu, Wei Ai, Xuanzhe Liu, Qian Li, Ning Wang, Gang Huang, and Qiaozhu Mei. 2016. Learning from the Ubiquitous Language: An Empirical Analysis of Emoji Usage of Smartphone Users. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, NY, NY, USA, 770--780. DOI: http://dx.doi.org/10.1145/2971648.2971724",
      "doi": "10.1145/2971648.2971724"
    },
    {
      "text": "David F Marks and Lucy Yardley. 2004. Research methods for clinical and health psychology. Sage.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article Article 72 (Nov. 2019), 23 pages. DOI: http://dx.doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Hannah Miller, Daniel Kluver, Jacob Thebault-Spieker, Loren Terveen, and Brent Hecht. 2017. Understanding emoji ambiguity in context: The role of text in emoji-related miscommunication. In Eleventh International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Hannah Jean Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac Johnson, Loren Terveen, and Brent Hecht. 2016. ?Blissfully Happy\" or \"Ready to Fight\": Varying Interpretations of Emoji. In Tenth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Hannah Miller Hillberg, Zachary Levonian, Daniel Kluver, Loren Terveen, and Brent Hecht. 2018. What I See is What You Don'T Get: The Effects of (Not) Seeing Emoji Rendering Differences Across Platforms. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 124 (Nov. 2018), 24 pages. DOI: http://dx.doi.org/10.1145/3274393",
      "doi": "10.1145/3274393"
    },
    {
      "text": "Sherwyn P Morreale, Brian H Spitzberg, and J Kevin Barge. 2006. Human communication: Motivation, knowledge, and skills. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Jazette Johnson, Cynthia L. Bennett, and Edward Cutrell. 2018. Rich Representations of Visual Content for Screen Reader Users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 59, 11 pages. DOI: http://dx.doi.org/10.1145/3173574.3173633",
      "doi": "10.1145/3173574.3173633"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With Most of It Being Pictures Now, I Rarely Use It\": Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5506--5516. DOI: http://dx.doi.org/10.1145/2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Leah Perlmutter, Bindita Chaudhuri, Justin Petelka, Philip Garrison, James Fogarty, Jacob O. Wobbrock, and Richard E. Ladner. 2019. Demonstration of GestureCalc: An Eyes-Free Calculator for Touch Screens. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '19). ACM, NY, NY, USA, 667--669. DOI: http://dx.doi.org/10.1145/3308561.3354595",
      "doi": ""
    },
    {
      "text": "Katy Perry. n.d. https://twitter.com/katyperry. (n.d.). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Christian Domin, and Michael Rohs. 2017. Beyond Just Text: Semantic Emoji Similarity Modeling to Support Expressive Communication. ACM Trans. Comput.-Hum. Interact. 24, 1, Article 6 (March 2017), 42 pages. DOI: http://dx.doi.org/10.1145/3039685",
      "doi": "10.1145/3039685"
    },
    {
      "text": "Henning Pohl, Dennis Stanke, and Michael Rohs. 2016. EmojiZoom: Emoji Entry via Large Overview Maps. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, NY, NY, USA, 510--517. DOI: http://dx.doi.org/10.1145/2935334.2935382",
      "doi": "10.1145/2935334.2935382"
    },
    {
      "text": "National Rail. n.d. https://twitter.com/nationalrailenq. (n.d.). Accessed: 2019-09--16.",
      "doi": ""
    },
    {
      "text": "Maya Rhodan. 2014. President Obama Is Reaching Out to Millennials About the Economy Using...Emoji. https://time.com/3484876/obama-emoji/. (2014). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "David Rodrigues, Diniz Lopes, Marília Prada, Dominic Thompson, and Margarida V. Garrido. 2017. A frown emoji can be worth a thousand words: Perceptions of emoji use in text messages exchanged between romantic partners. Telematics and Informatics 34, 8 (2017), 1532 -- 1543. DOI: http://dx.doi.org/https://doi.org/10.1016/j.tele.2017.07.001",
      "doi": "10.1016/j.tele.2017.07.001"
    },
    {
      "text": "Adrian Roselli. 2016. Accessible Emoji, Tweaked. http://adrianroselli.com/2016/12/accessible-emojitweaked.html. (2016). Accessed: 2019-03--18.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman. 2019. HCI Guidelines for Gender Equality and Inclusivity; updated 5/13/2019. https://www.morgan-klaus.com/sigchi-genderguidelines. (2019). Accessed: 2019--20-09.",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Vicki L. Hanson. 2012. Representing Users in Accessibility Research. ACM Trans. Access. Comput. 4, 2, Article Article 7 (March 2012), 6 pages. DOI: http://dx.doi.org/10.1145/2141943.2141945",
      "doi": "10.1145/2141943.2141945"
    },
    {
      "text": "Katy Steinmetz. 2015. Oxford's 2015 Word of the Year Is This Emoji. TIME, https://time.com/4114886/oxfordword-of-the-year-2015-emoji/. (2015). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Gerhard Strube. 1987. Answering survey questions: The role of memory. In Social information processing and survey methodology. Springer, 86--101.",
      "doi": ""
    },
    {
      "text": "Selina Sutton and Shaun Lawson. 2017. A Provocation for Rethinking and Democratising Emoji Design. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, NY, NY, USA, 7--12. DOI: http://dx.doi.org/10.1145/3064857.3079109",
      "doi": "10.1145/3064857.3079109"
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 171--180. DOI: http://dx.doi.org/10.1145/2982142.2982168",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Garreth W. Tigwell and David R. Flatla. 2016. Oh That's What You Meant!: Reducing Emoji Misunderstanding. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, NY, NY, USA, 859--866. DOI: http://dx.doi.org/10.1145/2957265.2961844",
      "doi": "10.1145/2957265.2961844"
    },
    {
      "text": "Garreth W. Tigwell, David R. Flatla, and Rachel Menzies. 2018. It's Not Just the Light: Understanding the Factors Causing Situational Visual Impairments During Mobile Interaction. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI '18). ACM, NY, NY, USA, 338--351. DOI: http://dx.doi.org/10.1145/3240167.3240207",
      "doi": "10.1145/3240167.3240207"
    },
    {
      "text": "Garreth W. Tigwell, Zhanna Sarsenbayeva, Benjamin M. Gorman, David R. Flatla, Jorge Goncalves, Yeliz Yesilada, and Jacob O. Wobbrock. 2019. Addressing the Challenges of Situationally-Induced Impairments and Disabilities in Mobile Interaction. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article W30, 8 pages. DOI: http://dx.doi.org/10.1145/3290607.3299029",
      "doi": "10.1145/3290607.3299029"
    },
    {
      "text": "Sarah J. Tracy. 2013. Qualitative Research Methods: Collecting Evidence, Crafting Analysis, Communicating Impact. Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "Unicode. 2019. Members - Unicode. https://home.unicode.org/membership/members/. (2019). Accessed: 2019-09--18.",
      "doi": ""
    },
    {
      "text": "Veroniiiica. 2018. How Do People with Vision Impairments...Use Emoji? http://www.perkinselearning.org/technology/blog/howdo-people-vision-impairments-use-emoji. (2018). Accessed: 2019-03--18.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther and Kyle P D'Addario. 2001. The impacts of emoticons on message interpretation in computer-mediated communication. Social science computer review 19, 3 (2001), 324--347.",
      "doi": ""
    },
    {
      "text": "Léonie Watson. 2016. Accessible emoji. https://tink.uk/accessible-emoji/. (2016). Accessed: 2019-03--18.",
      "doi": ""
    },
    {
      "text": "Brian Wentz, Harry Hochheiser, and Jonathan Lazar. 2013. A survey of blind users on the usability of email applications. Universal Access in the Information Society 12, 3 (01 Aug 2013), 327--336. DOI: http://dx.doi.org/10.1007/s10209-012-0285--9",
      "doi": ""
    },
    {
      "text": "World Health Organisation (WHO). 2018. Blindness and vision impairment. https://www.who.int/news-room/factsheets/detail/blindness-and-visual-impairment. (2018). Accessed: 2019-09-04.",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why Pizza Slice Emoji; Means \"I Love You\". In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 152, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3173726",
      "doi": ""
    },
    {
      "text": "Shaomei Wu and Lada A. Adamic. 2014. Visually Impaired Users on an Online Social Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3133--3142. DOI: http://dx.doi.org/10.1145/2556288.2557415",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Peijun Zhao, Jia Jia, Yongsheng An, Jie Liang, Lexing Xie, and Jiebo Luo. 2018. Analyzing and Predicting Emoji Usages in Social Media. In Companion Proceedings of the The Web Conference 2018 (WWW '18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 327--334. DOI: http://dx.doi.org/10.1145/3184558.3186344",
      "doi": ""
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 748--759. DOI: http://dx.doi.org/10.1145/3025453.3025800",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}