{
  "doi": "10.1145/3313831.3376572",
  "title": "Others' Images: Online Social Media, Architectural Improvisations, and Spatial Marginalization in Bangladesh",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "This paper joins the growing body of work in postcolonial computing in HCI, and critically examines the impacts of online social media on the urban architecture in the Global South. Based on our nine-month long ethnography at eight residential areas in Dhaka, Bangladesh, this paper reports how online fame drives local users to produce digital images of their houses mimicking various Western standards, which in turn, brings changes to the organization, aesthetics, and functions of domestic spaces. This paper also describes how such digital image mediated transformations to local architecture are diminishing traditional spaces, altering their usual functions, and limiting the movement of many women inside their home. Drawing from a rich body of literature in postcolonialism, critical image theory, architecture, and Islamic feminism, we explain how these practices demonstrate a subaltern experience of using social media in the Global South. We further discuss design implications to both HCI and architecture to address these issues, and connect our findings to the broader agendas of HCI around social justice and global development.",
  "authors": [
    {
      "name": "Nusrat Jahan Mim",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702308",
      "orcid": "missing"
    },
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    }
  ],
  "references": [
    {
      "text": "Norah Abokhodair and Sarah Vieweg. 2016. Privacy & social media in the context of the Arab Gulf. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 672--683.",
      "doi": "10.1145/2901790.2901873"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Shion Guha, Md Rashidujjaman Rifat, Faysal Hossain Shezan, and Nicola Dell. 2016. Privacy in repair: An analysis of the privacy challenges surrounding broken digital artifacts in bangladesh. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. ACM, 11.",
      "doi": "10.1145/2909609.2909661"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017a. Digital privacy challenges with shared mobile phone use in bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 17.",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Shion Guha, Md Rashidujjaman Rifat, and Nicola Dell. 2017b. Privacy, security, and surveillance in the Global South: A study of biometric mobile SIM registration in Bangladesh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 906--918.",
      "doi": "10.1145/3025453.3025961"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Irtaza Haider, Jay Chen, and Nicola Dell. 2019. Everyone Has Some Personal Stuff: Designing to Support Digital Privacy with Shared Mobile Phone Use in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 180.",
      "doi": "10.1145/3290605.3300410"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md Rashidujjaman Rifat, ASM Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A platform for fighting sexual harassment in urban Bangladesh. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2695--2704.",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, and Md Rashidujjaman Rifat. 2015a. Learning to fix: knowledge, collaboration and mobile phone repair in Dhaka, Bangladesh. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, 4.",
      "doi": "10.1145/2737856.2738018"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Nusrat Jahan Mim, and Steven J Jackson. 2015b. Residual mobilities: infrastructural displacement and post-colonial computing in Bangladesh. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 437--446.",
      "doi": "10.1145/2702123.2702573"
    },
    {
      "text": "SM Al-Jubayer. 2013. Use of social networking sites among teenagers: A study of Facebook use in Dhaka City. Journal of International Social Issues (March 2013) 2, 1 (2013), 35--44.",
      "doi": ""
    },
    {
      "text": "Hamed S Alavi, Elizabeth Churchill, David Kirk, Julien Nembrini, and Denis Lalanne. 2016. Deconstructing human-building interaction. interactions 23, 6 (2016), 60--62.",
      "doi": ""
    },
    {
      "text": "Ari-Veikko Anttiroiko. 2012. Urban Planning 2.0. International Journal of E-Planning Research (IJEPR) 1, 1 (2012), 16--30.",
      "doi": ""
    },
    {
      "text": "Guy Austern, Isaac Guedi Capeluto, and Yasha Jacob Grobman. 2018. Rationalization methods in computer aided fabrication: a critical review. Automation in Construction 90 (2018), 281--293.",
      "doi": ""
    },
    {
      "text": "Salman Azhar, Malik Khalfan, and Tayyab Maqsood. 2012. Building information modelling (BIM): now and beyond. Construction Economics and Building 12, 4 (2012), 15--28.",
      "doi": ""
    },
    {
      "text": "Margot Badran. 2001. Understanding Islam, Islamism, and Islamic Feminism. Journal of Women's History 13, 1 (2001), 47--52.",
      "doi": ""
    },
    {
      "text": "Margot Badran. 2006. Islamic feminism revisited. Al-Ahram Weekly On-Line 781 (2006), 9--15.",
      "doi": ""
    },
    {
      "text": "Reyner Banham. 2011. Parallel of life and art. October (2011), 8--10.",
      "doi": ""
    },
    {
      "text": "Reyner Banham. 2016. The new brutalism by Reyner Banham. Architectural Review (2016).",
      "doi": ""
    },
    {
      "text": "Moritz Behrens, Nina Valkanova, Duncan P Brumby, and others. 2014. Smart citizen sentiment dashboard: A case study into media architectural interfaces. In Proceedings of the international symposium on pervasive displays. ACM, 19.",
      "doi": "10.1145/2611009.2611036"
    },
    {
      "text": "Homi Bhabha. 1997. Of mimicry and man. Tensions of Empire, University of California Press, Berkeley (1997), 152--60.",
      "doi": ""
    },
    {
      "text": "Homi K Bhabha. 2012. The location of culture. routledge.",
      "doi": ""
    },
    {
      "text": "Homi K Bhabha and Jonathan Rutherford. 2006. Third space. Multitudes 3 (2006), 95--107.",
      "doi": ""
    },
    {
      "text": "Marc Jonathan Blitz. 2018. Lies, Line Drawing, and Deep Fake News. Okla. L. Rev. 71 (2018), 59.",
      "doi": ""
    },
    {
      "text": "Emmanuel Kwasi Boakye. 2019. Architecture Design Software: A Qualitative Study of Adult Learners' Experiences. Ph.D. Dissertation. Capella University.",
      "doi": ""
    },
    {
      "text": "Daniel G Bobrow and Terry Winograd. 1977. An overview of KRL, a knowledge representation language. Cognitive science 1, 1 (1977), 3--46.",
      "doi": ""
    },
    {
      "text": "Alan Hamilton Borning. 1979. Thinglab-a constraint-oriented simulation laboratory. Doctorial dissertation, Dept. of Computer Science, Standford (1979).",
      "doi": ""
    },
    {
      "text": "Shelley Boulianne. 2015. Social media use and participation: A meta-analysis of current research. Information, communication & society 18, 5 (2015), 524--538.",
      "doi": ""
    },
    {
      "text": "Pierre Bourdieu. 1989. Social space and symbolic power. Sociological theory 7, 1 (1989), 14--25.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Nathan C Brown and Caitlin T Mueller. 2019. Design variable analysis and generation for performance-based parametric modeling in architecture. International Journal of Architectural Computing 17, 1 (2019), 36--52.",
      "doi": ""
    },
    {
      "text": "Richard A Buswell, Rupert C Soar, Alistair GF Gibb, and A Thorpe. 2006. Freeform construction application research. In Advances in Engineering Structures, Mechanics & Construction. Springer, 773--780.",
      "doi": ""
    },
    {
      "text": "Glenda Amayo Caldwell and Marcus Foth. 2014. DIY media architecture: open and participatory approaches to community engagement. In Proceedings of the 2nd Media Architecture Biennale Conference: World Cities. ACM, 1--10.",
      "doi": "10.1145/2682884.2682893"
    },
    {
      "text": "Dave Colangelo. 2019. We Live Here: Media Architecture as Critical Spatial Practice. Space and Culture (2019), 1206331219843809.",
      "doi": ""
    },
    {
      "text": "Robert W Cox. 1983. Gramsci, hegemony and international relations: an essay in method. Millennium 12, 2 (1983), 162--175.",
      "doi": ""
    },
    {
      "text": "Drury B Crawley, Jon W Hand, Michaël Kummert, and Brent T Griffith. 2008. Contrasting the capabilities of building energy performance simulation programs. Building and environment 43, 4 (2008), 661--673.",
      "doi": ""
    },
    {
      "text": "AR Curtis. 2015. From Arab Spring to Shahbag: The role of social media in terms of national crisis. Journal of Mass Communication Journalism 5, 2 (2015), 1--3.",
      "doi": ""
    },
    {
      "text": "Antonio R Damasio. 2012. Self comes to mind: Constructing the conscious brain. Vintage.",
      "doi": ""
    },
    {
      "text": "Alvaro de Gracia. 2019. Dynamic building envelope with PCM for cooling purposes--Proof of concept. Applied energy 235 (2019), 1245--1253.",
      "doi": ""
    },
    {
      "text": "Alison de Kruiff, Flavia Marcello, Jeni Paay, Erik Champion, and Jane Burry. 2018. Learning from Lost Architecture: Immersive Experience and Cultural Experience as a New Historiography. In Proceedings of the 35th Annual Conference of the Society of Architectural Historians of Australia and New Zealand.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial Design as Inquiry and Practice. Mit Press.",
      "doi": ""
    },
    {
      "text": "Brooke Erin Duffy and Emily Hund. 2015. \"Having it all\" on social media: Entrepreneurial femininity and self-branding among fashion bloggers. Social Media+Society 1, 2 (2015), 2056305115604337.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Antony Easthope. 1998. Bhabha, hybridity and identity. Textual practice 12, 2 (1998), 341--348.",
      "doi": ""
    },
    {
      "text": "Sutherland Ivan Edward. 1963. Sketchpad: A man-machine graphical communication system. PhD Thesis, Massachusetts Institute of Technology (1963).",
      "doi": ""
    },
    {
      "text": "Anton Ehrenzweig. 1967. The hidden order of art: A study in the psychology of artistic imagination. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Mark Ericson. 2017. Grasshopper Algorithmic Modeling for Rhinoceros 5. (2017).",
      "doi": ""
    },
    {
      "text": "Frantz Fanon. 2008. Black skin, white masks. Grove press.",
      "doi": ""
    },
    {
      "text": "Jasmine Fardouly and Lenny R Vartanian. 2016. Social media and body image concerns: Current research and future directions. Current opinion in psychology 9 (2016), 1--5.",
      "doi": ""
    },
    {
      "text": "Patrick Tobias Fischer and Eva Hornecker. 2012. Urban HCI: spatial aspects in the design of shared encounters for media facades. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 307--316.",
      "doi": "10.1145/2207676.2207719"
    },
    {
      "text": "Vilém Flusser. 2011a. Does writing have a future? Vol. 33. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Vilém Flusser. 2011b. Into the universe of technical images. Vol. 32. U of Minnesota press.",
      "doi": ""
    },
    {
      "text": "Claude Fortin and Kate Hennessy. 2015. The dual skins of a media facc ade: Explicit and implicit interactions. In ACM SIGGRAPH Art Papers. ACM, 348--356.",
      "doi": ""
    },
    {
      "text": "Peter Galison. 2006. Images scatter into data, data gather into images. Images: A Reader 236 (2006).",
      "doi": ""
    },
    {
      "text": "Herbert Gans. 2008. Popular culture and high culture: An analysis and evaluation of taste. Basic books.",
      "doi": ""
    },
    {
      "text": "Erving Goffman and others. 1978. The presentation of self in everyday life. Harmondsworth London.",
      "doi": ""
    },
    {
      "text": "Leo A Goodman. 1961. Snowball sampling. The annals of mathematical statistics (1961), 148--170.",
      "doi": ""
    },
    {
      "text": "Maximillian H\"anska Ahy. 2016. Networked communication and the Arab Spring: Linking broadcast and social media. New Media & Society 18, 1 (2016), 99--116.",
      "doi": ""
    },
    {
      "text": "SM Taiabul Haque, Pratyasha Saha, Muhammad Sajidur Rahman, and Syed Ishtiaque Ahmed. 2019. Of Ulti,'hajano', and\" Matachetar otanetak datam\" Exploring Local Practices of Exchanging Confidential and Sensitive Information in Urban Bangladesh. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (2019), 1--22.",
      "doi": ""
    },
    {
      "text": "Steve R Harrison and Paul Dourish. 1996. Re-place-ing space: The roles of place and space in collaborative systems.. In CSCW, Vol. 96. 67--76.",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Naeemul Hassan, Manash Kumar Mandal, Mansurul Bhuiyan, Aparna Moitra, and Syed Ishtiaque Ahmed. 2019. Nonparticipation of bangladeshi women in# MeToo movement. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. ACM, 29.",
      "doi": "10.1145/3287098.3287125"
    },
    {
      "text": "Gina Higginbottom, Jennifer J Pillay, and Nana Y Boadu. 2013. Guidance on performing focused ethnographies with an emphasis on healthcare research. The Qualitative Report 18, 9 (2013), 1--6.",
      "doi": ""
    },
    {
      "text": "Christopher Holmberg, John E Chaplin, Thomas Hillman, and Christina Berg. 2016. Adolescents' presentation of food in social media: An explorative study. Appetite 99 (2016), 121--129.",
      "doi": ""
    },
    {
      "text": "Sen Huang, Yan Chen, Paul W Ehrlich, and Draguna L Vrabie. 2018. A control-oriented building envelope and HVAC system simulation model for a typical large office building. Technical Report. Pacific Northwest National Lab (PNNL), Richland, WA (United States).",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1311--1320.",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Hiroshi Ishii, Craig Wisneski, Scott Brave, Andrew Dahley, Matt Gorbet, Brygg Ullmer, and Paul Yarin. 1998. ambientROOM: integrating ambient media with architectural space. In CHI 98 conference summary on Human factors in computing systems. ACM, 173--174.",
      "doi": "10.1145/286498.286652"
    },
    {
      "text": "Md Islam, Sk Mostofa, and others. 2015. Usage pattern of Facebook among the students of Dhaka University: a study. (2015).",
      "doi": ""
    },
    {
      "text": "David Joselit. 2013. After art. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Jeffrey S Juris. 2012. Reflections on# Occupy Everywhere: Social media, public space, and emerging logics of aggregation. American Ethnologist 39, 2 (2012), 259--279.",
      "doi": ""
    },
    {
      "text": "Mostafa Kamal and Shah Alam Pramanik. 2015. Customers' Intention towards Purchasing Apartment in Dhaka City, Bangladesh: Offering an Alternative Buying Intention Model. European Journal of Business and Management 7, 35 (2015).",
      "doi": ""
    },
    {
      "text": "Md Kamruzzaman and N Ogura. 2007. Apartment housing in Dhaka City: Past, present and characteristic outlook. Building Stock Activation, Tokyo, Japan (2007).",
      "doi": ""
    },
    {
      "text": "Stamatis Karnouskos and Thiago Nass De Holanda. 2009. Simulation of a smart grid city with software agents. In 2009 Third UKSim European Symposium on Computer Modeling and Simulation. IEEE, 424--429.",
      "doi": "10.1109/EMS.2009.53"
    },
    {
      "text": "Moslehuddin Chowdhury Khaled, Tasnim Sultana, Sujan Kanti Biswas, and Rana Karan. 2012. Real estate industry in Chittagong (Bangladesh): A survey on customer perception and expectation. Developing country studies 2, 2 (2012), 38--45.",
      "doi": ""
    },
    {
      "text": "Hendrik Knoche, John D McCarthy, and M Angela Sasse. 2005. Can small be beautiful?: assessing image resolution requirements for mobile TV. In Proceedings of the 13th annual ACM international conference on Multimedia. ACM, 829--838.",
      "doi": "10.1145/1101149.1101331"
    },
    {
      "text": "Neha Kumar. 2014. Facebook for self-empowerment? A study of Facebook adoption in urban India. New media & society 16, 7 (2014), 1122--1137.",
      "doi": ""
    },
    {
      "text": "Abidin Kusno. 2014. Behind the postcolonial: Architecture, urban space and political cultures in Indonesia. Routledge.",
      "doi": ""
    },
    {
      "text": "SM Labib, Md Musfiqur Rahman Bhuiya, and Md Zahidur Rahaman. 2013. Location and size preference for apartments in Dhaka and prospect of real estate market. Bangladesh Research Publications Journal 9, 2 (2013), 87--96.",
      "doi": ""
    },
    {
      "text": "Yanru Li, Mengwei Wang, Yin Zhang, and Enshen Long. 2019. The dynamic thermal process of indoor environment and building envelope during intermittent heating. Indoor and Built Environment 28, 3 (2019), 422--433.",
      "doi": ""
    },
    {
      "text": "Mark Linder. 2012. Images and Other Stuff. Journal of Architectural Education 66, 1 (2012), 3--8.",
      "doi": ""
    },
    {
      "text": "John Lofland and Lyn H Lofland. 1971. Analyzing social settings. (1971).",
      "doi": ""
    },
    {
      "text": "Saba Mahmood. 2011. Politics of piety: The Islamic revival and the feminist subject. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Lev Manovich. 2016. Instagram and contemporary image. Manovich. net, New York (2016).",
      "doi": ""
    },
    {
      "text": "Carlos L Marcos. 2017. Architectural drawing and graphic narratives in the digital age. In Territories and frontiers of representation proceedings international conference UID. Gangemi Editore, Roma.",
      "doi": ""
    },
    {
      "text": "Kevin Matzen, Kavita Bala, and Noah Snavely. 2017. Streetstyle: Exploring world-wide clothing styles from millions of photos. arXiv preprint arXiv:1706.01869 (2017).",
      "doi": ""
    },
    {
      "text": "Matiur Rahman Minar and Jibon Naher. 2018. Violence originated from Facebook: A case study in Bangladesh. arXiv preprint arXiv:1804.11241 (2018).",
      "doi": ""
    },
    {
      "text": "William J Mitchell. 1975. The theoretical foundation of computer-aided architectural design. Environment and Planning B: Planning and Design 2, 2 (1975), 127--150.",
      "doi": ""
    },
    {
      "text": "Valentine M Moghadam. 2002. Islamic feminism and its discontents: Toward a resolution of the debate. Signs: Journal of Women in Culture and Society 27, 4 (2002), 1135--1171.",
      "doi": ""
    },
    {
      "text": "Aparna Moitra, Naeemul Hassan, Manash Kumar Mandal, Mansurul Bhuiyan, and Syed Ishtiaque Ahmed. 2020. Understanding the Challenges for Bangladeshi Women to Participate in# MeToo Movement. Proceedings of the ACM on Human-Computer Interaction 4, GROUP (2020), 1--25.",
      "doi": "10.1145/3375195"
    },
    {
      "text": "Sara Nabil, Thomas Plötz, and David S Kirk. 2017. Interactive architecture: Exploring and unwrapping the potentials of organic user interfaces. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 89--100.",
      "doi": "10.1145/3024969.3024981"
    },
    {
      "text": "Atif Nazir, Saqib Raza, and Chen-Nee Chuah. 2008. Unveiling facebook: a measurement study of social network based applications. In Proceedings of the 8th ACM SIGCOMM conference on Internet measurement. ACM, 43--56.",
      "doi": "10.1145/1452520.1452527"
    },
    {
      "text": "David Nemer. 2016. Online favela: The use of social media by the marginalized in Brazil. Information Technology for Development 22, 3 (2016), 364--379.",
      "doi": "10.1080/02681102.2015.1011598"
    },
    {
      "text": "Naresh R Pandit. 1996. The creation of theory: A recent application of the grounded theory method. The qualitative report 2, 4 (1996), 1--15.",
      "doi": ""
    },
    {
      "text": "Mojtaba Parsaee, Parinaz Motealleh, and Mohammad Parva. 2016. Interactive architectural approach (interactive architecture): an effective and adaptive process for architectural design. HBRC journal 12, 3 (2016), 327--336.",
      "doi": ""
    },
    {
      "text": "Michelle E Portman, Asya Natapov, and Dafna Fisher-Gewirtzman. 2015. To go where no man has gone before: Virtual reality in architecture, landscape architecture and environmental planning. Computers, Environment and Urban Systems 54 (2015), 376--384.",
      "doi": ""
    },
    {
      "text": "Amit S Rai. 2019. Jugaad Time: Ecologies of Everyday Hacking in India. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Jacques Rancière. 2019. The future of the image. Verso.",
      "doi": ""
    },
    {
      "text": "Amos Rapoport. 2006. Vernacular design as a model system. L. Asquith and M. Vellinga (ed. s), Vernacular Architecture in the Twenty-First Century (Theory, Education, and Practice), Taylor and Francis, London, UK (2006), 179--198.",
      "doi": ""
    },
    {
      "text": "Mostapha Sadeghipour Roudsari, Michelle Pak, Adrian Smith, and others. 2013. Ladybug: a parametric environmental plugin for grasshopper to help designers create an environmentally-conscious design. In Proceedings of the 13th international IBPSA conference held in Lyon, France Aug.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. \" Privacy is not for me, it's for those rich women\": Performative Privacy Practices on Mobile Phones by Women in South Asia. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). 127--142.",
      "doi": "10.5555/3291228.3291240"
    },
    {
      "text": "Aakash Shaw. 2016. Role of Social Media in Social Mobilization (With Special Reference To Shahbagh and Hokkolorob Movements). Global Media Journal: Indian Edition 7, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Barbara Maria Stafford, Frances Terpak, and Isotta Poggi. 2001. Devices of Wonder: From the World in a Box to Images on a Screen. Getty Publications.",
      "doi": ""
    },
    {
      "text": "Tristan Sterk. 2005. Building upon Negroponte: a hybridized model of control suitable for responsive architecture. Automation in construction 14, 2 (2005), 225--232.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1990. Open coding. Basics of qualitative research: Grounded theory procedures and techniques 2, 1990 (1990), 101--121.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Syed Ishtiaque Ahmed. 2019. Witchcraft and HCI: Morality, Modernity, and Postcolonial Computing in Rural Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 356.",
      "doi": "10.1145/3290605.3300586"
    },
    {
      "text": "Gerald Jay Sussman and Guy Lewis Steele Jr. 1980. CONSTRAINTS - A language for expressing almost-hierarchical descriptions. Artificial intelligence 14, 1 (1980), 1--39.",
      "doi": ""
    },
    {
      "text": "David Throsby. 1999. Cultural capital. Journal of cultural economics 23, 1--2 (1999), 3--12.",
      "doi": ""
    },
    {
      "text": "Michael J Tierney, Thomas G Cooper, Chris A Julian, Stephen J Blumenkranz, Gary S Guthart, and Robert G Younge. 2001. Surgical robotic tools, data architecture, and use. (Dec. 18 2001). US Patent 6,331,181.",
      "doi": ""
    },
    {
      "text": "Michael Wigginton and Jude Harris. 2013. Intelligent skins. Routledge.",
      "doi": ""
    },
    {
      "text": "Robert Woodbury and others. 2010. Elements of parametric design. (2010).",
      "doi": ""
    },
    {
      "text": "Ron B Yeh, Andreas Paepcke, Hector Garcia-Molina, and Mor Naaman. 2005. Leveraging context to resolve identity in photo albums. In Proceedings of the 5th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL'05). IEEE, 178--187.",
      "doi": ""
    },
    {
      "text": "Quanzeng You, Dario Garcia-Garcia, Mahohar Paluri, Jiebo Luo, and Jungseock Joo. 2017. Cultural diffusion and trends in facebook photographs. In Eleventh International AAAI Conference on Web and Social Media.",
      "doi": ""
    }
  ]
}