{
  "doi": "10.1145/3313831.3376441",
  "title": "PalmBoard: Leveraging Implicit Touch Pressure in Statistical Decoding for Indirect Text Entry",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We investigated how to incorporate implicit touch pressure, finger pressure applied to a touch surface during typing, to improve text entry performance via statistical decoding. We focused on one-handed touch-typing on indirect interface as an example scenario. We first collected typing data on a pressure-sensitive touchpad, and analyzed users' typing behavior such as touch point distribution, key-to-finger mappings, and pressure images. Our investigation revealed distinct pressure patterns for different keys. Based on the findings, we performed a series of simulations to iteratively optimize the statistical decoding algorithm. Our investigation led to a Markov-Bayesian decoder incorporating pressure image data into decoding. It improved the top-1 accuracy from 53% to 74% over a naive Bayesian decoder. We then implemented PalmBoard, a text entry method that implemented the Markov-Bayesian decoder and effectively supported one-handed touch-typing on indirect interfaces. A user study showed participants achieved an average speed of 32.8 WPM with 0.6% error rate. Expert typists could achieve 40.2 WPM with 30 minutes of practice. Overall, our investigation showed that incorporating implicit touch pressure is effective in improving text entry decoding.",
  "tags": [
    "text entry",
    "input prediction",
    "touch-typing",
    "touch pressure"
  ],
  "authors": [
    {
      "name": "Xin Yi",
      "institution": "Tsinghua University & Key Laboratory of Pervasive Computing, Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658762070",
      "orcid": "0000-0001-8041-7962"
    },
    {
      "name": "Chen Wang",
      "institution": "Tsinghua University & Key Laboratory of Pervasive Computing, Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528869",
      "orcid": "missing"
    },
    {
      "name": "Xiaojun Bi",
      "institution": "Stony Brook University, Stony Brook, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485662",
      "orcid": "0000-0002-9716-7709"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Tsinghua University & Key Laboratory of Pervasive Computing, Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "2016. A note on calculating text entry speed. (2016). http://www.yorku.ca/mack/RN-TextEntrySpeed.html.",
      "doi": ""
    },
    {
      "text": "2016. American National Corpus. (2016). http://www.americannationalcorpus.org/OANC/index.html.",
      "doi": ""
    },
    {
      "text": "R.U. Ayres and K. Martinás. 2005. On the Reappraisal of Microeconomics: Economic Growth and Change in a Material World. Edward Elgar. https://books.google.com/books?id=ksxK7J95IF8C",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 251--260. DOI: http://dx.doi.org/10.1145/2371574.2371612",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Tyler Baldwin and Joyce Chai. 2012. Towards Online Adaptation and Personalization of Key-target Resizing for Mobile Devices. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, NY, NY, USA, 11--20. DOI: http://dx.doi.org/10.1145/2166966.2166969",
      "doi": "10.1145/2166966.2166969"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts Law: Modeling Finger Touch with Fitts' Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1363--1372. DOI: http://dx.doi.org/10.1145/2470654.2466180",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Stephen A. Brewster and Michael Hughes. 2009. Pressure-based Text Entry for Mobile Devices. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, NY, NY, USA, Article 9, 4 pages. DOI: http://dx.doi.org/10.1145/1613858.1613870",
      "doi": ""
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How We Type: Movement Strategies and Performance in Everyday Typing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4262--4273. DOI: http://dx.doi.org/10.1145/2858036.2858233",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Leah Findlater and Jacob Wobbrock. 2012. Personalized Input: Improving Ten-finger Touchscreen Typing Through Automatic Adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 815--824. DOI: http://dx.doi.org/10.1145/2207676.2208520",
      "doi": "10.1145/2207676.2208520"
    },
    {
      "text": "Leah Findlater, Jacob O. Wobbrock, and Daniel Wigdor. 2011. Typing on Flat Glass: Examining Ten-finger Expert Typing Patterns on Touch Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2453--2462. DOI: http://dx.doi.org/10.1145/1978942.1979301",
      "doi": "10.1145/1978942.1979301"
    },
    {
      "text": "Mayank Goel, Leah Findlater, and Jacob Wobbrock. 2012. WalkType: Using Accelerometer Data to Accomodate Situational Impairments in Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2687--2696. DOI: http://dx.doi.org/10.1145/2207676.2208662",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: Using Hand Posture Information to Improve Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2795--2798. DOI: http://dx.doi.org/10.1145/2470654.2481386",
      "doi": ""
    },
    {
      "text": "Jun Gong, Zheer Xu, Qifan Guo, Teddy Seyed, Xiang 'Anthony' Chen, Xiaojun Bi, and Xing-Dong Yang. 2018. WrisText: One-handed Text Entry on Smartwatch Using Wrist Gestures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 181, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173755",
      "doi": "10.1145/3173574.3173755"
    },
    {
      "text": "Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language Modeling for Soft Keyboards. In Proceedings of the 7th International Conference on Intelligent User Interfaces (IUI '02). ACM, NY, NY, USA, 194--195. DOI: http://dx.doi.org/10.1145/502716.502753",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Mitchell Gordon, Tom Ouyang, and Shumin Zhai. 2016. WatchWriter: Tap and Gesture Typing on a Smartwatch Miniature Keyboard with Statistical Decoding. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3817--3821. DOI: http://dx.doi.org/10.1145/2858036.2858242",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Aakar Gupta, Muhammed Anwar, and Ravin Balakrishnan. 2016. Porous Interfaces for Small Screen Multitasking Using Finger Identification. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 145--156. DOI: http://dx.doi.org/10.1145/2984511.2984557",
      "doi": "10.1145/2984511.2984557"
    },
    {
      "text": "Aakar Gupta and Ravin Balakrishnan. 2016. DualKey: Miniature Screen Text Entry via Finger Identification. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 59--70. DOI: http://dx.doi.org/10.1145/2858036.2858052",
      "doi": "10.1145/2858036.2858052"
    },
    {
      "text": "Johan Himberg, Jonna Häkkilä, Petri Kangas, and Jani Mäntyjärvi. 2003. On-line Personalization of a Touch Screen Based Keyboard. In Proceedings of the 8th International Conference on Intelligent User Interfaces (IUI '03). ACM, NY, NY, USA, 77--84. DOI: http://dx.doi.org/10.1145/604045.604061",
      "doi": "10.1145/604045.604061"
    },
    {
      "text": "Min-Chieh Hsiu, Da-Yuan Huang, Chi An Chen, Yu-Chih Lin, Yi-ping Hung, De-Nian Yang, and Mike Chen. 2016. ForceBoard: Using Force As Input Technique on Size-limited Soft Keyboard. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, NY, NY, USA, 599--604. DOI: http://dx.doi.org/10.1145/2957265.2961827",
      "doi": "10.1145/2957265.2961827"
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: Making a Touch Screen Keyboard More Touchable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 553--562. DOI: http://dx.doi.org/10.1145/2470654.2470733",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1Line Keyboard: A QWERTY Layout in a Single Line. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 461--470. DOI: http://dx.doi.org/10.1145/2047196.2047257",
      "doi": ""
    },
    {
      "text": "Yiqin Lu, Chun Yu, Shuyi Fan, Xiaojun Bi, and Yuanchun Shi. 2019. Typing on Split Keyboards with Peripheral Vision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 200, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300430",
      "doi": "10.1145/3290605.3300430"
    },
    {
      "text": "Yiqin Lu, Chun Yu, Xin Yi, Yuanchun Shi, and Shengdong Zhao. 2017. BlindType: Eyes-Free Text Entry on Handheld Touchpad by Leveraging Thumb's Muscle Memory. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 18 (June 2017), 24 pages. DOI: http://dx.doi.org/10.1145/3090083",
      "doi": "10.1145/3090083"
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754--755. DOI: http://dx.doi.org/10.1145/765891.765971",
      "doi": ""
    },
    {
      "text": "Dinesh Mandalapu and Sriram Subramanian. 2011. Exploring Pressure As an Alternative to Multi-touch Based Interaction. In Proceedings of the 3rd International Conference on Human Computer Interaction (IndiaHCI '11). ACM, NY, NY, USA, 88--92. DOI: http://dx.doi.org/10.1145/2407796.2407810",
      "doi": "10.1145/2407796.2407810"
    },
    {
      "text": "David C. McCallum, Edward Mak, Pourang Irani, and Sriram Subramanian. 2009. PressureText: Pressure Input for Mobile Phone Text Entry. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, NY, NY, USA, 4519--4524. DOI: http://dx.doi.org/10.1145/1520340.1520693",
      "doi": "10.1145/1520340.1520693"
    },
    {
      "text": "Paul Nation and Robert Waring. 1997. Vocabulary size, text coverage and word lists. Vocabulary: Description, acquisition and pedagogy 14 (1997), 6--19.",
      "doi": ""
    },
    {
      "text": "Weinan Shi, Chun Yu, Xin Yi, Zhen Li, and Yuanchun Shi. 2018. TOAST: Ten-Finger Eyes-Free Typing on Touchable Surfaces. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 33 (March 2018), 23 pages. DOI: http://dx.doi.org/10.1145/3191765",
      "doi": "10.1145/3191765"
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2003. Metrics for Text Entry Research: An Evaluation of MSD and KSPC, and a New Unified Error Metric. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/642611.642632",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "Keith Vertanen, Crystal Fletcher, Dylan Gaines, Jacob Gould, and Per Ola Kristensson. 2018. The Impact of Word, Multiple Word, and Sentence Input on Virtual Keyboard Decoding Performance. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 626, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174200",
      "doi": "10.1145/3173574.3174200"
    },
    {
      "text": "Keith Vertanen, Dylan Gaines, Crystal Fletcher, Alex M. Stanage, Robbie Watling, and Per Ola Kristensson. 2019. VelociWatch: Designing and Evaluating a Virtual Keyboard for the Input of Challenging Text. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 591, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300821",
      "doi": "10.1145/3290605.3300821"
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating Fast Mobile Text Entry Using Sentence-Based Decoding of Touchscreen Keyboard Input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 659--668. DOI: http://dx.doi.org/10.1145/2702123.2702135",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Feng Wang, Xiang Cao, Xiangshi Ren, and Pourang Irani. 2009. Detecting and Leveraging Finger Orientation for Interaction with Direct-touch Surfaces. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 23--32. DOI: http://dx.doi.org/10.1145/1622176.1622182",
      "doi": "10.1145/1622176.1622182"
    },
    {
      "text": "Daryl Weir, Henning Pohl, Simon Rogers, Keith Vertanen, and Per Ola Kristensson. 2014. Uncertain Text Entry on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2307--2316. DOI: http://dx.doi.org/10.1145/2556288.2557412",
      "doi": "10.1145/2556288.2557412"
    },
    {
      "text": "Graham Wilson, Stephen Brewster, and Martin Halvey. 2013. Towards Utilising One-handed Multi-digit Pressure Input. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 1317--1322. DOI: http://dx.doi.org/10.1145/2468356.2468591",
      "doi": ""
    },
    {
      "text": "Pui Chung Wong, Kening Zhu, and Hongbo Fu. 2018. FingerT9: Leveraging Thumb-to-finger Interaction for Same-side-hand Text Entry on Smartwatches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 178, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3173752",
      "doi": "10.1145/3173574.3173752"
    },
    {
      "text": "Hui-Shyong Yeo, Xiao-Shen Phang, Taejin Ha, Woontack Woo, and Aaron Quigley. 2017. TiTAN: Exploring Midair Text Entry Using Freehand Input. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 3041--3049. DOI: http://dx.doi.org/10.1145/3027063.3053228",
      "doi": "10.1145/3027063.3053228"
    },
    {
      "text": "Xin Yi, Chun Yu, Weinan Shi, Xiaojun Bi, and Yuanchun Shi. 2017b. Word Clarity As a Metric in Sampling Keyboard Test Sets. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4216--4228. DOI: http://dx.doi.org/10.1145/3025453.3025701",
      "doi": "10.1145/3025453.3025701"
    },
    {
      "text": "Xin Yi, Chun Yu, Weinan Shi, and Yuanchun Shi. 2017a. Is it too small?: Investigating the performances and preferences of users when typing on tiny QWERTY keyboards. International Journal of Human-Computer Studies 106 (2017), 44--62.",
      "doi": ""
    },
    {
      "text": "Xin Yi, Chun Yu, Mingrui Zhang, Sida Gao, Ke Sun, and Yuanchun Shi. 2015. ATK: Enabling Ten-Finger Freehand Typing in Air Based on 3D Hand Tracking Data. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 539--548. DOI: http://dx.doi.org/10.1145/2807442.2807504",
      "doi": "10.1145/2807442.2807504"
    },
    {
      "text": "Chun Yu, Yizheng Gu, Zhican Yang, Xin Yi, Hengliang Luo, and Yuanchun Shi. 2017. Tap, Dwell or Gesture?: Exploring Head-Based Text Entry Techniques for HMDs. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4479--4488. DOI: http://dx.doi.org/10.1145/3025453.3025964",
      "doi": "10.1145/3025453.3025964"
    },
    {
      "text": "Mingyuan Zhong, Chun Yu, Qian Wang, Xuhai Xu, and Yuanchun Shi. 2018. ForceBoard: Subtle Text Entry Leveraging Pressure. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 528, 10 pages. DOI: http://dx.doi.org/10.1145/3173574.3174102",
      "doi": "10.1145/3173574.3174102"
    },
    {
      "text": "Suwen Zhu, Tianyao Luo, Xiaojun Bi, and Shumin Zhai. 2018. Typing on an Invisible Keyboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 439, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174013",
      "doi": "10.1145/3173574.3174013"
    },
    {
      "text": "Suwen Zhu, Jingjie Zheng, Shumin Zhai, and Xiaojun Bi. 2019. I'sFree: Eyes-Free Gesture Typing via a Touch-Enabled Remote Control. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 448, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300678",
      "doi": "10.1145/3290605.3300678"
    }
  ]
}