{
  "doi": "10.1145/3313831.3376356",
  "title": "Digital Technology, Meditative and Contemplative Practices, and Transcendent Experiences",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Meditative and contemplative practices are common among U.S. adults, but the impact of digital technology use on these practices and on associated transcendent experiences is poorly understood. Through semi-structured interviews with sixteen experienced practitioners from a variety of traditions, we find that practitioners consider digital technology to be a mixed blessing. While they see its practical value, they are wary of its stimulation-based effects and find minimal usefulness in commercial meditation apps. They also feel that digital technology use may interfere with possible transcendent experiences. The practitioners, however, applied insights from their respective practices to strategically mitigate digital technology's negative effects in three ways: limiting its use to instrumental purposes, using technology interactions as grist for self-reflection, and integrating technology itself into a site for practice. Specific design recommendations are discussed.",
  "authors": [
    {
      "name": "Robert B. Markum",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529437",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Yoko Akama, Ann Light, Simon Bowen. 2017. Mindfulness and technology: Traces of a middle way. In DIS'17 Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, Edinburgh, UK, 345--355. https://doi.org/10.1145/3064663.3064752",
      "doi": "10.1145/3064663.3064752"
    },
    {
      "text": "Adam Alter. 2018. Irresistible: The Rise of Addictive Technology and the Business of Keeping Us Hooked. Penguin Books.",
      "doi": ""
    },
    {
      "text": "Lauren Artress. 2006. Walking a Sacred Path: Rediscovering the Labyrinth as a Spiritual Practice. Riverhead Books.",
      "doi": ""
    },
    {
      "text": "Joseph O. Baker. 2009. The Variety of Religious Experiences. Review of Religious Research 51, 1 (September), 39--54. https://www.jstor.org/stable/25593771",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In CHI '11 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver, BC, 2271--2274. https://doi.org/10.1145/1978942.1979275",
      "doi": ""
    },
    {
      "text": "Genevieve Bell. 2006. No more SMS from Jesus: Ubicomp, religion, and techno-spiritual practices. In UbiComp 2006: Ubiquitous Computing, 141--158. https://doi.org/10.1007/11853565_9",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Elizabeth Buie. 2014. User experience and the human spirit. In CHI EA ?14 Extended Abstracts of the 2014 Conference on Human Factors in Computing Systems. ACM, Toronto, ON, CA, 335--338. https://doi.org/10.1145/2559206.2559962",
      "doi": ""
    },
    {
      "text": "Elizabeth Buie and Mark Blythe. 2013. Spirituality: There's an app for that! (But not a lot of research). In CHI EA'13 Extended Abstracts of the 2013 Conference on Human Factors in Computing Systems. ACM, Paris, FR, 2315--2324. https://doi.org/10.1145/2468356.2468754",
      "doi": "10.1145/2468356.2468754"
    },
    {
      "text": "Nicholas Carr. 2011. The Shallows: What the Internet Is Doing to Our Brains. W.W. Norton.",
      "doi": "10.5555/1855023"
    },
    {
      "text": "Nicholas Carr. 2015. The Glass Cage: How Computers Are Changing Us. W.W. Norton.",
      "doi": ""
    },
    {
      "text": "Alice Chirico, David B. Yaden. Giuseppe Riva, and Andrea Gaggioli. 2016. The potential of virtual reality for the investigation of awe. Frontiers in Psychology 7 (November), Article 1776, 1--6. https://doi.org/10.3389/fpsyg.2016.01766",
      "doi": ""
    },
    {
      "text": "Thomas Cleary. 1997. Kensho: The Heart of Zen. Shambhala Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Karen Anne Cochrane, Lian Loke, Caitilin de Bérigny, and Andrew Campbell. 2018. Sounds in the moment: designing an interactive EEG nature soundscape for novice mindfulness meditators. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI '18). ACM, New York, NY, USA, 298--302. https://doi.org/10.1145/3292147.3292215",
      "doi": "10.1145/3292147.3292215"
    },
    {
      "text": "Irene Cristofori, Joseph Bulbulia, John H. Shaver, Marc Wilson, Frank Krueger, and Jordan Grafman. 2016. Neural correlates of mystical experience. Neuropsychologia 80 (2016), 212--220. http://dx.doi.org/10.1016/j.neuropsychologia.2015.11.021",
      "doi": ""
    },
    {
      "text": "Eugene d'Aquili and Andrew Newberg. The neuropsychology of aesthetic, spiritual, and mystical states. Zygon® 35, 1 (Mar. 2000), 39--51. https://doi.org/10.1111/0591--2385.00258",
      "doi": ""
    },
    {
      "text": "Antoinette Elizabeth DeNapoli. 2017. \"Dharm is technology': The theologizing of technology in the experimental Hinduism of renouncers in contemporary North India. International Journal of Dharma Studies 5, 18 (July 2017), 36 pages. https://doi.org/10.1186/s40613-017-0053-0",
      "doi": ""
    },
    {
      "text": "Katie Derthick. 2014. Exploring meditation and technology to problematize the use-or-non-use binary. In Proceedings of Refusing, Limiting, Departing: A CHI 2014 Workshop Considering Why We Should Study Technology Non-Use. http://nonuse.jedbrubaker.com/proceedings/",
      "doi": ""
    },
    {
      "text": "Katie Derthick. 2014. Understanding meditation and technology use. In CHI EA \"14 Extended Abstracts of the 2014 Conference on Human Factors in Computing Systems. ACM, Toronto, ON, CA, 2275--2280. https://doi.org/10.1145/2559206.2581368",
      "doi": ""
    },
    {
      "text": "Roland Fischer. 1971. A cartography of ecstatic and meditative states. Science 174, 4012 (Nov. 1971), 897--904. https://doi.org/10.1126/science.174.4012.897",
      "doi": ""
    },
    {
      "text": "Jayne Gackenbach and Jim Karpen. 2007. The internet and higher states of consciousness - A transpersonal perspective.\" In Psychology and the Internet: Intrapersonal, Interpersonal, and Transpersonal Implications, edited by Jayne Gackenbach. Academic Press, 337--360. https://doi.org/10.1016/B978-012369425--6/50032--1",
      "doi": ""
    },
    {
      "text": "Jayne Gackenbach, Dan Swanston, and Hannah Stark. 2015. Effects of video game play versus meditation/prayer in waking and dreaming experiences. The Journal of Transpersonal Psychology 47, 2 (2015), 188--218.",
      "doi": ""
    },
    {
      "text": "Jayne Gackenbach and Sarkis Hakopdjanian. 2016. Breaking the frame of digital, dream, and waking realities. In Exploring the Collective Unconscious in the Age of Digital Media, ed. Stephen Schafer. IGI Global, 79--106. https://doi.org/10.4018/978--1--5225--5469--1.ch067",
      "doi": ""
    },
    {
      "text": "Albert Garcia-Romeu, Samuel P. Himelstein, and Jacob Kaminker. 2015. Self-transcendent experience: A grounded theory study. Qualitative Research 15, 5 (Oct. 2015), 633--654. https://doi.org/10.1177/1468794114550679",
      "doi": ""
    },
    {
      "text": "William Gaver, Mark Blythe, Andy Boucher, Nadine Jarvis, John Bowers, and Peter Wright. 2010. The Prayer Companion: Openness and specificity, materiality and spirituality. In Proceedings of the 28th International Conference on Human Factors in Computing Systems - CHI '10. https://doi.org/10.1145/1753326.1753640",
      "doi": "10.1145/1753326.1753640"
    },
    {
      "text": "Adam Gazzaley. 2016. The Distracted Mind: Ancient Brains in a High-Tech World. MIT Press.",
      "doi": ""
    },
    {
      "text": "Joseph Goldstein and Jack Kornfield. 1987. Seeking the Heart of Wisdom: The Path of Insight Meditation. Shambhala Publications.",
      "doi": ""
    },
    {
      "text": "Tian Hao, Chongguang Bi, Guoliang Xing, Roxane Chan, and Linlin Tu. 2017. MindfulWatch: A smartwatch-based system for real-time respiration monitoring during meditation. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies. 1, 3, Article 57 (September 2017), 19 pages. https://doi.org/10.1145/3130922",
      "doi": "10.1145/3130922"
    },
    {
      "text": "Alistair Hardy. 1979. The Spiritual Nature of Man: A Study of Contemporary Religious Experience. Clarendon Press.",
      "doi": ""
    },
    {
      "text": "Paul Hitlin. 2018. Internet, social media use and device ownership in U.S. have plateaued after years of growth. Pew Research Center. (28 September 2018). https://www.pewresearch.org/fact-tank/2018/09/28/internet-social-media-use-and-device-ownership-in-u-s-have-plateaued-after-years-of-growth/",
      "doi": ""
    },
    {
      "text": "William James. [1902] 1917. The Varieties of Religious Experience. Longmans, Green, and Co.",
      "doi": ""
    },
    {
      "text": "Jingjing Jiang. Millennials stand out for their technology use, but older generations also embrace digital life. Pew Research Center. (2 May 2018). https://www.pewresearch.org/fact-tank/2018/05/02/millennials-stand-out-for-their-technology-use-but-older-generations-also-embrace-digital-life/",
      "doi": ""
    },
    {
      "text": "Philip Kapleau. 2000. The Three Pillars of Zen: Teaching, Practice, and Enlightenment. Anchor Books.",
      "doi": ""
    },
    {
      "text": "Nicholas Kardaras. 2016. Glow Kids: How Screen Addiction is Hijacking Our Kids - and How to Break the Trance. St. Martin's Press.",
      "doi": "10.5555/3002866"
    },
    {
      "text": "Thrasyvoulos Karydis, Samuel Langer, Simmie L. Foster, and Andreas Mershin. 2018. Identification of post-meditation perceptual states using wearable EEG and Self-Calibrating Protocols. In Proceedings of the 11th Pervasive Technologies Related to Assistive Environments Conference (PETRA '18). ACM, New York, NY, USA, 566--569. https://doi.org/10.1145/3197768.3201544",
      "doi": "10.1145/3197768.3201544"
    },
    {
      "text": "Thomas R. Kelly. 1996. A Testament of Devotion (Reprint Edition). HarperCollins Publishers.",
      "doi": ""
    },
    {
      "text": "Anette Kjellgren and Anders Eriksson. 2010. Altered states during shamanic drumming: A phenomenological study. International Journal of Transpersonal Studies 29, 2 (July), Article 3: 1- 10. http://dx.doi.org/10.24972/ijts.2010.29.2.1",
      "doi": ""
    },
    {
      "text": "Ilkka Kosunen, Mikko Salminen, Simo Järvelä, Antti Ruonala, Niklas Ravaja, and Giulio Jacucci. 2016. RelaWorld: Neuroadaptive and immersive virtual reality meditation system. In IUI '16 Proceedings of the 21st International Conference on Intelligent User Interfaces. ACM, Sonoma, CA, 208--217. https://doi.org/10.1145/2856767.2856796",
      "doi": "10.1145/2856767.2856796"
    },
    {
      "text": "Jari Laarni, Niklas Ravaja, Kari Kallinen, and Timo Saari. 2004. Transcendent experience in the use of computer-based media. In Proceedings of the third Nordic conference on Human-computer interaction (NordiCHI '04). ACM, New York, NY, USA, 409--412. https://doi.org/10.1145/1028014.1028082",
      "doi": "10.1145/1028014.1028082"
    },
    {
      "text": "Kep Kee Loh and Ryota Kanai. 2016. How has the internet reshaped human cognition? The Neuroscientist 22, 5 (Oct. 2016), 506--520. https://doi.org/10.1177/1073858415595005",
      "doi": ""
    },
    {
      "text": "Abraham Maslow. 1964. Religions, Values, and Peak Experiences. Penguin Books Limited.",
      "doi": ""
    },
    {
      "text": "Bernard McGinn, ed. 2006. The Essential Writings of Christian Mysticism. Random House.",
      "doi": ""
    },
    {
      "text": "Swami Muktananda. 2001. Play of Consciousness, 3rd. ed. Siddha Yoga Publications.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin and Madhu Kumar. 2019. About three-in-ten U.S. adults say they are 'almost constantly' online. Pew Research Center. (25 July 2019). https://www.pewresearch.org/fact-tank/2019/07/25/americans-going-online-almost-constantly/",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2009. Many Americans mix multiple faiths. https://www.pewforum.org/2009/12/09/many-americans-mix-multiple-faiths/",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2014. Religious landscape study, frequency of meditation. https://www.pewforum.org/religious-landscape-study/frequency-of-meditation/",
      "doi": ""
    },
    {
      "text": "Andrea M. Pisa, George Chernyshov, Andriana F. Nassou, and Kai Kunze. 2017. Towards interactive mindfulness training using breathing based feedback. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 688--692. https://doi.org/10.1145/3123024.3129268",
      "doi": "10.1145/3123024.3129268"
    },
    {
      "text": "Wayne Proudfoot. 1985. Religious Experience. University of California Press.",
      "doi": ""
    },
    {
      "text": "Mirjana Prpa, Kıvanç Tatar, Jules Françoise, Bernhard Riecke, Thecla Schiphorst, and Philippe Pasquier. 2018. Attending to breath: Exploring how the cues in a virtual environment guide the attention to breath and shape the quality of experience to support mindfulness. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 71--84. https://doi.org/10.1145/3196709.3196765",
      "doi": "10.1145/3196709.3196765"
    },
    {
      "text": "Antti Revonsuo. 2009. Altered and exceptional states of consciousness. In Encyclopedia of Consciousness, ed. William P. Banks. Elsevier, 9--21.",
      "doi": ""
    },
    {
      "text": "Gelek Rimpoche. 2005. Gom: A Course in Meditation. Jewel Heart Tibetan Buddhist Center.",
      "doi": ""
    },
    {
      "text": "Khenpo Karthar Rinpoche. 2011. Dharma Paths. Trans. Ngödup Burkhar and Chöjor Radha. Ed. Laura Roth. Snow Lion Publications.",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting inner states to a mixed reality sandbox for mindfulness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1459--1470. https://doi.org/10.1145/3025453.3025743",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2018. Evaluating mindfulness meditation apps. In CHI EA '18 Extended Abstracts of the 2018 Conference on Human Factors in Computing Systems. ACM, Montreal, QC, CA. https://doi.org/10.1145/3170427.3188616",
      "doi": ""
    },
    {
      "text": "Kenneth Rose. 2016. Yoga, Meditation, and Mysticism: Contemplative Universals and Meditative Landmarks. Bloomsbury Academic.",
      "doi": ""
    },
    {
      "text": "Corina Sas and Rohit Chopra. 2015. MeditAid: a wearable adaptive neurofeedback-based system for training mindfulness state. Personal Ubiquitous Computing. 19, 7 (October 2015), 1169--1182. https://doi.org/10.1007/s00779-015-0870-z",
      "doi": "10.1007/s00779-015-0870-z"
    },
    {
      "text": "Jacek Sliwinski, Mary Katsikitis, and Christian Martyn Jones. 2015. Mindful gaming. How digital games can improve mindfulness. In Human-Computer Interaction - INTERACT 2015, Proceedings Part III, ed. by Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler. Springer. https://doi.org/10.1007/978--3--319--22698--9_12",
      "doi": "10.1007/978-3-319-22698-9_12"
    },
    {
      "text": "Jacek Sliwinski, Mary Katsikitis, and Christian Martyn Jones. 2017. A review of interactive technologies as support tools for the cultivation of mindfulness. Mindfulness 8, 5 (Oct. 2017), 1150--1159. https://doi.org/10.1007/s12671-017-0698-x",
      "doi": ""
    },
    {
      "text": "Jacek Sliwinski, Mary Katsikitis, and Christian Martyn Jones. 2018. Designing and evaluating games for mindfulness. Computers in Entertainment (CIE) - Theoretical and Practical Computer Applications in Entertainment. 16, 3, Article 5 (September 2018), 15 pages. https://doi.org/10.1145/3236496",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The Soma Mat and Breathing Light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'16). ACM, New York, NY, USA, 305--308. https://doi.org/10.1145/2851581.2889464",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Keisuke Suzuki, Warrick Roseboom, David J. Schwartzman, and Anil K. Seth. 2017. A deep-dream virtual reality platform for studying altered perceptual phenomenology. Scientific Reports 7 (November), Article 15982, 1--11. https://doi.org/10.1038/s41598-017--16316--2",
      "doi": ""
    },
    {
      "text": "Shunryū Suzuki. 1982. Zen Mind, Beginner's Mind. Edited by Trudy Dixon. Weatherhill.",
      "doi": ""
    },
    {
      "text": "Ann Taves. 2009. Religious Experience Reconsidered: A Building Block Approach to the Study of Religion and Other Special Things. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "St. Teresa of Avila. 2003. The Interior Castle. Trans. Mirabai Starr. Riverhead Books.",
      "doi": ""
    },
    {
      "text": "Melina R. Uncapher and Anthony D. Wagner. 2018. Minds and brains of media multitaskers: Current findings and future directions. PNAS 115, 40 (October), 9889--9896. https://doi.org/10.1073/pnas.1611612115",
      "doi": ""
    },
    {
      "text": "Evelyn Underhill. [1911] 2002. Mysticism: A Study of the Nature and Development of Man's Spiritual Consciousness. Dover Publications.",
      "doi": ""
    },
    {
      "text": "Ralph Vacca. 2016. Designing for interactive loving and kindness meditation on mobile. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1772--1778. https://doi.org/10.1145/2851581.2892396",
      "doi": "10.1145/2851581.2892396"
    },
    {
      "text": "Jonathan Weinel. 2018. Inner Sound: Altered States of Consciousness in Electronic Music and Audio-Visual Media. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Henry H. Wilmer, Lauren E. Sherman, and Jason M. Chein. 2017. Smartphones and cognition: A review of the links between mobile technology habits and cognitive functioning. Frontiers in Psychology 8, 605 (April 2017), 1--16. https://doi.org/10.3389/fpsyg.2017.00605",
      "doi": ""
    },
    {
      "text": "Maryanne Wolf. 2018. Reader, Come Home: The Reading Brain in a Digital World. Harper.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: 'It's like Mixing technology and religion.' In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '07. https://doi.org/10.1145/1240624.1240710",
      "doi": ""
    },
    {
      "text": "David Brice Yaden, Jonathan Haidt, Ralph W. Hood Jr., David R. Vago, Andrew B. Newberg. 2017. The varieties of self-transcendent experience. Review of General Psychology 21, 2 (June 2017), 143--160. https://doi.org/10.1037/gpr0000102",
      "doi": ""
    },
    {
      "text": "Paramahansa Yogananda. 2015. Autobiography of a Yogi. Self-Realization Fellowship.",
      "doi": ""
    },
    {
      "text": "Bin Zhu, Anders Hedman, and Haibo Li. 2017. Designing digital mindfulness: Presence-in and presence-with versus presence-through. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, CO, 2685--2695. https://doi.org/10.1145/3025453.3025590",
      "doi": "10.1145/3025453.3025590"
    },
    {
      "text": "David A. Ziegler, Joyti Mishra, and Adam Gazzaley. 2015. The acute and chronic impact of technology on our brain. In The Wiley Handbook of Psychology, Technology, and Society, 1st. ed., ed. by Larry D. Rosen, Nancy A. Cheever, and L. Mark Carrier. John Wiley & Sons Ltd. Publishing, 3--19. https://doi.org/10.1002/9781118771952.ch1",
      "doi": ""
    }
  ]
}