{
  "doi": "10.1145/3313831.3376691",
  "title": "ScrAPIr: Making Web Data APIs Accessible to End Users",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Users have long struggled to extract and repurpose data from websites by laboriously copying or scraping content from web pages. An alternative is to write scripts that pull data through APIs. This provides a cleaner way to access data than scraping; however, APIs are effortful for programmers and nigh-impossible for non-programmers to use. In this work, we empower users to access APIs without programming. We evolve a schema for declaratively specifying how to interact with a data API. We then develop ScrAPIr: a standard query GUI that enables users to fetch data through any API for which a specification exists, and a second GUI that lets users author and share the specification for a given API. From a lab evaluation, we find that even non-programmers can access APIs using ScrAPIr, while programmers can access APIs 3.8 times faster on average using ScrAPIr than using programming.",
  "tags": [
    "web apis",
    "api description language",
    "web scraping"
  ],
  "authors": [
    {
      "name": "Tarfah Alrashed",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659045602",
      "orcid": "missing"
    },
    {
      "name": "Jumana Almahmoud",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704954",
      "orcid": "missing"
    },
    {
      "name": "Amy X. Zhang",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640424",
      "orcid": "0000-0001-9462-9835"
    },
    {
      "name": "David R. Karger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100337812/rel-imgonly/square-photo-2.0569-17-centered.jpg",
      "acmid": "81100337812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apify. 2019. Apify Web Scraper. (2019). Retrieved November 17, 2019 from https://apify.com/apify/web-scraper",
      "doi": ""
    },
    {
      "text": "Arvind Arasu and Hector Garcia-Molina. 2003. Extracting structured data from web pages. In Proceedings of the 2003 ACM SIGMOD international conference on Management of data. ACM, 337--348.",
      "doi": "10.1145/872757.872799"
    },
    {
      "text": "Sören Auer, Christian Bizer, Georgi Kobilarov, Jens Lehmann, Richard Cyganiak, and Zachary Ives. 2007. Dbpedia: A nucleus for a web of open data. In The semantic web. Springer, 722--735.",
      "doi": "10.5555/1785162.1785216"
    },
    {
      "text": "Tim Berners-Lee, James Hendler, Ora Lassila, and others. 2001. The semantic web. Scientific American 284, 5 (2001), 28--37.",
      "doi": ""
    },
    {
      "text": "API Blueprint. 2019. (2019). Retrieved August 10, 2019 from https://apiblueprint.org",
      "doi": ""
    },
    {
      "text": "Kerry Shih-Ping Chang and Brad A Myers. 2017. Gneiss: spreadsheet programming using structured web service data. Journal of Visual Languages & Computing 39 (2017), 41--50.",
      "doi": "10.1016/j.jvlc.2016.07.004"
    },
    {
      "text": "Kerry Shih-Ping Chang, Brad A Myers, Gene M Cahill, Soumya Simanta, Edwin Morris, and Grace Lewis. 2013. A plug-in architecture for connecting to new data sources on mobile devices. In 2013 IEEE Symposium on Visual Languages and Human Centric Computing. IEEE, 51--58.",
      "doi": ""
    },
    {
      "text": "Sarah E Chasins, Maria Mueller, and Rastislav Bodik. 2018. Rousillon: Scraping Distributed Hierarchical Web Data. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 963--975.",
      "doi": "10.1145/3242587.3242661"
    },
    {
      "text": "Roberto Chinnici, M Gudgin, JJ Moreau, and S Weerawarana. 2004. Web Services Description Language (WSDL) Version 2.0 Part 1: Core Language. W3C Working Draft. World Wide Web Consortium (2004).",
      "doi": ""
    },
    {
      "text": "Marco Cremaschi and Flavio De Paoli. 2017. Toward automatic semantic API descriptions to support services composition. In European Conference on Service-Oriented and Cloud Computing. Springer, 159--167.",
      "doi": ""
    },
    {
      "text": "Jos de Jong. 2019. JsonEditor. (2019). Retrieved June 1, 2019 from http://jsoneditoronline.org",
      "doi": ""
    },
    {
      "text": "Li Ding, Tim Finin, Anupam Joshi, Rong Pan, R Scott Cost, Yun Peng, Pavan Reddivari, Vishal Doshi, and Joel Sachs. 2004. Swoogle: a search and metadata engine for the semantic web. In Proceedings of the thirteenth ACM international conference on Information and knowledge management. ACM, 652--659.",
      "doi": "10.1145/1031171.1031289"
    },
    {
      "text": "GraphQL. 2019. GraphQL. (2019). Retrieved August 1, 2019 from https://graphql.org",
      "doi": ""
    },
    {
      "text": "Apis Guru. 2019a. OpenAPI Directory. (2019). Retrieved June 1 from https://apis.guru/openapi-directory/",
      "doi": ""
    },
    {
      "text": "GraphQL APIs Guru. 2019b. GraphQL Voyager. (2019). Retrieved March 31, 2019 from https://apis.guru/graphql-voyager",
      "doi": ""
    },
    {
      "text": "Marc Hadley. 2009. Web application description language. World Wide Web Consortium Member Submission SUBM-wadl-20090831 (2009).",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Leslie Wu, Kevin Collins, and Scott R Klemmer. 2007. Programming by a sample: rapidly creating web applications with d. mix. In Proceedings of the 20th annual ACM symposium on User interface software and technology. ACM, 241--250.",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Patrick Hoefler, Michael Granitzer, Eduardo E Veas, and Christin Seifert. 2014. Linked Data Query Wizard: A Novel Interface for Accessing SPARQL Endpoints. In LDOW.",
      "doi": ""
    },
    {
      "text": "Adrian Holovaty. 2005. ChicagoCrime. org. Available at http (2005).",
      "doi": ""
    },
    {
      "text": "Mohammed Kayed and Chia-Hui Chang. 2010. FiVaTech: Page-level web data extraction from template pages. IEEE transactions on knowledge and data engineering 22, 2 (2010), 249--263.",
      "doi": ""
    },
    {
      "text": "Nicholas Kushmerick. 2000. Wrapper induction: Efficiency and expressiveness. Artificial intelligence 118, 1--2 (2000), 15--68.",
      "doi": ""
    },
    {
      "text": "Markus Lanthaler and Christian Gütl. 2012. On using JSON-LD to create evolvable RESTful services. In Proceedings of the Third International Workshop on RESTful Design. ACM, 25--32.",
      "doi": "10.1145/2307819.2307827"
    },
    {
      "text": "James Lin, Jeffrey Wong, Jeffrey Nichols, Allen Cypher, and Tessa A Lau. 2009. End-user programming of mashups with vegemite. In Proceedings of the 14th international conference on Intelligent user interfaces. ACM, 97--106.",
      "doi": "10.1145/1502650.1502667"
    },
    {
      "text": "Greg Little, Tessa A Lau, Allen Cypher, James Lin, Eben M Haber, and Eser Kandogan. 2007. Koala: capture, share, automate, personalize business processes on the web. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 943--946.",
      "doi": "10.1145/1240624.1240767"
    },
    {
      "text": "Ben McIntyre. 2019. SlickGrid. (2019). Retrieved June 1, 2019 from http://slickgrid.net",
      "doi": ""
    },
    {
      "text": "Lauren Murphy, Mary Beth Kery, Oluwatosin Alliyu, Andrew Macvean, and Brad A Myers. 2018. API Designers in the Field: Design Practices and Challenges for Creating Usable APIs. In 2018 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 249--258.",
      "doi": ""
    },
    {
      "text": "Brad A Myers and Jeffrey Stylos. 2016. Improving API usability. Commun. ACM 59, 6 (2016), 62--69.",
      "doi": "10.1145/2896587"
    },
    {
      "text": "Bonnie A Nardi. 1993. A small matter of programming: perspectives on end user computing. MIT press.",
      "doi": "10.5555/160165"
    },
    {
      "text": "Node-RED. 2013. (2013). Retrieved August 15, 2019 from https://nodered.org",
      "doi": ""
    },
    {
      "text": "Marco Piccioni, Carlo A Furia, and Bertrand Meyer. 2013. An empirical study of API usability. In 2013 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement. IEEE, 5--14.",
      "doi": ""
    },
    {
      "text": "Postman. 2019. Postman. (2019). Retrieved August 10, 2019 from https://www.getpostman.com",
      "doi": ""
    },
    {
      "text": "ProgrammableWeb. 2005. ProgrammableWeb Search Category. (2005). Retrieved September 1, 2019 from https://www.programmableweb.com",
      "doi": ""
    },
    {
      "text": "Mark Pruett. 2007. Yahoo! pipes. O'Reilly.",
      "doi": ""
    },
    {
      "text": "Paul Rademacher. 2005. HousingMaps. Available at http://www.housingmaps.com (2005).",
      "doi": ""
    },
    {
      "text": "RAML. 2019. RAML. (2019). Retrieved August 10, 2019 from https://raml.org",
      "doi": ""
    },
    {
      "text": "RapidAPI. 2019. RapidAPI. (2019). Retrieved November 17, 2019 from https://rapidapi.com",
      "doi": ""
    },
    {
      "text": "Leonard Richardson. 2007. Beautiful soup documentation. April (2007).",
      "doi": ""
    },
    {
      "text": "Christopher Scaffidi. 2006. Why are APIs difficult to learn and use? Crossroads 12, 4 (2006), 4--4.",
      "doi": "10.1145/1144359.1144363"
    },
    {
      "text": "A Scrapy. 2016. Fast and powerful scraping and web crawling framework. Scrapy. org. Np (2016).",
      "doi": ""
    },
    {
      "text": "Swagger Specification. 2019. OpenAPI Specification. (2019). Retrieved August 15, 2019 from https://swagger.io/specification",
      "doi": ""
    },
    {
      "text": "Swagger. 2019. Swagger. (2019). Retrieved August 10, 2019 from https://swagger.io",
      "doi": ""
    },
    {
      "text": "TimeYourWeb. 2019. TimeYourWeb. (2019). Retrieved March 31, 2019 from https://www.timeyourweb.com",
      "doi": ""
    },
    {
      "text": "Max Van Kleek, Daniel A Smith, Heather S Packer, Jim Skinner, and Nigel R Shadbolt. 2013. Carpé data: supporting serendipitous data integration in personal information management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2339--2348.",
      "doi": "10.1145/2470654.2481324"
    },
    {
      "text": "Jeffrey Wong and Jason I Hong. 2007. Making mashups with marmite: towards end-user programming for the web. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1435--1444.",
      "doi": "10.1145/1240624.1240842"
    },
    {
      "text": "Minhaz Zibran. 2008. What makes APIs difficult to use. International Journal of Computer Science and Network Security 8, 4 (2008), 255--261.",
      "doi": ""
    }
  ]
}