{
  "doi": "10.1145/3313831.3376722",
  "title": "Creating Augmented and Virtual Reality Applications: Current Practices, Challenges, and Opportunities",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Augmented Reality (AR) and Virtual Reality (VR) devices are becoming easier to access and use, but the barrier to entry for creating AR/VR applications remains high. Although the recent spike in HCI research on novel AR/VR tools is promising, we lack insights into how AR/VR creators use today's state-of-the-art authoring tools as well as the types of challenges that they face. We interviewed 21 AR/VR creators, which we grouped into hobbyists, domain experts, and professional designers. Despite having a variety of motivations and skillsets, they described similar challenges in designing and building AR/VR applications. We synthesize 8 key barriers that AR/VR creators face nowadays, starting from prototyping the initial experiences to dealing with \"the many unknowns\" during implementation, to facing difficulties in testing applications. Based on our analysis, we discuss the importance of considering end-user developers as a growing population of AR/VR creators, how we can build learning opportunities into AR/VR tools, and the need for building AR/VR toolchains that integrate debugging and testing.",
  "authors": [
    {
      "name": "Narges Ashtari",
      "institution": "Simon Fraser University, Burnaby, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527687",
      "orcid": "missing"
    },
    {
      "name": "Andrea Bunt",
      "institution": "University of Manitoba, Winnipeg, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232130",
      "orcid": "0000-0002-7374-7629"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Michael Nebeling",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640607",
      "orcid": "0000-0003-3743-2387"
    },
    {
      "name": "Parmit K. Chilana",
      "institution": "Simon Fraser University, Burnaby, BC, Canada",
      "img": "/do/10.1145/contrib-81416609224/rel-imgonly/parmit2015linkedin.jpg",
      "acmid": "81416609224",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Foundations and Trends® in Human--Computer Interaction 8, 2--3: 73-- 272. https://doi.org/10.1561/1100000049",
      "doi": ""
    },
    {
      "text": "Barry Boehm, Bradford Clark, Ellis Horowitz, Chris Westland, Ray Madachy, and Richard Selby. 1995. Cost models for future software life cycle processes: COCOMO 2.0. Annals of Software Engineering 1, 1: 57--94. https://doi.org/10.1007/BF02249046",
      "doi": ""
    },
    {
      "text": "John Bucher. 2017. Storytelling for Virtual Reality: Methods and Principles for Crafting Immersive Narratives. Routledge, New York and London?: Routledge, Taylor & Francis Group, 2018. https://doi.org/10.4324/9781315210308",
      "doi": ""
    },
    {
      "text": "Andrea Bunt, Cristina Conati, and Joanna McGrenere. 2004. What role can adaptive support play in an adaptable system? In Proceedings of the 9th international conference on Intelligent user interface IUI '04, 117. https://doi.org/10.1145/964442.964465",
      "doi": "10.1145/964442.964465"
    },
    {
      "text": "Margaret Burnett, Curtis Cook, and Gregg Rothermel. 2004. End-user software engineering. Communications of the ACM 47, 9: 53. https://doi.org/10.1145/1015864.1015889",
      "doi": "10.1145/1015864.1015889"
    },
    {
      "text": "John M. Carroll. 1990. The Nurnberg Funnel: Designing Minimalist Instruction for Practical Computer Skill. MIT Press. Retrieved from https://books.google.ca/books?id=lKcmAAAAMAAJ",
      "doi": "10.5555/80371"
    },
    {
      "text": "Yan Chen, Sang Won Lee, Yin Xie, YiWei Yang, Walter S. Lasecki, and Steve Oney. 2017. Codeon: OnDemand Software Development Assistance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6220--6231.",
      "doi": "10.1145/3025453.3025972"
    },
    {
      "text": "Parmit K. Chilana, Celena Alcock, Shruti Dembla, Anson Ho, Ada Hurst, Brett Armstrong, and Philip J. Guo. 2015. Perceptions of non-CS majors in intro programming: The rise of the conversational programmer. In 2015 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 251--259. https://doi.org/10.1109/VLHCC.2015.7357224",
      "doi": ""
    },
    {
      "text": "Juliet M. Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative Sociology 13, 1: 3--21. https://doi.org/10.1007/BF00988593",
      "doi": "10.1007/bf00988593"
    },
    {
      "text": "Sarah D'Angelo and Andrew Begel. 2017. Improving Communication Between Pair Programmers Using Shared Gaze Awareness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 6245--6290. https://doi.org/10.1145/3025453.3025573",
      "doi": "10.1145/3025453.3025573"
    },
    {
      "text": "Arindam Dey, Mark Billinghurst, Robert W. Lindeman, and J. Edward Swan. 2018. A Systematic Review of 10 Years of Augmented Reality Usability Studies: 2005 to 2014. Frontiers in Robotics and AI 5: 37. https://doi.org/10.3389/frobt.2018.00037",
      "doi": ""
    },
    {
      "text": "Brian Dorn and Mark Guzdial. 2010. Learning on the job: characterizing the programming knowledge and learning strategies of web designers. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, 703. https://doi.org/10.1145/1753326.1753430",
      "doi": "10.1145/1753326.1753430"
    },
    {
      "text": "Tristan C. Endsley, Kelly A. Sprehn, Ryan M. Brill, Kimberly J. Ryan, Emily C. Vincent, and James M. Martin. 2017. Augmented Reality Design Heuristics: Designing for Dynamic Interactions. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 61, 1: 2100--2104. https://doi.org/10.1177/1541931213602007",
      "doi": ""
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2010. Beyond performance: Feature awareness in personalized interfaces. International Journal of Human-Computer Studies 68, 3: 121--137. https://doi.org/10.1016/j.ijhcs.2009.10.002",
      "doi": "10.1016/j.ijhcs.2009.10.002"
    },
    {
      "text": "Maribeth Gandy and Blair MacIntyre. 2014. Designer's augmented reality toolkit, ten years later: implications for new media authoring tools. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14, 627--636. https://doi.org/10.1145/2642918.2647369",
      "doi": "10.1145/2642918.2647369"
    },
    {
      "text": "Max Goldman, Greg Little, and Robert C. Miller. 2011. Collabode: collaborative coding in the browser. In Proceedings of the 4th international workshop on Cooperative and human aspects of software engineering, 65--68.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Chester Fitchett. 2001. Phidgets: easy development of physical interfaces through physical widgets. In Proceedings of the 14th annual ACM symposium on User interface software and technology - UIST '01, 209. https://doi.org/10.1145/502348.502388",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Tovi Grossman, George Fitzmaurice, and Ramtin Attar. 2009. A survey of software learnability: metrics, methodologies and guidelines. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09, 649. https://doi.org/10.1145/1518701.1518803",
      "doi": "10.1145/1518701.1518803"
    },
    {
      "text": "Mark Guzdial. 2015. Learner-Centered Design of Computing Education: Research on Computing for Everyone. Synthesis Lectures on Human-Centered Informatics 8, 6: 1--165. https://doi.org/10.2200/S00684ED1V01Y201511HCI0",
      "doi": ""
    },
    {
      "text": "Taejin Ha, Woontack Woo, Youngho Lee, Junhun Lee, Jeha Ryu, Hankyun Choi, and Kwanheng Lee. 2010. ARtalet: Tangible User Interface Based Immersive Augmented Reality Authoring Tool for Digilog Book. In 2010 International Symposium on Ubiquitous Virtual Reality, 40--43. https://doi.org/10.1109/ISUVR.2010.20",
      "doi": ""
    },
    {
      "text": "Hirokazu Kato and Mark Billinghurst. 1999. Marker tracking and HMD calibration for a video-based augmented reality conferencing system. In Proceedings 2nd IEEE and ACM International Workshop on Augmented Reality (IWAR'99), 85--94. https://doi.org/10.1109/IWAR.1999.803809",
      "doi": "10.5555/857202.858134"
    },
    {
      "text": "Kimia Kiani, George Cui, Andrea Bunt, Joanna McGrenere, and Parmit K. Chilana. 2019. Beyond \"One-Size-Fits-All\": Understanding the Diversity in How Software Newcomers Discover and Make Use of Help Resources. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--14. https://doi.org/10.1145/3290605.3300570",
      "doi": ""
    },
    {
      "text": "Amy J. Ko and Brad A. Myers. 2004. Designing the whyline: a debugging interface for asking questions about program behavior. In Proceedings of the 2004 conference on Human factors in computing systems CHI '04, 151--158. https://doi.org/10.1145/985692.985712",
      "doi": ""
    },
    {
      "text": "Amy J. Ko, Brad A. Myers, Mary Beth Rosson, Gregg Rothermel, Mary Shaw, Susan Wiedenbeck, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, and Henry Lieberman. 2011. The state of the art in end-user software engineering. ACM Computing Surveys 43, 3: 1--44. https://doi.org/10.1145/1922649.1922658",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--17. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Gun A. Lee and Gerard J. Kim. 2009. Immersive authoring of Tangible Augmented Reality content: A user study. Journal of Visual Languages & Computing 20, 2: 61--79. https://doi.org/10.1016/j.jvlc.2008.07.001",
      "doi": "10.1016/j.jvlc.2008.07.001"
    },
    {
      "text": "Gun A. Lee, Gerard J. Kim, and Mark Billinghurst. 2005. Immersive authoring: What You eXperience Is What You Get (WYXIWYG). Communications of the ACM 48, 7: 76--81. https://doi.org/10.1145/1070838.1070840",
      "doi": "10.1145/1070838.1070840"
    },
    {
      "text": "Gilly Leshed, Eben M. Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: automating & sharing how-to knowledge in the enterprise. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08, 1719. https://doi.org/10.1145/1357054.1357323",
      "doi": ""
    },
    {
      "text": "Henry Lieberman. 2001. Your Wish is My Command: Programming By Example. Elsevier Science. Retrieved from https://books.google.ca/books?id=a_kdwtoIAx4C",
      "doi": ""
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-User Development: An Emerging Paradigm. In End User Development, Henry Lieberman, Fabio Paternò and Volker Wulf (eds.). Springer Netherlands, Dordrecht, 1--8. https://doi.org/10.1007/1--4020--5386-X_1",
      "doi": "10.5555/1146351"
    },
    {
      "text": "Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: a toolkit for rapid design exploration of augmented reality experiences. In Proceedings of the 17th annual ACM symposium on User interface software and technology - UIST '04, 197. https://doi.org/10.1145/1029632.1029669",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "John Maloney, Mitchel Resnick, Natalie Rusk, Brian Silverman, and Evelyn Eastmond. 2010. The Scratch Programming Language and Environment. ACM Transactions on Computing Education 10, 4: 1--15. https://doi.org/10.1145/1868358.1868363",
      "doi": "10.1145/1868358.1868363"
    },
    {
      "text": "Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The proximity toolkit: prototyping proxemic interactions in ubiquitous computing ecologies. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11, 315. https://doi.org/10.1145/2047196.2047238",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Mark McGill, Daniel Boland, Roderick Murray-Smith, and Stephen Brewster. 2015. A Dose of Reality: Overcoming Usability Challenges in VR HeadMounted Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 2143--2152. https://doi.org/10.1145/2702123.2702382",
      "doi": ""
    },
    {
      "text": "Rabia Murtza, Stephen Monroe, and Robert J. Youmans. 2017. Heuristic Evaluation for Virtual Reality Systems. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 61, 1: 2067-- 2071. https://doi.org/10.1177/1541931213602000",
      "doi": ""
    },
    {
      "text": "Brad A. Myers. 1986. Visual programming, programming by example, and program visualization: a taxonomy. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '86, 59--66. https://doi.org/10.1145/22627.22349",
      "doi": "10.1145/22627.22349"
    },
    {
      "text": "Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality & Augmented Reality Prototypes from Paper. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--13. https://doi.org/10.1145/3290605.3300826",
      "doi": "10.1145/3290605.3300826"
    },
    {
      "text": "Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--12. https://doi.org/10.1145/3173574.3173927",
      "doi": "10.1145/3173574.3173927"
    },
    {
      "text": "Michael Nebeling and Maximilian Speicher. 2018. The Trouble with Augmented Reality/Virtual Reality Authoring Tools. In 2018 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct), 333--337. https://doi.org/10.1109/ISMAR-Adjunct.2018.00098",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Guerrilla HCI: Using discount usability engineering to penetrate the intimidation barrier. Cost-justifying usability: 245--272.",
      "doi": ""
    },
    {
      "text": "Ahmed Patel, Liu Na, Rodziah Latih, Christopher Wills, Zarina Shukur, and Rabia Mulla. 2010. A Study of Mashup as a Software Application Development Technique with Examples from an End-User Programming Perspective. Journal of Computer Science 6, 12: 1406--1415. https://doi.org/10.3844/jcssp.2010.1406.1415",
      "doi": ""
    },
    {
      "text": "Marc Rettig. 1991. Nobody reads documentation. Communications of the ACM 34, 7: 19--24. https://doi.org/10.1145/105783.105788",
      "doi": "10.1145/105783.105788"
    },
    {
      "text": "John Rieman. 1996. A field study of exploratory learning strategies. ACM Transactions on Computer-Human Interaction 3, 3: 189--218. https://doi.org/10.1145/234526.234527",
      "doi": "10.1145/234526.234527"
    },
    {
      "text": "Christopher Scaffidi, Mary Shaw, and Brad A. Myers. 2005. Estimating the Numbers of End Users and End User Programmers. In 2005 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC'05), 207--214. https://doi.org/10.1109/VLHCC.2005.34",
      "doi": ""
    },
    {
      "text": "Dieter Schmalstieg, Anton Fuhrmann, Gerd Hesina, Zsolt Szalavári, L. Miguel Encarnação, Michael Gervautz, and Werner Purgathofer. 2002. The Studierstube Augmented Reality Project. Presence: Teleoperators and Virtual Environments 11, 1: 33--54. https://doi.org/10.1162/105474602317343640",
      "doi": "10.1162/105474602317343640"
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, Ao Yu, Bowen Zhang, Haihua Zhang, Janet Nebeling, and Michael Nebeling. 2018. XD-AR: Challenges and Opportunities in Cross-Device Augmented Reality Application Development. Proceedings of the ACM on Human-Computer Interaction 2, EICS: 1--24. https://doi.org/10.1145/3229089",
      "doi": "10.1145/3229089"
    },
    {
      "text": "Maximilian Speicher and Michael Nebeling. 2018. GestureWiz: A Human-Powered Gesture Design Environment for User Interface Prototypes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--11. https://doi.org/10.1145/3173574.3173681",
      "doi": "10.1145/3173574.3173681"
    },
    {
      "text": "Suzi Stephenson. 2019. TIGA Survey Reveals that Unity 3D Engine Dominates the UK Third Party Engine Market. TIGA. Retrieved September 20, 2019 from https://tiga.org/news/tiga-survey-reveals-thatunity-3d-engine-dominates-the-uk-third-party-enginemarket",
      "doi": ""
    },
    {
      "text": "Alistair Sutcliffe and Brian Gault. 2004. Heuristic evaluation of virtual reality applications. Interacting with Computers 16, 4: 831--849. https://doi.org/10.1016/j.intcom.2004.05.001",
      "doi": ""
    },
    {
      "text": "April Y. Wang, Ryan Mitts, Philip J. Guo, and Parmit K. Chilana. 2018. Mismatch of Expectations: How Modern Learning Resources Fail Conversational Programmers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--13. https://doi.org/10.1145/3173574.3174085",
      "doi": ""
    },
    {
      "text": "Jürgen Zauner, Michael Haller, Alexander Brandl, and Werner Hartman. 2003. Authoring of a mixed reality assembly instructor for hierarchical structures. In The Second IEEE and ACM International Symposium on Mixed and Augmented Reality, 2003. Proceedings., 237--246. https://doi.org/10.1109/ISMAR.2003.1240707",
      "doi": ""
    },
    {
      "text": "Chi Zhang and Guangzhi Zheng. 2013. Supporting adult learning: enablers, barriers, and services. In Proceedings of the 13th annual ACM SIGITE conference on Information technology education SIGITE '13, 151. https://doi.org/10.1145/2512276.2512323",
      "doi": "10.1145/2512276.2512323"
    },
    {
      "text": "Augmented and Virtual Reality Survey Report, 2019. Perkinscoie. Retrieved from https://www.perkinscoie.com/images/content/2/1/v4/2 18679/2019-VR-AR-Survey-Digital-v1.pdf",
      "doi": ""
    },
    {
      "text": "Important Augmented And Virtual Reality Trends For 2019 Everyone Should Read. Retrieved September 20, 2019 from https://www.forbes.com/sites/bernardmarr/2019/01/14/ 5-important-augmented-and-virtual-reality-trends-for2019-everyone-should-read/#20e558de22e7",
      "doi": ""
    },
    {
      "text": "Creative professionals are struggling to implement augmented reality -- Unity Blog. Retrieved September 17, 2019 from https://blogs.unity3d.com/2019/06/18/creativeprofessionals-are-struggling-to-implement-augmentedreality/",
      "doi": ""
    }
  ]
}