{
  "doi": "10.1145/3313831.3376311",
  "title": "Social Boundaries for Personal Agents in the Interpersonal Space of the Home",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "The presence of voice activated personal assistants (VAPAs) in people's homes rises each year [31]. Industry efforts are invested in making interactions with VAPAs more personal by leveraging information from messages and calendars, and by accessing user accounts for 3rd party services. However, the use of personal data becomes more complicated in interpersonal spaces, such as people's homes. Should a shared agent access the information of many users? If it does, how should it navigate issues of privacy and control? Designers currently lack guidelines to help them design appropriate agent behaviors. We used Speed Dating to explore inchoate social mores around agent actions within a home, including issues of proactivity, interpersonal conflict, and agent prevarication. Findings offer new insights on how more socially sophisticated agents might sense, make judgements about, and navigate social roles and individuals. We discuss how our findings might impact future research and future agent behaviors.",
  "tags": [
    "social robots",
    "conversational agents",
    "voice activated personal assistants",
    "embodied agents",
    "speed dating",
    "interaction design"
  ],
  "authors": [
    {
      "name": "Michal Luria",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99658688561/rel-imgonly/michal_luria.jpg",
      "acmid": "99658688561",
      "orcid": "missing"
    },
    {
      "name": "Rebecca Zheng",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528883",
      "orcid": "missing"
    },
    {
      "name": "Bennett Huffman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529497",
      "orcid": "missing"
    },
    {
      "name": "Shuangni Huang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526827",
      "orcid": "missing"
    },
    {
      "name": "John Zimmerman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81406592256/rel-imgonly/headshot2010.jpg",
      "acmid": "81406592256",
      "orcid": "missing"
    },
    {
      "name": "Jodi Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon. accessed September 9, 2019. Making Alexa More Friction-Free. https://developer.amazon.com/blogs/alexa/post/ 60e1f011--3236--4162-b0f6--509205d354ca/ making-alexa-more-friction-free",
      "doi": ""
    },
    {
      "text": "Emily P Bernier and Brian Scassellati. 2010. The similarity-attraction effect in human-robot interaction. In 2010 IEEE 9th International Conference on Development and Learning. IEEE, 286--290.",
      "doi": ""
    },
    {
      "text": "Timothy W Bickmore and Rosalind W Picard. 2005. Establishing and maintaining long-term human-computer relationships. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2 (2005), 293--327.",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Barry Brown, Alex S Taylor, Shahram Izadi, Abigail Sellen, Joseph Jo'sh'Kaye, and Rachel Eardley. 2007. Locating family values: A field trial of the Whereabouts Clock. In International Conference on Ubiquitous Computing. Springer, 354--371.",
      "doi": ""
    },
    {
      "text": "AJ Bernheim Brush and Kori M Inkpen. 2007. Yours, mine and ours? Sharing and use of technology in domestic environments. In International Conference on Ubiquitous Computing. Springer, 109--126.",
      "doi": "10.5555/1771592.1771599"
    },
    {
      "text": "Phil Cohen, Adam Cheyer, Eric Horvitz, Rana El Kaliouby, and Steve Whittaker. 2016. On the future of personal assistants. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1032--1037.",
      "doi": "10.1145/2851581.2886425"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In International Conference on Ubiquitous Computing. Springer, 429--446.",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K Dey. 2006. Principles of smart home control. In International conference on ubiquitous computing. Springer, 19--34.",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Maartje MA de Graaf, S Ben Allouch, and JAGM van Dijk. 2015. What makes robots social?: A user's perspective on characteristics for social human-robot interaction. In International Conference on Social Robotics. Springer, 184--193.",
      "doi": ""
    },
    {
      "text": "Maartje MA de Graaf, Somaya Ben Allouch, and Jan AGM van Dijk. 2016. Long-term evaluation of a social robot in real homes. Interaction studies 17, 3 (2016), 462--491.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. Hey Google is it OK if I eat you?: Initial explorations in child-agent interaction. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 595--600.",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "W Keith Edwards and Rebecca E Grinter. 2001. At home with ubiquitous computing: Seven challenges. In International conference on ubiquitous computing. Springer, 256--272.",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "David Frohlich and Robert Kraut. 2003. The social context of home computing. In Inside the smart home. Springer, 127--162.",
      "doi": ""
    },
    {
      "text": "Michael Golembewski and Mark Selby. 2010. Ideation decks: a card-based design ideation tool. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM, 89--92.",
      "doi": "10.1145/1858171.1858189"
    },
    {
      "text": "Isabelle Granlund, Sita Aukje Vriend, Julia Benz, Roisatul Azizah, Mikael Laaksoharju, and Mohammad Obaid. 2018. A User-Centered Storytelling Approach to Design a Language Companion Robotic Agent. In Proceedings of the 6th International Conference on Human-Agent Interaction. ACM, 29--35.",
      "doi": "10.1145/3284432.3284434"
    },
    {
      "text": "Jane Gruning and Siân Lindley. 2016. Things we own together: Sharing possessions at home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/2858036.2858154"
    },
    {
      "text": "Alina Hang, Emanuel Von Zezschwitz, Alexander De Luca, and Heinrich Hussmann. 2012. Too much information!: user attitudes towards smartphone sharing. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. ACM, 284--287.",
      "doi": "10.1145/2399016.2399061"
    },
    {
      "text": "Guy Hoffman, Oren Zuckerman, Gilad Hirschberger, Michal Luria, and Tal Shani Sherman. 2015. Design and evaluation of a peripheral robotic conversation companion. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 3--10.",
      "doi": "10.1145/2696454.2696495"
    },
    {
      "text": "Katherine Isbister, Hideyuki Nakanishi, Toru Ishida, and Cliff Nass. 2000. Helper agent: Designing an assistant for human-human interaction in a virtual meeting space. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 57--64.",
      "doi": "10.1145/332040.332407"
    },
    {
      "text": "Malte F Jung, Nikolas Martelaro, and Pamela J Hinds. 2015. Using robots to moderate team con?ict: the case of repairing violations. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 229--236.",
      "doi": "10.1145/2696454.2696460"
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, Jodi Forlizzi, Siddhartha Srinivasa, and Paul Rybski. 2010. Gracefully mitigating breakdowns in robotic services. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 203--210.",
      "doi": ""
    },
    {
      "text": "Dan Lockton, Devika Singh, Saloni Sabnis, Michelle Chou, Sarah Foley, and Alejandro Pantoja. 2019. New Metaphors: A Workshop Method for Generating Ideas and Reframing Problems in Design and Beyond. In Proceedings of the 2019 on Creativity and Cognition. ACM, 319--332.",
      "doi": "10.1145/3325480.3326570"
    },
    {
      "text": "Pamela J Ludford, Reid Priedhorsky, Ken Reily, and Loren Terveen. 2007. Capturing, sharing, and using local place information. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1235--1244.",
      "doi": "10.1145/1240624.1240811"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286--5297.",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Michal Luria, Samantha Reig, Xiang Zhi Tan, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2019. Re-Embodiment and Co-Embodiment: Exploration of social presence for robots and conversational agents. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 633--644.",
      "doi": "10.1145/3322276.3322340"
    },
    {
      "text": "Tara Matthews, Kerwell Liao, Anna Turner, Marianne Berkovich, Robert Reeder, and Sunny Consolvo. 2016. She'll just grab any device that's closer: A Study of Everyday Device & Account Sharing in Households. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5921--5932.",
      "doi": "10.1145/2858036.2858051"
    },
    {
      "text": "Nick Merrill, John Chuang, and Coye Cheshire. 2019. Sensing is Believing: What People Think Biosensors Can Reveal About Thoughts and Feelings. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, 413--420.",
      "doi": "10.1145/3322276.3322286"
    },
    {
      "text": "Youngme Moon and Clifford Nass. 1996. How \"real\" are computer personalities? Psychological responses to personality types in human-computer interaction. Communication research 23, 6 (1996), 651--674.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, Ellen Tauber, and Heidi Reeder. 1993. Anthropomorphism, agency, and ethopoeia: computers as social actors. In INTERACT'93 and CHI'93 conference companion on Human factors in computing systems. ACM, 111--112.",
      "doi": "10.1145/259964.260137"
    },
    {
      "text": "Clifford Ivar Nass and Scott Brave. 2005. Wired for speech: How voice activates and advances the human-computer relationship. MIT press Cambridge, MA.",
      "doi": "10.5555/1088925"
    },
    {
      "text": "NPR. accessed September 9, 2019. The Smart Audio Report. https://www.nationalpublicmedia.com/ smart-audio-report/latest-report",
      "doi": ""
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 45.",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Laura R Pina, Sang-Wha Sien, Teresa Ward, Jason C Yip, Sean A Munson, James Fogarty, and Julie A Kientz. 2017. From personal informatics to family informatics: Understanding family practices around health monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 2300--2315.",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Amanda Purington, Jessie G Taft, Shruti Sannon, Natalya N Bazarova, and Samuel Hardman Taylor. 2017. Alexa is my new BFF: social roles, user satisfaction, and personification of the amazon echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2853--2859.",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Byron Reeves and Clifford Ivar Nass. 1996. The media equation: How people treat computers, television, and new media like real people and places. Cambridge university press.",
      "doi": "10.5555/236605"
    },
    {
      "text": "Samantha Reig, Michal Luria, Janet Wang, Danielle Oltman, Elizabeth J. Carter, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2020. Not Some Random Agent: Multi-person interaction with a personalizing service robot. In Proceedings of the 2020 ACM/IEEE International Conference on Human-Robot Interaction. ACM/IEEE.",
      "doi": "10.1145/3319502.3374795"
    },
    {
      "text": "ABI Research. accessed September 13, 2019. Smart Home Robotics. https://www.abiresearch.com/ market-research/product/1033498-smart-home-robotics/ ?utm_source=media&utm_medium=email",
      "doi": ""
    },
    {
      "text": "Jon Rogers, Loraine Clarke, Martin Skelly, Nick Taylor, Pete Thomas, Michelle Thorne, Solana Larsen, Katarzyna Odrozek, Julia Kloiber, Peter Bihr, and others. 2019. Our Friends Electric: Reflections on Advocacy and Design Research for the Voice Enabled Internet. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 114.",
      "doi": "10.1145/3290605.3300344"
    },
    {
      "text": "Stuart Schechter. 2013. The user is the enemy, and (s)he keeps reaching for that bright shiny power button. In Workshop on Home Usable Privacy and Security (HUPS).",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I Hong. 2018. Hey Alexa, What's Up?: A mixed-methods studies of in-home conversational agent usage. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 857--868.",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Solace Shen, Petr Slovak, and Malte F Jung. 2018. Stop. I see a conflict happening.: A robot mediator for young children's interpersonal confict resolution. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 69--77.",
      "doi": "10.1145/3171221.3171248"
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: it's like mixing technology and religion. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 527--536.",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and AJ Brush. 2018. Children asking questions: speech interface reformulations and personification preferences. In Proceedings of the 17th ACM Conference on Interaction Design and Children. ACM, 300--312.",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2017. Speed dating: providing a menu of possible futures. The Journal of Design, Economics, and Innovation 3, 1 (2017), 30--50.",
      "doi": ""
    }
  ]
}