{
  "doi": "10.1145/3313831.3376654",
  "title": "The Impact of Displaying Diversity Information on the Formation of Self-assembling Teams",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Despite the benefits of team diversity, individuals often choose to work with similar others. Online team formation systems have the potential to help people assemble diverse teams. Systems can connect people to collaborators outside their networks, and features can quantify and raise the salience of diversity to users as they search for prospective teammates. But if we build a feature indicating diversity into the tool, how will people react to it? Two experiments manipulating the presence or absence of a \"diversity score\" feature within a teammate recommender demonstrate that, when present, individuals avoid collaborators who would increase team diversity in favor of those who lower team diversity. These results have important practical implications. Though the increased access to diverse teammates provided by recommender systems may benefit diversity, designers are cautioned against creating features that raise the salience of diversity as this information may undermine diversity.",
  "authors": [
    {
      "name": "Diego Gómez-Zará",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-99658734987/rel-imgonly/diego-gomez-zara-small.jpg",
      "acmid": "99658734987",
      "orcid": "missing"
    },
    {
      "name": "Mengzi Guo",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527654",
      "orcid": "missing"
    },
    {
      "name": "Leslie A. DeChurch",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987324",
      "orcid": "missing"
    },
    {
      "name": "Noshir Contractor",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81100348926/rel-imgonly/2013noshircontractorforweb-andrewcampbell.jpg",
      "acmid": "81100348926",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alan Agresti and Maria Kateri. 2011. Categorical data analysis. Springer.",
      "doi": ""
    },
    {
      "text": "Luca Maria Aiello, Alain Barrat, Rossano Schifanella, Ciro Cattuto, Benjamin Markines, and Filippo Menczer. 2012. Friendship Prediction and Homophily in Social Media. ACM Trans. Web 6, 2, Article Article 9 (June 2012), 33 pages. DOI: http://dx.doi.org/10.1145/2180861.2180866",
      "doi": "10.1145/2180861.2180866"
    },
    {
      "text": "Jisun An, Daniele Quercia, and Jon Crowcroft. 2013. Why Individuals Seek Diverse Opinions (or Why They Don't). (2013), 15--18. DOI: http://dx.doi.org/10.1145/2464464.2464493",
      "doi": ""
    },
    {
      "text": "Ofer Arazy, Oded Nov, Raymond Patterson, and Lisa Yeo. 2011. Information Quality in Wikipedia: The Effects of Group Composition and Task Conflict. Journal of Management Information Systems 27, 4 (April 2011), 71--98.",
      "doi": "10.2753/MIS0742-1222270403"
    },
    {
      "text": "Joop Aué, Michiel Haisma, Kristín Fjóla Tómasdóttir, and Alberto Bacchelli. 2016. Social Diversity and Growth Levels of Open Source Software Projects on GitHub. In Proceedings of the 10th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '16). ACM, NY, NY, USA, 41:1--41:6.",
      "doi": ""
    },
    {
      "text": "Donald R Bacon, Kim A Stewart, and William S Silver. 1999. Lessons from the Best and Worst Student Team Experiences: How a Teacher can make the Difference. Journal of Management Education 23, 5 (Oct. 1999), 467--488.",
      "doi": ""
    },
    {
      "text": "George A Barnett and Grace A Benefield. 2017. Predicting international Facebook ties through cultural homophily and other factors. New Media & Society 19, 2 (Feb. 2017), 217--239.",
      "doi": ""
    },
    {
      "text": "Zoe I Barsness, Kristina A Diekmann, and Marc-David L Seidel. 2005. Motivation and Opportunity: The Role of Remote Work, Demographic Dissimilarity, and Social Network Centrality in Impression Management. AMJ 48, 3 (June 2005), 401--419.",
      "doi": ""
    },
    {
      "text": "Suzanne T Bell. 2007. Deep-level composition variables as predictors of team performance: a meta-analysis. Journal of Applied Psychology 92, 3 (2007), 595.",
      "doi": ""
    },
    {
      "text": "Suzanne T. Bell, Anton J. Villado, Marc A. Lukasik, Larisa Belau, and Andrea L. Briggs. 2011. Getting Specific about Demographic Diversity Variable and Team Performance Relationships: A Meta-Analysis. Journal of Management 37, 3 (2011), 709--743. DOI: http://dx.doi.org/10.1177/0149206310365001",
      "doi": ""
    },
    {
      "text": "Jeremy Birnholtz, Colin Fitzpatrick, Mark Handel, and Jed R. Brubaker. 2014. Identity, Identification and Identifiability: The Language of Self-Presentation on a Location-Based Mobile Dating App. In Proceedings of the 16th International Conference on Human-Computer Interaction with Mobile Devices & Services (MobileHCI '14). Association for Computing Machinery, New York, NY, USA, 3--12. DOI: http://dx.doi.org/10.1145/2628363.2628406",
      "doi": "10.1145/2628363.2628406"
    },
    {
      "text": "Lori Boyer, Brigitta R Brunner, Tiffany Charles, and Patrice Coleman. 2006. Managing Impressions in a Virtual Environment: Is Ethnic Diversity a Self-Presentation Strategy for Colleges and Universities? J. Comput. Mediat. Commun. 12, 1 (Oct. 2006), 136--154.",
      "doi": ""
    },
    {
      "text": "Ronald S Burt. 2005. Brokerage and closure: An introduction to social capital. Oxford university press.",
      "doi": ""
    },
    {
      "text": "Ronald S Burt. 2009. Structural Holes: The Social Structure of Competition. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Donn Byrne. 1971. The Attraction Paradigm.",
      "doi": ""
    },
    {
      "text": "Traci Carte and Laku Chidambaram. 2004. A Capabilities-Based Theory of Technology Deployment in Diverse Teams: Leapfrogging the Pitfalls of Diversity and Leveraging Its Potential with Collaborative Technology. Journal of the Association for Information Systems 5, 11 (Dec. 2004), 4.",
      "doi": ""
    },
    {
      "text": "Edward H Chang, Katherine L Milkman, Dena M Gromet, Robert W Rebele, Cade Massey, Angela L Duckworth, and Adam M Grant. 2019. The mixed effects of online diversity training. Proc. Natl. Acad. Sci. U. S. A. 116, 16 (April 2019), 7778--7783.",
      "doi": ""
    },
    {
      "text": "Kenneth J Chapman, Matthew Meuter, Dan Toy, and Lauren Wright. 2006. Can't we pick our own groups? The influence of group selection method on group dynamics and outcomes. Journal of Management Education 30, 4 (2006), 557--569.",
      "doi": ""
    },
    {
      "text": "Frank X. Chen, Abby C. King, and Eric B. Hekler. 2014. \"healthifying\" Exergames: Improving Health Outcomes through Intentional Priming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). Association for Computing Machinery, New York, NY, USA, 1855--1864. DOI: http://dx.doi.org/10.1145/2556288.2557246",
      "doi": ""
    },
    {
      "text": "Jilin Chen, Werner Geyer, Casey Dugan, Michael Muller, and Ido Guy. 2009. Make New Friends, but Keep the Old: Recommending People on Social Networking Sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). Association for Computing Machinery, New York, NY, USA, 201--210. DOI: http://dx.doi.org/10.1145/1518701.1518735",
      "doi": "10.1145/1518701.1518735"
    },
    {
      "text": "Jilin Chen, Yuqing Ren, and John Riedl. 2010. The Effects of Diversity on Group Productivity and Member Withdrawal in Online Volunteer Groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 821--830. DOI: http://dx.doi.org/10.1145/1753326.1753447",
      "doi": "10.1145/1753326.1753447"
    },
    {
      "text": "Noshir Contractor, Leslie A. DeChurch, Sawant Anup, and Xiang Li. 2013. My Dream Team Assembler. (2013). http://sonic.northwestern.edu/software/c-iknow-mydreamteam/",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Pamela Ludford, and Loren Terveen. 2003. Studying the Effect of Similarity in Online Task-Focused Interactions. (2003). DOI: http://dx.doi.org/10.1145/958160.958212",
      "doi": ""
    },
    {
      "text": "Frank Dobbin and Alexandra Kalev. 2016. Why Diversity Programs Fail. Harvard Business Review (July 2016).",
      "doi": ""
    },
    {
      "text": "M Brent Donnellan, Frederick L Oswald, Brendan M Baird, and Richard E Lucas. 2006. The mini-IPIP scales: tiny-yet-effective measures of the Big Five factors of personality. Psychol. Assess. 18, 2 (2006), 192.",
      "doi": ""
    },
    {
      "text": "Geeta C D'Souza and Stephen M Colarelli. 2010. Team member selection decisions for virtual versus face-to-face teams. Comput. Human Behav. 26, 4 (July 2010), 630--635.",
      "doi": ""
    },
    {
      "text": "Priscilla M Elsass and Laura M Graves. 1997. Demographic Diversity in Decision-Making Groups: The Experiences of Women And People of Color. AMRO 22, 4 (Oct. 1997), 946--973.",
      "doi": ""
    },
    {
      "text": "Siamak Faridani, Ephrat Bitton, Kimiko Ryokai, and Ken Goldberg. 2010. Opinion Space: A Scalable Tool for Browsing Online Comments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1175--1184. DOI: http://dx.doi.org/10.1145/1753326.1753502",
      "doi": "10.1145/1753326.1753502"
    },
    {
      "text": "Gerald R Ferris, Darren C Treadway, Robert W Kolodinsky, Wayne A Hochwarter, Charles J Kacmar, Ceasar Douglas, and Dwight D Frink. 2005. Development and validation of the political skill inventory. J. Manage. 31, 1 (2005), 126--152.",
      "doi": ""
    },
    {
      "text": "Gary Garrison, Robin L. Wakefield, Xiaobo Xu, and Sang Hyun Kim. 2010. Globally Distributed Teams: The Effect of Diversity on Trust, Cohesion and Individual Performance. SIGMIS Database 41, 3 (Aug. 2010), 27--48. DOI: http://dx.doi.org/10.1145/1851175.1851178",
      "doi": "10.1145/1851175.1851178"
    },
    {
      "text": "Robert C Giambatista and Anita D Bhappu. 2010. Diversity's harvest: Interactions of diversity sources and communication technology on creative group performance. Organ. Behav. Hum. Decis. Process. 111, 2 (2010), 116--126.",
      "doi": ""
    },
    {
      "text": "Diego Gómez-Zará, Matthew Paras, Marlon Twyman, Jacqueline N. Lane, Leslie A. DeChurch, and Noshir S. Contractor. 2019. Who Would You Like to Work With?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 659, 15 pages. DOI: http://dx.doi.org/10.1145/3290605.3300889",
      "doi": ""
    },
    {
      "text": "Eduardo Graells-Garrido, Mounia Lalmas, and Ricardo Baeza-Yates. 2016. Data Portraits and Intermediary Topics: Encouraging Exploration of Politically Diverse Profiles. In Proceedings of the 21st International Conference on Intelligent User Interfaces (IUI '16). Association for Computing Machinery, New York, NY, USA, 228--240. DOI: http://dx.doi.org/10.1145/2856767.2856776",
      "doi": "10.1145/2856767.2856776"
    },
    {
      "text": "Justin D. Hackett and Michael A. Hogg. 2014. The diversity paradox: when people who value diversity surround themselves with like-minded others. (2014). DOI: http://dx.doi.org/10.1111/jasp.12233",
      "doi": ""
    },
    {
      "text": "Alexa M. Harris, Diego Gómez-Zará, Leslie A. DeChurch, and Noshir S. Contractor. 2019. Joining Together Online: The Trajectory of CSCW Scholarship on Group Formation. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article Article 148 (Nov. 2019), 27 pages. DOI: http://dx.doi.org/10.1145/3359250",
      "doi": "10.1145/3359250"
    },
    {
      "text": "David A Harrison and Katherine J Klein. 2007. What's the difference? diversity constructs as separation, variety, or disparity in organizations. Acad. Manage. Rev. 32, 4 (2007), 1199--1228.",
      "doi": ""
    },
    {
      "text": "David A Harrison, Kenneth H Price, and Myrtle P Bell. 1998. Beyond Relational Demography: Time and the Effects of Surface- and Deep-Level Diversity on Work Group Cohesion. (1998).",
      "doi": ""
    },
    {
      "text": "Helen Ai He, Naomi Yamashita, Chat Wacharamanotham, Andrea B. Horn, Jenny Schmid, and Elaine M. Huang. 2017. Two Sides to Every Story: Mitigating Intercultural Conflict through Automated Feedback and Shared Self-Reflections in Global Virtual Teams. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article Article 51 (Dec. 2017), 21 pages. DOI: http://dx.doi.org/10.1145/3134686",
      "doi": ""
    },
    {
      "text": "Tanja Hentschel, Meir Shemla, Jürgen Wegge, and Eric Kearney. 2013. Perceived Diversity and Team Functioning: The Role of Diversity Beliefs and Affect. Small Group Research 44, 1 (Feb. 2013), 33--61.",
      "doi": ""
    },
    {
      "text": "Julia Himmelsbach, Stephanie Schwarz, Cornelia Gerdenitsch, Beatrix Wais-Zechmann, Jan Bobeth, and Manfred Tscheligi. 2019. Do We Care About Diversity in Human Computer Interaction: A Comprehensive Content Analysis on Diversity Dimensions in Research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 490, 16 pages. DOI: http://dx.doi.org/10.1145/3290605.3300720",
      "doi": "10.1145/3290605.3300720"
    },
    {
      "text": "Pamela J Hinds, Kathleen M Carley, David Krackhardt, and Doug Wholey. 2000. Choosing work group members: Balancing similarity, competence, and familiarity. Organ. Behav. Hum. Decis. Process. 81, 2 (2000), 226--251.",
      "doi": ""
    },
    {
      "text": "Elizabeth V Hobman, Prashant Bordia, and Cynthia Gallois. 2004. Perceived Dissimilarity and Work Group Involvement: The Moderating Effects of Group Openness to Diversity. Group & Organization Management 29, 5 (Oct. 2004), 560--587.",
      "doi": ""
    },
    {
      "text": "Sujin K Horwitz and Irwin B Horwitz. 2007. The Effects of Team Diversity on Team Outcomes: A Meta-Analytic Review of Team Demography. J. Manage. 33, 6 (Dec. 2007), 987--1015.",
      "doi": ""
    },
    {
      "text": "Nasif Imtiaz, Justin Middleton, Joymallya Chakraborty, Neill Robson, Gina Bai, and Emerson Murphy-Hill. 2019. Investigating the Effects of Gender Bias on GitHub. In Proceedings of the 41st International Conference on Software Engineering (ICSE '19). IEEE Press, Piscataway, NJ, USA, 700--711.",
      "doi": "10.1109/ICSE.2019.00079"
    },
    {
      "text": "Christine L Jackson, Jason A Colquitt, Michael J Wesson, and Cindy P Zapata-Phelan. 2006. Psychological collectivism: A measurement validation and linkage to group member performance. J. Appl. Psychol. 91, 4 (2006), 884.",
      "doi": ""
    },
    {
      "text": "Susan E Jackson and Aparna Joshi. 2004. Diversity in social context: a multi-attribute, multilevel analysis of team diversity and sales performance. Journal of Organizational Behavior: The International Journal of Industrial, Occupational and Organizational Psychology and Behavior 25, 6 (2004), 675--702.",
      "doi": ""
    },
    {
      "text": "Cheryl R Kaiser, Brenda Major, Ines Jurcevic, Tessa L Dover, Laura M Brady, and Jenessa R Shapiro. 2013. Presumed fair: ironic effects of organizational diversity structures. J. Pers. Soc. Psychol. 104, 3 (March 2013), 504--519.",
      "doi": ""
    },
    {
      "text": "Young Ji Kim, David Engel, Anita Williams Woolley, Jeffrey Yu-Ting Lin, Naomi McArthur, and Thomas W. Malone. 2017. What Makes a Strong Team?: Using Collective Intelligence to Predict Team Performance in League of Legends. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 2316--2329. DOI: http://dx.doi.org/10.1145/2998181.2998185",
      "doi": ""
    },
    {
      "text": "Aniket Kittur and Robert E Kraut. 2008. Harnessing the Wisdom of Crowds in Wikipedia: Quality Through Coordination. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 37--46.",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Shirli Kopelman, J Mark Weber, and David M Messick. 2002. Factors influencing cooperation in commons dilemmas: A review of experimental psychological research. The drama of the commons (2002), 113--156.",
      "doi": ""
    },
    {
      "text": "Gueorgi Kossinets and Duncan J Watts. 2009. Origins of Homophily in an Evolving Social Network. Am. J. Sociol. 115, 2 (Sept. 2009), 405--450.",
      "doi": ""
    },
    {
      "text": "David Krackhardt. 1987. Cognitive social structures. Soc. Networks 9, 2 (June 1987), 109--134.",
      "doi": ""
    },
    {
      "text": "Dora C Lau and J Keith Murnighan. 2005. Interactions within groups and subgroups: The effects of demographic faultlines. Acad. Manage. J. 48 (2005), 645--659.",
      "doi": ""
    },
    {
      "text": "Lisa Legault, Jennifer N Gutsell, and Michael Inzlicht. 2011. Ironic effects of antiprejudice messages: how motivational interventions can reduce (but also increase) prejudice. Psychol. Sci. 22, 12 (Dec. 2011), 1472--1477.",
      "doi": ""
    },
    {
      "text": "Sheena Lewis, Mira Dontcheva, and Elizabeth Gerber. 2011. Affective Computational Priming and Creativity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). Association for Computing Machinery, New York, NY, USA, 735--744. DOI: http://dx.doi.org/10.1145/1978942.1979048",
      "doi": "10.1145/1978942.1979048"
    },
    {
      "text": "Q. Vera Liao and Wai-Tat Fu. 2013. Beyond the Filter Bubble: Interactive Effects of Perceived Threat and Topic Involvement on Selective Exposure to Information. (2013), 2359--2368. DOI: http://dx.doi.org/10.1145/2470654.2481326",
      "doi": ""
    },
    {
      "text": "Q. Vera Liao and Wai-Tat Fu. 2014. Can You Hear Me Now? Mitigating the Echo Chamber Effect by Source Position Indicators. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). Association for Computing Machinery, New York, NY, USA, 184--196. DOI: http://dx.doi.org/10.1145/2531602.2531711",
      "doi": ""
    },
    {
      "text": "M R Lind. 1999. The gender impact of temporary virtual work groups. IEEE Trans. Prof. Commun. 42, 4 (Dec. 1999), 276--285.",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Angeliki Antoniou, Yannick Naudet, and Steven P. Dow. 2016. Personality Matters: Balancing for Personality Types Leads to Better Outcomes for Crowd Teams. (2016), 260--273. DOI: http://dx.doi.org/10.1145/2818048.2819979",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Robert E. Kraut, and Steven P. Dow. 2017. Team Dating Leads to Better Online Ad Hoc Collaborations. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). Association for Computing Machinery, New York, NY, USA, 2330--2343. DOI: http://dx.doi.org/10.1145/2998181.2998322",
      "doi": ""
    },
    {
      "text": "Sakthi Mahenthiran and Pamela J Rouse. 2000. The impact of group selection on student performance and satisfaction. International Journal of Educational Management 14, 6 (2000), 255--265.",
      "doi": ""
    },
    {
      "text": "John E Mathieu, John R Hollenbeck, Daan van Knippenberg, and Daniel R Ilgen. 2017. A century of work teams in the Journal of Applied Psychology. J. Appl. Psychol. 102, 3 (March 2017), 452--467.",
      "doi": ""
    },
    {
      "text": "Miller McPherson, Lynn Smith-Lovin, and James M Cook. 2001. Birds of a Feather: Homophily in Social Networks. Annu. Rev. Sociol. 27, 1 (Aug. 2001), 415--444.",
      "doi": ""
    },
    {
      "text": "Kelly A Mollica, Barbara Gray, and Linda K Treviño. 2003. Racial Homophily and Its Persistence in Newcomers' Social Networks. Organization Science 14, 2 (April 2003), 123--136.",
      "doi": ""
    },
    {
      "text": "Jonathan T. Morgan, Michael Gilbert, David W. McDonald, and Mark Zachry. 2014. Editing beyond Articles: Diversity & Dynamics of Teamwork in Open Collaborations. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). Association for Computing Machinery, New York, NY, USA, 550--563. DOI: http://dx.doi.org/10.1145/2531602.2531654",
      "doi": "10.1145/2531602.2531654"
    },
    {
      "text": "Michael D Mumford, Wayne A Baughman, K Victoria Threlfall, Charles E Uhlman, and David P Costanza. 1993. Personality, adaptability, and performance: Performance on well-defined problem sovling tasks. Hum. Perform. 6, 3 (1993), 241--285.",
      "doi": ""
    },
    {
      "text": "Sean A. Munson and Paul Resnick. 2010. Presenting Diverse Political Opinions: How and How Much. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1457--1466. DOI: http://dx.doi.org/10.1145/1753326.1753543",
      "doi": ""
    },
    {
      "text": "Edward Newell and Derek Ruths. 2016. How One Microtask Affects Another. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 3155--3166. DOI: http://dx.doi.org/10.1145/2858036.2858490",
      "doi": "10.1145/2858036.2858490"
    },
    {
      "text": "Mike Noon. 2018. Pointless Diversity Training: Unconscious Bias, New Racism and Agency. Work Employ. Soc. 32, 1 (Feb. 2018), 198--209.",
      "doi": ""
    },
    {
      "text": "Ruqin Ren and Bei Yan. 2017. Crowd Diversity and Performance in Wikipedia: The Mediating Effects of Task Conflict and Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). Association for Computing Machinery, New York, NY, USA, 6342--6351. DOI: http://dx.doi.org/10.1145/3025453.3025992",
      "doi": "10.1145/3025453.3025992"
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S. Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S. Bernstein. 2014. Expert Crowdsourcing with Flash Teams. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). Association for Computing Machinery, New York, NY, USA, 75--85. DOI: http://dx.doi.org/10.1145/2642918.2647409",
      "doi": ""
    },
    {
      "text": "Lionel Robert and Daniel M. Romero. 2015. Crowd Size, Diversity and Performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 1379--1382. DOI: http://dx.doi.org/10.1145/2702123.2702469",
      "doi": ""
    },
    {
      "text": "Lionel P. Robert. 2016. Far but Near or Near but Far? The Effects of Perceived Distance on the Relationship between Geographic Dispersion and Perceived Diversity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 2461--2473. DOI: http://dx.doi.org/10.1145/2858036.2858534",
      "doi": "10.1145/2858036.2858534"
    },
    {
      "text": "Lionel P Robert, Jr and Daniel M Romero. 2017. The influence of diversity and experience on the effects of crowd size: When Does Crowd Size Matter? J Assn Inf Sci Tec 68, 2 (Feb. 2017), 321--332.",
      "doi": "10.1002/asi.23653"
    },
    {
      "text": "Howard Ross. 2008. Exploring unconscious bias. Diversity best Practices (2008).",
      "doi": ""
    },
    {
      "text": "Jian Raymond Rui and Michael A Stefanone. 2013. Strategic image management online: Self-presentation, self-esteem and social network perspectives. Inf. Commun. Soc. 16, 8 (2013), 1286--1305.",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi and Michael S. Bernstein. 2018. Hive: Collective Design Through Network Rotation. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article Article 151 (Nov. 2018), 26 pages. DOI: http://dx.doi.org/10.1145/3274420",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi, Andrew McCabe, Melissa Valentine, and Michael Bernstein. 2017. Huddler: Convening Stable and Familiar Crowd Teams Despite Unpredictable Availability. (2017), 1700--1713. DOI: http://dx.doi.org/10.1145/2998181.2998300",
      "doi": "10.1145/2998181.2998300"
    },
    {
      "text": "Noam Scheiber and John Eligon. 2019. Elite Law Firm's All-White Partner Class Stirs Debate on Diversity. The New York Times (Jan. 2019).",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. (2017), 5412--5427. DOI: http://dx.doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025682"
    },
    {
      "text": "Meir Shemla, Bertolt Meyer, Lindred Greer, and Karen A Jehn. 2016. A review of perceived diversity in teams: Does how members perceive their team's composition affect team processes and outcomes? J. Organ. Behav. 37 (Feb. 2016), S89--S106.",
      "doi": ""
    },
    {
      "text": "D Sandy Staples and Lina Zhao. 2006. The Effects of Cultural Diversity in Virtual Teams Versus Face-to-Face Teams. Group Decision and Negotiation 15, 4 (July 2006), 389--406.",
      "doi": ""
    },
    {
      "text": "Henri Tajfel and John C Turner. 1979. An integrative theory of intergroup conflict. The social psychology of intergroup relations 33 (1979), 74.",
      "doi": ""
    },
    {
      "text": "Pamela Tierney and Steven M Farmer. 2002. Creative Self-Efficacy: Its Potential Antecedents and Relationship to Creative Performance. Acad. Manage. J. 45, 6 (2002), 1137--1148.",
      "doi": ""
    },
    {
      "text": "Chun-Hua Tsai and Peter Brusilovsky. 2018. Beyond the Ranked List: User-Driven Exploration and Diversification of Social Recommendation. In 23rd International Conference on Intelligent User Interfaces (IUI '18). Association for Computing Machinery, New York, NY, USA, 239--250. DOI: http://dx.doi.org/10.1145/3172944.3172959",
      "doi": "10.1145/3172944.3172959"
    },
    {
      "text": "John C Turner. 1987. Rediscovering the Social Group: A Self-categorization Theory. B. Blackwell.",
      "doi": ""
    },
    {
      "text": "Aharon Tziner and Dov Eden. 1985. Effects of crew composition on crew performance: Does the whole equal the sum of its parts? J. Appl. Psychol. 70, 1 (1985), 85.",
      "doi": ""
    },
    {
      "text": "Brian Uzzi, Satyam Mukherjee, Michael Stringer, and Ben Jones. 2013. Atypical Combinations and Scientific Impact. Science 342, 6157 (2013), 468--472.",
      "doi": ""
    },
    {
      "text": "Daan Van Knippenberg, Carsten K W De Dreu, and Astrid C Homan. 2004. Work group diversity and group performance: an integrative model and research agenda. J. Appl. Psychol. 89, 6 (2004), 1008.",
      "doi": ""
    },
    {
      "text": "Daan van Knippenberg and Michaéla C Schippers. 2007. Work group diversity. Annu. Rev. Psychol. 58 (2007), 515--541.",
      "doi": ""
    },
    {
      "text": "Bogdan Vasilescu, Daryl Posnett, Baishakhi Ray, Mark G.J. van den Brand, Alexander Serebrenik, Premkumar Devanbu, and Vladimir Filkov. 2015a. Gender and Tenure Diversity in GitHub Teams. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 3789--3798. DOI: http://dx.doi.org/10.1145/2702123.2702549",
      "doi": ""
    },
    {
      "text": "Bogdan Vasilescu, Alexander Serebrenik, and Vladimir Filkov. 2015b. A Data Set for Social Diversity Studies of GitHub Teams. In Proceedings of the 12th Working Conference on Mining Software Repositories (MSR '15). IEEE Press, Piscataway, NJ, USA, 514--517.",
      "doi": "10.5555/2820518.2820601"
    },
    {
      "text": "Hao-Chuan Wang, Susan R. Fussell, and Dan Cosley. 2011. From Diversity to Creativity: Stimulating Group Brainstorming with Cultural Differences and Conversationally-Retrieved Pictures. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). Association for Computing Machinery, New York, NY, USA, 265--274. DOI: http://dx.doi.org/10.1145/1958824.1958864",
      "doi": "10.1145/1958824.1958864"
    },
    {
      "text": "K Y Williams and C A O'Reilly, III. 1998. Demography and Diversity in Organisations: A review of 40 years of research in BM Staw and LL Cummings (eds) Research in Organisational Behaviour Vol. 20. Jai Pres, Connecticut (1998).",
      "doi": ""
    },
    {
      "text": "David Wong, Siamak Faridani, Ephrat Bitton, Björn Hartmann, and Ken Goldberg. 2011. The Diversity Donut: Enabling Participant Control over the Diversity of Recommended Responses. (2011), 1471--1476. DOI: http://dx.doi.org/10.1145/1979742.1979793",
      "doi": ""
    },
    {
      "text": "Anita Williams Woolley, Christopher F Chabris, Alex Pentland, Nada Hashmi, and Thomas W Malone. 2010. Evidence for a Collective Intelligence Factor in the Performance of Human Groups. Science 330, 6004 (2010), 686--688.",
      "doi": ""
    },
    {
      "text": "Ziang Xiao, Michelle X. Zhou, and Wat-Tat Fu. 2019. Who Should Be My Teammates: Using a Conversational Agent to Understand Individuals and Help Teaming. In Proceedings of the 24th International Conference on Intelligent User Interfaces (IUI '19). Association for Computing Machinery, New York, NY, USA, 437--447. DOI: http://dx.doi.org/10.1145/3301275.3302264",
      "doi": "10.1145/3301275.3302264"
    },
    {
      "text": "Chia-Chen Yang and B Bradford Brown. 2016. Online Self-Presentation on Facebook and Self Development During the College Transition. J. Youth Adolesc. 45, 2 (Feb. 2016), 402--416.",
      "doi": ""
    },
    {
      "text": "Teng Ye and Lionel P. Robert. 2017. Does Collectivism Inhibit Individual Creativity? The Effects of Collectivism and Perceived Diversity on Individual Creativity and Satisfaction in Virtual Ideation Teams. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). Association for Computing Machinery, New York, NY, USA, 2344--2358. DOI: http://dx.doi.org/10.1145/2998181.2998261",
      "doi": ""
    },
    {
      "text": "Chunqiu Zeng, Qing Wang, Shekoofeh Mokhtari, and Tao Li. 2016. Online Context-Aware Recommendation with Time Varying Multi-Armed Bandit. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '16). Association for Computing Machinery, New York, NY, USA, 2025--2034. DOI: http://dx.doi.org/10.1145/2939672.2939878",
      "doi": "10.1145/2939672.2939878"
    },
    {
      "text": "Sharon Zhou, Melissa Valentine, and Michael S. Bernstein. 2018. In Search of the Dream Team: Temporally Constrained Multi-Armed Bandits for Identifying Effective Team Structures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Article Paper 108, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173682",
      "doi": ""
    }
  ]
}