{
  "doi": "10.1145/3313831.3376797",
  "title": "LIFT: Integrating Stakeholder Voices into Algorithmic Team Formation",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Team formation tools assume instructors should configure the criteria for creating teams, precluding students from participating in a process affecting their learning experience. We propose LIFT, a novel learner-centered workflow where students propose, vote for, and weigh the criteria used as inputs to the team formation algorithm. We conducted an experiment (N=289) comparing LIFT to the usual instructor-led process, and interviewed participants to evaluate their perceptions of LIFT and its outcomes. Learners proposed novel criteria not included in existing algorithmic tools, such as organizational style. They avoided criteria like gender and GPA that instructors frequently select, and preferred those promoting efficient collaboration. LIFT led to team outcomes comparable to those achieved by the instructor-led approach, and teams valued having control of the team formation process. We provide instructors and designers with a workflow and evidence supporting giving learners control of the algorithmic process used for grouping them into teams.",
  "authors": [
    {
      "name": "Emily M. Hastings",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321350",
      "orcid": "missing"
    },
    {
      "name": "Albatool Alamri",
      "institution": "University of Jeddah & University of Illinois at Urbana-Champaign, Jeddah, Makkah, Saudi Arabia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527751",
      "orcid": "missing"
    },
    {
      "name": "Andrew Kuznetsov",
      "institution": "Carnegie Mellon University & University of Illinois at Urbana-Champaign, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528678",
      "orcid": "missing"
    },
    {
      "name": "Christine Pisarczyk",
      "institution": "University of Maryland & University of Illinois at Urbana-Champaign, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529719",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    },
    {
      "name": "Darko Marinov",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100437653",
      "orcid": "missing"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Team-Maker Algorithm Detail. (2017). Retrieved 4 April 2019 from https://www.catme.org/faculty/help#TeamMakerScoring",
      "doi": ""
    },
    {
      "text": "2018. CATME Smarter Teamwork. (2018). Retrieved 31 August 2018 from http://info.catme.org/",
      "doi": ""
    },
    {
      "text": "2018. Piazza Homepage. (2018). Retrieved 20 September 2018 from https://piazza.com/signup",
      "doi": ""
    },
    {
      "text": "S Adams, L Simon, and B Ruiz. 2002. A Pilot Study of the Performance of Student Teams In Engineering Education. In 2002 American Society for Engineering Education Annual Conference & Exposition, Montreal, Canada.",
      "doi": ""
    },
    {
      "text": "Albatool A. Alamri and Brian P. Bailey. 2018. Examination of the Effectiveness of a Criteria-based Team Formation Tool. In Frontiers in Education. IEEE.",
      "doi": ""
    },
    {
      "text": "Elliot Aronson. 2002. Chapter 10 - Building Empathy, Compassion, and Achievement in the Jigsaw Classroom. In Improving Academic Achievement, Joshua Aronson (Ed.). Academic Press, San Diego, 209 -- 225. DOI: http://dx.doi.org/https://doi.org/10.1016/B978-012064455--1/50013-0",
      "doi": ""
    },
    {
      "text": "Donald R Bacon, Kim A Stewart, and Sue Stewart-Belle. 1998. Exploring predictors of student team project performance. Journal of Marketing Education 20, 1 (1998), 63--71.",
      "doi": ""
    },
    {
      "text": "Amna Basharat. 2016. Learnersourcing Thematic and Inter-Contextual Annotations from Islamic Texts. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 92--97.",
      "doi": "10.1145/2851581.2890386"
    },
    {
      "text": "Julia B Bear and Anita Williams Woolley. 2011. The role of gender in team collaboration and performance. Interdisciplinary science reviews 36, 2 (2011), 146--153.",
      "doi": ""
    },
    {
      "text": "Lisa Bender, Gursimran Walia, Krishna Kambhampaty, Kendall E Nygard, and Travis E Nygard. 2012. Social sensitivity and classroom team projects: an empirical investigation. In Proceedings of the 43rd ACM Technical Symposium on Computer Science Education. ACM, 403--408.",
      "doi": "10.1145/2157136.2157258"
    },
    {
      "text": "Paul Blowers. 2003. Using student skill self-assessments to get balanced groups for group projects. College Teaching 51, 3 (2003), 106--110.",
      "doi": ""
    },
    {
      "text": "Dale E Brashers, Mark Adkins, and Renée A Meyers. 1994. Argumentation and computer-mediated group decision making. Group communication in context: Studies of natural groups (1994), 263--282.",
      "doi": ""
    },
    {
      "text": "Lt Col James L Brickell, Lt Col David B Porter, Lt Col Michael F Reynolds, and Capt Richard D Cosgrove. 1994. Assigning students to groups for engineering design projects: A comparison of fve methods. Journal of Engineering Education 83, 3 (1994), 259--262.",
      "doi": ""
    },
    {
      "text": "Sally A Carless and Caroline De Paola. 2000. The measurement of cohesion in work teams. Small group research 31, 1 (2000), 71--88.",
      "doi": ""
    },
    {
      "text": "Paula E. Chan, Kristall J. Graham-Day, Virginia A. Ressa, Mary T. Peters, and Moira Konrad. 2014. Beyond Involvement: Promoting Student Ownership of Learning in Classrooms. Intervention in School and Clinic 50, 2 (2014), 105--113. DOI: http://dx.doi.org/10.1177/1053451214536039",
      "doi": ""
    },
    {
      "text": "Kenneth J Chapman, Matthew Meuter, Dan Toy, and Lauren Wright. 2006. Can't we pick our own groups? The infuence of group selection method on group dynamics and outcomes. Journal of Management Education 30, 4 (2006), 557--569.",
      "doi": ""
    },
    {
      "text": "David T Conley and Elizabeth M French. 2014. Student ownership of learning as a key component of college readiness. American Behavioral Scientist 58, 8 (2014), 1018--1034.",
      "doi": ""
    },
    {
      "text": "Mary L Connerley and Fred A Mael. 2001. The importance and invasiveness of student team selection criteria. Journal of management education 25, 5 (2001), 471--494.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Vanessa Evers, Satyan Ramlal, Maarten Van Someren, Lloyd Rutledge, Natalia Stash, Lora Aroyo, and Bob Wielinga. 2008. The effects of transparency on trust in and acceptance of a content-based art recommender. User Modeling and User-Adapted Interaction 18, 5 (2008), 455.",
      "doi": "10.1007/s11257-008-9051-3"
    },
    {
      "text": "Amy Edmondson. 1999. Psychological safety and learning behavior in work teams. Administrative science quarterly 44, 2 (1999), 350--383.",
      "doi": ""
    },
    {
      "text": "Susan Brown Feichtner and Elaine Actis Davis. 1984. Why some groups fail: A survey of students' experiences with learning groups. Organizational Behavior Teaching Review 9, 4 (1984), 58--73.",
      "doi": ""
    },
    {
      "text": "R Brent Gallupe, Lana M Bastianutti, and William H Cooper. 1991. Unblocking brainstorms. Journal of applied psychology 76, 1 (1991), 137.",
      "doi": ""
    },
    {
      "text": "Elena L Glassman, Aaron Lin, Carrie J Cai, and Robert C Miller. 2016. Learnersourcing personalized hints. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1626--1636.",
      "doi": "10.1145/2818048.2820011"
    },
    {
      "text": "Elena L Glassman and Robert C Miller. 2016. Leveraging Learners for Teaching Programming and Hardware Design at Scale. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion. ACM, 37--40.",
      "doi": "10.1145/2818052.2874319"
    },
    {
      "text": "Beth Harry, Keith M Sturges, and Janette K Klingner. 2005. Mapping the process: An exemplar of process and challenge in grounded theory analysis. Educational researcher 34, 2 (2005), 3--13.",
      "doi": ""
    },
    {
      "text": "Emily M. Hastings, Farnaz Jahanbakhsh, Karrie Karahalios, Darko Marinov, and Brian P. Bailey. 2018. Structure or Nurture? The Effects of Team-Building Activities and Team Composition on Team Outcomes. In Proceedings of the ACM on Human-Computer Interaction, Vol. 2. ACM.",
      "doi": "10.1145/3274337"
    },
    {
      "text": "Tyson R Henry. 2013. Creating effective student groups: an introduction to groupformation. org. In Proceeding of the 44th ACM technical symposium on Computer science education. ACM, 645--650.",
      "doi": ""
    },
    {
      "text": "Sujin K Horwitz and Irwin B Horwitz. 2007. The effects of team diversity on team outcomes: A meta-analytic review of team demography. Journal of management 33, 6 (2007), 987--1015.",
      "doi": ""
    },
    {
      "text": "Farnaz Jahanbakhsh, Wai-Tat Fu, Karrie Karahalios, Darko Marinov, and Brian Bailey. 2017. You Want Me to Work with Who?: Stakeholder Perceptions of Automated Team Formation in Project-based Courses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3201--3212.",
      "doi": "10.1145/3025453.3026011"
    },
    {
      "text": "Irving Lester Janis. 1982. Groupthink: Psychological studies of policy decisions and fascoes. Vol. 349. Houghton Miffin Boston.",
      "doi": ""
    },
    {
      "text": "Karen A Jehn, Gregory B Northcraft, and Margaret A Neale. 1999. Why differences make a difference: A feld study of diversity, confict and performance in workgroups. Administrative science quarterly 44, 4 (1999), 741--763.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, Jane Siegel, and Timothy W McGuire. 1984. Social psychological aspects of computer-mediated communication. American psychologist 39, 10 (1984), 1123.",
      "doi": ""
    },
    {
      "text": "Juho Kim. 2015. Learnersourcing: improving learning with collective learner activity. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "René F Kizilcec. 2016. How much information?: Effects of transparency on trust in an algorithmic interface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2390--2395.",
      "doi": "10.1145/2858036.2858402"
    },
    {
      "text": "Chinmay Kulkarni, Koh Pang Wei, Huy Le, Daniel Chia, Kathryn Papadopoulos, Justin Cheng, Daphne Koller, and Scott R Klemmer. 2013. Peer and self assessment in massive online classes. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 6 (2013), 33.",
      "doi": "10.1145/2505057"
    },
    {
      "text": "Walter Lasecki, Christopher Miller, Adam Sadilek, Andrew Abumoussa, Donato Borrello, Raja Kushalnagar, and Jeffrey Bigham. 2012. Real-time captioning by groups of non-experts. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology. ACM, 23--34.",
      "doi": "10.1145/2380116.2380122"
    },
    {
      "text": "Richard A Layton, Misty L Loughry, Matthew W Ohland, and George D Ricco. 2010. Design and Validation of a Web-Based System for Assigning Members to Teams Using Instructor-Specifed Criteria. Advances in Engineering Education 2, 1 (2010), n1.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with machines: The impact of algorithmic and data-driven management on human workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1603--1612.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Shang-Wen Daniel Li and Piotr Mitros. 2015. Learnersourced recommendations for remediation. In Advanced Learning Technologies (ICALT), 2015 IEEE 15th International Conference on. IEEE, 411--412.",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Angeliki Antoniou, Yannick Naudet, and Steven P Dow. 2016. Personality matters: Balancing for personality types leads to better outcomes for crowd teams. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 260--273.",
      "doi": "10.1145/2818048.2819979"
    },
    {
      "text": "Ioanna Lykourentzou, Robert E Kraut, and Steven P Dow. 2017. Team Dating Leads to Better Online Ad Hoc Collaborations. In CSCW. 2330--2343.",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Shannon Wang, Robert E Kraut, and Steven P Dow. 2016. Team dating: A self-organized team formation strategy for collaborative crowdsourcing. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1243--1249.",
      "doi": "10.1145/2851581.2892421"
    },
    {
      "text": "Sakthi Mahenthiran and Pamela J Rouse. 2000. The impact of group selection on student performance and satisfaction. International Journal of Educational Management 14, 6 (2000), 255--265.",
      "doi": ""
    },
    {
      "text": "Jeffrey A Mello. 1993. Improving individual member accountability in small work group settings. Journal of Management Education 17, 2 (1993), 253--259.",
      "doi": ""
    },
    {
      "text": "Piotr Mitros. 2015. Learnersourcing of complex assessments. In Proceedings of the Second (2015) ACM Conference on Learning@ Scale. ACM, 317--320.",
      "doi": "10.1145/2724660.2728683"
    },
    {
      "text": "Roshanak Zilouchian Moghaddam, Brian P Bailey, and Christina Poon. 2011. Ideatracker: An interactive visualization supporting collaboration and consensus building in online interface design discussions. In IFIP Conference on Human-Computer Interaction. Springer, 259--276.",
      "doi": ""
    },
    {
      "text": "Richard Nadeau, Edouard Cloutier, and J-H Guay. 1993. New evidence about the existence of a bandwagon effect in the opinion formation process. International Political Science Review 14, 2 (1993), 203--213.",
      "doi": ""
    },
    {
      "text": "Matthew W Ohland, Misty L Loughry, David J Woehr, Lisa G Bullard, Richard M Felder, Cynthia J Finelli, Richard A Layton, Hal R Pomeranz, and Douglas G Schmucker. 2012. The comprehensive assessment of team member effectiveness: Development of a behaviorally anchored rating scale for self-and peer evaluation. Academy of Management Learning & Education 11, 4 (2012), 609--630.",
      "doi": ""
    },
    {
      "text": "Amy Pavel, Dan B Goldman, Björn Hartmann, and Maneesh Agrawala. 2016. VidCrit: video-based asynchronous video review. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 517--528.",
      "doi": "10.1145/2984511.2984552"
    },
    {
      "text": "Matthew J Pearsall and Aleksander PJ Ellis. 2011. Thick as thieves: the effects of ethical orientation and psychological safety on unethical team behavior. Journal of Applied Psychology 96, 2 (2011), 401.",
      "doi": ""
    },
    {
      "text": "Scott Rice and Margaret N Gregor. 2016. E-Learning and the Academic Library: Essays on Innovative Initiatives. McFarland.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi and Michael S Bernstein. 2018. Hive: Collective Design Through Network Rotation. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 151.",
      "doi": "10.1145/3274420"
    },
    {
      "text": "James B Shaw. 2004. A fair go for all? The impact of intragroup diversity and diversity-management skills on student experiences and outcomes in team-based class projects. Journal of Management Education 28, 2 (2004), 139--169.",
      "doi": ""
    },
    {
      "text": "Jane Siegel, Vitaly Dubrovsky, Sara Kiesler, and Timothy W McGuire. 1986. Group processes in computer-mediated communication. Organizational behavior and human decision processes 37, 2 (1986), 157--187.",
      "doi": ""
    },
    {
      "text": "James Surowiecki. 2005. The wisdom of crowds. Anchor.",
      "doi": ""
    },
    {
      "text": "Kristen Vaccaro, Dylan Huang, Motahhare Eslami, Christian Sandvig, Kevin Hamilton, and Karrie Karahalios. 2018. The Illusion of Control: Placebo Effects of Control Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 16.",
      "doi": "10.1145/3173574.3173590"
    },
    {
      "text": "Lev Vygotsky. 1987. Zone of proximal development. Mind in society: The development of higher psycological processes 5291 (1987), 157.",
      "doi": ""
    },
    {
      "text": "Dai-Yi Wang, Sunny SJ Lin, and Chuen-Tsai Sun. 2007. DIANA: A computer-supported heterogeneous grouping system for teachers to conduct successful small learning groups. Computers in Human Behavior 23, 4 (2007), 1997--2010.",
      "doi": "10.1016/j.chb.2006.02.008"
    },
    {
      "text": "Helen Wauck, Yu-Chun Grace Yen, Wai-Tat Fu, Elizabeth Gerber, Steven P Dow, and Brian P Bailey. 2017. From in the Class or in the Wild?: Peers Provide Better Design Feedback Than External Crowds. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5580--5591.",
      "doi": "10.1145/3025453.3025477"
    },
    {
      "text": "Sarah Weir, Juho Kim, Krzysztof Z Gajos, and Robert C Miller. 2015. Learnersourcing subgoal labels for how-to videos. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 405--416.",
      "doi": "10.1145/2675133.2675219"
    },
    {
      "text": "Miaomiao Wen, Keith Maki, Xu Wang, Steven Dow, James D Herbsleb, and Carolyn Penstein Rosé. 2016. Transactivity as a Predictor of Future Collaborative Knowledge Integration in Team-Based Learning in Online Courses.. In EDM. 533--538.",
      "doi": ""
    },
    {
      "text": "Joseph Jay Williams, Juho Kim, Anna Rafferty, Samuel Maldonado, Krzysztof Z Gajos, Walter S Lasecki, and Neil Heffernan. 2016. Axis: Generating explanations at scale with learnersourcing and machine learning. In Proceedings of the Third (2016) ACM Conference on Learning@ Scale. ACM, 379--388.",
      "doi": "10.1145/2876034.2876042"
    },
    {
      "text": "Anita Williams Woolley, Christopher F Chabris, Alex Pentland, Nada Hashmi, and Thomas W Malone. 2010. Evidence for a collective intelligence factor in the performance of human groups. Science 330, 6004 (2010), 686--688.",
      "doi": ""
    }
  ]
}