{
  "doi": "10.1145/3313831.3376565",
  "title": "Augmented Reality for Older Adults: Exploring Acceptability of Virtual Coaches for Home-based Balance Training in an Aging Population",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Balance training has been shown to be effective in reducing risks of falling, which is a major concern for older adults. Usually, exercise programs are individually prescribed and monitored by physiotherapeutic or medical experts. Unfortunately, supervision and motivation of older adults during home-based exercises cannot be provided on a large scale, in particular, considering an ageing population. Augmented reality (AR) in combination with virtual coaches could provide a reasonable solution to this challenge. We present a first investigation of the acceptance of an AR coaching system for balance training, which can be performed at home. In a human-centered design approach we developed several mock-ups and prototypes, and evaluated them with 76 older adults. The results suggest that older adults find the system encouraging and stimulating. The virtual coach is perceived as an alive, calm, intelligent, and friendly human. However, usability of the entire AR system showed a significant negative correlation with participants' age.",
  "authors": [
    {
      "name": "Fariba Mostajeran",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529141",
      "orcid": "missing"
    },
    {
      "name": "Frank Steinicke",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    },
    {
      "name": "Oscar Javier Ariza Nunez",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529093",
      "orcid": "missing"
    },
    {
      "name": "Dimitrios Gatsios",
      "institution": "University of Ioannina, Ioannina, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658974845",
      "orcid": "missing"
    },
    {
      "name": "Dimitrios Fotiadis",
      "institution": "University of Ioannina, Ioannina, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338634",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adaptable and personalized game-based training system for fall prevention.",
      "doi": ""
    },
    {
      "text": "Stefano Abbate, Marco Avvenuti, Francesco Bonatesta, Guglielmo Cola, Paolo Corsini, and Alessio Vecchio. 2012. A smartphone-based fall detection system. Pervasive and Mobile Computing 8, 6 (2012), 883--899.",
      "doi": "10.1016/j.pmcj.2012.08.003"
    },
    {
      "text": "WHO Ageing and LC Unit. 2008. WHO global report on falls prevention in older age. World Health Organization (2008).",
      "doi": ""
    },
    {
      "text": "Inaki Merino Albaina, Thomas Visser, Charles APG Van Der Mast, and Martijn H Vastenburg. 2009. Flowie: A persuasive virtual coach to motivate elderly individuals to walk. In Pervasive Computing Technologies for Healthcare, 2009. PervasiveHealth 2009. 3rd International Conference on. IEEE, 1--7.",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Jim Blascovich, Andrew C Beall, and Jack M Loomis. 2003. Interpersonal distance in immersive virtual environments. Personality and Social Psychology Bulletin 29, 7 (2003), 819--833.",
      "doi": "10.1145/3452918.3458804"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114--123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Christoph Bartneck, Dana Kuli´c, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement instruments for the anthropomorphism, animacy, likeability, perceived intelligence, and perceived safety of robots. International journal of social robotics 1, 1 (2009), 71--81.",
      "doi": ""
    },
    {
      "text": "Olivier Beauchet, Véronique Dubost, François Herrmann, Muriel Rabilloud, Régis Gonthier, and Reto W Kressig. 2005. Relationship between dual-task related gait changes and intrinsic risk factors for falls among transitional frail older adults. Aging clinical and experimental research 17, 4 (2005), 270--275.",
      "doi": ""
    },
    {
      "text": "Michael Lo Bianco, Sonja Pedell, and Gianni Renda. 2016. Augmented reality and home modifications: a tool to empower older adults in fall prevention. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. ACM, 499--507.",
      "doi": "10.1145/3010915.3010929"
    },
    {
      "text": "Timothy W Bickmore, Rebecca A Silliman, Kerrie Nelson, Debbie M Cheng, Michael Winter, Lori Henault, and Michael K Paasche-Orlow. 2013. A randomized controlled trial of an automated exercise coach for older adults. Journal of the American Geriatrics Society 61, 10 (2013), 1676--1683.",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Elizabeth Burns and Ramakrishna Kakara. 2018. Deaths from falls among persons aged 65 years-United States, 2007--2016. Morbidity and Mortality Weekly Report 67, 18 (2018), 509.",
      "doi": ""
    },
    {
      "text": "Eling D de Bruin, Annina Reith, Manuela Dörflinger, and Kurt Murer. 2011. Feasibility of strength-balance training extended with computer game dancing in older people; does it affect dual task costs of walking. J Nov Physiother 1, 1 (2011), 104.",
      "doi": ""
    },
    {
      "text": "Julie Doyle, Cathy Bailey, Ben Dromey, and Cliodhna Ni Scanaill. 2010. BASE-An interactive technology solution to deliver balance and strength exercises to older adults. In 2010 4th International Conference on Pervasive Computing Technologies for Healthcare. IEEE, 1--5.",
      "doi": ""
    },
    {
      "text": "Ruixiang Du, Vinayak Jagtap, Yanren Long, Oke Onwuka, and Taskin Padir. 2014. Robotics enabled in-home environment screening for fall risks. In Proceedings of the 2014 workshop on Mobile augmented reality and robotic technology-based systems. ACM, 9--12.",
      "doi": "10.1145/2609829.2609836"
    },
    {
      "text": "Yasmin Felberbaum, Joel Lanir, and Patrice L Tamar Weiss. 2018. Challenges and Requirements for Technology to Support Mobility of Older Adults. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW545.",
      "doi": "10.1145/3170427.3188637"
    },
    {
      "text": "Marisa Ferrari, Barbara Harrison, Osamah Rawashdeh, Muawea Rawashdeh, Robert Hammond, and Michael Maddens. 2012. A pilot study testing a fall prevention intervention for older adults: determining the feasibility of a five-sensor motion detection system. Journal of gerontological nursing 38, 1 (2012), 13--16.",
      "doi": ""
    },
    {
      "text": "Bruno Neves Ferreira, Vânia Guimarães, and Hugo Sereno Ferreira. 2013. Smartphone based fall prevention exercises. In 2013 IEEE 15th International Conference on e-Health Networking, Applications and Services (Healthcom 2013). IEEE, 643--647.",
      "doi": ""
    },
    {
      "text": "National Institute for Health and Care Excellence. 2013. Falls in older people: assessing risk and prevention. NICE.",
      "doi": ""
    },
    {
      "text": "Caroline Garcia Forlim, Lukas Bittner, Fariba Mostajeran, Frank Steinicke, Jürgen Gallinat, and Simone Kühn. 2019. Stereoscopic Rendering via Goggles Elicits Higher Functional Connectivity During Virtual Reality Gaming. Frontiers in human neuroscience 13 (2019), 365.",
      "doi": ""
    },
    {
      "text": "John Frewen, Bellinda King-Kallimanis, Gerard Boyle, and Rose Anne Kenny. 2014a. Recent syncope and unexplained falls are associated with poor cognitive performance. Age and Ageing 44, 2 (12 2014), 282--286. DOI: http://dx.doi.org/10.1093/ageing/afu191",
      "doi": ""
    },
    {
      "text": "John Frewen, Bellinda King-Kallimanis, Gerard Boyle, and Rose Anne Kenny. 2014b. Recent syncope and unexplained falls are associated with poor cognitive performance. Age and ageing 44, 2 (2014), 282--286.",
      "doi": ""
    },
    {
      "text": "Hilde AE Geraedts, Wiebren Zijlstra, Wei Zhang, Sjoerd Bulstra, and Martin Stevens. 2014. Adherence to and effectiveness of an individually tailored home-based exercise program for frail older adults, driven by mobility monitoring: design of a prospective cohort study. BMC public health 14, 1 (2014), 570.",
      "doi": ""
    },
    {
      "text": "Kathrin M Gerling, Regan L Mandryk, and Conor Linehan. 2015. Long-term use of motion-based video games in care home settings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1573--1582.",
      "doi": "10.1145/2702123.2702125"
    },
    {
      "text": "Kathrin Maria Gerling, Jonas Schild, and Maic Masuch. 2010. Exergame design for elderly users: the case study of SilverBalance. In Proceedings of the 7th International Conference on Advances in Computer Entertainment Technology. ACM, 66--69.",
      "doi": "10.1145/1971630.1971650"
    },
    {
      "text": "Julian Hamm, Arthur G Money, Anita Atwal, and Ioannis Paraskevopoulos. 2016. Fall prevention intervention technologies: A conceptual framework and survey of the state of the art. Journal of biomedical informatics 59 (2016), 319--345.",
      "doi": "10.1016/j.jbi.2015.12.013"
    },
    {
      "text": "Richard Harte, Liam Glynn, Alejandro Rodríguez-Molinero, Paul MA Baker, Thomas Scharf, Leo R Quinlan, and Gearóid ÓLaighin. 2017. A human-centered design methodology to enhance the usability, human factors, and user experience of connected health systems: a three-phase methodology. JMIR human factors 4, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Martin G Jorgensen, Uffe Laessoe, Carsten Hendriksen, Ole Bruno Faurholt Nielsen, and Per Aagaard. 2012. Efficacy of Nintendo Wii training on mechanical leg muscle function and postural balance in community-dwelling older adults: a randomized controlled trial. Journals of Gerontology Series A: Biomedical Sciences and Medical Sciences 68, 7 (2012), 845--852.",
      "doi": ""
    },
    {
      "text": "Hiroki Kayama, Kazuya Okamoto, Shu Nishiguchi, Minoru Yamada, Tomohiro Kuroda, and Tomoki Aoyama. 2014. Effect of a Kinect-based exercise game on improving executive cognitive performance in community-dwelling elderly: case control study. Journal of medical Internet research 16, 2 (2014), e61.",
      "doi": ""
    },
    {
      "text": "I-Jui Lee, Chien-Hsu Chen, and Kuo-Ping Chang. 2016. Augmented reality technology combined with three-dimensional holography to train the mental rotation ability of older adults. Computers in Human Behavior 65 (2016), 488--500.",
      "doi": "10.1016/j.chb.2016.09.014"
    },
    {
      "text": "Sha Liang. 2016. Design principles of augmented reality focusing on the ageing population. In Proceedings of the 30th International BCS Human Computer Interaction Conference: Fusion! BCS Learning & Development Ltd., 2.",
      "doi": "10.14236/ewic/HCI2016.2"
    },
    {
      "text": "Fariba Mostajeran, Nikolaos Katzakis, Oscar Ariza, Jann Philipp Freiwald, and Frank Steinicke. 2019. Welcoming a holographic virtual coach for balance training at home: two focus groups with older adults. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 1465--1470.",
      "doi": ""
    },
    {
      "text": "John Murphy and Bernard Isaacs. 1982. The post-fall syndrome. Gerontology 28, 4 (1982), 265--270.",
      "doi": ""
    },
    {
      "text": "Corinna Ogonowski, Konstantin Aal, Daryoush Vaziri, Thomas Von Rekowski, Dave Randall, Dirk Schreiber, Rainer Wieching, and Volker Wulf. 2016. ICT-based fall prevention system for older adults: qualitative results from a long-term field study. ACM Transactions on Computer-Human Interaction (TOCHI) 23, 5 (2016), 29.",
      "doi": "10.1145/2967102"
    },
    {
      "text": "American Geriatrics Society Panel on Prevention of Falls in Older Persons and British Geriatrics Society. 2011. Summary of the updated American Geriatrics Society/British Geriatrics Society clinical practice guideline for prevention of falls in older persons. Journal of the American Geriatrics Society 59, 1 (2011), 148--157.",
      "doi": ""
    },
    {
      "text": "Marousa Pavlou, Ari Lingeswaran, Rosalyn A Davies, Michael A Gresty, and Adolfo M Bronstein. 2004. Simulator based rehabilitation in refractory dizziness. Journal of neurology 251, 8 (2004), 983--995.",
      "doi": ""
    },
    {
      "text": "Mara Pereira Guerreiro, Isa Brito Félix, Afonso Cavaco, Ana Paula Cláudio, Anabela Mendes, João Balsa, Maria Beatriz Carmo, Nuno Pimenta, and Adriana Henriques. 2019. Development of a complex intervention to improve adherence to antidiabetic medication in older people using an anthropomorphic virtual assistant software. Frontiers in pharmacology 10 (2019), 680.",
      "doi": ""
    },
    {
      "text": "Yusuf Pisan, Jaime Garcia Marin, and Karla Felix Navarro. 2013. Improving lives: using Microsoft Kinect to predict the loss of balance for elderly users under cognitive load. In Proceedings of The 9th Australasian conference on interactive entertainment: matters of life and death. ACM, 29.",
      "doi": "10.1145/2513002.2513026"
    },
    {
      "text": "Sandra Poeschl and Nicola Doering. 2015. Measuring co-presence and social presence in virtual environments--psychometric construction of a german scale for a fear of public speaking scenario. ANNUAL REVIEW OF CYBERTHERAPY AND TELEMEDICINE 2015 (2015), 58.",
      "doi": ""
    },
    {
      "text": "BS Rajaratnam, J Gui Kaien, K Lee Jialin, Kwek SweeSin, S Sim FenRu, Lee Enting, E Ang YiHsia, Ng KeatHwee, Su Yunfeng, W Woo YingHowe, and others. 2013. Does the inclusion of virtual reality games within conventional rehabilitation enhance balance retraining after a recent episode of stroke? Rehabilitation research and practice 2013 (2013).",
      "doi": ""
    },
    {
      "text": "M. Clare Robertson, A John Campbell, Melinda M. Gardner, and Nancy Devlin. 2002. Preventing injuries in older people by preventing falls: A meta-analysis of individual-level data. Journal of the American geriatrics society 50, 5 (2002), 905--911.",
      "doi": ""
    },
    {
      "text": "Rafael Saracchini, Carlos Catalina-Ortega, and Luca Bordoni. 2015. A mobile augmented reality assistive technology for the elderly. Comunicar 23, 45 (2015), 65--74.",
      "doi": ""
    },
    {
      "text": "Daniel Schoene, Stephen R. Lord, Kim Delbaere, Connie Severino, Thomas A Davies, and Stuart T Smith. 2013. A randomized controlled pilot study of home-based step training in older people using videogame technology. PloS one 8, 3 (2013), e57734.",
      "doi": ""
    },
    {
      "text": "Vicky Scott, Marty Pearce, and Cate Pengelly. 2005. Technical report: Injury resulting from falls among Canadians age 65 and over on the analysis of data from the Canadian community health survey, cycle 2.1. Report on seniors' falls in Canada (2005).",
      "doi": ""
    },
    {
      "text": "Hiroyuki Shimada, Megumi Suzukawa, Anne Tiedemann, Kumiko Kobayashi, Hideyo Yoshida, and Takao Suzuki. 2009. Which neuromuscular or cognitive test is the optimal screening tool to predict falls in frail community-dwelling older people? Gerontology 55, 5 (2009), 532--538.",
      "doi": ""
    },
    {
      "text": "Tiffany E. Shubert. 2011. Evidence-based exercise prescription for balance and falls prevention: a current review of the literature. Journal of geriatric physical therapy 34, 3 (2011), 100--108.",
      "doi": ""
    },
    {
      "text": "Paula Alexandra Silva, Francisco Nunes, Ana Vasconcelos, Maureen Kerwin, Ricardo Moutinho, and Pedro Teixeira. 2013. Using the smartphone accelerometer to monitor fall risk while playing a game: the design and usability evaluation of dance! Don't fall. In International Conference on Augmented Cognition. Springer, 754--763.",
      "doi": ""
    },
    {
      "text": "Patrícia Silveira, Rolf Van De Langenberg, Eva Van Het Reve, Florian Daniel, Fabio Casati, and Eling D De Bruin. 2013. Tablet-based strength-balance training to motivate and improve adherence to exercise in independently living older people: a phase II preclinical exploratory trial. Journal of medical Internet research 15, 8 (2013), e159.",
      "doi": ""
    },
    {
      "text": "Devinder Kaur Ajit Singh, BS Rajaratnam, V Palaniswamy, VP Raman, PS Bong, and H Pearson. 2012. Effects of balance-focused interactive games compared to therapeutic balance classes for older women. Climacteric 16, 1 (2012), 141--146.",
      "doi": ""
    },
    {
      "text": "Stuart T Smith, Thomas A Davies, and Jamie Lennox. 2013. Step Training System: An ICT solution to measure and reduce fall risk in older adults. In 2013 35th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 7033--7035.",
      "doi": ""
    },
    {
      "text": "David Sparrow, Daniel J Gottlieb, Deborah DeMolles, and Roger A Fielding. 2011. Increases in muscle strength and balance using a resistance training program administered via a telecommunications system in older adults. Journals of Gerontology Series A: Biomedical Sciences and Medical Sciences 66, 11 (2011), 1251--1257.",
      "doi": ""
    },
    {
      "text": "Bernd Strauss. 2002. Social facilitation in motor tasks: a review of research and theory. Psychology of sport and exercise 3, 3 (2002), 237--256.",
      "doi": ""
    },
    {
      "text": "Jamie L Tait, Rachel L Duckham, Catherine M Milte, Luana C Main, and Robin M Daly. 2017. Influence of sequential vs. simultaneous dual-task exercise training on cognitive function in older adults. Frontiers in aging neuroscience 9 (2017), 368.",
      "doi": ""
    },
    {
      "text": "Lynne M Taylor, Ralph Maddison, Leila A Pfaeffli, Jonathan C Rawstorn, Nicholas Gant, and Ngaire M Kerse. 2012a. Activity and energy expenditure in older people playing active video games. Archives of physical medicine and rehabilitation 93, 12 (2012), 2281--2286.",
      "doi": ""
    },
    {
      "text": "Matthew JD Taylor, Teshk Shawis, Rebecca Impson, Katie Ewins, Darren McCormick, and Murray Griffin. 2012b. Nintendo Wii as a training tool in falls prevention rehabilitation: case studies. Journal of the American Geriatrics Society 60, 9 (2012), 1781--1783.",
      "doi": ""
    },
    {
      "text": "Christiana Tsiourti, Emilie Joly, Cindy Wings, Maher Ben Moussa, and Katarzyna Wac. 2014. Virtual assistive companions for older adults: qualitative field study and design implications. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. ICST (Institute for Computer Sciences, Social-Informatics and . . . , 57--64.",
      "doi": "10.4108/icst.pervasivehealth.2014.254943"
    },
    {
      "text": "Shilpa Tyagi, Daniel SY Lim, Wilbert HH Ho, Yun Qing Koh, Vincent Cai, Gerald CH Koh, and Helena Legido-Quigley. 2018. Acceptance of tele-rehabilitation by stroke patients: perceived barriers and facilitators. Archives of physical medicine and rehabilitation 99, 12 (2018), 2472--2477.",
      "doi": ""
    },
    {
      "text": "Mike van Diest, Jan Stegenga, Heinrich J Wörtche, Klaas Postema, Gijsbertus J Verkerke, and Claudine JC Lamoth. 2014. Suitability of Kinect for measuring whole body movement patterns during exergaming. Journal of biomechanics 47, 12 (2014), 2925--2932.",
      "doi": ""
    },
    {
      "text": "Joe Verghese, Herman Buschke, Lisa Viola, Mindy Katz, Charles Hall, Gail Kuslansky, and Richard Lipton. 2002. Validity of divided attention tasks in predicting falls in older individuals: a preliminary study. Journal of the American Geriatrics Society 50, 9 (2002), 1572--1576.",
      "doi": ""
    },
    {
      "text": "Marjorie Woollacott and Anne Shumway-Cook. 2002. Attention and the control of posture and gait: a review of an emerging area of research. Gait & posture 16, 1 (2002), 1--14.",
      "doi": ""
    },
    {
      "text": "Alan Yusheng Wu and Cosmin Munteanu. 2018. Understanding Older Users' Acceptance of Wearable Interfaces for Sensor-based Fall Risk Assessment. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 119.",
      "doi": "10.1145/3173574.3173693"
    },
    {
      "text": "Jung Younbo. 2019/9/20/. Promoting Active Ageing through Virtual & Augmented Reality. (2019/9/20/).",
      "doi": ""
    },
    {
      "text": "Miao Yu, Adel Rhuma, Syed Mohsen Naqvi, Liang Wang, and Jonathon Chambers. 2012. A posture recognition-based fall detection system for monitoring an elderly person in a smart home environment. IEEE transactions on information technology in biomedicine 16, 6 (2012), 1274--1286.",
      "doi": ""
    }
  ]
}