{
  "doi": "10.1145/3313831.3376600",
  "title": "UI Dark Patterns and Where to Find Them: A Study on Mobile Applications and User Perception",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "A Dark Pattern (DP) is an interface maliciously crafted to deceive users into performing actions they did not mean to do. In this work, we analyze Dark Patterns in 240 popular mobile apps and conduct an online experiment with 589 users on how they perceive Dark Patterns in such apps. The results of the analysis show that 95% of the analyzed apps contain one or more forms of Dark Patterns and, on average, popular applications include at least seven different types of deceiving interfaces. The online experiment shows that most users do not recognize Dark Patterns, but can perform better in recognizing malicious designs if informed on the issue. We discuss the impact of our work and what measures could be applied to alleviate the issue.",
  "tags": [
    "ethical design",
    "dark patterns",
    "user experiments"
  ],
  "authors": [
    {
      "name": "Linda Di Geronimo",
      "institution": "University of Zürich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502793216",
      "orcid": "missing"
    },
    {
      "name": "Larissa Braz",
      "institution": "University of Zürich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659663716",
      "orcid": "missing"
    },
    {
      "name": "Enrico Fregnan",
      "institution": "University of Zürich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526922",
      "orcid": "missing"
    },
    {
      "name": "Fabio Palomba",
      "institution": "University of Zürich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503696156",
      "orcid": "missing"
    },
    {
      "name": "Alberto Bacchelli",
      "institution": "University of Zürich, Zürich, Switzerland",
      "img": "/do/10.1145/contrib-81421597831/rel-imgonly/alberto_sqrd.jpg",
      "acmid": "81421597831",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2019a. Amazon. (2019). https://www.amazon.com",
      "doi": ""
    },
    {
      "text": "2019b. Amazon Photos. (2019). https://www.amazon.com/Amazon-Photos/b?ie=UTF8&node=13234696011",
      "doi": ""
    },
    {
      "text": "2019. ApowerREC Google Play page. (2019). https://play.google.com/store/apps/details?id=com.apowersoft.apowerrec&hl=en",
      "doi": ""
    },
    {
      "text": "2019. Barcode Scanner Google Play page. (2019). https://play.google.com/store/apps/details?id=com.lego.bricksmore",
      "doi": ""
    },
    {
      "text": "2019. Call Free - Free Call, Google Play page. (2019). https://play.google.com/store/apps/details?id=call.free.international.phone.call",
      "doi": ""
    },
    {
      "text": "2019. Experiment Dataset. (2019). https://figshare.com/s/048c984854a59429d0f0",
      "doi": ""
    },
    {
      "text": "2019a. Face Reading Google Play page. (2019). https://play.google.com/store/apps/details?id=app.facereading.signs",
      "doi": ""
    },
    {
      "text": "2019b. FaceApp Google Play page. (2019). https://play.google.com/store/apps/details?id=io.faceapp&hl=en",
      "doi": ""
    },
    {
      "text": "2019. Facebook. (2019). https://facebook.com",
      "doi": ""
    },
    {
      "text": "2019. Firefox. (2019). https://www.mozilla.org/en-US/firefox/new/",
      "doi": ""
    },
    {
      "text": "2019. Gmail. (2019). https://gmail.com",
      "doi": ""
    },
    {
      "text": "2019. Google Play Store. (2019). https://play.google.com/store",
      "doi": ""
    },
    {
      "text": "2019. Instagram. (2019). https://www.instagram.com",
      "doi": ""
    },
    {
      "text": "2019. Lego Juniors Google Play page. (2019). https://play.google.com/store/apps/details?id=com.lego.bricksmore",
      "doi": ""
    },
    {
      "text": "2019. Netflix. (2019). https://netflix.com",
      "doi": ""
    },
    {
      "text": "2019. One Plus 5. (2019). https://oneplus.com/5",
      "doi": ""
    },
    {
      "text": "2019. Reddit. (2019). https://www.reddit.com/",
      "doi": ""
    },
    {
      "text": "2019. Roblox Google Play page. (2019). https://play.google.com/store/apps/details?id=com.roblox.client",
      "doi": ""
    },
    {
      "text": "2019. Romwe. (2019). https://play.google.com/store/apps/details?id=com.romwe",
      "doi": ""
    },
    {
      "text": "2019. SensorTower. (2019). https://sensortower.com",
      "doi": ""
    },
    {
      "text": "2019. Snapseed. (2019). https://snapseed.online",
      "doi": ""
    },
    {
      "text": "2019. Spotify. (2019). https://spotify.com",
      "doi": ""
    },
    {
      "text": "2019. Tag With Ryan Google Play Page. (2019). https://www.amazon.com/Amazon-Photos/b?ie=UTF8&node=13234696011",
      "doi": ""
    },
    {
      "text": "2019. Talkatone Google Play page. (2019). https://play.google.com/store/apps/details?id=com.talkatone.android",
      "doi": ""
    },
    {
      "text": "2019. Twitter. (2019). https://twitter.com",
      "doi": ""
    },
    {
      "text": "2019. Wish. (2019). https://www.wish.com",
      "doi": ""
    },
    {
      "text": "Monica Anderson and Jingjing Jiang. 2018. Teens, Social Media & Technology Overview 2018. Technical Report. Pew Research Center, https://www.pewinternet.org/2018/05/31/teens-social-media-technology-2018//.",
      "doi": ""
    },
    {
      "text": "Carmelo Ardito, Paolo Buono, Danilo Caivano, Maria Francesca Costabile, and Rosa Lanzilotti. 2014. Investigating and promoting UX practice in industry: An experimental study. International Journal of Human-Computer Studies 72, 6 (2014), 542--551.",
      "doi": ""
    },
    {
      "text": "Dan Ariely and Gregory S Berns. 2010. Neuromarketing: the hope and hype of neuroimaging in business. Nature reviews neuroscience 11, 4 (2010), 284.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"Critical\" About Critical Design?. In Proceedings of the Conference on Human Factors in Computing Systems. 3297--3306.",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Javier A Bargas-Avila and Kasper Hornbæk. 2011. Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience. In Proceedings of the Conference on Human Factors in Computing Systems. 2689--2698.",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Brian Bowman, Niklas Elmqvist, and TJ Jankun-Kelly. 2012. Toward visualization for games: Theory, design space, and patterns. Transactions on Visualization and Computer Graphics 18, 11 (2012), 1956--1968.",
      "doi": "10.1109/TVCG.2012.77"
    },
    {
      "text": "Harry Brignull. 2019. Dark Patterns. Technical Report. Harry Brignull Dark Patterns website, https://www.darkpatterns.org/.",
      "doi": ""
    },
    {
      "text": "Will Browne and Mike Swarbrick Jones. 2017. What works in e-commerce-a meta-analysis of 6700 online experiments. Qubit Digital Ltd 21 (2017).",
      "doi": ""
    },
    {
      "text": "Gregory Conti and Edward Sobiesk. 2010. Malicious Interface Design: Exploiting the User. In Proceedings of the International Conference on World Wide Web. 271--280.",
      "doi": "10.1145/1772690.1772719"
    },
    {
      "text": "Eveline A Crone and Elly A Konijn. 2018. Media use and brain development during adolescence. Nature communications 9, 1 (2018), 588.",
      "doi": ""
    },
    {
      "text": "Nicholas S. Dalton, Emily Collins, and Paul Marshall. 2015. Display Blindness?: Looking Again at the Visibility of Situated Displays Using Eye-tracking. In Proceedings of the Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/2702123.2702150"
    },
    {
      "text": "Benedetto De Martino, Dharshan Kumaran, Ben Seymour, and Raymond J Dolan. 2006. Frames, biases, and rational decision-making in the human brain. Science 313, 5787 (2006), 684--687.",
      "doi": ""
    },
    {
      "text": "Ward Edwards. 1954. The theory of decision making. Psychological bulletin 51, 4 (1954), 380.",
      "doi": ""
    },
    {
      "text": "Madison Fansher, Shruthi Sai Chivukula, and Colin M Gray. 2018. # darkpatterns: UX Practitioner Conversations About Ethical Design. In Extended Abstracts of the Conference on Human Factors in Computing Systems. LBW082.",
      "doi": "10.1145/3170427.3188553"
    },
    {
      "text": "Dan Fitton and Janet C Read. 2019. Creating a Framework to Support the Critical Consideration of Dark Design Aspects in Free-to-Play Apps. In Proceedings of the International Conference on Interaction Design and Children. 407--418.",
      "doi": "10.1145/3311927.3323136"
    },
    {
      "text": "Batya Friedman, Peter H Kahn, and Alan Borning. 2008. Value sensitive design and information systems. The handbook of information and computer ethics (2008), 69--101.",
      "doi": ""
    },
    {
      "text": "Joseph H. Goldberg and Anna M. Wichansky. 2003. Chapter 23 - Eye Tracking in Usability Evaluation: A Practitioner's Guide. In The Mind's Eye, J. Hyönä, R. Radach, and H. Deubel (Eds.). North-Holland, 493 -- 516.",
      "doi": ""
    },
    {
      "text": "Colin M. Gray, Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L. Toombs. 2018. The Dark (Patterns) Side of UX Design. In Proceedings of the Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg, Sebastian Boring, Jo Vermeulen, and Jakub Dostal. 2014. Dark Patterns in Proxemic Interactions: A Critical Perspective. In Proceedings of the Conference on Designing Interactive Systems. 523--532.",
      "doi": "10.1145/2598510.2598541"
    },
    {
      "text": "Barbara Grimpe, Mark Hartswood, and Marina Jirotka. 2014. Towards a closer dialogue between policy and practice: responsible design in HCI. In Proceedings of the Conference on Human Factors in Computing Systems. 2965--2974.",
      "doi": "10.1145/2556288.2557364"
    },
    {
      "text": "Shipra Gupta. 2013. The psychological effects of perceived scarcity on consumers buying behavior. (2013).",
      "doi": ""
    },
    {
      "text": "Rachel Harrison, Derek Flood, and David Duce. 2013. Usability of mobile applications: literature review and rationale for a new usability model. Journal of Interaction Science 1, 1 (2013), 1.",
      "doi": ""
    },
    {
      "text": "David J Heeger and David Ress. 2002. What does fMRI tell us about neuronal activity? Nature Reviews Neuroscience 3, 2 (2002), 142.",
      "doi": ""
    },
    {
      "text": "Yu-Chen Hsieh and Kuo-Hsiang Chen. 2011. How different information types affect viewers attention on internet advertising. Computers in Human Behavior 27, 2 (2011), 935 -- 945.",
      "doi": "10.1016/j.chb.2010.11.019"
    },
    {
      "text": "Ashley Karr. 2014. Ethical Design. Technical Report. Interactions ACM, https://interactions.acm.org/blog/view/ethical-design.",
      "doi": ""
    },
    {
      "text": "Shinjiro Kawato and Nobuji Tetsutani. 2004. Detection and tracking of eyes for gaze-camera control. Image and Vision Computing 22, 12 (2004), 1031 -- 1038.",
      "doi": ""
    },
    {
      "text": "Ralph Kimball and B Verplank E Harslem. 1982. Designing the Star user interface. Byte 7, 1982 (1982), 242--282.",
      "doi": ""
    },
    {
      "text": "Chris L Kleinke. 1986. Gaze and eye contact: a research review. Psychological bulletin 100, 1 (1986), 78.",
      "doi": ""
    },
    {
      "text": "Mike Kuniavsky. 2010. Smart things: ubiquitous computing user experience design. Elsevier.",
      "doi": ""
    },
    {
      "text": "Cherie Lacey and Catherine Caudwell. 2019. Cuteness as a Dark Pattern in Home Robots. In Proceedings of the International Conference on Human-Robot Interaction. 374--381.",
      "doi": ""
    },
    {
      "text": "Marta Kristín Lárusdóttir, Åsa Cajander, and Jan Gulliksen. 2012. The big picture of UX is missing in Scrum projects. In Proceedings of the International Workshop on the Interplay between User Experience (UX) Evaluation and System Development (I-UxSED). 49--54.",
      "doi": ""
    },
    {
      "text": "Henry Latham. 2018. Ethical design is a dangerous term. Technical Report. Medium, UX Collective, https://uxdesign.cc/ ethical-design-is-a-dangerous-term-b314a5e385f4.",
      "doi": ""
    },
    {
      "text": "Jamie Luguri and Lior Strahilevitz. 2019. Shining a Light on Dark Patterns. U of Chicago, Public Law Working Paper 719 (2019).",
      "doi": ""
    },
    {
      "text": "Kristiyan Lukanov, Horia A. Maior, and Max L. Wilson. 2016. Using fNIRS in Usability Testing: Understanding the Effect of Web Form Layout on Mental Workload. In Proceedings of the Conference on Human Factors in Computing Systems. 4011--4016.",
      "doi": ""
    },
    {
      "text": "Petri Mannonen, Maiju Aikala, Hanna Koskinen, and Paula Savioja. 2014. Uncovering the user experience with critical experience interviews. In Proceedings of the Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design. 452--455.",
      "doi": "10.1145/2686612.2686684"
    },
    {
      "text": "Arunesh Mathur, Gunes Acar, Michael Friedman, Elena Lucherini, Jonathan Mayer, Marshini Chetty, and Arvind Narayanan. 2019. Dark Patterns at Scale: Findings from a Crawl of 11K Shopping Websites. arXiv preprint arXiv:1907.07032 (2019).",
      "doi": ""
    },
    {
      "text": "Timothy P McNamara. 2005. Semantic priming: Perspectives from memory and word recognition. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Carol Moser, Sarita Y. Schoenebeck, and Paul Resnick. 2019. Impulse Buying: Design Practices and Consumer Needs. In Proceedings of the Conference on Human Factors in Computing Systems. 242:1--242:15.",
      "doi": "10.1145/3290605.3300472"
    },
    {
      "text": "Emily R. Murphy, Judy Illes, and Peter B. Reiner. 2008. Neuroethics of neuromarketing. Journal of Consumer Behaviour 7, 4--5 (2008), 293--302.",
      "doi": ""
    },
    {
      "text": "M. Nebeling, M. Speicher, and M. Norrie. 2013. W3Touch: Metrics-based Web Page Adaptation for Touch. In Proceedings of the Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Robert Nickerson, Mark Austreich, and Jamie Eng. 2014. Mobile technology and smartphone apps: A Diffusion of innovations analysis. (2014).",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994a. Enhancing the Explanatory Power of Usability Heuristics. In Proceedings of the Conference on Human Factors in Computing Systems. 152--158.",
      "doi": "10.1145/191666.191729"
    },
    {
      "text": "Jakob Nielsen. 1994b. Usability Inspection Methods. In Proceedings of the Conference Companion on Human Factors in Computing Systems. 413--414.",
      "doi": "10.1145/259963.260531"
    },
    {
      "text": "Jakob Nielsen. 1999. Designing Web Usability: The Practice of Simplicity. New Riders Publishing.",
      "doi": "10.5555/519216"
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic Evaluation of User Interfaces. In Proceedings of the Conference on Human Factors in Computing Systems. 249--256.",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "C. Nodder. 2013. Evil by design: Interaction design to lead us into temptation. John Wiley & Sons.",
      "doi": "10.5555/2826079"
    },
    {
      "text": "Harri Oinas-Kukkonen and Marja Harjumaa. 2009. Persuasive systems design: Key issues, process model, and system features. Communications of the Association for Information Systems 24, 1 (2009), 28.",
      "doi": ""
    },
    {
      "text": "Gwenn Schurgin O'Keeffe, Kathleen Clarke-Pearson, and others. 2011. The impact of social media on children, adolescents, and families. Pediatrics 127, 4 (2011), 800--804.",
      "doi": ""
    },
    {
      "text": "Justin W. Owens, Barbara S. Chaparro, and Evan M. Palmer. 2011. Text Advertising Blindness: The New Banner Blindness? J. Usability Studies 6, 3 (2011), 12:172--12:197.",
      "doi": ""
    },
    {
      "text": "Justin W. Owens, Evan M. Palmer, and Barbara S. Chaparro. 2014. The Pervasiveness of Text Advertising Blindness. J. Usability Studies 9, 2 (2014), 51--69.",
      "doi": "10.5555/2817709.2817711"
    },
    {
      "text": "Jay Patel, Gil Gershoni, Sanjay Krishnan, Matti Nelimarkka, Brandie Nonnecke, and Ken Goldberg. 2015. A Case Study in Mobile-Optimized vs. Responsive Web Application Design. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. 576--581.",
      "doi": "10.1145/2786567.2787135"
    },
    {
      "text": "Christopher A Paul. 2016. Values at play in digital games. New Media & Society (2016).",
      "doi": ""
    },
    {
      "text": "Sarah Perez. 2017. Google Play now considers user engagement, not just downloads, in ranking games. Technical Report. Techcrunch, https://techcrunch.com/ 2017/02/28/google-play-now-considersuser-engagement-not-just-downloads-in-ranking-games/.",
      "doi": ""
    },
    {
      "text": "Jenny Preece, Yvonne Rogers, Helen Sharp, David Benyon, Simon Holland, and Tom Carey. 1994. Human-Computer Interaction. Addison-Wesley Longman Ltd.",
      "doi": ""
    },
    {
      "text": "S Rajeshkumar, Ridha Omar, and Murni Mahmud. 2013. Taxonomies of user experience (UX) evaluation methods. In Proceedings of the International Conference on Research and Innovation in Information Systems. 533--538.",
      "doi": ""
    },
    {
      "text": "J. Redström. 2006. Persuasive Design: Fringes and Foundations. In Persuasive Technology.",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective Design. In CC.",
      "doi": ""
    },
    {
      "text": "K. Shilton, J. A. Koepfler, and K. R. Fleischmann. 2014. How to See Values in Social Computing: Methods for Studying Values Dimensions. In Proceedings of the Conference on Computer-Supported Cooperative Work and Social Computing.",
      "doi": ""
    },
    {
      "text": "Steven J. Stanton, Walter Sinnott-Armstrong, and Scott A. Huettel. 2017. Neuromarketing: Ethical Implications of its Use and Potential Misuse. Journal of Business Ethics 144, 4 (2017), 799--811.",
      "doi": ""
    },
    {
      "text": "Statcounter. 2019. Mobile Operating System Market Share Worldwide. Technical Report. Statcounter, https://gs.statcounter.com/os-market-share/mobile/ worldwide.",
      "doi": ""
    },
    {
      "text": "Statista. 2018. Market reach of the most popular Android app categories. Technical Report. Statista, https://www.statista.com/statistics/200855/ favourite-smartphone-app-categories-by-share -of-smartphone-users/.",
      "doi": ""
    },
    {
      "text": "Space Technologies. 2017. How Do Free Apps Make Money? Technical Report. Space Technologies, https://www.spaceotechnologies.com/ how-do-free-apps-make-money/.",
      "doi": ""
    },
    {
      "text": "Sabrina M Tom, Craig R Fox, Christopher Trepel, and Russell A Poldrack. 2007. The neural basis of loss aversion in decision-making under risk. Science 315, 5811 (2007), 515--518.",
      "doi": ""
    },
    {
      "text": "Janet Patton Tracy and Michael J Albers. 2006. Measuring cognitive load to test the usability of web sites. In Annual Conference-society for technical communication, Vol. 53. 256.",
      "doi": ""
    },
    {
      "text": "Nynke Tromp, Paul Hekkert, and Peter-Paul Verbeek. 2011. Design for socially responsible behavior: a classification of influence based on intended user experience. Design issues 27, 3 (2011), 3--19.",
      "doi": ""
    },
    {
      "text": "Yesim Isil Ulman, Tuna Cakar, and Gokcen Yildiz. 2015. Ethical Issues in Neuromarketing: ?I Consume, Therefore I am!\". Science and Engineering Ethics 21, 5 (2015), 1271--1284.",
      "doi": ""
    },
    {
      "text": "F. Ungureanu, R. G. Lupu, A. Cadar, and A. Prodan. 2017. Neuromarketing and visual attention study using eye tracking techniques. In 2017 21st International Conference on System Theory, Control and Computing. 553--557.",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg and Jessica Taylor Piotrowski. 2017. Plugged in: How media attract and affect youth. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Giovanni Vecchiato, Laura Astolfi, Fabrizio De Vico Fallani, Jlenia Toppi, Fabio Aloise, Francesco Bez, Daming Wei, Wanzeng Kong, Jounging Dai, Febo Cincotti, Donatella Mattia, and Fabio Babiloni. 2011. On the Use of EEG or MEG Brain Imaging Tools in Neuromarketing Research. Journal Computational Intelligence and Neuroscience, Article 3 (2011), 3:1--3:12 pages.",
      "doi": ""
    },
    {
      "text": "R. Mark Wilson, Jeannie Gaines, and Ronald Paul Hill. 2008. Neuromarketing and Consumer Free Will. Journal of Consumer Affairs 42, 3 (2008), 389--410.",
      "doi": ""
    },
    {
      "text": "José P Zagal, Staffan Björk, and Chris Lewis. 2013. Dark patterns in the design of games. In Foundations of Digital Games 2013.",
      "doi": ""
    },
    {
      "text": "Dongsong Zhang and Boonlit Adipat. 2005. Challenges, Methodologies, and Issues in the Usability Testing of Mobile Applications. International Journal of Human Computer Interaction 18, 3 (2005), 293--308.",
      "doi": ""
    }
  ]
}