{
  "doi": "10.1145/3313831.3376233",
  "title": "BISHARE: Exploring Bidirectional Interactions Between Smartphones and Head-Mounted Augmented Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "In pursuit of a future where HMD devices can be used in tandem with smartphones and other smart devices, we present BISHARE, a design space of cross-device interactions between smartphones and ARHMDs. Our design space is unique in that it is bidirectional in nature, as it examines how both the HMD can be used to enhance smartphone tasks, and how the smartphone can be used to enhance HMD tasks. We then present an interactive prototype that enables cross-device interactions across the proposed design space. A 12-participant user study demonstrates the promise of the design space and provides insights, observations, and guidance for the future.",
  "authors": [
    {
      "name": "Fengyuan Zhu",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527643",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Mohammed Al-Sada, Fumiko Ishizawa, Junichi Tsurukawa, and Tatsuo Nakajima. 2016. Input Forager: a User-Driven Interaction Adaptation Approach for Head Worn Displays. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia (MUM '16), 115--122. DOI: https://doi.org/10.1145/3012709.3012719",
      "doi": "10.1145/3012709.3012719"
    },
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Fraser Anderson, Tovi Grossman, Karan Singh, and George Fitzmaurice. 2017. Experimental Evaluation of Sketching on Surfaces in VR. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5643--5654. DOI: https://doi.org/10.1145/3025453.3025474",
      "doi": "10.1145/3025453.3025474"
    },
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Tovi Grossman, George Fitzmaurice, and Karan Singh. 2018. SymbiosisSketch: Combining 2D & 3D Sketching for Designing Detailed 3D Objects in Situ. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), Paper 185, 15 pages. DOI: https://doi.org/10.1145/3173574.3173759",
      "doi": "10.1145/3173574.3173759"
    },
    {
      "text": "Teo Babic, Harald Reiterer, and Michael Haller. 2018. Pocket6: A 6DoF Controller Based On A Simple Smartphone Application. In Proceedings of the Symposium on Spatial User Interaction (SUI '18), 2--10. DOI: https://doi.org/10.1145/3267782.3267785",
      "doi": "10.1145/3267782.3267785"
    },
    {
      "text": "Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus Plus Context Screens: Combining Display Technology with Visualization Techniques. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01), 31--40. DOI: https://doi.org/10.1145/502348.502354",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Hrvoje Benko and Edward W. Ishak. 2005. CrossDimensional Gestural Interaction Techniques for Hybrid Imrnersive Environments. In Proceedings of the 2005 IEEE Conference 2005 on Virtual Reality (VR '05), 209--216, 327. DOI: https://doi.org/10.1109/VR.2005.1492776",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, Eyal Ofek, Feng Zheng, and Andrew D. Wilson. 2015. FoveAR: Combining an Optically SeeThrough Near-Eye Display with Projector-Based Spatial Augmented Reality. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 129--135. DOI: https://doi.org/10.1145/2807442.2807493",
      "doi": ""
    },
    {
      "text": "Xiaojun Bi, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2011. Magic Desk: Bringing Multi-touch Surfaces into Desktop Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2511--2520. DOI: https://doi.org/10.1145/1978942.1979309",
      "doi": "10.1145/1978942.1979309"
    },
    {
      "text": "Mark Billinghurst, Adrian Clark and Gun Lee. 2015. A Survey of Augmented Reality. Foundations and Trends® in Human--Computer Interaction: Vol. 8: No. 2--3, pp 73--272. http://doi.org/10.1561/1100000049",
      "doi": ""
    },
    {
      "text": "Frederik Brudy, Christian Holz, Roman Rädle, Chi-Jui Wu, Steven Houben, Clemens Nylandsted Klokmose, and Nicolai Marquardt. 2019. Cross-Device Taxonomy: Survey, Opportunities and Challenges of Interactions Spanning Across Multiple Devices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), Paper 562, 28 pages. DOI: https://doi.org/10.1145/3290605.3300792",
      "doi": "10.1145/3290605.3300792"
    },
    {
      "text": "Rahul Budhiraja, Gun A. Lee, and Mark Billinghurst. 2013. Using a HHD with a HMD for Mobile AR Interaction. In 2013 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 1--6. https://doi.org/10.1109/ISMAR.2013.6671837.",
      "doi": ""
    },
    {
      "text": "Rahul Budhiraja, Gun A. Lee, and Mark Billinghurst. 2013. Interaction techniques for HMD-HHD hybrid AR systems. In 2013 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 243--244. DOI: https://doi.org/10.1109/ISMAR.2013.6671786",
      "doi": ""
    },
    {
      "text": "Alex Butler, Shahram Izadi, and Steve Hodges. 2008. SideSight: Multi-\"Touch\" Interaction Around Small Devices. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08), 201--204. DOI: https://doi.org/10.1145/1449715.1449746",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Simon Butscher, Sebastian Hubenschmid, Jens Müller, Johannes Fuchs, and Harald Reiterer. 2018. Clusters, Trends, and Outliers: How Immersive Technologies Can Facilitate the Collaborative Analysis of Multidimensional Data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), Paper 90, 12 pages. DOI: https://doi.org/10.1145/3173574.3173664",
      "doi": "10.1145/3173574.3173664"
    },
    {
      "text": "Xiang \"Anthony\" Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff, and Scott E. Hudson. 2014. Air+Touch: Interweaving Touch & In-air Gestures. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 519--525. DOI: https://doi.org/10.1145/2642918.2647392",
      "doi": ""
    },
    {
      "text": "Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 159--168. DOI: https://doi.org/10.1145/2556288.2556955",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Jessica Conditt. (2017). Worlds collide: VR and AR in 2018. Retrieved on April 4th , 2019 from https://www.engadget.com/2017/12/20/vr-and-ar-in2018/.",
      "doi": ""
    },
    {
      "text": "Laura Dipietro, Angelo M. Sabatini, and Paolo Dario. 2008. A Survey of Glove-Based Systems and Their Applications. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 38, 4 (July 2008): 461--482. DOI: https://doi.org/10.1109/TSMCC.2008.923862",
      "doi": "10.1109/tsmcc.2008.923862"
    },
    {
      "text": "Tomas Dorta, Gokce Kinayoglu, and Michael Hoffmann. 2014. Hyve-3D: A New Embodied Interface for Immersive Collaborative 3D Sketching. In ACM SIGGRAPH 2014 Studio (SIGGRAPH '14), 37:1--37:1. DOI: https://doi.org/10.1145/2619195.2656325",
      "doi": "10.1145/2619195.2656325"
    },
    {
      "text": "Tomás Dorta, Gokce Kinayoglu, and Michael Hoffmann. 2016. Hyve-3D and the 3D Cursor: Architectural co-design with freedom in Virtual Reality. International Journal of Architectural Computing 14, 2: 87--102. https://doi.org/10.1177/1478077116638921",
      "doi": ""
    },
    {
      "text": "George W. Fitzmaurice. 1993. Situated information spaces and spatially aware palmtop computers. Commun. ACM 36, 7 (July 1993), 39--49. DOI: http://doi.org/10.1145/159544.159566",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Mayank Goel, Jacob Wobbrock, and Shwetak Patel. 2012. GripSense: Using Built-in Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 545--554. DOI: https://doi.org/10.1145/2380116.2380184",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3933--3942. DOI: https://doi.org/10.1145/2702123.2702331",
      "doi": "10.1145/2702123.2702331"
    },
    {
      "text": "Martin Hachet, Benoit Bossavit, Aurélie Cohé, and Jean-Baptiste de la Rivière. 2011. Toucheo: Multitouch and Stereo Combined in a Seamless Workspace. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST'11), 587--592. DOI: https://doi.org/10.1145/2047196.2047273",
      "doi": ""
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2773--2782. DOI: https://doi.org/10.1145/2556288.2557170",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Khalad Hasan, David Ahlström, Junhyeok Kim, and Pourang Irani. 2017. AirPanes: Two-Handed AroundDevice Interaction for Pane Switching on Smartphones. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 679--691. DOI: https://doi.org/10.1145/3025453.3026029",
      "doi": "10.1145/3025453.3026029"
    },
    {
      "text": "Mikiyasu Hakoama, and Shotaro Hakoyama. 2011. The impact of cell phone use on social networking and development among college students. The American Association of Behavioral and Social Sciences Journal(AABSS), 15.1 (2011).",
      "doi": ""
    },
    {
      "text": "Juan David Hincapié-Ramos, Kasim Ozacar, Pourang P. Irani, and Yoshifumi Kitamura. 2015. GyroWand: IMU-based Raycasting for Augmented Reality HeadMounted Displays. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (SUI '15), 8998. DOI: https://doi.org/10.1145/2788940.2788947",
      "doi": "10.1145/2788940.2788947"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. Passive Real-world Interface Props for Neurosurgical Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94), 452--458. DOI: https://doi.org/10.1145/191666.191821",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Jeff Pierce, Mike Sinclair, and Eric Horvitz. 2000. Sensing Techniques for Mobile Interaction. In Proceedings of the 13th annual ACM symposium on User interface software and technology (UIST '00), 91--100. DOI: http://doi.org/10.1145/354401.354417",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Scott E. Hudson, Chris Harrison, Beverly L. Harrison, and Anthony LaMarca. 2010. Whack Gestures: Inexact and Inattentive Interaction with Mobile Devices. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10), 109--112. DOI: https://doi.org/10.1145/1709886.1709906",
      "doi": "10.1145/1709886.1709906"
    },
    {
      "text": "Sungjune Jang, Lawrence H. Kim, Kesler Tanner, Hiroshi Ishii, and Sean Follmer. 2016. Haptic Edge Display for Mobile Tactile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 3706--3716. DOI: https://doi.org/10.1145/2858036.2858264",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbæk. 2015. Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 147--156. DOI: https://doi.org/10.1145/2807442.2807475",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: Freehand 3D Interactions Anywhere Using a Wrist-worn Gloveless Sensor. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 167--176. DOI: https://doi.org/10.1145/2380116.2380139",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Mikko Kytö, Barrett Ens, Thammathip Piumsomboon, Gun A. Lee, and Mark Billinghurst. 2018. Pinpointing: Precise Head- and Eye-Based Target Selection for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18), Paper 81, 14 pages. DOI: https://doi.org/10.1145/3173574.3173655",
      "doi": "10.1145/3173574.3173655"
    },
    {
      "text": "Jinha Lee, Alex Olwal, Hiroshi Ishii, and Cati Boulanger. 2013. SpaceTop: Integrating 2D and Spatial 3D Interactions in a See-through Desktop Environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 189--192. DOI: https://doi.org/10.1145/2470654.2470680",
      "doi": "10.1145/2470654.2470680"
    },
    {
      "text": "Magic Leap. Retrieved April 4th , 2019 from https://www.magicleap.com/",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Ricardo Jota, Saul Greenberg, and Joaquim A. Jorge. 2011. The Continuous Interaction Space: Interaction Techniques Unifying Touch and Gesture on and Above a Digital Surface. In Proceedings of the 13th IFIP TC 13 International Conference on Human-computer Interaction - Volume Part III (INTERACT'11), 461--476. DOI: https://doi.org/10.1007/978--3--642--23765--2_32",
      "doi": ""
    },
    {
      "text": "Microsoft HoloLens. Retrieved April 4th , 2019 from https://hololens.com",
      "doi": ""
    },
    {
      "text": "A. Millette and M. J. McGuffin. 2016. DualCAD: Integrating Augmented Reality with a Desktop GUI and Smartphone Interaction. In 2016 IEEE International Symposium on Mixed and Augmented Reality (ISMAR-Adjunct), 21--26. DOI: https://doi.org/10.1109/ISMAR-Adjunct.2016.0030",
      "doi": ""
    },
    {
      "text": "Peter Mohr, Markus Tatzgern, Tobias Langlotz, Andreas Lang, Dieter Schmalstieg, and Denis Kalkofen. 2019. TrackCap: Enabling Smartphones for 3D Interaction on Mobile Head-Mounted Displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), Paper 585, 11 pages. DOI: https://doi.org/10.1145/3290605.3300815",
      "doi": "10.1145/3290605.3300815"
    },
    {
      "text": "Erwan Normand and Michael J. McGuffin. 2018. Enlarging a Smartphone with AR to Create a Handheld VESAD (Virtually Extended Screen-Aligned Display). In 2018 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 123--133. DOI: https://doi.org/10.1109/ISMAR.2018.00043",
      "doi": ""
    },
    {
      "text": "Benjamin Nuernberger, Eyal Ofek, Hrvoje Benko, and Andrew D. Wilson. 2016. SnapToReality: Aligning Augmented Reality to the Real World. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1233--1244. DOI: https://doi.org/10.1145/2858036.2858250",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Benedikt Mayer, Diako Mardanbegi, and Hans Gellersen. 2017. Gaze + Pinch Interaction in Virtual Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (SUI '17), 99--108. DOI: https://doi.org/10.1145/3131277.3132180",
      "doi": "10.1145/3131277.3132180"
    },
    {
      "text": "Krzysztof Pietroszek, James R. Wallace, and Edward Lank. 2015. Tiltcasting: 3D Interaction on Large Displays Using a Mobile Device. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 57--62. DOI: https://doi.org/10.1145/2807442.2807471",
      "doi": "10.1145/2807442.2807471"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14), 45--54. DOI: https://doi.org/10.1145/2669485.2669500",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Jun Rekimoto. 1996. Tilting Operations for Small Screen Interfaces. In Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology (UIST '96), 167--168. DOI: https://doi.org/10.1145/237091.237115",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Joan Sol Roo and Martin Hachet. 2017. One Reality: Augmenting How the Physical World is Experienced by Combining Multiple Mixed Reality Modalities. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17), 787--795. DOI: https://doi.org/10.1145/3126594.3126638",
      "doi": "10.1145/3126594.3126638"
    },
    {
      "text": "Houssem Saidi, Marcos Serrano, Pourang Irani, and Emmanuel Dubois. 2017. TDome: A Touch-Enabled 6DOF Interactive Device for Multi-Display Environments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5892--5904. DOI: https://doi.org/10.1145/3025453.3025661",
      "doi": "10.1145/3025453.3025661"
    },
    {
      "text": "Dominik Schmidt, Julian Seifert, Enrico Rukzio, and Hans Gellersen. 2012. A Cross-device Interaction Style for Mobiles and Surfaces. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 318--327. DOI: https://doi.org/10.1145/2317956.2318005",
      "doi": "10.1145/2317956.2318005"
    },
    {
      "text": "Marcos Serrano, Barrett Ens, Xing-Dong Yang, and Pourang Irani. 2015. Gluey: Developing a Head-Worn Display Interface to Unify the Interaction Experience in Distributed Display Environments. In Proceedings of the 17th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '15), 161--171. DOI: https://doi.org/10.1145/2785830.2785838",
      "doi": "10.1145/2785830.2785838"
    },
    {
      "text": "Marcos Serrano, Dale Hildebrandt, Sriram Subramanian, and Pourang Irani. 2014. Identifying suitable projection parameters and display configurations for mobile true-3D displays. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, NY, NY, USA, 135--143. DOI: https://doi.org/10.1145/2628363.2628375",
      "doi": "10.1145/2628363.2628375"
    },
    {
      "text": "Shaishav Siddhpuria, Sylvain Malacria, Mathieu Nancel, and Edward Lank. 2018. Pointing at a Distance with Everyday Smart Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), Paper 173, 11 pages. DOI: https://doi.org/10.1145/3173574.3173747",
      "doi": "10.1145/3173574.3173747"
    },
    {
      "text": "Maximilian Speicher, Brian D. Hall, Ao Yu, Bowen Zhang, Haihua Zhang, Janet Nebeling, and Michael Nebeling. 2018. XD-AR: Challenges and Opportunities in Cross-Device Augmented Reality Application Development. Proc. ACM Hum.-Comput. Interact. 2, EICS (June 2018), 7:1--7:24. DOI: https://doi.org/10.1145/3229089",
      "doi": "10.1145/3229089"
    },
    {
      "text": "Hemant Bhaskar Surale, Aakar Gupta, Mark Hancock, and Daniel Vogel. 2019. TabletInVR: Exploring the Design Space for Using a Multi-Touch Tablet in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), Paper 13, 13 pages. DOI: https://doi.org/10.1145/3290605.3300243",
      "doi": "10.1145/3290605.3300243"
    },
    {
      "text": "Philipp Wacker, Oliver Nowak, Simon Voelker, and Jan Borchers. 2019. ARPen: Mid-Air Object Manipulation Techniques for a Bimanual AR System with Pen & Smartphone. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), Paper 619, 12 pages. DOI: https://doi.org/10.1145/3290605.3300849",
      "doi": "10.1145/3290605.3300849"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3855--3864. DOI: https://doi.org/10.1145/2556288.2557090",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Dirk Wenig, Johannes Schöning, Alex Olwal, Mathias Oben, and Rainer Malaka. 2017. WatchThru: Expanding Smartwatch Displays with Mid-air Visuals and Wrist-worn Augmented Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 716--721. DOI: https://doi.org/10.1145/3025453.3025852",
      "doi": "10.1145/3025453.3025852"
    },
    {
      "text": "Daniel Wigdor, Clifton Forlines, Patrick Baudisch, John Barnwell, and Chia Shen. 2007. Lucid Touch: A See-through Mobile Device. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07), 269--278. DOI: https://doi.org/10.1145/1294211.1294259",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Christian Winkler, Markus Löchtefeld, David Dobbelstein, Antonio Krüger, and Enrico Rukzio. 2014. SurfacePhone: A Mobile Projection Device for Single- and Multiuser Everywhere Tabletop Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3513--3522. DOI: https://doi.org/10.1145/2556288.2557075",
      "doi": "10.1145/2556288.2557075"
    },
    {
      "text": "Paweł Woźniak, Lars Lischke, Benjamin Schmidt, Shengdong Zhao, and Morten Fjeld. 2014. Thaddeus: A Dual Device Interaction Space for Exploring Information Visualisation. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14), 41--50. DOI: https://doi.org/10.1145/2639189.2639237",
      "doi": "10.1145/2639189.2639237"
    },
    {
      "text": "Robert Xiao, Scott Hudson, and Chris Harrison. 2016. CapCam: Enabling Rapid, Ad-Hoc, Position-Tracked Interactions Between Devices. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16), 169--178. DOI: https://doi.org/10.1145/2992154.2992182",
      "doi": "10.1145/2992154.2992182"
    },
    {
      "text": "Chen Zhao, Ke-Yu Chen, Md Tanvir Islam Aumi, Shwetak Patel, and Matthew S. Reynolds. 2014. SideSwipe: Detecting In-air Gestures Around Mobile Devices Using Actual GSM Signal. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 527--534. DOI: https://doi.org/10.1145/2642918.2647380",
      "doi": "10.1145/2642918.2647380"
    }
  ]
}