{
  "doi": "10.1145/3313831.3376195",
  "title": "Therminator: Understanding the Interdependency of Visual and On-Body Thermal Feedback in Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Recent advances have made Virtual Reality (VR) more realistic than ever before. This improved realism is attributed to today's ability to increasingly appeal to human sensations, such as visual, auditory or tactile. While research also examines temperature sensation as an important aspect, the interdependency of visual and thermal perception in VR is still underexplored. In this paper, we propose Therminator, a thermal display concept that provides warm and cold on-body feedback in VR through heat conduction of flowing liquids with different temperatures. Further, we systematically evaluate the interdependency of different visual and thermal stimuli on the temperature perception of arm and abdomen with 25 participants. As part of the results, we found varying temperature perception depending on the stimuli, as well as increasing involvement of users during conditions with matching stimuli.",
  "authors": [
    {
      "name": "Sebastian Günther",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99659021644/rel-imgonly/sepp.jpg",
      "acmid": "99659021644",
      "orcid": "0000-0003-1281-2180"
    },
    {
      "name": "Florian Müller",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81464642529/rel-imgonly/flo_small.jpg",
      "acmid": "81464642529",
      "orcid": "0000-0002-9621-6214"
    },
    {
      "name": "Dominik Schön",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99659260815/rel-imgonly/ich_privat.jpg",
      "acmid": "99659260815",
      "orcid": "0000-0003-2704-2852"
    },
    {
      "name": "Omar Elmoghazy",
      "institution": "German University in Cairo, Cairo, Egypt",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529641",
      "orcid": "missing"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    },
    {
      "name": "Martin Schmitz",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-87958634757/rel-imgonly/martin_foto.jpg",
      "acmid": "87958634757",
      "orcid": "0000-0002-7332-3287"
    }
  ],
  "references": [
    {
      "text": "Moses Akazue, Martin Halvey, and Lynne Baillie. 2017. Using Thermal Stimuli to Enhance Photo-Sharing in Social Media. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 4 (June 2017), 21 pages. DOI: http://dx.doi.org/10.1145/3090050",
      "doi": "10.1145/3090050"
    },
    {
      "text": "Shimon Akiyama, Katsunari Sato, Yasutoshi Makino, and Takashi Maeno. 2013. ThermOn: Thermo-musical Interface for an Enhanced Emotional Experience. In Proceedings of the 2013 International Symposium on Wearable Computers (ISWC '13). ACM, NY, NY, USA, 45--52. DOI: http://dx.doi.org/10.1145/2493988.2494326",
      "doi": "10.1145/2493988.2494326"
    },
    {
      "text": "Edward Arens, Hui Zhang, and Charlie Huizenga. 2006. Partial- and whole-body thermal sensation and comfort- Part I: Uniform environmental conditions. Journal of Thermal Biology 31, 1 (2006), 53 -- 59. DOI: http://dx.doi.org/https://doi.org/10.1016/j.jtherbio.2005.11.028 Second International Meeting on Physiology and Pharmacology of Temperature Regulation.",
      "doi": ""
    },
    {
      "text": "Carrie Anne Balcer. 2014. Visual cues effects on temperature perception. (2014).",
      "doi": ""
    },
    {
      "text": "D. A. Bowman and R. P. McMahan. 2007. Virtual Reality: How Much Immersion Is Enough? Computer 40, 7 (July 2007), 36--43. DOI: http://dx.doi.org/10.1109/MC.2007.257",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "Zikun Chen, Wei Peng, Roshan Peiris, and Kouta Minamizawa. 2017. ThermoReality: Thermally Enriched Head Mounted Displays for Virtual Reality. In ACM SIGGRAPH 2017 Posters (SIGGRAPH '17). ACM, NY, NY, USA, Article 32, 2 pages. DOI: http://dx.doi.org/10.1145/3102163.3102222",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical Power Analysis for the Behavioral Sciences. Routledge. DOI: http://dx.doi.org/10.4324/9780203771587",
      "doi": ""
    },
    {
      "text": "AD Craig and MC Bushnell. 1994. The thermal grill illusion: unmasking the burn of cold pain. Science 265, 5169 (1994), 252--255. DOI: http://dx.doi.org/10.1126/science.8023144",
      "doi": ""
    },
    {
      "text": "Alexandra Delazio, Ken Nakagaki, Scott E Hudson, Jill Fain Lehman, and Alanson P Sample. 2018. Force Jacket : Pneumatically-Actuated Jacket for Embodied Haptic Experiences. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI'18 (2018), 1--12. DOI: http://dx.doi.org/10.1145/3173574.3173894",
      "doi": "10.1145/3173574.3173894"
    },
    {
      "text": "Anna Fenko, Hendrik N.J. Schifferstein, and Paul Hekkert. 2010. Looking hot or feeling hot: What determines the product experience of warmth? Materials Design 31, 3 (2010), 1325 -- 1331. DOI: http://dx.doi.org/https://doi.org/10.1016/j.matdes.2009.09.008",
      "doi": ""
    },
    {
      "text": "Lukas Gehrke, Sezen Akman, Pedro Lopes, Albert Chen, Avinash Kumar Singh, Hsiang-Ting Chen, Chin-Teng Lin, and Klaus Gramann. 2019. Detecting Visuo-Haptic Mismatches in Virtual Reality Using the Prediction Error Negativity of Event-Related Brain Potentials. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 427, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300657",
      "doi": "10.1145/3290605.3300657"
    },
    {
      "text": "Nicola Gerrett, Yacine Ouzzahra, and George Havenith. 2015. Distribution of Skin Thermal Sensitivity. 1--17. DOI: http://dx.doi.org/10.1007/978--3--319--26594-0_72--1",
      "doi": ""
    },
    {
      "text": "Daniel Gooch and Leon Watts. 2010. Communicating Social Presence Through Thermal Hugs.",
      "doi": ""
    },
    {
      "text": "Sebastian Günther, Mohit Makhija, Florian Müller, Dominik Schön, Max Mühlhäuser, and Markus Funk. 2019. PneumAct: Pneumatic Kinesthetic Actuation of Body Joints in Virtual Reality Environments. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). ACM, NY, NY, USA, 227--240. DOI: http://dx.doi.org/10.1145/3322276.3322302",
      "doi": "10.1145/3322276.3322302"
    },
    {
      "text": "Sebastian Günther, Florian Müller, Martin Schmitz, Jan Riemann, Niloofar Dezfuli, Markus Funk, Dominik Schön, and Max Mühlhäuser. 2018. CheckMate: Exploring a Tangible Augmented Reality Interface for Remote Interaction. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). Association for Computing Machinery, New York, NY, USA, Article Paper LBW570, 6 pages. DOI: http://dx.doi.org/10.1145/3170427.3188647",
      "doi": "10.1145/3170427.3188647"
    },
    {
      "text": "Katrina W. Hall, Wanda B. Hedrick, and Lunetta M. Williams. 2014. Every Day We're Shufflin': Empowering Students During In-School Independent Reading. Childhood Education 90, 2 (2014), 91--98. DOI: http://dx.doi.org/10.1080/00094056.2014.894789",
      "doi": ""
    },
    {
      "text": "Martin Halvey, Michael Henderson, Stephen A. Brewster, Graham Wilson, and Stephen A. Hughes. 2012. Augmenting Media with Thermal Stimulation. In Haptic and Audio Interaction Design, Charlotte Magnusson, Delphine Szymczak, and Stephen Brewster (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 91--100.",
      "doi": ""
    },
    {
      "text": "Ping-Hsuan Han, Yang-Sheng Chen, Kong-Chang Lee, Hao-Cheng Wang, Chiao-En Hsieh, Jui-Chun Hsiao, Chien-Hsing Chou, and Yi-Ping Hung. 2018. Haptic Around: Multiple Tactile Sensations for Immersive Environment and Interaction in Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (VRST '18). ACM, NY, NY, USA, Article 35, 10 pages. DOI: http://dx.doi.org/10.1145/3281505.3281507",
      "doi": "10.1145/3281505.3281507"
    },
    {
      "text": "James D. Hardy, Harold G. Wolff, and Helen Goodell. 1952. Pricking Pain Threshold in Different Body Areas. Proceedings of the Society for Experimental Biology and Medicine 80, 3 (1952), 425--427. DOI: http://dx.doi.org/10.3181/00379727--80--19644",
      "doi": ""
    },
    {
      "text": "Joel L.K Harrison and Karen D Davis. 1999. Cold-evoked pain varies with skin type and cooling rate: a psychophysical study in humans. PAIN 83, 2 (1999), 123 -- 135. DOI: http://dx.doi.org/https://doi.org/10.1016/S0304--3959(99)00099--8",
      "doi": ""
    },
    {
      "text": "Hsin-Ni Ho and Lynette A. Jones. 2006. Contribution of thermal cues to material discrimination and localization. Perception & Psychophysics 68, 1 (01 Jan 2006), 118--128. DOI: http://dx.doi.org/10.3758/BF03193662",
      "doi": ""
    },
    {
      "text": "Hunter G Hoffman, David R Patterson, and Gretchen J Carrougher. 2000. Use of virtual reality for adjunctive treatment of adult burn pain during physical therapy: a controlled study. The Clinical journal of pain 16, 3 (2000), 244--250.",
      "doi": ""
    },
    {
      "text": "Felix Hülsmann, Julia Fröhlich, Nikita Mattar, and Ipke Wachsmuth. 2014. Wind and Warmth in Virtual Reality: Implementation and Evaluation. In Proceedings of the 2014 Virtual Reality International Conference (VRIC '14). ACM, NY, NY, USA, Article 24, 8 pages. DOI: http://dx.doi.org/10.1145/2617841.2620712",
      "doi": "10.1145/2617841.2620712"
    },
    {
      "text": "Ali Israr, Seung-Chan S.-C. Kim, Jan Stec, and Ivan Poupyrev. 2012. Surround Haptics: Tactile Feedback for Immersive Gaming Experiences. CHI '12 Extended Abstracts on Human Factors in Computing Systems (2012), 1087--1090. DOI: http://dx.doi.org/10.1145/2212776.2212392",
      "doi": "10.1145/2212776.2212392"
    },
    {
      "text": "Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel Effects: Enriching Storytelling with Haptic Feedback. ACM Transactions on Applied Perception 11, 3 (sep 2014), 1--17. DOI: http://dx.doi.org/10.1145/2641570",
      "doi": "10.1145/2641570"
    },
    {
      "text": "D. Iwai, M. Aoki, and K. Sato. 2019. Non-Contact Thermo-Visual Augmentation by IR-RGB Projection. IEEE Transactions on Visualization and Computer Graphics 25, 4 (April 2019), 1707--1716. DOI: http://dx.doi.org/10.1109/TVCG.2018.2820121",
      "doi": "10.1109/TVCG.2018.2820121"
    },
    {
      "text": "Michael Izenson, Weibo Chen, Scott Phillips, Ariane Chepko, Grant Bue, Janet Ferl, and Daniel Cencer. 2015. Multifunctional cooling garment for space suit environmental control. 45th International Conference on Environmental Systems.",
      "doi": ""
    },
    {
      "text": "L. A. Jones and H. Ho. 2008. Warm or Cool, Large or Small? The Challenge of Thermal Displays. IEEE Transactions on Haptics 1, 1 (Jan 2008), 53--70. DOI: http://dx.doi.org/10.1109/TOH.2008.2",
      "doi": "10.1109/TOH.2008.2"
    },
    {
      "text": "Shoko Kanaya, Yuka Matsushima, and Kazuhiko Yokosawa. 2012. Does Seeing Ice Really Feel Cold? Visual-Thermal Interaction under an Illusory Body-Ownership. PLOS ONE 7, 11 (11 2012), 1--7. DOI: http://dx.doi.org/10.1371/journal.pone.0047293",
      "doi": ""
    },
    {
      "text": "Yukari Konishi, Nobuhisa Hanamitsu, Benjamin Outram, Youichi Kamiyama, Kouta Minamizawa, Ayahiko Sato, and Tetsuya Mizuguchi. 2018. Synesthesia suit. Lecture Notes in Electrical Engineering 432 (2018), 499--503. DOI: http://dx.doi.org/10.1007/978--981--10--4157-0_84",
      "doi": ""
    },
    {
      "text": "Vasil Kotsev, Atanas Nikolev, Kasper Pawlak, and Markus Löchtefeld. 2017. Investigating the Usage of Thermal Feedback As an Active Game Element. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia (MUM '17). ACM, NY, NY, USA, 91--95. DOI: http://dx.doi.org/10.1145/3152832.3152853",
      "doi": "10.1145/3152832.3152853"
    },
    {
      "text": "Wonjun Lee and Youn-Kyung Lim. 2012. Explorative Research on the Heat As an Expression Medium: Focused on Interpersonal Communication. Personal Ubiquitous Comput. 16, 8 (Dec. 2012), 1039--1049. DOI: http://dx.doi.org/10.1007/s00779-011-0424-y",
      "doi": "10.1007/s00779-011-0424-y"
    },
    {
      "text": "Markus Löchtefeld, Tuomas Lappalainen, Jani Väyrynen, Ashley Colley, and Jonna Häkkilä. 2017. Comparing Thermal and Haptic Feedback Mechanisms for Game Controllers. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 1829--1836. DOI: http://dx.doi.org/10.1145/3027063.3053172",
      "doi": "10.1145/3027063.3053172"
    },
    {
      "text": "Markus Löchtefeld, Nadine Lautemann, Sven Gehring, and Antonio Krüger. 2014. ambiPad: Enriching Mobile Digital Media with Ambient Feedback. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, NY, NY, USA, 295--298. DOI: http://dx.doi.org/10.1145/2628363.2628395",
      "doi": "10.1145/2628363.2628395"
    },
    {
      "text": "Diana Löffler, Robert Tscharn, and Jörn Hurtienne. 2018. Multimodal Effects of Color and Haptics on Intuitive Interaction with Tangible User Interfaces. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, NY, NY, USA, 647--655. DOI: http://dx.doi.org/10.1145/3173225.3173257",
      "doi": "10.1145/3173225.3173257"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Sijing You, and Patrick Baudisch. 2018. Adding Force Feedback to Mixed Reality Experiences and Games using Electrical Muscle Stimulation. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems CHI '18 c (2018), 1--13. DOI: http://dx.doi.org/10.1145/3173574.3174020",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Tomosuke Maeda and Tetsuo Kurahashi. 2019. TherModule: Wearable and Modular Thermal Feedback System Based on a Wireless Platform. In Proceedings of the 10th Augmented Human International Conference 2019 (AH2019). ACM, NY, NY, USA, Article 14, 8 pages. DOI: http://dx.doi.org/10.1145/3311823.3311826",
      "doi": "10.1145/3311823.3311826"
    },
    {
      "text": "Takuji Narumi, Akagawa Tomohiro, Young Ah Seong, and Michitaka Hirose. 2009. Characterizing the Space by Thermal Feedback through a Wearable Device. In Virtual and Mixed Reality, Randall Shumaker (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 355--364.",
      "doi": ""
    },
    {
      "text": "Ken Parsons. 2014. Human thermal environments: the effects of hot, moderate, and cold environments on human health, comfort, and performance. CRC press.",
      "doi": ""
    },
    {
      "text": "Roshan Lalintha Peiris, Liwei Chan, and Kouta Minamizawa. 2018. LiquidReality: Wetness Sensations on the Face for Virtual Reality. In Haptics: Science, Technology, and Applications, Domenico Prattichizzo, Hiroyuki Shinoda, Hong Z. Tan, Emanuele Ruffaldi, and Antonio Frisoli (Eds.). Springer International Publishing, Cham, 366--378.",
      "doi": ""
    },
    {
      "text": "Roshan Lalitha Peiris, Yuan-Ling Feng, Liwei Chan, and Kouta Minamizawa. 2019. ThermalBracelet: Exploring Thermal Haptic Feedback Around the Wrist. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 170, 11 pages. DOI: http://dx.doi.org/10.1145/3290605.3300400",
      "doi": "10.1145/3290605.3300400"
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, Liwei Chan, and Kouta Minamizawa. 2017. ThermoVR: Exploring Integrated Thermal Haptic Feedback with Head Mounted Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5452--5456. DOI: http://dx.doi.org/10.1145/3025453.3025824",
      "doi": "10.1145/3025453.3025824"
    },
    {
      "text": "Wei Peng, Roshan Lalintha Peiris, and Kouta Minamizawa. 2017. Exploring of Simulating Passing Through Feeling on the Wrist: Using Thermal Feedback. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, NY, NY, USA, 187--188. DOI: http://dx.doi.org/10.1145/3131785.3131819",
      "doi": "10.1145/3131785.3131819"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1731--1742. DOI: http://dx.doi.org/10.1145/3025453.3025723",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Nguyen Thi Ngoc Tram, Koon Chuan Raymond Koh, David Tolley, Shienny Karwita, Lin Lien-Ya, Yan Liangkun, Kala Shamaiah, Chow Eason Wai Tung, Ching Chiuan Yen, and Ellen Yi-Luen Do. 2018. Season Traveller: Multisensory Narration for Enhancing the Virtual Reality Experience. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 577, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3174151",
      "doi": "10.1145/3173574.3174151"
    },
    {
      "text": "John T.E. Richardson. 2011. Eta squared and partial eta squared as measures of effect size in educational research. Educational Research Review 6, 2 (2011), 135 -- 147. DOI: http://dx.doi.org/https://doi.org/10.1016/j.edurev.2010.12.001",
      "doi": ""
    },
    {
      "text": "Katsunari Sato and Takashi Maeno. 2012. Presentation of Sudden Temperature Change Using Spatially Divided Warm and Cool Stimuli. In Haptics: Perception, Devices, Mobility, and Communication, Poika Isokoski and Jukka Springare (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 457--468.",
      "doi": ""
    },
    {
      "text": "Emily Shaw, Tessa Roper, Tommy Nilsson, Glyn Lawson, Sue V.G. Cobb, and Daniel Miller. 2019. The Heat is On: Exploring User Behaviour in a Multisensory Virtual Environment for Fire Evacuation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 626, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300856",
      "doi": "10.1145/3290605.3300856"
    },
    {
      "text": "Mai Shibahara and Katsunari Sato. 2016. Illusion of Wet Sensation by Controlling Temperature and Softness of Dry Cloth. In Haptics: Perception, Devices, Control, and Applications, Fernando Bello, Hiroyuki Kajimoto, and Yon Visell (Eds.). Springer International Publishing, Cham, 371--379.",
      "doi": ""
    },
    {
      "text": "Joseph C. Stevens and Kenneth K. Choo. 1998. Temperature sensitivity of the body surface over the life span. Somatosensory & Motor Research 15, 1 (1998), 13--28. DOI: http://dx.doi.org/10.1080/08990229870925",
      "doi": ""
    },
    {
      "text": "Ivan E Sutherland. 1965. The ultimate display. Multimedia: From Wagner to virtual reality (1965), 506--508.",
      "doi": ""
    },
    {
      "text": "Jun'ya Takakura, Takayuki Nishimura, Damee Choi, Yuka Egashira, and Shigeki Watanuki. 2015. Nonthermal sensory input and altered human thermoregulation: effects of visual information depicting hot or cold environments. International Journal of Biometeorology 59, 10 (01 Oct 2015), 1453--1460. DOI: http://dx.doi.org/10.1007/s00484-015-0956--3",
      "doi": ""
    },
    {
      "text": "Jordan Tewell, Jon Bird, and George R. Buchanan. 2017. Heat-Nav: Using Temperature Changes As Navigation Cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1131--1135. DOI: http://dx.doi.org/10.1145/3025453.3025965",
      "doi": ""
    },
    {
      "text": "Jörg Trojan, Xaver Fuchs, Sophie-Louise Speth, and Martin Diers. 2018. The rubber hand illusion induced by visual-thermal stimulation. Scientific reports 8, 1 (2018), 12417. DOI: http://dx.doi.org/10.1038/s41598-018--29860--2",
      "doi": ""
    },
    {
      "text": "Haiying Wang, Guodan Liu, Songtao Hu, and Chao Liu. 2018. Experimental investigation about thermal effect of colour on thermal sensation and comfort. Energy and Buildings 173 (2018), 710 -- 718. DOI: http://dx.doi.org/https://doi.org/10.1016/j.enbuild.2018.06.008",
      "doi": ""
    },
    {
      "text": "P. Weir, C. Sandor, M. Swoboda, T. Nguyen, U. Eck, G. Reitmayr, and A. Day. 2013. Burnar: Involuntary heat sensations in augmented reality. In 2013 IEEE Virtual Reality (VR). 43--46. DOI: http://dx.doi.org/10.1109/VR.2013.6549357",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A. Brewster. 2017. Multi-moji: Combining Thermal, Vibrotactile & Visual Stimuli to Expand the Affective Range of Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1743--1755. DOI: http://dx.doi.org/10.1145/3025453.3025614",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Gavin Davidson, and Stephen A. Brewster. 2015. In the Heat of the Moment: Subjective Interpretations of Thermal Feedback During Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2063--2072. DOI: http://dx.doi.org/10.1145/2702123.2702219",
      "doi": "10.1145/2702123.2702219"
    },
    {
      "text": "Graham Wilson, Dobromir Dobrev, and Stephen A. Brewster. 2016a. Hot Under the Collar: Mapping Thermal Feedback to Dimensional Models of Emotion. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4838--4849. DOI: http://dx.doi.org/10.1145/2858036.2858205",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Euan Freeman, and Stephen Brewster. 2016b. Multimodal Affective Feedback: Combining Thermal, Vibrotactile, Audio and Visual Signals. In Proceedings of the 18th ACM International Conference on Multimodal Interaction (ICMI '16). ACM, NY, NY, USA, 400--401. DOI: http://dx.doi.org/10.1145/2993148.2998522",
      "doi": "10.1145/2993148.2998522"
    },
    {
      "text": "Graham Wilson, Martin Halvey, Stephen A. Brewster, and Stephen A. Hughes. 2011. Some Like It Hot: Thermal Feedback for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2555--2564. DOI: http://dx.doi.org/10.1145/1978942.1979316",
      "doi": "10.1145/1978942.1979316"
    },
    {
      "text": "Graham Wilson, Harry Maxwell, and Mike Just. 2017. Everything's Cool: Extending Security Warnings with Thermal Feedback. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 2232--2239. DOI: http://dx.doi.org/10.1145/3027063.3053127",
      "doi": "10.1145/3027063.3053127"
    },
    {
      "text": "Bob G. Witmer and Michael J. Singer. 1998. Measuring Presence in Virtual Environments: A Presence Questionnaire. Presence: Teleoperators and Virtual Environments 7, 3 (jun 1998), 225--240. DOI: http://dx.doi.org/10.1162/105474698565686",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 143--146. DOI: http://dx.doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "J. Xu, Y. Kuroda, S. Yoshimoto, and O. Oshiro. 2019. Non-contact Cold Thermal Display by Controlling Low-temperature Air Flow Generated with Vortex Tube. In 2019 IEEE World Haptics Conference (WHC). 133--138. DOI: http://dx.doi.org/10.1109/WHC.2019.8816089",
      "doi": ""
    },
    {
      "text": "Y. Yoshikawa, D. Iwai, and K. Sato. 2013. A study of thermal sensation with visuo-thermal projection interfaces. In 2013 IEEE 2nd Global Conference on Consumer Electronics (GCCE). 118--119. DOI: http://dx.doi.org/10.1109/GCCE.2013.6664767",
      "doi": ""
    },
    {
      "text": "Kening Zhu, Simon Perrault, Taizhou Chen, Shaoyu Cai, and Roshan Lalintha Peiris. 2019. A sense of ice and fire: Exploring thermal feedback with multiple thermoelectric-cooling elements on a smart ring. International Journal of Human-Computer Studies 130 (2019), 234--247. DOI: http://dx.doi.org/https://doi.org/10.1016/j.ijhcs.2019.07.003",
      "doi": "10.1016/j.ijhcs.2019.07.003"
    },
    {
      "text": "Mounia Ziat, Carrie Anne Balcer, Andrew Shirtz, and Taylor Rolison. 2016. A Century Later, the Hue-Heat Hypothesis: Does Color Truly Affect Temperature Perception?. In Haptics: Perception, Devices, Control, and Applications, Fernando Bello, Hiroyuki Kajimoto, and Yon Visell (Eds.). Springer International Publishing, Cham, 273--280.",
      "doi": ""
    }
  ]
}