{
  "doi": "10.1145/3313831.3376825",
  "title": "The Next Generation of Human-Drone Partnerships: Co-Designing an Emergency Response System",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The use of semi-autonomous Unmanned Aerial Vehicles (UAV) to support emergency response scenarios, such as fire surveillance and search and rescue, offers the potential for huge societal benefits. However, designing an effective solution in this complex domain represents a \"wicked design\" problem, requiring a careful balance between trade-offs associated with drone autonomy versus human control, mission functionality versus safety, and the diverse needs of different stakeholders. This paper focuses on designing for situational awareness (SA) using a scenario-driven, participatory design process. We developed SA cards describing six common design-problems, known as SA demons, and three new demons of importance to our domain. We then used these SA cards to equip domain experts with SA knowledge so that they could more fully engage in the design process. We designed a potentially reusable solution for achieving SA in multi-stakeholder, multi-UAV, emergency response applications.",
  "tags": [
    "human-CPS interactions",
    "emergency response",
    "situational awareness",
    "unmanned aerial vehicles",
    "participatory design"
  ],
  "authors": [
    {
      "name": "Ankit Agrawal",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433273",
      "orcid": "missing"
    },
    {
      "name": "Sophia J. Abraham",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527918",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Burger",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527775",
      "orcid": "missing"
    },
    {
      "name": "Chichi Christine",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528315",
      "orcid": "missing"
    },
    {
      "name": "Luke Fraser",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527369",
      "orcid": "missing"
    },
    {
      "name": "John M. Hoeksema",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529402",
      "orcid": "missing"
    },
    {
      "name": "Sarah Hwang",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528497",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Travnik",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527907",
      "orcid": "missing"
    },
    {
      "name": "Shreya Kumar",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528006",
      "orcid": "missing"
    },
    {
      "name": "Walter Scheirer",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453640546",
      "orcid": "missing"
    },
    {
      "name": "Jane Cleland-Huang",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100428647",
      "orcid": "missing"
    },
    {
      "name": "Michael Vierhauser",
      "institution": "Johannes Kepler University Linz, Linz, Austria",
      "img": "/do/10.1145/contrib-81470655310/rel-imgonly/primetalsrd-1038x572-1.jpg",
      "acmid": "81470655310",
      "orcid": "missing"
    },
    {
      "name": "Ryan Bauer",
      "institution": "South Bend Fire Department, South Bend, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528851",
      "orcid": "missing"
    },
    {
      "name": "Steve Cox",
      "institution": "South Bend Fire Department, South Bend, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527245",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "P. J. Antsaklis, K. M. Passino, and S. J. Wang. 1991. An introduction to autonomous control systems. IEEE Control Systems Magazine 11, 4 (June 1991), 5--13. DOI: http://dx.doi.org/10.1109/37.88585",
      "doi": ""
    },
    {
      "text": "ArduPilot. 2019. http://ardupilot.org. (2019). [Online; accessed 01-September-2019].",
      "doi": ""
    },
    {
      "text": "R.C. Atkinson and R.M. Shiffrin. 1968. Human Memory: A Proposed System and its Control Processes. Psychology of Learning and Motivation, Vol. 2. Academic Press, 89 -- 195. DOI: http://dx.doi.org/10.1016/S0079--7421(08)60422--3",
      "doi": ""
    },
    {
      "text": "Francesco N Biondi, Monika Lohani, Rachel Hopman, Sydney Mills, Joel M Cooper, and David L Strayer. 2018. 80 MPH and out-of-the-loop: Effects of real-world semi-automated driving on driver workload and arousal. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 62. SAGE Publications, 1878--1882.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory Design That Matters -- Facing the Big Issues. ACM Trans. Comput.-Hum. Interact. 25, 1, Article 4 (2018), 4:1--4:31 pages. DOI: http://dx.doi.org/10.1145/3152421",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Henning Breuer, Frank Heidmann, Mitsuji Matsumoto, Ulrich Raape, and Monika Wnuk. 2009. Interaction Design for Situation Awareness-Eyetracking and Heuristics for Control Centers.",
      "doi": ""
    },
    {
      "text": "Jane Cleland-Huang and Michael Vierhauser. 2018. Discovering, Analyzing, and Managing Safety Stories in Agile Projects. In 26th IEEE International Requirements Engineering Conference. 262--273. DOI: http://dx.doi.org/10.1109/RE.2018.00034",
      "doi": ""
    },
    {
      "text": "Jane Cleland-Huang, Michael Vierhauser, and Sean Bayley. 2018. Dronology: an incubator for cyber-physical systems research. In Proceedings of the 40th International Conference on Software Engineering: New Ideas and Emerging Results. 109--112. DOI: http://dx.doi.org/10.1145/3183399.3183408",
      "doi": "10.1145/3183399.3183408"
    },
    {
      "text": "Alistair Cockburn. 2000. Writing Effective Use Cases (1st ed.). Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA.",
      "doi": ""
    },
    {
      "text": "Nancy J. Cook. 2007. Stories of Modern Technology Failures and Cognitive Engineering Successes. CRC Press, 2007.",
      "doi": ""
    },
    {
      "text": "Richard Coyne. 2005. Wicked problems revisited. Design Studies 26, 1 (2005), 5 -- 17. DOI: http://dx.doi.org/https://doi.org/10.1016/j.destud.2004.06.005",
      "doi": ""
    },
    {
      "text": "Giuseppe D'Aniello, Vincenzo Loia, and Francesco Orciuoli. 2017. Adaptive Goal Selection for improving Situation Awareness: the Fleet Management case study. Procedia Computer Science 109 (2017), 529 -- 536. DOI: http://dx.doi.org/10.1016/j.procs.2017.05.332 8th International Conference on Ambient Systems, Networks and Technologies, ANT-2017 and the 7th International Conference on Sustainable Energy Information Technology.",
      "doi": ""
    },
    {
      "text": "F.E. Emery and E.L. Trist. 1960. Socio-technical systems. In In: Churchman, C.W., Verhulst, M. (Eds.), Management Science Models and Techniques, Vol. 9. Pergamon, 83--97.",
      "doi": ""
    },
    {
      "text": "Mica R. Endsley. 2011. Designing for Situation Awareness: An Approach to User-Centered Design, Second Edition (2nd ed.). CRC Press, Inc., Boca Raton, FL, USA.",
      "doi": ""
    },
    {
      "text": "Mica R Endsley. 2017. Autonomous driving systems: A preliminary naturalistic study of the Tesla Model S. Journal of Cognitive Engineering and Decision Making 11, 3 (2017), 225--238.",
      "doi": ""
    },
    {
      "text": "K. Fellah and M. Guiatni. 2019. Tactile Display Design for Flight Envelope Protection and Situational Awareness. IEEE Transactions on Haptics 12, 1 (Jan 2019), 87--98. DOI: http://dx.doi.org/10.1109/TOH.2018.2865302",
      "doi": ""
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating rigor using thematic analysis: A hybrid approach of inductive and deductive coding and theme development. International journal of qualitative methods 5, 1 (2006), 80--92.",
      "doi": ""
    },
    {
      "text": "Naveen Gautam, Ratna Babu Chinnam, and Nanua Singh. 2007. Design reuse framework: A perspective for lean development. Int. J. Product Development Int. J. Product Development 4 (01 2007), 485--507. DOI: http://dx.doi.org/10.1504/IJPD.2007.013044",
      "doi": ""
    },
    {
      "text": "Matthew C. Gombolay, Anna Bair, Cindy Huang, and Julie A. Shah. 2017. Computational design of mixed-initiative human-robot teaming that considers human factors: situational awareness, workload, and workflow preferences. I. J. Robotics Res. 36, 5--7 (2017), 597--617. DOI: http://dx.doi.org/10.1177/0278364916688255",
      "doi": "10.1177/0278364916688255"
    },
    {
      "text": "Colin M. Gray. 2016. \"It's More of a Mindset Than a Method\": UX Practitioners' Conception of Design Methods. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4044--4055. DOI: http://dx.doi.org/10.1145/2858036.2858410",
      "doi": "10.1145/2858036.2858410"
    },
    {
      "text": "Sofja Hotomski and Martin Glinz. 2018. A Qualitative Study on using GuideGen to Keep Requirements and Acceptance Tests Aligned. In 26th IEEE International Requirements Engineering Conference. 29--39. DOI: http://dx.doi.org/10.1109/RE.2018.00--54",
      "doi": ""
    },
    {
      "text": "Hermann Kaindl. 2000. A design process based on a model combining scenarios with goals and functions. IEEE Trans. Systems, Man, and Cybernetics, Part A 30, 5 (2000), 537--551. DOI: http://dx.doi.org/10.1109/3468.867861",
      "doi": "10.1109/3468.867861"
    },
    {
      "text": "Leah Kaufman and Brad Weed. 1998. Too much of a good thing?: Identifying and resolving bloat in the user interface. In CHI 98 Conference Summary on Human Factors in Computing Systems. 207--208. DOI: http://dx.doi.org/10.1145/286498.286693",
      "doi": "10.1145/286498.286693"
    },
    {
      "text": "Md. Nafz Hasan Khan and Carman Neustaedter. 2019. Exploring Drones to Assist Firefghters During Emergencies. In 1st International Workshop on Human-Drone Interaction. Ecole Nationale de l'Aviation Civile [ENAC], Glasgow, United Kingdom. https://hal.archives-ouvertes.fr/hal-02128386",
      "doi": ""
    },
    {
      "text": "L.T. Kohn, J.M. Corrigan, and M.s. Donaldson. 1999. To err is human, Building a safety health system. Washington, DC: National Academy Press (1999).",
      "doi": ""
    },
    {
      "text": "Clayton Lewis and John Rieman. 2006. Task-centered user interface design: A practical introduction.",
      "doi": ""
    },
    {
      "text": "H. Lukosch, T. van Ruijven, and A. Verbraeck. 2012. The participatory design of a simulation training game. In Proceedings of the 2012 Winter Simulation Conference (WSC). 1--11. DOI: http://dx.doi.org/10.1109/WSC.2012.6465218",
      "doi": ""
    },
    {
      "text": "Owen McAree, Jonathan M. Aitken, and Sandor M. Veres. 2017. Towards artificial situation awareness by autonomous vehicles. IFAC-PapersOnLine 50, 1 (2017), 7038 -- 7043. DOI: http://dx.doi.org/10.1016/j.ifacol.2017.08.1349 20th IFAC World Congress.",
      "doi": ""
    },
    {
      "text": "Jason S. Mccarley and Christopher D. Wickens. Human factors concerns in UAV fight. Technical Report.",
      "doi": ""
    },
    {
      "text": "Joanna McGrenere, Ronald M. Baecker, and Kellogg S. Booth. 2002. An Evaluation of a Multiple Interface Design Solution for Bloated Software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 164--170. DOI: http://dx.doi.org/10.1145/503376.503406",
      "doi": ""
    },
    {
      "text": "Brenna McNally, Mona Leigh Guha, Matthew Louis Mauriello, and Allison Druin. 2016. Children's Perspectives on Ethical Issues Surrounding Their Past Involvement on a Participatory Design Team. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3595--3606.",
      "doi": "10.1145/2858036.2858338"
    },
    {
      "text": "George A. Miller. 1956. Human memory and the storage of information. IRE Trans. Information Theory 2, 3 (1956), 129--137. DOI: http://dx.doi.org/10.1109/TIT.1956.1056815",
      "doi": ""
    },
    {
      "text": "Shane T Mueller and Gary Klein. 2011. Improving users' mental models of intelligent software tools. IEEE Intelligent Systems 26, 2 (2011), 77--83.",
      "doi": "10.1109/MIS.2011.32"
    },
    {
      "text": "D.C. Nagel. 1998. Human error in aviation Operations. Human factors in Aviation, E.L.Weiner and E.C.Nagel (Eds) 19890047069, 34 (1998), 263--303. DOI: http://dx.doi.org/10.1109/2.910904",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic evaluation of user interfaces. In Proceedings of the Conference on Human Factors in Computing Systems, CHI 1990. 249--256. DOI: http://dx.doi.org/10.1145/97243.97281",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books, Inc., New York, NY, USA.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Natália Oliveira, Fabio Jorge, Jessica De Souza, Valdir Junior, and Leonardo Botega. 2016. Development of a User Interface for the Enrichment of Situational Awareness in Emergency Management Systems. Vol. 491. 173--184. DOI: http://dx.doi.org/10.1007/978--3--319--41929--9_17",
      "doi": ""
    },
    {
      "text": "E Onal, C Craddock, and Mica Endsley. 2013. From Theory to Practice: How Designing for Situation Awareness Can Transform Confusing, Overloaded Shovel Operator Interfaces, Reduce Costs, and Increase Safety. DOI: http://dx.doi.org/10.22260/ISARC2013/0171",
      "doi": ""
    },
    {
      "text": "A. Parush, G. Mastoras, A. Bhandari, K. Momtahan, K. Day, B. Weitzman, B. Sohmer, A. Cwinn, S.J. Hamstra, and L. Calder\". 2017. Can teamwork and situational awareness (SA) in ED resuscitations be improved with a technological cognitive aid? Design and a pilot study of a team situation display. Journal of Biomedical Informatics 76 (2017), 154 -- 161. DOI: http://dx.doi.org/10.1016/j.jbi.2017.10.009",
      "doi": "10.1016/j.jbi.2017.10.009"
    },
    {
      "text": "Colin Potts. 1995. Using Schematic Scenarios to Understand User Needs. In Proceedings of the 1st Conference on Designing Interactive Systems: Processes, Practices, Methods and Techniques, DIS '95. 247--256. DOI: http://dx.doi.org/10.1145/225434.225462",
      "doi": "10.1145/225434.225462"
    },
    {
      "text": "Raj Prasanna, Lili Yang, and Mlcolm King. 2009. Situation awareness oriented user interface design for fre emergency response. Journal of Emergency Management 7 (03 2009), 65--74.",
      "doi": ""
    },
    {
      "text": "Joseph Redmon and Ali Farhadi. 2018. YOLOv3: An Incremental Improvement. CoRR abs/1804.02767 (2018). http://arxiv.org/abs/1804.02767",
      "doi": ""
    },
    {
      "text": "Nicolas Regis, Frédéric Dehais, Emmanuel Rachelson, Charles Thooris, Sergio Pizziol, Mickaël Causse, and Catherine Tessier. 2014. Formal Detection of Attentional Tunneling in Human Operator-Automation Interactions. IEEE Trans. Human-Machine Systems 44, 3 (2014), 326--336. DOI: http://dx.doi.org/10.1109/THMS.2014.2307258",
      "doi": ""
    },
    {
      "text": "Debbie Richards. 2000. The reuse of knowledge: a user-centred approach. Int. J. Hum.-Comput. Stud. 52, 3 (2000), 553--579. DOI: http://dx.doi.org/10.1006/ijhc.1999.0342",
      "doi": "10.1006/ijhc.1999.0342"
    },
    {
      "text": "Horst W. J. Rittel and Melvin M. Webber. 1973. Dilemmas in a general theory of planning. In Policy Sciences, Vol. 4. 155--169.",
      "doi": ""
    },
    {
      "text": "John Rushby. 2001. Modeling the human in human factors. In International Conference on Computer Safety, Reliability, and Security. Springer, 86--91.",
      "doi": ""
    },
    {
      "text": "Filippo Santoni de Sio and Jeroen van den Hoven. 2018. Meaningful Human Control over Autonomous Systems: A Philosophical Account. Frontiers in Robotics and AI 5 (2018), 15. DOI: http://dx.doi.org/10.3389/frobt.2018.00015",
      "doi": ""
    },
    {
      "text": "Douglas Schuler and Aki Namioka (Eds.). 1993. Participatory Design: Principles and Practices. L. Erlbaum Associates Inc., Hillsdale, NJ, USA.",
      "doi": "10.5555/563076"
    },
    {
      "text": "J. Shi, J. Wan, H. Yan, and H. Suo. 2011. A survey of Cyber-Physical Systems. In 2011 International Conference on Wireless Communications and Signal Processing (WCSP). 1--6. DOI: http://dx.doi.org/10.1109/WCSP.2011.6096958",
      "doi": ""
    },
    {
      "text": "Tim Claudius Stratmann and Susanne Boll. 2016. Demon Hunt - The Role of Endsley's Demons of Situation Awareness in Maritime Accidents. In Human-Centered and Error-Resilient Systems Development, Cristian Bogdan, Jan Gulliksen, Stefan Sauer, Peter Forbrig, Marco Winckler, Chris Johnson, Philippe Palanque, Regina Bernhaupt, and Filip Kis (Eds.). Springer International Publishing, Cham, 203--212.",
      "doi": ""
    },
    {
      "text": "Deborah Tatar. 2007. The Design Tensions Framework. Hum.-Comput. Interact. 22, 4 (Nov. 2007), 413--451. http://dl.acm.org/citation.cfm?id=1466607.1466609",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Saurabh Tiwari and Atul Gupta. 2015. A Systematic Literature Review of Use Case Specifications Research. Inf. Softw. Technol. 67, C (Nov. 2015), 128--158. DOI: http://dx.doi.org/10.1016/j.infsof.2015.06.004",
      "doi": ""
    },
    {
      "text": "Axel van Lamsweerde, Robert Darimont, and Emmanuel Letier. 1998. Managing Conflicts in Goal-Driven Requirements Engineering. IEEE Trans. Software Eng. 24, 11 (1998), 908--926. DOI: http://dx.doi.org/10.1109/32.730542",
      "doi": "10.1109/32.730542"
    },
    {
      "text": "Guy H. Walker, Neville A. Stanton, Paul M. Salmon, and Daniel P. Jenkins. 2008. A review of sociotechnical systems theory: a classic concept for new command and control paradigms. Theoretical Issues in Ergonomics Science 9, 6 (2008), 479--499. DOI: http://dx.doi.org/10.1080/14639220701635470",
      "doi": ""
    },
    {
      "text": "Christopher D Wickens and Amy L Alexander. 2009. Attentional tunneling and task management in synthetic vision displays. The International Journal of Aviation Psychology 19, 2 (2009), 182--199.",
      "doi": ""
    }
  ]
}