{
  "doi": "10.1145/3313831.3376385",
  "title": "Evaluating the Information Security Awareness of Smartphone Users",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Information security awareness (ISA) is a practice focused on the set of skills which help a user successfully mitigate social engineering (SE) attacks. Evaluating the ISA of users is crucial, since early identification of users who are more vulnerable to SE attacks improves system security. Previous studies for evaluating the ISA of smartphone users rely on subjective data sources (questionnaires) and do not address the differences between classes of SE attacks. This paper presents a framework for evaluating the ISA of smartphone users for specific attack classes. In addition to questionnaires, we utilize objective data sources: a mobile agent, a network traffic monitor, and cybersecurity challenges. We evaluated the framework by conducting a long-term user study involving 162 users. The results show that: the self-reported behavior of users differs significantly from their actual behavior and the ISA level derived from the actual behavior of users is highly correlated with their ability to mitigate SE attacks.",
  "tags": [
    "human factors",
    "social engineering",
    "mobile devices",
    "information security awareness"
  ],
  "authors": [
    {
      "name": "Ron Bitton",
      "institution": "Ben-Gurion University of the Negev, Be'er Sheba, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659445367",
      "orcid": "missing"
    },
    {
      "name": "Kobi Boymgold",
      "institution": "Ben-Gurion University of the Negev, Be'er Sheba, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526456",
      "orcid": "missing"
    },
    {
      "name": "Rami Puzis",
      "institution": "Ben-Gurion University of the Negev, Be'er Sheba, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367593096",
      "orcid": "missing"
    },
    {
      "name": "Asaf Shabtai",
      "institution": "Ben-Gurion University of the Negev, Be'er Sheba, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501489",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Social Engineering Toolkit. https://www.trustedsec.com/social-engineer-toolkit-set/.",
      "doi": ""
    },
    {
      "text": "VirusTotal. https://www.virustotal.com.",
      "doi": ""
    },
    {
      "text": "Web Of Trust. https://www.mywot.com.",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 1991. The theory of planned behavior. Organizational behavior and human decision processes 50, 2 (1991), 179--211.",
      "doi": ""
    },
    {
      "text": "Eirik Albrechtsen and Jan Hovden. 2010. Improving information security awareness and behaviour through dialogue, participation and collective reflection. An intervention study. Computers & Security 29, 4 (2010), 432--445.",
      "doi": "10.1016/j.cose.2009.12.005"
    },
    {
      "text": "Iosif Androulidakis and Gorazd Kandus. 2011a. Bluetooth® usage among students as an indicator of security awareness and feeling. In ELMAR, 2011 Proceedings. IEEE, 157--160.",
      "doi": ""
    },
    {
      "text": "Iosif Androulidakis and Gorazd Kandus. 2011b. Mobile phone security awareness and practices of students in budapest. In Proceedings of the 6th International Conference on Digital Telecommunications. 17--22.",
      "doi": ""
    },
    {
      "text": "Iosif Androulidakis and Gorazd Kandus. 2011c. A survey on saving personal data in the mobile phone. In Availability, Reliability and Security (ARES), 2011 Sixth International Conference on. IEEE, 633--638.",
      "doi": "10.1109/ARES.2011.98"
    },
    {
      "text": "Kregg Aytes and Terry Conolly. 2003. A research model for investigating human behavior related to computer security. AMCIS 2003 Proceedings (2003), 260.",
      "doi": ""
    },
    {
      "text": "Ron Bitton, Andrey Finkelshtein, Lior Sidi, Rami Puzis, Lior Rokach, and Asaf Shabtai. 2018. Taxonomy of mobile users' security awareness. Computers & Security 73 (2018), 266--293.",
      "doi": ""
    },
    {
      "text": "Dan Conway, Ronnie Taib, Mitch Harris, Kun Yu, Shlomo Berkovsky, and Fang Chen. 2017. A qualitative investigation of bank employee experiences of information security and phishing. In Thirteenth Symposium on Usable Privacy and Security (SOUPS 2017), USENIX Association. 115--129.",
      "doi": ""
    },
    {
      "text": "Dimitrios Damopoulos, Georgios Kambourakis, and Stefanos Gritzalis. 2011. iSAM: an iPhone stealth airborne malware. In IFIP International Information Security Conference. Springer, 17--28.",
      "doi": ""
    },
    {
      "text": "Ronald C Dodge Jr, Curtis Carver, and Aaron J Ferguson. 2007. Phishing for user security awareness. computers & security 26, 1 (2007), 73--80.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Marian Harbach, and Eyal Peer. 2016. Behavior ever follows intention?: A validation of the security behavior intentions scale (SeBIS). In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 5257--5261.",
      "doi": "10.1145/2858036.2858265"
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. Scaling the security wall: Developing a security behavior intentions scale (sebis). In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2873--2882.",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Mohammadjafar Esmaeili. 2014. Assessment of users' information security behavior in smartphone networks. Eastern Michigan University.",
      "doi": ""
    },
    {
      "text": "Adrienne Porter Felt, Matthew Finifter, Erika Chin, Steve Hanna, and David Wagner. 2011. A survey of mobile malware in the wild. In Proceedings of the 1st ACM workshop on Security and privacy in smartphones and mobile devices. ACM, 3--14.",
      "doi": "10.1145/2046614.2046618"
    },
    {
      "text": "Waldo Rocha Flores, Hannes Holm, Gustav Svensson, and Guran Ericsson. 2014. Using phishing experiments and scenario-based surveys to understand security behaviours in practice. Information Management & Computer Security 22, 4 (2014), 393--406. DOI: http://dx.doi.org/10.1108/IMCS-11--2013-0083",
      "doi": ""
    },
    {
      "text": "Alain Forget, Saranga Komanduri, Alessandro Acquisti, Nicolas Christin, Lorrie F Cranor, and Rahul Telang. 2014. Security behavior observatory: Infrastructure for long-term monitoring of client machines. Technical Report. CARNEGIE-MELLON UNIV PITTSBURGH PA PITTSBURGH United States.",
      "doi": ""
    },
    {
      "text": "Alain Forget, Sarah Pearman, Jeremy Thomas, Alessandro Acquisti, Nicolas Christin, Lorrie Faith Cranor, Serge Egelman, and Marian Harbach. 2016. Do or do not, there is no try: user engagement may not improve security outcomes. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). 97--111.",
      "doi": ""
    },
    {
      "text": "Vasileios Gkioulos, Gaute Wangen, and Sokratis K Katsikas. 2017a. User Modelling Validation over the Security Awareness of Digital Natives. Future Internet 9, 3 (2017), 32.",
      "doi": ""
    },
    {
      "text": "Vasileios Gkioulos, Gaute Wangen, Sokratis K Katsikas, George Kavallieratos, and Panayiotis Kotzanikolaou. 2017b. Security awareness of the digital natives. Information 8, 2 (2017), 42.",
      "doi": ""
    },
    {
      "text": "Muhammad Haris, Hamed Haddadi, and Pan Hui. 2014. Privacy leakage in mobile computing: Tools, methods, and characteristics. arXiv preprint arXiv:1410.4978 (2014).",
      "doi": ""
    },
    {
      "text": "Mikko Hypponen. 2006. Malware goes mobile. Scientific American 295, 5 (2006), 70--77.",
      "doi": ""
    },
    {
      "text": "Tom N Jagatic, Nathaniel A Johnson, Markus Jakobsson, and Filippo Menczer. 2007. Social phishing. Commun. ACM 50, 10 (2007), 94--100.",
      "doi": "10.1145/1290958.1290968"
    },
    {
      "text": "K Jansson and Rossouw von Solms. 2013. Phishing for phishing awareness. Behaviour & information technology 32, 6 (2013), 584--593.",
      "doi": ""
    },
    {
      "text": "Xuxian Jiang and Yajin Zhou. 2012. Dissecting android malware: Characterization and evolution. In 2012 IEEE Symposium on Security and Privacy. IEEE, 95--109.",
      "doi": ""
    },
    {
      "text": "ME Kabay, Bridgitt Robertson, Mani Akella, and DT Lang. 2002. Using social psychology to implement security policies. Computer Security Handbook, Sixth Edition (2002), 50--1.",
      "doi": ""
    },
    {
      "text": "Maurits Kaptein and Judy Robertson. 2012. Rethinking statistical analysis methods for CHI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1105--1114.",
      "doi": "10.1145/2207676.2208557"
    },
    {
      "text": "Juuso Karikoski and Tapio Soikkeli. 2013. Contextual usage patterns in smartphone communication services. Personal and ubiquitous computing 17, 3 (2013), 491--502.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Sunny Consolvo, Lorrie Faith Cranor, Jaeyeon Jung, Norman Sadeh, and David Wetherall. 2012. A conundrum of permissions: installing applications on an android smartphone. In International Conference on Financial Cryptography and Data Security. Springer, 68--79.",
      "doi": "10.1007/978-3-642-34638-5_6"
    },
    {
      "text": "Hennie A Kruger, Lynette Drevin, and Tjaart Steyn. 2006. A Framework for Evaluating ICT Security Awareness.. In ISSA. 1--11.",
      "doi": ""
    },
    {
      "text": "Hennie A Kruger and Wayne D Kearney. 2006. A prototype for assessing information security awareness. computers & security 25, 4 (2006), 289--296.",
      "doi": ""
    },
    {
      "text": "Ivar Krumpal. 2013. Determinants of social desirability bias in sensitive surveys: a literature review. Quality & Quantity 47, 4 (2013), 2025--2047.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Justin Cranshaw, Alessandro Acquisti, Lorrie Cranor, Jason Hong, Mary Ann Blair, and Theodore Pham. 2009. School of phish: a real-world evaluation of anti-phishing training. In Proceedings of the 5th Symposium on Usable Privacy and Security. ACM, 3.",
      "doi": "10.1145/1572532.1572536"
    },
    {
      "text": "Ponnurangam Kumaraguru, Yong Rhee, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Protecting people from phishing: the design and evaluation of an embedded training email system. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 905--914.",
      "doi": "10.1145/1240624.1240760"
    },
    {
      "text": "Mariantonietta La Polla, Fabio Martinelli, and Daniele Sgandurra. 2013. A survey on security for mobile devices. IEEE communications surveys & tutorials 15, 1 (2013), 446--471.",
      "doi": ""
    },
    {
      "text": "Agata McCormac, Dragana Calic, Kathryn Parsons, Tara Zwaans, Marcus Butavicius, and Malcolm Pattison. 2016. Test-retest reliability and internal consistency of the Human Aspects of Information Security Questionnaire (HAIS-Q). (2016).",
      "doi": ""
    },
    {
      "text": "Alexios Mylonas, Anastasia Kastania, and Dimitris Gritzalis. 2013. Delegate the smartphone user? Security awareness in smartphone platforms. Computers & Security 34 (2013), 47--66.",
      "doi": "10.1016/j.cose.2012.11.004"
    },
    {
      "text": "Alexios Mylonas, Marianthi Theoharidou, and Dimitris Gritzalis. 2014. Assessing Privacy Risks in Android: A User-Centric Approach. In Risk Assessment and Risk-Driven Testing, Thomas Bauer, Jürgen Großmann, Fredrik Seehusen, Ketil Stølen, and Marc-Florian Wendland (Eds.). Springer International Publishing, Cham, 21--37.",
      "doi": ""
    },
    {
      "text": "Kaan Onarlioglu, Utku Ozan Yilmaz, Engin Kirda, and Davide Balzarotti. 2012. Insights into User Behavior in Dealing with Internet Attacks.. In NDSS.",
      "doi": ""
    },
    {
      "text": "Kathryn Parsons, Dragana Calic, Malcolm Pattinson, Marcus Butavicius, Agata McCormac, and Tara Zwaans. 2017. The human aspects of information security questionnaire (HAIS-Q): two further validation studies. Computers & Security 66 (2017), 40--51.",
      "doi": "10.1016/j.cose.2017.01.004"
    },
    {
      "text": "Kathryn Parsons, Agata McCormac, Marcus Butavicius, Malcolm Pattinson, and Cate Jerram. 2014. Determining employee awareness using the human aspects of information security questionnaire (HAIS-Q). Computers & Security 42 (2014), 165--176.",
      "doi": ""
    },
    {
      "text": "Sancheng Peng, Shui Yu, and Aimin Yang. 2014. Smartphone malware and its propagation modeling: A survey. IEEE Communications Surveys & Tutorials 16, 2 (2014), 925--941.",
      "doi": ""
    },
    {
      "text": "James Reason. 2016. Managing the risks of organizational accidents. Routledge.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Ziyun Zhu, Sean Kross, Dhruv Kuchhal, Tudor Dumitras, and Michelle L Mazurek. 2018. Asking for a Friend: Evaluating Response Biases in Security User Studies. In Proceedings of the 2018 ACM SIGSAC Conference on Computer and Communications Security. ACM, 1238--1255.",
      "doi": "10.1145/3243734.3243740"
    },
    {
      "text": "Symantec. 2018. Internet Security Threat Report 2018. URL https://www.symantec.com/content/dam/symantec/docs/reports/istr23--2018-en.pdf (2018).",
      "doi": ""
    },
    {
      "text": "Mark E Thomson and Rossouw von Solms. 1998. Information security awareness: educating your users effectively. Information management & computer security 6, 4 (1998), 167--173.",
      "doi": ""
    },
    {
      "text": "Dirk Van Bruggen, Shu Liu, Mitch Kajzer, Aaron Striegel, Charles R Crowell, and John D'Arcy. 2013. Modifying smartphone user locking behavior. In Proceedings of the Ninth Symposium on Usable Privacy and Security. ACM, 10.",
      "doi": "10.1145/2501604.2501614"
    },
    {
      "text": "Timothy Vidas, Daniel Votipka, and Nicolas Christin. 2011. All Your Droid Are Belong to Us: A Survey of Current Android Attacks.. In Woot. 81--90.",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, and Chris Fennell. 2017. Can People Self-Report Security Accurately?: Agreement Between Self-Report and Behavioral Measures. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2228--2232.",
      "doi": "10.1145/3025453.3025911"
    },
    {
      "text": "Primal Wijesekera, Arjun Baokar, Ashkan Hosseini, Serge Egelman, David Wagner, and Konstantin Beznosov. 2015. Android Permissions Remystified: A Field Study on Contextual Integrity. In Proceedings of the 24th USENIX Conference on Security Symposium. USENIX Association, Berkeley, CA, USA, 499--514.",
      "doi": ""
    },
    {
      "text": "F Yates. 1940. Lattice squares. The Journal of Agricultural Science 30, 4 (1940), 672--687.",
      "doi": ""
    }
  ]
}