{
  "doi": "10.1145/3313831.3376279",
  "title": "Beyond Team Makeup: Diversity in Teams Predicts Valued Outcomes in Computer-Mediated Collaborations",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "In an increasingly globalized and service-oriented economy, people need to engage in computer-mediated collaborative problem solving (CPS) with diverse teams. However, teams routinely fail to live up to expectations, showcasing the need for technologies that help develop effective collaboration skills. We take a step in this direction by investigating how different dimensions of team diversity (demographic, personality, attitudes towards teamwork, prior domain experience) predict objective (e.g. effective solutions) and subjective (e.g. positive perceptions) collaborative outcomes. We collected data from 96 triads who engaged in a 30-minute CPS task via videoconferencing. We found that demographic diversity and differing attitudes towards teamwork predicted impressions of positive engagement, while personality diversity predicted learning outcomes. Importantly, these relationships were maintained after accounting for team makeup. None of the diversity measures predicted task performance. We discuss how our findings can be incorporated into technologies that aim to help diverse teams develop CPS skills.",
  "tags": [
    "team makeup",
    "learning technologies",
    "diversity",
    "collaborative problem solving"
  ],
  "authors": [
    {
      "name": "Angela E.B. Stewart",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-99659310904/rel-imgonly/99659310904.jpg",
      "acmid": "99659310904",
      "orcid": "0000-0002-6004-9266"
    },
    {
      "name": "Mary Jean Amon",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365778",
      "orcid": "0000-0003-0026-7568"
    },
    {
      "name": "Nicholas D. Duran",
      "institution": "Arizona State University, Glendale, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474700",
      "orcid": "missing"
    },
    {
      "name": "Sidney K. D'Mello",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567903",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kacey Beddoes and Grace Panther. 2018. Gender and teamwork: an analysis of professors' perspectives and practices. Eur. J. Eng. Educ. 43, 3 (2018), 330--343. DOI: https://doi.org/10.1080/03043797.2017.13677",
      "doi": ""
    },
    {
      "text": "Cigdem Beyan, Francesca Capozzi, Cristina Becchio, and Vittorio Murino. 2016. Identification of emergent leaders in a meeting scenario using multiple kernel learning. In Proceedings of the 2nd Workshop on Advancements in Social Signal Processing for Multimodal Interaction, 3--10.",
      "doi": "10.1145/3005467.3005469"
    },
    {
      "text": "Jack Block. 1995. A contrarian view of the fivefactor approach to personality description. Psychological Bulletin 117, 187--215. DOI: https://doi.org/10.1037/0033--2909.117.2.187",
      "doi": ""
    },
    {
      "text": "Nigel Bosch, Sidney D'Mello, Ryan Baker, Jaclyn Ocumpaugh, Valerie Shute, Matthew Ventura, Lubin Wang, and Weinan Zhao. 2015. Automatic detection of learning-centered affective states in the wild. In Proceedings of the 20th international conference on intelligent user interfaces, 379--388.",
      "doi": "10.1145/2678025.2701397"
    },
    {
      "text": "Jennifer A Chatman and Francis J Flynn. 2001. The influence of demographic heterogeneity on the emergence and consequences of cooperative norms in work teams. Acad. Manag. J. 44, 5 (2001), 956-- 974. DOI: https://doi.org/10.2307/3069440",
      "doi": ""
    },
    {
      "text": "Pravin Chopade, Kristin Stoeffler, Saad M Khan, Yigal Rosen, Spencer Swartz, and Alina von Davier. 2018. Human-Agent Assessment: Interaction and Sub-skills Scoring for Collaborative Problem Solving. In Artificial Intelligence in Education, 52-- 57.",
      "doi": ""
    },
    {
      "text": "Taylor H Cox and Stacy Blake. 1991. Managing Cultural Diversity: Implications for Organizational Competitiveness. Exec. 5, 3 (1991), 45--56. Retrieved from http://www.jstor.org/stable/4165021",
      "doi": ""
    },
    {
      "text": "Petru L. Curşeu and Helen Pluut. 2013. Student groups as learning entities: The effect of group diversity and teamwork quality on groups' cognitive complexity. Stud. High. Educ. 38, 1 (2013), 87--103. DOI: https://doi.org/10.1080/03075079.2011.56512",
      "doi": ""
    },
    {
      "text": "Petru Lucian Curşeu, Remus Ilies, Delia Vîrgǎ, Laurenţiu Maricuţoiu, and Florin A Sava. 2019. Personality characteristics that are valued in teams: Not always \"more is better\"? Int. J. Psychol. 54, 5 (2019), 638--649. DOI: https://doi.org/10.1002/ijop.12511",
      "doi": ""
    },
    {
      "text": "Alberto Esquinca and Lidia Herrera-Rocha. 2019. Board 90: Latinx Persistence In and Beyond the Degree: Intersections of Gender and Ethnicity (Research). In 2019 ASEE Annual Conference & Exposition.",
      "doi": ""
    },
    {
      "text": "Graham D. Fenwick and Derrick J. Neal. 2001. Effect of gender composition on group performance. Gender, Work Organ. 8, 2 (2001), 205--225. DOI: https://doi.org/10.1111/1468-0432.00129",
      "doi": ""
    },
    {
      "text": "Donald G. Gardner and Jon L. Pierce. 2016. Organization-based self-esteem in work teams. Gr. Process. Intergr. Relations 19, 3 (May 2016), 394-- 408. DOI: https://doi.org/10.1177/1368430215590491",
      "doi": ""
    },
    {
      "text": "Samuel D. Gosling, Peter J. Rentfrow, and William B. Swann. 2003. A very brief measure of the BigFive personality domains. J. Res. Pers. 37, 6 (2003), 504--528. DOI: https://doi.org/10.1016/S00926566(03)00046--1",
      "doi": ""
    },
    {
      "text": "Deborah H. Gruenfeld, Elizabeth A. Mannix, Katherine Y. Williams, and Margaret A. Neale. 1996. Group composition and decision making: How member familiarity and information distribution affect process and performance. Organ. Behav. Hum. Decis. Process. 67, 1 (1996), 1--15. DOI: https://doi.org/10.1006/obhd.1996.0061",
      "doi": ""
    },
    {
      "text": "David A Harrison, Kenneth H Price, Joanne H Gavin, and Anna T Florey. 2002. Time, teams, and task performance: Changing effects of surface- and deep-level diversity on group functioning. Acad. Manag. J. 45, 5 (2002), 1029--1045.",
      "doi": ""
    },
    {
      "text": "Cedric Herring. 2009. Does Diversity Pay?: Race, Gender, and the Business Case for Diversity. Am. Sociol. Rev. 74, 2 (2009), 208--224. DOI: https://doi.org/10.1177/000312240907400203",
      "doi": ""
    },
    {
      "text": "Crystal L Hoyt and Jim Blascovich. 2010. The role of leadership self-efficacy and stereotype activation on cardiovascular, behavioral and self-report responses in the leadership domain. Leadersh. Q. 21, 1 (2010), 89--103. DOI: https://doi.org/https://doi.org/10.1016/j.leaqua. 2009.10.007",
      "doi": ""
    },
    {
      "text": "Otto Kässi and Vili Lehdonvirta. 2018. Online labour index: Measuring the online gig economy for policy and research. Technol. Forecast. Soc. Change 137, (2018), 241--248. DOI: https://doi.org/https://doi.org/10.1016/j.techfor e.2018.07.056",
      "doi": ""
    },
    {
      "text": "Norbert L. Kerr and R. Scott Tindale. 2004. Group performance and decision making. Annu. Rev. Psychol. 55, 1 (February 2004), 623--655. DOI: https://doi.org/10.1146/annurev.psych.55.0909 02.142009",
      "doi": ""
    },
    {
      "text": "José M de la Torre-Ruiz, Vera Ferrón-Vílchez, and Natalia Ortiz-de-Mandojana. 2014. Team Decision Making and Individual Satisfaction With the Team. Small Gr. Res. 45, 2 (2014), 198--216. DOI: https://doi.org/10.1177/1046496414525478",
      "doi": ""
    },
    {
      "text": "Claus W. Langfred. 1998. Is group cohesiveness a double-edged sword? Small Gr. Res. 29, 1 (February 1998), 124--143. DOI: https://doi.org/10.1177/1046496498291005",
      "doi": ""
    },
    {
      "text": "Christine Lindstrøm and Manjula D Sharma. 2011. Self-efficacy of first year university physics students: Do gender and prior formal instruction in physics matter? Int. J. Innov. Sci. Math. Educ. (formerly CAL-laborate Int. 19, 2 (2011), 1--19.",
      "doi": ""
    },
    {
      "text": "James Manyika, Susan Lund, Jacques Bughin, Kelsey Robinson, Jane Mischke, and Deepa Mahajan. 2016. Independent work: Choice, necessity, and the gig economy (McKinsey global institute report).",
      "doi": ""
    },
    {
      "text": "Margaret M. McManus and Robert M. Aiken. 2016. Supporting Effective Collaboration: Using a Rearview Mirror to Look Forward. Int. J. Artif. Intell. Educ. 26, 1 (2016), 365--377. DOI: https://doi.org/10.1007/s40593-015-0068--6",
      "doi": ""
    },
    {
      "text": "Philip Meissner, Malte Schubert, and Torsten Wulf. 2018. Determinants of group-level overconfidence in teams: A quasi-experimental investigation of diversity and tenure. Long Range Plann. 51, 6 (2018), 927--936. DOI: https://doi.org/https://doi.org/10.1016/j.lrp.201 7.11.002",
      "doi": ""
    },
    {
      "text": "Jessica Menold and Kathryn Jablokow. 2019. Exploring the effects of cognitive style diversity and self-efficacy beliefs on final design attributes in student design teams. Des. Stud. 60, (2019), 71--102. DOI: https://doi.org/https://doi.org/10.1016/j.destud. 2018.08.001",
      "doi": ""
    },
    {
      "text": "Juan Miguel, L Andres, Ma Mercedes, T Rodrigo, and Jessica O Sugay. 2014. An exploratory analysis of confusion among students using Newton's Playground. Proc. 22nd Int. Conf. Comput. Educ. (2014).",
      "doi": ""
    },
    {
      "text": "Frances J Milliken and Luis L Martins. 1996. Searching for common threads: Understanding the multiple effects of diversity in organizational groups. Acad. Manag. Rev. 21, 2 (1996), 402--433.",
      "doi": ""
    },
    {
      "text": "Bo Bernhard Nielsen and Sabina Nielsen. 2013. Top management team nationality diversity and firm performance: A multilevel study. Strateg. Manag. J. 34, 3 (2013), 373--382. DOI: https://doi.org/10.1002/smj.2021",
      "doi": ""
    },
    {
      "text": "Timothy J Nokes-Malach, Michelle L Meade, and Daniel G Morrow. 2012. The effect of expertise on collaborative problem solving. Think. Reason. 18, 1 (2012), 32--58. DOI: https://doi.org/10.1080/13546783.2011.64220",
      "doi": ""
    },
    {
      "text": "Won-Woo Park, Joon Yeol Lew, and Eun Kyung Lee. 2018. Team knowledge diversity and team creativity: The moderating role of status inequality. Soc. Behav. Personal. an Int. J. 46, 10 (2018), 1611-- 1622.",
      "doi": ""
    },
    {
      "text": "S Paul and S Ray. 2013. Cultural Diversity, Group Interaction, Communication Convergence, and Intra-group Conflict in Global Virtual Teams: Findings from a Laboratory Experiment. In 2013 46th Hawaii International Conference on System Sciences, 344--352. DOI: https://doi.org/10.1109/HICSS.2013.156",
      "doi": "10.1109/HICSS.2013.156"
    },
    {
      "text": "V Pieterse, M Leeu, and M van Eekelen. 2018. How personality diversity influences team performance in student software engineering teams. In 2018 Conference on Information Communications Technology and Society (ICTAS), 1--6. DOI: https://doi.org/10.1109/ICTAS.2018.8368749",
      "doi": ""
    },
    {
      "text": "Jeremy Roschelle and Stephanie D Teasley. 1995. The Construction of Shared Knowledge in Collaborative Problem Solving. In Computer Supported Collaborative Learning, 69--97.",
      "doi": ""
    },
    {
      "text": "Carolyn Rosé, Yi-Chia Wang, Yue Cui, Jaime Arguello, Karsten Stegmann, Armin Weinberger, and Frank Fischer. 2008. Analyzing collaborative learning processes automatically: Exploiting the advances of computational linguistics in computersupported collaborative learning. Int. J. Comput. Collab. Learn. 3, 3 (September 2008), 237--271. DOI: https://doi.org/10.1007/s11412-007--9034-0",
      "doi": ""
    },
    {
      "text": "Yigal Rosen. 2015. Computer-based assessment of collaborative problem solving: Exploring the feasibility of human-to-agent approach. Int. J. Artif. Intell. Educ. 25, 3 (2015), 380--406. DOI: https://doi.org/10.1007/s40593-015-0042--3",
      "doi": ""
    },
    {
      "text": "Eduardo Salas, Nancy J Cooke, and Michael A Rosen. 2008. On Teams, Teamwork, and Team Performance: Discoveries and Developments. Hum. Factors 50, 3 (2008), 540--547. DOI: https://doi.org/10.1518/001872008X288457",
      "doi": ""
    },
    {
      "text": "Jürgen Sauer, Tobias Felsing, Holger Franke, and Bruno Rüttinger. 2006. Cognitive diversity and team performance in a complex multiple task environment. Ergonomics 49, 10 (2006), 934--954. DOI: https://doi.org/10.1080/00140130600577502",
      "doi": ""
    },
    {
      "text": "Victor Savicki, Merle Kelley, and Dawn Lingenfelter. 1996. Gender and group composition in small task groups using computer-mediated communication. Comput. Human Behav. 12, 2 (1996), 209--224. DOI: https://doi.org/10.1016/S0747--5632(96)00024-",
      "doi": ""
    },
    {
      "text": "Julian Schulze and Stefan Krumm. 2017. The \"virtual team player\": A review and initial model of knowledge, skills, abilities, and other characteristics for virtual collaboration. Organ. Psychol. Rev. 7, 1 (February 2017), 66--95. DOI: https://doi.org/10.1177/2041386616675522",
      "doi": ""
    },
    {
      "text": "Shung J. Shin, Tae-Yeol Kim, Jeong-Yeon Lee, and Lin Bian. 2012. Cognitive team diversity and individual team member creativity: A cross-level interaction. Acad. Manag. J. 55, 1 (2012), 197--212.",
      "doi": ""
    },
    {
      "text": "Gale M. Sinatra, Benjamin C. Heddy, and Doug Lombardi. 2015. The Challenges of Defining and Measuring Student Engagement in Science. Educ. Psychol. 50, 1 (2015), 1--13. DOI: https://doi.org/10.1080/00461520.2014.10029",
      "doi": ""
    },
    {
      "text": "Arjumand Bano Soomro, Norsaremah Salleh, and Azlin Nordin. 2015. How personality traits are interrelated with team climate and team performance in software engineering? A preliminary study. In 2015 9th Malaysian Software Engineering Conference (MySEC), 259--265.",
      "doi": ""
    },
    {
      "text": "Angela E. B. Stewart and Sidney K D'Mello. 2018. Connecting the Dots Towards Collaborative AIED: Linking Group Makeup to Process to Learning. In International Conference on Artificial Intelligence in Education, 545--556.",
      "doi": ""
    },
    {
      "text": "Jeanine S. Stewart, Elizabeth Goad Oliver, Karen S. Cravens, and Shigehiro Oishi. 2017. Managing millennials: Embracing generational differences. Bus. Horiz. 60, 1 (2017), 45--54. DOI: https://doi.org/https://doi.org/10.1016/j.bushor. 2016.08.011",
      "doi": ""
    },
    {
      "text": "Kristin Stoeffler, Yigal Rosen, Maria Bolsinova, and Alina von Davier. 2018. Gamified Assessment of Collaborative Skills with Chatbots. 343--347. DOI: https://doi.org/10.1007/978--3--319--93846--2_64",
      "doi": ""
    },
    {
      "text": "Chen Sun, Valerie J Shute, Angela E.B. Stewart, Jade Yonehiro, Nicholas Duran, Sidney K. D'Mello, Sidney D'Mello, and Sidney K. D'Mello. 2020. Towards a generalized competency model of collaborative problem solving. Comput. Educ. 143, (2020), 103672. DOI: https://doi.org/https://doi.org/10.1016/j.compe du.2019.103672",
      "doi": ""
    },
    {
      "text": "T Walle and J E Hannay. 2009. Personality and the nature of collaboration in pair programming. In 2009 3rd International Symposium on Empirical Software Engineering and Measurement, 203--213. DOI: https://doi.org/10.1109/ESEM.2009.5315996",
      "doi": "10.1109/ESEM.2009.5315996"
    },
    {
      "text": "Yuko Watanabe and Merrill Swain. 2007. Effects of proficiency differences and patterns of pair interaction on second language learning: collaborative dialogue between adult ESL learners. Lang. Teach. Res. 11, 2 (2007), 121--142. DOI: https://doi.org/10.1177/136216880607074599",
      "doi": ""
    },
    {
      "text": "Ian A. G. Wilkinson and Irene Y. Y. Fung. 2002. Small-group composition and peer effects. Int. J. Educ. Res. 37, 5 (2002), 425--447. DOI: https://doi.org/10.1016/S0883-0355(03)00014-",
      "doi": ""
    },
    {
      "text": "Joanna Wolfe and Elizabeth Powell. 2009. Biases in Interpersonal Communication: How Engineering Students Perceive Gender Typical Speech Acts in Teamwork. J. Eng. Educ. 98, 1 (2009), 5--16. DOI: https://doi.org/10.1002/j.21689830.2009.tb01001.x",
      "doi": ""
    },
    {
      "text": "Intuit 2020 Report: Twenty Trends that will Shape the Next Decade.",
      "doi": ""
    },
    {
      "text": "2015. PISA 2015 Collaborative Problem Solving Framework.",
      "doi": ""
    }
  ]
}