{
  "doi": "10.1145/3313831.3376727",
  "title": "What is AI Literacy? Competencies and Design Considerations",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Artificial intelligence (AI) is becoming increasingly integrated in user-facing technology, but public understanding of these technologies is often limited. There is a need for additional HCI research investigating a) what competencies users need in order to effectively interact with and critically evaluate AI and b) how to design learner-centered AI technologies that foster increased user understanding of AI. This paper takes a step towards realizing both of these goals by providing a concrete definition of AI literacy based on existing research. We synthesize a variety of interdisciplinary literature into a set of core competencies of AI literacy and suggest several design considerations to support AI developers and educators in creating learner-centered AI. These competencies and design considerations are organized in a conceptual framework thematically derived from the literature. This paper's contributions can be used to start a conversation about and guide future research on AI literacy within the HCI community.",
  "authors": [
    {
      "name": "Duri Long",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659184123",
      "orcid": "missing"
    },
    {
      "name": "Brian Magerko",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327490117",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "60 minutes. 2016. 60 Minutes/Vanity Fair poll: Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Edith Ackermann. 2004. Constructing knowledge and transforming the world. A learning zone of one's own: Sharing representations and flow in collaborative learning environments 1: 15--37.",
      "doi": ""
    },
    {
      "text": "ACM. 2017. Statement on Algorithmic Transparency and Accountability. Retrieved from https://www.acm.org/binaries/content/assets/publicpolicy/2017_usacm_statement_algorithms.pdf",
      "doi": ""
    },
    {
      "text": "Adam Agassi, Hadas Erel, Iddo Yehoshua Wald, and Oren Zuckerman. 2019. Scratch Nodes ML: A Playful System for Children to Create Gesture Recognition Classifiers. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3290607.3312894"
    },
    {
      "text": "AI4All. 2019. AI4All. Retrieved from http://ai-4all.org/",
      "doi": ""
    },
    {
      "text": "Safinah Ali, Blakeley H Payne, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2019. Constructionism, Ethics, and Creativity: Developing Primary and Middle School Artificial Intelligence Education. In Proceedings of IJCAI 2019.",
      "doi": ""
    },
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social media and fake news in the 2016 election. Journal of economic perspectives 31, 2: 211--36.",
      "doi": ""
    },
    {
      "text": "Michael Anderson and Susan Leigh Anderson. 2011. Machine ethics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Hilary Arksey and Lisa O'Malley. 2005. Scoping studies: towards a methodological framework. International journal of social research methodology 8, 1: 19--32.",
      "doi": ""
    },
    {
      "text": "Arm, Ltd. AI Today, AI Tomorrow | Global AI Survey Results -- Arm. Arm, Ltd. Retrieved September 6, 2019 from https://www.arm.com/solutions/artificialintelligence/survey",
      "doi": ""
    },
    {
      "text": "Stanley Aronowitz and Jonathan Cutler. 2013. Postwork. Routledge.",
      "doi": ""
    },
    {
      "text": "Harry Asada and John Leonard. 2005. Introduction to Robotics. Retrieved from https://ocw.mit.edu/courses/mechanicalengineering/2--12-introduction-to-robotics-fall2005/syllabus/",
      "doi": ""
    },
    {
      "text": "British Science Association and others. 2016. One in three believe that the rise of artificial intelligence is a threat to humanity.",
      "doi": ""
    },
    {
      "text": "David Bawden and others. 2008. Origins and concepts of digital literacy. Digital literacies: Concepts, policies and practices 30: 17--32.",
      "doi": ""
    },
    {
      "text": "Laura Beals and Marina Bers. 2006. Robotic technologies: when parents put their learning ahead of their child's. Journal of Interactive Learning Research 17, 4: 341--366.",
      "doi": ""
    },
    {
      "text": "Debra Bernstein and Kevin Crowley. 2008. Searching for signs of intelligent life: An investigation of young children's beliefs about robot intelligence. The Journal of the Learning Sciences 17, 2: 225--247.",
      "doi": ""
    },
    {
      "text": "Alan F Blackwell. 2006. Gender in Domestic Programming: From Bricolage to Séances d'Essayage. In CHI'2006 Workshop on End User Software Engineering, 1--4.",
      "doi": ""
    },
    {
      "text": "Margaret A Boden. 2004. The Creative Mind: Myths and Mechanisms. Routledge, New York, NY, USA.",
      "doi": "10.5555/940309"
    },
    {
      "text": "John D Bransford, A Brown, and R Cocking. 1999. How people learn: Mind, brain, experience, and school. Washington, DC: National Research Council.",
      "doi": ""
    },
    {
      "text": "J. Scott Brennen, Philip Howard, and Rasmus Nielsen. 2018. An Industry-Led Debate: How UK Media Cover Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Rodney A Brooks. 1991. Intelligence without representation. Artificial intelligence 47, 1--3: 139-- 159.",
      "doi": ""
    },
    {
      "text": "Meredith Broussard. 2018. Artificial unintelligence: How computers misunderstand the world. MIT Press.",
      "doi": ""
    },
    {
      "text": "Philip Sheridan Buffum, Megan Frankosky, Kristy Elizabeth Boyer, Eric N Wiebe, Bradford W Mott, and James C Lester. 2016. Collaboration and Gender Equity in Game-Based Learning for Middle School Computer Science. Computing in Science & Engineering 18, 2: 18--28.",
      "doi": "10.1109/MCSE.2016.37"
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on Fairness, Accountability and Transparency, 77--91.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2016. How the machine \"thinks': Understanding opacity in machine learning algorithms. Big Data & Society 3, 1: 2053951715622512.",
      "doi": ""
    },
    {
      "text": "Marine Carpuat and Ramani Duraiswani. Introduction to Machine Learning CMSC422. Retrieved from http://www.cs.umd.edu/class/spring2017/cmsc422//sc hedule0101/",
      "doi": ""
    },
    {
      "text": "Daniel Smilkov and Shan Carter. Tensorflow - Neural Network Playground. Retrieved January 7, 2020 from http://playground.tensorflow.org",
      "doi": ""
    },
    {
      "text": "Arjun Chandrasekaran, Viraj Prabhu, Deshraj Yadav, Prithvijit Chattopadhyay, and Devi Parikh. 2018. Do explanations make VQA models more predictable to a human? arXiv preprint arXiv:1810.12366.",
      "doi": ""
    },
    {
      "text": "Arjun Chandrasekaran, Deshraj Yadav, Prithvijit Chattopadhyay, Viraj Prabhu, and Devi Parikh. 2017. It takes two to tango: Towards theory of AI's mind. In ChaLearn Looking at People Workshop, (CVPR).",
      "doi": ""
    },
    {
      "text": "Moses Charikar. 2019. CS221: Artificial Intelligence: Principles and Techniques. Retrieved from http://web.stanford.edu/class/cs221/",
      "doi": ""
    },
    {
      "text": "John William Charnley, Alison Pease, and Simon Colton. 2012. On the Notion of Framing in Computational Creativity. In ICCC, 77--81.",
      "doi": ""
    },
    {
      "text": "Alexandra Chouldechova and Max G'Sell. 2017. Fairer and more accurate, but for whom? In Workshop on Fairness, Accountability, and Transparency in Machine Learning (FAT/ML 2017).",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2016. Artificial intelligence's white guy problem. The New York Times 25.",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Trevor Paglen. 2019. Training Humans. Retrieved from http://www.fondazioneprada.org/project/traininghumans/?lang=en",
      "doi": ""
    },
    {
      "text": "Thomas G Dietterich and Eric Horvitz. 2015. Rise of concerns about AI: Reflections and directions. Commun. ACM 58, 10: 38--40.",
      "doi": "10.1145/2770869"
    },
    {
      "text": "Catherine D'Ignazio. 2017. Creative data literacy. Information Design Journal 23, 1: 6--18.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo, Mark Guzdial, Amy Bruckman, and Tom McKlin. 2014. Saving Face While Geeking Out: Video Game Testing as a Justification for Learning Computer Science. The Journal of the Learning Sciences 23, 3: 272--315.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo, Jason Yip, Elizabeth Bonsignore, and Carl DiSalvo. 2017. Participatory Design for Learning. In Participatory Design for Learning. Routledge, 15--18.",
      "doi": ""
    },
    {
      "text": "Carl F DiSalvo, Francine Gemperle, Jodi Forlizzi, and Sara Kiesler. 2002. All robots are not created equal: the design and perception of humanoid robot heads. In Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques, 321--326.",
      "doi": "10.1145/778712.778756"
    },
    {
      "text": "Andrea A DiSessa. 2001. Changing minds: Computers, learning, and literacy. Mit Press.",
      "doi": "10.5555/335023"
    },
    {
      "text": "Zachary Dodds, Christine Alvarado, and Sara Owsley Sood. 2008. Making Research Tools Accessible for All AI Students. In Proceedings of the AAAI 2008 AI Education Colloquium.",
      "doi": ""
    },
    {
      "text": "Zachary Dodds, Lloyd Greenwald, Ayanna Howard, Sheila Tejada, and Jerry Weinberg. 2006. Components, curriculum, and community: Robots and robotics in undergraduate AI education. AI magazine 27, 1: 11--11.",
      "doi": ""
    },
    {
      "text": "Stefania Druga. 2018. Growing Up With AI Cognimates: from coding to teaching machines. MIT.",
      "doi": ""
    },
    {
      "text": "Stefania Druga. Cognimates. Retrieved January 7, 2020 from http://cognimates.me/home/",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Sarah T.Vu, Eesh Likhith, and Tammy Qiu. 2019. Inclusive AI literacy for kids around the world.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. Hey Google is it OK if I eat you?: Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children, 595--600.",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Stefania Druga, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2018. How smart are the smart toys?: children and parents' agent interaction and intelligence attribution. In Proceedings of the 17th ACM Conference on Interaction Design and Children, 231--240.",
      "doi": "10.1145/3202185.3202741"
    },
    {
      "text": "Eric Eaton. 2008. Gridworld search and rescue: A project framework for a course in artificial intelligence. In In the Proceedings of the AAAI-08 AI Education Colloquium, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Ron Eglash, Audrey Bennett, Casey O'Donnell, Sybillyn Jennings, and Margaret Cintorino. 2006. Culturally Situated Design Tools: Ethnocomputing from Field Site to Classroom. American Anthropologist 108, 2: 347--362. https://doi.org/10.1525/aa.2006.108.2.347",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Pradyumna Tambwekar, Larry Chan, Brent Harrison, and Mark Riedl. 2019. Automated Rationale Generation: A Technique for Explainable AI and its Effects on Human Perceptions. arXiv preprint arXiv:1901.03729.",
      "doi": ""
    },
    {
      "text": "Danielle Ensign, Sorelle A Friedler, Scott Neville, Carlos Scheidegger, and Suresh Venkatasubramanian. 2017. Decision making with limited feedback: Error bounds for recidivism prediction and predictive policing.",
      "doi": ""
    },
    {
      "text": "Ziv Epstein, Blakeley H Payne, Judy Hanwen Shen, Casey Jisoo Hong, Bjarke Felbo, Abhimanyu Dubey, Matthew Groh, Nick Obradovich, Manuel Cebrian, and Iyad Rahwan. 2018. TuringBox: An experimental platform for the evaluation of AI systems. In IJCAI 2018, 5826--5828.",
      "doi": ""
    },
    {
      "text": "Barbara J Ericson, Lauren E Margulieux, and Jochen Rick. 2017. Solving parsons problems versus fixing and writing code. In Proceedings of the 17th Koli Calling International Conference on Computing Education Research, 20--29.",
      "doi": "10.1145/3141880.3141895"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. I always assumed that I wasn't really that close to [her]: Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd annual ACM conference on human factors in computing systems, 153--162.",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Min Kyung Lee, A Elazari, Eric Gilbert, and Karrie Karahalios. 2019. User Attitudes towards Algorithmic Opacity and Transparency in Online Reviewing Platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1--14. https://doi.org/10.1145/3290605.3300724",
      "doi": "10.1145/3290605.3300724"
    },
    {
      "text": "Executive Office of the President. 2014. Big data: Seizing opportunities, preserving values. The White House Washington, DC.",
      "doi": ""
    },
    {
      "text": "Ethan Fast and Eric Horvitz. 2017. Long-term trends in the public perception of artificial intelligence. In Thirty-First AAAI Conference on Artificial Intelligence.",
      "doi": "10.5555/3298239.3298381"
    },
    {
      "text": "Robert B Fisher. 2001. AI and Cinema-Does artificial insanity rule? In Twelfth Irish Conference on Artificial Intelligence and Cognitive Science.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi and Carl DiSalvo. 2006. Service robots in the domestic environment: a study of the Roomba vacuum in the home. In Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction, 258--265.",
      "doi": "10.1145/1121241.1121286"
    },
    {
      "text": "Natalie Anne Freed. 2012. \"This is the fluffy robot that only speaks french\": language use between preschoolers, their families, and a social robot while sharing virtual toys. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Paulo Freire. 1972. Pedagogy of the oppressed. Herder and Herder, New York.",
      "doi": ""
    },
    {
      "text": "Helen L Gallagher and Christopher D Frith. 2003. Functional imaging of 'theory of mind.' Trends in cognitive sciences 7, 2: 77--83.",
      "doi": ""
    },
    {
      "text": "Ashok Goel. 2014. Georgia Tech CS 6795: Introduction to Cognitive Science. Retrieved from https://www.cc.gatech.edu/classes/AY2017/cs6795_s pring/description.html",
      "doi": ""
    },
    {
      "text": "Ashok Goel and Jim Davies. 2011. Artificial Intelligence. In Cambridge Handbook of Intelligence (3rd ed.), R.J. Sternberg and S.B. Kaufman (eds.). Cambridge University Press, New York, 468--484. https://doi.org/10.1145/2063176.2063177",
      "doi": ""
    },
    {
      "text": "Google. AI Experiments | Experiments with Google. Retrieved January 7, 2020 from https://experiments.withgoogle.com/collection/ai",
      "doi": ""
    },
    {
      "text": "Michal Gordon, Eileen Rivera, Edith Ackermann, and Cynthia Breazeal. 2015. Designing a relational social robot toolkit for preschool children to explore computational concepts. In Proceedings of the 14th International Conference on Interaction Design and Children, 355--358.",
      "doi": "10.1145/2771839.2771915"
    },
    {
      "text": "David Gunning. 2017. Explainable artificial intelligence (xai). Defense Advanced Research Projects Agency (DARPA), nd Web.",
      "doi": ""
    },
    {
      "text": "Samantha Hautea, Sayamindu Dasgupta, and Benjamin Mako Hill. 2017. Youth perspectives on critical data literacies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 919--930.",
      "doi": "10.1145/3025453.3025823"
    },
    {
      "text": "Clint Heinze, Janet Haase, and Helen Higgins. 2010. An Action Research Report from a MultiYear Approach to Teaching Artificial Intelligence at the K6 Level. In 1st Symposium on Educational Advances in Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Rafael Lozano Hemmer. 2015. Level of Confidence. Retrieved from http://www.lozanohemmer.com/artworks/level_of_confidence.php",
      "doi": ""
    },
    {
      "text": "Tom Hitron, Yoav Orlev, Iddo Wald, Ariel Shamir, Hadas Erel, and Oren Zuckerman. 2019. Can Children Understand Machine Learning Concepts?: The Effect of Uncovering Black Boxes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 415.",
      "doi": "10.1145/3290605.3300645"
    },
    {
      "text": "Vasant Honavar. 2007. Principles of Artificial Intelligence: Syllabus. Retrieved from http://web.cs.iastate.edu/~cs572/syllabus.html",
      "doi": ""
    },
    {
      "text": "HubSpot Research. 2016. Artificial Intelligence Is Here - People Just Don't Realize It. HubSpot Research. Retrieved September 6, 2019 from https://blog.hubspot.com/news-trends/artificialintelligence-is-here",
      "doi": ""
    },
    {
      "text": "Susan P Imberman. 2008. Making nifty assignments niftier and not so nifty assignments nifty with online technologies.",
      "doi": ""
    },
    {
      "text": "Ipsos. 2017. Revolution@Work: Fears and Expectations. Ipsos. Retrieved September 6, 2019 from https://www.ipsos.com/en/revolutionworkfears-and-expectations",
      "doi": ""
    },
    {
      "text": "Sooyeon Jeong, Deirdre E Logan, Matthew S Goodwin, Suzanne Graca, Brianna O'Connell, Honey Goodenough, Laurel Anderson, Nicole Stenquist, Katie Fitzpatrick, Miriam Zisook, and others. 2015. A social robot to mitigate stress, anxiety, and pain in hospital pediatric care. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts, 103-- 104.",
      "doi": "10.1145/2701973.2702028"
    },
    {
      "text": "Jeffrey Johnson. 2003. Children, robotics, and education. Artificial Life and Robotics 7, 1--2: 16--21.",
      "doi": ""
    },
    {
      "text": "David Joyner. 2015. CS7637: Knowledge-Based AI: Cognitive Systems Summer 2015 Syllabus. Retrieved from https://docs.google.com/document/d/1qV7SSWhpje MhCZyyYQJXmW5YYSOXzhF_pyRClDEwI4k/edi t",
      "doi": ""
    },
    {
      "text": "Ken Kahn and Niall Winters. 2017. Child-friendly programming interfaces to AI cloud services. In European Conference on Technology Enhanced Learning, 566--570.",
      "doi": ""
    },
    {
      "text": "Peter H Kahn, Batya Friedman, Deanne R PerezGranados, and Nathan G Freier. 2006. Robotic pets in the lives of preschool children. Interaction Studies 7, 3: 405--436.",
      "doi": ""
    },
    {
      "text": "Frank Klassner. 2002. A case study of LEGO Mindstorms' suitability for artificial intelligence and robotics courses at the college level. In ACM SIGCSE Bulletin, 8--12.",
      "doi": ""
    },
    {
      "text": "Ross Knepper. 2019. Foundations of Robotics. Retrieved from http://www.cs.cornell.edu/courses/cs4750/2019fa/",
      "doi": ""
    },
    {
      "text": "Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. 2015. Principles of explanatory debugging to personalize interactive machine learning. In Proceedings of the 20th international conference on intelligent user interfaces, 126--137.",
      "doi": "10.1145/2678025.2701399"
    },
    {
      "text": "Deepak Kumar and Lisa Meeden. 1998. A robot laboratory for teaching artificial intelligence. ACM SIGCSE Bulletin 30, 1: 341--344.",
      "doi": "10.1145/274790.274326"
    },
    {
      "text": "Ray Kurzweil. 2005. The singularity is near: When humans transcend biology. Penguin.",
      "doi": "10.5555/1214678"
    },
    {
      "text": "Rüdiger C Laugksch. 2000. Scientific literacy: A conceptual overview. Science education 84, 1: 71--94.",
      "doi": ""
    },
    {
      "text": "Yu Liang. 2014. CPSC 4430 Introduction to Machine Learning.",
      "doi": ""
    },
    {
      "text": "Conor Linehan, Ben J Kirman, Stuart Reeves, Mark A Blythe, Joshua G Tanenbaum, Audrey Desjardins, and Ron Wakkary. 2014. Alternate endings: using fiction to explore design futures. In CHI'14 Extended Abstracts on Human Factors in Computing Systems, 45--48.",
      "doi": "10.1145/2559206.2560472"
    },
    {
      "text": "Tengyu Ma and Christopher Re. 2019. CS 229 Machine Learning Syllabus and Course Schedule. Retrieved from http://cs229.stanford.edu/syllabus.html",
      "doi": ""
    },
    {
      "text": "Bruce MacLennan. 2017. Introduction to Machine Learning. Retrieved from http://web.eecs.utk.edu/~bmaclenn/Classes/425--528F17/",
      "doi": ""
    },
    {
      "text": "Brian Magerko, Jason Freeman, Tom McKlin, Mike Reilly, Elise Livingston, Scott McCoid, and Andrea Crews-Brown. 2016. EarSketch: A STEAM-Based Approach for Underrepresented Populations in High School Computer Science Education. ACM Transactions on Computing Education (TOCE) 16, 4: 14.",
      "doi": "10.1145/2886418"
    },
    {
      "text": "Arthur B Markman. 1999. Knowledge Representation. Lawrence Erlbaum Associates, Inc., Mahwah, NJ, USA.",
      "doi": ""
    },
    {
      "text": "James B Marshall. 2008. Leveraging the Singularity: Introducing AI to Liberal Arts Students. Association for the Advancement of Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Maja J Mataric. 2004. Robotics education for all ages. In Proc. AAAI Spring Symposium on Accessible, Hands-on AI and Robotics Education.",
      "doi": ""
    },
    {
      "text": "Michael Mateas. 2001. Expressive AI: A hybrid art and science practice. Leonardo 34, 2: 147--153.",
      "doi": ""
    },
    {
      "text": "Amy McGovern, Zachery Tidwell, and Derek Rushing. 2011. Teaching introductory artificial intelligence through java-based games. In Second AAAI Symposium on Educational Advances in Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Keith W Miller. 2010. It's not nice to fool humans. IT professional 12, 1: 51--52.",
      "doi": ""
    },
    {
      "text": "Raymond Mooney. 2007. Course Syllabus for CS 391L: Machine Learning. Retrieved from https://www.cs.utexas.edu/~mooney/cs391L/syllabus.html",
      "doi": ""
    },
    {
      "text": "Gina Neff and Peter Nagy. 2016. Automation, algorithms, and politics| talking to Bots: Symbiotic agency and the case of Tay. International Journal of Communication 10: 17.",
      "doi": ""
    },
    {
      "text": "Nils J Nilsson. 2009. The quest for artificial intelligence. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Matthew C Nisbet, Dietram A Scheufele, James Shanahan, Patricia Moy, Dominique Brossard, and Bruce V Lewenstein. 2002. Knowledge, reservations, or promise? A media effects model for public perceptions of science and technology. Communication Research 29, 5: 584--608.",
      "doi": ""
    },
    {
      "text": "Marina Papastergiou. 2008. Are computer science and information technology still masculine fields? High school students' perceptions and career choices. Computers & education 51, 2: 594--608.",
      "doi": ""
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc., New York, NY, USA.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Eli Pariser. 2011. The filter bubble: How the new personalized web is changing what we read and how we think. Penguin.",
      "doi": "10.5555/2361740"
    },
    {
      "text": "Simon Parsons and Elizabeth Sklar. 2004. Teaching AI using LEGO mindstorms. In AAAI Spring Symposium.",
      "doi": ""
    },
    {
      "text": "Pega. 2018. What Consumers Really Think About AI: A Global Study. Pega. Retrieved September 6, 2019 from https://www.pega.com/ai-survey",
      "doi": ""
    },
    {
      "text": "Javier Calzada Prado and Miguel Ángel Marzal. 2013. Incorporating data literacy into information literacy programs: Core competencies and contents. Libri 63, 2: 123--134.",
      "doi": ""
    },
    {
      "text": "Michael J Quinn. 2010. Ethics for the information age. Addison-Wesley Publishing Company.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Robbie Berg, and Michael Eisenberg. 2000. Beyond black boxes: Bringing transparency and aesthetics back to scientific investigation. The Journal of the Learning Sciences 9, 1: 7--30.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés MonroyHernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Kafai, Yasmin. 2009. Scratch: Programming for All. Communications of the ACM 52, 11: 60--67. https://doi.org/10.1145/1592761.1592779",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mark O Riedl. 2019. Human-centered artificial intelligence and machine learning. Human Behavior and Emerging Technologies 1, 1: 33--36.",
      "doi": ""
    },
    {
      "text": "Mary Rigdon. 2017. Introduction to Cognitive Science. Retrieved from https://ruccs.rutgers.edu/academics/undergraduate/syl labi/1--201-intro-syllabus/file",
      "doi": ""
    },
    {
      "text": "Alexander Rush. Syllabus for CS 182 Artificial Intelligence. Retrieved from http://people.seas.harvard.edu/~srush/syllabus.pdf",
      "doi": ""
    },
    {
      "text": "Ingrid Russell, Zdravko Markov, and Todd Neller. 2006. Teaching AI through machine learning projects. In ACM SIGCSE Bulletin, 323--323.",
      "doi": ""
    },
    {
      "text": "Stuart J Russell and Peter Norvig. 2016. Artificial intelligence: a modern approach. Malaysia; Pearson Education Limited,.",
      "doi": "10.5555/1671238"
    },
    {
      "text": "Roger C Schank. 1987. What is AI, anyway? AI magazine 8, 4: 59--59.",
      "doi": ""
    },
    {
      "text": "R Benjamin Shapiro, Rebecca Fiebrink, and Peter Norvig. 2018. How machine learning impacts the undergraduate computing curriculum. Communications of the ACM 61, 11: 27--29.",
      "doi": "10.1145/3277567"
    },
    {
      "text": "Judy Hanwen Shen, Lauren Fratamico, Iyad Rahwan, and Alexander M Rush. Darling or Babygirl? Investigating Stylistic Bias in Sentiment Analysis.",
      "doi": ""
    },
    {
      "text": "Matthew Smith, Christian Szongott, Benjamin Henne, and Gabriele Von Voigt. 2012. Big data privacy issues in public social media. In 2012 6th IEEE International Conference on Digital Ecosystems and Technologies (DEST), 1--6.",
      "doi": ""
    },
    {
      "text": "Sara Owsley Sood. 2008. Emotional computation in artificial intelligence education. In AAAI Artificial Intelligence Education Colloquium, 74--78.",
      "doi": ""
    },
    {
      "text": "Sucheta Soundarajan and Daniel L Clausen. Equal Protection Under the Algorithm: A Legal-Inspired Framework for Identifying Discrimination in Machine Learning.",
      "doi": ""
    },
    {
      "text": "Stanford University. 2018. Artificial Intelligence Index 2018 Report. Retrieved from https://aiindex.org",
      "doi": ""
    },
    {
      "text": "Stanford University. Machine Learning Syllabus. Retrieved from https://www.coursera.org/learn/machine-learning",
      "doi": ""
    },
    {
      "text": "Peter Stone, Rodney Brooks, Erik Brynjolfsson, Ryan Calo, Oren Etzioni, Greg Hager, Julia Hirschberg, Shivaram Kalyanakrishnan, Ece Kamar, Sarit Kraus, and others. 2016. Artificial intelligence and life in 2030: One hundred year study on artificial intelligence. Report of the 2015 Study Panel, tech report.",
      "doi": ""
    },
    {
      "text": "Elisabeth Sulmont, Elizabeth Patitsas, and Jeremy R Cooperstock. 2019. Can You Teach Me To Machine Learn? In Proceedings of the 50th ACM Technical Symposium on Computer Science Education, 948-- 954.",
      "doi": "10.1145/3287324.3287392"
    },
    {
      "text": "Yunjia Sun. 2016. Novice-Centric Visualizations for Machine Learning. University of Waterloo.",
      "doi": ""
    },
    {
      "text": "Fumihide Tanaka, Aaron Cicourel, and Javier R Movellan. 2007. Socialization between toddlers and robots at an early childhood education center. Proceedings of the National Academy of Sciences 104, 46: 17954--17958.",
      "doi": ""
    },
    {
      "text": "Dan Tappan. 2008. A pedagogical framework for modeling and simulating intelligent agents and control systems. Technical Report WS-08-02.",
      "doi": ""
    },
    {
      "text": "Judith Jarvis Thomson. 1984. The trolley problem. Yale LJ 94: 1395.",
      "doi": ""
    },
    {
      "text": "David Touretzky, Christina Gardner-McCune, Fred Martin, and Deborah Seehorn. 2019. Envisioning AI for K-12: What should every child know about AI? In Proceedings of the 2019 Conference on Artificial Intelligence.",
      "doi": "10.1609/aaai.v33i01.33019795"
    },
    {
      "text": "David S Touretzky. 2012. Seven big ideas in robotics, and how to teach them. In Proceedings of the 43rd ACM technical symposium on Computer Science Education, 39--44.",
      "doi": "10.1145/2157136.2157152"
    },
    {
      "text": "David S Touretzky. 2017. Computational thinking and mental models: From kodu to calypso. In Blocks and Beyond Workshop (B&B), 2017 IEEE, 71--78.",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2005. The second self: Computers and the human spirit. Mit Press.",
      "doi": "10.5555/2773"
    },
    {
      "text": "Berk Ustun, Alexander Spangher, and Yang Liu. 2019. Actionable recourse in linear classification. In Proceedings of the Conference on Fairness, Accountability, and Transparency, 10--19.",
      "doi": "10.1145/3287560.3287566"
    },
    {
      "text": "Mike Van Duuren, Barbara Dossett, and Dawn Robinson. 1998. Gauging children's understanding of artificially intelligent objects: a presentation of \"counterfactuals.\" International Journal of Behavioral Development 22, 4: 871--889.",
      "doi": ""
    },
    {
      "text": "Scott A Wallace, Ingrid Russell, and Zdravko Markov. 2008. Integrating games and machine learning in the undergraduate computer science classroom. In Proceedings of the 3rd international conference on Game development in computer science education, 56--60.",
      "doi": "10.1145/1463673.1463685"
    },
    {
      "text": "Noah Wardrip-Fruin. 2007. Three Play Effects--Eliza, Tale-Spin, and Sim City. Digital Humanities: 1--2.",
      "doi": ""
    },
    {
      "text": "Weber Shandwick, Inc. 2016. AI-Ready or Not: Artificial Intelligence Here We Come! Weber Shandwick, Inc. Retrieved September 6, 2019 from https://www.webershandwick.com/news/ai-ready-ornot-artificial-intelligence-here-we-come/",
      "doi": ""
    },
    {
      "text": "Henry M Wellman, David Cross, and Julanne Watson. 2001. Meta-analysis of theory-of-mind development: The truth about false belief. Child development 72, 3: 655--684.",
      "doi": ""
    },
    {
      "text": "Linda L. Werner, Brian Hanks, and Charlie McDowell. 2004. Pair-programming helps female computer science students. Journal on Educational Resources in Computing (JERIC) 4, 1: 4.",
      "doi": "10.1145/1060071.1060075"
    },
    {
      "text": "Randi Williams, Christian Vázquez Machado, Stefania Druga, Cynthia Breazeal, and Pattie Maes. 2018. \"My Doll Says It's Ok\": A Study of Children's Conformity to a Talking Doll. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 625--631. https://doi.org/10.1145/3202185.3210788",
      "doi": "10.1145/3202185.3210788"
    },
    {
      "text": "Randi Williams, Hae Won Park, and Cynthia Breazeal. 2019. A is for Artificial Intelligence: The Impact of Artificial Intelligence Activities on Young Children's Perceptions of Robots. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 447.",
      "doi": "10.1145/3290605.3300677"
    },
    {
      "text": "Jason Shun Wong. 2018. Design and fiction: imagining civic AI. Interactions 25, 6: 42--45.",
      "doi": "10.1145/3274568"
    },
    {
      "text": "Baobao Zhang and Allan Dafoe. 2019. Artificial Intelligence: American Attitudes and Trends. University of Oxford. Retrieved September 6, 2019 from https://governanceai.github.io/US-PublicOpinion-Report-Jan-2019/high-level-machineintelligence.html#subsecharmgood",
      "doi": ""
    },
    {
      "text": "Michelle Zimmerman. 2018. Teaching AI: Exploring New Frontiers for Learning. International Society for Technology in Education.",
      "doi": ""
    },
    {
      "text": "Abigail Zimmermann-Niefield, Makenna Turner, Bridget Murphy, Shaun K Kane, and R Benjamin Shapiro. 2019. Youth Learning Machine Learning through Building Models of Athletic Moves. In Proceedings of the 18th ACM International Conference on Interaction Design and Children, 121-- 132.",
      "doi": "10.1145/3311927.3323139"
    },
    {
      "text": "Mike Zyda and Sven Koenig. 2008. Teaching artificial intelligence playfully. In Proceedings of the AAAI-08 Education Colloquium, 90--95.",
      "doi": ""
    },
    {
      "text": "ReadyAI | Empowering all students to improve our world with AI. ReadyAI. Retrieved January 7, 2020 from https://www.readyai.org/",
      "doi": ""
    },
    {
      "text": "Machine Learning for Kids. Retrieved January 7, 2020 from https://machinelearningforkids.co.uk",
      "doi": ""
    },
    {
      "text": "GAN Lab: Play with Generative Adversarial Networks in Your Browser! Retrieved January 7, 2020 from https://poloclub.github.io/ganlab/",
      "doi": ""
    },
    {
      "text": "eCraft2Learn - Digital Fabrication and Maker Movement in Education Making Computer supported Artefacts from Scratch. eCraft2Learn. Retrieved January 7, 2020 from https://project.ecraft2learn.eu/",
      "doi": ""
    }
  ]
}