{
  "doi": "10.1145/3313831.3376498",
  "title": "Towards A Taxonomy of Content Sensitivity and Sharing Preferences for Photos",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Determining which photos are sensitive is difficult. Although emerging computer vision systems can label content items, previous attempts to distinguish private or sensitive content fall short. There is no human-centered taxonomy that describes what content is sensitive or how sharing preferences for content differs across recipients. To fill this gap, we introduce a new sensitive content elicitation method which surmounts limitations of previous approaches, and, using this new method, collected sensitive content from 116 participants. We also recorded participants' sharing preferences with 20 recipient groups. Next, we conducted a card sort to surface user-defined categories of sensitive content. Using data from these studies, we generated a taxonomy that identifies 28 categories of sensitive content. We also establish how sharing preferences for content differs across groups of recipients. This taxonomy can serve as a framework for understanding photo privacy, which can, in turn, inform new photo privacy protection mechanisms.",
  "tags": [
    "privacy",
    "photo privacy",
    "security",
    "sensitive content"
  ],
  "authors": [
    {
      "name": "Yifang Li",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659175137",
      "orcid": "missing"
    },
    {
      "name": "Nishant Vishwamitra",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659145532",
      "orcid": "missing"
    },
    {
      "name": "Hongxin Hu",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/do/10.1145/contrib-81332505285/rel-imgonly/hongxin0.jpg",
      "acmid": "81332505285",
      "orcid": "missing"
    },
    {
      "name": "Kelly Caine",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548023260",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "James D Abbey and Margaret G Meloy. 2017. Attention by design: Using attention checks to detect inattentive respondents and improve data quality. Journal of Operations Management 53 (2017), 63--70.",
      "doi": "10.1016/j.jom.2017.06.001"
    },
    {
      "text": "Patricia Sanchez Abril. 2007. A (My) space of one's own: on privacy and online social networks. Nw. J. Tech. & Intell. Prop. 6 (2007), 73.",
      "doi": ""
    },
    {
      "text": "Anne Adams, Sally Jo Cunningham, and Masood Masoodian. 2007. Sharing, privacy and trust issues for photo collections. (2007).",
      "doi": ""
    },
    {
      "text": "Shane Ahern, Dean Eckles, Nathaniel S Good, Simon King, Mor Naaman, and Rahul Nair. 2007. Over-exposed?: privacy patterns and considerations in online and mobile photo sharing. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM.",
      "doi": "10.1145/1240624.1240683"
    },
    {
      "text": "Rawan Alharbi, Mariam Tolba, Lucia C Petito, Josiah Hester, and Nabil Alshurafa. 2019. To Mask or Not to Mask?: Balancing Privacy with Visual Confirmation Utility in Activity-Oriented Wearable Cameras. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 72.",
      "doi": "10.1145/3351230"
    },
    {
      "text": "David S Allison and Miriam AM Capretz. 2011. Furthering the growth of cloud computing by providing privacy as a service. In International Conference on Information and Communication on Technology. Springer, 64--78.",
      "doi": ""
    },
    {
      "text": "Tuomas Aura, Thomas A Kuhn, and Michael Roe. 2006. Scanning electronic documents for personally identifiable information. In Proceedings of the 5th ACM workshop on Privacy in electronic society. ACM.",
      "doi": "10.1145/1179601.1179608"
    },
    {
      "text": "Kathy Baxter, Catherine Courage, and Kelly Caine. 2015. Understanding your users: A practical guide to user research methods. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Sebastian Benthall, Seda Gürses, Helen Nissenbaum, Cornell Tech, and NYU Steinhardt MCC. 2017. Contextual integrity through the lens of computer science. Now Publishers.",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Moving beyond untagging: photo privacy in a tagged world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1563--1572.",
      "doi": "10.1145/1753326.1753560"
    },
    {
      "text": "Leyla Bilge, Thorsten Strufe, Davide Balzarotti, and Engin Kirda. 2009. All your contacts are belong to us: automated identity theft attacks on social networks. In Proceedings of the 18th international conference on World wide web. ACM, 551--560.",
      "doi": "10.1145/1526709.1526784"
    },
    {
      "text": "Jens Binder, Andrew Howes, and Alistair Sutcliffe. 2009. The problem of conflicting social spheres: effects of network structure on experienced tension in social network sites. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 965--974.",
      "doi": "10.1145/1518701.1518849"
    },
    {
      "text": "Jens F Binder, Andrew Howes, and Daniel Smart. 2012. Harmony and tension on social network sites: Side-effects of increasing online interconnectivity. Information, Communication & Society 15, 9 (2012), 1279--1297.",
      "doi": ""
    },
    {
      "text": "Petter Bae Brandtzæg, Marika Lüders, and Jan Håvard Skjetne. 2010. Too many Facebook \"friends\"? Content sharing and sociability versus the need for privacy in social network sites. Intl. Journal of Human--Computer Interaction 26, 11--12 (2010), 1006--1030.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on psychological science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Daniel Buschek, Moritz Bader, Emanuel von Zezschwitz, and Alexander De Luca. 2015. Automatic privacy classification of personal photos. In Human-Computer Interaction. Springer, 428--435.",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2008. Linking studies of privacy in HCI to psychological theories of privacy. (2008).",
      "doi": ""
    },
    {
      "text": "Kelly Erinn Caine. 2009. Exploring everyday privacy behaviors and misclosures. Ph.D. Dissertation. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Krista Casler, Lydia Bickel, and Elizabeth Hackett. 2013. Separate but equal? A comparison of participants and data gathered via Amazon's MTurk, social media, and face-to-face behavioral testing. Computers in Human Behavior 29, 6 (2013), 2156--2160.",
      "doi": "10.1016/j.chb.2013.05.009"
    },
    {
      "text": "Eun Kyoung Choe, Jaeyeon Jung, Bongshin Lee, and Kristie Fisher. 2013. Nudging people away from privacy-invasive mobile apps through visual framing. In IFIP Conference on Human-Computer Interaction. Springer, 74--91.",
      "doi": ""
    },
    {
      "text": "Edward J Clarke, Mar Preston, Jo Raksin, and Vern L Bengtson. 1999. Types of conflicts and tensions between older parents and adult children. The Gerontologist 39, 3 (1999), 261--270.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Ian E Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. 2005. Location disclosure to social relations: why, when, & what people want to share. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM.",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Eric C Cook and Stephanie D Teasley. 2011. Beyond promotion and protection: creators, audiences and common ground in user-generated media. In Proceedings of the 2011 iConference. ACM, 41--47.",
      "doi": "10.1145/1940761.1940767"
    },
    {
      "text": "Patricia C de Souza and Cristiano Maciel. 2015. Legal Issues and User Experience in Ubiquitous Systems from a Privacy Perspective. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 449--460.",
      "doi": "10.1007/978-3-319-20376-8_40"
    },
    {
      "text": "Marcie D Dorethy, Martin S Fiebert, and Christopher R Warren. 2014. Examining social networking site behaviors: Photo sharing and impression management on Facebook. International Review of Social Sciences and Humanities 6, 2 (2014), 111--116.",
      "doi": ""
    },
    {
      "text": "Malin Eiband, Mohamed Khamis, Emanuel Von Zezschwitz, Heinrich Hussmann, and Florian Alt. 2017. Understanding shoulder surfing in the wild: Stories from users and observers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4254--4265.",
      "doi": "10.1145/3025453.3025636"
    },
    {
      "text": "Facebook. 2017. How do I edit the privacy settings for my photo albums? (2017). Retrieved January 2, 2018 from https://www.facebook.com/help/215496745135618? helpref=about_content.",
      "doi": ""
    },
    {
      "text": "Simone Fischer-Hubner, Chris Hoofnagle, Ioannis Krontiris, Kai Rannenberg, and Michael Waidner. 2011. Online Privacy: Towards Informational Self-Determination on the Internet. (2011).",
      "doi": ""
    },
    {
      "text": "Liqiang Geng, Larry Korba, Xin Wang, Yunli Wang, Hongyu Liu, and Yonghua You. 2008. Using data mining methods to predict personally identifiable information in emails. In International Conference on Advanced Data Mining and Applications. Springer, 272--281.",
      "doi": "10.1007/978-3-540-88192-6_26"
    },
    {
      "text": "Eric Gilbert and Karrie Karahalios. 2009. Predicting tie strength with social media. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 211--220.",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Google Street View. 2018. Image Acceptance and Privacy Policies. (2018). Retrieved May 7, 2018 from https://www.google.com/streetview/privacy/.",
      "doi": ""
    },
    {
      "text": "Steven Greenhouse and Michael Barbaro. 2005. Wal-Mart Memo Suggests Ways to Cut Employee Benefit Costs. (2005). Retrieved September 8, 2018 from https://www.nytimes.com/2005/10/26/business/ walmart-memo-suggests-ways-to-cut-employee -benefit-costs.html.",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, Eman Hassan, Yifang Li, Kelly Caine, David J Crandall, Roberto Hoyle, and Apu Kapadia. 2018. Viewer experience of obscuring scene elements in photos to enhance privacy. In ACM CHI Conference on Human Factors in Computing Systems (CHI).",
      "doi": "10.1145/3173574.3173621"
    },
    {
      "text": "Jianping He, Bin Liu, Deguang Kong, Xuan Bao, Na Wang, Hongxia Jin, and George Kesidis. 2016. Puppies: Transformation-supported personalized privacy preserving partial image sharing. In 2016 46th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN). IEEE, 359--370.",
      "doi": ""
    },
    {
      "text": "E Tory Higgins. 1987. Self-discrepancy: a theory relating self and affect. Psychological review 94, 3 (1987), 319.",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Robert Templeman, Denise Anthony, David Crandall, and Apu Kapadia. 2015. Sensitive lifelogs: A privacy analysis of photos from wearable cameras. In Proceedings of the 33rd Annual ACM conference on human factors in computing systems. ACM, 1645--1648.",
      "doi": "10.1145/2702123.2702183"
    },
    {
      "text": "Hongxin Hu, Gail-Joon Ahn, and Jan Jorgensen. 2013. Multiparty access control for online social networks: model and mechanisms. ieee transactions on knowledge and data engineering 25, 7 (2013), 1614--1627.",
      "doi": ""
    },
    {
      "text": "Panagiotis Ilia, Iasonas Polakis, Elias Athanasopoulos, Federico Maggi, and Sotiris Ioannidis. 2015. Face/off: Preventing privacy leakage from photos in social networks. In Proceedings of the 22nd ACM SIGSAC Conference on Computer and Communications Security. ACM, 781--792.",
      "doi": "10.1145/2810103.2813603"
    },
    {
      "text": "Aleksandra Kacperczyk. 2011. Social isolation in the workplace: A cross-national and longitudinal analysis. (2011).",
      "doi": ""
    },
    {
      "text": "Sanjay Kairam, Mike Brzozowski, David Huffaker, and Ed Chi. 2012. Talking in circles: selective sharing in google+. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1065--1074.",
      "doi": "10.1145/2207676.2208552"
    },
    {
      "text": "Sanjay Kairam, Joseph Kaye, John Alexis Guerra-Gomez, and David A Shamma. 2016. Snap Decisions?: How Users, Content, and Aesthetics Interact to Shape Photo Sharing Behaviors. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/2858036.2858451"
    },
    {
      "text": "Bart P Knijnenburg. 2017. Privacy? I Can't Even! making a case for user-tailored privacy. IEEE Security & Privacy 15, 4 (2017), 62--67.",
      "doi": "10.1109/MSP.2017.3151331"
    },
    {
      "text": "Bart Piet Knijnenburg and Alfred Kobsa. 2014. Increasing sharing tendency without reducing satisfaction: finding the best privacy-settings user interface for social networks. (2014).",
      "doi": ""
    },
    {
      "text": "William Kruskal and Frederick Mosteller. 1979. Representative sampling, II: Scientific literature, excluding statistics. International Statistical Review/Revue Internationale de Statistique (1979), 111--127.",
      "doi": ""
    },
    {
      "text": "Priya Kumar and Sarita Schoenebeck. 2015. The modern day baby book: Enacting good mothering and stewarding privacy on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1302--1312.",
      "doi": "10.1145/2675133.2675149"
    },
    {
      "text": "Yao Li, Alfred Kobsa, Bart P Knijnenburg, and MH Carolyn Nguyen. 2017a. Cross-cultural privacy prediction. Proceedings on Privacy Enhancing Technologies 2017, 2 (2017), 113--132.",
      "doi": ""
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Hongxin Hu, Bart P Knijnenburg, and Kelly Caine. 2017b. Effectiveness and users' experience of face blurring as a privacy protection for sharing photos via online social networks. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 61. SAGE Publications Sage CA: Los Angeles, CA, 803--807.",
      "doi": ""
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Bart P Knijnenburg, Hongxin Hu, and Kelly Caine. 2017c. Blur vs. block: Investigating the effectiveness of privacy-enhancing obfuscation for images. In 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). IEEE, 1343--1351.",
      "doi": ""
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Bart P. Knijnenburg, Hongxin Hu, and Kelly Caine. 2017d. Effectiveness and users' experience of obfuscation as a privacy-enhancing technology for sharing photos. Proceedings of the ACM on Human-Computer Interaction 1, 2 (2017).",
      "doi": "10.1145/3134702"
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. 2014. Microsoft coco: Common objects in context. In European conference on computer vision. Springer, 740--755.",
      "doi": ""
    },
    {
      "text": "Kimberly J Mitchell, David Finkelhor, and Janis Wolak. 2001. Risk factors for and impact of online sexual solicitation of youth. Jama 285, 23 (2001), 3011--3014.",
      "doi": ""
    },
    {
      "text": "Adam D Moore. 2007. Toward informational privacy rights. San Diego L. Rev. 44 (2007), 809.",
      "doi": ""
    },
    {
      "text": "Tyler Moore, Richard Clayton, and Ross Anderson. 2009. The economics of online crime. Journal of Economic Perspectives 23, 3 (2009).",
      "doi": ""
    },
    {
      "text": "Glen J Nowak and Joseph Phelps. 1992. Understanding privacy concerns. An assessment of consumers' information-related knowledge and beliefs. Journal of Direct Marketing 6, 4 (1992), 28--39.",
      "doi": ""
    },
    {
      "text": "Judith S Olson, Jonathan Grudin, and Eric Horvitz. 2005. A study of preferences for sharing and privacy. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 1985--1988.",
      "doi": "10.1145/1056808.1057073"
    },
    {
      "text": "Tribhuvanesh Orekondy, Bernt Schiele, and Mario Fritz. 2017. Towards a visual privacy advisor: Understanding and predicting privacy risks in images. In 2017 IEEE International Conference on Computer Vision (ICCV). IEEE, 3706--3715.",
      "doi": ""
    },
    {
      "text": "Sinno Jialin Pan and Qiang Yang. 2009. A survey on transfer learning. IEEE Transactions on knowledge and data engineering 22, 10 (2009), 1345--1359.",
      "doi": "10.1109/TKDE.2009.191"
    },
    {
      "text": "Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a sufficient condition for data quality on Amazon Mechanical Turk. Behavior research methods 46, 4 (2014), 1023--1031.",
      "doi": ""
    },
    {
      "text": "Tiffany A Pempek, Yevdokiya A Yermolayeva, and Sandra L Calvert. 2009. College students' social networking experiences on Facebook. Journal of applied developmental psychology 30, 3 (2009), 227--238.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin and Jingjing Jiang. 2018. About a quarter of U.S. adults say they are \"almost constantly' online. (2018). Retrieved February, 2019 from http://www.pewresearch.org/fact-tank/2018/03/14/ about-a-quarter-of-americans-report-goingonline-almost-constantly/.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2018. Internet/Broadband Fact Sheet. (2018). Retrieved February, 2019 from http://www.pewinternet.org/fact-sheet/internet-broadband/.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, Alisha Pradhan, and Michelle L Mazurek. 2017. How well do my results generalize? Comparing security and privacy survey results from MTurk and web panels to the US. Technical Report.",
      "doi": ""
    },
    {
      "text": "Jessica Ringrose, Laura Harvey, Rosalind Gill, and Sonia Livingstone. 2013. Teen girls, sexual double standards and \"sexting': Gendered value in digital image exchange. Feminist theory 14, 3 (2013), 305--323.",
      "doi": ""
    },
    {
      "text": "Joel Ross, Andrew Zaldivar, Lilly Irani, and Bill Tomlinson. 2009. Who are the turkers? worker demographics in amazon mechanical turk. Department of Informatics, University of California, Irvine, USA, Tech. Rep (2009).",
      "doi": ""
    },
    {
      "text": "Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, Alexander Berg, and Fei-Fei Li. 2015. Imagenet large scale visual recognition challenge. International Journal of Computer Vision 115, 3 (2015).",
      "doi": "10.1007/s11263-015-0816-y"
    },
    {
      "text": "Robert Sheridan. 2014. Malingering: Yes, it May Get You Fired. (2014). Retrieved September 19, 2018 from https://www.mintz.com/insights- center/viewpoints/ 2014-05-malingering-yes-it-may-get-you-fired.",
      "doi": ""
    },
    {
      "text": "Yoshinari Shirai, Yasue Kishino, Takayuki Suyama, and Shin Mizutani. 2019. PASNIC: a thermal based privacy-aware sensor node for image capturing. In Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers. ACM, 202--205.",
      "doi": "10.1145/3341162.3343803"
    },
    {
      "text": "M Six Silberman, Bill Tomlinson, Rochelle LaPlante, Joel Ross, Lilly Irani, and Andrew Zaldivar. 2018. Responsible research with crowds: pay crowdworkers at least minimum wage. Commun. ACM 61, 3 (2018), 39--41.",
      "doi": "10.1145/3180492"
    },
    {
      "text": "Meredith M Skeels and Jonathan Grudin. 2009. When social networks cross boundaries: a case study of workplace use of facebook and linkedin. In Proceedings of the ACM 2009 international conference on Supporting group work. ACM, 95--104.",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The post that wasn't: exploring self-censorship on facebook. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 793--802.",
      "doi": "10.1145/2441776.2441865"
    },
    {
      "text": "Donna Spencer. 2009. Card sorting: Designing usable categories. Rosenfeld Media.",
      "doi": ""
    },
    {
      "text": "Donna Spencer and Todd Warfel. 2004. Card sorting: a definitive guide. Boxes and Arrows 2 (2004).",
      "doi": ""
    },
    {
      "text": "Qianru Sun, Liqian Ma, Seong Joon Oh, Luc Van Gool, Bernt Schiele, and Mario Fritz. 2017. Natural and Effective Obfuscation by Head Inpainting. arXiv preprint arXiv:1711.09001 (2017).",
      "doi": ""
    },
    {
      "text": "Kurt Thomas, Chris Grier, and David M Nicol. 2010. unfriendly: Multi-party privacy risks in social networks. In International Symposium on Privacy Enhancing Technologies Symposium. Springer, 236--252.",
      "doi": "10.5555/1881151.1881165"
    },
    {
      "text": "Sara E Thomas. 2018. \"What Should I Do?\": Young Women's Reported Dilemmas with Nude Photographs. Sexuality Research and Social Policy 15, 2 (2018), 192--207.",
      "doi": ""
    },
    {
      "text": "Lisa Torrey and Jude Shavlik. 2010. Transfer learning. In Handbook of research on machine learning applications and trends: algorithms, methods, and techniques. IGI Global, 242--264.",
      "doi": ""
    },
    {
      "text": "Lam Tran, Deguang Kong, Hongxia Jin, and Ji Liu. 2016. Privacy-CNH: A Framework to Detect Photo Privacy with Convolutional Neural Network using Hierarchical Features.. In AAAI. 1317--1323.",
      "doi": ""
    },
    {
      "text": "Tom Tullis and Larry Wood. 2004. How many users are enough for a card-sorting study. In Proceedings UPA, Vol. 2004.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Jinyoung Kim. 2014. You can't block people offline: Examining how Facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 461--474.",
      "doi": "10.1145/2531602.2531672"
    },
    {
      "text": "Tim Wafa. 2009. How the lack of prescriptive technical granularity in HIPAA has compromised patient privacy. N. Ill. UL Rev. 30 (2009), 531.",
      "doi": ""
    },
    {
      "text": "Wenbo Wang, Hean Tat Keh, and Lisa E Bolton. 2009. Lay theories of medicine and a healthy lifestyle. Journal of Consumer Research 37, 1 (2009), 80--97.",
      "doi": ""
    },
    {
      "text": "Yang Wang, Gregory Norice, and Lorrie Faith Cranor. 2011. Who is concerned about what? A study of American, Chinese and Indian users' privacy concerns on social network sites. In International Conference on Trust and Trustworthy Computing. Springer, 146--153.",
      "doi": "10.5555/2022245.2022260"
    },
    {
      "text": "Heng Xu, Na Wang, and Jens Grossklags. 2012. Privacy by redesign: Alleviating privacy concerns for third-party apps. (2012).",
      "doi": ""
    },
    {
      "text": "George Yee and Larry Korba. 2005. Comparing and matching privacy policies using community consensus. In Proceedings, 16th IRMA International Conference, San Diego, California. Citeseer.",
      "doi": ""
    },
    {
      "text": "Alyson Leigh Young and Anabel Quan-Haase. 2013. Privacy protection strategies on Facebook: The Internet privacy paradox revisited. Information, Communication & Society 16, 4 (2013), 479--500.",
      "doi": ""
    },
    {
      "text": "Jun Yu, Zhenzhong Kuang, Zhou Yu, Dan Lin, and Jianping Fan. 2017. Privacy Setting Recommendation for Image Sharing. In Machine Learning and Applications (ICMLA), 2017 16th IEEE International Conference on. IEEE, 726--730.",
      "doi": ""
    },
    {
      "text": "Jun Yu, Zhenzhong Kuang, Baopeng Zhang, Wei Zhang, Dan Lin, and Jianping Fan. 2018. Leveraging Content Sensitiveness and User Trustworthiness to Recommend Fine-Grained Privacy Settings for Social Image Sharing. IEEE Transactions on Information Forensics and Security 13, 5 (2018), 1317--1332.",
      "doi": "10.1109/tifs.2017.2787986"
    }
  ]
}