{
  "doi": "10.1145/3313831.3376578",
  "title": "GazeConduits: Calibration-Free Cross-Device Collaboration through Gaze and Touch",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "We present GazeConduits, a calibration-free ad-hoc mobile interaction concept that enables users to collaboratively interact with tablets, other users, and content in a cross-device setting using gaze and touch input. GazeConduits leverages recently introduced smartphone capabilities to detect facial features and estimate users' gaze directions. To join a collaborative setting, users place one or more tablets onto a shared table and position their phone in the center, which then tracks users present as well as their gaze direction to determine the tablets they look at. We present a series of techniques using GazeConduits for collaborative interaction across mobile devices for content selection and manipulation. Our evaluation with 20 simultaneous tablets on a table shows that GazeConduits can reliably identify which tablet or collaborator a user is looking at.",
  "tags": [
    "cross-device interaction",
    "gaze input",
    "touch input"
  ],
  "authors": [
    {
      "name": "Simon Voelker",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81479651640/rel-imgonly/simon_voelker.jpg",
      "acmid": "81479651640",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Hueber",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528508",
      "orcid": "missing"
    },
    {
      "name": "Christian Holz",
      "institution": "ETH Zürich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Christian Remy",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484653849",
      "orcid": "missing"
    },
    {
      "name": "Nicolai Marquardt",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    }
  ],
  "references": [
    {
      "text": "Frederik Brudy, Christian Holz, Roman Rädle, Chi-Jui Wu, Steven Houben, Clemens Klokmose, and Nicolai Marquardt. 2019. Cross-Device Taxonomy: Survey, Opportunities and Challenges of Interactions Spanning Across Multiple Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. DOI: http://dx.doi.org/10.1145/3290605.3300792",
      "doi": "10.1145/3290605.3300792"
    },
    {
      "text": "Frederik Brudy, Steven Houben, Nicolai Marquardt, and Yvonne Rogers. 2016. CurationSpace: Cross-Device Content Curation Using Instrumental Interaction. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 159--168. DOI: http://dx.doi.org/10.1145/2992154.2992175",
      "doi": "10.1145/2992154.2992175"
    },
    {
      "text": "G. Goswami, M. Vatsa, and R. Singh. 2014. RGB-D Face Recognition With Texture and Attribute Features. IEEE Transactions on Information Forensics and Security 9, 10 (Oct 2014), 1629--1640. DOI: http://dx.doi.org/10.1109/TIFS.2014.2343913",
      "doi": "10.1109/TIFS.2014.2343913"
    },
    {
      "text": "Jens Grubert and Matthias Kranz. 2017. HeadPhones: Ad Hoc Mobile Multi-Display Environments Through Head Tracking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3966--3971. DOI: http://dx.doi.org/10.1145/3025453.3025533",
      "doi": "10.1145/3025453.3025533"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2773--2782. DOI: http://dx.doi.org/10.1145/2556288.2557170",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Ken Hinckley. 2003. Synchronous Gestures for Multiple Persons and Computers. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 149--158. DOI: http://dx.doi.org/10.1145/964696.964713",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Ken Hinckley, Morgan Dixon, Raman Sarin, Francois Guimbretiere, and Ravin Balakrishnan. 2009. Codex: A Dual Screen Tablet Computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1933--1942. DOI: http://dx.doi.org/10.1145/1518701.1518996",
      "doi": "10.1145/1518701.1518996"
    },
    {
      "text": "Ken Hinckley, Gonzalo Ramos, Francois Guimbretiere, Patrick Baudisch, and Marc Smith. 2004. Stitching: Pen Gestures That Span Multiple Displays. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, NY, NY, USA, 23--31. DOI: http://dx.doi.org/10.1145/989863.989866",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Leila Homaeian, Nippun Goyal, James R. Wallace, and Stacey D. Scott. 2018. Group vs Individual: Impact of TOUCH and TILT Cross-Device Interactions on Mixed-Focus Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 73, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173647",
      "doi": "10.1145/3173574.3173647"
    },
    {
      "text": "Gang Hu, Derek Reilly, Mohammed Alnusayri, Ben Swinden, and Qigang Gao. 2014. DT-DT: Top-down Human Activity Analysis for Interactive Surface Applications. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, NY, NY, USA, 167--176. DOI: http://dx.doi.org/10.1145/2669485.2669501",
      "doi": "10.1145/2669485.2669501"
    },
    {
      "text": "Shahram Izadi, Harry Brignull, Tom Rodden, Yvonne Rogers, and Mia Underwood. 2003. Dynamo: A Public Interactive Surface Supporting the Cooperative Sharing and Exchange of Media. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 159--168. DOI: http://dx.doi.org/10.1145/964696.964714",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Robert J. K. Jacob. 1990. What You Look at is What You Get: Eye Movement-based Interaction Techniques. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90). ACM, NY, NY, USA, 11--18. DOI: http://dx.doi.org/10.1145/97243.97246",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Hans-Christian Jetter and Harald Reiterer. 2013. Self-Organizing User Interfaces : Envisioning the Future of Ubicomp UIs. In Workshop Blended Interaction (in conjunction with CHI ' 13 ACM SIGCHI Conference on Human Factors in Computing Systems). Universtiy of Konstanz.",
      "doi": ""
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbæk. 2015. Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 147--156. DOI: http://dx.doi.org/10.1145/2807442.2807475",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "Mohamed Khamis, Florian Alt, and Andreas Bulling. 2018. The Past, Present, and Future of Gaze-enabled Handheld Mobile Devices: Survey and Lessons Learned. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, NY, NY, USA, Article 38, 17 pages. DOI: http://dx.doi.org/10.1145/3229434.3229452",
      "doi": "10.1145/3229434.3229452"
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM Press, 280--290. DOI: http://dx.doi.org/10.1145/2807442.2807446",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "K. Krafka, A. Khosla, P. Kellnhofer, H. Kannan, S. Bhandarkar, W. Matusik, and A. Torralba. 2016. Eye Tracking for Everyone. In 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 2176--2184. DOI: http://dx.doi.org/10.1109/CVPR.2016.239",
      "doi": ""
    },
    {
      "text": "R. Langner, T. Horak, and R. Dachselt. 2018. VisTiles: Coordinating and Combining Co-located Mobile Devices for Visual Data Exploration. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 626--636. DOI: http://dx.doi.org/10.1109/TVCG.2017.2744019",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1787--1796. DOI: http://dx.doi.org/10.1145/1978942.1979201",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "Nicolai Marquardt, Frederik Brudy, Can Liu, Ben Bengler, and Christian Holz. 2018. SurfaceConstellations: A Modular Hardware Platform for Ad-Hoc Reconfigurable Cross-Device Workspaces. ACM Press, 1--14. DOI: http://dx.doi.org/10.1145/3173574.3173928",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device Interaction via Micro-mobility and F-formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 13--22. DOI: http://dx.doi.org/10.1145/2380116.2380121",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Emiliano Miluzzo, Tianyu Wang, and Andrew T. Campbell. 2010. EyePhone: Activating Mobile Phones with Your Eyes. In Proceedings of the Second ACM SIGCOMM Workshop on Networking, Systems, and Applications on Mobile Handhelds (MobiHeld '10). ACM, NY, NY, USA, 15--20. DOI: http://dx.doi.org/10.1145/1851322.1851328",
      "doi": ""
    },
    {
      "text": "Miguel A. Nacenta, Carl Gutwin, Dzmitry Aliakseyeu, and Sriram Subramanian. 2009. There and Back Again: Cross-Display Object Movement in Multi-Display Environments. Human--Computer Interaction 24, 1--2 (2009), 170--229. DOI: http://dx.doi.org/10.1080/07370020902819882",
      "doi": ""
    },
    {
      "text": "Michael Nebeling. 2016. Cross-Device Interfaces: Existing Research, Current Tools, Outlook. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 513--516. DOI: http://dx.doi.org/10.1145/2992154.2996361",
      "doi": "10.1145/2992154.2996361"
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, Ming Ki Chong, and Hans Gellersen. 2014. Gaze-touch: combining gaze with multi-touch for interaction on the same surface. ACM Press, 509--518. DOI: http://dx.doi.org/10.1145/2642918.2647397",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, Ming Ki Chong, Yanxia Zhang, and Hans Gellersen. 2015. Gaze-Shifting: Direct-Indirect Input with Pen and Touch Modulated by Gaze. ACM Press, 373--383. DOI: http://dx.doi.org/10.1145/2807442.2807460",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, and Hans Gellersen. 2016. GazeArchers: playing with individual and shared attention in a two-player look&shoot tabletop game. ACM Press, 213--216. DOI: http://dx.doi.org/10.1145/3012709.3012717",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer and Hans Gellersen. 2016. Gaze and Touch Interaction on Tablets. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 301--311. DOI: http://dx.doi.org/10.1145/2984511.2984514",
      "doi": "10.1145/2984511.2984514"
    },
    {
      "text": "Jun Rekimoto. 1997. Pick-and-drop: A Direct Manipulation Technique for Multiple Computer Environments. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (UIST '97). ACM, NY, NY, USA, 31--39. DOI: http://dx.doi.org/10.1145/263407.263505",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Jun Rekimoto, Yuji Ayatsuka, and Michimune Kohno. 2003. SyncTap: An Interaction Technique for Mobile Networking. In Human-Computer Interaction with Mobile Devices and Services, Luca Chittaro (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 104--115.",
      "doi": ""
    },
    {
      "text": "Christian Remy, Malte Weiss, Martina Ziefle, and Jan Borchers. 2010. A Pattern Language for Interactive Tabletops in Collaborative Workspaces. In Proceedings of the 15th European Conference on Pattern Languages of Programs. Irsee Monastery, Bavaria, Germany.",
      "doi": "10.1145/2328909.2328921"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Jonathan Fischer, Inti Gabriel, Clemens N. Klokmose, Harald Reiterer, and Christian Holz. 2018. PolarTrack: Optical Outside-In Device Tracking That Exploits Display Polarization. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18). ACM, NY, NY, USA, 497:1--497:9. DOI: http://dx.doi.org/10.1145/3173574.3174071",
      "doi": ""
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. ACM Press, 45--54. DOI: http://dx.doi.org/10.1145/2669485.2669500",
      "doi": ""
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. ACM Press, 3913--3922. DOI: http://dx.doi.org/10.1145/2702123.2702287",
      "doi": ""
    },
    {
      "text": "Adalberto L. Simeone, Julian Seifert, Dominik Schmidt, Paul Holleis, Enrico Rukzio, and Hans Gellersen. 2013. A Cross-device Drag-and-drop Technique. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, NY, NY, USA, Article 10, 4 pages. DOI: http://dx.doi.org/10.1145/2541831.2541848",
      "doi": "10.1145/2541831.2541848"
    },
    {
      "text": "Sophie Stellmach and Raimund Dachselt. 2012. Investigating Gaze-supported Multimodal Pan and Zoom. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '12). ACM, NY, NY, USA, 357--360. DOI: http://dx.doi.org/10.1145/2168556.2168636",
      "doi": "10.1145/2168556.2168636"
    },
    {
      "text": "Sophie Stellmach and Raimund Dachselt. 2013. Still Looking: Investigating Seamless Gaze-supported Selection, Positioning, and Manipulation of Distant Targets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 285--294. DOI: http://dx.doi.org/10.1145/2470654.2470695",
      "doi": "10.1145/2470654.2470695"
    },
    {
      "text": "Norbert A. Streitz, Jörg Geißler, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz, and Ralf Steinmetz. 1999. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 120--127. DOI: http://dx.doi.org/10.1145/302979.303010",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Jayson Turner, Jason Alexander, Andreas Bulling, and Hans Gellersen. 2015. Gaze+RST: Integrating Gaze and Multitouch for Remote Rotate-Scale-Translate Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 4179--4188. DOI: http://dx.doi.org/10.1145/2702123.2702355",
      "doi": "10.1145/2702123.2702355"
    },
    {
      "text": "Jayson Turner, Andreas Bulling, Jason Alexander, and Hans Gellersen. 2014a. Cross-device Gaze-supported Point-to-point Content Transfer. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '14). ACM, NY, NY, USA, 19--26. DOI: http://dx.doi.org/10.1145/2578153.2578155",
      "doi": "10.1145/2578153.2578155"
    },
    {
      "text": "Jayson Turner, Andreas Bulling, Jason Alexander, and Hans Gellersen. 2014b. Cross-device Gaze-supported Point-to-point Content Transfer. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '14). ACM, NY, NY, USA, 19--26. DOI: http://dx.doi.org/10.1145/2578153.2578155",
      "doi": "10.1145/2578153.2578155"
    },
    {
      "text": "Jayson Turner, Andreas Bulling, and Hans Gellersen. 2011. Combining Gaze with Manual Interaction to Extend Physical Reach. In Proceedings of the 1st International Workshop on Pervasive Eye Tracking & Mobile Eye-based Interaction (PETMEI '11). ACM, NY, NY, USA, 33--36. DOI: http://dx.doi.org/10.1145/2029956.2029966",
      "doi": "10.1145/2029956.2029966"
    },
    {
      "text": "Vincent van Rheden, Bernhard Maurer, Dorothé Smit, Martin Murer, and Manfred Tscheligi. 2017. LaserViz: Shared Gaze in the Co-Located Physical World. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, NY, NY, USA, 191--196. DOI: http://dx.doi.org/10.1145/3024969.3025010",
      "doi": "10.1145/3024969.3025010"
    },
    {
      "text": "Roel Vertegaal, Aadil Mamuji, Changuk Sohn, and Daniel Cheng. 2005. Media Eyepliances: Using Eye Tracking for Remote Control Focus Selection of Appliances. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1861--1864. DOI: http://dx.doi.org/10.1145/1056808.1057041",
      "doi": "10.1145/1056808.1057041"
    },
    {
      "text": "Simon Voelker, Andrii Matviienko, Johannes Schöning, and Jan Borchers. 2015. Combining Direct and Indirect Touch Input for Interactive Workspaces using Gaze Input. ACM Press, 79--88. DOI: http://dx.doi.org/10.1145/2788940.2788949",
      "doi": ""
    },
    {
      "text": "Colin Ware and Harutune H. Mikaelian. 1987. An Evaluation of an Eye Tracker As a Device for Computer Input2. In Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface (CHI '87). ACM, NY, NY, USA, 183--188. DOI: http://dx.doi.org/10.1145/29933.275627",
      "doi": ""
    },
    {
      "text": "Daniel Wigdor, Hao Jiang, Clifton Forlines, Michelle Borkin, and Chia Shen. 2009. WeSpace: The Design Development and Deployment of a Walk-up and Share Multi-surface Visual Collaboration System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1237--1246. DOI: http://dx.doi.org/10.1145/1518701.1518886",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Erroll Wood and Andreas Bulling. 2014. EyeTab: Model-based Gaze Estimation on Unmodified Tablet Computers. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '14). ACM, NY, NY, USA, 207--210. DOI: http://dx.doi.org/10.1145/2578153.2578185",
      "doi": "10.1145/2578153.2578185"
    },
    {
      "text": "Pawe\\l Wozniak, Nitesh Goyal, Przemys\\law Kucharski, Lars Lischke, Sven Mayer, and Morten Fjeld. 2016. RAMPARTS: Supporting Sensemaking with Spatially-Aware Mobile Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2447--2460. DOI: http://dx.doi.org/10.1145/2858036.2858491",
      "doi": ""
    },
    {
      "text": "Chi-Jui Wu, Steven Houben, and Nicolai Marquardt. 2017. EagleSense: Tracking People and Devices in Interactive Spaces Using Real-Time Top-View Depth-Sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3929--3942. DOI: http://dx.doi.org/10.1145/3025453.3025562",
      "doi": "10.1145/3025453.3025562"
    },
    {
      "text": "Shumin Zhai. 2003. What's in the Eyes for Attentive Input. Commun. ACM 46, 3 (March 2003), 34--39. DOI: http://dx.doi.org/10.1145/636772.636795",
      "doi": "10.1145/636772.636795"
    },
    {
      "text": "Shumin Zhai, Carlos Morimoto, and Steven Ihde. 1999. Manual and Gaze Input Cascaded (MAGIC) Pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 246--253. DOI: http://dx.doi.org/10.1145/302979.303053",
      "doi": "10.1145/302979.303053"
    },
    {
      "text": "Yanxia Zhang, Ken Pfeuffer, Ming Ki Chong, Jason Alexander, Andreas Bulling, and Hans Gellersen. 2017. Look together: using gaze for assisting co-located collaborative search. Personal and Ubiquitous Computing 21, 1 (Feb. 2017), 173--186. DOI: http://dx.doi.org/10.1007/s00779-016-0969-x",
      "doi": "10.1007/s00779-016-0969-x"
    }
  ]
}