{
  "doi": "10.1145/3313831.3376461",
  "title": "Empathy Is All You Need: How a Conversational Agent Should Respond to Verbal Abuse",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "With the popularity of AI-infused systems, conversational agents (CAs) are becoming essential in diverse areas, offering new functionality and convenience, but simultaneously, suffering misuse and verbal abuse. We examine whether conversational agents' response styles under varying abuse types influence those emotions found to mitigate peoples' aggressive behaviors, involving three verbal abuse types (Insult, Threat, Swearing) and three response styles (Avoidance, Empathy, Counterattacking). Ninety-eight participants were assigned to one of the abuse type conditions, interacted with the three spoken (voice-based) CAs in turn, and reported their feelings about guiltiness, anger, and shame after each session. The results show that the agent's response style has a significant effect on user emotions. Participants were less angry and more guilty with the empathy agent than the other two agents. Furthermore, we investigated the current status of commercial CAs' responses to verbal abuse. Our study findings have direct implications for the design of conversational agents.",
  "tags": [
    "verbal abuse",
    "agent abuse",
    "smart speaker",
    "conversational agent",
    "virtual assistant",
    "intelligent personal assistant"
  ],
  "authors": [
    {
      "name": "Hyojin Chin",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160115",
      "orcid": "missing"
    },
    {
      "name": "Lebogang Wame Molefi",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162731",
      "orcid": "missing"
    },
    {
      "name": "Mun Yong Yi",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100168673",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Gartner Says Worldwide Spending on VPA-Enabled Wireless Speakers Will Top 3.5 Billion dollar by 2021. (2017). Retrieved September 19, 2019 from https://gtnr.it/2AfUFOx",
      "doi": ""
    },
    {
      "text": "2018. Siri owns 46% of the mobile voice assistant market - one and half times Google Assistant's share of the market. (2018). Retrieved September 19, 2019 from https://bit.ly/2kswQ0S",
      "doi": ""
    },
    {
      "text": "2018. U.S. Smart Speaker Users Rise to 57 Million. (2018). Retrieved September 19, 2019 from https://bit.ly/2yLhtnV",
      "doi": ""
    },
    {
      "text": "Lindsey Susan Aloia and Denise Haunani Solomon. 2016. Emotions associated with verbal aggression expression and suppression. Western Journal of Communication 80, 1 (2016), 3--20.",
      "doi": ""
    },
    {
      "text": "Carolyn M Anderson and Matthew M Martin. 1999. The relationship of argumentativeness and verbal aggressiveness to cohesion, consensus, and satisfaction in small groups. Communication Reports 12, 1 (1999), 21--31.",
      "doi": ""
    },
    {
      "text": "M Astrid, Nicole C Krämer, Jonathan Gratch, and Sin-Hwa Kang. 2010. \"It doesn't matter what you are!\" Explaining social effects of agents and avatars. Computers in Human Behavior 26, 6 (2010), 1641--1650.",
      "doi": "10.1016/j.chb.2010.06.012"
    },
    {
      "text": "Jeffrey J Bailey and Michael A McCollough. 2000. Emotional labor and the difficult customer: Coping strategies of service agents and organizational consequences. Journal of Professional Services Marketing 20, 2 (2000), 51--72.",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck, Dana Kulic, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement instruments for the anthropomorphism, animacy, likeability, perceived intelligence, and perceived safety of robots. International journal of social robotics 1, 1 (2009), 71--81.",
      "doi": ""
    },
    {
      "text": "Keith H Basso. 1974. Basic conversation rules. Unpublished manuscript (1974).",
      "doi": ""
    },
    {
      "text": "Sheryl Brahnam. 2005. Strategies for handling customer abuse of ECAs. Abuse: The darker side of human-computer interaction (2005), 62--67.",
      "doi": ""
    },
    {
      "text": "Sheryl Brahnam and Antonella De Angeli. 2012. Gender affordances of conversational agents. Interacting with Computers 24, 3 (2012), 139--153.",
      "doi": "10.1016/j.intcom.2012.05.001"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Scott Brave, Clifford Nass, and Kevin Hutchinson. 2005. Computers that care: investigating the effects of orientation of emotion exhibited by an embodied computer agent. International journal of human-computer studies 62, 2 (2005), 161--178.",
      "doi": "10.1016/j.ijhcs.2004.11.002"
    },
    {
      "text": "Arnold H Buss and Mark Perry. 1992. The aggression questionnaire. Journal of personality and social psychology 63, 3 (1992), 452.",
      "doi": ""
    },
    {
      "text": "Richard Catrambone, John Stasko, and Jun Xiao. 2004. ECA as user interface paradigm. In From brows to trust. Springer, 239--267.",
      "doi": ""
    },
    {
      "text": "Gary Charness, Uri Gneezy, and Michael A Kuhn. 2012. Experimental methods: Between-subject and within-subject design. Journal of Economic Behavior & Organization 81, 1 (2012), 1--8.",
      "doi": ""
    },
    {
      "text": "Ana Paula Chaves and Marco Aurelio Gerosa. 2018. Single or Multiple Conversational Agents?: An Interactional Coherence Comparison. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 191.",
      "doi": "10.1145/3173574.3173765"
    },
    {
      "text": "Hyojin Chin and Mun Yong Yi. 2019. Should an Agent Be Ignoring It?: A Study of Verbal Abuse Types and Conversational Agents' Response Styles. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article LBW2422, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3312826",
      "doi": "10.1145/3290607.3312826"
    },
    {
      "text": "Leon Ciechanowski, Aleksandra Przegalinska, Mikolaj Magnuski, and Peter Gloor. 2019. In the shades of the uncanny valley: An experimental study of human--chatbot interaction. Future Generation Computer Systems 92 (2019), 539--548.",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, Vincent Wade, and Benjamin R. Cowan. 2019. What Makes a Good Conversation?: Challenges in Designing Truly Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 475, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300705",
      "doi": "10.1145/3290605.3300705"
    },
    {
      "text": "Amanda Cercas Curry and Verena Rieser. 2018. # MeToo Alexa: How Conversational Systems Respond to Sexual Harassment. In Proceedings of the Second ACL Workshop on Ethics in Natural Language Processing. 7--14.",
      "doi": ""
    },
    {
      "text": "Antonella De Angeli and Sheryl Brahnam. 2008. I hate you! Disinhibition with virtual partners. Interacting with computers 20, 3 (2008), 302--310.",
      "doi": ""
    },
    {
      "text": "Maartje MA de Graaf, Somaya Ben Allouch, and Jan AGM van Dijk. 2019. Why would I use this in my home? A model of domestic social robot acceptance. Human--Computer Interaction 34, 2 (2019), 115--173.",
      "doi": ""
    },
    {
      "text": "Sidney K D'Mello, Art Graesser, and Brandon King. 2010. Toward spoken human--computer tutorial dialogues. Human--Computer Interaction 25, 4 (2010), 289--323.",
      "doi": ""
    },
    {
      "text": "Alice H Eagly and Valerie J Steffen. 1986. Gender and aggressive behavior: a meta-analytic review of the social psychological literature. Psychological bulletin 100, 3 (1986), 309.",
      "doi": ""
    },
    {
      "text": "Susan Folkman. 1984. Personal control and stress and coping processes: A theoretical analysis. Journal of personality and social psychology 46, 4 (1984), 839.",
      "doi": ""
    },
    {
      "text": "Theresa M Glomb. 2002. Workplace anger and aggression: informing conceptual models with data from specific encounters. Journal of occupational health psychology 7, 1 (2002), 20.",
      "doi": ""
    },
    {
      "text": "Ruhama Goussinsky. 2012. Coping with customer aggression. Journal of Service Management 23, 2 (2012), 170--196.",
      "doi": ""
    },
    {
      "text": "Alicia A Grandey, David N Dickter, and Hock-Peng Sin. 2004. The customer is not always right: Customer aggression and emotion regulation of service employees. Journal of Organizational Behavior: The International Journal of Industrial, Occupational and Organizational Psychology and Behavior 25, 3 (2004), 397--418.",
      "doi": ""
    },
    {
      "text": "Alicia A Grandey, Julie H Kern, and Michael R Frone. 2007. Verbal abuse from outsiders versus insiders: Comparing frequency, impact on emotional exhaustion, and the role of emotional labor. Journal of occupational health psychology 12, 1 (2007), 63.",
      "doi": ""
    },
    {
      "text": "Harold G Grasmick and Robert J Bursik Jr. 1990. Conscience, significant others, and rational choice: Extending the deterrence model. Law and society review (1990), 837--861.",
      "doi": ""
    },
    {
      "text": "Harold G Grasmick, Robert J Bursik Jr, and Karyl A Kinsey. 1991. Shame and embarrassment as deterrents to noncompliance with the law: The case of an antilittering campaign. Environment and Behavior 23, 2 (1991), 233--251.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin and Richard Jacques. 2019. Chatbots, Humbots, and the Quest for Artificial General Intelligence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 209.",
      "doi": "10.1145/3290605.3300439"
    },
    {
      "text": "Annie Hogh and Andrea Dofradottir. 2001. Coping with bullying in the workplace. European journal of work and organizational psychology 10, 4 (2001), 485--495.",
      "doi": ""
    },
    {
      "text": "Tianran Hu, Anbang Xu, Zhe Liu, Quanzeng You, Yufan Guo, Vibha Sinha, Jiebo Luo, and Rama Akkiraju. 2018. Touch Your Heart: A Tone-aware Chatbot for Customer Care on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 415.",
      "doi": "10.1145/3173574.3173989"
    },
    {
      "text": "Dominic A Infante, Bruce L Riddle, Cary L Horvath, and Sherlyn-Ann Tumlin. 1992. Verbal aggressiveness: Messages and reasons. Communication Quarterly 40, 2 (1992), 116--126.",
      "doi": ""
    },
    {
      "text": "Carroll E Izard. 1993. The Differential Emotions Scale: DES IV-A;[a Method of Measuring the Meaning of Subjective Experience of Discrete Emotions]. University of Delaware.",
      "doi": ""
    },
    {
      "text": "Hanna L Jóhannsdóttir and Ragnar F Ólafsson. 2004. Coping with bullying in the workplace: the effect of gender, age and type of bullying. British Journal of Guidance & Counselling 32, 3 (2004), 319--333.",
      "doi": ""
    },
    {
      "text": "Eun-Ju Lee. 2010. The more human-like, the better? How speech type and users cognitive style affect social responses to computers. Computers in Human Behavior 26, 4 (2010), 665--672.",
      "doi": "10.1016/j.chb.2010.01.003"
    },
    {
      "text": "Jennifer Loh, Flora Calleja, and Simon Lloyd D Restubog. 2011. Words That Hurt: A Qualitative Study of s Parental Verbal Abuse in the Philippines. Journal of interpersonal violence 26, 11 (2011), 2244--2263.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286--5297.",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Shaista Malik, Susan B Sorenson, and Carol S Aneshensel. 1997. Community and dating violence among adolescents: Perpetration and victimization. Journal of adolescent health 21, 5 (1997), 291--302.",
      "doi": ""
    },
    {
      "text": "Nikolas Martelaro, Victoria C Nneji, Wendy Ju, and Pamela Hinds. 2016. Tell me more: Designing hri to encourage more trust, disclosure, and companionship. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction. IEEE Press, 181--188.",
      "doi": ""
    },
    {
      "text": "MM Martin and CM Anderson. 1996. Argumentativeness and verbal aggressiveness. Journal of Social Behavior and Personality 11, 3 (1996), 547.",
      "doi": ""
    },
    {
      "text": "Matthew M Martin and Carolyn M Anderson. 1995. Roommate similarity: Are roommates who are similar in their communication traits more satisfied? Communication Research Reports 12, 1 (1995), 46--52.",
      "doi": ""
    },
    {
      "text": "Matthew M Martin, Carolyn M Anderson, and Cary L Horvath. 1996. Feelings about verbal aggression: Justifications for sending and hurt from receiving verbally aggressive messages. Communication Research Reports 13, 1 (1996), 19--26.",
      "doi": ""
    },
    {
      "text": "Masahiro Mori, Karl F MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics & Automation Magazine 19, 2 (2012), 98--100.",
      "doi": ""
    },
    {
      "text": "Stephen O Murray. 1985. Toward a model of members' methods for recognizing interruptions. Language in Society 14, 1 (1985), 31--40.",
      "doi": ""
    },
    {
      "text": "Dina G Okamoto, Lisa Slattery Rashotte, and Lynn Smith-Lovin. 2002. Measuring interruption: Syntactic and contextual methods of coding conversation. Social Psychology Quarterly 65, 1 (2002), 38.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice interfaces in everyday life. In proceedings of the 2018 CHI conference on human factors in computing systems. ACM, 640.",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Helmut Prendinger and Mitsuru Ishizuka. 2005. The empathic companion: A character-based interface that addresses users' affective states. Applied Artificial Intelligence 19, 3--4 (2005), 267--285.",
      "doi": ""
    },
    {
      "text": "Amanda Purington, Jessie G Taft, Shruti Sannon, Natalya N Bazarova, and Samuel Hardman Taylor. 2017. Alexa is my new BFF: social roles, user satisfaction, and personification of the amazon echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2853--2859.",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Lingyun Qiu and Izak Benbasat. 2005. Online consumer trust and live help interfaces: The effects of text-to-speech voice and three-dimensional avatars. International journal of human-computer interaction 19, 1 (2005), 75--94.",
      "doi": ""
    },
    {
      "text": "Byron Reeves and Clifford Ivar Nass. 1996. The media equation: How people treat computers, television, and new media like real people and places. Cambridge university press.",
      "doi": "10.5555/236605"
    },
    {
      "text": "JRSJ Riebel, Reinhold S Jäger, and Uwe C Fischer. 2009. Cyberbullying in Germany--an exploration of prevalence, overlapping with real life bullying and coping strategies. Psychology Science Quarterly 51, 3 (2009), 298--314.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks, Emanuel A Schegloff, and Gail Jefferson. 1978. A simplest systematics for the organization of turn taking for conversation. In Studies in the organization of conversational interaction. Elsevier, 7--55.",
      "doi": ""
    },
    {
      "text": "Michael F Schober, Frederick G Conrad, Christopher Antoun, Patrick Ehlen, Stefanie Fail, Andrew L Hupp, Michael Johnston, Lucas Vickers, H Yanna Yan, and Chan Zhang. 2015. Precision and disclosure in text and voice interviews on smartphones. PloS one 10, 6 (2015), e0128337.",
      "doi": ""
    },
    {
      "text": "GR Semin and Monica Rubini. 1990. Unfolding the concept of person by verbal abuse. European Journal of Social Psychology 20, 6 (1990), 463--474.",
      "doi": ""
    },
    {
      "text": "Ellen A Skinner, Kathleen Edge, Jeffrey Altman, and Hayley Sherwood. 2003. Searching for the structure of coping: a review and critique of category systems for classifying ways of coping. Psychological bulletin 129, 2 (2003), 216.",
      "doi": ""
    },
    {
      "text": "R Nathan Spreng*, Margaret C McKinnon*, Raymond A Mar, and Brian Levine. 2009. The Toronto Empathy Questionnaire: Scale development and initial validation of a factor-analytic solution to multiple empathy measures. Journal of personality assessment 91, 1 (2009), 62--71.",
      "doi": ""
    },
    {
      "text": "Teresa Elizabeth Stone, Margaret McMillan, and Mike Hazelton. 2015. Back to swear one: A review of English language literature on swearing and cursing in Western health settings. Aggression and violent behavior 25 (2015), 65--74.",
      "doi": ""
    },
    {
      "text": "Jeffrey Stuewig and June Price Tangney. 2007. Shame and guilt in antisocial and risky behaviors. The self-conscious emotions: Theory and research (2007), 371--388.",
      "doi": ""
    },
    {
      "text": "Xiang Zhi Tan, Marynel Vázquez, Elizabeth J Carter, Cecilia G Morales, and Aaron Steinfeld. 2018. Inducing bystander interventions during robot abuse with social mechanisms. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 169--177.",
      "doi": "10.1145/3171221.3171247"
    },
    {
      "text": "June Price Tangney, Jeffrey Stuewig, and Debra J Mashek. 2007. What's moral about the self-conscious emotions. The self-conscious emotions: Theory and research (2007), 21--37.",
      "doi": ""
    },
    {
      "text": "June P Tangney, Patricia Wagner, Carey Fletcher, and Richard Gramzow. 1992. Shamed into anger? The relation of shame and guilt to anger and self-reported aggression. Journal of personality and social psychology 62, 4 (1992), 669.",
      "doi": ""
    },
    {
      "text": "June Price Tangney, Patricia E Wagner, Deborah Hill-Barlow, Donna E Marschall, and Richard Gramzow. 1996. Relation of shame and guilt to constructive versus destructive responses to anger across the lifespan. Journal of personality and social psychology 70, 4 (1996), 797.",
      "doi": ""
    },
    {
      "text": "Bennett J Tepper. 2007. Abusive supervision in work organizations: Review, synthesis, and research agenda. Journal of management 33, 3 (2007), 261--289.",
      "doi": ""
    },
    {
      "text": "Mike Thelwall. 2008. Fk yea I swear: cursing and gender in MySpace. Corpora 3, 1 (2008), 83--107.",
      "doi": ""
    },
    {
      "text": "Stephen G Tibbetts. 2003. Self-conscious emotions and criminal offending. Psychological reports 93, 1 (2003), 101--126.",
      "doi": ""
    },
    {
      "text": "Philip E Varca. 2004. Service skills for service workers: emotional intelligence and beyond. Managing Service Quality: An International Journal 14, 6 (2004), 457--467.",
      "doi": ""
    },
    {
      "text": "George Veletsianos, Cassandra Scharber, and Aaron Doering. 2008. When sex, drugs, and violence enter the classroom: Conversations between adolescents and a female pedagogical agent. Interacting with computers 20, 3 (2008), 292--301.",
      "doi": ""
    },
    {
      "text": "Adam Waytz, Joy Heafner, and Nicholas Epley. 2014. The mind in the machine: Anthropomorphism increases trust in an autonomous vehicle. Journal of Experimental Social Psychology 52 (2014), 113--117.",
      "doi": ""
    },
    {
      "text": "Blay Whitby. 2008. Sometimes it's hard to be a robot: A call for action on the ethics of abusing artificial agents. Interacting with Computers 20, 3 (2008), 326--333.",
      "doi": "10.1016/j.intcom.2008.02.002"
    },
    {
      "text": "Kun Xu and Matthew Lombard. 2017. Persuasive computing: Feeling peer pressure from multiple computer agents. Computers in Human Behavior 74 (2017), 152--162.",
      "doi": ""
    }
  ]
}