{
  "doi": "10.1145/3313831.3376425",
  "title": "Jubilee: An Extensible Machine for Multi-tool Fabrication",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "We present Jubilee, an open-source hardware machine with automatic tool-changing and interchangeable bed plates. As digital fabrication tools have become more broadly accessible, tailoring those machines to new users and novel workflows has become central to HCI research. However, the lack of hardware infrastructure makes custom application development cumbersome. We identify a need for an extensible platform to allow HCI researchers to develop workflows for fabrication, material exploration, and other applications. Jubilee addresses this need. It can automatically and repeatably change tools in the same operation. It can be built with a combination of simple 3D-printed and readily available parts. It has several standard head designs for a variety of applications including 3D printing, syringe-based liquid handling, imaging, and plotting. We present Jubilee with a comprehensive set of assembly instructions and kinematic mount templates for user-designed tools and bed plates. Finally we demonstrate Jubilee's multi-tool workflow functionality with a series of example applications.",
  "tags": [
    "toolchanging",
    "digital fabrication",
    "multi-tool workflows"
  ],
  "authors": [
    {
      "name": "Joshua Vasquez",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527353",
      "orcid": "missing"
    },
    {
      "name": "Hannah Twigg-Smith",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659526693/rel-imgonly/_dsc3769.jpg",
      "acmid": "99659526693",
      "orcid": "missing"
    },
    {
      "name": "Jasper Tran O'Leary",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659035156/rel-imgonly/so_emotion.jpg",
      "acmid": "99659035156",
      "orcid": "0000-0003-3882-3144"
    },
    {
      "name": "Nadya Peek",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384605843",
      "orcid": "0000-0001-9405-0399"
    }
  ],
  "references": [
    {
      "text": "ATI. 2019. ATI Industrial Automation: Automatic/Robotic Tool Changers. (2019). https://www.ati-ia.com/products/toolchanger/robot_tool_changer.aspx",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Cindy Lin, Silvia Lindtner, and Austin Toombs. 2017. HCI's Making Agendas. Foundations and Trends in Human--Computer Interaction 11, 3 (Dec. 2017), 126--200. DOI: http://dx.doi.org/10.1561/1100000066",
      "doi": "10.1561/1100000066"
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal fabrication. Foundations and Trends in Human--Computer Interaction 10, 3--4 (2017), 165--293.",
      "doi": ""
    },
    {
      "text": "D.L. Blanding. 1999. Exact Constraint: Machine Design Using Kinematic Principles. ASME Press. https://books.google.com/books?id=DtxSAAAAMAAJ",
      "doi": ""
    },
    {
      "text": "Brett G Compton and Jennifer A Lewis. 2014. 3D-printing of lightweight cellular composites. Advanced materials 26, 34 (2014), 5930--5935.",
      "doi": ""
    },
    {
      "text": "Datron. 2019. CNC Tool Changer | Datron. (2019). https://www.datron.com/cnc-machine-products/ tool-changers.php",
      "doi": ""
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2477--2486. DOI: http://dx.doi.org/10.1145/2702123.2702547",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "Duet3D. 2019. Duet Controller Hardware. (2019). https://www.duet3d.com/ accessed 2019-09--17.",
      "doi": ""
    },
    {
      "text": "M. Eisenberg. 2007. Pervasive Fabrication: Making Construction Ubiquitous in Education. In Fifth Annual IEEE International Conference on Pervasive Computing and Communications Workshops (PerComW'07). 193--198. DOI: http://dx.doi.org/10.1109/PERCOMW.2007.93",
      "doi": ""
    },
    {
      "text": "Frikk Fossdal, Jens Dyvik, Jakob Nilsson, Jon Nordby, Torbjorn Nordvik Helgesen, Rogardt Heldal, and Nadya Peek. 2020. Popfab: A Case for Portable Digital Fabrication. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '20). ACM, NY, NY, USA.",
      "doi": ""
    },
    {
      "text": "Wei Gao, Yunbo Zhang, Diogo C. Nazzetta, Karthik Ramani, and Raymond J. Cipra. 2015. RevoMaker: Enabling Multi-directional and Functionally-embedded 3D Printing Using a Rotational Cuboidal Platform. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 437--446. DOI: http://dx.doi.org/10.1145/2807442.2807476",
      "doi": ""
    },
    {
      "text": "N. Gershenfeld. 2005. Fab: The Coming Revolution on Your Desktop--from Personal Computers to Personal Fabrication. Basic Books.",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Gilad Gome, Julian Waksberg, Andrey Grishko, Iddo Yehoshua Wald, and Oren Zuckerman. 2019. OpenLH: Open Liquid-Handling System for Creative Experimentation with Biology. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). ACM, NY, NY, USA, 55--64. DOI: http://dx.doi.org/10.1145/3294109.3295619",
      "doi": "10.1145/3294109.3295619"
    },
    {
      "text": "Bagrat Grigoryan, Samantha J. Paulsen, Daniel C. Corbett, Daniel W. Sazer, Chelsea L. Fortin, Alexander J. Zaita, Paul T. Greenfield, Nicholas J. Calafat, John P. Gounley, Anderson H. Ta, Fredrik Johansson, Amanda Randles, Jessica E. Rosenkrantz, Jesse D. Louis-Rosenberg, Peter A. Galie, Kelly R. Stevens, and Jordan S. Miller. 2019. Multivascular networks and functional intravascular topologies within biocompatible hydrogels. Science 364, 6439 (2019), 458--464. DOI: http://dx.doi.org/10.1126/science.aav9750",
      "doi": ""
    },
    {
      "text": "Haas. 2019. Inside the Haas Side-Mount Tool Changer. (2019). https://www.haascnc.com/productivity/tool-changer.html",
      "doi": ""
    },
    {
      "text": "E.K. Henriksen. 1973. Jig and Fixture Design Manual. Industrial Press. https://books.google.com/books?id=OX9hspFzRAsC",
      "doi": ""
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, and Parmit K. Chilana. 2016. Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 384--396. DOI: http://dx.doi.org/10.1145/2858036.2858266",
      "doi": ""
    },
    {
      "text": "Scott E. Hudson. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, Toronto, Ontario, Canada, 459--468. DOI: http://dx.doi.org/10.1145/2556288.2557338",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 529--539.",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Jennifer Jacobs and Amit Zoran. 2015. Hybrid Practice in the Kalahari: Design Collaboration through Digital Tools and Hunter-Gatherer Craft. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 619--628.",
      "doi": "10.1145/2702123.2702362"
    },
    {
      "text": "S. Kalpakjian and S.R. Schmid. 2008. Manufacturing Processes for Engineering Materials. Pearson Education. https://books.google.com/books?id=WDcfAQAAIAAJ",
      "doi": ""
    },
    {
      "text": "E3D-Online Ltd. 2019. E3D Toolchanging System. (2019). https://e3d-online.com/tool-changer-join-the-queue accessed 2019-09--19.",
      "doi": ""
    },
    {
      "text": "E3D-Online Ltd. 2019. e3donline/ToolChanger. (Sept. 2019). https://github.com/e3donline/ToolChanger original-date: 2019-06--19T08:52:20Z.",
      "doi": ""
    },
    {
      "text": "Makerbot. 2019. Makerbot Replicator 2X User Manual. (2019). http://downloads.makerbot.com/replicator2x/ MakerBot_Replicator_2X_User_Manual.pdf accessed 2019-09--19.",
      "doi": ""
    },
    {
      "text": "David Mellis, Sean Follmer, Björn Hartmann, Leah Buechley, and Mark D. Gross. 2013. FAB at CHI: Digital Fabrication Tools, Design, and Community. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 3307--3310. DOI: http://dx.doi.org/10.1145/2468356.2479673",
      "doi": ""
    },
    {
      "text": "Ilan Moyer. 2012. Core XY. http://corexy.com/. (2012). accessed 2019-08-09.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014a. WirePrint: 3D Printed Previews for Fast Prototyping. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 273--280. DOI: http://dx.doi.org/10.1145/2642918.2647359",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014b. faBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3827--3834. DOI: http://dx.doi.org/10.1145/2556288.2557005",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Nadya Peek and Ilan Moyer. 2017. Popfab: A Case for Portable Digital Fabrication. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, NY, NY, USA, 325--329. DOI: http://dx.doi.org/10.1145/3024969.3025009",
      "doi": "10.1145/3024969.3025009"
    },
    {
      "text": "Huaishu Peng, François Guimbretière, James McCann, and Scott Hudson. 2016. A 3D Printer for Interactive Electromagnetic Devices. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). Association for Computing Machinery, New York, NY, USA, 553--562. DOI: http://dx.doi.org/10.1145/2984511.2984523",
      "doi": "10.1145/2984511.2984523"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1789--1798. DOI: http://dx.doi.org/10.1145/2702123.2702327",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Huaishu Peng, Rundong Wu, Steve Marschner, and François Guimbretière. 2016. On-The-Fly Print: Incremental Printing While Modelling. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 887--896. DOI: http://dx.doi.org/10.1145/2858036.2858106",
      "doi": "10.1145/2858036.2858106"
    },
    {
      "text": "Gill A Pratt and Matthew M Williamson. 1995. Series elastic actuators. In Proceedings 1995 IEEE/RSJ International Conference on Intelligent Robots and Systems. Human Robot Interaction and Cooperative Robots, Vol. 1. IEEE, 399--406.",
      "doi": ""
    },
    {
      "text": "Isabel P. S. Qamar, Rainer Groh, David Holman, and Anne Roudaut. 2018. HCI Meets Material Science: A Literature Review of Morphing Materials for the Design of Shape-Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 374, 23 pages. DOI: http://dx.doi.org/10.1145/3173574.3173948",
      "doi": "10.1145/3173574.3173948"
    },
    {
      "text": "Andrew Quitmeyer and Hannah Perner-Wilson. 2015. Wearable studio practice: design considerations for digital crafting in harsh environments. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers. ACM, 1285--1293.",
      "doi": "10.1145/2800835.2807926"
    },
    {
      "text": "Prusa Research. 2019. Original Prusa i3 MK2.5S/MK3S Multi Material 2S upgrade kit (MMU2S). (2019). https://tinyurl.com/y64cf5m5 accessed 2019-09--19.",
      "doi": ""
    },
    {
      "text": "Michael L. Rivera and Scott E. Hudson. 2019. Desktop Electrospinning: A Single Extruder 3D Printer for Producing Rigid Plastic and Electrospun Textiles. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 204, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300434",
      "doi": ""
    },
    {
      "text": "Alec Rivers, Ilan E. Moyer, and Frédo Durand. 2012. Position-correcting Tools for 2D Digital Fabrication. ACM Trans. Graph. 31, 4, Article 88 (July 2012), 7 pages. DOI: http://dx.doi.org/10.1145/2185520.2185584",
      "doi": "10.1145/2185520.2185584"
    },
    {
      "text": "Peng Song, Bailin Deng, Ziqi Wang, Zhichao Dong, Wei Li, Chi-Wing Fu, and Ligang Liu. 2016. CofiFab: Coarse-to-fine Fabrication of Large 3D Objects. ACM Trans. Graph. 35, 4, Article 45 (July 2016), 11 pages. DOI: http://dx.doi.org/10.1145/2897824.2925876",
      "doi": "10.1145/2897824.2925876"
    },
    {
      "text": "Ke Sun, Teng-Sing Wei, Bok Yeop Ahn, Jung Yoon Seo, Shen J Dillon, and Jennifer A Lewis. 2013. 3D printing of interdigitated Li-Ion microbattery architectures. Advanced materials 25, 33 (2013), 4539--4543.",
      "doi": ""
    },
    {
      "text": "Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 83--91. DOI: http://dx.doi.org/10.1145/2807442.2807467",
      "doi": "10.1145/2807442.2807467"
    },
    {
      "text": "Rundong Tian, Sarah Sterman, Ethan Chiou, Jeremy Warner, and Eric Paulos. 2018. MatchSticks: Woodworking Through Improvisational Digital Fabrication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 149, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173723",
      "doi": "10.1145/3173574.3173723"
    },
    {
      "text": "Skylar Tibbits. 2014. 4D printing: multi-material shape change. Architectural Design 84, 1 (2014), 116--121.",
      "doi": ""
    },
    {
      "text": "Ultimaker. 2019. Ultimaker 3 Specifications. (2019). https://ultimaker.com/3d-printers/ultimaker-3 accessed 2019-09--19.",
      "doi": ""
    },
    {
      "text": "Udayan Umapathi, Hsiang-Ting Chen, Stefanie Mueller, Ludwig Wall, Anna Seufert, and Patrick Baudisch. 2015. LaserStacker: Fabricating 3D Objects by Laser Cutting and Welding. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 575--582. DOI: http://dx.doi.org/10.1145/2807442.2807512",
      "doi": "10.1145/2807442.2807512"
    },
    {
      "text": "S Brett Walker and Jennifer A Lewis. 2012. Reactive silver inks for patterning high-conductivity features at mild temperatures. Journal of the American Chemical Society 134, 3 (2012), 1419--1421.",
      "doi": ""
    },
    {
      "text": "Guanyun Wang, Lining Yao, Wen Wang, Jifei Ou, Chin-Yi Cheng, and Hiroshi Ishii. 2016. xPrint: A Modularized Liquid Printer for Smart Materials Deposition. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5743--5752. DOI: http://dx.doi.org/10.1145/2858036.2858281",
      "doi": "10.1145/2858036.2858281"
    },
    {
      "text": "Wen Wang, Lining Yao, Teng Zhang, Chin-Yi Cheng, Daniel Levine, and Hiroshi Ishii. 2017. Transformative Appetite: Shape-Changing Food Transforms from 2D to 3D by Water Interaction Through Cooking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6123--6132. DOI: http://dx.doi.org/10.1145/3025453.3026019",
      "doi": "10.1145/3025453.3026019"
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2011. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, NY, NY, USA, 69--72. DOI: http://dx.doi.org/10.1145/1935701.1935716",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "C. Wu, C. Dai, G. Fang, Y. Liu, and C. C. L. Wang. 2017. RoboFDM: A robotic system for support-free fabrication using FDM. In 2017 IEEE International Conference on Robotics and Automation (ICRA). 1175--1180. DOI: http://dx.doi.org/10.1109/ICRA.2017.7989140",
      "doi": ""
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 13--22. DOI: http://dx.doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Amit Zoran and Joseph A. Paradiso. 2013. FreeD: A Freehand Digital Sculpting Tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2613--2616. DOI: http://dx.doi.org/10.1145/2470654.2481361",
      "doi": "10.1145/2470654.2481361"
    }
  ]
}