{
  "doi": "10.1145/3313831.3376580",
  "title": "Considerations for Implementing Technology to Support Community Radio in Rural Communities",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Rural communities often lack platforms to support civic engagement and local deliberation. Community radio is intended to facilitate such functions, yet, radio technologies can be expensive and complex to use. To tackle this challenge, low-barrier radio technologies are becoming available. We argue that technology to support civic engagement and local deliberation are important, and design of such platforms must take into consideration specific community needs. We contribute by exploring the needs of three rural European communities. Findings indicate that communities are now distributed beyond place. Platforms for deliberation must include both hyper-local and geographically dispersed populations. Rural values of accountability, reliability and maintaining social harmony are important design considerations. Community radio platforms should support geographically distributed community connections, sharing of health and emergency information, preservation of heritage and as a space for advocacy and civic action.",
  "authors": [
    {
      "name": "Laura Maye",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/do/10.1145/contrib-99658640802/rel-imgonly/dsc_1255-1.jpg",
      "acmid": "99658640802",
      "orcid": "missing"
    },
    {
      "name": "Sarah Robinson",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433050",
      "orcid": "missing"
    },
    {
      "name": "Nadia Pantidi",
      "institution": "University College Cork & Victoria University of Wellington, Wellington, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418594586",
      "orcid": "missing"
    },
    {
      "name": "Liana Ganea",
      "institution": "ActiveWatch, Bucharest, Romania",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526956",
      "orcid": "missing"
    },
    {
      "name": "Oana Ganea",
      "institution": "ActiveWatch, Bucharest, Romania",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527154",
      "orcid": "missing"
    },
    {
      "name": "Conor Linehan",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440592407",
      "orcid": "missing"
    },
    {
      "name": "John McCarthy",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406600199",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benedict Anderson. 2006. Imagined communities: Reflections on the origin and spread of nationalism. Verso books.",
      "doi": ""
    },
    {
      "text": "E. W. R. Barlow. 2008. Community Radio in the US: The Struggle for a Democratic Medium. In Radio: Critical Concepts in Media and Cultural Studies, Vol. III. 43.",
      "doi": ""
    },
    {
      "text": "Bettina B. Bock. 2016. Rural marginalisation and the role of social innovation; a turn towards nexogenous development and rural reconnection. Sociologia Ruralis 56, 4 (2016), 552--573.",
      "doi": ""
    },
    {
      "text": "Virginia Braun, Victoria Clarke, and Gareth Terry. 2014. Thematic analysis. Qual Res Clin Health Psychol 24 (2014), 95--114.",
      "doi": ""
    },
    {
      "text": "Manuel Castells. 2011. The rise of the network society. Vol. 12. John Wiley & Sons.",
      "doi": "10.5555/518096"
    },
    {
      "text": "Alan Chamberlain and Andy Crabtree. 2013. Innovation in the wild: ethnography, rurality and participation. In The 3rd Participatory Innovation Conference, PIN-C. Lappeenranta University of Technology.",
      "doi": ""
    },
    {
      "text": "Roberto Cibin, Maurizio Teli, and Sarah Robinson. 2019. Institutioning and Community Radio. A Comparative Perspective. In Proceedings of the 9th International Conference on Communities & Technologies - Transforming Communities (C&T '19). ACM, NY, NY, USA, 143--154. http://dx.doi.org/10.1145/3328320.3328392",
      "doi": "10.1145/3328320.3328392"
    },
    {
      "text": "Rachel Clarke, Clara Crivellaro, Danilo Di Mascio, and Peter Wright. 2016. Re-configuring participatory media for citizen elders in urban planning. In Proceedings of the 3rd Conference on Media Architecture Biennale. ACM, 12.",
      "doi": "10.1145/2946803.2946815"
    },
    {
      "text": "Rute Correia, Jorge Vieira, and Manuela Aparicio. 2019. Community radio stations sustainability model: An open-source solution. Radio Journal: International Studies in Broadcast & Audio Media 17, 1 (2019), 29-- 45.",
      "doi": ""
    },
    {
      "text": "Chris Csikkszentmihàlyi and Jude Mukundane. 2016. RootIO: ICT + telephony for grassroots radio. In 2016 IST-Africa Week Conference. 1--13. http://dx.doi.org/10.1109/ISTAFRICA.2016.7530700",
      "doi": ""
    },
    {
      "text": "Rosemary Day. 2009. Community radio in Ireland: Participation and multiflows of communication. Hampton Press.",
      "doi": ""
    },
    {
      "text": "Jan Drijvers. 1992. Community broadcasting: a manifesto for the media policy of small European countries. Media, Culture and Society 14, 2 (1992), 193--201.",
      "doi": ""
    },
    {
      "text": "Christina Dunbar-Hester. 2014. Low Power to the People: Pirates, Protest, and Politics in FM Radio Activism. MIT Press.",
      "doi": ""
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 404.",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "Niamh Gaynor and Anne O'Brien. 2017. Community radio, democratic participation and the public sphere. Irish Journal of Sociology 25, 1 (2017), 29--47.",
      "doi": ""
    },
    {
      "text": "Joost Gieling, Lotte Vermeij, and Tialda Haartsen. 2017. Beyond the local-newcomer divide: Village attachment in the era of mobilities. Journal of Rural Studies 55 (Oct.2017), 237--247. http://dx.doi.org/10.1016/j.jrurstud.2017.08.015",
      "doi": ""
    },
    {
      "text": "Eric Gilbert, Karrie Karahalios, and Christian Sandvig. 2008. The network in the garden: an empirical analysis of social media in rural life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1603--1612.",
      "doi": "10.1145/1357054.1357304"
    },
    {
      "text": "Peter Gill. 1994. Island psyche: Fieldnotes from an Irish island. The Irish Journal of Psychology 15, 2--3 (1994), 276--287.",
      "doi": ""
    },
    {
      "text": "Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, civic engagement & trust. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2833-- 2842. https://doi.org/10.1145/2702123.2702255",
      "doi": "10.1145/2702123.2702255"
    },
    {
      "text": "Jean Hardy. 2019. How the Design of Social Technology Fails Rural America. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion. ACM, 189--193. https://doi.org/10.1145/3301019.3323906",
      "doi": ""
    },
    {
      "text": "Jean Hardy and Silvia Lindtner. 2017. Constructing a desiring user: Discourse, rurality, and design in location-based social networks. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 13-- 25. https://doi.org/10.1145/2998181.2998347",
      "doi": "10.1145/2998181.2998347"
    },
    {
      "text": "Jean Hardy, Chanda Phelan, Morgan Vigil-Hayes, Norman Makoto Su, Susan Wyche, and Phoebe Sengers. 2019. Designing from the Rural. Interactions 26, 4 (June 2019), 37--41. http://dx.doi.org/10.1145/3328487",
      "doi": "10.1145/3328487"
    },
    {
      "text": "Gregory N. Hearn, Jo A. Tacchi, Marcus Foth, and June Lennie. 2009. Action research and new media: Concepts, methods and cases. Hampton Press.",
      "doi": ""
    },
    {
      "text": "Nick Jankowski, Ole Prehn, and J. G. Stappers. 1992. The people's voice: Local radio and television in Europe. Vol. 6. J. Libbey.",
      "doi": ""
    },
    {
      "text": "Per Jauert. 1997. Local Radio in Western Europe Conflicts Between the Cultures of Center and Periphery. The Nordic Review 2, 1 (1997), 93--106.",
      "doi": ""
    },
    {
      "text": "Marcel Machill. 1996. The French Radio Landscape: The Impact of Radio Policy in an Area Defined by the Antagonistic Forces of Commercialization and Cultural Protection. European Journal of Communication 11, 3 (Sept. 1996), 393--415. http://dx.doi.org/10.1177/0267323196011003006",
      "doi": ""
    },
    {
      "text": "Linje Manyozo. 2005. Rural radio and the promotion of people-centred development in Africa: Radio listening clubs and community development in Malawi. A paper presented at the Codesria 11 General Assembly. Retrieved May 5, 2009.",
      "doi": ""
    },
    {
      "text": "Linje Manyozo. 2009. Mobilizing rural and community radio in Africa. Ecquid novi 30, 1 (2009), 1--23.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2017. Commentary: Making interactivity meaningful for contemporary HCI. Human-Computer Interaction 32, 3 (2017), 148-- 152.",
      "doi": "10.1080/07370024.2016.1254048"
    },
    {
      "text": "Blythe McKay. 2009. Using community radio in Ghana to facilitate community participation in natural resource management. ECQUID NOVI 30, 1 (2009), 73--93.",
      "doi": ""
    },
    {
      "text": "Eronini R. Megwa. 2007. Bridging the digital divide: Community radio's potential for extending information and communication technology benefits to poor rural communities in South Africa. The Howard Journal of Communications 18, 4 (2007), 335--352.",
      "doi": ""
    },
    {
      "text": "Aparna Moitra, Vishnupriya Das, Gram Vaani, Archna Kumar, and Aaditeshwar Seth. 2016. Design Lessons from Creating a Mobile-based Community Media Platform in Rural India. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD '16). ACM, New York, USA, 14:1--14:11. http://dx.doi.org/10.1145/2909609.2909670",
      "doi": "10.1145/2909609.2909670"
    },
    {
      "text": "Mary Myers. 2008. Radio and development in Africa: A concept paper. Technical Report. https://idl-bncidrc.dspacedirect.org/bitstream/handle/10625/41180/129100.pdf'sequence=1",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Annette Adler, Mizuko Ito, and Vicki L. O'Day. 1997. Design for network communities. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 210--217.",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Vicki L. O'Day, Annette Adler, and Mizuko Ito. 1998. Network Communities: Something Old, Something New, Something Borrowed... Computer Supported Cooperative Work 7 (1998), 123--156. https://link.springer.com/article/10.1023/A:100868820",
      "doi": "10.1023/A%3A1008688205872"
    },
    {
      "text": "Anthony A. Olorunnisola. 2009. Media and communications industries in Nigeria: Impacts of neoliberal reforms between 1999 and 2007. Edwin Mellen Press.",
      "doi": ""
    },
    {
      "text": "Daniel Pargman, Elina Eriksson, Mattias Höjer, Ulrika Gunnarsson Östling, and Luciane Aguiar Borges. 2017. The (un) sustainability of imagined future information societies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 773-- 785. https://doi.org/10.1145/3025453.3025858",
      "doi": "10.1145/3025453.3025858"
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S. Parikh. 2010. Avaaj otalo: a field study of an interactive voice forum for small farmers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, USA, 733--742. https://doi.org/10.1145/1753326.1753434",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2013. Building the Future with Envisioning. Interactions January + February, 26.",
      "doi": ""
    },
    {
      "text": "Tom A. Rodden, Joel E. Fischer, Nadia Pantidi, Khaled Bachour, and Stuart Moran. 2013. At Home with Agents: Exploring Attitudes Towards Future Smart Energy Infrastructures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, USA, 1173--1182. http://dx.doi.org/10.1145/2470654.2466152",
      "doi": "10.1145/2470654.2466152"
    },
    {
      "text": "RootIO. 2019. RootIO Radio -- a technology platorm for low cost, hyperlocal community radio stations. http://rootio.org",
      "doi": ""
    },
    {
      "text": "Koen Salemink, Dirk Strijker, and Gary Bosworth. 2017. Rural development in the digital age: A systematic literature review on unequal ICT availability, adoption and use in rural areas. Journal of Rural Studies 54 (Aug. 2017), 360--371. http://dx.doi.org/10.1016/j.jrurstud.2015.09.001",
      "doi": ""
    },
    {
      "text": "Sally. 2013. The Community Radio Charter for Europe. (May 2013). http://www.amarceurope.eu/thecommunity-radio-charter-for-europe/",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers. 2011. What I learned on Change Islands: reflections on IT and pace of life. Interactions 18, 2 (2011), 40--48.",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "Sally Shortall. 2008. Are rural development programmes socially inclusive? Social inclusion, civic engagement, participation, and social capital: Exploring the differences. Journal of Rural Studies 24, 4 (2008), 450--457.",
      "doi": ""
    },
    {
      "text": "Michael J. Stern and Alison E. Adams. 2010. Do Rural Residents Really Use the Internet to Build Social Capital? An Empirical Investigation. American Behavioral Scientist 53, 9 (May 2010), 1389--1422. http://dx.doi.org/10.1177/0002764210361692",
      "doi": ""
    },
    {
      "text": "Reem Talhouk, Tom Bartindale, Kyle Montague, Sandra Mesmar, Chaza Akik, A. Ghassani, M. Najem, H. Ghattas, Patrick Olivier, and Madeline Balaam. 2017. Implications of synchronous IVR radio on Syrian refugee health and community dynamics. In Proceedings of the 8th International Conference on Communities and Technologies. ACM, 193--202.",
      "doi": "10.1145/3083671.3083690"
    },
    {
      "text": "Joshua Tanenbaum, Karen Tanenbaum, and Ron Wakkary. 2012. Design Fictions. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, New York, USA, 347--350. http://dx.doi.org/10.1145/2148131.2148214",
      "doi": ""
    },
    {
      "text": "Transparency. 2016. Corruption Perceptions Index 2016 - Transparency International. (2016). https://www.transparency.org/news/feature/corruption_ perceptions_index_2016.",
      "doi": ""
    },
    {
      "text": "Catharina Cornelia Maria Van Vuuren. 2004. Community participation in Australian Community Broadcasting: A comparative study of rural, regional and remote radio. Griffith University.",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2016. When a product is still fictional: anticipating and speculating futures through concept videos. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 121--133. https://doi.org/10.1145/2901790.2901801",
      "doi": ""
    }
  ]
}