{
  "doi": "10.1145/3313831.3376875",
  "title": "Automated Class Discovery and One-Shot Interactions for Acoustic Activity Recognition",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Acoustic activity recognition has emerged as a foundational element for imbuing devices with context-driven capabilities, enabling richer, more assistive, and more accommodating computational experiences. Traditional approaches rely either on custom models trained in situ, or general models pre-trained on preexisting data, with each approach having accuracy and user burden implications. We present Listen Learner, a technique for activity recognition that gradually learns events specific to a deployed environment while minimizing user burden. Specifically, we built an end-to-end system for self-supervised learning of events labelled through one-shot interaction. We describe and quantify system performance 1) on preexisting audio datasets, 2) on real-world datasets we collected, and 3) through user studies which uncovered system behaviors suitable for this new type of interaction. Our results show that our system can accurately and automatically learn acoustic events across environments (e.g., 97% precision, 87% recall), while adhering to users' preferences for non-intrusive interactive behavior.",
  "authors": [
    {
      "name": "Jason Wu",
      "institution": "Carnegie Mellon University & Apple Inc., Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659524635",
      "orcid": "0000-0001-5101-0557"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Apple Inc. & Carnegie Mellon University, Cupertino, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Gierad Laput",
      "institution": "Apple Inc. & Carnegie Mellon University, Cupertino, CA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd, Anind K. Dey, Peter J. Brown, Nigel Davies, Mark Smith, and Pete Steggles. 1999. Towards a Better Understanding of Context and ContextAwareness. In Proceedings of the 1st international symposium on Handheld and Ubiquitous Computing (HUC '99), Hans-Werner Gellersen (Ed.). Springer-Verlag, London, UK, UK, 304--307.",
      "doi": "10.5555/647985.743843"
    },
    {
      "text": "Fadel Adib, Hongzi Mao, Zachary Kabelac, Dina Katabi, and Robert C. Miller. 2015. Smart Homes that Monitor Breathing and Heart Rate. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 837--846. DOI: https://doi.org/10.1145/2702123.2702200",
      "doi": ""
    },
    {
      "text": "Mohammad Arif Ul Alam and Nirmalya Roy. 2017. Unseen Activity Recognitions: A Hierarchical Active Transfer Learning Approach. In Proceedings of 2017 IEEE 37th International Conference on Distributed Computing Systems (ICDCS). IEEE, 436--446.",
      "doi": ""
    },
    {
      "text": "Amazon.com, Inc. Echo Show. https://www.amazon.com/Echo-Show/, Retrieved on April 4, 2019.",
      "doi": ""
    },
    {
      "text": "Apple, Inc. Homepod. .https://www.apple.com/homepod/, Retrieved on April 4, 2019.",
      "doi": ""
    },
    {
      "text": "Sheheryar Arshad, Chunhai Feng, Yonghe Liu, Yupeng Hu, Ruiyun Yu, Siwang Zhou, and Heng Li. 2017. Wichase: A wifi based human activity recognition system for sensorless environments. In 2017 IEEE 18th International Symposium on A World of Wireless, Mobile and Multimedia Networks (WoWMoM '17). IEEE, 1--6",
      "doi": ""
    },
    {
      "text": "Daniel Avrahami, Mitesh Patel, Yusuke Yamaura, and Sven Kratz. 2018. Below the Surface: Unobtrusive Activity Recognition for Work Surfaces using RF-radar sensing. In 23rd International Conference on Intelligent User Interfaces (IUI '18). ACM, New York, NY, USA, 439--451. DOI: https://doi.org/10.1145/3172944.3172962",
      "doi": "10.1145/3172944.3172962"
    },
    {
      "text": "Yusuf Aytar, Carl Vondrick, and Antonio Torralba. 2016. Soundnet: Learning sound representations from unlabeled video. Advances in neural information processing systems (NIPS). 892--900.",
      "doi": ""
    },
    {
      "text": "Tadas Baltrusaitis, Chaitanya Ahuja, and LouisPhilippe Morency. 2019. Multimodal Machine Learning: A Survey and Taxonomy. IEEE Transactions on Pattern Analysis and Machine Intelligence 41, 2. IEEE, 423--443.",
      "doi": "10.1109/TPAMI.2018.2798607"
    },
    {
      "text": "Ling Bao and Stephen S. Intille. 2004. Activity recognition from user-annotated acceleration data. In Proceedings of Pervasive. 1--17.",
      "doi": ""
    },
    {
      "text": "Laurent Benaroya, Frederic Bimbot, and Remi Gribonval. 2005. Audio source separation with a single sensor. IEEE Transactions on Audio, Speech, and Language Processing 14, 1. IEEE, 191--199.",
      "doi": ""
    },
    {
      "text": "Yoshua Bengio, Ian J Goodfellow, and Aaron Courville. 2015. Deep Learning. Nature 521, 7553. Citeseer, 436--444.",
      "doi": ""
    },
    {
      "text": "Avrim Blum and Tom Mitchell. 1998. In Proceedings of the eleventh annual conference on Computational learning theory. ACM, 92--100.",
      "doi": ""
    },
    {
      "text": "Andreas Bulling, Ulf Blanke, and Bernt Schiele. 2014. A tutorial on human activity recognition using bodyworn inertial sensors. ACM Comput. Surv.46, 3, Article 33 (January 2014), 33 pages. DOI=http://dx.doi.org/10.1145/2499621",
      "doi": ""
    },
    {
      "text": "Andrew Carlson et al. 2010. Toward an architecture for never-ending language learning. In Proceedings of Twenty-Fourth AAAI Conference on Artificial Intelligence. 1306--1313.",
      "doi": ""
    },
    {
      "text": "Olivier Chapelle, Bernhard Scholkpof, and Alexander Zien. 2006. Semi-supervised learning (chapelle, o. et al., ed. 2006) [book reviews]. IEEE Transactions on Neural Networks 20, 3. IEEE, 542--542.",
      "doi": ""
    },
    {
      "text": "Francois Chollet et al. 2015. Keras. https://keras.io",
      "doi": ""
    },
    {
      "text": "C. M. Coviello and L. H. Sibul. 2004. Blind source separation and beamforming: algebraic technique analysis. IEEE Transactions on Aerospace and Electronic Systems 40, 1. IEEE, 221--235.",
      "doi": ""
    },
    {
      "text": "Benjamin Elizalde et al. 2018. NELS -- Never-Ending Learner of Sounds. arXiv preprint arXiv:1801.05544.",
      "doi": ""
    },
    {
      "text": "Charles Elkan and Keith Noto. 2008. Learning classifiers from only positive and unlabeled data. In Proceedings of the 14th ACM SIGKDD international conference on Knowledge discovery and data mining (KDD '08). ACM, New York, NY, USA, 213--220. DOI: https://doi.org/10.1145/1401890.1401920",
      "doi": "10.1145/1401890.1401920"
    },
    {
      "text": "Li Fei-Fei, Rob Fergus, and Pietro Perona. 2006. Oneshot learning of object categories. IEEE transactions on pattern analysis and machine intelligence. IEEE, 594--611.",
      "doi": ""
    },
    {
      "text": "Google Inc. Google Home Hub. https://store.google.com/us/product/google_home_hub?hl=en-US, Retrieved on April 4,",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Anuraag Jain, Shomiron Ghose, Gierad Laput, Chris Harrison, and Jeffrey P. Bigham. 2018. Crowd-AI Camera Sensing in the Real World. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 111 (September 2018), 20 pages. DOI: https://doi.org/10.1145/3264921",
      "doi": ""
    },
    {
      "text": "Shawn Hershey et al. 2017. CNN architectures for large-scale audio classification. In Proceedings of 2017 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 131--135.",
      "doi": ""
    },
    {
      "text": "Matthew Honnibal and Ines Montani. 2017. spaCy 2: Natural language understanding with Bloom embeddings, convolutional neural networks and incremental parsing. To appear.",
      "doi": ""
    },
    {
      "text": "Enamul Hoque and John Stankovic. 2012. AALO: Activity recognition in smart homes using Active Learning in the presence of Overlapped activities. In Proceedings of 2012 6th International Conference on Pervasive Computing Technologies for Healthcare (Pervasive Health) and Workshops. IEEE, 139--146.",
      "doi": ""
    },
    {
      "text": "Po-Sen Huang et al. 2014. Deep learning for monaural speech separation. 2014 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 1562--1566.",
      "doi": ""
    },
    {
      "text": "Aren Jansen et al. 2017. Large-scale audio event discovery in one million youtube videos. 2017 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 786--790.",
      "doi": ""
    },
    {
      "text": "Aren Jansen et al. 2018. Unsupervised learning of semantic audio representations. 2018 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 126--130.",
      "doi": ""
    },
    {
      "text": "Eric Jones, Travis Oliphant, Pearu Peterson, et al. 2001. Scipy: Open source scientific tools for Python. http://www.scipy.org/, Accessed April 4, 2019.",
      "doi": ""
    },
    {
      "text": "Hirokazu Kameoka et al. 2018. Semi-blind source separation with multichannel variation encoder. arXiv preprint arXiv:1808.00892.",
      "doi": ""
    },
    {
      "text": "Rushil Khurana, Karan Ahuja, Zac Yu, Jennifer Mankoff, Chris Harrison, and Mayank Goel. 2018. GymCam: Detecting, Recognizing and Tracking Simultaneous Exercises in Unconstrained Scenes. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4, Article 185 (December 2018), 17 pages. DOI: https://doi.org/10.1145/3287063",
      "doi": "10.1145/3287063"
    },
    {
      "text": "Davis E. King. 2009. Dlib-ml: A Machine Learning Toolkit. Journal of Machine Learning Research Vol. 10. 1755--1758.",
      "doi": "10.5555/1577069.1755843"
    },
    {
      "text": "Gierad Laput, Karan Ahuja, Mayank Goel, and Chris Harrison. 2018. Ubicoustics: Plug-and-Play Acoustic Activity Recognition. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA, 213--224. DOI: https://doi.org/10.1145/3242587.3242609",
      "doi": "10.1145/3242587.3242609"
    },
    {
      "text": "Gierad Laput, Walter S. Lasecki, Jason Wiese, Robert Xiao, Jeffrey P. Bigham, and Chris Harrison. 2015. Zensors: Adaptive, Rapidly Deployable, Human-Intelligent Sensor Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 19351944. DOI: https://doi.org/10.1145/2702123.2702416",
      "doi": "10.1145/2702123.2702416"
    },
    {
      "text": "Walter S. Lasecki, Young Chol Song, Henry Kautz, and Jeffrey P. Bigham. 2013. Real-time crowd labeling for deployable activity recognition. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 1203--1212. DOI: https://doi.org/10.1145/2441776.2441912",
      "doi": ""
    },
    {
      "text": "Honglak Lee, Peter Pham, Yan Largman, and Andrew Y. Ng. 2009. Unsupervised feature learning for audio classification using convolutional deep belief networks. Advances in neural information processing systems (NIPS). 1096--1104.",
      "doi": "10.5555/1661445.1661623"
    },
    {
      "text": "Jinna Lei, Xiaofeng Ren, and Dieter Fox. 2012. Finegrained kitchen activity recognition using RGB-D. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 208--211. DOI=http://dx.doi.org/10.1145/2370216.2370248",
      "doi": "10.1145/2370216.2370248"
    },
    {
      "text": "Jonathan Lester, Tanzeem Choudhury, and Gaetano Borriello. 2006. A practical approach to recognizing physical activities. In Proceedings of the International Conference on Pervasive Computing. 1--16.",
      "doi": "10.1007/11748625_1"
    },
    {
      "text": "Li-Jia Li and Li Fei-Fei. 2010. Optimol: automatic online picture collection via incremental model learning. International Journal of Computer Vision 88, 2. Springer, 147--168.",
      "doi": "10.1007/s11263-009-0265-6"
    },
    {
      "text": "Dawei Liang and Edison Thomaz. 2019. Audio-Based Activities of Daily Living (ADL) Recognition with Large-Scale Acoustic Embeddings from Online Videos. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1, Article 17 (March 2019), 18 pages. DOI: https://doi.org/10.1145/3314404",
      "doi": "10.1145/3314404"
    },
    {
      "text": "Beth Logan, Jennifer Healey, Mitthai Philipose, Emmanuel M Tapia, and Stephen Intille. 2007. A longterm evaluation of sensing modalities for activity recognition. In Proceedings of International Conference on Ubiquitous Computing. Springer, 483--500.",
      "doi": ""
    },
    {
      "text": "Brent Longstaff, Sasank Reddy, and Deborah Estrin. 2010. Improving activity classification for health applications on mobile devices using active and semi-supervised learning. 2010 4th International Conference on Pervasive Computing Technologies for Healthcare. IEEE, 1--7.",
      "doi": ""
    },
    {
      "text": "Hong Lu, Wei Pan, Nicholas D. Lane, Tanzeem Choudhury, and Andrew T. Campbell. 2009. SoundSense: scalable sound sensing for people-centric applications on mobile phones. In Proceedings of the 7th international conference on Mobile systems, applications, and services (MobiSys '09). ACM, New York, NY, USA, 165--178. DOI: https://doi.org/10.1145/1555816.1555834",
      "doi": ""
    },
    {
      "text": "Paul Lukowicz, Jamie A. Ward, Holger Junker, Mathias Stager, Gerhard Troster, Amin Atrash, Thad Starner. 2004. Recognizing Workshop Activity Using Body Worn Microphones and Accelerometers. In International Conference on Pervasive Computing. Springer, 18--32.",
      "doi": ""
    },
    {
      "text": "Ingo Mierswa and Katharina Morik. 2005. Automatic feature extraction for classifying audio data. Machine learning 58,2--3. Springer, 127--149.",
      "doi": ""
    },
    {
      "text": "David Minnen, Thad Starner, Irfan Essa, and Charles Isbell. 2006. Discovery characteristic actions from onbody sensor data. In Proceedings of 2006 10th IEEE International Symposium on Wearable Computers. IEEE, 11--18.",
      "doi": ""
    },
    {
      "text": "Daniel Mullner et al. 2013. Fastcluster: Fast hierarchical, agglomerative clustering routines for R and Python. Journal of Statistical Software 53, 9. Foundation for Open Access Statistics, 1--18.",
      "doi": ""
    },
    {
      "text": "Le T. Nguyen, Ming Zeng, Patrick Tague, and Joy Zhang. 2015. I did not smoke 100 cigarettes today!: avoiding false positives in real-world activity recognition. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 1053--1063. DOI: https://doi.org/10.1145/2750858.2804256",
      "doi": "10.1145/2750858.2804256"
    },
    {
      "text": "Le T. Nguyen, Ming Zeng, Patrick Tague, and Joy Zhang. 2015. Recognizing new activities with limited training data. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 67--74. DOI: https://doi.org/10.1145/2802083.2808388",
      "doi": "10.1145/2802083.2808388"
    },
    {
      "text": "Aaron van den Oord, et al. 2016. Wavenet: A generative model for raw audio. arXiv preprint arXiv:1609.03499.",
      "doi": ""
    },
    {
      "text": "F. Pedregosa et al. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research Vol. 12. 2825--2830.",
      "doi": ""
    },
    {
      "text": "Veljko Pejovic, and Musolesi Mirco.2014. ?InterruptMe: designing intelligent prompting mechanisms for pervasive applications.\" In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, pp. 897--908. ACM, 2014.",
      "doi": ""
    },
    {
      "text": "Minh Pham, Dan Yang, Weihua Sheng, and Meiqin Liu. 2015. Human Localization and Tracking Using Distributed Motion Sensors and an Inertial Measurement Unit. In Proceedings of the 2015 IEEE Conference on Robotics and Biomimetics. IEEE. 2127--2132.",
      "doi": ""
    },
    {
      "text": "Karol J. Piczak. 2015. ESC: Dataset for Environmental Sound Classification. In Proceedings of the 23rd ACM international conference on Multimedia (MM '15). ACM, New York, NY, USA, 1015--1018. DOI: https://doi.org/10.1145/2733373.2806390",
      "doi": "10.1145/2733373.2806390"
    },
    {
      "text": "Robi Polikar, Lalita Upda, Satish S. Upda, and Vasant Honavar. 2001. Learn++: An incremental learning algorithm for supervised neural networks. IEEE transactions on systems, man, and cybernetics, part C (applications and reviews) 31, 4. IEEE, 497--508.",
      "doi": ""
    },
    {
      "text": "Sylvestre-Alvise Rebuffi et al. 2017. iCaRL: Incremental Classifier and Representation Learning. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2001--2010.",
      "doi": ""
    },
    {
      "text": "Andrew Rosenberg and Julia Hirschberg. 2007. Vmeasure: A conditional entropy-based external cluster evaluation measure. In Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning (EMNLP-CoNLL).",
      "doi": ""
    },
    {
      "text": "Stephanie L.Rosenthal and Anind K. Dey. 2010. ?Towards maximizing the accuracy of human-labeled sensor data.\" In Proceedings of the 15th international conference on Intelligent user interfaces, pp. 259--268. ACM, 2010.",
      "doi": ""
    },
    {
      "text": "Stephanie L. Rosenthal, Manuela Veloso, and Anind K. Dey. 2012. ?Acquiring accurate human responses to robots' questions.\" International journal of social robotics 4, no. 2 (2012): 117--129.",
      "doi": ""
    },
    {
      "text": "Hesam Sagha et al. 2013. Robust activity recognition combining anomaly detection and classifier retraining. In Proceedings of 2013 IEEE International Conference on Body Sensor Networks. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Justin Salamon and Juan P. Bello. 2015. Feature learning with deep scattering for urban sound analysis. In Proc 2015 23rd European Signal Processing Conference (EUSIPCO '15). IEEE, 724--728.",
      "doi": ""
    },
    {
      "text": "Justin Salamon, Christopher Jacoby, and Juan Pablo Bello. 2014. A Dataset and Taxonomy for Urban Sound Research. In Proceedings of the 22nd ACM international conference on Multimedia (MM '14). ACM, New York, NY, USA, 1041--1044. DOI: https://doi.org/10.1145/2647868.2655045",
      "doi": "10.1145/2647868.2655045"
    },
    {
      "text": "Bernhard Scholkopf, Alex J Smola, Robert C Williamson, and Peter L Bartlett. 2000. New support vector algorithms. Neural computation 12, 5. MIT Press, 12071245.",
      "doi": ""
    },
    {
      "text": "Bernhard Scholkopf, Robert C Williamson, Alex J Smola, John Shawe-Taylor, and John C Platt. 2000. Support vector method for novelty detection. Advances in neural information processing systems (NIPS). 582588.",
      "doi": ""
    },
    {
      "text": "Burr Settles. 2009. Active learning literature survey. CS Technical Reports. University of Wisconsin-Madison Department of Computer Sciences.",
      "doi": ""
    },
    {
      "text": "Karen Simonyan and Andrew Zisserman. 2014. Very deep convolutional networks for large-scale image recognition. arXiv preprint arXiv:1409.1556.",
      "doi": ""
    },
    {
      "text": "Mathias Stager, Paul Lukowicz, Niroshan Perera, Thomas von Buren, Gerhard Troster, and Thad Starner. 2003. Soundbutton: Design of a low power wearable audio classification system. In Proceedings of the Seventh IEEE International Symposium on Wearable Computers (ISWC '03). IEEE.",
      "doi": ""
    },
    {
      "text": "Andrey Temko and Climent Nadeu. 2009. Acoustic event detection in meeting-room environments. Pattern Recognition Letters 30, 14. Elsevier, 1281--1288.",
      "doi": "10.1016/j.patrec.2009.06.009"
    },
    {
      "text": "Sergios Theodoridis and Konstantinos Koutroumbas. 2010. Pattern Recognition & Matlab Intro (4th ed.). Academic Press, Inc., Orlando, FL, USA.",
      "doi": ""
    },
    {
      "text": "Robert Tibshirani et al. 2001. Estimating the number of clusters in a data set via the gap statistic. Journal of the Royal Statistical Society: Series B (Statistical Methodology), 63, 2. Wiley Online Library, 411--423.",
      "doi": ""
    },
    {
      "text": "George Tzanetakis and Perry Cook. 2002. Musical genre classification of audio signals. IEEE Transactions on speech and audio processing 10, 5. IEEE 293302.",
      "doi": ""
    },
    {
      "text": "Nguyen Xuan Vinh, Julien Epps, and James Bailey. 2010. Journal of Machine Learning Research 11, Oct. 2837--2854.",
      "doi": ""
    },
    {
      "text": "Oriol Vinyals et al. 2016. Matching networks for one shot learning. Advances in neural information processing systems (NIPS). 3630--3638.",
      "doi": ""
    },
    {
      "text": "Wei Wang, Chunyan Miao, and Shuji Hao. 2017. Zeroshot human activity recognition via nonlinear compatibility based method. In Proceedings of the International Conference on Web Intelligence (WI '17). ACM, New York, NY, USA, 322--330. DOI: https://doi.org/10.1145/3106426.3106526",
      "doi": "10.1145/3106426.3106526"
    },
    {
      "text": "Jamie A. Ward, Paul Lukowicz, Gerhard Troster, and Thad E. Starner. 2006. Activity recognition of assembly ¨ tasks using body-worn microphones and accelerometers. IEEE Trans. on Pattern Analysis and Machine Intelligence 28, 10 (2006), 1553--1567.",
      "doi": "10.1109/TPAMI.2006.197"
    },
    {
      "text": "Joe H Ward Jr. 1963. Hierarchical grouping to optimize an objective function. Journal of the American statistical association 58, 301. Taylor & Francis Group, 236--244.",
      "doi": ""
    },
    {
      "text": "Bo Wei, Wen Hu, Mingrui Yang, and Chun Tung Chou. 2015. Radio-based device-free activity recognition with radio frequency interference. In Proceedings of the 14th International Conference on Information Processing in Sensor Networks (IPSN '15). ACM, New York, NY, USA, 154--165. DOI=http://dx.doi.org/10.1145/2737095.2737117",
      "doi": "10.1145/2737095.2737117"
    },
    {
      "text": "Yongqin Xian et al. 2018. Zero-shot learning -- a comprehensive evaluation of the good, the bad and the ugly. IEEE transactions on pattern analysis and machine intelligence. IEEE.",
      "doi": ""
    },
    {
      "text": "Koji Yatani and Khai N. Truong. 2012. BodyScope: a wearable acoustic sensor for activity recognition. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 341--350. DOI=http://dx.doi.org/10.1145/2370216.2370269",
      "doi": ""
    },
    {
      "text": "Bo-Feng Zhang, Jin-Shu Su, and Xin Xu. 2006. A class-incremental learning method for multi-class support vector machines in text classification. In Proceedings of 2006 International Conference on Machine Learning and Cybernetics. IEEE, 2581--2585.",
      "doi": ""
    },
    {
      "text": "Chenyang Zhang and Yingli Tian. 2012. RGB-D camera-based daily living activity recognition. Journal of Computer Vision and Image Processing 2, 4. 12.",
      "doi": ""
    }
  ]
}