{
  "doi": "10.1145/3313831.3376204",
  "title": "Morphic: Auto-Personalization on a Global Scale",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Users frequently have trouble finding and changing technology settings, even when adjusting those settings to personalize their technology devices may significantly improve their user experience. This paper describes the Morphic project, a cloud-based auto-personalization tool. Primarily designed for improving accessibility, the auto-personalization in Morphic may also help a broader audience. This paper describes: 1) the technical infrastructure needed to support cloud-based auto-personalization, 2) the interaction design approaches necessary to support users during the personalization of their settings, and 3) which settings and modifications have been most frequently used. This paper presents the evolution of the Morphic project, the building of the infrastructure, the formative evaluation of various interaction design approaches (NFC cards, physical keypads, on-screen buttons, and menus), and implications for researchers and developers. It also includes preliminary findings from six technology probes.",
  "authors": [
    {
      "name": "Gregg Vanderheiden",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100641036",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Lazar",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100417512/rel-imgonly/lazar_jonathan_high_res.jpg",
      "acmid": "81100417512",
      "orcid": "0000-0002-6317-1582"
    },
    {
      "name": "J. Bern Jordan",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758982957",
      "orcid": "missing"
    },
    {
      "name": "Yao Ding",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526722",
      "orcid": "missing"
    },
    {
      "name": "Rachel E. Wood",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528197",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Julio Abascal, Amaia Aizpurua, Idoia Cearreta, Borja Gamecho, Nestor Garay-Vitoria, and Raúl Miñón. 2011. Automatically generating tailored accessible user interfaces for ubiquitous services. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11), 187--194. https://doi.org/10.1145/2049536.2049570",
      "doi": "10.1145/2049536.2049570"
    },
    {
      "text": "Tatiana Silva de Alencar, Luciano Rodrigues Machado, Luciano de Oliveira Neris, and Vânia Paula de Almeida Neris. 2014. Addressing the Users' Diversity in Ubiquitous Environments through a Low Cost Architecture. In Stephanidis C., Antona M. (eds) Universal Access in Human-Computer Interaction. Aging and Assistive Environments. Lecture Notes in Computer Science, vol 8515, 439--450. Springer, Cham. https://doi.org/10.1007/978--3--319-07446--7_43",
      "doi": "10.1007/978-3-319-07446-7_43"
    },
    {
      "text": "Jeffrey P. Bigham, Craig M. Prince, and Richard E. Ladner. 2008. In Proceedings of the 2008 international cross-disciplinary conference on Web accessibility (W4A'08), 73--82. https://doi.org/10.1145/1368044.1368060",
      "doi": ""
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. The invisible work of accessibility: How blind employees manage accessibility in mixed-ability workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 163--171. https://doi.org/10.1145/2700648.2809864",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2373--2382. https://doi.org/10.1145/2702123.2702511",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Colin Clark, Antranig Basman, Kasper Galschiot Markus, and Yura Zenevich. 2013. A cloud-scale architecture for inclusion: Cloud4all and GPII. In P. Encarnação et al. (eds.) Assistive Technology: From Research to Practice: AAATE 2013, 1366--1371. IOS Press.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z. Gajos, Daniel S. Weld, and Jacob O. Wobbrock. 2010. Automatically generating personalized user interfaces with SUPPLE. Artificial Intelligence, 174(12 -- 13), 910--950. https://doi.org/10.1016/j.artint.2010.05.005",
      "doi": ""
    },
    {
      "text": "GPII (21 August 2018). Lifecycle Manager (documentation). Retrieved December 18, 2019 from https://github.com/GPII/universal/blob/master/docum entation/LifecycleManager.md",
      "doi": ""
    },
    {
      "text": "GPII (22 September 2018). The Apptology (documentation). Retrieved December 18, 2019 from https://github.com/GPII/universal/blob/master/docum entation/Apptology.md",
      "doi": ""
    },
    {
      "text": "GPII (22 September 2018), Flat Matchmaker (documentation). Retrieved December 18, 2019 from https://github.com/GPII/universal/blob/master/docum entation/FlatMatchMaker.md",
      "doi": ""
    },
    {
      "text": "GPII (5 November 2019). Cloud Based Flowmanager Flow (documentation). Retrieved December 18, 2019 from https://github.com/GPII/universal/blob/master/docum entation/CloudBasedFlow.md",
      "doi": ""
    },
    {
      "text": "GPII (22 November 2019). Flow Manager (documentation). Retrieved December 18, 2019 from https://github.com/GPII/universal/blob/master/docum entation/FlowManager.md",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bosse Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, Björn Eiderbäck, Sinna Lindquist, and Ynge Sundblad. 2003. Technology probes: Inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '03), 17--24. https://doi.org/10.1145/642611.642616",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "J. Bern Jordan, Gregg C. Vanderheiden, Maureen Kaine-Krolak, and Vera Roberts. 2018. A pilot study of computer auto-personalization at American job centers. Journal on Technology and Persons with Disabilities, 6, 247--260. http://hdl.handle.net/10211.3/202999",
      "doi": ""
    },
    {
      "text": "J. Bern Jordan and Gregg C. Vanderheiden. 2017. Towards Accessible Automatically Generated Interfaces Part 2: Study with Model-Based Selfvoicing Interfaces. In J. Zhou & G. Salvendy (eds) Human Aspects of IT for the Aged Population. Aging, Design and User Experience. Lecture Notes in Computer Science, vol. 10297, 110--128. Springer. https://doi.org/10.1007/978--3--319--58530--7_8",
      "doi": ""
    },
    {
      "text": "John J. Kelway, Anke M. Brock, Pascal Guitton, Aurélie Millet, and Yasushi Nakata. 2018. Improving the academic inclusion of a student with special needs at University Bordeaux. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS'18), 52--56. https://doi.org/10.1145/3234695.3241482",
      "doi": "10.1145/3234695.3241482"
    },
    {
      "text": "Jonathan Lazar and Irene Briggs. 2015. Improving services for patrons with print disabilities at public libraries. The Library Quarterly, 85(2), 172--184. https://doi.org/10.1086/680155",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Daniel Goldstein, and Anne Taylor. 2015. Ensuring Digital Accessibility through Process and Policy. Waltham, MA: Elsevier/Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar. 2019. The Use of Screen Reader Accommodations by Blind Students in Standardized Testing: A Legal and Socio-Technical Framework. Journal of Law & Education, 48(2), 185--213.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research Methods in HumanComputer Interaction (2nd ed.). Cambridge, MA: Elsevier/Morgan Kaufmann Publishers.",
      "doi": "10.5555/1841406"
    },
    {
      "text": "James A. Lenker, Frances Harris, Mary Taugher, and Roger O. Smith. 2013. Consumer perspectives on assistive technology outcomes. Disability and Rehabilitation: Assistive Technology, 8(5), 373--380. https://doi.org/10.3109/17483107.2012.749429",
      "doi": ""
    },
    {
      "text": "Clayton Lewis and Jutta Treviranus. 2013. Public policy and the Global Public Inclusive Infrastructure project. Interactions, 20(5), 62--66. https://doi.org/10.1145/2510123",
      "doi": "10.1145/2510123"
    },
    {
      "text": "Claudia Loitsch, Gerhard Weber, Nikolaos Kaklanis, Konstantinos Votis, and Dimitrios Tzovaras, D. (2017). A knowledge-based approach to user interface adaptation from preferences and for special needs. User Modeling and User-Adapted Interaction, 27, 445--491. https://doi.org/10.1007/s11257-017--9196-z",
      "doi": "10.1007/s11257-017-9196-z"
    },
    {
      "text": "Microsoft. 2004. Accessible technology in computing-Examining Awareness, Use, and Future Potential. Retrieved December 18, 2019 from http://download.microsoft.com/download/0/1/f/01f50 6eb-2d1e-42a6-bc7b-1f33d25fd40f/researchreportphase2.doc",
      "doi": ""
    },
    {
      "text": "Alexandros Mourouzis, Asterios Leonidis, Michalis Foukarakis, Margherita Antona, and Nicos Maglaveras. 2011. A Novel Design Approach for Multi-device Adaptable User Interfaces: Concepts, Methods and Examples. I: Stephanidis C. (ed.) Universal Access in Human-Computer Interaction. Design for All and eInclusion. Lecture Notes in Computer Science, vol 6765, 400--409. Springer, Berlin, Heidelberg. https://doi.org/10.1007/978--3642--21672--5_44",
      "doi": ""
    },
    {
      "text": "Jeffrey Nichols, Brad A. Myers, and Brandon Rothrock. 2006. UNIFORM: Automatically Generating Consistent Remote Control User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 611--620. https://doi.org/10.1145/1124772.1124865",
      "doi": "10.1145/1124772.1124865"
    },
    {
      "text": "Matthias Peißner, Doris Janssen, and Thomas Sellner, 2012. MyUI Individualization Patterns for Accessible and Adaptive User Interfaces. In Proceedings of the First International Conference on Smart Systems, Devices and Technologies (SMART) 2012. IARIA. 25--30.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: Assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 705--714. https://doi.org/10.1145/1978942.1979044",
      "doi": ""
    },
    {
      "text": "C. Stephanidis, A. Paramythis, M. Sfyrakis, A. Stergiou, N. Maou, A. Leventis, G. Paparoulis, and C. Karagiannidis. 1998. Adaptable and Adaptive User Interfaces for Disabled Users in the AVANTI Project. In S. Trigila et al. (eds) Intelligence in Services and Networks: Technology for Ubiquitous Telecom Services. IS&N 1998. Lecture Notes in Computer Science, vol 1430. Springer, Berlin, Heidelberg",
      "doi": ""
    },
    {
      "text": "Anna M. Szopa, J. Bern Jordan, David J. Folmar, D. J., and Gregg C. Vanderheiden. 2020. The AutoPersonalization Computing Project in Libraries. In International Conference on Applied Human Factors and Ergonomics, 802--812. Springer. https://doi.org/10.1007/978--3-030--19135--1_78",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell, David R. Flatla, and Rachel Menzies. 2018. It's not just the light: Understanding the factors causing situational visual impairments during mobile interaction. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI'18), 338--351. https://doi.org/10.1145/3240167.3240207",
      "doi": "10.1145/3240167.3240207"
    },
    {
      "text": "Gregg C. Vanderheiden, Jutta Treviranus, Jose A. Martinez Usero, Evangelos Bekiaris, Maria Gemou, and Amrish O. Chourasia. 2012. Autopersonalization: Theory, practice and cross-platform implementation. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting 56(1), 926--930. Sage: Los Angeles, CA https://doi.org/10.1177/1071181312561193",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-based design: Concept, principles and examples. ACM Transactions on Accessible Computing (TACCESS), 3(3), Article 9. https://doi.org/10.1145/1952383.1952384",
      "doi": ""
    }
  ]
}