{
  "doi": "10.1145/3313831.3376723",
  "title": "Self-Determination Theory in HCI Games Research: Current Uses and Open Questions",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Self-Determination Theory (SDT), a major psychological theory of human motivation, has become increasingly popular in Human-Computer Interaction (HCI) research on games and play. However, it remains unclear how SDT has advanced HCI games research, or how HCI games scholars engage with the theory. We reviewed 110 CHI and CHI PLAY papers that cited SDT to gain a better understanding of the ways the theory has contributed to HCI games research. We find that SDT, and in particular, the concepts of need satisfaction and intrinsic motivation, have been widely applied to analyse the player experience and inform game design. Despite the popularity of SDT-based measures, however, prominent core concepts and mini-theories are rarely considered explicitly, and few papers engage with SDT beyond descriptive accounts. We highlight conceptual gaps at the intersection of SDT and HCI games research, and identify opportunities for SDT propositions, concepts, and measures to more productively inform future work.",
  "tags": [
    "games",
    "motivation",
    "theory",
    "gamification",
    "self-determination theory",
    "play",
    "player experience"
  ],
  "authors": [
    {
      "name": "April Tyack",
      "institution": "Queensland University of Technology & Aalto University, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078187",
      "orcid": "missing"
    },
    {
      "name": "Elisa D. Mekler",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549460056",
      "orcid": "0000-0003-0076-6703"
    }
  ],
  "references": [
    {
      "text": "Gazihan Alankus and Caitlin Kelleher. 2012. Reducing Compensatory Motions in Video Games for Stroke Rehabilitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2049--2058. DOI: http://dx.doi.org/10.1145/2207676.2208354",
      "doi": "10.1145/2207676.2208354"
    },
    {
      "text": "Dmitry Alexandrovsky, Maximilian Achim Friehs, Max V. Birk, Rowan K. Yates, and Regan L. Mandryk. 2019. Game Dynamics that Support Snacking, not Feasting. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 573--588. DOI: http://dx.doi.org/10.1145/3311350.3347151",
      "doi": ""
    },
    {
      "text": "Johnie J. Allen and Craig A. Anderson. 2018. Satisfaction and Frustration of Basic Psychological Needs in the Real World and in Video Games Predict Internet Gaming Disorder Scores and Well-Being. Computers in Human Behavior 84 (2018), 220--229.",
      "doi": "10.1016/j.chb.2018.02.034"
    },
    {
      "text": "Maximilian Altmeyer, Kathrin Dernbecher, Vladislav Hnatovskiy, Marc Schubhan, Pascal Lessel, and Antonio Krüger. 2019. Gamified Ads: Bridging the Gap Between User Enjoyment and the Effectiveness of Online Ads. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 182, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300412",
      "doi": "10.1145/3290605.3300412"
    },
    {
      "text": "Ronny Andrade, Melissa J. Rogerson, Jenny Waycott, Steven Baker, and Frank Vetere. 2019. Playing Blind: Revealing the World of Gamers with Visual Impairment. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 116, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300346",
      "doi": "10.1145/3290605.3300346"
    },
    {
      "text": "Josh Andres, Julian de Hoog, and Florian 'Floyd' Mueller. 2018. \"I Had Super-powers when eBike Riding\" Towards Understanding the Design of Integrated Exertion. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 19--31. DOI: http://dx.doi.org/10.1145/3242671.3242688",
      "doi": "10.1145/3242671.3242688"
    },
    {
      "text": "Ahmad Azadvar and Alessandro Canossa. 2018. UPEQ: Ubisoft Perceived Experience Questionnaire: A Self-determination Evaluation Tool for Video Games. In Proceedings of the 13th International Conference on the Foundations of Digital Games (FDG '18). ACM, NY, NY, USA, Article 5, 7 pages. DOI: http://dx.doi.org/10.1145/3235765.3235780",
      "doi": "10.1145/3235765.3235780"
    },
    {
      "text": "Madeline Balaam, Stefan Rennick Egglestone, Geraldine Fitzpatrick, Tom Rodden, Ann-Marie Hughes, Anna Wilkinson, Thomas Nind, Lesley Axelrod, Eric Harris, Ian Ricketts, Susan Mawson, and Jane Burridge. 2011. Motivating Mobility: Designing for Lived Motivation in Stroke Rehabilitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3073--3082. DOI: http://dx.doi.org/10.1145/1978942.1979397",
      "doi": "10.1145/1978942.1979397"
    },
    {
      "text": "Alexander Baldwin, Daniel Johnson, and Peta Wyeth. 2016. Crowd-Pleaser: Player Perspectives of Multiplayer Dynamic Difficulty Adjustment in Video Games. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI Play '16). ACM, 326--337.",
      "doi": "10.1145/2967934.2968100"
    },
    {
      "text": "Soumya C. Barathi, Daniel J. Finnegan, Matthew Farrow, Alexander Whaley, Pippa Heath, Jude Buckley, Peter W. Dowrick, Burkhard C. Wuensche, James L. J. Bilzon, Eamonn O'Neill, and Christof Lutteroth. 2018. Interactive Feedforward for Improving Performance and Maintaining Intrinsic Motivation in VR Exergaming. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 408, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3173982",
      "doi": "10.1145/3173574.3173982"
    },
    {
      "text": "Javier A. Bargas-Avila and Kasper Hornbæk. 2011. Old Wine in New Bottles or Novel Challenges: A Critical Analysis of Empirical Studies of User Experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2689--2698. DOI: http://dx.doi.org/10.1145/1978942.1979336",
      "doi": ""
    },
    {
      "text": "Kimberley J. Bartholomew, Nikos Ntoumanis, Richard M. Ryan, Jos A. Bosch, and Cecilie Thøgersen-Ntoumani. 2011. Self-Determination Theory and Diminished Functioning: The Role of Interpersonal Control and Psychological Need Thwarting. Personality and Social Psychology Bulletin 37, 11 (2011), 1459--1473.",
      "doi": ""
    },
    {
      "text": "Benjamin B Bederson and Ben Shneiderman. 2003. Theories for understanding information visualization. In The craft of information visualization: Readings and reflections. Morgan Kaufmann, San Francisco, USA.",
      "doi": ""
    },
    {
      "text": "Patrick K. Bender and Douglas A. Gentile. 2019. Internet Gaming Disorder: Relations Between Needs Satisfaction In-Game and in Life in General. Psychology of Popular Media Culture Advance publication (2019). DOI: http://dx.doi.org/10.1037/ppm0000227",
      "doi": ""
    },
    {
      "text": "Yulong Bian, Chenglei Yang, Chao Zhou, Juan Liu, Wei Gai, Xiangxu Meng, Feng Tian, and Chia Shen. 2018. Exploring the Weak Association Between Flow Experience and Performance in Virtual Environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 401, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173975",
      "doi": "10.1145/3173574.3173975"
    },
    {
      "text": "Max Birk and Regan L. Mandryk. 2013. Control Your Game-self: Effects of Controller Type on Enjoyment, Motivation, and Personality in Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 685--694. DOI: http://dx.doi.org/10.1145/2470654.2470752",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Cheralyn Atkins, Jason T. Bowey, and Regan L. Mandryk. 2016a. Fostering Intrinsic Motivation Through Avatar Identification in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2982--2995. DOI: http://dx.doi.org/10.1145/2858036.2858062",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Benjamin Buttlar, Jason T. Bowey, Susanne Poeller, Shelby C. Thomson, Nicola Baumann, and Regan L. Mandryk. 2016b. The Effects of Social Exclusion on Play Experience and Hostile Cognitions in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3007--3019. DOI: http://dx.doi.org/10.1145/2858036.2858061",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Maximilian A. Friehs, and Regan L. Mandryk. 2017. Age-Based Preferences and Player Experience: A Crowdsourced Cross-sectional Study. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 157--170. DOI: http://dx.doi.org/10.1145/3116595.3116608",
      "doi": ""
    },
    {
      "text": "Max V. Birk and Regan L. Mandryk. 2018. Combating Attrition in Digital Self-Improvement Programs Using Avatar Customization. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 660, 15 pages. DOI: http://dx.doi.org/10.1145/3173574.3174234",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Regan L. Mandryk, and Cheralyn Atkins. 2016. The Motivational Push of Games: The Interplay of Intrinsic Motivation and External Rewards in Games for Training. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 291--303. DOI: http://dx.doi.org/10.1145/2967934.2968091",
      "doi": "10.1145/2967934.2968091"
    },
    {
      "text": "Max V. Birk, Regan L. Mandryk, Matthew K. Miller, and Kathrin M. Gerling. 2015. How Self-Esteem Shapes Our Interactions with Play Technologies. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 35--45. DOI: http://dx.doi.org/10.1145/2793107.2793111",
      "doi": ""
    },
    {
      "text": "Joschka Boedecker, Thomas Lampe, and Martin Riedmiller. 2013. Modeling effects of intrinsic and extrinsic rewards on the competition between striatal learning systems. Frontiers in Psychology 4 (2013), 739. DOI: http://dx.doi.org/10.3389/fpsyg.2013.00739",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Elisa D. Mekler, and Klaus Opwis. 2016. Negative Emotion, Positive Experience?: Emotionally Moving Moments in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2996--3006. DOI: http://dx.doi.org/10.1145/2858036.2858227",
      "doi": "10.1145/2858036.2858227"
    },
    {
      "text": "Julia Ayumi Bopp, Livia J. Müller, Lena Fanya Aeschbach, Klaus Opwis, and Elisa D. Mekler. 2019. Exploring Emotional Attachment to Game Characters. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 313--324. DOI: http://dx.doi.org/10.1145/3311350.3347169",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Klaus Opwis, and Elisa D. Mekler. 2018. \"An Odd Kind of Pleasure\": Differentiating Emotional Challenge in Digital Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 41, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173615",
      "doi": ""
    },
    {
      "text": "Jason T. Bowey, Max V. Birk, and Regan L. Mandryk. 2015. Manipulating Leaderboards to Induce Player Experience. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 115--120. DOI: http://dx.doi.org/10.1145/2793107.2793138",
      "doi": ""
    },
    {
      "text": "Jason T. Bowey, Ansgar E. Depping, and Regan L. Mandryk. 2017. Don't Talk Dirty to Me: How Sexist Beliefs Affect Experience in Sexist Games. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1530--1543. DOI: http://dx.doi.org/10.1145/3025453.3025563",
      "doi": ""
    },
    {
      "text": "Jason T. Bowey and Regan L. Mandryk. 2017. Those Are Not the Stories You Are Looking For: Using Text Prototypes to Evaluate Game Narratives Early. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 265--276. DOI: http://dx.doi.org/10.1145/3116595.3116636",
      "doi": ""
    },
    {
      "text": "Elizabeth Boyle, Thomas M Connolly, and Thomas Hainey. 2011. The role of psychology in understanding the impact of computer games. Entertainment Computing 2, 2 (2011), 69--74. DOI: http://dx.doi.org/10.1016/j.entcom.2010.12.002",
      "doi": ""
    },
    {
      "text": "Florian Brühlmann and Gian-Marco Schmid. 2015. How to Measure the Game Experience? Analysis of the Factor Structure of Two Questionnaires. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1181--1186. DOI: http://dx.doi.org/10.1145/2702613.2732831",
      "doi": ""
    },
    {
      "text": "Florian Brühlmann, Beat Vollenwyder, Klaus Opwis, and Elisa D. Mekler. 2018. Measuring the \"Why\" of Interaction: Development and Validation of the User Motivation Inventory (UMI). In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Paul Cairns, Jing Li, Wendy Wang, and A. Imran Nordin. 2014. The Influence of Controllers on Immersion in Mobile Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 371--380. DOI: http://dx.doi.org/10.1145/2556288.2557345",
      "doi": ""
    },
    {
      "text": "Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving Player Balancing in Racing Games. In Proceedings of the 2014 Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 47--56. DOI: http://dx.doi.org/10.1145/2658537.2658701",
      "doi": "10.1145/2658537.2658701"
    },
    {
      "text": "Center for Self-Determination Theory. n.d. Intrinsic Motivation Inventory (IMI). (n.d.). Accessed 22 August, 2019 from https://selfdeterminationtheory.org/intrinsicmotivation-inventory/.",
      "doi": ""
    },
    {
      "text": "Sven Charleer, Kathrin Gerling, Francisco Gutiérrez, Hans Cauwenbergh, Bram Luycx, and Katrien Verbert. 2018. Real-Time Dashboards to Support eSports Spectating. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 59--71. DOI: http://dx.doi.org/10.1145/3242671.3242680",
      "doi": "10.1145/3242671.3242680"
    },
    {
      "text": "Valery Chirkov, Richard M Ryan, Youngmee Kim, and Ulas Kaplan. 2003. Differentiating autonomy from individualism and independence: A self-determination theory perspective on internalization of cultural orientations and well-being. Journal of personality and social psychology 84, 1 (2003), 97. DOI: http://dx.doi.org/10.1037/0022--3514.84.1.97",
      "doi": ""
    },
    {
      "text": "Torkil Clemmensen, Victor Kaptelinin, and Bonnie Nardi. 2016. Making HCI theory work: an analysis of the use of activity theory in HCI research. Behaviour & Information Technology 35, 8 (2016), 608--627. DOI: http://dx.doi.org/10.1080/0144929X.2016.1175507",
      "doi": "10.1080/0144929X.2016.1175507"
    },
    {
      "text": "Sebastian Cmentowski, Andrey Krekhov, and Jens Krüger. 2019. Outstanding: A Multi-Perspective Travel Approach for Virtual Reality Games. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 287--299. DOI: http://dx.doi.org/10.1145/3311350.3347183",
      "doi": "10.1145/3311350.3347183"
    },
    {
      "text": "Thomas Constant and Guillaume Levieux. 2019. Dynamic Difficulty Adjustment Impact on Players' Confidence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 463, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300693",
      "doi": "10.1145/3290605.3300693"
    },
    {
      "text": "Edward L Deci. 1976. Notes on the theory and metatheory of intrinsic motivation. Organizational behavior and human performance 15, 1 (1976), 130--145.",
      "doi": ""
    },
    {
      "text": "Edward L Deci, Haleh Eghrari, Brian C Patrick, and Dean R Leone. 1994. Facilitating internalization: The self-determination theory perspective. Journal of personality 62, 1 (1994), 119--142. DOI: http://dx.doi.org/10.1111/j.1467--6494.1994.tb00797.x",
      "doi": ""
    },
    {
      "text": "Edward L Deci, Richard Koestner, and Richard M Ryan. 1999. A meta-analytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological bulletin 125, 6 (1999), 627.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 1985a. Cognitive Evaluation Theory: Interpersonal Communication and Intrapersonal Regulation. In Intrinsic Motivation and Self-Determination in Human Behavior. Plenum Press, New York, USA.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 1985b. Cognitive Evaluation Theory: Perceived Causality and Perceived Competence. In Intrinsic Motivation and Self-Determination in Human Behavior. Plenum Press, New York, USA.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 1985c. The general causality orientations scale: Self-determination in personality. Journal of research in personality 19, 2 (1985), 109--134. DOI: http://dx.doi.org/10.1016/0092--6566(85)90023--6",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The \"What\" and \"Why\" of Goal Pursuits: Human Needs and the Self-Determination of Behavior. Psychological Inquiry 11, 4 (2000), 227--268. DOI: http://dx.doi.org/10.1207/S15327965PLI1104_01",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2002a. Handbook of self-determination research. Rochester, NY: University Rochester Press.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2002b. Overview of Self-Determination Theory: An Organismic Dialectical Perspective. Handbook of Self-Determination Research (2002), 3--33.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 2014. Autonomy and Need Satisfaction in Close Relationships: Relationships Motivation Theory. In Human Motivation and Interpersonal Relationships: Theory, Research, and Applications. Springer, Dordrecht, Netherlands, 53--73.",
      "doi": ""
    },
    {
      "text": "Alena Denisova and Eliott Cook. 2019. Power-Ups in Digital Games: The Rewarding Effect of Phantom Game Elements on Player Experience. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 161--168. DOI: http://dx.doi.org/10.1145/3311350.3347173",
      "doi": "10.1145/3311350.3347173"
    },
    {
      "text": "Alena Denisova, A. Imran Nordin, and Paul Cairns. 2016. The Convergence of Player Experience Questionnaires. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 33--37. DOI: http://dx.doi.org/10.1145/2967934.2968095",
      "doi": "10.1145/2967934.2968095"
    },
    {
      "text": "Paul Denny, Fiona McDonald, Ruth Empson, Philip Kelly, and Andrew Petersen. 2018. Empirical Support for a Causal Relationship Between Gamification and Learning Outcomes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 311, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173885",
      "doi": "10.1145/3173574.3173885"
    },
    {
      "text": "Ansgar E. Depping, Colby Johanson, and Regan L. Mandryk. 2018. Designing for Friendship: Modeling Properties of Play, In-Game Social Capital, and Psychological Well-being. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 87--100. DOI: http://dx.doi.org/10.1145/3242671.3242702",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping and Regan L. Mandryk. 2017a. Cooperation and Interdependence: How Multiplayer Games Increase Social Closeness. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 449--461. DOI: http://dx.doi.org/10.1145/3116595.3116639",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping and Regan L. Mandryk. 2017b. Why is This Happening to Me?: How Player Attribution Can Broaden Our Understanding of Player Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1040--1052. DOI: http://dx.doi.org/10.1145/3025453.3025648",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping, Regan L. Mandryk, Colby Johanson, Jason T. Bowey, and Shelby C. Thomson. 2016a. Trust Me: Social Games Are Better Than Social Icebreakers at Building Trust. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 116--129. DOI: http://dx.doi.org/10.1145/2967934.2968097",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping, Regan L. Mandryk, Chengzhao Li, Carl Gutwin, and Rodrigo Vicencio-Moreira. 2016b. How Disclosing Skill Assistance Affects Play Experience in a Multiplayer First-Person Shooter Game. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3462--3472. DOI: http://dx.doi.org/10.1145/2858036.2858156",
      "doi": "10.1145/2858036.2858156"
    },
    {
      "text": "Sebastian Deterding. 2016. Contextual Autonomy Support in Video Game Play: A Grounded Theory. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3931--3943. DOI: http://dx.doi.org/10.1145/2858036.2858395",
      "doi": "10.1145/2858036.2858395"
    },
    {
      "text": "Sebastian Deterding. 2015. The lens of intrinsic skill atoms: A method for gameful design. Human--Computer Interaction 30, 3--4 (2015), 294--335. DOI: http://dx.doi.org/10.1080/07370024.2014.993471",
      "doi": ""
    },
    {
      "text": "Gabriella Dodero, Rosella Gennari, Alessandra Melonio, and Santina Torello. 2014. Towards Tangible Gamified Co-design at School: Two Studies in Primary Schools. In Proceedings of the 2014 Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 77--86. DOI: http://dx.doi.org/10.1145/2658537.2658688",
      "doi": "10.1145/2658537.2658688"
    },
    {
      "text": "Ignacio X. Domínguez, Rogelio E. Cardona-Rivera, James K. Vance, and David L. Roberts. 2016. The Mimesis Effect: The Effect of Roles on Player Choice in Interactive Narrative Role-Playing Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3438--3449. DOI: http://dx.doi.org/10.1145/2858036.2858141",
      "doi": ""
    },
    {
      "text": "Jemma Edmunds, Nikos Ntoumanis, and Joan L Duda. 2007. Adherence and Well-Being in Overweight and Obese Patients Referred to an Exercise on Prescription Scheme: A Self-Determination Theory Perspective. Psychology of Sport and Exercise 8, 5 (2007), 722--740.",
      "doi": ""
    },
    {
      "text": "Katharina Emmerich and Maic Masuch. 2016. The Influence of Virtual Agents on Player Experience and Performance. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 10--21. DOI: http://dx.doi.org/10.1145/2967934.2968092",
      "doi": "10.1145/2967934.2968092"
    },
    {
      "text": "Katharina Emmerich and Maic Masuch. 2017. The Impact of Game Patterns on Player Experience and Social Interaction in Co-Located Multiplayer Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 411--422. DOI: http://dx.doi.org/10.1145/3116595.3116606",
      "doi": "10.1145/3116595.3116606"
    },
    {
      "text": "Sebastian S. Feger, Sünje Dallmeier-Tiessen, Pawel W. Wo?niak, and Albrecht Schmidt. 2019. Gamification in Science: A Study of Requirements in the Context of Reproducible Research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 460, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300690",
      "doi": "10.1145/3290605.3300690"
    },
    {
      "text": "Zachary Fitz-Walter, Peta Wyeth, Dian Tjondronegoro, and Daniel Johnson. 2014. Exploring the Effect of Achievements on Students Attending University Orientation. In Proceedings of the 2014 Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 87--96. DOI: http://dx.doi.org/10.1145/2658537.2658700",
      "doi": "10.1145/2658537.2658700"
    },
    {
      "text": "Kathrin Maria Gerling, Regan L. Mandryk, Max Valentin Birk, Matthew Miller, and Rita Orji. 2014a. The Effects of Embodied Persuasive Games on Player Attitudes Toward People Using Wheelchairs. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3413--3422. DOI: http://dx.doi.org/10.1145/2556288.2556962",
      "doi": "10.1145/2556288.2556962"
    },
    {
      "text": "Kathrin M. Gerling, Regan L. Mandryk, and Conor Linehan. 2015. Long-Term Use of Motion-Based Video Games in Care Home Settings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1573--1582. DOI: http://dx.doi.org/10.1145/2702123.2702125",
      "doi": "10.1145/2702123.2702125"
    },
    {
      "text": "Kathrin Maria Gerling, Matthew Miller, Regan L. Mandryk, Max Valentin Birk, and Jan David Smeddinck. 2014b. Effects of Balancing for Physical Abilities on Player Performance, Experience and Self-esteem in Exergames. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2201--2210. DOI: http://dx.doi.org/10.1145/2556288.2556963",
      "doi": "10.1145/2556288.2556963"
    },
    {
      "text": "Nicolas Gillet, Jacques Forest, Charles Benabou, and Kathleen Bentein. 2015. The Effects of Organizational Factors, Psychological Need Satisfaction and Thwarting, and Affective Commitment on Workers' Well-Being and Turnover Intentions. Le Travail Humain 78, 2 (2015), 119--140.",
      "doi": ""
    },
    {
      "text": "Antti Granqvist, Tapio Takala, Jari Takatalo, and Perttu Hämäläinen. 2018. Exaggeration of Avatar Flexibility in Virtual Reality. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 201--209. DOI: http://dx.doi.org/10.1145/3242671.3242694",
      "doi": "10.1145/3242671.3242694"
    },
    {
      "text": "Christian Guckelsberger, Christoph Salge, Jeremy Gow, and Paul Cairns. 2017. Predicting Player Experience Without the Player.: An Exploratory Study. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 305--315. DOI: http://dx.doi.org/10.1145/3116595.3116631",
      "doi": "10.1145/3116595.3116631"
    },
    {
      "text": "Carl Gutwin, Christianne Rooke, Andy Cockburn, Regan L. Mandryk, and Benjamin Lafreniere. 2016a. Peak-End Effects on Player Experience in Casual Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5608--5619. DOI: http://dx.doi.org/10.1145/2858036.2858419",
      "doi": "10.1145/2858036.2858419"
    },
    {
      "text": "Carl Gutwin, Rodrigo Vicencio-Moreira, and Regan L. Mandryk. 2016b. Does Helping Hurt?: Aiming Assistance and Skill Development in a First-Person Shooter Game. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 338--349. DOI: http://dx.doi.org/10.1145/2967934.2968101",
      "doi": ""
    },
    {
      "text": "Leen Haerens, Nathalie Aelterman, Maarten Vansteenkiste, Bart Soenens, and Stijn Van Petegem. 2015. Do Perceived Autonomy-Supportive and Controlling Teaching Relate to Physical Education Students' Motivational Experiences Through Unique Pathways? Distinguishing Between the Bright and Dark Side of Motivation. Psychology of Sport and Exercise 16, 3 (2015), 26--36.",
      "doi": ""
    },
    {
      "text": "Joshua V. Hall, Peta A. Wyeth, and Daniel Johnson. 2014. Instructional Objectives to Core-gameplay: A Serious Game Design Technique. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 121--130. DOI: http://dx.doi.org/10.1145/2658537.2658696",
      "doi": "10.1145/2658537.2658696"
    },
    {
      "text": "Stuart Hallifax, Audrey Serna, Jean-Charles Marty, Guillaume Lavoué, and Elise Lavoué. 2019. Factors to Consider for Tailored Gamification. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 559--572. DOI: http://dx.doi.org/10.1145/3311350.3347167",
      "doi": "10.1145/3311350.3347167"
    },
    {
      "text": "Juho Hamari and Jonna Koivisto. 2014. Measuring flow in gamification: Dispositional flow scale-2. Computers in Human Behavior 40 (2014), 133--143. DOI: http://dx.doi.org/10.1016/j.chb.2014.07.048",
      "doi": "10.1016/j.chb.2014.07.048"
    },
    {
      "text": "Erik Harpstead, Thomas Zimmermann, Nachiappan Nagappan, Jose J. Guajardo, Ryan Cooper, Tyson Solberg, and Dan Greenawalt. 2015. What Drives People: Creating Engagement Profiles of Players from Game Log Data. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, 369--379.",
      "doi": "10.1145/2793107.2793114"
    },
    {
      "text": "John Harris and Mark Hancock. 2019. To Asymmetry and Beyond!: Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 9, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300239",
      "doi": "10.1145/3290605.3300239"
    },
    {
      "text": "Casper Harteveld and Steven C. Sutherland. 2015. The Goal of Scoring: Exploring the Role of Game Performance in Educational Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2235--2244. DOI: http://dx.doi.org/10.1145/2702123.2702606",
      "doi": ""
    },
    {
      "text": "Kieran Hicks, Kathrin Gerling, Patrick Dickinson, and Vero Vanden Abeele. 2019. Juicy Game Design: Understanding the Impact of Visual Embellishments on Player Experience. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 185--197. DOI: http://dx.doi.org/10.1145/3311350.3347171",
      "doi": "10.1145/3311350.3347171"
    },
    {
      "text": "Kieran Hicks, Kathrin Gerling, Ben Kirman, Conor Linehan, and Patrick Dickinson. 2015. Exploring Twitter As a Game Platform; Strategies and Opportunities for Microblogging-based Games. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 151--161. DOI: http://dx.doi.org/10.1145/2793107.2793119",
      "doi": "10.1145/2793107.2793119"
    },
    {
      "text": "Celia Hodent. 2017. The Gamer's Brain: How Neuroscience and UX Can Impact Video Game Design. CRC Press.",
      "doi": ""
    },
    {
      "text": "Christos Ioannou, Patrick Archard, Eamonn O'Neill, and Christof Lutteroth. 2019. Virtual Performance Augmentation in an Immersive Jump & Run Exergame. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 158, 15 pages. DOI: http://dx.doi.org/10.1145/3290605.3300388",
      "doi": "10.1145/3290605.3300388"
    },
    {
      "text": "Colby Johanson, Carl Gutwin, Jason T. Bowey, and Regan L. Mandryk. 2019. Press Pause when you Play: Comparing Spaced Practice Intervals for Skill Development in Games. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 169--184. DOI: http://dx.doi.org/10.1145/3311350.3347195",
      "doi": ""
    },
    {
      "text": "Colby Johanson and Regan L. Mandryk. 2016. Scaffolding Player Location Awareness Through Audio Cues in First-Person Shooters. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3450--3461. DOI: http://dx.doi.org/10.1145/2858036.2858172",
      "doi": ""
    },
    {
      "text": "Daniel Johnson, Lennart E. Nacke, and Peta Wyeth. 2015. All About That Base: Differing Player Experiences in Video Game Genres and the Unique Case of MOBA Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2265--2274. DOI: http://dx.doi.org/10.1145/2702123.2702447",
      "doi": "10.1145/2702123.2702447"
    },
    {
      "text": "Daniel Johnson, Christopher Watling, John Gardner, and Lennart E. Nacke. 2014. The Edge of Glory: The Relationship Between Metacritic Scores and Player Experience. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 141--150. DOI: http://dx.doi.org/10.1145/2658537.2658694",
      "doi": ""
    },
    {
      "text": "Daniel Johnson, Peta Wyeth, Madison Clark, and Christopher Watling. 2015. Cooperative Game Play with Avatars and Agents: Differences in Brain Activity and the Experience of Play. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3721--3730. DOI: http://dx.doi.org/10.1145/2702123.2702468",
      "doi": "10.1145/2702123.2702468"
    },
    {
      "text": "Daniel Johnson and John Gardner. 2010. Personality, Motivation and Video Games. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction. ACM, 276--279. DOI: http://dx.doi.org/10.1145/1952222.1952281",
      "doi": "10.1145/1952222.1952281"
    },
    {
      "text": "Daniel Johnson, M John Gardner, and Ryan Perry. 2018. Validation of two game experience scales: the player experience of need satisfaction (PENS) and game experience questionnaire (GEQ). International Journal of Human-Computer Studies 118 (2018), 38--46. DOI: http://dx.doi.org/10.1016/j.ijhcs.2018.05.003",
      "doi": ""
    },
    {
      "text": "Raine Kajastila, Leo Holsti, and Perttu Hämäläinen. 2016. The Augmented Climbing Wall: High-Exertion Proximity Interaction on a Wall-Sized Interactive Surface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 758--769. DOI: http://dx.doi.org/10.1145/2858036.2858450",
      "doi": "10.1145/2858036.2858450"
    },
    {
      "text": "Dominic Kao and D. Fox Harrell. 2018. The Effects of Badges and Avatar Identification on Play and Making in Educational Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 600, 19 pages. DOI: http://dx.doi.org/10.1145/3173574.3174174",
      "doi": ""
    },
    {
      "text": "Maximus D. Kaos, Ryan E. Rhodes, Perttu Hämäläinen, and T.C. Nicholas Graham. 2019. Social Play in an Exergame: How the Need to Belong Predicts Adherence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 430, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300660",
      "doi": ""
    },
    {
      "text": "Dennis L. Kappen, Pejman Mirza-Babaei, and Lennart E. Nacke. 2017. Gamification Through the Application of Motivational Affordances for Physical Activity Technology. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 5--18. DOI: http://dx.doi.org/10.1145/3116595.3116604",
      "doi": "10.1145/3116595.3116604"
    },
    {
      "text": "Madison Klarkowski, Daniel Johnson, Peta Wyeth, Mitchell McEwan, Cody Phillips, and Simon Smith. 2016. Operationalising and Evaluating Sub-Optimal and Optimal Play Experiences Through Challenge-Skill Manipulation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5583--5594. DOI: http://dx.doi.org/10.1145/2858036.2858563",
      "doi": "10.1145/2858036.2858563"
    },
    {
      "text": "Jeppe Komulainen, Jari Takatalo, Miikka Lehtonen, and Göte Nyman. 2008. Psychologically Structured Approach to User Experience in Games. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, NY, NY, USA, 487--490. DOI: http://dx.doi.org/10.1145/1463160.1463226",
      "doi": "10.1145/1463160.1463226"
    },
    {
      "text": "Yubo Kou, Yao Li, Xinning Gui, and Eli Suzuki-Gill. 2018. Playing with Streakiness in Online Games: How Players Perceive and React to Winning and Losing Streaks in League of Legends. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 578, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3174152",
      "doi": "10.1145/3173574.3174152"
    },
    {
      "text": "Andrey Krekhov, Sebastian Cmentowski, Katharina Emmerich, and Jens Krüger. 2019. Beyond Human: Animals as an Escape from Stereotype Avatars in Virtual Reality Games. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 439--451. DOI: http://dx.doi.org/10.1145/3311350.3347172",
      "doi": "10.1145/3311350.3347172"
    },
    {
      "text": "Andrey Krekhov, Katharina Emmerich, Philipp Bergmann, Sebastian Cmentowski, and Jens Krüger. 2017. Self-Transforming Controllers for Virtual Reality First Person Shooters. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 517--529. DOI: http://dx.doi.org/10.1145/3116595.3116615",
      "doi": "10.1145/3116595.3116615"
    },
    {
      "text": "Shringi Kumari, Sebastian Deterding, and Jonathan Freeman. 2019. The Role of Uncertainty in Moment-to-Moment Player Motivation: A Grounded Theory. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 351--363. DOI: http://dx.doi.org/10.1145/3311350.3347148",
      "doi": "10.1145/3311350.3347148"
    },
    {
      "text": "Marc-André K Lafrenière, Jérémie Verner-Filion, and Robert J Vallerand. 2012. Development and validation of the Gaming Motivation Scale (GAMS). Personality and individual differences 53, 7 (2012), 827--831. DOI: http://dx.doi.org/10.1016/j.paid.2012.06.013",
      "doi": ""
    },
    {
      "text": "Carine Lallemand, Vincent Koenig, and Guillaume Gronier. 2014. How Relevant is an Expert Evaluation of User Experience Based on a Psychological Needs-driven Approach?. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 11--20. DOI: http://dx.doi.org/10.1145/2639189.2639214",
      "doi": "10.1145/2639189.2639214"
    },
    {
      "text": "Effie L.-C. Law, Florian Brühlmann, and Elisa D. Mekler. 2018. Systematic Review and Validation of the Game Experience Questionnaire (GEQ) -- Implications for Citation and Reporting Practice. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, 257--270. DOI: http://dx.doi.org/10.1145/3242671.3242683",
      "doi": ""
    },
    {
      "text": "Lisa Legault and Catherine E. Amiot. 2014. The Role of Autonomy in Intergroup Processes: Toward an Integration of Self-Determination Theory and Intergroup Approaches. In Human Motivation and Interpersonal Relationships: Theory, Research, and Applications. Springer, Dordrecht, Netherlands, 159--190.",
      "doi": ""
    },
    {
      "text": "Lauri Lehtonen, Maximus D. Kaos, Raine Kajastila, Leo Holsti, Janne Karsisto, Sami Pekkola, Joni Vähämäki, Lassi Vapaakallio, and Perttu Hämäläinen. 2019. Movement Empowerment in a Multiplayer Mixed-Reality Trampoline Game. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 19--29. DOI: http://dx.doi.org/10.1145/3311350.3347181",
      "doi": "10.1145/3311350.3347181"
    },
    {
      "text": "Pascal Lessel, Maximilian Altmeyer, and Nicolas Brauner. 2019a. Crowdjump: Investigating A Player-Driven Platform Game. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 149--159. DOI: http://dx.doi.org/10.1145/3311350.3347168",
      "doi": "10.1145/3311350.3347168"
    },
    {
      "text": "Pascal Lessel, Maximilian Altmeyer, Lea Verena Schmeer, and Antonio Krüger. 2019b. \"Enable or Disable Gamification?\" Analyzing the Impact of Choice in a Gamified Image Tagging Task. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 150, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300380",
      "doi": "10.1145/3290605.3300380"
    },
    {
      "text": "Jingya Li, Erik D. van der Spek, Jun Hu, and Loe Feijs. 2019. Turning Your Book into a Game: Improving Motivation through Tangible Interaction and Diegetic Feedback in an AR Mathematics Game for Children. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 73--85. DOI: http://dx.doi.org/10.1145/3311350.3347174",
      "doi": ""
    },
    {
      "text": "Derek Lomas, Kishan Patel, Jodi L. Forlizzi, and Kenneth R. Koedinger. 2013. Optimizing Challenge in an Educational Game Using Large-scale Design Experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 89--98. DOI: http://dx.doi.org/10.1145/2470654.2470668",
      "doi": ""
    },
    {
      "text": "J. Derek Lomas, Kenneth Koedinger, Nirmal Patel, Sharan Shodhan, Nikhil Poonwala, and Jodi L. Forlizzi. 2017. Is Difficulty Overrated?: The Effects of Choice, Novelty and Suspense on Intrinsic Motivation in Educational Games. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1028--1039. DOI: http://dx.doi.org/10.1145/3025453.3025638",
      "doi": ""
    },
    {
      "text": "Michael Long and Carl Gutwin. 2018. Characterizing and Modeling the Effects of Local Latency on Game Performance and Experience. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 285--297. DOI: http://dx.doi.org/10.1145/3242671.3242678",
      "doi": "10.1145/3242671.3242678"
    },
    {
      "text": "Michael Long and Carl Gutwin. 2019. Effects of Local Latency on Game Pointing Devices and Game Pointing Tasks. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 208, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300438",
      "doi": "10.1145/3290605.3300438"
    },
    {
      "text": "Kevin Loughrey and Daire Broin. 2018. Are We Having Fun Yet? Misapplying Motivation to Gamification. In 2018 IEEE Games, Entertainment, Media Conference (GEM). IEEE, 1--9. DOI: http://dx.doi.org/10.1109/GEM.2018.8516535",
      "doi": ""
    },
    {
      "text": "Thomas Malone. 1981. What Makes Computer Games Fun?. In Proceedings of the Joint Conference on Easier and More Productive Use of Computer Systems. (Part II): Human Interface and the User Interface - Volume 1981 (CHI '81). ACM, NY, NY, USA, 143--. DOI: http://dx.doi.org/10.1145/800276.810990",
      "doi": "10.1145/800276.810990"
    },
    {
      "text": "David Markland and David K Ingledew. 1997. The measurement of exercise motives: Factorial validity and invariance across gender of a revised Exercise Motivations Inventory. British Journal of Health Psychology 2, 4 (1997), 361--376. DOI: http://dx.doi.org/10.1111/j.2044--8287.1997.tb00549",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Luis Márquez Segura, and David López Recio. 2016. Playification: The PhySeEar Case. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 376--388. DOI: http://dx.doi.org/10.1145/2967934.2968099",
      "doi": "10.1145/2967934.2968099"
    },
    {
      "text": "Joe Marshall and Conor Linehan. 2017. Misrepresentation of Health Research in Exertion Games Literature. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4899--4910. DOI: http://dx.doi.org/10.1145/3025453.3025691",
      "doi": "10.1145/3025453.3025691"
    },
    {
      "text": "Joe Marshall, Conor Linehan, Jocelyn Spence, and Stefan Rennick Egglestone. 2017. Throwaway Citation of Prior Work Creates Risk of Bad HCI Research. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 827--836. DOI: http://dx.doi.org/10.1145/3027063.3052751",
      "doi": "10.1145/3027063.3052751"
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1 (1989), 48--58.",
      "doi": ""
    },
    {
      "text": "Mitchell W. McEwan, Alethea L. Blackler, Daniel M. Johnson, and Peta A. Wyeth. 2014. Natural Mapping and Intuitive Interaction in Videogames. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 191--200. DOI: http://dx.doi.org/10.1145/2658537.2658541",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Julia Ayumi Bopp, Alexandre N. Tuch, and Klaus Opwis. 2014. A Systematic Review of Quantitative Studies on the Enjoyment of Digital Entertainment Games. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 927--936. DOI: http://dx.doi.org/10.1145/2556288.2557078",
      "doi": "10.1145/2556288.2557078"
    },
    {
      "text": "Elisa D Mekler, Florian Brühlmann, Alexandre N Tuch, and Klaus Opwis. 2017. Towards understanding the effects of individual gamification elements on intrinsic motivation and performance. Computers in Human Behavior 71 (2017), 525--534. DOI: http://dx.doi.org/10.1016/j.chb.2015.08.048",
      "doi": "10.1016/j.chb.2015.08.048"
    },
    {
      "text": "David Melhart, Ahmad Azadvar, Alessandro Canossa, Antonios Liapis, and Georgios N Yannakakis. 2019. Your Gameplay Says it All: Modelling Motivation in Tom Clancy's The Division. arXiv preprint arXiv:1902.00040 (2019).",
      "doi": ""
    },
    {
      "text": "Ann Morrison, Antti Oulasvirta, Peter Peltonen, Saija Lemmela, Giulio Jacucci, Gerhard Reitmayr, Jaana Näsänen, and Antti Juustila. 2009. Like Bees Around the Hive: A Comparative Study of a Mobile Augmented Reality Map. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1889--1898. DOI: http://dx.doi.org/10.1145/1518701.1518991",
      "doi": "10.1145/1518701.1518991"
    },
    {
      "text": "Jeanne Nakamura and Mihaly Csikszentmihalyi. 2014. The concept of flow. In Flow and the foundations of positive psychology. Springer, 239--263. DOI: http://dx.doi.org/10.1007/978--94-017--9088--8_16",
      "doi": ""
    },
    {
      "text": "Joyce LD Neys, Jeroen Jansz, and Ed SH Tan. 2014. Exploring persistence in gaming: The role of self-determination and social identity. Computers in Human Behavior 37 (2014), 196--209. DOI: http://dx.doi.org/10.1016/j.chb.2014.04.047",
      "doi": "10.1016/j.chb.2014.04.047"
    },
    {
      "text": "Rita Orji, Gustavo F. Tondello, and Lennart E. Nacke. 2018. Personalizing Persuasive Strategies in Gameful Systems to Gamification User Types. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 435, 14 pages. DOI: http://dx.doi.org/10.1145/3173574.3174009",
      "doi": ""
    },
    {
      "text": "Pierre-Yves Oudeyer and Frederic Kaplan. 2009. What is intrinsic motivation? A typology of computational approaches. Frontiers in Neurorobotics 1 (2009), 6. DOI: http://dx.doi.org/10.3389/neuro.12.006.2007",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2016. HCI Research As Problem-Solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4956--4967. DOI: http://dx.doi.org/10.1145/2858036.2858283",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "Maria V. Palacin-Silva, Antti Knutas, Maria Angela Ferrario, Jari Porras, Jouni Ikonen, and Chandara Chea. 2018. The Role of Gamification in Participatory Environmental Sensing: A Study In the Wild. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 221, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173795",
      "doi": "10.1145/3173574.3173795"
    },
    {
      "text": "Luc G Pelletier, Michelle S Fortier, Robert J Vallerand, and Nathalie M Briere. 2001. Associations Among Perceived Autonomy Support, Forms of Self-Regulation, and Persistence: A Prospective Study. Motivation and Emotion 25, 4 (2001), 279--306.",
      "doi": ""
    },
    {
      "text": "Wei Peng, Jih-Hsuan Lin, Karin A Pfeiffer, and Brian Winn. 2012. Need satisfaction supportive game features as motivational determinants: An experimental study of a self-determination theory guided exergame. Media Psychology 15, 2 (2012), 175--196. DOI: http://dx.doi.org/15213269.2012.673850",
      "doi": ""
    },
    {
      "text": "Dorian Peters, Rafael A Calvo, and Richard M Ryan. 2018. Designing for motivation, engagement and wellbeing in digital experience. Frontiers in psychology 9 (2018), 797. DOI: http://dx.doi.org/10.3389/fpsyg.2018.00797",
      "doi": ""
    },
    {
      "text": "Serge Petralito, Florian Brühlmann, Glena Iten, Elisa D. Mekler, and Klaus Opwis. 2017. A Good Reason to Die: How Avatar Death and High Challenges Enable Positive Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5087--5097. DOI: http://dx.doi.org/10.1145/3025453.3026047",
      "doi": "10.1145/3025453.3026047"
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2018. Towards Deep Player Behavior Models in MMORPGs. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 381--392. DOI: http://dx.doi.org/10.1145/3242671.3242706",
      "doi": "10.1145/3242671.3242706"
    },
    {
      "text": "Cody Phillips, Daniel Johnson, Madison Klarkowski, Melanie Jade White, and Leanne Hides. 2018. The Impact of Rewards and Trait Reward Responsiveness on Player Motivation. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 393--404. DOI: http://dx.doi.org/10.1145/3242671.3242713",
      "doi": "10.1145/3242671.3242713"
    },
    {
      "text": "Clément Pillias, Raphaël Robert-Bouchard, and Guillaume Levieux. 2014. Designing Tangible Video Games: Lessons Learned from the Sifteo Cubes. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3163--3166. DOI: http://dx.doi.org/10.1145/2556288.2556991",
      "doi": "10.1145/2556288.2556991"
    },
    {
      "text": "Susanne Poeller, Max V. Birk, Nicola Baumann, and Regan L. Mandryk. 2018. Let Me Be Implicit: Using Motive Disposition Theory to Predict and Explain Behaviour in Digital Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 190, 15 pages. DOI: http://dx.doi.org/10.1145/3173574.3173764",
      "doi": ""
    },
    {
      "text": "Lev Poretski, Ofer Arazy, Joel Lanir, Shalev Shahar, and Oded Nov. 2019. Virtual Objects in the Physical World: Relatedness and Psychological Ownership in Augmented Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 691, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300921",
      "doi": "10.1145/3290605.3300921"
    },
    {
      "text": "Andrew K Przybylski, Edward L Deci, C Scott Rigby, and Richard M Ryan. 2014. Competence-Impeding Electronic Games and Players' Aggressive Feelings, Thoughts, and Behaviors. Journal of Personality and Social Psychology 106, 3 (2014), 441--457.",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, C. Scott Rigby, and Richard M. Ryan. 2010. A Motivational Model of Video Game Engagement. Review of General Psychology 14, 2 (2010), 154--166.",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski and Netta Weinstein. 2019. Investigating the Motivational and Psychosocial Dynamics of Dysregulated Gaming: Evidence From a Preregistered Cohort Study. Clinical Psychological Science (2019), 1--9.",
      "doi": ""
    },
    {
      "text": "Anke V. Reinschluessel and Regan L. Mandryk. 2016. Using Positive or Negative Reinforcement in Neurofeedback Games for Training Self-Regulation. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 186--198. DOI: http://dx.doi.org/10.1145/2967934.2968085",
      "doi": ""
    },
    {
      "text": "Chad Richards, Craig W. Thompson, and Nicholas Graham. 2014. Beyond Designing for Motivation: The Importance of Context in Gamification. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 217--226. DOI: http://dx.doi.org/10.1145/2658537.2658683",
      "doi": "10.1145/2658537.2658683"
    },
    {
      "text": "Caroline R Richardson, Lorraine R Buis, Adrienne W Janney, David E Goodrich, Ananda Sen, Michael L Hess, Kathleen S Mehari, Laurie A Fortlage, Paul J Resnick, Brian J Zikmund-Fisher, and others. 2010. An online community improves adherence in an internet-mediated walking program. Part 1: results of a randomized controlled trial. Journal of medical Internet research 12, 4 (2010), e71. DOI: http://dx.doi.org/10.2196/jmir.1338",
      "doi": ""
    },
    {
      "text": "C Scott Rigby. 2015. Gamification and motivation. The gameful world: Approaches, issues, applications (2015), 113--138.",
      "doi": ""
    },
    {
      "text": "C. Scott Rigby and Richard M. Ryan. 2007. The Player Experience of Need Satisfaction (PENS): An Applied Model and Methodology for Understanding Key Components of the Player Experience. White Paper. (2007). Immersyve, Inc., Florida, USA. Retrieved 26 August, 2019 from http://immersyve.com/download/ pens-white-paper/?wpdmdl=8283.",
      "doi": ""
    },
    {
      "text": "C. Scott Rigby and Richard M. Ryan. 2017. Time Well-Spent? Motivation for Entertainment Media and Its Eudaimonic Aspects Through the Lens of Self-Determination Theory. Routledge, New York, USA, 34--48.",
      "doi": ""
    },
    {
      "text": "Scott Rigby and Richard M. Ryan. 2011. Glued to Games: How Video Games Draw Us In and Hold Us Spellbound. ABC-CLIO, Santa Barbara, CA.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2012. HCI theory: classical, modern, and contemporary. Synthesis lectures on human-centered informatics 5, 2 (2012), 1--129.",
      "doi": ""
    },
    {
      "text": "Shaghayegh Roohi, Jari Takatalo, Christian Guckelsberger, and Perttu Hämäläinen. 2018. Review of Intrinsic Motivation in Simulation-based Game Testing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 347, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173921",
      "doi": "10.1145/3173574.3173921"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2015. Pass the Ball: Enforced Turn-Taking in Activity Tracking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2417--2426. DOI: http://dx.doi.org/10.1145/2702123.2702577",
      "doi": "10.1145/2702123.2702577"
    },
    {
      "text": "Richard M. Ryan, Randall R. Curren, and Edward L. Deci. 2013. What Humans Need: Flourishing in Aristotelian Philosophy and Self-Determination Theory. American Psychological Association, Washington, DC, 57--75. DOI: http://dx.doi.org/10.1037/14092-004",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. Contemporary Educational Psychology 25, 1 (2000), 54--67. DOI: http://dx.doi.org/10.1006/ceps.1999.1020",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2017a. Basic Psychological Needs Theory: Satisfaction and Frustration of Autonomy, Competence, and Relatedness in Relation to Psychological Wellness and Full Functioning. In Self-determination theory: Basic psychological needs in motivation, development, and wellness. Guilford Publications, 239--271.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2017b. Goal Contents Theory: Aspirations, Life Goals, and Their Varied Consequences. In Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness. Guilford, New York, USA, 272--292.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2017c. Motivation and Need Satisfaction in Video Games and Virtual Environments. In Self-determination theory: Basic psychological needs in motivation, development, and wellness. Guilford Publications, 508--531.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2017d. Organismic Integration Theory: Internalisation and the Differentiation of Extrinsic Motivation. In Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness. Guilford, New York, USA, 179--215.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2017e. Relationships Motivation Theory: The Self in Close Relationships. In Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness. Guilford, New York, USA, 293--316.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2017f. Self-determination theory: Basic psychological needs in motivation, development, and wellness. Guilford Publications.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2017g. Self-Determination Theory An Introduction and Overview. In Self-determination theory: Basic psychological needs in motivation, development, and wellness. Guilford Publications, 3--29.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2019. Brick by Brick: The Origins, Development, and Future of Self-Determination Theory. In Advances in Motivation Science. Elsevier, 111--156.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (2006), 344--360. DOI: http://dx.doi.org/10.1007/s11031-006--9051--8",
      "doi": "10.1007/s11031-006-9051-8"
    },
    {
      "text": "Michael Sailer, Jan Ulrich Hense, Sarah Katharina Mayr, and Heinz Mandl. 2017. How gamification motivates: An experimental study of the effects of specific game design elements on psychological need satisfaction. Computers in Human Behavior 69 (2017), 371--380. DOI: http://dx.doi.org/10.1016/j.chb.2016.12.033",
      "doi": "10.1016/j.chb.2016.12.033"
    },
    {
      "text": "Anurag Sarkar and Seth Cooper. 2019. Transforming Game Difficulty Curves Using Function Composition. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 551, 7 pages. DOI: http://dx.doi.org/10.1145/3290605.3300781",
      "doi": "10.1145/3290605.3300781"
    },
    {
      "text": "Katie Seaborn and Deborah I Fels. 2015. Gamification in theory and action: A survey. International Journal of human-computer studies 74 (2015), 14--31. DOI: http://dx.doi.org/10.1016/j.ijhcs.2014.09.006",
      "doi": "10.1016/j.ijhcs.2014.09.006"
    },
    {
      "text": "Orit Shaer, Lauren Westendorf, Nicholas A. Knouf, and Claudia Pederson. 2017. Understanding Gaming Perceptions and Experiences in a Women's College Community. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 1544--1557. DOI: http://dx.doi.org/10.1145/3025453.3025623",
      "doi": "10.1145/3025453.3025623"
    },
    {
      "text": "Kennon M Sheldon. 2011. Integrating behavioral-motive and experiential-requirement perspectives on psychological needs: A two process model. Psychological review 118, 4 (2011), 552. DOI: http://dx.doi.org/10.1037/a0024758",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon and Alexander Gunz. 2009. Psychological Needs as Basic Motives, Not Just Experiential Requirements. Journal of Personality 77, 5 (2009), 1467--1492. DOI: http://dx.doi.org/10.1111/j.1467--6494.2009.00589.x",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon and Jonathan C. Hilpert. 2012. The Balanced Measure of Psychological Needs (BMPN) Scale: An Alternative Domain General Measure of Need Satisfaction. Motivation and Emotion 36, 4 (2012), 439--451.",
      "doi": ""
    },
    {
      "text": "Jan D. Smeddinck, Regan L. Mandryk, Max V. Birk, Kathrin M. Gerling, Dietrich Barsilowski, and Rainer Malaka. 2016. How to Present Game Difficulty Choices?: Exploring the Impact on Player Experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5595--5607. DOI: http://dx.doi.org/10.1145/2858036.2858574",
      "doi": "10.1145/2858036.2858574"
    },
    {
      "text": "Milad Soroush, Mark Hancock, and Vanessa K. Bohns. 2018. Investigating Game Mechanics That Target Players' Self-Control While Maintaining Engagement. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 489--502. DOI: http://dx.doi.org/10.1145/3242671.3242698",
      "doi": ""
    },
    {
      "text": "Fabius Steinberger, Ronald Schroeter, Marcus Foth, and Daniel Johnson. 2017. Designing Gamified Applications That Make Safe Driving More Engaging. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2826--2839. DOI: http://dx.doi.org/10.1145/3025453.3025511",
      "doi": "10.1145/3025453.3025511"
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: A Model for Evaluating Player Enjoyment in Games. Comput. Entertain. 3, 3 (July 2005), 3--3. DOI: http://dx.doi.org/10.1145/1077246.1077253",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Ron Tamborini, Nicholas David Bowman, Allison Eden, Matthew Grizzard, and Ashley Organ. 2010. Defining Media Enjoyment as the Satisfaction of Intrinsic Needs. Journal of Communication 60, 4 (2010), 758--777.",
      "doi": ""
    },
    {
      "text": "Gustavo F. Tondello and Lennart E. Nacke. 2019. Player Characteristics and Video Game Preferences. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 365--378. DOI: http://dx.doi.org/10.1145/3311350.3347185",
      "doi": ""
    },
    {
      "text": "Gustavo F. Tondello, Rina R. Wehbe, Lisa Diamond, Marc Busch, Andrzej Marczewski, and Lennart E. Nacke. 2016. The Gamification User Types Hexad Scale. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 229--243. DOI: http://dx.doi.org/10.1145/2967934.2968082",
      "doi": ""
    },
    {
      "text": "Gustavo F. Tondello, Rina R. Wehbe, Rita Orji, Giovanni Ribeiro, and Lennart E. Nacke. 2017. A Framework and Taxonomy of Videogame Playing Preferences. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 329--340. DOI: http://dx.doi.org/10.1145/3116595.3116629",
      "doi": ""
    },
    {
      "text": "April Tyack, Peta Wyeth, and Daniel Johnson. 2016. The Appeal of MOBA Games: What Makes People Start, Stay, and Stop. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, NY, NY, USA, 313--325. DOI: http://dx.doi.org/10.1145/2967934.2968098",
      "doi": "10.1145/2967934.2968098"
    },
    {
      "text": "April Tyack and Peta Wyeth. 2017. Exploring Relatedness in Single-Player Video Game Play. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. ACM, 422--427.",
      "doi": "10.1145/3152771.3156149"
    },
    {
      "text": "April Tyack, Peta Wyeth, and Daniel Johnson. 2020. Restorative Play: Videogames Improve Player Wellbeing After a Need-Frustrating Event. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM. DOI: http://dx.doi.org/10.1145/3313831.3376332",
      "doi": "10.1145/3313831.3376332"
    },
    {
      "text": "Robert J. Vallerand. 1997. Toward a Hierarchical Model of Intrinsic and Extrinsic Motivation. Advances in Experimental Social Psychology 29 (1997), 271--360.",
      "doi": ""
    },
    {
      "text": "Robert J Vallerand, Luc G Pelletier, and Richard Koestner. 2008. Reflections on self-determination theory. Canadian Psychology/Psychologie canadienne 49, 3 (2008), 257. DOI: http://dx.doi.org/10.1037/a0012804",
      "doi": ""
    },
    {
      "text": "Rob van Roy and Bieke Zaman. 2017. Why gamification fails in education and how to make it successful: introducing nine gamification heuristics based on self-determination theory. In Serious Games and edutainment applications. Springer, 485--509. DOI: http://dx.doi.org/10.1007/978--3--319--51645--5_22",
      "doi": ""
    },
    {
      "text": "Vero Vanden Abeele, Jan Wouters, Pol Ghesquière, Ann Goeleven, and Luc Geurts. 2015. Game-based Assessment of Psycho-acoustic Thresholds: Not All Games Are Equal!. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 331--341. DOI: http://dx.doi.org/10.1145/2793107.2793132",
      "doi": "10.1145/2793107.2793132"
    },
    {
      "text": "Jason VandenBerghe. 2014. Engines of Play: How Player Motivation Changes over Time. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 476--476. DOI: http://dx.doi.org/10.1145/2658537.2677953",
      "doi": "10.1145/2658537.2677953"
    },
    {
      "text": "Maarten Vansteenkiste, Christopher P Niemiec, and Bart Soenens. 2010. The development of the five mini-theories of self-determination theory: An historical overview, emerging trends, and future directions. In The decade ahead: Theoretical perspectives on motivation and achievement. Emerald Group Publishing Limited, 105--165. DOI: http://dx.doi.org/10.1108/S0749--7423(2010)000016A007",
      "doi": ""
    },
    {
      "text": "Maarten Vansteenkiste and Kennon M Sheldon. 2006. There's nothing more practical than a good theory: Integrating motivational interviewing and self-determination theory. British journal of clinical psychology 45, 1 (2006), 63--82. DOI: http://dx.doi.org/10.1348/014466505X34192",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Daniel Johnson, and Leanne Hides. 2015. Playing Alone, Playing With Others: Differences in Player Experience and Indicators of Wellbeing. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 3--12. DOI: http://dx.doi.org/10.1145/2793107.2793118",
      "doi": "10.1145/2793107.2793118"
    },
    {
      "text": "Kellie Vella, Christopher James Koren, and Daniel Johnson. 2017. The Impact of Agency and Familiarity in Cooperative Multiplayer Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, NY, NY, USA, 423--434. DOI: http://dx.doi.org/10.1145/3116595.3116622",
      "doi": "10.1145/3116595.3116622"
    },
    {
      "text": "Kellie Vella, Nikki Peever, Madison Klarkowski, Bernd Ploderer, Jo Mitchell, and Daniel Johnson. 2018. Using Applied Games to Engage mHealth Users: A Case Study of MindMax. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, NY, NY, USA, 511--522. DOI: http://dx.doi.org/10.1145/3242671.3242686",
      "doi": "10.1145/3242671.3242686"
    },
    {
      "text": "Raphael Velt, Steve Benford, and Stuart Reeves. 2017. A Survey of the Trajectories Conceptual Framework: Investigating Theory Use in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2091--2105. DOI: http://dx.doi.org/10.1145/3025453.3026022",
      "doi": "10.1145/3025453.3026022"
    },
    {
      "text": "Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2255--2264. DOI: http://dx.doi.org/10.1145/2702123.2702242",
      "doi": "10.1145/2702123.2702242"
    },
    {
      "text": "Benjamin Walther-Franks, Jan Smeddinck, Peter Szmidt, Andrei Haidu, Michael Beetz, and Rainer Malaka. 2015. Robots, Pancakes, and Computer Games: Designing Serious Games for Robot Imitation Learning. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3623--3632. DOI: http://dx.doi.org/10.1145/2702123.2702552",
      "doi": "10.1145/2702123.2702552"
    },
    {
      "text": "Xuequn Wang, Christoph Schneider, and Joseph S Valacich. 2012. Fine-tuning group collaboration environments: how differences in general causality orientation and performance targets shape interaction and performance. In 2012 45th Hawaii International Conference on System Sciences. IEEE, 553--561. DOI: http://dx.doi.org/10.1109/HICSS.2012.281",
      "doi": "10.1109/HICSS.2012.281"
    },
    {
      "text": "David A Whetten. 1989. What constitutes a theoretical contribution? Academy of management review 14, 4 (1989), 490--495.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Williams, Virginia M Grow, Zachary R Freedman, Richard M Ryan, and Edward L Deci. 1996. Motivational Predictors of Weight Loss and Weight-Loss Maintenance. Journal of Personality and Social Psychology 70, 1 (1996), 115--126.",
      "doi": ""
    },
    {
      "text": "Blake Williford, Matthew Runyon, Josh Cherian, Wayne Li, Julie Linsey, and Tracy Hammond. 2019. A Framework for Motivating Sketching Practice with Sketch-based Gameplay. In Proceedings of the 2019 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '19). ACM, 533--544. DOI: http://dx.doi.org/10.1145/3311350.3347175",
      "doi": "10.1145/3311350.3347175"
    },
    {
      "text": "Jason Wuertz, Max V. Birk, and Scott Bateman. 2019. Healthy Lies: The Effects of Misrepresenting Player Health Data on Experience, Behavior, and Performance. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 319, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300549",
      "doi": "10.1145/3290605.3300549"
    }
  ]
}