{
  "doi": "10.1145/3313831.3376272",
  "title": "Learn with Haptics: Improving Vocabulary Recall with Free-form Digital Annotation on Touchscreen Mobiles",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Mobile vocabulary learning interfaces typically present material only in auditory and visual channels, underutilizing the haptic modality. We explored haptic-integrated learning by adding free-form digital annotation to mobile vocabulary learning interfaces. Through a series of pilot studies, we identified three design factors: annotation mode, presentation sequence, and vibrotactile feedback, that influence recall in haptic-integrated vocabulary interfaces. These factors were then evaluated in a within-subject comparative study using a digital flashcard interface as baseline. Results using a 84-item vocabulary showed that the 'whole word' annotation mode is highly effective, yielding a 24.21% increase in immediate recall scores and a 30.36% increase in the 7-day delayed scores. Effects of presentation sequence and vibrotactile feedback were more transient; they affected the results of immediate tests, but not the delayed tests. We discuss the implications of these factors for designing future mobile learning applications.",
  "authors": [
    {
      "name": "Smitha Sheshadri",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528105",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    },
    {
      "name": "Yang Chen",
      "institution": "National University of Singapore & Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365873",
      "orcid": "missing"
    },
    {
      "name": "Morten Fjeld",
      "institution": "Chalmers University of Technology & University of Bergen, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100571519",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Shirley Agostinho, Sharon Tindall-Ford, Paul Ginns, Steven J Howard, Wayne Leahy, and Fred Paas. 2015. Giving learning a helping hand: finger tracing of temperature graphs on an iPad. Educational Psychology Review 27, 3 (2015), 427--443.",
      "doi": ""
    },
    {
      "text": "Khalid Al Seghayer. 2001. The effect of multimedia annotation modes on L2 vocabulary acquisition: A comparative study. Language Learning & Technology 5, 1 (2001), 202--232.",
      "doi": ""
    },
    {
      "text": "Alan D Baddeley, Neil Thomson, and Mary Buchanan. 1975. Word length and the structure of short-term memory. Journal of verbal learning and verbal behavior 14, 6 (1975), 575--589.",
      "doi": ""
    },
    {
      "text": "Pierre Baraduc, Nicolas Lang, John C Rothwell, and Daniel M Wolpert. 2004. Consolidation of dynamic motor learning is not disrupted by rTMS of primary motor cortex. Current Biology 14, 3 (2004), 252--256.",
      "doi": ""
    },
    {
      "text": "Joe Barcroft. 2006. Can writing a new word detract from learning it? More negative effects of forced output during vocabulary learning. Second Language Research 22, 4 (2006), 487--497.",
      "doi": ""
    },
    {
      "text": "Joe Barcroft. 2007. Effects of word and fragment writing during L2 vocabulary learning. Foreign Language Annals 40, 4 (2007), 713--726.",
      "doi": ""
    },
    {
      "text": "Lawrence W Barsalou. 1999. Perceptual symbol systems. Behavioral and brain sciences 22, 4 (1999), 577--660.",
      "doi": ""
    },
    {
      "text": "Jennifer S Beaudin, Stephen S Intille, Emmanuel Munguia Tapia, Randy Rockinson, and Margaret E Morris. 2007. Context-sensitive microlearning of foreign language vocabulary on a mobile device. In European conference on Ambient intelligence. Springer, 55--72.",
      "doi": ""
    },
    {
      "text": "Stephen Brewster and Lorna M Brown. 2004. Tactons: structured tactile messages for non-visual information display. In Proceedings of the fifth conference on Australasian user interface-Volume 28. Australian Computer Society, Inc., 15--23.",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "Carrie J Cai, Philip J Guo, James Glass, and Robert C Miller. 2014. Wait-learning: leveraging conversational dead time for second language education. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2239--2244.",
      "doi": "10.1145/2559206.2581183"
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 981--992. DOI: http://dx.doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Manuel Carreiras, Margaret Gillon-Dowens, Marta Vergara, and Manuel Perea. 2008. Are vowels and consonants processed differently? Event-related potential evidence with a delayed letter paradigm. Journal of Cognitive Neuroscience 21, 2 (2008), 275--288.",
      "doi": "10.1162/jocn.2008.21023"
    },
    {
      "text": "Ronald Carter. 2012. Vocabulary: Applied linguistic perspectives. Routledge.",
      "doi": ""
    },
    {
      "text": "Chih-Ming Chen and Ching-Ju Chung. 2008. Personalized mobile English vocabulary learning system based on item response theory and learning memory cycle. Computers & Education 51, 2 (2008), 624--645.",
      "doi": "10.1016/j.compedu.2007.06.011"
    },
    {
      "text": "George M Chinnery. 2006. Emerging technologies: Going to the MALL: Mobile assisted language learning. Language learning & technology 10, 1 (2006), 9--16.",
      "doi": ""
    },
    {
      "text": "Youngjun Cho, Andrea Bianchi, Nicolai Marquardt, and Nadia Bianchi-Berthouze. 2016. RealPen: Providing realism in handwriting tasks on touch surfaces using auditory-tactile feedback. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 195--205.",
      "doi": "10.1145/2984511.2984550"
    },
    {
      "text": "Annette MB De Groot and Rineke Keijzer. 2000. What is hard to learn is easy to forget: The roles of word concreteness, cognate status, and word frequency in foreign-language vocabulary learning and forgetting. Language learning 50, 1 (2000), 1--56.",
      "doi": ""
    },
    {
      "text": "Adam K Dubé and Rhonda N McEwen. 2015. Do gestures matter? The implications of using touchscreen devices in mathematics instruction. Learning and Instruction 40 (2015), 89--98.",
      "doi": ""
    },
    {
      "text": "New American Economy. 2017. Demand for Bilingual Workers More than Doubled in 5 years, New Report Shows. (2017). Retrieved September 20, 2019 from https://www.newamericaneconomy.org/press-release/ demand-for-bilingual-workers-more-than-doubled-in-5years-new-report-shows/.",
      "doi": ""
    },
    {
      "text": "Darren Edge, Elly Searle, Kevin Chiu, Jing Zhao, and James A Landay. 2011. MicroMandarin: mobile language learning in context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3169--3178.",
      "doi": "10.1145/1978942.1979413"
    },
    {
      "text": "Mario Enriquez and Karon MacLean. 2008. The role of choice in longitudinal recall of meaningful tactile signals. In 2008 Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 49--56.",
      "doi": "10.1109/HAPTICS.2008.4479913"
    },
    {
      "text": "Ram Frost and Shlomo Dentin. 1992. Reading consonants and guessing vowels: Visual word recognition in Hebrew orthography. In Advances in psychology. Vol. 94. Elsevier, 27--44.",
      "doi": ""
    },
    {
      "text": "Nesta Futurelab, Laura Naismith, Peter Lonsdale, Giasemi Vavoula, Mike Sharples, and Nesta Futurelab Series. 2004. Literature review in mobile technologies and learning. (2004).",
      "doi": ""
    },
    {
      "text": "Arthur M Glenberg, Tiana Gutierrez, Joel R Levin, Sandra Japuntich, and Michael P Kaschak. 2004. Activity and imagined activity can enhance young children's reading comprehension. Journal of educational psychology 96, 3 (2004), 424.",
      "doi": ""
    },
    {
      "text": "Arthur M Glenberg and David A Robertson. 1999. Indexical understanding of instructions. Discourse processes 28, 1 (1999), 1--26.",
      "doi": ""
    },
    {
      "text": "Joachim Grabowski. 2007. The writing superiority effect in the verbal recall of knowledge: Sources and determinants. STUDIES IN WRITING 20 (2007), 165.",
      "doi": ""
    },
    {
      "text": "Heidi Harley. 2017. English words: A linguistic introduction. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Adam Ibrahim, Brandon Huynh, Jonathan Downey, Tobias Höllerer, Dorothy Chun, and John O'Donovan. 2017. ARbis Pictus: a study of language learning with augmented reality. arXiv preprint arXiv:1711.11243 (2017).",
      "doi": ""
    },
    {
      "text": "Linda Jones. 2004. Testing L2 vocabulary recognition and recall using pictorial and written test items. Language Learning & Technology 8, 3 (2004), 122--143.",
      "doi": ""
    },
    {
      "text": "Emmanuel Keuleers and Marc Brysbaert. 2010. Wuggy: A multilingual pseudoword generator. Behavior research methods 42, 3 (2010), 627--633.",
      "doi": ""
    },
    {
      "text": "Zae Myung Kim, Suin Kim, Alice Oh, and Ho-Jin Choi. 2017. An adaptive vocabulary learning application through modeling learner's linguistic proficiency and interests. In 2017 IEEE International Conference on Big Data and Smart Computing (BigComp). IEEE, 434--436.",
      "doi": ""
    },
    {
      "text": "Dejan Kovachev, Yiwei Cao, Ralf Klamma, and Matthias Jarke. 2011. Learn-as-you-go: new ways of cloud-based micro-learning for the mobile web. In International Conference on Web-Based Learning. Springer, 51--61.",
      "doi": "10.1007/978-3-642-25813-8_6"
    },
    {
      "text": "Batia Laufer. 1989. A factor of difficulty in vocabulary learning: Deceptive transparency. AILA review 6, 1 (1989), 10--20.",
      "doi": ""
    },
    {
      "text": "Vladimir I Levenshtein. 1966. Binary codes capable of correcting deletions, insertions, and reversals. In Soviet physics doklady, Vol. 10. 707--710.",
      "doi": ""
    },
    {
      "text": "Joel R Levin. 1981. On functions of pictures in prose. Neuropsychological and cognitive processes in reading 203 (1981).",
      "doi": ""
    },
    {
      "text": "Chih-Cheng Lin and Ya-Chuan Yu. 2017. Effects of presentation modes on mobile-assisted vocabulary learning and cognitive load. Interactive Learning Environments 25, 4 (2017), 528--542.",
      "doi": ""
    },
    {
      "text": "Robert W Lindeman, John L Sibert, and James K Hahn. 1999. Hand-held windows: towards effective 2D interaction in immersive virtual environments. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). IEEE, 205--212.",
      "doi": ""
    },
    {
      "text": "Manuela Macedonia and Thomas R Knösche. 2011. Body in mind: How gestures empower foreign language learning. Mind, Brain, and Education 5, 4 (2011), 196--211.",
      "doi": ""
    },
    {
      "text": "Manuela Macedonia and Katharina von Kriegstein. 2012. Gestures enhance foreign language learning. Biolinguistics 6, 3--4 (2012), 393--416.",
      "doi": ""
    },
    {
      "text": "Brian Macwhinney. 2017. Language Acquisition The Basic Components of Human Language, Methods for Studying Language Acquisition, Phases in Language Development. (2017). Retrieved January 5, 2020 from https://education.stateuniversity.com/pages/2153/ Language-Acquisition.html.",
      "doi": ""
    },
    {
      "text": "Scott C Marley and Zsuzsanna Szabo. 2010. Improving children's listening comprehension with a manipulation strategy. The journal of educational research 103, 4 (2010), 227--238.",
      "doi": ""
    },
    {
      "text": "Richard Mayer and Richard E Mayer. 2005. The Cambridge handbook of multimedia learning. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Richard E Mayer and Roxana Moreno. 2003. Nine ways to reduce cognitive load in multimedia learning. Educational psychologist 38, 1 (2003), 43--52.",
      "doi": ""
    },
    {
      "text": "Makiko Naka. 1998. Repeated writing facilitates children's memory for pseudocharacters and foreign letters. Memory & cognition 26, 4 (1998), 804--809.",
      "doi": ""
    },
    {
      "text": "Mark Paterson. 2007. The senses of touch: Haptics, affects and technologies. Berg.",
      "doi": ""
    },
    {
      "text": "Lyn Pemberton, Marcus Winter, and Sanaz Fallahkhair. 2010. Collaborative mobile knowledge sharing for language learners. Journal of the Research Centre for Educational Technology 6, 1 (2010), 144--148.",
      "doi": ""
    },
    {
      "text": "Daniel Reschke Pires and others. 2018. L2 vocabulary instruction: an analysis of smartphone applications for english learning. (2018).",
      "doi": ""
    },
    {
      "text": "Marc Prensky. 2005. What can you learn from a cell phone? Almost anything! Innovate: Journal of Online Education 1, 5 (2005).",
      "doi": ""
    },
    {
      "text": "Matthew S Prewett, Linda R Elliott, Ashley G Walvoord, and Michael D Coovert. 2011. A meta-analysis of vibrotactile and visual information displays for improving task performance. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 42, 1 (2011), 123--132.",
      "doi": "10.1109/TSMCC.2010.2103057"
    },
    {
      "text": "Mei Pu and Zheng Zhong. 2018. Development of a Situational Interaction Game for Improving Preschool Children'Performance in English-Vocabulary Learning. In Proceedings of the 2018 International Conference on Distance Education and Learning. ACM, 88--92.",
      "doi": "10.1145/3231848.3231851"
    },
    {
      "text": "Graham Rawlinson. 2007. The significance of letter position in word recognition. IEEE Aerospace and Electronic Systems Magazine 22, 1 (2007), 26--27.",
      "doi": ""
    },
    {
      "text": "Claudia Repetto, Elisa Pedroli, and Manuela Macedonia. 2017. Enrichment effects of gestures and pictures on abstract words in a second language. Frontiers in psychology 8 (2017), 2136.",
      "doi": ""
    },
    {
      "text": "Jerzy Rubach. 1996. Shortening and ambisyllabicity in English. Phonology 13, 2 (1996), 197--237.",
      "doi": ""
    },
    {
      "text": "Claire N Rubman and Harriet Salatas Waters. 2000. A, B seeing: The role of constructive processes in children's comprehension monitoring. Journal of Educational Psychology 92, 3 (2000), 503.",
      "doi": ""
    },
    {
      "text": "Nuria Sagarra and Matthew Alba. 2006. The key is in the keyword: L2 vocabulary learning methods with beginning learners of Spanish. The modern language journal 90, 2 (2006), 228--243.",
      "doi": ""
    },
    {
      "text": "Eli Saltz and David Dixon. 1982. Let's pretend: The role of motoric imagery in memory for sentences and words. Journal of Experimental Child Psychology 34, 1 (1982), 77--92.",
      "doi": ""
    },
    {
      "text": "Eli Saltz and Suzanne Donnenwerth-Nolan. 1981. Does motoric imagery facilitate memory for sentences? A selective interference test. Journal of Verbal Learning and Verbal Behavior 20, 3 (1981), 322--332.",
      "doi": ""
    },
    {
      "text": "Jacobijn Sandberg, Marinus Maris, and Pepijn Hoogendoorn. 2014. The added value of a gaming context and intelligent adaptation for a mobile learning application for vocabulary learning. Computers & Education 76 (2014), 119--130.",
      "doi": ""
    },
    {
      "text": "James P Schmidt, Tom N Tombaugh, and Penny Faulkner. 1992. Free-recall, cued-recall and recognition procedures with three verbal memory tests: Normative data from age 20 to 79. Clinical neuropsychologist 6, 2 (1992), 185--200.",
      "doi": ""
    },
    {
      "text": "scientiamobile. 2017. Smartphone vs Tablet Orientation: Who's Using What? (2017). Retrieved September 20, 2019 from https://www.scientiamobile.com/smartphonevs-tablet-orientation-whos-using-what/.",
      "doi": ""
    },
    {
      "text": "Alexander Skulmowski and Günter Daniel Rey. 2018. Embodied learning: introducing a taxonomy based on bodily engagement and task integration. Cognitive research: principles and implications 3, 1 (2018), 6.",
      "doi": ""
    },
    {
      "text": "Craig J Sutherland, Andrew Luxton-Reilly, and Beryl Plimmer. 2016. Freeform digital ink annotations in electronic documents: A systematic mapping study. Computers & Graphics 55 (2016), 1--20.",
      "doi": "10.1016/j.cag.2015.10.014"
    },
    {
      "text": "John Sweller. 2011. Cognitive load theory. In Psychology of learning and motivation. Vol. 55. Elsevier, 37--76.",
      "doi": ""
    },
    {
      "text": "Saeed Taki and Saeed Khazaei. 2011. Learning Vocabulary via Mobile Phone: Persian EFL Learners in Focus. Journal of Language Teaching & Research 2, 6 (2011).",
      "doi": ""
    },
    {
      "text": "Medha Tare, Cynthia Chiong, Patricia Ganea, and Judy DeLoache. 2010. Less is more: How manipulative features affect children's learning from picture books. Journal of Applied Developmental Psychology 31, 5 (2010), 395--400.",
      "doi": ""
    },
    {
      "text": "Endel Tulving and Zena Pearlstone. 1966. Availability versus accessibility of information in memory for words. Journal of Verbal Learning and Verbal Behavior 5, 4 (1966), 381--391.",
      "doi": ""
    },
    {
      "text": "Jeffrey D Wammes, Tanya R Jonker, and Myra A Fernandes. 2019. Drawing improves memory: The importance of multimodal encoding context. Cognition 191 (2019), 103955.",
      "doi": ""
    },
    {
      "text": "Jeffrey D Wammes, Melissa E Meade, and Myra A Fernandes. 2016. The drawing effect: Evidence for reliable and robust memory benefits in free recall. The Quarterly Journal of Experimental Psychology 69, 9 (2016), 1752--1776.",
      "doi": ""
    },
    {
      "text": "Jeffrey D Wammes, Melissa E Meade, and Myra A Fernandes. 2018. Creating a recollection-based memory through drawing. Journal of Experimental Psychology: Learning, Memory, and Cognition 44, 5 (2018), 734.",
      "doi": ""
    },
    {
      "text": "Stuart Webb. 2008. The effects of context on incidental vocabulary learning. Reading in a foreign language 20, 2 (2008), 232--245.",
      "doi": ""
    },
    {
      "text": "Gerlinde Weimer-Stuckmann. 2009. Second language vocabulary acquisition: spacing and frequency of rehearsals. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Margaret Wilson. 2002. Six views of embodied cognition. Psychonomic bulletin & review 9, 4 (2002), 625--636.",
      "doi": ""
    },
    {
      "text": "Kathryn T Wissman, Katherine A Rawson, and Mary A Pyc. 2012. How and when do students use flashcards? Memory 20, 6 (2012), 568--579.",
      "doi": ""
    },
    {
      "text": "L-H Wong and C-K Looi. 2010. Vocabulary learning by mobile-assisted authentic content creation and social meaning-making: two case studies. Journal of Computer Assisted Learning 26, 5 (2010), 421--433.",
      "doi": ""
    }
  ]
}