{
  "doi": "10.1145/3313831.3376574",
  "title": "Walking by Cycling: A Novel In-Place Locomotion User Interface for Seated Virtual Reality Experiences",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We introduce VR Strider, a novel locomotion user interface (LUI) for seated virtual reality (VR) experiences, which maps cycling biomechanics of the user's legs to virtual walking movements. The core idea is to translate the motion of pedaling on a mini exercise bike to a corresponding walking animation of a virtual avatar while providing audio-based tactile feedback on virtual ground contacts. We conducted an experiment to evaluate the LUI and our novel anchor-turning rotation control method regarding task performance, spatial cognition, VR sickness, sense of presence, usability and comfort in a path-integration task. The results show that VR Strider has a significant positive effect on the participants' angular and distance estimation, sense of presence and feeling of comfort compared to other established locomotion techniques, such as teleportation and joystick-based navigation. A confirmatory study further indicates the necessity of synchronized avatar animations for virtual vehicles that rely on pedalling.",
  "authors": [
    {
      "name": "Jann Philipp Freiwald",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659076800",
      "orcid": "missing"
    },
    {
      "name": "Oscar Ariza",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/do/10.1145/contrib-81319487799/rel-imgonly/81319487799.png",
      "acmid": "81319487799",
      "orcid": "0000-0001-8130-840X"
    },
    {
      "name": "Omar Janeh",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/do/10.1145/contrib-99659108596/rel-imgonly/77.jpg",
      "acmid": "99659108596",
      "orcid": "missing"
    },
    {
      "name": "Frank Steinicke",
      "institution": "Universität Hamburg, Hamburg, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    }
  ],
  "references": [
    {
      "text": "Majed Al Zayer, Isayas B. Adhanom, Paul MacNeilage, and Eelke Folmer. 2019. The Effect of Field-of-View Restriction on Sex Bias in VR Sickness and Spatial Navigation Performance. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 354, 12 pages.",
      "doi": "10.1145/3290605.3300584"
    },
    {
      "text": "Robert S. Allison, Laurence R. Harris, Michael Jenkin, Greg Pintilie, Fara Redlick, and Daniel C. Zikovitz. 2000. First steps with a rideable computer. In Proceedings IEEE Virtual Reality 2000 (Cat. No. 00CB37048). IEEE, 169--175.",
      "doi": ""
    },
    {
      "text": "Oscar Ariza, Jann P. Freiwald, Nadine Laage, Michaela Feist, Mariam Salloum, Gerd Bruder, and Frank Steinicke. 2016. Inducing body-transfer illusions in vr by providing brief phases of visual-tactile stimulation. In Proceedings of the 2016 Symposium on Spatial User Interaction. ACM, 61--68.",
      "doi": "10.1145/2983310.2985760"
    },
    {
      "text": "Doug Bowman, Ernst Kruijff, Joseph J LaViola Jr, and Ivan P Poupyrev. 2004. 3D User interfaces: theory and practice, CourseSmart eTextbook. Addison-Wesley.",
      "doi": "10.5555/993837"
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Frederick P. Brooks Jr. 1987. Walkthrough a dynamic graphics system for simulating virtual buildings. In Proceedings of the 1986 workshop on Interactive 3D graphics. ACM, 9--21.",
      "doi": "10.1145/319120.319122"
    },
    {
      "text": "Fabio Buttussi and Luca Chittaro. 2019. Locomotion in Place in Virtual Reality: A Comparative Evaluation of Joystick, Teleport, and Leaning. IEEE Transactions on Visualization and Computer Graphics (2019).",
      "doi": ""
    },
    {
      "text": "Isaac Cho and Zachary Wartell. 2015. Evaluation of a bimanual simultaneous 7dof interaction technique in virtual environments. In 2015 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 133--136.",
      "doi": ""
    },
    {
      "text": "Elizabeth Chrastil and William Warren. 2008. Testing models of path integration in a triangle completion task. Journal of Vision 8, 6 (2008), 1153--1153.",
      "doi": ""
    },
    {
      "text": "Chris Christou, Aimilia Tzanavari, Kyriakos Herakleous, and Charalambos Poullis. 2016. Navigation in virtual reality: Comparison of gaze-directed and pointing motion control. In 2016 18th Mediterranean Electrotechnical Conference (MELECON). IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Shih-kai Chung and James K Hahn. 1999. Animation of human walking in virtual environments. In Proceedings Computer Animation 1999. IEEE, 4--15.",
      "doi": ""
    },
    {
      "text": "Rudolph P. Darken, William R. Cockayne, and David Carmein. 1997. The omni-directional treadmill: a locomotion device for virtual worlds. (1997).",
      "doi": ""
    },
    {
      "text": "José Dorado, Pablo Figueroa, Jean-Rémy Chardonnet, Frédéric Merienne, and Tiberio Hernandez. 2019. Homing by triangle completion in consumer-oriented virtual reality environments. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 1652--1657.",
      "doi": ""
    },
    {
      "text": "Sarah A. Douglas, Arthur E. Kirkpatrick, and I. Scott MacKenzie. 1999. Testing pointing device performance and user assessment with the ISO 9241, Part 9 standard. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 215--222.",
      "doi": "10.1145/302979.303042"
    },
    {
      "text": "Thomas Geijtenbeek and Nicolas Pronost. 2012. Interactive character animation using simulated physics: A state-of-the-art review. In Computer Graphics Forum, Vol. 31. Wiley Online Library, 2492--2515.",
      "doi": ""
    },
    {
      "text": "Sam Halperin. 2016. Exploring Bicycle-Based Virtual Reality Exergames as a Design Space. https://unitylist.com/p/m6q/vr-bike-game-controller. (2016). [Online; accessed 16-September-2019].",
      "doi": ""
    },
    {
      "text": "John M. Hollerbach. 2002. Locomotion interfaces. Handbook of virtual environments: Design, implementation, and applications (2002), 239--254.",
      "doi": ""
    },
    {
      "text": "Adobe Systems Incorporated. 2019. Mixamo. https://www.mixamo.com/. (2019). [Online; accessed 16-September-2019].",
      "doi": ""
    },
    {
      "text": "Hiroo Iwata. 1999. Walking about virtual environments on an infinite floor. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). IEEE, 286--293.",
      "doi": ""
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, and Fumitaka Nakaizumi. 2001. Gait master: A versatile locomotion interface for uneven virtual terrain. In Proceedings IEEE Virtual Reality 2001. IEEE, 131--137.",
      "doi": "10.5555/580521.835815"
    },
    {
      "text": "Kimberlee Jordan, John H. Challis, and Karl M. Newell. 2007. Walking speed influences on gait cycle variability. Gait Posture 26, 1 (2007), 128 -- 134.",
      "doi": ""
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203--220.",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, Alexander Marquardt, Christina Trepkowski, Robert W. Lindeman, Andre Hinkenjann, Jens Maiero, and Bernhard E. Riecke. 2016. On Your Feet!: Enhancing Vection in Leaning-Based Interfaces Through Multisensory Stimuli. In Proceedings of the 2016 Symposium on Spatial User Interaction (SUI '16). ACM, NY, NY, USA, 149--158.",
      "doi": ""
    },
    {
      "text": "Joseph J. LaViola Jr. 2000. A Discussion of Cybersickness in Virtual Environments. SIGCHI Bull. 32, 1 (Jan. 2000), 47--56.",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "William E. Marsh, Jonathan W Kelly, Veronica J. Dark, and James H. Oliver. 2013. Cognitive demands of semi-natural virtual locomotion. Presence: Teleoperators and Virtual Environments 22, 3 (2013), 216--234.",
      "doi": "10.1162/PRES_a_00152"
    },
    {
      "text": "Eliana Medina, Ruth Fruland, and Suzanne Weghorst. 2008. Virtusphere: Walking in a human size VR hamster ball. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 52. SAGE Publications Sage CA: Los Angeles, CA, 2102--2106.",
      "doi": ""
    },
    {
      "text": "Betty J. Mohler, Sarah H. Creem-Regehr, William B. Thompson, and Heinrich H. Buelthoff. 2010. The Effect of Viewing a Self-Avatar on Distance Judgments in an HMD-Based Virtual Environment. Presence: Teleoperators and Virtual Environments 19, 3 (2010), 230--242.",
      "doi": "10.1162/pres.19.3.230"
    },
    {
      "text": "Thinh Nguyen-Vo, Bernhard E. Riecke, Wolfgang Stuerzlinger, Duc-Minh Pham, and Ernst Kruijff. 2019. NaviBoard and NaviChair: Limited Translation Combined with Full Rotation for Efficient Virtual Locomotion. IEEE transactions on visualization and computer graphics (August 2019).",
      "doi": ""
    },
    {
      "text": "Yoshikazu Onuki and Itsuo Kumazawa. 2019. Reorient the Gazed Scene Towards the Center: Novel Virtual Turning Using Head and Gaze Motions and Blink. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 1864--1871.",
      "doi": ""
    },
    {
      "text": "Stanislava Rangelova, Simon Flutura, Tobias Huber, Daniel Motus, and Elisabeth André. 2019. Exploration of Physiological Signals Using Different Locomotion Techniques in a VR Adventure Game. In Universal Access in Human-Computer Interaction. Theory, Methods and Tools: 13th International Conference, UAHCI 2019, Held as Part of the 21st HCI International Conference, HCII 2019, Orlando, FL, USA, July 26--31, 2019, Proceedings, Part I. Springer, 601--616.",
      "doi": ""
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C Whitton. 2005. Redirected walking. Citeseer.",
      "doi": ""
    },
    {
      "text": "Roy A. Ruddle and Simon Lessels. 2009. The benefits of using a walking interface to navigate virtual environments. ACM Transactions on Computer-Human Interaction (TOCHI) 16, 1 (2009), 5.",
      "doi": "10.1145/1502800.1502805"
    },
    {
      "text": "Roy A. Ruddle, Ekaterina Volkova, and Heinrich H Bülthoff. 2011. Walking improves your cognitive map in environments that are large-scale and large in extent. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 2 (2011), 10.",
      "doi": "10.1145/1970378.1970384"
    },
    {
      "text": "Shyam P. Sargunam, Kasra R. Moghadam, Mohamed Suhail, and Eric D. Ragan. 2017. Guided head rotation and amplified head rotation: Evaluating semi-natural travel and viewing techniques in virtual reality. In 2017 IEEE Virtual Reality (VR). 19--28.",
      "doi": ""
    },
    {
      "text": "Bhuvaneswari Sarupuri, Miriam Chipana, and Robert Lindeman. 2017. Trigger Walking: A low-fatigue travel technique for immersive virtual reality. 227--228.",
      "doi": ""
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The experience of presence: Factor analytic insights. Presence: Teleoperators & Virtual Environments 10, 3 (2001), 266--281.",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Mel Slater, Anthony Steed, and Martin Usoh. 1995a. The virtual treadmill: A naturalistic metaphor for navigation in immersive virtual environments. In Virtual Environments 95. Springer, 135--148.",
      "doi": "10.5555/237121.237143"
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1995b. Taking steps: the influence of a walking technique on presence in virtual reality. ACM Transactions on Computer-Human Interaction (TOCHI) 2, 3 (1995), 201--219.",
      "doi": "10.1145/210079.210084"
    },
    {
      "text": "Jan L. Souman, P. Robuffo Giordano, Martin Schwaiger, Ilja Frissen, Thomas Thümmel, Heinz Ulbrich, A De Luca, Heinrich H. Bülthoff, and Marc O. Ernst. 2011. CyberWalk: Enabling unconstrained omnidirectional walking through virtual environments. ACM Transactions on Applied Perception (TAP) 8, 4 (2011), 25.",
      "doi": "10.1145/2043603.2043607"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2009. Estimation of detection thresholds for redirected walking techniques. IEEE transactions on visualization and computer graphics 16, 1 (2009), 17--27.",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Frank Steinicke, Yon Visell, Jennifer Campos, and Anatole Lécuyer. 2013. Human walking in virtual environments. Springer.",
      "doi": "10.5555/2531388"
    },
    {
      "text": "Richard Stoakley, Matthew J Conway, and Randy Pausch. 1995. Virtual reality on a WIM: interactive worlds in miniature. In CHI, Vol. 95. 265--272.",
      "doi": ""
    },
    {
      "text": "Tino Stoeckel, Robert Jacksteit, Martin Behrens, Ralf Skripitz, Rainer Bader, and Anett Mau-Moeller. 2015. The mental representation of the human gait in young and older adults. Frontiers in Psychology 6 (2015), 943.",
      "doi": ""
    },
    {
      "text": "Desney S. Tan, Darren Gergle, Peter G. Scupelli, and Randy Pausch. 2004. Physically Large Displays Improve Path Integration in 3D Virtual Navigation Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 439--446.",
      "doi": "10.1145/985692.985748"
    },
    {
      "text": "Tanh Quang Tran, Holger Regenbrecht, and Minh-Triet Tran. 2019. Am I Moving Along a Curve? A Study on Bicycle Traveling-In-Place Techniques in Virtual Environments. In IFIP Conference on Human-Computer Interaction. Springer, 345--363.",
      "doi": "10.1007/978-3-030-29390-1_19"
    },
    {
      "text": "Martin Usoh, Kevin Arthur, Mary C. Whitton, Rui Bastos, Anthony Steed, Mel Slater, and Frederick P. Brooks Jr. 1999. Walking &gt; walking-in-place &gt; flying, in virtual environments. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques. ACM Press/Addison-Wesley Publishing Co., 359--364.",
      "doi": ""
    },
    {
      "text": "Mary C. Whitton, Joseph V. Cohn, Jeff Feasel, Paul Zimmons, Sharif Razzaque, Sarah J. Poulton, Brandi McLeod, and Frederick P. Brooks. 2005. Comparing VE locomotion interfaces. In IEEE Proceedings. VR 2005. Virtual Reality, 2005. IEEE, 123--130.",
      "doi": ""
    },
    {
      "text": "Mengxin Xu, María Murcia-López, and Anthony Steed. 2017. Object location memory error in virtual and real environments. In 2017 IEEE Virtual Reality (VR). IEEE, 315--316.",
      "doi": ""
    }
  ]
}