{
  "doi": "10.1145/3313831.3376548",
  "title": "Characterizing Twitter Users Who Engage in Adversarial Interactions against Political Candidates",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Social media provides a critical communication platform for political figures, but also makes them easy targets for harassment. In this paper, we characterize users who adversarially interact with political figures on Twitter using mixed-method techniques. The analysis is based on a dataset of 400 thousand users' 1.2 million replies to 756 candidates for the U.S. House of Representatives in the two months leading up to the 2018 midterm elections. We show that among moderately active users, adversarial activity is associated with decreased centrality in the social graph and increased attention to candidates from the opposing party. When compared to users who are similarly active, highly adversarial users tend to engage in fewer supportive interactions with their own party's candidates and express negativity in their user profiles. Our results can inform the design of platform moderation mechanisms to support political figures countering online harassment.",
  "authors": [
    {
      "name": "Yiqing Hua",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527938",
      "orcid": "missing"
    },
    {
      "name": "Mor Naaman",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    },
    {
      "name": "Thomas Ristenpart",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384601889",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Susan J. Adams, Tracey E. Hazelwood, Nancy L. Pitre, Terry E. Bedard, and Suzette D. Landry. 2009. Harassment of members of parliament and the legislative assemblies in Canada by individuals believed to be mentally disordered. The Journal of Forensic Psychiatry & Psychology 20, 6 (2009), 801--814.",
      "doi": ""
    },
    {
      "text": "Pushkal Agarwal, Nishanth Sastry, and Edward Wood. 2019. Tweeting MPs: Digital Engagement between Citizens and Members of Parliament in the UK. In Proceedings of the Thirteenth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Faiyaz Al Zamal, Wendy Liu, and Derek Ruths. 2012. Homophily and latent attribute inference: Inferring latent attributes of twitter users from neighbors. In Proceedings of the Sixth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Amnesty International. 2018. TROLL PATROL FINDINGS: Using Crowdsourcing, Data Science & Machine Learning to Measure Violence and Abuse against Women on Twitter. https://decoders.amnesty. org/projects/troll-patrol/findings#inf_12. (2018). [Online; accessed 21-Dec-2018].",
      "doi": ""
    },
    {
      "text": "Amnesty International UK. 2018. Black and Asian women MPs abused more online. https://www.amnesty.org.uk/online-violence-women-mps. (2018). [Online; accessed 5-Jan-2019].",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, Leo Graiden Stewart, and Kate Starbird. 2018. Acting the part: Examining information operations within #BlackLivesMatter discourse. Proceedings of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (2018).",
      "doi": "10.1145/3274289"
    },
    {
      "text": "Pablo Barberá. 2015. Birds of the same feather tweet together: Bayesian ideal point estimation using Twitter data. Political Analysis 23, 1 (2015), 76--91.",
      "doi": ""
    },
    {
      "text": "Andrea Caumont. 2013. Twitter Reaction to Events Often at Odds with Overall Public Opinion. https://www.pewresearch.org/2013/03/04/twitter-reaction-to-events-often-at-odds-with-overall -public-opinion/. (2013). [Online; accessed 3-Apr-2019].",
      "doi": ""
    },
    {
      "text": "Despoina Chatzakou, Nicolas Kourtellis, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, and Athena Vakali. 2017a. Mean birds: Detecting aggression and bullying on twitter. In Proceedings of the 2017 ACM on Web Science Conference. ACM.",
      "doi": "10.1145/3091478.3091487"
    },
    {
      "text": "Despoina Chatzakou, Nicolas Kourtellis, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, and Athena Vakali. 2017b. Measuring# gamergate: A tale of hate, sexism, and bullying. In Proceedings of the 26th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee.",
      "doi": "10.1145/3041021.3053890"
    },
    {
      "text": "Justin Cheng, Michael Bernstein, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2017. Anyone can become a troll: Causes of trolling behavior in online discussions. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM.",
      "doi": "10.1145/2998181.2998213"
    },
    {
      "text": "Justin Cheng, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2015. Antisocial behavior in online discussion communities. In Proceedings of the Ninth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Lucie Corcoran, Conor Guckin, and Garry Prentice. 2015. Cyberbullying or cyber aggression?: A review of existing defnitions of cyber-based peer-to-peer aggression. Societies 5, 2 (2015), 245--255.",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2009. Following you: Disciplines of listening in social media. Continuum 23, 4 (2009), 525--535.",
      "doi": ""
    },
    {
      "text": "Thomas Davidson, Dana Warmsley, Michael Macy, and Ingmar Weber. 2017. Automated hate speech detection and the problem of offensive language. In Proceedings of the Eleventh International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Clayton Allen Davis, Onur Varol, Emilio Ferrara, Alessandro Flamini, and Filippo Menczer. 2016. Botornot: A system to evaluate social bots. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee.",
      "doi": "10.1145/2872518.2889302"
    },
    {
      "text": "Park E Dietz, Daryl B Matthews, Daniel Allen Martell, Tracy M Stewart, Debra R Hrouda, and Janet Warren. 1991. Threatening and otherwise inappropriate letters to members of the United States Congress. Journal of Forensic Science 36, 5 (1991), 1445--1468.",
      "doi": ""
    },
    {
      "text": "Karthik Dinakar, Birago Jones, Catherine Havasi, Henry Lieberman, and Rosalind Picard. 2012. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 3 (2012), 18.",
      "doi": "10.1145/2362394.2362400"
    },
    {
      "text": "Karthik Dinakar, Roi Reichart, and Henry Lieberman. 2011. Modeling the detection of textual cyberbullying. In Proceeding of the Fifth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Nemanja Djuric, Jing Zhou, Robin Morris, Mihajlo Grbovic, Vladan Radosavljevic, and Narayan Bhamidipati. 2015. Hate speech detection with comment embeddings. In Proceedings of the 24th International Conference on World Wide Web. ACM.",
      "doi": "10.1145/2740908.2742760"
    },
    {
      "text": "Jack Dorsey. 2019. https://twitter.com/jack/status/919028949434241024. (2019). [Online; accessed 3-Apr-2019].",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017. Online harassment in focus: Most recent experience. https://www.pewinternet.org/2017/07/11/online-harassment-in-focus-most-recent-experience/. (2017). [Online; accessed 3-Apr-2019].",
      "doi": ""
    },
    {
      "text": "Mai ElSherief, Shirin Nilizadeh, Dana Nguyen, Giovanni Vigna, and Elizabeth Belding. 2018. Peer to peer hate: Hate speech instigators and their targets. In Proceedings of the Twelfth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Susanna Every-Palmer, Justin Barry-Walsh, and Michele Pathé. 2015. Harassment, stalking, threats and attacks targeting New Zealand politicians: A mental health issue. Australian & New Zealand Journal of Psychiatry 49, 7 (2015), 634--641.",
      "doi": ""
    },
    {
      "text": "Emilio Ferrara, Onur Varol, Clayton Davis, Filippo Menczer, and Alessandro Flammini. 2016. The rise of social bots. Commun. ACM 59, 7 (2016), 96--104.",
      "doi": "10.1145/2818717"
    },
    {
      "text": "R Stuart Geiger. 2016. Bot-based collective blocklists in Twitter: the counterpublic moderation of harassment in a networked public space. Information, Communication & Society 19, 6 (2016), 787--803.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman. 2008. Scaling regression inputs by dividing by two standard deviations. Statistics in medicine 27, 15 (2008), 2865--2873.",
      "doi": ""
    },
    {
      "text": "Genevieve Gorrell, Mark Greenwood, Ian Roberts, Diana Maynard, and Kalina Bontcheva. 2018a. Online Abuse of UK MPs in 2015 and 2017: Perpetrators, Targets, and Topics. arXiv preprint arXiv:1804.01498 (2018).",
      "doi": ""
    },
    {
      "text": "Genevieve Gorrell, Mark A Greenwood, Ian Roberts, Diana Maynard, and Kalina Bontcheva. 2018b. Twits, Twats and Twaddle: Trends in Online Abuse towards UK Politicians. In Proceedings Of the Twelfth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Will J Grant, Brenda Moon, and Janie Busby Grant. 2010. Digital dialogue? Australian politicians' use of the social network tool Twitter. Australian Journal of Political Science 45, 4 (2010), 579--604.",
      "doi": ""
    },
    {
      "text": "Dorothy Wunmi Grigg. 2010. Cyber-aggression: Defnition and concept of cyberbullying. Journal of Psychologists and Counsellors in Schools 20, 2 (2010), 143--156.",
      "doi": ""
    },
    {
      "text": "Alex Hern. 2015. Twitter CEO: We suck at dealing with trolls and abuse. https://www.theguardian.com/technology/2015/feb/05/twitter-ceo-we-suck-dealing-with-trolls-abuse. (2015). [Online; accessed 3-Apr-2019].",
      "doi": ""
    },
    {
      "text": "Yiqing Hua, Thomas Ristenpart, and Mor Naaman. 2020. Towards measuring adversarial Twitter interactions against candidates in the US midterm elections. (2020).",
      "doi": ""
    },
    {
      "text": "Jane Im, Eshwar Chandrasekharan, Jackson Sargent, Paige Lighthammer, Taylor Denby, Ankit Bhargava, Libby Hemphill, David Jurgens, and Eric Gilbert. 2019. Still out there: Modeling and Identifying Russian Troll Accounts on Twitter. arXiv preprint arXiv:1901.11162 (2019).",
      "doi": ""
    },
    {
      "text": "David V James, Frank R Farnham, Seema Sukhwal, Katherine Jones, Josephine Carlisle, and Sara Henley. 2016. Aggressive/intrusive behaviours, harassment and stalking of members of the United Kingdom parliament: a prevalence study and cross-national comparison. The Journal of Forensic Psychiatry & Psychology 27, 2 (2016), 177--197.",
      "doi": ""
    },
    {
      "text": "Jigsaw. 2018. Perspective API. https://www.perspectiveapi.com/. (2018). [Online; accessed 3-Jan-2019].",
      "doi": ""
    },
    {
      "text": "Kenneth Joseph, Briony Swire-Thompson, Hannah Masuga, Matthew A Baum, and David Lazer. 2019. Polarized, Together: Comparing Partisan Support for Trump's Tweets Using Survey and Platform-Based Measures. In Proceedings of the Thirteenth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Anders O Larsson and Bente Kalsnes. 2014. 'Of course we are on Facebook': Use and non-use of social media among Swedish and Norwegian politicians. European Journal of Communication 29, 6 (2014), 653--667.",
      "doi": ""
    },
    {
      "text": "Kaitlin Mahar, Amy X Zhang, and David Karger. 2018. Squadbox: A tool to combat email harassment using friendsourced moderation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3173574.3174160"
    },
    {
      "text": "Suman Kalyan Maity, Aishik Chakraborty, Pawan Goyal, and Animesh Mukherjee. 2018. Opinion Conficts: An Effective Route to Detect Incivility in Twitter. Proceedings of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (2018).",
      "doi": ""
    },
    {
      "text": "J Matias, Amy Johnson, Whitney Erin Boesel, Brian Keegan, Jaclyn Friedman, and Charlie DeTar. 2015. Reporting, reviewing, and responding to harassment on Twitter. Available at SSRN 2602018 (2015).",
      "doi": ""
    },
    {
      "text": "Miller McPherson, Lynn Smith-Lovin, and James M Cook. 2001. Birds of a feather: Homophily in social networks. Annual review of sociology 27, 1 (2001), 415--444.",
      "doi": ""
    },
    {
      "text": "Carlos Monje Jr. 2019. 2018 US midterm elections review. https://blog.twitter.com/en_us/topics/company/2019/18_midterm_review.html. (2019). [Online; accessed 20-Aug-2019].",
      "doi": ""
    },
    {
      "text": "Michael J Moore, Tadashi Nakano, Akihiro Enomoto, and Tatsuya Suda. 2012. Anonymity and roles associated with aggressive posts in an online forum. Computers in Human Behavior 28, 3 (2012), 861--867.",
      "doi": "10.1016/j.chb.2011.12.005"
    },
    {
      "text": "New York Times. 2018. For Female Candidates, Harassment and Threats Come Every Day. https://www.nytimes.com/2018/08/24/us/politics/women-harassment-elections.html?action=click&module= Top%20Stories&pgtype=Homepage. (2018). [Online; accessed 5-Jan-2019].",
      "doi": ""
    },
    {
      "text": "Chikashi Nobata, Joel Tetreault, Achint Thomas, Yashar Mehdad, and Yi Chang. 2016. Abusive language detection in online user content. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee.",
      "doi": "10.1145/2872427.2883062"
    },
    {
      "text": "Blair Nonnecke and Jenny Preece. 2000. Lurker demographics: Counting the silent. In Proceedings of the 2000 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "Blair Nonnecke and Jenny Preece. 2001. Why lurkers lurk. Proceedings of the Americas Conference on Information Systems (2001).",
      "doi": ""
    },
    {
      "text": "Robert M O'brien. 2007. A caution regarding rules of thumb for variance infation factors. Quality & quantity 41, 5 (2007), 673--690.",
      "doi": ""
    },
    {
      "text": "Lawrence Page, Sergey Brin, Rajeev Motwani, and Terry Winograd. 1999. The PageRank citation ranking: Bringing order to the web. Technical Report. Stanford InfoLab. http://ilpubs.stanford.edu:8090/422/",
      "doi": ""
    },
    {
      "text": "John H Parmelee and Shannon L Bichard. 2011. Politics and the Twitter revolution: How tweets infuence the relationship between political leaders and the public. Lexington Books.",
      "doi": ""
    },
    {
      "text": "Michele Pathé, Jane Phillips, Elke Perdacher, and Ed Heffernan. 2014. The harassment of Queensland Members of Parliament: A mental health concern. Psychiatry, Psychology and Law 21, 4 (2014), 577--584.",
      "doi": ""
    },
    {
      "text": "Jenny Preece, Blair Nonnecke, and Dorine Andrews. 2004. The top fve reasons for lurking: improving community experiences for everyone. Computers in human behavior 20, 2 (2004), 201--223.",
      "doi": ""
    },
    {
      "text": "Manoel Horta Ribeiro, Pedro H Calais, Yuri A Santos, Virgílio AF Almeida, and Wagner Meira Jr. 2018. Characterizing and detecting hateful users on twitter. In Proceedings of the Twelfth International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Daniel M Romero, Chenhao Tan, and Johan Ugander. 2013. On the Interplay between Social and Topical Structure. In Proceedings of the Seventh International AAAI Conference on Web and Social Media. AAAI Press.",
      "doi": ""
    },
    {
      "text": "Alexandra Siegel, Evgenii Nikitin, Pablo Barberá, Joanna Sterling, Bethany Pullen, Richard Bonneau, Jonathan Nagler, and Joshua A Tucker. 2019. Trumping Hate on Twitter? Online Hate in the 2016 US Election and its Aftermath. https://smappnyu.org/wp-content/uploads/2019/04/US_ Election_Hate_Speech_2019_03_website.pdf, (2019).",
      "doi": ""
    },
    {
      "text": "Vivek K Singh, Marie L Radford, Qianjia Huang, and Susan Furrer. 2017. They basically like destroyed the school one day: On Newer App Features and Cyberbullying in Schools. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM.",
      "doi": "10.1145/2998181.2998279"
    },
    {
      "text": "Steven JJ Tedjamulia, Douglas L Dean, David R Olsen, and Conan C Albrecht. 2005. Motivating content contributions to online communities: Toward a more comprehensive theory. In Proceedings of the 38th annual Hawaii international conference on system sciences. IEEE.",
      "doi": "10.1109/HICSS.2005.444"
    },
    {
      "text": "Yannis Theocharis, Pablo Barberá, Zoltán Fazekas, Sebastian Adrian Popa, and Olivier Parnet. 2016. A bad workman blames his tweets: the consequences of citizens' uncivil Twitter use when interacting with party candidates. Journal of communication 66, 6 (2016), 1007--1031.",
      "doi": ""
    },
    {
      "text": "Twitter. 2019a. About replies and mentions. https://help.twitter.com/en/using-twitter/mentions-and-replies. (2019). [Online; accessed 1-April-2019].",
      "doi": ""
    },
    {
      "text": "Twitter. 2019b. About suspended accounts. https://help.twitter.com/en/managing-your-account/suspended-twitter-accounts. (2019). [Online; accessed 3-Apr-2019].",
      "doi": ""
    },
    {
      "text": "Twitter. 2019c. Twitter Standard API. https://developer. twitter.com/en/docs/tweets/filter-realtime/overview. (2019). [Online; accessed 15-Jan-2019].",
      "doi": ""
    },
    {
      "text": "Twitter. 2019d. Verifed account FAQs. https://help.twitter.com/en/managing-your-account/twitter-verified-accounts. (2019). [Online; accessed 1-April-2019].",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women's Experiences With and Strategies for Mitigating Negative Effects of Online Harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM.",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex machina: Personal attacks seen at scale. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee.",
      "doi": "10.1145/3038912.3052591"
    },
    {
      "text": "Michele L Ybarra and Kimberly J Mitchell. 2004. Youth engaging in online harassment: Associations with caregiver--child relationships, Internet use, and personal characteristics. Journal of adolescence 27, 3 (2004), 319--336.",
      "doi": ""
    }
  ]
}