{
  "doi": "10.1145/3313831.3376411",
  "title": "Companionship Is Not a Function: The Effect of a Novel Robotic Object on Healthy Older Adults' Feelings of \"Being-Seen\"",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "One of the challenges faced by healthy older adults is experiencing feelings of not \"being-seen\". Companion robots, commonly designed with zoomorphic or humanoid appearance show success among clinical older adults, but healthy older adults find them degrading. We present the design and implementation of a novel non-humanoid robot. The robot's primary function is a cognitive word game. Social interaction is conveyed as a secondary function, using non-verbal gestures, inspired by dancers' movement. In a lab study, 39 healthy older adults interacted with the prototype in 3 conditions: Companion-Function; Game-Function; and No-Function. Results show the non-verbal gestures were associated with feelings of \"being-seen\", and willingness to accept the robot into their home was influenced by its function, with game significantly higher than companion. We conclude that robot designers should further explore the potential of non-humanoid robots as a new class of companion robots, with a primary function that is not companionship.",
  "authors": [
    {
      "name": "Oren Zuckerman",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/do/10.1145/contrib-81100224720/rel-imgonly/oren_h.jpg",
      "acmid": "81100224720",
      "orcid": "missing"
    },
    {
      "name": "Dina Walker",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526591",
      "orcid": "missing"
    },
    {
      "name": "Andrey Grishko",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179132",
      "orcid": "missing"
    },
    {
      "name": "Tal Moran",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418595279",
      "orcid": "missing"
    },
    {
      "name": "Chen Levy",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527855",
      "orcid": "missing"
    },
    {
      "name": "Barak Lisak",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527075",
      "orcid": "missing"
    },
    {
      "name": "Iddo Yehoshua Wald",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/do/10.1145/contrib-99659178825/rel-imgonly/iddo.jpg",
      "acmid": "99659178825",
      "orcid": "missing"
    },
    {
      "name": "Hadas Erel",
      "institution": "Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260836",
      "orcid": "0000-0001-7099-6104"
    }
  ],
  "references": [
    {
      "text": "Kathryn B Adams, Sheryl Sanders, and EA Auth. 2004. Loneliness and depression in independent living retirement communities: risk and resilience factors. Aging & mental health 8, 6 (2004), 475--485.",
      "doi": ""
    },
    {
      "text": "Nalini Ambady and Robert Rosenthal. 1998. Nonverbal communication. Encyclopedia of mental health 2 (1998), 775--782.",
      "doi": ""
    },
    {
      "text": "Raihah Aminuddin, Amanda Sharkey, and Liat Levita. 2016. Interaction with the Paro robot may reduce psychophysiological stress responses. In 2016 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 593--594.",
      "doi": ""
    },
    {
      "text": "Lucy Anderson-Bashan, Benny Megidish, Hadas Erel, Iddo Wald, Guy Hoffman, Oren Zuckerman, and Andrey Grishko. 2018. The Greeting Machine: An Abstract Robotic Object for Opening Encounters. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 595--602.",
      "doi": ""
    },
    {
      "text": "Leonardo Angelini, Francesco Carrino, Maurizio Caon, Frédéric Lemaréchal, Nadine Couture, Omar Abou Khaled, and Elena Mugellini. 2016. Testing the tangible interactive window with older adults. GeroPsych (2016).",
      "doi": ""
    },
    {
      "text": "Ron Baecker, Kate Sellen, Sarah Crosskey, Veronique Boscart, and Barbara Barbosa Neves. 2014. Technology to reduce social isolation and loneliness. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 27--34.",
      "doi": "10.1145/2661334.2661375"
    },
    {
      "text": "Rafael Ballagas, Hayes Raffle, Janet Go, Glenda Revelle, Joseph Kaye, Morgan Ames, Hiroshi Horii, Koichi Mori, and Mirjana Spasojevic. 2010. Story time for the 21st century. IEEE Pervasive Computing 9, 3 (2010), 28--36.",
      "doi": "10.1109/MPRV.2010.45"
    },
    {
      "text": "Marian R Banks, Lisa M Willoughby, and William A Banks. 2008. Animal-assisted therapy and loneliness in nursing homes: use of robotic versus living dogs. Journal of the American Medical Directors Association 9, 3 (2008), 173--177.",
      "doi": ""
    },
    {
      "text": "Sarah J. Barber, Mara Mather, and Margaret Gatz. 2015. How stereotype threat affects healthy older adults' performance on clinical assessments of cognitive decline: The key role of regulatory fit. Journals of Gerontology Series B: Psychological Sciences and Social Sciences 70, 6 (2015), 891--900.",
      "doi": ""
    },
    {
      "text": "Matthew Barr. 2018. Student attitudes to games-based skills development: Learning from video games in higher education. Computers in Human Behavior 80 (2018), 283--294.",
      "doi": "10.1016/j.chb.2017.11.030"
    },
    {
      "text": "Aryel Beck, Lola Cañamero, and Kim A Bard. 2010. Towards an affect space for robots to display emotional body language. In 19th International symposium in robot and human interactive communication. IEEE, 464--469.",
      "doi": ""
    },
    {
      "text": "Casey C Bennett, Selma Sabanovic, Jennifer A Piatt, Shinichi Nagata, Lori Eldridge, and Natasha Randall. 2017. A robot a day keeps the blues away. In 2017 IEEE International Conference on Healthcare Informatics (ICHI). IEEE, 536--540.",
      "doi": ""
    },
    {
      "text": "Cindy L. Bethel and Robin R. Murphy. 2010. Emotive non-anthropomorphic robots perceived as more calming, friendly, and attentive for victim management. In 2010 AAAI Fall Symposium Series.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Mason Bretan, Guy Hoffman, and Gil Weinberg. 2015. Emotionally expressive dynamic physical behaviors in robots. International Journal of Human-Computer Studies 78 (2015), 1--16.",
      "doi": "10.1016/j.ijhcs.2015.01.006"
    },
    {
      "text": "Annie Britton, Martin Shipley, Archana Singh-Manoux, and Michael G Marmot. 2008. Successful aging: The contribution of early-life and midlife risk factors. Journal of the American Geriatrics Society 56, 6 (2008), 1098--1105.",
      "doi": ""
    },
    {
      "text": "Joost Broekens, Marcel Heerink, Henk Rosendal, and others. 2009. Assistive social robots in elderly care: a review. Gerontechnology 8, 2 (2009), 94--103.",
      "doi": ""
    },
    {
      "text": "Butter 2019. Butter. (2019). Retrieved June 16, 2019 from https:\\\\butter-robotics.web.app",
      "doi": ""
    },
    {
      "text": "Karin Dahlberg. 2007. The enigmatic phenomenon of loneliness. International Journal of Qualitative Studies on Health and Well-being 2, 4 (2007), 195--207.",
      "doi": ""
    },
    {
      "text": "Kerstin Dautenhahn, Sarah Woods, Christina Kaouri, Michael L Walters, Kheng Lee Koay, and Iain Werry. 2005. What is a robot companion-friend, assistant or butler?. In 2005 IEEE/RSJ international conference on intelligent robots and systems. IEEE, 1192--1197.",
      "doi": ""
    },
    {
      "text": "Niki Davis and Dale S Niederhauser. 2007. Virtual schooling. Learning & leading with technology 34, 7 (2007), 10--15.",
      "doi": ""
    },
    {
      "text": "Inbal Deutsch, Hadas Erel, Michal Paz, Guy Hoffman, and Oren Zuckerman. 2019. Home robotic devices for older adults: Opportunities and concerns. Computers in Human Behavior 98 (2019), 122--133.",
      "doi": "10.1016/j.chb.2019.04.002"
    },
    {
      "text": "Robin IM Dunbar. 1998. The social brain hypothesis. Evolutionary Anthropology: Issues, News, and Reviews: Issues, News, and Reviews 6, 5 (1998), 178--190.",
      "doi": ""
    },
    {
      "text": "Pearl A. Dykstra, Theo G. Van Tilburg, and Jenny De Jong Gierveld. 2005. Changes in older adult loneliness: Results from a seven-year longitudinal study. Research on aging 27, 6 (2005), 725--747.",
      "doi": ""
    },
    {
      "text": "Hadas Erel, Tzachi Shem Tov, Yoav Kessler, and Oren Zuckerman. 2019. Robots are Always Social: Robotic Movements are Automatically Interpreted as Social Cues. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, LBW0245.",
      "doi": "10.1145/3290607.3312758"
    },
    {
      "text": "Neta Ezer, Arthur D. Fisk, and Wendy A Rogers. 2009. Attitudinal and intentional acceptance of domestic robots by younger and older adults. In International conference on universal access in human-computer interaction. Springer, 39--48.",
      "doi": "10.1007/978-3-642-02710-9_5"
    },
    {
      "text": "Marshal F. Folstein, Susan E. Folstein, and Paul R. McHugh. 1975. \"Mini-mental state\": a practical method for grading the cognitive state of patients for the clinician. Journal of psychiatric research 12, 3 (1975), 189--198.",
      "doi": ""
    },
    {
      "text": "Anderson J. Franklin and Nancy Boyd-Franklin. 2000. Invisibility syndrome: A clinical model of the effects of racism on African-American males. American Journal of Orthopsychiatry 70, 1 (2000), 33--41.",
      "doi": ""
    },
    {
      "text": "Susanne Frennert, Håkan Eftring, and Britt Östlund. 2013. What older people expect of robots: A mixed methods approach. In International conference on social robotics. Springer, 19--29.",
      "doi": "10.5555/2688717.2688722"
    },
    {
      "text": "Susanne Frennert, Britt Östlund, and Håkan Eftring. 2012. Would granny let an assistive robot into her home?. In International conference on social robotics. Springer, 128--137.",
      "doi": "10.1007/978-3-642-34103-8_13"
    },
    {
      "text": "Alexandra M. Freund and Paul B. Baltes. 1998. Selection, optimization, and compensation as strategies of life management: correlations with subjective indicators of successful aging. Psychology and aging 13, 4 (1998), 531.",
      "doi": ""
    },
    {
      "text": "Anne Galletta. 2013. Mastering the semi-structured interview and beyond: From research design to analysis and publication. Vol. 18. NYU press.",
      "doi": ""
    },
    {
      "text": "Ulla H. Graneheim and Berit Lundman. 2010. Experiences of loneliness among the very old: The Umeå 85+ project. Aging & Mental Health 14, 4 (2010), 433--438.",
      "doi": ""
    },
    {
      "text": "John Harris and Ehud Sharlin. 2011. Exploring the affect of abstract motion in social human-robot interaction. In 2011 Ro-Man. IEEE, 441--448.",
      "doi": ""
    },
    {
      "text": "Solveig Hauge and Marit Kirkevold. 2012. Variations in older persons' descriptions of the burden of loneliness. Scandinavian journal of caring sciences 26, 3 (2012), 553--560.",
      "doi": ""
    },
    {
      "text": "Robert J Havighurst. 1963. Successful aging. Processes of aging: Social and psychological perspectives 1 (1963), 299--320.",
      "doi": ""
    },
    {
      "text": "Tad Hirsch, Jodi Forlizzi, Elaine Hyder, Jennifer Goetz, Chris Kurtz, and Jacey Stroback. 2000. The ELDer project: social, emotional, and environmental factors in the design of eldercare technologies. In Proceedings on the 2000 conference on Universal Usability. ACM, 72--79.",
      "doi": "10.1145/355460.355476"
    },
    {
      "text": "Guy Hoffman and Gil Weinberg. 2011. Interactive improvisation with a robotic marimba player. Autonomous Robots 31, 2--3 (2011), 133--153.",
      "doi": "10.1007/s10514-011-9237-0"
    },
    {
      "text": "Guy Hoffman, Oren Zuckerman, Gilad Hirschberger, Michal Luria, and Tal Shani Sherman. 2015. Design and evaluation of a peripheral robotic conversation companion. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 3--10.",
      "doi": "10.1145/2696454.2696495"
    },
    {
      "text": "Nathan W Hudson and R Chris Fraley. 2016. Do people's desires to change their personality traits vary with age? An examination of trait change goals across adulthood. Social Psychological and Personality Science 7, 8 (2016), 847--856.",
      "doi": ""
    },
    {
      "text": "Suzanne Hutson, Soo Ling Lim, Peter J Bentley, Nadia Bianchi-Berthouze, and Ann Bowling. 2011. Investigating the suitability of social robots for the wellbeing of the elderly. In International Conference on Affective Computing and Intelligent Interaction. Springer, 578--587.",
      "doi": ""
    },
    {
      "text": "Dilip V Jeste, Gauri N Savla, Wesley K Thompson, Ipsit V Vahia, Danielle K Glorioso, A'verria Sirkin Martin, Barton W Palmer, David Rock, Shahrokh Golshan, Helena C Kraemer, and others. 2013. Association between older age and more successful aging: critical role of resilience and depression. American Journal of Psychiatry 170, 2 (2013), 188--196.",
      "doi": ""
    },
    {
      "text": "Nina Jøranson, Ingeborg Pedersen, Anne Marie Mork Rokstad, and Camilla Ihlebaek. 2015. Effects on symptoms of agitation and depression in persons with dementia participating in robot-assisted activity: a cluster-randomized controlled trial. Journal of the American Medical Directors Association 16, 10 (2015), 867--873.",
      "doi": ""
    },
    {
      "text": "Wendy Ju and Leila Takayama. 2009. Approachability: How people interpret automatic door movement as gesture. International Journal of Design 3, 2 (2009), 1--10.",
      "doi": ""
    },
    {
      "text": "Reza Kachouie, Sima Sedighadeli, Rajiv Khosla, and Mei-Tai Chu. 2014. Socially assistive robots in elderly care: a mixed-method systematic literature review. International Journal of Human-Computer Interaction 30, 5 (2014), 369--393.",
      "doi": ""
    },
    {
      "text": "Chris L Kleinke. 1986. Gaze and eye contact: a research review. Psychological bulletin 100, 1 (1986), 78.",
      "doi": ""
    },
    {
      "text": "Simone Kriglstein and Gunter Wallner. 2005. HOMIE: an artificial companion for elderly people. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 2094--2098.",
      "doi": "10.1145/1056808.1057106"
    },
    {
      "text": "Hee Rin Lee and Laurel D Riek. 2018. Reframing assistive robots to promote successful aging. ACM Transactions on Human-Robot Interaction (THRI) 7, 1 (2018), 11.",
      "doi": "10.1145/3203303"
    },
    {
      "text": "Hee Rin Lee, Selma Sabanovi´ c, Wan-Ling Chang, David Hakken, Shinichi Nagata, Jen Piatt, and Casey Bennett. 2017. Steps toward participatory design of social robots: mutual learning with older adults with depression. In 2017 12th ACM/IEEE International Conference on Human-Robot Interaction (HRI. IEEE, 244--253.",
      "doi": "10.1145/2909824.3020237"
    },
    {
      "text": "Michal Luria, Guy Hoffman, and Oren Zuckerman. 2017. Comparing social robot, screen and voice interfaces for smart-home control. In Proceedings of the 2017 CHI conference on human factors in computing systems. ACM, 580--628.",
      "doi": "10.1145/3025453.3025786"
    },
    {
      "text": "Cindy Lustig, Priti Shah, Rachael Seidler, and Patricia A Reuter-Lorenz. 2009. Aging, training, and the brain: a review and future directions. Neuropsychology review 19, 4 (2009), 504--522.",
      "doi": ""
    },
    {
      "text": "Valerie Lynn Manusov. 2014. The sourcebook of nonverbal measures: Going beyond words. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Marcus Mast, Michael Burmester, Eva Berner, David Facal, Lucia Pigini, and Lorenzo Blasi. 2010. Semi-autonomous teleoperated learning in-home service robots for elderly care: A qualitative study on needs and perceptions of elderly people, family caregivers, and professional caregivers. In 20th International Conference on Robotics and Mechatronics, Varna, Bulgaria, October 1--6.",
      "doi": ""
    },
    {
      "text": "Claudine McCreadie and Anthea Tinker. 2005. The acceptability of assistive technology to older people. Ageing & Society 25, 1 (2005), 91--110.",
      "doi": ""
    },
    {
      "text": "Benny Megidish, Oren Zuckerman, and Guy Hoffman. 2017. Animating Mechanisms: A Pipeline for Authoring Robot Gestures. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, NY, NY, USA, 45--45. DOI: http://dx.doi.org/10.1145/3029798.3036667",
      "doi": "10.1145/3029798.3036667"
    },
    {
      "text": "Catrin Misselhorn, Ulrike Pompe, and Mog Stapleton. 2013. Ethical considerations regarding the use of social robots in the fourth age. GeroPsych (2013).",
      "doi": ""
    },
    {
      "text": "Oli Mival, Steward Cringean, and David Benyon. 2004. Personification technologies: Developing artificial companions for older people. CHI Fringe, Austria (2004).",
      "doi": ""
    },
    {
      "text": "John E Morley. 2004. The top 10 hot topics in aging. The Journals of Gerontology: Series A 59, 1 (2004), M24--M33.",
      "doi": ""
    },
    {
      "text": "Bilge Mutlu, Takayuki Kanda, Jodi Forlizzi, Jessica Hodgins, and Hiroshi Ishiguro. 2012. Conversational gaze mechanisms for humanlike robots. ACM Transactions on Interactive Intelligent Systems (TiiS) 1, 2 (2012), 12.",
      "doi": "10.1145/2070719.2070725"
    },
    {
      "text": "Ziad S Nasreddine, Natalie A Phillips, Valérie Bédirian, Simon Charbonneau, Victor Whitehead, Isabelle Collin, Jeffrey L Cummings, and Howard Chertkow. 2005. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment. Journal of the American Geriatrics Society 53, 4 (2005), 695--699.",
      "doi": ""
    },
    {
      "text": "Elena Nazzi and Tomas Sokoler. 2015. Augmenting everyday artefacts to support social interaction among senior peers. In Proceedings of the 8th ACM International Conference on PErvasive Technologies Related to Assistive Environments. ACM, 11.",
      "doi": "10.1145/2769493.2769532"
    },
    {
      "text": "Carolijn Ouwehand, Denise TD de Ridder, and Jozien M Bensing. 2007. A review of successful aging models: Proposing proactive coping as an important additional strategy. Clinical psychology review 27, 8 (2007), 873--884.",
      "doi": ""
    },
    {
      "text": "Raymond F Paloutzian and Craig W Ellison. 1982. Loneliness, spiritual well-being and the quality of life. Loneliness: A sourcebook of current theory, research and therapy (1982), 224--237.",
      "doi": ""
    },
    {
      "text": "Martin Pinquart and Silvia Sorensen. 2001. Influences on loneliness in older adults: A meta-analysis. Basic and applied social psychology 23, 4 (2001), 245--266.",
      "doi": ""
    },
    {
      "text": "Lihui Pu, Wendy Moyle, Cindy Jones, and Michael Todorovic. 2018. The effectiveness of social robots for older adults: A systematic review and meta-analysis of randomized controlled studies. The Gerontologist 59, 1 (2018), e37--e51.",
      "doi": ""
    },
    {
      "text": "Hayes Raffle, Rafael Ballagas, Glenda Revelle, Hiroshi Horii, Sean Follmer, Janet Go, Emily Reardon, Koichi Mori, Joseph Kaye, and Mirjana Spasojevic. 2010. Family story play: reading with young children (and elmo) over a distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1583--1592.",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Hayes Raffle, Glenda Revelle, Koichi Mori, Rafael Ballagas, Kyle Buza, Hiroshi Horii, Joseph Kaye, Kristin Cook, Natalie Freed, Janet Go, and others. 2011. Hello, is grandma there? let's read! StoryVisit: family video chat and connected e-books. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1195--1204.",
      "doi": "10.1145/1978942.1979121"
    },
    {
      "text": "Laurel D Riek. 2012. Wizard of oz studies in hri: a systematic review and new reporting guidelines. Journal of Human-Robot Interaction 1, 1 (2012), 119--136.",
      "doi": "10.5898/JHRI.1.1.Riek"
    },
    {
      "text": "Laurel D Riek. 2017. Healthcare robotics. arXiv preprint arXiv:1704.03931 (2017).",
      "doi": ""
    },
    {
      "text": "Hayley Robinson, Bruce MacDonald, and Elizabeth Broadbent. 2014. The role of healthcare robots for older people at home: A review. International Journal of Social Robotics 6, 4 (2014), 575--591.",
      "doi": ""
    },
    {
      "text": "Hayley Robinson, Bruce MacDonald, Ngaire Kerse, and Elizabeth Broadbent. 2013. The psychosocial effects of a companion robot: a randomized controlled trial. Journal of the American Medical Directors Association 14, 9 (2013), 661--667.",
      "doi": ""
    },
    {
      "text": "Karen S Rook. 1987. Close relationships: Ties that heal or ties that bind? Advances in personal relationships (1987), 1--35.",
      "doi": ""
    },
    {
      "text": "JW Rowe and RL Kahn. 1998. Successful aging Pantheon. New York (1998).",
      "doi": ""
    },
    {
      "text": "John W Rowe and Robert L Kahn. 1987. Human aging: usual and successful. Science 237, 4811 (1987), 143--149.",
      "doi": ""
    },
    {
      "text": "Cliodhna Ní Scanaill, Sheila Carew, Pierre Barralon, Norbert Noury, Declan Lyons, and Gerard M Lyons. 2006. A review of approaches to mobility telemonitoring of the elderly in their living environment. Annals of biomedical engineering 34, 4 (2006), 547--563.",
      "doi": ""
    },
    {
      "text": "Amanda Sharkey and Natalie Wood. 2014. The Paro seal robot: demeaning or enabling. In Proceedings of AISB, Vol. 36.",
      "doi": ""
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical ottoman: how robotic furniture offers and withdraws support. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 11--18.",
      "doi": "10.1145/2696454.2696461"
    },
    {
      "text": "Cory-Ann Smarr, Tracy L. Mitzner, Jenay M. Beer, Akanksha Prakash, Tiffany L. Chen, Charles C. Kemp, and Wendy A Rogers. 2014. Domestic robots for older adults: Attitudes, preferences, and potential. International journal of social robotics 6, 2 (2014), 229--247.",
      "doi": ""
    },
    {
      "text": "Shoshanna Sofaer. 1999. Qualitative methods: what are they and why use them? Health services research 34, 5 Pt 2 (1999), 1101.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2016. Towards an analysis framework of technology habituation by older users. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 1021--1033.",
      "doi": "10.1145/2901790.2901806"
    },
    {
      "text": "Wolfgang Spreicer. 2011. Tangible interfaces as a chance for higher technology acceptance by the elderly. In Proceedings of the 12th International Conference on Computer Systems and Technologies. ACM, 311--316.",
      "doi": "10.1145/2023607.2023660"
    },
    {
      "text": "Walter Dan Stiehl, Cynthia Breazeal, Kuk-Hyun Han, Jeff Lieberman, Levi Lalla, Allan Maymin, Jonathan Salinas, Daniel Fuentes, Robert Toscano, Cheng Hau Tong, and others. 2006. The huggable: a therapeutic robotic companion for relational, affective touch. In ACM SIGGRAPH 2006 emerging technologies. ACM, 15.",
      "doi": "10.1145/1179133.1179149"
    },
    {
      "text": "Toshiyo Tamura, Satomi Yonemitsu, Akiko Itoh, Daisuke Oikawa, Akiko Kawakami, Yuji Higashi, Toshiro Fujimooto, and Kazuki Nakajima. 2004. Is an entertainment robot useful in the care of elderly people with severe dementia? The Journals of Gerontology Series A: Biological Sciences and Medical Sciences 59, 1 (2004), M83--M85.",
      "doi": ""
    },
    {
      "text": "Adriana Tapus, Mataric Maja, and Brian Scassellatti. 2007. The grand challenges in socially assistive robotics. (2007).",
      "doi": ""
    },
    {
      "text": "Darrick Tovar-Murray and Maria Tovar-Murray. 2012. A phenomenological analysis of the invisibility syndrome. Journal of multicultural counseling and development 40, 1 (2012), 24--36.",
      "doi": ""
    },
    {
      "text": "Margaret Von Faber, Annetje Bootsma-van der Wiel, Eric van Exel, Jacobijn Gussekloo, Anne M Lagaay, Els van Dongen, Dick L Knook, Sjaak van der Geest, and Rudi GJ Westendorp. 2001. Successful aging in the oldest old: who can be characterized as successfully aged? Archives of internal medicine 161, 22 (2001), 2694--2700.",
      "doi": ""
    },
    {
      "text": "Kazuyoshi Wada, Takanori Shibata, Tomoko Saito, Kayoko Sakamoto, and Kazuo Tanie. 2005. Psychological and social effects of one year robot assisted activity on elderly people at a health service facility for the aged. In Proceedings of the 2005 IEEE international conference on robotics and automation. IEEE, 2785--2790.",
      "doi": ""
    },
    {
      "text": "Robert G. Winningham and Naomi L. Pike. 2007. A cognitive intervention to enhance institutionalized older adults' social support networks and decrease loneliness. Aging & mental health 11, 6 (2007), 716--721.",
      "doi": ""
    },
    {
      "text": "Ya-Huei Wu, Christine Fassert, and Anne-Sophie Rigaud. 2012. Designing robots for the elderly: appearance issue and beyond. Archives of gerontology and geriatrics 54, 1 (2012), 121--126.",
      "doi": ""
    },
    {
      "text": "Mingqian Zhao, Zhutian Chen, Ke Lu, Chaoran Li, Huamin Qu, and Xiaojuan Ma. 2016. Blossom: design of a tangible interface for improving intergenerational communication for the elderly. In Proceedings of the International Symposium on Interactive Technology and Ageing Populations. ACM, 87--98.",
      "doi": "10.1145/2996267.2996276"
    }
  ]
}