{
  "doi": "10.1145/3313831.3376223",
  "title": "Bot or not? User Perceptions of Player Substitution with Deep Player Behavior Models",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "Many online games suffer when players drop off due to lost connections or quitting prematurely, which leads to match terminations or game-play imbalances. While rule-based outcome evaluations or substitutions with bots are frequently used to mitigate such disruptions, these techniques are often perceived as unsatisfactory. Deep learning methods have successfully been used in deep player behavior modelling (DPBM) to produce non-player characters or bots which show more complex behavior patterns than those modelled using traditional AI techniques. Motivated by these findings, we present an investigation of the player-perceived awareness, believability and representativeness, when substituting disconnected players with DPBM agents in an online-multiplayer action game. Both quantitative and qualitative outcomes indicate that DPBM agent substitutes perform similarly to human players and that players were unable to detect substitutions. Notably, players were in fact able to detect substitution with agents driven by more traditional heuristics.",
  "authors": [
    {
      "name": "Johannes Pfau",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/do/10.1145/contrib-99659210831/rel-imgonly/402059_368317296520046_450185021_n.jpg",
      "acmid": "99659210831",
      "orcid": "0000-0002-8760-5023"
    },
    {
      "name": "Jan David Smeddinck",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81456638428/rel-imgonly/jan15ls.jpg",
      "acmid": "81456638428",
      "orcid": "missing"
    },
    {
      "name": "Ioannis Bikas",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528634",
      "orcid": "missing"
    },
    {
      "name": "Rainer Malaka",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100432058",
      "orcid": "0000-0001-6463-4828"
    }
  ],
  "references": [
    {
      "text": "Nintendo Research Development 4. 1985. Super Mario Bros. Game [NES]. (13 September 1985). Nintendo, Kyoto, Japan.",
      "doi": ""
    },
    {
      "text": "Giovanni Acampora, Vincenzo Loia, and Autilia Vitiello. 2012. Improving game bot behaviours through timed emotional intelligence. Knowledge-Based Systems 34 (2012), 97--113.",
      "doi": "10.1016/j.knosys.2012.04.012"
    },
    {
      "text": "Nikola Banovic, Antti Oulasvirta, and Per Ola Kristensson. 2019. Computational Modeling in Human-Computer Interaction. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, W26.",
      "doi": ""
    },
    {
      "text": "Sandra Braman. 2016. Instability and internet design. Internet Policy Review 5, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Fabio Reis Cecin, Rodrigo Real, Rafael de Oliveira Jannone, CF Resin Geyer, Marcio Garcia Martins, and JL Victoria Barbosa. 2004. Freemmg: A scalable and cheat-resistant distribution model for internet games. In Eighth IEEE International Symposium on Distributed Simulation and Real-Time Applications. IEEE, 83--90.",
      "doi": "10.1109/DS-RT.2004.21"
    },
    {
      "text": "Darryl Charles, A Kerr, M McNeill, M McAlister, M Black, J Kcklich, A Moore, and K Stringer. 2005. Player-centred game design: Player modelling and adaptive digital games. In Proceedings of the digital games research conference, Vol. 285. 00100.",
      "doi": ""
    },
    {
      "text": "Nevermind Creations. 2019. Korona:Nemesis. Game [PC]. (18 August 2019).",
      "doi": ""
    },
    {
      "text": "A. Drachen, A. Canossa, and G. N. Yannakakis. 2009. Player modeling using self-organization in Tomb Raider: Underworld. In 2009 IEEE Symposium on Computational Intelligence and Games. 1--8.",
      "doi": ""
    },
    {
      "text": "Anders Drachen, Rafet Sifa, Christian Bauckhage, and Christian Thurau. 2012. Guns, swords and data: Clustering of player behavior in computer games in the wild. In 2012 IEEE conference on Computational Intelligence and Games (CIG). IEEE, 163--170.",
      "doi": ""
    },
    {
      "text": "Nintendo EAD. 1986. The Legend of Zelda. Game [NES]. (21 February 1986). Nintendo EAD, Kyoto, Japan.",
      "doi": ""
    },
    {
      "text": "Nintendo EAD. 2014. Mario Kart 8. Game [WiiU,Switch]. (29 May 2014). Nintendo EAD, Kyoto, Japan. Played 2019.",
      "doi": ""
    },
    {
      "text": "Christoph Eggert, Marc Herrlich, Jan Smeddinck, and Rainer Malaka. 2015. Classification of player roles in the team-based multi-player game dota 2. In International Conference on Entertainment Computing. Springer, 112--125.",
      "doi": ""
    },
    {
      "text": "Blizzard Entertainment. 2015. Heroes of the Storm. Game [PC]. (2 June 2015). Blizzard Entertainment, Irvine, CA, USA. Played 2017.",
      "doi": ""
    },
    {
      "text": "Relic Entertainment. 2013. Company of Heroes 2. Game [PC]. (25 June 2013). Relic Entertainment, Vancouver, Canada. Played 2017.",
      "doi": ""
    },
    {
      "text": "Firaxis Games. 2010. Civilization V. Game [PC]. (21 September 2010). Firaxis Games, Hunt Valley, Maryland. Played 2017.",
      "doi": ""
    },
    {
      "text": "Chengjie Gu, Shunyi Zhang, Xiaozhen Xue, and He Huang. 2011. Online wireless mesh network traffic classification using machine learning. Journal of Computational Information Systems 7, 5 (2011), 1524--1532.",
      "doi": ""
    },
    {
      "text": "Yong Guo, Siqi Shen, Otto Visser, and Alexandru Iosup. 2012. An analysis of online match-based games. In 2012 IEEE International Workshop on Haptic Audio Visual Environments and Games (HAVE 2012) Proceedings. IEEE, 134--139.",
      "doi": ""
    },
    {
      "text": "Brian Guthrie, Kevin Reuter, Michael Barkdoll, and Henry Hexmoor. 2014. Small team group dynamics in online games. COOS: Scope and theme (2014), 42.",
      "doi": ""
    },
    {
      "text": "Christoffer Holmgård, Antonios Liapis, Julian Togelius, and Georgios N Yannakakis. 2014a. Evolving personas for player decision modeling. In 2014 IEEE Conference on Computational Intelligence and Games. IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Christoffer Holmgård, Antonios Liapis, Julian Togelius, and Georgios N Yannakakis. 2014b. Generative agents for player decision modeling in games. In FDG '14. Citeseer.",
      "doi": ""
    },
    {
      "text": "Christoffer Holmgård, Julian Togelius, and Georgios N Yannakakis. 2013. Decision making styles as deviation from rational action: A super mario case study. In Ninth Artificial Intelligence and Interactive Digital Entertainment Conference.",
      "doi": ""
    },
    {
      "text": "Shay Horovitz and Danny Dolev. 2009. Collabrium: Active traffic pattern prediction for boosting P2P collaboration. In 2009 18th IEEE International Workshops on Enabling Technologies: Infrastructures for Collaborative Enterprises. IEEE, 116--121.",
      "doi": "10.1109/WETICE.2009.25"
    },
    {
      "text": "Arnaud Kaiser, Dario Maggiorini, Nadjib Achir, and Khaled Boussetta. 2009. On the objective evaluation of real-time networked games. In GLOBECOM 2009--2009 IEEE Global Telecommunications Conference. IEEE, 1--5.",
      "doi": ""
    },
    {
      "text": "Ahmed Khalifa, Aaron Isaksen, Julian Togelius, and Andy Nealen. 2016. Modifying MCTS for Human-Like General Video Game Playing.. In IJCAI. 2514--2520.",
      "doi": ""
    },
    {
      "text": "Chris Lewis and Noah Wardrip-Fruin. 2010. Mining game statistics from web services: a World of Warcraft armory case study. In Proceedings of the Fifth International Conference on the Foundations of Digital Games. Citeseer, 100--107.",
      "doi": "10.1145/1822348.1822362"
    },
    {
      "text": "Tobias Mahlmann, Anders Drachen, Julian Togelius, Alessandro Canossa, and Georgios N Yannakakis. 2010. Predicting player behavior in tomb raider: Underworld. In Proceedings of the 2010 IEEE Conference on Computational Intelligence and Games. IEEE, 178--185.",
      "doi": ""
    },
    {
      "text": "Philip Mildner, Tonio Triebel, Stephan Kopf, and Wolfgang Effelsberg. 2011. A scalable Peer-to-Peer-overlay for real-time massively multiplayer online games. In Proceedings of the 4th international ICST conference on simulation tools and techniques. ICST (Institute for Computer Sciences, Social-Informatics and ..., 304--311.",
      "doi": ""
    },
    {
      "text": "Maximiliano Miranda, Antonio A Sánchez-Ruiz, and Federico Peinado. 2016. A Neuroevolution Approach to Imitating Human-Like Play in Ms. Pac-Man Video Game.. In CoSECivi. 113--124.",
      "doi": ""
    },
    {
      "text": "Olana Missura and Thomas Gärtner. 2009. Player Modeling for Intelligent Difficulty Adjustment. In Discovery Science, João Gama, Vítor Santos Costa, Alípio Mário Jorge, and Pavel B. Brazdil (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 197--211.",
      "doi": ""
    },
    {
      "text": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Martin Riedmiller, Andreas K Fidjeland, Georg Ostrovski, and others. 2015. Human-level control through deep reinforcement learning. Nature 518, 7540 (2015), 529.",
      "doi": ""
    },
    {
      "text": "Ryan M Moeller, Bruce Esplin, Steven Conway, and others. 2009. Cheesers, pullers, and glitchers: The rhetoric of sportsmanship and the discourse of online sports gamers. Game Studies 9, 2 (2009).",
      "doi": ""
    },
    {
      "text": "K Mørch. 2003. Cheating in online games-threats and solutions. Publication No: DART/01/03. January (2003).",
      "doi": ""
    },
    {
      "text": "NCsoft. 2003. Lineage 2. Game [PC]. (1 October 2003). NCSoft, Seongnam, South Korea.",
      "doi": ""
    },
    {
      "text": "Juan Ortega, Noor Shaker, Julian Togelius, and Georgios N Yannakakis. 2013. Imitating human playing styles in super mario bros. Entertainment Computing 4, 2 (2013), 93--104.",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2018. Towards Deep Player Behavior Models in MMORPGs. In Annual Symp. on Computer-Human Interaction in Play Ext. Abstracts (CHI PLAY '18). ACM, NY, NY, USA, 381--92.",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2019. Deep Player Behavior Models: Evaluating a Novel Take on Dynamic Difficulty Adjustment. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, LBW0171.",
      "doi": "10.1145/3290607.3312899"
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2020. Enemy Within: Long-term Motivation Effects of Deep Player Behavior Models for Dynamic Difficulty Adjustment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3313831.3376423"
    },
    {
      "text": "Jared N Plumb, Sneha Kumar Kasera, and Ryan Stutsman. 2018. Hybrid network clusters using common gameplay for massively multiplayer online games. In Proceedings of the 13th International Conference on the Foundations of Digital Games. ACM, 2.",
      "doi": "10.1145/3235765.3235785"
    },
    {
      "text": "Psyonix. 2015. Rocket League. Game [PC,XboxOne,PS4,Switch]. (7 July 2015).",
      "doi": ""
    },
    {
      "text": "Rosslin John Robles, Sang-Soo Yeo, Young-Deuk Moon, Gilcheol Park, and Seoksoo Kim. 2008. Online games and security issues. In 2008 Second International Conference on Future Generation Communication and Networking, Vol. 2. IEEE, 145--148.",
      "doi": "10.1109/FGCN.2008.199"
    },
    {
      "text": "Robert Rosenthal and Kermit L Fode. 1963. The effect of experimenter bias on the performance of the albino rat. Behavioral Science 8, 3 (1963), 183--189.",
      "doi": ""
    },
    {
      "text": "Kyong Jin Shim, Richa Sharan, and Jaideep Srivastava. 2010. Player performance prediction in massively multiplayer online role-playing games (MMORPGs). In Pacific-Asia Conference on Knowledge Discovery and Data Mining. Springer, 71--80.",
      "doi": "10.1007/978-3-642-13672-6_8"
    },
    {
      "text": "David Silver, Aja Huang, Chris J. Maddison, Arthur Guez, and Laurent Sifre et al. 2016. Mastering the game of Go with deep neural networks and tree search. Nature 529 (2016), 484--489.",
      "doi": ""
    },
    {
      "text": "Adam M. Smith, Chris Lewis, Kenneth Hullet, Gillian Smith, and Anne Sullivan. 2011. An Inclusive View of Player Modeling. In Proceedings of the 6th International Conference on Foundations of Digital Games (FDG '11). ACM, NY, NY, USA, 301--303.",
      "doi": "10.1145/2159365.2159419"
    },
    {
      "text": "First Star Software. 1984. Boulder Dash. Game [Atari]. (1984). First Star Software, New York City, NY.",
      "doi": ""
    },
    {
      "text": "BANDAI NAMCO Studios Inc Sora Ltd. 2014. Super Smash Bros. for Nintendo 3DS / for Wii U. Game [WiiU,3DS]. (13 September 2014). Sora Ltd, BANDAI NAMCO Studios Inc, Tokyo, Japan. Played 2017.",
      "doi": ""
    },
    {
      "text": "Gabriel Synnaeve and Pierre Bessière. 2011. Bayesian modeling of a human MMORPG player. In AIP Conference Proceedings, Vol. 1305. AIP, 67--74.",
      "doi": ""
    },
    {
      "text": "Marco Tamassia, William Raffe, Rafet Sifa, Anders Drachen, Fabio Zambetta, and Michael Hitchens. 2016. Predicting player churn in destiny: A hidden markov models approach to predicting player departure in a major online game. In 2016 IEEE Conference on Computational Intelligence and Games (CIG). IEEE, 1--8.",
      "doi": "10.1109/CIG.2016.7860431"
    },
    {
      "text": "Gerald Tesauro. 1994. TD-Gammon, a self-teaching backgammon program, achieves master-level play. Neural computation 6, 2 (1994), 215--219.",
      "doi": ""
    },
    {
      "text": "Julian Togelius, Renzo De Nardi, and Simon M LUniversity of Chinese Academy of Sciences. 2006. Making racing fun through player modeling and track evolution. (2006).",
      "doi": ""
    },
    {
      "text": "Emmett Tomai and Roberto Flores. 2014. Adapting in-game agent behavior by observation of players using learning behavior trees. In FDG '14.",
      "doi": ""
    },
    {
      "text": "AM Turing. 1950. Mind. Mind 59, 236 (1950), 433--460.",
      "doi": ""
    },
    {
      "text": "Iskander Umarov and Maxim Mozgovoy. 2014. Creating believable and effective AI agents for games and simulations: Reviews and case study. In Contemporary Advancements in Information Technology Development in Dynamic Environments. IGI Global, 33--57.",
      "doi": ""
    },
    {
      "text": "Valve. 2008. Left 4 Dead. Game [PC]. (18 November 2008). Valve, Bellevue, WA, USA. Played 2017.",
      "doi": ""
    },
    {
      "text": "Amir Yahyavi and Bettina Kemme. 2013. Peer-to-peer architectures for massively multiplayer online games: A survey. ACM Computing Surveys (CSUR) 46, 1 (2013), 9.",
      "doi": "10.1145/2522968.2522977"
    },
    {
      "text": "Huan Yan, Chunfeng Yang, Donghan Yu, Yong Li, Depeng Jin, and Dah-Ming Chiu. 2019. Multi-site user behavior modeling and its application in video recommendation. IEEE Transactions on Knowledge and Data Engineering (2019).",
      "doi": "10.1109/TKDE.2019.2926078"
    },
    {
      "text": "Jeff Yan and Brian Randell. 2005. A systematic classification of cheating in online games. In Proceedings of 4th ACM SIGCOMM workshop on Network and system support for games. ACM, 1--9.",
      "doi": "10.1145/1103599.1103606"
    },
    {
      "text": "Jeff Yan and Brian Randell. 2009. An investigation of cheating in online games. IEEE Security & Privacy 7, 3 (2009), 37--44.",
      "doi": "10.1109/MSP.2009.60"
    },
    {
      "text": "Georgios N Yannakakis, Pieter Spronck, Daniele Loiacono, and Elisabeth André. 2013. Player modeling. Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik.",
      "doi": ""
    },
    {
      "text": "George Yee, Larry Korba, Ronggong Song, and Ying-Chieh Chen. 2006. Towards designing secure online games. In 20th International Conference on Advanced Information Networking and Applications-Volume 1 (AINA'06), Vol. 2. IEEE, 44--48.",
      "doi": "10.1109/AINA.2006.333"
    },
    {
      "text": "Hongzhi Yin, Bin Cui, Ling Chen, Zhiting Hu, and Xiaofang Zhou. 2015. Dynamic user modeling in social media systems. ACM Transactions on Information Systems (TOIS) 33, 3 (2015), 10.",
      "doi": "10.1145/2699670"
    }
  ]
}