{
  "doi": "10.1145/3313831.3376187",
  "title": "Experiential Qualities of Whispering with Voice Assistants",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present a Research through Design project that explores how whispering influences the ways people experience and interact with voice assistants. The research project includes a co-speculation workshop and the use of a design probe, which culminated in the production of a design fiction short film. Our design-led inquiry contributes with experiential qualities of whispering with voice assistants: creepiness, trust, and intimacy. Furthermore, we present how whispering opens up new dimensions of how and when voice interaction could be used. We propose that designers of whispering voice assistants should reflect on how they facilitate the experiential qualities of creepiness, trust, and intimacy, and reflect on the potential challenges whispering brings to the relation between a user and a voice assistant.",
  "tags": [
    "experiential qualities",
    "whispering",
    "voice interaction",
    "voice assistants",
    "design fiction",
    "research through design"
  ],
  "authors": [
    {
      "name": "Emmi Parviainen",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659178956",
      "orcid": "missing"
    },
    {
      "name": "Marie Louise Juul Søndergaard",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658708108",
      "orcid": "0000-0002-9884-0205"
    }
  ],
  "references": [
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 3 (2019), 17.",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic interaction: designing for a proximity and orientation-aware environment. In ACM International Conference on Interactive Tabletops and Surfaces. ACM, 121--130.",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest proposals: Research through design and knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2093--2102.",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Mark Blythe. 2017. Research Fiction: Storytelling, Plot and Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5400--5411. DOI: http://dx.doi.org/10.1145/3025453.3026023",
      "doi": "10.1145/3025453.3026023"
    },
    {
      "text": "Herbert H Clark. 1996. Using language. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins, Jeremy E. Viny, Cayla Key, and Nouela Johnston. 2019. Alternative Avenues for IoT: Designing with Non-Stereotypical Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 351, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300581",
      "doi": "10.1145/3290605.3300581"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \"Hey Google is It OK if I Eat You?\": Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, NY, NY, USA, 595--600. DOI: http://dx.doi.org/10.1145/3078072.3084330",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Justin Edwards and Elaheh Sanoubari. 2019. A Need for Trust in Conversational Interface Research. In Proceedings of the 1st International Conference on Conversational User Interfaces (CUI '19). ACM, NY, NY, USA, Article 21, 3 pages. DOI: http://dx.doi.org/10.1145/3342775.3342809",
      "doi": "10.1145/3342775.3342809"
    },
    {
      "text": "Nicholas Epley, Adam Waytz, and John T Cacioppo. 2007. On seeing human: a three-factor theory of anthropomorphism. Psychological review 114, 4 (2007), 864.",
      "doi": ""
    },
    {
      "text": "Sidney Fels. 2000. Intimacy and embodiment: implications for art and technology. In Proceedings of the 2000 ACM workshops on Multimedia. ACM, 13--16.",
      "doi": "10.1145/357744.357749"
    },
    {
      "text": "Ed Finn. What Algorithms Want: Imagination in the Age of Computing (reprint edition ed.). MIT Press.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 937--946.",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Heather M Gray, Kurt Gray, and Daniel M Wegner. 2007. Dimensions of mind perception. science 315, 5812 (2007), 619--619.",
      "doi": ""
    },
    {
      "text": "Kurt Gray and Daniel M Wegner. 2012. Feeling robots and human zombies: Mind perception and the uncanny valley. Cognition 125, 1 (2012), 125--130.",
      "doi": ""
    },
    {
      "text": "Konstantinos Grivas. 2006. Digital Selves: Devices for intimate communications between homes. Personal and Ubiquitous Computing 10, 2--3 (2006), 66--76.",
      "doi": "10.1007/s00779-005-0003-1"
    },
    {
      "text": "Edward Twitchell Hall. 1910. The hidden dimension. Vol. 609. Garden City, NY: Doubleday.",
      "doi": ""
    },
    {
      "text": "Edward T Hall, Ray L Birdwhistell, Bernhard Bock, Paul Bohannan, A Richard Diebold Jr, Marshall Durbin, Munro S Edmonson, JL Fischer, Dell Hymes, Solon T Kimball, and others. 1968. Proxemics [and comments and replies]. Current anthropology 9, 2/3 (1968), 83--108.",
      "doi": ""
    },
    {
      "text": "Mizuki Hisaka. 2018. Amazon Alexa Will Now Whisper Back To You, But Some People Find It ?Creepy'. (2018). Retrieved Aug 20, 2019 from https://www.inquisitr.com/5123302/amazon-alexa-will-nowwhisper-back-to-you-but-some-people-find-it-creepy/",
      "doi": ""
    },
    {
      "text": "David S. Jackson. 1998. Palm-To-Palm Combat. (1998). Retrieved September 19, 2019 from http://content.time.com/time/magazine/article/ 0,9171,987979,00.html",
      "doi": ""
    },
    {
      "text": "Lars-Erik Janlert and Erik Stolterman. 2015. Faceless Interaction-A Conceptual Examination of the Notion of Interface: Past, Present, and Future. Human--Computer Interaction 30, 6 (2015), 507--539.",
      "doi": "10.1080/07370024.2014.944313"
    },
    {
      "text": "Joris H Janssen, Jeremy N Bailenson, Wijnand A IJsselsteijn, and Joyce HDM Westerink. 2010. Intimate heartbeats: Opportunities for affective communication technology. IEEE Transactions on Affective Computing 1, 2 (2010), 72--80.",
      "doi": "10.1109/T-AFFC.2010.13"
    },
    {
      "text": "Wendy Ju and Larry Leifer. 2008. The design of implicit interactions: Making interactive systems less obnoxious. Design Issues 24, 3 (2008), 72--84.",
      "doi": ""
    },
    {
      "text": "Michael Karlesky and Katherine Isbister. 2014a. Designing for the physical margins of digital workspaces: fidget widgets in support of productivity and creativity. In Proceedings of the 8th international conference on tangible, embedded and embodied interaction. ACM, 13--20.",
      "doi": ""
    },
    {
      "text": "Michael Karlesky and Katherine Isbister. 2014b. Fidget widgets: designing for the physical margins of digital workspaces. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 301--304.",
      "doi": "10.1145/2540930.2540978"
    },
    {
      "text": "Michael Karlesky and Katherine Isbister. 2016. Understanding Fidget Widgets: Exploring the Design Space of Embodied Self-Regulation. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM, 38.",
      "doi": "10.1145/2971485.2971557"
    },
    {
      "text": "Sunok Lee, Sungbae Kim, and Sangsu Lee. 2019. \"What Does Your Agent Look Like?\": A Drawing Study to Understand Users' Perceived Persona of Conversational Agent. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Article LBW0143, 6 pages. DOI: http://dx.doi.org/10.1145/3290607.3312796",
      "doi": "10.1145/3290607.3312796"
    },
    {
      "text": "Xinghua Li. 2011. Whispering: the murmur of power in a lo-fi world. Media, Culture & Society 33, 1 (2011), 19--34.",
      "doi": ""
    },
    {
      "text": "Yong Yates Lin, Zhengyi Le, Eric Becker, and Fillia Makedon. 2010. Acoustical implicit communication in human-robot interaction. In Proceedings of the 3rd International Conference on PErvasive Technologies Related to Assistive Environments. ACM, 5.",
      "doi": "10.1145/1839294.1839300"
    },
    {
      "text": "Mallory Locklear. 2019. Microsoft patent suggests you inhale whisper to your voice assistants. (2019). Retrieved September 8, 2019 from https://www.engadget.com/2019/01/03/microsoft-patentwhisper-voice-assistants/",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren. 2007. Pliability as an experiential quality: Exploring the aesthetics of interaction design. Artifact: Journal of Design Practice 1, 2 (2007), 85--95.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero. 2018. Living Without a Mobile Phone: An Autoethnography. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 765--776. DOI: http://dx.doi.org/10.1145/3196709.3196731",
      "doi": "10.1145/3196709.3196731"
    },
    {
      "text": "Trieuvy Luu, Martijn van den Broeck, and Marie Louise Juul Sondergaard. 2018. Data economy: interweaving storytelling and world building in design fiction. In 10th Nordic Conference on Human-Computer Interaction (NORDICHI). ACM Digital Library, 771--786.",
      "doi": ""
    },
    {
      "text": "Roderick Murray-Smith, John Williamson, Stephen Hughes, Torben Quaade, and Steven Strachan. 2008. Rub the stane. In CHI'08 Extended Abstracts on Human Factors in Computing Systems. ACM, 2355--2360.",
      "doi": "10.1145/1358628.1358683"
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2000. Does computer-generated speech manifest personality? An experimental test of similarity-attraction. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 329--336.",
      "doi": "10.1145/332040.332452"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 72--78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Doenja Oogjes and Ron Wakkary. 2017. Videos of Things: Speculating on, Anticipating and Synthesizing Technological Mediations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 4489--4500. DOI: http://dx.doi.org/10.1145/3025453.3025748",
      "doi": "10.1145/3025453.3025748"
    },
    {
      "text": "Emmi Parviainen and Marie Louise Juul Søndergaard. 2019. ONE. (2019). Retrieved Jan 8, 2020 from https://vimeo.com/383497295",
      "doi": ""
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 45.",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 640, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Copenhangen Pride, Virtue, Equal AI, Koalition Interactive, and thirtysoundsgood. 2019. Meet Q The First Genderless Voice. (2019). Retrieved June 4, 2019 from http://www.genderlessvoice.com",
      "doi": ""
    },
    {
      "text": "Pramila Rani, Nilanjan Sarkar, and Julie Adams. 2007. Anxiety-based affective communication for implicit human--machine interaction. Advanced Engineering Informatics 21, 3 (2007), 323--334.",
      "doi": "10.1016/j.aei.2006.11.009"
    },
    {
      "text": "Erika Rawes. 2018. How to Enable Whisper Mode on Alexa. (2018). Retrieved March 13, 2019 from https://www.digitaltrends.com/home/how-to-enablewhisper-mode-on-alexa/",
      "doi": ""
    },
    {
      "text": "Johan Redström. Making Design Theory. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2019. Conversation Considered Harmful?. In Proceedings of the 1st International Conference on Conversational User Interfaces (CUI '19). ACM, NY, NY, USA, Article 10, 3 pages. DOI: http://dx.doi.org/10.1145/3342775.3342796",
      "doi": "10.1145/3342775.3342796"
    },
    {
      "text": "Jon Rogers, Loraine Clarke, Martin Skelly, Nick Taylor, Pete Thomas, Michelle Thorne, Solana Larsen, Katarzyna Odrozek, Julia Kloiber, Peter Bihr, and others. 2019. Our Friends Electric: Reflections on Advocacy and Design Research for the Voice Enabled Internet. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 114.",
      "doi": "10.1145/3290605.3300344"
    },
    {
      "text": "R. Murray Schafer. Soundscape: Our Sonic Environment and the Tuning of the World (original ed. edition ed.). Destiny Books.",
      "doi": ""
    },
    {
      "text": "Albrecht Schmidt. 2000. Implicit human computer interaction through context. Personal technologies 4, 2--3 (2000), 191--199.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 857--868. DOI: http://dx.doi.org/10.1145/3196709.3196772",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Irina Shklovski, Scott D Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and creepiness in app space: Perceptions of privacy and mobile app use. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2347--2356.",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures: Staying with the Trouble of Digital Personal Assistants through Design Fiction. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 869--880.",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Yolande Strengers, Jenny Kennedy, Paula Arcari, Larissa Nicholls, and Melissa Gregg. 2019. Protection, Productivity and Pleasure in the Smart Home: Emerging Expectations and Gendered Insights from Australian Early Adopters. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 645, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300875",
      "doi": "10.1145/3290605.3300875"
    },
    {
      "text": "Selina Jeanne Sutton, Paul Foulkes, David Kirk, and Shaun Lawson. 2019. Voice As a Design Material: Sociophonetic Inspired Design Strategies in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 603, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300833",
      "doi": "10.1145/3290605.3300833"
    },
    {
      "text": "Joshua Tanenbaum. 2014. Design fictional interactions: why HCI should care about stories. interactions 21, 5 (2014), 22--23.",
      "doi": "10.1145/2648414"
    },
    {
      "text": "Omer Tene and Jules Polonetsky. 2013. A theory of creepy: technology, privacy and shifting social norms. Yale JL & Tech. 16 (2013), 59.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making Design Probes Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3441--3450. DOI: http://dx.doi.org/10.1145/2470654.2466473",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Jason C Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is Scary, but Farting is Cute: A Conceptual Model of Children's Perspectives of Creepy Technologies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 73.",
      "doi": "10.1145/3290605.3300303"
    }
  ]
}