{
  "doi": "10.1145/3313831.3376759",
  "title": "On Pause: How Online Instructional Videos are Used to Achieve Practical Tasks",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Instructional videos have become an important site of everyday learning. This paper explores how these videos are used to complete practical tasks, analyzing video-recorded interactions between pairs of users. Users need to repeatedly pause their videos to be able to follow the instructions, and we document how pausing is used to coordinate and interweave watching and doing. We describe four purposes and types of pausing: finding task objects, turning to action, keeping up, and fixing problems. Building on these results, we discuss how video players could better support following instructions, and the role of basic user interface functions in complex tasks involving different forms of engagement with the physical world and with screen-based activity.",
  "authors": [
    {
      "name": "Sylvaine Tuncer",
      "institution": "Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161293",
      "orcid": "missing"
    },
    {
      "name": "Barry Brown",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    },
    {
      "name": "Oskar Lindwall",
      "institution": "University of Gothenburg, Göteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316489303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Wayne A. Beach. 1993. Transitional regularities for 'casual' \"Okay\" usages. J. Pragmat. 19, 4 (1993), 325--352.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Moira McGregor, and Donald McMillan. 2015. Searchable Objects: Search in Everyday Conversation. ACM Press, In Press.",
      "doi": "10.1145/2675133.2675206"
    },
    {
      "text": "Barry Brown, Kenton O'hara, Moira Mcgregor, and Donald Mcmillan. 2018. Text in Talk: Lightweight Messages in Co-Present Interaction. ACM Trans Comput-Hum Interact 24, 6 (January 2018), 42:1--42:25. DOI:https://doi.org/10.1145/3152419",
      "doi": "10.1145/3152419"
    },
    {
      "text": "Graham Button (Ed.). 1993. Technology in working order: studies of work, interaction and technology. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Anh Truong, Oliver Wang, Maneesh Agrawala, and Juho Kim. 2019. How to design voice based navigation for how-to videos. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, 701.",
      "doi": "10.1145/3290605.3300931"
    },
    {
      "text": "Kai-Yin Cheng, Sheng-Jie Luo, Bing-Yu Chen, and Hao-Hua Chu. 2009. SmartPlayer: user-centric video fast-forwarding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 789--798.",
      "doi": "10.1145/1518701.1518823"
    },
    {
      "text": "Giovanni Circella, Patricia L. Mokhtarian, and Laura K. Poff. 2012. A conceptual typology of multitasking behavior and polychronicity preferences. Electron. Int. J. Time Use Res. 9, 1 (November 2012), 59--107. DOI:https://doi.org/10.13085/eIJTUR.9.1.59--107",
      "doi": ""
    },
    {
      "text": "Chris Crockford and Harry Agius. 2006. An empirical investigation into user navigation of digital video using the VCR-like control set. Int. J. Hum.-Comput. Stud. 64, 4 (2006), 340--355.",
      "doi": "10.1016/j.ijhcs.2005.08.012"
    },
    {
      "text": "Pierre Dragicevic, Gonzalo Ramos, Jacobo Bibliowitcz, and Derek Nowrouzezahrai. 2008. Video browsing by direct manipulation. Proc. SIGCHI Conf. Hum. Factors Comput. Syst. ACM (2008), 237--246.",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Benoît Encelle, Magali Ollagnier Beldame, and Yannick Prié. 2013. Towards the usage of pauses in audio-described videos. In Proceedings of the 10th International Cross-Disciplinary Conference on Web Accessibility - W4A '13, ACM Press, Rio de Janeiro, Brazil, 1. DOI:https://doi.org/10.1145/2461121.2461130",
      "doi": "10.1145/2461121.2461130"
    },
    {
      "text": "Harold Garfinkel. 1967. Studies in Ethnomethodology. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel and Anne Rawls. 2002. Ethnomethodology's Program. Rowman & Littlefield Publishers, Inc.",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel and Harvey Sacks. 1970. On formal structures of practical actions. In Theoretical Sociology: Perspectives and development (J. McKinney & E. Tiryakian). Appleton Century Crofts, New York, 337--366.",
      "doi": ""
    },
    {
      "text": "Pentti Haddington, Tiina Keisanen, Lorenza Mondada, and Maurice Nevile (Eds.). 2014. Multiactivity in Social Interaction: Beyond multitasking. John Benjamins Publishing Company, Amsterdam. DOI:https://doi.org/10.1075/z.187",
      "doi": ""
    },
    {
      "text": "Mariam Hassib, Mohamed Khamis, Susanne Friedl, Stefan Schneegass, and Florian Alt. 2017. Brainatwork: logging cognitive engagement and tasks in the workplace using electroencephalography. In Proceedings of the 16th international conference on mobile and ubiquitous multimedia, ACM, 305--310.",
      "doi": "10.1145/3152832.3152865"
    },
    {
      "text": "Christian Heath and Paul Luff. 2000. Technology in Action. Cambridge University Press.",
      "doi": "10.5555/556346"
    },
    {
      "text": "John Heritage. 1984. A change-of-state token and aspects of its sequential placement. In Structures of social action (J. M. Atkinson & J. Heritage (Eds.)). 299-345.",
      "doi": ""
    },
    {
      "text": "Jon Hindmarsh, Patricia Reynolds, and Stephen Dunne. 2011. Exhibiting understanding: The body in apprenticeship. J. Pragmat. 43, 2 (2011), 489--503.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the body: somaesthetic interaction design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Leelo Keevallik. 2015. Coordinating the temporalities of talk and dance. Temporality Interact. (2015), 309--336.",
      "doi": ""
    },
    {
      "text": "Susan Kenyon. 2010. What do we mean by multitasking? - Exploring the need for methodological clarification in time use research. Electron. Int. J. Time Use Res. 7, 1 (November 2010), 42--60. DOI:https://doi.org/10.13085/eIJTUR.7.1.42--60",
      "doi": ""
    },
    {
      "text": "Seungwon Kim, Sasa Junuzovic, and Kori Inkpen. 2014. The Nomad and the Couch Potato: Enriching Mobile Shared Experiences with Contextual Information. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14), ACM, New York, NY, USA, 167--177. DOI:https://doi.org/10.1145/2660398.2660409",
      "doi": "10.1145/2660398.2660409"
    },
    {
      "text": "Ben Lafreniere, Andrea Bunt, Matthew Lount, and Michael Terry. 2013. Understanding the roles and uses of web tutorials. In Seventh International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Walter S. Lasecki, Raja Kushalnagar, and Jeffrey P. Bigham. 2014. Helping students keep up with real-time captions by pausing and highlighting. In Proceedings of the 11th Web for All Conference on - W4A '14, ACM Press, Seoul, Korea, 1--8. DOI:https://doi.org/10.1145/2596695.2596701",
      "doi": ""
    },
    {
      "text": "Eric Laurier, Barry Brown, and Moira McGregor. 2015. Mediated Pedestrian Mobility: Walking and the Map App. Mobilities (2015), 1--18.",
      "doi": ""
    },
    {
      "text": "Eric Livingston. 2008. Ethnographies of reason. Routledge.",
      "doi": ""
    },
    {
      "text": "Michael Lynch, Eric Livingston, and Harold Garfinkel. 1983. Temporal Order in Laboratory Life. S. 205--238 in: KD Knorr Cetina & M. Mulkay (Hrsg.), Science Observed: Perspectives on the Social Study of Science. London: Sage.",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2013. Swifter: improved online video scrubbing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1159--1168.",
      "doi": "10.1145/2470654.2466149"
    },
    {
      "text": "Helen Melander and Fritjof Sahlström. 2009. Learning to fly-The progressive development of situation awareness. Scand. J. Educ. Res. 53, 2 (2009), 151--166.",
      "doi": ""
    },
    {
      "text": "David Mogensen. 2015. I Want-to-Do Moments: From Home to Beauty. Think with Google. Retrieved September 18, 2019 from https://www.thinkwithgoogle.com/marketing-resources/micro-moments/i-want-to-do-micro-moments/",
      "doi": ""
    },
    {
      "text": "Lorenza Mondada. 2016. Challenges of multimodality: Language and the body in social interaction. J. Socioling. 20, 3 (June 2016), 336--366. DOI:https://doi.org/10.1111/josl.1_12177",
      "doi": ""
    },
    {
      "text": "Bonnie A. Nardi, Steve Whittaker, and Erin Bradner. 2000. Interaction and Outeraction: Instant Messaging in Action. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (CSCW '00), ACM, New York, NY, USA, 79--88. DOI:https://doi.org/10.1145/358916.358975",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Cuong Nguyen and Feng Liu. 2015. Making software tutorial video responsive. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1565--1568.",
      "doi": "10.1145/2702123.2702209"
    },
    {
      "text": "Amy Ogan, Vincent Aleven, and Christopher Jones. 2008. Pause, predict, and ponder: use of narrative videos to improve cultural discussion and learning. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08, ACM Press, Florence, Italy, 155. DOI:https://doi.org/10.1145/1357054.1357081",
      "doi": ""
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pause-and-play: automatically linking screencast video tutorials with applications. In Proceedings of the 24th annual ACM symposium on User interface software and technology, ACM, 135--144.",
      "doi": ""
    },
    {
      "text": "Mirka Rauniomaa, Pentti Haddington, Helen Melander, Anne-Danièle Gazin, Mathias Broth, Jakob Cromdal, Lena Levin, and Paul McIlvenny. 2018. Parsing tasks for the mobile novice in real time: Orientation to the learner's actions and to spatial and temporal constraints in instructing-on-the-move. J. Pragmat. 128, (2018), 30--52.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks. 1995. Lectures on conversation: vol 1 & 2. Basil Blackwell, Oxford.",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff. 2007. Sequence organization in interaction: Volume 1: A primer in conversation analysis. Cambridge University Press. Retrieved September 20, 2016 from https://www.google.com/books?hl=en&lr=&id=5XbJRFQ4dhsC&oi=fnd&pg=PR11&dq=sequence+organization&ots=MjA2ETTY1r&sig=p1-_6UkzJWSJrDeDKftpm3nnn-A",
      "doi": ""
    },
    {
      "text": "Emanuel Schegloff, Gail Jefferson, and Harvey Sacks. 1974. A simplest systematics for the organization of turn-taking for conversation. Language 50, 4 (1974), 696--735.",
      "doi": ""
    },
    {
      "text": "Lucille Alice Suchman. 2007. Human-machine reconfigurations: plans and situated actions. Cambridge University Press, Cambridge; New York.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, and Steve Benford. 2008. \"Are You Watching This Film or What?\": Interruption and the Juggling of Cohorts. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08), ACM, New York, NY, USA, 257--266. DOI:https://doi.org/10.1145/1460563.1460605",
      "doi": "10.1145/1460563.1460605"
    },
    {
      "text": "Wojciech H. Zurek (Ed.). 1990. Complexity, Entropy and the Physics of Information (1 edition ed.). Westview Press, Redwood City, Calif.",
      "doi": ""
    }
  ]
}