{
  "doi": "10.1145/3313831.3376613",
  "title": "Embodied Axes: Tangible, Actuated Interaction for 3D Augmented Reality Data Spaces",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We present Embodied Axes, a controller which supports selection operations for 3D imagery and data visualisations in Augmented Reality. The device is an embodied representation of a 3D data space -- each of its three orthogonal arms corresponds to a data axis or domain specific frame of reference. Each axis is composed of a pair of tangible, actuated range sliders for precise data selection, and rotary encoding knobs for additional parameter tuning or menu navigation. The motor actuated sliders support alignment to positions of significant values within the data, or coordination with other input: e.g., mid-air gestures in the data space, touch gestures on the surface below the data, or another Embodied Axes device supporting multi-user scenarios. We conducted expert enquiries in medical imaging which provided formative feedback on domain tasks and refinements to the design. Additionally, a controlled user study was performed and found that the Embodied Axes was overall more accurate than conventional tracked controllers for selection tasks.",
  "authors": [
    {
      "name": "Maxime Cordeil",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488668405",
      "orcid": "0000-0002-9732-4874"
    },
    {
      "name": "Benjamin Bach",
      "institution": "Edinburgh University, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482661013",
      "orcid": "0000-0002-9201-7744"
    },
    {
      "name": "Andrew Cunningham",
      "institution": "University of South Australia, Adelaide, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100562644",
      "orcid": "0000-0003-2536-3011"
    },
    {
      "name": "Bastian Montoya",
      "institution": "University of South Australia, Adelaide, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526515",
      "orcid": "missing"
    },
    {
      "name": "Ross T. Smith",
      "institution": "University of South Australia, Adelaide, Australia",
      "img": "/do/10.1145/contrib-81100078983/rel-imgonly/ross048_bw.jpg",
      "acmid": "81100078983",
      "orcid": "0000-0002-9044-9199"
    },
    {
      "name": "Bruce H. Thomas",
      "institution": "University of South Australia, Mawson Lakes, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100411664",
      "orcid": "0000-0002-9148-085X"
    },
    {
      "name": "Tim Dwyer",
      "institution": "Monash University, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100013275/rel-imgonly/tim-dwyer-2016-small.jpg",
      "acmid": "81100013275",
      "orcid": "0000-0002-9076-9571"
    }
  ],
  "references": [
    {
      "text": "Benjamin Bach, Pierre Dragicevic, Daniel Archambault, Christophe Hurter, and Sheelagh Carpendale. 2016. A Descriptive Framework for Temporal Data Visualizations Based on Generalized Space-Time Cubes. In Computer Graphics Forum. Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Emmanuel Pietriga, and Jean-Daniel Fekete. 2014. Visualizing Dynamic Networks with Matrix Cubes. In Proceedings of SIGCHI Conference on Human Factors and Computing Systems (CHI '14). ACM, NY, NY, USA. to appear.",
      "doi": "10.1145/2556288.2557010"
    },
    {
      "text": "Benjamin Bach, Ronell Sicat, Johanna Beyer, Maxime Cordeil, and Hanspeter Pfister. 2017. The hologram in my hand: How effective is interactive exploration of 3D visualizations in immersive tangible augmented reality? IEEE transactions on visualization and computer graphics 24, 1 (2017), 457--467.",
      "doi": ""
    },
    {
      "text": "Sebastian Boring, Marko Jurmu, and Andreas Butz. 2009. Scroll, tilt or move it: using mobile phones to continuously control pointers on large public displays. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7. ACM, 161--168.",
      "doi": "10.1145/1738826.1738853"
    },
    {
      "text": "Doug Bowman, Chadwick Wingrave, Joshua Campbell, and Vinh Ly. 2001. Using pinch gloves (tm) for both natural and abstract interaction techniques in virtual environments. (2001).",
      "doi": ""
    },
    {
      "text": "S. T. Carpendale, D. J. Cowperthwaite, M. Tigges, A. Fall, and F. D. Fracchia. 1999. The Tardis: A Visual Exploration Environment for Landscape Dynamics. In Proceedings of Conference on Visual Data Exploration and Analysis. 110--119.",
      "doi": ""
    },
    {
      "text": "Arpan Chakraborty, Ryan Gross, Shea McIntee, Kyung Wha Hong, Jae Yeol Lee, and Robert St Amant. 2014. CAPTIVE: a cube with augmented physical tools. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 1315--1320.",
      "doi": ""
    },
    {
      "text": "Maxime Cordeil, Benjamin Bach, Yongchao Li, Elliott Wilson, and Tim Dwyer. 2017. Design space for spatio-data coordination: Tangible interaction devices for immersive information visualisation. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 46--50.",
      "doi": ""
    },
    {
      "text": "M. Cordeil, A. Cunningham, B. Bach, C. Hurter, B. H. Thomas, K. Marriott, and T. Dwyer. 2019. IATK: An Immersive Analytics Toolkit. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 200--209. https://doi.org/10.1109/VR.2019.8797978",
      "doi": ""
    },
    {
      "text": "David J. Cowperthwaite, M. Sheelagh T. Carpendale, and F. David Fracchia. 1996. Visual access for 3D data. 175--176.",
      "doi": ""
    },
    {
      "text": "Jean-Baptiste de la Rivière, Cédric Kervégant, Emmanuel Orvain, and Nicolas Dittlo. 2008. CubTile: a multi-touch cubic interface. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology. ACM, 69--72.",
      "doi": "10.1145/1450579.1450593"
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Niklas Elmqvist, Pierre Dragicevic, and Jean-Daniel Fekete. 2008. Rolling the dice: Multidimensional visual exploration using scatterplot matrix navigation. IEEE transactions on Visualization and Computer Graphics 14, 6 (2008), 1539--1148.",
      "doi": ""
    },
    {
      "text": "Sidney Fels, Eric Lee, and Kenji Mase. 2000. Techniques for Interactive Video Cubism (poster session) (MULTIMEDIA '00). ACM, NY, NY, USA, 368--370.",
      "doi": ""
    },
    {
      "text": "George W Fitzmaurice, Hiroshi Ishii, and William AS Buxton. 1995. Bricks: laying the foundations for graspable user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 442--449.",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In Uist, Vol. 13. 417--426.",
      "doi": ""
    },
    {
      "text": "Bernd Fröhlich and John Plate. 2000. The cubic mouse: a new device for threedimensional input. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 526--531.",
      "doi": "10.1145/332040.332491"
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive Dynamics for Visual Analysis. Queue 10, 2, Article 30 (Feb. 2012), 26 pages. https://doi.org/10.1145/2133416.",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed Endurance: A Metric to Quantify Arm Fatigue of Mid-air Interactions (CHI '14). ACM, NY, NY, USA, 1063--1072. https://doi.org/10.1145/2556288.2557130",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed endurance: a metric to quantify arm fatigue of midair interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1063--1072.",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C Goble, and Neal F Kassell. 1994. Passive real-world interface props for neurosurgical visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 452--458.",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Robert JK Jacob, Linda E Sibert, Daniel C McFarlane, and M Preston Mullen Jr. 1994. Integrality and separability of input devices. ACM Transactions on ComputerHuman Interaction (TOCHI) 1, 1 (1994), 3--26.",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Jacek Jankowski and Martin Hachet. 2013. A survey of interaction techniques for interactive 3D environments. In Eurographics 2013-STAR.",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Tangible remote controllers for wall-size displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2865--2874.",
      "doi": "10.1145/2207676.2208691"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and challenges for data physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3227--3236.",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Thomas Kapler and William Wright. 2004. GeoTime Information Visualization. In Proceedings of IEEE Information Visualization (INFOVIS '04). IEEE, Washington, DC, USA, 25--32.",
      "doi": ""
    },
    {
      "text": "M. J. Kraak. 2003. The Space-Time Cube revisited from a Geovisualization Perspective. Proceedings of the International Cartographic Conference (2003), 1988--1996.",
      "doi": ""
    },
    {
      "text": "Joseph J LaViola Jr, Ernst Kruijff, Ryan P McMahan, Doug Bowman, and Ivan P Poupyrev. 2017. 3D user interfaces: theory and practice. Addison-Wesley Professional.",
      "doi": "10.5555/993837"
    },
    {
      "text": "Lars Lischke, Pawel W. Wozniak, Sven Mayer, Andreas Preikschat, and Morten Fjeld. 2017. Using Variable Movement Resistance Sliders for Remote Discrete Input (ISS '17). ACM, NY, NY, USA, 116--125. https://doi.org/10.1145/3132272.3134135",
      "doi": ""
    },
    {
      "text": "Daniel Simoes Lopes, Daniel Medeiros, Soraia Figueiredo Paulo, Pedro Brasil Borges, Vitor Nunes, Vasco Mascarenhas, Marcos Veiga, and Joaquim Armando Jorge. 2018. Interaction techniques for immersive ct colonography: A professional assessment. In International Conference on Medical Image Computing and Computer-Assisted Intervention. Springer, 629--637.",
      "doi": ""
    },
    {
      "text": "MATLAB. 2010. version 7.10.0 (R2010a). The MathWorks Inc., Natick, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Daniel Fitzgerald, Zhiyao (John) Ma, Luke Vink, Daniel Levine, and Hiroshi Ishii. 2019. inFORCE: Bi-directional \"Force' Shape Display for Haptic Interaction (TEI '19). ACM, NY, NY, USA, 615--623. https://doi.org/10.1145/3294109.3295621",
      "doi": ""
    },
    {
      "text": "Arnaud Prouzeau, Maxime Cordeil, Clement Robin, Barrett Ens, Bruce H Thomas, and Tim Dwyer. 2019. Scaptics and Highlight-Planes: Immersive Interaction Techniques for Finding Occluded Features in 3D Scatterplots. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 325.",
      "doi": "10.1145/3290605.3300555"
    },
    {
      "text": "Jun Rekimoto and Eduardo Sciammarella. 2000. Toolstone: effective use of the physical manipulation vocabularies of input devices. In Proceedings of the 13th annual ACM symposium on User interface software and technology. ACM, 109--117.",
      "doi": "10.1145/354401.354421"
    },
    {
      "text": "Anne Roudaut, Diego Martinez, Amir Chohan, Vlad-Stefan Otrocol, Rupert Cobbe-Warburton, Max Steele, and Ioana-Madalina Patrichi. 2014. Rubikon: a highly reconfigurable device for advanced interaction. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1327--1332.",
      "doi": "10.1145/2559206.2581275"
    },
    {
      "text": "Benjamin Salem and Harold Peeters. 2007. InterCUBE: A study into merging action and interaction spaces. In IFIP Conference on Human-Computer Interaction. Springer, 57--70.",
      "doi": ""
    },
    {
      "text": "Maurício Sousa, Daniel Mendes, Soraia Paulo, Nuno Matela, Joaquim Jorge, and Daniel Simões Lopes. 2017. VRRRRoom: Virtual Reality for Radiologists in the Reading Room (CHI '17). ACM, NY, NY, USA, 4057--4062. https://doi.org/10.1145/3025453.3025566",
      "doi": ""
    },
    {
      "text": "Martin Spindler and Raimund Dachselt. 2009. PaperLens: advanced magic lens interaction above the tabletop. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces. ACM, 7.",
      "doi": "10.1145/1731903.1731920"
    },
    {
      "text": "Faisal Taher, John Hardy, Abhijit Karnik, Christian Weichel, Yvonne Jansen, Kasper Hornbæk, and Jason Alexander. 2015. Exploring interactions with physically dynamic bar charts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3237--3246.",
      "doi": "10.1145/2702123.2702604"
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 2003. Tangible query interfaces: Physically constrained tokens for manipulating database queries.",
      "doi": ""
    },
    {
      "text": "Kristof Van Laerhoven, Nicolas Villar, Albrecht Schmidt, Gerd Kortuem, and Hans Gellersen. 2003. Using an autonomous cube for basic navigation and input. In Proceedings of the 5th international conference on Multimodal interfaces. ACM, 203--210.",
      "doi": "10.1145/958432.958472"
    },
    {
      "text": "Katerina Vrotsou, Camilla Forsell, and Matthew Cooper. 2010. 2D and 3D representations for feature recognition in time geographical diary data. Information Visualization 9, 4 (Dec. 2010), 263--276.",
      "doi": "10.1057/ivs.2009.30"
    },
    {
      "text": "Yun Wang, Adrien Segal, Roberta Klatzky, Daniel F. Keefe, Petra Isenberg, Jörn Hurtienne, Eva Hornecker, Tim Dwyer, Stephen Barrass, and Theresa-Marie Rhyne. 2019. An Emotional Response to the Value of Visualization. IEEE Computer Graphics and Applications 39 (2019), 8--17.",
      "doi": "10.1109/MCG.2019.2923483"
    },
    {
      "text": "Taizo Yasutake. 1998. Touch sensitive input control device. US Patent 5,729,249.",
      "doi": ""
    }
  ]
}