{
  "doi": "10.1145/3313831.3376462",
  "title": "Brooke Leave Home: Designing a Personalized Film to Support Public Engagement with Open Data",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "Brooke Leave Home is a personalized film designed to engage a non-expert audience with open data about the support young adults receive when leaving the care system in England. The film draws upon a range of video-based data storytelling techniques to present each viewer with a personalized perspective on the topic based on data from their own local area. We present the film's design and describe how its storytelling techniques were developed to support viewers in understanding, and fostering empathic connections with, the data sources featured and the implications they have for care leavers. We also present a study with 47 viewers, which explores how these techniques were experienced and how effective they were in aiding engagement with the data included and its meaning.",
  "authors": [
    {
      "name": "Shauna Concannon",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987176",
      "orcid": "missing"
    },
    {
      "name": "Natasha Rajan",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528626",
      "orcid": "missing"
    },
    {
      "name": "Parthiv Shah",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528096",
      "orcid": "missing"
    },
    {
      "name": "Davy Smith",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179040",
      "orcid": "missing"
    },
    {
      "name": "Marian Ursu",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343507220",
      "orcid": "0000-0002-5567-3275"
    },
    {
      "name": "Jonathan Hook",
      "institution": "University of York, York, United Kingdom",
      "img": "/do/10.1145/contrib-81416594009/rel-imgonly/jonhook_florence.jpg",
      "acmid": "81416594009",
      "orcid": "0000-0002-0588-7013"
    }
  ],
  "references": [
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Christophe Hurter, and Pourang Irani. 2015. Understanding Data Videos: Looking at Narrative Visualization Through the Cinematography Lens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1459--1468. DOI: http://dx.doi.org/10.1145/2702123.2702431",
      "doi": "10.1145/2702123.2702431"
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Andrés Monroy-Hernandez, and Pourang Irani. 2017. Authoring Data-Driven Videos with DataClips. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan 2017), 501--510. DOI: http://dx.doi.org/10.1109/TVCG.2016.2598647",
      "doi": "10.1109/TVCG.2016.2598647"
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Jason Leboe-McGowan, and Pourang Irani. 2018. Hooked on Data Videos: Assessing the Effect of Animation and Pictographs on Viewer Engagement. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces (AVI '18). ACM, NY, NY, USA, Article 21, 9 pages. DOI: http://dx.doi.org/10.1145/3206505.3206552",
      "doi": "10.1145/3206505.3206552"
    },
    {
      "text": "Mike Armstrong. 2014. Object-based broadcasting curation, responsiveness and user experience. IET Conference Proceedings (January 2014), 12.2--12.2(1). DOI: http://dx.doi.org/10.1049/ib.2014.0038",
      "doi": ""
    },
    {
      "text": "Sherry R. Arnstein. 1969. A ladder of citizen participation. Journal of the American Institute of planners 35, 4 (1969), 216--224. DOI: http://dx.doi.org/10.1080/01944366908977225",
      "doi": ""
    },
    {
      "text": "Paul Ashton. 2014. The Calling Card Script: A writer's toolbox for screen, stage and radio. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Judie Attard, Fabrizio Orlandi, Simon Scerri, and Sören Auer. 2015. A systematic review of open government data initiatives. Government Information Quarterly 32, 4 (2015), 399 -- 418. DOI: http://dx.doi.org/10.1016/j.giq.2015.07.006",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Nathalie Henry Riche, Sheelagh Carpendale, and Hanspeter Pfister. 2017. The Emerging Genre of Data Comics. IEEE computer graphics and applications 38, 3 (2017), 6--13. DOI: http://dx.doi.org/10.1109/MCG.2017.33",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Moritz Stefaner, Jeremy Boy, Steven Drucker, Lyn Bartram, Jo Wood, Paolo Ciuccarelli, Yuri Engelhardt, Ulrike Koeppen, and Barbara Tversky. 2018. Narrative Design Patterns for Data-Driven Storytelling. In Data-Driven Storytelling. AK Peters/CRC Press, 125--152.",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L. Mandryk, Carl Gutwin, Aaron Genest, David McDine, and Christopher Brooks. 2010. Useful Junk?: The Effects of Visual Embellishment on Comprehension and Memorability of Charts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2573--2582. DOI: http://dx.doi.org/10.1145/1753326.1753716",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "C. Daniel Batson. 2009. These things called empathy: eight related but distinct phenomena. In The social neuroscience of empathy. MIT press. DOI: http://dx.doi.org/10.7551/mitpress/9780262012973.003.0002",
      "doi": ""
    },
    {
      "text": "Fadi Botros, Charles Perin, Bon Adriel Aseniero, and Sheelagh Carpendale. 2016. Go and Grow: Mapping Personal Data to a Living Plant. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, NY, NY, USA, 112--119. DOI: http://dx.doi.org/10.1145/2909132.2909267",
      "doi": "10.1145/2909132.2909267"
    },
    {
      "text": "Jeremy Boy, Francoise Detienne, and Jean-Daniel Fekete. 2015. Storytelling in Information Visualizations: Does It Engage Users to Explore Data?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1449--1458. DOI: http://dx.doi.org/10.1145/2702123.2702452",
      "doi": "10.1145/2702123.2702452"
    },
    {
      "text": "Stella Bruzzi. 2006. New documentary. Routledge.",
      "doi": ""
    },
    {
      "text": "Business. 2019. Netflix adds 9 million paying subscribers, but stock falls. (2019). https://edition.cnn.com/2019/01/17/media/netflix-earnings-q4/index.html",
      "doi": ""
    },
    {
      "text": "Francesco Cafaro. 2012. Using Embodied Allegories to Design Gesture Suites for Human-data Interaction. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 560--563. DOI: http://dx.doi.org/10.1145/2370216.2370309",
      "doi": "10.1145/2370216.2370309"
    },
    {
      "text": "Children & Young People Now. 2011. Postcode lottery for care leavers setting up home. (2011). https://www.cypnow.co.uk/Other/article/postcode-lottery-for-care-leavers-setting-up-home",
      "doi": ""
    },
    {
      "text": "Sandy Claes and Andrew Vande Moere. 2013. Street Infographics: Raising Awareness of Local Issues Through a Situated Urban Visualization. In Proceedings of the 2Nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, NY, NY, USA, 133--138. DOI: http://dx.doi.org/10.1145/2491568.2491597",
      "doi": "10.1145/2491568.2491597"
    },
    {
      "text": "Darius Coelho, Ayush Kumar, and Klaus Mueller. 2015. Data memes for personal visualization. In Proceeding of IEEE VIS 2015 workshop Personal Visualization: Exploring Data in Everyday Life.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Richard Mortier. 2015. Human Data Interaction: Historical Lessons from Social Studies and CSCW. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work. Springer International Publishing, 3--21. DOI: http://dx.doi.org/10.1007/978--3--319--20499--4_1",
      "doi": ""
    },
    {
      "text": "Pedro Cruz and Penousal Machado. 2016. Pulsing Blood Vessels: A Figurative Approach to Traffic Visualization. IEEE Computer Graphics and Applications 36, 2 (Mar 2016), 16--21. DOI: http://dx.doi.org/10.1109/MCG.2016.29",
      "doi": "10.1109/MCG.2016.29"
    },
    {
      "text": "Ana C Andrés del Valle and Agata Opalach. 2005. The Persuasive Mirror: computerized persuasion for healthy living. In Proceedings of the 11th International Conference on Human-Computer Interaction.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines. 2016. Metadating: Exploring the Romance and Future of Personal Data. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 685--698. DOI: http://dx.doi.org/10.1145/2858036.2858173",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 667--676. DOI: http://dx.doi.org/10.1145/2598510.2598558",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Mike Evans, Tristan Ferne, Zillah Watson, Frank Melchior, Matt Brooks, Phil Stenton, Ian Forrester, and Chris Baume. 2017. Creating Object-Based Experiences in the Real World. SMPTE Motion Imaging Journal 126, 6 (Aug 2017), 1--7. DOI: http://dx.doi.org/10.5594/JMI.2017.2709859",
      "doi": ""
    },
    {
      "text": "Brett Gaylor. 2015. Do Not Track: a personalized documentary series about privacy and the web economy. (2015). https://donottrack-doc.com",
      "doi": ""
    },
    {
      "text": "Nahum Gershon and Ward Page. 2001. What Storytelling Can Do for Information Visualization. Commun. ACM 44, 8 (Aug. 2001), 31--37. DOI: http://dx.doi.org/10.1145/381641.381653",
      "doi": "10.1145/381641.381653"
    },
    {
      "text": "Matt Golding. 2015. The Risk Taker's Survival Guide. (2015). http://risktakersguide.com",
      "doi": ""
    },
    {
      "text": "David Philip Green, Simon Bowen, Jonathan Hook, and Peter Wright. 2017. Enabling Polyvocality in Interactive Documentaries Through \"Structural Participation\". In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6317--6329. DOI: http://dx.doi.org/10.1145/3025453.3025606",
      "doi": "10.1145/3025453.3025606"
    },
    {
      "text": "Jeffery Heer and Danah Boyd. 2005. Vizster: visualizing online social networks. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. 32--39. DOI: http://dx.doi.org/10.1109/INFVIS.2005.1532126",
      "doi": ""
    },
    {
      "text": "Nathalie Henry Riche, Christophe Hurter, Nicholas Diakopoulos, and Sheelagh Carpendale. 2018. Data-driven storytelling. CRC Press.",
      "doi": ""
    },
    {
      "text": "Jonathan Hook. 2018. Facts, Interactivity and Videotape: Exploring the Design Space of Data in Interactive Video Storytelling. In Proceedings of the 2018 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '18). ACM, NY, NY, USA, 43--55. DOI: http://dx.doi.org/10.1145/3210825.3210826",
      "doi": "10.1145/3210825.3210826"
    },
    {
      "text": "Dandan Huang, Melanie Tory, Bon Adriel Aseniero, Lyn Bartram, Scott Bateman, Sheelagh Carpendale, Anthony Tang, and Robert Woodbury. 2015. Personal Visualization and Personal Visual Analytics. IEEE Transactions on Visualization and Computer Graphics 21, 3 (March 2015), 420--433. DOI: http://dx.doi.org/10.1109/TVCG.2014.2359887",
      "doi": "10.1109/TVCG.2014.2359887"
    },
    {
      "text": "Noor Huijboom and Tijs Van den Broek. 2011. Open data: an international comparison of strategies. European journal of ePractice 12, 1 (2011), 4--16.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization Rhetoric: Framing Effects in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec 2011), 2231--2240. DOI: http://dx.doi.org/10.1109/TVCG.2011.255",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Marijn Janssen, Yannis Charalabidis, and Anneke Zuiderwijk. 2012. Benefits, adoption barriers and myths of open data and open government. Information systems management 29, 4 (2012), 258--268. DOI: http://dx.doi.org/10.1080/10580530.2012.716740",
      "doi": ""
    },
    {
      "text": "Vaiva Kalnikaite, Abigail Sellen, Steve Whittaker, and David Kirk. 2010. Now Let Me See Where i Was: Understanding How Lifelogs Mediate Memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). Association for Computing Machinery, New York, NY, USA, 2045--2054. DOI: http://dx.doi.org/10.1145/1753326.1753638",
      "doi": "10.1145/1753326.1753638"
    },
    {
      "text": "Helen Kennedy and Rosemary Lucy Hill. 2018. The Feeling of Numbers: Emotions in Everyday Engagements with Data and Their Visualisation. Sociology 52, 4 (2018), 830--848. DOI: http://dx.doi.org/10.1177/0038038516674675",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E. Watkins. 2015. Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1717--1727. DOI: http://dx.doi.org/10.1145/2675133.2675212",
      "doi": "10.1145/2675133.2675212"
    },
    {
      "text": "Ewen Macaskill and Gabriel Dance. 2013. NSA Files Decoded: What the Revelations Mean for You. (2013). http://www.theguardian.com/world/interactive/2013/nov/01/snowden-nsa-files-surveillance-revelations-decoded",
      "doi": ""
    },
    {
      "text": "Derek McAuley, Richard Mortier, and James Goulding. 2011. The Dataware manifesto. In 2011 Third International Conference on Communication Systems and Networks (COMSNETS 2011). 1--6. DOI: http://dx.doi.org/10.1109/COMSNETS.2011.5716491",
      "doi": ""
    },
    {
      "text": "Sebastian Meier and Katrin Glinka. 2017. The Individual in the Data - the Aspect of Personal Relevance in Designing Casual Data Visualisations. i-com 16, 3 (2017), 247--265. DOI: http://dx.doi.org/10.1515/icom-2017-0025",
      "doi": ""
    },
    {
      "text": "Sehl Mellouli, Luis F Luna-Reyes, and Jing Zhang. 2014. Smart government, citizen participation and open data. Information Polity 19, 1, 2 (2014), 1--4. DOI: http://dx.doi.org/10.3233/IP-140334",
      "doi": ""
    },
    {
      "text": "Richard Mortier, Hamed Haddadi, Tristan Henderson, Derek McAuley, and Jon Crowcroft. 2014. Human-data interaction: The human face of the data-driven society. Available at SSRN 2508051 (2014). DOI: http://dx.doi.org/10.2139/ssrn.2508051",
      "doi": ""
    },
    {
      "text": "Bettina Nissen, John Bowers, Peter Wright, Jonathan Hook, and Christopher Newell. 2014. Volvelles, Domes and Wristbands: Embedding Digital Fabrication Within a Visitor's Trajectory of Engagement. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 825--834. DOI: http://dx.doi.org/10.1145/2598510.2598524",
      "doi": "10.1145/2598510.2598524"
    },
    {
      "text": "Open Data for Development. 2016. International Open Data Roadmap. (2016). https://www.od4d.net/files/report-iodc-2016-web.pdf",
      "doi": ""
    },
    {
      "text": "Open Data Institute. 2015. Open data roadmap for the UK. (2015). https://theodi.org/article/open-data-roadmap-for-the-uk-2015",
      "doi": ""
    },
    {
      "text": "Andrea Polli. 2006. Heat and the Heartbeat of the City: Sonifying Data Describing Climate Change. Leonardo Music Journal 16 (2006), 44--45. DOI: http://dx.doi.org/10.1162/lmj.2006.16.44",
      "doi": ""
    },
    {
      "text": "Zachary Pousman, John T. Stasko, and Micheal Mateas. 2007. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov 2007), 1145--1152. DOI: http://dx.doi.org/10.1109/TVCG.2007.70541",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Johnny Rodgers and Lyn Bartram. 2011. Exploring Ambient and Artistic Visualization for Residential Energy Use Feedback. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec 2011), 2489--2497. DOI: http://dx.doi.org/10.1109/TVCG.2011.196",
      "doi": "10.1109/TVCG.2011.196"
    },
    {
      "text": "María Teresa Rodríguez, Sérgio Nunes, and Tiago Devezas. 2015. Telling Stories with Data Visualization. In Proceedings of the 2015 Workshop on Narrative & Hypertext (NHT '15). ACM, NY, NY, USA, 7--11. DOI: http://dx.doi.org/10.1145/2804565.2804567",
      "doi": "10.1145/2804565.2804567"
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. IEEE transactions on visualization and computer graphics 16, 6 (2010), 1139--1148. DOI: http://dx.doi.org/10.1109/TVCG.2010.179",
      "doi": ""
    },
    {
      "text": "Tobias Skog, Sara Ljungblad, and Lars Erik Holmquist. 2003. Between aesthetics and utility: designing ambient information visualizations. In IEEE Symposium on Information Visualization 2003 (IEEE Cat. No.03TH8714). 233--240. DOI: http://dx.doi.org/10.1109/INFVIS.2003.1249031",
      "doi": "10.5555/1947368.1947410"
    },
    {
      "text": "Davy Smith, Jonathan Hook, and Marian Ursu. 2018. Authoring Object-Based Video Narratives. In Adjunct Proceedings of the 2018 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '18).",
      "doi": ""
    },
    {
      "text": "Thomas Smith, Simon J. Bowen, Bettina Nissen, Jonathan Hook, Arno Verhoeven, John Bowers, Peter Wright, and Patrick Olivier. 2015. Exploring Gesture Sonification to Support Reflective Craft Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 67--76. DOI: http://dx.doi.org/10.1145/2702123.2702497",
      "doi": "10.1145/2702123.2702497"
    },
    {
      "text": "John Stasko, Todd Miller, Zachary Pousman, Christopher Plaue, and Osman Ullah. 2004. Personalized Peripheral Information Awareness Through Information Art. In UbiComp 2004: Ubiquitous Computing, Nigel Davies, Elizabeth D. Mynatt, and Itiro Siio (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 18--35. DOI: http://dx.doi.org/10.1007/978--3--540--30119--6_2",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking Through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2863--2872. DOI: http://dx.doi.org/10.1145/2702123.2702558",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "The Care Leavers' Association. 2019. What is a Care Leaver? (2019). http://www.careleavers.com/who-we-are/what-is-a-care-leaver-2/",
      "doi": ""
    },
    {
      "text": "The Care Leavers' Foundation and Children & Young People Now. 2009. Setting Up: A Place to Call Home. (2009). https://secure.toolkitfiles.co.uk/clients/23786/sitedata/files/Setting_Up_A_Place_to_Call.pdf",
      "doi": ""
    },
    {
      "text": "The Children's Society. 2017. Give Care Leavers a Fairer Start: Campaign Resource Pack. (2017). https://www.childrenssociety.org.uk/sites/default/files/fairer-start-for-care-leavers-resource-pack.pdf",
      "doi": ""
    },
    {
      "text": "The Children's Society. 2018. A Fairer Start for Care Leavers. (2018). https://www.childrenssociety.org.uk/what-you-can-do/campaign-for-change/a-fairer-start-for-care-leavers",
      "doi": ""
    },
    {
      "text": "Lena Thiele. 2015. Netwars: A fact-based 5 part interactive web series exploring the impending threat of cyberwarfare. (2015). http://www.netwars-project.com/webdoc",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Dominikus Baur, Samual Huron, and Sheelagh Carpendale. 2016. Visual Mementos: Reflecting Memories with Personal Data. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 369--378. DOI: http://dx.doi.org/10.1109/TVCG.2015.2467831",
      "doi": "10.1109/TVCG.2015.2467831"
    },
    {
      "text": "Alice Thudt, Jagoda Walny, Theresia Gschwandtner, Jason Dykes, and John Stasko. 2018. Exploration and Explanation in Data-Driven Storytelling. In Data-Driven Storytelling. AK Peters/CRC Press, 77--102.",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viegas, Ethan Perry, Ethan Howe, and Judith Donath. 2004. Artifacts of the Presence Era: Using Information Visualization to Create an Evocative Souvenir. In IEEE Symposium on Information Visualization. 105--111. DOI: http://dx.doi.org/10.1109/INFVIS.2004.8",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viégas and Martin Wattenberg. 2007. Artistic Data Visualization: Beyond Visual Analytics. In Proceedings of the 2Nd International Conference on Online Communities and Social Computing (OCSC'07). Springer-Verlag, Berlin, Heidelberg, 182--191. http://dl.acm.org/citation.cfm?id=1784297.1784319",
      "doi": "10.5555/1784297.1784319"
    },
    {
      "text": "Annika Wolff, Matthew Barker, and Marian Petre. 2017. Creating a Datascape: A Game to Support Communities in Using Open Data. In Proceedings of the 8th International Conference on Communities and Technologies (C&T '17). ACM, NY, NY, USA, 135--138. DOI: http://dx.doi.org/10.1145/3083671.3083686",
      "doi": "10.1145/3083671.3083686"
    },
    {
      "text": "Rebecca Xiong and Judith Donath. 1999. PeopleGarden: Creating Data Portraits for Users. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology (UIST '99). ACM, NY, NY, USA, 37--44. DOI: http://dx.doi.org/10.1145/320719.322581",
      "doi": "10.1145/320719.322581"
    },
    {
      "text": "John Yorke. 2014. Into the Woods: A Five-Act Journey into Story. Abrams.",
      "doi": ""
    },
    {
      "text": "YouTube. 2019. YouTube By The Numbers. (2019).",
      "doi": ""
    },
    {
      "text": "Jack Zhao and Andrew Vande Moere. 2008. Embodiment in Data Sculpture: A Model of the Physical Visualization of Information. In Proceedings of the 3rd International Conference on Digital Interactive Media in Entertainment and Arts (DIMEA '08). ACM, NY, NY, USA, 343--350. DOI: http://dx.doi.org/10.1145/1413634.1413696",
      "doi": "10.1145/1413634.1413696"
    }
  ]
}