{
  "doi": "10.1145/3313831.3376827",
  "title": "Challenges of Designing Consent: Consent Mechanics in Video Games as Models for Interactive User Agency",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper argues for a conceptual framework that treats user consent in interactive technologies as a design challenge necessitating careful, culturally-informed consideration. We draw on recent work in HCI as well as queer and feminist theory that understands consent as rooted in negotiating agency in order to frame our exploration of unique difficulties and potential solutions to meaningful opportunities for user consent in the design of computational technologies. Through a critical analysis of three video games that offer different models of consent-each of which communicates different values through its design-we introduce the concept of consent mechanics. Consent mechanics describe designed interactions that allow players to consent to or opt out of in-game experiences, often those related to sexuality or intimacy. Here, we approach video games as windows onto design considerations surrounding interactive technologies more broadly, suggesting crucial questions and tactics for how to design user agency ethically into computational systems.",
  "authors": [
    {
      "name": "Josef Nguyen",
      "institution": "The University of Texas at Dallas, Richardson, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527049",
      "orcid": "missing"
    },
    {
      "name": "Bonnie Ruberg",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659303096",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children's Online Identities: How Parents Decide what to Disclose about their Children Online. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1895--1904. https://doi.org/10.1145/2702123.2702325",
      "doi": "10.1145/2702123.2702325"
    },
    {
      "text": "Edward Anstead, Martin Flintham, and Steve Benford. 2014. Studying MarathonLive: Consent for In-the-wild Research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 665--670. https://doi.org/10.1145/2638728.2641678",
      "doi": "10.1145/2638728.2641678"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2011. Pleasure Is Your Birthright: Digitally Enabled Designer Sex Toys as a Case of Third-Wave HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 257--266. https://doi.org/10.1145/1978942.1978979",
      "doi": "10.1145/1978942.1978979"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1301--1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell. 2006. The Submissive Speaks: The Semiotics of Visuality in Virtual BDSM Fantasy Play. In Proceedings of the 2006 ACM SIGGRAPH symposium on Videogames (Sandbox '06). ACM, NY, NY, USA, 99--102. http://dx.doi.org/10.1145/1183316.1183330",
      "doi": "10.1145/1183316.1183330"
    },
    {
      "text": "Rosanna Bellini, Angelika Strohmayer, Ebtisam Alabdulqader, Alex A. Ahmed, Katta Spiel, Shaowen Bardzell, and Madeline Balaam. 2018. Feminist HCI: Taking Stock, Moving Forward, and Engaging Community. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Paper SIG02, 4 pages. https://doi.org/10.1145/3170427.3185370",
      "doi": "10.1145/3170427.3185370"
    },
    {
      "text": "Jed R. Brubaker. 2014. The Afterlife of Digital Identity. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 343--346. https://doi.org/10.1145/2559206.2559964",
      "doi": ""
    },
    {
      "text": "Avery C. Edenfield. 2019. Queering Consent: Design and Sexual Consent Messaging. Commun. Des. Q. Rev 7, 2 (August 2019), 50--63. https://doi.org/10.1145/3358931.3358938",
      "doi": "10.1145/3358931.3358938"
    },
    {
      "text": "Julie Passanante Elman. 2014. Chronic Youth: Disability, Sexuality, and U.S. Media Cultures of Rehabilitation. NYU Press.",
      "doi": ""
    },
    {
      "text": "Feminist Frequency. 2014. Women as Background Decoration (Part 1). Video. (16 June 2014). Retrieved 18 September 2019 from https://feministfrequency.com/video/women-asbackground-decoration-tropes-vs-women/",
      "doi": ""
    },
    {
      "text": "Clara Fernández-Vara. 2014. Introduction to Game Analysis (1st ed.). Routledge.",
      "doi": ""
    },
    {
      "text": "Joseph J. Fischel. 2019. Screw Consent: A Better Politics of Sexual Justice. University of California Press.",
      "doi": ""
    },
    {
      "text": "Joseph J. Fischel. 2016. Sex and Harm in the Age of Consent. Minnesota University Press.",
      "doi": ""
    },
    {
      "text": "Mary Flanagan and Helen Nissenbaum. 2014. Values at Play in Digital Games. MIT Press.",
      "doi": "10.5555/2635976"
    },
    {
      "text": "Michael Gill. 2015. Already Doing It: Intellectual Disability and Sexual Agency. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Richard Gomer, M. C. Schraefel, and Enrico Gerding. 2014. Consenting Agents: Semi-autonomous Interactions for Ubiquitous Consent. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 653--658. https://doi.org/10.1145/2638728.2641682",
      "doi": "10.1145/2638728.2641682"
    },
    {
      "text": "Jordana Greenblatt and Keja Valens (eds.). 2018. Querying Consent: Beyond Permission and Refusal. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2016. Digital Footprints and Changing Networks During Online Identity Transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2895--2907. https://doi.org/10.1145/2858036.2858136",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Sabine Harrer, Simon Nielsen, and Patrick Jarnfelt. 2019. Of Mice and Pants: Queering the Conventional Gamer Mouse for Cooperative Play. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Paper alt15, 11 pages. https://doi.org/10.1145/3290607.331043",
      "doi": "10.1145/3290607.3310431"
    },
    {
      "text": "Nicky Idika. 2018. There's A New Sexual Consent App and It's Like Something Out Of 'Black Mirror'. PopBuzz (19 November 2018). Retrieved 18 September 2019 from https://www.popbuzz.com/life/news/legalflingconsent-app/",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Alex A. Ahmed, Matthew Wood, Madeline Balaam, Joshua G. Tanenbaum, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design for Sexual Wellbeing in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, NY, NY, USA, Paper W09, 7 pages. https://doi.org/10.1145/3170427.3170639",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI Talks about Sexuality: Discursive Strategies, Blind Spots, and Opportunities for Future Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 695--704. https://doi.org/10.1145/1978942.1979043",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Gopinaath Kannabiran, Shaowen Bardzell, and Jeffrey Bardzell. 2012. Designing (for) Desire: A Critical Study of Technosexuality in HCI. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 655--664. https://doi.org/10.1145/2399016.2399116",
      "doi": "10.1145/2399016.2399116"
    },
    {
      "text": "Mohammad Khalil, Paul Prinsloo, and Sharon Slade. 2018. The Unbearable Lightness of Consent: Mapping MOOC Providers' Response to Consent. In Proceedings of the Fifth Annual ACM Conference on Learning at Scale (L@S '18). ACM, NY, NY, USA, Article 61, 11 pages. https://doi.org/10.1145/3231644.3231659",
      "doi": "10.1145/3231644.3231659"
    },
    {
      "text": "Janne Lahtiranta, Sami Hyrynsalmi, and Jani Koskinen. 2017. The False Prometheus: Customer Choice, Smart Devices, and Trust. SIGCAS Comput. Soc. 47, 3 (September 2017), 86--97. https://doi.org/10.1145/3144592.3144601",
      "doi": "10.1145/3144592.3144601"
    },
    {
      "text": "Una Lee and Dann Toliver. 2017. Building Consentful Tech. http://www.consentfultech.io/wpcontent/uploads/2019/10/Building-Consentful-Tech.pdf",
      "doi": ""
    },
    {
      "text": "Mark Lizar and Mary Hodder. 2014. Usable Consents: Tracking and Managing Use of Personal Data with a Consent Transaction Receipt. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 647--652. https://doi.org/10.1145/2638728.2641681",
      "doi": "10.1145/2638728.2641681"
    },
    {
      "text": "Ewa Luger. 2012. Consent Reconsidered: Reframing Consent for Ubiquitous Computing Systems. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 564--567. http://dx.doi.org/10.1145/2370216.2370310",
      "doi": "10.1145/2370216.2370310"
    },
    {
      "text": "Ewa Luger and Tom Rodden. 2013. An Informed View on Consent for UbiComp. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, NY, NY, USA, 529--538. https://doi.org/10.1145/2493432.2493446",
      "doi": "10.1145/2493432.2493446"
    },
    {
      "text": "Ewa Luger and Tom Rodden. 2014. Sustaining Consent through Agency: A Framework for Future Development. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 659--664. https://doi.org/10.1145/2638728.2641680",
      "doi": "10.1145/2638728.2641680"
    },
    {
      "text": "Ewa Luger, Tom Rodden, Marina Jirotka, and Lilian Edwards. 2014. How Do You Solve a Problem like Consent?: The Workshop. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 613--619. https://doi.org/10.1145/2638728.2641676",
      "doi": "10.1145/2638728.2641676"
    },
    {
      "text": "Colleen Macklin. 2017. Finding the Queerness in Games. In Queer Game Studies, Bonnie Ruberg and Adrienne Shaw (eds.). University of Minnesota Press, 249--257.",
      "doi": ""
    },
    {
      "text": "Jess Marcotte. 2018. Queering Control(lers) Through Reflective Game Design Practices. Game Studies 18.3 (December 2018). http://gamestudies.org/1803",
      "doi": ""
    },
    {
      "text": "Carol Moser, Tianying Chen, and Sarita Y. Schoenebeck. 2017. Parents' and Children's Preferences about Parents Sharing about Children on Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5221--5225. https://doi.org/10.1145/3025453.302558",
      "doi": ""
    },
    {
      "text": "Stuart Moran, Ewa Luger, and Tom Rodden. 2014. Literatin: Beyond Awareness of Readability in Terms and Conditions. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 641--646. https://doi.org/10.1145/2638728.2641684",
      "doi": "10.1145/2638728.2641684"
    },
    {
      "text": "Guillaume Nadon, Marcus Feilberg, Mathias Johansen, and Irina Shklovski. 2018. In the User We Trust: Unrealistic Expectations of Facebook's Privacy Mechanisms. In Proceedings of the 9th International Conference on Social Media and Society (SMSociety '18). ACM, NY, NY, USA, 138--149. https://doi.org/10.1145/3217804.3217906",
      "doi": "10.1145/3217804.3217906"
    },
    {
      "text": "Zoë Quinn. 2017. What Happened After GamerGate Hacked Me. Time (11 September 2017). Retrieved 18 September 2019 from https://time.com/4927076/zoequinn-gamergate-doxxing-crash-override-excerpt/",
      "doi": ""
    },
    {
      "text": "Jetta Rae. 2015. All Balled Up Inside: Consent, Pinball, & the End of 'Sex as Conquest'. First Person Scholar. Retrieved 18 September 2019 from http://www.firstpersonscholar.com/all-balled-upinside/",
      "doi": ""
    },
    {
      "text": "Gilad Rosner. 2014. Who Owns Your Data?. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 623--628. https://doi.org/10.1145/2638728.2641679",
      "doi": "10.1145/2638728.2641679"
    },
    {
      "text": "Bonnie Ruberg. 2018. Queer Indie Video Games as an Alternative Digital Humanities: Counterstrategies for Cultural Critique through Interactive Media. American Quarterly 70.3 (September 2018), 417--438. https://doi.org/10.1353/aq.2018.0029",
      "doi": ""
    },
    {
      "text": "Bonnie Ruberg and Adrienne Shaw (eds.). 2017. Queer Game Studies. University of Minnesota Press, 249--257.",
      "doi": ""
    },
    {
      "text": "Bonnie Ruberg and Amanda Phillips. 2018. Special issue on Queerness and Video Games. Game Studies 18.3 (December 2018). http://gamestudies.org/1803",
      "doi": ""
    },
    {
      "text": "Katie Salen and Eric Zimmerman. 2004. Rules of Play: Game Design Fundamentals. MIT Press.",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Katta Spiel, Os Keyes, Ashley Marie Walker, Michael A. DeVito, Jeremy Birnholtz, Emeline Brulé, Ann Light, Pinar Barlas, Jean Hardy, Alex Ahmed, Jennifer A. Rode, Jed R. Brubaker, and Gopinaath Kannabiran. 2019. Queer(ing) HCI: Moving Forward in Theory and Practice. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, Paper SIG11, 4 pages. https://doi.org/10.1145/3290607.3311750",
      "doi": "10.1145/3290607.3311750"
    },
    {
      "text": "Norman Makoto Su, Amanda Lazar, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Of Dolls and Men: Anticipating Sexual Intimacy with Robots. ACM Trans. Comput.-Hum. Interact. 26, 3, Article 13 (May 2019), 35 pages. https://doi.org/10.1145/3301422",
      "doi": "10.1145/3301422"
    },
    {
      "text": "Chris Swain. 2010. The Mechanic is the Message: How to Communicate Values in Games through the Mechanics of User Action and System Response. In Ethics and Game Design: Teaching Values through Play, Karen Schrier and David Gibson (eds.). IGI Global, 217--235.",
      "doi": ""
    },
    {
      "text": "Herman T. Tavani and Maria Bottis. 2010. The Consent Process in Medical Research Involving DNA Databanks: Some Ethical Implications and Challenges. SIGCAS Comput. Soc. 40, 2 (June 2010), 11--21. http://dx.doi.org/10.1145/1839994.1839996",
      "doi": "10.1145/1839994.1839996"
    },
    {
      "text": "Aaron Trammell and Emma Leigh Waldron. 2015. Playing for Intimacy: Love, Lust, and Desire in the Pursuit of Embodied Design. In Rated M for Mature: Sex and Sexuality in Video Games, Matthew Wysocki and Evan W. Lauteria (eds.). Bloomsbury Press, 177193.",
      "doi": ""
    },
    {
      "text": "Helena Webb, Marina Jirotka, Bernd Carsten Stahl, William Housley, Adam Edwards, Matthew Williams, Rob Procter, Omer Rana, and Pete Burnap. 2017. The Ethical Challenges of Publishing Twitter Data for Research Dissemination. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17). ACM, NY, NY, USA, 339--348. https://doi.org/10.1145/3091478.3091489",
      "doi": "10.1145/3091478.3091489"
    }
  ]
}