{
  "doi": "10.1145/3313831.3376450",
  "title": "Investigating User Expectations on the Roles of Family-shared AI Speakers",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "AI assistants that use a voice user interface (VUI), such as AI speakers, have become popular in family homes. However, it is still unclear what roles the AI speaker can support within the family unit. We investigated the roles of an AI speaker as a family-shared technology. By conducting a one-week participatory user study, we discovered that family members' co-ownership toward the AI speaker was the key in the development of its family-oriented roles. Our findings showed seven domains of user expectations on these roles, and we realized that all the expectations can be represented as family cohesion. In addition, privacy awareness was emphasized regarding personal supports. Finally, we discuss a new perspective for AI speaker design and offer two suggestions: 1) leveraging human-likeness to develop its potential roles of supporting the unit of a family and 2) interpreting the home context to seamlessly connect family and personal supporting roles.",
  "authors": [
    {
      "name": "Sunjeong Park",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527003",
      "orcid": "missing"
    },
    {
      "name": "Youn-kyung Lim",
      "institution": "KAIST, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100398105/rel-imgonly/ykl-e1265351534215-150x150.jpg",
      "acmid": "81100398105",
      "orcid": "0000-0003-3238-9404"
    }
  ],
  "references": [
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 243, 1--13. https://doi.org/10.1145/3290605.3300473",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2008. Using thematic analysis in psychology. Qualitative Research in Psychology. 3, 2 (July 2008), 77--101.",
      "doi": ""
    },
    {
      "text": "A. J. Bernheim Brush and Kori M. Inkpen. 2007. Yours, mine and ours? sharing and use of technology in domestic environments. In Proceedings of the 9th international conference on Ubiquitous computing (UbiComp '07). Springer-Verlag, Berlin, Heidelberg, 109--126.",
      "doi": "10.5555/1771592.1771599"
    },
    {
      "text": "Heloisa Candello, Claudio Pinhanez, Mauro Pichiliani, Paulo Cavalin, Flavio Figueiredo, Marisa Vasconcelos, and Haylla Do Carmo. 2019. The Effect of Audiences on the User Experience with Conversational Interfaces in Physical Spaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 90, 1--13. https://doi.org/10.1145/3290605.3300320",
      "doi": "10.1145/3290605.3300320"
    },
    {
      "text": "Eugene Cho. 2019. Hey Google, Can I Ask You Something in Private? In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 258, 1--9. https://doi.org/10.1145/3290605.3300488",
      "doi": "10.1145/3290605.3300488"
    },
    {
      "text": "Minji Cho, Sang-su Lee, and Kun-Pyo Lee. 2019. Once a Kind Friend is Now a Thing: Understanding How Conversational Agents at Home are Forgotten. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). Association for Computing Machinery, New York, NY, USA, 1557-- 1569. https://doi.org/10.1145/3322276.3322332",
      "doi": "10.1145/3322276.3322332"
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, Vincent Wade, and Benjamin R. Cowan. 2019. What Makes a Good Conversation? Challenges in Designing Truly Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 475, 1--12. https://doi.org/10.1145/3290605.3300705",
      "doi": ""
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. \"What can i help you with?\": infrequent users' experiences of intelligent personal assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). Association for Computing Machinery, New York, NY, USA, Article 43, 1--12. https://doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \"Hey Google is it OK if I eat you?\": Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). Association for Computing Machinery, New York, NY, USA, 595-- 600. https://doi.org/10.1145/3078072.3084330",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Serge Egelman, A.J. Bernheim Brush, and Kori M. Inkpen. 2008. Family accounts: a new paradigm for user accounts within the home environment. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). Association for Computing Machinery, New York, NY, USA, 669-- 678. https://doi.org/10.1145/1460563.1460666",
      "doi": ""
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who's In Control? Interactions In Multi-User Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 268, 1--13. https://doi.org/10.1145/3290605.3300498",
      "doi": "10.1145/3290605.3300498"
    },
    {
      "text": "Alexis Hiniker, Sarita Y. Schoenebeck, and Julie A. Kientz. 2016. Not at the Dinner Table: Parents' and Children's Perspectives on Family Technology Rules. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). Association for Computing Machinery, New York, NY, USA, 1376--1389. https://doi.org/10.1145/2818048.2819940",
      "doi": "10.1145/2818048.2819940"
    },
    {
      "text": "Geert Hofstede and Gert J. Hofstede. 2005. Cultures and organizations: Software of the mind (Vol. 2). New York: Mcgraw-hill.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 2011. Dimensionalizing cultures: The Hofstede model in context. Online readings in psychology and culture. 2,1 (December 2011).",
      "doi": ""
    },
    {
      "text": "Lars-Erik Janlert and Erik Stolterman. 2017. Things That Keep Us Busy: The Elements of Interaction. The MIT Press.",
      "doi": "10.5555/3154808"
    },
    {
      "text": "Matthias Jöst, Jochen Häußler, Matthias Merdes, and Rainer Malaka. 2005. Multimodal interaction for pedestrians: an evaluation study. In Proceedings of the 10th international conference on Intelligent user interfaces (IUI '05). Association for Computing Machinery, New York, NY, USA, 59--66. https://doi.org/10.1145/1040830.1040852",
      "doi": "10.1145/1040830.1040852"
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, Are You Listening? Privacy Perceptions, Concerns and Privacy-seeking Behaviors with Smart Speakers. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 102 (November 2018), 31 pages. https://doi.org/10.1145/3274371",
      "doi": ""
    },
    {
      "text": "Rich Ling. 2008. New Tech, New Ties: How Mobile Communication Is Reshaping Social Cohesion. The MIT Press.",
      "doi": "10.5555/1796527"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 5286--5297. https://doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Stine S. Lundgaard and Peter Axel Nielsen. 2019. Personalised Soundscapes in Homes. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19). Association for Computing Machinery, New York, NY, USA, 813--822. https://doi.org/10.1145/3322276.3322364",
      "doi": ""
    },
    {
      "text": "Tuuli Mattelmäki. 2005. Applying probes--from inspirational notes to collaborative insights. International Journal of CoCreation in Design and the Arts. 1,2 (2005), 83--102.",
      "doi": ""
    },
    {
      "text": "Margaret Morrison and Dean M. Krugman. 2001. A Look At Mass and Computer Mediated Technologies: Understanding the Roles of Television and Computers in the Home. Journal of Broadcasting & Electronic Media. 45, 1 (2001), 135--161.",
      "doi": ""
    },
    {
      "text": "Diego Muñoz, Bernd Ploderer, and Margot Brereton. 2019. Position Exchange Workshops: A Method to Design for Each Other in Families. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 109, 1--14. https://doi.org/10.1145/3290605.3300339",
      "doi": ""
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 6, 1--7. https://doi.org/10.1145/3173574.3173580",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, William Odom, Anthony Tang, Niala Moallem, Melanie Tory, and Pourang Irani. 2016. The Frustrations and Benefits of Mobile Device Usage in the Home when Co-Present with Family Members. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). Association for Computing Machinery, New York, NY, USA, 1315--1327. https://doi.org/10.1145/2901790.2901809",
      "doi": "10.1145/2901790.2901809"
    },
    {
      "text": "Thao Phan. 2019. Amazon Echo and the Aesthetics of Whiteness. Catalyst : Feminism, Theory, Technoscience. 5, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A. Munson, James Fogarty, and Julie A. Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). Association for Computing Machinery, New York, NY, USA, 2300-- 2315. https://doi.org/10.1145/2998181.2998362",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, and Sarah Sharples. 2017. \"Do Animals Have Accents?\": Talking with Agents in Multi-Party Conversation. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). Association for Computing Machinery, New York, NY, USA, 207--219. https://doi.org/10.1145/2998181.2998298",
      "doi": "10.1145/2998181.2998298"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Moira McGregor, Barry Brown, Ewa Luger, Heloisa Candello, and Kenton O'Hara. 2017. Talking with Conversational Agents in Collaborative Action. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). Association for Computing Machinery, New York, NY, USA, 431--436. https://doi.org/10.1145/3022198.3022666",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 640, 1--12. https://doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Stuart Reeves. 2017. Some conversational challenges of talking with machines. In: Talking with Conversational Agents in Collaborative Action, Workshop at the 20th ACM conference on ComputerSupported Cooperative Work and Social Computing (CSCW '17), Portland, Oregon, USA.",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter J. Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. International Journal of CoCreation in Design and the Arts. 10, 1 (2014), 5--14.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What's Up?\": A MixedMethods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). Association for Computing Machinery, New York, NY, USA, 857-- 868. https://doi.org/10.1145/3196709.3196772",
      "doi": ""
    },
    {
      "text": "Selina J. Sutton, Paul Foulkes, David Kirk, and Shaun Lawson. 2019. Voice as a Design Material: Sociophonetic Inspired Design Strategies in HumanComputer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 603, 1--14. https://doi.org/10.1145/3290605.3300833",
      "doi": "10.1145/3290605.3300833"
    },
    {
      "text": "Asimina Vasalou, Anne-Marie Oostveen, and Adam N. Joinson. 2012. A case study of non-adoption: the values of location tracking in the family. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). Association for Computing Machinery, New York, NY, USA, 779-- 788. https://doi.org/10.1145/2145204.2145321",
      "doi": "10.1145/2145204.2145321"
    },
    {
      "text": "Alessondra Villegas. 2013. The Influence of Technology on Family Dynamics. Proceedings of the New York State Communication Association. 2012, 1 (2013).",
      "doi": ""
    },
    {
      "text": "Linda Wulf, Markus Garschall, Julia Himmelsbach, and Manfred Tscheligi. 2014. Hands free - care free: elderly people taking advantage of speech-only interaction. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). Association for Computing Machinery, New York, NY, USA, 203-- 206. https://doi.org/10.1145/2639189.2639251",
      "doi": "10.1145/2639189.2639251"
    },
    {
      "text": "Xi Yang, Marco Aurisicchio, and Weston Baxter. 2019. Understanding Affective Experiences with Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 542, 1--12. https://doi.org/10.1145/3290605.3300772",
      "doi": "10.1145/3290605.3300772"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. 2019. Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 198, 1--12. https://doi.org/10.1145/3290605.3300428",
      "doi": "10.1145/3290605.3300428"
    },
    {
      "text": "Jason Yip, Tamara Clegg, Elizabeth Bonsignore, Helene Gelderblom, Emily Rhodes, and Allison Druin. 2013. Brownies or bags-of-stuff? domain expertise in cooperative inquiry with children. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). Association for Computing Machinery, New York, NY, USA, 201-- 210. https://doi.org/10.1145/2485760.2485763",
      "doi": "10.1145/2485760.2485763"
    }
  ]
}