{
  "doi": "10.1145/3313831.3376193",
  "title": "Power Play: How the Need to Empower or Overpower Other Players Predicts Preferences in League of Legends",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The power motive describes our need to have an impact on others. Relevant in contexts such as sports, politics, and business, the power motive could help explain experiences and behaviours in digital games. We present four studies connecting the power motive to role and champion type choices in the MOBA game League of Legends (LoL). In Study1 we demonstrate that overall power motive does not predict role preferences. In Study2 we develop a 6-item-scale distinguishing between two facets of power in game settings: prosociality (empowering others) and dominance (overpowering others). In Study3 we show that prosociality and dominance uniquely predict role preferences for Support and Top Lane. In Study4 we demonstrate that champion type choice (tank, fighter, slayer, controller) is uniquely predicted by dominance and prosociality. We provide insight on how the wish for vertical interactions with other players-the power motive-can influence player interactions in multiplayer games.",
  "authors": [
    {
      "name": "Susanne Poeller",
      "institution": "University of Trier, Trier, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022338",
      "orcid": "missing"
    },
    {
      "name": "Nicola Baumann",
      "institution": "University of Trier, Trier, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019516",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Icek Ajzen and Martin Fishbein. 1977. Attitude behavior relations: A theoretical analysis and review of empirical research. Psychological Bulletin 84, 5: 888--918. https://doi.org/10.1037/0033--2909.84.5.888",
      "doi": ""
    },
    {
      "text": "Philipp Alsleben. 2008. Das Bedürfnis nach Freiheit. Selbstintegration als viertes Basismotiv. [The Need for Autonomy. Self-integration as a Fourth Basic Motive]. VDM-Verlag, Saarbrücken.",
      "doi": ""
    },
    {
      "text": "Philipp Alsleben and Julius Kuhl. 2011. Touching a person's essence: Using implicit motives as personal resources in counseling. In Handbook of motivational counseling: Motivating People for Change (2nd ed.), W. Miles Cox and Eric Klinger (eds.). Wiley, Chichester, UK, 109--131.",
      "doi": ""
    },
    {
      "text": "Cameron Anderson, John Angus D. Hildreth, and Laura Howland. 2015. Is the desire for status a fundamental human motive? A review of the empirical literature. Psychological Bulletin 141, 3: 574--601. https://doi.org/10.1037/a0038781",
      "doi": ""
    },
    {
      "text": "Avi Assor. 1989. The power motive as an influence on the evaluation of high and low status persons. Journal of Research in Personality 23, 1: 55--69. https://doi.org/https://doi.org/10.1016/00926566(89)90033",
      "doi": ""
    },
    {
      "text": "Mary Elizabeth Ballard and Kelly Marie Welch. 2017. Virtual Warfare: Cyberbullying and CyberVictimization in MMOG Play. Games and Culture 12, 5: 466--491. https://doi.org/10.1177/1555412015592473",
      "doi": ""
    },
    {
      "text": "Nicola Baumann, Monischa B. Chatterjee, and Petra Hank. 2016. Guiding others for their own good: Action orientation is associated with prosocial enactment of the implicit power motive. Motivation and Emotion 40, 1: 56--68. https://doi.org/10.1007/s11031-015--9511-0",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister and Leary Mark R. 1995. Need To Belong: Desire for interpersonal attachments as a fundamental human motivation. Psychological Bulletin 117, 3: 497--529.",
      "doi": ""
    },
    {
      "text": "Anthony Bean and Gary Groth-Marnat. 2014. Video gamers and personality: A five-factor model to understand game playing style. Psychology of Popular Media Culture 5, 1: 27--38. https://doi.org/10.1037/ppm0000025",
      "doi": ""
    },
    {
      "text": "Peter Borkenau and Fritz Ostendorf. 1993. NEOFünf-Faktoren Inventar (NEO-FFI). Hogrefe, Göttingen.",
      "doi": ""
    },
    {
      "text": "Richard E. Boyatzis. 1973. Affiliation Motivation. In Human motivation: A book of readings, David C. McClelland and Robert S. Steele (eds.). General Learning Corporation, Morristown, N.J., 252--276.",
      "doi": ""
    },
    {
      "text": "Gernot von Collani and Philipp Y. Herzberg. 2003. Eine revidierte Fassung der deutschsprachigen Skala zum Selbstwertgefühl von Rosenberg [Revised Version of the German Rosenberg SelfEsteem Scale]. Zeitschrift für Differentielle und Diagnostische Psychologie 24, 1: 3--7. https://doi.org/10.1024//0170--1789.24.1.3",
      "doi": ""
    },
    {
      "text": "Amely Drescher and Oliver C. Schultheiss. 2016. Meta-analytic evidence for higher implicit affiliation and intimacy motivation scores in women, compared to men. Journal of Research in Personality 64: 1--10. https://doi.org/10.1016/j.jrp.2016.06.019",
      "doi": ""
    },
    {
      "text": "Jules L. Ellis. 2013. A standard for test reliability in group research. Behavior Research Methods 45, 1: 16--24. https://doi.org/10.3758/s13428-012-0223-z",
      "doi": ""
    },
    {
      "text": "Entertainment Software Association. 2017. Essential Facts about the computer and video game industry. Retrieved September 19, 2019 from https://www.theesa.com/esa-research/2017essential-facts-about-the-computer-and-videogame-industry/",
      "doi": ""
    },
    {
      "text": "Forbes. 2016. Riot Games Reveals ?League of Legends\" Has 100 Million Monthly Players. Retrieved September 19, 2019 from https://www.forbes.com/sites/insertcoin/2016/09/13 /riot-games-reveals-league-of-legends-has-100million-monthly-players/",
      "doi": ""
    },
    {
      "text": "Irene H. Frieze and Bonka S. Boneva. 2001. Power motivation and motivation to help others. In The use and abuse of power: Multiple perspectives on the causes of corruption. 75--89.",
      "doi": ""
    },
    {
      "text": "Adrian Furnham. 1986. Response bias, social desirability and dissimulation. Personality and Individual Differences 7, 3: 385--400. https://doi.org/10.1016/0191--8869(86)90014-0",
      "doi": ""
    },
    {
      "text": "Riot Games. 2017. Riot Games. Taking another look at subclasses. Retrieved September 19, 2019 from https://na.leagueoflegends.com/en/news/gameupdates/gameplay/taking-another-look-subclasses",
      "doi": ""
    },
    {
      "text": "Riot Games, Inc. 2009. League of Legends. Game [PC]. (27 October 2009). Riot Games, Los Angeles, California, U.S",
      "doi": ""
    },
    {
      "text": "Riot Games. 2016. Riot Games. League of Legends Champion List. Retrieved September 19, 2019 from https://universe.leagueoflegends.com/en_US/champ ions/",
      "doi": ""
    },
    {
      "text": "Adam M. Grant and Justin M. Berg. 2011. Prosocial Motivation at Work. Oxford University Press. https://doi.org/10.1093/oxfordhb/9780199734610.0 13.0003",
      "doi": ""
    },
    {
      "text": "Frederik De Grove, Verolien Cauberghe, and Jan Van Looy. 2014. Development and Validation of an Instrument for Measuring Individual Motives for Playing Digital Games. Media Psychology 3269, December: 1--25. https://doi.org/10.1080/15213269.2014.902318",
      "doi": ""
    },
    {
      "text": "Emily E. Haroz, Laura K. Murray, Paul Bolton, Theresa Betancourt, and Judith K. Bass. 2013. Adolescent Resilience in Northern Uganda: The Role of Social Support and Prosocial Behavior in Reducing Mental Health Problems. Journal of Research on Adolescence 23, 1: 138--148. https://doi.org/10.1111/j.1532--7795.2012.00802.x",
      "doi": ""
    },
    {
      "text": "Craig A. Hill. 1987. Affiliation Motivation: People Who Need People ... But in Different Ways. Journal of Personality and Social Psychology 52, 5: 1008--1018. https://doi.org/10.1037/00223514.52.5.1008",
      "doi": ""
    },
    {
      "text": "Jan Hofer, Holger Busch, Michael Harris Bond, Domingo Campos, Ming Li, and Ruby Law. 2010. The implicit power motive and sociosexuality in men and women: Pancultural effects of responsibility. Journal of Personality and Social Psychology 99, 2: 380--394. https://doi.org/10.1037/a0020053",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 1955. Homo Ludens: A Study of the Play-Element in Culture. Beacon Press, Boston.",
      "doi": ""
    },
    {
      "text": "Douglas N. Jackson. 1984. Personality Research Form. Sigma Assessment Systems, Port Huron, MI.",
      "doi": ""
    },
    {
      "text": "Dacher Keltner, Deborah H. Gruenfeld, and Cameron Anderson. 2003. Power, approach, and inhibition. Psychological Review 110, 2: 265--284. https://doi.org/10.1037/0033--295X.110.2.265",
      "doi": ""
    },
    {
      "text": "Hansung Kim and Madeleine Stoner. 2008. Burnout and turnover intention among social workers: Effects of role stress, job autonomy and social support. Administration in Social Work 32, 3: 5--25. https://doi.org/10.1080/03643100801922357",
      "doi": ""
    },
    {
      "text": "Julius Kuhl. 1999. Der Motiv-Umsetzungs-Test (MUT) [The motive-enactment-test(MET)]. Unpublished questionnaire. University of Osnabrück, Osnabrück, Germany.",
      "doi": ""
    },
    {
      "text": "Julius Kuhl. 2013. Auswertungsmanual für den Operanten Multi-Motiv-Test (OMT). Vollständig revidierte Fassung 2013. [Scoring Manual for the Operant Multi-Motive-Test (OMT). Completely revised version 2013]. Sonderpunkt Wissenschaftsverlag, Münster, Germany.",
      "doi": ""
    },
    {
      "text": "Julius Kuhl and David Scheffer. 1999. Der operante Multi-Motiv-Test (OMT): Manual [Scoring manual for the operant multi-motive test (OMT)]. University of Osnabrück, Osnabrück, Germany.",
      "doi": ""
    },
    {
      "text": "Avonne Mason and Virginia Blankenship. 1987. Power and affiliation motivation, stress, and abuse in intimate relationships. Journal of Personality and Social Psychology 52, 1: 203--210. https://doi.org/10.1037/0022--3514.52.1.203",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1: 1--23. https://doi.org/10.3758/s13428-011-0124--6",
      "doi": ""
    },
    {
      "text": "Allan Mazur and Alan Booth. 1998. Testosterone and dominance in men. Behavioral and Brain Sciences 21, 03. https://doi.org/10.1017/S0140525X98001228",
      "doi": ""
    },
    {
      "text": "David C. McClelland. 1985. How motives, skills, and values determine what people do. American Psychologist 40, 7: 812--825. https://doi.org/10.1037/0003-066X.40.7.812",
      "doi": ""
    },
    {
      "text": "David C. McClelland. 1987. Human motivation. Cambridge University Press, New York.",
      "doi": ""
    },
    {
      "text": "David C McClelland. 1973. The two faces of power. Human Motivation: A Book of Readings 24, 1: 300--316.",
      "doi": ""
    },
    {
      "text": "David C. McClelland, John W. Atkinson, Russell A. Clark, and Edgar L. Lowell. 1953. The achievement motive. Appleton-Century-Crofts, East Norwalk, CT. https://doi.org/10.1037/11144-000",
      "doi": ""
    },
    {
      "text": "David C. McClelland and Richard E. Boyatzis. 1982. Leadership motive pattern and long-term success in management. Journal of Applied Psychology 67, 6: 737--743. https://doi.org/10.1037/0021--9010.67.6.737",
      "doi": ""
    },
    {
      "text": "David C. McClelland, Richard Koestner, and Joel Weinberger. 1989. How do self-attributed and implicit motives differ? Psychological Review 96, 4: 690--702. https://doi.org/10.1037/0033295X.96.4.690",
      "doi": ""
    },
    {
      "text": "Thea F. van de Mortel. 2008. Faking it?: social desirability response bias in self- report research. Australian Journal of Advanced Nursing 25, 4: 40-- 48.",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke, Chris Bateman, and Regan L. Mandryk. 2014. BrainHex: A neurobiological gamer typology survey. Entertainment Computing 5, 1: 55--62. https://doi.org/10.1016/j.entcom.2013.06.002",
      "doi": ""
    },
    {
      "text": "John G. Nicholls. 1984. Achievement motivation: Conceptions of ability, subjective experience, task choice, and performance. Psychological Review 91, 3: 328--346. https://doi.org/10.1037/0033295X.91.3.328",
      "doi": ""
    },
    {
      "text": "Susanne Poeller, Max V. Birk, Nicola Baumann, and Regan L. Mandryk. 2018. Let Me Be Implicit: Using Motive Disposition Theory to Predict and Explain Behaviour in Digital Games. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI'18: 1--15. https://doi.org/10.1145/3173574.3173764",
      "doi": ""
    },
    {
      "text": "Rabindra A. Ratan, Nicholas Taylor, Jameson Hogan, Tracy Kennedy, and Dmitri Williams. 2015. Stand by Your Man: An Examination of Gender Disparity in League of Legends. Games and Culture 10, 5: 438--462. https://doi.org/10.1177/1555412014567228",
      "doi": ""
    },
    {
      "text": "Felix D. Schönbrodt and Friederike X. R. Gerstenberg. 2012. An IRT analysis of motive questionnaires: The Unified Motive Scales. Journal of Research in Personality 46, 6: 725--742. https://doi.org/10.1016/j.jrp.2012.08.010",
      "doi": ""
    },
    {
      "text": "Julia Schüler, Veronika Brandstätter, Mirko Wegner, and Nicola Baumann. 2015. Testing the convergent and discriminant validity of three implicit motive measures: PSE, OMT, and MMG. Motivation and Emotion 39, 6: 839--857. https://doi.org/10.1007/s11031-015--9502--1",
      "doi": ""
    },
    {
      "text": "Oliver C. Schultheiss, Kenneth L. Campbell, and David C. McClelland. 1999. Implicit power motivation moderates men's testosterone responses to imagined and real dominance success. Hormones and Behavior 36, 3: 234--241. https://doi.org/10.1006/hbeh.1999.1542",
      "doi": ""
    },
    {
      "text": "Kenneth Shores, Yilin He, Kristina L. Swanenburg, Robert Kraut, and John Riedl. 2014. The identification of deviance and its impact on retention in a multiplayer game. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW: 1356--1365. https://doi.org/10.1145/2531602.2531724",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Felix Suessenbach, Steve Loughnan, Felix D. Schönbrodt, and Adam B. Moore. 2019. The Dominance, Prestige, and Leadership Account of Social Power Motives. European Journal of Personality 33, 1: 7--33. https://doi.org/10.1002/per.2184",
      "doi": ""
    },
    {
      "text": "David G. Winter. 1973. The power motive. Free Press, New York.",
      "doi": ""
    },
    {
      "text": "David G. Winter. 1987. Leader Appeal, Leader Performance, and the Motive Profiles of Leaders and Followers: A Study of American Presidents and Elections. Journal of Personality and Social Psychology 52, 1: 196--202. https://doi.org/10.1037/0022--3514.52.1.196",
      "doi": ""
    },
    {
      "text": "David G. Winter. 1991. A motivational model of leadership: Predicting long-term management success from TAT measures of power motivation and responsibility. The Leadership Quarterly 2, 2: 67--80. https://doi.org/10.1016/10489843(91)90023-U",
      "doi": ""
    },
    {
      "text": "Nick Yee. 2015. Quantic Foundry. Retrieved September 12, 2017 from http://quanticfoundry.com/#motivation-model",
      "doi": ""
    },
    {
      "text": "Nick Yee, Nicolas Ducheneaut, Les Nelson, and Peter Likarish. 2011. Introverted elves & conscientious gnomes: The expression of personality in World of Warcraft. Conference on Human Factors in Computing Systems Proceedings: 753--762. https://doi.org/10.1145/1978942.1979052",
      "doi": "10.1145/1978942.1979052"
    },
    {
      "text": "Eileen L. Zurbriggen. 2000. Social motives and cognitive power--sex associations: Predictors of aggressive sexual behavior. Journal of Personality and Social Psychology 78, 3: 559--581. https://doi.org/10.1037/0022--3514.78.3.559",
      "doi": ""
    }
  ]
}