{
  "doi": "10.1145/3313831.3376557",
  "title": "Virtually-Extended Proprioception: Providing Spatial Reference in VR through an Appended Virtual Limb",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Selecting targets directly in the virtual world is difficult due to the lack of haptic feedback and inaccurate estimation of egocentric distances. Proprioception, the sense of self-movement and body position, can be utilized to improve virtual target selection by placing targets on or around one's body. However, its effective scope is limited closely around one's body. We explore the concept of virtually-extended proprioception by appending virtual body parts mimicking real body parts to users' avatars, to provide spatial reference to virtual targets. Our studies suggest that our approach facilitates more efficient target selection in VR as compared to no reference or using an everyday object as reference. Besides, by cultivating users' sense of ownership on the appended virtual body part, we can further enhance target selection performance. The effects of transparency and granularity of the virtual body part on target selection performance are also discussed.",
  "authors": [
    {
      "name": "Yang Tian",
      "institution": "The Chinese University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659447350",
      "orcid": "missing"
    },
    {
      "name": "Yuming Bai",
      "institution": "Shenzhen Institutes of Advanced Technology, Chinese Academy of Sciences, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527568",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    },
    {
      "name": "Chi-Wing Fu",
      "institution": "The Chinese University of Hong Kong & Chinese Academy of Sciences, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244740",
      "orcid": "missing"
    },
    {
      "name": "Tianpei Yang",
      "institution": "Shenzhen Institutes of Advanced Technology, Chinese Academy of Sciences, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659483281",
      "orcid": "missing"
    },
    {
      "name": "Pheng Ann Heng",
      "institution": "The Chinese University of Hong Kong & Chinese Academy of Sciences, HongKong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452597418",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands \"feel\" touch that eyes see. Nature 391, 6669 (1998), 756.",
      "doi": ""
    },
    {
      "text": "Sarah H Creem-Regehr, Jeanine K Stefanucci, William B Thompson, Nathan Nash, and Michael McCardell. 2015. Egocentric distance perception in the Oculus Rift (DK2). In Proceedings of the ACM SIGGRAPH Symposium on Applied Perception. ACM, 47--50.",
      "doi": "10.1145/2804408.2804422"
    },
    {
      "text": "Sarah H Creem-Regehr, Peter Willemsen, Amy A Gooch, and William B Thompson. 2005. The influence of restricted viewing conditions on egocentric distance perception: Implications for real and virtual indoor environments. Perception 34, 2 (2005), 191--204.",
      "doi": ""
    },
    {
      "text": "James Cutting and Peter Vishton. 1995. Perceiving layout and knowing distances: The interaction, relative potency, and contextual use of different information about depth. Vol. 5. 69--177.",
      "doi": ""
    },
    {
      "text": "Daniel J Finnegan, Eamonn O'Neill, and Michael J Proulx. 2016. Compensating for distance compression in audiovisual virtual environments using incongruence. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 200--212.",
      "doi": "10.1145/2858036.2858065"
    },
    {
      "text": "Daniel J Finnegan, Eamonn O'Neill, and Michael J Proulx. 2017. An approach to reducing distance compression in audiovisual virtual environments. In 2017 IEEE 3rd VR Workshop on Sonic Interactions for Virtual Environments (SIVE). IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Nicolas Gerig, Johnathan Mayo, Kilian Baur, Frieder Wittmann, Robert Riener, and Peter Wolf. 2018. Missing depth cues in virtual reality limit performance and quality of three dimensional reaching movements. PLoS one 13, 1 (2018), e0189275.",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C. Peck. 2018. Avatar Embodiment. Towards a Standardized Questionnaire. Frontiers in Robotics and AI 5, Article 74 (2018). DOI: http://dx.doi.org/10.3389/frobt.2018.00074",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, David Dobbelstein, Christian Winkler, Gabriel Haas, and Enrico Rukzio. 2016. Facetouch: Enabling touch interaction in display fixed uis for mobile virtual reality. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 49--60.",
      "doi": "10.1145/2984511.2984576"
    },
    {
      "text": "Yves Guiard. 1987. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of motor behavior 19, 4 (1987), 486--517.",
      "doi": ""
    },
    {
      "text": "Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453--462.",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Ludovic Hoyet, Ferran Argelaguet, Corentin Nicole, and Anatole Lécuyer. 2016. \"Wow! I have six Fingers!\": would you accept structural changes of your hand in VR? Frontiers in Robotics and AI 3 (2016), 27.",
      "doi": ""
    },
    {
      "text": "Haiyan Jiang, Dongdong Weng, Zhenliang Zhang, and Feng Chen. 2019. HiFinger: One-Handed Text Entry Technique for Virtual Environments Based on Touches between Fingers. Sensors 19 (07 2019), 3063. DOI: http://dx.doi.org/10.3390/s19143063",
      "doi": ""
    },
    {
      "text": "Shunichi Kasahara, Keina Konno, Richi Owaki, Tsubasa Nishi, Akiko Takeshita, Takayuki Ito, Shoko Kasuga, and Junichi Ushiba. 2017. Malleable Embodiment: Changing Sense of Embodiment by Spatial-Temporal Deformation of Virtual Human Body. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 6438--6448. DOI: http://dx.doi.org/10.1145/3025453.3025962",
      "doi": "10.1145/3025453.3025962"
    },
    {
      "text": "Konstantina Kilteni, Antonella Maselli, Konrad P. Kording, and Mel Slater. 2015. Over my fake body: body ownership illusions for studying the multisensory basis of own-body perception. Frontiers in Human Neuroscience 9, Article 141 (2015). DOI: http://dx.doi.org/10.3389/fnhum.2015.00141",
      "doi": ""
    },
    {
      "text": "Joshua M Knapp and Jack M Loomis. 2004. Limited field of view of head-mounted displays is not the cause of distance underestimation in virtual environments. Presence: Teleoperators & Virtual Environments 13, 5 (2004), 572--577.",
      "doi": "10.1162/1054746042545238"
    },
    {
      "text": "Ryota Kondo, Maki Sugimoto, Kouta Minamizawa, Takayuki Hoshi, Masahiko Inami, and Michiteru Kitazaki. 2018. Illusory body ownership of an invisible body interpolated between virtual hands and feet via visual-motor synchronicity. Scientific reports 8, 1 (2018), 7541.",
      "doi": ""
    },
    {
      "text": "Chiuhsiang Joe Lin, Bereket Haile Woldegiorgis, Dino Caesaron, and Lai-Yu Cheng. 2015. Distance estimation with mixed real and virtual targets in stereoscopic displays. Displays 36 (2015), 41--48.",
      "doi": ""
    },
    {
      "text": "Robert W Lindeman, John L Sibert, and James K Hahn. 1999. Towards usable VR: an empirical study of user interfaces for immersive virtual environments. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 64--71.",
      "doi": "10.1145/302979.302995"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Mueller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 939--948. DOI: http://dx.doi.org/10.1145/2702123.2702461",
      "doi": "10.1145/2702123.2702461"
    },
    {
      "text": "A. Mablekos-Alexiou, G. A. Bertos, and E. Papadopoulos. 2015. A biomechatronic Extended Physiological Proprioception (EPP) controller for upper-limb prostheses. In 2015 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 6173--6178. DOI: http://dx.doi.org/10.1109/IROS.2015.7354257",
      "doi": ""
    },
    {
      "text": "Mark R Mine, Frederick P Brooks Jr, and Carlo H Sequin. 1997. Moving objects in space: exploiting proprioception in virtual-environment interaction. In SIGGRAPH, Vol. 97. 19--26.",
      "doi": "10.1145/258734.258747"
    },
    {
      "text": "M Morel, B Bideau, J Lardy, and R Kulpa. 2015. Advantages and limitations of virtual reality for balance assessment and rehabilitation. Neurophysiologie Clinique/Clinical Neurophysiology 45, 4--5 (2015), 315--326.",
      "doi": ""
    },
    {
      "text": "Alex Peer and Kevin Ponto. 2019. Mitigating Incorrect Perception of Distance in Virtual Reality through Personalized Rendering Manipulation. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 244--250.",
      "doi": ""
    },
    {
      "text": "Etienne Peillard, Thomas Thebaud, Jean-Marie Normand, Ferran Argelaguet, Guillaume Moreau, and Anatole Lécuyer. 2019. Virtual Objects Look Farther on the Sides: The Anisotropy of Distance Perception in Virtual Reality. In IEEE VR Conference 2019.",
      "doi": ""
    },
    {
      "text": "Lane Phillips, Brian Ries, Victoria Interrante, Michael Kaeding, and Lee Anderson. 2009. Distance perception in NPR immersive virtual environments, revisited. In Proceedings of the 6th Symposium on Applied Perception in Graphics and Visualization. ACM, 11--14.",
      "doi": "10.1145/1620993.1620996"
    },
    {
      "text": "David J Reinkensmeyer and Sarah J Housman. 2007. \"If I can't do it once, why do it a hundred times?\": Connecting volition to movement success in a virtual environment motivates people to exercise the arm after stroke. In 2007 Virtual Rehabilitation. IEEE, 44--48.",
      "doi": ""
    },
    {
      "text": "Rebekka S Renner, Boris M Velichkovsky, and Jens R Helmert. 2013. The perception of egocentric distances in virtual environments-a review. ACM Computing Surveys (CSUR) 46, 2 (2013), 23.",
      "doi": "10.1145/2543581.2543590"
    },
    {
      "text": "Robert Riener, Mathias Wellner, Tobias Nef, Joachim Von Zitzewitz, Alexander Duschau-Wicke, Gery Colombo, and L Lunenburger. 2006. A view on VR-enhanced rehabilitation robotics. In 2006 International Workshop on Virtual Rehabilitation. IEEE, 149--154.",
      "doi": ""
    },
    {
      "text": "Daniel Roth, Jean-Luc Lugrin, Marc Erich Latoschik, and Stephan Huber. 2017. Alpha IVBO - Construction of a Scale to Measure the Illusion of Virtual Body Ownership. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, NY, NY, USA, 2875--2883. DOI: http://dx.doi.org/10.1145/3027063.3053272",
      "doi": "10.1145/3027063.3053272"
    },
    {
      "text": "Marcos Serrano, Barrett Ens, and Pourang Irani. 2014. Exploring the Use of Hand-To-Face Input for Interacting with Head-Worn Displays. Conference on Human Factors in Computing Systems - Proceedings (05 2014). DOI: http://dx.doi.org/10.1145/2556288.2556984",
      "doi": ""
    },
    {
      "text": "Brandon M. Sexton, Yang Liu, and Hannah J. Block. 2019. Increase in weighting of vision vs. proprioception associated with force field adaptation. Scientific reports 9, 10167 (2019). DOI: http://dx.doi.org/10.1038/s41598-019--46625--7",
      "doi": ""
    },
    {
      "text": "Roland Sigrist, Georg Rauter, Robert Riener, and Peter Wolf. 2013. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: a review. Psychonomic bulletin & review 20, 1 (2013), 21--53.",
      "doi": ""
    },
    {
      "text": "DC Simpson and others. 1974. The choice of control system for the multimovement prosthesis: extended physiological proprioception (epp). The control of upper-extremity prostheses and orthoses (1974), 146--150.",
      "doi": ""
    },
    {
      "text": "William Steptoe, Anthony Steed, and Mel Slater. 2013. Human tails: ownership and control of extended humanoid avatars. IEEE transactions on visualization and computer graphics 19, 4 (2013), 583--590.",
      "doi": ""
    },
    {
      "text": "William B Thompson, Peter Willemsen, Amy A Gooch, Sarah H Creem-Regehr, Jack M Loomis, and Andrew C Beall. 2004. Does the quality of the computer graphics matter when judging distances in visually immersive environments? Presence: Teleoperators & Virtual Environments 13, 5 (2004), 560--571.",
      "doi": "10.1162/1054746042545292"
    },
    {
      "text": "David Waller and Adam R Richardson. 2008. Correcting distance estimates by interacting with immersive virtual environments: Effects of task and available sensory information. Journal of Experimental Psychology: Applied 14, 1 (2008), 61.",
      "doi": ""
    },
    {
      "text": "Katrin Wolf, Christian Müller-Tomfelde, Kelvin Cheng, and Ina Wechsung. 2012. Does proprioception guide back-of-device pointing as well as vision?. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 1739--1744.",
      "doi": "10.1145/2212776.2223702"
    },
    {
      "text": "Andrea Stevenson Won, Jeremy Bailenson, Jimmy Lee, and Jaron Lanier. 2015. Homuncular Flexibility in Virtual Reality. Journal of Computer-Mediated Communication 20, 3 (01 2015), 241--259. DOI: http://dx.doi.org/10.1111/jcc4.12107",
      "doi": "10.1111/jcc4.12107"
    },
    {
      "text": "Bing Wu, Teng Leng Ooi, and Zijiang J He. 2004. Perceiving distance accurately by a directional process of integrating ground information. Nature 428, 6978 (2004), 73.",
      "doi": ""
    },
    {
      "text": "Koki Yamashita, Takashi Kikuchi, Katsutoshi Masai, Maki Sugimoto, Bruce Thomas, and Yuta Sugiura. 2017. CheekInput: turning your cheek into an input surface by embedded optical sensors on a head-mounted display. 1--8. DOI: http://dx.doi.org/10.1145/3139131.3139146",
      "doi": ""
    },
    {
      "text": "Xiaoqi Yan, Chi-Wing Fu, Pallavi Mohan, and Wooi Boon Goh. 2016. CardboardSense: Interacting with DIY Cardboard VR Headset by Tapping. In ACM Conference on Designing Interactive Systems. ACM, 229--233.",
      "doi": "10.1145/2901790.2901813"
    },
    {
      "text": "Ye Yuan and Anthony Steed. 2010. Is the rubber hand illusion induced by immersive virtual reality?. In 2010 IEEE Virtual Reality Conference (VR). IEEE, 95--102.",
      "doi": "10.1109/VR.2010.5444807"
    }
  ]
}