{
  "doi": "10.1145/3313831.3376247",
  "title": "Keep Calm and Ride Along: Passenger Comfort and Anxiety as Physiological Responses to Autonomous Driving Styles",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Autonomous vehicles have been rapidly progressing towards full autonomy using fixed driving styles, which may differ from individual passenger preferences. Violating these preferences may lead to passenger discomfort or anxiety. We studied passenger responses to different driving style parameters in a physical autonomous vehicle. We collected galvanic skin response, heart rate, and eye-movement patterns from 20 participants, along with self-reported comfort and anxiety scores. Our results show that the presence and proximity of a lead vehicle not only raised the level of all measured physiological responses, but also exaggerated the existing effect of the longitudinal acceleration and jerk parameters. Skin response was also found to be a significant predictor of passenger comfort and anxiety. By using multiple independent events to isolate different driving style parameters, we demonstrate a method to control and analyze such parameters in future studies.",
  "tags": [
    "comfort",
    "empirical study",
    "driving style",
    "passengers",
    "affective computing",
    "autonomous vehicles",
    "physiological sensing"
  ],
  "authors": [
    {
      "name": "Nicole Dillen",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529144",
      "orcid": "missing"
    },
    {
      "name": "Marko Ilievski",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508706560",
      "orcid": "missing"
    },
    {
      "name": "Edith Law",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130921",
      "orcid": "0000-0002-7540-075X"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    },
    {
      "name": "Krzysztof Czarnecki",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100019143",
      "orcid": "missing"
    },
    {
      "name": "Oliver Schneider",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486645894",
      "orcid": "0000-0002-6240-8445"
    }
  ],
  "references": [
    {
      "text": "Jonathan Allsop and Rob Gray. 2014. Flying under pressure: Effects of anxiety on attention and gaze behavior in aviation. Journal of Applied Research in Memory and Cognition 3, 2 (2014), 63--71.",
      "doi": ""
    },
    {
      "text": "Jonathan Allsop, Rob Gray, Heinrich H Bülthoff, and Lewis Chuang. 2017. Eye movement planning on Single-Sensor-Single-Indicator displays is vulnerable to user anxiety and cognitive load. Journal of Eye Movement Research 10, 5 (2017), 8--1.",
      "doi": ""
    },
    {
      "text": "Georg W Alpers, Frank H Wilhelm, and Walton T Roth. 2005. Psychophysiological assessment during exposure in driving phobic patients. Journal of Abnormal Psychology 114, 1 (2005), 126.",
      "doi": ""
    },
    {
      "text": "Carol F Baker. 1992. Discomfort to environmental noise: Heart rate responses of SICU patients. Critical Care Nursing Quarterly 15, 2 (1992), 75. 3Cette recherche a été financée par le Conseil de recherches en sciences naturelles et en génie du Canada (CRSNG), [numéros de référence 2019-06589, 2018-06576]",
      "doi": ""
    },
    {
      "text": "Chandrayee Basu, Qian Yang, David Hungerman, Mukesh Singhal, and Anca D. Dragan. 2017. Do You Want Your Autonomous Car To Drive Like You?. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, NY, NY, USA, 417--425. DOI: http://dx.doi.org/10.1145/2909824.3020250",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Franziska Hartwich, and Josef Krems. 2018. Using Smartbands, Pupillometry and Body Motion to Detect Discomfort in Automated Driving. Frontiers in human neuroscience 12 (2018).",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Franziska Hartwich, and Josef Krems. 2019. Physiological correlates of discomfort in automated driving. Transportation research part F: traffic psychology and behaviour 66 (2019), 445--458.",
      "doi": ""
    },
    {
      "text": "Hanna Bellem, Barbara Thiel, Michael Schrauf, and Josef F Krems. 2018. Comfort in automated driving: An analysis of preferences for different automated driving styles and their dependence on personality traits. Transportation research part F: traffic psychology and behaviour 55 (2018), 90--100.",
      "doi": ""
    },
    {
      "text": "Jens Blechert, Marta Lajtman, Tanja Michael, Jürgen Margraf, and Frank H Wilhelm. 2006. Identifying anxiety states using broad sampling and advanced processing of peripheral physiological information. Biomedical sciences instrumentation 42 (2006), 136--141.",
      "doi": ""
    },
    {
      "text": "Joe Causer, Paul S Holmes, Nickolas C Smith, and A Mark Williams. 2011. Anxiety, movement kinematics, and visual attention in elite-level performers. Emotion 11, 3 (2011), 595.",
      "doi": ""
    },
    {
      "text": "Colwell, Ian. 2018. Runtime Restriction of the Operational Design Domain: A Safety Concept for Automated Vehicles. (2018). http://hdl.handle.net/10012/13398",
      "doi": ""
    },
    {
      "text": "SAE On-Road Automated Driving Committee and others. SAE J3016. Taxonomy and Definitions for Terms Related to Driving Automation Systems for On-Road Motor Vehicles. Technical Report. tech. rep., SAE International, 2016. Cited on.",
      "doi": ""
    },
    {
      "text": "Peter Davidson and Anabelle Spinoulas. 2015. Autonomous vehicles: what could this mean for the future of transport. In Australian Institute of Traffic Planning and Management (AITPM) National Conference, Brisbane, Queensland.",
      "doi": ""
    },
    {
      "text": "Andrew T Duchowski. 2007. Eye tracking methodology. Theory and practice 328, 614 (2007), 2--3.",
      "doi": ""
    },
    {
      "text": "Stephen Edelstein. 2018. Kia wants future autonomous cars to be able to read passengers' emotions. https://www.digitaltrends.com/cars/ kia-emotion-recognition-ai-tech-at-ces-2019/. (2018). Accessed: 2019-09--15.",
      "doi": ""
    },
    {
      "text": "Ellen Edmonds. 2019. Three in Four Americans Remain Afraid of Fully Self-Driving Vehicles. https://newsroom.aaa.com/2019/03/ americans-fear-self-driving-cars-survey/. (2019). Accessed: 2019-09--15.",
      "doi": ""
    },
    {
      "text": "Mohamed Elbanhawi, Milan Simic, and Reza Jazar. 2015. In the passenger seat: investigating ride comfort measures in autonomous cars. IEEE Intelligent Transportation Systems Magazine 7, 3 (2015), 4--17.",
      "doi": ""
    },
    {
      "text": "Michael Festner, Alexandra Eicher, and D Schramm. 2017. Beeinflussung der Komfort-und Sicherheitswahrnehmung beim hochautomatisierten Fahren durch fahrfremde Tätigkeiten und Spurwechseldynamik. von 11 (2017).",
      "doi": ""
    },
    {
      "text": "Lex Fridman, Heishiro Toyoda, Sean Seaman, Bobbie Seppelt, Linda Angell, Joonbum Lee, Bruce Mehler, and Bryan Reimer. 2017. What Can Be Predicted from Six Seconds of Driver Glances?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2805--2813.",
      "doi": "10.1145/3025453.3025929"
    },
    {
      "text": "A. Geiger, P. Lenz, and R. Urtasun. 2012. Are we ready for autonomous driving? The KITTI vision benchmark suite. In 2012 IEEE Conference on Computer Vision and Pattern Recognition. 3354--3361. DOI: http://dx.doi.org/10.1109/CVPR.2012.6248074",
      "doi": ""
    },
    {
      "text": "Franziska Hartwich, Matthias Beggiato, and Josef F Krems. 2018. Driving comfort, enjoyment and acceptance of automated driving--effects of drivers age and driving style familiarity. Ergonomics 61, 8 (2018), 1017--1032.",
      "doi": ""
    },
    {
      "text": "iMotions. 2016. Galvanic Skin Response (GSR): The Complete Pocket Guide. https://imotions.com/blog/galvanic-skin-response/. (2016). Accessed: 2019-09--11.",
      "doi": ""
    },
    {
      "text": "Myounghoon Jeon. 2019. Multimodal Displays for Take-over in Level 3 Automated Vehicles while Playing a Game. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, LBW0229.",
      "doi": "10.1145/3290607.3313056"
    },
    {
      "text": "Rudolph E Kalman and Richard S Bucy. 1961. New results in linear filtering and prediction theory. Journal of basic engineering 83, 1 (1961), 95--108.",
      "doi": ""
    },
    {
      "text": "Aaron Katcher, Herman Segal, and Alan Beck. 1984. Comparison of contemplation and hypnosis for the reduction of anxiety and discomfort during dental surgery. American Journal of Clinical Hypnosis 27, 1 (1984), 14--21.",
      "doi": ""
    },
    {
      "text": "Toru Kobayashi, Tetsushi Ikeda, Yumiko O Kato, Akira Utsumi, Isamu Nagasawa, and Satoshi Iwaki. 2018. Evaluation of Mental Stress in Automated Following Driving. In 2018 3rd International Conference on Robotics and Automation Engineering (ICRAE). IEEE, 131--135.",
      "doi": ""
    },
    {
      "text": "Jason Ku, Melissa Mozifian, Jungwook Lee, Ali Harakeh, and Steven L Waslander. 2018. Joint 3d proposal generation and object detection from view aggregation. In 2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Markus Kuderer, Shilpa Gulati, and Wolfram Burgard. 2015. Learning driving styles for autonomous vehicles from demonstration. In Robotics and Automation (ICRA), 2015 IEEE International Conference on. IEEE, 2641--2646.",
      "doi": ""
    },
    {
      "text": "Michael Glazer William Angell Spencer Dodd Benedikt Jenik Jack Terwilliger Aleksandr Patsekin Julia Kindelsberger Li Ding Sean Seaman Alea Mehler Andrew Sipperley Anthony Pettinato Bobbie Seppelt Linda Angell Bruce Mehler Bryan Reimer Lex Fridman, Daniel E. Brown. 2019. MIT Advanced Vehicle Technology Study: Large-Scale Naturalistic Driving Study of Driver Behavior and Interaction With Automation. IEEE Access 7 (2019), 102021--102038. DOI: http://dx.doi.org/10.1109/ACCESS.2019.2926040",
      "doi": ""
    },
    {
      "text": "Todd Litman. 2017. Autonomous vehicle implementation predictions. Victoria Transport Policy Institute Victoria, Canada.",
      "doi": ""
    },
    {
      "text": "Changchun Liu, Pramila Agrawal, Nilanjan Sarkar, and Shuo Chen. 2009. Dynamic difficulty adjustment in computer games through real-time anxiety-based affective feedback. International Journal of Human-Computer Interaction 25, 6 (2009), 506--529.",
      "doi": ""
    },
    {
      "text": "Regan L Mandryk and Lennart E Nacke. 2016. Biometrics in Gaming and Entertainment Technologies. In Biometrics in a Data Driven World. Chapman and Hall/CRC, 215--248.",
      "doi": ""
    },
    {
      "text": "Rainer Martens, Damon Burton, Robin S Vealey, Linda A Bump, and Daniel E Smith. 1990. Development and validation of the competitive state anxiety inventory-2. Competitive anxiety in sport (1990), 117--190.",
      "doi": ""
    },
    {
      "text": "Kristin Mühl, Christoph Strauch, Christoph Grabmaier, Susanne Reithinger, Anke Huckauf, and Martin Baumann. 2019. Get Ready for Being Chauffeured: Passenger's Preferences and Trust While Being Driven by Human and Automation. Human factors (2019), 0018720819872893.",
      "doi": ""
    },
    {
      "text": "Nadia Mullen, Judith Charlton, Anna Devlin, and Michel Bedard. 2011. Simulator validity: behaviours observed on the simulator and on the road (1st ed.). CRC Press, Australia, 1 -- 18.",
      "doi": ""
    },
    {
      "text": "Hiroki Murakami and Hideki Ohira. 2007. Influence of attention manipulation on emotion and autonomic responses. Perceptual and Motor Skills 105, 1 (2007), 299--308.",
      "doi": ""
    },
    {
      "text": "Luis Oliveira, Karl Proctor, Christopher G Burns, and Stewart Birrell. 2019. Driving Style: How Should an Automated Vehicle Behave? Information 10, 6 (2019), 219.",
      "doi": ""
    },
    {
      "text": "Simone Pettigrew, Caitlin Worrall, Zenobia Talati, Lin Fritschi, and Richard Norman. 2019. Dimensions of attitudes to autonomous vehicles. Urban, Planning and Transport Research 7, 1 (2019), 19--33.",
      "doi": ""
    },
    {
      "text": "Imotions: Biometric Research Platform. 2018. Eye Tracking: The Complete Pocket Guide. https://imotions.com/blog/eye-tracking. (2018). Accessed: 2019-07--17.",
      "doi": ""
    },
    {
      "text": "Kathrin Pollmann, Oilver Stefani, Amelie Bengsch, Matthias Peissner, and Mathias Vukeli´ c. 2019. How to Work in the Car of the Future?: A Neuroergonomical Study Assessing Concentration, Performance and Workload Based on Subjective, Behavioral and Neurophysiological Insights. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 54, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300284",
      "doi": "10.1145/3290605.3300284"
    },
    {
      "text": "Pramila Rani, Nilanjan Sarkar, Craig A Smith, and Leslie D Kirby. 2004. Anxiety detecting robotic system--towards implicit human-robot collaboration. Robotica 22, 1 (2004), 85--95.",
      "doi": "10.1017/S0263574703005319"
    },
    {
      "text": "Patrick Rossner and Angelika C Bullinger. 2019a. Do You Shift or Not? Influence of Trajectory Behaviour on Perceived Safety During Automated Driving on Rural Roads. In International Conference on Human-Computer Interaction. Springer, 245--254.",
      "doi": ""
    },
    {
      "text": "Patrick Rossner and Angelika C Bullinger. 2019b. How Do You Want to be Driven? Investigation of Different Highly-Automated Driving Styles on a Highway Scenario. In International Conference on Applied Human Factors and Ergonomics. Springer, 36--43.",
      "doi": ""
    },
    {
      "text": "Dirk Rothenbücher, Jamy Li, David Sirkin, Brian Mok, and Wendy Ju. 2016. Ghost driver: A field study investigating the interaction between pedestrians and driverless vehicles. In 2016 25th IEEE international symposium on robot and human interactive communication (RO-MAN). IEEE, 795--802.",
      "doi": "10.1109/ROMAN.2016.7745210"
    },
    {
      "text": "Jaguar Land Rover. 2018. Preventing Motion Sickness. https://www.jaguarlandrover.com/2018/ preventing-motion-sickness. (2018). Accessed: 2019-09--15.",
      "doi": ""
    },
    {
      "text": "Shadan Sadeghian Borojeni, Susanne CJ Boll, Wilko Heuten, Heinrich H Bülthoff, and Lewis Chuang. 2018. Feel the movement: Real motion influences responses to take-over requests in highly automated vehicles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 246.",
      "doi": "10.1145/3173574.3173820"
    },
    {
      "text": "Charles D Spielberger. 1966. Theory and Research on Anxiety. New York: Academic Press, 3--19.",
      "doi": ""
    },
    {
      "text": "Detmar Straub, Marie-Claude Boudreau, and David Gefen. 2004. Validation guidelines for IS positivist research. Communications of the Association for Information systems 13, 1 (2004), 24.",
      "doi": ""
    },
    {
      "text": "Joachim Taelman, Steven Vandeput, Arthur Spaepen, and Sabine Van Huffel. 2009. Influence of mental stress on heart rate and heart rate variability. In 4th European conference of the international federation for medical and biological engineering. Springer, 1366--1369.",
      "doi": ""
    },
    {
      "text": "Remo van der Heiden, Shamsi T Iqbal, and Christian P Janssen. 2017. Priming Drivers before Handover in Semi-Autonomous Cars. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 392--404.",
      "doi": "10.1145/3025453.3025507"
    },
    {
      "text": "Mark R Wilson, Greg Wood, and Samuel J Vine. 2009. Anxiety, attentional control, and performance impairment in penalty kicks. Journal of Sport and Exercise Psychology 31, 6 (2009), 761--775.",
      "doi": ""
    },
    {
      "text": "Priscilla NY Wong, Duncan P Brumby, Harsha Vardhan Ramesh Babu, and Kota Kobayashi. 2019. \" Watch Out!\": Semi-Autonomous Vehicles Using Assertive Voices to Grab Distracted Drivers' Attention. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, LBW2312.",
      "doi": "10.1145/3290607.3312838"
    },
    {
      "text": "Nidzamuddin Md Yusof, Juffrizal Karjanto, Jacques Terken, Frank Delbressine, Muhammad Zahir Hassan, and Matthias Rauterberg. 2016. The exploration of autonomous vehicle driving styles: preferred longitudinal, lateral, and vertical accelerations. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 245--252.",
      "doi": "10.1145/3003715.3005455"
    },
    {
      "text": "Yu Zhang, Huiyan Chen, Steven L. Waslander, Jianwei Gong, Guangming Xiong, Tian Yang, and Kai Liu. 2018. Hybrid Trajectory Planning for Autonomous Driving in Highly Constrained Environments. IEEE Access 6 (2018), 32800--32819. DOI: http://dx.doi.org/10.1109/ACCESS.2018.2845448",
      "doi": ""
    },
    {
      "text": "Yali Zheng, Tracy CH Wong, Billy HK Leung, and Carmen CY Poon. 2016. Unobtrusive and multimodal wearable sensing to quantify anxiety. IEEE Sensors Journal 16, 10 (2016), 3689--3696.",
      "doi": ""
    }
  ]
}