{
  "doi": "10.1145/3313831.3376338",
  "title": "\"Human, All Too Human\": NOAA Weather Radio and the Emotional Impact of Synthetic Voices",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2020,
  "badges": [],
  "abstract": "The integration of text-to-speech into an open technology stack for low-power FM community radio stations is an opportunity to automate laborious processes and increase accessibility to information in remote communities. However, there are open questions as to the perceived contrast of synthetic voices with the local and intimate format of community radio. This paper presents an exploratory focus group on the topic, followed by a thematic analysis of public comments on YouTube videos of the synthetic voices used for broadcasting by National Oceanic and Atmospheric Administration (NOAA) Weather Radio. We find that despite observed reservations about the suitability of TTS for radio, there is significant evidence of anthropomorphism, nostalgia and emotional connection in relation to these voices. Additionally, introduction of a more \"human sounding\" synthetic voice elicited significant negative feedback. We identify pronunciation, speed, suitability to content and acknowledgment of limitations as more relevant factors in listeners' stated sense of connection.",
  "tags": [
    "noaa weather radio",
    "synthetic speech",
    "uncanny valley",
    "text-to-speech",
    "anthropomorphism"
  ],
  "authors": [
    {
      "name": "Kristen M. Scott",
      "institution": "Madeira Interactive Technologies Institute, Funchal, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659457116",
      "orcid": "missing"
    },
    {
      "name": "Simone Ashby",
      "institution": "Interactive Technologies Institute/LARSyS, Funchal, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81493646349",
      "orcid": "missing"
    },
    {
      "name": "Julian Hanna",
      "institution": "Interactive Technologies Institute/LARSyS & Madeira Interactive Technologies Institute, Funchal, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059031957",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. The History of NOAA Weather Radio | WeatherRadios.com. (March 2015). http://weatherradios.com/blog/the-history-of-noaa-weather-radio",
      "doi": ""
    },
    {
      "text": "2016. US National Weather Service Saint Louis Missouri - Posts. (Aug. 2016). https://www.facebook.com/NWSStLouis/posts/hello-noaa-weather-radio-listeners-we-appreciate-the-comments-on-yesterdays-post/1250493531649122/",
      "doi": ""
    },
    {
      "text": "2018. NOAA Weather Radio Frequently Asked Questions. (Nov. 2018). https://www.weather.gov/phi/nwrfaq",
      "doi": ""
    },
    {
      "text": "2019a. Praat: doing Phonetics by Computer. (Aug. 2019). http://www.fon.hum.uva.nl/praat/",
      "doi": ""
    },
    {
      "text": "2019b. YouTube Data API. (July 2019). https://developers.google.com/youtube/v3/",
      "doi": ""
    },
    {
      "text": "M. Aylett, Y. Vazquez-Alvarez, and L. Baillie. 2013. Evaluating speech synthesis in a mobile context: Audio presentation of Facebook, Twitter and RSS. In Proceedings of the ITI 2013 35th International Conference on Information Technology Interfaces. 167--172. DOI: http://dx.doi.org/10.2498/iti.2013.0537",
      "doi": ""
    },
    {
      "text": "Matthew P. Aylett, Benjamin R. Cowan, and Leigh Clark. 2019. Siri, Echo and Performance: You have to Suffer Darling. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA '19. ACM Press, Glasgow, Scotland Uk, 1--10. DOI:http://dx.doi.org/10.1145/3290607.3310422",
      "doi": "10.1145/3290607.3310422"
    },
    {
      "text": "Alice Baird, Emilia Parada-Cabaleiro, Simone Hantke, Felix Burkhardt, Nicholas Cummins, and Björn Schuller. 2018. The Perception and Analysis of the Likeability and Human Likeness of Synthesized Speech. In Interspeech 2018. ISCA, 2863--2867. DOI: http://dx.doi.org/10.21437/Interspeech.2018--1093",
      "doi": ""
    },
    {
      "text": "Jesse Chandler and Norbert Schwarz. 2010. Use does not wear ragged the fabric of friendship: Thinking of objects as alive makes people less willing to replace them. Journal of Consumer Psychology 20, 2 (Jan. 2010), 138--145. https://www.academia.edu/17597712/Use_does_not_wear_ragged_the_fabric_of_friendship_Thinking_of_objects_as_alive_makes_people_less_willing_to_replace_them",
      "doi": ""
    },
    {
      "text": "Benjamin R. Cowan, Philip Doyle, Justin Edwards, Diego Garaialde, Ali Hayes-Brady, Holly P. Branigan, João Cabral, and Leigh Clark. 2019. What's in an accent? The impact of accented synthetic speech on lexical choice in human-machine dialogue. Proceedings of the 1st International Conference on Conversational User Interfaces - CUI '19 (2019), 1--8. DOI: http://dx.doi.org/10.1145/3342775.3342786 arXiv: 1907.11146.",
      "doi": "10.1145/3342775.3342786"
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. \"What can i help you with?\": infrequent users' experiences of intelligent personal assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '17. ACM Press, Vienna, Austria, 1--12. DOI:http://dx.doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Chris Csíkszentmihályi and Jude Mukundane. 2016. RootIO: ICT + telephony for grassroots radio. In 2016 IST-Africa Week Conference. 1--13. DOI: http://dx.doi.org/10.1109/ISTAFRICA.2016.7530700",
      "doi": ""
    },
    {
      "text": "Nils Dahlbäck, QianYing Wang, Clifford Nass, and Jenny Alwin. 2007. Similarity is more important than expertise: accent effects in speech interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, San Jose, California, USA, 1553. DOI: http://dx.doi.org/10.1145/1240624.1240859",
      "doi": "10.1145/1240624.1240859"
    },
    {
      "text": "Philip R. Doyle, Justin Edwards, Odile Dumbleton, Leigh Clark, and Benjamin R. Cowan. 2019. Mapping Perceptions of Humanness in Speech-Based Intelligent Personal Assistant Interaction. arXiv:1907.11585 [cs] (July 2019). DOI: http://dx.doi.org/10.1145/3338286.3340116 arXiv: 1907.11585.",
      "doi": ""
    },
    {
      "text": "David C. Giles. 2002. Parasocial Interaction: A Review of the Literature and a Model for Future Research. Media Psychology 4, 3 (Aug. 2002), 279--305. DOI: http://dx.doi.org/10.1207/S1532785XMEP0403_04",
      "doi": ""
    },
    {
      "text": "Gunnar Harboe and Elaine M. Huang. 2015. Real-World Affinity Diagramming Practices: Bridging the Paper-Digital Gap. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 95--104. DOI:http://dx.doi.org/10.1145/2702123.2702561 event-place: Seoul, Republic of Korea.",
      "doi": "10.1145/2702123.2702561"
    },
    {
      "text": "Karen Holtzblatt. 1999. Introduction to special section on contextual design. interactions 6, 1 (Jan. 1999), 30--31. DOI:http://dx.doi.org/10.1145/291224.291226",
      "doi": ""
    },
    {
      "text": "John Overton. Tell the Noaa to bring back the Tom, Paul, and Donna radio voices. (????). https://www.change.org/p/noaa-tell-the-noaa-to- bring-back-the-tom-paul-and-donna-radio-voices",
      "doi": ""
    },
    {
      "text": "Evangelia Karathanasopoulou. 2015. An examination of the concept of intimacy in radio studies, combining mainstream and non-mainstream theories and practices. Ph.D. Dissertation. University of Sunderland.",
      "doi": ""
    },
    {
      "text": "Eun Ju Lee, Clifford Nass, and Scott Brave. 2000. Can Computer-generated Speech Have Gender?: An Experimental Test of Gender Stereotype. In CHI '00 Extended Abstracts on Human Factors in Computing Systems (CHI EA '00). ACM, New York, NY, USA, 289--290. DOI: http://dx.doi.org/10.1145/633292.633461 event-place: The Hague, The Netherlands.",
      "doi": "10.1145/633292.633461"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI'16. ACM Press, Santa Clara, California, USA, 5286--5297. DOI: http://dx.doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Masahiro Mori, Karl F. MacDorman, and Norri Kageki. 2012. The Uncanny Valley [From the Field]. IEEE Robotics Automation Magazine 19, 2 (June 2012), 98--100. DOI: http://dx.doi.org/10.1109/MRA.2012.2192811",
      "doi": ""
    },
    {
      "text": "Andreea Muresan and Henning Pohl. 2019. Chats with Bots: Balancing Imitation and Engagement. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, LBW0252:1--LBW0252:6. DOI: http://dx.doi.org/10.1145/3290607.3313084 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290607.3313084"
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2000. Does Computer-generated Speech Manifest Personality? An Experimental Test of Similarity-attraction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 329--336. DOI: http://dx.doi.org/10.1145/332040.332452 event-place: The Hague, The Netherlands.",
      "doi": "10.1145/332040.332452"
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and Mindlessness: Social Responses to Computers. Journal of Social Issues 56, 1 (2000), 81--103. DOI: http://dx.doi.org/10.1111/0022--4537.00153",
      "doi": ""
    },
    {
      "text": "Kaj O'Mara. 2019. C.J.'s Law requires mobile homes in Indiana to have a weather radio. (May 2019). https://www.kcrg.com/content/news/CJs-Law-requires-mobile-homes-in-Indiana-to-have-a-weather-radio-509766901.html",
      "doi": ""
    },
    {
      "text": "Blaise Potard, Matthew P. Aylett, David A. Baude, and Petr Motlicek. 2016. Idlak Tangle: An Open Source Kaldi Based Parametric Speech Synthesiser Based on DNN. 2293--2297. DOI: http://dx.doi.org/10.21437/Interspeech.2016--1188",
      "doi": ""
    },
    {
      "text": "Daniel Povey, Arnab Ghoshal, Gilles Boulianne, Lukas Burget, Ondrej Glembek, Nagendra Goel, Mirko Hannemann, Petr Motlicek, Yanmin Qian, Petr Schwarz, Jan Silovsky, Georg Stemmer, and Karel Vesely. 2011. The Kaldi Speech Recognition Toolkit. (2011). https://infoscience.epfl.ch/record/192584",
      "doi": ""
    },
    {
      "text": "NOAA US Department of Commerce. 2016a. New All Hazards NOAA Weather Radio Now Operational. (May 2016). https://www.weather.gov/mkx/bmh",
      "doi": ""
    },
    {
      "text": "NOAA US Department of Commerce. 2016b. NOAA Weather Radio - NWR Voices. (Jan. 2016). https://www.nws.noaa.gov/nwr/info/newvoice.html",
      "doi": ""
    },
    {
      "text": "Benjamin Weiss and Felix Burkhardt. 2012. Is 'not bad' good enough? Aspects of unknown voices' likability. (2012), 4.",
      "doi": ""
    },
    {
      "text": "Zhizheng Wu, Oliver Watts, and Simon King. 2016. Merlin: An Open Source Neural Network Speech Synthesis System. 202--207. DOI: http://dx.doi.org/10.21437/SSW.2016--33",
      "doi": ""
    }
  ]
}