{
  "doi": "10.1145/3313831.3376426",
  "title": "Using Diaries to Probe the Illness Experiences of Adolescent Patients and Parental Caregivers",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2020,
  "badges": [],
  "abstract": "Adolescents with chronic conditions must work with family caregivers to manage their illness experiences. To explore how technology can support collaborative documentation of these experiences, we designed and distributed a paper diary probe kit in a two-week field deployment with 12 adolescent-parent dyads (24 participants). Three insights emerged from the study that highlight how technology can support shared illness management: 1) provide scaffolds to recognize physical and emotional experiences in the context of daily activities; 2) help families reconstruct patient experiences; and 3) adapt to individual preferences for capturing, representing and sharing experiences. We discuss opportunities for HCI research that follow from these findings and conclude by reflecting on the benefits and limitations of using diary probes with adolescent patients and their parental caregivers.",
  "tags": [
    "probes",
    "family-centered design",
    "family informatics",
    "adolescents",
    "diary studies",
    "chronic illness",
    "co-design",
    "health"
  ],
  "authors": [
    {
      "name": "Matthew K. Hong",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81548905356/rel-imgonly/81548905356.jpeg",
      "acmid": "81548905356",
      "orcid": "missing"
    },
    {
      "name": "Udaya Lakshmi",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260678",
      "orcid": "missing"
    },
    {
      "name": "Kimberly Do",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527442",
      "orcid": "missing"
    },
    {
      "name": "Sampath Prahalad",
      "institution": "Emory University School of Medicine, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528169",
      "orcid": "missing"
    },
    {
      "name": "Thomas Olson",
      "institution": "Children's Healthcare of Atlanta & Emory University School of Medicine, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021435",
      "orcid": "missing"
    },
    {
      "name": "Rosa I. Arriaga",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100177483",
      "orcid": "missing"
    },
    {
      "name": "Lauren Wilcox",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81416600696/rel-imgonly/81416600696.jpeg",
      "acmid": "81416600696",
      "orcid": "0000-0001-6598-1733"
    }
  ],
  "references": [
    {
      "text": "Teens, Social Media & Technology 2018 | Pew Research Center. Technical Report. http://www.pewinternet.org/ 2018/05/31/teens-social-media-technology-2018/",
      "doi": ""
    },
    {
      "text": "Alexander T. Adams, Elizabeth L. Murnane, Phil Adams, Michael Elfenbein, Pamara F. Chang, Shruti Sannon, Geri Gay, and Tanzeem Choudhury. 2018. Keppi: A Tangible User Interface for Self-Reporting Pain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3174076",
      "doi": "10.1145/3173574.3174076"
    },
    {
      "text": "Phil Adams, Elizabeth L. Murnane, Michael Elfenbein, Elaine Wethington, and Geri Gay. 2017. Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 1065--1077. DOI: http://dx.doi.org/10.1145/3025453.3025832",
      "doi": "10.1145/3025453.3025832"
    },
    {
      "text": "Jessica S Ancker, Marianne Sharko, Matthew Hong, Hannah Mitchell, and Lauren Wilcox. 2018. Should Parents See Their Teen's Medical Record? Asking About the Effect on Adolescent--Doctor Communication Changes Attitudes. Journal of the American Medical Informatics Association 25, 12 (12 2018), 1593--1599. DOI: http://dx.doi.org/10.1093/jamia/ocy120",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--14. DOI: http://dx.doi.org/10.1145/3173574.3173602",
      "doi": ""
    },
    {
      "text": "Raewyn Bassett, Brenda L. Beagan, Svetlana Ristovski-Slijepcevic, and Gwen E. Chapman. 2008. Tough Teens: The Methodological Challenges of Interviewing Teenagers as Research Participants. Journal of Adolescent Research 23, 2 (3 2008), 119--131. DOI: http://dx.doi.org/10.1177/0743558407310733",
      "doi": ""
    },
    {
      "text": "Andrew B L Berry, Catherine Lim, Andrea L Hartzler, Tad Hirsch, Evette Ludman, Edward H Wagner, and James D Ralston. 2017. Creating Conditions for Patients' Values to Emerge in Clinical Conversations: Perspectives of Health Care Team Members. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 1165--1174. DOI: http://dx.doi.org/10.1145/3064663.3064669",
      "doi": "10.1145/3064663.3064669"
    },
    {
      "text": "Andrew B L Berry, Catherine Y Lim, Tad Hirsch, Andrea L Hartzler, Linda M Kiel, Zoë A Bermet, and James D Ralston. 2019. Supporting Communication About Values Between People with Multiple Chronic Conditions and Their Providers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 470:1--470:14. DOI: http://dx.doi.org/10.1145/3290605.3300700",
      "doi": ""
    },
    {
      "text": "Jomara Binda, Elitza Georgieva, Yujing Yang, Fanlu Gui, Jordan Beck, and John M Carroll. 2018. PhamilyHealth: A Photo Sharing System for Intergenerational Family Collaboration on Health. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '18). ACM, NY, NY, USA, 337--340. DOI: http://dx.doi.org/10.1145/3272973.3274091",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 1077. DOI: http://dx.doi.org/10.1145/1240624.1240789",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Niall Bolger, Angelina Davis, and Eshkol Rafaeli. 2003. Diary Methods: Capturing Life as It Is Lived. Annual review of psychology 54, 1 (2003), 579--616. DOI: http://dx.doi.org/10.1146/annurev.psych.54.101601.145030",
      "doi": ""
    },
    {
      "text": "Claus Bossen, Christian Dindler, and Ole Sejer Iversen. 2012. Impediments to User Gains: Experiences from a Critical Participatory Design Project. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1 (PDC '12). ACM, NY, NY, USA, 31--40. DOI: http://dx.doi.org/10.1145/2347635.2347641",
      "doi": "10.1145/2347635.2347641"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative research in psychology 3, 2 (2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Scott Carter and Jennifer Mankoff. 2005. When Participants Do the Capturing: The Role of Media in Diary Studies. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '05. ACM Press, New York, New York, USA, 899. DOI: http://dx.doi.org/10.1145/1054972.1055098",
      "doi": "10.1145/1054972.1055098"
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for Caregivers: Designing for Integrality. In Proceedings of the 2013 conference on Computer Supported Cooperative Work. ACM, 91--102.",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Anna Cherenshchykova and Andrew D Miller. 2019. Family-Based Sleep Technologies: Opportunities and Challenges. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, NY, NY, USA, LBW1718:1--LBW1718:6. DOI: http://dx.doi.org/10.1145/3290607.3312907",
      "doi": ""
    },
    {
      "text": "Suparna Choudhury, Sarah-Jayne Blakemore, and Tony Charman. 2006. Social Cognitive Development During Adolescence. Social cognitive and affective neuroscience 1, 3 (12 2006), 165--74. DOI: http://dx.doi.org/10.1093/scan/nsl024",
      "doi": ""
    },
    {
      "text": "Arlene E Chung and Ethan M Basch. 2015. Incorporating the Patient's Voice into Electronic Health Records through Patient-Reported Outcomes as the \"Review of Systems\". Journal of the American Medical Informatics Association (2015), 914--916. DOI: http://dx.doi.org/10.1093/jamia/ocu007",
      "doi": ""
    },
    {
      "text": "Merijke Coenraad. 2019. Youth Design of Digital Stories to Promote Indigenous Voices. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19). ACM, NY, NY, USA, 728--731. DOI: http://dx.doi.org/10.1145/3311927.3325353",
      "doi": "10.1145/3311927.3325353"
    },
    {
      "text": "Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. 2015. Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight Photo-Based Capture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 3207--3216. DOI: http://dx.doi.org/10.1145/2702123.2702154",
      "doi": "10.1145/2702123.2702154"
    },
    {
      "text": "Andy Crabtree, Terry Hemmings, Tom Rodden, Nottingham Ng Bb, Keith Cheverst, Karen Clarke, and John Hughes. 2003. Designing with Care: Adapting Cultural Probes to Inform Design in Sensitive Settings. Ergonomics Society OF Australia 2003 (2003), 4--13. http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10. 1.1.67.9650",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo and Parisa Khanipour Roshan. 2014. Medium Probes: Exploring the Medium Not the Message. In Proceedings of the 2014 conference on Designing interactive systems - DIS '14. ACM Press, New York, New York, USA, 239--248. DOI: http://dx.doi.org/10.1145/2598510.2598580",
      "doi": "10.1145/2598510.2598580"
    },
    {
      "text": "Sarah E. Drew, Rony E. Duncan, and Susan M. Sawyer. 2010. Visual Storytelling: A Beneficial But Challenging Method for Health Research With Young People. Qualitative Health Research 20, 12 (12 2010), 1677--1688. DOI: http://dx.doi.org/10.1177/1049732310377455",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting, and David S. Kirk. 2017. Designing Documentary Informatics. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS '17. ACM Press, New York, New York, USA, 649--661. DOI: http://dx.doi.org/10.1145/3064663.3064714",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails, Mona Leigh Guha, and Allison Druin. 2012. Methods and Techniques for Involving Children in the Design of New Technology for Children. Foundations and Trends® in Human--Computer Interaction 6, 2 (2012), 85--166. DOI: http://dx.doi.org/10.1561/1100000018",
      "doi": "10.1561/1100000018"
    },
    {
      "text": "Julia A Garde and Mascha C van der Voort. 2014. Participants' View on Personal Gains and PD Process. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium Papers, and Keynote Abstracts - Volume 2 (PDC '14). ACM, NY, NY, USA, 79--82. DOI: http://dx.doi.org/10.1145/2662155.2662194",
      "doi": "10.1145/2662155.2662194"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. Interactions 6, 1 (1999), 21--29.",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Genetic Alliance and Family Voices. 2013. Children and Youth with Special Healthcare Needs, Then and Now. (2013). https://www.ncbi.nlm.nih.gov/books/NBK132160/",
      "doi": ""
    },
    {
      "text": "Stephen James Gentles, Cynthia Lokker, and K Ann McKibbon. 2010. Health Information Technology to Facilitate Communication Involving Health Care Providers, Caregivers, and Pediatric Patients: A Scoping Review. Journal of Medical Internet Research 12, 2 (2010), e22. DOI: http://dx.doi.org/10.2196/jmir.1390",
      "doi": ""
    },
    {
      "text": "Nanna Gorm and Irina Shklovski. 2017. Participant Driven Photo Elicitation for Understanding Activity Tracking: Benefits and Limitations. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 1350--1361. DOI: http://dx.doi.org/10.1145/2998181.2998214",
      "doi": "10.1145/2998181.2998214"
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2018. Activity Tracking in Vivo. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 362:1--362:13. DOI: http://dx.doi.org/10.1145/3173574.3173936",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Desney Tan, and Dan Morris. 2009. Toward technologies that support family reflections on health. In Proceedinfs of the ACM 2009 international conference on Supporting group work - GROUP '09. ACM Press, New York, New York, USA, 311. DOI: http://dx.doi.org/10.1145/1531674.1531721",
      "doi": "10.1145/1531674.1531721"
    },
    {
      "text": "Kimberly Hieftje, Lindsay R Duncan, and Lynn E Fiellin. 2014. Novel Methods to Collect Meaningful Data from Adolescents for the Development of Health Interventions. Health promotion practice 15, 5 (9 2014), 714--22. DOI: http://dx.doi.org/10.1177/1524839914521211",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Kiley Sobel, and Bongshin Lee. 2017. Co-Designing with Preschoolers Using Fictional Inquiry and Comicboarding. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems CHI '17. ACM Press, New York, New York, USA, 5767--5772. DOI: http://dx.doi.org/10.1145/3025453.3025588",
      "doi": "10.1145/3025453.3025588"
    },
    {
      "text": "Matthew K. Hong, Udaya Lakshmi, Thomas A. Olson, and Lauren Wilcox. 2018. Visual ODLs: Co-Designing Patient-Generated Observations of Daily Living to Support Data-Driven Conversations in Pediatric Care. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3174050",
      "doi": "10.1145/3173574.3174050"
    },
    {
      "text": "Matthew K Hong, Lauren Wilcox, Daniel Machado, Thomas A Olson, and Stephen F Simoneaux. 2016. Care Partnerships: Toward Technology to Support Teens' Participation in Their Health Care. In Proceedings of the 34th annual ACM Conference on Human Factors in Computing Systems. San Jose, CA. DOI: http://dx.doi.org/10.1145/2858036.2858508",
      "doi": "10.1145/2858036.2858508"
    },
    {
      "text": "Peter S. Houts, Cecilia C. Doak, Leonard G. Doak, and Matthew J. Loscalzo. 2006. The role of pictures in improving health communication: A review of research on attention, comprehension, recall, and adherence. Patient Education and Counseling 61, 2 (5 2006), 173--190. DOI: http://dx.doi.org/10.1016/J.PEC.2005.05.004",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Heiko Hansen, Nicolas Roussel, Björn Eiderbäck, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, and Helen Evans. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the conference on Human factors in computing systems CHI '03. ACM Press, New York, New York, USA, 17. DOI: http://dx.doi.org/10.1145/642611.642616",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Helvi Itenge-Wheeler, Heike Winschiers-Theophilus, Alessandro Soro, and Margot Brereton. 2018. Child Designers Creating Personas to Diversify Design Perspectives and Concepts for Their Own Technology Enhanced Library. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18). ACM, NY, NY, USA, 381--388. DOI: http://dx.doi.org/10.1145/3202185.3202760",
      "doi": "10.1145/3202185.3202760"
    },
    {
      "text": "Hämeen-Anttila Katri, Kati Kemppainen, Hannes Enlund, J. Bush Patricia, and Airaksinen Marja. 2004. Do Pictograms Improve Children's Understanding of Medicine Leaflet Information? Patient Education and Counseling 55, 3 (12 2004), 371--378. DOI: http://dx.doi.org/10.1016/J.PEC.2003.04.006",
      "doi": ""
    },
    {
      "text": "Elizabeth Kaziunas, Ayse G. Buyuktur, Jasmine Jones, Sung W. Choi, David A. Hanauer, and Mark S. Ackerman. 2015. Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). Association for Computing Machinery, New York, NY, USA, 1763--1774. DOI: http://dx.doi.org/10.1145/2675133.2675276",
      "doi": "10.1145/2675133.2675276"
    },
    {
      "text": "Udaya Lakshmi, Matthew Hong, and Lauren Wilcox. 2018. Integrating Patient-Generated Observations of Daily Living into Pediatric Cancer Care: A Formative User Interface Design Study. In 2018 IEEE International Conference on Healthcare Informatics (ICHI). IEEE, 265--275. DOI: http://dx.doi.org/10.1109/ICHI.2018.00037",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Jessica L. Feuston, Caroline Edasis, and Anne Marie Piper. 2018. Making as Expression: Informing Design with People with Complex Communication Needs through Art Therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--16. DOI: http://dx.doi.org/10.1145/3173574.3173925",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Michael Lefco, Jensi Gise, Burton Lesnick, and Rosa I. Arriaga. 2017. Even when Icons are Not Worth a Thousand Words They are Helpful in Designing Asthma mHealth Tools. Springer, Cham, 23--33. DOI: http://dx.doi.org/10.1007/978--3--319--67687--6{_}2",
      "doi": ""
    },
    {
      "text": "Rachel B. Levi and Dennis Drotar. 1999. Health-Related Quality of Life in Childhood Cancer: Discrepancy in Parent-Child Reports. International Journal of Cancer 83, S12 (1 1999), 58--64. DOI: http://dx.doi.org/10.1002/(SICI)1097-0215(1999)83: 12+58::AID-IJC113.0.CO;2-A",
      "doi": ""
    },
    {
      "text": "Leslie S. Liu, Jina Huh, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2013. Health Vlogger-Viewer Interaction in Chronic Illness Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 49. DOI: http://dx.doi.org/10.1145/2470654.2470663",
      "doi": "10.1145/2470654.2470663"
    },
    {
      "text": "Kai Lukoff, Taoxi Li, Yuan Zhuang, and Brian Y. Lim. 2018. TableChat: Mobile Food Journaling to Facilitate Family Support for Healthy Eating. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (11 2018), 1--28. DOI: http://dx.doi.org/10.1145/3274383",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of Social Scaffolding for Reflective Thinking in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). Association for Computing Machinery, New York, NY, USA, 477--486. DOI: http://dx.doi.org/10.1145/1357054.1357131",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Kevin Marshall, Anja Thieme, Jayne Wallace, John Vines, Gavin Wood, and Madeline Balaam. 2014. Making Wellbeing: A Process of User-Centered Design. In Proceedings of the 2014 conference on Designing interactive systems - DIS '14. ACM Press, New York, New York, USA, 755--764. DOI: http://dx.doi.org/10.1145/2598510.2600888",
      "doi": "10.1145/2598510.2600888"
    },
    {
      "text": "Louis S. Matza, Donald L. Patrick, Anne W. Riley, John J. Alexander, Luis Rajmil, Andreas M. Pleil, and Monika Bullinger. 2013. Pediatric Patient-Reported Outcome Instruments for Research to Support Medical Product Labeling: Report of the ISPOR PRO Good Research Practices for the Assessment of Children and Adolescents Task Force. Value in Health 16, 4 (2013), 461--479. DOI: http://dx.doi.org/10.1016/j.jval.2013.04.004",
      "doi": ""
    },
    {
      "text": "Brenna McNally, Mona Leigh Guha, Matthew Louis Mauriello, and Allison Druin. 2016. Children's Perspectives on Ethical Issues Surrounding Their Past Involvement on a Participatory Design Team. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3595--3606. DOI: http://dx.doi.org/10.1145/2858036.2858338",
      "doi": "10.1145/2858036.2858338"
    },
    {
      "text": "MedlinePlus. 2017. Methotrexate: MedlinePlus Drug Information. (2017). https://medlineplus.gov/",
      "doi": ""
    },
    {
      "text": "Christine Miaskowski, Enny F Zimmer, Kathryn M Barrett, Suzanne L Dibble, and Margaret Wallhagen. 1997. Differences in Patients' and Family Caregivers' Perceptions of the Pain Experience Influence Patient and Caregiver Outcomes. PAIN 72, 1 (1997), 217--226. DOI: http://dx.doi.org/10.1016/S0304--3959(97)00037--7",
      "doi": ""
    },
    {
      "text": "Pierre-André Michaud. 2007. The Adolescent with a Chronic Condition: Epidemiology, Developmental Issues and Health Care Provision. (2007).",
      "doi": ""
    },
    {
      "text": "Andrew D Miller, Ari H Pollack, and Wanda Pratt. 2016. Bursting the Information Bubble: Identifying Opportunities for Pediatric Patient-Centered Technology. In AMIA Annual Symposium Proceedings, Vol. 2016. American Medical Informatics Association, 894--903. http://www.ncbi.nlm.nih.gov/pubmed/28269886http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid= PMC5333303",
      "doi": ""
    },
    {
      "text": "Neema Moraveji, Jason Li, Jiarong Ding, Patrick O'Kelley, and Suze Woolf. 2007. Comicboarding: Using Comics as Proxies for Participatory Design with Children. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 1371. DOI: http://dx.doi.org/10.1145/1240624.1240832",
      "doi": "10.1145/1240624.1240832"
    },
    {
      "text": "Michael J. Muller. 2002. Participatory Design: The Third Space in HCI. L. Erlbaum Associates Inc., USA, 1051--1068.",
      "doi": ""
    },
    {
      "text": "Tamara Peyton and Erika Poole. 2013. \"My Mobile Health, My Mobile Life\": Methods for Designing Health Interventions with Adolescents. (2013). DOI: http://dx.doi.org/10.1145/2468356.2468441",
      "doi": ""
    },
    {
      "text": "Laura R Pina, Sang-Wha Sien, Teresa Ward, Jason C Yip, Sean A Munson, James Fogarty, and Julie A Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices Around Health Monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, NY, NY, USA, 2300--2315. DOI: http://dx.doi.org/10.1145/2998181.2998362",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Erika S. Poole and Tamara Peyton. 2013. Interaction Design Research with Adolescents. In Proceedings of the 12th International Conference on Interaction Design and Children - IDC '13. ACM Press, New York, New York, USA, 211--217. DOI: http://dx.doi.org/10.1145/2485760.2485766",
      "doi": ""
    },
    {
      "text": "Blaine A Price, Ryan Kelly, Vikram Mehta, Ciaran McCormick, Hanad Ahmed, and Oliver Pearce. 2018. Feel My Pain: Design and Evaluation of Painpad, a Tangible Device for Supporting Inpatient Self-Logging of Pain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 169:1--169:13. DOI: http://dx.doi.org/10.1145/3173574.3173743",
      "doi": ""
    },
    {
      "text": "PROMIS. 2015. Patient-Reported Outcomes Measurement Information System: Dynamic Tools to Measure Health Outcomes from the Patient Perspective. (2015). http://www.nihpromis.org/",
      "doi": ""
    },
    {
      "text": "J. C. Read, D. Fitton, and M. Horton. 2013. Theatre, PlayDoh and Comic Strips: Designing Organic User Interfaces with Young Adolescent and Teenage Participants. Interacting with Computers 25, 2 (3 2013), 183--198. DOI: http://dx.doi.org/10.1093/iwc/iws016",
      "doi": ""
    },
    {
      "text": "Michael Rich, Steven Lamola, Jason Gordon, and Richard Chalfen. 2000. Video Intervention/Prevention Assessment: A Patient-Centered Methodology for Understanding the Adolescent Illness Experience. Journal of Adolescent Health 27, 3 (9 2000), 155--165. DOI: http://dx.doi.org/10.1016/S1054--139X(00)00114--2",
      "doi": ""
    },
    {
      "text": "Ann-Marie Rosland. 2009. Sharing the Care: The Role of Family in Chronic Illness. Technical Report. California Healthcare Foundation. www.chcf.org.",
      "doi": ""
    },
    {
      "text": "Susan M Sawyer, Sarah Drew, Michele S Yeo, and Maria T Britto. 2007. Adolescents with a Chronic Condition: Challenges Living, Challenges Treating. The Lancet 369, 9571 (2007), 1481--1489. DOI: http://dx.doi.org/10.1016/S0140--6736(07)60370--5",
      "doi": ""
    },
    {
      "text": "Christopher L. Schaefbauer, Danish U. Khan, Amy Le, Garrett Sczechowski, and Katie A. Siek. 2015. Snack Buddy: Supporting Healthy Snacking in Low Socioeconomic Status Families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15. ACM Press, New York, New York, USA, 1045--1057. DOI: http://dx.doi.org/10.1145/2675133.2675180",
      "doi": ""
    },
    {
      "text": "Marianne Sharko, Lauren Wilcox, Matthew K Hong, and Jessica S Ancker. 2018. Variability in Adolescent Portal Privacy Features: How the Unique Privacy Needs of the Adolescent Patient Create a Complex Decision-Making Process. Journal of the American Medical Informatics Association 25, 8 (8 2018), 1008--1017. DOI: http://dx.doi.org/10.1093/jamia/ocy042",
      "doi": ""
    },
    {
      "text": "Ji Youn Shin, Jacob Kedroske, Rebecca Vue, Roshun Sankaran, Dima Chaar, Tracey Churay, and Sung Won Choi. 2018. Design Considerations for Family-centered Health Management: Preliminary Findings with Pediatric BMT Patients. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18). ACM, NY, NY, USA, 593--598. DOI: http://dx.doi.org/10.1145/3202185.3210781",
      "doi": "10.1145/3202185.3210781"
    },
    {
      "text": "Anna Ståhl, Kristina Höök, Martin Svensson, Alex S. Taylor, and Marco Combetto. 2009. Experiencing the Affective Diary. Personal and Ubiquitous Computing 13, 5 (6 2009), 365--378. DOI: http://dx.doi.org/10.1007/s00779-008-0202--7",
      "doi": ""
    },
    {
      "text": "Robert W. Strack, Cathleen Magill, and Kara McDonagh. 2004. Engaging Youth through Photovoice. Health Promotion Practice 5, 1 (1 2004), 49--58. DOI: http://dx.doi.org/10.1177/1524839903258015",
      "doi": ""
    },
    {
      "text": "J. Tack, F. Carbone, L. Holvoet, H. Vanheel, T. Vanuytsel, and A. Vandenberghe. 2014. The use of pictograms improves symptom evaluation by patients with functional dyspepsia. Alimentary Pharmacology & Therapeutics 40, 5 (7 2014), 523--530. DOI: http://dx.doi.org/10.1111/apt.12855",
      "doi": ""
    },
    {
      "text": "Carrie A. Thompson, Kathleen J. Yost, Alicia Bartz, Amanika Kumar, Kathryn Jean Ruddy, Daniela L. Stan, Joon H. Uhm, Rahma M. Warsame, Thomas E. Witzig, Paul J Novotny, and Jeffrey Sloan. 2018. Patient-Reported Outcomes, Emoji, and Activity Measured on the Apple Watch in Cancer Patients. Journal of Clinical Oncology 36, 15_suppl (5 2018), 6501--6501. DOI: http://dx.doi.org/10.1200/JCO.2018.36.15_suppl.6501",
      "doi": ""
    },
    {
      "text": "Tammy Toscos, Kay Connelly, and Yvonne Rogers. 2012. Best Intentions: Health Monitoring Technology and Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). Association for Computing Machinery, New York, NY, USA, 1431--1440. DOI: http://dx.doi.org/10.1145/2207676.2208603",
      "doi": "10.1145/2207676.2208603"
    },
    {
      "text": "Sarah J Tracy. 2010. Qualitative Quality: Eight \"Big-Tent\" Criteria for Excellent Qualitative Research. Qualitative inquiry 16, 10 (2010), 837--851. DOI: http://dx.doi.org/10.1177/1077800410383121",
      "doi": ""
    },
    {
      "text": "Elena Tsangaris, Jessica Johnson, Rachel Taylor, Lorna Fern, Denise Bryant-Lukosius, Ronald Barr, Graeme Fraser, and Anne Klassen. 2014. Identifying the supportive care needs of adolescent and young adult survivors of cancer: a qualitative analysis and systematic literature review. Supportive Care in Cancer 22, 4 (4 2014), 947--959. DOI: http://dx.doi.org/10.1007/s00520-013--2053--7",
      "doi": ""
    },
    {
      "text": "Damyanka Tsvyatkova and Cristiano Storni. 2014. Adapting Design Probes to Explore Health Management Practices in Pediatric Type 1 Diabetes. In Proceedings of the 2014 conference on Interaction design and children IDC '14. ACM Press, New York, New York, USA, 277--280. DOI: http://dx.doi.org/10.1145/2593968.2610471",
      "doi": "10.1145/2593968.2610471"
    },
    {
      "text": "Ralph Vacca. 2019. Brokering Data: Co-Designing Technology with Latina Teens to Support Communication with Parents: Leveraging Cultural Practices of Latinx Youth Through Co-Design. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19). ACM, NY, NY, USA, 197--207. DOI: http://dx.doi.org/10.1145/3311927.3323142",
      "doi": "10.1145/3311927.3323142"
    },
    {
      "text": "Maarten Van Mechelen, Alice Schut, Mathieu Gielen, and Antonia Clasina Södergren. 2019. Children's Assessment of Co-design Skills: Creativity, Empathy and Collaboration. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19). ACM, NY, NY, USA, 520--526. DOI: http://dx.doi.org/10.1145/3311927.3325334",
      "doi": "10.1145/3311927.3325334"
    },
    {
      "text": "Julio Vega, Samuel Couth, Ellen Poliakoff, Sonja Kotz, Matthew Sullivan, Caroline Jay, Markel Vigo, and Simon Harper. 2018. Back to Analogue: Self-Reporting for Parkinson's Disease. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems CHI '18. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3173648",
      "doi": "10.1145/3173574.3173648"
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring Participation: On How We Involve People in Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 429. DOI: http://dx.doi.org/10.1145/2470654.2470716",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Pamela Wisniewski, Heng Xu, Mary Beth Rosson, Daniel F. Perkins, and John M. Carroll. 2016. Dear Diary: Teens Reflect on Their Weekly Online Risk Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16. ACM Press, New York, New York, USA, 3919--3930. DOI: http://dx.doi.org/10.1145/2858036.2858317",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Takashi Kudo, Keiji Hirata, Eiji Aramaki, and Kazuki Hattori. 2018. How Information Sharing about Care Recipients by Family Caregivers Impacts Family Communication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--13. DOI: http://dx.doi.org/10.1145/3173574.3173796",
      "doi": "10.1145/3173574.3173796"
    },
    {
      "text": "Michele Yeo and Susan Sawyer. 2005. Chronic Illness and Disability. BMJ (Clinical research ed.) 330, 7493 (3 2005), 721--3. DOI: http://dx.doi.org/10.1136/bmj.330.7493.721",
      "doi": ""
    },
    {
      "text": "Jason C Yip, Elizabeth Foss, and Mona Leigh Guha. 2012. Co-designing With Adolescents. In Designing Interactive Technology for Teens Workshop, NordiCHI, Copenhagen, Denmark. Retrieved from: http://www.chici. org/ditt2012/papers. html.",
      "doi": ""
    },
    {
      "text": "Zhen Yue, Eden Litt, Carrie J. Cai, Jeff Stern, Kathy K. Baxter, Zhiwei Guan, Nikhil Sharma, Guangqiang (George) Zhang, Zhen Yue, Eden Litt, Carrie J. Cai, Jeff Stern, Kathy K. Baxter, Zhiwei Guan, Nikhil Sharma, and Guangqiang (George) Zhang. 2014. Photographing Information Needs: The Role of Photos in Experience Sampling Method-Style Research. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 1545--1554. DOI: http://dx.doi.org/10.1145/2556288.2557192",
      "doi": "10.1145/2556288.2557192"
    },
    {
      "text": "Haining Zhu, Joanna Colgan, Madhu Reddy, and Eun Kyoung Choe. 2016. Sharing Patient-Generated Data in Clinical Practices: An Interview Study. AMIA Annual Symposium Proceedings 2016 (2016), 1303--1312. http://www.ncbi.nlm.nih.gov/pubmed/28269928http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid= PMC5333267",
      "doi": ""
    }
  ]
}