{
  "doi": "10.1145/3313831.3376366",
  "title": "PhysioSkin: Rapid Fabrication of Skin-Conformal Physiological Interfaces",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2020,
  "badges": [],
  "abstract": "Advances in rapid prototyping platforms have made physiological sensing accessible to a wide audience. However, off-the-shelf electrodes commonly used for capturing biosignals are typically thick, non-conformal and do not support customization. We present PhysioSkin, a rapid, do-it-yourself prototyping method for fabricating custom multi-modal physiological sensors, using commercial materials and a commodity desktop inkjet printer. It realizes ultrathin skin-conformal patches (~1μm) and interactive textiles that capture sEMG, EDA and ECG signals. It further supports fabricating devices with custom levels of thickness and stretchability. We present detailed fabrication explorations on multiple substrate materials, functional inks and skin adhesive materials. Informed from the literature, we also provide design recommendations for each of the modalities. Evaluation results show that the sensor patches achieve a high signal-to-noise ratio. Example applications demonstrate the functionality and versatility of our approach for prototyping a next generation of physiological devices that intimately couple with the human body.",
  "authors": [
    {
      "name": "Aditya Shekhar Nittala",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161539",
      "orcid": "0000-0002-3698-9733"
    },
    {
      "name": "Arshad Khan",
      "institution": "Saarland University, Saarland Informatics Campus & INM - Leibniz Institute for New Materials, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474147",
      "orcid": "missing"
    },
    {
      "name": "Klaus Kruttwig",
      "institution": "INM - Leibniz Institute for New Materials, Saarbuecken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365503",
      "orcid": "missing"
    },
    {
      "name": "Tobias Kraus",
      "institution": "INM - Leibniz Institute for New Materials, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658660846",
      "orcid": "missing"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    }
  ],
  "references": [
    {
      "text": "2020. Apple Watch Series 5 ECG/Heart Rate. https://www.apple.com/apple-watch-series-5/health/. (2020). Accessed: 2020-01-08.",
      "doi": ""
    },
    {
      "text": "2020. Hexoskin Health Sensors and AI. http://https://www.hexoskin.com/. (2020). Last Accessed: 2020-01-08.",
      "doi": ""
    },
    {
      "text": "Gizem Acar, Ozberk Ozturk, and Murat Kaya Yapici. 2018. Wearable Graphene Nanotextile Embedded Smart Armband for Cardiac Monitoring. In 2018 IEEE SENSORS. IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Valentina Agostini and Marco Knaflitz. 2011. An algorithm for the estimation of the signal-to-noise ratio in surface myoelectric signals generated during cyclic movements. IEEE Transactions on Biomedical Engineering 59, 1 (2011), 219--225.",
      "doi": ""
    },
    {
      "text": "Christoph Amma, Thomas Krings, Jonas Böer, and Tanja Schultz. 2015. Advancing muscle-computer interfaces with high-density electromyography. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 929--938.",
      "doi": "10.1145/2702123.2702501"
    },
    {
      "text": "AS Anusha, SP Preejith, Tony J Akl, Jayaraj Joseph, and Mohanasankar Sivaprakasam. 2018. Dry Electrode Optimization for Wrist-based Electrodermal Activity Monitoring. In 2018 IEEE International Symposium on Medical Measurements and Applications (MeMeA). IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Marco Barbero, Roberto Merletti, and Alberto Rainoldi. 2012. Atlas of muscle innervation zones: understanding surface electromyography and its applications. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Sharon Baurley, Philippa Brock, Erik Geelhoed, and Andrew Moore. 2007. Communication-Wear: user feedback as part of a co-design process. In International Workshop on Haptic and Audio Interaction Design. Springer, 56--68.",
      "doi": "10.1007/978-3-540-76702-2_7"
    },
    {
      "text": "Guillermo Bernal, Tao Yang, Abhinandan Jain, and Pattie Maes. 2018. PhysioHMD: A Conformable, Modular Toolkit for Collecting Physiological Data from Head-mounted Displays. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (ISWC '18). ACM, NY, NY, USA, 160--167. DOI: http://dx.doi.org/10.1145/3267242.3267268",
      "doi": "10.1145/3267242.3267268"
    },
    {
      "text": "Paolo Bonato, Tommaso D'Alessio, and Marco Knaflitz. 1998. A statistical method for the measurement of muscle activation intervals from surface myoelectric signal during gait. IEEE Transactions on biomedical engineering 45, 3 (1998), 287--299.",
      "doi": ""
    },
    {
      "text": "Wolfram Boucsein. 2012. Electrodermal activity. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Varun Perumal C and Daniel Wigdor. 2015. Printem: Instant Printed Circuit Boards with Standard Office Printers Inks. In Proceedings of the 28th Annual ACM Symposium on User Interface Software Technology (UIST '15). Association for Computing Machinery, New York, NY, USA, 243--251. DOI: http://dx.doi.org/10.1145/2807442.2807511",
      "doi": ""
    },
    {
      "text": "Andrew Carek and Christian Holz. 2018. Naptics: Convenient and Continuous Blood Pressure Monitoring during Sleep. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 96.",
      "doi": "10.1145/3264906"
    },
    {
      "text": "C. Cochrane, C. Hertleer, and A. Schwarz-Pfeiffer. 2016. Smart textiles in health: An overview. In Smart Textiles and their Applications, Vladan Koncar (Ed.). Woodhead Publishing, Oxford, 9 -- 32. DOI: http://dx.doi.org/https://doi.org/10.1016/B978-0-08--100574--3.00002--3",
      "doi": ""
    },
    {
      "text": "Mary Boudreau Conover. 2002. Understanding electrocardiography. Elsevier Health Sciences.",
      "doi": ""
    },
    {
      "text": "Artem Dementyev, Javier Hernandez, Inrak Choi, Sean Follmer, and Joseph Paradiso. 2018. Epidermal Robots: Wearable Sensors That Climb on the Skin. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 102.",
      "doi": "10.1145/3264912"
    },
    {
      "text": "Artem Dementyev and Christian Holz. 2017. DualBlink: a wearable device to continuously detect, track, and actuate blinking for alleviating dry eyes and computer vision syndrome. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 1 (2017), 1.",
      "doi": "10.1145/3053330"
    },
    {
      "text": "Artem Dementyev, Hsin-Liu Cindy Kao, and Joseph A Paradiso. 2015. Sensortape: Modular and programmable 3d-aware dense sensor network on a tape. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 649--658.",
      "doi": "10.1145/2807442.2807507"
    },
    {
      "text": "Willem Einthoven, G Fahr, and A De Waart. 1913. \"U about the direction and the manifest size of the potential fluctuations in the human heart and about the influence of the heart situation on the shape of the electrocardiogram. Pflügler's Archive European Journal of Physiology 150, 6 (1913), 275--315.",
      "doi": ""
    },
    {
      "text": "Omar J Escalona, Louise McFrederick, Maira Borges, Pedro Linares, Ricardo Villegas, Gilberto I Perpiñan, James McLaughlin, and David McEneaney. 2017. Wrist and arm body surface bipolar ECG leads signal and sensor study for long-term rhythm monitoring. In 2017 Computing in Cardiology (CinC). IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Laura M Ferrari, Sudha Sudha, Sergio Tarantino, Roberto Esposti, Francesco Bolzoni, Paolo Cavallari, Christian Cipriani, Virgilio Mattoli, and Francesco Greco. 2018. Ultraconformable temporary tattoo electrodes for electrophysiology. Advanced Science 5, 3 (2018), 1700771.",
      "doi": ""
    },
    {
      "text": "T Finni, Min Hu, P Kettunen, T Vilavuo, and S Cheng. 2007. Measurement of EMG activity with textile electrodes embedded into clothing. Physiological measurement 28, 11 (2007), 1405.",
      "doi": ""
    },
    {
      "text": "Don C Fowles, Margaret J Christie, Robert Edelberg, William W Grings, David T Lykken, and Peter H Venables. 1981. Publication recommendations for electrodermal measurements. Psychophysiology 18, 3 (1981), 232--239.",
      "doi": ""
    },
    {
      "text": "Hossein Ghapanchizadeh, Siti A Ahmad, and Asnor Juraiza Ishak. 2015. Recommended surface EMG electrode position for wrist extension and flexion. In 2015 IEEE Student Symposium in Biomedical Engineering & Sciences (ISSBES). IEEE, 108--112.",
      "doi": ""
    },
    {
      "text": "Stephen Gilroy, Julie Porteous, Fred Charles, and Marc Cavazza. 2012. PINTER: Interactive Storytelling with Physiological Input. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, NY, NY, USA, 333--334. DOI: http://dx.doi.org/10.1145/2166966.2167039",
      "doi": "10.1145/2166966.2167039"
    },
    {
      "text": "Daniel Groeger and Jürgen Steimle. 2019. LASEC: Instant Fabrication of Stretchable Circuits Using a Laser Cutter. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 699, 14 pages. DOI: http://dx.doi.org/10.1145/3290605.3300929",
      "doi": "10.1145/3290605.3300929"
    },
    {
      "text": "Peter A Haddad, Amir Servati, Saeid Soltanian, Frank Ko, and Peyman Servati. 2017. Effects of flexible dry electrode design on electrodermal activity stimulus response detection. IEEE Transactions on Biomedical Engineering 64, 12 (2017), 2979--2987.",
      "doi": ""
    },
    {
      "text": "Manne Hannula, H Hinkula, and J Jauhiainen. 2008. Development and evaluation of one arm electrode based ECG measurement system. In 14th Nordic-Baltic Conference on Biomedical Engineering and Medical Physics. Springer, 234--237.",
      "doi": ""
    },
    {
      "text": "Hermie J Hermens, Bart Freriks, Catherine Disselhorst-Klug, and Günter Rau. 2000. Development of recommendations for SEMG sensors and sensor placement procedures. Journal of Electromyography and Kinesiology 10, 5 (oct 2000), 361--374. DOI: http://dx.doi.org/10.1016/S1050--6411(00)00027--4",
      "doi": ""
    },
    {
      "text": "Rafael E Herrera, James T Cain, EG Cape, and Gerard J Boyle. 1996. A high resolution ECG tool for detection of atrial and ventricular late potentials. In Computers in Cardiology 1996. IEEE, 629--632.",
      "doi": ""
    },
    {
      "text": "Christian Holz and Edward J Wang. 2017. Glabella: Continuously sensing blood pressure behavior using an unobtrusive wearable device. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 58.",
      "doi": "10.1145/3132024"
    },
    {
      "text": "Xian Huang, Yuhao Liu, Kaile Chen, Woo-Jung Shin, Ching-Jui Lu, Gil-Woo Kong, Dwipayan Patnaik, Sang-Heon Lee, Jonathan Fajardo Cortes, and John A Rogers. 2014. Stretchable, wireless sensors and functional substrates for epidermal characterization of sweat. Small 10, 15 (2014), 3083--3090.",
      "doi": ""
    },
    {
      "text": "Phil Jevon. 2010. Procedure for recording a standard 12-lead electrocardiogram. British Journal of Nursing 19, 10 (2010), 649--651.",
      "doi": ""
    },
    {
      "text": "Hsin-Liu Cindy Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin: rapidly prototyping on-skin user interfaces using skin-friendly materials. In Proceedings of the 2016 ACM International Symposium on Wearable Computers. ACM, 16--23.",
      "doi": ""
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 363--372. DOI: http://dx.doi.org/10.1145/2493432.2493486",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Arshad Khan, Joan Sol Roo, Tobias Kraus, and Jürgen Steimle. 2011. Soft Inkjet Circuits: Rapid Multi-Material Fabrication of Soft Circuits using a Commodity Inkjet Printer. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). ACM, NY, NY, USA, 10.",
      "doi": ""
    },
    {
      "text": "Jeonghyun Kim, Philipp Gutruf, Antonio M Chiarelli, Seung Yun Heo, Kyoungyeon Cho, Zhaoqian Xie, Anthony Banks, Seungyoung Han, Kyung-In Jang, Jung Woo Lee, and others. 2017. Oximetry: Miniaturized Battery-Free Wireless Systems for Wearable Pulse Oximetry (Adv. Funct. Mater. 1/2017). Advanced Functional Materials 27, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Jie Liu, Dongwen Ying, William Z Rymer, and Ping Zhou. 2015. Robust muscle activity onset detection using an unsupervised electromyogram learning framework. PloS one 10, 6 (2015), e0127990.",
      "doi": ""
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. 2016. Skintillates: Designing and creating epidermal interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 853--864.",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Johan Löfhede, Fernando Seoane, and Magnus Thordstein. 2012. Textile electrodes for EEG recording-A pilot study. Sensors 12, 12 (2012), 16907--16919.",
      "doi": ""
    },
    {
      "text": "Eric Markvicka, Guanyun Wang, Yi-Chin Lee, Gierad Laput, Carmel Majidi, and Lining Yao. 2019. ElectroDermis: Fully Untethered, Stretchable, and Highly-Customizable Electronic Bandages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Article Paper 632, 10 pages. DOI: http://dx.doi.org/10.1145/3290605.3300862",
      "doi": "10.1145/3290605.3300862"
    },
    {
      "text": "David A Mellis, Sam Jacoby, Leah Buechley, Hannah Perner-Wilson, and Jie Qi. 2013. Microcontrollers as material: crafting circuits with paper, conductive ink, electronic components, and an untoolkit. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 83--90.",
      "doi": "10.1145/2460625.2460638"
    },
    {
      "text": "Roberto Merletti, L Lo Conte, Elena Avignone, and Piero Guglielminotti. 1999. Modeling of surface myoelectric signals. I. Model implementation. IEEE transactions on biomedical engineering 46, 7 (1999), 810--820.",
      "doi": ""
    },
    {
      "text": "Roberto Merletti, Philip A Parker, and Philip J Parker. 2004. Electromyography: physiology, engineering, and non-invasive applications. Vol. 11. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Steven Nagels, Raf Ramakers, Kris Luyten, and Wim Deferme. 2018. Silicone Devices: A Scalable DIY Approach for Fabricating Self-Contained Multi-Layered Soft Circuits Using Microfluidics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 188.",
      "doi": "10.1145/3173574.3173762"
    },
    {
      "text": "Aditya Shekhar Nittala, Klaus Kruttwig, Jaeyeon Lee, Roland Bennewitz, Eduard Arzt, and Jürgen Steimle. 2019. Like a Second Skin: Understanding How Epidermal Devices Affect Human Tactile Perception. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 380.",
      "doi": "10.1145/3290605.3300610"
    },
    {
      "text": "Aditya Shekhar Nittala, Anusha Withana, Narjes Pourjafarian, and Jürgen Steimle. 2018. Multi-Touch Skin: A Thin and Flexible Multi-Touch Sensor for On-Skin Input. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 33.",
      "doi": "10.1145/3173574.3173607"
    },
    {
      "text": "Simon Olberding, Nan-Wei Gong, John Tiab, Joseph A. Paradiso, and Jürgen Steimle. 2013. A Cuttable Multi-touch Sensor. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 245--254. DOI: http://dx.doi.org/10.1145/2501988.2502048",
      "doi": "10.1145/2501988.2502048"
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, and Michael Haller. 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, NY, NY, USA, 745--756. DOI: http://dx.doi.org/10.1145/3242587.3242664",
      "doi": "10.1145/3242587.3242664"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: real-time sensing of surface and deformation gestures on flexible, interactive textiles, using a hybrid gesture detection pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 565--577.",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Shyamal Patel, Hyung Park, Paolo Bonato, Leighton Chan, and Mary Rodgers. 2012. A review of wearable sensors and systems with application in rehabilitation. Journal of neuroengineering and rehabilitation 9, 1 (2012), 21.",
      "doi": ""
    },
    {
      "text": "Angkoon Phinyomark, Chusak Limsakul, and Pornchai Phukpattaranont. 2009. A novel feature extraction for robust EMG pattern recognition. arXiv preprint arXiv:0912.3973 (2009).",
      "doi": ""
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in circuits: designing and building electronics on paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1713--1722.",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2457--2466. DOI: http://dx.doi.org/10.1145/2702123.2702487",
      "doi": "10.1145/2702123.2702487"
    },
    {
      "text": "Linda Rattfält. 2013. Smartware electrodes for ECG measurements -Design, evaluation and signal processing. Number 1546.",
      "doi": ""
    },
    {
      "text": "Linda Rattfält, Fredrik Björefors, David Nilsson, Xin Wang, Petronella Norberg, Per Ask, and Linda Rattfalt@liu Se. 2013. Properties of screen printed electrocardiography smartware electrodes investigated in an electro-chemical cell. Technical Report. DOI: http://dx.doi.org/10.1186/1475--925X-12--64",
      "doi": ""
    },
    {
      "text": "Bersain A Reyes, Hugo F Posada-Quintero, Justin R Bales, Amanda L Clement, George D Pins, Albert Swiston, Jarno Riistama, John P Florian, Barbara Shykoff, Michael Qin, and others. 2014. Novel electrodes for underwater ECG monitoring. IEEE Transactions on Biomedical Engineering 61, 6 (2014), 1863--1876.",
      "doi": ""
    },
    {
      "text": "Shigeru Sakurazawa, Naofumi Yoshida, and Nagisa Munekata. 2004. Entertainment Feature of a Game Using Skin Conductance Response. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, NY, NY, USA, 181--186. DOI: http://dx.doi.org/10.1145/1067343.1067365",
      "doi": "10.1145/1067343.1067365"
    },
    {
      "text": "T Scott Saponas, Desney S Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A Landay. 2009. Enabling always-available input with muscle-computer interfaces. In Proceedings of the 22nd annual ACM symposium on User interface software and technology. ACM, 167--176.",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "T Scott Saponas, Desney S Tan, Dan Morris, Jim Turner, and James A Landay. 2010. Making muscle-computer interfaces more practical. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 851--854.",
      "doi": "10.1145/1753326.1753451"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 579--588.",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Olimex EKG-EMG Shield. 2020. Open Source EMG-ECG Shields. (2020). https://www.olimex.com/Products/Duino/Shields/ SHIELD-EKG-EMG/open-source-hardware Last Accessed: 2020-01-08.",
      "doi": ""
    },
    {
      "text": "Sparkfun. 2020. SparkFun Single Lead Heart Rate Monitor. https://learn.sparkfun.com/tutorials/ ad8232-heart-rate-monitor-hookup-guide/all. (2020). Last Accessed: 2020-01-08.",
      "doi": ""
    },
    {
      "text": "Jürgen Steimle, Joanna Bergstrom-Lehtovirta, Martin Weigel, Aditya Shekhar Nittala, Sebastian Boring, Alex Olwal, and Kasper Hornbæk. 2017. On-skin interaction using body landmarks. Computer 50, 10 (2017), 19--27.",
      "doi": "10.1109/MC.2017.3641636"
    },
    {
      "text": "J Ridley Stroop. 1992. Studies of interference in serial verbal reactions. Journal of Experimental Psychology: General 121, 1 (1992), 15.",
      "doi": ""
    },
    {
      "text": "Seeed Studio. 2020a. Groove EMG Detector. http://wiki.seeedstudio.com/Grove-EMG_Detector/. (2020). Last Accessed: 2020-01-08.",
      "doi": ""
    },
    {
      "text": "Seeed Studio. 2020b. Groove GSR Sensor. http://wiki.seeedstudio.com/Grove-GSR_Sensor/. (2020). Last Accessed: 2020-01-08.",
      "doi": ""
    },
    {
      "text": "Miroslav Svetlak, Petr Bob, Michal Cernik, and Miloslav Kukleta. 2010. Electrodermal complexity during the Stroop colour word test. Autonomic Neuroscience 152, 1--2 (2010), 101--107.",
      "doi": ""
    },
    {
      "text": "Marieke van Dooren, J.J.G. (Gert-Jan) de Vries, and Joris H. Janssen. 2012. Emotional sweating across the body: Comparing 16 different skin conductance measurement locations. Physiology & Behavior 106, 2 (may 2012), 298--304. DOI: http://dx.doi.org/10.1016/J.PHYSBEH.2012.01.020",
      "doi": ""
    },
    {
      "text": "Chiuan Wang, Hsuan-Ming Yeh, Bryan Wang, Te-Yen Wu, Hsin-Ruey Tsai, Rong-Hao Liang, Yi-Ping Hung, and Mike Y. Chen. 2016. CircuitStack: Supporting Rapid Prototyping and Evolution of Electronic Circuits. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 687--695. DOI: http://dx.doi.org/10.1145/2984511.2984527",
      "doi": ""
    },
    {
      "text": "R Chad Webb, Andrew P Bonifas, Alex Behnaz, Yihui Zhang, Ki Jun Yu, Huanyu Cheng, Mingxing Shi, Zuguang Bian, Zhuangjian Liu, Yun-Soung Kim, and others. 2013. Ultrathin conformal devices for precise and continuous thermal characterization of human skin. Nature materials 12, 10 (2013), 938.",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. Iskin: flexible, stretchable and visually customizable on-body touch sensors for mobile computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2991--3000.",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. SkinMarks: Enabling Interaction on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/3025453.3025704",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo: A Thin and Feel-Through Tattoo for On-Skin Tactile Output. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 365--378.",
      "doi": "10.1145/3242587.3242645"
    },
    {
      "text": "PJ Xu, H Zhang, and XM Tao. 2008. Textile-structured electrodes for electrocardiogram. Textile Progress 40, 4 (2008), 183--213.",
      "doi": ""
    },
    {
      "text": "Hung-Chi Yang, Tsung-Fu Chien, Shang-Hao Liu, and Hsuan-Han Chiang. Study of Single-Arm Electrode for ECG Measurement Using Flexible Print Circuit. (????).",
      "doi": ""
    },
    {
      "text": "Woon-Hong Yeo, Yun-Soung Kim, Jongwoo Lee, Abid Ameen, Luke Shi, Ming Li, Shuodao Wang, Rui Ma, Sung Hun Jin, Zhan Kang, and others. 2013. Multifunctional epidermal electronics printed directly onto the skin. Advanced Materials 25, 20 (2013), 2773--2778.",
      "doi": ""
    },
    {
      "text": "P Zipp. 1982. Recommendations for the Standardization of Lead Positions in Surface Electromyography*. Technical Report. 41--54 pages. https://link.springer.com/content/pdf/10.1007/BF00952243.pdf",
      "doi": ""
    }
  ]
}