{
  "doi": "10.1145/3313831.3376225",
  "title": "\"All in the Same Boat\": Tradeoffs of Voice Assistant Ownership for Mixed-Visual-Ability Families",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "A growing body of evidence suggests Voice Assistants (VAs) are highly valued by people with vision impairments (PWVI) and much less so by sighted users. Yet, many are deployed in homes where both PWVI and sighted family members reside. Researchers have yet to study whether VA use and perceived benefits are affected in settings where one person has a visual impairment and others do not. We conducted six in-depth interviews with partners to understand patterns of domestic VA use in mixed-visual-ability families. Although PWVI were more motivated to acquire VAs, used them more frequently, and learned more proactively about their features, partners with vision identified similar benefits and disadvantages of having VAs in their home. We found that the universal usability of VAs both equalizes experience across abilities and presents complex tradeoffs for families-regarding interpersonal relationships, domestic labor, and physical safety-which are weighed against accessibility benefits for PWVI and complicate the decision to fully integrate VAs in the home.",
  "authors": [
    {
      "name": "Kevin M. Storer",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-99659083189/rel-imgonly/scholar.jpg",
      "acmid": "99659083189",
      "orcid": "missing"
    },
    {
      "name": "Tejinder K. Judge",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655970",
      "orcid": "missing"
    },
    {
      "name": "Stacy M. Branham",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81442598659/rel-imgonly/stacy_branham-0320_crop.jpg",
      "acmid": "81442598659",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M. Branham. 2018. \"Siri Talks at You\": An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18), 249--258. https://doi.org/10.1145/3234695.3236344",
      "doi": "10.1145/3234695.3236344"
    },
    {
      "text": "James L. Alty and Dimitrios I. Rigas. 1998. Communicating Graphical Information to Blind Users Using Music: The Role of Context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98), 574--581. https://doi.org/10.1145/274644.274721",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames, Janet Go, Joseph \"Jofish\" Kaye, and Mirjana Spasojevic. 2010. Making Love in the Network Closet: The Benefits and Work of Family Videochat. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10), 145--154. https://doi.org/10.1145/1718918.1718946",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Tawfiq Ammari, Jofish Kaye, Janice Y. Tsai, and Frank Bentley. 2019. Music, Search, and IoT: How People (Really) Use Voice Assistants. ACM Trans. Comput.-Hum. Interact. 26, 3: 17:1--17:28. https://doi.org/10.1145/3311956",
      "doi": "10.1145/3311956"
    },
    {
      "text": "Shiri Azenkot and Nicole B. Lee. 2013. Exploring the Use of Speech Input by Blind People on Mobile Devices. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13), 11:1--11:8. https://doi.org/10.1145/2513383.2513440",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "Saminda Sundeepa Balasuriya, Laurianne Sitbon, Andrew A. Bayor, Maria Hoogstrate, and Margot Brereton. 2018. Use of Voice Activated Interfaces by People with Intellectual Disability. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI '18), 102--112. https://doi.org/10.1145/3292147.3292161",
      "doi": "10.1145/3292147.3292161"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by Making Strange: Defamiliarization and the Design of Domestic Technologies. ACM Trans. Comput.-Hum. Interact. 12, 2: 149--173. https://doi.org/10.1145/1067860.1067862",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 243:1--243:13. https://doi.org/10.1145/3290605.3300473",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility, 161--173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3: 91:1--91:24. https://doi.org/10.1145/3264901",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Jeffrey P. Bigham, Ryan S. Kaminsky, Richard E. Ladner, Oscar M. Danielsson, and Gordon L. Hempton. 2006. WebInSight:: Making Web Images Accessible. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '06), 181--188. https://doi.org/10.1145/1168987.1169018",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Jeffrey P Bigham, Craig M Prince, and Richard E Ladner. 2008. WebAnywhere: a screen reader on-thego. In Proceedings of the 2008 international crossdisciplinary conference on Web accessibility (W4A), 73--82.",
      "doi": "10.1145/1368044.1368075"
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2373--2382.",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. The invisible work of accessibility: how blind employees manage accessibility in mixed-ability workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, 163--171.",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Stacy M. Branham and Antony Rishin Mukkath Roy. 2019. Reading Between the Guidelines: How Commercial Voice Assistant Guidelines Hinder Accessibility for Blind Users. In Proceedings of the ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '19).",
      "doi": ""
    },
    {
      "text": "Minji Cho, Sang-su Lee, and Kun-Pyo Lee. 2019. Once a Kind Friend is Now a Thing: Understanding How Conversational Agents at Home Are Forgotten. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 1557--1569. https://doi.org/10.1145/3322276.3322332",
      "doi": "10.1145/3322276.3322332"
    },
    {
      "text": "Eric Corbett and Astrid Weber. 2016. What Can I Say?: Addressing User Experience Challenges of a Mobile Voice User Interface for Accessibility. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16), 72--82. https://doi.org/10.1145/2935334.2935386",
      "doi": "10.1145/2935334.2935386"
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. \"What Can I Help You with?\": Infrequent Users' Experiences of Intelligent Personal Assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17), 43:1--43:12. https://doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Melissa Dawe. 2006. Desperately Seeking Simplicity: How Young Adults with Cognitive Disabilities and Their Families Adopt Assistive Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 1143--1152. https://doi.org/10.1145/1124772.1124943",
      "doi": "10.1145/1124772.1124943"
    },
    {
      "text": "Marianne Dee and Vicki L. Hanson. 2016. A Pool of Representative Users for Accessibility Research: Seeing Through the Eyes of the Users. ACM Trans. Access. Comput. 8, 1: 4:1--4:31. https://doi.org/10.1145/2845088",
      "doi": "10.1145/2845088"
    },
    {
      "text": "Daniel Fitton, Janet C Read, Gavin Sim, and Brendan Cassidy. 2018. Co-designing Voice User Interfaces with Teenagers in the Context of Smart Homes. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 55--66. https://doi.org/10.1145/3202185.3202744",
      "doi": "10.1145/3202185.3202744"
    },
    {
      "text": "Richard Guy and Khai Truong. 2012. CrossingGuard: exploring information content in navigation aids for visually impaired pedestrians. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 405--414.",
      "doi": "10.1145/2207676.2207733"
    },
    {
      "text": "Debby Hindus. 1999. The Importance of Homes in Technology Research. In Cooperative Buildings. Integrating Information, Organizations, and Architecture (Lecture Notes in Computer Science), 199--207.",
      "doi": ""
    },
    {
      "text": "Tejinder K. Judge, Carman Neustaedter, and Andrew F. Kurtz. 2010. The family window: the design and evaluation of a domestic media space. 2361--2370. https://doi.org/10.1145/1753326.1753682",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide Rule: Making Mobile Touch Screens Accessible to Blind People Using Multi-touch Interaction Techniques. In Proceedings of the 10th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '08), 73--80. https://doi.org/10.1145/1414471.1414487",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Steven Kelley. 2016. Google Home: A New Electronic Digital Assistant - VisionAware. VisionAware. Retrieved September 2, 2019 from https://www.visionaware.org/info/everydayliving/helpful-products/using-a-computer/googlehome/1245",
      "doi": ""
    },
    {
      "text": "Silvia B. Lovato, Anne Marie Piper, and Ellen A. Wartella. 2019. Hey Google, Do Unicorns Exist?: Conversational Agents As a Path to Answers to Children's Questions. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19), 301--313. https://doi.org/10.1145/3311927.3323150",
      "doi": ""
    },
    {
      "text": "Silvia Lovato and Anne Marie Piper. 2015. \"Siri, is This You?\": Understanding Young Children's Interactions with Voice Input Systems. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15), 335--338. https://doi.org/10.1145/2771839.2771910",
      "doi": "10.1145/2771839.2771910"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf Between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5286--5297. https://doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility, 3--10.",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Melissa Mazmanian and Simone Lanette. 2017. \"Okay, One More Episode\": An Ethnography of Parenting in the Digital Age. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 2273--2286. https://doi.org/10.1145/2998181.2998218",
      "doi": "10.1145/2998181.2998218"
    },
    {
      "text": "J.J. Meddaugh. 2017. There's No Place like Google Home: A Review of Google's Voice Assistant | AccessWorld | American Foundation for the Blind. American Foundation for the Blind. Retrieved September 2, 2019 from https://www.afb.org/aw/18/3/15230",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Alison Oldfield, Taimur Ahmed, Antonis Vafeas, and Sunny Miglani. 2019. Voice User Interfaces in Schools: Co-designing for Inclusion with Visually-Impaired and Sighted Pupils. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 378:1--378:15. https://doi.org/10.1145/3290605.3300608",
      "doi": "10.1145/3290605.3300608"
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 6:1--6:7. https://doi.org/10.1145/3173574.3173580",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Luiza Superti Pantoja, Kyle Diederich, Liam Crawford, and Juan Pablo Hourcade. 2019. Voice Agents Supporting High-Quality Social Play. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19), 314--325. https://doi.org/10.1145/3311927.3323151",
      "doi": "10.1145/3311927.3323151"
    },
    {
      "text": "Victoria Petrock. US Voice Assistant Users 2019. eMarketer. Retrieved September 17, 2019 from https://www.emarketer.com/content/us-voice-assistantusers-2019",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper and James D Hollan. 2008. Supporting medical conversations between deaf and hearing individuals with tabletop displays. In Proceedings of the 2008 ACM conference on Computer supported cooperative work, 147--156.",
      "doi": "10.1145/1460563.1460587"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 640:1--640:12. https://doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "François Portet, Michel Vacher, Caroline Golanski, Camille Roux, and Brigitte Meillon. 2013. Design and Evaluation of a Smart Home Voice Interface for the Elderly: Acceptability and Objection Aspects. Personal Ubiquitous Comput. 17, 1: 127--144. https://doi.org/10.1007/s00779-011-0470--5",
      "doi": "10.1007/s00779-011-0470-5"
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. \"Accessibility Came by Accident\": Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 459:1--459:13. https://doi.org/10.1145/3173574.3174033",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "Amanda Purington, Jessie G. Taft, Shruti Sannon, Natalya N. Bazarova, and Samuel Hardman Taylor. 2017. \"Alexa is My New BFF\": Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 2853--2859. https://doi.org/10.1145/3027063.3053246",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Jennifer A. Rode. 2010. The Roles That Make the Domestic Work. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10), 381--390. https://doi.org/10.1145/1718918.1718984",
      "doi": "10.1145/1718918.1718984"
    },
    {
      "text": "David A. Ross and Bruce B. Blasch. 2000. Wearable interfaces for orientation and wayfinding. In Proceedings of the fourth international ACM conference on Assistive technologies, 193--200.",
      "doi": ""
    },
    {
      "text": "S. Schlögl, G. Chollet, M. Garschall, M. Tscheligi, and G. Legouverneur. 2013. Exploring Voice User Interfaces for Seniors. In Proceedings of the 6th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '13), 52:1-- 52:2. https://doi.org/10.1145/2504335.2504391",
      "doi": "10.1145/2504335.2504391"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What's Up?\": A MixedMethods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), 857--868. https://doi.org/10.1145/3196709.3196772",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Cynthia L. Bennett, and Jacob O. Wobbrock. 2016. How Designing for People With and Without Disabilities Shapes Student Design Thinking. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 229--237. https://doi.org/10.1145/2982142.2982158",
      "doi": "10.1145/2982142.2982158"
    },
    {
      "text": "Kristen Shinohara, Jacob O. Wobbrock, and Wanda Pratt. 2018. Incorporating Social Factors in Accessible Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18), 149--160. https://doi.org/10.1145/3234695.3236346",
      "doi": "10.1145/3234695.3236346"
    },
    {
      "text": "Ben Shneiderman. 2000. Universal usability. Communications of the ACM 43, 5: 85--85.",
      "doi": "10.1145/332833.332843"
    },
    {
      "text": "Kevin M. Storer and Stacy M. Branham. 2019. \" That's the Way Sighted People Do It\": What Blind Parents Can Teach Technology Designers About CoReading with Children. In Proceedings of the 2019 on Designing Interactive Systems Conference, 385--398.",
      "doi": ""
    },
    {
      "text": "Alexander Thayer, Matthew J. Bietz, Katie Derthick, and Charlotte P. Lee. 2012. I Love You, Let's Share Calendars: Calendar Sharing As Relationship Work. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 749--758. https://doi.org/10.1145/2145204.2145317",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Cynthia L Bennett, Cecily Morrison, Edward Cutrell, and Alex S Taylor. 2018. I can do everything but see!--How People with Vision Impairments Negotiate their Abilities in Social Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 203.",
      "doi": "10.1145/3173574.3173777"
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 739--752. https://doi.org/10.1145/3064663.3064689",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "Alexandra Vtyurina, Adam Fourney, Meredith Ringel Morris, Leah Findlater, and Ryen W. White. 2019. Bridging Screen Readers and Voice Assistants for Enhanced Eyes-Free Web Search. In The World Wide Web Conference (WWW '19), 3590--3594. https://doi.org/10.1145/3308558.3314136",
      "doi": ""
    },
    {
      "text": "Emily Q. Wang and Anne Marie Piper. 2018. Accessibility in Action: Co-Located Collaboration Among Deaf and Hearing Professionals. Proc. ACM Hum.-Comput. Interact. 2, CSCW: 180:1--180:25. https://doi.org/10.1145/3274449",
      "doi": ""
    },
    {
      "text": "Brian Wentz, Paul T. Jaeger, and Jonathan Lazar. 2011. Retrofitting accessibility: The legal inequality of after-the-fact online access for persons with disabilities in the United States. First Monday 16, 11. https://doi.org/10.5210/fm.v16i11.3666",
      "doi": ""
    },
    {
      "text": "Michele A Williams, Caroline Galbraith, Shaun K Kane, and Amy Hurst. 2014. Just let the cane hit it: how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility, 217--224.",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Fredrik Winberg and John Bowers. 2004. Assembling the Senses: Towards the Design of Cooperative Interfaces for Visually Impaired Users. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04), 332--341. https://doi.org/10.1145/1031607.1031662",
      "doi": "10.1145/1031607.1031662"
    },
    {
      "text": "Rayoung Yang, Sangmi Park, Sonali R. Mishra, Zhenan Hong, Clint Newsom, Hyeon Joo, Erik Hofer, and Mark W. Newman. 2011. Supporting spatial awareness and independent wayfinding for pedestrians with visual impairments. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, 27--34.",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and A. J. Bernheim Brush. 2018. Children Asking Questions: Speech Interface Reformulations and Personification Preferences. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 300--312. https://doi.org/10.1145/3202185.3202207",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "Hanlu Ye, Meethu Malu, Uran Oh, and Leah Findlater. 2014. Current and Future Mobile and Wearable Device Use by People with Visual Impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3123--3132. https://doi.org/10.1145/2556288.2557085",
      "doi": "10.1145/2556288.2557085"
    },
    {
      "text": "Chien Wen Yuan, Benjamin V. Hanrahan, Sooyeon Lee, Mary Beth Rosson, and John M. Carroll. 2017. I Didn't Know That You Knew I Knew: Collaborative Shopping Practices Between People with Visual Impairment and People with Vision. Proc. ACM Hum.Comput. Interact. 1, CSCW: 118:1--118:18. https://doi.org/10.1145/3134753",
      "doi": ""
    },
    {
      "text": "JAWS® -- Freedom Scientific. Retrieved September 10, 2019 from https://www.freedomscientific.com/products/software/j aws/",
      "doi": ""
    },
    {
      "text": "NV Access. Retrieved September 10, 2019 from https://www.nvaccess.org/",
      "doi": ""
    },
    {
      "text": "Talking Products. Retrieved September 10, 2019 from https://assistech.com/store/talking-products",
      "doi": ""
    }
  ]
}