{
  "doi": "10.1145/3313831.3376343",
  "title": "Interactive Multisensory Environments for Primary School Children",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Interactive Multi-Sensory Environments (iMSEs) are room-sized interactive installations equipped with digitally enriched physical materials and ambient embedded devices. These items can sense users' presence, gestures, movements, and manipulation, and react by providing gentle stimulation (e.g., light, sound, projections, blowing bubbles, tactile feel, aromas) to different senses. Most of prior research on iMSEs investigates their use for persons with disabilities (e.g., autism). Our work focuses on the use of iMSEs in primary education contexts and for mixed groups of young students, i.e., children with and without disability. The paper describes the latest version of an iMSE called Magic Room that has been installed in two local schools. We report two empirical studies devoted to understand how the Magic Room could be used in inclusive educational settings, and to explore its potential benefits.",
  "tags": [
    "children with special needs",
    "embodied interaction",
    "interactive multisensory environment",
    "primary school",
    "smart object",
    "smart space",
    "well-being",
    "children"
  ],
  "authors": [
    {
      "name": "Franca Garzotto",
      "institution": "Politecnico di Milano, Milano, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100037686",
      "orcid": "missing"
    },
    {
      "name": "Eleonora Beccaluva",
      "institution": "Politecnico di Milano, Milano, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261422",
      "orcid": "missing"
    },
    {
      "name": "Mattia Gianotti",
      "institution": "Politecnico di Milano, Milan, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659323477",
      "orcid": "missing"
    },
    {
      "name": "Fabiano Riccardi",
      "institution": "Politecnico di Milano, Milan, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659323651",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agosta, G., Borghese, L., Brandolese, C., Clasadonte, F., Fornaciari, W., Garzotto, F., ... & Valla, M. (2015, August). Playful Supervised Smart Spaces (P3S)--A Framework for Designing, Implementing and Deploying Multisensory Play Experiences for Children with Special Needs. In 2015 Euromicro Conference on Digital System Design (pp. 158--164). IEEE.",
      "doi": ""
    },
    {
      "text": "Bacon, A. L., Fein, D., Morris, R., Waterhouse, L., & Allen, D. (1998). The responses of autistic children to the distress of others. Journal of autism and developmental disorders, 28(2), 129--142.",
      "doi": ""
    },
    {
      "text": "Baldwin, A. L. (1955). Behavior and development in childhood.",
      "doi": ""
    },
    {
      "text": "Beccaluva, E. A., Bonarini, A., Cerabolini, R., Clasadonte, F., Garzotto, F., Gelsomini, M., ... & Viola, L. (2017). Exploring engagement with robots among persons with neurodevelopmental disorders. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN) (pp. 903--909). IEEE.",
      "doi": ""
    },
    {
      "text": "Benigno, V., Epifania, O., Fante, C., Ravicchio, F., & Trentin, G. Classi ibride per promuovere relazioni e apprendimenti.",
      "doi": ""
    },
    {
      "text": "Brule, E., Bailly, G., Brock, A., Valentin, F., Denis, G., & Jouffrais, C. (2016, May). MapSense: multisensory interactive maps for children living with visual impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (pp. 445--457). ACM.",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Cadman, D., Boyle, M., Szatmari, P., & Offord, D. R. (1987). Chronic illness, disability, and mental and social well-being: findings of the Ontario Child Health Study. Pediatrics, 79(5), 805--813.",
      "doi": ""
    },
    {
      "text": "Carter, E. W., Hughes, C., Guth, C. B., & Copeland, S. R. (2005). Factors influencing social interaction among high school students with intellectual disabilities and their general education peers. American Journal on Mental Retardation, 110(5), 366--377.",
      "doi": ""
    },
    {
      "text": "Colby, K. M. (1973). The rationale for computerbased treatment of language difficulties in nonspeaking autistic children. Journal of Autism and Childhood Schizophrenia, 3(3), 254--260.",
      "doi": ""
    },
    {
      "text": "Diener, E., Diener, M., & Diener, C. (2009). Factors predicting the subjective well-being of nations. In Culture and well-being (pp. 43--70). Springer, Dordrecht.",
      "doi": ""
    },
    {
      "text": "Eyberg, S. M., & Ross, A. W. (1978). Assessment of child behavior problems: The validation of a new inventory. Journal of Clinical Child & Adolescent Psychology, 7(2), 113--116.",
      "doi": ""
    },
    {
      "text": "Foglia, L., & Wilson, R. A. (2013). Embodied cognition. Wiley Interdisciplinary Reviews: Cognitive Science, 4(3), 319--325.",
      "doi": ""
    },
    {
      "text": "Garzotto, F., & Gelsomini, M. (2018). Magic Room: A Smart Space for Children with Neurodevelopmental Disorder. IEEE Pervasive Computing, 17(1), 38--48.",
      "doi": "10.1109/MPRV.2018.011591060"
    },
    {
      "text": "Ladd, G. W., & Profilet, S. M. (1996). The Child Behavior Scale: A teacher-report measure of young children's aggressive, withdrawn, and prosocial behaviors. Developmental psychology, 32(6), 1008.",
      "doi": ""
    },
    {
      "text": "Lancioni, G. E., Cuvo, A. J., & O'reilly, M. F. (2002). Snoezelen: an overview of research with people with developmental disabilities and dementia. Disability and rehabilitation, 24(4), 175184.",
      "doi": ""
    },
    {
      "text": "Liu, J. (2004). Childhood externalizing behavior: Theory and implications. Journal of child and adolescent psychiatric nursing, 17(3), 93--103.",
      "doi": ""
    },
    {
      "text": "Lotan, M., & Shapiro, M. (2005). Management of young children with Rett disorder in the controlled multi-sensory (Snoezelen) environment. Brain and Development, 27, S88-S94.",
      "doi": ""
    },
    {
      "text": "Marzocchi, G. M., & Tobia, V. (2015). QBS 8--13: Questionari per la valutazione del benessere scolastico e identificazione dei fattori di rischio. Edizioni Centro Studi Erickson.",
      "doi": ""
    },
    {
      "text": "Mora-Guiard, J., Crowell, C., Pares, N., & Heaton, P. (2017). Sparking social initiation behaviors in children with Autism through full-body Interaction. International Journal of ChildComputer Interaction, 11, 62--71.",
      "doi": ""
    },
    {
      "text": "Pagliano, P. (2017). Multisensory environments. David Fulton Publishers.",
      "doi": ""
    },
    {
      "text": "Panyan, M. V. (1984). Computer technology for autistic students. Journal of Autism and Developmental Disorders, 14(4), 375--382.",
      "doi": ""
    },
    {
      "text": "Parasuraman, S., Purohit, Y. S., Godshalk, V. M., & Beutell, N. J. (1996). Work and family variables, entrepreneurial career success, and psychological well-being. Journal of vocational behavior, 48(3), 275--300.",
      "doi": ""
    },
    {
      "text": "Parés, N., Carreras, A., Durany, J., Ferrer, J., Freixa, P., Gómez, D., ... & Sanjurjo, À. (2005, June). Promotion of creative activity in children with severe autism through visuals in an interactive multisensory environment. In Proceedings of the 2005 conference on Interaction design and children (pp. 110--116). ACM.",
      "doi": "10.1145/1109540.1109555"
    },
    {
      "text": "Pares, N., Masri, P., Van Wolferen, G., & Creed, C. (2005). Achieving dialogue with children with severe autism in an adaptive multisensory interaction: the\" MEDIATE\" project. IEEE Transactions on Visualization and Computer Graphics, 11(6), 734--743.",
      "doi": "10.1109/TVCG.2005.88"
    },
    {
      "text": "Patterson, G. R., Littman, R. A., & Bricker, W. (1967). Assertive behavior in children: A step toward a theory of aggression. Monographs of the society for research in child development, 32(5), iii43.",
      "doi": ""
    },
    {
      "text": "Reynolds, C. R. (2010). Behavior assessment system for children. The Corsini encyclopedia of psychology, 1--2.",
      "doi": ""
    },
    {
      "text": "Ringland, K. E., Zalapa, R., Neal, M., Escobedo, L., Tentori, M., & Hayes, G. R. (2014, September). SensoryPaint: a multimodal sensory intervention for children with neurodevelopmental disorders. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (pp. 873--884). ACM.",
      "doi": "10.1145/2632048.2632065"
    },
    {
      "text": "Schopler, E., Reichler, R. J., DeVellis, R. F., & Daly, K. (1980). Toward objective classification of childhood autism: Childhood Autism Rating Scale (CARS). Journal of autism and developmental disorders, 10(1), 91--103.",
      "doi": ""
    },
    {
      "text": "Selleri, P., Gaffuri, P., & Mazzoni, E. (2006). Oltre Moreno: l'uso delle reti sociali come strumento di socializzazione e benessere in classe. Psicologia della salute.",
      "doi": ""
    },
    {
      "text": "Stadele, N. D., & Malaney, L. A. (2001). The effects of a multisensory environment on negative behavior and functional performance on individuals with autism. Journal of undergraduate research. University of Winsconsin-La Crosse.",
      "doi": ""
    },
    {
      "text": "Tobia, V., Greco, A., Steca, P., & Marzocchi, G. M. (2019). Children's wellbeing at school: A multidimensional and multi-informant approach. Journal of Happiness Studies, 20(3), 841--861.",
      "doi": ""
    },
    {
      "text": "Tomchek, S. D., & Dunn, W. (2007). Sensory processing in children with and without autism: a comparative study using the short sensory profile. American Journal of occupational therapy, 61(2), 190--200.",
      "doi": ""
    },
    {
      "text": "Tunson, J. N., & Candler, C. (2010). Behavioral states of children with severe disabilities in the multisensory environment. Physical & occupational therapy in pediatrics, 30(2), 101--110.",
      "doi": ""
    },
    {
      "text": "Tüzün, H., Ylmaz-Soylu, M., Karakus, T., Inal, Y., & Kizilkaya, G. (2009). The effects of computer games on primary school students' achievement and motivation in geography learning. Computers & Education, 52(1), 68--77.",
      "doi": "10.1016/j.compedu.2008.06.008"
    },
    {
      "text": "Wilson, M. (2002). Six views of embodied cognition. Psychonomic bulletin & review, 9(4), 625--636.",
      "doi": ""
    }
  ]
}