{
  "doi": "10.1145/3313831.3376783",
  "title": "Keeping Community in the Loop: Understanding Wikipedia Stakeholder Values for Machine Learning-Based Systems",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "On Wikipedia, sophisticated algorithmic tools are used to assess the quality of edits and take corrective actions. However, algorithms can fail to solve the problems they were designed for if they conflict with the values of communities who use them. In this study, we take a Value-Sensitive Algorithm Design approach to understanding a community-created and -maintained machine learning-based algorithm called the Objective Revision Evaluation System (ORES)---a quality prediction system used in numerous Wikipedia applications and contexts. Five major values converged across stakeholder groups that ORES (and its dependent applications) should: (1) reduce the effort of community maintenance, (2) maintain human judgement as the final authority, (3) support differing peoples' differing workflows, (4) encourage positive engagement with diverse editor groups, and (5) establish trustworthiness of people and algorithms within the community. We reveal tensions between these values and discuss implications for future research to improve algorithms like ORES.",
  "tags": [
    "value sensitive algorithm design",
    "machine learning",
    "peer production",
    "wikipedia",
    "community values",
    "ORES"
  ],
  "authors": [
    {
      "name": "C. Estelle Smith",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-99659230846/rel-imgonly/estelle_new_square.jpg",
      "acmid": "99659230846",
      "orcid": "missing"
    },
    {
      "name": "Bowen Yu",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131009",
      "orcid": "missing"
    },
    {
      "name": "Anjali Srivastava",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528163",
      "orcid": "missing"
    },
    {
      "name": "Aaron Halfaker",
      "institution": "Wikimedia Foundation, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81430677519/rel-imgonly/81430677519.jpg",
      "acmid": "81430677519",
      "orcid": "missing"
    },
    {
      "name": "Loren Terveen",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81100276946/rel-imgonly/my_mcknight_photo_2017.jpg",
      "acmid": "81100276946",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    }
  ],
  "references": [
    {
      "text": "2019a. Wikipedia: Please do not bite the newcomers. (May 2019). https://en.wikipedia.org/w/index.php?title=Wikipedia: Please_do_not_bite_the_newcomers&oldid=897507618 Page Version ID: 897507618.",
      "doi": ""
    },
    {
      "text": "2019b. Wikipedia:What Wikipedia is not. (May 2019). https://en.wikipedia.org/w/index.php?title=Wikipedia: What_Wikipedia_is_not&oldid=899044833 Page Version ID: 899044833.",
      "doi": ""
    },
    {
      "text": "Alekh Agarwal, Alina Beygelzimer, Miroslav Dudik, John Langford, and Hanna Wallach. 2018. A Reductions Approach to Fair Classification. arXiv:1803.02453 [cs] (March 2018). http://arxiv.org/abs/1803.02453 arXiv: 1803.02453.",
      "doi": ""
    },
    {
      "text": "Marco Almada. 2019. Human intervention in automated decision-making: Toward the construction of contestable systems. In International Conference on Artificial Intelligence and Law (ICAIL'19).",
      "doi": "10.1145/3322640.3326699"
    },
    {
      "text": "David Bau, Bolei Zhou, Aditya Khosla, Aude Oliva, and Antonio Torralba. 2017. Network dissection: Quantifying interpretability of deep visual representations. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 6541--6549.",
      "doi": ""
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next Steps for Value Sensitive Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12). ACM, NY, NY, USA, 1125--1134. DOI: http://dx.doi.org/10.1145/2207676.2208560 event-place: Austin, Texas, USA.",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Eshwar Chandrasekharan, Chaitrali Gandhi, Matthew Wortley Mustelier, and Eric Gilbert. 2019. Crossmod: A Cross-Community Learning-based System to Assist Reddit Moderators. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (2019), 174.",
      "doi": "10.1145/3359276"
    },
    {
      "text": "Hao-Fei Cheng, Ruotong Wang, Zheng Zhang, Fiona O'Connell, Terrance Gray, F. Maxwell Harper, and Haiyi Zhu. 2019. Explaining Decision-Making Algorithms Through UI: Strategies to Help Non-Expert Stakeholders. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, 559:1--559:12. DOI: http://dx.doi.org/10.1145/3290605.3300789 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290605.3300789"
    },
    {
      "text": "Alexandra Chouldechova and Aaron Roth. 2018. The frontiers of fairness in machine learning. arXiv preprint arXiv:1810.08810 (2018).",
      "doi": ""
    },
    {
      "text": "Charles T Clotfelter, Helen F Ladd, and Jacob L Vigdor. 2006. Teacher-student matching and the assessment of teacher effectiveness. Journal of human Resources 41, 4 (2006), 778--820.",
      "doi": ""
    },
    {
      "text": "Sam Corbett-Davies, Emma Pierson, Avi Feller, Sharad Goel, and Aziz Huq. 2017. Algorithmic decision making and the cost of fairness. In Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 797--806.",
      "doi": "10.1145/3097983.3098095"
    },
    {
      "text": "Dan Cosley, Dan Frankowski, Loren Terveen, and John Riedl. 2007. SuggestBot: Using Intelligent Task Routing to Help People Find Work in Wikipedia. In Proceedings of the 12th International Conference on Intelligent User Interfaces (IUI '07). ACM, NY, NY, USA, 32--41. DOI: http://dx.doi.org/10.1145/1216295.1216309 event-place: Honolulu, Hawaii, USA.",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Quang Vinh Dang and Claudia-Lavinia Ignat. 2016. Quality assessment of wikipedia articles without feature engineering. In Proceedings of the 16th ACM/IEEE-CS on Joint Conference on Digital Libraries. ACM, 27--30.",
      "doi": "10.1145/2910896.2910917"
    },
    {
      "text": "Michael A DeVito. 2017. From editors to algorithms: A values-based approach to understanding story selection in the Facebook news feed. Digital Journalism 5, 6 (2017), 753--773.",
      "doi": ""
    },
    {
      "text": "Michael A DeVito, Jeffrey T Hancock, Megan French, Jeremy Birnholtz, Judd Antin, Karrie Karahalios, Stephanie Tong, and Irina Shklovski. 2018. The algorithm and the user: How can HCI use lay understandings of algorithmic systems?. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, panel04.",
      "doi": "10.1145/3170427.3186320"
    },
    {
      "text": "Finale Doshi-Velez and Been Kim. 2017. Towards a rigorous science of interpretable machine learning. arXiv preprint arXiv:1702.08608 (2017).",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard Zemel. 2012. Fairness Through Awareness. In Proceedings of the 3rd Innovations in Theoretical Computer Science Conference (ITCS '12). ACM, NY, NY, USA, 214--226. DOI: http://dx.doi.org/10.1145/2090236.2090255 event-place: Cambridge, Massachusetts.",
      "doi": "10.1145/2090236.2090255"
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First i like it, then i hide it: Folk theories of social feeds. In Proceedings of the 2016 cHI conference on human factors in computing systems. ACM, 2371--2382.",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Andrea Forte, Vanesa Larco, and Amy Bruckman. 2009. Decentralization in Wikipedia Governance. Journal of Management Information Systems 26, 1 (July 2009), 49--72. DOI: http://dx.doi.org/10.2753/MIS0742--1222260103",
      "doi": "10.2753/MIS0742-1222260103"
    },
    {
      "text": "Megan French and Jeff Hancock. 2017. What's the folk theory? Reasoning about cyber-social systems. Reasoning About Cyber-Social Systems (February 2, 2017) (2017).",
      "doi": ""
    },
    {
      "text": "Sorelle A. Friedler, Carlos Scheidegger, Suresh Venkatasubramanian, Sonam Choudhary, Evan P. Hamilton, and Derek Roth. 2019. A Comparative Study of Fairness-enhancing Interventions in Machine Learning. In Proceedings of the Conference on Fairness, Accountability, and Transparency (FAT* '19). ACM, NY, NY, USA, 329--338. DOI: http://dx.doi.org/10.1145/3287560.3287589 event-place: Atlanta, GA, USA.",
      "doi": "10.1145/3287560.3287589"
    },
    {
      "text": "Batya Friedman, Peter H Kahn, Alan Borning, and Alina Huldtgren. 2013. Value sensitive design and information systems. In Early engagement and new technologies: Opening up the laboratory. Springer, 55--95.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger. 2011. The lives of bots. In Critical point of view: a Wikipedia reader, Geert Lovink and Nathaniel Tkacz (Eds.). Number 7 in INC Reader. Inst. of Network Cultures, Amsterdam, 78--93. http://stuartgeiger.com/lives-of-bots-wikipedia-cpov.pdf OCLC: 762034235.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger. 2014. Bots, bespoke, code and the materiality of software platforms. Information, Communication & Society 17, 3 (March 2014), 342--356. DOI: http://dx.doi.org/10.1080/1369118X.2013.873069",
      "doi": ""
    },
    {
      "text": "R Stuart Geiger. 2017. Beyond opening up the black box: Investigating the role of algorithmic systems in Wikipedian organizational culture. Big Data & Society 4, 2 (Dec. 2017), 2053951717730735. DOI: http://dx.doi.org/10.1177/2053951717730735",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger and Aaron Halfaker. 2013. When the Levee Breaks: Without Bots, What Happens to Wikipedia's Quality Control Processes?. In Proceedings of the 9th International Symposium on Open Collaboration (WikiSym '13). ACM, NY, NY, USA, 6:1--6:6. DOI: http://dx.doi.org/10.1145/2491055.2491061 event-place: Hong Kong, China.",
      "doi": "10.1145/2491055.2491061"
    },
    {
      "text": "R Stuart Geiger and Aaron Halfaker. 2016. Open algorithmic systems: lessons on opening the black box from Wikipedia. AoIR Selected Papers of Internet Research 6 (2016).",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger and Aaron Halfaker. 2017. Operationalizing Conflict and Cooperation Between Automated Software Agents in Wikipedia: A Replication and Expansion of 'Even Good Bots Fight'. Proc. ACM Hum.-Comput. Interact. 1, CSCW (Dec. 2017), 49:1--49:33. DOI: http://dx.doi.org/10.1145/3134684",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker. 2017. Interpolating quality dynamics in Wikipedia and demonstrating the Keilana effect. In Proceedings of the 13th International Symposium on Open Collaboration. ACM, 19.",
      "doi": "10.1145/3125433.3125475"
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, and John Riedl. 2013. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist 57, 5 (2013), 664--688.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, Amir Sarabadani, and Adam Wight. 2018. ORES: Facilitating re-mediation of Wikipedia's socio-technical problems. Computer-Supported Cooperative Work and Social Computing (CSCW) (2018).",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, Robert Kraut, and John Riedl. 2009. A Jury of Your Peers: Quality, Experience and Ownership in Wikipedia. In Proceedings of the 5th International Symposium on Wikis and Open Collaboration (WikiSym '09). ACM, NY, NY, USA, 15:1--15:10. DOI: http://dx.doi.org/10.1145/1641309.1641332 event-place: Orlando, Florida.",
      "doi": "10.1145/1641309.1641332"
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't Bite the Newbies: How Reverts Affect the Quantity and Quality of Wikipedia Work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, NY, NY, USA, 163--172. DOI: http://dx.doi.org/10.1145/2038558.2038585 event-place: Mountain View, California.",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "A. Halfaker and J. Riedl. 2012. Bots and Cyborgs: Wikipedia's Immune System. Computer 45, 3 (March 2012), 79--82. DOI: http://dx.doi.org/10.1109/MC.2012.82",
      "doi": ""
    },
    {
      "text": "Moritz Hardt, Eric Price, Nati Srebro, and others. 2016. Equality of opportunity in supervised learning. In Advances in neural information processing systems. 3315--3323.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Aaron Shaw. 2015. Mind the skills gap: the role of Internet know-how and gender in differentiated contributions to Wikipedia. Information, Communication & Society 18, 4 (April 2015), 424--442. DOI: http://dx.doi.org/10.1080/1369118X.2014.957711",
      "doi": ""
    },
    {
      "text": "Lisa Anne Hendricks, Zeynep Akata, Marcus Rohrbach, Jeff Donahue, Bernt Schiele, and Trevor Darrell. 2016. Generating visual explanations. In European Conference on Computer Vision. Springer, 3--19.",
      "doi": ""
    },
    {
      "text": "Ibrahim Hooper. 2009. Coalition to Stop Cradle to Prison Algorithm Welcome Decision to Dissolve Joint Powers Agreement. (2009). https://www.cair.com/cair_ mn_coalition_to_stop_cradle_to_prison_algorithm_ welcome_decision_to_dissolve_joint_powers_agreement",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 611--620. DOI: http://dx.doi.org/10.1145/2470654.2470742 event-place: Paris, France.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Terry Judd and Gregor Kennedy. 2010. A five-year study of on-campus Internet use by undergraduate biomedical students. Computers & Education 55, 4 (Dec. 2010), 1564--1571. DOI: http://dx.doi.org/10.1016/j.compedu.2010.06.022",
      "doi": "10.1016/j.compedu.2010.06.022"
    },
    {
      "text": "Michael Kearns, Seth Neel, Aaron Roth, and Zhiwei Steven Wu. 2019. An empirical study of rich subgroup fairness for machine learning. In Proceedings of the Conference on Fairness, Accountability, and Transparency. ACM, 100--109.",
      "doi": "10.1145/3287560.3287592"
    },
    {
      "text": "Charles Kiene, Andrés Monroy-Hernández, and Benjamin Mako Hill. 2016. Surviving an eternal september: How an online community managed a surge of newcomers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1152--1156.",
      "doi": "10.1145/2858036.2858356"
    },
    {
      "text": "Pang Wei Koh and Percy Liang. 2017. Understanding black-box predictions via influence functions. In Proceedings of the 34th International Conference on Machine Learning-Volume 70. JMLR. org, 1885--1894.",
      "doi": "10.5555/3305381.3305576"
    },
    {
      "text": "Min Kyung Lee, Ji Tae Kim, and Leah Lizarondo. 2017. A Human-Centered Approach to Algorithmic Services: Considerations for Fair and Motivating Smart Community Service Management That Allocates Donations to Non-Profit Organizations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3365--3376. DOI: http://dx.doi.org/10.1145/3025453.3025884 event-place: Denver, Colorado, USA.",
      "doi": "10.1145/3025453.3025884"
    },
    {
      "text": "Aditya Krishna Menon and Robert C Williamson. 2018. The cost of fairness in binary classification. In Conference on Fairness, Accountability and Transparency. 107--118.",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2018. Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence (2018).",
      "doi": ""
    },
    {
      "text": "Shira Mitchell, Eric Potash, Solon Barocas, Alexander D'Amour, and Kristian Lum. 2018. Prediction-Based Decisions and Fairness: A Catalogue of Choices, Assumptions, and Definitions. arXiv:1811.07867 [stat] (Nov. 2018). http://arxiv.org/abs/1811.07867 arXiv: 1811.07867.",
      "doi": ""
    },
    {
      "text": "Claudia Muller-Birn, Leonhard Dobusch, and James D. Herbsleb. 2013. Work-to-rule: The Emergence of Algorithmic Governance in Wikipedia. In Proceedings of the 6th International Conference on Communities and Technologies (C&T '13). ACM, NY, NY, USA, 80--89. DOI: http://dx.doi.org/10.1145/2482991.2482999 event-place: Munich, Germany.",
      "doi": ""
    },
    {
      "text": "Geoff Pleiss, Manish Raghavan, Felix Wu, Jon Kleinberg, and Kilian Q Weinberger. 2017. On fairness and calibration. In Advances in Neural Information Processing Systems. 5680--5689.",
      "doi": ""
    },
    {
      "text": "Reid Priedhorsky, Jilin Chen, Shyong (Tony) K. Lam, Katherine Panciera, Loren Terveen, and John Riedl. 2007. Creating, Destroying, and Restoring Value in Wikipedia. In Proceedings of the 2007 International ACM Conference on Supporting Group Work (GROUP '07). ACM, NY, NY, USA, 259--268. DOI: http://dx.doi.org/10.1145/1316624.1316663 event-place: Sanibel Island, Florida, USA.",
      "doi": "10.1145/1316624.1316663"
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. Model-agnostic interpretability of machine learning. arXiv preprint arXiv:1606.05386 (2016).",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Tony Wang, Jina Yoon, and Geoff Kaufman. 2019. Moderator engagement and community development in the age of algorithms. New Media & Society 21, 7 (July 2019), 1417--1443. DOI: http://dx.doi.org/10.1177/1461444818821316",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2006. Interviewing as Qualitative Research: A Guide for Researchers in Education and the Social Sciences. Teachers College Press.",
      "doi": ""
    },
    {
      "text": "Tom Simonite. 2013. The decline of Wikipedia. Technology Review 116, 6 (2013), 50--56.",
      "doi": ""
    },
    {
      "text": "Una Titz. 2018. Facebook, AI censorship & content moderation. (May 2018). https://medium.com/beluga-team/ facebook-ai-censorship-content-moderation-5205d30f5063",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and Accountability Design Needs for Algorithmic Support in High-Stakes Public Sector Decision-Making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, 440:1--440:14. DOI: http://dx.doi.org/10.1145/3173574.3174014 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Nicholas Vincent, Isaac Johnson, and Brent Hecht. 2018. Examining Wikipedia with a broader lens: Quantifying the value of Wikipedia's relationships with other large-scale online communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 566.",
      "doi": "10.1145/3173574.3174140"
    },
    {
      "text": "Lauren Weber and RE Silverman. 2012. Your resume vs. oblivion. The Wall Street Journal 24 (2012).",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019. Help:New filters for edit review/Quality and Intent Filters - MediaWiki. (2019). https://www.mediawiki.org/wiki/Help:New_filters_for_ edit_review/Quality_and_Intent_Filters",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019. ORES - MediaWiki. (2019). https://www.mediawiki.org/wiki/ORES",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019a. ORES/Applications - MediaWiki. (2019). https://www.mediawiki.org/wiki/ORES/Applications",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019b. Page Curation - MediaWiki. (2019). https://www.mediawiki.org/wiki/Page_Curation",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019c. Research:Applying Value-Sensitive Algorithm Design to ORES - Meta. (2019). https://meta.wikimedia.org/wiki/Research: Applying_Value-Sensitive_Algorithm_Design_to_ORES",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019d. User:SuggestBot. (Feb. 2019). https://en.wikipedia.org/w/index.php?title=User:SuggestBot&oldid=881992394 Page Version ID: 881992394.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019e. Wikimedia Scoring Platform team MediaWiki. (2019). https://www.mediawiki.org/wiki/Wikimedia_Scoring_Platform_team",
      "doi": ""
    }
  ]
}