{
  "doi": "10.1145/3313831.3376143",
  "title": "ReCog: Supporting Blind People in Recognizing Personal Objects",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "We present ReCog, a mobile app that enables blind users to recognize objects by training a deep network with their own photos of such objects. This functionality is useful to differentiate personal objects, which cannot be recognized with pre-trained recognizers and may lack distinguishing tactile features. To ensure that the objects are well-framed in the captured photos, ReCog integrates a camera-aiming guidance that tracks target objects and instructs the user through verbal and sonification feedback to appropriately frame them. We report a two-session study with 10 blind participants using ReCog for object training and recognition, with and without guidance. We show that ReCog enables blind users to train and recognize their personal objects, and that camera-aiming guidance helps novice users to increase their confidence, achieve better accuracy, and learn strategies to capture better photos.",
  "tags": [
    "photography guidance",
    "object recognition",
    "visual impairment"
  ],
  "authors": [
    {
      "name": "Dragan Ahmetovic",
      "institution": "Università degli studi di Milano, Milano, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488672853",
      "orcid": "missing"
    },
    {
      "name": "Daisuke Sato",
      "institution": "Carnegie Mellon University & IBM, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81327491464/rel-imgonly/daisuke2018-200x200.jpg",
      "acmid": "81327491464",
      "orcid": "0000-0002-7670-9177"
    },
    {
      "name": "Uran Oh",
      "institution": "Ewha Womans University, Seoul, South Korea",
      "img": "/do/10.1145/contrib-81558395756/rel-imgonly/81558395756.jpg",
      "acmid": "81558395756",
      "orcid": "missing"
    },
    {
      "name": "Tatsuya Ishihara",
      "institution": "IBM Research - Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319494009",
      "orcid": "0000-0001-9618-0349"
    },
    {
      "name": "Kris Kitani",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331496187",
      "orcid": "missing"
    },
    {
      "name": "Chieko Asakawa",
      "institution": "Carnegie Mellon University & IBM, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100044475",
      "orcid": "0000-0002-5447-1305"
    }
  ],
  "references": [
    {
      "text": "Martín Abadi, Paul Barham, Jianmin Chen, Zhifeng Chen, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Geoffrey Irving, Michael Isard, Manjunath Kudlur, Josh Levenberg, Rajat Monga, Sherry Moore, Derek G. Murray, Benoit Steiner, Paul Tucker, Vijay Vasudevan, Pete Warden, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2016. TensorFlow: A System for Large-Scale Machine Learning. In 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI 16). USENIX Association.",
      "doi": "10.5555/3026877.3026899"
    },
    {
      "text": "Envision AI. Accessed: 2019--12--29. https://www.letsenvision.com",
      "doi": ""
    },
    {
      "text": "Jan Balata, Zdenek Mikovec, and Lukas Neoproud. 2015. BlindCamera: Central and Golden-ratio Composition for Blind Photographers. In Proceedings of the Mulitimedia, Interaction, Design and Innnovation (MIDI '15). ACM, 8:1--8:8.",
      "doi": ""
    },
    {
      "text": "BeMyEyes. Accessed: 2019--12--29. http://www.bemyeyes.org",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Martez E Mott, Edward Cutrell, Meredith Ringel Morris, and others. 2018. How teens with visual impairments take, edit, and share photos on social media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 76.",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Andrew Miller, Brandyn White, and Tom Yeh. 2010. VizWiz:: LocateIt-enabling blind people to locate objects in their environment. In Computer Vision and Pattern Recognition Workshops (CVPRW), 2010 IEEE Computer Society Conference on. IEEE, 65--72.",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194, 4--7.",
      "doi": ""
    },
    {
      "text": "Cesar Cadena, Luca Carlone, Henry Carrillo, Yasir Latif, Davide Scaramuzza, José Neira, Ian Reid, and John J Leonard. 2016. Past, present, and future of simultaneous localization and mapping: Toward the robust-perception age. IEEE Transactions on Robotics 32, 6, 1309--1332.",
      "doi": "10.1109/TRO.2016.2624754"
    },
    {
      "text": "CamFind. Accessed: 2019--12--29. http://www.camfindapp.com",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A coeffcient of agreement for nominal scales. Educational and psychological measurement 20, 1, 37--46.",
      "doi": ""
    },
    {
      "text": "Jeff Donahue, Yangqing Jia, Oriol Vinyals, Judy Hoffman, Ning Zhang, Eric Tzeng, and Trevor Darrell. 2014. DeCAF: A Deep Convolutional Activation Feature for Generic Visual Recognition. In Proceedings of the 31st International Conference on Machine Learning, Vol. 32. PMLR, Bejing, China, 647--655.",
      "doi": ""
    },
    {
      "text": "John A Gardner. 1996. Tactile graphics: an overview and resource guide. Information Technology and Disabilities 3, 4.",
      "doi": ""
    },
    {
      "text": "R. I. Hartley and A. Zisserman. 2004. Multiple View Geometry in Computer Vision (second ed.). Cambridge University Press, ISBN: 0521540518.",
      "doi": ""
    },
    {
      "text": "Rabia Jafri, Syed Abid Ali, and Hamid R Arabnia. 2013. Computer vision-based object recognition for the visually impaired using visual tags. In Proceedings of the International Conference on Image Processing, Computer Vision, and Pattern Recognition (IPCV). WorldComp), 1.",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P. Bigham. 2011. Supporting Blind Photography. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '11). ACM, 203--210.",
      "doi": ""
    },
    {
      "text": "Sang-Hack Jung and Camillo J Taylor. 2001. Camera trajectory estimation using inertial sensor measurements and structure from motion results. In Computer Vision and Pattern Recognition, 2001. CVPR 2001. Proceedings of the 2001 IEEE Computer Society Conference on, Vol. 2. IEEE.",
      "doi": ""
    },
    {
      "text": "Hernisa Kacorri, Kris M. Kitani, Jeffrey P. Bigham, and Chieko Asakawa. 2017. People with Visual Impairment Training Personal Object Recognizers: Feasibility and Challenges. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 5839--5849.",
      "doi": "10.1145/3025453.3025899"
    },
    {
      "text": "Andrej Karpathy, Stephen Miller, and Li Fei-Fei. 2013. Object Discovery in 3D Scenes via Shape Analysis. In International Conference on Robotics and Automation (ICRA).",
      "doi": ""
    },
    {
      "text": "Harmanpreet Kaur, Mitchell Gordon, Yiwei Yang, Jeffrey P Bigham, Jaime Teevan, Ece Kamar, and Walter S Lasecki. 2017. Crowdmask: Using crowds to preserve privacy in crowd-powered systems via progressive fltering. In Fifth AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980.",
      "doi": ""
    },
    {
      "text": "Philip Kortum and Megan Johnson. 2013. The relationship between levels of user experience with a product and perceived system usability. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 57. SAGE Publications Sage CA: Los Angeles, CA, 197--201.",
      "doi": ""
    },
    {
      "text": "Yann LeCun, Yoshua Bengio, and Geoffrey Hinton. 2015. Deep learning. nature 521, 7553, 436.",
      "doi": ""
    },
    {
      "text": "Kyungjun Lee, Jonggi Hong, Simone Pimento, Ebrima Jarjue, and Hernisa Kacorri. Revisiting Blind Photography in the Context of Teachable Object Recognizers. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility.",
      "doi": ""
    },
    {
      "text": "Seeing AI. Microsoft. Accessed: 2019--12--29. https://www.microsoft.com/en-us/seeing-ai",
      "doi": ""
    },
    {
      "text": "R. Mur-Artal, J. M. M. Montiel, and J. D. Tardós. 2015. ORB-SLAM: A Versatile and Accurate Monocular SLAM System. IEEE Transactions on Robotics 31, 5, 1147--1163.",
      "doi": "10.1109/TRO.2015.2463671"
    },
    {
      "text": "National Federation of the Blind. 2009. The braille literacy crisis in America: Facing the truth, reversing the trend, empowering the blind. http://www.nfb.org/images/nfb/documents/word/The_ Braille_Literacy_Crisis_In_America.doc",
      "doi": ""
    },
    {
      "text": "Jeffrey M Rzeszotarski and Meredith Ringel Morris. 2014. Estimating the social costs of friendsourcing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2735--2744.",
      "doi": "10.1145/2556288.2557181"
    },
    {
      "text": "Miguel A Sánchez, Montserrat Mateos, Juan A Fraile, and David Pizarro. 2012. Touch Me: a new and easier way for accessibility using Smartphones and NFC. In Highlights on Practical Applications of Agents and Multi-Agent Systems. Springer, 307--314.",
      "doi": ""
    },
    {
      "text": "Jeff Sauro. 2011. Measuring usability with the system usability scale (SUS).",
      "doi": ""
    },
    {
      "text": "Jeremi Sudol, Orang Dialameh, Chuck Blanchard, and Tim Dorcey. 2010. Looktel-A comprehensive platform for computer-aided visual assistance. In Computer Vision and Pattern Recognition Workshops (CVPRW), 2010 IEEE Computer Society Conference on. IEEE, 73--80.",
      "doi": ""
    },
    {
      "text": "Christian Szegedy, Vincent Vanhoucke, Sergey Ioffe, Jon Shlens, and Zbigniew Wojna. 2016. Rethinking the inception architecture for computer vision. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2818--2826.",
      "doi": ""
    },
    {
      "text": "TapTapSee. Accessed: 2019--12--29. http://www.taptapseeapp.com",
      "doi": ""
    },
    {
      "text": "Tombari F. Navab N. Tateno, K. 2015. Real-Time and Scalable Incremental Segmentation on Dense SLAM.",
      "doi": ""
    },
    {
      "text": "Ender Tekin and James M Coughlan. 2010. A mobile phone application enabling visually impaired users to fnd and read product barcodes. In International Conference on Computers for Handicapped Persons. Springer, 290--295.",
      "doi": ""
    },
    {
      "text": "Amazon Mechanical Turk. Accessed: 2019--12--29. https://www.mturk.com/",
      "doi": ""
    },
    {
      "text": "Marynel Vázquez and Aaron Steinfeld. 2014. An Assisted Photography Framework to Help Visually Impaired Users Properly Aim a Camera. ACM Trans. Comput.-Hum. Interact. 21, 5, Article 25, 29 pages.",
      "doi": "10.1145/2651380"
    },
    {
      "text": "Elizabeth M. Wenzel, Scott S. Fisher, Philip K. Stone, and Scott H. Foster. 1990. A System for Three-dimensional Acoustic \"Visualization\" in a Virtual Environment Workstation. In Proceedings of the 1st Conference on Visualization '90 (VIS '90). IEEE Computer Society Press, Los Alamitos, CA, USA, 329--337.",
      "doi": ""
    },
    {
      "text": "Samuel White, Hanjie Ji, and Jeffrey P. Bigham. 2010. EasySnap: Real-time Audio Feedback for Blind Photography. In Adjunct Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, 409--410.",
      "doi": ""
    },
    {
      "text": "Zhun Zhong, Liang Zheng, Guoliang Kang, Shaozi Li, and Yi Yang. 2017. Random Erasing Data Augmentation. arXiv preprint arXiv:1708.04896.",
      "doi": ""
    }
  ]
}