{
  "doi": "10.1145/3313831.3376432",
  "title": "Approach Matters: Linking Practitioner Approaches to Technology Design for People with Dementia",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2020,
  "badges": [],
  "abstract": "Technology design for dementia is an active and growing area. Though work to date has largely addressed functional needs, there is a growing recognition of the importance of supporting meaningful activities. However, technology for active, rather than passive, engagement is relatively novel beyond specific applications (e.g., music or reminiscence therapy). To better understand how to support active engagement of people with dementia in activities, we interviewed nineteen practitioners. Our findings reveal differing approaches to making sense of the actions of people with dementia, as well as to engaging them in activities. We discuss the importance of tracing epistemological understandings of dementia to different configurations of technology for people living with dementia and provide a practical guide to support designers to do so. Finally, we discuss considerations for the design of dementia technologies around facilitating self-actualization and managing emotional exposure for care-providers.",
  "tags": [
    "practitioners",
    "design",
    "meaningful activities",
    "dementia"
  ],
  "authors": [
    {
      "name": "Emma Dixon",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366012",
      "orcid": "missing"
    },
    {
      "name": "Amanda Lazar",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    }
  ],
  "references": [
    {
      "text": "AARP. 2019. How Continuing Care Retirement Communities Work CCRCs aim to provide a continuum of care as a resident ages. Here's how to evaluate the choices. AARP Real Possibilities. Retrieved December 19, 2019 from https://www.aarp.org/caregiving/basics/info-2017/continuing-care-retirement-communities.html",
      "doi": ""
    },
    {
      "text": "Arlene J. Astell, Sarah K. Smith, Stephen Potter, and Emily Preston-Jones. 2018. Computer Interactive Reminiscence and Conversation Aid groups-Delivering cognitive stimulation with technology. Alzheimer's & Dementia?: Translational Research & Clinical Interventions 4: 481--487. https://doi.org/10.1016/j.trci.2018.08.003",
      "doi": ""
    },
    {
      "text": "Ronald M. Baecker, Karyn Moffatt, and Michael Massimi. 2012. Technologies for aging gracefully. interactions 19, 3: 32. https://doi.org/10.1145/2168931.2168940",
      "doi": ""
    },
    {
      "text": "Elina Baker, Jason Fee, Louise Bovingdon, Tina Campbell, Elaine Hewis, Danny Lewis, Lesley Mahoney, and Glenn Roberts. 2013. From taking to using medication: recovery-focused prescribing and medicines management. Advances in Psychiatric Treatment 19, 1: 2--10. https://doi.org/10.1192/apt.bp.110.008342",
      "doi": ""
    },
    {
      "text": "Clive Ballard, John O'Brien, Ian James, and Alan Swann. 2001. Dementia: Management of Behavioral and Psychological Symptoms. Oxford University Press, Oxford, England.",
      "doi": ""
    },
    {
      "text": "James C. Ballenger. 2000. Concepts of Alzheimer Disease: Biological, Clinical, and Cultural Perspectives. Johns Hopkins University Press, Baltimore & London.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '18, 161--173. https://doi.org/10.1145/3234695.3236348",
      "doi": ""
    },
    {
      "text": "Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 2014. Diversity for design: a framework for involving neurodiverse children in the technology design process. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 3747--3756. https://doi.org/10.1145/2556288.2557244",
      "doi": "10.1145/2556288.2557244"
    },
    {
      "text": "Betty S. Black, Deirdre Johnston, Peter V. Rabins, Ann Morrison, Constantine Lyketsos, and Quincy M. Samus. 2013. Unmet Needs of Community-Residing Persons with Dementia and Their Informal Caregivers: Findings from the Maximizing Independence at Home Study. Journal of the American Geriatrics Society 61, 12: 2087--2095. https://doi.org/10.1111/jgs.12549",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory: A practical guide through qualitative analysis. SAGE, London.",
      "doi": ""
    },
    {
      "text": "Jo Cheffey, Laura Hill, Glenn Roberts, and Ruth Marlow. 2013. Supporting self-management in early dementia: a contribution towards \"living well' Advances in Psychiatric Treatment 19, 5: 344--350. https://doi.org/10.1192/apt.bp.112.011023",
      "doi": ""
    },
    {
      "text": "Wei-Hsun Chen. 2009. MGuider: mobile guiding and tracking system in publictransit system for individuals with cognitive impairments. In Proceeding of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS '09, 271. https://doi.org/10.1145/1639642.1639711",
      "doi": ""
    },
    {
      "text": "Jinghui Cheng, Dorian Anderson, Cynthia Putnam, and Jin Guo. 2017. Leveraging Design Patterns to Support Designer-Therapist Collaboration When Ideating Brain Injury Therapy Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '17, 291--303. https://doi.org/10.1145/3116595.3116600",
      "doi": "10.1145/3116595.3116600"
    },
    {
      "text": "Sheung-Tak Cheng, Pizza K. Chow, You-Qiang Song, Edwin C.S. Yu, Alfred C.M. Chan, Tatia M.C. Lee, and John H.M. Lam. 2014. Mental and Physical Activities Delay Cognitive Decline in Older Persons with Dementia. The American Journal of Geriatric Psychiatry 22, 1: 63--74. https://doi.org/10.1016/j.jagp.2013.01.060",
      "doi": ""
    },
    {
      "text": "Dagoberto Cruz-Sandoval, Jesus Favela, and Eduardo B. Sandoval. 2018. Strategies to Facilitate the Acceptance of a Social Robot by People with Dementia. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction - HRI '18, 95--96. https://doi.org/10.1145/3173386.3177081",
      "doi": ""
    },
    {
      "text": "Dagoberto Cruz-Sandoval, Christian I. Penaloza, Jesús Favela, and Allan P. Castro-Coronel. 2018. Towards Social Robots that Support Exercise Therapies for Persons with Dementia. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers - UbiComp '18, 1729--1734. https://doi.org/10.1145/3267305.3267539",
      "doi": ""
    },
    {
      "text": "Nicholas Sheep Dalton. 2013. Neurodiversity & HCI. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, 2295--2304.",
      "doi": ""
    },
    {
      "text": "Emma Dixon. 2019. Understanding the Occupational Therapists Method to Inform the Design of Technologies for People with Dementia. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--6. https://doi.org/10.1145/3290607.3308453",
      "doi": "10.1145/3290607.3308453"
    },
    {
      "text": "Martin Donaldson. 2018. An assistive interface for people with dementia. In Proceedings of the Australasian Computer Science Week Multiconference on - ACSW '18, 1--5. https://doi.org/10.1145/3167918.3167935",
      "doi": "10.1145/3167918.3167935"
    },
    {
      "text": "Murna Downs, Linda Clare, and Jenny Mackenzie. 2006. Understandings of dementia: Explanatory models and their implications for the person with dementia and therapeutic effort. In Dementia: Mind Meaning, and the Person. Oxford University Press, 235--58. Retrieved August 31, 2019 from https://oxfordmedicine.com/view/10.1093/med/9780198566151.001.0001/med-9780198566151-chapter-015",
      "doi": ""
    },
    {
      "text": "Sherry L. Dupuis, Elaine Wiersma, and Lisa Loiselle. 2012. Pathologizing behavior: Meanings of behaviors in dementia care. Journal of Aging Studies 26, 2: 162--173. https://doi.org/10.1016/j.jaging.2011.12.001",
      "doi": ""
    },
    {
      "text": "George L. Engel. 1977. The Need for a New Medical Model: A Challenge for Biomedicine. Science 196, 4286: 129--136. https://doi.org/10.1126/science.847460",
      "doi": ""
    },
    {
      "text": "Shirin Enshaeifar, Ahmed Zoha, Andreas Markides, Severin Skillman, Sahr Thomas Acton, Tarek Elsaleh, Masoud Hassanpour, Alireza Ahrabian, Mark Kenny, Stuart Klein, Helen Rostill, Ramin Nilforooshan, and Payam Barnaghi. 2018. Health management and pattern analysis of daily living activities of people with dementia using in-home sensors and machine learning techniques. PLOS ONE 13, 5: 1--20. https://doi.org/10.1371/journal.pone.0195605",
      "doi": ""
    },
    {
      "text": "Angélique Faure-Delage, Alain Maxime Mouanga, Pascal M'belesso, André Tabo, Bébène Bandzouzi, Catherine-Marie Dubreuil, Pierre-Marie Preux, Jean-Pierre Clément, and Philippe Nubukpo. 2012. Socio-Cultural Perceptions and Representations of Dementia in Brazzaville, Republic of Congo: The EDAC Survey. Dementia and Geriatric Cognitive Disorders 2, 1: 84--96. https://doi.org/10.1159/000335626",
      "doi": ""
    },
    {
      "text": "Yuan Feng, Suihuai Yu, Dirk van de Mortel, Emilia Barakova, Matthias Rauterberg, and Jun Hu. 2018. Closer to Nature: Multi-sensory Engagement in Interactive Nature Experience for Seniors with Dementia. In Proceedings of the Sixth International Symposium of Chinese CHI on - ChineseCHI '18, 49--56. https://doi.org/10.1145/3202667.3202674",
      "doi": "10.1145/3202667.3202674"
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--13. https://doi.org/10.1145/3290605.3300634",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "Christopher Frauenberger. 2015. Disability and Technology: A Critical Realist Perspective. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility - ASSETS '15, 89--96. https://doi.org/10.1145/2700648.2809851",
      "doi": "10.1145/2700648.2809851"
    },
    {
      "text": "Daniel R. George. 2011. Intergenerational volunteering and quality of life: mixed methods evaluation of a randomized control trial involving persons with mild to moderate dementia. Quality of Life Research 20, 7: 987--995. https://doi.org/10.1007/s11136-010--9837--8",
      "doi": ""
    },
    {
      "text": "Nancy Harding and Colin Palfrey. 1997. The Social Construction of Dementia: Confused Professionals? Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Barbara J. Harmer and Martin Orrell. 2008. What is meaningful activity for people with dementia living in care homes? A comparison of the views of older people with dementia, staff and family carers. Aging & Mental Health 12, 5: 548--558. https://doi.org/10.1080/13607860802343019",
      "doi": ""
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--13. https://doi.org/10.1145/3173574.3174088",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "James Hodge, Kyle Montague, Sandra Hastings, and Kellie Morrissey. 2019. Exploring Media Capture of Meaningful Experiences to Support Families Living with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--14. https://doi.org/10.1145/3290605.3300653",
      "doi": "10.1145/3290605.3300653"
    },
    {
      "text": "Jesse Hoey, Krists Zutis, Valerie Leuty, and Alex Mihailidis. 2010. A tool to promote prolonged engagement in art therapy: design and development from arts therapist requirements. ASSETS '10: Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility: 8.",
      "doi": "10.1145/1878803.1878841"
    },
    {
      "text": "Julian C. Hughes. 2011. Thinking Through Dementia. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Marije Kanis, Saskia Robben, Judith Hagen, Anne Bimmerman, Natasja Wagelaar, and Ben Kröse. 2013. Sensor Monitoring in the Home: Giving Voice to Elderly People. In 7th International Conference on Pervasive Computing Technologies for Healthcare and Workshops, 4. https://doi.org/10.4108/icst.pervasivehealth.2013.252060",
      "doi": "10.4108/icst.pervasivehealth.2013.252060"
    },
    {
      "text": "Ayumi Kawakami, Koji Tsukada, Keisuke Kambara, and Itiro Siio. 2011. PotPet: pet-like flowerpot robot. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction - TEI '11, 263. https://doi.org/10.1145/1935701.1935755",
      "doi": "10.1145/1935701.1935755"
    },
    {
      "text": "Tom Kitwood. 1989. Brain, Mind, and Dementia: With Particular Reference to Alzheimer's Disease. Ageing and Society 9, 1: 1--15.",
      "doi": ""
    },
    {
      "text": "Tom Kitwood. 1990. The dialectics of dementia: with particular reference to Alzheimer's disease. Ageing and Society 19: 177--196.",
      "doi": ""
    },
    {
      "text": "Tom Kitwood. 1997. The experience of dementia. Aging & Mental Health 1, 1: 13--22. https://doi.org/10.1080/13607869757344",
      "doi": ""
    },
    {
      "text": "Peter Klein and Martina Uhlig. 2016. Interactive Memories: technology-aided reminiscence therapy for people with dementia. In Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments - PETRA '16, 1--2. https://doi.org/10.1145/2910674.2935838",
      "doi": "10.1145/2910674.2935838"
    },
    {
      "text": "Noriaki Kuwahara, Shinji Abe, Kiyoshi Yasuda, and Kazuhiro Kuwabara. 2006. Networked reminiscence therapy for individuals with dementia by using photo and video sharing. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility - Assets '06, 125. https://doi.org/10.1145/1168987.1169010",
      "doi": "10.1145/1168987.1169010"
    },
    {
      "text": "P. Lampinen, R.-L. Heikkinen, M. Kauppinen, and E. Heikkinen. 2006. Activity as a predictor of mental well-being among older adults. Aging & Mental Health 10, 5: 454--466. https://doi.org/10.1080/13607860600640962",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 2175--2188. https://doi.org/10.1145/3025453.3025522",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Jessica L. Feuston, Caroline Edasis, and Anne Marie Piper. 2018. Making as Expression: Informing Design with People with Complex Communication Needs through Art Therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--16. https://doi.org/10.1145/3173574.3173925",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Fong Yoke Leng, Donald Yeo, Stacey George, and Christopher Barr. 2014. Comparison of iPad applications with traditional activities using person-centred care approach: Impact on well-being for persons with dementia. Dementia 13, 2: 265--273. https://doi.org/10.1177/1471301213494514",
      "doi": ""
    },
    {
      "text": "Howard Litwin, Ella Schwartz, and Noam Damri. 2016. Cognitively Stimulating Leisure Activity and Subsequent Cognitive Function: A SHARE-based Analysis. The Gerontologist: gnw084. https://doi.org/10.1093/geront/gnw084",
      "doi": ""
    },
    {
      "text": "Galina Madjaroff and Helena Mentis. 2017. Narratives of Older Adults with Mild Cognitive Impairment and Their Caregivers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '17, 140--149. https://doi.org/10.1145/3132525.3132554",
      "doi": "10.1145/3132525.3132554"
    },
    {
      "text": "Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '10, 3. https://doi.org/10.1145/1878803.1878807",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Abraham Maslow. 1943. A Theory of Human Motivation. Psychological Review 50: 370--396.",
      "doi": ""
    },
    {
      "text": "Samantha McDonald, Niara Comrie, Erin Buehler, Nicholas Carter, Braxton Dubin, Karen Gordes, Sandy McCombe-Waller, and Amy Hurst. 2016. Uncovering Challenges and Opportunities for 3D Printing Assistive Technology with Physical Therapists. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16, 131--139. https://doi.org/10.1145/2982142.2982162",
      "doi": "10.1145/2982142.2982162"
    },
    {
      "text": "Roisin McNaney, Cara Wilson, Jayne Wallace, Margot Brereton, Abi Roper, Stephanie Wilson, and Miriam Sturdee. 2018. Giving a voice through design: adapting design methods to enhance the participation of people with communication difficulties. In Proceedings of the 15th Participatory Design Conference on Short Papers, Situated Actions, Workshops and Tutorial - PDC '18, 1--3. https://doi.org/10.1145/3210604.3210648",
      "doi": "10.1145/3210604.3210648"
    },
    {
      "text": "Ruth Melhuish, Catherine Beuzeboc, and Azucena Guzmán. 2017. Developing relationships between care staff and people with dementia through Music Therapy and Dance Movement Therapy: A preliminary phenomenological study. Dementia 16, 3: 282--296. https://doi.org/10.1177/1471301215588030",
      "doi": ""
    },
    {
      "text": "Argyro Moraiti, Vero Vanden Abeele, Erwin Vanroye, and Luc Geurts. 2015. Empowering Occupational Therapists with a DIY-toolkit for Smart Soft Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14, 387--394. https://doi.org/10.1145/2677199.2680598",
      "doi": "10.1145/2677199.2680598"
    },
    {
      "text": "Wendy Moyle, Cindy Jones, Jenny Murfield, Luckman Thalib, Elizabeth Beattie, David Shum, Siobhan O'Dwyer, Cindy Mervin, and Brian Draper. 2018. Effect of a robotic seal on the motor activity and sleep patterns of older people with dementia, as measured by wearable technology: A cluster-randomised controlled trial. Maturitas 11: 10--17. https://doi.org/10.1016/j.maturitas.2018.01.007",
      "doi": ""
    },
    {
      "text": "Claudia Müller, Lin Wan, and Dalibor Hrg. 2010. Dealing with wandering: a case study on caregivers' attitudes towards privacy and autonomy when reflecting the use of LBS. In Proceedings of the 16th ACM international conference on Supporting group work - GROUP '10, 75. https://doi.org/10.1145/1880071.1880082",
      "doi": "10.1145/1880071.1880082"
    },
    {
      "text": "NBernal. 2014. Types of Care. Care Conversations. Retrieved December 19, 2019 from https://careconversations.org/types-care",
      "doi": ""
    },
    {
      "text": "Joy Ng and Haixun Kong. 2016. Not All Who Wander Are Lost: Smart Tracker for People with Dementia. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16, 2241--2248. https://doi.org/10.1145/2851581.2892499",
      "doi": "10.1145/2851581.2892499"
    },
    {
      "text": "Karine Pérès, Catherine Helmer, Hélène Amieva, Jean-Marc Orgogozo, Isabelle Rouch, Jean-François Dartigues, and Pascale Barberger-Gateau. 2008. Natural History of Decline in Instrumental Activities of Daily Living Performance over the 10 Years Preceding the Clinical Diagnosis of Dementia: A Prospective Population-Based Study. Journal of the American Geriatrics Society 56, 1: 37--44. https://doi.org/10.1111/j.1532--5415.2007.01499.x",
      "doi": ""
    },
    {
      "text": "Giulia Perugia, Marta Díaz Boladeras, Emilia Barakova, Andreu Català Mallofré, and Matthias Rauterberg. 2017. Social HRI for People with Dementia: One Size Fits All? In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction - HRI '17, 257--258. https://doi.org/10.1145/3029798.3038353",
      "doi": "10.1145/3029798.3038353"
    },
    {
      "text": "Alison Phinney. 2006. Family Strategies for Supporting Involvement in Meaningful Activity by Persons With Dementia. Journal of Family Nursing 12, 1: 80--101. https://doi.org/10.1177/1074840705285382",
      "doi": ""
    },
    {
      "text": "Stephen G. Post. 2000. The Moral Challenge of Alzheimer Disease: Ethical Issues from Diagnosis to Dying. The John Hopkins University Press, Baltimore & London.",
      "doi": ""
    },
    {
      "text": "Philippa Riley. 2007. How can technology support musical creativity for people with dementia? In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition - C&C '07, 296. https://doi.org/10.1145/1254960.1255032",
      "doi": "10.1145/1254960.1255032"
    },
    {
      "text": "Pamela Roach and Neil Drummond. 2014. 'It's nice to have something to do': early-onset dementia and maintaining purposeful activity. Journal of Psychiatric and Mental Health Nursing 21, 10: 889--895. https://doi.org/10.1111/jpm.12154",
      "doi": ""
    },
    {
      "text": "Andrea S. Schreiner, Eiko Yamamoto, and Hisako Shiotani. 2005. Positive affect among nursing home residents with Alzheimer's dementia: The effect of recreational activity. Aging & Mental Health 9, 2: 129--134. https://doi.org/10.1080/13607860412331336841",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Cynthia L. Bennett, Wanda Pratt, and Jacob O. Wobbrock. 2018. Tenets for Social Accessibility: Towards Humanizing Disabled People in Design. ACM Transactions on Accessible Computing 11, 1: 1--31. https://doi.org/10.1145/3178855",
      "doi": "10.1145/3178855"
    },
    {
      "text": "Panote Siriaraya and Chee Siang Ang. 2014. Recreating living experiences from past memories through virtual worlds for people with dementia. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 3977--3986. https://doi.org/10.1145/2556288.2557035",
      "doi": "10.1145/2556288.2557035"
    },
    {
      "text": "Sarah Kate Smith and Gail A. Mountain. 2012. New forms of information and communication technology (ICT) and the potential to facilitate social and leisure activity for people living with dementia. International Journal of Computers in Healthcare 1, 4: 332. https://doi.org/10.1504/IJCIH.2012.051810",
      "doi": "10.1504/IJCIH.2012.051810"
    },
    {
      "text": "Rainulf A. Stelzmann, Norman H. Schnitzlein, and Reed F. Murtagh. 1995. An english translation of alzheimer's 1907 paper, Uber eine eigenartige erkankung der hirnrinde? Clinical Anatomy 8, 6: 429--431. https://doi.org/10.1002/ca.980080612",
      "doi": ""
    },
    {
      "text": "Kate Swaffer. 2018. Rethinking Dementia Care: #BanBPSD. Retrieved December 12, 2019 from https://kateswaffer.com/2018/08/13/rethinking-dementia-care-banbpsd/",
      "doi": ""
    },
    {
      "text": "Victoria Tam, Mirko Gelsomini, and Franca Garzotto. 2017. Polipo: a Tangible Toy for Children with Neurodevelopmental Disorders. In Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '17, 11--20. https://doi.org/10.1145/3024969.3025006",
      "doi": "10.1145/3024969.3025006"
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 3441. https://doi.org/10.1145/2470654.2466473",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling Self, Intimacy and a Sense of Home in Dementia: An Enquiry into Design in a Hospital Setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2629--2638. https://doi.org/10.1145/2207676.2208654",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Peter C Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In Proceedings of the 2013 CHI Conference on Human Factors in Computing Systems - CHI '13, 10.",
      "doi": ""
    },
    {
      "text": "Lin Wan, Claudia Müller, Dave Randall, and Volker Wulf. 2016. Design of A GPS Monitoring System for Dementia Care and its Challenges in Academia-Industry Project. ACM Transactions on Computer-Human Interaction 23, 5: 1--36. https://doi.org/10.1145/2963095",
      "doi": "10.1145/2963095"
    },
    {
      "text": "Lin Wan, Claudia Müller, Volker Wulf, and David William Randall. 2014. Addressing the subtleties in dementia care: pre-study & evaluation of a GPS monitoring system. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 3987--3996. https://doi.org/10.1145/2556288.2557307",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "Daniel Welsh, Kellie Morrissey, Sarah Foley, Roisin McNaney, Christos Salis, John McCarthy, and John Vines. 2018. Ticket to Talk: Supporting Conversation between Young People and People with Dementia through Digital Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--14. https://doi.org/10.1145/3173574.3173949",
      "doi": "10.1145/3173574.3173949"
    },
    {
      "text": "Bree J. Westphal, Hyowon Lee, Ngai-Man Cheung, Chor Guan Teo, and Wei Kiat Leong. 2017. Experience of designing and deploying a tablet game for people with dementia. In Proceedings of the 29th Australian Conference on Computer-Human Interaction - OZCHI '17, 31--40. https://doi.org/10.1145/3152771.3152775",
      "doi": "10.1145/3152771.3152775"
    },
    {
      "text": "Joe Wherton and Andrew Monk. 2009. Choosing the right knob. In Proceedings of the 27th international conference extended abstracts on Human factors in computing systems - CHI EA '09, 3631. https://doi.org/10.1145/1520340.1520546",
      "doi": "10.1145/1520340.1520546"
    },
    {
      "text": "Dennis Wolf, Daniel Besserer, Karolina Sejunaite, Matthias Riepe, and Enrico Rukzio. 2018. cARe: An Augmented Reality Support System for Dementia Patients. Poster Session: 3.",
      "doi": ""
    },
    {
      "text": "Nancy Yuhas, Barbara McGowan, Tom Fontaine, Jerry Czech, and Joyce Gambrell-Jones. 2006. Psychosocial Interventions for Disruptive Symptoms of Dementia. Journal of Psychosocial Nursing 4, 11: 34--42.",
      "doi": ""
    }
  ]
}