{
  "doi": "10.1145/3313831.3376583",
  "title": "Awareness, Navigation, and Use of Feed Control Settings Online",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Control settings are abundant and have significant effects on user experiences. One example of an impactful but understudied area is feed settings. In this study, we investigated awareness, navigation, and use of feed settings. We began by creating a taxonomy of feed settings on social media and search sites. Via an online survey, we measured awareness of Facebook feed settings. An in-person interview study then investigated how people navigated to and chose to set feed settings on their own feeds. We discovered that many participants did not believe ad personalization feed settings existed. Furthermore, we discovered a misalignment in the expectation and the function of settings, especially of ad personalization settings for many participants. Despite all participants struggling to find at least one setting, participants overall wanted to use settings: 94% altered at least one setting they encountered. From these results, we discuss implications and suggest design guidelines for settings.",
  "authors": [
    {
      "name": "Silas Hsu",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527389",
      "orcid": "missing"
    },
    {
      "name": "Kristen Vaccaro",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699068",
      "orcid": "0000-0002-9843-942X"
    },
    {
      "name": "Yin Yue",
      "institution": "University of Illinois at Urbana-Champaign, Champaign, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529643",
      "orcid": "missing"
    },
    {
      "name": "Aimee Rickman",
      "institution": "California State University, Fresno, Fresno, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699050",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for Privacy and Security: Understanding and Assisting Users's Choices Online. ACM Comput. Surv. 50, 3 (Aug. 2017), 44:1--44:41.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Alessandro Acquisti and Ralph Gross. 2006. Imagined Communities: Awareness, Information Sharing, and Privacy on the Facebook. In Privacy Enhancing Technologies, George Danezis and Philippe Golle (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 36--58.",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Alessandro Acquisti, Leslie K John, and George Loewenstein. 2012. The impact of relative standards on the propensity to disclose. Journal of Marketing Research 49, 2 (2012), 160--174.",
      "doi": ""
    },
    {
      "text": "Oscar Alvarado, Vero Vanden Abeele, David Geerts, and Katrien Verbert. 2019. ?I really don't know what 'thumbs up' means\": Algorithmic Experience in Movie Recommender Algorithms. In Human-Computer Interaction -- INTERACT 2019, David Lamas, Fernando Loizides, Lennart Nacke, Helen Petrie, Marco Winckler, and Panayiotis Zaphiris (Eds.). Springer International Publishing, Cham, Switzerland, 521--541.",
      "doi": ""
    },
    {
      "text": "Oscar Alvarado and Annika Waern. 2018. Towards Algorithmic Experience: Initial Efforts for Social Media Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 286, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173860",
      "doi": "10.1145/3173574.3173860"
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 3, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Michael L. Bernard. 2003. Examining User Expectations for the Location of Common E-Commerce Web Objects. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 47, 11 (2003), 1356--1360. DOI: http://dx.doi.org/10.1177/154193120304701108",
      "doi": ""
    },
    {
      "text": "Rahul Bhargava, Anna Chung, S Gaikwad, Alexis Hope, Dennis Jen, Jasmin Rubinovitz, Belen Saldias-Fuentes, and Ethan Zuckerman. 2019. Gobo. (2019). Retrieved 29 August 2019 from https://www.media.mit.edu/projects/gobo/overview/.",
      "doi": ""
    },
    {
      "text": "Robert M Bond, Christopher J Fariss, Jason J Jones, Adam DI Kramer, Cameron Marlow, Jaime E Settle, and James H Fowler. 2012. A 61-million-person experiment in social infuence and political mobilization. Nature 489, 7415 (2012), 295.",
      "doi": ""
    },
    {
      "text": "Sabri Boughorbel, Fethi Jarray, and Mohammed El-Anbari. 2017. Optimal classifier for imbalanced data using Matthews Correlation Coeffcient metric. PLOS One 12, 6 (June 2017), 1--17. DOI: http://dx.doi.org/10.1371/journal.pone.0177678",
      "doi": ""
    },
    {
      "text": "Jenna Burrell, Zoe Kahn, Anne Jonas, and Daniel Griffn. 2019. When Users Control the Algorithms: Values Expressed in Practices on Twitter. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article Article 138 (Nov. 2019), 20 pages. DOI: http://dx.doi.org/10.1145/3359240",
      "doi": "10.1145/3359240"
    },
    {
      "text": "Ratan Dey, Zubin Jelveh, and Keith Ross. 2012. Facebook users have become much more private: A large-scale study. In 2012 IEEE International Conference on Pervasive Computing and Communications Workshops. IEEE, 346--352.",
      "doi": ""
    },
    {
      "text": "Nikhil Dhingra, Zach Gorn, Andrew Kener, and Jason Dana. 2012. The default pull: An experimental demonstration of subtle default effects on preferences. Judgment and Decision Making 7, 1 (2012), 69.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I \"Like\" It, then I Hide It: Folk Theories of Social Feeds. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2371--2382. DOI: http://dx.doi.org/10.1145/2858036.2858494",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Jacob Frantz. 2015. Updated Controls for News Feed. (2015). Retrieved 19 June 2019 from https://newsroom.fb.com/news/2015/07/updated-controlsfor-news-feed/.",
      "doi": ""
    },
    {
      "text": "C. Ailie Fraser, Tricia J. Ngoon, Mira Dontcheva, and Scott Klemmer. 2019. RePlay: Contextually Presenting Learning Videos Across Software Applications. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 297, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300527",
      "doi": "10.1145/3290605.3300527"
    },
    {
      "text": "Wai-Tat Fu and Peter Pirolli. 2007. SNIF-ACT: A Cognitive Model of User Navigation on the World Wide Web. Human-Computer Interaction 22, 4 (2007), 355--412. DOI: http://dx.doi.org/10.1080/07370020701638806",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Guilbert Gates. 2019. Facebook Privacy: A Bewildering Tangle of Options. (may 2019). Retrieved 8 September 2019 from https://archive.nytimes.com/www.nytimes.com/interactive/2010/ 05/12/business/facebook-privacy.html.",
      "doi": ""
    },
    {
      "text": "Gary Geissler, George Zinkhan, and Richard T Watson. 2001. Web home page complexity and communication effectiveness. Journal of the Association for Information Systems 2, 1 (2001), 2.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert. 2012. Predicting Tie Strength in a New Medium. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1047--1056. DOI: http://dx.doi.org/10.1145/2145204.2145360",
      "doi": "10.1145/2145204.2145360"
    },
    {
      "text": "Tovi Grossman, George Fitzmaurice, and Ramtin Attar. 2009. A Survey of Software Learnability: Metrics, Methodologies and Guidelines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 649--658. DOI: http://dx.doi.org/10.1145/1518701.1518803",
      "doi": "10.1145/1518701.1518803"
    },
    {
      "text": "Silvia Heinz, Sebastian Linxen, Alexandre N Tuch, Lars Fraßeck, and Klaus Opwis. 2017. Is It Still Where I Expect It-Users' Current Expectations of Interface Elements on the Most Frequent Types of Websites. Interacting with Computers 29, 3 (2017), 325--344.",
      "doi": ""
    },
    {
      "text": "David Ingram and Chris Kahn. 2018. Three-quarters Facebook users as active or more since privacy scandal: Reuters/Ipsos poll. (May 2018). Retrieved 14 June 2019 from https://www.reuters.com/article/us-facebookprivacy-poll/three-quarters-facebook-users-asactive-or-more-since-privacy-scandal-reuters-ipsospoll-idUSKBN1I7081.",
      "doi": ""
    },
    {
      "text": "Jennifer King, Airi Lampinen, and Alex Smolen. 2011. Privacy: Is There an App for That?. In Proceedings of the Seventh Symposium on Usable Privacy and Security (SOUPS '11). ACM, NY, NY, USA, Article 12, 20 pages. DOI: http://dx.doi.org/10.1145/2078827.2078843",
      "doi": "10.1145/2078827.2078843"
    },
    {
      "text": "René F. Kizilcec. 2016. How Much Information?: Effects of Transparency on Trust in an Algorithmic Interface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2390--2395. DOI: http://dx.doi.org/10.1145/2858036.2858402",
      "doi": "10.1145/2858036.2858402"
    },
    {
      "text": "Clayton Lewis and John Rieman. 1993. Task-centered user interface design. (1993).",
      "doi": ""
    },
    {
      "text": "Yabing Liu, Krishna P Gummadi, Balachander Krishnamurthy, and Alan Mislove. 2011. Analyzing Facebook Privacy Settings: User Expectations vs. Reality. In Proceedings of the 2011 ACM SIGCOMM Conference on Internet Measurement Conference. ACM, NY, NY, USA, 61--70.",
      "doi": "10.1145/2068816.2068823"
    },
    {
      "text": "Michelle Madejski, Maritza Johnson, and Steven M Bellovin. 2012. A study of privacy settings errors in an online social network. In Pervasive Computing and Communications Workshops (PERCOM Workshops), 2012 IEEE International Conference on. IEEE, 340--345.",
      "doi": ""
    },
    {
      "text": "Alessandra Mazzia, Kristen LeFevre, and Eytan Adar. 2012. The PViz Comprehension Tool for Social Network Privacy Settings. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, NY, NY, USA, Article 13, 12 pages. DOI: http://dx.doi.org/10.1145/2335356.2335374",
      "doi": "10.1145/2335356.2335374"
    },
    {
      "text": "William Melicher, Mahmood Sharif, Joshua Tan, Lujo Bauer, Mihai Christodorescu, and Pedro Giovanni Leon. 2016. (Do Not) Track me sometimes: users' contextual preferences for web tracking. Proceedings on Privacy Enhancing Technologies 2016, 2 (2016), 135--154.",
      "doi": ""
    },
    {
      "text": "Bertrand Meyer. 1992. Applying 'design by contract'. Computer 25, 10 (Oct 1992), 40--51. DOI: http://dx.doi.org/10.1109/2.161279",
      "doi": "10.1109/2.161279"
    },
    {
      "text": "Randall J Mumaw, Emilie M Roth, Kim J Vicente, and Catherine M Burns. 2000. There is more to monitoring a nuclear power plant than meets the eye. Human factors 42, 1 (2000), 36--55.",
      "doi": ""
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Justin W. Owens, Evan M. Palmer, and Barbara S. Chaparro. 2014. The Pervasiveness of Text Advertising Blindness. J. Usability Studies 9, 2 (Feb. 2014), 51--69. http://dl.acm.org/citation.cfm?id=2817709.2817711",
      "doi": ""
    },
    {
      "text": "Peter Pirolli. 2007. Information foraging theory: Adaptive interaction with information. Oxford University Press, New York, NY, USA.",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Raquel O. Prates, Mary Beth Rosson, and Clarisse S. de Souza. 2015. Interaction Anticipation: Communicating Impacts of Groupware Confguration Settings to Users. In End-User Development, Paloma Díaz, Volkmar Pipek, Carmelo Ardito, Carlos Jensen, Ignacio Aedo, and Alexander Boden (Eds.). Springer International Publishing, Cham, Switzerland, 192--197.",
      "doi": ""
    },
    {
      "text": "Jef Raskin. 2000. The humane interface: new directions for designing interactive systems. Addison-Wesley Professional, New York, NY, USA, Chapter 3.2 Modes, 37--58.",
      "doi": "10.5555/333103"
    },
    {
      "text": "Eric Ravenscraft. 2019. Facebook's Notifcations Are Out of Control. Here's How to Tame Them. (May 2019). Retrieved 19 June 2019 from https://www.nytimes.com/2019/05/30/smarter-living/stop-facebook-notifications.html.",
      "doi": ""
    },
    {
      "text": "Sandra P Roth, Peter Schmutz, Stefan L Pauwels, Javier A Bargas-Avila, and Klaus Opwis. 2010. Mental models for web objects: Where do users expect to find the most frequent objects in online shops, news portals, and company web pages? Interacting with Computers 22, 2 (2010), 140--152.",
      "doi": "10.1016/j.intcom.2009.10.004"
    },
    {
      "text": "Sandra P Roth, Alexandre N Tuch, Elisa D Mekler, Javier A Bargas-Avila, and Klaus Opwis. 2013. Location matters, especially for non-salient features--An eye-tracking study on the effects of web object placement on different types of websites. International journal of human-computer studies 71, 3 (2013), 228--235.",
      "doi": "10.1016/j.ijhcs.2012.09.001"
    },
    {
      "text": "Luis Santa-Maria and Mary C. Dyson. 2008. The Effect of Violating Visual Conventions of a Website on User Performance and Disorientation: How Bad Can It Be?. In Proceedings of the 26th Annual ACM International Conference on Design of Communication (SIGDOC '08). ACM, NY, NY, USA, 47--54. DOI: http://dx.doi.org/10.1145/1456536.1456547",
      "doi": ""
    },
    {
      "text": "Ramya Sethuraman, Jordi Vallmitjana, and Jon Levin. 2019. Using Surveys to Make News Feed More Personal. (May 2019). Retrieved 13 September 2019 from https://newsroom.fb.com/news/2019/05/morepersonalized-experiences/.",
      "doi": ""
    },
    {
      "text": "Rajiv C Shah and Christian Sandvig. 2008. Software defaults as de facto regulation the case of the wireless Internet. Information, Community & Society 11, 1 (2008), 25--46.",
      "doi": ""
    },
    {
      "text": "Lance Sherry, Peter Polson, and Michael Feary. 2002. Designing user-interfaces for the cockpit: Five common design errors and how to avoid them. SAE Technical Paper 2002-01--2968. (Nov 2002). DOI: http://dx.doi.org/10.4271/2002-01--2968",
      "doi": ""
    },
    {
      "text": "Aaron Smith and Monica Anderson. 2018. Social Media Use in 2018. (March 2018). https://www.pewresearch.org/internet/wp-content/uploads/sites/9/2018/02/PI_2018.03.01_Social-Media_FINAL.pdf.",
      "doi": ""
    },
    {
      "text": "Jared M Spool, Christine Perfetti, and David Brittan. 2004. Designing for the scent of information. User Interface Engineering, Middleton, MA.",
      "doi": ""
    },
    {
      "text": "Tziporah Stern and Nanda Kumar. 2014. Improving privacy settings control in online social networks with a wheel interface. Journal of the Association for Information Science and Technology 65, 3 (Jan. 2014), 524--538.",
      "doi": "10.1002/asi.22994"
    },
    {
      "text": "Frederic D Stutzman, Ralph Gross, and Alessandro Acquisti. 2013. Silent listeners: The evolution of privacy and disclosure on facebook. Journal of privacy and confidentiality 4, 2 (2013), 2.",
      "doi": ""
    },
    {
      "text": "Kristen Vaccaro, Dylan Huang, Motahhare Eslami, Christian Sandvig, Kevin Hamilton, and Karrie Karahalios. 2018. The Illusion of Control: Placebo Effects of Control Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 16:1--16:13.",
      "doi": ""
    },
    {
      "text": "Kami Vaniea, Lujo Bauer, Lorrie Faith Cranor, and Michael K Reiter. 2012. Out of sight, out of mind: Effects of displaying access-control information near the item it controls. In 2012 Tenth Annual International Conference on Privacy, Security and Trust. IEEE, 128--136. DOI: http://dx.doi.org/10.1109/PST.2012.6297929",
      "doi": "10.1109/PST.2012.6297929"
    },
    {
      "text": "Na Wang, Heng Xu, and Jens Grossklags. 2011. Third-party Apps on Facebook: Privacy and the Illusion of Control. In Proceedings of the 5th ACM Symposium on Computer Human Interaction for Management of Information Technology (CHIMIT '11). ACM, NY, NY, USA, Article 4, 10 pages. DOI: http://dx.doi.org/10.1145/2076444.2076448",
      "doi": "10.1145/2076444.2076448"
    },
    {
      "text": "Qiuzhen Wang, Sa Yang, Manlu Liu, Zike Cao, and Qingguo Ma. 2014. An eye-tracking study of website complexity from cognitive load perspective. Decision support systems 62 (2014), 1--10.",
      "doi": ""
    },
    {
      "text": "Sam Wineburg, Sarah McGrew, Joel Breakstone, and Teresa Ortega. 2016. Evaluating information: The cornerstone of civic online reasoning. Stanford Digital Repository (2016). Available at http://purl.stanford.edu/fv751yt5934.",
      "doi": ""
    },
    {
      "text": "Pamela J Wisniewski, Bart P Knijnenburg, and Heather Richter Lipford. 2017. Making privacy personal: Profiling social network users to inform privacy education and nudging. International journal of human-computer studies 98 (2017), 95--108.",
      "doi": "10.1016/j.ijhcs.2016.09.006"
    }
  ]
}