{
  "doi": "10.1145/3313831.3376344",
  "title": "Parenting with Alexa: Exploring the Introduction of Smart Speakers on Family Dynamics",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Smart speakers have become pervasive in family homes, creating the potential for these devices to influence parent-child dynamics and parenting behaviors. We investigate the impact of introducing a smart speaker to 10 families with children, over four weeks. We use pre- and post- deployment interviews with the whole family and in-home audio capture of parent-child interactions with the smart speaker for our analysis. Despite the smart speaker causing occasional conflict in the home, we observed that parents lever-aged the smart speaker to further parenting goals. We found three forms of influence the smart speaker has on family dynamics: 1) fostering communication, 2) disrupting access, and 3) augmenting parenting. All of these influences arise from a communally accessible, stand-alone voice interface which democratizes family access to technology. We discuss design implications in furthering parenting practices and behaviors as the capabilities of the technology continue to improve.",
  "authors": [
    {
      "name": "Erin Beneteau",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365459",
      "orcid": "missing"
    },
    {
      "name": "Ashley Boone",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526804",
      "orcid": "0000-0001-5349-8920"
    },
    {
      "name": "Yuxing Wu",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528667",
      "orcid": "missing"
    },
    {
      "name": "Julie A. Kientz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548025762/rel-imgonly/kientz-headshot-small.png",
      "acmid": "81548025762",
      "orcid": "missing"
    },
    {
      "name": "Jason Yip",
      "institution": "University of Washinton, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    }
  ],
  "references": [
    {
      "text": "James Ball. 2018. 'Alexa -- can you teach my kids some manners, please?' The Guardian. Retrieved July 28, 2019 from https://www.theguardian.com/technology/shortcuts/2018/sep/19/alexa-virtual-assistantmanners-and-etiquette",
      "doi": ""
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as Learning Partners in the Development of Technological Fluency. International Journal of Learning and Media 1, 2(May,2009),55--77. DOI: https://doi.org/10.1162/ijlm.2009.0021",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K. Richards, Mingrui Zhang, Julie A. Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), ACM, NY, NY, USA, 243:1--243:13. DOI: https://doi.org/10.1145/3290605.3300473",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottrjdge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies2,3(September,2018),1--24. DOI: https://doi.org/10.1145/3264901",
      "doi": "10.1145/3264901"
    },
    {
      "text": "R.T. Bower. 1973. Television and the Public. Holt, Rinehart, and Winston, New York, New York, USA.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology3,2(April,2006),77--101. DOI: https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Antony Bryant and Kathy Charmaz. 2007. The SAGE handbook of grounded theory. London?: SAGE Publications, London.",
      "doi": ""
    },
    {
      "text": "John L. Campbell, Charles Quincy, Jordan Osserman, and Ove K. Pedersen. 2013. Coding In-depth Semistructured Interviews: Problems of Unitization and Intercoder Reliability and Agreement. Sociological Methods & Research 42, 3 (August 2013), 294--320. DOI: https://doi.org/10.1177/0049124113500475",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory (Second edition ed.). SAGE Publications Ltd, London?; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Ying-Yu Chen, Ziyue Li, Daniela Rosner, and Alexis Hiniker. 2019. Understanding Parents' Perspectives on Mealtime Technology. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1 (March 2019), 5:1--5:19. DOI: https://doi.org/10.1145/3314392",
      "doi": "10.1145/3359282"
    },
    {
      "text": "Yi Cheng, Kate Yen, Yeqi Chen, Sijin Chen, and Alexis Hiniker. 2018. Why Doesn'T It Work?: Voicedriven Interfaces and Young Children's Communication Repair Strategies. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), ACM, NY, NY, USA, 337--348. DOI: https://doi.org/10.1145/3202185.3202749",
      "doi": "10.1145/3202185.3202749"
    },
    {
      "text": "Lynn Schofield Clark. 2011. Parental Mediation Theory for the Digital Age. Communication Theory 21, 4 (October,2011),323--343. DOI: https://doi.org/10.1111/j.14682885.2011.01391.x",
      "doi": ""
    },
    {
      "text": "Charles R. Corder-Bolz. 1980. Mediation: The Role of Significant Others. Journal of Communication 30, 3 (1980), 106--118. DOI: https://doi.org/10.1111/j.14602466.1980.tb01997.x",
      "doi": ""
    },
    {
      "text": "Michaeleen Doucleff and Allison Aubrey. 2017. Alexa, Are You Safe For My Kids? NPR.org. Retrieved July 28, 2019 from https://www.npr.org/sections/health-shots/2017/10/30/559863326/alexa-areyou-safe-for-my-kids",
      "doi": ""
    },
    {
      "text": "Ronald S. Drabman and Greg Jarvie. 1977. Counseling Parents of Children With Behavior Problems: The Use of Extinction and Time-Out Techniques. Pediatrics 59, 1 (January 1977), 78--85.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. ?Hey Google is It OK if I Eat You?\": Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17), ACM, New York,NY,USA,595--600. DOI: https://doi.org/10.1145/3078072.3084330",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Shalom M. Fisch, Anna Akerman, Melissa Morgenlander, Susan K. McCann Brown, Susan R. D. Fisch, Bena B. Schwartz, and Pat Tobin. 2008. Coviewing Preschool Television in the US. Journal of Children and Media 2, 2 (July 2008), 163--173. DOI: https://doi.org/10.1080/17482790802078680",
      "doi": ""
    },
    {
      "text": "Elisabeth Gee, Lori Takeuchi, and Ellen Wartella (Eds.). 2017. Children and Families in the Digital Age: Learning Together in a Media Saturated Culture (1 edition ed.). Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser. 2005. The Grounded Theory Perspective III: Theoretical Coding. Sociology Pr.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser and Anselm L. Strauss. 2006. The discovery of grounded theory: strategies for qualitative research. Aldine Transaction a division of Transaction Publishers, New Brunswick, N.J.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Jon E. Froehlich, Mingrui Zhang, and Erin Beneteau. 2019. Anchored Audio Sampling: A Seamless Method for Exploring Children's Thoughts During Deployment Studies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, ACM Press, Glasgow, Scotland,UK,1--13. DOI: https://doi.org/10.1145/3290605.3300238",
      "doi": "10.1145/3290605.3300238"
    },
    {
      "text": "Alexis Hiniker, Sharon S. Heung, Sungsoo (Ray) Hong, and Julie A. Kientz. 2018. Coco's Videos: An Empirical Investigation of Video-Player Design Features and Children's Media Use. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), ACM, NY, NY, USA, 254:1--254:13. DOI: https://doi.org/10.1145/3173574.3173828",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Hyewon Suh, Sabina Cao, and Julie A. Kientz. 2016. Screen Time Tantrums: How Families Manage Screen Media Experiences for Toddlers and Preschoolers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, Santa Clara, California, USA, 648-- 660. DOI: https://doi.org/10.1145/2858036.2858278",
      "doi": ""
    },
    {
      "text": "Hee Jhee Jiow, Sun Sun Lim, and Julian Lin. 2017. Level Up! Refreshing Parental Mediation Theory for Our Digital Media Landscape: Parental Mediation of Video Gaming. Commun Theor 27, 3 (August 2017), 309--328. DOI: https://doi.org/10.1111/comt.12109",
      "doi": ""
    },
    {
      "text": "Zoe Kleinman. 2018. Alexa, are you friends with our kids? BBC News. Retrieved September 16, 2019 from https://www.bbc.com/news/technology-44847184",
      "doi": ""
    },
    {
      "text": "Irene Lopatovska, Katrina Rink, Ian Knight, Kieran Raines, Kevin Cosenza, Harriet Williams, Perachya Sorsche, David Hirsch, Qi Li, and Adrianna Martinez. 2018. Talk to me: Exploring user interactions with the Amazon Alexa. Journal of Librarianship and Information Science (March 2018), 0961000618759414. DOI: https://doi.org/10.1177/0961000618759414",
      "doi": ""
    },
    {
      "text": "Silvia B. Lovato, Anne Marie Piper, and Ellen A. Wartella. 2019. Hey Google, Do Unicorns Exist?: Conversational Agents As a Path to Answers to Children's Questions. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19), ACM, NY, NY, USA, 301--313. DOI: https://doi.org/10.1145/3311927.3323150",
      "doi": ""
    },
    {
      "text": "Gail C. McCain. 1982. Parent created tape recordings for hospitalized children. Children's Health Care 10, 3(January1982),104--105. DOI: https://doi.org/10.1080/02739615.1982.1038306",
      "doi": ""
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys That Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), ACM, NY, NY, USA, 5197--5207. DOI: https://doi.org/10.1145/3025453.3025735",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Luiza Superti Pantoja, Kyle Diederich, Liam Crawford, and Juan Pablo Hourcade. 2019. Voice Agents Supporting High-Quality Social Play. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19), ACM, New York,NY,USA,314--325. DOI: https://doi.org/10.1145/3311927.3323151",
      "doi": "10.1145/3311927.3323151"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), ACM, NY, NY, USA, 640:1--640:12. DOI: https://doi.org/10.1145/3173574.3174214",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, and Sarah Sharples. 2017. \"Do Animals Have Accents?\": Talking with Agents in Multi-Party Conversation. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), ACM, NY, NY, USA, 207--219. DOI: https://doi.org/10.1145/2998181.2998298",
      "doi": "10.1145/2998181.2998298"
    },
    {
      "text": "Marie Radford, Diana Floegel, Sarah Barriage, and Daniel Houli. 2019. \"Alexa, where do babies come from?\" Investigating children's practices with intelligent personal assistants. ALISE Conference Proceedings 2019, (September 2019). Retrieved September 4, 2019 from https://www.ideals.illinois.edu/handle/2142/105336",
      "doi": ""
    },
    {
      "text": "Hayes Raffle, Rafael Ballagas, Glenda Revelle, Hiroshi Horii, Sean Follmer, Janet Go, Emily Reardon, Koichi Mori, Joseph Kaye, and Mirjana Spasojevic. 2010. Family Story Play: Reading with Young Children (and Elmo) over a Distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), ACM, NY, NY, USA, 1583--1592. DOI: https://doi.org/10.1145/1753326.1753563",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Eric E Rasmussen, Autumn Shafer, Malinda J. Colwell, Shawna White, Narissra Punyanunt-Carter, Rebecca L. Densley, and Holly Wright. 2016. Relation between active mediation, exposure to Daniel Tiger's Neighborhood , and US preschoolers' social and emotional development. Journal of Children and Media (July,2016),1--19. DOI: https://doi.org/10.1080/17482798.2016.1203806",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What's Up?\": A MixedMethods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), ACM, NY, NY,USA,857--868. DOI: https://doi.org/10.1145/3196709.3196772",
      "doi": ""
    },
    {
      "text": "Sue Shellenbarger. 2018. Alexa: Don't Let My 2Year-Old Talk to You That Way. Wall Street Journal. Retrieved August 12, 2018 from https://www.wsj.com/articles/alexa-dont-let-my-2year-old-talk-to-you-that-way-1531229274",
      "doi": ""
    },
    {
      "text": "Wonsun Shin and Jisu Huh. 2011. Parental mediation of teenagers' video game playing: Antecedents and consequences. New Media & Society 13, 6 (September 2011),945--962. DOI: https://doi.org/10.1177/1461444810388025",
      "doi": ""
    },
    {
      "text": "Kiley Sobel, Arpita Bhattacharya, Alexis Hiniker, Jin Ha Lee, Julie A. Kientz, and Jason C. Yip. 2017. It wasn't really about the Pokémon. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, New York, NewYork,USA,1483--1496. DOI: https://doi.org/10.1145/3025453.3025761",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi and R Stevens. 2011. The new coviewing: Designing for learning through joint media engagement.",
      "doi": ""
    },
    {
      "text": "Fumihide Tanaka, Aaron Cicourel, and Javier R. Movellan. 2007. Socialization between toddlers and robots at an early childhood education center. Proc Natl Acad Sci USA 104, 46 (November 2007), 17954-- 17958. DOI: https://doi.org/10.1073/pnas.0707769104",
      "doi": ""
    },
    {
      "text": "Brenda K. Wiederhold. 2018. \"Alexa, Are You My Mom?\" The Role of Artificial Intelligence in Child Development. Cyberpsychology, Behavior, and Social Networking 21, 8 (August 2018), 471--472. DOI: https://doi.org/10.1089/cyber.2018.29120.bkw",
      "doi": ""
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2019. Young Children's Reading and Learning with Conversational Agents. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19), ACM, NY, NY, USA, CS10:1-- CS10:8. DOI: https://doi.org/10.1145/3290607.3299035",
      "doi": "10.1145/3290607.3299035"
    },
    {
      "text": "Svetlana Yarosh. 2008. Supporting long-distance parent-child interaction in divorced families. In Proceeding of the twenty-sixth annual CHI conference extended abstracts on Human factors in computing systems - CHI '08, ACM Press, Florence, Italy, 3795. DOI: https://doi.org/10.1145/1358628.1358932",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh and Gregory D. Abowd. 2011. Mediated parent-child contact in work-separated families. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, Vancouver, BC, Canada, 1185. DOI: https://doi.org/10.1145/1978942.1979120",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh, Sarita Schoenebeck, Shreya Kothaneth, and Elizabeth Bales. 2016. \"Best of Both Worlds\": Opportunities for Technology in Cross-Cultural Parenting. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, Santa Clara, California, USA, 635--647. DOI: https://doi.org/10.1145/2858036.2858210",
      "doi": "10.1145/2858036.2858210"
    },
    {
      "text": "Svetlana Yarosh, Anthony Tang, Sanika Mokashi, and Gregory D. Abowd. 2013. \"Almost touching\": parentchild remote communication using the sharetable system. In Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13, ACM Press, San Antonio, Texas, USA, 181. DOI: https://doi.org/10.1145/2441776.2441798",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and A. J. Bernheim Brush. 2018. Children Asking Questions: Speech Interface Reformulations and Personification Preferences. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), ACM, NY, NY, USA, 300--312. DOI: https://doi.org/10.1145/3202185.3202207",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "Bieke Zaman, Marije Nouwen, Jeroen Vanattenhoven, Evelien de Ferrerre, and Jan Van Looy. 2016. A Qualitative Inquiry into the Contextualized Parental Mediation Practices of Young Children's Digital Media Use at Home. Journal of Broadcasting & Electronic Media 60,1(January,2016),1--22. DOI: https://doi.org/10.1080/08838151.2015.1127240",
      "doi": ""
    }
  ]
}