{
  "doi": "10.1145/3313831.3376342",
  "title": "IoT Data in the Home: Observing Entanglements and Drawing New Encounters",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Internet of Things (IoT) technologies for the home are gaining in popularity, generating exponential data byproducts. Yet, everyday relationships between home dwellers and domestic IoT data often remain secondary interactions, preventing deeper understanding and awareness of data tracked in the home. Our paper offers a design ethnography and design inquiry which examine these human-data entanglements. Findings from working with 10 inhabitants who interact with their IoT data illustrate five characteristics of current data encounters: manifesting, inquiring, exposing, repositioning, and broadening. In response, we used speculative sketches to refine, refract and complicate these encounters. We argue that data do not have to be laborious, tidy or the byproduct of a service, but rather lively and affecting. We further suggest new modes of engagement with data which expand or step away from self-improvement and reflection: through diverse acts of noticing, by allowing data to remain invisible, and by embracing imaginative practices.",
  "tags": [
    "design ethnography",
    "data",
    "internet of things",
    "home",
    "research-through-design",
    "speculative"
  ],
  "authors": [
    {
      "name": "Audrey Desjardins",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656227",
      "orcid": "0000-0002-1980-1292"
    },
    {
      "name": "Heidi R. Biggs",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441708",
      "orcid": "0000-0001-9208-7921"
    },
    {
      "name": "Cayla Key",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-99659367153/rel-imgonly/profile_4.jpg",
      "acmid": "99659367153",
      "orcid": "missing"
    },
    {
      "name": "Jeremy E. Viny",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366412",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ryan Aipperspach, Ben Hooker, and Allison Woodruff. 2008. The Heterogeneous Home. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08), 222--231. https://doi.org/10.1145/1409635.1409666",
      "doi": "10.1145/1409635.1409666"
    },
    {
      "text": "Artefact. The Tarot Cards Of Tech. Retrieved September 19, 2019 from http://tarotcardsoftech.artefactgroup.com/",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2003. Posthumanist Performativity: Toward an Understanding of How Matter Comes to Matter. Signs: Journal of Women in Culture and Society 28, 3: 801--831. https://doi.org/10.1086/345321",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Amanda Lazar, and Norman Makoto Su. 2019. (Re-)Framing Menopause Experiences for HCI and Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 115:1--115:13. https://doi.org/10.1145/3290605.3300345",
      "doi": "10.1145/3290605.3300345"
    },
    {
      "text": "Jane Bennett. 2009. Vibrant Matter: A Political Ecology of Things. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Carole Cadwalladr and Emma Graham-Harrison. 2018. Revealed: 50 million Facebook profiles harvested for Cambridge Analytica in major data breach. The Guardian. Retrieved September 10, 2019 from https://www.theguardian.com/news/2018/mar/17/cambri dge-analytica-facebook-influence-us-election",
      "doi": ""
    },
    {
      "text": "Marshini Chetty, Ja-Young Sung, and Rebecca E. Grinter. 2007. How Smart Homes Learn: The Evolution of the Networked Home and Household. In UbiComp 2007: Ubiquitous Computing, John Krumm, Gregory D. Abowd, Aruna Seneviratne and Thomas Strang (eds.). Springer Berlin Heidelberg, 127--144. Retrieved February 14, 2014 from http://link.springer.com.proxy.lib.sfu.ca/chapter/10.1007 /978--3--540--74853--3_8",
      "doi": ""
    },
    {
      "text": "Marshini Chetty, David Tran, and Rebecca E. Grinter. 2008. Getting to Green: Understanding Resource Consumption in the Home. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08), 242--251. https://doi.org/10.1145/1409635.1409668",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, Shwetak N. Patel, and Julie A. Kientz. 2012. Investigating Receptiveness to Sensing and Inference in the Home Using Sensor Proxies. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 61--70. https://doi.org/10.1145/2370216.2370226",
      "doi": ""
    },
    {
      "text": "Juliet M. Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative Sociology 13, 1: 3--21. https://doi.org/10.1007/BF00988593",
      "doi": "10.1007/bf00988593"
    },
    {
      "text": "Kate Crawford, Jessa Lingel, and Tero Karppi. 2015. Our metrics, ourselves: A hundred years of self-tracking from the weight scale to the wrist wearable device. European Journal of Cultural Studies 18, 4--5: 479--496. https://doi.org/10.1177/1367549415584857",
      "doi": ""
    },
    {
      "text": "Dries De Roeck, Karin Slegers, Johan Criel, Marc Godon, Laurence Claeys, Katriina Kilpi, and An Jacobs. 2012. I Would DiYSE for It!: A Manifesto for Do-ityourself Internet-of-things Creation. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12), 170--179. https://doi.org/10.1145/2399016.2399044",
      "doi": "10.1145/2399016.2399044"
    },
    {
      "text": "Audrey Desjardins, Cayla Key, Heidi R. Biggs, and Kelsey Aschenbeck. 2019. Bespoke Booklets: A Method for Situated Co-Speculation. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 697--709. https://doi.org/10.1145/3322276.3322311",
      "doi": "10.1145/3322276.3322311"
    },
    {
      "text": "Audrey Desjardins and Timea Tihanyi. 2019. ListeningCups: A Case of Data Tactility and Data Stories. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 147--160. https://doi.org/10.1145/3322276.3323694",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Audrey Desjardins, Jeremy E. Viny, Cayla Key, and Nouela Johnston. 2019. Alternative Avenues for IoT: Designing with Non-Stereotypical Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--13. https://doi.org/10.1145/3290605.3300581",
      "doi": "10.1145/3290605.3300581"
    },
    {
      "text": "Paul Dourish. 2017. The Stuff of Bits: An Essay on the Materialities of Information. MIT Press.",
      "doi": "10.5555/3159007"
    },
    {
      "text": "Paul Dourish and Edgar Gómez Cruz. 2018. Datafication and data fiction: Narrating data and narrating with data. Big Data & Society 5, 2: 2053951718784083. https://doi.org/10.1177/2053951718784083",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Adam Clark Estes. Your Worst Alexa Nightmares Are Coming True. Gizmodo. Retrieved September 10, 2019 from https://gizmodo.com/your-worst-alexa-nightmaresare-coming-true-1826327301",
      "doi": ""
    },
    {
      "text": "Sarah Fox and Daniela K. Rosner. 2016. Continuing the Dialogue: Bringing Research Accounts Back into the Field. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1426-- 1430. https://doi.org/10.1145/2858036.2858054",
      "doi": "10.1145/2858036.2858054"
    },
    {
      "text": "Ester Fritsch, Irina Shklovski, and Rachel DouglasJones. 2018. Calling for a Revolution: An Analysis of IoT Manifestos. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 302:1--302:13. https://doi.org/10.1145/3173574.3173876",
      "doi": "10.1145/3173574.3173876"
    },
    {
      "text": "William Gaver. 2011. Making spaces: how design workbooks work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1551--1560. https://doi.org/10.1145/1978942.1979169",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "William Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. interactions 6, 1: 21--29. https://doi.org/10.1145/291224.291235",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William Gaver, Phoebe Sengers, Tobie Kerridge, Joseph Kaye, and John Bowers. 2007. Enhancing Ubiquitous Computing with User Interpretation: Field Testing the Home Health Horoscope. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 537--546. https://doi.org/10.1145/1240624.1240711",
      "doi": "10.1145/1240624.1240711"
    },
    {
      "text": "Rebecca E. Grinter, W. Keith Edwards, Mark W. Newman, and Nicolas Ducheneaut. 2005. The Work to Make a Home Network Work. In ECSCW 2005, Hans Gellersen, Kjeld Schmidt, Michel Beaudouin-Lafon and Wendy Mackay (eds.). Springer Netherlands, 469--488. Retrieved February 15, 2014 from http://link.springer.com.proxy.lib.sfu.ca/chapter/10.1007 /1--4020--4023--7_24",
      "doi": "10.5555/1242029.1242053"
    },
    {
      "text": "Byung-Chul Han. 2017. In the swarm: digital prospects. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Byung-Chul Han. 2018. Saving beauty. Polity Press, Cambridge, UK; Malden, MA.",
      "doi": ""
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. 2017. The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 675--687. https://doi.org/10.1145/3064663.3064759",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Trevor Hogan, Eva Hornecker, Simon Stusak, Yvonne Jansen, Jason Alexander, Andrew Vande Moere, Uta Hinrichs, and Kieran Nolan. 2016. Tangible Data, Explorations in Data Physicalization. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16), 753--756. https://doi.org/10.1145/2839462.2854112",
      "doi": "10.1145/2839462.2854112"
    },
    {
      "text": "Samuel Huron, Pauline Gourlet, Uta Hinrichs, Trevor Hogan, and Yvonne Jansen. 2017. Let's Get Physical: Promoting Data Physicalization in Workshop Formats. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 1409--1422. https://doi.org/10.1145/3064663.3064798",
      "doi": "10.1145/3064663.3064798"
    },
    {
      "text": "Karin Kappel and Thomas Grechenig. 2009. \"Showme\": Water Consumption at a Glance to Promote Water Conservation in the Shower. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive '09), 26:1--26:6. https://doi.org/10.1145/1541948.1541984",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "Vera Khovanskaya, Phoebe Sengers, Melissa Mazmanian, and Charles Darrah. 2017. Reworking the Gaps Between Design and Ethnography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5373--5385. https://doi.org/10.1145/3025453.3026051",
      "doi": "10.1145/3025453.3026051"
    },
    {
      "text": "Bruno Latour. 2007. Reassembling the Social: An Introduction to Actor-Network-Theory. Oxford University Press, Oxford; New York.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 480:1--480:16. https://doi.org/10.1145/3290605.3300710",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Yanni Alexander Loukissas. 2019. All Data Are Local: Thinking Critically in a Data-Driven Society. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2017. Feeling your data: Touch and making sense of personal digital data. New Media & Society 19, 10: 1599--1614. https://doi.org/10.1177/1461444817717515",
      "doi": ""
    },
    {
      "text": "Jimmy Moore, Pascal Goffin, Miriah Meyer, Philip Lundrigan, Neal Patwari, Katherine Sward, and Jason Wiese. 2018. Managing In-home Environments Through Sensing, Annotating, and Visualizing Air Quality Data. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3: 128:1--128:28. https://doi.org/10.1145/3264938",
      "doi": "10.1145/3264938"
    },
    {
      "text": "Dawn Nafus and Jamie Sherman. 2014. Big Data, Big Questions| This One Does Not Go Up To 11: The Quantified Self Movement as an Alternative Big Data Practice. International Journal of Communication 8, 0: 11.",
      "doi": ""
    },
    {
      "text": "William Odom, Sumeet Anand, Doenja Oogjes, and Jo Shin. 2019. Diversifying the Domestic: A Design Inquiry into Collective and Mobile Living. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS '19, 1377--1390. https://doi.org/10.1145/3322276.3323687",
      "doi": "10.1145/3322276.3323687"
    },
    {
      "text": "Doenja Oogjes, William Odom, and Pete Fung. 2018. Designing for an Other Home: Expanding and Speculating on Different Forms of Domestic Life. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), 313--326. https://doi.org/10.1145/3196709.3196810",
      "doi": "10.1145/3196709.3196810"
    },
    {
      "text": "Ton Otto and Rachel Smith. 2013. Design Anthropology: A Distinct Style of Knowing. In Design Anthropoogy: Theory and Practice, Wendy Gunn, Ton Otto and Rachel Charlotte Smith (eds.). Bloomsbury Publishing, 1--29.",
      "doi": ""
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19, 1--14. https://doi.org/10.1145/3290605.3300275",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "María Teresa Rodríguez, Sérgio Nunes, and Tiago Devezas. 2015. Telling Stories with Data Visualization. In Proceedings of the 2015 Workshop on Narrative & Hypertext (NHT '15), 7--11. https://doi.org/10.1145/2804565.2804567",
      "doi": "10.1145/2804565.2804567"
    },
    {
      "text": "Mario Romero, Zachary Pousman, and Michael Mateas. 2008. Alien Presence in the Home: The Design of Tableau Machine. Personal Ubiquitous Comput. 12, 5: 373--382. https://doi.org/10.1007/s00779-007-0190-z",
      "doi": "10.1007/s00779-007-0190-z"
    },
    {
      "text": "Rachel Sanders. 2017. Self-tracking in the Digital Era: Biopower, Patriarchy, and the New Biometric Body Projects. Body & Society 23, 1: 36--63. https://doi.org/10.1177/1357034X16660366",
      "doi": ""
    },
    {
      "text": "Sarah Pink, Kerstin Mackley, Roxana Morosanu, Val Mitchell, and Tracy Bhamra. 2017. Making homes: ethnography and design. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "E. Segel and J. Heer. 2010. Narrative Visualization: Telling Stories with Data. IEEE Transactions on Visualization and Computer Graphics 16, 6: 1139--1148. https://doi.org/10.1109/TVCG.2010.179",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Superflux. Instant Archetypes: A New Tarot For The New Normal. Kickstarter. Retrieved September 19, 2019 from https://www.kickstarter.com/projects/2093788053/instan t-archetypes-a-new-tarot-for-the-new-normal",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor, Susan P. Wyche, and Joseph \"Jofish\" Kaye. 2008. Pottering by Design. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08), 363--372. https://doi.org/10.1145/1463160.1463200",
      "doi": "10.1145/1463160.1463200"
    },
    {
      "text": "Edward R. Tufte. 2001. The Visual Display of Quantitative Information. Graphics Press, Cheshire, Conn.",
      "doi": "10.5555/33404"
    },
    {
      "text": "David Verweij, David Kirk, Kay Rogage, and Abigail Durrant. 2019. Domestic widgets: Leveraging household creativity in co-creating data physicalisations. In Proceedings of the 4th Biennal Research Through Design Conference. https://doi.org/10.6084/m9.figshare.7855778.v2",
      "doi": ""
    },
    {
      "text": "Gary Wolf. 2009. Know Thyself: Tracking Every Facet of Life, from Sleep to Mood to Pain, 24/7/365. Wired. Retrieved August 20, 2019 from https://www.wired.com/2009/06/lbnp-knowthyself/",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User Experience in Do-it-yourself-style Smart Homes. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 779--790. https://doi.org/10.1145/2750858.2806063",
      "doi": "10.1145/2750858.2806063"
    }
  ]
}