{
  "doi": "10.1145/3313831.3376231",
  "title": "In Search of Forms for Evocative and Generative Reflection: Exploratory Studies and a Design Proposal",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Today an increasing number of personal informatics tools and platforms support intended behavior change and goal achievement through data-based self-reflection. The scope of self-reflection expands with emerging sources, goals, and challenges of human well-being, demanding for reframing recent computer-mediated reflective practice. This study investigates a broader range of contexts and forms of self-reflection that support navigating one's mind and goals beyond achieving preset goals. This paper describes contemporary issues on human well-being and two exploratory studies-one conducted in a traveling artists' residency and the other in a design studio class-which surveyed various triggers, contexts, and forms of self-reflection. By connecting the insights from the two studies, I propose evocative and generative reflection as an alternative perspective to tracking-based, goal-oriented reflection and discuss implications for the design for reflection with a focus on the creative dimension of human well-being.",
  "tags": [
    "reflective forms",
    "reflection",
    "well-being",
    "creativity"
  ],
  "authors": [
    {
      "name": "Heekyoung Jung",
      "institution": "University of Cincinnati, Cincinnati, OH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339507792",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alberto Monge Roffarello and Luigi De Russis. (2019). The Race Towards Digital Wellbeing: Issues and Opportunities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Paper 386, 14 pages. DOI: https://doi.org/10.1145/3290605.3300616",
      "doi": "10.1145/3290605.3300616"
    },
    {
      "text": "Alliance of Artists Communities. Residences | Alliance of Artists Communities. Retrieved from http://www.artistcommunities.org/residencies",
      "doi": ""
    },
    {
      "text": "American Art Therapy Association. About Art Therapy | American Art Therapy Association. Retrieved from https://arttherapy.org/about-art-therapy/",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 28, 14 pages. DOI: https://doi.org/10.1145/3173574.3173602",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Andrea Grimes Parker. 2014. Reflection-throughperformance: personal implications of documenting health behaviors for the collective. Pers Ubituit Comput 18, 7 (October 2014), 1737 -- 1752. DOI: https://doi.org/10.1007/s00779-014-0780--5",
      "doi": ""
    },
    {
      "text": "Andrew Quitmeyer. 2018. Hiking Hacks: Workshop Model for Exploring Wilderness Interaction Design. In Proceedings of the 2018 Conference on Designing Interactive Systems (DIS '18). ACM, NY, NY, USA, 945--956. DOI: https://doi.org/10.1145/3196709.3196748.",
      "doi": "10.1145/3196709.3196748"
    },
    {
      "text": "Anna Ståhl, Jakob Tholander, Jarmo Laaksolahti, and Elsa Kosmack-Vaara. 2017. Being, Bringing and Bridging: Three Aspects of Sketching with Nature. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 1309--1320. DOI: https://doi.org/10.1145/3064663.3064764.",
      "doi": "10.1145/3064663.3064764"
    },
    {
      "text": "automato.farm. 2019. BIY: Believe It Yourself. Retrieved from http://automato.farm/portfolio/believe_it_yourself/",
      "doi": ""
    },
    {
      "text": "Barrie Tullett. 2014. Tyepwriter Art: A Modern Anthology. Laurence King Publishing.",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions. ACM 6, 1 (Jan./Feb. 1999), 21--29. DOI: https://doi.org/10.1145/291224.291235.",
      "doi": ""
    },
    {
      "text": "Bin Zhu, Anders Hedman, and Haibo Li. 2017. Designing Digital Mindfulness: Presence-In and Presence With versus Presence-Through. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 2685 -- 2695. DOI: https://doi.org/10.1145/3025453.3025590.",
      "doi": "10.1145/3025453.3025590"
    },
    {
      "text": "Brian Eno. Oblique Strategies. Retrieved from https://www.enoshop.co.uk/product/obliquestrategies.html",
      "doi": ""
    },
    {
      "text": "Center for Human Technology. Center for Human Technology: Realigning Technology with Humanity. Retrieved from http://humanetech.com",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting, David S. Kirk. 2017. Designing Documentary Informatics. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 649--661. DOI: https://doi.org/10.1145/3064663.3064714.",
      "doi": "10.1145/3064663.3064714"
    },
    {
      "text": "Claudia Núñez-Pacheco. 2018. Reflection through Inner Presence: A Sensitizing Concept for Design. Multimodal Technologies and Interact 2 (1), 5. DOI: https://doi.org/10.3390/mti2010005",
      "doi": ""
    },
    {
      "text": "D. Jean Clandinin and F. Michael Connelly. 2004. Narrative Inquiry: Experience and Story in Qualitative Research (1st ed.). Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "David Howes. 2013. The Expanding Field of Sensory Studies. (August 2013). Retrieved from http://www.sensorystudies.org/sensorialinvestigations/the-expanding-field-of-sensory-studies/",
      "doi": ""
    },
    {
      "text": "Danya Glabau. 2017. Fancy Feast: The aspirational fantasies in photogenic food. (September 21, 2017). Retrieved from http://reallifemag.com/fancy-feast/",
      "doi": ""
    },
    {
      "text": "Donald A. Schön. 1984. The Reflective Practitioner: How Professionals Think in Action (1st ed.). Basic Books.",
      "doi": ""
    },
    {
      "text": "Dorian Peters, Rafael A. Calvo, and Richard M. Ryan. 2018. Designing for Motivation, Engagement and Wellbeing in Digital Experience. Frontiers in Psychology. 9, 797 (28 May 2018). DOI: https://doi.org/10.3389/fpsyg.2018.00797",
      "doi": ""
    },
    {
      "text": "Ellen J. Langer. 2006. On Becoming an Artist: Reinventing Yourself Through Mindful Creativity. Ballantine Books.",
      "doi": ""
    },
    {
      "text": "Eric P. S. Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing Reflection: On the Use of Reflection. In Proceedings of the 2014 conference on Designing Interactive Systems. (DIS '14). ACM, NY, NY, USA, Pages 93 -- 102. DOI: https://doi.org/10.1145/2598510.2598598",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Eric P. S. Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies for Reflection. In Proceedings of the 2015 CHI Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, Pages 585 -- 594. DOI: https://doi.org/10.1145/2702123.2702234",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-Reflection: How People Reflect on Personal Data Through Visual Data Exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth'17). ACM, NY, NY, USA, 173- 182. DOI: https://doi.org/10.1145/3154862.3154881",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Francesca Gino. 2019. Need More Self-Control? Try a Simple Ritual (August 21, 2019). Retrieved from https://www.scientificamerican.com/article/need-moreself-control-try-a-simple-ritual/",
      "doi": ""
    },
    {
      "text": "Gille Bolton and Russell Delderfield, R. (2018). Reflective Practice: Writing and Professional Development (5th Ed.). SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Glenn Parsons. 2008. Aesthetics and Nature (1st ed.). Continuum.",
      "doi": ""
    },
    {
      "text": "Giorgia Lupi and Stefanie Posavec. (2016). Dear Data. Princeton Architectural Press.",
      "doi": ""
    },
    {
      "text": "Halbert L. Dunn. 1959. High-Level Wellness for Man and Society. American Journal of Public Health 49, 6 (June), 786--792. DOI: https://dx.doi.org/10.2105%2Fajph.49.6.786",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the 2010 CHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, Pages 557 -- 566. DOI: https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Jan Steward and Corita Kent. 2008. Learning by heart: Teachings to free the creative spirit (2nd Ed.). Allworth.",
      "doi": ""
    },
    {
      "text": "Jay David Bolter and Diane Gromala. 2003. Windows and Mirrors: Interaction Design, Digital Art, and the Myth of Transparency. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Jon Rogers, Michael Shorter, Pete Thomas, Martin Skelly, and Richard Cook. 2018. The SelfReflector: Design, IoT and the High Street. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 423, 12 pages. DOI: https://doi.org/10.1145/3173574.3173997",
      "doi": "10.1145/3173574.3173997"
    },
    {
      "text": "John W. Travis and Regina Sara Ryan. 2004. The Wellness Workbook: How to Achieve Enduring Health and Vitality (3rd ed.). Celestial Arts.",
      "doi": ""
    },
    {
      "text": "Jonathan Harris and Sep Kemvar. We Feel Fine. Retrieved from http://wefeelfine.org",
      "doi": ""
    },
    {
      "text": "Julia Cameron. 2016. The artist's way (Anniversary Ed.). TarcherPerigee.",
      "doi": ""
    },
    {
      "text": "Kimiko Ryokai, Elena Durán López, Noura Howell, Jon Gillick, and David Bamman. 2018. Capturing, Representing, and Interacting with Laughter. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 358, 12 pages. DOI: https://doi.org/10.1145/3173574.3173932",
      "doi": "10.1145/3173574.3173932"
    },
    {
      "text": "Kristina Höök et al. 2017. Soma-Based Design Theory. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, Pages 550 -- 557. DOI: https://doi.org/10.1145/3027063.3027082",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, Pages 3131 -- 3142. DOI: https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the 2007 CHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, Pages 1077 -- 1086. DOI: https://doi.org/10.1145/1240624.1240789",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow Technology: Designing for Reflection. Pers Ubiquit Comput. 5, 3 (August 2001), 201 -- 212. DOI: https://doi.org/10.1007/PL00000019",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Lian Loke, George Poonkhin Khut, and A. Baki Kocaballi. 2012. Bodily experience and imagination: designing ritual interactions for participatory live-art contexts. In Proceedings of the 2012 conference on Designing Interactive Systems. (DIS '12). ACM, NY, NY, USA, Pages 779 -- 788. DOI: https://doi.org/10.1145/2317956.2318073",
      "doi": ""
    },
    {
      "text": "Marc Wittmann. 2017. Felt Time: The Science of How We Experience Time. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Maliheh Ghajargar and Mikael Wiberg. 2018. Thinking with Interactive Artifacts: Reflection as a Concept in Design Outcomes. Design Issues 34, 2 (Spring 2018), 48 -- 63. DOI: https://doi.org/10.1162/DESI_a_00485",
      "doi": ""
    },
    {
      "text": "Florian 'Floyd' Mueller and Damon Young. 2017. Five Lenses for Designing Exertion Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, Pages 2473 -- 2483. DOI: https://doi.org/10.1145/3025453.3025746",
      "doi": "10.1145/3025453.3025746"
    },
    {
      "text": "Nada Terzimehić, Renate Häuslschmid, Heinrich Hussmann, m.c. schraefel. 2019. A Review & Analysis of Mindfulness Research in HCI: Framing Current Lines of Research and Future Opportunities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Paper 457, 13 pages. DOI: https://doi.org/10.1145/3290605.3300687",
      "doi": "10.1145/3290605.3300687"
    },
    {
      "text": "Nam Wook Kim, Hyejin Im, Nathalie Henry Riche, Alicia Wang, Krzysztof Gajos, and Hanspeter Pfister. 2019. DataSelfie: Empowering People to Design Personalized Visuals to Represent There Data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Paper 79, 12 pages. DOI: https://doi.org/10.1145/3290605.3300309",
      "doi": "10.1145/3290605.3300309"
    },
    {
      "text": "Natasha Myers. 2014. Sensing Botanical Sensoria: A Kriya for Cultivating Your Inner Plant. Retrieved from http://imaginativeethnography.org/imaginings/affect/se nsing-botanical-sensoria/",
      "doi": ""
    },
    {
      "text": "Nicholas Feltron. Feltron. Retrieved from http://feltron.com",
      "doi": ""
    },
    {
      "text": "Parham, J. 2017. What Does 'Self-Care' Mean Amid a Barrage of News and Social Media? (Nov 20, 2017). Retrieved from https://www.wired.com/story/self-caredigital-detox/",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Christopher Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective Practicum: A Framework of Sensitizing Concepts to Design for Transformative Reflection. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, Pages 2696 -- 2707. DOI: https://doi.org/10.1145/3025453.3025516",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05), Olav W. Bertelsen, Niels Olof Bouvin, Peter G. Krogh, and Morten Kyng (Eds.). ACM, NY, NY, USA, 49--58. DOI: http://dx.doi.org/10.1145/1094562.1094569",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Pierre D. Lévy. 2018. The beauty of making hot chocolate - an inquiry on designing for everyday rituals. In Proceedings of Design Research Society 2018 (DRS '12). 514--523. DIO: https://doi.org/10.21606/dma.2017.514",
      "doi": ""
    },
    {
      "text": "Rebecca Solnit. 2001. Wanderlust: A History of Walking. Penguin Books.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2008. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Runyuan (Jason) Chen, Mania Orand, Shin Young (Lucia) Choi, and Leena Choi. 2018. An Empirical Exploration of Mindfulness Design Using Solo Travel Domain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Paper 97, 12 pages. DOI: https://doi.org/10.1145/3173574.3173671",
      "doi": "10.1145/3173574.3173671"
    },
    {
      "text": "Sabrina Barr. 2019. Pinterest introduces wellness activities to support mental health (July 23, 2019). Retrieved from https://www.independent.co.uk/lifestyle/health-and-families/pinterest-wellness-activitiesmental-health-anxiety-breathing-exercisesa9016571.html",
      "doi": ""
    },
    {
      "text": "Self-Authoring -- What is Self-Authoring? Retrieved from https://selfauthoring.com",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2011. Evocative Objects: Things We Think With. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Shinrin-Yoku. Retrieved from http://www.shinrinyoku.org",
      "doi": ""
    },
    {
      "text": "Strohecker, J. 2005. A Brief History of Wellness. HealthWorld Online. Retrieved from http://goo.gl/UGoFr4.",
      "doi": ""
    },
    {
      "text": "Susie Ellis. 2017. Wellness, Well-Being... And What About Spa? (April 9, 2017). Retrieved from https://www.huffingtonpost.com/susieellis/wellness-wellbeingand-wha_b_9641722.html",
      "doi": ""
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2018. Photography as A Design Research Tool into Natureculture. In Proceedings of the 2014 conference on Designing Interactive Systems. (DIS '14). ACM, NY, NY, USA, Pages 777 -- 789. DOI: https://doi.org/10.1145/3196709.3196819",
      "doi": "10.1145/3196709.3196819"
    },
    {
      "text": "Tim Hwang. 2019. Announcing the Program on Advanced Divination (Jun 3, 2019). Retrieved from https://medium.com/@timhwang/announcing-theprogram-on-advanced-divination-b99e9b2c689a",
      "doi": ""
    },
    {
      "text": "TRYBE. Welcome to Trybe. Retrieved from http://www.trybe.us",
      "doi": ""
    },
    {
      "text": "Jack Mezirow. (1995). Transformation theory of adult learning. In M. Welton (Ed.), In defense of the lifeworld (39--70). New York: SUNY Press.",
      "doi": ""
    },
    {
      "text": "Yoko Akama, Ann Light, and Simon Bowen. 2017. Mindfulness and Technology: Traces of A Middle Way. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, NY, NY, USA, 345--355. DOI: https://doi.org/10.1145/3064663.3064752",
      "doi": "10.1145/3064663.3064752"
    },
    {
      "text": "Eugene T. Gendlin. 1982. Focusing (2nd Ed.). Bantam.",
      "doi": ""
    },
    {
      "text": "CDC. 2018. Well-Being Concepts | HRQOL | CDC. Retrieved from https://www.cdc.gov/hrqol/wellbeing.htm",
      "doi": ""
    }
  ]
}