{
  "doi": "10.1145/3313831.3376274",
  "title": "Please Call the Specialism: Using WeChat to Support Patient Care in China",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We examine how WeChat has been adopted to support nurse-patient communication in an IVF clinic in China. In this setting, the biggest challenge to delivering high-quality patient-centred care is the large number of patients. Nurses typically spend less than five minutes with each patient during clinical visits. To compensate for such minimal in-person consultation, nurse-facilitated patient groups were created on WeChat, to extend medical care and facilitate peer support. Through an ethnographic study, we examined how these groups fit into the clinic's communication ecosystem, and the challenges they raise for nurse-facilitators who receive thousands of messages daily. We propose a set of design suggestions aiming to make the work of the nurse-facilitator easier and more effective. In highlighting the opportunities and challenges of using chat to extend care beyond the clinic, we contribute to a burgeoning discussion of how chat can support patient care in the Global South.",
  "authors": [
    {
      "name": "Ding Wang",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366178",
      "orcid": "0000-0002-5037-5017"
    },
    {
      "name": "Santosh D. Kale",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527380",
      "orcid": "missing"
    },
    {
      "name": "Jacki O'Neill",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041250",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Johanna W.M. Aarts, Marjan J. Faber, Ben J. Cohlen, Anne Van Oers, WillianNe LDM Nelen, and Jan AM Kremer. 2015. Lessons learned from the implementation of an online infertility community into an IVF clinic's daily practice. Human Fertility 18, 4 (2015), 238--247.",
      "doi": ""
    },
    {
      "text": "Edward E Bartlett, Marsha Grayson, Randol Barker, David M Levine, Archie Golden, and Sam Libber. 1984. The effects of physician communications skills on patient satisfaction; recall, and adherence. Journal of chronic diseases 37, 9--10 (1984), 755--764.",
      "doi": ""
    },
    {
      "text": "Graham Button and Wes Sharrock. 1997. The production of order and the order of production: possibilities for distributed organisations, work and technology in the print industry. In Proceedings of the Fifth European Conference on Computer Supported Cooperative Work. Springer, 1--16.",
      "doi": "10.5555/1241980.1241981"
    },
    {
      "text": "Juan M. Calleja-Castillo and Gina Gonzalez-Calderon. 2018. WhatsApp in stroke systems: current use and regulatory concerns. Frontiers in neurology 9 (2018), 388.",
      "doi": ""
    },
    {
      "text": "M.E. Cecchinato, Anna L. Cox, and Jon Bird. 2014. \" I check my emails on the toilet\": Email Practices and Work-Home Boundary Management. ACM Conference on Human Factors in Computing Systems (CHI).",
      "doi": ""
    },
    {
      "text": "Margaret Chesney. 2003. Adherence to HAART regimens. AIDS patient care and STDs 17, 4 (2003), 169--177.",
      "doi": ""
    },
    {
      "text": "Yee Tak Derek Cheung, Ching Han Helen Chan, Chi-Keung Jonah Lai, Wai Fung Vivian Chan, Man Ping Wang, Ho Cheung William Li, Sophia Siu Chee Chan, and Tai-Hing Lam. 2015. Using WhatsApp and Facebook online social groups for smoking relapse prevention for recent quitters: a pilot pragmatic cluster randomized controlled trial. Journal of medical Internet research 17, 10 (2015), e238.",
      "doi": ""
    },
    {
      "text": "Elizabeth F. Churchill and Sara Bly. 1999. Virtual Environments at Work: ongoing use of MUDs in the Workplace. In ACM SIGSOFT Software Engineering Notes, Vol. 24. ACM, 99--108.",
      "doi": ""
    },
    {
      "text": "Janet M. Corrigan and others. 2005. Crossing the quality chasm. Building a better delivery system (2005).",
      "doi": ""
    },
    {
      "text": "Tara M. Cousineau, Sarah E Lord, Angel R Seibring, Evelyn A Corsini, Jessie C Viders, and Shaheen R Lakhani. 2004. A multimedia psychosocial support program for couples receiving infertility treatment: a feasibility study. Fertility and Sterility 81, 3 (2004), 532--538.",
      "doi": ""
    },
    {
      "text": "Andrew Crabtree, Mark Rouncefield, and Peter Tolmie. 2012. Doing design ethnography. Springer.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree, Peter Tolmie, and Will Knight. 2017. Repacking \"Privacy'for a networked world. Computer Supported Cooperative Work (CSCW) 26, 4--6 (2017), 453--488.",
      "doi": "10.1007/s10606-017-9276-y"
    },
    {
      "text": "Andy Crabtree, Peter Tolmie, and Mark Rouncefield. 2013. \"How many bloody examples do you want?\": Fieldwork and generalisation. In Proceedings of the 13th European Conference on Computer Supported Cooperative Work (ECSCW 2013), Olav W. Bertelsen, Luigina Ciolfi, Maria Antonietta Grasso, and George Angelos Papadopoulos (Eds.). Springer Verlag, 1--20. DOI: http://dx.doi.org/10.1007/978--1--4471--5346--7_1",
      "doi": ""
    },
    {
      "text": "Andrew Cross, Nakull Gupta, Brandon Liu, Vineet Nair, Abhishek Kumar, Reena Kuttan, Priyanka Ivatury, Amy Chen, Kshama Lakshman, Rashmi Rodrigues, and others. 2019. 99DOTS: a low-cost approach to monitoring and improving medication adherence. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. ACM, 15.",
      "doi": "10.1145/3287098.3287102"
    },
    {
      "text": "Judith C Daniluk. 2001. The infertility survival guide. New Harbinger Publications.",
      "doi": ""
    },
    {
      "text": "Victoria L Franklin, Annalu Waller, Claudia Pagliari, and Stephen A Greene. 2006. A randomized controlled trial of Sweet Talk, a text-messaging system to support young people with diabetes. Diabetic Medicine 23, 12 (2006), 1332--1338.",
      "doi": ""
    },
    {
      "text": "Kurubaran Ganasegeran, Pukunan Renganathan, Abdul Rashid, and Sami Abdo Radman Al-Dubai. 2017. The m-Health revolution: Exploring perceived benefits of WhatsApp use in clinical practice. International journal of medical informatics 97 (2017), 145--151.",
      "doi": ""
    },
    {
      "text": "Vincenzo Giordano, Hilton Koch, Alexandre Godoy-Santos, William Dias Belangero, Robinson Esteves Santos Pires, and Pedro Labronici. 2017. WhatsApp messenger as an adjunctive tool for telemedicine: an overview. Interactive journal of medical research 6, 2 (2017), e11.",
      "doi": ""
    },
    {
      "text": "Elaine A Graveley and Celia S Oseasohn. 1991. Multiple drug regimens: medication compliance among veterans 65 years and older. Research in nursing & health 14, 1 (1991), 51--58.",
      "doi": ""
    },
    {
      "text": "Noora Health. 2018. Noora Health. (2018). http://info.noorahealth.org/.",
      "doi": ""
    },
    {
      "text": "Zhufang Hu, Chengxian Wan, Lu Xu, and Ying Huang. 2015. The effectiveness of wechat-based transitional care in patients with ankylosing spondylitis. Chin J Nurs 50, 2 (2015), 175--178.",
      "doi": ""
    },
    {
      "text": "John Hughes, Val King, Tom Rodden, and Hans Andersen. 1994. Moving out from the control room: ethnography in system design. In Proceedings of the 1994 ACM conference on Computer supported cooperative work. ACM, 429--439.",
      "doi": "10.1145/192844.193065"
    },
    {
      "text": "Maged Kamel Boulos, Dean Giustini, and Steve Wheeler. 2016. Instagram and WhatsApp in health and healthcare: An overview. Future Internet 8, 3 (2016), 37.",
      "doi": ""
    },
    {
      "text": "Da-jung Kim and Youn-kyung Lim. 2015. Dwelling places in KakaoTalk: understanding the roles and meanings of chatrooms in mobile instant messengers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 775--784.",
      "doi": ""
    },
    {
      "text": "Hillary Klonoff-Cohen, Elaine Chu, Loki Natarajan, and William Sieber. 2001. A prospective study of stress among women undergoing in vitro fertilization or gamete intrafallopian transfer. Fertility and sterility 76, 4 (2001), 675--687.",
      "doi": ""
    },
    {
      "text": "Richelle C Kosse, Marcel L Bouvy, Svetlana V Belitser, Tjalling W de Vries, Piet S van der Wal, and Ellen S Koster. 2019. Effective Engagement of Adolescent Asthma Patients With Mobile Health--Supporting Medication Adherence. JMIR mHealth and uHealth 7, 3 (2019), e12411.",
      "doi": ""
    },
    {
      "text": "Richelle C Kosse, Marcel L Bouvy, Tjalling W de Vries, Ad A Kaptein, Harm CJ Geers, Liset van Dijk, and Ellen S Koster. 2017. mHealth intervention to support asthma self-management in adolescents: the ADAPT study. Patient preference and adherence 11 (2017), 571.",
      "doi": ""
    },
    {
      "text": "Richard L Kravitz, Ron D Hays, Cathy Donald Sherbourne, M Robin DiMatteo, William H Rogers, Lynn Ordway, and Sheldon Greenfield. 1993. Recall of recommendations and adherence to advice among patients with chronic medical conditions. Archives of internal medicine 153, 16 (1993), 1869--1878.",
      "doi": ""
    },
    {
      "text": "Kiran Kaur Kundhal and Pavi Singh Kundhal. 2003. Cultural diversity: an evolving challenge to physician-patient communication. JAMA 289, 1 (2003), 94--94.",
      "doi": ""
    },
    {
      "text": "Wei Li, Le Qiang Han, Yan Jun Guo, and Jing Sun. 2016. Using WeChat official accounts to improve malaria health literacy among Chinese expatriates in Niger: an intervention study. Malaria journal 15, 1 (2016), 567.",
      "doi": ""
    },
    {
      "text": "Bin Lin, Alexey Zagalsky, Margaret-Anne Storey, and Alexander Serebrenik. 2016. Why developers are slacking off: Understanding how software teams use slack. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion. ACM, 333--336.",
      "doi": "10.1145/2818052.2869117"
    },
    {
      "text": "Maurice Mars and Richard E Scott. 2016. Whatsapp in clinical practice: A literature. The Promise of New Technologies in an Age of New Health Challenges (2016), 82.",
      "doi": ""
    },
    {
      "text": "Moira McGregor, Nicola J Bidwell, Vidya Sarangapani, Jonathan Appavoo, and Jacki O'Neill. 2019. Talking about Chat at Work in the Global South: An Ethnographic Study of Chat Use in India and Kenya. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 233.",
      "doi": "10.1145/3290605.3300463"
    },
    {
      "text": "Robert S McKelvie, Koon K Teo, Robin Roberts, Neil McCartney, Dennis Humen, Terence Montague, Katie Hendrican, and Salim Yusuf. 2002. Effects of exercise training in patients with heart failure: the Exercise Rehabilitation Trial (EXERT). American heart journal 144, 1 (2002), 23--30.",
      "doi": ""
    },
    {
      "text": "Mohammad H Mobasheri, Dominic King, Maximilian Johnston, Sanjay Gautama, Sanjay Purkayastha, and Ara Darzi. 2015. The ownership and clinical use of smartphones by doctors and nurses in the UK: a multicentre survey study. BMJ Innovations 1, 4 (2015), 174--181.",
      "doi": ""
    },
    {
      "text": "Bruno Nardo, Marco Cannistrà, Vincenzo Diaco, Agostino Naso, Matteo Novello, Alessandra Zullo, Michele Ruggiero, Raffaele Grande, and Rosario Sacco. 2016. Optimizing patient surgical management using WhatsApp application in the Italian healthcare system. Telemedicine and e-Health 22, 9 (2016), 718--725.",
      "doi": ""
    },
    {
      "text": "NHS. 2018. Information governance and technology resources. (2018). https://digital.nhs.uk/ data-and-information/looking-after-information/ data-security-and-information-governance/ information-governance-alliance-iga/ information-governance-resources/ information-governance-and-technology-resources.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Carla F Griggio, and Wendy E Mackay. 2017. WhatsApp is for family; Messenger is for friends: Communication Places in App Ecosystems. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 727--735.",
      "doi": "10.1145/3025453.3025484"
    },
    {
      "text": "Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday Dwelling with WhatsApp. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1131--1143. DOI: http://dx.doi.org/10.1145/2531602.2531679",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Maureen Onditi. 2016. NWhatsApp in Kenya: real time messaging about HIV. (2016). https://www.keycorrespondents.org/ whatsapp-in-kenya-real-time-messaging-about-hiv/.",
      "doi": ""
    },
    {
      "text": "Jacki O'Neill, Stefania Castellani, Frederic Roulland, Nicolas Hairon, Cornell Juliano, and Liwei Dai. 2011. From ethnographic study to mixed reality: a remote collaborative troubleshooting system. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 225--234.",
      "doi": "10.1145/1958824.1958859"
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking privacy for a networked world. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 129--136.",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Jiezhong Qiu, Yixuan Li, Jie Tang, Zheng Lu, Hao Ye, Bo Chen, Qiang Yang, and John E Hopcroft. 2016. The lifecycle and cascade of wechat social messaging groups. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 311--320.",
      "doi": "10.1145/2872427.2882979"
    },
    {
      "text": "David Randall, Richard Harper, and Mark Rouncefield. 2007. Fieldwork for design: theory and practice. Springer Science & Business Media.",
      "doi": "10.5555/1296077"
    },
    {
      "text": "Clive Seale, Carol Rivas, and Moira Kelly. 2013. The challenge of communication in interpreted consultations in diabetes care: a mixed methods study. Br J Gen Pract 63, 607 (2013), e125--e133.",
      "doi": ""
    },
    {
      "text": "Anita Shet, Ayesha De Costa, N Kumarasamy, Rashmi Rodrigues, Bharat Bhusan Rewari, Per Ashorn, Bo Eriksson, and Vinod Diwan. 2014. Effect of mobile telephone reminders on treatment outcome in HIV: evidence from a randomised controlled trial in India. Bmj 349 (2014), g5978.",
      "doi": ""
    },
    {
      "text": "Emmy M Sluijs, Gerjo J Kok, and Jouke Van der Zee. 1993. Correlates of exercise compliance in physical therapy. Physical therapy 73, 11 (1993), 771--782.",
      "doi": ""
    },
    {
      "text": "Si Sun, Xiaomu Zhou, Joshua C Denny, Trent S Rosenbloom, and Hua Xu. 2013. Messaging to your doctors: understanding patient-provider communications via a portal system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1739--1748.",
      "doi": "10.1145/2470654.2466230"
    },
    {
      "text": "Kim Thomas. 2018. Wanted: a WhatsApp alternative for clinicians. Bmj 360 (2018), k622.",
      "doi": ""
    },
    {
      "text": "Xiaobo Wang and Baotong Gu. 2016. The communication design of WeChat: ideological as well as technical aspects of social media. Communication Design Quarterly Review 4, 1 (2016), 23--35.",
      "doi": "10.1145/2875501.2875503"
    },
    {
      "text": "CHINA INTERNET WATCH. 2019. Tencent performance in Q1 2019; WeChat MAU exceeds 1.1 billion. (2019). http://www.https://www.chinainternetwatch.com/29317/tencent-q1--2019/.",
      "doi": ""
    },
    {
      "text": "Lixing Xie, Ming Zhou, and Maosong Sun. 2012. Hierarchical structure based hybrid approach to sentiment analysis of Chinese micro blog and its feature extraction. Journal of Chinese information processing 26, 1 (2012), 73--83.",
      "doi": ""
    },
    {
      "text": "YAN Zhong-mei. 2015. The application of the Wechat in nurses' inservice training. Chinese Journal of Nursing Education 6 (2015), 17.",
      "doi": ""
    },
    {
      "text": "Xiaomu Zhou, Si Sun, and Jiang Yang. 2014. Sweet Home: Understanding diabetes management via a Chinese online community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3997--4006.",
      "doi": "10.1145/2556288.2557344"
    },
    {
      "text": "Yi Yvonne Zhou, Terhilda Garrido, Homer L Chin, Andrew M Wiesenthal, and Louise L Liang. 2007. Patient access to an electronic health record with secure messaging: impact on primary care utilization. Am J Manag Care 13, 7 (2007), 418--424.",
      "doi": ""
    }
  ]
}