{
  "doi": "10.1145/3313831.3376889",
  "title": "Under Surveillance: Technology Practices of those Monitored by the State",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "This paper documents the experiences of those living under state surveillance. We interviewed our participants about how they lived under threat, and how it changed their technology practices. Our participants spanned three groups - journalists who reported from countries where their activities were illegal; activists who took part in civil disobedience, and individuals who worked in illegal activities that would have likely led to prosecution. In our analysis we cover four themes: first, 'the imagined surveillant'. Second, the danger and dependencies of technology use, third, their coping strategies, and lastly how belonging to a group can protect but also expose. In our discussion we cover how we can design for dissidents, and how to deal with the difficult questions this raises. We conclude by advocating for research that takes into account a critical view of the state in HCI and more broadly for an anti-surveillance stance in the design of technologies.",
  "authors": [
    {
      "name": "Pedro Sanches",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81384620808/rel-imgonly/pedro_cropped.png",
      "acmid": "81384620808",
      "orcid": "0000-0001-5620-6305"
    },
    {
      "name": "Vasiliki Tsaknaki",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-87358710757/rel-imgonly/vasiliki.jpeg",
      "acmid": "87358710757",
      "orcid": "0000-0003-2235-6078"
    },
    {
      "name": "Asreen Rostami",
      "institution": "Stockholm University, Stockkholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258827057",
      "orcid": "missing"
    },
    {
      "name": "Barry Brown",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    }
  ],
  "references": [
    {
      "text": "Mark Andrejevic and Mark Burdon. 2015. Defining the sensor society. Television & New Media 16, 1: 19--36.",
      "doi": ""
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1694--1703. https://doi.org/10.1145/2675133.2675156",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Duncan Bayly, Maurice Castro, Arathi Arakala, Jason Jeffers, and Kathy Horadam. 2010. Fractional biometrics: safeguarding privacy in biometric applications. International Journal of Information Security 9, 1: 69--82. https://doi.org/10.1007/s10207009-0096-z",
      "doi": "10.1007/s10207-009-0096-z"
    },
    {
      "text": "Howard S. Becker. 1967. Whose Side Are We On? Social Problems 14, 3: 239--247. https://doi.org/10.2307/799147",
      "doi": ""
    },
    {
      "text": "Nina Boulus-Rødje and Pernille Bjørn. 2019. Digital (Occupied) Palestine. Retrieved August 20, 2019 from https://forskning.ruc.dk/en/publications/digitaloccupied-palestine",
      "doi": ""
    },
    {
      "text": "Simone Browne. 2015. Dark Matters: On the Surveillance of Blackness. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Monika Buscher, Markus Bylund, Pedro Sanches, Leonardo Ramirez, and Lisa Wood. 2013. A New Manhattan Project? Interoperability and Ethics in Emergency Response Systems of Systems. In 10th International ISCRAM Conference.",
      "doi": ""
    },
    {
      "text": "Markus Bylund, Jussi Karlgren, Fredrik Olsson, Pedro Sanches, and Carl-Henrik Arvidsson. 2008. Mirroring your web presence. In Proceedings of the 2008 ACM workshop on Search in social media, 87--90.",
      "doi": "10.1145/1458583.1458601"
    },
    {
      "text": "Baki Cakici and Pedro Sanches. 2014. Detecting the Visible: The Discursive Construction of Health Threats in a Syndromic Surveillance System Design. Societies 4, 3: 399--413. https://doi.org/10.3390/soc4030399",
      "doi": ""
    },
    {
      "text": "Débora de Castro Leal, Max Krüger, Kaoru Misaki, David Randall, and Volker Wulf. 2019. Guerilla Warfare and the Use of New (and Some Old) Technology. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems CHI '19, 1--12. https://doi.org/10.1145/3290605.3300810",
      "doi": "10.1145/3290605.3300810"
    },
    {
      "text": "Eric Corbett and Christopher Le Dantec. 2019. Towards a Design Framework for Trust in Digital Civics. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS '19), 1145--1156. https://doi.org/10.1145/3322276.3322296",
      "doi": "10.1145/3322276.3322296"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial Design as Inquiry and Practice. In Adversarial Design. MITP, 115--125. Retrieved December 18, 2019 from https://ieeexplore.ieee.org/document/7159941",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating Inequality: How High-Tech Tools Profile, Police, and Punish the Poor. St. Martin's Publishing Group.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Pedro Ferreira, Pedro Sanches, and Alexandra Weilenmann. 2013. Awareness, Transience and Temporality: Design Opportunities from Rah Island. In Human-Computer Interaction -- INTERACT 2013 (Lecture Notes in Computer Science), 696--713.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. A Stalker's Paradise. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems CHI '18, 1--13. https://doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "David Garland. 2002. The Culture of Control: Crime and Social Order in Contemporary Society. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Susan A. Gelman and Cristine H. Legare. 2011. Concepts and Folk Theories. Annual Review of Anthropology 40, 1: 379--398. https://doi.org/10.1146/annurev-anthro-081309-",
      "doi": ""
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H. Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a Low Profile? In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--15. https://doi.org/10.1145/3173574.3173688",
      "doi": "10.1145/3173574.3173688"
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H. Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a Low Profile? In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--15. https://doi.org/10.1145/3173574.3173688",
      "doi": "10.1145/3173574.3173688"
    },
    {
      "text": "Kevin D. Haggerty and Richard V. Ericson. 2000. The surveillant assemblage. The British Journal of Sociology 51, 4: 605--622. https://doi.org/10.1080/00071310020015280",
      "doi": ""
    },
    {
      "text": "Douglas D. Heckathorn. 1997. Respondent-Driven Sampling: A New Approach to the Study of Hidden Populations. Social Problems 44, 2: 174--199. https://doi.org/10.2307/3096941",
      "doi": ""
    },
    {
      "text": "Tom Jenkins, Christopher A. Le Dantec, Carl DiSalvo, Thomas Lodato, and Mariam Asad. 2016. ObjectOriented Publics. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 827--839. https://doi.org/10.1145/2858036.2858565",
      "doi": ""
    },
    {
      "text": "Os Keyes, Josephine Hoy, and Margaret Drouhard. 2019. Human-Computer Insurrection: Notes on an Anarchist HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19), 339:1--339:13. https://doi.org/10.1145/3290605.3300569",
      "doi": "10.1145/3290605.3300569"
    },
    {
      "text": "Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in it together. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, 3217. https://doi.org/10.1145/1978942.1979420",
      "doi": "10.1145/1978942.1979420"
    },
    {
      "text": "Marvin Landwehr, Alan Borning, and Volker Wulf. 2019. The High Cost of Free Services: Problems with Surveillance Capitalism and Possible Alternatives for IT Infrastructure. In Proceedings of the Fifth Workshop on Computing Within Limits (LIMITS '19), 3:1--3:10. https://doi.org/10.1145/3338103.3338106",
      "doi": "10.1145/3338103.3338106"
    },
    {
      "text": "Jessica Lingel, Aaron Trammell, Joe Sanchez, and Mor Naaman. 2012. Practices of Information and Secrecy in a Punk Rock Subculture. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 157--166. https://doi.org/10.1145/2145204.2145230",
      "doi": "10.1145/2145204.2145230"
    },
    {
      "text": "Tetyana Lokot. 2018. Be Safe or Be Seen? How Russian Activists Negotiate Visibility and Security in Online Resistance Practices. Surveillance & Society 16, 3: 332-- 346. https://doi.org/10.24908/ss.v16i3.6967",
      "doi": ""
    },
    {
      "text": "David Lyon. 2010. Surveillance, Power and Everyday Life. In Emerging Digital Spaces in Contemporary Society: Properties of Technology, Phillip KalantzisCope and Karim Gherab-Martín (eds.). Palgrave Macmillan UK, London, 107--120. https://doi.org/10.1057/9780230299047_18",
      "doi": ""
    },
    {
      "text": "David Lyon. 2014. Surveillance, Snowden, and Big Data: Capacities, consequences, critique. Big Data & Society 1, 2: 2053951714541861. https://doi.org/10.1177/2053951714541861",
      "doi": ""
    },
    {
      "text": "Rebecca MacKinnon. 2012. Consent of the Networked: The Worldwide Struggle For Internet Freedom. Basic Books, New York.",
      "doi": "10.5555/2222824"
    },
    {
      "text": "Annette N. Markham and Princess Bride. 2006. Ethic as method, method as ethic. Journal of Information Ethics 15, 2: 37--54.",
      "doi": ""
    },
    {
      "text": "Susan E. McGregor, Franziska Roesner, and Kelly Caine. 2016. Individual versus Organizational Computer Security and Privacy Concerns in Journalism. Proceedings on Privacy Enhancing Technologies 2016, 4: 418--435. https://doi.org/10.1515/popets-2016-0048",
      "doi": ""
    },
    {
      "text": "Anthony Bolton Newkirk. 2010. The Rise of the FusionIntelligence Complex: A critique of political surveillance after 9/11. Surveillance & Society 8, 1: 43-- 60. https://doi.org/10.24908/ss.v8i1.3473",
      "doi": ""
    },
    {
      "text": "Melville B. Nimmer. 1954. The right of publicity. Law and Contemporary problems 19, 2: 203--223.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford Law Books.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics: taking a local turn. Interactions 22, 4: 61--63.",
      "doi": "10.1145/2776885"
    },
    {
      "text": "Chanda Phelan, Cliff Lampe, and Paul Resnick. 2016. It's Creepy, But It Doesn'T Bother Me. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5240--5251. https://doi.org/10.1145/2858036.2858381",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "James Pierce. 2012. Undesigning Technology: Considering the Negation of Design by Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 957--966. https://doi.org/10.1145/2207676.2208540",
      "doi": "10.1145/2207676.2208540"
    },
    {
      "text": "Phillip Rogaway. 2015. The Moral Character of Cryptographic Work. IACR Cryptology ePrint Archive 2015: 1162.",
      "doi": ""
    },
    {
      "text": "Saqib Saeed, Markus Rohde, and Volker Wulf. 2011. Analyzing Political Activists' Organization Practices: Findings from a Long Term Case Study of the European Social Forum. Computer Supported Cooperative Work (CSCW) 20, 4--5: 265--304. https://doi.org/10.1007/s10606-011--9144-0",
      "doi": "10.1007/s10606-011-9144-0"
    },
    {
      "text": "Pedro Sanches and Barry Brown. 2018. Data Bites Man: The Production of Malaria by Technology. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing.",
      "doi": "10.1145/3274422"
    },
    {
      "text": "Pedro Sanches, Eric-Oluf Svee, Markus Bylund, Benjamin Hirsch, and Magnus Boman. 2013. Knowing Your Population: Privacy-Sensitive Mining of Massive Data. Network and Communication Technologies 2, 1. https://doi.org/10.5539/nct.v2n1p34",
      "doi": ""
    },
    {
      "text": "Irina Shklovski and Nalini Kotamraju. 2011. Online contribution practices in countries that engage in internet blocking and censorship. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, 1109. https://doi.org/10.1145/1978942.1979108",
      "doi": "10.1145/1978942.1979108"
    },
    {
      "text": "Irina Shklovski and Nalini Kotamraju. 2011. Online contribution practices in countries that engage in internet blocking and censorship. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, 1109. https://doi.org/10.1145/1978942.1979108",
      "doi": "10.1145/1978942.1979108"
    },
    {
      "text": "Irina Shklovski, Janet Vertesi, Emily Troshynski, and Paul Dourish. 2009. The Commodification of Location: Dynamics of Power in Location-based Systems. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp '09), 11--20. https://doi.org/10.1145/1620545.1620548",
      "doi": "10.1145/1620545.1620548"
    },
    {
      "text": "Peter Ullrich and Philipp Knopp. 2018. Protesters' reactions to video surveillance of demonstrations: Counter-moves, security cultures, and the spiral of surveillance and counter-surveillance. Surveillance & Society 16, 2: 183--202.",
      "doi": ""
    },
    {
      "text": "Alexander Wilson, Mark Tewdwr-Jones, and Rob Comber. 2019. Urban planning, public participation and digital technology: App development as a method of generating citizen involvement in local planning processes. Environment and Planning B: Urban Analytics and City Science 46, 2: 286--302.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Konstantin Aal, Ibrahim Abu Ktesh, Meryem Atam, Kai Schubert, George P Yerousis, Dave Randall, and Markus Rohde. 2013. Fighting against the Wall: Social Media use by Political Activists in a Palestinian Village.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. \"On the ground\" in Sidi Bouzid. In Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13, 1409. https://doi.org/10.1145/2441776.2441935",
      "doi": "10.1145/2441776.2441935"
    },
    {
      "text": "Svetlana Yarosh and Svetlana. 2013. Shifting dynamics or breaking sacred traditions? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 3413. https://doi.org/10.1145/2470654.2466468",
      "doi": "10.1145/2470654.2466468"
    },
    {
      "text": "Zimmerman, Phil. 1991. Why I wrote PGP. Why I Wrote PGP. Retrieved September 18, 2019 from https://www.philzimmermann.com/EN/essays/WhyIW rotePGP.html",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 2015. Big other: surveillance capitalism and the prospects of an information civilization. Journal of Information Technology 30, 1: 75--89. https://doi.org/10.1057/jit.2015.5",
      "doi": ""
    },
    {
      "text": "2019. What is Telegram and why was the app so popular during Hong Kong protests? South China Morning Post. Retrieved September 19, 2019 from https://www.scmp.com/tech/appssocial/article/3014382/what-telegram-and-why-didmessaging-app-prove-so-popular-during",
      "doi": ""
    },
    {
      "text": "Irdeto Global Consumer Piracy Survey Report. Retrieved September 11, 2019 from https://resources.irdeto.com/piracy-cybercrime/irdetoglobal-cusumer-piracy-survey-report",
      "doi": ""
    },
    {
      "text": "Definition of SURVEILLANT. Retrieved September 18, 2019 from https://www.merriamwebster.com/dictionary/surveillant",
      "doi": ""
    },
    {
      "text": "Google Researchers Found an Extremely Nasty iPhone Security Flaw. Time. Retrieved September 8, 2019 from https://time.com/5665298/iphone-security-applegoogle/",
      "doi": ""
    }
  ]
}