{
  "doi": "10.1145/3313831.3376395",
  "title": "Capturing Experts' Mental Models to Organize a Collection of Haptic Devices: Affordances Outweigh Attributes",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Humans rely on categories to mentally organize and understand sets of complex objects. One such set, haptic devices, has myriad technical attributes that affect user experience in complex ways. Seeking an effective navigation structure for a large online collection, we elicited expert mental categories for grounded force-feedback haptic devices: 18 experts (9 device creators, 9 interaction designers) reviewed, grouped, and described 75 devices according to their similarity in a custom card-sorting study. From the resulting quantitative and qualitative data, we identify prominent patterns of tagging versus binning, and we report 6 uber-attributes that the experts used to group the devices, favoring affordances over device specifications. Finally, we derive 7 device categories and 9 subcategories that reflect the imperfect yet semantic nature of the expert mental models. We visualize these device categories and similarities in the online haptic collection, and we offer insights for studying expert understanding of other human-centered technology.",
  "tags": [
    "expert-sourced categorization",
    "information visualization",
    "haptics",
    "haptic hardware collection",
    "mental model"
  ],
  "authors": [
    {
      "name": "Hasti Seifi",
      "institution": "Max Planck Institute for Intelligent Systems, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502650318",
      "orcid": "0000-0001-6437-0463"
    },
    {
      "name": "Michael Oppermann",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365941",
      "orcid": "missing"
    },
    {
      "name": "Julia Bullard",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81481642958/rel-imgonly/photo-close.jpg",
      "acmid": "81481642958",
      "orcid": "missing"
    },
    {
      "name": "Karon E. MacLean",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    },
    {
      "name": "Katherine J. Kuchenbecker",
      "institution": "Max Planck Institute for Intelligent Systems, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100483080",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hanne Albrechtsen and Elin K Jacob. 1998. The dynamics of classification systems as boundary objects for cooperation in the electronic library. Library Trends 47, 2 (1998). http://cat.inist.fr/?aModele=afficheN&cpsidt=1768725",
      "doi": ""
    },
    {
      "text": "Marcia J Bates. 1986. Subject access in online catalogs: A design model. Journal of the American Society for Information Science 37, 6 (1986), 357--376. DOI: http://dx.doi.org/10.1002/asi.4630370602 ISBN: 0002823118610.",
      "doi": ""
    },
    {
      "text": "Clare Beghtol. 1986. Semantic validity: Concepts of warrant in bibliographic classification systems. Library Resources & Technical Services 30, April/June (1986), 109--125.",
      "doi": ""
    },
    {
      "text": "Frank Branch, Theresa Arias, Jolene Kennah, Rebekah Phillips, Travis Windleharth, and Jin Ha Lee. 2017. Representing transmedia fictional worlds through ontology. Journal of the Association for Information Science and Technology 68, 12 (2017), 2771--2782. DOI: http://dx.doi.org/10.1002/asi.23886",
      "doi": "10.1002/asi.23886"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Virginia Braun, Victoria Clarke, Nikki Hayfield, and Gareth Terry. 2019. Thematic analysis. https://www.psych.auckland.ac.nz/en/about/our-research/research-groups/thematic-analysis.html. (2019). [Online; accessed 15-September-2019].",
      "doi": ""
    },
    {
      "text": "Chaomei Chen. 2006. CiteSpace II: Detecting and visualizing emerging trends and transient patterns in scientific literature. Journal of the American Society for information Science and Technology 57, 3 (2006), 359--377.",
      "doi": "10.5555/1115657.1115670"
    },
    {
      "text": "Çagatay Demiralp, Michael S Bernstein, and Jeffrey Heer. 2014. Learning perceptual kernels for visualization design. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1933--1942.",
      "doi": ""
    },
    {
      "text": "Melanie Feinberg. 2007. Hidden bias to responsible bias: an approach to information systems based on Haraway's situated knowledges. Information Research 12, 4 (2007). http://informationr.net/ir/12--4/colis07.html",
      "doi": ""
    },
    {
      "text": "Blake Hannaford and Allison M. Okamura. 2016. Haptics. In Springer Handbook of Robotics. Springer, 1063--1084.",
      "doi": ""
    },
    {
      "text": "Christian Hatzfeld and Thorsten A Kern. 2016. Engineering haptic devices. Springer.",
      "doi": ""
    },
    {
      "text": "Vincent Hayward and Oliver R. Astley. 1996. Performance measures for haptic interfaces. In Proceedings of the International Symposium on Robotics Research, Vol. 7. MIT Press, 195--206.",
      "doi": ""
    },
    {
      "text": "Vincent Hayward, Jehangir Choksi, Gonzalo Lanvin, and Christophe Ramstein. 1994. Design and Multi-Objective Optimization of a Linkage for a Haptic Interface. In Advances in Robot Kinematics and Computational Geometry, Jadran Lenarcic and Bahram Ravani (Eds.). Springer, Dordrecht, 359--368. DOI: http://dx.doi.org/10.1007/978--94-015--8348-0_36",
      "doi": ""
    },
    {
      "text": "Vincent Hayward and Karon E. MacLean. 2007. Do it yourself haptics: Part I. IEEE Robotics and Automation Magazine 14, 4 (2007).",
      "doi": ""
    },
    {
      "text": "Florian Heimerl, Qi Han, Steffen Koch, and Thomas Ertl. 2015. CiteRivers: Visual analytics of citation patterns. IEEE transactions on visualization and computer graphics 22, 1 (2015), 190--199.",
      "doi": ""
    },
    {
      "text": "Birger Hjørland. 2013. User-based and cognitive approaches to knowledge organization. Knowledge Organization 40, 1 (2013), 11--27.",
      "doi": ""
    },
    {
      "text": "Michael C Hout, Stephen D Goldinger, and Ryan W Ferguson. 2013. The versatility of SpAM: A fast, efficient, spatial method of data collection for multidimensional scaling. Journal of Experimental Psychology: General 142, 1 (2013), 256.",
      "doi": ""
    },
    {
      "text": "Elin K Jacob. 2004. Classification and categorization: A difference that makes a difference. Library Trends 52, 3 (2004), 515--540. Publisher: Graduate School of Library and Information Science. University of Illinois at Urbana-Champaign.",
      "doi": ""
    },
    {
      "text": "Anil K Jain, M Narasimha Murty, and Patrick J Flynn. 1999. Data clustering: a review. ACM Computing Surveys (CSUR) 31, 3 (1999), 264--323.",
      "doi": "10.1145/331499.331504"
    },
    {
      "text": "Stephen C Johnson. 1967. Hierarchical clustering schemes. Psychometrika 32, 3 (1967), 241--254.",
      "doi": ""
    },
    {
      "text": "Joseph B Kruskal and Myron Wish. 1978. Multidimensional Scaling. Vol. 11. Sage.",
      "doi": ""
    },
    {
      "text": "Katherine J. Kuchenbecker. 2018. Haptics and haptic interfaces. In Encyclopedia of Robotics. Springer. https://link.springer.com/referenceworkentry/10.1007% 2F978--3--642--41610--1_19--1",
      "doi": ""
    },
    {
      "text": "María J. López-Huertas. 1997. Thesaurus structure design: a conceptual approach for improved interaction. Journal of Documentation 53, 2 (1997), 139--177.",
      "doi": ""
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research 9, Nov (2008), 2579--2605.",
      "doi": ""
    },
    {
      "text": "Karon MacLean and Mario Enriquez. 2003. Perceptual design of haptic icons. In Proceedings of EuroHaptics. 351--363.",
      "doi": ""
    },
    {
      "text": "Jens-Erik Mai. 2005. Analysis in indexing: document and domain centered approaches. Information Processing & Management 41, 3 (May 2005), 599--611. DOI: http://dx.doi.org/10.1016/j.ipm.2003.12.004",
      "doi": "10.1016/j.ipm.2003.12.004"
    },
    {
      "text": "Melisa Orta Martinez, Tania K Morimoto, Annalisa T Taylor, Aaron C Barron, JD Akzl Pultorak, Jeanny Wang, Agnes Calasanz-Kaiser, Richard Lee Davis, Paulo Blikstein, and Allison M Okamura. 2016. 3-D printed haptic devices for educational applications. In Proceedings of the IEEE Haptics Symposium. 126--133. DOI: http://dx.doi.org/10.1109/HAPTICS.2016.7463166",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. AK Peters.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Josua Krause, Cristian Felix, Jeremy Boy, and Enrico Bertini. 2016. Towards Understanding Human Similarity Perception in the Analysis of Large Sets of Scatter Plots. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3659--3669. DOI: http://dx.doi.org/10.1145/2858036.2858155",
      "doi": "10.1145/2858036.2858155"
    },
    {
      "text": "Christopher Richard, Allison M Okamura, and Mark R Cutkosky. 1997. Getting a feel for dynamics: Using haptic interface kits for teaching dynamics and controls. In IEEE ASME IMECE Annual Symposium on Haptic Interfaces. 15--21.",
      "doi": ""
    },
    {
      "text": "Gordon Rugg and Peter McGeorge. 1997. The sorting techniques: a tutorial paper on card sorts, picture sorts and item sorts. Expert Systems 14, 2 (1997), 80--93.",
      "doi": ""
    },
    {
      "text": "Evren Samur. 2012. Performance metrics for haptic interfaces. Springer Science & Business Media.",
      "doi": "10.5555/2349015"
    },
    {
      "text": "Hasti Seifi, Farimah Fazlollahi, Michael Oppermann, John Andrew Sastrillo, Jessica Ip, Ashutosh Agrawal, Gunhyuk Park, Katherine J. Kuchenbecker, and Karon E. MacLean. 2019. Haptipedia: Accelerating Haptic Device Discovery to Support Interaction & Engineering Design. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 558, 12 pages. DOI: http://dx.doi.org/10.1145/3290605.3300788",
      "doi": ""
    },
    {
      "text": "Smiraglia, Richard P. 2015. Domain Analysis for Knowledge Organization. Chandos Publishing. DOI: http://dx.doi.org/10.1016/C2014-0-02303--9",
      "doi": ""
    },
    {
      "text": "David Richard Ternes. 2007. Building large sets of haptic icons: Rhythm as a design parameter, and between-subjects MDS for evaluation. Ph.D. Dissertation. University of British Columbia.",
      "doi": ""
    },
    {
      "text": "L Tsogo, MH Masson, and Anne Bardot. 2000. Multidimensional scaling methods for many-object sets: A review. Multivariate Behavioral Research 35, 3 (2000), 307--319.",
      "doi": ""
    },
    {
      "text": "Martin Wattenberg. 2002. Arc diagrams: Visualizing structure in strings. In IEEE Symposium on Information Visualization (InfoVis). 110--116.",
      "doi": ""
    },
    {
      "text": "Jevin Darwin West. 2010. Eigenfactor: ranking and mapping scientific knowledge. University of Washington.",
      "doi": ""
    },
    {
      "text": "Svante Wold, Kim Esbensen, and Paul Geladi. 1987. Principal component analysis. Chemometrics and Intelligent Laboratory Systems 2, 1--3 (1987), 37--52.",
      "doi": ""
    }
  ]
}