{
  "doi": "10.1145/3313831.3376288",
  "title": "Brainsourcing: Crowdsourcing Recognition Tasks via Collaborative Brain-Computer Interfacing",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2020,
  "badges": [],
  "abstract": "This paper introduces brainsourcing: utilizing brain responses of a group of human contributors each performing a recognition task to determine classes of stimuli. We investigate to what extent it is possible to infer reliable class labels using data collected utilizing electroencephalography (EEG) from participants given a set of common stimuli. An experiment (N=30) measuring EEG responses to visual features of faces (gender, hair color, age, smile) revealed an improved F1 score of 0.94 for a crowd of twelve participants compared to an F1 score of 0.67 derived from individual participants and a random chance of 0.50. Our results demonstrate the methodological and pragmatic feasibility of brainsourcing in labeling tasks and opens avenues for more general applications using brain-computer interfacing in a crowdsourced setting.",
  "tags": [
    "brain-computer interfaces",
    "crowdsourcing",
    "brainsourcing"
  ],
  "authors": [
    {
      "name": "Keith M. Davis",
      "institution": "University of Helsink, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528727",
      "orcid": "missing"
    },
    {
      "name": "Lauri Kangassalo",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659451647",
      "orcid": "missing"
    },
    {
      "name": "Michiel Spapé",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384612399",
      "orcid": "missing"
    },
    {
      "name": "Tuukka Ruotsalo",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339525898",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Laura Acqualagna and Benjamin Blankertz. 2013. Gaze-independent BCI-spelling using rapid serial visual presentation (RSVP). Clinical Neurophysiology 124, 5 (2013), 901 -- 908. DOI: http://dx.doi.org/https://doi.org/10.1016/j.clinph.2012.12.050",
      "doi": ""
    },
    {
      "text": "Laura Acqualagna, Matthias Sebastian Treder, Martijn Schreuder, and Benjamin Blankertz. 2010. A novel brain-computer interface based on the rapid serial visual presentation paradigm. In 2010 Annual International Conference of the IEEE Engineering in Medicine and Biology. 2686--2689. DOI: http://dx.doi.org/10.1109/IEMBS.2010.5626548",
      "doi": ""
    },
    {
      "text": "Mohammad Allahbakhsh, Boualem Benatallah, Aleksandar Ignjatovic, Hamid Reza Motahari-Nezhad, Elisa Bertino, and Schahram Dustdar. 2013. Quality Control in Crowdsourcing Systems: Issues and Directions. IEEE Internet Computing 17, 2 (March 2013), 76--81. DOI: http://dx.doi.org/10.1109/MIC.2013.20",
      "doi": "10.1109/MIC.2013.20"
    },
    {
      "text": "A. Azizian, A.L. Freitas, T.D. Watson, and N.K. Squires. 2006. Electrophysiological correlates of categorization: P300 amplitude as index of target similarity. Biological Psychology 71, 3 (2006), 278 -- 288. DOI: http://dx.doi.org/https://doi.org/10.1016/j.biopsycho.2005.05.002",
      "doi": ""
    },
    {
      "text": "Theodore R. Bashore and Maurits W. van der Molen. 1991. Discovery of the P300: A tribute. Biological Psychology 32, 2 (Oct. 1991), 155--171. DOI: http://dx.doi.org/10.1016/0301-0511(91)90007--4",
      "doi": ""
    },
    {
      "text": "Mohamed Bekkar, Hassiba Kheliouane Djemaa, and Taklit Akrouf Alitouche. 2013. Evaluation measures for models assessment over imbalanced data sets. Journal of Information Engineering and Applications 3, 10 (2013).",
      "doi": ""
    },
    {
      "text": "Nima Bigdely-Shamlo, Andrey Vankov, Rey R. Ramirez, and Scott Makeig. 2008. Brain Activity-Based Image Classification From Rapid Serial Visual Presentation. IEEE Transactions on Neural Systems and Rehabilitation Engineering 16, 5 (Oct 2008), 432--441. DOI: http://dx.doi.org/10.1109/TNSRE.2008.2003381",
      "doi": ""
    },
    {
      "text": "Benjamin Blankertz, Steven Lemm, Matthias Treder, Stefan Haufe, and Klaus-Robert Müller. 2011. Single-trial analysis and classification of ERP components - A tutorial. NeuroImage 56, 2 (2011), 814 -- 825. DOI: http://dx.doi.org/https://doi.org/10.1016/j.neuroimage.2010.06.048 Multivariate Decoding and Brain Reading.",
      "doi": ""
    },
    {
      "text": "Elena Boto, Niall Holmes, James Leggett, Gillian Roberts, Vishal Shah, Sofie S. Meyer, Leonardo Duque Muñoz, Karen J. Mullinger, Tim M. Tierney, Sven Bestmann, Gareth R. Barnes, Richard Bowtell, and Matthew J. Brookes. 2018. Moving magnetoencephalography towards real-world applications with a wearable system. Nature 555, 7698 (2018), 657--661. DOI: http://dx.doi.org/10.1038/nature26147",
      "doi": ""
    },
    {
      "text": "S. G. Boyd, A. Harden, and M. A. Patton. 1988. The EEG in early diagnosis of the Angelman (Happy Puppet) syndrome. European Journal of Pediatrics 147, 5 (01 Jun 1988), 508--513. DOI: http://dx.doi.org/10.1007/BF00441976",
      "doi": ""
    },
    {
      "text": "Daren C. Brabham. 2008. Crowdsourcing as a Model for Problem Solving: An Introduction and Cases. Convergence: The International Journal of Research into New Media Technologies 14, 1 (2008), 75--90. DOI: http://dx.doi.org/10.1177/1354856507084420",
      "doi": ""
    },
    {
      "text": "Anne-Marie Brouwer, Boris Reuderink, Joris Vincent, Marcel A. J. van Gerven, and Jan B. F. van Erp. 2013. Distinguishing between target and nontarget fixations in a visual search task using fixation-related potentials. Journal of Vision 13, 3 (07 2013), 1--10. DOI: http://dx.doi.org/10.1167/13.3.17",
      "doi": ""
    },
    {
      "text": "Alec Burmania, Srinivas Parthasarathy, and Carlos Busso. 2016. Increasing the Reliability of Crowdsourcing Evaluations Using Online Quality Assessment. IEEE Transactions on Affective Computing 7, 4 (Oct 2016), 374--388. DOI: http://dx.doi.org/10.1109/TAFFC.2015.2493525",
      "doi": "10.1109/TAFFC.2015.2493525"
    },
    {
      "text": "Sasha Burwell, Matthew Sample, and Eric Racine. 2017. Ethical aspects of brain computer interfaces: a scoping review. BMC Medical Ethics 18, 1 (2017), 60. DOI: http://dx.doi.org/10.1186/s12910-017-0220-y",
      "doi": ""
    },
    {
      "text": "Alexandra Séverac Cauquil, Gillian E. Edmonds, and Margot J. Taylor. 2000. Is the face-sensitive N170 the only ERP not affected by selective attention? NeuroReport 11, 10 (2000). https://journals.lww.com/neuroreport/Fulltext/2000/07140/ Is_the_face_sensitive_N170_the_only_ERP_not.21.aspx",
      "doi": ""
    },
    {
      "text": "Xi Chen, Paul N. Bennett, Kevyn Collins-Thompson, and Eric Horvitz. 2013. Pairwise Ranking Aggregation in a Crowdsourced Setting. In Proceedings of the Sixth ACM International Conference on Web Search and Data Mining (WSDM '13). ACM, NY, NY, USA, 193--202. DOI: http://dx.doi.org/10.1145/2433396.2433420",
      "doi": "10.1145/2433396.2433420"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, Shamsi T. Iqbal, and Michael S. Bernstein. 2015. Break It Down: A Comparison of Macro- and Microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 4061--4064. DOI: http://dx.doi.org/10.1145/2702123.2702146",
      "doi": ""
    },
    {
      "text": "Moritz Dannhauer, Benjamin Lanfer, Carsten H. Wolters, and Thomas R. Knösche. 2011. Modeling of the human skull in EEG source analysis. Human Brain Mapping 32, 9 (2011), 1383--1399. DOI: http://dx.doi.org/10.1002/hbm.21114",
      "doi": ""
    },
    {
      "text": "Luigi De Gennaro, Cristina Marzano, Fabiana Fratello, Fabio Moroni, Maria Concetta Pellicciari, Fabio Ferlazzo, Stefania Costa, Alessandro Couyoumdjian, Giuseppe Curcio, Emilia Sforza, Alain Malafosse, Luca A. Finelli, Patrizio Pasqualetti, Michele Ferrara, Mario Bertini, and Paolo Maria Rossini. 2008. The electroencephalographic fingerprint of sleep is genetically determined: A twin study. Annals of Neurology 64, 4 (2008), 455--460. DOI: http://dx.doi.org/10.1002/ana.21434",
      "doi": ""
    },
    {
      "text": "Stefan Debener, Reiner Emkes, Maarten De Vos, and Martin Bleichner. 2015. Unobtrusive ambulatory EEG using a smartphone and flexible printed electrodes around the ear. Scientific Reports 5, 1 (2015), 16743. DOI: http://dx.doi.org/10.1038/srep16743",
      "doi": ""
    },
    {
      "text": "Jia Deng, Jonathan Krause, and Li Fei-Fei. 2013. Fine-Grained Crowdsourcing for Fine-Grained Recognition. In Proceedings of the 2013 IEEE Conference on Computer Vision and Pattern Recognition (CVPR '13). IEEE Computer Society, Washington, DC, USA, 580--587. DOI: http://dx.doi.org/10.1109/CVPR.2013.81",
      "doi": "10.1109/CVPR.2013.81"
    },
    {
      "text": "Anhai Doan, Raghu Ramakrishnan, and Alon Y. Halevy. 2011. Crowdsourcing Systems on the World-Wide Web. Commun. ACM 54, 4 (April 2011), 86--96. DOI: http://dx.doi.org/10.1145/1924421.1924442",
      "doi": "10.1145/1924421.1924442"
    },
    {
      "text": "Emanuel Donchin and Michael GH Coles. 1998. Context updating and the P300. Behavioral and brain sciences 21, 1 (1998), 152--154. DOI: http://dx.doi.org/10.1017/S0140525X98230950",
      "doi": ""
    },
    {
      "text": "Enrique Estellés-Arolas and Fernando González-Ladrón-De-Guevara. 2012. Towards an Integrated Crowdsourcing Definition. J. Inf. Sci. 38, 2 (April 2012), 189--200. DOI: http://dx.doi.org/10.1177/0165551512437638",
      "doi": "10.1177/0165551512437638"
    },
    {
      "text": "Manuel J.A. Eugster, Tuukka Ruotsalo, Michiel M. Spapé, Ilkka Kosunen, Oswald Barral, Niklas Ravaja, Giulio Jacucci, and Samuel Kaski. 2014. Predicting Term-relevance from Brain Signals. In Proceedings of the 37th International ACM SIGIR Conference on Research & Development in Information Retrieval (SIGIR '14). ACM, NY, NY, USA, 425--434. DOI: http://dx.doi.org/10.1145/2600428.2609594",
      "doi": "10.1145/2600428.2609594"
    },
    {
      "text": "Manuel J. A. Eugster, Tuukka Ruotsalo, Michiel M. A. Spapé, Oswald Barral, Niklas Ravaja, Giulio Jacucci, and Samuel Kaski. 2016. Natural brain-information interfaces: Recommending information by relevance inferred from human brain signals. Scientific Reports 6 (2016). DOI: http://dx.doi.org/10.1038/srep38580",
      "doi": ""
    },
    {
      "text": "L.A. Farwell and E. Donchin. 1988. Talking off the top of your head: toward a mental prosthesis utilizing event-related brain potentials. Electroencephalography and Clinical Neurophysiology 70, 6 (1988), 510 -- 523. DOI: http://dx.doi.org/https://doi.org/10.1016/0013--4694(88)90149--6",
      "doi": ""
    },
    {
      "text": "Mario Frank, Tiffany Hwu, Sakshi Jain, Robert T. Knight, Ivan Martinovic, Prateek Mittal, Daniele Perito, Ivo Sluganovic, and Dawn Song. 2017. Using EEG-Based BCI Devices to Subliminally Probe for Private Information. In Proceedings of the 2017 on Workshop on Privacy in the Electronic Society (WPES '17). ACM, NY, NY, USA, 133--136. DOI: http://dx.doi.org/10.1145/3139550.3139559",
      "doi": "10.1145/3139550.3139559"
    },
    {
      "text": "Phillip.I. Good. 2000. Permutation Tests: A Practical Guide to Resampling Methods for Testing Hypotheses (2nd ed.). Springer. DOI: http://dx.doi.org/https://doi.org/10.1007/978--1--4757--3235--1",
      "doi": ""
    },
    {
      "text": "Dirk Hagemann, Johannes Hewig, Christof Walter, and Ewald Naumann. 2008. Skull thickness and magnitude of EEG alpha activity. Clinical Neurophysiology 119, 6 (2008), 1271 -- 1280. DOI: http://dx.doi.org/https://doi.org/10.1016/j.clinph.2008.02.010",
      "doi": ""
    },
    {
      "text": "J. Craig Henry. 2006. Electroencephalography: Basic Principles, Clinical Applications, and Related Fields, Fifth Edition. Neurology 67, 11 (2006), 2092--2092--a. DOI: http://dx.doi.org/10.1212/01.wnl.0000243257.85592.9a",
      "doi": ""
    },
    {
      "text": "James E. Hoffman, Robert F. Simons, and Michael R. Houck. 1983. Event-Related Potentials During Controlled and Automatic Target Detection. Psychophysiology 20, 6 (1983), 625--632. DOI: http://dx.doi.org/10.1111/j.1469--8986.1983.tb00929.x",
      "doi": ""
    },
    {
      "text": "Jeff Howe. 2006. The Rise of Crowdsourcing. Wired Magazine 14, 6 (06 2006). http://www.wired.com/wired/archive/14.06/crowds.html",
      "doi": ""
    },
    {
      "text": "Jeff Howe. 2008. Crowdsourcing: Why the Power of the Crowd Is Driving the Future of Business (1 ed.). Crown Publishing Group, New York, NY, USA.",
      "doi": "10.5555/1481457"
    },
    {
      "text": "Pei-Yun Hsueh, Prem Melville, and Vikas Sindhwani. 2009. Data Quality from Crowdsourcing: A Study of Annotation Selection Criteria. In Proceedings of the NAACL HLT 2009 Workshop on Active Learning for Natural Language Processing (HLT '09). Association for Computational Linguistics, Stroudsburg, PA, USA, 27--35. http://dl.acm.org/citation.cfm?id=1564131.1564137",
      "doi": "10.5555/1564131.1564137"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 611--620. DOI: http://dx.doi.org/10.1145/2470654.2470742",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Giulio Jacucci, Oswald Barral, Pedram Daee, Markus Wenzel, Baris Serim, Tuukka Ruotsalo, Patrik Pluchino, Jonathan Freeman, Luciano Gamberini, Samuel Kaski, and Benjamin Blankertz. 2019. Integrating neurophysiologic relevance feedback in intent modeling for information retrieval. Journal of the Association for Information Science and Technology 70, 9 (2019), 917--930. DOI: http://dx.doi.org/10.1002/asi.24161",
      "doi": "10.1002/asi.24161"
    },
    {
      "text": "Lauri Kangassalo, Michiel Spapé, Giulio Jacucci, and Tuukka Ruotsalo. 2019. Why Do Users Issue Good Queries?: Neural Correlates of Term Specificity. In Proceedings of the 42Nd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR'19). ACM, NY, NY, USA, 375--384. DOI: http://dx.doi.org/10.1145/3331184.3331243",
      "doi": "10.1145/3331184.3331243"
    },
    {
      "text": "Ashish Kapoor, Pradeep Shenoy, and Desney Tan. 2008. Combining brain computer interfaces with vision for object categorization. In 2008 IEEE Conference on Computer Vision and Pattern Recognition. 1--8. DOI: http://dx.doi.org/10.1109/CVPR.2008.4587618",
      "doi": ""
    },
    {
      "text": "David R. Karger, Sewoong Oh, and Devavrat Shah. 2011. Iterative Learning for Reliable Crowdsourcing Systems. In Advances in Neural Information Processing Systems 24. Curran Associates, Inc., 1953--1961. http://papers.nips.cc/paper/ 4396-iterative-learning-for-reliable-crowdsourcing-systems. pdf",
      "doi": ""
    },
    {
      "text": "Tero Karras, Timo Aila, Samuli Laine, and Jaakko Lehtinen. 2017. Progressive growing of gans for improved quality, stability, and variation. arXiv preprint arXiv:1710.10196 (2017).",
      "doi": ""
    },
    {
      "text": "Nam Wook Kim, Zoya Bylinskii, Michelle A. Borkin, Krzysztof Z. Gajos, Aude Oliva, Fredo Durand, and Hanspeter Pfister. 2017. BubbleView: An Interface for Crowdsourcing Image Importance Maps and Tracking Visual Attention. ACM Trans. Comput.-Hum. Interact. 24, 5, Article 36 (Nov. 2017), 40 pages. DOI: http://dx.doi.org/10.1145/3131275",
      "doi": "10.1145/3131275"
    },
    {
      "text": "Adriana Kovashka, Olga Russakovsky, Li Fei-Fei, and Kristen Grauman. 2016. Crowdsourcing in Computer Vision. Foundations and Trends in Computer Graphics and Vision 10, 3 (2016), 177--243. DOI: http://dx.doi.org/10.1561/0600000071",
      "doi": "10.5555/3125988"
    },
    {
      "text": "A. Kubler, V. K. Mushahwar, L. R. Hochberg, and J. P. Donoghue. 2006. BCI meeting 2005-workshop on clinical issues and applications. IEEE Transactions on Neural Systems and Rehabilitation Engineering 14, 2 (June 2006), 131--134. DOI: http://dx.doi.org/10.1109/TNSRE.2006.875585",
      "doi": ""
    },
    {
      "text": "Marta Kutas and Kara D. Federmeier. 2010. Thirty Years and Counting: Finding Meaning in the N400 Component of the Event-Related Brain Potential (ERP). Annual Review of Psychology 62, 1 (Dec. 2010), 621--647. DOI: http://dx.doi.org/10.1146/annurev.psych.093008.131123",
      "doi": ""
    },
    {
      "text": "Matthew Lease and Emine Yilmaz. 2012. Crowdsourcing for Information Retrieval. SIGIR Forum 45, 2 (Jan. 2012), 66--75. DOI: http://dx.doi.org/10.1145/2093346.2093356",
      "doi": "10.1145/2093346.2093356"
    },
    {
      "text": "Christopher H. Lin, Ece Kamar, and Eric Horvitz. 2014. Signals in the Silence: Models of Implicit Feedback in a Recommendation System for Crowdsourcing. In Proceedings of the Twenty-Eighth AAAI Conference on Artificial Intelligence (AAAI'14). AAAI Press, 908--914. http://dl.acm.org/citation.cfm?id=2893873.2894015",
      "doi": ""
    },
    {
      "text": "Yuan-Pin Lin, Chi-Hong Wang, Tzyy-Ping Jung, Tien-Lin Wu, Shyh-Kang Jeng, Jeng-Ren Duann, and Jyh-Horng Chen. 2010. EEG-Based Emotion Recognition in Music Listening. IEEE Transactions on Biomedical Engineering 57, 7 (July 2010), 1798--1806. DOI: http://dx.doi.org/10.1109/TBME.2010.2048568",
      "doi": ""
    },
    {
      "text": "Steven J Luck. 2014. An introduction to the event-related potential technique. MIT press.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Thomas N. Smyth, Jill P. Dimond, and Krzysztof Z. Gajos. 2016. Learning From the Crowd: Observational Learning in Crowdsourcing Communities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2635--2644. DOI: http://dx.doi.org/10.1145/2858036.2858560",
      "doi": ""
    },
    {
      "text": "A. C. Metting van Rijn, A. Peper, and C. A. Grimbergen. 1990. High-quality recording of bioelectric events. Medical and Biological Engineering and Computing 28, 5 (1990), 389--397. DOI: http://dx.doi.org/10.1007/BF02441961",
      "doi": ""
    },
    {
      "text": "Chisei Miyamoto, Sadanao Baba, and Isao Nakanishi. 2009. Biometric person authentication using new spectral features of electroencephalogram (EEG). In 2008 international symposium on intelligent signal processing and communications systems. IEEE, 1--4. DOI: http://dx.doi.org/10.1109/ISPACS.2009.4806762",
      "doi": ""
    },
    {
      "text": "Noman Naseer, Melissa Jiyoun Hong, and Keum-Shik Hong. 2014. Online binary decision decoding using functional near-infrared spectroscopy for the development of brain--computer interface. Experimental Brain Research 232, 2 (01 Feb 2014), 555--564. DOI: http://dx.doi.org/10.1007/s00221-013--3764--1",
      "doi": ""
    },
    {
      "text": "Seong Joon Oh, Bernt Schiele, and Mario Fritz. 2019. Towards Reverse-Engineering Black-Box Neural Networks. Springer International Publishing, Cham, 121--144. DOI: http://dx.doi.org/10.1007/978--3-030--28954--6_7",
      "doi": ""
    },
    {
      "text": "Markus Ojala and Gemma C Garriga. 2010. Permutation tests for studying classifier performance. Journal of Machine Learning Research 11, Jun (2010), 1833--1863.",
      "doi": ""
    },
    {
      "text": "Danny Plass-Oude Bos. 2006. EEG-based Emotion Recognition. The Influence of Visual and Auditory Stimuli (01 2006).",
      "doi": ""
    },
    {
      "text": "John Polich. 1986. Attention, probability, and task demands as determinants of P300 latency from auditory stimuli. Electroencephalography and Clinical Neurophysiology 63, 3 (1986), 251 -- 259. DOI: http://dx.doi.org/https://doi.org/10.1016/0013--4694(86)90093--3",
      "doi": ""
    },
    {
      "text": "John Polich. 2007. Updating P300: An integrative theory of P3a and P3b. Clinical Neurophysiology 118, 10 (2007), 2128 -- 2148. DOI: http://dx.doi.org/https://doi.org/10.1016/j.clinph.2007.04.019",
      "doi": ""
    },
    {
      "text": "David Powers and Ailab. 2011. Evaluation: From precision, recall and F-measure to ROC, informedness, markedness correlation. Jounral of Machine Learning Technologies 2 (01 2011), 2229--3981. DOI: http://dx.doi.org/10.9735/2229--3981",
      "doi": ""
    },
    {
      "text": "Jeffrey M Rzeszotarski, Ed Chi, Praveen Paritosh, and Peng Dai. 2013. Inserting micro-breaks into crowdsourcing workflows. In First AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Kota Sano, Yasutami Tsuda, Hisanobu Sugano, Shuji Aou, and Akikazu Hatanaka. 2002. Concentration Effects of Green Odor on Event-related Potential (P300) and Pleasantness. Chemical Senses 27, 3 (03 2002), 225--230. DOI: http://dx.doi.org/10.1093/chemse/27.3.225",
      "doi": ""
    },
    {
      "text": "Pradeep Shenoy and Desney S. Tan. 2008. Human-aided Computing: Utilizing Implicit Human Processing to Classify Images. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 845--854. DOI: http://dx.doi.org/10.1145/1357054.1357188",
      "doi": ""
    },
    {
      "text": "SJM Smith. 2005. EEG in the diagnosis, classification, and management of patients with epilepsy. Journal of Neurology, Neurosurgery & Psychiatry 76, suppl 2 (2005), ii2--ii7. DOI: http://dx.doi.org/10.1136/jnnp.2005.069245",
      "doi": ""
    },
    {
      "text": "Ahmad Tauseef Sohaib, Shahnawaz Qureshi, Johan Hagelbäck, Olle Hilborn, and Petar Jercic. 2013. Evaluating Classifiers for Emotion Recognition Using EEG. In Foundations of Augmented Cognition, Dylan D. Schmorrow and Cali M. Fidopiastis (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 492--501.",
      "doi": ""
    },
    {
      "text": "Marina Sokolova and Guy Lapalme. 2009. A systematic analysis of performance measures for classification tasks. Information Processing Management 45, 4 (2009), 427 -- 437. DOI: http://dx.doi.org/https://doi.org/10.1016/j.ipm.2009.03.002",
      "doi": "10.1016/j.ipm.2009.03.002"
    },
    {
      "text": "M. Soleymani, S. Asghari-Esfeden, Y. Fu, and M. Pantic. 2016. Analysis of EEG Signals and Facial Expressions for Continuous Emotion Detection. IEEE Transactions on Affective Computing 7, 1 (Jan 2016), 17--28. DOI: http://dx.doi.org/10.1109/TAFFC.2015.2436926",
      "doi": "10.1109/TAFFC.2015.2436926"
    },
    {
      "text": "Michiel Spape, Rinus Verdonschot, and Henk van Steenbergen. 2019. The E-Primer: An introduction to creating psychological experiments in E-Prime®: Second edition updated for E-Prime 3. Leiden Univerisity Press.",
      "doi": ""
    },
    {
      "text": "Samuel Sutton, Margery Braren, Joseph Zubin, and E. R. John. 1965. Evoked-Potential Correlates of Stimulus Uncertainty. Science 150, 3700 (1965), 1187--1188. DOI: http://dx.doi.org/10.1126/science.150.3700.1187",
      "doi": ""
    },
    {
      "text": "Ariel Telpaz, Ryan Webb, and Dino J. Levy. 2015. Using EEG to Predict Consumers' Future Choices. Journal of Marketing Research 52, 4 (2015), 511--529. DOI: http://dx.doi.org/10.1509/jmr.13.0564",
      "doi": ""
    },
    {
      "text": "G Vecchiato, J Toppi, F Cincotti, L Astolfi, F De Vico Fallani, F Aloise, D Mattia, S Bocale, F Vernucci, and F Babiloni. 2010. Neuropolitics: EEG spectral maps related to a political vote based on the first impression of the candidate's face. In 2010 Annual International Conference of the IEEE Engineering in Medicine and Biology. IEEE, 2902--2905. DOI: http://dx.doi.org/10.1109/IEMBS.2010.5626324",
      "doi": ""
    },
    {
      "text": "Luis von Ahn and Laura Dabbish. 2004. Labeling Images with a Computer Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 319--326. DOI: http://dx.doi.org/10.1145/985692.985733",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Luis von Ahn, Benjamin Maurer, Colin McMillen, David Abraham, and Manuel Blum. 2008. reCAPTCHA: Human-Based Character Recognition via Web Security Measures. Science 321, 5895 (2008), 1465--1468. DOI: http://dx.doi.org/10.1126/science.1160379",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong, Nick Merrill, and John Chuang. 2018. When BCIs Have APIs: Design Fictions of Everyday Brain-Computer Interface Adoption. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, NY, NY, USA, 1359--1371. DOI: http://dx.doi.org/10.1145/3196709.3196746",
      "doi": "10.1145/3196709.3196746"
    },
    {
      "text": "Shuhei Yamaguchi and Robert T. Knight. 1991. P300 generation by novel somatosensory stimuli. Electroencephalography and Clinical Neurophysiology 78, 1 (1991), 50 -- 55. DOI: http://dx.doi.org/https://doi.org/10.1016/0013--4694(91)90018-Y",
      "doi": ""
    },
    {
      "text": "Man-Ching Yuen, Irwin King, and Kwong-Sak Leung. 2011. A Survey of Crowdsourcing Systems. In 2011 IEEE Third International Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third International Conference on Social Computing. 766--773. DOI: http://dx.doi.org/10.1109/PASSAT/SocialCom.2011.203",
      "doi": ""
    }
  ]
}