{
  "doi": "10.1145/3313831.3376404",
  "title": "\"Person, Shoes, Tree. Is the Person Naked?\" What People with Vision Impairments Want in Image Descriptions",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Access to digital images is important to people who are blind or have low vision (BLV). Many contemporary image description efforts do not take into account this population's nuanced image description preferences. In this paper, we present a qualitative study that provides insight into 28 BLV people's experiences with descriptions of digital images from news websites, social networking sites/platforms, eCommerce websites, employment websites, online dating websites/platforms, productivity applications, and e-publications. Our findings reveal how image description preferences vary based on the source where digital images are encountered and the surrounding context. We provide recommendations for the development of next-generation image description technologies inspired by our empirical analysis.",
  "authors": [
    {
      "name": "Abigale Stangl",
      "institution": "University of Texas at Austin, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502793279",
      "orcid": "0000-0003-2761-1429"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Danna Gurari",
      "institution": "University of Texas at Austin, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550645756",
      "orcid": "0000-0003-1306-0283"
    }
  ],
  "references": [
    {
      "text": "Roobaea Alroobaea and Pam J Mayhew. 2014. How many participants are really enough for usability studies?. In 2014 Science and Information Conference. IEEE, 48--56.",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Martez E Mott, Edward Cutrell, Meredith Ringel Morris, and others. 2018. How Teens with Visual Impairments Take, Edit, and Share Photos on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 76.",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Nilavra Bhattacharya, Qing Li, and Danna Gurari. 2019. Why Does a Visual Question Have Different Answers?. In Proceedings of the IEEE International Conference on Computer Vision. 4271--4280.",
      "doi": ""
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and others. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 333--342.",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P Bigham, Richard E Ladner, and Yevgen Borodin. 2011. The design of human-powered access technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. ACM, 3--10.",
      "doi": "10.1145/2049536.2049540"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, and Jeffrey P Bigham. 2015. Gauging receptiveness to social microvolunteering. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1055--1064.",
      "doi": "10.1145/2702123.2702329"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013. Visual Challenges in the Everyday Lives of Blind People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2117--2126.",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Stacy M Branham, Ali Abdolrahmani, William Easley, Morgan Scheuerman, Erick Ronquillo, and Amy Hurst. 2017. Is Someone There? Do They Have a Gun: How Visual Information about Others Can Improve Personal Safety Management for Blind Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 260--269.",
      "doi": "10.1145/3132525.3132534"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Michele A Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. ACM, 135--142.",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Diagram Center. Specific Guidelines: Art, Photos & Cartoons. http://diagramcenter.org/ specific-guidelines-final-draft.html#20. (No Date).",
      "doi": ""
    },
    {
      "text": "Diagram Center and Touch Graphics. No Date. Decision Tree. http://diagramcenter.org/decision-tree.html. (No Date). (Accessed on 12/30/2019).",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. 2019. How to Meet WCAG (Quickref Reference). https://www.w3.org/WAI/WCAG21/quickref/. (October 2019). (Accessed on 01/02/2019).",
      "doi": ""
    },
    {
      "text": "Hao Fang, Saurabh Gupta, Forrest Iandola, Rupesh K Srivastava, Li Deng, Piotr Dollár, Jianfeng Gao, Xiaodong He, Margaret Mitchell, John C Platt, and others. 2015. From captions to visual concepts and back. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1473--1482.",
      "doi": ""
    },
    {
      "text": "Kay Alicyn Ferrell, Silvia M Correa-Torres, Jennifer Johnson Howell, Robert Pearson, Wendy Morrow Carver, Amy Spencer Groll, Tanni L Anthony, Deborah Matthews, Bryan Gould, Trisha O'Connell, and others. 2017. Audible Image Description as an Accommodation in Statewide Assessments for Students with Visual and Print Disabilities. Journal of Visual Impairment & Blindness 111, 4 (2017), 325--339.",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Cameron Cassidy, Meredith Ringel Morris, Kris M. Kitani, and Jeffrey P. Bigham. 2019. &Ldquo;It's Almost Like They'Re Trying to Hide It&Rdquo;: How User-Provided Image Descriptions Have Failed to Make Twitter Accessible. In The World Wide Web Conference (WWW '19). ACM, NY, NY, USA, 549--559.",
      "doi": ""
    },
    {
      "text": "Darren Guinness, Edward Cutrell, and Meredith Ringel Morris. 2018. Caption crawler: Enabling reusable alternative text descriptions using reverse image search. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 518.",
      "doi": "10.1145/3173574.3174092"
    },
    {
      "text": "Anhong Guo, Ece Kamar, Jennifer Wortman Vaughan, Hanna Wallach, and Meredith Ringel Morris. 2019. Toward Fairness in AI for People with Disabilities: A Research Roadmap. arXiv preprint arXiv:1907.02227 (2019).",
      "doi": ""
    },
    {
      "text": "Danna Gurari, Qing Li, Abigale J. Stangl, Anhong Guo, Chi Lin, Kristen Grauman, Jiebo Luo, and Jeffrey P. Bigham. 2018. VizWiz Grand Challenge: Answering Visual Questions From Blind People. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Simon Harper and Alex Q Chen. 2012. Web accessibility guidelines. World Wide Web 15, 1 (2012), 61--88.",
      "doi": "10.1007/s11280-011-0130-8"
    },
    {
      "text": "AI Now Institute. 2019. Disability, Bias, and AI. https://ainowinstitute.org/disabilitybiasai-2019.pdf. (November 2019). (Accessed on 01/02/2020).",
      "doi": ""
    },
    {
      "text": "Os Keyes and Cynthia L. Bennett. 2019. What Is the Point of Fairness? Disability, AI and The Complexity of Justice. arXiv preprint arXiv:1908.01024 (2019).",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Alfreda Dudley-Sponaugle, and Kisha-Dawn Greenidge. 2004. Improving web accessibility: a study of webmaster perceptions. Computers in human behavior 20, 2 (2004), 269--288.",
      "doi": ""
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. 2014. Microsoft coco: Common objects in context. In European conference on computer vision. Springer, 740--755.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Cynthia L Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People's Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5988--5999.",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Valerie S Morash, Yue-Ting Siu, Joshua A Miele, Lucia Hasty, and Steven Landau. 2015. Guiding novice web workers in making image descriptions using templates. ACM Transactions on Accessible Computing (TACCESS) 7, 4 (2015), 12.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2019. AI and Accessibility: A Discussion of Ethical Considerations. arXiv preprint arXiv:1908.08939 (2019).",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Jazette Johnson, Cynthia L Bennett, and Edward Cutrell. 2018. Rich representations of visual content for screen reader users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 59.",
      "doi": "10.1145/3173574.3173633"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P Bigham, and Shaun K Kane. 2016. With most of it being pictures now, I rarely use it: Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5506--5516.",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Helen Petrie, Chandra Harrison, and Sundeep Dev. 2005. Describing images on the web: a survey of current practice and prospects for the future. Proceedings of Human Computer Interaction International (HCII) 71 (2005).",
      "doi": ""
    },
    {
      "text": "John R Porter, Kiley Sobel, Sarah E Fox, Cynthia L Bennett, and Julie A Kientz. 2017. Filtered out: Disability disclosure practices in online dating communities. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 87.",
      "doi": "10.1145/3134722"
    },
    {
      "text": "Elliot Salisbury, Ece Kamar, and Meredith Ringel Morris. 2017. Toward scalable social alt text: Conversational crowdsourcing as a tool for refining vision-to-language technology for the blind. In Fifth AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Elliot Salisbury, Ece Kamar, and Meredith Ringel Morris. 2018. Evaluating and Complementing Vision-to-Language Technology for People who are Blind with Conversational Crowdsourcing.. In IJCAI. 5349--5353.",
      "doi": ""
    },
    {
      "text": "John M Slatin and Sharron Rush. 2002. Maximum accessibility: Making your web site more usable for everyone. Addison-Wesley Longman Publishing Co., Inc.",
      "doi": "10.5555/560695"
    },
    {
      "text": "Abigale J Stangl, Esha Kothari, Suyog D Jain, Tom Yeh, Kristen Grauman, and Danna Gurari. 2018. BrowseWithMe: An Online Clothes Shopping Assistant for People with Visual Impairments. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 107--118.",
      "doi": "10.1145/3234695.3236337"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research techniques. Sage publications Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Kenneth Tran, Xiaodong He, Lei Zhang, Jian Sun, Cornelia Carapcea, Chris Thrasher, Chris Buehler, and Chris Sienkiewicz. 2016. Rich image captioning in the wild. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops. 49--56.",
      "doi": ""
    },
    {
      "text": "Oriol Vinyals, Alexander Toshev, Samy Bengio, and Dumitru Erhan. 2015. Show and tell: A neural image caption generator. In Proceedings of the IEEE conference on computer vision and pattern recognition. 3156--3164.",
      "doi": ""
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How blind people interact with visual content on social networking services. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1584--1595.",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Alexandra Vtyurina and Adam Fourney. 2018. Exploring the role of conversational cues in guided task support with virtual assistants. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 208.",
      "doi": "10.1145/3173574.3173782"
    },
    {
      "text": "Web Accessibility Initiative (WAI) W3C. Date. Web Content Accessibility Guidelines (WCAG) Overview. https://www.w3.org/WAI/standards-guidelines/wcag/. (No Date). (Accessed on 06/20/2019).",
      "doi": ""
    },
    {
      "text": "Qi Wu, Peng Wang, Chunhua Shen, Anthony Dick, and Anton van den Hengel. 2016. Ask Me Anything: Free-Form Visual Question Answering Based on Knowledge from External Sources. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4622--4630.",
      "doi": ""
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic alt-text: Computer-generated image descriptions for blind users on a social network service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 1180--1192.",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2017. The Effect of Computer-Generated Descriptions on Photo-Sharing Experiences of People With Visual Impairments. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 121.",
      "doi": "10.1145/3134756"
    },
    {
      "text": "Yu Zhong, Walter S Lasecki, Erin Brady, and Jeffrey P Bigham. 2015. Regionspeak: Quick comprehensive spatial descriptions of complex images for blind users. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2353--2362.",
      "doi": "10.1145/2702123.2702437"
    }
  ]
}