{
  "doi": "10.1145/3313831.3376821",
  "title": "Telewalk: Towards Free and Endless Walking in Room-Scale Virtual Reality",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2020,
  "badges": [],
  "abstract": "Natural navigation in VR is challenging due to spatial limitations. While Teleportation enables navigation within very small physical spaces and without causing motion sickness symptoms, it may reduce the feeling of presence and spacial awareness. Redirected walking (RDW), in contrast, allows users to naturally walk while staying inside a finite, but still very large, physical space. We present Telewalk, a novel locomotion approach that combines curvature and translation gains known from RDW research in a perceivable way. This combination enables Telewalk to be applied even within a physical space of 3m x 3m. Utilizing the head rotation as input device enables directional changes without any physical turns to keep the user always on an optimal circular path inside the real world while freely walking inside the virtual one. In a user study we found that even though motion sickness susceptible participants reported respective symptoms, Telewalk did result in stronger feelings of presence and immersion and was seen as more natural then Teleportation.",
  "authors": [
    {
      "name": "Michael Rietzler",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458666657",
      "orcid": "0000-0003-2599-8308"
    },
    {
      "name": "Martin Deubzer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526547",
      "orcid": "missing"
    },
    {
      "name": "Thomas Dreja",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659077482",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Niels H. Bakker, Peter O. Passenier, and Peter J. Werkhoven. 2003. Effects of Head-Slaved Navigation and the Use of Teleports on Spatial Orientation in Virtual Environments. Human factors 45, 1 (2003), 160--169.",
      "doi": ""
    },
    {
      "text": "Costas Boletsis. 2017. The New Era of Virtual Reality Locomotion: A Systematic Literature Review of Techniques and a Proposed Typology. Multimodal Technologies and Interaction 1, 4 (2017), 24.",
      "doi": ""
    },
    {
      "text": "Laroussi Bouguila and Makoto Sato. 2002. Virtual locomotion system for largescale virtual environment. In Virtual Reality, 2002. Proceedings. IEEE. IEEE, 291--292.",
      "doi": ""
    },
    {
      "text": "Laroussi Bouguila, Makoto Sato, Shoichi Hasegawa, Hashimoto Naoki, Naoki Matsumoto, Atsushi Toyama, Jelel Ezzine, and Dalel Maghrebi. 2002. A new stepin-place locomotion interface for virtual environment with large display system. In ACM SIGGRAPH 2002 conference abstracts and applications. ACM, 63--63.",
      "doi": "10.1145/1242073.1242098"
    },
    {
      "text": "Doug A. Bowman, Elizabeth T. Davis, Larry F. Hodges, and Albert N. Badre. 1999. Maintaining Spatial Orientation During Travel in an Immersive Virtual Environment. Presence: Teleoperators and Virtual Environments 8, 6 (1999), 618--631.",
      "doi": "10.1162/105474699566521"
    },
    {
      "text": "Doug A Bowman, David Koller, and Larry F Hodges. 1997. Travel in immersive virtual environments: An evaluation of viewpoint motion control techniques. In Virtual Reality Annual International Symposium, 1997., IEEE 1997. IEEE, 45--52.",
      "doi": "10.5555/523977.836072"
    },
    {
      "text": "Evren Bozgeyikli, Andrew Raij, Srinivas Katkoori, and Rajiv Dubey. 2016. Point & teleport locomotion technique for virtual reality. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, 205--216.",
      "doi": "10.1145/2967934.2968105"
    },
    {
      "text": "L. BÃ? ulling, N. Stein, F. Steinicke, and M. Lappe. 2019. Shrinking Circles: Adaptation to Increased Curvature Gain in Redirected Walking. IEEE Transactions on Visualization and Computer Graphics 25, 5 (May 2019), 2032--2039. DOI: http://dx.doi.org/10.1109/TVCG.2019.2899228",
      "doi": ""
    },
    {
      "text": "Chris G Christou and Poppy Aristidou. 2017. Steering Versus Teleport Locomotion for Head Mounted Displays. In International Conference on Augmented Reality, Virtual Reality and Computer Graphics. Springer, 431--446.",
      "doi": ""
    },
    {
      "text": "Daniel Cliburn, Stacy Rilea, David Parsons, Prakash Surya, and Jessica Semler. 2009. The Effects of Teleportation on Recollection of the Structure of a Virtual World. In Proceedings of Joint Virtual Reality Eurographics Conference on Virtual Environments (JVRC). 117--120.",
      "doi": "10.5555/2383947.2383973"
    },
    {
      "text": "John F Golding. 2006. Predicting individual differences in motion sickness susceptibility by questionnaire. Personality and Individual differences 41, 2 (2006), 237--248.",
      "doi": ""
    },
    {
      "text": "Timofey Grechkin, Jerald Thomas, Mahdi Azmandian, Mark Bolas, and Evan Suma. 2016. Revisiting detection thresholds for redirected walking: Combining translation and curvature gains. In Proceedings of the ACM Symposium on Applied Perception. ACM, 113--120.",
      "doi": "10.1145/2931002.2931018"
    },
    {
      "text": "Eric Hodgson and Eric Bachmann. 2013a. Comparing four approaches to generalized redirected walking: Simulation and live user data. IEEE transactions on visualization and computer graphics 19, 4 (2013), 634--643.",
      "doi": "10.1109/TVCG.2013.28"
    },
    {
      "text": "E. Hodgson and E. Bachmann. 2013b. Comparing Four Approaches to Generalized Redirected Walking: Simulation and Live User Data. IEEE Transactions on Visualization and Computer Graphics 19, 4 (April 2013), 634--643. DOI: http://dx.doi.org/10.1109/TVCG.2013.28",
      "doi": "10.1109/TVCG.2013.28"
    },
    {
      "text": "Eric Hodgson, Eric Bachmann, and David Waller. 2011. Redirected walking to explore virtual environments: Assessing the potential for spatial interference. ACM Transactions on Applied Perception (TAP) 8, 4 (2011), 22.",
      "doi": ""
    },
    {
      "text": "Victoria Interrante, Brian Ries, and Lee Anderson. 2007. Seven league boots: A new metaphor for augmented locomotion through moderately large scale immersive virtual environments. In null. IEEE, null.",
      "doi": ""
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Hiroyuki Fukushima, and Haruo Noma. 2005. Circulafloor [locomotion interface]. IEEE Computer Graphics and Applications 25, 1 (2005), 64--67.",
      "doi": "10.1109/MCG.2005.5"
    },
    {
      "text": "Jason Jerald, Tabitha Peck, Frank Steinicke, and Mary Whitton. 2008. Sensitivity to scene motion for phases of head yaws. In Proceedings of the 5th symposium on Applied perception in graphics and visualization. ACM, 155--162.",
      "doi": "10.1145/1394281.1394310"
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203--220.",
      "doi": ""
    },
    {
      "text": "Eike Langbehn, Tobias Eichler, Sobin Ghose, Kai von Luck, Gerd Bruder, and Frank Steinicke. 2015. Evaluation of an omnidirectional walking-in-place user interface with virtual locomotion speed scaled by forward leaning angle. In Proceedings of the GI Workshop on Virtual and Augmented Reality (GI VR/AR). 149--160.",
      "doi": ""
    },
    {
      "text": "Joseph J LaViola Jr. 2000. A discussion of cybersickness in virtual environments. ACM SIGCHI Bulletin 32, 1 (2000), 47--56.",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "JJ-W Lin, Henry Been-Lirn Duh, Donald E Parker, Habib Abi-Rached, and Thomas A Furness. 2002. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. In Virtual Reality, 2002. Proceedings. IEEE. IEEE, 164--171.",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Mahdi Nabiyouni, Ayshwarya Saktheeswaran, Doug A Bowman, and Ambika Karanth. 2015. Comparing the performance of natural, semi-natural, and nonnatural locomotion techniques in virtual reality. In 3D User Interfaces (3DUI), 2015 IEEE Symposium on. IEEE, 3--10.",
      "doi": ""
    },
    {
      "text": "Christian T Neth, Jan L Souman, David Engel, Uwe Kloos, Heinrich H Bulthoff, and Betty J Mohler. 2012. Velocity-dependent dynamic curvature gain for redirected walking. IEEE transactions on visualization and computer graphics 18, 7 (2012), 1041--1052.",
      "doi": "10.1109/TVCG.2011.275"
    },
    {
      "text": "Niels Christian Nilsson, Stefania Serafin, and Rolf Nordahl. 2016. Walking in place through virtual worlds. In International Conference on Human-Computer Interaction. Springer, 37--48.",
      "doi": "10.1007/978-3-319-39516-6_4"
    },
    {
      "text": "Tabitha C Peck, Henry Fuchs, and Mary C Whitton. 2011. An evaluation of navigational ability comparing Redirected Free Exploration with Distractors to Walking-in-Place and joystick locomotio interfaces. In Virtual Reality Conference (VR), 2011 IEEE. IEEE, 55--62.",
      "doi": "10.1109/VR.2011.5759437"
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C Whitton. 2001. Redirected walking. In Proceedings of EUROGRAPHICS, Vol. 9. Citeseer, 105--106.",
      "doi": "10.5555/1124097"
    },
    {
      "text": "James T Reason and Joseph John Brand. 1975. Motion sickness. Academic press.",
      "doi": ""
    },
    {
      "text": "M. Rietzler, J. Gugenheimer, T. Hirzle, M. Deubzer, E. Langbehn, and E. Rukzio. 2018. Rethinking Redirected Walking: On the Use of Curvature Gains Beyond Perceptual Limitations and Revisiting Bending Gains. In 2018 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). 115--122. DOI: http://dx.doi.org/10.1109/ISMAR.2018.00041",
      "doi": ""
    },
    {
      "text": "Roy A Ruddle and Simon Lessels. 2006. For efficient navigational search, humans require full physical movement, but not a rich visual scene. Psychological Science 17, 6 (2006), 460--465.",
      "doi": ""
    },
    {
      "text": "R. A. Ruddle, E. P. Volkova, and H. H. Bülthoff. 2010. Walking improves your cognitive map in environments that are large-scale and large in extent. ACM Transactions on Computer-Human Interaction 18, 2 (2010), 10:1--10:22.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of presence in virtual environments. Presence: Teleoperators & Virtual Environments 3, 2 (1994), 130--144.",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Misha Sra, Xuhai Xu, Aske Mottelson, and Pattie Maes. 2018. VMotion: Designing a Seamless Walking Experience in VR. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 59--70.",
      "doi": "10.1145/3196709.3196792"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of detection thresholds for redirected walking techniques. IEEE transactions on visualization and computer graphics 16, 1 (2010), 17--27.",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Frank Steinicke, Yon Visell, Jennifer Campos, and Anatole Lécuyer. 2013. Human walking in virtual environments. Springer.",
      "doi": "10.5555/2531388"
    },
    {
      "text": "Evan A Suma, Gerd Bruder, Frank Steinicke, David M Krum, and Mark Bolas. 2012. A taxonomy for deploying redirection techniques in immersive virtual environments. In Virtual Reality Short Papers and Posters (VRW), 2012 IEEE. IEEE, 43--46.",
      "doi": "10.1109/VR.2012.6180877"
    },
    {
      "text": "Qi Sun, Anjul Patney, Li-Yi Wei, Omer Shapira, Jingwan Lu, Paul Asente, Suwen Zhu, Morgan Mcguire, David Luebke, and Arie Kaufman. 2018. Towards virtual reality infinite walking: dynamic saccadic redirection. ACM Transactions on Graphics (TOG) 37, 4 (2018), 67.",
      "doi": "10.1145/3197517.3201294"
    },
    {
      "text": "Martin Usoh, Kevin Arthur, Mary C Whitton, Rui Bastos, Anthony Steed, Mel Slater, and Frederick P Brooks Jr. 1999. Walking&gt; walking-in-place&gt; flying, in virtual environments. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques. ACM Press/Addison-Wesley Publishing Co., 359--364.",
      "doi": ""
    },
    {
      "text": "Preston Tunnell Wilson, William Kalescky, Ansel MacLaughlin, and Betsy Williams. 2016. VR locomotion: walking&gt; walking in place&gt; arm swinging. In Proceedings of the 15th ACM SIGGRAPH Conference on Virtual-Reality Continuum and Its Applications in Industry-Volume 1. ACM, 243--249.",
      "doi": "10.1145/3013971.3014010"
    }
  ]
}