{
  "doi": "10.1145/3313831.3376473",
  "title": "Crowdsourcing in China: Exploring the Work Experiences of Solo Crowdworkers and Crowdfarm Workers",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Recent research highlights the potential of crowdsourcing in China. Yet very few studies explore the workplace context and experiences of Chinese crowdworkers. Those that do, focus mainly on the work experiences of solo crowdworkers but do not deal with issues pertaining to the substantial amount of people working in 'crowdfarms'. This article addresses this gap as one of its primary concerns. Drawing on a study that involves 48 participants, our research explores, compares and contrasts the work experiences of solo crowdworkers to those of crowdfarm workers. Our findings illustrate that the work experiences and context of the solo workers and crowdfarm workers are substantially different, with regards to their motivations, the ways they engage with crowdsourcing, the tasks they work on, and the crowdsourcing platforms they utilize. Overall, our study contributes to furthering the understandings on the work experiences of crowdworkers in China.",
  "authors": [
    {
      "name": "Yihong Wang",
      "institution": "Xi'an Jiaotong-Liverpool University, Suzhou, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659482133",
      "orcid": "0000-0002-3278-6410"
    },
    {
      "name": "Konstantinos Papangelis",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-99659162915/rel-imgonly/kp.jpg",
      "acmid": "99659162915",
      "orcid": "missing"
    },
    {
      "name": "Michael Saker",
      "institution": "City University London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659492997",
      "orcid": "0000-0002-7414-2840"
    },
    {
      "name": "Ioanna Lykourentzou",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363604838",
      "orcid": "0000-0002-4243-4128"
    },
    {
      "name": "Alan Chamberlain",
      "institution": "University of Nottingham, Nottingham, Nottinghamshire, United Kingdom",
      "img": "/do/10.1145/contrib-81100146006/rel-imgonly/ac.jpg",
      "acmid": "81100146006",
      "orcid": "0000-0002-2122-8077"
    },
    {
      "name": "Vassilis-Javed Khan",
      "institution": "Eindhoven University of Technology, Eindhoven, Noord Brabant, Netherlands",
      "img": "/do/10.1145/contrib-81371592633/rel-imgonly/javed-khan-opt.jpg",
      "acmid": "81371592633",
      "orcid": "0000-0002-7333-981X"
    }
  ],
  "references": [
    {
      "text": "Simon à Campo, Vasssilis-Javed Khan, Konstantinos Papangelis, and Panos Markopoulos. 2019. Community heuristics for user interface evaluation of crowdsourcing platforms. Future Generation Computer Systems 95 (June 2019), 775--789. http://dx.doi.org/10.1016/j.future.2018.02.028",
      "doi": ""
    },
    {
      "text": "Janine Berg. 2016. Income security in the on-demand economy: findings and policy lessons from a survey of crowdworkers. Technical Report 994906483402676. International Labour Organization. https://ideas.repec.org/p/ilo/ilowps/994906483402676.html",
      "doi": ""
    },
    {
      "text": "Daren C. Brabham. 2009. Crowdsourcing the Public Participation Process for Planning Projects. Planning Theory 8, 3 (Aug. 2009), 242--262. http://dx.doi.org/10.1177/1473095209104824",
      "doi": ""
    },
    {
      "text": "Alice M. Brawley and Cynthia L.S. Pury. 2016. Work experiences on MTurk: Job satisfaction, turnover, and information sharing. 54 (2016), 531--546. http://dx.doi.org/10.1016/j.chb.2015.08.031",
      "doi": ""
    },
    {
      "text": "Peter J. Buckley, Jeremy Clegg, and Hui Tan. 2006. Cultural awareness in knowledge transfer to China-The role of guanxi and mianzi. Journal of World Business 41, 3 (Sept. 2006), 275--288. http://dx.doi.org/10.1016/j.jwb.2006.01.008",
      "doi": ""
    },
    {
      "text": "Zhang Chi and Hong Seock-Jin. Guanxi Culture. In The China Business Model. Elsevier, 19--40. http://dx.doi.org/10.1016/B978-0-08--100750--1.00002--4",
      "doi": ""
    },
    {
      "text": "Chao-Min Chiu, Ting-Peng Liang, and Efraim Turban. 2014. What can crowdsourcing do for decision support? Decision Support Systems 65 (2014), 40--49. http://dx.doi.org/10.1016/j.dss.2014.05.010",
      "doi": "10.1016/j.dss.2014.05.010"
    },
    {
      "text": "David Corsar, Peter Edwards, John Nelson, Chris Baillie, Konstantinos Papangelis, and Nagendra Velaga. 2017. Linking open data and the crowd for real-time passenger information. Journal of Web Semantics 43 (March 2017), 18--24. http://dx.doi.org/10.1016/j.websem.2017.02.002",
      "doi": "10.1016/j.websem.2017.02.002"
    },
    {
      "text": "E. Demerouti, A. B. Bakker, F. Nachreiner, and W. B. Schaufeli. 2001. The job demands-resources model of burnout. The Journal of Applied Psychology 86, 3 (June 2001), 499--512.",
      "doi": ""
    },
    {
      "text": "Xuefei Deng and K.D. Joshi. 2013. Is crowdsourcing a source of worker empowerment or exploitation? understanding crowd workers' perceptions of crowdsourcing career. International Conference on Information Systems (ICIS 2013): Reshaping Society Through Information Systems Design 3 (01 2013), 2350--2359.",
      "doi": ""
    },
    {
      "text": "Djellel Eddine Difallah, Gianluca Demartini, and Philippe Cudré-Mauroux. 2012. Mechanical Cheat: Spamming Schemes and Adversarial Techniques on Crowdsourcing Platforms. (2012), 26--30.",
      "doi": ""
    },
    {
      "text": "Mira Dontcheva, Robert R. Morris, Joel R. Brandt, and Elizabeth M. Gerber. 2014. Combining Crowdsourcing and Learning to Improve Engagement and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3379--3388. http://dx.doi.org/10.1145/2556288.2557217 event-place: Toronto, Ontario, Canada.",
      "doi": ""
    },
    {
      "text": "David Durward and Ivo Blohm. 2018. Understanding Job Satisfaction of Crowd Workers: An Empirical Analysis of Its Determinants and Effects. (2018), 13.",
      "doi": ""
    },
    {
      "text": "Enrique Estellés-Arolas and Fernando González-Ladrón-de Guevara. 2012. Towards an integrated crowdsourcing definition. Journal of Information Science 38, 2 (April 2012), 189--200. http://dx.doi.org/10.1177/0165551512437638",
      "doi": "10.1177/0165551512437638"
    },
    {
      "text": "Xiaoliang Feng and Minxue Huang. 2013. Research on the Solvers' Participating Motivation of Crowdsourcing. 4 (2013). http://dx.doi.org/10.14134/j.cnki.cn33--1336/f.2013.04.009",
      "doi": ""
    },
    {
      "text": "Mary L Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The Crowd is a Collaborative Network. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW '16. ACM Press, San Francisco, California, USA, 134--147. http://dx.doi.org/10.1145/2818048.2819942",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "Neha Gupta, David Martin, Benjamin V. Hanrahan, and Jacki O'Neill. Turk-Life in India. In Proceedings of the 18th International Conference on Supporting Group Work - GROUP '14 (2014). ACM Press, 1--11. http://dx.doi.org/10.1145/2660398.2660403",
      "doi": ""
    },
    {
      "text": "Barbara Haddon. 2009. Work-Life Balance: In Search Of Effective Strategies. (2009), 22.",
      "doi": ""
    },
    {
      "text": "Jeff Howe. 2006. The Rise of Crowdsourcing. Wired (June 2006). https://www.wired.com/2006/06/crowds/",
      "doi": ""
    },
    {
      "text": "Ying Hu, Yingjie Wang, Yingshu Li, and Xiangrong Tong. 2018. An Incentive Mechanism in Mobile Crowdsourcing Based on Multi-Attribute Reverse Auctions. 18, 10 (2018). http://dx.doi.org/10.3390/s18103453",
      "doi": ""
    },
    {
      "text": "Panagiotis G. Ipeirotis. 2010a. Analyzing the Amazon Mechanical Turk marketplace. 17, 2 (2010), 16. http://dx.doi.org/10.1145/1869086.1869094",
      "doi": ""
    },
    {
      "text": "Panagiotis G. Ipeirotis. 2010b. Demographics of Mechanical Turk. SSRN Scholarly Paper ID 1585030. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=1585030",
      "doi": ""
    },
    {
      "text": "E. Jeffrey Hill, Joseph G. Grzywacz, Sarah Allen, Victoria L. Blanchard, Christina Matz-Costa, Sandee Shulkin, and Marcie Pitt-Catsouphes. 2008. Defining and conceptualizing workplace flexibility. 11, 2 (2008), 149--163. http://dx.doi.org/10.1080/13668800802024678",
      "doi": ""
    },
    {
      "text": "Ling Jiang, Christian Wagner, and Bonnie Nardi. 2015. Not Just in it for the Money: A Qualitative Investigation of Workers' Perceived Benefits of Micro-task Crowdsourcing. In 2015 48th Hawaii International Conference on System Sciences. IEEE, 773--782. http://dx.doi.org/10.1109/HICSS.2015.98",
      "doi": "10.1109/HICSS.2015.98"
    },
    {
      "text": "N Kaufmann, Thimo Schulze, and Daniel Veit. 2011. More than fun and money. Worker Motivation in Crowdsourcing--A Study on Mechanical Turk. Proceedings of the Seventeenth Americas Conference on Information Systems (01 2011).",
      "doi": ""
    },
    {
      "text": "Vassillis-Javed Khan, Konstantinos Papangelis, Ioanna Lykourentzou, and Panos Markopoulos (Eds.). 2019. Macrotask Crowdsourcing: Engaging the Crowds to Address Complex Problems. Springer International Publishing, Cham. http://dx.doi.org/10.1007/978--3-030--12334--5",
      "doi": ""
    },
    {
      "text": "Shashank Khanna, Aishwarya Ratan, James Davis, and William Thies. 2010. Evaluating and Improving the Usability of Mechanical Turk for Low-income Workers in India. In Proceedings of the First ACM Symposium on Computing for Development (ACM DEV '10). ACM, New York, NY, USA, 12:1--12:10. http://dx.doi.org/10.1145/1926180.1926195 event-place: London, United Kingdom.",
      "doi": "10.1145/1926180.1926195"
    },
    {
      "text": "Sara Kingsley, Mary-Louise Gray, and Siddharth Suri. 2014. Monopsony and the Crowd: Labor for Lemons? (2014). http://dx.doi.org/10.2139/ssrn.3257857",
      "doi": ""
    },
    {
      "text": "Eike A Langenberg. Guanxi and business strategy: theory and implications for multinational companies in China ; with 4 tables. Physica-Verl. OCLC: 845163084.",
      "doi": ""
    },
    {
      "text": "Laura Lascau, Sandy J. J. Gould, Anna L. Cox, Elizaveta Karmannaya, and Duncan P. Brumby. Monotasking or Multitasking: Designing for Crowdworkers' Preferences. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19 (2019). ACM Press, 1--14. http://dx.doi.org/10.1145/3290605.3300649",
      "doi": "10.1145/3290605.3300649"
    },
    {
      "text": "Ming Li, Jian Weng, Anjia Yang, Wei Lu, Yue Zhang, Lin Hou, Jia-Nan Liu, Yang Xiang, and Robert H. Deng. 2019. CrowdBC: A Blockchain-Based Decentralized Framework for Crowdsourcing. 30, 6 (2019), 1251--1266. http://dx.doi.org/10.1109/TPDS.2018.2881735",
      "doi": ""
    },
    {
      "text": "Xiangfeng Liu. 2008. SME Development in China: A Policy Perspective on SME Industrial Clustering. 5 (2008), 37--68. http://www.eria.org/SME%20Development%20in%20China_A%20Policy%20Perspective%20on%20SME%20Industrial%20Clustering.pdf",
      "doi": ""
    },
    {
      "text": "Yadong Luo. Guanxi and Business. Asia-Pacific Business Series, Vol. 1. WORLD SCIENTIFIC. http://dx.doi.org/10.1142/4258",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Vassillis-Javed Khan, Konstantinos Papangelis, and Panos Markopoulos. 2019. Macrotask Crowdsourcing: An Integrated Definition. Springer International Publishing, Cham, 1--13. http://dx.doi.org/10.1007/978--3-030--12334--5_1",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Jeffrey P. Bigham, Robin Brewer, Jonathan Bragg, Anand Kulkarni, Jessie Li, and Saiph Savage. 2017. Subcontracting Microwork. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, 1867--1876. http://dx.doi.org/10.1145/3025453.3025687",
      "doi": ""
    },
    {
      "text": "National Bureau of Statistics of China. 2018. Annual data 2018. http://data.stats.gov.cn/english/easyquery.htm?cn=C01. (2018). Accessed June 4, 2019.",
      "doi": ""
    },
    {
      "text": "Jacki O'Neill and David Martin. 2013. Relationship-Based Business Process Crowdsourcing? In Human-Computer Interaction -- INTERACT 2013, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.). Vol. 8120. Springer Berlin Heidelberg, 429--446. http://dx.doi.org/10.1007/978--3--642--40498--6_33",
      "doi": ""
    },
    {
      "text": "Konstantinos Papangelis, Alan Chamberlain, and Hai-Ning Liang. 2016. New directions for preserving intangible cultural heritage through the use of mobile technologies. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct - MobileHCI textquotesingle16. ACM Press. http://dx.doi.org/10.1145/2957265.2962643",
      "doi": "10.1145/2957265.2962643"
    },
    {
      "text": "Seung Ho Park and Yadong Luo. 2001. Guanxi and organizational dynamics: organizational networking in Chinese firms. 22, 5 (2001), 455--477. http://dx.doi.org/10.1002/smj.167",
      "doi": ""
    },
    {
      "text": "Marion K. Poetz and Martin Schreier. 2012. The Value of Crowdsourcing: Can Users Really Compete with Professionals in Generating New Product Ideas? Journal of Product Innovation Management 29, 2 (2012), 245--256. http://dx.doi.org/10.1111/j.1540--5885.2011.00893.x",
      "doi": ""
    },
    {
      "text": "Lisa Posch, Arnim Bleier, Fabian Flöck, and Markus Strohmaier. 2018a. Characterizing the Global Crowd Workforce: A Cross-Country Comparison of Crowdworker Demographics. arXiv preprint arXiv:1812.05948 (2018).",
      "doi": ""
    },
    {
      "text": "Lisa Posch, Arnim Bleier, Fabian Flöck, and Markus Strohmaier. 2018b. A Cross-Country Comparison of Crowdworker Motivations. (2018). http://arxiv.org/abs/1711.03115",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. Who are the crowdworkers?: shifting demographics in mechanical turk. In Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA '10 (2010). ACM Press, 2863. http://dx.doi.org/10.1145/1753846.1753873",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Gordon Schmidt and William Jettinghoff. 2016. Using Amazon Mechanical Turk and other compensated crowdsourcing sites. 59 (2016). http://dx.doi.org/10.1016/j.bushor.2016.02.004",
      "doi": ""
    },
    {
      "text": "Dora Scholarios and Abigail Marks. 2004. Work?life balance and the software worker. 14 (2004), 54--74. http://dx.doi.org/10.1111/j.1748--8583.2004.tb00119.x",
      "doi": ""
    },
    {
      "text": "Huo Shengping and Zhao Wei. 2019. The Effect Mechanism of Witkey' s Creative Self - Efficacy on Their Innovation Behavior on the Network Innovation Platform. 35, 2 (2019), 34--46. http://dx.doi.org/10.1207/s15327906mbr0102_10",
      "doi": ""
    },
    {
      "text": "Shengping Huo, Zheng Chijian, and Hailang Tu. 2017. On the Research of Intelligent Coupling and Coordination between Employers and Witkey on the Crowd Innovation Network Platform. Journal of Xiangtan University 41, 1 (Jan. 2017), 94--101. http://dx.doi.org/0.13715/j.cnki.jxupss.2017.01.017",
      "doi": ""
    },
    {
      "text": "Lei Shi. 2012. Factors Affecting Solvers to Participate in Crowdsourcing: An Empirical Study from China. (2012).",
      "doi": ""
    },
    {
      "text": "M. Six Silberman, Joel Ross, Lilly Irani, and Bill Tomlinson. Sellers' problems in human computation markets. In Proceedings of the ACM SIGKDD Workshop on Human Computation - HCOMP '10 (2010). ACM Press, 18. http://dx.doi.org/10.1145/1837885.1837891",
      "doi": ""
    },
    {
      "text": "Rannie Teodoro, Pinar Ozturk, Mor Naaman, Winter Mason, and Janne Lindqvist. The motivations and experiences of the on-demand mobile workforce. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14 (2014). ACM Press, 236--247. http://dx.doi.org/10.1145/2531602.2531680",
      "doi": "10.1145/2531602.2531680"
    },
    {
      "text": "W. To and L. S. L. Lai. 2015. Crowdsourcing in China: Opportunities and Concerns. 17, 3 (2015), 53--59. http://dx.doi.org/10.1109/MITP.2015.47",
      "doi": ""
    },
    {
      "text": "UNSW Australia Business School, Daniel Schlagwein, Niels Bjorn-Andersen, and Copenhagen Business School. 2014. Organizational Learning with Crowdsourcing: The Revelatory Case of LEGO. Journal of the Association for Information Systems 15, 11 (Nov. 2014), 754--778. http://dx.doi.org/10.17705/1jais.00380",
      "doi": ""
    },
    {
      "text": "Florian Waldner and Marion Poetz. 2015. Crowdsourcing Business Model Innovation.",
      "doi": ""
    },
    {
      "text": "Liwei Wang, Jian Tian, and Yi Xu. 2015. Research on the Influential Factor and Their Mechanism of Online Innovation Contest Performance. (2015). http://kreader.cnki.net/Kreader/CatalogViewPage.aspx?dbCode=cdmd&filename=1016736048.",
      "doi": ""
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Ioanna Lykourentzou, and Vassilis-Javed Khan. 2019. The Changing Landscape of Crowdsourcing in China: From Individual Crowdworkers to Crowdfarms. The 22nd ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '19) (2019). http://dx.doi.org/10.1145/3311957.3359469",
      "doi": "10.1145/3311957.3359469"
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Ioanna Lykourentzou, Hai-Ning Liang, Irwyn Sadien, Evangelia Demerouti, and Vassilis-Javed Khan. 2020. In Their Shoes: A Structured Analysis of Job Demands, Resources, Work Experiences, and Platform Commitment of Crowdworkers in China. 4 (2020), 40. http://dx.doi.org/10.1145/3375187",
      "doi": ""
    },
    {
      "text": "Meng-Han Wu and Alexander J Quinn. 2017. Confusing the Crowd: Task Instruction Quality on Amazon Mechanical Turk. (2017), 10.",
      "doi": ""
    },
    {
      "text": "Bingqing Xia. 2014. Labour in the Chinese internet industries. (2014), 263. https://pdfs.semanticscholar.org/ea5d/ce14122bfd061f652fc7dce523d4bb7b928d.pdf",
      "doi": ""
    },
    {
      "text": "Li Xiaotian. 2020. The 996 ICU Movement in China: Changing Employment Relations and Labour Agency in the Tech Industry. (2020). http://bit.ly/2Rs5oOm",
      "doi": ""
    },
    {
      "text": "Xinhua. 2015. China to explore new models to boost innovation, entrepreneurship - Business - Chinadaily. com.cn. (Sept. 2015). http://www.chinadaily.com.cn/business/2015-09/26/content_21989332.htm",
      "doi": ""
    },
    {
      "text": "Fang Yang. 2011. The Importance of Guanxi to Multinational Companies in China. 7, 7 (2011), p163. http://dx.doi.org/10.5539/ass.v7n7p163",
      "doi": ""
    },
    {
      "text": "Jiang Yang, Lada A Adamic, and Mark S Ackerman. 2008. Crowdsourcing and Knowledge Sharing: Strategic User Behavior on Taskcn. (2008), 10.",
      "doi": ""
    },
    {
      "text": "Xun Yang. 2016. China highlights 'crowd platforms' to encourage entrepreneurship and innovation - People's Daily Online. (March 2016). http://en.people.cn/n3/2016/0309/c98649--9027466.html",
      "doi": ""
    },
    {
      "text": "Teng Ye, Sangseok You, and Lionel P Robert Jr. 2017. When Does More Money Work? Examining the Role of Perceived Fair- ness in Pay on the Performance Quality of Crowdworkers. (2017), 10.",
      "doi": ""
    },
    {
      "text": "Sharon Zhou, Melissa Valentine, and Michael S. Bernstein. In Search of the Dream Team: Temporally Constrained Multi-Armed Bandits for Identifying Effective Team Structures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (2018). ACM Press, 1--13. http://dx.doi.org/10.1145/3173574.3173682",
      "doi": "10.1145/3173574.3173682"
    }
  ]
}