{
  "doi": "10.1145/3313831.3376854",
  "title": "Online Privacy Heuristics that Predict Information Disclosure",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2020,
  "badges": [],
  "abstract": "Online users' attitudes toward privacy are context-dependent. Studies show that contextual cues are quite influential in motivating users to disclose personal information. Increasingly, these cues are embedded in the interface, but the mechanisms of their effects (e.g., unprofessional design contributing to more disclosure) are not fully understood. We posit that each cue triggers a specific \"cognitive heuristic\" that provides a rationale for decision-making. Using a national survey (N = 786) that elicited participants' disclosure intentions in common online scenarios, we identify 12 distinct heuristics relevant to privacy, and demonstrate that they are systematically associated with information disclosure. Data show that those with a higher accessibility to a given heuristic are more likely to disclose information. Design implications for protection of online privacy and security are discussed.",
  "authors": [
    {
      "name": "S. Shyam Sundar",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    },
    {
      "name": "Jinyoung Kim",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659122495",
      "orcid": "missing"
    },
    {
      "name": "Mary Beth Rosson",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "Maria D. Molina",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366224",
      "orcid": "0000-0001-8115-6303"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for privacy and security: Understanding and assisting users' choices online. ACM Comput. Surv. 50, 3, Article 44(Aug. 2017). https://doi.org/10.1145/3054926.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science. 347, 6221 (2015), 509--514. https://doi.org/10.1126/science.aaa1465.",
      "doi": ""
    },
    {
      "text": "Idris Adjerid, Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2013. Sleights of privacy: framing, disclosures, and the limits of transparency. In Proceedings of the Ninth Symposium on usable privacy and security (SOUPS'13). ACM Press, New York, NY, 1--11.",
      "doi": "10.1145/2501604.2501613"
    },
    {
      "text": "Sinan Aral. 2014. The problem with online ratings. MIT Sloan Management Review. 55, 2 (2014), 47--52.",
      "doi": ""
    },
    {
      "text": "Saras Bellur and S. Shyam Sundar. 2014. How can we tell when a heuristic has been used? Design and analysis strategies for capturing the operation of heuristics. Communication Methods and Measures. 8, 2 (2014), 116--137. https://doi.org/10.1080/19312458.2014.903390.",
      "doi": ""
    },
    {
      "text": "Lars I. Bergkvist and John R. Rossiter. 2007. The predictive validity of multiple-item versus single-item measures of the same constructs. Journal of Marketing Research. 44, 2 (2007), 175--184. https://doi.org/10.1509/jmkr.44.2.175.",
      "doi": ""
    },
    {
      "text": "Tom Buchanan, Carina Paine, Adam N. Joinson, and Ulf-Dietrich Reips, U. 2007. Development of measures of online privacy concern and protection for use on the Internet. Journal of the American Society for Information Science and Technology. 58, 2 (2007), 157--165. https://doi.org/10.1002/asi.20459.",
      "doi": "10.5555/1190275.1190279"
    },
    {
      "text": "Shelly Chaiken. 1980. Heuristic versus systematic information processing and the use of source versus message cues in persuasion. Journal of Personality and Social Psychology. 39, 5 (1980), 752--766. https://doi.org/10.1037/0022--3514.39.5.752.",
      "doi": ""
    },
    {
      "text": "Alan L. Chaikin, Valerian J. Derlega, and Sarah J. Miller. 1976. Effects of room environment on self-disclosure in a counseling analogue. Journal of Counseling Psychology. 23, 5 (1976), 479--481. https://doi.org/10.1037/0022-0167.23.5.479.",
      "doi": ""
    },
    {
      "text": "Serena Chen and Shelly Chaiken. 1999. The heuristic-systematic model in its broader context. Dual-process theories in social psychology. Guilford Press, New York, NY. 73--96.",
      "doi": ""
    },
    {
      "text": "Erika Chin, Adrienne P. Felt, Vyas Sekar, and David Wagner, D. 2012. Measuring user confidence in smartphone security and privacy. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS'12). ACM Press, New York, NY, 1--16.",
      "doi": "10.1145/2335356.2335358"
    },
    {
      "text": "Robert B. Cialdini. 2001. Harnessing the science of persuasion. Harvard Business Review 79, 9 (2001), 72--72.",
      "doi": ""
    },
    {
      "text": "Richard H. Cutler. 1995. Distributed presence and community in cyberspace. Interpersonal Communication and Technology: A Journal for the 21st Century 13, 2 (April 1995), 12--32.",
      "doi": ""
    },
    {
      "text": "Tobias Dienlin and Miriam J. Metzger. 2016. An extended privacy calculus model for SNSS: analyzing self-disclosure and self-withdrawal in a representative U.S. sample. Journal of Computer-Mediated Communication. 21, 5 (Aug. 2016), 368--383. https://doi.org/10.1111/jcc4.12163.",
      "doi": "10.1111/jcc4.12163"
    },
    {
      "text": "Susan T. Fiske and Shelley E. Taylor. 1991. Social cognition. McGraw-Hill., New York, NY.",
      "doi": ""
    },
    {
      "text": "Brian J. Fogg, Cathy Soohoo, David R. Danielson, Leslie Marable, Julianne Stanford, and Ellen R. Tauber, E. 2003. How do users evaluate the credibility of Web sites? A study with over 2,500 participants. In Proceedings of the 2003 conference on designing for user experiences (DUX' 03). ACM Press, New York, NY, 1--15.",
      "doi": ""
    },
    {
      "text": "W. Wayne Fu. 2012. Selecting online videos from graphics, text, and view counts: The moderation of popularity bandwagons. Journal of Computer-Mediated Communication. 18, 1 (2012), 46--61. https://doi.org/10.1111/j.1083--6101.2012.01593.x.",
      "doi": "10.1111/j.1083-6101.2012.01593.x"
    },
    {
      "text": "Rebecca, D. Heino, Nicole B. Ellison, and Jennifer L. Gibbs. 2010. Relationshopping: Investigating the market metaphor in online dating. Journal of Social and Personal Relationships. 27, 4 (June 2010), 427--447. https://doi.org/10.1177/0265407510361614.",
      "doi": ""
    },
    {
      "text": "Leslie K. John, Alessandro Acquisti, and George Loewenstein. 2011. Strangers on a plane: Context-dependent willingness to divulge sensitive information. Journal of Consumer Research. 37, 5 (Feb. 2011), 858--873. https://doi.org/10.1086/656423.",
      "doi": ""
    },
    {
      "text": "Jinyoung Kim and Andrew Gambino. 2016. Do we trust the crowd or information system? Effects of personalization and bandwagon cues on users' attitudes and behavioral intentions toward a restaurant recommendation website. Computers in Human Behavior. 65, 369--379.",
      "doi": "10.1016/j.chb.2016.08.038"
    },
    {
      "text": "Predrag V. Klasnja, Sunny Consolvo, Jaeyeon Jung, Benjamin M. Greenstein, Louis LeGrand, Pauline Powledge, and David Wetherall. 2009. When I am on wi-fi, I am fearless: Privacy concerns & practices in everyday wi-fi use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI' 09). ACM Press, New York, NY, 1993--2002.",
      "doi": "10.1145/1518701.1519004"
    },
    {
      "text": "Paul, A. M. Van Lange, Mark van Vugt, Ree M. Meertens, and Rob A. C. Ruiter. 1998. A social dilemma analysis of commuting preferences: The roles of social value orientation and trust. Journal of Applied Social Psychology. 28, 9 (Jul. 1998), 796--820. https://doi.org/10.1111/j.1559--1816.1998.tb01732.x.",
      "doi": ""
    },
    {
      "text": "Robert S. Laufer and Maxine Wolfe. 1977. Privacy as a concept and a social issue: A multidimensional developmental theory. Journal of Social Issues 33, 3 (Jul. 1977), 22--42. https://doi.org/10.1111/j.1540--4560.1977.tb01880.x.",
      "doi": ""
    },
    {
      "text": "Yin Lu, Bernard Tan, and Kai-Lung Hui. 2004. Inducing customers to disclose personal information to Internet businesses with social adjustment benefits. In Proceedings of the International Conference on Information Systems (ICIS '04), 571--582.",
      "doi": ""
    },
    {
      "text": "Sampada Marathe, S. Shyam Sundar, Marije Nije Bijvank, Henriette van Vugt, and Jolanda Veldhuis. 2007. Who are these power users anyway? Building a psychological profile. Paper presented at the 57th annual conference of the International Communication Association.",
      "doi": ""
    },
    {
      "text": "Nadia Olivero and Peter Lunt. 2004. Privacy versus willingness to disclose in e-commerce exchanges: The effect of risk awareness on the relative role of trust and control. Journal of Economic Psychology. 25, 2 (April 2004), 243--262. https://doi.org/10.1016/S0167--4870(02)00172--1",
      "doi": ""
    },
    {
      "text": "Sandra Petronio. 2002. Boundaries of privacy: dialectics of disclosure. Suny Press, Albany, NY.",
      "doi": ""
    },
    {
      "text": "Johann Schrammel, Christina Köffel, and Manfred Tscheligi, M. 2009. How much do you tell? Information disclosure behaviour in different types of online communities. In Proceedings of the fourth international conference on communities and technologies (C&T' 09). ACM Press, New York, NY, 275--284.",
      "doi": ""
    },
    {
      "text": "Chengcheng Shao, Giovanni L. Ciampaglia, Onur Varol, Kai-Cheng Yang, Alessandro Flammini, and Filippo Menczer. 2018. The spread of low-credibility content by social bots. Nature communications. 9, 1 (2018), 4787--9. https://doi.org/10.1038/s41467-018-06930--7.",
      "doi": ""
    },
    {
      "text": "Steven J. Sherman and Eric Corty. 1984. Cognitive heuristics. Handbook of social cognition. Lawrence Erlbaum Associates Publishers, Manhwah, NJ, 189--286.",
      "doi": ""
    },
    {
      "text": "Fred Stutzman, Ralph Gross, and Alessandro Acquisti. 2012. Silent listeners: The evolution of privacy and disclosure on Facebook. Journal of Privacy and Confidentiality. 4, 2, 7--41. https://doi.org/10.29012/jpc.v4i2.620.DOI:https://doi.org/10.29012/jpc.v4i2.620.",
      "doi": ""
    },
    {
      "text": "S. Shyam Sundar, Qian Xu, and Anne Oeldorf-Hirsch. 2009. Authority vs. peer: how interface cues influence users. In Proceedings of CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI' 09), 4231--4236.",
      "doi": "10.1145/1520340.1520645"
    },
    {
      "text": "S. Shyam Sundar. 2008. The MAIN model: A heuristic approach to understanding technology effects on credibility. Digital media, youth, and credibility. The MIT Press, Cambridge, MA, 72--100.",
      "doi": ""
    },
    {
      "text": "S. Shyam Sundar, Haiyan Jia, T. Franklin Waddell, and Yan Huang. 2015. Toward a theory of interactive media effects (TIME): Four models for explaining how interface features affect user psychology. The handbook of the psychology of communication technology. S.S. Sundar, ed. Wiley Blackwell. 47--86.",
      "doi": ""
    },
    {
      "text": "Jennifer M. Urban, Chris J. Hoofnagle, and Su Li. 2012. Mobile phones and privacy. BCLT Research Paper Series (Jul. 2102).",
      "doi": ""
    },
    {
      "text": "Brenda K. Wiederhold. 2014. The role of psychology in enhancing cybersecurity. Cyberpsychology, Behavior, and Social Networking. 17, 3 (Mar. 2014), 131--132. https://doi.org/10.1089/cyber.2014.1502.",
      "doi": ""
    }
  ]
}