{
  "doi": "10.1145/3313831.3376769",
  "title": "Improving the Usability and UX of the Swiss Internet Voting Interface",
  "published": "2020-04-23",
  "proctitle": "CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2020,
  "badges": [],
  "abstract": "Up to 20% of residential votes and up to 70% of absentee votes in Switzerland are cast online. The Swiss system aims to provide individual verifiability by different verification codes. The voters have to carry out verification on their own, making the usability and UX of the interface of great importance. To improve the usability, we first performed an evaluation with 12 human-computer interaction experts to uncover usability weaknesses of the Swiss Internet voting interface. Based on the experts' findings, related work, and an exploratory user study with 36 participants, we propose a redesign that we evaluated in a user study with 49 participants. Our study confirmed that the redesign indeed improves the detection of incorrect votes by 33% and increases the trust and understanding of the voters. Our studies furthermore contribute important lessons for designing verifiable e-voting systems in general.",
  "tags": [
    "usability evaluation",
    "individual verifiability",
    "e-voting"
  ],
  "authors": [
    {
      "name": "Karola Marky",
      "institution": "Technische Universität Darmstadt & Keio University, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659225101",
      "orcid": "missing"
    },
    {
      "name": "Verena Zimmermann",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659297138",
      "orcid": "missing"
    },
    {
      "name": "Markus Funk",
      "institution": "Technische Universität Darmstadt & Nuance Communications, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458955757",
      "orcid": "missing"
    },
    {
      "name": "Jörg Daubert",
      "institution": "Philipps-Universität, Marburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658954573",
      "orcid": "missing"
    },
    {
      "name": "Kira Bleck",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527973",
      "orcid": "missing"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    }
  ],
  "references": [
    {
      "text": "Claudia Z. Acemyan, Philip Kortum, Michael D. Byrne, and Dan S. Wallach. 2014. Usability of Voter Verifiable, End-to-End Voting Systems: Baseline Data for Helios, Prêt à Voter, and Scantegrity II. The USENIX Journal of Election Technology and Systems (JETS) 2, 3 (2014), 26--56.",
      "doi": ""
    },
    {
      "text": "B. Adida. 2006. Advances in Cryptographic Voting Systems. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Ben Adida. 2008. Helios: Web-based Open-Audit Voting. In Proceedings of the USENIX Security Symposium, Vol. 17. USENIX Association, Berkeley, CA, USA, 335--348.",
      "doi": ""
    },
    {
      "text": "Jordi Puiggalí Allepuz and Sandra Guasch Castelló. 2012. Cast-as-Intended Verification in Norway. In Proceedings of the International Conference on Electronic Voting (EVOTE). Lecture Notes in Informatics (LNI), Gesellschaft für Informatik, Bonn, Germany, 49--63.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. Journal of Usability Studies 4, 3 (2009), 114--123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Josh Benaloh. 2006. Simple Verifiable Elections. In Proceedings of the Electronic Voting Technology Workshop (EVT). USENIX Association, Berkeley, CA, USA, Article 5, 10 pages.",
      "doi": ""
    },
    {
      "text": "Josh Benaloh. 2007. Ballot Casting Assurance via Voter-Initiated Poll Station Auditing. In Proceedings of the Electronic Voting Technology Workshop (EVT). USENIX Association, Berkeley, CA, USA, Article 14, 8 pages.",
      "doi": ""
    },
    {
      "text": "Ted Boren and Judith Ramey. 2000. Thinking Aloud: Reconciling Theory and Practice. IEEE transactions on professional communication 43, 3 (2000), 261--278. DOI: http://dx.doi.org/10.1109/47.867942",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS - A Quick and Dirty Usability Scale. Usability Evaluation in Industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Nikos Chondros, Bingsheng Zhang, Thomas Zacharias, Panos Diamantopoulos, Stathis Maneas, Christos Patsonakis, Alex Delis, Aggelos Kiayias, and Mema Roussopoulos. 2016. D-DEMOS: A Distributed, End-to-End Verifiable, Internet Voting System. In Proceedings of the International Conference on Distributed Computing Systems (ICDCS). IEEE, Piscataway, NJ, USA, 711--720. DOI: http://dx.doi.org/10.1109/ICDCS.2016.56",
      "doi": ""
    },
    {
      "text": "Véronique Cortier, David Galindo, and Mathieu Turuani. 2018. A Formal Analysis of the Neuchatel e-Voting Protocol. In Proceedings of the IEEE European Symposium on Security and Privacy (S&P) ((Euro S&P)). 430--442. DOI: http://dx.doi.org/10.1109/EuroSP.2018.00037",
      "doi": ""
    },
    {
      "text": "Véronique Cortier and Ben Smyth. 2013. Attacking and Fixing Helios: An Analysis of Ballot Secrecy. Journal of Computer Security 21, 1 (2013), 89--148. DOI: http://dx.doi.org/10.1109/CSF.2011.27",
      "doi": "10.5555/2595846.2595849"
    },
    {
      "text": "Sergej Dechand, Dominik Schürmann, Karoline Busse, Yasemin Acar, Sascha Fahl, and Matthew Smith. 2016. An Empirical Study of Textual Key-Fingerprint Representations. In Proceedings of the USENIX Security Symposium. USENIX Association, Berkeley, CA, USA, 193--208.",
      "doi": ""
    },
    {
      "text": "Verena Distler, Marie-Laure Zollinger, Carine Lallemand, Peter B. Roenne, Peter Y. A. Ryan, and Vincent Koenig. 2019. Security - Visible, Yet Unseen?. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, NY, NY, USA, Article 605, 13 pages. DOI: http://dx.doi.org/10.1145/3290605.3300835",
      "doi": "10.1145/3290605.3300835"
    },
    {
      "text": "Swiss Post E-Voting. 2019. Swiss Post. https://www.evoting.ch/. (2019). [Online; accessed: 18-January-2019].",
      "doi": ""
    },
    {
      "text": "Programme Office eGovernment Switzerland. 2019. Electronic Voting. https://www.egovernment.ch/en/umsetzung/schwerpunktplan/vote-electronique/. (2019). [Online; accessed: 18-January-2019].",
      "doi": ""
    },
    {
      "text": "Uwe Flick. 2014. An Introduction to Qualitative Research (5 ed.). Sage, London.",
      "doi": ""
    },
    {
      "text": "Kristin Skeide Fuglerud and Till Halbach Røssvoll. 2012. An Evaluation of Web-Based Voting Usability and Accessibility. Universal Access in the Information Society 11, 4 (2012), 359--373. DOI: http://dx.doi.org/10.1007/s10209-011-0253--9",
      "doi": "10.1007/s10209-011-0253-9"
    },
    {
      "text": "David Galindo, Sandra Guasch, and Jordi Puiggalí. 2015. Neuchâtel's Cast-as-Intended Verification Mechanism. In Proceedings of the International Conference on E-Voting and Identity (VoteID). Springer-Verlag, Cham, Switzerland, 3--18. DOI: http://dx.doi.org/10.1007/978--3--319--22270--7_1",
      "doi": "10.1007/978-3-319-22270-7_1"
    },
    {
      "text": "Ed Gerck, C. Andrew Neff, Ronald L. Rivest, Aviel D. Rubin, and Moti Yung. 2001. The Business of Electronic Voting. In Proceedings of the International Conference on Financial Cryptography (FC). Springer-Verlag, Cham, Switzerland, 243--268. DOI: http://dx.doi.org/10.1007/3--540--46088--8_21",
      "doi": ""
    },
    {
      "text": "Micha Germann and Uwe Serdült. 2014. Internet Voting for Expatriates: The Swiss Case. JeDEM-eJournal of eDemocracy and Open Government 6, 2 (2014), 197--215. DOI: http://dx.doi.org/10.29379/jedem.v6i2.302",
      "doi": ""
    },
    {
      "text": "Kristian Gjøsteen. 2011. The Norwegian Internet Voting Protocol. In Proceedings of the International Conference on E-Voting and Identity (VoteID). Springer-Verlag, Cham, Switzerland, 1--18. DOI: http://dx.doi.org/10.1007/978--3--642--32747--6_1",
      "doi": ""
    },
    {
      "text": "Gurchetan S. Grewal, Mark D. Ryan, Liqun Chen, and Michael R. Clarkson. 2015. Du-Vote: Remote Electronic Voting with Untrusted Computers. In Proceedings of the Computer Security Foundations Symposium (CSF). IEEE, Piscataway, NJ, USA, 155--169. DOI: http://dx.doi.org/10.1109/CSF.2015.18",
      "doi": ""
    },
    {
      "text": "Sandra Guasch Castelló. 2016. Individual Verifiability in Electronic Voting. Ph.D. Dissertation. Universitat Politécnica de Catalunya.",
      "doi": ""
    },
    {
      "text": "Rolf Haenni, Reto E. Koenig, and Eric Dubuis. 2016. Cast-as-Intended Verification in Electronic Elections based on Oblivious Transfer. In Proceedings of the International Joint Conference on Electronic Voting. Springer-Verlag, Cham, Switzerland, 73--91. DOI: http://dx.doi.org/10.1007/978--3--319--52240--1_5",
      "doi": ""
    },
    {
      "text": "Rolf Haenni, Reto E. Koenig, Philipp Locher, and Eric Dubuis. 2017. CHVote System Specification. Cryptology ePrint Archive, Report 2017/325, (2017), 1--325. https://eprint.iacr.org/2017/325.pdf.",
      "doi": ""
    },
    {
      "text": "J. Alex Halderman and Vanessa Teague. 2015. The New South Wales iVote System: Security Failures and Verification Flaws in a Live Online Election. In Proceedings of the International Conference on E-voting and Identity (VoteID). Springer, Cham, Switzerland, 35--53. DOI: http://dx.doi.org/10.1007/978--3--319--22270--7_3",
      "doi": "10.1007/978-3-319-22270-7_3"
    },
    {
      "text": "Sven Heiberg and Jan Willemson. 2014. Verifiable Internet Voting in Estonia. In Proceedings of the International Conference on Electronic Voting: Verifying the Vote (EVOTE). IEEE, Piscataway, NJ, USA, 1--8. DOI: http://dx.doi.org/10.1109/EVOTE.2014.7001135",
      "doi": ""
    },
    {
      "text": "Jörg Helbach and Jörg Schwenk. 2007. Secure Internet Voting with Code Sheets. In Proceedings of the International Conference on E-Voting and Identity (VoteID). Springer-Verlag, Cham, Switzerland, 166--177. DOI: http://dx.doi.org/10.1007/978--3--540--77493--8_15",
      "doi": ""
    },
    {
      "text": "Hsu-Chun Hsiao, Yue-Hsun Lin, Ahren Studer, Cassandra Studer, King-Hang Wang, Hiroaki Kikuchi, Adrian Perrig, Hung-Min Sun, and Bo-Yin Yang. 2009. A Study of User-Friendly Hash Comparison Schemes. In Proceedings of the Annual Computer Security Applications Conference (ACSAC). IEEE, Piscataway, NJ, USA, 105--114. DOI: http://dx.doi.org/10.1109/ACSAC.2009.20",
      "doi": "10.1109/ACSAC.2009.20"
    },
    {
      "text": "Ding-Long Huang, Pei-Luen Patrick Rau, Gavriel Salvendy, Fei Gao, and Jia Zhou. 2011. Factors Affecting Perception of Information Security and Their Impacts on IT Adoption and Security Practices. International Journal of Human-Computer Studies 69, 12 (2011), 870--883. DOI: http://dx.doi.org/10.1016/j.ijhcs.2011.07.007",
      "doi": "10.1016/j.ijhcs.2011.07.007"
    },
    {
      "text": "Fatih Karayumak, Michaela Kauer, M. Maina Olembo, Tobias Volk, and Melanie Volkamer. 2011a. User Study of the Improved Helios Voting System Interfaces. In Proceedings of the 1st Workshop on Socio-Technical Aspects in Security and Trust (STAST). IEEE, Piscataway, NJ, USA, 37--44. DOI: http://dx.doi.org/10.1109/STAST.2011.6059254",
      "doi": ""
    },
    {
      "text": "Fatih Karayumak, Maina M. Olembo, Michaela Kauer, and Melanie Volkamer. 2011b. Usability Analysis of Helios-An Open Source Verifiable Remote Electronic Voting System. In Proceedings of the Conference on Electronic Voting Technology/Workshop on Trustworthy Elections (EVT/WOTE). USENIX Association, Berkeley, CA, USA, Article 5, 16 pages. DOI: http://dx.doi.org/10.5445/IR/1000081859",
      "doi": ""
    },
    {
      "text": "Shahram Khazaei and Douglas Wikström. 2017. Return Code Schemes for Electronic Voting Systems. In Proceedings of the International Joint Conference on Electronic Voting (E-Vote-ID). Springer-Verlag, Cham, Switzerland, 198--209. DOI: http://dx.doi.org/10.1007/978--3--319--68687--5_12",
      "doi": ""
    },
    {
      "text": "Aggelos Kiayias, Thomas Zacharias, and Bingsheng Zhang. 2015. End-to-End Verifiable Elections in the Standard Model. In Proceedings of the Annual International Conference on the Theory and Applications of Cryptographic Techniques (EUROCRYPT). Springer-Verlag, Cham, Switzerland, 468--498. DOI: http://dx.doi.org/10.1007/978--3--662--46803--6_16",
      "doi": ""
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In Proceedings of the HCI and Usability for Education and Work. DOI: http://dx.doi.org/10.1007/978--3--540--89350--9_6",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Karola Marky, Oksana Kulyk, Karen Renaud, and Melanie Volkamer. 2018b. What Did I Really Vote For? On the Usability of Verifiable E-Voting Schemes. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, NY, NY, USA, Article 176, 13 pages. DOI: http://dx.doi.org/10.1145/3173574.3173750",
      "doi": "10.1145/3173574.3173750"
    },
    {
      "text": "Karola Marky, Oksana Kulyk, and Melanie Volkamer. 2018a. Comparative Usability Evaluation of Cast-as-Intended Verification Approaches in Internet Voting. In Proceedings of the \"SICHERHEIT 2018\". Lecture Notes in Informatics (LNI), Gesellschaft für Informatik, Bonn, Germany, 197--208. DOI: http://dx.doi.org/10.18420/sicherheit2018_15",
      "doi": ""
    },
    {
      "text": "Karola Marky, Marie-Laure Zollinger, Markus Funk, Peter Ryan, and Max Mühlhäuser. 2019. How to Assess the Usability Metrics of E-Voting Schemes. In Proceeding of the 4th Workshop on Advances in Secure Electronic Voting (VOTING '19). Springer.",
      "doi": ""
    },
    {
      "text": "Víctor Mateu and Magda Valls. 2017. Cast as Intended Verifiability for Mixed Array Ballots. In Proceedings of the International Conference on Electronic Government and the Information Systems Perspective (EGOVIS). Springer-Verlag, Cham, Switzerland, 206--218. DOI: http://dx.doi.org/10.1007/978--3--319--64248--2_15",
      "doi": ""
    },
    {
      "text": "Stephan Neumann, Maina M. Olembo, Karen Renaud, and Melanie Volkamer. 2014. Helios Verification: To Alleviate, or to Nominate: Is That the Question, or Shall we Have Both?. In Proceedings of the International Conference on Electronic Government and the Information Systems Perspective (EGOVIS). Springer-Verlag, Cham, Switzerland, 246--260. DOI: http://dx.doi.org/10.1007/978--3--319--10178--1_20",
      "doi": ""
    },
    {
      "text": "Federal Chancellery of Switzerland. 2018. Federal Chancellery Ordinance on Electronic Voting (VEleS). https://www.bk.admin.ch/dam/bk/de/dokumente/pore/ Federal_Chancellery_Ordinance_on_Electronic_Voting_ V2.0_July_2018.pdf.download.pdf/Federal_Chancellery_ Ordinance_on_Electronic_Voting_V2.0_July_2018.pdf. (2018). [Online; accessed: 18-January-2019].",
      "doi": ""
    },
    {
      "text": "POLYAS GmbH. 2019. Overview of Polyas Costumers. POLYASKundenÜbersicht. (2019). [Online; accessed: 26-December-2019].",
      "doi": ""
    },
    {
      "text": "Paulo Realpe-Muñoz, César A. Collazos, Julio Hurtado, Toni Granollers, Jaime Muñoz-Arteaga, and Jaime Velasco-Medina. 2017. Eye Tracking-Based Behavioral Study of Users Using E-Voting Systems. Computer Standards & Interfaces 55 (2017), 182--195. DOI: http://dx.doi.org/10.1016/j.csi.2017.08.004",
      "doi": "10.1016/j.csi.2017.08.004"
    },
    {
      "text": "Peter Y. A. Ryan, Peter B. Rønne, and Vincenzo Iovino. 2016. Selene: Voting With Transparent Verifiability and Coercion-Mitigation. In Proceedings of the International Conference on Financial Cryptography and Data Security (FC). Springer, 176--192. DOI: http://dx.doi.org/10.1007/978--3--662--53357--4_12",
      "doi": ""
    },
    {
      "text": "Ted Selker, Elizabeth Rosenzweig, and Anna Pandolfo. 2006. A Methodology for Testing Voting Systems. Journal of Usability Studies 2, 1 (Nov. 2006), 7--21. http://dl.acm.org/citation.cfm?id=2835536.2835538",
      "doi": ""
    },
    {
      "text": "U. Serdült, M. Germann, F. Mendez, A. Portenier, and C. Wellig. 2015. Fifteen Years of Internet Voting in Switzerland [History, Governance and Use]. In Proceedings of the Second International Conference on eDemocracy & eGovernment (ICEDEG). IEEE, Piscataway, NJ, USA, 126--132. DOI: http://dx.doi.org/10.1109/ICEDEG.2015.7114482",
      "doi": ""
    },
    {
      "text": "Drew Springall, Travis Finkenauer, Zakir Durumeric, Jason Kitcat, Harri Hursti, Margaret MacAlpine, and J. Alex Halderman. 2014. Security Analysis of the Estonian Internet Voting System. In Proceedings of the Conference on Computer and Communications Security (CCS '14). ACM, NY, NY, USA, 703--715. DOI: http://dx.doi.org/10.1145/2660267.2660315",
      "doi": ""
    },
    {
      "text": "Tim Storer and Ishbel Duncan. 2004. Polsterless Remote Electronic Voting. Journal of E-government 1, 1 (2004), 75--103. DOI: http://dx.doi.org/10.1300/J399v01n01_07",
      "doi": ""
    },
    {
      "text": "Tim Storer, Linda Little, and Ishbel Duncan. 2006. An Exploratory Study of Voter Attitudes Towards a Pollsterless Remote Voting System. In Pre-Proceedings of the IAVoSS Workshop on Trustworthy Elections (WOTE). 77--86.",
      "doi": ""
    },
    {
      "text": "Joshua Tan, Lujo Bauer, Joseph Bonneau, Lorrie Faith Cranor, Jeremy Thomas, and Blase Ur. 2017. Can Unicorns Help Users Compare Crypto Key Fingerprints?. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA, 3787--3798. DOI: http://dx.doi.org/10.1145/3025453.3025733",
      "doi": "10.1145/3025453.3025733"
    },
    {
      "text": "Janna-Lynn Weber and Urs Hengartner. 2009. Usability Study of the Open Audit Voting System Helios. http://www.jannaweber.com/wp-content/uploads/2009/09/ 858Helios.pdf. (2009). [Online; accessed: 12-June-2018].",
      "doi": ""
    },
    {
      "text": "Scott Wolchok, Eric Wustrow, J. Alex Halderman, Hari K. Prasad, Arun Kankipati, Sai Krishna Sakhamuri, Vasavya Yagati, and Rop Gonggrijp. 2010. Security Analysis of India's Electronic Voting Machines. In Proceedings of the Conference on Computer and Communications Security (CCS '10). ACM, NY, NY, USA, 1--14. DOI: http://dx.doi.org/10.1145/1866307.1866309",
      "doi": "10.1145/1866307.1866309"
    },
    {
      "text": "Scott Wolchok, Eric Wustrow, Dawn Isabel, and J. Alex Halderman. 2012. Attacking the Washington, DC Internet Voting System. In Proceedings of the International Conference on Financial Cryptography and Data Security (FC). Springer-Verlag, Cham, Switzerland, 114--128. DOI: http://dx.doi.org/10.1007/978--3--642--32946--3_10",
      "doi": ""
    }
  ]
}