{
  "doi": "10.1145/2470654.2481370",
  "title": "The secret life of a persona: when the personal becomes private",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2677-2686",
  "year": 2013,
  "badges": [],
  "abstract": "Some organizations fail to involve users in systems development due to a widespread organization, high workload or secrecy issues. A remedy against this situation could be the persona method in which users and main stakeholders as represented as fictitious characters. Personas help eliciting user needs and requirements, facilitate design choices and are an overall communication aid where users cannot be present. An important part of the persona method, as portrayed in literature, is the personal details that make the personas trustworthy and alive. In this paper we present two cases in which personas have been developed and used, but where the personal is scarce or even non-existent because of a dispersed organisation, the organisational culture and secrecy issues. The paper describes how the personas were developed, used and received and how the method was altered in order to work in these special circumstances.",
  "tags": [
    "systems development",
    "persona",
    "user centred design",
    "stakeholder",
    "secrecy issues"
  ],
  "authors": [
    {
      "name": "Elina Eriksson",
      "institution": "KTH - Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385596087",
      "orcid": "missing"
    },
    {
      "name": "Henrik Artman",
      "institution": "Swedish Defence Research Agency (FOI), Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100652509",
      "orcid": "missing"
    },
    {
      "name": "Anna Swartling",
      "institution": "Scania CV AB, Södertälje, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557241856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blomquist, Å. and Arvola, M. Personas in action: ethnography in an interaction design team. In Proc. NordiCHI'02, ACM, (2002), 197--200.  ",
      "doi": "10.1145/572020.572044"
    },
    {
      "text": "Burr, B. Social Constructionism. Routledge, London, 2003.",
      "doi": ""
    },
    {
      "text": "Chapman, C. N. and Milham, R. P. The personas' new clothes: methodological and practical arguments against a popular method. In Proc. The Human Factors and Ergonomics Society Annual Meeting, SAGE Publications, (2006), 634--636.",
      "doi": ""
    },
    {
      "text": "Cooper, A. The inmates are running the asylum. SAMS publishing, USA, 2004. ",
      "doi": "10.5555/984201"
    },
    {
      "text": "Faily, S. and Fléchais, I. The secret lives of assumptions: Developing and refining assumption personas for secure system design. In Proc. HCSE2010, Springer, (2010), 111--118. ",
      "doi": "10.5555/1939212.1939224"
    },
    {
      "text": "Floyd, I. R., Jones, M. C., and Twidale, M. B. Resolving incommensurable debates: a preliminary identification of persona kinds, attributes, and characteristics. Artifact, 2, 1 (2008), 12--26.",
      "doi": ""
    },
    {
      "text": "Foucault, M. Technologies of the self: A seminar with Michel Foucault, in L. H. Matin, H. Gutman, and P. H. Hutton (Ed.) Tavistock: London. (1988).",
      "doi": ""
    },
    {
      "text": "Friess, E. Personas and decision making in the design process: an ethnographic case study. In Proc. CHI2012, ACM, (2012), 1209--1218.  ",
      "doi": "10.1145/2207676.2208572"
    },
    {
      "text": "Gergen, K. J. An invitation to social construction. Sage Publications, London, 1999.",
      "doi": ""
    },
    {
      "text": "Greenbaum, J. and Kyng, M. Design at work: cooperative design of computer systems. Lawrence Erlbaum Associates, Inc. Mahwah, NJ, USA, 1992. ",
      "doi": "10.5555/125470"
    },
    {
      "text": "Grudin, J. Why personas work: The psychological evidence, in J. Pruitt and A. T. (Ed.) The persona lifecycle: Keeping people in mind during product design Morgan Kaufman Publisher: San Francisco. (2006), 642--664.",
      "doi": ""
    },
    {
      "text": "Grudin, J. and Pruitt, J. Personas, participatory design and product development: An infrastructure for engagement. In Proc. PDC'02, (2002), 144--161.",
      "doi": ""
    },
    {
      "text": "Guðjónsdóttir, R. Personas and Scenarios in Use, Doctoral thesis, KTH, Sweden, 2010.",
      "doi": ""
    },
    {
      "text": "Kujala, S. User involvement: a review of the benefits and challenges. Behaviour & Information Technology, 22, 1 (2003), 1--16.",
      "doi": ""
    },
    {
      "text": "Markensten, E. and Artman, H. Procuring a usable system using unemployed personas. In Proc. NordiCHI'04, (2004), 13--22.  ",
      "doi": "10.1145/1028014.1028017"
    },
    {
      "text": "Matthews, T., Judge, T., and Whittaker, S. How do designers and user experience professionals actually perceive and use personas? In Proc. CHI2012, ACM, (2012), 1219--1228.  ",
      "doi": "10.1145/2207676.2208573"
    },
    {
      "text": "Matthews, T., Whittaker, S., Moran, T., and Yuen, S. Collaboration personas: A new approach to designing workplace collaboration tools. In Proc. CHI2011, ACM, (2011), 2247--2256.  ",
      "doi": "10.1145/1978942.1979272"
    },
    {
      "text": "Nielsen, L. From user to character: an investigation into user-descriptions in scenarios. In Proc. DIS2002, ACM, (2002), 99--104.  ",
      "doi": "10.1145/778712.778729"
    },
    {
      "text": "Portigal, S. Persona non grata. Interactions, 15, 1 (2008), 72--73.  ",
      "doi": "10.1145/1330526.1330550"
    },
    {
      "text": "Potter, J. and Wetherell, M. Discourse and social psychology: Beyond attitudes and behaviour. Sage Publications, London, 1987.",
      "doi": ""
    },
    {
      "text": "Pruitt, J. and Grudin, J. Personas: practice and theory. In Proc. DUX '03 ACM, (2003), 1--15.  ",
      "doi": "10.1145/997078.997089"
    },
    {
      "text": "Quesenbery, W. Storytelling and narrative, in J. Pruitt and A. T. (Ed.) Persona Lifecycle: Keeping People in Mind Troughout Product Design. Morgan Kaufman Publishers: San Francisco. (2006), 520--554.",
      "doi": ""
    },
    {
      "text": "Rönkkö, K., Hellman, M., Kilander, B., and Dittrich, Y. Personas is not applicable: local remedies interpreted in a wider context. In Proc. PDC'04, ACM, (2004), 112--120.  ",
      "doi": "10.1145/1011870.1011884"
    },
    {
      "text": "Sinha, R. Persona development for information-rich domains. In Proc. CHI EA '03, ACM, (2003), 830--831.  ",
      "doi": "10.1145/765891.766017"
    },
    {
      "text": "Swartling, A. The Good Person in Information Systems Development: A Reflexive Investigation of HCI in the Acquisition Process, Doctoral thesis, KTH, Sweden, 2008.",
      "doi": ""
    },
    {
      "text": "Tariq, M. A., Brynielsson, J., and Artman, H. Framing the Attacker in Organized Cybercrime. In Proc. EISIC 2012, IEEE, (2012), 30--37.  ",
      "doi": "10.1109/EISIC.2012.48"
    },
    {
      "text": "Turner, P. and Turner, S. Is stereotyping inevitable when designing with personas? Design Studies, 32, 1 (2011), 30--44.",
      "doi": ""
    }
  ]
}