{
  "doi": "10.1145/2470654.2466164",
  "title": "Designing action-based exergames for children with cerebral palsy",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1261-1270",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Children with cerebral palsy (CP) want to play fast-paced action-oriented videogames similar to those played by their peers without motor disabilities. This is particularly true of exergames, whose physically-active gameplay matches the fast pace of action games. But disabilities resulting from CP can make it difficult to play action games. Guidelines for developing games for people with motor disabilities steer away from high-paced action, including recommendations to avoid the need for time-sensitive actions and to keep game pace slow. Through a year-long participatory design process with children with CP, we have discovered that it is in fact possible to develop action-oriented exergames for children with CP at level III on the Gross Motor Function Classification Scale. We followed up the design process with an eight-week home trial, in which we found the games to be playable and enjoyable. In this paper, we discuss the design of these games, and present a set of design recommendations for how to achieve both action-orientation and playability.",
  "authors": [
    {
      "name": "Hamilton A. Hernandez",
      "institution": "Queen's University, Kingston, Canada",
      "img": "/do/10.1145/contrib-81502767484/rel-imgonly/hamiltonhernandezformal.png",
      "acmid": "81502767484",
      "orcid": "missing"
    },
    {
      "name": "Zi Ye",
      "institution": "Queen's University, Kingston, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460648026",
      "orcid": "missing"
    },
    {
      "name": "T.C. Nicholas Graham",
      "institution": "Queen's University, Kingston, Canada",
      "img": "/do/10.1145/contrib-81392599672/rel-imgonly/81392599672.png",
      "acmid": "81392599672",
      "orcid": "0000-0001-6723-1936"
    },
    {
      "name": "Darcy Fehlings",
      "institution": "Holland Bloorview Kids Rehabilitation Hospital & University of Toronto, Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502802691",
      "orcid": "missing"
    },
    {
      "name": "Lauren Switzer",
      "institution": "Holland Bloorview Kids Rehabilitation Hospital, Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502804128",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, E. Fundamentals of Game Design. New Riders, (2010). ",
      "doi": "10.5555/1804572"
    },
    {
      "text": "Anderson, F., Annett, M., F. Bischof, W., and Bischof, W.F. Lean on Wii: physical rehabilitation with virtual reality Wii peripherals. Studies in Health Technology and Informatics 154; (2010), 229--234.",
      "doi": ""
    },
    {
      "text": "Burke, J.W., McNeill, M.D.J., Charles, D.K., Morrow, P.J., Crosbie, J.H., and McDonough, S.M. Optimising engagement for stroke rehabilitation using serious games. The Visual Computer 25, 12 (2009), 1085--1099.  ",
      "doi": "10.1007/s00371-009-0387-4"
    },
    {
      "text": "Chen, Y.-P., Kang, L.-J., Chuang, T.-Y., Doong, J.-L., Lee, S.-J., et al., Use of virtual reality to improve upperextremity control in children with cerebral palsy: a single-subject design. Physical Therapy 87, 11 (2007), 1441--1457.",
      "doi": ""
    },
    {
      "text": "Deutsch, J.E., Borbely, M., Filler, J., Huhn, K., Guarrera, P., and Guarrera-Bowlby, P. Use of a lowcost, commercially available gaming console (Wii) for rehabilitation of an adolescent with cerebral palsy. Physical Therapy 88, 10 (2008), 1196--1207.",
      "doi": ""
    },
    {
      "text": "Eliasson, A.-C., Krumlinde-Sundholm, L., Rösblad, B., Beckung, E., Arner, M., et al., The Manual Ability Classification System (MACS) for children with cerebral palsy: scale development and evidence of validity and reliability. Developmental Medicine and Child Neurology 48, 7 (2006), 549--54.",
      "doi": ""
    },
    {
      "text": "Ellis, B., Ford-Williams, G., Graham, L., Grammenos, D., Hamilton, I., et al., Game Accessibility Guidelines. 2012. http://www.gameaccessibilityguidelines.com/.",
      "doi": ""
    },
    {
      "text": "GARv2--25. Game Accessibility: Recommendations. 2012. http://www.gameaccessibility.de/.",
      "doi": ""
    },
    {
      "text": "Garvey, M.A, Giannetti, M.L., Alter, K.E., and Lum, P.S. Cerebral palsy: new approaches to therapy. Current neurology and neuroscience reports 7, 2 (2007), 147--55.",
      "doi": ""
    },
    {
      "text": "Geurts, L., Vanden Abeele, V., Husson, J., Windey, F., Van Overveldt, M., et al., Digital games for physical therapy: fulfilling the need for calibration and adaptation. Proc. of TEI'11, ACM (2011), 117--124.  ",
      "doi": "10.1145/1935701.1935725"
    },
    {
      "text": "Grammenos, D., Savidis, A., and Stephanidis, C. Designing universally accessible games. Computers in Entertainment 7, 1 (2009), 8:1--8:29.  ",
      "doi": "10.1145/1486508.1486516"
    },
    {
      "text": "Hanna, S.E., Rosenbaum, P.L., Bartlett, D.J., Palisano, R.J., Walter, S.D., et al., Stability and decline in gross motor function among children and youth with cerebral palsy aged 2 to 21 years. Developmental Medicine and Child Neurology, (2009), 295--302.",
      "doi": ""
    },
    {
      "text": "Hernandez, H.A., Graham, T.C.N., Fehlings, D., Switzer, L., Ye, Z., et al., Design of an exergaming station for children with cerebral palsy. Proc of CHI'12, ACM Press (2012), 2619--2628.  ",
      "doi": "10.1145/2207676.2208652"
    },
    {
      "text": "Kirby, R.S., Wingate, M.S., Van Naarden Braun, K., et al., Prevalence and functioning of children with cerebral palsy in four areas of the USA in 2006: a report from the Autism and Developmental Disabilities Monitoring Network. Research in Developmental Disabilities 32, 2 (2011), 462--9.",
      "doi": ""
    },
    {
      "text": "Kozeis, N., Anogeianaki, A., Mitova, D.T., Anogianakis, G., Mitov, T., and Klisarova, A. Visual function and visual perception in cerebral palsied children. Ophthalmic & physiological optics: the journal of the British College of Ophthalmic Opticians (Optometrists) 27, 1 (2007), 44--53.",
      "doi": ""
    },
    {
      "text": "Kutner, L. and Olson, C. Grand Theft Childhood. Simon and Schuster, 2008.",
      "doi": ""
    },
    {
      "text": "Lee, E. BBC - Future Media Standards & Guidelines Accessible Games Standard v1.0. 2010. http://www.bbc.co.uk/guidelines/futuremedia/accessibili ty/games.shtml.",
      "doi": ""
    },
    {
      "text": "National Center on Birth Defects and Developmental Disabilities. Facts about Cerebral Palsy. 2012. http://www.cdc.gov/NCBDDD/cp/facts.html.",
      "doi": ""
    },
    {
      "text": "Notelaers, S., Weyer, T.D., Robert, K., and Raymaekers, C. Design Aspects for Rehabilitation Games for MS Patients. Proceedings of DEnG-VE (2010).",
      "doi": ""
    },
    {
      "text": "Odle, B.M., Irving, A., and Foulds, R. Usability of an adaptable video game platform for children with cerebral palsy. 35th IEEE Annual Northeast Bioengineering Conference, (2009), 1--2.",
      "doi": ""
    },
    {
      "text": "Palisano, R., Rosenbaum, P., Bartlett, D., and Livingston, M. Gross Motor Function Classification System, Expanded and Revised. Developmental Medicine and Child Neurology, 2007, 1--4. http://www.canchild.ca/en/measures/gmfcs.asp.",
      "doi": ""
    },
    {
      "text": "Rosenbaum, P., Paneth, N., Leviton, A., Goldstein, M., Bax, M., et al., A report: the definition and classification of cerebral palsy April 2006. Developmental Medicine and Child Neurology Supplement, (2007), 8--14.",
      "doi": ""
    },
    {
      "text": "Saavedra, S., Joshi, A., Woollacott, M., and van Donkelaar, P. Eye hand coordination in children with cerebral palsy. Experimental Brain Research. 192, 2 (2009), 155--65.",
      "doi": ""
    },
    {
      "text": "Spence, I. and Feng, J. Video games and spatial cognition. Review of General Psychology 14, 2 (2010), 92--104.",
      "doi": ""
    },
    {
      "text": "Warburton, D.E.R., Bredin, S.S.D., Horita, L.T.L., Zbogar, D., Scott, J.M., et al., The health benefits of interactive video game exercise. Applied Physiology, Nutrition, and Metabolism 32, 4 (2007), 655--663.",
      "doi": ""
    },
    {
      "text": "Widman, L., McDonald, C., and Abresch, T. Effectiveness of an upper extremity exercise device integrated with computer gaming for aerobic training in adolescents with spinal cord dysfunction. The Journal of Spinal Cord Medicine 29, (2006), 363--370.",
      "doi": ""
    },
    {
      "text": "Yuan, B., Folmer, E., and Harris, F.C. Game accessibility: a survey. Universal Access in the Information Society 10, 1 (2010), 81--100.  ",
      "doi": "10.1007/s10209-010-0189-5"
    }
  ]
}