{
  "doi": "10.1145/2470654.2470758",
  "title": "Improving digital handoff using the space above the table",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "735-744",
  "year": 2013,
  "badges": [],
  "abstract": "Object handoff - that is, passing an object or tool to another person - is an extremely common activity in collaborative tabletop work. On digital tables, object handoff is typically accomplished by sliding them on the table surface - but surface-only interactions can be slow and error-prone, particularly when there are multiple people carrying out multiple handoffs. An alternative approach is to use the space above the table for object handoff; this provides more room to move, but requires above-surface tracking. We have developed two above-the-surface handoff techniques that use simple and inexpensive tracking: a force-field technique that uses a depth camera to determine hand proximity, and an electromagnetic-field technique called ElectroTouch that provides positive indication when people touch hands over the table. We compared the new techniques to three kinds of surface-only handoff (sliding, flicking, and surface-only Force-Fields). The study showed that the above-surface techniques significantly improved both speed and accuracy, and that ElectroTouch was the best technique overall. This work provides designers with practical new techniques for substantially increasing performance and interaction richness on digital tables.",
  "tags": [
    "digital object handoff",
    "coordination",
    "digital tables"
  ],
  "authors": [
    {
      "name": "Steven W.T. Sutcliffe",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557483656",
      "orcid": "missing"
    },
    {
      "name": "Zenja Ivkovic",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553616256",
      "orcid": "missing"
    },
    {
      "name": "David R. Flatla",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/do/10.1145/contrib-81460658260/rel-imgonly/mypicture2cropped.png",
      "acmid": "81460658260",
      "orcid": "missing"
    },
    {
      "name": "Andriy Pavlovych",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100311577",
      "orcid": "missing"
    },
    {
      "name": "Ian Stavness",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/do/10.1145/contrib-81319501712/rel-imgonly/ianstavness.jpg",
      "acmid": "81319501712",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A. and Balakrishnan, R. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. Proc. ACM CHI 2006, 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Basili, P., Huber, M., Brandt, T., Hirche, S. and Glasauer, S. Investigating human-human approach and hand-over. Hum. Cent. Robot Sys., 6, 2009, 151--160.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Ahlström, D., and Gutwin, C., Understanding performance in touch selections: Tap, drag and radial pointing drag with finger, stylus and mouse. IJHCS, 70, 3, 2012, 218--233.  ",
      "doi": "10.1016/j.ijhcs.2011.11.002"
    },
    {
      "text": "Dietz, P. and Leigh, D. Diamondtouch: a multi-user touch technology. Proc. UIST 2001, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Fleck, R., Rogers, Y., Yuill, N., et al. Actions speak loudly with words: unpacking collaboration around the table. Proc. ACM ITS 2009, 189--196.  ",
      "doi": "10.1145/1731903.1731939"
    },
    {
      "text": "Genest, A. and Gutwin, C. Characterizing Deixis over Surfaces to Improve Remote Embodiments. Proc. ECSCW 2011, 253--272.",
      "doi": ""
    },
    {
      "text": "Gutwin, C. and Greenberg, S. A descriptive framework of workspace awareness for real-time groupware. JCSCW, 11(3), 2002, 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. Skinput: appropriating the body as an input surface. Proc. CHI 2010, 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Hart, S., and Staveland, L. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In P. Hancock and N. Meshkati (Eds.) Human Mental Workload. Amsterdam: North Holland, 1988.",
      "doi": ""
    },
    {
      "text": "Hilliges, O., Kim, D., Izadi, S., Weiss, M. and Wilson, A. HoloDesk: direct 3d interactions with a situated seethrough display. Proc. CHI 2012, 2421--2430.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Hornecker, E., Marshall, P., Dalton, N., and Rogers, Y. Collaboration and interference: Awareness with mice or touch input. Proc. CSCW 2008, 167--176.  ",
      "doi": "10.1145/1460563.1460589"
    },
    {
      "text": "Huber, M., Rickert, M., Knoll, A., Brandt, T. and Glasauer, S. Human-robot interaction in handing-over tasks. Proc. IEEE Robot and Human Interactive Communication 2008, 107--112.",
      "doi": ""
    },
    {
      "text": "Inkpen, K., Hancock, M., Mandryk, R., and Scott, S. Collaboration around a Tabletop Display: Supporting Interpersonal Interactions, SFU Tech Report, 2002.",
      "doi": ""
    },
    {
      "text": "Jun, L., Pinelle, D., Gutwin, C., and Subramanian, S. Improving digital handoff in shared tabletop workspaces. Proc. Tabletop 2008, 9--16.",
      "doi": ""
    },
    {
      "text": "Marquardt, N., Jota, R., Greenberg, S. and Jorge, J. The continuous interaction space: interaction techniques unifying touch and gesture on and above a digital surface. Proc. INTERACT 2011, 461--476. ",
      "doi": "10.5555/2042182.2042224"
    },
    {
      "text": "Müller-Tomfelde, C. and Schremmer, C. Touchers and mousers: commonalities and differences in co-located collaboration with multiple input devices. Proc. CHI 2008, 1149--1152.  ",
      "doi": "10.1145/1357054.1357234"
    },
    {
      "text": "Pinelle, D., Gutwin, C., and Greenberg, S., Task Analysis for Groupware Usability Evaluation: Modeling Shared-Workspace Tasks with the Mechanics of Collaboration, ToCHI, 2003, 281--311.  ",
      "doi": "10.1145/966930.966932"
    },
    {
      "text": "Reetz, A., Gutwin, C., Stach, T., Nacenta, M., and Subramanian, S. Superflick: a natural and efficient technique for long-distance object placement on digital tables. Proc. Graphics Interface 2006, 163--170. ",
      "doi": "10.5555/1143079.1143106"
    },
    {
      "text": "Ryall, K., Forlines, C., Shen, C., and Morris, M. Exploring the effects of group size and table size on interactions with tabletop shared-display groupware. Proc. CSCW 2004, 284--293.  ",
      "doi": "10.1145/1031607.1031654"
    },
    {
      "text": "Sallnäs, E. and Zhai, S. Collaboration meets Fitts's law: Passing Virtual Objects with and without Haptic Force Feedback, Proc. INTERACT 2003, 97--104.",
      "doi": ""
    },
    {
      "text": "Sato, M., Poupyrev, I., and Harrison, C. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. Proc. CHI 2012, pages 483--492.  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Tse, E., Histon, J., Scott, S., and Greenberg, S. Avoiding interference: how people use spatial separation and partitioning in SDG workspaces. Proc. CSCW 2004, 252--261.  ",
      "doi": "10.1145/1031607.1031647"
    },
    {
      "text": "Wilson, A. and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. Proc. UIST 2010, 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    }
  ]
}