{
  "doi": "10.1145/2470654.2466454",
  "title": "Critical perspective on persuasive technology reconsidered",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3327-3330",
  "year": 2013,
  "badges": [],
  "abstract": "Critical researchers in HCI have recently faulted Persuasive Technology (PT) for taking a modernist approach and suggested ways for redirecting research. This paper reflects on this critical perspective and compares it with Habermas's critical perspective. I claim that the recent critiques of PT are grounded on a narrow and pessimistic concept of modernism, and that Habermas's works, rarely taken into account in the HCI community, can serve as an alternative lens for reflective analysis and design and can provide a foundation for justifying design decisions while realizing the unfulfilled potentials of PT. Beyond offering critical analysis and reflections, this paper contributes to the HCI field by calling attention to alternative reflective concepts and emerging relevant works.",
  "authors": [
    {
      "name": "Fahri Yetim",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100332470",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baumer, E. P. S., Katz, S. J., Freeman, J. E., Adams, P., Gonzales, A. L., Pollak, J. P., Retelny, D., Niederdeppe, J., Olson, C., and Gay, G. (2012). Prescriptive persuasion and open-ended social awareness: Expanding the design space of mobile health. Proc. CSCW '12. ACM.  ",
      "doi": "10.1145/2145204.2145279"
    },
    {
      "text": "Borning, A., and Muller, M. J. (2012). Next steps in value sensitive design. Proc CHI '12. ACM, 1125--1134.  ",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Brynjarsdóttir, H., Håkansson, M., Pierce, J., Baumer, E. P. S., DiSalvo, C. and Phoebe Sengers, P. (2012). Sustainably unpersuaded: How persuasion narrows our vision of sustainability. Proc CHI '12. ACM, 947--956.  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Fogg, B. J. (2003). Persuasive technology: Using computers to change what we think and do. Morgan Kaufmann Publishers. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Habermas, J. (1984). The theory of communicative action. Vol. 1, Reason and the rationalization of society. London: Heinemann",
      "doi": ""
    },
    {
      "text": "Habermas, J. (1993) Justification and Application. Cambridge: Polity Press.",
      "doi": ""
    },
    {
      "text": "Habermas, J. (1996) Between Facts and Norms. Cambridge: Polity Press.",
      "doi": ""
    },
    {
      "text": "Kellner, D. (1999). Theorizing/Resisting McDonaldization: A multiperspectivist approach. In B. Smart (Ed.), Resisting McDonaldization. London: SAGE Publications, 186--206.",
      "doi": ""
    },
    {
      "text": "Myers, M. D. and Klein, H. (2011). A set of principles for conducting critical research in information systems. MIS Quarterly 35(1), 17--36. ",
      "doi": "10.5555/2017483.2017486"
    },
    {
      "text": "Purpura, S., Schwanda, V., Williams, K., Stubler, W., and Sengers, P. (2011). Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight. Proc CHI '11. ACM, 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Ritzer, G. (2004). The McDonaldization of society. Newbury Park, CA: Pine Forge Press.",
      "doi": ""
    },
    {
      "text": "Oinas-Kukkonen, H. (2012). A foundation for the study of behavior change support systems. Pers Ubiquit Comp",
      "doi": ""
    },
    {
      "text": "Yetim, F. (2009). A Deliberation Theory-Based Approach to the Management of Usability Guidelines. Informing Science 12, 73--104.",
      "doi": ""
    },
    {
      "text": "Yetim, F. (2011). Bringing Discourse Ethics to Value Sensitive Design: Pathways Toward a Deliberative Future. AIS Transactions on Human-Computer Interaction 3 (2), 133--155.",
      "doi": ""
    },
    {
      "text": "Yetim, F. (2011). A Set of Critical Heuristics for Value Sensitive Designers and Users of Persuasive Systems. Proc ECIS' 11. AIS.",
      "doi": ""
    }
  ]
}