{
  "doi": "10.1145/2470654.2481358",
  "title": "LaserOrigami: laser-cutting 3D objects",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2585-2592",
  "year": 2013,
  "badges": [],
  "abstract": "We present LaserOrigami, a rapid prototyping system that produces 3D objects using a laser cutter. LaserOrigami is substantially faster than traditional 3D fabrication techniques such as 3D printing and unlike traditional laser cutting the resulting 3D objects require no manual assembly. The key idea behind LaserOrigami is that it achieves three-dimensionality by folding and stretching the workpiece, rather than by placing joints, thereby eliminating the need for manual assembly. LaserOrigami achieves this by heating up selected regions of the workpiece until they become compliant and bend down under the force of gravity. LaserOrigami administers the heat by defocusing the laser, which distributes the laser's power across a larger surface. LaserOrigami implements cutting and bending in a single integrated process by automatically moving the cutting table up and down--when users take out the workpiece, it is already fully assembled. We present the three main design elements of LaserOrigami: the bend, the suspender, and the stretch, and demonstrate how to use them to fabricate a range of physical objects. Finally, we demonstrate an interactive fabrication version of LaserOrigami, a process in which user interaction and fabrication alternate step-by-step.",
  "authors": [
    {
      "name": "Stefanie Mueller",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    },
    {
      "name": "Bastian Kruck",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557092256",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Bartkowiak, K., Edwardson, S. P., Borowski, J., Dearden, G., Watkins, K. G. Laser Forming of Thin Metal Components for 2D and 3D Applications Using a High Beam Quality, Low Power Nd:YAG Laser and Rapid Scanning Optics. International Workshop on Thermal Forming '05.",
      "doi": ""
    },
    {
      "text": "Balkcom, D. J., Mason, M. T. Introducing robotic origami folding. Proc. IEEE International Conference on Robotics and Automation '04, 3245--3250.",
      "doi": ""
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann, '07. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The Psychology of Optimal Experience. Harper Perennial Modern Classics, '08.",
      "doi": ""
    },
    {
      "text": "Deng, D., Chen, Y. Design of Origami Sheets for Foldable Object Fabrication, Proc. ASME '12.",
      "doi": ""
    },
    {
      "text": "Edwardson, S. P. A Study into the 2D and 3D Laser Forming of Metallic Components. PhD Thesis, The University of Liverpool, Dept. of Engineering, '04.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Carr, D., Lovell, E., Hiroshi, I. CopyCAD: remixing physical objects with copy and paste from the real world. Adjunct Proceedings UIST '10, 381--382.  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Geiger, M., Vollertsen, F. The Mechanisms of Laser Forming. CIRP ANNALS '93, 42, 1, 301--304.",
      "doi": ""
    },
    {
      "text": "Gershenfeld, N. Fab: The Coming Revolution on Your Desktop - From Personal Computers to Personal Fabrication. Basic Books, '07. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Lang, R. J., Mcey, R. The Complete Book of Origami: Step-by Step Instructions in Over 1000 Diagrams, '89.",
      "doi": ""
    },
    {
      "text": "Li, W., and Yao, Y. L. Numerical and Experimental Investigation of Convex Laser Forming Process. SME J. of Manufacturing Processes '01, Vol. 3, No. 2, 73--81.",
      "doi": ""
    },
    {
      "text": "Li, W., and Yao, Y. L. Laser Bending of Tubes: Mechanism, Analysis, and Prediction. ASME Trans. J. of Manufacturing Science and Engineering '01, Vol. 123, No. 4, 674--681.",
      "doi": ""
    },
    {
      "text": "Lin, J., Newman, M. W., Hong, J. I., Landay, J. A. DENIM: finding a tighter fit between tools and practice for Web site design. Proc. CHI '00, 510--517.  ",
      "doi": "10.1145/332040.332486"
    },
    {
      "text": "Liu, Y., Boyles, J. K., Genzer, J., Dickey, M. D. Self-folding of polymer sheets using local light absorption. J. of Soft Matter '12, Vol. 8, No. 6, 1764--1769.",
      "doi": ""
    },
    {
      "text": "Marquardt, N., Diaz-Marino, R., Boring, S., Greenberg, S. The proximity toolkit: prototyping proxemic interactions in ubiquitous computing ecologies. Proc. UIST '11, 315--326.  ",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Mori, Y., Igarashi, T. Plushie: an interactive design system for plush toys. SIGGRAPH '07, Article No. 45.  ",
      "doi": "10.1145/1276377.1276433"
    },
    {
      "text": "Mueller, S., Lopes, P., Baudisch, P. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. Proc. UIST '12, 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Oh, Y., Johnson, G., Gross, M., Do, E. Y. The Designosaur and the Furniture Factory. Proc. Design Computing and Cognition'06, 123--140.",
      "doi": ""
    },
    {
      "text": "Qi, J., Buechley, L. Animating paper using shape memory alloys. Proc. CHI '12, 749--752.  ",
      "doi": "10.1145/2207676.2207783"
    },
    {
      "text": "Qi, J., Buechley, L. Electronic popables: exploring paperbased computing through an interactive pop-up book. Proc. TEI '10, 121--128.  ",
      "doi": "10.1145/1709886.1709909"
    },
    {
      "text": "Saul, G., Xu, C., and Gross, M. D. Interactive paper devices: end-user design & fabrication. Proc. TEI '10, 205--212.  ",
      "doi": "10.1145/1709886.1709924"
    },
    {
      "text": "Savage, V., Zhang, X., Hartmann, B. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. Proc. UIST '12, 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Saul, G., Lau, M., Mitani, J., Igarashi, T. SketchChair: an allin-one chair design system for end users. Proc TEI '11, 73--80.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Song, H., Guimbretière, F., Lipson, H., Hu, C. ModelCraft: Capturing Freehand Annotations and Edits on Physical 3D Models. Proc. UIST '06, 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Whitney, J. P., Sreetharan, P. S., Ma, K. Y., Wood, R. J. Pop-up book MEMS. J. of Micromechanics and Microengineering '12. Vol. 21, No. 11.",
      "doi": ""
    },
    {
      "text": "Wibowo, A., Sakamoto, D., Mitani, J., Igarashi, T. DressUp: a 3D interface for clothing design with a physical mannequin. Proc. TEI '12, 99--102.  ",
      "doi": "10.1145/2148131.2148153"
    },
    {
      "text": "Willis, K. D. D., Brockmeyer, E., Hudson, S. E., Poupyrev, I. Printed Optics: 3D Printing of Embedded Optical Elements for Interactive Devices. Proc. UIST '12, 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Willis, K. D. D., Lin, J., Mitani, J., Igarashi, T. Spatial sketch: bridging between movement & fabrication. Proc.TEI '10, 5--12.  ",
      "doi": "10.1145/1709886.1709890"
    },
    {
      "text": "Willis, K. D. D., Xu, C., Wu, J. K., Levin, G., Gross, M. D. Interactive fabrication: new interfaces for digital fabrication. Proc. TEI '11, pp. 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    }
  ]
}