{
  "doi": "10.1145/2470654.2481330",
  "title": "Back-of-device authentication on smartphones",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2389-2398",
  "year": 2013,
  "badges": [],
  "abstract": "This paper presents BoD Shapes, a novel authentication method for smartphones that uses the back of the device for input. We argue that this increases the resistance to shoulder surfing while remaining reasonably fast and easy-to-use. We performed a user study (n=24) comparing BoD Shapes to PIN authentication, Android grid unlock, and a front version of our system. Testing a front version allowed us to directly compare performance and security measures between front and back authentication. Our results show that BoD Shapes is significantly more secure than the three other approaches. While performance declined, our results show that BoD Shapes can be very fast (up to 1.5 seconds in the user study) and that learning effects have an influence on its performance. This indicates that speed improvements can be expected in long-term use.",
  "authors": [
    {
      "name": "Alexander De Luca",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488374",
      "orcid": "missing"
    },
    {
      "name": "Emanuel von Zezschwitz",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421599585",
      "orcid": "missing"
    },
    {
      "name": "Ngo Dieu Huong Nguyen",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556296056",
      "orcid": "missing"
    },
    {
      "name": "Max-Emanuel Maurer",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442602114",
      "orcid": "missing"
    },
    {
      "name": "Elisa Rubegni",
      "institution": "University of Lugano, Lugano, Switzerland",
      "img": "/do/10.1145/contrib-81100267253/rel-imgonly/eli_pict_2.tif",
      "acmid": "81100267253",
      "orcid": "missing"
    },
    {
      "name": "Marcello Paolo Scipioni",
      "institution": "University of Lugano, Lugano, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548025484",
      "orcid": "missing"
    },
    {
      "name": "Marc Langheinrich",
      "institution": "University of Lugano, Lugano, TI, Switzerland",
      "img": "/do/10.1145/contrib-81100638267/rel-imgonly/langheinrichcolo.jpeg",
      "acmid": "81100638267",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aviv, A., Gibson, K., Mossop, E., Blaze, M., and Smith, J. Smudge attacks on smartphone touch screens. In Proc. USENIX 2010, USENIX Association (2010), 1--7. ",
      "doi": "10.5555/1925004.1925009"
    },
    {
      "text": "Azenkot, S., Rector, K., Ladner, R., and Wobbrock, J. Passchords: secure multi-touch authentication for blind people. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility, ASSETS '12, ACM (2012), 159--166.  ",
      "doi": "10.1145/2384916.2384945"
    },
    {
      "text": "Baudisch, P., and Chu, G. Back-of-device interaction allows creating very small touch devices. In Proc. CHI 2009, ACM (2009), 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Bianchi, A., Oakley, I., Kostakos, V., and Kwon, D. S. The phone lock: audio and haptic shoulder-surfing resistant PIN entry methods for mobile devices. In Proc. TEI 2011, ACM (2011), 197--200.  ",
      "doi": "10.1145/1935701.1935740"
    },
    {
      "text": "Bianchi, A., Oakley, I., and Kwon, D. Spinlock: A single-cue haptic and audio PIN input technique for authentication. In Proc. Haptic and Audio Interaction Design, Springer Berlin / Heidelberg (2011), 81--90. ",
      "doi": "10.5555/2033326.2033338"
    },
    {
      "text": "Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage. In Proc. MobileHCI 2011, ACM (2011), 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Carr, S. Public Space. Cambridge Univ Press, 1992.",
      "doi": ""
    },
    {
      "text": "Chong, M., and Marsden, G. Exploring the use of discrete gestures for authentication. In Proc. INTERACT 2009, Springer Berlin / Heidelberg (2009), 205--213.  ",
      "doi": "10.1007/978-3-642-03658-3_27"
    },
    {
      "text": "Clarke, N., and Furnell, S. Authenticating mobile phone users using keystroke analysis. International Journal of Information Security 6, 1 (2007), 1--14.  ",
      "doi": "10.1007/s10207-006-0006-6"
    },
    {
      "text": "Clarke, N., Furnell, S., Rodwell, P., and Reynolds, P. Acceptance of subscriber authentication methods for mobile telephony devices. Computers & Security 21, 3 (2002), 220--228.",
      "doi": "10.1016/S0167-4048%2802%2900304-8"
    },
    {
      "text": "De Luca, A., Hang, A., Brudy, F., Lindner, C., and Hussmann, H. Touch me once and i know it's you!: Implicit authentication based on touch screen patterns. In Proc. CHI 2012, ACM (2012), 987--996.  ",
      "doi": "10.1145/2207676.2208544"
    },
    {
      "text": "De Luca, A., Langheinrich, M., and Hussmann, H. Towards understanding ATM security: a field study of real world ATM use. In Proc. SOUPS 2010, ACM (2010), 16:1--16:10.  ",
      "doi": "10.1145/1837110.1837131"
    },
    {
      "text": "De Luca, A., von Zezschwitz, E., and Hussmann, H. Vibrapass: secure authentication based on shared lies. In Proc. CHI 2009, ACM (2009), 913--916.  ",
      "doi": "10.1145/1518701.1518840"
    },
    {
      "text": "Dunphy, P., Heiner, A. P., and Asokan, N. A closer look at recognition-based graphical passwords on mobile devices. In Proc. SOUPS 2010, ACM (2010), 3:1--3:12.  ",
      "doi": "10.1145/1837110.1837114"
    },
    {
      "text": "Fleishman, E., and Parker Jr, J. Factors in the retention and relearning of perceptual-motor skill. Journal of Experimental Psychology 64, 3 (1962), 215.",
      "doi": ""
    },
    {
      "text": "Gafurov, D., Helkala, K., and Søndrol, T. Biometric gait authentication using accelerometer sensor. Journal of computers 1, 7 (2006), 51--59.",
      "doi": ""
    },
    {
      "text": "Hirotaka, N. Reassessing current cell phone designs: using thumb input effectively. In CHI 2003 EA, ACM (2003), 938--939.  ",
      "doi": "10.1145/765891.766081"
    },
    {
      "text": "Jakobsson, M., Shi, E., Golle, P., and Chow, R. Implicit authentication for mobile devices. In Proc. HotSec 2009, USENIX Association (Berkeley, CA, USA, 2009), 9--9. ",
      "doi": "10.5555/1855628.1855637"
    },
    {
      "text": "Jermyn, I., Mayer, A., Monrose, F., Reiter, M., and Rubin, A. The design and analysis of graphical passwords. In Proc. Usenix 1999 (1999), 1--14. ",
      "doi": "10.5555/1251421.1251422"
    },
    {
      "text": "Karlson, A. K., Brush, A. B., and Schechter, S. Can I borrow your phone?: Understanding concerns when sharing mobile phones. In Proc. CHI 2009, ACM (2009), 1647--1650.  ",
      "doi": "10.1145/1518701.1518953"
    },
    {
      "text": "Kennedy, D., and Osuga, R. Transparent double-sided touchscreen display Android smartphone prototype. http://www.diginfo.tv/v/12-0099-r-en.php, May 2012. Last accessed: January 7, 2013.",
      "doi": ""
    },
    {
      "text": "Kirschnick, N., Kratz, S., and Möller, S. An improved approach to gesture-based authentication for mobile devices. In SOUPS 2010 (2010).",
      "doi": ""
    },
    {
      "text": "Shadmehr, R., and Brashers-Krug, T. Functional stages in the formation of human long-term motor memory. The Journal of Neuroscience 17 (1997), 409--419.",
      "doi": ""
    },
    {
      "text": "Siek, K., Rogers, Y., and Connelly, K. Fat finger worries: How older and younger users physically interact with PDAs. In Proc. INTERACT 2005, Springer Berlin / Heidelberg (2005), 267--280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Takada, T., and Koike, H. Awase-E: Image-based authentication for mobile phones using user's favorite images. In Proc. Human-Computer Interaction with Mobile Devices and Services, Springer Berlin / Heidelberg (2003), 347--351.",
      "doi": ""
    },
    {
      "text": "Tari, F., Ozok, A. A., and Holden, S. H. A comparison of perceived and real shoulder-surfing risks between alphanumeric and graphical passwords. In Proc. SOUPS 2006, ACM (2006), 56--66.  ",
      "doi": "10.1145/1143120.1143128"
    },
    {
      "text": "Weiss, R., and De Luca, A. Passshapes - utilizing stroke based authentication to increase password memorability. In NordiCHI 2008: Proceedings of the 5th Nordic Conference on Human-Computer Interaction, ACM (2008), 383--392.  ",
      "doi": "10.1145/1463160.1463202"
    },
    {
      "text": "Wolin, A., Eoff, B., and Hammond, T. Shortstraw: A simple and effective corner finder for polylines. In Proc. Eurographics 2008 (2008), 3340.  ",
      "doi": "10.5555/2386301.2386308"
    },
    {
      "text": "Yazji, S., Chen, X., Dick, R., and Scheuermann, P. Implicit user re-authentication for mobile devices? In Proc. UIC 2009, vol. 5585, Springer-Verlag New York Inc (2009), 325.  ",
      "doi": "10.1007/978-3-642-02830-4_25"
    }
  ]
}