{
  "doi": "10.1145/2470654.2466125",
  "title": "Front-camera video recordings as emotion responses to mobile photos shared within close-knit groups",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "981-990",
  "year": 2013,
  "badges": [],
  "abstract": "People use social-photography services to tell stories about themselves and to solicit responses from viewers. State of the-art services concentrate on textual comments, \"Like\" buttons, or similar means for viewers to give explicit feedback, but they overlook other, non-textual means. This paper investigates how emotion responses--as video clips captured by the front camera of a cell phone and used as tags for the individual photo viewed--can enhance photo-sharing experiences for close-knit groups. Our exploration was carried out with a mobile social-photography service called Social Camera. Four user groups (N=19) used the application for two to four weeks. The study's results support the value of using front-camera video recordings to glean emotion response. It supports lightweight phatic social interactions not possible with comments and \"Like\" buttons. Most users kept sharing emotion responses throughout the study. They typically shared the responses right after they saw a just taken photo received from a remote partner. They used the responses to share their current contexts with others just as much as to convey nuanced feelings about a photo. We discuss the implications for future design and research.",
  "tags": [
    "emotion response",
    "mobile",
    "close-knit group",
    "social camera",
    "social photography",
    "feedback",
    "co-presence"
  ],
  "authors": [
    {
      "name": "Yanqing Cui",
      "institution": "Nokia Research Center, Espoo, Finland",
      "img": "/do/10.1145/contrib-81100229136/rel-imgonly/yanqing.jpg",
      "acmid": "81100229136",
      "orcid": "missing"
    },
    {
      "name": "Jari Kangas",
      "institution": "Nokia Research Center, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558004756",
      "orcid": "missing"
    },
    {
      "name": "Jukka Holm",
      "institution": "Nokia Research Center, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314494032",
      "orcid": "missing"
    },
    {
      "name": "Guido Grassel",
      "institution": "Nokia Research Center, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467662846",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brubaker, J. R., Venolia, G., and Tang, J. C. Focusing on shared experiences: Moving beyond the camera in video communication. DIS '12, ACM (2012), 96--105.  ",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Chalfen, R. Snapshot Versions of Life. Bowling Green, OH (1987).",
      "doi": ""
    },
    {
      "text": "Cheng, L., Hsiao, F., Liu, Y., and Chen, M. Y. iRotate: Automatic screen rotation based on face orientation. CHI '12, ACM (2012), 2203--2210.  ",
      "doi": "10.1145/2207676.2208374"
    },
    {
      "text": "Counts, S. Group-based mobile messaging in support of the social side of leisure. Computer Supported Cooperative Work, 16 (1--2) (2007), 75--97.  ",
      "doi": "10.1007/s10606-007-9040-9"
    },
    {
      "text": "Cui, Y. and Honkala, M. The consumption of integrated social networking services on mobile devices. MUM '11, ACM (2011), 53--62.  ",
      "doi": "10.1145/2107596.2107602"
    },
    {
      "text": "Gibbs, M. R., Vetere, F., Bunyan, M., and Howard, S. SynchroMate: A phatic technology for mediating intimacy. DUX '05, AIGA (2005), Article 37. ",
      "doi": "10.5555/1138235.1138279"
    },
    {
      "text": "Hackos, J. and Redish, J. User and Task Analysis for Interface Design. Wiley & Sons (1998). ",
      "doi": "10.5555/272962"
    },
    {
      "text": "Inkpen, K., Du, H., Roseway, A., Hoff, A., and Johns, P. Video kids: Augmenting close friendships with asynchronous video conversations in VideoPal. CHI '12, ACM (2012), 2387--2396.  ",
      "doi": "10.1145/2207676.2208400"
    },
    {
      "text": "Jacucci, G., Oulasvirta, A. Ilmonen, T., Evans, J., and Salovaara, A. CoMedia: Mobile group media for active spectatorship. CHI '07, ACM (2007), 1273--1282.  ",
      "doi": "10.1145/1240624.1240817"
    },
    {
      "text": "Johansen, R. Groupware: Computer Support for Business Teams. The Free Press (1988). ",
      "doi": "10.5555/542298"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., and Sellen, A. The ubiquitous camera: An in-depth study of camera phone use. IEEE Pervasive Computing, 4 (2) (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Kirk, D. S., Sellen, A., and Cao, X. Home video communication: Mediating \"closeness.\" CSCW '10, ACM (2010), 135--144.  ",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "Miller, A. D. and Edwards, W. K. Give and take: A study of consumer photo-sharing culture and practice. CHI '07, ACM (2007), 347--356.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "Miluzzo, E., Lane, N. D., Fodor, K., Peterson, R., Lu, H., Musolesi, M., Eisenman, S. B., Zheng, X., and Campbell, A. T. Sensing meets mobile social networks: The design, implementation and evaluation of the CenceMe application. SenSys '08, ACM (2008), 337--350.  ",
      "doi": "10.1145/1460412.1460445"
    },
    {
      "text": "Mäkelä, A., Giller, V., Tscheligi, M., and Sefelin, R. Joking, storytelling, artsharing, expressing affection: A field trial of how children and their social network communicate with digital images in leisure time. CHI '00, ACM (2000), 548--555.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "Ojala, J. and Malinen, S. Photo sharing in small groups: Identifying design drivers for desired user experiences. MindTrek '00, ACM (2012), 69--76.  ",
      "doi": "10.1145/2393132.2393148"
    },
    {
      "text": "Oulasvirta, A., Petit, R., Raento, M., and Tiitta, S. Interpreting and acting on mobile awareness cues. Human-Computer Interaction, 22 (1--2) (2007), 97--135. ",
      "doi": "10.5555/1466595.1466599"
    },
    {
      "text": "Oulasvirta, A., Rattenbury, T., Ma, L., and Raita, E. Habits make smartphone use more pervasive. Personal and Ubiquitous Computing, 16 (1) (2012), 105--114.  ",
      "doi": "10.1007/s00779-011-0412-2"
    },
    {
      "text": "Rivera, K., Cooke, N. J., and Bauhs, J. A. The effects of emotional icons on remote communication. CHI EA '96, ACM (1996), 99--100.  ",
      "doi": "10.1145/257089.257180"
    },
    {
      "text": "Salovaara, A., Jacucci, G., Oulasvirta, A., Kanerva, P., Kurvinen, E., and Tiitta, S. Collective creation and sense-making of mobile media. CHI '06, ACM (2006), 1211--1220.  ",
      "doi": "10.1145/1124772.1124954"
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. The Social Psychology of Telecommunication. John Wiley (1976).",
      "doi": ""
    },
    {
      "text": "Vyas, D., Cui, Y., Ojala, J., and Grassel, G. Producing while consuming: Social interaction around photos shared within private group. ACE '12, Springer (2012), 133--150.  ",
      "doi": "10.1007/978-3-642-34292-9_10"
    },
    {
      "text": "Watanabe, K., Sugawara, K., Matsuda, S., and Yasumura, M. Time-oriented interface design: Picking the right time and method for information presentation. HCII '09, Springer-Verlag (2009), 752--759.  ",
      "doi": "10.1007/978-3-642-02574-7_84"
    },
    {
      "text": "Watanabe, K., Tsukada, K., and Yasumrua, M. WillCam: A digital camera visualizing users' interest. CHIEA '07, ACM (2007), 2747--2752.  ",
      "doi": "10.1145/1240866.1241073"
    },
    {
      "text": "Yarosh, S. and Abowd, G. D. Mediated parent--child contact in work-separated families. CHI '11, ACM (2011), 1185--1194.  ",
      "doi": "10.1145/1978942.1979120"
    },
    {
      "text": "Zhao, S. Toward a taxonomy of copresence. Presence, 12 (5) (2003), 445--455.  ",
      "doi": "10.1162/105474603322761261"
    }
  ]
}