{
  "doi": "10.1145/2470654.2481304",
  "title": "8D: interacting with a relightable glasses-free 3D display",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2209-2212",
  "year": 2013,
  "badges": [],
  "abstract": "We present an 8-dimensional (8D) display that allows glasses-free viewing of 3D imagery, whist capturing and reacting to incident environmental and user controlled light sources. We demonstrate two interactive possibilities enabled by our lens-array-based hardware prototype, and realtime GPU-accelerated software pipeline. Additionally, we describe a path to deploying such displays in the future, using current Sensor-in-Pixel (SIP) LCD panels, which physically collocate sensing and display elements.",
  "tags": [
    "light-based interaction",
    "light fields",
    "glasses-free 3d",
    "relightable display"
  ],
  "authors": [
    {
      "name": "Matthew Hirsch",
      "institution": "Massachusetts Institute of Technology, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442601918",
      "orcid": "missing"
    },
    {
      "name": "Shahram Izadi",
      "institution": "Microsoft Research, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488768",
      "orcid": "missing"
    },
    {
      "name": "Henry Holtzman",
      "institution": "Massachusetts Institute of Technology, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435601065",
      "orcid": "missing"
    },
    {
      "name": "Ramesh Raskar",
      "institution": "Massachusetts Institute of Technology, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022847",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, E. On seeing stuff: The perception of materials by humans and machines. In Proc. of the SPIE, vol. 4299, Citeseer (2001), 1--12.",
      "doi": ""
    },
    {
      "text": "Anderson, R., Knowles, W., and Culley, J. Methods and apparatus involving light pen interaction with a real time display, Apr. 12 1977. US Patent 4,017,680.",
      "doi": ""
    },
    {
      "text": "Brown, C., Kato, H., Maeda, K., and Hadwen, B. A continuous-grain silicon-system lcd with optical input function. Solid-State Circuits, IEEE Journal of 42, 12 (dec. 2007), 2904--2912.",
      "doi": ""
    },
    {
      "text": "Cossairt, O., Nayar, S., and Ramamoorthi, R. Light field transfer: global illumination between real and synthetic objects. In ACM Trans. on Grap., vol. 27, ACM (2008), 57.  ",
      "doi": "10.1145/1360612.1360656"
    },
    {
      "text": "Fleming, R., Dror, R., and Adelson, E. Real-world illumination and the perception of surface reflectance properties. Journal of Vision 3, 5 (2003).",
      "doi": ""
    },
    {
      "text": "Follmer, S., Johnson, M., Adelson, E., and Ishii, H. deform: An interactive malleable surface for capturing 2.5d arbitrary objects, tools and touch. In Proc. 24th ACM symp. on UIST, ACM (2011), 527--536.  ",
      "doi": "10.1145/2047196.2047265"
    },
    {
      "text": "Fuchs, M., Raskar, R., Seidel, H.-P., and Lensch, H. P. A. Towards passive 6d reflectance field displays. ACM Trans. Graph. 27, 3 (Aug. 2008), 58:1--58:8.  ",
      "doi": "10.1145/1360612.1360657"
    },
    {
      "text": "Hirsch, M., Lanman, D., Holtzman, H., and Raskar, R. Bidi screen: A thin, depth-sensing lcd for 3d interaction using light fields. In ACM Trans. Graph., vol. 28, ACM (2009), 159.  ",
      "doi": "10.1145/1618452.1618505"
    },
    {
      "text": "Hullin, M. B., Lensch, H. P. A., Raskar, R., Seidel, H.-P., and Ihrke, I. Dynamic display of brdfs. Computer Graphics Forum 30, 2 (2011), 475--483.",
      "doi": ""
    },
    {
      "text": "Hutley, M., Hunt, R., Stevens, R., and Savander, P. The moiré magnifier. Pure and Applied Optics: Journal of the European Optical Society Part A 3, 2 (1999), 133.",
      "doi": ""
    },
    {
      "text": "Ives, F. E. Parallax stereogram and process of making same. U.S. Patent 725,567, 1903.",
      "doi": ""
    },
    {
      "text": "Izadi, S., Hodges, S., Taylor, S., Rosenfeld, D., Villar, N., Butler, A., and Westhues, J. Going beyond the display: a surface technology with an electronically switchable diffuser. In Proc. 21st ACM symp. on UIST, ACM (2008), 269--278.  ",
      "doi": "10.1145/1449715.1449760"
    },
    {
      "text": "Lanman, D., and Hirsch, M. Build your own glasses-free 3d display. In ACM SIGGRAPH 2011 Courses, ACM (2011), 4.  ",
      "doi": "10.1145/2037636.2037640"
    },
    {
      "text": "Leitner, J., Powell, J., Brandl, P., Seifried, T., Haller, M., Dorray, B., and To, P. Flux: A tilting multi-touch and pen based surface. In Proc. 27th intl. conf. extended abstracts on Human factors in computing systems, ACM (2009), 3211--3216.  ",
      "doi": "10.1145/1520340.1520459"
    },
    {
      "text": "Levoy, M., and Hanrahan, P. Light field rendering. In Proc. 23rd conf. on Computer Graphics and Interactive Techniques, ACM (1996), 31--42.  ",
      "doi": "10.1145/237170.237199"
    },
    {
      "text": "Lippmann, G. Épreuves réversibles donnant la sensation du relief. Journal of Physics 7, 4 (1908), 821--825.",
      "doi": ""
    },
    {
      "text": "Nayar, S., Belhumeur, P., and Boult, T. Lighting sensitive display. ACM Trans. on Grap. 23, 4 (2004), 963--979.  ",
      "doi": "10.1145/1027411.1027414"
    },
    {
      "text": "Ng, R., Levoy, M., Brédif, M., Duval, G., Horowitz, M., and Hanrahan, P. Light field photography with a hand-held plenoptic camera. Computer Science Technical Report 2 (2005).",
      "doi": ""
    },
    {
      "text": "Sato, T., Mamiya, H., Koike, H., and Fukuchi, K. Photoelastictouch: Transparent rubbery tangible interface using an lcd and photoelasticity. In Proc. 22nd ACM symp. on UIST, ACM (2009), 43--50.  ",
      "doi": "10.1145/1622176.1622185"
    },
    {
      "text": "Tompkin, J., Muff, S., Jakuschevskij, S., McCann, J., Kautz, J., Alexa, M., and Matusik, W. Interactive light field painting. In ACM SIGGRAPH 2012 E. Tech., ACM (2012), 12.  ",
      "doi": "10.1145/2343456.2343468"
    },
    {
      "text": "Veeraraghavan, A., Raskar, R., Agrawal, A., Mohan, A., and Tumblin, J. Dappled photography: Mask enhanced cameras for heterodyned light fields and coded aperture refocusing. ACM Trans. Graph. 26, 3 (2007), 69.  ",
      "doi": "10.1145/1276377.1276463"
    },
    {
      "text": "Wetzstein, G., Lanman, D., Hirsch, M., and Raskar, R. Tensor displays: Compressive light field synthesis using multilayer displays with directional backlighting. ACM Trans. Graph. 31, 4 (2012), 80.  ",
      "doi": "10.1145/2185520.2185576"
    },
    {
      "text": "Zwicker, M., Matusik, W., Durand, F., and Pfister, H. Antialiasing for automultiscopic 3D displays. In EGSR (2006).  ",
      "doi": "10.5555/2383894.2383905"
    }
  ]
}