{
  "doi": "10.1145/2470654.2466451",
  "title": "What is \"critical\" about critical design?",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3297-3306",
  "year": 2013,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Critical design is a research through design methodology that foregrounds the ethics of design practice, reveals potentially hidden agendas and values, and explores alternative design values. While it seems to be a timely fit for today's socially, aesthetically, and ethically oriented approaches to HCI, its adoption seems surprisingly limited. We argue that its central concepts and methods are unclear and difficult to adopt. Rather than merely attempting to decode the intentions of its originators, Dunne and Raby, we instead turn to traditions of critical thought in the past 150 years to explore a range of critical ideas and their practical uses. We then suggest ways that these ideas and uses can be leveraged as practical resources for HCI researchers interested in critical design. We also offer readings of two designs, which are not billed as critical designs, but which we argue are critical using a broader formulation of the concept than the one found in the current literature.",
  "tags": [
    "design methodology",
    "hci",
    "critical design",
    "critical theory"
  ],
  "authors": [
    {
      "name": "Jeffrey Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, Indiana, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057577",
      "orcid": "missing"
    },
    {
      "name": "Shaowen Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, Indiana, USA",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    }
  ],
  "references": [
    {
      "text": "Abrams, M. (1991). Doing Things with Texts: Essays in Criticism and Critical Theory. W. W. Norton.",
      "doi": ""
    },
    {
      "text": "Arnold, M. (2001). The function of criticism at the present time. In Leitch, V., Cain, W., Finke, L., Johnson, B., McGowan, J., and Williams, J. (eds.). The Norton Anthology of Theory and Criticism. W. W. Norton.",
      "doi": ""
    },
    {
      "text": "Bardzell, J., and Bardzell, S. (2011). \"Pleasure is your birthright\": Digitally enabled designer sex toys as a case of third-wave HCI. Proc. of CHI'11. ACM.  ",
      "doi": "10.1145/1978942.1978979"
    },
    {
      "text": "Bardzell, S., Bardzell, J., Forlizzi, J., Zimmerman, J., and Antanitis, J. (2012). Critical design and critical theory: The challenge of designing for provocation. Proc. of DIS'12. ACM Press.  ",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Barthes, R. (2000). Mythologies. London: Vintage.",
      "doi": ""
    },
    {
      "text": "Baudrillard, J. (2012). The Gulf War Did Not Take Place. Power Publications.",
      "doi": ""
    },
    {
      "text": "Beardsley, M. (1981). Aesthetics: Problems in the Philosophy of Criticism. Hackett Publishing Company, Inc.",
      "doi": ""
    },
    {
      "text": "Bernstein, R. (1971). Praxis and Action: Contemporary Philosophies of Human Activities. The University of Pennsylvania Press.",
      "doi": ""
    },
    {
      "text": "Bloom, H. (2004). Where Shall Wisdom be Found? The Berkley Publishing Group.",
      "doi": ""
    },
    {
      "text": "Carroll, N. (2001). Beyond Aesthetics. Cambridge UP.",
      "doi": ""
    },
    {
      "text": "Carroll. N. (2009). On Criticism. Routledge.",
      "doi": ""
    },
    {
      "text": "Cavell, S. (2008). Aesthetic problems of modern philosophy. In Cahn, S., and Meskin, A. (eds.). Aesthetics: A Comprehensive Anthology. Blackwell Publishing.",
      "doi": ""
    },
    {
      "text": "Dalsgaard, P., and Dindler, C. Peepholes as means of engagement in interaction design. (2009). Proc. of Engaging Artifacts 2009.",
      "doi": ""
    },
    {
      "text": "Dunne, A. (2006). Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design. MIT Press. ",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Dunne, A., and Raby, F. (2001). Design Noir: The Secret Life of Electronic Objects. Birkhäuser.",
      "doi": ""
    },
    {
      "text": "Dunne, A. and Raby, F. (2010). Dreaming objects. Science Poems-Foundations (May 2010).",
      "doi": ""
    },
    {
      "text": "Dunne, A. and Raby, F. (2007). Critical Design FAQ. Retrieved September 1, 2012. http://www.dunneandraby.co.uk/content/bydandr/13/0",
      "doi": ""
    },
    {
      "text": "Dunne, A. and Raby, F. (2009). Interpretation, collaboration, and critique: Interview with Dunne and Raby. Retrieved September 1, 2012. http://www.dunneandraby.co.uk/content/bydandr/465/0",
      "doi": ""
    },
    {
      "text": "Eliot. T. S. (1949). Selected Prose of T. S. Eliot. Kermode, F. (ed.). A Harvest book.",
      "doi": ""
    },
    {
      "text": "Fallman, D. (2007). Why research-oriented design isn't design-oriented research: On the tensions between design and research in an implicit design discipline. J Know Tech Policy 20 (3), Springer.",
      "doi": ""
    },
    {
      "text": "Friedman, C. (2000). Critical Theory and Science Fiction. Wesleyan University Press.",
      "doi": ""
    },
    {
      "text": "Frye, N. (1957). Anatomy of Criticism. Princeton UP.",
      "doi": ""
    },
    {
      "text": "Gadamer, H.-G. (1992). Truth and Method. Crossroad.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Blythe, M., Boucher, A., Jarvis, N., Bowers, J., and Wright, P. (2010). The prayer companion: Openness and specificity, materiality and spirituality. In Proc. of CHI'10. ACM Press, 2055--2064.  ",
      "doi": "10.1145/1753326.1753640"
    },
    {
      "text": "Goodman. N. (1987). When is art? In Ross, S. (ed.). Art and Its Significance: An Anthology of Aesthetic Theory. SUNY Press.",
      "doi": ""
    },
    {
      "text": "Hall, S. (1992). Cultural studies and its theoretical legacies. In Grossberg, L., Nelson, C., and Treichler, P. (eds.). Cultural Studies. Routledge.",
      "doi": ""
    },
    {
      "text": "Harding, S. (2003). The Feminist Standpoint Theory Reader. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "How, A. (2003). Critical Theory. Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Koskinen, I., Zimmerman, J., Binder, T., Redstrom, J. and Wensveen, S. (2011). Design Research through Practice. Burlington, MA: Morgan Kaufmann. ",
      "doi": "10.5555/2132674"
    },
    {
      "text": "Latour, B. (2004). Why has critique run out of steam? From matters of fact to matters of concern. Critical Inquiry 30 (Winter 2004). University of Chicago.",
      "doi": ""
    },
    {
      "text": "Rush, F. (2004). The Cambridge Companion to Critical Theory. Cambridge UP.",
      "doi": ""
    },
    {
      "text": "Sibley, A. (2008). Aesthetic concepts. In Cahn, S., and Meskin, A. (eds.). Aesthetics: A comprehensive anthology. Blackwell.",
      "doi": ""
    },
    {
      "text": "Wellek, R. (1963). Concepts of Criticism. New Haven: Yale University Press.",
      "doi": ""
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evanson, S. (2007). Research through design as a method for interaction design research in HCI. In Proc. of CHI'07. ACM Press.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}