{
  "doi": "10.1145/2470654.2466144",
  "title": "Your left hand can do it too!: investigating intermanual, symmetric gesture transfer on touchscreens",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1119-1128",
  "year": 2013,
  "badges": [],
  "abstract": "This work examines intermanual gesture transfer, i.e., learning a gesture with one hand and performing it with the other. Using a traditional retention and transfer paradigm from the motor learning literature, participants learned four gestures on a touchscreen. The study found that touchscreen gestures transfer, and do so symmetrically. Regardless of the hand used during training, gestures were performed with a comparable level of error and speed by the untrained hand, even after 24 hours. In addition, the form of a gesture, i.e., its length or curvature, was found to have no influence on transferability. These results have important implications for the design of stroke-based gestural interfaces: acquisition could occur with either hand and it is possible to interchange the hand used to perform gestures. The work concludes with a discussion of these implications and highlights how they can be applied to gesture learning and current gestural systems.",
  "tags": [
    "motor learning",
    "intermanual transfer",
    "skill acquisition",
    "gesture transfer",
    "touchscreen",
    "gestures",
    "symmetric transfer"
  ],
  "authors": [
    {
      "name": "Michelle Annett",
      "institution": "University of Alberta, Edmonton, Alberta, Canada",
      "img": "/do/10.1145/contrib-81435602390/rel-imgonly/750syv7b.png",
      "acmid": "81435602390",
      "orcid": "0000-0001-9421-1199"
    },
    {
      "name": "Walter F. Bischof",
      "institution": "University of Alberta, Edmonton, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100234409",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Android Gestures: 3 Cool Ways to Control Your Phone. http://blogs.computerworld.com/16836/android_gestures. Accessed August 2012.",
      "doi": ""
    },
    {
      "text": "Annett, M., et al. Medusa: A Proximity-Aware Multitouch Tabletop. Proc. of UIST, (2011), 337--346.  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Appert, C. and Zhai, S. Using Strokes as Command Shortcuts: Cognitive Benefits and Toolkit Support. Proc. of CHI, (2009), 2289--2298.  ",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Balakrishnan, R. and Hinckley, K. The Role of Kinesthetic Reference Frames in Two-Handed Input Performance. Proc. of UIST, (1999), 171--178.  ",
      "doi": "10.1145/320719.322599"
    },
    {
      "text": "Balakrishnan, R. and Hinckley, K. Symmetric Bimanual Interaction. Proc. of CHI, (2000), 33--40.  ",
      "doi": "10.1145/332040.332404"
    },
    {
      "text": "Bau, O. and Mackay, W. E. Octopocus: A Dynamic Guide For Learning Gesture-Based Command Sets. Proc. of UIST, (2008), 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Bragdon, A., et al. Experimental Analysis of Touch-Screen Gesture Designs in Mobile Environments. Proc. of CHI, (2001), 403--412.  ",
      "doi": "10.1145/1978942.1979000"
    },
    {
      "text": "Brandl, P., et al. Combining and Measuring the Benefits of Bimanual Pen and Direct-Touch Interaction on Horizontal Interfaces. Proc. of AVI, (2008), 154--161.  ",
      "doi": "10.1145/1385569.1385595"
    },
    {
      "text": "Buxton, W. Chunking and Phrasing and The Design Of Human-Computer Dialogues. Proc. of the IFPF World Computer Congress, (1986), 475--480.",
      "doi": ""
    },
    {
      "text": "Buxton, W. and Myers, B. A Study in Two-Handed Input. SIGCHI Bulletin, (1986), 17, 321--326.  ",
      "doi": "10.1145/22339.22390"
    },
    {
      "text": "Dang, C. T., Straub, M., and Andre, E. Hand Distinction for Multi-Touch Tabletop Interaction. Proc. of ITS, (2009), 101--108.  ",
      "doi": "10.1145/1731903.1731925"
    },
    {
      "text": "Eastridge, K. M. and Rice, M. S. The Effect of Task Goal on Cross-Transfer in a Supination and Pronation Task. Scandinavian Journal of Occupational Therapy, (2004), 11, 128--135.",
      "doi": ""
    },
    {
      "text": "Ellis, H. C. The Transfer of Learning. New York: Macmillan, (1965).",
      "doi": ""
    },
    {
      "text": "Google Invents an Original Search Gesture for Future Devices. http://www.patentlyapple.com/patentlyapple/2012/02/google-invents-an-original-search-gesture-for-future-devices.html. Accessed August 2012.",
      "doi": ""
    },
    {
      "text": "Google Patents Android Pattern Unlock. http://9to5google.com/2011/11/18/google-patents-android-pattern-unlock/. Accessed August 2012.",
      "doi": ""
    },
    {
      "text": "Green, N., et al. A Reducted QWERTY Keyboard for Mobile Text Entry. Proc. of CHI, (2004), 1429--1432.  ",
      "doi": "10.1145/985921.986082"
    },
    {
      "text": "Gustafson, S., Holz, C., and Baudisch, P. Imaginary Phone: Learning Imaginary Interfaces by Transferring Spatial Memory from a Familiar Device. Proc. of UIST, (2011), 283--292.  ",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Guiard, Y. Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. Journal of Motor Behavior, (1987), 19, 486517.",
      "doi": ""
    },
    {
      "text": "Halsband, U. Left Hemisphere Preponderance in Trajectorial Learning. Neuroreport, (1992), 3, 397--400.",
      "doi": ""
    },
    {
      "text": "Hicks, R. E. Asymmetry of Bilateral Transfer, American Journal of Psychology, (1974), 87(4), 667--674.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., et al. Manual Deskerity: An Exploration Of Simultaneous Pen And Touch Direct Input. Proc. of CHI, (2010), 2793--2802.  ",
      "doi": "10.1145/1753846.1753865"
    },
    {
      "text": "Hinckley, K., et al. Pen + Touch = New Tools. Proc. of UIST, (2010), 27--36.  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Isokoski, P. and Raisamo, R. Device Independent Text Input: A Rationale and an Example. Proc. of AVI, (2000), 76--83.  ",
      "doi": "10.1145/345513.345262"
    },
    {
      "text": "Isokoski, P. and Raisamo, R. Quikwriting as a Multi-Device Text Entry Method. Proc. of NordiCHI, (2004), 105--108.  ",
      "doi": "10.1145/1028014.1028031"
    },
    {
      "text": "Kristensson, P. O. and Zhai, S. SHARK: A Large Vocabulary Shorthand Writing System for Pen-based Computers. Proc. of UIST, (2004), 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Matias, E., MacKenzie, S., and Buxton, W. Half-QWERTY: A One-Handed Keyboard Facilitating Skill Transfer from QWERTY. Proc. of InterCHI, (1993), 88--94. ",
      "doi": "10.5555/164632.164679"
    },
    {
      "text": "Miller, G. A. The Magical Number Seven, Plus or Minus Two: Some Limits on our Capacity for Processing Information. Psychological Review, (1956), 63(2), 81--97.",
      "doi": ""
    },
    {
      "text": "Morton, S. M., Lang, C. E., and Bastian A. J. Inter- and Intra-Limb Generalization of Adaptation During Catching. Experimental Brain Research, (2001), 141, 438--445.",
      "doi": ""
    },
    {
      "text": "Oldfield, R. C. The Assessment and Analysis Of Handedness: The Edinburgh Inventory. Journal of Neuropsychologia, (1971), 9, 97--113.",
      "doi": ""
    },
    {
      "text": "Panzer, S., et al. Asymmetric Effector Transfer of Complex Movement Sequences. Human Movement Science, (2010), 29, 62--72.",
      "doi": ""
    },
    {
      "text": "Parlow, S. E. and Kinsbourne, M. Asymmetrical Transfer of Training Between Hands: Implications for Interhemispheric Communication in Normal Brain. Brain and Cognition, (1989), 11, 98--113.",
      "doi": ""
    },
    {
      "text": "Rubine, D. Specifying Gestures by Example. Proc of SIGGRAPH, (1991), 239--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Ross, L. and Nelson, D. Comparing Materials-Based Occupation, Imagery-Based Occupation, and Rote Movement Through Kinematic Analysis of Reach. Occupational Therapy Journal of Research, (2000), 20, 45--60.",
      "doi": ""
    },
    {
      "text": "Sainburg, R. L. and Wang, J. Interlimb Transfer or Visuomotor Rotations: Independence of Direction and Final Position Information. Experimental Brain Research, (2002), 145, 437--447.",
      "doi": ""
    },
    {
      "text": "Schulze, K., Buders, E., and Jancke, L. Intermanual Transfer in a Simple Motor Task. Cortex, (2002), 38, 805--815.",
      "doi": ""
    },
    {
      "text": "Shen, C., et al. Informing the Design of Direct-Touch Tabletops. IEEE Computer Graphics and Applications, (2006), 26(5), 36--46.  ",
      "doi": "10.1109/MCG.2006.109"
    },
    {
      "text": "Signing In With A Picture Password. http://blogs.msdn.com/b/b8/archive/2011/12/16/signing-in-with-a-picture-password.aspx. Accessed August 2012.",
      "doi": ""
    },
    {
      "text": "Stickgold, R. and Walker, M. P. Memory Consolidation and Reconsolidation: What Is The Role of Sleep? Trends in Neurosciences, (2006), 28, 408--415.",
      "doi": ""
    },
    {
      "text": "Thut, G., et al. Intermanual Transfer of Proximal and Distal Motor Engrams in Humans. Experimental Brain Research, (1996), 108, 321--327.",
      "doi": ""
    },
    {
      "text": "Tu, H., Ren, X., and Zhai, S. A Comparative Evaluation of Finger and Pen Stroke Gestures. Proc of CHI, (2012), 1287--1296.  ",
      "doi": "10.1145/2207676.2208584"
    },
    {
      "text": "Wobbrock, J. O., Wilson, A. D., and Li, Y. Gestures without Libraries, Toolkits, or Training: A $1 Recognizer for User Interface Prototypes. Proc of UIST, (2007), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Wu, M., et al. Gesture Registration, Relaxation, and Reuse for Multi-Point Direct-Touch Surfaces. Proc. of ITS, (2006), 185--192.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    }
  ]
}