{
  "doi": "10.1145/2470654.2466145",
  "title": "The challenges and potential of end-user gesture customization",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1129-1138",
  "year": 2013,
  "badges": [],
  "abstract": "The vast majority of work on understanding and supporting the gesture creation process has focused on professional designers. In contrast, gesture customization by end users' - which may offer better memorability, efficiency and accessibility than pre-defined gestures - has received little attention. To understand the end-user gesture creation process, we conducted a study where 20 participants were asked to: (1) exhaustively create new gestures for an open-ended use case; (2) exhaustively create new gestures for 12 specific use cases; (3) judge the saliency of different touchscreen gesture features. Our findings showed that even when asked to create novel gestures, participants tended to focus on the familiar. Misconceptions about the gesture recognizer's abilities were also evident, and in some cases constrained the range of gestures that participants created. Finally, as a calibration point for future research, we used a simple gesture recognizer ($N) to analyze recognition accuracy of the participants' custom gesture sets: accuracy was 68-88% on average, depending on the amount of training and the customization scenario. We conclude with implications for the design of a mixed-initiative approach to support custom gesture creation.",
  "authors": [
    {
      "name": "Uran Oh",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/do/10.1145/contrib-81558395756/rel-imgonly/81558395756.jpg",
      "acmid": "81558395756",
      "orcid": "missing"
    },
    {
      "name": "Leah Findlater",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    }
  ],
  "references": [
    {
      "text": "Anthony, L. and Wobbrock J. O. (2010). A lightweight multistroke recognizer for user interface prototypes. Proc. GI '10, 245--252. ",
      "doi": "10.5555/1839214.1839258"
    },
    {
      "text": "Anthony, L., Kim, Y. and Findlater, L. (2013). Analyzing user-generated YouTube videos to understand touchscreen use by people with motor impairments. Proc. CHI'13, 10 pages. To appear.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Arvo, J. and Novins, K. (2000). Fluid sketches: continuous recognition and morphing of simple hand-drawn shapes, Proc. UIST '00, 73--80.  ",
      "doi": "10.1145/354401.354413"
    },
    {
      "text": "Ashbrook, D., and Starner, T. (2010). MAGIC: A motion gesture design tool. Proc. CHI '10, 2159--2168.  ",
      "doi": "10.1145/1753326.1753653"
    },
    {
      "text": "Avrahami, D., Hudson, S. E., Moran, T. P., and Williams, B. D. (2001). Guided gesture support in the paper PDA. Proc. UIST '01, 197--198.  ",
      "doi": "10.1145/502348.502385"
    },
    {
      "text": "Bau, O. and Mackay, W. E. (2008). OctoPocus: a dynamic guide for learning gesture-based command sets. Proc. UIST '08, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Bigdelou, A., Schwarz, L., and Navab. (2012). An adaptive solution for intra-operative gesture-based human-machine interaction. Proc. IUI '12, 75--83.  ",
      "doi": "10.1145/2166966.2166981"
    },
    {
      "text": "Bunt, A., Conati, C. and McGrenere, J. (2007). Supporting interface customization using a mixed-initiative approach. Proc. IUI '07, 92--101.  ",
      "doi": "10.1145/1216295.1216317"
    },
    {
      "text": "Döring, T., Kern, D., Marshall, P., Pfeiffer, M., Schöning, J., Gruhn, V., and Schmidt, A. (2011). Gestural interaction on the steering wheel - reducing the visual demand. Proc. CHI '11, 483--492.  ",
      "doi": "10.1145/1978942.1979010"
    },
    {
      "text": "Duncker, K. (1945). On problem-solving. Psychological Monographs, 58(5).",
      "doi": ""
    },
    {
      "text": "Fiebrink, R., Cook, P. R., and Trueman, D. (2011). Human model evaluation in interactive supervised learning. Proc, CHI '11, 147--156.  ",
      "doi": "10.1145/1978942.1978965"
    },
    {
      "text": "Findlater, L., Lee, B., and Wobbrock, J. O. (2012). Beyond QWERTY: augmenting touch screen keyboards with multitouch gestures for non-alphanumeric input. Proc. CHI '12, 2679--2682.  ",
      "doi": "10.1145/2207676.2208660"
    },
    {
      "text": "Grandhi, S. A., Joue, G., & Mittelberg, I. (2011). Understanding Naturalness and Intuitiveness in Gesture Production: Insights for Touchless Gestural Interfaces. Proc. CHI '11, 821--824.  ",
      "doi": "10.1145/1978942.1979061"
    },
    {
      "text": "Holm, S. (1979). A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics '79, 6(2), 65--70.",
      "doi": ""
    },
    {
      "text": "Hong, J. I., Landay, J. A. (2000). SATIN: A Toolkit for Informal Ink-based Applications. Proc. UIST '00, 63--72.  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "Horvitz, E. (1999). Principles of mixed-initiative user interfaces. Proc. CHI '99, 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Kane, S. K., Wobbrock, J. O., and Ladner, R. E. (2011). Usable Gestures for Blind People: Understanding Preference and Performance. Proc. CHI '11, 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Kela, J., Korpipää, P., Mäntyjärvi, J., Kallio, S., Savino, G., Jozzo, L., Marca, S. D. (2005). Accelerometer-based gesture control for a design environment. Personal and Ubiquitous Computing '05, 10(5), 285--299.",
      "doi": ""
    },
    {
      "text": "Kin, K., Hartmann, B., DeRose, T., and Agrawala, M. (2012). Proton++: A Customizable Declarative Multitouch Framework. Proc. UIST '12. To appear.  ",
      "doi": "10.1145/2380116.2380176"
    },
    {
      "text": "Kray, C., Nesbitt, D., Dawson, J., Rohs, M. (2010). UserDefined Gestures for Connecting Mobile Phones, Public Displays, and Tabletops. Proc. MobileHCI'10, 239--248.  ",
      "doi": "10.1145/1851600.1851640"
    },
    {
      "text": "Kristensson, P. O. and Denby, L. C. (2011). Continuous recognition and visualization of pen strokes and touchscreen gestures. Proc. SBIM'11, 95--102.  ",
      "doi": "10.1145/2021164.2021181"
    },
    {
      "text": "Lahey, B., Girouard, A., Burleson, W., and Vertegaal, R. (2011). PaperPhone: Understanding the Use of Bend Gestures in Mobile Devices with Flexible Electronic Paper Displays. Proc. CHI '11, 1303--1312.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Li, Y. (2010). Protractor: A Fast and Accurate Gesture Recognizer. Proc. CHI '10, 2169--2172.  ",
      "doi": "10.1145/1753326.1753654"
    },
    {
      "text": "Liu, J., Zhong, L., Wickramasuriya, J., and Vasudevan, V. (2009). uWave: Accelerometer-based personalized gesture recognition and its applications. Pervasive and Mobile Computing '09, 5(6), 657--675.  ",
      "doi": "10.1016/j.pmcj.2009.07.007"
    },
    {
      "text": "Long, A. C., Landay, J. A., Rowe, L. A. (1999). Implications for a gesture design tool. Proc. CHI '99, 40--47.  ",
      "doi": "10.1145/302979.302985"
    },
    {
      "text": "Long, A. C. L., Landay, J. A., Rowe, L. A., and Michiels, J. (2000). Visual similarity of pen gestures. Proc. CHI '00, 360--367.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Long, A. C., Landay, J. A., and Rowe, L. A. (2001). \"Those Look Similar!\" Issues in Automating Gesture Design Advice. Proc. PUI '01, 1--5.  ",
      "doi": "10.1145/971478.971510"
    },
    {
      "text": "Lü, H. and Li, Y. (2012). Gesture coder: a tool for programming multi-touch gestures by demonstration. Proc. CHI '12, 2875--2884.  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Mackay, W. E. (1991). Triggers and barriers to customizing software. Proc. CHI '91, 153--160.  ",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "McKenna, S. J. and Morrison, K. (2004). A comparison of skin history and trajectory-based representation schemes for the recognition of user-specified gestures. Pattern Recognition, 37(5), 999--1009.",
      "doi": ""
    },
    {
      "text": "Merrill, D. J. and Paradiso, J. A. (2005). Personalization, Expressivity, and Learnability of an Implicit Mapping Strategy for Physical Interfaces. Extended Abstracts of CHI '05, 2152--2161.",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Wobbrock, J. O., and Wilson, A. D. (2010). Understanding Users' Preferences for Surface Gestures. Proc. GI '10, 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Nacenta, M. A., Kamber, Y., Qiang, Y. and Kristensson, P. O. (2013). Memorability of pre-designed and userdefined gesture sets. Proc. CHI '13, 10 pages. To appear.  ",
      "doi": "10.1145/2470654.2466142"
    },
    {
      "text": "Ouyang, T. and Li, Y. (2012). Bootstrapping personal gesture shortcuts with the wisdom of the crowd and handwriting recognition. Proc. CHI '12, 2895--2904.  ",
      "doi": "10.1145/2207676.2208695"
    },
    {
      "text": "Rubine, D. (1991). Specifying gestures by example. Proc. SIGGRAPH '91, 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Ruiz, J., Li, Y., and Lank, E. (2011). User-Defined Motion Gestures for Mobile Interaction. Proc. CHI '11, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Tu, H., Ren, X., and Zhai, S. (2012). A comparative evaluation of finger and pen stroke gestures. Proc. CHI '12, 1287--1296.  ",
      "doi": "10.1145/2207676.2208584"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. (2009). User-defined gestures for surface computing. Proc. CHI '09, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wobbrock, J. O., Wilson, A. D., Li, Y. (2007). Gestures without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. Proc. UIST '07, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}