{
  "doi": "10.1145/2470654.2470748",
  "title": "AutoGami: a low-cost rapid prototyping toolkit for automated movable paper craft",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "661-670",
  "year": 2013,
  "badges": [],
  "abstract": "AutoGami is a toolkit for designing automated movable paper craft using the technology of selective inductive power transmission. AutoGami has hardware and software components that allow users to design and implement automated movable paper craft without any prerequisite knowledge of electronics; it also supports rapid prototyping. Apart from developing the toolkit, we have analyzed the design space of movable paper craft and developed a taxonomy to facilitate the design of automated paper craft. AutoGami made consistently strong showings in design workshops, confirming its viability in supporting engagement and creativity as well as its usability in storytelling through paper craft. Additional highlights include rapid prototyping of product design as well as interaction design such as human-robot interactions.",
  "authors": [
    {
      "name": "Kening Zhu",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81455605722",
      "orcid": "0000-0001-6740-4921"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    }
  ],
  "references": [
    {
      "text": "BioMetal, Toki coperation. http://www.toki.co.jp/biometal/index.php.",
      "doi": ""
    },
    {
      "text": "Buechley, L., Eisenberg, M., Catchen, J., and Crockett, A. The lilypad arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In Proc. of CHI 2008, ACM Press (2008), 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Buechley, L., Hendrix, S., and Eisenberg, M. Paints, paper, and programs: first steps toward the computational sketchbook. In Proc. of TEI 2009, ACM Press (2009), 9--12.  ",
      "doi": "10.1145/1517664.1517670"
    },
    {
      "text": "Bullock, I., and Dollar, A. Classifying human manipulation behavior. In Proc. of ICORR 2011. 1--6.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Mackinlay, J. D., and Robertson, G. G. The design space of input devices. In Proc. of CHI 1990, ACM Press (1990), 117--124.  ",
      "doi": "10.1145/97243.97263"
    },
    {
      "text": "Coelho, M., Hall, L., Berzowska, J., and Maes, P. Pulp-based computing: a framework for building computers out of paper. In Proc. of CHI 2009, ACM Press (2009), 3527--3528.  ",
      "doi": "10.1145/1520340.1520525"
    },
    {
      "text": "Deborah, F, Origami and Communication Strategies. Doshisha Studies in Language and Culture 1-2, 315--334. 1998.",
      "doi": ""
    },
    {
      "text": "Falcioni, J. G. Shape Memory Alloys. Mechanical Engineering. April 1992, 114.",
      "doi": ""
    },
    {
      "text": "Gardiner, M., and Gardiner, R. The functional aesthetic of folding, self-similar interactions. In Proc. of TEI 2012, ACM Press (2012), 19--22.  ",
      "doi": "10.1145/2148131.2148134"
    },
    {
      "text": "Hawkes, E., An, B., Benbernou, N. M., Tanaka, H., Kim, S., Demaine, E. D., Rus, D., and Wood, R. J., Programmable matter by folding, In Proc. of NAS, vol. 107, no. 28, 2010.",
      "doi": ""
    },
    {
      "text": "Ishii, H., and Ullmer, B. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proc. of CHI 1997. ACM Press (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Ives, R., Ed. Paper Engineering and Pop-ups FOR DUMMIES. Wiley Publishing, 2009.",
      "doi": ""
    },
    {
      "text": "Justin Goodyre - Constructing Realities | ARUP Phase 2 Gallery | London 2010. http://www.constructingrealities.com/?p=5.",
      "doi": ""
    },
    {
      "text": "Koizumi, N., Yasu, K., Liu, A., Sugimoto, M., and Inami, M. Animated paper: a moving prototyping platform. In Adjunct Proc. of UIST 2010, ACM Press (2012), 389--390.  ",
      "doi": "10.1145/1866218.1866234"
    },
    {
      "text": "McGee, L. M., Charlesworth, R., Books with movables: More than just novelties, The Reading Teacher 37 (9) 853--859.",
      "doi": ""
    },
    {
      "text": "Qi, J., and Buechley, L. Animating paper using shape memory alloys. In Proc. of CHI 2012, ACM Press (2012), 749--752.  ",
      "doi": "10.1145/2207676.2207783"
    },
    {
      "text": "Qi, J., and Buechley, L. Electronic popables: exploring paper-based computing through an interactive pop-up book. In Proc. Of TEI 2010, ACM Press (2010), 121--128.  ",
      "doi": "10.1145/1709886.1709909"
    },
    {
      "text": "Rubaiat, H. K, Chua, K. C., Zhao, S., Davis, R., Low, K.. SandCanvas: a multi-touch art medium inspired by sand animation. In Proc. of CHI 2011, ACM Press (2011), 1283--1292.  ",
      "doi": "10.1145/1978942.1979133"
    },
    {
      "text": "Rubaiat, H. K, Igarashi, T., Zhao, S., Davis, R. Vignette: interactive texture design and manipulation with freeform gestures for pen-and-ink illustration. In Proc. of CHI 2012, ACM Press (2012), 1727--1736.  ",
      "doi": "10.1145/2207676.2208302"
    },
    {
      "text": "Saul, G., Xu, C., and Gross, M. D. Interactive paper devices: end-user design and fabrication. In Proc. of TEI 2010, ACM Press (2010), 205--212.  ",
      "doi": "10.1145/1709886.1709924"
    },
    {
      "text": "Shumakov, K. and Shumakov, Y., Functional interhemispheric asymmetry of the brain in dynamics of bimanual activity in children 7-11 year old during origami training. PhD dissertation, Rostov State University, 2000.",
      "doi": ""
    },
    {
      "text": "Sloman, P., Ed. Paper: Tear, Fold, Rip, Crease, Cut. Black Dog Publishing, 2009.",
      "doi": ""
    },
    {
      "text": "Snyder, C., Ed. Paper Prototyping: The Fast and Easy Way to Design and Refine User Interfaces. Morgan Kaufmann, 2003.",
      "doi": "10.5555/2821584"
    },
    {
      "text": "Thelma R. Newman, Jay Hartley Newman, L. S. N., Ed. Paper as Art and Craft: The complete book of the history and processes of the paper arts. Crown Publishers, 1973.",
      "doi": ""
    },
    {
      "text": "Van S. D., Broman, E., E. G. K. R. A. M., Ed. Paper Engineering: Fold, Pull, Pop and Turn. Smithsonian Institution Libraries, 2010.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The computer for the 21st century. SIGMOBILE Mob. Comput. Commun. Rev. 3, 3 (July 1999), 3--11.  ",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Wellner, P. Interacting with Paper on the Digital Desk. In Commun. ACM 36(7): 86--96 (1993).  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Wrensch, T. and Eisenberg, M. 1998. The programmable hinge: toward computationally enhanced crafts. In Proc. of UIST 1998. ACM Press (1998), 89--96.  ",
      "doi": "10.1145/288392.288577"
    },
    {
      "text": "Zhu, K., Nii, H., Fernando, O. N. N., and Cheok, A. D. Selective inductive powering system for paper computing. In Proc. of ACE 2011, ACM Press (2011), 59:1--59:7.  ",
      "doi": "10.1145/2071423.2071497"
    }
  ]
}