{
  "doi": "10.1145/2470654.2481326",
  "title": "Beyond the filter bubble: interactive effects of perceived threat and topic involvement on selective exposure to information",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2359-2368",
  "year": 2013,
  "badges": [],
  "abstract": "We investigated participants' preferential selection of information and their attitude moderation in an online environment. Results showed that even when opposing views were presented side-to-side, people would still preferentially select information that reinforced their existing attitudes. Preferential selection of information was, however, influenced by both situational (e.g., perceived threat) and personal (e.g., topic involvement) factors. Specifically, perceived threat induced selective exposure to attitude consistent information for topics that participants had low involvement. Participants had a higher tendency to select peer user opinions in topics that they had low than high involvement, but only when there was no perception of threat. Overall, participants' attitudes were moderated after being exposed to diverse views, although high topic involvement led to higher resistance to such moderation. Perceived threat also weakened attitude moderation, especially for low involvement topics. Results have important implication to the potential effects of \"information bubble\" - selective exposure can be induced by situational and personal factors even when competing views are presented side-by-side.",
  "tags": [
    "information seeking",
    "perceived threat",
    "topic involvement",
    "filter bubble",
    "peer opinions",
    "attitude change"
  ],
  "authors": [
    {
      "name": "Q. Vera Liao",
      "institution": "University of Illinois at Urbana-Champaign, Champaign, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460647108",
      "orcid": "missing"
    },
    {
      "name": "Wai-Tat Fu",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244379",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albarracin, D., & Mitchell, A. L. The role of defensive confidence in preference for proattitudinal information: How believing that one is strong can sometimes be a defensive weakness. Personality and Social Psychology Bulletin 30 (2004), 1565--1584.",
      "doi": ""
    },
    {
      "text": "Case, D. O., Andrews, J, Johnson, J, Allard, S. Avoiding versus Seeking: the Relationship of Information Seeking to Avoidance, Blunting, Coping, Dissonance, and Related Concepts. Journal of Medical Library Association 93, 3 (2005), 353--362.",
      "doi": ""
    },
    {
      "text": "Cronbach, L. J., Coefficient Alpha and The Internal Structure of Tests. Psychometrika 16, 3 (1951), 297--334.",
      "doi": ""
    },
    {
      "text": "Dutta-Bergman, M. J. Complementarity in Consumption of News Types Across Traditional and New Media. Journal of Broadcasting & Electronic Media 48, 1 (2010), 41--60.",
      "doi": ""
    },
    {
      "text": "Faridani, S., Bitton, E., Ryokai, K., Goldberg, K. Opinion Space: A Scalable Tool for Browsing Online Opinions. In Proc. CHI2010 1175--1184.  ",
      "doi": "10.1145/1753326.1753502"
    },
    {
      "text": "Fischer, P., Kastenmuller, A., Greitemeyer, T., Fischer, J., Frey, D. Threat and Selective Exposure: The Moderating Role of Threat and Decision Context on Confirmatory Information Search After Decision. Journal of Experimental Psychology: General 140, 1 (2011). 51--62.",
      "doi": ""
    },
    {
      "text": "Fischer, P., & Ai, A. International terrorism and mental health: Recent research and future directions. Journal of Interpersonal Violence 23(2008), 339--361.",
      "doi": ""
    },
    {
      "text": "Frey, D. Recent Research on Selective Exposure to Information. Advances in Experimental Social Psychology 19(1986), 41--80.",
      "doi": ""
    },
    {
      "text": "Garrett, R. K. \"Echo chambers online?: Politically motivated selective exposure among Internet news users,\" Journal of Computer Mediated Communication 14, 2(2009), 265--285.",
      "doi": ""
    },
    {
      "text": "Garrett, R., Resnick, P. Resisting Political Fragmentation on the Internet. Daedalus 140, 4 (2011) 108--120.",
      "doi": ""
    },
    {
      "text": "Hart, W., Albarracin, D., Eagly, A., Brechan, I., Lindberg, M., Feeling Validated Versus Being Correct: A Meta-Analysis of Selective Exposure to Information. Psychological Bulletin 135, 4 (2009), 555--588.",
      "doi": ""
    },
    {
      "text": "Himmelfarb, S. The measurement of attitudes. In A. H. Eagly & S. Chaiken (Eds.), Psychology of Attitudes (1993), 23--88. Thomson/Wadsworth.",
      "doi": ""
    },
    {
      "text": "Jiang, Y., Liao, Q., Cheng, Q., Berlin, R., Schatz, B. Designing and Evaluating a Clustering System for Organizing and Integrating Patient Drug Outcomes in Personal Health Messages. In Proc. AMIA 2012.",
      "doi": ""
    },
    {
      "text": "Johnson, B. J. & Eagly, A. Effects of Involvement on Persuasion: A Meta-Analysis. Psychological Bulletin, 106, 2(1989), 290--314.",
      "doi": ""
    },
    {
      "text": "Kriplean, T., Morgan, J., Freelon, D., Borning, A., Bennett, L. Supporting Reflective Public Thouht with ConsiderIt. In Proc. CSCW2012, 265--274.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Mankoff, J., Kuksenok, K., Rode, J., Kiesler, S., Waldman, K. Competing Online Viewpoints and Models of Chronic Illness. In Proc. CHI2011, 589--597.  ",
      "doi": "10.1145/1978942.1979027"
    },
    {
      "text": "Munson, S. & Resnick, P. Presenting Diverse Political Opinions: How and How Much. In Proc. CHI2010, 1457--1466.  ",
      "doi": "10.1145/1753326.1753543"
    },
    {
      "text": "Oh, A., Lee, H., Kim, Y. User Evaluation of a System for Classifying and Displaying Political Viewpoints of Weblogs. In Proc. ICWSM 2009, 282--285.",
      "doi": ""
    },
    {
      "text": "Pariser, Eli. The Filter Bubble: What the Internet Is Hiding from You, Penguin Press, 2011 ",
      "doi": "10.5555/2029079"
    },
    {
      "text": "Park, S., Kang, S., Chung, S., Song, J. NewsCube: Delivering Multiple Aspects of News to Mitigate Media Bias. In Proc. CHI2009, 443--452.  ",
      "doi": "10.1145/1518701.1518772"
    },
    {
      "text": "Petty, R. E., & Cacioppo, J. Communication and Persuasion: Central and Peripheral Routes to Attitude Change. New York: Springer-Verlag, 1986.",
      "doi": ""
    },
    {
      "text": "Petty, R. E. & Cacioppo, J. Involvement and Persuasion: Tradition Versus Integration. Psychological Bulletin 107,3 (1990), 367--374.",
      "doi": ""
    },
    {
      "text": "Sunstein, C. R. Republic.com. Princeton, NJ: Princeton University Press, 2002. ",
      "doi": "10.5555/515445"
    },
    {
      "text": "Valentino, N. A., Banks, A., Hutchings, V., Davis, A. Selective Exposure in the Internet Age: The Interaction between Anxiety and Information Utility. Political Psychology 30, 4 (2006) 591--613.",
      "doi": ""
    },
    {
      "text": "Vydiswaran, V., Zhai, C., Roth, D., Pirolli, P. Unbiased Learning of Controversial Topics. In Proc. ASIST2012.",
      "doi": ""
    },
    {
      "text": "Yatani, K., Novati M., Trusty, A., Truong, K. Review Spotlight: A User Interface for Summarizing User Generated Reviews Using Adjective-Noun Word Pairs. In Proc. CHI2011, 1541--1550.  ",
      "doi": "10.1145/1978942.1979167"
    }
  ]
}