{
  "doi": "10.1145/2470654.2466472",
  "title": "Slow design for meaningful interactions",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3431-3440",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper we report on an exploration of how to apply the theory of Slow Design to mass produced products to establish more mindful usage of products; the intention behind this is to promote product attachment and the associated sustainable benefits of long term use. Slow Design is a design philosophy that focuses on promoting well-being for individuals, society, and the natural environment. It encourages people to do things at the right time and at the right speed which helps them to understand and reflect on their actions. Several authors have proposed Slow Design principles and cases have been reported in which these principles were applied in cultural design projects. These applications indicated that Slow Design can indeed have a positive impact on wellbeing. Although promising, this philosophy has not yet been used in the design of mass consumer products. In this paper we present a design case study in which we explored how the Slow Design principles can be applied in the design of an electric fruit juicer. Two studies are reported on where the conditions for implementing Slow Design are explored. The results led to a revision of the principles for use by product designers. The main finding from the case study is that the Slow Design principles can be used to create more 'mindful' interactions that stimulate positive user involvement. This is not from designing interactions that require more time per se, but by stimulating the user to use more time for those parts of the interaction that are meaningful and less for those that are not meaningful.",
  "authors": [
    {
      "name": "Barbara Grosse-Hering",
      "institution": "Designit, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556559756",
      "orcid": "missing"
    },
    {
      "name": "Jon Mason",
      "institution": "Philips Research, Eindhoven, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488647964",
      "orcid": "missing"
    },
    {
      "name": "Dzmitry Aliakseyeu",
      "institution": "Philips Research, Eindhoven, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361598222",
      "orcid": "0000-0001-7075-5052"
    },
    {
      "name": "Conny Bakker",
      "institution": "Delft University of Technology, Delft, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556318656",
      "orcid": "missing"
    },
    {
      "name": "Pieter Desmet",
      "institution": "Delft University of Technology, Delft, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100505695",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "DeBell, M. and Dardis, R. Extending Product Life: Technology Isn't the Only Issue. Advances in Consumer Research 6, (1979), 381--385.",
      "doi": ""
    },
    {
      "text": "Chapman, J. Emotionally Durable Design: Objects, Experiences and Empathy. London: Earthscan, 2005.",
      "doi": ""
    },
    {
      "text": "Cooper, T. Product development implications of sustainable consumption. The Design Journal, 3(2), (2000), 46--57.",
      "doi": ""
    },
    {
      "text": "Fuad-Luke, A. Slow Theory; A paradigm for living sustainably? Fuad-Luke, A., Slow Theory: A paradigm for living sustainably, 2005",
      "doi": ""
    },
    {
      "text": "Gegenbauer, Silke and Elaine M. Huang. Inspiring the Design of Longer-lived Electronics through an Understanding of Personal Attachment. In Proc. DIS 2012, ACM Press (2012), 635--644.  ",
      "doi": "10.1145/2317956.2318052"
    },
    {
      "text": "Hallnäs, L. and Redström, J. Slow Technology; Designing for Reflection. Journal of Personal and Ubiquitous Computing 5, 3 (2001), Springer-Verlag, 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Hassenzahl, M. The Thing and I: Understanding the Relationship Between User and Product. Blythe, M., Overbeeke, C. Monk, A. F., & Wright, P. C. (Eds.), Funology: From Usability to Enjoyment. Kluwer (2003), 31--42. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "Krieken, B.'How to design for emotional durability?' Master's Thesis. Delft University of Technology, The Netherlands, 2012.",
      "doi": ""
    },
    {
      "text": "Honoré, C. In praise of Slow. Orion, London, 2004.",
      "doi": ""
    },
    {
      "text": "Lenssen, K.-M. H., Stofmeel, L., Delden, M. H. W. M. van, Vullers, R. J. M., Visser, H. J. & Pop, V. Zero Energy E-Skin. In Proc. of the International Display Workshop, 2010.",
      "doi": ""
    },
    {
      "text": "Lenssen, K.-M. H. 2011. 'Bright e-skin technology and applications: Simplified gray-scale e-paper'. Journal of the Society for Information Display 19, 1, (2011), 1--7.",
      "doi": ""
    },
    {
      "text": "Mugge, R. Product Attachment. Doctoral Dissertation. Delft University of Technology, The Netherlands, 2007.",
      "doi": ""
    },
    {
      "text": "Norman, D. Memory is more important that actuality. Interactions, 16, 2, (2009), 24--26.  ",
      "doi": "10.1145/1487632.1487638"
    },
    {
      "text": "Odom, W., Pierce, W., Stolterman, E. and Blevis, E. Understanding Why We Preserve Some Things and Discard Others in the Context of Interaction Design. In Proc. of CHI'09, ACM Press (2009), 1053--1062  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Pierce, J. & Paulos, E. Designing for emotional attachment to energy. In Proc. of Design & Emotion conference, 2010.",
      "doi": ""
    },
    {
      "text": "Russo, R. Shoes, Cars and Other Love Stories: Investigating the Experience of Love for Products. Doctoral Dissertation. Delft University of Technology, The Netherlands, 2010.",
      "doi": ""
    },
    {
      "text": "Savas, Ö. A perspective on the person-product relationship: attachment and detachment. McDonagh, D., Hekkert, P., van Erp, J. and Gyi, D. (Eds.), Design and Emotion, CRC Press (2003), 317--321.",
      "doi": ""
    },
    {
      "text": "Schifferstein, H. N. J. and Zwartkruis-Pelgrim, E. P. H. Consumer-Product Attachment: Measurement and Design Implications. International Journal of Design 2, 3 (2008), 1--13.",
      "doi": ""
    },
    {
      "text": "Strauss, C. and Fuad-Luke, A. 2008. The Slow Design Principles - A New Interrogative and Reflexive Tool for Design Research and Practice. In Proc. of Changing the Change, Umberto Allemandi & C. Torino, 2008.",
      "doi": ""
    },
    {
      "text": "van Hemel, C. G., & Brezet, J. C. Ecodesign: A promising approach to sustainable production and consumption. Paris: United Nations Environmental Programme, 1997.",
      "doi": ""
    },
    {
      "text": "Van Hinte, E. Eternally Yours: Visions on Product Endurance. Rotterdam: 010 Publishers, 1997.",
      "doi": ""
    },
    {
      "text": "Van Nes, N. Understanding Replacement Behaviour and Exploring Design Solutions. in Cooper, T. (Eds.), Longer Lasting Products: Alternatives to the Throwaway Society (107--131). London: Gower, 2010",
      "doi": ""
    },
    {
      "text": "Zimmerman, J. 2009. Designing for the Self: Making Products that Help People Become the Person they Desire to Be. In Proc. of CHI'09, ACM Press (2009), 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}