{
  "doi": "10.1145/2470654.2470663",
  "title": "Health vlogger-viewer interaction in chronic illness management",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "49-58",
  "year": 2013,
  "badges": [],
  "abstract": "Health video blogs (vlogs) allow individuals with chronic illnesses to share their stories, experiences, and knowledge with the general public. Furthermore, health vlogs help in creating a connection between the vlogger and the viewers. In this work, we present a qualitative study examining the various methods that health vloggers use to establish a connection with their viewers. We found that vloggers used genres to express specific messages to their viewers while using the uniqueness of video to establish a deeper connection with their viewers. Health vloggers also explicitly sought interaction with their viewers. Based on these results, we present design implications to help facilitate and build sustainable communities for vloggers.",
  "authors": [
    {
      "name": "Leslie S. Liu",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481641570",
      "orcid": "missing"
    },
    {
      "name": "Jina Huh",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488800",
      "orcid": "missing"
    },
    {
      "name": "Tina Neogi",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558323356",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Wanda Pratt",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100298117/rel-imgonly/img_2793-4.jpg",
      "acmid": "81100298117",
      "orcid": "0000-0003-4035-0198"
    }
  ],
  "references": [
    {
      "text": "Barrera, M., Ainlay, S. The Structure of Social Support: A Conceptual and Empirical Analysis. Journal of Community Psychology, 133--143. 1983.",
      "doi": ""
    },
    {
      "text": "Biemans, M., van Dijk, B., Dadlani, P., van Halteren, A. Let's Stay in Touch: Sharing Photos for Restoring Social Connectedness between Rehabilitants, Friends, and Family. In Proc. SICACCESS'09, 179--186.  ",
      "doi": "10.1145/1639642.1639674"
    },
    {
      "text": "Brubaker, J., Lustig, C., Hayes, G.R. PatientsLikeMe: Empowerment and Representation in a Patient-Centered Social Network. CSCW'10; Workshop on Research in Healthcare: Past, Present, and Future.",
      "doi": ""
    },
    {
      "text": "Byun, B., Awasthi, A., Chou, P.A., Kapoor, A., Lee, B., Czerwinski, M. Honest Signals in Video Conferencing. In Proc. ICME'11, 1--6.  ",
      "doi": "10.1109/ICME.2011.6011855"
    },
    {
      "text": "Charmaz, K. Loss of Self: A Fundamental Form of Suffering in the Chronically Ill. Journal of Sociology of Health and Illness, 168--195. 1983.",
      "doi": ""
    },
    {
      "text": "Chou, W.S., Hunt, Y., Folkers, A., Auguston, E. Cancer Survivorship in the Age of YouTube and Social Media: A Narrative Analysis. Journal of Medical Internet Research. 2011.",
      "doi": ""
    },
    {
      "text": "Chung, D.S., Kim, S. Blogging Activity Among Cancer Patients and Their Companions: Uses, Gratifications, and Predictors of Outcomes. JASIST, 297--306. 2008.  ",
      "doi": "10.5555/1331268.1331282"
    },
    {
      "text": "Fernandez-Luque, L., Elahi, N., Grajales III, F.J. An Analysis of Personal Medical Information Disclosed in YouTube Videos Created by Patients with Multiple Sclerosis. Studies in Health Technology Information, 292--296. 2009.",
      "doi": ""
    },
    {
      "text": "Figueiredo, M.A., Prado, P., Camara, M.A., Alburquerque, A.M. Empowering Rural Citizen Journalism via Web 2.0 Technologies. In Proc. C&T'09, 77--84.  ",
      "doi": "10.1145/1556460.1556473"
    },
    {
      "text": "Foucault, M. The History of Sexuality, Vol. 1: An Introduction. Éditions Gallimard. 1978.",
      "doi": ""
    },
    {
      "text": "Grayson, D., Coventry, L. The Effects of Visual Proxemic Information in Video Mediated Communication. SIGCHI Bulletin, 30--39. 1998.  ",
      "doi": "10.1145/565711.565713"
    },
    {
      "text": "Griffith, M., Papacharissi, Z. Looking for You: An Analysis of Video Blogs. First Monday. 2010.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Anchor. 1959.",
      "doi": ""
    },
    {
      "text": "Henderson, A. Abused Women and Peer-Provided Social Support: The Nature and Dynamics of Reciprocity in a Crisis Setting. Issues in Mental Health Nursing, 117--128. 1995.",
      "doi": ""
    },
    {
      "text": "Hibbard, E.S., Fels, D.I. The Vlogging Phenomena: A Deaf Perspective. In Proc. ASSETS'11, 59--66.  ",
      "doi": "10.1145/2049536.2049549"
    },
    {
      "text": "Hoff, T., Mishel, M., Rowe, I. Using New Media to Make HIV Personal: A Partnership of MTV and the Kaiser Family Foundation. Cases in Public Health Communication & Marketing '08, 190--197.",
      "doi": ""
    },
    {
      "text": "Hoffman, D.L, Fodor, M. Can You Measure the ROI of Your Social Media marketing? MIT Sloan Management Review, 41--49. 2010.",
      "doi": ""
    },
    {
      "text": "Inkpen, K., Du, H., Roseway, A., Hoff, A., Johns, P. Video Kids: Augmenting Close Friendships with Asynchronous Video Conversations in VideoPal. In Proc. CHI'12, 2387--2396.  ",
      "doi": "10.1145/2207676.2208400"
    },
    {
      "text": "Krause, N., Herzog, A.R., Baker, E. Providing Support to Others and Well-being in Later Life. Journal of Gerontology, 300--311. 1992.",
      "doi": ""
    },
    {
      "text": "Kurtz, L.F. Self-Help and Support Groups: A Handbook for Practitioners. Sage. 1997.",
      "doi": ""
    },
    {
      "text": "Lange, P.G. Commenting on comments: Investigating responses to antagonism on YouTube. Conference of the Society for Applied Anthropology '07, 1--26.",
      "doi": ""
    },
    {
      "text": "Lange, P.G. Publicly Private and Privately Public: Social Networking on YouTube. Journal of CMC, 361--380. 2008.",
      "doi": ""
    },
    {
      "text": "Markham, T. Hunched Over Their Laptops: Phenomenological Perspectives on Citizen Journalism. Presented at MeCCSA'10.",
      "doi": ""
    },
    {
      "text": "Matthews, N. Confessions to a New Public: Video Nation Shorts. Media Culture Society, 435--449. 2007.",
      "doi": ""
    },
    {
      "text": "Miller, E.A., Pole, A. Diagnosis Blog: Checking Up on Health Blogs in the Blogosphere. American Journal of Public Health, 1514--1519. 2010.",
      "doi": ""
    },
    {
      "text": "Molyneaux, H., O'Donnell, S. Patient Portals 2.0: The Potential for Online Video. In Proc. COACH'09, 1--15.",
      "doi": ""
    },
    {
      "text": "Nardi, B.A., Schiano, D.J., Gumbrecht, M., Swartz, L. Why We Blog. Communications of ACM '04, 41--46.  ",
      "doi": "10.1145/1035134.1035163"
    },
    {
      "text": "Nardi, B.A., Schiano, D.J., Gumbrecht, M. Blogging as Social Activity, or, Would You Let 900 Million People Read Your Diary? In Proc. CSCW'04, 222--231.  ",
      "doi": "10.1145/1031607.1031643"
    },
    {
      "text": "Olson, G.M., Olson, J.S. Distance Matters. HCI, 139--178. 2000.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Raun, T. DIY Therapy: Exploring Affective Aspects of Trans Video Blogs on YouTube. Palgrave Macmillian. 2012.",
      "doi": ""
    },
    {
      "text": "Renov, M., Suderburg, E. Resolutions: Contemporary Video Practices. University of Minneapolis Press. 1996.",
      "doi": ""
    },
    {
      "text": "Ressler, P.K., Bradshaw, Y.S., Gualtieri, L., Chui, K.K.H. Communicating the Experience of Chronic Pain and Illness Through Blogging. Journal of Medical Internet Research. 2012.",
      "doi": ""
    },
    {
      "text": "Ridgeway, P. Restorying Psychiatric Disability: Learning from First Person Recovery Narratives. Psychiatric Rehabilitation Journal, 335--343. 2001.",
      "doi": ""
    },
    {
      "text": "Schwartz, C.E., Sendor, R.M. Helping Others Helps Oneself: Response Shift Effects in Peer Support. Social Science & Medicine, 1563--1575. 1999.",
      "doi": ""
    },
    {
      "text": "Sundar, S.S., Edwards, H.H., Hu, Y., Stavrositu, C. Blogging for Better Health: Putting the \"Public\" Back in Public Health. Routledge. 2006.",
      "doi": ""
    },
    {
      "text": "Tan, L. Psychotherapy 2.0: MySpace Blogging as SelfTherapy. AJP, 143--163. 2008.",
      "doi": ""
    },
    {
      "text": "Thoits, P.A. Stress, Coping, and Social Support Processes: Where Are We? What Next? Journal of Health and Social Behavior, 53--79. 1995.",
      "doi": ""
    },
    {
      "text": "Tremayne, M. Blogging, Citizenship, and the Future of Media. Routledge. 2006. ",
      "doi": "10.5555/1201002"
    },
    {
      "text": "Trier, J. \"Cool\" Engagements With YouTube: Part 1. Journal of Adolescent & Adult Literacy, 408--412. 2007.",
      "doi": ""
    },
    {
      "text": "Turkle, S. Looking Toward Cyberspace: Beyond Grounded Sociology. Contemporary Sociology, 643--648. 1999.",
      "doi": ""
    },
    {
      "text": "Valverde, M. Experience and Truth-Telling in a PostHumanist World: A Foucauldian Contribution to Feminist Ethical Relations. University of Illinois Press. 2004.",
      "doi": ""
    },
    {
      "text": "Waldron, J. YouTube, Fanvids, Forums, Vlogs and Blogs: Informal Music Learning in a Convergent Onand Offline Music Community.International Journal of Music Education, 1--16. 2012.",
      "doi": ""
    }
  ]
}