{
  "doi": "10.1145/2470654.2470683",
  "title": "Form digitization in BPO: from outsourcing to crowdsourcing?",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "197-206",
  "year": 2013,
  "badges": [],
  "abstract": "This paper describes an ethnographic study of an outsourced business process - the digitization of healthcare forms. The aim of the study was to understand how the work is currently organized, with an eye to uncovering the research challenges which need to be addressed if that work is to be crowdsourced. The findings are organised under four emergent themes: Workplace Ecology, Data Entry Skills and Knowledge, Achieving Targets and Collaborative Working. For each theme a description of how the work is undertaken in the outsourcer's Indian office locations is given, followed by the implications for crowdsourcing that work. This research is a first step in understanding how crowdsourcing might be applied to BPO activities. The paper examines features specific to form digitization - extreme distribution and form decomposition - and lightly touches on the crowdsourcing of BPO work more generally.",
  "tags": [
    "outsourcing",
    "ethnography",
    "crowdsourcing",
    "business process"
  ],
  "authors": [
    {
      "name": "Jacki O'Neill",
      "institution": "Xerox Research Centre Europe, Meylan, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041250",
      "orcid": "missing"
    },
    {
      "name": "Shourya Roy",
      "institution": "Xerox Research Centre India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418592570",
      "orcid": "missing"
    },
    {
      "name": "Antonietta Grasso",
      "institution": "Xerox Research Centre Europe, Meylan, France",
      "img": "/do/10.1145/contrib-81100014484/rel-imgonly/anto.jpeg",
      "acmid": "81100014484",
      "orcid": "missing"
    },
    {
      "name": "David Martin",
      "institution": "Xerox Research Centre Europe, Meylan, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390624",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahn, L. V., and Dabbish, L. 2004. Labeling images with a computer game. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '04). ACM, New York, NY, USA, 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Archak, N. 2010. Money, glory and cheap talk: analyzing strategic behavior of contestants in simultaneous crowdsourcing contests on TopCoder.com. Proceedings of the 19th international conference on World wide web (WWW '10). ACM, New York, NY, USA, 21--30.  ",
      "doi": "10.1145/1772690.1772694"
    },
    {
      "text": "Bentley, R., Hughes, J. A., Randall, D., Rodden, T., Sawyer, P., Shapiro, D., and Sommerville, I. 1992. Ethnographically informed systems design for air traffic control. In Proc. CSCW'92. (1992), 123--129.  ",
      "doi": "10.1145/143457.143470"
    },
    {
      "text": "Bernstein, M. S., Littl, G., Miller, R. C., Hartmann, B. Ackerman, M. S., Karger, D. R., Crowell, D. and Panovich, K. 2010. Soylent: a word processor with a crowd inside. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, New York, NY, USA, 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Horton, J. J. and Chilton, L. B. 2010. The labor economics of paid crowdsourcing. In Proceedings of the 11th ACM conference on Electronic commerce (EC '10). ACM, New York, NY, USA, 209--218.  ",
      "doi": "10.1145/1807342.1807376"
    },
    {
      "text": "Huang, E. Zhang, H. Parkes, D. C., Gajos, K. Z. and Chen, Y. 2010. Toward automatic task design: a progress report. In Proceedings of the ACM SIGKDD Workshop on Human Computation (HCOMP '10). ACM, New York, NY, USA, 77--85.  ",
      "doi": "10.1145/1837885.1837908"
    },
    {
      "text": "Ipeirotis, P. G. 2009. Blog post Your estimated waiting time: Infinite!. Available at http://www.behind-the-enemylines.com/2009/02/your-estimated-completion-timeinfinite.html. Last Accessed on 19th Nov, 2011",
      "doi": ""
    },
    {
      "text": "Karnin, E. D., Walach, E. and Drory, T. 2010. Crowdsourcing in the document processing practice. Proceedings of the 10th international conference on Current trends in web engineering (ICWE'10). Springer-Verlag, Berlin, Heidelberg, 408--411. ",
      "doi": "10.5555/1927229.1927272"
    },
    {
      "text": "Kazai, G. 2010. An Exploration of the Influence that Task Parameters have on the Performance of Crowds. In CrowdConf 2010, San Francisco, USA.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems (CHI '08). ACM, New York, NY, USA, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Knowledge@Wharton. 2011. From Freelancers to Telecommuters: Succeeding in the New World of SolitaryWork. Published in Knowledge@Wharton. June 29, 2011. Available at http://knowledge.wharton.upenn.edu/article.cfm?articleid=2806. Last Accessed on 19th Nov, 2011.",
      "doi": ""
    },
    {
      "text": "Knowledge@Wharton. 2010. It Takes a Village: The Rise of Rural BPO. Published in Knowledge@Wharton. February 11, 2010. Available at http://knowledge.wharton.upenn.edu/india/article.cfm?articleid=4450. Last Accessed on 19th Nov, 2011.",
      "doi": ""
    },
    {
      "text": "Kumar, D., Martin, D., and O'Neill, J. 2011. The times they are a-changin': mobile payments in india. In proceedings of CHI 2011, 7-12th May, Vancouver, Canada.  ",
      "doi": "10.1145/1978942.1979150"
    },
    {
      "text": "Malone, T. W., R. J. Laubacher and T. Johns. 2011. The age of hyperspecialization. Harvard Business Rev. 89(7/8): 56--65.",
      "doi": ""
    },
    {
      "text": "Mason, W. and Watts, D. J. 2009. Financial Incentives and the \"Performance of Crowds\". In Proceedings of the ACM SIGKDD Workshop on Human Computation (HCOMP '09). ACM, Paris, France.  ",
      "doi": "10.1145/1600150.1600175"
    },
    {
      "text": "O'Neill, J., Martin, D., Colombino, C., and Grasso, A. 2011. When a little knowledge isn't a dangerous thing. CHI 2011.  ",
      "doi": "10.1145/1978942.1979186"
    },
    {
      "text": "Psaier, H., Skopik, F., Schall, D. and Dustdar, S. 2011. Resource and Agreement Management in Dynamic Crowdcomputing Environments. In Proceedings of the 2011 IEEE 15th International Enterprise Distributed Object Computing Conference (EDOC '11). IEEE Computer Society, Washington, DC, USA, 193--202.  ",
      "doi": "10.1109/EDOC.2011.9"
    },
    {
      "text": "Rzeszotarski, J. 2011. Worker Collaboration in Crowdsourcing Markets. ACM SIGCHI 2011 Workshop on Crowdsourcing and Human Computation.",
      "doi": ""
    },
    {
      "text": "Sachs, P. 1995. Transforming Work: Collaboration, Learning and Design. Communications of the ACM 38 ( 9). 36--44.  ",
      "doi": "10.1145/223248.223258"
    },
    {
      "text": "Schmidt, K., and Bannon, L. 1992: 'Taking CSCW Seriously: Supporting Articulation Work', Journal of CSCW, vol. 1, 1992, no. 1-2, pp. 7--40",
      "doi": ""
    },
    {
      "text": "Sun, Y., Roy, S., and Little, G. 2011. Beyond Independent Agreement: A Tournament Selection Approach for Quality Assurance of Human Computation Tasks. AAAI Workshops, North America, Aug. 2011. Available at: http://www.aaai.org/ocs/index.php/WS/AAAIW11/paper/view/3904. Date accessed: 19 Nov. 2011.",
      "doi": ""
    },
    {
      "text": "Vecchia, G. L. and Cisternino, A.. 2010. Collaborative workforce, business process crowdsourcing as an alternative of BPO. In Proceedings of the 10th international conference on Current trends in web engineering (ICWE'10), Florian Daniel and Federico Michele Facca (Eds.). Springer-Verlag, Berlin, Heidelberg, 425--430. ",
      "doi": "10.5555/1927229.1927276"
    },
    {
      "text": "Vukovic, M. Lopez, M., and Laredo, J. (2010). PeopleCloud for the Globally Integrated Enterprise. In Lecture Notes in Computer Science (6275), Service-Oriented Computing. ICSOC/ServiceWave 2009 Workshops. 109--114. ",
      "doi": "10.5555/1926618.1926630"
    }
  ]
}