{
  "doi": "10.1145/2470654.2466231",
  "title": "HeartLink: open broadcast of live biometric data to social networks",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1749-1758",
  "year": 2013,
  "badges": [],
  "abstract": "A number of studies in the literature have looked into the use of real-time biometric data to improve one's own physiological performance and wellbeing. However, there is limited research that looks into the effects that sharing biometric data with others could have on one's social network. Following a period of research on existing mobile applications and prototype testing, we developed a system, HeartLink, which collects real-time personal biometric data such as heart rate and broadcasts this data online. Insights gained on designing systems to broadcast real-time biometric data are presented. In this paper we also report emerging results from testing HeartLink in a pilot study and a user study that were conducted during sport events. The results showed that sharing heart rate data does influence the relationship of the persons involved and that the degree of influence seems related to the tie strength prior to visualizing the data.",
  "authors": [
    {
      "name": "Franco Curmi",
      "institution": "Lancaster University, Lancaster, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556452856",
      "orcid": "missing"
    },
    {
      "name": "Maria Angela Ferrario",
      "institution": "Lancaster University, Lancaster, UK",
      "img": "/do/10.1145/contrib-81464640980/rel-imgonly/profilepic.jpg",
      "acmid": "81464640980",
      "orcid": "missing"
    },
    {
      "name": "Jen Southern",
      "institution": "Lancaster University, Lancaster, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558284856",
      "orcid": "missing"
    },
    {
      "name": "Jon Whittle",
      "institution": "Lancaster University, Lancaster, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100515901",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Backstrom, L., Boldi, P., Rosa, M., Ugander, J., and Vigna, S. Four Degrees of Separation. WebSci 2012, (2012), 33--42.  ",
      "doi": "10.1145/2380718.2380723"
    },
    {
      "text": "Chamberlain, A., Crabtree, A., Rodden, T., Jones, M., and Rogers, Y. Research in the Wild: Understanding \"In the Wild\" Approaches to Design and Development. ACM Press (2012), 795--796.  ",
      "doi": "10.1145/2317956.2318078"
    },
    {
      "text": "Consolvo, S., Everitt, K., Smith, I., and Landay, J. A. Design requirements for technologies that encourage physical activity. CHI 2006, (2006), 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Eberle, B. Scamper On: More Creative Games and Activities for Imagination Development - Prufrock Press. 1997.",
      "doi": ""
    },
    {
      "text": "Hallberg, J., Svensson, S., Ostmark, A., Lindgren, P., and Synnes, K. Enriched media-experience of sport events. WMCSA 2004, (2004).  ",
      "doi": "10.1109/MCSA.2004.12"
    },
    {
      "text": "Killeen, P. R. and Fetterman, J. G. A behavioral theory of timing. Psychological Review (1988), 274--295.",
      "doi": ""
    },
    {
      "text": "Klasnja, P. and Pratt, W. Healthcare in the pocket: Mapping the space of mobile-phone health interventions. Journal of Biomedical Informatics, (2011), 184--198.  ",
      "doi": "10.1016/j.jbi.2011.08.017"
    },
    {
      "text": "Klasnja, P., Consolvo, S., McDonald, D. W., Landay, J. A., and Pratt, W. Using mobile & personal sensing technologies to support health behavior change in everyday life: lessons learned. AMIA 2009, (2009), 338--342.",
      "doi": ""
    },
    {
      "text": "Lin, J. J., Mamykina, L., Lindtner, S., Delajoux, G., and Strub, H. B. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. Ubicomp 2006, (2006), 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Liu, C., Zhu, Q., Holroyd, K. A., and Seng, E. K. Status and trends of mobile-health applications for iOS devices: A developer's perspective. Journal of Systems and Software, (2011), 2022--2033.  ",
      "doi": "10.1016/j.jss.2011.06.049"
    },
    {
      "text": "Miluzzo, E., Lane, N. D., Fodor, K., and Peterson, R. Sensing meets mobile social networks. SenSys'08, (2008), 337--350.  ",
      "doi": "10.1145/1460412.1460445"
    },
    {
      "text": "Mueller, F., Vetere, F., Gibbs, M. R., Edge, D., Agamanolis, S., and Sheridan, J. G. Jogging over a distance between Europe and Australia. UIST'10 (2010), 189--198.  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Munson, S. A. and Consolvo, S. Exploring goal-setting, rewards, self-monitoring, and sharing to motivate physical activity. Pervasive Health (2012), 25--32.",
      "doi": ""
    },
    {
      "text": "Newman, M. W., Lauterbach, D., Munson, S. A., Resnick, P., and Morris, M. E. It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health. CSCW 2011, (2011), 341--350.  ",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Nicholls, J. The MCC decision matrix: a tool for applying strategic logic to everyday activity. Management decision 33, 6 (1995), 4--10.",
      "doi": ""
    },
    {
      "text": "Petruzzello, S. J., Landers, D. M., and Salazar, W. Biofeedback and sport/exercise performance: Applications and limitations. Behavior therapy 22, (1991), 379--392.",
      "doi": ""
    },
    {
      "text": "Reis, H. T., Smith, S. M., Carmichael, C. L., et al. Are you happy for me? How sharing positive events with others provides personal and interpersonal benefits. Journal of personality and social psychology 99, 2 (2010), 311--329.",
      "doi": ""
    },
    {
      "text": "Sallis, J. F., Hovell, M. F., and Richard Hofstetter, C. Predictors of adoption and maintenance of vigorous physical activity in men and women. Preventive Medicine 21, 2 (1992), 237--251.",
      "doi": ""
    },
    {
      "text": "Schnädelbach, H., Rennick Egglestone, S., Reeves, S., Benford, S., Walker, B., and Wright, M. Performing thrill: designing telemetry systems and spectator interfaces for amusement rides. CHI 2008, (2008), 1167--1176.  ",
      "doi": "10.1145/1357054.1357238"
    },
    {
      "text": "Segerståhl, K. and Oinas-Kukkonen, H. Designing personal exercise monitoring employing multiple modes of delivery: Implications from a qualitative study on heart rate monitoring. International Journal of Medical Informatics, (2011), 203--213.",
      "doi": ""
    },
    {
      "text": "Shehab, M. and Marouf, S. Recommendation Models for Open Authorization. Dependable and Secure Computing 9, 4 (2012), 583--596.  ",
      "doi": "10.1109/TDSC.2012.34"
    },
    {
      "text": "Skeels, M. M., Unruh, K. T., Powell, C., and Pratt, W. Catalyzing social support for breast cancer patients. CHI 2010, (2010), 173--182.  ",
      "doi": "10.1145/1753326.1753353"
    },
    {
      "text": "Southern, J. Comobility: How Proximity and Distance Travel Together in Locative Media. Canadian Journal of Communication 37, (2012), 75--91.",
      "doi": ""
    },
    {
      "text": "Tennent, P., Martindale, S., Marshall, J., Reeves, S., Walker, B., and Harter, P. Performing The Experiment Live. CHI'12, (2012).",
      "doi": ""
    },
    {
      "text": "Tennent, P., Reeves, S., Benford, S., et al. The machine in the ghost: augmenting broadcasting with biodata. CHI'12, (2012), 91--100.  ",
      "doi": "10.1145/2212776.2212787"
    },
    {
      "text": "Tosun, L. P. Motives for Facebook use and expressing \"true self\" on the Internet. Computers in Human Behavior 28, 4 (2012), 1510--1517.  ",
      "doi": "10.1016/j.chb.2012.03.018"
    },
    {
      "text": "Treiber, F. A., Baranowski, T., Braden, D. S., Strong, W. B., Levy, M., and Knox, W. Social support for exercise: relationship to physical activity in young adults. Preventive Medicine 20, 6 (1991), 737--750.",
      "doi": ""
    },
    {
      "text": "Wilson, C., Boe, B., Sala, A., Puttaswamy, K. P. N., and Zhao, B. Y. User interactions in social networks and their implications. EuroSys'09, (2009), 205--218.  ",
      "doi": "10.1145/1519065.1519089"
    },
    {
      "text": "Wilson, V. and Peper, E. Athletes Are Different: Factors That Differentiate Biofeedback/Neurofeedback for Sport Versus Clinical Practice. Biofeedback 39, 1 (2011), 27--30.",
      "doi": ""
    }
  ]
}