{
  "doi": "10.1145/2470654.2470753",
  "title": "Mastering the art of war: how patterns of gameplay influence skill in Halo",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "695-704",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "How do video game skills develop, and what sets the top players apart? We study this question of skill through a rating generated from repeated multiplayer matches called TrueSkill. Using these ratings from 7 months of games from over 3 million players, we look at how play intensity, breaks in play, skill change over time, and other games affect skill. These analyzed factors are then combined to model future skill and games played; the results show that skill change in early matches is a useful metric for modeling future skill, while play intensity explains eventual games played. The best players in the 7-month period, who we call \"Master Blasters\", have varied skill patterns that often run counter to the trends we see for typical players. The data analysis is supplemented with a 70 person survey to explore how players' self-perceptions compare to the gameplay data; most survey responses align well with the data and provide insight into player beliefs and motivation. Finally, we wrap up with a discussion about hiding skill information from players, and implications for game designers.",
  "tags": [
    "video games",
    "gaming skill",
    "online multiplayer",
    "learning"
  ],
  "authors": [
    {
      "name": "Jeff Huang",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659562117",
      "orcid": "missing"
    },
    {
      "name": "Thomas Zimmermann",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81100591561/rel-imgonly/tom_z.jpg",
      "acmid": "81100591561",
      "orcid": "missing"
    },
    {
      "name": "Nachiappan Nagapan",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557167856",
      "orcid": "missing"
    },
    {
      "name": "Charles Harrison",
      "institution": "Microsoft Games Studios, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594814",
      "orcid": "missing"
    },
    {
      "name": "Bruce C. Phillips",
      "institution": "Microsoft Games Studios, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659565522",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bryan, W. L., and Harter, N. Studies in the physiology and psychology of the telegraphic language. Psychological Review 4, 1 (1897), 27--53.",
      "doi": ""
    },
    {
      "text": "Bryan, W. L., and Harter, N. Studies on the telegraphic language: The acquisition of a hierarchy of habits. Psychological Review 6, 4 (1899), 345--375.",
      "doi": ""
    },
    {
      "text": "Cheung, G., and Huang, J. Starcraft from the stands: understanding the game spectator. In Proc. of CHI (2011), 763--772.  ",
      "doi": "10.1145/1978942.1979053"
    },
    {
      "text": "Dangauthier, P., Herbrich, R., Minka, T., and Graepel, T. Trueskill through time: Revisiting the history of chess. In Proc. of NIPS (2007), 337--344.",
      "doi": ""
    },
    {
      "text": "d_ijk_stra. Statistical bonjwa theory: the history of bw. Retrieved August 1, 2012 from http://www.teamliquid.net/forum/viewmessage.php?topic_id=357124.",
      "doi": ""
    },
    {
      "text": "Elo, A. E. The rating of chessplayers, past and present. Batsford, 1978.",
      "doi": ""
    },
    {
      "text": "Harrison, B., and Roberts, D. L. Using sequential observations to model and predict player behavior. In Proc. of FDG (2011), 91--98.  ",
      "doi": "10.1145/2159365.2159378"
    },
    {
      "text": "Herbrich, R., Minka, T., and Graepel, T. Trueskill\": A bayesian skill rating system. In Proc. of NIPS (2006), 569--576.",
      "doi": ""
    },
    {
      "text": "Hock-koon, S. Aordances of elliptical learning in arcade video games. In Proc. of DiGRA Nordic (2012).",
      "doi": ""
    },
    {
      "text": "Hullett, K., Nagappan, N., Schuh, E., and Hopson, J. Empirical analysis of user data in game software development. In Proc. of ESEM (2012), 89--98.  ",
      "doi": "10.1145/2372251.2372265"
    },
    {
      "text": "Keller, F. The phantom plateau. Journal of the Experimental Analysis of Behavior 1, 1 (1958), 1--13.",
      "doi": ""
    },
    {
      "text": "Lee, M. J., and Ko, A. J. Personifying programming tool feedback improves novice programmers' learning. In Proc. of ICER (2011), 109--116.  ",
      "doi": "10.1145/2016911.2016934"
    },
    {
      "text": "Lin, J., Keogh, E., Lonardi, S., and Chiu, B. A symbolic representation of time series, with implications for streaming algorithms. In Proc. of SIGMOD Workshop on Research issues in data mining and knowledge (2003), 2--11.  ",
      "doi": "10.1145/882082.882086"
    },
    {
      "text": "Mason, W., and Clauset, A. Friends FTW! friendship and competition in Halo: Reach. In Proc. of CSCW (2013).  ",
      "doi": "10.1145/2441776.2441820"
    },
    {
      "text": "Reeves, S., Brown, B., and Laurier, E. Experts at play understanding skilled expertise. Games and Culture 4, 3 (2009), 205--227.",
      "doi": ""
    },
    {
      "text": "Staron, R. S., Leonardi, M. J., Karapondo, D. L., Malicky, E. S., Falkel, J. E., Hagerman, F. C., and Hikida, R. S. Strength and skeletal muscle adaptations in heavy-resistance-trained women after detraining and retraining. Journal of Applied Physiology 70, 2 (1991), 631--640.",
      "doi": ""
    },
    {
      "text": "Wallner, G., and Kriglstein, S. A spatiotemporal visualization approach for the analysis of gameplay data. In Proc. of CHI (2012), 1115--1124.  ",
      "doi": "10.1145/2207676.2208558"
    },
    {
      "text": "White, R. W., Dumais, S. T., and Teevan, J. Characterizing the in\\'02uence of domain expertise on web search behavior. In Proc. of WSDM (2009), 132--141.  ",
      "doi": "10.1145/1498759.1498819"
    },
    {
      "text": "Xu, Y., Cao, X., Sellen, A., Herbrich, R., and Graepel, T. Sociable killers: understanding social relationships in an online \\'01rst-person shooter game. In Proc. of CSCW (2011), 197--206.  ",
      "doi": "10.1145/1958824.1958854"
    }
  ]
}