{
  "doi": "10.1145/2470654.2466448",
  "title": "\"i read my Twitter the next morning and was astonished\": a conversational perspective on Twitter regrets",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3277-3286",
  "year": 2013,
  "badges": [],
  "abstract": "We present the results of an online survey of 1,221 Twitter users, comparing messages individuals regretted either saying during in-person conversations or posting on Twitter. Participants generally reported similar types of regrets in person and on Twitter. In particular, they often regretted messages that were critical of others. However, regretted messages that were cathartic/expressive or revealed too much information were reported at a higher rate for Twitter. Regretted messages on Twitter also reached broader audiences. In addition, we found that participants who posted on Twitter became aware of, and tried to repair, regret more slowly than those reporting in-person regrets. From this comparison of Twitter and in-person regrets, we provide preliminary ideas for tools to help Twitter users avoid and cope with regret.",
  "authors": [
    {
      "name": "Manya Sleeper",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488672672",
      "orcid": "missing"
    },
    {
      "name": "Justin Cranshaw",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438597110",
      "orcid": "missing"
    },
    {
      "name": "Patrick Gage Kelley",
      "institution": "University of New Mexico, Albuquerque, New Mexico, USA",
      "img": "/do/10.1145/contrib-81384615723/rel-imgonly/pgk-8.jpg",
      "acmid": "81384615723",
      "orcid": "missing"
    },
    {
      "name": "Blase Ur",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    },
    {
      "name": "Alessandro Acquisti",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496675247",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Norman Sadeh",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100339054/rel-imgonly/n.sadeh.png",
      "acmid": "81100339054",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. Nudging privacy: The behavioral economics of personal information. IEEE Security & Privacy 7, 6 (Nov./Dec. 2009), 82--85.  ",
      "doi": "10.1109/MSP.2009.163"
    },
    {
      "text": "Acquisti, A., and Gross, R. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In Privacy Enhancing Technologies, Springer (2006), 36--58.  ",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Almuhimedi, H., Wilson, S., Liu, B., Sadeh, N., and Acquisti, A. I wish I hadn't tweeted that! Large-scale quantitative analysis of deleted tweets. In Proc. CSCW 2013, ACM (2013).  ",
      "doi": "10.1145/2441776.2441878"
    },
    {
      "text": "Balebako, R., Leon, P., Almuhimedi, H., Kelley, P. G., Mugan, J., Acquisti, A., Cranor, L. F., and Sadeh, N. Nudging users towards privacy on mobile devices. CHIPINC 2011 (2011).",
      "doi": ""
    },
    {
      "text": "Bosker, B. The Twitter typo that exposed Anthony Weiner, 2011. http://www.huffingtonpost.com/2011/06/07/anthony-weiner-twitter-dm_n_872590.html.",
      "doi": ""
    },
    {
      "text": "Buhrmester, M., Kwang, T., and Gosling, S. D. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on Psychological Science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Jakobsson, M. Experimenting on Mechanical Turk: 5 how tos. http://blogs.parc.com/blog/2009/07/experimenting-on-mechanical-turk-5-how-tos/, July 2009.",
      "doi": ""
    },
    {
      "text": "Knapp, M. L., Stafford, L., and Daly, J. A. Regrettable messages: Things people wish they hadn't said. Journal of Communication 36, 4 (1986), 40--58.",
      "doi": ""
    },
    {
      "text": "Lampinen, A., Lehtinen, V., Lehmuskallio, A., and Tamminen, S. We're in it together: Interpersonal management of disclosure in social network services. In Proc. CHI 2011, ACM (2011), 3217--3226.  ",
      "doi": "10.1145/1978942.1979420"
    },
    {
      "text": "Lampinen, A., Tamminen, S., and Oulasvirta, A. All my people right here, right now: Management of group co-presence on a social networking site. In Proc. GROUP 2009, ACM (2009), 281--290.  ",
      "doi": "10.1145/1531674.1531717"
    },
    {
      "text": "Lieberman, E., and Miller, R. C. Facemail: Showing faces of recipients to prevent misdirected email. In Proc. SOUPS 2007, ACM (2007), 122--131.  ",
      "doi": "10.1145/1280680.1280696"
    },
    {
      "text": "Liu, H., Lieberman, H., and Selker, T. Automatic affective feedback in an email browser. Tech. rep., MIT Media Laboratory Software Agents Group, 2002.",
      "doi": ""
    },
    {
      "text": "Marwick, A. E., and boyd, d. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (Feb. 2011), 114--133.",
      "doi": ""
    },
    {
      "text": "McLaughlin, M. L., Cody, M. J., and O'Hair, H. D. The management of failure events: Some contextual determinants of accounting behavior. Human Communication Research 9, 3 (1983), 208--224.",
      "doi": ""
    },
    {
      "text": "Meyer, J. R. Regretted messages: Cognitive antecedents and post hoc reflection. Journal of Language and Social Psychology 30, 4 (2011), 376--395.",
      "doi": ""
    },
    {
      "text": "Meyer, J. R., and Rothenberg, K. Repairing regretted messages: Effects of emotional state, relationship type, and seriousness of offense. Communication Research Reports 21, 4 (2004), 348--356.",
      "doi": ""
    },
    {
      "text": "Perlow, J. New in labs: Stop sending mail you later regret, 2008. Official Gmail Blog. http://gmailblog.blogspot.com/2008/10/new-in-labs-stop-sending-mail-you-later.html.",
      "doi": ""
    },
    {
      "text": "Ross, J., Irani, L., Silberman, M. S., Zaldivar, A., and Tomlinson, B. Who are the crowdworkers?: Shifting demographics in Mechanical Turk. In Ext. Abstracts CHI 2010, ACM (2010), 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Wang, Y., Norcie, G., Komanduri, S., Acquisti, A., Leon, P. G., and Cranor, L. F. \"I regretted the minute I pressed share\": A qualitative study of regrets on Facebook. In Proc. SOUPS 2011, ACM (2011).  ",
      "doi": "10.1145/2078827.2078841"
    },
    {
      "text": "Wisniewski, P., Lipford, H., and Wilson, D. Fighting for my space: Coping mechanisms for SNS boundary regulation. In Proc. CHI 2012, ACM (2012), 609--618.  ",
      "doi": "10.1145/2207676.2207761"
    }
  ]
}