{
  "doi": "10.1145/2470654.2470696",
  "title": "Individual user characteristics and information visualization: connecting the dots through eye tracking",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "295-304",
  "year": 2013,
  "badges": [],
  "abstract": "There is increasing evidence that users' characteristics such as cognitive abilities and personality have an impact on the effectiveness of information visualization techniques. This paper investigates the relationship between such characteristics and fine-grained user attention patterns. In particular, we present results from an eye tracking user study involving bar graphs and radar graphs, showing that a user's cognitive abilities such as perceptual speed and verbal working memory have a significant impact on gaze behavior, both in general and in relation to task difficulty and visualization type. These results are discussed in view of our long-term goal of designing information visualisation systems that can dynamically adapt to individual user characteristics.",
  "tags": [
    "eye tracking",
    "information visualization",
    "user characteristics",
    "adaptive information visualization"
  ],
  "authors": [
    {
      "name": "Dereck Toker",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508705756",
      "orcid": "missing"
    },
    {
      "name": "Cristina Conati",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100274362",
      "orcid": "missing"
    },
    {
      "name": "Ben Steichen",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659574514",
      "orcid": "missing"
    },
    {
      "name": "Giuseppe Carenini",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100417032",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amar, R. A., Eagan J., & Stasko, J. T. Low-Level Components of Analytic Activity in Information Visualization. In 16th IEEE Vis. Conf., (2005), 15--21.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Bautista, J., & Carenini, G. An integrated task-based framework for the design and evaluation of visualizations to support preferential choice. Proc. of the conf. on Adv. Vis. Interf. (AVI '06), (2006), 217--224.  ",
      "doi": "10.1145/1133265.1133308"
    },
    {
      "text": "Conati, C., & Maclaren, H. Exploring the Role of Individual Differences in Information Visualization. In Proc. of the working conf. on Adv. visual interfaces (AVI '08). ACM, New York, NY, USA, (2008), 199--20.  ",
      "doi": "10.1145/1385569.1385602"
    },
    {
      "text": "Courtemanche, F., Aïmeur, E., Dufresne, A., Najjar, M., & Eboa, F. H. M. Activity recognition using eye-gaze movements and traditional interactions. In Proceedings of In-teracting with Computers, (2011), 202--213.  ",
      "doi": "10.1016/j.intcom.2011.02.008"
    },
    {
      "text": "Eivazi, S., Bednarik, R. Predicting Problem-Solving Behavior and Performance Levels from Visual Attention Data. In the proceedings of 2nd Workshop on Eye Gaze in Intelligent Human Machine Interaction at IUI 2011, (2011), 9--16.",
      "doi": ""
    },
    {
      "text": "Ekstrom, R., French, J., Harman, H. and Dermen, D, Manual from Kit of Factor-References Cognitive Tests. Educational Testing Service (1976): Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "Few, S. Keep Radar Graphs Below the Radar - Far Below: Information Management Magazine, (2005).",
      "doi": ""
    },
    {
      "text": "Field, A. Discovering Statistics Using SPSS, Third Edition. Sage Publications, London, (2009).",
      "doi": ""
    },
    {
      "text": "Field & Hole, How to Design and Report Experiments. Sage Publications, (2003).",
      "doi": ""
    },
    {
      "text": "Fukuda, K., & Vogel, E. K. Human variation in overriding attentional capture. Journal of Neuroscience, (2009), 8726--8733.",
      "doi": ""
    },
    {
      "text": "Goldberg, J. H., & Helfman, J. I. Comparing Information Graphics: A Critical Look at Eye Tracking, BELIV '10, (2010), 182--195.  ",
      "doi": "10.1145/2110192.2110203"
    },
    {
      "text": "Goldberg, J. H., & Helfman, J. I. Eye tracking for visualization evaluation: Reading values on linear versus radial graphs. Inf. Vis. 10(3), (2011), 182--195.  ",
      "doi": "10.1177/1473871611406623"
    },
    {
      "text": "Gotz D., & Wen, Z.. Behavior-Driven Visualization Recommendation. Int. Conf. on Intelligent User Interfaces, (2009), 315--324.  ",
      "doi": "10.1145/1502650.1502695"
    },
    {
      "text": "Grawemeyer, B. Evaluation of ERST - an external representation selection tutor. In Proc. of the 4th int. conf. on Diagram. Repr. and Inference, (2006), 154--167.  ",
      "doi": "10.1007/11783183_21"
    },
    {
      "text": "Green, T. M., & Fisher, B. Impact of personality factors on interface interaction and development of user profiles: Next steps in the Personal Equation of Interaction. Inf. Visualization, 11(2), (2012), 1--17.",
      "doi": ""
    },
    {
      "text": "Grindinger, T., Duchowski, A., & Sawyer, M. Groupwise similarity and classification of aggregate scanpaths. In Proceedings of the 2010 Symposium on Eye-Tracking Research 38, (2010), 101--104.  ",
      "doi": "10.1145/1743666.1743691"
    },
    {
      "text": "Iqbal, S. T., & Bailey, B. P. Using eye gaze patterns to identify user tasks. In: The Grace Hopper Celebration of Women in Computing, (2004).",
      "doi": ""
    },
    {
      "text": "Jameson, A. (2008). Adaptive Interfaces and Agents. The human-computer interaction handbook: Fundamentals, evolving technologies and emerging applications (2nd ed.), pp. 433--458.",
      "doi": ""
    },
    {
      "text": "Jarodzka, H., Scheiter, K., Gerjets, P., & Van Gog, T. In the eyes of the beholder: How experts and novices interpret dynamic stimuli. Learning and Instruction. 20, (2010), 146--154.",
      "doi": ""
    },
    {
      "text": "Keith, R. Eye movements and cognitive processes in reading, visual search, and scene perception. Eye Movement Research Mechanisms, Processes, and Applications. North-Holland Press, (1995).",
      "doi": ""
    },
    {
      "text": "Kruschke, J. K., Kappenman, E. S., & Hetrick, W. P. Eye gaze and individual differences consistent with learned attention in associative blocking and highlighting. Journal of Experimental Psychology: Learning, Memory, and Cognition, 31, (2005), 830--845.",
      "doi": ""
    },
    {
      "text": "Plumlee, M. D., & Ware, C. Zooming versus multiple window interfaces: Cognitive costs of visual comparisons. ACM Trans. Comput.-Hum. Interact, 13, 2, (2006), 179--209.  ",
      "doi": "10.1145/1165734.1165736"
    },
    {
      "text": "Rayner, K. Eye movements in reading and information processing: 20 years of research. Psychological Bulletin 124, (1998), 372--422.",
      "doi": ""
    },
    {
      "text": "Simola, J., Salojarvi, J., & Kojo, I. Using hidden Markov model to uncover processing states from eye movements in information search tasks. Cognitive Systems Research. 9, (2008), 237--251.  ",
      "doi": "10.1016/j.cogsys.2008.01.002"
    },
    {
      "text": "Steichen, B., Carenini, G., & Conati, C. User-Adaptive Information Visualization - Using eye gaze data to infer visualization tasks and user cognitive abilities. Int. Conf. on Intelligent User Interfaces, (2013), (to appear).  ",
      "doi": "10.1145/2449396.2449439"
    },
    {
      "text": "Tai, R. H., Loehr, J. F., & Brigham, F. J. An Exploration of the Use of Eye-Gaze Tracking to Study Problem-Solving on Standardized Science Assessments. International Journal of Research & Method in Education 29, 2, (2006), 185--208.",
      "doi": ""
    },
    {
      "text": "Tang, H., Topczewski, J. J., Topczewski, A. M. & Pienta, N. J. Permutation test for groups of scanpaths using normalized Levenshtein distances and application in NMR questions. In Proc. of the Symposium on Eye Tracking Research and Applications, (2012), 169--172.  ",
      "doi": "10.1145/2168556.2168584"
    },
    {
      "text": "Toker, D., Conati, C., Carenini, G., & Haraty, M. Towards Adaptive Information Visualization: On the Influence of User Characteristics. In Proc. of the 19th international conference on user modeling, adaptation, and personalization, UMAP, (2012), 274--285.  ",
      "doi": "10.1007/978-3-642-31454-4_23"
    },
    {
      "text": "Turner, M. L., & Engle, R. W. Is working memory capacity task dependent? Journal of Memory and Language, 28(2), (1989), 127--154.",
      "doi": ""
    },
    {
      "text": "Velez, M. C., Silver, D., & Tremaine, M. Understanding visualization through spatial ability differences. Proceedings of Visualization, (2005), 511--518.",
      "doi": ""
    },
    {
      "text": "Ziemkiewicz, C., et al. How Locus of Control Influences Compatibility with Visualization Style. Proc. IEEE VAST, (2011), 81--90.",
      "doi": ""
    }
  ]
}