{
  "doi": "10.1145/2470654.2481413",
  "title": "Effects of the display angle in museums on user's cognition, behavior, and subjective responses",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2979-2988",
  "year": 2013,
  "badges": [],
  "abstract": "In order to achieve the intended level of communication with visitors in museums where large displays are installed, it is essential to understand how various display factors affect visitors. We explore the effects of the display angle on individual users. In our experiment, we set up three types of flat displays - vertical, horizontal, and tilted - and comprehensively tested users' cognitive, behavioral, and subjective aspects. The results showed that a significant difference could be discerned in regards to cognitive and subjective aspects. Test results for the cognitive aspect showed that the display angle on which the displayed content was easy to understand and remember differed depending on age. Test results for the subjective aspect showed that irrespective of age, users rated tilted displays as being quicker to attract attention and easier to peruse, to understand and remember the content, and to interact with, and such displays were the most preferred.",
  "authors": [
    {
      "name": "Junko Ichino",
      "institution": "University of Electro-Communications, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81416608252/rel-imgonly/81416608252.jpg",
      "acmid": "81416608252",
      "orcid": "missing"
    },
    {
      "name": "Kazuo Isoda",
      "institution": "Dai Nippon Printing Co., Ltd., Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557412156",
      "orcid": "missing"
    },
    {
      "name": "Ayako Hanai",
      "institution": "Dai Nippon Printing Co., Ltd., Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490668180",
      "orcid": "missing"
    },
    {
      "name": "Tetsuya Ueda",
      "institution": "Dai Nippon Printing Co., Ltd., Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490660789",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bao, P. and Gergle, D. What's \"This\" You Say? The use of local references on distant displays, In Proc. CHI 2009, ACM Press, (2009), 1029--1032.  ",
      "doi": "10.1145/1518701.1518858"
    },
    {
      "text": "Beyer, G., Alt, F., Müller, J., Schmidt, A., Isakovic, K., Klose, S., Schiewe, M. and Haulsen, I. Audience Behavior around Large Interactive Cylindrical Screens, In Proc. CHI 2011, ACM Press, (2011), 1021--1030.  ",
      "doi": "10.1145/1978942.1979095"
    },
    {
      "text": "Bolton, J., Kim, K. and Vertegaal, R. A comparison of competitive and cooperative task performance using spherical and flat displays, In Proc. CSCW 2012, ACM Press, (2012), 529--538.  ",
      "doi": "10.1145/2145204.2145286"
    },
    {
      "text": "Forlines, C., Shen, C., Wigdor, D., and Balakrishnan, R. Exploring the effects of group size and display configuration on visual search, In Proc. CSCW 2006, ACM Press, (2006), 11--20.  ",
      "doi": "10.1145/1180875.1180878"
    },
    {
      "text": "Hart, R. A., and Moore, G. T. The development of spatial cognition: A Review. Image and environment: Cognitive mapping and spatial behavior, In Downs, R. M. and Stea, D. (Eds.), Aldine Publishing (1973), 246--295.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Burmester, M. and Koller, F. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualität, Mensch & Computer 2003, Interaktion in Bewegung, B. G. Teubner (2003), 187--196.",
      "doi": ""
    },
    {
      "text": "Hawkey, K., Kellar, M., Reilly, D., Whalen, T. and Inkpen, K. M. The Proximity Factor: Impact of Distance on Co-located Collaboration, In Proc. GROUP 2005, ACM Press, (2005), 31--40.  ",
      "doi": "10.1145/1099203.1099209"
    },
    {
      "text": "Hornecker, E. and Nicol, E. What Do Lab-based User Studies Tell Us About In-the-Wild Behavior? Insights from a Study of Museum Interactives, In Proc. Designing Interactive Systems (DIS2012), ACM Press, (2012), 358--367.  ",
      "doi": "10.1145/2317956.2318010"
    },
    {
      "text": "Ichino, J., Kanayama, N., Tano, S. and Hashiyama, T. Effects of Physical Display Size on Text Reading, Trans. of Information Processing Society of Japan, 53, 5 (2012), 1570--1580.",
      "doi": ""
    },
    {
      "text": "Inkpen, K., Hawkey, K., Kellar, M., Mandryk, R., Parker, K., Reilly, D., Scott, S., and Whalen, T. Exploring Display Factors that Influence Co-Located Collaboration: Angle, Size, Number, and User Arrangement, In Proc. HCI International 2005 (2005).",
      "doi": ""
    },
    {
      "text": "Kendall, M. G. Rank correlation method, 4th Ed., Charles Griffin, Londres (1975).",
      "doi": ""
    },
    {
      "text": "Kuikkaniemi, K., Jacucci, G., Turpeinen, M., Hoggan, E. E. and Müller, J. From Space to Stage: How Interactive Screens Will Change Urban Life, IEEE Computer, 44, 6, IEEE (2011), 40--47.  ",
      "doi": "10.1109/MC.2011.135"
    },
    {
      "text": "Müller-Tomfelde, C. Wessels, A. and Schremmer, C. Tilted tabletops: In between horizontal and vertical workspaces, In Proc. Tabletop 2008, (2008), 49--56.",
      "doi": ""
    },
    {
      "text": "National Council of University Museology Course of Japan. New Museology, Fuyo-Syobo Syuppann (2008).",
      "doi": ""
    },
    {
      "text": "Potvin, B., Swindells, C., Tory, M. and Storey, M. A. Comparing Horizontal and Vertical Surfaces for a Collaborative Design Task, Advances in Human-Computer Interaction, 2012 (2012), 10 pages.  ",
      "doi": "10.1155/2012/137686"
    },
    {
      "text": "Rogers, Y. and Lindley, S. Collaborating around vertical and horizontal large interactive displays: which way is best? Interacting with Computers, 16, 6 (2004), 1133--1152.",
      "doi": ""
    },
    {
      "text": "Ryall, K., Forlines, C., Shen, C. and Morris, M. R. Exploring the Effects of Group Size and Table Size on Interactions with Tabletop Shared-Display Groupware, In Proc. CSCW 2004, ACM Press, (2004), 284--293.  ",
      "doi": "10.1145/1031607.1031654"
    },
    {
      "text": "Shigemasu, H., Morita, T., Matsuzaki, N., Sato, T., Harasawa, M. and Aizawa, K. Effects of physical Display size and amplitude of oscillation on visually induced motion sickness, In Proc. VRST 2006, ACM Press, (2006), 372--375.  ",
      "doi": "10.1145/1180495.1180571"
    },
    {
      "text": "Tan, D. S., Gergle, D., Scupelli, P. and Pausch, R. Physically large displays improve performance on spatial tasks, ACM Trans. Computer-Human Interaction, 13, 1 (2006), 71--99.  ",
      "doi": "10.1145/1143518.1143521"
    },
    {
      "text": "The Japan Society for Exhibition studies. Exhibitionology, Yuzankaku (2010).",
      "doi": ""
    },
    {
      "text": "Wallace, J., Mandryk, R., Inkpen, K. Comparing Content and Input Redirection in MDEs, In Proc. CSCW 2008, ACM Press, (2008), 157--166.  ",
      "doi": "10.1145/1460563.1460588"
    },
    {
      "text": "Wigdor, D., Shen, C., Forlines, C., and Balakrishnan, R. Effects of Display Position and Control Space Orientation on User Preference and Performance, In Proc. CHI 2006, ACM Press, (2006), 309--318.  ",
      "doi": "10.1145/1124772.1124819"
    }
  ]
}