{
  "doi": "10.1145/2470654.2470771",
  "title": "A longitudinal study of follow predictors on twitter",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "821-830",
  "year": 2013,
  "badges": [],
  "abstract": "Follower count is important to Twitter users: it can indicate popularity and prestige. Yet, holistically, little is understood about what factors -- like social behavior, message content, and network structure - lead to more followers. Such information could help technologists design and build tools that help users grow their audiences. In this paper, we study 507 Twitter users and a half-million of their tweets over 15 months. Marrying a longitudinal approach with a negative binomial auto-regression model, we find that variables for message content, social behavior, and network structure should be given equal consideration when predicting link formations on Twitter. To our knowledge, this is the first longitudinal study of follow predictors, and the first to show that the relative contributions of social behavior and mes-sage content are just as impactful as factors related to social network structure for predicting growth of online social networks. We conclude with practical and theoretical implications for designing social media technologies.",
  "authors": [
    {
      "name": "C.J. Hutto",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557261156",
      "orcid": "missing"
    },
    {
      "name": "Sarita Yardi",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/do/10.1145/contrib-81309483660/rel-imgonly/sarita_large.jpg",
      "acmid": "81309483660",
      "orcid": "missing"
    },
    {
      "name": "Eric Gilbert",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489255",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. Lix and Rix: Variations on a Little-Known Readability Index. J. of Reading 26, 6 (1983), 490--496.",
      "doi": ""
    },
    {
      "text": "Bakshy, E., Hofman, J. M., Mason, W., and Watts, D. Everyone's an Influencer: Quantifying Influence on Twitter. ICWSM (2011).",
      "doi": ""
    },
    {
      "text": "Barabási, A. L. and Albert, R. Emergence of Scaling in Random Networks. Science 286, (1999), 509--512.",
      "doi": ""
    },
    {
      "text": "Bourdieu, P. The forms of capital. In J. C. Richardson, ed., Handbook of Theory and Research for the Sociology of Education. Greenwood, New York, 1985, 241--258.",
      "doi": ""
    },
    {
      "text": "boyd, danah, Golder, S. A., and Lotan, G. Tweet, Tweet, Retweet: Conversational Aspects of Retweeting on Twitter. HICSS (2010).  ",
      "doi": "10.1109/HICSS.2010.412"
    },
    {
      "text": "Burke, M., Kraut, R., and Marlow, C. Social Capital on Facebook: Differentiating Uses and Users. CHI (2011).  ",
      "doi": "10.1145/1978942.1979023"
    },
    {
      "text": "Cameron, A. C. and Trivedi, P. K. Regression Analysis of Count Data. Cambridge University Press, NY, 1998.",
      "doi": ""
    },
    {
      "text": "Cartwright, D. and Harary, F. Structural balance: A generalization of Heider's theory. Psychological Review 63, 5 (1956), 277--293.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. B. Influence: the psychology of persuasion. Collins, (2007).",
      "doi": ""
    },
    {
      "text": "Davidov, D., Tsur, O., and Rappoport, A. Enhanced Sentiment Learning Using Twitter Hashtags and Smileys. COLING (2010). ",
      "doi": "10.5555/1944566.1944594"
    },
    {
      "text": "Donath, J. S. Signals, Truth, and Design. MIT Press, Cambridge, MA, forthcoming.",
      "doi": ""
    },
    {
      "text": "Donath, J. S. Social Signals in Supernets. J. of Computer-Mediated Communication 13, 1 (2007), article 12.",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Easley, D. and Kleinberg, J. Networks, Crowds, and Markets: Reasoning About a Highly Connected World. Cambridge University Press, Cambridge, MA, 2010. ",
      "doi": "10.5555/1805895"
    },
    {
      "text": "Feld, S. The Focused Organization of Social Ties. The American J. of Sociology 86, 5 (1981), 1015--1035.",
      "doi": ""
    },
    {
      "text": "Gilbert, E. and Karahalios, K. Predicting tie strength with social media. CHI (2009), 211--220.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Gilbert, E. Predicting Tie Strength in a New Medium. CSCW (2012).  ",
      "doi": "10.1145/2145204.2145360"
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Anchor, 1959.",
      "doi": ""
    },
    {
      "text": "Golder, S. A. and Yardi, S. Structural Predictors of Tie Formation in Twitter: Transitivity and Mutuality. IEEE SocialCom, (2010).  ",
      "doi": "10.1109/SocialCom.2010.22"
    },
    {
      "text": "Haewoon Kwak, Sue Moon, and Wonjae Lee. More of a Receiver Than a Giver: Why Do People Unfollow in Twitter? ICWSM (2012).",
      "doi": ""
    },
    {
      "text": "Hargittai, E. and Litt, E. The Tweet Smell of Celebrity Success: Explaining Variation in Twitter Adoption among a Diverse Group of Young Adults. New Media & Society 13, 5 (2011), 824--842.",
      "doi": ""
    },
    {
      "text": "Heider, F. Attitudes and cognitive organization. The Journal of Psychology 21, 1 (1946), 107--112.",
      "doi": ""
    },
    {
      "text": "Honeycutt, C. and Herring, S. C. Beyond Microblogging: Conversation and Collaboration via Twitter. HICSS (2009).",
      "doi": ""
    },
    {
      "text": "Java, A., Song, X., Finin, T., and Tseng, B. Why we twitter: understanding microblogging usage and communities. Web-KDD (2007), 56--65.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Katz, M. L. and Shapiro, C. Network Externalities, Competition, and Compatibility. The American Economic Review 75, 3 (1985), 424--440.",
      "doi": ""
    },
    {
      "text": "Kivran-Swaine, F., Govindan, P., and Naaman, M. The impact of Network Structure on Breaking Ties in Online Social Networks: Unfollowing on Twitter. CHI (2011).  ",
      "doi": "10.1145/1978942.1979105"
    },
    {
      "text": "Kivran-Swaine, F. and Naaman, M. Network Properties and Social Sharing of Emotions in Social Awareness Streams. CSCW (2011).  ",
      "doi": "10.1145/1958824.1958882"
    },
    {
      "text": "Kollock, P. The Economies of Online Cooperation: Gifts and Public Goods in Cyberspace. In M. Smith and P. Kollock, eds., Communities in Cyberspace. Routledge, New York, 1999, 220--239.",
      "doi": ""
    },
    {
      "text": "Kwak, H., Chun, H., and Moon, S. Fragile Online Relationship: A First Look at Unfollow Dynamics in Twitter. CHI (2011).  ",
      "doi": "10.1145/1978942.1979104"
    },
    {
      "text": "Kwak, H., Lee, C., Park, H., and Moon, S. What is Twitter, a social network or a news media? WWW (2010).  ",
      "doi": "10.1145/1772690.1772751"
    },
    {
      "text": "Lampe, C. A. C., Ellison, N., and Steinfield, C. A familiar face(book): profile elements as signals in an online social network. CHI (2007), 435--444.  ",
      "doi": "10.1145/1240624.1240695"
    },
    {
      "text": "Liben-Nowell, D. and Kleinberg, J. The link prediction problem for social networks. CIKM (2003), 556--559.  ",
      "doi": "10.1145/956863.956972"
    },
    {
      "text": "McPherson, M., Smith-Lovin, L., and Cook, J. M. Birds of a Feather: Homophily in Social Networks. Annual Review of Sociology 27, 1 (2001), 415--438.",
      "doi": ""
    },
    {
      "text": "Naaman, M., Boase, J., and Lai, C.-H. Is it Really About Me? Message Content in Social Awareness Streams. CSCW (2010), 189--192.  ",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Pandit, S. M. and Wu, S.-M. Time Series and System Analysis With Applications. Krieger, Malabar, FL, 2001.",
      "doi": ""
    },
    {
      "text": "Pang, B. and Lee, L. Opinion mining and sentiment analysis. Foundations and Trends in Information Retrieval 2, 1-2 (2008), 1--135.  ",
      "doi": "10.1561/1500000011"
    },
    {
      "text": "Pennebaker, J. W., Francis, M., and Booth, R. Linguistic Inquiry and Word Count: LIWC 2001. Erlbaum Publishers, Mahwah, NJ, 2001.",
      "doi": ""
    },
    {
      "text": "Quercia, D., Ellis, J., Capra, L., and Crowcroft, J. In the Mood for Being Influential on Twitter. IEEE SocialCom, (2011), 307--314.",
      "doi": ""
    },
    {
      "text": "Resnick, P., Konstan, J., Chen, Y., and Kraut, R. Starting New Online Communities. In Evidence-based social design: Mining the social sciences to build online communities. MIT Press, Cambridge, MA, 2012.",
      "doi": ""
    },
    {
      "text": "Tidwell, L. C. and Walther, J. B. Computer-Mediated Communication Effects on Disclosure, Impressions, and Interpersonal Evaluations: Getting to Know One Another a Bit at a Time. Human Communication Research 28, 3 (2002).",
      "doi": ""
    },
    {
      "text": "Wang, Y.-C. and Kraut, R. Twitter and the development of an audience: those who stay on topic thrive! CHI (2012).  ",
      "doi": "10.1145/2207676.2208614"
    },
    {
      "text": "Wellman, B. and Wortley, S. Different strokes from different folks: Community ties and social support. American J. of Sociology 96, (1990), 558--588.",
      "doi": ""
    },
    {
      "text": "Zhang, J., Qu, Y., Cody, J., and Wu, Y. A case study of micro-blogging in the enterprise: use, value, and related issues. CHI (2010), 123--132.  ",
      "doi": "10.1145/1753326.1753346"
    },
    {
      "text": "Zhao, D. and Rosson, M. B. How and why people Twitter: the role that micro-blogging plays in informal communication at work. GROUP (2009), 243--252.  ",
      "doi": "10.1145/1531674.1531710"
    }
  ]
}