{
  "doi": "10.1145/2470654.2466425",
  "title": "Reducing disruption from subtle information delivery during a conversation: mode and bandwidth investigation",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3111-3120",
  "year": 2013,
  "badges": [],
  "abstract": "With proliferation of mobile devices that provide ubiquitous access to information, the question arises of how distracting processing information in social settings can be, especially during face-to-face conversations. However, relevant information presented at opportune moments may help enhance conversation quality. In this paper, we study how much information users can consume during a conversation and what information delivery mode, via audio or visual aids, helps them effectively conceal the fact that they are receiving information. We observe that users can internalize more information while still disguising this fact the best when information is delivered visually in batches (multiple pieces of information at a time) and perform better on both dimensions if information is delivered while they are not speaking. Interestingly, participants qualitatively did not prefer this mode as being the easiest to use, preferring modes that displayed one piece of information at a time.",
  "tags": [
    "augmented reality",
    "attention",
    "design",
    "human factors"
  ],
  "authors": [
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Karin Strauss",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343506253",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albanesius, C. Google 'project glass' replaces the smartphone with glasses, http://www.pcmag.com/article2/0,2817,2402613,00.asp, 2012.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Cook, M. Gaze and Mutual Gaze. Cambridge University Press, London, 1976.",
      "doi": ""
    },
    {
      "text": "Bateman, S., Teevan, J. and White, R. W. The Search Dashboard: Changing How People Search Using a Reflective Interface, CHI 2012, 1785--1794.  ",
      "doi": "10.1145/2207676.2208311"
    },
    {
      "text": "Bronkhorst, A. W. The Cocktail Party Phenomenon: A Review on Speech Intelligibility in Multiple-Talker Conditions. Acta Acustica 86, 2000. 117--128.",
      "doi": ""
    },
    {
      "text": "Brumby, D. P., Davies, S., Janssen, C. P. and Grace, J. J. Fast or safe?: how performance objectives determine modality output choices while interacting on the move. CHI 2011, 473--482.  ",
      "doi": "10.1145/1978942.1979009"
    },
    {
      "text": "Brush, A. B., Meyers, B. R., Scott, J. and Venolia, G. D. Exploring Awareness Needs and Information Display Preferences Between Coworkers CHI 2009, 2091--2094.  ",
      "doi": "10.1145/1518701.1519018"
    },
    {
      "text": "Cakmakci, O. and Rolland, J. Head-worn displays: a review. Journal of Display Technology, 2006, 2 (3). 199--216.",
      "doi": ""
    },
    {
      "text": "Campbell, S. W. and Kwak, N. Mobile Communication and Civil Society: Linking Patterns and Places of Use to Engagement with Others in Public. Human Communication Research, 2011, 37 (2). 207--222.",
      "doi": ""
    },
    {
      "text": "Dabbish, L. and Kraut, R. E., Controlling interruptions: awareness displays and social motivation for coordination. in CSCW 2004, 182--191.  ",
      "doi": "10.1145/1031607.1031638"
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. Doubleday, Garden City, NY, 1959.",
      "doi": ""
    },
    {
      "text": "Gowans, G., Campbell, J., Alm, N., Dye, R., Astell, A. and Ellis, M. Designing a multimedia conversation aid for reminiscence therapy in dementia care environments. CHI 2004, 825--836.  ",
      "doi": "10.1145/985921.985943"
    },
    {
      "text": "Iqbal, S. T., Grudin, J. and Horvitz, E. Peripheral computing during presentations: perspectives on costs and preferences, CHI 2011, 891--894.  ",
      "doi": "10.1145/1978942.1979073"
    },
    {
      "text": "Jansen, B. J. Seeking and implementing automated assitance during the search process. Information Processing and Management, 2005, 41, 909--928.  ",
      "doi": "10.1016/j.ipm.2004.04.017"
    },
    {
      "text": "Ko, A. J., DeLine, R. and Venolia, G. Information Needs in Collocated Software Development Teams International Conference on Software Engineering, 2007, 344--353.  ",
      "doi": "10.1109/ICSE.2007.45"
    },
    {
      "text": "Maglio, P. and Campbell, C. S., Tradeoffs in Displaying Peripheral Information. CHI 2000, 241--248.  ",
      "doi": "10.1145/332040.332438"
    },
    {
      "text": "Mann, S. Wearable Computing: A First Step Towards Personal Imaging. IEEE Computer, 1997, 30 (2). 25--32.  ",
      "doi": "10.1109/2.566147"
    },
    {
      "text": "McAtamney, G. and Parker, C. An examination of the effects of a wearable display on informal face-to-face communication. CHI 2006, 45--54.  ",
      "doi": "10.1145/1124772.1124780"
    },
    {
      "text": "McCrickard, D. S., Catrambone, R., Chewar, C. M. and Stasko, J. T. Establishing Tradeoffs that Leverage Attention for Utility: Empirically Evaluating Information Display in Notification Systems. IJHCS, 2003, 58 (5). 547--582.  ",
      "doi": "10.1016/S1071-5819%2803%2900022-3"
    },
    {
      "text": "Milrad, M. and Spikol, D. Anytime, Anywhere Learning Supported by Smart Phones: Experiences and Results from the MUSIS Project. Educational Technology and Society, 2007, 10 (4). 62--70.",
      "doi": ""
    },
    {
      "text": "Papagiannakis, G., Singh, G. and N. Magnenat-Thalmann A survey of mobile and wireless technologies for augmented reality systems. Journal of Visualization and Computer Animation, 2008 19. 3--22.  ",
      "doi": "10.5555/1348083.1348087"
    },
    {
      "text": "Rash, C.e.a. The Effect of a Monocular Helmet-Mounted Display on Aircrew Health: A Cohort Study of Apache Ah Mk1 Pilots Four-year Review, USA Army Aeromedical Research Laboratory, 2010.",
      "doi": ""
    },
    {
      "text": "Rauterberg, M. Ubiqutious and Mobile Computing - New Directions in User System Interaction. IEEE Proceedings Symposium on Wireless Multimedia, 1998.",
      "doi": ""
    },
    {
      "text": "Rhodes, B., Minar, N. and Weaver, J. Wearable computing meets ubiquitous computing: Reaping the best of both worlds ISWC 1999, 141--149. ",
      "doi": "10.5555/519309.856497"
    },
    {
      "text": "Romero, N., Szostek, A., Kaptein, M. and Markoloulos, P. Behaviours and preferences when coordinating mediated interruptions: Social and system influence ECSCW, 2007, 351--370.",
      "doi": ""
    },
    {
      "text": "Roussos, G., Marsh, A. J. and Maglavera, S. Enabling Pervasive Computing with Smart Phones. IEEE Pervasive Computing, 2005 4 (2). 20--27.  ",
      "doi": "10.1109/MPRV.2005.30"
    },
    {
      "text": "Scherl, C. R. and Haley, J. Computer Monitor Supervision: A clinical note. The American Journal of Family Therapy, 2000, 28. 275--283.",
      "doi": ""
    },
    {
      "text": "Shirey, W. J. The Frustration Phenomenon: Exploring Leader-Follower Relationships in the Information Age. International Journal of Leadership Studies, 2008, 3 (2). 223--229.",
      "doi": ""
    },
    {
      "text": "Subramaniam, P. and Woods, B. Towards the therapeutic use of information and communication technology in reminiscence work for people with dementia; a systematic review. Int. J. Comput. Healthc., 2010, 1 (2). 106--125.  ",
      "doi": "10.1504/IJCIH.2010.037457"
    },
    {
      "text": "Sutherland, I. E. A Head-mounted Three Dimensional Display The Fall Joint Computer Conference, part 1, AFIPS '68(Fall part 1), ACM, New York, NY, 1968, 757--764.  ",
      "doi": "10.1145/1476589.1476686"
    },
    {
      "text": "Tamminen, S., Oulasvirta, A., Toiskallio, K. and Kankainen, A. Understanding mobile contexts. Personal Ubiquitous Comput., 2004, 8 (2). 135--143.",
      "doi": ""
    },
    {
      "text": "Treisman, A. M. Contextual Cues in Selective Listening. Quarterly Journal of Exp. Psychology, 1960, 12. 242--248.",
      "doi": ""
    },
    {
      "text": "vanKrevelen, D. and Poelman, R. A Survey of Augmented Reality Technologies, Applications and Limitations. The International Journal of Virtual Reality, 2010, 9 (2). 1--20.",
      "doi": ""
    },
    {
      "text": "White, R. W. and Buscher, G. Characterizing Local Interests and Local Knowledge, CHI 2012, 1607--1610.  ",
      "doi": "10.1145/2207676.2208283"
    },
    {
      "text": "Wiese, J., Biehl, J., Turner, T. and van Melle, W. Beyond 'yesterday's tomorrow': Towards the design of awareness technologies for the contemporary worker, MobileHCI, 2011, 455--464.  ",
      "doi": "10.1145/2037373.2037441"
    }
  ]
}