{
  "doi": "10.1145/2470654.2466426",
  "title": "Adaptive automation and cue invocation: the effect of cue timing on operator error",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3121-3130",
  "year": 2013,
  "badges": [],
  "abstract": "Adaptive automation (AA) can improve performance while addressing the problems associated with a fully automated system. The best way to invoke AA is unclear, but two ways include critical events and the operator's state. A hybrid model of AA invocation, the dynamic model of operator overload (DMOO), that takes into account critical events and the operator's state was recently shown to improve performance. The DMOO initiates AA using critical events and attention allocation, informed by eye movements. We compared the DMOO with an inaccurate automation invocation system and a system that invoked AA based only on critical events. Fewer errors were made with DMOO than with the inaccurate system. In the critical event condition, where automation was invoked at an earlier point in time, there were more memory and planning errors, while for the DMOO condition, which invocated automation at a later point in time, there were more perceptual errors. These findings provide a framework for reducing specific types of errors through different automation invocation.",
  "tags": [
    "supervisory control",
    "trust in automation",
    "situation awareness",
    "adaptive automation",
    "fan-out",
    "errors",
    "eye tracking"
  ],
  "authors": [
    {
      "name": "Daniel Gartenberg",
      "institution": "George Mason University, Fairfax, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81554045956",
      "orcid": "missing"
    },
    {
      "name": "Leonard A. Breslow",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100049234",
      "orcid": "missing"
    },
    {
      "name": "Joo Park",
      "institution": "George Mason University, Fairfax, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556991156",
      "orcid": "missing"
    },
    {
      "name": "J. Malcolm McCurry",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583559",
      "orcid": "missing"
    },
    {
      "name": "J. Gregory Trafton",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100061774",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Parasuraman, R., & Riley, V. A. (1997). Humans and automation: Use, misuse, disuse, abuse. Human Factors, 39, 230--253.",
      "doi": ""
    },
    {
      "text": "Lee, J., & See, K. (2004). Trust in automation: Designing for appropriate reliance. Human Factors, 46, 1, 50--80.",
      "doi": ""
    },
    {
      "text": "Sarter, N. B., Woods, D. D., & Billings, C. E. (1997). Automation surprises. Handbook of human factors and ergonomics, 2, 1926--1943.",
      "doi": ""
    },
    {
      "text": "Sheridan, T. B., & Parasuraman, R. (2006). Human-Automation Interaction. Reviews of Human Factors and Ergonomics, 1, 1, 89--129.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R. (2000). Designing automation for human use: Empirical studies and quantitative models. Ergonomics, 43, 931--951.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., & Miller, C. (2006). Delegation interfaces for human supervision of multiple unmanned vehicles: Theory, experiments, and practical applications. In N. Cooke, H. L. Pringle, H. K. Pedersen, & O. Connor (Eds). Human Factors of Remotely Operated Vehicles. Advances in Human Performance and Cognitive Engineering, 7, 251--266. Oxford, UK: Elsevier.",
      "doi": ""
    },
    {
      "text": "Scerbo, M. (2001). Adaptive automation. In W. Karwowski (Ed.), International Encyclopedia of Ergonomics and Human Factors. 1077--1079. London: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Opperman, R. (1994). Adaptive user support. Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., Bahri, T., Deaton, J., Morrison, J., & Barnes, M. (1992). Theory and design of adaptive automation in aviation systems (Progress Rep. No. NAWCADWAR-92033-60). Warminster, PA: Naval Air Warfare Center.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., Mouloua, M., & Hilburn, B. (1999). Adaptive aiding and adaptive task allocation enhance human-machine interaction. In M. W. Scerbo & M. Mouloua (Eds). Automation Technology and Human Performance: Current Research and Trends. 119--123. Mahwah, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Kaber, D. B., & Endsley, M. (2004). The effects of level of automation and adaptive automation on human performance, situation awareness and workload in a dynamic control task. Theoretical Issues in Ergonomics Science, 5, 113--153.",
      "doi": ""
    },
    {
      "text": "Moray, N., Inagaki, T., & Itoh, M. (2000). Adaptive automation, trust, and self-confidence in fault management of time-critical tasks. Journal of Experimental Psychology: Applied, 6, 44--58.",
      "doi": ""
    },
    {
      "text": "Barnes, M., Parasuraman, R., & Cosenzo, K. (2006). Adaptive automation for military robotic systems. In RTO-TR-HFM-078 Uninhabited military vehicles: Human factors issues in augmenting the force - NATO Tech. Rep., 420--440. Brussels: NATO Research and Technology Organization.",
      "doi": ""
    },
    {
      "text": "Breslow, L., Gartenberg, G., McCurry, M., & Trafton, T. (under review). Dynamic Fan out: Predicting Realtime overloading of an operator supervising multiple UAVs. IEEE.",
      "doi": ""
    },
    {
      "text": "Crandall, J. W., Goodrich, M. A., Olsen, D. R., & Nielsen, C. W. (2005) Validating Human-Robot Interaction Schemes in Multi-Tasking Environments. IEEE Transactions on Systems, Man, and Cybernetics Part-A, 35, 4, 438--449.  ",
      "doi": "10.1109/TSMCA.2005.850587"
    },
    {
      "text": "Cummings, M. L. & Mitchell, P. J. Predicting controller capacity in supervisory control of multiple UAVs. (2008) IEEE Systems, Man, and Cybernetics, Part A: Systems and Humans, 38, 451--460.  ",
      "doi": "10.1109/TSMCA.2007.914757"
    },
    {
      "text": "Parasuraman, R., Sheridan, T. B., & Wickens, C. D. (2000). A model for types and levels of human interaction with automation. IEEE Transactions on Systems, Man, and Cybernetics. Part A: Systems and Humans, 30, 286--297.  ",
      "doi": "10.1109/3468.844354"
    },
    {
      "text": "Parasuraman, R., Molloy, R., & Singh, I. L. (1993). Performance consequences of automation-induced \"complacency.\" International Journal of Aviation Psychology, 3, 1, 23.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., & Miller, C. (2004). Trust and etiquette in high-criticality automated systems. Communications of the Association for Computing Machinery, 47, 4, 51--55.  ",
      "doi": "10.1145/975817.975844"
    },
    {
      "text": "Brondimonte, M., Einstein, G. O., & McDaniel, M. A. (eds) (1996). Prospective Memory: Theory and Application. Erlbaum: Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Boussemart, Y. & Cummings, M. L. (2008). Behavioral recognition and prediction of an operator supervising multiple heterogeneous unmanned vehicles. Humans operating unmanned systems.",
      "doi": ""
    },
    {
      "text": "Marsh, R. L., & Hicks, J. L. (1998). Event-based prospective memory and executive control of working memory. Journal of Experimental Psychology: Learning, Memory, & Cognition, 24, 336--349.",
      "doi": ""
    },
    {
      "text": "McDaniel, M. A., Robinson-Riegler, B., Einstein, G. O. (1998). Prospective remembering: Perceptually driven or conceptually-driven processes? Memory and Cognition, 26, 121--134.",
      "doi": ""
    }
  ]
}