{
  "doi": "10.1145/2470654.2481369",
  "title": "Preference-based location sharing: are more privacy options really better?",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2667-2676",
  "year": 2013,
  "badges": [],
  "abstract": "We examine the effect of coarse-grained vs. fine-grained location sharing options on users' disclosure decisions when configuring a sharing profile in a location-sharing service. Our results from an online user experiment (N=291) indicate that users who would otherwise select one of the finer-grained options will employ a compensatory decision strategy when this option is removed. This means that they switch either in the direction of more privacy and less benefit, or less privacy and more benefit, depending on the subjective distance between the omitted option and the remaining options. This explanation of users' disclosure behavior is in line with fundamental decision theories, as well as the well-established notion of \"privacy calculus\". Two alternative hypotheses that we tested were not supported by our experimental data.",
  "tags": [
    "privacy calculus",
    "information disclosure",
    "location-sharing services",
    "decision making"
  ],
  "authors": [
    {
      "name": "Bart P. Knijnenburg",
      "institution": "Samsung R&D Research Center, San Jose & University of California, Irvine, Irvine, California, USA",
      "img": "/do/10.1145/contrib-81548023386/rel-imgonly/dsc_7933.jpg",
      "acmid": "81548023386",
      "orcid": "missing"
    },
    {
      "name": "Alfred Kobsa",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548023291",
      "orcid": "missing"
    },
    {
      "name": "Hongxia Jin",
      "institution": "Samsung R&D Research Center, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100055134",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. and Grossklags, J. What Can Behavioral Economics Teach Us About Privacy? In A. Acquisti, S. De Capitani di Vimercati, S. Gritzalis and C. Lambrinoudakis, eds., Digital Privacy: Theory, Technologies, and Practices. Taylor & Francis, 2008, 363--377.",
      "doi": ""
    },
    {
      "text": "Acquisti, A. Privacy in Electronic Commerce and the Economics of Immediate Gratification. EC'04 ACM Conference on Electronic Commerce, (2004), 21--29.  ",
      "doi": "10.1145/988772.988777"
    },
    {
      "text": "Anthony, D., Henderson, T., and Kotz, D. Privacy in Location-Aware Computing Environments. IEEE Pervasive Computing 6, 4 (2007), 64--72.  ",
      "doi": "10.1109/MPRV.2007.83"
    },
    {
      "text": "Balebako, R., Leon, P. G., Mugan, J., Acquisti, A., Cranor, L. F., and Sadeh, N. Nudging users towards privacy on mobile devices. CHI 2011 Workshop on Persuasion, Influence, Nudge and Coercion Through Mobile Devices, (2011).",
      "doi": ""
    },
    {
      "text": "Benisch, M., Kelley, P. G., Sadeh, N., and Cranor, L. F. Capturing location-privacy preferences: quantifying accuracy and user-burden tradeoffs. Personal Ubiquitous Computing 15, 7 (2011), 679--694.  ",
      "doi": "10.1007/s00779-010-0346-0"
    },
    {
      "text": "Bettman, J. R., Luce, M. F., and Payne, J. W. Constructive consumer choice processes. Journal of consumer research 25, 3 (1998), 187--217.",
      "doi": ""
    },
    {
      "text": "Bokhove, W., Hulsebosch, B., Van Schoonhoven, B., Sappelli, M., and Wouters, K. User Privacy in Applications for Well-being and Well-working. Proc. AMBIENT 2012, (2012), 53--59.",
      "doi": ""
    },
    {
      "text": "Boyles, J. L., Smith, A., and Madden, M. Privacy and Data Management on Mobile Devices. Pew Internet & American Life Project, 2012.",
      "doi": ""
    },
    {
      "text": "Brandimarte, L., Acquisti, A., and Loewenstein, G. Misplaced Confidences: Privacy and the Control Paradox. Social Psychological and Personality Science, (2012).",
      "doi": ""
    },
    {
      "text": "Campbell, J. E. and Carlson, M. Panopticon.com: Online Surveillance and the Commodification of Privacy. Journal of Broadcasting & Electronic Media 46, 4 (2002), 586--606.",
      "doi": ""
    },
    {
      "text": "Chernev, A. When More Is Less and Less Is More: The Role of Ideal Point Availability and Assortment in Consumer Choice. Journal of Consumer Research 30, 2 (2003), 170--183.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Smith, I., Matthews, T., LaMarca, A., Tabert, J., and Powledge, P. Location disclosure to social relations: why, when, & what people want to share. Proc. CHI 2005, ACM Press (2005), 81--90.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Culnan, M. J. and Armstrong, P. K. Information Privacy Concerns, Procedural Fairness, and Impersonal Trust: An Empirical Investigation. Organization Science 10, 1 (1999), 104--115.  ",
      "doi": "10.1287/orsc.10.1.104"
    },
    {
      "text": "Davies, S. Re-Engineering the Right to Privacy: How Privacy Has Been Transformed from a Right to a Commodity. In Technology and privacy: the new landscape. MIT Press, 1997. ",
      "doi": "10.5555/275283.275289"
    },
    {
      "text": "Garfinkel, S. Database Nation: The Death of Privacy in the 21st Century. O'Reilly & Associates, 2000. ",
      "doi": "10.5555/329053"
    },
    {
      "text": "Goncalves, J., Gomes, D., and Aguiar, R. L. Low-latency privacy-enabled Context Distribution Architecture. ICC, IEEE (2012), 1917--1922.",
      "doi": ""
    },
    {
      "text": "Huber, G. P. Multi-Attribute Utility Models: A Review of Field and Field-Like Studies. Management Science 20, 10 (1974), 1393--1402.",
      "doi": ""
    },
    {
      "text": "Huber, J. and Puto, C. Market Boundaries and Product Choice: Illustrating Attraction and Substitution Effects. Journal of Consumer Research 10, 1 (1983), 31--44.",
      "doi": ""
    },
    {
      "text": "Iachello, G., Smith, I., Consolvo, S., et al. Control, Deception, and Communication: Evaluating the Deployment of a Location-Enhanced Messaging Service. Proc. UbiComp 2005, Springer Heidelberg (2005), 213--231.  ",
      "doi": "10.1007/11551201_13"
    },
    {
      "text": "John, L. K., Acquisti, A., and Loewenstein, G. Strangers on a Plane: Context-Dependent Willingness to Divulge Sensitive Information. The Journal of Consumer Research 37, 5 (2011), 858--873.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with Mechanical Turk. Proc. CHI 2008, ACM Press (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Knijnenburg, B. P. and Kobsa, A. Making Decisions about Privacy: Information Disclosure in Context-Aware Recommender Systems. Accepted to the ACM Transactions on Intelligent Interactive Systems, Special Issue on Human Decision Making and Recommender Systems, (2013).",
      "doi": ""
    },
    {
      "text": "Lai, Y.-L. and Hui, K.-L. Internet Opt-In and Opt-Out: Investigating the Roles of Frames, Defaults and Privacy Concerns. 2006 ACM SIGMIS CPR Conference on Computer Personnel Research, (2006), 253--263.  ",
      "doi": "10.1145/1125170.1125230"
    },
    {
      "text": "Laufer, R. S. and Wolfe, M. Privacy as a Concept and a Social Issue: A Multidimensional Developmental Theory. Journal of Social Issues 33, 3 (1977), 22--42.",
      "doi": ""
    },
    {
      "text": "Lederer, S., Mankoff, J., and Dey, A. K. Who wants to know what when? privacy preference determinants in ubiquitous computing. Proc. CHI 2003, ACM Press (2003), 724--725.  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "Luce, D. The choice axiom after twenty years. Journal of Mathematical Psychology 15, 3 (1977), 215--233.",
      "doi": ""
    },
    {
      "text": "Luce, R. D. Individual choice behavior: a theoretical analysis. Dover Publications, Mineola, N.Y., 1959.",
      "doi": ""
    },
    {
      "text": "Page, X., Kobsa, A., and Knijnenburg, B. P. Don't Disturb My Circles! Boundary Preservation Is at the Center of Location-Sharing Concerns. Proc. ICWSM 2012, (2012).",
      "doi": ""
    },
    {
      "text": "Patil, S., Kobsa, A., John, A., and Seligmann, D. Methodological reflections on a field study of a globally distributed software project. Information and Software Technology 53, 9 (2011), 969--980.  ",
      "doi": "10.1016/j.infsof.2011.01.013"
    },
    {
      "text": "Patil, S. and Kobsa, A. Uncovering privacy attitudes and practices in instant messaging. Proc. SIGGROUP 2005, ACM (2005), 109--112.  ",
      "doi": "10.1145/1099203.1099220"
    },
    {
      "text": "Prasad, A. Exposing Privacy Concerns in mHealth Data Sharing. 2012. http://www.cs.dartmouth.edu/cms_file/SYS_techReport/571/TR2012-711.pdf.",
      "doi": ""
    },
    {
      "text": "Sadeh, N., Hong, J., Cranor, L., et al. Understanding and capturing people's privacy policies in a mobile social networking application. Personal and Ubiquitous Computing 13, 6 (2009), 401--412.  ",
      "doi": "10.1007/s00779-008-0214-3"
    },
    {
      "text": "Schwartz, B. The paradox of choice: why more is less. Harper Perennial, New York, 2003.",
      "doi": ""
    },
    {
      "text": "Simonson, I. Choice Based on Reasons: The Case of Attraction and Compromise Effects. Journal of Consumer Research 16, 2 (1989), 158--174.",
      "doi": ""
    },
    {
      "text": "Sousa, L. F. Privacy Policy Dynamics in Location Sharing Applications. 2009. http://docs.di.fc.ul.pt/handle/10455/3286.",
      "doi": ""
    },
    {
      "text": "Srinivasan, V. A Conjunctive-Compensatory Approach to the Self-Explication of Multiattributed Preferences. Decision Sciences 19, 2 (1988), 295--305.",
      "doi": ""
    },
    {
      "text": "Tang, K., Hong, J., and Siewiorek, D. The implications of offering more disclosure choices for social location sharing. Proc. CHI 2012, ACM Press (2012), 391--394.  ",
      "doi": "10.1145/2207676.2207730"
    },
    {
      "text": "Toch, E., Cranshaw, J., Drielsma, P. H., et al. Empirical models of privacy in location sharing. Proc. UbiComp 2010, ACM Press (2010), 129.  ",
      "doi": "10.1145/1864349.1864364"
    },
    {
      "text": "Tsai, J. Y., Kelley, P., Drielsma, P., Cranor, L. F., Hong, J., and Sadeh, N. Who's viewed you? The Impact of Feedback in a Mobile Location-Sharing Application. Proc. CHI 2009, ACM Press (2009), 2003.  ",
      "doi": "10.1145/1518701.1519005"
    },
    {
      "text": "Tsai, J. Y., Kelley, P. G., Cranor, L. F., and Sadeh, N. Location-Sharing Technologies: Privacy Risks and Control. I/S: A Journal of Law and Policy for the Information Society 6, 2 (2010).",
      "doi": ""
    },
    {
      "text": "Tversky, A. Elimination by aspects: A theory of choice. Psychological Review 79, 4 (1972), 281--299.",
      "doi": ""
    },
    {
      "text": "Zickuhr, K. Three-quarters of smartphone owners use location-based services. Pew Research Center, 2012.",
      "doi": ""
    }
  ]
}