{
  "doi": "10.1145/2470654.2466248",
  "title": "The emotional wellbeing of researchers: considerations for practice",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1883-1890",
  "year": 2013,
  "badges": [],
  "abstract": "As technology progressively pervades all aspects of our lives, members of the HCI community are engaging with increasingly sensitive contexts in their research - for example, end of life, genocide, computer-mediated communication under oppressive regimes. The considerations generated by research in such contexts can go well beyond those addressed by generic ethical approval processes and institutional practice. Whilst it is standard to ensure that the wellbeing of participants is taken into account in research design and the ethical approval process, it is much less common for the researcher's own emotional wellbeing to be considered explicitly. This paper describes the role that a researcher's emotions may play in research, and the impact which research in sensitive contexts can have on researchers' emotional wellbeing and on research validity. A qualitative survey is described which investigated the support mechanisms which HCI researchers have in place in case they are distressed/troubled as a result of their research. The results of the survey are used, in combination with insights into how other disciplines address the topic, to synthesize suggestions for ways in which the HCI community can proactively incorporate consideration for the emotional wellbeing of the researcher into the research process.",
  "authors": [
    {
      "name": "Wendy Moncur",
      "institution": "University of Dundee, Dundee, UK",
      "img": "/do/10.1145/contrib-81350572262/rel-imgonly/wendy-kayak.jpg",
      "acmid": "81350572262",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ACM. Code of Ethics - Association for Computing Machinery. http://www.acm.org/about/code-of-ethics.",
      "doi": ""
    },
    {
      "text": "Atkins, S. and Murphy, K. Reflective practice. Nursing Standard 8, 39 (1994), 49--56.",
      "doi": ""
    },
    {
      "text": "Bardzell, S. Feminist HCI: Taking Stock and Outlining an Agenda for Design. Proc. CHI 2010, ACM (2010), 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Battarbee, K. and I., K. Co-Experience: User Experience as Interaction. Co-design 1, 1 (2004), 5--18.",
      "doi": ""
    },
    {
      "text": "Bloor, M., Sampson, H., and Fincham, B. Qualiti (National Centre for Research Methods, ESRC) commissioned inquiry into risk to well-being of researchers in qualitative research. Cardiff, UK, 2007.",
      "doi": ""
    },
    {
      "text": "Borning, A. and Muller, M. J. Next Steps for Value Sensitive Design. Proc. CHI 2012, (2012), 1125--1134.  ",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "British Computer Society. Code of Conduct for BCS Members. 2011.",
      "doi": ""
    },
    {
      "text": "Burns, S.. and Bulman, C. Reflective Practice in Nursing. Blackwell Science Ltd., Oxford, UK, 2000.",
      "doi": ""
    },
    {
      "text": "Burr, G. Unfinished business: Interviewing family members of critically ill patients. Nursing Inquiry 3, (1995), 172--177.",
      "doi": ""
    },
    {
      "text": "Corden, A., Sainsbury, R., Sloper, P., and Ward, B. Using a model of group psychotherapy to support social research on sensitive topics. International Journal of Social Research Methodology 8, 2 (2005), 151--60.",
      "doi": ""
    },
    {
      "text": "Dearden, A. See no evil?: ethics in an interventionist ICTD. Proc. ICTD 2012, ACM (2012), 46--55.  ",
      "doi": "10.1145/2160673.2160680"
    },
    {
      "text": "Dimond, J. P., Fiesler, C., and Bruckman, A. S. Domestic violence and information communication technologies. Interacting with Computers 23, 5 (2011), 413--421.  ",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Elias, N. Problems of Involvement and Detachment. The British Journal of Sociology 7, 3 (1956), pp. 226--252.",
      "doi": ""
    },
    {
      "text": "Ethics Committee of the British Psychological Society. Code of Ethics and Conduct. 2009.",
      "doi": ""
    },
    {
      "text": "Finlay, L. Negotiating the swamp: the opportunity and challenge of reflexivity in research practice. Qualitative research 2, 2 (2002), 209--230.",
      "doi": ""
    },
    {
      "text": "Friedman, B. and Nathan, L. P. Multi-lifespan information system design: a research initiative for the HCI community. Proc. CHI 2010, ACM (2010), 2243--2246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Holland, J. Emotions and Research. International Journal of Social Research Methodology 10, 3 (2007), 195--209.",
      "doi": ""
    },
    {
      "text": "Hughes, D., Rayson, P., Walkerdine, J., et al. Supporting Law Enforcement in Digital Communities through Natural Language Analysis. In S. Srihari and K. Franke, eds., Computational Forensics SE - 12. Springer Berlin Heidelberg, 2008, 122--134.  ",
      "doi": "10.1007/978-3-540-85303-9_12"
    },
    {
      "text": "Johnson, C. W. Applying the lessons of the attack on the world trade center, 11th September 2001, to the design and use of interactive evacuation simulations. Proc. CHI 2005, ACM (2005), 651--660.  ",
      "doi": "10.1145/1054972.1055062"
    },
    {
      "text": "Light, A. The unit of analysis in understanding the politics of participatory practice. Proc. 11th Biennial Participatory Design Conference, ACM (2010), 183--186.  ",
      "doi": "10.1145/1900441.1900473"
    },
    {
      "text": "Mackay, W. E. Ethics, lies and videotape. Proc. CHI 1995, ACM Press/Addison-Wesley Publishing Co. (1995), 138--145.  ",
      "doi": "10.1145/223904.223922"
    },
    {
      "text": "Malacrida, C. Reflexive Journaling on Emotional Research Topics: Ethical Issues for Team Researchers. Qual Health Res 17, (2007), 1329--1339.",
      "doi": ""
    },
    {
      "text": "Massimi, M., Moncur, W., Odom, W., Banks, R., and Kirk, D. Memento Mori: Technology Design for the End of Life. Proc. CHI EA 2012, ACM (2012), 2759--2762.  ",
      "doi": "10.1145/2212776.2212714"
    },
    {
      "text": "McMurray, T. The changing face of research ethics. The Ulster Medical Journal 71, 2 (2002), 98--100.",
      "doi": ""
    },
    {
      "text": "Mitchell, W. and Irvine, A. I'm Okay, You're Okay?: Reflections on the Well-Being and Ethical Requirements of Researchers and Research Participants in Conducting Qualitative Fieldwork Interviews. International Journal of Qualitative Methods 7, 4 (2008).",
      "doi": ""
    },
    {
      "text": "Moncur, W., Bikker, J., Kasket, E., and Troyer, J. From Death to Final Disposition: Roles of Technology in the Post-Mortem Interval. Proc. CHI 2012, ACM (2012), 531--540.  ",
      "doi": "10.1145/2207676.2207750"
    },
    {
      "text": "Moncur, W., Mahamood, S., Reiter, E., and Freer, Y. Involving healthcare consumers in knowledge acquisition for virtual healthcare. AAAI Fall Symposium Series, AAAI Press (2009), 43--51.",
      "doi": ""
    },
    {
      "text": "Moncur, W., Vasalou, A., Jirotka, M., and Kirk, D. HCI Research in Sensitive Contexts: Ethical Considerations. Proc. BCS HCI 2012, BCS HCI (2012).",
      "doi": ""
    },
    {
      "text": "Moncur, W. Invoking emotional support in a health crisis. Proc. CHI EA 2008, ACM (2008), 2637--2640.  ",
      "doi": "10.1145/1358628.1358733"
    },
    {
      "text": "Moncur, W. A model for the provision of adaptive ehealth information across the personal social network. 2011. Unpublished PhD Thesis, University of Aberdeen.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. Opening Up: The Healing Power of Expressing Emotions. The Guildford Press, New York, 1990.",
      "doi": ""
    },
    {
      "text": "Prior, S. HCI methods for including adults with disabilities in the design of CHAMPION. Proc. CHI EA 2010, ACM (2010), 2891--2894.  ",
      "doi": "10.1145/1753846.1753878"
    },
    {
      "text": "Rabinow, P. Discourse and power: On the limits of ethnographic texts. Dialectical Anthropology 10, 1-2 (1985), 1--13.",
      "doi": ""
    },
    {
      "text": "Rager, K. B. Self-care and the qualitative researcher: When data can break your heart. Educational Researcher 34, 4 (2005), 23--27.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K., David, S., and Kaye, J. \"Jofish\". Reflective design. Proc. CC 2005, ACM (2005), 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Shklovski, I. and Vertesi, J. \"Un-Googling\": Research Technologies, Communities at Risk and the Ethics of User Studies in HCI. Proc. BCS HCI 2012 - Workshop on HCI Research in Sensitive Contexts: Ethical Considerations, eWiC (2012).",
      "doi": ""
    },
    {
      "text": "Social Research Association. Ethical guidelines. 2003.",
      "doi": ""
    },
    {
      "text": "Stahl, B., Eden, G., and Jirotka, M. Responsible research and innovation in Information and Communication Technology. In R. Owen, J. Bessant and M. Heintz, eds., Responsible Innovation. Wiley & Sons., Chichester, 2012.",
      "doi": ""
    },
    {
      "text": "Stahl, B. C. and Eke, D. Ethical reviews of information and communications technology research projects across UK computing departments: The state of the art. 10th Annual Conference of the Subject Centre for Information and Computer Sciences, (2009), 16.",
      "doi": ""
    },
    {
      "text": "Tracey, M. D. More effective supervision. Monitor on Psychology 37, 3, 2006, 48.",
      "doi": ""
    },
    {
      "text": "Whyte, W. F. Encounters with participatory action research. Qualitative Sociology 18, 3 (1995), 289--299.",
      "doi": ""
    },
    {
      "text": "Winograd, T. Bringing Design to Software. Addison Wesley, Reading Mass, 1997. ",
      "doi": ""
    },
    {
      "text": "Woodthorpe, K. Reflecting on death: The emotionality of the research encounter. Mortality 14, 1 (2009), 70--86.",
      "doi": ""
    },
    {
      "text": "Woodthorpe, K. Researching death: Methodological reflections on the management of critical distance. International Journal of Social Research Methodology 14, 2 (2011), 99--109.",
      "doi": ""
    },
    {
      "text": "Wright, P. and McCarthy, J. Empathy and experience in HCI. Proc. CHI 2008, ACM (2008), 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    }
  ]
}