{
  "doi": "10.1145/2470654.2481339",
  "title": "Domestic food and sustainable design: a study of university student cooking and its impacts",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2447-2456",
  "year": 2013,
  "badges": [],
  "abstract": "In four university student kitchens over twenty-one days, we captured participants' food preparation activity, quantified the greenhouse gas emissions and direct energy connected to the food and cooking, and talked to participants about their food practices. Grounded in this uniquely detailed micro-account, our findings inform sustainable design for cooking and eating at home and quantify the potential impacts. We outline the relation of the impacts to our participants' approaches to everyday food preparation, the organisation of their time, and the role of social meals. Our technique allows evaluation of opportunities for sustainable intervention design: at the appliance, in the digitally-mediated organisation of meals and inventory management, and more broadly in reflecting upon and reshaping diet.",
  "tags": [
    "food",
    "everyday life",
    "practices",
    "greenhouse gas",
    "sustainability",
    "energy"
  ],
  "authors": [
    {
      "name": "Adrian K. Clear",
      "institution": "Lancaster University, Lancaster, Lancashire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548005965",
      "orcid": "0000-0002-4409-9255"
    },
    {
      "name": "Mike Hazas",
      "institution": "Lancaster University, Lancaster, Lancashire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100484405",
      "orcid": "missing"
    },
    {
      "name": "Janine Morley",
      "institution": "Lancaster University, Lancaster, Lancashire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548005967",
      "orcid": "missing"
    },
    {
      "name": "Adrian Friday",
      "institution": "Lancaster University, Lancaster, Lancashire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533743",
      "orcid": "missing"
    },
    {
      "name": "Oliver Bates",
      "institution": "Lancaster University, Lancaster, Lancashire, UK",
      "img": "/do/10.1145/contrib-81556332556/rel-imgonly/oliver_bates_bw.jpg",
      "acmid": "81556332556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aberg, J. An evaluation of a meal planning system: Ease of use and perceived usefulness. In Proc. of British HCI (2009), 278--287. ",
      "doi": "10.5555/1671011.1671045"
    },
    {
      "text": "Baumer, E. P., and Silberman, M. S. When the implication is not to design (technology). In Proc. of CHI (2011), 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Berners-Lee, M. How Bad Are Bananas?: The carbon footprint of everything. Profile Books, 2010.",
      "doi": ""
    },
    {
      "text": "Berners-Lee, M. Booths greenhouse gas footprint report, 2012. SWC Ltd. http://www.booths.co.uk/reports/GHG-report-2012-web.pdf.",
      "doi": ""
    },
    {
      "text": "Berners-Lee, M., Hoolohan, C., Cammack, H., and Hewitt, C. The relative greenhouse gas impacts of realistic dietary choices. Energy Policy 43 (2012).",
      "doi": ""
    },
    {
      "text": "Bonanni, L., Lee, C.-H., and Selker, T. CounterIntelligence: Augmented reality kitchen. In Proc. of CHI (2005).",
      "doi": ""
    },
    {
      "text": "Caraher, M., Dixon, P., Lang, T., and Carr-Hill, R. The state of cooking in England: The relationship of cooking skills to food choice. British Food Journal 101, 8 (1999), 590--609.",
      "doi": ""
    },
    {
      "text": "Carlsson-Kanyama, A., Engström, R., and Kok, R. Indirect and direct energy requirements of city households in Sweden: Options for reduction, lessons from modeling. Industrial Ecology 9, 1--2 (2005).",
      "doi": ""
    },
    {
      "text": "Chen, J.-H., Chi, P.-Y., Chu, H.-H., Chen, C.-H., and Huang, P. A smart kitchen for nutrition-aware cooking. IEEE Pervasive Magazine 9, 4 (2010), 58--65.  ",
      "doi": "10.1109/MPRV.2010.75"
    },
    {
      "text": "Chetty, M., Brush, A. B., Meyers, B. R., and Johns, P. It's not easy being green: Understanding home computer power management. In Proc. of CHI (2009), 1033--1042.  ",
      "doi": "10.1145/1518701.1518860"
    },
    {
      "text": "Choi, J. H., and Blevis, E. HCI and sustainable food culture: A design framework for engagement. In Proc. of NordiCHI (2010), 112--117.  ",
      "doi": "10.1145/1868914.1868931"
    },
    {
      "text": "Choi, J. H., Comber, R., Linehan, C., and McCarthy, J. Food for thought: designing for critical reflection on food practices. In Proc. of DIS (2012). Workshop abstract.  ",
      "doi": "10.1145/2317956.2318077"
    },
    {
      "text": "Comber, R., Ganglbauer, E., Choi, J., Hoonhout, J., Rogers, Y., O'Hara, K., and Maitland, J. Food and interaction design: Designing for food in everyday life. In Proc. of CHI EA (2012).  ",
      "doi": "10.1145/2212776.2212716"
    },
    {
      "text": "de Leon, D. Actions, artefacts and cognition: An ethnography of cooking. Lund University Cognitive Studies, 104 (2003).",
      "doi": ""
    },
    {
      "text": "Erickson, T., Podlaseck, M., Sahu, S., Dai, J. D., Chao, T., and Naphade, M. The Dubuque water portal: Evaluation of the uptake, use and impact of residential water consumption feedback. In Proc. of CHI (2012), 675--684.  ",
      "doi": "10.1145/2207676.2207772"
    },
    {
      "text": "Garnett, T. Cooking up a storm: Food, greenhouse gas emissions and our changing climate. Food Climate Research Network, University of Surrey: Centre for Environmental Strategy.",
      "doi": ""
    },
    {
      "text": "Grimes, A., and Harper, R. Celebratory technology: new directions for food research in HCI. In Proc. of CHI (2008), 467--476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Hamada, R., Okabe, J., Ide, I., Satoh, S., Sakai, S., and Tanaka, H. Cooking navi: assistant for daily cooking in kitchen. In Proc. of Multimedia (2005), 371--374.  ",
      "doi": "10.1145/1101149.1101228"
    },
    {
      "text": "Hupfeld, A., and Rodden, T. Laying the table for HCI: uncovering ecologies of domestic food consumption. In Proc. of CHI (2012), 119--128.  ",
      "doi": "10.1145/2207676.2207694"
    },
    {
      "text": "Kalnikaite, V., Rogers, Y., Bird, J., Villar, N., Bachour, K., Payne, S., Todd, P. M., Schöning, J., Krüger, A., and Kreitmayer, S. How to nudge in situ: Designing lambent devices to deliver salient information in supermarkets. In Proc. of Ubicomp (2011).  ",
      "doi": "10.1145/2030112.2030115"
    },
    {
      "text": "Kirman, B., Linehan, C., Lawson, S., Foster, D., and Doughty, M. There's a monster in my kitchen: using aversive feedback to motivate behaviour change. In Proc. of CHI EA (2010), 2685--2694.  ",
      "doi": "10.1145/1753846.1753852"
    },
    {
      "text": "Kong, F., and Tan, J. Dietcam: Automatic dietary assessment with mobile camera phones. Pervasive and Mobile Computing 8, 1 (2011), 147--163.  ",
      "doi": "10.1016/j.pmcj.2011.07.003"
    },
    {
      "text": "Marquis, M. Exploring convenience orientation as a food motivation for college students living in residence halls. International Journal of Consumer Studies 29, 1 (2005), 55--63.",
      "doi": ""
    },
    {
      "text": "Mintz, S., and Du Bois, C. The anthropology of food and eating. Annual Review of Anthropology (2002), 99--119.",
      "doi": ""
    },
    {
      "text": "Mooney, K., and Walbourn, L. When college students reject food: not just a matter of taste. Appetite 36, 1 (2001), 41--50.",
      "doi": ""
    },
    {
      "text": "Mou, T.-Y., Jeng, T.-S., and Ho, C.-H. Sociable kitchen: Interactive recipe system in kitchen island. International Journal of Smart Home (2009).",
      "doi": ""
    },
    {
      "text": "Oberascher, C., Stamminger, R., and Pakula, C. Energy efficiency in daily food preparation. International Journal of Consumer Studies 35, 2 (2011), 201--211.",
      "doi": ""
    },
    {
      "text": "Oliveira, L., Mitchell, V., and Badni, K. Cooking behaviours: a user observation study to understand energy use and motivate savings. Work: A Journal of Prevention, Assessment and Rehabilitation 41, 1 (2012), 2122--2128.",
      "doi": ""
    },
    {
      "text": "Palay, J., and Newman, M. SuChef: An in-kitchen display to assist with \"everyday\" cooking. In Proc. of CHI EA (2009), 3973--3978.  ",
      "doi": "10.1145/1520340.1520603"
    },
    {
      "text": "Pierce, J., Schiano, D. J., and Paulos, E. Home, habits, and energy: Examining domestic interactions and energy consumption. In Proc. of CHI (2010), 1985--94.  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Short, F. Domestic cooking practices and cooking skills: findings from an English study. Food Service Technology 3, 3-4 (2003), 177--185.",
      "doi": ""
    },
    {
      "text": "Shove, E. Comfort, Cleanliness and Convenience: The Social Organization of Normality. Berg, 2003.",
      "doi": ""
    },
    {
      "text": "Stehfest, E., Bouwman, L., van Vuuren, D., den Elzen, M., Eickhout, B., and Kabat, P. Climate benefits of changing diet. Climatic Change 95, 1 (2009), 83--102.",
      "doi": ""
    },
    {
      "text": "Strengers, Y. Bridging the divide between resource management and everyday life: Smart metering, comfort and cleanliness. PhD thesis, RMIT University, Melbourne, 2009.",
      "doi": ""
    },
    {
      "text": "Strengers, Y. Designing eco-feedback systems for everyday life. In Proc. of CHI (2011), 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Wagner, J., van Halteren, A., Hoonhout, J., Ploetz, T., Pham, C., Moynihan, P., Jackson, D., Ladha, C., Ladha, K., and Olivier, P. Towards a pervasive kitchen infrastructure for measuring cooking competence. In Proc. of IEEE Pervasive Health (2011), 107--114.",
      "doi": ""
    },
    {
      "text": "Weber, C. L., and Matthews, H. S. Food-miles and the relative climate impacts of food choices in the USA. Environmental Science & Technology 42, 10 (2008), 3508--3513.",
      "doi": ""
    },
    {
      "text": "Williamson, D. A., Allen, H., Martin, P. D., Alfonso, A. J., Gerald, B., and Hunt, A. Comparison of digital photography to weighed and visual estimation of portion sizes. J. of the Am. Dietetic Association 103, 9 (2003), 1139--1145.",
      "doi": ""
    },
    {
      "text": "Wood, G., and Newborough, M. Dynamic energy-consumption indicators for domestic appliances: Environment, behaviour and design. Energy and Buildings 35, 8 (2003), 821--841.",
      "doi": ""
    }
  ]
}