{
  "doi": "10.1145/2470654.2466128",
  "title": "ARTFul: adaptive review technology for flipped learning",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1001-1010",
  "year": 2013,
  "badges": [],
  "abstract": "Internet technology is revolutionizing education. Teachers are developing massive open online courses (MOOCs) and using innovative practices such as flipped learning in which students watch lectures at home and engage in hands-on, problem solving activities in class. This work seeks to explore the design space afforded by these novel educational paradigms and to develop technology for improving student learning. Our design, based on the technique of adaptive content review, monitors student attention during educational presentations and determines which lecture topic students might benefit the most from reviewing. An evaluation of our technology within the context of an online art history lesson demonstrated that adaptively reviewing lesson content improved student recall abilities 29% over a baseline system and was able to match recall gains achieved by a full lesson review in less time. Our findings offer guidelines for a novel design space in dynamic educational technology that might support both teachers and online tutoring systems.",
  "authors": [
    {
      "name": "Daniel Szafir",
      "institution": "University of Wisconsin, Madison, Madison, Wisconsin, USA",
      "img": "/do/10.1145/contrib-81488672477/rel-imgonly/dan.jpg",
      "acmid": "81488672477",
      "orcid": "missing"
    },
    {
      "name": "Bilge Mutlu",
      "institution": "University of Wisconsin, Madison, Madison, Wisconsin, USA",
      "img": "/do/10.1145/contrib-81310500023/rel-imgonly/mutlu.jpg",
      "acmid": "81310500023",
      "orcid": "0000-0002-9456-1495"
    }
  ],
  "references": [
    {
      "text": "Aleven, V., and Koedinger, K. R. An effective metacognitive strategy: learning by doing and explaining with a computer-based cognitive tutor. Cognitive Science 26, 2 (2002), 147--179.",
      "doi": ""
    },
    {
      "text": "Ayaz, H., Shewokis, P., Bunce, S., Schultheis, M., and Onaral, B. Assessment of cognitive neural correlates for a functional near infrared-based brain computer interface system. Foundations of Augmented Cognition. Neuroergonomics and Operational Neuroscience (2009), 699--708.  ",
      "doi": "10.1007/978-3-642-02812-0_79"
    },
    {
      "text": "Berka, C., Levendowski, D. J., Lumicao, M. N., Yau, A., Davis, G., Zivkovic, V. T., Olmstead, R. E., Tremoulet, P. D., and Craven, P. L. EEG correlates of task engagement and mental workload in vigilance, learning, and memory tasks. Aviation, Space, and Environmental Medicine 78, Supplement 1 (2007), B231--B244.",
      "doi": ""
    },
    {
      "text": "Boucsein, W., Haarmann, A., and Schaefer, F. Combining skin conductance and heart rate variability for adaptive automation during simulated ifright. In Engineering Psychology and Cognitive Ergonomics, vol. 4562. 2007, 639--647. ",
      "doi": "10.5555/1784197.1784271"
    },
    {
      "text": "Byrne, E. A., and Parasuraman, R. Psychophysiology and adaptive automation. Biological Psychology 42, 3 (1996), 249--268.",
      "doi": ""
    },
    {
      "text": "Cannod, G. C., Burge, J. E., and Helmick, M. T. Using the inverted classroom to teach software engineering. Computer Science and Systems Analysis Technical Reports (2007).",
      "doi": ""
    },
    {
      "text": "Cirett Galán, F., and Beal, C. Eeg estimates of engagement and cognitive workload predict math problem solving outcomes. UMAP (2012), 51--62.  ",
      "doi": "10.1007/978-3-642-31454-4_5"
    },
    {
      "text": "Cutrell, E. Tan, D. BCI for passive input in HCI. In Proc CHI'07 (2007).",
      "doi": ""
    },
    {
      "text": "D'Mello, S., Graesser, A., and Picard, R. Toward an affect-sensitive autotutor. IEEE Intelligent Systems 22, 4 (2007), 53--61.  ",
      "doi": "10.1109/MIS.2007.79"
    },
    {
      "text": "Frand, J. L. The information-age mindset: Changes in students and implications for higher education. EDUCAUSE Review 35, 5 (2000), 15--24.",
      "doi": ""
    },
    {
      "text": "Frederick, P. J. The lively lecture: 8 variations. College Teaching 34, 2 (1986), 43--50.",
      "doi": ""
    },
    {
      "text": "Freeman, F. G., Mikulka, P. J., Prinzel, L. J., and Scerbo, M. W. Evaluation of an adaptive automation system using three eeg indices with a visual tracking task. Biological Psychology 50, 1 (1999), 61--76.",
      "doi": ""
    },
    {
      "text": "French, D. P. ipods: Informative or invasive?. J College Science Teaching 36, 1 (2006), 58--59.",
      "doi": ""
    },
    {
      "text": "George, L., and Lecuyer, A. An overview of research on 'passive' brain-computer interfaces for implicit human-computer interaction. In Proc ICABB'10 Workshop on Brain-Computer Interfacing and Virtual Reality (2010).",
      "doi": ""
    },
    {
      "text": "Gevins, A., and Smith, M. E. Neurophysiological measures of cognitive workload during human-computer interaction. Theoretical Issues in Ergonomics Science 4, 1 (2003), 113--131.",
      "doi": ""
    },
    {
      "text": "Gevins, A., Smith, M. E., Leong, H., McEvoy, L., Whitfield, S., Du, R., and Rush, G. Monitoring working memory load during computer-based tasks with EEG pattern recognition methods. Human Factors 40 (1998), 79--91.",
      "doi": ""
    },
    {
      "text": "Jonas-Dwyer, D., and Pospisil, R. The millenial effect: Implications for academic development. Transforming Knowledge into Wisdom: Holistic Approaches to Teaching and Learning (2004), 195--207.",
      "doi": ""
    },
    {
      "text": "Julnes, G., and Mohr, L. Analysis of no-difference findings in evaluation research. Evaluation Review 13, 6 (1989), 628--655.",
      "doi": ""
    },
    {
      "text": "Kemp, J. W., Livingstone, D., and Bloomfield, P. R. Sloodle: Connecting vle tools with emergent teaching practice in second life. British J Educational Technology 40, 3 (2009), 551--555.",
      "doi": ""
    },
    {
      "text": "KNEWTON. The flipped classroom infographic, March 2012. http://www.knewton.com/flipped-classroom/.",
      "doi": ""
    },
    {
      "text": "Kulik, C.-L. C., and Kulik, J. A. Effectiveness of computer-based instruction: An updated analysis. Computers in Human Behavior 7, 1--2 (1991), 75--94.",
      "doi": ""
    },
    {
      "text": "Lage, M. J., and Platt, G. The internet and the inverted classroom. J Economic Education 31, 1 (2000), 11--11.",
      "doi": ""
    },
    {
      "text": "Lage, M. J., Platt, G. J., and Treglia, M. Inverting the classroom: A gateway to creating an inclusive learning environment. J Economic Education 31, 1 (2000), 30--43.",
      "doi": ""
    },
    {
      "text": "Langan-Fox, J., Canty, J. M., and Sankey, M. J. Human--automation teams and adaptable control for future air traffic management. Intl J Industrial Ergonomics 39, 5 (2009), 894--903.",
      "doi": ""
    },
    {
      "text": "Long, S. R., and Edwards, P. B. Podcasting: making waves in millennial education. J Nurses in Staff Devel 26, 3 (2010), 96.",
      "doi": ""
    },
    {
      "text": "Meccawy, M., Blanchfield, P., Ashman, H., Brailsford, T., and Moore, A. Whurle 2.0: Adaptive learning meets web 2.0. In Times of Convergence. Technologies Across Learning Contexts, vol. 5192. 2008, 274--279.  ",
      "doi": "10.1007/978-3-540-87605-2_30"
    },
    {
      "text": "Miller, C., and Parasuraman, R. Designing for flexible interaction between humans and automation: Delegation interfaces for supervisory control. Human Factors 49, 1 (2007), 57--75.",
      "doi": ""
    },
    {
      "text": "Molina, G., Tsoneva, T., and Nijholt, A. Emotional brain-computer interfaces. In Proc ACII'09 (2009), 1--9.",
      "doi": ""
    },
    {
      "text": "Moore, A., Brailsford, T. J., and Stewart, C. D. Personally tailored teaching in whurle using conditional transclusion. In Proc ACM Hypertext and Hypermedia (2001), 163--164.  ",
      "doi": "10.1145/504216.504259"
    },
    {
      "text": "Mostow, J., Chang, K., and Nelson, J. Toward exploiting eeg input in a reading tutor. In Proc AIED'11 (2011), 230--237. ",
      "doi": "10.5555/2026506.2026539"
    },
    {
      "text": "Naveh-Benjamin, M., Kilb, A., and Fisher, T. Concurrent task effects on memory encoding and retrieval: Further support for an asymmetry. Memory & Cognition 34 (2006), 90--101.",
      "doi": ""
    },
    {
      "text": "Nijholt, A., Bos, D. P.-O., and Reuderink, B. Turning shortcomings into challenges: Brain-computer interfaces for games. Entertainment Computing 1, 2 (2009), 85--94.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., Bahri, T., Deaton, J. E., Morrison, J. G., and Barnes, M. Theory and design of adaptive automation in aviation systems. Technical Report NAWCADWAR-9023--60 (1992).",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., and Wickens, C. D. Humans: still vital after all these years of automation. Human Factors 50, 3 (2008), 511--520.",
      "doi": ""
    },
    {
      "text": "Pfurtscheller, G., Neuper, C., Guger, C., Harkam, W., Ramoser, H., Schlogl, A., Obermaier, B., and Pregenzer, M. Current trends in Graz Brain-Computer Interface (BCI) research. IEEE Trans Rehabilitation Engineering 8, 2 (2000), 216--219.",
      "doi": ""
    },
    {
      "text": "Pope, A. T., Bogart, E. H., and Bartolome, D. S. Biocybernetic system evaluates indices of operator engagement in automated task. Biological Psychology 40, 1--2 (1995), 187--195.",
      "doi": ""
    },
    {
      "text": "Potter, A. M. Statistics for sociologists: Teaching techniques that work. Teaching Sociology 23, 3 (1995), 259--263.",
      "doi": ""
    },
    {
      "text": "Prensky, M. Digital natives, digital immigrants part 2: Do they really think differently? On the Horizon 9 (2001), 1--6.",
      "doi": ""
    },
    {
      "text": "Ryan, M., Carlton, K., and Ali, N. Evaluation of traditional classroom teaching methods versus course delivery via the world wide web. J Nursing Education 38, 6 (1999), 272--277.",
      "doi": ""
    },
    {
      "text": "Schofield, J. W. Computers and Classroom Culture. Cambridge University Press, 1995. ",
      "doi": "10.5555/526373"
    },
    {
      "text": "Solovey, E., Schermerhorn, P., Scheutz, M., Sassaroli, A., Fantini, S., and Jacob, R. Brainput: enhancing interactive systems with streaming fnirs brain input. In Proc CHI'12 (2012), 2193--2202.  ",
      "doi": "10.1145/2207676.2208372"
    },
    {
      "text": "Strayer, J. How learning in an inverted classroom influences cooperation, innovation and task orientation. Learning Environments Research (2009), 1--23.",
      "doi": ""
    },
    {
      "text": "Strayer, J. F. The effects of the classroom flip on the learning environment: a comparison of learning activity in a traditional classroom and a flip classroom that used an intelligent tutoring system. PhD thesis, Ohio State University, 2007. ",
      "doi": "10.5555/1354741"
    },
    {
      "text": "Szafir, D., and Mutlu, B. Pay attention!: designing adaptive agents that monitor and improve user engagement. In Proc CHI'12 (2012), 11--20.  ",
      "doi": "10.1145/2207676.2207679"
    },
    {
      "text": "Tan, D., and Nijholt, A. Brain-Computer Interfaces: applying our minds to human-computer interaction. Springer, 2010. ",
      "doi": "10.5555/1855009"
    },
    {
      "text": "VanLehn, K. Intelligent tutoring systems for continuous, embedded assessment. The future of assessment: Shaping teaching and learning (2008), 113--138.",
      "doi": ""
    },
    {
      "text": "anLehn, K. The relative effectiveness of human tutoring, intelligent tutoring systems, and other tutoring systems. Educational Psychologist 46, 4 (2011), 197--221.",
      "doi": ""
    },
    {
      "text": "Vi, C., and Subramanian, S. Detecting error-related negativity for interaction design. In Proc CHI'12 (2012), 493--502.  ",
      "doi": "10.1145/2207676.2207744"
    },
    {
      "text": "Woolf, B., Burleson, W., Arroyo, I., Dragon, T., Cooper, D., and Picard, R. Affect-aware tutors: recognising and responding to student affect. Intl J Learning Technology 4, 3 (2009), 129--164.  ",
      "doi": "10.1504/IJLT.2009.028804"
    },
    {
      "text": "Yilmaz-Tuzun, O. Preservice elementary teachers beliefs about science teaching. J Science Teacher Education 19 (2008), 183--204.",
      "doi": ""
    },
    {
      "text": "Zander, T. O., Kothe, C., Jatzev, S., and Gaertner, M. Enhancing human-computer interaction with input from active and passive brain-computer interfaces. In Brain-Comp Int. 2010, 181--199.",
      "doi": ""
    }
  ]
}