{
  "doi": "10.1145/2470654.2481378",
  "title": "Beyond being green: simple living families and ICT",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2725-2734",
  "year": 2013,
  "badges": [],
  "abstract": "Motivated by a need in sustainable HCI for studies of everyday practices, and a belief that a holistic view on sustainability is crucial to deeper understanding of how to design ICT to support sustainability, we here present a qualitative study of 11 simple living families in the US. Simple living refers to a lifestyle which is voluntarily simple out of concern for both the environment and quality of life. Our goal was to learn about a holistic view on sustainability and the role of ICT in helping and hindering families to live simply. The study contributes new insights about how holistic sustainability could be a valuable lens for HCI, revealing that sustainability is important to a wider range of areas in HCI than previously discussed. We conclude with implications for HCI for how to support sustainable practices beyond being \"about\" being green.",
  "tags": [
    "simple living",
    "holistic sustainability",
    "qualitative studies",
    "sustainable hci",
    "sustainability",
    "families"
  ],
  "authors": [
    {
      "name": "Maria Håkansson",
      "institution": "Södertörn University, Huddinge, Sweden & Cornell University, Ithaca, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232108",
      "orcid": "missing"
    },
    {
      "name": "Phoebe Sengers",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/do/10.1145/contrib-81100397464/rel-imgonly/ditheredhead.jpg",
      "acmid": "81100397464",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baumer, E. P. S., and Silberman, S. M. When the implication is not to design (technology). In Proc. CHI EA'11. ACM (2011), 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Blevis, E. Sustainable interaction design: invention & disposal, renewal & reuse. In Proc. CHI '07. ACM (2007), 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Blythe, M., Monk, A., and Park, J. Technology biographies: field study techniques for home use product development. In Proc. CHI EA'02. ACM (2002), 658--659.  ",
      "doi": "10.1145/506443.506532"
    },
    {
      "text": "Broms, L., Katzeff, C., Bång, M., Nyblom, Å., Ilstedt Hjelm, S., and Ehrnberger, K. Coffee maker patterns and the design of energy feedback artefacts. In Proc. DIS'10. ACM (2010), 93--102.  ",
      "doi": "10.1145/1858171.1858191"
    },
    {
      "text": "Brynjarsdóttir, H., Håkansson, M., Pierce, J., Baumer, E., DiSalvo, C., and Sengers, P. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proc. CHI '12. ACM (2012), 947--956.  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Busse, D., Blevis, E., Beckwith, R., Bardzell, S., Sengers, P., Tomlinson, B., Nathan, L., and Mann, S. Social sustainability: an HCI agenda. In Proc. CHI EA '12. ACM (2012), 1151--1154.  ",
      "doi": "10.1145/2212776.2212409"
    },
    {
      "text": "Chetty, M., Tran, D., and Grinter, R. E. Getting to green: understanding resource consumption in the home. In Proc. UbiComp '08. ACM (2008), 242--251.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Dillahunt, T., Mankoff, J., and Paulos, E. Understanding conflict between landlords and tenants: implications for energy sensing and feedback. In Proc. Ubicomp '10. ACM (2010), 149--158.  ",
      "doi": "10.1145/1864349.1864376"
    },
    {
      "text": "Dillahunt, T., Mankoff, J., Paulos, E., and Fussell, S. It's not all about \"Green\": energy use in low-income communities. In Proc. Ubicomp '09. ACM (2009), 255--264.  ",
      "doi": "10.1145/1620545.1620583"
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. Mapping the landscape of sustainable HCI. In Proc. CHI '10. ACM (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Dourish, P. HCI and environmental sustainability: the politics of design and the design of politics. In Proc. DIS '10. ACM (2010), 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Foster, D., Blythe, M., Cairns, P., and Lawson, S. Competitive carbon counting: can social networking sites make saving energy more enjoyable? In Proc. CHI EA '10. ACM (2010), 4039--4044.  ",
      "doi": "10.1145/1753846.1754099"
    },
    {
      "text": "Grigsby, M. Buying Time and Getting By. The Voluntary Simplicity Movement. SUNY Press, Albany, 2004.",
      "doi": ""
    },
    {
      "text": "Gustafsson, A., Bång, M., and Svahn, M. Power explorer: a casual game style for encouraging long term behavior change among teenagers. In Proc. ACE '09. ACM (2009), 182--189.  ",
      "doi": "10.1145/1690388.1690419"
    },
    {
      "text": "Hallnäs, L., and Redström, J. Slow technology: designing for reflection. PUC. 5, 3 (2001), 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Hirsch, T. Water wars: designing a civic game about water scarcity. In Proc. DIS '10. ACM (2010), 340--343.  ",
      "doi": "10.1145/1858171.1858232"
    },
    {
      "text": "Hirsch, T., and Anderson, K. Cross currents: water scarcity and sustainable CHI. In Proc. CHI EA'10. ACM (2010), 2843--2852.  ",
      "doi": "10.1145/1753846.1753871"
    },
    {
      "text": "Huang, E. M., and Truong, K. N. Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones. In Proc. CHI '08. ACM (2008), 323--332.  ",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Leshed, G., and Sengers, P. \"I lie to myself that I have freedom in my own schedule\": productivity tools and experiences of busyness. In Proc. CHI '11. ACM (2011), 905--914.  ",
      "doi": "10.1145/1978942.1979077"
    },
    {
      "text": "Ljungblad, S, and Holmquist, L. E. Transfer scenarios: grounding innovation with marginal practices. In Proc. CHI '07. ACM (2007), 737--746.  ",
      "doi": "10.1145/1240624.1240738"
    },
    {
      "text": "Meyers, E. M., and Bittner, R. \"Green Washing\" the Digital Playground: How Virtual Worlds Support Ecological Intelligence... or Do They? In Proc. iConference'12, ACM (2012), 608--610.  ",
      "doi": "10.1145/2132176.2132308"
    },
    {
      "text": "Nathan, L. Ecovillages: Information Tools and Deeply Sustainable Living. In P. K. Kahn & P. H. Hasbach (Eds.), Ecopsychology: Science, Totems, and the Technological Species (173--194). MIT Press (2012).",
      "doi": ""
    },
    {
      "text": "Odom, W., Pierce, J., Stolterman, E., and Blevis, E. Understanding why we preserve some things and discard others in the context of interaction design. In Proc. CHI '09. ACM (2009), 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Pierce, J. Undesigning technology: considering the negation of design by design. In Proc. CHI '12. ACM (2012), 957--966.  ",
      "doi": "10.1145/2207676.2208540"
    },
    {
      "text": "Pierce, J., and Paulos, E. Second-hand interactions: investigating reacquisition and dispossession practices around domestic objects. In Proc. CHI '11. ACM (2011), 2385--2394.  ",
      "doi": "10.1145/1978942.1979291"
    },
    {
      "text": "Satchell, C. and Dourish. P. Beyond the user: use and non-use in HCI. Proc. OzCHI '09. ACM (2009), 9--16.  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Schor, J. The overspent American: upscaling, downshifting, and the new consumer. Basic Books, 1998.",
      "doi": ""
    },
    {
      "text": "Strengers, Y. Designing Eco-Feedback Systems for Everyday Life. In Proc. CHI'11, ACM (2011), 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Woodruff, A., Hasbrouck, J., and Augustin, S. A bright green perspective on sustainable choices. In Proc. CHI'08. ACM (2008), 313--322.  ",
      "doi": "10.1145/1357054.1357109"
    }
  ]
}