{
  "doi": "10.1145/2470654.2470691",
  "title": "EventHurdle: supporting designers' exploratory interaction prototyping with gesture-based sensors",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "267-276",
  "year": 2013,
  "badges": [],
  "abstract": "Prototyping of gestural interactions in the early phase of design is one of the most challenging tasks for designers without advanced programming skills. Relating users' input from gesture-based sensor values requires a great deal of effort on the designer's part and disturbs their reflective and creative thinking. To deal with this problem, we present EventHurdle, a visual gesture-authoring tool to support designers' explorative prototyping. It supports remote gestures from a camera, handheld gestures with physical sensors, and touch gestures by utilizing touch screens. EventHurdle allows designers to visually define and modify gestures through interaction workspace and graphical markup language with hurdles. Because the created gestures can be integrated into a prototype as programming code and automatically recognized, designers do not need to pay attention in sensor-related implementation. Two user studies and a recognition test are reported to discuss the acceptance and implications of explorative prototyping tools for designers.",
  "authors": [
    {
      "name": "Ju-Whan Kim",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416603647",
      "orcid": "missing"
    },
    {
      "name": "Tek-Jin Nam",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320511",
      "orcid": "0000-0002-7942-0766"
    }
  ],
  "references": [
    {
      "text": "Ballagas, R., Memon, F., Reiners, R., and Borchers, J. iStuff mobile: rapidly prototyping new mobile phone interfaces for ubiquitous computing. Proc. CHI 2007, 1107--1116.  ",
      "doi": "10.1145/1240624.1240793"
    },
    {
      "text": "Ballagas, R., Ringel, M., Stone, M., and Borchers, J. iStuff: a physical user interface toolkit for ubiquitous computing environments. Proc. CHI 2003, 537--544.  ",
      "doi": "10.1145/642611.642705"
    },
    {
      "text": "Banzi, M. Getting Started with Arduino. Make, 2011. ",
      "doi": "10.5555/2095953"
    },
    {
      "text": "Bellamy, R., Desmond, M., Martino, J., et al. Sketching tools for ideation (NIER track). Proc. ICSE 2011, 808-- 811.  ",
      "doi": "10.1145/1985793.1985909"
    },
    {
      "text": "Buxton, B. Sketching user experiences : getting the design right and the right design. Elsevier/Morgan Kaufmann, Amsterdam; Boston, 2007. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Csikszentmihalyi, M. Flow. Harper Perennial Modern Classics, 2008.",
      "doi": ""
    },
    {
      "text": "Cypher, A. and Halbert, D.C. Watch What I Do. The MIT Press, 1993.",
      "doi": ""
    },
    {
      "text": "Dey, A.K., Hamid, R., Beckmann, C., Li, I., and Hsu, D. a CAPpella: programming by demonstration of contextaware applications. Proc. CHI 2004, 33--40.  ",
      "doi": "10.1145/985692.985697"
    },
    {
      "text": "Gao, Y., Bianchi-Berthouze, N., and Meng, H. UCL Discovery - What does touch tell us about emotions in touchscreen-based gameplay? ACM Transactions on Computer-Human Interaction (2012).  ",
      "doi": "10.1145/2395131.2395138"
    },
    {
      "text": "Gaver, W. Making spaces: how design workbooks work. Proc. CHI 2011, 1551--1560.  ",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "Gaver, W., Beaver, J., and Benford, S. Ambiguity as a resource for design. Proc. CHI 2003, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Gould, J.D., Conti, J., and Hovanyecz, T. Composing letters with a simulated listening typewriter. Communications of the ACM 26, 4 (1983).  ",
      "doi": "10.1145/2163.358100"
    },
    {
      "text": "Greenberg, S. and Fitchett, C. Phidgets: Easy Development of Physical Interfaces through Physical Widgets. Proc. UIST 2001, 209--218.  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Hartmann, B., Abdulla, L., Mittal, M., and Klemmer, S.R. Authoring sensor-based interactions by demonstration with direct manipulation and pattern recognition. Proc. CHI 2007, 146--154.  ",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Hartmann, B., Klemmer, S.R., Bernstein, M., et al. Reflective physical prototyping through integrated design, test, and analysis. Proc. UIST 2006, 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Hudson, S.E. and Mankoff, J. Rapid Construction of Functioning Physical Interfaces from Cardboard, Thumbtacks, Tin Foil and Masking Tape. Proc. UIST 2006, 289--297.  ",
      "doi": "10.1145/1166253.1166299"
    },
    {
      "text": "Kelly, J.F. Lego Mindstorms Nxt 2.0. Springer, 2009. ",
      "doi": "10.5555/1671226"
    },
    {
      "text": "Kin, K., Hartmann, B., DeRose, T., and Agrawala, M. Proton: Multitouch Gestures as Regular Expressions. Proc. CHI 2012, 2885--2894.  ",
      "doi": "10.1145/2207676.2208694"
    },
    {
      "text": "Kleinsmith, A. and Bianchi-Berthouze, N. Affective Body Expression Perception and Recognition: A Survey. IEEE Trans Affective Computing, (2012).",
      "doi": ""
    },
    {
      "text": "Klemmer, S.R., Sinha, A.K., Chen, J., Landay, J.A., Aboobaker, N., and Wang, A. Suede: a Wizard of Oz prototyping tool for speech user interfaces. Proc. UIST 2000, 1--10.  ",
      "doi": "10.1145/354401.354406"
    },
    {
      "text": "Lee, J.C., Avrahami, D., Hudson, S.E., Forlizzi, J., Dietz, P.H., and Leigh, D. The Calder Toolkit: Wired and Wireless Components for Rapidly Prototyping Interactive Devices. Proc. DIS 2004, 167--175.  ",
      "doi": "10.1145/1013115.1013139"
    },
    {
      "text": "Lim, Y.K., Stolterman, E., and Tenenberg, J. The anatomy of prototypes. ACM Transactions on Computer-Human Interaction 15, 2 (2008).  ",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Lin, J., Newman, M.W., Hong, J.I., and Landay, J.A. DENIM: finding a tighter fit between tools and practice for Web site design. Proc. CHI 2000, 510--517.  ",
      "doi": "10.1145/332040.332486"
    },
    {
      "text": "Liu, J., Zhong, L., Wickramasuriya, J., and Vasudevan, V. uWave: Accelerometer-based personalized gesture recognition and its applications. Pervasive and Mobile Computing 5, (2009), 657--675.  ",
      "doi": "10.1016/j.pmcj.2009.07.007"
    },
    {
      "text": "Lü, H. and Li, Y. Gesture coder: a tool for programming multi-touch gestures by demonstration. Proc. CHI 2012, 2875--2884.  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Nam, T.J. Sketch-based rapid prototyping platform for hardware-software integrated interactive products. Extended abstracts of CHI 2005.  ",
      "doi": "10.1145/1056808.1056998"
    },
    {
      "text": "Reas, C. and Fry, B. Processing. The MIT Press, 2007.",
      "doi": ""
    },
    {
      "text": "Resnick, M., Maloney, J., and Monroy-Hernández, A. Scratch: programming for all. Communications of the ACM 52, (2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Rubine, D. Specifying Gestures by Example. Proc. SIGGRAPH 1991, 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Schön, D.A. The reflective practitioner. Ashgate Pub Co, 1995.",
      "doi": ""
    },
    {
      "text": "Suwa, M. and Tversky, B. External Representations Contribute to the Dynamic Construction of Ideas. Proc. DIAGRAM 2002, 341--343. ",
      "doi": "10.5555/645971.675196"
    },
    {
      "text": "Teitelman, W. Real Time Recognition of Hand-Drawn Characters. Proc. AFIPS 1964, 559--575.  ",
      "doi": "10.1145/1464052.1464106"
    },
    {
      "text": "Villar, N., Gilleade, K.M., Ramdunyellis, D., and Gellersen, H. The VoodooIO gaming kit. Computers in Entertainment 5, 3 (2007), 7.  ",
      "doi": "10.1145/1316511.1316518"
    },
    {
      "text": "Vintsyuk, T.K. Speech discrimination by dynamic programming. Kibernetika 4, (1968), 81--88",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O. and Myers, B. Trackball text entry for people with motor impairments. Proc. CHI 2006, 479488.  ",
      "doi": "10.1145/1124772.1124845"
    },
    {
      "text": "Wobbrock, J.O., Myers, B.A., and Kembel, J.A. EdgeWrite: A Stylus-Based Text Entry Method Designed for High Accuracy and Stability of Motion. Proc. UIST 2003, 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Wobbrock, J.O., Wilson, A.D., and Li, Y. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. Proc. UIST 2007, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}