{
  "doi": "10.1145/2470654.2466168",
  "title": "Make it move: a movement design method of simple standing products based on systematic mapping of torso movements & product messages",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1279-1288",
  "year": 2013,
  "badges": [],
  "abstract": "Human communication significantly relies on the expressivity of their body movements. Based on these body language experiences, humans tend to extract meanings even from movements of objects. This paper begins with the above human tendencies to create a design method that can help product designers make their products move to communicate. As a research vehicle, we created a robotic torso prototype and utilized it to collaborate with movement experts, and listed up possible expressive movement components. We then built a mapping matrix that links these movements to general product messages. A method which utilizes this mapping matrix was developed to help designers determine a set of effective movements that can communicate specific product messages. Lastly, a design workshop was conducted to identify the usefulness of the proposed method. We expect the procedures and findings of this study to help researchers and designers approach affective user experience through product movement design.",
  "tags": [
    "design method",
    "product movement"
  ],
  "authors": [
    {
      "name": "Jinyung Jung",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549534456",
      "orcid": "missing"
    },
    {
      "name": "Seok-Hyung Bae",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392591403",
      "orcid": "missing"
    },
    {
      "name": "Joon Hyub Lee",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659205926",
      "orcid": "missing"
    },
    {
      "name": "Myung-Suk Kim",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414595687",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Affective computing group. RoCo: robotic computer. MIT media lab, (2005). http://robotic.media.mit.edu/projects/ robots/roco/overview/overview.html",
      "doi": ""
    },
    {
      "text": "Ahn, M. Meaning in motion: towards the creation of embodied movement. DeSForM Workshop, (2005), 97--102.",
      "doi": ""
    },
    {
      "text": "Arnheim, R. Art and Visual Perception: A Psychology of the Creative Eye. University of California Press, (1974).",
      "doi": ""
    },
    {
      "text": "Baggermans, G. Friendly vending, (2009). http://www.guusbaggermans.nl/friendlyvending/",
      "doi": ""
    },
    {
      "text": "Buxton, B. Sketching User Experiences. Morgan Kaufmann, (2007).",
      "doi": ""
    },
    {
      "text": "Blake, R. & Shiffrar, M. Perception of human motion. Annual Review of Psychology, 58, (2007), 47--73.",
      "doi": ""
    },
    {
      "text": "BMW, GINA, (2008). http://www.ONLYw.tv/com/home/showVideo.do?articleI D=1170&spaceID=2",
      "doi": ""
    },
    {
      "text": "Breazeal, C., Wang, A. & Picard, R. Experiments with a robotic computer: body, affect and cognition interactions. In Proc. HRI'07, (2007). 153--160.  ",
      "doi": "10.1145/1228716.1228737"
    },
    {
      "text": "Dourish, P. Where the Action Is: The Foundations of Embodied Interaction. MIT press, (2001). ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Ekman, P. & Friesen, W. The repertoire of nonverbal behavior. Semiotica, 1, (1972), 49--98.",
      "doi": ""
    },
    {
      "text": "Ekman, P., Friesen, W. & Ellsworth, P. Emotion in the Human Face. Pergamon, (1972).",
      "doi": ""
    },
    {
      "text": "Feijs, L., Kyffin, S. & Young, B. Design and semantics of form and movement. DeSForM Workshop, (2005).",
      "doi": ""
    },
    {
      "text": "Guthrie, S. Faces in the Clouds: A New Theory of Religion. Oxford, (1993).",
      "doi": ""
    },
    {
      "text": "Harrison, C., Horstman, J., Hsieh, C. & Hudson, S. Unlocking the expressivity of point lights. In Proc. CHI'12, (2012), 1683--1692.  ",
      "doi": "10.1145/2207676.2208296"
    },
    {
      "text": "Harrison, S., Sengers, P. & Tatar, D. Making epistemological trouble: third-paradigm HCI as successor science. Interacting with Computers, 23(5), (2011), 385--292.  ",
      "doi": "10.1016/j.intcom.2011.03.005"
    },
    {
      "text": "Heider, F. & Simmel, M. An experimental study of apparent behavior. American Journal of Psychology, 57, (1944), 243--259.",
      "doi": ""
    },
    {
      "text": "Hutchinson, A. Labanotation: The System of Analyzing and Recording Movements. Theatre Arts Books, (1970).",
      "doi": ""
    },
    {
      "text": "Jafarinaimi, N., Forlizzi, J., Hurst, A. & Zimmerman, J. Breakaway: an ambient display designed to change human behavior. In Proc. CHI'05, (2005), 9--12.  ",
      "doi": "10.1145/1056808.1057063"
    },
    {
      "text": "James. W. A study of expression of bodily posture. Journal of General Psychology, 7, (1932), 405--37.",
      "doi": ""
    },
    {
      "text": "Ju, W. & Takayama, L. Approachability: how people interpret automatic door movement as gesture. International Journal of Design, 3(2), (2009), 77--86.",
      "doi": ""
    },
    {
      "text": "Kozima, H. & Michalowski, M. Keepon: a playful robot for research, therapy, and entertainment, Int J Soc Robot, 1, (2009), 3--18.",
      "doi": ""
    },
    {
      "text": "Knapp, M. & Hall, J. Nonverbal Communication in Human Interaction. Thompson Publishers, (2006).",
      "doi": ""
    },
    {
      "text": "Kwak, S., Kim, Y., Jee, E. & Kobayashi, H. Usability of ambient auditory cues for cleaning robots, Int J Robots, Education and Art, 1(1), (2011), 18--25.",
      "doi": ""
    },
    {
      "text": "Mehrabian, A. Nonverbal Communication. New Brunswick and London, (1972).",
      "doi": ""
    },
    {
      "text": "Michotte, A. The Perception of Causality. Basic Books, (1963).",
      "doi": ""
    },
    {
      "text": "Nanda Home Inc. Clocky: an alarm clock on wheels. http://www.clocky.net/",
      "doi": ""
    },
    {
      "text": "Piaget, J. Children's philosophies. In A Handbook of Child Psychology. Clark University Press, (1933), 505--516.",
      "doi": ""
    },
    {
      "text": "Pixar Animation Studios, Luxo Jr.: a hopping lamp. http://www.pixar.com/shorts/ljr/",
      "doi": ""
    },
    {
      "text": "Pinto, J. & Shiffrar, M. Subconfigurations of the human form in the perception of biological motion displays. Acta Psychologica, 102, (1999), 293--318.",
      "doi": ""
    },
    {
      "text": "Reeves, B. & Nass, C. The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Cambridge University Press, (1996). ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Rebeiro, T. & Paiva, A. The illusion of robotic life: principles and practices of animation for robots, In Proc. HRI'12, (2012), 383--390.  ",
      "doi": "10.1145/2157689.2157814"
    },
    {
      "text": "Sengers, P. & Gaver, W. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proc. DIS 06, (2006).  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Someren, M., Barnard, Y. & Sandberg, J. The Think Aloud Method: A Practical Guide To Modeling Cognitive Processes. Academic Press, (1994).",
      "doi": ""
    },
    {
      "text": "Sony, Rolly: sound entertainment player, (2007). http://store.sony.com/webapp/wcs/stores/servlet/ProductDi splay?catalogId=10551&storeId=10151&langId=1&partNumber=SEP30BTWHI",
      "doi": ""
    },
    {
      "text": "Suchman, L. Plans and Situated Actions. Cambridge University Press, (1987).",
      "doi": "10.5555/38407"
    },
    {
      "text": "Takayama, L., Dooley, D. & Ju, W. Expressing thought: improving robot readability with animation principles, In Proc. HRI'11, (2011), 69--76.  ",
      "doi": "10.1145/1957656.1957674"
    },
    {
      "text": "Tremoulet, P. & Feldman, J. Perception of animacy from the motion of a single object. Perception, 29(8), (2000), 943--951.",
      "doi": ""
    },
    {
      "text": "Walt Disney, Beauty and the Beast, (1991).",
      "doi": ""
    },
    {
      "text": "Wolf, T., Rode, J., Sussman, J. & Kellogg, W. Dispelling design as the black art of CHI. In Proc. CHI'06, (2006), 521--530.  ",
      "doi": "10.1145/1124772.1124853"
    },
    {
      "text": "Yohanan, S. & MacLean, K. Design and assessment of the haptic creature's affect display. In Proc. CHI'12, (2012), 473--480.  ",
      "doi": "10.1145/1957656.1957820"
    },
    {
      "text": "Young, R., Pezzutti, D., Pill, S. & Sharp, R. The development of tools to assist the design of motion in system operated products. DeSForM Workshop, (2005), 13--22.",
      "doi": ""
    }
  ]
}