{
  "doi": "10.1145/2470654.2481376",
  "title": "Effects of visualization and note-taking on sensemaking and analysis",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2721-2724",
  "year": 2013,
  "badges": [],
  "abstract": "Many sophisticated tools have been developed to help analysts detect patterns in large datasets, but the value of these tools' individual features is rarely tested. In an experiment in which participants played detectives solving homicides, we tested the utility of a visualization of data links and a notepad for collecting and organizing annotations. The visualization significantly improved participants' ability to solve the crime whereas the notepad did not. Having both features available provided no benefit over having just the visualization. The results raise questions about the potential constraints on the usefulness of intelligence analysis tools.",
  "tags": [
    "visualization",
    "analysis",
    "sensemaking",
    "interface design"
  ],
  "authors": [
    {
      "name": "Nitesh Goyal",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/do/10.1145/contrib-81500648029/rel-imgonly/anotherfacepic.png",
      "acmid": "81500648029",
      "orcid": "0000-0002-4666-1926"
    },
    {
      "name": "Gilly Leshed",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350569215",
      "orcid": "0000-0002-2308-2825"
    },
    {
      "name": "Susan R. Fussell",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrews, C., Endert, A. & North, C. 2010. Space to think: large high-resolution displays for sensemaking. Proc. CHI '10, 55--64.  ",
      "doi": "10.1145/1753326.1753336"
    },
    {
      "text": "Balakrishnan, A. D., Fussell, S. R., & Kiesler, S. 2008. Do visualizations improve synchronous remote collaboration? Proc. CHI '08, 1227--1236.  ",
      "doi": "10.1145/1357054.1357246"
    },
    {
      "text": "Boch, F, & Piolat, A. 2005. Note taking and learning: a summary of research. WAC Journal '05, 101--113.",
      "doi": ""
    },
    {
      "text": "Bier, E. A., Card, S. K., & Bodnar, J. W. 2010. Principles and tools for collaborative entity-based intelligence analysis. IEEE TVCG, 16(2), 178--191.  ",
      "doi": "10.1109/TVCG.2009.104"
    },
    {
      "text": "Borge, M., Ganoe, C. H., Shih, S.-I. & Carroll, J. M. 2012. Patterns of team processes and breakdowns in information analysis tasks. Proc. CSCW '12, 1105--1114.  ",
      "doi": "10.1145/2145204.2145369"
    },
    {
      "text": "Bostock, M., & Heer, J. 2009. ProtoVis: A graphical toolkit for visualization. IEEE TVCG, 15, 1121--1128.  ",
      "doi": "10.1109/TVCG.2009.174"
    },
    {
      "text": "Chin, G. Jr., Kuchar, O. A., & Wolf, K. E. 2009. Exploring the analytical processes of intelligence analysts. Proc. CHI '09, 11--20.  ",
      "doi": "10.1145/1518701.1518704"
    },
    {
      "text": "Convertino, G., Billman, D., Pirolli, P., Massar, J. P., & Shrager, J. 2008. The CACHE study: Group effects in computer-supported collaborative analysis. Proc. CSCW '08, 353--393.  ",
      "doi": "10.1007/s10606-008-9080-9"
    },
    {
      "text": "Gottlieb, S., Arenberg, S., & Singh, R. 1994. Crime analysis, from first report to final analysis. Santa Barbara, CA: Alpha Publishing.",
      "doi": ""
    },
    {
      "text": "Heer, J. & Agrawala, M. 2008. Design considerations for collaborative visual analytics. Info. Vis., 7, 49--62.  ",
      "doi": "10.1145/1391107.1391112"
    },
    {
      "text": "Kang, Y.-a., Gorg, C., & Stasko, J. 2011. How can visual analytics assist investigative analysis? Design implications from an evaluation. IEEE TVCG, 17, 570--583.  ",
      "doi": "10.1109/TVCG.2010.84"
    },
    {
      "text": "Pioch, N. J. & Everett, J. O. 2006. POLESTAR: Collaborative knowledge management and sensemaking tools for intelligence analysts. Proc. CIKM '06, 513--521.  ",
      "doi": "10.1145/1183614.1183688"
    },
    {
      "text": "Pirolli, P. & Card, S. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. Proc. International Conference on Intelligence Analysis, 2--4.",
      "doi": ""
    },
    {
      "text": "Shrinivasan, Y. B. & van Wijk, J. J. 2008. Supporting the analytical reasoning process in information visualization. Proc. CHI '08, 1237--1246.  ",
      "doi": "10.1145/1357054.1357247"
    },
    {
      "text": "Stasko, J., Goerg, C., & Liu, Z. 2008. Jigsaw: Supporting investigative analysis through interactive visualization. Info. Vis., 7, 118--132.  ",
      "doi": "10.1145/1466620.1466622"
    },
    {
      "text": "Wright, W., Schroh, D., Proulx, P., Skaburskis, A., & Cort, B. 2006. The sandbox for analysis: Concepts and methods. Proc. CHI '06, 801--810.  ",
      "doi": "10.1145/1124772.1124890"
    }
  ]
}