{
  "doi": "10.1145/2470654.2481294",
  "title": "A study on icon arrangement by smartphone users",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2137-2146",
  "year": 2013,
  "badges": [],
  "abstract": "The number of available mobile applications is steadily increasing. People have rapidly adopted application stores as means to customize their devices with various functionalities that go beyond communication. Understanding the principles of mobile application usage is crucial for supporting users within this new ecosystem. In this paper, we investigate how people organize applications they have installed on their devices. We asked more than 130 participants for their habits for icon arrangement and collected more than 1,400 screenshots of their devices' menus to further ground our findings. Based on this data we can distinguish five different concepts for arranging icons on smartphone menus, e.g. based on application usage frequency and applications' functional relatedness. Additionally, we investigated how these concepts emerge in relation to frequency of application installations, removals and icon rearrangements, as well as users' experience levels. Finally we discuss implications for the design of smartphone launchers, and highlight differences to icon arrangement on stationary computers.",
  "authors": [
    {
      "name": "Matthias Böhmer",
      "institution": "DFKI GmbH, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020557",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "DFKI GmbH, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Barnard, L., Yi, J., Jacko, J., and Sears, A. Capturing the effects of context on human performance in mobile computing systems. Pers. and Ubi. Comp. 11, 2 (2007).  ",
      "doi": "10.1007/s00779-006-0063-x"
    },
    {
      "text": "Barreau, D., and Nardi, B. A. Finding and reminding: file organization from the desktop. SIGCHI Bull. 27, 3 (July 1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Blom, J. O., and Monk, A. F. Theory of personalization of appearance: why users personalize their pcs and mobile phones. Hum.-Comput. Interact. 18, 3 (2003).  ",
      "doi": "10.1207/S15327051HCI1803_1"
    },
    {
      "text": "Böhmer, M., and Bauer, G. Exploiting the icon arrangement on mobile devices as information source for context-awareness. In Proc. MobileHCI (2010).  ",
      "doi": "10.1145/1851600.1851633"
    },
    {
      "text": "Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling asleep with angry birds, facebook and kindle - a large scale study on mobile application usage. In Proc. of MobileHCI (2011).  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Bridle, R., and McCreath, E. Inducing shortcuts on a mobile phone interface. In Proc. IUI (2006).  ",
      "doi": "10.1145/1111449.1111526"
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Greenberg, S. A predictive model of menu performance. In CHI (2007).  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Do, T. M. T., and Perez, D. G. By their apps you shall understand them: mining large-scale patterns of mobile phone usage. In Proc. MUM (2010).  ",
      "doi": "10.1145/1899475.1899502"
    },
    {
      "text": "Findlater, L., and Mcgrenere, J. Impact of screen size on performance, awareness, and user satisfaction with adaptive graphical user interfaces. In Proc. CHI (2008).  ",
      "doi": "10.1145/1357054.1357249"
    },
    {
      "text": "Fukazawa, Y., Hara, M., Onogi, M., and Ueno, H. Automatic mobile menu customization based on user operation history. In Proc. of MobileHCI (2009).  ",
      "doi": "10.1145/1613858.1613921"
    },
    {
      "text": "Häkkilä, J., and Chatfield, C. Personal customisation of mobile phones: a case study. In Proc. NordiCHI (2006).  ",
      "doi": "10.1145/1182475.1182524"
    },
    {
      "text": "Henze, N., Pielot, M., Poppinga, B., Schinke, T., and Boll, S. My app is an experiment: Experience from user studies in mobile app stores. Int. J. of MobileHCI (2011).  ",
      "doi": "10.4018/jmhci.2011100105"
    },
    {
      "text": "Huhtala, J., Mäntyjärvi, J., Ahtinen, A., Ventä, L., and Isomursu, M. Animated transitions for adaptive small size mobile menus. In Proc. INTERACT (2009).  ",
      "doi": "10.1007/978-3-642-03655-2_84"
    },
    {
      "text": "Karlson, A. K., Iqbal, S. T., Meyers, B., Ramos, G., Lee, K., and Tang, J. C. Mobile taskflow in context: a screenshot study of smartphone usage. In CHI (2010).  ",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Kim, J. H., and Lee, K. P. Culturally adapted mobile phone interface design: correlation between categorization style and menu structure. In Proc. MobileHCI (2007).  ",
      "doi": "10.1145/1377999.1378041"
    },
    {
      "text": "Marathe, S., and Sundar, S. S. What drives customization?: control or identity? In CHI (2011).  ",
      "doi": "10.1145/1978942.1979056"
    },
    {
      "text": "Matsui, S., and Yamada, S. Genetic algorithm can optimize hierarchical menus. In Proc. CHI (2008).  ",
      "doi": "10.1145/1357054.1357271"
    },
    {
      "text": "McDonald, J., Dayton, T., and McDonald, D. Adapting menu layout to tasks. International Journal of Man-Machine Studies 28, 4 (1988).  ",
      "doi": "10.1016/S0020-7373%2888%2980020-8"
    },
    {
      "text": "Parhi, P., Karlson, A. K., and Bederson, B. B. Target size study for one-handed thumb use on small touchscreen devices. In Proc. MobileHCI (2006).  ",
      "doi": "10.1145/1152215.1152260"
    },
    {
      "text": "Ravasio, P., Schär, S. G., and Krueger, H. In pursuit of desktop evolution: User problems and practices with modern desktop systems. ACM ToCHI 11, 2 (2004).  ",
      "doi": "10.1145/1005361.1005363"
    },
    {
      "text": "Sears, A., and Shneiderman, B. Split menus: effectively using selection frequency to organize menus. ACM ToCHI 1, 1 (Mar. 1994), 27--51.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "Shin, C., Hong, J.-H., and Dey, A. K. Understanding and prediction of mobile application usage for smart phones. In Proc. UbiComp (2012).  ",
      "doi": "10.1145/2370216.2370243"
    },
    {
      "text": "Shipman, F. M., Marshall, C. C., and Moran, T. P. Finding and using implicit structure in human-organized spatial layouts of information. In Proc. CHI (1995).  ",
      "doi": "10.1145/223904.223949"
    },
    {
      "text": "St. Amant, R., Horton, T. E., and Ritter, F. E. Model-based evaluation of cell phone menu interaction. In Proc. CHI (2004).  ",
      "doi": "10.1145/985692.985736"
    },
    {
      "text": "Verkasalo, H. Contextual patterns in mobile service usage. Pers. and Ubiq. Computing 13, 5 (2009).  ",
      "doi": "10.1007/s00779-008-0197-0"
    },
    {
      "text": "Vetek, A., Flanagan, J., Colley, A., and Keränen, T. SmartActions: Context-Aware Mobile Phone Shortcuts. In Proc. INTERACT (2009).  ",
      "doi": "10.1007/978-3-642-03655-2_86"
    },
    {
      "text": "Ziefle, M., and Bay, S. Mental models of a cellular phone menu. comparing older and younger novice users mobile. In Proc. MobileHCI (2004).",
      "doi": ""
    }
  ]
}