{
  "doi": "10.1145/2470654.2466123",
  "title": "Write here, write now!: an experimental study of group maintenance in collaborative writing",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "961-970",
  "year": 2013,
  "badges": [],
  "abstract": "Writing documents together using collaborative editing tools has become extremely common with the widespread availability of tools such as Google Docs. The design of such tools, rooted in early CSCW research, has historically been focused on providing awareness of the presence and activities of one's collaborators. Evidence from a recent qualitative study, however, suggests that people are also concerned about how their behaviors -- and they themselves -- will be perceived by others; and take steps to mitigate possible negative perceptions. We present an experimental study of dyads composing documents together, focusing in particular on group maintenance, impression management and relationship-focused behavior. Results suggest that communication is positively related to social relations, but only for synchronous writing in a shared space; the reverse can be true in asynchronous commenting and editing.",
  "authors": [
    {
      "name": "Jeremy Birnholtz",
      "institution": "Northwestern University, Evanston, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100651315",
      "orcid": "missing"
    },
    {
      "name": "Stephanie Steinhardt",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553767256",
      "orcid": "missing"
    },
    {
      "name": "Antonella Pavese",
      "institution": "Google, Inc., New York, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585726",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bales, R. F. Interaction process analysis: a method for the study of small groups. Addison-Wesley, Cambridge, MA, 1950.",
      "doi": ""
    },
    {
      "text": "Beck, E. E. and Bellotti, V. Informed opportunism as strategy: supporting coordination in distributed collaborative writing. In Proc. ECSCW (1993), 233--248. ",
      "doi": "10.5555/1241934.1241950"
    },
    {
      "text": "Bietz, M. J. Effects of communication media on the interpretation of critical feedback. In Proc. ACM CSCW (2008), 467--476.  ",
      "doi": "10.1145/1460563.1460637"
    },
    {
      "text": "Birnholtz, J. and Ibara, S. Tracking Changes in Collaborative Writing: Edits, Visibility and Group Maintenance. In Proc. ACM CSCW (2012), 809--818.  ",
      "doi": "10.1145/2145204.2145325"
    },
    {
      "text": "Caspi, A. and Blau, I. Collaboration and psychological ownership: how does the tension between the two influence perceived learning? Social Psychology of Education, 14, 2 (2011), 283--298.",
      "doi": ""
    },
    {
      "text": "Cody, M. J. and McLaughlin, M. L. Interpersonal accounting. In H. Giles and P. Robinson, ed. Handbook of language and social psychology. Wiley and Sons, London, 1990.",
      "doi": ""
    },
    {
      "text": "De Croon, E. M., Sluiter, J. K., Kuijer, P. P. F. M., and Frings-Dresen, M. H. W. The Effect of Office Concepts on Worker Health and Performance: A Systematic Review of the Literature. Ergonomics, 48(2005), 119--134.",
      "doi": ""
    },
    {
      "text": "Dourish, P. and Belotti, V. Awareness and Coordination in Shared Workspaces. In Proc. ACM CSCW (1992), 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Ellis, C., Gibbs, S. and Rein, G. Groupware: some issues and experiences. CACM, 34, 1 (1991), 39--58.  ",
      "doi": "10.1145/99977.99987"
    },
    {
      "text": "Erkens, G., Jaspers, J. and Prangsma Coordination processes in computer supported collaborative writing. Computers in Human Behavior, 21(2011), 463--486.  ",
      "doi": "10.1016/j.chb.2004.10.038"
    },
    {
      "text": "Goffman, E. Behavior in public places. The Free Press, New York, 1963.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. Anchor Books, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Gutwin, C. and Greenberg, S. A descriptive framework of workspace awareness for real-time groupware. CSCW, 11(2002), 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Hackman, R. The design of work teams. In J. Lorsch, ed. Handbook of organizational behavior. Prentice-Hall, Englewood Cliffs, NJ, 1987.",
      "doi": ""
    },
    {
      "text": "Ignat, C. L. and Norrie, M. C. Multi-level editing of hierarchical documents. CSCW, 17, 5--6 (2008), 423468.  ",
      "doi": "10.1007/s10606-007-9071-2"
    },
    {
      "text": "Kim, H. C. and Eklundh, K. S. Reviewing practices in collaborative writing. CSCW, 10(2001), 247--259.  ",
      "doi": "10.1023/A%3A1011229212323"
    },
    {
      "text": "Leland, M. D., Fish, R. S. and Kraut, R. E. Quilt: A collaborative tool for cooperative writing. In Proc. ACM CSCW (1988), 206--215.",
      "doi": ""
    },
    {
      "text": "McCroskey, J. C. and McCain, T. A. The measurement of interpersonal attraction. Communication Monographs, 41(1974), 261--266.",
      "doi": ""
    },
    {
      "text": "McGrath, J. E. Groups: Interaction and Performance. Prentice-Hall, Englewood Cliffs, NJ, 1984.",
      "doi": ""
    },
    {
      "text": "Neuwirth, C. M., Chandhok, R., Charney, D., Wojahn, P. and Kim, L. Distributed Collaborative Writing: A comparison of spoken and written modalities for reviewing and revising documents. In Proc. ACM CHI (1994), 51--57.  ",
      "doi": "10.1145/191666.191693"
    },
    {
      "text": "Neuwirth, C. M., Chandhok, R., Kaufer, D. S., Erion, P., Morris, J. and Miller, D. Flexible diff-ing in a collaborative writing system. In Proc. ACM CSCW (1992), 147--154.  ",
      "doi": "10.1145/143457.143473"
    },
    {
      "text": "Neuwirth, C. M., Kaufer, D. S., Chandhok, R. and Morris, J. H. Computer Support for Distributed Collaborative Writing: A Coordination Science Perspective. In G. M. Olson and T. W. Malone, ed. Coordination Theory and Collaboration Technology. Lawrence Erlbaum Assoc, Mahwah, NJ, 2000.",
      "doi": ""
    },
    {
      "text": "Noel, S. and Robert, J.-M. Empirical study on collaborative writing: what do co-authors do, use and like? CSCW, 13(2004), 63--89.  ",
      "doi": "10.1023/B%3ACOSU.0000014876.96003.be"
    },
    {
      "text": "Olson, J. S., Olson, G. M., Storrosten, M. and Carter, M. Groupwork close up: A comparison of the group design process with and without a simple group editor. ACM Trans. on Info. Systems, 11(1993), 321--348.  ",
      "doi": "10.1145/159764.159763"
    },
    {
      "text": "Posner, I. and Baecker, R. How People Write Together. In Proc. HICSS (1993), 127--138.",
      "doi": ""
    },
    {
      "text": "Posner, I., Mitchell, A. and Baecker, R. Learning to write together using groupware. In Proc. ACM CHI (1995), 288--295.  ",
      "doi": "10.1145/223904.223941"
    },
    {
      "text": "Scott, M. B. and Lyman, S. M. Accounts. American Sociological Review, 33(1968), 46--62.",
      "doi": ""
    },
    {
      "text": "Tam, J. and Greenberg, S. A framework for asynchronous change awareness in collaborative documents and workspaces. International Journal of Human-Computer Studies, 64(2006), 583--598.  ",
      "doi": "10.1016/j.ijhcs.2006.02.004"
    },
    {
      "text": "Zheng, J., Veinott, E., Bos, N., Olson, J. S. and Olson, G. M. Trust without Touch: Jumpstarting long-distance trust with initial social activities. In Proc. ACM CHI (2002), 141--146.  ",
      "doi": "10.1145/503376.503402"
    }
  ]
}