{
  "doi": "10.1145/2470654.2466223",
  "title": "The design and field observation of a haptic notification system for timing awareness during oral presentations",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1689-1698",
  "year": 2013,
  "badges": [],
  "abstract": "To moderate oral presentations a chair must manage time, and communicate time parameters to speakers through a variety of means. But speakers often miss time cues, chairs cannot confirm their receipt, and the broken dialogue can be a sideshow for the audience. We developed HaNS, a wireless wrist-worn chair-speaker Haptic Notification System that delivers tactile cues for time-managing oral presentations, and performed field observations at university research seminars and two mid-sized academic conferences (input from 66 speakers, 21 chairs, and 65 audience members). Results indicate that HaNS can improve a user's awareness of time, facilitate chair-speaker coordination, and reduce distraction of speaker and audience through its private communication channel. Eliminating overruns will require improvement in speaker 'internal' control, which our results suggest HaNS can also support given practice. We conclude with design guidelines for both conference-deployed and personal timing tools, using touch or another notification modality.",
  "authors": [
    {
      "name": "Diane Tam",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502792618",
      "orcid": "missing"
    },
    {
      "name": "Karon E. MacLean",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Katherine J. Kuchenbecker",
      "institution": "University of Pennsylvania, Philadelphia, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100483080",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arduino. 2012. http://arduino.cc/en/Main/ArduinoBoardFio.",
      "doi": ""
    },
    {
      "text": "Baumann, M.A., MacLean, K.E., Hazelton, T.W., and McKay, A. Emulating human attention-getting practices with wearable haptics. Proc. HAPTICS, IEEE (2010), 149--156.  ",
      "doi": "10.1109/HAPTIC.2010.5444662"
    },
    {
      "text": "Brehmer, M., McGrenere, J., Tang, C., and Jacova, C. Effects of interruptions on older adults' computerised cognitive testing performance. Proc. CHI, ACM (2012), 2649--2658.  ",
      "doi": "10.1145/2207676.2208656"
    },
    {
      "text": "Cao, Y., Theune, M., and Nijholt, A. Towards cognitive-aware multimodal presentation: The modality effects in high-load HCI. Proc. EPCE, Springer-Verlag (2009), 3--12.  ",
      "doi": "10.1007/978-3-642-02728-4_1"
    },
    {
      "text": "Chan, A., MacLean, K., and McGrenere, J. Designing haptic icons to support collaborative turn-taking. Int. J. Hum.-Comput. Stud. 66, 5 (2008), 333--355.  ",
      "doi": "10.1016/j.ijhcs.2007.11.002"
    },
    {
      "text": "Chen, H., Santos, J., Graves, M., Kim, K., and Tan, H.Z. Tactor localization at the wrist. Proc. EuroHaptics, Springer-Verlag (2008), 209--218.  ",
      "doi": "10.1007/978-3-540-69057-3_25"
    },
    {
      "text": "Corbin, J. and Strauss, A. Basics of qualitative research. Sage Publications, CA, USA, 2008.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Horvitz, E., and Wilhite, S. A diary study of task switching and interruptions. Proc. CHI, ACM (2004), 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Digi. 2012. http://www.digi.com/xbee/.",
      "doi": ""
    },
    {
      "text": "Dredge, S. MIT's Dr Joseph Paradiso talks Smart Spaces, 2007. http://www.techdigest.tv/2007/12/mits_dr_joseph.html.",
      "doi": ""
    },
    {
      "text": "Enriquez, M. and MacLean, K. The role of choice in longitudinal recall of meaningful tactile signals. Proc. HAPTICS, IEEE (2008), 49--56.  ",
      "doi": "10.1109/HAPTICS.2008.4479913"
    },
    {
      "text": "Van Erp, J. and Spapé, M. Distilling the underlying dimensions of tactile melodies. Proc. EuroHaptics, (2003), 111--120.",
      "doi": ""
    },
    {
      "text": "Gillie, T. and Broadbent, D. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychological Research 50, 4 (1989), 243--250.",
      "doi": ""
    },
    {
      "text": "Gluck, J., Bunt, A., and McGrenere, J. Matching attentional draw with utility in interruption. Proc. CHI, ACM (2007), 41--50.  ",
      "doi": "10.1145/1240624.1240631"
    },
    {
      "text": "Hoggan, E., Raisamo, R., and Brewster, S.A. Mapping information to audio and tactile icons. Proc. ICMI-MLMI, ACM (2009), 327--334.  ",
      "doi": "10.1145/1647314.1647382"
    },
    {
      "text": "Iqbal, S.T. and Bailey, B.P. Effects of intelligent notification management on users and their tasks. Proc. CHI, ACM (2008), 93--102.  ",
      "doi": "10.1145/1357054.1357070"
    },
    {
      "text": "Iqbal, S.T. and Bailey, B.P. Oasis: A framework for linking notification delivery to the perceptual structure of goal-directed tasks. ACM TOCHI 17, 4 (2010), 15:1--15:28.  ",
      "doi": "10.1145/1879831.1879833"
    },
    {
      "text": "Iqbal, S.T. and Horvitz, E. Notifications and awareness: a field study of alert usage and preferences. Proc. CSCW, ACM (2010), 27--30.  ",
      "doi": "10.1145/1718918.1718926"
    },
    {
      "text": "Israr, A., Tan, H.Z., and Reed, C.M. Frequency and amplitude discrimination along the kinesthetic-cutaneous continuum in the presence of masking stimuli. J. Acoust. Soc. Am. 120, 5 Pt 1 (2006), 2789--2800.",
      "doi": ""
    },
    {
      "text": "Jones, M.G., Minogue, J., Tretter, T.R., Negishi, A., and Taylor, R. Haptic augmentation of science instruction: Does touch matter? Science Education 90, 1 (2006), 111--123.",
      "doi": ""
    },
    {
      "text": "Jones, S.E. and Yarbrough, A.E. A naturalistic study of the meanings of touch. Comm. Monographs 52, 1 (1985), 19--56.",
      "doi": ""
    },
    {
      "text": "Karuei, I., MacLean, K.E., Foley-Fisher, Z., MacKenzie, R., Koch, S., and El-Zohairy, M. Detecting vibrations across the body in mobile contexts. Proc. CHI, ACM (2011), 3267--3276.  ",
      "doi": "10.1145/1978942.1979426"
    },
    {
      "text": "Kurihara, K., Goto, M., Ogata, J., Matsusaka, Y., and Igarashi, T. Presentation sensei. Proc. ICMI, ACM (2007), 358--365.  ",
      "doi": "10.1145/1322192.1322256"
    },
    {
      "text": "Lee, S.C. and Starner, T. BuzzWear: alert perception in wearable tactile displays on the wrist. Proc. CHI, ACM (2010), 433--442.  ",
      "doi": "10.1145/1753326.1753392"
    },
    {
      "text": "Leung, R., MacLean, K., Bertelsen, M.B., and Saubhasik, M. Evaluation of haptically augmented touchscreen GUI elements under cognitive load. Proc. ICMI, ACM (2007), 374--381.  ",
      "doi": "10.1145/1322192.1322258"
    },
    {
      "text": "Logitech. 2012. http://www.logitech.com/en-ca/remotes.",
      "doi": ""
    },
    {
      "text": "MacLean, K.E. Foundations of transparency in tactile information design. IEEE Trans. on Haptics 1, 2 (2008), 84--95.  ",
      "doi": "10.1109/TOH.2008.20"
    },
    {
      "text": "MacLean, K.E. Putting haptics into the ambience. IEEE Transactions on Haptics 2, 3 (2009), 123--135.  ",
      "doi": "10.1109/TOH.2009.33"
    },
    {
      "text": "Mamykina, L., Mynatt, E., and Terry, M.A. Time Aura: interfaces for pacing. Proc. CHI, ACM (2001), 144--151.  ",
      "doi": "10.1145/365024.365077"
    },
    {
      "text": "Matlin, M.W. Cognition. John Wiley and Sons, NJ, USA, 2008.",
      "doi": ""
    },
    {
      "text": "Microsoft PowerPoint. 2012. http://office.microsoft.com/.",
      "doi": ""
    },
    {
      "text": "Moreno, R. and Mayer, R.E. Cognitive principles of multimedia learning: The role of modality and contiguity. Journal of Educational Psychology 91, 2 (1999), 358--368.",
      "doi": ""
    },
    {
      "text": "Mutewatch. 2012. http://mutewatch.com/.",
      "doi": ""
    },
    {
      "text": "Myers, B.A. Using multiple devices simultaneously for display and control. IEEE Personal Comm. 7, 5 (2000), 62--65.",
      "doi": ""
    },
    {
      "text": "Oakley, I., Kim, Y., Lee, J., and Ryu, J. Determining the feasibility of forearm mounted vibrotactile displays. Proc. VR, IEEE (2006), 27--34.",
      "doi": ""
    },
    {
      "text": "Occhialini, V., Van Essen, H., and Eggen, B. Design and evaluation of an ambient display to support time management during meetings. Proc. INTERACT, Springer-Verlag (2011), 263--280. ",
      "doi": "10.5555/2042118.2042144"
    },
    {
      "text": "Paivio, A. Mental representations: a dual coding approach. Oxford University Press, Oxford, England, 1986.",
      "doi": ""
    },
    {
      "text": "Post, L.J., Zompa, I.C., and Chapman, C.E. Perception of vibrotactile stimuli during motor activity in human subjects. Experimental brain research 100, 1 (1994), 107--120.",
      "doi": ""
    },
    {
      "text": "Predebon, J. Time judgments as a function of clock duration: effects of temporal paradigm and an attention-demanding nontemporal task. Percept. Mot. Skills 88, 3 Pt 2 (1999), 1251--4.",
      "doi": ""
    },
    {
      "text": "Spicer, R.P., Lin, Y.R., and Kelliher, A. NextSlidePlease: agile hyperpresentations. Proc. MM, ACM (2009), 1045--1048.  ",
      "doi": "10.1145/1631272.1631508"
    },
    {
      "text": "Stanley, A.A. and Kuchenbecker, K.J. Evaluation of tactile feedback methods for wrist rotation guidance. IEEE Transactions on Haptics 5, 3 (2012), 240--251.  ",
      "doi": "10.1109/TOH.2012.33"
    },
    {
      "text": "Tam, D. The design and field observation of a haptic notification system for timing awareness during oral presentations. Master's Thesis, University of British Columbia, 2012.",
      "doi": ""
    },
    {
      "text": "Tang, A., McLachlan, P., Lowe, K., Saka, C.R., and MacLean, K. Perceiving ordinal data haptically under workload. Proc. ICMI, ACM (2005), 317--324.  ",
      "doi": "10.1145/1088463.1088517"
    },
    {
      "text": "Ternes, D. and Maclean, K.E. Designing large sets of haptic icons with rhythm. Proc. EuroHaptics, Springer-Verlag (2008), 199--208.  ",
      "doi": "10.1007/978-3-540-69057-3_24"
    },
    {
      "text": "Töyssy, S., Raisamo, J., and Raisamo, R. Telling time by vibration. Proc. EuroHaptics, Springer-Verlag (2008), 924--929.  ",
      "doi": "10.1007/978-3-540-69057-3_116"
    },
    {
      "text": "Vastenburg, M.H., Keyson, D.V., and Ridder, H. Considerate home notification systems: a field study of acceptability of notifications in the home. Personal Ubiquitous Computing 12, 8 (2008), 555--566.  ",
      "doi": "10.1007/s00779-007-0176-x"
    },
    {
      "text": "Warnock, D., McGee-Lennon, M.R., and Brewster, S. The impact of unwanted multimodal notifications. Proc. ICMI, ACM (2011), 177--184.  ",
      "doi": "10.1145/2070481.2070510"
    },
    {
      "text": "Wickens, C.D. Processing resources in attention. Academic Press, NY, USA, 1984, 63--102.",
      "doi": ""
    }
  ]
}