{
  "doi": "10.1145/2470654.2470689",
  "title": "A multi-touch interface for fast architectural sketching and massing",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "247-256",
  "year": 2013,
  "badges": [],
  "abstract": "Architectural sketching and massing are used by designers to analyze and explore the design space of buildings. This paper describes a novel multi-touch interface for fast architectural sketching and massing of tall buildings. It incorporates a family of multi-touch gestures, enabling one to quickly sketch the 2D contour of a base floor plan and extrude it to model a building with multi-floor structures. Further, it provides a set of gestures to users: select and edit a range of floors; scale contours of a building; copy, paste, and rotate a building, i.e., create a twisted structure; edit profile curves of a building's profile; and collapse and remove a selected range of floors. The multi-touch system also allows users to apply textures or geometric facades to the building, and to compare different designs side-by-side. To guide the design process, we describe interactions with a domain expert, a practicing architect. The final interface is evaluated by architects and students in an architecture Dept., which demonstrates that the system allows rapid conceptual design and massing of novel multi-story building structures.",
  "tags": [
    "sketching",
    "building design",
    "massing",
    "multi-touch"
  ],
  "authors": [
    {
      "name": "Qian Sun",
      "institution": "Nanyang Technological University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484649380",
      "orcid": "missing"
    },
    {
      "name": "Juncong Lin",
      "institution": "Xiamen University, Xiamen, Fujian, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556497656",
      "orcid": "missing"
    },
    {
      "name": "Chi-Wing Fu",
      "institution": "Nanyang Technological University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244740",
      "orcid": "missing"
    },
    {
      "name": "Sawako Kaijima",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421600560",
      "orcid": "missing"
    },
    {
      "name": "Ying He",
      "institution": "Nanyang Technological University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331607",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akin, O., and Moustapha, H. Strategic use of representation in architectural massing. Elsevier, 2003.",
      "doi": ""
    },
    {
      "text": "Bae, S.-H., Balakrishnan, R., and Singh, K. ILoveSketch: as-natural-as-possible sketching system for creating 3D curve models. In ACM UIST '08 (2008), 151--160.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "Bae, S.-H., Balakrishnan, R., and Singh, K. EverybodyLovesSketch: 3D sketching for a broader audience. In ACM UIST '09 (2009), 59--68.  ",
      "doi": "10.1145/1622176.1622189"
    },
    {
      "text": "Bau, O., Poupyrev, I., Israr, A., and Harrison, C. TeslaTouch: Electrovibration for touch surfaces. In ACM UIST '10 (2010), 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Benko, H., Wilson, A. D., and Baudisch, P. Precise selection techniques for multi-touch screens. In ACM CHI '06 (2006), 1263--1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Chang, S. H.-H., Stuart, L., Plimmer, B., and Wünsche, B. Origami simulator: A multi-touch experience. In ACM CHI Extended Abstracts (2009), 3889--3894.  ",
      "doi": "10.1145/1520340.1520589"
    },
    {
      "text": "Chiu, P., Liao, C., and Chen, F. Multi-touch document folding: Gesture models, fold directions and symmetries. In ACM CHI '11 (2011), 1591--1600.  ",
      "doi": "10.1145/1978942.1979174"
    },
    {
      "text": "Cohé, A., Décle, F., and Hachet, M. tBox: A 3D transformation widget designed for touch-screens. In ACM CHI '11 (2011), 3005--3008.  ",
      "doi": "10.1145/1978942.1979387"
    },
    {
      "text": "Fu, C.-W., Goh, W.-B., and Ng, J. A. Multi-touch techniques for exploring large-scale 3D astrophysical simulations. In ACM CHI '10 (2010), 2213--2222.  ",
      "doi": "10.1145/1753326.1753661"
    },
    {
      "text": "Gänshirt, C. Tools for Ideas: An Introduction to Architectural Design. Birkhauser GmbH, 2007.",
      "doi": ""
    },
    {
      "text": "Grossman, T., Wigdor, D., and Balakrishnan, R. Multi-finger gestural interaction with 3D volumetric displays. In ACM UIST '04 (2004), 61--70.  ",
      "doi": "10.1145/1029632.1029644"
    },
    {
      "text": "Hancock, M., Carpendale, S., and Cockburn, A. Shallow-depth 3D interaction: Design and evaluation of one-, two- and three-touch techniques. In ACM CHI '07 (2007), 1147--1156.  ",
      "doi": "10.1145/1240624.1240798"
    },
    {
      "text": "Hancock, M., ten Cate, T., and Carpendale, S. Sticky tools: full 6DOF force-based interaction for multi-touch tables. In ITS '09 (2009), 133--140.  ",
      "doi": "10.1145/1731903.1731930"
    },
    {
      "text": "Igarashi, T., Moscovich, T., and Hughes, J. F. As-rigid-as-possible shape manipulation. ACM TOG 24, 3 (2005), 1134--1141.  ",
      "doi": "10.1145/1073204.1073323"
    },
    {
      "text": "Kim, J.-S., Gracanin, D., Matkovic, K., and Quek, F. iPhone/iPod touch as input devices for navigation in immersive virtual environments. In IEEE VR '09 (2009), 261--262.  ",
      "doi": "10.1109/VR.2009.4811045"
    },
    {
      "text": "Kin, K., Miller, T., Bollensdorff, B., DeRose, T., Hartmann, B., and Agrawala, M. Eden: A professional multitouch tool for constructing virtual organic environments. In ACM CHI '11 (2011), 1343--1352.  ",
      "doi": "10.1145/1978942.1979141"
    },
    {
      "text": "Longay, S., Runions, A., Boudon, F., and Prusinkiewicz, P. TreeSketch: interactive procedural modeling of trees on a tablet. In SBIM '12 (2012), 107--120. ",
      "doi": "10.5555/2331067.2331083"
    },
    {
      "text": "Moscovich, T., and Hughes, J. F. Multi-finger cursor techniques. In Graphics Interface (2006), 1--7. ",
      "doi": "10.5555/1143079.1143081"
    },
    {
      "text": "Palubicki, W., Horel, K., Longay, S., Runions, A., Lane, B., Měch, R., and Prusinkiewicz, P. Self-organizing tree models for image synthesis. ACM Trans. Graph. 28, 3 (2009), 58:1--58:10.  ",
      "doi": "10.1145/1531326.1531364"
    },
    {
      "text": "Reisman, J. L., Davidson, P. L., and Han, J. Y. A screen-space formulation for 2D and 3D direct manipulation. In ACM UIST '09 (2009), 69--78.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "Sharma, A., Madhvanath, S., Shekhawat, A., and Billinghurst, M. MozArt: a multimodal interface for conceptual 3D modeling. In ICMI '11 (2011), 307--310.  ",
      "doi": "10.1145/2070481.2070538"
    },
    {
      "text": "Tversky, B. The Cambridge Handbook of Visuospatial Thinking. Cambridge University Press, 2005, ch. Functional Significance of Visuospatial Representations.",
      "doi": ""
    }
  ]
}