{
  "doi": "10.1145/2470654.2466132",
  "title": "iPhone in vivo: video analysis of mobile device use",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1031-1040",
  "year": 2013,
  "badges": [],
  "abstract": "Despite the widespread use of mobile devices, details of mobile technology use 'in the wild' have proven difficult to collect. This paper uses video data to gain new insight into the use of mobile computing devices. Our new method combines screen-capture of iPhone use with video recordings from wearable cameras. We use this data to analyse how mobile device use is threaded into other co-present activities, focusing on the use of maps and internet searches. Close analysis reveals novel aspects of gestures on touch screens, how they serve 'double duty' - both as interface gestures but as as resources for ongoing joint action. We go on to describe how users 'walk the blue dot' to orientate themselves, and how searches are occasioned by the local environment. In conclusion, we argue that mobile devices - rather than pushing us away from the world around us - are instead just another thread in the complex tapestry of everyday interaction.",
  "tags": [
    "video methods",
    "ethnography",
    "smartphone use",
    "mobility"
  ],
  "authors": [
    {
      "name": "Barry Brown",
      "institution": "Mobile Life @ Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    },
    {
      "name": "Moira McGregor",
      "institution": "City University, London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556738156",
      "orcid": "missing"
    },
    {
      "name": "Eric Laurier",
      "institution": "University of Edinburgh, Edinburgh, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481302",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barkhuus, L. and Polichar, V. E. Empowerment through seamfulness: smart phones in everyday life. Personal and Ubiquitous Computing, 15, 6 (2011), 629--639.  ",
      "doi": "10.1007/s00779-010-0342-4"
    },
    {
      "text": "Berg, S., Taylor, A., et al. Mobile devices for the next generation: device designs for teenagers. In Proceedings of CHI 2003, Fort Lauderdale, Florida, ACM Press (2003).  ",
      "doi": "10.1145/642611.642687"
    },
    {
      "text": "Böhmer, M., Hecht, B., et al. Falling asleep with angry birds, facebook and kindle: a large scale study on mobile application usage. In Proceedings of MobileHCI 2011 (2011), 47--56 ACM.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Brown, B. and Chalmers, M. Tourism and mobile technology. In Proceedings of ECSCW 2003, Klewer Academic Press (2003), 335--355. ",
      "doi": "10.5555/1241889.1241907"
    },
    {
      "text": "Brown, B. and Laurier, E. The normal natural troubles of driving with GPS. In Proceedings of CHI 2012 (2012), 1621--1630 ACM.  ",
      "doi": "10.1145/2207676.2208285"
    },
    {
      "text": "Brown, B. and O'hara, K. Place as a practical concern of mobile workers. Environment and Planning A, 35, 9 (2003), 1565--1587.",
      "doi": ""
    },
    {
      "text": "Carter, S., Mankoff, J., et al. Momento: support for situated ubicomp experimentation. In Proceedings of the SIGCHI conference on Human factors in computing systems (2007), 125--134 ACM.  ",
      "doi": "10.1145/1240624.1240644"
    },
    {
      "text": "Church, K. and Oliver, N. Understanding mobile web and mobile search use in today's dynamic mobile landscape. In Mobile HCI 2011 (2011), 67--76 ACM.  ",
      "doi": "10.1145/2037373.2037385"
    },
    {
      "text": "Froehlich, J., Chen, M. Y., et al. MyExperience: a system for in situ tracing and capturing of user feedback on mobile phones. In MobiSys '07 (2007), 57--70 ACM.  ",
      "doi": "10.1145/1247660.1247670"
    },
    {
      "text": "Golledge, R. G. Human Wayfinding and cognitive maps. In Wayfinding behavior, cognitive mapping and other spatial processes, The John Hopkins University Press (1999).",
      "doi": ""
    },
    {
      "text": "Goodwin, C. Notes on story structure and the organization of participation. In Structures of social action (1984), 225--246.",
      "doi": ""
    },
    {
      "text": "Greiffenhagen, C. and Watson, R. Visual repairables: analysing the work of repair in human-computer interaction. Visual Communication, 8, 1 (2009), 65--90.",
      "doi": ""
    },
    {
      "text": "Heath, C. and Luff, P. Technology in action. Cambridge university press, Cambridge, 2000. ",
      "doi": "10.5555/556346"
    },
    {
      "text": "Heath, C., Svensson, M. S., et al. Configuring awareness. Computer Supported Cooperative Work (CSCW), 11, 3 (2002), 317--347.  ",
      "doi": "10.1023/A%3A1021247413718"
    },
    {
      "text": "Heath, C. C. and Luff, P. Collaboration and control: Crisis Management and Multimedia Technology. CSCW, 1 (1-2) (1992), 69--94.",
      "doi": ""
    },
    {
      "text": "Hindmarsh, J., Fraser, M., et al. Object-focused interaction in collaborative virtual environments. ACM Transactions on Computer-Human Interaction (TOCHI), 7, 4 (2000), 477--509.  ",
      "doi": "10.1145/365058.365088"
    },
    {
      "text": "Ipsos-MediaCT/Google. Mobile Internet & Smartphone Adoption: New Insights into Consumer Usage of Mobile Devices, the Shift to Smartphones & the Emergence of Tablets, http://googlemobileads.blogspot.se/2012/01/new-research-global-surge-in-smartphone.html. 2012.",
      "doi": ""
    },
    {
      "text": "Kamvar, M. and Baluja, S. A large scale study of wireless search behavior: Google mobile search. In Proceedings of the SIGCHI conference on Human Factors in computing systems (2006), 701--709 ACM.  ",
      "doi": "10.1145/1124772.1124877"
    },
    {
      "text": "Laurier, E. and Brown, B. Rotating maps and readers: praxiological aspects of alignment and orientation. Transactions of the Institute of British Geographers, 33, 2 (2008), 201--216.",
      "doi": ""
    },
    {
      "text": "Luff, P. and Heath, C. Mobility in Collaboration. In Proceedings of CSCW 1998, ACM Press (1998), 305--314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "March, J. and Sevon, G. Gossip, information and decision making. In Decisions and Organzations, Basil Blackwell (1988).",
      "doi": ""
    },
    {
      "text": "Merchant, G. Mobile practices in everyday life: Popular digital technologies and schooling revisited. British Journal of Educational Technology, 43, 5 (2012), 770--782.",
      "doi": ""
    },
    {
      "text": "Mondada, L. Talking and driving: multi-activity in the car. Semiotica, 2012, 191 (2012), 223--256.",
      "doi": ""
    },
    {
      "text": "Murtagh, G. Seeing the 'rules': preliminary observations on action, interaction and mobile phone use. In Wireless World, Springer (2001). ",
      "doi": "10.5555/510801.510810"
    },
    {
      "text": "Palen, L. and Salzman, M. Voice-mail diary studies for naturalistic data capture under mobile conditions. ACM, City, 2002.",
      "doi": "10.1145/587078.587092"
    },
    {
      "text": "Palen, L., Salzman, M., et al. Going wireless: behavior & practice of new mobile phone users. In Proceedings of CSCW '00, ACM (2000), 201--210.  ",
      "doi": "10.1145/358916.358991"
    },
    {
      "text": "Psathas, G. Conversation analysis: The study of talk-in-interaction. Sage Publications, Incorporated, 1994.",
      "doi": ""
    },
    {
      "text": "Rodriguez, B. Amid GPS boom, paper maps hang on, 3rd July 2012. USA Today (2012).",
      "doi": ""
    },
    {
      "text": "Scollon, C. N., Kim-Prieto, C., et al. Experience sampling: Promises and pitfalls, strengths and weaknesses. Journal of Happiness Studies, 4, 1 (2003), 5--34.",
      "doi": ""
    },
    {
      "text": "Tse, E., Shen, C., et al. How pairs interact over a multimodal digital table. In Proceedings of the SIGCHI conference on Human factors in computing systems (2007), 215--218 ACM.  ",
      "doi": "10.1145/1240624.1240659"
    },
    {
      "text": "vom Lehn, D., Heath, C., et al. Exhibiting Interaction: Conduct and Collaboration in Museums and Galleries. Symbolic Interaction, 24, 2 (2001), 189--216.",
      "doi": ""
    },
    {
      "text": "Weilenmann, A. and Larsson, C. Local Use and Sharing of Mobile Phones. In Wireless World: social, cultural and interactional aspects of wireless technology, Springer Verlag (2001). ",
      "doi": "10.5555/510801.510811"
    }
  ]
}