{
  "doi": "10.1145/2470654.2466149",
  "title": "Swifter: improved online video scrubbing",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1159-1168",
  "year": 2013,
  "badges": [],
  "abstract": "Online streaming video systems have become extremely popular, yet navigating to target scenes of interest can be a challenge. While recent techniques have been introduced to enable real-time seeking, they break down for large videos, where scrubbing the timeline causes video frames to skip and flash too quickly to be comprehendible. We present Swifter, a new video scrubbing technique that displays a grid of pre-cached thumbnails during scrubbing actions. In a series of studies, we first investigate possible design variations of the Swifter technique, and the impact of those variations on its performance. Guided by these results we compare an implementation of Swifter to the previously published Swift technique, in addition to the approaches utilized by YouTube and Netfilx. Our results show that Swifter significantly outperforms each of these techniques in a scene locating task, by a factor of up to 48%.",
  "authors": [
    {
      "name": "Justin Matejka",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153192",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., A. Cockburn, S. Fitchett, C. Gutwin and S. Greenberg (2009). Revisiting read wear: analysis, design, and evaluation of a footprints scrollbar, ACM CHI. 1665--1674.  ",
      "doi": "10.1145/1518701.1518957"
    },
    {
      "text": "Bachmann, T. (1991). Identification of spatially queatized tachistoscopic images of faces: How many pixels does it take to carry identity? European Journal of Cognitive Psychology. 3:85--103.",
      "doi": ""
    },
    {
      "text": "Bailer, W., Schober, C., and Thallinger, G. (2006). Video Content Browsing Based on Iterative Feature Clustering for Rushes Exploration. TRECVID Workshop. 230--239.",
      "doi": ""
    },
    {
      "text": "Barnes, C., Goldman, D.B., Shechtman, E., Finkelstein, A. (2010). Video tapestries with continuous temporal zoom. ACM SIGGRAPH. Article 89.  ",
      "doi": "10.1145/1833349.1778826"
    },
    {
      "text": "Byrd, D. (1999). A scrollbar-based visualization for document navigation, ACM Digital libraries. 122--129.  ",
      "doi": "10.1145/313238.313283"
    },
    {
      "text": "Chang, L., Yang, Y., and Hua, X.S. (2008). Smart Video Player. IEEE Multimedia and Expo. 1605--1606.",
      "doi": ""
    },
    {
      "text": "Chen, L., Chen, G.C., Xu, C.Z., March, J., and Benford, S. (2008). EmoPlayer: A Media Player for Video Clips with Affective Annotations. Int. with Comp. 20:17--28.  ",
      "doi": "10.5555/1327552.1327934"
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Alexander, J. (2006). Faster document navigation with space-filling thumbnails. ACM UIST. 1--10.  ",
      "doi": "10.1145/1124772.1124774"
    },
    {
      "text": "Divakaran, A. and Forlines, C. and Lanning, T. and Shipman, S. and Wittenburg, K. (2005). Augmenting Fast-Forward and Rewind for Personal Digital Video Recorders. IEEE ICCE. 43--44.",
      "doi": ""
    },
    {
      "text": "Doulamis, A.D. and Doulamis, N.D. (2004). Optimal Content-based Video Decomposition for Interactive Video Navigation. IEEE CSVT. 757--775.  ",
      "doi": "10.1109/TCSVT.2004.828348"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. (2010). Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. UIST. 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Holthe, O. and Ronningen, L.A. (2006). Video Browsing Techniques for Web Interfaces. IEEE CCNC. 1224--1228.",
      "doi": ""
    },
    {
      "text": "Hürst, W. (2006). Interactive Audio-Visual Video Browsing. ACM MM. 675--678.  ",
      "doi": "10.1145/1180639.1180781"
    },
    {
      "text": "Hürst, W. and Darzentas, D. (2012). Quantity versus quality: The role of layout and interaction complexity in thumbnail-based video retrieval interfaces. ICMR. 45.",
      "doi": ""
    },
    {
      "text": "Janin, A., Gottlieb, L., and Friedland, G. (2010). Joke-oMat HD: Browsing Sitcoms with Human Derived Transcripts. ACM MM. 1591--1594.  ",
      "doi": "10.1145/1873951.1874295"
    },
    {
      "text": "Matejka, J., Grossman, T., and Fitzmaurice G. (2012). Swift: Reducing the Effects of Latency in Online Video Scrubbing. ACM CHI. 637--646.  ",
      "doi": "10.1145/2207676.2207766"
    },
    {
      "text": "Pongnumkul, S., Wang, J., Ramos, G., and Cohen, M. (2010). Content-Aware dynamic timeline for video browsing. ACM UIST. 139--142.  ",
      "doi": "10.1145/1866029.1866053"
    },
    {
      "text": "Ramos, G. and Balakrishnan, R. (2003). Fluid Interaction Techniques for the Control and Annotation of Digital Video. ACM UIST. 105--114.  ",
      "doi": "10.1145/964696.964708"
    },
    {
      "text": "Schoeffmann, K., Taschwer, M., and Boeszoermenyi, L. (2010). The Video Explorer -- A Tool for Navigation and Searching within a Single Video based on Fast Content Analysis. ACM SIGMM. 247--258.  ",
      "doi": "10.1145/1730836.1730867"
    },
    {
      "text": "Torralba, A., Fregus, R., and Freeman, W. T. (2006) 80 Million Tiny Images: A Large Data Set for Nonparametric Object and Scene Recognition. IEEE Trans. PAMI. 11, p. 1958--1970.  ",
      "doi": "10.1109/TPAMI.2008.128"
    },
    {
      "text": "Truong, B.T. and Venkatesh, S. (2007). Video Abstraction: A Systematic Review and Classification. ACM TOMCCAP. Appl. 3, 1, Article 3.  ",
      "doi": "10.1145/1198302.1198305"
    },
    {
      "text": "Tsukayama, H. (2012). YouTube: The future of entertainment is on the Web. The Washington Post.",
      "doi": ""
    }
  ]
}