{
  "doi": "10.1145/2470654.2481421",
  "title": "Bezel-Tap gestures: quick activation of commands from sleep mode on tablets",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3027-3036",
  "year": 2013,
  "badges": [],
  "abstract": "We present Bezel-Tap Gestures, a novel family of interaction techniques for immediate interaction on handheld tablets regardless of whether the device is alive or in sleep mode. The technique rests on the close succession of two input events: first a bezel tap, whose detection by accelerometers will awake an idle tablet almost instantly, then a screen contact. Field studies confirmed that the probability of this input sequence occurring by chance is very low, excluding the accidental activation concern. One experiment examined the optimal size of the vocabulary of commands for all four regions of the bezel (top, bottom, left, right). Another experiment evaluated two variants of the technique which both allow two-level selection in a hierarchy of commands, the initial bezel tap being followed by either two screen taps or a screen slide. The data suggests that Bezel-Tap Gestures may serve to design large vocabularies of micro-interactions with a sleeping tablet.",
  "tags": [
    "micro-interaction",
    "marking menus",
    "mobile devices",
    "interaction techniques",
    "bezel gestures",
    "accelerometers"
  ],
  "authors": [
    {
      "name": "Marcos Serrano",
      "institution": "Telecom ParisTech, Paris, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Eric Lecolinet",
      "institution": "Telecom ParisTech, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390376",
      "orcid": "0000-0001-8114-1160"
    },
    {
      "name": "Yves Guiard",
      "institution": "Telecom ParisTech, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143867",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ADXL335 Accelerometer, Analog Devices. http://www.analog.com/",
      "doi": ""
    },
    {
      "text": "Arduino Nano board. http://arduino.cc/en/Main/ArduinoBoardNano",
      "doi": ""
    },
    {
      "text": "Ashbrook, D. Enabling mobile microinteractions. PhD Thesis, Georgia Institute of Technology (2009). ",
      "doi": "10.5555/1970601"
    },
    {
      "text": "Asbrook, D., Baudisch, P., White, S. Nenya: Subtle and Eyes-Free Mobile Input with a Magnetically-Tracked Finger Ring. In Proc. of CHI 2011, ACM, 2043--2046.  ",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Baglioni, M., Lecolinet, E. and Guiard, Y. Jerktilts: Using accelerometers for eight-choice selection on mobile devices. In Proc. of ICMI 2011, ACM, 121--128.  ",
      "doi": "10.1145/2070481.2070503"
    },
    {
      "text": "Bragdon, A. et al. Experimental Analysis of Touch-Screen Gesture Designs in Mobile Environments. In Proc. of CHI 2011, ACM, 403--412.  ",
      "doi": "10.1145/1978942.1979000"
    },
    {
      "text": "Buxton, W. A three-state model of graphical input. In Proc. of Interact 1990, Elsevier, 449--456. ",
      "doi": "10.5555/647402.725582"
    },
    {
      "text": "Carroll, A. and Heiser, G. An analysis of power consumption in a smartphone. In Proc. of USENIXATC 2010, USENIX, 21--35. ",
      "doi": "10.5555/1855840.1855861"
    },
    {
      "text": "Consolvo, S. et al. Activity sensing in the wild: a field trial of ubifit garden. In Proc. of CHI 2008, ACM, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Control 4, Smart Home products. http://www.control4.com/",
      "doi": ""
    },
    {
      "text": "Francone J. et al. Wavelet Menus on Handheld Devices: Stacking Metaphor for Novice Mode & Eyes-Free Selection for Expert Mode. In Proc. of AVI 2010, ACM, 173--180.  ",
      "doi": "10.1145/1842993.1843025"
    },
    {
      "text": "Jain, M. and Balakrishnan, R. User Learning and Performance with Bezel Menus. In Proc. of CHI 2012, ACM, 2221--2230.  ",
      "doi": "10.1145/2207676.2208376"
    },
    {
      "text": "Harrison, C., Schwarz, J., Hudson, S. TapSense: Enhancing Finger Interaction on Touch Surfaces. In Proc. of UIST 2011, ACM, 627--634.  ",
      "doi": "10.1145/2047196.2047279"
    },
    {
      "text": "Heo, S., Lee, G. ForceTap: Extending the Input Vocabulary of Mobile Touch Screens by adding Tap Gestures. In Proc. of MobileHCI 2011, ACM, 113--122.  ",
      "doi": "10.1145/2037373.2037393"
    },
    {
      "text": "Hinckley, K. et al. Sensing techniques for mobile interaction. In Proc. of UIST 2000, ACM, 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Hinckley, K. et al. Design and Analysis of Delimiters for Selection-Action Pen Input Phrases in Scriboli. In Proc. of CHI 2005, ACM, 451--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Hinckley, K., Yatani, K. Radial Menus With Bezel Gestures. Publication date: 08/25/2011. Patent publication number 20110209093.",
      "doi": ""
    },
    {
      "text": "Hudson, S. et al. Whack Gestures: Inexact and Inattentive Interaction with Mobile Devices. In Proc. of TEI 2010, ACM, 109--112.  ",
      "doi": "10.1145/1709886.1709906"
    },
    {
      "text": "Identity Fraud Report. Javelin Strategy (2012).",
      "doi": ""
    },
    {
      "text": "Kane, S. et al. Usable gestures for blind people: understanding preference and performance. In Proc. of CHI 2011, ACM, 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Kin, K., Hartmann, B., Agrawala, M. Two-handed marking menus for multitouch devices. ACM Trans. Comput.-Hum. Interact. 18(3): 16 (2011)  ",
      "doi": "10.1145/1993060.1993066"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. 1991. Issues in combining marking and direct manipulation techniques. In Proc. of UIST 1991, ACM, 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Li, F., Guy, R., Yatani, K., Truong, K. The 1Line Keyboard: A QWERTY Layout in a Single Line. In Proc. of UIST 2011, ACM, 461--470.  ",
      "doi": "10.1145/2047196.2047257"
    },
    {
      "text": "LIS3DH 3-axis accelerometer, STMicroelectronics. http://www.st.com/internet/analog/product/250725.jsp",
      "doi": ""
    },
    {
      "text": "Lu, H. et al. The jigsaw continuous sensing engine for mobile phone applications. In Proc. of SenSys 2010, ACM, 71--84.  ",
      "doi": "10.1145/1869983.1869992"
    },
    {
      "text": "Olwal, A., Feiner, S., Heyman, S. (2008). Rubbing and Tapping for precise and rapid selection on touch-screen displays. In Proc. of CHI 2008, ACM, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Raikonen, S. et al. Tap Input as an Embedded Interaction Method for Mobile Devices. In Proc. of TEI 2007, ACM, 263--270.  ",
      "doi": "10.1145/1226969.1227023"
    },
    {
      "text": "Roth, V., Turner, T. Bezel Swipe: Conflict-Free Scrolling and multiple selection on mobile screen devices. In Proc. of CHI 2009, ACM, 1523--1526.  ",
      "doi": "10.1145/1518701.1518933"
    },
    {
      "text": "Roudaut, A., Lecolinet, E. and Guiard, Y. Microrolls: Expanding Touch-Screen Input Vocabulary by Distinguishing Rolls vs. Slides of the Thumb. In Proc. of CHI 2009, ACM, 927--936.  ",
      "doi": "10.1145/1518701.1518843"
    },
    {
      "text": "Ruiz, J. and Li, Y. Doubleflip: a motion gesture delimiter for mobile interaction. In Proc. of CHI 2011, ACM, 2717--2720.  ",
      "doi": "10.1145/1978942.1979341"
    },
    {
      "text": "Shin, C., Hong, J-H., and Dey, A. Understanding and prediction of mobile application usage for smart phones. In Proc. of UbiComp 2012, ACM, 173--182.  ",
      "doi": "10.1145/2370216.2370243"
    },
    {
      "text": "Tsekelves, E. et al. Interacting with Digital Media at Home via a Second Screen. In Ninth IEEE International Symposium on Multimedia Workshops (2007).  ",
      "doi": "10.5555/1337690.1338313"
    },
    {
      "text": "Understanding Tablet Device Users. AdMob/Google, US (March 2011).",
      "doi": ""
    },
    {
      "text": "Wagner, J., Huot, S., Mackay, W. BiTouch and BiPad: Designing Bimanual Interaction for Hand-held Tablets. In Proc. of CHI 2012, ACM, 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    }
  ]
}