{
  "doi": "10.1145/2470654.2466147",
  "title": "NoteVideo: facilitating navigation of blackboard-style lecture videos",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1139-1148",
  "year": 2013,
  "badges": [],
  "abstract": "Khan Academy's pre-recorded blackboard-style lecture videos attract millions of online users every month. However, current video navigation tools do not adequately support the kinds of goals that students typically have, like quickly finding a particular concept in a blackboard-style lecture video. This paper reports on the development and evaluation of the new NoteVideo and its improved version, NoteVideo+, systems for identifying the conceptual 'objects' of a blackboard-based video - and then creating a summarized image of the video and using it as an in-scene navigation interface that allows users to directly jump to the video frame where that object first appeared instead of navigating it linearly through time. The research consisted of iteratively implementing the system and then having users perform four different navigation tasks using three different interfaces: Scrubbing, Transcript, and NoteVideo. Results of the study show that participants perform significantly better on all four tasks while using the NoteVideo and its improved version - NoteVideo+ - as compared to others.",
  "tags": [
    "video summary",
    "online streaming",
    "blackboard-style videos",
    "notevideo",
    "notevideo+",
    "video navigation",
    "video"
  ],
  "authors": [
    {
      "name": "Toni-Jan Keith Palma Monserrat",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81502805566/rel-imgonly/312406_10150831276040553_325869411_n.jpg",
      "acmid": "81502805566",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    },
    {
      "name": "Kevin McGee",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100073786",
      "orcid": "missing"
    },
    {
      "name": "Anshul Vikram Pandey",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550925956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arman, F., Depommier, R., Hsu, A., and Chiu, M., Content-based browsing of video sequences, in Proc. MULTIMEDIA '94, (1994), 97--103.  ",
      "doi": "10.1145/192593.192630"
    },
    {
      "text": "Deng, Y., and Manjunath, B. S., Content-based search of video using color, texture, and motion, in Proc. Image Processing '97, (1997). 534--537.",
      "doi": ""
    },
    {
      "text": "Divakaran, A., Forlines, C., Lanning, T., Shipman, S., and Wittenburg, K., Augmenting fast-forward and rewind for personal digital video recorders, in Proc. ICCE '05, (2005). 43--44.",
      "doi": ""
    },
    {
      "text": "Dragicevic, P., Ramos, G., Bibliowitcz, J., Nowrouzezahrai, D., Balakrishnan, R., and Singh, K. Video Browsing by Direct Manipulation, in Proc. CHI '08, (2008). 237--246.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Flipping the classroom: Hopes that the internet can improve teaching may at last be bearing fruit. http://www.economist.com/node/21529062.",
      "doi": ""
    },
    {
      "text": "Goldman, D. B., Gonterman, C., Curless, B., Salesin, D. and Seitz, S. M. Video Object Annotation, Navigation, and Composition, in Proc. UIST '08, (2008). 3--12.  ",
      "doi": "10.1145/1449715.1449719"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. Chronicle: capture, exploration, and playback of document workflow histories, in Proc. UIST '10 (2010). 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Hopfgartner, F., Urruty T., Hannah D., Elliott D., Jose J. M. Aspect-based video browsing - a user study, in Proc. ICME'09, (2009). 946--949. ",
      "doi": "10.5555/1698924.1699156"
    },
    {
      "text": "Hurst, W., and Jarvers, P. Interactive, Dynamic Video Browsing with the ZoomSlider Interface, in Proc. ICME '05, (2005). 558--561.",
      "doi": ""
    },
    {
      "text": "Jansen, M., Heeren, W., and Dijk, B. V. Videotrees: Improving video surrogate presentation using hierarchy, in Proc, CBMI '08, (2008). 560--567.",
      "doi": ""
    },
    {
      "text": "Karrer, T., M. Weiss, Lee, E., Borchers, J. DRAGON: A Direct Manipulation Interface for Frame-Accurate In-Scene Video Navigation, in Proc. CHI '08 (2008). 247--250.  ",
      "doi": "10.1145/1357054.1357097"
    },
    {
      "text": "Kimber, D., Dunnigan, A., Girgensohn, A., Shipman, F., Turner, T., TaoYang. Trailblazing: Video Playback Control by Direct Object Manipulation, in Proc. ICME '07, (2007). 675--678.",
      "doi": ""
    },
    {
      "text": "Li, F., Gupta, A., Sanocki, E., He, L., and Rui, Y. Browsing digital video, in Proc. CHI '00, (2000). 169--176.  ",
      "doi": "10.1145/332040.332425"
    },
    {
      "text": "Liu, J., He, Y., and Peng, M. NewsBR: a content-based news video browsing and retrieval system, in Proc. ICCIT '04, (2004). 857--862. ",
      "doi": "10.5555/1025116.1025410"
    },
    {
      "text": "Matejka, J., Grossman, T., and Fitzmaurice, G., Swift: reducing the effects of latency in online video scrubbing, in Proc. CHI '12, (2012). 637--646.  ",
      "doi": "10.1145/2207676.2207766"
    },
    {
      "text": "Moraveji, N. Improving video browsing with an eyetracking evaluation of feature-based color bars, in Proc. JCDL '04, (2004). 49--50.  ",
      "doi": "10.1145/996350.996363"
    },
    {
      "text": "Mynatt, E. D., Igarashi, T., Edwards, W. K., and LaMarca, A. Flatland: new dimensions in office whiteboards. in Proc. CHI '99 (1999). 346--353.  ",
      "doi": "10.1145/302979.303108"
    },
    {
      "text": "Nguyen, C., Niu, Y., and Liu, F., Video summagator: an interface for video summarization and navigation, in Proc. CHI '12, (2012). 647--650.  ",
      "doi": "10.1145/2207676.2207767"
    },
    {
      "text": "Schoeffmann, K., Hopfgartner, F., Marques O., Boeszoermenyi L., and Jose J. M., Video browsing interfaces and applications: a review, in SPIE Reviews, Vol. 1, No. 1, (2010). 1--35.",
      "doi": ""
    },
    {
      "text": "Snoek, C. G. M., Worring M., Koelma D. C., and Smeulders A. W. M., A learned lexicon-driven paradigm for interactive video retrieval, IEEE Trans. Multimedia 9, (2007). 280--292.  ",
      "doi": "10.1109/TMM.2006.886275"
    },
    {
      "text": "Szummer, M., and Picard, R. W., Indoor-outdoor image classification. In Proc. CAIVD '98, (1998). 42--51. ",
      "doi": "10.5555/791220.791680"
    },
    {
      "text": "Tang, X., Gao, X., and Wong, C., NewsEye: a news video browsing and retrieval system, in Proc. IMVSP '01 (2001). 150--153.",
      "doi": ""
    },
    {
      "text": "Teodosio, L. and Bender, W., Salient stills, TOMCCAP '05, (2005) 16--36.  ",
      "doi": "10.1145/1047936.1047940"
    },
    {
      "text": "Thompson, C., How Khan Academy Is Changing the Rules of Education. http://www.wired.com/magazine/2011/07/ff_khan/all/1.",
      "doi": ""
    },
    {
      "text": "Tse, T., Marchionini, G., Ding, W., Slaughter, L., and Komlodi, A., Dynamic key frame presentation techniques for augmenting video browsing, in Proc, AVI '98: (1998) 185--194.  ",
      "doi": "10.1145/948496.948522"
    },
    {
      "text": "Vailaya, A., Fiqueiredo, M. A. T., Jain, A. K., and Zhang, H.-J., Image classification for content-based indexing, in Proc. Image Processing '01, (2001). 117--130.  ",
      "doi": "10.1109/83.892448"
    },
    {
      "text": "Villa, R., Gildea, N., Jose, J.. FacetBrowser: a user interface for complex search tasks, in Proc. MULTIMEDIA 2008. (2008) 489--498.  ",
      "doi": "10.1145/1459359.1459424"
    }
  ]
}