{
  "doi": "10.1145/2470654.2481349",
  "title": "Envisioning across generations: a multi-lifespan information system for international justice in rwanda",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2527-2536",
  "year": 2013,
  "badges": [],
  "abstract": "With this research we investigate how to account for multi-generational perspectives in the design of multi-lifespan information systems, particularly in support of long-term peace-building and international justice. We do our work in the context of the publicly available Voices from the Rwanda Tribunal testbed, a historically significant collection of video interviews with personnel from the International Criminal Tribunal for Rwanda. In the research reported here, we worked with 109 Rwandan adults and youth from perpetrator and survivor communities in three provincial cities in Rwanda (Byumba, Kibuye, and Gisenyi) to understand the potentials and challenges they envision for the interview collection. Participants envisioned five categories of long-term positive outcomes for individuals and society from a multi-lifespan information system for the interview collection; and eight categories of challenges to realize those potential outcomes. In terms of multi-generational perspectives, while adults and youth tended to share an overall vision for the long-term potential of such a system, adults emphasized actionable tasks while youth educational benefits. Based on the findings, we highlight issues for appropriation of multi-lifespan information systems and reflect on our methods for eliciting multi-generational perspectives on information system design in a post-conflict society.",
  "authors": [
    {
      "name": "Daisy Yoo",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556772856",
      "orcid": "missing"
    },
    {
      "name": "Milli Lake",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646355",
      "orcid": "missing"
    },
    {
      "name": "Trond Nilsen",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100421555",
      "orcid": "missing"
    },
    {
      "name": "Molly E. Utter",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558423756",
      "orcid": "missing"
    },
    {
      "name": "Robert Alsdorf",
      "institution": "unaffiliated, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557525556",
      "orcid": "missing"
    },
    {
      "name": "Theoneste Bizimana",
      "institution": "Healing and Rebuilding our Communities, Gisenyi, Rwanda",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556304256",
      "orcid": "missing"
    },
    {
      "name": "Lisa P. Nathan",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/do/10.1145/contrib-81350569925/rel-imgonly/lisanathanportraits-4copy.png",
      "acmid": "81350569925",
      "orcid": "missing"
    },
    {
      "name": "Mark Ring",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658671532",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth J. Utter",
      "institution": "unaffiliated, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657119",
      "orcid": "missing"
    },
    {
      "name": "Robert F. Utter",
      "institution": "unaffiliated, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460644817",
      "orcid": "missing"
    },
    {
      "name": "Batya Friedman",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636215",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bidwell, N. J. and Winschiers-Theophius, H. Beyond the Benjamins: Toward an African interaction design. interactions 17, 1 (2010), 32--35.  ",
      "doi": "10.1145/1649475.1649483"
    },
    {
      "text": "Birnholtz, J. & Jones-Rounds, M. Independence and interaction: Understanding seniors' privacy and awareness needs for aging in place. In Proc. CHI 2010, ACM Press (2010), 143--152.  ",
      "doi": "10.1145/1753326.1753349"
    },
    {
      "text": "Churchill, E. and Ubois, J. Designing for digital archives. interactions 15, 2 (2008), 10--13.  ",
      "doi": "10.1145/1340961.1340964"
    },
    {
      "text": "Des Forges, A. Leave None to Tell the Story. Human Rights Watch, New York, NY, 1999.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C. Design, democracy, and agonistic pluralism. In Proc. Design Research Society Conference 2010, Montreal.",
      "doi": ""
    },
    {
      "text": "Friedman, B., and Nathan, L. P. Multi-lifespan information system design: A research initiative for the HCI community. In Proc. CHI 2010, ACM Press (2010), 2243--2246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Friedman, B., Nathan, L. P., Kane, S., and Lin, J. Envisioning Cards. University of Washington, Seattle, WA, USA, 2011. Available at: envisioningcards.com",
      "doi": ""
    },
    {
      "text": "Judge, T. K., Neustaedter, C., and Kurtz, A. F. The family window: The Design and evaluation of a domestic media space. In Proc. CHI 2010, ACM Press (2010), 2361--2370.  ",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Kensing, F., & Madsen, K. H. Generating visions: Future workshops and metaphorical design. In J. Greenbaum and M. Kyng (Eds.), Design at Work: Cooperative Design of Computer Systems. Lawrence Erlbaum, 1991, 155--168. ",
      "doi": "10.5555/125470.125433"
    },
    {
      "text": "Liu, B. S. The living heritage of historic crises: curating the Bhopal disaster in the social media landscape. interactions 19, 3, (2012), 20--24.  ",
      "doi": "10.1145/2168931.2168938"
    },
    {
      "text": "Marsden, G. Toward empowered design. Computer 41, 6 (2008), 42--46.  ",
      "doi": "10.1109/MC.2008.207"
    },
    {
      "text": "Mynatt, E. D., Rowan, J., Craighill, S. and Jacobs, A. Digital family portraits: Providing peace of mind for extended family members. In Proc. CHI 2001, ACM Press (2001), 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Nathan, L. P., Grey, N. C., Lake, M., Nilsen, T., Utter, E., Utter, R. F., Ring, M., Kahn, Z., and Friedman, B. Multilifespan information system design: Investigating a new design approach in Rwanda. In Proc. iConference 2011, ACM Press (2011), 591--597.  ",
      "doi": "10.1145/1940761.1940841"
    },
    {
      "text": "Nathan, L. P., and Friedman, B. Interacting with policy in a political world: Reflections from the Voices of the Rwanda Tribunal project. interactions, 17, 5 (2010), 56--59.  ",
      "doi": "10.1145/1836216.1836231"
    },
    {
      "text": "Reyntjens, F. Constructing the truth, dealing with dissent, domesticating the world: Governance in post-genocide Rwanda. African Affairs 110, 438 (2010), 1--34.",
      "doi": ""
    },
    {
      "text": "Smyth, T., Etherton, J., and Best, M. L. MOSES: Exploring new ground in media and post-conflict reconciliation. In Proc. CHI 2010, ACM Press (2010), 1059--1068.  ",
      "doi": "10.1145/1753326.1753484"
    },
    {
      "text": "Uvin, P. Ethnicity and power in Burundi and Rwanda: Different paths to mass violence. Comparative Politics 31, 3 (1999), 253--271.",
      "doi": ""
    },
    {
      "text": "Voices from the Rwanda Tribunal. Available at http://www.tribunalvoices.or",
      "doi": ""
    }
  ]
}