{
  "doi": "10.1145/2470654.2466138",
  "title": "The dynamics of younger and older adult's paired behavior when playing an interactive silhouette game",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1081-1090",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper, we report on the findings of an acute trial in which we evaluate the design of a novel gesture-based game. 60 younger and older players, divided into three separate group-types: (i) Young-Young, (ii) Old-Old, and (iii) Young-Old, took part in the study. The primary aim of this work was to evaluate the communicative and cooperative behavior of same-age and mixed-age pairs, with secondary interests in their perceived ease-of-use of the game. A mixed-method approach was used, comprising of direct observations, a post-game questionnaire and paired interviews. Our results identified noticeable differences between the group-types, with the Young-Old showing more physical cooperation, as compared to the same-age groups. The work elaborates on how the young and old differ in expectations and perceived interaction, and concludes with some recommendations for future research.",
  "authors": [
    {
      "name": "Mark Rice",
      "institution": "Institute for Infocomm Research, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496826",
      "orcid": "missing"
    },
    {
      "name": "Wah Pheow Tan",
      "institution": "Temasek Polytechnic, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557983556",
      "orcid": "missing"
    },
    {
      "name": "Jeremy Ong",
      "institution": "Institute for Infocomm Research & Temasek Polytechnic, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502745697",
      "orcid": "missing"
    },
    {
      "name": "Lih Jie Yau",
      "institution": "Institute for Infocomm Research & Temasek Polytechnic, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502767994",
      "orcid": "missing"
    },
    {
      "name": "Marcus Wan",
      "institution": "Institute for Infocomm Research, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487641817",
      "orcid": "missing"
    },
    {
      "name": "Jamie Ng",
      "institution": "Institute for Infocomm Research, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452618616",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Al Mahmud, A., Mubin, O., Shahid, S., and Martens, J.-B. Designing social games for children and older adults: Two related case studies. Entertainment Computing 1, 3-4 (2010), 147--156.",
      "doi": ""
    },
    {
      "text": "Alankus, G., Lazar, A., May, M., and Kelleher, C. Towards customizable games for stroke rehabilitation. In Proc. CHI '10, ACM Press (2010), 2113--2122.  ",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "Boon, S. D., and Brussoni, M. J. Popular images of grandparents: Examining young adults' views of their closest grandparents. Personal Relationships 5, 1 (1998), 105--119.",
      "doi": ""
    },
    {
      "text": "Chiong, C. Can video games promote intergenerational play and literacy learning? The Joan Ganz Cooney Center at Sesame Workshop, 2009.",
      "doi": ""
    },
    {
      "text": "Derboven, J., Van Gils, M., and De Grooff, D. Designing for collaboration: A study in intergenerational social game design. Universal Access in the Information Society 11, 1 (2012), 57--65.  ",
      "doi": "10.1007/s10209-011-0233-0"
    },
    {
      "text": "Gajadhar, B. J., Nap, H. H., de Kort, Y. A. W., and IJsselsteijn, W. A. Out of sight, out of mind: Co-player effects on seniors' player experience. In Proc. Fun & Games'10, ACM Press (2010), 74--83.  ",
      "doi": "10.1145/1823818.1823826"
    },
    {
      "text": "Gerling, K. M., Livingston, I. J., Nacke, L. E., and Mandryk, R. L. Full-body motion-based game interaction for older adults. In Proc. CHI '12, ACM Press (2012), 1873--1882.  ",
      "doi": "10.1145/2207676.2208324"
    },
    {
      "text": "Graves, D. Supporting learners in a remote computer-supported collaborative learning environment: The importance of task and communication. M.Sc. thesis. The University of British Columbia, 1997.",
      "doi": ""
    },
    {
      "text": "IJsselsteijn, W. A., de Kort, Y. A. W., and Poels, K. Game experience questionnaire. Eindhoven University of Technology, n.d.",
      "doi": ""
    },
    {
      "text": "Khoo, E. T., Merritt, T., and Cheok, A. D. Designing physical and social intergenerational family entertainment. Interacting with Computers 21, 1--2 (2009), 76--87.  ",
      "doi": "10.1016/j.intcom.2008.10.009"
    },
    {
      "text": "Kramer, A. F., Larish, J. F., and Strayer, D. L. Training for attentional control in dual task settings: A comparison of young and old adults. Journal of Experimental Psychology: Applied 1, 1 (1995), 50--76.",
      "doi": ""
    },
    {
      "text": "Krueger, M. W., Gionfriddo, T., and Hinrichsen, K. VIDEOPLACE - an artificial reality. In Proc. CHI '85, ACM Press (1985), 35--40.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Lloyd, J. The state of intergenerational relations today. ILC-UK, 2008.",
      "doi": ""
    },
    {
      "text": "Mancini, J. A., and Sandifer, D. M. Family dynamics and the leisure experiences of older adults: Theoretical viewpoints. In R. Blieszner and V. H. Bedford (Eds.), Aging and the Family: Theory and Research. Greenwood Publishing Group (1996), 132--147.",
      "doi": ""
    },
    {
      "text": "McCann, R. M., Cargile, A. C., Giles, H., and Bui, C. T. Communication ambivalence toward elders: Data from North Vietnam, South Vietnam, and the U.S.A. Journal of Cross-Cultural Gerontology 19, 4 (2004), 275--297.",
      "doi": ""
    },
    {
      "text": "Mead, S. E., Batsakes, P., Fisk, A. D., and Mykityshyn, A. Application of cognitive theory to training and design solutions for age-related computer use. International Journal of Behavioral Development 23, 3 (1999), 553--573.",
      "doi": ""
    },
    {
      "text": "Miwa, Y., Itai, S., Watanabe, T., and Nishi, H. Shadow awareness: Enhancing theater space through the mutual projection of images on a connective slit screen. Leonardo 44, 4 (2011), 325--333.  ",
      "doi": "10.1145/2019342.2019347"
    },
    {
      "text": "Nap, H. H., de Kort, Y. A. W., and IJsselsteijn, W. A. Senior gamers: Preferences, motivations and needs. Gerontechnology 8, 4 (2009), 247--262.",
      "doi": ""
    },
    {
      "text": "Okamoto, M., Nakanishi, H., Nishimura, T., and Ishida, T. Silhouettell: Awareness support for real-world encounter. Community Computing and Support Systems (1998), 316--329. ",
      "doi": "10.5555/646698.701371"
    },
    {
      "text": "Owen, A. M., Hampshire, A., Grahn, J. A., Stenton, R., Dajani, S., Burns, A. S., Howard, R. J., and Ballard, C. G. Putting brain training to the test. Nature 465, 7299 (2010), 775--778.",
      "doi": ""
    },
    {
      "text": "Rice, M., Wan, M., Foo, M.-H., Ng, J., Wai, Z., Kwok, J., Lee, S., and Teo, L. Evaluating gesture-based games with older adults on a large screen display. In Proc. ACM SIGGRAPH Symposium on Video Games '11, ACM Press (2011), 17--24.  ",
      "doi": "10.1145/2018556.2018560"
    },
    {
      "text": "Rice, M., Cheong, Y. L., Ng, J., Chua, P. H., and Theng, Y.-L. Cocreating games through intergenerational design workshops. In Proc. DIS '12, ACM Press (2012), 368--377.  ",
      "doi": "10.1145/2317956.2318012"
    },
    {
      "text": "Rice, M., Yau, L. J., Ong, J., Wan, M., and Ng, J. Intergenerational gameplay: Evaluating social interaction between younger and older players. Ext. Abstracts CHI '12, ACM Press (2012), 2333--2338.  ",
      "doi": "10.1145/2212776.2223798"
    },
    {
      "text": "Ross, N., Hill, M., Sweeting H., and Cunningham-Burley, S. Grandparents and teen grandchildren: Exploring intergenerational relationships. Report for the ESRC, Centre for Research on Families and Relationships, 2005.",
      "doi": ""
    },
    {
      "text": "Sanders, G. F., Montgomery, J. E., Pittman, Jr, J. F., and Balkwell, C. Youth's attitudes toward the elderly. Journal of Applied Gerontology 3, 1 (1984), 59--70.",
      "doi": ""
    },
    {
      "text": "Shoemaker, G., Tang, A., and Booth, K. S. Shadow reaching: A new perspective on interaction for large wall displays. In Proc. UIST '07, ACM Press (2007), 53--56.  ",
      "doi": "10.1145/1294211.1294221"
    },
    {
      "text": "Tang, J. C., and Minneman, S. L. VideoWhiteboard: Video shadows to support remote collaboration. In Proc. CHI '91, ACM Press (1991), 315--322.  ",
      "doi": "10.1145/108844.108932"
    },
    {
      "text": "Thang, L. L. Promoting intergenerational understanding between the young and old: The case of Singapore. UN Report of the Expert Group Meeting in Qatar, March 2011.",
      "doi": ""
    },
    {
      "text": "Vanden Abeele, V., and De Schutter, B. Designing intergenerational play via enactive interaction, competition and acceleration. Pers Ubiquit Comput 14, 5 (2010), 425--433.  ",
      "doi": "10.1007/s00779-009-0262-3"
    },
    {
      "text": "Voida, A., and Greenberg, S. Console gaming across generations: Exploring intergenerational interactions in collocated console gaming. Universal Access in the Information Society 11, 1 (2012), 45--56.  ",
      "doi": "10.1007/s10209-011-0232-1"
    },
    {
      "text": "World Health Organization. Global recommendations on physical activity for health. WHO, 2010.",
      "doi": ""
    },
    {
      "text": "Yoder, P., and Symons, F. Observational measurement of behavior. Springer Publishing Company, 2010.",
      "doi": ""
    }
  ]
}