{
  "doi": "10.1145/2470654.2481396",
  "title": "Mobiles, music, and materiality",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2863-2872",
  "year": 2013,
  "badges": [],
  "abstract": "Building on recent HCI contributions that assert the materiality of digital information, we examine the material nature of digital media and information technology in the context of mobile music production, reproduction, and reception in rural and semi-urban India. We use ethnographic methods to study the recent adoption and use of mobile technology and discuss our findings in relation to the evolving materiality of music. We also investigate the sociotechnical configurations that emerge as a consequence of this materiality. Thus we contribute to HCI research by showing how the material representations of digital media affect the interactions of humans with technology.",
  "authors": [
    {
      "name": "Neha Kumar",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    },
    {
      "name": "Tapan S. Parikh",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81100298867/rel-imgonly/tapan_parikh_lg_1.jpg",
      "acmid": "81100298867",
      "orcid": "0000-0003-2634-6395"
    }
  ],
  "references": [
    {
      "text": "Blanchette, J. F. 2011. A material history of bits. Journal of the American Society for Information Science and Technology, 62(6), 1024--1057.  ",
      "doi": "10.1002/asi.21542"
    },
    {
      "text": "Dourish, P. and Mazmanian. M. Media as Material: Information Representations as Material Foundations for Organizational Practice. Working Paper for the Third International Symposium on Process Organization Studies Corfu, Greece, June 2011.",
      "doi": ""
    },
    {
      "text": "Burrell, J. 2013. The Materiality of Rumor. In Materiality and Organizing: Social Interaction in a Technological World, Eds. Paul Leonardi, Bonnie Nardi, and Jannis Kallinikos. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Magaudda, P. 2011. When materiality 'bites back'. Digital music consumption practices in the age of dematerialization. Journal of Consumer Culture, 11(1).",
      "doi": ""
    },
    {
      "text": "Sundström, P., Taylor, A., Grufberg, K., Wirstrom, N., Solsona Belenguer, J. and Lunden, M. Inspirational Bits: Towards a shared understanding of the digital material. In Proc. CHI 2011.  ",
      "doi": "10.1145/1978942.1979170"
    },
    {
      "text": "Rosner, D. The Material Practices of Collaboration. In Proc. CSCW 2012.  ",
      "doi": "10.1145/2145204.2145375"
    },
    {
      "text": "Pierce, J. and Paulos, E. Materializing energy. In Proc. DIS 2010: 113--122.  ",
      "doi": "10.1145/1858171.1858193"
    },
    {
      "text": "Gaver, W. Technology Affordances. In Proc. CHI 1991.  ",
      "doi": "10.1145/108844.108856"
    },
    {
      "text": "Bull, M. 2000. Sounding Out the City: Personal Stereos and the Management of Everyday Life (Oxford: Berg).",
      "doi": ""
    },
    {
      "text": "Bull, M. 2005. No Dead Air! The iPod and the Culture of Mobile Listening, Leisure Studies, 24:4.",
      "doi": ""
    },
    {
      "text": "Oeldorf-Hirsch, A., Donner, J. and Cutrell, E. How bad is good enough? Exploring mobile video quality tradeoffs for bandwidth-constrained consumers. In Proc. NordiCHI 2012.  ",
      "doi": "10.1145/2399016.2399025"
    },
    {
      "text": "Norman, D. A. (1990). The design of everyday things. New York: Doubleday.",
      "doi": ""
    },
    {
      "text": "Rural India to Drive Mobile Phone Market Growth http://www.thehindu.com/business/Industry/article1118628.ece?homepage=true",
      "doi": ""
    },
    {
      "text": "Smyth, T., Kumar, S., Medhi, I. and Toyama, K. Where There's a Will There's a Way: Mobile Media Sharing in Urban India. In Proc. CHI 2010.  ",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Kumar, N., Singh, G. and Parikh, T.S. Folk Music goes Digital in India. In Proc. CHI 2011.  ",
      "doi": "10.1145/1978942.1979151"
    },
    {
      "text": "Donner, J. Blurring livelihoods and lives: The social uses of mobile phones and socioeconomic development. (2009). Innovations: Technology, Governance, Globalization, vol. 4, no. 1, pp. 91--101, MIT Press.",
      "doi": ""
    },
    {
      "text": "Rangaswamy, N. and Nair, S. The Mobile Phone Store Ecology in a Mumbai Slum Community: Hybrid Networks for Enterprise. In Proc. ITID 2010.",
      "doi": ""
    },
    {
      "text": "Sey, A. 'We use it different, different': Making sense of trends in mobile phone use in Ghana. New Media & Society (2011).",
      "doi": ""
    },
    {
      "text": "Glaser, B. and Strauss, A. 1967. The Discovery of Grounded Theory: Strategies for Qualitative Research.",
      "doi": ""
    },
    {
      "text": "Sundaram, R. 2010. Pirate Modernity: Delhi's Media Urbanism. Routledge.",
      "doi": ""
    },
    {
      "text": "Census of India 2001. http://www.censusindia.gov.in",
      "doi": ""
    },
    {
      "text": "Manuel, P. 1993. Cassette Culture: Popular Music and Technology in North India. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Benjamin, W. 1968. 'The Work of Art in the Age of Mechanical Reproduction', in Illuminations, ed. and tr. Hannah Arendt, Fontana, London.",
      "doi": ""
    }
  ]
}