{
  "doi": "10.1145/2470654.2466196",
  "title": "SimMed: combining simulation and interactive tabletops for medical education",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1469-1478",
  "year": 2013,
  "badges": [],
  "abstract": "A large body of work asserts that interactive tabletops are well suited for group work, and numerous studies have examined these devices in educational contexts. However, few of the described systems support simulations for collaborative learning, and none of them explicitly address immersion. We present SimMed, a system allowing medical students to collaboratively diagnose and treat a virtual patient using an interactive tabletop. The hybrid user interface combines elements of virtual reality with multitouch input. The paper delineates the development process of the system and rationale behind a range of interface design decisions. Thereby, the role of realism in gaining procedural knowledge is discussed - in particular, the interplay between realism, immersion and training goals. We implemented several medical test cases and evaluated our approach with a user study that suggests the great potential of the system. Results show a high level of immersion, cooperation and engagement by the students.",
  "tags": [
    "medicine",
    "tabletop",
    "interactive surfaces",
    "multitouch",
    "collaboration",
    "learning",
    "procedural knowledge",
    "education"
  ],
  "authors": [
    {
      "name": "Ulrich von Zadow",
      "institution": "Archimedes Exhibitions GmbH, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479663154",
      "orcid": "missing"
    },
    {
      "name": "Sandra Buron",
      "institution": "Charité-Universitätsmedizin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479661417",
      "orcid": "missing"
    },
    {
      "name": "Tina Harms",
      "institution": "Charité-Universitätsmedizin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558384056",
      "orcid": "missing"
    },
    {
      "name": "Florian Behringer",
      "institution": "Charité-Universitätsmedizin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558343856",
      "orcid": "missing"
    },
    {
      "name": "Kai Sostmann",
      "institution": "Charité-Universitätsmedizin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479660320",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Antle, A. N., Bevans, A., Tanenbaum, J., Seaborn, K., and Wang, S. Futura: design for collaborative learning and game play on a multi-touch digital tabletop. In Proc. TEI 2011, ACM (2011), 93--100.  ",
      "doi": "10.1145/1935701.1935721"
    },
    {
      "text": "Barrows, H. Problem-based learning in medicine and beyond: A brief overview. New directions for teaching and learning 68 (1996), 3--12.",
      "doi": ""
    },
    {
      "text": "Bloom, B., Ed. Taxonomy of educational objectives. Longmans, 1956.",
      "doi": ""
    },
    {
      "text": "Cook, D., Erwin, P., and Triola, M. Computerized virtual patients in health professions education: A systematic review and meta-analysis. Academic Medicine 85, 10 (Oct. 2010), 1589--1602.",
      "doi": ""
    },
    {
      "text": "Cooper, J., and Taqueti, V. A brief history of the development of mannequin simulators for clinical education and training. Quality and Safety in Health Care 13, Suppl 1 (Oct. 2004), i2--i10.",
      "doi": ""
    },
    {
      "text": "Dieckmann, P. Using Simulations for Education, Training and Research. Pabst, 2009.",
      "doi": ""
    },
    {
      "text": "Fleck, R., Rogers, Y., Yuill, N., Marshall, P., Carr, A., Rick, J., and Bonnett, V. Actions speak loudly with words: unpacking collaboration around the table. In Proc. ITS 2009, ACM (2009), 189--196.  ",
      "doi": "10.1145/1731903.1731939"
    },
    {
      "text": "Gaba, D. The future vision of simulation in health care. Quality and Safety in Health Care 13, Suppl 1 (Oct. 2004), i2--i10.",
      "doi": ""
    },
    {
      "text": "Hall, E. T. The Hidden Dimension. Doubleday, 1966.",
      "doi": ""
    },
    {
      "text": "Harris, A., Rick, J., Bonnett, V., Yuill, N., Fleck, R., Marshall, P., and Rogers, Y. Around the table: are multiple-touch surfaces better than single-touch for children's collaborative interactions? In Proc. CSCL 2009, International Society of the Learning Sciences (2009), 335--344. ",
      "doi": "10.5555/1600053.1600104"
    },
    {
      "text": "Heinrichs, W., Youngblood, P., Harter, P., and Dev, P. Simulation for team training and assessment: Case studies of online training with virtual worlds. World Journal of Surgery 32, 2 (Feb. 2008), 161--170.",
      "doi": ""
    },
    {
      "text": "Horn, M., Atrash Leong, Z., Block, F., Diamond, J., Evans, E. M., Phillips, B., and Shen, C. Of bats and apes: an interactive tabletop game for natural history museums. In Proc. CHI 2012, ACM (2012), 2059--2068.  ",
      "doi": "10.1145/2207676.2208355"
    },
    {
      "text": "Kaschny, M., Buron, S., and Sostmann, K. Qualitaetssicherung einer interaktiven Lernumgebung mit Usability Tests (in German). In Jahrestagung der Gesellschaft für Medizinische Ausbildung (GMA), GMA '11, GMS (Düsseldorf, 2011), 36.",
      "doi": ""
    },
    {
      "text": "Kaschny, M., Buron, S., von Zadow, U., and Sostmann, K. Medical education on an interactive surface. In Proc. ITS 2010, ACM (2010), 267--268.  ",
      "doi": "10.1145/1936652.1936709"
    },
    {
      "text": "Kharrufa, A., Leat, D., and Olivier, P. Digital mysteries: designing for learning at the tabletop. In Proc. ITS 2010, ACM (2010), 197--206.  ",
      "doi": "10.1145/1936652.1936689"
    },
    {
      "text": "Koh, G., Khoo, H., Wong, M., and Koh, D. The effects of problem-based learning during medical school on physician competency: a systematic review. Canadian Medical Association Journal 178, 1 (Jan. 2004), 34--41.",
      "doi": ""
    },
    {
      "text": "LeFlore, J., Anderson, M., Zielke, M., Nelson, K., Thomas, P., Hardee, G., and John, L. Can a virtual patient trainer teach student nurses how to save lives - teaching nursing students about pediatric respiratory diseases. Simulation in Healthcare 7, 1 (Feb. 2012), 10--17.",
      "doi": ""
    },
    {
      "text": "Marshall, P., Fleck, R., Harris, A., Rick, J., Hornecker, E., Rogers, Y., Yuill, N., and Dalton, N. S. Fighting for control: children's embodied interactions when using physical and digital representations. In Proc. CHI 2009, ACM (2009), 2149--2152.  ",
      "doi": "10.1145/1518701.1519027"
    },
    {
      "text": "Morris, M. R., Ryall, K., Shen, C., Forlines, C., and Vernier, F. Beyond \"social protocols\": multi-user coordination policies for co-located groupware. In Proc. CSCW 2004, ACM (2004), 262--265.  ",
      "doi": "10.1145/1031607.1031648"
    },
    {
      "text": "Piper, A. M., and Hollan, J. D. Tabletop displays for small group study: affordances of paper and digital materials. In Proc. CHI 2009, ACM (2009), 1227--1236.  ",
      "doi": "10.1145/1518701.1518885"
    },
    {
      "text": "Rick, J., Marshall, P., and Yuill, N. Beyond one-size-fits-all: how interactive tabletops support collaborative learning. In Proc. IDC 2011, ACM (2011), 109--117.  ",
      "doi": "10.1145/1999030.1999043"
    },
    {
      "text": "Rogers, Y., and Lindley, S. Collaborating around large interactive displays: which way is best to meet? Interacting with Computers 16, 6 (Jan. 2004), 1133--1152.",
      "doi": ""
    },
    {
      "text": "Ryall, K., Forlines, C., Shen, C., and Morris, M. R. Exploring the effects of group size and table size on interactions with tabletop shared-display groupware. In Proc. CSCW 2004, ACM (2004), 284--293.  ",
      "doi": "10.1145/1031607.1031654"
    },
    {
      "text": "Schöning, J., Hook, J., Motamedi, N., Olivier, P., Echtler, F., Brandl, P., Muller, L., Daiber, F., Hilliges, O., Loechtefeld, M., Roth, T., Schmidt, D., and von Zadow, U. Building interactive multi-touch surfaces. Journal of Graphics, GPU, and Game Tools 14, 3 (2009), 35--55.",
      "doi": ""
    },
    {
      "text": "Scott, S. D., Carpendale, S., and Inkpen, M. Territoriality in collaborative tabletop workspaces. In Proc. CSCW 2004, ACM (2004), 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Scott, S. D., Grant, K. D., and Mandryk, R. L. System guidelines for co-located, collaborative work on a tabletop display. In Proc. ECSCW 2003, Kluwer Academic Publishers (2003), 159--178. ",
      "doi": "10.5555/1241889.1241898"
    },
    {
      "text": "Shaer, O., Strait, M., Valdes, C., Feng, T., Lintz, M., and Wang, H. Enhancing genomic learning through tabletop interaction. In Proc. CHI 2011, ACM (2011), 2817--2826.  ",
      "doi": "10.1145/1978942.1979361"
    }
  ]
}