{
  "doi": "10.1145/2470654.2470680",
  "title": "SpaceTop: integrating 2D and spatial 3D interactions in a see-through desktop environment",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "189-192",
  "year": 2013,
  "badges": [],
  "abstract": "SpaceTop is a concept that fuses spatial 2D and 3D interactions in a single workspace. It extends the traditional desktop interface with interaction technology and visualization techniques that enable seamless transitions between 2D and 3D manipulations. SpaceTop allows users to type, click, draw in 2D, and directly manipulate interface elements that float in the 3D space above the keyboard. It makes it possible to easily switch from one modality to another, or to simultaneously use two modalities with different hands. We introduce hardware and software configurations for co-locating these various interaction modalities in a unified workspace using depth cameras and a transparent display. We describe new interaction and visualization techniques that allow users to interact with 2D elements floating in 3D space. We present the results from a preliminary user study that indicates the benefit of such hybrid workspaces.",
  "tags": [
    "augmented reality",
    "3d ui",
    "desktop management"
  ],
  "authors": [
    {
      "name": "Jinha Lee",
      "institution": "Massachusettes Institute of Technology Media Laboratory, Cambridge, Massachusetts & Microsoft Applied Sciences Group, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646887",
      "orcid": "missing"
    },
    {
      "name": "Alex Olwal",
      "institution": "Massachusettes Institute of Technology Media Laboratory, Cambridge, Massachusetts, USA",
      "img": "/do/10.1145/contrib-81309497296/rel-imgonly/alex.png",
      "acmid": "81309497296",
      "orcid": "0000-0001-7772-0530"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusettes Institute of Technology Media Laboratory, Cambridge, Massachusetts, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    },
    {
      "name": "Cati Boulanger",
      "institution": "Microsoft Applied Sciences Group, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81452607629/rel-imgonly/17796743011_0506faa286_o.jpg",
      "acmid": "81452607629",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A., and Balakrishnan, R., 2006. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. CHI '06, 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Benko, H., and Feiner, S. 2006. Balloon selection: A multi-finger technique for accurate low-fatigue 3d selections. 3D UI '06, 79--86.",
      "doi": ""
    },
    {
      "text": "Benko, H., Ishak, E., and Feiner, S. 2005. Cross-dimensional gestural interaction techniques for hybrid immersive environments. VR ' 05, 209--216.  ",
      "doi": "10.1109/VR.2005.27"
    },
    {
      "text": "Hachet, M., Bossavit, B., Cohé, A., and Rivière, J., 2011. Toucheo: multitouch and stereo combined in a seamless workspace. UIST '11, 587--592.  ",
      "doi": "10.1145/2047196.2047273"
    },
    {
      "text": "Hilliges, O., Kim, D., Izadi, S., Weiss, M., and Wilson, A. 2012. HoloDesk: direct 3d interactions with a situated see-through display. CHI '12, 1283--1292.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Olwal, A., Lindfors, C., Gustafsson, J., Kjellberg, T., and Mattsson, L. 2005. ASTOR: An autostereoscopic optical see-through augmented reality system. ISMAR '05, 24--27.  ",
      "doi": "10.1109/ISMAR.2005.15"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D., and Dantzich, M. 1998. Data mountain: using spatial memory for document management. UIST '98, 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Schmandt, C. 1983. Spatial input/display correspondence in a stereoscopic computer graphic work station. SIGGRAPH '83, 253--261.  ",
      "doi": "10.1145/964967.801156"
    },
    {
      "text": "Treskunov, A., Kim, S. W., Marti, S. 2011. Range Camera for Simple behind Display Interaction. IAPR MVA '11, 160--163.",
      "doi": ""
    },
    {
      "text": "Wilson, A. Using a depth camera as a touch sensor. ITS '10, 69--72.  ",
      "doi": "10.1145/1936652.1936665"
    },
    {
      "text": "Wilson, A. 2006. Robust computer vision-based detection of pinching for one and two-handed gesture input. UIST '06, 255--258.  ",
      "doi": "10.1145/1166253.1166292"
    }
  ]
}