{
  "doi": "10.1145/2470654.2470693",
  "title": "Indirect shear force estimation for multi-point shear force operations",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "281-284",
  "year": 2013,
  "badges": [],
  "abstract": "The possibility of using shear forces is being explored recently as a method to enrich touch screen interaction. However, most of the related studies are restricted to the case of single-point shear forces, possibly owing to the difficulty of independently sensing shear forces at multiple touch points. In this paper, we propose indirect methods to estimate shear forces using the movement of contact areas. These methods enable multi-point shear force estimation, where the estimation is done for each finger independently. We show the feasibility of these methods through an informal user study with a demo application utilizing these methods.",
  "tags": [
    "multi-touch",
    "force sensing",
    "touch screen",
    "shear force"
  ],
  "authors": [
    {
      "name": "Seongkook Heo",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81484643096/rel-imgonly/81484643096.jpg",
      "acmid": "81484643096",
      "orcid": "0000-0003-2004-4812"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boring, S., Ledo, D., Chen, X., Marquardt, N., Tang, A., Greenberg, S. The Fat Thumb: Using the Thumb's Contact Size for Single-Handed Mobile Interaction. MobileHCI '12.  ",
      "doi": "10.1145/2371574.2371582"
    },
    {
      "text": "Davidson, P. L., Han, J. Y. Extending 2D object arrangement with pressure-sensitive layering cues. UIST '08.  ",
      "doi": "10.1145/1449715.1449730"
    },
    {
      "text": "Harrison, C., Hudson, S. Using Shear as a Supplemental Two-Dimensional Input Channel for Rich Touchscreen Interaction. CHI '12.  ",
      "doi": "10.1145/2207676.2208730"
    },
    {
      "text": "Heo, S., Lee, G. Force gestures: augmenting touch screen gestures with normal and tangential forces. UIST '11.  ",
      "doi": "10.1145/2047196.2047278"
    },
    {
      "text": "Heo, S., Lee, G. Forcetap: extending the input vocabulary of mobile touch screens by adding tap gestures. MobileHCI '11.  ",
      "doi": "10.1145/2037373.2037393"
    },
    {
      "text": "Herot, C., Weinzapfel, G. One-point touch input of vector information for computer displays. SIGGRAPH '78.  ",
      "doi": "10.1145/800248.807392"
    },
    {
      "text": "Hinckley, K., Song, H. Sensor synaesthesia: touch in motion, and motion in touch. CHI '11.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Holz, C., Baudisch, P. The generalized and perceived input point model and how to double touch accuracy by extracting fingerprints. CHI '10.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Kamiyama, K., Vlack K., Mizota, T., Kajimoto, H., Kawakami N., Tachi S. Vision-based sensor for real-time measuring of surface traction fields. Computer Graphics and Applications 25, 1, IEEE (2005), pp. 68--75.  ",
      "doi": "10.1109/MCG.2005.27"
    },
    {
      "text": "Lee, B., Lee, H., Lim, S., Lee, H., Han, S., Park, J. Evaluation of human tangential force input performance. CHI '12.  ",
      "doi": "10.1145/2207676.2208727"
    },
    {
      "text": "Minsky, M. Manipulating simulated objects with real-world gestures using a force and position sensitive screen. In Proc. 11th annual conference on Computer graphics and interactive techniques, 1984, pp. 195--203.  ",
      "doi": "10.1145/800031.808598"
    },
    {
      "text": "Miyaki, T., Rekimoto, J. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. MobileHCI '09.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Ramos, G., Boulos, M., Balakrishnan, R. Pressure widgets. CHI '04.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Ramos, G., Balakrishnan, R. Pressure marks. CHI '07.  ",
      "doi": "10.1145/1240624.1240834"
    },
    {
      "text": "Research In Motion™ , SurePress™ Technology http://us.blackberry.com/specifications/communication/surepress-touch-screen.html",
      "doi": ""
    },
    {
      "text": "Rosenberg, I., Perlin, K. The UnMousePad: an interpolating multi-touch force-sensing input pad. SIGGRAPH '09.  ",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "Roudaut, A., Lecolinet, E., Guiard, Y. MicroRolls: expanding touch-screen input vocabulary by distinguishing rolls vs. slides of the thumb. CHI '09.  ",
      "doi": "10.1145/1518701.1518843"
    },
    {
      "text": "Westerman, W., Hand tracking, finger identification, and chordic manipulation on a multi-touch surface. University of Delaware, 1999.",
      "doi": ""
    }
  ]
}