{
  "doi": "10.1145/2470654.2481361",
  "title": "FreeD: a freehand digital sculpting tool",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2613-2616",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper, we present an approach to combining digital fabrication and craft, emphasizing the user experience. While many researchers strive to enable makers to design and produce 3D objects, our research seeks to present a new fabrication approach to make unique, one-of-a-kind artifacts. To that end, we developed the FreeD, a hand-held digital milling device. The system is guided and monitored by a computer while preserving the maker's freedom to sculpt and carve, and to manipulate the work in many creative ways. Relying on a predesigned 3D model, the computer gets into action only when the milling bit risks the object's integrity, by slowing down the spindle's speed or by drawing back the shaft, while the rest of the time it allows complete gestural freedom. We describe the key concepts of our work and its motivation, present the FreeD's architecture and technology, and discuss two projects made with the tool.",
  "authors": [
    {
      "name": "Amit Zoran",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421593602",
      "orcid": "missing"
    },
    {
      "name": "Joseph A. Paradiso",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100099789",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bae, S.-H., Balakrishnan, R., Singh, K. 2009. EverybodyLovesSketch: 3D Sketching for a Broader Audience. In Proc. UIST'09, 59--68.  ",
      "doi": "10.1145/1622176.1622189"
    },
    {
      "text": "Barillot, C., Haynor, D. R., Hellier, P. 2004. Precision Freehand Sculpting of Bone. In Proc. MICCAI 2004.",
      "doi": ""
    },
    {
      "text": "Flagg, M., Rehg, J. M. 2006. Projector-guided painting. In Proc. UIST'06, 235--244.  ",
      "doi": "10.1145/1166253.1166290"
    },
    {
      "text": "Gershenfeld, N. 2005. FAB: The Coming Revolution on Your Desktop - From Personal Computers to Personal Fabrication. Basic Books. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Johnson, G., Gross, M., Do, E. Y.-L., and Hong, J. 2012. Sketch it, make it: sketching precise drawings for laser cutting. In Proc. CHI'12.  ",
      "doi": "10.1145/2212776.2212390"
    },
    {
      "text": "Lee, J. H. 2012. Haptic Intelligentsia. StudioHomunculus website, last accessed February 10, 2012. http://studio-homunculus.com/",
      "doi": ""
    },
    {
      "text": "McCullough, M. 1998. Abstracting Craft: The Practiced Digital Hand. The MIT Press. ",
      "doi": "10.5555/521472"
    },
    {
      "text": "Olwal, A., Gustafsson, J. & Lindfors, C. 2008. Spatial augmented reality on industrial CNC-machines. In Proc. SPIE 2008.",
      "doi": ""
    },
    {
      "text": "Rivers, A, Moyer I. E., Durand, F. 2012. Position-Correcting Tools for 2D Digital Fabrication. In Proc. SIGGRAPH'12.  ",
      "doi": "10.1145/2185520.2185584"
    },
    {
      "text": "Rosner, D. K. and A. S. Taylor. 2011. Antiquarian Answers: Book Restoration as a Resource for Design. In Proc. CHI'11.  ",
      "doi": "10.1145/1978942.1979332"
    },
    {
      "text": "Willis, K. D. D., Lin, J., Mitani, J., Igarashi, T. 2010. Spatial sketch: bridging between movement & fabrication. In Proc. TEI '10, 5--12.  ",
      "doi": "10.1145/1709886.1709890"
    },
    {
      "text": "Willis, K. D. D., Xu, C., Wu, K.-J., Levin, G., Gross D. M. 2011. Interactive fabrication: new interfaces for digital fabrication. In Proc. TEI'11, 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    }
  ]
}