{
  "doi": "10.1145/2470654.2466173",
  "title": "Panoinserts: mobile spatial teleconferencing",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1319-1328",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present PanoInserts: a novel teleconferencing system that uses smartphone cameras to create a surround representation of meeting places. We take a static panoramic image of a location into which we insert live videos from smartphones. We use a combination of marker- and image-based tracking to position the video inserts within the panorama, and transmit this representation to a remote viewer. We conduct a user study comparing our system with fully-panoramic video and conventional webcam video conferencing for two spatial reasoning tasks. Results indicate that our system performs comparably with fully-panoramic video, and better than webcam video conferencing in tasks that require an accurate surrounding representation of the remote space. We discuss the representational properties and usability of varying video presentations, exploring how they are perceived and how they influence users when performing spatial reasoning tasks.",
  "authors": [
    {
      "name": "Fabrizio Pece",
      "institution": "University College London, London, UK",
      "img": "/do/10.1145/contrib-81479664130/rel-imgonly/profile_pic.jpg",
      "acmid": "81479664130",
      "orcid": "missing"
    },
    {
      "name": "William Steptoe",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435602598",
      "orcid": "missing"
    },
    {
      "name": "Fabian Wanner",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550216056",
      "orcid": "missing"
    },
    {
      "name": "Simon Julier",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100149082",
      "orcid": "missing"
    },
    {
      "name": "Tim Weyrich",
      "institution": "University College London, London, UK",
      "img": "/do/10.1145/contrib-81100258924/rel-imgonly/81100258924.jpg",
      "acmid": "81100258924",
      "orcid": "missing"
    },
    {
      "name": "Jan Kautz",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100016395",
      "orcid": "missing"
    },
    {
      "name": "Anthony Steed",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501447",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarwala, A., Zheng, K. C., Pal, C., Agrawala, M., Cohen, M., Curless, B., Salesin, D., and Szeliski, R. Panoramic video textures. ACM Transactions on Graphics 24, 3 (July 2005), 821--827.  ",
      "doi": "10.1145/1073204.1073268"
    },
    {
      "text": "Benford, S., Brown, C., Reynard, G., and Greenhalgh, C. Shared spaces: transportation, artificiality, and spatiality. In Proceedings of the 1996 ACM conference on Computer supported cooperative work, ACM (1996), 77--86.  ",
      "doi": "10.1145/240080.240196"
    },
    {
      "text": "Benford, S., Greenhalgh, C., Reynard, G., Brown, C., and Koleva, B. Understanding and constructing shared spaces with mixed-reality boundaries. ACM Transaction on Computer-Human Interaction 5, 3 (Sept. 1998), 185--223.  ",
      "doi": "10.1145/292834.292836"
    },
    {
      "text": "Billinghurst, M., Poupyrev, I., Kato, H., and May, R. Mixing realities in shared space: An augmented reality interface for collaborative computing. In Multimedia and Expo, 2000. ICME 2000. 2000 IEEE International Conference on, vol. 3, IEEE (2000), 1641--1644.",
      "doi": ""
    },
    {
      "text": "Brooke, J. SUS: A quick and dirty usability scale. In Usability evaluation in industry, P. W. Jordan, B. Weerdmeester, A. Thomas, and I. L. Mclelland, Eds. Taylor and Francis, London, 1996.",
      "doi": ""
    },
    {
      "text": "Brown, M., and Lowe, D. G. Recognising panoramas. In Proceedings of the IEEE International Conference on Computer Vision, vol. 2, IEEE Computer Society (2003), 1218--1226. ",
      "doi": "10.5555/946247.946772"
    },
    {
      "text": "Chen, M. Leveraging the asymmetric sensitivity of eye contact for videoconference. In Proceedings of the SIGCHI conference on Human factors in computing systems: Changing our world, changing ourselves, ACM (2002), 49--56.  ",
      "doi": "10.1145/503376.503386"
    },
    {
      "text": "Cutler, R., Rui, Y., Gupta, A., Cadiz, J., Tashev, I., He, L.-w., Colburn, A., Zhang, Z., Liu, Z., and Silverberg, S. Distributed meetings: a meeting capture and broadcasting system. In Proceedings of the ACM International Conference on Multimedia (2002), 503--512.  ",
      "doi": "10.1145/641007.641112"
    },
    {
      "text": "Diverdi, S., Withert, J., and Hllerert, T. Envisor: Online environment map construction for mixed reality. In Proceedings of IEEE VR Conference (2008).",
      "doi": ""
    },
    {
      "text": "Fiala, M., Green, D., and Roth, G. A panoramic video and acoustic beamforming sensor for videoconferencing. In Haptic, Audio and Visual Environments and Their Applications (October 2004), 47--52.",
      "doi": ""
    },
    {
      "text": "Fischler, M. A., and Bolles, R. C. Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Commun. ACM 24, 6 (1981), 381--395.  ",
      "doi": "10.1145/358669.358692"
    },
    {
      "text": "Hauber, J., Regenbrecht, H., Billinghurst, M., and Cockburn, A. Spatiality in videoconferencing: trade-offs between efficiency and social presence. In Conference on Computer Supported Co-operative work, ACM (2006), 413--422.  ",
      "doi": "10.1145/1180875.1180937"
    },
    {
      "text": "Kauff, P., and Schreer, O. An immersive 3d video-conferencing system using shared virtual team user environments. In Proceedings of the 4th international conference on Collaborative virtual environments, ACM (2002), 105--112.  ",
      "doi": "10.1145/571878.571895"
    },
    {
      "text": "Lewis, J., and Sauro, J. The factor structure of the system usability scale. Human Centered Design (2009), 94--103.  ",
      "doi": "10.1007/978-3-642-02806-9_12"
    },
    {
      "text": "Li, Y., Wang, Y., Huang, W., and Zhang, Z. Automatic image stitching using SIFT. International Conference on Audio Language and Image Processing (2008), 568--571.",
      "doi": ""
    },
    {
      "text": "Lowe, D. Distinctive image features from scale-invariant keypoints. International Journal of Computer Visiono 60, 2 (2004), 91--110.  ",
      "doi": "10.1023/B%3AVISI.0000029664.99615.94"
    },
    {
      "text": "Majumder, A., Seales, W. B., Gopi, M., and Fuchs, H. Immersive teleconferencing: a new algorithm to generate seamless panoramic video imagery. In Proceedings of the International Conference on Multimedia, ACM (1999), 169--178.  ",
      "doi": "10.1145/319463.319485"
    },
    {
      "text": "Mikolajczyk, K., and Schmid, C. Scale and affine invariant interest point detectors. International Journal of Computer Vision 60, 1 (2004), 63--86.  ",
      "doi": "10.1023/B%3AVISI.0000027790.02288.f2"
    },
    {
      "text": "Mulloni, A., Seichter, H., Düunser, A., Baudisch, P., and Schmalstieg, D. 360 degrees: panoramic overviews for location-based services. In Proceedings of the Annual Conference on Human Factors in Computing Systems, ACM (2012), 2565--2568.  ",
      "doi": "10.1145/2207676.2208645"
    },
    {
      "text": "Rousseeuw, P. J. Least median of squares regression. Journal of the American Statistics Association 79, 388 (1984), 871--880.",
      "doi": ""
    },
    {
      "text": "Rui, Y., Gupta, A., and Cadiz, J. Viewing meeting captured by an omni-directional camera. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2001), 450--457.  ",
      "doi": "10.1145/365024.365311"
    },
    {
      "text": "Schaffalitzky, F., and Zisserman, A. Multi-view matching for unordered image sets, or \"how do i organize my holiday snaps?\". In Proceedings of the European Conference on Computer Vision, Springer-Verlag (2002), 414--431. ",
      "doi": "10.5555/645315.649164"
    },
    {
      "text": "Steedly, D., Pal, C., and Szeliski, R. Efficiently registering video into panoramic mosaics. In Proceedings of the International Conference on Computer Vision, vol. 2 (2005), 1300--1307.  ",
      "doi": "10.1109/ICCV.2005.86"
    },
    {
      "text": "Steptoe, W., Normand, J.-M., Oyekoya, O., Pece, F., Giannopoulos, E., Tecchia, F., Steed, A., and Slater, M. Acting rehearsal in collaborative multimodal mixed reality environments. Presence: Teleoperators & Virtual Environments 21, 4 (2012), 406--422.",
      "doi": "10.1162/PRES_a_00109"
    },
    {
      "text": "Suen, S. T., Lam, E. Y., and Wong, K. K. Photographic stitching with optimized object and color matching based on image derivatives. Optics Express 15, 12 (2007), 7689--7696.",
      "doi": ""
    },
    {
      "text": "Szeliski, R. Image mosaicing for tele-reality applications. In Proceedings of the IEEE Workshop on Applications of Computer Vision (1994), 44--53.",
      "doi": ""
    },
    {
      "text": "Szeliski, R. Image alignment and stitching: a tutorial. Foundations and Trends in Computer Graphics and Computer Vision 2 (2006), 1--104.  ",
      "doi": "10.1561/0600000009"
    },
    {
      "text": "Szeliski, R., and Shum, H.-Y. Creating full view panoramic image mosaics and environment maps. In Proceedings of the Annual Conference on Computer Graphics and Interactive Techniques, ACM Press/Addison-Wesley Publishing Co. (1997), 251--258.  ",
      "doi": "10.1145/258734.258861"
    },
    {
      "text": "Vertegaal, R., Weevers, I., Sohn, C., and Cheung, C. GAZE-2: conveying eye contact in group video conferencing using eye-controlled camera direction. Proceedings of the conference on Human factors in computing systems (2003), 521--528.  ",
      "doi": "10.1145/642611.642702"
    },
    {
      "text": "Wagner, D., Mulloni, A., Langlotz, T., and Schmalstieg, D. Real-time panoramic mapping and tracking on mobile phones. In Proceedings of the IEEE VR Conference, IEEE Computer Society (2010), 211--218.  ",
      "doi": "10.1109/VR.2010.5444786"
    },
    {
      "text": "Wu, C. SiftGPU: A GPU implementation of scale invariant feature transform (SIFT). http://cs.unc.edu/~ccwu/siftgpu, 2007.",
      "doi": ""
    }
  ]
}