{
  "doi": "10.1145/2470654.2466178",
  "title": "Fashionable shape switching: explorations in outfit-centric design",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1353-1362",
  "year": 2013,
  "badges": [],
  "abstract": "We present a design exercise illustrating how fashion practices and the fashion design process can be used to create new opportunities both in the mobile domain and in product design, as well as in wearable computing. We investigate the concept of outfit-centric design by extending the support for social and visual interaction with digital devices beyond the currently available shells and stickers, and drawing on the ways in which people vary their dress ensembles. We designed a set of mock-up samples in a local fashion style, as a first step in understanding possible applications of the emerging technology of organic interfaces. Initial user feedback shows how fashion-conscious participants creatively experimented with the set's variations of shape and color in outfits created from their personal wardrobes, which revealed the importance of the objects' size and location on the body. It also points out that a lack of integration with the fashion system's processes reduces the attractiveness of the samples.",
  "authors": [
    {
      "name": "Oskar Juhlin",
      "institution": "Mobile Life@Stockholm University, Kista, Sweden",
      "img": "/do/10.1145/contrib-81100316356/rel-imgonly/passfotooskarjuhlin.jpg",
      "acmid": "81100316356",
      "orcid": "missing"
    },
    {
      "name": "Yanqing Zhang",
      "institution": "Mobile Life@Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488650761",
      "orcid": "missing"
    },
    {
      "name": "Cristine Sundbom",
      "institution": "Mobile Life@Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556625756",
      "orcid": "missing"
    },
    {
      "name": "Ylva Fernaeus",
      "institution": "Mobile Life@KTH, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81100544117/rel-imgonly/ylva120pix.jpg",
      "acmid": "81100544117",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akner-Koler, C., Form and formlessness. Questioning Aesthetic Abstractions through Art Projects, Cross-disciplinary Studies and Product Design, Education. PhD Thesis, Dep. of Architecture, Chalmers University of Technology, Göteborg, 2007",
      "doi": ""
    },
    {
      "text": "Atkinson, P., Do-it-yourself, Democracy and Design, The Journal of Design History 19, 1(2006), 1--10.",
      "doi": ""
    },
    {
      "text": "Bardzell J., Interaction criticism: An introduction to the practice. Interacting with Computers 23, 6 (2011), 604--621.  ",
      "doi": "10.1016/j.intcom.2011.07.001"
    },
    {
      "text": "Bardzell, S., and Bardzell, J., Docile Avatars: Aesthetics, Experience, and Sexual Interaction in Second Life. In Proc. of BCS-HCI 07, British Computer Society. (2007), 3--12. ",
      "doi": "10.5555/1531294.1531296"
    },
    {
      "text": "Bloch, P., Brunel, M., Frederic F., Arnold, T. J. Individual Differences in the Centrality of Visual Product Aesthetics: Concept and Measurement, Journal of Consumer Research 29 (2003), 551--565",
      "doi": ""
    },
    {
      "text": "Dewey, J., Art as Experience. Perigee Trade, New York, 2005",
      "doi": ""
    },
    {
      "text": "Djajadiningrat, T., Wensveen, S., Frens, J., Overbeeke, K. Tangible products: Redressing the Balance Between Appearance and Action, In Pers Ubiquit Computer 8 (2004), 294--309  ",
      "doi": "10.1007/s00779-004-0293-8"
    },
    {
      "text": "Djelic, M.-L., and Ainamo, A., The Telecom Industry as Cultural Industry? The Transposition of Fashion Logics into the Field of Mobile Telephony, Research in the Sociology of Organizations 23 (2005), 45--80.",
      "doi": ""
    },
    {
      "text": "Falck, K., Det Svenska Modeundret, Norstedts, Stockholm, 2011",
      "doi": ""
    },
    {
      "text": "Fortunati, L., Katz, J., Riccini, R. (eds.) Mediating the Human Body: Technology, Communication and Fashion. Erlbaun, Mahwah US, 2003. ",
      "doi": "10.5555/862019"
    },
    {
      "text": "Hebdige, D., Subculture: the Meaning of Style. Routledge, London UK, 2011.",
      "doi": ""
    },
    {
      "text": "Holmquist, L.-E., Prototyping: Generating Ideas or Cargo Cult Designs?, Interactions 12, 2 (2005): 48--54.  ",
      "doi": "10.1145/1052438.1052465"
    },
    {
      "text": "Jang, E.-Y., An Analysis on Cases of Fashion Collaboration Strategy, Journal of Fashion Business 10. 6 (2006), 110--121.",
      "doi": ""
    },
    {
      "text": "Jacobsson, M., Fernaeus, Y., Nylander, S., Mobile ActDresses: Programming Mobile Devices by Accessorizing, In Proc. of CHI EA 2012, ACM Press, 2012. 1071--1074.  ",
      "doi": "10.1145/2212776.2212388"
    },
    {
      "text": "Jonson, B., Design Ideation: The Conceptual Sketch in the Digital Age. Design Studies 26, 6 (2005), 613--624.",
      "doi": ""
    },
    {
      "text": "Juhlin, O., and Zhang, Y., Unpacking Social Interaction that Make Us Adore - On the Aesthetics of Mobile Phones as Fashion Items. In Proc. Mobile HCI 2011, ACM Press (2011), 241--250.  ",
      "doi": "10.1145/2037373.2037410"
    },
    {
      "text": "Kashanipour, M., \"Mobile Fashion\" Application Exploring Design Solution for the \"Outfit-Centric Accessories\" Concept. Master of Science Thesis at KTH, Royal Institute of Technology, April 2012.",
      "doi": ""
    },
    {
      "text": "Katz, J. E. and Sugiyama, S., Mobile Phones as Fashion Statements: Evidence from Student Surveys in the US and Japan, New Media & Society 8.2 (2006). 321--337.",
      "doi": ""
    },
    {
      "text": "Kawamura, Y., Fashion-ology: An Introduction to Fashion Studies. Berg, Oxford UK, 2005.",
      "doi": ""
    },
    {
      "text": "Loschek, I., When Clothes Become Fashion: Design and Innovation Systems, Berg, 2009.",
      "doi": ""
    },
    {
      "text": "Mazza, C., and Alvarez, J. L., Haute Couture and Pret-a-Porter: The Popular Press and the Diffusion of Management Practices. Organization Studies 21, 3 (May 2000), 567--588.",
      "doi": ""
    },
    {
      "text": "Moere, A. V., and Hoinkis, M., A Wearable Folding Display for Self-expression. In Proc. of CHISIG OZCHI'06, ACM Press (2006). 301--304.  ",
      "doi": "10.1145/1228175.1228228"
    },
    {
      "text": "Pan, Y., Roedl, D., Thomas, J. C. and Blevis, E. Re-conceptualizing Fashion in Sustainable HCI. In Proc. DIS 2012, ACM Press (2012), 621--630.  ",
      "doi": "10.1145/2317956.2318049"
    },
    {
      "text": "Petersen, M. G., Iversen, O. S., Gall Krogh, P. Aesthetic Interaction: A Pragmatist's Aesthetics of Interactive Systems, DIS 2004, ACM Press (2004). 269--276.  ",
      "doi": "10.1145/1013115.1013153"
    },
    {
      "text": "Quinn, B. Textile Futures - Fashion, Design and Technology. Berg, Oxford UK, 2010.",
      "doi": ""
    },
    {
      "text": "Robinson, D., Fashion Theory and Product Design. Harvard Business Review 36, 6, (1958), 126--138.",
      "doi": ""
    },
    {
      "text": "Seymour, S., Fashionable Technology: The Intersection of Design, Fashion, Science, and Technology, Springer, Vienna Austria, 2008. ",
      "doi": "10.5555/1386567"
    },
    {
      "text": "Sorger, R. and Udale, J., The Fundamentals of Fashion Design, 2nd edition, AVA Publishing, Switzerland, 2012.",
      "doi": ""
    },
    {
      "text": "Vertegaal, R., Poupyrev I., Organic User Interfaces, Communications of the ACM 51, 6 (2008), 26--30.  ",
      "doi": "10.1145/1349026.1349033"
    },
    {
      "text": "Wan, F., Young, S., and Fang, T., Passionate Surfers in Image-Driven Consumer Culture: Fashion-Conscious, Appearance-Savvy People and Their Way of Life. Advances in Consumer Research 28 (2001), 266--275.",
      "doi": ""
    },
    {
      "text": "Wilson, E., Adorned in Dreams: Fashion and Modernity. Rutgers Uni. Press, New Jersey US, 2003.",
      "doi": ""
    },
    {
      "text": "Woodward, S., Why Women Wear What They Wear, Berg, New York US, 2007.",
      "doi": ""
    },
    {
      "text": "Viewpoint No. 28, the Netherlands, 2011.",
      "doi": ""
    },
    {
      "text": "Nokia Morph, http://research.nokia.com/morph",
      "doi": ""
    },
    {
      "text": "Nokia L'Amour http://www.gsmarena.com",
      "doi": ""
    }
  ]
}