{
  "doi": "10.1145/2470654.2470724",
  "title": "Weighted graph comparison techniques for brain connectivity analysis",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "483-492",
  "year": 2013,
  "badges": [
    "Best Paper"
  ],
  "abstract": "The analysis of brain connectivity is a vast field in neuroscience with a frequent use of visual representations and an increasing need for visual analysis tools. Based on an in-depth literature review and interviews with neuroscientists, we explore high-level brain connectivity analysis tasks that need to be supported by dedicated visual analysis tools. A significant example of such a task is the comparison of different connectivity data in the form of weighted graphs. Several approaches have been suggested for graph comparison within information visualization, but the comparison of weighted graphs has not been addressed. We explored the design space of applicable visual representations and present augmented adjacency matrix and node-link visualizations. To assess which representation best support weighted graph comparison tasks, we performed a controlled experiment. Our findings suggest that matrices support these tasks well, outperforming node-link diagrams. These results have significant implications for the design of brain connectivity analysis tools that require weighted graph comparisons. They can also inform the design of visual analysis tools in other domains, e.g. comparison of weighted social networks or biological pathways.",
  "tags": [
    "brain connectivity analysis",
    "brain connectivity visualization",
    "graph comparison"
  ],
  "authors": [
    {
      "name": "Basak Alper",
      "institution": "University of California - Santa Barbara, Santa Barbara, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490689860",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Bach",
      "institution": "INRIA, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482661013",
      "orcid": "0000-0002-9201-7744"
    },
    {
      "name": "Nathalie Henry Riche",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502798938",
      "orcid": "missing"
    },
    {
      "name": "Tobias Isenberg",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81100203466/rel-imgonly/tobiselection.jpg",
      "acmid": "81100203466",
      "orcid": "missing"
    },
    {
      "name": "Jean-Daniel Fekete",
      "institution": "INRIA, Paris, France",
      "img": "/do/10.1145/contrib-81100194446/rel-imgonly/81100194446.jpg",
      "acmid": "81100194446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Achard, S., Salvador, R., Whitcher, B., Suckling, J., and Bullmore, E. A Resilient, Low-Frequency, Small-World Human Brain Functional Network with Highly Connected Association Cortical Hubs. J. Neurosci. 26, 1 (2006), 63--72. doi&gt; 10.1523/JNEUROSCI.3874-05.",
      "doi": ""
    },
    {
      "text": "Andrews, K., Wohlfahrt, M., and Wurzinger, G. Visual Graph Comparison. In Proc. IV, IEEE Computer Society (Los Alamitos, 2009), 62--67. doi&gt; 10.1109/IV.2009.108  ",
      "doi": "10.1109/IV.2009.108"
    },
    {
      "text": "Archambault, D., Purchase, H., and Pinaud, B. Animation, Small Multiples, and the Effect of Mental Map Preservation in Dynamic Graphs. IEEE TVCG 17, 4 (2011), 539--552. doi&gt; 10.1109/TVCG.2010.78  ",
      "doi": "10.1109/TVCG.2010.78"
    },
    {
      "text": "Archip, N., Clatz, O., Whalen, S., Kacher, D., Fedorov, A., Kot, A., Chrisochoides, N., Jolesz, F., Golby, A., Black, P., et al. Non-Rigid Alignment of Pre-Operative MRI, fMRI, and DT-MRI with Intra-Operative MRI for Enhanced Visualization and Navigation in Image-Guided Neurosurgery. NeuroImage 35, 2 (2007), 609--624. doi&gt; 10.1016/j.neuroimage.2006.11.060",
      "doi": ""
    },
    {
      "text": "Bassett, D., Brown, J., Deshpande, V., Carlson, J., and Grafton, S. Conserved and Variable Architecture of Human White Matter Vonnectivity. NeuroImage 54, 2 (2011), 1262--1279. doi&gt; 10.1016/j.neuroimage.2010.09. 006",
      "doi": ""
    },
    {
      "text": "Bassett, D., Bullmore, E., Verchinski, B., Mattay, V., Weinberger, D., and Meyer-Lindenberg, A. Hierarchical Organization of Human Cortical Networks in Health and Schizophrenia. J. Neurosci. 28, 37 (2008), 9239--9248. doi&gt; 10.1523/JNEUROSCI.1929-08.2008",
      "doi": ""
    },
    {
      "text": "Beckmann, M., Johansen-Berg, H., and Rushworth, M. Connectivity-Based Parcellation of Human Cingulate Cortex and Its Relation to Functional Specialization. J. Neurosci. 29, 4 (2009), 1175--1190. doi&gt; 10. 1523/JNEUROSCI.3328-08.2009",
      "doi": ""
    },
    {
      "text": "Brandes, U., Dwyer, T., and Schreiber, F. Visual Understanding of Metabolic Pathways Across Organisms Using Layout in Two and a Half Dimensions. Journal of Integrative Bioinformatics 1, 1 (2004), 2:1--2:16. doi&gt; 10. 2390/biecoll-jib-2004-2",
      "doi": ""
    },
    {
      "text": "Bullmore, E., and Sporns, O. Complex Brain Networks: Graph Theoretical Analysis of Structural and Functional Systems. Nature Reviews Neuroscience 10, 3 (2009), 186--198. doi&gt; 10.1038/nrn2618",
      "doi": ""
    },
    {
      "text": "Cao, C., and Slobounov, S. Alteration of Cortical Functional Connectivity as a Result of Traumatic Brain Injury Revealed by Graph Theory, ICA, and sLORETA Analyses of EEG Signals. IEEE Transactions on Neural Systems and Rehabilitation Engineering 18, 1 (2010), 11--19. doi&gt; 10.1109/TNSRE.2009.2027704",
      "doi": ""
    },
    {
      "text": "Collberg, C., Kobourov, S., Nagra, J., Pitts, J., and Wampler, K. A System for Graph-Based Visualization of the Evolution of Software. In Proc. SoftVis, ACM (2003), 77--86. doi&gt; 10.1145/774833.774844  ",
      "doi": "10.1145/774833.774844"
    },
    {
      "text": "Diehl, S., and Görg, C. Graphs, they are Changing: Dynamic Graph Drawing for a Sequence of Graphs. In Proc. Graph Drawing, Springer (2002), 23--31. doi&gt; 10. 1007/3-540-36151-0 3 ",
      "doi": "10.5555/647554.729718"
    },
    {
      "text": "Diehl, S., Görg, C., and Kerren, A. Preserving the Mental Map using Foresighted Layout. In Proc. VisSym, Eurographics Association (2001), 175--184.  ",
      "doi": "10.5555/2384110.2384134"
    },
    {
      "text": "Dosenbach, N., Nardos, B., Cohen, A., Fair, D., Power, J., Church, J., Nelson, S., Wig, G., Vogel, A., Lessov-Schlaggar, C., et al. Prediction of Individual Brain Maturity Using fMRI. Science 329, 5997 (2010), 1358--1361. doi&gt; 10.1126/science.1194144",
      "doi": ""
    },
    {
      "text": "Elmqvist, N., Do, T.-N., Goodell, H., Henry, N., and Fekete, J.-D. ZAME: Interactive Large-Scale Graph Visualization. In Proc. PacificVIS, IEEE Computer Society (2008), 215--222. doi&gt; 10.1109/PACIFICVIS. 2008.4475479",
      "doi": ""
    },
    {
      "text": "Epskamp, S., Cramer, A., Waldorp, L., Schmittmann, V., and Borsboom, D. qgraph: Network Visualizations of Relationships in Psychometric Data. Journal of Statistical Software 48, 4 (2012), 1--18.",
      "doi": ""
    },
    {
      "text": "Erten, C., Harding, P., Kobourov, S., Wampler, K., and Yee, G. GraphAEL: Graph Animations with Evolving Layouts. In Proc. Graph Drawing, Springer (2004), 98--110. doi&gt; 10.1007/978-3-540-24595-7 9",
      "doi": ""
    },
    {
      "text": "Everts, M. H., Bekker, H., Roerdink, J. B. T. M., and Isenberg, T. Depth-Dependent Halos: Illustrative Rendering of Dense Line Data. IEEE TVCG 15, 6 (2009), 1299--1306. doi&gt; 10.1109/TVCG.2009.138  ",
      "doi": "10.1109/TVCG.2009.138"
    },
    {
      "text": "Gerhard, S., Daducci, A., Lemkaddem, A., Meuli, R., Thiran, J., and Hagmann, P. The Connectome Viewer Toolkit: An Open Source Framework to Manage, Analyze, and Visualize Connectomes. Frontiers in Neuroinformatics 5 (2011), 3:1--3:15. doi&gt; 10.3389/fninf. 2011.00003",
      "doi": ""
    },
    {
      "text": "Ginestet, C., and Simmons, A. Statistical Parametric Network Analysis of Functional Connectivity Dynamics during a Working Memory Task. NeuroImage 55, 2 (2011), 688--704. doi&gt; 10.1016/j.neuroimage.2010.11. 030",
      "doi": ""
    },
    {
      "text": "Gleicher, M., Albers, D., Walker, R., Jusufi, I., Hansen, C., and Roberts, J. Visual Comparison for Information Visualization. Information Visualization 10, 4 (2011), 289--309. doi&gt; 10.1177/1473871611416549  ",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "Hagmann, P., Cammoun, L., Gigandet, X., Meuli, R., Honey, C., Wedeen, V., and Sporns, O. Mapping the Structural Core of Human Cerebral Cortex. PLoS Biology 6, 7 (2008), e159. doi&gt; 10.1371/journal.pbio.0060159",
      "doi": ""
    },
    {
      "text": "Hascoët, M., and Dragicevic, P. Interactive Graph Matching and Visual Comparison of Graphs and Clustered Graphs. In Proc. AVI, ACM (2012), 522--529. doi&gt; 10.1145/2254556.2254654  ",
      "doi": "10.1145/2254556.2254654"
    },
    {
      "text": "Honey, C., Kötter, R., Breakspear, M., and Sporns, O. Network Structure of Cerebral Cortex Shapes Functional Connectivity on Multiple Time Scales. PNAS 104, 24 (2007), 10240--10245. doi&gt; 10.1073/pnas.0701519104",
      "doi": ""
    },
    {
      "text": "Honey, C., Sporns, O., Cammoun, L., Gigandet, X., Thiran, J., Meuli, R., and Hagmann, P. Predicting Human Resting-State Functional Connectivity from Structural Connectivity. PNAS 106, 6 (2009), 2035--2040. doi&gt; 10. 1073/pnas.0811168106",
      "doi": ""
    },
    {
      "text": "Horwitz, B. The Elusive Concept of Brain Connectivity. Neuroimage 19, 2 (2003), 466--470. doi&gt; 10. 1016/S1053-8119(03)00112-5",
      "doi": ""
    },
    {
      "text": "Jianu, R., Demiralp, C., and Laidlaw, D. Exploring 3D DTI Fiber Tracts with Linked 2D Representations. IEEE TVCG 15, 6 (2009), 1449--1456. doi&gt; 10.1109/TVCG. 2009.141  ",
      "doi": "10.1109/TVCG.2009.141"
    },
    {
      "text": "Kramer, M., Eden, U., Lepage, K., Kolaczyk, E., Bianchi, M., and Cash, S. Emergence of Persistent Networks in Long-Term Intracranial EEG Recordings. J. Neurosci. 31, 44 (2011), 15757--15767. doi&gt; 10.1523/JNEUROSCI. 2287-11.2011",
      "doi": ""
    },
    {
      "text": "Li, K., Guo, L., Faraco, C., Zhu, D., Chen, H., Yuan, Y., Lv, J., Deng, F., Jiang, X., Zhang, T., et al. Visual Analytics of Brain Networks. NeuroImage 61, 1 (2012), 82--97. doi&gt; 10.1016/j.neuroimage.2012.02.075",
      "doi": ""
    },
    {
      "text": "Moberts, B., Vilanova, A., and van Wijk, J. Evaluation of Fiber Clustering Methods for Diffusion Tensor Imaging. In Proc. Visualization, IEEE Computer Society (2005), 65--72. doi&gt; 10.1109/VISUAL.2005.1532779",
      "doi": ""
    },
    {
      "text": "Nelson, S., Cohen, A., Power, J., Wig, G., Miezin, F., Wheeler, M., Velanova, K., Donaldson, D., Phillips, J., Schlaggar, B., and Petersen, S. A Parcellation Scheme for Human Left Lateral Parietal Cortex. Neuron 67, 1 (2010), 156--170. doi&gt; 10.1016/j.neuron.2010.05.025",
      "doi": ""
    },
    {
      "text": "Rajapakse, J., and Zhou, J. Learning Effective Brain Connectivity with Dynamic Bayesian Networks. NeuroImage 37, 3 (2007), 749--760. doi&gt; 10.1016/j. neuroimage.2007.06.003",
      "doi": ""
    },
    {
      "text": "Richiardi, J., Eryilmaz, H., Schwartz, S., Vuilleumier, P., and Van De Ville, D. Decoding Brain States from fMRI Connectivity Graphs. NeuroImage 56, 2 (2011), 616--626. doi&gt; 10.1016/j.neuroimage.2010.05.081",
      "doi": ""
    },
    {
      "text": "Sanz-Arigita, E., Schoonheim, M., Damoiseaux, J., Rombouts, S., Maris, E., Barkhof, F., Scheltens, P., and Stam, C. Loss of 'Small-World' Networks in Alzheimer's Disease: Graph Analysis of fMRI Resting-State Functional Connectivity. PloS one 5, 11 (2010), e13788. doi&gt; 10.1371/journal.pone.001378",
      "doi": ""
    },
    {
      "text": "Scholz, J., Klein, M., Behrens, T., and Johansen-Berg, H. Training Induces Changes in White-Matter Architecture. Nature Neuroscience 12, 11 (2009), 1370--1371. doi&gt; 10. 1038/nn.2412",
      "doi": ""
    },
    {
      "text": "Schreiber, F. Comparison of Metabolic Pathways using Constraint Graph Drawing. In Proc. APBC, Australian Computer Society, Inc., Australian Computer Society, Inc. (2003), 105--110. ",
      "doi": "10.5555/820189.820203"
    },
    {
      "text": "Seth, A. A MATLAB Toolbox for Granger Causal Connectivity Analysis. J. Neurosci. Methods 186, 2 (2010), 262--273. doi&gt; 10.1016/j.jneumeth.2009.11.020",
      "doi": ""
    },
    {
      "text": "Sherbondy, A., Akers, D., Mackenzie, R., Dougherty, R., and Wandell, B. Exploring Connectivity of the Brain's White Matter with Dynamic Queries. IEEE TVCG 11, 4 (2005), 419--430. doi&gt; 10.1109/TVCG.2005.59  ",
      "doi": "10.1109/TVCG.2005.59"
    },
    {
      "text": "Thomason, M., Dennis, E., Joshi, A., Joshi, S., Dinov, I., Chang, C., Henry, M., Johnson, R., Thompson, P., Toga, A., Glover, G. H., Horn, J. D. V., and Gotlib, I. H. Resting-State fMRI Can Reliably Map Neural Networks in Children. NeuroImage 55, 1 (2011), 165--175. doi&gt; 10. 1016/j.neuroimage.2010.11.080",
      "doi": ""
    },
    {
      "text": "van Ham, F., Schulz, H., and Dimicco, J. Honeycomb: Visual Analysis of Large Scale Social Networks. In Proc. INTERACT, Springer (2009), 429--442. doi&gt; 10. 1007/978-3-642-03658-3 47  ",
      "doi": "10.1007/978-3-642-03658-3_47"
    },
    {
      "text": "Vidal, J., Freyermuth, S., Jerbi, K., Hamamé, C., Ossandon, T., Bertrand, O., Minotti, L., Kahane, P., Berthoz, A., and Lachaux, J. Long-Distance Amplitude Correlations in the High Gamma Band Reveal Segregation and Integration within the Reading Network. J. Neurosci. 32, 19 (2012), 6421--6434. doi&gt; 10. 1523/JNEUROSCI.4363-11.2012",
      "doi": ""
    },
    {
      "text": "Worsley, K., Chen, J., Lerch, J., and Evans, A. Comparing Functional Connectivity via Thresholding Correlations and Singular Value Decomposition. Philos. Trans. R. Soc. Lond. B Biol. Sci. 360, 1457 (2005), 913--920. doi&gt; 10.1098/rstb.2005.1637",
      "doi": ""
    },
    {
      "text": "Zalesky, A., Fornito, A., and Bullmore, E. Network-Based Statistic: Identifying Differences in Brain Networks. NeuroImage 53, 4 (2010), 1197--1207. doi&gt; 10.1016/j.neuroimage.2010.06.041",
      "doi": ""
    }
  ]
}