{
  "doi": "10.1145/2470654.2470757",
  "title": "GravitySpace: tracking users and their poses in a smart room using a pressure-sensing floor",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "725-734",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We explore how to track people and furniture based on a high-resolution pressure-sensitive floor. Gravity pushes people and objects against the floor, causing them to leave imprints of pressure distributions across the surface. While the sensor is limited to sensing direct contact with the surface, we can sometimes conclude what takes place above the surface, such as users' poses or collisions with virtual objects. We demonstrate how to extend the range of this approach by sensing through passive furniture that propagates pressure to the floor. To explore our approach, we have created an 8 m2 back-projected floor prototype, termed GravitySpace, a set of passive touch-sensitive furniture, as well as algorithms for identifying users, furniture, and poses. Pressure-based sensing on the floor offers four potential benefits over camera-based solutions: (1) it provides consistent coverage of rooms wall-to-wall, (2) is less susceptible to occlusion between users, (3) allows for the use of simpler recognition algorithms, and (4) intrudes less on users' privacy.",
  "authors": [
    {
      "name": "Alan Bränzel",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556973056",
      "orcid": "missing"
    },
    {
      "name": "Christian Holz",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Daniel Hoffmann",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558332756",
      "orcid": "missing"
    },
    {
      "name": "Dominik Schmidt",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81442594952/rel-imgonly/dominik.jpg",
      "acmid": "81442594952",
      "orcid": "missing"
    },
    {
      "name": "Marius Knaust",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557197756",
      "orcid": "missing"
    },
    {
      "name": "Patrick Lühne",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496690726",
      "orcid": "missing"
    },
    {
      "name": "René Meusel",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470654639",
      "orcid": "missing"
    },
    {
      "name": "Stephan Richter",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538997056",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Augsten, T., Kaefer, K., Meusl, R., Fetzer, C., Kanitz, D., Stoff, T., Becker, T., Holz, C., and Baudisch, P. Multitoe: High-precision interaction with back-projected floors based on high-resolution multi-touch input. In Proc. UIST'10, 209--218.  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Baudisch, P., Becker, T., and Rudeck, F. Lumino: Tangible blocks for tabletop computers based on glass fiber bundles. In Proc. CHI'10, 1165--1174.  ",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "Bartindale, T. and Harrison, C. Stacks on the surface: Resolving physical order with masked fiducial markers. In Proc. ITS'09, 57--60.  ",
      "doi": "10.1145/1731903.1731916"
    },
    {
      "text": "Borchers, J., Ringel, M., Tyler, J., and Fox, A. Stanford Interactive Workspaces: A framework for physical and graphical user interface prototyping. IEEE Wireless Communications, Vol. 9, No. 6, IEEE Press, December 2002, 64--69.  ",
      "doi": "10.1109/MWC.2002.1160083"
    },
    {
      "text": "Brumitt, B., Meyers, B., Krumm, J., Kern, A., and Shafer, S. A. EasyLiving: Technologies for intelligent environments. In Proc. Ubicomp'00, 12--29. ",
      "doi": "10.5555/647986.743885"
    },
    {
      "text": "Cruz-Neira, C., Sandin, D. J., and DeFanti, T. A. Surround-screen projection-based virtual reality: The design and implementation of the CAVE. In Proc. SIGGRAPH'93, 135--142.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Davidson, P., Han, J. Extending 2D object arrangement with pressure-sensitive layering cues. In Proc. UIST'08, 87--90.  ",
      "doi": "10.1145/1449715.1449730"
    },
    {
      "text": "Davies, E. Roy (2005). Machine Vision: Theory, Algorithms, Practicalities (3rd ed.). Amsterdam, Boston: Elsevier. ISBN 9780122060939. ",
      "doi": "10.5555/1076362"
    },
    {
      "text": "Dietz, P. and Leigh, D. DiamondTouch: A multi-user touch technology. In Proc. UIST'01, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "F-Scan® System in-shoe plantar pressure analysis http://www.tekscan.com",
      "doi": ""
    },
    {
      "text": "González, R., and Woods, R. Digital image processing. Addison-Wesley Longman Publishing Co., Inc. Boston, MA, USA ©1992 ISBN:0201508036.",
      "doi": ""
    },
    {
      "text": "Grønbæk, K., Iversen, O. S., Kortbek, K. J., Nielsen, K. R., and Aagaard, L. IGameFloor: A platform for co-located collaborative games. In Proc. ACE'07, 64--71.  ",
      "doi": "10.1145/1255047.1255061"
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. UIST'05, 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Holz, C. and Baudisch, P. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proc. CHI'10, 581--590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Kientz, J. A., Patel, S. N., Jones, B., Price, E., Mynatt, E. D., and Abowd, G. D. The Georgia Tech aware home. In CHI'08 EA, 3675--3680.  ",
      "doi": "10.1145/1358628.1358911"
    },
    {
      "text": "Krogh, P. G., Ludvigsen, M., Lykke-Olesen, A. Help me pull that cursor. A Collaborative Interactive Floor Enhancing Community Interaction. In Proc. OZCH'04, 22--24.",
      "doi": ""
    },
    {
      "text": "LaViola, J. J., Feliz, D. A., Keefe, D. F., and Zeleznik, R. C. Hands-free multi-scale navigation in virtual environments. In Proc. I3D'01, 9--15.  ",
      "doi": "10.1145/364338.364339"
    },
    {
      "text": "Leitner, J. and Haller, M. Geckos: Geckos: Combining magnets and pressure images to enable new tangible-object design and interaction. In Proc. CHI'11, pp 2985--2994.  ",
      "doi": "10.1145/1978942.1979385"
    },
    {
      "text": "Lowe, D. Object recognition from local scale-invariant features. IEEE Comp. Vision 2. (1999), 1150--1157. ",
      "doi": "10.5555/850924.851523"
    },
    {
      "text": "Matsushita, N., and Rekimoto, J. HoloWall: Designing a finger, hand, body, and object sensitive wall. In Proc. UIST'97, 209--210.  ",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "Molyneaux, D., Izadi, S., Kim, D., Hilliges, O., Hodges, S., Cao, X., Butler, A., and Gellersen, H. Interactive environment-aware handheld projectors for pervasive computing spaces. In Proc. Pervasive'12, 197--215.  ",
      "doi": "10.1007/978-3-642-31205-2_13"
    },
    {
      "text": "Morris, M. R. Designing tabletop groupware. In UIST'05 Doctoral Symposium.",
      "doi": ""
    },
    {
      "text": "Mota, S. and Picard, R. W. Automated posture analysis for detecting learner's interest level. In Proc. CVPRW'03, 49--56.",
      "doi": ""
    },
    {
      "text": "Mutlu, B. and Krause, A. and Forlizzi, J. and Guestrin, C. and Hodgins, J. Robust, low-cost, non-intrusive sensing and recognition of seated postures. In Proc. UIST'07, --158.  ",
      "doi": "10.1145/1294211.1294237"
    },
    {
      "text": "Olwal, A. and Wilson, A. D. SurfaceFusion: Unobtrusive tracking of everyday objects in tangible user interfaces. In Proc. GI'08, 235--242. ",
      "doi": "10.5555/1375714.1375754"
    },
    {
      "text": "Orr, R. J. and Abowd, G. D. The Smart Floor: a mechanism for natural user identification and tracking. In CHI'00 EA, 275--276.  ",
      "doi": "10.1145/633292.633453"
    },
    {
      "text": "Paradiso, J., Abler, C., Hsiao, K., Reynolds, M. The Magic Carpet: Physical sensing for immersive environments. In Proc. CHI'97, 277--278.  ",
      "doi": "10.1145/1120212.1120391"
    },
    {
      "text": "Pavlou, M. and Allinson, N. M. Automatic extraction and classification of footwear patterns. In Proc. IDEAL'06, 721--728.  ",
      "doi": "10.1007/11875581_87"
    },
    {
      "text": "Pavlou, M. and Allinson, N. M. Footwear Recognition. In Proc. Encyclopedia of Biometrics'09, 557--562.",
      "doi": ""
    },
    {
      "text": "Piper, A., O'Brien, Ringel Morris, M., and Winograd, T. SIDES: A cooperative tabletop computer game for social skills development. In Proc. CSCW'06, 1--10.  ",
      "doi": "10.1145/1180875.1180877"
    },
    {
      "text": "Qian, G., Zhang, J., Kidane, A. People identification using gait via floor pressure sensing and analysis. In Proc. SCC'08, 83--98.  ",
      "doi": "10.1007/978-3-540-88793-5_7"
    },
    {
      "text": "Richardson, B., Leydon, K., Fernstrom, M., and Paradiso, J. A. Z-Tiles: Building blocks for modular, pressure-sensing floorspaces. In CHI'04 EA, 1529--1532.  ",
      "doi": "10.1145/985921.986107"
    },
    {
      "text": "Richter, S., Holz, C., and Baudisch, P. Bootstrapper: Recognizing tabletop users by their shoes. In CHI'12, 1249--1252.  ",
      "doi": "10.1145/2207676.2208577"
    },
    {
      "text": "Rosenberg, I. and Perlin, K. The UnMousePad: An interpolating multi-touch force-sensing input pad. In Proc. SIGGRAPH'09/ACM Trans. Graph. (Vol. 28, No. 3, Article 65), 1--9.  ",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "Schmidt, D., Chong, M., and Gellersen, H. HandsDown: Hand-contour-based user identification for interactive surfaces. In Proc. NordiCHI'10, 432--441.  ",
      "doi": "10.1145/1868914.1868964"
    },
    {
      "text": "Srinivasan, P., Birchfield, D., Qian, G. and Kidan, A. A pressure sensing floor for interactive media applications. In Proc. ACE'05, 278--281.  ",
      "doi": "10.1145/1178477.1178526"
    },
    {
      "text": "Streitz, N., Geißler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P., and Steinmetz, R. i-LAND: An interactive landscape for creativity and innovation. In Proc. CHI'99, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Sugiura, A. and Koseki, Y. A user interface using fingerprint recognition: holding commands and data objects on fingers. In Proc. UIST'98, 71--79.  ",
      "doi": "10.1145/288392.288575"
    },
    {
      "text": "Verbunt, M., Bartneck C. Sensing senses: Tactile feedback for the prevention of decubitus ulcers. In Appl Psychophysiol Biofeedback. 2010 Sep, 35(3):243--50.",
      "doi": ""
    },
    {
      "text": "Villar, N., Gilleade, K., Ramduny-Ellis, D., and Gellerson, H. The VoodooIO gaming kit: A real-time adaptable gaming controller. In Proc. ACE'06.  ",
      "doi": "10.1145/1178823.1178825"
    },
    {
      "text": "Visell, Y., Law, A., and Cooperstock, J. R. Touch is everywhere: Floor surfaces as ambient haptic interfaces. EEE Trans. Haptics 2, 3 (Jul. 2009), 148--159.  ",
      "doi": "10.1109/TOH.2009.31"
    },
    {
      "text": "Weiser, M. The computer for the 21st century. Scientific American, Sep. 1991, 66--75.",
      "doi": ""
    },
    {
      "text": "Wilson, A. and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. UIST'10, 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Yin, K. and Pai, D. FootSee: An interactive animation system. In Proc. SCA'03, 329--338. ",
      "doi": "10.5555/846276.846323"
    }
  ]
}