{
  "doi": "10.1145/2470654.2470774",
  "title": "StrikeAPose: revealing mid-air gestures on public displays",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "841-850",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We investigate how to reveal an initial mid-air gesture on interactive public displays. This initial gesture can serve as gesture registration for advanced operations. We propose three strategies to reveal the initial gesture: spatial division, temporal division and integration. Spatial division permanently shows the gesture on a dedicated screen area. Temporal division interrupts the application to reveal the gesture. Integration embeds gesture hints directly in the application. We also propose a novel initial gesture called Teapot to illustrate our strategies. We report on a laboratory and field study. Our main findings are: A large percentage of all users execute the gesture, especially with spatial division (56%). Users intuitively discover a gesture vocabulary by exploring variations of the Teapot gesture by themselves, as well as by imitating and extending other users' variations.",
  "tags": [
    "initial gesture",
    "field study",
    "public displays",
    "revelation"
  ],
  "authors": [
    {
      "name": "Robert Walter",
      "institution": "Telekom Innovation Laboratories, TU Berlin, Berlin, Germany",
      "img": "/do/10.1145/contrib-81488640442/rel-imgonly/rwalter.de.jpg",
      "acmid": "81488640442",
      "orcid": "missing"
    },
    {
      "name": "Gilles Bailly",
      "institution": "Telekom Innovation Laboratories, TU Berlin, Berlin, Germany",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    },
    {
      "name": "Jörg Müller",
      "institution": "Telekom Innovation Laboratories & University of the Arts, Berlin, Germany",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailly, G., Lecolinet, E., and Nigay, L. Wave menus: improving the novice mode of hierarchical marking menus. In Springer-Verlag INTERACT'07 (2007), 475--488. ",
      "doi": "10.5555/1776994.1777053"
    },
    {
      "text": "Bailly, G., Lecolinet, E., and Nigay, L. Flower menus: a new type of marking menu with large menu breadth, within groups and efficient expert mode memorization. In ACM AVI '08 (2008), 15--22.  ",
      "doi": "10.1145/1385569.1385575"
    },
    {
      "text": "Bailly, G., Walter, R., Müller, J., Ning, T., and Lecolinet, E. Comparing free hand menu techniques for distant displays using linear, marking and finger-count menus. In Springer-Verlag INTERACT'11 (2011), 248--262. ",
      "doi": "10.5555/2042118.2042143"
    },
    {
      "text": "Bau, O., and Mackay, W. E. Octopocus: a dynamic guide for learning gesture-based command sets. In ACM UIST '08 (2008), 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Bau, O., Ghomi, E., Mackay, W. Arpege: Design and learning of multi-finger chord gestures. In Technical Report 1533, LRI. February 2010. (2010).",
      "doi": ""
    },
    {
      "text": "Baudel, T., and Beaudouin-Lafon, M. Charade: remote control of objects using free-hand gestures. Commun. ACM 36, 7 (July 1993), 28--35.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Bolt, R. A. Put-that-there: Voice and gesture at the graphics interface. In ACM SIGGRAPH '80 (1980), 262--270.  ",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Bragdon, A., Zeleznik, R., Williamson, B., Miller, T., and LaViola, Jr., J. J. Gesturebar: improving the approachability of gesture-based interfaces. In ACM CHI '09 (2009), 2269--2278.  ",
      "doi": "10.1145/1518701.1519050"
    },
    {
      "text": "Buxton, B. Gesture Based Interaction (chapter 14), 24 August, 2011. http://www.billbuxton.com/input14.Gesture.pdf.",
      "doi": ""
    },
    {
      "text": "Cadoz, C. Le geste canal de communication homme-machine. La communication \"instrumentale\". Techniques et Sciences Informatiques (1994), 31--61.",
      "doi": ""
    },
    {
      "text": "Coutrix, C., Kuikkaniemi, K., Kurvinen, E., Jacucci, G., Avdouevski, I., and Mäkelä, R. Fizzyvis: designing for playful information browsing on a multitouch public display. In ACM DPPI '11 (2011), 27:1--27:8.  ",
      "doi": "10.1145/2347504.2347534"
    },
    {
      "text": "Dalsgaard, P., and Hansen, L. K. Performing perception - staging aesthetics of interaction. ACM Trans. Comput.-Hum. Interact. 15, 3 (Dec. 2008), 13:1--13:33.  ",
      "doi": "10.1145/1453152.1453156"
    },
    {
      "text": "Freeman, D., Benko, H., Morris, M. R., and Wigdor, D. Shadowguides: visualizations for in-situ learning of multi-touch and whole-hand gestures (2009). 165--172.  ",
      "doi": "10.1145/1731903.1731935"
    },
    {
      "text": "Grossman, T., Hinckley, K., Baudisch, P., Agrawala, M., and Balakrishnan, R. Hover widgets: using the tracking state to extend the capabilities of pen-operated devices. In ACM CHI '06 (2006), 861--870.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Hinckley, K., Baudisch, P., Ramos, G., and Guimbretiere, F. Design and analysis of delimiters for selection-action pen gesture phrases in scriboli. In Proceedings of the SIGCHI conference on Human factors in computing systems, CHI '05, ACM (2005), 451--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Hinrichs, U., and Carpendale, S. Gestures in the wild: studying multi-touch gesture sequences on interactive tabletop exhibits. In ACM CHI'11 (2011), 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Hofmeester, K., and Wolfe, J. Self-revealing gestures: teaching new touch interactions in windows 8. In ACM CHI EA '12 (2012), 815--828.  ",
      "doi": "10.1145/2212776.2212855"
    },
    {
      "text": "Huang, E., Koster, A., and Borchers, J. Overcoming assumptions and uncovering practices: When does the public really look at public displays? In Pervasive Computing, vol. 5013 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, (2008), 228--243.  ",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Karam, M., and Schraefel, C. \"A taxonomy of gestures in human computer interactions\". Technical report, Electronics and Computer Science, University of Southampton (2005).",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G., and Hulteen, E. Gestures in human-computer communication. The Art of Human-Computer Interface Design (1990), 309--317.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G. P. The design and evaluation of marking menus. PhD thesis, Toronto, Ont., Canada, Canada, 1993. UMI Order No. GAXNN-82896. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Kurtenbach, G., Moran, T. Contextual animation of gestural commands. In Eurographics Computer Graphics Forum. Vol. 13(5), CHI '10 (1994), 305--314.",
      "doi": ""
    },
    {
      "text": "Marshall, P., Morris, R., Rogers, Y., Kreitmayer, S., and Davies, M. Rethinking 'multi-user': an in-the-wild study of how groups approach a walk-up-and-use tabletop interface. CHI '11, ACM (2011), 3033--3042.  ",
      "doi": "10.1145/1978942.1979392"
    },
    {
      "text": "Mulder, A. Hand gestures for HCI. Tech report 96-I. (1996).",
      "doi": ""
    },
    {
      "text": "Müller, J., Alt, F., Michelis, D., and Schmidt, A. Requirements and design space for interactive public displays. In ACM MM '10 (2010), 1285--1294.  ",
      "doi": "10.1145/1873951.1874203"
    },
    {
      "text": "Müller, J., Walter, R., Bailly, G., Nischt, M., and Alt, F. Looking glass: a field study on noticing interactivity of a shop window. In ACM CHI '12 (2012), 297--306.  ",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "Perry, M., Beckett, S., O'Hara, K., and Subramanian, S. Wavewindow: public, performative gestural interaction. In ACM ITS '10 (2010), 109--112.  ",
      "doi": "10.1145/1936652.1936672"
    },
    {
      "text": "Reeves, S., Benford, S., O'Malley, C., and Fraser, M. Designing the spectator experience. In ACM CHI '05 (2005), 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Rico, J., and Brewster, S. Gestures all around us: user differences in social acceptability perceptions of gesture based interfaces. In MobileHCI '09, ACM (New York, NY, USA, 2009), 64:1--64:2.  ",
      "doi": "10.1145/1613858.1613936"
    },
    {
      "text": "Sodhi, R., Benko, H., and Wilson, A. Lightguide: projected visualizations for hand movement guidance. In ACM CHI '12 (2012), 179--188.  ",
      "doi": "10.1145/2207676.2207702"
    },
    {
      "text": "Ten Koppel, M., Bailly, G., Müller, J., and Walter, R. Chained displays: configurations of public displays can be used to influence actor-, audience-, and passer-by behavior. In ACM CHI '12 (2012), 317--326.  ",
      "doi": "10.1145/2207676.2207720"
    },
    {
      "text": "Vogel, D., and Balakrishnan, R. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In ACM UIST'04 (2004), 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Wigdor, D., and Wixon, D. Brave NUI World: Designing Natural User Interfaces for Touch and Gesture. Morgan Kaufmann. Elsevier Science, (2011). ",
      "doi": "10.5555/1995309"
    },
    {
      "text": "Wilson, A. D. Robust computer vision-based detection of pinching for one and two-handed gesture input. In ACM UIST '06 (2006), 255--258.  ",
      "doi": "10.1145/1166253.1166292"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In ACM CHI '09 (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wu, M., Shen, C., Ryall, K., Forlines, C., and Balakrishnan, R. Gesture registration, relaxation, and reuse for multi-point direct-touch surfaces. In TABLETOP '06, IEEE Computer Society (2006), 185--192.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    },
    {
      "text": "Zhao, S., Agrawala, M., and Hinckley, K. Zone and polygon menus: using relative position to increase the breadth of multi-stroke marking menus. In ACM CHI'06 (2006), 1077--1086.  ",
      "doi": "10.1145/1124772.1124933"
    },
    {
      "text": "Zhao, S., and Balakrishnan, R. Simple vs. compound mark hierarchical marking menus. In ACM UIST '04 (2004), 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}