{
  "doi": "10.1145/2470654.2470690",
  "title": "Gesture studio: authoring multi-touch interactions through demonstration and declaration",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "257-266",
  "year": 2013,
  "badges": [],
  "abstract": "The prevalence of multi-touch devices opens the space for rich interactions. However, the complexity for creating multi-touch interactions hinders this potential. In this paper, we present Gesture Studio, a tool for creating multi-touch interaction behaviors by combining the strength of two distinct but complementary approaches: programming by demonstration and declaration. We employ an intuitive video-authoring metaphor for developers to demonstrate touch gestures, compose complicated behaviors, test these behaviors in the tool and export them as source code that can be integrated into the developers' project.",
  "authors": [
    {
      "name": "Hao Lü",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351594340",
      "orcid": "missing"
    },
    {
      "name": "Yang Li",
      "institution": "Google Research, Mountain View, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Apple iPad. http://www.apple.com/ipad/.",
      "doi": ""
    },
    {
      "text": "Google Nexus. http://www.google.com/nexus/.",
      "doi": ""
    },
    {
      "text": "Hartmann, B., Abdulla, L., Mittal, M., and Klemmer, S. R. Authoring sensor-based interactions by demonstration with direct manipulation and pattern recognition. Proc. CHI 2007, ACM Press (2007), 145--154.  ",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Hinrichs, U. and Carpendale, S. Gestures in the wild: studying multi-touch gesture sequences on interactive tabletop exhibits. Proc. CHI 2011, ACM Press (2011), 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Hudson, S. E. and Newell, G. L. Probabilistic state machines: dialog management for inputs with uncertainty. Proc. UIST 1992, ACM Press (1992), 199--208.  ",
      "doi": "10.1145/142621.142650"
    },
    {
      "text": "iPhone 4. http://en.wikipedia.org/wiki/IPhone_4.",
      "doi": ""
    },
    {
      "text": "Khandkar, S. H. and Maurer, F. A language to define multitouch interactions. Proc. ITS 2010, ACM Press (2010), 269--270.  ",
      "doi": "10.1145/1936652.1936710"
    },
    {
      "text": "Kin, K., Hartmann, B., DeRose, T., and Agrawala, M. Proton: Multitouch Gestures as Regular Expressions. Proc. CHI 2012, ACM Press (2012).  ",
      "doi": "10.1145/2207676.2208694"
    },
    {
      "text": "Kin, K., Hartmann, B., DeRose, T., and Agrawala, M. Proton++: a customizable declarative multitouch framework. Proc. UIST 2012, ACM Press (2012), 477--486.  ",
      "doi": "10.1145/2380116.2380176"
    },
    {
      "text": "Lau, T. Programming by Demonstration: a Machine Learning Approach. Ph.D. Dissertation. University of Washington, Seattle, WA, USA. 2001. ",
      "doi": "10.5555/934057"
    },
    {
      "text": "Leshed, G., Haber, E. M., Matthews, T., and Lau, T. CoScripter: automating & sharing how-to knowledge in the enterprise. Proc. CHI 2008, ACM Press (2008), 1719--1728.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Li, Y., Cao, X., Everitt, K., Dixon, M., and Landay, J. A. FrameWire: a tool for automatically extracting interaction logic from paper prototyping tests. Proc. CHI 2010, ACM Press (2010), 503--512.  ",
      "doi": "10.1145/1753326.1753401"
    },
    {
      "text": "Lieberman, H. E. Your Wish Is My Command: Programming by Example. Morgan Kaufmann, San Francisco, CA, USA, 2001.",
      "doi": "10.5555/369505.369520"
    },
    {
      "text": "Lü, H. and Li, Y. Gesture coder: a tool for programming multitouch gestures by demonstration. Proc. CHI 2012, ACM Press (2012), 2875--2884.  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Motorola Xoom. http://developer.motorola.com/products/xoom/.",
      "doi": ""
    },
    {
      "text": "Myers, B. A. Creating user interfaces by demonstration. Academic Press, 1988. ",
      "doi": "10.5555/43392"
    },
    {
      "text": "Rubine, D. Specifying gestures by example. ACM SIGGRAPH Computer Graphics 25, 4 (1991), 329--337.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "Scholliers, C., Hoste, L., Signer, B., and De Meuter, W. Midas: a declarative multi-touch interaction framework. Proc. TEI 2011, ACM Press (2011), 49--56.  ",
      "doi": "10.1145/1935701.1935712"
    },
    {
      "text": "Schwarz, J., Hudson, S., Mankoff, J., and Wilson, A. D. A framework for robust and flexible handling of inputs with uncertainty. Proc. UIST 2010, ACM Press (2010), 47--56.  ",
      "doi": "10.1145/1866029.1866039"
    },
    {
      "text": "Schwarz, J., Mankoff, J., and Hudson, S. Monte carlo methods for managing interactive state, action and feedback under uncertainty. Proc. UIST 2011, ACM Press (2011), 235--244.  ",
      "doi": "10.1145/2047196.2047227"
    },
    {
      "text": "Cypher, A., ed. Watch What I Do: Programming by Demonstration. MIT Press, 1993. ",
      "doi": "10.5555/168080"
    }
  ]
}