{
  "doi": "10.1145/2470654.2481366",
  "title": "Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2647-2656",
  "year": 2013,
  "badges": [],
  "abstract": "In the field of mental health care technologies, very limited attention has been given to the design of interventions for individuals who undergo treatment for severe mental health problems in intense care contexts. Exploring novel designs to engage vulnerable psychiatric patients in therapeutic skills practice and expanding on the potential of technology to promote mental health, the paper introduces the design concept of the Spheres of Wellbeing. A set of interactive artifacts is developed specifically for women with a dual diagnosis of a Learning Disability and Borderline Personality Disorder, living in the medium secure services of a forensic hospital in the UK. The women present a difficult to treat group due to extremely challenging behaviors and a fundamental lack of motivation to engage in therapy. The Spheres are designed to assist the women in practices of mindfulness, to help them tolerate emotional distress and to strengthen their sense of self, all of which are vital components of their specialist treatment Dialectical Behavioral Therapy (DBT). The Spheres are intended to supplement the therapy of the women and to contribute to our understanding of designing technology to enhance mental wellbeing and quality of life more generally.",
  "authors": [
    {
      "name": "Anja Thieme",
      "institution": "Newcastle University, Newcastle upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482659504",
      "orcid": "0000-0002-9639-5531"
    },
    {
      "name": "Jayne Wallace",
      "institution": "Northumbria University, Newcastle upon Tyne, UK",
      "img": "/do/10.1145/contrib-81318496730/rel-imgonly/jayne_sm.jpg",
      "acmid": "81318496730",
      "orcid": "missing"
    },
    {
      "name": "Paula Johnson",
      "institution": "Calderstones Partnership NHS Foundation Trust, Whalley, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558289256",
      "orcid": "missing"
    },
    {
      "name": "John McCarthy",
      "institution": "University College Cork, Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406600199",
      "orcid": "missing"
    },
    {
      "name": "Siân Lindley",
      "institution": "Microsoft Research, Cambridge, Cambridgeshire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100028041",
      "orcid": "missing"
    },
    {
      "name": "Peter Wright",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, UK",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    },
    {
      "name": "Thomas D. Meyer",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556834956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aitken, G. and Logan, C. Dangerous Women? A UK response. In Feminism & Psychology 14, 2 (2004), 262--269.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. Borderline personality disorder - Diagnostic and Statistical Manual of Mental Disorders (DSM-IV-TR), 1994.",
      "doi": ""
    },
    {
      "text": "Arettam, J. Dharma Beads: Making and Using Your Own Buddhist Malas. Tuttle Publishing, 2000.",
      "doi": ""
    },
    {
      "text": "Baer, R. A. Mindfulness training as a clinical intervention: A conceptual and empirical review. In Clinical Psychology: Science and Practice 10 (2003), 125--143.",
      "doi": ""
    },
    {
      "text": "Belk, R. W. Possessions and the extended self. In Journal of Consumer Research 15, 2 (1988), 139--168.",
      "doi": ""
    },
    {
      "text": "Chilvers, J., Thomas, C., and Stanbury, A. The impact of a ward-based mindfulness programme on recorded aggression in a medium secure facility for women with learning disabilities. In Journal of Learning Disability and Offending Behavior 2, 1 (2011), 27--41.",
      "doi": ""
    },
    {
      "text": "Coyle, D. and Doherty, G. Clinical evaluations and collaborative design: Developing new technologies for mental healthcare interventions. In Proc. CHI 2009, 2051--2060.  ",
      "doi": "10.1145/1518701.1519013"
    },
    {
      "text": "Clayton, P. From insecure attachment to (partial) inter-subjectivity (fearful aloneness to safely being with others). In Journal of Learning Disability and Offending Behaviour 1, 1 (2010), 33--43.",
      "doi": ""
    },
    {
      "text": "Dickson-Swift, V., James, E. L., Kippen, S., and Liamputtong, P. Doing sensitive research: what challenges do qualitative researchers face? In Qualitative Research 7, 3 (2007), 327--353.",
      "doi": ""
    },
    {
      "text": "Doherty, G., Colye, D., and Matthews, M. Design and evaluation guidelines for mental health technologies. In Interacting with Computers 22 (2010), 243--242.  ",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Doherty, G., Colye, D., and Sharry, J. Engagement with online mental health interventions: An exploratory study of a treatment for depression. In Proc. CHI 2012, 1421--1430.  ",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Dunn, B. R., Hartigan, J. A., and Mikulas, W. L. Concentration and mindfulness meditations: Unique forms of Consciousness? Applied Psychophysiology and Biofeedback 24, 3 (1999), 147--165.",
      "doi": ""
    },
    {
      "text": "Durbin, L. S. The history of beads: From 100,000 B.C. to the present. ABRAMS, 2009.",
      "doi": ""
    },
    {
      "text": "Galvin, M. Understanding and Designing Wellbeing in Relation to our Material Environment. In DIS 2012 Workshop Designing Wellbeing.",
      "doi": ""
    },
    {
      "text": "Johnson, R., Rogers, Y., van der Linden, J., and Bianchi-Berthouze, N. Being in the thick of in-the-wild studies: The challenges and insights of researcher participation. In Proc. CHI 2012, 1125--1144.  ",
      "doi": "10.1145/2207676.2208561"
    },
    {
      "text": "Kabat-Zinn, J. Full catastrophe living: How to cope with stress, pain and illness using mindfulness meditation (15th edition). Piatkus, 2009.",
      "doi": ""
    },
    {
      "text": "Kessler, R. C., et al. Lifetime prevalence and age-of-onset distributions of mental disorders in the World Health Organization's World Mental Health Survey Initiative. In World Psychiatry 6 (2007), 168--176.",
      "doi": ""
    },
    {
      "text": "Lew, M., Matta, C., Tripp-Tebo, C., and Watts, D. DBT for individuals with intellectual disabilities: a programme description. In Mental Health Aspects of Developmental Disabilities 9 (2006), 1--12.",
      "doi": ""
    },
    {
      "text": "Lieb, K., Zanarini, M. C., Schmahl, C., Linehan, M. M. and Bohus, M. Borderline personality disorder. In Lancet 364 (2004), 53--461.",
      "doi": ""
    },
    {
      "text": "Liebmann, M. Art therapy and anger. Jessica Kingsley, 2008.",
      "doi": ""
    },
    {
      "text": "Linehan, M. M. Cognitive-behavioral treatment for borderline personality disorders. Guilford, 1993.",
      "doi": ""
    },
    {
      "text": "Linehan, M. M.. Skills Training Manual for Treating Borderline Personality Disorder. Guilford, 1993.",
      "doi": ""
    },
    {
      "text": "Lönnebo, M., Welin, C., and Johansson, C. Pearls of Life: for the personal spiritual journey. Wild Goose Publications, 2007.",
      "doi": ""
    },
    {
      "text": "Miller, D. The comfort of things. Polity Press, 2008.",
      "doi": ""
    },
    {
      "text": "Morrissey, C., and Ingamells, B. Adapted dialectical behaviour therapy for male offenders with intellectual disability in a high secure environment: six years on. In Journal of Learning Disability and Offending Behaviour 2, 1 (2011), 10--17.",
      "doi": ""
    },
    {
      "text": "Palmer, R. K. L. Dialectic behaviour therapy for borderline personality disorder. In Advances in Psychiatric Treatment 8 (2002), 10--16.",
      "doi": ""
    },
    {
      "text": "Pykhtina, O. et al. Magic Land: The design and evaluation of an interactive tabletop supporting therapeutic play with children. In Proc. DIS 2012, 136--145.  ",
      "doi": "10.1145/2317956.2317978"
    },
    {
      "text": "Robertson, B. The adaption and application of mindfulness-based psychotherapeutic practices for individuals with intellectual disabilities. In Advances in Mental Health and Intellectual Disabilities 5, 5 (2011), 46--52.",
      "doi": ""
    },
    {
      "text": "Sa, M., and Carrico, L. Fear therapy for children - A mobile approach. In Proc. EICS 2012, 237--246.  ",
      "doi": "10.1145/2305484.2305524"
    },
    {
      "text": "Sakdalan, J. A., Shaw, J., and Collier, V. Staying in the here-and-now: A pilot study on the use of dialectical behaviour therapy group skills training for forensic clients with intellectual disability. In Journal of Intellectual Disability Research 54, 6 (2010), 568--572.",
      "doi": ""
    },
    {
      "text": "Shaw, C., Gromala, D., and Fleming Seay, A. The Meditation Chamber: Enacting autonomic senses. In Proc. of ENACTIVE/07, 2007.",
      "doi": ""
    },
    {
      "text": "Simpson, E. B., et al. Focus on women: Use of dialectical behavioral therapy in a partial hospital environment program for women with borderline personality disorder. In Psychiatric Services 49 (1998), 669--673.",
      "doi": ""
    },
    {
      "text": "Soler, J., et al. Dialectical behaviour therapy skills training compared to standard group therapy in borderline personality disorder: A 3-month randomised controlled clinical trial. In Behaviour Research and Therapy 47 (2009), 353--358.",
      "doi": ""
    },
    {
      "text": "Swenson, C. R. How can we account for DBT's widespread popularity? In Clinical Psychology: Science and Practice 7 (2000), 87--91.",
      "doi": ""
    },
    {
      "text": "Thieme, A., et al. Lover's box: Designing for reflection within romantic relationships. In International Journal of Human Computer Studies, 69, 5 (2011), 283--297.  ",
      "doi": "10.1016/j.ijhcs.2010.12.006"
    },
    {
      "text": "Verheul, R., et al. Dialectical behaviour therapy for women with borderline personality disorder: 12-month, randomised clinical trial in the Netherlands. In British Journal of Psychiatry 182 (2003), 135--140.",
      "doi": ""
    },
    {
      "text": "Vidyarthi, J., Riecke, B. E., and Gromala, D. Sonic Cradle: Designing for immersive experience of meditation by connecting respiration to music. In Proc. DIS 2012, 408--417.  ",
      "doi": "10.1145/2317956.2318017"
    },
    {
      "text": "Wallace, J., Thieme, A., Wood, G., Schofield, G., and Olivier, P. Enabling self, intimacy and a sense of home in dementia: An enquiry into design in a hospital setting. In Proc. CHI 2012, 2629--2638.  ",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Williams, M., Teasdale, J., Segal, Z., and Kabat-Zinn, J. The mindfulness way through depression. Guilford Press, 2007.",
      "doi": ""
    },
    {
      "text": "World Health Organisation Promoting Mental Health. Concepts emerging evidence and practice. Summary report. Geneva: World Health Organisation, 2004.",
      "doi": ""
    },
    {
      "text": "Wrzesien, M., Raya, M. A., Burkhardt, J.-M., and Botella, C. Mixing Psychology and HCI in evaluation of augmented reality mental health technology. In Ext. Abstracts CHI 2011, 2119--2124.  ",
      "doi": "10.1145/1979742.1979898"
    },
    {
      "text": "Yen, S., Zlotnick, C., and Costello, E. Affect regulation in women with borderline personality disorder traits. In The Journal of Nervous and Mental Disease 100, 10 (2002), 693--696.",
      "doi": ""
    }
  ]
}