{
  "doi": "10.1145/2470654.2470700",
  "title": "Digital motherhood: how does technology help new mothers?",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "313-322",
  "year": 2013,
  "badges": [],
  "abstract": "New mothers can experience social exclusion, particularly during the early weeks when infants are solely dependent on their mothers. We used ethnographic methods to investigate whether technology plays a role in supporting new mothers. Our research identified two core themes: (1) the need to improve confidence as a mother; and (2) the need to be more than \\'18just' a mother. We reflect on these findings both in terms of those interested in designing applications and services for motherhood and also the wider CHI community.",
  "tags": [
    "ethnography",
    "new mothers",
    "motherhood",
    "social support"
  ],
  "authors": [
    {
      "name": "Lorna Gibson",
      "institution": "University of Dundee, Dundee, UK",
      "img": "/do/10.1145/contrib-81100256346/rel-imgonly/lgibson.jpg",
      "acmid": "81100256346",
      "orcid": "missing"
    },
    {
      "name": "Vicki L. Hanson",
      "institution": "University of Dundee, Dundee, UK",
      "img": "/do/10.1145/contrib-81100646151/rel-imgonly/vicki-1-square.jpg",
      "acmid": "81100646151",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Avan, B., Richter, L.M., Ramchandani, P.G., Norris, S.A., and Stein, A. Maternal postnatal depress and children's growth and behaviour during the early years of life: exploring the interaction between physical and mental health. Archives of Disease in Childhood, 95, (2010), 690--695.",
      "doi": ""
    },
    {
      "text": "Barclay, L., Everitt, L., Rogan, F., Shmied, V., and Wyllie, A. \\'1cBecoming a mother\\'1d -- an analysis of women's experience of early motherhood. Journal of Advanced Nursing, 25, (1997), 719--728.",
      "doi": ""
    },
    {
      "text": "BabyCenter. BabyCentre's \\'1c2011 21st Century Mum Report\\'1d. 22 September 2011. URL: http://www.investegate.co.uk/article.aspx?id=20110922 11000571560. Last accessed on 3rd September 2012.",
      "doi": ""
    },
    {
      "text": "Brady, E., and Guerin, S. \\'1cNot the Romantic, All Happy, Coochy Coo Experience\\'1d: A Qualitative Analysis of Interactions on an Irish Parenting Web Site. Family Relations: Interdisciplinary Journal of Applied Family Studies, (2010) 15, 14--27.",
      "doi": ""
    },
    {
      "text": "Bernhardt, J.M., and Felter, E.M. Online Pediatric Information Seeking Among Mothers of Young Children: Results From a Qualitative Study Using Focus Groups. Journal of Medical Internet Research (2004) 6,1.",
      "doi": ""
    },
    {
      "text": "Borning, A. and Muller, M. Next Steps for Value Sensitive Design. Proc. CHI 2012, ACM Press (2012), 1125--1134.  ",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Daneback, K., and Plantin, L. Research on Parenthood and the Internet: Themes and Trends. Journal of Psychosocial Research on Cyberspace (Cyberpsychology), (2008), 2(2), article 2.",
      "doi": ""
    },
    {
      "text": "Dennis, C., and Chung-Lee, L. Postpartum Depression Help-Seeking Barriers and Maternal Treatment Preferences: A Qualitative Systematic Review. Birth, (2006), 33(4), 323--331.",
      "doi": ""
    },
    {
      "text": "Ecology -- Ecology Global Network. Birth and Death Data. URL: http://www.ecology.com/birth-death-rates/. Last accessed 30th December 2012.",
      "doi": ""
    },
    {
      "text": "Furman, L., and O'Riordan, M. How do mothers feel about their very low birth weight infants? Development of a new measure. Infant Mental Health Journal 27(2), (2006), 152--172.",
      "doi": ""
    },
    {
      "text": "Glaser, B.G., and Strauss, A.L. The discovery of grounded theory: strategies for qualitative research. Aldine Transaction, New Jersey (2006).",
      "doi": ""
    },
    {
      "text": "Halligan, S.L., Murray, L., Martins, C., and Cooper, P.J. Maternal depression and psychiatric outcomes in adolescent offsprint: A 13-year longitudinal study. Journal of Affective Disorders 97 (2007), 145--154.",
      "doi": ""
    },
    {
      "text": "Hui, M., Ly, C., and Neustaedter, C. MammiBelli: Sharing Baby Activity Levels Between Expectant Mothers and Their Intimate Social Groups. Proc. EA CHI 2012, ACM Press (2012), 1649--1654.  ",
      "doi": "10.1145/2212776.2223687"
    },
    {
      "text": "Jomhari, N., Gonzalez, V.M., and Kurniawan, S.H. See the Apple of My Eye: Baby Storytelling in Social Space. Proc. BCS HCI People and Computers XXIII, (2009), 238--243. ",
      "doi": "10.5555/1671011.1671040"
    },
    {
      "text": "Larsson, M. A descriptive study of the use of the Internet by women seeking pregnancy-related information. Midwifery, 25 (2009), 14--20.",
      "doi": ""
    },
    {
      "text": "Leigh, B., and Milgrom, J. Risk factors for antenatal depression, postnatal depression and parenting stress. BMC Psychiatry, (2008) 8, 24.",
      "doi": ""
    },
    {
      "text": "Madge, C., & O'Connor, H. Parenting gone wired: empowerment of new mothers on the internet? Social & Cultural Geography, (2006) 7:02, 199--220.",
      "doi": ""
    },
    {
      "text": "McDaniel, B.T., Coyne, S.M., and Holmes, E.K. New Mothers and Media Use: Associations Between Blogging, Social Networking, and Maternal Well-Being. Maternal and Child Health Journal, (2012), 16(7), 1509--17.",
      "doi": ""
    },
    {
      "text": "Meadows, S. The association between perceptions of social support and maternal mental health: A cumulative perspective. Journal of Family Issues, (2011), 32, 181208.",
      "doi": ""
    },
    {
      "text": "MIND. URL: http://www.mind.org.uk. Last accessed on 30th December 2012.",
      "doi": ""
    },
    {
      "text": "Mothercare. URL: http://www.mothercare.com. Last accessed on 30th December 2012.",
      "doi": ""
    },
    {
      "text": "Netmums. URL: http://www.netmums.com. Last accessed on 3rd September 2012",
      "doi": ""
    },
    {
      "text": "Nielsenwire. Infographic: Getting to know (and Like) the Social Mum. URL: http://blog.nielsen.com/nielsenwire/online_mobile/gettin g-to-know-and-like-the-social-mom/ Oct 25th 2011. Last accessed 30th December 2012.",
      "doi": ""
    },
    {
      "text": "Nielsenwire. Infographic: The Digital Lives of American Moms. URL:http:// http://blog.nielsen.com/nielsenwire/online_mobile/digita l-lives-of-american-moms/ May 11, 2012. Last accessed 3rd September 2012.",
      "doi": ""
    },
    {
      "text": "Nolan, M.L., Mason, V., Snow, S., Messenger, W., Catling, J., and Upton, P. Making Friends at Antenatal Classes: A Qualitative Exploration of Friendship Across the Transition to Motherhood. The Journal of Perinatal Education, (2012), 21(3), 178--185.",
      "doi": ""
    },
    {
      "text": "Sarkadi, A., and Bremberg, S. Socially unbiased parenting support on the Internet: a cross-sectional study of users of a large Swedish parenting website. Child: Care, Health and Development (2004) 31, 1, 43--52.",
      "doi": ""
    },
    {
      "text": "Social Issues Research Centre. Changing Face of Motherhood. (2011).",
      "doi": ""
    },
    {
      "text": "Thomas, J.O., Rankin, Y.A., Tuta, M., and Mibuari, E. Supporting Greater Access to Pre- and Post-natal information and Services for Women in Rural Kenya. Proc. CHI 2011, ACM Press (2011), 2353--2358.  ",
      "doi": "10.1145/1979742.1979940"
    }
  ]
}