{
  "doi": "10.1145/2470654.2466220",
  "title": "Talking about tactile experiences",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1659-1668",
  "year": 2013,
  "badges": [],
  "abstract": "A common problem with designing and developing applications with tactile interfaces is the lack of a vocabulary that allows one to describe or communicate about haptics. Here we present the findings from a study exploring participants' verbalizations of their tactile experiences across two modulated tactile stimuli (16Hz and 250Hz) related to two important mechanoreceptors in the human hand. The study, with 14 participants, applied the explicitation interview technique to capture detailed descriptions of the diachronic and synchronic structure of tactile experiences. We propose 14 categories for a human-experiential vocabulary based on the categorization of the findings and tie them back to neurophysiological and psychophysical data on the human hand. We finally discuss design opportunities created through this experiential understanding in relation to the two mechanoreceptors.",
  "authors": [
    {
      "name": "Marianna Obrist",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/do/10.1145/contrib-81328489919/rel-imgonly/mariannaobrist.jpg",
      "acmid": "81328489919",
      "orcid": "0000-0002-4009-1627"
    },
    {
      "name": "Sue Ann Seah",
      "institution": "University of Bristol, Bristol, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558018556",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, UK",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Marshall, M. T., and Subramanian. S. Adding Haptic Feedback to Mobile TV. EA CHI '11, ACM, 1975--1980.  ",
      "doi": "10.1145/1979742.1979899"
    },
    {
      "text": "Bolanowski, S. J., Gescheider, G. A, Verrillo, R. T, and Checkosky, C. M. Four channel mediate the mechanical aspects of touch. Journal of Acoustical Society of America, 84(5) (1988), 1680--1694.",
      "doi": ""
    },
    {
      "text": "Brown, L., and Kaye, J. 'J.' Eggs-ploring the influence of material properties on haptic experience. HAID '07.",
      "doi": ""
    },
    {
      "text": "Byrt, T. How Good Is That Agreement? Epidemiology, 7(5) (1996), 561.",
      "doi": ""
    },
    {
      "text": "Cahour, B., and Salembier, P. 2012. The user phenomenological Experience; evoking the lived activity with \"re-situating\" interviews, CHI 2012.",
      "doi": ""
    },
    {
      "text": "Chang, A., and Ishii, H. Sensorial interfaces. DIS '06. ACM, 50--59.  ",
      "doi": "10.1145/1142405.1142415"
    },
    {
      "text": "Choi, K., and Jun, C. A systematic approach to the Kansei factors of tactile sense regarding the surface roughness. Applied Ergonomics, 38 (1) (2007), 53--63.",
      "doi": ""
    },
    {
      "text": "Dagman, J., Karlsson, M. A., and Wikström L. Investigating the haptic aspects of verbalised product experiences. Intern. J. of Design, 4(3) (2010), 15--27.",
      "doi": ""
    },
    {
      "text": "Enriquez, M., MacLean, K., and Chita, C. Haptic phonemes: basic building blocks of haptic communication. ICMI '06. ACM, 302--309.  ",
      "doi": "10.1145/1180995.1181053"
    },
    {
      "text": "Gallace, A., and Spence, C. The Cognitive and Neural Correlates of Tactile Memory. Psychophysical Bulletin, 135(3) (2009), 380--406.",
      "doi": ""
    },
    {
      "text": "Gescheider, G. A, Wright, J. H., and Verrillo, R. T. Information-Processing Channels in the Tactile Sensory System: A Psychophysical and Physiological Analysis. New York: Taylor & Francis, 2009.",
      "doi": ""
    },
    {
      "text": "Gescheider, G. A., Bolanowski, S. J., Pope, J. V., and Verrillo, R. T. A four-channel analysis of the tactile sensitivity of the fingertip: frequency selectivity, spatial summation, and temporal summation. Somatosensory and Motor Research, 19(2) (2002), 114--124.",
      "doi": ""
    },
    {
      "text": "Gescheider, G. A., Bolanowski, S. J., and Hardick, K. R. The frequency selectivity of information-processing channels in the tactile sensory system. Somatosensory and Motor Research, 18(3) (2001), 191--201.",
      "doi": ""
    },
    {
      "text": "Hoshi, T., Takahashi, M., Iwamoto, T., and Shinoda, H. Noncontact Tactile Display Based on Radiation Pressure of Airborne Ultrasound. IEEE Tran. on Haptics, 3(3) (2010), 155--165.  ",
      "doi": "10.1109/TOH.2010.4"
    },
    {
      "text": "Jansson-Boyd, C. V. Touch matters: exploring the relationship between consumption and tactile interaction. Social Semiotics. 21(4) (2011), 531--546.",
      "doi": ""
    },
    {
      "text": "Johnson, K. O. The roles and functions of cutaneous mechanoreceptors. Neurobiology, 11 (2001), 455--461.",
      "doi": ""
    },
    {
      "text": "Johnson, K. O., Yoshioka, T., and Vega-Bermudez, F. Tactile Functions of Mechanoreceptive Afferents Innervating the Hand. Journal of Clinical Neurophysiology, 17(6) (2000), 539--558.",
      "doi": ""
    },
    {
      "text": "Johansson, R. S., and Vallbo, A. B. Tactile sensibility in the human hand: relative and absolute densities of four types of mechanoreceptive units in glabrous skin. Journal Physiology, 286 (1979), 283--300.",
      "doi": ""
    },
    {
      "text": "Katz, D. The world of touch. Krueger, L. E. (Ed). Hillsdale, NJ: Erlbaum, 1989.",
      "doi": ""
    },
    {
      "text": "Kildal, J. Kooboh: Variable Tangible Properties in a Handheld Haptic-Illusion Box. Haptics: Perc., Devices, Mobility, and Comm., LNCS, 7283 (2012), 191--194.  ",
      "doi": "10.1007/978-3-642-31404-9_33"
    },
    {
      "text": "Lederman, S. J., and Klatzky, R. L. Hand movements: A window into haptic object recognition. Cognitive Psychology, 19 (1987), 342--368.",
      "doi": "10.1016/0010-0285%2887%2990008-"
    },
    {
      "text": "Lennertz, R. C., Tsunozaki, M., Bautista, D. M., and Stucky, C. L. Physiological basis of tingling paresthesia evoked by hydroxy-alpha-sanshool. J Neurosci. 30(12) (2010), 4353--4361.",
      "doi": ""
    },
    {
      "text": "Light, A. Adding method to meaning: A Technique for exploring peoples' experiences with technology. Beh. & Information Technology, 25 (06) (2006), 175--187.",
      "doi": ""
    },
    {
      "text": "Mountcastle, V. B. The sensory hand: neural mechanisms of somatic sensation. Cambridge, MA: Harvard University Press, 2005.",
      "doi": ""
    },
    {
      "text": "Mousette, C. Simple Haptics: Sketching Perspectives for the design of Haptic Interactions, PhD Thesis, Umea University, Oct-2012.",
      "doi": ""
    },
    {
      "text": "Ochoa, J. L., Torebjörk, H. E. Paraesthesiae from ectopic impulse generation in human sensory nerves. Brain 103 (1980), 835--853.",
      "doi": ""
    },
    {
      "text": "O'Sullivan, C., and Chang, A. An Activity Classification for Vibrotactile Phenomena. HAID '06, 145--156.  ",
      "doi": "10.1007/11821731_14"
    },
    {
      "text": "Pasquero, J., and Hayward, V. Tactile feedback can assist vision during mobile interactions. CHI '11. ACM, 3277--3280.  ",
      "doi": "10.1145/1978942.1979427"
    },
    {
      "text": "Petitmengin, C. Describing one's Subjective Experience in the Second Person. An Interview Method for the Science of Consciousness. Phenomenology and the Cognitive Sciences, 5 (2006), 229--269.",
      "doi": ""
    },
    {
      "text": "Sonneveld, M. H., and Schifferstein. H. N. J. The tactual experience of objects. In Schifferstein, H. N. J., Hekkert, P. (Eds.). Product Experience. Elsevier, 2008, 41--67.",
      "doi": ""
    },
    {
      "text": "Schifferstein, H. N. J. Multi sensory design. In Proc. DESIRE '11. ACM, 361--362.  ",
      "doi": "10.1145/2079216.2079270"
    },
    {
      "text": "Spence, Charles (2010). The multisensory perception of flavor. In the Psychologist (Sept. 2010), 23(9), 720--723.",
      "doi": ""
    },
    {
      "text": "Syrdal, D., Dautenhahn, K., Koay, K., Walters, M. and Otero, N. Exploring human mental models of robots through explicitation interviews. RO-MAN '10, 638--645.",
      "doi": ""
    },
    {
      "text": "Tosey, P., and Mathison, J. Exploring inner landscapes through psychophenomenology. Qual. Research in Organiz. & Management: Inter. J., 5(1) (2010), 63--82.",
      "doi": ""
    },
    {
      "text": "Vermersch, P. L'entretien d'explicitation, ESF, 1994.",
      "doi": ""
    },
    {
      "text": "Vermersch, P., and Maurel, M., Pratiques de l'entretien d'explicitation, ESF, 1997.",
      "doi": ""
    },
    {
      "text": "Williams, L., and Ackerman, J., Please touch the merchandise. Harvard Business Review, 2011.",
      "doi": ""
    },
    {
      "text": "Verrillo, R. T., Bolanowski, S. J. Jr. The effects of skin temperature on the psychophysical responses to vibration on glabrous and hairy skin. Journal of the Acoustical Society of America, 80(2) (1986), 528--32.",
      "doi": ""
    },
    {
      "text": "Wilson, G., Halvey, M., Brewster, S. A., and Hughes, S. A. Some like it hot: thermal feedback for mobile devices. Proc. CHI '11, ACM, 2555--2564.  ",
      "doi": "10.1145/1978942.1979316"
    }
  ]
}