{
  "doi": "10.1145/2470654.2481364",
  "title": "Designing mobile health technology for bipolar disorder: a field trial of the monarca system",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2627-2636",
  "year": 2013,
  "badges": [],
  "abstract": "An increasing number of pervasive healthcare systems are being designed, that allow people to monitor and get feedback on their health and wellness. To address the challenges of self-management of mental illnesses, we have developed the MONARCA system - a personal monitoring system for bipolar patients. We conducted a 14 week field trial in which 12 patients used the system, and we report findings focusing on their experiences. The results were positive; compared to using paper-based forms, the adherence to self-assessment improved; the system was considered very easy to use; and the perceived usefulness of the system was high. Based on this study, the paper discusses three HCI questions related to the design of personal health technologies; how to design for disease awareness and self-treatment, how to ensure adherence to personal health technologies, and the roles of different types of technology platforms.",
  "authors": [
    {
      "name": "Jakob E. Bardram",
      "institution": "IT University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100082111/rel-imgonly/2017.bardram.3.jpg",
      "acmid": "81100082111",
      "orcid": "missing"
    },
    {
      "name": "Mads Frost",
      "institution": "IT University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496641070",
      "orcid": "missing"
    },
    {
      "name": "Károly Szántó",
      "institution": "IT University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496690143",
      "orcid": "missing"
    },
    {
      "name": "Maria Faurholt-Jepsen",
      "institution": "University Hospital of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556902456",
      "orcid": "missing"
    },
    {
      "name": "Maj Vinberg",
      "institution": "University Hospital of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558235056",
      "orcid": "missing"
    },
    {
      "name": "Lars Vedel Kessing",
      "institution": "University Hospital of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558009756",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. E. Bardram, M. Frost, K. Szántó, and G. Marcu. The monarca self-assessment system: a persuasive personal monitoring system for bipolar patients. In Proc. ACM SIGHIT International Health Informatics Symposium, IHI '12, pages 21--30, New York, NY, USA, 2012. ACM.  ",
      "doi": "10.1145/2110363.2110370"
    },
    {
      "text": "M. R. Basco and A. J. Rush. Cognitive-Behavioral Therapy for Bipolar Disorder. The Guilford Press, 2nd edition edition, 2005.",
      "doi": ""
    },
    {
      "text": "J. Bauer, S. Consolvo, B. Greenstein, J. Schooler, E. Wu, N. F. Watson, and J. Kientz. Shuteye: encouraging awareness of healthy sleep recommendations with a mobile, peripheral display. In Proc. ACM CHI 2012, CHI '12, pages 1401--1410, New York, NY, USA, 2012. ACM.  ",
      "doi": "10.1145/2207676.2208600"
    },
    {
      "text": "M. Bauer, P. Grof, N. Rasgon, T. Glenn, M. Alda, S. Priebe, R. Ricken, and P. C. Whybrow. Mood charting and technology: New approach to monitoring patients with mood disorders. Current Psychiatry Reviews, 2(4):423--429, 2006.",
      "doi": ""
    },
    {
      "text": "J. Bopp, D. Miklowitz, G. Goodwin, W. Stevens, J. Rendell, and J. Geddes. The longitudinal course of bipolar disorder as revealed through weekly text messaging: a feasibility study. Bipolar Disord, 12(3):327--334, 2010.",
      "doi": ""
    },
    {
      "text": "M. Burns, M. Begale, J. Duffecy, D. Gergle, C. Karr, E. Giangrande, and D. Mohr. Harnessing context sensing to develop a mobile intervention for depression. J Med Internet Res, 13(3), 2011.",
      "doi": ""
    },
    {
      "text": "S. Consolvo, D. W. McDonald, T. Toscos, M. Y. Chen, J. Froehlich, B. Harrison, P. Klasnja, A. LaMarca, L. LeGrand, R. Libby, I. Smith, and J. A. Landay. Activity sensing in the wild: a field trial of ubifit garden. In Proc. ACM CHI 2008, CHI '08, pages 1797--1806, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "D. Coyle, N. McGlade, G. Doherty, and G. O'Reilly. Exploratory evaluations of a computer game supporting cognitive behavioural therapy for adolescents. In Proc. ACM CHI 2011, CHI '11, pages 2937--2946, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/1978942.1979378"
    },
    {
      "text": "F. D. Davis. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly, 13(3):319--339, September 1989.  ",
      "doi": "10.2307/249008"
    },
    {
      "text": "A. K. Dey, K. Wac, D. Ferreira, K. Tassini, J.-H. Hong, and J. Ramos. Getting closer: an empirical investigation of the proximity of user to their smart phones. In Proc. UbiComp 2011, UbiComp '11, pages 163--172, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/2030112.2030135"
    },
    {
      "text": "G. Doherty, D. Coyle, and J. Sharry. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. In Proc. ACM CHI 2012, CHI '12, pages 1421--1430, New York, NY, USA, 2012. ACM.  ",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "P. Ferreira, P. Sanches, K. Höök, and T. Jaensson. License to chill!: how to empower users to cope with stress. In Proc. NordiCHI 2008, NordiCHI '08, pages 123--132, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1463160.1463174"
    },
    {
      "text": "J. Greenbaum and M. Kyng, editors. Design at Work Cooperative Design of Computer Systems. Lawrence Erlbaum Associates Publishers, Hillsdale, NJ, 1991. ",
      "doi": "10.5555/574738"
    },
    {
      "text": "L. Kessing. The effect of comorbid alcoholism on recurrence in affective disorder: a case register study. J Affect Disord, 53(1):49--55, 1999.",
      "doi": ""
    },
    {
      "text": "L. Kessing, L. Søndergard, K. Kvist, and P. Andersen. Adherence to lithium in naturalistic settings: results from a nationwide pharmacoepidemiological study. Bipolar Disord, 9(7):730--736, 2007.",
      "doi": ""
    },
    {
      "text": "T. A. Ketter. Diagnostic features, prevalence, and impact of bipolar disorder. J Clin Psychiatry, 71(6), June 2010.",
      "doi": ""
    },
    {
      "text": "N. D. Lane, T. Choudhury, A. Campbell, M. Mohammod, M. Lin, X. Yang, A. Doryab, H. Lu, S. Ali, and E. Berke. BeWell: A Smartphone Application to Monitor, Model and Promote Wellbeing. In Proc. Pervasive Health 2011. IEEE Press, 2011.",
      "doi": ""
    },
    {
      "text": "H. R. Lee, W. R. Panont, B. Plattenburg, J.-P. de la Croix, D. Patharachalam, and G. Abowd. Asthmon: empowering asthmatic children's self-management with a virtual pet. In Extended Abstracts of CHI 2010, CHI EA '10, pages 3583--3588, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1753846.1754022"
    },
    {
      "text": "J. R. Lewis. IBM computer usability satisfaction questionnaires: Psychometric evaluation and instructions for use. International Journal of Human-Computer Interaction, 7(1):57--78, 1995.  ",
      "doi": "10.1080/10447319509526110"
    },
    {
      "text": "J. Lin, L. Mamykina, S. Lindtner, G. Delajoux, and H. Strub. Fish'n'steps: Encouraging physical activity with an interactive computer game. In P. Dourish and A. Friday, editors, UbiComp 2006: Ubiquitous Computing, volume 4206 of Lecture Notes in Computer Science, pages 261--278. Springer Berlin / Heidelberg, 2006.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "L. Mamykina, E. D. Mynatt, and D. R. Kaufman. Investigating health management practices of individuals with diabetes. In Proc. ACM CHI 2006, CHI '06, pages 927--936, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "G. Marcu, J. E. Bardram, and S. Gabrielli. A Framework for Overcoming Challenges in Designing Persuasive Monitoring Systems for Mental Illness. In Proc. Pervasive Health 2011, pages 1--10. IEEE Press, 2011.",
      "doi": ""
    },
    {
      "text": "M. Matthews and G. Doherty. In the mood: engaging teenagers in psychotherapy using mobile phones. In Proc. ACM CHI 2011, CHI '11, pages 2947--2956, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "M. Morris, Q. Kathawala, T. Leen, E. Gorenstein, F.Guilak, M. Labhard, and W. Deleeuw. Mobile therapy: Case study evaluations of a cell phone application for emotional self-awareness. Journal of Internet Medical Research, J Med Internet Res 2010; 12(2):e10:12, 2010.",
      "doi": ""
    },
    {
      "text": "C. J. L. Murray and A. D. Lopez. Global mortality, disability, and the contribution of risk factors: Global burden of disease study. Lancet, 349:1436--42, 1997.",
      "doi": ""
    },
    {
      "text": "J. Pollak, G. Gay, S. Byrne, E. Wagner, D. Retelny, and L. Humphreys. It's time to eat! using mobile games to promote healthy eating. Pervasive Computing, IEEE, 9(3):21--27, july-sept. 2010.  ",
      "doi": "10.1109/MPRV.2010.41"
    },
    {
      "text": "P. Prociow and J. Crowe. Towards personalised ambient monitoring of mental health via mobile technologies. Technol Health Care, 18(4-5):275--284, 2010. ",
      "doi": "10.5555/1889348.1889352"
    },
    {
      "text": "J. Proudfoot, C. Ryden, B. Everitt, D. A. Shapiro, D. Goldberg, A. Mann, A. Tylee, I. Marks, and J. A. Gray. Clinical efficacy of computerised cognitive-behavioural therapy for anxiety and depression in primary care: randomised controlled trial. The British Journal of Psychiatry, 185(1):46--54, 2004.",
      "doi": ""
    },
    {
      "text": "L. Robertson, M. Smith, and D. Tannenbaum. Case management and adherence to an online disease management system. J Telemed Telecare, 11 Suppl 2:73--75, 2005.",
      "doi": ""
    },
    {
      "text": "G. S. Sachs. Bipolar mood disorder: Practical strategies for acute and maintenance phase treatment. J. Clin. Psychopharm., 16(2):32--47, Mar 1996.",
      "doi": ""
    },
    {
      "text": "K. A. Siek, K. H. Connelly, Y. Rogers, P. Rohwer, D. Lambert, and J. L. Welch. When do we eat? an evaluation of food items input into an electronic food monitoring application. In Proc. Pervasive Health 2006, pages 1--10, 29 2006-dec. 1 2006.",
      "doi": ""
    },
    {
      "text": "A. A. Stone, S. Shiffman, J. E. Schwartz, J. E. Broderick, and M. R. Hufford. Patient non-compliance with paper diaries. BMJ, 324(7347):1193--1194, 5 2002.",
      "doi": ""
    },
    {
      "text": "P. Whybrow, P. Grof, L. Gyulai, N. Rasgon, T. Glenn, and M. Bauer. The electronic assessment of the longitudinal course of bipolar disorder: the chronorecord software. Pharmacopsychiatry, 36 Suppl 3:244--249, 2003.",
      "doi": ""
    },
    {
      "text": "World Health Organization. The global burden of disease: 2004 update. WHO; 1 edition, 2009.",
      "doi": ""
    }
  ]
}