{
  "doi": "10.1145/2470654.2470695",
  "title": "Still looking: investigating seamless gaze-supported selection, positioning, and manipulation of distant targets",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "285-294",
  "year": 2013,
  "badges": [],
  "abstract": "We investigate how to seamlessly bridge the gap between users and distant displays for basic interaction tasks, such as object selection and manipulation. For this, we take advantage of very fast and implicit, yet imprecise gaze- and head-directed input in combination with ubiquitous smartphones for additional manual touch control. We have carefully elaborated two novel and consistent sets of gaze-supported interaction techniques based on touch-enhanced gaze pointers and local magnification lenses. These conflict-free sets allow for fluently selecting and positioning distant targets. Both sets were evaluated in a user study with 16 participants. Overall, users were fastest with a touch-enhanced gaze pointer for selecting and positioning an object after some training. While the positive user feedback for both sets suggests that our proposed gaze- and head-directed interaction techniques are suitable for a convenient and fluent selection and manipulation of distant targets, further improvements are necessary for more precise cursor control.",
  "tags": [
    "mobile touch input",
    "gaze interaction",
    "eye tracking",
    "distant displays",
    "visual attention",
    "selection",
    "positioning"
  ],
  "authors": [
    {
      "name": "Sophie Stellmach",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385603177",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Argelaguet, F., and Andujar, C. Efficient 3D pointing selection in cluttered virtual environments. Computer Graphics and Appl., IEEE 29, 6 (11 2009), 34--43.  ",
      "doi": "10.5555/1720672.1720678"
    },
    {
      "text": "Ashmore, M., Duchowski, A. T., and Shoemaker, G. Efficient eye pointing with a fisheye lens. In Proc. of GI '05 (2005), 203--210. ",
      "doi": "10.5555/1089508.1089542"
    },
    {
      "text": "Bezerianos, A., and Balakrishnan, R. The vacuum: Facilitating the manipulation of distant objects. In Proc. of CHI '05, ACM (2005), 361--370.  ",
      "doi": "10.1145/1054972.1055023"
    },
    {
      "text": "Bieg, H.-J., Chuang, L. L., Fleming, R. W., Reiterer, H., and Bülthoff, H. H. Eye and pointer coordination in search and selection tasks. In Proc. of ETRA'10, ACM (2010), 89--92.  ",
      "doi": "10.1145/1743666.1743688"
    },
    {
      "text": "Bolt, R. A. Gaze-orchestrated dynamic windows. In Proc. of SIGGRAPH '81, ACM (1981), 109--119.  ",
      "doi": "10.1145/800224.806796"
    },
    {
      "text": "Boring, S., Baur, D., Butz, A., Gustafson, S., and Baudisch, P. Touch projector: mobile interaction through video. In Proc. of CHI '10, ACM (2010), 2287--2296.  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Bulling, A., and Gellersen, H. Toward mobile eye-based human-computer interaction. IEEE Pervasive Computing 9 (2010), 8--12.  ",
      "doi": "10.1109/MPRV.2010.86"
    },
    {
      "text": "Drewes, H., and Schmidt, A. The MAGIC touch: Combining MAGIC-pointing with a touch-sensitive mouse. In Proc. of INTERACT'09, Springer-Verlag (2009), 415--428.  ",
      "doi": "10.1007/978-3-642-03658-3_46"
    },
    {
      "text": "Han, S., Lee, H., Park, J., Chang, W., and Kim, C. Remote interaction for 3D manipulation. In Proc. of CHI EA '10, ACM (2010), 4225--4230.  ",
      "doi": "10.1145/1753846.1754130"
    },
    {
      "text": "Jacob, R. J. K. What you look at is what you get: eye movement-based interaction techniques. In Proc. of CHI '90, ACM (1990), 11--18.  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Kaiser, E., Olwal, A., McGee, D., Benko, H., Corradini, A., Li, X., Cohen, P., and Feiner, S. Mutual disambiguation of 3D multimodal interaction in augmented and virtual reality. In Proc. of ICMI '03, ACM (2003), 12--19.  ",
      "doi": "10.1145/958432.958438"
    },
    {
      "text": "Keefe, D. F., Gupta, A., Feldman, D., Carlis, J. V., Krehbiel Keefe, S., and Griffin, T. J. Scaling up multi-touch selection and querying: Interfaces and applications for combining mobile multi-touch input with large-scale visualization displays. Int. J. Hum.-Comput. Stud. 70, 10 (Oct. 2012), 703--713.  ",
      "doi": "10.1016/j.ijhcs.2012.05.004"
    },
    {
      "text": "Kumar, M., Paepcke, A., and Winograd, T. EyePoint: practical pointing and selection using gaze and keyboard. In Proc. of CHI '07, ACM (2007), 421--430.  ",
      "doi": "10.1145/1240624.1240692"
    },
    {
      "text": "Monden, A., Matsumoto, K., and Yamato, M. Evaluation of gaze-added target selection methods suitable for general GUIs. Int. J. Comput. Appl. Technol. 24 (June 2005), 17--24.  ",
      "doi": "10.1504/IJCAT.2005.007201"
    },
    {
      "text": "Nancel, M., Wagner, J., Pietriga, E., Chapuis, O., and Mackay, W. Mid-air pan-and-zoom on wall-sized displays. In Proc. of CHI '11, ACM (2011), 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "Stellmach, S., and Dachselt, R. Look & touch: gaze-supported target acquisition. In Proc. of CHI '12, ACM (2012), 2981--2990.  ",
      "doi": "10.1145/2207676.2208709"
    },
    {
      "text": "Stellmach, S., Stober, S., Nürnberger, A., and Dachselt, R. Designing gaze-supported multimodal interactions for the exploration of large image collections. In Proc. of NGCA'11, ACM (2011), 1--8.  ",
      "doi": "10.1145/1983302.1983303"
    },
    {
      "text": "Turner, J., Bulling, A., and Gellersen, H. Combining gaze with manual interaction to extend physical reach. In Proc. of PETMEI '11, ACM (2011), 33--36.  ",
      "doi": "10.1145/2029956.2029966"
    },
    {
      "text": "Vogel, D., and Balakrishnan, R. Distant freehand pointing and clicking on very large, high resolution displays. In Proc. of UIST'05, ACM (2005), 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Ware, C., and Mikaelian, H. H. An evaluation of an eye tracker as a device for computer input. In Proc. of CHI'87, ACM (1987), 183--188.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Yamamoto, M., Komeda, M., Nagamatsu, T., and Watanabe, T. Development of eye-tracking tabletop interface for media art works. In Proc. of ITS '10, ITS '10, ACM (2010), 295--296.  ",
      "doi": "10.1145/1936652.1936723"
    },
    {
      "text": "Yoo, B., Han, J.-J., Choi, C., Yi, K., Suh, S., Park, D., and Kim, C. 3D user interface combining gaze and hand gestures for large-scale display. In Proc. of CHI EA'10, ACM (2010), 3709--3714.  ",
      "doi": "10.1145/1753846.1754043"
    },
    {
      "text": "Zhai, S., Morimoto, C., and Ihde, S. Manual and gaze input cascaded (MAGIC) pointing. In Proc. of CHI'99, ACM (1999), 246--253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}