{
  "doi": "10.1145/2470654.2466208",
  "title": "MultiNet: reducing interaction overhead in domestic wireless networks",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1569-1578",
  "year": 2013,
  "badges": [],
  "abstract": "We present MultiNet, a novel method for securely associating devices with a domestic wireless network. We show that MultiNet has usability benefits over currently deployed commercial solutions while being backwards compatible with existing devices. MultiNet reduces the interaction overhead of secure association by focusing on users' interactions rather than the network's requirements. This leads to a novel architectural arrangement of the home network infrastructure: the network is dynamically re-configured to accept each pre-configured device, rather than the current norm where each device is configured to be acceptable to the pre-configured network. Assuming devices are pre-configured for a unique, device-specific network name and passphrase, MultiNet constructs an out-of-band visual channel via an intermediary network controller device to convey the device's configuration to the network. This makes the interaction to join a device to the wireless network lightweight and identical across all devices, considerably reducing the interaction overheads for users.",
  "authors": [
    {
      "name": "Anthony Brown",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548028283",
      "orcid": "missing"
    },
    {
      "name": "Richard Mortier",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81313480954",
      "orcid": "missing"
    },
    {
      "name": "Tom Rodden",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100347821/rel-imgonly/81100347821.jpg",
      "acmid": "81100347821",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aboba, B., and Simon, D. Extensible Authentication Protocol (EAP) Key Management Framework. RFC 5247, IETF, Aug. 2008.",
      "doi": ""
    },
    {
      "text": "Balfanz, D., Durfee, G., and Grinter, R. E. Network-in-a-box: how to set up a secure wireless network in under a minute. In Proc. 13th USENIX Security Symposium, USENIX Association (2004). ",
      "doi": "10.5555/1251375.1251390"
    },
    {
      "text": "Balfanz, D., Smetters, D. K., and Stewart, P. Talking to strangers: Authentication in ad-hoc wireless networks. In Proc. NDSS (2002).",
      "doi": ""
    },
    {
      "text": "Bangor, A., Kortum, P. T., and Miller, J. T. An Empirical Evaluation of the System Usability Scale. International Journal of Human-Computer Interaction 24, 6 (July 2008), 574--594.",
      "doi": ""
    },
    {
      "text": "Brooke, J. SUS -- a quick and dirty usability scale. Usability evaluation in industry 189 (1996), 194.",
      "doi": ""
    },
    {
      "text": "Goodrich, M., Sirivianos, M., Solis, J., Tsudik, G., and Uzun, E. Loud and clear: Human-verifiable authentication based on audio. In Proc. IEEE 26th ICDCS (2006), 10.  ",
      "doi": "10.1109/ICDCS.2006.52"
    },
    {
      "text": "Grinter, R. E., Edwards, W. K., Newman, M. W., and Ducheneaut, N. The work to make a home network work. In ECSCW 2005. Springer Netherlands, 2005, 469--488. ",
      "doi": "10.5555/1242029.1242053"
    },
    {
      "text": "Ho, J. T., and Dearman, D. Improving users' security choices on home wireless networks. In Proc. 6th SOUPS, ACM (2010), 1--12.  ",
      "doi": "10.1145/1837110.1837126"
    },
    {
      "text": "Klasnja, P., Consolvo, S., Jung, J., Greenstein, B. M., LeGrand, L., and Powledge. \"when i am on wi-fi, i am fearless\": privacy concerns & practices in everyday wi-fi use. In Proc. 27th ACM CHI, ACM (2009).  ",
      "doi": "10.1145/1518701.1519004"
    },
    {
      "text": "Kobsa, A., Sonawalla, R., Tsudik, G., Uzun, E., and Wang, Y. Serial hook-ups: a comparative usability study of secure device pairing methods. In Proc. 5th SOUPS, ACM (2009), 1--12.  ",
      "doi": "10.1145/1572532.1572546"
    },
    {
      "text": "Kumar, A., Saxena, N., Tsudik, G., and Uzun, E. Caveat emptor: A comparative study of secure device pairing methods. In Proc. IEEE PerCom (Mar. 2009), 1--10.  ",
      "doi": "10.1109/PERCOM.2009.4912753"
    },
    {
      "text": "Kuo, C., Walker, J., and Perrig, A. Low-cost manufacturing, usability, and security: An analysis of Bluetooth simple pairing and Wi-Fi protected setup. In Proc. FC'07/USEC'07, Springer-Verlag (2007). ",
      "doi": "10.5555/1785594.1785636"
    },
    {
      "text": "McCune, J., Perrig, A., and Reiter, M. Seeing-is-believing: Using camera phones for human-verifiable authentication. In Proc. IEEE Symposium on Security and Privacy (May 2005), 110--124.  ",
      "doi": "10.1109/SP.2005.19"
    },
    {
      "text": "O'Brien, J., and Rodden, T. Interactive systems in domestic environments. In Proc. 2nd DIS, ACM (1997), 247--259.  ",
      "doi": "10.1145/263552.263617"
    },
    {
      "text": "Petersen, M. G. Remarkable computing: The challenge of designing for the home. In CHI '04, ACM (2004), 1445--1448.  ",
      "doi": "10.1145/985921.986086"
    },
    {
      "text": "Poole, E. S., Chetty, M., Grinter, R. E., and Edwards, W. K. More than meets the eye: transforming the user experience of home network management. DIS '08, ACM (2008), 455--464.  ",
      "doi": "10.1145/1394445.1394494"
    },
    {
      "text": "Sasse, M. A., Brostoff, S., and Weirich, D. Transforming the 'weakest link' -- a human/computer interaction approach to usable and effective security. BT Technology Journal 19 (2001), 122--131.  ",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "Saxena, N., Ekberg, J.-E., and Kostiainen, K. Secure Device Pairing Based on a Visual Channel: Design and Usability Study. IEEE Trans. Information Forensics and Security 6, 1 (2011), 28--38.  ",
      "doi": "10.1109/TIFS.2010.2096217"
    },
    {
      "text": "Shehan, E., and Edwards, W. K. Home networking and HCI: What hath God wrought? In Proc. ACM CHI, ACM (2007), 547--556.  ",
      "doi": "10.1145/1240624.1240712"
    },
    {
      "text": "Soriente, C., Tsudik, G., and Uzun, E. Hapadep: Human-assisted pure audio device pairing. In Information Security, vol. 5222 of Lecture Notes in Computer Science. Springer Berlin / Heidelberg, 2008.  ",
      "doi": "10.1007/978-3-540-85886-7_27"
    },
    {
      "text": "Stajano, F., and Anderson, R. The resurrecting duckling: Security issues for ad-hoc wireless networks. In Security Protocols, vol. 1796 of Lecture Notes in Computer Science. Springer Berlin / Heidelberg, 2000. ",
      "doi": "10.5555/647217.760118"
    },
    {
      "text": "Tasoluk, B., and Tanrikulu, Z. A weakest chain approach to assessing the overall effectiveness of the 802.11 wireless network security. CoRR abs/1103.0464 (2011).",
      "doi": ""
    },
    {
      "text": "Tolmie, P., Crabtree, A., Rodden, T., Greenhalgh, C., and Benford, S. Making the home network at home: Digital housekeeping. In ECSCW 2007. Springer London, 2007, 331--350.",
      "doi": ""
    },
    {
      "text": "Wi-Fi Alliance. Frequently Asked Questions : Wi-Fi Protected Setup. http://www.wi-fi.org/files/WFAWi-FiProtectedSetupFAQ.pdf, 2006.",
      "doi": ""
    },
    {
      "text": "Wi-fi Alliance. Wi-Fi CERTIFIED Wi-Fi Protected Setup: Easing the User Experience for Home and Small Office Wi-Fi Networks. http://www.wi-fi.org/knowledge-center/white-papers/, 2010.",
      "doi": ""
    },
    {
      "text": "Yang, J., and Edwards, W. Icebox: Toward easy-to-use home networking. In Human-Computer Interaction INTERACT 2007, vol. 4663 of Lecture Notes in Computer Science. Springer Berlin / Heidelberg, 2007, 197--210. ",
      "doi": "10.5555/1778331.1778351"
    }
  ]
}