{
  "doi": "10.1145/2470654.2466478",
  "title": "Whoo.ly: facilitating information seeking for hyperlocal communities using social media",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3481-3490",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Social media systems promise powerful opportunities for people to connect to timely, relevant information at the hyper local level. Yet, finding the meaningful signal in noisy social media streams can be quite daunting to users. In this paper, we present and evaluate Whoo.ly, a web service that provides neighborhood-specific information based on Twitter posts that were automatically inferred to be hyperlocal. Whoo.ly automatically extracts and summarizes hyperlocal information about events, topics, people, and places from these Twitter posts. We provide an overview of our design goals with Whoo.ly and describe the system including the user interface and our unique event detection and summarization algorithms. We tested the usefulness of the system as a tool for finding neighborhood information through a comprehensive user study. The outcome demonstrated that most participants found Whoo.ly easier to use than Twitter and they would prefer it as a tool for exploring their neighborhoods.",
  "tags": [
    "social media",
    "hyperlocal community",
    "location-based social networks",
    "civic engagement",
    "twitter",
    "event detection"
  ],
  "authors": [
    {
      "name": "Yuheng Hu",
      "institution": "Arizona State University, Tempe, Arizona, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490674608",
      "orcid": "missing"
    },
    {
      "name": "Shelly D. Farnham",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100243264",
      "orcid": "missing"
    },
    {
      "name": "Andrés Monroy-Hernández",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81350567841/rel-imgonly/8598964387_bdf95cfca1_z.jpg",
      "acmid": "81350567841",
      "orcid": "0000-0003-4889-9484"
    }
  ],
  "references": [
    {
      "text": "Becker, H., Naaman, M., and Gravano, L. Beyond trending topics: Real-world event identification on Twitter. Proc. ICWSM, (2011), 438--441.",
      "doi": ""
    },
    {
      "text": "Big Data for Breaking News: Lessons from #Aurora, Colorado. http://blog.socialflow.com/post/7120245507/bigdata-breaking-news-aurora-colorado.",
      "doi": ""
    },
    {
      "text": "Blei, D. M., Ng, A. Y., and Jordan, M. I. Latent dirichlet allocation. Journal of Machine Learning Research, (2003). ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Boyd, D. M., and Ellison, N. B., Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication, 13 (2007), 210--230.",
      "doi": "10.1111/j.1083-6101.2007.00393.x"
    },
    {
      "text": "Carroll, J. M., and Rosson, M. B. Developing the Blacksburg electronic village. Communications of the ACM, (1996), 69--74.  ",
      "doi": "10.1145/240483.240498"
    },
    {
      "text": "Chang, C. H., Kayed, M., Girgis, M. R., and Shaalan, K. F. A survey of web information extraction systems. IEEE TKDE, (2006), 1411--1428.  ",
      "doi": "10.1109/TKDE.2006.152"
    },
    {
      "text": "Cranshaw, J., Schwartz, R., Hong, J. I., and Sadeh, N. The livehoods project: Utilizing social media to understand the dynamics of a city. Proc. ICWSM, (2012).",
      "doi": ""
    },
    {
      "text": "Fillion, R. How Social Media Covered the Empire State Shooting. The Wall Street Journal, (2012). http://blogs.wsj.com/digits/2012/08/24/how-social-mediacovered-the-empire-state-shooting/.",
      "doi": ""
    },
    {
      "text": "Glaser, M. The New Voices: Hyperlocal Citizen Media Sites Want You (to Write!). Online Journalism Review.",
      "doi": ""
    },
    {
      "text": "Hampton K. i-Neighbors. http://www.i-neighbors.com.",
      "doi": ""
    },
    {
      "text": "Hampton, K., and Wellman, B. Neighboring in Netville: How the Internet Supports Community and Social Capital in a Wired Suburb. City & Community, (2003), 277--311.",
      "doi": ""
    },
    {
      "text": "He, D., and Parker, D. S. Topic dynamics: an alternative model of bursts in streams of topics. Proc. KDD, (2010).  ",
      "doi": "10.1145/1835804.1835862"
    },
    {
      "text": "Hecht, B., Hong, L., Suh, B., and Chi, E. H. Tweets from Justin Bieber's heart: the dynamics of the location field in user profiles. Proc. CHI (2010), 237--246.  ",
      "doi": "10.1145/1978942.1978976"
    },
    {
      "text": "Hoffman, B., Robinson, H., Han, K., and Carroll, J. CiVicinity events: pairing geolocation tools with a community calendar. Proc. COM.Geo, (2012).  ",
      "doi": "10.1145/2345316.2345334"
    },
    {
      "text": "Hu, X., Sun, N., Zhang, C., and Chua, T. S. Exploiting internal and external semantics for the clustering of short texts using world knowledge. Proc. CIKM, (2009).  ",
      "doi": "10.1145/1645953.1646071"
    },
    {
      "text": "Hu, X., Tang, L., Tang, J., and Liu, H. Exploiting Social Relations for Sentiment Analysis in Microblogging. Proc. WSDM, (2013).  ",
      "doi": "10.1145/2433396.2433465"
    },
    {
      "text": "Hu, Y., John, A., Seligmann, D. D., and Wang, F. What Were the Tweets About? Topical Associations between Public Events and Twitter Feeds. Proc. ICWSM, (2012).",
      "doi": ""
    },
    {
      "text": "Jarvis, R. A., and Patrick, E. A. Clustering using a similarity measure based on shared near neighbors. Computers, IEEE Transactions on, C-22, 11 (1973), 1025--1034.  ",
      "doi": "10.1109/T-C.1973.223640"
    },
    {
      "text": "Kahne, J., Middaugh, E., and Schutjer-Mance, K. California civic index. New York: Carnegie Corporation and Annenberg Foundation, (2005).",
      "doi": ""
    },
    {
      "text": "Kavanaugh, A., Gad, S., Neidig, S., Pérez-Quiñones, M. A., Tedesco, J., Ahuja, A., and Ramakrishnan, N. (Hyper) local news aggregation: Designing for Social Affordances. Proc. DG.O, (2012), 1--10.  ",
      "doi": "10.1145/2307729.2307736"
    },
    {
      "text": "Keeter, S., Zukin, C., Andolina, M., and Jenkins, K. Improving the measurement of political participation. Annual meeting of the Midwest Political Science Association.",
      "doi": ""
    },
    {
      "text": "Kwak, H., Lee, C., Park, H., and Moon, S. What is Twitter, a social network or a news media? Proc. WWW, (2010).  ",
      "doi": "10.1145/1772690.1772751"
    },
    {
      "text": "Lewis, S., and Lewis, D. A. Examining technology that supports community policing. Proc. CHI, (2012).  ",
      "doi": "10.1145/2207676.2208595"
    },
    {
      "text": "Monroy-Herndez, A., Kiciman, E., Boyd, D., and Counts, S., Narcotweets: Social Media in Wartime, ICWSM, (2012).",
      "doi": ""
    },
    {
      "text": "Murphy, J. Technical Analysis of the Financial Markets. Prentice Hall Press, (1999).",
      "doi": ""
    },
    {
      "text": "Newport, J. K., and Jawahar, G. G. P. Community participation and public awareness in disaster mitigation. Disaster Prevention and Management 12, 1 (2003), 33--36.",
      "doi": ""
    },
    {
      "text": "O'Connor, B., Krieger, M., and Ahn, D. Tweetmotif: Exploratory search and topic summarization for twitter. Proc. of ICWSM, (2010), 2--3.",
      "doi": ""
    },
    {
      "text": "Rosenstiel, T., Mitchell, A., Purcell, K., and Rainie, L. How People Learn about their Local Community. Pew Internet and American Life Project. (2011). http://www.pewinternet.org/Reports/2011/Localnews.aspx.",
      "doi": ""
    },
    {
      "text": "Sakaki T., Okazaki, M., and Matsuo, Y., Earthquake shakes Twitter users: real-time event detection by social sensors. Proc. WWW, (2010), 851--860.  ",
      "doi": "10.1145/1772690.1772777"
    },
    {
      "text": "Sarason, S. B. The psychological sense of community: Prospects for a community psychology. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Vieweg, S., Hughes, A. L., Starbird, K., and Palen, L. Microblogging during two natural hazards events: what twitter may contribute to situational awareness. CHI, 2010.  ",
      "doi": "10.1145/1753326.1753486"
    },
    {
      "text": "Wang, C. K,. Hsu, P., Chang, M.-W., Kiciman, E., Simple and Knowledge-intensive Generative Model for Named Entity Recognition., Microsoft Research, (2013). http://research.microsoft.com/apps/pubs/default.aspx?id=179740.",
      "doi": ""
    },
    {
      "text": "Wellman, B. Community: from neighborhood to network. Communications of the ACM, 48, 10 (2005), 53--55.  ",
      "doi": "10.1145/1089107.1089137"
    }
  ]
}