{
  "doi": "10.1145/2470654.2470664",
  "title": "Accessible online content creation by end users",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "59-68",
  "year": 2013,
  "badges": [],
  "abstract": "Like most online content, user-generated content (UGC) poses accessibility barriers to users with disabilities. However, the accessibility difficulties pervasive in UGC warrant discussion and analysis distinct from other kinds of online content. Content authors, community culture, and the authoring tool itself all affect UGC accessibility. The choices, resources available, and strategies in use to ensure accessibility are different than for other types of online content. We contribute case studies of two UGC communities with accessible content: Wikipedia, where authors focus on access to visual materials and navigation, and an online health support forum where users moderate the cognitive accessibility of posts. Our data demonstrate real world moderation strategies and illuminate factors affecting success, such as community culture. We conclude with recommended strategies for creating a culture of accessibility around UGC.",
  "authors": [
    {
      "name": "Katie Kuksenok",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549546256",
      "orcid": "missing"
    },
    {
      "name": "Michael Brooks",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81548896556/rel-imgonly/me-12-2012-crop.jpg",
      "acmid": "81548896556",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    }
  ],
  "references": [
    {
      "text": "Ivory, Melody Y., Mankoff, Jennifer, and Le, Audrey. Using automated tools to improve web site usage by users with diverse abilities. Information Technology and Society, 3, 1 (2003), 195--236.",
      "doi": ""
    },
    {
      "text": "Mankoff, J., Fait, H., and Tran, T. Is your web page accessible? A comparative study of methods for assessing web page accessibility for the blind. CHI (2005), 41--50.  ",
      "doi": "10.1145/1054972.1054979"
    },
    {
      "text": "Vigo, M. and Brajnik, G. Automatic web accessibility metrics: where we are and where we can go. Interacting with Computers, 23, 2 (2011), 137--155.  ",
      "doi": "10.1016/j.intcom.2011.01.001"
    },
    {
      "text": "Gupta, S., Kaiser, G., Neistadt, D., and Grimm, P. DOMbased content extraction of HTML documents. WWW (2003), 207--214.  ",
      "doi": "10.1145/775152.775182"
    },
    {
      "text": "Takagi, H., Kawenaka, S., Kobayashi, M., Itoh, T., and Asakawa, C. Social accessibility: Achieving accessibility through collaborative metadata authoring. ASSETS (2008), 193--200.  ",
      "doi": "10.1145/1414471.1414507"
    },
    {
      "text": "Fairweather, P. G., Hanson, V. L., Detweiler, S. R., and Schwerdtfeger, R. S. From assistive technology to a Web accessibility service. ASSETS (2002), 4--8.  ",
      "doi": "10.1145/638249.638253"
    },
    {
      "text": "Leahy, D. and Broin, U. Ó. Social networking sites and equal opportunity: The impact of accessibility. 22nd Bled eConference: eEnablement: Facilitating an Open, Effective and Representative eSociety (2009), 41.",
      "doi": ""
    },
    {
      "text": "Taras, C., Siemoneit, O., Weißer, N., Rotard, M., and Ertl, T. Improving the accessibility of Wikis: A basic analytical framework. ICCHP (2008), 430--437.  ",
      "doi": "10.1007/978-3-540-70540-6_62"
    },
    {
      "text": "American Foundation for the Blind. Is blogging accessible to people with vision loss? Archived by WebCite® at http://www.webcitation.org/67PvGjdh6.",
      "doi": ""
    },
    {
      "text": "Chrisholm, W., Vanderheiden, G., & Jacobs, I. (1999). W3C Web Content Accessibility Guidelines 1.0.",
      "doi": ""
    },
    {
      "text": "Wentz, B. and Lazar, J. Are separate interfaces inherently unequal? An evaluation with blind users of the usability of two interfaces for a social networking platform. iConference (2011), 91--97.  ",
      "doi": "10.1145/1940761.1940774"
    },
    {
      "text": "Mesiti, M., Ribaudo, M., Valtolina, S., Barricelli, B. R., Boccacci, P., and Dini, S. Collaborative environments: Accessibility and usablity for users with special needs. Pardede, Eric, ed., Community-built Databases: Research and Development. Springer, 2011.",
      "doi": ""
    },
    {
      "text": "Braithwaite, D. O., Waldron, V. R., and Finn, J. Communication of social support in computer-mediated groups for people with disabilities. Health Communication, 11, 2 (2009), 123--151.",
      "doi": ""
    },
    {
      "text": "Maloney-Krichmar, D. and Preece, J. A multilevel analysis of sociability, usability, and community dynamics in an online health community. TOCHI, 12, 2 (2005), 201--232.  ",
      "doi": "10.1145/1067860.1067864"
    },
    {
      "text": "Finn, J. An exploration of helping processes in an online self-help group focusing on issues of disability. Health Soc. Work, 24, 3 (1999), 220--231.",
      "doi": ""
    },
    {
      "text": "Ellis, K. and Kent, M. Community accessibility: Tweeters take responsibility for an accessible Web 2.0. Fast Capitalism, 7, 1 (2010). Retrieved from http://www.uta.edu/huma/agger/fastcapitalism/7_1/elliskent7_1.html.",
      "doi": ""
    },
    {
      "text": "Kittur, A. and Kraut, R. E. Harnessing the wisdom of crowds in Wikipedia: Quality through coordination. CSCW (2008), 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Mankoff, J., Hayes, G., and Kasnitz, D. Disability Studies as a source of critical inquiry for the field of Assistive Technology. ASSETS (2010), 3--10.  ",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Cairns, V. and Godwin, J. Post-Lyme borreliosis syndrome: A meta-analysis of reported symptoms. International Journal of Epidemiology, 34, 6 (2005), 1340--1345.",
      "doi": ""
    },
    {
      "text": "WebAIM. Cognitive Disabilities: Introduction. 1999--2012.",
      "doi": ""
    },
    {
      "text": "Burke, M., Joyce, E, Kim, T., Anand, V., and Kraut, R. E. Introductions and requests: Rhetorical strategies that elicit response in online communities. Third International Conference on Communities & Technologies (2007), 21--40.",
      "doi": ""
    }
  ]
}