{
  "doi": "10.1145/2470654.2466161",
  "title": "Pt Viz: towards a wearable device for visualizing knee rehabilitation exercises",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1247-1250",
  "year": 2013,
  "badges": [],
  "abstract": "We present a wearable sensory display for visualizing knee rehabilitation as part of an in-home physical therapy program. Currently, patients undergoing knee rehabilitation have limited ways of assessing exercise form and extent of movement at home. To address this issue, we developed an exploratory wearable electronic prototype to visualize knee bend. We evaluated the device with physical therapy patients to get feedback on the design and to help us understand some of the challenges they face. We discovered that our current design is better suited for patients recovering from surgery as opposed to patients with chronic conditions.",
  "authors": [
    {
      "name": "Swamy Ananthanarayan",
      "institution": "University of Colorado at Boulder, Boulder, Colorado, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659534027",
      "orcid": "missing"
    },
    {
      "name": "Miranda Sheh",
      "institution": "University of Colorado at Boulder, Boulder, Colorado, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556558056",
      "orcid": "missing"
    },
    {
      "name": "Alice Chien",
      "institution": "University of Colorado at Boulder, Boulder, Colorado, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556674056",
      "orcid": "missing"
    },
    {
      "name": "Halley Profita",
      "institution": "University of Colorado at Boulder, Boulder, Colorado, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502811619",
      "orcid": "missing"
    },
    {
      "name": "Katie Siek",
      "institution": "University of Colorado at Boulder, Boulder, Colorado, USA",
      "img": "/do/10.1145/contrib-81311481394/rel-imgonly/dsc_0184-less1mb-1024x683.jpg",
      "acmid": "81311481394",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bamberg, S. J. M., Benbasat, A. Y., Scarborough, D. M., Krebs, D. E., and Paradiso, J. A. Gait analysis using a shoe-integrated wireless sensor system. Trans. Info. Tech. Biomed. 12, 4 IEEE (2008), 413--423.  ",
      "doi": "10.1109/TITB.2007.899493"
    },
    {
      "text": "Bassett, S. F., and Petrie, K. J. The effect of treatment goals on patient compliance with physiotherapy exercise programmes. Physiotherapy 85, 3 (1999), 130--137.",
      "doi": ""
    },
    {
      "text": "Fergus, P., Kafiyat, K., Merabti, M., Taleb-bendiab, A., and El Rhalibi, A. Remote physiotherapy treatments using wireless body sensor networks. In IWCMC '09, ACM (2009), 1191--1197.  ",
      "doi": "10.1145/1582379.1582640"
    },
    {
      "text": "Guraliuc, A. R., Barsocchi, P., Potortí, F., and Nepa, P. Limb movements classification using wearable wireless transceivers. Trans. Info. Tech. Biomed. 15, 3 IEEE (2011), 474--480.  ",
      "doi": "10.1109/TITB.2011.2118763"
    },
    {
      "text": "Jovanov, E., Milenkovic, A., Otto, C., and De Groen, P. C. A wireless body area network of intelligent motion sensors for computer assisted physical rehabilitation. J NEUROENG REHABIL 2, 1 (2005), 6.",
      "doi": ""
    },
    {
      "text": "Kennedy, M. W., Schmiedeler, J. P., Striegel, A. D., Charles, R., Villano, M., and Kuitse, J. Enhanced feedback in balance rehabilitation using the nintendo wii balance board. In Healthcom '11, IEEE (2011), 162--168.",
      "doi": ""
    },
    {
      "text": "Kimel, J. C. Thera-network: A wearable computing network to motivate exercise in patients undergoing physical therapy. In ICDCSW '05, IEEE (2005), 491--495.  ",
      "doi": "10.1109/ICDCSW.2005.135"
    },
    {
      "text": "Morrow, K., Docan, C., Burdea, G., and Merians, A. Low-cost virtual rehabilitation of the hand for patients Post-Stroke. In Int'l Workshop on Virtual Rehabilitation (2006), 6--10.",
      "doi": ""
    },
    {
      "text": "Paradiso, J. A., Morris, S. J., Benbasat, A. Y., and Asmussen, E. Interactive therapy with instrumented footwear. In CHI EA '04, ACM (2004), 1341--1343.  ",
      "doi": "10.1145/985921.986059"
    },
    {
      "text": "Taraldsen, K., Askim, T., Sletvold, O., Einarsen, E. K., Bjstad, K. G., Indredavik, B., and Helbostad, J. L. Evaluation of a body-worn sensor system to measure physical activity in older people with impaired function. Physical Therapy 91, 2 (2011), 277--285.",
      "doi": ""
    },
    {
      "text": "Wai, A. A. P., Biswas, J., Fook, F. S., Kenneth, L. J., Panda, S. K., and Yap, P. Development of holistic physical therapy management system using multimodal sensor network. In PETRA '10, ACM (2010), 1--4.  ",
      "doi": "10.1145/1839294.1839325"
    }
  ]
}