{
  "doi": "10.1145/2470654.2481323",
  "title": "Improving navigation-based file retrieval",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2329-2338",
  "year": 2013,
  "badges": [],
  "abstract": "Navigating through a file hierarchy is one of the most common methods for accessing files, yet it can be slow and repetitive. New algorithms that predict upcoming file accesses have the potential to improve navigation-based file retrieval, but it is unknown how best to present their predictions to users. We present three design goals aiming to improve navigation-based file retrieval interfaces: minimise the time spent at each hierarchical level en route to the target file; reduce the number of levels traversed by providing shortcuts; and promote rehearsal of the retrieval mechanics to facilitate expertise. We introduce three interfaces that augment standard file browsers based on each of these goals: Icon Highlights give greater prominence to predicted items in the current folder; Hover Menus provide shortcuts to predicted folder content; and Search Directed Navigation uses predictive highlighting to guide users through the hierarchy in response to query terms. Results from a user evaluation show that all three interfaces improve file retrieval times, with Icon Highlights and Hover Menus best suited for frequently accessed items and Search Directed Navigation best suited for infrequent ones. We also show that the benefits are larger when folder content is spatially unstable. Finally, we discuss how the interfaces could be combined and deployed in existing file browsers.",
  "authors": [
    {
      "name": "Stephen Fitchett",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607003",
      "orcid": "missing"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R. \"beating\" fitts' law: virtual enhancements for pointing facilitation. Int. Journal of Human-Computer Studies (2004), 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Barreau, D., and Nardi, B. A. Finding and reminding: file organization from the desktop. SIGCHI Bull. 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R., Nachmias, R., Gradovitch, N., and Whittaker, S. Improved search engines and navigation preference in personal information management. ACM Trans. Inf. Syst. (2008), 1--24.  ",
      "doi": "10.1145/1402256.1402259"
    },
    {
      "text": "Bergman, O., Whittaker, S., Sanderson, M., Nachmias, R., and Ramamoorthy, A. The effect of folder structure on personal file navigation. JASIST 61, 12 (2011), 2300--2310.  ",
      "doi": "10.5555/1890706.1890712"
    },
    {
      "text": "Bergman, O., Whittaker, S., Sanderson, M., Nachmias, R., and Ramamoorthy, A. How do we find personal files?: the effect of os, presentation & depth on file navigation. In Proc. CHI '12 (2012), 2977--2980.  ",
      "doi": "10.1145/2207676.2208707"
    },
    {
      "text": "Blanc-Brude, T., and Scapin, D. L. What do people recall about their documents?: implications for desktop search tools. In Proc. IUI '07 (2007), 102--111.  ",
      "doi": "10.1145/1216295.1216319"
    },
    {
      "text": "Boardman, R., and Sasse, M. A. \"stuff goes into the computer and doesn't come out\": a cross-tool study of personal information management. In Proc. CHI '04 (2004), 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Cockburn, A., and Gutwin, C. A predictive model of human performance with scrolling and hierarchical lists. HCIJ (2009), 273--314.",
      "doi": ""
    },
    {
      "text": "Cutrell, E., Dumais, S., and Teevan, J. Searching to eliminate personal information management. CACM 49, 1 (2006), 58--64.  ",
      "doi": "10.1145/1107458.1107492"
    },
    {
      "text": "de Bruijn, O., Spence, R., and Chong, M. Y. Rsvp browser: Web browsing on small screen devices. Personal Ubiquitous Comput. 6, 4 (2002), 245--252.  ",
      "doi": "10.1007/s007790200024"
    },
    {
      "text": "Findlater, L., Moffatt, K., McGrenere, J., and Dawson, J. Ephemeral adaptation: the use of gradual onset to improve menu selection performance. In Proc. CHI '09, ACM (2009), 1655--1664.  ",
      "doi": "10.1145/1518701.1518956"
    },
    {
      "text": "Fitchett, S., and Cockburn, A. Accessrank: predicting what users will do next. In Proc. CHI '12, ACM (2012), 2239--2242.  ",
      "doi": "10.1145/2207676.2208380"
    },
    {
      "text": "Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement. 1954. J Exp Psychol Gen 121, 3 (1992), 262--269.",
      "doi": ""
    },
    {
      "text": "Forlines, C., and Balakrishnan, R. Improving visual search with image segmentation. In Proc. CHI '09, ACM (2009), 1093--1102.  ",
      "doi": "10.1145/1518701.1518868"
    },
    {
      "text": "Géry, M., and Haddad, H. Evaluation of web usage mining approaches for user's next request prediction. In Proc. WIDM '03, ACM (2003), 74--81.  ",
      "doi": "10.1145/956699.956716"
    },
    {
      "text": "Gonçalves, D., and Jorge, J. An empirical study of personal document spaces. DSV-IS (2003), 403--412.",
      "doi": ""
    },
    {
      "text": "Hart, S., and Staveland, L. Development of nasa-tlx (task load index): Results of empirical and theoretical research. In Human Mental Workload, P. Hancock, Ed. (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Henderson, S., and Srinivasan, A. An empirical analysis of personal digital document structures. Human Interface and the Management of Information. Designing Information Environments (2009), 394--403.  ",
      "doi": "10.1007/978-3-642-02556-3_45"
    },
    {
      "text": "Hill, W., and Hollan, J. Edit Wear and Read Wear. In CHI '92, Addison-Wesley (1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Jones, W., Phuwanartnurak, A. J., Gill, R., and Bruce, H. Don't take my folders away!: organizing personal information to get things done. In Ext. abstracts CHI '05, ACM (2005), 1505--1508.  ",
      "doi": "10.1145/1056808.1056952"
    },
    {
      "text": "Kurtenbach, G. P. The design and evaluation of marking menus. PhD thesis, University of Toronto, Ontario, Canada, 1993. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Landauer, T. K., and Nachbar, D. W. Selection from alphabetic and numeric menu trees using a touch screen: breadth, depth, and width. In Proc. CHI '85, ACM (1985), 73--78.  ",
      "doi": "10.1145/317456.317470"
    },
    {
      "text": "Lansdale, M. The psychology of personal information management. Applied Ergonomics 19, 1 (1988), 55--66.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. How do people organize their desks?: Implications for the design of office information systems. ACM Trans. Inf. Syst. 1, 1 (1983), 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Miller, D. P. The depth/breadth tradeoff in hierarchical computer menus. Proc. HFES '81 25, 1 (1981), 296--300.",
      "doi": ""
    },
    {
      "text": "Nardi, B., Anderson, K., and Erickson, T. Filing and finding computer files. Proc. EWHCI (1995).",
      "doi": ""
    },
    {
      "text": "Sears, A., and Shneiderman, B. Split menus: effectively using selection frequency to organize menus. ACM TOCHI 1, 1 (1994), 27--51.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "Stasko, J. An evaluation of space-filling information visualizations for depicting hierarchical structures. Int. J. Hum.-Comput. Stud. 53, 5 (Nov. 2000), 663--694.  ",
      "doi": "10.1006/ijhc.2000.0420"
    },
    {
      "text": "Tulving, E., and Thomson, D. Encoding specificity and retrieval processes in episodic memory. Psychological review 80, 5 (1973), 352--373.",
      "doi": ""
    },
    {
      "text": "Zipf, G. Human behavior and the principle of least effort: an introduction to human ecology. Addison-Wesley Press, Mass., 1949.",
      "doi": ""
    }
  ]
}