{
  "doi": "10.1145/2470654.2481290",
  "title": "Listen to it yourself!: evaluating usability of what's around me? for the blind",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2107-2116",
  "year": 2013,
  "badges": [],
  "abstract": "Although multiple GPS-based navigation applications exist for the visually impaired, these are typically poorly suited for in-situ exploration, require cumbersome hardware, lack support for widely accessible geographic databases, or do not take advantage of advanced functionality such as spatialized audio rendering. These shortcomings led to our development of a novel spatial awareness application that leverages the capabilities of a smartphone coupled with worldwide geographic databases and spatialized audio rendering to convey surrounding points of interest. This paper describes the usability evaluation of our system through a task-based study and a longer-term deployment, each conducted with six blind users in real settings. The findings highlight the importance of testing in ecologically valid contexts over sufficient periods to face real-world challenges, including balancing quality versus quantity for audio information, overcoming limitations imposed by sensor accuracy and quality of database information, and paying appropriate design attention to physical interaction with the device.",
  "authors": [
    {
      "name": "Sabrina A. Panëels",
      "institution": "McGill University, Montréal, Québec, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331501543",
      "orcid": "missing"
    },
    {
      "name": "Adriana Olmos",
      "institution": "McGill University, Montréal, Québec, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472644046",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey R. Blum",
      "institution": "McGill University, Montréal, Québec, Canada",
      "img": "/do/10.1145/contrib-81442609107/rel-imgonly/81442609107.png",
      "acmid": "81442609107",
      "orcid": "missing"
    },
    {
      "name": "Jeremy R. Cooperstock",
      "institution": "McGill University, Montréal, Québec, Canada",
      "img": "/do/10.1145/contrib-81100490116/rel-imgonly/jer13.jpg",
      "acmid": "81100490116",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahmetovic, D., Bernareggi, C., and Mascetti, S. Zebralocalizer: identification and localization of pedestrian crossings. In Proc. MobileHCI, ACM Press (2011), 275--284.  ",
      "doi": "10.1145/2037373.2037415"
    },
    {
      "text": "Bigham, J. P., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R. C., Miller, R., Tatarowicz, A., White, B., White, S., and Yeh, T. Vizwiz: nearly real-time answers to visual questions. In Proc. UIST, ACM Press (2010), 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Blum, J. R., Bouchard, M., and Cooperstock, J. R. Spatialized audio environmental awareness for blind users with a smartphone. Mobile Networks and Applications (2012).",
      "doi": ""
    },
    {
      "text": "Blum, J. R., Greencorn, D., and Cooperstock, J. R. Smartphone sensor reliability for augmented reality applications. In Proc. MobiQuitous (2012).",
      "doi": ""
    },
    {
      "text": "El-Shimy, D., Grond, F., Olmos, A., and Cooperstock, J. R. Eyes-free environmental awareness for navigation. Springer Journal on Multimodal User Interfaces 5, 3-4 (2012), 131--141.",
      "doi": ""
    },
    {
      "text": "Kane, S. K., Jayant, C., Wobbrock, J. O., , and Ladner, R. E. Freedom to Roam: Mobile Device Opportunities and Challenges for People with Visual and Motor Impairments. In Proc. ASSETS, ACM Press (2009), 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Katz, M. A., and Rohrer, C. How Many Users Are Really Enough And More Importantly When? Available online at: http://www.xdstrategy.com/wp-content/uploads/2008/10/katz_and_rohrer_2004-chi.pdf {Accessed: 03-01-2010}, 2004.",
      "doi": ""
    },
    {
      "text": "Laakso, M., Sarjakoski, T., Sarjakoski, L., Lehto, L., Harrie, L., Andreasson, J., Vilén, A., Claassen, G., Peters, J., and Stoer, A. Haptimap - accessible map and lbs content guidelines. Tech. Rep. Deliverable D4.4, Haptimap consortium, 2012.",
      "doi": ""
    },
    {
      "text": "Loomis, J. M., Marston, J. R., Golledge, R. G., and Klatzky, R. L. Personal Guidance System for People with Visual Impairment: A Comparison of Spatial Displays for Route Guidance. Journal of Visual Impairment and Blindness 99, 4 (2005), 219--232.",
      "doi": ""
    },
    {
      "text": "Magnusson, C., Larsson, A., Warell, A., and Eftring, H. Key scenarios, contextual walkthrough and context trails - tools for better and more accessible mobile designs. In Workshop on Mobile Accessibility (2011).",
      "doi": ""
    },
    {
      "text": "Magnusson, C., Rassmus-Gröhn, K., Tollmar, K., and Deaner, E. Haptimap - User Study Guidelines. Tech. rep., Haptimap Consortium, 2009.",
      "doi": ""
    },
    {
      "text": "Magnusson, C., Rassmus-Gröhn, K., Tollmar, K., and Stigmar, H. Exploring User Requirements for Non-visual Mobile Navigation Systems. In Proc. INTERACT, LNCS 5726, Springer (2009), 754--757.  ",
      "doi": "10.1007/978-3-642-03655-2_82"
    },
    {
      "text": "Ran, L., Helal, S., and Moore, S. Drishti: an integrated indoor/outdoor blind navigation system and service. In Proc. PerCom, IEEE Press (2004), 23--30. ",
      "doi": "10.5555/977406.978696"
    },
    {
      "text": "Ross, D. A., and Blasch, B. B. Wearable Interfaces for Orientation and Wayfinding. In Proc. ASSETS, ACM Press (2000), 193--200.  ",
      "doi": "10.1145/354324.354380"
    },
    {
      "text": "Rubin, J. Handbook of Usability Testing: How to Plan, Design, and Conduct Effective Tests. Wiley Technical Communications Library. John Wiley and Sons, Inc., April 1994. ",
      "doi": "10.5555/561768"
    },
    {
      "text": "Vazquez-Alvarez, Y., Oakley, I., and Brewster, S. A. Auditory display design for exploration in mobile audio-augmented reality. Personal and Ubiquitous Computing (2011), 1--27.  ",
      "doi": "10.1007/s00779-011-0459-0"
    },
    {
      "text": "Walker, B. N., and Lindsay, J. Navigation Performance With a Virtual Auditory Display: Effects of Beacon Sound, Capture Radius, and Practice. Human Factors 48, 2 (2006), 265--278.",
      "doi": ""
    },
    {
      "text": "Wilson, J., Walker, B. N., Lindsay, J., Cambias, C., and Dellaert, F. SWAN: System for Wearable Audio Navigation. In Proc. ISWC (2007), 91--98.  ",
      "doi": "10.1109/ISWC.2007.4373786"
    },
    {
      "text": "Yang, R., Park, S., Mishra, S. R., Hong, Z., Newsom, C., Joo, H., Hofer, E., and Newman, M. W. Supporting Spatial Awareness and Independent Wayfinding for Pedestrians with Visual Impairments. In Proc. ASSETS, ACM Press (2011), 27--34.  ",
      "doi": "10.1145/2049536.2049544"
    }
  ]
}