{
  "doi": "10.1145/2470654.2466202",
  "title": "Prototyping in PLACE: a scalable approach to developing location-based apps and games",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1519-1528",
  "year": 2013,
  "badges": [],
  "abstract": "The rising popularity of location-based applications and games (LBAGs) that break spatial, temporal, and social boundaries creates new challenges for designers. This paper introduces PLACE, an iterative, mixed-fidelity approach to Prototyping Location, Activities, Collective experience, and Experience over time in LBAGs. PLACE consists of 6 design principles: start small and scale up the fidelity, treat participants as co-designers, test in a representative space, focus on activities more than interfaces, respect authentic social experience, and represent time authentically. The effectiveness of PLACE was evaluated by prototyping Floracaching, a geocaching game for citizen science. This revealed the types of insights that PLACE provides, best practices for implementing PLACE, and how PLACE com-pares to other prototyping methods.",
  "tags": [
    "co-design",
    "place",
    "mobile apps",
    "location",
    "mixed-fidelity prototype",
    "location-based games"
  ],
  "authors": [
    {
      "name": "Anne E. Bowser",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "60000000263",
      "orcid": "missing"
    },
    {
      "name": "Derek L. Hansen",
      "institution": "Brigham Young University, Provo, Utah, USA",
      "img": "/do/10.1145/contrib-81311486004/rel-imgonly/derekhansen.png",
      "acmid": "81311486004",
      "orcid": "missing"
    },
    {
      "name": "Jocelyn Raphael",
      "institution": "Brigham Young University, Provo, Utah, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557932456",
      "orcid": "missing"
    },
    {
      "name": "Matthew Reid",
      "institution": "Brigham Young University, Provo, Utah, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553620456",
      "orcid": "missing"
    },
    {
      "name": "Ryan J. Gamett",
      "institution": "Brigham Young University, Provo, Utah, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556298556",
      "orcid": "missing"
    },
    {
      "name": "Yurong R. He",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496675064",
      "orcid": "missing"
    },
    {
      "name": "Dana Rotman",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436593135",
      "orcid": "missing"
    },
    {
      "name": "Jenny J. Preece",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100079159",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benford, S., Giannachi, G., Koleva, B. and Rodden, T. From interaction to trajectories: Designing coherent journeys through user experience. Proc. Of CHI 2009, ACM Press (2009), 709--718.  ",
      "doi": "10.1145/1518701.1518812"
    },
    {
      "text": "Beyer, H., and Holtzblatt K. Contextual Design. Morgan Kaufmann Publishers, San Francisco, CA, USA, 1998.",
      "doi": "10.5555/286067"
    },
    {
      "text": "Bidwell, N. and Holdsworth, J. Battleship by foot: Learning by designing a mixed reality game. In Proc. IE 2006, ACM Press (2006), 1107--1116. ",
      "doi": "10.5555/1231894.1231905"
    },
    {
      "text": "Bowser, A., Hansen, D., Rotman, D. and Preece, J. Low fidelity prototyping for social, location-based games. Paper presented at the Mixed Reality Games Workshop, CSCW 2012, Seattle, WA.",
      "doi": ""
    },
    {
      "text": "Buchneau, M. and Fulton Suri, J. Experience prototyping. Proc. DIS 2000, ACM Press (2000), 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Burns, C., Dishman, E., Verplank, W. and Lassiter, B. Actors, hairdos & videotape -- Informance design. Proc. - 10 CHI 1994, ACM Press (2004), 119- 120.  ",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Christensen, H. and Bardram, J. Supporting human activities- exploring activity-centered computing. Proc. UBICOMP 2002, ACM Press (2002), 107--115. ",
      "doi": "10.5555/647988.741475"
    },
    {
      "text": "Corbin, J. & Strauss, E. (2007). Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage Publications, Thousand Oaks, CA, 2007.",
      "doi": ""
    },
    {
      "text": "Druin, A. The Role of Children in the Design of New Technology. Behaviour and Information Technology, 21, 2 (2002), 1--25.",
      "doi": ""
    },
    {
      "text": "Flatla, D., Gutwin, C., Nacke, L., Bateman, S., and Mandryk, R. Calibration games: Making calibration tasks enjoyable by adding motivating game elements. Proc. UIST 2011, ACM Press (2011), 403--412.  ",
      "doi": "10.1145/2047196.2047248"
    },
    {
      "text": "Froehlich, J., Chen, M., Consolvo, S., Harrison, B. and Landay, J. MyExperience: A system for in situ tracing and capturing of user feedback on mobile phones. Proc. MobiSys 2007. ACM Press (2007), 57--70.  ",
      "doi": "10.1145/1247660.1247670"
    },
    {
      "text": "Gifford, B. and Enyedy, N. Activity centered design: towards a theoretical framework for CSCL. Proc. CSCL 1999, ACM Press (1999), 189--196. ",
      "doi": "10.5555/1150240.1150262"
    },
    {
      "text": "Graham, E., Vassello, D., Gerrick, S., Han, K., and Hsieh, N. Challenges of mobile phone-based, GPSdependent gaming for citizen science. Paper presented at the Mixed Reality Games Workshop, CSCW 2012, Seattle, WA.",
      "doi": ""
    },
    {
      "text": "Harrison, S. and Dourish, P. Re-place-ing space: the roles of place and space in collaborative systems. Proc. CSCW 1996, ACM Press (1996), 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Höysniemi, J., Hämäläinen, P. and Turkki, L. Wizard of Oz Prototyping of Computer Vision Based Action Games for Children. Proc. IDC 2004, ACM Press (2004), 27--34.  ",
      "doi": "10.1145/1017833.1017837"
    },
    {
      "text": "Kjeldskov, J. and Graham, C. A review of Mobile HCI Research Methods. Proc. Mobile HCI 2003, SpringerVerlag (2003), 317--3352.",
      "doi": ""
    },
    {
      "text": "Kurvinen, E., Koskinen, I. and Battarbee, K. Prototyping social interaction. Design Issues, 24, 3 (2008), 46--57.",
      "doi": ""
    },
    {
      "text": "Li, Y. and Landay, J. Activity-based prototyping of ubicomp applications for long-lived, everyday human activities. Proc. CHI 2008. ACM Press (2008), 1303--1312.  ",
      "doi": "10.1145/1357054.1357259"
    },
    {
      "text": "Lund, K., Lochrie, M., and Coulton, P. Enabling emergent behaviour in location based games. Proc. MindTrek 2010. ACM Press (2010), 78--85.  ",
      "doi": "10.1145/1930488.1930505"
    },
    {
      "text": "Matyas, S., Matyas, C., Schlieder, C., Kiefer, P., Mitari, H., and Kamata, M. Designing location-based mobile games with a purpose- Collecting geospatial data with CityExplorer. Proc. ACE 2008, ACM Press (2008), 244247.  ",
      "doi": "10.1145/1501750.1501806"
    },
    {
      "text": "McCurdy, M., Connors, C., Pyrzak, G., Kanefsky, B. and Vera, A. Breaking the fidelity barrier: An examination of our current characterization of prototypes and an example of mixed-fidelity success. Proc. of CHI 2006, ACM Press (2006), 1233--1242.  ",
      "doi": "10.1145/1124772.1124959"
    },
    {
      "text": "Nielsen, J. Iterative user interface design. IEEE Computing, 26, 11 (1993), 32--41.  ",
      "doi": "10.1109/2.241424"
    },
    {
      "text": "Norman, D. The Design of Everyday Things. Basic Books: New York, NY, USA, 1988.",
      "doi": ""
    },
    {
      "text": "O'Hara, K. Understanding geocaching practices and motivations. Proc. CHI 2008, ACM Press (2008), 11771186.  ",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "Ollila, E., Suomela, R. and Holopainen, . Using prototypes in early pervasive game development. ACM Computers and Entertainment, 6, 2 (2008), 1--17.  ",
      "doi": "10.1145/1371216.1371220"
    },
    {
      "text": "Oulasvirta, A., Kurvinen, E., and Kankainen, T. Understanding contexts by being there: Case studies in bodystorming. Personal and Ubiquitous Computing, 7, 2 (2003), 125--134.  ",
      "doi": "10.1007/s00779-003-0238-7"
    },
    {
      "text": "Raento, M., Oulasvirta, A., Petit. R.. and Toivonen, H. ContextPhone: A prototyping platform for context-aware mobile applications. IEEE Pervasive Computing 4, 2 (2005), 51--59.  ",
      "doi": "10.1109/MPRV.2005.29"
    },
    {
      "text": "Rashid, O., Bamford, W., Coulton, P., Edwards, R. and Scheible, J. PAC-LAN: Mixed-reality gaming with RFID enabled mobile phones. ACM Computers in Entertainment, 4, 4 (2006), Article 3A.  ",
      "doi": "10.1145/1178418.1178425"
    },
    {
      "text": "Rogers, Y., Sharp, H. and Preece, J. Interaction Design: Beyond Human-Computer Interaction. Wiley Press, New York, NY, USA, 2011. ",
      "doi": "10.5555/2031622"
    },
    {
      "text": "Rosenbaum, S., Cockton G., Coyne, K., Muller, M. and Rauch, T. Panel on Focus Groups in HCI: Wealth of Information or Waste of Resources? Proc. CHI 2002, ACM Press (2002), 702--703.  ",
      "doi": "10.1145/506443.506554"
    },
    {
      "text": "Rotman, D., Preece, J., Hammock, J., Procita, K., Hansen, D., Parr, C., Lewis, D. and Jacobs, D. Dynamic changes in motivation in collaborative ecological citizen science projects. Proc. CSCW 2012, ACM Press (2012), 217--226.  ",
      "doi": "10.1145/2145204.2145238"
    },
    {
      "text": "Rudd, J., Stern, K. and Isensee, S. Low vs. high-fidelity prototyping debate. Interactions, 3, 1 (1996), 76--85.  ",
      "doi": "10.1145/223500.223514"
    },
    {
      "text": "de Sá, M. and Carriço, L Lessons from early stages of design of mobile apps. Proc. MobileHCI 2008, ACM Press (2008), 127--136.  ",
      "doi": "10.1145/1409240.1409255"
    },
    {
      "text": "Tohidi, M., Bouxton, W., Baecker, R. and Sellen, A. Getting the right design and the design right: Testing many is better than one. Proc. CHI 2006, ACM Press (2006), 1243--1252  ",
      "doi": "10.1145/1124772.1124960"
    }
  ]
}