{
  "doi": "10.1145/2470654.2481354",
  "title": "Real-time perception-level translation from audio signals to vibrotactile effects",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2567-2576",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper, we propose a real-time perception-level audio-to-vibrotactile translation algorithm. Unlike previous signal-level conversion methods, our algorithm considers only perceptual characteristics, such as loudness and roughness, of audio and tactile stimuli. This perception-level approach allows for designing intuitive and explicit conversion models with clear understandings of their perceptual consequences. Our current implementation is tailored to accurate detection of special sound effects to provide well-synchronized audio-tactile feedback in immersive applications. We also assessed the performance of our translation algorithm in terms of the detection rate of special sound effects, computational performance, and user preference. All the experimental results supported that our algorithm works well as intended with better performance than the signal-level conversion methods, especially for games. Our algorithm can be easily realized in current products, including mobile devices, gaming devices, and 4D home theater systems, for richer user experience.",
  "authors": [
    {
      "name": "Jaebong Lee",
      "institution": "Pohang University of Science and Technology, Pohang, Gyungbuk, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81555716556",
      "orcid": "missing"
    },
    {
      "name": "Seungmoon Choi",
      "institution": "Pohang University of Science and Technology, Pohang, Gyungbuk, Republic of Korea",
      "img": "/do/10.1145/contrib-81100480604/rel-imgonly/bio_seungmoonchoi.jpg",
      "acmid": "81100480604",
      "orcid": "0000-0002-5889-1083"
    }
  ],
  "references": [
    {
      "text": "Ahmaniemi, T., Marila, J., and Lantz, V. Design of dynamic vibrotactile textures. IEEE Transactions on Haptics 3, 4 (2010), 245--256.  ",
      "doi": "10.1109/TOH.2010.22"
    },
    {
      "text": "Bensmaia, S., Hollins, M., and Yau, J. Vibrotactile intensity and frequency information in the pacinian system: A psychophysical model. Perception & Psychophysics 67, 5 (2005), 828--841.",
      "doi": ""
    },
    {
      "text": "Birnbaum, D. M., and Wanderley, M. M. A systematic approach to musical vibrotactile feedback. In Proc. ICMC, vol. 2 (2007), 397--404.",
      "doi": ""
    },
    {
      "text": "Brown, L. M., Brewster, S. A., and Purchase, H. C. A first investigation into the effectiveness of tactons. In Proc. WHC, IEEE (2005), 167--176.  ",
      "doi": "10.1109/WHC.2005.6"
    },
    {
      "text": "Chafe, C. Tactile audio feedback. In Proc. ICMC (1993), 76--79.",
      "doi": ""
    },
    {
      "text": "Chang, A., and O'Sullivan, C. Audio-haptic feedback in mobile phones. In Ext. Abstracts CHI, ACM Press (2005), 1264--1267.  ",
      "doi": "10.1145/1056808.1056892"
    },
    {
      "text": "Chi, D., Cho, D., Oh, S., Jun, K., You, Y., Lee, H., and Sung, M. Sound-specific vibration interface using digital signal processing. In Proc. CSSE (2008), 114--117.  ",
      "doi": "10.1109/CSSE.2008.931"
    },
    {
      "text": "Gescheider, G. A. Psychophysics: The Fundamentals, 3rd ed. Lawrence Erlbaum, 1997.",
      "doi": ""
    },
    {
      "text": "Glasberg, B. R., and Moore, B. C. J. A model of loudness applicable to time-varying sounds. Journal of Audio Engineering Society 50, 5 (2002), 331--342.",
      "doi": ""
    },
    {
      "text": "Han, S., Song, M., and Kwahk, J. A systematic method for analyzing magnitude estimation data. International Journal of Industrial Ergonomics 23, 5-6 (1999), 513--524.",
      "doi": ""
    },
    {
      "text": "Hollins, M., Faldowski, R., Rao, S., and Young, F. Perceptual dimensions of tactile surface texture: A multidimensional scaling analysis. Perception & Psychophysics 54, 6 (1993), 697--705.",
      "doi": ""
    },
    {
      "text": "Hutchinson, W., and Knopoff, L. The acoustic component of western consonance. Journal of New Music Research 7, 1 (1978), 1--29.",
      "doi": ""
    },
    {
      "text": "Hwang, I., and Choi, S. Perceptual space and adjective rating of sinusoidal vibrations perceived via mobile device. In Proc. Haptics Symposium, IEEE (2010), 1--8.  ",
      "doi": "10.1109/HAPTIC.2010.5444692"
    },
    {
      "text": "Kameoka, A., and Kuriyagawa, M. Consonance theory, part I: Consonance of dyads. The Journal of the Acoustical Society of America 45, 6 (1969), 1451--1459.",
      "doi": ""
    },
    {
      "text": "Kameoka, A., and Kuriyagawa, M. Consonance theory, part II: Consonance of complex tones and its calculation method. The Journal of the Acoustical Society of America 45, 6 (1969), 1460--1469.",
      "doi": ""
    },
    {
      "text": "Karam, M., Russo, F. A., and Fels, D. I. Designing the model human cochlea: An ambient crossmodal audio-tactile display. IEEE Transactions on Haptics 2, 3 (2009), 160--169.  ",
      "doi": "10.1109/TOH.2009.32"
    },
    {
      "text": "Kim, M., Lee, S., and Choi, S. Saliency-driven tactile effect authoring for real-time visuotactile feedback. In Proc. EuroHaptics 2012, vol. LNCS 7282 (2012), 258--269.  ",
      "doi": "10.1007/978-3-642-31401-8_24"
    },
    {
      "text": "Kim, Y., Cha, J., Oakley, I., and Ryu, J. Exploring tactile movies: An initial tactile glove design and concept evaluation. IEEE MultiMedia 16, 3 (2009), 34--44.",
      "doi": ""
    },
    {
      "text": "Klatzky, R. L., and Lederman, S. J. Tactile roughness perception with a rigid link interposed between skin and surface. Perception & Psychophysics 61, 4 (1999), 591--607.",
      "doi": ""
    },
    {
      "text": "Konyo, M., Tadokoro, S., Yoshida, A., and Saiwaki, N. A tactile synthesis method using multiple frequency vibrations for representing virtual touch. In Proc. IROS (2005), 3965--3971.",
      "doi": ""
    },
    {
      "text": "Kutner, M. H., Nachtsheim, C. J., Neter, J., and Li, W. Applied Linear Statistical Models, 5th ed. McGraw-Hill, 2005.",
      "doi": ""
    },
    {
      "text": "Lee, J., Ryu, J., and Choi, S. Vibrotactile Score: A score metaphor for designing vibrotactile patterns. In Proc. WHC, IEEE (2009), 302--307.  ",
      "doi": "10.1109/WHC.2009.4810816"
    },
    {
      "text": "LG Electronics. Apparatus and method for generating vibration pattern. US Patent Application, No. 12/840,988, Jul. 21, 2010.",
      "doi": ""
    },
    {
      "text": "Li, K. A., Sohn, T., Huang, S., and Griswold, W. G. PeopleTones: A system for the detection and notification of buddy proximity on mobile phones. In Proc. MobiSys, ACM Press (2008), 160--173.  ",
      "doi": "10.1145/1378600.1378619"
    },
    {
      "text": "Marshall, M. T., and Wanderley, M. M. Examining the effects of embedded vibrotactile feedback on the feel of a digital musical instrument. In Proc. NIME (2011), 399--404.",
      "doi": ""
    },
    {
      "text": "Ryu, J., and Choi, S. posVibEditor: Graphical authoring tool of vibrotactile patterns. In Proc. HAVE, IEEE (2008), 120--125.",
      "doi": ""
    },
    {
      "text": "Ryu, J., Jung, J., Park, G., and Choi, S. Psychophysical model for vibrotactile rendering in mobile devices. Presence 19, 4 (2010), 364--387.  ",
      "doi": "10.1162/PRES_a_00011"
    },
    {
      "text": "Vassilakis, P. N. SRA: A web-based research tool for spectral and roughness analysis of sound signals. In Proc. SMC (2007), 319--325.",
      "doi": ""
    },
    {
      "text": "Verrillo, R. T. Measurement of vibrotactile sensation magnitude. In Ratio Scaling of Psychological Magnitude: In Honor of the Memory of S. S. Stevens, S. J. Bolanowski and G. A. Gescheider, Eds. Lawrence Erlbaum Associates, Inc., 1991, 260--275.",
      "doi": ""
    },
    {
      "text": "Yao, H., Grant, D., and Cruz-Hernandez, J. M. Perceived vibration strength in mobile devices: The effect of weight and frequency. IEEE Transactions on Haptics 3, 1 (2010), 56--62.  ",
      "doi": "10.1109/TOH.2009.37"
    },
    {
      "text": "Yoo, Y., Hwang, I., and Choi, S. Consonance perception of vibrotactile chords: A feasibility study. In Proc. HAID, vol. LNCS 6851 (2011), 42--51. ",
      "doi": "10.5555/2033326.2033332"
    },
    {
      "text": "Zwicker, E., and Fastl, H. Psychoacoustics: Facts and models, 2nd ed. Springer-Verlag, 1999.",
      "doi": ""
    }
  ]
}