{
  "doi": "10.1145/2470654.2466247",
  "title": "HCI in the press: online public reactions to mass media portrayals of HCI research",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1873-1882",
  "year": 2013,
  "badges": [],
  "abstract": "HCI researchers working in publically funded institutions are increasingly encouraged to engage the public in their research. Mass media is often seen as an effective medium with which to communicate research to large parts of the population. We present an account of three HCI projects that have used engagements with mass media in order to communicate research to the public. We describe the motivations for working with mass media and the mechanics of writing press releases. A grounded theory analysis of online public responses to the projects in the mass media leads us to identify a number of concerns about how research is portrayed by news outlets and thus interpreted by the public. Tensions about technologies and wider societal issues were revealed that might normally be hidden when using traditional user-centred methods. We critically reflect on the efficacy of using the mass media in research and provide guidance for HCI researchers wishing to engage in dialogues with the public in the future.",
  "authors": [
    {
      "name": "John Vines",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    },
    {
      "name": "Anja Thieme",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482659504",
      "orcid": "0000-0002-9639-5531"
    },
    {
      "name": "Rob Comber",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "Mark Blythe",
      "institution": "Northumbria University, Newcastle upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100208849",
      "orcid": "missing"
    },
    {
      "name": "Peter C. Wright",
      "institution": "Newcastle University, Newcastle Upon Tyne, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, UK",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "BBC News. The power of intermittent fasting. http://www.bbc.co.uk/news/health-19112549",
      "doi": ""
    },
    {
      "text": "Bell, A. The Language of News Media. Oxford, Blackwell, 1991.",
      "doi": ""
    },
    {
      "text": "Björgvinsson, E., Ehn, P., Hillgren, P. Agonistic participatory design: Working with marginalised social movements. CoDesign, 8 (2-3), 127--144.",
      "doi": ""
    },
    {
      "text": "Blythe, M., Cairns, P. Critical methods and user generated content: The iPhone on YouTube. In: Proc. CHI '09, ACM (2009), 1467--1476.  ",
      "doi": "10.1145/1518701.1518923"
    },
    {
      "text": "Blythe, M., Cairns, P. Tenori-on Stage: YouTube as a performance space. In: Proc. NordiCHI 2010, ACM (2010), 72--81.  ",
      "doi": "10.1145/1868914.1868927"
    },
    {
      "text": "Bodker, S. When second wave HCI meets third wave challenges. In: Proc. NordiCHI '06, ACM (2006), 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Charmaz, K. Constructing grounded theory: A practical guide through qualitative analysis. London, Sage, 2006.",
      "doi": ""
    },
    {
      "text": "Chamberlain, A., Crabtree, A., Rodden, T., Jones, M., and Rogers, Y. Research in the wild: Understanding 'in the wild' approaches to design and development. In: Proc. DIS '12, ACM (2012), 795--796.  ",
      "doi": "10.1145/2317956.2318078"
    },
    {
      "text": "CNN Health. Stressed-out men find heavier women attractive. http://thechart.blogs.cnn.com/2012/08/09/stressed-out-men-find-heavier-women-attractive/",
      "doi": ""
    },
    {
      "text": "Eilders, C. News factors and news decisions. Theoretical and methodological advances in Germany. Communications, 31, 5--24.",
      "doi": ""
    },
    {
      "text": "Galtung, J., and Ruge, M. The structure of foreign news: the presentation of the Congo, Cuba and Cyprus crises in four Norwegian newspapers. Journal of International Peace Research, 1, 64--91.",
      "doi": ""
    },
    {
      "text": "Harcup, T., and O'Neill, D. What is news? Galtung and Ruge revisited. Journalism Studies, 2(2), 261--280.",
      "doi": ""
    },
    {
      "text": "Herbert, J. Journalism in the Digital Age. Oxford, Focal Press, 2000.",
      "doi": ""
    },
    {
      "text": "Herman, E., and Chomsky, N. Manufacturing consent: The political economy of the mass media. New York, Pantheon, 1988.",
      "doi": ""
    },
    {
      "text": "Hutchinson, H. et al. Technology probes: Inspiring design for and with families. In: Proc. CHI '03, ACM (2003), 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Kyng, M. Scandinavian design: Users in product development. In: Proc. CHI' 94, ACM (1994), 3--9.  ",
      "doi": "10.1145/191666.191673"
    },
    {
      "text": "Mail Online. Apple iPhone 5. http://tinyurl.com/dxzktav",
      "doi": ""
    },
    {
      "text": "McQuail, D. Mass Communication Theory, 5th edition. London, Sage, 2009.",
      "doi": ""
    },
    {
      "text": "Mogensen, P. Towards a provotyping approach in systems development. Scandinavian journal of information systems, 3, 1991, 31--53.",
      "doi": ""
    },
    {
      "text": "Mullen, A., and Klaehn, J. The Herman-Chomsky propaganda model: A critical approach to analysing mass media behaviour. Sociology Compass, 4(4), 215--229.",
      "doi": ""
    },
    {
      "text": "O'Sullivan, J., and Heinonen, A. Old Values, New Media. Journalism role perceptions in a changing world. Journalism Practice, 2(3), 357--371.",
      "doi": ""
    },
    {
      "text": "Oxford English Dictionary (3rd Ed.). Mass media; New media. Oxford, Oxford University Press, 2000.",
      "doi": ""
    },
    {
      "text": "The New York Times. New fossils indicate early branching of human family tree. http://www.nytimes.com/2012/08/09/science/new-fossils-indicate-offshootsin-human-family-tree.html",
      "doi": ""
    },
    {
      "text": "Research Councils UK. Concordat for engaging the public with research. http://www.rcuk.ac.uk/documents/scisoc/NCCPEbriefingsResearchersp5.pdf",
      "doi": ""
    },
    {
      "text": "Saad-Sulonen, J., Botero, A., and Kuuti, K. A long-term strategy for designing (in) the wild: lessons from the urban mediator and traffic planning in Helsinki. In: Proc. DIS '12, ACM (2012), 166--175.  ",
      "doi": "10.1145/2317956.2317982"
    },
    {
      "text": "Shoemaker, P. J., and Vos, T. P. Gatekeeping Theory. New York, Routledge, 2009.",
      "doi": ""
    },
    {
      "text": "Strauss, A., and Corbin, J. Basics of qualitative research: Grounded theory procedures and techniques. California, Sage, 1990.",
      "doi": ""
    },
    {
      "text": "Suler, J. The online disinhibition effect. CyberPsychology and Behavior, 7(3), 321--326",
      "doi": ""
    },
    {
      "text": "Thieme, A., Comber, R., Miebach, J., Weeden, J., Kraemer, N., Lawson, S., Olivier, P. \"We've bin watching you\": Designing for reflection and social persuasion to promote sustainable lifestyles. In: Proc. CHI '12, ACM, 2337--2346.  ",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Vasterman, P. L. M. Media-hype: Self-reinforcing news waves, journalistic standards and the construction of social problems. European Journal of Communication, 20(4), 508--530.",
      "doi": ""
    },
    {
      "text": "Vines, J., Blythe, M., Dunphy, P., Vlachokyriakos, V., Teece, I., Monk, A., Olivier, P. Cheque Mates: Participatory design of digital payments with eighty somethings. In: Proc. CHI '12, ACM, 1189--1198.  ",
      "doi": "10.1145/2207676.2208569"
    }
  ]
}