{
  "doi": "10.1145/2470654.2481285",
  "title": "Analyzing users' narratives to understand experience with interactive products",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2079-2088",
  "year": 2013,
  "badges": [],
  "abstract": "Recent research in user experience (UX) has studied narratives, users' account of their interaction with technology. It has emphasized specific constructs (e.g., affect, needs, hedonics) and their interrelation, but rarely analyzed the content of the narratives. We analyze the content and structure of 691 user-generated narratives on positive and negative experiences with technology. We use a multi-method approach consisting of manual (structural analysis of narratives) as well as of automated content analysis methods (psycholinguistic analysis and machine learning). These analyses show converging evidence that positive narratives predominantly concern social aspects such as family and friends. In addition, technology is positively experienced when it enables users to do things more efficiently or in a new way. In contrast, negative narratives often express anger and frustration due to technological failures. Our multi-method approach illustrates the potential of automated (as opposed to manual) content analysis methods for studying text-based experience reports.",
  "authors": [
    {
      "name": "Alexandre N. Tuch",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597649",
      "orcid": "missing"
    },
    {
      "name": "Rune Trusell",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557951456",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Aronson, J. A pragmatic view of thematic analysis. The Qualitative Report, 2, 1 (1994), 1--3.",
      "doi": ""
    },
    {
      "text": "Arrasvuori, J., Korhonen, H. and Väänänen-Vainio-Mattila, K. Exploring playfulness in user experience of personal mobile products. In Proc. OZCHI 2010. ACM (2010), 88--95.  ",
      "doi": "10.1145/1952222.1952241"
    },
    {
      "text": "Bargas-Avila, J. and Hornbæk, K. Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience. In Proc. CHI 2011. ACM Press (2011), 2689--2698.  ",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Beyer, H. and Holtzblatt, K. Contextual design. interactions, 6, 1 (1999), 32--42.  ",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Buhrmester, M., Kwang, T. and Gosling, S. D. Amazon's Mechanical Turk A New Source of Inexpensive, Yet High-Quality, Data? Perspectives on Psychological Science, 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Field, A. P. Discovering statistics using SPSS. SAGE publications Ltd, 2009.",
      "doi": ""
    },
    {
      "text": "Habermas, T. and Berger, N. Retelling everyday emotional events: Condensation, distancing, and closure. Cognition and Emotion, 25, 2 (2011), 206--219.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction, 19, 4 (2004), 319--349.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "Hassenzahl, M., Diefenbach, S. and Göritz, A. Needs, affect, and interactive products - Facets of user experience. Interacting with Computers, 22, 5 (2010), 353--362.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "Hassenzahl, M. and Monk, A. The inference of perceived usability from beauty. Human-Computer Interaction, 25, 3 (2010), 235--260.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. and Tractinsky, N. User experience - a research agenda. Behaviour & Information Technology, 25 2(2006), 91--99.",
      "doi": ""
    },
    {
      "text": "Karapanos, E., Zimmerman, J., Forlizzi, J. and Martens, J.-B. User experience over time: an initial framework. In Proc. CHI 2009. ACM (2009), 729--738.  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Kittur, A., Chi, E. H. and Suh, B. Crowdsourcing user studies with Mechanical Turk. In Proc. CHI 2008. ACM (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Klein, D. and Manning, C. D. Optimization, Maxent Models, and Conditional Estimation without Magic. Tutorial delivered at HLT-NAACL 2003(2003).  ",
      "doi": "10.3115/1075168.1075176"
    },
    {
      "text": "Korhonen, H., Arrasvuori, J. and Väänänen-Vainio-Mattila, K. Let Users Tell the Story: Evaluating User Experience with Experience Reports. In Proc. CHI 2010 Ext. Abs. (2010), 4051--4056.  ",
      "doi": "10.1145/1753846.1754101"
    },
    {
      "text": "Kramer, A. D. I. and Rodden, K. Word usage and posting behaviors: modeling blogs with unobtrusive data collection methods. In Proc. CHI 2008. ACM (2008), 1125--1128.  ",
      "doi": "10.1145/1357054.1357230"
    },
    {
      "text": "Labov, W. The transformation of experience in narrative syntax. In, Language in the Inner City: Studies in the Black Venacular. University of Pennsylvania Press, Philadelphia, PA, 1972.",
      "doi": ""
    },
    {
      "text": "Labov, W. and Waletzky, J. Narrative analysis: Oral versions of personal experience. In J. Helm (ed.), Essays on the Verbal and Visual Arts, 12--44. Seattle, 1967.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. and Wright, P. Technology as Experience. MIT Press, Cambridge, MA, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Nigam, K., Lafferty, J. and McCallum, A. Using maximum entropy for text classification. In Proc. IJCAI 1999 (1999), 61--67.",
      "doi": ""
    },
    {
      "text": "Olsson, T. and Salo, M. Narratives of satisfying and unsatisying experiences of current mobile augmented reality applications. In Proc. CHI 2012 (2012), 2779--2788.  ",
      "doi": "10.1145/2207676.2208677"
    },
    {
      "text": "Pang, B., Lee, L. and Vaithyanathan, S. Thumbs up?: sentiment classification using machine learning techniques. In Proc. EMNLP 2002. ACL (2002), 79--86.  ",
      "doi": "10.3115/1118693.1118704"
    },
    {
      "text": "Partala, T. and Kallinen, A. Understanding the most satisfying and unsatisfying user experiences: Emotions, psychological needs, and context. Interacting with Computers, 24(2012), 25--34.  ",
      "doi": "10.1016/j.intcom.2011.10.001"
    },
    {
      "text": "Pennebaker, J. W., Chung, C. K., Ireland, M., Gonzales, A. and Booth, R. J. The development and psychometric properties of LIWC2007. www.liwc.net, 2007.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Francis, M. E. and Booth, R. J. Linguistic inquiry and word count: LIWC 2001. Erlbaum Publishers, Mahwah, NJ, 2001.",
      "doi": ""
    },
    {
      "text": "Riessman, C. K. Narrative methods for the human sciences. SAGE, Los Angeles, 2008.",
      "doi": ""
    },
    {
      "text": "Rime, B., Mesquita, B., Philippot, P. and Boca, S. Beyond the Emotional Event - 6 Studies on the Social Sharing of Emotion. Cognition Emotion, 5, 5-6 (1991), 435--465.",
      "doi": ""
    },
    {
      "text": "Ryan, R. M. and Deci, E. L. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist, 55, 1 (2000), 68--78.",
      "doi": ""
    },
    {
      "text": "Scherer, K. R. Appraisal considered as a process of multilevel sequential checking. Appraisal processes in emotion: Theory, methods, research, 92(2001), 120.",
      "doi": ""
    },
    {
      "text": "Scissors, L. E., Gill, A. J., Geraghty, K. and Gergle, D. In CMC we trust: the role of similarity. In Proc. CHI 2009. ACM (2009), 527--536.  ",
      "doi": "10.1145/1518701.1518783"
    },
    {
      "text": "Sheldon, K. M., Elliot, A. J., Kim, Y. and Kasser, T. What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of Personality and Social Psychology, 80, 2 (2001), 325--339.",
      "doi": ""
    },
    {
      "text": "Tausczik, Y. R. and Pennebaker, J. W. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology, 29, 1 (2010), 24--54.",
      "doi": ""
    },
    {
      "text": "Watson, D., Clark, L. A. and Tellegen, A. Development and validation of brief measures of positive and negative affect: The PANAS scales. Journal of Personality and Social Psychology, 54, 6 (1988), 1063--1070.",
      "doi": ""
    }
  ]
}