{
  "doi": "10.1145/2470654.2466432",
  "title": "Designing graphical menus for novices and experts: connecting design characteristics with design goals",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3159-3168",
  "year": 2013,
  "badges": [],
  "abstract": "This paper presents a design space for graphical menus. We model the design space as a set of design goals, a set of design characteristics, and connections between the two. The design goals are based on novice and expert behaviors. The connections link the choices for design characteristics with the positive or negative effects that these choices have on the design goals. The paper further synthesizes the design space into a succinct form of structured design recommendations. A case study demonstrates how these recommendations can be used to assess and compare the strengths and weaknesses of two menu designs.",
  "tags": [
    "radial menus",
    "design characteristics",
    "design space",
    "graphical menus",
    "guidelines",
    "cascading menus",
    "guides",
    "menus"
  ],
  "authors": [
    {
      "name": "Krystian Samp",
      "institution": "National University of Ireland, Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654921",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlström, D. Modeling and improving selection in cascading pull-down menus using Fitts' law, the steering law and force fields. Proc. CHI 2005, 61--70.  ",
      "doi": "10.1145/1054972.1054982"
    },
    {
      "text": "Accot, J. and Zhai, S. Beyond Fitts' Law: Models for trajectory-based HCI tasks. Proc. CHI 1997, 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Buxton B. Sketching User Experiences, Morgan Kaufmann, 2007.",
      "doi": ""
    },
    {
      "text": "Callahan, J., Hopkins, D., Weiser, M., and Shneiderman, B. An empirical comparison of pie vs. linear menus. Proc. CHI 1988, 95--100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Card, S. K. User perceptual mechanisms in the search of computer command menus. Proc. CHI 1982, 190--196.  ",
      "doi": "10.1145/800049.801779"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. The Psychology of Human-Computer Interaction, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Charney, D., Reder, L., and Kusbit, G. Goal setting and procedure selection in acquiring computer skills: a comparison of problem solving and learner exploration. Cognition and Instruction, 7(4), 1990, 323--342.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Greenberg, S. A predictive model of menu performance. Proc. CHI'07.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Feng, J., Sears, A. Beyond errors: measuring reliability for error-prone interaction devices. J. B. & I. T., 29(2), 2010.  ",
      "doi": "10.1080/01449290802196596"
    },
    {
      "text": "Gan, K. C., and Hoffmann, E. R. Geometrical conditions for ballistic and visually controlled movements. In Ergonomics, 31(5), 1988, 829--839.",
      "doi": ""
    },
    {
      "text": "Graham, E. D., and MacKenzie, C. L. Physical versus virtual pointing. Proc. CHI 1996, 292--299.  ",
      "doi": "10.1145/238386.238532"
    },
    {
      "text": "Grossman, T., Kong, N., and Balakrishnan, R. Modeling pointing at targets of arbitrary shapes. Proc. CHI 2007.  ",
      "doi": "10.1145/1240624.1240700"
    },
    {
      "text": "Hollands, J. G., and Merikle, P. M. Menu organization and user expertise in information search tasks. In J. Human Factors and Ergonomics Society, 29(5), 1987. ",
      "doi": "10.1177/001872088702900507"
    },
    {
      "text": "Hornof, A. J., and Kieras, D. E. Cognitive modeling reveals menu search is both random and systematic. Proc. CHI 1997, 107--114.  ",
      "doi": "10.1145/258549.258621"
    },
    {
      "text": "Hornof, A. J. Visual search and mouse pointing in labeled versus unlabeled two-dimensional visual hierarchies. In ToCHI, ACM, 8(3), 171--197.  ",
      "doi": "10.1145/502907.502908"
    },
    {
      "text": "Inkpen, K. M. Drag-and-drop versus point-and-click mouse interaction styles for children. ACM Transactions on Computer-Human Interaction, 8(1), 2001, 1--33.  ",
      "doi": "10.1145/371127.371146"
    },
    {
      "text": "Kaptelinin, V. Item Recognition in menu selection: the effect of practice. Proc. CHI 1993, 183--184.  ",
      "doi": "10.1145/259964.260196"
    },
    {
      "text": "Kiger, J. I. The depth/breadth trade-off in the design of menu-driven user interfaces. International Journal of Man-Machine Studies, 20(2), 1984, 201--213.  ",
      "doi": "10.1016/S0020-7373%2884%2980018-8"
    },
    {
      "text": "Kobayashi, M., and Igarashi, T. Considering the direction of cursor movement for efficient traversal of cascading menus. Proc. UIST 2003, 91--94.  ",
      "doi": "10.1145/964696.964706"
    },
    {
      "text": "Kristensson, P. O., and Zhai, S. Command strokes with and without preview: using pen gestures on keyboard for command selection. Proc. CHI 2007, 1137--1146.  ",
      "doi": "10.1145/1240624.1240797"
    },
    {
      "text": "Kurtenbach, G. The design and evaluation of marking menus. PhD Thesis, the University of Toronto, 1993. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Kurtenbach, G., and Buxton, W. The limits of expert performance using hierarchic marking menus. Proc. CHI/INTERACT 1993, 482--487. ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Kurtenbach, G., and Buxton, W. User learning and performance with marking menus. Proc. CHI 1994.  ",
      "doi": "10.1145/191666.191759"
    },
    {
      "text": "Landauer, T., and Nachbar, D. Selection from alphabetic and numeric menu trees using a touch screen: breadth, depth and width. Proc. CHI 1985, 73--78.  ",
      "doi": "10.1145/317456.317470"
    },
    {
      "text": "Lane, D. M., Napier, H. A., Batsell, R. R., and Naman, J. L. Predicting the skilled use of hierarchical menus with the keystroke-level model. HCI, 8(2), 1993.  ",
      "doi": "10.1207/s15327051hci0802_4"
    },
    {
      "text": "Lee, E. S., and Raymond, D. R. Menu-driven systems. Encyclopedia of Microcomputers, 11, 1993, 101--127.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Sellen, A., and Buxton, W. A comparison of input devices in elemental pointing and dragging tasks. Proc. CHI 1991, 161--166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. HCI, 7(1), 1992,91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Mayes, J. T., Draper, S. W., McGregor, A. M., and Oatley, K. Information flow in a user interface: The effect of experience and context on the recall of MacWrite screens. Proc. BCS HCI 1988, 275--289. ",
      "doi": "10.5555/54675.54691"
    },
    {
      "text": "Mcdonald, J. E., Stone, J. D., and Liebelt, L. S. Searching for items in menus: The effects of organization and type of target. Proc. Human Factors Society, 1983, 834--837.",
      "doi": ""
    },
    {
      "text": "Norman, K. L., and Chin, J. P. The effect of tree structure on search in a hierarchical menu selection system. J. Behaviour & Information Technology, 7(1), 1988.",
      "doi": ""
    },
    {
      "text": "Norman, K. L., and Butler, S. Search by uncertainty: menu selection by target probability. Technical Report from the University of Maryland, 1989.",
      "doi": ""
    },
    {
      "text": "Norman, K. L. The Psychology of Menu Selection. Ablex Publishing Corporation, 1991. ",
      "doi": "10.5555/574380"
    },
    {
      "text": "Oel, P., Schmidt, P., and Schmitt, A. Time Prediction of Mouse-based Cursor Movements. Proc. CHI 2001.",
      "doi": ""
    },
    {
      "text": "Paap, K. R., and Roske-Hofstrand, R. J. The optimal number of menu options per panel. J. Human Factors & Ergonomics Society, 28(4), 1986, 377--385. ",
      "doi": "10.1177/001872088602800401"
    },
    {
      "text": "Phillips, J. G., and Triggs, T. J. Characteristics of cursor trajectories controlled by the computer mouse. In Ergonomics, 44(5), 2001, 527--536.",
      "doi": ""
    },
    {
      "text": "Quinn, P., and Cockburn, A. The effects of menu parallelism on visual search and selection. Proc. Conference on Australasian User Interface, 76, 2008. ",
      "doi": "10.5555/1378337.1378353"
    },
    {
      "text": "Robertson, G., McCracken, D., and Newell, A. The ZOG approach to man-machine communication. Int. Journal of Man-Machine Studies, 14, 1981, 461--488.",
      "doi": ""
    },
    {
      "text": "Samp, K., and Decker, S. Supporting menu design with radial layouts. Proc. AVI 2010, 155--162.  ",
      "doi": "10.1145/1842993.1843021"
    },
    {
      "text": "Samp, K., and Decker, S. Visual Search in Radial Menus. Proc. INTERACT 2011. ",
      "doi": "10.5555/2042283.2042309"
    },
    {
      "text": "Samp, K., and Decker, S. Navigation Time Variability: Measuring Menu Navigation Errors. Proc. INTERACT 2011. ",
      "doi": "10.5555/2042053.2042094"
    },
    {
      "text": "Samp, K. The Design and Evaluation of Graphical Radial Menus. Ph.D. Thesis, 2011.",
      "doi": ""
    },
    {
      "text": "Schmidt, R. A., Zelaznik, H., Hawkins, B., Frank, J. S., Quinn, J. T. Motor-output variability: A theory for the accuracy of rapid motor acts. Psych. Review, 86, 1979.",
      "doi": ""
    },
    {
      "text": "Sears, A., and Shneiderman, B. Split menus: effectively using selection frequency to organize menus. Trans. on Computer-Human Interaction, 1(1), 1994, 27--51.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "Shneiderman, B., Plaisant, C., Cohen, M., Jacobs, S. Designing the User Interface: Strategies for Effective Human-Computer Interaction, Addison Wesley, 2009. ",
      "doi": "10.5555/1593001"
    },
    {
      "text": "Snowberry, K., Parkinson, S. R., and Sisson, N. Computer display menus. In Ergonomics, 26(7), 1983.",
      "doi": ""
    },
    {
      "text": "Somberg, B. L. A comparison of rule-based and positionally constant arrangements of computer menu items. Proc. CHI/GI 1987, 255--260.  ",
      "doi": "10.1145/29933.275639"
    },
    {
      "text": "Tanvir, E., Cullen, J., Irani, P., Cockburn, A. AAMU: adaptive activation area menus for improving selection in cascading pull-down menus. Proc. CHI 2008.  ",
      "doi": "10.1145/1357054.1357270"
    },
    {
      "text": "Thompson, S. G. Effect on movement performance as a function of visual-motor scale and velocity: An investigation of the speed-accuracy tradeoff. PhD Thesis from the University of Louisiana at Monroe, 2007.",
      "doi": ""
    },
    {
      "text": "Tombaugh, J. and McEwen, S. Comparison of two information retrieval methods on Videotex: tree structure versus alphabetical directory. Proc. CHI 1982.  ",
      "doi": "10.1145/800049.801764"
    },
    {
      "text": "Treisman, A. Perceptual grouping and attention in visual search for features and for objects. J. Experimental Psych.: Human Perception Performance, 8(2), 1982.",
      "doi": ""
    },
    {
      "text": "Walker, N., Meyer, D. E., and Smelcer, J. B. Spatial and temporal characteristics of rapid cursor-positioning movements with electromechanical mice in humancomputer interaction. Human Factors, 35(3), 1993.",
      "doi": ""
    },
    {
      "text": "Whisenand, T. G., and Emurian, H. H. Analysis of cursor movements with a mouse. Proc. CHI 1997, 533--536. ",
      "doi": "10.5555/647942.741842"
    },
    {
      "text": "Wright, C. E., and Meyer, D. E. Conditions for a linear speed-accuracy trade-off in aimed movements. J. Experimental Psychology, 35A(2), 1983, 279--296.",
      "doi": ""
    },
    {
      "text": "Zhao, S., and Balakrishnan, R. Simple vs. compound mark hierarchical marking menus. Proc. UIST 2004.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}