{
  "doi": "10.1145/2470654.2466250",
  "title": "The effects of tactile feedback and movement alteration on interaction and awareness with digital embodiments",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1891-1900",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Collaborative tabletop systems can employ direct touch, where people's real arms and hands manipulate objects, or indirect input, where people are represented on the table with digital embodiments. The input type and the resulting embodiment dramatically influence tabletop interaction: in particular, the touch avoidance that naturally governs people's touching and crossing behavior with physical arms is lost with digital embodiments. One result of this loss is that people are less aware of each others' arms, and less able to coordinate actions and protect personal territories. To determine whether there are strategies that can influence group interaction on shared digital tabletops, we studied augmented digital arm embodiments that provide tactile feedback or movement alterations when people touched or crossed arms. The study showed that both augmentation types changed people's behavior (people crossed less than half as often) and also changed their perception (people felt more aware of the other person's arm, and felt more awkward when touching). This work shows how groupware designers can influence people's interaction, awareness, and coordination abilities when physical constraints are absent.",
  "tags": [
    "awareness",
    "coordination",
    "embodiments",
    "tabletop groupware"
  ],
  "authors": [
    {
      "name": "Andre Doucette",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442618474",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Miguel Nacenta",
      "institution": "University of St Andrews, St Andrews, UK",
      "img": "/do/10.1145/contrib-81100377766/rel-imgonly/dsc_7149-small.png",
      "acmid": "81100377766",
      "orcid": "missing"
    },
    {
      "name": "Andriy Pavlovych",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100311577",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, P. A., Leibowitz, K. The Development and Nature of the Construct Touch Avoidance. Nonverbal Behaviour. 3(2). 1978. 89--106.",
      "doi": ""
    },
    {
      "text": "Back, J., Brumby, D. P., and Cox, A. L. Locked-out: Investigating the Effectiveness of System Lockouts to Reduce Errors in Routine Tasks. CHI 2010. 3775--3780.  ",
      "doi": "10.1145/1753846.1754054"
    },
    {
      "text": "Bailensen, J. N., Yee, N., Brave, S., Merget, D., and Koslow, D. Virtual Interpersonal Touch: Expressing and Recognizing Emotions through Haptic Devices. HumanComputer Interaction 2007. 325--353. ",
      "doi": "10.5555/1466603.1466606"
    },
    {
      "text": "Benford, S., Greenhalgh, C., Giannachi, G., Walker, B., Marshall, J., and Rodden, T. Uncomfortable Interactions. CHI 2012. 2005--2014.  ",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Birnholtz, J., Gutwin, C., Hawkey, K. Privacy in the Open: How Attention Mediates Awareness and Privacy in Open-Plan Offices. Group 2007, 51--60.  ",
      "doi": "10.1145/1316624.1316632"
    },
    {
      "text": "Cockburn, A., Kristensson, P. O., Alexander, J., and Zhai, S. Hard Lessons: Effort-Inducing Interfaces Benefit Spatial Learning. CHI 2007. 1571--1580.  ",
      "doi": "10.1145/1240624.1240863"
    },
    {
      "text": "de Korte, E. M., de Kraker, H., Bongers, P. M., and van Lingen, P. Effects of a feedback signal in a computer mouse on movement behaviour, muscle load, productivity, comfort and user friendliness. Ergonomics. 51(11). 2008. 1157--1775.",
      "doi": ""
    },
    {
      "text": "Doucette, A., Gutwin, C., Mandryk, R. L., Nacenta, M., Sharma, S. Sometimes when we touch: How Arm Embodiments Change Reaching and Coordination on Digital Tables. CSCW 2013.  ",
      "doi": "10.1145/2441776.2441799"
    },
    {
      "text": "Greenberg, S. and Marwood, D. Real time groupware as a distributed system: concurrency control and its effect on the interface. CSCW 1994. 207--217.  ",
      "doi": "10.1145/192844.193011"
    },
    {
      "text": "Gutwin, C. and Greenberg, S. Design for individuals, design for groups: tradeoffs between power and workspace awareness. CSCW 1998. 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Ha, V., Inkpen, K. M., Mandryk, R. L., Whalen, T. Direct Intentions: The Effects of Input Devices on Collaboration around a Tabletop Display. TABLETOP 2006. 177--184.  ",
      "doi": "10.1109/TABLETOP.2006.10"
    },
    {
      "text": "Haans, A. and IJsselsteijn, W. Mediated social touch: a review of current research and future directions. VR 2006. 149--159.  ",
      "doi": "10.5555/1124635.1124640"
    },
    {
      "text": "Hall, E. T. The Hidden Dimension. 1966.",
      "doi": ""
    },
    {
      "text": "Heslin, R, Nguyen, T. D., Nguyen, M. L. Meaning of touch: The case of touch from a stranger or same sex person. Nonverbal Behaviour. 7(3). 1983. 147--157.",
      "doi": ""
    },
    {
      "text": "Hornecker, E., Marshall, P., Dalton, N. S., Rogers, Y. Collaboration and interference: awareness with mice or touch input. CSCW 2008. 167--176.  ",
      "doi": "10.1145/1460563.1460589"
    },
    {
      "text": "Hullman, J., Adar, E., Shah, P. Benefiting InfoVis with Visual Difficulties. IEEE Trans. Vis. and Graphics. 17(12). 2011. 2213--2222.  ",
      "doi": "10.1109/TVCG.2011.175"
    },
    {
      "text": "Izadi, S., Brignull, H., Rodden, T., Rogers, Y., Underwood, M., Dynamo: A public interactive surface supporting the cooperative sharing and exchange of media. UIST 2003. 159--168.  ",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Jeffrey, P., Mark, G. Navigating the virtual landscape: co-ordinating the shared use of space. In Social Navigation of Information Space. 2003. 112--131.",
      "doi": ""
    },
    {
      "text": "Jourard, S. M. An Exploratory Study of BodyAccessibility. J. Soc. Clin. Psych., 5, 1966. 221--231.",
      "doi": ""
    },
    {
      "text": "Kruger, R., Carpendale, S, Scott, S. D., and Greenberg, S. How people use orientation on tables: comprehension, coordination and communication. GROUP 2003. 369--378.  ",
      "doi": "10.1145/958160.958219"
    },
    {
      "text": "Mandryk, R. and Gutwin, C. Perceptibility and Utility of StickyTargets. GI 2008, 65--72. ",
      "doi": "10.5555/1375714.1375726"
    },
    {
      "text": "Morris, M. R., Cassanego, A., Paepcke, A. Winograd, T., Piper, A. M., and Huang, A. Mediating Group Dynamics through Tabletop Interface Design. IEEE Computer Graphics and Applications 26(5). 2006. 65--73.  ",
      "doi": "10.1109/MCG.2006.114"
    },
    {
      "text": "Morris, M., Ryall, K., Shen, C., Forlines, C., Vernier, F. Beyond \"social protocols\": multi-user coordination policies for co-located groupware. CSCW'04. 262--265.  ",
      "doi": "10.1145/1031607.1031648"
    },
    {
      "text": "Nacenta, M. A., Pinelle, D., Gutwin, C., Mandryk, R. L. Individual and Group Support in Tabletop Interaction Techniques. TABLETOP 2010. 303--333.",
      "doi": ""
    },
    {
      "text": "Nacenta, M. A., Pinelle, D., Stuckel, D., Gutwin, C. The effects of interaction technique on coordination in tabletop groupware. GI 2007. 191--198.  ",
      "doi": "10.1145/1268517.1268550"
    },
    {
      "text": "Nguyen, T., Heslin, R., Nguyen, M. L. The meanings of touch: Sex differences. Comm. 25(3). 1973. 92--103.",
      "doi": ""
    },
    {
      "text": "O'Hara, K. P. and Payne, S. J. Planning and the user interface: the effects of lockout time and error recovery cost. Int. Jour. Hum.-Comp. Studies. 50(1). 1999. 41--59.  ",
      "doi": "10.1006/ijhc.1998.0234"
    },
    {
      "text": "Oakley, I., Brewster, S., and Gray, P. Communicating with Feeling. Haptic HCI 2001. 61--68. ",
      "doi": "10.5555/645443.652688"
    },
    {
      "text": "Owen, J. M., Petro, J. A., D'Souza, S. M., Rastogi, R., and Pawluk, D. T. V. An improved, low-cost tactile 'mouse' for use by individuals who are blind and visually impaired. ASSETS 2009. 223--224.  ",
      "doi": "10.1145/1639642.1639686"
    },
    {
      "text": "Pinelle, D., Barjawi, M., Nacenta, M., and Mandryk. R. L. An evaluation of coordination techniques for protecting objects and territories in tabletop groupware. CHI 2009. 2129--2138.  ",
      "doi": "10.1145/1518701.1519025"
    },
    {
      "text": "Pinelle, D., Nacenta, M., Gutwin, C., Stach, T. The effects of co-present embodiments on awareness and collaboration in tabletop groupware. GI 2008. 1--8. ",
      "doi": "10.5555/1375714.1375716"
    },
    {
      "text": "Scott, S. D., Carpendale, S. T., Inkpen, K. M. Territoriality in collaborative tabletop workspaces. CSCW 2004. 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Slater, M., Steed, A. Meeting People Virtually: Experiments in Shared Virtual Environments. The Social Life of Avatars: Presence and Interaction in Shared Virtual Environments. 2002. ",
      "doi": "10.5555/505799.505808"
    },
    {
      "text": "Smith, R. B., Hixon, R., Horan, B. Supporting flexible roles in a shared workspace. CSCW 1998. 197--206.  ",
      "doi": "10.1145/289444.289494"
    },
    {
      "text": "Tang, A., Pahud, M., Inkpen, K., Benko, H., Tang, J. C., Buxton, B. Three's Company: Understanding Communication Channels in Three-way Distributed Collaboration. CSCW 2010. 271--280.  ",
      "doi": "10.1145/1718918.1718969"
    },
    {
      "text": "Tang, A., Neustaedter, C., Greenberg, S. VideoArms: Embodiments for Mixed Presence Groupware. People and Computers, in Proc of HCI 2006. 2--18.",
      "doi": ""
    },
    {
      "text": "Thayer, S. History and Strategies of Research on Social Touch. Nonverbal Behaviour. 10(1). 1986. 12--28.",
      "doi": ""
    },
    {
      "text": "Tsandilas, T. and Balakrishnan, R. An Evaluation of Techniques for Reducing Spatial Interference in Single Display Groupware. ECSCW 2005. 225--245. ",
      "doi": "10.5555/1242029.1242041"
    },
    {
      "text": "Tse, E., Histon, J., Scott, S. D., Greenberg, S. Avoiding interference: how people use spatial separation and partitioning in SDG workspaces. CSCW 2004. 252--261.  ",
      "doi": "10.1145/1031607.1031647"
    },
    {
      "text": "Vanacken, D., Raymaekers, C., Luyten, K., Coninx, K. Focus+Roles: Socio-Organizational Conflict Resolution in Collaborative User Interfaces. HCI 2007. 788--796. ",
      "doi": "10.5555/1769451.1769543"
    }
  ]
}