{
  "doi": "10.1145/2470654.2466462",
  "title": "Seeing movement qualities",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3375-3384",
  "year": 2013,
  "badges": [],
  "abstract": "With the increased availability of movement based interactive devices there is a growing interest in exploring the potential design space for engaging movement-based interactions. This has led to the exploration of different ways to sense and model movement such as Laban Movement Analysis' Effort qualities. However, little is understood in how movement qualities are perceived and experienced by users. We explored this in an interactive improvisational dance performance setting. From video analysis with a Laban Movement expert and post-performance interviews with audience members, we discuss the differences in how a movement quality was perceived. From these findings, we discuss implications for further efforts in designing interactive movement-based systems that strive to capitalize on movement qualities.",
  "authors": [
    {
      "name": "Helena M. Mentis",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100393102/rel-imgonly/profmentisphoto.jpg",
      "acmid": "81100393102",
      "orcid": "0000-0002-0142-3529"
    },
    {
      "name": "Carolina Johansson",
      "institution": "Mobile Life Centre Swedish Institute of Computer Science, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489393",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alaoui, S. F., Caramiaux, B., Serrano, M., Bevilacqua, F. (2012). Movement qualities as interaction modality. Proceedings of DIS, Newcastle, UK, p.761--769.  ",
      "doi": "10.1145/2317956.2318071"
    },
    {
      "text": "Alač, M. (2008). Working with brain scans: Digital images and gestural interaction in fMRI laboratory. Social Studies of Science, 38(4), 483--508.",
      "doi": ""
    },
    {
      "text": "Böscher, M. (2005). Social life under the microscope. Sociological Research Online, 10(1).",
      "doi": ""
    },
    {
      "text": "Gallagher, S. & Zahavi, D. (2008). The phenomenological mind: An introduction to philosophy of mind and cognitive science. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "Goodwin, C. (1994). Professional vision. American Anthropologist, 96(3), 606--633.",
      "doi": ""
    },
    {
      "text": "Goodwin, C. (2003). The semiotic body in its environment. In J. Coupland & R. Gwyn (Eds.), Discourses of the body. New York: Macmillan.",
      "doi": ""
    },
    {
      "text": "Goodwin, C. (2003). \"Pointing as Situated Practice.\" In Sotaro Kita (Ed). Pointing: Where Language, Culture and Cognition Meet. Mahwah, NJ: Lawrence Erlbaum, pp. 217--41.",
      "doi": ""
    },
    {
      "text": "Gopnik, A., & Meltzoff, A. N. (1997). Words, thoughts, and theories. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Harper, R. & Mentis, H. M. (2013). The mocking gaze. The social organization of Kinect use. Proc. of CSCW, San Antonio, TX.  ",
      "doi": "10.1145/2441776.2441797"
    },
    {
      "text": "Heath, C. (2000). Configuring action in objects: From mutual space to media space. Mind, Culture and Activity, 7(1-2), 81--104.",
      "doi": ""
    },
    {
      "text": "Hindmarsh, J. & Heath C. (2000). Embodied reference: A study of deixis in workplace interaction. Journal of Pragmatics, 32, 1855--1878.",
      "doi": ""
    },
    {
      "text": "Laban, R. & Lawrence, F. C. (1947) Effort. London: McDonald and Evans Ltd.",
      "doi": ""
    },
    {
      "text": "Laban, R. & Ullmann, L. (1971). Mastery of Movement. London: McDonald and Evans Ltd.",
      "doi": ""
    },
    {
      "text": "Latour, B. (1990). Drawing things together. In M. Lynch & S. Woolgar (Eds.), Representation in Scientific practice (pp. 19--68). Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Loke, L. & Robertson, T. (2013). Moving and making strange: An embodied approach to movement-based interaction design. Embodied Interaction. Spec. issue of ACM Transactions on Computer-Human Interaction (TOCHI).  ",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Lynch, M. (1985). Discipline and the material form of images: An analysis of scientific visibility. Social Studies of Science, 15, 37--66.",
      "doi": ""
    },
    {
      "text": "Merleau-Ponty, M. (1962). Phenomenology of perception. Routledge.",
      "doi": ""
    },
    {
      "text": "Masuda, M., Kato, S., Itoh, H. (2010). A Laban-Based Approach to Emotional Motion Rendering for HumanRobot Interaction. Lecture Notes in Computer Science, 6243, pp. 372--380. ",
      "doi": "10.5555/1881673.1881723"
    },
    {
      "text": "Nagel, T. (1974). What Is it Like to Be a Bat? Philsophical Review, pp. 435--50.",
      "doi": ""
    },
    {
      "text": "Newlove & Dalby (2005) Laban for All. London: Nick Hern Books.",
      "doi": ""
    },
    {
      "text": "Nishizaka, A. (1997). The Neglected Situation of Vision.: Sage.",
      "doi": ""
    },
    {
      "text": "Nishizaka A. (2000). Seeing what one sees: Perception, emotion and activity. Mind, Culture, and Activity, 7(12), 105--123.",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Harper, R., Mentis, H., Sellen, A., & Taylor, A. (2013). On the naturalness of touchless: Putting the \"interaction\" back into NUI. Embodied Interaction. Spec. issue of ACM Transactions on Computer-Human Interaction (TOCHI).  ",
      "doi": "10.1145/2442106.2442111"
    },
    {
      "text": "Robertson, T. & Loke, L. (2009). Designing situations. Proc of OZCHI, Melbourne, Australia.  ",
      "doi": "10.1145/1738826.1738828"
    },
    {
      "text": "Ross, P .R. & Wensveen, A. G. (2010). Designing behavior in interaction: Using aesthetic experience as a mechanism for design. International Journal of Desigh, 4(2), 3--13.",
      "doi": ""
    },
    {
      "text": "Sheets-Johnstone, M., (1999). Emotion and Movement - A beginning empirical-phenomenological analysis of their relationship. Journal of Consciousness Studies, 6(11-12), pp. 259--277.",
      "doi": ""
    },
    {
      "text": "Subyen, P., Maranan, D. S., Carlson, K., Schiphorst, T., & Pasquier, P. (2011). Flow: Expressing movement quality. The User in Flux Workshop at CHI 2011, Vancouver, BC.",
      "doi": ""
    },
    {
      "text": "Suchman, L. (2000). Embodied practices of engineering work. Mind, Culture and Activity, 7(1-2), 4--18.",
      "doi": ""
    },
    {
      "text": "Wittgenstein, L. (1968). Philosophical Investigations. Blackwell, Oxford.",
      "doi": ""
    }
  ]
}