{
  "doi": "10.1145/2470654.2466252",
  "title": "I see you there!: developing identity-preserving embodied interaction for museum exhibits",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1911-1920",
  "year": 2013,
  "badges": [],
  "abstract": "Museums are increasingly embracing technologies that provide highly-individualized and highly-interactive experiences to visitors. With embodied interaction experiences, increased localization accuracy supports greater nuance in interaction design, but there is usually a tradeoff between fast, accurate tracking and the ability to preserve the identity of users. Customization of experience relies on the ability to detect the identity of visitors, however. We present a method that combines fine-grained indoor tracking with robust preservation of the unique identities of multiple users. Our model merges input from an RFID reader with input from a commercial camera-based tracking system. We developed a probabilistic Bayesian model to infer at run-time the correct identification of the subjects in the camera's field of view. This method, tested in a lab and at a local museum, requires minimal modification to the exhibition space, while addressing several identity-preservation problems for which many indoor tracking systems do not have robust solutions.",
  "authors": [
    {
      "name": "Francesco Cafaro",
      "institution": "University of Illinois at Chicago, Chicago, Illinois, USA",
      "img": "/do/10.1145/contrib-81548028372/rel-imgonly/p1.jpg",
      "acmid": "81548028372",
      "orcid": "missing"
    },
    {
      "name": "Alessandro Panella",
      "institution": "University of Illinois at Chicago, Chicago, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490687794",
      "orcid": "missing"
    },
    {
      "name": "Leilah Lyons",
      "institution": "University of Illinois at Chicago, Chicago, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338490124",
      "orcid": "missing"
    },
    {
      "name": "Jessica Roberts",
      "institution": "University of Illinois at Chicago, Chicago, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470646988",
      "orcid": "missing"
    },
    {
      "name": "Josh Radinsky",
      "institution": "University of Illinois at Chicago, Chicago, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467643572",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, S. Designs for learning: Studying science museum exhibits that do more than entertain. Science Education 88, S1 (2004), S17--S33.",
      "doi": ""
    },
    {
      "text": "Antle, A. N., et al. Towards Utopia : Designing Tangibles for Learning. Design, (2011), 11--20.  ",
      "doi": "10.1145/1999030.1999032"
    },
    {
      "text": "Bahl, P. and Padmanabhan, V. N. RADAR: an inbuilding RF-based user location and tracking system. Proceedings IEEE INFOCOM 2000, 775--784.",
      "doi": ""
    },
    {
      "text": "Bernardin, K., Elbs, A., and Stiefelhagen, R. Multiple object tracking performance metrics and evaluation in a smart room environment. VS'06.",
      "doi": ""
    },
    {
      "text": "Cafaro, F., Lyons, L., Radinsky, J., and Roberts, J. RFID localization for tangible and embodied multi-user interaction with museum exhibits. Ubicomp'10.  ",
      "doi": "10.1145/1864431.1864455"
    },
    {
      "text": "Callaway, C., Stock, O., Dekoven, E., et al. Mobile Drama in an Instrumented Museum: Inducing Group Conversation via Coordinated Narratives. IUI'11, 73--82.  ",
      "doi": "10.1145/1943403.1943416"
    },
    {
      "text": "Camp, F. V. D., Voit, M., and Stiefelhagen, R. Efficient Person Identification using Active Cameras in a Smartroom. MM Workshop, (2010), 17--22.  ",
      "doi": "10.1145/1878039.1878044"
    },
    {
      "text": "Carreras, A. and Pares, N. Designing an Interactive Installation for Children in a Museum to Learn Abstract Concepts. EdMedia 2007, 3454--3459.",
      "doi": ""
    },
    {
      "text": "Correia, N., at al. A multi-touch tabletop for robust multimedia interaction in museums. ITS 2010, 117--120.  ",
      "doi": "10.1145/1936652.1936674"
    },
    {
      "text": "Cox, D., at al. IntelliBadge™ : Towards Providing Location-Aware Value-Added Services at Academic Conferences. Ubicomp 2003, (2003), 264--280.",
      "doi": ""
    },
    {
      "text": "Hallaway, D., Hollerer, T., and Feiner, S. Coarse, inexpensive, infrared tracking for wearable computing. Seventh ISWC 2003, (2003), 69--78. ",
      "doi": "10.5555/946249.946876"
    },
    {
      "text": "Hornecker, E. Interactions around a contextually embedded system. TEI 10, (2010), 169.  ",
      "doi": "10.1145/1709886.1709916"
    },
    {
      "text": "Jimenez Pazmino, P. and Lyons, L. An exploratory study of input modalities for mobile devices used with museum exhibits. CHI 2011, ACM (2011), 895--904.  ",
      "doi": "10.1145/1978942.1979075"
    },
    {
      "text": "Khoshelham, K. Accuracy Analysis of Kinect Depth Data. GeoInformation Science 38, 1.",
      "doi": ""
    },
    {
      "text": "Khoury, H. M. and Kamat, V. R. Evaluation of position tracking technologies for user localization in indoor construction environments. Autom. in Construction 18, 4.",
      "doi": ""
    },
    {
      "text": "Kim, K. and Davis, L. S. Multi-camera Tracking and Segmentation of Occluded People on Ground Plane Using Search-Guided Particle Filtering. ECCV 2006.  ",
      "doi": "10.1007/11744078_8"
    },
    {
      "text": "Kuflik, T., Lanir, J., Dim, E., et al. Indoor positioning: challenges and solutions for indoor cultural heritage sites. IUI 2011, ACM (2011), 375--378.  ",
      "doi": "10.1145/1943403.1943469"
    },
    {
      "text": "Kullback, S. and Leibler, R. A. On information and sufficiency. The Annals of Mathematical Statistics 22, 1.",
      "doi": ""
    },
    {
      "text": "Lehn, D., Vom, Heath, C., and Hindmarsh, J. Conduct and Collaboration in Museums and Galleries. Symbolic Interaction 24, 2 (2001), 189--216.",
      "doi": ""
    },
    {
      "text": "Lonsdale, P., et al. Context awareness for MOBIlearn: Creating an engaging learning experience in an art museum. MLEARN 2004.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. F., et al. Augmenting the Social Space of an Academic Conference. CSCW 2004.  ",
      "doi": "10.1145/1031607.1031615"
    },
    {
      "text": "McDonald, D. W., at al. Proactive displays: Supporting awareness in fluid social environments. Transactions on Computer-Human Interaction 14, 4 (2008), 1--31.  ",
      "doi": "10.1145/1314683.1314684"
    },
    {
      "text": "Mirowski, P., Steck, H., Whiting, P., et al. KLDivergence Kernel Regression for Non-Gaussian Fingerprint Based Localization. Ratio 10, (2011), 21--23.",
      "doi": ""
    },
    {
      "text": "Phillips, P. J., Jiang, F., Narvekar, A., Ayyad, J., and O'Toole, A. J. An other-race effect for face recognition algorithms. ACM Trans. Appl. Percept. 8, 2 (2011).  ",
      "doi": "10.1145/1870076.1870082"
    },
    {
      "text": "Prante, T., et al. Ambient Agoras. CHI 04, (2004), 763.",
      "doi": ""
    },
    {
      "text": "Priyantha, N. B., Chakraborty, A., and Balakrishnan, H. The Cricket location-support system. MobiCom 2000.  ",
      "doi": "10.1145/345910.345917"
    },
    {
      "text": "Ryu, H.-S., Yoon, Y.-J., Lim, M.-E., Park, C.-Y., Park, S.-J., and Choi, S.-M. Picture navigation using an ambient display and implicit interactions. OZCHI 07.  ",
      "doi": "10.1145/1324892.1324939"
    },
    {
      "text": "Shankar, M., et al. Human-tracking systems using pyroelectric infrared detectors. Optical Eng. 45, 10 ('06).",
      "doi": ""
    },
    {
      "text": "Teixeira, T., et al. Tasking Networked CCTV Cameras and Mobile Phones to Identify and Localize Multiple People. Main, (2010), 213--222.  ",
      "doi": "10.1145/1864349.1864367"
    },
    {
      "text": "Xu, A. and Dudek, G. Fourier Tag: A Smoothly Degradable Fiducial Marker System with Configurable Payload Capacity. CRV '11, (2011).  ",
      "doi": "10.1109/CRV.2011.13"
    },
    {
      "text": "Zhang, Y., Partridge, K., and Reich, J. Localizing tags using mobile infrastructure. Lo'CA07, (2007), 279--296. ",
      "doi": "10.5555/1777235.1777258"
    },
    {
      "text": "Zhao, W., et al. Face recognition: A literature survey. ACM Comput. Surv. 35, 4 (2003), 399--458.  ",
      "doi": "10.1145/954339.954342"
    }
  ]
}