{
  "doi": "10.1145/2470654.2466256",
  "title": "Q-methodology as a research and design tool for HCI",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1941-1950",
  "year": 2013,
  "badges": [],
  "abstract": "A \"discount\" version of Q-methodology for HCI, called \"HCI-Q\", can be used in iterative design cycles to explore, from the point of view of users and other stakeholders, what makes technologies personally significant. Initially, designers critically reflect on their own assumptions about how a design may affect social and individual behavior. Then, designers use these assumptions as stimuli to elicit other people's points of view. This process of critical self-reflection and evaluation helps the designer to assess the fit between a design and its intended social context of use. To demonstrate the utility of HCI-Q for research and design, we use HCI-Q to explore stakeholders' responses to a prototype Alternative and Augmentative Communication (AAC) application called Vid2Speech. We show that our adaptation of Q-methodology is useful for revealing the structure of consensus and conflict among stakeholder perspectives, helping to situate design within the context of relevant value tensions and norms.",
  "tags": [
    "personal significance",
    "qualitative methods",
    "quantitative methods",
    "psychology",
    "user studies",
    "design methodology"
  ],
  "authors": [
    {
      "name": "Kathleen O'Leary",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556316956",
      "orcid": "missing"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    },
    {
      "name": "Eve A. Riskin",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100467362",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anandarajan, M., Paravastu, N. and Simmers, C. A. Perceptions of personal web usage in the workplace: A Q-Methodology approach. Cyberpsychology and Behavior, 9, 3 (2006), 325--335.",
      "doi": ""
    },
    {
      "text": "Best, M. L., Wornyo, E., Smyth, T. N. and Etherton, J. Uses of mobile phones in post-conflict Liberia. In Proc. ICTD 2009, IEEE Press (2009), 468--477. ",
      "doi": "10.5555/1812530.1812577"
    },
    {
      "text": "Brown, S. R. Political subjectivity: Applications of Q Methodology in political science. Yale University Press, New Haven, 1980.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M. Five reasons for scenario-based design. Interacting with Computers, 13, 1 (2000), 43--60.",
      "doi": ""
    },
    {
      "text": "Dunne, A. and Raby, F. Design noir: The secret life of electronic objects. August Media, Boston, MA, 2001.",
      "doi": ""
    },
    {
      "text": "Dziopa, F. and Ahern, K. A systematic literature review of the applications of Q-Technique and its methodology. Methodology: European J. of Research Methods for the Behavioral and Social Sciences, 7, 2 (2011), 39--55.",
      "doi": ""
    },
    {
      "text": "Friedman, B. Value sensitive design. In W. S. Bainbridge (ed.), Encyclopedia of Human-Computer Interaction, Berkshire Publishing Group, Great Barrington, MA, (2004), 769--774.",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Boucher, A., Pennington, S., & Walker, B. Cultural probes and the value of uncertainty. interactions, 11,5, (2004), 53--56.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Greenbaum, J. and Kyng, M. Design at work: Cooperative design of computer systems. Lawrence Erlbaum Associates, Hillsdale, NJ, 1991. ",
      "doi": "10.5555/574738"
    },
    {
      "text": "Hassenzahl, M., & Wessler, R. Capturing design space from a user perspective: The repertory grid technique revisited. International Journal of Human- Computer Interaction, 3-4,12, (2000), 441--459.",
      "doi": ""
    },
    {
      "text": "Holtzblatt, K. and Jones, S. Contextual inquiry: A participatory technique for system design. In Participatory Design: Principles and Practices, D. Schuler and A. Namioka (Eds). Lawrence Erlbaum, Hillsdale, NJ, (1993), 177--210.",
      "doi": ""
    },
    {
      "text": "Kensing, F. and Madsen, K. H. Generating visions: Future workshops and metaphorical design. In J. Greenbaum and M. Kyng (eds.), Design at Work: Cooperative Design of Computer Systems. Lawrence Erlbaum, Hillsdale, NJ, (1991), 155--168. ",
      "doi": "10.5555/125470.125433"
    },
    {
      "text": "Kim, J., and Mueller, C. W. Factor analysis: Statistical methods and practical issues. Sage Publications, Newbury Park, CA, 1978.",
      "doi": ""
    },
    {
      "text": "McKeown, B. and Thomas, D. Q Methodology. Sage Publications, Newbury Park, CA, 1988.",
      "doi": ""
    },
    {
      "text": "Meloche, J. A. Q Methodology as a research methodology for human computer interaction. In Proc. OzCHI 1999, Charles Sturt University, (1999), 149--152.",
      "doi": ""
    },
    {
      "text": "Moggridge, B. Futures and alternative nows. In Designing Interactions. M.I.T. Press, Cambridge, MA, (2007), 587--611.",
      "doi": "10.5555/1196347"
    },
    {
      "text": "Nathan, L. P., Klasnja, P. V. and Friedman, B. Value scenarios: A technique for envisioning systemic effects of new technologies. In Ext. Abstracts CHI 2007, ACM Press (2007), 2585--2590.  ",
      "doi": "10.1145/1240866.1241046"
    },
    {
      "text": "Nielsen, J. Usability engineering. Academic Press, San Diego, CA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "O'Leary, K., Delahunt, C., Dowden, P., Darmansya, I., Heng, J., Riskin, E. A., Ladner, R. E. and Wobbrock, J. O. Design goals for a system for enhancing AAC with personalized video. Proc. ASSETS 2012, ACM Press, (2012), 223--224.  ",
      "doi": "10.1145/2384916.2384964"
    },
    {
      "text": "Shapiro, D. The limits of ethnography: Combining social sciences for CSCW. In Proc. CSCW 1994, ACM Press (1994), 417--428.  ",
      "doi": "10.1145/192844.193064"
    },
    {
      "text": "Stephenson, W. The study of behavior: Q-Technique and its methodology. Univ. of Chicago Press, Chicago, IL, (1953).",
      "doi": ""
    },
    {
      "text": "Stephenson, W. Correlating persons instead of tests. Character and Personality, 4, (1935), 17--24.",
      "doi": ""
    },
    {
      "text": "Watts, S. and Stenner, P. Doing Q Methodological research: Theory, method and interpretation. Sage, Los Angeles, CA, 2012.",
      "doi": ""
    },
    {
      "text": "Watts, S. and Stenner, P. Doing Q methodology: theory, method and interpretation. Qualitative Research in Psychology, 2, 1 (2005), 67--91.",
      "doi": ""
    },
    {
      "text": "Winograd, T., & Flores, F. Understanding computers and cognition: A new foundation for design. Addison-Wesley, Reading, MA, 1987. ",
      "doi": "10.5555/576359"
    }
  ]
}