{
  "doi": "10.1145/2470654.2466420",
  "title": "Webzeitgeist: design mining the web",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3083-3092",
  "year": 2013,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Advances in data mining and knowledge discovery have transformed the way Web sites are designed. However, while visual presentation is an intrinsic part of the Web, traditional data mining techniques ignore render-time page structures and their attributes. This paper introduces design mining for the Web: using knowledge discovery techniques to understand design demographics, automate design curation, and support data-driven design tools. This idea is manifest in Webzeitgeist, a platform for large-scale design mining comprising a repository of over 100,000 Web pages and 100 million design elements. This paper describes the principles driving design mining, the implementation of the Webzeitgeist architecture, and the new class of data-driven design applications it enables.",
  "authors": [
    {
      "name": "Ranjitha Kumar",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702964",
      "orcid": "missing"
    },
    {
      "name": "Arvind Satyanarayan",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81500663321/rel-imgonly/arvind-satyanarayan.jpg",
      "acmid": "81500663321",
      "orcid": "0000-0001-5564-635X"
    },
    {
      "name": "Cesar Torres",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81557154856/rel-imgonly/cesartorres.jpg",
      "acmid": "81557154856",
      "orcid": "missing"
    },
    {
      "name": "Maxine Lim",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502713722",
      "orcid": "missing"
    },
    {
      "name": "Salman Ahmad",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484643182",
      "orcid": "missing"
    },
    {
      "name": "Scott R. Klemmer",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    },
    {
      "name": "Jerry O. Talton",
      "institution": "Intel Corporation, Hillsboro, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481631",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "10gen, I. MongoDB. 2012. http://www.mongodb.org.",
      "doi": ""
    },
    {
      "text": "Adar, E., Dontcheva, M., Fogarty, J., and Weld, D. S. Zoetrope: interacting with the ephemeral web. In: Proc. UIST. 2008, 239--248.  ",
      "doi": "10.1145/1449715.1449756"
    },
    {
      "text": "Apple Inc. The WebKit open source project. 2012. http://www.webkit.org/.",
      "doi": ""
    },
    {
      "text": "Chechik, G., Sharma, V., Shalit, U., and Bengio, S. An online algorithm for large scale image similarity learning. In: Proc. NIPS. 2009.",
      "doi": ""
    },
    {
      "text": "Crockford, D. The application/json Media Type for JavaScript Object Notation (JSON). Tech. rep. RFC 4627. IETF, July 2006.",
      "doi": ""
    },
    {
      "text": "CSS Working Group. Cascading style sheets, level 2. May 1998. http://www.w3.org/TR/2008/REC-CSS220080411/.",
      "doi": ""
    },
    {
      "text": "Duyne, D. K. van, Landay, J. A., and Hong, J. I. The Design of Sites. Addison-Wesley, 2002.",
      "doi": ""
    },
    {
      "text": "Getoor, L. and Diehl, C. P. Link mining: a survey. SIGKDD Explorations Newsletter 7, 2 (2005), 3--12.  ",
      "doi": "10.1145/1117454.1117456"
    },
    {
      "text": "Google Inc. Web Authoring Statistics. 2005. https://developers.google.com/webmasters/state-ofthe-web/.",
      "doi": ""
    },
    {
      "text": "Hays, J. and Efros, A. A. Scene completion using millions of photographs. In: Proc. SIGGRAPH. ACM, 2007.  ",
      "doi": "10.1145/1275808.1276382"
    },
    {
      "text": "Herring, S. R., Chang, C.-C., Krantzler, J., and Bailey, B. P. Getting inspired!: understanding how and why examples are used in creative design practice. In: Proc. CHI. 2009.  ",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Hirai, J., Raghavan, S., Garcia-Molina, H., and Paepcke, A. WebBase: a repository of Web pages. Computer Networks 33, 1-6 (2000), 277--293.  ",
      "doi": "10.1016/S1389-1286%2800%2900063-3"
    },
    {
      "text": "Indyk, P. and Motwani, R. Approximate nearest neighbors: towards removing the curse of dimensionality. In: Proc. STOC. 1998.  ",
      "doi": "10.1145/276698.276876"
    },
    {
      "text": "Ivory, M. Y. and Hearst, M. A. Statistical profiles of highly-rated Web sites. In: Proc. CHI. 2002, 367--374.  ",
      "doi": "10.1145/503376.503442"
    },
    {
      "text": "Kohavi, R., Henne, R. M., and Sommerfield, D. Practical guide to controlled experiments on the web: listen to your customers not to the HiPPO. In: KDD. 2007.  ",
      "doi": "10.1145/1281192.1281295"
    },
    {
      "text": "Kosala, R. Web mining research: a survey. SIGKDD Explorations 2 (2000).  ",
      "doi": "10.1145/360402.360406"
    },
    {
      "text": "Kumar, R., Talton, J. O., Ahmad, S., and Klemmer, S. R. Bricolage: example-based retargeting for Web design. In: Proc. CHI. ACM, 2011.  ",
      "doi": "10.1145/1978942.1979262"
    },
    {
      "text": "Kumar, R., Talton, J. O., Ahmad, S., and Klemmer, S. R. Data-driven Web design. In: Proc. ICML. 2012.",
      "doi": ""
    },
    {
      "text": "Le, Q., Ranzato, M., Monga, R., Devin, M., Chen, K., Corrado, G., Dean, J., and Ng, A. Building high-level features using large scale unsupervised learning. In: Proc. ICML. 2012.",
      "doi": ""
    },
    {
      "text": "Lee, B., Srivastava, S., Kumar, R., Brafman, R., and Klemmer, S. R. Designing with interactive example galleries. In: Proc. CHI. 2010.  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Lee, H.-T., Leonard, D., Wang, X., and Loguinov, D. IRLbot: scaling to 6 billion pages and beyond. In: Proc. WWW. ACM, Beijing, China, 2008, 427--436.  ",
      "doi": "10.1145/1367497.1367556"
    },
    {
      "text": "Lim, M., Kumar, R., Satyanarayan, A., Torres, C., Talton, J. O., and Klemmer, S. R. Learning Structural Semantics for the Web. Tech. rep. CSTR 2012-03. Stanford University, 2012.",
      "doi": ""
    },
    {
      "text": "Liu, B. Web Data Mining: Exploring Hyperlinks, Contents, and Usage Data. Springer-Verlag, 2011. ",
      "doi": "10.5555/2019378"
    },
    {
      "text": "Liu, B. and Chen-Chuan-Chang, K. Editorial: special issue on web content mining. SIGKDD Explorations Newsletter 6, 2 (2004), 1--4.  ",
      "doi": "10.1145/1046456.1046457"
    },
    {
      "text": "Neo Technology. Neo4j. 2012. http://neo4j.org/.",
      "doi": ""
    },
    {
      "text": "Oliva, A. and Torralba, A. Modeling the shape of the scene: a holistic representation of the spatial envelope. International Journal of Computer Vision 42, 3 (2001), 145--175.  ",
      "doi": "10.1023/A%3A1011139631724"
    },
    {
      "text": "Oracle Corporation. MySQL. 2012. http://www.mysql.com.",
      "doi": ""
    },
    {
      "text": "Pollak, B. and Gatterbauer, W. Creating permanent test collections of Web pages for information extraction research. In: Proc. SOFSEM. 2. 2007, 103--115.",
      "doi": ""
    },
    {
      "text": "Rabin, M. O. Fingerprinting by random polynomials. Tech. rep. Center for Research in Computing Technology, Harvard University, 1981.",
      "doi": ""
    },
    {
      "text": "Richardson, L. and Ruby, S. Restful Web services. First edition. O'Reilly, 2007. ",
      "doi": "10.5555/1406352"
    },
    {
      "text": "Ritchie, D., Kejriwal, A., and Klemmer, S. R. d. tour: style-based exploration of design example galleries. In: Proc. UIST. 2011.  ",
      "doi": "10.1145/2047196.2047216"
    },
    {
      "text": "Srivastava, J., Cooley, R., Deshpande, M., and Tan, P. N. Web usage mining: discovery and applications of usage patterns from Web data. SIGKDD Explorations Newsletter 1, 2 (2000), 12--23.  ",
      "doi": "10.1145/846183.846188"
    },
    {
      "text": "Sun, F., Song, D., and Liao, L. DOM based content extraction via text density. In: Proc. SIGIR. ACM, Beijing, China, 2011, 245--254.  ",
      "doi": "10.1145/2009916.2009952"
    },
    {
      "text": "Talton, J., Yang, L., Kumar, R., Lim, M., Goodman, N. D., and Měch, R. Learning design patterns with Bayesian grammar induction. In: Proc. UIST. 2012.  ",
      "doi": "10.1145/2380116.2380127"
    },
    {
      "text": "Teevan, J., Dumais, S. T., Liebling, D. J., and Hughes, R. L. Changing how people view changes on the Web. In: Proc. UIST. 2009.  ",
      "doi": "10.1145/1622176.1622221"
    },
    {
      "text": "W3C Working Group. Cascading style sheets snapshot 2010. May 2011. http://www.w3.org/TR/CSS/.",
      "doi": ""
    },
    {
      "text": "W3C Working Group. HTML 4.01 specification. Dec. 1999. http://www.w3.org/TR/html401/.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Star schema - Wikipedia, the free encyclopedia. {Online; accessed 19-September-2012}. 2012. http://en.wikipedia.org/wiki/Star_schema.",
      "doi": ""
    },
    {
      "text": "Yi, L., Liu, B., and Li, X. Eliminating noisy information in Web pages for data mining. In: Proc. SIGKDD. ACM, 2003, 296--305.  ",
      "doi": "10.1145/956750.956785"
    }
  ]
}