{
  "doi": "10.1145/2470654.2481334",
  "title": "All the news that's fit to read: a study of social annotations for news reading",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2407-2416",
  "year": 2013,
  "badges": [],
  "abstract": "As news reading becomes more social, how do different types of annotations affect people's selection of news articles? This paper reports on results from two experiments looking at social annotations in two different news reading contexts. The first experiment simulates a logged-out experience with annotations from strangers, a computer agent, and a branded company. Results indicate that, perhaps unsurprisingly, annotations by strangers have no persuasive effects. However, surprisingly, unknown branded companies still had a persuasive effect. The second experiment simulates a logged-in experience with annotations from friends, finding that friend annotations are both persuasive and improve user satisfaction over their article selections. In post-experiment interviews, we found that this increased satisfaction is due partly because of the context that annotations add. That is, friend annotations both help people decide what to read, and provide social context that improves engagement. Interviews also suggest subtle expertise effects. We discuss implications for design of social annotation systems and suggestions for future research.",
  "tags": [
    "experiment",
    "news reading",
    "recommendations",
    "social annotation",
    "social computing",
    "user study"
  ],
  "authors": [
    {
      "name": "Chinmay Kulkarni",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556575456",
      "orcid": "0000-0003-4922-6601"
    },
    {
      "name": "Ed Chi",
      "institution": "Google, Inc., Mountain View, California, USA",
      "img": "/do/10.1145/contrib-81100330316/rel-imgonly/2018-edchi-dsc_3705-2048px.jpg",
      "acmid": "81100330316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abdi, H. Holm's sequential bonferroni procedure. Encyclopedia of research design (N. Salkind, D. M. Dougherty, and B. Frey, eds.). Sage, Thousand Oaks, California (2010), 573--577.",
      "doi": ""
    },
    {
      "text": "Allison, P. D. Missing Data. Sage, Thousand Oaks, CA, 2001.",
      "doi": ""
    },
    {
      "text": "Altman, I., Vinsel, A., and Brown, B. Dialectic conceptions in social psychology: An application to social penetration and privacy regulation. Advances in experimental social psychology 14 (1981), 107--160.",
      "doi": ""
    },
    {
      "text": "Bao, S., Xue, G., Wu, X., Yu, Y., Fei, B., and Su, Z. Optimizing web search using social annotations. In Proceedings of the 16th international conference on World Wide Web, ACM (2007), 501--510.  ",
      "doi": "10.1145/1242572.1242640"
    },
    {
      "text": "Cialdini, R. Descriptive social norms as underappreciated sources of social control. Psychometrika 72, 2 (2007), 263--268.",
      "doi": ""
    },
    {
      "text": "Cosley, D., Lam, S., Albert, I., Konstan, J., and Riedl, J. Is seeing believing?: how recommender system interfaces affect users' opinions. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2003), 585--592.  ",
      "doi": "10.1145/642611.642713"
    },
    {
      "text": "Diakopoulos, N., De Choudhury, M., and Naaman, M. Finding and assessing social media information sources in the context of journalism. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, ACM (2012), 2451--2460.  ",
      "doi": "10.1145/2207676.2208409"
    },
    {
      "text": "Fogg, B. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 5.  ",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. 1959. Garden City, NY (1959).",
      "doi": ""
    },
    {
      "text": "Golbeck, J., and Fleischmann, K. Trust in social q&a: the impact of text and photo cues of expertise. Proceedings of the American Society for Information Science and Technology 47, 1 (2010), 1--10. ",
      "doi": "10.5555/1920331.1920442"
    },
    {
      "text": "Google. Introducing google social search: I finally found my friend's new york blog! http://googleblog.blogspot.com/2009/10/introducing-google-social-search-i.html, 2009.",
      "doi": ""
    },
    {
      "text": "Hermida, A. Twittering the news: The emergence of ambient journalism. Journalism Practice 4, 3 (2010), 297--308.",
      "doi": ""
    },
    {
      "text": "Joachims, T., Granka, L., Pan, B., Hembrooke, H., Radlinski, F., and Gay, G. Evaluating the accuracy of implicit feedback from clicks and query reformulations in web search. ACM Transactions on Information systems 25, 2 (2007).  ",
      "doi": "10.1145/1229179.1229181"
    },
    {
      "text": "Knobloch-Westerwick, S., Sharma, N., Hansen, D., and Alter, S. Impact of popularity indications on readers' selective exposure to online news. Journal of Broadcasting & Electronic Media 49, 3 (2005), 296--313.",
      "doi": ""
    },
    {
      "text": "Komanduri, S., Fang, L., Huffaker, D., and Staddon, J. Around the water cooler: Shared discussion topics and contact closeness in social search. In Sixth International AAAI Conference on Weblogs and Social Media (2012).",
      "doi": ""
    },
    {
      "text": "Lampe, C., Ellison, N., and Steinfield, C. A familiar face (book): profile elements as signals in an online social network. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2007), 435--444.  ",
      "doi": "10.1145/1240624.1240695"
    },
    {
      "text": "Langsrud, Ø. Anova for unbalanced data: Use type ii instead of type iii sums of squares. Statistics and Computing 13, 2 (2003), 163--167.  ",
      "doi": "10.1023/A%3A1023260610025"
    },
    {
      "text": "Lee, A., and Bruckman, A. Judging you by the company you keep: dating on social networking sites. In Proceedings of the 2007 international ACM conference on Supporting group work, ACM (2007), 371--378.  ",
      "doi": "10.1145/1316624.1316680"
    },
    {
      "text": "Li, L., Chu, W., Langford, J., and Schapire, R. A contextual-bandit approach to personalized news article recommendation. In Proceedings of the 19th international conference on World wide web, ACM (2010), 661--670.  ",
      "doi": "10.1145/1772690.1772758"
    },
    {
      "text": "Masli, M., and Terveen, L. Evaluating compliance-without-pressure techniques for increasing participation in online communities. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, ACM (2012), 2915--2924.  ",
      "doi": "10.1145/2207676.2208698"
    },
    {
      "text": "Muralidharan, A., Gyongyi, Z., and Chi, E. H. Social annotations in web search. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12) (New York, NY, 2012), 1085--1094.  ",
      "doi": "10.1145/2207676.2208554"
    },
    {
      "text": "Nelson, L., Held, C., Pirolli, P., Hong, L., Schiano, D., and Chi, E. With a little help from my friends: examining the impact of social annotations in sensemaking tasks. In Proceedings of the 27th international conference on Human factors in computing systems, ACM (2009), 1795--1798.  ",
      "doi": "10.1145/1518701.1518977"
    },
    {
      "text": "Palen, L., and Dourish, P. Unpacking privacy for a networked world. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2003), 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Raghubir, P., and Srivastava, J. Monopoly money: The effect of payment coupling and form on spending behavior. Journal of Experimental Psychology: Applied 14, 3 (2008), 213.",
      "doi": ""
    },
    {
      "text": "Reeves, B., and Nass, C. The media equation: How people treat computers, television, and new media like real people and places. Chicago, IL, US: Center for the Study of Language and Information; New York, NY, US: Cambridge University Press, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Sundar, S., Knobloch-Westerwick, S., and Hastall, M. News cues: Information scent and cognitive heuristics. Journal of the American Society for Information Science and Technology 58, 3 (2007), 366--378.  ",
      "doi": "10.5555/1228983.1228994"
    },
    {
      "text": "Sundar, S., and Nass, C. Conceptualizing sources in online news. Journal of Communication 51, 1 (2006), 52--72.",
      "doi": ""
    },
    {
      "text": "Zanardi, V., and Capra, L. Social ranking: uncovering relevant content using tag-based recommender systems. In Proceedings of the 2008 ACM conference on Recommender systems, ACM (2008), 51--58.  ",
      "doi": "10.1145/1454008.1454018"
    },
    {
      "text": "Zhen, Y., Li, W., and Yeung, D. Tagicofi: tag informed collaborative filtering. In Proceedings of the third ACM conference on Recommender systems, ACM (2009), 69--76.  ",
      "doi": "10.1145/1639714.1639727"
    },
    {
      "text": "Zhu, H., Huberman, B., and Luon, Y. To switch or not to switch: understanding social influence in online choices. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, ACM (2012), 2257--2266.  ",
      "doi": "10.1145/2207676.2208383"
    }
  ]
}