{
  "doi": "10.1145/2470654.2466431",
  "title": "Canyon: providing location awareness of multiple moving objects in a detail view on large displays",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3149-3158",
  "year": 2013,
  "badges": [],
  "abstract": "Overview+Detail interfaces can be used to examine the details of complex data while retaining the data's overall context. Dynamic data introduce challenges for these interfaces, however, as moving objects may exit the detail view, as well as a person's field of view if they are working at a large interactive surface. To address this \"off-view\" problem, we propose a new information visualization technique, called Canyon. This technique attaches a small view of an off-view object, including some surrounding context, to the external boundary of the detail view. The area between the detail view and the region containing the off-view object is virtually \"folded\" to conserve space. A comparison study was conducted contrasting the benefits and limitations of Canyon to an established technique, called Wedge. Canyon was more accurate across a number of tasks, especially more complex tasks, and was comparably efficient.",
  "authors": [
    {
      "name": "Alexandra Ion",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Upper Austria, Austria",
      "img": "/do/10.1145/contrib-99658655048/rel-imgonly/portrait_square_20103.jpg",
      "acmid": "99658655048",
      "orcid": "missing"
    },
    {
      "name": "Y.-L. Betty Chang",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557306456",
      "orcid": "missing"
    },
    {
      "name": "Michael Haller",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/do/10.1145/contrib-81100048383/rel-imgonly/michael_-_closeup640.jpg",
      "acmid": "81100048383",
      "orcid": "missing"
    },
    {
      "name": "Mark Hancock",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100211996/rel-imgonly/acm.jpg",
      "acmid": "81100211996",
      "orcid": "missing"
    },
    {
      "name": "Stacey D. Scott",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100544371",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Avrahami, D., Wobbrock, J. O., and Izadi, S. Portico: Tangible interaction on and around a tablet. Proceedings of UIST'11, (2011), 347--356.  ",
      "doi": "10.1145/2047196.2047241"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., et al. Drag-and-pop and drag-and-pick: Techniques for accessing remote screen content on touch-and pen-operated systems. Proceedings of INTERACT'03, IOS Press (2003), 57--64.",
      "doi": ""
    },
    {
      "text": "Baudisch, P. and Good, N. Keeping things in context: A comparative evaluation of focus plus context screens, overviews, and zooming. Proceedings of CHI'02, (2002), 259--266.  ",
      "doi": "10.1145/503376.503423"
    },
    {
      "text": "Baudisch, P. and Rosenholtz, R. Halo: A technique for visualizing off-screen objects. Proceedings of CHI'03, (2003), 481--488.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Burigat, S., Chittaro, L., and Gabrielli, S. Visualizing locations of off-screen objects on mobile devices: A comparative evaluation of three approaches. Proceedings of MobileHCI'06, ACM (2006), 239--246.  ",
      "doi": "10.1145/1152215.1152266"
    },
    {
      "text": "Burigat, S. and Chittaro, L. Visualizing references to off-screen content on mobile devices: A comparison of Arrows, Wedge, and Overview+Detail. Interacting with Computers 23, 2 (2011), 156--166.  ",
      "doi": "10.1016/j.intcom.2011.02.005"
    },
    {
      "text": "Carpendale, M. S. T. and Montagnese, C. A framework for unifying presentation space. Proceedings of UIST'01, (2001), 82--92.  ",
      "doi": "10.1145/502348.502358"
    },
    {
      "text": "Cockburn, A., Karlson, A., and Bederson, B. B. A review of overview+detail, zooming, and focus+context interfaces. ACM Computing Surveys 41, 1 (2008), 1--31.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Elmqvist, N., Henry, N., Riche, Y., and Fekete, J.-D. Mélange: Space folding for multi-focus interaction. Proceedings of CHI'08, (2008), 1333--1342.  ",
      "doi": "10.1145/1357054.1357263"
    },
    {
      "text": "Frisch, M. and Dachselt, R. Off-screen visualization techniques for class diagrams. Proceedings of SOFTVIS'10, (2010), 163--172.  ",
      "doi": "10.1145/1879211.1879236"
    },
    {
      "text": "Furnas, G. W. Generalized fisheye views. Proceedings of CHI'86, (1986), 16--23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: Focal and peripheral awareness in multiple monitor use. Proceedings of CHI'01, (2001), 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Gustafson, S., Baudisch, P., Gutwin, C., and Irani, P. Wedge: Clutter-free visualization of off-screen locations. Proceedings of CHI'08, (2008), 787--796.  ",
      "doi": "10.1145/1357054.1357179"
    },
    {
      "text": "Gustafson, S. and Irani, P. Comparing visualizations for tracking off-screen moving targets. Extended Abstracts CHI'07, (2007), 2399--2404.  ",
      "doi": "10.1145/1240866.1241014"
    },
    {
      "text": "Igarashi, T. and Hinckley, K. Speed-dependent automatic zooming for browsing large documents. Proceedings of UIST'00, (2000), 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Irani, P., Gutwin, C., and Yang, X. Improving selection of off-screen targets with hopping. Proceedings of CHI'06, (2006), 299--308.  ",
      "doi": "10.1145/1124772.1124818"
    },
    {
      "text": "Javed, W., Ghani, S., and Elmqvist, N. PolyZoom: Multiscale and multifocus exploration in 2D visual spaces. Proceedings of CHI'12, (2012), 287--296.  ",
      "doi": "10.1145/2207676.2207716"
    },
    {
      "text": "Moscovich, T., Chevalier, F., Henry, N., Pietriga, E., and Fekete, J.-D. Topology-aware navigation in large networks. Proceedings of CHI'09, (2009), 2319--2328.  ",
      "doi": "10.1145/1518701.1519056"
    },
    {
      "text": "Perlin, K. and Fox, D. Pad: An alternative approach to the computer interface. Proceedings of SIGGRAPH'93, (1993), 57--64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Plaisant, C., Carr, D., and Hasegawa, H. When an Intermediate View Matters a 2D-browser Experiment. University of Maryland, Systems Research Center, 1992.",
      "doi": ""
    },
    {
      "text": "Plumlee, M. D. and Ware, C. Zooming versus multiple window interfaces: Cognitive costs of visual comparisons. ACM Transactions on Computer-Human Interaction (TOCHI) 13, 2 (2006), 179--209.  ",
      "doi": "10.1145/1165734.1165736"
    },
    {
      "text": "Shoemaker, G. and Gutwin, C. Supporting multi-point interaction in visual workspaces. Proceedings of CHI'07, (2007), 999--1008.  ",
      "doi": "10.1145/1240624.1240777"
    },
    {
      "text": "Spence, R. and Apperley, M. Data base navigation: An office environment for the professional. Behaviour & Information Technology 1, 1 (1982), 43--54.",
      "doi": ""
    },
    {
      "text": "Tobiasz, M., Isenberg, P., and Carpendale, S. Lark: Coordinating co-located collaboration with information visualization. IEEE Transactions on Visualization and Computer Graphics 15, 6 (2009), 1065--1072.  ",
      "doi": "10.1109/TVCG.2009.162"
    },
    {
      "text": "Ware, C. and Lewis, M. The DragMag image magnifier. Conference companion CHI'95, (1995), 407--408.  ",
      "doi": "10.1145/223355.223749"
    },
    {
      "text": "Wigdor, D., Jiang, H., Forlines, C., Borkin, M., and Shen, C. WeSpace: The design development and deployment of a walk-up and share multi-surface visual collaboration system. Proceedings of CHI'09, (2009), 1237--1246.  ",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Zellweger, P. T., Mackinlay, J. D., Good, L., Stefik, M., and Baudisch, P. City lights: Contextual views in minimal space. Extended Abstracts CHI'03, (2003), 838--839.  ",
      "doi": "10.1145/765891.766022"
    }
  ]
}