{
  "doi": "10.1145/2470654.2466469",
  "title": "Taking data exposure into account: how does it affect the choice of sign-in accounts?",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3423-3426",
  "year": 2013,
  "badges": [],
  "abstract": "Online services collect personal data from their users, sometimes with no clear need. We studied how users sign-in to web sites using federated IDs, and found that most survey respondents were not aware of the data they expose. However, when presented with the tradeoffs behind each sign-in option, respondents reported a willingness to change how they sign-in to reduce their data exposure or, in fewer cases, to increase it to receive more benefits from the service. Our findings suggest that data exposure is a concern for users, and that there is a need for finding clearer ways for communicating it for each sign-in option.",
  "authors": [
    {
      "name": "Shahar Ronen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659405372",
      "orcid": "missing"
    },
    {
      "name": "Oriana Riva",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339524621",
      "orcid": "missing"
    },
    {
      "name": "Maritza Johnson",
      "institution": "University of California - Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361592791",
      "orcid": "missing"
    },
    {
      "name": "Donald Thompson",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557554056",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barkuus, L. The Mismeasurement of privacy: Using contextual integrity to reconsider privacy in HCI. In CHI '12, ACM (2012), 367--376.  ",
      "doi": "10.1145/2207676.2207727"
    },
    {
      "text": "Braunstein, A. et al. Indirect content privacy surveys: measuring privacy without asking about it. In SOUPS '11, ACM (2011).  ",
      "doi": "10.1145/2078827.2078847"
    },
    {
      "text": "Charkam, A. 5 design tricks Facebook uses to affect your privacy decisions. Tech Crunch (Aug 25, 2012). Accessed Sep. 5, 2012. http://techcrunch.com/2012/08/25/5-designtricks-facebook-uses-to-affect-your-privacy-decisions/",
      "doi": ""
    },
    {
      "text": "Dhamija, R., and Dusseault, L. The seven flaws of identity management: Usability and security challenges. IEEE Security & Privacy 6, 2 (2008), 24--29.  ",
      "doi": "10.1109/MSP.2008.49"
    },
    {
      "text": "Good, N. et al. Stopping spyware at the gate: A user study of privacy, notice, and spyware. SOUPS '05, ACM (2005), 43--52.  ",
      "doi": "10.1145/1073001.1073006"
    },
    {
      "text": "Grossklags, J., and Good, N. Empirical studies on software notices to inform policy makers and usability designers. In USEC '07, LNCS, Springer (2007). ",
      "doi": "10.5555/1785594.1785637"
    },
    {
      "text": "Kelley, P. G., et al. Standardizing privacy notices: an online study of the nutrition label approach. In CHI '10. ACM (2010), 1573--1582.  ",
      "doi": "10.1145/1753326.1753561"
    },
    {
      "text": "King, J., et al. Privacy: is there an app for that?. In SOUPS '11, ACM (2011).  ",
      "doi": "10.1145/2078827.2078843"
    },
    {
      "text": "Maler, E., and Reed, D. The Venn of identity: Options and issues in federated identity management. IEEE Security & Privacy 6, 2 (2008), 16--23.  ",
      "doi": "10.1109/MSP.2008.50"
    },
    {
      "text": "Shehab, M., et al. 2011. ROAuth: recommendation based open authorization. In SOUPS '11, ACM (2011).  ",
      "doi": "10.1145/2078827.2078842"
    },
    {
      "text": "Shim, S. S. Y. et al. Federated identity management. Computer 38, 12 (2005), 120--122.  ",
      "doi": "10.1109/MC.2005.408"
    },
    {
      "text": "Sun, S.-T. et al. What makes users refuse web single sign-on? An empirical investigation of OpenID. In SOUPS '11, ACM (2011).  ",
      "doi": "10.1145/2078827.2078833"
    },
    {
      "text": "What they know. Wall Street Journal. http://blogs.wsj.com/wtk.",
      "doi": ""
    }
  ]
}