{
  "doi": "10.1145/2470654.2481313",
  "title": "Turbulence in the clouds: challenges of cloud-based information work",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2273-2282",
  "year": 2013,
  "badges": [],
  "abstract": "We report on a qualitative study of the user experience of cloud-based information work. We characterize the information work practices and challenges that exist largely at the different intersections of three constructs - cloud-based services, collaborations, and digital identifiers. We also demonstrate how the misalignment of these three constructs is experienced as a \"losing battle\" that has led to miscommunication among collaborators, the abandonment of cloud-based services, and the irreparable blurring of digital identities.",
  "tags": [
    "information management",
    "information work",
    "cloud computing",
    "digital identifiers"
  ],
  "authors": [
    {
      "name": "Amy Voida",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100147309",
      "orcid": "missing"
    },
    {
      "name": "Judith S. Olson",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/do/10.1145/contrib-81350567367/rel-imgonly/81350567367.jpg",
      "acmid": "81350567367",
      "orcid": "missing"
    },
    {
      "name": "Gary M. Olson",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/do/10.1145/contrib-81100178543/rel-imgonly/81100178543.jpg",
      "acmid": "81100178543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. Q. & Rainie, L. (2010). The future of cloud computing. Online: http://www.pewinternet.org/Reports/2010/The-Future-of-cloud-computing.pdf",
      "doi": ""
    },
    {
      "text": "Armbrust, M., Fox, A., Griffith, R., Joseph, A. D., Katz, R., Konwinski, A., Lee, G., Patterson, D., Rabkin, A., Stoica, I., & Zaharia, M. (2010). A view of cloud computing. Communications of the ACM, 53(4), 50--58.  ",
      "doi": "10.1145/1721654.1721672"
    },
    {
      "text": "Berlin, L. M., Jeffries, R., O'Day, V. L., Paepcke, A., & Wharton, C. (1993). Where did you put it? Issues in the design and use of a group memory. In Proc. CHI 1993. New York: ACM Press, pp. 23--30.  ",
      "doi": "10.1145/169059.169063"
    },
    {
      "text": "Brewer, M. B. & Gardner, W. (1996). Who is this \"we\"? Levels of collective identity and self representations. Journal of Personality and Social Psychology, 71(1), 83--93.",
      "doi": ""
    },
    {
      "text": "Corbin, J. & Strauss, A. (2008). Basics of qualitative research: Techniques and procedures for developing grounded theory (3rd ed.). Los Angeles: Sage Publications.",
      "doi": ""
    },
    {
      "text": "DiMicco, J. M., & Millen, D. R. (2007). Identity management: Multiple presentations of self in Facebook. In Proc. Group 2007. New York: ACM Press, pp. 383--386.  ",
      "doi": "10.1145/1316624.1316682"
    },
    {
      "text": "Efimova, L. & Grudin, J. (2007). Crossing boundaries: A case study of employee blogging. In Proc. HICSS 40. Los Alamitos, CA: IEEE Computer Society Press, pp. 86a.  ",
      "doi": "10.1109/HICSS.2007.159"
    },
    {
      "text": "Erickson, T. (2006). From PIM to GIM: Personal information management in group contexts. Communications of the ACM, 49(1), 74--75.  ",
      "doi": "10.1145/1107458.1107495"
    },
    {
      "text": "Farnham, S. D. & Churchill, E. F. (2011). Faceted identity, faceted lives: Social and technical issues with being yourself online. In Proc. CSCW 2011. New York: ACM Press, pp. 359--368.  ",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "Farnham, S. D., Turski, A., & Halai, S. (2012). Docs.com: Social file sharing in Facebook. In Proc. ICWSM 2012. Cambridge, MA: AAAI Press.",
      "doi": ""
    },
    {
      "text": "Goffman, E. (1961). Encounters: Two studies in the sociology of interaction. Indianapolis, IN: Bobbs-Merrill.",
      "doi": ""
    },
    {
      "text": "Gross, B. M. (2009). Names of our lives. In Proc. CSE. Los Alamitos, CA: IEEE Computer Society Press, pp. 747--752.  ",
      "doi": "10.1109/CSE.2009.474"
    },
    {
      "text": "Gross, B. M. & Churchill, E. F. (2007). Addressing constraints: Multiple usernames, task spillage and notions of identity. In Ext. Abstracts CHI 2007. New York: ACM Press, pp. 2393--2398.  ",
      "doi": "10.1145/1240866.1241013"
    },
    {
      "text": "Howard, J. (2000). Social psychology of identities. Annual Review of Sociology, 26, 367--393.",
      "doi": ""
    },
    {
      "text": "Lampinen, A., Tamminen, S., & Oulasvirta, A. (2009). All my people right here, right now: Management of group co-presence on a social networking site. In Proc. GROUP 2009. New York: ACM Press, pp. 281--290.  ",
      "doi": "10.1145/1531674.1531717"
    },
    {
      "text": "Lutters, W. G., Ackerman, M. S., & Zhou, X. (2007). Group Information Management. In W. Jones & J. Teevan (Eds.), Personal Information Management (pp. 236--248), Seattle: University of Washington Press.",
      "doi": ""
    },
    {
      "text": "Marshall, C. & Tang, J. C. (2012). That syncing feeling: Early user experiences with the cloud. In Proc. DIS 2012. New York: ACM Press, pp. 544--553.  ",
      "doi": "10.1145/2317956.2318038"
    },
    {
      "text": "Mueller, M. L., Park, Y. Lee, J., & Kim, T. (2006). Digital identity: How users value the attributes of online identifiers. Information Economics and Policy, 18, 405--422.",
      "doi": ""
    },
    {
      "text": "Muller, M., Millen, D. R., & Feinberg, J. (2010). Patterns of usage in an enterprise file-sharing service: Publicizing, discovering, and telling the news. In Proc. CHI 2010. New York: ACM Press, pp. 763--766.  ",
      "doi": "10.1145/1753326.1753438"
    },
    {
      "text": "Rader, E. (2009). Yours, mine, and (not) ours: Social influences on group information repositories. In Proc. CHI 2009. New York: ACM Press, pp. 2095--2098.  ",
      "doi": "10.1145/1518701.1519019"
    },
    {
      "text": "Shami, N. S., Muller, M., & Millen, D. (2011). Browse and discover: Social file sharing in the enterprise. In Proc. CSCW 2011. New York: ACM Press, pp. 295--304.  ",
      "doi": "10.1145/1958824.1958868"
    },
    {
      "text": "Skeels, M. M., & Grudin, J. (2009). When social networks cross boundaries: A case study of workplace use of Facebook and LinkedIn. In Proc. GROUP 2009. New York: ACM Press, pp. 95--104.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Stutzman, F. & Hartzog, W. (2012). Boundary regulation in social media. In Proc. CSCW 2012. New York: ACM Press, pp. 769--778  ",
      "doi": "10.1145/2145204.2145320"
    },
    {
      "text": "Voida, A., Newstetter, W. C., & Mynatt, E. D. (2002). When conventions collide: The tensions of instant messaging attributed. In Proc. CHI 2002. New York: ACM Press, pp. 187--194.  ",
      "doi": "10.1145/503376.503410"
    },
    {
      "text": "Voida, S., Mynatt, E. D., & MacIntyre, B. (2007). Supporting activity in desktop and ubiquitous computing. In Kaptelinin, V. & Czerwinski, M. (Eds.), Beyond the Desktop Metaphor: Designing Integrated Digital Work Environments (pp. 195--222). Cambridge, MA: MIT Press.",
      "doi": ""
    }
  ]
}