{
  "doi": "10.1145/2470654.2466158",
  "title": "Analyzing user-generated youtube videos to understand touchscreen use by people with motor impairments",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1223-1232",
  "year": 2013,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Most work on the usability of touchscreen interaction for people with motor impairments has focused on lab studies with relatively few participants and small cross-sections of the population. To develop a richer characterization of use, we turned to a previously untapped source of data: YouTube videos. We collected and analyzed 187 non-commercial videos uploaded to YouTube that depicted a person with a physical disability interacting with a mainstream mobile touchscreen device. We coded the videos along a range of dimensions to characterize the interaction, the challenges encountered, and the adaptations being adopted in daily use. To complement the video data, we also invited the video uploaders to complete a survey on their ongoing use of touchscreen technology. Our findings show that, while many people with motor impairments find these devices empowering, accessibility issues still exist. In addition to providing implications for more accessible touchscreen design, we reflect on the application of user-generated content to study user interface design.",
  "authors": [
    {
      "name": "Lisa Anthony",
      "institution": "University of Maryland, Baltimore County, Baltimore, Maryland, USA",
      "img": "/do/10.1145/contrib-81100196272/rel-imgonly/lisa-anthony-headshot-2018.jpg",
      "acmid": "81100196272",
      "orcid": "missing"
    },
    {
      "name": "YooJin Kim",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557631856",
      "orcid": "missing"
    },
    {
      "name": "Leah Findlater",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    }
  ],
  "references": [
    {
      "text": "Abascal, J. & Civit, A. (2009). Mobile communication for people with disabilities and older people: new opportunities for autonomous life. Proc. 6th ERCIM Workshop, 255--268.",
      "doi": ""
    },
    {
      "text": "Belatar, M. & Poirier, F. (2008). Text entry for mobile devices and users with severe motor impairments: handiglyph, a primitive shapes based onscreen keyboard. Proc. ASSETS 2008, 209--216.  ",
      "doi": "10.1145/1414471.1414510"
    },
    {
      "text": "Biswas, P. & Langdon, P. (2012). Developing multimodal adaptation algorithm for mobility impaired users by evaluating their hand strength. Int J Hum-Comput Int, 28(9), 576--596.",
      "doi": ""
    },
    {
      "text": "Blythe, M. & Cairns, P. (2009). Critical methods and user generated content: the iPhone on YouTube. Proc. CHI 2009, 1467--1476.  ",
      "doi": "10.1145/1518701.1518923"
    },
    {
      "text": "Cunningham, S. J. & Nichols, D. M. (2008). How people find videos. Proc. JCDL 2008, 201--210.  ",
      "doi": "10.1145/1378889.1378924"
    },
    {
      "text": "Duff, S. N., Irwin, C. B., Skye, J. L., Sesto, M. E., Wiegmann, D. A. (2010). The effect of disability and approach on touch screen performance during a number entry task. Proc. HFES Annual Meeting 2010, 566--570.",
      "doi": ""
    },
    {
      "text": "Findlater, L., Jansen, A., Shinohara, K., Dixon, M., Kamb, P., Rakita, J., Wobbrock, J. O. (2010). Enhanced area cursors: Reducing fine pointing demands for people with motor impairments. Proc. UIST 2010, 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Froehlich, J., Wobbrock, J. O., Kane, S. K. (2007). Barrier pointing: using physical edges to assist target acquisition on mobile device touch screens. Proc. ASSETS 2007, 19--26.  ",
      "doi": "10.1145/1296843.1296849"
    },
    {
      "text": "Gajos, K. Z., Wobbrock, J. O., Weld, D. S. (2008). Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. Proc. CHI 2008, 1257--1266.  ",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Guerreiro, T., Nicolau, H., Jorge, J., Gonçalves, D. (2010). Towards accessible touch interfaces. Proc. ASSETS 2010, 19--26.  ",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "Hourcade, J. P., Bederson, B. B., Druin, A., Guimbretiere, F. (2004). Differences in pointing task performance between preschool children and adults using mice. ACM TOCHI, 11(4), 357--386.  ",
      "doi": "10.1145/1035575.1035577"
    },
    {
      "text": "Hourcade, J. P., Perry, K. B. Sharma, A. (2008). PointAssist: helping four year olds point with ease. Proc. IDC 2008, 202--209.  ",
      "doi": "10.1145/1463689.1463757"
    },
    {
      "text": "Hurst, A., Hudson, S. E., Mankoff, J., Trewin, S. (2008). Automatically detecting pointing performance. Proc. IUI 2008, 11--19.  ",
      "doi": "10.1145/1378773.1378776"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P., Clarkson, P. J. (2003). Multiple haptic targets for motion-impaired computer users. Proc. CHI 2003, 41--48.  ",
      "doi": "10.1145/642611.642620"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P., Clarkson, P. J. (2004). Mouse movements of motion-impaired users: A submovement analysis. Proc. ASSETS 2004, 102--109.  ",
      "doi": "10.1145/1028630.1028649"
    },
    {
      "text": "Irwin, C. B. & Sesto, M. E. (2012). Performance and touch characteristics of disabled and non-disabled participants during a reciprocal tapping task using touch screen technology. Applied Ergonomics, 43(6), 1038--1043.",
      "doi": ""
    },
    {
      "text": "Jang, S. H. (2011). YouTube as an innovative resource for social science research. Proc. Australian Association for Research in Education Conference 2011, 1--16.",
      "doi": ""
    },
    {
      "text": "Kabbash, P. & Buxton, W. (1995). The \"Prince\" technique: Fitts' law and selection using area cursors. Proc. CHI 1995, 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Kane, S. K., Bigham, J. P., Wobbrock, J. O. (2008). Slide rule: Making mobile touch screens accessible to blind people using multi-touch interaction techniques. Proc. ASSETS 2008, 73--80.  ",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Kane, S. K., Jayant, C., Wobbrock, J. O., Ladner, R. E. (2009). Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. Proc. ASSETS 2009, 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Keates, S. & Trewin, S. (2005). Effect of age and Parkinson's disease on cursor positioning using a mouse. Proc. ASSETS 2005, 68--75.  ",
      "doi": "10.1145/1090785.1090800"
    },
    {
      "text": "Keelan, J., Pavri-Garcia, V., Tomlinson, G., Wilson, K. (2007). YouTube as a source of information on immunization: a Content analysis. JAMA-J Am Med Assoc, 298(21), 2482--2484.",
      "doi": ""
    },
    {
      "text": "Lange, P. G. (2007). Publicly private and privately public: social networking on YouTube. J Comput-Mediat Comm, 13(1), 361--380.",
      "doi": "10.1111/j.1083-6101.2007.00400.x"
    },
    {
      "text": "Manduchi, R. & Coughlan, J. (2008). Portable and mobile systems in assistive technology. Proc. ICCHP 2008, 1078--1080.  ",
      "doi": "10.1007/978-3-540-70540-6_161"
    },
    {
      "text": "McGookin, D., Brewster, S., Jiang, WeiWei. (2008). Investigating touchscreen accessibility for people with visual impairments. Proc. NordiCHI 2008, 298--307.  ",
      "doi": "10.1145/1463160.1463193"
    },
    {
      "text": "Paay, J., Kjeldskov, J., Skov, M., O'Hara, K. (2012). Cooking together: a digital ethnography. Extended Abstracts of CHI 2012, 1883--1888.  ",
      "doi": "10.1145/2212776.2223723"
    },
    {
      "text": "Paek, H.-J., Kim, K., Hove, T. (2010). Content analysis of antismoking videos on YouTube: message sensation value, message appeals, and their relationships with viewer responses. Health Education Research, 25(6), 1085--1099.",
      "doi": ""
    },
    {
      "text": "Power, M. R. & Power, D. (2004). Everyone here speaks TXT: deaf people using SMS in Australia and the rest of the world. J. Deaf Stud. Deaf Educ., 9(3), 333--343.",
      "doi": ""
    },
    {
      "text": "Trewin, S., Keates, S., Moffatt, K. (2006). Developing steady clicks: a method of cursor assistance for people with motor impairments. Proc. ASSETS 2006, 26--33.  ",
      "doi": "10.1145/1168987.1168993"
    },
    {
      "text": "Trewin, S. & Pain, H. (1999). Keyboard and mouse errors due to motor disabilities. IJHCS, 50(2), 109--144.  ",
      "doi": "10.1006/ijhc.1998.0238"
    },
    {
      "text": "Wacharamanotham, C., Hurtmanns, J., Mertens, A., Kronenbuerger, M., Schlick, C., Borchers, J. (2011). Evaluating swabbing: a touchscreen input method for elderly users with tremor. Proc. CHI 2011, 623--626.  ",
      "doi": "10.1145/1978942.1979031"
    },
    {
      "text": "Wobbrock, J. O., Fogarty, J., Liu, S., Kimuro, S., Harada, S. (2009). The angle mouse: target-agnostic dynamic gain adjustment based on angular deviation. Proc. CHI 2009, 1401--1410.  ",
      "doi": "10.1145/1518701.1518912"
    },
    {
      "text": "Wobbrock, J. O., Myers, B. A. and Kembel, J. A. (2003). EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. Proc. UIST 2003, 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., Hudson, S. (1997). Making computers easier for older adults to use: area cursors and sticky icons. Proc. CHI 1997, 266--271.  ",
      "doi": "10.1145/258549.258724"
    }
  ]
}