{
  "doi": "10.1145/2470654.2481302",
  "title": "The space between the notes: adding expressive pitch control to the piano keyboard",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2195-2204",
  "year": 2013,
  "badges": [],
  "abstract": "This paper addresses the question of how to extend the capabilities of a well-established interface in a way that respects users' existing expertise. The piano-style keyboard is among the most widely used and versatile of digital musical interfaces. However, it lacks the ability to alter the pitch of a note after it has been played, a limitation which prevents the performer from executing common expressive techniques including vibrato and pitch bending. We present a system for controlling pitch from the keyboard surface using capacitive touch sensors to measure the locations of the player's fingers on the keys. The large community of trained pianists makes the keyboard a compelling target for augmentation, but it also poses a challenge: how can a musical interface be extended while making use of the existing techniques performers have spent thousands of hours learning? In this paper, user studies with conservatory pianists explore the constraints of traditional keyboard technique and evaluate the usability of the continuous pitch control system. The paper also discusses implications for the extension of other established interfaces in musical and non-musical contexts.",
  "authors": [
    {
      "name": "Andrew P. McPherson",
      "institution": "Queen Mary University of London, London, UK",
      "img": "/do/10.1145/contrib-81421599247/rel-imgonly/andrew.jpg",
      "acmid": "81421599247",
      "orcid": "0000-0001-9323-9069"
    },
    {
      "name": "Adrian Gierakowski",
      "institution": "Queen Mary University of London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558337256",
      "orcid": "missing"
    },
    {
      "name": "Adam M. Stark",
      "institution": "Queen Mary University of London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335497880",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benford, S. et al., Expected, sensed, and desired: A framework for designing sensing-based interaction. ACM Transactions on Computer-Human Interaction 12 (2005), 3--30.  ",
      "doi": "10.1145/1057237.1057239"
    },
    {
      "text": "Bernays, M., and Traube, C. Piano touch analysis: A MATLAB toolbox for extracting performance descriptors from high-resolution keyboard and pedalling data. In Proc. JIM (2012).",
      "doi": ""
    },
    {
      "text": "Bevilacqua, F., Zamborlin, B., Sypniewski, A., Schnell, N., Guédy, F., and Rasamimanana, N. Continuous realtime gesture following and recognition. In Gesture in Embodied Communication and Human-Computer Interaction, vol. 5934 of Lecture Notes in Computer Science. Springer, 2010, 73--84.  ",
      "doi": "10.1007/978-3-642-12553-9_7"
    },
    {
      "text": "Brent, W. The gesturally-extended piano. In Proc. NIME (2012).",
      "doi": ""
    },
    {
      "text": "Burnett, G. E. On-the-move and in your car: An overview of HCI issues for in-car computing. Intl. J. Mobile HCI 1, 1 (2009), 60--78.",
      "doi": ""
    },
    {
      "text": "Findlater, L., Lee, B. Q., and Wobbrock, J. O. Beyond QWERTY: Augmenting touch-screen keyboards with multi-touch gestures for non-alphanumeric input. In Proc. CHI (2012).  ",
      "doi": "10.1145/2207676.2208660"
    },
    {
      "text": "Goebl, W., and Palmer, C. Tactile feedback and timing accuracy in piano performance. Experimental Brain Research 186, 3 (April 2008), 471--479.",
      "doi": ""
    },
    {
      "text": "Hadjakos, A., Aitenbichler, E., and Mühlhüuser, M. Potential use of inertial measurement sensors for piano teaching systems: Motion analysis of piano playing patterns. In Proc. i-Maestro Workshop on Technology-Enhanced Music Education (2008).",
      "doi": ""
    },
    {
      "text": "Harrison, C., and Hudson, S. E. Using shear as a supplemental two-dimensional input channel for rich touchscreen interaction. In Proc. CHI (2012).  ",
      "doi": "10.1145/2207676.2208730"
    },
    {
      "text": "Hasan, K., Yang, X. D., Bunt, A., and Irani, P. A-Coord input: Coordinating auxiliary input streams for augmenting contextual pen-based interactions. In Proc. CHI (2012).  ",
      "doi": "10.1145/2207676.2208519"
    },
    {
      "text": "Jordá, S. Instruments and players: Some thoughts on digital lutherie. J. New Music Research 33 (2004).",
      "doi": ""
    },
    {
      "text": "Lee, H., and Kim, J. An HMM-based threshold model approach for gesture recognition. IEEE Trans. Pattern Analysis and Machine Intelligence 21 (1999), 961--973.  ",
      "doi": "10.1109/34.799904"
    },
    {
      "text": "MacRitchie, J., Buck, B., and Bailey, N. J. Visualising musical structure through performance gesture. In Proc. ISMIR (2009).",
      "doi": ""
    },
    {
      "text": "McPherson, A. TouchKeys: Capacitive multi-touch sensing on a physical keyboard. In Proc. NIME (2012).",
      "doi": ""
    },
    {
      "text": "McPherson, A., and Kim, Y. Design and applications of a multi-touch musical keyboard. In Proc. SMC (2011).",
      "doi": ""
    },
    {
      "text": "McPherson, A., and Kim, Y. Multidimensional gesture sensing at the piano keyboard. In Proceedings of the 29th ACM Conference on Human Factors in Computing Systems (CHI) (Vancouver, Canada, 2011).  ",
      "doi": "10.1145/1978942.1979355"
    },
    {
      "text": "Moog, R. A., and Rhea, T. L. Evolution of the keyboard interface: The Bösendorfer 290 SE recording piano and the Moog multiply-touch-sensitive keyboards. Computer Music Journal 14, 2 (Summer 1990), 52--60.",
      "doi": ""
    },
    {
      "text": "Nicolls, S. Twenty-first century piano. In Proc. NIME (2009).",
      "doi": ""
    },
    {
      "text": "NJ Star-Ledger. Waiting to be heard, Wanted: Someone to bring the successor to the Moog synthesizer to life.",
      "doi": ""
    },
    {
      "text": "Ortmann, O. The Physiological Mechanics of Piano Technique. Kegan Paul, Trenc, Trubner & Co., 1929.",
      "doi": ""
    },
    {
      "text": "Paradiso, J. A. Electronic music: new ways to play. IEEE Spectrum 34, 12 (1997).  ",
      "doi": "10.5555/283103.283137"
    },
    {
      "text": "Poole, A., and Ball, L. Eye tracking in HCI and usability research. In Encyclopedia of Human-Computer Interaction, C. Ghaoui, Ed. 2006.",
      "doi": ""
    },
    {
      "text": "Pressing, J. Cybernetic issues in interactive performance systems. Computer Music J. 14, 1 (1990).",
      "doi": ""
    },
    {
      "text": "Rahman, M., Gustafson, S., Irani, P., and Subramanian, S. Tilt techniques: investigating the dexterity of wrist-based input. In Proc. CHI (2009).  ",
      "doi": "10.1145/1518701.1518997"
    },
    {
      "text": "Rothstein, J., and Metlay, M. P. Products of interest: The musician-machine interface to MIDI. Computer Music Journal 14, 2 (1990), 73--83.",
      "doi": ""
    },
    {
      "text": "Scarr, J., Cockburn, A., Gutwin, C., and Quinn, P. Dips and ceilings: Understanding and supporting transitions to expertise in user interfaces. In Proc. CHI (2011).  ",
      "doi": "10.1145/1978942.1979348"
    },
    {
      "text": "Stewart, C., Rohs, M., Kratz, S., and Essl, G. Characteristics of pressure-based input for mobile devices. In Proc. CHI (2010).  ",
      "doi": "10.1145/1753326.1753444"
    },
    {
      "text": "Wang, F., and Ren, X. Empirical evaluation for finger input properties in multi-touch interaction. In Proc. CHI (2009).  ",
      "doi": "10.1145/1518701.1518864"
    },
    {
      "text": "Xin, Y., Bi, X., and Ren, X. Natural use profiles for the pen: An empirical exploration of pressure, tilt, and azimuth. In Proc. CHI (2012).  ",
      "doi": "10.1145/2207676.2208518"
    },
    {
      "text": "Yang, Q., and Essl, G. Augmented piano performance using a depth camera. In Proc. NIME (2012).",
      "doi": ""
    }
  ]
}