{
  "doi": "10.1145/2470654.2466422",
  "title": "Picode: inline photos representing posture data in source code",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3097-3100",
  "year": 2013,
  "badges": [],
  "abstract": "Current programming environments use textual or symbolic representations. While these representations are appropriate for describing logical processes, they are not appropriate for representing raw values such as human and robot posture data, which are necessary for handling gesture input and controlling robots. To address this issue, we propose Picode, a text-based development environment integrated with visual representations: photos of human and robots. With Picode, the user first takes a photo to bind it to posture data. S/he then drag-and-drops the photo into the code editor, where it is displayed as an inline image. A preliminary in-house user study implied positive effects of taking photos on the programming experience.",
  "authors": [
    {
      "name": "Jun Kato",
      "institution": "The University of Tokyo, Bunkyo-ku, Japan",
      "img": "/do/10.1145/contrib-81416606592/rel-imgonly/dsc03010.jpg",
      "acmid": "81416606592",
      "orcid": "0000-0003-4832-8024"
    },
    {
      "name": "Daisuke Sakamoto",
      "institution": "The University of Tokyo, Bunkyo-ku, Japan",
      "img": "/do/10.1145/contrib-81329491765/rel-imgonly/____________.jpg",
      "acmid": "81329491765",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo, Bunkyo-ku, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Billard, A., Calinon, S., Dillmann, R. and Schaal, S. Robot programming by demonstration. In Handbook of Robotics, Springer (2008), 1371--1394.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Villar, N., Taylor, A. S. and Izadi, S. Mechanical hijacking: how robots can accelerate UbiComp deployments. In Proc. UbiComp 2011, 267--270.  ",
      "doi": "10.1145/2030112.2030148"
    },
    {
      "text": "Hartmann, B., Klemmer, S. R., Bernstein, M., Abdulla, L., Burr, B., Mosher., A. R. and Gee, J. Reflective physical prototyping through integrated design, test, and analysis. In Proc. UIST 2006, 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Kato, J., McDirmid, S. and Cao, X. DejaVu: Integrated support for developing interactive camera-based programs. In Proc. UIST 2012, 189--196.  ",
      "doi": "10.1145/2380116.2380142"
    },
    {
      "text": "Ko, A. J. and Myers, B. A. Barista: An implementation framework for enabling new tools, interaction techniques and views in code editors. In Proc. CHI 2006, 387--396.  ",
      "doi": "10.1145/1124772.1124831"
    },
    {
      "text": "LEGO Mindstorms NXT. http://mindstorms.lego.com/.",
      "doi": ""
    },
    {
      "text": "Nakaoka, S., Kajita, S. and Yokoi, K. Intuitive and flexible user interface for creating whole body motions of biped humanoid robots. In Proc. IROS 2010, 1675--1682.",
      "doi": ""
    },
    {
      "text": "Omar, C., Yoon, Y., LaToza, T. D. and Myers, B. A. Active code completion. In Proc. ICSE 2012, 859--869. ",
      "doi": "10.5555/2337223.2337324"
    },
    {
      "text": "Patel, K., Bancroft, N., Drucker, S. M., Fogarty, J., Ko, A. J. and Landay, J. Gestalt: integrated support for implementation and analysis in machine learning. In Proc. UIST 2010, 37--46.  ",
      "doi": "10.1145/1866029.1866038"
    },
    {
      "text": "Processing. http://processing.org/.",
      "doi": ""
    },
    {
      "text": "Victor, B. Learnable Programming. http://worrydream.com/LearnableProgramming/.",
      "doi": ""
    },
    {
      "text": "Yeh, T., Chang, T. H. and Miller, R. C. Sikuli: using GUI screenshots for search and automation. In Proc. UIST 2009, 183--192.  ",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "Yoshizaki, W., Sugiura, Y., Chiou, A. C., Hashimoto, S., Inami, M., Igarashi, T., Akazawa, Y., Kawachi, K., Kagami, S. and Mochimaru, M. An actuated physical puppet as an input device for controlling a digital manikin. In Proc. CHI 2011, 637--646.  ",
      "doi": "10.1145/1978942.1979034"
    }
  ]
}