{
  "doi": "10.1145/2470654.2466221",
  "title": "Tactile perceptions of digital textiles: a design research approach",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1669-1678",
  "year": 2013,
  "badges": [],
  "abstract": "Current interactive media presentations of textiles provide an impoverished communication of their 'textile hand', that is their weight, drape, how they feel to touch. These are complex properties experienced through the visual, tactile, auditory and proprioceptive senses and are currently lost when textile materials are presented in interactive video. This paper offers a new perspective from which the production of multi-touch interactive video representations of the tactile qualities of materials is considered. Through an understanding of hand properties of textiles and how people inherently touch and handle them, we are able to develop methods to animate and bring these properties alive using design methods. Observational studies were conducted, noting gestures consumers used to evaluate textile hand. Replicating the appropriate textile deformations for these gestures in interactive video was explored as a design problem. The resulting digital textile swatches and their interactive behavior were then evaluated for their ability to communicate tactile qualities similar to those of the real textiles.",
  "authors": [
    {
      "name": "Douglas Atkinson",
      "institution": "Brunel University, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488652658",
      "orcid": "missing"
    },
    {
      "name": "Pawel Orzechowski",
      "institution": "Heriot-Watt University, Edinburgh, Scotland Uk",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467659275",
      "orcid": "missing"
    },
    {
      "name": "Bruna Petreca",
      "institution": "Brunel University, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558104856",
      "orcid": "0000-0003-4120-4758"
    },
    {
      "name": "Nadia Bianchi-Berthouze",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100173030",
      "orcid": "missing"
    },
    {
      "name": "Penelope Watkins",
      "institution": "Brunel University, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557074256",
      "orcid": "missing"
    },
    {
      "name": "Sharon Baurley",
      "institution": "Brunel University, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100288230",
      "orcid": "missing"
    },
    {
      "name": "Stefano Padilla",
      "institution": "Heriot-Watt University, Edinburgh, Scotland Uk",
      "img": "/do/10.1145/contrib-81421592371/rel-imgonly/screenshot2014-08-22at11.26.43.png",
      "acmid": "81421592371",
      "orcid": "missing"
    },
    {
      "name": "Mike Chantler",
      "institution": "Heriot-Watt University, Edinburgh, Scotland Uk",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620865",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Behery, H. M. Effect of mechanical and physical properties on hand. Woodhead Publ., Cambridge, 2005.",
      "doi": ""
    },
    {
      "text": "Bianchi-Berthouze, N. Understanding the role of body movement in player engagement. Human Computer Interaction, 28, 1 (2013) 40--75.",
      "doi": ""
    },
    {
      "text": "Bird, J., Marshall, P., Rogers, Y. Low-Fi Skin Vision: a case study in rapid prototyping a sensory substitution system. BCS HCI '09. ACM Press (2009), 55--64. ",
      "doi": "10.5555/1671011.1671018"
    },
    {
      "text": "Carignan, M., Yang, Y., Magnenat Thalmann, N., Thalmann, D. Dressing animated synthetic actors with complex deformable clothes. SIGGRAPH '92, Thomas, J. J. (Ed.). ACM Press (1992), 99--104.  ",
      "doi": "10.1145/142920.134017"
    },
    {
      "text": "Ciesielska-Wrobel, I. L., Van Langenhove, L. The hand of textiles - definitions, achievements, perspectives - a review. Textile Research J. 82, 14 (2012), 1457--1468.",
      "doi": ""
    },
    {
      "text": "Citrin, A., Stem, D., Spangenberg, E., Clark, M. Consumer need for tactile input: an internet retailing challenge. Journal of Business Research 56, 11 (2003), 915--22.",
      "doi": ""
    },
    {
      "text": "Dillon, P., Moody, W., Bartlett, R., Scully, P., Morgan, R., James, C. Sensing the Fabric: To Simulate Sensation through Sensory Evaluation and in Response to Standard Acceptable Properties of Specific Materials when Viewed as a Digital Image. Workshop Haptic HCI. Springer (2000), 63--68. ",
      "doi": "10.5555/645443.757607"
    },
    {
      "text": "Fallman, D. Design-oriented Human-Computer Interaction. Proc CHI'03. ACM Press (2003), 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Fan, J., Yu, W., Hunter, L. Clothing appearance and fit: Science and technology. Woodhead Publishing, 2004.",
      "doi": ""
    },
    {
      "text": "Gao, Y., Bianchi-Berthouze, N., Meng, H. What does touch tell us about emotions in touchscreen-based gameplay? TOCHI (December 2012).  ",
      "doi": "10.1145/2395131.2395138"
    },
    {
      "text": "Gaver, W. What Should We Expect From Research Through Design? CHI'12. ACM Press (2012), 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Hughes, L., Atkinson, D., Bianchi-Berthouze, N., Baurley, S.. Crowdsourcing an emotional wardrobe. CHI'12. ACM Press (2012), 231--240.  ",
      "doi": "10.1145/2212776.2212801"
    },
    {
      "text": "Holman, D., Vertegaal, R., Altosaar, M., Troje, N., Johns, D. PaperWindows: Interaction techniques for digital paper. CHI'05. ACM Press (2005), 591--599.  ",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Jousmäki. V., Hari, R. Parchment-skin illusion: sound-biased touch. Curr Biol. 8, 6, (1998) R190--191.",
      "doi": ""
    },
    {
      "text": "Kaptelinin, V., Nardi, B. Affordances in HCI: Toward a Mediated Action Perspective. CHI'12. ACM Press (2012), 967--976.  ",
      "doi": "10.1145/2207676.2208541"
    },
    {
      "text": "Karana, E., Hekkert, P., Kandachar, P. Meanings of materials through sensorial and manufacturing processes. Materials and Design 30, 7 (2009), 2778--84.",
      "doi": ""
    },
    {
      "text": "Kruskal, J. B. and M. Wish. Multidimensional Scaling. Sage, London, UK, 1978.",
      "doi": ""
    },
    {
      "text": "Lee, H., Kim, J., Fiore, A. M. Affective and Cognitive Online Shopping Experience. Clothing and Textile Research Journal 28, 2 (2010), 140--54.",
      "doi": ""
    },
    {
      "text": "Levin, A. M., Levin, I. P., Heath, C. E. Product category dependent consumer preferences for online and offline shopping features and their influence on multi-channel retail alliances. Journal of Electronic Commerce Research 4, 3 (2003), 85--93.",
      "doi": ""
    },
    {
      "text": "Magnenat-Thalmann, N., Bonanni, U. Haptic sensing of virtual textiles. In: Grunwald, M. Ed. Human Haptic Perception: Basics and Applications. Birkhauser, Basel, Switzerland. (2008) 513--523",
      "doi": ""
    },
    {
      "text": "Orzechowski, P. M. Interactive mobile presentation of textiles. Mobile HCI'10. ACM Press (2010), 477--478.  ",
      "doi": "10.1145/1851600.1851714"
    },
    {
      "text": "Padilla, S., Chantler, M. ShoogleIt.com: Engaging online with interactive objects. DE 2011 - Digital Engagement. Newcastle University (2011).",
      "doi": ""
    },
    {
      "text": "Pan, N. Quantification and Evaluation of Human Tactile Sense Towards Fabric. Int. Journal of Design & Nature 1, 1 (2007) 48--60.",
      "doi": ""
    },
    {
      "text": "Peck, J., Wiggins, J. It just feels good: Customers' affective response to touch and its influence on persuasion. Journal of Marketing 70, 4 (2006), 56--69.",
      "doi": ""
    },
    {
      "text": "Schifferstein, H. N. J., Cleiren, M. P. H. D. Capturing product experiences: a split modality approach. Acta Psychologica 118, (2005), 293--318.",
      "doi": ""
    },
    {
      "text": "Schiphorst, T. Self-Evidence: Applying Somatic Connoisseurship to Experience Design. CHI'11. ACM Press (2011), 145--160.  ",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Schutz-Bosbach, S., Tausche, P., & Weiss, C. Roughness perception during the rubber hand illusion. Brain and Cognition 70, 1 (2009), 136--144.",
      "doi": ""
    },
    {
      "text": "Soufflet, I., Calonnier, M., Dacremont, C. A Comparison between industrial experts' and novices' haptic perceptual organisation: a tool to identify descriptors of the handle of fabrics. Food Quality and Preference 15, (2004), 689--699.",
      "doi": ""
    },
    {
      "text": "Spence, C., Zampini, M. Auditory Contributions to Multisensory Product Perception. Acta Acust, 92, 6, (2006) 1009--1025.",
      "doi": ""
    },
    {
      "text": "Ward, G., Glencross, M. A Case Study Evaluation: Perceptually Accurate Textured Surface Models, 2009. APGV '09. ACM Press (2009), 109--115.  ",
      "doi": "10.1145/1620993.1621015"
    },
    {
      "text": "Williamson, J., Murray-Smith, R., Hughes, S. Shoogle: Excitatory Multimodal Interaction on Mobile Devices. CHI'07. ACM Press (2007), 121--124.  ",
      "doi": "10.1145/1240624.1240642"
    },
    {
      "text": "Wobbrock, J. O., Morriss, M. R., Wilson, A. D. UserDefined Gestures for Surface Computing. CHI'09. ACM Press (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wu, D., Wu, T., Singh, H., Padilla, S., Atkinson, D., Chantler, M., Baurely, S. The Affective Experience of Handling Digital Fabrics: Tactile and Visual CrossModal Effects. Springer, LNCS 6974 (2011), 427--436. ",
      "doi": "10.5555/2062780.2062828"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., Evenson, S. Research through design as a method for interaction design research in HCI. CHI '07. ACM Press (2007), 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}