{
  "doi": "10.1145/2470654.2466424",
  "title": "Modeling how people extract color themes from images",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3101-3110",
  "year": 2013,
  "badges": [],
  "abstract": "Color choice plays an important role in works of graphic art and design. However, it can be difficult to choose a compelling set of colors, or color theme, from scratch. In this work, we present a method for extracting color themes from images using a regression model trained on themes created by people. We collect 1600 themes from Mechanical Turk as well as from artists. We find that themes extracted by Turk participants were similar to ones extracted by artists. In addition, people tended to select diverse colors and focus on colors in salient image regions. We show that our model can match human-extracted themes more closely compared to previous work. Themes extracted by our model were also rated higher as representing the image than previous approaches in a Mechanical Turk study.",
  "authors": [
    {
      "name": "Sharon Lin",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550532756",
      "orcid": "missing"
    },
    {
      "name": "Pat Hanrahan",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482576",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berlin, B., and Kay, P. Basic color terms: Their universality and evolution. Univ of California Pr, 1991.",
      "doi": ""
    },
    {
      "text": "Bezdek, J. Pattern recognition with fuzzy objective function algorithms. Kluwer Academic Publishers, 1981. ",
      "doi": "10.5555/539444"
    },
    {
      "text": "Chuang, J., Stone, M., and Hanrahan, P. A probabilistic model of the categorical association between colors. In Color Imaging Conference (2008), 6--11.",
      "doi": ""
    },
    {
      "text": "Colourlovers. http://www.colourlovers.com.",
      "doi": ""
    },
    {
      "text": "Delon, J., Desolneux, A., Lisani, J., and Petro, A. Automatic color palette. In Image Processing, 2005. ICIP 2005. IEEE International Conference on, vol. 2 (sept. 2005), II - 706--9.",
      "doi": ""
    },
    {
      "text": "Delon, J., Desolneux, A., Lisani, J. L., and Petro, A. B. Automatic color palette. Inverse Problems and Imaging 1, 2 (2007), 265--287.",
      "doi": ""
    },
    {
      "text": "Eitz, M., Hays, J., and Alexa, M. How do humans sketch objects? ACM Transactions on Graphics (TOG) 31, 4 (2012), 44.  ",
      "doi": "10.1145/2185520.2185540"
    },
    {
      "text": "Felzenszwalb, P. F., and Huttenlocher, D. P. Efficient graph-based image segmentation. Int. J. Comput. Vision 59, 2 (Sept. 2004), 167--181.  ",
      "doi": "10.1023/B%3AVISI.0000022288.19776.77"
    },
    {
      "text": "Friedman, J., Hastie, T., and Tibshirani, R. Regularization paths for generalized linear models via coordinate descent. Journal of statistical software 33, 1 (2010), 1.",
      "doi": ""
    },
    {
      "text": "Greenfield, G. R., and House, D. H. Image recoloring induced by palette color associations. Journal of WSCG 11 (2003), 189--196.",
      "doi": ""
    },
    {
      "text": "Heer, J., and Bostock, M. Crowdsourcing graphical perception: Using mechanical turk to assess visualization design. In ACM Human Factors in Computing Systems (CHI) (2010), 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Heer, J., and Stone, M. Color naming models for color selection, image editing and palette design. In ACM Human Factors in Computing Systems (CHI) (2012).  ",
      "doi": "10.1145/2207676.2208547"
    },
    {
      "text": "Itten., J. The art of color. Van Nostrand Reinhold Company (1960).",
      "doi": ""
    },
    {
      "text": "Judd, T., Ehinger, K., Durant, F., and Torralba, A. Learning to predict where humans look. In IEEE International Conference on Computer Vision (ICCV) (2009).",
      "doi": ""
    },
    {
      "text": "Adobe Kuler. http://kuler.adobe.com.",
      "doi": ""
    },
    {
      "text": "MacQueen, J., et al. Some methods for classification and analysis of multivariate observations. In Proceedings of the fifth Berkeley symposium on mathematical statistics and probability, vol. 1, California, USA (1967), 14.",
      "doi": ""
    },
    {
      "text": "Matsuda, Y. Color design. Asakura Shoten (1995).",
      "doi": ""
    },
    {
      "text": "Meier, B. J., Spalter, A. M., and Karelitz, D. B. Interactive color palette tools. IEEE Comput. Graph. Appl. 24, 3 (May 2004), 64--72.  ",
      "doi": "10.1109/MCG.2004.1297012"
    },
    {
      "text": "Morse, B., Thornton, D., Xia, Q., and Uibel, J. Image-based color schemes. In Image Processing, 2007. ICIP 2007. IEEE International Conference on, vol. 3, IEEE (2007), III--497.",
      "doi": ""
    },
    {
      "text": "Obrador, P. Automatic color scheme picker for document templates based on image analysis and dual problem. In Proceedings of SPIE, vol. 6076 (2006), 64--73.",
      "doi": ""
    },
    {
      "text": "O'Donovan, P., Agarwala, A., and Hertzmann, A. Color compatibility from large datasets. In ACM SIGGRAPH 2011 papers, SIGGRAPH '11, ACM (New York, NY, USA, 2011), 63:1--63:12.  ",
      "doi": "10.1145/1964921.1964958"
    },
    {
      "text": "Wang, B., Yu, Y., Wong, T.-T., Chen, C., and Xu, Y.-Q. Data-driven image color theme enhancement. In ACM SIGGRAPH Asia 2010 papers, SIGGRAPH ASIA '10, ACM (New York, NY, USA, 2010), 146:1--146:10.  ",
      "doi": "10.1145/1866158.1866172"
    },
    {
      "text": "Weeks, A., and Hague, G. Color segmentation in the hsi color space using the k-means algorithm. In Proceedings of SPIE, vol. 3026 (1997), 143.",
      "doi": ""
    }
  ]
}