{
  "doi": "10.1145/2470654.2481282",
  "title": "Love it or hate it!: interactivity and user types",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2059-2068",
  "year": 2013,
  "badges": [],
  "abstract": "This paper investigates general and individual evaluations of User Experience (UX) with interactive web sites. A series of studies investigate user judgment on web sites with different interactivity levels over repeated exposures. The more interactive websites produced more positive affect, had better design quality ratings, which improved with exposure, and were preferred. Differences between the more interactive sites indicated overall UX was influenced by users' preferences for interactive styles, with both sites having enthusiast, potential adopter, and non-adopter users. The implications for models and frameworks of UX are discussed.",
  "authors": [
    {
      "name": "Jennefer Hart",
      "institution": "The University of Manchester, Manchester, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723503",
      "orcid": "missing"
    },
    {
      "name": "Alistair G. Sutcliffe",
      "institution": "The University of Manchester, Manchester, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100269401",
      "orcid": "missing"
    },
    {
      "name": "Antonella De Angeli",
      "institution": "University of Trento, Trento, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479651351",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ajzen, I. and Fishbein, M., Understanding attitudes and predicting social behavior. Englewood Cliffs, NJ: Prentice Hall, (1980).",
      "doi": ""
    },
    {
      "text": "Bargas-Avila, J., and Hornbæk, K. Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience. In Proc. CHI 2011, ACM Press. (2011), 2689--2698.  ",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Bartle, R. Hearts, Clubs, Diamonds, Spades: Players Who Suit MUDs. Journal of MUD Research 1, (1996), accessed: 18.09/12: www.mud.co.uk/richard/hcds.htm",
      "doi": ""
    },
    {
      "text": "Berlyne, D. E. Conflict, Arousal and Curiosity, New York: McGraw Hill, 1960.",
      "doi": ""
    },
    {
      "text": "Brandtzæg, P. B. Towards a unified Media-User Typology (MUT): A meta-analysis and review of the research literature on media-user typologies. Computers in Human Behavior, 26, 5 (2010), 940--956.  ",
      "doi": "10.1016/j.chb.2010.02.008"
    },
    {
      "text": "Chen, K., and Yen, D. C. Improving the quality of online presence through interactivity. Information & Management, 42, 1 (2004), 217--226.  ",
      "doi": "10.1016/j.im.2004.01.005"
    },
    {
      "text": "Clemmensen T. Four approaches to user modeling - a qualitative research interview study of HCI professional' practice. Interacting with Computers, 16, (2004), 799--829.",
      "doi": ""
    },
    {
      "text": "Cooper, A. The Inmates are Running the Asylum. SAMS, 1999. ",
      "doi": "10.5555/553473"
    },
    {
      "text": "Csíkszentmihályi, M. Flow: The Psychology of Optimal Experience, New York: Harper and Row, 1990.",
      "doi": ""
    },
    {
      "text": "Cyr, D., Head, M., and Ivanov, A. Perceived interactivity leading to e-loyalty: Development of a model for cognitive - affective user responses. International Journal of Human-Computer Studies, 67, 10 (2009), 850--869.  ",
      "doi": "10.1016/j.ijhcs.2009.07.004"
    },
    {
      "text": "Diefenback, S. and Hassenzahl, M. The \"Beauty Dilemma\": Beauty is valued but discounted in product choice. In Proc. CHI 2009, ACM Press. (2009), 1419--1426.  ",
      "doi": "10.1145/1518701.1518916"
    },
    {
      "text": "Domagk, S., Schwartz, R. N., and Plass, J. L. Interactivity in multimedia learning: An integrated model. Computers in Human Behavior, 26, 5 (2010), 1024--1033.  ",
      "doi": "10.1016/j.chb.2010.03.003"
    },
    {
      "text": "Egglestone, S. R., Whitbrook, A. M., Greensmith, J., Walker, B., Benford, S., Marshall, J., Kirk, D. S., Schnädelbach, H., Irune, A. A. and Rowland, D. Recommending Rides: Psychometric Profiling in the Theme Park. Computers in Entertainment 8, 3 (2010).  ",
      "doi": "10.1145/1902593.1902600"
    },
    {
      "text": "Hartman, J., Sutcliffe, A., and De Angeli, A. Towards a Theory of User Judgment of Aesthetics and User Interface Quality, TOCHI, 15, 4 (2008), 1--30.  ",
      "doi": "10.1145/1460355.1460357"
    },
    {
      "text": "Hassenzahl, M. The Interplay of Beauty, Goodness, and Usability in Interactive Product, Human-ComputerInteraction, 19, 4 (2004), 319--349.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "Jennett, C., Cox, A. L., Cairns, P., Dhoparee, S., Epps, A., Tijs, T., and Walton, A. Measuring and defining the experience of immersion in games. International Journal of Human-Computer Studies, 66, 9 (2008), 641--661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Johnson, G., Bruner II, G., and Kumar, A. Interactivity and its Facets Revisited: Theory and Empirical Test. Journal of Advertising, 35, 4 (2006), 35--52.",
      "doi": ""
    },
    {
      "text": "Kim, J., Lee, J., and Choi, D. Designing emotionally evocative homepages: an empirical study of the quantitative relations between design factors and emotional dimensions. International Journal of Human-Computer Studies, 59, 6 (2003), 899--940.  ",
      "doi": "10.1016/j.ijhcs.2003.06.002"
    },
    {
      "text": "Kumar, M., and Garg, N. Aesthetic principles and cognitive emotion appraisals: How much of the beauty lies in the eye of the beholder? Journal of Consumer Psychology, 20, 4 (2010), 485--494. Elsevier B.V.",
      "doi": ""
    },
    {
      "text": "Lavie, T., and Tractinsky, N. Assessing dimensions of perceived visual aesthetics of web sites, International Journal of Human Computer Interaction, 60 (2004), 269--298.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "Lindgaard, G., Dudek, C., Sen, D., Sumegi, L., and Noonan, P. An exploration of relations between visual appeal, trustworthiness and perceived usability of homepages. ACM (TOCHI), 18, 1 (2011), 1--30.  ",
      "doi": "10.1145/1959022.1959023"
    },
    {
      "text": "Morris, M. G., Venkatesh, V., and Ackerman, P. L. Gender and age differences in employee decisions about new technology: an extension to the theory of planned behavior, Engineering Management, IEEE Transactions, 52, 1 (2005), 69--84.",
      "doi": ""
    },
    {
      "text": "Norman, Donald A. Invisible Computer: Why Good Products Can Fail, the Personal Computer Is So Complex and Information Appliances Are the Solution. London, MIT Press, 1999.",
      "doi": ""
    },
    {
      "text": "O'Brien, H. L. The influence of hedonic and utilitarian motivations on user engagement: The case of online shopping experiences. Interacting with Computers, 22, 5 (2010), 344--352.  ",
      "doi": "10.1016/j.intcom.2010.04.001"
    },
    {
      "text": "Rafaeli, S. Interactivity: From new media to communication. In R. P. Hawkins, J. M. Wiemann, & S. Pingree (Eds.), Sage Annual Review of Communication Research: Advancing Communication Science: Merging Mass and Interpersonal Processes, 16 (1988), 112--134. Beverly Hills: Sage.",
      "doi": ""
    },
    {
      "text": "Sutcliffe, A. Designing for User Engagement: Aesthetic & Attractive User Interfaces, (Eds). Carroll, J. M, Morgan & Claypool Publishers, 1 (2010). ",
      "doi": "10.5555/1816433"
    },
    {
      "text": "Teo, H.-H., Oh, L.-B., Liu, C., and Wei, K.-K. An empirical study of the effects of interactivity on web user attitude. International Journal of Human-Computer Studies, 58, 3 (2003). 281--305.  ",
      "doi": "10.5555/774318.774320"
    },
    {
      "text": "Tractinsky, N., and Zmiri, D. Exploring Attributes of Skins as Potential Antecedents of Emotion in HCI, In P. Fishwick (Ed.) Aesthetic Computing. MIT Press, (2005).",
      "doi": ""
    },
    {
      "text": "van Schaik, P., Hassenzahl, M., and Ling, J. User experience from an inference perspective. ACM (TOCHI), 19, 2 (2012).  ",
      "doi": "10.1145/2240156.2240159"
    },
    {
      "text": "van Schaik, P., and Ling, J. Modelling user experience with web sites: Usability, hedonic value, beauty and goodness. Interacting with Computers, 20, 3 (2008), 419--432.  ",
      "doi": "10.1016/j.intcom.2008.03.001"
    },
    {
      "text": "Venkatesh, V., Morris, M. G., Davis, G. B., and Davis, F. D. User Acceptance of Information Technology: Toward a Unified View. Management Information Systems Quarterly, 27, 3 (2003), 425--478. ",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Witmer, B. G., and Singer, M. J. Measuring Presence in Virtual Environments: A Presence Questionnaire, Presence, 7, 3 (1999), 225--224.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Wright, P., and McCarthy, J. Experience-centered Design: Designers, users, and communities in dialogue. New York, USA: Morgan Claypool, 2010. ",
      "doi": "10.5555/1855065"
    },
    {
      "text": "Ziemkiewicz, C., Crouser, R., Yauilla, A., Su, S., Ribarsky, W., and Chang, R. How locus of control influences compatibility with visualization style. In Proc. of IEEE Visual Analytics Science and Technology, (2011), 81--90.",
      "doi": ""
    }
  ]
}