{
  "doi": "10.1145/2470654.2466235",
  "title": "Community enhanced tutorials: improving tutorials with multiple demonstrations",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1779-1788",
  "year": 2013,
  "badges": [],
  "abstract": "Web-based tutorials are a popular help resource for learning how to perform unfamiliar tasks in complex software. However, in their current form, web tutorials are isolated from the applications that they support. In this paper we present FollowUs, a web-tutorial system that integrates a fully-featured application into a web-based tutorial. This novel architecture enables community enhanced tutorials, which continuously improve as more users work with them. FollowUs captures video demonstrations of users as they perform a tutorial. Subsequent users can use the original tutorial, or choose from a library of captured community demonstrations of each tutorial step. We conducted a user study to test the benefits of making multiple demonstrations available to users, and found that users perform significantly better using our system with a library of multiple demonstrations in comparison to its equivalent baseline system with only the original authored content.",
  "authors": [
    {
      "name": "Benjamin Lafreniere",
      "institution": "Autodesk Research, Toronto & University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363599874",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    }
  ],
  "references": [
    {
      "text": "Bergman, L., Castelli, V., Lau, T., and Oblinger, D. DocWizards: a system for authoring follow-me documentation wizards. Proc. of UIST '05, ACM (2005), 191--200.  ",
      "doi": "10.1145/1095034.1095067"
    },
    {
      "text": "Berthouzoz, F., Li, W., Dontcheva, M., and Agrawala, M. A Framework for content-adaptive photo manipulation macros: Application to face, landscape, and global manipulations. ACM Trans. Graph. 30, 5 (2011), 120:1--120:14.  ",
      "doi": "10.1145/2019627.2019639"
    },
    {
      "text": "Carroll, J. M. and Rosson, M. B. Paradox of the active user. In MIT Press, Cambridge, MA, USA, 1987, 80--111. ",
      "doi": "10.5555/28446.28451"
    },
    {
      "text": "Carroll, J. M., Smith-Kerker, P. L., Ford, J. R., and Mazur-Rimetz, S. A. The minimal manual. Hum.-Comput. Interact. 3, 2 (1987), 123--153.  ",
      "doi": "10.1207/s15327051hci0302_2"
    },
    {
      "text": "Carroll, J. M. The Nurnberg funnel: designing minimalist instruction for practical computer skill. MIT Press, Cambridge, MA, USA, 1990. ",
      "doi": "10.5555/80371"
    },
    {
      "text": "Chi, P.-Y., Ahn, S., Ren, A., et al. MixT: Automatic generation of step-by-step mixed media tutorials. Proc of UIST '12, ACM (2012), 93--102.  ",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Denning, J. D., Kerr, W. B., and Pellacini, F. MeshFlow: Interactive visualization of mesh construction sequences. ACM Trans. Graph. 30, 4 (2011), 66:1--66:8.  ",
      "doi": "10.1145/2010324.1964961"
    },
    {
      "text": "Ekstrand, M., Li, W., Grossman, T., Matejka, J., and Fitzmaurice, G. Searching for software learning resources using application context. Proc. of UIST '11, (2011),195--204.  ",
      "doi": "10.1145/2047196.2047220"
    },
    {
      "text": "Fernquist, J., Grossman, T., and Fitzmaurice, G. Sketch-sketch revolution: an engaging tutorial system for guided sketching and application learning. Proc of UIST '11, (2011), 373--382.  ",
      "doi": "10.1145/2047196.2047245"
    },
    {
      "text": "Fourney, A., Mann, R., and Terry, M. Characterizing the usability of interactive applications through query log analysis. Proc. of CHI '11, ACM (2011), 1817--1826.  ",
      "doi": "10.1145/1978942.1979205"
    },
    {
      "text": "Grabler, F., Agrawala, M., Li, W., Dontcheva, M., and Igarashi, T. Generating photo manipulation tutorials by demonstration. ACM Trans. Graph. 28, 3 (2009), 66:1--66:9.  ",
      "doi": "10.1145/1531326.1531372"
    },
    {
      "text": "Grossman, T., Fitzmaurice, G., and Attar, R. A survey of software learnability: metrics, methodologies and guidelines. Proc. of CHI '09, ACM (2009), 649--658.  ",
      "doi": "10.1145/1518701.1518803"
    },
    {
      "text": "Grossman, T. and Fitzmaurice, G. ToolClips: An investigation of contextual video assistance for functionality understanding. Proc. of CHI 2010, (2010), 1515--1524.  ",
      "doi": "10.1145/1753326.1753552"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. Chronicle: Capture, exploration, and playback of document workflow histories. Proc. of UIST '10, ACM (2010), 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Harrison, S. M. A comparison of still, animated, or nonillustrated on-line help with written or spoken instructions in a graphical user interface. Proc. of CHI '95, (1995), 82--89.  ",
      "doi": "10.1145/223904.223915"
    },
    {
      "text": "Huang, J. and Twidale, M. B. Graphstract: minimal graphical help for computers. Proc. of UIST '07, (2007), 203--212.  ",
      "doi": "10.1145/1294211.1294248"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Stencils-based tutorials: Design and evaluation. Proc. of CHI 2005, (2005), 541--550.  ",
      "doi": "10.1145/1054972.1055047"
    },
    {
      "text": "Knabe, K. Apple guide: a case study in user-aided design of online help. CHI '95 Conference Companion, ACM (1995), 286--287.  ",
      "doi": "10.1145/223355.223677"
    },
    {
      "text": "Kong, N., Grossman, T., Hartmann, B., Agrawala, M., and Fitzmaurice, G. Delta: a tool for representing and comparing workflows. Proc. of CHI '12, ACM (2012), 1027--1036.  ",
      "doi": "10.1145/2207676.2208549"
    },
    {
      "text": "Lafreniere, B., Bunt, A., Lount, M., Krynicki, F., and Terry, M. A. AdaptableGIMP: designing a socially-adaptable interface. UIST '11 Adjunct, ACM (2011), 89--90.  ",
      "doi": "10.1145/2046396.2046437"
    },
    {
      "text": "Lafreniere, B., Bunt, A., Lount, M., and Terry, M. \"Looks cool, I'll try this later!\": Understanding the faces and uses of online tutorials. University of Waterloo, Technical Report CS2012-01, 2012.",
      "doi": ""
    },
    {
      "text": "Laput, G., Adar, E., Dontcheva, M., and Li, W. Tutorial-based Interfaces for Cloud-enabled Applications. Proc of UIST '12, ACM (2012), 113--122.  ",
      "doi": "10.1145/2380116.2380132"
    },
    {
      "text": "Leshed, G., Haber, E. M., Matthews, T., and Lau, T. CoScripter: automating & sharing how-to knowledge in the enterprise. Proc of CHI '08, ACM (2008), 1719--1728.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Morey, R. D. Confidence intervals from normalized data: A correction to Cousineau (2005). Tutorials in Qualitative Methods for Psychology 4, (2008), 61--64.",
      "doi": ""
    },
    {
      "text": "Palmiter, S., Elkerton, J., and Baggett, P. Animated demonstrations vs written instructions for learning procedural tasks: a preliminary investigation. Int. J. Man-Mach. Stud. 34, 5 (1991), 687--701.  ",
      "doi": "10.1016/0020-7373%2891%2990019-4"
    },
    {
      "text": "Palmiter, S. and Elkerton, J. Animated demonstrations for learning procedural computer-based tasks. Hum.-Comput. Interact. 8, 3 (1993), 193--216.  ",
      "doi": "10.1207/s15327051hci0803_1"
    },
    {
      "text": "Pongnumkul, S., Dontcheva, M., Li, W., et al. Pause-and-play: automatically linking screencast video tutorials with applications. Proc of UIST '11, ACM (2011), 135--144.  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Google SketchUp Training. http://sketchup.google.com/intl/en/training/index.html.",
      "doi": ""
    },
    {
      "text": "Adobe Labs Tutorial Builder. http://labs.adobe.com/technologies/tutorialbuilder/.",
      "doi": ""
    }
  ]
}