{
  "doi": "10.1145/2470654.2470688",
  "title": "Flexpad: highly flexible bending interactions for projected handheld displays",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "237-246",
  "year": 2013,
  "badges": [],
  "abstract": "Flexpad is an interactive system that combines a depth camera and a projector to transform sheets of plain paper or foam into flexible, highly deformable, and spatially aware handheld displays. We present a novel approach for tracking deformed surfaces from depth images in real time. It captures deformations in high detail, is very robust to occlusions created by the user's hands and fingers, and does not require any kind of markers or visible texture. As a result, the display is considerably more deformable than in previous work on flexible handheld displays, enabling novel applications that leverage the high expressiveness of detailed deformation. We illustrate these unique capabilities through three application examples: curved cross-cuts in volumetric images, deforming virtual paper characters, and slicing through time in videos. Results from two user studies show that our system is capable of detecting complex deformations and that users are able to perform them quickly and precisely.",
  "authors": [
    {
      "name": "Jürgen Steimle",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    },
    {
      "name": "Andreas Jordt",
      "institution": "Christian-Albrechte-Universitat & Kiel University of Applied Sciences, Kiel, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453661800",
      "orcid": "missing"
    },
    {
      "name": "Pattie Maes",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100086306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Lucero, A. and Subramanian, S. Tilt displays: designing display surfaces with multi-axis tilting and actuation. In Proc. MobileHCI'12, ACM Press, 2012.  ",
      "doi": "10.1145/2371574.2371600"
    },
    {
      "text": "Balakrishnan, R., Fitzmaurice, G., Kurtenbach, G. and Singh K. Exploring interactive curve and surface manipulation using a bend and twist sensitive input strip. In Proc. I3D '99, 1999.  ",
      "doi": "10.1145/300523.300536"
    },
    {
      "text": "Bandyopadhyay, D., Raskar, R. and Fuchs, H. Dynamic shader lamps: Painting on movable objects. In Intl. Symp. Augmented Reality, 2001. ",
      "doi": "10.5555/582828.881324"
    },
    {
      "text": "Barnes C., Jacobs D., Sanders, J. and Goldman B. D., Rusinkiewicz, S., Finkelstein A. and Agrawala, M. Video puppetry: a performative interface for cutout animation. In Proc. SIGGRAPH Asia'08, ACM Press, 2008.  ",
      "doi": "10.1145/1457515.1409077"
    },
    {
      "text": "Benko, H, Jota R., and Wilson, A. MirageTable: freehand interaction on a projected augmented reality tabletop. In Proc. CHI '12, ACM Press, 2012.  ",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "Cagniart, C., Boyer E., and Ilic, S. Probabilistic deformable surface tracking from multiple videos. In Proc. ECCV'10. ",
      "doi": "10.5555/1888089.1888114"
    },
    {
      "text": "Cassinelli, A and Ishikawa, M. Khronos projector. In Proc. SIGGRAPH'05, ACM Press, 2005.  ",
      "doi": "10.1145/1187297.1187308"
    },
    {
      "text": "Chen, Y., Rui, Y., and Huang, T.S. Multicue HMM-UKF for real-time contour tracking. IEEE Transactions on Pattern Analysis and Machine Intelligence. 2006.  ",
      "doi": "10.1109/TPAMI.2006.190"
    },
    {
      "text": "Dijkstra, R., Perez, C., and Vertegaal, R. Evaluating effects of structural holds on pointing and dragging performance with flexible displays. In Proc. CHI '11, ACM Press, 2011.  ",
      "doi": "10.1145/1978942.1979135"
    },
    {
      "text": "Gallant, T. D., Seniuk, G.A., and Vertegaal, R. Towards more paper-like input: flexible input devices for foldable interaction styles. In Proc. UIST '08, ACM Press, 2008.  ",
      "doi": "10.1145/1449715.1449762"
    },
    {
      "text": "Harrison, C., Benko, H., and Wilson, A.D. OmniTouch: wearable multitouch interaction everywhere. In Proc. UIST '11, ACM Press, 2011.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Herkenrath, G., Karrer, T., and Borchers, J. Twend: twisting and bending as new interaction gesture in mobile devices. In Proc. CHI '08 Extended Abstracts, ACM Press, 2008.  ",
      "doi": "10.1145/1358628.1358936"
    },
    {
      "text": "Hilliges, O., Kim, D., Izadi, S., Weiss, M., and Wilson, A. HoloDesk: direct 3d interactions with a situated see-through display. In Proc. CHI '12, ACM Press, 2012.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Hilsmann, A., Schneider, D. C., and Eisert, P. Realistic cloth augmentation in single view video under occlusions. Comput. Graph., 2010.  ",
      "doi": "10.1016/j.cag.2010.05.015"
    },
    {
      "text": "Holman, D., Vertegaal, R., Altosaar, M., Troje, N., and Johns D. Paper windows: interaction techniques for digital paper. In Proc. CHI '05, ACM Press, 2005.  ",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Izadi, S., Kim, D., Hilliges, O., Molyneaux, D., Newcombe, R., Kohli, P., Shotton, J., Hodges, S., Freeman, D., Davison, A., and Fitzgibbon, A. KinectFusion: real-time 3d reconstruction and interaction using a moving depth camera. In Proc. UIST '11, ACM Press, 2011.  ",
      "doi": "10.1145/2047196.2047270"
    },
    {
      "text": "Jordt, A and Koch, R. Direct model-based tracking of 3d object deformations in depth and color video. Intl. J. Computer Vision, 2012.  ",
      "doi": "10.1007/s11263-012-0572-1"
    },
    {
      "text": "Khalilbeigi, M., Lissermann, R., Kleine, W., and Steimle J. FoldMe: interacting with double-sided foldable displays. In Proc. TEI '12, ACM Press, 2012.  ",
      "doi": "10.1145/2148131.2148142"
    },
    {
      "text": "Khalilbeigi, M., Lissermann, R., Mühlhäuser, M., and Steimle, J. Xpaaand: Interaction techniques for rollable displays. In Proc. CHI '11, ACM Press, 2011.  ",
      "doi": "10.1145/1978942.1979344"
    },
    {
      "text": "Kildal, J., Paasovaara, S., and Aaltonen, V. Kinetic device: designing interactions with a deformable mobile interface. In Proc. CHI 2012 Extended Abstracts, ACM Press, 2012.  ",
      "doi": "10.1145/2212776.2223721"
    },
    {
      "text": "Kildal, J. and Wilson, G. Feeling it: the roles of stiffness, deformation range and feedback in the control of deformable UI. In Proc. ICMI'12, 2012  ",
      "doi": "10.1145/2388676.2388766"
    },
    {
      "text": "Konieczny, J., Shimizu, C., Gary Meyer, and D'nardo Colucci. A handheld flexible display system. In Proc. IEEE Visualization 2005, IEEE Press, 2005.",
      "doi": ""
    },
    {
      "text": "Lahey, B., Girouard, A., Burleson, W., and Vertegaal, R. PaperPhone: understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proc. CHI '11, ACM Press, 2011.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Lee J. C., Hudson, S. E., and Tse, E. Foldable interactive displays. In Proc. UIST '08, ACM Press, 2008.  ",
      "doi": "10.1145/1449715.1449763"
    },
    {
      "text": "Lee, S. S., Kim, B., Jin, B., Choi, E., Kim, B., Jia, X., Kim, D., and Lee, K. P. How users manipulate deformable displays as input devices. In Proc. CHI '10, ACM Press, 2010.  ",
      "doi": "10.1145/1753326.1753572"
    },
    {
      "text": "Looser, J., Grasset, R., and Billinghurst, M. A 3D flexible and tangible magic lens in augmented reality. In Proc. ISMAR '07  ",
      "doi": "10.1109/ISMAR.2007.4538825"
    },
    {
      "text": "Mark, R., Borch, J., Habeger, C., and Lyne, B. Handbook of Physical Testing of Paper Vol. 1. CRC Press, 2001.",
      "doi": ""
    },
    {
      "text": "Mistry, P., Maes, P., and Chang, L. WUW - wear ur world: a wearable gestural interface. In Proc. CHI '09 EA, 2009.  ",
      "doi": "10.1145/1520340.1520626"
    },
    {
      "text": "Ostermeier, A. and Hansen, N. An evolution strategy with coordinate system invariant adaptation of arbitrary normal mutation distributions within the concept of mutative strategy parameter control. In Proc. Genetic and Evolutionary Comp. Conf., 1999.",
      "doi": ""
    },
    {
      "text": "Piper, B., Ratti, C., and Ishii, H. Illuminating clay: a 3-d tangible interface for landscape analysis. In Proc. CHI'02, 2002.  ",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Saroul, L., Gerlach, S., and Hersch, R. D. Exploring curved anatomic structures with surface sections. In Proc. IEEE Visualization, 2003.  ",
      "doi": "10.1109/VISUAL.2003.1250351"
    },
    {
      "text": "Schwesig, C., Poupyrev, I., and Mori, E. Gummi: a bendable computer. In Proc. CHI '04, ACM Press, 2004.  ",
      "doi": "10.1145/985692.985726"
    },
    {
      "text": "Sorkine, O. and Alexa, M. As-rigid-as-possible surface modeling. In Proc. Eurographics, 2007. ",
      "doi": "10.5555/1281991.1282006"
    },
    {
      "text": "Spindler, M., Martsch, M., and Dachselt, R. Going beyond the surface: studying multi-layer interaction above the tabletop. In Proc. CHI'12, ACM Press, 2012.  ",
      "doi": "10.1145/2207676.2208583"
    },
    {
      "text": "Spindler, M., Stellmach, S., and Dachselt, R. PaperLens: advanced magic lens interaction above the tabletop. In Proc. ITS'09, ACM Press, 2009.  ",
      "doi": "10.1145/1731903.1731920"
    },
    {
      "text": "Varol, A., Salzmann, M., Tola, E., and Fua, P. Template-free monocular reconstruction of deformable surfaces. In Proc. Computer Vision, 2009.",
      "doi": ""
    },
    {
      "text": "Wilson, A. D. and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. UIST '10, ACM Press, 2010.  ",
      "doi": "10.1145/1866029.1866073"
    }
  ]
}