{
  "doi": "10.1145/2470654.2481417",
  "title": "TrailMap: facilitating information seeking in a multi-scale digital map via implicit bookmarking",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3009-3018",
  "year": 2013,
  "badges": [],
  "abstract": "Web applications designed for map exploration in local neighborhoods have become increasingly popular and important in everyday life. During the information-seeking process, users often revisit previously viewed locations, repeat earlier searches, or need to memorize or manually mark areas of interest. To facilitate rapid returns to earlier views during map exploration, we propose a novel algorithm to automatically generate map bookmarks based on a user's interaction. TrailMap, a web application based on this algorithm, is developed, providing a fluid and effective neighborhood exploration experience. A one-week study is conducted to evaluate TrailMap in users' everyday web browsing activities. Results showed that TrailMap's implicit bookmarking mechanism is efficient for map exploration and the interactive and visual nature of the tool is intuitive to users.",
  "tags": [
    "multi-scale exploration",
    "revisitation",
    "implicit bookmarking",
    "interaction history",
    "digital map browsing"
  ],
  "authors": [
    {
      "name": "Jian Zhao",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81484648585/rel-imgonly/dsc_7313__jian_zhao_portrait_large_.jpg",
      "acmid": "81484648585",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Bing map services. http://msdn.microsoft.com/enus/library/dd877180.aspx.",
      "doi": ""
    },
    {
      "text": "D. Abrams, R. Baecker, and M. Chignell. Information archiving with bookmarks: personal web space construction and organization. In CHI'98, pages 41--48, 1998.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "E. Adar, J. Teevan, and S. T. Dumais. Large scale analysis of web revisitation patterns. In CHI'00, pages 1197--1206, 2008.  ",
      "doi": "10.1145/1357054.1357241"
    },
    {
      "text": "J. Alexander, A. Cockburn, S. Fitchett, C. Gutwin, and S. Greenberg. Revisiting read wear: analysis, design, and evaluation of a footprints scrollbar. In CHI'09, pages 1665--1674, 2009.  ",
      "doi": "10.1145/1518701.1518957"
    },
    {
      "text": "C. Appert and J.-D. Fekete. Orthozoom scroller: 1d multi-scale navigation. In CHI'06, pages 21--30, 2006.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "B. B. Bederson and J. D. Hollan. Pad++: a zooming graphical interface for exploring alternate interface physics. In UIST'94, pages 17--26, 1994.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "M. S. T. Carpendale and C. Montagnese. A framework for unifying presentation space. In UIST'01, pages 61--70, 2001.  ",
      "doi": "10.1145/502348.502358"
    },
    {
      "text": "A. Cockburn, C. Gutwin, and S. Greenberg. A predictive model of menu performance. In CHI'07, pages 627--636, 2007.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "A. Cockburn and B. Mckenzie. What do web users do? an empirical analysis of web use. Int. J. of Human-Computer Studies, 54:903--922, 2000.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "C. Dunne, N. Henry Riche, B. Lee, R. Metoyer, and G. Robertson. Graphtrail: analyzing large multivariate, heterogeneous networks while supporting exploration history. In CHI'12, pages 1663--1672, 2012.  ",
      "doi": "10.1145/2207676.2208293"
    },
    {
      "text": "C. Forlines, C. Shen, and B. Buxton. Glimpse: a novel input model for multi-level devices. In CHI '05 extended abstracts, pages 1375--1378, 2005.  ",
      "doi": "10.1145/1056808.1056920"
    },
    {
      "text": "G. W. Furnas and B. B. Bederson. Space-scale diagrams: understanding multiscale interfaces. In CHI'95, pages 234--241, 1995.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "S. Greenberg and I. H. Witten. Supporting command reuse: empirical foundations and principles. Int. J. Man-Mach. Stud., 39(3):353--390, 1993.  ",
      "doi": "10.1006/imms.1993.1065"
    },
    {
      "text": "C. Gutwin and A. Cockburn. Improving list revisitation with listmaps. In AVI'06, pages 396--403, 2006.  ",
      "doi": "10.1145/1133265.1133347"
    },
    {
      "text": "J. Heer, J. Mackinlay, C. Stolte, and M. Agrawala. Graphical histories for visualization: Supporting analysis, communication, and evaluation. IEEE Trans. on Vis. and Comput. Graphics, 14(6):1189--1196, 2008.  ",
      "doi": "10.1109/TVCG.2008.137"
    },
    {
      "text": "W. C. Hill, J. D. Hollan, D. Wroblewski, and T. McCandless. Edit wear and read wear. In CHI'92, pages 3--9, 1992.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "K. Hornb, B. B. Bederson, and C. Plaisant. Navigation patterns and usability of zoomable user interfaces with and without an overview. ACM Trans. Comput.-Hum. Interact., 9(4):362--389, 2002.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "T. Igarashi and K. Hinckley. Speed-dependent automatic zooming for browsing large documents. In UIST'00, pages 139--148, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "W. Javed, S. Ghani, and N. Elmqvist. Gravnav: using a gravity model for multi-scale navigation. In AVI'12, pages 217--224, 2012.  ",
      "doi": "10.1145/2254556.2254597"
    },
    {
      "text": "W. Javed, S. Ghani, and N. Elmqvist. Polyzoom: multiscale and multifocus exploration in 2d visual spaces. In CHI'12, pages 287--296, 2012.  ",
      "doi": "10.1145/2207676.2207716"
    },
    {
      "text": "S. Jul and G. W. Furnas. Critical zones in desert fog: aids to multiscale navigation. In UIST'98, pages 97--106, 1998.  ",
      "doi": "10.1145/288392.288578"
    },
    {
      "text": "S. A. Laakso, K. P. Laakso, and A. J. Saura. Improved scroll bars. In CHI '00: extended abstracts, pages 97--98, 2000.  ",
      "doi": "10.1145/633292.633350"
    },
    {
      "text": "E. Pietriga and C. Appert. Sigma lenses: focus-context transitions combining space, time and translucence. In CHI'08, pages 1343--1352, 2008.  ",
      "doi": "10.1145/1357054.1357264"
    },
    {
      "text": "D. C. Robbins, E. Cutrell, R. Sarin, and E. Horvitz. Zonezoom: map navigation for smartphones with recursive view segmentation. In AVI'04, pages 231--234, 2004.  ",
      "doi": "10.1145/989863.989901"
    },
    {
      "text": "M. Sarkar, S. S. Snibbe, O. J. Tversky, and S. P. Reiss. Stretching the rubber sheet: a metaphor for viewing large layouts on small screens. In UIST'93, pages 81--91, 1993.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "A. Skopik and C. Gutwin. Improving revisitation in fisheye views with visit wear. In CHI'05, pages 771--780, 2005.  ",
      "doi": "10.1145/1054972.1055079"
    },
    {
      "text": "A. Tabard, W. Mackay, N. Roussel, and C. Letondal. Pagelinker: integrating contextual bookmarks within a browser. In CHI'07, pages 337--346, 2007.  ",
      "doi": "10.1145/1240624.1240680"
    },
    {
      "text": "L. Tauscher and S. Greenberg. Revisitation patterns in world wide web navigation. In CHI'97, pages 399--406, 1997.  ",
      "doi": "10.1145/258549.258816"
    },
    {
      "text": "A. Wexelblat and P. Maes. Footprints: history-rich tools for information foraging. In CHI'99, pages 270--277, 1999.  ",
      "doi": "10.1145/302979.303060"
    },
    {
      "text": "A. Woodruff, J. Landay, and M. Stonebraker. Goal-directed zoom. In CHI'98, pages 305--306, 1998.  ",
      "doi": "10.1145/286498.286781"
    },
    {
      "text": "K. Yatani, K. Partridge, M. Bern, and M. W. Newman. Escape: a target selection technique using visually-cued gestures. In CHI'08, pages 285--294, 2008.  ",
      "doi": "10.1145/1357054.1357104"
    },
    {
      "text": "C. Yu, R. Balakrishnan, K. Hinckley, T. Moscovich, and Y. Shi. Implicit bookmarking: Improving support for revisitation in withindocument reading tasks. Int. J. of Human-Computer Studies, 71(3):303--320, 2013.  ",
      "doi": "10.1016/j.ijhcs.2012.10.012"
    },
    {
      "text": "J. Zhao, F. Chevalier, and R. Balakrishnan. Kronominer: using multifoci navigation for the visual exploration of time-series data. In CHI'11, pages 1737--1746, 2011.  ",
      "doi": "10.1145/1978942.1979195"
    }
  ]
}