{
  "doi": "10.1145/2470654.2481311",
  "title": "Effects of peer feedback on contribution: a field experiment in Wikipedia",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2253-2262",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "One of the most significant challenges for many online communities is increasing members' contributions over time. Prior studies on peer feedback in online communities have suggested its impact on contribution, but have been limited by their correlational nature. In this paper, we conducted a field experiment on Wikipedia to test the effects of different feedback types (positive feedback, negative feedback, directive feedback, and social feedback) on members' contribution. Our results characterize the effects of different feedback types, and suggest trade-offs in the effects of feedback between the focal task and general motivation, as well as differences in how newcomers and experienced editors respond to peer feedback. This research provides insights into the mechanisms underlying peer feedback in online communities and practical guidance to design more effective peer feedback systems.",
  "authors": [
    {
      "name": "Haiyi Zhu",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    },
    {
      "name": "Amy Zhang",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558088856",
      "orcid": "missing"
    },
    {
      "name": "Jiping He",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558241656",
      "orcid": "missing"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Aniket Kittur",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81350583094/rel-imgonly/kittur_photo.jpg",
      "acmid": "81350583094",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashforth, B.E., and Saks, A. M. (1996) Socialization Tactics: Longitudinal Effects on Newcomer Adjustment. The Academy of Management Journal, Vol. 39, No. 1 (Feb., 1996), pp. 149--178.",
      "doi": ""
    },
    {
      "text": "Baumeister, R.F.; Cairns, K.J. (1992) Repression and self-presentation: When audiences interfere with selfdeceptive strategies. Journal of Personality and Social Psychology, Vol 62(5), May 1992, 851--862.",
      "doi": ""
    },
    {
      "text": "Brehm, J.W. (1966) A Theory of Psychological Reactance. Oxford, England: Academic Press. (1966). x 135 pp.",
      "doi": ""
    },
    {
      "text": "Brzozowski, M. J., Sandholm, T., & Hogg, T. (2009, May). Effects of feedback and peer pressure on contributions to enterprise social media. In Proceedings of the ACM 2009 international conference on Supporting group work (pp. 61--70). ACM.  ",
      "doi": "10.1145/1531674.1531684"
    },
    {
      "text": "Choi, B. R., Alexander, K., Kraut, R. E., & Levine, J. M. (2010). Socialization Tactics in Wikipedia and Their Effects CSCW'10: Proceedings of the ACM Conference on Computer-Supported Cooperative Work (pp. 107--116 ). New York: ACM Press  ",
      "doi": "10.1145/1718918.1718940"
    },
    {
      "text": "Cosley D., Frankowski D., Terveen L., and Riedl J. (2007) SuggestBot: using intelligent task routing to help people find work in wikipedia. In Proceedings of the 12th international conference on Intelligent user interfaces (IUI '07). ACM, New York, NY, USA, 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Deci, E.L.; Koestner, R., Ryan, R.M. (1999) A metaanalytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological Bulletin, 125, 627--668.",
      "doi": ""
    },
    {
      "text": "Halfaker, A., Kittur A., and Riedl J. (2011) Don't bite the newbies: how reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11).  ",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "Hattie, J., & Timperley, H. (2007). The power of feedback. Review of educational research, 77(1), 81112.",
      "doi": ""
    },
    {
      "text": "Ilgen D.R., Fisher, C.D., & Taylor, M.S.(1979) Consequences of individual feedback on behavior in organization. Journal of Applied Psychology, 64, 349371.",
      "doi": ""
    },
    {
      "text": "Kluger, A. N., DeNisi, A. (1996) The effects of feedback interventions on performance: A historical review, a meta-analysis, and a preliminary feedback intervention theory. Psychological Bulletin, Vol 119(2), Mar 1996, 254--284.",
      "doi": ""
    },
    {
      "text": "Lampe, C., & Johnston, E. (2005, November). Follow the (slash) dot: effects of feedback on new members in an online community. In Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work (pp. 11--20). ACM.  ",
      "doi": "10.1145/1099203.1099206"
    },
    {
      "text": "March 2012 Web Server Survey http://news.netcraft.com/archives/2012/03/05/march2012-web-server-survey.html",
      "doi": ""
    },
    {
      "text": "Moon, J. Y., & Sproull, L. S. (2008). The role of feedback in managing the Internet-based volunteer work force. Information Systems Research, 19(4), 494--515.",
      "doi": ""
    },
    {
      "text": "Wikipedia editors. Linux. http://en.wikipedia.org/wiki/Linux",
      "doi": ""
    },
    {
      "text": "Wikipedia editors. Research talk:Effects of Feedback on Participation in Wikipedia http://meta.wikimedia.org/wiki/Research_talk:Effects_o f_Feedback_on_Participation_in_Wikipedia",
      "doi": ""
    },
    {
      "text": "Wikipedia editors. Wikipedia. http://en.wikipedia.org/wiki/Wikipedia",
      "doi": ""
    },
    {
      "text": "Yukl, G. A. (1998). Leadership in organizations (4th ed.). Upper Saddle River, N.J.: Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Zhu, H., Kraut, R., & Kittur, A. (2012). Effectiveness of shared leadership in online communities. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (pp. 407--416). ACM.  ",
      "doi": "10.1145/2145204.2145269"
    },
    {
      "text": "Zhu, H., Kraut, R. E., Wang, Y. C., & Kittur, A. (2011). Identifying shared leadership in Wikipedia. In Proceedings of the 2011 annual conference on Human factors in computing systems (pp. 3431--3434). ACM.  ",
      "doi": "10.1145/1978942.1979453"
    }
  ]
}