{
  "doi": "10.1145/2470654.2470738",
  "title": "Morphees: toward high \"shape resolution\" in self-actuated flexible mobile devices",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "593-602",
  "year": 2013,
  "badges": [],
  "abstract": "We introduce the term shape resolution, which adds to the existing definitions of screen and touch resolution. We propose a framework, based on a geometric model (Non-Uniform Rational B-splines), which defines a metric for shape resolution in ten features. We illustrate it by comparing the current related work of shape changing devices. We then propose the concept of Morphees that are self-actuated flexible mobile devices adapting their shapes on their own to the context of use in order to offer better affordances. For instance, when a game is launched, the mobile device morphs into a console-like shape by curling two opposite edges to be better grasped with two hands. We then create preliminary prototypes of Morphees in order to explore six different building strategies using advanced shape changing materials (dielectric electro active polymers and shape memory alloys). By comparing the shape resolution of our prototypes, we generate insights to help designers toward creating high shape resolution Morphees.",
  "authors": [
    {
      "name": "Anne Roudaut",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    },
    {
      "name": "Abhijit Karnik",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81484644010/rel-imgonly/abe4-sq.jpg",
      "acmid": "81484644010",
      "orcid": "missing"
    },
    {
      "name": "Markus Löchtefeld",
      "institution": "German Research Center for Artificial Intelligence, Saarbrucken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608347",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Lucero, A., Subramanian, S. Tilt Displays: Designing Display Surfaces with Multi-axis Tilting and Actuation, MobileHCI12.",
      "doi": ""
    },
    {
      "text": "Artcon: www.artcom.de.",
      "doi": ""
    },
    {
      "text": "Bau, O., Petrevski, U., Mackay, W. BubbleWrap: a textile-based electromagnetic haptic display. CHI EA '09, 3607--3612.  ",
      "doi": "10.1145/1520340.1520542"
    },
    {
      "text": "Benko, H., Wilson, A. D., Balakrishnan, R. Sphere: multi-touch interactions on a spherical display. UIST'08. 77--86.  ",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "Coelho, M. and Maes, P. Shutters: A Permeable Surface for Environmental Control and Communication. TEI'09, 13.  ",
      "doi": "10.1145/1517664.1517671"
    },
    {
      "text": "Coelho, M., Ishii, H., Maes, P. Surflex: a programmable surface for the design of tangible interfaces. CHI'08, 3429.  ",
      "doi": "10.1145/1358628.1358869"
    },
    {
      "text": "Coelho M., Zigelbaum, J. 2011. Shape-changing interfaces. Personal Ubiquitous Comput. 15, 2, 161--173.  ",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Dickie, C., Fellion, N., Vertegaal, R. FlexCam: using thin-film flexible OLED color prints as a camera array. CHIEA'12.  ",
      "doi": "10.1145/2212776.2212383"
    },
    {
      "text": "Fan, J.-N., Schodek, D. Personalized furniture within the condition of mass production. Ubicomp'07.",
      "doi": ""
    },
    {
      "text": "Follmer S., Leithinger, D., Olwal, A., Cheng, N., Ishii, H. Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices. UIST'12.  ",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "Girouard, A., Tarun, A., Vertegaal, R. DisplayStacks: interaction techniques for stacks of flexible thin-film displays. CHI '12, 2431--2440.  ",
      "doi": "10.1145/2207676.2208406"
    },
    {
      "text": "Gupta, S., Campbell, T., Hightower, J. R., Patel. S. N. SqueezeBlock: using virtual springs in mobile devices for eyeMorphee-free interaction. UIST '10.101--104.  ",
      "doi": "10.1145/1866029.1866046"
    },
    {
      "text": "Harrison, C. Hudson, S. E. Providing Dynamically Changeable Physical Buttons on a Visual Display. CHI '09, 299--308.  ",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Harrison, C., Benko, H., Wilson, A. D. OmniTouch: wearable multitouch interaction everywhere. UIST '11, 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Hemmert, F. Ambient Life: Permanent Tactile Life-like Actuation as a Status Display in Mobile Phones. UIST EA'08.",
      "doi": ""
    },
    {
      "text": "Hemmert, F., Hamann, S., Löwe, M., Wohlauf, A., and Joost, G. Shape-changing mobiles: tapering in one-dimensional deformational displays in mobile phones. TEI'10, 249--252.  ",
      "doi": "10.1145/1709886.1709936"
    },
    {
      "text": "Hemmert, F, Gesche, J., André, K., Reto, W. Dynamic Knobs: Shape Change as a Means of Interaction on a Mobile Phone. CHIEA'08, 2309--2314  ",
      "doi": "10.1145/1358628.1358675"
    },
    {
      "text": "Holman, D., Vertegaal, R., Altosaar, M., Troje, N., Johns, D. Paper windows: interaction techniques for digital paper. CHI '05, 591--599.  ",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Holman D., Vertegaal, R.. TactileTape: low-cost touch sensing on curved surfaces. UIST '11 Adjunct, 17--18.  ",
      "doi": "10.1145/2046396.2046406"
    },
    {
      "text": "Ishii, H., Lakatos, D., Bonanni, L. Labrune, J. B. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (January 2012), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Issa, R., Essential Mathematics for Computational Design, Robert McNeel & Associates.",
      "doi": ""
    },
    {
      "text": "Iwata, H., Yano, H., Nakaizumi, F., Kawamura, R. Project Feelex: adding haptic surface to graphics. SIGGRAPH'01, 469--476.  ",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Jansen, Y. Mudpad: Fluid Haptics for Multitouch Surfaces. CHI EA'10, 4351--4356.  ",
      "doi": "10.1145/1753846.1754152"
    },
    {
      "text": "Khalilbeigi, M. Lissermann, R., Mühlhäuser, M., Steimle, J. Xpaaand: interaction techniques for rollable displays. CHI '11.  ",
      "doi": "10.1145/1978942.1979344"
    },
    {
      "text": "Kim, H., Lee, W. Shade Pixel. SIGGRAPH '08, 34.  ",
      "doi": "10.1145/1400885.1400922"
    },
    {
      "text": "Kim, S., Kim, H., Lee, B., Nam, T. J., Lee, W. Inflatable mouse: Volume-adjustable Mouse with Air-pressure-sensitive Input and Haptic Feedback. CHI'08, 211--214.  ",
      "doi": "10.1145/1357054.1357090"
    },
    {
      "text": "Lahey, B., Girouard, A., Burleson, W., Vertegaal, R. PaperPhone: understanding the use of bend gestures in mobile devices with flexible electronic paper displays. CHI '11. 1303--1312.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Leithinger, D., Lakatos, D., DeVincenzi, A., Blackshaw, M., Ishii, H. Direct and gestural interaction with relief: a 2.5D shape display. UIST '11, 541--548.  ",
      "doi": "10.1145/2047196.2047268"
    },
    {
      "text": "Matoba, Y., Sato, T., Takahashi, N., Koike, H. ClaytricSurface: An Interactive Surface With Dynamic Softness Control Capability, SIGGRAPH'02 Emerging Technologies.  ",
      "doi": "10.1145/2343456.2343462"
    },
    {
      "text": "Michelitsch, G., Williams, J., Osen, M., Jimenez, B., Rapp, S. Haptic chameleon: a new concept of shape-changing user interface controls with force feedback. CHIEA'04, 1305--1308.  ",
      "doi": "10.1145/985921.986050"
    },
    {
      "text": "Nakagawa, Y., Kamimura, A., Kawaguchi, Y. MimicTile: a variable stiffness deformable user interface for mobile devices. CHI '12, 745--748.  ",
      "doi": "10.1145/2207676.2207782"
    },
    {
      "text": "Nakatani, M., Kajimoto, H., Sekiguchi, D., Kawakami, N., Tachi,S. 3D Form display with shape memory alloy, ICAT'03.",
      "doi": ""
    },
    {
      "text": "Norman, D. A. The Design of Everyday Things. New York, Doubleday. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Oosterhuis, K., Biloria, N. Interactions with proactive architectural spaces: the muscle projects. Com. ACM 2008, 70.  ",
      "doi": "10.1145/1349026.1349041"
    },
    {
      "text": "Oschuetz, L., Wessolek, D., and Sattler, W. 2010. Constructing with movement: Kinematics. TEI'10, 257--260.  ",
      "doi": "10.1145/1709886.1709938"
    },
    {
      "text": "Paik, J., An, B., Rus, D., Wood, R. Robotic origamis: self-morphing modular robots Actuated origami. Proc. Int. Conf. on Morphological Computation, Venice, Italy, Sept., 2011.",
      "doi": ""
    },
    {
      "text": "Parkes, A., Ishii, H. Bosu: a physical programmable design tool for transformability with soft mechanics. DIS'10, 189--198.  ",
      "doi": "10.1145/1858171.1858205"
    },
    {
      "text": "Poupyrev, I., Nashida, T., Maruyama, S., Rekimoto, J., Yamaji, Y. Lumen: interactive visual and shape display for calm computing. SIGGRAPH '04, 17.  ",
      "doi": "10.1145/1186155.1186173"
    },
    {
      "text": "Poupyrev, I., Nashida, T., Okabe, M. Actuation and tangible user interfaces: the Vaucanson duck, robots, and shape displays. TEI'07, 206--212.  ",
      "doi": "10.1145/1226969.1227012"
    },
    {
      "text": "Qi, J., Buechley, L. Animating paper using shape memory alloys. CHI '12, 749--752.  ",
      "doi": "10.1145/2207676.2207783"
    },
    {
      "text": "Raffle, H. S, Parkes, A. J., and Ishii, H. Topobo: A Constructive Assembly System with Kinetic Memory. CHI'04, 647--654.  ",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Rasmussen, M. K, Pedersen, E. W., Petersen, M. G., Hornbæk, K. Shape-changing interfaces: a review of the design space and open research questions. CHI'12, 735--744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Rosenberg, I., Perlin, K. The UnMousePad: an interpolating multi-touch force-sensing input pad. SIGGRAPH'09, 65.  ",
      "doi": "10.1145/1576246.1531371"
    },
    {
      "text": "Sato, M., Development of String-based Force Display: SPIDAR. VSMM'02. 1034--1039.",
      "doi": ""
    },
    {
      "text": "Schwesig, C., Poupyrev, I., and Mori, E. 2004. Gummi: a bendable computer. CHI '04, 263--270.  ",
      "doi": "10.1145/985692.985726"
    },
    {
      "text": "Stevenson, A., Perez, C., Vertegaal, R. 2010. An inflatable hemispherical multi-touch display. TEI '11.289--292.  ",
      "doi": "10.1145/1935701.1935766"
    },
    {
      "text": "Sugiura, Y., Lee, C., Ogata, M., Withana, A., Makino, Y., Sakamoto, D., Inami, M., Igarashi, T. PINOKY: a ring that animates your plush toys. CHI'12, 725--734.  ",
      "doi": "10.1145/2207676.2207780"
    },
    {
      "text": "Sutherland, I. E. 1965, The Ultimate Display, in IFIP Congress, 506--508.",
      "doi": ""
    },
    {
      "text": "Terzopoulos, D., Qin, H. Dynamic NURBSS with geometric constraints for interactive sculpting. ACM ToG'94.  ",
      "doi": "10.1145/176579.176580"
    },
    {
      "text": "Togler, J., Hemmert, F., and Wettach, R. 2009. Living interfaces: The Thrifty Faucet. TEI'09, 43--44.  ",
      "doi": "10.1145/1517664.1517680"
    },
    {
      "text": "Vertegaal, R., Poupyrev, I. Organic User Interfaces: Introduction to Special Issue. ACM 51(6). 2008: pp. 26--30.  ",
      "doi": "10.1145/1349026.1349033"
    },
    {
      "text": "Villar, N., Izadi, S., Rosenfeld, D., Benko, H., Helmes, J., Westhues, J., Hodges, S., Ofek, E., Butler, A., Cao, X. Chen, B. Mouse 2.0: multi-touch meets the mouse. UIST '09, 33--42.  ",
      "doi": "10.1145/1622176.1622184"
    },
    {
      "text": "Wakita, A., Nakano, A., Kobayashi, N. Programmable blobs: a rheologic interface for organic shape design. TEI'11, 273--276.  ",
      "doi": "10.1145/1935701.1935760"
    },
    {
      "text": "Watanabe, J., Mochizuki, A., and Horry, Y. Bookisheet: bendable device for browsing content using the metaphor of leafing through the pages. UbiComp'08, 360--369.  ",
      "doi": "10.1145/1409635.1409684"
    },
    {
      "text": "Wimmer, R. FlyEye: grasp-sensitive surfaces using optical fiber. In Proc. TEI '10, 245--248.  ",
      "doi": "10.1145/1709886.1709935"
    },
    {
      "text": "Wimmer, R., Baudisch, P.. Modular and deformable touch-sensitive surfaces based on time domain reflectometry. UIST'11.  ",
      "doi": "10.1145/2047196.2047264"
    },
    {
      "text": "www.deckeryeadon.com",
      "doi": ""
    },
    {
      "text": "Zigelbaum, J., Chang, A., Gouldstone, J., Monzen, J., Ishii, H. SpeakCup: Simplicity, BABL, and Shape Change. TEI'08.  ",
      "doi": "10.1145/1347390.1347422"
    }
  ]
}