{
  "doi": "10.1145/2470654.2481411",
  "title": "Play it by ear: a case for serendipitous discovery of places with musicons",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2959-2968",
  "year": 2013,
  "badges": [],
  "abstract": "Current location-based services (LBS) typically allow users to locate points of interest (POI) in their vicinity but can detract from the user's emotional experience of exploring a new location. In this paper, we examine how cues in the form of popular music (musicons) can emotionally engage users and enhance their experience of discovering nearby POIs serendipitously in unfamiliar places. The primary contribution of this paper is a field study, in which we evaluate the performance and emotional engagement of different types of audio-based cues for directing users' attention to specific POIs. Musicons and mixed-modality cues performed close to visual and speech cues, and significantly better than auditory icons, for POI identification while creating a much more pleasant and engaging user experience. We conclude that cues for POI discovery need not always be as explicit as the baseline visual cues. Indeed, the most challenging cues, auditory icons, led to a heightened sense of autonomy.",
  "authors": [
    {
      "name": "Anupriya Ankolekar",
      "institution": "HP Labs, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321488912",
      "orcid": "missing"
    },
    {
      "name": "Thomas Sandholm",
      "institution": "HP Labs, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81332525459/rel-imgonly/me.jpg",
      "acmid": "81332525459",
      "orcid": "missing"
    },
    {
      "name": "Louis Yu",
      "institution": "Pomona College, Claremont, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557118556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarwal, A., and Meyer, A. Beyond usability: Evaluating emotional response as an integral part of the user experience. In CHI '09, ACM (2009), 2919--2930.  ",
      "doi": "10.1145/1520340.1520420"
    },
    {
      "text": "Alty, J. L., and Rigas, D. I. Communicating graphical information to blind users using music: the role of context. In CHI '98, ACM Press/Addison-Wesley Publishing Co. (New York, NY, USA, 1998), 574--581.  ",
      "doi": "10.1145/274644.274721"
    },
    {
      "text": "Ankolekar, A., and Sandholm, T. Foxtrot: a soundtrack for where you are. In Proceedings of Interacting with Sound, workshop at MobileHCI '11, IwS '11, ACM (New York, NY, USA, 2011), 26--31.  ",
      "doi": "10.1145/2019335.2019341"
    },
    {
      "text": "Bull, M. Sound moves: iPod culture and urban experience. Routledge, 2008. ",
      "doi": "10.5555/1795928"
    },
    {
      "text": "Denora, T. Music in everyday life. Cambridge University Press, 2000.",
      "doi": ""
    },
    {
      "text": "Garzonis, S., Jones, S., Jay, T., and O'Neill, E. Auditory icon and earcon mobile service notifications: intuitiveness, learnability, memorability and preference. In CHI '09, ACM (New York, NY, USA, 2009), 1513--1522.  ",
      "doi": "10.1145/1518701.1518932"
    },
    {
      "text": "Goodman, J., Brewster, S., and Gray, P. Using field experiments to evaluate mobile guides. In Proc. of HCI in Mobile Guides, workshop at Mobile HCI 2004 (2004).",
      "doi": ""
    },
    {
      "text": "Goodman, J., Brewster, S. A., and Gray, P. How can we best use landmarks to support older people in navigation? Journal of Behaviour and Information Technology 24 (2005), 3--20.",
      "doi": ""
    },
    {
      "text": "Holland, S., Morse, D. R., and Gedenryd, H. Audiogps: Spatial audio navigation with a minimal attention interface. Personal Ubiquitous Comput. (Jan. 2002), 253--259.  ",
      "doi": "10.1007/s007790200025"
    },
    {
      "text": "Johnson, F. D. The effects of music on temporary disposition (unpublished manuscript), 2001.",
      "doi": ""
    },
    {
      "text": "Jones, M., Jones, S., Bradley, G., Warren, N., Bainbridge, D., and Holmes, G. Ontrack: Dynamically adapting music playback to support navigation. Personal Ubiquitous Comput. 12 (October 2008), 513--525.  ",
      "doi": "10.1007/s00779-007-0155-2"
    },
    {
      "text": "Kurczak, J., Graham, T. C. N., Joly, C., and Mandryk, R. L. Hearing is believing: evaluating ambient audio for location-based games. In ACE '11, ACM (New York, NY, USA, 2011), 32:1--32:8.  ",
      "doi": "10.1145/2071423.2071463"
    },
    {
      "text": "McGee-Lennon, M., Wolters, M., McLachlan, R., Brewster, S., and Hall, C. Name that tune: musicons as reminders in the home. In CHI '11, ACM (New York, NY, USA, 2011), 2803--2806.  ",
      "doi": "10.1145/1978942.1979357"
    },
    {
      "text": "McGookin, D., and Brewster, S. Pulse: an auditory display to provide a social vibe. In Proceedings of Interacting with Sound, workshop at MobileHCI '11, IwS '11, ACM (New York, NY, USA, 2011), 12--15.  ",
      "doi": "10.1145/2019335.2019338"
    },
    {
      "text": "Mcgookin, D., Brewster, S., and Priego, P. Audio bubbles: Employing non-speech audio to support tourist wayfinding. In HAID '09, Springer-Verlag (Berlin, Heidelberg, 2009), 41--50.  ",
      "doi": "10.1007/978-3-642-04076-4_5"
    },
    {
      "text": "Mehrabian, A., and Russell, J. A. An approach to environmental psychology. M.I.T. Press, Cambridge, MA, USA, 1974.",
      "doi": ""
    },
    {
      "text": "Raper, J., Gartner, G., Karimi, H., and Rizos, C. A critical evaluation of location based services and their potential. Journal of Location Based Services 1, 1 (2007), 5--45.  ",
      "doi": "10.1080/17489720701584069"
    },
    {
      "text": "Robinson, S., Jones, M., Williamson, J., Murray-Smith, R., Eslambolchilar, P., and Lindborg, M. Navigation your way: from spontaneous independent exploration to dynamic social journeys. Personal Ubiquitous Comput. (Sept. 2011), 1--13.  ",
      "doi": "10.1007/s00779-011-0457-2"
    },
    {
      "text": "Roe, K. Swedish Youth and Music: Listening Patterns and Motivations. Communication Research 12 (July 1985), 353--362.",
      "doi": ""
    },
    {
      "text": "Rueb, T. Trace. Yoho National Park, Canada, 1999.",
      "doi": ""
    },
    {
      "text": "Scherer, K. R., and Zentner, M. K. Emotional Effects of Music: production rules. Oxford University Press, 2001, ch. Music and Emotion: Theory and Research, 361--392.",
      "doi": ""
    },
    {
      "text": "Sikora, C. A., Roberts, L., and Murray, L. T. Musical vs. real world feedback signals. In CHI '95, ACM (New York, NY, USA, 1995), 220--221.  ",
      "doi": "10.1145/223355.223534"
    },
    {
      "text": "Stahl, C. The roaring navigator: a group guide for the zoo with shared auditory landmark display. In MobileHCI '07, ACM (New York, NY, USA, 2007), 383--386.  ",
      "doi": "10.1145/1377999.1378042"
    },
    {
      "text": "Strachan, S., Eslambolchilar, P., Murray-Smith, R., Hughes, S., and O'Modhrain, S. Gpstunes: controlling navigation via audio feedback. In MobileHCI '05, ACM (New York, NY, USA, 2005), 275--278.  ",
      "doi": "10.1145/1085777.1085831"
    },
    {
      "text": "Warren, N., Jones, M., Jones, S., and Bainbridge, D. Navigation via continuously adapted music. In CHI EA '05, ACM (New York, NY, USA, 2005), 1849--1852.  ",
      "doi": "10.1145/1056808.1057038"
    },
    {
      "text": "Wobbrock, J. O., Findlater, L., Gergle, D., and Higgins, J. J. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In CHI '11, ACM (New York, NY, USA, 2011), 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}