{
  "doi": "10.1145/2470654.2466134",
  "title": "Stories of the Smartphone in everyday discourse: conflict, tension & instability",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1051-1060",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As the smartphone proliferates in American society, so too do stories about its value and impact. In this paper we draw on advertisements and news articles to analyze cultural discourse about the smartphone. We highlight two common tropes: one calling for increased technological integration, the other urging individuals to dis-integrate the smartphone from daily life. We examine the idealized subject positions of these two stories and show how both simplistic tropes call on the same overarching values to compel individuals to take opposing actions. We then reflect on the conflicts individuals experience in trying to align and account for their actions in relation to multiple contradictory narratives. Finally, we call for CHI researchers to tell and provoke more complicated stories of technologies and their relationships with values in conversations, publications, and future designs.",
  "authors": [
    {
      "name": "Ellie Harmon",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81328488651/rel-imgonly/me_jtree.jpeg",
      "acmid": "81328488651",
      "orcid": "missing"
    },
    {
      "name": "Melissa Mazmanian",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467671821",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abbott, A. Methods of Discovery: Heuristics for the Social Sciences. W. W. Norton & Company, Feb. 2004. ",
      "doi": "10.5555/994790"
    },
    {
      "text": "Alsheikh, T., Rode, J. A., and Lindley, S. E. (Whose) value-sensitive design: a study of long-distance relationships in an Arabic cultural context. In Proc. CSCW 2011 (2011), 75--84.  ",
      "doi": "10.1145/1958824.1958836"
    },
    {
      "text": "Ames, M. G., Go, J., Kaye, J. J., and Spasojevic, M. Understanding technology choices and values through social class. In Proc. CSCW 2011 (2011), 55--64.  ",
      "doi": "10.1145/1958824.1958834"
    },
    {
      "text": "Barad, K. M. Meeting the universe halfway: quantum physics and the entanglement of matter and meaning. Duke University Press, 2007.",
      "doi": ""
    },
    {
      "text": "Bardzell, J., Bardzell, S., DiSalvo, C., Gaver, W., and Sengers, P. The humanities and/in HCI. In Ext. Abstracts CHI 2012 (2012), 1135--1138.  ",
      "doi": "10.1145/2212776.2212405"
    },
    {
      "text": "Bardzell, S. Feminist HCI: Taking stock and outlining an agenda for design. In Proc. CHI 2010 (2010), 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Bardzell, S., and Bardzell, J. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proc. CHI 2011 (2011), 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Barley, S. R., Meyerson, D. E., and Grodal, S. E-mail as source and symbol of stress. Organization Science (2010).  ",
      "doi": "10.1287/orsc.1100.0573"
    },
    {
      "text": "Beck, U., Giddens, A., and Lash, S. Reflexive Modernization: Politics, Tradition and Aesthetics in the Modern Social Order. Stanford University Press, 1994.",
      "doi": ""
    },
    {
      "text": "Bell, G., Blythe, M., and Sengers, P. Making by making strange: Defamiliarization and the design of domestic technologies. TOCHI 12, 2 (2005), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Bernstein, E. Your BlackBerry or your wife: When the whole family is staring at screens, time to try a tech detox. Wall Street Journal (Jan. 2011).",
      "doi": ""
    },
    {
      "text": "Blythe, M., and Cairns, P. Critical methods and user generated content: the iPhone on YouTube. In Proc. CHI 2009 (2009), 1467--1476.  ",
      "doi": "10.1145/1518701.1518923"
    },
    {
      "text": "Borning, A., and Muller, M. Next steps for value sensitive design. In Proc. CHI 2012 (2012).  ",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Clarke, A. Situational analysis: grounded theory after the postmodern turn. SAGE, Mar. 2005.",
      "doi": ""
    },
    {
      "text": "Cockton, G. Value-centred HCI. In Proc. NordiCHI 2004 (2004), 149--160.  ",
      "doi": "10.1145/1028014.1028038"
    },
    {
      "text": "Coontz, S. The way we never were: American families and the nostalgia trap. Basic Books, 1993.",
      "doi": ""
    },
    {
      "text": "Cooper, G., and Bowers, J. Representing the user: Notes on the disciplinary rhetoric of human-computer interaction. In The social and interactional dimensions of human-computer interfaces, P. J. Thomas, Ed. Cambridge Univ Pr, 1995, ch. 4. ",
      "doi": "10.5555/214811.214821"
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. Mapping the landscape of sustainable HCI. In Proc. CHI 2010 (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Dourish, P., and Bell, G. Divining a digital future : mess and mythology in ubiquitous computing. MIT Press, Cambridge Mass., 2011. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Dourish, P., and Mainwaring, S. D. Ubicomp's colonial impulse. Proc. UbiComp 2012 (2012).  ",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Fischer, C. S. America calling: a social history of the telephone to 1940. University of California Press, Mar. 1992. ",
      "doi": "10.5555/530627"
    },
    {
      "text": "Foucault, M. Archaeology of Knowledge, 2nd ed. Routledge, 2002 (1969).",
      "doi": ""
    },
    {
      "text": "Friedman, B. Value-sensitive design. interactions 3, 6 (1996), 17--23.  ",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Grinter, R. E., and Palen, L. Instant messaging in teen life. In Proc. CSCW 2002 (2002), 21--30.  ",
      "doi": "10.1145/587078.587082"
    },
    {
      "text": "Haraway, D. J. Modest Witness@Second Millennium. FemaleMan Meets OncoMouse: Feminism and Technoscience. Routledge, Jan. 1997. ",
      "doi": "10.5555/548196"
    },
    {
      "text": "Harding, S. G. Is science multicultural?: Postcolonialisms, feminisms, and epistemologies. Indiana Univ Pr, 1998.",
      "doi": ""
    },
    {
      "text": "Horng, E. No-e-mail fridays transform office. ABC News (April 2007).",
      "doi": ""
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K., and Grinter, R. E. Postcolonial computing: a lens on design and development. In Proc. CHI 2010 (2010), 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Kannabiran, G., Bardzell, J., and Bardzell, S. How HCI talks about sexuality: discursive strategies, blind spots, and opportunities for future research. In Proc. CHI 2011 (2011), 695--704.  ",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Kantor, J. Elite women put a new spin on an old debate. New York Times (June 2012).",
      "doi": ""
    },
    {
      "text": "Knobel, C., and Bowker, G. C. Values in design. Commun. ACM 54, 7 (July 2011), 26--28. ACM ID: 1965735.  ",
      "doi": "10.1145/1965724.1965735"
    },
    {
      "text": "Le Dantec, C. A., Poole, E. S., and Wyche, S. P. Values as lived experience: evolving value sensitive design in support of value discovery. In Proc. CHI 2009 (2009), 1141--1150.  ",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Leshed, G. Slowing down with personal productivity tools. interactions 19, 1 (Jan. 2012), 58--63.  ",
      "doi": "10.1145/2065327.2065339"
    },
    {
      "text": "Leshed, G., and Sengers, P. \"I lie to myself that I have freedom in my own schedule\": productivity tools and experiences of busyness. In Proc. CHI 2011 (2011), 905--914.  ",
      "doi": "10.1145/1978942.1979077"
    },
    {
      "text": "Marcus, G. E. Ethnography in/of the world system: the emergence of multi-sited ethnography. Annual review of anthropology 24, 1 (1995), 95--117.",
      "doi": ""
    },
    {
      "text": "Mark, G., Gudith, D., and Klocke, U. The cost of interrupted work: More speed and stress. In Proc. CHI 2008 (2008).  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Mark, G. J., Voida, S., and Cardello, A. \"A pace not dictated by electrons\": An empirical study of work without email. In Proc. CHI 2012 (2012).  ",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Mazmanian, M. Avoiding the trap of constant connectivity: When congruent frames allow for heterogeneous practices. Academy of Management Journal (Forthcoming).",
      "doi": ""
    },
    {
      "text": "Mazmanian, M., Orlikowski, W. J., and Yates, J. The autonomy paradox: The implications of wireless email devices for knowledge professionals. Organization Science (Forthcoming).",
      "doi": ""
    },
    {
      "text": "McIntyre, S. Blackberry addiction 'similar to drugs'. Daily Mail (August 2006).",
      "doi": ""
    },
    {
      "text": "Meece, M. Who's the boss, you or your gadget? The New York Times (Feb. 2011).",
      "doi": ""
    },
    {
      "text": "O'Brien, J., Rodden, T., Rouncefield, M., and Hughes, J. At home with the technology: an ethnographic study of a set-top-box trial. TOCHI 6, 3 (Sep 1999), 282--308.  ",
      "doi": "10.1145/329693.329698"
    },
    {
      "text": "Parker-Pope, T. An ugly toll of technology: Impatience and forgetfulness. The New York Times (June 2010).",
      "doi": ""
    },
    {
      "text": "Pentland, B. T., and Feldman, M. S. Narrative networks: Patterns of technology and organization. Organization Science 18, 5 (Sept. 2007), 781--795.  ",
      "doi": "10.1287/orsc.1070.0283"
    },
    {
      "text": "Richtel, M. Your brain on computers: Attached to technology and paying a price. The New York Times (June 2010).",
      "doi": ""
    },
    {
      "text": "Richtel, M. Silicon Valley says step away from the device. New York Times (July 2012).",
      "doi": ""
    },
    {
      "text": "Rose, G. Visual Methodologies: An Introduction to the Interpretation of Visual Materials, 2nd ed. Sage, 2006. ",
      "doi": "10.5555/1202842"
    },
    {
      "text": "Salemi, V. Is your child a BlackBerry orphan? balancing work and family: Workaholics R'Us. SheKnows: Parenting (2010).",
      "doi": ""
    },
    {
      "text": "Scelfo, J. Your brain on computers: The risks of parenting while plugged in. The New York Times (June 2010).",
      "doi": ""
    },
    {
      "text": "Sengers, P. What I learned on change islands. interactions 18, 2 (Mar. 2011), 40.  ",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "Slaughter, A.-M. Why women still can't have it all. The Atlantic July/August (2012).",
      "doi": ""
    },
    {
      "text": "Smith, A. Smartphone adoption and usage. Pew Research Center's Internet & American Life Project (July 2011).",
      "doi": ""
    },
    {
      "text": "Smith, A. Nearly half of american adults are smartphone owners. Pew Research Center's Internet & American Life Project (Mar. 2012).",
      "doi": ""
    },
    {
      "text": "Spigel, L. Designing the smart house: Posthuman domesticity and conspicuous production. European Journal of Cultural Studies 8, 4 (Nov. 2005), 403--426.",
      "doi": ""
    },
    {
      "text": "Spigel, L. Object lessons for the media home: From storagewall to invisible design. Public Culture 24, 3 68 (2012), 535--576.",
      "doi": ""
    },
    {
      "text": "Sprague, J. Feminist methodologies for critical researchers: Bridging differences. Altamira Press, 2005.",
      "doi": ""
    },
    {
      "text": "Stewart, K. Ordinary Affects. Duke University Press, 2007.",
      "doi": ""
    },
    {
      "text": "Strengers, Y. A. Designing eco-feedback systems for everyday life. In Proc. CHI 2011 (2011), 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Su, N. M. Street Fighter IV: braggadocio off and on-line. In Proc. CSCW 2010 (2010), 361--370.  ",
      "doi": "10.1145/1718918.1718981"
    },
    {
      "text": "Taggar, H. No email. blog.harjtaggar.com/time (August 2012).",
      "doi": ""
    },
    {
      "text": "Turkle, S. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books, 2011. ",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Venkatesh, A. Computers and other interactive technologies for the home. Commun. ACM 39, 12 (Dec. 1996), 47--54.  ",
      "doi": "10.1145/240483.240491"
    },
    {
      "text": "Wajcman, J. Life in the fast lane? towards a sociology of technology and time. The British Journal of Sociology 59, 1 (Mar. 2008), 59--77.",
      "doi": ""
    },
    {
      "text": "Woolgar, S. Configuring the user: the case of usability trials. In A Sociology of monsters: essays on power, technology and domination, J. Law, Ed. Routledge, 1991, 57--99.",
      "doi": ""
    }
  ]
}