{
  "doi": "10.1145/2470654.2466215",
  "title": "Authoring personal histories: exploring the timeline as a framework for meaning making",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1619-1628",
  "year": 2013,
  "badges": [],
  "abstract": "It has been argued that technologies for 'memory' should be designed to support creativity and meaning building, rather than the passive capture of cues for remembering [25]. We report findings from a study inspired by this insight, in which older people made personal digital timelines using a new tool called Project Greenwich. We explore how the constraints of the timeline metaphor offer a framework for authoring, and examine how timelines can be used to underpin meaning building in relation to personal content. We highlight the importance of making, this being a vehicle for connecting with others in the present, and a potential means of emphasizing those elements of the past felt to be most salient when looking back.",
  "authors": [
    {
      "name": "Elizabeth Thiry",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481651806",
      "orcid": "missing"
    },
    {
      "name": "Siân Lindley",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100028041",
      "orcid": "missing"
    },
    {
      "name": "Richard Banks",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100462110",
      "orcid": "missing"
    },
    {
      "name": "Tim Regan",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100150736",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apted, T., Kay, J. and Quigley, A. Tabletop sharing of digital photographs for the elderly. In Proc. CHI 2006, ACM Press, 781--790.  ",
      "doi": "10.1145/1124772.1124887"
    },
    {
      "text": "André, P., Wilson, M. L., Russell, A., Smith, D. A., Owens, A. and schraefel, m. c. Continuum: Designing timelines for hierarchies, relationships and scale. In Proc. UIST 2007, ACM Press, 101--110.  ",
      "doi": "10.1145/1294211.1294229"
    },
    {
      "text": "Boden, M. A. The Creative Mind, 2nd Ed. Routledge, Oxon, 2004.",
      "doi": ""
    },
    {
      "text": "British History Timeline. BBC. http://www.bbc.co.uk/history/interactive/timelines/british/index_embed.shtml. Accessed 14/09/12.",
      "doi": ""
    },
    {
      "text": "Carr, D. Time, Narrative and History. Indiana University Press, Bloomington, 1986.",
      "doi": ""
    },
    {
      "text": "Chittaro, L. and Combi, C. Representation of temporal intervals and relations: Information visualization aspects and their evaluation. In Proc. TIME 2001, IEEE, 13--20. ",
      "doi": "10.5555/882500.884662"
    },
    {
      "text": "Christel, M. G. Windowing time in digital libraries. In Proc. JCDL 2006, ACM Press, 190--191.  ",
      "doi": "10.1145/1141753.1141793"
    },
    {
      "text": "Chronology: Key events in the life of the British queen. Monsters & Critics. http://news.monstersandcritics.com/uk/news/article_1689242.php/CHRONOLOGY-Key-events-in-the-life-of-the-British-queen. Accessed 14/09/12.",
      "doi": ""
    },
    {
      "text": "Cosley, D., Sosik, V. S., Schultz, J., Peesapati, S. T. and Lee, S. Experiences with designing tools for everyday reminiscing. Human-Computer Interaction 27, 1-2 (2012), 175--198.",
      "doi": ""
    },
    {
      "text": "Crete-Nishihata, M. et al. Reconstructing the past: Personal memory technologies are not just personal and not just for memory. Human-Computer Interaction 27, 1-2 (2012), 92--123.",
      "doi": ""
    },
    {
      "text": "Damianakis, T., Crete-Nishihata, M., Smith, K. L., Baecker, R. M. and Marziali, E. The psychosocial impacts of multimedia biographies on persons with cognitive impairments. The Gerontologist 50, (2009), 23--35.",
      "doi": ""
    },
    {
      "text": "Ellis, J. B. and Bruckman, A. S. Designing Palaver Tree Online: Supporting social roles in a community of oral history. In Proc. CHI 2001, ACM Press, 474--481.  ",
      "doi": "10.1145/365024.365317"
    },
    {
      "text": "Facebook Timelines. https://www.facebook.com/about/timeline",
      "doi": ""
    },
    {
      "text": "Genes Reunited. http://www.genesreunited.co.uk/",
      "doi": ""
    },
    {
      "text": "Hammond, C. Time Warped. Canongate Books, Edinburgh, 2012.",
      "doi": ""
    },
    {
      "text": "Hodges, S. et al. SenseCam: A retrospective memory aid. In Proc. UbiComp 2006, Springer-Verlag, 177--193.  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "Hoven, E., van den and Eggen, B. The effect of cue media on recollections. Human Technology 5, (2009), 47--67.",
      "doi": ""
    },
    {
      "text": "Lindley, S. E. Before I forget: From personal memory to family history. Human-Computer Interaction 27, 1-2 (2012), 13--36.",
      "doi": ""
    },
    {
      "text": "Major events and milestones during the Queen's reign. The Telegraph. http://www.telegraph.co.uk/news/uknews/the_queens_diamond_jubilee/9063142/Major-events-and-milestones-during-the-Queens-reign.html Accessed 14/09/12.",
      "doi": ""
    },
    {
      "text": "McCullough, M. Abstracting Craft: The Practiced Digital Hand. MIT Press, Cambridge MA, 1996. ",
      "doi": "10.5555/524384"
    },
    {
      "text": "MyHeritage. http://www.myheritage.com/",
      "doi": ""
    },
    {
      "text": "Odom, W., Banks, R., Kirk, D., Harper, R., Lindley, S. and Sellen, A. Technology heirlooms? Considerations for passing down and inheriting digital materials. In Proc. CHI 2012, ACM Press, 337--346.  ",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "Odom, W., Harper, R., Sellen, A., Kirk, D. and Banks, R. Passing on and putting to rest: Understanding bereavement in the context of interactive technologies. In Proc. CHI 2010, ACM Press, 1831--1840.  ",
      "doi": "10.1145/1753326.1753601"
    },
    {
      "text": "Oleksik, G., Frohlich, D., Brown, L. M. and Sellen, A. Sonic interventions: Understanding and extending the domestic soundscape. In Proc. CHI 2008, ACM Press, 1419--1428.  ",
      "doi": "10.1145/1357054.1357277"
    },
    {
      "text": "Petrelli, D., Hoven, E., van den and Whittaker, S. Making history: Intentional capture of future memories. In Proc. CHI 2009, ACM Press, 1723--1732.  ",
      "doi": "10.1145/1518701.1518966"
    },
    {
      "text": "Pillemer, D. B. Momentous Events, Vivid Memories. Harvard University Press, London, 1998.",
      "doi": ""
    },
    {
      "text": "Plaisant, C., Milash, B., Rose, A., Widoff, S. and Shneiderman, B. LifeLines: Visualizing personal histories. In Proc. CHI 1996, ACM Press, 221--2  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Project Greenwich. http://projectgreenwich.research.microsoft.com/",
      "doi": ""
    },
    {
      "text": "Ricoeur, P. Memory, History, Forgetting. University of Chicago Press, Chicago, 2004.",
      "doi": ""
    },
    {
      "text": "Ringel, M., Cutrell, E., Dumais, S. and Horvitz, E. Milestones in time: The value of landmarks in retrieving information from personal stores. In Proc. Interact 2003, IFIP, 184--191.",
      "doi": ""
    },
    {
      "text": "Rosenbluth, V. Keeping Family Stories Alive, 2nd Ed. Hartley & Marks, Vancouver, 1997.",
      "doi": ""
    },
    {
      "text": "Rosner, D. K. and Ryokai, K. Spyn: Augmenting the creative and communicative potential of craft. In Proc. CHI 2010, ACM Press, 2407--2416.  ",
      "doi": "10.1145/1753326.1753691"
    },
    {
      "text": "Sandhaus, P., Baumgartner, H., Meyer, J. and Boll, S. That was my life. Presented at the CHI 2010 Workshop on HCI at the End of Life.",
      "doi": ""
    },
    {
      "text": "Santana, P. C., Rodríguez, V. M., Castro, L. A. and Andrade, Á. Supporting emotional ties among Mexican elders and their families living abroad. CHI 2005 Ext. Abstracts, ACM Press, 2099--2013.  ",
      "doi": "10.1145/1056808.1057107"
    },
    {
      "text": "Sellen, A. and Whittaker, S. Beyond total capture: A constructive critique of lifelogging. Communications of the ACM, 53, (2010), 70--77.  ",
      "doi": "10.1145/1735223.1735243"
    },
    {
      "text": "Spence, L. Legacy: A Step-By-Step Guide to Writing Personal History. Swallow Press / Ohio University Press, Athens, 1997.",
      "doi": ""
    },
    {
      "text": "Stab, C., Nazemi, K. and Fellner, D. W. SemaTime - Timeline visualization of time-dependent relations and semantics. In Proc. ISVC 2010, Part III, LNCS 6445, Springer-Verlag, 514--523. ",
      "doi": "10.5555/1940092.1940146"
    },
    {
      "text": "TimeGlider. http://timeglider.com/",
      "doi": ""
    },
    {
      "text": "TimeRime. http://timerime.com/",
      "doi": ""
    },
    {
      "text": "Webster, J. D. Construction and validation of the Reminiscence Functions Scale. Journal of Gerontology 48, 5 (1993), 256--262.",
      "doi": ""
    },
    {
      "text": "West, D., Quigley, A. and Kay, J. MEMENTO: A digital-physical scrapbook for memory sharing. Personal and Ubiquitous Computing 11, 4 (April 2007), 313--328.  ",
      "doi": "10.1007/s00779-006-0090-7"
    },
    {
      "text": "Whittaker, S., Bergman, O. and Clough, P. Easy on that trigger dad: A study of long term family photo retrieval. Personal and Ubiquitous Computing 14, (2010), 31--43.  ",
      "doi": "10.1007/s00779-009-0218-7"
    },
    {
      "text": "Zerubavel, E. Time Maps. University of Chicago Press, Chicago, 2003.",
      "doi": ""
    }
  ]
}