{
  "doi": "10.1145/2470654.2481390",
  "title": "Some evidence for the impact of limited education on hierarchical user interface navigation",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2813-2822",
  "year": 2013,
  "badges": [],
  "abstract": "One of the greatest challenges in designing applications for economically poor communities is that potential users may have little or no education. We investigated how limited education appears to impact the ability to navigate a hierarchical UI, even when it has no text. We scored 60 participants from low-income communities in India using tests of textual literacy and Raven's Progressive Matrices. These were used as proxies for educational level and a subset of cognitive abilities. We then evaluated participants' performance on a UI task involving hierarchical navigation. First, our results confirm that textual literacy is correlated with scores on the Raven's test. In addition, we found that performance on both instruments are predictive of performance in navigating UI hierarchies, even when the UI is text-free. This provides statistically significant confirmation of previous anecdotal hypotheses. We conclude with design recommendations for UI hierarchies for people with limited education.",
  "tags": [
    "abstract reasoning",
    "hierarchy navigation",
    "limited education"
  ],
  "authors": [
    {
      "name": "Indrani Medhi",
      "institution": "Indian Institute of Technology, Bombay, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329490627",
      "orcid": "missing"
    },
    {
      "name": "Meera Lakshmanan",
      "institution": "Independent, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435597565",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research Bangalore, Bangalore, India",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    }
  ],
  "references": [
    {
      "text": "Abadzi, H. (2003). Improving adult literacy outcomes: Lessons from cognitive research for developing countries. Washington, DC: World Bank.",
      "doi": ""
    },
    {
      "text": "Adult Literacy Supplemental Assessment (ALSA). (n.d.). Retrieved from http://nces.ed.gov/naal/alsa.asp",
      "doi": ""
    },
    {
      "text": "Akinnaso, N. (1981). The consequences of literacy in pragmatic and theoretical perspectives. Anthropology & Education Quarterly, 12(3), 163--200.",
      "doi": ""
    },
    {
      "text": "Ardila, A., Rosselli, M., & Rosas, P. (1989).Neuropsychological assessment in non-literates: Visuospatial and memory abilities. Brain Cognition, 11(2), 147--166.",
      "doi": ""
    },
    {
      "text": "Bandura, A. (2005). Self-efficacy. In V. S. Ramachaudran (Ed.), Encyclopedia of human behavior (pp. 71--81). New York: Academic Press",
      "doi": ""
    },
    {
      "text": "Bernardo, A. (2000). Literacy and the mind: The contexts and cognitive consequence of literacy practice. Luzac Oriental.",
      "doi": ""
    },
    {
      "text": "Boyera, S. (2007). The mobile web to bridge the digital divide? Paper presented at the IST-Africa Conference 2007, Maputo, Mozambique.",
      "doi": ""
    },
    {
      "text": "Brouwers, S. A., Van de Vijver, F. J. R., & Van Hemert, D. A. (2009). Variation in Raven's Progressive Matrices scores across time and place. Learning and Individual Differences, 19, 330--338.",
      "doi": ""
    },
    {
      "text": "Castro-Caldas, A. (2004). Targeting regions of interest for the study of the non-literate brain. International Journal of Psychology, 39, 5--17.",
      "doi": ""
    },
    {
      "text": "Chipchase, J. (2005). Understanding non-literacy as a barrier to mobile phone communication. Retrieved from http://research.nokia.com/bluesky/non-literacy-0012005/index.html",
      "doi": ""
    },
    {
      "text": "Comprehensive Adult Student Assessment Systems (CASAS). (n.d.). Retrieved from https://www.casas.org/home/index.cfm?fuseaction_home.sho wContent&MapID_198",
      "doi": ""
    },
    {
      "text": "Czaja, S. J., Charness, N., Fisk, A. D., Hertzog, C., Nair, S. N., & Rogers, W. A. (2006). Factors predicting the use of technology: Findings from the Center for Research and Education on Aging and Technology Enhancement (CREATE). Psychology and Aging, 21, 333--353.",
      "doi": "10.1037/0882-"
    },
    {
      "text": "Duncker, K. (1945). On problem solving. Psychological Monographs, 58:5 (Whole No. 270)",
      "doi": ""
    },
    {
      "text": "Egopont http://web.archive.org/web/20110625092320/http://egopont.co m/iq/testpage.php",
      "doi": ""
    },
    {
      "text": "Eshet-Alkalai, Y. (2004). Digital literacy: A conceptual framework for survival skills in the digital era. Journal of Educational Multimedia and Hypermedia, 13(1), 93--106.",
      "doi": ""
    },
    {
      "text": "Fluency Addition to NAAL (FAN). (n.d.). Retrieved from http://nces.ed.gov/naal/fluency.asp",
      "doi": ""
    },
    {
      "text": "Gandhi, R., Veeraraghavan, R., Toyama, K., & Ramprasad, V. (2009). Digital green: Participatory video for agricultural extension. Information Technologies & International Development, 5(1), 1--15.",
      "doi": ""
    },
    {
      "text": "Government of Karnataka, India, Karnataka State Board, Published 2008.",
      "doi": ""
    },
    {
      "text": "Gorham, D. R. (1956). A proverbs test for clinical and experimental use. Psychology Reports. 2, 1--12",
      "doi": ""
    },
    {
      "text": "Goodenough, F. (1926). Measurement of intelligence by drawings. New York: World Book Co.",
      "doi": ""
    },
    {
      "text": "Grisedale, S., Graves, M., & Grünsteidl, A. (1997). Designing a graphical user interface for healthcare workers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 471--478). Atlanta, GA: ACM.  ",
      "doi": "10.1145/258549.258869"
    },
    {
      "text": "Irwing, P. and Lynn, R. (2005), Sex differences in means and variability on the progressive matrices in university students: A meta-analysis. British Journal of Psychology, 96: 505--524.",
      "doi": ""
    },
    {
      "text": "Huenerfauth, M. (2002). Developing design recommendations for computer interfaces accessible to non-literate users. (Master's thesis, University College Dublin).",
      "doi": ""
    },
    {
      "text": "Jones, M. and Marsden, G. (2005) \"Mobile Interaction Design\" John Wiley & Sons. ",
      "doi": "10.5555/1204709"
    },
    {
      "text": "Jones, M., Buchanan, G., Thimbleby, H., & Marsden, G. (2000). User interfaces for mobile web devices. {www9 mobile workshop position paper}. Proceedings of the 9th International World Wide Web Conference. Amsterdam.",
      "doi": ""
    },
    {
      "text": "Katre, D. S. (2006). Unorganized cognitive structures of nonliterate as the key factor in rural e-learning design. IManager's Journal of Education Technology, 2(4), 67--72.",
      "doi": ""
    },
    {
      "text": "Kress, G., & Van Leeuwen, T. (1996). Reading images: The grammar of visual design. London: Routledge.",
      "doi": ""
    },
    {
      "text": "Kurvers, J. (2002). Met ongeletterde ogen. Kennis van taal en schrift van analfabeten. {With nonliterate eyes. Knowledge of language and writing of non-literates}. (Thesis, Tilburg University).",
      "doi": ""
    },
    {
      "text": "Ladeira, I. & Cutrell, E. (2010). Teaching with storytelling: An investigation of narrative videos for skills training. Proceedings of ICTD 2010, the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development, (London), IEEE.  ",
      "doi": "10.1145/2369220.2369240"
    },
    {
      "text": "Lowell, W. E. \"An Empirical Study of a Model of Abstract Learning,\" Science Education, 61:229--42 (1977).",
      "doi": ""
    },
    {
      "text": "Luria, A. R. (1974). Cognitive development: Its cultural and social foundations. Cambridge, MA: Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Manly, J. J., Touradji, P., Tang, M. X., & Stern, Y. (2003). Literacy and memory decline among ethnically diverse elders. Journal of Clinical and Experimental Neuropsychology, 25, 680--690.",
      "doi": ""
    },
    {
      "text": "Matute, E., Leal, F., Zarabozo, D., Robles, A., & Cedillo, C. (2000). Does literacy have an effect on stick construction tasks? Journal of the International Neuropsychological Society, 6, 668--672.",
      "doi": ""
    },
    {
      "text": "Medhi, I., & Toyama, K. (2007). Full-context videos for firsttime, non-literate PC users. IEEE/ACM International Conference on Information and Communication Technologies and Development, Bangalore, India.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Cutrell, E., & Toyama, K. (2010, March 20--24). It's not just illiteracy. India HCI / Interaction Design & International Development, Mumbai. ",
      "doi": "10.5555/2227347.2227348"
    },
    {
      "text": "Medhi, I., Menon, S.R., Cutrell, E. & Toyama, K. Correlation between Limited Education and Transfer of Learning, in Information Technologies and International Development, vol. 8, pp. 51--65, June 2012",
      "doi": ""
    },
    {
      "text": "Medhi, I., Patnaik, S., Brunskill, Gautama, S.N.N., Thies, W. and Toyama, K. Designing Mobile Interfaces for Novice and Low-Literacy Users, in ACM ToCHI, vol. 18, no. 1, ACM Transactions on Computer-Human Interaction, April 2011  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Medhi, I., Sagar, A., & Toyama, K. (2007). Text-free user interfaces for illiterate and semiliterate users. Information Technologies & International Development, 4(1), 37--50.  ",
      "doi": "10.1162/itid.2007.4.1.37"
    },
    {
      "text": "Mednick, S.A. (1962). The associative basis of the creative process. Psychological Review, 69, 220--232.",
      "doi": ""
    },
    {
      "text": "Morais, J., Cary, L., Alegria, J., & Bertelson, P. (1979). Does awareness of speech as a sequence of phones arise spontaneously? Cognition, 7, 323--331.",
      "doi": ""
    },
    {
      "text": "National Adult Literacy Database (NALD). (n.d.). Literacy and basic skills assessment tool from the National Adult Literacy Database Canada. Retrieved from http://www.nald.ca/library/learning/learncha/learncha.pdf",
      "doi": ""
    },
    {
      "text": "National Assessment of Adult Literacy (NAAL). (n.d.). Retrieved from http://nces.ed.gov/naal/index.asp",
      "doi": ""
    },
    {
      "text": "National Literacy Mission (NLM). (n.d.). Retrieved from http://www.nlm.nic.in/unesco_nlm.htm",
      "doi": ""
    },
    {
      "text": "National Sample Survey Organization (NSSO). (n.d.). Retrieved from http://www.literacy.org/products/ili/pdf/LAPIndiaApp_all.pdf",
      "doi": ""
    },
    {
      "text": "Nov, Oded & Arazy, Ofer. (2013). Personality-targeted design: Theory, experimental procedure, and preliminary results. Proceedings of Computer Supported Collaborative Work 2013.  ",
      "doi": "10.1145/2441776.2441887"
    },
    {
      "text": "Parikh, T., Ghosh, K., & Chavan, A. (2003a, April 5--10). Design considerations for a financial management system for rural, semi-literate users. ACM Conference on ComputerHuman Interaction, Fort Lauderdale, Florida, USA (pp. 824--825).  ",
      "doi": "10.1145/765891.766014"
    },
    {
      "text": "Plauche, M., & Prabaker, M. (2006). Tamil market: A spoken dialog system for rural India. Working papers in ACM Conference on Computer Human Interaction, Montreal.  ",
      "doi": "10.1145/1125451.1125746"
    },
    {
      "text": "Raven, J. C. (1936). Mental tests used in genetic studies: The performance of related individuals on tests mainly educative and mainly reproductive. MSc Thesis, University of London.",
      "doi": ""
    },
    {
      "text": "Raven, J. (1981). Manual for Raven's Progressive Matrices and Vocabulary Scales. Research Supplement No.1: The 1979 British Standardisation of the Standard Progressive Matrices and Mill Hill Vocabulary Scales, Together With Comparative Data From Earlier Studies in the UK, US, Canada, Germany and Ireland. San Antonio, TX: Harcourt Assessment",
      "doi": ""
    },
    {
      "text": "Reis, A., & Castro-Caldas, A. (1997). Illiteracy: A bias for cognitive development. Journal of International Neuropsychological Society, 3, 444--450.",
      "doi": ""
    },
    {
      "text": "Reis, A., Petersson, K. M., Castro-Caldas, A., & Ingvar, M. (2001). Formal schooling influences two- but not threedimensional naming skills. Brain and Cognition, 47(3), 397-- 411.",
      "doi": ""
    },
    {
      "text": "Rushton, J. P., Skuy, M., & Bons, T. A. (2004). Construct validity of Raven's Advanced Progressive Matrices for African and non-African engineering students in South Africa. International Journal of Selection and Assessment, 12, 220--229.",
      "doi": ""
    },
    {
      "text": "Sarva Shiksha Abhiyan http://ssa.nic.in/",
      "doi": ""
    },
    {
      "text": "Sherwani, J., Ali, N., Mirza, S., Fatma, A., Memon, Y., Karim, M., et al. (2007, December 15--16). HealthLine: Speech-based access to health information by low-literate users. IEEE/ACM International Conference on Information and Communication Technologies and Development, Bangalore, India.",
      "doi": ""
    },
    {
      "text": "Study Guide Zone. (n.d.). Test of Adult Basic Education (TABE). Retrieved from http://www. studyguidezone.com/tabetest.htm",
      "doi": ""
    },
    {
      "text": "UN News Centre. (2011, September 8). Literacy vital for beating poverty and disease and reinforcing stability. Retrieved from http://www.un.org/apps/news/story.asp?NewsID_39485&Cr_l iteracy&Cr1_",
      "doi": ""
    },
    {
      "text": "Van Linden, S., & Cremers, A. H. M. (2008, July 9--11). Cognitive abilities of functionally non-literate persons relevant to ICT use. International Conference on Computers Helping People with Special Needs. Linz, Austria (pp. 705--712).  ",
      "doi": "10.1007/978-3-540-70540-6_103"
    },
    {
      "text": "Walton, M., Marsden, G., & Vukovic, V. (2002, April 20--25). Visual literacy as challenge to the internationalization of interfaces: A study of South African student web users. CHI '02 extended abstracts on human factors in computing systems, Minneapolis, MN (pp. 530--531).  ",
      "doi": "10.1145/506443.506465"
    }
  ]
}