{
  "doi": "10.1145/2470654.2470713",
  "title": "Large-scale participation: a case study of a participatory approach to developing a new public library",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "399-408",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper, we present a case study of a participatory project that focuses on interaction in large-scale design, namely, the development of the new Urban Mediaspace Aarhus. This project, which has been under way for ten years, embodies a series of issues that arise when participatory design approaches are applied to large-scale, IT-oriented projects. At the same time, it highlights the issues public knowledge institutions face, when interactive technologies challenge their fundamental roles and practices; by extension, this case offers examples of how these challenges may be explored and addressed through IT-based participatory initiatives. We present a range of such activities carried out during the past ten years, and present the main lessons from the project, based on interviews with three key stakeholders. These lessons focus on how to make participation work in practice, how to align different paradigms of inquiry and practice in a project of this scale, and how to capture and anchor the insights from participatory events to inform the ongoing design process.",
  "tags": [
    "citizen involvement",
    "design methods",
    "large-scale projects",
    "interaction design",
    "participatory design"
  ],
  "authors": [
    {
      "name": "Peter Dalsgaard",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81100468838/rel-imgonly/peter.jpeg",
      "acmid": "81100468838",
      "orcid": "missing"
    },
    {
      "name": "Eva Eriksson",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/do/10.1145/contrib-81324489214/rel-imgonly/eva_2013.jpg",
      "acmid": "81324489214",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. The Nature of Order, Book three, A vision of the living world. California, USA. (2005).",
      "doi": ""
    },
    {
      "text": "Buchhave B. Transformationer. Aarhus Kommunes Biblioteker, (2006).",
      "doi": ""
    },
    {
      "text": "Casey, M. E. & Savastinuk, L. C. Service for the next generation library, Library Journal, 9(1). (2006).",
      "doi": ""
    },
    {
      "text": "Clemet, A. & van den Besselaar, P. A retrospective look at participatory design projects. Communications of the ACM, 36(4), 29--37 (1993).  ",
      "doi": "10.1145/153571.163264"
    },
    {
      "text": "Dalsgaard P. Challenges of participation in large-scale projects. In Proc. PDC'10. Sydney, Australia (2010).  ",
      "doi": "10.1145/1900441.1900445"
    },
    {
      "text": "Eriksson E. U.F.O.scope! - Families Playing Together at the Public Library. In Proc. DIS'10, ACM Press (2010).  ",
      "doi": "10.1145/1858171.1858233"
    },
    {
      "text": "Eriksson E., Lykke-Olesen, A. StorySurfer: a playful book browsing installation for children's libraries. Proc. IDC'07. ACM Press (2007), 57--64.  ",
      "doi": "10.1145/1297277.1297289"
    },
    {
      "text": "Eriksson E., Krogh, P., Lykke-Olesen A. Inquiry into Libraries - A Design Approach to Children's Interactive Library. Proc. NORDES'07. (2007)",
      "doi": ""
    },
    {
      "text": "Fierro, A. The Glass State, MIT Press (2003).",
      "doi": ""
    },
    {
      "text": "Flyvbjerg, B. Five misunderstandings about case-study research. Qualitative Inquiry, 12(2), (2006) 219--245.",
      "doi": ""
    },
    {
      "text": "Iversen, O., Kanstrup, A. M. and Petersen, M. G. A visit to the \"new Utopia\": revitalizing democracy, emancipation and quality in co-operative design. Proc. NordiCHI 2004, ACM Press (2004), 171--179.  ",
      "doi": "10.1145/1028014.1028040"
    },
    {
      "text": "Kensing, F. The Trade Unions Influence on Technological Change, in U. Briefs et al. (Eds.): Systems Design For, With and By the Users. (1983).",
      "doi": ""
    },
    {
      "text": "Krogh, P. G., Ludvigsen, M., Lykke-Olesen, A. Help Me Pull That Cursor. A Collaborative Interactive Floor Enhancing Community Interaction. In Australasian J. of Inf. Systems 11(2), (2004).",
      "doi": ""
    },
    {
      "text": "Kuhn, T. S. The structure of scientific revolutions, University of Chicago Press, Chicago. (1962).",
      "doi": ""
    },
    {
      "text": "Lykke-Olesen, A. & Nielsen, J. BibPhone: adding sound to the children's library. Proc. IDC'07. ACM Press, (2007).  ",
      "doi": "10.1145/1297277.1297307"
    },
    {
      "text": "McCrady, E. Bibliothèque Nationale: A Building Hostile to Preservation and Access. In Abbey Newsletter, 22(4), Abbey Publications (1998).",
      "doi": ""
    },
    {
      "text": "Oostveen, A. & van den Besselaar, P. From small scale to large scale user participation: a case study of participatory design in e-government systems. Proc. PDC'04. ACM Press, 173--182. (2004).  ",
      "doi": "10.1145/1011870.1011891"
    },
    {
      "text": "Rittel, H. W. J. & Webber, M. M. Dilemmas in a general theory of planning. Policy Sciences, 4(2). (1973).",
      "doi": ""
    },
    {
      "text": "Sanders, L. Exploring co-creation on a large scale. In Designing for, with and from User Experience, StudioLab Press (2010).",
      "doi": ""
    },
    {
      "text": "Simonsen, J. & Hertzum, M. Participative Design and the Challenges of Large-Scale systems: Extending the Iterative PD Approach. Proc. PDC'08. ACM Press (2008). ",
      "doi": "10.5555/1795234.1795236"
    },
    {
      "text": "Shapiro, D. Participatory design: the will to succeed. Proc. CC '05, ACM Press (2005), 29--38.  ",
      "doi": "10.1145/1094562.1094567"
    },
    {
      "text": "The Aarhus public libraries. The library's voice - a guide to user driven innovation, Aarhus (2008).",
      "doi": ""
    },
    {
      "text": "The Aarhus public libraries. Unleash the users - everyone is entitled to a cool library! Aarhus (2009).",
      "doi": ""
    },
    {
      "text": "The Aarhus municipality. Web: http://www.urbanmediaspace.dk/en.",
      "doi": ""
    },
    {
      "text": "The Aarhus public libraries. Transformation Lab - A Report on Forms of Dissemination in the Physical Space. Aarhus, Denmark. (2007).",
      "doi": ""
    }
  ]
}