{
  "doi": "10.1145/2470654.2470709",
  "title": "Designing and theorizing co-located interactions",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "381-390",
  "year": 2013,
  "badges": [],
  "abstract": "This paper gives an interwoven account of the theoretical and practical work we undertook in pursuit of designing co-located interactions. We show how we sensitized ourselves to theory from diverse intellectual disciplines, to develop an analytical lens to better think about co-located interactions. By critiquing current systems and their conceptual foundations, and further interrelating theories particularly in regard to performative aspects of identity and communication, we develop a more nuanced way of thinking about co-located interactions. Drawing on our sensitivities, we show how we generated and are exploring, through the process of design, a set of co-located interactions that are situated within our social ecologies, and contend that our upfront theoretical work enabled us to identify and explore this space in the first place. This highlights the importance of problem framing, especially for projects adopting design methodologies.",
  "authors": [
    {
      "name": "Thomas Reitmaier",
      "institution": "University of Cape Town, Cape Town, South Africa",
      "img": "/do/10.1145/contrib-81442618424/rel-imgonly/thomasreitmaier.jpg",
      "acmid": "81442618424",
      "orcid": "0000-0003-2078-6699"
    },
    {
      "name": "Pierre Benz",
      "institution": "University of Cape Town, Cape Town, South Africa",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558110456",
      "orcid": "missing"
    },
    {
      "name": "Gary Marsden",
      "institution": "University of Cape Town, Cape Town, South Africa",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452608565",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ballendat, T., Marquardt, N., & Greenberg, S. Proxemic Interaction. ACM Intl. Conf. on Interactive Tabletops and Surfaces - ITS'10, ACM (2010), 121--130.  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "boyd, d. Why Youth (Heart) Social Networking Sites. In D. Buckingham, ed., Youth, Identity, and Digital Media. MIT Press, Cambridge, MA, 2008, 119--142.",
      "doi": ""
    },
    {
      "text": "Buckingham, D. Introducing Identity. In D. Buckingham, ed., Youth, Identity, and Digital Media. MIT Press, Cambridge, MA, 2008, 1--22.",
      "doi": ""
    },
    {
      "text": "Chalfen, R. Snapshot: Versions of Life. University of Wisconsin Press, Madison, WI, 1987.",
      "doi": ""
    },
    {
      "text": "Clawson, J., Voida, A., Patel, N., et al. Mobiphos: A Collocated-Synchronous Mobile Photo Sharing Application. MobileHCI '08, ACM (2008), 187--195.  ",
      "doi": "10.1145/1409240.1409261"
    },
    {
      "text": "de Certeau, M. The Practice of Everyday Life. University of California Press, Berkeley, CA, 1984.",
      "doi": ""
    },
    {
      "text": "Dourish, P. What we talk about when we talk about context. Pers. and Ubi. Computing 8, 1 (2004), 19--30.",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Gaver, W. What should we expect from research through design? CHI '12, ACM (2012), 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Goffman, E. Asylums. Anchor Books, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Anchor Books, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Marquardt, N., Ballendat, T., DiazMarino, R., Wang, M. Proxemic Interactions interactions 18, 1 (2011), 42--50.  ",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Hall, E.T. The Hidden Dimension. Anchor Books, New York, 1966.",
      "doi": ""
    },
    {
      "text": "Harper, R. Texture: Human Expression in the Age of Communications Overload. MIT Press, Cambridge, MA, 2010. ",
      "doi": "10.5555/1941863"
    },
    {
      "text": "Harper, R., Regan, T., Mosawi, K. A., & Rouncefield, M. Trafficking: Design for the Viral Exchange of TV Content on Mobile Phones. MobileHCI'07, ACM (2007), 249--256.  ",
      "doi": "10.1145/1377999.1378015"
    },
    {
      "text": "Hollan, J. and Stornetta, S. Beyond Being There. CHI '92, ACM (1992), 119--125.  ",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Hutchins, E. Cognition in the Wild. MIT Press, Cambridge, MA, 1995.",
      "doi": ""
    },
    {
      "text": "Hutchins, E. Enaction, Imagination, and Insight. In J. Stewart, O. Gapenne & E. A. Di Paolo, eds., Enaction: Towards a New Paradigm for Cognitive Science. MIT Press, Cambridge, MA, 2010, 425--450.",
      "doi": ""
    },
    {
      "text": "Kangas, E. and Kinnunen, T. Applying user-centered design to mobile application development. Communications of the ACM 48, 7 (2005), 55--59.  ",
      "doi": "10.1145/1070838.1070866"
    },
    {
      "text": "Kendon, A. Spacing and Orientation in Co-present Interaction. In A. Esposito, N. et al. eds., Development of Multimodal Interfaces: Active Listening and Synchrony. Springer, Berlin, 2010, 1--15.  ",
      "doi": "10.1007/978-3-642-12397-9_1"
    },
    {
      "text": "Kindberg, T. Spasojevic, M. Fleck, R. & Sellen, A. The Ubiquitous Camera: An In-Depth Study of Camera Phone Use. Pervasive Computing 4, 2 (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Kun, L. & Marsden, G. Co-present photo sharing on mobile devices. MobileHCI'07, ACM (2007), 277--284.  ",
      "doi": "10.1145/1377999.1378019"
    },
    {
      "text": "Ling, R. New Tech, New Ties: How Mobile Communication is Reshaping Social Cohesion. MIT Press, Cambridge, MA, 2008. ",
      "doi": "10.5555/1796527"
    },
    {
      "text": "Löwgren, J. & Stolterman, E. Thoughtful Interaction Design. MIT Press, Cambridge, MA, 2004. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Marsden, G., Maunder, A., & Parker, M. People are people, but technology is not technology. Philosophical transactions. Series A, Mathematical, physical, and engineering sciences 366, 1881 (2008), 795--804.",
      "doi": ""
    },
    {
      "text": "Mauss, M. The Gift: The Form and Reason for Exchange in Archaic Societies. Routledge, London 2011.",
      "doi": ""
    },
    {
      "text": "McLeod, J., & Chaffee, S. Interpersonal approaches to communication research. American Behavioral Scientist, 16, (1973), 469--499",
      "doi": ""
    },
    {
      "text": "Naaman, M., Nair, R. & Kaplun, V. Photos on the Go. CHI '08, ACM (2008), 1739--1748.  ",
      "doi": "10.1145/1357054.1357326"
    },
    {
      "text": "Shove, E., Watson, M., Hand, M., and Ingram, J. The Design of Everyday Life. Berg, Oxford, UK, 2007.",
      "doi": ""
    },
    {
      "text": "Reitmaier T. 'She looked deep into our eyes': reflections on cross-cultural practice. Knowledge Management for Development Journal 7, 3 (2011), 327--339.",
      "doi": ""
    },
    {
      "text": "Reitmaier, T., Bidwell, N. J., and Marsden, G. Situating digital storytelling within African communities. Int. J of Human-Computer Studies 69, 10 (2011), 658--668.  ",
      "doi": "10.1016/j.ijhcs.2010.12.008"
    },
    {
      "text": "Rogers, Y. HCI Theory: Classical, Modern, and Contemporary. Morgan Claypool, 2012.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K. et al. Reflective design. Proc. Critical computing - CC'05, ACM (2005), 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Sengers, P. & Gaver, B. Staying open to interpretation. DIS '06, ACM (2006), 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Suchman, L. Human-Machine Reconfigurations: Plans and Situated Actions. Cambridge Univ. Pr., NY, 2007. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Suchman, L., Trigg, R., and Blomberg, J. Working artefacts: ethnomethods of the prototype. The British journal of sociology 53, 2 (2002), 163--179.",
      "doi": ""
    },
    {
      "text": "Van House, N. A. Collocated photo sharing, storytelling, and the performance of self. Int. Journal of Human-Computer Studies 67, 12 (2009), 1073--1086.  ",
      "doi": "10.1016/j.ijhcs.2009.09.003"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evenson, S. Research through design as a method for interaction design research in HCI. CHI '07, ACM (2007), 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Zimmerman, J., Stolterman, E., and Forlizzi, J. An Analysis and Critique of Research through Design. DIS'10, ACM (2010), 310--319.  ",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}