{
  "doi": "10.1145/2470654.2481379",
  "title": "The power of play: design lessons for increasing the lifespan of outdated computers",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2735-2744",
  "year": 2013,
  "badges": [],
  "abstract": "One consequence of rapid advances in computer technology is the obsolescence of hundreds of millions of computers each year. This paper explores strategies for increasing the reuse of outdated computers through an investigation of an 8-bit home computer that is still popular in developing countries. We observed the use of the computers in 16 households in Ahmedabad and Bangalore, India in order to gain insight into the contextual factors that support the continued popularity of the device. While most computers become obsolete in less than a decade, this 30-year-old computer technology remains useful because it provides exciting, multi-user family entertainment. While having minimal processing power and virtually no connectivity, the 8-bit computer supports input and output channels that are especially suited for co-located social game play. In contrast, PCs are primarily designed for individual use. Therefore, we offer low-cost design recommendations that would enable outdated PCs to support greater shared use and increased utility within the constrained material context of low-income households. These simple interventions, if adopted by computer refurbishment industries, have the potential to significantly extend the useful lifespan of PCs.",
  "tags": [
    "hci4d",
    "social computing",
    "ict4d",
    "ethnography",
    "games",
    "abandonware",
    "sustainability",
    "obsolescence"
  ],
  "authors": [
    {
      "name": "Derek Lomas",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467653601",
      "orcid": "missing"
    },
    {
      "name": "Anuj Kumar",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416596602",
      "orcid": "missing"
    },
    {
      "name": "Kishan Patel",
      "institution": "DA-IICT, Gandhinagar, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508692225",
      "orcid": "missing"
    },
    {
      "name": "Dixie Ching",
      "institution": "New York University, New York, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508693221",
      "orcid": "missing"
    },
    {
      "name": "Meera Lakshmanan",
      "institution": "Independent, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435597565",
      "orcid": "missing"
    },
    {
      "name": "Matthew Kam",
      "institution": "American Institutes for Research, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502732341",
      "orcid": "missing"
    },
    {
      "name": "Jodi L. Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ali, M. and Bailur, S. The Challenge of \"Sustainability\" in ICT4D: Is Bricolage the Answer? In Proc. of the 9th International Conference on Social Implications of Computers in Developing Countries, São Paulo, Brazil, (2007).",
      "doi": ""
    },
    {
      "text": "Antonopoulos, C. and Sakellaris, P. Estimating computer depreciation using online auction data. Economics of Innovation and New Technology, (2011), 183--204.",
      "doi": ""
    },
    {
      "text": "Banerjee, A. V., Cole, S., Duflo, E. and Linden, L. Remedying education: Evidence from two randomized experiments in India, Quarterly Journal of Economics, vol. 122, (2007), 1235--1264.",
      "doi": ""
    },
    {
      "text": "Blevis, E. Sustainable interaction design: invention & disposal, renewal & reuse. In Proc. of SIGCHI (2007).  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Campbell, S. M. On the absence of obsolescence. In the Annals of the History of Computing, IEEE, vol. 31, issue 4, (2009), 118--120.  ",
      "doi": "10.1109/MAHC.2009.124"
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. Mapping the Landscape of Sustainable HCI. In Proc. of SIGCHI (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Geske, M. J., Ramey, V. A., and Shapiro, M. D. Why do computers depreciate? In E. Berndt and C. Hulten, eds., Hard-to-Measure Goods and Services: Essays in Honor of Zvi Griliches. University of Chicago Press, (2007), 121--150.",
      "doi": ""
    },
    {
      "text": "Hayes, E. Girls, Gaming, and Trajectories of IT Expertise. In Kafai, Y. B., Heeter, C., Denner, J., and Sun, J. Y. (Eds.), Beyond Barbie and Mortal Kombat: New Perspectives on Gender and Gaming, MIT Press, (2008).",
      "doi": ""
    },
    {
      "text": "Huh, J., Nathan, L.P., Blevis, E., Tomlinson, B., Sengers, P., and Busse, D. Examining appropriation, reuse, and maintenance for sustainability. In Proc. of SIGCHI (2010), 4457--4460.  ",
      "doi": "10.1145/1753846.1754173"
    },
    {
      "text": "Jackson, S., Pompe, A., and Krieshok, G. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. CSCW, (2012).  ",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Kahhat, R. and Williams, E. Product or waste? Importation and end-of-life processing of computers in Peru. Environmental science & technology 43, 15 (2009), 6010--6.",
      "doi": ""
    },
    {
      "text": "Kam, M., Kumar, A., Jain, S., Mathur, A., and Canny, J. Improving literacy in rural India: Cellphone games in an after-school program. In Proc. of IEEE/ACM Conference on ICTD (2009). ",
      "doi": "10.5555/1812530.1812545"
    },
    {
      "text": "Kim, S. and Paulos, E. Practices in the creative reuse of e-waste. In Proc of SIGCHI, (2011), 2395--2404.  ",
      "doi": "10.1145/1978942.1979292"
    },
    {
      "text": "Kolko, B. E. and Putnam, C. Computer games in the developing world: The value of non-instrumental engagement with ICTs, or taking play seriously International Conference on Information and Communication Technologies and Development, (2009), pp. 46--55. ",
      "doi": "10.5555/1812530.1812536"
    },
    {
      "text": "Kumar, A., Tewari, A., Shroff, G., Chittamuru, D., Kam, M. and Canny, J. An Exploratory Study of Unsupervised Mobile Learning in Rural India. In Proc. of SIGCHI (2010).  ",
      "doi": "10.1145/1753326.1753435"
    },
    {
      "text": "Lomas, D., Douglass, J., and Rehn, D. Playpower: Radically Affordable Computer-Aided Learning with $12 TV-Computers. Meaningful Play, (2008).",
      "doi": ""
    },
    {
      "text": "Lomas, D., Ching, D. Patel, K., Hoadley, C., & Kam, M. When a console game becomes CSCL: Play, participatory learning and 8-bit home computing in India. The International Conference on Computer-Supported Collaborative Learning, Hong Kong. (2011)",
      "doi": ""
    },
    {
      "text": "Mitchell, E. The Dynamics of Family Interaction Around Home Video Games. In M. B. Sussman, ed., Personal Computers and the Family. The Haworth Press, Inc, (1985), 121--135.",
      "doi": ""
    },
    {
      "text": "Pal, J., Lakshmanan, M., and Toyama, K. \"My child will be respected\": Parental perspectives on computers in rural India. 2007 International Conference on Information and Communication Technologies and Development, (2007), 1--9.",
      "doi": ""
    },
    {
      "text": "Pal, J., Patra, R., Nedevschi, S. and Pawar, U.S. The case of the occasionally cheap computer: low-cost devices and classrooms in the developing world. ITID: Information Technology and International Development, MIT Press, April (2009).",
      "doi": ""
    },
    {
      "text": "Parikh, T. and Ghosh, K. Understanding and Designing for Intermediated Information Tasks in India, IEEE Pervasive Computing Magazine, Vol. 5, No. 2 (2006).  ",
      "doi": "10.1109/MPRV.2006.41"
    },
    {
      "text": "Rangaswamy, N. and Sambasivan, N. Cutting Chai, Jugaad, and Here Pheri: towards UbiComp for a global community. Personal and Ubiquitous Computing 15, 6 (2011), 553--564.  ",
      "doi": "10.1007/s00779-010-0349-x"
    },
    {
      "text": "Rogers, E. M. Diffusion of Innovations. New York: Free Press, (1983)",
      "doi": ""
    },
    {
      "text": "Sahni, S., Boustani, A., Gutowski, T., and Graves, S. Reusing personal computer devices-good or bad for the environment? Sustainable Systems and Technology (ISSST), IEEE (2010), 1--6.",
      "doi": ""
    },
    {
      "text": "Singhal, A. A market at the bottom of the pyramid? National Council of Applied Economic Research (2009).",
      "doi": ""
    },
    {
      "text": "Slade, Giles. Made to Break: Technology and Obsolescence in America. Harvard University Press, (2007).",
      "doi": ""
    },
    {
      "text": "Smyth, T. N., Kumar, S., Medhi, I., and Toyama, K. Where there's a will there's a way: mobile media sharing in urban India. In Proc. of SIGCHI (2010).  ",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Stevens, R., Satwicz, T., & McCarthy, L. In-Game, In-Room, In-World: Reconnecting Video Game Play to the Rest of Kids' Lives. In K. Salen (Ed.), The Ecology of Games: Connecting Youth, Games, and Learning. The MacArthur Foundation Series on Digital Media and Learning. Cambridge, MA: The MIT Press (2008).",
      "doi": ""
    },
    {
      "text": "Strauss, A. C. and Corbin, J. Basics of Qualitative Research. Sage Publications, (1998).",
      "doi": ""
    },
    {
      "text": "Streicher-Porte, M., Widmer, R., Jain, A., Bader, H. P., Scheidegger, R., and Kytzia, S. Key drivers of the ewaste recycling system; Assessing and modeling ewaste processing in the informal sector in Delhi. Environmental Impact Assessment Review 25, 5 (2005), 472--491.",
      "doi": ""
    },
    {
      "text": "Van der Heijden, H. User acceptance of hedonic information systems. MIS quarterly 28, 4 (2004). ",
      "doi": "10.5555/2017236.2017244"
    },
    {
      "text": "Voida, A. and Greenberg, S. Wii All Play: The Console Game as a Computational Meeting Place. In Proc. of SIGCHI (2009), 1559--1568.  ",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Wikipedia, http://wikipedia.org/Abandonware, 2011.",
      "doi": ""
    },
    {
      "text": "Williams, E., Kahhat, R., Allenby, B., Kavazanjian, E., Kim, J., and Xu, M. Environmental, Social, and Economic Implications of Global Reuse and Recycling of Personal Computers. Environmental Science & Technology 42, 17 (2008), 6446--6454.",
      "doi": ""
    },
    {
      "text": "Yu, J., Williams, E., Ju, M., and Yang, Y. Forecasting global generation of obsolete personal computers. Environmental science & technology 44, 9 (2010), 3232--7.",
      "doi": ""
    }
  ]
}