{
  "doi": "10.1145/2470654.2466419",
  "title": "How tools in IDEs shape developers' navigation behavior",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3073-3082",
  "year": 2013,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Understanding source code is crucial for successful software maintenance, and navigating the call graph is especially helpful to understand source code [12]. We compared maintenance performance across four different development environments: an IDE without any call graph exploration tool, a Call Hierarchy tool as found in Eclipse, and the tools Stacksplorer [7]and Blaze [11]. Using any of the call graph exploration tools more developers could solve certain maintenance tasks correctly. Only Stacksplorer and Blaze, however, were also able to decrease task completion times, although the Call Hierarchy offers access to a larger part of the call graph. To investigate if this result was caused by a change in navigation behavior between the tools, we used a set of predictive models to create formally comparable descriptions of programmer navigation. The results suggest that the decrease in task completion times has been caused by Stacksplorer and Blaze promoting call graph navigation more than the Call Hierarchy tool.",
  "tags": [
    "analysis methods",
    "development tools / toolkits / programming environments"
  ],
  "authors": [
    {
      "name": "Jan-Peter Krämer",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650098",
      "orcid": "missing"
    },
    {
      "name": "Thorsten Karrer",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81310482207/rel-imgonly/_dsc0879-version2.jpg",
      "acmid": "81310482207",
      "orcid": "missing"
    },
    {
      "name": "Joachim Kurz",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502693309",
      "orcid": "missing"
    },
    {
      "name": "Moritz Wittenhagen",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81442614132/rel-imgonly/dsc_8702.jpg",
      "acmid": "81442614132",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "Baeza-Yates, R. A., and Ribeiro-Neto, B. Modern Information Retrieval. Addison-Wesley Longman, 1999. ",
      "doi": "10.5555/553876"
    },
    {
      "text": "Bragdon, A., Zeleznik, R., Reiss, S. P., Karumuri, S., Cheung, W., Kaplan, J., Coleman, C., Adeputra, F., and LaViola, J. J. Code Bubbles: A Working Set-based Interface for Code Understanding and Maintenance. In Proc. CHI '10, ACM (2010).  ",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Coblenz, M. J., Ko, A. J., and Myers, B. A. JASPER : An Eclipse Plug-In to Facilitate Software Maintenance Tasks. In Proc. 2006 OOPSLA Workshop on Eclipse Technology eXchange, ACM Press (2006).  ",
      "doi": "10.1145/1188835.1188849"
    },
    {
      "text": "DeLine, R., Czerwinski, M., and Robertson, G. Easing Program Comprehension by Sharing Navigation Data. In Proc. VLHCC '05, IEEE (2005).  ",
      "doi": "10.1109/VLHCC.2005.32"
    },
    {
      "text": "DeLine, R., and Rowan, K. Code canvas: zooming towards better development environments. In Proc. ICSE '10, ACM (2010).  ",
      "doi": "10.1145/1810295.1810331"
    },
    {
      "text": "Fouse, A., Weibel, N., Hutchins, E., and Hollan, J. D. ChronoViz: a system for supporting navigation of time-coded data. In Proc. CHI '11, ACM (2011).  ",
      "doi": "10.1145/1979742.1979706"
    },
    {
      "text": "Karrer, T., Krämer, J.-P., Diehl, J., Hartmann, B., and Borchers, J. Stacksplorer: Call graph navigation helps increasing code maintenance efficiency. In Proc. UIST '11, ACM (2011).  ",
      "doi": "10.1145/2047196.2047225"
    },
    {
      "text": "Kersten, M., and Murphy, G. C. Mylar: A Degree-of-Interest Model for IDEs. In Proc. AOSD, ACM (2005).  ",
      "doi": "10.1145/1052898.1052912"
    },
    {
      "text": "Ko, A., Myers, B., Coblenz, M., and Aung, H. An Exploratory Study of How Developers Seek, Relate, and Collect Relevant Information during Software Maintenance Tasks. IEEE Transactions on Software Engineering 32, 12 (2006).  ",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Ko, A. J., and Myers, B. A. Debugging Reinvented: Asking and Answering Why and Why Not Questions about Program Behavior. In Proc. ICSE '08, IEEE (2008).  ",
      "doi": "10.1145/1368088.1368130"
    },
    {
      "text": "Krämer, J.-P., Kurz, J., Karrer, T., and Borchers, J. Blaze: supporting two-phased call graph navigation in source code. In Proc. CHI EA '12, ACM (2012).  ",
      "doi": "10.1145/2212776.2223775"
    },
    {
      "text": "LaToza, T. D., and Myers, B. A. Developers Ask Reachability Questions. In Proc. ICSE '10, ACM (2010).  ",
      "doi": "10.1145/1806799.1806829"
    },
    {
      "text": "LaToza, T. D., and Myers, B. A. Visualizing Call Graphs. In Proc. VLHCC '11 (2011).",
      "doi": ""
    },
    {
      "text": "LaToza, T. D., Venolia, G., and DeLine, R. Maintaining Mental Models: A Study of Developer Work Habits. In Proc. ICSE '06, ACM (2006).  ",
      "doi": "10.1145/1134285.1134355"
    },
    {
      "text": "Lawrance, J., Bellamy, R., Burnett, M., and Rector, K. Using information scent to model the dynamic foraging behavior of programmers in maintenance tasks. In Proc. CHI '08, ACM (2008).  ",
      "doi": "10.1145/1357054.1357261"
    },
    {
      "text": "Murphy, G. C., Kersten, M., and Findlater, L. How Are Java Software Developers Using the Eclipse IDE? IEEE Software 23, 4 (2006).  ",
      "doi": "10.1109/MS.2006.105"
    },
    {
      "text": "Piorkowski, D., Fleming, S. D., Scaffidi, C., John, L., Bogart, C., John, B. E., Burnett, M., and Bellamy, R. Modeling programmer navigation: A head-to-head empirical evaluation of predictive models. In Proc. VL/HCC '11 (2011).",
      "doi": ""
    },
    {
      "text": "Pirolli, P., and Card, S. K. Information Foraging. Psychological Review 106, 4 (1999).",
      "doi": ""
    },
    {
      "text": "Pressman, R. S. Software Engineering: A Practitioner's Approach, 7th ed. McGraw-Hill, 2010. ",
      "doi": "10.5555/1593949"
    },
    {
      "text": "Robillard, M. P., Coelho, W., and Murphy, G. C. How Effective Developers Investigate Source Code: An Exploratory Study. IEEE Transactions on Software Engineering 30, 12 (2004).  ",
      "doi": "10.1109/TSE.2004.101"
    },
    {
      "text": "Sillito, J., Murphy, G. C., and Volder, K. D. Asking and Answering Questions during a Programming Change Task. IEEE Transactions on Software Engineering 34, 4 (2008).  ",
      "doi": "10.1109/TSE.2008.26"
    },
    {
      "text": "Singer, J., Elves, R., and Storey, M.-A. NavTracks: Supporting Navigation in Software Maintenance. In Proc. ICSM '05, IEEE (2005).  ",
      "doi": "10.1109/ICSM.2005.66"
    },
    {
      "text": "Singer, J., Lethbridge, T., Vinson, N., and Anquetil, N. An Examination of Software Engineering Work Practices. In Proc. 1997 Conference of the Centre for Advanced Studies on Collaborative Research, IBM Press (1997). ",
      "doi": "10.5555/782010.782031"
    },
    {
      "text": "Čubranić, D., and Murphy, G. C. Hipikat: Recommending Pertinent Software Development Artifacts. In Proc. ICSE '03, IEEE (2003). ",
      "doi": "10.5555/776816.776866"
    },
    {
      "text": "Winograd, T. Breaking the complexity barrier again. ACM SIGIR Forum (1974).  ",
      "doi": "10.1145/951761.951764"
    }
  ]
}