{
  "doi": "10.1145/2470654.2481356",
  "title": "uTouch: sensing touch gestures on unmodified LCDs",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2581-2584",
  "year": 2013,
  "badges": [],
  "abstract": "Current solutions for enabling touch interaction on existing non-touch LCD screens require adding additional sensors to the interaction surface. We present uTouch, a system that detects and classifies touches and hovers without any modification to the display, and without adding any sensors to the user. Our approach utilizes existing signals in an LCD that are amplified when a user brings their hand near or touches the LCD's front panel. These signals are coupled onto the power lines, where they appear as electromagnetic interference (EMI) which can be sensed using a single device connected elsewhere on the power line infrastructure. We validate our approach with an 11 user, 8 LCD study, and demonstrate a real-time system.",
  "authors": [
    {
      "name": "Ke-Yu Chen",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488652724",
      "orcid": "missing"
    },
    {
      "name": "Gabe A. Cohn",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470655150",
      "orcid": "missing"
    },
    {
      "name": "Sidhant Gupta",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81460654398/rel-imgonly/sidhant.jpg",
      "acmid": "81460654398",
      "orcid": "missing"
    },
    {
      "name": "Shwetak N. Patel",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100490064/rel-imgonly/81100490064.jpg",
      "acmid": "81100490064",
      "orcid": "0000-0002-6300-4389"
    }
  ],
  "references": [
    {
      "text": "Abileah, A., Green, P. Optical sensors embedded within AMLCD panel: design and applications. In the Proc. of SIGGRAPH 2007.  ",
      "doi": "10.1145/1278280.1278309"
    },
    {
      "text": "Boer, D.W. Active Matrix Liquid Crystal Displays. Oxford: Elsevier, 2005.",
      "doi": ""
    },
    {
      "text": "Echtler, F., Pototschnig, T., and Klinker, G. An LEDbased multitouch sensor for LCD screens. In TEI 2010.  ",
      "doi": "10.1145/1709886.1709930"
    },
    {
      "text": "Gupta, S., Chen, K., Reynolds, M., Patel, S.N. LightWave: Using Compact Fluorescent Lights as Sensors. In the Proc. of UbiComp 2011.  ",
      "doi": "10.1145/2030112.2030122"
    },
    {
      "text": "Hodges, S., Izadi, S., Butler, A., Rrustemi, A., Buxton, B. ThinSight: versatile multi-touch sensing for thin form-factor displays. In the Proc. of UIST 2007.  ",
      "doi": "10.1145/1294211.1294258"
    },
    {
      "text": "Moeller, J., & Kerne, A. ZeroTouch: an optical multitouch and free-air interaction architecture. In CHI 2012.  ",
      "doi": "10.1145/2207676.2208368"
    },
    {
      "text": "Rekimoto, J. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In Proc CHI 2002.  ",
      "doi": "10.1145/503376.503397"
    }
  ]
}