{
  "doi": "10.1145/2470654.2466203",
  "title": "Designing reusable alternate reality games",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1529-1538",
  "year": 2013,
  "badges": [],
  "abstract": "Successful Alternate Reality Games (ARGs), such as The Lost Experience, I Love Bees and Urgent EVOKE have solicited thousands of active participants and, often, millions of spectators from around the world. ARGs require significant resources not only in terms of initial design, but also in implementation, since live, dynamic interplay between players and designers is an inherent aspect of their interactive storylines. This paper outlines a novel design framework for creating reusable ARGs that will help extend the lifespan of ARGs and allow them to permeate new domains such as education. The framework includes three key reusable design objectives (replayability, adaptability, extensibility), each of which can be enacted at different levels of depth. We also identify barriers to reusable ARGs and design strategies for overcoming those barriers, drawing upon ARG designer interviews and existing ARGs.",
  "tags": [
    "design",
    "reusable",
    "extensible",
    "adaptable",
    "serious games",
    "alternate reality games",
    "replayable"
  ],
  "authors": [
    {
      "name": "Derek Hansen",
      "institution": "Brigham Young University, Provo, Utah, USA",
      "img": "/do/10.1145/contrib-81311486004/rel-imgonly/derekhansen.png",
      "acmid": "81311486004",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Bonsignore",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641019",
      "orcid": "missing"
    },
    {
      "name": "Marc Ruppel",
      "institution": "National Endowment for the Humanities, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558177456",
      "orcid": "missing"
    },
    {
      "name": "Amanda Visconti",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502733564",
      "orcid": "missing"
    },
    {
      "name": "Kari Kraus",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502766929",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alchemy. What Happens Next? EVOKE Blog, May 2010. http://www.urgentevoke.com/page/what-happensnext. - 10 -",
      "doi": ""
    },
    {
      "text": "Alexander, C., Ishikawa, S., & Silverstein, M. A Pattern language: towns, buildings, construction. Oxford Univ Press, NY, USA, 1977.",
      "doi": ""
    },
    {
      "text": "ARGOSI: Resources. ARGOSI: Alternate Reality Games for Orientation, Socialisation and Induction, 2009. http://argosi.playthinklearn.net/resources.htm.",
      "doi": ""
    },
    {
      "text": "Ash, K. (2008). Alternate Reality Games. Ed. Week. http://www.edweek.org/dd/articles/2008/06/04/04games _web.h01.html",
      "doi": ""
    },
    {
      "text": "Battles, J., Glenn, V., & Shedd, L. Rethinking the Library Game: Creating an Alternate Reality with Social Media. Journal of Web Librarianship, 5(2), (2011), 114--131.",
      "doi": ""
    },
    {
      "text": "Benford, S., & Giannachi, G.Temporal trajectories in shared interactive narratives. In Proc CHI 2008, ACM Press, (2008), 73--82.  ",
      "doi": "10.1145/1357054.1357067"
    },
    {
      "text": "Björk, S. & Holopainen, J. Patterns in game design. Charles River Media, MA, USA, 2005.",
      "doi": ""
    },
    {
      "text": "Bonsignore, E., Kraus, K., Visconti, A., Hansen, D., Fraistat, A., & Druin, A. Game Design for Promoting Counterfactual Thinking. In Proc. CHI 2012, ACM Press, (2012), 2079--2082.  ",
      "doi": "10.1145/2207676.2208357"
    },
    {
      "text": "Bonsignore, E., Hansen, D., Kraus, K., Ahn, J., Visconti, A., Fraistat, A., & Druin, A. Alternate Reality Games: Platforms for Collaborative Learning. In Proc. ICLS 2012, International Society of the Learning Sciences, (2012), 251--258.",
      "doi": ""
    },
    {
      "text": "Bonsignore, E., Hansen, D., Kraus, K., & Ruppel, M. Alternate Reality Games as Platforms for Practicing 21st Century Literacies. International Journal for Learning and Media, (in-press).",
      "doi": ""
    },
    {
      "text": "Corbin, J., & Strauss, A. (2008). Basics of qualitative research: techniques and procedures for developing grounded theory (3rd ed.). Los Angeles, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Dahlen, C. Interview: Jordan Weisman. Gamasutra: The Art & Business of Making Games. (2008, May). http://www.gamasutra.com/view/feature/132055/intervi ew_jordan_weisman.php?.",
      "doi": ""
    },
    {
      "text": "Dena, C. Emerging Participatory Culture Practices: Player-Created Tiers in Alternate Reality Games. Convergence, 14(1), (2008), 41--57.",
      "doi": ""
    },
    {
      "text": "Gamma, E., Helm, R., Johnson, R., & Vlissides, J. Design patterns: elements of reusable object-oriented software. Addison-Wesley, MA, USA, 1995. ",
      "doi": "10.5555/186897"
    },
    {
      "text": "Gurzick, D., White, K. F., Lutters, W. G., Landry, B. M., Dombrowski, C., & Kim, J. Y. Designing the future of collaborative workplace systems: lessons learned from a comparison with alternate reality games. In Proc iConference 2011, ACM Press, (2011), 174--180.  ",
      "doi": "10.1145/1940761.1940785"
    },
    {
      "text": "Jenkins, H. Convergence Culture: Where Old and New Media Collide. NYU Press, NY, USA, 2006.",
      "doi": ""
    },
    {
      "text": "Johnson, M., Clapp, M. J., Ewing, S. R., & Buhler, A. Building a Participatory Culture: Collaborating with Student Organizations for 21st C. Library Instruction. Collaborative Librarianship, 3(1), (2011), 2--15.",
      "doi": ""
    },
    {
      "text": "Kim, J. Y., Allen, J. P., & Lee, E. Alternate reality gaming. Commun. ACM, 51(2), (2008), 36--42.  ",
      "doi": "10.1145/1314215.1314222"
    },
    {
      "text": "Kolb, S. (2012). Grounded theory and the constant comparative method. Journal of Emerging Trends in Educational Research and Policy Studies 3(1), 83--86.",
      "doi": ""
    },
    {
      "text": "Kreimeier, B. (2002). The Case For Game Design Patterns. Gamasutra. http://www.gamasutra.com/view/feature/132649/the_cas e_for_game_design_patterns.php",
      "doi": ""
    },
    {
      "text": "Martin, A., Thompson, B., & Chatfield, T. Alternate Reality Games White Paper -- IGDA ARG SIG. (2006). http://archives.igda.org/arg/resources/IGDAAlternateRealityGames-Whitepaper-2006.pdf",
      "doi": ""
    },
    {
      "text": "McGonigal, J. Reality is Broken. Penguin Press, NY, USA, 2011.",
      "doi": ""
    },
    {
      "text": "Macvean, A., Hajarnis, S., Headrick, B., Ferguson, A., Barve, C., Karnik, D., & Riedl, M. O. WeQuest: scalable alternate reality games through end-user content authoring. In Proc. ACE 2011, ACM Press, (2011), 1--8.  ",
      "doi": "10.1145/2071423.2071450"
    },
    {
      "text": "Montola, M. (2009). Pervasive games: theory and design. Elsevier/Morgan Kaufmann, Boston, MA, 2005. ",
      "doi": "10.5555/1717294"
    },
    {
      "text": "Niemeyer, G., Garcia, A., & Naima, R. (2009). Black cloud: patterns towards da future. Proc. Multimedia 2009, ACM Press (2009), 1073--1082.  ",
      "doi": "10.1145/1631272.1631514"
    },
    {
      "text": "Ruppel, M. Narrative Convergence, Cross-Sited Productions and the Archival Dilemma. Convergence: The International Journal of Research into New Media Technologies, 15(3), (2009), 281--298.",
      "doi": ""
    },
    {
      "text": "Squire, K., Giovanetto, L., Devane, B., & Durga, S. From Users to Designers: Building a Self-Organizing Game-Based Learning Environment. TechTrends: Linking Research & Practice to Improve Learning, 49(5), (2005), 34--74.",
      "doi": ""
    },
    {
      "text": "Steinkuehler, C., & Duncan, S. Scientific Habits of Mind in Virtual Worlds. Journal of Science Education and Technology, 17(6), (2008), 530--543.",
      "doi": ""
    },
    {
      "text": "The Metaurchins. Project Mu Archives. Unfiction, Inc, OR, USA, 2006.",
      "doi": ""
    },
    {
      "text": "Watercutter, A. (2012). For Next-Gen TV, Turn to a Sci-Fi Scribe for Your Big Ideas. Wired.com. http://www.wired.com/underwire/2012/10/worlds-mostwired-fourth-wall-studios/all/",
      "doi": ""
    },
    {
      "text": "Whitton, N. Alternate reality games for developing student autonomy and peer learning. In Proc Learners in the Co-creation of Knowledge, 2008, (2008), 32--40.",
      "doi": ""
    }
  ]
}