{
  "doi": "10.1145/2470654.2481324",
  "title": "Carpé data: supporting serendipitous data integration in personal information management",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2339-2348",
  "year": 2013,
  "badges": [],
  "abstract": "The information processing capabilities of humans enable them to opportunistically draw and integrate knowledge from nearly any information source. However, the integration of digital, structured data from diverse sources remains difficult, due to problems of heterogeneity that arise when data modelled separately are brought together. In this paper, we present an investigation of the feasibility of extending Personal Information Management (PIM) tools to support lightweight, user-driven mixing of previously un-integrated data, with the objective of allowing users to take advantage of the emerging ecosystems of structured data currently becoming available. In this study, we conducted an exploratory, sequential, mixed-method investigation, starting with two pre-studies of the data integration needs and challenges, respectively, of Web-based data sources. Observations from these pre-studies led to DataPalette, an interface that introduced simple co-reference and group multi-path-selection mechanisms for working with terminologically and structurally heterogeneous data. Our lab study showed that participants readily understood the new interaction mechanisms which were introduced. Participants made more carefully justified decisions, even while weighing a greater number of factors, moreover expending less effort, during subjective-choice tasks when using DataPalette, than with a control set-up.",
  "authors": [
    {
      "name": "Max Van Kleek",
      "institution": "University of Southampton, Southampton, Hampshire, UK",
      "img": "/do/10.1145/contrib-81328490974/rel-imgonly/max-android.jpg",
      "acmid": "81328490974",
      "orcid": "0000-0003-3873-6366"
    },
    {
      "name": "Daniel A. Smith",
      "institution": "University of Southampton, Southampton, Hampshire, UK",
      "img": "/do/10.1145/contrib-81100080112/rel-imgonly/n286108029_3734675_4929_300px.jpg",
      "acmid": "81100080112",
      "orcid": "missing"
    },
    {
      "name": "Heather S. Packer",
      "institution": "University of Southampton, Southampton, Hampshire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474652055",
      "orcid": "missing"
    },
    {
      "name": "Jim Skinner",
      "institution": "University of Southampton, Southampton, Hampshire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556122456",
      "orcid": "missing"
    },
    {
      "name": "Nigel R. Shadbolt",
      "institution": "University of Southampton, Southampton, Hampshire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100351241",
      "orcid": "0000-0002-5085-9724"
    }
  ],
  "references": [
    {
      "text": "Bergman, O., Beyth-marom, R., and Nachmias, R. The user-subjective approach to personal information management systems. JASIST 54 (2003), 872--878.  ",
      "doi": "10.1002/asi.10283"
    },
    {
      "text": "Bernstein, M., Van Kleek, M., Karger, D., and Schraefel, M. Information scraps: How and why information eludes our personal information management tools. TOIS 26, 4 (2008), 24.  ",
      "doi": "10.1145/1402256.1402263"
    },
    {
      "text": "Cai, Y., Dong, X. L., Halevy, A., Liu, J. M., and Madhavan, J. Personal information management with SEMEX. In Proc. SIGMOD '05 (2005), 921--923.  ",
      "doi": "10.1145/1066157.1066289"
    },
    {
      "text": "Castano, S., Ferrara, A., and Montanelli, S. Matching ontologies in open networked systems: Techniques and applications. Journal on Data Semantics V (2006), 25--63. ",
      "doi": "10.5555/2137783.2137786"
    },
    {
      "text": "Doan, A., Madhavan, J., Dhamankar, R., Domingos, P., and Halevy, A. Learning to match ontologies on the Semantic Web. VLDB Journal 12, 4 (2003), 303--319.  ",
      "doi": "10.1007/s00778-003-0104-2"
    },
    {
      "text": "Dontcheva, M., Drucker, S. M., Salesin, D., and Cohen, M. F. Relations, cards, and search templates: user-guided web data integration and layout. In Proc. UIST '07 (2007), 61--70.  ",
      "doi": "10.1145/1294211.1294224"
    },
    {
      "text": "Dumais, S., Cutrell, E., Cadiz, J., Jancke, G., Sarin, R., and Robbins, D. C. Stuff i've seen: a system for personal information retrieval and re-use. In SIGIR '03, ACM (2003), 72--79.  ",
      "doi": "10.1145/860435.860451"
    },
    {
      "text": "Ennals, R., Brewer, E., Garofalakis, M., Shadle, M., and Gandhi, P. Intel Mash Maker: join the web. SIGMOD Rec. 36, 4 (2007), 27--33.  ",
      "doi": "10.1145/1361348.1361355"
    },
    {
      "text": "Euzenat, J. An API for ontology alignment. Proc ISWC '04 (2004), 698--712.",
      "doi": "10.1007/978-3-540-30475-3_48"
    },
    {
      "text": "Fagan, J. C. Mashing up Multiple Web Feeds Using Yahoo! Pipes. Computers in Libraries 27, 10 (2007), 10--17.",
      "doi": ""
    },
    {
      "text": "Halevy, A., Rajaraman, A., and Ordille, J. Data integration: the teenage years. In Proc. VLDB '06 (2006), 9--16. ",
      "doi": "10.5555/1182635.1164130"
    },
    {
      "text": "Hart, S., and Staveland, L. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Human mental workload 1 (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Huynh, D., and Karger, D. Parallax and companion: Set-based browsing for the data web. In Proc. WWW '09 (2009).",
      "doi": ""
    },
    {
      "text": "Huynh, D., Karger, D., and Quan, D. Haystack: A Platform for Creating, Organizing and Visualizing Information Using RDF, 2002.",
      "doi": ""
    },
    {
      "text": "Huynh, D., Miller, R., and Karger, D. Potluck: Data mash-up tool for casual users. JWS 6, 4 (2008), 274--282.  ",
      "doi": "10.1016/j.websem.2008.09.005"
    },
    {
      "text": "Lin, J., Wong, J., Nichols, J., Cypher, A., and Lau, T. A. End-user programming of mashups with vegemite. In Proc. IUI '09, ACM (2009), 97--106.  ",
      "doi": "10.1145/1502650.1502667"
    },
    {
      "text": "Shadbolt, N., Berners-Lee, T., and Hall, W. The Semantic Web Revisited. IEEE Intelligent Systems 21, 3 (2006), 96--101.  ",
      "doi": "10.1109/MIS.2006.62"
    },
    {
      "text": "Suchanek, F., Abiteboul, S., and Senellart, P. PARIS: probabilistic alignment of relations, instances, and schema. Proc. VLDB '11 5, 3 (2011), 157--168. ",
      "doi": "10.14778/2078331.2078332"
    },
    {
      "text": "Wong, J., and Hong, J. I. Making mashups with marmite: towards end-user programming for the web. In Proc. CHI '07, ACM (2007), 1435--1444.  ",
      "doi": "10.1145/1240624.1240842"
    }
  ]
}