{
  "doi": "10.1145/2470654.2481306",
  "title": "Exploring the effects of space and place on engagement with an interactive installation",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2213-2222",
  "year": 2013,
  "badges": [],
  "abstract": "Very little research has concurrently explored the influence of both physical space and social context (or place) on the way people engage with a public interactive display. We addressed this issue with a novel approach: studying how people engaged with the same interactive installation in ten situations with varying spatial and social properties. The main finding across these studies is that place trumps space: a conducive social context could overcome a poor physical space and encourage interaction; conversely, an inappropriate social context could inhibit interaction in spaces that might normally facilitate engagement. We discuss this finding in terms of the salience of the display within the space, the visibility of incidental interactions with the installation, the different understandings of place that people can have in the same location and the role of emergent champions and comperes in encouraging interaction.",
  "tags": [
    "public display",
    "interaction",
    "situated display",
    "space",
    "place"
  ],
  "authors": [
    {
      "name": "Imeh Akpan",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558377456",
      "orcid": "missing"
    },
    {
      "name": "Paul Marshall",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    },
    {
      "name": "Jon Bird",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100566270",
      "orcid": "missing"
    },
    {
      "name": "Daniel Harrison",
      "institution": "University College London, London, UK",
      "img": "/do/10.1145/contrib-81502662276/rel-imgonly/6855386774_f92b253929_o.jpg",
      "acmid": "81502662276",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bird, J., Faith, J. and Webster, A. Tabula Rasa: A case study in evolutionary curation. Proc. EvoMUSART (2003), 479--489. ",
      "doi": "10.5555/1765642.1765690"
    },
    {
      "text": "Brignull, H., and Rogers, Y. Enticing people to interact with large public displays in public spaces. Proc. INTERACT'03 (2003), 17--24.",
      "doi": ""
    },
    {
      "text": "Ciolfi, L. Understanding spaces as places: Extending interaction design paradigms. Cognition, Technology & Work, 6, 1 (2004), 37--40.  ",
      "doi": "10.1007/s10111-003-0139-6"
    },
    {
      "text": "Dalton, N. S., Marshall, P., Conroy-Dalton, R. Measuring environments for public displays: A Space Syntax approach. Ext Abstracts CHI'10, ACM Press (2010), 3841--3846.  ",
      "doi": "10.1145/1753846.1754066"
    },
    {
      "text": "Fischer, P. T., Hornecker, E. Urban HCI: Spatial aspects in the design of shared encounters for media facades. Proc. CHI'12, ACM Press (2012), 307--316.  ",
      "doi": "10.1145/2207676.2207719"
    },
    {
      "text": "Hallberg, G. Overcoming the challenges of designing interactive artworks for creative engagement in unsupervised arenas. Unpublished MSc Creative Systems Dissertation, University of Sussex, 2009.",
      "doi": ""
    },
    {
      "text": "Haeusler, M. H. Media facades: History, technology. content, Avedition, Ludwigsburg, Germany, 2009.",
      "doi": ""
    },
    {
      "text": "Harrison, S., Dourish, P. Re-Place-ing space: The roles of place and space in collaborative systems. Proc. CSCW'06, ACM Press (2006), 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hillier, B., Space is the machine, Cambridge University Press, 1996.",
      "doi": ""
    },
    {
      "text": "Hornecker, E. A design theme for tangible interaction: Embodied facilitation. Proc. ECSCW '05 (2005), 23--43. ",
      "doi": "10.5555/1242029.1242031"
    },
    {
      "text": "Huang, E., Koster, A. and Borchers, J. Overcoming assumptions and uncovering practices: When does the public really look at public displays? Proc. Pervasive '08 (2008), 228--243.  ",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Jacucci, G., Morrison, A., Richard, G. T., Kleimola, J., Peltonen, P., Parisi, L. and Laitinen, T. Worlds of information: Designing for engagement at a public multitouch display. Proc. CHI '10, ACM Press (2010), 2267--2276.  ",
      "doi": "10.1145/1753326.1753669"
    },
    {
      "text": "Marshall, P., Rogers, Y. and Pantidi, N. Using Fformations to analyse spatial patterns of interaction in physical environments. Proc. CSCW'11, ACM, Press (2011), 445--454.  ",
      "doi": "10.1145/1958824.1958893"
    },
    {
      "text": "Meakin, N. Loop Festival, Victoria Gardens, Brighton, Aug 16. The Argus. http://tinyurl.com/a8owf4m",
      "doi": ""
    },
    {
      "text": "Michelis, D., Müller, J. The Audience funnel: Observations of gesture based interactions with multiple large displays in a city center. IJHCS, 27 (2010), 562--579.",
      "doi": ""
    },
    {
      "text": "Millen, D. Rapid ethnography: Time deepening strategies for the HCI field. Proc. DIS'00, ACM Press (2000), 280--286.  ",
      "doi": "10.1145/347642.347763"
    },
    {
      "text": "Müller, J., Walter, R., Bailly, G., Nischt, M., and Alt, F. Looking glass: A field study on noticing interactivity of a shop window. Proc. CHI'12, ACM Press (2012), 297-  ",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "Müller, J., Wilmsmann, D., Exeler, J., Buzeck, M., Schmidt, A., Jay, T. and Krueger, A. Display blindness: The effect of expectations on attention towards digital signage. Proc Pervasive'09 (2009), 1--8.  ",
      "doi": "10.1007/978-3-642-01516-8_1"
    },
    {
      "text": "O'Hara, K., Glancey, M. and Robertshaw, S. Collective play in an urban screen game. Proc. CSCW '08, ACM Press (2008), 67--75.  ",
      "doi": "10.1145/1460563.1460576"
    },
    {
      "text": "Peltonen, P ., Kurvinen, E., Salovaara, A., Jacucci, G., Ilmonen, T., Evans, J., Oulasvirta, A., Saarikko, P. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city center. Proc. CHI '08, ACM Press (2008), 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Scupelli, P. G., Xiao, Y., Fussell, S. R., Kiesler, S., and Gross, M. D. Supporting coordination in surgical suites: Physical aspects of common information spaces. Proc. CHI '10. ACM Press (2010), 1777--1786.  ",
      "doi": "10.1145/1753326.1753593"
    },
    {
      "text": "Ten Koppel, M., Bailly, G., Müller, J., and Walter, R. 2012. Chained displays: Configurations of public displays can be used to influence actor-, audience-, and passer-by behavior. Proc. CHI '12. ACM Press (2012), 317--326  ",
      "doi": "10.1145/2207676.2207720"
    }
  ]
}