{
  "doi": "10.1145/2470654.2466187",
  "title": "HACHIStack: dual-layer photo touch sensing for haptic and auditory tapping interaction",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1411-1420",
  "year": 2013,
  "badges": [],
  "abstract": "We present a novel photo touch sensing architecture, HACHIStack. It can measure the approaching velocity of an object and predict its contact time with the touch screen using two optical sensing layers above the surface. The photo sensing layers form three unique capabilities: high-speed sampling, velocity acquisition, and contact time prediction. This work quantitatively examines these capabilities through two laboratory experiments, and confirms that the capabilities of HACHIStack are sufficient for multimodal interaction, in particular, touch-based interaction with haptic enhancement. We then present three applications with HACHIStack: 1) chromatic percussions (xylophone and glockenspiel) with haptic feedback; 2) no-delay haptic feedback with the sensation of tapping on various simulated materials (e.g., rubber, wood and aluminum); and 3) a virtual piano instrument that allows players to perform weak and strong strokes by changing the tapping velocity.",
  "authors": [
    {
      "name": "Taku Hachisu",
      "institution": "The University of Electro-Communications, Choufu, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482659894",
      "orcid": "missing"
    },
    {
      "name": "Hiroyuki Kajimoto",
      "institution": "The University of Electro-Communications, Choufu, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131163",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelstein, B. D., Begault, D. R., Anderson M. R. and Wenzel, E. M. Sensitivity to haptic-auditory asynchrony. In Proc. ICMI 2003, ACM Press (2003), 73--76.  ",
      "doi": "10.1145/958432.958448"
    },
    {
      "text": "Annett, M., Grossman, T., Wigdor, D. and Fitzmaurice, G. Medusa: a proximity-aware multi-touch tabletop. In Proc. UIST 2011, ACM Press (2011), 337--346.  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Bau, O., Poupyrev, I., Israr, A. and Harrison, C. Teslatouch: electrovibration for touch surfaces. In Proc. UIST 2010, ACM Press (2010), 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Benko, H. Beyond flat surface computing: challenges of depth-aware and curved interfaces. In Proc. MM 2009, ACM Press (2009), 935--944.  ",
      "doi": "10.1145/1631272.1631462"
    },
    {
      "text": "Benko, H., Ishak, E. W. and Feiner, S. Cross-dimensional gestural interaction techniques for hybrid immersive environments. In Proc. IEEE Conference on Virtual Reality, IEEE (2005), 209--216.  ",
      "doi": "10.1109/VR.2005.27"
    },
    {
      "text": "Benko, H., Jota, R. and Wilson, A. D. MirageTable: freehand interaction on a projected augmented reality table top. In Proc. CHI 2012, ACM Press (2012), 199--208.  ",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "Benko, H. and Wilson, A. DepthTouch: using depth-sensing camera to enable freehand interactions on and above the interactive surface. Microsoft Research Technical Report MSR-TR-2009-23, Microsoft (2009).",
      "doi": ""
    },
    {
      "text": "Butler, A., Izadi, S. and Hodges, S. SideSight: multi\"touch\" interaction around small devices. In Proc. UIST 2008, ACM Press (2008), 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Cutler, L. D., Fröhlich, B. and Hanrahan, P. Two-handed direct Manipulation on the responsive workbench. In Proc. I3D 1997, ACM Press (1997), 107--114.  ",
      "doi": "10.1145/253284.253315"
    },
    {
      "text": "Echtler, F., Pototsching, T. and Klinker, G. An LED-based multitouch sensor for LCD screens. In Proc. TEI 2010, ACM Press (2010), 227--230.  ",
      "doi": "10.1145/1709886.1709930"
    },
    {
      "text": "Fiene, J. P. and Kuchenbecker, K. J. Shaping event-based haptic transients via an improved understanding of real contact dynamics. In Proc. IEEE World Haptics Conference 2007, IEEE (2007), 170--175.  ",
      "doi": "10.1109/WHC.2007.102"
    },
    {
      "text": "Fukumoto, M. and Sugimura, T. Active Click: tactile feedback for touch panels. Ext. Abstracts CHI 2001, ACM Press (2001), 121--122.  ",
      "doi": "10.1145/634067.634141"
    },
    {
      "text": "Grossman, T., Hinckley, K., Baudisch, P., Agrawala, M. and Balakrishnan. Hover Widgets: using the tracking state to extend the capabilities of pen-operated devices. In Proc. CHI 2006, ACM Press (2006), 861--870.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Hachisu, T., Cirio, G., Marchal, M., Lécuyer, A. and Kajimoto, H. Virtual chromatic percussions simulated by pseudo-haptic and vibrotactile feedback. In Proc. ACE 2011, ACM Press (2011), 20.  ",
      "doi": "10.1145/2071423.2071448"
    },
    {
      "text": "Hachisu, T., Sato, M., Fukushima, S. and Kajimoto, H. HaCHIStick: simulating haptic sensation on tablet PC for musical instruments application. In Proc. UIST 2011, ACM Press (2011), 73--74.  ",
      "doi": "10.1145/2046396.2046429"
    },
    {
      "text": "Hachisu, T., Sato, M., Fukushima, S. and Kajimoto, H. Augmentation of material property by modulating vibration resulting from tapping. EuroHaptics 2012 Part 1, Springer (2012), 173--180.  ",
      "doi": "10.1007/978-3-642-31401-8_16"
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. UIST 2005, ACM Press (2005), 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Harrison, C. Benko, H. and Wilson, A. D. OmniTouch: wearable multitouch interaction everywhere. In Proc. UIST 2011, ACM Press (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Harrison, C. and Hudson, S. E. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proc. UIST 2009, ACM Press (2009), 121--124.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Hilliges, O., Izadi, S., Wilson, A. D., Hodges, S., Garcia-Mendoza, A. and Butz, A. Interactions in the air: adding further depth to interactive tabletops. In Proc. UIST 2009, ACM Press (2009), 139--148.  ",
      "doi": "10.1145/1622176.1622203"
    },
    {
      "text": "Hirsch, M., Lanman, D., Holtzman, H. and Raskar, R. BiDi screen: a thin, depth-sensing LCD for 3D interaction using light fields. In Proc. SIGGRAPH Asia 2009, ACM Press (2009), 1--9.  ",
      "doi": "10.1145/1661412.1618505"
    },
    {
      "text": "Hodges, S., Izadi, S., Butler, A., Rrustemi, A. and Buxton, B. ThinSight: versatile multi-touch sensing for thin form-factor display. In Proc. UIST 2007, ACM Press (2007), 259--268.  ",
      "doi": "10.1145/1294211.1294258"
    },
    {
      "text": "Hofer, R., Nadff, D. and Kunz, A. FLATIR: FTIR multi-touch detection on a discrete distributed sensor array. In Proc. TEI 2009, ACM Press (2009), 317--322.  ",
      "doi": "10.1145/1517664.1517730"
    },
    {
      "text": "Izadi, S., Hodges, S., Taylor, S., Rosenfeld, D., Villar, N., Butler, A. and Westhues, J. Going beyond the display: a surface technology with an electronically switchable diffuser. In Proc. UIST 2008, ACM Press (2008), 269--278.  ",
      "doi": "10.1145/1449715.1449760"
    },
    {
      "text": "Janasen, Y., Karrer, T. and Borchers, J. MudPad: tactile feedback and haptic texture overlay for touch surfaces. In Proc. ITS 2010, ACM Press (2010), 11--14.  ",
      "doi": "10.1145/1936652.1936655"
    },
    {
      "text": "Kratz, S. and Rohs, M. HoverFlow: expanding the design space of around-device interaction. In Proc. MobileHCI 2009, ACM Press (2009), Article No. 4.  ",
      "doi": "10.1145/1613858.1613864"
    },
    {
      "text": "Kyung, K. U. and Lee, J. Y. Ubi-Pen: a haptic interface with texture and vibrotactile display. IEEE Computer Graphics and Applications 29, 1 (2009), 56--64.  ",
      "doi": "10.5555/1669271.1669278"
    },
    {
      "text": "LaMotte, R. H. Softness discrimination with a tool. J. Neurophysiology 83 (2000), 1777--1786.",
      "doi": ""
    },
    {
      "text": "Lee, J. C., Dietz, P. H., Leigh, D., Yerazunis, W. S. and Hudson, S. E. Haptic Pen: a tactile feedback stylus for touch screens. In Proc. of UIST 2004, ACM Press (2004), 291--294.  ",
      "doi": "10.1145/1029632.1029682"
    },
    {
      "text": "Lylykangas, J., Surakka, V., Salminen K., Raisamo, J., Laitinen, P., Roning, K. and Raisamo, R. Designing tactile feedback for piezo buttons. In Proc. CHI 2011, ACM Press (2011), 3281--3284.  ",
      "doi": "10.1145/1978942.1979428"
    },
    {
      "text": "Mäki-Patola, T. and Hamalainen, P. Latency tolerance for gesture controlled continuous sound instrument without tactile feedback. In Proc. ICMC 2004 (2004).",
      "doi": ""
    },
    {
      "text": "Malik, S. and Laszlo, J. Visual touchpad: a two-handed gestural input device. In Proc. ICMI 2004, ACM Press (2004), 289--296.  ",
      "doi": "10.1145/1027933.1027980"
    },
    {
      "text": "Matsushita, N. and Rekimoto, J. HoloWall: designing a finger, hand, body, and object sensitive wall. In Proc. UIST 1997, ACM Press (1997), 209--210.  ",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "Moeller, J. and Kerne, A. ZeroTouch: an optical multitouch and free-air interaction architecture. In Proc. CHI 2012, ACM Press (2012), 2165--2174.  ",
      "doi": "10.1145/2207676.2208368"
    },
    {
      "text": "Ng, A., Lepinski, J., Wigdor, D., Sanders, S. and Dietz, P. Designing for Low-Latency Direct-Touch Input. In Proc. UIST 2012, ACM Press (2012), 453--464.  ",
      "doi": "10.1145/2380116.2380174"
    },
    {
      "text": "Ohnishi, H. and Mochizuki, K. Effect of delay of feedback force on perception of elastic force: a psychophysical approach. IEICE Transactions on Communications E90-B(1) (2007), 12--20.",
      "doi": ""
    },
    {
      "text": "Okamura, A. M., Cutkosky, M. and Dennerlein, J. Reality based models for vibration feedback in virtual environments. IEEE/ASME Transactions on Mechatronics 6 (2001), 245--252.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In Proc. CHI 2002, ACM Press (2002), 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Saga, S. and Deguchi, K. Lateral-force-based 2.5-dimensional tactile display for touch screen. In Proc. Haptics Symposium 2012, IEEE (2012), 15--22.",
      "doi": ""
    },
    {
      "text": "Samsung. SUR40 for Microsoft Surface 2.0. http://www.samsunglfd.com/product/feature.do?modelCd=SUR40.",
      "doi": ""
    },
    {
      "text": "Starner, T., Leibe, B., Minnen, D., Westeyn, T., Hurst, A. and Weeks, J. The perceptive workbench: computer-vision-based gesture tracking, object tracking, and 3D reconstruction for augmented desks. Machine Vision and Applications 14, Springer (2003), 59--71.",
      "doi": ""
    },
    {
      "text": "Subramanian, S., Aliakseyeu, D. and Lucero, A. Multilayer interaction for digital tables. In Proc. UIST 2006, ACM Press (2006), 296--272.  ",
      "doi": "10.1145/1166253.1166295"
    },
    {
      "text": "Tactus Technology, Inc. Taking touch screen interfaces into a new dimension. A Tactus Technology White Paper (2012).",
      "doi": ""
    },
    {
      "text": "Takeoka, Y., Miyaki, T. and Rekimoto, J. Z-Touch: an infrastructure for 3D gesture interaction in the proximity of tabletop surface. In Proc. ITS 2010, ACM Press (2010), 91--94.  ",
      "doi": "10.1145/1936652.1936668"
    },
    {
      "text": "Wellman, P. and Howe, R. D. Towards realistic display in virtual environments. In Proc. ASME Dynamic Systems and Control Division 57, ASME (1995), 713--718.",
      "doi": ""
    },
    {
      "text": "Wigdor, D., Forlines, C., Baudisch, P., Barnwell, J. and Shen, C. LucidTouch: a see-through mobile device. In Proc. UIST 2007, ACM Press (2007), 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Wintergerst, G., Jagodzinski, R., Fabian, H., Müller, A. and Joost, G. Reflective haptics: enhancing stylus-based interactions on touch screens. EuroHaptics 2010 Part 1, Springer (2010), 360--366. ",
      "doi": "10.5555/1884164.1884219"
    },
    {
      "text": "Wilson, A. TouchLight: an imaging touch screen and display for gesture-based interaction. In Proc. ICMI 2004, ACM Press (2004), 69--76.  ",
      "doi": "10.1145/1027933.1027946"
    },
    {
      "text": "Wilson, A. D. Using a depth camera as a touch sensor. In Proc. ITS 2010, ACM Press (2010), 69--72.  ",
      "doi": "10.1145/1936652.1936665"
    },
    {
      "text": "Wilson, A. and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. UIST 2010, ACM Press (2010), 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Zampini, M., Brown, T., Shore, D. I., Maravita, A., Röder, B. and Spence, C. Audiotactile temporal order judgments. Acta Psychologica 118 (2005), 277--291.",
      "doi": ""
    }
  ]
}