{
  "doi": "10.1145/2470654.2466171",
  "title": "MotionMA: motion modelling and analysis by demonstration",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1309-1318",
  "year": 2013,
  "badges": [],
  "abstract": "Particularly in sports or physical rehabilitation, users have to perform body movements in a specific manner for the exercises to be most effective. It remains a challenge for experts to specify how to perform such movements so that an automated system can analyse further performances of it. In a user study with 10 participants we show that experts' explicit estimates do not correspond to their performances. To address this issue we present MotionMA, a system that: (1) automatically extracts a model of movements demonstrated by one user, e.g. a trainer, (2) assesses the performance of other users repeating this movement in real time, and (3) provides real-time feedback on how to improve their performance. We evaluated the system in a second study in which 10 other participants used the system to demonstrate arbitrary movements. Our results demonstrate that MotionMA is able to extract an accurate movement model to spot mistakes and variations in movement execution.",
  "authors": [
    {
      "name": "Eduardo Velloso",
      "institution": "Lancaster University, Lancaster, Lancashire, UK",
      "img": "/do/10.1145/contrib-81488669445/rel-imgonly/profilepic.jpg",
      "acmid": "81488669445",
      "orcid": "0000-0003-4414-2249"
    },
    {
      "name": "Andreas Bulling",
      "institution": "Max Planck Institute for Informatics, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-81372593219/rel-imgonly/portraet_cut.jpg",
      "acmid": "81372593219",
      "orcid": "0000-0001-6317-7303"
    },
    {
      "name": "Hans Gellersen",
      "institution": "Lancaster University, Lancaster, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616827",
      "orcid": "0000-0003-2233-2121"
    }
  ],
  "references": [
    {
      "text": "Bannach, D., Lukowicz, P., and Amft, O. Rapid prototyping of activity recognition applications. Pervasive Computing, IEEE 7, 2 (2008), 22--31.  ",
      "doi": "10.1109/MPRV.2008.36"
    },
    {
      "text": "Calinon, S. Robot programming by demonstration. CRC, 2009. ",
      "doi": "10.5555/1795482"
    },
    {
      "text": "Chang, K., Chen, M., and Canny, J. Tracking free-weight exercises. In Proc. of the 9th International Conference on Ubiquitous Computing, Springer-Verlag (2007), 19--37. ",
      "doi": "10.5555/1771592.1771594"
    },
    {
      "text": "Chang, Y., Chen, S., and Huang, J. A kinect-based system for physical rehabilitation: A pilot study for young adults with motor disabilities. Research in developmental disabilities (2011).",
      "doi": ""
    },
    {
      "text": "Cypher, A., and Halbert, D. Watch what I do: programming by demonstration. 1993. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Cypher, A., and Smith, D. Kidsim: end user programming of simulations. In Proc. of the SIGCHI conference on Human factors in computing systems (1995), 27--34.  ",
      "doi": "10.1145/223904.223908"
    },
    {
      "text": "Dey, A., Hamid, R., Beckmann, C., Li, I., and Hsu, D. a cappella: programming by demonstration of context-aware applications. In Proc. of the SIGCHI conference on Human factors in computing systems (2004), 33--40.  ",
      "doi": "10.1145/985692.985697"
    },
    {
      "text": "Floyd, R., and Thompson, C. Manual of Structural Kinesiology. McGraw-Hill Companies, Incorporated, 2011.",
      "doi": ""
    },
    {
      "text": "Halbert, D. Programming by example. PhD thesis, University of California, Berkeley, 1984. ",
      "doi": "10.5555/911909"
    },
    {
      "text": "Huang, W., and Alem, L. Supporting hand gestures in mobile remote collaboration: a usability evaluation. In Proc. of the 25th BCS Conference on Human-Computer Interaction (2011), 211--216. ",
      "doi": "10.5555/2305316.2305356"
    },
    {
      "text": "Jeong, I.-W., Seo, Y.-H., and Yang, H. S. Effective humanoid motion generation based on programming-by-demonstration method for entertainment robotics. In Proc. of the 16th International Conference on Virtual Systems and Multimedia (oct. 2010), 289--292.",
      "doi": ""
    },
    {
      "text": "Kirk, D., Rodden, T., and Fraser, D. Turn it this way: grounding collaborative action with remote gestures. In Proc. of the SIGCHI conference on Human factors in computing systems (2007), 1039--1048.  ",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "Kurillo, G., Bajcsy, R., Nahrsted, K., and Kreylos, O. Immersive 3d environment for remote collaboration and training of physical activities. In Proc. of the Virtual Reality Conference (2008), 269--270.",
      "doi": ""
    },
    {
      "text": "Lieberman, H. Your wish is my command: Programming by example. Morgan Kaufmann, 2001.",
      "doi": "10.5555/369505.369520"
    },
    {
      "text": "Lu, H., and Li, Y. Gesture coder: A tool for programming multi-touch gestures by demonstration. In Proc. CHI (2012).  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Martin, C., Burkert, D., Choi, K., Wieczorek, N., McGregor, P., Herrmann, R., and Beling, P. A real-time ergonomic monitoring system using the microsoft kinect. In Proc. of Systems and Information Design Symposium (2012), 50--55.",
      "doi": ""
    },
    {
      "text": "Moeller, A., Roalter, L., Diewald, S., Kranz, M., Hammerla, N., Olivier, P., and Ploetz, T. Gymskill: A personal trainer for physical exercises. In Proc. of the International Conference on Pervasive Computing and Communications (2012).",
      "doi": ""
    },
    {
      "text": "Nundy, S., Lotto, B., Coppola, D., Shimpi, A., and Purves, D. Why are angles misperceived? Proc. of the National Academy of Sciences 97, 10 (2000), 5592.",
      "doi": ""
    },
    {
      "text": "Raffle, H. Topobo: programming by example to create complex behaviors. In Proc. of the 9th International Conference of the Learning Sciences-Volume 2, International Society of the Learning Sciences (2010), 126--127. ",
      "doi": "10.5555/1854509.1854565"
    },
    {
      "text": "Skoglund, A., Iliev, B., and Palm, R. Programming-by-demonstration of reaching motions - a next-state-planner approach. Robotics and Autonomous Systems 58, 5 (2010), 607--621.  ",
      "doi": "10.1016/j.robot.2009.12.003"
    }
  ]
}