{
  "doi": "10.1145/2470654.2466262",
  "title": "Fighting against the wall: social media use by political activists in a Palestinian village",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1979-1988",
  "year": 2013,
  "badges": [],
  "abstract": "We analyze practices of political activists in a Palestinian village located in the West Bank. Activists organize weekly demonstrations against Israel's settlement policy and the separation wall. Over a period of 28 months, we conducted a field study consisting of eight days 'on the ground' observation and interviewing, and extensive monitoring of Internet communication. We describe the activists' background and their efforts to organize these demonstrations under conditions of military occupation. Over time, we observe the role both digital and material factors play in the organization of protest. Specifically, we analyze how Email and Facebook were appropriated to facilitate interaction 'on the ground'.",
  "tags": [
    "political protest",
    "field study",
    "social media",
    "appropriation"
  ],
  "authors": [
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    },
    {
      "name": "Konstantin Aal",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-81557694656/rel-imgonly/konstantin_aal_jpg.jpg",
      "acmid": "81557694656",
      "orcid": "missing"
    },
    {
      "name": "Ibrahim Abu Kteish",
      "institution": "Birzeit University, Birzeit, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558432256",
      "orcid": "missing"
    },
    {
      "name": "Meryem Atam",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553959856",
      "orcid": "missing"
    },
    {
      "name": "Kai Schubert",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100295733",
      "orcid": "missing"
    },
    {
      "name": "Markus Rohde",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-81100112472/rel-imgonly/rohde_foto.jpg",
      "acmid": "81100112472",
      "orcid": "missing"
    },
    {
      "name": "George P. Yerousis",
      "institution": "Birzeit University, Birzeit, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557004956",
      "orcid": "missing"
    },
    {
      "name": "David Randall",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659489828",
      "orcid": "0000-0001-8613-3477"
    }
  ],
  "references": [
    {
      "text": "Al-Ani, B.; Mark, G.; Chung, J.; Jones, J. 2012 The Egyptian Blogosphere: A Counter-Narrative of the Revolution, in: Proc. of CSCW, ACM Press, 17--26  ",
      "doi": "10.1145/2145204.2145213"
    },
    {
      "text": "Anderson, L.: Demystifying the Arab Spring, in: Foreign Affairs, Vol. 90, No 3, 2011, 2--7",
      "doi": ""
    },
    {
      "text": "Aouragh, M. 2011. Palestine Online. Transnationalism, the Internet and Construction of Identity. I.B. Tauris, London, UK",
      "doi": ""
    },
    {
      "text": "Barak-Erez, D. 2006. Israel: The security barrier between international law, constitutional law, and domestic judicial review, in: International Journal of Constitutional Law, 4 (3)",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2006. Implications for Design. Proceedings of CHI'06. ACM Press  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Geertz, C. 1977. The Interpretation of Cultures. New York: Basic Books",
      "doi": ""
    },
    {
      "text": "Ghonim, W. 2012. Revolution 2.0 - A Memoir from the Heart of The Arab Spring, Fourth Estate",
      "doi": ""
    },
    {
      "text": "International Court of Justice: \"Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory\"; www.icj-cij.org/docket/files/131/1671.pdf (download on Sept., 15, 2012)",
      "doi": ""
    },
    {
      "text": "Internet World Stats: Internet Usage in the Middle East. http://internetworldstats.com/stats5.htm",
      "doi": ""
    },
    {
      "text": "Kavanaugh, A., et al.: Between a Rock and a Cell Phone: Communication and Information Use during the Egyptian Uprising, in: Proceedings of Proceedings of ISCRAM Conference -- Vancouver, Canada, April 2012",
      "doi": ""
    },
    {
      "text": "Khoury-Machool, M. 2007. Palestinian Youth and Political Activism: the emerging Internet culture and new modes of resistance, in: Policy Futures in Education 5, 1, 17--36",
      "doi": ""
    },
    {
      "text": "Kitschelt, H. 1986. Political opportunity structures and political protest: anti-nuclear movements in four democracies, British Journal of Political Science 16, 57--85.",
      "doi": ""
    },
    {
      "text": "Lotan, G., Graeff, E., Ananny, M., Gaffney, D., Pearce, I. & Boyd, D. 2011. The revolutions were tweeted:Information flows during the 2011 Tunisian and Egyptian revolutions. International Journal of Communication, 5, 1375--1405",
      "doi": ""
    },
    {
      "text": "Marcus, G. 1998. Ethnography Through Thick and Thin. Princeton University Press",
      "doi": ""
    },
    {
      "text": "Mark, G.; Semaan, B.: Expanding a Country's Borders During War: The Internet War Diary, in: IWIC'09, February 20-21, 2009, Palo Alto, CA, USA 2009  ",
      "doi": "10.1145/1499224.1499228"
    },
    {
      "text": "Mark, G., Bagdouri, M., Palen, L., Martin, J. H., Al-Ani, B. and Anderson, K. M. 2012. Blogs as a collective war diary. In: Proc. of CSCW, ACM Press, 37--46  ",
      "doi": "10.1145/2145204.2145215"
    },
    {
      "text": "Randall, D., Harper, R. and Rouncefiled, M. 2007. Filedwork for Design. Berlin, Springer",
      "doi": ""
    },
    {
      "text": "Saeed, S.; Rohde, M.; Wulf, V. 2011.Analyzing Political Activists' Organization Practices. Findings from a Long Term Case Study of the European Social Forum, in: Journal of Collaborative Computing (JCSCW), Vol. 20, No. 4-5. 265--304  ",
      "doi": "10.1007/s10606-011-9144-0"
    },
    {
      "text": "Semaan, B., Mark, G. 2011. Creating a Context of Trust with ICTs: Restoring a Sense of Normalcy in the Environment, in: Proc. of CSCW, ACM Press  ",
      "doi": "10.1145/1958824.1958863"
    },
    {
      "text": "Starbird, K.; Palen, L. 2012. (How) Will the Revolution be Retweeted? in: Proc. of CSCW, ACM Press, 7--16  ",
      "doi": "10.1145/2145204.2145212"
    },
    {
      "text": "Stevens, G; Veith, M.; Wulf, V. 2005. Bridging among Ethnic Communities by Cross-cultural Communities of Practice, in: Proceedings of the Second International Conference on Communities and Technologies. Springer Dordrecht 2005, 377--396",
      "doi": ""
    },
    {
      "text": "Tawil-Souri, H. 2009. New Palestinian Centers: An ethnography of the `checkpoint economy'. Journal of Cultural Studies 12. London: Sage",
      "doi": ""
    },
    {
      "text": "Winch, P. 1958. The idea of a Social Science and its Relation to Philosophy. London: Routledge and Kegan Paul.",
      "doi": ""
    },
    {
      "text": "Wulf, V.; Misaki, K.; Atam, M.; Randall, D.; Rohde, M. 2013. \"On the Ground\" in Sidi Bouzid: Investigating Social Media Use during the Tunisian Revolution, in Proc. of CSCW, ACM Press, in press  ",
      "doi": "10.1145/2441776.2441935"
    }
  ]
}