{
  "doi": "10.1145/2470654.2466112",
  "title": "IllumiRoom: peripheral projected illusions for interactive experiences",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "869-878",
  "year": 2013,
  "badges": [
    "Best Paper"
  ],
  "abstract": "IllumiRoom is a proof-of-concept system that augments the area surrounding a television with projected visualizations to enhance traditional gaming experiences. We investigate how projected visualizations in the periphery can negate, include, or augment the existing physical environment and complement the content displayed on the television screen. Peripheral projected illusions can change the appearance of the room, induce apparent motion, extend the field of view, and enable entirely new physical gaming experiences. Our system is entirely self-calibrating and is designed to work in any room. We present a detailed exploration of the design space of peripheral projected illusions and we demonstrate ways to trigger and drive such illusions from gaming content. We also contribute specific feedback from two groups of target users (10 gamers and 15 game designers); providing insights for enhancing game experiences through peripheral projected illusions.",
  "tags": [
    "immersion",
    "gaming",
    "augmented reality",
    "spatial augmented reality",
    "apparent motion",
    "projection mapping"
  ],
  "authors": [
    {
      "name": "Brett R. Jones",
      "institution": "Microsoft Research & University of Illinois at Urbana-Champaign, Urbana, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558345456",
      "orcid": "missing"
    },
    {
      "name": "Hrvoje Benko",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81100182346/rel-imgonly/81100182346.jpg",
      "acmid": "81100182346",
      "orcid": "0000-0002-2059-3558"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Andrew D. Wilson",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    }
  ],
  "references": [
    {
      "text": "Aides, A., Avraham, T., and Schechner, Y.Y. Multiscale Ultrawide Foveated Video Extrapolation. IEEE ICCP, (2011).",
      "doi": ""
    },
    {
      "text": "Batlle, J., Mouaddib, E., and Salvi, J. Recent progress in coded structured light as a technique to solve the correspondence problem: a survey. Pattern recognition 31, 7 (1998), 963--982.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Good, N., and Stewart, P. Focus Plus Context Screens: Combining Display Technology with Visualization Techniques. ACM UIST, (2001).  ",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Benko, H., Jota, R., and Wilson, A. MirageTable: Freehand Interaction on a Projected Augmented Reality Tabletop. ACM CHI, (2012).  ",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "Bimber, O., Coriand, F., Kleppe, A., Bruns, E., Zollmann, S., and Langlotz, T. Superimposing pictorial artwork with projected imagery. IEEE Multimedia 12, 1 (2005), 16--26.  ",
      "doi": "10.1109/MMUL.2005.9"
    },
    {
      "text": "Bimber, O., Emmerling, A., and Klemmer, T. Embedded entertainment with smart projectors. IEEE Computer 38, 1 (2005), 16--26.  ",
      "doi": "10.1109/MC.2005.17"
    },
    {
      "text": "Bimber, O. and Iwai, D. Superimposing dynamic range. ACM Trans. on Graphics 27, 5 (2008).  ",
      "doi": "10.1145/1409060.1409103"
    },
    {
      "text": "Bimber, O. and Raskar, R. Spatial augmented reality: Merging real and virtual worlds. AK Peters Ltd, 2005. ",
      "doi": "10.5555/1088894"
    },
    {
      "text": "Cockburn, A., Karlson, A., and Bederson, B.B. A review of overview+detail, zooming, and focus+context interfaces. ACM Computing Surveys 41, 1 (2008), 1--31.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Cruz-Neira, C., Sandin, D.J., and Defanti, T.A. SurroundScreen Projection-Based Virtual Reality: The Design and Implementation of the CAVE. SIGGRAPH, (1993).  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Flagg, M. and Rehg, J.M. Projector-Guided Painting. ACM UIST, (2006).  ",
      "doi": "10.1145/1166253.1166290"
    },
    {
      "text": "Gibson, J.J. The Perception of the Visual World. Boston: Houghton Mifflin, 1950.",
      "doi": ""
    },
    {
      "text": "Henderson, J. Human gaze control during real-world scene perception. Trends in Cognitive Sciences 7, 11 (2003).",
      "doi": ""
    },
    {
      "text": "Hou, J., Nam, Y., Peng, W., and Lee, K.M. Effects of screen size, viewing angle, and players' immersion tendencies on game experience. Computers in Human Behavior 28, 2 (2012), 617--623.  ",
      "doi": "10.1016/j.chb.2011.11.007"
    },
    {
      "text": "Jones, B., Sodhi, R., Campbell, R., Garnett, G., and Bailey, B.P. Build Your World and Play In It: Interacting with Surface Particles on Complex Objects. IEEE ISMAR, (2010).",
      "doi": ""
    },
    {
      "text": "Kennedy, R.S., Lane, N.E., Kevin, S., and Lilienthal, M.G. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. Aviation Psychology 3, 3 (1993), 203--220.",
      "doi": ""
    },
    {
      "text": "Milgram, P., Takemura, H., Utsumi, A., and Kishino, F. Augmented Reality: A class of displays on the realityvirtuality continuum. Telemanipulator and Telepresence Technologies 2351, (1994).",
      "doi": ""
    },
    {
      "text": "Mine, M., Rose, D., Yang, B., Jeroen van Baar, and Grundhöfer, A. Projection-Based Augmented Reality in Disney Theme Parks. IEEE Computer 45, 7 (2012), 32--40.  ",
      "doi": "10.1109/MC.2012.154"
    },
    {
      "text": "Novy, D. and Jr., V.M.B. Infinity-by-nine. http://obm.media.mit.edu/, (2012).",
      "doi": ""
    },
    {
      "text": "Pinhanez, C. The Everywhere Displays Projector: A Device to Create Ubiquitous Graphical Interfaces. ACM UbiComp, (2001). ",
      "doi": "10.5555/647987.741324"
    },
    {
      "text": "Projection Mapping Central. www.projection-mapping.org. .",
      "doi": ""
    },
    {
      "text": "Quirk, P., Johnson, T., Skarbez, R., Towles, H., Gyarfas, F., and Fuchs, H. RANSAC-Assisted Display Model Reconstruction for Projective Display. IEEE VR, (2006).  ",
      "doi": "10.1109/VR.2006.115"
    },
    {
      "text": "Raskar, R., Welch, G., Cutts, M., Lake, A., Stesin, L., and Fuchs, H. The Office of the Future: A Unified Approach to Image-Based Modeling and Spatially Immersive Displays. ACM SIGGRAPH, (1998).  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Raskar, R., Welch, G., Low, K.L.K., and Bandyopadhyay, D. Shader lamps: Animating real objects with image-based illumination. Eurographics Workshop on Rendering Techniques, (2001), 89.  ",
      "doi": "10.5555/2383696.2383708"
    },
    {
      "text": "Raskar, R., Ziegler, R., and Willwacher, T. Cartoon dioramas in motion. ACM NPAR, (2002), 7.  ",
      "doi": "10.1145/508530.508532"
    },
    {
      "text": "Schild, J., Laviola, J.J., and Masuch, M. Understanding User Experience in Stereoscopic 3D Games. ACM CHI, (2012).  ",
      "doi": "10.1145/2207676.2207690"
    },
    {
      "text": "Sekular, R. and Blake, R. Perception, 2nd Edition. 1990.",
      "doi": ""
    },
    {
      "text": "Tan, D.S., Gergle, D., Scupelli, P., and Pausch, R. With similar visual angles, larger displays improve spatial performance. ACM CHI, (2003).  ",
      "doi": "10.1145/642611.642650"
    },
    {
      "text": "Weffers-Albu, a., De Waele, S., Hoogenstraaten, W., and Kwisthout, C. Immersive TV Viewing with Advanced Ambilight. IEEE ICCE, (2011), 753--754.",
      "doi": ""
    },
    {
      "text": "Wilson, A., Benko, H., Izadi, S., and Hilliges, O. Steerable Augmented Reality with the Beamatron. ACM UIST, (2012).  ",
      "doi": "10.1145/2380116.2380169"
    }
  ]
}