{
  "doi": "10.1145/2470654.2470679",
  "title": "BeThere: 3D mobile collaboration with spatial input",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "179-188",
  "year": 2013,
  "badges": [],
  "abstract": "We present BeThere, a proof-of-concept system designed to explore 3D input for mobile collaborative interactions. With BeThere, we explore 3D gestures and spatial input which allow remote users to perform a variety of virtual interactions in a local user's physical environment. Our system is completely self-contained and uses depth sensors to track the location of a user's fingers as well as to capture the 3D shape of objects in front of the sensor. We illustrate the unique capabilities of our system through a series of interactions that allow users to control and manipulate 3D virtual content. We also provide qualitative feedback from a preliminary user study which confirmed that users can complete a shared collaborative task using our system.",
  "tags": [
    "depth sensors",
    "around device interaction",
    "collaboration",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Rajinder S. Sodhi",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548021276",
      "orcid": "missing"
    },
    {
      "name": "Brett R. Jones",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558345456",
      "orcid": "missing"
    },
    {
      "name": "David Forsyth",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, USA",
      "img": "/do/10.1145/contrib-81100502370/rel-imgonly/81100502370.jpg",
      "acmid": "81100502370",
      "orcid": "missing"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    },
    {
      "name": "Giuliano Maciocci",
      "institution": "Qualcomm Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548021279",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bauer, M., and Kortuem, G. Where Are You Pointing At? A Study of Remote Collaboration in a Wearable Videoconference System. In Wearable Computers. (1999), 151--161. ",
      "doi": "10.5555/519309.856501"
    },
    {
      "text": "Benko, H., Jota, R., Wilson, A. D., and Inesc-id, V. MirageTable: Freehand Interaction on a Projected Augmented Reality Tabletop. In Proc. of CHI (2012), 199--208.  ",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "Bérard, F., Ip, J., Benovoy, M., El-Shimy, D., Blum, J., and Cooperstock, J. Did minority report get it wrong? superiority of the mouse over 3d input devices in a 3d placement task. In Proc. of INTERACT (2009), 400--414.  ",
      "doi": "10.1007/978-3-642-03658-3_45"
    },
    {
      "text": "Billinghurst, M., Cheok, A., Kato, H., and Prince, S. Real World Teleconferencing. In Proc. of CHI (1999), 194--195.  ",
      "doi": "10.1145/632716.632838"
    },
    {
      "text": "Butler, A., and Izadi, S. SideSight: multi-touch interaction around small devices. In Proc. of UIST (2008), 3--6.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Ens, B., Ahlström, D., Cockburn, A., and Irani, P. Characterizing user performance with assisted direct off-screen pointing. In Proc. of MobileHCI (2011), 485--494.  ",
      "doi": "10.1145/2037373.2037445"
    },
    {
      "text": "Fitzmaurice, G. W., Zhai, S., and Chignell, M. H. Virtual reality for palmtop computers. In Trans. on Info. Sys., vol. 11 (1993), 197--218.  ",
      "doi": "10.1145/159161.159160"
    },
    {
      "text": "Friedrich, D. W. ARVIKA: Augmented Reality for Development, Production and Service. In Proc. of ISMAR (2002), 1--2. ",
      "doi": "10.5555/850976.854993"
    },
    {
      "text": "Fussell, S., Setlock, L., Yang, J., Ou, J., and Mauer, E. Gestures Over Video Streams to Support Remote Collaboration on Physical Tasks. In Hum.-Comput. Interact. 19 (Sept. 2004), 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Gauglitz, S., Lee, C., Turk, M., and Hollerer, T. Integrating the Physical Environment into Mobile Remote Collaboration. In Proc. of Mobile HCI (2012), 241--250.  ",
      "doi": "10.1145/2371574.2371610"
    },
    {
      "text": "Gergle, D., and Clark, A. T. See What I m Saying? Using Dyadic Mobile Eye Tracking to Study Collaborative Reference. In Proc. CSCW (2011), 435--444.  ",
      "doi": "10.1145/1958824.1958892"
    },
    {
      "text": "Gurevich, P., Lanir, J., Cohen, B., and Stone, R. TeleAdvisor: a versatile augmented reality tool for remote assistance. In Proc. of CHI (2012), 619--622.  ",
      "doi": "10.1145/2207676.2207763"
    },
    {
      "text": "Gustafson, S., and Bierwirth, D. Imaginary interfaces: spatial interaction with empty hands and without visual feedback. In Proc. of UIST (2010), 3--12.  ",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Gutwin, C., and Penner, R. Improving interpretation of remote gestures with telepointer traces. Proc. of CSCW (2002), 49.  ",
      "doi": "10.1145/587078.587086"
    },
    {
      "text": "Hackenberg, G. Lightweight Palm and Finger Tracking for Real-Time 3D Gesture Control. Building, March 2010 (2011), 19--26.  ",
      "doi": "10.1109/VR.2011.5759431"
    },
    {
      "text": "Hancock, M., ten Cate, T., and Carpendale, S. Sticky tools: full 6dof force-based interaction for multi-touch tables. In Proc. of ITS, ITS '09 (2009), 133--140.  ",
      "doi": "10.1145/1731903.1731930"
    },
    {
      "text": "Harrison, C., Benko, H., Wilson, A. D., and Way, O. M. OmniTouch: Wearable multitouch interaction everywhere. In Proc. UIST (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Harrison, C., and Hudson, S. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proc. UIST (2009), 121--124.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Hilliges, O., Kim, D., Izadi, S., Weiss, M., and Wilson, A. Holodesk: direct 3d interactions with a situated see-through display. In Proc. of CHI (2012), 2421--2430.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Izadi, S. KinectFusion: Real-time 3D Reconstruction and Interaction Using a Moving Depth Camera. In Proc. of UIST (2011), 559--568.  ",
      "doi": "10.1145/2047196.2047270"
    },
    {
      "text": "Jones, B., Sodhi, R., Bailey, B., Maciocci, G., and Forsyth, D. Depth-based Around Device Interaction for Multiscale Navigation. In Proc. MobileHCI (2012), 83--92.  ",
      "doi": "10.1145/2371574.2371589"
    },
    {
      "text": "Kratz, S., and Rohs, M. HoverFlow: Expanding the Design Space of Around-Device Interaction. In MobileHCI (2009), 1--8.  ",
      "doi": "10.1145/1613858.1613864"
    },
    {
      "text": "Kratz, S., and Rohs, M. PalmSpace: Continuous Around-Device Gestures vs. Multitouch for 3D Rotation Tasks on Mobile Devices Categories and Subject Descriptors Interaction on Mobile Devices. In Proc. of AVI (2012), 181--188.  ",
      "doi": "10.1145/2254556.2254590"
    },
    {
      "text": "Li, W., Agrawala, M., Curless, B., and Salesin, D. Automated Generation of Interactive 3D Exploded View Diagrams. In Proc. of SIGGRAPH (2008), 101--107.  ",
      "doi": "10.1145/1399504.1360700"
    },
    {
      "text": "Lincoln, P., Welch, G., Nashel, A., Ilie, A., State, A., and Fuchs, H. Animatronic Shader Lamps Avatars. In Proc. of ISMAR, Ieee (Oct. 2009), 27--33.  ",
      "doi": "10.1109/ISMAR.2009.5336503"
    },
    {
      "text": "Maimone, A. A First Look at a Telepresence System with Room-Sized Real-Time 3D Capture. In Proc. ICAT (2011), 4--9.",
      "doi": ""
    },
    {
      "text": "Martinet, A., Casiez, G., and Grisoni, L. Integrality and separability of multitouch interaction techniques in 3d manipulation tasks. Trans. on Vis. and CG 18, 3 (Mar. 2012), 369--380.  ",
      "doi": "10.1109/TVCG.2011.129"
    },
    {
      "text": "Nancel, M., Wagner, J., Pietriga, E., Chapuis, O., Mackay, W., Orsay, F., and Orsay, F. Mid-air Pan-and-Zoom on Wall-sized Displays. In Proc of CHI, no. May (2011), 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "Neill, J. O., Castellani, S., Roulland, F., and Hairon, N. From Ethnographic Study to Mixed Reality: A Remote Collaborative Troubleshooting System. Proc. of CSCW (2011), 225--234.  ",
      "doi": "10.1145/1958824.1958859"
    },
    {
      "text": "Oikonomidis, I., Kyriazis, N., and Argyros, A. Efficient model-based 3D tracking of hand articulations using Kinect. Proc of the BMVC (2011), 101.1--101.11.",
      "doi": ""
    },
    {
      "text": "Ranjan, A., Birnholtz, J. P., and Balakrishnan, R. Dynamic Shared Visual Spaces: Experimenting with Automatic Camera Control in a Remote Repair Task. In Proc. of CHI (2007), 1177--1186.  ",
      "doi": "10.1145/1240624.1240802"
    },
    {
      "text": "Raskar, R., Welch, G., Cutts, M., Lake, A., Stesin, L., and Fuchs, H. The office of the future. In Proc. SIGGRAPH (1998), 179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Reisman, J. L., Davidson, P. L., and Han, J. Y. A screen-space formulation for 2d and 3d direct manipulation. In Proc. of UIST, UIST'09 (2009), 69--78.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "Ring, M.-t. F., Ashbrook, D., Baudisch, P., White, S., Str, P.-d.-h., and Potsdam, D. Nenya: Subtle and Eyes-Free Mobile Input with a. In Proc. CHI (2011), 2043--2046.  ",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Sakong, K. Supporting telepresence by visual and physical cues in distributed 3D collaborative design environments. In Proc. CHI (2006), 1283--1288.  ",
      "doi": "10.1145/1125451.1125690"
    },
    {
      "text": "Stafford, A. Piekarski, W., and Thomas, B. Implementation of god-like interaction techniques. In Proc. of ISMAR (2006) (2006), 165--172.  ",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "Tang, J., and Minneman, S. VideoDraw: A Video Interface for Collaborative Drawing. In ACM Trans. Inf. Syst. 9 (1991), 170--184.  ",
      "doi": "10.1145/123078.128729"
    },
    {
      "text": "Wigdor, D., Forlines, C., Baudisch, P., Barnwell, J., and Shen, C. Lucid touch: a see-through mobile device. In Proc. of UIST, ACM (2007), 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Wilson, A., and Robbins, D. Playtogether: Playing games across multiple interactive tabletops. In Proc. of IUI (2006).",
      "doi": ""
    },
    {
      "text": "Wilson, A. D. Robust Computer Vision-Based Detection of Pinching for One and Two-Handed Gesture Input. In Proc of UIST (2006), 255--258.  ",
      "doi": "10.1145/1166253.1166292"
    }
  ]
}