{
  "doi": "10.1145/2470654.2481343",
  "title": "When the price is right: enabling time-dependent pricing of broadband data",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2477-2486",
  "year": 2013,
  "badges": [],
  "abstract": "In an era of 108% annual growth in demand for mobile data and $10/GB overage fees, Internet Service Providers (ISPs) are experiencing severe congestion and in turn are hurting consumers with aggressive pricing measures. But smarter practices, such as time-dependent pricing (TDP), reward users for shifting their non-critical demand to off-peak hours and can potentially benefit both users and ISPs. Although dynamic TDP ideas have existed for many years, dynamic pricing for mobile data is only now gaining interest among ISPs. Yet TDP plans require not only systems engineering but also an understanding of economic incentives, user behavior and interface design. In particular, the HCI aspects of communicating price feedback signals from the network and the response of mobile data users need to be studied in the real world. But investigating these issues by deploying a virtual TDP data plan for real ISP customers is challenging and rarely explored. To this end, we carried out the first TDP trial for mobile data in the US with 10 families. We describe the insights gained from the trial, which can help the HCI community as well as ISPs, app developers and designers create tools that empower users to better control their usage and save on their monthly bills, while also alleviating network congestion.",
  "tags": [
    "mobile application interface",
    "dynamic pricing",
    "economics",
    "broadband access pricing",
    "time- and usage-based pricing"
  ],
  "authors": [
    {
      "name": "Soumya Sen",
      "institution": "Princeton University, Princeton, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367590913",
      "orcid": "missing"
    },
    {
      "name": "Carlee Joe-Wong",
      "institution": "Princeton University, Princeton, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487655218",
      "orcid": "missing"
    },
    {
      "name": "Sangtae Ha",
      "institution": "Princeton University, Princeton, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545222056",
      "orcid": "missing"
    },
    {
      "name": "Jasika Bawa",
      "institution": "Princeton University, Princeton, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556578356",
      "orcid": "missing"
    },
    {
      "name": "Mung Chiang",
      "institution": "Princeton University, Princeton, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336488345",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chetty, M., Banks, R., Brush, A.J., Donner, J. and Grinter, R. \"You're capped!\" Understanding the effects of bandwidth caps on broadband use in the home. In Proc. CHI 2012, ACM Press (2012): 3021 -- 3030.  ",
      "doi": "10.1145/2207676.2208714"
    },
    {
      "text": "Chetty, M., Haslem, D., Baird, A., Ofoha, U., Sumner, B. and Grinter, R. Why is my Internet slow?: Making network speeds visible. In Proc. CHI 2011, ACM Press (2011): 1889 -- 1898.  ",
      "doi": "10.1145/1978942.1979217"
    },
    {
      "text": "Chetty, M., Tran, D. and Grinter, R. Getting to green: Understanding resource consumption in the home. In Proc. UbiComp 2008, ACM Press (2008): 242 -- 251.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Chetty, M., Banks, R., Harper, R., Regan, T., Sellen, A., Gkantsidis, C., Karagiannis, T. and Key, P. Who's hogging the bandwidth?: The consequences of revealing the invisible in the home. In Proc. CHI 2010, ACM Press (2010): pp. 659 -- 668.  ",
      "doi": "10.1145/1753326.1753423"
    },
    {
      "text": "Cisco, Visual Networking Index 2011 -- 2016. http://www.tinyurl.com/VNI2012.",
      "doi": ""
    },
    {
      "text": "Clark, D. D. Internet cost allocation and pricing. In Internet Economics, eds. L. W. McKnight and J. P. Bailey. MIT Press, Cambridge, MA, USA, 1997. ",
      "doi": "10.5555/267962.267973"
    },
    {
      "text": "Edell, R. J., Internet Demand Experiment: Technology and Market Trial. PhD Thesis, UC Berkeley, 2001. ",
      "doi": "10.5555/934074"
    },
    {
      "text": "Electronista Staff. Verizon preps LTE femtocells, says it hits limits in 2013. Electronista (2012), 5 March 2012.",
      "doi": ""
    },
    {
      "text": "Froelich, J., Findlater, L. and Landay, J. The design of eco-feedback technology. In Proc. CHI 2010, ACM Press (2010): 1999 -- 2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Genachowski, J. New Rules for an Open Internet. FCC (2010).",
      "doi": ""
    },
    {
      "text": "Grinter, R.E., Edwards, K. W. and Newman, M. W. The work to make a home network work. In Proc. ECSCW, Springer (2005): pp. 469 -- 488. ",
      "doi": "10.5555/1242029.1242053"
    },
    {
      "text": "Ha, S., Sen, S., Joe-Wong, C., Im, Y., and Chiang, M. TUBE: Time-dependent pricing for mobile data. In Proc. SIGCOMM, ACM Press (2012): 247 -- 258.  ",
      "doi": "10.1145/2342356.2342402"
    },
    {
      "text": "Heller, F. and Borchers, J. PowerSocket: Towards onoutlet power consumption visualization. In Ext. Abstracts CHI 2011, ACM Press (2011): 1981 -- 1986.  ",
      "doi": "10.1145/1979742.1979901"
    },
    {
      "text": "Holmes, T. Eco-visualization: Combining art and technology to reduce energy consumption. In Proc. C&C 2007, ACM Press (2007): 153 -- 162.  ",
      "doi": "10.1145/1254960.1254982"
    },
    {
      "text": "Jiang, L., Parekh, S. and Walrand, J. Time-dependent network pricing and bandwidth trading. In Proc. NOMS Workshops 2008, IEEE (2008): 193 -- 200.",
      "doi": ""
    },
    {
      "text": "Kim, T., Hong, H. and Magerko, B. Design requirements for ambient display that support sustainable lifestyle. In Proc. DIS 2010, ACM Press (2010): 103 -- 112.  ",
      "doi": "10.1145/1858171.1858192"
    },
    {
      "text": "Mortier, R., Rodden, T., Tolmie, P., Lodge, T., Spencer, R., Crabtree, A., Koliousis, A. and Sventek, J. Homework: Putting interaction into the infrastructure. In Proc. UIST, ACM Press (2012): pp. 197-- 206.  ",
      "doi": "10.1145/2380116.2380143"
    },
    {
      "text": "Newman, J. Got bandwidth caps? Netflix has you covered. Technologizer (2011), 23 June 2011.",
      "doi": ""
    },
    {
      "text": "Odlyzko, A., St. Arnaud, B., Stallman, E. and Weinberg, M. Know Your Limits: Considering the Role of Data Caps and Usage Based Billing in Internet Access Service. Public Knowledge White Paper (2012).",
      "doi": ""
    },
    {
      "text": "Petersen, D., Steele, J. and Wilkinson, J. WattBot: A residential electricity monitoring and feedback system. In Ext. Abstracts CHI, ACM Press (2009): 2847 -- 2852.  ",
      "doi": "10.1145/1520340.1520413"
    },
    {
      "text": "Pierce, J. and Paulos, E. Beyond energy monitors: Interaction, energy, and emerging energy systems. In Proc. CHI 2012, ACM Press (2012): 665 -- 674.  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "Roto, V., Geisler, R., Kaikkonen, A., Popescu, A. and Vartiainen, E. Data traffic costs and mobile browsing user experience. In Proc. Workshop on Empowering the Mobile Web, in conjunction with WWW 2006.",
      "doi": ""
    },
    {
      "text": "Sen, S., Joe-Wong, C., Ha, S., and Chiang, M. Incentivizing time-shifting of data: A survey of timedependent pricing for Internet access. IEEE Communications Magazine 50, 11 (2012), 91 -- 99.",
      "doi": ""
    },
    {
      "text": "Shih, J., Katz, R. and Joseph, A. D. Pricing experiments for a computer-telephony-service usage allocation. In Proc. GLOBECOM, IEEE (2001), pp. 2450 -- 2454.",
      "doi": ""
    },
    {
      "text": "Standage, T. The mother of invention. The Economist, Special report (2009), 24 September 2009.",
      "doi": ""
    },
    {
      "text": "Yang, J., Edwards, W. K. and Haslem, D. Eden: Supporting home network management through interactive visual tools. In Proc. UIST, ACM Press (2010): pp. 109--118.  ",
      "doi": "10.1145/1866029.1866049"
    }
  ]
}