{
  "doi": "10.1145/2470654.2481375",
  "title": "A comparative evaluation of multiple chat stream interfaces for information-intensive environments",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2717-2720",
  "year": 2013,
  "badges": [],
  "abstract": "For information workers who monitor numerous constantly updating data streams, conserving cognitive resources is crucial. This study evaluated how an interface affects information workers' ability to grasp critical information from multiple text-based chat streams under time pressure. We designed and built a working prototype that displays ten chat streams simultaneously in standard chat windows (ST) and ticker tapes (TT). We conducted a lab experiment to evaluate differences in how these two interfaces support signal and context detection. We found that with ST, participants detected significantly more target words (SAT words) with rarer frequency and significantly more context information (disaster facts) than with TT. Our results show that while TT is potentially better for overview scanning of multiple streams, ST is likely to be better for multi-tasking. Our study informs the design of future multi-chat systems so that large amounts of information can be easier to detect and process.",
  "tags": [
    "empirical study",
    "information workers",
    "interface evaluation",
    "monitoring multiple text-based streams"
  ],
  "authors": [
    {
      "name": "Yiran Wang",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659502848",
      "orcid": "missing"
    },
    {
      "name": "Andy Echenique",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593075",
      "orcid": "missing"
    },
    {
      "name": "Martin Shelton",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558085056",
      "orcid": "missing"
    },
    {
      "name": "Gloria Mark",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279599",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albrecht-Buehler, C., Watson, B. and Shamma, D. A. Visualizing Live Text Streams Using Motion and Temporal Pooling. Computer Graphics and Applications, IEEE 25, 3 (2005), 52--59.  ",
      "doi": "10.1109/MCG.2005.70"
    },
    {
      "text": "Bargh, J. A. The four horsemen of automaticity: Awareness, efficiency, attention, and control in social cognition. In R. S. Wyer and T. K. Srull (eds). Handbook of Social Cognition, Hillsdale, NJ, 1994, 1--40.",
      "doi": ""
    },
    {
      "text": "Boiney, L. G., Goodman, B., Gaimari, R., Zarrella, J., Berube, C. and Hitzeman, J. Taming Multiple Chat Room Collaboration: Real-time Visual Cues to Social Networks and Emerging Threads. In Proc. ISCRAM (2008), 660--668.",
      "doi": ""
    },
    {
      "text": "Parsowith, S., Fitzpatrick, G., Kaplan, S., Segall, B. and Boot, J. Tickertape: Notification and Communication in a Single Line. In Proc. CHI, (1998), 139--144. ",
      "doi": "10.5555/786112.786300"
    },
    {
      "text": "Roddy, B. J. and Epelman-Wang, H. Interface Issues in Text Based Chat Rooms. SIGCHI Bull. 30, 2 (1998), 119--123.  ",
      "doi": "10.1145/279044.279172"
    },
    {
      "text": "SubtlexUS: American Word Frequencies. http://subtlexus.lexique.org/",
      "doi": ""
    },
    {
      "text": "Tulving, E. and Thomson, D. M. Encoding specificity and retrieval processes in episodic memory. Psychological Review, 80 (1973), 352--373.",
      "doi": ""
    }
  ]
}