{
  "doi": "10.1145/2470654.2466182",
  "title": "How low can you go?: human limits in small unidirectional mouse movements",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1383-1386",
  "year": 2013,
  "badges": [],
  "abstract": "Computer mouse sensors keep increasing in resolution. The smallest displacement they can detect gets smaller, but little is known on our ability to control such small movements. Small target acquisition has been previously tackled, but the findings do not apply to the problem of finding the useful resolution of a user with a mouse, which corresponds to the smallest displacement (s)he can reliably produce with that device. We detail this definition and provide an associated experimental protocol to measure it. We then report on the results of a study suggesting that high-end mice are not likely to be used to their full potential. We further comment on the different strategies used by participants to acheive best performance, and derive implications for user interfaces.",
  "authors": [
    {
      "name": "Jonathan Aceituno",
      "institution": "Inria Lille, Villeneuve d'Ascq, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388598961",
      "orcid": "missing"
    },
    {
      "name": "Géry Casiez",
      "institution": "LIFL, INRIA Lille, & University of Lille, Villeneuve d'Ascq, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    },
    {
      "name": "Nicolas Roussel",
      "institution": "Inria, Villeneuve d'Ascq, France",
      "img": "/do/10.1145/contrib-81100029990/rel-imgonly/nicolas-roussel.png",
      "acmid": "81100029990",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bérard, F., Wang, G., and Cooperstock, J. R. On the limits of the human motor control precision: the search for a device's human resolution. In Proceedings of INTERACT'11, Springer-Verlag (2011), 107--122. ",
      "doi": "10.5555/2042118.2042131"
    },
    {
      "text": "Casiez, G., and Roussel, N. No more bricolage! Methods and tools to characterize, replicate and compare pointing transfer functions. In Proceedings of UIST'11, ACM (2011), 603--614.  ",
      "doi": "10.1145/2047196.2047276"
    },
    {
      "text": "Chapuis, O., and Dragicevic, P. Effects of motor scale, visual scale, and quantization on small target acquisition difficulty. ACM ToCHI 18 (2011), 13:1--13:32.  ",
      "doi": "10.1145/1993060.1993063"
    },
    {
      "text": "Guiard, Y., Beaudouin-Lafon, M., and Mottet, D. Navigation as multiscale pointing: extending Fitts' model to very high precision tasks. In Proceedings of CHI'99, ACM (1999), 450--457.  ",
      "doi": "10.1145/302979.303128"
    },
    {
      "text": "Langolf, G., Chaffin, D., and Foulke, J. An investigation of Fitts' law using a wide range of movement amplitudes. Journal of Motor Behavior 8 (1976), 113--128.",
      "doi": ""
    },
    {
      "text": "Meyer, D. E., Smith, J. E. K., Kornblum, S., Abrams, R. A., and Wright, C. E. Speed-accuracy tradeoffs in aimed movements: toward a theory of rapid voluntary action. In Attention and performance XIII. Lawrence Erlbaum, 1990, 173--226.",
      "doi": ""
    },
    {
      "text": "Ristić, L. Sensor technology and devices. Optoelectronics Library. Artech House, 1994.",
      "doi": ""
    },
    {
      "text": "Roussel, N., Casiez, G., Aceituno, J., and Vogel, D. Giving a hand to the eyes: leveraging input accuracy for subpixel interaction. In Proceedings of UIST'12 (2012), 351--358.  ",
      "doi": "10.1145/2380116.2380162"
    },
    {
      "text": "Wobbrock, J. O., Findlater, L., Gergle, D., and Higgins, J. J. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of CHI'11, ACM (2011), 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}