{
  "doi": "10.1145/2470654.2481355",
  "title": "Muscle-propelled force feedback: bringing force feedback to mobile devices",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2577-2580",
  "year": 2013,
  "badges": [],
  "abstract": "Force feedback devices resist miniaturization, because they require physical motors and mechanics. We propose mobile force feedback by eliminating motors and instead actuating the user's muscles using electrical stimulation. Without the motors, we obtain substantially smaller and more energy-efficient devices. We present a prototype that fits on the back of a mobile phone. It actuates users' forearm muscles via four electrodes, which causes users' muscles to contract involuntarily, so that they tilt the device sideways. As users resist this motion using their other arm, they perceive force feedback. We demonstrate the interaction at the example of an interactive videogame in which users steer an airplane through winds rendered using force feedback. In a first user study, we found our device to cause users to produce up to 18.7N of force, when used to actuate their palm flexors. In a second study, participants played the video game de-scribed above; all ten participants reported to prefer the experience of muscle-propelled force feedback to vibrotactile feedback.",
  "authors": [
    {
      "name": "Pedro Lopes",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81557182156/rel-imgonly/_pedrolopes_uchicago.jpg",
      "acmid": "81557182156",
      "orcid": "0000-0001-6527-7084"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Arsenault, R. and Ware, C. Eye-hand co-ordination with force feedback. Proc. CHI '00, 408--414.  ",
      "doi": "10.1145/332040.332466"
    },
    {
      "text": "Badshah, A., Gupta, S., Morris, D., Patel, S., and Tan, D. GyroTab: a handheld device that provides reactive torque feedback. Proc. CHI '12. 3153--3156.  ",
      "doi": "10.1145/2207676.2208731"
    },
    {
      "text": "Badshah, A., Gupta, S., Cohn, G., Villar, N., Hodges, S., and Patel, S. N. Interactive Generator: A Self-Powered Haptic Feedback Device. Proc. CHI'11, 2051--2054.  ",
      "doi": "10.1145/1978942.1979240"
    },
    {
      "text": "Farbiz, F., Yu, Z. H., Manders, C., and Ahmad, W. An electrical muscle stimulation haptic feedback for mixed reality tennis game. Proc. SIGGRAPH '07 (posters).  ",
      "doi": "10.1145/1280720.1280873"
    },
    {
      "text": "Gupta, S., Campbell, T., Hightower, J. R., Patel. S. N. SqueezeBlock: using virtual springs in mobile devices for eyes-free interaction. Proc. UIST '10, 101--104.  ",
      "doi": "10.1145/1866029.1866046"
    },
    {
      "text": "Holz, C., Grossman, T., Fitzmaurice, G., and Agur, A. Implanted user interfaces. Proc. CHI '12, 503--512.  ",
      "doi": "10.1145/2207676.2207745"
    },
    {
      "text": "Hemmert, F., Hamann, S., Löwe, M., Zeipelt, J., and Joost, G. Shape-Changing Mobiles: Tapering in Two-Dimensional Deformational Displays in Mobile Phones. Proc. CHI'10 Extended Abstracts, 3075--3079.  ",
      "doi": "10.1145/1753846.1753920"
    },
    {
      "text": "Hollerbach, J. and Jacobsen, S. Haptic Interfaces for Teleoperation and Virtual Environments. Proc. of First Workshop on Simulation and Interaction in Virtual Environments '95, 13--15.",
      "doi": ""
    },
    {
      "text": "Iwamoto, T., Tatezono, M., and Shinoda, H. Non Contact Method for Producing Tactile Sensation Using Airborne Ultrasound. Proc. EuroHaptics '08, 504--513.  ",
      "doi": "10.1007/978-3-540-69057-3_64"
    },
    {
      "text": "Kruijff, E., Schmalstieg, D., and Beckhaus, S. Using neuromuscular electrical stimulation for pseudo-haptic feedback. Proc. VRST '06, 316--319.  ",
      "doi": "10.1145/1180495.1180558"
    },
    {
      "text": "Murayama, J., Bougrila, L., Luo, Y., Akahane, K., Hasegawa, S., Hirsbrunner, B., Sato, M. SPIDAR G&G: a two-handed haptic interface for bimanual VR interaction. Proc. EuroHaptics '04, 138--146.",
      "doi": ""
    },
    {
      "text": "Nakagawa, Y., Kamimura, A., Kawaguchi, Y. MimicTile: a variable stiffness deformable user interface for mobile devices. Proc. CHI '12, 745--748.  ",
      "doi": "10.1145/2207676.2207782"
    },
    {
      "text": "Senseable Phantom Haptic Arm. http://www.sensable.com, last accessed in 10/09/2012.",
      "doi": ""
    },
    {
      "text": "Strojnik, P., Kralj, A., and Ursic, I., Programmed six-channel electrical stimulator for complex stimulation of leg muscles during walking, IEEE Trans. Biomed. Eng. 26, 112, 1979.",
      "doi": ""
    },
    {
      "text": "Suzuki, Y., Kobayashi, M., Shimada, M., Nakayama, A., and Iwaki, S. An Untethered Force Feedback Display based on the Air Jet Interface. In SIGGRAPH '04 Emerging technologies.  ",
      "doi": "10.1145/1186155.1186186"
    },
    {
      "text": "Tamaki, E., Miyaki, T., and Jun Rekimoto. PossessedHand: techniques for controlling human hands using electrical muscles stimuli. Proc. CHI '11, 543--552.  ",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Tsetserukou, D., Sato, K., and Tachi, S. ExoInterfaces: novel exosceleton haptic interfaces for virtual reality, augmented sport and rehabilitation. Proc. AH '10, 1--6.  ",
      "doi": "10.1145/1785455.1785456"
    },
    {
      "text": "Weiss, M., Wacharamanotham, C., Voelker, S., and Borchers, J. FingerFlux: near-surface haptic feedback on tabletops. Proc. UIST '11, 615--620.  ",
      "doi": "10.1145/2047196.2047277"
    },
    {
      "text": "Wright, A. The touchy subject of haptics. Commun. ACM 54, 1 (January 2011), 20--22.  ",
      "doi": "10.1145/1866739.1866746"
    },
    {
      "text": "Yao, L., Dasgupta, S., Cheng, N., Spingarn-Koff, J., Rudakevych, O. and Ishii, H. Rope Revolution: tangible and gestural rope interface for collaborative play. Proc. ACE '11.  ",
      "doi": "10.1145/2071423.2071437"
    }
  ]
}