{
  "doi": "10.1145/2470654.2466177",
  "title": "Brainstorm, Chainstorm, Cheatstorm, Tweetstorm: new ideation strategies for distributed HCI design",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1343-1352",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper we describe the results of a design-driven study of collaborative ideation. Based on preliminary findings that identified a novel digital ideation paradigm we refer to as chainstorming, or online communication brainstorming, two exploratory studies were performed. First, we developed and tested a distributed method of ideation we call cheatstorming, in which previously generated brainstorm ideas are delivered to targeted local contexts in response to a prompt. We then performed a more rigorous case study to examine the cheatstorming method and consider its possible implementation in the context of a distributed online ideation tool. Based on observations from these studies, we conclude with the somewhat provocative suggestion that ideation need not require the generation of new ideas. Rather, we present a model of ideation suggesting that its value has less to do with the generation of novel ideas than the cultural influence exerted by unconventional ideas on the ideating team. Thus brainstorming is more than the pooling of \"invented\" ideas, it involves the sharing and interpretation of concepts in unintended and (ideally) unanticipated ways.",
  "tags": [
    "tweetstormer",
    "cheatstorming",
    "brainstorming",
    "chainstorming",
    "ideation"
  ],
  "authors": [
    {
      "name": "Haakon Faste",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654022",
      "orcid": "missing"
    },
    {
      "name": "Nir Rachmel",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556157856",
      "orcid": "missing"
    },
    {
      "name": "Russell Essary",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557722456",
      "orcid": "missing"
    },
    {
      "name": "Evan Sheehan",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361595438",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barki, H., Pinsonneault, A. (2001). Small Group Brainstorming and Idea Quality: Is Electronic Brainstorming the Most Effective Approach?, Small Group Research, 32, 158.",
      "doi": ""
    },
    {
      "text": "Bayless, O.L. (1967). An alternative for problem solving discussion, Journal of Communication, 17, 188--197.",
      "doi": ""
    },
    {
      "text": "Bouchard, T. J., & Hare, M. (1970). Size, performance, and potential in brainstorming groups, Applied Psych, 54, 51--55.",
      "doi": ""
    },
    {
      "text": "Bouchard, T. J., Barsaloux, J., Drauden, G. (1974). Brainstorming procedure, group size, and sex as determinants of the problem-solving effectiveness of groups and individuals, Applied Psychology, 59(2), 135--138.",
      "doi": ""
    },
    {
      "text": "Collaros, P. a, & Anderson, L. R. (1969). Effect of perceived expertness upon creativity of members of brainstorming groups, Applied Psychology, 53(2), 159--163.",
      "doi": ""
    },
    {
      "text": "de Bono, E. (1970). Lateral Thinking: Creativity Step By Step, Harper Perennial.",
      "doi": ""
    },
    {
      "text": "DeRosa, D. M., Smith, C. L., & Hantula, D. A. (2007). The Medium Matters: Mining the long-promised merit of group interaction in creative idea generation tasks in a metaanalysis of the electronic group brainstorming literature, Computers in Human Behavior, 23, 1549--1581.  ",
      "doi": "10.1016/j.chb.2005.07.003"
    },
    {
      "text": "Diehl, M., & Stroebe, W. (1987). Productivity Loss in Brainstorming Groups: Toward the Solution of a Riddle, Personality & Social Psychology, 53(3), 497--509.",
      "doi": ""
    },
    {
      "text": "Djajadiningrat, J.P., Gaver, W.W. & Frens, J.W. (2000). Interaction relabelling and extreme characters: Methods for exploring aesthetic interactions. Proc. DIS 2000, 66--71.  ",
      "doi": "10.1145/347642.347664"
    },
    {
      "text": "Dunnette, M. D., Campbell, J., Jaastad, K. (1963). The effect of group participation on brainstorming effectiveness for two industrial samples, Applied Psychology, 47(1), 30--37.",
      "doi": ""
    },
    {
      "text": "Eno, B. (1978). Oblique Strategies. Opal, London.",
      "doi": ""
    },
    {
      "text": "Fallman, D. (2003). Design-Oriented Human-Computer Interaction. Proc. CHI, 225--232  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Faste, R. (1993). An Improved Model for Understanding Creativity and Convention, in Cary A. Fisher (ed.), ASME Resource Guide to Innovation in Engineering Design, American Society of Mechanical Engineers.",
      "doi": ""
    },
    {
      "text": "Faste, R. (1995). A Visual Essay on Invention and Innovation, Design Management Journal, 6(2).",
      "doi": ""
    },
    {
      "text": "Faste, H. & Bergamasco, M. (2009). A Strategic Map for High-Impact Virtual Experience Design, Proc. SPIE, 7238",
      "doi": ""
    },
    {
      "text": "Gallupe, R., Bastianutti, L. M., & Cooper, W. H. (1991). Unblocking brainstorms. Journal of Applied Psychology, 76(1), 137--142.",
      "doi": ""
    },
    {
      "text": "Graham, C., Rouncefield, M., Gibbs, M., Vetere, F., and Cheverst, C. (2007). How Probes Work Proc. of OzCHI, 29  ",
      "doi": "10.1145/1324892.1324899"
    },
    {
      "text": "Gordon, W. J. J. (1971), The Metaphorical Way of Learning and Knowing, Porpoise Books, p. 20.",
      "doi": ""
    },
    {
      "text": "Halskov, K., Dalsgård, P. (2006). Inspiration Card Workshops, Proc. Designing Interactive Systems, 2--11.  ",
      "doi": "10.1145/1142405.1142409"
    },
    {
      "text": "Hegedus, D. M., (1986). Task Effectiveness and Interaction Process of a Modified Nominal Group Technique in Solving an Evaluation Problem, J. of Management, 12(4), 545--560.",
      "doi": ""
    },
    {
      "text": "Isaksen, S. G. (1998). A Review of Brainstorming Research: Six Critical Issues for Inquiry, Technical report, Creative Problem Solving Group, Buffalo, NY.",
      "doi": ""
    },
    {
      "text": "Jones, J. C. (1970). Design Methods, John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Kelley, T., Littman, J. and Peters, T. (2001). The Art of Innovation: Lessons in Creativity from IDEO, America's Leading Design Firm, Crown Business.",
      "doi": ""
    },
    {
      "text": "Koestler, Arthur, The Act of Creation, Dell, NY, 1964",
      "doi": ""
    },
    {
      "text": "Lamm, H. and Trommsdorff, G. (1973). Group versus individual performance on tasks requiring ideational proficiency (brainstorming): A review. European Journal of Social Psychology, 3, 361--388.",
      "doi": ""
    },
    {
      "text": "Larry, T., Paulus, P. (1995). Social Comparison and Goal Setting in Brainstorming Groups, Journal of Applied Social Psychology, 25(18), 1579--1596.",
      "doi": ""
    },
    {
      "text": "Lehrer, J. (2012). Groupthink: The brainstorming myth, The New Yorker, January 30",
      "doi": ""
    },
    {
      "text": "Madsen, D. B., & Finger, J. R. Jr., (1978). Comparison of a written feedback procedure, group brainstorming, and individual brainstorming, Applied Psychology, 63(1), 120--123.",
      "doi": ""
    },
    {
      "text": "Maginn, B. K., & Harris, R. J. (1980). Effects of anticipated evaluation on individual brainstorming performance, Journal of Applied Psychology, 65(2), 219--225.",
      "doi": ""
    },
    {
      "text": "Mullen, B., Johnson, C. (1991). Productivity Loss in Brainstorming Groups: A Meta-Analytic Integration, Basic and Applied Social Psychology, 12(1), 3--23.",
      "doi": ""
    },
    {
      "text": "Muller, M.J., White, E.A., and Wildman, D.M. (1993). Taxonomy of PD practices: A brief practitioner's guide. Communications of the ACM, 36(6), 26--28 (June 1993).  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Nijstad, B. A., De Dreu, C. K. W., Rietzschel, E. F., & Baas, M. (2010). The dual pathway to creativity model: Creative ideation as a function of flexibility and persistence. European Review of Social Psychology, 21, 34--77.",
      "doi": ""
    },
    {
      "text": "Osborn, A. F. (1963). Applied Imagination: Principles and procedures of creative thinking (3rd edition), Scribner.",
      "doi": ""
    },
    {
      "text": "Paulus, P. (2000). Groups, Teams and Creativity: The Creative Potential of Idea-Generating Groups, Applied Psychology: An International Review, 49(2), 237--262.",
      "doi": ""
    },
    {
      "text": "Price, K. (1985). Problem Solving Strategies: A Comparison by Problem-Solving Phases, Group and Organization Studies, 10(3), 278--299.",
      "doi": ""
    },
    {
      "text": "Renzulli, J. S., Owen, S. V., & Callahan, C. M. (1974). Fluency, flexibility, and originality as a function of group size, Journal of Creative Behavior, 8(2), 107--113.",
      "doi": ""
    },
    {
      "text": "Searle J., R. (1983). Intentionality: An Essay in the Philosophy of Mind, Cambridge University Press, 1983.",
      "doi": ""
    },
    {
      "text": "Shah, H. H. & Vargas-Hernandez, N. (2002). Metrics for Measuring Ideation Effectiveness, Design Studies, 24(2).",
      "doi": ""
    },
    {
      "text": "Stein, M. I. (1975). Stimulating Creativity: Group Procedures (volume 2), Academic Press, NY",
      "doi": ""
    },
    {
      "text": "Stenmark, D. (2001). The Mindpool Hybrid: Theorising a New Angle on EBS and Suggestion Systems, Proc. Hawaii International Conference on Systems Science. ",
      "doi": "10.5555/820557.820634"
    },
    {
      "text": "Sutton, R., & Hargadon A. (1996). Brainstorming Groups in Context: Effectiveness in a Product Design Firm, Administrative Science Quarterly, 41(4), 685--718.",
      "doi": ""
    },
    {
      "text": "Taylor, D. W., Berry, P. C., Block, C. H. (1958). Does group participation when using brainstorming facilitate or inhibit creative thinking? Administrative Science Quarterly, 3(1), 23--47.",
      "doi": ""
    },
    {
      "text": "von Oech, R. (1986). A Kick in the Seat of the Pants, Harper.",
      "doi": ""
    },
    {
      "text": "Watson, W., Michaelsen, L. K. & Sharp, W. (1991). Member competence, group interaction, and group decision making: A longitudinal study. Applied Psychology, 76, 803--809.",
      "doi": ""
    },
    {
      "text": "Yu, L., & Nickerson, J. (2012). Collective Creativity: Where we are and where we might go, Proc. CHI.",
      "doi": ""
    }
  ]
}