{
  "doi": "10.1145/2470654.2470767",
  "title": "Tweeting for class: co-construction as a means for engaging students in lectures",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "797-800",
  "year": 2013,
  "badges": [],
  "abstract": "Motivating students to be active learners is a perennial problem in education, and is particularly challenging in lectures where instructors typically prepare content in ad-vance with little direct student participation. We describe our experience using Twitter as a tool for student \"co-construction\" of lecture materials. Students were required to post a tweet prior to each lecture related to that day's topic, and these tweets -- consisting of questions, examples and reflections -- were incorporated into the lecture slides and notes. Students reported that they found lectures including their tweets in the class slides to be engaging, interactive and relevant, and nearly 90% of them recommended we use our co-construction approach again.",
  "authors": [
    {
      "name": "Jeremy Birnholtz",
      "institution": "Northwestern University, Evanston, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100651315",
      "orcid": "missing"
    },
    {
      "name": "Jeff Hancock",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100212035",
      "orcid": "missing"
    },
    {
      "name": "Daniela Retelny",
      "institution": "Stanford University, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81467669065/rel-imgonly/dretelny_headshot2.jpg",
      "acmid": "81467669065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Astin, A. Student involvement: a developmental theory for higher education. Journal of College Student Personnel, 25(1984), 297--308.",
      "doi": ""
    },
    {
      "text": "Chen, P. S. D., Lambert, A. D. and Guidry, K. R. Engaging online learners: the impact of web-based learning technology on college student engagement. Computers & Education, 55(2010), 92--100.  ",
      "doi": "10.1016/j.compedu.2009.11.008"
    },
    {
      "text": "Ebner, M., Lienhardt, C., Rohs, M. and Meyer, I. Microblogs in higher education -- a chance to facilitate informal and process-oriented learning. Computers & Education, 55(2010), 92--100.  ",
      "doi": "10.1016/j.compedu.2009.12.006"
    },
    {
      "text": "Junco, R., Heiberger, G. and Loken, E. The effect of Twitter on college student engagement and grades. J. of Computer Assisted Learning, 27(2011), 119--132.",
      "doi": ""
    },
    {
      "text": "Lewin, T. Instruction for masses knocks down campus walls. New York Times, March 5, 2012, p. A11.",
      "doi": ""
    },
    {
      "text": "Pascarella, E. T. and Terenzini, P. T. How College Affects Students: A Third Decade of Research. JoseyBass, San Francisco, CA, 2005.",
      "doi": ""
    },
    {
      "text": "Sample, M. A Framework for Teaching with Twitter. Chronicle of Higher Education, 2010.",
      "doi": ""
    },
    {
      "text": "Schroeder, A., Minocha, S. and Schneider, C. The strengths, weaknesses, opportunities, and threats of using social software in higher and further education teaching and learning. Journal of Computer Assisted Learning, 26(2010), 159--174.",
      "doi": ""
    },
    {
      "text": "Siemens, G. Connectivism: A learning theory for the digital age. International Journal of Instructional Technology and Distance Learning, 2, 1 (2005).",
      "doi": ""
    },
    {
      "text": "Tapscott, D. Grown up digital: How the net generation is changing your world. McGraw-Hill, 2009. ",
      "doi": "10.5555/1502012"
    }
  ]
}