{
  "doi": "10.1145/2470654.2470714",
  "title": "Probing bus stop for insights on transit co-design",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "409-418",
  "year": 2013,
  "badges": [],
  "abstract": "Social computing provides a new way for citizens to engage with their public service. Our research investigates how social computing might support citizens co-design their transit service. We conducted a field study with public transit riders, exploring the issues and controversies that reveal conflicting communities. Our analyses revealed three insights. First, encourage citizens to share what they see as the rationale for current service offerings. Second, encourage citizens to share the consequences of current services and of proposed changes and new designs. Third, focus on producing a shared citizen and service provider understanding of what the goals and mission of the public service should be.",
  "tags": [
    "egovernment",
    "transit",
    "co-design",
    "service design",
    "social computing",
    "political design",
    "public service",
    "contestational design"
  ],
  "authors": [
    {
      "name": "Daisy Yoo",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556772856",
      "orcid": "missing"
    },
    {
      "name": "John Zimmerman",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81406592256/rel-imgonly/headshot2010.jpg",
      "acmid": "81406592256",
      "orcid": "missing"
    },
    {
      "name": "Tad Hirsch",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503651895",
      "orcid": "0000-0003-1421-3544"
    }
  ],
  "references": [
    {
      "text": "Bødker, S., Ehn, P., Sjögren, D. and Sundblad, Y. Co-Operative Design: Perspectives on 20 Years with 'the Scandinavian IT Design Model'. In Proc. of NordiCHI, (2000) ACM Press, 22--24.",
      "doi": ""
    },
    {
      "text": "Brabham, D. C. Crowdsourcing the Public Participation Process for Planning Projects. Planning Theory, 8, 3 (2009), 242--262.",
      "doi": ""
    },
    {
      "text": "Bradwell, P. and Marr, S. Making the Most of Collaboration an International Survey of Public Service Co-Design. DEMOS, in association with PriceWaterhouseCoopers Public Sector Research Centre, London, 2008.",
      "doi": ""
    },
    {
      "text": "Chango, M. Challenges to e-government in Africa south of Sahara. In Proc. of the Conference on Theory and Practice of Electronic Governance, (2007).  ",
      "doi": "10.1145/1328057.1328138"
    },
    {
      "text": "Cho, J. S., Chun, S. A. Towards transparent policy decision making process. In Proc. of Digital Government Research Conference, (2011).  ",
      "doi": "10.1145/2037556.2037591"
    },
    {
      "text": "DiSalvo, C. Design and the Construction of Publics. Design Issues, 25, 1 (2009), 48--63.",
      "doi": ""
    },
    {
      "text": "Edvardsson, B., Gustafsson, A. and Roos, I. Service Portraits in Service Research: A Critical Review. International Journal of Service Industry Management, 16, 1 (2005), 107--121.",
      "doi": ""
    },
    {
      "text": "Evans-Cowley, J. S. Crowdsourcing the Curriculum: Public Participation in Redesigning a Planning Program. Working Paper, (February 12, 2011). Available at SSRN: http://ssrn.com/abstract=1760525",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Dunne, T., and Pacenti, E. Cultural Probes. interactions, 6,1 (1999) 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Goldstein, S. M., Johnston, R., Duffy, J. A. and Rao, J. The Service Concept: The Missing Link in Service Design Research? Journal of Operations Management, 20, 2 (2002), 121--134.",
      "doi": ""
    },
    {
      "text": "Hirsch, T. Contestational Design: Innovation for political activism. Dissertation. MIT, Dept. of Architecture, Program in Media Arts and Sciences, (2006).",
      "doi": ""
    },
    {
      "text": "Holmlid, S. Participative, Co-Operative, Emancipatory: From Participatory Design to Service Design. In Proceedings of Nordic Conference on Service Design and Service Innovation, (2009) Oslo School of Architecture and Design.",
      "doi": ""
    },
    {
      "text": "Janowski, T., Ojo, A. and Estevez, E. Rapid Development of Electronic Public Services: A Case Study in Electronic Licensing Service. In Proc of Conference on Digital Government Research, (2007) Digital Government Society of North America, 292--293. ",
      "doi": "10.5555/1248460.1248525"
    },
    {
      "text": "Kaschesky, M., Riedl, R. Top-level decisions through public deliberation on the internet. In Proc. Of the Conference on Digital Government Research, (2009). ",
      "doi": "10.5555/1556176.1556189"
    },
    {
      "text": "Koskinen, I., Zimmerman, J., Binder, T., Redstrom, J. and Wensveen, S. Design Research through Practice: From the Lab, Field, and Showroom. Morgan Kaufmann, Boston, 2011. ",
      "doi": "10.5555/2132674"
    },
    {
      "text": "King, S. F. and Brown, P. Fix My Street or Else: Using the Internet to Voice Local Public Service Concerns. In Proc. of Theory and Practice of Electronic Governance, (2007) ACM Press. 72--80.  ",
      "doi": "10.1145/1328057.1328076"
    },
    {
      "text": "Matheus, R., Ribeiro, M. M. Public online consultation of federal ministries and federal regulatory agencies in Brazil. In Proc. of the Conference on Theory and Practice of Electronic Governance, (2009).  ",
      "doi": "10.1145/1693042.1693127"
    },
    {
      "text": "Ng, I. C. L., Maull, R. S. and Smith, L. Embedding the New Discipline of Service Science. In The Science of Service Systems. H. Demirkan, J. H. Spohrer and V. Krishna (eds). Springer, 2009.",
      "doi": ""
    },
    {
      "text": "ParkScan: http://parkscan.org/",
      "doi": ""
    },
    {
      "text": "Petrik, K. Participation and e-democracy how to utilize web 2.0 for policy decision-making. In Proc. of the Conference on Digital Government Research, (2009). ",
      "doi": "10.5555/1556176.1556222"
    },
    {
      "text": "Prahalad, C. K. and Ramaswamy, V. Co-Opting Customer Competence. Harvard Business Review, 78, 1 (2000), 79--90.",
      "doi": ""
    },
    {
      "text": "Qian, H. Global perspectives on e-governance. In Proc. of the Conference on Theory and Practice of Electronic Governance, (2010).  ",
      "doi": "10.1145/1930321.1930323"
    },
    {
      "text": "Rodrigo, D., Amo, P. A. (2006): Background Document on Public Consultation. OECD, Paris.",
      "doi": ""
    },
    {
      "text": "Saad-Sulonen, J. and Cabrera, A. B. Setting up a Public Participation Project Using the Urban Mediator Tool: A Case of Collaboration between Designers and City Planners. In Proc. of NordiCHI, (2008) ACM Press, 539--542.  ",
      "doi": "10.1145/1463160.1463239"
    },
    {
      "text": "Saad-Sulonen, J., Botero, A. and Kuutti, K. A Long-Term Strategy for Designing (in) the Wild: Lessons from the Urban Mediator and Traffic Planning in Helsinki. In Proc. of DIS (2012) ACM Press, 166--175  ",
      "doi": "10.1145/2317956.2317982"
    },
    {
      "text": "Shostack, G. L. How to Design a Service. In European Journal of Marketing 16, 1 (1982), 49--63.",
      "doi": ""
    },
    {
      "text": "Strauss, A., Corbin, J. Basics of Qualitative, 2nd Ed. SAGE Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Tomkins, A. J., PytlikZilllig, L. M., Herian, M. N., Abdel-Monem, T., Hamm, J. A. (2010): Public input for municipal policymaking. In Proc of the Digital Government Research Conference on Public Administration Online. ",
      "doi": "10.5555/1809874.1809885"
    },
    {
      "text": "US Census Bureau (2010): http://www.census.gov/prod/2010pubs/acsbr09-5.pdf Accessed: September 1, 2012.Winner, L. \"Do Artifacts Have Politics?\" in The Whale and The Reactor: A Search for Limits in an Age of High Technology, Chicago: University of Chicago Press, 1989.",
      "doi": ""
    },
    {
      "text": "Yoo, D., Zimmerman, J., Steinfeld, A., and Tomasic, A. Understanding the Space for Co-Design in Riders' Interactions with a Transit Service. In Proc of CHI, (2010) ACM Press, 1797--1806.  ",
      "doi": "10.1145/1753326.1753596"
    },
    {
      "text": "Zimmeramn, J., Tomasic, A., Garrod, C., Yoo, D., Hiruncharoenvate, C., Aziz, R., Thiruvengadam, N. R., Huang, Y., and Steinfeld, A. Field Trial of Tiramisu: Crowd-Sourcing Bus Arrival Times to Spur Co-Design. In Proc of CHI, (2011) ACM Press, 1677--1686.  ",
      "doi": "10.1145/1978942.1979187"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J. and Evenson, S. Research through Design as a Method for Interaction Design Research in HCI. In Proc. of CHI, (2007) ACM Press, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}