{
  "doi": "10.1145/2470654.2470677",
  "title": "Pointing at 3d target projections with one-eyed and stereo cursors",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "159-168",
  "year": 2013,
  "badges": [],
  "abstract": "We present a study of cursors for selecting 2D-projected 3D targets. We compared a stereo- and mono-rendered (one-eyed) cursor using two mouse-based and two remote pointing techniques in a 3D Fitts' law pointing experiment. The first experiment used targets at fixed depths. Results indicate that one-eyed cursors only improve screen-plane pointing techniques, and that constant target depth does not influence pointing throughput. A second experiment included pointing between targets at varying depths and used only \"screen-plane\" pointing techniques. Our results suggest that in the absence of stereo cue conflicts, screen-space projections of Fitts' law parameters (target size and distance) yield constant throughput despite target depth differences and produce better models of performance.",
  "authors": [
    {
      "name": "Robert J. Teather",
      "institution": "York University, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392615854",
      "orcid": "missing"
    },
    {
      "name": "Wolfgang Stuerzlinger",
      "institution": "York University, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100214718",
      "orcid": "0000-0002-7110-5024"
    }
  ],
  "references": [
    {
      "text": "Argelaguet, F. and Andujar, C., Efficient 3D pointing selection in cluttered virtual environments, IEEE Computer Graphics and Applications, 29, 2009, 34--43.  ",
      "doi": "10.5555/1720672.1720678"
    },
    {
      "text": "Casiez, G. and Roussel, N., No more bricolage!: methods and tools to characterize, replicate and compare pointing transfer functions, ACM UIST 2011, 603--614.  ",
      "doi": "10.1145/2047196.2047276"
    },
    {
      "text": "Fitts, P. M., The information capacity of the human motor system in controlling the amplitude of movement, Journal of Experimental Psychology, 47, 1954, 381--391.",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R., Pointing at trivariate targets in 3D environments, ACM CHI 2004, 447--454.  ",
      "doi": "10.1145/985692.985749"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R., The design and evaluation of selection techniques for 3D volumetric displays, ACM UIST 2006, 3--12.  ",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Hoffman, D. M., Girshick, A. R., Akeley, K., and Banks, M. S., Vergence-accommodation conflicts hinder visual performance and cause visual fatigue, Journal of Vision, 8(3), 2008, 1--30.",
      "doi": ""
    },
    {
      "text": "ISO 9241-9, Ergonomic requirements for office work with visual display terminals (VDTs) - Part 9: Requirements for non-keyboard input devices. International Organization for Standardization, 2000.",
      "doi": ""
    },
    {
      "text": "Jota, R., Nacenta, M. A., Jorge, J. A., Carpendale, S., and Greenberg, S., A comparison of ray pointing techniques for very large displays, Graphics Interface 2010, 269--276. ",
      "doi": "10.5555/1839214.1839261"
    },
    {
      "text": "Kopper, R., Bowman, D. A., Silva, M. G., and McMahan, R. P., A human motor behavior model for distal pointing tasks, International Journal of HumanComputer Studies, 68, 2010, 603--615.  ",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "Kunert, A., Kulik, A., Lux, C., and Fröhlich, B., Facilitating system control in ray-based interaction tasks, ACM VRST 2009, 183--186.  ",
      "doi": "10.1145/1643928.1643969"
    },
    {
      "text": "MacKenzie, I. S., Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, 7, 1992, 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I. S. and Isokoski, P., Fitts' throughput and the speed-accuracy tradeoff, ACM CHI 2008, 1633--1636.  ",
      "doi": "10.1145/1357054.1357308"
    },
    {
      "text": "Murata, A. and Iwase, H., Extending Fitts' law to a three-dimensional pointing task, Human Movement Science, 20, 2001, 791--805.",
      "doi": ""
    },
    {
      "text": "Oh, J.-Y. and Stuerzlinger, W., Laser pointers as collaborative pointing devices, Graphics Interface 2002, 315--320.",
      "doi": ""
    },
    {
      "text": "Pagano, R. R., Understanding statistics in the behavioural sciences. Wadsworth Publishing, 2006.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S., Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI, International Journal of Human-Computer Studies 61, 2004, 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Steinicke, F., Ropinski, T., and Hinrichs, K., Object selection in virtual environments using an improved virtual pointer metaphor, Computer Vision and Graphics, vol. 32, Computational Imaging and Vision, Springer Netherlands, 2006, 320--326.",
      "doi": ""
    },
    {
      "text": "Teather, R. J., Pavlovych, A., Stuerzlinger, W., and MacKenzie, I. S., Effects of tracking technology, latency, and spatial jitter on object movement, IEEE 3DUI Symposium 2009, 43--50.  ",
      "doi": "10.1109/3DUI.2009.4811204"
    },
    {
      "text": "Teather, R. J. and Stuerzlinger, W., Pointing at 3D targets in a stereo head-tracked virtual environment, IEEE 3DUI Symposium 2011, 87--94. ",
      "doi": "10.5555/2013881.2014216"
    },
    {
      "text": "Teather, R. J. and Stuerzlinger, W., Cursors for 3D Pointing, in 3DCHI Workshop, 2012.",
      "doi": ""
    },
    {
      "text": "Valkov, D., Steinicke, F., Bruder, G., and Hinrichs, K., 2d touching of 3d stereoscopic objects, ACM CHI 2011, 1353--1362.  ",
      "doi": "10.1145/1978942.1979142"
    },
    {
      "text": "Wang, G., McGuffin, M. J., Berard, F., and Cooperstock, J. R., Pop-up depth views for improving 3D target acquisition, Graphics Interface 2011, 41--48. ",
      "doi": "10.5555/1992917.1992925"
    },
    {
      "text": "Ware, C. and Lowther, K., Selection using a one-eyed cursor in a fish tank VR environment, ACM Transactions on Computer-Human Interaction, 4, 1997, 309--322.  ",
      "doi": "10.1145/267135.267136"
    },
    {
      "text": "Wingrave, C. A., Tintner, R., Walker, B. N., Bowman, D. A., and Hodges, L. F., Exploring individual differences in raybased selection; strategies and traits, IEEE VR 2005, 163--170.  ",
      "doi": "10.1109/VR.2005.35"
    },
    {
      "text": "Zhai, S., Characterizing computer input with Fitts' law parameters - the information and non-information aspects of pointing, International Journal of HumanComputer Studies, 61, 2004, 791--809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    }
  ]
}