{
  "doi": "10.1145/2470654.2466266",
  "title": "Let's get together: the formation and success of online creative collaborations",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2009-2018",
  "year": 2013,
  "badges": [],
  "abstract": "In online creative communities, members work together to produce music, movies, games, and other cultural products. Despite the proliferation of collaboration in these communities, we know little about how these teams form and what leads to their ultimate success. Building on theories of social identity and exchange, we present an exploratory study of an online songwriting community. We analyze four years of longitudinal behavioral data using a novel path-based regression model that accurately predicts and reveals key variables about collab formation. Combined with a large-scale survey of members, we find that communication, nuanced complementary interest and status, and a balanced effort from both parties contribute to successful collaborations. We also discuss several applications of these findings for socio-technical infrastructures that support online creative production.",
  "tags": [
    "online communities",
    "music composition",
    "computer-supported cooperative work",
    "social creativity",
    "collaboration"
  ],
  "authors": [
    {
      "name": "Burr Settles",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436599266",
      "orcid": "missing"
    },
    {
      "name": "Steven Dow",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    }
  ],
  "references": [
    {
      "text": "February Album Writing Month. http://fawm.org.",
      "doi": ""
    },
    {
      "text": "Newgrounds. http://www.newgrounds.com.",
      "doi": ""
    },
    {
      "text": "Scratch: Programming for All. http://scratch.mit.edu.",
      "doi": ""
    },
    {
      "text": "Adamic, L., and Adar, E. Friends and neighbors on the Web. Social Networks 25, 3 (July 2003), 211--230.",
      "doi": ""
    },
    {
      "text": "Agarwal, A., and Chakrabarti, S. Learning random walks to rank nodes in graphs. In Proc. Int. Conf. Machine Learning (ICML) (2007), 9--16.  ",
      "doi": "10.1145/1273496.1273498"
    },
    {
      "text": "Ancona, D., and Caldwell, D. Demography & design: Predictors of new product team performance. Org. Sci. 3 (1992), 321--341.",
      "doi": "10.1287/orsc.3.3.321"
    },
    {
      "text": "Backstrom, L., Huttenlocher, D., Kleinberg, J., and Lan, X. Group formation in large social networks: Membership, growth, and evolution. In Proc. Int. Conf. Knowledge Discovery and Data Mining (KDD), ACM (2006), 44--54.  ",
      "doi": "10.1145/1150402.1150412"
    },
    {
      "text": "Bantel, K., and Jackson, S. Top management and innovations in banking: Does the composition of the top team make a difference? Strategic Mgmt. J. 10 (1989), 107--124.",
      "doi": ""
    },
    {
      "text": "Benkler, Y. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press, New Haven and London, 2006. ",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Bonacich, P. Some unique properties of eigenvector centrality. Social Networks 29 (2007), 555--564.",
      "doi": ""
    },
    {
      "text": "Bryant, S., Forte, A., and Bruckman, A. Becoming Wikipedian: Transformation of participation in a collaborative online encyclopedia. In Proc. Int. Conf. Supporting Group Work (GROUP) (2005).  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Burke, M., and Settles, B. Plugged in to the community: Social motivators in online goal-setting groups. In Proc. Int. Conf. Communities and Technologies (C&T), ACM (2011), 1--10.  ",
      "doi": "10.1145/2103354.2103356"
    },
    {
      "text": "Byrne, D. The Attraction Paradigm. Academic, New York, NY, USA, 1971.",
      "doi": ""
    },
    {
      "text": "Cattani, G., and Ferriani, S. A core/periphery perspective on individual creative performance: Social networks and cinematic achievements in the Hollywood film industry. Org. Sci. 19, 6 (November 1 2008), 824--844.",
      "doi": "10.1287/orsc.1070.0350"
    },
    {
      "text": "Chidambaram, L., and Tung, L. Is out of sight, out of mind? An empirical study of social loafing in technology-supported groups. Inform. Syst. Research 16, 2 (2005), 149--168.  ",
      "doi": "10.1287/isre.1050.0051"
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., and Riedl, J. SuggestBot: Using intelligent task routing to help people find work in Wikipedia. In Proc. Int. Conf. Intelligent User Interfaces (IUI), ACM (2007), 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Dow, S., Fortuna, J., Schwartz, D., Altringer, B., Schwartz, D., and Klemmer, S. Prototyping dynamics: Sharing multiple designs improves exploration, group rapport, and results. In Proc. Conf. Human Factors in Comput. Syst. (CHI), ACM (2011), 2807--2816.  ",
      "doi": "10.1145/1978942.1979359"
    },
    {
      "text": "Emerson, R. Social exchange theory. Annu. Review of Psych. 2 (1976), 335--362.",
      "doi": ""
    },
    {
      "text": "Faulkner, R., and Anderson, A. Short-term projects and emergent careers: Evidence from Hollywood. Amer. J. Sociology 92, 4 (January 1987), 879--909.",
      "doi": ""
    },
    {
      "text": "Fawcett, T. An introduction to ROC analysis. Pattern Recognition Letters 27 (2006), 861--874.  ",
      "doi": "10.1016/j.patrec.2005.10.010"
    },
    {
      "text": "Feld, S. The focused organization of social ties. Amer. J. Sociology 86, 5 (March 1981), 1015--1035.",
      "doi": ""
    },
    {
      "text": "Frushtick, R. Spoilers! Zork 'Walkthrough' rocks out. MTV Multiplayer (September 30, 2009). New York, NY: MTV. http://on.mtv.com/1rQiu.",
      "doi": ""
    },
    {
      "text": "Fuller, D., and Magerko, B. Shared mental models in improvisational theatre. In Proc. Conf. Creativity and Cognition (C&C), ACM (2011), 269--278.  ",
      "doi": "10.1145/2069618.2069663"
    },
    {
      "text": "Gruenfeld, D., Mannix, E., Williams, K., and Neale, M. Group composition and decision-making: How member familiarity and information distribution affect process and performance. Org. Behavior and Human Decision Processes 67 (1996), 1--15.",
      "doi": ""
    },
    {
      "text": "Hoffman, L., and Maier, N. Quality and acceptance of problem solutions by members of homogeneous and heterogeneous groups. J. Abnormal and Social Psych. 62 (1961), 401--407.",
      "doi": ""
    },
    {
      "text": "Hogg, M. A., and Turner, J. C. Interpersonal attraction, social identification and psychological group formation. European J. Social Psych. 15 (1985), 51--66.",
      "doi": ""
    },
    {
      "text": "Huang, Y., Zhu, M., Wang, J., Pathak, N., Shen, C., Keegan, B., Williams, D., and Contractor, N. The formation of task-oriented groups: Exploring combat activities in online games. In Proc. Int. Conf. Computational Sci. and Eng. (CSE), vol. 4, IEEE Press (2009), 122--127.  ",
      "doi": "10.1109/CSE.2009.465"
    },
    {
      "text": "Koren, Y., Bell, R., and Volinsky, C. Matrix factorization techniques for recommender systems. Computer 42, 8 (2009), 30--37.  ",
      "doi": "10.1109/MC.2009.263"
    },
    {
      "text": "Kravitz, D., and Martin, B. Ringelmann rediscovered: The original article. J. Personality and Social Psych. 50, 5 (1986), 936--941.",
      "doi": ""
    },
    {
      "text": "Lao, N., and Cohen, W. Relational retrieval using a combination of path-constrained random walks. Machine Learning 81 (2010), 53--67.  ",
      "doi": "10.1007/s10994-010-5205-8"
    },
    {
      "text": "Lao, N., Mitchell, T., and Cohen, W. Random walk inference and learning in a large scale knowledge base. In Proc. Conf. Empirical Methods in Natural Language Processing (EMNLP), ACL (2011), 529--539. ",
      "doi": "10.5555/2145432.2145494"
    },
    {
      "text": "Lave, J., and Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, 1991.",
      "doi": ""
    },
    {
      "text": "Levine, J., and Resnick, L. Social foundations of cognition. Annu. Review of Psych. 44 (1993), 585--612.",
      "doi": ""
    },
    {
      "text": "Liben-Nowell, D., and Kleinberg, J. The link prediction problem for social networks. In Proc. Conf. Inform. and Knowledge Mgmt. (CIKM), ACM (2003), 556--559.  ",
      "doi": "10.1145/956863.956972"
    },
    {
      "text": "Liden, R. C., Wayne, S. J., Jaworski, R. A., and Bennett, N. Social loafing: A field investigation. J. Mgmt. 30, 2 (2004), 285--285.",
      "doi": ""
    },
    {
      "text": "Luther, K., and Bruckman, A. Leadership in online creative collaboration. In Proc. Conf. Comput.-Supported Cooperative Work (CSCW), ACM (2008), 343--352.  ",
      "doi": "10.1145/1460563.1460619"
    },
    {
      "text": "Luther, K., Caine, K., Ziegler, K., and Bruckman, A. Why it works (when it works): Success factors in online creative collaboration. In Proc. Int. Conf. Supporting Group Work (GROUP), ACM (2010), 1--10.  ",
      "doi": "10.1145/1880071.1880073"
    },
    {
      "text": "Manning, C. D., and Schütze, H. Foundations of Statistical Natural Language Processing. MIT Press, 1999. ",
      "doi": "10.5555/311445"
    },
    {
      "text": "Mannix, E., and Neale, M. What differences make a difference? The promise and reality of diverse teams in organizations. Psych. Sci. in the Public Interest 6, 2 (October 2005), 31--55.",
      "doi": ""
    },
    {
      "text": "Markus, M. Finding a happy medium: Explaining the negative effects of electronic communication on social life at work. ACM Trans. on Inform. Syst. 12, 2 (April 1994), 119--149.  ",
      "doi": "10.1145/196734.196738"
    },
    {
      "text": "McKenna, K., Green, A., and Gleason, M. Relationship formation on the Internet: What's the big attraction? J. Social Issues 58, 1 (2002), 9.",
      "doi": ""
    },
    {
      "text": "Mulvey, P. W., and Klein, H. J. The impact of perceived loafing and collective efficacy on group goal processes and group performance. Org. Behavior and Human Decision Processes 74, 1 (1998), 62--87.",
      "doi": ""
    },
    {
      "text": "Newcomb, T. Varieties of interpersonal attraction. In Group Dynamics: Research and Theory, D. Cartwright and A. Zander, Eds. Row, Peterson, Evanston, IL, 1960, 104--119.",
      "doi": ""
    },
    {
      "text": "O'Reilly, C., Caldwell, D., and Barnett, W. Work group demography, social integration and turnover. Administ. Sci. Quart. 34 (1989), 21--37.",
      "doi": ""
    },
    {
      "text": "Page, L., Brin, S., Motwani, R., and Winograd, T. The PageRank citation ranking: Bringing order to the Web. Technical Report 1999--66, Stanford InfoLab, November 1999.",
      "doi": ""
    },
    {
      "text": "Ren, Y., Kraut, R., and Kiesler, S. Applying communication identity and bond theory to design of online communities. Org. Studies 28, 3 (March 2007), 377--408.",
      "doi": ""
    },
    {
      "text": "Robinson, G., and Dechant, K. Building a business case for diversity. Acad. Mgmt. Executive 11, 3 (1997), 21--31.",
      "doi": ""
    },
    {
      "text": "Roschuni, C., Oehlberg, L., Beckman, S., and Agogino, A. Relationship conflict and feeling communication in design teams. In Proc. Int. Design Eng. Tech. Conf. and Comput. and Inform. in Eng. Conf. (IDETC/CIE) (2009), 87626.",
      "doi": ""
    },
    {
      "text": "Rose, J. Presidents' songs: Of legends and mortal men. All Things Considered (October 8, 2008). Washington D.C.: National Public Radio. http://n.pr/QyWjPz.",
      "doi": ""
    },
    {
      "text": "Salganik, M., Dodds, P., and Watts, D. Experimental study of inequality and unpredictability in an artificial cultural market. Science 311 (2006), 854--856.",
      "doi": ""
    },
    {
      "text": "Schon, D. The Reflective Practitioner: How Professionals Think in Action. Ashgate Publishing, 1995.",
      "doi": ""
    },
    {
      "text": "Shannon, C. A mathematical theory of communication. Bell Syst. Technical J. 27 (1948), 379--423, 623--656.",
      "doi": ""
    },
    {
      "text": "Slavin, R. Cooperative learning. Review of Educational Research 50, 2 (Summer 1980), 315--342.",
      "doi": ""
    },
    {
      "text": "Sutton, R., and Hargadon, A. Brainstorming groups in context: Effectiveness in a product design firm. Administ. Sci. Quart. 41 (1996), 685--718.",
      "doi": ""
    },
    {
      "text": "Tajfel, H. Social Identity and Intergroup Relations. Cambridge University Press, London, 1982.",
      "doi": ""
    },
    {
      "text": "Tibshirani, R. Regression shrinkage and selection via the LASSO. J. Roy. Stat. Soc. Series B (Methodological) 58, 1 (1996), 267--288.",
      "doi": ""
    },
    {
      "text": "Triandis, H., Hall, E., and Ewen, R. Member heterogeneity and dyadic creativity. Human Relations 18 (1965), 33--55.",
      "doi": ""
    },
    {
      "text": "Van Der Vegt, G., and Bunderson, J. Learning and performance in multidisciplinary teams: The importance of collective team identification. Acad. Mgmt. J. 48, 3 (June 2005), 532--547.",
      "doi": ""
    },
    {
      "text": "Walther, J. B. Time effects in computer-mediated, groups: Past, present, and future. In Distributed Work, P. Hinds and S. Kiesler, Eds. MIT Press, Cambridge, MA, 2002, 235--257.",
      "doi": ""
    },
    {
      "text": "Wideström, J., Axelsson, A., Schroeder, R., Nilsson, A., Heldal, I., and Abelin, A. The collaborative cube puzzle: A comparison of virtual and real environments. In Proc. Int. Conf. Collaborative Virtual Environments, ACM (2000), 165--171.  ",
      "doi": "10.1145/351006.351035"
    },
    {
      "text": "Wu, M., Ranjan, A., and Truong, K. An exploration of social requirements for exercise group formation. In Proc. Conf. Human Factors in Comput. Syst. (CHI), ACM (2009), 79--82.  ",
      "doi": "10.1145/1518701.1518714"
    },
    {
      "text": "Yuki, M., Maddux, W., Brewer, M., and Takemura, K. Cross-cultural differences in relationship- and group-based trust. Personality and Social Psych. Bulletin 31, 1 (2005), 48--62.",
      "doi": ""
    }
  ]
}