{
  "doi": "10.1145/2470654.2466261",
  "title": "Deep conservation in urban India and its implications for the design of conservation technologies",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1969-1978",
  "year": 2013,
  "badges": [],
  "abstract": "Rapid depletion of fossil fuels and water resources has become an international problem. Urban residential households are among the primary consumers of resources and are deeply affected by resource shortages. Despite the global nature of these problems, most of the solutions being developed to address these issues are based on studies done in the developed world. We present a study of energy, water and fuel conservation practices in urban India. Our study highlights a culture of deep conservation and the results raise questions about the viability of typical solutions such as home energy monitors. We identify new opportunities for design such as point-of-use feedback technologies, modular solutions, distributed energy storage, harnessing by-products and automated load shifting.",
  "tags": [
    "developing world",
    "sustainability",
    "energy",
    "ict4d"
  ],
  "authors": [
    {
      "name": "Yedendra B. Shrinivasan",
      "institution": "IBM Research, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350584254",
      "orcid": "missing"
    },
    {
      "name": "Mohit Jain",
      "institution": "IBM Research, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659887025",
      "orcid": "0000-0002-7106-164X"
    },
    {
      "name": "Deva P. Seetharam",
      "institution": "IBM Research, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488658047",
      "orcid": "missing"
    },
    {
      "name": "Abhishek Choudhary",
      "institution": "IBM Research, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556657956",
      "orcid": "missing"
    },
    {
      "name": "Elaine M. Huang",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100080130",
      "orcid": "missing"
    },
    {
      "name": "Tawanna Dillahunt",
      "institution": "Carnegie Mellon University, Pittsburgh, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606961",
      "orcid": "0000-0002-1155-8507"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    }
  ],
  "references": [
    {
      "text": "Abrahamse, W., Steg, L., Vlek, C., and Rothengatter, T. A review of intervention studies aimed at household energy conservation. J. of Env. Psychology, 25, 2005, 273--291.",
      "doi": ""
    },
    {
      "text": "Agrawal, A. Community, intimate government, and the making of environmental subjects in Kumaon, India. Current Anthropology 46, 2, 2005, 161--190.",
      "doi": ""
    },
    {
      "text": "Alam, M., Sathaye, J., and Barnes, D. Urban household energy use in India: Efficiency and policy implications. Energy Policy 26, 11, 1998, 885--891.",
      "doi": ""
    },
    {
      "text": "Amarasinghe, U., Shah, T., Turral, H., & Anand, B. K. India's water future to 2025--2050: Business-as-usual scenario and deviations. IWMI, 2007.",
      "doi": ""
    },
    {
      "text": "Arroyo, E., Bonanni, L., and Selker, T. Waterbot: Exploring feedback and persuasive techniques at the sink. CHI 2005, 631--639.  ",
      "doi": "10.1145/1054972.1055059"
    },
    {
      "text": "Asian Development Bank. Benchmarking and data book of water utilities in India. 2007.",
      "doi": ""
    },
    {
      "text": "Can, S., Letschert, V., McNeil, M., Zhou, N., and Sathaye, J. Residential and transport energy use in India: Past trend and future outlook. Environmental Energy, 2009.",
      "doi": ""
    },
    {
      "text": "Central Electricity Authority. Monthly Power Supply Position. December 2012. http://www.cea.nic.in/monthly_power_sup.html",
      "doi": ""
    },
    {
      "text": "Central Intelligence Agency. South Asia, India. The CIA World Factbook. https://www.cia.gov/library/publications/the-worldfactbook/geos/in.html",
      "doi": ""
    },
    {
      "text": "Chavan, A. L., Gorney, D., Prabhu, B., and Arora, S. The washing machine that ate my sari: Mistakes in cross-cultural design. Interactions 16, 1, 2009, 26--31.  ",
      "doi": "10.1145/1456202.1456209"
    },
    {
      "text": "Chetty, M., Tran, D., and Grinter, R. E. Getting to green: Understanding resource consumption in the home. UbiComp 2008, 242--251.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Clark-Ibáñez, M. Framing the social world with photoelicitation interviews. American Behavioral Scientist 47, 12, 2004, 1507--1527.",
      "doi": ""
    },
    {
      "text": "Cohen, C., Lenzen, M., and Schaeffer, R. Energy requirements of households in Brazil. Energy Policy 33, 2005, 555--562.",
      "doi": ""
    },
    {
      "text": "Desai, S., Dubey, A., Joshi, B. L., Sen, M., Sharif, A. and Vanneman, R. Human development in India: Challenges for a society in transition, 2010.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T., Mankoff, J., Paulos, E., and Fussell, S. It's not all about \"Green\": energy use in low-income communities. Ubicomp 2009, 255--264.  ",
      "doi": "10.1145/1620545.1620583"
    },
    {
      "text": "Dourish, P. HCI and Environmental sustainability: The politics of design and the design of politics. DIS 2010, 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Energenie. http://www.webcitation.org/6DYzWBsxb",
      "doi": ""
    },
    {
      "text": "Energy Information and Administration. Country analysis and briefs. http://www.webcitation.org/6AngIeQWq",
      "doi": ""
    },
    {
      "text": "Ernst and Young. Riding the Wave. http://www.webcitation.org/6AmevWAIJ",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Larson, E., Campbell, T., Haggerty, C., Fogarty, J., and Patel, S. N. HydroSense: Infrastructure mediated single-point sensing of whole-home water activity. UbiComp 2009, 235--244.  ",
      "doi": "10.1145/1620545.1620581"
    },
    {
      "text": "Froehlich, J., Findlater, L., Ostergren, M., Ramanathan, S., Peterson, J., Wragg, I., Larson, E., Fu, F., Bai, M., Patel, S. N., and Landay, J. A. The design and evaluation of prototype eco-feedback displays for fixture-level water usage data. CHI 2012, 2367--2376.  ",
      "doi": "10.1145/2207676.2208397"
    },
    {
      "text": "Froehlich, J., Dillahunt, T., Klasnja, P., Mankoff, J., Consolvo, S., Harrison, B., and Landay, J. A. UbiGreen: Investigating a mobile tool for tracking and supporting green transportation habits. CHI 2009, 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Froehlich, J., Findlater, L., and Landay, J. The design of eco-feedback technology. CHI 2010, 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Ganu, T., Seetharam, D. P., Arya, V., Kunnath, R., Hazra, J., Husain, S. A., De Silva, L. C., and Kalyanaraman, S. nPlug: A smart plug for alleviating peak loads. e-Energy 2012, 30.  ",
      "doi": "10.1145/2208828.2208858"
    },
    {
      "text": "Indraganti, M. Thermal comfort in apartments in India: Adaptive use of environmental controls and hindrances. Renewable Energy 36, 2011, 1182--1189.",
      "doi": ""
    },
    {
      "text": "Kappel, K. and Grechenig, T. \"Show-me\": Water consumption at a glance to promote water conservation in the shower. Persuasive 2009, Article 26.  ",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "Keirstead, J. Behavioural responses to photovoltaic systems in the UK domestic sector. Energy Policy 35, 2007, 4128--4141.",
      "doi": ""
    },
    {
      "text": "Kumar, A., Jain, S. K., and Bansal, N. K. Disseminating energy-efficient technologies: a case study of compact fluorescent lamps (CFLs) in India. Energy Policy 31, 3, 2003, 259--272.",
      "doi": ""
    },
    {
      "text": "Lenzen, M., Wier, M., Cohen, C., Hayami, H., Pachauri, S., and Schaeffer, R. A comparative multivariate analysis of household energy requirements in Australia, Brazil, Denmark, India and Japan. Energy 31, 2006, 181--207.",
      "doi": ""
    },
    {
      "text": "McCalley, L. T.; Midden, G. J. H. Computer based systems in household appliances: the study of ecofeedback as a tool for increasing conservation behavior. APCHI 1998, 344--349. ",
      "doi": "10.5555/786112.786334"
    },
    {
      "text": "McKenzie, D., and Ray, I. Urban water supply in India: Status, reform options and possible lessons. Water Policy 11, 2009, 442--460.",
      "doi": ""
    },
    {
      "text": "Ordenes, M., Marinoski, D. L., Braun, P., and Ruther, R. The impact of building-integrated photovoltaics on the energy demand of multi-family dwellings in Brazil. Energy and Buildings, 39, 2007, 629--642.",
      "doi": ""
    },
    {
      "text": "Pachauri, S. An analysis of cross-sectional variations in total household energy requirements in India using micro survey data. Energy Policy 32, 2004, 1723--1735.",
      "doi": ""
    },
    {
      "text": "Pierce, J. and Paulos, E. Beyond energy monitors: Interactions, energy, and emerging energy systems. CHI 2012, 665--674.  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "Pierce, J., Odom, W., and Blevis, E. Energy aware dwelling: a critical survey of interaction design for ecovisualizations. OZCHI 2008, 1--8.  ",
      "doi": "10.1145/1517744.1517746"
    },
    {
      "text": "Pierce, J., Schiano, D. J., and Paulos, E. Home, habits, and energy: examining domestic interactions and energy consumption. CHI 2010, 1985--1994.  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Rao, N., Sant, G., and Rajan, S. C. An overview of Indian Energy Trends. 2009. Prayas, Energy Group, Pune, India.",
      "doi": ""
    },
    {
      "text": "Ricker, T. Toshiba's 32-inch power TV runs for 2 hours on integrated battery. http://www.webcitation.org/6DYzPLKwy",
      "doi": ""
    },
    {
      "text": "Rijal, H. B., Yoshida, H., and Umemiya, N. Investigation of the thermal comfort in Nepal. In International Symposium on Building Research and the Sustainability of the Built Environment in the Tropics, 243--262, 2002.",
      "doi": ""
    },
    {
      "text": "Shove, E., Lutzenhiser, L., Guy, S., Hackett, B., and Wilhite, H. Energy and social systems. Human Choice & Climate Change 1998, Springer, 291--326.",
      "doi": ""
    },
    {
      "text": "Thornberg, R. Informed grounded theory. Scandinavian Journal of Educational Research, 56, 2012, 243--259.",
      "doi": ""
    },
    {
      "text": "UNICEF and WHO Report. Progress on Drinking Water and Sanitation - 2012 Update. http://www.webcitation.org/6AndA3pKR",
      "doi": ""
    },
    {
      "text": "Varanshi, S. P. Using stabilised mud. The Hindu, 9/18/2010. http://www.webcitation.org/6AmgP0Erv",
      "doi": ""
    },
    {
      "text": "Vyas, D. Domestic Artefacts: Sustainability in the context of Indian Middle Class. ICIC 2012, 119--128.  ",
      "doi": "10.1145/2160881.2160900"
    },
    {
      "text": "Woodruff, A., Hasbrouck, J., and Augustin. S. A bright green perspective on sustainable choices. CHI 2008, 313--322.  ",
      "doi": "10.1145/1357054.1357109"
    },
    {
      "text": "World Energy Outlook 2010. IEA. www.iea.org/Textbase/npsum/weo2010sum.pdf",
      "doi": ""
    },
    {
      "text": "World Population Data Sheet 2012, Population Reference Bureau, http://www.prb.org/pdf12/2012-population-data-sheet_eng.pdf",
      "doi": ""
    }
  ]
}