{
  "doi": "10.1145/2470654.2470711",
  "title": "Regularly visited patches in human mobility",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "395-398",
  "year": 2013,
  "badges": [],
  "abstract": "In this paper, we propose a new analytic unit for human mobility analysis -- the patch. We developed a process to identify Regularly Visited Patches (RVP) and a set of metrics to characterize and measure their spatial patterns. Using a large dataset of Foursquare check-ins as a test bed, we show that RVP analysis reveals fundamental patterns of human mobility and will lead to promising research with strong implications for businesses.",
  "authors": [
    {
      "name": "Yan Qu",
      "institution": "placenous.com, Hamden, Connecticut, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558235356",
      "orcid": "missing"
    },
    {
      "name": "Jun Zhang",
      "institution": "Pitney Bowes Inc., Shelton, Connecticut, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659405966",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ankerst, M., Breunig, M. M., Kriegel, H.-P. & Sander, J. OPTICS: ordering points to identify the clustering structure. In Proc. SIGMOD Rec. 28, 49--60, 1999.  ",
      "doi": "10.1145/304181.304187"
    },
    {
      "text": "Cheng, Z., Caverlee, J., Lee, K. & Sui, D. Z. Exploring millions of footprints in location sharing services. In Proc. AAAI ICWSM 2011.",
      "doi": ""
    },
    {
      "text": "Cranshaw, J., Schwartz, R., Hong, J. I., & Sadeh, N. The livehoods project: Utilizing social media to understand the dynamics of a city. In Proc. ICWSM 2012.",
      "doi": ""
    },
    {
      "text": "González, M. C., Hidalgo, C. A. & Barabási, A.-L. Understanding individual human mobility patterns. Nature 458, 238--238, 2009.",
      "doi": ""
    },
    {
      "text": "Isaacman, S., Becker, R., Cáceres, R., Kobourov, S., Martonosi, M., Rowland, J., Varshavsky, A. Identifying important places in people's lives from cellular network data. Pervasive Computing, 133--151, 2011 ",
      "doi": "10.5555/2021975.2021988"
    },
    {
      "text": "Lindqvist, J., Cranshaw, J., Wiese, J., Hong, J. & Zimmerman, J. I'm the mayor of my house: examining why people use foursquare - a social-driven location sharing application. In Proc. CHI 2011, 2409--2418.  ",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "Pirolli, P.L. Information foraging theory: Adaptive interaction with information. Vol. 2. Oxford University Press, USA, 2007. ",
      "doi": "10.5555/1450927"
    }
  ]
}