{
  "doi": "10.1145/2470654.2466200",
  "title": "How does it play better?: exploring user testing and biometric storyboards in games user research",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1499-1508",
  "year": 2013,
  "badges": [],
  "abstract": "Improving game design is a hard task. Few methods are available in games user research (GUR) to test formally how game designs work for players. In particular, the usefulness of user tests (UTs) for game designers has not been fully studied in the CHI community. We propose a novel GUR method called Biometric Storyboards (BioSt) and present a study demonstrating how a Classic UT and a BioSt UT both help designers create a better gameplay experience. In addition, we show that BioSt can help designers deliver significantly better visuals, more fun, and higher gameplay quality than designing without UTs and that classic UTs do not provide this significant advantage. Our interviews support the idea that BioSt provides more nuanced game design improvement. The design implication is that a game designed with the BioSt method will result in high gameplay quality.",
  "tags": [
    "physiological measures",
    "storyboards",
    "user experience",
    "games user research",
    "games",
    "user testing",
    "visualization"
  ],
  "authors": [
    {
      "name": "Pejman Mirza-Babaei",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81484656474/rel-imgonly/screenshot2012-02-16at20.43.31.png",
      "acmid": "81484656474",
      "orcid": "missing"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "University of Ontario Institute of Technology, Oshawa, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    },
    {
      "name": "John Gregory",
      "institution": "University of Ontario Institute of Technology, Oshawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557485956",
      "orcid": "missing"
    },
    {
      "name": "Nick Collins",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100445146",
      "orcid": "missing"
    },
    {
      "name": "Geraldine Fitzpatrick",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ambinder, M. Biofeedback in Gameplay: How Valve Measures Physiology to Enhance Gaming Experience. Presentation at GDC 2011, (2011).",
      "doi": ""
    },
    {
      "text": "Bernhaupt, R., ed. Evaluating User Experience in Games. Springer, Berlin, 2010. ",
      "doi": "10.5555/1830456"
    },
    {
      "text": "Bradley, M. M. and Lang, P. J. Measuring emotion: The self-assessment manikin and the semantic differential. J Behav Ther Exp Psy 25, 1 (1994), pp. 49--59.",
      "doi": ""
    },
    {
      "text": "Brooke, J. SUS-A quick and dirty usability scale. Usability evaluation in industry, 1996.",
      "doi": ""
    },
    {
      "text": "Cacioppo, J. T., Tassinary, L. G., and Berntson, G., eds. Handbook of Psychophysiology. Cambridge University Press, 2007.",
      "doi": ""
    },
    {
      "text": "Church, D. Formal abstract design tools. Game Developer Magazine, August (1999).",
      "doi": ""
    },
    {
      "text": "Drachen, A., Nacke, L. E., Yannakakis, G., and Pedersen, A. L. Correlation between heart rate, electrodermal activity and player experience in first-person shooter games. SIGGRAPH Sandbox (2010), pp. 49--54.  ",
      "doi": "10.1145/1836135.1836143"
    },
    {
      "text": "Fairclough, S. H. Fundamentals of physiological computing. Interact Comput 21, 1--2 (2009), 133--145.  ",
      "doi": "10.1016/j.intcom.2008.10.011"
    },
    {
      "text": "Hazlett, R. Using Biometric Measurement to Help Develop Emotionally Compelling Games. In K. Isbister and N. Schaffer, eds., Game Usability. Morgan Kaufmann, Burlington, MA, 2008.",
      "doi": ""
    },
    {
      "text": "Isbister, K. and Schaffer, N. Game Usability. Morgan Kaufmann, Burlington, MA, 2008.",
      "doi": ""
    },
    {
      "text": "Kivikangas, J. M., Chanel, G., Cowley, B., et al. A review of the use of psychophysiological methods in game research. JGVW 3, 3 (2011), 181--199.",
      "doi": ""
    },
    {
      "text": "Law, E. L.-C. The measurability and predictability of user experience. Proc. of EICS'11 (2011), pp. 1--10.  ",
      "doi": "10.1145/1996461.1996485"
    },
    {
      "text": "Malone, T. Toward a theory of intrinsically motivating instruction. Cognitive Science 5, 4 (1981), 333--369.",
      "doi": ""
    },
    {
      "text": "Mandryk, R. L. and Atkins, M. S. A fuzzy physiological approach for continuously modeling emotion during interaction with play technologies. Int J Hum-Comput St, (2007), 329--347.  ",
      "doi": "10.1016/j.ijhcs.2006.11.011"
    },
    {
      "text": "Medler, B., John, M., and Lane, J. Data cracker: developing a visual game analytic tool for analyzing online gameplay. Proc. of CHI'11 (2011), 2365--2374.  ",
      "doi": "10.1145/1978942.1979288"
    },
    {
      "text": "Medlock, M. C., Wixon, D., and Terrano, M. Using the RITE method to improve products: A definition and a case study. Proc. of UPA'02, 2002.",
      "doi": ""
    },
    {
      "text": "Mirza-Babaei, P., Long, S., Foley, E., and McAllister, G. Understanding the Contribution of Biometrics to Games User Research. Proc. of DiGRA 2011, (2011).",
      "doi": ""
    },
    {
      "text": "Mirza-Babaei, P., Nacke, L. E., Fitzpatrick, G., et al. Biometric storyboards: visualising game user research data. Proc. of CHI EA'12 (2012), pp. 2315--2320.  ",
      "doi": "10.1145/2212776.2223795"
    },
    {
      "text": "Nacke, L. E. and Lindley, C. Affective Ludology, Flow and Immersion in a First-Person Shooter: Measurement of Player Experience. Loading 3, 5 (2009).",
      "doi": ""
    },
    {
      "text": "Pagulayan, R. J., Keeker, K., Wixon, D., and Romero, R. L. User-centered design in games. The Human-Computer Interaction Handbook, 2003, pp. 883--906. ",
      "doi": "10.5555/772072.772128"
    },
    {
      "text": "Ravaja, N. Contributions of Psychophysiology to Media Research: Review and Recommendations. Media Psychology 6, 2 (2004), pp. 193--235.",
      "doi": ""
    },
    {
      "text": "Ravaja, N., Turpeinen, M., Saari, T., Puttonen, S., and Keltikangas-Järvinen, L. The psychophysiology of James Bond: Phasic emotional responses to violent video game events. Emotion 8, 1 (2008), pp. 114--120.",
      "doi": ""
    },
    {
      "text": "Sweetser, P. and Wyeth, P. GameFlow: a model for evaluating player enjoyment in games. CiE 3, 3 (2005).  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Wallner, G. and Kriglstein, S. A spatiotemporal visualization approach for the analysis of gameplay data. Proc. of CHI'12 (2012), pp. 1115--1124.  ",
      "doi": "10.1145/2207676.2208558"
    },
    {
      "text": "Watson, D., Clark, L.A., and Tellegen, A. Development and validation of brief measures of positive and negative affect: The PANAS scales. Journal of Personality and Social Psychology 54, 6 (1988), pp. 1063--1070.",
      "doi": ""
    },
    {
      "text": "Zammitto, V. The Science of Play Testing: EA's Methods for User Research. Presentation at GDC 2011.",
      "doi": ""
    }
  ]
}