{
  "doi": "10.1145/2470654.2481404",
  "title": "Using behavioral data to identify interviewer fabrication in surveys",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2911-2920",
  "year": 2013,
  "badges": [],
  "abstract": "Surveys conducted by human interviewers are one of the principal means of gathering data from all over the world, but the quality of this data can be threatened by interviewer fabrication. In this paper, we investigate a new approach to detecting interviewer fabrication automatically. We instrument electronic data collection software to record logs of low-level behavioral data and show that supervised classification, when applied to features extracted from these logs, can identify interviewer fabrication with an accuracy of up to 96%. We show that even when interviewers know that our approach is being used, have some knowledge of how it works, and are incentivized to avoid detection, it can still achieve an accuracy of 86%. We also demonstrate the robustness of our approach to a moderate amount of label noise and provide practical recommendations, based on empirical evidence, on how much data is needed for our approach to be effective.",
  "tags": [
    "data collection",
    "supervised classification",
    "data quality",
    "user logging",
    "behavioral data",
    "curbstoning",
    "surveys",
    "hci4d"
  ],
  "authors": [
    {
      "name": "Benjamin Birnbaum",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100432154",
      "orcid": "missing"
    },
    {
      "name": "Gaetano Borriello",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100123081/rel-imgonly/me.jpg",
      "acmid": "81100123081",
      "orcid": "missing"
    },
    {
      "name": "Abraham D. Flaxman",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100509713",
      "orcid": "missing"
    },
    {
      "name": "Brian DeRenzi",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316488426",
      "orcid": "missing"
    },
    {
      "name": "Anna R. Karlin",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100344510/rel-imgonly/81100344510.jpg",
      "acmid": "81100344510",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baker, R. P. New technology in survey research: Computer-assisted personal interviewing (CAPI). Social Science: Computer Review 10, 2 (1992), 145--157.",
      "doi": "10.1177/089443939201000202"
    },
    {
      "text": "Bennett, A. Toward a solution of the \"cheater problem\" among part-time research investigators. J. Marketing 2 (1948), 470--474.",
      "doi": ""
    },
    {
      "text": "Birnbaum, B. Algorithmic Approaches to Detecting Interviewer Fabrication in Surveys. PhD thesis, U. Washington, 2012.",
      "doi": ""
    },
    {
      "text": "Birnbaum, B., et al. Automated quality control for mobile data collection. In DEV (2012), 1:1--1:10.  ",
      "doi": "10.1145/2160601.2160603"
    },
    {
      "text": "Blaya, J. A., et al. E-health technologies show promise in developing countries. Health Aff. (Millwood) 29, 2 (2010), 244--51.",
      "doi": ""
    },
    {
      "text": "Bredl, S., et al. A statistical approach to detect cheating interviewers. Tech. Rep. 39, University Giessen, Center for International Development and Environmental Research (ZEU), 2008.",
      "doi": ""
    },
    {
      "text": "Breiman, L. Random forests. Machine Learning 45 (2001), 5--32.  ",
      "doi": "10.1023/A%3A1010933404324"
    },
    {
      "text": "Bushery, J. M., et al. Using date and time stamps to detect interviewer falsification. Proc. ASA (Survey Research Methods) (1999), 316--320.",
      "doi": ""
    },
    {
      "text": "Caruana, R., et al. An empirical evaluation of supervised learning in high dimensions. In ICML (2008).  ",
      "doi": "10.1145/1390156.1390169"
    },
    {
      "text": "Chen, K., et al. USHER: Improving data quality with dynamic forms. IEEE Trans. Knowledge and Data Engineering 23, 8 (2010), 1138--1153.  ",
      "doi": "10.1109/TKDE.2011.31"
    },
    {
      "text": "Cho, M. J., et al. Inferential methods to identify possible interviewer fraud using leading digit preference patterns and design effect matrices. Proc. ASA (Survey Research Methods Section) (2003), 936--941.",
      "doi": ""
    },
    {
      "text": "Couper, M. P. Usability evaluation of computer-assisted survey instruments. Social Science: Computer Review 18, 4 (2000), 384--396.  ",
      "doi": "10.1177/089443930001800402"
    },
    {
      "text": "Couper, M. P., and Kreuter, F. Using paradata to explore item level response times in surveys. J. Royal Statistical Society: A (2012).",
      "doi": ""
    },
    {
      "text": "Crespi, L. P. The cheater problem in polling. Public Opinion Quarterly 9, 4 (1945), 431--445.",
      "doi": ""
    },
    {
      "text": "DeRenzi, B., et al. Mobile phone tools for field-based health care workers in low-income countries. Mt. Sinai J. Medicine 78, 3 (2011), 406--418.",
      "doi": ""
    },
    {
      "text": "EpiSurveyor. http://www.episurveyor.org/.",
      "doi": ""
    },
    {
      "text": "Evans, F. B. On interviewer cheating. Public Opinion Quarterly 25 (1961), 126--127.",
      "doi": ""
    },
    {
      "text": "Ghazarian, A., and Noorhosseini, S. M. Automatic detection of users skill levels using high-frequency user interface events. User Modeling and User-Adapted Interaction 20, 2 (2010), 109--146.  ",
      "doi": "10.1007/s11257-010-9073-5"
    },
    {
      "text": "Hall, M., et al. The WEKA data mining software: An update. SIGKDD Explorations 11, 1 (2009).  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Hansen, S. E., and Marvin, T. Reporting on item times and keystrokes from Blaise audit trails. Tech. rep., 2001.",
      "doi": ""
    },
    {
      "text": "Hartung, C., et al. Open Data Kit: Tools to build information services for developing regions. In ICTD (2010).  ",
      "doi": "10.1145/2369220.2369236"
    },
    {
      "text": "Hilbert, D. M., and Redmiles, D. F. Extracting usability information from user interface events. ACM Comp. Surveys 32, 4 (2000), 384--421.  ",
      "doi": "10.1145/371578.371593"
    },
    {
      "text": "Hong, H. S., et al. Adoption of a PDA-based home hospice care system for cancer patients. Comput. Inform. Nurs. 27, 6 (2009), 365--71.",
      "doi": ""
    },
    {
      "text": "Hood, C. C., and Bushery, J. M. Getting more bang from the reinterview buck: Identifying \"at risk\" interviewers. Proc. ASA (Survey Research Methods Section) (1997), 820--824.",
      "doi": ""
    },
    {
      "text": "Hurst, A., et al. Automatically detecting pointing performance. In IUI (2008).  ",
      "doi": "10.1145/1378773.1378776"
    },
    {
      "text": "Inciardi, J. A. Fictitious data in drug abuse research. Intl. J. Addictions 16 (1981), 377--380.",
      "doi": ""
    },
    {
      "text": "Judge, G., and Schechter, L. Detecting problems in survey data using Benford's Law. J. Human Resources 44, 1 (2009), 1--24.",
      "doi": ""
    },
    {
      "text": "Kiecker, P., and Nelson, J. E. Do interviewers follow telephone survey instructions? J. Market Research Society 38 (1996), 161--176.",
      "doi": ""
    },
    {
      "text": "Krejsa, E. A., et al. Evaluation of the quality assurance falsification interview used in the Census 2000 dress rehearsal. Proc. ASA (Survey Research Methods Section) (1999), 635--640.",
      "doi": ""
    },
    {
      "text": "Lal, S. O., et al. Palm computer demonstrates a fast and accurate means of burn data collection. J. Burn Care Rehabil. 21, 6 (2000), 559--61.",
      "doi": ""
    },
    {
      "text": "Li, J., et al. Using statistical models for sample design of a reinterview program. Proc. ASA (Survey Research Methods Section) (2009), 4681--4695.",
      "doi": ""
    },
    {
      "text": "Murphy, J., et al. A system for detecting interview falsification. In American Assoc. Public Opinion Research 59th Ann. Conf. (2004).",
      "doi": ""
    },
    {
      "text": "Parikh, T. S., et al. Mobile phones and paper documents: Evaluating a new approach for capturing microfinance data in rural india. In CHI (2006), 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Pendragon Forms. http://pendragonsoftware.com/.",
      "doi": ""
    },
    {
      "text": "Porras, J., and English, N. Data-driven approaches to identifying interviewer data falsification: The case of health surveys. Proc. ASA (Survey Research Methods Section) (2004), 4223--4228.",
      "doi": ""
    },
    {
      "text": "Ratan, A. L., et al. Managing microfinance with paper, pen and digital slate. In ICTD (2010).  ",
      "doi": "10.1145/2369220.2369255"
    },
    {
      "text": "Rzeszotarski, J. M., and Kittur, A. Instrumenting the crowd: Using implicit behavioral measures to predict task performance. In UIST (2011).  ",
      "doi": "10.1145/2047196.2047199"
    },
    {
      "text": "Schreiner, I., et al. Interviewer falsification in census bureau surveys. Proc. ASA (Survey Research Methods Section) (1988), 491--496.",
      "doi": ""
    },
    {
      "text": "Shäfer, C., et al. Automatic identification of faked and fraudulent interviews in surveys by two different methods. Proc. ASA (Survey Research Methods Section) (2004), 4318--4325.",
      "doi": ""
    },
    {
      "text": "Stieger, S., and Reips, U.-D. What are participants doing while filling in an online questionnaire: A paradata collection tool and an empirical study. Computers in Human Behavior 26, 6 (2010), 1488--1495.  ",
      "doi": "10.1016/j.chb.2010.05.013"
    },
    {
      "text": "Turner, C. F., et al. Falsification in epidemiologic surveys: Detection and remediation. Tech. Rep. 53, Research Triangle Institute, 2002.",
      "doi": ""
    },
    {
      "text": "United Nations Dept. of Economic and Social Affairs, Population Division. World Urbanization Prospects, 2011.",
      "doi": ""
    },
    {
      "text": "United Nations Development Programme. The Human Development Report, 2011.",
      "doi": ""
    }
  ]
}