{
  "doi": "10.1145/2470654.2481329",
  "title": "Does my password go up to eleven?: the impact of password meters on password selection",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2379-2388",
  "year": 2013,
  "badges": [],
  "abstract": "Password meters tell users whether their passwords are \"weak\" or \"strong.\" We performed a laboratory experiment to examine whether these meters influenced users' password selections when they were forced to change their real passwords, and when they were not told that their passwords were the subject of a study. We observed that the presence of meters yielded significantly stronger passwords. We performed a followup field experiment to test a different scenario: creating a password for an unimportant account. In this scenario, we found that the meters made no observable difference: participants simply reused weak passwords that they used to protect similar low-risk accounts. We conclude that meters result in stronger passwords when users are forced to change existing passwords on \"important\" accounts and that individual meter design decisions likely have a marginal impact.",
  "authors": [
    {
      "name": "Serge Egelman",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81315488724/rel-imgonly/me.jpg",
      "acmid": "81315488724",
      "orcid": "missing"
    },
    {
      "name": "Andreas Sotirakopoulos",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657373",
      "orcid": "missing"
    },
    {
      "name": "Ildar Muslukhov",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656188",
      "orcid": "missing"
    },
    {
      "name": "Konstantin Beznosov",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/do/10.1145/contrib-81100388506/rel-imgonly/kosta_soups.jpg",
      "acmid": "81100388506",
      "orcid": "missing"
    },
    {
      "name": "Cormac Herley",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323490981",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "John the Ripper. http://www.openwall.com/john/. Accessed: January 4, 2013.",
      "doi": ""
    },
    {
      "text": "Adams, A., and Sasse, M. A. Users are not the enemy. Communications of The ACM 42 (December 1999), 40--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Alexa Internet, Inc. Alexa top 500 global sites. http://www.alexa.com/topsites/global;1, 2012. Accessed: April 23, 2012.",
      "doi": ""
    },
    {
      "text": "Besmer, A., Watson, J., and Lipford, H. R. The impact of social navigation on privacy policy configuration. In Proceedings of the Sixth Symposium on Usable Privacy and Security, ACM (New York, NY, USA, 2010).  ",
      "doi": "10.1145/1837110.1837120"
    },
    {
      "text": "Bonneau, J. The science of guessing: analyzing an anonymized corpus of 70 million passwords. In IEEE Symp. Security and Privacy (2012).  ",
      "doi": "10.1109/SP.2012.49"
    },
    {
      "text": "Castelluccia, C., Duermuth, M., and Perito, D. Adaptive password-strength meters from markov models. In Proceedings of the Network & Distributed System Security Symposium (NDSS), San Diego, CA (2012).",
      "doi": ""
    },
    {
      "text": "D.A. Norman. The Way I See It: When security gets in the way. Interactions 16, 6 (2009), 60--63.  ",
      "doi": "10.1145/1620693.1620708"
    },
    {
      "text": "Dell'Amico, M., Michiardi, P., and Roudier, Y. Password strength: An empirical analysis. In IEEE INFOCOM 2010, IEEE (March 2010), 1--9. ",
      "doi": "10.5555/1833515.1833671"
    },
    {
      "text": "Egelman, S., Felt, A. P., and Wagner, D. Choice architecture and smartphone privacy: There's a price for that. In The 2012 Workshop on the Economics of Information Security (WEIS) (2012).",
      "doi": ""
    },
    {
      "text": "Egelman, S., Molnar, D., Christin, N., Acquisti, A., Herley, C., and Krishnamurthi, S. Please continue to hold: An empirical study on user tolerance of security delays. In Proceedings (online) of the 9th Workshop on Economics of Information Security (Cambridge, MA, June 2010).",
      "doi": ""
    },
    {
      "text": "Florêncio, D., and Herley, C. A large-scale study of web password habits. In Proceedings of the 16th International Conference on the World Wide Web, ACM Press (New York, NY, USA, 2007), 657--666.  ",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "Forget, A., Chiasson, S., Van Oorschot, P., and Biddle, R. Improving text passwords through persuasion. In Proceedings of the 4th symposium on Usable privacy and security, ACM (2008), 1--12.  ",
      "doi": "10.1145/1408664.1408666"
    },
    {
      "text": "Herley, C., and van Oorschot, P. C. A research agenda acknowledging the persistence of passwords. IEEE Security & Privacy 10, 1 (January/February 2012), 28--36. ",
      "doi": "10.5555/2360743.2360824"
    },
    {
      "text": "J. Yan and A. Blackwell and R. Anderson and A. Grant. Password Memorability and Security: Empirical Results. IEEE Security & Privacy (2004).  ",
      "doi": "10.1109/MSP.2004.81"
    },
    {
      "text": "Komanduri, S., Shay, R., Kelley, P. G., Mazurek, M. L., Bauer, L., Christin, N., Cranor, L. F., and Egelman, S. Of Passwords and People: Measuring the Effect of Password-Composition Policies. In CHI '11: Proceeding of the 29th SIGCHI Conference on Human Factors in Computing Systems, ACM Press (New York, NY, USA, 2011).  ",
      "doi": "10.1145/1978942.1979321"
    },
    {
      "text": "Kuo, C., Romanosky, S., and Cranor, L. Human selection of mnemonic phrase-based passwords. In Proceedings of the second symposium on Usable privacy and security, ACM (2006), 67--78.  ",
      "doi": "10.1145/1143120.1143129"
    },
    {
      "text": "R. Morris and K. Thompson. Password Security: A Case History. Comm. ACM (1979).  ",
      "doi": "10.1145/359168.359172"
    },
    {
      "text": "Schechter, S., Herley, C., and Mitzenmacher, M. Popularity is everything: A new approach to protecting passwords from statistical-guessing attacks. In Proc. HotSec'10 (2010). ",
      "doi": "10.5555/1924931.1924935"
    },
    {
      "text": "Shay, R., Komanduri, S., Kelley, P. G., Leon, P. G., Mazurek, M. L., Bauer, L., Christin, N., and Cranor, L. F. Encountering stronger password requirements: user attitudes and behaviors. In Proceedings of the Sixth Symposium on Usable Privacy and Security, SOUPS '10, ACM (New York, NY, USA, 2010), 2:1--2:20.  ",
      "doi": "10.1145/1837110.1837113"
    },
    {
      "text": "Sotirakopoulos, A. Influencing users password choice through peer pressure. Master's thesis, University of British Columbia, 2011.",
      "doi": ""
    },
    {
      "text": "Thaler, R., and Sunstein, C. Nudge: Improving decisions about health, wealth, and happiness. Yale University Press, New Haven and London, 2008.",
      "doi": ""
    },
    {
      "text": "Ur, B., Kelley, P. G., Komanduri, S., Lee, J., Maass, M., Mazurek, M. L., Passaro, T., Shay, R., Vidas, T., Bauer, L., Christin, N., and Cranor, L. F. How does your password measure up? the effect of strength meters on password creation. In Proceedings of the 21st USENIX Security Symposium (2012). ",
      "doi": "10.5555/2362793.2362798"
    },
    {
      "text": "W. E. Burr, D. F. Dodson W. T. Polk. Electronic Authentication Guideline. In NIST Special Publication 800--63 (2006).",
      "doi": ""
    },
    {
      "text": "Weir, M., Aggarwal, S., Collins, M., and Stern, H. Testing metrics for password creation policies by attacking large sets of revealed passwords. In Proc. ACM CCS '10 (2010).  ",
      "doi": "10.1145/1866307.1866327"
    },
    {
      "text": "Weir, M., Aggarwal, S., de Medeiros, B., and Glodek, B. Password cracking using probabilistic context-free grammars. In The 30th IEEE Symposium on Security and Privacy, IEEE (2009), 391--405.  ",
      "doi": "10.1109/SP.2009.8"
    }
  ]
}