{
  "doi": "10.1145/2470654.2466260",
  "title": "Powering the cellphone revolution: findings from mobile phone charging trials in off-grid Kenya",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1959-1968",
  "year": 2013,
  "badges": [],
  "abstract": "Can human-powered devices solve the electricity gap for the millions of rural Africans adopting mobile phones? Findings from our long-term evaluation of two personal crank-based charging systems in Kenya reveal that small hand and leg-powered devices do have potential to meet the needs of rural mobile phone users. Unfortunately, device breakage, theft and incompatibility with handsets, coupled with lack of consumer credit and poorly functioning markets for these goods mean these represent only a partial solution to the mobile phone charging problem. Drawing from our fieldwork, we motivate a HCI4D/ICTD design and evaluation agenda that better accounts for unique individuals' geographic, financial, and economic circumstances or their human computer ecosystem. Key strategies for implementing this agenda are engaging with diverse users on their own terms and conducting long-term qualitative evaluations to reveal how acceptance and usability change over time.",
  "authors": [
    {
      "name": "Susan P. Wyche",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/do/10.1145/contrib-81314492849/rel-imgonly/wyche__susan-2021-1-2.jpg.headshot.small.jpg",
      "acmid": "81314492849",
      "orcid": "missing"
    },
    {
      "name": "Laura L. Murphy",
      "institution": "Tulane University, New Orleans, LA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503657693",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bungoma County. Government of Kenya, 2010, Available online: https://opendata.go.ke/facet/counties/Bungoma?tags=kenya.",
      "doi": ""
    },
    {
      "text": "\"Energy technology: Cheaper and better solar-powered electric lights promise to do away with kerosenefuelled lanterns,\" The Economist, September 1, 2012.",
      "doi": ""
    },
    {
      "text": "\"Freeplay Companion Integrated Flashlight Radio,\" HealthGoods.com, 2012. Available online: http://www.healthgoods.com/ProductDetails.asp?Prod uctCode=FP-NM03867FO.",
      "doi": ""
    },
    {
      "text": "\"The Real Digital Divide,\" The Economist, March 10, 2005.",
      "doi": ""
    },
    {
      "text": "World Energy Outlook 2009. International Energy Agency, Paris, France, 2009.",
      "doi": ""
    },
    {
      "text": "Best, M., \"Understanding Our Knowledge Gaps: Or, Do We Have an ICT4D Field? And Do We Want One?,\" Information Technologies & International Development Journal 6, Special Edition (2010), 49--52.",
      "doi": ""
    },
    {
      "text": "Bevan, N., \"International standards for HCI and usability,\" Int. J. Human-Computer Studies 55 (2001), 533--552.  ",
      "doi": "10.1006/ijhc.2001.0483"
    },
    {
      "text": "Burns, M. \"Nokia throws down a 15 bike cell phone charger, techcrunch.com, 2010. Available online: http://techcrunch.com/2010/2006/2003/nokia-throwsdown-a-e2015-bike-cell-phone-charger/.",
      "doi": ""
    },
    {
      "text": "Cooper, A., The Inmates Are Running the Asylum. Sams, Indianapolis, IN, 1999. ",
      "doi": "10.5555/553473"
    },
    {
      "text": "DeRenzi, B., Parikh, T., Mitchell, M., Chemba, M., Schellenberg, D., Lesh, N., Sims, C., Maokola, W., Hamisi, Y. and Borriello, G. \"e-IMCI: Improving Pediatric Health Care in Low-Income Countries,\" Proc. of CHI'08, ACM (2008), 753--762.  ",
      "doi": "10.1145/1357054.1357174"
    },
    {
      "text": "Dhir, A., Kaur, P., Jere, N. and Albidewi, I., \"Understanding the mobile phone battery--Human interaction for developing world A perspective of feature phone users in Africa,\" Proc. of BCFIC'12, IEEE (2012), 127--134.",
      "doi": ""
    },
    {
      "text": "Donner, J., \"Research Approaches to Mobile Use in the Developing World: A Review of the Literature,\" The Information Society 24, 3 (2008), 140--159.  ",
      "doi": "10.1080/01972240802019970"
    },
    {
      "text": "Dugdale, A., \"Nokia's Bicycle Charger Kit Could Be the World's Smartest Peripheral for Dumbphones,\" Fast Company, June 2, 2010.",
      "doi": ""
    },
    {
      "text": "Gupta, A., Thies, W., Cutrell, E. and Balakrishnan, R., \"mClerk: Enabling Mobile Crowdsourcing in Developing Regions,\" Proc. of CHI'12, ACM (2012), 1843--1852.  ",
      "doi": "10.1145/2207676.2208320"
    },
    {
      "text": "Ho, M.R., Smyth, T.N., Kam, M. and Dearden, A., \"Human-Computer Interaction for Development: The Past, Present, and Future,\" Information Technology and International Development (ITID) 5, 4 (2009).",
      "doi": ""
    },
    {
      "text": "Jacobson, A., \"Connective Power: Solar Electrification and Social Change in Kenya,\" World Development 35, 1 (2007), 144--162.",
      "doi": ""
    },
    {
      "text": "Kam, M., Agarwal, A., Kumar, A., Lal, S., Mathur, A., Tewari, A. and Canny, J., \"Designing E-Learning Games for Rural Children in India: A Format for Balancing Learning with Fun,\" Proc. of DIS '08, ACM (2008), 58--67.  ",
      "doi": "10.1145/1394445.1394452"
    },
    {
      "text": "Kee, E., \"Freeplay Companion announced,\" CoolestGadgets.com, 2008. Available online: http://www.coolest-gadgets.com/20080123/freeplaycompanion-announced/.",
      "doi": ""
    },
    {
      "text": "Kumar, A., Reddy, P., Tewari, A., Agarwal, A. and Kam, M., \"Improving Literacy in Developing Countries Using Speech Recognition-Supported Games on Mobile Devices,\" Proc. of CHI'12, ACM (2012), 1149--1158.  ",
      "doi": "10.1145/2207676.2208564"
    },
    {
      "text": "Lombardi, C. \"Nokia unveils bicycle-powered phone charger,\" CNET, 2010. Available online: http://news.cnet.com/8301--11128_11123--2000667720006654.html.",
      "doi": ""
    },
    {
      "text": "Marsden, G. \"Mobile in Africa: Doing HCI Differently in the Developing World\" {video}, 2007. Available online: http://www.youtube.com/watch?v=qp1_eVcjwpc.",
      "doi": ""
    },
    {
      "text": "Mok, S.C. New Village Gadgets: Synergy of humanpowered generation and ultra-efficient electrical appliances for Poverty Eradication Proc. of IEEE Global Humanitarian Technology Conference'12, IEEE (2011), 25--29.  ",
      "doi": "10.1109/GHTC.2011.12"
    },
    {
      "text": "Murphy, L., \"AIDS and Kitchen Gardens: Insights from a Village in Western Kenya,\" Journal of Population and Environment and Planning D: Society and Space 29, 3--5 (2008), 133--161.",
      "doi": ""
    },
    {
      "text": "Murphy, L.L. and Priebe, A.E., \"My co-wife can borrow my mobile phone! Gendered Geographies of Cell Phone Usage and Significance for Rural Kenyans,\" Gender Technology and Development 15, 1 (2011), 1--23.",
      "doi": ""
    },
    {
      "text": "Papanek, V., Design for the Real World: Human Ecology and Social Change (2nd ed.). Academy Press Chicago, 1985.",
      "doi": ""
    },
    {
      "text": "Paradiso, J. and Starner, T., \"Energy Scavenging for Mobile and Wireless Electronics,\" IEEE Pervasive Computing 4, 1 (2005), 18--27.  ",
      "doi": "10.1109/MPRV.2005.9"
    },
    {
      "text": "Pierce, J. and Paulos, E., \"Beyond energy monitors: interaction, energy, and emerging energy systems,\" Proc. of CHI'12, ACM (2012), 665--674  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "Pierce, J. and Paulos, E., \"Second-Hand Interactions: Investigating Reacquisition and Disposession Practices around Domestic Objects,\" Proc. of CHI'11, ACM (2011), 2385--2394.  ",
      "doi": "10.1145/1978942.1979291"
    },
    {
      "text": "Quick, D. \"Nokia's Bicycle Charger Kit a stroke of genius,\" gizmag.com, 2010. Available online: http://www.gizmag.com/nokia-bicycle-chargerkit/15312/.",
      "doi": ""
    },
    {
      "text": "Sengers, P. and Gaver, B., \"Staying Open to Interpretation: Engaging Multiple Measning in Design and Evaluation,\" Proc. of DIS'06, ACM (2006), 99108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Stear, R. and Pearson, K., \"Power Play: Freeplay Energy and the Freeplay Foundation Expand Access to Energy, Information, and Education,\" innovation 3, 4 (2008), 51--78.",
      "doi": ""
    },
    {
      "text": "Suchman, L., \"Located Accountabilities in Technology Production,\" Scandinavian Journal of Information Systems 14, 2 (2002), 91--105. ",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Wesolowski, A., Eagle, N., Noor, A.M., Snow, R.W. and Buckee, C.O., \"Heterogeneous Mobile Phone Ownership and Usage Patterns in Kenya,\" PLoS ONE 7, 4 (2012).",
      "doi": ""
    },
    {
      "text": "Wyche, S.P. and Murphy, L.L., \"'Dead China-Make' Phones Off the Grid: Investigating and Designing for Mobile Phone Use in Rural Africa,\" Proc. of DIS'12, ACM (2012), 186--195.  ",
      "doi": "10.1145/2317956.2317985"
    }
  ]
}