{
  "doi": "10.1145/2470654.2481407",
  "title": "The effect of global instructions on think-aloud testing",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2941-2944",
  "year": 2013,
  "badges": [],
  "abstract": "Verbal protocols are the primary tool for understanding users' task-solving behaviors during usability testing. We investigated whether the classic think-aloud and a think-aloud with an explicit instruction leads to different task-solving performance compared to silent working. The results suggest that the classic method had no impact on task performance whereas the explicit instruction led to an increase in within-page and between-page navigation and scrolling activity. The classic method was linked to an increase in mental workload in terms of effort and frustration. The explicit think-aloud led to an increase in mental demand, performance, effort and frustration.",
  "authors": [
    {
      "name": "Sharon McDonald",
      "institution": "University of Sunderland, Sunderland, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100298458",
      "orcid": "missing"
    },
    {
      "name": "Helen Petrie",
      "institution": "University of York, York, North Yorkshire, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022960",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barendregt, W., Bekker, M. M., Bouwhuis, D. G., and Baauw, E. 2006. Identifying usability and fun problems in a computer game during first use and after some practice. International Journal of Human-Computer Studies, 64(9), pp. 830--846.  ",
      "doi": "10.1016/j.ijhcs.2006.03.004"
    },
    {
      "text": "Ericsson, K. A. & Simon, H. A., 1993. Protocol analysis: Verbal reports as data revised edition. MIT Press.",
      "doi": ""
    },
    {
      "text": "Fox, M. C., Ericsson, K. A. & Best, R., 2011. Do procedures for verbal reporting of thinking have to be reactive? A meta-analysis and recommendations for best reporting methods. Psychological Bulletin, 137(2), pp. 316--344",
      "doi": ""
    },
    {
      "text": "Gerjets, P., Kammerer, Y. & Werner, B., 2011. Measuring spontaneous and instructed evaluation processes during Web search: Integrating concurrent thinking-aloud protocols and eye-tracking data. Learning and Instruction, 21(2), pp. 220--231.",
      "doi": ""
    },
    {
      "text": "Hart, S. G. and Staveland, L. E., 1988. Development of NASA-TLX: results of empirical and theoretical research. In: Hancock and Meshkati, eds. Human mental workload. Amsterdam: Elsevier, pp. 139--183.",
      "doi": ""
    },
    {
      "text": "Hertzum, M., Hansen, K. D. & Andersen, H. H. K., 2009. Scrutinising usability evaluation: does thinking aloud affect behaviour and mental workload? Behaviour & Information Technology, 28(2), pp. 165--181.  ",
      "doi": "10.1080/01449290701773842"
    },
    {
      "text": "McDonald, S., Edwards, H. Zhao, T., 2012. Exploring think-alouds in usability testing: an international survey. IEEE TP, vol. 55, no. 1 pp. 2--19.",
      "doi": ""
    },
    {
      "text": "Olmsted-Hawala, E. L., Murphy, E. D, Hawala, S., and Ashenfelter, K. T. 2010 \"Think-aloud protocols: a comparison of three think-aloud protocols for use in testing data-dissemination web sites for usability,\" In Proceedings of CHI 2010, pp. 2381--2390.  ",
      "doi": "10.1145/1753326.1753685"
    },
    {
      "text": "Zhao, T. T., McDonald, S., Edwards, H. M. 2012, The Impact of two different think-aloud instructions in a usability test: a case of just following orders? Behaviour & Information Technology, pp. 1--2. http://www.tandfonline.com/doi/full/10.1080/0144929X.2012.708786",
      "doi": ""
    }
  ]
}