{
  "doi": "10.1145/2470654.2466212",
  "title": "I can do text analytics!: designing development tools for novice developers",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1599-1608",
  "year": 2013,
  "badges": [],
  "abstract": "Text analytics, an increasingly important application domain, is hampered by the high barrier to entry due to the many conceptual difficulties novice developers encounter. This work addresses the problem by developing a tool to guide novice developers to adopt the best practices employed by expert developers in text analytics and to quickly harness the full power of the underlying system. Taking a user centered task analytical approach, the tool development went through multiple design iterations and evaluation cycles. In the latest evaluation, we found that our tool enables novice developers to develop high quality extractors on par with the state of art within a few hours and with minimal training. Finally, we discuss our experience and lessons learned in the context of designing user interfaces to reduce the barriers to entry into complex domains of expertise.",
  "authors": [
    {
      "name": "Huahai Yang",
      "institution": "IBM Research-Almaden, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651350",
      "orcid": "missing"
    },
    {
      "name": "Daina Pupons-Wickham",
      "institution": "IBM Software - Silicon Valley, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558323956",
      "orcid": "missing"
    },
    {
      "name": "Laura Chiticariu",
      "institution": "IBM Research-Almaden, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100467498",
      "orcid": "missing"
    },
    {
      "name": "Yunyao Li",
      "institution": "IBM Research-Almaden, San Jose, California, USA",
      "img": "/do/10.1145/contrib-81409597969/rel-imgonly/yunyao9.jpg",
      "acmid": "81409597969",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Nguyen",
      "institution": "IBM Software - Silicon Valley, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556234756",
      "orcid": "missing"
    },
    {
      "name": "Arnaldo Carreno-Fuentes",
      "institution": "IBM Research-Almaden, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502803789",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brauer, F., Rieger, R., Mocan, A., and Barczynski, W. M. Enabling information extraction by inference of regular expressions from sample entities. In CIKM (2011).  ",
      "doi": "10.1145/2063576.2063763"
    },
    {
      "text": "Burnett, M., and Gottfried, H. Graphical definitions: Expanding spreadsheet languages through direct manipulation and gestures. ACM Transa. on Comput.-Hum. Interact. (TOCHI) 5, 1 (1998), 1--33.  ",
      "doi": "10.1145/274444.274445"
    },
    {
      "text": "Chiticariu, L., Krishnamurthy, R., Li, Y., Raghavan, S., Reiss, F., and Vaithyanathan, S. SystemT: an algebraic approach to declarative information extraction. In ACL (2010). ",
      "doi": "10.5555/1858681.1858695"
    },
    {
      "text": "Crifasi, T. Hold your thoughts, SAP and NetBase will soon analyse your sentiments in the Cloud. Post in Bluefin Solutions Insights Blog, published on 12/15/2011, last accessed on 09/12/2012, http://bit.ly/vCpLgH.",
      "doi": ""
    },
    {
      "text": "Cunningham, H., Maynard, D., Bontcheva, K., and Tablan, V. GATE: an architecture for development of robust hlt applications. In ACL (2002).  ",
      "doi": "10.3115/1073083.1073112"
    },
    {
      "text": "Cypher, A., and Halbert, D. Watch what I do: programming by demonstration. 1993. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "DiGiano, C., and Eisenberg, M. Self-disclosing design tools: a gentle introduction to end-user programming. In DIS (1995).  ",
      "doi": "10.1145/225434.225455"
    },
    {
      "text": "Doan, A., Gravano, L., Ramakrishnan, R., and Vaithyanathan, S. Special issue on managing information extraction. SIGMOD Record 37, 4 (2008).",
      "doi": ""
    },
    {
      "text": "Ennals, R., Brewer, E. A., Garofalakis, M. N., Shadle, M., and Gandhi, P. Intel Mash Maker: join the web. SIGMOD Record 36, 4 (2007), 27--33.  ",
      "doi": "10.1145/1361348.1361355"
    },
    {
      "text": "Gro-Klumanna, A., and Hautschb, N. When machines read the news: Using automated text analytics to quantify high frequency news-implied market reactions. Journal of Empirical Finance 18, 2 (2011), 321--340.",
      "doi": ""
    },
    {
      "text": "Guo, P. J., Kandel, S., Hellerstein, J. M., and Heer, J. Proactive wrangling: mixed-initiative end-user programming of data transformation scripts. In UIST (2011).  ",
      "doi": "10.1145/2047196.2047205"
    },
    {
      "text": "Guzdial, M. Software-realized scaffolding to facilitate programming for science learning. Interactive Learning Environments 4, 1 (1994).",
      "doi": ""
    },
    {
      "text": "Hailpern, B., and Tarr, P. Model-driven development: The good, the bad, and the ugly. IBM systems journal 45, 3 (2006), 451--461.  ",
      "doi": "10.1147/sj.453.0451"
    },
    {
      "text": "Hundhausen, C. D., Farley, S. F., and Brown, J. L. Can direct manipulation lower the barriers to computer programming and promote transfer of training?: An experimental study. ACM Trans. Comput.-Hum. Interact. 16, 3 (Sept. 2009), 13:1--13:40.  ",
      "doi": "10.1145/1592440.1592442"
    },
    {
      "text": "Hutchins, E., Hollan, J., and Norman, D. Direct manipulation interfaces. Human-computer interaction 1, 4 (1985), 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "IBM. Content Analytics with Enterprise Search Version 3.0. http://ibm.co/tun1ta, 2012.",
      "doi": ""
    },
    {
      "text": "IBM. InfoSphere BigInsights Version 2.0: https://ibm.biz/bdxmmt, 2012.",
      "doi": ""
    },
    {
      "text": "IBM. InfoSphere Streams Version 3.0: https://ibm.biz/bdxmmk, 2012.",
      "doi": ""
    },
    {
      "text": "Kahn, K. Toontalktm - an animated programming environment for children. Journal of Visual Languages & Computing 7, 2 (1996), 197--217.",
      "doi": ""
    },
    {
      "text": "Kandel, S., Paepcke, A., Hellerstein, J., and Heer, J. Wrangler: interactive visual specification of data transformation scripts. In CHI (2011).  ",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Kelleher, C., and Pausch, R. Lowering the barriers to programming: A taxonomy of programming environments and languages for novice programmers. CSUR 37, 2 (2005), 83--137.  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Ko, A., Abraham, R., Beckwith, L., Blackwell, A., Burnett, M., Erwig, M., Scaffidi, C., Lawrance, J., Lieberman, H., Myers, B., et al. The state of the art in end-user software engineering. CSUR 43, 3 (2011), 21.  ",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Ko, A., Myers, B., and Aung, H. Six learning barriers in end-user programming systems. In VL/HCC (2004).  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Leshed, G., Haber, E., Matthews, T., and Lau, T. Coscripter: automating & sharing how-to knowledge in the enterprise. In CHI (2008).  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Li, Y., Chu, V., Blohm, S., Zhu, H., and Ho, H. Facilitating pattern discovery for relation extraction with semantic-signature-based clustering. In CIKM (2011).  ",
      "doi": "10.1145/2063576.2063781"
    },
    {
      "text": "Li, Y., Krishnamurthy, R., Raghavan, S., Vaithyanathan, S., and Jagadish, H. V. Regular expression learning for information extraction. In EMNLP (2008). ",
      "doi": "10.5555/1613715.1613719"
    },
    {
      "text": "Liu, B., Chiticariu, L., Chu, V., Jagadish, H. V., and Reiss, F. R. Automatic Rule Refinement for Information Extraction. PVLDB (2010). ",
      "doi": "10.14778/1920841.1920916"
    },
    {
      "text": "Liu, X., Zhang, S., Wei, F., and Zhou, M. Recognizing named entities in tweets. In HLT (2011). ",
      "doi": "10.5555/2002472.2002519"
    },
    {
      "text": "Liu, X., Zhou, M., Zhou, X., Fu, Z., and Wei, F. Joint Inference of Named Entity Recognition and Normalization for Tweets. In ACL (2012). ",
      "doi": "10.5555/2390524.2390598"
    },
    {
      "text": "Lowe, W. Software for Content Analysis: A Review. bit.ly/QMCC4M (accessed on September 12, 2012).",
      "doi": ""
    },
    {
      "text": "Mack, R. L., Mukherjea, S., Soffer, A., Uramoto, N., Brown, E. W., Coden, A., Cooper, J. W., Inokuchi, A., Iyer, B., Mass, Y., Matsuzawa, H., and Subramaniam, L. V. Text analytics for life science using the unstructured information management architecture. IBM Systems Journal 43, 3 (2004), 490--515.  ",
      "doi": "10.1147/sj.433.0490"
    },
    {
      "text": "Mayer, R. E. The psychology of how novices learn computer programming. ACM Comput. Surv. 13, 1 (1981), 121--141.  ",
      "doi": "10.1145/356835.356841"
    },
    {
      "text": "Norman, D. The design of everyday things. 2002. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Pane, J., Myers, B., and Miller, L. Using HCI techniques to design a more usable programming system. In HCC (2002). ",
      "doi": "10.5555/795687.797801"
    },
    {
      "text": "Papert, S. Mindstorms: Children, computers, and powerful ideas. 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Patel, K., Bancroft, N., Drucker, S., Fogarty, J., Ko, A., and Landay, J. Gestalt: Integrated support for implementation and analysis in machine learning processes. In UIST (2010).  ",
      "doi": "10.1145/1866029.1866038"
    },
    {
      "text": "Patel, K., Fogarty, J., Landay, J., and Harrison, B. Investigating statistical machine learning as a tool for software development. In CHI (2008).  ",
      "doi": "10.1145/1357054.1357160"
    },
    {
      "text": "Pears, A., Seidman, S., Malmi, L., Mannila, L., Adams, E., Bennedsen, J., Devlin, M., and Paterson, J. A survey of literature on the teaching of introductory programming. In ACM SIGCSE Bulletin, vol. 39 (2007), 204--223.  ",
      "doi": "10.1145/1345375.1345441"
    },
    {
      "text": "Quintana, C., Reiser, B. J., Davis, E. A., Krajcik, J., Fretz, E., Duncan, R. G., Kyza, E., Edelson, D., and Soloway, E. A scaffolding design framework for software to support science inquiry. Journal of the Learning Sciences 13, 3 (2004).",
      "doi": ""
    },
    {
      "text": "Ritter, A., Clark, S., Mausam, and Etzioni, O. Named entity recognition in tweets: An experimental study. In EMNLP (2011). ",
      "doi": "10.5555/2145432.2145595"
    },
    {
      "text": "SAP. BusinessObjects Text Analysis: Text Services Platform Users Guide: http://bit.ly/pgjyml, 2012.",
      "doi": ""
    },
    {
      "text": "Soderland, S. Learning information extraction rules for semi-structured and free text. Machine Learning 34, 1-3 (1999), 233--272.  ",
      "doi": "10.1023/A%3A1007562322031"
    },
    {
      "text": "Text Analysis International Inc. Integrated development environments for natural language processing, 2012.",
      "doi": ""
    },
    {
      "text": "Wagstaff, K. Machine Learning that Matters. In ICML (2012).",
      "doi": ""
    },
    {
      "text": "Wong, J., and Hong, J. Making mashups with marmite: towards end-user programming for the web. In CHI (2007).  ",
      "doi": "10.1145/1240624.1240842"
    },
    {
      "text": "Wood, D., Bruner, J., and Ross, G. The role of tutoring and problem solving. Journal of Child Psychology and Psychiatry 17 (1976), 89--100.",
      "doi": ""
    }
  ]
}