{
  "doi": "10.1145/2470654.2481391",
  "title": "Hustling online: understanding consolidated facebook use in an informal settlement in Nairobi",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2823-2832",
  "year": 2013,
  "badges": [],
  "abstract": "Facebook is a global phenomenon, yet little is known about use of the site in urban parts of the developing world where the social network's users are increasingly located. We qualitatively studied Facebook use among 28 young adults living in Viwandani, an informal settlement, or slum, in Nairobi, Kenya. We find that to overcome the costs associated with Internet use, participants consolidated diverse online activities onto Facebook; here we focus on the most common practice--using Facebook to support income generation. Viwandani residents used the site to look for employment opportunities, market themselves, and seek remittances from friends and family abroad. We use our findings to motivate a design agenda for the urban poor built on an understanding that Facebook is used, with mixed-success, to support income generation. A key part of this agenda calls for developing ICT interventions grounded in users' existing practices rather than introducing new and unfamiliar ones.",
  "authors": [
    {
      "name": "Susan P. Wyche",
      "institution": "Michigan State University, East Lansing, Michigan, USA",
      "img": "/do/10.1145/contrib-81314492849/rel-imgonly/wyche__susan-2021-1-2.jpg.headshot.small.jpg",
      "acmid": "81314492849",
      "orcid": "missing"
    },
    {
      "name": "Andrea Forte",
      "institution": "Drexel University, Philadelphia, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100401804/rel-imgonly/forte150x150.jpg",
      "acmid": "81100401804",
      "orcid": "0000-0002-2941-339X"
    },
    {
      "name": "Sarita Yardi Schoenebeck",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557644556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kenya Demographic and Health Survey, Ministry of Health and ORC Macro, 2009, Available online: http://www.measuredhs.com/pubs/pdf/FR229/FR229.pdf.",
      "doi": ""
    },
    {
      "text": "Kenya the Unseen Majority: Nairobi's Two Million Slum-Dwellers, Amnesty International Publications, London, 2009, Available online: http://www.amnesty.org/en/library/info/AFR3",
      "doi": ""
    },
    {
      "text": "Antin, J. and Earp, M., \"With a little help from my friends: Self-interested and prosocial behavior on MySpace Music,\" Journal of the American Society for Information Science and Technology 61, 5 (2010), 952--96  ",
      "doi": "10.5555/1814508.1814518"
    },
    {
      "text": "Appadurai, A., \"Global Ethnoscapes: Notes and Queries for a Transnational Anthropology,\" in Fox, R.G. (ed.) Recapturing Anthropology: Working in the Present, Sante Fe, NM, School of American Research, 1991.",
      "doi": ""
    },
    {
      "text": "BizTechAfrica, \"Facebook for every phone on Orange,\" 2012, Available online: http://memeburn.com/2012/02/orange-to-bring-facebook-to-every-phone-in-africa/, 2012.",
      "doi": ""
    },
    {
      "text": "Bosch, T.E., \"Using online social networking for teaching and learning: Facebook use at the University of Cape Town,\" Communication 35, 2 (2009), 185--200.",
      "doi": ""
    },
    {
      "text": "boyd, d.m. and Ellison, N.B., \"Social Network Sites: Definition, History, and Scholarship,\" Journal of Computer-Mediated Communication 13, 1 (2007), Article 11.",
      "doi": "10.1111/j.1083-6101.2007.00383.x"
    },
    {
      "text": "Burrell, J. \"Is the digital divide a defunct framework?,\" globalpolicyjournal.com, 2013, Available online: http://www.globalpolicyjournal.com/.",
      "doi": ""
    },
    {
      "text": "Burrell, J., \"User Agency in the Middle Range: Rumors and the Reinvention of the Internet in Accra, Ghana,\" Science, Technology, & Human Values 36, 2 (2011), 139--159.",
      "doi": ""
    },
    {
      "text": "Davis, M., Planet of Slums. London:Verso, 2007.",
      "doi": ""
    },
    {
      "text": "1Donner, J., \"The rules of beeping: Exchanging messages using missed calls on mobile phones in sub-saharan Africa,\" Journal of Computer-Mediated Communication 13, 1 (2005).",
      "doi": "10.1111/j.1083-6101.2007.00383.x"
    },
    {
      "text": "Dourish, P. and Mainwaring, S.D. Ubicomp's Colonial Impulse Proc. of UbiComp'12, Springer, 2012, 133--142  ",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Dray, S.M., Siegal, D.A. and Kotzé, P., \"Indra's Net: HCI in the developing world,\" interactions 10, 2 (2003), 28--37.  ",
      "doi": "10.1145/637848.637860"
    },
    {
      "text": "Eagle, N., \"txteagle: Mobile Crowdsourcing,\" Internationalization, Design and Global Development 5623 (2009), 447--456.  ",
      "doi": "10.1007/978-3-642-02767-3_50"
    },
    {
      "text": "Ellison, N.B., Steinfield, C. and Lampe, C., \"The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites,\" Journal of Computer-Mediated Communication 12, 4 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Fiore, A.T., Taylor, L.S., Mendelsohn, G.A. and Hearst, M., \"Assessing Attractiveness in Online Dating Profiles,\" Proc. of CHI'08, ACM, 2008, 797--806.  ",
      "doi": "10.1145/1357054.1357181"
    },
    {
      "text": "Fisher, M., \"Facebook's Amazing Growth in the Developing World,\" The Atlantic, May 18, 2012.",
      "doi": ""
    },
    {
      "text": "Frederiksen, B.F., \"Popular Culture, Gender Relations and the Democratization of Everyday Life in Kenya,\" Journal of Southern African Studies 26, 2 (2000), 209--222.",
      "doi": ""
    },
    {
      "text": "Granovetter, M.S., \"Strength of Weak Ties,\" American Journal of Sociology 78, 6 (1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Gulyani, S., Bassett, E.M. and Talukdar, D., \"Living Conditions, Rents, and Their Determinants in the Slums of Nairobi and Dakar,\" Land Economics 88, 2 (2012), 251--274.",
      "doi": ""
    },
    {
      "text": "2Gupta, A., Thies, W., Cutrell, E. and Balakrishnan, R., \"mClerk: enabling mobile crowdsourcing in developing regions,\" Proc. of CHI'12, ACM, 2012, 1843--1852.  ",
      "doi": "10.1145/2207676.2208320"
    },
    {
      "text": "Hansson, P.-O. and Wihlborg, E., \"Internet café as a supportive educational arena:a case study from the urban slum of Kibera, Nairobi, Kenya,\" Proc. of INTED 2011.",
      "doi": ""
    },
    {
      "text": "Heeks, R., \"ICT4D2.0: A Manifesto,\" Developments Informatics Working Papers, University of Manchester, 2008.",
      "doi": ""
    },
    {
      "text": "Kapur, D., Remittances:The New Development Mantra? G-24 Discussion Paper Series, 2003.",
      "doi": ""
    },
    {
      "text": "Kemibaro, M.,\"Facebook cracks 1 million users in Kenya,\" {online blog}, 2010. Available online: http://www.moseskemibaro.com/2010/12/16/facebook-cracks-1-million-users-in-kenya/",
      "doi": ""
    },
    {
      "text": "Miller, D., Tales from Facebook. Cambridge, U.K, Polity Press, 2011.",
      "doi": ""
    },
    {
      "text": "Muindi, K., Zulu, E., Beguy, D., Mudege, N.N. and Batten, L., \"Characteristics of migrants in Nairobi's informal settlements.\" Proc. of XXVI IUSSP International Population Conference, 2009.",
      "doi": ""
    },
    {
      "text": "Murphy, L.L. and Priebe, A.E., \"My co-wife can borrow my mobile phone! Gendered Geographies of Cell Phone Usage and Significance for Rural Kenyans,\" Gender Technology and Development 15, 1 (2011), 1--23.",
      "doi": ""
    },
    {
      "text": "Mutua, W. \"Africa Facebook Phenomenon Nigeria, Kenya, South Africa,\" Afrinnovator, 2011, Available online: http://afrinnovator.com/blog/tag/facebook/.",
      "doi": ""
    },
    {
      "text": "Ndung'u, M.N., Waema, T.M. and Mitullah, W.V., \"Emerald Article: Factors influencing usage of new technologies in low-income households in Kenya: the case of Nairobi,\" info 14, 4 (2012), 52--64.",
      "doi": ""
    },
    {
      "text": "Peters, A., Oren, M.A. and Bidwell, N.J., Namibian and American Cultural Orientations Toward Facebook,\" In Extended Abstracts CHI'12, ACM, 2012, 2603--2608.  ",
      "doi": "10.1145/2212776.2223843"
    },
    {
      "text": "Porter, G., \"Mobile Phones, Livelihoods and the Poor in Sub-Saharan Africa: Review and Prospect,\" Geography Compass 6, 5 (2012), 241--259.",
      "doi": ""
    },
    {
      "text": "Prahalad, C.K., Fortune at the Bottom of the Pyramid, The: Eradicating Poverty Through Profits. Saddle River, NJ: Pearson Prentice Hall, 2004. ",
      "doi": "10.5555/1407298"
    },
    {
      "text": "Rangaswamy, N. and Cutrell, E., \"Anthropology, Development and ICTs: Slums, Youth and the Mobile Internet in Urban India,\" Proc. of ICTD'12, ACM, 2012, 85--93.  ",
      "doi": "10.1145/2160673.2160685"
    },
    {
      "text": "Reardon, T., Berdegué, J., Barrett, C.B. and Stamoulis, K., \"Household income diversification into rural nonfarm activities,\" in Haggblade, S., Hazell, P. and Reardon, T. (eds.), Transforming the Rural Nonfarm Economy, Baltimore, MD, Johns Hopkins Press, 2006.",
      "doi": ""
    },
    {
      "text": "Sambasivan, N., Rangaswamy, N., Cutrell, E. and Nardi, B., \"Ubicomp4D: Interaction and Infrastructure for International Development-The Case of Urban Indian Slums,\" Proc. UbiComp '09, Springer, 2009, 155--164.  ",
      "doi": "10.1145/1620545.1620570"
    },
    {
      "text": "Slater, D. and Kwami, J., \"Embeddedness and escape: Internet and mobile use as poverty reduction strategies in Ghana,\" In ISRG Working Papers: Information Society Research Group, 2005, Working Paper 4.",
      "doi": ""
    },
    {
      "text": "Strauss, A. and Corbin, J., Basics of qualitative research: Techniques and procedures for developing grounded theory. Thousand Oaks, CA: Sage Publications Inc., 1998.",
      "doi": ""
    },
    {
      "text": "Taffa, N. and Chepngeno, G., \"Determinants of health care seeking for childhood illnesses in Nairobi slums,\" Tropical Medicine and International Health 10, 3 (2005), 240--245.",
      "doi": ""
    },
    {
      "text": "Wanyonyi, T. and Barasa, L., \"100 Killed in Nairobi Fuel Fire,\" Daily Nation, Nairobi, Kenya, 2011. Available online: http://www.nation.co.ke/News/100-killed-in-Nairobi-fuel-fire/-/1056/1235082/-/838j0s/-/index.html.",
      "doi": ""
    },
    {
      "text": "Warah, R., \"Divided City: Information Poverty in Nairobi's Slums,\" U.N. Chronicle 41, 2 (2004), 74--76.",
      "doi": ""
    },
    {
      "text": "Wyche, S.P., Schoenebeck, S.Y. and Forte, A. \"'Facebook is a Luxury': An Exploratory Study of Social Media Use in Rural Kenya,\" Proc. of CSCW'13, ACM, 2013, (to appear).  ",
      "doi": "10.1145/2441776.2441783"
    },
    {
      "text": "Wyche, S.P., Smyth, T.N., Chetty, M., Aoki, P.M. and Grinter, R.E., \"Deliberate interactions: characterizing technology use in Nairobi, Kenya,\" Proc. of CHI'10, ACM, 2010, 2593--2602.  ",
      "doi": "10.1145/1753326.1753719"
    }
  ]
}