{
  "doi": "10.1145/2470654.2470754",
  "title": "Villains, architects and micro-managers: what tabula rasa teaches us about game orchestration",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "705-714",
  "year": 2013,
  "badges": [],
  "abstract": "Players of digital games are limited by the constraints of the game's implementation. Players cannot fly a kite, plant a tree or make friends with a dragon if these activities were not coded within the game. Game orchestration relaxes these restrictions by allowing players to create game narratives and settings as the game is being played. This enables players to express their creativity beyond the strictures of the game's implementation. We present Tabula Rasa, a novel game orchestration tool based on an efficient tabletop interface. Based on a study of 20 game orchestration sessions using Tabula Rasa, we identify five behavioural patterns adopted by orchestrators, and four styles of collaborative interaction between orchestrators and players. Finally, we present recommendations for designers of game orchestration systems.",
  "tags": [
    "tabletop gaming",
    "game design",
    "game orchestration"
  ],
  "authors": [
    {
      "name": "T.C. Nicholas Graham",
      "institution": "Queen's University, Kingston, Ontario, Canada",
      "img": "/do/10.1145/contrib-81392599672/rel-imgonly/81392599672.png",
      "acmid": "81392599672",
      "orcid": "0000-0001-6723-1936"
    },
    {
      "name": "Irina Schumann",
      "institution": "Queen's University, Kingston, Ontario, Canada & University of Magdeburg, Magdeburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498658589",
      "orcid": "missing"
    },
    {
      "name": "Mrunal Patel",
      "institution": "Queen's University, Kingston, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557949956",
      "orcid": "missing"
    },
    {
      "name": "Quentin Bellay",
      "institution": "Queen's University, Kingston, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498659874",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Agustin, M., Chuang, G., Delgado A., Ortega, A., Seaver, J. and Buchanan, J. W., Game sketching. In Proc. Digital Interactive Media in Entertainment and Arts, ACM Press (2007), 36--43.  ",
      "doi": "10.1145/1306813.1306829"
    },
    {
      "text": "Crabtree, A., Benford, S., Rodden, T., Capra, M., Flintham, M., Drozd, A., Tandavanitj, N., Adams, M. and Row Farr, J., The Cooperative Work of Gaming: Orchestrating a Mobile SMS Game. Computer-Supported Cooperative Work 16 (2007), 167--198.  ",
      "doi": "10.1007/s10606-007-9048-1"
    },
    {
      "text": "Evaldsson, A.-C. and Corsaro, W. A., Play and Games in the Peer Cultures of Preschool and Preadolescent Children: An Interpretive Approach. Childhood 4:377 (2008), 377--402.",
      "doi": ""
    },
    {
      "text": "Koleva, B., Taylor, I., Benford, S., Fraser, M., Greenhalgh, C., Schnaedelbach, H., vom Lehn, D., Heath, C., Row-Farr, J. and Adams, M. Orchestrating a Mixed Reality Performance. In Proc. Human Factors in Computing Systems, ACM Press (2001), 38--45.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Mazalek, A., Mironer, B., O'Rear, E. and Van Devender, D. The TViews Table Role-Playing Game, Journal of Virtual Reality 5(2008):8, (2008).",
      "doi": ""
    },
    {
      "text": "Mulcaster, R., Positions Wherein Those Primitive Circumstances Be Examined, Which Are Necessarie for the Training up of Children, originally published 1581, available in reprinted form by Thoemmes Press (1995).",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., Tang, A. and Judge, T. K., Creating scalable location-based games: lessons from Geocaching. Personal and Ubiquitous Computing (2011), 1--15.  ",
      "doi": "10.1007/s00779-011-0497-7"
    },
    {
      "text": "Oh, J.-Y., Stuerzlinger, W. and Danahy, J., SESAME: Towards Better 3D Conceptual Design Systems, In Proc. Designing Interactive Systems, ACM Press (2006), 80--89.  ",
      "doi": "10.1145/1142405.1142419"
    },
    {
      "text": "Oxford English Dictionary, Third Edition, Sept. 2004.",
      "doi": ""
    },
    {
      "text": "Peitz, J., Björk, S. and Jäppinen, A. Wizard's Apprentice - Gameplay-Oriented Design of a Computer-Augmented Board Game. In Proc. Advances in Computer Entertainment Technology, ACM Press (2006), article 18.  ",
      "doi": "10.1145/1178823.1178845"
    },
    {
      "text": "Peltz, C., Web Services Orchestration and Choreography, Computer 36:10 (2003), 46--52.  ",
      "doi": "10.1109/MC.2003.1236471"
    },
    {
      "text": "Piper, A. M., O'Brien, E., Ringel Morris, M. and Winograd, T., SIDES: A Cooperative Tabletop Computer Game for Social Skills Development, In Proc. Computer Supported Cooperative Work, ACM Press (2006), 1--10.  ",
      "doi": "10.1145/1180875.1180877"
    },
    {
      "text": "Roman, P. A. and Brown, D., Games - Just How Serious Are They? In Proc. Interservice/Industry Training, Simulation & Education Conference, MetaPress (2008), article 8013.",
      "doi": ""
    },
    {
      "text": "Salen, K. and Zimmerman, E., Rules of Play: Game Design Fundamentals. MIT Press (2003). ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Salovaara, A., Johnson, M., Toiskallio, K., Tiitta, S. and Turpeinen, M., Playmakers in Multiplayer Game Communities: their Importance and Motivations for Participation. In Proc. Advances in Computer Entertainment Technology (2005), 334--337.  ",
      "doi": "10.1145/1178477.1178540"
    },
    {
      "text": "Smith, J. D. and Graham, T. C. N. Raptor: Sketching Games with a Tabletop Computer. In Proc. Futureplay, ACM Press (2010), 191--198.  ",
      "doi": "10.1145/1920778.1920805"
    },
    {
      "text": "Strauss A. L. and Corbin J. Basics of Qualitative Research: Techniques and Procedures, 2nd ed. Sage (1998).",
      "doi": ""
    },
    {
      "text": "Tychsen, A., Hitchens, M., Brolund, T. and Kavakli, M., The Game Master. In Proc. Australasian Conf. on Interactive Entertainment (2005), 215--222. ",
      "doi": "10.5555/1109180.1109214"
    },
    {
      "text": "Wong, N. and Gutwin, C., Controlling an Avatar's Pointing Gestures in Desktop Collaborative Virtual Environments. In Proc. Group, ACM Press (2012).  ",
      "doi": "10.1145/2389176.2389180"
    }
  ]
}