{
  "doi": "10.1145/2470654.2470755",
  "title": "Playing with leadership and expertise: military tropes and teamwork in an arg",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "715-724",
  "year": 2013,
  "badges": [],
  "abstract": "Ad-hoc virtual teams often lack tools to formalize leadership and structure collaboration, yet they are often successful. How does this happen? We argue that the emergence of leadership and the development of expertise occurs in the process of taking action and in direct response to a lack of structure. Using a twinned set of eight modality sliders, we examine the interactions of fourteen players in an alternate reality game. We find that players adopted military language and culture to structure and arrange their play. We determine that it is critical to account for the context of play across these modalities in order to design appropriately for effective in-game virtual organizing.",
  "authors": [
    {
      "name": "Tamara Peyton",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81487653438/rel-imgonly/tpeyton-psu.jpg",
      "acmid": "81487653438",
      "orcid": "missing"
    },
    {
      "name": "Alyson L. Young",
      "institution": "University of Maryland, Baltimore County, Baltimore, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436597552",
      "orcid": "missing"
    },
    {
      "name": "Wayne Lutters",
      "institution": "University of Maryland, Baltimore County, Baltimore, Maryland, USA",
      "img": "/do/10.1145/contrib-81100142970/rel-imgonly/isrc_wlutters_hs2_small.jpg",
      "acmid": "81100142970",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bartle, R. Hearts, clubs, diamonds, spades: Players who suit MUDs. Journal of MUD Research, (1996).",
      "doi": ""
    },
    {
      "text": "Bell, B. S. and Kozlowski, S. W. J. A typology of virtual teams: Implications for effective leadership. Group and Organization Management 27, 1 (2002), 14--49.",
      "doi": ""
    },
    {
      "text": "Bogost, I. How to do things with videogames. University of Minnesota Press, MN, 2011.",
      "doi": ""
    },
    {
      "text": "Callois, R. Man, play and games. Thames and Hudson, London, 1962.",
      "doi": ""
    },
    {
      "text": "Chen, M. Leet noobs. Peter Lang Publishing, New York, 2011.",
      "doi": ""
    },
    {
      "text": "Chen, M. Communication, coordination and camaraderie in World of Warcraft. Games & Culture 4, 1 (2009), 47--73.",
      "doi": ""
    },
    {
      "text": "Chilton, P. Metaphor euphemism and the militarization of language. Current Research on Peace and Violence 10, 1 (1987), 7--19.",
      "doi": ""
    },
    {
      "text": "Consalvo, M. There is no magic circle. Games and Culture 4, 4 (2009), 408--417.",
      "doi": ""
    },
    {
      "text": "Crowston, K., Li, Q., Wei, K., Eseryel, Y., and Howison, J. Self-organization of teams in free/libre open source software development. Information and software technology journal 49, 6 (2007), 564--575.  ",
      "doi": "10.1016/j.infsof.2007.02.004"
    },
    {
      "text": "Deterding, S., Dixon, D., Khaled, R. and Nacke, L. From game design elements to gamefulness: Defining \"gamification.\" In Proc. MindTrek '11, ACM (2011), 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Eisenhardt, K. M. Building theories from case study research. The Academy of Management Review 14, 4 (1989), 532--550.",
      "doi": ""
    },
    {
      "text": "Gee, J. P. What video games have to teach us about learning and literacy (2nd Ed). Palgrave Macmillan, New York, 2007.",
      "doi": ""
    },
    {
      "text": "Huffaker, D., Want, J., Treem, J., Ahmad, M., Fullerton, L., Williams, D., Poole, M., and Contractor, N. The social behaviours of experts in massive multiplayer online role-playing games. In Proc. CSE'09, IEEE (2009).  ",
      "doi": "10.1109/CSE.2009.13"
    },
    {
      "text": "Huizinga, J. Homo Ludens: A Study of the Play-Element in Culture. Beacon Press, 1971.",
      "doi": ""
    },
    {
      "text": "Lutters, W. and Seaman, C. Revealing actual documentation usage in software maintenance through war stories. Information and Software Technology 49, 6 (June 2007), 576--587.  ",
      "doi": "10.1016/j.infsof.2007.02.013"
    },
    {
      "text": "McArthur, V., Peyton, T., Jenson, J., Taylor, T., & de Castell, S. Knowing, not doing: Modalities of gameplay expertise in World of Warcraft addons. Ext. Abstracts CHI 2011, ACM Press (2011), 100--110.  ",
      "doi": "10.1145/2212776.2212788"
    },
    {
      "text": "McGonigal, J. Gaming can make a better world. Long Beach, CA, 2010.",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Grian, H., and Williams, J. Participation, collaboration and spectatorship in an alternate reality game. In Proc. OZCHI'08, ACM Press (2008), 130--138.  ",
      "doi": "10.1145/1517744.1517787"
    },
    {
      "text": "Orr, J. E. Narratives at work: story telling as cooperative diagnostic activity. Proceedings of the 1986 ACM conference on Computer-supported cooperative work, ACM (1986), 62--72.  ",
      "doi": "10.1145/637069.637077"
    },
    {
      "text": "Palen, L., and Vieweg, S. The emergence of online widescale interaction in unexpected events: Assistance, alliance and retreat. In Proc. CSCW'08, ACM Press (2008), 117--126.  ",
      "doi": "10.1145/1460563.1460583"
    },
    {
      "text": "Population representation in the military services: Executive Summary. Office of the Undersecretary of Defense, Personnel and Readiness, 2010.",
      "doi": ""
    },
    {
      "text": "Piaget, J. Play, dreams and imitation in childhood. Taylor & Francis, 1999.",
      "doi": ""
    },
    {
      "text": "Preece, J. and Shneiderman, B. The reader-to-leader framework: Motivating technology-mediated social participation. AIS Transactions on Human-Computer Interaction 1, 1 (2009), 13--32.",
      "doi": ""
    },
    {
      "text": "Reeves, S., Brown, B., and Laurier, E. Experts at play: Understanding skilled expertise. Games and Culture 4, 3 (2009), 205--227.",
      "doi": ""
    },
    {
      "text": "Sherlock, L. Genre, activity and collaborative work and play in World of Warcraft: Places and problems of open systems in online systems in online gaming. Journal of Business and Technical Communication 23, 3 (July 2009), 263--293.",
      "doi": ""
    },
    {
      "text": "Shim, K. J., Ahmad, M. A., Pathak, N., and Srivastava, J. Inferring player ratings from performance data in massively multiplayer online role-playing games (MMORPGs). In Proc CSE'09, IEEE (2009), 119--1204.  ",
      "doi": "10.1109/CSE.2009.452"
    },
    {
      "text": "Stake, R. E. Case studies. in Denzin, N. K & Lincoln, Y. S., eds. Handbook of qualitative research, Sage, NY, 1994, 236--247.",
      "doi": ""
    },
    {
      "text": "Taylor, N., de Castell, S., Jenson, J., and Humphrey, M. Modeling play: Re-casting expertise in MMOGs. in Proc. SIGGRAPH 2011, ACM Press (2011), 49--53.  ",
      "doi": "10.1145/2018556.2018566"
    },
    {
      "text": "Taylor, T. L. The Assemblage of Play. Games and Culture 4, 4 (2009), 331--339.",
      "doi": ""
    },
    {
      "text": "Viegas, F. B., Wattenberg, M., Kriss, J., and Van Ham, F. Talk before you type.: Coordination in Wikipedia. In Proc. HICSS 2007, IEEE (2007), 78--87.  ",
      "doi": "10.1109/HICSS.2007.511"
    },
    {
      "text": "Yin, R. K. The case study crisis: Some answers. Administrative Science Quarterly 26, 1 (1981), 58--65.",
      "doi": ""
    },
    {
      "text": "Young, A. L., Gurzick, D., Lutters, W., Dombrowski, C., and Kim, J. Exploring infrastructure assemblage in virtual volunteer organizations. Ext. Abstracts CHI 2011, ACM Press (2011), 2649--2654.  ",
      "doi": "10.1145/2212776.2223851"
    },
    {
      "text": "Zhu, H., Kraut, R. E., Kittur, A., and Wang, Y.-C. Identifying shared leadership in Wikipedia. In Proc. CHI'11, ACM Press (2011), 3431--3434.  ",
      "doi": "10.1145/1978942.1979453"
    }
  ]
}