{
  "doi": "10.1145/2470654.2470739",
  "title": "LightCloth: senseable illuminating optical fiber cloth for creating interactive surfaces",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "603-606",
  "year": 2013,
  "badges": [],
  "abstract": "This paper introduces an input and output device that enables illumination, bi-directional data communication, and position sensing on a soft cloth. This \"LightCloth\" is woven from diffusive optical fibers. Since the fibers are arranged in parallel, the cloth has one-dimensional position information. Sensor-emitter pairs attached to bundles of contiguous fibers enable bundle-specific light input and output. We developed a prototype system that allows full-color illumination and 8-bit data input by infrared signals. We present as an application a chair with a LightCloth cover whose illumination pattern is specified using an infrared light pen. Here we describe the implementation details of the device and discuss possible interactions using the device.",
  "tags": [
    "illumination",
    "diffusive optical fiber",
    "position sensing",
    "light communication",
    "soft deformable user interface"
  ],
  "authors": [
    {
      "name": "Sunao Hashimoto",
      "institution": "JST ERATO Igarashi Design Interface Project, Bunkyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363603235",
      "orcid": "missing"
    },
    {
      "name": "Ryohei Suzuki",
      "institution": "JST ERATO Igarashi & The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556603256",
      "orcid": "missing"
    },
    {
      "name": "Youichi Kamiyama",
      "institution": "JST ERATO Igarashi Design Interface Project, Bunkyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659754048",
      "orcid": "missing"
    },
    {
      "name": "Masahiko Inami",
      "institution": "JST ERATO Igarashi & Keio University, Yokohama City, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424140",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "JST ERATO Igarashi & The University of Tokyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akita, J. Interactive Block Device System with Pattern Drawing Capability on Matrix LEDs, In Proc. CHI EA2012, 1059--1062.  ",
      "doi": "10.1145/2212776.2212385"
    },
    {
      "text": "Baudisch, P., Becker, T., and Rudeck, F. Lumino: tangible blocks for tabletop computers based on glass fiber bundles. In Proc. CHI2010, 1165--1174.  ",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "Harvill, Y.L., Zimmerman, T. G., and Grimaud, J.G. Motion sensor which produces an asymmetrical signal in response to symmetrical movement. U.S. Patent 5097252, (1989).",
      "doi": ""
    },
    {
      "text": "Jackson, D., Bartindale, T., and Olivier, P. 2009. FiberBoard: compact multi-touch display using channeled light. In Proc. ITS2009, 25--28.  ",
      "doi": "10.1145/1731903.1731908"
    },
    {
      "text": "Jansen, Y. Mudpad: fluid haptics for multitouch surfaces. In Proc. CHI EA 2010, 4351--4356.  ",
      "doi": "10.1145/1753846.1754152"
    },
    {
      "text": "Lumen. http://www.lumen.jp/",
      "doi": ""
    },
    {
      "text": "LumiGram. http://www.lumigram.com/",
      "doi": ""
    },
    {
      "text": "Nakajima, K., Itoh, Y., Tsukitani, T., Fujita, K., Kitamura, Y., and Kishino, F. FuSA2 Touch Display: Furry and Scalable Multi-touchable display. In Proc. ITS2011, 35--44.  ",
      "doi": "10.1145/2076354.2076361"
    },
    {
      "text": "Nakatsuma, K. and Shinoda, H. High accuracy position and orientation detection in two-dimensional communication network. In Proc. CHI2010, 2297--2306.  ",
      "doi": "10.1145/1753326.1753673"
    },
    {
      "text": "Sorin, F., Lestoquoy, G., Danto, S., Joannopoulos, J.D., and Fink, Y. Resolving optical illumination distributions along an axially symmetric photodetecting fiber, Optics Express, 18 (23), (2010), 24264--24275.",
      "doi": ""
    },
    {
      "text": "Sugimoto, M., Kodama, K., Nakamura, A., Kojima, M., and Inami, M. A Display-Based Tracking System: Display-Based Computing for Measurement Systems, In Proc. ICAT2007, 31--38.  ",
      "doi": "10.1109/ICAT.2007.7"
    },
    {
      "text": "Ueoka, R., Masuda, A., Murakami, T., and Hirose, M. RFID Textile and Map Making System for Large Area Positioning. In Proc. ISWC2009, 41--44.  ",
      "doi": "10.1109/ISWC.2009.39"
    },
    {
      "text": "Wakita, A., Ueno, M., and Nakano, A. pSurface: Fabric I/O Device for Architectural Algorithmic Design. In Proc. ALGODE TOKYO2011.",
      "doi": ""
    }
  ]
}