{
  "doi": "10.1145/2470654.2466467",
  "title": "\"Everybody knows what you're doing\": a critical design approach to personal informatics",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3403-3412",
  "year": 2013,
  "badges": [],
  "abstract": "We present an alternative approach to the design of personal informatics systems: instead of motivating people to examine their own behaviors, this approach promotes awareness of and reflection on the infrastructures behind personal informatics and the modes of engagement that they promote. Specifically, this paper presents an interface that displays personal web browsing data. The interface aims to reveal underlying infrastructure using several methods: drawing attention to the scope of mined data by displaying deliberately selected sensitive data, using purposeful malfunction as a way to encourage reverse engineering, and challenging normative expectations around data mining by displaying information in unconventional ways. Qualitative results from a two-week deployment show that these strategies can raise people's awareness about data mining, promote efficacy and control over personal data, and inspire reflection on the goals and assumptions embedded in infrastructures for personal data analytics.",
  "tags": [
    "personal informatics",
    "design strategies",
    "critical design"
  ],
  "authors": [
    {
      "name": "Vera Khovanskaya",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556232656",
      "orcid": "missing"
    },
    {
      "name": "Eric P.S. Baumer",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81311485671/rel-imgonly/dsc_3664-edit-square.png",
      "acmid": "81311485671",
      "orcid": "0000-0001-5338-4421"
    },
    {
      "name": "Dan Cosley",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100288358/rel-imgonly/3435035874_f9b2a1d423_o.jpg",
      "acmid": "81100288358",
      "orcid": "0000-0001-8108-1954"
    },
    {
      "name": "Stephen Voida",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100147302/rel-imgonly/steve_-_interactions__cropped_close_.png",
      "acmid": "81100147302",
      "orcid": "missing"
    },
    {
      "name": "Geri Gay",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367597457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, G., Blythe, M. and Sengers, P. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Trans. Computer-Human Interaction 12, 2 (June 2005), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Box, G. E. P. and Draper, N. R. Empirical model building and response surfaces. Wiley, Hoboken, NJ, 1987. ",
      "doi": "10.5555/17317"
    },
    {
      "text": "Carver, C. and Scheier, M. F. On the self-regulation of behavior. Cambridge University Press, Cambridge, UK, 2001.",
      "doi": ""
    },
    {
      "text": "Chalmers, M., MacColl, I. and Bell, M. (2003). Seamful design: Showing the seams in wearable computing. Proc Eurowearable, IEE (2003), 11--16.",
      "doi": ""
    },
    {
      "text": "Collusion. http://www.mozilla.org/en-US/collusion/",
      "doi": ""
    },
    {
      "text": "Deterding, S., Sicart, M., Nacke, L., O'Hara, K. and Dixon, D. (2011). Gamification: Using game-design elements in non-gaming contexts. Ext. Abstracts CHI '11, ACM Press (2011), 2425--2428.  ",
      "doi": "10.1145/1979742.1979575"
    },
    {
      "text": "DiSalvo, C. Adversarial Design. MIT Press, Cambridge, MA, 2012. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Dunne, A., and Raby, F. Design noir: The secret life of electronic objects. Birkhäuser, Basel, Switzerland, 2001.",
      "doi": ""
    },
    {
      "text": "Endsley, M. R. The Role of Situation Awareness in Naturalistic Decision Making. In Zsambok, C. E. and Klein, G. A. (Eds.), Naturalistic decision making. Erlbaum, Hillsdale, NJ, 1997, 269--282.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. Persuasive computers: Perspectives and research directions. Proc. CHI '98, ACM Press (1998), 225--232.  ",
      "doi": "10.1145/274644.274677"
    },
    {
      "text": "Friedman, B. Value-sensitive design. interactions 3, 6 (1996), 16--23.  ",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Gaver, W. W. (2002). Designing for Homo Ludens. I3 Magazine, 12 (June 2002).",
      "doi": ""
    },
    {
      "text": "Jones, W. and Teevan, J. Personal information management. UW Press, Seattle, 2007.",
      "doi": ""
    },
    {
      "text": "Leahu, L., Schwenk, S. and Sengers, P. Subjective objectivity: Negotiating emotional meaning. Proc. DIS '08 ACM Press (2008), 425--434.  ",
      "doi": "10.1145/1394445.1394491"
    },
    {
      "text": "Li, I., Dey, A. K. and Forlizzi, J. A stage-based model of personal informatics systems. Proc. CHI 2010, ACM Press (2010), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Li, I., Dey, A. K. and Forlizzi, J. Know thyself: Monitoring and reflecting on facets of one's life. Ext. Abstracts CHI '10, ACM Press (2010), 4489--4492.  ",
      "doi": "10.1145/1753846.1754181"
    },
    {
      "text": "Li, I., Dey, A. K. and Forlizzi, J. Understanding my data, myself: Supporting self-reflection with ubicomp technologies. Proc. UbiComp '11, ACM Press (2011), 405--414.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Mandiberg, M. Oil Standard (2006), http://turbulence.org/works/oil/",
      "doi": ""
    },
    {
      "text": "Peesapati, S. T., Schwanda, V., Schultz, J., Lepage, M., Jeong, S. and Cosley, D. Pensieve: Supporting everyday reminiscence. Proc. CHI '10, ACM Press (2010), 2027-- 2036.  ",
      "doi": "10.1145/1753326.1753635"
    },
    {
      "text": "Redström, J., Jaksefic, P. and Ljungstrand, P. The ChatterBox. Proc. HandheM and Ubiquitous Comp. '99, Springer, 1999. ",
      "doi": "10.5555/647985.743874"
    },
    {
      "text": "Sengers, P. and Gaver, B. Design for Interpretation. Proc. HCII '05. Lawrence Erlbaum Associates (2005).",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K., David, S. and Kaye, J. Reflective design. Proc. Critical Computing, ACM Press (2005), 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Sosik, V. S., Zhao, X. and Cosley, D. See friendship, sort of: How conversation and digital traces might support reflection on friendships. Proc. CSCW '12, ACM Press (2012), 1145--1154.  ",
      "doi": "10.1145/2145204.2145374"
    },
    {
      "text": "Star, S. L. The ethnography of infrastructure. American Behavioral Scientist, 43, 3 (1999), 377--391.",
      "doi": ""
    },
    {
      "text": "Tang, K. P., Hong, J. I. and Siewiorek, D. P. Understanding how visual representations of location feeds affect end-user privacy concerns. Proc. UbiComp '11, ACM Press (2011), 207--216.  ",
      "doi": "10.1145/2030112.2030141"
    },
    {
      "text": "Top 5 Browsers. StatCounter (2012). http://gs.statcounter.com/#browser-ww-monthly201107-201206",
      "doi": ""
    },
    {
      "text": "Wilson, T. D. and Dunn, E. W. Self-knowledge: Its limits, value, and potential for improvement. Annual Review of Psychology, 55 (2004), 493--518.",
      "doi": ""
    }
  ]
}