{
  "doi": "10.1145/2470654.2481283",
  "title": "SPRWeb: preserving subjective responses to website colour schemes through automatic recolouring",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2069-2078",
  "year": 2013,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Colours are an important part of user experiences on the Web. Colour schemes influence the aesthetics, first impressions and long-term engagement with websites. However, five percent of people perceive a subset of all colours because they have colour vision deficiency (CVD), resulting in an unequal and less-rich user experience on the Web. Traditionally, people with CVD have been supported by recolouring tools that improve colour differentiability, but do not consider the subjective properties of colour schemes while recolouring. To address this, we developed SPRWeb, a tool that recolours websites to preserve subjective responses and improve colour differentiability - thus enabling users with CVD to have similar online experiences. To develop SPRWeb, we extended existing models of non-CVD subjective responses to CVD, then used this extended model to steer the recolouring process. In a lab study, we found that SPRWeb did significantly better than a standard recolouring tool at preserving the temperature and naturalness of websites, while achieving similar weight and differentiability preservation. We also found that recolouring did not preserve activity, and hypothesize that visual complexity influences activity more than colour. SPRWeb is the first tool to automatically preserve the subjective and perceptual properties of website colour schemes thereby equalizing the colour-based web experience for people with CVD.",
  "authors": [
    {
      "name": "David R. Flatla",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/do/10.1145/contrib-81460658260/rel-imgonly/mypicture2cropped.png",
      "acmid": "81460658260",
      "orcid": "missing"
    },
    {
      "name": "Katharina Reinecke",
      "institution": "Harvard University, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583575",
      "orcid": "0000-0001-7897-9325"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Krzysztof Z. Gajos",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Birch, J. Diagnosis of Defective Colour Vision, 2 ed. Oxford University Press, 2001.",
      "doi": ""
    },
    {
      "text": "Bonnardela, N., Piolata, A., and Bigot, L. L. The Impact of Colour on Website Appeal and Users' Cognitive Processes. Displays 32, 2 (2011), 69--80.",
      "doi": ""
    },
    {
      "text": "Brettel, H., Viénot, F., and Mollon, J. D. Computerized Simulation of Color Appearance for Dichromats. JOSA A 14, 10 (1997), 2647--2655.",
      "doi": ""
    },
    {
      "text": "Cole, B. L. The Handicap of Abnormal Colour Vision. Clinical and Experimental Optometry 87, 4-5 (2004), 258--275.",
      "doi": ""
    },
    {
      "text": "Coursaris, C. K., Sweirenga, S. J., and Watrall, E. An Empirical Investigation of Color Temperature and Gender Effects on Web Aesthetics. Journal of Usability Studies 3, 3 (2008), 103--117.",
      "doi": ""
    },
    {
      "text": "Cyr, D., Head, M., and Larios, H. Colour Appeal in Website Design Within and Across Cultures: A Multi-Method Evaluation. IJHCI 68, 1 (2010), 1--21.  ",
      "doi": "10.1016/j.ijhcs.2009.08.005"
    },
    {
      "text": "Eisemann, L. Pantone's Guide to Communicating with Color. Grafix Press, Ltd., 2000.",
      "doi": ""
    },
    {
      "text": "Flatla, D. R., and Gutwin, C. \"So That's What You See!\" Building Understanding with Personalized Simulations of Colour Vision Deficiency. In Proc. ASSETS '12 (2012), 167--174.  ",
      "doi": "10.1145/2384916.2384946"
    },
    {
      "text": "Frey, B. J., and Dueck, D. Clustering by Passing Messages Between Data Points. Science 315, 5814 (2007), 972--976.",
      "doi": ""
    },
    {
      "text": "Gorn, G. J., Chattopadhyay, A., Sengupta, J., and Tripathi, S. Waiting for the Web: How Screen Color Affects Time Perception. Journal of Marketing Research 41, 2 (2004), 215--225.",
      "doi": ""
    },
    {
      "text": "Gorn, G. J., Chattopadhyay, A., Yi, T., and Dahl, D. W. Effects of Color as an Executional Cue in Advertising: They're in the Shade. Management Science 43, 10 (1997), 1387--1400.  ",
      "doi": "10.5555/2885636.2885641"
    },
    {
      "text": "Greenfield, G. R., and House, D. H. Image Recoloring Induced by Palette Color Associations. In Proc. WSCG (2003), 189--196.",
      "doi": ""
    },
    {
      "text": "Hall, R., and Hanna, P. The Impact of Web Page Text-Background Colour Combinations on Readability, Retention, Aesthetics and Behavioural Intention. Behaviour & Information Technology 23, 3 (2004), 183--195.",
      "doi": ""
    },
    {
      "text": "Hardy, L. H., Rand, G., and Rittler, M. C. HRR Polychromatic Plates. JOSA 44, 7 (1954), 509--521.",
      "doi": ""
    },
    {
      "text": "Iaccarino, G., Malandrino, D., and Scarano, V. Personalizable Edge Services for Web Accessibility. In Proc. W4A (2006), 23--32.  ",
      "doi": "10.1145/1133219.1133224"
    },
    {
      "text": "Ichikawa, M., Tanaka, K., Kondo, S., Hiroshima, K., Ichikawa, K., Tanabe, S., and Fukami, K. Web-Page Color Modification for Barrier-Free Color Vision with Genetic Algorithm. In Proc. GECCO (2003), 2134--2146. ",
      "doi": "10.5555/1756582.1756698"
    },
    {
      "text": "Jacobs, K. W., and Frank E. Hustmyer, J. Effects of Four Psychological Primary Colors on GSR, Heart Rate and Respiration Rate. Perceptual and Motor Skills 38, 3 (1974), 763--766.",
      "doi": ""
    },
    {
      "text": "Kuhn, G., Oliveira, M., and Fernandes, L. An Efficient Naturalness-Preserving Image-Recoloring Method for Dichromats. IEEE Trans. Vis. & Comp. Graph. 14, 6 (2008), 1747--1754.  ",
      "doi": "10.1109/TVCG.2008.112"
    },
    {
      "text": "Meyer, G. W., and Greenberg, D. P. Color-Defective Vision and Computer Graphics Displays. IEEE CG&A 8, 5 (1988), 28--40.  ",
      "doi": "10.1109/38.7759"
    },
    {
      "text": "Nam, J., Ro, Y. M., Huh, Y., and Kim, M. Visual Content Adaptation According to User Perception Characteristics. IEEE Trans. Mult. 7, 3 (2005), 435--445.  ",
      "doi": "10.1109/TMM.2005.846801"
    },
    {
      "text": "Ou, L., Luo, M., Woodcock, A., and Wright, A. A Study of Colour Emotion and Colour Preference. Part I: Colour Emotions for Single Colors. Color Research & Application 29, 3 (2004), 232--240.",
      "doi": ""
    },
    {
      "text": "Reinhard, E., Adhikhmin, M., Gooch, B., and Shirley, P. Color Transfer Between Images. IEEE Comp. Graph. & App. 21, 5 (2001), 34--41.  ",
      "doi": "10.1109/38.946629"
    },
    {
      "text": "Solli, M., and Lenz, R. Color Emotions for Image Classification and Retrieval. In Proc. CGIV (2008).",
      "doi": ""
    },
    {
      "text": "Stone, M. A Field Guide to Digital Color. AK Peters, 2003. ",
      "doi": "10.5555/863149"
    },
    {
      "text": "Valdez, P., and Mehrabian, A. Effects of Color on Emotions. Journal of Experimental Psychology 123, 4 (1994), 394--409.",
      "doi": ""
    },
    {
      "text": "Wandell, B. A. Foundations of Vision. Sinauer Associates, 1995.",
      "doi": ""
    },
    {
      "text": "Wang, B., Yu, Y., Wong, T., Chen, C., and Xu, Y. Data-Driven Image Color Theme Enhancement. ACM Trans. Graph. 29, 6 (2010), 146.  ",
      "doi": "10.1145/1882261.1866172"
    },
    {
      "text": "Yang, C., and Peng, L. Automatic Mood-Transferring Between Color Images. IEEE Comp. Graph. & App. 28, 2 (2008), 52--61.  ",
      "doi": "10.1109/MCG.2008.24"
    }
  ]
}