{
  "doi": "10.1145/2470654.2481332",
  "title": "Using Checksums to Detect Number Entry Error",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2403-2406",
  "year": 2013,
  "badges": [],
  "abstract": "Number entry is a common task in many domains. In safety-critical environments such as air traffic control or on hospital wards, incorrect number entry can have serious harmful consequences. Research has investigated how interface designs can help prevent users from making number entry errors. In this paper, we present an experimental evaluation of two possible interface designs aimed at helping users detect number entry errors using the idea of a checksum: an additional (redundant) number that is related to the to-be-entered numbers in such a way that it is sufficient to verify the correctness of the checksum, as opposed to checking each of the entered numbers. The first interface requires users to check their own work with the help of the checksum; the second requires the user to enter the checksum along with the other numbers so that the system can do the checking. In each case, two numbers needed to be entered, while the third number served as a checksum. With the first interface, users caught only 36% of their errors. The second interface resulted in all errors being caught, but the need to enter the checksum increased entry time by 46%. When participants were allowed to choose between the two interfaces, they chose the second interface in only 12% of the cases. Although these results cannot be generalized to other specific contexts, the results illustrate the strengths and weaknesses of each way of using checksums to catch number entry errors. Hence our study can serve as a starting point for efforts to improve each method.",
  "tags": [
    "number entry",
    "checksums",
    "redundancy",
    "error detection"
  ],
  "authors": [
    {
      "name": "Sarah Wiseman",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502788334",
      "orcid": "missing"
    },
    {
      "name": "Anna L. Cox",
      "institution": "University College London, London, UK",
      "img": "/do/10.1145/contrib-81350567335/rel-imgonly/a.cox.png",
      "acmid": "81350567335",
      "orcid": "0000-0003-2231-2964"
    },
    {
      "name": "Duncan P. Brumby",
      "institution": "University College London, London, UK",
      "img": "/do/10.1145/contrib-81328487836/rel-imgonly/brumby.jpg",
      "acmid": "81328487836",
      "orcid": "missing"
    },
    {
      "name": "Sandy J.J. Gould",
      "institution": "University College London, London, UK",
      "img": "/do/10.1145/contrib-81502713252/rel-imgonly/s.gould.large.jpg",
      "acmid": "81502713252",
      "orcid": "missing"
    },
    {
      "name": "Sarah O'Carroll",
      "institution": "University College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558118856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brumby, D.P., Davies, S.C.E., Janssen, C.P., and Grace, J.J. Fast or safe? how performance objectives determine modality output choices while interacting on the move. Proceedings of the 2011 annual conference on Human factors in computing systems, (2011), 473--482.  ",
      "doi": "10.1145/1978942.1979009"
    },
    {
      "text": "Cauchi, A., Gimblett, A., Thimbleby, H., Curzon, P., and Masci, P. Safer \"5-key\" number entry user interfaces using Differential Formal Analysis. Proceedings of the 2012 BCS Conference on HumanComputer Interaction, (2012), 29--38. ",
      "doi": "10.5555/2377916.2377921"
    },
    {
      "text": "Chen, K., Hellerstein, J., and Parikh, T. Designing adaptive feedback for improving data entry accuracy. Proceedings of the 23nd annual ACM symposium on User interface software and technology, (2010).  ",
      "doi": "10.1145/1866029.1866068"
    },
    {
      "text": "Food and Drug Administration (FDA). MedSun: Newsletter #33, February 2009. MedSun: Newsletter #33, 2009. http://www.accessdata.fda.gov/scripts/cdrh/cfdocs/meds un/news/newsletter.cfm?news=33.",
      "doi": ""
    },
    {
      "text": "Oladimeji, P., Thimbleby, H., and Cox, A. Number entry interfaces and their effects on error detection. Human-Computer Interaction--INTERACT 2011, (2011), 178--185. ",
      "doi": "10.5555/2042283.2042302"
    },
    {
      "text": "Olsen, K.A. The $100,000 Keying Error. Computer 41, 4 (2008), 108--107.  ",
      "doi": "10.1109/MC.2008.135"
    },
    {
      "text": "The Health Foundation. Evidence Scan: Reducing prescribing errors. London, 2012.",
      "doi": ""
    },
    {
      "text": "Thimbleby, H. and Cairns, P. Reducing number entry errors: solving a widespread, serious problem. Journal of the Royal Society, Interface 7, 51 (2010), 1429--39.",
      "doi": ""
    },
    {
      "text": "Thimbleby, H. Ignorance of Interaction Programming Is Killing People. interactions XV.5, (2008), 52--57.  ",
      "doi": "10.1145/1390085.1390098"
    }
  ]
}