{
  "doi": "10.1145/2470654.2481318",
  "title": "TouchViz: a case study comparing two interfaces for data analytics on tablets",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2301-2310",
  "year": 2013,
  "badges": [],
  "abstract": "As more applications move from the desktop to touch devices like tablets, designers must wrestle with the costs of porting a design with as little revision of the UI as possible from one device to the other, or of optimizing the interaction per device. We consider the tradeoffs between two versions of a UI for working with data on a touch tablet. One interface is based on using the conventional desktop metaphor (WIMP) with a control panel, push buttons, and checkboxes -- where the mouse click is effectively replaced by a finger tap. The other interface (which we call FLUID) eliminates the control panel and focuses touch actions on the data visualization itself. We describe our design process and evaluation of each interface. We discuss the significantly better task performance and preference for the FLUID interface, in particular how touch design may challenge certain assumptions about the performance benefits of WIMP interfaces that do not hold on touch devices, such as the superiority of gestural vs. control panel based interaction.",
  "authors": [
    {
      "name": "Steven M. Drucker",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090466",
      "orcid": "0000-0002-5022-9343"
    },
    {
      "name": "Danyel Fisher",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81309487122/rel-imgonly/fn5a3561-copy.jpg",
      "acmid": "81309487122",
      "orcid": "missing"
    },
    {
      "name": "Ramik Sadana",
      "institution": "Microsoft Research & Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557280356",
      "orcid": "missing"
    },
    {
      "name": "Jessica Herron",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503669939",
      "orcid": "missing"
    },
    {
      "name": "m.c. schraefel",
      "institution": "University of Southampton, Southampton , United Kingdom",
      "img": "/do/10.1145/contrib-81311483103/rel-imgonly/81311483103.jpg",
      "acmid": "81311483103",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amar, R., Eagan, J., and Stasko, J., Low-Level Components of Analytic Activity in Information Visualization, in Proc. of IEEE InfoVis '05, Minneapolis, MN, October 2005, pp. 111--117.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Bau, O. and Mackay,W.. 2008. OctoPocus: a dynamic guide for learning gesture-based command sets. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, New York, NY, USA, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Baudel, T. 2006. From information visualization to direct manipulation: extending a generic visualization framework for the interactive editing of large datasets. In Proc. of UIST '06, New York, NY, USA, 67--76.  ",
      "doi": "10.1145/1166253.1166265"
    },
    {
      "text": "Bostock, M. , Ogievetsky, V., Heer, J. , D³ Data-Driven Documents, In IEEE Trans. Vis. and Comp. Graph (InfoVis '11), pp.2301--2309, Dec. 2011.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Browne, J., Lee, B., Carpendale, S., Riche, N, and Sherwood, T. Data analysis on interactive whiteboards through sketch-based interaction. In Proc Interactive Tabletops and Surfaces (ITS), November, 2011.  ",
      "doi": "10.1145/2076354.2076383"
    },
    {
      "text": "Forlines, C., Wigdor. D., Shen. C., and Balakrishnan, R. 2007. Direct-touch vs. mouse input for tabletop displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 647--656.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "Grammel, L., Tory, M., Storey, M. , How Information Visualization Novices Construct Visualizations, in Proc IEEE Trans. Vis. and Comp. Graph. (InfoVis, '10), vol.16, no.6, pp.943--952, Nov.-Dec. 2010.  ",
      "doi": "10.1109/TVCG.2010.164"
    },
    {
      "text": "Guimbretiere, F., Martin, A. and Winograd, T., Benefits of Merging Command Selection and Direct Manipulation. Transactions on Human-Computer Interaction, 12(3), pp 460--476, 2005.  ",
      "doi": "10.1145/1096737.1096742"
    },
    {
      "text": "Heer, J., Robertson, G.G., Animated Transitions in Statistical Data Graphics, in IEEE Trans. Vis and Comp. Graph. (Infovis '07)., vol.13, no.6, pp.1240--1247, Nov.Dec. 2007.  ",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Hutchins, E.L., Hollan, J.D., and Norman, D.A. 1985. Direct manipulation interfaces. Hum.-Comput. Interact. 1, 4 (December 1985), 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Heer, J. and Shneiderman. B. Interactive Dynamics for Visual Analysis. Queue 10, 2, Pages 30 (February 2012), 26 pages.  ",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Kolb, J., Rudner, B. and Reichert, M, Towards GestureBased Process Modeling on Multi-touch Devices. Lecture Notes in Business Information Processing, 1, Volume 112, Advanced Information Systems Engineering Workshops, Part 3, Chapter 8, Pages 280293. 2012.",
      "doi": ""
    },
    {
      "text": "Morris, M.R., Wobbrock, J.O. and Wilson, A.D. (2010). Understanding users' preferences for surface gestures. Proceedings of Graphics Interface (GI '10). Ottawa, Ontario (May 31-June 2, 2010). Toronto, Ontario: Canadian Info. Proc. Soc., pp. 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Nielsen, J. 2012. \"Jakob Nielsen's Alertbox: Browser and GUI Chrome.\" http://www.useit.com/alertbox/uichrome.html",
      "doi": ""
    },
    {
      "text": "North, C., Dwyer, T., Lee, B., Fisher, D. , Isenberg, P., Robertson, G. and Inkpen, K., Understanding Multitouch Manipulation for Surface Computing, in 12th IFIP TC13 Conf. in Human-Comp. Interaction (INTERACT 2009), Springer Verlag, August 2009.  ",
      "doi": "10.1007/978-3-642-03658-3_31"
    },
    {
      "text": "Shneiderman, B.1983. Direct Manipulation: A Step Beyond Programming Languages. IEEE Computer 16:8 (August 1983).  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Stolte, C., and Hanrahan, P., 2000. Polaris: A System for Query, Analysis and Visualization of MultiDimensional Relational Databases. In Proc. IEEE Infovis, 00. IEEE Computer Society, Washington, DC, USA. ",
      "doi": "10.5555/857190.857686"
    },
    {
      "text": "Wigdor, D., and Wixon, D. Brave NUI World. 2012. Morgan-Kauffamn.",
      "doi": ""
    },
    {
      "text": "Wickham, H.: {http://had.co.nz/ggplot2/} webcite ggplot2: An implementation of the Grammar of Graphics. 2008. {R package version 0.8}.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O., Morris, M.R. and Wilson, A.D. (2009). User-defined gestures for surface computing. In Proc. of SIGCHI '09. Boston, Massachusetts (April 4--9, 2009). New York: ACM Press, pp. 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Yee. W. 2009. Potential Limitations of Multi-touch Gesture Vocabulary: Differentiation, Adoption, Fatigue. Human-Computer Interaction. Novel Interaction Methods and Techniques. Lecture Notes in Computer Science, 2009, Volume 5611/2009, 291--300, ACM Press (2001), 9--18.  ",
      "doi": "10.1007/978-3-642-02577-8_32"
    }
  ]
}