{
  "doi": "10.1145/2470654.2466463",
  "title": "CrashAlert: enhancing peripheral alertness for eyes-busy mobile interaction while walking",
  "published": "2013-04-27",
  "proctitle": "CHI '13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3385-3388",
  "year": 2013,
  "badges": [],
  "abstract": "Mobile device use while walking, or eyes-busy mobile interaction, is a leading cause of life-threatening pedestrian collisions. We introduce CrashAlert, a system that augments mobile devices with a depth camera, to provide distance and location visual cues of obstacles on the user's path. In a realistic environment outside the lab, CrashAlert users improve their handling of potential collisions, dodging and slowing down for simple ones while lifting their head in more complex situations. Qualitative results outline the value of extending users' peripheral alertness in eyes-busy mobile interaction through non-intrusive depth cues, as used in CrashAlert. We present the design features of our system and lessons learned from our evaluation.",
  "authors": [
    {
      "name": "Juan David Hincapié-Ramos",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/do/10.1145/contrib-81460657470/rel-imgonly/phdpix_150dpi.jpg",
      "acmid": "81460657470",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Baudish, P., Rosenholtz, R., (2003) Halo: a technique for visualizing off-screen objects. CHI 2003.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Brewster, S. (2002) Overcoming the lack of screen space on mobile computers. Personal and Ubiquitous Computing, 1 (2), 81--96.  ",
      "doi": "10.1007/s007790200019"
    },
    {
      "text": "Brewster, S., Chohan, F., Brown, L. (2007) Tactile feedback for mobile ineractions. CHI 2007.  ",
      "doi": "10.1145/1240624.1240649"
    },
    {
      "text": "Goel, M., Findlater, L., Wobbrock, J. O. (2012) WalkType: Using Accelerometer Data to Accommodate Situational Impairments in Mobile Touch Screen Text Entry. CHI 2012.  ",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Kane, S. K., Wobbrock, J. O. and Smith, I. E. (2008) Getting Off the Treadmill: Evaluating Walking User Interfaces for Mobile Devices in Public Spaces. Proc. MobileHCI'08.  ",
      "doi": "10.1145/1409240.1409253"
    },
    {
      "text": "Nasar, J., Hecht, P., Wener, R. (2008) Mobile telephones, distracted attention, and pedestrian safety. Accident Analysis & Prevention 40, 69--75.",
      "doi": ""
    },
    {
      "text": "Neider, M. B., McCarley, J. S., Crowell, J. A., Kaczmarski, H., Kramer, A. F. (2010) Pedestrians, vehicles, and cell phones, Accident Analysis & Prevention, 42(2).",
      "doi": ""
    },
    {
      "text": "San Diego News (2012) How Risky Is Texting While Walking? http://www.10news.com/news/30530401/detail.html, last accessed: September 2012.",
      "doi": ""
    },
    {
      "text": "Stavrinos, D., Byington, K. W., Schwebel, D. C. (2011) Distracted walking: Cell phones increase injury risk for college pedestrians, Journal of Safety Research, 42(2).",
      "doi": ""
    },
    {
      "text": "Stewart, J., Bauman, S., Escobar, M., Hilden, J., Bihani, K., & Newman, M. W. (2008). Accessible contextual information for urban orientation. UbiComp '08.  ",
      "doi": "10.1145/1409635.1409679"
    },
    {
      "text": "TIME Magazine (2011), Friedman, M. http://newsfeed.time.com/2011/01/27/can-lamakers-bantexting-while-walking/, last accessed: September 2012.",
      "doi": ""
    },
    {
      "text": "Yatani, K. and Truong, K. N. 2009. An Evaluation of Stylusbased Text Entry Methods on Handheld Devices Studied in Different Mobility States. Pervasive and Mobile Computing, Vol. 5, No. 5, 496--506.  ",
      "doi": "10.1016/j.pmcj.2009.04.002"
    },
    {
      "text": "Yatani, K. and Truong, K.N. (2009) SemFeel: a user interface with semantic tactile feedback for mobile touch-screen devices. UIST 2009, 111--120.  ",
      "doi": "10.1145/1622176.1622198"
    },
    {
      "text": "Uddin, M. S. and Shioyama, T. (2005) Detection of pedestrian crossing and measurement of crossing length - an image-based navigational aid for blind people. Trans. on Intelligent Transportation Systems. IEEE, 2005.",
      "doi": ""
    }
  ]
}