{
  "doi": "10.1145/1518701.1518758",
  "title": "Fast gaze typing with an adjustable dwell time",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "357-360",
  "year": 2009,
  "badges": [],
  "abstract": "Previous research shows that text entry by gaze using dwell time is slow, about 5-10 words per minute (wpm). These results are based on experiments with novices using a constant dwell time, typically between 450 and 1000 ms. We conducted a longitudinal study to find out how fast novices learn to type by gaze using an adjustable dwell time. Our results show that the text entry rate increased from 6.9 wpm in the first session to 19.9 wpm in the tenth session. Correspondingly, the dwell time decreased from an average of 876 ms to 282 ms, and the error rates decreased from 1.28% to .36%. The achieved typing speed of nearly 20 wpm is comparable with the result of 17.3 wpm achieved in an earlier, similar study with Dasher.",
  "authors": [
    {
      "name": "Päivi Majaranta",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100135224/rel-imgonly/curly-middlesizepic.jpg",
      "acmid": "81100135224",
      "orcid": "missing"
    },
    {
      "name": "Ulla-Kaija Ahola",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607869",
      "orcid": "missing"
    },
    {
      "name": "Oleg Špakov",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390422",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Isokoski, P., and Linden, T. Effect of foreign language on text transcription performance: Finns writing English. Proc. NordiCHI 2004, ACM Press, 105--108.  ",
      "doi": "10.1145/1028014.1028032"
    },
    {
      "text": "MacKenzie, I. S. Motor behaviour models for human-computer interaction. In J. M. Carroll (Ed.), Toward a Multidisciplinary Science of Human-Computer Interaction. Morgan Kaufmann, 2003, 27--54.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. Phrase sets for evaluating text entry techniques. Ext. Abstracts CHI 2003, ACM Press, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Majaranta, P. and Räihä, K.-J. Text Entry by Gaze: Utilizing Eye-Tracking. In I. S. MacKenzie&amp;K. Tanaka-Ishii (Eds.) Text entry systems: Mobility, accessibility, universality. Morgan Kaufmann, 2007, 175--187.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. Metrics for text entry research: An evaluation of MSD and KSPC, and a new unified error metric. Proc. CHI 2003, ACM Press, 113--120.  ",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "pakov, O. and Miniotas, D. On-line adjustment of dwell time for target selection by gaze. Proc. NordiCHI 2004, ACM Press, 203--206.  ",
      "doi": "10.1145/1028014.1028045"
    },
    {
      "text": "Tuisku, O., Majaranta, P., Isokoski, P., and Räihä, K-J. Now Dasher! Dash Away! Longitudinal study of fast text entry by eye gaze. Proc. ETRA 2008, ACM Press, 19--26.  ",
      "doi": "10.1145/1344471.1344476"
    },
    {
      "text": "Ward, D. J. and MacKay, D. J. C. Fast hands-free writing by gaze direction. Nature 418(6900) (2002), 838.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Rubinstein, J., Sawyer, M. W., and Duchowski, A. T. Longitudinal evaluation of discrete consecutive gaze gestures for text entry. Proc. ETRA 2008, ACM Press, 11--18.  ",
      "doi": "10.1145/1344471.1344475"
    }
  ]
}