{
  "doi": "10.1145/1518701.1518908",
  "title": "Learning how: the search for craft knowledge on the internet",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1371-1380",
  "year": 2009,
  "badges": [],
  "abstract": "Communicating the subtleties of a craft technique, like putting a zipper into a garment or throwing a clay pot, can be challenging even when working side by side. Yet How-To content - including text, images, animations, and videos - is available online for a wide variety of crafts. We interviewed people engaged in various crafts to investigate how online resources contributed to their craft practice. We found that participants sought creative inspiration as well as technical clarification online. In this domain, keyword search can be difficult, so supplemental strategies are used. Participants sought information iteratively, because they often needed to enact their knowledge in order to evaluate it. Our description of people learning how allows us to elaborate existing understandings of information-seeking behavior by considering how search originates and is evaluated in knowledge domains involving physical objects and physical processes.",
  "tags": [
    "tutorial",
    "social search",
    "search usability",
    "information seeking",
    "expertise locating",
    "informal learning",
    "how-to",
    "diy",
    "hobbies",
    "craft"
  ],
  "authors": [
    {
      "name": "Cristen Torrey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310500984",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth F. Churchill",
      "institution": "Yahoo! Research, Santa Clara, CA, USA",
      "img": "/do/10.1145/contrib-81100143170/rel-imgonly/elizabethchurchill.jpeg",
      "acmid": "81100143170",
      "orcid": "missing"
    },
    {
      "name": "David W. McDonald",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81406596787/rel-imgonly/mcdonald-square-kenya-2019.jpg",
      "acmid": "81406596787",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamic, L. A., Zhang, J., Bakshy, E. and Ackerman, M. S. Knowledge sharing and Yahoo Answers: Everyone knows something. In Proceedings of the International Conference on World Wide Web (WWW) (2008), 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Bates, M. Where should the person stop and the information search interface start? Information Processing and Management, 26, 5 (1990), 575--591.  ",
      "doi": "10.1016/0306-4573%2890%2990103-9"
    },
    {
      "text": "Bates, M. An integrated model of information seeking and searching. Keynote presentation at the 4th International Conference of Information Needs, Seeking, and Use in Different Contexts, 2002.",
      "doi": ""
    },
    {
      "text": "Belkin, N. J. Interaction with texts: Information retrieval as information-seeking behavior. In Proceedings of the First Conference of the Gesselschaft fxr Informatik Fachgruppe Information Retrieval (1993).",
      "doi": ""
    },
    {
      "text": "Broder, A. A taxonomy of web search. SIGIR Forum, 36, 2 (2002), 3--10.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Bucciarelli, L. L. Designing Engineers. MIT Press, Boston, 1994. ",
      "doi": "10.5555/202737"
    },
    {
      "text": "Churchill, E. F. and Erickson, T. Talking about Things in Mediated Conversations: An Introduction. Human Computer Interaction, 18, 1--2 (2003).  ",
      "doi": "10.1207/S15327051HCI1812_1"
    },
    {
      "text": "Cobbledick, S. The information seeking behaviors of artists: exploratory interviews. The Library Quarterly, 66, 4 (1996), 343--372.",
      "doi": ""
    },
    {
      "text": "Cowan, S. Informing Visual Poetry: Information Needs and Sources of Artists. Art Documentation, 23, 2 (2004), 14--20.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Twidale, M. B., O'Brien, J. and Nichols, D. M. Talking in the library: implications for the design of digital libraries. In Proceedings of the ACM International Conference on Digital Libraries (1997). ACM Press.  ",
      "doi": "10.1145/263690.263824"
    },
    {
      "text": "Dormer, P. The language and practical philosophy of craft. In The Culture of Craft, P. Dormer (ed.). Manchester University Press, Manchester, 1997.",
      "doi": ""
    },
    {
      "text": "Ellis, D. The Dilemma of Measurement in Information Retrieval Research. Journal of the American Society for Information Science, 47, 1 (1996), 23--36.  ",
      "doi": "10.5555/231880.231886"
    },
    {
      "text": "Ford, N. Modeling Cognitive Processes in Information Seeking: From Popper to Pask. Journal of the American Society for Information Science and Technology, 55, 9 (2004), 769--782.  ",
      "doi": "10.1002/asi.20021"
    },
    {
      "text": "Ford, N., Miller, D. and Moss, N. Web search strategies and retrieval effectiveness: an empirical study. Journal of Documentation, 58, 1 (2001), 30--48.",
      "doi": ""
    },
    {
      "text": "Furnas, G. W., Landauer, T. K., Gomez, M. and Dumais, S. T. The Vocabulary Problem in Human-System Communication. Communications of the ACM, 30, 11 (1987), 964--971.  ",
      "doi": "10.1145/32206.32212"
    },
    {
      "text": "Gamble, J. Modelling the Invisible: the pedagogy of craft apprenticeship. Studies in Continuing Education, 23, 2 (2001), 185--200.",
      "doi": ""
    },
    {
      "text": "Greenhalgh, P. The Genre. In The persistence of craft, P. Greenhalgh (ed.). Rutgers University Press, 2002.",
      "doi": ""
    },
    {
      "text": "Hargittai, E. Informed Web Surfing: The Social Context of User Sophistication. In Personal and Global Contexts of Life Online, P. Howard and S. Jones (ed.). Sage Publications, 2004.",
      "doi": ""
    },
    {
      "text": "Hemmig, W. S. The information-seeking behavior of visual artists: a literature review. Journal of Documentation, 64, 3 (2008), 343--362.",
      "doi": ""
    },
    {
      "text": "Levine, F. and Heimerl, C. Handmade Nation: The Rise of DIY, Art, Craft, and Design. Princeton Architectural Press, 2008.",
      "doi": ""
    },
    {
      "text": "McCullough, M. Abstracting craft: the practised digital hand. MIT Press, Cambridge, 1996. ",
      "doi": "10.5555/524384"
    },
    {
      "text": "Metcalf, B. and Kennebrew, C. Connect/(Dis)connect. American Craft Council, Summer in the Salon Series, July 24, 2008. http://www.americancraftmag.org/zoom-entry.php?id=5156",
      "doi": ""
    },
    {
      "text": "Needleman, C. The work of craft: an inquiry in to the nature of crafts and craftsmanship. Kodansha International, New York, 1993.",
      "doi": ""
    },
    {
      "text": "O'Connor, E. Embodied knowledge in glassblowing: the experience of meaning and the struggle towards proficiency. Sociological Review, 55, 1 (2007), 126--141.",
      "doi": ""
    },
    {
      "text": "Pickens, J., Golovchinsky, G. and Ringel Morris, M. Collaborative information retrieval. In Proceedings of the ACM/IEEE-CS Joint Conference on Digital Libraries (2008). ACM Press.  ",
      "doi": "10.1145/1378889.1378985"
    },
    {
      "text": "Pirolli, P. and Card, S. K. Information Foraging. Psychological Review, 106(1999), 634--675.",
      "doi": ""
    },
    {
      "text": "Polanyi, M. The Tacit Dimension. Anchor Books, New York, 1962.",
      "doi": ""
    },
    {
      "text": "Pye, D. The nature and art of workmanship. Herbert Press, London, 1995.",
      "doi": ""
    },
    {
      "text": "Savolainen, R. Everyday Life Information Seeking: Approaching Information Seeking in the Context of \"Way of Life\". Library and Information Science Research, 17(1995), 259--294.",
      "doi": ""
    },
    {
      "text": "Talja, S., Tuominen, K. and Savolainen, R. \"Isms\" in information science: constructivism, collectivism and constructionism. Journal of Documentation, 61, 1 (2005), 79--101.",
      "doi": ""
    },
    {
      "text": "Torrey, C., McDonald, D., Schilit, W. and Bly, S. How-To pages: Informal systems of expertise sharing. In Proceedings of the European Conference on Computer Supported Cooperative Work, ECSCW (2007).",
      "doi": ""
    },
    {
      "text": "Wagner, A. Behind the scenes things are heating up! American Craft Magazine, March 14, 2008. americancraftmag.org/zoom-entry.php?id=1735",
      "doi": ""
    },
    {
      "text": "Wilson, T. D., Ford, N., Ellis, D., Foster, A. and Spink, A. Information Seeking and Mediated Searching. Part 2. Uncertainty and Its Correlates. Journal of the American Society for Information Science and Technology, 53, 9 (2002), 704--715.  ",
      "doi": "10.1002/asi.10082"
    }
  ]
}