{
  "doi": "10.1145/1518701.1518718",
  "title": "Using improvisation to enhance the effectiveness of brainstorming",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "97-104",
  "year": 2009,
  "badges": [],
  "abstract": "Group brainstorming is a popular ideation method for design teams, yet brainstorming outcomes vary greatly. The method depends on individuals working collectively to generate ideas, and so group dynamics determine whether the method succeeds or fails. This paper explores how interaction designers used techniques from theatrical improvisation, or improv, to adhere to the rules of brainstorming thereby enhancing group interactions while collaborating. The usefulness of improvisation for brainstorming stems from the similarity of the goals of improvisation and brainstorming, the similarity of the recurrent problems that actors and designers encounter when collaborating, and the distinctness of the ways each have devised to resolve the problems that block the group's performance. This paper reflects on the individual- and group-level outcomes for design students and practitioners while brainstorming.",
  "tags": [
    "improvisation",
    "brainstorming",
    "collaboration",
    "creativity support tools",
    "design methods"
  ],
  "authors": [
    {
      "name": "Elizabeth Gerber",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725085",
      "orcid": "0000-0001-8914-071X"
    }
  ],
  "references": [
    {
      "text": "Baer, M. and Oldham, R. The Curvilinear Relationship between Experience, Creative Time Pressure and Creativity. Journal of Applied Psychology 91, 4 (2006), 963--970.",
      "doi": ""
    },
    {
      "text": "Buchenau, M. and Fulton Suri, J. Experience Prototyping. In Proc. DIS 2000, ACM Press (2000), 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Burns, C., Dishman, E., Verplank, W., Lassiter, B. Actors, Hairdos&amp;Videotape - Informance Design. In Proc. of CHI 1994, ACM Press (1994), 119--20.  ",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Dennis, A., and Valacich, J., Computer Brainstorms: More Heads are Better than One. Journal of Applied Psychology 78, 4 (1993), 531--537.",
      "doi": ""
    },
    {
      "text": "Diehl, M., and Stroebe, W. Productivity Loss in Brainstorming Groups: Towards a Solution of a Riddle, Journal of Personality and Social Psychology 53, 3 (1987), 497-- 509.",
      "doi": ""
    },
    {
      "text": "Gerber, E. Devotion to An Innovation Process: The Case of Human Centered Design, PhD Dissertation, Stanford University, 2007.",
      "doi": ""
    },
    {
      "text": "Gerber. E. Improvisation Principles and Techniques for Design. In Proc. CHI 2007, ACM Press (2007), 1069--1072.  ",
      "doi": "10.1145/1240624.1240786"
    },
    {
      "text": "Hargadon, A. How Breakthroughs Happen. Harvard Business School Press, Boston, MA, USA, 2003.",
      "doi": ""
    },
    {
      "text": "Hargadon. A. and Sutton, R. Knowledge Brokering. Administrative Science Quarterly 42, 4 (1997), 716--749.",
      "doi": ""
    },
    {
      "text": "Johnstone. K. Impro: Improvation and the Theatre. Methuen Publishing, London, 1989.",
      "doi": ""
    },
    {
      "text": "Kelley, T and Littman, J. The Art of Innovation. Random House, New York, USA, 2001.",
      "doi": ""
    },
    {
      "text": "Kramer, T., Fleming, G., Mannis, S. Improving Face-To-Face Brainstorming Through Modeling and Facilitation. Small Groups Research 32 (2001), 533--557.",
      "doi": ""
    },
    {
      "text": "Kuutti, K., Iacucci, G., and Iacucci, C. Acting to Know: Improving Creativity in the Design of Mobile Services by Using Performances. In Proc. C&C 2002, ACM Press (2002), 95--102.  ",
      "doi": "10.1145/581710.581726"
    },
    {
      "text": "Davidoff, S., Lee, M., Dey, A., Zimmerman, J. Rapidly Exploring Application Design Through Speed Dating. In Proc. Ubicomp 2007, ACM Press (2007), 1069--1072. ",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Osborn, A., Applied Imagination: Principles and Proceedures of Creative Problem Solving, Charles Scribner's Son, New York, USA, 1953.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A., Kurvinen, E.,&amp;Kankainen, T. Understanding contexts by being there: case studies in bodystorming. Personal Ubiquitous Computing. 7,2 (2003), 125--134.  ",
      "doi": "10.1007/s00779-003-0238-7"
    },
    {
      "text": "Pinsonneault, A., Barki, H., Gallupe, R. and Hoppen, N. Electronic Brainstorming: The Illusion of Productivity. Information Systems Research 10, 2 (1999), 110--133.  ",
      "doi": "10.1287/isre.10.2.110"
    },
    {
      "text": "Ryan, P. Improv Wisdom. Bell Tower, New York, USA, 2005.",
      "doi": ""
    },
    {
      "text": "Simsarian, K., Take it to the Next Stage: The Roles of Role Playing the Design Process, In Proc. of CHI 2003, ACM Press (2003), 1012--1013.  ",
      "doi": "10.1145/765891.766123"
    },
    {
      "text": "Sutton, R., and Hargadon. A. Brainstorming Groups in Context: Effectiveness in a Product Design Firm. Administrative Science Quarterly 41, 4 (1996), 685--718.",
      "doi": ""
    },
    {
      "text": "Thompson, L.,&amp;Choi, H., Creativity and Innovation in Organizational Teams. Lawrence Erlbaum Associates, Mahwah, NJ, 2006.",
      "doi": ""
    }
  ]
}