{
  "doi": "10.1145/1518701.1518886",
  "title": "WeSpace: the design development and deployment of a walk-up and share multi-surface visual collaboration system",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1237-1246",
  "year": 2009,
  "badges": [],
  "abstract": "We present WeSpace -- a collaborative work space that integrates a large data wall with a multi-user multi-touch table. WeSpace has been developed for a population of scientists who frequently meet in small groups for data exploration and visualization. It provides a low overhead walk-up and share environment for users with their own personal applications and laptops. We present our year-long effort from initial ethnographic studies, to iterations of design, development and user testing, to the current experiences of these scientists carrying out their collaborative research in the WeSpace. We shed light on the utility, the value of the multi-touch table, the manifestation, usage patterns and the changes in their workflow that WeSpace has brought about.",
  "authors": [
    {
      "name": "Daniel Wigdor",
      "institution": "Harvard University, Cambridge, USA",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Hao Jiang",
      "institution": "Mitsubishi Electric Research Labs, Tsinghua University, Cambridge, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606428",
      "orcid": "missing"
    },
    {
      "name": "Clifton Forlines",
      "institution": "Mitsubishi Electric Research Labs, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584798",
      "orcid": "missing"
    },
    {
      "name": "Michelle Borkin",
      "institution": "Harvard University, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585455",
      "orcid": "missing"
    },
    {
      "name": "Chia Shen",
      "institution": "Harvard University, Cambridge, USA",
      "img": "/do/10.1145/contrib-81100343583/rel-imgonly/chiaportraitoriginal.jpg",
      "acmid": "81100343583",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ball, R. and North, C. (2005). Effects of tiled high-resolution display on basic visualization and navigation tasks. In CHI 05 Extended Abstracts, 1196--1199.  ",
      "doi": "10.1145/1056808.1056875"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Hinckley, K., Gruen, R.(2004) Mouse ether: accelerating the acquisition of targets across multi-monitor displays. In Proc. CHI 04, 1379--1382.  ",
      "doi": "10.1145/985921.986069"
    },
    {
      "text": "Biehl, J.T., Bailey, B.P. (2004). ARIS: an interface for application relocation in an interactive space. In Proc. Graphic Interface 04, 107--116. ",
      "doi": "10.5555/1006058.1006072"
    },
    {
      "text": "Biehl, J.T., Bailey, B.P. (2006). Improving interfaces for managing applications in multiple-device environments. In Proc AVI 06, 35--42.  ",
      "doi": "10.1145/1133265.1133273"
    },
    {
      "text": "Biehl, J.T., Baker, W.T.,Bailey, B.P., Tan, D.S., Inkpen, K.M., Czerwinski, M., (2008). IMPROMPTU: A New Interaction Framework for Supporting Collaboration in Multiple Display Environments and Its Field Evaluation for Co-located Software Development. In Proc. CHI 08, 939--948.  ",
      "doi": "10.1145/1357054.1357200"
    },
    {
      "text": "Dietz, P. and Leigh, D. (2001). DiamondTouch: a multi-user touch technology. In Proc. UIST 01, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Everitt, K., Shen, C., Ryall K., Forlines C. (2006). MultiSpace: Enabling Electronic Document Micro-mobility in Table-Centric, Multi-Device Environments. In Proc. Tabletop 06, 27--34.  ",
      "doi": "10.1109/TABLETOP.2006.23"
    },
    {
      "text": "Fischer, M., Stone, M., Liston, K., Kunz, J., Singhal, V. (2002). Multi-stakeholder collaboration: The CIFE iRoom. In Proceedings CIB W78 Conference 2002: Distributing Knowledge in Building, 6--13.",
      "doi": ""
    },
    {
      "text": "Fits Files: http://fits.gsfc.nasa.gov/fits_intro.html",
      "doi": ""
    },
    {
      "text": "Forlines, C., Esenther, A., Shen, C., Wigdor, D., Ryall, K. (2006). Multi-user, multi-display interaction with a single-user, single-display geospatial application. In Proc. UIST 06, 273--276.  ",
      "doi": "10.1145/1166253.1166296"
    },
    {
      "text": "Gray, J., Szalay, A. The World-Wide Telescope, an Archetype for Online Science. MSR-TR-2002-75.",
      "doi": ""
    },
    {
      "text": "Huang, E.M., Mynatt, E.D., Trimble, J.P. (2006). Displays in the wild: Understanding the dynamics and evolution of a display ecology. In Proc. Pervasive 06.  ",
      "doi": "10.1007/11748625_20"
    },
    {
      "text": "Izadi, S., H. Brignull, T. Rodden, Y. Rogers and M. Underwood. Dynamo: A Public Interactive Surface Supporting the Cooperative Sharing and Exchange of Media. Proc. UIST, 2003, 159--168.  ",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Jiang, H., Wigdor, D., Forlines, C., Borkin, M., Koffmann, J., Shen, C. (2008). LivOlay: Interactive Ad-Hoc Registration and Overlapping of Applications for Collaborative Visual Exploration. Proc. CHI 08, 1357--1360.  ",
      "doi": "10.1145/1357054.1357266"
    },
    {
      "text": "Jiang, H., Wigdor, D., Forlines, C., Shen, C. (2008). System Design for the WeSpace: Linking Personal Devices to a Table-Centered Multi-User, Multi-Surface Environment. In Proc. Tabletop 2008, 105--112.",
      "doi": ""
    },
    {
      "text": "Johanson, B., Fox, A., Winograd, T. (2002). The Interactive Workspaces Project: Experiences with Ubiquitous Computing Rooms. IEEE Pervasive Computing, v.1, n.2 (April 2002), 67--74.  ",
      "doi": "10.1109/MPRV.2002.1012339"
    },
    {
      "text": "Johanson, B., Hutchins, G., Winograd, T., Stone, M. PointRight: experience with flexible input redirection in interactive workspaces. In Proc. UIST 02, 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Johanson, B., Ponnekanti, S., Sengupta, C., Fox, A. (2001). Multibrowsing: Moving Web Content across Multiple Displays. UbiComp 2001, 346--353. ",
      "doi": "10.5555/647987.741346"
    },
    {
      "text": "Nacenta, M. A., Sallam, S., Champoux, B., Subramanian, S., Gutwin, C. (2006). Perspective cursor: perspective-based interaction for multi-display environments. In Proc. CHI 06, 289--298.  ",
      "doi": "10.1145/1124772.1124817"
    },
    {
      "text": "Prante, T., Streitz, N., Tandler, P. (2004). Roomware: Computers Disappear and Interaction Evolves. Computer 37, 12 (Dec. 2004), 47--54.  ",
      "doi": "10.1109/MC.2004.255"
    },
    {
      "text": "Rekimoto, J., Saitoh, M. (1999). Augmented surfaces: a spatially continuous work space for hybrid computing environments. In Proc. CHI 99, 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Rogers, Y., Lindley, S. (2004) Collaborating around vertical and horizontal displays: which way is best? Interacting With Computers, 16, 1133--1152.",
      "doi": ""
    },
    {
      "text": "Shen, C., Everitt, K.M., Ryall, K. UbiTable: Impromptu Face-to-Face Collaboration on Horizontal Interactive Surfaces. UbiComp 2003, LNCS 2864, 281--288.",
      "doi": ""
    },
    {
      "text": "Stefik, M., Foster, G., Bobrow, D. G., Kahn, K., Lanning, S., Suchman, L. Beyond the chalkboard: computer support for collaboration and problem solving in meetings. Commun. ACM 30, 1 (Jan. 1987), 32--47.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Streitz, N. A., Geißler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P., Steinmetz, R. (1999). i-LAND: an interactive landscape for creativity and innovation. In Proc. CHI 99, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Tan, D.S., Gergle, D., Scupelli, P., Pausch, R. (2006). Physically large displays improve performance on spatial tasks. ACM Trans. Comput.-Hum. Interact. 13, 1 (Mar. 2006), 71--99.  ",
      "doi": "10.1145/1143518.1143521"
    },
    {
      "text": "Tan, D.S., Meyers, B., Czerwinski, M. (2004). WinCuts: manipulating arbitrary window regions for more effective use of screen space. In Proc. CHI 04, 1525--1528.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Tollinger, I., McCurdy, M., Vera, A.H., Tollinger, P. Collaborative Knowledge Management Supporting Mars Mission Scientists. In Proc of CSCW 04, 29--38.  ",
      "doi": "10.1145/1031607.1031614"
    },
    {
      "text": "Wallace, G., Li, K. (2007). Virtually Shared Displays and Input Devices. In Proceedings of the 2007 USENIX Annual Technical Conference, 375--379. ",
      "doi": "10.5555/1364385.1364416"
    },
    {
      "text": "Wigdor, D., Shen, C., Forlines, C., Balakrishnan, R. (2006). Table-centric interactive spaces for real-time collaboration. In Proc. AVI 06, 103--107.  ",
      "doi": "10.1145/1133265.1133286"
    }
  ]
}