{
  "doi": "10.1145/1518701.1519014",
  "title": "I just don't know why it's gone: maintaining informal information use in inpatient care",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2061-2070",
  "year": 2009,
  "badges": [],
  "abstract": "We conducted a field-based study examining informal nursing information. We examined the use of this information before and after the adoption of a CPOE (Computerized Provider Order Entry) system in an inpatient unit of a large teaching hospital. Before CPOE adoption, nurses used paper working documents to detail psycho-social information about patients; after the CPOE adoption, they did not use paper or digital notes as was planned. The paper describes this process and analyses how several interlocked reasons contributed to the loss of this information in written form. We found that a change in physical location, sufficient convenience, visibility of the information, and permanency of information account for some, but not all, of the outcome. As well, we found that computerization of the nursing data led to a shift in the politics of the information itself - the nurses no longer had a cohesive agreement about the kinds of data to enter into the system. The findings address the requirements of healthcare computerization to support both formal and informal work practices, respecting the nature of nursing work and the politics of information inherent in complex medical work.",
  "authors": [
    {
      "name": "Xiaomu Zhou",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416595640",
      "orcid": "missing"
    },
    {
      "name": "Mark S. Ackerman",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100017207/rel-imgonly/81100017207.jpg",
      "acmid": "81100017207",
      "orcid": "0000-0001-9727-1664"
    },
    {
      "name": "Kai Zheng",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100580587",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bardram, J. \"I love the system - I just don't use it!\" Proceedings of ACM GROUP (1997), 251--260.  ",
      "doi": "10.1145/266838.266922"
    },
    {
      "text": "Bjerknes, G. and Bratteteig, T. The memoirs of two survivors. Proc. CSCW (1988), 167--177.  ",
      "doi": "10.1145/62266.62280"
    },
    {
      "text": "Blythin, S., Hughes, J. A., Kristoffersen, S., Rodden, T., and Rouncefield, M. Recognising \"success\" and \"failure\". Proceedings of ACM GROUP (1997), 39--46.  ",
      "doi": "10.1145/266838.266852"
    },
    {
      "text": "Bowker, G. and Star, L. Sorting Things Out: Classification and Its Consequences. MIT Press, 1999. ",
      "doi": "10.5555/380681"
    },
    {
      "text": "Charmaz, K. Good Days, Bad Days: The Self in Chronic Illness and Time. Rutgers Press, 1993.",
      "doi": ""
    },
    {
      "text": "Edwards, D. Philosophy of nursing: An introduction. Basingstoke, Palgrave, 2001.",
      "doi": ""
    },
    {
      "text": "Hardey, M., Payne, S., and Coleman, P. 'Scraps': hidden nursing information and its influence on the delivery of care. Journal of Advanced Nursing, 32, 1 (2000), 208--214.",
      "doi": ""
    },
    {
      "text": "Hardstone, G., Hartswood, M., Procter, R., Slack, R., Voss, A., and Rees, G. Supporting informality. Proc. CSCW (2004), 142--151.  ",
      "doi": "10.1145/1031607.1031632"
    },
    {
      "text": "Heath, C. and Luff, P. Documents and professional practice: 'bad' organisational reasons for 'good' clinical records. Proc. CSCW (1996), 354--363.  ",
      "doi": "10.1145/240080.240342"
    },
    {
      "text": "Hyde, A., Hyde, A., Treacy, M., Scott, A., Butler, M., Drennan, J., and Irving, K. Modes of rationality in nursing documentation. Nursing Inquiry, 12, 2 (2005), 66--77.",
      "doi": ""
    },
    {
      "text": "Kaplan, B. Evaluating informatics applications - some alternative approaches. International Journal of Medical Informatics, 64 (2001), 39--56.",
      "doi": ""
    },
    {
      "text": "Koppel, R., Metlay, J. P., Cohen, A., Abaluck, B., Localio, A. R., and Kimmel, S. E. Role of Computerized Physician Order Entry Systems in Facilitating Medication Errors. JAMA, 293, 10 (2005), 1197--1203.",
      "doi": ""
    },
    {
      "text": "Miles, M. and Huberman, M. Qualitative Data Analysis. Sage Publications, Inc, 2nd edition, 1994.",
      "doi": ""
    },
    {
      "text": "Reddy, M., Pratt, W., Dourish, P., and Shabot, M.M. Sociotechnical Requirements Analysis for Clinical Systems. Methods of Information in Medicine, 42 (2003), 437--444.",
      "doi": ""
    },
    {
      "text": "Schmidt, K., Wagner, I. and Marianne, T. Permutations of cooperative work practices. Proceedings of ACM Group (2007), 1--10.  ",
      "doi": "10.1145/1316624.1316626"
    },
    {
      "text": "Star, S. L. and Strauss, A. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. Computer Supported Coop. Work, 8, 1-2 (1999), 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Strauss, A., Wiener, C. and Shizuko, F. Social Organization of Medical Work. Transaction Publishers, 1985.",
      "doi": ""
    },
    {
      "text": "Tang, C. and S. Carpendale. An observational study on information flow during nurses' shift change. Proc. CHI (2007), 219--228.  ",
      "doi": "10.1145/1240624.1240661"
    },
    {
      "text": "Tellioglu, H.,&amp;Wagner, I. Work Practices Surrounding PACS: The Politics of Space in Hospitals. Journal of CSCW, 10, 2 (2001), 163--188.  ",
      "doi": "10.1023/A%3A1011298824442"
    },
    {
      "text": "Wagner, I. Women's voice: The case of nursing information systems. AI&amp;Society, 7, 4 (1993), 295--310.",
      "doi": ""
    },
    {
      "text": "Xiao, Y. Artifacts and collaborative work in healthcare: methodological, theoretical, and technological implications of the tangible. Journal of Biomedical Informatics, 38, 1(2005), 26--33.  ",
      "doi": "10.1016/j.jbi.2004.11.004"
    }
  ]
}