{
  "doi": "10.1145/1518701.1519048",
  "title": "TypeRight: a keyboard with tactile error prevention",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2265-2268",
  "year": 2009,
  "badges": [],
  "abstract": "TypeRight is a new tactile input device for text entry. It combines the advantages of tactile feedback with error prevention methods of word processors. TypeRight extends the standard keyboard so that the resistance to press each key becomes dynamically adjustable through software. Before each keystroke, the resistance of keys that would lead to a typing error according to dictionary and grammar rules is increased momentarily to make them harder to press, thus avoiding typing errors rather than indicating them after the fact. Two user studies showed that TypeRight decreases error correction rates by an average of 46%.",
  "tags": [
    "error prevention",
    "adopting input device",
    "text entry",
    "tactile feedback",
    "haptic"
  ],
  "authors": [
    {
      "name": "Alexander Hoffmann",
      "institution": "RWTH Aachen University, 52056 Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658631235",
      "orcid": "missing"
    },
    {
      "name": "Daniel Spelmezan",
      "institution": "RWTH Aachen University, 52056 Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350575685",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, 52056 Aachen, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "S. Brewster and L. M. Brown. Tactons: structured tactile messages for non-visual information display. Proc. Australasian user interface, 15--23, Darlinghurst, Australia, 2004. Australian Computer Society, Inc. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "A. Dix, J. Finlay, G. Abowd, and R. Beale. Human-computer interaction. Prentice Hall, New York, 1993. ",
      "doi": "10.5555/249491"
    },
    {
      "text": "A. Hoffmann. Haptic keyboard prototype for data entry. Master's thesis, RWTH Aachen, University, 2008.",
      "doi": ""
    },
    {
      "text": "E. Hoggan, S. A. Brewster, and J. Johnston. Investigating the effectiveness of tactile feedback for mobile touchscreens. Proc. CHI'08, 1573--1582. ACM.  ",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "S.-Y. Kim, J. Park, and D.-S. Kwon. Palpation simulator for laparoscopic surgery with haptic feedback. Proc. Biomedical Engineering,478--482, 2004.",
      "doi": ""
    },
    {
      "text": "A. Nakamura, S. Tabata, T. Ueda, S. Kiyofuji, and Y. Kuno. Multimodal presentation method for a dance training system. Ext. Abstracts CHI 2005, 1685--1688.  ",
      "doi": "10.1145/1056808.1056997"
    },
    {
      "text": "R. Scheibe, M. Moehring, and B. Froehlich. Tactile feedback at the finger tips for improved direct interaction in immersive environments. 3dui, 2007, IEEE Computer Society.",
      "doi": ""
    }
  ]
}