{
  "doi": "10.1145/1518701.1519054",
  "title": "A user study on visualizing directed edges in graphs",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2299-2308",
  "year": 2009,
  "badges": [],
  "abstract": "Graphs are often visualized using node-link representations: vertices are depicted as dots, edges are depicted as (poly)lines connecting two vertices. A directed edge running from vertex A to B is generally visualized using an arrow representation: a (poly)line with a triangular arrowhead at vertex B. Although this representation is intuitive, it is not guaranteed that a user is able to determine edge direction as quickly and unambiguously as possible; alternative representations that exhibit less occlusion and visual clutter might be better suited. To investigate this, we developed five additional directed-edge representations using combinations of shape and color. We performed a user study in which subjects performed different tasks on a collection of graphs using these representations and combinations thereof to investigate which representation is best in terms of speed and accuracy. We present our initial hypotheses, the outcome of the user studies, and recommendations regarding directed-edge visualization.",
  "authors": [
    {
      "name": "Danny Holten",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495186",
      "orcid": "missing"
    },
    {
      "name": "Jarke J. van Wijk",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100381561",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. A. Becker, S. G. Eick, and A. R. Wilks. Visualizing Network Data. IEEE Transactions on Visualization and Computer Graphics (TVCG), 1:16--28, 1995.  ",
      "doi": "10.1109/2945.468391"
    },
    {
      "text": "J. Ellson, E. R. Gansner, E. Koutsofios, S. C. North, and G. Woodhull. Graphviz and Dynagraph - Static and Dynamic Graph Drawing Tools. In M. Jünger and P. Mutzel, editors, Graph Drawing Software, pages 127--148. Springer-Verlag, 2003.",
      "doi": ""
    },
    {
      "text": "P. Erdös and A. Rényi. On Random Graphs. Publicationes Mathematicae, 6:290--297, 1959.",
      "doi": ""
    },
    {
      "text": "D. Holten. Hierarchical Edge Bundles: Visualization of Adjacency Relations in Hierarchical Data. IEEE Transactions on Visualization and Computer Graphics (TVCG; Proc. of INFOVIS'06), 12(5):741--748, 2006.  ",
      "doi": "10.1109/TVCG.2006.147"
    },
    {
      "text": "N. D. Jean-Daniel Fekete, David Wang, A. Aris, and C. Plaisant. Overlaying Graph Links on Treemaps. In Proceedings of the 2003 IEEE Symposium on Information Visualization (INFOVIS'03), Poster Compendium, pages 82--83, 2003.",
      "doi": ""
    },
    {
      "text": "B. Kerr. Thread Arcs: An Email Thread Visualization. In Proceedings of the 2003 IEEE Symposium on Information Visualization (INFOVIS'03), pages 211--218, 2003. ",
      "doi": "10.5555/1947368.1947407"
    },
    {
      "text": "R. Kosara, C. G. Healey, V. Interrante, D. H. Laidlaw, and C. Ware. Thoughts on User Studies: Why, How, and When. IEEE Computer Graphics&amp;Applications (CG&A), 23(4):20--25, 2003.  ",
      "doi": "10.1109/MCG.2003.1210860"
    },
    {
      "text": "G. Melançon. Just How Dense are Dense Graphs in the Real World? A Methodological Note. In Proceedings of the 2006 AVI Workshop on BEyond Time and Errors: Novel EvaLuation Methods for Information Visualization (BELIV'06), pages 75--81, 2006.  ",
      "doi": "10.1145/1168149.1168167"
    },
    {
      "text": "C. North. Toward Measuring Visualization Insight. IEEE Computer Graphics&amp;Applications (CG&A), 26(3):6--9, 2006.  ",
      "doi": "10.1109/MCG.2006.70"
    },
    {
      "text": "C. Ware and R. Bobrow. Supporting Visual Queries on Medium-Sized Node-Link Diagrams. Information Visualization, 4(1):49--58, 2005.  ",
      "doi": "10.1057/palgrave.ivs.9500090"
    },
    {
      "text": "C. Ware and P. Mitchell. Visualizing Graphs in Three Dimensions. ACM Transactions on Applied Perception (TAP), 5(1):1--15, 2008.  ",
      "doi": "10.1145/1279640.1279642"
    },
    {
      "text": "M. Wattenberg. Arc Diagrams: Visualizing Structure in Strings. In Proceedings of the 2002 IEEE Symposium on Information Visualization (INFOVIS'02), pages 110--116, 2002. ",
      "doi": "10.5555/857191.857733"
    },
    {
      "text": "N. Wong, S. Carpendale, and S. Greenberg. EdgeLens: An Interactive Method for Managing Edge Congestion in Graphs. In Proceedings of the 2003 IEEE Symposium on Information Visualization (INFOVIS'03), pages 51--58, 2003. ",
      "doi": "10.5555/1947368.1947382"
    },
    {
      "text": "P. C. Wong, P. Mackey, K. Perrine, J. Eagan, H. Foote, and J. Thomas. Dynamic Visualization of Graphs with Extended Labels. In Proceedings of the 2005 IEEE Symposium on Information Visualization (INFOVIS'05), pages 73--80, 2005.  ",
      "doi": "10.1109/INFOVIS.2005.11"
    }
  ]
}