{
  "doi": "10.1145/1518701.1518997",
  "title": "Tilt techniques: investigating the dexterity of wrist-based input",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1943-1952",
  "year": 2009,
  "badges": [],
  "abstract": "Most studies on tilt based interaction can be classified as point-designs that demonstrate the utility of wrist-tilt as an input medium; tilt parameters are tailored to suit the specific interaction at hand. In this paper, we systematically analyze the design space of wrist-based interactions and focus on the level of control possible with the wrist. In a first study, we investigate the various factors that can influence tilt control, separately along the three axes of wrist movement: flexion/extension, pronation/supination, and ulnar/radial deviation. Results show that users can control comfortably at least 16 levels on the pronation/supination axis and that using a quadratic mapping function for discretization of tilt space significantly improves user performance across all tilt axes. We discuss the findings of our results in the context of several interaction techniques and identify several general design recommendations.",
  "tags": [
    "tilt-based interaction",
    "tilt input",
    "wrist input",
    "wrist dexterity"
  ],
  "authors": [
    {
      "name": "Mahfuz Rahman",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442597755",
      "orcid": "missing"
    },
    {
      "name": "Sean Gustafson",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/do/10.1145/contrib-81350569912/rel-imgonly/seanportrait.jpg",
      "acmid": "81350569912",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Bowman, D., Wingrave, C., Campbell, J., Ly, V. and Rhoton,C. (2002). Novel uses of pinch gloves for virtual environment interaction techniques. Virtual Reality, 6(3), 122--129.",
      "doi": ""
    },
    {
      "text": "Bartlett, J.F. (2000) Rock 'n' Scroll is here to stay. Computer Graphics and Applications, 20(3), 40--45.  ",
      "doi": "10.1109/38.844371"
    },
    {
      "text": "Crossan, A. and Murray-Smith, R. (2004) Variability in Wrist-Tilt Accelerometer Based Gesture Interfaces. Proc. MobileHCI '04, 144--155.",
      "doi": ""
    },
    {
      "text": "Crossan, A. Williamson, J., Brewster, S. and Murray-Smith, R. (2008) Wrist rotation for interaction in mobile contexts. Proc. MobileHCI '08, 435--438.  ",
      "doi": "10.1145/1409240.1409307"
    },
    {
      "text": "Eslambolchilar, P. and Murray-Smith, R. (2004) Tilt-based automatic zooming and scaling in mobile devices - a state-space implementation. Proc. MobileHCI '04, 120--131.",
      "doi": ""
    },
    {
      "text": "Grandjean, E. (1969) Fitting the task to the man: an ergonomic approach. Taylor and Francis, p. 372.",
      "doi": ""
    },
    {
      "text": "Harrison, B. L., Fishkin, K. P., Gujar, A., Mochon, C. and Want, R. (1998) Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. Proc. CHI '98, 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Hinckley, K., Pierce, J., Sinclair, M. and Horvitz, E. (2000) Sensing techniques for mobile interaction. Proc. UIST '00, 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Lee, H., Khandelwal, M. and Mazalek, A. (2007) Tilting table: a movable screen. Proc. TEI '07, 93--96.  ",
      "doi": "10.1145/1226969.1226988"
    },
    {
      "text": "MacKay, B., Dearman, D., Inkpen, K. and Watters, C. (2005) Walk 'n scroll: a comparison of software-based navigation techniques for different levels of mobility. Proc. MobileHCI '05, 183--190.  ",
      "doi": "10.1145/1085777.1085808"
    },
    {
      "text": "NASA (1995) NASA-STD-3000 Man-Systems Integration Standards. Rev B.",
      "doi": ""
    },
    {
      "text": "Oakley, I. and O'Modhrain, M. (2005). Tilt to scroll: Evaluating a motion based vibrotactile mobile interface, Proc. WHC '05, 40--49.  ",
      "doi": "10.1109/WHC.2005.138"
    },
    {
      "text": "Oakley, I. and Park, J. (2007) A motion-based marking menu system. CHI '07 Extended Abstracts, 2597--2602.  ",
      "doi": "10.1145/1240866.1241048"
    },
    {
      "text": "Partridge, K., Chatterjee, S., Sazawal, V., Borriello, G. and Want, R. (2002) TiltType: Accelerometer-supported text entry for very small devices. Proc. UIST '02, 201--204.  ",
      "doi": "10.1145/571985.572013"
    },
    {
      "text": "Poupyrev, I., Maruyama, S. and Rekimoto, J. (2002) Ambient touch: Designing tactile interfaces for handheld devices. Proc. UIST '02, 51--60.  ",
      "doi": "10.1145/571985.571993"
    },
    {
      "text": "Ramos, G., Boulos, M. and Balakrishnan, R., (2004) Pressure widgets. Proc. CHI '04, 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Rath, M. and Rohs, M. (2006) Explorations in sound for tilting-based interfaces. Proc. ICMI '06, 295--301.  ",
      "doi": "10.1145/1180995.1181052"
    },
    {
      "text": "Rekimoto, J. (1996) Tilting operations for small screen interfaces. Proc. UIST '96, 167--168.  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Shi, K., Irani, P., Gustafson, S. and Subramanian, S. (2008) PressureFish: a method to improve control of discrete pressure-based input. Proc. CHI '08, 1295--1298.  ",
      "doi": "10.1145/1357054.1357256"
    },
    {
      "text": "Tian, F., Ao, X., Wang, H., Setlur, V. and Dai, G. (2007) The tilt cursor: enhancing stimulus-response compatibility by providing 3D orientation cue of pen. Proc. CHI '07, 303--306.  ",
      "doi": "10.1145/1240624.1240675"
    },
    {
      "text": "Tian, F., Xu, L., Wang, H., Zhang, X., Liu, Y., Setlur, V. and Dai, G. (2008) Tilt menu: using the 3D orientation information of pen devices to extend the selection capability of pen-based user interfaces. Proc. CHI '08, 1371--1380.  ",
      "doi": "10.1145/1357054.1357269"
    },
    {
      "text": "Weberg, L., Brange, T. and Hansson, Å. W. (2001) A piece of butter on the PDA display. CHI '01 Extended Abstracts, 435--436.  ",
      "doi": "10.1145/634067.634320"
    },
    {
      "text": "Wigdor, D. and Balakrishnan, R. (2003) TiltText: Using tilt for text input to mobile phones. Proc. UIST '03, 81--90  ",
      "doi": "10.1145/964696.964705"
    }
  ]
}