{
  "doi": "10.1145/1518701.1518843",
  "title": "MicroRolls: expanding touch-screen input vocabulary by distinguishing rolls vs. slides of the thumb",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "927-936",
  "year": 2009,
  "badges": [],
  "abstract": "The input vocabulary for touch-screen interaction on handhelds is dramatically limited, especially when the thumb must be used. To enrich that vocabulary we propose to discriminate, among thumb gestures, those we call MicroRolls, characterized by zero tangential velocity of the skin relative to the screen surface. Combining four categories of thumb gestures, Drags, Swipes, Rubbings and MicroRolls, with other classification dimensions, we show that at least 16 elemental gestures can be automatically recognized. We also report the results of two experiments showing that the roll vs. slide distinction facilitates thumb input in a realistic copy and paste task, relative to existing interaction techniques.",
  "authors": [
    {
      "name": "Anne Roudaut",
      "institution": "TELECOM ParisTech - CNRS LTCI, Alcatel-Lucent Bell Labs France, Paris, France",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    },
    {
      "name": "Eric Lecolinet",
      "institution": "TELECOM ParisTech - CNRS LTCI, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390376",
      "orcid": "0000-0001-8114-1160"
    },
    {
      "name": "Yves Guiard",
      "institution": "TELECOM ParisTech - CNRS LTCI, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143867",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albinsson, P-A. and Zhai, S. (2003). High precision touch screen interaction. Proc. CHI'03, ACM Press, 105--112.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Bailly, G., Lecolinet, E., and Nigay, L. (2008). Flower menus: a new type of marking menu with large menu breadth, within groups and efficient expert mode memorization. Proc. AVI '08. ACM Press, 15--22.  ",
      "doi": "10.1145/1385569.1385575"
    },
    {
      "text": "Benko, H., Wilson, A., and Baudisch, P. (2006). Precise selection techniques for multi-touch screens. Proc. CHI'06, ACM Press, 1263--1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Buxton, W. (1990). A three-state model of graphical input. Proc. INTERACT '90. Amsterdam: Elsevier Science Publishers B.V. (North-Holland), 449--456. ",
      "doi": "10.5555/647402.725582"
    },
    {
      "text": "Cross, R. (1999). The bounce of a ball. Am. J. Physics, 67, 222--227.",
      "doi": ""
    },
    {
      "text": "Geißler, J. (1998). Shuffle, throw or take it! working efficiently with an interactive wall. Proc. CHI'98, Extended Abstracts, 265--266.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Grossman, T., Dragicevic, P., Balakrishnan, R. (2007). Strategies for accelerating on-line learning of hotkeys. Proc. CHI'07, ACM Press, 1591--1600.  ",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "Guimbretiére, F., Winograd, T. (2000). FlowMenu: combining command, text, and data entry. Proc. UIST'00, 213--216.  ",
      "doi": "10.1145/354401.354778"
    },
    {
      "text": "Karlson, A. K., Bederson, B. B. (2008). One-handed touchscreen input for legacy applications. Proc. CHI'08, ACM Press, 1399--1408.  ",
      "doi": "10.1145/1357054.1357274"
    },
    {
      "text": "Karlson, A. K., Bederson, B. B., SanGiovanni, J. (2005). AppLens and launchTile: two designs for one-handed thumb use on small devices. Proc. CHI'05, ACM Press, 201--210.  ",
      "doi": "10.1145/1054972.1055001"
    },
    {
      "text": "Karlson, A., Bederson, B., Contreras-Vidal, J. (2007). Understandingon User Interface Design and Evaluation for Mobile Technology, Idea Group.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. (1991). Issues in combining marking and direct manipulation techniques. Proc. UIST'91, ACM Press, 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "MacKenzie, I. S., Oniszczak, A. (1998). A comparison of three selection techniques for touchpads. Proc. CHI'98, ACM Press, 336--343.  ",
      "doi": "10.1145/274644.274691"
    },
    {
      "text": "Olwal, A., Feiner, S., Heyman, S. (2008). Rubbing and Tapping for precise and rapid selection on touch-screen displays. Proc. CHI'08, ACM Press, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Oniszczak, A., MacKenzie, I. S. (2004). A comparison of two input methods for keypads on mobile devices. Proc. NordiCHI '04, ACM Press, 101--104.  ",
      "doi": "10.1145/1028014.1028030"
    },
    {
      "text": "Parhi, P., Karlson, A., Bederson, B. (2006). Target Size Study for One-Handed Thumb Use on Small Touchscreen Devices. Proc. MobileHCI'06. 203--210.  ",
      "doi": "10.1145/1152215.1152260"
    },
    {
      "text": "Pascoe, J., Ryan, N., Morse, D. (2000). Using while moving: HCI issues in fieldwork environments. ACM Trans. Comput.- Hum. Interact. 7(3):417--437.  ",
      "doi": "10.1145/355324.355329"
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G., Barillot, E. (2000). Control menus: excecution and control in a single interactor. Proc. CHI'00, ACM Press, 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Potter, R. L., Weldon, L. J., Shneiderman, B. (1988). Improving the accuracy of touchscreens: an experimental evaluation of three strategies. Proc.CHI88, ACM Press, 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Resnick, R.&amp;Halliday, D. (1966). Physics, Part I. New York: John Wiley&amp;Sons, Inc.",
      "doi": ""
    },
    {
      "text": "Roudaut, A., Huot, S., Lecolinet, E. (2008). TapTap and MagStick: improving one-handed target acquisition on small touchscreens. Proc. AVI'08, ACM Press, 146--153.  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Rubine, D. (1991). Specifying gestures by example. SIGGRAPH Comput. Graph. 25, 4 (Jul. 1991), 329--337.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "Smith, G., schraefel, m. c., Baudisch, P. (2005). Curve dial: eyes-free parameter entry for GUIs. Proc. CHI'05 Extended Abstracts, ACM Press, 1146--1147.  ",
      "doi": "10.1145/1056808.1056855"
    },
    {
      "text": "Vogel, D., Baudisch, P. (2007). Shift: a technique for operating pen-based interfaces using touch. Proc. CHI'97, ACM Press, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Yatani, K., Partridge, K., Bern, M., Newman, M. W. (2008). Escape: a target selection technique using visually-cued gestures. Proc. CHI'08, ACM Press, 285--294.  ",
      "doi": "10.1145/1357054.1357104"
    }
  ]
}