{
  "doi": "10.1145/1518701.1519055",
  "title": "Path selection: a novel interaction technique for mapping applications",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2309-2318",
  "year": 2009,
  "badges": [],
  "abstract": "Many online mapping applications let users define routes, perhaps for sharing a favorite bicycle commuting route or rating several contiguous city blocks. At the UI level, defining a route amounts to selecting a fairly large number of objects - the individual segments of roads and trails that make up the route. We present a novel interaction technique for this task called path selection. We implemented the technique and evaluated it experimentally, finding that adding path selection to a state-of-the-art technique for selecting individual objects reduced route definition time by about a factor of 2, reduced errors, and improved user satisfaction. Detailed analysis of the results showed path selection is most advantageous (a) for routes with long straight segments and (b) when objects that are optimal click targets also are visually attractive.",
  "tags": [
    "path selection",
    "routing",
    "bubble cursors",
    "selection techniques",
    "bubble targets"
  ],
  "authors": [
    {
      "name": "Michael Ludwig",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81416600488/rel-imgonly/portrait.jpg",
      "acmid": "81416600488",
      "orcid": "missing"
    },
    {
      "name": "Reid Priedhorsky",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489923",
      "orcid": "missing"
    },
    {
      "name": "Loren Terveen",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81100276946/rel-imgonly/my_mcknight_photo_2017.jpg",
      "acmid": "81100276946",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. Beyond Fitts' Law: Models for trajectory-based HCI tasks. In Proc. CHI 1997.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Aurenhammer, F. and Klein, R. Voronoi Diagrams. Chapter 5, in Handbook of computational geometry, J. Sack and J. Urrutia, Editors. North-Holland: Amsterdam, Netherlands. pp. 201--290, 2000.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B., and Zierlinger, A. Drag-and-pop and drag-and-pick: Techniques for accessing remote screen content on touch- and pen-oriented systems. In Proc. Interact 2003.",
      "doi": ""
    },
    {
      "text": "Blanch, R., Guiard, Y., and Beaudouin-Lafon, M. (2004). Semantic pointing: Improving target acquisition with control-display ratio adaptation. In Proc. CHI 2004.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Chin, J. P., Diehl, V. A., and Norman, K. L. Development of an instrument measuring user satisfaction of the human-computer interface. In Proc. CHI 1988.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Cockburn, A. and Firth, A. Improving the acquisition of small targets. In Proc. British HCI Conference 2003.",
      "doi": ""
    },
    {
      "text": "Counts, S. and Smith, M. Where were we: Communities for sharing space-time trails. In Proc. GIS 2007.  ",
      "doi": "10.1145/1341012.1341026"
    },
    {
      "text": "http://cyclopath.org",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47. p 381--391",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. In Proc. CHI 2005.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. Object pointing: A complement to bitmap pointing in GUIs. In Proc. Graphics Interface 2004. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Kabbash, P. and Buxton, W. The Prince--technique: Fitts' Law and selection using area cursors. In Proc. CHI 1995.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "MacKenzie, S. Fitts' Law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7. p 91 -- 139, 1992  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, S. and Buxton, W. Extending Fitts' Law to two-dimensional tasks. In Proc. CHI 1992.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "McGuffin, M. (2002). Fitts' Law and expanding targets: An experimental study and applications to user interface design, M.Sc. Thesis, Department of Computer Science, University of Toronto  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "McGuffin, M. and Balakrishnan, R. Acquisition of expanding targets. In Proc. CHI 2002.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "Priedhorsky, R., Jordan, B., and Terveen, L. How a personalized geowiki can help bicyclists share information more effectively. In Proc. WikiSym 2007.  ",
      "doi": "10.1145/1296951.1296962"
    },
    {
      "text": "Priedhorsky, R. and Terveen, L. The computational geowiki: What, why, and how. In Proc. CSCW 2008.  ",
      "doi": "10.1145/1460563.1460606"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., and Hudson, S. Making computers easier for older adults to use: Area cursors and sticky icons. In Proc. CHI 1997.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Zhai, S., Conversy, S., Beaudouin-Lafon, M., and Guiard, Y. Human on-line response to target expansion. In Proc. CHI 2003.  ",
      "doi": "10.1145/642611.642644"
    }
  ]
}