{
  "doi": "10.1145/1518701.1518817",
  "title": "Extraordinary computing: religion as a lens for reconsidering the home",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "749-758",
  "year": 2009,
  "badges": [],
  "abstract": "We present results from a study examining how American Protestant Christians' faith affects their domestic life. There are two contributions of this work for the HCI community. First, we provide empirical evidence demonstrating how topics of interest to HCI researchers (e.g., material artifacts, routines, and ICT use) are used for religious purposes. Our findings show how Christians distinguish these aspects of domestic life from their secular counterparts. Second, we use our findings to reflect on current directions of future domestic ICT applications. Specifically, we critically evaluate the \"problem solving approaches dominating the design of future technologies, and present extraordinary computing or systems that promote and honor the special value accorded to some aspects of domestic life.",
  "authors": [
    {
      "name": "Susan P. Wyche",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81314492849/rel-imgonly/wyche__susan-2021-1-2.jpg.headshot.small.jpg",
      "acmid": "81314492849",
      "orcid": "missing"
    },
    {
      "name": "Rebecca E. Grinter",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    }
  ],
  "references": [
    {
      "text": "\"Design and Religion: New Forms of Faith\" (special issue), I.D. Magazine, March/April, 2006.",
      "doi": ""
    },
    {
      "text": "Bell, G., \"No More SMS from Jesus: Ubicomp, Religion and Techno-spiritual Practices,\" Proc. Ubicomp 2006, Springer (2006), 141--158.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Berger, P.L., The Sacred Canopy. Anchor Books, Garden City, NY, 1967.",
      "doi": ""
    },
    {
      "text": "Blevis, E., \"Sustainable interaction design: invention&amp;disposal, renewal&amp;reuse,\" Proc. CHI 2007, ACM (2007), 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Blythe, M., Monk, A. and Park, J., \"Technology biographies: field study techniques for home use product development,\" Extended Abstracts, CHI 2002, ACM (2002), 658--659.  ",
      "doi": "10.1145/506443.506532"
    },
    {
      "text": "Bruce, S., Pray TV: Televangelism in America. Routledge, London, England, 1990.",
      "doi": ""
    },
    {
      "text": "Campbell, H., Exploring Religious Community Online: We are One in the Network. Peter Lang Publishing, New York, NY, 2005. ",
      "doi": "10.5555/1076645"
    },
    {
      "text": "Campbell, H., \"'What Hath Got Wrought?' Considering How Religious Communities Culture (or Kosher) the Cell Phone,\" Continuum: Journal of Media&amp;Cultural Studies 21, 2 (2007), 191--203.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Rodden, T., Hemmings, T. and Benford, S., \"Finding a Place for Ubicomp in the Home,\" Proc. of Ubicomp 2003, Springer (2003), 208--226.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. and Rochberg-Halton, E., The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press, 1981.",
      "doi": ""
    },
    {
      "text": "Cummings, J.N. and Kraut, R., \"Domesticating Computers and the Internet,\" The Information Society 18, 3 (2002), 221--232.",
      "doi": ""
    },
    {
      "text": "Dang, A., \"Gospel Spectrum,\" Proc. DUX 2005, AIGA (2005), poster. ",
      "doi": "10.5555/1138235.1138254"
    },
    {
      "text": "Dawson, L.L. and Cowan, D. (eds.), Religion Online: Finding Faith on the Internet. Routledge Press, New York, NY, 2004. ",
      "doi": "10.5555/983780"
    },
    {
      "text": "Fischer, C.S., American Calling: A Social History of the Telephone to 1940. University of California Press, Berkeley, CA, 1992. ",
      "doi": "10.5555/530627"
    },
    {
      "text": "Glasser, B.G. and Strauss, A.L., The discovery of grounded theory: Strategy for qualitative research. Aldine Publishing Company, Hawthorne, NY, 1967.",
      "doi": ""
    },
    {
      "text": "Grimes, A. and Harper, R., \"Celebratory Technology: New Directions for Food Research in HCI,\" Proc. CHI 2008, ACM (2008), 467--476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Helland, C., \"Diaspora on the Electronic Frontier: Developing Virtual Connections with Sacred Homelands,\" Journal of Computer-Mediated Communication 12, 3 (2007).",
      "doi": ""
    },
    {
      "text": "Hlubinka, M., Beaudin, J., Tapia, E.M. and An, J.S., \"AltarNation: Interface Design for Meditative Communities,\" Extended Abstracts, CHI 2005, ACM (2002), 612--613.  ",
      "doi": "10.1145/506443.506509"
    },
    {
      "text": "Hoover, S.M., Clark, L.S. and Rainie, L. Faith Online: 64% of wired Americans have used the Internet for spiritual or religious purposes, Pew Internet&amp;American Life, Washington, DC, 2004.",
      "doi": ""
    },
    {
      "text": "Kraut, R., Mukhopadhyay, T., Szczypula, J., Kiesler, S. and Scherlis, W., \"Information and Communication: Alternative Uses of the Internet in Households,\" Information Systems Research 10, 4 (1999), 287--303.  ",
      "doi": "10.1287/isre.10.4.287"
    },
    {
      "text": "Kraut, R., Scherlis, W., Mukkopadhyay, T., Manning, J. and Kiesler, S., \"The HomeNet Field Trial of Residential Internet Services,\" CACM 39, 12 (1996), 55--65.  ",
      "doi": "10.1145/240483.240493"
    },
    {
      "text": "Lee, T.S., \"Technology and the Production of Islamic Space: The Call to Prayer in Singapore,\" Ethnomusicology 43, 1 (1999), 86--100.",
      "doi": ""
    },
    {
      "text": "Miller, D. and Slater, D., The Internet: An Ethnographic Approach. Berg, Oxford, England, 2000.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Aaløkke, S., \"Of Pill Boxes and Piano Benches: \"Home-Made\" Methods for Managing Medication,\" Proc. CSCW 2006, ACM (2006), 79--88.  ",
      "doi": "10.1145/1180875.1180888"
    },
    {
      "text": "Palen, L. and Dourish, P., \"Unpacking \"Privacy\" for a Networked World,\" Proc. CHI 2003, ACM (2003), 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Palen, L. and Hughes, A., \"When Home Base is not a Place: Parents' Use of Mobile Telephones,\" Personal and Ubiquitous Computing 11, 5 (2007), 339--348.  ",
      "doi": "10.1007/s00779-006-0078-3"
    },
    {
      "text": "Petrelli, D., Whittaker, S. and Brockmeier, J., \"AutoTyopography: what can physical mementos tell us about digital memories?,\" Proc. CHI 2008, ACM Press (2008), 53--62.  ",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "Rattenbury, T., Nafus, D. and Anderson, K., \"Plastic: A Metaphor for Integrated Technologies,\" Proc. Ubicomp 2008, Springer (2008).  ",
      "doi": "10.1145/1409635.1409667"
    },
    {
      "text": "Rowan, J. and Mynatt, E.D., \"Digital Family Portrait Field Trial: Support for Aging in Place,\" Proc. CHI 2005, ACM (2005), 521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Taylor, A.S., Harper, R., Swan, L., Izadi, S., Sellen, A. and Perry, M., \"Homes that make us smart,\" Personal and Ubiquitous Computing 11, 5 (2007), 383--393.  ",
      "doi": "10.1007/s00779-006-0076-5"
    },
    {
      "text": "The Association of Religion Data Archives, \"National Profiles: The United States,\" http://www.thearda.com/internationalData/countries/Country_234_1.asp (2007).",
      "doi": ""
    },
    {
      "text": "The Encyclopædia Britannica, Worldwide Adherents of All Religions. Encyclopedia Britannica, 2005.",
      "doi": ""
    },
    {
      "text": "Thumma, S. and Travis, D., Beyond Megachurch Myths: What We Can Learn from America's Largest Churches. Jossey-Boss, San Francisco, CA, 2007.",
      "doi": ""
    },
    {
      "text": "Tolmie, P., Pycock, J., Diggins, T., MacLean, A. and Karsenty, A., \"Unremarkable Computing,\" Proc. CHI 2002, ACM (2002), 399--406.  ",
      "doi": "10.1145/503376.503448"
    },
    {
      "text": "Winner, L., \"Do Artifacts Have Politics?,\" Daedalus 109, 1 (1980), 121--136.",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Anderson, K., Mainwaring, S.D. and Aipperspach, R., \"Portable, But Not Mobile: A Study of Wireless Laptops in the Home,\" Proc. Pervasive 2007, Springer (2007), 216--233. ",
      "doi": "10.5555/1758156.1758173"
    },
    {
      "text": "Woodruff, A., Augustin, S. and Foucault, B.E., \"Sabbath Day Home Automation: `It's like mixing technology and religion',\" Proc. CHI 2007, ACM (2007), 527--536.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Wyche, S.P., Aoki, P.M. and Grinter, R.E., \"Re-Placing Faith: Reconsidering the Secular-Religious Use Divide in the United States and Kenya,\" Proc. CHI 2008, ACM (2008), 11--20.  ",
      "doi": "10.1145/1357054.1357057"
    },
    {
      "text": "Wyche, S.P., Hayes, G.R., Harvel, L.D. and Grinter, R.E., \"Technology in Spiritual Formation: An Exploratory Study of Computer Mediated Religious Communications,\" Proc. CSCW 2006, ACM (2006), 199--208.  ",
      "doi": "10.1145/1180875.1180908"
    },
    {
      "text": "Zerubavel, E., Hidden Rhythms: Schedules and Calendars in Social Life. University of California Press, Berkeley, CA, 1981.",
      "doi": ""
    }
  ]
}