{
  "doi": "10.1145/1518701.1518812",
  "title": "From interaction to trajectories: designing coherent journeys through user experiences",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "709-718",
  "year": 2009,
  "badges": [],
  "abstract": "The idea of interactional trajectories through interfaces has emerged as a sensitizing concept from recent studies of tangible interfaces and interaction in museums and galleries. We put this concept to work as a lens to reflect on published studies of complex user experiences that extend over space and time and involve multiple roles and interfaces. We develop a conceptual framework in which trajectories explain these user experiences as journeys through hybrid structures, punctuated by transitions, and in which interactivity and collaboration are orchestrated. Our framework is intended to sensitize future studies, help distill craft knowledge into design guidelines and patterns, identify technology requirements, and provide a boundary object to connect HCI with Performance Studies.",
  "authors": [
    {
      "name": "Steve Benford",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Gabriella Giannachi",
      "institution": "The University of Exeter, Exeter, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583937",
      "orcid": "missing"
    },
    {
      "name": "Boriana Koleva",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100296314",
      "orcid": "missing"
    },
    {
      "name": "Tom Rodden",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100347821/rel-imgonly/81100347821.jpg",
      "acmid": "81100347821",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, A., Atkeson, C., Hong, J., Long, S., Kooper, R., Pinkerton, M., -Cyberguide: a mobile context-aware tour guide', Wireless Networks, 3 (5), Oct 1997, Kluwer  ",
      "doi": "10.1023/A%3A1019194325861"
    },
    {
      "text": "Aoki, P.M., Grinter, R.E. et al., 'Sotto Voce: Exploring the Interplay of Conversation and Mobile Audio Spaces', CHI 2002, Minneapolis, 431--438, 2002, ACM  ",
      "doi": "10.1145/503376.503454"
    },
    {
      "text": "Benford, S., Crabtree, A., Flintham, M., Drozd, A., Anastasi, R., Paxton, M., Nick Tandavanitj, N., Adams, M., Row-Farr, J. (2006) 'Can you see me now?' ACM Trans. Comput.-Hum. Interact, 13(1), 100--133.  ",
      "doi": "10.1145/1143518.1143522"
    },
    {
      "text": "Benford, S., Crabtree, A., Reeves, S., Sheridan, J., Dix, A., Flintham, M., Drozd, A., 'The Frame of the game: the opportunities and risks of staging digital experiences in public settings', CHI 2006, 427--436, 2006, ACM.",
      "doi": ""
    },
    {
      "text": "Benford, S., Giannachi, G., 'Temporal Trajectories in Shared Interactive Narratives', CHI 2008, 73--82, Florence, Italy, 2008, ACM.  ",
      "doi": "10.1145/1357054.1357067"
    },
    {
      "text": "Blumer, H., 'What is Wrong with Social Theory', American Sociological Review, 18, 3--10, 1954",
      "doi": ""
    },
    {
      "text": "Bowen, G., 'Grounded Theory and Sensitizing Concepts', International Journal of Qualitative Methods, 5 (3), September 2006",
      "doi": ""
    },
    {
      "text": "Brown, B., MacColl, I., Chalmers, M., Galani, A., Randell, C., Steed, A., 'Lessons from the lighthouse: collaboration in a shared mixed reality system', CHI 2003, 577--584, Ft Lauderdale, ACM.  ",
      "doi": "10.1145/642611.642711"
    },
    {
      "text": "Chalmers, M., Galani, A., 'Seamful interweaving: heterogeneity in the theory and design of interactive systems', Proc 5th Conference on Designing Interactive Systems, 243--252, Cambridge, MA, 2004, ACM.  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Cheok, A., Goh, K., Liu, W., Farbiz, F., Fong, S., Teo, S., Li, Y., Yang, X., 'Human Pacman: a mobile, wide-area entertainment system based on physical, social, and ubiquitous computing', Personal and Ubiquitous Computing, 8 (2), May 2004  ",
      "doi": "10.1007/s00779-004-0267-x"
    },
    {
      "text": "Cockton, G., 'Valuing User Experience', Proc, NordiCHI 2006 Workshop\"User Experience Towards a Unified View, 100--105, Oslo, Norway, October 2006",
      "doi": ""
    },
    {
      "text": "Costello, B., Muller, L., Amitani, S., Edmonds, E., 'Understanding the Experience of Interactive Art: Iamascope in Beta_space', Proc. 2nd Australasian Conference on Interactive entertainment, Sydney ",
      "doi": "10.5555/1109180.1109188"
    },
    {
      "text": "Crabtree, A., Rodden, T., Benford, S., 'Moving with the Times: IT Research and the Boundaries of CSCW', Computer Supported Cooperative Work (CSCW), 14 (3), 217--251, 2005, Kluwer  ",
      "doi": "10.1007/s10606-005-3642-x"
    },
    {
      "text": "Hagebölling, H., Interactive Dramaturgies, Springer, 2004",
      "doi": ""
    },
    {
      "text": "Hornecker, E. and Buur, J., 'Getting a grip on tangible interaction', CHI '06, 437--446, 2006, ACM.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Huang, E., Mynatt, E., Trimble, J., 'Displays in the wild: Understanding the dynamics and evolution of a display ecology', Proc Fourth International Conference on Pervasive Computing, 321--336, LNCS, Springer  ",
      "doi": "10.1007/11748625_20"
    },
    {
      "text": "Ingold, T., Lines: A Brief History, Routledge, 2007",
      "doi": ""
    },
    {
      "text": "Jonsson, J., Montola, M., Waern, A., Ericsson, M., 'Prosopopeia: Experiences from a Pervasive Larp', Proc. Advances in Computer Entertainment (ACE 06), article 23, June 2006, ACM  ",
      "doi": "10.1145/1178823.1178850"
    },
    {
      "text": "Koleva, B., Schnädelbach H., Benford, S.&amp;Greenhalgh, C., Traversable Interfaces Between Real and Virtual Worlds, CHI' 2000, The Hague.  ",
      "doi": "10.1145/332040.332437"
    },
    {
      "text": "Koleva, B., Taylor, I., Benford, S., Fraser, M., Greenhalgh, C., Schnädelbach, H., vom Lehn, D., Heath, C., Row-Farr, J., Adams, A., 'Orchestrating a mixed reality performance' CHI 2001, 38--45, Seattle, 2001. ACM.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Law, E., Kort, J, Roto., V., Hassenzahl, M., Vermeeren, A., 'Towards a Shared Definition of User Experience', CHI 2008, 2395--2398, April 5-10, Florence, Italy, ACM  ",
      "doi": "10.1145/1358628.1358693"
    },
    {
      "text": "Milgram P., Kishino, F., 'A Taxonomy of Mixed Reality Visual Displays', IEICE Transactions on Information Systems, E77-D12, 449--455, 1994.",
      "doi": ""
    },
    {
      "text": "Pfister, M., The Theory and Analysis of Drama, Cambridge University Press, 1998 (English translation)",
      "doi": ""
    },
    {
      "text": "Schnädelbach H., Rennick Egglestone, S., Reeves, S., Benford, S., Walker, B., Wright, M., 'Performing Thrill: Designing Telemetry Systems and Spectator Interfaces for Amusement Rides', CHI 2008, Florence, 2008.",
      "doi": ""
    },
    {
      "text": "Star, S. L., 'Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkeley's Museum of Vertebrate Zoology', Social Studies of Science, 19 (3), 387--420, 1989",
      "doi": ""
    },
    {
      "text": "Sutherland, I.E., 'Computer Displays' Scientific American, 222 (6), June, 1970, 57--81.",
      "doi": ""
    },
    {
      "text": "Tidwell, J., Designing Interfaces, O'Reilly Media, Inc., 2005, ISBN:0596008031 ",
      "doi": "10.5555/1203417"
    },
    {
      "text": "Vlahakis, V., Karigiannis, J., et al., 'ARCHEOGUIDE: First results of an Augmented Reality, Mobile Computing System in Cultural Heritage Sites', Proc. VAST 2001, ACM Press, 131 -- 140  ",
      "doi": "10.1145/584993.585015"
    },
    {
      "text": "vom Lehn, D. et al., 'Configuring exhibits', Verbal Art Across Cultures (eds. Knoblauch, H. and Kotthoff, H.), 281--297, 2001, Gunter Narr Verlag Tubingen.",
      "doi": ""
    },
    {
      "text": "Weiser, M., 'The Computer for the 21st Century', Scientific American, 265 (3), 94--104",
      "doi": ""
    }
  ]
}