{
  "doi": "10.1145/1518701.1518878",
  "title": "Capturing and sharing memories in a virtual world",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1161-1170",
  "year": 2009,
  "badges": [],
  "abstract": "Virtual worlds (VWs) such as Second Life® (SL) contain a rich social culture where people engage in a multitude of experiences much like real life. With this comes the need to capture and share memories with others. To understand what tools people use to accomplish this and what limitations they may face, we conducted interviews with participants in SL. Our results identify two clusters of users - Casuals and Lifers - who differed in the ways in which they captured and shared memories. Here we describe the use of photos, landmarks, friend lists, and conversation logs. We also show how a lack of real life physical and social constraints in the VW affects user routines, and, in some cases, how it does not. This suggests design directions for memory tools in the VW and also real life that break the bounds of current everyday practice.",
  "tags": [
    "photo sharing",
    "virtual worlds",
    "memories",
    "second life"
  ],
  "authors": [
    {
      "name": "Carman Neustaedter",
      "institution": "Kodak Research Labs, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Elena Fedorovskaya",
      "institution": "Kodak Research Labs, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435606538",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrams, D., Baecker, R., and Chignell, M. Information Archiving with Bookmarks, Proc CHI 1998, ACM Press (1998).  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Bardzell, S., and Bardzell, J. Sex-Interface-Aesthetics: The Docile Avatars and Embodied Pixels of Second Life BDSM, Proc. CHI 2006, ACM Press (2006).",
      "doi": ""
    },
    {
      "text": "Bartle, R. Designing Virtual Worlds, New Riders Publishing (2004). ",
      "doi": "10.5555/1196681"
    },
    {
      "text": "Brown, B., and Bell, M. CSCW at Play: 'There' as a CVE, Proc. CSCW 2004, ACM Press (2004).  ",
      "doi": "10.1145/1031607.1031666"
    },
    {
      "text": "Chalfen, R. (1987), Snapshot Versions of Life, Bowling Green State University, Ohio, Popular Press.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Rodden, T., and Mariani, J. Collaborating around Collections, Proc CHI 2004, ACM Press (2004).",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Dourish, P. Introduction: The State of Play, JCSCW Special Issue: Interaction and Collaboration in MUDs, 7(1--2), Springer, Netherlands (1998).  ",
      "doi": "10.1023/A%3A1008697019985"
    },
    {
      "text": "Doyle, D., and Kim, T. Embodied narrative: the virtual nomad and the meta dreamer, International Journal of Performance Arts and Digital Media, 3: 2&3, (2007).",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E., and Moore, R. \"Alone Together? Exploring the Social Dynamics of MMOG, Proc. CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Evard, R., Churchill, E., and Bly, S. Waterfall Glen: Social Virtual Reality at Work, In Collaborative Virtual Environments, Springer Verlag (2001).",
      "doi": ""
    },
    {
      "text": "Frohlich, D., Kuchinsky, A., Pering, C., Don, A., and Ariss, S. Requirements for Photoware, Proc. CSCW '02, ACM Press (2002), 166--175.  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Frohlich, D., and Fennell, J. Sound, Paper and Memorabilia, Personal&amp;Ubiquitous Computing, 11, (2007) 107--116.  ",
      "doi": "10.1007/s00779-006-0069-4"
    },
    {
      "text": "Grinter, R., Palen, L., and Eldridge, M. Chatting with Teenagers: Considering the Place of Chat Technologies in Teen Life, ACM ToCHI (2006), 423--447.  ",
      "doi": "10.1145/1188816.1188817"
    },
    {
      "text": "Halverson, C. The Value of Persistence: A Study of the Creation, Ordering and Use of Conversation Analysis, Proc. HICSS 2004, IEEE (2004). ",
      "doi": "10.5555/962752.962971"
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C., Benford, S., and Greenhalgh, C. (1998) Fragmented Interaction: Establishing mutual orientation in virtual environments, Proc. CSCW 1998, ACM Press.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., and Sellen, A. The Ubiquitous Camera, IEEE Pervasive Computing: Mobile and Ubiquitous Systems, 4(2), IEEE Computer Society (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Lowood, H. High-Performance Play: The Making of Machinima. Videogames and Art: Intersections and Interactions, Intellect Books (2005).",
      "doi": ""
    },
    {
      "text": "Makela, A., Giller, V., Tscheligi, M., and Sefelin, R. Joking, Storytelling, Artsharing, Expressing Affection, Proc. CHI 2000, ACM Press (2000), 548--554.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "Maslow, A. A Theory of Human Motivation, Psychological Review, 50 (1943), 370--96.",
      "doi": ""
    },
    {
      "text": "Miller, A., and Edwards, K., Give and Take: A Study of Consumer Photo-Sharing Culture and Practice, Proc. CHI 2007, ACM Press (2007), 347--356.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "Moore, R.J., Ducheneaut, N., and Nickell, E. Doing Virtually Nothing: Awareness and Accountability in Massively Multiplayer Online Worlds, JCSCW (2006).  ",
      "doi": "10.1007/s10606-006-9021-4"
    },
    {
      "text": "Nardi, B., Whittaker, S., and Bradner, E. Interaction and Outeraction: Instant Messaging in Action, Proc. CSCW 2000, ACM Press (2000), 1--10.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Neustaedter, C., Elliot, K., and Greenberg, S. Interpersonal Awareness in the Domestic Realm, Proc. OzCHI, (2006).  ",
      "doi": "10.1145/1228175.1228182"
    },
    {
      "text": "Nunes, M., Greenberg, S., and Neustaedter, C., Sharing Digital Photographs in the Home through Physical Mementos, Souvenirs, and Keepsakes, Proc. DIS 2008, ACM Press (2008).  ",
      "doi": "10.1145/1394445.1394472"
    },
    {
      "text": "Picard, M., Machinima: Video Game as an Art Form? Proc. CGSA 2006, (2006).",
      "doi": ""
    },
    {
      "text": "Pinhanez, C. The Everywhere Displays Project: A Device to Create Ubiquitous Graphical Interfaces, Proc. Ubicomp 2001, Springer-Verlag (2001). ",
      "doi": "10.5555/647987.741324"
    },
    {
      "text": "Rodden, K., and Wood, K. R. How do People Manage Their Digital Photographs?, Proc. CHI 2003, ACM Press (2003), 409--416.  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "Strauss, A., and Corbin, J. Basics of Qualitative Research, SAGE Publications (1998).",
      "doi": ""
    },
    {
      "text": "Walker Rettberg, J. Blogging: Digital Media and Society, Polity Press (2008). ",
      "doi": "10.5555/1481105"
    },
    {
      "text": "Waskul, D., and Douglas, M. Cyberself. The Emergence of Self in On-Line Chat, The Information Society, 13, (1997) 375--397.",
      "doi": ""
    }
  ]
}