{
  "doi": "10.1145/1518701.1519037",
  "title": "A performance model of selection techniques for p300-based brain-computer interfaces",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2205-2208",
  "year": 2009,
  "badges": [],
  "abstract": "In this paper, we propose a model to predict the performance of selection techniques using Brain-Computer Interfaces based on P300 signals. This model is based on Markov theory and can compute both the time required to select a target and the number of visual flashes needed. We illustrate how to use this model with three different interaction techniques to select a target. A first experimental evaluation with three healthy participants shows a good match between the model and the experimental data.",
  "tags": [
    "brain-computer interface",
    "p300 evoked potential",
    "interaction technique",
    "markov chains"
  ],
  "authors": [
    {
      "name": "Jean-Baptiste Sauvan",
      "institution": "INRIA/Supéléc, Rennes, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607636",
      "orcid": "missing"
    },
    {
      "name": "Anatole Lécuyer",
      "institution": "INRIA, Rennes, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289712",
      "orcid": "missing"
    },
    {
      "name": "Fabien Lotte",
      "institution": "INSA/INRIA, Rennes, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414604702",
      "orcid": "missing"
    },
    {
      "name": "Géry Casiez",
      "institution": "University of Lille 1/INRIA, Lille, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    }
  ],
  "references": [
    {
      "text": "B. Z. Allison and J. A. Pineda. Effects of SOA and flash pattern manipulations on ERPs, performance, and preference: Implications for a BCI system. International Journal of Psychophysiology, 59(2):127--140, 2006.",
      "doi": ""
    },
    {
      "text": "J. D. Bayliss. Use of the evoked potential P3 component for control in a virtual apartment. IEEE Transactions on Rehabilitation Enginnering, 11(2):113--116, June 2003.",
      "doi": ""
    },
    {
      "text": "F. Bießmann. New methods for the P300 visual speller. Lab Rotation Report, MPI Biological Cybernetics, Dept. Empirical Inference, 2006.",
      "doi": ""
    },
    {
      "text": "E. Donchin, K. M. Spencer, and R. Wijesinghe. The mental prosthesis: assessing the speed of a P300-based brain-computer interface. IEEE Transaction on Rehabilitation Engineering, 8(2):174--179, 2000.",
      "doi": ""
    },
    {
      "text": "C. M. Grinstead and J. L. Snell. Introduction to probability. American Mathematical Society, 1997.",
      "doi": ""
    },
    {
      "text": "B. Rebsamen, C. L. Teo, Q. Zeng, M. H. A. Jr., E. Burdet, C. Guan, H. Zhang, and C. Laugier. Controlling a wheelchair indoors using thought. Intelligent Systems, 22(2):18--24, April 2007.  ",
      "doi": "10.1109/MIS.2007.26"
    },
    {
      "text": "J. R. Wolpaw, N. Birbaumer, D. J. McFarland, G. Pfurtscheller, and T. M. Vaughan. Bain-computer interfaces for communication and control. Clinical Neurophysiology, 113(6):767--791, 2002.",
      "doi": ""
    }
  ]
}