{
  "doi": "10.1145/1518701.1518720",
  "title": "PrintMarmoset: redesigning the print button for sustainability",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "109-112",
  "year": 2009,
  "badges": [],
  "abstract": "In this paper, we discuss some unique challenges of sustainable interaction design (SID) and present our work that aims to reduce paper waste from web printing. We conducted a two-month field study of current behaviors and attitudes around printing, and the results confirmed the affordances of paper, but also revealed many problems associated with printing web content. We then designed and implemented a browser extension, PrintMarmoset, that targets these problems while simultaneously addressing user needs and environmental responsibility. It allows users to effortless select or remove web content for printing. We have also incorporated a data sharing mechanism into our solution to assist in the adoption of the tool and created visualizations to encourage user reflection and exploration.",
  "authors": [
    {
      "name": "Jun Xiao",
      "institution": "HP Labs, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100293220",
      "orcid": "missing"
    },
    {
      "name": "Jian Fan",
      "institution": "HP Labs, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81485642171",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baldwin, J, et al. PrintMonkey: Giving Users a grip on printing the web. In Proc. DocEng 2008.  ",
      "doi": "10.1145/1410140.1410189"
    },
    {
      "text": "Blevis, E. Sustainable interaction design: invention&amp;disposal, renewal&amp;reuse. In Proc. CHI 2007, ACM Press (2007), 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Cai, D., Yu, S., Wen, J.-R., and Ma, W.-Y. Vips: A vision-based page segmentation algorithm. Microsoft Tech. Rep., MSR-TR-2003-79, 2003.",
      "doi": ""
    },
    {
      "text": "Huang, M.M. and Truong, K.N. Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones. In Proc. CHI 2008, ACM Press (2008), 323--332.  ",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Mankoff, J., et al. Leveraging Social networks to motivate individuals to reduce their ecological footprints. In Proc. HICSS 2007.  ",
      "doi": "10.1109/HICSS.2007.325"
    },
    {
      "text": "Pousman, Z., et al. Imprint, a community visualization of printer data: designing for open-ended engagement on sustainability. In Proc. CSCW 2008.  ",
      "doi": "10.1145/1460563.1460568"
    },
    {
      "text": "Sellen, A. and Harper, R. Paper as an analytic resource for the design of new technologies. In Proc. CHI 1997, ACM Press (1997), 319--326.  ",
      "doi": "10.1145/258549.258780"
    },
    {
      "text": "Woodruff, A., Hasbrouck, J., and Augustin, S. A bright green perspective on sustainable choices. In Proc. CHI 2008, ACM Press (2008), 313--322.  ",
      "doi": "10.1145/1357054.1357109"
    }
  ]
}