{
  "doi": "10.1145/1518701.1518912",
  "title": "The angle mouse: target-agnostic dynamic gain adjustment based on angular deviation",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1401-1410",
  "year": 2009,
  "badges": [],
  "abstract": "We present a novel method of dynamic C-D gain adaptation that improves target acquisition for users with motor impairments. Our method, called the Angle Mouse, adjusts the mouse C-D gain based on the deviation of angles sampled during movement. When angular deviation is low, the gain is kept high. When angular deviation is high, the gain is dropped, making the target bigger in motor-space. A key feature of the Angle Mouse is that, unlike most pointing facilitation techniques, it is target-agnostic, requiring no knowledge of target locations or dimensions. This means that the problem of distractor targets is avoided because adaptation is based solely on the user's behavior. In a study of 16 people, 8 of which had motor impairments, we found that the Angle Mouse improved motor-impaired pointing throughput by 10.3% over the Windows default mouse and 11.0% over sticky icons. For able-bodied users, there was no significant difference among the three techniques, as Angle Mouse throughput was within 1.2% of the default. Thus, the Angle Mouse improved pointing performance for users with motor impairments while remaining unobtrusive for able-bodied users.",
  "authors": [
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142271",
      "orcid": "missing"
    },
    {
      "name": "Shih-Yen (Sean) Liu",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416594432",
      "orcid": "missing"
    },
    {
      "name": "Shunichi Kimuro",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416609209",
      "orcid": "missing"
    },
    {
      "name": "Susumu Harada",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81319492589/rel-imgonly/profile4.jpg",
      "acmid": "81319492589",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlström, D., Hitz, M. and Leitner, G. (2006) An evaluation of sticky and force enhanced targets in multi target situations. Proc. NordiCHI '06. New York: ACM Press, 58--67.  ",
      "doi": "10.1145/1182475.1182482"
    },
    {
      "text": "Balakrishnan, R. (2004) \"Beating\" Fitts' law: Virtual enhancements for pointing facilitation. Int'l J. Human-Computer Studies 61 (6), 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B. and Zierlinger, A. (2003) Drag-and-Pop and Drag-and-Pick: Techniques for accessing remote screen content on touch- and pen-operated systems. Proc. INTERACT '03. Amsterdam: IOS Press, 57--64.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Cutrell, E., Hinckley, K. and Gruen, R. (2004) Mouse ether: Accelerating the acquisition of targets across multi-monitor displays. Extended Abstracts CHI '04. New York: ACM Press, 1379--1382.  ",
      "doi": "10.1145/985921.986069"
    },
    {
      "text": "Blanch, R., Guiard, Y. and Beaudouin-Lafon, M. (2004) Semantic pointing: Improving target acquisition with control-display ratio adaptation. Proc. CHI '04. New York: ACM Press, 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Casiez, G., Vogel, D., Balakrishnan, R. and Cockburn, A. (2008) The impact of control-display gain on user performance in pointing tasks. Human-Computer Interaction 23 (3), 215--250.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and Firth, A. (2003) Improving the acquisition of small targets. Proc. HCI '03. Swindon, UK: British Computer Society, 181--196.",
      "doi": ""
    },
    {
      "text": "Douglas, S.A., Kirkpatrick, A.E. and MacKenzie, I.S. (1999) Testing pointing device performance and user assessment with the ISO 9241, Part 9 standard. Proc. CHI '99. New York: ACM Press, 215--222.  ",
      "doi": "10.1145/302979.303042"
    },
    {
      "text": "Fichten, C.S., Barile, M., Asuncion, J.V. and Fossey, M.E. (2000) What government, agencies, and organizations can do to improve access to computers for postsecondary students with disabilities: Recommendations based on Canadian empirical data. Int'l J. Rehabilitation Research 23 (3), 191--199.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. (1954) The information capacity of the human motor system in controlling the amplitude of movement. J. Experimental Psychology 47 (6), 381--391.",
      "doi": ""
    },
    {
      "text": "Fuhrer, C.S. and Fridie, S.E. (2001) There's a mouse out there for everyone. Proc. CSUN '01. Cal State Northridge.",
      "doi": ""
    },
    {
      "text": "Gajos, K.Z., Wobbrock, J.O. and Weld, D.S. (2008) Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. Proc. CHI '08. New York: ACM Press, 1257--1266.  ",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. (2005) The Bubble Cursor: Enhancing target acquisition by dynamic resizing of the cursor's activation area. Proc. CHI '05. New York: ACM Press, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R. and Beaudouin-Lafon, M. (2004) Object pointing: A complement to bitmap pointing in GUIs. Proc. GI '04. Waterloo, Ontario: Canadian Human-Computer Communications Society, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Hourcade, J.P., Bederson, B.B., Druin, A. and Guimbretière, F. (2004) Differences in pointing task performance between preschool children and adults using mice. ACM TOCHI 11 (4), 357--386.  ",
      "doi": "10.1145/1035575.1035577"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P. and Clarkson, P.J. (2003) Multiple haptic targets for motion-impaired computer users. Proc. CHI '03. New York: ACM Press, 41--48.  ",
      "doi": "10.1145/642611.642620"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P. and Clarkson, P.J. (2004) Mouse movements of motion-impaired users: A submovement analysis. Proc. ASSETS '04. New York: ACM Press, 102--109.  ",
      "doi": "10.1145/1028630.1028649"
    },
    {
      "text": "Jellinek, H.D. and Card, S.K. (1990) Powermice and user performance. Proc. CHI '90. New York: ACM Press, 213--220.  ",
      "doi": "10.1145/97243.97276"
    },
    {
      "text": "Kabbash, P. and Buxton, W. (1995) The \"Prince\" technique: Fitts' law and selection using area cursors. Proc. CHI '95. New York: ACM Press, 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Keates, S., Hwang, F., Langdon, P., Clarkson, P.J. and Robinson, P. (2002) Cursor measures for motion-impaired computer users. Proc. ASSETS '02. New York: ACM Press, 135--142.  ",
      "doi": "10.1145/638249.638274"
    },
    {
      "text": "Keyson, D.V. (1997) Dynamic cursor gain and tactual feedback in the capture of cursor movements. Ergonomics 40 (12), 1287--1298.",
      "doi": ""
    },
    {
      "text": "Koester, H.H., LoPresti, E.F. and Simpson, R.C. (2005) Toward Goldilocks' pointing device: Determining a \"just right\" gain setting for users with physical impairments. Proc. ASSETS '05. New York: ACM Press, 84--89.  ",
      "doi": "10.1145/1090785.1090802"
    },
    {
      "text": "Langdon, P.M., Hwang, F., Keates, S., Clarkson, P.J. and Robinson, P. (2002) Developing assistive interfaces for motion-impaired users using cursor movement analysis in conjunction with haptic feedback. Proc. ICDVRAT '02. Reading, UK: ICDVRAT, 223--230.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Riddersma, S. (1994) Effects of output display and control-display gain on human performance in interactive systems. Behaviour and Information Technology 13 (5), 328--337.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., Kauppinen, T. and Silfverberg, M. (2001) Accuracy measures for evaluating computer pointing devices. Proc. CHI '01. New York: ACM Press, 9--16.  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "Mandryk, R.L. and Gutwin, C. (2008) Perceptibility and utility of sticky targets. Proc. GI '08. Toronto: Canadian Human-Computer Communications Society, 65--72. ",
      "doi": "10.5555/1375714.1375726"
    },
    {
      "text": "McGuffin, M. and Balakrishnan, R. (2002) Acquisition of expanding targets. Proc. CHI '02. New York: ACM Press, 57--64.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "Meyer, D.E., Abrams, R.A., Kornblum, S., Wright, C.E. and Smith, J.E.K. (1988) Optimality in human motor performance: Ideal control of rapid aimed movements. Psychological Review 95 (3), 340--370.",
      "doi": ""
    },
    {
      "text": "Mithal, A.K. and Douglas, S.A. (1996) Differences in movement microstructure of the mouse and the finger-controlled isometric joystick. Proc. CHI '96. New York: ACM Press, 300--307.  ",
      "doi": "10.1145/238386.238533"
    },
    {
      "text": "Sato, S., Kitajima, M. and Fukui, Y. (2002) Proposal of a new mouse with realtime Mickey Ratio adjuster controlled by grasping force. Proc. SICE '07. Tokyo: Society of Instrument and Control Engineers, 2702--2705.",
      "doi": ""
    },
    {
      "text": "Smith, M.W., Sharit, J. and Czaja, S.J. (1999) Aging, motor control, and the performance of computer mouse tasks. Human Factors 41 (3), 389--396.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. (2004) Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. Int'l J. Human-Computer Studies 61 (6), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Trewin, S. and Pain, H. (1999) Keyboard and mouse errors due to motor disabilities. Int'l J. Human-Computer Studies 50 (2), 109--144.  ",
      "doi": "10.1006/ijhc.1998.0238"
    },
    {
      "text": "Walker, N., Philbin, D.A. and Fisk, A.D. (1997) Age-related differences in movement control: Adjusting submovement structure to optimize performance. J. Gerontology: Psychological Sciences 52B (1), 40--52.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O. and Gajos, K.Z. (2007) A comparison of area pointing and goal crossing for people with and without motor impairments. Proc. ASSETS '07. New York: ACM Press, 3--10.  ",
      "doi": "10.1145/1296843.1296847"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K. and Hudson, S.E. (1997) Making computers easier for older adults to use: Area cursors and sticky icons. Proc. CHI '97. New York: ACM Press, 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Zhai, S., Morimoto, C. and Ihde, S. (1999) Manual and gaze input cascaded (MAGIC) pointing. Proc. CHI '99. New York: ACM Press, 246--253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}