{
  "doi": "10.1145/1518701.1518848",
  "title": "'Helpfulness' in online communities: a measure of message quality",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "955-964",
  "year": 2009,
  "badges": [],
  "abstract": "Online communities displaying textual postings require measures to combat information overload. One popular approach is to ask participants whether or not messages are helpful in order to then guide others to interesting content. Adopting a well-established framework for assessing data quality, we examine the nature of \"helpfulness.\"We study consumer reviews at Amazon.com, deriving 22 measures quantifying their textual properties, authors' reputations and product characteristics. Confirmatory factor analysis reveals five underlying quality dimensions representing reviewers' reputations in the community, the topical relevancy of the reviews, the ease of understanding them, their believability and objectivity. A correlation and regression analysis confirms that these dimensions are related to the helpfulness scores assigned by community participants. However, it also uncovers a strong relationship between the chronological ordering of reviews and helpfulness, which both community participants and designers should keep in mind when using this method of social navigation.",
  "tags": [
    "product reviews",
    "online community",
    "social navigation",
    "information overload",
    "information quality"
  ],
  "authors": [
    {
      "name": "Jahna Otterbacher",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100101769/rel-imgonly/jco.jpg",
      "acmid": "81100101769",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chevalier, J.A. and Mayzlin, D. The effect of word of mouth on sales: Online book reviews. Journal of Marketing Research 43, 3 (2006), 345--354.",
      "doi": ""
    },
    {
      "text": "David, S. and Pinch, T. Six degrees of reputation: the use and abuse of online review and recommendation systems. First Monday 11, 3 (2006).",
      "doi": ""
    },
    {
      "text": "Foltz, P.W., Laham, D., Landauer, T.K. Automated essay scoring: Applications to educational technology. In Proc. EdMedia, (1999).",
      "doi": ""
    },
    {
      "text": "Ghose, A. and Ipeirotis, P.G. Designing novel review ranking systems: Predicting usefulness and impact of reviews. In Proc. International Conference on Electronic Commerce, ACM Press (2007).  ",
      "doi": "10.1145/1282100.1282158"
    },
    {
      "text": "Goldberg, D., Nichols, D., Oki, B.M. and Terry, D. Using collaborative filtering to weave an information tapestry. Communications of the Association for Computing Machinery 35, 12 (1992), 61--70.  ",
      "doi": "10.1145/138859.138867"
    },
    {
      "text": "Gorsuch, R.L. Factor Analysis. Lawrence Erlbaum, Hillsdale, New Jersey, 1983.",
      "doi": ""
    },
    {
      "text": "Gu, B., Konana, P., Rajagopalan, B., and Chen, H.M. Competition among virtual communities and user valuation: the case of investing-related communities. Information Systems Research 18, 1 (2007), 68--85.  ",
      "doi": "10.1287/isre.1070.0114"
    },
    {
      "text": "Hiltz, S.R. and Turoff, M. Structuring computer-mediated communication systems to avoid information overload. Communications of the Association for Computing Machinery 28, 7 (1985), 680--689.  ",
      "doi": "10.1145/3894.3895"
    },
    {
      "text": "Jansen, B.J., Spink, A. and Saracevic, T. Real life, real users, and real needs: a study and analysis of user queries on the web. Information Processing and Management 36 (2000), 207--227.  ",
      "doi": "10.1016/S0306-4573%2899%2900056-4"
    },
    {
      "text": "Jones, Q., Ravid, G. and Rafaeli, S. Information overload and the message dynamics of online interaction spaces: a theoretical model and empirical exploration. Information Systems Research 15, 2 (2004), 194--210.  ",
      "doi": "10.1287/isre.1040.0023"
    },
    {
      "text": "Kaiser, H.F. The application of electronic computers to factor analysis. Educational and Psychological Measurement 20, (1960), 141--151.",
      "doi": ""
    },
    {
      "text": "Lampe, D., Johnston, E. and Resnick. P. Follow the reader: Filtering comments on Slashdot. In Proc. CHI 2007, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240815"
    },
    {
      "text": "Loehlin, J. C. Latent Variable Models. Lawrence Erlbaum Associates, 1992.",
      "doi": ""
    },
    {
      "text": "Manning C. D. and Schutze, H. Foundations of Statistical Natural Language Processing. Massachusetts Institute of Technology Press, 2000. ",
      "doi": "10.5555/311445"
    },
    {
      "text": "Otterbacher, J. Managing information in online product review communities: a comparison of two approaches. In Proc. 16th European Conference on Information Systems (ECIS 2008), Association for Information Systems (2008).",
      "doi": ""
    },
    {
      "text": "Pipino, L.L., Lee, Y.W., and Wang, R.Y. Data quality assessment. Communications of the Association for Computing Machinery 45, 4 (2002), 211--218.  ",
      "doi": "10.1145/505248.506010"
    },
    {
      "text": "Radev, D.R., Jing, H., Stys, H., and Tam, D. Centroid-based summarization of multiple documents. Information Processing and Management 40, (2004), 919--938.  ",
      "doi": "10.1016/j.ipm.2003.10.006"
    },
    {
      "text": "Rashid, A.M., Ling, K., Tassone, R.D., Resnick, P., Kraut, R., and Riedl, J. Motivating participation by displaying the value of contribution. In Proc. CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124915"
    },
    {
      "text": "Rindova, V., Petkova, A.P. and Kotha, S. Standing out: How new firms in emerging marketing build reputation and knowledge creation. Strategic Organization 5, 31 (2007), 31--70.",
      "doi": ""
    },
    {
      "text": "Sack, W. Conversation map: An interface for very large-scale conversations. Journal of Management Information Systems 17, 3, (2001), 73--92. ",
      "doi": "10.5555/1289640.1289645"
    },
    {
      "text": "Salton, G. and McGill, M.J. Introduction to Modern Information Retrieval. McGraw-Hill Inc., New York, 1986. ",
      "doi": "10.5555/576628"
    },
    {
      "text": "Schindler, R.M. and Bickart, B. Published word of mouth: Referable, consumer-generated information on the Internet. In: Hauvgedt, C., Machleit, K. and Yalch, R. (eds.) Online Consumer Psychology: Understanding and Influencing Behavior in the Virtual World. Lawrence Erlbaum Associates, 2005, 35--61.",
      "doi": ""
    },
    {
      "text": "Tang, R., Ng, K.B., Strzalkowski, T., and Kantor, P.B. Automatically predicting information quality in news documents. In Proc. Human Language Technology - North American Association for Computational Linguistics, Association for Computational Linguistics (2003).  ",
      "doi": "10.3115/1073483.1073516"
    },
    {
      "text": "Wang, R.Y. and Strong, D.M. Beyond accuracy: what data quality means to data consumers. Journal of Management Information Systems 12, 4 (1996), 5--34. ",
      "doi": "10.1080/07421222.1996.11518099"
    },
    {
      "text": "Zhang, Z. and Varadarajan, B. Utility scoring of product reviews. In Proc. of the Conference on Information and Knowledge Management, ACM Press (2006).  ",
      "doi": "10.1145/1183614.1183626"
    }
  ]
}