{
  "doi": "10.1145/1518701.1518788",
  "title": "Text entry performance of state of the art unconstrained handwriting recognition: a longitudinal user study",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "567-570",
  "year": 2009,
  "badges": [],
  "abstract": "We report on a longitudinal study of unconstrained handwriting recognition performance. After 250 minutes of practice, participants had a mean text entry rate of 24.1 wpm. For the first four hours of usage, entry and error rates of handwriting recognition are about the same as for a baseline QWERTY software keyboard. Our results reveal that unconstrained handwriting is faster than what was previously assumed in the text entry literature.",
  "tags": [
    "software keyboard",
    "handwriting",
    "handwriting recognition"
  ],
  "authors": [
    {
      "name": "Per Ola Kristensson",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    },
    {
      "name": "Leif C. Denby",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416599730",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailey, R.W. Human Performance Engineering: Using Human Factors/Ergonomics to Achieve Computer System Usability. Prentice Hall (1989). ",
      "doi": "10.5555/62023"
    },
    {
      "text": "Card, S.K., Moran, T.P. and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates (1983). ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Devoe, D.B. Alternatives to handprinting in the manual entry of data. IEEE Transactions on Human Factors in Electronics HFE-8, 1 (1967), 21--32.",
      "doi": ""
    },
    {
      "text": "Frankish, C., Hull, R. and Morgan, P. Recognition accuracy and user acceptance of pen interfaces. Proc. CHI 1995, ACM Press (1995), 503--510.  ",
      "doi": "10.1145/223904.223972"
    },
    {
      "text": "LaLomia, M.J. User acceptance of handwritten recognition accuracy. Conference Companion CHI 1994, ACM Press (1994), 107.  ",
      "doi": "10.1145/259963.260086"
    },
    {
      "text": "MacKenzie, I.S. and Chang, L. A performance comparison of two handwriting recognizers. Interacting with Computers 11, 3 (1999), 283--297.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Soukoreff, R.W. Text entry for mobile computing: models and methods, theory and practice. Human-Computer Interaction 17 (2002), 147--198.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Soukoreff, R.W. Phrase sets for evaluating text entry techniques. Ext. Abstracts CHI 2003, ACM Press (2003), 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Seibel, R. Data entry devices and procedures. In Van Cott, H.P. and Kinkade, R.G. (Eds.). Human Engineering Guide to Equipment Design. John Wiley&amp;Sons (1972), 311--344.",
      "doi": ""
    },
    {
      "text": "Zhai, S., Kristensson, P.O. and Smith, B.A. In search of effective text input interfaces for off the desktop computing. Interacting with Computers 17, 3 (2005), 229--250.",
      "doi": ""
    }
  ]
}