{
  "doi": "10.1145/1518701.1519040",
  "title": "Anatomy of a failure: how we knew when our design went wrong, and what we learned from it",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2213-2222",
  "year": 2009,
  "badges": [],
  "abstract": "In this paper, we describe the failure of a novel sensor-based system intended to evoke user interpretation and appropriation in domestic settings. We contrast participants' interactions in this case study with those observed during more successful deployments to identify 'symptoms of failure' under four themes: engagement, reference, accommodation, and surprise and insight. These themes provide a set of sensitivities or orientations that may complement traditional task-based approaches to evaluation as well as the more open-ended ones we describe here. Our system showed symptoms of failure under each of these themes. We examine the reasons for this at three levels: problems particular to the specific design hypothesis; problems relevant for input-output mapping more generally; and problems in the design process we used. We conclude by noting that, although interpretive systems such as the one we describe here may succeed in a myriad of different ways, it is reassuring to know that they can also fail, and fail incontrovertibly, yet instructively.",
  "authors": [
    {
      "name": "William Gaver",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    },
    {
      "name": "John Bowers",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260889",
      "orcid": "missing"
    },
    {
      "name": "Tobie Kerridge",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488900",
      "orcid": "missing"
    },
    {
      "name": "Andy Boucher",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100230335",
      "orcid": "0000-0002-4226-7059"
    },
    {
      "name": "Nadine Jarvis",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602135",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bødker, S. When Second Wave HCI meets Third Wave challenges. NordCHI 2006. (2006).  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Boehner, K., DePaula, R., Dourish, P., and Sengers, P. Affect: from information to interaction. Proc. CC '05. ACM, (2005), 59--68.  ",
      "doi": "10.1145/1094562.1094570"
    },
    {
      "text": "Cooper, G. and Bowers, J., Representing the user. In Thomas, P. (ed.), The social and interactional dimensions of human-computer interfaces. New York: Cambridge University Press (1995). ",
      "doi": "10.5555/214811.214821"
    },
    {
      "text": "Gaver, W. (2007). Cultural commentators: Non-native interpretations as resources for polyphonic assessment. International Journal of Human-Computer Studies, 65, 4 (2007), 292--305.  ",
      "doi": "10.1016/j.ijhcs.2006.11.014"
    },
    {
      "text": "Gaver, W., Bowers, J., Boucher, A., Law, A., and Pennington, S. Electronic furniture for the Curious Home: Assessing ludic designs in the field. International Journal of Human-Computer Interaction, 22, 1-2 (2007), 119--152.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Sengers, P., Kerridge, T., Kaye, J., and Bowers, J. Enhancing ubiquitous computing with user interpretation: field testing the home health horoscope. Proc. CHI '07 ACM (2007), 537--546.  ",
      "doi": "10.1145/1240624.1240711"
    },
    {
      "text": "Harrison S, Tatar D, Sengers P. The three paradigms of HCI. alt.CHI'07. (2007).",
      "doi": ""
    },
    {
      "text": "Höök, K., Sengers, P., and Andersson, G. Sense and sensibility: evaluation and interactive art. Proc. CHI '03. ACM (2003), 241--248.  ",
      "doi": "10.1145/642611.642654"
    },
    {
      "text": "Isbister, K., Höök, K., Sharp, M., and Laaksolahti, J. The sensual evaluation instrument: developing an affective evaluation tool. Proc. CHI '06. ACM (2006). 1163--1172.  ",
      "doi": "10.1145/1124772.1124946"
    },
    {
      "text": "McCarthy J, Wright P: Technology as Experience. MIT Press (2004). ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Romero, M., Pousman, Z., and Mateas, M. Tableau machine: an alien presence in the home. CHI '06 Extended Abstracts, ACM, (2006), 1265--1270.  ",
      "doi": "10.1145/1125451.1125687"
    },
    {
      "text": "Sengers, P. and Gaver, W. Staying Open to interpretation: Engaging multiple meanings in design and evaluation. Proc. DIS 2006. ACM Press (2006).  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evenson, S. Research through design as a method for interaction design research in HCI. Proc. CHI '07. ACM, (2007), 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}