{
  "doi": "10.1145/1518701.1518980",
  "title": "The problem of consistency in the design of Fitts' law experiments: consider either target distance and width or movement form and scale",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1809-1818",
  "year": 2009,
  "badges": [],
  "abstract": "An intriguing anomaly of the usual way of designing Fitts' law experiments in experimental psychology and HCI is exposed: experiments are traditionally designed so as to carefully balance two ancillary factors, target distance D and target width W, but not task difficulty, the factor unanimously thought to be crucial. Troubling factor confounds and hence quantitative estimation errors result from this inconsistency. The problem, it is suggested, may be fixed if the equivocalness of the fractional expression D/W that appears on the right-hand side of Fitts' law equations is acknowledged. This two-degree-of-freedom expression can be taken to specify either D and W or the form F and the scale S of the movement task. The paper ends up with practical recommendations for the design of consistent Fitts' law experiments. In most cases eliminating one factor will allow a safer estimation of Fitts' law parameters, while simplifying the experimental work.",
  "tags": [
    "target tolerance",
    "movement form",
    "target width",
    "Fitts' law",
    "experimental design",
    "theory",
    "movement scale",
    "methodology",
    "movement shape",
    "movement amplitude",
    "target distance",
    "movement difficulty"
  ],
  "authors": [
    {
      "name": "Yves Guiard",
      "institution": "CNRS & TELECOM ParisTech, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143867",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrams, R.A., Kornblum, S., Meyer, D.E.,&amp;Wright, C.E. (1983). Fitts' law: Optimization of initial ballistic impulses for aimed movements. Bulletin of the Psychonomic Society, 22, 335.",
      "doi": ""
    },
    {
      "text": "Card, S.K., English, W.K.,&amp;Burr, B.J. (1978). Evaluation of mouse, rate controlled isometric joystick, step keys and text keys for text selection on a CRT. Ergonomics, 21, 601--613.",
      "doi": ""
    },
    {
      "text": "Elliott, D., Helsen, W.F.&amp;Chua, R. (2001). A century later: Woodworth's two-component model of goal-directed aiming. Psychological Bulletin, 127, 342--357.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47, 381--391 (reprinted in Journal of Experimental Psychology: General, 1992, 121(3), 262--269).",
      "doi": ""
    },
    {
      "text": "Fitts, P.M.,&amp;Peterson, J.R. (1964). Information capacity of discrete motor responses. Journal of Experimental Psychology, 67, 103--112.",
      "doi": ""
    },
    {
      "text": "Guiard, Y. (1993). On Fitts' and Hooke's laws: simple harmonic movement in upper-limb cyclical aiming. Acta Psychologica, 82, 139--159.",
      "doi": ""
    },
    {
      "text": "Guiard, Y.&amp;Beaudouin-Lafon, M. (2004). Target acquisition in multi-scale electronic worlds. International Journal of Human-Computer Studies, 61(6), 875--905.  ",
      "doi": "10.1016/j.ijhcs.2004.09.005"
    },
    {
      "text": "Guiard, Y., Blanch, R.,&amp;Beaudouin-Lafon, M. (2004). Object pointing: A complement to bitmap pointing in GUIs. Proc. of Graphics Interface 2004 (pp. 9--16). London, Ontario, Canada: A. K. Peters Ltd. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Guiard, Y. (2001). Disentangling relative from absolute movement amplitude in Fitts' law experiments. CHI'2001 (pp. 315--316). New York: ACM Press.  ",
      "doi": "10.1145/634067.634254"
    },
    {
      "text": "Guiard, Y. (2007). De l'ambiguïté des écritures fractionnaires: interprétations polaire et cartésienne de l'expression D/W dans les lois de Fitts et d'Accot et Zhai. Proc. of IHM 2007 (pp. 19--22). New York: ACM Press.  ",
      "doi": "10.1145/1541436.1541440"
    },
    {
      "text": "Guiard, Y.&amp;Beaudouin-Lafon, M. (Eds., 2004). Fitts' Law Fifty Years Later: Applications and Contributions from Human-Computer Interaction. Special issue, International Journal of Human-Computer Studies, 61 (6).  ",
      "doi": "10.5555/1056153.1056154"
    },
    {
      "text": "Hoffmann, E.R. (1996). The use of dimensional analysis in movement studies. Journal of Motor Behavior, 28 (2), 113--123.",
      "doi": ""
    },
    {
      "text": "ISO. ISO/DIS 9241-9 Ergonomic requirements for office work with visual display terminals (VDTs) - Part 9: Requirements for non-keyboard input devices. International Standard, International Organization for Standardization (2000).",
      "doi": ""
    },
    {
      "text": "Jagacinski, R.J., Repperger, D.W., Moran, M.S., Ward, S.L.,&amp;Glass, B. (1980). Fitts' law and the microstructure of rapid discrete movements. Journal of Experimental Psychology: Human Perception and Performance, 6, 309--320.",
      "doi": ""
    },
    {
      "text": "Langolf, G.D., Chaffin, D.B.,&amp;Foulke, J.A. (1976). An investigation of Fitts' law using a wide range of movement amplitudes. Journal of Motor Behavior, 8, 113--128.",
      "doi": ""
    },
    {
      "text": "Luce, R.D. (2003). Whatever happened to information theory in psychology? Review of General Psychology, 7, 183--188.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. (1992). Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7, 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I.S.,&amp;Soukoreff, R.W. (2002). Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction, 17, 147--198.",
      "doi": ""
    },
    {
      "text": "McMahon, T.A.& Bonner, J.T. (1983). On Size and Life. New York. Scientific American Library.",
      "doi": ""
    },
    {
      "text": "Meehl, P.E. (1997). The problem is epistemology, not statistics: Replace significance tests by confidence intervals and quantify accuracy of risky numerical predictions. In L.L. Harlow, S.A. Mulaik, and J.H. Steiger (Eds.), What if there were no significance tests? (pp. 393--425). Mahwah, NJ: Erlbaum. Available online at http://www.tc.umn.edu/~pemeehl/169ProblemIsEpistemology.pdf",
      "doi": ""
    },
    {
      "text": "Meyer, D.E., Abrams, R.A., Kornblum, S., Wright, C.E.,&amp;Smith, J.E.K. (1988). Optimality in human motor performance: Ideal control of rapid aimed movements. Psychological Review, 95, 340--370.",
      "doi": ""
    },
    {
      "text": "Plamondon, R.,&amp;Alimi, A.M. (1997). Speed/accuracy trade-offs in target-directed movements. Behavioral and Brain Sciences, 20, 279--349.",
      "doi": ""
    },
    {
      "text": "Schmidt, R.A., Zelaznik, H.N., Hawkins, B., Frank, J.S.,&amp;Quinn, J.T. (1979). Motor-output variability: A theory for the accuracy of rapid motor acts. Psychological Review, 86, 415--451.",
      "doi": ""
    },
    {
      "text": "Shannon, C.E. (1948). A Mathematical Theory of Communication. Bell System Technical Journal, 27, 379--423 and 623--656.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R. W.,&amp;MacKenzie, I.S. (2004). Towards a standard for pointing device evaluation: Perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies, 61, 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Thompson, D'Arcy W. (1917 and later editions). On Growth and Form. Cambridge (UK): Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Welford, A.T. (1968). Fundamentals of skill. London: Methuen.",
      "doi": ""
    },
    {
      "text": "Woodworth, R.S. (1899). The accuracy of voluntary movement. Psychological Review, 3, (Monograph Supplement), 1--119.",
      "doi": ""
    },
    {
      "text": "Wright, C.E. (1993). Evaluating the special role of time in the control of handwriting. Acta Psychologica, 82, 5--52.",
      "doi": ""
    },
    {
      "text": "Zhai, S. (2004). Characterizing computer input with Fitts' law parameters - The information and non-information aspects of pointing. International Journal of Human-Computer Studies, 61(6), 791--809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    },
    {
      "text": "Zhai, S., Hunter, M., Smith, B.A. (2000). The Metropolis Keyboard: An Exploration of Quantitative Techniques for Virtual Keyboard Design. Proc. of UIST 2000 (pp 119--128). New York: ACM Press.  ",
      "doi": "10.1145/354401.354424"
    }
  ]
}