{
  "doi": "10.1145/1518701.1518979",
  "title": "Self-interruption on the computer: a typology of discretionary task interleaving",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1799-1808",
  "year": 2009,
  "badges": [],
  "abstract": "The typical information worker is interrupted every 12 minutes, and half of the time they are interrupting themselves. However, most of the research on interruption in the area of human-computer interaction has focused on understanding and managing interruptions from external sources. Internal interruptions -- user-initiated switches away from a task prior to its completion -- are not well understood. In this paper we describe a qualitative study of self-interruption on the computer. Using a grounded theory approach, we identify seven categories of self-interruptions in computer-related activities. These categories are derived from direct observations of users, and describe the motivation, potential consequences, and benefits associated with each type of self-interruption observed. Our research extends the understanding of the self-interruption phenomenon, and informs the design of systems to support discretionary task interleaving on the computer.",
  "tags": [
    "task-switching",
    "interruption",
    "work fragmentation",
    "multi-tasking",
    "work spheres",
    "attention",
    "self-interruption"
  ],
  "authors": [
    {
      "name": "Jing Jin",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547680356",
      "orcid": "missing"
    },
    {
      "name": "Laura A. Dabbish",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P.D.,&amp;Bailey, B.P. If not now, when?: the effects of interruption at different moments within task execution, In Proc. CHI 2004, ACM Press (2004), 271--278.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Bannon L., Cypher A., Greenspan S.&amp;Monty M. L. Evaluation and analysis of users' activity organization. In Proc.CHI 1983, ACM Press (1983), 54--57.  ",
      "doi": "10.1145/800045.801580"
    },
    {
      "text": "Bardram, J., Bunde-Pedersen, J.,&amp;Soegaard, M. Support for activity-based computing in a personal computing operating system. In Proc. CHI 2006, ACM Press (2006), 211--220.  ",
      "doi": "10.1145/1124772.1124805"
    },
    {
      "text": "Card S. K.,&amp;Henderson A. A multiple, virtual-workspace interface to support user task switching, In Proc. CHI 1987, ACM Press (1987), 53--59.  ",
      "doi": "10.1145/29933.30860"
    },
    {
      "text": "Cellier J.M.,&amp;Eyrolle H. Interference between switched tasks, Ergonomics, 35, 1 (1992), 25--36.",
      "doi": ""
    },
    {
      "text": "Cutrell, E.B., Czerwinski, M.,&amp;Horvitz, E. Effects of instant messaging interruptions on computing tasks, In Proc. CHI 2000, ACM Press (2000), 99--100.  ",
      "doi": "10.1145/633292.633351"
    },
    {
      "text": "Czikszentmihalyi, M. Flow: The Psychology of Optimal Experience. Harper Collins, NY, NY, 1990.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Horvitz, E.,&amp;Wilhite, S. A diary study of task switching and interruptions. In Proc. CHI 2004, ACM Press (2004), 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Dragunov A.N., Dietterich T.G., Johnsrude K., McLaughlin M., Li L.&amp;Herlocker J.L. TaskTracer: A desktop environment to support multi-tasking knowledge workers, In Proc.IUI 2005, ACM Press (2005), 75--82.  ",
      "doi": "10.1145/1040830.1040855"
    },
    {
      "text": "Eisenhardt, K.M. Building theories from case study research, Academy of Management Review, 14, 4 (1989), 532--550.",
      "doi": ""
    },
    {
      "text": "Finstad K., Bink M., McDaniel M.,&amp;Einstein G. O. Breaks and task switches in prospective memory, Applied Cognitive Psychology, 20, 5 (2006), 705--712.",
      "doi": ""
    },
    {
      "text": "Glaser, B.G.,&amp;Strauss, A.L. The Discovery of Grounded Theory: Strategies for Qualitative Research, Aldine Publishing Co, Chicago, IL, US, 1967.",
      "doi": ""
    },
    {
      "text": "Gonzalez, V.,&amp;Marks, G. \"Constant, constant, multitasking craziness\": Managing multiple working spheres. In Proc. CHI 2004, ACM Press (2004), 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Iqbal, S.,&amp;Horvitz, E. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proc. CHI 2007, ACM Press (2007), 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Jett Q. R.,&amp;George J. M. Work interrupted: A closer look at the role of interruptions in organizational life, Academy of Management Review, 28, 3 (2003), 494--507.",
      "doi": ""
    },
    {
      "text": "Mark, G., Gonzalez, V.,&amp;Harris, J. No task left behind? Examining the nature of fragmented work. In Proc. CHI 2005, ACM Press (2005), 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Martin, P.Y.,&amp;B.A. Turner. Grounded theory and organizational research,\" The Journal of Applied Behavioral Science,22, 2 (1986) 141--157.",
      "doi": ""
    },
    {
      "text": "McFarlane, D. Comparison of four primary methods for coordinating the interruptions of people in human-computer interaction. Human-Computer Interaction, 17, 1(2002), 1--61.  ",
      "doi": "10.1207/S15327051HCI1701_2"
    },
    {
      "text": "Mintzberg, H. The Nature of Managerial Work. Prentice Hall, Englewood Cliffs, N.J, USA, 1973.",
      "doi": ""
    },
    {
      "text": "Miyata Y.,&amp;Norman D. Psychological issues in support of multiple activities, In: User Centered Systems Design: New Perspectives on Human-Computer Interaction, Hillsdale: Lawrence Erlbaum Associates, (1986) 265--284.",
      "doi": ""
    },
    {
      "text": "O'Conaill B.,&amp;Frohlich D. Timespace in the workplace: Dealing with interruptions, In Ext. Abstracts CHI 1995, ACM Press (1995), 262--263.  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Paschler, H., Johnston, J.C.,&amp;Ruthruff, E. Attention and Performance, Annual Review of Psychology, 52 (2001), 629--651.",
      "doi": ""
    },
    {
      "text": "Payne S. J., Duggan G. B.,&amp;Neth H. Discretionary task interleaving: Heuristics for time allocation in cognitive foraging, Journal of Experimental Psychology: General, 136, 3 (2007), 370--388.",
      "doi": ""
    },
    {
      "text": "Perlow L. The time famine: Toward a sociology of work time, Administrative Science Quarterly, 44, 1 (1999), 57--81.",
      "doi": ""
    },
    {
      "text": "Rattenbury, T.,&amp;Canny, J.CAAD: An automatic task support system. In Proc. CHI 2007, ACM Press (2007), 687--696.  ",
      "doi": "10.1145/1240624.1240731"
    },
    {
      "text": "Reder, S.,&amp;Schwab, R.G. The temporal structure of cooperative activity. In Proc. CSCW 1990, ACM Press (1990), 303--316.  ",
      "doi": "10.1145/99332.99363"
    },
    {
      "text": "Robertson, G., van Dantzich, M., Robbins, D., Czerwinski, M., Hinckley, K., Risden, K., Thiel, D.,&amp;Gorokhovsky, V. The Task Gallery: A 3D window manager. In Proc. CHI 2000, ACM Press (2000), 494--501.  ",
      "doi": "10.1145/332040.332482"
    },
    {
      "text": "Shrout P. E.,&amp;Fleiss J. L. Intraclass Correlations: Uses in Assessing Rater Reliability, Psychological Bulletin, 86, 2 (1979), 420--428.",
      "doi": ""
    },
    {
      "text": "Sproull L. S. The nature of managerial attention, Advances in Information Processing in Organizations, 1 (1984), 9--27.",
      "doi": ""
    },
    {
      "text": "Strauss, A.,&amp;Corbin, J. Basics of Qualitative Research: Techniques and Processes for Developing Grounded Theory. Sage Publications, Thousand Oaks, CA, USA, 1998.",
      "doi": ""
    }
  ]
}