{
  "doi": "10.1145/1518701.1518833",
  "title": "VIGO: instrumental interaction in multi-surface environments",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "869-878",
  "year": 2009,
  "badges": [],
  "abstract": "This paper addresses interaction in multi-surface environments and questions whether the current application-centric approaches to user interfaces are adequate in this context, and presents an alternative approach based on instrumental interaction. The paper presents the VIGO (Views, Instruments, Governors and Objects) architecture and describes a prototype implementation. It then illustrates how to apply VIGO to support distributed interaction. Finally, it demonstrates how a classical Ubicomp interaction technique, Pick-and-Drop, can be easily implemented using VIGO.",
  "tags": [
    "ui architecture",
    "ubiquitous computing",
    "multi-surface interaction",
    "instrumental interaction",
    "interaction paradigm"
  ],
  "authors": [
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "University of Aarhus, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    },
    {
      "name": "Michel Beaudouin-Lafon",
      "institution": "LRI (Univ. Paris-Sud & CNRS), INRIA, Orsay, France",
      "img": "/do/10.1145/contrib-81100644686/rel-imgonly/mbl-120x120.jpg",
      "acmid": "81100644686",
      "orcid": "0000-0002-2905-9810"
    }
  ],
  "references": [
    {
      "text": "C. Appert and M. Beaudouin-Lafon. Swingstates: adding state machines to the swing toolkit. In Proc. ACM User Interface Software Technology (UIST'2006), 319--322, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1166253.1166302"
    },
    {
      "text": "R. Ballagas, M. Ringel, M. Stone, and J. Borchers. istuff: a physical user interface toolkit for ubiquitous computing environments. In Proc. ACM conference on Human factors in computing systems (CHI'03), 537--544, New York, NY, USA, 2003. ACM.  ",
      "doi": "10.1145/642611.642705"
    },
    {
      "text": "L. Balme, A. Demeure, N. Barralon, J. Coutaz, and G. Calvary. CAMELEON-RT: a software architecture reference model for distributed, migratable, and plastic user interfaces. In EUSAI 2004, LNCS 3295, 291--302, 2004.",
      "doi": ""
    },
    {
      "text": "M. Beaudouin-Lafon. Instrumental interaction: an interaction model for designing post-WIMP user interfaces. In Proc. ACM Conference on Human Factors in Computing Systems (CHI'2000), 446--453. ACM Press, 2000.  ",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "M. Beaudouin-Lafon and W. E. Mackay. Reification, polymorphism and reuse: three principles for designing visual interfaces. In Proc. ACM Conference on Advanced Visual Interfaces (AVI'2000), 102--109, New York, NY, USA, 2000. ACM.  ",
      "doi": "10.1145/345513.345267"
    },
    {
      "text": "O. Beaudoux and M. Beaudouin-Lafon. Dpi: A conceptual model based on documents and interaction instruments. In Proc. Computers XV Interaction without frontier (HCI 2001 and IHM 2001). Springer Verlag, 2001.",
      "doi": ""
    },
    {
      "text": "S. Bødker. Through the Interface. A Human Activity Approach to User Interface Design. Lawrence Erlbaum Associates, Inc., 1991. ",
      "doi": "10.5555/532624"
    },
    {
      "text": "C. Brodersen, S. Bødker, and C. N. Klokmose. Quality of learning in ubiquitous interaction. In Proc. European Conference on Cognitive Ergonomics (ECCE), 2007.  ",
      "doi": "10.1145/1362550.1362575"
    },
    {
      "text": "A. Demeure, J. Sottet, G. Calvary, J. Coutaz, V. Ganneau, and J. Vanderdonckt. The 4C reference model for distributed user interfaces. In Int. Conf. on Autonomic and Autonomous Systems, 61--69, 2008.  ",
      "doi": "10.1109/ICAS.2008.34"
    },
    {
      "text": "A. Fettig. Twisted Network Programming Essentials. O'Reilly Media, Inc., 2005. ",
      "doi": "10.5555/1205685"
    },
    {
      "text": "E. Gamma, R. Helm, R. Johnson, and J. Vlissides. Design Patterns: Elements of Reuseable Object-Oriented Software. Addison-Wesley, 1994. ",
      "doi": "10.5555/186897"
    },
    {
      "text": "T. C. N. Graham, T. Urnes, and R. Nejabi. Efficient distributed implementation of semi-replicated synchronous groupware. In Proc. ACM symposium on User interface software and technology (UIST'1998), 1--10, New York, NY, USA, 1996. ACM.  ",
      "doi": "10.1145/237091.237092"
    },
    {
      "text": "R. D. Hill. The abstraction-link-view paradigm: using constraints to connect user interfaces to applications. In Proc. ACM Human factors in computing systems (CHI'92), 335--342, New York, NY, USA, 1992. ACM.  ",
      "doi": "10.1145/142750.142828"
    },
    {
      "text": "I. Illich. Tools for Conviviality. Fontana/Collins, 1973.",
      "doi": ""
    },
    {
      "text": "G. E. Krasner and S. T. Pope. A cookbook for using the model-view controller user interface paradigm in smalltalk-80. J. Object Oriented Program., 1(3):26--49, 1988. ",
      "doi": "10.5555/50757.50759"
    },
    {
      "text": "Merriam-Webster. Dictionary and Thesaurus. 2008. http://www.merriam-webster.com/.",
      "doi": ""
    },
    {
      "text": "M. Modahl, B. Agarwalla, G. Abowd, U. Ramachandran, and T. S. Saponas. Toward a standard ubiquitous computing framework. In Proc. ACM Workshop on Middleware for pervasive and ad-hoc computing (MPAC'2004), 135--139, New York, NY, USA, 2004. ACM.  ",
      "doi": "10.1145/1028509.1028515"
    },
    {
      "text": "G. Mori, F. Paternò, and C. Santoro. Design and development of multidevice user interfaces through multiple logical descriptions. IEEE Trans. on Soft. Eng., 30(8):507--520, 2004.  ",
      "doi": "10.1109/TSE.2004.40"
    },
    {
      "text": "B. A. Myers. Separating application code from toolkits: eliminating the spaghetti of call-backs. In Proc. ACM Symposium on User interface software and technology (UIST'1991), 211--220, New York, NY, USA, 1991. ACM.  ",
      "doi": "10.1145/120782.120805"
    },
    {
      "text": "B. A. Myers, J. Nichols, J. O.Wobbrock, and R. C. Miller. Taking handheld devices to the next level. Computer, 37(12):36--43, 2004.  ",
      "doi": "10.1109/MC.2004.258"
    },
    {
      "text": "M. W. Newman, S. Izadi, W. K. Edwards, J. Z. Sedivy, and T. F. Smith. User interfaces when and where they are needed: an infrastructure for recombinant computing. In Proc. ACM symposium on User interface software and technology (UIST'2002), 171--180, New York, NY, USA, 2002. ACM.  ",
      "doi": "10.1145/571985.572009"
    },
    {
      "text": "D. R. Olsen. Evaluating user interface systems research. In Proc. ACM Symposium on User interface software and technology (UIST'2007), 251--258, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "D. R. Olsen, S. Jefferies, T. Nielsen, W. Moyes, and P. Fredrickson. Cross-modal interaction using xweb. In Proc. ACM Symposium on User interface software and technology (UIST'2000), 191--200, New York, NY, USA, 2000. ACM.  ",
      "doi": "10.1145/354401.354764"
    },
    {
      "text": "T. Reenskaug. Models - views - controllers. Technical report, Xerox Parc, 1979.",
      "doi": ""
    },
    {
      "text": "J. Rekimoto. Pick-and-drop: A direct manipulation technique for multiple computer environments. In Proc. ACM Symposium on User Interface Software and Technology (UIST'97), 31--39, 1997.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "J. Rekimoto. A multiple device approach for supporting whiteboard-based interactions. In Proceedings of the 1998 ACM Conference on Human Factors in Computing Systems (CHI'98), 1998.  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "P. Tandler. Software infrastructure for ubiquitous computing environments: Supporting synchronous collaboration with heterogeneous devices. In Proc. International conference on Ubiquitous Computing (Ubi-Comp'2001), 96--115, London, UK, 2001. Springer-Verlag. ",
      "doi": "10.5555/647987.741322"
    },
    {
      "text": "M. Weiser. The computer for the 21st century. Scientific American, 265(3):66--75, Feb. 1991.",
      "doi": ""
    }
  ]
}