{
  "doi": "10.1145/1518701.1518795",
  "title": "An elementary social information foraging model",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "605-614",
  "year": 2009,
  "badges": [],
  "abstract": "User interfaces and information systems have become increasingly social in recent years, aimed at supporting the decentralized, cooperative production and use of content. A theory that predicts the impact of interface and interaction designs on such factors as participation rates and knowledge discovery is likely to be useful. This paper reviews a variety of observed phenomena in social information foraging and sketches a framework extending Information Foraging Theory towards making predictions about the effects of diversity, interference, and cost-of-effort on performance time, participation rates, and utility of discoveries.",
  "tags": [
    "social information foraging theory"
  ],
  "authors": [
    {
      "name": "Peter Pirolli",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100252735",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benkler, Y. The wealth of networks: How social production transforms markets and freedom. Yale University Press, New Haven, CT, 2005. ",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Bourdieu, P. The forms of capital. in Richardson, J.G. ed. Handbook of theory and research in the sociology of education, Greenwald Press, New York, 1986.",
      "doi": ""
    },
    {
      "text": "Budiu, R., Pirolli, P. and Hong, L., Remembrance of things tagged: How tagging effort affects tag production and human memory. in CHI 2009 Conference on Human Factors in Computing Systems, (Boston, MA, 2009), ACM.  ",
      "doi": "10.1145/1518701.1518796"
    },
    {
      "text": "Burt, R.S. Structural holes and good ideas. American Journal of Sociology, 110 (2). 349--399.",
      "doi": ""
    },
    {
      "text": "Bush, V. As we may think. Atlantic Monthly, 176. 101--108.",
      "doi": ""
    },
    {
      "text": "Charnov, E.L. Optimal foraging: The marginal value theorem. Theoretical Population Biology, 9. 129--136.",
      "doi": ""
    },
    {
      "text": "Chi, E.H. and Mytkowicz, T. Understanding the efficiency of social tagging systems using information theory Proceedings of the nineteenth ACM conference on Hypertext and hypermedia, ACM, Pittsburgh, PA, USA, 2008.  ",
      "doi": "10.1145/1379092.1379110"
    },
    {
      "text": "Clark, C.W. and Mangel, M. Foraging and flocking strategies: Information in an uncertain environment. American Naturalist, 123 (5). 626--641.",
      "doi": ""
    },
    {
      "text": "Clark, C.W. and Mangel, M. The evolutionary advantages of group foraging. Theoretical Population Biology, 30 (1). 45--75.",
      "doi": ""
    },
    {
      "text": "Clearwater, S.H., Hogg, T. and Huberman, B.A. Cooperative problem solving. in Huberman, B.A. ed. Computation: The micro and macro view, World Scientific, Singapore, 1992, 33--70.",
      "doi": ""
    },
    {
      "text": "Clearwater, S.H., Huberman, B.A. and Hogg, T. Cooperative solution of constraint satisfaction problems. Science, 254. 1181--1181.",
      "doi": ""
    },
    {
      "text": "Cummings, J.N. Work groups, structural diversity, and knowledge sharing in a global organization. Management Science, 50 (3). 352--364.  ",
      "doi": "10.1287/mnsc.1030.0134"
    },
    {
      "text": "Ellis, D. A behavioral approach to information retrieval system design. Journal of Documentation, 45. 171--212.  ",
      "doi": "10.1108/eb026843"
    },
    {
      "text": "Giraldeau, L.-A. and Caraco, T. Social foraging theory. Princeton University Press, Princeton, NJ, 2000.",
      "doi": ""
    },
    {
      "text": "Glance, N.S. and Huberman, B.A. Dynamics of social dilemmas Scientific American, 1994, 58--63.",
      "doi": ""
    },
    {
      "text": "Hassell, M. and Varley, G. New inductive population model for insect parasites and its bearing on biological control. Nature, 223. 1133--1136.",
      "doi": ""
    },
    {
      "text": "Huberman, B.A. The performance of cooperative processes. Physica D, 42. 38--47.  ",
      "doi": "10.1016/0167-2789%2890%2990065-W"
    },
    {
      "text": "Huberman, B.A. and Adamic, L.A. Information dynamics in a networked world. in Ben-Naim, E., Frauenfelder, H. and Toroczkai, Z. eds. Complex networks, Springer-Verlag, Berlin, 2004.",
      "doi": ""
    },
    {
      "text": "Huberman, B.A. and Hogg, T. Communities of practice, performance and evolution. Computational and Mathematical Organizational Theory, 1. 73--92.  ",
      "doi": "10.1007/BF01307829"
    },
    {
      "text": "Kittur, A., Suh, B., Pendleton, B.A. and Chi, E.H. He says, she says: conflict and coordination in Wikipedia Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, San Jose, California, USA, 2007.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "May, R.M. Uses and abuses of mathematics in biology. Science, 303. 790--793.",
      "doi": ""
    },
    {
      "text": "Newell, A. The knowledge level. Artificial Intelligence, 18. 87--127.",
      "doi": ""
    },
    {
      "text": "Pirolli, P. Information foraging: A theory of adaptive interaction with information. Oxford University Press, New York, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Pirolli, P. and Card, S.K. Information foraging. Psychological Review, 106. 643--675.",
      "doi": ""
    },
    {
      "text": "Putnam, R. Bowling alone: The collapse and revival of american community. Simon and Schuster, New York, 2000.",
      "doi": ""
    },
    {
      "text": "Sandstrom, P.E. Scholarly communication as a socioecological system. Scientometrics, 51 (3). 573--605.",
      "doi": ""
    },
    {
      "text": "Seth, A.K. Modeling group foraging: Individual suboptimaliy, interference, and a kind of matching. Adaptive Behavior, 9 (2). 67--90.  ",
      "doi": "10.1177/105971230200900204"
    },
    {
      "text": "Stephens, D.W. and Krebs, J.R. Foraging theory. Princeton University Press, Princeton, NJ, 1986.",
      "doi": ""
    },
    {
      "text": "Swanson, D.R. Fish oil, Raynoud's Syndrome, and undiscovered public knowledge. Perspectives in Biology and Medicine, 20 (1). 7--19.",
      "doi": ""
    },
    {
      "text": "Swanson, D.R. Undiscovered public knowledge. The Library Quarterly, 56 (2). 103--118.",
      "doi": ""
    },
    {
      "text": "Wilson, P. Unused relevant information in research and development. Journal of the American Society for Information Science, 45 (2). 192--203.",
      "doi": ""
    }
  ]
}