{
  "doi": "10.1145/1518701.1518783",
  "title": "In CMC we trust: the role of similarity",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "527-536",
  "year": 2009,
  "badges": [],
  "abstract": "This paper examines how different forms of linguistic similarity in a text-chat environment relate to the establishment of interpersonal trust. Sixty-two pairs played an iterative social dilemma investment game and periodically communicated via Instant Messenger (IM). Novel automated and manual analysis techniques identify linguistic similarity at content, structural and stylistic levels. Results reveal that certain types of content (some positive emotion words, task-related words), structural (verb tense, phrasal entrainment), and stylistic (emoticons) similarity characterize high trusting pairs while other types of similarity (e.g., negative emotion words) characterize low trusting pairs. Contrary to previous literature, this suggests that not all similarity is good similarity.",
  "authors": [
    {
      "name": "Lauren E. Scissors",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416598096",
      "orcid": "missing"
    },
    {
      "name": "Alastair J. Gill",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384619623",
      "orcid": "missing"
    },
    {
      "name": "Kathleen Geraghty",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416609336",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    }
  ],
  "references": [
    {
      "text": "van Baaren, R.B., Holland, R.W., Steenaert, B.&amp;van Knippenberg, A. (2003). Mimicry for money: Behavioral consequences of imitation. Journal of Experimental Social Psychology, 39, 393--398.",
      "doi": ""
    },
    {
      "text": "Bos, N., Olson, J.S., Gergle, D., Olson, G.M.,&amp;Wright, Z. (2002). Effects of four computer-mediated communications channels on trust development. In Proceedings of CHI 2002, 135--140.  ",
      "doi": "10.1145/503376.503401"
    },
    {
      "text": "Bradac, J. (1990). Language attitudes and impression formation. In Giles, H. and Robinson, W. (Eds.), Handbook of Language and Social Psychology, 387--412. Wiley, Chichester.",
      "doi": ""
    },
    {
      "text": "Brennan, S. E.&amp;Clark, H. H. (1996). Conceptual pacts and lexical choice in conversation. Journal of Experimental Psychology: Learning, Memory, and Cognition, 22, 1482--1493.",
      "doi": ""
    },
    {
      "text": "Chartrand, T.L.,&amp;Bargh, J.A. (1999). The chameleon effect: The perception behavior link and social interaction. Journal of Personality and Social Psychology, 76, 893--910.",
      "doi": ""
    },
    {
      "text": "Curhan, J.R.&amp;Pentland, A. (2007). Thin slices of negotiation: Predicting outcomes from conversational dynamics within the first 5 minutes. Journal of Applied Psychology, 92(3), 802--811.",
      "doi": ""
    },
    {
      "text": "Dawes, R.M. (1980). Social dilemmas. Annual Reviews in Psychology, 31, 169--93.",
      "doi": ""
    },
    {
      "text": "Dunn, J.R.&amp;Schweitzer, M.E. (2005). Feeling and believing: The influence of emotion on trust. Journal of Personality and Social Psychology, 88(5), 736--748.",
      "doi": ""
    },
    {
      "text": "Giles, H., Coupland, J.,&amp;Coupland, N. (1991). Accommodation theory: Communication, context, and consequence. In H. Giles, J. Coupland&amp;N. Coupland (Eds.), Contexts of Accommodation. Developments in Applied Sociolinguistics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Gill, A.J., Gergle, D., French, R.M.,&amp;Oberlander, J. (2008). Emotion rating from short blog texts. In Proceedings of CHI 2008, 1121--1124.  ",
      "doi": "10.1145/1357054.1357229"
    },
    {
      "text": "Grice, H.P. (1975). Logic and conversation. In Cole, P.&amp;Morgan, J. (Eds.) Syntax and semantics, Vol. 3. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Jarvenpaa, S., Knoll, K.,&amp;Leidner, D. (1998). Is anybody out there? Antecedents of trust in global virtual teams. Journal of Management Information Systems, 14(4), 29--64. ",
      "doi": "10.1080/07421222.1998.11518185"
    },
    {
      "text": "Labov, W. (1972). Sociolinguistic Patterns. University of Pennsylvania Press, Philadelphia.",
      "doi": ""
    },
    {
      "text": "Lenhart, A., Arafeh, S., Smith, A.&amp;Rankin-Macgill, A. (2008). Writing, technology and teens, Pew Internet&amp;American Life Project, April 24, 2008, http://www.pewinternet.org.",
      "doi": ""
    },
    {
      "text": "Maddux, W.W., Mullen, E.,&amp;Galinsky, A.D. (2008). Chameleons bake bigger pies and take bigger pieces: Strategic behavioral mimicry facilitates negotiation outcomes. Journal of Experimental Social Psychology, 44, 461--468.",
      "doi": ""
    },
    {
      "text": "Mehl, M.R.,&amp;Pennebaker, J.W. (2003). The sounds of social life: A psychometric analysis of students' daily social environments and natural conversations. Journal of Personality and Social Psychology, 84(4), 857--870.",
      "doi": ""
    },
    {
      "text": "Nguyen, D.T.,&amp;Canny, J. (2007). Multiview: Improving trust in group video conferencing through spatial faithfulness. In Proc. of CHI 2007, 1465--1474.  ",
      "doi": "10.1145/1240624.1240846"
    },
    {
      "text": "Niederhoffer, K.,&amp;Pennebaker, J.W. (2002). Linguistic style matching in social interaction. Journal of Language&amp;Social Psychology, 21(4), 337--360.",
      "doi": ""
    },
    {
      "text": "Orbell, J.M., van de Kragt, A.J.,&amp;Dawes, R.M. (1991). Covenants without the sword: The role of promises in social dilemma circumstances. In Koford, K.J.&amp;Miller, J.B. Social Norms and Economic Institutions, University of Michigan Press.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J.W. and Francis, M. (1999). Linguistic Inquiry and Word Count (LIWC). Lawrence Erlbaum Associates, Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Quan-Haase, A., Cothrel, J., and Wellman, B. (2005). Instant messaging for collaboration: A case study of a high-tech firm. Journal of Computer-Mediated Communication, 10(4), article 13.",
      "doi": ""
    },
    {
      "text": "Rayson, P. (2003). Matrix: A statistical method and software tool for linguistic analysis through corpus comparison. Unpublished doctoral dissertation, Lancaster University, UK.",
      "doi": ""
    },
    {
      "text": "Riegelsberger, J., Sasse, A.M.,&amp;McCarthy, J.D. (2003). The researcher's dilemma: Evaluating trust in computer-mediated communication. International Journal of Human-Computer Studies, 58(6), 759--781.  ",
      "doi": "10.1016/S1071-5819%2803%2900042-9"
    },
    {
      "text": "Rogers, W.H. (1993). Regression standard errors in clustered samples. Stata Technical Bulletin, 13, 19--23.",
      "doi": ""
    },
    {
      "text": "Rousseau, D.M., Sitkin, S.B., Burt, R.S.,&amp;Camerer, C. (1998). Not so different after all: A cross-discipline view of trust. Academy of Mgmt. Review, 23, 393--404.",
      "doi": ""
    },
    {
      "text": "Scissors, L.E., Gill, A.J,&amp;Gergle, D. (2008). Linguistic mimicry and trust in text-based CMC. In Proceedings of CSCW 2008, 277--280.  ",
      "doi": "10.1145/1460563.1460608"
    },
    {
      "text": "Taylor, P. J.,&amp;Thomas, S. (2008). Linguistic style matching and negotiation outcome. Negotiation and Conflict Management Research, 1, 263--281.",
      "doi": ""
    },
    {
      "text": "Tickle-Degnen, L.,&amp;Rosenthal, R. (1990). The nature of rapport and its nonverbal correlates. Psychological Inquiry, 1, 285--293.",
      "doi": ""
    },
    {
      "text": "Walther, J.B.&amp;Parks, M.R. (2002). Cues filtered out, cues filtered in: Computer-mediated communication and relationships. In M.L. Knapp&amp;J.A. Daly (Eds.), Handbook of Interpersonal Communication (3rd edition), 529--563. Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Willemyns, M., Gallois, C.,&amp;Callan, V.J. (2003). Trust me, I'm your boss: Trust and power in supervisor supervisee communication. International Journal of Human Resource Management, 14(1), 117--127.",
      "doi": ""
    },
    {
      "text": "Wilson, J., Straus, S.,&amp;McEvily, B. (2006). All in due time: The development of trust in computer-mediated and face-to-face teams. Organization Behavior and Human Decision Processes, 99(1), 16--33.",
      "doi": ""
    },
    {
      "text": "Zheng, J., Veinott, E., Bos, N., Olson, J.S., Olson, G.M., 2002. Trust without touch: Jumpstarting long-distance trust with initial social activities. In Proceedings of CHI 2002, 141--146.  ",
      "doi": "10.1145/503376.503402"
    }
  ]
}