{
  "doi": "10.1145/1518701.1519030",
  "title": "A mischief of mice: examining children's performance in single display groupware systems with 1 to 32 mice",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2157-2166",
  "year": 2009,
  "badges": [],
  "abstract": "Mischief is a system for classroom interaction that allows multiple children to use individual mice and cursors to interact with a single large display [20]. While the system can support large groups of children, it is unclear how children's performance is affected as group size increases. We explore this question via a study involving two tasks, with children working in group sizes ranging from 1 to 32. The first required reciprocal selection of two on-screen targets, resembling a swarm pointing scenario that might be used in educational applications. The second, a more temporally and spatially distributed pointing task, had children entering different words by selecting characters on an on-screen keyboard. Results indicate that performance is significantly affected by group size only when targets are small. Further, group size had a smaller effect when pointing was spatially and temporally distributed than when everyone was concurrently aiming at the same targets.",
  "authors": [
    {
      "name": "Neema Moraveji",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100082877/rel-imgonly/23798_10150163806235134_889065133_11833318_3583492_n.jpg",
      "acmid": "81100082877",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Ed Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Card, S.K., Moran, T.P.,&amp;Newell, A. (1983). The psychology of human-computer interaction. Hillsdale, New Jersey: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Crook, C. (1992). Young children's skill in using a mouse to control a graphical computer interface. Computers and Education, 19(3). p. 199 -- 207.  ",
      "doi": "10.1016/0360-1315%2892%2990113-J"
    },
    {
      "text": "Druin, A., Stewart, J., Proft, D., Bederson, B.,&amp;Hollan, J. (1997). KidPad: a design collaboration between children, technologists, and educators. ACM CHI Conference. p. 463--470.  ",
      "doi": "10.1145/258549.258866"
    },
    {
      "text": "Fittts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. J. of Exp. Psychology, 47. p. 381--391.",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Gutwin, C.,&amp;Roseman, M. (1996). Semantic telepointers for groupware. Australian Conference on Computer-Human Interaction (OZCHI). p. 54. ",
      "doi": "10.5555/548200.883204"
    },
    {
      "text": "Gutwin, C.,&amp;Greenberg, S. (1999). The effects of workspace awareness support on the usability of real-time distributed groupware. ACM Transactions on Computer Human Interaction, 6(3). p. 243--281.  ",
      "doi": "10.1145/329693.329696"
    },
    {
      "text": "Hourcade, J.P., Bederson, B.,&amp;Druin, A. (2004). Preschool children's use of mouse buttons. Extended Abstracts of the ACM CHI Conference. p. 1411--1412.  ",
      "doi": "10.1145/985921.986077"
    },
    {
      "text": "Hourcade, J.P., Bederson, B., Druin, A.,&amp;Guimbretiere, F. (2004). Differences in pointing task performance between preschool children and adults using mice. ACM Transactions on Computer Human Interaction, 11(4). p. 357--386.  ",
      "doi": "10.1145/1035575.1035577"
    },
    {
      "text": "Hourcade, J.P. (2006). Learning from preschool children's pointing sub-movements. ACM Conference on Interaction Design and Children (IDC). p. 65--72.  ",
      "doi": "10.1145/1139073.1139093"
    },
    {
      "text": "Inkpen K., Booth K.S., Gribble S.D.,&amp;Klawe M. (1995). Give and take: Children collaborating on one computer. ACM CHI Conference. p. 258--259.  ",
      "doi": "10.1145/223355.223663"
    },
    {
      "text": "Inkpen, K., Ho-Ching, W., Kuederle, O., Scott, S.D.,&amp;Shoemaker, G. (1999). This is fun! We're all best friends and we're all playing: Supporting children's synchronous collaboration. ACM Conference on Computer Support for Collaborative Learning (CSCL). Article No. 31. 12 pages. ",
      "doi": "10.5555/1150240.1150271"
    },
    {
      "text": "Inkpen, K. (2001). Drag-and-drop versus point-and-click mouse interaction styles for children. ACM Trans. on Computer Human Interaction, 8(1). p. 1--33.  ",
      "doi": "10.1145/371127.371146"
    },
    {
      "text": "Izadi, S., Brignull, H., Rodden, T., Rogers, Y.,&amp;Underwood, M. (2003). Dynamo: a public interactive surface supporting the cooperative sharing and exchange of media. ACM Symposium on User Interface Software and Technology (UIST). p. 159--168.  ",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Joiner, R., Messer, D., Light, P.&amp;Littleton, K. (1998). It is best to point for young children: A comparison of children's pointing and dragging. Computers in Human Behavior, 14(3). p. 513--529.",
      "doi": ""
    },
    {
      "text": "Jones, T. (1991). An empirical study of children's use of computer pointing devices. Journal of Educational Computing Research, 7(1). p. 61--76.",
      "doi": ""
    },
    {
      "text": "King, J.&amp;Alloway, N. (1993). Young children's use of microcomputer input devices. Computers in the Schools, 9. p. 39--53.",
      "doi": ""
    },
    {
      "text": "Kucera, H&amp;Francis, W.N. (1967). Computational Analysis of Present-Day American English. Providence: Brown University Press.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. (1992). Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7. p. 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "McGuffin, M.,&amp;Balakrishnan, R. (2005). Fitts' law and expanding targets: Experimental studies and designs for user interfaces. ACM Transactions on Computer-Human Interaction, 12(4). p. 388--422.  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "Moraveji, N., Kim, T., Ge, J., Pawar, U.S., Mulcahy, K.,&amp;Inkpen, K. (2008). Mischief: supporting remote teaching in developing regions. ACM CHI Conference.  ",
      "doi": "10.1145/1357054.1357114"
    },
    {
      "text": "Pawar, U.S., Pal, J., Gupta, R.,&amp;Toyama, K. (2007). Multiple mice for retention tasks in disadvantaged schools. ACM CHI Conference. p. 1581--1590.  ",
      "doi": "10.1145/1240624.1240864"
    },
    {
      "text": "Russell, D.M., Drew, C.,&amp;Sue, A. (2002). Social aspects of using large public interactive displays for collaboration. International Conference on Ubiquitous Computing (UbiComp). p. 229--236. ",
      "doi": "10.5555/647988.741473"
    },
    {
      "text": "Ryall, K., Forlines, C., Shen, C.,&amp;Morris, M. (2004). Exploring the effects of group size and table size on interactions with tabletop shared-display groupware. ACM Conference on Computer Supported Cooperative Work (CSCW). p. 284--293.  ",
      "doi": "10.1145/1031607.1031654"
    },
    {
      "text": "Salmoni, A. W.&amp;McIlwain, J. S. (1979). Fitts' reciprocal tapping task: A measure of motor capacity? Perceptual and Motor Skills, 49. p. 403--413.",
      "doi": ""
    },
    {
      "text": "Scott, S., Grant, K.,&amp;Mandryk, R. (2003). System guidelines for co-located, collaborative work on a tabletop display. European Conference on Computer Supported Cooperative Work (ECSCW). p. 159--178. ",
      "doi": "10.5555/1241889.1241898"
    },
    {
      "text": "Stanton, D.,&amp;Neale H.R. (2003). The effects of multiple mice on children's talk and interaction. Journal of Computer Assisted Learning, 19(2). p. 220--228.",
      "doi": ""
    },
    {
      "text": "Sugden, D. A. (1980). Movement speed in children. Journal of Motor Behavior, 12. p. 125--132.",
      "doi": ""
    },
    {
      "text": "Stewart, J., Bederson, B. B.,&amp;Druin, A. (1999). Single display groupware: a model for co-present collaboration. ACM CHI Conference. p. 286--293.  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Wallace, S. A., Newell, K. M.&amp;Wade, M. G. (1978). Decision and response times as a function of movement difficulty in preschool children. Child Development, 49.",
      "doi": ""
    }
  ]
}