{
  "doi": "10.1145/1518701.1518963",
  "title": "Knocking on elders' door: investigating the functional and emotional geography of their domestic space",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1703-1712",
  "year": 2009,
  "badges": [],
  "abstract": "The domestic environment is more than a place where to live. It is a territory of meaning, a place where pleasure, affect and aesthetics are deeply interwoven with the functional and utilitarian dimensions. With the aging process, the home is progressively invested with new meanings and functions, and becomes the emotional center of older people's life. This paper presents a user study based on cultural probes on how domestic spaces are managed and perceived by older adults, uncovering some of the complex interrelations among the daily activities, objects and meanings revolving around the home. The findings provide suggestions on how the dimensions of remembrance, perception of safety and environmental stability may affect the design of domestic technology for elderly people.",
  "authors": [
    {
      "name": "Chiara Leonardi",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/do/10.1145/contrib-81416595568/rel-imgonly/81416595568.jpg",
      "acmid": "81416595568",
      "orcid": "missing"
    },
    {
      "name": "Claudio Mennecozzi",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418595264",
      "orcid": "missing"
    },
    {
      "name": "Elena Not",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100196401",
      "orcid": "missing"
    },
    {
      "name": "Fabio Pianesi",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424906",
      "orcid": "missing"
    },
    {
      "name": "Massimo Zancanaro",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/do/10.1145/contrib-81100153077/rel-imgonly/mz-s.jpg",
      "acmid": "81100153077",
      "orcid": "missing"
    },
    {
      "name": "Francesca Gennai",
      "institution": "Istituto Regionale di Studi e Ricerca Sociale, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100008096",
      "orcid": "missing"
    },
    {
      "name": "Antonio Cristoforetti",
      "institution": "Istituto Regionale di Studi e Ricerca Sociale, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608978",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. D., Atkeson C., Bobick A., Essa I., MacIntyre B., Mynatt E., Starner T. Living laboratories: The future computing environments group at the Georgia institute of technology. Ext. Abstracts CHI 2000, ACM Press (2000).  ",
      "doi": "10.1145/633292.633416"
    },
    {
      "text": "Alwan, M. Leachtenauer, J. Dalal, S. Mack, D. Kell, Turner, S., B. Felder, R. Psychosocial Impact of Monitoring Technology in Assisted Living: A Pilot Study. Information and Communication Technologies ICTTA'06, 2006.",
      "doi": ""
    },
    {
      "text": "Aipperspach, R., Hooker, B., and Woodruff, A. FEATURE The heterogeneous home. Interactions 16, 1 (Jan. 2009), 35--38.  ",
      "doi": "10.1145/1456202.1456211"
    },
    {
      "text": "Bell, G., Blythe, M., Gaver, B., Sengers, P., Wright, P. Designing culturally situated technologies for the home, Ext. Abstracts CHI 2003, ACM Press (2003).  ",
      "doi": "10.1145/765891.766149"
    },
    {
      "text": "Blythe M., Monk, A. Notes towards ethnography of domestic technology. Proc. Symposium on Designing Interactive Systems. ACM Press (2005).  ",
      "doi": "10.1145/778712.778750"
    },
    {
      "text": "Boehner, K., Vertesi, J., Sengers, P., Dourish, P. How HCI Interprets the Probes. Proc. CHI'07, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Csikszentmihalyi M., Rochberg-Halton E. The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press, 1981",
      "doi": ""
    },
    {
      "text": "Ciolfi, L., Bartolucci, I., Murphy, D. Meaningful Interactions for Meaningful Places: Investigating the Relationships between Nomadic Work, Tangible Artefacts and the Physical environment. Proc. EACE'05, Conference on European Association of Cognitive Ergonomics. ",
      "doi": "10.5555/1124666.1124682"
    },
    {
      "text": "Crabtree, A., Hemmings, T., Rodden, T., Cheverst, K., Clarke, K., Dewsbury, G., Hughes, J., Rouncefield, M. (2006) Designing with Care: Adapting Cultural Probes to Inform Design in sensitive Settings. Proc. OZCHI2004 (2004) Brisbane: Ergonomics Society of Australia, 4--13.",
      "doi": ""
    },
    {
      "text": "Daley, B.J. Using Concept Maps in Qualitative Research. Proc. of the First Int. Conference on Concept Mapping. Eds. Pamplona, Spain 2004.",
      "doi": ""
    },
    {
      "text": "Demiris, G., Rantz, M., Aud, M., Marek, K., Tyrer, H, Skubic, M., Hassam, A. Older adults' attitudes towards and perceptions of 'smart home' technologies. Medical Informatics and the Internet in Medicine (2004), 29(2): 87--94.",
      "doi": ""
    },
    {
      "text": "Denzin, N. K., Lincoln, Y. The SAGE Handbook of Qualitative Research (eds), Handbook of Qualitative Research, Beverly Hills, CA, Sage.",
      "doi": ""
    },
    {
      "text": "Dickinson, A., Goodman, J., Syme, A., Eisma, R., Tiwari, L., Mival, O. and Newell A. Domesticating Technology: In-home requirements gathering with frail older people. Proc. of 10th International Conference on Human - Computer Interaction HCI (2003), 827--831",
      "doi": ""
    },
    {
      "text": "Eisma, R., Dickinson, A., Goodman, J., Syme, A., Tiwari, L. and Newell, A.F. Early user involvement in the development of information technology related products for older people. International Journal Universal Access in the Information Society, 3(2), 2004, 131--140  ",
      "doi": "10.1007/s10209-004-0092-z"
    },
    {
      "text": "Emiliani, P.L., Stephanidis, C. Universal access to ambient intelligence environments: Opportunities and challenges for people with disabilities. IBM Systems Journal, 44(3), 2005.  ",
      "doi": "10.1147/sj.443.0605"
    },
    {
      "text": "Forlizzi J., DiSalvo C., Gemperle, F. Assistive Robotics and an Ecology of Elders Living Independently in Their Homes, Human-Computer Interaction, 2004. 19(1):25--59  ",
      "doi": "10.1207/s15327051hci1901%25262_3"
    },
    {
      "text": "Gaver W., Hooker B. The Presence Project. CRD Publishing. 2001.",
      "doi": ""
    },
    {
      "text": "Gaver, W.W., Boucher, A., Pennington, S., Walker, B. Cultural Probes and the value of uncertainty. Interactions, Vol. 11, 5, 2004.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Giuliani, M.V., Scopelliti, M., Fornara, F. Elderly people at home: technological help in everyday activities. Proc. IEEE International Workshop on Robot and Human Interactive Communication, 2005. Roman, 2005. Volume, Issue, 13-15 Aug. 2005",
      "doi": ""
    },
    {
      "text": "Hindus D. The Importance of Homes in Technology Research. In N. Streitz, J. Siegel, V. Hartkopf, S. Konomi (Eds.), Cooperative Buildings - Integrating Information, Organizations, and Architecture. Proceedings of the. Second International Workshop on Cooperative Buildings (CoBuild'99), Pittsburgh, U.S.A., October 1-2, 1999. Lecture Notes in Computer Science 1670. Springer: Heidelberg. pp.199--207. ",
      "doi": "10.5555/645969.674876"
    },
    {
      "text": "Harrison, S. and Dourish, P. 1996. Re-Placeing Space: The Roles of Space and Place in Collaborative Systems. Proceedings of ACM Conference on Computer-Supported Cooperative Work CSCW'96 (Boston, MA), 67--76. New York: ACM.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hirsch, T., Forlizzi, J., Hyder, E., Goetz, J., Kurtz, C., and Stroback, J. 2000. The ELDer project: social, emotional, and environmental factors in the design of eldercare technologies. In Proceedings on the 2000 Conference on Universal Usability. Arlington, Virginia, 2000.  ",
      "doi": "10.1145/355460.355476"
    },
    {
      "text": "Imrie, R. Disability, Embodiment and the Meaning of the Home. Housing Studies, Vol. 19, No. 5 (2005) 745--763.",
      "doi": ""
    },
    {
      "text": "Jette, A.M. Disability trend and transactions. In Binstock R.H., George L.K., (eds.), Handbook of ageing and social science, 94 -- 116 (1996) San Diego, Academia Press.",
      "doi": ""
    },
    {
      "text": "Kamptner. N. A. Personal Possessions and Their Meaning in Old Age. The Social Psychology of Aging, Spacapan S., Oskamp S. (eds.). SAGE Publication, 1989",
      "doi": ""
    },
    {
      "text": "Kwasny, M., Caine, K., Rogers, W.A., Fisk A. Privacy and technology: folk definitions and perspectives. Ext. Abstracts CHI 2008. ACM Press (2008).  ",
      "doi": "10.1145/1358628.1358846"
    },
    {
      "text": "Leonardi C., Mennecozzi C., Not E., Pianesi F., and Zancanaro M. Getting Older People Involved in the Process of Ambient Assisted Living Research and Development. In Proceedings of the International Symposium of Gerontechnology ISG08. Siena, 2008.",
      "doi": ""
    },
    {
      "text": "McCreadie, C., Tinker, A. The acceptability of assistive technology to older people. Ageing&amp;Society 25, 2005, 91--110",
      "doi": ""
    },
    {
      "text": "Mynatt, E.D., Essa, I., Rogers, W. Increasing the Opportunities for Aging in Place. Proc. CUU'00, Arlington, USA.  ",
      "doi": "10.1145/355460.355475"
    },
    {
      "text": "O'Brien, J., Rodden, T., Rouncefield, M., Hughes J. At Home with Technology: An Ethnographic Study of a Set-Top-Box Trial. ACM Transactions on Computer-Human Interaction, Vol. 6, N. 3, Sept. 1999, pp. 282--308.  ",
      "doi": "10.1145/329693.329698"
    },
    {
      "text": "Osvald, F., Wahl, H.-W. Dimensions of the Meaning of Home in Later Life. In G.D. Rowles&amp;H. Chaudhry (Eds.), Home and Identity in Later Life: International Perspectives (pp. 21--45). New York: Springer (2005).",
      "doi": ""
    },
    {
      "text": "Rodden, T., Benford, S. The Evolution of Buildings for the design of ubiquitous domestic environments. Proc. CHI '03. ACM Press (2003).  ",
      "doi": "10.1145/642611.642615"
    },
    {
      "text": "Rowles, G., Chaudhury, H. (eds.) Home and Identity in late Life. NY, Springer Publishing Company (2005).",
      "doi": ""
    },
    {
      "text": "Swan, L., Taylor A.S. Notes on Fridge Surfaces. Ext. Abstracts CHI 2005. ACM Press (2005).  ",
      "doi": "10.1145/1056808.1057029"
    },
    {
      "text": "Vetere, F., Gibbs, M.r. Kjeldskov, J. Howard, S., Mueller, F., Pedell, S., Mecoles, K., Bunyan, M. Mediating intimacy: designing technologies to support strong-tie relationships. Proc. CHI 2005. ACM Press 2005  ",
      "doi": "10.1145/1054972.1055038"
    }
  ]
}