{
  "doi": "10.1145/1518701.1518909",
  "title": "Resonance on the web: web dynamics and revisitation patterns",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1381-1390",
  "year": 2009,
  "badges": [],
  "abstract": "The Web is a dynamic, ever-changing collection of information accessed in a dynamic way. This paper explores the relationship between Web page content change (obtained from an hourly crawl of over 40K pages) and people's revisitation to those pages (collected via a large scale log analysis of 2.3M users). We identify the relationship, or resonance, between revisitation behavior and the amount and type of changes on those pages. By coupling our large scale log analysis with a complementary user study we explore the intent behind the revisitation behavior we observed. Using the notion of resonance to identify the likely content of interest, we describe a number of ways interaction with changing and revisited information can be better supported. We illustrate how understanding the association between change and revisitation might improve browser, crawler, and search engine design, and present a specific example of how knowledge of both can enable relevant content to be highlighted.",
  "tags": [
    "resonance",
    "revisitation",
    "web behavior",
    "web log analysis",
    "change",
    "web page dynamics",
    "re-finding"
  ],
  "authors": [
    {
      "name": "Eytan Adar",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589033",
      "orcid": "missing"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Susan T. Dumais",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100134501/rel-imgonly/sdumais02.jpg",
      "acmid": "81100134501",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adar, E., J. Teevan, and S. T. Dumais. Large scale analysis of Web revisitation patterns. CHI '08, 2008.  ",
      "doi": "10.1145/1357054.1357241"
    },
    {
      "text": "Adar, E., J. Teevan, S. T. Dumais, and J. L. Elsas. The Web changes everything: Understanding the dynamics of Web content. WSDM '09, 2009.  ",
      "doi": "10.1145/1498759.1498837"
    },
    {
      "text": "Aula, A., N. Jhaveri, and M. Käki. Information search and re-access strategies of experienced Web users. WWW '05, 2005.  ",
      "doi": "10.1145/1060745.1060831"
    },
    {
      "text": "Ayers, E. and J. Stasko. Using graphic history in browsing the World Wide Web. WWW '95, 1995.",
      "doi": ""
    },
    {
      "text": "Catledge, L.D. and J.E. Pitkow. Characterizing browsing strategies in the World-Wide Web. WWW '95, 1995.  ",
      "doi": "10.1016/0169-7552%2895%2900043-7"
    },
    {
      "text": "ChangeDetect (2007). ChangeDetect Web Page Monitoring",
      "doi": ""
    },
    {
      "text": "Cho, J. and H. Garcia-Molina. The evolution of the Web and implications for an incremental crawler. VLDB '00, 2000. ",
      "doi": "10.5555/645926.671679"
    },
    {
      "text": "Cockburn, A. and B. McKenzie. What do Web users do? An empirical analysis of Web use. Int. J. of Human-Computer Studies, 54(6): 903--922, 2001.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "Douglis, F., A. Feldmann, and B. Krishnamurthy. Rate of change and other metrics: A live study of the World Wide Web. USENIX Symp. on Internet Tech. and Systems, 1997. ",
      "doi": "10.5555/1267279.1267293"
    },
    {
      "text": "Fetterly, D., M. Manasse, M. Najork, and Wiener, J. A large-scale study of the evolution of Web pages. WWW '03, 2003.  ",
      "doi": "10.1145/775152.775246"
    },
    {
      "text": "Friedman, J., T. Hastie, and R. Tibshirani, Additive logistic regression: A statistical view of boosting, Ann. Statist. 28(20):337--407, 2000.",
      "doi": ""
    },
    {
      "text": "Grandi, F., Introducing an annotated bibliography on temporal and evolution aspects in the World Wide Web, SIGMOD Records, 33(2):84--86, 2004.  ",
      "doi": "10.1145/1024694.1024709"
    },
    {
      "text": "Greenberg, S. and A. Cockburn. Getting back to back: Alternate behaviors for a Web browser's back button. 5th Annual Human Factors and the Web Conference, 1999.",
      "doi": ""
    },
    {
      "text": "Herder, E. Characterizations of user Web revisit behavior. Workshop on Adaptivity and User Modeling in Interactive Systems, 2005.",
      "doi": ""
    },
    {
      "text": "Jones, W., S. Dumais, and H. Bruce. Once found, what then?: A study of 'keeping' behaviors in the personal use of Web information. ASIST '02, 2002.",
      "doi": ""
    },
    {
      "text": "Kaasten, S. and S. Greenberg. Designing an integrated bookmark / history system for Web browsing. Western Computer Graphics Symposium, 2000.",
      "doi": ""
    },
    {
      "text": "Kellar, M., C. Watters, and K. M. Inkpen. An exploration of Web-based monitoring: Implications for design. CHI'07, 2007.  ",
      "doi": "10.1145/1240624.1240686"
    },
    {
      "text": "Kellar, M., C. Watters, and M. Shepherd. A goal-based classification of Web information tasks. ASIST '06, 2006.",
      "doi": ""
    },
    {
      "text": "Kim, J. K., and S. H. Lee. An empirical study of the change of Web pages. APWeb '05, 2005.  ",
      "doi": "10.1007/978-3-540-31849-1_62"
    },
    {
      "text": "Koehler, W. Web page change and persistence: A four-year longitudinal study. JASIST, 53(2):162--171, 2002.  ",
      "doi": "10.1002/asi.10018"
    },
    {
      "text": "Kwon, S. H., S. H. Lee, and S. J. Kim. Effective criteria for Web page changes. APWeb '06, 2006.  ",
      "doi": "10.1007/11610113_82"
    },
    {
      "text": "Milic-Frayling, N., R. Jones, K. Rodden, Smyth, G., Blackwell, A., and Sommerer, R. Smartback: Supporting users in back navigation. WWW '04, 2004.  ",
      "doi": "10.1145/988672.988682"
    },
    {
      "text": "Morrison, J. B., P. Pirolli, and S, K. Card. A taxonomic analysis of what World Wide Web activities significantly impact people's decisions and actions. CHI '01, 2001.  ",
      "doi": "10.1145/634067.634167"
    },
    {
      "text": "Nadamoto, A, and K. Tanaka. A comparative Web browser (CWB) for browsing and comparing Web pages. WWW '03, 2003.  ",
      "doi": "10.1145/775152.775254"
    },
    {
      "text": "Ntoulas, A., Cho, J., and Olston, C. What's new on the Web? The evolution of the Web from a search engine perspective. WWW '04, 2004.  ",
      "doi": "10.1145/988672.988674"
    },
    {
      "text": "Obendorf, Hartmut, H, Weinreich, E. Herder, and M. Mayer. Web page revisitation revisited: Implications of a long-term click-stream study of browser usage. CHI '07, 2007.  ",
      "doi": "10.1145/1240624.1240719"
    },
    {
      "text": "Pitkow, J. and Pirolli, P. Life, death, and lawfulness on the electronic frontier. CHI '97, 1997.  ",
      "doi": "10.1145/258549.258805"
    },
    {
      "text": "Sellen, A. J., R. Murphy, and K.L. Shaw. How knowledge workers use the Web. CHI '02, 2002.  ",
      "doi": "10.1145/503376.503418"
    },
    {
      "text": "Takano, H. and T. Winograd. Dynamic bookmarks for the WWW. Hypertext '98, 1998.  ",
      "doi": "10.1145/276627.276667"
    },
    {
      "text": "Tauscher, L. and S. Greenberg. How people revisit Web pages: Empirical findings and implications for the design of history systems. Int. J. of Human-Computer Studies, 47(1):97--137, 1997.  ",
      "doi": "10.1006/ijhc.1997.0125"
    },
    {
      "text": "Teevan, J., E. Adar, R. Jones, and M. A. Potts. Information re-retrieval: Repeat queries in Yahoo's logs. SIGIR '07, 2007.  ",
      "doi": "10.1145/1277741.1277770"
    },
    {
      "text": "White, R. W. and S. M. Drucker. Investigating behavioral variability in Web search. WWW '07, 2007.  ",
      "doi": "10.1145/1242572.1242576"
    }
  ]
}