{
  "doi": "10.1145/1518701.1518944",
  "title": "Two studies of opportunistic programming: interleaving web foraging, learning, and writing code",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1589-1598",
  "year": 2009,
  "badges": [],
  "abstract": "This paper investigates the role of online resources in problem solving. We look specifically at how programmers - an exemplar form of knowledge workers - opportunistically interleave Web foraging, learning, and writing code. We describe two studies of how programmers use online resources. The first, conducted in the lab, observed participants' Web use while building an online chat room. We found that programmers leverage online resources with a range of intentions: They engage in just-in-time learning of new skills and approaches, clarify and extend their existing knowledge, and remind themselves of details deemed not worth remembering. The results also suggest that queries for different purposes have different styles and durations. Do programmers' queries \"in the wild\" have the same range of intentions, or is this result an artifact of the particular lab setting? We analyzed a month of queries to an online programming portal, examining the lexical structure, refinements made, and result pages visited. Here we also saw traits that suggest the Web is being used for learning and reminding. These results contribute to a theory of online resource usage in programming, and suggest opportunities for tools to facilitate online knowledge work.",
  "authors": [
    {
      "name": "Joel Brandt",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81351596282/rel-imgonly/joel-brandt-adobe.jpg",
      "acmid": "81351596282",
      "orcid": "missing"
    },
    {
      "name": "Philip J. Guo",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488891",
      "orcid": "missing"
    },
    {
      "name": "Joel Lewenstein",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351604046",
      "orcid": "missing"
    },
    {
      "name": "Mira Dontcheva",
      "institution": "Adobe Systems, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654713",
      "orcid": "missing"
    },
    {
      "name": "Scott R. Klemmer",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adobe Flex Developer Center, 2008. http://www.adobe.com/devnet/flex/.",
      "doi": ""
    },
    {
      "text": "S. Bajracharya, T. Ngo, E. Linstead, Y. Dou, P. Rigor, P. Baldi, and C. Lopes. Sourcerer: A Search Engine for Open Source Code Supporting Structure-Based Search. In Companion to OOPSLA 2006: ACM Symposium on Object-oriented Programming Systems, Languages, and Applications, pages 681--682, Portland, Oregon, 2006.  ",
      "doi": "10.1145/1176617.1176671"
    },
    {
      "text": "I. D. Baxter, A. Yahin, L. Moura, M. Sant'Anna, and L. Bier. Clone Detection Using Abstract Syntax Trees. In Proceedings of ICSM 1998: IEEE International Conference on Software Maintenance, page 368, Washington, D.C., USA, 1998. ",
      "doi": "10.5555/850947.853341"
    },
    {
      "text": "J. Brandt, P. J. Guo, J. Lewenstein, and S. R. Klemmer. Opportunistic Programming: How Rapid Ideation and Prototyping Occur in Practice. In WEUSE 2008: International Workshop on End-User Software Engineering, pages 1--5, Leipzig, Germany, 2008.  ",
      "doi": "10.1145/1370847.1370848"
    },
    {
      "text": "S. Carter, J. Mankoff, S. R. Klemmer, and T. Matthews. Exiting the Cleanroom: On Ecological Validity and Ubiquitous Computing. Human-Computer Interaction, 23(1):47--99, 2008.",
      "doi": ""
    },
    {
      "text": "J. Chong and R. Siino. Interruptions on Software Teams: A Comparison of Paired and Solo Programmers. In Proceedings of CSCW 2006: ACM Conference on Computer Supported Cooperative Work, 2006.  ",
      "doi": "10.1145/1180875.1180882"
    },
    {
      "text": "C. W. Choo, B. Detlor, and D. Turnbull. Web Work: Information Seeking and Knowledge Work on the World Wide Web. Kluwer Academic Publishers, 2000. ",
      "doi": "10.5555/557100"
    },
    {
      "text": "S. Clarke. What is an End-User Software Engineer? In End-User Software Engineering Dagstuhl Seminar, Dagstuhl, Germany, 2007.",
      "doi": ""
    },
    {
      "text": "A. L. Cox and R. M. Young. Device-Oriented and Task-Oriented Exploratory Learning of Interactive Devices. Proceedings of ICCM 2000: International Conference on Cognitive Modeling, pages 70--77, 2000.",
      "doi": ""
    },
    {
      "text": "S. Ducasse, M. Rieger, and S. Demeyer. A Language Independent Approach for Detecting Duplicated Code. In Proceedings of ICSM 1999: IEEE International Conference on Software Maintenance, page 109, Oxford, England, 1999. ",
      "doi": "10.5555/519621.853389"
    },
    {
      "text": "Francoise Detienne. Software Design: Cognitive Aspects. Springer, 2001. ",
      "doi": "10.5555/502973"
    },
    {
      "text": "C. Grimes, D. Tang, and D. M. Russell. Query Logs Alone are Not Enough. In Workshop on Query Log Analysis at WWW 2007: International World Wide Web Conference, Banff, Alberta, Canada, 2007.",
      "doi": ""
    },
    {
      "text": "B. Hartmann, S. Doorley, and S. R. Klemmer. Hacking, Mashing, Gluing: Understanding Opportunistic Design. IEEE Pervasive Computing, September 2008.  ",
      "doi": "10.1109/MPRV.2008.54"
    },
    {
      "text": "B. Hartmann, L. Wu, K. Collins, and S. R. Klemmer. Programming by a Sample: Rapidly Creating Web Applications with d.mix. In Proceedings of UIST 2007: ACM Symposium on User Interface Software and Technology, pages 241--250, Newport, Rhode Island, 2007.  ",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "R. Hoffmann, J. Fogarty, and D. S. Weld. Assieme: Finding and Leveraging Implicit References in a Web Search Interface for Programmers. In Proceedings of UIST 2007: ACM Symposium on User Interface Software and Technology, pages 13--22, Newport, Rhode Island, 2007.  ",
      "doi": "10.1145/1294211.1294216"
    },
    {
      "text": "J. Hollan, E. Hutchins, and D. Kirsh. Distributed Cognition: Toward a New Foundation for Human-Computer Interaction Research. ACM Transactions on Computer-Human Interaction, 7(2):174--196, 2000.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "A. Hunt and D. Thomas. The Pragmatic Programmer: From Journeyman to Master. Addison-Wesley Professional, October 1999. ",
      "doi": "10.5555/320326"
    },
    {
      "text": "M. Kim, L. Bergman, T. Lau, and D. Notkin. An Ethnographic Study of Copy and Paste Programming Practices in OOPL. In Proceedings of ISESE 2004: IEEE International Symposium on Empirical Software Engineering, pages 83--92, Redondo Beach, California, 2004.  ",
      "doi": "10.5555/1018434.1021568"
    },
    {
      "text": "A. J. Ko, B. A. Myers, and H. H. Aung. Six Learning Barriers in End-User Programming Systems. In Proceedings of VL/HCC 2004: IEEE Symposium on Visual Languages and Human-Centric Computing, pages 199--206, Rome, Italy, 2004.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "T. Lau and E. Horvitz. Patterns of Search: Analyzing and Modeling Web Query Refinement. In Proceedings of UM 1999: International Conference on User Modeling, pages 119--128, Banff, Alberta, Canada, 1999. ",
      "doi": "10.5555/317328.317340"
    },
    {
      "text": "H. Lieberman, F. Paterno, and V. Wulf. End-User Development. Springer, October 2006. ",
      "doi": "10.5555/1146351"
    },
    {
      "text": "G. Little and R. C. Miller. Translating Keyword Commands into Executable Code. In Proceedings of UIST 2006: ACM Symposium on User Interface Software and Technology, pages 135--144, Montreux, Switzerland, 2006.  ",
      "doi": "10.1145/1166253.1166275"
    },
    {
      "text": "A. MacLean, K. Carter, L. Lovstrand, and T. Moran. User-Tailorable Systems: Pressing the Issues with Buttons. In Proceedings of CHI 1990: ACM Conference on Human Factors in Computing Systems, pages 175--182, Seattle, Washington, 1990. ACM.  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "D. Mandelin, L. Xu, R. Bodik, and D. Kimelman. Jungloid Mining: Helping to Navigate the API jungle. In Proceedings of PLDI 2005: ACM Conference on Programming Language Design and Implementation, pages 48--61, Chicago, Illinois, 2005.  ",
      "doi": "10.1145/1065010.1065018"
    },
    {
      "text": "R. C. Martin. Agile Software Development, Principles, Patterns, and Practices. Prentice Hall, 1st edition, 2002. ",
      "doi": "10.5555/515230"
    },
    {
      "text": "R. E. Mayer. The Psychology of How Novices Learn Computer Programming. ACM Computing Surveys, 13(1):121--141, 1981.  ",
      "doi": "10.1145/356835.356841"
    },
    {
      "text": "B. Myers, S. Y. Park, Y. Nakano, G. Mueller, and A. Ko. How Designers Design and Program Interactive Behaviors. In Proceedings of VL/HCC 2008: IEEE Symposium on Visual Languages and Human-Centric Computing, pages 177--184, 2008.  ",
      "doi": "10.1109/VLHCC.2008.4639081"
    },
    {
      "text": "P. L. T. Pirolli. Information Foraging Theory. Oxford University Press, Oxford, England, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "N. Sahavechaphan and K. Claypool. XSnippet: Mining for Sample Code. ACM SIGPLAN Notices, 41(10):413--430, 2006.  ",
      "doi": "10.1145/1167515.1167508"
    },
    {
      "text": "C. Scaffidi, M. Shaw, and B. A. Myers. Estimating the Numbers of End Users and End User Programmers. pages 207--214, Dallas, Texas, 2005.",
      "doi": ""
    },
    {
      "text": "C. Silverstein, H. Marais, M. Henzinger, and M. Moricz. Analysis of a Very Large Web Search Engine Query Log. ACM SIGIR Forum, 33(1):6--12, 1999.  ",
      "doi": "10.1145/331403.331405"
    },
    {
      "text": "J. Stylos and B. A. Myers. Mica: A Web-Search Tool for Finding API Components and Examples. In Proceedings of VL/HCC 2006: IEEE Symposium on Visual Languages and Human-Centric Computing, pages 195--202, Brighton, United Kingdom, 2006.  ",
      "doi": "10.1109/VLHCC.2006.32"
    },
    {
      "text": "S. Turkle and S. Papert. Epistemological Pluralism: Styles and Voices within the Computer Culture. Signs: Journal of Women in Culture and Society, 16(1), 1990.",
      "doi": ""
    },
    {
      "text": "J. Wong and J. I. Hong. Marmite: Towards End-User Programming for the Web. In Proceedings of VL/HCC 2007: IEEE Symposium on Visual Languages and Human-Centric Computing, pages 270--271, 2007.  ",
      "doi": "10.1109/VLHCC.2007.38"
    },
    {
      "text": "R. B. Yeh, A. Paepcke, and S. R. Klemmer. Iterative Design and Evaluation of an Event Architecture for Pen-and-Paper Interfaces. In Proceedings of UIST 2008: ACM Symposium on User Interface Software and Technology, Monterey, California, 2008.  ",
      "doi": "10.1145/1449715.1449734"
    }
  ]
}