{
  "doi": "10.1145/1518701.1519059",
  "title": "Supporting content and process common ground in computer-supported teamwork",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2339-2348",
  "year": 2009,
  "badges": [],
  "abstract": "We build on our prior work with computer-supported teams performing a complex decision-making task on maps, where the distinction between content and process common ground is proposed. In this paper we describe a distributed geo-collaboration software prototype. The system design rationale was gleaned from fieldwork, literature on team cognition, and an earlier lab study introducing a reference task with face-to-face teams. We report on a controlled experiment that evaluates this design rationale. Distinct sets of measures show that that the prototype supported both content and process common ground, offsetting the costs imposed by the distributed setting. We interpret the results in relation to prior work on common ground and draw implications for moving beyond current models of sharing and coordination.",
  "authors": [
    {
      "name": "Gregorio Convertino",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232230",
      "orcid": "missing"
    },
    {
      "name": "Helena M. Mentis",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81100393102/rel-imgonly/profmentisphoto.jpg",
      "acmid": "81100393102",
      "orcid": "0000-0002-0142-3529"
    },
    {
      "name": "Mary Beth Rosson",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "Aleksandra Slavkovic",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100494824",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agresti, A. (2002) Categorical Data Analysis. John Wiley&amp;Sons, NJ.",
      "doi": ""
    },
    {
      "text": "Carroll et al. (2007) Prototyping collaborative geospatial emergency planning. In Proc. ISCRAM 2007.",
      "doi": ""
    },
    {
      "text": "Carroll et al. (2008). Common Ground in Teamwork: toward a Conceptual Model. In Letsky M. Warner N., Fiore S., Smith, C. (Eds.), Macrocognition in teams. Amsterdam, NL: Elsevier.",
      "doi": ""
    },
    {
      "text": "Cannon-Bowers, J.A., Salas, E.,&amp;Converse, S.A. (1993). Shared mental models in expert team decision making. In N.J. Castellan (Ed.), Individual and group decision making: Current issues. 221--246.",
      "doi": ""
    },
    {
      "text": "Clark, H. H.&amp;Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, J. Levine&amp;S. D. Teasley (Eds.), Perspectives on socially shared cognition. Washington, DC: APA.",
      "doi": ""
    },
    {
      "text": "Clark, H. H. (1996) Using language. Cambridge, UK: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Convertino, G., Mentis, H., Rosson, M.B., Carroll, J.M., Slavkovic, A., and Ganoe, C.H. (2008). Articulating common ground in cooperative work: content&amp;process. Proc. CHI. 1637--1646. ACM Press.  ",
      "doi": "10.1145/1357054.1357310"
    },
    {
      "text": "Convertino, G., Ganoe, C. H., Schafer, W., Yost, B., and Carroll, J. M. (2005). A multiple view approach to support common ground in distributed and synchronous geo-collaboration. In Proc. CMV 2005. 121--132.  ",
      "doi": "10.1109/CMV.2005.2"
    },
    {
      "text": "Convertino G., Mentis, H. et al. (2007). How does common ground increase? In Proc. ACM Group 2007.  ",
      "doi": "10.1145/1316624.1316657"
    },
    {
      "text": "Convertino G., Mentis H. et al. (2008) Comparing Media in Emergency Planning. In Proc. ISCRAM 2008.",
      "doi": ""
    },
    {
      "text": "Convertino G., Wu A., Zhang X. et al. (2008). Designing Group Annotations and Process Visualizations for Role-Based Collaboration. Internat. Workshop on Social Computing, Behavioral Modeling, Prediction.",
      "doi": ""
    },
    {
      "text": "Convertino, Zhao et al. (2007). A Role-based Multi-View Approach to support GeoCollaboration. In Proc. HCI International 2007. Lawrence Erlbaum Ass. ",
      "doi": "10.5555/1769451.1769519"
    },
    {
      "text": "Cooke, N. J., Salas, E., Cannon-Bowers, J. A.,&amp;Stout, R. (2000). Measuring team knowledge. Human Factors, 42, 151--173.",
      "doi": ""
    },
    {
      "text": "Hollan, J. D.&amp;Stornetta, S. (1992): Beyond Being There. In Proc. ACM CHI 92.  ",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Kleinman, D.L.,&amp;Serfaty, D. (1989) Team performance assessment in distributed decision making. In R. Gilson, J. P. Kincaid, B. Godiez. Proc. Interactive Networked Simulation for Training Conference.",
      "doi": ""
    },
    {
      "text": "McGrath, J. E. (1984). Groups: Interaction and performance. NJ: Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Mohammed S.&amp;Dumville B.C. (2001). Team mental models in a team knowledge framework: expanding theory and measurement across disciplinary boundaries. Journal of Organizational Behavior. 22.",
      "doi": ""
    },
    {
      "text": "Monk, A. (2003). Common ground in electronically mediated communication: Clark's theory of language use, in J.M. Carroll (Ed.), Toward a multidisciplinary science of HCI. MIT Press.",
      "doi": ""
    },
    {
      "text": "Monk, A., McCarthy, J., Watts, L.,&amp;Daly-Jones, O. Measures of process. In Thomas, P.J. (Ed.), CSCW requirements and evaluation. Berlin: Springer-Verlag.",
      "doi": ""
    },
    {
      "text": "Sanford A., Anderson A. H.,&amp;Mullin J. (2003). Audio channel constraints in video-mediated communication. Interacting with Computers, 16(6).",
      "doi": ""
    },
    {
      "text": "Schafer W., Ganoe C., Carroll J.M. (2007). Supporting Community Emergency Management Planning through a Geocollaboration Software Architecture. CSCW, 16.  ",
      "doi": "10.1007/s10606-007-9050-7"
    },
    {
      "text": "Sellen, A. J. (1995). Remote conversations: the effects of mediating talk with technology. HCI, 10.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Anderson, A.H., Bader, M., Bard, E., Boyle, E., Doherty, G., Garrod, S., Isard, S., Kowtko, J., McAllister, J., Sotillo, C., Thompson, H., 1991. The HCRC Map Task Corpus. Language and Speech 34 (4), 351--360.",
      "doi": ""
    },
    {
      "text": "Kraut R.E., Gergle D., Fussell, S.R. (2002) The use of visual information in shared visual spaces: informing the development of virtual co-presence, In Proc. the ACM conference on Proc. ACM CSCW 2002.  ",
      "doi": "10.1145/587078.587084"
    },
    {
      "text": "Stewart, D.D.,&amp;Stasser, G. (1995). Expert role assignment and information sampling during collective recall and decision making. Journal of Personality and Social Psychology, 69, 619--628.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., Rosson, M.B., Farooq, U., Xiao, L (In press). Beyond being aware. Information and Organizations.  ",
      "doi": "10.1016/j.infoandorg.2009.04.004"
    },
    {
      "text": "Cscl.ist.psu.edu/public/projects/ONRproject/quest.html (Last accessed Jan 12 2009).",
      "doi": ""
    },
    {
      "text": "Www.noldus.com/human-behavior-research (Last accessed Jan 12 2009)",
      "doi": ""
    }
  ]
}