{
  "doi": "10.1145/1518701.1518877",
  "title": "Body and mind: a study of avatar personalization in three virtual worlds",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1151-1160",
  "year": 2009,
  "badges": [],
  "abstract": "An increasingly large number of users connect to virtual worlds on a regular basis to conduct activities ranging from gaming to business meetings. In all these worlds, users project themselves into the environment via an avatar: a 3D body which they control and whose appearance is often customizable. However, considering the prevalence of this form of embodiment, there is a surprising lack of data about how and why users customize their avatar, as well as how easy and satisfying the existing avatar creation tools are. In this paper, we report on a study investigating these issues through a questionnaire administered to more than a hundred users of three virtual worlds offering widely different avatar creation and customization systems (Maple Story, World of Warcraft, and Second Life). We illustrate the often-surprising choices users make when creating their digital representation and discuss the impact of our findings for the design of future avatar creation systems.",
  "authors": [
    {
      "name": "Nicolas Ducheneaut",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81100116901/rel-imgonly/nic_photo.jpg",
      "acmid": "81100116901",
      "orcid": "missing"
    },
    {
      "name": "Ming-Hui Wen",
      "institution": "National Chiao-Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81423595831",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Yee",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319504922",
      "orcid": "missing"
    },
    {
      "name": "Greg Wadley",
      "institution": "The University of Melbourne, Parkville, Australia",
      "img": "/do/10.1145/contrib-81309499961/rel-imgonly/greg.jpg",
      "acmid": "81309499961",
      "orcid": "0000-0003-4230-3440"
    }
  ],
  "references": [
    {
      "text": "Bailenson, J.N.: Transformed social interaction in collaborative virtual environments. In: Messaris, P.,Humphreys, L. (eds.) Digital Media: Transformations in Human Communication, Peter Lang, New York, (2006)",
      "doi": ""
    },
    {
      "text": "Bessiere, K., Seay, A.F.,Kiesler, S.: The Ideal Elf: Identity Exploration in World of Warcraft. Cyberpsychology&amp;Behavior, 10 (4). (2007) 530--535",
      "doi": ""
    },
    {
      "text": "Brown, B.,Bell, M.: CSCW at play: 'There' as a collaborative virtual environment. In: Proceedings of CSCW'04, ACM, New York, (2004), 350--359  ",
      "doi": "10.1145/1031607.1031666"
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E.,Moore, R.J.: \"Alone Together?\" Exploring the social dynamics of massively multiplayer online games. In: Proceedings of CHI 2006, ACM, New York, (2006), 407--416  ",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Hancock, J.T., Toma, C.,Eliison, N.: The truth about lying in online dating profiles. In: Proceedings of CHI 2007, ACM, New York, (2007), 449--452  ",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Hussain, Z.,Griffiths, M.D.: Gender Swapping and Socializing in Cyberspace: An Exploratory Study. Cyberpsychology&amp;Behavior, 11 (1). (2008) 47--53",
      "doi": ""
    },
    {
      "text": "Kafai, Y.B., Fields, D.A.,Cook, M.: Your second selves: avatar designs and identity play in a teen virtual world. In: Proceedings of DIGRA 2007, (2007)",
      "doi": ""
    },
    {
      "text": "Meadows, M.: I, Avatar. New Riders Press (2008)",
      "doi": ""
    },
    {
      "text": "Moore, R.J., Ducheneaut, N.,Nickell, E.: Doing virtually nothing: awareness and accountability in massively multiplayer online worlds. Computer Supported Cooperative Work, 16. (2007) 265--305  ",
      "doi": "10.1007/s10606-006-9021-4"
    },
    {
      "text": "Nakamura, L.: Race In/For Cyberspace: Identity Tourism on the Internet. In: Bell, D. (ed). The Cybercultures Reader, Routledge Press, New York, (2000)",
      "doi": ""
    },
    {
      "text": "Nardi, B.,Harris, J.: Strangers and Friends: Collaborative Play in World of Warcraft. In: Proceedings of CSCW 2006, ACM, New York, (2006)  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Pace, T.: Can an Orc catch a cab in Stormwind? Cybertype preference in World of Warcraft. In: Proc. CHI 2008, ACM Press, New York, NY, (2008), 2943--2502  ",
      "doi": "10.1145/1358628.1358706"
    },
    {
      "text": "Pervin, L.A.,Oliver, P.J.: Handbook of Personality: Theory and Research. Guilford Press, New York, NY (2001)",
      "doi": ""
    },
    {
      "text": "Stephenson, N.: Snow Crash. Bantam Books (1992)",
      "doi": ""
    },
    {
      "text": "Synnott, A.: Shame and glory: a sociology of hair. British Journal of Sociology, 38 (3). (1987) 381--413",
      "doi": ""
    },
    {
      "text": "Turkle, S.: Life on the screen: identity in the age of the Internet. Touchstone Books (1997) ",
      "doi": "10.5555/523015"
    },
    {
      "text": "Woodcock, B.: An Analysis of MMOG Subscription Growth - Version 23.0. http://www.mmogchart.com.",
      "doi": ""
    },
    {
      "text": "Yee, N.: The Daedalus Gateway. http://www.nickyee.com/daedalus.",
      "doi": ""
    },
    {
      "text": "Yee, N.: The labor of fun: How video games blur the boundaries of work and play. Games and Culture, 1. (2006) 68--71",
      "doi": ""
    },
    {
      "text": "Yee, N.,Bailenson, J.N.: Walk A Mile in Digital Shoes: The Impact of Embodied Perspective-Taking on The Reduction of Negative Stereotyping in Immersive Virtual Environments. In: Proceedings of PRESENCE 2006: The 9th Annual International Workshop on Presence, (2006)",
      "doi": ""
    },
    {
      "text": "Yu, Y.: Modeling realistic virtual hairstyles. In: Proc. PG'01, Ninth Pacific Conference on Computer Graphics and Applications, (2007), 295--304 ",
      "doi": "10.5555/882473.883447"
    }
  ]
}