{
  "doi": "10.1145/1518701.1518991",
  "title": "Like bees around the hive: a comparative study of a mobile augmented reality map",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1889-1898",
  "year": 2009,
  "badges": [],
  "abstract": "We present findings from field trials of MapLens, a mobile augmented reality (AR) map using a magic lens over a paper map. Twenty-six participants used MapLens to play a location-based game in a city centre. Comparisons to a group of 11 users with a standard 2D mobile map uncover phenomena that arise uniquely when interacting with AR features in the wild. The main finding is that AR features facilitate place-making by creating a constant need for referencing to the physical, and in that it allows for ease of bodily configurations for the group, encourages establishment of common ground, and thereby invites discussion, negotiation and public problem-solving. The main potential of AR maps lies in their use as a collaborative tool.",
  "tags": [
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Ann Morrison",
      "institution": "Helsinki Institute for Information Technology, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81331499954/rel-imgonly/20151002_154737_resized.jpg",
      "acmid": "81331499954",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Helsinki Institute for Information Technology, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Peter Peltonen",
      "institution": "Helsinki Institute for Information Technology, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342507378",
      "orcid": "missing"
    },
    {
      "name": "Saija Lemmela",
      "institution": "Nokia Research Center, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489253",
      "orcid": "missing"
    },
    {
      "name": "Giulio Jacucci",
      "institution": "Helsinki Institute for Information Technology, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100644548/rel-imgonly/81100644548.png",
      "acmid": "81100644548",
      "orcid": "missing"
    },
    {
      "name": "Gerhard Reitmayr",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100102652/rel-imgonly/head_gr_cote.jpg",
      "acmid": "81100102652",
      "orcid": "missing"
    },
    {
      "name": "Jaana Näsänen",
      "institution": "Helsinki Institute for Information Technology, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608530",
      "orcid": "missing"
    },
    {
      "name": "Antti Juustila",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608966",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, M., Chalmers, M., Barkhuus, L., Hall, M., Sherwood, S., Tennent, P., Brown, B., Rowland, D., Benford, S., Capra, M., Hampshire, A. Interweaving mobile games with everyday life. Proc. CHI '06, ACM Press (2006), 417--426.  ",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T., Toolglass and Magic Lenses: The See-Through Inter-face. Proc. SIGGRAPH '93, ACM Press (1993), 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Benford, S., Flintham, M., Drozd, A., Anastasi, R., Rowland, D., Tandavanitj, N., Adams, M., Row-Farr, J., Oldroyd, A., Sutton, J. Uncle Roy All Around You: Implicating the City in a Location-Based Performance, In Proc. ACE, ACM Press (2004).",
      "doi": ""
    },
    {
      "text": "Benford, S., Bederson, B., Åkesson, K., Bayon, V., Druin, A., Hansson, P., Hourcade, J.P., Ingram, R., Neale, H., O'Malley, C., Simsarian, K.T., Stanton, D., Sundblad, Y. and Taxén, G. Designing storytelling technologies to encourage collaboration between young children. Proc CHI 2000 ACM Press (2000), 556--563  ",
      "doi": "10.1145/332040.332502"
    },
    {
      "text": "Bobrich, J., Otto. S. Augmented maps. In Geospatial Theory, Processing and Applications, Proc. ISPRS Commission IV, WG7, (2002).",
      "doi": ""
    },
    {
      "text": "Cao, X., Jie Li, J., Balakrishnan, R. Peephole pointing: modeling acquisition of dynamically revealed targets. Proc. CHI 2008, ACM Press (2008), 1699--1708.  ",
      "doi": "10.1145/1357054.1357320"
    },
    {
      "text": "Clark, H. Using Language. Cambridge University Press, 1996.",
      "doi": ""
    },
    {
      "text": "Costabile, M. F., De Angeli, A., Lanzilotti, R., Ardito, C., Buono, P., Pederson, T. Explore! Possibilities and Challenges of Mobile Learning. Proc. CHI 2008, ACM Press (2008), 145--154.  ",
      "doi": "10.1145/1357054.1357080"
    },
    {
      "text": "Deci, E. L., Ryan, R. M. The \"what\" and \"why\" of goal pursuits: Human needs and the self-determination of behavior. Psychological Inquiry 11 (2000), 227--268.",
      "doi": ""
    },
    {
      "text": "Henrysson, A., Ollila, M., Billinghurst, M. Mobile phone based AR scene assembly. Proc. MUM 2005, ACM Press (2005), 95--102.  ",
      "doi": "10.1145/1149488.1149504"
    },
    {
      "text": "Jegers, K. Pervasive game flow: understanding player enjoyment in pervasive gaming. Proc CIE 5, 1 ACM Press (2007), Article 9.  ",
      "doi": "10.1145/1236224.1236238"
    },
    {
      "text": "Kristoffersen, S., Jungberg, F. L. \"Making place\" to make IT work: empirical explorations of HCI for mobile CSCW. In Proc. International ACM SIGGROUP 1999, ACM Press (1999), 276--285  ",
      "doi": "10.1145/320297.320330"
    },
    {
      "text": "Konopatzky, P., Scholz, M., Reißig, S., Verhoeven, P., Löchtefeld, M., Schöning, J., Krüger, A. xChase: A location-based multi-user pervasive game using a light-weight tracking framework. Proc. FnG 2008. Springer, (2008).",
      "doi": ""
    },
    {
      "text": "Liff, S., Shepherd, A. An evolving gender digital divide? Oxford Internet Institute, Internet Issue 2, (2004).",
      "doi": ""
    },
    {
      "text": "McGee, D. R., Cohen, P. R., Wu, L. Something from nothing: Augmenting a paperbased work practice via multimodal interaction. Proc. DARE 2000, ACM Press (2000), 71--80.  ",
      "doi": "10.1145/354666.354674"
    },
    {
      "text": "Maurin, H., Sonnenwald, D. H., Cairns, B., Manning, J. E., Freid, E. B., and Fuchs, H. 2006. Exploring gender differences in perceptions of 3D telepresence collaboration technology: an example from emergency medical care. Proc. NordiCHI '06 ACM Press (2006), 381--384.  ",
      "doi": "10.1145/1182475.1182517"
    },
    {
      "text": "Mehra, M., Werkhoven, P., Worring, M. Navigating on handheld displays: Dynamic versus static peephole navigation. Proc. TOCHI ACM Press (2006), 448--457.  ",
      "doi": "10.1145/1188816.1188818"
    },
    {
      "text": "Merleau-Ponty, M., The Visible and The Invisible, Lingis, A (Translator) Northwestern University Press; 1 edition, 1969.",
      "doi": ""
    },
    {
      "text": "Ohlenburg, J., Lindt, I., Pankoke-Babatz, U., Ghellal, S. A report on the crossmedia game epidemic menace. In Proc. CIE 5, 1 (2007).  ",
      "doi": "10.1145/1236224.1236237"
    },
    {
      "text": "Ozuysal, M., Fua, P., Lepetit, V. Fast Keypoint Recognition in Ten Lines of Code. Proc. IEEE CVPR 2007, IEEE Press (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Pasman, W., Woodward C., Hakkarainen, M., Honka-maa, P., Hyväkkä, P. Augmented reality with large 3D models on a PDA: implementation, performance and use experiences. Proc. SIGGRAPH 2004. ACM Press, 344 -- 351.  ",
      "doi": "10.1145/1044588.1044663"
    },
    {
      "text": "Poynton, C. Language and gender: Making the difference. New York: Oxford University Press, 1989.",
      "doi": ""
    },
    {
      "text": "Prinsen FR., Volmann MLL., Terwel J. 2007, Gender-related differences in computer-mediated communication and computer-supported collaborative learning. JCAL, Wiley (2007), 393--409.",
      "doi": ""
    },
    {
      "text": "Reitmayr, G., Eade, E., Drummond, T. W. Localisation and interaction for augmented maps. Proc. ISMAR 2005, IEEE Press (2005), 120--129.  ",
      "doi": "10.1109/ISMAR.2005.39"
    },
    {
      "text": "Rekimoto, J. Navicam: A magnifying glass approach to augmented reality. PRESENCE - Teleoperators and Virtual Environments, 6(4). MIT Press (1997), 399--412.",
      "doi": ""
    },
    {
      "text": "Reilly, D., Rodgers, M., Argue, R., Nunes, M., Inkpen, K., Marked-up maps: combining paper maps and electronic information resources. Proc. PUC 10, 4 (2006), 215--226.  ",
      "doi": "10.1007/s00779-005-0043-6"
    },
    {
      "text": "Rogers, Everett M. New Product Adoption and Diffusion. JCR, 2 (1976), 290 --301.",
      "doi": ""
    },
    {
      "text": "Rohs, M., Oulasvirta, A. Target acquisition with camera phones when used as magic lenses. Proc. CHI '08, ACM Press (2008), 1409--1418.  ",
      "doi": "10.1145/1357054.1357275"
    },
    {
      "text": "Rohs, M., Schoening, J., Krueger, A., and Hecht, B. Towards real-time markerless tracking of magic lenses on paper maps. Proc. PERVASIVE 2007, 69--72, ACM Press (2007).",
      "doi": ""
    },
    {
      "text": "Rohs, M., Schöning, J., Raubal, M., Essl, G., Krüger, A. Map Navigation with Mobile Devices: Virtual versus Physical Movement with and without Visual Context. Proc. ICMI 2007, ACM Press (2007), 146--153.  ",
      "doi": "10.1145/1322192.1322219"
    },
    {
      "text": "Sweetser, P., Wyeth, P. Gameflow: a model for evaluating player enjoyment in games. Proc. CIE 5, ACM Press (2005), 1--24.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Viega, J., Conway, M. J., Williams, G., Pausch, R. 3D magic lenses. Proc. UIST '96, ACM Press (1996), 51--58.  ",
      "doi": "10.1145/237091.237098"
    },
    {
      "text": "Vorderer, P., Wirth, W., Gouveia, F. R., Biocca, F., Saari, T., Jancke, F., et al. MEC-SPQ: Report to the European Community, Project Presence: MEC (IST-2001-37661), 2004.",
      "doi": ""
    },
    {
      "text": "Wagner, D., Reitmayr, G., Mulloni, A., Drummond, T., Schmalstieg, D. Pose Tracking from Natural Features on Mobile Phones, Proc. ISMAR 2008, IEEE Press (2008).  ",
      "doi": "10.1109/ISMAR.2008.4637338"
    }
  ]
}