{
  "doi": "10.1145/1518701.1519005",
  "title": "Who's viewed you?: the impact of feedback in a mobile location-sharing application",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2003-2012",
  "year": 2009,
  "badges": [],
  "abstract": "Feedback is viewed as an essential element of ubiquitous computing systems in the HCI literature for helping people manage their privacy. However, the success of online social networks and existing commercial systems for mobile location sharing which do not incorporate feedback would seem to call the importance of feedback into question. We investigated this issue in the context of a mobile location sharing system. Specifically, we report on the findings of a field de-ployment of Locyoution, a mobile location sharing system. In our study of 56 users, one group was given feedback in the form of a history of location requests, and a second group was given no feedback at all. Our major contribution has been to show that feedback is an important contributing factor towards improving user comfort levels and allaying privacy concerns. Participants' privacy concerns were reduced after using the mobile location sharing system. Additionally,our study suggests that peer opinion and technical savviness contribute most to whether or not participants thought they would continue to use a mobile location technology.",
  "tags": [
    "information disclosure",
    "privacy",
    "mobile location sharing technology",
    "mobile social",
    "context-awareness"
  ],
  "authors": [
    {
      "name": "Janice Y. Tsai",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443595473",
      "orcid": "missing"
    },
    {
      "name": "Patrick Kelley",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81384615723/rel-imgonly/pgk-8.jpg",
      "acmid": "81384615723",
      "orcid": "missing"
    },
    {
      "name": "Paul Drielsma",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607719",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Jason Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    },
    {
      "name": "Norman Sadeh",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100339054/rel-imgonly/n.sadeh.png",
      "acmid": "81100339054",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "D. Anthony, D. Kotz, and T. Henderson. Privacy in location-aware computing environments. IEEE Pervasive Computing, 6(4):64--72, 2007.  ",
      "doi": "10.1109/MPRV.2007.83"
    },
    {
      "text": "L. Barkhuus, B. Brown, M. Bell, M. Hall, S. Sherwood, and M. Chalmers. From awareness to repartee: Sharing location within social groups. In CHI '08, pages 497--506, April 2008.  ",
      "doi": "10.1145/1357054.1357134"
    },
    {
      "text": "L. Barkhuus and A. Dey. Location-based services for mobile telephony: a study of users' privacy concerns. In INTERACT'03, pages 702--712, 2003.",
      "doi": ""
    },
    {
      "text": "V. Bellotti and A. Sellen. Design for privacy in ubiquitous computing environments. In ECSCW '93, 1993. ",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "B. Brown, A. Taylor, S. Izadi, A. Sellen, J. Kaye, and R. Eardley. Location family values: A field trial of the whereabouts clock. In Ubiquitous Computing (Ubicomp '07), pages 354--371. Springer-Verlag, 2007. ",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "B. Charny. New cell feature helps find friends, July 25 2002. http://www.news.com/2100-1033-946224.html.",
      "doi": ""
    },
    {
      "text": "S. Consolovo, I. Smith, T. Matthews, A. LaMarca, J. Tabert, and P. Powledge. Location disclosure to social relations: Why, when,&amp;what people want to share. In CHI '05, 2005.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "J. Cornwell, I. Fette, G. Hsieh, M. Prabaker, J. Rao, K. Tang, K. Vaniea, L. Bauer, L. Cranor, J. Hong, B. McLaren, M. Reiter, and N. Sadeh. User-controllable security and privacy for pervasive computing. In IEEE Workshop on Mobile Computing Systems and Applications (HotMobile '07), 2007.  ",
      "doi": "10.1109/HOTMOBILE.2007.21"
    },
    {
      "text": "F. Davis, R. Bagozzi, and P. Warshaw. Extrinsic and intrinsic motivation to use computers in the workplace. Journal of Applied Social Psychology, 22:1111 -- 1132, 1992.",
      "doi": ""
    },
    {
      "text": "T. Erickson and W. A. Kellogg. Social translucence: an approach to designing systems that support social processes. ACM Trans. Comput.-Hum. Interact., 7(1):59--83, 2000.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "J. Hightower, A. LaMarca, and I. E. Smith. Practical lessons from place lab. IEEE Pervasive Computing, 5(3):32--39, 2006.  ",
      "doi": "10.1109/MPRV.2006.55"
    },
    {
      "text": "L. Holson. Privacy lost: These phones can find you. New York Times, October 23 2007. http://www.nytimes.com/2007/10/23/technology/23mobile.html.",
      "doi": ""
    },
    {
      "text": "G. Hsieh, K. Tang, W. Low, and J. Hong. Field deployment of IMbuddy : A study of privacy control and feedback mechanisms for contextual IM. In Ubiquitous Computing (Ubicomp '07), pages 91--108, 2007. ",
      "doi": "10.5555/1771592.1771598"
    },
    {
      "text": "S. Huang, F. Proulx, and C. Ratti. iFIND: a Peer-to-Peer application for real-time location monitoring on the MIT campus. In CUPUM 07 - 10th International Conference on Computers in Urban Planning and Urban Management, July 11-13 2007.",
      "doi": ""
    },
    {
      "text": "G. Iachello and J. Hong. End-user privacy in human-computer interaction. Found. Trends Hum.-Comput. Interact., 1(1):1--137, 2007.  ",
      "doi": "10.1561/1100000004"
    },
    {
      "text": "G. Iachello, I. Smith, S. Consolovo, G. Abowd, J. Hughes, J. Howard, F. Potter, J. Scott, T. Sohn, J. Hightower, and A. LaMarca. Control, deception, and communication: Evaluating the deployment of a location-enhanced messaging service. In UbiComp 2005, pages 213 -- 231. Springer-Verlag, 2005.  ",
      "doi": "10.1007/11551201_13"
    },
    {
      "text": "G. Iachello, I. Smith, S. Consolovo, M. Chen, and G. Abowd. Developing privacy guidelines for social location disclosure applications and services. In SOUPS '05, 2005.  ",
      "doi": "10.1145/1073001.1073008"
    },
    {
      "text": "I. Junglas and R. Watson. Location-based services. Communications of The ACM, 51(3):65--69, March 2008. 19. A. Khalil and K. Connelly. Context-aware telephony: Privacy preferences and sharing patterns. In CSCW '06, 2006.  ",
      "doi": "10.1145/1325555.1325568"
    },
    {
      "text": "S. Lederer, J. Mankoff, and A. K. Dey. Who wants to know what when? privacy preference determinants in ubiquitous computing. In CHI '03, number 724--725, 2003.  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "C. McCarthy. The mobile social: Not ready for prime time?, February 13 2008. http://www.news.com/8301-13577_3-9870611-36.html.",
      "doi": ""
    },
    {
      "text": "A. G. Miklas, K. K. Gollu, K. K. W. Chan, S. Saroiu, K. P. Gummadi, and E. de Lara. Exploiting social interactions in mobile systems. In UbiComp 2007, volume 4717/2007, pages 409--428, 2007. ",
      "doi": "10.5555/1771592.1771616"
    },
    {
      "text": "S. Patil and J. Lai. Who gets to know what when: Configuring privacy permissions in an awareness application. In CHI '05, pages 101 -- 110, 2005.  ",
      "doi": "10.1145/1054972.1054987"
    },
    {
      "text": "M. Raento, A. Oulasvirta, R. Petit, and H. Toivonen. Contextphone: A prototyping platform for context-aware mobile applications. In Pervasive '05, pages 51 -- 59, 2005.  ",
      "doi": "10.1109/MPRV.2005.29"
    },
    {
      "text": "N. Sadeh, F. Gandon, and O. B. Kwon. Ambient intelligence: The myCampus experience. Technical Report CMU-ISRI-05-123, Carnegie Mellon University, July 2005.",
      "doi": ""
    },
    {
      "text": "N. Sadeh, J. Hong, L. Cranor, I. Fette, P. Kelley, M. Prabaker, and J. Rao. Understanding and capturing people's privacy policies in a mobile social networking application. Personal and Ubiquitous Computing, Forthcoming 2008.  ",
      "doi": "10.1007/s00779-008-0214-3"
    },
    {
      "text": "I. Smith, S. Consolovo, A. LaMarca, J. Hightower, J. Scott, T. Sohn, J. Hughes, G. Iachello, and G. Abowd. Social disclosure of place: From location technology to communication practices. In Pervasive '05, pages 134 -- 151. Springer-Verlag, 2005.  ",
      "doi": "10.1007/11428572_9"
    },
    {
      "text": "S. Spiekermann. User Control in Ubiquitous Computer: Design Alternatives and User Acceptance. Shaker Verlag, 2008.",
      "doi": ""
    },
    {
      "text": "S. Stumpf, V. Rajaram, L. Li, M. Burnett, T. Dietterich, E. Sullivan, R. Drummond, and J. Herlocker. Toward harnessing user feedback for machine learning. In IUI '07: Proceedings of the 12th international conference on Intelligent user interfaces, pages 82--91, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1216295.1216316"
    },
    {
      "text": "R. Want, V. Falcao, and J. Gibbons. The active badge location system. ACM Transactions on Information Systems, 10:91--102, 1992.  ",
      "doi": "10.1145/128756.128759"
    }
  ]
}