{
  "doi": "10.1145/1518701.1519018",
  "title": "Exploring awareness needs and information display preferences between coworkers",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2091-2094",
  "year": 2009,
  "badges": [],
  "abstract": "Technology makes it possible to share many different types of information with coworkers. We conducted a large-scale survey (N=549) to better understand current sharing among coworkers, how people stay aware of collocated and remote coworkers, and whether their willingness to share different types of awareness information changes based on the location in which the information is displayed. Contrary to our expectations, the display location did not greatly affect what respondents were willing to share. Our results also suggest considerations for researchers building situated displays, as respondents had concerns about unintended viewers and encouraging people to visit their personal space when they were not present.",
  "authors": [
    {
      "name": "A.J. Bernheim Brush",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81332491415/rel-imgonly/ajbrushlarge.jpg",
      "acmid": "81332491415",
      "orcid": "missing"
    },
    {
      "name": "Brian R. Meyers",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100591949",
      "orcid": "missing"
    },
    {
      "name": "James Scott",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81407592275/rel-imgonly/jws-new-sm.jpg",
      "acmid": "81407592275",
      "orcid": "missing"
    },
    {
      "name": "Gina Venolia",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100190815/rel-imgonly/ginav.jpg",
      "acmid": "81100190815",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dourish, P. and Bly, S. Portholes: Supporting awareness in a distributed work group. In Proc. CHI '92, ACM Press (1992), 541--547.  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Fitton, D. Cheverst, K., Rouncefield, M., and Dix, A. Exploring adoption in the Hermes door display deployment. In Proc. UbiComp in the Office Workshop '07, Springer (2007).",
      "doi": ""
    },
    {
      "text": "Huang, E. and Mynatt, E. Semi-public displays for small, co-located groups. In Proc. CHI '03, ACM Press (2003), 49--56.  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "Lederer, S., Mankoff, J., and Dey, A. Who wants to know what when? Privacy preference determinants in ubiquitous computing. In Extended abstracts of CHI '03, ACM Press (2003), 724--725.  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "McCarthy, J., Costa, T., and Liongosari, E. UniCast, OutCast&amp;GroupCast: Three steps toward ubiquitous, peripheral displays. In Proc. UbiComp '01, Springer (2001), 332--345. ",
      "doi": "10.5555/647987.741333"
    },
    {
      "text": "McEwan, G. and Greenberg, S. Supporting Social Worlds with the community Bar. In Proc. GROUP 2005, ACM Press (2005), 21--30.  ",
      "doi": "10.1145/1099203.1099207"
    },
    {
      "text": "Olson, J., Grudin, J., and Horvitz, E. Toward understanding preferences for sharing and privacy. Microsoft Research Technical Report MSR-TR-2004-138. Microsoft (2004).",
      "doi": ""
    },
    {
      "text": "Sensenig, J., and Reed, T. Cooperation in the prisoner's dilemma as a function of interpersonal distance. Psychonomic Science, 26(2), 1972, 105--106.",
      "doi": ""
    }
  ]
}