{
  "doi": "10.1145/1518701.1518990",
  "title": "Designable visual markers",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1879-1888",
  "year": 2009,
  "badges": [],
  "abstract": "Visual markers are graphic symbols designed to be easily recognised by machines. They are traditionally used to track goods, but there is increasing interest in their application to mobile HCI. By scanning a visual marker through a camera phone users can retrieve localised information and access mobile services. One missed opportunity in current visual marker systems is that the markers themselves cannot be visually designed, they are not expressive to humans, and thus fail to convey information before being scanned. This paper provides an overview of d-touch, an open source system that allows users to create their own markers, controlling their aesthetic qualities. The system runs in real-time on mobile phones and desktop computers. To increase computational efficiency d-touch imposes constraints on the design of the markers in terms of the relationship of dark and light regions in the symbols. We report a user study in which pairs of novice users generated between 3 and 27 valid and expressive markers within one hour of being introduced to the system, demonstrating its flexibility and ease of use.",
  "tags": [
    "mobile HCI",
    "UI toolkits",
    "visual marker design",
    "mobile devices",
    "user studies",
    "fiducial recognition",
    "visual marker recognition"
  ],
  "authors": [
    {
      "name": "Enrico Costanza",
      "institution": "EPFL Media and Design Lab, Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-81100088903/rel-imgonly/enrico_bw.png",
      "acmid": "81100088903",
      "orcid": "0000-0002-1842-8342"
    },
    {
      "name": "Jeffrey Huang",
      "institution": "EPFL Media and Design Lab, Lausanne, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100084419",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "d-touch source code. http://sourceforge.net/projects/libdtouch.",
      "doi": ""
    },
    {
      "text": "Mobile codes consortium. http://www.mobilecodes.org/, February 2007.",
      "doi": ""
    },
    {
      "text": "Ross Bencina, Martin Kaltenbrunner, and Sergi Jordà. Improved topological fiducial tracking in the reactivision system. In Proc. IEEE International Workshop on Projector--Camera Systems (Procams 2005), San Diego, USA, 2005.  ",
      "doi": "10.1109/CVPR.2005.475"
    },
    {
      "text": "Enrico Costanza and Leinss Mirja. Telling a story on a tag: The importance of markers' visual design for real world applications (paper presentation). In Proceedings of the Mobile Interaction with the Real World Workshop at Mobile HCI2006, Espoo, Finland, sep 2006.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza and John Robinson. A region adjacency tree approach to the detection and design of fiducials. In VVG, pages 63--69, 2003.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Simon B Shelley, and John Robinson. D-touch: A consumer-grade tangible interface module and musical applications. In Proceedings of Conference on Human-Computer Interaction (HCI03), 2003.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Simon B Shelley, and John Robinson. Introducing audio d-touch: A tangible user interface for music composition and performance. In Proceedings of the 2003 International Conference on Digital Audio EffectsDAFx03, 2003.",
      "doi": ""
    },
    {
      "text": "Diego Lopez de Ipina, Paulo R. S. Mendonca, and Andy Hopper. Trip: A low-cost vision-based location system for ubiquitous computing. Personal Ubiquitous Comput., 6(3):206--219, 2002.  ",
      "doi": "10.1007/s007790200020"
    },
    {
      "text": "Mark Fiala. Artag, a fiducial marker system using digital techniques. In CVPR (2), pages 590--596, 2005.  ",
      "doi": "10.1109/CVPR.2005.74"
    },
    {
      "text": "ISO. International standard, iso/iec18004. ISO International Standard, Jun 2000.",
      "doi": ""
    },
    {
      "text": "ISO. International standard, iso/iec16022â\"international symbology specification, data matrix. ISO standard, 2006.",
      "doi": ""
    },
    {
      "text": "Woodland Norman J. and Bernard Silver. Classifying apparatus and method, October 1952.",
      "doi": ""
    },
    {
      "text": "David J. Johnston and Adrian F. Clark. A vision-based location system using fiducials. In VVG, pages 159--166, 2003.",
      "doi": ""
    },
    {
      "text": "H. Kato and Mark Billinghurst. Marker tracking and hmd calibration for a video-based augmented reality conferencing system. In Proceedings of the 2nd International Workshop on Augmented Reality (IWAR 99), San Francisco, USA, October 1999. ",
      "doi": "10.5555/857202.858134"
    },
    {
      "text": "Kaj Mäkelä, Sara Belt, Dan Greenblatt, and Jonna Häkkilä. Mobile interaction with visual and rfid tags: a field study on user perceptions. In CHI '07: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 991--994, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240774"
    },
    {
      "text": "Mathias Mohring, Christian Lessig, and Oliver Bimber. Video see-through ar on consumer cell-phones. In ISMAR '04: Proceedings of the Third IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR'04), pages 252--253, Washington, DC, USA, 2004. IEEE Computer Society.  ",
      "doi": "10.1109/ISMAR.2004.63"
    },
    {
      "text": "Takao Nakamura, Atsushi Katayama, Masashi Yamamuro, and Noboru Sonehara. Fast watermark detection scheme from camera-captured images on mobile phones. IJPRAI, 20(4):543--564, 2006.",
      "doi": ""
    },
    {
      "text": "Eamonn O'Neill, Peter Thompson, Stavros Garzonis, and Andrew Warr. Reach out and touch: Using nfc and 2d barcodes for service discovery and interaction with mobile devices. In Anthony LaMarca, Marc Langheinrich, and Khai N. Truong, editors, Pervasive, volume 4480 of Lecture Notes in Computer Science, pages 19--36. Springer, 2007. ",
      "doi": "10.5555/1758156.1758159"
    },
    {
      "text": "Jun Rekimoto. Navicam: A magnifying glass approach to augmented reality systems. Teleoperators and Virtual Environ., 6(4):399--412, 1997.",
      "doi": "10.1162/pres.1997.6.4.399"
    },
    {
      "text": "Jun Rekimoto and Yuji Ayatsuka. Cybercode: designing augmented reality environments with visual tags. In DARE '00: Proceedings of DARE 2000 on Designing augmented reality environments, pages 1--10, New York, NY, USA, 2000. ACM Press.  ",
      "doi": "10.1145/354666.354667"
    },
    {
      "text": "Michael Rohs and Philipp Zweifel. A conceptual framework for camera phone-based interaction techniques. In Pervasive Computing: Third International Conference, PERVASIVE 2005, number 3468 in Lecture Notes in Computer Science (LNCS), Munich, Germany, May 2005. Springer-Verlag.  ",
      "doi": "10.1007/11428572_11"
    },
    {
      "text": "Azriel Rosenfeld. Adjacency in digital pictures. Information and Control, 26(1):24--33, September 1974.",
      "doi": ""
    },
    {
      "text": "Ron Shamir and Dekel Tsur. Faster subtree isomorphism. J. Algorithms, 33(2):267--280, 1999.  ",
      "doi": "10.1006/jagm.1999.1044"
    },
    {
      "text": "G. Thomas, J. Jin, T. Niblett, and C. Urquhart. A versatile camera position measurement system for virtual reality tv production. In Proc. Internat. Broadcasting Convention (IBC'97), pages 284--289, 1997.",
      "doi": ""
    },
    {
      "text": "Tikiwiki. http://tikiwiki.org/.",
      "doi": ""
    },
    {
      "text": "Eleanor Toye, Richard Sharp, Anil Madhavapeddy, David Scott, Eben Upton, and Alan Blackwell. Interacting with mobile services: an evaluation of camera-phones and visual tags. Personal Ubiquitous Comput., 11(2):97--106, 2007.  ",
      "doi": "10.1007/s00779-006-0064-9"
    }
  ]
}