{
  "doi": "10.1145/1518701.1519033",
  "title": "HeartBeat: an outdoor pervasive game for children",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2181-2184",
  "year": 2009,
  "badges": [],
  "abstract": "This paper reports the design of a pervasive game for children to demonstrate the design vision of Head-Up games, a genre of pervasive games that puts outdoors play center stage, combining the benefits of traditional outdoor games with the opportunities for richer experiences and innovation offered by new media. The design of the game, called HeartBeat, explores the use of physiological sensing and more specifically heart rate measurement as input to the game and as an approach to enhance the pervasive gaming experience. Evaluation with 32 children outdoors showed how the game promotes physical activity and social interaction between children in ways one would expect from traditional outdoor games.",
  "tags": [
    "physiological sensing",
    "interaction design and children",
    "pervasive games",
    "head up games"
  ],
  "authors": [
    {
      "name": "Remco Magielse",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608699",
      "orcid": "missing"
    },
    {
      "name": "Panos Markopoulos",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81350577812/rel-imgonly/myphoto.jpg",
      "acmid": "81350577812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Al Mahmud, A., Mubin, O., Renny Octavia, J., Shahid, S., Yeo, L., Markopoulos, P., Martens, J.B., Aliakseyeu, D. (2007). Affective Tabletop Game: A New Gaming Experience for Children, Proc. TABLETOP'07, 44--51.",
      "doi": ""
    },
    {
      "text": "Bakker, S., Markopoulos, P., de Kort, Y. (2008). OPOS: an observation scheme for evaluating head-up play. Proc. NordiCHI '08, vol. 358, 33--42  ",
      "doi": "10.1145/1463160.1463165"
    },
    {
      "text": "Bell, M., Chalmers, M., Barkhuus, L., Hall, M., Sherwood, S., Tennent, P., Brown, B., Rowland, D., and Benford, S. (2006). Interweaving mobile games with everyday life. Proc. CHI '06, 417--426.  ",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Benford, S., Rowland, D., Flintham, M., Drozd, et al.: Life on the edge: supporting collaboration in location-based experiences.: Proc. CHI '05, 721--730.  ",
      "doi": "10.1145/1054972.1055072"
    },
    {
      "text": "Cheok, A. D., Goh, K. H., Liu, W., Farbiz, F., Teo, S. L., Teo, H. S., Lee, S. P., Li, Y., Fong, S. W., and Yang, X. (2004). Human Pacman: a mobile wide-area entertainment system based on physical, social, and ubiquitous computing. Proc. ACE '04, 360--361.  ",
      "doi": "10.1145/1067343.1067402"
    },
    {
      "text": "Davis, S. B., Moar, M., Jacobs, R., Watkins, M., Riddoch, C., Cooke, K. (2006) 'Ere Be Dragons: heartfelt gaming', Digital Creativity, 17:3, 157--162.",
      "doi": ""
    },
    {
      "text": "Dekker, A., Champion, E., (2007). Please Biofeed the Zombies: Enhancing the Gameplay and Display of a Horror Game Using Biofeedback. Situated Play, Proc. DiGRA 2007, 550--558.",
      "doi": ""
    },
    {
      "text": "Oertel, K., Schultz, R., Blech, M., Herbort, O., Voskamp, J., Urban, B. (2005). EmoTetris for recognition of affective states. HCI International.",
      "doi": ""
    },
    {
      "text": "Mueller, F., Agamanolis, S., and Picard, R. (2003). Exertion interfaces: sports over a distance for social bonding and fun. Proc. CHI 2003, 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Read, J.C. and MacFarlane, S. (2006). Using the fun toolkit and other survey methods to gather opinions in child computer interaction. Proc. IDC '06,81--88.  ",
      "doi": "10.1145/1139073.1139096"
    },
    {
      "text": "Rogers, Y., Price, S., Fitzpatrick, G., Fleck, R., Harris, E., Smith, H., Randell, C., Muller, H., O'Malley, C., Stanton, D., Thompson, M., and Weal, M. (2004) Ambient wood: designing new forms of digital augmentation for learning outdoors. Proc. IDC '04, 3--10.  ",
      "doi": "10.1145/1017833.1017834"
    },
    {
      "text": "Seitinger, S., Sylvan, E., Zuckerman, O., Popovic, M., and Zuckerman, O. (2006). A new playground experience: going digital? CHI'06 Ext. Abstracts, 303--308.  ",
      "doi": "10.1145/1125451.1125520"
    },
    {
      "text": "Soute, I. and Markopoulos, P. (2007). Head Up Games: The Games of the Future Will Look More Like the Games of the Past. Proc. INTERACT 2007, LNCS 4663, Part II, 404--407. ",
      "doi": "10.5555/1778331.1778375"
    },
    {
      "text": "Verhaegh, J., Soute, I., Kessels, A., and Markopoulos, P. 2006. On the design of Camelot, an outdoor game for children. Proc. IDC '06, 9--16.  ",
      "doi": "10.1145/1139073.1139082"
    }
  ]
}