{
  "doi": "10.1145/1518701.1519051",
  "title": "Lean collaboration through video gestures: co-ordinating the production of live televised sport",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2279-2288",
  "year": 2009,
  "badges": [],
  "abstract": "This paper examines the work and interactions between camera operators and a vision mixer during an ice hockey match, and presents an interaction analysis using video data. We analyze video-mediated indexical gestures in the collaborative production of live sport on television between distributed team members. The findings demonstrate how video forms the topic, resource and product of collabora-tion: whilst it shapes the nature of the work (editing), it is simultaneously also the primary resource for supporting mutual orientation and negotiating shot transitions between remote participants (co-ordination), as well as its end prod-uct (broadcast). Our analysis of current professional activi-ties is used to develop implications for the design of future services for live collaborative video production.",
  "authors": [
    {
      "name": "Mark Perry",
      "institution": "Brunel University, Uxbridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100036324",
      "orcid": "missing"
    },
    {
      "name": "Oskar Juhlin",
      "institution": "Interactive Institute, Kista, Sweden",
      "img": "/do/10.1145/contrib-81100316356/rel-imgonly/passfotooskarjuhlin.jpg",
      "acmid": "81100316356",
      "orcid": "missing"
    },
    {
      "name": "Mattias Esbjörnsson",
      "institution": "Interactive Institute, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100008113",
      "orcid": "missing"
    },
    {
      "name": "Arvid Engström",
      "institution": "Interactive Institute, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371594557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, B. and Venkatesh, S. (2005) IMCE: Integrated media creation environment. ACM Trans. Multimedia Computing, Commun. and Applications, 1(3), 211--247.  ",
      "doi": "10.1145/1083314.1083315"
    },
    {
      "text": "Bowers, J. (2001) Crossing the line: a field study of inhabited television. BIT, 20(2), 127--140.",
      "doi": ""
    },
    {
      "text": "Broth, M. (2004) The Production of a live TV-interview through mediated interaction. In Proc. Int. Conference on Logic and Methodology. SISWO, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Cohen, K. R (2006). What does the photoblog want? Media, Culture&amp;Society, 27(6), 883--901",
      "doi": ""
    },
    {
      "text": "Engström, A., Esbjörnsson, M. and Juhlin, O. (2008) Mobile Collaborative Live Video Mixing. In Proc. ACM MobileHCI'2008, 157--166.  ",
      "doi": "10.1145/1409240.1409258"
    },
    {
      "text": "Garfinkel, H. and Wieder, D.L. (1992) Two incommensurable, asymmetrically alternate technologies of social analysis. In Watson&amp;Seiler (Eds) Text in context. Sage: London, 175--206.",
      "doi": ""
    },
    {
      "text": "Gaver, W. W. (1992). The affordances of media spaces for collaboration. In Proc. ACM CSCW, 17--24.  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Gillmor, D. (2004). We the media: grassroots journalism by the people, for the people. Sebastopol, CA: O'Reilly. ",
      "doi": "10.5555/1215573"
    },
    {
      "text": "Girgensohn, A. et al. (2000) A semi-automatic approach to home video editing. In Proc. ACM UIST, 81--89.  ",
      "doi": "10.1145/354401.354415"
    },
    {
      "text": "Gruneau, R. (1989) Making spectacle: A case study in television sports production. In Wenner (Ed.), Media, Sports and Society. Thousand Oaks, CA: Sage, 134--154.",
      "doi": ""
    },
    {
      "text": "Heath, C., Luff, P. and Svensson, M.S. (2002) Overseeing organizations: configuring action and its environment, Brit. Jnl. Sociology, 53(2), 181--201.",
      "doi": ""
    },
    {
      "text": "Holland, P. (2000) The Television Handbook, 2nd ed. London: Routledge.",
      "doi": ""
    },
    {
      "text": "Hua, X.S., Lu, L., et al (2003) AVE-Automated home video editing. In Proc. ACM Multimedia, 490--497.  ",
      "doi": "10.1145/957013.957121"
    },
    {
      "text": "Jordan, B. and Henderson, A. (1995) Interaction analysis: foundations and practice. Journal of the Learning Sciences, 4(1), 39--103.",
      "doi": ""
    },
    {
      "text": "Kirk, D., Crabtree, A. and Rodden, T. (2005) Ways of the Hands. In Proc. 9th Conf. on ECSCW, 1--21. ",
      "doi": "10.5555/1242029.1242030"
    },
    {
      "text": "Kirk, D., Sellen, A., Harper, R. and Wood, K. (2007) Understanding videowork. In Proc. ACM CHI, 61--70.  ",
      "doi": "10.1145/1240624.1240634"
    },
    {
      "text": "Krein, M.A. and Martin, S. (2006) 60 Seconds to Air: television sports production basics and research review. In Raney and Bryant (eds) Handbook of sports and media. LEA: NJ.",
      "doi": ""
    },
    {
      "text": "Luff, P. et al. (2003) Fractured Ecologies: Creating Environments for Collaboration. HCI, 18(1), 51--84  ",
      "doi": "10.1207/S15327051HCI1812_3"
    },
    {
      "text": "Luff, P. et al. (2004) Working Documents. In Aizawa, Nakamura, and Satoh (Eds.) PCM 2004, LNCS 3331, 81--88. Springer-Verlag: Berlin Heidelberg.  ",
      "doi": "10.1007/978-3-540-30541-5_11"
    },
    {
      "text": "Malone, P. (2004) TV News as narrative: the 'real' story. Ann. Meeting of Int. Comms. Assoc., New Orleans.",
      "doi": ""
    },
    {
      "text": "Millerson, G. (1999) Television Production. Woburn, MA: Focal Press.",
      "doi": ""
    },
    {
      "text": "Nardi, B.A. et al. (1993) Turning away from talking heads: the use of video-as-data in neurosurgery. In Proc. ACM CHI, 327--334.  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Ranjan, A. et al. (2008) Improving meeting capture by applying television production principles with audio and motion detection. In Proc ACM CHI, 227--236.  ",
      "doi": "10.1145/1357054.1357095"
    },
    {
      "text": "Real, M.R. (1975) Super bowl: mythic spectacle, Journal of Communication, 25(1), 31--43.",
      "doi": ""
    },
    {
      "text": "Silk, M., Slack, T.,&amp;Amis, J. (2000) Bread, butter, and gravy: an institutional approach to televised sport production. Culture, Sport, Society, 3, 1--21.",
      "doi": ""
    },
    {
      "text": "Tazaki, A. (2006) InstantShareCam: turning users from passive media consumers to active media producers. Workshop paper, CHI'06.",
      "doi": ""
    },
    {
      "text": "Tutt, D. et al. (2007) The distributed work of local action: interaction amongst virtually collocated research teams. In Proc. ECSCW, 199--218.",
      "doi": ""
    },
    {
      "text": "Verna, T. (1987) Live TV: an inside look at directing and producing. Focal Press: London.",
      "doi": ""
    },
    {
      "text": "Williams, B.R. (1977) The structure of televised football, Journal of Communication 27 (3), 133--139.",
      "doi": ""
    },
    {
      "text": "Yip, S., Leu, E. and Howe, H. (2003) The Automatic Video Editor. In Proc ACM Conf. Multimedia, 596--597.  ",
      "doi": "10.1145/957013.957138"
    }
  ]
}