{
  "doi": "10.1145/1518701.1518983",
  "title": "Evaluating existing audio CAPTCHAs and an interface optimized for non-visual use",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1829-1838",
  "year": 2009,
  "badges": [],
  "abstract": "Audio CAPTCHAs were introduced as an accessible alternative for those unable to use the more common visual CAPTCHAs, but anecdotal accounts have suggested that they may be more difficult to solve. This paper demonstrates in a large study of more than 150 participants that existing audio CAPTCHAs are clearly more difficult and time-consuming to complete as compared to visual CAPTCHAs for both blind and sighted users. In order to address this concern, we developed and evaluated a new interface for solving CAPTCHAs optimized for non-visual use that can be added in-place to existing audio CAPTCHAs. In a subsequent study, the optimized interface increased the success rate of blind participants by 59% on audio CAPTCHAs, illustrating a broadly applicable principle of accessible design: the most usable audio interfaces are often not direct translations of existing visual interfaces.",
  "tags": [
    "blind users",
    "non-visual interfaces",
    "audio captcha"
  ],
  "authors": [
    {
      "name": "Jeffrey P. Bigham",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Anna C. Cavender",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100369055",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexa web search - data services, 2008. http://www.alexa.com.",
      "doi": ""
    },
    {
      "text": "R. Atterer, M. Wnuk, and A. Schmidt. Knowing the user's every move - user activity tracking for website usability evaluation and implicit interaction. In Proc. of the 15th Intl. Conf. on World Wide Web (WWW '06), pages 203--212, New York, NY, 2006.  ",
      "doi": "10.1145/1135777.1135811"
    },
    {
      "text": "J. P. Bigham, M. B. Aller, J. T. Brudvik, J. O. Leung, L. A. Yazzolino, and R. Ladner. Inspiring blind high school students to pursue computer science with instant messenging chatbots. In Proc. of the 39th SIGCSE Tech. Symp. on Computer Science Education (SIGCSE '08), pages 449--453, Portland, OR, USA, 2008.  ",
      "doi": "10.1145/1352135.1352287"
    },
    {
      "text": "J. P. Bigham, A. C. Cavender, J. T. Brudvik, J. O. Wobbrock, and R. E. Ladner. Webinsitu: A comparative analysis of blind and sighted browsing behavior. In Proc. of the 9th Intl. ACM SIGACCESS Conf. on Computers and Accessibility (ASSETS '07), pages 51--58, Tempe, AZ, USA, 2008.  ",
      "doi": "10.1145/1296843.1296854"
    },
    {
      "text": "J. P. Bigham, T. Lau, and J. Nichols. TrailBlazer: Enabling blind web users to blaze trails through the web. In Proc. of the 12th Intl. Conf. on Intelligent User Interfaces (IUI '09), Sanibel Island, FL, USA, 2009.  ",
      "doi": "10.1145/1502650.1502677"
    },
    {
      "text": "K. Chellapilla, K. Larson, P. Y. Simard, and M. Czerwinski. Designing human friendly human interaction proofs (HIPS). In Proc. of Computer Human Interaction (CHI '05), pages 711--720, 2005.  ",
      "doi": "10.1145/1054972.1055070"
    },
    {
      "text": "P. B. Godfrey. Text-based captcha algorithms. In First Workshop on Human Interactive Proofs. Unpublished Manuscript, 2002. http://www.adaddin.cs.cmu.edu/hips/events/abs/godfreybabstract.pdf.",
      "doi": ""
    },
    {
      "text": "J. Holman, J. Lazar, J. H. Feng, and J. D'Arcy. Developing usable captchas for blind users. In Proc. of the 9th Intl. ACM SIGACCESS Conf. on Computers and accessibility (ASSETS '07), pages 245--246, New York, NY, USA, 2007.  ",
      "doi": "10.1145/1296843.1296894"
    },
    {
      "text": "G. Kochanski, D. Lopresti, and C. Shih. A reverse turing test using speech. In Proc. of the Intl. Conf. on Spoken Language Processing (ICSLP '02), pages 1357--1360, 2002.",
      "doi": ""
    },
    {
      "text": "R. C. Littell, G. A. Milliken, W. W. Stroup, and R. D. Wolnger. SAS System for Mixed Models. SAS Institute, Inc., Cary, North Carolina, USA, 1996.",
      "doi": ""
    },
    {
      "text": "J. Mahmud, Y. Borodin, and I. V. Ramakrishnan. CSurf: A context-driven non-visual web-browser. In Proc. of the Intl. Conf. on the World Wide Web (WWW '07), pages 31--40.  ",
      "doi": "10.1145/1242572.1242578"
    },
    {
      "text": "H. Miyashita, D. Sato, H. Takagi, and C. Asakawa. AiBrowser for multimedia: introducing multimedia content accessibility for visually impaired users. In Proc. of the 9th Intl. ACM SIGACCESS Conf. on Computers and accessibility (ASSETS '07), pages 91--98, New York, NY, USA, 2007.  ",
      "doi": "10.1145/1296843.1296860"
    },
    {
      "text": "Petrie, F. Hamilton, N. King, and P. Pavan. Remote usability evaluations with disabled people. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '06), pages 1133--1141, New York, NY, USA, 2006.  ",
      "doi": "10.1145/1124772.1124942"
    },
    {
      "text": "M. Pilgrim, editor. Greasemonkey Hacks: Tips&amp;Tools for Remixing the Web with Firefox. O'Reilly Media, 2005. ",
      "doi": "10.5555/1197850"
    },
    {
      "text": "I. V. Ramakrishnan, A. Stent, and G. Yang. Hearsay: Enabling audio browsing on hypertext content. In Proc. of the 13th Intl. Conf. on the World Wide Web (WWW '04), pages 80--89, New York, NY, USA 2004.  ",
      "doi": "10.1145/988672.988684"
    },
    {
      "text": "T. V. Raman. Auditory User Interfaces: Toward the Speaking Computer. Kluwer Academic Publishers, Boston, MA, 1997. ",
      "doi": "10.5555/523970"
    },
    {
      "text": "T. V. Raman. Emacspeak - A Speech Interface. In Proc. of the SIGCCHI Conf. on Human Factors in Computer Systems (CHI '96), pages 66--71, Vancouver, BC, Canada, 1996.  ",
      "doi": "10.1145/238386.238405"
    },
    {
      "text": "G. Sauer, H. Hochheiser, J. Feng, and J. Lazar. Towards a universally usable captcha. In Proc. of the 4th Symp. On Usable Privacy and Security (SOUPS '08), Pittsburgh, PA, USA, 2008.",
      "doi": ""
    },
    {
      "text": "C. Schuster and A. Von Eye. The relationship of ANOVA models with random effects and repeated measurement designs. Journal of Adolescent Research, 16(2):205--220, 2001.",
      "doi": ""
    },
    {
      "text": "J. Tam, J. Simsa, D. Huggins-Daines, L. von Ahn, and M. Blum. Improving audio captchas. In Proc. of the 4th Symp. on Usability, Privacy and Security (SOUPS '08), Pittsburgh, PA, USA, July 2008.",
      "doi": ""
    },
    {
      "text": "J. Thatcher, P. Bohman, M. Burks, S. L. Henry, B. Regan, S. Swierenga, M. D. Urban, and C. D. Waddell. Constructing Accessible Web Sites. glasshaus Ltd., Birmingham, UK, 2002. ",
      "doi": "10.5555/863710"
    },
    {
      "text": "L. von Ahn, M. Blum, and J. Langford. Telling humans and computers apart automatically: How lazy cryptographers do AI. Communications of the ACM, 47(2):57--60, February 2004.  ",
      "doi": "10.1145/966389.966390"
    },
    {
      "text": "T. Watanabe. Experimental evaluation of usability and accessibility of heading elements. In Proc. of the Intl. Cross-Disciplinary Conf. on Web Accessibility (W4A '07), pages 157--164, 2007.  ",
      "doi": "10.1145/1243441.1243473"
    },
    {
      "text": "WebVisum Firefox Extension, 2008. http://www.webvisum.com/.",
      "doi": ""
    },
    {
      "text": "Yahoo Accessibility Improvement Petition, 2008. http://www.petitiononline.com/yabvipma/.",
      "doi": ""
    }
  ]
}