{
  "doi": "10.1145/1518701.1518952",
  "title": "Bringing design considerations to the mobile phone and driving debate",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1643-1646",
  "year": 2009,
  "badges": [],
  "abstract": "Though legislation is increasingly discouraging drivers from holding on to their mobile phones while talking, hands-free devices do not improve driver safety. We offer two design alternatives to improve driver safety in the contexts of voice-based user interfaces and mobile phone conversations in cars' side tones (auditory feedback used in landline phones) and location of speakers. In a 2 (side tone: present vs. not) x 2 (location of speakers: headphones vs. dashboard) between-participants experiment (N=48), we investigated the impact of these features upon driver experience and performance on a simulated mobile phone conversation while driving. Participants became more verbally engaged in the conversation when side tones were present, but also experienced more cognitive load. Participants drove more safely when voices were projected from the dashboard rather than from headphones. Implications for driver user interface design are discussed.",
  "authors": [
    {
      "name": "Leila Takayama",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100499212/rel-imgonly/leila_recode_square.jpg",
      "acmid": "81100499212",
      "orcid": "missing"
    },
    {
      "name": "Jo Ann G. Sison",
      "institution": "Electronics Research Lab, Volkswagen, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659809766",
      "orcid": "missing"
    },
    {
      "name": "Brian Lathrop",
      "institution": "Electronics Research Lab, Volkswagen, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583210",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Wolfe",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607765",
      "orcid": "missing"
    },
    {
      "name": "Abe Chiang",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593887",
      "orcid": "missing"
    },
    {
      "name": "Alexia Nielsen",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416603174",
      "orcid": "missing"
    },
    {
      "name": "Clifford Nass",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153283",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baldis, J.J. Effects of spatial audio on memory, comprehension, and preference during desktop conferences. In Proc. CHI 2001, ACM Press (2001), 186--173.  ",
      "doi": "10.1145/365024.365092"
    },
    {
      "text": "Caird, J. K., Willness, C. R., Steel, P., and Scialfa, C. A meta-analysis of the effects of cell phones on driver performance. Accident Analysis&amp;Prevention 40, 4 (2008), 1282--1293.",
      "doi": ""
    },
    {
      "text": "Chang-Yit, R., Pick, H.L., and Siegel, G.M. Reliability of side tone amplification effect in vocal intensity. Journal of Communication Disorders, 8, (1975), 317--324.",
      "doi": ""
    },
    {
      "text": "Guéguin, M., Le Bouquin-Jeannès, R., Gautier-Turbin, V., Faucon, G., and Barriac, V. (2008). On the evaluation of the conversational speech quality in telecommunications. EURASIP Journal on Advances in Signal Processing, 1--15.  ",
      "doi": "10.1155/2008/185248"
    },
    {
      "text": "Lamble, D., Kauranen, L., Laakso, M., and Summala, H. Cognitive load and detection thresholds in car following situations: Safety implications for using mobile (cellular) telephones while driving. Accident Analysis&amp;Prevention, 31, (1999) 617--623.",
      "doi": ""
    },
    {
      "text": "Lane, H. L., Catania, A. C., and Stevens, S. S. Voice level: Autophonic scale, perceived loudness, and effects of side tone. Journal of the Acoustical Society of America 33, (1961), 160--167.",
      "doi": ""
    },
    {
      "text": "Manalavan, P., Samar, A., Schneider, M., Kiesler, S., and Siewiorek, D. In-car cell phone use: Mitigating risk by signally remote callers. In Proc. CHI 2002, ACM Press (2002), 790--791.  ",
      "doi": "10.1145/506443.506599"
    },
    {
      "text": "Martin, R.R., Diegel, G.M., Johnson, L.J., and Haroldson, S.K. Side tone amplification, noise, and stuttering. Journal of Speech and Hearing Research, 27, (1983), 518--527.",
      "doi": ""
    },
    {
      "text": "NASA TLX. http://humansystems.arc.nasa.gov/groups/TLX/",
      "doi": ""
    },
    {
      "text": "Nass, C. and Brave, S. Wired for Speech. MIT Press, Cambridge, MA, USA, 2005.",
      "doi": ""
    },
    {
      "text": "Poysti, L., Rajalin, S., and Summala, H. Factors influencing the use of cellular (mobile) phone during driving and hazards while using it. Accident Analysis&amp;Prevention, 37, (2005), 47--51.",
      "doi": ""
    },
    {
      "text": "Sánchez, J. and Sáenz, M. (2005). 3D Sound Interactive Environments for Problem Solving. In Proc. Assets '05. ACM Press (2005), 173--179.  ",
      "doi": "10.1145/1090785.1090817"
    },
    {
      "text": "Shinar, D. Traffic Safety and Driver Behavior. Elsevier, Amsterdam, Netherlands, 2007.",
      "doi": ""
    },
    {
      "text": "Strayer, D. L. and Drews, F. A. Cell-phone-induced driver distraction. Current Directions in Psychological Science 16, (2007), 128--131.",
      "doi": ""
    },
    {
      "text": "Tabachnik, B.G. and Fidell, L. S. Using Multivariate Statistics. Allyn and Bacon, Boston, MA, USA, 2000. ",
      "doi": "10.5555/1213888"
    },
    {
      "text": "Wang, Q. and Nass, C. Less visible and wireless. In Proc. CHI 2005, ACM Press (2005), 809--818.  ",
      "doi": "10.1145/1054972.1055086"
    }
  ]
}