{
  "doi": "10.1145/1518701.1518869",
  "title": "PhotoScope: visualizing spatiotemporal coverage of photos for construction management",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1103-1112",
  "year": 2009,
  "badges": [],
  "abstract": "PhotoScope visualizes the spatiotemporal coverage of photos in a photo collection. It extends the standard photo browsing paradigm in two main ways: visualizing spatial coverage of photos, and indexing photos by a combination of spatial coverage, time, and content specifications. This approach enables users to browse and search space- and time-indexed photos more effectively. We designed PhotoScope specifically to address challenges in the construction management industry, where large photo collections are amassed to document project progress. These ideas may also apply to any photo collection that is spatially constrained and must be searched using spatial, temporal, and content criteria. We describe the design choices made when developing PhotoScope and the results of user evaluation.",
  "authors": [
    {
      "name": "Fuqu Wu",
      "institution": "University of Victoria, Victoria, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361596860",
      "orcid": "missing"
    },
    {
      "name": "Melanie Tory",
      "institution": "University of Victoria, Victoria, BC, Canada",
      "img": "/do/10.1145/contrib-81100424672/rel-imgonly/melanie_cropped.jpg",
      "acmid": "81100424672",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abeid, J., Allouche, E., Arditi, D., and Hayman, M. PHOTO-NET II: a computer-based monitoring system applied to project management. Automation in Construction, 12 (2003) 603--616.",
      "doi": ""
    },
    {
      "text": "Ahlberg, C., Williamson, C., and Shneiderman, B. 1992. Dynamic queries for information exploration: an implementation and evaluation. CHI 1992, 619--626.  ",
      "doi": "10.1145/142750.143054"
    },
    {
      "text": "Anabuki, M. and Ishii, H. 3D and Sequential Representations of Spatial Relationships among Photos. CHI 2006, 472--477.  ",
      "doi": "10.1145/1125451.1125555"
    },
    {
      "text": "de Berg, M., van Kreveld, M., Overmars, M. and Schwarzkopf, O. Computational Geometry. Second edition. Springer-Verlag Press, 2000, pp. 1--8.",
      "doi": ""
    },
    {
      "text": "Brilakis, I., and Soibelman, L. Content-Based Search Engines for construction image databases. Automation in Construction, 14 (2005), 537--550.",
      "doi": ""
    },
    {
      "text": "Brilakis, I., and Soibelman, L. Multimodal Image Retrieval from Construction Databases and Model-Based Systems. J. Construction Engineering and Management, 132, 7 (2006), 777--785.",
      "doi": ""
    },
    {
      "text": "Brilakis, I., Soibelman, L., and Shinagawa, Y. Material-Based Construction Site Image Retrieval. J. Computing in Civil Engineering, 19, 4 (2005), 341--355.",
      "doi": ""
    },
    {
      "text": "Brilakis, I.K., Soibelman, L., and Shinagawa, Y. Construction site image retrieval based on material cluster recognition. Advanced Engineering Informatics, 20 (2006), 443--452.",
      "doi": ""
    },
    {
      "text": "Card, S., Mackinlay, J., and Shneiderman, B. Readings in Information Visualization. Morgan Kaufman, 1999. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Chau, K.W. Application of a PSO--based neural network in analysis of outcomes of construction claims. Automation in Construction, 16 (2007), 642--646.",
      "doi": ""
    },
    {
      "text": "Chen, H., Atabakhsh, H., Tseng, C., Marshall, B., Kaza, S., Eggers, S., Gowda, H. Shah, A., Petersen, T. and Violette, C. Visualization in Law Enforcement. Posters, CHI 2005, 1268--1271.  ",
      "doi": "10.1145/1056808.1056893"
    },
    {
      "text": "Creswell, J.W. Educational Research: Planning, conducting, and evaluating quantitative and qualitative research. Second edition, pp. 202--230.",
      "doi": ""
    },
    {
      "text": "CSI: The Construction Specifications Institute. http://www.csinet.org.",
      "doi": ""
    },
    {
      "text": "Cormen, T.H., Leiserson, C.E. and Rivest, R.L. Introduction to Algorithms, pp. 887--897. ",
      "doi": "10.5555/80156"
    },
    {
      "text": "Flickr. http://www.flickr.com",
      "doi": ""
    },
    {
      "text": "Graham, A., Garcia-Molilna, H., Paepcke, A. And Winograd, T. Time as Essence for Photo Browsing Through Personal Digital Libraries. JCDL'02.  ",
      "doi": "10.1145/544220.544301"
    },
    {
      "text": "Harada, S., Naaman, M., Song, Y.J., Wang, Q. and Paepcke, A. Lost in Memories: Interacting with Photo Collections on PDAs. JCDL '04.  ",
      "doi": "10.1145/996350.996425"
    },
    {
      "text": "Huynh, D. F., Drucker, S. M., Baudisch, P., and Wong, C. Time quilt: scaling up zoomable photo browsers for large, unstructured photo collections. In CHI 2005 Extended Abstracts, 1937--1940.  ",
      "doi": "10.1145/1056808.1057061"
    },
    {
      "text": "Kandel, S., Abelson, E., Garcia-Molina, H., Paepcke, A. And TheoBald, M. PhotoSpread: A Spreadsheet for Managing Photos. In CHI 2008, 1749--1758.  ",
      "doi": "10.1145/1357054.1357327"
    },
    {
      "text": "Kapler, T. and Wright, W. GeoTime Information Visualization. IEEE Information Visualization 2004, 25--32.  ",
      "doi": "10.5555/1038262.1038778"
    },
    {
      "text": "Kim, H. and Kano, N. Comparison of construction photograph and VR image in construction progress. Automation in Construction, 17 (2008), 137--143.",
      "doi": ""
    },
    {
      "text": "Mehler, A., Bao, Y., Li, X., Wang, Y. and Skiena, S. Spatial Analysis of News Sources. In IEEE Trans. Visualization and Computer Graphics 12,5 (2006), 765--772.  ",
      "doi": "10.1109/TVCG.2006.179"
    },
    {
      "text": "Microsoft Office Project. http://office.microsoft.com/en-us/project",
      "doi": ""
    },
    {
      "text": "Picasa. http://picasa.google.com",
      "doi": ""
    },
    {
      "text": "Pongnumkul, S., Wang, J., and Cohen, M. Creating map-based storyboards for browsing tour videos. In User interface Software and Technology (UIST) 2008.  ",
      "doi": "10.1145/1449715.1449720"
    },
    {
      "text": "Shanbhag, P., Rheingans, P. and desJardins, M. Temporal Visualization of Planning Polygons for Efficient Partitioning of Geo-Spatial Data. In IEEE Information Visualization 2005, 211--218.  ",
      "doi": "10.1109/INFOVIS.2005.32"
    },
    {
      "text": "Snavely, N., Seitz, S. M., and Szeliski, R. 2006. Photo tourism: exploring photo collections in 3D. In SIGGRAPH '06. ACM, 835--846.  ",
      "doi": "10.1145/1179352.1141964"
    },
    {
      "text": "Tanaka, H., Arikawa, M. and Shibasaki, R. A 3-D Photo Collage System for Spatial Navigations. Springer-Verlag Berlin Heidelberg, 2002, pp. 305--316.",
      "doi": ""
    },
    {
      "text": "TCL/TK. http://www.tcl.tk/",
      "doi": ""
    },
    {
      "text": "Ware, C. Information Visualization: Perception for Design. Second Edition. Elsevier, 2004, p. 129. ",
      "doi": "10.5555/983611"
    },
    {
      "text": "Wood, J., Dykes, J., Slingsby, A. and Clarke, K. Interactive Visual Exploration of a Large Spatio-Temporal Dataset: Reflections on a Geovisualization Mashup. In IEEE Trans. Visualization and Computer Graphics 13,6 (2007), 1176--1183.  ",
      "doi": "10.1109/TVCG.2007.70570"
    },
    {
      "text": "Yuri, A., Wren, C., Sorokin, A. and Kaur, I. Visualizing the History of Living Spaces. In IEEE Information Visualization, 13,6 (2007), 1153--1160.  ",
      "doi": "10.1109/TVCG.2007.70621"
    }
  ]
}