{
  "doi": "10.1145/1518701.1518820",
  "title": "mimir: a market-based real-time question and answer service",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "769-778",
  "year": 2009,
  "badges": [],
  "abstract": "Community-based question and answer (Q&A) systems facilitate information exchange and enable the creation of reusable knowledge repositories. While these systems are growing in usage and are changing how people find and share information, current designs are inefficient, wasting the time and attention of their users. Furthermore, existing systems do not support signaling and screening of joking and non-serious questions. Coupling Q&A services with instant and text messaging for faster questions and answers may exacerbate these issues, causing Q&A services to incur high interruption costs on their users. In this paper we present the design and evaluation of a market-based real-time Q&A system. We compared its use to a similar Q&A system without a market. We found that while markets can reduce wasted resources by reducing the number of less important questions and low quality answers, it may also reduce the socially conducive questions and usages that are vital to sustaining a Q&A community.",
  "tags": [
    "market",
    "q&a",
    "question and answer",
    "synchronous"
  ],
  "authors": [
    {
      "name": "Gary Hsieh",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    },
    {
      "name": "Scott Counts",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398596",
      "orcid": "0000-0003-1507-5200"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. S. and Palen, L. 1996. The Zephyr Help Instance: promoting ongoing activity in a CSCW system. In Proceedings of the SIGCHI, pp. 268--275.  ",
      "doi": "10.1145/238386.238528"
    },
    {
      "text": "Deci, E. L., Koestner, R.,&amp;Ryan, R. M. 1999. A meta-analytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological Bulletin, 125, pp. 627--668.",
      "doi": ""
    },
    {
      "text": "Edelman, B. Earnings and Ratings at Google Answers. 2004. Unpublished Manuscript.",
      "doi": ""
    },
    {
      "text": "Google questions need for Google Answers http://www.computerworld.com/action/article.do?command=viewArticleBasic&articleId=9005481&intsrc=hm_list",
      "doi": ""
    },
    {
      "text": "Gneezy, U. and Rustichini, A., 2000. Pay Enough Or Don'T Pay At All. The Quarterly Journal of Economics, MIT Press, vol. 115(3), pp. 791--810.",
      "doi": ""
    },
    {
      "text": "Gneezy, U., and Rustichini, A. A Fine is a Price. 2000 Journal of Legal Studies, vol. XXIX, 1, part 1, pp. 1--18.",
      "doi": ""
    },
    {
      "text": "Harper, F. M., Raban, D., Rafaeli, S., and Konstan, J. A. 2008. Predictors of answer quality in online Q&A sites. In Proceeding of the SIGCHI, pp. 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Hsieh, G., Kraut, R., Hudson, S.E., Weber, R. 2008. Can Markets Help?: Applying Market Mechanisms to Improve Synchronous Communication. In Proceeding of CSCW. pp. 535--544.  ",
      "doi": "10.1145/1460563.1460648"
    },
    {
      "text": "Janes, J., Hill, C., and Rolfe, A. Ask-an-Expert Services Analysis. 2001. Journal of the American Society for Information Science and Technology 52, 13 pp. 1106--1121.  ",
      "doi": "10.1002/asi.1177"
    },
    {
      "text": "Kraut, R. E., Fish, R., Root, R.,&amp;Chalfonte, B. 1990. Informal communication in organizations: Form, function, and technology. In Human reactions to technology: Claremont symposium on applied social psychology, pp. 145--199.",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., Sunder, S., Telang, R.,&amp;Morris, J. 2005. Pricing electronic mail to solve the problem of spam. Human Computer Interaction, 20, pp. 195--223.  ",
      "doi": "10.1207/s15327051hci2001%25262_7"
    },
    {
      "text": "Leibenluft, J. 2007. A Librarian's Worst Nightmare: Yahoo! Answers, where 120 million users can be wrong. Slate Magazine, Dec. 7, 2007.",
      "doi": ""
    },
    {
      "text": "Ling, K., et al. 2005. Using social psychology to motivate contributions to online communities. Journal of Computer-Mediated Communication, 10(4), article 10.",
      "doi": ""
    },
    {
      "text": "Pomerantz, J., Nicholson, S., Belanger, Y., Lankes, R. D. 2004. The Current State of Digital Reference. Information Processing and Management 40, 2, pp. 347--363.  ",
      "doi": "10.1016/S0306-4573%2802%2900085-7"
    },
    {
      "text": "Rafaeli, S., Raban, D., Ravid, G. 2007. How Social Motivation Enhances Economic Activity and Incentives in the Google Answers Knowledge Sharing Market. International Journal of Knowledge and Learning 3, 1, pp. 1--11.",
      "doi": ""
    },
    {
      "text": "Reeves, B., Roy, S., Gorman, B., Morley, T. 2008. A Marketplace for Attention: Responses to Synthetic Currency Used to Signal Information Importance in E-mail. Peer-Reviewed Journal On the Internet. First Monday, Volume 13 Number 5 - 5 May 2008.",
      "doi": ""
    },
    {
      "text": "van Zandt, T. (2004). Information Overload in a Network of Targeted Communication. RAND Journal of Economics, 35 (3), 542--560.",
      "doi": ""
    },
    {
      "text": "Weisz, J. D., Erickson, T., Kellogg, W. A. 2006. Synchronous broadcast messaging: the use of ICT. In Proceedings of SIGCHI, pp. 1293--1302.  ",
      "doi": "10.1145/1124772.1124967"
    }
  ]
}