{
  "doi": "10.1145/1518701.1519009",
  "title": "From x-rays to silly putty via Uranus: serendipity and its role in web search",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2033-2036",
  "year": 2009,
  "badges": [],
  "abstract": "The act of encountering information unexpectedly has long been identified as valuable, both as a joy in itself and as part of task-focused problem solving. There has been a concern that highly accurate search engines and targeted personalization may reduce opportunities for serendipity on the Web. We examine whether there is the potential for serendipitous encounters during Web search, and whether improving search relevance through personalization reduces this potential. By studying Web search query logs and the results people judge relevant and interesting, we find many of the queries people perform return interesting (potentially serendipitous) results that are not directly relevant. Rather than harming serendipity, personalization appears to identify interesting results in addition to relevant ones.",
  "tags": [
    "partially relevant results",
    "personalization",
    "serendipity",
    "web search"
  ],
  "authors": [
    {
      "name": "Paul André",
      "institution": "University of Southampton, Southampton, United Kingdom",
      "img": "/do/10.1145/contrib-81351602292/rel-imgonly/metprofile.jpg",
      "acmid": "81351602292",
      "orcid": "missing"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, VA, USA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Susan T. Dumais",
      "institution": "Microsoft Research, Redmond, VA, USA",
      "img": "/do/10.1145/contrib-81100134501/rel-imgonly/sdumais02.jpg",
      "acmid": "81100134501",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "De Bruijn, O.&amp;Spence, R. A new framework for theory-based interaction design applied to serendipitous information retrieval, ACM TOCHI 15,1 (2008), 1--38.  ",
      "doi": "10.1145/1352782.1352787"
    },
    {
      "text": "Erdelez, S. Information encountering: It's more than just bumping into information, Bulletin of the American Society for Information Science 25,3(1999) 25--29.",
      "doi": ""
    },
    {
      "text": "Erdelez, S. Investigation of information encountering in the controlled research environment, Information Processing and Management 40,6 (2004), 1013--1025.  ",
      "doi": "10.1016/j.ipm.2004.02.002"
    },
    {
      "text": "Foster, A.&amp;Ford, N. Serendipity and information seeking: An empirical study, J. Documentation 59,3 (2003) 321--340.",
      "doi": ""
    },
    {
      "text": "Herlocker, J. L., Konstan, J. A., Terveen, L. G.&amp;Riedl, J. T. Evaluating collaborative filtering recommender systems, ACM TOIS 22, 1 (2004), 5--53.  ",
      "doi": "10.1145/963770.963772"
    },
    {
      "text": "Johnson, S. B. (2006), Can we please kill this meme now. Retrieved 14 Sep 2008: http://tinyurl.com/sbjohnson",
      "doi": ""
    },
    {
      "text": "McKeen, W. (2006), The endangered joy of serendipity, St. Petersburg Times Retrieved Sep 2008 http://tinyurl.com/mckeen",
      "doi": ""
    },
    {
      "text": "Ranie, L.&amp;Shermak, J. (2005), Pew Internet and American Life Project: Data memo on search engine use. Retrieved 14 Sep 2008: http://pewinternet.org/pdfs/PIP_SearchData_1105.pdf",
      "doi": ""
    },
    {
      "text": "Sarwar, B., Karypis, G., Konstan, J.&amp;Reidl, J. Item-based collaborative filtering recommendation algorithms, Proc WWW '01, 285--295.  ",
      "doi": "10.1145/371920.372071"
    },
    {
      "text": "Shen, X., Tan, B.&amp;Zhai, C. Implicit user modeling for personalized search, Proc CIKM'05 824--831.  ",
      "doi": "10.1145/1099554.1099747"
    },
    {
      "text": "Spink, A., Greisdorf, H.&amp;Bateman, J. From highly relevant to not relevant: Examining different regions of relevance, IP&M 34, 5 (1998), 599--621.  ",
      "doi": "10.1016/S0306-4573%2898%2900025-9"
    },
    {
      "text": "Teevan, J., Dumais, S.T.&amp;Horvitz, E. Beyond the commons: on the value of personalizing Web search. Proc PIA'05, 84--92.",
      "doi": ""
    },
    {
      "text": "Teevan, J., Dumais, S.T.&amp;Horvitz, E. Personalizing search via automated analysis of interests and activities, Proc SIGIR '05, 449--456.  ",
      "doi": "10.1145/1076034.1076111"
    },
    {
      "text": "Toms, E. Serendipitous information retrieval, Proc of the First DELOS Network of Excellence Workshop on Information Seeking, Searching and Querying in Digital Libraries, 2000.",
      "doi": ""
    },
    {
      "text": "Van Andel, P. Anatomy of the Unsought Finding. Serendipity: Origin, history, domains, traditions, appearances, patterns and programmability, The British Journal for the Philosophy of Science45, 2 (1994), 631--648.",
      "doi": ""
    },
    {
      "text": "Wolfe, M., Schreiner, M., Rehder, B., Laham, D., Foltz, P., Kintsch, W.&amp;Landauer, T. Learning from text: Matching readers and texts by Latent Semantic Analysis, Discourse Processes 25, (1998) 309--336.",
      "doi": ""
    },
    {
      "text": "Ziegler, C., McNee, S.M., Konstan, J.A.&amp;Lausen, G. Improving recommendation lists through topic diversification, Proc. WWW '05 22--32.  ",
      "doi": "10.1145/1060745.1060754"
    }
  ]
}