{
  "doi": "10.1145/1518701.1518839",
  "title": "Awareness, training and trust in interaction with adaptive spam filters",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "909-912",
  "year": 2009,
  "badges": [],
  "abstract": "Even though adaptive (trainable) spam filters are a common example of systems that make (semi-)autonomous decisions on behalf of the user, trust in these filters has been underexplored. This paper reports a study of usage of spam filters in the daily workplace and user behaviour in training these filters (N=43). User observation, interview and survey techniques were applied to investigate attitudes towards two types of filters: a user-adaptive (trainable) and a rule-based filter. While many of our participants invested extensive effort in training their filters, training did not influence filter trust. Instead, the findings indicate that users' filter awareness and understanding seriously impacts attitudes and behaviour. Specific examples of difficulties related to awareness of filter activity and adaptivity are described showing concerns relevant to all adaptive and (semi-)autonomous systems that rely on explicit user feedback.",
  "authors": [
    {
      "name": "Henriette S.M. Cramer",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487965",
      "orcid": "missing"
    },
    {
      "name": "Vanessa Evers",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/do/10.1145/contrib-81100133286/rel-imgonly/vanessa-1.jpg",
      "acmid": "81100133286",
      "orcid": "missing"
    },
    {
      "name": "Maarten W. van Someren",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100326290",
      "orcid": "missing"
    },
    {
      "name": "Bob J. Wielinga",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100478624",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alpert S.R., Karat J., Karat C., Brodie C. and Vergo J.G. User attitudes regarding a user-adaptive e-Commerce web site. UMUAI 13, 4 (2003), 373--396.  ",
      "doi": "10.1023/A%3A1026201108015"
    },
    {
      "text": "Cramer H., Evers V., Van Someren, M., Ramlal, S., Rutledge, L., Stash, N., Aroyo, L. and Wielinga, B. The effects of transparency on trust and acceptance in interaction with a content-based art recommender. UMUAI 18, 5 (2008), 455--496.  ",
      "doi": "10.1007/s11257-008-9051-3"
    },
    {
      "text": "Dzindolet M., Peterson S.A., Pomranky R.A., Pierce L.G. and Beck H.P. The role of trust in automation reliance. Int. J. Hum-Comp Stud 58, 6 (2003), 697--718.  ",
      "doi": "10.1016/S1071-5819%2803%2900038-7"
    },
    {
      "text": "Fogg, B.J. and Tseng, H. The Elements of Computer Credibility. In Proc. CHI'99, ACM Press (1999), 80--87.  ",
      "doi": "10.1145/302979.303001"
    },
    {
      "text": "Herlocker, J.L., Konstan, J.A., Terveen, L.G. and Riedl, J.T. Evaluating collaborative filtering recommender systems. ACM Trans. Inform. Syst. 22, 1 (2004), 5--53.  ",
      "doi": "10.1145/963770.963772"
    },
    {
      "text": "Lee J.D. and See K.A. Trust in automation: designing for appropriate reliance. Hum. Fact 42, 1 (2004), 50--80.",
      "doi": ""
    },
    {
      "text": "Jameson, A. and Schwarzkopf, E. Pros and Cons of Controllability. In Proc. AH'02 (2002), 193--202. ",
      "doi": "10.5555/647458.728231"
    },
    {
      "text": "Jian, J.Y., Bisantz, A.M., and Drury, C.G. Foundations for an Empirically Determined Scale of Trust in Automated Systems. Int. J. Cog. Erg. 4, 1 (2000), 53--71.",
      "doi": ""
    },
    {
      "text": "Jøsang, A. and Lo Presti, S. Analysing the relationship between risk and trust. In Proc. Trust Man. (2004).",
      "doi": ""
    },
    {
      "text": "Maes, P. Agents that reduce work and information overload. CACM 37, 7 (1994), 30--40.  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Muir B.M. and Moray N. Trust in automation. Part II. Ergonomics 39, (1996), 429--460.",
      "doi": ""
    },
    {
      "text": "Sinha, R. and Swearingen, K. The role of transparency in recommender systems. In Proc CHI'02, ACM Press (2002), 830--831.  ",
      "doi": "10.1145/506443.506619"
    },
    {
      "text": "Tullio, J., Dey, A. K., Chalecki, J., and Fogarty, J. How it works: a field study of non-technical users interacting with an intelligent system. In Proc. CHI'07, ACM Press (2007), 31--40.  ",
      "doi": "10.1145/1240624.1240630"
    },
    {
      "text": "Venkatesh, V., Morris, M.G., Davis, G.B. and Davis, F.D. User Acceptance of Information Technology. MIS Quarterly 27, 3 (2003), 425--478. ",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Victor, P., Cornelis, C., De Cock, M., da Silva, P.P. Gradual Trust and Distrust in Recommender Systems. Fuzzy Sets and Systems (In Press).  ",
      "doi": "10.1016/j.fss.2008.11.014"
    },
    {
      "text": "Waern, A. User Involvement in Automatic Filtering: an Experimental Study. UMUAI 14, 2-3(2004), 201--237.  ",
      "doi": "10.1023/B%3AUSER.0000028984.13876.9b"
    }
  ]
}