{
  "doi": "10.1145/1518701.1518965",
  "title": "Baby steps: evaluation of a system to support record-keeping for parents of young children",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1713-1722",
  "year": 2009,
  "badges": [],
  "abstract": "Parents of young children often want to keep a variety of records on their children's early years, for the purposes of preservation of memories or at the request of their pediatrician. However, time constraints, motivation, and forgetfulness may hinder their ability to keep consistent records. We developed a system, Baby Steps, which is designed to improve the record-keeping process. In this paper, we present the results of a 3-month deployment study of this technology with 8 families and their pediatricians. The study showed that when compared to a control condition, experimental design features of Baby Steps encouraged parents to more frequently collect and review records, provided higher confidence in reporting, and improved parent-pediatrician communication.",
  "tags": [
    "families",
    "developmental delay",
    "children",
    "decision support",
    "real world deployment",
    "health",
    "field trial"
  ],
  "authors": [
    {
      "name": "Julie A. Kientz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548025762/rel-imgonly/kientz-headshot-small.png",
      "acmid": "81548025762",
      "orcid": "missing"
    },
    {
      "name": "Rosa I. Arriaga",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100177483",
      "orcid": "missing"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D. The Family Video Archive: An annotation and browsing environment for home movies. In Proc. of MIR '03. 2003.  ",
      "doi": "10.1145/973264.973266"
    },
    {
      "text": "Bowman, M. A., Herndon, A., Sharp, P. C.,&amp;Dignan, M. B. Assessment of the patient-doctor interaction scale for measuring patient satisfaction. Patient Educ. Couns. pp. 75--80. 1992.",
      "doi": ""
    },
    {
      "text": "Brassard, M.,&amp;Ritter, D. Memory Jogger II. Methuen, Mass: GOAL/QPC. 1996.",
      "doi": ""
    },
    {
      "text": "Bricker, D.D., Squires, J., Potter, L.W.,&amp;Twombly, R.E. Ages&amp;Stages Questionnaires (ASQ): A Parent-Completed, Child-Monitoring System. Paul H. Brookes Publishing CO. 1999.",
      "doi": ""
    },
    {
      "text": "Brush, A.B.,&amp;Inkpen, K. Yours, Mine and Ours? Sharing and Use of Technology in Domestic Environments. In Proc. of Ubicomp '07. 2007. ",
      "doi": "10.5555/1771592.1771599"
    },
    {
      "text": "Cohen, J. (1988). Statistical power analysis for the behavioral sciences (2nd ed.). Hillsdale, NJ: Lawrence Earlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Roessler, P.,&amp;Shelton, B. The CareNet Display: Lessons Learned from an In Home Evaluation of an Ambient Display. In Proc. of Ubicomp '04. 2004.",
      "doi": ""
    },
    {
      "text": "Dahl, J., Scharf, G.,&amp;Francl, L. Tumblon. Retrieved September 2008, from Tumblon: http://tumblon.com",
      "doi": ""
    },
    {
      "text": "Dalsgaard, T. et al. Mediated intimacy in families: understanding the relation between children and parents. In Proc. of Interaction Design and Children. 2006.  ",
      "doi": "10.1145/1139073.1139110"
    },
    {
      "text": "Fell, H., Cress, C., MacAuslan, J.,&amp;Ferrier, L. visiBabble for reinforcement of early vocalization. In Proc. of Accessibility and Computing. 2004.  ",
      "doi": "10.1145/1028630.1028659"
    },
    {
      "text": "Foucault, B.E. Designing Technology for Growing Families. Technology@Intel Magazine. 2005.",
      "doi": ""
    },
    {
      "text": "Frohlich, D.,&amp;Murphy, R. The Memory Box. Personal and Ubiquitous Computing. 2000.  ",
      "doi": "10.1007/PL00000011"
    },
    {
      "text": "Hayes, G.R. et al. Opportunities for Pervasive Computing in Chronic Cancer Care. In Proc. of Pervasive 2008. pp. 262--279.  ",
      "doi": "10.1007/978-3-540-79576-6_16"
    },
    {
      "text": "Hayes, G.R. et al. Experience buffers: a socially appropriate, selective archiving tool for evidence-based care. In Ext. Abst. of CHI '05. 2005.  ",
      "doi": "10.1145/1056808.1056935"
    },
    {
      "text": "Hutchinson, H., et al. Technology probes: inspiring design for and with families. In Proc. of CHI '03. pp. 17--24. 2003.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Kientz, J.A., et al. Grow and Know: Understanding Record-Keeping Needs for the Development of Young Children. In Proc. of CHI '07. 2007.  ",
      "doi": "10.1145/1240624.1240830"
    },
    {
      "text": "Khan, V. and Markopoulos, P. 2009. Busy families' awareness needs. Int. J. Hum.-Comput. Stud. 67, 2 (Feb. 2009), 139--153.  ",
      "doi": "10.1016/j.ijhcs.2008.09.006"
    },
    {
      "text": "Mamykina, L.,&amp;Mynatt, E.D. Role of Community Support in Coping with Chronic Diseases: A Case Study of Diabetes Support Group. HCI International. 2005.",
      "doi": ""
    },
    {
      "text": "Morris, M., Intille, S.S.,&amp;Beaudin, J.S. Embedded Assessment: Overcoming Barriers to Early Detection with Pervasive Computing. In Proc. of Pervasive 2005.  ",
      "doi": "10.1007/11428572_20"
    },
    {
      "text": "Neustaedter, C.,&amp;Brush, A.J. \"LINC-ing\" the family: the participatory design of an inkable family calendar. In Proc. of CHI '06. pp. 141--150. 2006.  ",
      "doi": "10.1145/1124772.1124796"
    },
    {
      "text": "Roy, D. et al. The Human Speechome Project. Cognitive Science, pp. 192--196. 2006.  ",
      "doi": "10.1007/11880172_15"
    },
    {
      "text": "Shore, R. Rethinking the Brain: New Insights Into Early Development. Families and Work Institute. 1997.",
      "doi": ""
    },
    {
      "text": "Stevens, M.M. et al. Getting into the Living Memory Box: Family archives&amp;holistic design. Personal and Ubiquitous Computing, 2003.  ",
      "doi": "10.1007/s00779-003-0220-4"
    },
    {
      "text": "Virtualsoft, Inc. Baby Album. 2008.",
      "doi": ""
    },
    {
      "text": "Westeyn, T.L. et al, Designing Toys with Automatic Play Characterization for Supporting the Assessment of a Child's Development. Workshop at IDC '08.  ",
      "doi": "10.1145/1463689.1463726"
    }
  ]
}