{
  "doi": "10.1145/1518701.1518779",
  "title": "SLAP widgets: bridging the gap between virtual and physical controls on tabletops",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "481-490",
  "year": 2009,
  "badges": [],
  "abstract": "We present Silicone iLluminated Active Peripherals (SLAP), a system of tangible, translucent widgets for use on multitouch tabletops. SLAP Widgets are cast from silicone or made of acrylic, and include sliders, knobs, keyboards, and buttons. They add tactile feedback to multi-touch tables, improving input accuracy. Using rear projection, SLAP Widgets can be relabeled dynamically, providing inexpensive, battery-free, and untethered augmentations. Furthermore, SLAP combines the flexibility of virtual objects with physical affordances. We evaluate how SLAP Widgets influence the user experience on tabletops compared to virtual controls. Empirical studies show that SLAPWidgets are easy to use and outperform virtual controls significantly in terms of accuracy and overall interaction time.",
  "authors": [
    {
      "name": "Malte Weiss",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414605252",
      "orcid": "missing"
    },
    {
      "name": "Julie Wagner",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659800930",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Jansen",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81414616215/rel-imgonly/isir_photo_booth_dec_2019_carre_e.jpg",
      "acmid": "81414616215",
      "orcid": "missing"
    },
    {
      "name": "Roger Jennings",
      "institution": "University of California, San Diego, San Diego, CA,USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322497024",
      "orcid": "missing"
    },
    {
      "name": "Ramsin Khoshabeh",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416596430",
      "orcid": "missing"
    },
    {
      "name": "James D. Hollan",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332504463",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "H. Benko, A. D. Wilson, and P. Baudisch. Precise selection techniques for multi-touch screens. In CHI '06: Proceedings of the SIGCHI conference on Human Factors in computing systems, pages 1263--1272, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "F. Block, M. Haller, H. Gellersen, C. Gutwin, and M. Billinghurst. VoodooSketch: extending interactive surfaces with adaptable interface palettes. In TEI '08: Proceedings of the 2nd international conference on Tangible and embedded interaction, pages 55--58, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1347390.1347404"
    },
    {
      "text": "P. L. Davidson and J. Y. Han. Synthesis and control on large scale multi-touch sensing displays. In NIME '06: Proceedings of the 2006 conference on New interfaces for musical expression, pages 216--219, Paris, France, France, 2006. IRCAM - Centre Pompidou. ",
      "doi": "10.5555/1142215.1142269"
    },
    {
      "text": "G. W. Fitzmaurice, H. Ishii, and W. A. S. Buxton. Bricks: laying the foundations for graspable user interfaces. In CHI '95: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 442--449, New York, NY, USA, 1995. ACM Press/Addison-Wesley Publishing Co.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "J. Y. Han. Low-cost multi-touch sensing through frustrated total internal reflection. In UIST '05: Proceedings of the 18th annual ACM symposium on User interface software and technology, pages 115--118, New York, NY, USA, 2005. ACM.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "U. Hinrichs, M. S. Hancock, M. S. T. Carpendale, and C. Collins. Examination of text-entry methods for tabletop displays. In Tabletop, pages 105--112, 2007.",
      "doi": ""
    },
    {
      "text": "J. A. Johnson, T. L. Roberts, W. Verplank, D. C. Smith, C. H. Irby, M. Beard, and K. Mackey. The Xerox Star: A retrospective. IEEE Computer, 22(9):11--29, 1989.  ",
      "doi": "10.1109/2.35211"
    },
    {
      "text": "S. Jorda, G. Geiger, M. Alonso, and M. Kaltenbrunner. The reacTable: exploring the synergy between live music performance and tabletop tangible interfaces. In TEI '07: Proceedings of the 1st international conference on Tangible and embedded interaction, pages 139--146, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "T. Kienzl, U. Marsche, N. Kapeller, and A. Gokcezade. tangible workbench \"TW\": with changeable markers. In SIGGRAPH '08: ACM SIGGRAPH 2008 new tech demos, page 1, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1401615.1401652"
    },
    {
      "text": "N. Matsushita and J. Rekimoto. HoloWall: designing a finger, hand, body, and object sensitive wall. In UIST '97: Proceedings of the 10th annual ACM symposium on User interface software and technology, pages 209--210, New York, NY, USA, 1997. ACM.  ",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "M. R. Morris, A. Huang, A. Paepcke, and T. Winograd. Cooperative gestures: multi-user gestural interactions for co-located groupware. In CHI '06: Proceedings of the SIGCHI conference on Human Factors in computing systems, pages 1201--1210, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "J. Patten, B. Recht, and H. Ishii. Audiopad: a tag-based interface for musical performance. In NIME '02: Proceedings of the 2002 conference on New interfaces for musical expression, pages 1--6, Singapore, Singapore, 2002. National University of Singapore. ",
      "doi": "10.5555/1085171.1085175"
    },
    {
      "text": "J. Raskin. The humane interface : new directions for designing interactive systems. Addison-Wesley, Reading, Mass. {u.a.}, 2. print. edition, 2000. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "J. Rekimoto. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In CHI '02: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 113--120, New York, NY, USA, 2002. ACM.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "J. Rekimoto, B. Ullmer, and H. Oba. DataTiles: a modular platform for mixed physical and graphical interactions. In CHI '01: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 269--276, New York, NY, USA, 2001. ACM.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "M. Waldner, J. Hauber, J. Zauner, M. Haller, and M. Billinghurst. Tangible tiles: design and evaluation of a tangible user interface in a collaborative tabletop setup. In OZCHI '06: Proceedings of the 18th Australia conference on Computer-Human Interaction, pages 151--158, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1228175.1228203"
    },
    {
      "text": "W. White. Method for optical comparison of skin friction-ridge patterns, 1965. U.S. Patent 3,200,701, 13.12.2002.",
      "doi": ""
    }
  ]
}