{
  "doi": "10.1145/1518701.1518837",
  "title": "A comprehensive study of frequency, interference, and training of multiple graphical passwords",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "889-898",
  "year": 2009,
  "badges": [],
  "abstract": "Graphical password systems have received significant attention as one potential solution to the need for more usable authentication, but nearly all prior work makes the unrealistic assumption of studying a single password. This paper presents the first study of multiple graphical passwords to systematically examine frequency of access to a graphical password, interference resulting from interleaving access to multiple graphical passwords, and patterns of access while training multiple graphical passwords. We find that all of these factors significantly impact the ease of authenticating using multiple facial graphical passwords. For example, participants who accessed four different graphical passwords per week were ten times more likely to completely fail to authenticate than participants who accessed a single password once per week. Our results underscore the need for more realistic evaluations of the use of multiple graphical passwords, have a number of implications for the adoption of graphical password systems, and provide a new basis for comparing proposed graphical password systems.",
  "authors": [
    {
      "name": "Katherine M. Everitt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584715",
      "orcid": "missing"
    },
    {
      "name": "Tanya Bragin",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350605410",
      "orcid": "missing"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660616996",
      "orcid": "missing"
    },
    {
      "name": "Tadayoshi Kohno",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100058677",
      "orcid": "0000-0002-4899-226X"
    }
  ],
  "references": [
    {
      "text": "Adams, A. and Sasse, M.A. Users are not the enemy. Communications of the ACM, (CACM Dec 1999), 40--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Adams, A., Sasse, M.A., and Lunt, P. Making passwords secure and usable. Proceedings of HCI on People and Computers XII, (HCI 1997), 1--19. ",
      "doi": "10.5555/646684.702633"
    },
    {
      "text": "BBC News. UN warns on password 'explosion'. http://news.bbc.co.uk/2/hi/technology/6199372.stm.",
      "doi": ""
    },
    {
      "text": "Brostoff, S. and Sasse, M.A. Are PassfacesTM more usable than passwords? A field trial investigation. Proceedings of HCI on People and Computers XIV, (HCI 2000), 405--424.",
      "doi": ""
    },
    {
      "text": "Chiasson, S., Biddle, R., and van Oorschot, P.C. A second look at the usability of click-based graphical passwords. Proceedings of the Symposium on Usable Privacy and Security, (SOUPS 2007), 1--12.  ",
      "doi": "10.1145/1280680.1280682"
    },
    {
      "text": "Davis, D., Monrose, F., and Reiter, M. On user choice in graphical password schemes. Proceedings of the Conference on USENIX Security Symposium, (2005), 11--11. ",
      "doi": "10.5555/1251375.1251386"
    },
    {
      "text": "DeAngeli, A., Coventry, L., Johnson, G., and Renaud, K. Is a picture really worth a thousand words? Exploring the feasibility of graphical authentication systems. International Journal of Human-Computer Studies, v. 63, n. 1-2 (2005), 128--152.  ",
      "doi": "10.1016/j.ijhcs.2005.04.020"
    },
    {
      "text": "Dhamija, R. and Perrig, A. Déjà vu: A user study using Images for Authentication. Proceedings of the Conference on USENIX Security Symposium, (2000), 4--4. ",
      "doi": "10.5555/1251306.1251310"
    },
    {
      "text": "Dunphy, P., Nicholson, J., Olivier, P. Securing Passfaces for Description. Proceedings of the Symposium on Usable Privacy and Security, (SOUPS 2007), 24--35.  ",
      "doi": "10.1145/1408664.1408668"
    },
    {
      "text": "Ensor, B. How Consumers Remember Passwords. Forrester Research Report, June 2, 2004.",
      "doi": ""
    },
    {
      "text": "The Face of Tomorrow Face Dataset. http://www.flickr.com/photos/istanbulmike/sets/72157594201837268/.",
      "doi": ""
    },
    {
      "text": "Florencio, D. and Herley, C. A large-scale study of web password habits. Proceedings of the International Conference on World Wide Web, (WWW 2007), 657--666.  ",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "Gaw, S. and Felten, E. Password management strategies for online accounts. Proceedings of the Symposium on Usable Privacy and Security, (SOUPS 2006), 44--55.  ",
      "doi": "10.1145/1143120.1143127"
    },
    {
      "text": "Ives, B., Walsh K.R., and Schneider, H. The domino effect of password reuse. In Communications of the ACM, (CACM Apr 2004), 75--78.  ",
      "doi": "10.1145/975817.975820"
    },
    {
      "text": "Moncur, W. and Leplâtre, G. Pictures at the ATM: exploring the usability of multiple graphical passwords. Proceedings of SIGCHI Conference on Human Factors in Computing Systems, (CHI 2007), 887--894.  ",
      "doi": "10.1145/1240624.1240758"
    },
    {
      "text": "Morris, R. and Thompson, K. Password security: A case history. Communications of the ACM (CACM Nov 1979), 594--497.  ",
      "doi": "10.1145/359168.359172"
    },
    {
      "text": "PassfacesTM. http://www.realuser.com/",
      "doi": ""
    },
    {
      "text": "Rock, I.,&amp;Engelstein, P. (1959). A study of memory for visual form. American Journal of Psychology (1959), 72, 221--229.",
      "doi": ""
    },
    {
      "text": "Standing, L. Learning 10,000 pictures. Quarterly Journal of Experimental Psychology 25 (1973), 207--222.",
      "doi": ""
    },
    {
      "text": "Tari, F., Ozok A.A., and Holden, S.H. A comparison of perceived and real shoulder-surfing risks between alphanumeric and graphical passwords. Proceedings of the Symposium on Usable Privacy and Security, (SOUPS 2006), 56--66.  ",
      "doi": "10.1145/1143120.1143128"
    },
    {
      "text": "Valentine, T. An evaluation of the PassfacesTM personal authentication system. Goldsmiths College Technical Report, 1998.",
      "doi": ""
    },
    {
      "text": "Valentine, T. Memory for PassfacesTM after a long delay. Goldsmiths College Technical Report, 1999.",
      "doi": ""
    },
    {
      "text": "Wiedenbeck, S., Waters, J., Birget, J.C., Brodskiy, A., and Memon, N. PassPoints: Design and longitudinal evaluation of a graphical password system. International Journal of Human-Computer Studies, v. 63, n. 1--2, (2005), 102--127.  ",
      "doi": "10.1016/j.ijhcs.2005.04.010"
    }
  ]
}