{
  "doi": "10.1145/1518701.1518715",
  "title": "Team analytics: understanding teams in the global workplace",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "83-86",
  "year": 2009,
  "badges": [],
  "abstract": "Many medium and large companies maintain internal employee directories. Unfortunately, most directories only allow the lookup of individual profiles, one profile at a time. Team Analytics is a novel application that integrates information from disparate enterprise tools for groups of people. Besides accelerating the lookup process, Team Analytics also displays information that is only available in the group context, such as an organizational chart and time zone awareness. We present the Team Analytics application, its integration with our corporate email client, and results from a user survey that evaluates various aspects of the application.",
  "tags": [
    "distributed teams",
    "directory",
    "visualization",
    "situational application",
    "white pages"
  ],
  "authors": [
    {
      "name": "Jan H. Pieper",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100128333",
      "orcid": "missing"
    },
    {
      "name": "Julia Grace",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81375599596",
      "orcid": "missing"
    },
    {
      "name": "Stephen Dill",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100341035",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Xobni. http://www.xobni.com/.",
      "doi": ""
    },
    {
      "text": "J. D. Herbsleb, A. Mockus, T. A. Finholt, and R. E. Grinter. Distance, dependencies, and delay in a global collaboration. In CSCW '00: Proceedings of the 2000 ACM conference on Computer supported cooperative work, pages 319--328, New York, NY, USA, 2000. ACM.  ",
      "doi": "10.1145/358916.359003"
    },
    {
      "text": "S. L. Jarvenpaa and D. E. Leidner. Communication and trust in global virtual teams. Organization Science, 10(6):791--815, 1999.  ",
      "doi": "10.1287/orsc.10.6.791"
    },
    {
      "text": "K. Stecher and S. Counts. Thin slices of online profile attributes. In Intl Conf. Weblogs and Social Media (ICWSM 08), 2008.",
      "doi": ""
    },
    {
      "text": "J. C. Tang, E. Wilcox, J. A. Cerruti, H. Badenes, S. Nusser, and J. Schoudt. Tag-it, snag-it, or bag-it: combining tags, threads, and folders in e-mail. In CHI Extended Abstracts, pages 2179--2194. ACM, 2008.  ",
      "doi": "10.1145/1358628.1358651"
    },
    {
      "text": "S. Whittaker, Q. Jones, B. Nardi, M. Creech, L. Terveen, E. Isaacs, and J. Hainsworth. Contactmap: Organizing communication in a social desktop. ACM Trans. Comput.-Hum. Interact., 11(4):445--471, 2004.  ",
      "doi": "10.1145/1035575.1035580"
    },
    {
      "text": "J. Zheng, E. Veinott, N. Bos, J. S. Olson, and G. M. Olson. Trust without touch: jumpstarting long-distance trust with initial social activities. In CHI '02: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 141--146, New York, NY, USA, 2002. ACM.  ",
      "doi": "10.1145/503376.503402"
    }
  ]
}