{
  "doi": "10.1145/1518701.1518708",
  "title": "Non-universal usability?: a survey of how usability is understood by Chinese and Danish users",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "41-50",
  "year": 2009,
  "badges": [],
  "abstract": "Most research assumes that usability is understood similarly by users in different cultures, implying that the notion of usability, its aspects, and their interrelations are constant across cultures. The present study shows that this is not the case for a sample of 412 users from China and Denmark, who differ in how they understand and prioritize different aspects of usability. Chinese users appear to be more concerned with visual appearance, satisfaction, and fun than Danish users; Danish users prioritize effectiveness, efficiency, and lack of frustration higher than Chinese users. The results suggest that culture influences perceptions of usability. We discuss implications for usability research and for usability practice.",
  "authors": [
    {
      "name": "Olaf Frandsen-Thorlacius",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607992",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    },
    {
      "name": "Morten Hertzum",
      "institution": "Roskilde University, Roskilde, Denmark",
      "img": "/do/10.1145/contrib-81100503897/rel-imgonly/aa.jpg",
      "acmid": "81100503897",
      "orcid": "missing"
    },
    {
      "name": "Torkil Clemmensen",
      "institution": "Copenhagen Business School, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143899",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aykin, N., Quaet-Faslem, P. H.,&amp;Milewski, A. E., Cultural Ergonomics, in Salvendy, G. (ed.) Handbook of Human Factors and Ergonomics, Wiley, 2006, 177--190.",
      "doi": ""
    },
    {
      "text": "Barber, W.&amp;Badre, A. Culturability: The Merging of Culture and Usability, Proc. of the Fourth Conference on Human Factors and the Web (1998).",
      "doi": ""
    },
    {
      "text": "Bojko, A., Lew, G. S.,&amp;Schumacher, R. M. Overcoming the Challenges of Multinational Testing, ACM interactions, 12, 6 (2005), 28--30.  ",
      "doi": "10.1145/1096554.1096558"
    },
    {
      "text": "Brislin, R. W. Back-Translation for Cross-Cultural Research, Journal of Cross-Cultural Psychology, 1, 3 (1970), 185--216.",
      "doi": ""
    },
    {
      "text": "Callahan, E., Interface Design and Culture, in Cronin, B. (ed.) Annual Review of Information Science and Technology, Vol. 39, Information Today, 2005, 257--310.",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T.,&amp;Newell, A. The Psychology of Human-Computer Interaction, Lawrence Erlbaum, Hillsdale NJ, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chau, P. Y. K., Cole, M., Massey, A., Montoya-Weiss, M.,&amp;O'Keefe, R. M. Cultural Differences in the Online Behavior of Consumers, Communications of the ACM, 45, 10 (2002), 138--143.  ",
      "doi": "10.1145/570907.570911"
    },
    {
      "text": "Chin, J. P., Diehl, V. A.,&amp;Norman, K. L. Development of an Instrument for Measuring User Satisfaction of the Human-Computer Interface, Proc. CHI '88, ACM Press (1988), 213--218.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Choi, B., Lee, I.,&amp;Kim, J. Culturability in Mobile Data Services: A Qualitative Study of the Relationship Between Cultural Characteristics and User-Experience Attributes, International Journal of Human-Computer Interaction, 20, 3 (2006), 171--206.",
      "doi": ""
    },
    {
      "text": "Clemmensen, T., Hertzum, M., Hornbæk, K., Shi, Q.,&amp;Yammiyavar, P. Cultural Cognition in the Thinking-Aloud Method for Usability Evaluation, Proc. ICIS 2008, AIS (2008)",
      "doi": ""
    },
    {
      "text": "Cohen, J. Statistical Power Analysis for the Behavioral Sciences, Academic Press, New York, 1969.",
      "doi": ""
    },
    {
      "text": "Cronbach, L. J. Coefficient Alpha and the Internal Structure of Tests, Psychometrika, 16 (1951), 297--333.",
      "doi": ""
    },
    {
      "text": "Day, D. Ed. Shared Values and Shared Interfaces {Special Issue}, Interacting with Computers, 9, 3 (1998).",
      "doi": ""
    },
    {
      "text": "del Galdo, E. M.&amp;Nielsen, J. International User Interfaces, Wiley, New York, 1996. ",
      "doi": "10.5555/241952"
    },
    {
      "text": "Elliott, M.&amp;Kling, R. Organizational Usability of Digital Libraries: Case Study of Legal Research in Civil and Criminal Courts, Journal of the American Society for Information Science, 48, 11 (1997), 1023--1035.  ",
      "doi": "10.5555/264878.264883"
    },
    {
      "text": "Evers, V.&amp;Day, D. The Role of Culture in Interface Acceptance, Proc. Interact'97, Chapman and Hall (1997), 260--267. ",
      "doi": "10.5555/647403.723539"
    },
    {
      "text": "Gorsuch, R. L. Factor Analysis, Lawrence Erlbaum, Hillsdale, NJ, 1983.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Beu, A.,&amp;Burmester, M. Engineering Joy, IEEE Software, 18, 1 (2001), 70--76.  ",
      "doi": "10.1109/52.903170"
    },
    {
      "text": "Hassenzahl, M., Platz, A., Burmester, M.,&amp;Lehner, K. Hedonic and Ergonomic Quality Aspects Determine a Software's Appeal, Proc. CHI 2000, ACM Press (2000), 201--208.  ",
      "doi": "10.1145/332040.332432"
    },
    {
      "text": "Hertzum, M., Clemmensen, T., Hornbæk, K., Kumar, J., Shi, Q.,&amp;Yammiyavar, P. Usability Constructs: A Cross-Cultural Study of How Users and Developers Experience Their Use of Information Systems, Proc. HCI International, LNCS 4559, Springer Verlag (2007), 317--326. ",
      "doi": "10.5555/1769821.1769862"
    },
    {
      "text": "Hofstede, G. Culture's Consequences: Comparing Values, Behaviors, Institutions, and Organizations Across Nations, Sage, Thousand Oaks, CA, 2001.",
      "doi": ""
    },
    {
      "text": "Honold, P. Learning How to Use a Cellular Phone: Comparison Between German and Chinese Users, Technical Communication, 46, 2 (1999), 196--205.",
      "doi": ""
    },
    {
      "text": "Honold, P. Culture and Context: An Empirical Study for the Development of a Framework for the Elicitation of Cultural Influence in Product Usage, International Journal of Human-Computer Interaction, 12, 3&4 (2000), 327--345.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K. Current Practice in Measuring Usability: Challenges to Usability Studies and Research, International Journal of Human-Computer Studies, 64, 2 (2006), 79--102.  ",
      "doi": "10.1016/j.ijhcs.2005.06.002"
    },
    {
      "text": "Hornbæk, K.&amp;Law, E. L. C. Meta-Analysis of Correlations Among Usability Measures, Proc. CHI 2007 (2007), 617--626.  ",
      "doi": "10.1145/1240624.1240722"
    },
    {
      "text": "ISO 9241-11 Ergonomic Requirements for Office Work With Visual Display Terminals (VDTs)-Part 11: Guidance on Usability, International Standard Organization (1998).",
      "doi": ""
    },
    {
      "text": "ISO/IEC 9126 Software Engineering - Product Quality - Part 1: Quality Model, International Standard Organization (2001).",
      "doi": ""
    },
    {
      "text": "Kaiser, H. F. An Index of Factor Simplicity, Psychometrika, 39 (1974), 31--36.",
      "doi": ""
    },
    {
      "text": "Kurosu, M.&amp;Kashimura, K. Determinants of Apparent Usability, Proc. IEEE International Conference on Systems, Man and Cybernetics, IEEE Press (1995), 1509--1513.",
      "doi": ""
    },
    {
      "text": "Marcus, A., Global/Intercultural User Interface Design, in Sears, A.&amp;Jacko, J. (eds.) The Human-Computer Interaction Handbook: Fundamentals, Evolving Technologies, and Emerging Applications, Erlbaum, 2008, 355--390. ",
      "doi": "10.5555/772072.772103"
    },
    {
      "text": "McGee, M. Master Usability Scaling: Magnitude Estimation and Master Scaling Applied to Usability Measurement, Proc. CHI 2004, ACM Press (2004), 335--342.  ",
      "doi": "10.1145/985692.985735"
    },
    {
      "text": "McGee, M., Rich, A.,&amp;Dumas, J. Understanding the Usability Construct: User-Perceived Usability, Proc. HFES'2004, HFES (2004), 907--911.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Usability Engineering, Academic Press, San Diego CA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Nisbett, R. E. The Geography of Thought: How Asians and Westerners Think Differently - and Why, Nicholas Brealey, London, 2003.",
      "doi": ""
    },
    {
      "text": "Norman, D. A.&amp;Draper, S. W. User Centered System Design, Lawrence Erlbaum, Hillsdale, NJ, 1986. ",
      "doi": "10.5555/576915"
    },
    {
      "text": "O'Keefe, R. M., Cole, M., Chau, P. Y. K., Massey, A., Montoya-Weiss, M.,&amp;Perry, M. From the User Interface to the Consumer Interface: Results From a Global Experiment, International Journal of Human-Computer Studies, 53, 4 (2000), 611--628.  ",
      "doi": "10.1006/ijhc.2000.0404"
    },
    {
      "text": "Rau, P.-L. P., Gao, Q.,&amp;Liang, S.-F. M. Good Computing for Everyone - How on Earth? Cultural Aspects, Behaviour&amp;Information Technology, 27, 4 (2008), 287--292.  ",
      "doi": "10.1080/01449290701761250"
    },
    {
      "text": "Rogers, Y., New Theoretical Approaches for Human-Computer Interaction, in Cronin, B. (ed.) Annual Review of Information Science and Technology, Vol. 38, Information Today, 2004, 87--144.",
      "doi": ""
    },
    {
      "text": "Sauro, J.&amp;Kindlund, E. A Method to Standardize Usability Metrics into a Single Score, Proc. CHI 2005, ACM Press (2005), 401--409.  ",
      "doi": "10.1145/1054972.1055028"
    },
    {
      "text": "Schepers, J.&amp;Wetzels, M. A Meta-Analysis of the Technology Acceptance Model: Investigating Subjective Norm and Moderation Effects, Information&amp;Management, 44, 1 (2007), 90--103.  ",
      "doi": "10.1016/j.im.2006.10.007"
    },
    {
      "text": "Schwarz, N., Groves, R.,&amp;Schuman, H., Survey Methods, in Gilbert, D., Fiske, S.,&amp;Lindzey, G. (eds.) Handbook of Social Psychology, McGraw-Hill, 1998, 143--179.",
      "doi": ""
    },
    {
      "text": "Smith, A.&amp;Yetim, F. Global Human-Computer Systems: Cultural Determinants of Usability {Special Issue}, Interacting with Computers, 16, 1 (2004).",
      "doi": ""
    },
    {
      "text": "Sun, H. Exploring Cultural Usability, Proc. IPCC2002, IEEE Press (2008), 219--330.",
      "doi": ""
    },
    {
      "text": "Tractinsky, N. Aesthetics and Apparent Usability: Empirically Assessing Cultural and Methodological Issues, Proc. CHI'97, ACM Press (1997), 115--122.  ",
      "doi": "10.1145/258549.258626"
    },
    {
      "text": "van Welie, M., van der Veer, G. C.,&amp;Eliëëns, A. Breaking Down Usability, Proc. Interact'99, IOS Press (1999), 613--620.",
      "doi": ""
    }
  ]
}