{
  "doi": "10.1145/1518701.1518808",
  "title": "Resilience through technology adoption: merging the old and the new in Iraq",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "689-698",
  "year": 2009,
  "badges": [],
  "abstract": "Citizen response to disaster has begun to receive attention in the CHI community but little attention has so far been given to how citizens use technology to adapt when their country is at war. We report on an ethnographic interview study of how technology was adopted and used by citizens to be resilient during wartime. We interviewed 45 Iraqi citizens experiencing the current Iraq war. Based on our data we identified properties of resilience: reconfiguring social networks, self-organization, redundancy, proactive practices, and repairing trust in information. Technology supported people in being resilient by enabling them to control identity, to collaborate in travel, to create an organizational memory, and to provide alternative sources of news and information. As people adopted and used technology to be resilient we found a merging of old and new cultural practices. We discuss these systemic changes and describe implications for how technology can support people in being resilient in disrupted environments.",
  "tags": [
    "resilience",
    "culture",
    "technology adoption",
    "disrupted environments"
  ],
  "authors": [
    {
      "name": "Gloria J. Mark",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279599",
      "orcid": "missing"
    },
    {
      "name": "Ban Al-Ani",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319487517",
      "orcid": "missing"
    },
    {
      "name": "Bryan Semaan",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81384620999/rel-imgonly/81384620999.jpg",
      "acmid": "81384620999",
      "orcid": "0000-0003-1151-2389"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. and Palen, L. The Zephyr Help Instance: promoting ongoing activity in a CSCW system. Proc. CHI 1996, ACM Press (1996), 268--275.  ",
      "doi": "10.1145/238386.238528"
    },
    {
      "text": "Al-Ali, N. Reconstructing Gender: Iraqi women between dictatorship, war, sanctions and occupation. Third World Quarterly, 26, 4 (2005), 739--758.",
      "doi": ""
    },
    {
      "text": "Araboo. Accessed Sept. 16, 2008, from http://www.araboo.com/dir/iraq-communities-forums.",
      "doi": ""
    },
    {
      "text": "Bell, G. and Dourish, P. Yesterday's tomorrows: notes on ubiquitous computing's dominant vision. Personal Ubiquitous Computing, 11, 2 (2007), 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Biernacki, P. Snowball sampling: Problems and techniques of chain referral sampling. Soc Methods&amp;Research, 10, 2 (1981), 141--163.",
      "doi": ""
    },
    {
      "text": "Beunza, D. I. and Stark, D. Resolving Identities: Successive Crises in a Trading Room after 9/11. Working Paper 734, U Pompeu Fabra, Barcelona, 2004.",
      "doi": ""
    },
    {
      "text": "Dynes, R. R. Organized Behavior in Disaster. Heath Lexington Books, Lexington, MA, USA, 1970.",
      "doi": ""
    },
    {
      "text": "Freeman, L.C., Romney, A.K, and Freeman, S.C. Cognitive structure and informant accuracy. American Anthropologist, 89, 2 (1987), 310--325.",
      "doi": ""
    },
    {
      "text": "Hassan, H. D. Iraq: Tribal structure, social, and political activities. Congressional Research Service Report to Congress. The Library of Congress. (2007). http://assets.opencrs.com/rpts/RS22626_20070315.pdf.",
      "doi": ""
    },
    {
      "text": "Iraq Poll 2007. BBC/ABC/NHK. http://www.globalpolicy.org/security/issues/iraq/resist/2007/09bbciraqipoll.pdf, Sept. 2007.",
      "doi": ""
    },
    {
      "text": "Kendra, J. and Wachtendorf, T. Elements of resilience after the World Trade Center disaster: Reconstituting New York City's Emergency Operations Centre. Disasters, 27, 1 (2003), 37--53.",
      "doi": ""
    },
    {
      "text": "Loyn, D., Local heroes: risk-taking in Iraq. British Journalism Review, 18, 2 (2007), 21--25.",
      "doi": ""
    },
    {
      "text": "Maguire, B., and Hagan, P. Disasters and communities: understanding social resilience. Australian Journal of Emergency Management, 22, 2 (2007), 16--20.",
      "doi": ""
    },
    {
      "text": "Mark, G. and Semaan, B. (2008). Resilience in collaboration: Technology as a resource for new patterns of action. Proc. CSCW 2008, ACM Press (2008), 137--146.  ",
      "doi": "10.1145/1460563.1460585"
    },
    {
      "text": "O'Hanlon ME, Campbell JH. The Iraq Index: Tracking variables of reconstruction&amp;security in post-Saddam Iraq, Sept. 4, 2008. www.brookings.edu/iraqindex.",
      "doi": ""
    },
    {
      "text": "Palen, L., and Vieweg, S. The emergence of online widescale interaction in unexpected events: Assistance, alliance&amp;retreat. Proc. CSCW 2008, ACM Press (2008), 117--126.  ",
      "doi": "10.1145/1460563.1460583"
    },
    {
      "text": "Palen, L.&amp;Liu, S. Citizen communications in disaster: Anticipating a future of ICT-supported public participation. Proc. CHI 2007, ACM Press (2007), 727--736.  ",
      "doi": "10.1145/1240624.1240736"
    },
    {
      "text": "Rashad H, Osman M, Roudi-Fahimi F. Marriage in the Arab world. Wash, DC: Population Reference Bureau, (2005), 1--8.",
      "doi": ""
    },
    {
      "text": "Sebti, B. What I risked as an Iraqi journalist. Washington Post, Oct. 21, 2007.",
      "doi": ""
    },
    {
      "text": "Shklovski, I. and Mainwaring, S. Exploring technology adoption and use through the lens of residential mobility. Proc. CHI 2005, ACM Press (2005), 621--630.  ",
      "doi": "10.1145/1054972.1055058"
    },
    {
      "text": "Shklovski, I., Palen, L.,&amp;Sutton, J. Finding community through information and communication technology during disaster events. Proc. CSCW 2008, ACM Press (2008), 127 -- 136.  ",
      "doi": "10.1145/1460563.1460584"
    },
    {
      "text": "Strauss, A. L. and Corbin, J. M. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage, Thous. Oaks, CA, USA, 1998.",
      "doi": ""
    },
    {
      "text": "Weick, K. E. The collapse of sensemaking in organizations: The Mann Gulch Disaster. Administrative Science Quarterly, 38, 4 (1993), 628--652.",
      "doi": ""
    },
    {
      "text": "Zakaria, N. and Stanton, J. Designing and implementing culturally-sensitive IT applications. Information Technology&amp;People, 16, 1 (2003), 49--75.",
      "doi": ""
    }
  ]
}