{
  "doi": "10.1145/1518701.1518903",
  "title": "An intuitive model of perceptual grouping for HCI design",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1331-1340",
  "year": 2009,
  "badges": [],
  "abstract": "Understanding and exploiting the abilities of the human visual system is an important part of the design of usable user interfaces and information visualizations. Good design enables quick, easy and veridical perception of key components of that design. An important facet of human vision is its ability to seemingly effortlessly perform \"perceptual organization; it transforms individual feature estimates into perception of coherent regions, structures, and objects. We perceive regions grouped by proximity and feature similarity, grouping of curves by good continuation, and grouping of regions of coherent texture. In this paper, we discuss a simple model for a broad range of perceptual grouping phenomena. It takes as input an arbitrary image, and returns a structure describing the predicted visual organization of the image. We demonstrate that this model can capture aspects of traditional design rules, and predicts visual percepts in classic perceptual grouping displays.",
  "tags": [
    "grouping",
    "similarity",
    "proximity",
    "gestalt",
    "contour integration",
    "perceptual organization",
    "good continuation"
  ],
  "authors": [
    {
      "name": "Ruth Rosenholtz",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100414889",
      "orcid": "missing"
    },
    {
      "name": "Nathaniel R. Twarog",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416609026",
      "orcid": "missing"
    },
    {
      "name": "Nadja Schinkel-Bielefeld",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416609142",
      "orcid": "missing"
    },
    {
      "name": "Martin Wattenberg",
      "institution": "IBM Watson Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331534",
      "orcid": "0000-0003-0904-4862"
    }
  ],
  "references": [
    {
      "text": "Wertheimer, M. Laws of Organization in Perceptual Forms. Harcourt Brace Jovanovich, London, 1938.",
      "doi": ""
    },
    {
      "text": "Koffka, K. Principles of Gestalt Psychology. Hartcourt, New York, 1935.",
      "doi": ""
    },
    {
      "text": "Ware, C. Information Visualization: Perception for Design. Elsevier, San Francisco, 2004. ",
      "doi": "10.5555/983611"
    },
    {
      "text": "Kosslyn, S. M. Understanding charts and graphs. Applied Cognitive Psychology, 3 (1989), 185--225.",
      "doi": ""
    },
    {
      "text": "Tufte, E. R. The Visual Display of Quantitative Information. Graphics Press, CT, 1983. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Cleveland, W. The Elements of Graphing Data. Wadsworth, Monterey, CA, 1980. ",
      "doi": "10.5555/4084"
    },
    {
      "text": "Mackinlay, J. D. Applying a theory of graphical presentation to the graphic design of user interfaces. In Proc. SIGGRAPH (UIST) (1988), ACM Press, 179--189.  ",
      "doi": "10.1145/62402.62431"
    },
    {
      "text": "Tullis, T. S. A computer-based tool for evaluating alphanumeric displays. INTERACT 84 (1984), 719--723.",
      "doi": ""
    },
    {
      "text": "Vincent, L. Current topics in applied morphological image analysis. In Kendall, W. S. et al., eds., Current Trends in Stochastic Geometry and Its Applications. Chapman&amp;Hall, 1997.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B., Chimera, R., Jog, N., Stimart, R.,&amp;White, D. Evaluating spatial and texture style of displays. In MacDonald, L. W. and Lowe, A. C., eds., Display Systems: Design and Applications. John Wiley&amp;Sons, Chichester, U.K., 1997.",
      "doi": ""
    },
    {
      "text": "Saund, E. Symbolic construction of a 2-D scale-space image. IEEE Trans. Pattern Analysis&amp;Machine Intelligence, 12, 8 (1990), 817--830.  ",
      "doi": "10.1109/34.57672"
    },
    {
      "text": "Healey, C.G., Booth, K.S.,&amp;Enns, J.T. Harnessing preattentive processes for multivariate data visualization. Proc. Graphics Interface '93 (1993), 107--117.",
      "doi": ""
    },
    {
      "text": "Shi, J.&amp;Malik, J. Normalized cuts and image segmentations. IEEE Conf. on Computer Vision and Pattern Recognition ( 1997), 731--737. ",
      "doi": "10.5555/794189.794502"
    },
    {
      "text": "Field, D. J., Hayes, A.,&amp;Hess, R. F. Contour integration by the human visual system: evidence for a local association field. Vision Research, 33 (1993), 173--193.",
      "doi": ""
    },
    {
      "text": "Parent, P.&amp;Zucker, S. W. Trace inference, curvature consistency, and curve detection. IEEE Trans. Pattern Analysis&amp;Machine Intelligence, 2, 8 (1989), 823--839.  ",
      "doi": "10.1109/34.31445"
    },
    {
      "text": "Mumford, D. Elastica and computer vision. In Algebraic Geometry and Its Applications. Springer-Verlag, NY, 1994.",
      "doi": ""
    },
    {
      "text": "Grossberg, S.&amp;Mingolla, E. Neural dynamics of perceptual grouping: textures, boundaries, and emergent segmentations. Perception&amp;Psychophysics, 38 (1985), 141--171.",
      "doi": ""
    },
    {
      "text": "Duda, R. O.&amp;Hart, P. E. Pattern Classification. Wiley, NY, 1973. ",
      "doi": "10.5555/954544"
    },
    {
      "text": "Ohlander, R., Price, K.,&amp;Reddy, R. Picture segmentation by a recursive region splitting method. Computer Graphics and Image Processing, 8 (1978), 313--333.",
      "doi": ""
    },
    {
      "text": "Witkin, A. P. Scale-space filtering. Proc. 8th Int. Conf. on Artificial Intelligence (1983), 1019--1022.",
      "doi": ""
    },
    {
      "text": "Koenderink, J. J. The structure of images. Biological Cybernetics, 50 (1984), 363--370.",
      "doi": ""
    },
    {
      "text": "Lindeberg, T. Scale-Space Theory in Computer Vision. Kluwer Academic, Dordrecht, Netherlands, 1994. ",
      "doi": "10.5555/528688"
    },
    {
      "text": "Wattenberg, M.&amp;Fisher, D. A model of multi-scale perceptual organization in information graphics. Infovis 2003 ( 2003), 123--133.  ",
      "doi": "10.1057/palgrave.ivs.9500070"
    },
    {
      "text": "Palmer, S. E. Hierarchical structure in perceptual representation. Cognitive Psychology, 9 (1977), 441--474.",
      "doi": ""
    },
    {
      "text": "Navon, D. Forest before trees: The precedence of global features in visual perception. Cognitive Psychology, 9 (1977), 353--383.",
      "doi": ""
    },
    {
      "text": "Martin, D., Fowlkes, C.,&amp;Malik, J. Learning to detect natural image boundaries using local brightness, color, and texture cues. IEEE Trans. Pattern Analysis and Machine Intelligence, 26, 5 (2004), 530--549.  ",
      "doi": "10.1109/TPAMI.2004.1273918"
    },
    {
      "text": "Malik, J.&amp;Perona, P. A computational model of texture segmentation. Proc. Computer Vision and Pattern Recognition (1989), 326--332.",
      "doi": ""
    },
    {
      "text": "Rosenholtz, R. Significantly different textures: A computational model of pre-attentive texture segmentation. Proc. Europ. Conf. Computer Vision (2000), 197--211. ",
      "doi": "10.5555/645314.649437"
    },
    {
      "text": "Perona, P.&amp;Malik, J. Scale-space and edge detection using anisotropic diffusion. IEEE Trans. Pattern Analysis&amp;Machine Intelligence, 12 (1990), 629--639.  ",
      "doi": "10.1109/34.56205"
    },
    {
      "text": "Geman, S.&amp;Geman, D. Stochastic relaxation, Gibbs distributions, and the Bayesian restoration of images. IEEE Trans. Pattern Analysis&amp;Machine Intelligence, 6 (1984), 721--741.",
      "doi": "10.1109/TPAMI.1984.4767596"
    },
    {
      "text": "Tomasi, C.&amp;Manduchi, R. Bilateral filtering for gray and color images. IEEE Int. Conf. on Computer Vision (1998), 839--846. ",
      "doi": "10.5555/938978.939190"
    },
    {
      "text": "Durand, F.&amp;Dorsey, J. Fast bilateral filtering for the display of high-dynamic-range images. ACM Trans. on Graphics, 21, 3 (2002), 257--266.  ",
      "doi": "10.1145/566654.566574"
    },
    {
      "text": "Paris, S.&amp;Durand, F. A fast approximation of the bi-lateral filter using a signal processing approach. Proc. European Conf. Computer Vision (2006), 568--580.  ",
      "doi": "10.1007/11744085_44"
    },
    {
      "text": "Julesz, B. A theory of preattentive texture discrimination based on the first order statistics of textons. Biological Cybernetics, 41 (1981), 131--138.",
      "doi": ""
    },
    {
      "text": "Beck, J. Textural segmentation, second-order statistics,&amp;textural elements. Biol. Cybern., 48 (1983), 125--130.",
      "doi": "10.1007/BF00344396"
    },
    {
      "text": "Voorhees, H.&amp;Poggio, T. Computing texture boundaries from images. Nature, 333 (1988), 364--367.",
      "doi": ""
    },
    {
      "text": "Li, Z. Pre-attentive segmentation in the primary visual cortex. Spatial Vision, 13 (2000), 25--50.",
      "doi": ""
    },
    {
      "text": "Helmholtz, H. Handbook of Physiological Optics. Vol. 3, The Perceptions of Vision. Optical Society of America, Rochester, 1925.",
      "doi": ""
    },
    {
      "text": "Paris, S.&amp;Durand, F. A topological approach to hierarchical segmentation using mean shift. IEEE Conf. Computer Vision&amp;Pattern Recognition (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Ruzon, M. A.&amp;Tomasi, C. Edge, junction and corner detection using color distributions. IEEE Trans. Pattern Analysis&amp;Mach. Intell., 23, 11 (2001), 1281--1295.  ",
      "doi": "10.1109/34.969118"
    },
    {
      "text": "Geisler, W. S., Perry, J. S., Super, B. J.,&amp;Gallogly, D. P. Edge co-occurrence in natural images predicts contour grouping performance. Vision Research, 41 (2001), 711--724.",
      "doi": ""
    },
    {
      "text": "Estrada, F. J.&amp;Elder, J. H. Multi-scale contour extraction based on natural image statistics. IEEE Conf. Computer Vision&amp;Pattern Recognition Workshop (2006), 183--190.  ",
      "doi": "10.1109/CVPRW.2006.134"
    },
    {
      "text": "Schinkel-Bielefeld, N. Contour integration models predicting human behavior. University of Bremen, 2007. http://nbn-resolving.de/urn:nbn:de:gbv:46diss000-108845.",
      "doi": ""
    },
    {
      "text": "Mahamud, S., Williams, L. R.,&amp;Thornber, K. K. Segmentation of multiple salient contours from real images. IEEE Trans. on Pattern Analysis&amp;Machine Intelligence, 25 (2003), 433--444.  ",
      "doi": "10.1109/TPAMI.2003.1190570"
    },
    {
      "text": "Ren, X., Fowlkes, C.,&amp;Malik, J. Figure/ground assignment in natural images. Proc. European Conf. on Computer Vision (2006), 614--627.  ",
      "doi": "10.1007/11744047_47"
    },
    {
      "text": "C.I.E. Recommendations on uniform color spaces, color difference equations, psychometric color terms. Supp. No. 2 to CIE publ. 15 (E.-1.3.1) 1971/(TC-1.3.) (1978).",
      "doi": ""
    },
    {
      "text": "Comanciu, D.&amp;Meer, P. Mean shift: a robust approach toward feature space analysis. IEEE Trans. Pattern Analysis&amp;Machine Intelligence, 24 (2002), 603--619.  ",
      "doi": "10.1109/34.1000236"
    },
    {
      "text": "Freeman, W. T.&amp;Adelson, E. H. The design and use of steerable filters. IEEE Trans. Pattern Analysis&amp;Machine Intelligence, 13 (1991), 891--906.  ",
      "doi": "10.1109/34.93808"
    },
    {
      "text": "Landy, M. S.&amp;Bergen, J. R. Texture segregation and orientation gradient. Vis. Research, 31 (1991), 679--691.",
      "doi": ""
    },
    {
      "text": "Marr, D. and Hildreth, E. C. Theory of edge detection. Proc. Royal Society, London B, 207 (1980), 187--217.",
      "doi": ""
    },
    {
      "text": "Logan, G. The CODE theory of visual attention: An integration of space-based and object-based attention. Psychological Review, 103, 4 (1996), 603--649.",
      "doi": ""
    },
    {
      "text": "Watt, R., Ledgeway, T., and Dakin, S. C. Families of models for Gabor paths demonstrate the importance of spatial adjacency. Journal of Vision, 8, 7 (2008), 1--19. htp://journalofvision.org/8/7/23/.",
      "doi": ""
    }
  ]
}