{
  "doi": "10.1145/1518701.1518767",
  "title": "(Perceived) interactivity: does interactivity increase enjoyment and creative identity in artistic spaces?",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "415-418",
  "year": 2009,
  "badges": [],
  "abstract": "The HCI community often operates under the assumption that interactivity enhances the user experience. In this study we are particularly interested in whether interactivity enhances an artistic experience by either promoting or constraining an audience's enjoyment and creative identity. The goal of the study was to test two research questions in an experimental context: 1.) How does interactive art impact user satisfaction, and 2.) How does interactive art shape the self-concept of the user as creative? Participants interacted with the system in the Interaction\"(34 pairs) or\"No Interaction (37 pairs) condition. Findings reveal that perceptions of interactivity correlate with user satisfaction, but do not influence user identity.",
  "authors": [
    {
      "name": "Amy L. Gonzales",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430668491",
      "orcid": "0000-0002-3660-707X"
    },
    {
      "name": "Thomas Finley",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100568786",
      "orcid": "missing"
    },
    {
      "name": "Stuart Paul Duncan",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416605367",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arrasvuori, J.&amp;Holm, J. Designing Interactive Music Mixing Applications for Mobile Devices. Proceedings of DIMEA 2007, 20--27  ",
      "doi": "10.1145/1306813.1306827"
    },
    {
      "text": "Bem, D.J. (1972). Self-perception theory. In L. Berkowitz (Ed.), Advances in Experimental Social Psychology, 13, 420--432",
      "doi": ""
    },
    {
      "text": "Bucy, E.P.&amp;Tao, C. (2007). The mediated moderation model of interactivity. Media Psychology, 9, 647--672",
      "doi": ""
    },
    {
      "text": "Bilda, Z., Edmonds, E.,&amp;Turnbull, D. Interactive Experience in Public Context. Proceedings of CC  ",
      "doi": "10.1145/1254960.1254994"
    },
    {
      "text": "Campbell, J. (2000). Delusions of dialogue: Control and choice in interactive art. Leonardo, 33, 133--136",
      "doi": ""
    },
    {
      "text": "Cornock, S.&amp;Edmonds, E. (1973). The creative process where the artist is amplified or superseded by the computer. Leonardo, 1, 11--16",
      "doi": ""
    },
    {
      "text": "Edmonds, E., Turner, G.,&amp;Candy, L. Approaches to interactive art systems. Proceedings of CGIT 2004, 113--117  ",
      "doi": "10.1145/988834.988854"
    },
    {
      "text": "Erickson, T. (2006) Five Lenses: Towards a Toolkit for Interaction Design Theories and Practice in Interaction Design (Eds. Bagnara, G. Crampton-Smith,&amp;G. Salvendy.) Lawrence Erlbaum: p.301--310.",
      "doi": ""
    },
    {
      "text": "Gonzales, A.L.&amp;Hancock, J.T. (2008). Identity shift in computer-mediated environments. Media Psychology, 167--185.",
      "doi": ""
    },
    {
      "text": "Gough, H. G. (1979). A creative personality scale for the Adjective Check List. Journal of Personality and Social Psychology, 37, 1398--1405.",
      "doi": ""
    },
    {
      "text": "Hook, K., Sengers, P.,&amp;Andersson, G. (2003). Sense and sensibility: evaluations and interactive art. Proceedings of SIGCHI 2003, 241--248  ",
      "doi": "10.1145/642611.642654"
    },
    {
      "text": "Park, E., Kim, B., Salim. W.,&amp;Cheok, A.D. Magic Asian Art. Proceedings of CHI 2006  ",
      "doi": "10.1145/1125451.1125506"
    },
    {
      "text": "Rasmussen, J.L. (1989). Analysis of Likert-Scale Data: A Reinterpretation of Gregoire and Driver. Psych Bulletin, 105, 167--170.",
      "doi": ""
    },
    {
      "text": "Richards, D. (2006). Is interactivity actually important? IE 2005 ",
      "doi": "10.5555/1231894.1231904"
    },
    {
      "text": "Sengers, P.,&amp;Csikszentmiháályi, C. HCI and the Arts: A Conflicted Convergence? Proceedings of CHI 2003  ",
      "doi": "10.1145/765891.766044"
    },
    {
      "text": "Sengers, P., Boehner, K., David, S.,&amp;Kaye, J. Reflective design. Proceedings of Critical Computing 2005, 49--58  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Vorderer, P., Knobloch, S.,&amp;Schramm, H. (2001). Does entertainment suffer from interactivity? The impact of watching an interactive TV movie on viewers' experience of entertainment. Media Psychology, 3, 343--363.",
      "doi": ""
    },
    {
      "text": "Willis, K.D.D. User authorship and creativity within interactivity. Proceedings of Multimedia 2006, 731--735  ",
      "doi": "10.1145/1180639.1180796"
    }
  ]
}