{
  "doi": "10.1145/1518701.1519038",
  "title": "Discriminating the relevance of web search results with measures of pupil size",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2209-2212",
  "year": 2009,
  "badges": [],
  "abstract": "The overwhelming amount of information on the web makes it critical for users to quickly and accurately evaluate the relevance of content. Here we tested whether pupil size can be used to discriminate the perceived relevance of web search results. Our findings revealed that measures of pupil size carry information that can be used to discriminate the relevance of text and image web search results, but the low signal-to-noise ratio poses challenges that need to be overcome when using this technique in naturalistic settings. Despite these challenges, our findings highlight the promise that pupillometry has as a technique that can be used to assess interest and relevance in web interaction in a non-intrusive and objective way.",
  "authors": [
    {
      "name": "Flavio T.P. Oliveira",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416599316",
      "orcid": "missing"
    },
    {
      "name": "Anne Aula",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100241569",
      "orcid": "missing"
    },
    {
      "name": "Daniel M. Russell",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589296",
      "orcid": "0000-0002-7243-9317"
    }
  ],
  "references": [
    {
      "text": "Wilson, G.M., Sasse, M.A. Do users know what's good for them? Utilizing physiological responses to assess media quality. In People and Computers XIV: Proceedings of HCI, Springer (2000), 327--339",
      "doi": ""
    },
    {
      "text": "Jacob, R.&amp;Karn, K. Commentary on Section 4: Eye tracking in human-computer interaction and usability research: Ready to deliver the promises. In The Mind's Eye: Cognitive and Applied Aspects of Eye Movement Research, Elsevier (2003), 457--470",
      "doi": ""
    },
    {
      "text": "Iqbal, S.T, Zheng, X.S.,Bailey, B.P. Task-evoked pupillary response to mental workload in human-computer interaction. Ext. Abstracts CHI 2004, ACM Press (2004) 1477--1480  ",
      "doi": "10.1145/985921.986094"
    },
    {
      "text": "Hess, E.H., Polt, J.M. Pupil size as related to interest value of stimuli. Science 132, 3423 (1960), 349--350",
      "doi": ""
    },
    {
      "text": "Aula, A.&amp;Surakka, V. Auditory emotional feedback facilitates human-computer interaction. Proc. of HCI (2002) 337--349.",
      "doi": ""
    },
    {
      "text": "Ekman, I., Poikola, A., Mäkäräinen, M., Takala, T.&amp;Häämäläinen, P. Voluntary pupil size change as control in eyes only interaction. Proc. of ETRA (2008), 115--118.  ",
      "doi": "10.1145/1344471.1344501"
    },
    {
      "text": "Kayser, J., Tenke, C.E. Optimizing PCA methodology for ERP component identification and measurement: theoretical rationale and empirical evaluation Clinical Neurophysiology 114 (2003), 2307--2325",
      "doi": ""
    },
    {
      "text": "Cutrell, E., Guan, Z. What are you looking for?: an eye-tracking study of information usage in web search. Proc. CHI 2007, ACM Press (2007), 407--416  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Haro, A., Essa, I., Flickner, M. A non-invasive computer vision system for reliable eye tracking Ext. Abstracts CHI 2000, ACM Press (2000), 167--168  ",
      "doi": "10.1145/633292.633385"
    }
  ]
}