{
  "doi": "10.1145/1518701.1518768",
  "title": "Learning from IKEA hacking: i'm not one to decoupage a tabletop and call it a day.",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "419-422",
  "year": 2009,
  "badges": [],
  "abstract": "We present a qualitative study based on interviews with nine IKEA Hackers - people who go online to share the process of repurposing IKEA products to create personalized objects. Whether they were making a self-conscious artistic statement or simply modifying a towel rack to fit in a small bathroom, IKEA hackers illuminate an emergent practice that provides insights into contemporary changes in creativity. We discuss the motivations for IKEA hacking and explore the impact of information technology on do-it-yourself culture, design, and HCI.",
  "tags": [
    "Ikea",
    "DIY",
    "creative tools",
    "design"
  ],
  "authors": [
    {
      "name": "Daniela Rosner",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    },
    {
      "name": "Jonathan Bean",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408593127",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agrawala, M., Phan, D., Heiser, J., Haymaker, J., Klingner, J., Hanrahan, P., and Tversky, B. Designing Effective Step-By-Step Assembly Instructions. In SIGGRAPH 2003, July 2003, 828--837.  ",
      "doi": "10.1145/1201775.882352"
    },
    {
      "text": "Ballagas, R., Memon, F., Reiners, R., and Borchers, J., iStuff Mobile: Rapidly Prototyping New Mobile Phone Interfaces for Ubiquitous Computing. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, San Jose, CA, USA, 2007, ACM Press, 1107--1116.  ",
      "doi": "10.1145/1240624.1240793"
    },
    {
      "text": "Beckwith, L., Kissinger, C., Burnett, B., Wiedenbeck, S., Lawrance, J., Blackwell, A. and Cook, C. 2006. Tinkering and gender in end-user programmers' debugging. Proc. CHI'06, pp. 231--240.  ",
      "doi": "10.1145/1124772.1124808"
    },
    {
      "text": "Belk, R. Possessions and the Extended Self (1988). In The Journal of Consumer Research 15, no. 2, 139--168.",
      "doi": ""
    },
    {
      "text": "Blythe, M. and Monk, A., \"Notes towards an ethnography of domestic technology,\" in Proceedings of the conference on Designing interactive systems: processes, practices, methods, and techniques, (2002), ACM Press, 277--281.  ",
      "doi": "10.1145/778712.778750"
    },
    {
      "text": "Boer, C. and Dulio, S. Mass Customization and Footwear: Myth, Salvation or Reality?: A Comprehensive Analysis of the Adoption of the Mass Customization Paradigm in Footwear. Springer-Verlag, London, 2007. Probes, Interactions, ACM Press, 1999. ",
      "doi": "10.5555/1543632"
    },
    {
      "text": "Csikszentmihalyi, M., and Rochberg-Halton, E. The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press, 2002.",
      "doi": ""
    },
    {
      "text": "Forlizzi, J. How robotic products become social products: an ethnographic study of cleaning in the home. Proceedings of HRI 2007, ACM Press, 2007. Remaking the Way we Make Things. New York: North Point Press, 2002.  ",
      "doi": "10.1145/1228716.1228734"
    },
    {
      "text": "Green, Penelope. Romancing the Flat Pack: IKEA, Repurposed (2007). The New York Times, 6 September.",
      "doi": ""
    },
    {
      "text": "Grimes, A., Harper, R. (2008). \"Celebratory Technology: New Directions for Food Research in HCI\", Proc. of CHI 2008, Florence, IT.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Harrop, Patrick. Open Sourcery: When Hacker Culture Informs the Design Studio (2007), Journal of Architectural Education, Association of Collegiate Schools of Architecture, 69--72.",
      "doi": ""
    },
    {
      "text": "Ritson, M., Elliot, R., and Eccles, S. Reframing IKEA: Commodity-Signs, Consumer Creativity, and the Social/Self Dialectic (1996). In Advances in Consumer Research 23, 127--131.",
      "doi": ""
    },
    {
      "text": "Rosner, D. K. and Ryokai, K. 2008. Spyn: Augmenting Knitting to Support Storytelling and Reflection. UbiComp '08, 340--349.  ",
      "doi": "10.1145/1409635.1409682"
    },
    {
      "text": "Spradley, J. P., The Ethnographic Interview. Holt, Rinehart and Winston, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Taylor, A.S. and Swan, L., \"Artful systems in the home,\" in Proc. CHI 2005, (2005), 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Torrey, C., D. W. McDonald, B. N. Schilit and S. Bly. (2007) How-To Pages: Informal Systems of Expertise Sharing. Proceedings of the Tenth European Conference on Computer Supported Cooperative Work (ECSCW 2007). Springer. 391--410.",
      "doi": ""
    },
    {
      "text": "Wakkary, R., Maestri, L., The Resourcefulness of Everyday Design (2007), Creativity and Cognition 2007, Washington, D.C., 163--172.  ",
      "doi": "10.1145/1254960.1254984"
    }
  ]
}