{
  "doi": "10.1145/1518701.1519050",
  "title": "GestureBar: improving the approachability of gesture-based interfaces",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2269-2278",
  "year": 2009,
  "badges": [],
  "abstract": "GestureBar is a novel, approachable UI for learning gestural interactions that enables a walk-up-and-use experience which is in the same class as standard menu and toolbar interfaces. GestureBar leverages the familiar, clean look of a common toolbar, but in place of executing commands, richly discloses how to execute commands with gestures, through animated images, detail tips and an out-of-document practice area. GestureBar's simple design is also general enough for use with any recognition technique and for integration with standard, non-gestural UI components. We evaluate GestureBar in a formal experiment showing that users can perform complex, ecologically valid tasks in a purely gestural system without training, introduction, or prior gesture experience when using GestureBar, discovering and learning a high percentage of the gestures needed to perform the tasks optimally, and significantly outperforming a state of the art crib sheet. The relative contribution of the major design elements of GestureBar is also explored. A second experiment shows that GestureBar is preferred to a basic crib sheet and two enhanced crib sheet variations.",
  "tags": [
    "gestures",
    "pen",
    "disclosure",
    "approachability",
    "learning"
  ],
  "authors": [
    {
      "name": "Andrew Bragdon",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/do/10.1145/contrib-81381597937/rel-imgonly/picture.png",
      "acmid": "81381597937",
      "orcid": "missing"
    },
    {
      "name": "Robert Zeleznik",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100099358",
      "orcid": "missing"
    },
    {
      "name": "Brian Williamson",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416598676",
      "orcid": "missing"
    },
    {
      "name": "Timothy Miller",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546105856",
      "orcid": "missing"
    },
    {
      "name": "Joseph J. LaViola",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283513",
      "orcid": "0000-0003-1186-4130"
    }
  ],
  "references": [
    {
      "text": "Alvarado, C. Sketch Recognition User Interfaces: Guidelines for Design and Development. In Proc. of AAAI Fall Symposium on Intelligent Pen-based Interfaces, (2004).",
      "doi": ""
    },
    {
      "text": "Alvarado, C. and Davis, R. SketchREAD: a multi-domain sketch recognition engine. In Proc. of UIST'04, 23--32.  ",
      "doi": "10.1145/1029632.1029637"
    },
    {
      "text": "Bau, O., and Mackay, W. OctoPocus: A Dynamic Guide for Learning Gesture-Based Command Sets. UIST'08, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Buxton, W. Chunking and phrasing and the design of human-computer dialogues. IFIP World Computer Congress'86, 475--480.",
      "doi": ""
    },
    {
      "text": "Buxton, W., Fiume, E., Hill, R., Lee, A., Woo, C. Continuous Hand-Gesture Driven Input. Graphics Interface '83, 191--195.",
      "doi": ""
    },
    {
      "text": "Forsberg, A, Holden, L., Miller, T., and Zeleznik, R. The Music Notepad, Brown University (2005).",
      "doi": ""
    },
    {
      "text": "Grossman, T., Dragicevic, P. and Balakrishnan, R. Strategies for Accelerating Online Learning of Hotkeys. CHI'07, 137--144.  ",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "Grossman, T., Hinckley, K., Baudisch, P., Agrawala, M., Balakrishnan, R. Hover Widgets: Using the Tracking State to Extend the Capabilities of Pen-Operated Devices. CHI'06, 861--870.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Hinckley, K., Baudisch, P., Ramos, G., Guimbretiere, F. Design and Analysis of Delimiters for Selection-Action Pen Gesture Phrases in Scriboli. In Proc. of CHI'05, 453--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Hinckley, K., Zhao, S., Sarin, R., Baudisch, P., Cutrell, Ed., Shilman, M., Tan, D. InkSeine: In Situ Search for Active Note Taking. In Proc. of CHI (2007), 251--260.  ",
      "doi": "10.1145/1240624.1240666"
    },
    {
      "text": "Holm, S. A Simple Sequentially Rejective Multiple Test Procedure. Scandinavian Journal of Statistics, 6 (1979), 60--65.",
      "doi": ""
    },
    {
      "text": "Hong, J. and Landay, J. SATIN: A Toolkit for Informal Ink-Based Applications. In Proc. of UIST (2000), 63--72.  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "Hse, H. and Newton, A. Recognition and beautification of multi-stroke symbols in digital ink. Computers&amp;Graphics, 29, 4 (August 2005), 533--546.  ",
      "doi": "10.1016/j.cag.2005.05.006"
    },
    {
      "text": "Igarashi, T., Matsuoka, S., Kawachiya, S., and Tanaka, H. Interactive Beautification: A Technique for Rapid Geometric Design. In Proc. of UIST (2007), 105--114.  ",
      "doi": "10.1145/263407.263525"
    },
    {
      "text": "Kurtenbach, G., Moran, T. P. and Buxton, W. Contextual Animation of Gestural Commands. Graphics Interface '94, 83--90.",
      "doi": ""
    },
    {
      "text": "Long, C., Landay, J., Rowe, L., and Michiels, J. Visual Similarity of Pen Gestures. In Proc. of CHI'00, 360--367.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Mankoff, J., Hudson, S. and Abowd, G. Providing Integrated Toolkit-level Suport for Ambiguity in Recognition-based Interfaces. CHI'00, 368--375.  ",
      "doi": "10.1145/332040.332459"
    },
    {
      "text": "Microsoft, Inc. Office 2007. 2006.",
      "doi": ""
    },
    {
      "text": "Microsoft, Inc. Windows Vista. 2006.",
      "doi": ""
    },
    {
      "text": "Mouse Gestures Add-on for the Mozilla Firefox Web Browser. http://www.mousegestures.org/.",
      "doi": ""
    },
    {
      "text": "Palm, Inc. Graffiti character recognizer.",
      "doi": ""
    },
    {
      "text": "Polson, P. and Lewis, C. Theory-Based Design for Easily Learned Interfaces. Human-Computer Interaction, 5, 2 (June 1990), 191--220.  ",
      "doi": "10.1207/s15327051hci0502%25263_3"
    },
    {
      "text": "Rubine, D. Specifying Gestures by Example. In Proc. of SIGGRAPH'91, 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Tapia, M., and Kurtenbach, G. Some Design Refinements and Principles on the Appearance and Behavior of Marking Menus. UIST'95, 189--195.25.  ",
      "doi": "10.1145/215585.215973"
    },
    {
      "text": "Wobbrock, J., Wilson, A., and Li, Y. Gestures without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proc. of UIST (2007), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Zeleznik, R., Bragdon, A., Liu, C., and Forsberg, A. Lineogrammer: Creating Diagrams by Drawing. UIST '08, 161--170.  ",
      "doi": "10.1145/1449715.1449741"
    },
    {
      "text": "Zeleznik, R., and Miller, T. Fluid Inking: Augmenting the Medium of Free-Form Inking with Gestures. In Proceedings of Graphics Interface (2006), 155--162. ",
      "doi": "10.5555/1143079.1143105"
    },
    {
      "text": "Zhao, S., Agrawala, M. and Hinckley, K. Zone and Polygon Menus: Using Relative Position to Increase the Breadth of Multi-stroke Marking Menus. CHI (2006), 1077--1086.  ",
      "doi": "10.1145/1124772.1124933"
    }
  ]
}