{
  "doi": "10.1145/1518701.1518775",
  "title": "Autism online: a comparison of word usage in bloggers with and without autism spectrum disorders",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "463-466",
  "year": 2009,
  "badges": [],
  "abstract": "The Internet has become a place of refuge for individuals with autism spectrum disorders (ASD). In particular, weblogs are a popular option for personal expression via the Internet. Perhaps this means of communication is well suited to bypassing deficits in social interaction and communication that characterize ASD. Using the Linguistic Inquiry and Word Count (LIWC) dictionaries [10], we compared blogs of individuals with ASD to the writing of neurotypical (NT) bloggers. We found that rates of word usage were nearly identical in the two groups with one exception - there was more variation in the use of social words in ASD compared to NT blogs. This similarity in language between ASD and NT authors suggests that communication deficits routinely found in people with ASD may be due to the social context in which their communication skills are tested, and that the affordances of asynchronous computer-mediated communication may offer alternative means of testing and expression.",
  "tags": [
    "blogs",
    "word usage",
    "autism spectrum disorders",
    "unobtrusive methodology",
    "liwc",
    "comparative text analysis"
  ],
  "authors": [
    {
      "name": "A. Taylor Newton",
      "institution": "University of Denver, Denver, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606578",
      "orcid": "missing"
    },
    {
      "name": "Adam D.I. Kramer",
      "institution": "University of Oregon, Eugene, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100175734",
      "orcid": "missing"
    },
    {
      "name": "Daniel N. McIntosh",
      "institution": "University of Denver, Denver, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602367",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Psychiatric Association (1994). Diagnostic and statistical manual of mental disorders: DSM-IV (4th ed.). Washington, DC: American Psychiatric Association.",
      "doi": ""
    },
    {
      "text": "Beall, P. M., Moody, E. J., McIntosh, D. N., Hepburn, S. L.,&amp;Reed, C. L. (2008). Rapid facial reactions to emotional facial expressions in typically developing children and children with autism spectrum disorder. J Exp Child Psych, 101, 206--223 .",
      "doi": ""
    },
    {
      "text": "Clark, T. F., Winkielman, P.,&amp;McIntosh, D. N. (in press). Autism and the extraction of emotion from briefly presented facial expressions: Stumbling at the first step of empathy. Emotion.",
      "doi": ""
    },
    {
      "text": "Kramer, A. D. I., Fussell, S. R.&amp;Setlock, L. (2004). Text analysis as a tool for analyzing conversation in online support groups. Proc. CHI, 1485--1488.  ",
      "doi": "10.1145/985921.986096"
    },
    {
      "text": "Kramer, A. D. I.,&amp;Rodden, K. (2008). Word usage and posting behaviors: Modeling blogs with unobstrive data collection methods. Proc. CHI, 1125--1128.  ",
      "doi": "10.1145/1357054.1357230"
    },
    {
      "text": "Mayes, S. D.&amp;Calhoun, S. L. (2003). Analysis of WISC-III, Stanford-Binet:IV, and Academic Achievement Test scores in children with autism. J Autism Dev Disord, 33, 329--341.",
      "doi": ""
    },
    {
      "text": "McIntosh, D. N., Reichmann-Decker, A., Winkielman, P.,&amp;Wilbarger, J. L. (2006). When the social mirror breaks: Deficits in automatic, but not voluntary, mimicry of emotional facial expressions in autism. Dev Sci, 9, 295--302.",
      "doi": ""
    },
    {
      "text": "Muthén, L. K.,&amp;Muthéén, B. (2002). Teacher's Corner: How to Use a Monte Carlo Study to Decide on Sample Size and Determine Power. Structural Equation Modeling: A Multidisciplinary Journal, 9, 599--620.",
      "doi": ""
    },
    {
      "text": "Newschaffer, C.J., Croen, L.A., Daniels, J., Giarelli, E., Grether, J. K., Levy, S. E., et al. (2007). The epidemiology of autism spectrum disorders. Ann Rev Public Health, 28, 235--258.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Francis, M. E.,&amp;Booth, R. J. (2001). Linguistic Inquiry and Word Count: LIWC (2nd Edition). Mahwah, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Mehl, M. R.,&amp;Niederhoffer, K. G. (2003). Psychological aspects of natural language use: Our words, our selves. Ann Rev Psy, 54, 547--577.",
      "doi": ""
    },
    {
      "text": "Rutherford, M. D.,&amp;McIntosh, D. N. (2007). Rules versus prototype matching: Strategies of perception of emotional facial expressions in the autism spectrum. J Autism Dev Disord, 37, 187--196.",
      "doi": ""
    },
    {
      "text": "Saidi, N. (2008, March 28). iReport: \"Naughty Auties\"battle autism with virtual interaction. CNN. Retrieved from http://edition.cnn.com/2008/HEALTH/conditions/03/28/sl.autism.irpt/index.html",
      "doi": ""
    }
  ]
}