{
  "doi": "10.1145/1518701.1519019",
  "title": "Yours, mine and (not) ours: social influences on group information repositories",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2095-2098",
  "year": 2009,
  "badges": [],
  "abstract": "Group information repositories are systems for storing and organizing files in a central location all group members can access. The functionality and capabilities of these systems are essentially the same as the desktop metaphor of personal information management (PIM) systems. Using a case study of a group information repository, I argue that social factors affect the information structure of the repository, and how it grows and evolves over time. Users restrict their activities to files they own, are reluctant to delete files that might be useful to others, dislike the clutter that results, and can become demotivated if no one views files they uploaded.",
  "authors": [
    {
      "name": "Emilee Rader",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489766",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L. M. Berlin, R. Jeffries, V. L. O'Day, A. Paepcke, and C. Wharton. Where did you put it? Issues in the design and use of a group memory. In CHI '93, 23--30, Amsterdam, The Netherlands, 1993. ACM Press.  ",
      "doi": "10.1145/169059.169063"
    },
    {
      "text": "M. D. Gordon. It's 10 a.m. Do you know where your documents are? The nature and scope of information retrieval problems in business. Information Processing&amp;Management, 33(1):107--122, 1997.  ",
      "doi": "10.1016/S0306-4573%2896%2900021-0"
    },
    {
      "text": "G. Jian and L. Jeffres. Understanding employees' willingness to contribute to shared electronic databases: A three dimensional framework. Communication Research, 33(4):242--261, 2006.",
      "doi": ""
    },
    {
      "text": "W. G. Lutters, M. S. Ackerman, and X. Zhou. Group Information Management. In W. Jones and J. Teevan, editors, Personal Information Management. Univ. of Washington Press, 2007.",
      "doi": ""
    },
    {
      "text": "L. M. Markus. Toward a theory of knowledge reuse: Types of knowledge reuse situations and factors in reuse success. Journal of MIS, 18(1):57 -- 93, 2001. ",
      "doi": "10.5555/1289679.1289683"
    },
    {
      "text": "J. C. Tang, C. Drews, M. Smith, F. Wu, A. Sue, and T. Lau. Exploring patterns of social commonality among file directories at work. In CHI '07, 951--960, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240769"
    },
    {
      "text": "S. Voida, W. K. Edwards, M. W. Newman, R. E. Grinter, and N. Ducheneaut. Share and share alike: exploring the user interface affordances of file sharing. In CHI '06, Montreal, Quebec, Canada, 2006.  ",
      "doi": "10.1145/1124772.1124806"
    }
  ]
}