{
  "doi": "10.1145/1518701.1518742",
  "title": "The TeeBoard: an education-friendly construction platform for e-textiles and wearable computing",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "249-258",
  "year": 2009,
  "badges": [],
  "abstract": "The field of wearable computing and e-textiles has recently attracted much interest from the research and general community. Recent developments in this field raises the possibility of e-textile construction kits for hobbyists and novices alike. The unique nature of wearable computing and e-textiles also gives it a lot of potential as an educational computing topic, as it allows students to exercise their creativity and imagination while learning about computing and technology. However, there are numerous difficulties involved in deploying existing technology in an educational environment. Current state of the art technology and techniques are not yet robust or reliable enough to stand up to the demands of educational computing, and they require a high level of skill from the user. In this paper, we present the TeeBoard, a constructive platform for e-textiles and wearable computing that is designed specifically to \"lower the floor\" for the integration of e-textiles into educational computing.",
  "tags": [
    "electronic textiles",
    "educational computing",
    "e-textiles",
    "construction kits",
    "teeboard",
    "wearable computing"
  ],
  "authors": [
    {
      "name": "Grace Ngai",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/do/10.1145/contrib-81100430876/rel-imgonly/grace.jpg",
      "acmid": "81100430876",
      "orcid": "missing"
    },
    {
      "name": "Stephen C.F. Chan",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100177282",
      "orcid": "missing"
    },
    {
      "name": "Joey C.Y. Cheung",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414612977",
      "orcid": "missing"
    },
    {
      "name": "Winnie W.Y. Lau",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414607133",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Available: http://www.lessemf.com/fabric.html.",
      "doi": ""
    },
    {
      "text": "Available: http://www.sparkfun.com.",
      "doi": ""
    },
    {
      "text": "Eduwear project. http://dimeb.informatik.uni-bremen.de/eduwear/.",
      "doi": ""
    },
    {
      "text": "Adams, J. C. Alice, middle schoolers&amp;the imaginary worlds camps. In SIGCSE (2007), pp. 307--311  ",
      "doi": "10.1145/1227310.1227418"
    },
    {
      "text": "Buechley, L. Lilypad arduino - build something. Available: http://www.cs.colorado.edu/ buechley/LilyPad/build.html.",
      "doi": ""
    },
    {
      "text": "Buechley, L., and Eisenberg, M. Fabric pcbs, electronic sequins, and socket buttons: Techniques for e-textile craft. Journal of Personal and Ubiquitous Computing (2007).  ",
      "doi": "10.1007/s00779-007-0181-0"
    },
    {
      "text": "Buechley, L., and Eisenberg, M. The lilypad arduino: Toward wearable engineering for everyone. IEEE Pervasive Computing 7, 2 (2008), 12--15.  ",
      "doi": "10.1109/MPRV.2008.38"
    },
    {
      "text": "Buechley, L., Eisenberg, M., Catchen, J., and Crockett, A. The lilypad arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In CHI '08: Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems (New York, NY, USA, 2008), pp. 104--109.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Buechley, L., Eisenberg, M., and Elumeze, N. Towards a curriculum for electronic textiles in the high school classroom. In ITiCSE '07: Proceedings of the 12th annual SIGCSE conference on Innovation and technology in computer science education (New York, NY, USA, 2007), ACM, pp. 28--32.  ",
      "doi": "10.1145/1268784.1268795"
    },
    {
      "text": "Buechley, L., Elumeze, N., and Eisenberg, M. Electronic/computational textiles and children's crafts. In IDC '06: Proceedings of the 2006 conference on Interaction design and children (New York, NY, USA, 2006), ACM, pp. 49--56.  ",
      "doi": "10.1145/1139073.1139091"
    },
    {
      "text": "Cheung, J. C. Y., Ngai, G., Chan, S. C. F., and Lau, W. W. Y. Filling the gap in programming instruction: a text-enhanced graphical programming environment for junior high students. In Proceedings of SIGCSE'09 (Chattanooga, Tennessee, March 2009).  ",
      "doi": "10.1145/1508865.1508968"
    },
    {
      "text": "Conway, M., Audia, S., Burnette, T., Cosgrove, D., and Christiansen, K. Alice: lessons learned from building a 3d system for novices. In CHI '00: Proceedings of the SIGCHI conference on Human factors in computing systems (New York, NY, USA, 2000), ACM, pp. 486--493.  ",
      "doi": "10.1145/332040.332481"
    },
    {
      "text": "Doerschuk, P., Liu, J., and Mann, J. Pilot summer camps in computing for middle school girls: from organization through assessment. SIGCSE Bul l. 39, 3 (2007), 4--8. 14. Gorlick, M. M. Electric suspenders: A fabric power bus and data network for wearable digital devices. Wearable Computers, IEEE International Symposium 0 (1999), 114.  ",
      "doi": "10.1145/1269900.1268789"
    },
    {
      "text": "Greenberg, S., and Fitchett, C. Phidgets: easy development of physical interfaces through physical widgets. In UIST '01: Proceedings of the 14th annual ACM symposium on User interface software and technology (New York, NY, USA, 2001), ACM, pp. 209--218.  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Hartmann, B., Klemmer, S. R., Bernstein, M., Abdulla, L., Burr, B., Robinson-Mosher, A., and Gee, J. Reflective physical prototyping through integrated design, test, and analysis. In UIST '06: Proceedings of the 19th annual ACM symposium on User interface software and technology (New York, NY, USA, 2006), ACM, pp. 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Hudson, S. E., and Mankoff, J. Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape. In UIST '06: Proceedings of the 19th annual ACM symposium on User interface software and technology (New York, NY, USA, 2006), ACM, pp. 289--298.  ",
      "doi": "10.1145/1166253.1166299"
    },
    {
      "text": "Lau, W. W. Y., Ngai, G., Chan, S. C. F., and Cheung, J. C. Y. Learning programming through fashion and design: A pilot summer course in wearable computing for middle school students. In Proceedings of SIGCSE '09 (Chattanooga, Tennessee, March 2009).  ",
      "doi": "10.1145/1508865.1509041"
    },
    {
      "text": "Lehn, D., Neely, C., Schoonover, K., Martin, T., and Jones, M. e-tags: e-textile attached gadgets. In Communication Networks and Distributed Systems Modeling and Simulation Conference (January 2004). 20. Maloney, J., Burd, L., Kafai, Y., Rusk, N., Silverman, B., and Resnick, M. Scratch: A sneak preview. In C5 '04: Proceedings of the Second International Conference on Creating, Connecting and Collaborating through Computing (Washington, DC, USA, 2004), IEEE Computer Society, pp. 104--109.  ",
      "doi": "10.5555/1009376.1009408"
    },
    {
      "text": "Maloney, J., Burd, L., Kafai, Y., Rusk, N., Silverman, B., and Resnick, M. Scratch: A sneak preview. In C5 '04: Proceedings of the Second International Conference on Creating, Connecting and Col laborating through Computing (Washington, DC, USA, 2004), IEEE Computer Society, pp. 104--109.  ",
      "doi": "10.5555/1009376.1009408"
    },
    {
      "text": "Orth, M., Smith, J. R., Post, E. R., Strickon, J. A., and Cooper, E. B. Musical jacket. In SIGGRAPH '98: ACM SIGGRAPH 98 Electronic art and animation catalog (New York, NY, USA, 1998), ACM, p. 38.  ",
      "doi": "10.1145/281388.281456"
    },
    {
      "text": "Sivilotti, P. A. G., and Laugel, S. A. Scratching the surface of advanced topics in software engineering: a workshop module for middle school students. SIGCSE Bull. 40, 1 (2008), 291--295.  ",
      "doi": "10.1145/1352322.1352235"
    }
  ]
}