{
  "doi": "10.1145/1518701.1518927",
  "title": "Coordinating tasks on the commons: designing for personal goals, expertise and serendipity",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1485-1494",
  "year": 2009,
  "badges": [],
  "abstract": "How is work created, assigned, and completed on large-scale, crowd-powered systems like Wikipedia? And what design principles might enable these federated online systems to be more effective? This paper reports on a qualitative study of work and task practices on Wikipedia. Despite the availability of tag-based community-wide task assignment mechanisms, informants reported that self-directed goals, within-topic expertise, and fortuitous discovery are more frequently used than community-tagged tasks. We examine how Wikipedia editors organize their actions and the actions of other participants, and what implications this has for understanding, and building tools for, crowd-powered systems, or any web site where the main force of production comes from a crowd of online participants. From these observations and insights, we developed WikiTasks, a tool that integrates with Wikipedia and supports both grassroots creation of site-wide tasks and self-selection of personal tasks, accepted from this larger pool of community tasks.",
  "authors": [
    {
      "name": "Michel Krieger",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602647",
      "orcid": "missing"
    },
    {
      "name": "Emily Margarete Stark",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416597278",
      "orcid": "missing"
    },
    {
      "name": "Scott R. Klemmer",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adler, B., and Alfaro, L. Acontent-driven reputation system for the wikipedia. WWW'07: Proceedings of the 16th international conference on World Wide Web (May 2007).  ",
      "doi": "10.1145/1242572.1242608"
    },
    {
      "text": "Allen, D. Getting Things Done: The Art of Stress-Free Productivity. Penguin Books, 2003.",
      "doi": ""
    },
    {
      "text": "Almeida,R.,Mozafari,B.,and Cho,J. On the evolution of wikipedia. Proc. of ICWSM(Dec 2007).",
      "doi": ""
    },
    {
      "text": "Amazon. Mechanical turk {online}. Available from: http://mturk.com.",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Dalal, B., Good, N., Flynn, P., and Bobrow, D. What a to-do: studies of task management towards the design of a personal task list manager.Proceedings of the SIGCHIconference on Human factors in computing(Dec 2004).  ",
      "doi": "10.1145/985692.985785"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., and Smith, I. Taking email to task: the design and evaluation of a task management centered email tool.CHI'03: Proceedings of the SIGCHIconference on Human factors in computing systems(Apr 2003).  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Benkler, Y. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press, 2006. ",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Beschastnikh, I., Kriplean, T., and McDonald, D. Wikipedian self-governance in action: Motivating the policy lens. Association for the Advancement of Artificial Intelligence(2008).",
      "doi": ""
    },
    {
      "text": "Bryant, S., Forte, A., and Bruckman, A. Becoming wikipedian: transformation of participation in a collaborative online encyclopedia.GROUP'05: Proceedings of the 2005 international ACM SIGGROUPconference on Supporting group work (Nov 2005).  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Buriol, L., Castillo, C., Donato, D., and Leonardi, S. Temporal analysis of the wikigraph. Proc. of Web Intelligence(Dec 2006).  ",
      "doi": "10.1109/WI.2006.164"
    },
    {
      "text": "Community, W. Wikipedia {online}. Available from: http://wikipedia.org.",
      "doi": ""
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., and Riedl, J. Using intelligent task routing and contribution review to help communities build artifacts of lasting value. CHI'06: Proceedings of the SIGCHIconference on Human Factors in computing systems(Apr 2006).  ",
      "doi": "10.1145/1124772.1124928"
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., and Riedl, J. Suggestbot: using intelligent task routing to help people find work in wikipedia. IUI'07: Proceedings of the 12th international conference on Intelligent user interfaces(Jan 2007).  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Forte, A., and Bruckman, A. Why do people write for wikipedia?incentives to contribute to open-content publishing.",
      "doi": ""
    },
    {
      "text": "Gabrilovich, E., and Markovitch, S. Computing semantic relatedness using wikipedia-based explicit semantic analysis. Proceedings of the 20th International Joint Conference on &(Dec 2007). ",
      "doi": "10.5555/1625275.1625535"
    },
    {
      "text": "Kittur, A., Chi, E., Pendleton, B., Suh, B., and Mytkowicz, T. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie.CHI '07: Proceeding of the twenty-fifth annual SIGCHI conference on Human factors in computing systems (2007).",
      "doi": ""
    },
    {
      "text": "Kleek, M., Bernstein, M., Karger, D., and mcschraefel. Gui - phooey!: the case for text input. UIST'07: Proceedings of the 20th annual ACMsymposium on User interface software and technology(Oct 2007).  ",
      "doi": "10.1145/1294211.1294247"
    },
    {
      "text": "Kreifelts, T., Hinrichs, E., and Woetzel, G. Sharing to-do lists with a distributed task manager. ECSCW'93: Proceedings of the third conference on European Conference on Computer--Supported Cooperative Work (Sep 1993). ",
      "doi": "10.5555/1241934.1241937"
    },
    {
      "text": "Kriplean, T., Beschastnikh, I., and McDonald, D. Articulations of wikiwork: uncovering valued work in wikipedia through barnstars. InProceedings of the ACM2008 conference on Computer supported cooperative work(2008), ACMNew York, NY, USA, pp. 47--56.  ",
      "doi": "10.1145/1460563.1460573"
    },
    {
      "text": "Kuznetsov, S. Motivations of contributors to wikipedia. ACMSIGCASComputers and Society(Jan 2006).  ",
      "doi": "10.1145/1215942.1215943"
    },
    {
      "text": "Magnus. Wiki todo {online}. Available from: http://toolserver.org/~magnus/wikitodo.php.",
      "doi": ""
    },
    {
      "text": "Pearce, J. Volunteers: The organizational behavior of unpaid workers. books.google.com(Jan 1993).",
      "doi": ""
    },
    {
      "text": "Riehle, D. How and why wikipedia works: an interview with angela beesley, elisabeth bauer, and kizu naoko. WikiSym '06: Proceedings of the 2006 international symposium on Wikis(Aug 2006).  ",
      "doi": "10.1145/1149453.1149456"
    },
    {
      "text": "Stalder, F., and Hirsh, J. Open source intelligence. First Monday 7, 6 (2002).",
      "doi": ""
    },
    {
      "text": "Suh, B., Chi, E., Kittur, A., and Pendleton, B. Lifting the veil: improving accountability and social transparency in wikipedia with wikidashboard. CHI '08: Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems (Apr 2008).  ",
      "doi": "10.1145/1357054.1357214"
    },
    {
      "text": "Viégas, F., Wattenberg, M., and Dave, K. Studying cooperation and conflict between authors with history flow visualizations. CHI'04: Proceedings of the SIGCHIconference on Human factors in computing systems(Apr 2004).  ",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "Viégas, F., Wattenberg, M., and McKeon, M. M. The hidden order of wikipedia. HCII(2007).",
      "doi": ""
    },
    {
      "text": "Wattenberg, M., Viegas, F., and Hollenbach, K. Visualizing activity on wikipedia with chromograms. LECTURENOTESINCOMPUTERSCIENCE(Dec 2007).",
      "doi": ""
    },
    {
      "text": "Whittaker, S., and Sidner, C. Email overload: exploring personal information management of email.CHI'96: Proceedings of the SIGCHIconference on Human factors in computing systems: common ground(Apr 1996).  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}