{
  "doi": "10.1145/1518701.1518873",
  "title": "Design research as explanation: perceptions in the field",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1121-1130",
  "year": 2009,
  "badges": [],
  "abstract": "We report results from interviews with HCI design researchers on their perceptions of how their research relates to the more traditional scientific goal of providing explanations. Theories of explanation are prominent in the physical and natural sciences, psychology, the social sciences, and engineering. Little work though has so-far addressed the special case of how results from reflective design of interactive systems can help provide explanations. We found conceptions of explanation in design research to be broader and more inclusive than those commonly found in the philosophy of science. We synthesized concepts from the interviews into a framework which may help researchers understand how their contributions relate to both classical and emergent conceptions of explanation.",
  "tags": [
    "design research",
    "theories of explanation",
    "design science"
  ],
  "authors": [
    {
      "name": "Steven R. Haynes",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100410098",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    },
    {
      "name": "Thomas G. Kannampallil",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100137586",
      "orcid": "missing"
    },
    {
      "name": "Lu Xiao",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496684572",
      "orcid": "missing"
    },
    {
      "name": "Paula M. Bach",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100328344",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fallman, D., Design-oriented human-computer interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (Ft. Lauderdale, Florida, USA, 2003), 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J. and Evenson, S., Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (San Jose, California, USA, 2007), 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Hempel, C.G. Aspects of Scientific Explanation. In Hempel, C.G. ed. Aspects of Scientific Explanation and Other Essays in the Philosophy of Science, Free Press, New York, 1965.",
      "doi": ""
    },
    {
      "text": "Pitt, J.C. Theories of explanation. Oxford University Press, New York, 1988.",
      "doi": ""
    },
    {
      "text": "Gasper, P. Causation and Explanation. In Boyd, R., Gasper, P. and Trout, J.D. eds. The Philosophy of Science, MIT Press, Cambridge, MA, 1991.",
      "doi": ""
    },
    {
      "text": "Davidson, D. Psychology as Philosophy. In Brown, S.C. ed. Philosophy of Psychology, Barnes&amp;Noble, New York, 1974, 41--52.",
      "doi": ""
    },
    {
      "text": "Little, D. Varieties of social explanation. Westview Press, Boulder, 1991.",
      "doi": ""
    },
    {
      "text": "van Fraassen, B.C. The Pragmatic Theory of Explanation. In Pitt, J.C. ed. Theories of Explanation, Oxford University Press, Oxford, UK, 1988, 135--155.",
      "doi": ""
    },
    {
      "text": "Kincaid, H. Assessing Functional Explanation in the Social Sciences. In Martin, M. and McIntyre, L.C. eds. Readings in the Philosophy of Social Science, MIT Press, Cambridge, MA, 1994.",
      "doi": ""
    },
    {
      "text": "Cummins, R. Functional Analysis. The Journal of Philosophy, 72, (1975), 741--765.",
      "doi": ""
    },
    {
      "text": "Elster, J. Explaining Technical Change: A Case Study in the Philosophy of Science. Cambridge University Press, Cambridge, UK, 1983.",
      "doi": ""
    },
    {
      "text": "Freeman, P. and Hart, D. A science of design for software-intensive systems. Communications of ACM, 47, 8, (2004), 19--21.  ",
      "doi": "10.1145/1012037.1012054"
    },
    {
      "text": "Wolf, T.V., Rode, J.A., Sussman, J. and Kellogg, W.A., Dispelling \"design\" as the black art of CHI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (Montréal, Québec, Canada, 2006), 521--530.  ",
      "doi": "10.1145/1124772.1124853"
    },
    {
      "text": "Löwgren, J., Applying design methodology to software development. In Proceedings of the Conference on Designing Interactive Systems: Processes, Practices, Methods,&amp;Techniques, (Ann Arbor, Michigan, United States, 1995), 87--95.  ",
      "doi": "10.1145/225434.225444"
    },
    {
      "text": "Sengers, P. and Gaver, B. Staying open to interpretation: engaging multiple meanings in design and evaluation Proceedings of the 6th ACM conference on Designing Interactive Systems, ACM Press, University Park, PA, USA, 2006.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Gaver, B., Beaver, J. and Benford, S. Ambiguity as a resource for design Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, Ft. Lauderdale, Florida, USA, 2003.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Rittel, H. and Webber, M. Dilemmas in a General Theory of Planning. Policy Science, 4, (1973), 155--169.",
      "doi": ""
    },
    {
      "text": "Mills, C.W. The Sociological Imagination. Oxford University Press, London, 1959.",
      "doi": ""
    },
    {
      "text": "Amara, N., Ouimet, M. and Landry, R. New Evidence on Instrumental, Conceptual, and Symbolic Utilization of University Research in Government Agencies. Science Communication, 26, 1, (2004), 75--106.",
      "doi": ""
    },
    {
      "text": "Vincenti, W.G. What Engineers Know and How They Know It: Analytical Studies from Aeronautical History. The Johns Hopkins University Press, Baltimore, 1990.",
      "doi": ""
    },
    {
      "text": "Curtis, B., Krasner, H. and Iscoe, N. A Field Study of the Software Design Process for Large Systems. Communications of the ACM, 31, 11, (1988), 1268--1287.  ",
      "doi": "10.1145/50087.50089"
    },
    {
      "text": "Geertz, C. The interpretation of cultures: selected essays. Basic Books, New York, 1973.",
      "doi": ""
    },
    {
      "text": "Schön, D. and Bennett, J. Reflective Conversation with Materials. In Winograd, T. ed. Bringing Design to Software, Addison-Wesley, 1996, 171 -- 189.  ",
      "doi": "10.1145/229868.230044"
    },
    {
      "text": "Carroll, J.M. and Kellogg, W.A. Artifact as theory-nexus: hermeneutics meets theory-based design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: Wings For the Mind, (1989), 7--14.  ",
      "doi": "10.1145/67449.67452"
    },
    {
      "text": "Petroski, H. Success through failure: the paradox of design. Princeton University Press, Princeton, 2006.",
      "doi": ""
    }
  ]
}