{
  "doi": "10.1145/1518701.1518861",
  "title": "UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1043-1052",
  "year": 2009,
  "badges": [],
  "abstract": "The greatest contributor of CO2 emissions in the average American household is personal transportation. Because transportation is inherently a mobile activity, mobile devices are well suited to sense and provide feedback about these activities. In this paper, we explore the use of personal ambient displays on mobile phones to give users feedback about sensed and self-reported transportation behaviors. We first present results from a set of formative studies exploring our respondents' existing transportation routines, willingness to engage in and maintain green transportation behavior, and reactions to early mobile phone \"green\" application design concepts. We then describe the results of a 3-week field study (N=13) of the UbiGreen Transportation Display prototype, a mobile phone application that semi-automatically senses and reveals information about transportation behavior. Our contributions include a working system for semi-automatically tracking transit activity, a visual design capable of engaging users in the goal of increasing green transportation, and the results of our studies, which have implications for the design of future green applications.",
  "authors": [
    {
      "name": "Jon Froehlich",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81331492504/rel-imgonly/81331492504.jpg",
      "acmid": "81331492504",
      "orcid": "0000-0001-8291-3353"
    },
    {
      "name": "Tawanna Dillahunt",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606961",
      "orcid": "0000-0002-1155-8507"
    },
    {
      "name": "Predrag Klasnja",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594537",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Sunny Consolvo",
      "institution": "Intel Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459425",
      "orcid": "0000-0001-5337-328X"
    },
    {
      "name": "Beverly Harrison",
      "institution": "Intel Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010116",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Abrahamse, W., Steg, L., Vlek, C.,&amp;Rothengatter, T. (2005). A review of intervention studies aimed at household energy conservation. J. of Environmental Psychology, 25:273--291.",
      "doi": ""
    },
    {
      "text": "Ampt, E. (2003). Understanding voluntary travel behavior change. 26th Australasian Transport Research Forum, 22.",
      "doi": ""
    },
    {
      "text": "Bin, S., Dowlatabadi, H., (2005). Consumer lifestyle approach to US energy use and the related CO2 emissions. Energy Policy, 33:197--208.",
      "doi": ""
    },
    {
      "text": "Carter, S. and Mankoff, J. (2005). When participants do the capturing: the role of media in diary studies. CHI'05, 899--908.  ",
      "doi": "10.1145/1054972.1055098"
    },
    {
      "text": "Carter, S., Mankoff, J. and Heer, J. (2007). Momento: Support for situated ubicomp evaluation. CHI'07, 125--134.  ",
      "doi": "10.1145/1240624.1240644"
    },
    {
      "text": "Carter, S., Mankoff, J., Klemmer, S. and Matthews, T. (2008). Exiting the cleanroom: On ecological validity and ubiquitous computing. HCI Journal 2008.",
      "doi": ""
    },
    {
      "text": "Chamberlain, A., Benford, S., Greenhalgh, C., Hamphsire, A., Tandavanitj, N., Adams, M., Oldroyd, A.&amp;Sutton, J. (2007). Professor Tanda: Greener gaming&amp;pervasive play. DUX'07.  ",
      "doi": "10.1145/1389908.1389942"
    },
    {
      "text": "Choudhury, T., et al. (2008). The Mobile Sensing Platform: An Embedded System for Capturing and Recognizing Human Activities. IEEE Pervasive Computing, 7(2).  ",
      "doi": "10.1109/MPRV.2008.39"
    },
    {
      "text": "Consolvo, S., Harrison, B., Smith, I., Chen, M. Y., Everitt, K., Froehlich, J., Landay, J. (2007). Conducting in situ evaluations for and with ubiquitous computing technologies. IJHCI, 22(1-2):103--118.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., McDonald, D. W., Toscos, T., Chen, M. Y., Froehlich, J., Harrison, B., Klasnja, P., LaMarca, A., LeGrand, L., Libby, R., Smith, I., Landay, J. A. (2008). Activity sensing in the wild: A field trial of UbiFit Garden. CHI'08, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Csikszentmihalyi, M. and Larson, R. (1987). Validity and reliability of the Experience Sampling Method. Journal of Nervous and Mental Disease, 175(9):526--536.",
      "doi": ""
    },
    {
      "text": "De Young, R. (2003). Expanding and Evaluating Motives for Environmentally Responsible Behavior. J. of Social Issues, 56(3):509--526.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T., Becker, G., Mankoff, J. and Kraut, R. (2008). Motivating environmentally sustainable behavior changes with a virtual polar bear. Pervasive'08 Workshop on Pervasive Persuasive Technology and Environmental Sustainability.",
      "doi": ""
    },
    {
      "text": "Donath, J. (2004). Artificial Pets: Simple Behaviors Elicit Complex Attachments. In M. Bekoff (ed.), The Encyclopedia of Animal Behavior, Greenwood Press.",
      "doi": ""
    },
    {
      "text": "Fischer, C. (2008). Feedback on household electricity consumption: a tool for saving energy? Energy Efficiency 2008, 1:79--104",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. (2002). Persuasive Computer: Using Technology to Change What We Think and Do. Morgan Kaufman: SF, CA. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Frank, L. D., Saelens, B. E., Powell, K. E.&amp;Chapman, J. E. (2007). Stepping towards causation: Do built environments or neighborhood and travel preferences explain physical activity, driving, and obesity? Social Science and Medicine 65:1898--1914",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Chen, M., Consolvo, S., Harrison, B.,&amp;Landay, J. (2007) MyExperience: A System for In Situ Tracing and Capturing of User Feedback on Mobile Phones, MobiSys 2007, 57--70.  ",
      "doi": "10.1145/1247660.1247670"
    },
    {
      "text": "Froehlich, J. and Krumm, J. (2008). Route prediction from trip observations, Intelligent Vehicle Initiative (IVI) Technology Advanced Controls&amp;Navigation Systems, SAE World Congress&amp;Exhibition, Detroit, Michigan, April 14-17, 2008.",
      "doi": ""
    },
    {
      "text": "Hansen, J. (2006). The threat to the planet. New York Review of Books.",
      "doi": ""
    },
    {
      "text": "Higgins, E.T. Knowledge activation: Accessibility, applicability, and salience. Social psychology: Handbook of basic principles, Guilford Press, New York, 1996, 133--168.",
      "doi": ""
    },
    {
      "text": "Hu, P.S. and T.R. Reuscher. (2004). Summary of Travel Trends, 2001 National Household Travel Survey, U.S.F.H.A. U.S. Department of Transportation, Editor. 2004.",
      "doi": ""
    },
    {
      "text": "Li, Y. and Landay, J. (2008). Activity-based prototyping of ubicomp applications for long-lived, everyday human activities. In Proc. CHI'08, 1303--1312.  ",
      "doi": "10.1145/1357054.1357259"
    },
    {
      "text": "Matthews, T. (2007). Designing and evaluating glanceable peripheral visualizations, Ph.D. Thesis, EECS Department, UC Berkeley. ",
      "doi": "10.5555/1354857"
    },
    {
      "text": "Myers, O.E. Jr., Saunders C.D. (2002). Animals as links toward developing caring relationships with the natural world. In Kahn and Kelert (eds). Children and Nature, 153--178.",
      "doi": ""
    },
    {
      "text": "Maibach, E. W. (2003). Recreating communities to support active living: A new role for social marketing. American Journal of Health Promotion 18(1):114--119.",
      "doi": ""
    },
    {
      "text": "Mankoff, J, Matthews, D., Fussell, S.R., Johnson, M. (2007). Leveraging social networks to motivate individuals to reduce their ecological footprints. HICSS '07, 87  ",
      "doi": "10.1109/HICSS.2007.325"
    },
    {
      "text": "Petersen, J. E, Shunturov, V., Janda, K., Platt, G.&amp;Weinberger, K. (2005). Does providing dormitory residents with feedback on energy and water use lead to reduced consumption? Greening the Campus VI.",
      "doi": ""
    },
    {
      "text": "Saponas, T., Lester, J., Froehlich, J, Fogarty, J., Landay, J. 2008. iLearn on the iPhone: Real-Time Human Activity Classification on Commodity Mobile Phones. UW-CSE-08-04--02 Tech Report.",
      "doi": ""
    },
    {
      "text": "Sohn, T., et al. (2006). Mobility detection using everyday GSM traces. Ubicomp'06, 212--224.  ",
      "doi": "10.1007/11853565_13"
    },
    {
      "text": "Stasko, J., Mccolgin, D., Miller, T., Plaue, C.&amp;Pousman, Z. (2005). Evaluating the InfoCanvas peripheral awareness system: A longitudinal, in situ study. Technical Report GIT-GVU-05-08",
      "doi": ""
    },
    {
      "text": "U.S. Department of Energy (2006) Annual Energy Review 2005. Energy Information Administration, Washington, DC DOE/EIA-0384.",
      "doi": ""
    },
    {
      "text": "Vining, J. (2003). The connection to other animals and caring for nature. Human Ecology Review, 10(2).",
      "doi": ""
    },
    {
      "text": "Wash, R., Hemphill, L. and Resnick, P. (2005). Design decisions in the RideNow project. SIGGROUP'05, 132--135.  ",
      "doi": "10.1145/1099203.1099228"
    },
    {
      "text": "Weber, C. L.&amp;Matthews, H. S. (2008). Quantifying the global&amp;distributional aspects of American household carbon footprint. Ecological Economics. Elsevier, vol. 66(2-3), pp 379--391",
      "doi": ""
    }
  ]
}