{
  "doi": "10.1145/1518701.1518824",
  "title": "Videolyzer: quality analysis of online informational video for bloggers and journalists",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "799-808",
  "year": 2009,
  "badges": [],
  "abstract": "Tools to aid people in making sense of the information quality of online informational video are essential for media consumers seeking to be well informed. Our application, Videolyzer, addresses the information quality problem in video by allowing politically motivated bloggers or journalists to analyze, collect, and share criticisms of the information quality of online political videos. Our interface innovates by providing a fine-grained and tightly coupled interaction paradigm between the timeline, the time-synced transcript, and annotations. We also incorporate automatic textual and video content analysis to suggest areas of interest for further assessment by a person. We present an evaluation of Videolyzer looking at the user experience, usefulness, and behavior around the novel features of the UI as well as report on the collaborative dynamic of the discourse generated with the tool.",
  "authors": [
    {
      "name": "Nicholas Diakopoulos",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309489274",
      "orcid": "0000-0001-5005-6123"
    },
    {
      "name": "Sergio Goldenberg",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381602997",
      "orcid": "missing"
    },
    {
      "name": "Irfan Essa",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81100313702/rel-imgonly/121029ar569-cropped.jpeg",
      "acmid": "81100313702",
      "orcid": "0000-0002-6236-2969"
    }
  ],
  "references": [
    {
      "text": "Compendium. http://compendium.open.ac.uk/",
      "doi": ""
    },
    {
      "text": "Open Calais. http://www.opencalais.com",
      "doi": ""
    },
    {
      "text": "Abowd, G., Gauger, M. and Lachenmann, A., The Family Video Archive: an annotation and browsing environment for home movies. in Proceedings of the 5th ACM SIGMM international workshop on Multimedia information retrieval, (2003), 1--8.  ",
      "doi": "10.1145/973264.973266"
    },
    {
      "text": "Brill, E., A Simple Rule-Based Part of Speech Tagger. in Conference on Applied Computational Linguistics, (1993), 112--116.  ",
      "doi": "10.3115/1075527.1075553"
    },
    {
      "text": "Chklovski, T., Ratnakar, V. and Gil, Y., User Interfaces with Semi-Formal Representation: a Study of Designing Argumentation Structures. in Intelligent User Interfaces (IUI), (2005).  ",
      "doi": "10.1145/1040830.1040864"
    },
    {
      "text": "Cockburn, A. and Dale, T., CEVA: A Tool for Collaborative Video Analysis. in GROUP, (1997), 47--55.  ",
      "doi": "10.1145/266838.266857"
    },
    {
      "text": "Diakopoulos, N. and Essa, I., An Annotation Model for Making Sense of Information Quality in Online Video. in International Conference on the Pragmatic Web, (2008).  ",
      "doi": "10.1145/1479190.1479195"
    },
    {
      "text": "Diakopoulos, N., Luther, K. and Essa, I., Audio Puzzler: Piecing Together Time-Stamped Speech Transcripts with a Puzzle Game. in ACM Multimedia, (2008).  ",
      "doi": "10.1145/1459359.1459507"
    },
    {
      "text": "Dieberger, A., Dourish, P., Höök, K., Resnick, P. and Wexelblat, A. Social Navigation: Techniques for Building More Usable Systems interactions, 2000.",
      "doi": ""
    },
    {
      "text": "Franklin, B., Hamer, M., Hanna, M., Kinsey, M. and Richardson, J.E. Key Concepts in Journalism Studies. Sage Publications, 2005.",
      "doi": ""
    },
    {
      "text": "Gil, Y. and Ratnakar, V., Trusting Information Sources One Citizen at a Time. in International Semantic Web Conference (ISWC), (2002). ",
      "doi": "10.5555/646996.711278"
    },
    {
      "text": "Heer, J., Viegas, F. and Wattenberg, M., Voyagers and voyeurs: supporting asynchronous collaborative information visualization. in Proceedings of CHI, (2007), 1029--1038.  ",
      "doi": "10.1145/1240624.1240781"
    },
    {
      "text": "Jackson, B. and Jamieson, K.H. unSpun: finding facts in a world of disinformation. Random House Trade Paperbacks, 2007.",
      "doi": ""
    },
    {
      "text": "Keelan, J., Pavri-Garcia, V., Tomlinson, G. and Wilson, K. YouTube as a source of Information on Immunization: A Content Analysis. Journal of the American Medical Association, 298 (21). 2482--2284.",
      "doi": ""
    },
    {
      "text": "Kirschner, P., Buckingham Shum, S. and Carr, C. (eds.). Visualization Argumentation: Software Tools for Collaborative and Educational Sense-Making. Springer-Verlag, 2003. ",
      "doi": "10.5555/779331"
    },
    {
      "text": "Kovach, B. and Rosenstiel, T. The Elements of Journalism: What Newspeople Should Know and the Public Should Expect. Three Rivers Press, 2007.",
      "doi": ""
    },
    {
      "text": "Leech, G. Meaning and The English Verb. Pearson Education Limited, 2004.",
      "doi": ""
    },
    {
      "text": "Li, F., Gupta, A., Sanocki, e., He, L.-w. and Rui, Y., Browsing Digital Video. in Proceedings of CHI, (2000).  ",
      "doi": "10.1145/332040.332425"
    },
    {
      "text": "Mackay, W.E. EVA: an experimental video annotator for symbolic analysis of video data. SIGCHI Bull., 21 (2). 68--71.  ",
      "doi": "10.1145/70609.70617"
    },
    {
      "text": "Pioch, N. and Everett, J., POLESTAR: Collaborative Knowledge Management and Sensemaking Tools for Intelligence Analysts. in Conference on Information and Knowledge Management, (2006), 513--521.  ",
      "doi": "10.1145/1183614.1183688"
    },
    {
      "text": "Serano, B., Buckingham Shum, S. and Motta, E., ClaimSpotter: An Environment to Support Sensemaking with Knowledge Triples. in Intelligent User Interfaces (IUI), (2005).  ",
      "doi": "10.1145/1040830.1040875"
    },
    {
      "text": "Shipman, F. and Marshall, C., Formality Considered Harmful: Experiences, Emerging Themes, and Directions on the Use of Formal Representations in Interactive Systems. in CSCW, (1999), 333--352.  ",
      "doi": "10.1023/A%3A1008716330212"
    },
    {
      "text": "Simon Buckingham Shum, R.S., Michael Daw, Ben Juby, Andrew Rowley, Michelle Bachler, Clara Mancini, Danius Michaelides, Rob Procter, David De Roure, Tim Chown, Terry Hewitt. Memetic: An Infrastructure for Meeting Memory, 2006.",
      "doi": ""
    }
  ]
}