{
  "doi": "10.1145/1518701.1519013",
  "title": "Clinical evaluations and collaborative design: developing new technologies for mental healthcare interventions",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2051-2060",
  "year": 2009,
  "badges": [],
  "abstract": "Ethical requirements, severe constraints on access to end users and the necessity of real-world clinical evaluations represent significant challenges to designers of new technologies in mental healthcare (MHC) settings. This paper describes the collaborative approaches, incorporating HCI methods with input for MHC professionals and MHC theory, which were applied in the development of Personal Investigator (PI), a 3D computer game developed to support adolescent mental health interventions. Different stages in the evaluation of PI are discussed and the lessons learned through a multi-site clinical evaluation are presented. This evaluation has provided strong initial evidence that games such as PI offer the potential to improve adolescent engagement in talk-based interventions. It has also provided an insight into factors which should be considered in future designs in the MHC domain, e.g. the need to incorporate high levels of adaptability in future systems. Based on the difficulties encountered and lessons learned critical aims for future research are outlined.",
  "authors": [
    {
      "name": "David Coyle",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81333488106/rel-imgonly/davidcoyle.jpg",
      "acmid": "81333488106",
      "orcid": "0000-0002-5103-0379"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Surgeon General, Mental Health: A Report of the Surgeon General. 1999, Department of Health and Human Services: Washington, DC.",
      "doi": ""
    },
    {
      "text": "WHO World Mental Health Survey Consortium, Prevalence, severity, and unmet need for treatment of mental disorders in the World Health Organization World Mental Health Surveys. Journal of the American Medical Association, 2004. 291(21).",
      "doi": ""
    },
    {
      "text": "BMA, Child and adolescent mental health - a guide for healthcare professionals. 2006, Board of Science of the British Medical Association: London.",
      "doi": ""
    },
    {
      "text": "Coyle, D., G. Doherty, J. Sharry and M. Matthews, Computers in Talk-Based Mental Health Care. Interacting with Computers, 2007. 19(4): p. 545--562.  ",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "Matthews, M., G. Doherty, D. Coyle and J. Sharry, Designing mobile applications to support mental health interventions, in Handbook of Research on User Interface Design and Evaluation for Mobile Technology, J. Lumsden, Editor. 2007.",
      "doi": ""
    },
    {
      "text": "Gulliksen, J., B. Göransson, I. Boivie, S. Blomkvist, J. Persson and Å. Cajander, Key principles for user-centred systems design. Behaviour and Information Technology, 2003. 22(6): p. 397--410.",
      "doi": ""
    },
    {
      "text": "World Medical Association. World Medical Association Declaration of Helsinki: Ethical Principles for Medical Research Involving Human Subjects. 1964--2004.",
      "doi": ""
    },
    {
      "text": "Sainfort, F., J.A. Jacko and B.C. Booske, Human-Computer Interaction in Health Care, in The Human-Computer Interaction Handbook - Fundamentals, Evolving Technologies and Emerging Applications, J.A. Jacko and A. Sears, Editors. 2003, Lawrence Erlbaum Associates: Mahwah, New Jersey. p. 808--822. ",
      "doi": "10.5555/772072.772123"
    },
    {
      "text": "Johnson, C.M., T.R. Johnson and J. Zhang, A user-centred framework for redesigning health care interfaces. Journal of Biomedical Informatics, 2005. 38(1): p. 75--87.  ",
      "doi": "10.1016/j.jbi.2004.11.005"
    },
    {
      "text": "Newell, A.F. and P. Gregor. User Sensitive Inclusive Design - in search of a new paradigm. In CUU'00, ACM Conference on Universal Usability, 2000. Arlington, VA.  ",
      "doi": "10.1145/355460.355470"
    },
    {
      "text": "Boyd-Graber, J., S. Nikolova, K. Moffatt, K. Kin, J. Lee, L. Mackey, M. Tremaine and M. Klawe. Participatory Design with Proxies: Developing a Desktop-PDA System to Support People with Aphasia. In CHI'06, ACM Conference on Human Factors in Computer Systems, 2006. Montréal, Québec, Canada.  ",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "McFarlane, A., A. Sparrowhawk and Y. Heald, Report on Educational Use of Games: Teachers Evaluating Educational Multimedia, 2002, TEEM.",
      "doi": ""
    },
    {
      "text": "Gentile, D.A. and D.A. Walsh, A normative study of family media habits. Journal of Applied Developmental Psychology, 2002. 23: p. 157--178.",
      "doi": ""
    },
    {
      "text": "Schaefer, C.E. and S.E. Reid, eds. Game play: therapeutic use of childhood games. 2001, Chichester: Wiley, New York.",
      "doi": ""
    },
    {
      "text": "Coyle, D., M. Matthews, J. Sharry, A. Nisbet and G. Doherty, Personal Investigator: A Therapeutic 3D Game for Adolescent Psychotherapy. International Journal of Interactive Technology and Smart Education, 2005. 2(2): p. 73--88.",
      "doi": ""
    },
    {
      "text": "Kirriemuir, J. and A. McFarlane, Literature Review in Games and Learning. 2004, NESTA Futurelab: Bristol.",
      "doi": ""
    },
    {
      "text": "Kato, P.M., Factors Affecting Acceptability to Young Cancer Patients of a Psychoeducational Video Game About Cancer. Journal of Pediatric Oncology Nursing, 2006. 23(5): p. 269--275.",
      "doi": ""
    },
    {
      "text": "Lindley, C.A. Conditioning, Learning and Creation in Games: Narrative, The Gameplay Gestalt and Creative Simulation. In NILE2002, Narrative Interaction and Learning Environments. 2002. Edinburgh.",
      "doi": ""
    },
    {
      "text": "De Shazer, S., Clues: Investigating Solutions in Brief Therapy. 1st edition ed. 1988, New York, N.Y.: W. W. Norton&amp;Company. 202.",
      "doi": ""
    },
    {
      "text": "Elliott, J., L. Adams and A. Bruckman. No Magic Bullet: 3d Video Games in Education. In ICLS2002 International Conference of the Learning Sciences. 2002. Seattle.",
      "doi": ""
    },
    {
      "text": "Jinks, G., Specific Strategies and Techniques, in Handbook of Counselling and Psychotherapy, C. Feltham and I. Horton, Editors. 2000, Sage Publications: London. p. 122--151.",
      "doi": ""
    },
    {
      "text": "Botella, C., R. Baños, B. Rey, M. Alcañiz, V. Guillen, S. Quero and A. García-Palacios. Using an adaptive display for the treatment of emotional disorders: a preliminary analysis of effectiveness. Extended abstract in CHI'06, ACM Conference on Human Factors in Computing Systems. 2006. Montréal, Québec, Canada.  ",
      "doi": "10.1145/1125451.1125574"
    }
  ]
}