{
  "doi": "10.1145/1518701.1518891",
  "title": "Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1265-1274",
  "year": 2009,
  "badges": [],
  "abstract": "Ninety million Americans have inadequate health literacy, resulting in a reduced ability to read and follow directions in the healthcare environment. We describe an animated, empathic virtual nurse interface for educating and counseling hospital patients with inadequate health literacy in their hospital beds at the time of discharge. The development methodology, design rationale, and two iterations of user testing are described. Results indicate that hospital patients with low health literacy found the system easy to use, reported high levels of satisfaction, and most said they preferred receiving the discharge information from the agent over their doctor or nurse. Patients also expressed appreciation for the time and attention provided by the virtual nurse, and felt that it provided an additional authoritative source for their medical information.",
  "authors": [
    {
      "name": "Timothy W. Bickmore",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-81100360895/rel-imgonly/81100360895.jpg",
      "acmid": "81100360895",
      "orcid": "0000-0002-2676-9788"
    },
    {
      "name": "Laura M. Pfeifer",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-81381591529/rel-imgonly/lauravar-small.jpg",
      "acmid": "81381591529",
      "orcid": "missing"
    },
    {
      "name": "Brian W. Jack",
      "institution": "Boston University School of Medicine, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607104",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ad Hoc Committee on Health Literacy for the Council on Scientific Affairs, A. M. A. Health literacy: report of the Council on Scientific Affairs. JAMA, 281, 6 (1999), 552--557.",
      "doi": ""
    },
    {
      "text": "Baker, D., Parker, R., Williams, M., and Clark, S. Health literacy and the risk of hospital admission. J Gen Intern Med, 13 (1998), 791--8.",
      "doi": ""
    },
    {
      "text": "Bers, M., Ackermanntt, E., et al, Interactive Storytelling Environments: Coping with Cardiac Illness at Boston's Children's Hospital, Proc. CHI 1998, ACM Press (1998).  ",
      "doi": "10.1145/274644.274725"
    },
    {
      "text": "Bickmore, T., Caruso, L., and Clough-Gorr, K., Acceptance and Usability of a Relational Agent Interface by Urban Older Adults, Proc. CHI 2005, ACM Press (2005).  ",
      "doi": "10.1145/1056808.1056879"
    },
    {
      "text": "Bickmore, T. and Pfeifer, L., Relational Agents for Antipsychotic Medication Adherence CHI'08 Workshop on Technology in Mental Health, (2008).",
      "doi": ""
    },
    {
      "text": "Bickmore, T., Pfeifer, L., and Yin, L. The Role of Gesture in Document Explanation by Embodied Conversational Agents. International Journal of Semantic Computing, 2, 1, (2008), 47--70.",
      "doi": ""
    },
    {
      "text": "Bickmore, T. and Picard, R. Establishing and maintaining long-term human-computer relationships. ACM Trans. Comput.-Hum. Interact., 12, 2, (2005), 293--327.  ",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Bickmore, T. and Picard, R. Establishing and Maintaining Long-Term Human-Computer Relationships. ACM Transactions on Computer Human Interaction, 12, 2, (2005), 293--327.  ",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Cassell, J., Sullivan, J., Prevost, S., and Churchill, E., Eds., Embodied Conversational Agents, The MIT Press, Cambridge, MA, (2000).",
      "doi": ""
    },
    {
      "text": "Clark, H. H. and Brennan, S. E., Grounding in Communication. In L. B. Resnick, J. M. Levine, and S. D. Teasley, Eds., Perspectives on Socially Shared Cognition, American Psychological Association, Washington, 1991, pp. 127--149.",
      "doi": ""
    },
    {
      "text": "Davidoff, F. Time. Ann Intern Med, 127, (1997), 483--485.",
      "doi": ""
    },
    {
      "text": "Davis, T. C., Long, S. W., Jackson, R. H., Mayeaux, E. J., George, R. B., Murphy, P. W., and Crouch, M. A. Rapid estimate of adult literacy in medicine: a shortened screening instrument. Fam Med, 25, 6, (1993) 391--5.",
      "doi": ""
    },
    {
      "text": "Doak, C., Doak, L., and Root, J., Teaching patients with low literacy skills, 2nd ed., JB Lippincott, Philadelphia, PA, (1996).",
      "doi": ""
    },
    {
      "text": "Forster, A., Murff, H., Peterson, J., Gandhi, T., and Bates, D. The Incidence and Severity of Adverse Events Affecting Patients after Discharge from the Hospital. Annals of Internal Medicine, 138, (2003).",
      "doi": ""
    },
    {
      "text": "Frankel, R. Emotion and the Physician-Patient Relationship. Motivation and Emotion, 19, 3, (1995) 163--173.",
      "doi": ""
    },
    {
      "text": "Garrity, T. Medical compliance and the clinician-patient relationship: a review. Soc Sci Med, 15E, (1981) 215--222.",
      "doi": ""
    },
    {
      "text": "Gerber, B. S., Brodsky, I. G., Lawless, K. A., and et. al. Implementation and Evaluation of a Low-Literacy Diabetes Education Computer Multimedia Application. DIABETES CARE 28, 7, (2005) 1574--1580.",
      "doi": ""
    },
    {
      "text": "Ghosh, K., Parikh, T. S., and Chavan, A. L., Design considerations for a financial management system for rural, semi-literate users, Proc. CHI, 2003, ACM Press (2003), 824--825.  ",
      "doi": "10.1145/765891.766014"
    },
    {
      "text": "Hoffman, H., Seibel, E., et al. Virtual reality helmet display quality influences the magnitude of virtual reality analgesia. J Pain, 7, 11, (2006) 843--50.",
      "doi": ""
    },
    {
      "text": "Jack, B. W., Chetty, V. K., et al. The Re-Engineered Hospital Discharge Program to Decrease Rehospitalization: A Randomized, Controlled Trial. Archives of Internal Medicine, (to appear).",
      "doi": ""
    },
    {
      "text": "Makaryus, A. and Friedman, E. Patients' understanding of their discharge treatment plans and diagnosis at discharge. Mayo Clin Proc, 80, 8, (2005), 991--4.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Sagar, A., and Toyama, K. Text-Free User Interfaces for Illiterate and Semiliterate Users. ITID 4, 1, (2007), 37--50.  ",
      "doi": "10.1162/itid.2007.4.1.37"
    },
    {
      "text": "Moreno, R., Lester, J. C., and Mayer, R. E., Life-Like Pedagogical Agents in Constructivist Multimedia Environments: Cognitive Consequences of their Interaction, ED-MEDIA (2000), 741--746.",
      "doi": ""
    },
    {
      "text": "Morris, L. and Halperin, J. Effects of Written Drug Information on Patient Knowledge and Compliance: A Literature Review. Am J Public Health, 69, 1 (1979), 47--52.",
      "doi": ""
    },
    {
      "text": "Paasche-Orlow, M. K., Parker, et al. The prevalence of limited health literacy. J Gen.Intern.Med, 20, 2 (2005), 175--184.",
      "doi": ""
    },
    {
      "text": "Person, N. K., Graesser, et al, Evaluating Student Learning Gains in Two Versions of AutoTutor. In J. D. Moore, C. L. Redfield, and W. L. Johnson, Eds., Artificial intelligence in education: AI-ED in the wired and wireless future, IOS Press, Amsterdam (2001), 286--293.",
      "doi": ""
    },
    {
      "text": "Richmond, V. and McCroskey, J., Immediacy. In Nonverbal Behavior in Interpersonal Relations, Allyn&amp;Bacon, Boston (1995), 195--217.",
      "doi": ""
    },
    {
      "text": "Schillinger, D., Piette, J., et al. Closing the loop: physician communication with diabetic patients who have low health literacy. Arch.Intern.Med, 163, 1, (2003), 83--90.",
      "doi": ""
    },
    {
      "text": "Sourial, S. An analysis of caring. J Adv Nurs, 26 (1997), 1189--1192.",
      "doi": ""
    },
    {
      "text": "Swartout, W., Gratch, et al, D. Toward Virtual Humans. AI Magazine, 27, 2 (2006), 96--108. ",
      "doi": "10.5555/1167629.1167639"
    },
    {
      "text": "Von Koff, M., Gruman, J., et al. Collaborative Management of Chronic Illness. Ann Intern Med, 127, 12 (1997), 1097--1102.",
      "doi": ""
    },
    {
      "text": "Williams, M., Parker, R., et al, Inadequate Functional Health Literacy Among Patients at Two Public Hospitals. JAMA, 274, 21 (1995), 1677--1720.",
      "doi": ""
    },
    {
      "text": "Yee, N., Bailenson, J., and Rickertsen, K., A meta-analysis of the impact of the inclusion and realism of human-like faces on user experiences in interfaces Proc. CHI 2007, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240626"
    }
  ]
}