{
  "doi": "10.1145/1518701.1518995",
  "title": "Back-of-device interaction allows creating very small touch devices",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1923-1932",
  "year": 2009,
  "badges": [],
  "abstract": "In this paper, we explore how to add pointing input capabilities to very small screen devices. On first sight, touchscreens seem to allow for particular compactness, because they integrate input and screen into the same physical space. The opposite is true, however, because the user's fingers occlude contents and prevent precision. We argue that the key to touch-enabling very small devices is to use touch on the device backside. In order to study this, we have created a 2.4\" prototype device; we simulate screens smaller than that by masking the screen. We present a user study in which participants completed a pointing task successfully across display sizes when using a back-of device interface. The touchscreen-based control condition (enhanced with the shift technique), in contrast, failed for screen diagonals below 1 inch. We present four form factor concepts based on back-of-device interaction and provide design guidelines extracted from a second user study.",
  "tags": [
    "nanotouch",
    "lucidtouch",
    "input devices",
    "mobile devices",
    "pointing",
    "touch",
    "back-of-device interaction"
  ],
  "authors": [
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    },
    {
      "name": "Gerry Chu",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435596125",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albinsson, P. Zhai, S. High precision touch screen interaction. In Proc. CHI'03, 105--112.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Azuma, R.T. (1997). A Survey of Augmented Reality. Presence: Teleoperators and Virtual Environments 6(4) (August 1997). pp. 355--385.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Zotov, A., Cutrell, E., and Hinckley, K. Starburst: a Target Expansion Algorithm for Non-Uniform Target Distributions. In Proc. AVI'08, pp. 129--137.  ",
      "doi": "10.1145/1385569.1385592"
    },
    {
      "text": "Buxton, W. A Three-State Model of Graphical Input. In Proc. INTERACT '90. pp. 449--456. ",
      "doi": "10.5555/647402.725582"
    },
    {
      "text": "Buxton, W., Hill, R.&amp;Rowley, P. Issues and techniques in touch-sensitive tablet input. Proc. SIGGRAPH'85, pp. 215--223.  ",
      "doi": "10.1145/325334.325239"
    },
    {
      "text": "Grossman, T, Balakrishnan, R. (2005). The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. CHI'05, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Hiraoka, S., Miyamoto, I., Tomimatsu, K. Behind Touch, a Text Input Method for Mobile Phones by The Back and Tactile Sense Interface. Information Processing Society of Japan, Interaction 2003. p. 131--138.",
      "doi": ""
    },
    {
      "text": "Iwabuchi., M., Kakehi. Y., and Kakehi, T. LimpiDual Touch: Interactive Limpid Display with Dual-sided Touch Sensing. In SIGGRAPH'08 posters.  ",
      "doi": "10.1145/1400885.1400978"
    },
    {
      "text": "Kabbash, P., Buxton, W. The \"Prince\" technique: Fitts' law and selection using area cursor. In Proc. of CHI'95, 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Labrune, J,B, and Mackay, W. Telebeads: Social Network Mnemonics for Teenagers. In Proc IDC '06, pp. 57--64.  ",
      "doi": "10.1145/1139073.1139092"
    },
    {
      "text": "Li, K., Baudisch, P., and Hinckley, K. BlindSight: eyes-free access to mobile phones. In Proc. CHI'08, pp. 1389--1398.  ",
      "doi": "10.1145/1357054.1357273"
    },
    {
      "text": "McGuffin, M., and Balakrishnan, R. Acquisition of Expanding Targets. In Proc. CHI'02, pp. 57--64.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "Merrill, D., Kalanithi, J., and Maes, P. Siftables: Towards Sensor Network User Interfaces. In Proc. TEI'07, pp. 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Olwal, A., Feiner S. (2003) Rubbing the Fisheye: precise touch-screen interaction with gestures and fisheye views. In Conf. Companion. UIST'03, pp. 83--84.",
      "doi": ""
    },
    {
      "text": "Potter, R., Weldon, L., Shneiderman, B. (1988). Improving the accuracy of touch screens: an experimental evaluation of three strategies. Proc. CHI' 88, pp. 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Ramos G., Boulos, M., and Balakrishnan, R. Pressure Widgets. In Proc. CHI'04, pp. 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Ren, X., Moriya, S. (2000). Improving selection performance on pen-based systems: a study of pen-based interaction for selection tasks. ACM TOCHI. 7(3):384--416.  ",
      "doi": "10.1145/355324.355328"
    },
    {
      "text": "Roudaut, A., Huot, S., and Lecolinet. E. TapTap and Mag-Stick: Improving One-Handed Target Acquisition on Small Touch-screens. In Proc. AVI'08, pp. 146--153  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Schwesig, C., Poupyrev, I., and Mori, E. (2004). Gummi: a bendable computer. In Proc. CHI'04, pp. 263--270.  ",
      "doi": "10.1145/985692.985726"
    },
    {
      "text": "Sears, A., Shneiderman, B. (1991). High precision touch-screens: design strategies and comparisons with a mouse. Int. J. Man-Mach. Stud. 34(4):593--613.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "Siek, K.A., Rogers, Y., and Connelly, K.H. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Proc. INTERACT'05, pp. 267--280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Sugimoto, M. Hiroki, K. (2006). HybridTouch: an intuitive manipulation technique for PDAs using their front and rear surfaces. In Proc. MobileHCI '06, p. 137--140.  ",
      "doi": "10.1145/1152215.1152243"
    },
    {
      "text": "Tang, J. C. and Minneman, S. L. VideoDraw: a video inter-face for collaborative drawing. In Proc. CHI '90. p. 313--320.  ",
      "doi": "10.1145/97243.97302"
    },
    {
      "text": "Vogel, D.&amp;Baudisch, P. Shift: A Technique for Operating Pen-Based Interfaces Using Touch. Proc. CHI'07, pp. 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Wigdor, D., Forlines, C., Baudisch, P., Barnwell, J., Shen, C. LucidTouch: A See-Through Mobile Device. In Proc. UIST 2007, pp. 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Wigdor, D., Leigh, D., Forlines, C., Shipman, S., Barnwell, J., Balakrishnan, R., Shen, C. Under the Table Interaction. In Proc. UIST'06, 259--268.  ",
      "doi": "10.1145/1166253.1166294"
    },
    {
      "text": "Wobbrock, J.O., Myers, B.A. and Aung, H.H. (2008) The performance of hand postures in front- and back-of-device interaction for mobile computing. International Journal of Human-Computer Studies. To appear.  ",
      "doi": "10.1016/j.ijhcs.2008.03.004"
    },
    {
      "text": "Yatani, K., Partridge, K., Bern, M., and Newman, M. Escape: A Target Selection Technique Using Visually-cued Gestures. In Proc. CHI 2008, pp. 285--294.  ",
      "doi": "10.1145/1357054.1357104"
    },
    {
      "text": "Zeleznik, R., Miller, T., and Forsberg, A. Pop through Mouse Button Interactions. In Proc. UIST'01, pp195--196.  ",
      "doi": "10.1145/502348.502384"
    },
    {
      "text": "Hinckley, K., Guimbretiere, F., Baudisch, P., Sarin, R., Agra-wala, M., Cutrell, E. The Springboard: Multiple Modes in One Spring-Loaded Control. In Proc. CHI'06, pp. 181--190.  ",
      "doi": "10.1145/1124772.1124801"
    },
    {
      "text": "Li, Y., Hinckley, K., Guan, Z., Landay, J. A. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. In Proc. CHI'05, pp. 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Zelaznik, H.N., Mone, S., McCabe, G.P. and Thaman, C. (1988) Role of temporal and spatial precision in determining the nature of the speed-accuracy trade-off in aimed-hand movements. Journal of Experimental Psychology: Human Perception and Performance 14 (2), 221--230.",
      "doi": ""
    }
  ]
}