{
  "doi": "10.1145/1518701.1518911",
  "title": "DynaSpot: speed-dependent area cursor",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1391-1400",
  "year": 2009,
  "badges": [],
  "abstract": "We present DynaSpot, a new technique for acquiring targets based on the area cursor. DynaSpot couples the cursor's activation area with its speed, behaving like a point cursor at low speed or when motionless. This technique minimizes visual distraction and allows pointing anywhere in empty space without requiring an explicit mode switch, thus enabling users to perform common interactions such as region selections seamlessly. The results of our controlled experiments show that the performance of DynaSpot can be modeled by Fitts' law, and that DynaSpot significantly outperforms the point cursor and achieves, in most conditions, the same level of performance as one of the most promising techniques to date, the Bubble cursor.",
  "authors": [
    {
      "name": "Olivier Chapuis",
      "institution": "LRI - University Paris-Sud & CNRS; INRIA, Orsay, France",
      "img": "/do/10.1145/contrib-81319489300/rel-imgonly/oc.jpg",
      "acmid": "81319489300",
      "orcid": "0000-0003-0632-3700"
    },
    {
      "name": "Jean-Baptiste Labrune",
      "institution": "MIT Media Lab, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309503263",
      "orcid": "missing"
    },
    {
      "name": "Emmanuel Pietriga",
      "institution": "INRIA; LRI - Univ. Paris-Sud & CNRS, Orsay, France",
      "img": "/do/10.1145/contrib-81100222004/rel-imgonly/id2013.jpg",
      "acmid": "81100222004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "T. Asano, E. Sharlin, Y. Kitamura, K. Takashima, and F. Kishino. Predictive interaction using the delphian desktop. In Proc. UIST '05, 133­--141. ACM, 2005.  ",
      "doi": "10.1145/1095034.1095058"
    },
    {
      "text": "R. Balakrishnan. \"Beating\" Fitts' law: virtual enhancements for pointing facilitation. Inter. J. of Hum.-Comput. Stu., 61(6):857--­874, 2004.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "P. Baudisch, E. Cutrell, D. Robbins, M. Czerwinski, P. Tandler, B. Bederson, and A. Zierlinger. Drag-and-pop and drag-and-pick: Techniques for accessing remote screen content on touch and pen-operated systems. In Proc. Interact '03, 57­--64, 2003.",
      "doi": ""
    },
    {
      "text": "P. Baudisch, A. Zotov, E. Cutrell, and K. Hinckley. Starburst: a target expansion algorithm for non-uniform target distributions. In Proc. AVI '08, 129--­137. ACM, 2008.  ",
      "doi": "10.1145/1385569.1385592"
    },
    {
      "text": "R. Blanch, Y. Guiard, and M. Beaudouin-Lafon. Semantic pointing: improving target acquisition with control-display ratio adaptation. In Proc. CHI '04, 519­--526. ACM, 2004.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "A. Cockburn and P. Brock. Human on-line response to visual and motor target expansion. In Proc. GI '06, 81--­87, 2006. ",
      "doi": "10.5555/1143079.1143093"
    },
    {
      "text": "A. Cockburn and A. Firth. Improving the acquisition of small targets. In Proc. British HCI '03, 181­--196, 2003.",
      "doi": ""
    },
    {
      "text": "S. A. Douglas, A. E. Kirkpatrick, and I. S. MacKenzie. Testing pointing device performance and user assessment with the ISO 9241, part 9 standard. In Proc. CHI '99, 215--­222. ACM, 1999.  ",
      "doi": "10.1145/302979.303042"
    },
    {
      "text": "T. Grossman and R. Balakrishnan. The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. CHI '05, 281­--290. ACM, 2005.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Y. Guiard, R. Blanch, and M. Beaudouin-Lafon. Object pointing: a complement to bitmap pointing in GUIs. In Proc. GI '04, 9­--16, 2004. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "C. Gutwin. Improving focus targeting in interactive fisheye views. In Proc. CHI '02, 267--­274. ACM, 2002.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "M. Hertzum and K. Hornbæk. Input techniques that dynamically change their cursor activation area: A comparison of bubble and cell cursors. Int. J. Hum.-Comput. Stud., 65(10):833­--851, 2007.  ",
      "doi": "10.1016/j.ijhcs.2007.05.001"
    },
    {
      "text": "T. Igarashi and K. Hinckley. Speed-dependent automatic zooming for browsing large documents. In Proc. UIST '00, 139­--148. ACM, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "P. Kabbash and W. Buxton. The \"prince\" technique: Fitts' law and selection using area cursors. In Proc. CHI '95, 273­--279. ACM/Addison-Wesley, 1995.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "M. Kobayashi and T. Igarashi. Ninja cursors: using multiple cursors to assist target acquisition on large screens. In Proc. CHI '07, 949--­958. ACM, 2008.  ",
      "doi": "10.1145/1357054.1357201"
    },
    {
      "text": "E. Lank, Y.-C. N. Cheng, and J. Ruiz. Endpoint prediction using motion kinematics. In Proc. CHI '07, 637­--646. ACM, 2007.  ",
      "doi": "10.1145/1240624.1240724"
    },
    {
      "text": "J. Laukkanen, P. Isokoski, and K.-J. Räihä. The cone and the lazy bubble: two efficient alternatives between the point cursor and the bubble cursor. In Proc. CHI '08, 309­--312. ACM, 2008.  ",
      "doi": "10.1145/1357054.1357107"
    },
    {
      "text": "I. S. MacKenzie. Fitts' law as a research and design tool in human-computer interaction. Hum.-Comput. Interact., 7:91­--139, 1992.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "I. S. MacKenzie and P. Isokoski. Fitts' throughput and the speed-accuracy tradeoff. In Proc. CHI '08, 1633--­1636. ACM, 2008.  ",
      "doi": "10.1145/1357054.1357308"
    },
    {
      "text": "M. McGuffin and R. Balakrishnan. Acquisition of expanding targets. In Proc. CHI '02, 57­--64. ACM, 2002.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "M. J. McGuffin and R. Balakrishnan. Fitts' law and expanding targets: Experimental studies and designs for user interfaces. ACM Trans. Comput.-Hum. Interact., 12(4):388--422, 2005.  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "T. Moscovich and J. F. Hughes. Multi-finger cursor techniques. In Proc. GI '06, 1­--7, 2006. ",
      "doi": "10.5555/1143079.1143081"
    },
    {
      "text": "E. Pietriga and C. Appert. Sigma lenses: focus-context transitions combining space, time and translucence. In Proc. CHI '08, 1343­--1352. ACM, 2008.  ",
      "doi": "10.1145/1357054.1357264"
    },
    {
      "text": "G. Ramos, A. Cockburn, R. Balakrishnan, and M. Beaudouin-Lafon. Pointing lenses: facilitating stylus input through visual-and motor-space magnification. In Proc. CHI '07, 757­--766. ACM, 2007.  ",
      "doi": "10.1145/1240624.1240741"
    },
    {
      "text": "R. W. Soukoreff and I. S. MacKenzie. Towards a standard for pointing device evaluation: Perspectives on 27 years of Fitts' law research in HCI. Int. J. Hum.-Comput. Stud., 61(6):751­--789, 2004.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "26. A. Worden, N. Walker, K. Bharat, and S. Hudson. Making computers easier for older adults to use: area cursors and sticky icons. In Proc. CHI '97, 266--­271. ACM, 1997.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "27. S. Zhai, J. Kong, and X. Ren. Speed-accuracy tradeoff in Fitts' law tasks: on the equivalency of actual and nominal pointing precision. Int. J. Hum.-Comput. Stud., 61(6):823--856, 2004.  ",
      "doi": "10.1016/j.ijhcs.2004.09.007"
    }
  ]
}