{
  "doi": "10.1145/1518701.1518984",
  "title": "On the audio representation of distance for blind users",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1839-1848",
  "year": 2009,
  "badges": [],
  "abstract": "This study examines methods for displaying distance information to blind travellers using sound, focussing on abstractions of methods currently used in commercial Electronic Travel Aids (ETAs). Ten blind participants assessed three sound encodings commonly used to convey distance information by ETAs: sound frequency (Pitch), Ecological Distance (ED), and temporal variation or Beat Rate (BR). Response time and response correctness were chosen for measures.",
  "authors": [
    {
      "name": "Martin Talbot",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660421963",
      "orcid": "missing"
    },
    {
      "name": "William Cowan",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410592379",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Currently Available Electronic Travel Aids for the Blind. http://www.noogenesis.com/eta/current.html.",
      "doi": ""
    },
    {
      "text": "ETA Manuals. http://titan.sfasu.edu/Üg_brennantg/etas.html.",
      "doi": ""
    },
    {
      "text": "JAWS for Windows Screen Reading Software. http://www.freedomscientific.com/products/fs/jaws-product-page.asp.",
      "doi": ""
    },
    {
      "text": "Kurzweil-National Federation of the Blind: Readers. http://www.knfbreader.com/.",
      "doi": ""
    },
    {
      "text": "Notes on Auditory Demonstrations. http://www.phy.duke.edu/Üdtl/36h7_psy.html#Critical.",
      "doi": ""
    },
    {
      "text": "Orientation and Mobility Training: The Way to Go. http://www.tsbvi.edu/Outreach/seehear/fall98/waytogo.htm.",
      "doi": ""
    },
    {
      "text": "Uncertainty principle and the musician's uncertainty principle. http://www.phys.unsw.edu.au/Üjw/uncertainty.html.",
      "doi": ""
    },
    {
      "text": "Up to 45 million blind people globally - and growing. http://www.who.int/mediacentre/news/releases/2003/pr73/en/.",
      "doi": ""
    },
    {
      "text": "USA - diabetes/obesity rises by 27% in 5 years. http://www.medicalnewstoday.com/articles/4428.php.",
      "doi": ""
    },
    {
      "text": "Guest, S., Gatmur, C., Lloyd, D., and Spence, C. . Audiotactile interpretations in roughness perception. Exptl. Brain Res, 146:161--171, 2002.",
      "doi": ""
    },
    {
      "text": "Angell, J.R., and Fite, W. The monaural localization of sound. Psychol. Rev., 8:225--246, 1909.",
      "doi": ""
    },
    {
      "text": "Begg, I.S., et a. In Gerstein, H.C., and Haynes, R.B., editor, Evidence-Based Diabetes Care. Lawrence Erlbaum Associates, 2001.",
      "doi": ""
    },
    {
      "text": "Bekesy, G.V. Uber die Entstehung der entfernungsempfindingbeim horen. Akust. Z., 3:21--31, 1938. (Available in English in: Experiments in hearing, Wever, E.G., editor, Wiley, NY, USA, 1960).",
      "doi": ""
    },
    {
      "text": "Beyer H. and Holtzblatt K. Contextural design: defining customer-centered systems. Morgan Kaufmann, San Francisco, CA, 1998. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Blash, B.B., Welsh, R.L., and Davidson, T. Result of a national survey of electronic travel aid use. J. Visual Impairment&amp;Blindness, 83:449--453, 1989.",
      "doi": ""
    },
    {
      "text": "Bregman, A.S. Auditory scene analysis: the perceptual organization of sound. MIT Press, Cambridge, MA, USA, 1990.",
      "doi": ""
    },
    {
      "text": "Brungart, D. Auditory localization of nearby sources III: Stimulus effects. J. Acoustical Soc. Am., 106:3589--3602, 1999.",
      "doi": ""
    },
    {
      "text": "Coleman, P.D. Failure to localize the source distance of an unfamiliar sound. J. Acoustical Soc. Am., 34:345--346, 1962.",
      "doi": ""
    },
    {
      "text": "Corsini D. A. and Pick H. L. Jr. Effect of texture on tactually perceived length. Percept. Psychophys., 5:352--356, 1969.",
      "doi": ""
    },
    {
      "text": "Damaschini, R., Legras, R., Ledoux, R., and Farcy R. Electronic Travel Aid for blind people. Association for the Advancement of Assistive Technology in Europe, 2005.",
      "doi": ""
    },
    {
      "text": "Edworthy, J., Loxley, S., and Dennis, I. Improving auditory warning design: relationship between warning sound parameters and perceived urgency. Human Factors, 33:205--231, 1991.",
      "doi": ""
    },
    {
      "text": "Farmer L. W. Mobility devices. In Welsh R. L. and Blasch B. B., editor, Foundations of Orientation and Mobility. American Foundation for the Blind, NY, USA, 1980.",
      "doi": ""
    },
    {
      "text": "Farmer L. W. and Smith D. L. Adaptive technology. In Welsh R. L. and Blasch B. B., editor, Foundations of Orientation and Mobility. American Foundation for the Blind, NY, USA, 1997.",
      "doi": ""
    },
    {
      "text": "Friberg, A., and Sundberg, J. Handbook of Perception: Hearing. In Kungl. tekniska hoegskolan, editor, Speech Transmission Laboratory, volume 34, 2-3, 49--56. Academic Press, 1993.",
      "doi": ""
    },
    {
      "text": "Gamble, E.A. Intensity as a criterion in estimating the distance of sounds. Psychol. Rev., 16:416--426, 1909.",
      "doi": ""
    },
    {
      "text": "Gardner, M.B. Distance estimation of 0 degree of apparent 0 degree-oriented speech signals in anechoic space. J. Acoust. Soc. Am., 45:47--53, 1969.",
      "doi": ""
    },
    {
      "text": "Gibson J. J. Perception of the Visual world. Houghton Mifflin, MA,USA, 1966.",
      "doi": ""
    },
    {
      "text": "Griesinger, D. Pitch Coherence as a Measure of Apparent Distance in Performance Spaces and Muddiness in Sound Recordings. Audio Eng. Soc., 2006.",
      "doi": ""
    },
    {
      "text": "Handel, S. Temporal segmentation of repeating auditory patterns. Journal of Experimental Psychology, 101:46--54, 1973.",
      "doi": ""
    },
    {
      "text": "Ingard, U. A review of the influence of meteorological conditions on sound propagation. J. Acoust. Soc. Am., 25:405--411, 1953.",
      "doi": ""
    },
    {
      "text": "Jacko, J.A., Scott, I.U., Sainfort, F., Barnard, L., Edwards, P.J., Emery, V.K., Kongnakorn, T., Moloney, K.P., and Zorich, B.S. Older adults and visual impairment: what do exposure times and accuracy tell us about performance gains associated with multimodal feedback? . Proc. CHI 2003, ACM Press, pages 33--40, 2003.  ",
      "doi": "10.1145/642611.642619"
    },
    {
      "text": "Jones, M.R. Time, our lost dimension: toward a new theory of perception, attention and memory. Psychological Review, 83:323--355, 1976.",
      "doi": ""
    },
    {
      "text": "Lederman, S.J., Martin, A., Tong, C., and Klatzky, R. Relative performance using haptic and/or touch produced auditory cues in a remote texture identification task. Proc. of IEEE Haptics Symposium., pages 151--158, 2003. ",
      "doi": "10.5555/795683.797601"
    },
    {
      "text": "McGregor, P., Horn, A.G., and Todd, M.A. Are familiar sounds ranged more accurately? Percept. Mot. Skills., 61:1082, 1985.",
      "doi": ""
    },
    {
      "text": "Mershon, D.H., and King, E. Intensity and reverberation as factors in the auditory perception of egocentric distance. Percept. Psychophys., 18:409--415, 1975.",
      "doi": ""
    },
    {
      "text": "Millar S. Understanding and representing space: theory and evidence from studies with blind an sighted children. Oxford University Press, NY, USA, 1994. p.242.",
      "doi": ""
    },
    {
      "text": "Mohrmann K. Lautheitskonstanz im Entfernungswechsel. Z. PsychoL., 145:145--199, 1939.",
      "doi": ""
    },
    {
      "text": "Nielsen, S.H. Auditory distance perception in different rooms. J. Audio Eng. Soc., 41:755770, 1993.",
      "doi": ""
    },
    {
      "text": "Nyborg, W., and Mintzer, D. Review of sound propagation in the lower atmosphere. USAF WADC tech. Rep, 54:602, 1955.",
      "doi": ""
    },
    {
      "text": "Sharp, H., Rogers, Y., and Preece, J. Interactive design. John Wiley&amp;Son, West Sussed, England, 2006.",
      "doi": ""
    },
    {
      "text": "Starch, D., and Crawford, A.L. The perception of the distance of sound. Psychol. Rev., 16:427--430, 1909.",
      "doi": ""
    },
    {
      "text": "Steinberg, J.C., and Snow, W.B. Physical factors in auditory perspective. Bell Sys. tech. J., 13:245--259, 1934.",
      "doi": ""
    },
    {
      "text": "Von Noorden, L.P.A.S. Temporal Coherence in the Perception of Tone Sequences. Dissertation, Eindhoven University, 1975.",
      "doi": ""
    },
    {
      "text": "West, F.M. Change of pitch in certain sounds with distance. Nature, 65:129, 1901.",
      "doi": ""
    },
    {
      "text": "Zahorik, P., Brungart, D.S., and Bronkhorst, A.W. Change of pitch in certain sounds with distance: A summary of past and present research. Acta Acustica, 91, 3:409--420, 2005.",
      "doi": ""
    }
  ]
}