{
  "doi": "10.1145/1518701.1518849",
  "title": "The problem of conflicting social spheres: effects of network structure on experienced tension in social network sites",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "965-974",
  "year": 2009,
  "badges": [],
  "abstract": "We propose that a fundamental property of human psychology, the need to maintain independent social spheres, imposes constraints on the use of social network sites (SNS). We particularly focus on the consequences of visibility of communications across social spheres, and we hypothesize that technological features of SNS may bring social spheres in conflict, thus leading to increased levels of online social tension. A survey study among Facebook users was conducted to test this hypothesis. Results showed that diversity of the Facebook network predicted online tension. Moreover, the number of kin in a Facebook network was a crucial component because it predicted online tension whereas number of work and social contacts did not. Further, evidence was found to support the idea that tension might impose an upper limit on network size. We conclude with a discussion of these findings and describe how they support the thrust of recent modifications to SNS designs.",
  "tags": [
    "SNS",
    "network diversity",
    "online tension",
    "social spheres"
  ],
  "authors": [
    {
      "name": "Jens Binder",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593330",
      "orcid": "missing"
    },
    {
      "name": "Andrew Howes",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/do/10.1145/contrib-81100489674/rel-imgonly/mypicture.jpg",
      "acmid": "81100489674",
      "orcid": "0000-0003-4251-1127"
    },
    {
      "name": "Alistair Sutcliffe",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100269401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. and Gross, R. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In Proc. PET 2006, Robinson College (2006), 36--58.  ",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Aiken, L. S.,&amp;West, S. G. Multiple regression: Testing and interpreting interactions. Thousand Oaks, CA: Sage (1991).",
      "doi": ""
    },
    {
      "text": "Baron, R. M.,&amp;Kenny, D. A. The moderator-mediator distinction in social psychological research: conceptual, strategic, and statistical considerations. Journal of Personality and Social Psychology, 51 (1986), 1173--1182.",
      "doi": ""
    },
    {
      "text": "Boase, J., Horrigan, J. B., Wellman, B.,&amp;Rainie, L. (2006). The strength of internet ties. Pew Internet&amp;American Life Project.",
      "doi": ""
    },
    {
      "text": "boyd, d. Friends, Friendsters, and MySpace Top 8: Writing community into being on social network sites. First Monday, 11 (2006). Available at: http://www.firstmonday.org/ISSUES/issue11_12/boyd/index.html",
      "doi": ""
    },
    {
      "text": "boyd, d.,&amp;Ellison, N. B. Social network sites: Definition, history, and scholarship. Journal of Computer-Mediated Communication, 13 (2008), 210--230.",
      "doi": ""
    },
    {
      "text": "Burt, R. S. Structural Holes. Cambridge, MA: Harvard University Press (1992).",
      "doi": ""
    },
    {
      "text": "Cartwright, D., and Harary, F. Structural balance: A generalization of Heider's theory. Psychological Review, 63 (1956), 277--292.",
      "doi": ""
    },
    {
      "text": "CNET News. Facebook fires up IM, ratchets up privacy. 18 March 2008. http://news.cnet.com/8301-13577_3-9896860-36.html",
      "doi": ""
    },
    {
      "text": "Donath, J.,&amp;boyd, d. Public displays of connection. BT Technology Journal, 22 (2004), 71--82.  ",
      "doi": "10.1023/B%3ABTTJ.0000047585.06264.cc"
    },
    {
      "text": "Dunbar, R. I. M. The social brain hypothesis. Evolutionary Anthropology, 6 (1998), 178--190.",
      "doi": ""
    },
    {
      "text": "Ellison, N. B., Steinfield, C.,&amp;Lampe, C. The benefits of facebook friends: Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication, 12 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Granovetter, M. S. The strength of weak ties. American Journal of Sociology, 78 (1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Gray, W. D.&amp;Boehm-Davis, D. A. Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology: Applied, 6 (2000), 322--335.",
      "doi": ""
    },
    {
      "text": "Gross, R. and Acquisti, A. Information revelation and privacy in online social networks. In Workshop on Privacy in Electronic Society, ACM Press (2005).  ",
      "doi": "10.1145/1102199.1102214"
    },
    {
      "text": "Grossetti, M. Where do social relations come from? A study of personal networks in the Toulouse area of France. Social Networks, 27 (2005), 289--300.",
      "doi": ""
    },
    {
      "text": "Joinson, A. N. 'Looking at', 'looking up' or 'keeping up with' people? Motives and uses of Facebook. In Proc. CHI 2008, ACM Press (2008), 1027--1036.  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Kadushin, C. Power, influence and social circles: A new methodology for studying opinion makers. American Sociological Review, 33 (1968), 685--699.",
      "doi": ""
    },
    {
      "text": "Kiesler, S., Siegel, J.,&amp;McGuire, T. Social psychological aspects of computer-mediated communication. American Psychologist, 39 (1984), 1123--1134.",
      "doi": ""
    },
    {
      "text": "Kraut, R., Kiesler, S., Boneva, B., Cummings, J., Helgeson, V.,&amp;Crawford, A. Internet paradox revisited. Journal of Social Issues, 58 (2002), 49--74.",
      "doi": ""
    },
    {
      "text": "Lampe, C., Ellison, N., and Steinfield, C. A. A Face(book) in the crowd: Social searching vs. social browsing. In Proc. CSCW 2006, ACM Press (2006), 167--170.  ",
      "doi": "10.1145/1180875.1180901"
    },
    {
      "text": "Lee, H. Behavioral strategies for dealing with flaming in an online forum. The Sociological Quarterly, 46 (2005), 385--403.",
      "doi": ""
    },
    {
      "text": "McCarty, C., Killworth, P. D., Bernard, H. R., Johnsen, E. C.,&amp;Shelley, G. A. Comparing two methods for estimating network size. Human Organization, 60 (2001), 28--39.",
      "doi": ""
    },
    {
      "text": "McPherson, M., Smith-Lovin, L.,&amp;Cook, J. Birds of a feather: Homophily in social networks. Annual Review of Sociology, 27 (2001), 415--444.",
      "doi": "10.1146/annurev.soc.27.1.415"
    },
    {
      "text": "O'Hara, K. P.,&amp;Payne, S. J. Planning and the user interface: The effects of lockout time and error recovery cost. International Journal of Human-Computer Studies, 50 (1999), 41--59.  ",
      "doi": "10.1006/ijhc.1998.0234"
    },
    {
      "text": "Verbeke, W.,&amp;Wuyts, S. Moving in social circles: Social circle membership and performance implications. Journal of Organizational Behavior, 28 (2007), 357--379.",
      "doi": ""
    },
    {
      "text": "Wasserman, S.,&amp;Faust, K. Social network analysis: Methods and applications. Cambridge: Cambridge University Press (1994).",
      "doi": ""
    },
    {
      "text": "Wellman, B., Haase, A. Q., Witte, J.,&amp;Hampton, K. Does the internet increase, decrease, or supplement social capital? American Behavioral Scientist, 45 (2001), 436--455.",
      "doi": ""
    }
  ]
}