{
  "doi": "10.1145/1518701.1518746",
  "title": "Lightweight tagging expands information and activity management practices",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "279-288",
  "year": 2009,
  "badges": [],
  "abstract": "Could people use tagging to manage day-to-day work in their personal computing environment? Could tagging be sufficiently generic and lightweight to support diverse ways of working and, perhaps, support new and efficient practices for managing applications and accessing documents? We investigate these issues by implementing the TAGtivity system that enables users to tag resources in the context of their ongoing work. We deployed TAGtivity and studied users' tagging practices in their actual work places over a three week period. Our analysis of interviews and logs reveals that affordances of the TAGtivity system supported users in a variety of information and activity management tasks. These include new practices for managing emerging activities and ephemeral information and accessing documents across application data silos.",
  "authors": [
    {
      "name": "Gerard Oleksik",
      "institution": "Instrata, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416597992",
      "orcid": "missing"
    },
    {
      "name": "Max L. Wilson",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81100531194/rel-imgonly/maxwilson10x82.jpg",
      "acmid": "81100531194",
      "orcid": "missing"
    },
    {
      "name": "Craig Tashman",
      "institution": "Georgia Institute of Technology, Atlanta, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498515",
      "orcid": "missing"
    },
    {
      "name": "Eduarda Mendes Rodrigues",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608449",
      "orcid": "missing"
    },
    {
      "name": "Gabriella Kazai",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100472184",
      "orcid": "missing"
    },
    {
      "name": "Gavin Smyth",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100297264",
      "orcid": "missing"
    },
    {
      "name": "Natasa Milic-Frayling",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041550",
      "orcid": "missing"
    },
    {
      "name": "Rachel Jones",
      "institution": "Instrata, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100555985",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bannon, L., Cypher, S., Greenspan, S., and Monty, M.L. Evaluation and analysis of users' activity organisation. Proc. CHI'83, ACM Press (1983), 54--57.  ",
      "doi": "10.1145/800045.801580"
    },
    {
      "text": "Bardram, J.E., Bunde-Pederson, J., and Soegaard, M. Support for activity-based computing in a personal computing operating system. In Proc. CHI 2006, ACM Press (2006), 211--220.  ",
      "doi": "10.1145/1124772.1124805"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., and Smith, I. Taking email to task: the design and evaulation of a task management centered email tool. In Proc. CHI 2003, ACM Press (2003), 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Cutrell, E., Robbins, D., Dumais, S., and Sarin, R. Fast, flexible filtering with Phlat. In Proc. CHI 2006, ACM Press (2006), 261--270.  ",
      "doi": "10.1145/1124772.1124812"
    },
    {
      "text": "Dourish, P., Edwards, W.K., LaMarca, A., and Salisbury, M. Presto: an experimental architecture for fluid interactive document spaces. ACM Trans. Comput.-Hum. Interact. 6,2 (1999), 133--161.  ",
      "doi": "10.1145/319091.319099"
    },
    {
      "text": "Golder, S.A. and Huberman, B.A. Usage patterns of collaborative tagging systems. Journal of Information Science 32,2 (2006), 198--208.  ",
      "doi": "10.1177/0165551506062337"
    },
    {
      "text": "Gonzalez, V.M. and Mark, G. \"Constant, constant multi-tasking craziness\": Managing multiple working spheres. Proc. CHI 2004, ACM Press (2004), 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Henderson, D.A. and Card, S. Rooms: the use of multiple virtual workspaces to reduce space contention in a window-based graphical user interface. ACM Transactions on Graphics 5,3 (1986), 211--243.  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "Hsieh, J.-L., Chen, C.-H., Lin, I.-W., and Sun, C.-T. A web-based tagging tool or organizing person documents on PCs. In CHI 2008 Workshop on Personal Information Management (2008).",
      "doi": ""
    },
    {
      "text": "Jones, W., Phuwanartnurak, J., Gill, R., and Bruce, H. Don't take my folders away!: organizing personal information to get things done. In Proc. CHI 2005, ACM Press (2005), 1505--1508.  ",
      "doi": "10.1145/1056808.1056952"
    },
    {
      "text": "MacIntyre, B., Mynatt, E.D., Voida, S., Hansen, K.M., Tullio, J., and Corso, G.M. Support for multitasking and background awareness using interactive peripheral displays. Proc. UIST 2001, ACM Press (2001), 41--50.  ",
      "doi": "10.1145/502348.502355"
    },
    {
      "text": "Robertson, G., Horvitz, E., Czerwinski, M., Baudisch, P., Hutchings, D.R., Meyers, B., Robbins, D., and Smith, G. Scalable Fabric: flexible task management. In Proc. AVI 2004, ACM Press (2004), 85--89.  ",
      "doi": "10.1145/989863.989874"
    },
    {
      "text": "Robertson, G., van Dantzich, M., Robbins, D., Czerwinski, M., Hinckley, K., Risden, K., Thiel, D., and Gorokhovsky, V. The Task Gallery: a 3D window manager. Proc. CHI 2000, ACM Press (2000), 494--501.  ",
      "doi": "10.1145/332040.332482"
    },
    {
      "text": "Smith, G, Baudisch, P, Robertson, GG, Czerwinski, M., Meyers, B., Robbins, D., and Andrews, D. GroupBar: The TaskBar evolved. Proc. OZCHI'03 (2003).",
      "doi": ""
    },
    {
      "text": "Tashman, C. WindowScape: a task oriented window manager. Proc. UIST 2006, ACM Press (2006), 77--80.  ",
      "doi": "10.1145/1166253.1166266"
    },
    {
      "text": "Thomas, R. A general inductive approach for analyzing qualitative evaluation data. American Journal of Evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Voida, S., Mynatt, E.D.&amp;Edwards, W.K. Re-framing the desktop interface around the activities of knowledge work. Proc. UIST 2008, ACM Press (2008), 211--220.  ",
      "doi": "10.1145/1449715.1449751"
    }
  ]
}