{
  "doi": "10.1145/1518701.1518897",
  "title": "Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualizations",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1303-1312",
  "year": 2009,
  "badges": [],
  "abstract": "We investigate techniques for visualizing time series data and evaluate their effect in value comparison tasks. We compare line charts with horizon graphs - a space-efficient time series visualization technique - across a range of chart sizes, measuring the speed and accuracy of subjects' estimates of value differences between charts. We identify transition points at which reducing the chart height results in significantly differing drops in estimation accuracy across the compared chart types, and we find optimal positions in the speed-accuracy tradeoff curve at which viewers performed quickly without attendant drops in accuracy. Based on these results, we propose approaches for increasing data density that optimize graphical perception.",
  "authors": [
    {
      "name": "Jeffrey Heer",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Kong",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489071",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beattie, V., Jones, M.J. The impact of graph slope on rate of change judgements in corporate reports. ABACUS, 38(2):177--199, 2002.",
      "doi": ""
    },
    {
      "text": "Bertin, J. Sémiologie Graphique, Gauthier-Villars: Paris, 1967. English translation by W.J. Berg as Semiology of Graphics, University of Wisconsin Press: Madison, WI, 1983. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Byron, L., Wattenberg, M. Stacked Graphs - Geometry and Aesthetics. IEEE Trans. on Visualization and Comp. Graphics, 14(6):1245--1252, Nov/Dec 2008.  ",
      "doi": "10.1109/TVCG.2008.166"
    },
    {
      "text": "Cleveland, W.S., Diaconis, P., McGill, R. Variables on Scatterplots Look More Highly Correlated When the Scales are Increased. Science, 216(4550):1138--1141, Jun 1982.",
      "doi": ""
    },
    {
      "text": "Cleveland, W.S., McGill, R. Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods. Journal of the American Statistical Association, 79(387):531--554, Sep 1984.",
      "doi": ""
    },
    {
      "text": "Cleveland, W.S. Visualizing Information. Hobart Press. 1993.",
      "doi": ""
    },
    {
      "text": "Few, S. Time on the Horizon. Visual Business Intelligence Newsletter, Jun/Jul 2008. Online at http://www.perceptualedge.com/articles/visual_business_intelligence/time_on_the_horizon.pdf",
      "doi": ""
    },
    {
      "text": "Gillan, D.J., Callahan, A.B. A Componential Model of Human Interaction with Graphs: VI. Cognitive Engineering of Pie Graphs. Human Factors: The Journal of the Human Factors and Ergonomics Society. 42(4):566--591. Winter 2000.",
      "doi": ""
    },
    {
      "text": "Heer, J., Agrawala, M. Multi-Scale Banking to 45°. IEEE Trans. on Visualization and Comp. Graphics, 12(5):701--708, Sep/Oct 2006.  ",
      "doi": "10.1109/TVCG.2006.163"
    },
    {
      "text": "Heer, J., Viégas, F., Wattenberg, M. Voyagers and Voyeurs: Supporting Asynchronous Collaborative Information Visualization. Proc. ACM CHI, pp. 1029--1038, Apr 2007.  ",
      "doi": "10.1145/1240624.1240781"
    },
    {
      "text": "Heer, J., Robertson, G. Animated Transitions in Statistical Data Graphics. IEEE Trans. on Visualization and Comp. Graphics, 13(6):1240--1247, Nov/Dec 2007.  ",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Keim, D.A. Designing Pixel-Oriented Visualization Techniques: Theory and Applications. IEEE Trans. on Visualization and Comp. Graphics, 6(1):59--78, 2000.  ",
      "doi": "10.1109/2945.841121"
    },
    {
      "text": "Lam, H., Munzer, T., Kincaid, R. Overview Use in Multiple Visual Information Resolution Interfaces. IEEE Trans. on Visualization and Comp. Graphics, 13(6):1278--1285, Nov/Dec 2007.  ",
      "doi": "10.1109/TVCG.2007.70583"
    },
    {
      "text": "Lewandowsky, S., Spence, I. Discriminating Strata in Scatterplots. Journal of the American Statistical Association, 84(407):682--688, Sep 1989.",
      "doi": ""
    },
    {
      "text": "Lohse, J. A. Cognitive Model for the Perception and Understanding of Graphs. Proc. ACM CHI, pp. 137--144, Apr/May 1991.  ",
      "doi": "10.1145/108844.108865"
    },
    {
      "text": "Mackinlay, J.D. Automating the Design of Graphical Presentations of Relational Information. ACM Trans. on Graphics, 5(2):110--141, 1986.  ",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "Mackinlay, J.D., Hanrahan, P., Stolte, C. Show Me: Automatic Presentation for Visual Analysis. IEEE Trans. on Visualization and Comp. Graphics. 13(6):1137--1144, Nov/Dec 2007.  ",
      "doi": "10.1109/TVCG.2007.70594"
    },
    {
      "text": "Palmer, S. Vision Science: Photons to Phenomenology. MIT Press, 1999.",
      "doi": ""
    },
    {
      "text": "Robertson, G., Fernandez, R., Fisher, D., Lee, B., Stasko, J. Effectiveness of Animation in Trend Visualization. IEEE Trans. on Visualization and Comp. Graphics, 14(6):1325--1332, Nov/Dec 2008.  ",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Rosling, H. TED 2006, http://gapminder.org/video/talks/ ted-2006-debunking-myth-about-the-third-world.html",
      "doi": ""
    },
    {
      "text": "Saito, T., Miyamura H.N., Yamamoto, M., Saito,H., Hoshiya, Y., Kaseda, T. Two-Tone Pseudo-Coloring: Compact Visualization for One-Dimensional Data. Proc. IEEE InfoVis, pp. 173--180, Oct 2005.  ",
      "doi": "10.1109/INFOVIS.2005.35"
    },
    {
      "text": "Shneiderman, B. Tree visualization with tree-maps: 2-d space-filling approach. ACM Trans. on Graphics, 11(1):92--99, 1992.  ",
      "doi": "10.1145/102377.115768"
    },
    {
      "text": "Simkin, D., Hastie, R. An Information-Processing Analysis of Graph Perception. Journal of the American Statistical Association, 82(398):454--465, Jun 1987.",
      "doi": ""
    },
    {
      "text": "Spence, I., Lewandowsky, S. Displaying proportions and percentages. Applied Cognitive Psychology, 5:61--77, 1991.",
      "doi": ""
    },
    {
      "text": "Stasko, J., Zhang, E. Focus+Context Display and Navigation Techniques for Enhancing Radial, Space-Filling Hierarchy Visualizations. Proc. IEEE InfoVis, pp. 57--65, 2000. ",
      "doi": "10.5555/857190.857683"
    },
    {
      "text": "Tremmel, L. The Visual Separability of Plotting Symbols in Scatterplots. Journal of Computational and Graphical Statistics, 4(2):101--112, Jun 1995.",
      "doi": ""
    },
    {
      "text": "Tufte, E. The Visual Display of Quantitative Information. Graphics Press, 1983. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Tufte, E. Beautiful Evidence. Graphics Press, 2006. ",
      "doi": "10.5555/1198006"
    },
    {
      "text": "Wattenberg, M., Kriss, J. Designing for Social Data Analysis. IEEE Trans. on Visualization and Comp. Graphics. 12(4):549--557, Jul/Aug 2005.  ",
      "doi": "10.1109/TVCG.2006.65"
    },
    {
      "text": "Wigdor, D., Shen, C., Forlines, C., Balakrishnan, R. Perception of Elementary Graphical Elements in Tabletop and Multi-Surface Environments. Proc. ACM CHI, pp. 473--482, Apr 2007.  ",
      "doi": "10.1145/1240624.1240701"
    },
    {
      "text": "Woodruff, A., Landay, J., Stonebraker, M. Constant Information Density Visualizations of Non-Uniform Distributions of Data. Proc. ACM UIST, pp. 19--28, 1998.  ",
      "doi": "10.1145/288392.288397"
    }
  ]
}