{
  "doi": "10.1145/1518701.1518723",
  "title": "EyeSpy: supporting navigation through play",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "123-132",
  "year": 2009,
  "badges": [],
  "abstract": "This paper demonstrates how useful content can be generated as a by-product of an enjoyable mobile multiplayer game. In EyeSpy, players tag geographic locations with photos or text. By locating the places in which other players' tags were created and 'confirming' them, players earn points for themselves and verify the tags' locations. As a side effect of game-play, EyeSpy produces a collection of recognisable and findable geographic details, in the form of photographs and text tags, that can be repurposed to support navigation tasks. Two user trials of the game successfully produced an archive of geo-located photographs and tags, and in a follow-up experiment we compared performance in a navigation task using photographs from the game, with geo-referenced photos collected from the Flickr website. Our experiences with EyeSpy support reflection upon the design challenges presented by 'human computation' and the production of usable by-products through mobile game-play.",
  "tags": [
    "human computation",
    "mobile multiplayer games",
    "mobile photography",
    "RF fingerprinting",
    "navigation"
  ],
  "authors": [
    {
      "name": "Marek Bell",
      "institution": "University of Glasgow, Glasgow, Scotland, Uk",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100405925",
      "orcid": "missing"
    },
    {
      "name": "Stuart Reeves",
      "institution": "University of Glasgow, Glasgow, Scotland, Uk",
      "img": "/do/10.1145/contrib-81100228688/rel-imgonly/headshot2-2016.jpg",
      "acmid": "81100228688",
      "orcid": "missing"
    },
    {
      "name": "Barry Brown",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    },
    {
      "name": "Scott Sherwood",
      "institution": "University of Glasgow, Glasgow, Scotland, Uk",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100522350",
      "orcid": "missing"
    },
    {
      "name": "Donny MacMillan",
      "institution": "University of Glasgow, Glasgow, Scotland, Uk",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416604384",
      "orcid": "missing"
    },
    {
      "name": "John Ferguson",
      "institution": "University of Glasgow, Glasgow, Scotland, Uk",
      "img": "/do/10.1145/contrib-81485659740/rel-imgonly/avatar1.png",
      "acmid": "81485659740",
      "orcid": "missing"
    },
    {
      "name": "Matthew Chalmers",
      "institution": "University of Glasgow, Glasgow, Scotland, Uk",
      "img": "/do/10.1145/contrib-81100086432/rel-imgonly/matthewshead.jpg",
      "acmid": "81100086432",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barkhuus, L. et al. Picking pockets on the lawn: the development of tactics and strategies in a mobile game. In Proc. Ubicomp, pp. 358--374, 2005, Springer.  ",
      "doi": "10.1007/11551201_21"
    },
    {
      "text": "Beeharee, A. and Steed, A. Minimising Pedestrian Navigational Ambiguities Through Geoannotation and Temporal Tagging. In Human-Computer Interaction. Interaction Platforms and Techniques, Springer, 2007, 748--757. ",
      "doi": "10.5555/1757268.1757355"
    },
    {
      "text": "Bell, M. et al. Interweaving mobile games with everyday life. In Proc. ACM CHI, pp. 417--426, 2006.  ",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Benford, S. et al. Can you see me now? ACM ToCHI: 13(1), pp. 100--133, 2006.  ",
      "doi": "10.1145/1143518.1143522"
    },
    {
      "text": "Benford, S. et al. 2000. Designing storytelling technologies to encourage collaboration between young children. In Proc. ACM CHI, pp. 556--563, 2000.  ",
      "doi": "10.1145/332040.332502"
    },
    {
      "text": "Brown, B. and E. Laurier. Designing electronic maps: an ethnographic approach. L. Meng, A. Zipf, T. Reichenbacher (Eds.), Map-based mobile services - Theories, Methods and Implementations, pp. 247--265, Springer, 2005.",
      "doi": ""
    },
    {
      "text": "Garfinkel H. Some rules of correct decision making that jurors respect. In Studies in Ethnomethodology, pp. 104--115, 1967, Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Goldin, D. et al. Interactive Computation: The New Paradigm. Springer Verlag: 2006. ",
      "doi": "10.5555/1177298"
    },
    {
      "text": "Grant, L. et al. MobiMissions: the game of missions for mobile phones. In ACM SIGGRAPH Educators Program, 2007.  ",
      "doi": "10.1145/1282040.1282053"
    },
    {
      "text": "Koleva, B. et al. Orchestrating a mixed reality performance. In Proc. ACM CHI, pp. 38--45, 2001.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Leshed, G. et al. In-car GPS navigation: engagement with and disengagement from the environment. In Proc. ACM CHI, pp. 1675--1684, 2008.  ",
      "doi": "10.1145/1357054.1357316"
    },
    {
      "text": "Laurier, E. and Brown, B. Rotating maps and users: praxiological aspects of alignment and orientation. Trans. Inst. British Geographers, 33 (201--221), 2006.",
      "doi": ""
    },
    {
      "text": "Matyas, S. Playful Geospatial Data Acquisition by Location-Based Gaming Communities. IJVR. IPI Press: 6(3), pp. 1--10, 2007.",
      "doi": ""
    },
    {
      "text": "Matyas, S. et al. Designing Location-based Mobile Games with a Purpose--Collecting Geospatial Data with CityExplorer. In Proc. ACE, 2008.  ",
      "doi": "10.1145/1501750.1501806"
    },
    {
      "text": "Mor, N. et al. Photos on the go: a mobile application case study. In Proc. ACM CHI, pp. 1739--1748, 2008.  ",
      "doi": "10.1145/1357054.1357326"
    },
    {
      "text": "O'Hara, K. Understanding geocaching practices and motivations. In Proc. ACM CHI, pp. 1177--1186, 2008.  ",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "Petra, J. et al. In the hands of children: exploring the use of mobile phone functionality in casual play settings. In Proc. Mobile HCI, 2008.  ",
      "doi": "10.1145/1409240.1409292"
    },
    {
      "text": "Sacks, H. et al. A simplest systematics for the organization of turn taking for conversation. In Studies in the organization of conversational interaction, pp. 7--55, 1978, Academic Press.",
      "doi": ""
    },
    {
      "text": "Tollmar, K. et al. IDeixis - Searching the Web with Mobile Images for Location-Based Information. In Proc. Mobile HCI, pp. 288--299, 2004.",
      "doi": ""
    },
    {
      "text": "von Ahn, L. and Dabbish, L. Labeling images with a computer game. In Proc ACM CHI, pp. 319--326, 2004.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "von Ahn, L. et al. Verbosity: a game for collecting common-sense facts. Proc. ACM CHI, pp. 75--78, 2006.  ",
      "doi": "10.1145/1124772.1124784"
    }
  ]
}