{
  "doi": "10.1145/1518701.1518852",
  "title": "Designers wanted: participation and the user experience in open source software development",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "985-994",
  "year": 2009,
  "badges": [],
  "abstract": "We present design concepts and related mockups that support the user experience for projects hosted on CodePlex, an open source project hosting website. Rationale for the design concepts is grounded in the open source literature and a thirteen-week study with the CodePlex team. We propose that fostering ways to build trust, providing opportunities for merit, supporting crossover of work activities, and supporting user experience (UX) best practices in CodePlex will help dismantle the social and technological barriers for UX and encourage UX designer participation. We address UX designer motivation as a challenge for participation and conclude that the mockups presented are a first step in furthering the user experience in open source software development.",
  "authors": [
    {
      "name": "Paula M. Bach",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100328344",
      "orcid": "missing"
    },
    {
      "name": "Robert DeLine",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350602833",
      "orcid": "0000-0001-8885-8367"
    },
    {
      "name": "John M. Carroll",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Antikainen, M., Aaltonen, T. and Väisänen, J. The role of trust in OSS communities: Case Linux Kernel community Open Source Development, Adoption and Innovation. Ed. J. Feller, B. Fitzgerald, W. Scacchi and A. Silitti Springer, New York, 2007.",
      "doi": ""
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann San Francisco, 2007. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Carroll, J. M. and Rosson, M. B. Design Rationale as Theory. HCI models, theories, and frameworks : toward a multidisciplinary science. Ed. J. M. Carroll, Morgan Kaufmann, San Francisco, 2003.",
      "doi": ""
    },
    {
      "text": "Crowston, K. and Howison, J. The Social Structure of Free and Open Source Software Development. First Monday, 10, 2 2005.",
      "doi": ""
    },
    {
      "text": "Crowston, K., Howison, J. and Annabi, H. Information Systems Sucess in Free and Open Source Software Development: Theory and Measures. Software Process Improvement and Practice, 11, 2 2006, 123--148.",
      "doi": ""
    },
    {
      "text": "Gallivan, M. J. Striking a Balance Between Trust and Control in a Virtual Organization: a content analysis of open source case studies. Information Systems Journal, 2001, 11 2001, 277--304.",
      "doi": ""
    },
    {
      "text": "German, D. Software Engineering Practices in the GNOME project. Perspectives on Free and Open Source Software. Ed. J. Feller, B. Fitzgerald, S. A. Hissam and K. R. Lakhani MIT Press, Cambridge, 2005.",
      "doi": ""
    },
    {
      "text": "Ghosh, R. A. Understanding Free Software Developers: Findings from the FLOSS study. Perspectives on Free and Open Source Software. Ed. J. Feller, B. Fitzgerald, S. A. Hissam and K. R. Lakhani MIT Press, Cambridge, 2005.",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Buxton, B. Usability evaluation considered harmful (some of the time). In Proceedings of the Twenty-Sixth Annual SIGCHI Conference (Florence, Italy, April 05 - 10, 2008). ACM.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Hars, A. and Ou, S. Working for Free? Motivations for Participating in Open-Source Software Projects. International Journal of Electronic Commerce, 6, 3 2002, 25--39. ",
      "doi": "10.5555/1286960.1286963"
    },
    {
      "text": "Heckman, R., Crowston, K., Eseryel, U., Howison, J., Allen, E. and Li, Q. Emergent Decision-Making Practices in Free/Libre Open Source Software (Floss) Development Teams. Open Source Development, Adoption and Innovation, 2007.",
      "doi": ""
    },
    {
      "text": "Holck, J. and Jorgensen, N. Do Not Check in on Red: Control Meets Anarchy in Two Open Source Projects Free/Open Source Software Development. Ed. S. Koch Idea Group Publishing, Hershey, 2005.",
      "doi": ""
    },
    {
      "text": "Lakhani, K. R. and Wolf, R. G. Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects. Perspectives on Free and Open Source Software. Ed. J. Feller, B. Fitzgerald, S. A. Hissam and K. R. Lakhani, MIT Press, Cambridge, 2005.",
      "doi": ""
    },
    {
      "text": "Mockus, A., Fielding, R. T. and Herbsleb, J. A Case Study of Open Source Software Development: The Apache Web Server. Limerick, 2000.",
      "doi": ""
    },
    {
      "text": "Mockus, A., Fielding, R. T. and Herbsleb, J. Two Case Studies of Open Source Software Development: Apache and Mozilla. ACM TOESM, 11, 3 2002, 309--346.  ",
      "doi": "10.1145/567793.567795"
    },
    {
      "text": "Muffatto, M. Open Source A Multidisciplinary Approach. Imperial College Press, London, 2006. ",
      "doi": "10.5555/1198038"
    },
    {
      "text": "Nichols, D. M., Thomson, K. and Yeates, S. A. Usability and open-source software development. ACM SIGCHI New Zealand, 2001.  ",
      "doi": "10.1145/2331812.2331822"
    },
    {
      "text": "Nichols, D. M. and Twidale, M. B. The Usability of Open Source Software. First Monday, 8, 1 2003.",
      "doi": ""
    },
    {
      "text": "Nichols, D. M. and Twidale, M. B. Usability processes in open source projects. Software Process: Improvement and Practice, 11, 2 2006, 149--162.",
      "doi": ""
    },
    {
      "text": "Raymond, E. S. The catherdral and the bazaar. First Monday, 3, 3 1998. ",
      "doi": "10.5555/580808"
    },
    {
      "text": "Robbins, J. Adopting Open Source Software Engineering (OSSE) Practices by Adopting OSSE tools Perspectives on Free and Open Source Software. Ed. B. F. Joseph Feller, Scott A. Hissam and Karim R. Lakhani MIT Press, Cambridge, 2005.",
      "doi": ""
    },
    {
      "text": "Rusovan, S., Lawford, M. and Parnas, D. L. Open Source Software Development: Future or Fad? Perspectives on Free adn Open Source Software MIT Press, Cambridge, 2005.",
      "doi": ""
    },
    {
      "text": "Scacchi, W. Free/Open Source Software Development: Recent Research Results and Methods Advances in Computers. Ed. M. Zelkowitz Academic Press, San Diego, 2007.",
      "doi": ""
    },
    {
      "text": "Star, S. L. The structure of ill-structured solutions: boundary objects and heterogeneous distributed problem solving. Distributed Artificial Intelligence, 2 1989, 37--54. ",
      "doi": "10.5555/94079.94081"
    },
    {
      "text": "Studer, M. Community Structure, Individual Participation and the Social Construction of Merit Open Source Development, Adoption and Innovation, 2007.",
      "doi": ""
    },
    {
      "text": "Wenger, E. Communities of Practice: Learning, Meaning, and Identity. Cambridge University Press, Cambridge, 1998.",
      "doi": ""
    },
    {
      "text": "Wenger, E., McDermott, R. and Snyder, W. M. Cultivating Communities of Practice. Harvard Business School Press, Boston, 2002. ",
      "doi": "10.5555/560383"
    },
    {
      "text": "Wenger, E. Communities of practice: a brief introduction 2005 Accessed from http://www.ewenger.com/theory/index.htm on August 11, 2008.",
      "doi": ""
    },
    {
      "text": "Yamauchi, Y., Yokozawa, M., Shinohara, T. and Ishida, T. Collaboration with Lean Media: How Open-Source Software Succeeds. In Proceedings of CSCW '00. ACM, Philadelphia, 2000, 329--338.  ",
      "doi": "10.1145/358916.359004"
    }
  ]
}