{
  "doi": "10.1145/1518701.1518703",
  "title": "Correlating low-level image statistics with users - rapid aesthetic and affective judgments of web pages",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2009,
  "badges": [],
  "abstract": "In this paper, we report a study that examines the relationship between image-based computational analyses of web pages and users' aesthetic judgments about the same image material. Web pages were iteratively decomposed into quadrants of minimum entropy (quadtree decomposition) based on low-level image statistics, to permit a characterization of these pages in terms of their respective organizational symmetry, balance and equilibrium. These attributes were then evaluated for their correlation with human participants' subjective ratings of the same web pages on four aesthetic and affective dimensions. Several of these correlations were quite large and revealed interesting patterns in the relationship between low-level (i.e., pixel-level) image statistics and design-relevant dimensions.",
  "authors": [
    {
      "name": "Xianjun Sam Zheng",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606402",
      "orcid": "missing"
    },
    {
      "name": "Ishani Chakraborty",
      "institution": "Siemens Corporate Research and Rutgers University, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660275833",
      "orcid": "missing"
    },
    {
      "name": "James Jeng-Weei Lin",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/do/10.1145/contrib-81500649421/rel-imgonly/james-lin_page_l2.jpg",
      "acmid": "81500649421",
      "orcid": "missing"
    },
    {
      "name": "Robert Rauschenberger",
      "institution": "Siemens Corporate Research and Simon Fraser University, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607199",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnheim, R. Art and visual perception. University of California Press, Berkeley, USA, 1954.",
      "doi": ""
    },
    {
      "text": "Birkhoff, G. D. Aesthetic measure. Harvard University Press, Cambridge, MA, USA, 1933.",
      "doi": ""
    },
    {
      "text": "Brainard, D. H. The Psychophysics toolbox. Spatial Vision 10, 4 (1997), 433--436",
      "doi": ""
    },
    {
      "text": "Di Lollo, V., Enns, J. T. and Rensink, R. Competition for consciousness among visual events: The psychophysics of reentrant visual processes. Journal of Experimental Psychology: General 129, 4 (2000), 481--507.",
      "doi": ""
    },
    {
      "text": "Dondis, D. A. A primer of visual literacy. MIT Press, Cambridge, MA, USA, 1973.",
      "doi": ""
    },
    {
      "text": "Fabre-Thorpe, M., Delorme, A., Marlot, C. and Thorpe, S. A limit to the speed of processing in ultra-rapid visual categorization of novel natural scenes. Journal of Cognitive Neurosciences 13, 2 (2003), 171--180.  ",
      "doi": "10.1162/089892901564234"
    },
    {
      "text": "Finkel, R. A. and Bentley, R. A. Quad trees: A data structure for retrieval on composite keys. Acta informatica 4, 1 (1974), 1--9.",
      "doi": ""
    },
    {
      "text": "Galitz, W. O. The essential guide to user interface design: An introduction to GUI design principles and techniques. Wiley Technology, Indianapolis, IN, USA, 2007. ",
      "doi": "10.5555/1202463"
    },
    {
      "text": "Gladwell, M. Blink: The Power of Thinking Without Thinking. Little, Brown and Company, New York, NY, USA, 2005.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Burmester, M. and Koller, F. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualität {A questionnaire for the measurement of perceived hedonic and pragmatic attributes}. In Mensch&amp;Computer 2003, B. G. Teubner (2003), 187--196.",
      "doi": ""
    },
    {
      "text": "Hubel, D. H. and Livingstone, M. S. Segregation of form, color, and stereopsis in primate area 18. Journal of Neuroscience 7, 11 (1987), 3378--3415.",
      "doi": ""
    },
    {
      "text": "Hubel, D. H. and Wiesel, T. N. Brain mechanisms of vision. Scientific American 241, 3 (1979), 150--162.",
      "doi": ""
    },
    {
      "text": "Koffka, K. Principles of Gestalt psychology. Lund Humphries, London, UK, 1935.",
      "doi": ""
    },
    {
      "text": "Kourtzi, Z. and Kanwisher, N. Cortical regions involved in perceiving object shape. The Journal of Neuroscience 20, 9 (2000), 3310--3318.",
      "doi": ""
    },
    {
      "text": "Kurosu, M. and Kashimura, K, Apparent usability vs. inherent usability. In CHI 1995 Conf. Companion, ACM Press (1995), 292--293.  ",
      "doi": "10.1145/223355.223680"
    },
    {
      "text": "Lamme, V. A. F. and Roelfsema, P. R. The distinct modes of vision offered by feedforward and recurrent processing. Trends in Neurosciences 23, 11 (2000), 571--579.",
      "doi": ""
    },
    {
      "text": "Lindgaard, G., Fernandez, G., Dudek, C. and Brown, J. Attention web designers: You have 50 milliseconds to make a good impression. Behavior&amp;Information Technology 25, 2 (2006), 115--126.",
      "doi": ""
    },
    {
      "text": "Leung, T. and Malik, J. Representing and recognizing the visual appearance of materials using three-dimensional textons. International Journal of Computer Vision 43, 1 (2004), 29-44.  ",
      "doi": "10.1023/A%3A1011126920638"
    },
    {
      "text": "Mathworks Image Processing Toolbox. www.mathworks.com - Image Processing Toolbox: Color: Reducing the Number of Colors in an Image",
      "doi": ""
    },
    {
      "text": "Ngo, D. C. L. Visit: Visitor information system implementation tool. Ph.D. Thesis, Trinity College, Dublin, Ireland, 1994.",
      "doi": ""
    },
    {
      "text": "Ngo, D. C. L. and Byrne, J. G. Aesthetic measures for screen design. In Proc. OzCHI 1998, IEEE Computer Society (1998), 64--71. ",
      "doi": "10.5555/552884.825511"
    },
    {
      "text": "Ngo, D. C. L., Teo, L. S. and Byrne, J. G. Modelling interface aesthetics. Information Sciences 152 (2003), 25--46.  ",
      "doi": "10.1016/S0020-0255%2802%2900404-8"
    },
    {
      "text": "Norman, D. Emotional design: Why we love (or hate) everyday things. Basic Books, New York, NY, USA, 2004.",
      "doi": ""
    },
    {
      "text": "Oliva, A and Torralba, A. Building the gist of a scene: The role of global image features in recognition. Progress in Brain Research: Visual perception 155, (2006), 23--36.",
      "doi": ""
    },
    {
      "text": "Pelli, D. G. The VideoToolbox software for visual psychophysics: Transforming numbers into movies. Spatial Vision 10, 4 (1997), 437--442.",
      "doi": ""
    },
    {
      "text": "Rosenholtz, R., Li, Y, Mansfield, J. and Zhenlan, J. Feature congestion: A measure of display clutter. In Proc. CHI 2005, ACM Press (2005), 761--770.  ",
      "doi": "10.1145/1054972.1055078"
    },
    {
      "text": "Shannon, C. E. A mathematical theory of communication. The Bell Systems Technical Journal 27 (1948), 379--423, 623--656.",
      "doi": ""
    },
    {
      "text": "Tidwell, J. Designing interfaces: Patterns for effective interaction design. O'Reilly Media, Sebastopol, CA, USA, 2005. ",
      "doi": "10.5555/1203417"
    },
    {
      "text": "Tractinsky, N. Aesthetics and apparent usability: Empirically assessing cultural and methodological issues. In Proc. CHI 1997, ACM Press (1997), 115--122.  ",
      "doi": "10.1145/258549.258626"
    },
    {
      "text": "Tractinsky, N., Katz, A. S. and Ikar, D. What is beautiful is usable. Interacting with Computers 13, 2 (2000), 127--145.",
      "doi": ""
    },
    {
      "text": "Treisman, A. M. and Gelade, G. A feature-integration theory of attention. Cognitive Psychology 12, 1 (1980), 97--136.",
      "doi": "10.1016/0010-0285%2880%2990005-"
    },
    {
      "text": "Wang, J. Z., Li, J. and Wiederhold, G. SIMPLIcity: Semantics-sensitive Integrated Matching for Picture LIbraries. IEEE Transactions on Pattern Analysis and Machine Intelligence 23, 9 (2001), 947--963.  ",
      "doi": "10.1109/34.955109"
    },
    {
      "text": "Zajonc, R. Feeling and thinking: Preferences need no Inferences. American Psychologist 35, 2 (1980), 151 -- 175.",
      "doi": ""
    },
    {
      "text": "Zheng, X. S., Chakraborty, I., Lin, J. J. W. and Rauschenberger, R. Developing quantitative metrics to predict users' perceptions of interface design. In Proc. HFES, HFES (2008), in press.",
      "doi": ""
    },
    {
      "text": "Zipser, K., Lamme, V. A. F. and Schiller, P. H. Contextual modulation in primary visual cortex. The Journal of Neuroscience 16, 22 (1996), 7376--7389.",
      "doi": ""
    }
  ]
}