{
  "doi": "10.1145/1518701.1519061",
  "title": "Effects of real-time transcription on non-native speaker's comprehension in computer-mediated communications",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2353-2356",
  "year": 2009,
  "badges": [],
  "abstract": "We performed an empirical study to understand the relative contributions of real-time transcription to a non-native speaker's comprehension in audio/video meetings. 48 participants were assigned to 2 presentation modes (audio, audio+video) and 3 transcription modes (no transcript, real-time transcripts in the streaming mode, transcripts with all past records) in a 3x2 factorial experimental design. The results suggest that comprehension can be significantly improved for both audio and audio+video conditions when real-time transcription is provided. Also, the participants reported positive subjective responses to the presence of real-time transcription in terms of usefulness, preference, and willingness to use such a feature if provided. No cognitive load issues were reported by the participants in the ability to synthesize across modalities. Implications for system development and design, as well as future work utilizing automation speech recognition to provide the transcripts are discussed.",
  "authors": [
    {
      "name": "Yingxin Pan",
      "institution": "IBM China Research Lab, Zhongguancun Software Park, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81423593545",
      "orcid": "missing"
    },
    {
      "name": "Danning Jiang",
      "institution": "IBM China Research Lab, Zhongguancun Software Park, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593254",
      "orcid": "missing"
    },
    {
      "name": "Michael Picheny",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100085505",
      "orcid": "missing"
    },
    {
      "name": "Yong Qin",
      "institution": "IBM China Research Lab, Zhongguancun Software Park, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81544389556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tyler, M.D. The Effect of Background Knowledge on First and Second Language Comprehension Difficulty. In Proc. of ICSLP 1998 (International Conference on Spoken Language Processing.)",
      "doi": ""
    },
    {
      "text": "Nakamura S., Markov K., Nakaiwa H., et al. The ATR Multilingual Speech-to-Speech Translation System. IEEE Transactions on Audio, Speech, and Language Processing 10, 2 (2006), 365--376.  ",
      "doi": "10.1109/TSA.2005.860774"
    },
    {
      "text": "Imoto K., Sasajima M., Shimomori T., et al. A Multi-modal Supporting Tool for Multi-lingual Communication by Inducing Partner's Reply. In Proc. IUI'2006, ACM Press (2006), 330--332.  ",
      "doi": "10.1145/1111449.1111527"
    },
    {
      "text": "Chen S., Kingsbury B., Mangu L., et al. Advances in Speech Transcription at IBM under the DAPAR EARS Program. IEEE Transactions on Audio, Speech, and Language Processing 14, 5 (2006), 1596--1608.  ",
      "doi": "10.1109/TASL.2006.879814"
    },
    {
      "text": "Cui X., Gu L., Xiang B., et al. Developing High Performance ASR in the IBM Multilingual Speech-to-Speech Translation System. In Proc. ICASSP 2008 (International Conference on Acoustics, Speech, and Signal Processing), IEEE Press (2008), 5121--5124.",
      "doi": ""
    },
    {
      "text": "Markham P.L., Peter L. A., McCarthy T.J. The Effects of Native Language vs. Target Language Captions on Foreign Language Students' DVD Video Comprehension. Foreign Language Annals 34, 5 (2001), 439--445.",
      "doi": ""
    },
    {
      "text": "Jin Y., Psychological Measurement. East China Normal University Press, China, 2005.",
      "doi": ""
    },
    {
      "text": "Veinott, E.S., Fu, X.L., Olsen J, et al. Video Helps Remote Work: Speaker Who Need to Negotiate Common Ground Benefit from Seeing Each Other. In Proc. CHI 1999, ACM Press (1999), 302--309.  ",
      "doi": "10.1145/302979.303067"
    }
  ]
}