{
  "doi": "10.1145/1518701.1518922",
  "title": "Contextual web history: using visual and contextual cues to improve web browser history",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1457-1466",
  "year": 2009,
  "badges": [],
  "abstract": "While most modern web browsers offer history functionality, few people use it to revisit previously viewed web pages. In this paper, we present the design and evaluation of Contextual Web History (CWH), a novel browser history implementation which improves the visibility of the history feature and helps people find previously visited web pages. We present the results of a formative user study to understand what factors helped people in finding past web pages. From this, we developed CWH to be more visible to users, and supported search, browsing, thumbnails, and metadata. Combined, these relatively simple features outperformed Mozilla Firefox 3's built-in browser history function, and greatly reduced the time and effort required to find and revisit a web page.",
  "authors": [
    {
      "name": "Sungjoon Steve Won",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545923156",
      "orcid": "missing"
    },
    {
      "name": "Jing Jin",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416603809",
      "orcid": "missing"
    },
    {
      "name": "Jason I. Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    }
  ],
  "references": [
    {
      "text": "BrowseBack: Visual Web History You Can Search. http://www.smileonmymac.com/browseback/",
      "doi": ""
    },
    {
      "text": "MindRetrieve - Search Your Personal Web. http://www.mindretrieve.net/",
      "doi": ""
    },
    {
      "text": "Abrams, D., R. Baecker, and M. Chignell. Information archiving with bookmarks: personal webspace construction and organization. In Proceedings of CHI'98: ACM Press. pp. 41--48 1998.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Adar, E., J. Teevan, and S. Dumais. Large Scale Analysis of Web Revisitation Patterns. In Proceedings of Twenty-sixth annual SIGCHI conference on Human factors in computing systems (CHI 2008). pp. 1197--1206 2008.  ",
      "doi": "10.1145/1357054.1357241"
    },
    {
      "text": "Aula, A., N. Jhaveri, and M. Käki. Information Search and Re-access Strategies of Experienced Web Users. In Proceedings of WWW 2005. pp. 583--592 2005.  ",
      "doi": "10.1145/1060745.1060831"
    },
    {
      "text": "Ayers, E. and J. Stasko. Using graphic history in browsing the World Wide Web. In Proceedings of WWW 95 1995.",
      "doi": ""
    },
    {
      "text": "Blanc-Brude, T. and D.L. Scapin. What do People Recall about their Documents? Implications for Desktop Search Tools. In Proceedings of Intelligent User Interfaces (IUI'07). pp. 102--110 2007.  ",
      "doi": "10.1145/1216295.1216319"
    },
    {
      "text": "Byrne, M.D., B.E. John, N.S. Wehrle, and D.C. Crow. The tangled web we wove: A taskonomy of WWW use. In Proceedings of Human Factors in Computing Systems: Proceedings of CHI 99. pp. 544--551 1999.  ",
      "doi": "10.1145/302979.303154"
    },
    {
      "text": "Catledge, L.D. and J.E. Pitkow. Characterizing browsing strategies in the World-Wide Web. In Proceedings of WWW 1995. pp. 1065--1073 1995.  ",
      "doi": "10.1016/0169-7552%2895%2900043-7"
    },
    {
      "text": "Cockburn, A. and S. Greenberg, Issues of Page Representation and Organisation in Web Browser's Revisitation Tools. Australian Journal of Information Systems 2000. 7: p. 120--127.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., S. Greenberg, B. McKenzie, M. Jasonsmith, and S. Kaasten. WebView: A Graphical Aid for Revisiting Web Pages. In Proceedings of OZCHI'99 Australian Conference on Human Computer Interaction 1999.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and B. McKenzie, What Do Web Users Do? An Empirical Analysis of Web Use. International Journal of Human-Computer Studies 2001. 54(6): p. 903--922.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "Cockburn, A., B. McKenzie, and M. Jason-Smith, Pushing Back: Evaluating a New Behaviour for the Back and Forward Buttons in Web Browsers. International Journal of Human-Computer Studies 2002. 57(5): p. 397--414.  ",
      "doi": "10.5555/637454.637455"
    },
    {
      "text": "Czerwinski, M., M. van Dantzich, G.G. Robertson, and H. Hoffman. The Contribution of Thumbnail Image, Mouse-over Text and Spatial Location Memory to Web Page Retrieval in 3D. In Proceedings of Interact'99. pp. 163--170 1999.",
      "doi": ""
    },
    {
      "text": "Hightower, R.R., L.T. Ring, J.I. Helfman, B.B. Bederson, and J.D. Hollan. Graphical multiscale Web histories: a study of padprints. In Proceedings of HYPERTEXT '98: Proceedings of the ninth ACM conference on Hypertext and hypermedia. pp. 58--65 1998.  ",
      "doi": "10.1145/276627.276634"
    },
    {
      "text": "Jones, W., H. Bruce, and S. Dumais. Keeping found things found on the web. In Proceedings of The tenth international conference on Information and knowledge management (CIKM01). pp. 119 -- 126 2001.  ",
      "doi": "10.1145/502585.502607"
    },
    {
      "text": "Jones, W., S. Dumais, and H. Bruce, Once Found, What Then? A Study of \"Keeping\" Behaviors in Personal Use of Web Information. ASIST 2002 2002. 39(1): p. 391--402.",
      "doi": ""
    },
    {
      "text": "Jones, W.P. and S.T. Dumais, The Spatial Metaphor for User Interfaces: Experimental Tests of Reference by Location versus Name. ACM Transactions on Office Information Systems 1986. 4(1): p. 42--63.  ",
      "doi": "10.1145/5401.5405"
    },
    {
      "text": "Kaasten, S. and S. Greenberg. Integrating back, history and bookmarks in web browsers. In Proceedings of CHI '01: CHI '01 extended abstracts on Human factors in computing systems. Seattle, Washington. pp. 379--380 2001.  ",
      "doi": "10.1145/634067.634291"
    },
    {
      "text": "Lansdale, M.W., Remembering about Documents: Memory for Appearance, Format, and Location. Ergonomics 1991. 34(8): p. 1161--1178.",
      "doi": ""
    },
    {
      "text": "LeeTiernan, S., S. Farnham, and L. Cheng. Two methods for auto-organizing personal web history. In Proceedings of CHI '03: CHI '03 extended abstracts on Human factors in computing systems. Ft. Lauderdale, Florida, USA. pp. 814--815 2003.  ",
      "doi": "10.1145/765891.766008"
    },
    {
      "text": "Milic-Frayling, N., R. Jones, K. Rodden, G. Smyth, A. Blackwell, and R. Sommerer. Smartback: supporting users in back navigation. In Proceedings of WWW'04: ACM Press. pp. 63--71 2004.  ",
      "doi": "10.1145/988672.988682"
    },
    {
      "text": "Obendorf, H., H. Weinreich, E. Herder, and M. Mayer. Web Page Revisitation Revisited: Implications of a Long-term Click-stream Study of Browser Usage. In Proceedings of CHI 2007. pp. 597--606 2007.  ",
      "doi": "10.1145/1240624.1240719"
    },
    {
      "text": "Robertson, G., M. Czerwinski, K. Larson, D.C. Robbins, D. Thiel, and M.v. Dantzich. Data mountain: using spatial memory for document management. In Proceedings of 11th annual ACM symposium on User interface software and technology (UIST 1998). pp. 153--162 1998.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Suh, B., A. Woodruff, R. Rosenholtz, and A. Glass. Popout Prism: Adding Perceptual Principles to Overview+Detail Document Interfaces. In Proceedings of The SIGCHI conference on Human factors in computing systems (CHI2002). pp. 251--258 2002.  ",
      "doi": "10.1145/503376.503422"
    },
    {
      "text": "Tauscher, L. and S. Greenberg, How People Revisit Web Pages: Empirical Findings and Implications for the Design of History Systems. International Journal of Human Computer Studies 1997. 47(1): p. 97--138.  ",
      "doi": "10.1006/ijhc.1997.0125"
    },
    {
      "text": "Teevan, J. The re:search engine: simultaneous support for finding and re-finding. In Proceedings of UIST '07: Proceedings of the 20th annual ACM symposium on User interface software and technology. Newport, Rhode Island, USA. pp. 23--32 2007.  ",
      "doi": "10.1145/1294211.1294217"
    },
    {
      "text": "Teevan, J., E. Adar, R. Jones, and M. Potts. Information re-retrieval: Repeat queries in Yahoo's logs. In Proceedings of SIGIR '07 2007.  ",
      "doi": "10.1145/1277741.1277770"
    },
    {
      "text": "Weinreich, H., H. Obendorf, H. Herder, and M. Mayer. Off the Beaten Tracks: Exploring Three Aspects of Web Navigation. In Proceedings of WWW 2006: ACM Press. pp. 133--142 2006.  ",
      "doi": "10.1145/1135777.1135802"
    },
    {
      "text": "Wexelblat, A. and P. Maes. Footprints: history-rich tools for information foraging. In Proceedings of Seventeenth annual SIGCHI conference on Human factors in computing systems (CHI 99). Pittsburgh, Pennsylvania, United States. pp. 270--277 1999.  ",
      "doi": "10.1145/302979.303060"
    },
    {
      "text": "Woodruff, A., A. Faulring, R. Rosenholtz, J. Morrsion, and P. Pirolli. Using thumbnails to search the Web. In Proceedings of Nineteenth annual SIGCHI conference on Human factors in computing systems (CHI 2001). Seattle, Washington, United States. pp. 198--205 2001.  ",
      "doi": "10.1145/365024.365098"
    }
  ]
}