{
  "doi": "10.1145/1518701.1518913",
  "title": "Disambiguating ninja cursors with eye gaze",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1411-1414",
  "year": 2009,
  "badges": [],
  "abstract": "Ninja cursors aim to speed up target selection on large or multiple monitors. Several cursors are displayed on the screen with one of them selected as the active cursor. Eye tracking is used to choose the active cursor. An experiment with 13 participants showed that multiple cursors speed up the selection over long distances, but not over short distances. Participants felt the technique was fastest with 4 cursors per monitor, but still preferred to have only 1 cursor per monitor for their own use.",
  "authors": [
    {
      "name": "Kari-Jouko Räihä",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100052864/rel-imgonly/aa.jpg",
      "acmid": "81100052864",
      "orcid": "missing"
    },
    {
      "name": "Oleg Špakov",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390422",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bates, R. and Istance, H. O. Zooming interfaces! Enhancing the performance of eye controlled pointing devices. In Proc. ASSETS 2002, 119--126.  ",
      "doi": "10.1145/638249.638272"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B., and Zierlinger, A. Drag-and-Pop and Drag-and-Pick: Techniques for accessing remote screen content on touch- and pen-operated systems. In Proc. INTERACT 2003, 57--64.",
      "doi": ""
    },
    {
      "text": "Benko, H. and Feiner, S. Multi-monitor mouse. In CHI '05 Extended Abstracts, 1208--1211.  ",
      "doi": "10.1145/1056808.1056878"
    },
    {
      "text": "Fono, D. and Vertegaal, R. EyeWindows: evaluation of eye-controlled zooming windows for focus selection. In Proc. CHI '05, 151--160.  ",
      "doi": "10.1145/1054972.1054994"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The Bubble Cursor: Enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. CHI '05, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. Object pointing: a complement to bitmap pointing in GUIs. In Proc. Graphics Interface 2004, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Kobayashi, M. and Igarashi, T. Ninja Cursors: using multiple cursors to assist target acquisition on large screens. In Proc. CHI '08, 949--958.  ",
      "doi": "10.1145/1357054.1357201"
    },
    {
      "text": "Kumar, M., Paepcke, A., and Winograd, T. EyePoint: practical pointing and selection using gaze and keyboard. In Proc. CHI '07, 421--430.  ",
      "doi": "10.1145/1240624.1240692"
    },
    {
      "text": "Miniotas, D., pakov, O., Tugoy, I., and MacKenzie, I. S. Speech-augmented eye gaze interaction with small closely spaced targets. In Proc. ETRA 2006, 67--72.  ",
      "doi": "10.1145/1117309.1117345"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Baudisch, P., Meyers, B., Robbins, D., Smith, G., and Tan, D. Large display user experience. IEEE Computer Graphics&amp;Application, July/August 2005, 44--51.  ",
      "doi": "10.1109/MCG.2005.88"
    },
    {
      "text": "Zhai, S., Morimoto, C., and Ihde, S. Manual and gaze input cascaded (MAGIC) pointing. In Proc. CHI '99, 246--253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}