{
  "doi": "10.1145/1518701.1518712",
  "title": "Expert recommender systems in practice: evaluating semi-automatic profile generation",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "59-68",
  "year": 2009,
  "badges": [],
  "abstract": "Expert recommender systems (ERS) are considered a promising technology in knowledge management. However, there are very few studies which evaluated their appropriation in practice. In this paper, we present results of a case study of expert recommender technology in a large European industrial association. Unlike existing expert recommender approaches, the system involves users in selecting textual documents for semi-automatic profile generation. Our study focuses on the appropriation of this functionality and discusses impacts from an organizational perspective.",
  "tags": [
    "expertise recommender system",
    "second wave",
    "knowledge management"
  ],
  "authors": [
    {
      "name": "Tim Reichling",
      "institution": "University of Siegen, 57068 Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309506555",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen and Fraunhofer FIT, 57068 Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S.; Malone, T.W. Answer Garden A tool for growing Organizational Memory; in: Proc. of the ACM Conference on Office Information Systems, (1990), pp. 31--39  ",
      "doi": "10.1145/91474.91485"
    },
    {
      "text": "Ackerman, M. S.; Pipek, V.; Wulf, V. (eds) Expertise Sharing: Beyond Knowledge Management, MIT Press, Cambridge MA 2003 ",
      "doi": "10.5555/572524"
    },
    {
      "text": "Agostini, A., Albolino, S, De Paoli, F, Grasso, A. M,. Hinrichs, E. Supporting Communities by Providing Multiple Views, in: Proceedings of Communities and Technologies, Kluwer 2005, pp. 437--456",
      "doi": ""
    },
    {
      "text": "Bannon, L.J., Kuutti, K. Shifting Perspectives on Organizational Memory: From Storage to Active Remembering. 29. HICSS 1996: Maui, Hawaii, USA - Volume 3, 1996, pp. 156--167 ",
      "doi": "10.5555/795700.798548"
    },
    {
      "text": "Bradner, E., Kellogg, W.A., Erickson, T, The Adoption and Use of Babble: A Field Study of Chat in the Workplace, in Proc. of the ECSCW, 1999, pp. 139--158 ",
      "doi": "10.5555/351689.351698"
    },
    {
      "text": "Cohen, D.; Prusak, L. In Good Company: How Social Capital makes Organizations Work, Harvard Business School Press, Boston 2001",
      "doi": ""
    },
    {
      "text": "Deerwester, S., Dumais, S., Furnas G., Landauer, T. and Harshman, R. Indexing by Latent Semantic Analysis. Journal of the American Society of Information Science, Vol. 41, No. 6, 1990, pp. 391--407",
      "doi": ""
    },
    {
      "text": "Ehrlich, K. Shami, N.S. Searching for expertise, in: ACM Conference on Human Factors, in Computing Systems, New York: ACM Press 2008, pp. 1093--1096  ",
      "doi": "10.1145/1357054.1357224"
    },
    {
      "text": "Foner, L. N. Yenta: A Multi-Agent, Referral-Based Matchmaking System, in First International Conference on Autonomous Agents (Agent'97), ACM-Press, New York 1997, S. 301--307  ",
      "doi": "10.1145/267658.267732"
    },
    {
      "text": "Groth, K.; Bowers, J. On Finding things out: Situated organizational knowledge in CSCW, in Proc. of the 7th ECSCW, Kluwer, Dordrecht, (2001), pp. 279--298 ",
      "doi": "10.5555/1241867.1241882"
    },
    {
      "text": "Huysman, M., de Wit, D. Knowledge Sharing in Practice, (2004), Dordrecht: Kluwer Academics ",
      "doi": "10.5555/572439"
    },
    {
      "text": "Huysman, M., Wulf, V. IT to Support Knowledge Sharing in Communities: Towards a Social Capital Analysis, in: Journal on Information Technology (JIT), No. 1, Vol. 21, (2006), pp. 40--51",
      "doi": ""
    },
    {
      "text": "Kautz, H., Selman, B., Shah, M. ReferralWeb: Combining Social Networks and Collaborative Filtering, Com. of the ACM, special issue, vol. 40, 1997, pp. 63--65.  ",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Lindgren, R., Henfriedsson, O., Schultze, U. Design Principles for Competence Management Systems: A Synthesis of an Action Research Study. In: MIS Quaterly, Vol. 28, 2004, pp. 435--427 ",
      "doi": "10.5555/2017227.2017233"
    },
    {
      "text": "Maybury, M.; D'Amore, R.; House, D. Automated Discovery and Mapping of Expertise, in Ackerman, M.; Pipek, V.; Wulf, V. (eds): Expertise Sharing: Beyond Knowledge Management, MIT-Press, 2002, pp. 359--382",
      "doi": ""
    },
    {
      "text": "McArthur, R., Bruza P. Discovery of implicit and explicit connections between people using email utterance, in: Proc. of the 8th Conference on Computer Supported Cooperative Work, Helsinki, 2003, pp. 21--40 ",
      "doi": "10.5555/1241889.1241891"
    },
    {
      "text": "McDonald, D. W. Supporting Nuance in Groupware Design: Moving from Naturalistic Expertise Location to Expertise Recommendation, PhD--thesis, University of California, 2000, Irvine. ",
      "doi": "10.5555/932336"
    },
    {
      "text": "Orlikowski, W. J. Evolving with Notes: Organizational change around groupware technology, in C. Ciborra (ed.): Groupware&amp;Teamwork, J. Wiley, Chichester et al., 1996 pp. 23--60 ",
      "doi": "10.5555/265725.268137"
    },
    {
      "text": "Pohs W., Pinder, G., Dougherty, C., White, M. The Lotus Knowledge Discovery System: Tools an Experiences, IBM Systems Journal, Vol 40, No 4, 2001  ",
      "doi": "10.1147/sj.404.0956"
    },
    {
      "text": "Polanyi, M. Implizites Wissen, 1. Auflage. Frankfurt am Main: Suhrkamp Taschenbuch Verlag, 1985",
      "doi": ""
    },
    {
      "text": "Reichling, T., Veith M. Expertise Sharing in a Heterogeneous Organizational Environment. In: Proc. of the 9th European Conference on CSCW (ECSCW 2005). Springer, 2005, pp. 325--345 ",
      "doi": "10.5555/1242029.1242046"
    },
    {
      "text": "Reichling, T., Veith, M., Wulf, V. Expert Recommender: Designing for a Network Organization, in Journal of Computer Supported Cooperative Work, 2007  ",
      "doi": "10.1007/s10606-007-9055-2"
    },
    {
      "text": "Shami, N.S., Ehrlich, K., Millen, D. Pick me! Link selection in expertise search results. in ACM Conference on Human Factors in Computing Systems 2008, New York: ACM Press, 2008, pp. 1089--1092  ",
      "doi": "10.1145/1357054.1357223"
    },
    {
      "text": "Soroka, V. and Jacovi, M.: The diffusion of reachOut: analysis and framework for the successful diffusion of collaboration technologies. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work, 2004. ACM, New York, NY, pp. 314--323.  ",
      "doi": "10.1145/1031607.1031658"
    },
    {
      "text": "Streeter, L. A.; Lochbaum, K. A. An expert/expert location system based on an automatic representation of semantic structure, in Proceedings of the 4th Conference on Artificial Intelligence Applications, San Diego, 1988, ACM-Press, New York, 1988, pp. 345--350",
      "doi": ""
    },
    {
      "text": "Susman, G., Evered, R. An assessment of the scientific merits of action research, Administrative Science Quarterly, 23, 1978, pp. 582--603.",
      "doi": ""
    },
    {
      "text": "Vivacque, A.; Lieberman, H., Agents to assist in finding help, in: Proc. of the Conference on Computer Human Interaction, ACM-Press, New York 2000, pp. 65--72  ",
      "doi": "10.1145/332040.332408"
    },
    {
      "text": "Wenger, E. Communities of Practice, Cambridge University Press, Cambridge1998",
      "doi": ""
    },
    {
      "text": "Wulf, V., Rohde, M. Towards an integrated organization and technology development, in Proceedings of the conference on Designing interactive systems: processes, practices, methods,&amp;techniques, 1995, ACM Press, New York, pp. 55--64.  ",
      "doi": "10.1145/225434.225441"
    },
    {
      "text": "Zhang, J.; Ackerman, M.; Adamic, L.: Expertise networks in online communities: structure and algorithms, in: Proceedings of the 16th International Conference on World Wide Web (WWW 2007), Banff, CA, May 8-12, 2007. ACM-Press 2007, pp. 221--230  ",
      "doi": "10.1145/1242572.1242603"
    }
  ]
}