{
  "doi": "10.1145/1518701.1518828",
  "title": "Passive photography from a creative perspective: \"If I would just shoot the same thing for seven days, it's like... What's the point?\"",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "829-838",
  "year": 2009,
  "badges": [],
  "abstract": "This paper aims to contribute with an understanding of meaningful experiences of photography, to support reflection upon the design of future camera devices. We have conducted a study of a passive camera device called Sensecam, which previously has been investigated as a memory aid, a combination of life-logging and memory tool and as a resource for digital narratives. We take a creative perspective and show that even if a camera is designed to be forgotten in use (i.e. is worn as a necklace and takes pictures automatically) it can still be part of an engaging or active photographic experience. Because Sensecam is different from film cameras, camera phones and other digital cameras, it involves a different type of photographic experience, for example when moving through different social contexts and how the resulting pictures are appreciated. The findings stem from people who used the camera for a week. This is complemented with reflections from the researcher, who has been using the camera for a month.",
  "tags": [
    "sensecam",
    "experience-centred design",
    "creative photography"
  ],
  "authors": [
    {
      "name": "Sara Ljungblad",
      "institution": "SICS, Kista, Sweden",
      "img": "/do/10.1145/contrib-81100194686/rel-imgonly/sara.jpg",
      "acmid": "81100194686",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bitton, J., Agamanolis, S., and Karau, M. 2004. RAW: conveying minimally-mediated impressions of everyday life with an audio-photographic tool. In Proc. of CHI '04. ACM, New York, NY, 495--502  ",
      "doi": "10.1145/985692.985755"
    },
    {
      "text": "Chalfen, R. 1987. Snapshot Versions of Life. Bowling Green State University Press.",
      "doi": ""
    },
    {
      "text": "Cunningham, S. J. and Jones, M. 2005. Autoethnography: a tool for practice and education. In Proc. of the 6th ACM SIGCHI CHINZ '05, vol. 94. ACM, New York, NY, 1--8.  ",
      "doi": "10.1145/1073943.1073944"
    },
    {
      "text": "Dourish, P. 2001. Where the Action Is: the Foundations of Embodied Interaction. MIT Press. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Frigo, A. http://www.albertofrigo.net/ Accessed Sept 10, 2008.",
      "doi": ""
    },
    {
      "text": "Frolich, D., Adams, G. and Tallyn, E. 2000. Augmenting Photographs with Audio. Personal Technologies Vol. 4. No 4. 205--208  ",
      "doi": "10.1007/s007790070003"
    },
    {
      "text": "Gaver, W. W., Bowers, J., Boucher, A., Gellerson, H., Pennington, S., Schmidt, A., Steed, A., Villars, N., and Walker, B. 2004. The drift table: designing for ludic engagement. In CHI '04 Extended Abstracts ACM, New York, NY, 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Gemmell, J., Williams, L., Wood, K., Lueder, R. and Bell, G. 2004. Passive capture and ensuing issues for a personal lifetime store. In 1st ACM Workshop on Continuous Archival and Retrieval of Personal Experiences, ACM, 48--55.  ",
      "doi": "10.1145/1026653.1026660"
    },
    {
      "text": "Hammersley, M. and Atkinson, P. 1983. Ethnography Principles and Practice, Routledge, London. Third Edition 2007.",
      "doi": ""
    },
    {
      "text": "Harper, R. Randall, D.;Smyth, N.; Evans, C.; Heledd, L.&amp;Moore, R., 'The past is a different place: they do things differently there', Proceedings of DIS (Designing Interactive Systems), (2008) ACM Press, pp 271--280  ",
      "doi": "10.1145/1394445.1394474"
    },
    {
      "text": "Harper, R., Randall, D., Smyth, N., Evans, C., Heledd. L. and Moore. R. 2007. Thanks for the Memory. In Proc.of IEEE HCI 2007. ",
      "doi": "10.5555/1531407.1531418"
    },
    {
      "text": "Healey, J and Picard, R.W. Startlecam: A cybernetic Wearable Camera. In Proc. of 2nd Int. Symp. On Wearable Computing, Pittsburg, PA. ",
      "doi": "10.5555/857199.858015"
    },
    {
      "text": "Hodges, S., Williams, L., Berry, E., Izadi, S., Srinivasan, J., Butler, A., Smyth, G., Kapur, N., and Wood, K. 2006 SenseCam: a Retrospective Memory Aid. In Proc of. Ubicomp 2006, LNCS 4206, Springer-Verlag Berlin Heidelberg 177 -- 193.  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "Håkansson, M., Gaye, L., Ljungblad, S., and Holmquist, L. E. 2006. More than meets the eye: an exploratory study of context photography. In Proc. of NordiCHI '06, vol. 189. ACM, New York, NY, 262--271.  ",
      "doi": "10.1145/1182475.1182503"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., and Sellen, A. 2005. I saw this and thought of you: some social uses of camera phones. In CHI '05 Extended Abstracts, ACM, New York, NY, 1545--1548.  ",
      "doi": "10.1145/1056808.1056962"
    },
    {
      "text": "Ljungblad, S. 2007. Designing for new photographic experiences: how the lomographic practice informed context photography. In Proc. of DPPI '07. ACM, New York, NY, 357--374.  ",
      "doi": "10.1145/1314161.1314193"
    },
    {
      "text": "Martin, H. and Gaver, B. 2000. Beyond the snapshot from speculation to prototypes in audiophotography. In Proc. of DIS '00. ACM, New York, NY, 55--65.  ",
      "doi": "10.1145/347642.347663"
    },
    {
      "text": "McCarthy, J. and Wright, P. 2004. Technology as experience. Cambridge, MIT Press ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Preece, J., Sharp, H. and. Rogers, Y. 2002. Interaction Design: Beyond Human-Computer Interaction. John Wiley&amp;Sons, Inc. ",
      "doi": "10.5555/558189"
    },
    {
      "text": "Sellen, A. J., Fogg, A., Aitken, M., Hodges, S., Rother, C., and Wood, K. 2007. Do life-logging technologies support memory for the past?: an experimental study using sensecam. In Proc. of CHI '07. ACM, New York, NY, 81--90  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Sengers. P. 2006. Autobiographical Design CHI 2006 Presented at the Workshop on Theory and Method for Experience-Centred Design, April 2006.",
      "doi": ""
    },
    {
      "text": "Sontag, S. 1977. On Photography, London, England, Penguin Group.",
      "doi": ""
    },
    {
      "text": "Van House, N., Davis, M., Ames, M., Finn, M., and Viswanathan, V. 2005. The uses of personal networked digital imaging: an empirical study of cameraphone photos and sharing. In CHI '05 Extended Abstracts ACM, New York, NY, 1853--1856.  ",
      "doi": "10.1145/1056808.1057039"
    },
    {
      "text": "Wells, L. (Ed.) 2004. Photography: A critical introduction. New York, NY, Routledge (Third edition)",
      "doi": ""
    },
    {
      "text": "Wood, K., Fleck, R.&amp;Williams, L (2004) Playing with SenseCam. In Proc. of Playing with Sensors: Exploring the boundaries of sensing for playful ubiquitous computing (W3), UbiComp 2004, Nottingham, UK.",
      "doi": ""
    },
    {
      "text": "Wright, P. and McCarthy, J. 2008. Empathy and experience in HCI. In Proc.of CHI '08. ACM, New York, NY, 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    }
  ]
}