{
  "doi": "10.1145/1518701.1519041",
  "title": "Getting there: six meta-principles and interaction design",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2223-2232",
  "year": 2009,
  "badges": [],
  "abstract": "Principled knowledge is a mark of any established disciplinary practice. Its derivation and validation of varies across disciplines, but HCI has tended towards posthoc ('a posteriori') syntheses. We present an alternative a priori approach that is relatively compact and open to inspection. We use John Heskett's position on the origins of design outcomes to derive six metaprinciples for all design processes: receptiveness, expressivity, committedness, credibility, inclusiveness and improvability. Although very abstract, these meta-principles generate critical insights into existing HCI approaches, identifying gaps in suitability and coverage. Practical value is increased by progressive instantiation of meta-principles to create first craft-specific, and ultimately project-specific, Interaction Design principles. A worth-centred approach is adopted to illustrate progressive instantiation towards a framework of adapted and novel HCI approaches. The internal coherence of the six metaprinciples is shown to provide direct effective support for synergistic progressive instantiation.",
  "authors": [
    {
      "name": "Gilbert Cockton",
      "institution": "University of Sunderland, Sunderland, United Kingdom",
      "img": "/do/10.1145/contrib-81100175348/rel-imgonly/81100175348.jpg",
      "acmid": "81100175348",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alderfer, C. 1972. Existence, Relatedness, and Growth.",
      "doi": ""
    },
    {
      "text": "Allingham, M. 2002. Choice Theory. Oxford Paperbacks",
      "doi": ""
    },
    {
      "text": "Banks, R. 2008. A Sort of Philosophy. rb.log, last accessed 7/1/09 at www.richardbanks.com/?p=1497.",
      "doi": ""
    },
    {
      "text": "Bardzell, J. and Bardzell, S. 2008. Interaction criticism: a proposal and framework for a new discipline of HCI.CHI '08 Extended Abstracts. ACM, 2463--2472.  ",
      "doi": "10.1145/1358628.1358703"
    },
    {
      "text": "Barnes, J. 2000, Aristotle. Oxford Paperbacks.",
      "doi": ""
    },
    {
      "text": "Brown B., Taylor, A., Izadi, S., Sellen, A. and Kay, J. 2007. Locating Family Values: A Field Trial of the Whereabouts Clock. Proc. UbiComp 2007. Springer. 354--371. ",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "Brown, T. 2005. Strategy by Design. Fast Company, June 2005, last accessed 23/1/09 at www.ideo.com/publications/item/strategy-by-design",
      "doi": ""
    },
    {
      "text": "Buchenau, M. and Suri, J. F. 2000. Experience prototyping. Proc. DIS 2000 ACM, 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Buxton, B. 2007. Sketching User Experiences: Getting the Design Right and the Right Design, Elsevier. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Cockton, G., 2006, Designing worth is worth designing. Proc. NordiCHI 2006, ACM, 165--174.  ",
      "doi": "10.1145/1182475.1182493"
    },
    {
      "text": "Cockton, G. 2008. Revisiting Usability's Three Key Principles. CHI 2008 Extended Abstracts, 2473--2484.  ",
      "doi": "10.1145/1358628.1358704"
    },
    {
      "text": "Cockton, G. 2008. Designing Worth - Connecting Preferred Means to Desired Ends. Interactions. 15(4). 54--57.  ",
      "doi": "10.1145/1374489.1374502"
    },
    {
      "text": "Cockton, G. 2008. Load while Aiming Hit?\"(invited keynote), in Usability Professionals 2008, eds. H. Bau, S. Diefenbach, M. Hassenzahl, F. Koller, M. Peissner and K. Röse, 1722. last accessed 7/1/09 at germanupa.de/germanupa/fachkonferenz/keynote/keynote%20gilbert%20cockton.pdf/ at_download/file.",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2001. Where the Action Is: The Foundations of Embodied Interaction. MIT Press. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Dourish, P. 2006. Implications for design. Proc. CHI 2006. ACM, 541--550  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Finlayson, J.F. 2005. Habermas. Oxford Paperbacks",
      "doi": ""
    },
    {
      "text": "Friedman, B. and Kahn, P. 2003. Human Values, Ethics and Design, in The Human Computer Interaction Handbook, eds. J. Jacko and A. Sears, 1171--1201, Lawrence Erlbaum Associates. ",
      "doi": "10.5555/772072.772147"
    },
    {
      "text": "Gaver, W. 2007. Cultural commentators: Nonnative interpretations as resources for polyphonic assessment. IJHCS, 65(4), 292--305.  ",
      "doi": "10.1016/j.ijhcs.2006.11.014"
    },
    {
      "text": "Gaver, W., Boucher, A., Law, A., Pennington, S., Bowers, J., Beaver, J., Humble, J., Kerridge, T., Villar, N., and Wilkie, A. 2008. Threshold devices: looking out from the home. Proc. CHI 2008. ACM, 1429--1438  ",
      "doi": "10.1145/1357054.1357278"
    },
    {
      "text": "Gould, J., and Lewis, C. 1985. Designing for usability: Key principles and what designers think, CACM, 28(3), 300--311.  ",
      "doi": "10.1145/3166.3170"
    },
    {
      "text": "Grayling, A.C. 2001. Wittgenstein. Oxford Paperbacks",
      "doi": ""
    },
    {
      "text": "Heskett, J. 2002. Design. Oxford Paperbacks.",
      "doi": ""
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B., Druin, A., Plaisant, C., BeaudouinLafon, M., Conversy, S., Evans, H., Hansen, H., Roussel, N., and Eiderbäck, B., 2003. Technology probes: inspiring design for and with families. Proc CHI 2003, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Körner, S. 1955, Kant. Pelican.",
      "doi": ""
    },
    {
      "text": "Lieberman, H. The Tyranny of Evaluation, CHI 2003 Fringe, last accessed 7/1/at web.media.mit.edu/lieber/Misc/TyrannyEvaluation.html,",
      "doi": ""
    },
    {
      "text": "Moran, T.P. and Carroll, J.M. 1996. Design Rationale: Concepts, Techniques, and Use. Lawrence Erlbaum Associates. ",
      "doi": "10.5555/546974"
    },
    {
      "text": "Shneiderman, B. 1983. Direct Manipulation: A step beyond programming languages. IEEE Computer, 16,57--69.  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. 2004. Towards a standard for pointing device evaluation: perspectives on 27 years of Fitts' law research in HCI. IJHCS, 61(6), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Thompson, D. (ed) 1996. Concise Oxford Dictionary. 9th edition.",
      "doi": ""
    },
    {
      "text": "Voida, A. and Mynatt, E.D. 2005. Conveying user values between families and designers. CHI 2005 Extended Abstracts, ACM, 2013--2016.  ",
      "doi": "10.1145/1056808.1057080"
    }
  ]
}