{
  "doi": "10.1145/1518701.1518971",
  "title": "Comparing semiliterate and illiterate users' ability to transition from audio+text to text-only interaction",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1751-1760",
  "year": 2009,
  "badges": [],
  "abstract": "Multimodal interfaces with little or no text have been shown to be useful for users with low literacy. However, this research has not differentiated between the needs of the fully illiterate and semiliterate - those who have basic literacy but cannot read and write fluently. Text offers a fast and unambiguous mode of interaction for literate users and the exposure to text may allow for incidental improvement of reading skills. We conducted two studies that explore how semiliterate users with very little education might benefit from a combination of text and audio as compared to illiterate and literate users. Results show that semiliterate users reduced their use of audio support even during the first hour of use and over several hours this reduction was accompanied by a gain in visual word recognition; illiterate users showed no similar improvement. Semiliterate users should thus be treated differently from illiterate users in interface design.",
  "tags": [
    "ict4d",
    "development",
    "inclusive design",
    "semiliteracy",
    "accessibility",
    "literacy"
  ],
  "authors": [
    {
      "name": "Leah Findlater",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Alvarez, J.M.M. Trust building user generated interfaces for illiterate people. In Proc. IUI4DR 2008, (2008), 38--42.",
      "doi": ""
    },
    {
      "text": "Barr, R., Pearson, P.D., Kamil, M.L., Mosenthal, P.B. (Eds.). Handbook of Reading Research: Volume II. Lawrence Erlbaum, 1996.",
      "doi": ""
    },
    {
      "text": "Blake, E.H., Steventon, L., Edge, J., Foster, A. A field computer for animal trackers. In Proc. CHI-SA 2001, (2001). Retrieved January 15, 2008, from www.chi-sa.org.za/CHI-SA2001/cyber-tracker.pdf  ",
      "doi": "10.1145/506443.506466"
    },
    {
      "text": "Brett, P. Using multimedia: A descriptive investigation of incidental language learning. Computer Assisted Language Learning 11, 2(1998), 179--200.",
      "doi": ""
    },
    {
      "text": "Brewer, E., Demmer, M., Ho, M., Honicky, R.J., Pal, J., Plauché, M., Sonesh, S. The challenges of IT research for developing regions. IEEE Transactions 5, 2(2006), 15--23.  ",
      "doi": "10.1109/MPRV.2006.40"
    },
    {
      "text": "Census of India - India at a glance: Number of literates&amp;literacy rates. Retrieved April 30, 2008, from http://www.censusindia.gov.in/Census_Data_2001/India_at_glance/literates1.aspx",
      "doi": ""
    },
    {
      "text": "Central Intelligence Agency. The World Factbook. Retrieved May 7, 2008 from https://www.cia.gov/library/publications/the-world-factbook/geos/xx.html",
      "doi": ""
    },
    {
      "text": "Chall, J. Learning to read: The great debate. New York: McGraw-Hill. 1983.",
      "doi": ""
    },
    {
      "text": "Danan, M. Reversed subtitling and dual coding theory: New directions for foreign language instruction. Language Learning 42, 4(2006), 497--527.",
      "doi": ""
    },
    {
      "text": "Dhakhwa, S., Hall, P.A.V., Ghimire, G.B., Manandhar, P., Thapa, I. Sambad - Computer interfaces for non-literates. In Proc. HCII 2007, (2007), 721--730. ",
      "doi": "10.5555/1772490.1772572"
    },
    {
      "text": "Freedom Scientific. JAWS for Windows Overview. Retrieved September 2, 2008, from http://www.freedomscientific.com/fs_products/software_jaws.asp",
      "doi": ""
    },
    {
      "text": "Grisedale, S., Graves, M., Grunsteidl, A. Designing a graphical user interface for healthcare workers in rural India. In Proc. CHI '97, (1997), 471--478.  ",
      "doi": "10.1145/258549.258869"
    },
    {
      "text": "Hiebert, E.H., Kamil, M.L. (Eds.). Teaching and Learning Vocabulary. Lawrence Erlbaum, 2005.",
      "doi": ""
    },
    {
      "text": "Kothari, B., Takeda, J., Joshi, A., Pandey, A. Same language subtitling: A butterfly for literacy? International Journal of Lifelong Education 21, 1(2002), 55--66.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Prasad, A., Toyama, K. Optimal audio-visual representations for illiterate users of computers. In Proc. WWW 2007, (2007), 873--882.  ",
      "doi": "10.1145/1242572.1242690"
    },
    {
      "text": "Medhi, I., Sagar, A., Toyama, K. Text-free user interfaces for illiterate and semiliterate users. In Proc. ICTD 2006, (2006), 72--82.",
      "doi": ""
    },
    {
      "text": "Moffatt, K., McGrenere, J., Purves, B., Klawe, M. The participatory design of a sound and image enhanced daily planner for people with aphasia. In Proc. CHI 2004, (2004), 407--414.  ",
      "doi": "10.1145/985692.985744"
    },
    {
      "text": "Languages spoken by more than 10 million people. MSN Encarta. Retrieved September 1, 2008, from http://encarta.msn.com/media_701500404/Languages_Spoken_by_More_Than_10_Million_People.html",
      "doi": ""
    },
    {
      "text": "Nag, S. Early reading in Kannada: The pace of acquisition of orthographic knowledge and phonemic awareness. Journal of Research in Reading 30, 1(2007), 7--22.",
      "doi": ""
    },
    {
      "text": "Parikh, T., Ghosh, K., Chavan, A. Design studies for a financial management system for micro-credit groups in rural India. In Proc. CUU 2003, (2003), 15--22.  ",
      "doi": "10.1145/957205.957209"
    },
    {
      "text": "Parikh, T., Javid, P., Kumar, S., Ghosh, K., Toyama, K. Mobile phones and paper documents: Evaluating a new approach for capturing microfinance data in rural India. In Proc. CHI 2006, (2006), 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Plauché, M., Prabaker, M. Tamil market: A spoken dialog system for rural India. In CHI Extended Abstracts 2006, (2006), 1619--1624.  ",
      "doi": "10.1145/1125451.1125746"
    },
    {
      "text": "Prasad, A., Medhi, I., Toyama, K., Balakrishnan, R. Exploring the feasibility of video mail for illiterate users. In Proc. AVI 2008, (2008), 103--110.  ",
      "doi": "10.1145/1385569.1385588"
    },
    {
      "text": "Shakeel, H., Best, M.L. Community Knowledge Sharing: An internet application to support communications across literacy levels. In Proc. Technology and Society, (2002), 37--44.",
      "doi": ""
    },
    {
      "text": "Sherwani, J., Ali, N., Mirza, S., Fatma, A., Memom, Y., Karim, M., Tongia, R., Rosefeld, R. HealthLine: Speech-based access to health information by low-literate users. In Proc. ICTD 2007, (2007).",
      "doi": ""
    },
    {
      "text": "Sin, M., Escobedo, M., Best, M. A directory service for multi-literate users. In Proc. ICME 2004, (2004), 1295--1298.",
      "doi": ""
    }
  ]
}