{
  "doi": "10.1145/1518701.1518806",
  "title": "Cultural difference and adaptation of communication styles in computer-mediated group brainstorming",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "669-678",
  "year": 2009,
  "badges": [],
  "abstract": "Supporting creativity via collaborative group brainstorming is a prevalent practice in organizations. Today's technology makes it easy for international and intercultural group members to brainstorm together remotely, but surprisingly little is known about how culture and medium shape the underlying brainstorming process. In a laboratory study, we examined the influences of individual cultural background (American versus Chinese), group cultural composition (same- versus mixed-culture groups), and communication medium (text-only versus video-enabled chatrooms) on group brainstorming conversations. Cultural differences and adaptation in conversational talkativeness and responsiveness were identified. The text-only medium reduced cultural differences in talkativeness. Working in a mixed-culture group led to cultural adaptation in the communication style of Chinese but not American participants. We discuss implications for international group brainstorming.",
  "authors": [
    {
      "name": "Hao-Chuan Wang",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81553656356/rel-imgonly/14188307_10154380982350185_145248478587239185_o.jpg",
      "acmid": "81553656356",
      "orcid": "missing"
    },
    {
      "name": "Susan F. Fussell",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    },
    {
      "name": "Leslie D. Setlock",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057970",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amabile, T. (1983). The social psychology of creativity: A componential conceptualization. Journal of Personality and Social Psychology, 45, 357--376.",
      "doi": ""
    },
    {
      "text": "Blot, K. J., Zarate, M. A., Paulus, P. B. (2003). Code-switching across brainstorming sessions: implications for the revised hierarchical model of bilingual language processing. Experimental Psychology, 50(3), 171--183.",
      "doi": ""
    },
    {
      "text": "Bond, M. H. (2003). Cross-cultural social psychology and the real world of culturally diverse teams and dyads. In D. Tjosvold,&amp;K. Leung (Eds.). Cross-cultural management: Foundations and future. Burlington, VT: Ashgate Publishing Company.",
      "doi": ""
    },
    {
      "text": "Carletta, J., Isard, A., Isard, S., Kowtko, J. C., Doherty-Sneddon, G., Anderson, A. H. (1997). The reliability of a dialogue structure coding scheme. Computational Linguistics, 23, 13--31. ",
      "doi": "10.5555/972684.972686"
    },
    {
      "text": "Clark, H. H.,&amp;Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, J. M. Levine,&amp;S. D. Teasley (Eds.), Perspectives on socially shared cognition (pp. 127--149). Washington, DC: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Cheng, C-Y., Lee, F.,&amp;Benet-Martinez, V. (2006). Assimilation and contrast effects in cultural frame switching: Bicultural identity integration and valence of cultural values. Journal of Cross-Cultural Psychology, 37, 742--760.",
      "doi": ""
    },
    {
      "text": "Chua, H. F., Boland, J. E.,&amp;Nisbett, R. E. (2005). Cultural variation in eye movements during scene perception. Proceedings of the National Academy of Sciences, 102, 12629-- 12633.",
      "doi": ""
    },
    {
      "text": "Connolly, T., Jessup, L. M., Valacich, J. S. (1988). Effects of anonymity and evaluative tone on idea generation in computer-mediated groups. Management Science, 36, 689--703.  ",
      "doi": "10.5555/3217795.3217799"
    },
    {
      "text": "Connolly, T. (1993). Behavioral decision theory and group support systems. (pp.270--280). In L. Jessup&amp;J. Valacich (Eds.). Group support systems. NY: Macmillan.",
      "doi": ""
    },
    {
      "text": "Daft, R. L.,&amp;Lengel, R. H. (1986). Organizational information requirement, media richness and structural design. Management Science, 32. 554--571.  ",
      "doi": "10.1287/mnsc.32.5.554"
    },
    {
      "text": "Dennis, A. R.,&amp;Valacich, J. S. (1999). Rethinking media richness: Toward a theory of media synchronicity. Proceedings of HICSS 1999. ",
      "doi": "10.5555/874068.875924"
    },
    {
      "text": "Diamant, E. I., Fussell, S. R.&amp;Lo, F-L. (in press). \"Where did we turn wrong?\" Unpacking the effects of culture and technology on attributions of team performance. Proceedings of CSCW 2008. NY: ACM Press.  ",
      "doi": "10.1145/1460563.1460625"
    },
    {
      "text": "Diehl, M.,&amp;Stroebe, W. (1987). Productivity loss in brainstorming groups: toward the solution of a riddle. Journal of Personality and Social Psychology, 53, 497--509.",
      "doi": ""
    },
    {
      "text": "Diehl, M.,&amp;Stroebe, W. (1991). Productivity loss in idea-generating groups: Tracking down the blocking effect. Journal of Personality and Social Psychology, 61, 392--403.",
      "doi": ""
    },
    {
      "text": "DiMicco, J. M., Pandolfo, A.,&amp;Bender, W. (2004). Influencing group participation with a shared display. Proceedings of CSCW'04.  ",
      "doi": "10.1145/1031607.1031713"
    },
    {
      "text": "Dugosh, K. L.,&amp;Paulus, P. B. (2005). Cognitive and social comparison processes in brainstorming. Journal of Experimental Social Psychology, 41, 313--320.",
      "doi": ""
    },
    {
      "text": "Gallupe, R. B., Dennis, A. R., Cooper, W. H., Valacich, J. S., Bastianutti, L. M.m&amp;Nunamaker, J F. (1992). Electronic brainstorming and group size. Academy of Management Journal, 35, 350--369.",
      "doi": ""
    },
    {
      "text": "Geen, R. G. (1991). Social motivation. Annual Review of Psychology, 42, 377--399.",
      "doi": ""
    },
    {
      "text": "Giles, H., Coupland, J.,&amp;Coupland, N. (1991). Contexts of Accommodation. New York, NY: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Gudykunst, W. B., Matusmoto, Y., Ting-Toomey, S., Nishida, T., Kim, K.,&amp;Heyman, S. (1996). The influence of cultural individualism-collectivism, self-construals, and individual values on communication styles across cultures. Human Communication Research, 22, 510--543.",
      "doi": ""
    },
    {
      "text": "Hall, E. (1976). Beyond Culture. New York, NY: Doubleday/Anchor Books.",
      "doi": ""
    },
    {
      "text": "Hofstede, G. (1983). Dimensions of national cultures in fifty countries and three regions. In J. Deregowski, S. Dzuirawiec&amp;R. Annis (Eds.), Explications in Cross-Cultural Psychology.",
      "doi": ""
    },
    {
      "text": "Hong, Y., Morris, M., Chiu, C.,&amp;Benet-Martinez, V. (2000). Multicultural minds: A dynamic constructivist approach to culture and cognition. American Psychologists, 55, 709--720.",
      "doi": ""
    },
    {
      "text": "Jackson, M. H.,&amp;Poole, M. S. (2003). Idea generation in naturally occurring contexts: complex appropriation of a simple group procedure. Human Communication Research, 29, 560--591.",
      "doi": ""
    },
    {
      "text": "Kenny, D. A., Mannetti, L., Pierro, A.,&amp;Livi, S. (2002). The statistical analysis of data from small groups. Journal of Personality and Social Psychology, 83, 126--137.",
      "doi": ""
    },
    {
      "text": "Kerr, D. S.,&amp;Murthy, U. S. (2004). Divergent and convergent idea generation in teams: A comparison of computer-mediated and face-to-face communication. Group Decision and Negotiation, 13, 381--399.",
      "doi": ""
    },
    {
      "text": "Leshed, G., Hancock, J.T., Cosley, D., McLeod, P.L.,&amp;Gay, G. (2007). Feedback for Guiding Reflection on Teamwork Practices. Proceedings of Group'07.  ",
      "doi": "10.1145/1316624.1316655"
    },
    {
      "text": "Levine, J. M.,&amp;Moreland, R. L. (1990). Progress in small group research. Annual Review of Psychology, 41, 585--634.",
      "doi": ""
    },
    {
      "text": "Li, H. Z., (1999). Grounding and information communication in intercultural and intracultural dyadic discourse. Discourse Processes, 28, 195--215.",
      "doi": ""
    },
    {
      "text": "Littell, R., Milliken, G. A., Stroup, W. W.,&amp;Wolfinger, R. D. (1996). SAS system for mixed models. Cary, NC: SAS Institute.",
      "doi": ""
    },
    {
      "text": "Masuda, T.,&amp;Nisbett, R. E. (2001). Attending holistically versus analytically: Comparing the context sensitivity of Japanese and Americans. Journal of Personality and Social Psychology, 81, 922--934.",
      "doi": ""
    },
    {
      "text": "Masuda, T., Ellsworth, P. C., Mesquita, B., Leu, J., Tanida, S.,&amp;van de Veerdonk, E. (2008). Placing the face in context: Cultural differences in the perception of facial emotion. Journal of Personality and Social Psychology, 94, 365--381.",
      "doi": ""
    },
    {
      "text": "Nemeth, C. J., Personnaz, B., Personnaz, M.,&amp;Goncalo, J. (2004). The liberating role of conflict in group creativity: A study in two countries. European Journal of Social Psychology, 34, 365--374.",
      "doi": ""
    },
    {
      "text": "Nijstad, B. A.,&amp;Stroebe, W. (2006). How the group affects the mind: a cognitive model of idea generation in groups. Personality and Social Psychology Review, 10, 186--213.",
      "doi": ""
    },
    {
      "text": "Nisbett, R. E., Peng, K., Choi, I., Norenzayan, A. (2001). Culture and systems of thought: holistic versus analytic cognition. Psychological Review, 108(2), 291--310.",
      "doi": ""
    },
    {
      "text": "Osborn, A. F. (1957). Applied imagination. New York: Scribner.",
      "doi": ""
    },
    {
      "text": "Paulus, P.B. Larey, T.S., Putman, V.L., Legget, K. L.,&amp;Roland, E. J. (1996). Social influence processes in computer brainstorming, Basic and Applied Social Psychology, 18, 3--14.",
      "doi": ""
    },
    {
      "text": "Setlock, L. D., Fussell, S. R.,&amp;Neuwirth. C. (2004). Taking it out of context: collaborating within and across cultures in face-to-face settings and via instant messaging. Proceedings of CSCW 2004 (pp. 604--613), NY: ACM Press.  ",
      "doi": "10.1145/1031607.1031712"
    },
    {
      "text": "Setlock, L. D., Fussell, S. R.,&amp;Shih, Y. Y. (2006). Effects of culture, language and communication medium on conversational grounding. Annual Meeting of the Society for Text and Discourse, Minneapolis, MN.",
      "doi": ""
    },
    {
      "text": "Setlock, L. D., Quinones, P. A.,&amp;Fussell, S. R. (2007). Does culture interact with media richness? The effects of audio vs. video conferencing on Chinese and American dyads. Proceedings of HICSS 2007.  ",
      "doi": "10.1109/HICSS.2007.182"
    },
    {
      "text": "Short, J. A., Williams, E.,&amp;Christie, B. (1976). The social psychology of telecommunications. NY: Wiley.",
      "doi": ""
    },
    {
      "text": "Spears, R., Lea, M.&amp;Postmes, T. (2001) Social psychological theories of computer-mediated communication: Social pain or social gain. In W. P. Robinson and H. Giles (Eds.) The New Handbook of Language and Social Psychology (pp. 601--623). Chichester: John Wiley&amp;Sons, Ltd.",
      "doi": ""
    },
    {
      "text": "Sproull, L.,&amp;Kiesler, S. (1986). Reducing social context cues: Electronic main in organizational communications. Management Science, 32, 1492--1512.  ",
      "doi": "10.5555/8419.8428"
    },
    {
      "text": "Triandis, H. C. (1995). Individualism and Collectivism. Boulder, CO: Westview.",
      "doi": ""
    },
    {
      "text": "Veinott, E., Olson, J., Olson, G.,&amp;Fu, X. (1999). Video helps remote work: Speakers who need to negotiate common ground benefit from seeing each other. In Proceedings of CHI 1999 (pp. 302--309). NY: ACM Press.  ",
      "doi": "10.1145/302979.303067"
    }
  ]
}