{
  "doi": "10.1145/1518701.1518745",
  "title": "It's not that important: demoting personal information of low subjective importance using GrayArea",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "269-278",
  "year": 2009,
  "badges": [],
  "abstract": "Users find it hard to delete unimportant personal information which often results in cluttered workspaces. We present a full design cycle for GrayArea, a novel interface that allows users to demote unimportant files by dragging them to a gray area at the bottom of their file folders. Demotion is an intermediate option between keeping and deleting. It combines the advantages of deletion (unimportant files don't compete for attention) and keeping (files are retrieved in their folder context). We developed the GrayArea working prototype using thorough iterative design. We evaluated it by asking 96 participants to 'clean' two folders with, and without, GrayArea. Using GrayArea reduced folder clutter by 13%. Further, 81% of participants found it easier to demote than delete files, and most indicated they would use GrayArea if provided in their operating systems. The results provide strong evidence for the demotion principle suggested by the user-subjective approach.",
  "tags": [
    "demotion",
    "user-subjective",
    "subjective importance",
    "personal information management",
    "files"
  ],
  "authors": [
    {
      "name": "Ofer Bergman",
      "institution": "Sheffield University, Sheffield, United Kingdom",
      "img": "/do/10.1145/contrib-81100245005/rel-imgonly/ofer.jpg",
      "acmid": "81100245005",
      "orcid": "missing"
    },
    {
      "name": "Simon Tucker",
      "institution": "Sheffield University, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343507374",
      "orcid": "missing"
    },
    {
      "name": "Ruth Beyth-Marom",
      "institution": "The Open University of Israel, Raanana, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469637",
      "orcid": "missing"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Steve Whittaker",
      "institution": "Sheffield University, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrams, D., Baecker, R. and Chignell, M. Information archiving with bookmarks: Personal web space construction and organization. In Proceedings of the sigchi conference on human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., (1998), 41--48.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Barreau, D. K. Context as a factor in personal information management systems. Journal of the American Society for Information Science 46 5(1995), 327--339.  ",
      "doi": "10.5555/208107.208108"
    },
    {
      "text": "Barreau, D. K. and Nardi, B. A. Finding and reminding: File organization from the desktop. SIGCHI Bulletin 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., MarkHoward, Smith, I. and Grinter, R. E. Quality versus quantity: E-mail-centric task management and its relation with overload. Human Computer Interaction 20 (2005), 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Bellotti, V. and Smith, I. Informing the design of an information management system with iterative fieldwork In Proceedings of the conference on designing interactive systems: Processes, practices, methods, and techniques ACM Press, (2000), 227--237.  ",
      "doi": "10.1145/347642.347728"
    },
    {
      "text": "Bergman, O. The use of subjective attributes in personal information management systems. Ph.D. Dissertation (in Hebrew), Tel Aviv University, Tel Aviv, Israel, 2006.",
      "doi": ""
    },
    {
      "text": "Bergman, O., Beyth-Marom, R. and Nachmias, R. The user-subjective approach to personal information management systems. Journal of the American Society for Information Science and Technology 54, 9 (2003), 872--878.  ",
      "doi": "10.1002/asi.10283"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R. and Nachmias, R. The user-subjective approach to personal information management systems design - evidence and implementations. Journal of the American Society for Information Science and Technology 59, 2 (2008), 235--246.  ",
      "doi": "10.5555/1331268.1331273"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R., Nachmias, R., Gradovitch, N. and Whittaker, S. Advanced search engines and navigation preference in personal information management. ACM Transactions on Information Systems 26, 4 (2008), 1--24.  ",
      "doi": "10.1145/1402256.1402259"
    },
    {
      "text": "Bergman, O., Boardman, R., Gwizdka, J. and Jones, W. P. Personal information management. In Chi '04 extended abstracts on human factors in computing systems. ACM Press, (2004), 1598--1599.  ",
      "doi": "10.1145/985921.986164"
    },
    {
      "text": "Boardman, R. Improving tool support for personal information management. Ph.D., Imperial College, London, 2004.",
      "doi": ""
    },
    {
      "text": "Boardman, R. and Sasse, M. A. \"Stuff goes into the computer and doesn't come out\": A cross-tool study of personal information management In Proceedings of the Sigchi conference on human factors in computing systems. ACM Press, (2004), 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Bruce, H. Personal anticipated information need. Information Research 10, 3 (2005).",
      "doi": ""
    },
    {
      "text": "Cutrell, E., Dumais, S. T. and Teevan, J. Searching to eliminate personal information management. Communications of the ACM 49, 1 (2006), 58--64.  ",
      "doi": "10.1145/1107458.1107492"
    },
    {
      "text": "Freeman, E. and Gelernter, D. Lifestreams: A storage model for personal data. SIGMOD Record 25, 1 (1996), 80--86.  ",
      "doi": "10.1145/381854.381893"
    },
    {
      "text": "Gemmell, J., Bell, G., Lueder, R., Drucker, S. and Wong, C. Mylifebits: Fulfilling the memex vision. In Proceedings of the Proceedings of the tenth ACM international conference on Multimedia. ACM, Juan-les-Pins, France, 2002.  ",
      "doi": "10.1145/641007.641053"
    },
    {
      "text": "Harper, R., Rodden, T., Roggers, Y. and Sellen, A. Being human: Hci in 2020. Microsoft, Cambridge, UK, 2008.",
      "doi": ""
    },
    {
      "text": "Jones, W., Phuwanartnurak, A. J., Gill, R. and Bruce, H. Don't take my folders away! Organizing personal information to get things done. In Chi '05 extended abstracts on human factors in computing systems. ACM Press, (2005)  ",
      "doi": "10.1145/1056808.1056952"
    },
    {
      "text": "Jones, W. and Teevan, J. Personal information management. University of Washington Press, 2007.",
      "doi": ""
    },
    {
      "text": "Jones, W. P. Finders, keepers? The present and future perfect in support of personal information management. First Monday 9, 3 (2004).",
      "doi": ""
    },
    {
      "text": "Kahneman, D. and Tversky, A. Prospect theory: An analysis of decision making under risk. Eugene, Ore., 1979.",
      "doi": ""
    },
    {
      "text": "Kirk, D., Sellen, A., Rother, C. and Wood, K. Understanding photowork. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, Montreal, 2006.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Malone T. W. How do people organize their desks? Implications for the design of office information systems. ACM Trans. Office Inf. Syst. 1, (1983), 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Neisser, U. Visual search. Scientific American 210, 6 (1964), 94--102.",
      "doi": ""
    },
    {
      "text": "Sharp, H., Rogers, Y. and Preece, J. Interaction design: Beyond human-computer interaction. John Wiley&amp;Sons, 2007. ",
      "doi": "10.5555/1215597"
    },
    {
      "text": "Shneiderman, B. Designing the user interface: Strategies for effective human-computer interaction. Addison-Wesley Longman Publishing Co., Inc., 1997. ",
      "doi": "10.5555/523237"
    },
    {
      "text": "Treisman, A. and Gelade, G. A feature-integration theory of attention. Cognitive Psychology 12 (1980), 97--136.",
      "doi": ""
    },
    {
      "text": "Whittaker, S. Supporting collaborative task management in email. Human Computer Interaction 20, 49--88 (2005).  ",
      "doi": "10.1207/s15327051hci2001%25262_3"
    },
    {
      "text": "Whittaker, S. and Hirschberg, J. The character, value, and management of personal paper archives. ACM Transactions on Computer-Human Interaction 8, 2 (2001), 150--170.  ",
      "doi": "10.1145/376929.376932"
    },
    {
      "text": "Whittaker, S., Jones, Q. and Terveen, L. Contact management: Identifying contacts to support long term communication, CSCW 2002, New York, ACM Press.  ",
      "doi": "10.1145/587078.587109"
    },
    {
      "text": "Whittaker, S. and Sidner, C. Email overload: Exploring personal information management of email. In Proceedings of the sigchi conference on human factors in computing systems: Common ground. ACM Press, (1996), 276--283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}