{
  "doi": "10.1145/1518701.1518772",
  "title": "NewsCube: delivering multiple aspects of news to mitigate media bias",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "443-452",
  "year": 2009,
  "badges": [],
  "abstract": "The bias in the news media is an inherent flaw of the news production process. The resulting bias often causes a sharp increase in political polarization and in the cost of conflict on social issues such as Iraq war. It is very difficult, if not impossible, for readers to have penetrating views on realities against such bias. This paper presents NewsCube, a novel Internet news service aiming at mitigating the effect of media bias. NewsCube automatically creates and promptly provides readers with multiple classified viewpoints on a news event of interest. As such, it effectively helps readers understand a fact from a plural of viewpoints and formulate their own, more balanced viewpoints. While media bias problem has been studied extensively in communications and social sciences, our work is the first to develop a news service as a solution and study its effect. We discuss the effect of the service through various user studies.",
  "authors": [
    {
      "name": "Souneil Park",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361601767",
      "orcid": "missing"
    },
    {
      "name": "Seungwoo Kang",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361601885",
      "orcid": "missing"
    },
    {
      "name": "Sangyoung Chung",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416599644",
      "orcid": "missing"
    },
    {
      "name": "Junehwa Song",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452597488",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allan, J., et al. Topic Detection and Tracking Pilot Study: Final Report. In Proceedings of DARPA Broadcast News Transcription and Understanding Workshop, 1998.",
      "doi": ""
    },
    {
      "text": "Baker, B. How to Identify, Expose and Correct Liberal Media Bias. Media Research Center, 1994.",
      "doi": ""
    },
    {
      "text": "Baron, D. P. Persistent Media Bias. Stanford University, Graduate School of Business Research Papers: No. 1845, 2004.",
      "doi": ""
    },
    {
      "text": "Bernhardt, D., et al. Political Polarization and the Electoral Effects of Media Bias. CESifo Working Paper Series No. 1798.",
      "doi": ""
    },
    {
      "text": "Chen, Y., et al. Detecting Web Page Structure for Adaptive Viewing on Small Form Factor Devices. In Proc. of World Wide Web, 2003.  ",
      "doi": "10.1145/775152.775184"
    },
    {
      "text": "Entman R.M. Framing: Toward Clarification of a Fractured Paradigm. Journal of Communication 43 (4): 51--8, 1993.",
      "doi": ""
    },
    {
      "text": "Gamon, Michael., et al. BLEWS: Using Blogs to Provide Context for News Articles. In Proc. of the ICWSM, 2008.",
      "doi": ""
    },
    {
      "text": "Gentzkow, M. and Shapiro, J. M. What drives media slant?: Evidence from U.S. daily newspapers (No. Working Paper No. 12707). Cambridge, MA: National Bureau of Economic Researcher, 2006.",
      "doi": ""
    },
    {
      "text": "Gerber, A., et al. Does the Media Matter? A Field Experiment Measuring the Effect of Newspapers on Voting Behavior and Political Opinions. Yale Economic Applications and Policy Discussion Paper No. 12.",
      "doi": ""
    },
    {
      "text": "Groseclose, T. and Milyo, J. A measure of media bias. Quarterly Journal of Economics, Vol. 120, Issue 4, 1191 -- 1237, 2005.",
      "doi": ""
    },
    {
      "text": "Herman, E.S. et al. Manufacturing Consent: the Political Economy of the Mass Media. New York: Pantheon Books, 1988.",
      "doi": ""
    },
    {
      "text": "Herman, E. S. The Propaganda Model: A Retrospective. Against All Reason, 1: 1--14, 2003.",
      "doi": ""
    },
    {
      "text": "Kittur, A. et al. He says, she says: Conflict and coordination in Wikipedia. In Proc. of CHI. 2007  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Kull, S., C. Ramsey and E. Lewis. Misperceptions, the media, and the Iraq War. Political Science Quarterly 118(4): 569--598, 2003.",
      "doi": ""
    },
    {
      "text": "Mark S. Aldenderfer and Roger K. Blashfield. Cluster Analysis. SAGE Publications Inc., 1984.",
      "doi": ""
    },
    {
      "text": "McChesney, R. W. Theses on media deregulation. Media, Culture, and Society, 25, 2003, 125--133.",
      "doi": ""
    },
    {
      "text": "Radev, D. R. et al. NewsInEssence: Summarizing Online News Topics. CACM Vol. 48, No. 10, 2005.  ",
      "doi": "10.1145/1089107.1089111"
    },
    {
      "text": "Rhee, J. W. Framing the Health Care Reform Campaign of 1993-94: News Frame, Interpretation, and Public Opinion Change. Political Communication, vol. 15: 274--76. 1998.",
      "doi": ""
    },
    {
      "text": "Sebastiani, F. Machine learning in automated text categorization. ACM Computing. Survey: 1--47, 2002.  ",
      "doi": "10.1145/505282.505283"
    },
    {
      "text": "Son, S.C. The Revolution of News Reading. Kaemagowon, 2006 (in Korean).",
      "doi": ""
    },
    {
      "text": "Michael Steinbach, et al. A Comparison of Document Clustering Techniques. Univ. of Minnesota, Technical Report #00-034, 2000.",
      "doi": ""
    },
    {
      "text": "Strassel, S. et al. Quality Control in Large Annotation Projects Involving Multiple Judges: The Case of the TDT Corpora. In Proc. of LREC, 2000.",
      "doi": ""
    },
    {
      "text": "Tankard, James W. The Empirical Approach to the Study of Media Framing. In Framing Public Life: Perspectives on Media and our Understanding of the Social World. Stephen D Reese, Oscar H Gandy, and August E Grant. Mahwah, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Urban. C. Examining Our Credibility: Perspectives of the Public and the Press. American Society of Newspaper Editors, 1999.",
      "doi": ""
    },
    {
      "text": "Xiaojun Wan, et al. CollabSum: Exploiting Multiple Document Clustering for Collaborative Single Document Summarization. In Proc. of SIGIR, 2007.  ",
      "doi": "10.1145/1277741.1277768"
    },
    {
      "text": "http://www.ohmynews.com",
      "doi": ""
    }
  ]
}