{
  "doi": "10.1145/1518701.1519031",
  "title": "Mobile media in the social fabric of a kindergarten",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2167-2176",
  "year": 2009,
  "badges": [],
  "abstract": "At first blush, mobile media may appear a promising solution to the problem arising from the fact that parents in the present-day kindergarten institution rely almost solely on teachers' retrospective reports on their child's daily activities. However, a kindergarten is a delicate social fabric that mixes professional roles (the teachers') with socio-emotional relationships (parenting and caring) and involves stakeholders who are dependent on adults in the use of technology (the children). To date, no studies have been reported that critically examine the boundary conditions for successful mobile media applications in such settings. We present a study of Meaning, a one-button capture-and-push-to-Web solution that was used by a Finnish kindergarten for a month. Interviews and the amount of media sent suggest that the intervention was a success, and we report on seven uses of media. However, all uses were critically affected by the users' social fabric, in which the teachers were the nexus. We conclude by discussing various ways in which the heterogeneity of the user group affected mobile media use.",
  "tags": [
    "kindergarten",
    "power",
    "mobile media",
    "intervention"
  ],
  "authors": [
    {
      "name": "Jaana Näsänen",
      "institution": "Helsinki Institute for Information Technology (HIIT), Helsinki University of Technology TKK and University of Helsinki, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608530",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Helsinki Institute for Information Technology (HIIT), Helsinki University of Technology TKK and University of Helsinki, Espoo, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Asko Lehmuskallio",
      "institution": "Helsinki Institute for Information Technology (HIIT), Helsinki University of Technology TKK and University of Helsinki, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606388",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bansler, J. P., and Havn, E. Sensemaking in technology-use mediation: adapting groupware technology in organizations. Computer Supported Cooperative Work, 15, 1 (2006), 55 -- 91.  ",
      "doi": "10.1007/s10606-005-9012-x"
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: eight challenges for developers. Communications of the ACM, 3, 1(1994), 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Grudin, J. and Markus, M.L. Organizational Issues in Development and Implementation of Interactive Systems. G. M. Helander, T. K. Landauer, and P. V. Prabhu (eds.): Handbook of Human-Computer Interaction. Elsevier, (1997), 1457--1474.",
      "doi": ""
    },
    {
      "text": "Hayes, G. R. and Abowd, G. D. Tension in Designing Capture Technologies for an Evidence-Based Care Community. Proc. CHI 2006. ACM Press (2006), 937--946.  ",
      "doi": "10.1145/1124772.1124911"
    },
    {
      "text": "Jacucci, G., Oulasvirta, A., Ilmonen T., Evans, J. and Salovaara, A. CoMedia: Mobile group media for active spectatorship. Proc. CHI 2007, ACM Press (2007), 1273--1282.  ",
      "doi": "10.1145/1240624.1240817"
    },
    {
      "text": "Jørgensen, V. The Apple of the Eye. Parents' Use of Webcams in a Danish Day Nursery. Surveillance&amp;Society 2, 2-3 (2004), 446--463.",
      "doi": ""
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R. and Sellen, A. The ubiquitous camera: an in-depth study of cell phone Use. IEEE Pervasive Computing 4, 2 (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Laki lasten päivähoidosta. Suomen säädöskokoelma {Law of Child Care, Statutes of Finland} (1973), §36.",
      "doi": ""
    },
    {
      "text": "Mäkelä, A., Giller, V., Tschelig, M. and Sefelin, R. Joking, Storytelling, Artsharing, Expressing affection: a field trial of how children and their social network communicate with digital images in leisure time. Proc. CHI 2000. ACM Press, 548--555.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "Orlikowski, W. J. The duality of technology: rethinking the concept of technology in organizations. Organization Science, 3, 3 (1992), 398--427.",
      "doi": "10.1287/orsc.3.3.398"
    },
    {
      "text": "Raento, M., Oulasvirta, A., Petit, R. and Toivonen, H. ContextPhone: A prototyping platform for context-aware mobile applications. IEEE Pervasive Computing 4, 2 (2005), 51--59.  ",
      "doi": "10.1109/MPRV.2005.29"
    },
    {
      "text": "Salovaara, A., Jacucci, G., Oulasvirta, A., Saari, T., Kanerva, P., Kurvinen, E., and Tiitta, S. Collective creation and sense-making of mobile media. Proc. CHI 2006 ACM Press (2006) 1211--1220.  ",
      "doi": "10.1145/1124772.1124954"
    },
    {
      "text": "Salovaara, A. Appropriation of a mms-based comic creator. Proc. CHI 2007. ACM Press (2007), 1117--1126.  ",
      "doi": "10.1145/1240624.1240794"
    },
    {
      "text": "Sarvas, R., Oulasvirta, A. and Jacucci, G. Building social discourse around mobile photos-a systemic perspective. Proc. MobileHCI 2005. ACM Press (2005), 31--38.  ",
      "doi": "10.1145/1085777.1085783"
    },
    {
      "text": "Sellen, A., Fogg, A., Aitken, M., Hodges, S., Rother, C., and Wood, K. Do life-logging technologies support memory for the past? An experimental study using SenseCam. Proc. CHI 2007. ACM Press (2007), 81--90.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Tietze, W., Hundertmark-Mayser, J. and Rossbach, H.-G. European child care and education study group: school-age assessment of child development: long-term impact of pre-school experiences on school success, and family-school relationships. European Union DG XII: Science, Research and Development (1999).",
      "doi": ""
    },
    {
      "text": "Van House, N., Davis, M., Ames, M., Finn, M. and Viswanathan, V. The uses of personal networked digital imaging: an empirical study of cameraphone photos and sharing. Ext. Abstracts CHI 2005, ACM Press (2005), 1853--1856.  ",
      "doi": "10.1145/1056808.1057039"
    }
  ]
}