{
  "doi": "10.1145/1518701.1519052",
  "title": "Using strokes as command shortcuts: cognitive benefits and toolkit support",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2289-2298",
  "year": 2009,
  "badges": [],
  "abstract": "This paper investigates using stroke gestures as shortcuts to menu selection. We first experimentally measured the performance and ease of learning of stroke shortcuts in comparison to keyboard shortcuts when there is no mnemonic link between the shortcut and the command. While both types of shortcuts had the same level of performance with enough practice, stroke shortcuts had substantial cognitive advantages in learning and recall. With the same amount of practice, users could successfully recall more shortcuts and make fewer errors with stroke shortcuts than with keyboard shortcuts. The second half of the paper focuses on UI development support and articulates guidelines for toolkits to implement stroke shortcuts in a wide range of software applications. We illustrate how to apply these guidelines by introducing the Stroke Shortcuts Toolkit (SST) which is a library for adding stroke shortcuts to Java Swing applications with just a few lines of code.",
  "authors": [
    {
      "name": "Caroline Appert",
      "institution": "LRI - Université Paris-Sud & CNRS, Paris, France",
      "img": "/do/10.1145/contrib-81311484266/rel-imgonly/id-appert.jpg",
      "acmid": "81311484266",
      "orcid": "0000-0002-3050-9284"
    },
    {
      "name": "Shumin Zhai",
      "institution": "IBM Almaden Research Center, San Jose, USA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    }
  ],
  "references": [
    {
      "text": "O. Bau and W. E. Mackay. Octopocus: a dynamic guide for learning gesture-based command sets. In UIST '08: Proceedings of the 21st annual ACM symposium on User interface software and technology, 37--46, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "X. Cao and S. Zhai. Modeling human performance of pen stroke gestures. In CHI '07: Proc. ACM Conference on Human factors in computing systems, 1495--1504, 2007.  ",
      "doi": "10.1145/1240624.1240850"
    },
    {
      "text": "F. Craik and R. Lockhart. Levels of processing: A framework for memory research. Journal of Verbal Learning and Verbal Behavior, 11(6):671--684, 1972.",
      "doi": "10.1016/s0022-5371%2872%2980001-x"
    },
    {
      "text": "T. Grossman, P. Dragicevic, and R. Balakrishnan. Strategies for accelerating on-line learning of hotkeys. In CHI '07: Proc. ACM Conference on Human factors in computing systems, 1591--1600, 2007.  ",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "F. Guimbretière, A. Martin, and T. Winograd. Benefits of merging command selection and direct manipulation. ACM Trans. Comput.-Hum. Interact., 12(3):460--476, 2005.  ",
      "doi": "10.1145/1096737.1096742"
    },
    {
      "text": "K. Hinckley, S. Zhao, R. Sarin, P. Baudisch, E. Cutrell, M. Shilman, and D. Tan. Inkseine: In situ search for active note taking. In CHI '07: Proceedings of the SIGCHI conference on Human factors in computing systems, 251--260, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240666"
    },
    {
      "text": "J. Hong and J. Landay. Satin: a toolkit for informal ink-based applications. In UIST '00: Proc. ACM Symposium on User interface software and technology, 63--72, 2000.  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "P. Kabbash, W. Buxton, and A. Sellen. Two-handed input in a compound task. In CHI '94: Proc. ACM Conference on Human factors in computing systems, 417--423, 1994.  ",
      "doi": "10.1145/191666.191808"
    },
    {
      "text": "P.-O. Kristensson and S. Zhai. Shark2: a large vocabulary shorthand writing system for pen-based computers. In UIST '04: Proc. ACM symposium on User interface software and technology, 43--52, 2004.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "P.-O. Kristensson and S. Zhai. Command strokes with and without preview: using pen gestures on keyboard for command selection. In CHI '07: Proc. ACM Conference on Human factors in computing systems, 1137--1146, 2007.  ",
      "doi": "10.1145/1240624.1240797"
    },
    {
      "text": "G. Kurtenbach and W. Buxton. User learning and performance with marking menus. In CHI '94: Proc. ACM Conference on Human factors in computing systems, 258--264, 1994.  ",
      "doi": "10.1145/191666.191759"
    },
    {
      "text": "G. Kurtenbach, G. Fitzmaurice, R. Owen, and T. Baudel. The hotbox: efficient access to a large number of menu-items. In CHI '99: Proc. ACM Conference on Human factors in computing systems, 231--237, 1999.  ",
      "doi": "10.1145/302979.303047"
    },
    {
      "text": "G. Kurtenbach and T. Moran. Contextual animation of gestural commands. Eurographics Computer Graphics Forum, 13(5):305--314, 1994.",
      "doi": ""
    },
    {
      "text": "D. Lane, H. Napier, S. Peres, and A. Sandor. Hidden Costs of Graphical User Interfaces: Failure to Make the Transition from Menus and Icon Toolbars to Keyboard Shortcuts. International Journal of Human-Computer Interaction, 18(1):133--144, 2005.",
      "doi": ""
    },
    {
      "text": "A. C. J. Long, J. A. Landay, and L. A. Rowe. Implications for a gesture design tool. In CHI '99: Proceedings of the SIGCHI conference on Human factors in computing systems, 40--47, New York, NY, USA, 1999. ACM.  ",
      "doi": "10.1145/302979.302985"
    },
    {
      "text": "A. C. J. Long, J. A. Landay, L. A. Rowe, and J. Michiels. Visual similarity of pen gestures. In CHI'00: Proceedings of the SIGCHI conference on Human factors in computing systems, 360--367, New York, NY, USA, 2000. ACM.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "P. Morrel-Samuels. Clarifying the distinction between lexical and gestural commands. Int. J. Man-Mach. Stud., 32(5):581--590, 1990.  ",
      "doi": "10.1016/S0020-7373%2805%2980034-3"
    },
    {
      "text": "D. Odell, R. Davis, A. Smith, and P. Wright. Toolglasses, marking menus, and hotkeys: a comparison of one and two-handed command selection techniques. In GI '04: Proc. of Graphics Interface, 17--24, 2004. ",
      "doi": "10.5555/1006058.1006061"
    },
    {
      "text": "Y. Rogers. Evaluating the meaningfulness of icon sets to represent command operations. In Proc. Conference of the British Computer Society, 586--603, 1986. ",
      "doi": "10.5555/17324.24107"
    },
    {
      "text": "D. Rubine. Specifying gestures by example. SIGGRAPH Comput. Graph., 25(4):329--337, 1991.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "C. Tappert. Cursive script recognition by elastic matching. IBM Journal of Research Development, 26(6):765--771, 1982.",
      "doi": "10.1147/rd.266.0765"
    },
    {
      "text": "J. Wobbrock, A. Wilson, and Y. Li. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. In UIST '07: Proc. ACM Symposium on User interface software and technology, 159--168, 2007.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "C. Wolf. Can people use gesture commands? ACM SIGCHI Bulletin, 18(2):73--74, 1986.  ",
      "doi": "10.1145/15683.1044102"
    },
    {
      "text": "C. Wolf, J. Rhyne, and H. Ellozy. The paper-like interface. In Proc. International conference on human-computer interaction on Designing and using human-computer interfaces and knowledge based systems, 494--501, 1989. ",
      "doi": "10.5555/92449.92512"
    },
    {
      "text": "R. Zeleznik and T. Miller. Fluid inking: augmenting the medium of free-form inking with gestures. In GI '06: Proc. of Graphics Interface, 155--162, 2006. ",
      "doi": "10.5555/1143079.1143105"
    },
    {
      "text": "S. Zhai and P.-O. Kristensson. Shorthand writing on stylus keyboard. In CHI '03: Proc. ACM Conference on Human factors in computing systems, 97--104, 2003.  ",
      "doi": "10.1145/642611.642630"
    },
    {
      "text": "S. Zhao and R. Balakrishnan. Simple vs. compound mark hierarchical marking menus. In UIST '04: Proc. ACM Symposium on User interface software and technology, 33--42, 2004.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}