{
  "doi": "10.1145/1518701.1518868",
  "title": "Improving visual search with image segmentation",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1093-1102",
  "year": 2009,
  "badges": [],
  "abstract": "People's ability to accurately locate target objects in images is severely affected by the prevalence of the sought objects. This negative effect greatly impacts critical real world tasks, such as baggage screening and cell slide pathology, in which target objects are rare. We present three novel image presentation techniques that are designed to improve visual search. Our techniques rely on the images being broken into image segments, which are then recombined or displayed in novel ways. The techniques and their underlying design reasoning are described in detail, and three experiments are presented that provide initial evidence that these techniques lead to better search performance in a simulated cell slide pathology task.",
  "tags": [
    "segmentation",
    "rsvp",
    "visual search",
    "image presentation"
  ],
  "authors": [
    {
      "name": "Clifton Forlines",
      "institution": "Mitsubishi Electric Research Labs, University of Toronto, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584798",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Adami, H., Pontén, J., Sparén, P., Bergström, R., Gustafsson, L.,&amp;Friberg, L. (1994). Survival trend after invasive cervical cancer diagnosis in Sweden before and after cytologic screening. 1960--1984. Cancer, 73(1). pp 140--147.",
      "doi": ""
    },
    {
      "text": "AForge.NET. http://code.google.com/p/aforge/",
      "doi": ""
    },
    {
      "text": "Beck, M.,&amp;Trafton, J. G. (2007). Local spatial layout consistency affects strategies but not memory during Visual Search. Journal of Vision, 7(9):1060.",
      "doi": ""
    },
    {
      "text": "Coltheart, V. (Ed.) (1999). Fleeting memories: Cognition of brief visual stimuli. MIT Press.",
      "doi": ""
    },
    {
      "text": "Ellis, S. R.,&amp;Stark, L. (1986). Statistical dependency in visual scanning. Human Factors, 28(4), 421--438. ",
      "doi": "10.1177/001872088602800405"
    },
    {
      "text": "Fleck, M. S.,&amp;Mitroff, S. R. (2007). Rare targets are rarely missed in correctable search. Psychological Science, 18, 943--947.",
      "doi": ""
    },
    {
      "text": "Forlines, C., Shen, C., Wigdor, D.,&amp;Balakrishnan, R. (2006). Exploring the effects of group size and display configuration on visual search. In Proc. of Computer Supported Cooperative Work. pp. 11--20.  ",
      "doi": "10.1145/1180875.1180878"
    },
    {
      "text": "Gilchrist, I. and Harvey, M. (2006). Evidence for a systematic component within scan paths in visual search. Visual Cognition, 14(4):704--715.",
      "doi": ""
    },
    {
      "text": "Groopman, J. 2008. How Doctors Think - Chapter 8: The Eye of the Beholder. Houghton Mifflin Company, New York. ISBN-13:978-0-618-61003-7.",
      "doi": ""
    },
    {
      "text": "Halverson, T.&amp;Hornof, A. J. (2007). A minimal model for predicting visual search in human computer interaction. In Proc. of ACM CHI Conference on Human Factors in Computing Systems. pp. 431--434.  ",
      "doi": "10.1145/1240624.1240693"
    },
    {
      "text": "Halverson, T. (2006). Integrating models of human computer visual interaction. In Extended Abstracts of the ACM CHI Conference on Human Factors in Computing Systems. pp. 1747--1750.  ",
      "doi": "10.1145/1125451.1125779"
    },
    {
      "text": "Hornof, A. J.,&amp;Halverson, T. (2003). Cognitive strategies and eye movements for searching hierarchical computer displays. In Proc. of ACM CHI Conference on Human Factors in Computing System. pp. 249--256.  ",
      "doi": "10.1145/642611.642656"
    },
    {
      "text": "Keenlyside, R. A., Collins, C. L., Hancock, J. S., Gagnon, M. C., Cohn, R. D., Menoff, A. L., Dodd, L. G., Kurtycz, D. F., Hearn, T. L.,&amp;Baker, Jr. E. L. (1999). Do proficiency test results correlate with the work performance of screeners who screen Papanicolaou smears? American Journal of Clinical Pathology, 112(6). pp. 769--776.",
      "doi": ""
    },
    {
      "text": "Krendel, E. S.,&amp;Wodinsky, J. (1960). Search in an unstructured visual Feld. Journal of the Optical Society of America, 50, 562--568.",
      "doi": ""
    },
    {
      "text": "Mello-Thoms, C., Nodine, C. F.,&amp;Kundel, H. L. (2002). What attracts the eye to the location of missed and reported breast cancers? ACM ETRA Symposium on Eye Tracking Research&amp;Applications. pp. 111--117.  ",
      "doi": "10.1145/507072.507095"
    },
    {
      "text": "Pomplun M. (2006) Saccadic selectivity in complex visual search displays. Vision Research. Jun;46(12):1886--1900.",
      "doi": ""
    },
    {
      "text": "Pham, D., Xu, C.,&amp;Prince, J. (2000). Current methods in medical image segmentation. Annual Review of Biomedical Engineering. pp. 15--37.",
      "doi": ""
    },
    {
      "text": "Raymond, J., Shapiro, K., Arnell, K. (1992). Temporary suppression of visual processing in an RSVP task: an attentional blink?. Journal of Experimental psychology. Human perception and performance, 18 (3): 84960.",
      "doi": ""
    },
    {
      "text": "Renshaw, A. (2001). Measuring and Reporting Errors in Surgical Pathology. American Journal of Clinical Pathology, 115. pp 338--341.",
      "doi": ""
    },
    {
      "text": "Roerdink, J.,&amp;Meijster, A. (2001). The Watershed transform: definitions, algorithms and parallelization strategies. Fundamenta Informaticae 41. pp. 187--228. ",
      "doi": "10.5555/341148.341161"
    },
    {
      "text": "Scinto, L., Pillalamarri, R.,&amp;Karsh, R. (1986). Cognitive strategies for visual search. Acta Psychologica, 62, 263--292.",
      "doi": ""
    },
    {
      "text": "Simonin, J., Kieffer, S.,&amp;Carbonell, N. (2005). Effects of display layout on gaze activity during visual search. In Proc. of INTERACT Conference. pp. 1054--1058.  ",
      "doi": "10.1007/11555261_103"
    },
    {
      "text": "Spence, R. (2002) Rapid, serial and visual: a presentation technique with potential. Information Visualization, 1 (1). Pp. 13--19.  ",
      "doi": "10.1057/palgrave/ivs/9500008"
    },
    {
      "text": "Wittenburg, K., Forlines, C., Lanning, T., Esenther, A., Harada, S.&amp;Miyachi, T. (2003). Rapid serial visual presentation techniques for consumer digital video devices. In Proc. of ACM UIST. pp. 115--124.  ",
      "doi": "10.1145/964696.964709"
    },
    {
      "text": "Wolfe, J. M. (1998). Visual search. In H. Pashler (Ed.), Attention, East Sussex, UK: Psychology Press.",
      "doi": ""
    },
    {
      "text": "Wolfe, J. M., Horowitz, T. S., Van Wert, M. J., Kenner, N. M., Place, S. S.,&amp;Kibbi, N. (2007). Low target prevalence is a stubborn source of errors in visual search tasks. Journal of Experimental Psychology: General.",
      "doi": ""
    },
    {
      "text": "Wolfe, J. M., Horowitz, T. S.&amp;Kenner, N. (2005) Rare items often missed in visual searches. Nature, 435. pp. 439--440.",
      "doi": ""
    }
  ]
}