{
  "doi": "10.1145/1518701.1519010",
  "title": "Semantically structured tag clouds: an empirical evaluation of clustered presentation approaches",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2037-2040",
  "year": 2009,
  "badges": [],
  "abstract": "Tag clouds have become a frequently used interaction technique in the web. Recently several approaches to present tag clouds with the tags semantically clustered have been proposed. However, it remains unclear whether the expected gains in performance and advantages in interaction actually can be realized as no empirical evaluations of such approaches are available yet. In this paper we describe a series of experiments designed to evaluate the effects of semantic versus alphabetical and random arrangements of tags in tag clouds. The results of our work indicate that semantically clustered tag clouds can provide improvements over random layouts in specific search tasks and that they tend to increase the attention towards tags in small fonts compared to other layouts. Also, semantically structured tag clouds were preferred by about half of the users for general search tasks. Tag cloud layout does not seem to influence the ability to remember tags.",
  "authors": [
    {
      "name": "Johann Schrammel",
      "institution": "CURE - Center for Usability Research and Engineering, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100044484",
      "orcid": "missing"
    },
    {
      "name": "Michael Leitner",
      "institution": "CURE - Center for Usability Research and Engineering, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331497408",
      "orcid": "missing"
    },
    {
      "name": "Manfred Tscheligi",
      "institution": "CURE - Center for Usability Research and Engineering, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548016789",
      "orcid": "0000-0001-6056-7285"
    }
  ],
  "references": [
    {
      "text": "Banerjee, S. and Pedersen, T. Extended gloss overlaps as a measure of semantic relatedness. In Proc. Artificial Intelligence. 2003. 805--810 ",
      "doi": "10.5555/1630659.1630775"
    },
    {
      "text": "Bateman, S., Gutwin, C., and Nacenta, M. Seeing things in the clouds: the effect of visual features on tag cloud selections. In Proc. Hypertext and Hypermedia 2008. ACM Press (2008), 193--202.  ",
      "doi": "10.1145/1379092.1379130"
    },
    {
      "text": "Berlocher, I., Lee, K., and Kim, K. TopicRank: bringing insight to users. In Proc. SIGIR 2008. ACM Press (2008), 703--704.  ",
      "doi": "10.1145/1390334.1390460"
    },
    {
      "text": "Budanitsky, A. and Hirst, G. Evaluating WordNet-based Measures of Lexical Semantic Relatedness. Comput. Linguist. 32, 1 (Mar. 2006), 13--47.  ",
      "doi": "10.1162/coli.2006.32.1.13"
    },
    {
      "text": "Fellbaum, C. (Ed.) WordNet: An Electronic Lexical Database. MIT Press, Cambridge, MA, USA. 1998",
      "doi": ""
    },
    {
      "text": "Fujimura, K., Fujimura, S., Matsubayashi, T., Yamada, T., and Okuda, H. Topigraphy: visualization for large-scale tag clouds. In Proc. WWW 2008. ACM Press (2008), 1087--1088.  ",
      "doi": "10.1145/1367497.1367669"
    },
    {
      "text": "Halvey, M. J. and Keane, M. T. An assessment of tag presentation techniques. In Proc. WWW 2007. ACM Press (2007), 1313--1314.  ",
      "doi": "10.1145/1242572.1242826"
    },
    {
      "text": "Hassan-Montero, Y.,&amp;Herrero-Solana, V. Improving tagclouds as visual information retrieval interfaces. Proc. InfoSciT 2006.",
      "doi": ""
    },
    {
      "text": "Hearst, M.A., and Rosner, D., Tag Clouds: Data Analysis Tool or Social Signaller? In Proc. HICSS 2008  ",
      "doi": "10.1109/HICSS.2008.422"
    },
    {
      "text": "Kuo, B. Y., Hentrich, T., Good, B. M., and Wilkinson, M. D. 2007. Tag clouds for summarizing web search results. In Proc. World Wide Web 2007. ACM Press (2007), 1203--1204.  ",
      "doi": "10.1145/1242572.1242766"
    },
    {
      "text": "Rivadeneira, A. W., Gruen, D. M., Muller, M. J., and Millen, D. R. Getting our head in the clouds: toward evaluation studies of tagclouds. In Proc. CHI 2007. ACM Press (2007), 995--998.  ",
      "doi": "10.1145/1240624.1240775"
    },
    {
      "text": "Sinclair, J. and Cardew-Hall, M. The Folksonomy Tag Cloud: When is it Useful? Journal of Information Science. 34, 1 (Feb. 2008), 15--29.  ",
      "doi": "10.1177/0165551506078083"
    }
  ]
}