{
  "doi": "10.1145/1518701.1518829",
  "title": "Urban pixels: painting the city with light",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "839-848",
  "year": 2009,
  "badges": [],
  "abstract": "Urban environments are increasingly filled with digital display systems that are inflexible, flat, bounded, high-resolution, and unresponsive. In this paper, we explore the potential of physically instantiated pixels that enable flexible, reconfigurable, unbounded, low-resolution, and responsive urban displays. Urban Pixels are nodes in a wireless network of physical pixels for urban spaces. Each pixel unit includes a microcontroller, RF transceiver (433 MHz), LED module (ten bright, white LEDs), rechargeable Li-Ion battery pack, IR sensor and renewable energy source such as photo-voltaic cells. Two acrylic half-spheres (4-inch diameter) protect the components from the elements. No additional wiring is needed for communication and the units can be mounted individually to any surface. A small-scale prototype network of fifty Urban Pixels was displayed on a façade of Eden Court Theater in Inverness, Scotland from June 1 - June 7, 2008. The public was encouraged to change display patterns via SMS or to interact with individual units via flashlights. We observed and informally interviewed theater guests and passers-by interacting with the façade for several nights. Based on these results, we outline an exciting problem space for designing displays and lighting systems in cities.",
  "tags": [
    "ubiquitous computing",
    "lighting",
    "interaction design",
    "urban display",
    "ambient media",
    "urban computing"
  ],
  "authors": [
    {
      "name": "Susanne Seitinger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311480972",
      "orcid": "missing"
    },
    {
      "name": "Daniel S. Perry",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416601522",
      "orcid": "missing"
    },
    {
      "name": "William J. Mitchell",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100360752",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akyildiz, I.F., Su, W., Sankarasubramaniam, Y., Cayirci, E. A survey on sensor networks. IEEE Communications Magazine 40, 8 (August 2002), 102--114.  ",
      "doi": "10.1109/MCOM.2002.1024422"
    },
    {
      "text": "Ambient Intelligence. Philips Research Technology Magazine. Password 23 (May 2005).",
      "doi": ""
    },
    {
      "text": "Bellotti, V. et al. Making sense of sensing systems: Five questions for designers and researchers. In Proc. CHI 2002, ACM Press (2002), pp-pp.  ",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Bouchard, D. and Maes, P. SoundMites: Embodied Emergence. http://ambient.media.mit.edu/projects.php?action=details&id=41",
      "doi": ""
    },
    {
      "text": "BlinkenLights. Berlin, 2001-2002. www.blinkenlights.de.",
      "doi": ""
    },
    {
      "text": "Bruges, J. Wind to Light. London, 2007. http://www.jasonbruges.com/",
      "doi": ""
    },
    {
      "text": "Butera, W. Text display and graphics control on a paintable computer. In Proc. of the int'l Conference on Self-Adaptive and Self-Organizing Systems (2007), 45--54.  ",
      "doi": "10.1109/SASO.2007.60"
    },
    {
      "text": "Buxton, W. Absorbing and squeezing out: On sponges and ubiquitous computing. In Proc. of the International Broadcasting Symposium 16 (November 13-16), 91--96.",
      "doi": ""
    },
    {
      "text": "Chatzitsakyris, P., Ducla-Soares, G., and Zulas, A. IN-Visible: perceiving invisible urban information through ambient media. Ext. Abstracts CHI 2004, ACM Press (2004), 1348--1350.  ",
      "doi": "10.1145/985921.986061"
    },
    {
      "text": "Delbrück, T., Whatley, A. M., Douglas, R., Eng, K., Hepp, K., and Verschure, P. F. A tactile luminous floor for an interactive autonomous space. Robotics and Autonomous Systems 55, 6 (2007), 433--443.  ",
      "doi": "10.1016/j.robot.2007.01.006"
    },
    {
      "text": "Dey, A., Mankoff, J., Abowd, G., and Carter, S. Distributed mediation of ambiguous context in aware environments. In Proc. of the ACM Symposium on User Interface Software and Technology (2002), 121--130.  ",
      "doi": "10.1145/571985.572003"
    },
    {
      "text": "Ducatel, K., Bogdanowicz, M., Scapolo, F., Leijten, J. and Burgelman, J.-C. Scenarios for ambient intelligence in 2010. Final Report European Commission IST Advisory Group (2001).",
      "doi": ""
    },
    {
      "text": "Eisenstein, S. M. The Film Sense. Jay Leyda, transl. and ed. Harvest Book, Harcourt, Brace&amp;World, New York, 1942, 1975.",
      "doi": ""
    },
    {
      "text": "Estrin, D., Govindan, R., Heidemann, J. S., and Kumar S. Next century challenges: Scalable coordination in sensor networks. In Mobile Computing and Networking, ACM Press (1999), 263--270.  ",
      "doi": "10.1145/313451.313556"
    },
    {
      "text": "Fitzmaurice, G., Ishii, H., and Buxton, W. Bricks: Laying the foundations for graspable user interfaces. In Proc. of CHI 1995, ACM Press (1995), 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Frenchman, D., Rojas, F. Zaragoza's Digital Mile: Place-Making in a new public realm. Places 18, 2 (2005), 16--25.",
      "doi": ""
    },
    {
      "text": "Graffiti Research Lab. Laser Tag. 2007. http://graffitiresearchlab.com/?page_id=76#video",
      "doi": ""
    },
    {
      "text": "Graffiti Research Lab. Throwies. http://graffitiresearchlab.com/?page_id=6",
      "doi": ""
    },
    {
      "text": "Heaton, K. B., Poor, R. D., and Wheeler, A. J. Nami. In Conference Abstracts and Applications SIGGRAPH 1999, ACM Press (1999), 215.  ",
      "doi": "10.1145/311625.312094"
    },
    {
      "text": "Herzog, J. and De Meuron, P. Allianz Arena. Munich, 2005. http://en.wikipedia.org/wiki/Allianz_Arena",
      "doi": ""
    },
    {
      "text": "Ishii, H. Tangible pixels: Beyond pixels. In Proc. of TEI 2008, ACM Press (2008), XV-XXV.  ",
      "doi": "10.1145/1347390.1347392"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible bits: Towards seamless interfaces between people, bits and atoms. In Proc. of CHI 1997, ACM Press (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Ito, M. D. and Okabe, M. eds. Personal, Portable, Pedestrian: Mobile Phones in Japanese Life. MIT Press, Cambridge, MA, 2005. ",
      "doi": "10.5555/1088854"
    },
    {
      "text": "Jakle, J.A. City Lights: Illuminating the American Night. Johns Hopkins University Press, Baltimore, London, 2001.",
      "doi": ""
    },
    {
      "text": "Laibowitz, M. and Paradiso, J.A. Wireless wearable transceivers. Circuit Cellar 163 (2004), 28--39.",
      "doi": ""
    },
    {
      "text": "Lifton, J., Feldmeier, M., Ono, Y., Lewis, C., and Paradiso, J.A. A platform for ubiquitous sensor deployment in occupational and domestic environments. In Proc. of IPSN, ACM Press (2007), 119--127.  ",
      "doi": "10.1145/1236360.1236377"
    },
    {
      "text": "Lifton, J., Broxton, M., and Paradiso, J.A. Experiences and directions in pushpin computing. In Proc. of IPSN, ACM Press (2005), 416--421 ",
      "doi": "10.5555/1147685.1147753"
    },
    {
      "text": "Lozano Hemmer, R. Body Movies. Rotterdam, 2001. www.lozano-hemmer.com/video/bodymovies.html",
      "doi": ""
    },
    {
      "text": "McCullough, M. Digital Ground: Architecture, Pervasive Computing, and Environmental Knowing. MIT Press, Cambridge, MA, 2004. ",
      "doi": "10.5555/983677"
    },
    {
      "text": "Merrill, D., Kalanithi, J., and Maes, P. Siftables: towards sensor network user interfaces. In Proc. of TEI 2007, ACM Press (2007), 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Mitchell, W. J. The Reconfigured Eye. MIT Press, Cambridge, MA, 1992.",
      "doi": ""
    },
    {
      "text": "Murthy, R. Street Media: Ambient Messages in an Urban Space. MIT SM Thesis, 2005.",
      "doi": ""
    },
    {
      "text": "Murty, R., Gosain, A., Tierney, M., Brody, A., Fahad, A., Bers, J. and Welsh, M. Harvard University Technical Report, TR-13-07 (September, 2007). http://www.citysense.net/",
      "doi": ""
    },
    {
      "text": "Neumann, D. Architecture of the Night: The Illuminated Building. Presetel, Munich, New York, 2002.",
      "doi": ""
    },
    {
      "text": "Norman, D. Invisible Computer. MIT Press, Cambridge, MA, 1998. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Nye, D. E. Electrifying America: Social Meanings of a New Technology. MIT Press, Cambridge, MA, 1992.",
      "doi": ""
    },
    {
      "text": "Paulos, E. Urban Probes. INTEL. http://urban-atmospheres.net/UrbanProbes",
      "doi": ""
    },
    {
      "text": "Pfeiffer, E. WhereWare. Technology Review (2003).",
      "doi": ""
    },
    {
      "text": "Rekimoto, J., Ullmer, B., and Oba, H. DataTiles: A modular platform for mixed physical and graphical interactions. In Proceedings of the SIGCHI 2001 Conference on Human Factors in Computing Systems, ACM Press (2001), 269--276.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "Riva, O. and Borcea, C. The Urbanet revolution: Sensor power to the people! IEEE Pervasive Computing (2007), 41--49.  ",
      "doi": "10.1109/MPRV.2007.46"
    },
    {
      "text": "Savvides, A., Girod,, L., Srivastava, M. and Estrin, D. Localization in sensor networks. In Znati, Radhavendra and Sivalingam, eds. Wireless Sensor Networks. Springer, New York, 2006. ",
      "doi": "10.5555/1013825.1013841"
    },
    {
      "text": "Schivelbusch, W. Licht, Schein und Wahn. ERCO Edition, Berlin, 1992.",
      "doi": ""
    },
    {
      "text": "Struppek, M. The social potential of urban screens. Visual Communication 5, 2 (2006): 173--188.",
      "doi": ""
    },
    {
      "text": "Tomitsch, M., Kappel, K., Lehner, A. and Grechenig, T. Towards a taxonomy for ambient information systems. In Pervasive 2007 W9 Ambient Information Systems (May 13, 2007).",
      "doi": ""
    },
    {
      "text": "Tscheligi, M. ed. Ambient intelligence: Exploring our living environment. Interactions 12, 4 (2005): Special Issue.  ",
      "doi": "10.1145/1070960.1070978"
    },
    {
      "text": "Underkoffler, J., Ullmer, B. and Ishii, H. Emancipated pixels: Real-world graphics in the luminous room. In Proc. of SIGGRAPH 1999, ACM Press (1999), 385--392.  ",
      "doi": "10.1145/311535.311593"
    },
    {
      "text": "Villareal, L. Supercluster. New York, 2003-2004. http://www.villareal.net/project_3.html",
      "doi": ""
    },
    {
      "text": "Want, R. et al. Disappearing hardware. IEEE Pervasive Computing (Jan.-March 2002): 36--47.  ",
      "doi": "10.1109/MPRV.2002.993143"
    },
    {
      "text": "Weiser, M. The computer for the 21st century. Scientific American (1991), 94--104.",
      "doi": ""
    },
    {
      "text": "Yick, J., Mukherjee, B., and Ghosal, D. Wireless sensor network survey. Comput. Netw. 52, 12 (Aug. 2008), 2292--2330.  ",
      "doi": "10.1016/j.comnet.2008.04.002"
    },
    {
      "text": "Yoon, M. White Noise White Light. Athens, 2004. http://www.mystudio.us/",
      "doi": ""
    }
  ]
}