{
  "doi": "10.1145/1518701.1518907",
  "title": "backchan.nl: integrating backchannels in physical space",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1361-1370",
  "year": 2009,
  "badges": [],
  "abstract": "In this paper, we describe backchan.nl, a web based backchannel system that focuses on providing greater audience participation during question and answer sessions. The system allows audience members to use a web-based service to propose questions and comments, and to vote on the questions of others. Top rated submissions are projected into the presentation space where audience members, moderators, and panelists can see them. We discuss the results of deploying this system at many different kinds of conferences and relate those results to the particular design of our system, demonstrating how backchannel systems can be more than just shared chat rooms. From our experience with this work, we discuss the broader implications of configurable mediated social spaces and how subtle design decisions can influence user experience",
  "authors": [
    {
      "name": "Drew Harry",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583956",
      "orcid": "missing"
    },
    {
      "name": "Joshua Green",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406593744",
      "orcid": "missing"
    },
    {
      "name": "Judith Donath",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223099",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chesnais, P., A Framework for Designing Constructionist Approaches to Community-Centered Messaging, in School of Architecture and Planning. 2000, Massaschusetts Institute of Technology: Cambridge, MA. p. 143.",
      "doi": ""
    },
    {
      "text": "Chillag, I. Rickrolling Alive and Well at ROFL Con. The Bryand Park Project Blog. 2008 Available from: http://www.npr.org/blogs/bryantpark/2008/04/rickrolling_alive_and_well_at_1.html.",
      "doi": ""
    },
    {
      "text": "Cogdill S., FAnderclai T.L., Kilborn J., Williams M.G. Backchannel: whispering in digital conversation, in Proc. Hawaii International Conference on System Sciences. 2001. ",
      "doi": "10.5555/820559.820700"
    },
    {
      "text": "DiMicco J.M., Hollenbach K, Pandolfo A., Bender W., The Impact of Increased Awareness While Face-to-Face. Human-Computer Interaction, 2007. 22(1). p. 47--96. ",
      "doi": "10.5555/1466595.1466598"
    },
    {
      "text": "Donath J., Karahalios K., and Viégas F.B., Visualizing Conversation, in Proc. Hawaii International Conference on System Sciences. 1999. ",
      "doi": "10.5555/874069.875994"
    },
    {
      "text": "Dover D. Reddit, Stumbleupon, Del.icio.us and Hacker News Algorithms Exposed! SEOmozBlog. 2008 Available from: http://www.seomoz.org/blog/reddit-stumbleupon-delicious-and-hacker-news-algorithms-exposed.",
      "doi": ""
    },
    {
      "text": "Friedman, E. and Resnick P., The Social Cost of Cheap Pseudonyms. Journal of Economics and Management Strategy, 2001. 10(2): p. 173--199.",
      "doi": ""
    },
    {
      "text": "Golub, E., On audience activities during presentations. Journal of Computing Sciences in Colleges. 2005. p. 38--46. ",
      "doi": "10.5555/1040196.1040202"
    },
    {
      "text": "Karahalios, K. and Donath J., Telemurals: linking remote spaces with social catalysts, in Proc. CHI '04. 2004. p. 615--622.  ",
      "doi": "10.1145/985692.985770"
    },
    {
      "text": "Karahalios, K. and Bergstrom T., Visualizing Audio in Group Table Conversation, in Workshop on Horizontal Interactive Human-Computer Systems. 2006.  ",
      "doi": "10.1109/TABLETOP.2006.37"
    },
    {
      "text": "Krauss, R.M. Garlock C. M., Bricker P. D., McMahon L. E., The Role of Audio and Visible Back-Channel Responses in Interpersonal Communication. Journal of Personal and Social Psychology, 1977. 35(7): p. 523--529.",
      "doi": ""
    },
    {
      "text": "Lampe, C.A.C., Johnston E., and Resnick P., Follow the reader: filtering comments on slashdot, in Proc. CHI '07. p. 1253--1262.  ",
      "doi": "10.1145/1240624.1240815"
    },
    {
      "text": "Lerman, K., Social Networks and Social Information Filtering on Digg, in Arxiv preprint cs.HC. 2006.",
      "doi": ""
    },
    {
      "text": "McCarthy, J.F., Digital backchannels in shared physical spaces: experiences at an academic conference. In Proc. CHI '05. p. 1641--1644.  ",
      "doi": "10.1145/1056808.1056986"
    },
    {
      "text": "Orlikowski, W.J., Learning from Notes: Organizational Issues in Groupware Implementation', in Proc. CSCW '92. p. 362--369.  ",
      "doi": "10.1145/143457.143549"
    },
    {
      "text": "Question Answer. Available from: https://sourceforge.net/projects/questionanswer/.",
      "doi": ""
    },
    {
      "text": "Raftery, B., So, Tron Guy, Gem Sweater Lady, and the Firefox Walk Into a Bar .. in Wired. 2008, Condé Nast.",
      "doi": ""
    },
    {
      "text": "Ratto M., Shapiro R. B., Truong T. M., Griswold W. G. Griswold The ActiveClass Project: Experiments in Encouraging Classroom Participation. In Proc CSCL '03.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J., Ayatsuka Y., Uoi H., Arai T. Adding another communication channel to reality: an experience with a chat-augmented conference, in Proc. CHI '98. p. 271--272.  ",
      "doi": "10.1145/286498.286752"
    },
    {
      "text": "Resnick, P. and R. Zeckhauser, Trust Among Strangers in Internet Transactions: Empirical Analysis of eBay's Reputation System. Advances in Applied Microeconomics, 2002. 11: p. 127--157.",
      "doi": ""
    },
    {
      "text": "Yankelovich, N., McGinn J., Wessler M., Kaplan J., Provino J., Fox H., Private communications in public meetings, in Proc. CHI '05. p. 1873--1876  ",
      "doi": "10.1145/1056808.1057044"
    },
    {
      "text": "Yardi, S., The role of the backchannel in collaborative learning environments, in Proc. ICLS. 2006. p. 852--858. ",
      "doi": "10.5555/1150034.1150158"
    },
    {
      "text": "YouGotRickRolled. Rick Roll. 2007 Available from: http://www.youtube.com/watch?v=eBGIQ7ZuuiU",
      "doi": ""
    }
  ]
}