{
  "doi": "10.1145/1518701.1519016",
  "title": "Blogging at work and the corporate attention economy",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2071-2080",
  "year": 2009,
  "badges": [],
  "abstract": "The attention economy motivates participation in peer-produced sites on the Web like YouTube and Wikipedia. However, this economy appears to break down at work. We studied a large internal corporate blogging community using log files and interviews and found that employees expected to receive attention when they contributed to blogs, but these expectations often went unmet. Like in the external blogosphere, a few people received most of the attention, and many people received little or none. Employees expressed frustration if they invested time and received little or no perceived return on investment. While many corporations are looking to adopt Web-based communication tools like blogs, wikis, and forums, these efforts will fail unless employees are motivated to participate and contribute content. We identify where the attention economy breaks down in a corporate blog community and suggest mechanisms for improvement.",
  "authors": [
    {
      "name": "Sarita Yardi",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81309483660/rel-imgonly/sarita_large.jpg",
      "acmid": "81309483660",
      "orcid": "missing"
    },
    {
      "name": "Scott A. Golder",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100225511",
      "orcid": "missing"
    },
    {
      "name": "Michael J. Brzozowski",
      "institution": "Hewlett-Packard Labs, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309505971",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarwal, N., Liu, H., Tang, L. and Yu, P.S., Identifying the influential bloggers in a community. In Proc. ICWSM '08, ACM, (2008).  ",
      "doi": "10.1145/1341531.1341559"
    },
    {
      "text": "Baumer, E., Sueyoshi, M. and Tomlinson, B., Exploring the role of the reader in the activity of blogging. In Proc. CHI '08, ACM Press, (2008), 1111--1120.  ",
      "doi": "10.1145/1357054.1357228"
    },
    {
      "text": "Bugzilla@Mozilla. Bugzilla Etiquette.",
      "doi": ""
    },
    {
      "text": "Chin, A. and Chignell, M., A social hypertext model for finding community in blogs. In Proceedings of the seventeenth conference on Hypertext and hypermedia, ACM, (2006).  ",
      "doi": "10.1145/1149941.1149945"
    },
    {
      "text": "Davenport, T.H. and Beck, J.C. The Attention economy. Ubiquity, 2 (14). 1.  ",
      "doi": "10.1145/375348.376626"
    },
    {
      "text": "Efimova, L. and Grudin, J., Crossing Boundaries: A Case Study of Employee Blogging. In Proc. HICSS '07, IEEE Computer Society, (2007).  ",
      "doi": "10.1109/HICSS.2007.159"
    },
    {
      "text": "Goldhaber, M.H. The Attention Economy and the Net. First Monday, 2 (4).",
      "doi": ""
    },
    {
      "text": "Goldhaber, M.H. The value of openness in an attention economy. First Monday, 11 (6).",
      "doi": ""
    },
    {
      "text": "Gruhl, D., Guha, R., Liben-Nowell, D. and Tomkins, A., Information diffusion through blogspace. In Proceedings of the 13th international conference on World Wide Web, ACM, (2004).  ",
      "doi": "10.1145/988672.988739"
    },
    {
      "text": "Gurzick, D. and Lutters, W.G., From the personal to the profound: understanding the blog life cycle. In CHI '06 extended abstracts ACM, (2006).  ",
      "doi": "10.1145/1125451.1125614"
    },
    {
      "text": "Herring, S.C., Scheidt, L.A., Bonus, S. and Wright, E., Bridging the Gap: A Genre Analysis of Weblogs. In Proc. HICSS '04, IEEE Computer Society, (2004). ",
      "doi": "10.5555/962752.962976"
    },
    {
      "text": "Huberman, B.A., Romero, D. and Wu, F. Crowdsourcing, Attention and Productivity. arXiv:0809.3030v1.",
      "doi": ""
    },
    {
      "text": "Huh, J., Jones, L., Erickson, T., Kellogg, W.A., Bellamy, R.K.E. and Thomas, J.C., BlogCentral: the role of internal blogs at work. In CHI '07 extended abstracts, ACM, (2007).  ",
      "doi": "10.1145/1240866.1241022"
    },
    {
      "text": "Jackson, A., Yates, J. and Orlikowski, W., Corporate Blogging: Building community through persistent digital talk. In Proc. HICSS '07, IEEE Computer Society, (2007).  ",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "Jonathan, G. Groupware and social dynamics: eight challenges for developers. Commun. ACM, 37 (1). 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Kolari, P., Finin, T., Yesha, Y., Yesha, Y., Lyons, K., Perelgut, S. and Hawkins, J., On the Structure, Properties and Utility of Internal Corporate Blogs. In Proc. ICWSM '07, (2007).",
      "doi": ""
    },
    {
      "text": "Kollock, P. The Economies of Online Cooperation: Gifts and Public Goods in Cyberspace. in Smith, M.a.K., P. ed. Communities in Cyberspace, Routledge, New York, 1999, 220--239. ",
      "doi": "10.5555/552599"
    },
    {
      "text": "Kramer, A. and Rodden, K., Word usage and posting behaviors: modeling blogs with unobtrusive data collection methods. In Proc. CHI '08, ACM, (2008).  ",
      "doi": "10.1145/1357054.1357230"
    },
    {
      "text": "Krishnamurthy, B., Gill, P. and Arlitt, M., A few chirps about Twitter. In ACM SIGCOMM workshop on Online Social Networks, ACM, (2008).  ",
      "doi": "10.1145/1397735.1397741"
    },
    {
      "text": "Maslow, A.H. A Theory of Human Motivation. Psychological Review, 50. 370--396.",
      "doi": ""
    },
    {
      "text": "Nardi, B.A., Schiano, D.J., Gumbrecht, M. and Swartz, L. Why we blog. Commun. ACM, 47 (12). 41--46.  ",
      "doi": "10.1145/1035134.1035163"
    },
    {
      "text": "Nardi, B.A., Whittaker, S. and Bradner, E., Interaction and outeraction: instant messaging in action. In Proc. CSCW '00, ACM, (2000).  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Qamra, A., Tseng, B. and Chang, E.Y., Mining blog stories using community-based and temporal clustering. In Proc. CIKM '06, ACM, (2006).  ",
      "doi": "10.1145/1183614.1183627"
    },
    {
      "text": "Recuero, R.d.C., Information flows and social capital in weblogs: a case study in the Brazilian blogosphere. In Proc. Hypertext '08, ACM, (2008).  ",
      "doi": "10.1145/1379092.1379113"
    },
    {
      "text": "Simon, H.A. Designing Organizations for an Information-Rich World. Computers, Communication, and the Public Interest, The Johns Hopkins Press.",
      "doi": ""
    },
    {
      "text": "Simon, H.A. Organizations and Markets. Journal of Economic Perspectives, 5 (2). 28.",
      "doi": ""
    },
    {
      "text": "Smith, A. New numbers for blogging and blog readership Pew Internet Posts, 2008.",
      "doi": ""
    },
    {
      "text": "Sunder, S., Kraut, R.E., Morris, J.H., Telang, R., Filer, D. and Cronin, M.A. Markets for Attention: Will Postage for Email Help?, Yale ICF Working Paper No. 02-28., 2002.",
      "doi": ""
    },
    {
      "text": "Tapscott, D. Growing Up Digital: The Rise of the Net Generation. McGraw-Hill, New York, 1998. ",
      "doi": "10.5555/540866"
    },
    {
      "text": "Tyler, J.R. and Tang, J.C., When can i expect an email response? a study of rhythms in email usage. In Proc. ECSCW '03, Kluwer Academic Publishers, (2003). ",
      "doi": "10.5555/1241889.1241902"
    },
    {
      "text": "Voida, A., Voida, S., Greenberg, S. and He, H.A., Asymmetry in media spaces. In Proc. CSCW '08, ACM, (2008).  ",
      "doi": "10.1145/1460563.1460615"
    },
    {
      "text": "Wu, F. and Huberman, B.A. Novelty and collective attention. Proc Natl Acad Sci USA, 104 (45). 17599--17601.",
      "doi": ""
    },
    {
      "text": "Yardi, S., Golder, S. and Brzozowski, M., The Pulse of the Corporate Blogosphere. In CSCW 2008 Poster, (2008).",
      "doi": ""
    }
  ]
}