{
  "doi": "10.1145/1518701.1518930",
  "title": "What's in Wikipedia?: mapping topics and conflict using socially annotated category structure",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1509-1512",
  "year": 2009,
  "badges": [],
  "abstract": "Wikipedia is an online encyclopedia which has undergone tremendous growth. However, this same growth has made it difficult to characterize its content and coverage. In this paper we develop measures to map Wikipedia using its socially annotated, hierarchical category structure. We introduce a mapping technique that takes advantage of socially-annotated hierarchical categories while dealing with the inconsistencies and noise inherent in the distributed way that they are generated. The technique is demonstrated through two applications: mapping the distribution of topics in Wikipedia and how they have changed over time; and mapping the degree of conflict found in each topic area. We also discuss the utility of the approach for other applications and datasets involving collaboratively annotated category hierarchies.",
  "authors": [
    {
      "name": "Aniket Kittur",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350583094/rel-imgonly/kittur_photo.jpg",
      "acmid": "81350583094",
      "orcid": "missing"
    },
    {
      "name": "Ed H. Chi",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81100330316/rel-imgonly/2018-edchi-dsc_3705-2048px.jpg",
      "acmid": "81100330316",
      "orcid": "missing"
    },
    {
      "name": "Bongwon Suh",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100623883",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cohen, J., Cohen, P., West, S.G.,&amp;Aiken, L.S. 2003. Applied multiple regression/correlation analysis for the behavioral sciences. Lawrence Erlbaum Associates, Mahwah, New Jersey.",
      "doi": ""
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., Riedl, J. 2007. SuggestBot: Using intelligent task routing to help people find work in Wikipedia. In Proc. IUI, Honolulu, HI, 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Halavais, A.&amp;Lackaff, D. 2008. An analysis of topical coverage of Wikipedia. JCMC, 13, 429--440.",
      "doi": ""
    },
    {
      "text": "Holloway, T., Bozicevic, M.,&amp;Böörner, K. 2005. Analyzing and visualizing the semantic coverage of Wikipedia and its authors. ArXiv Computer Science e-prints, cs/0512085.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E.,&amp;Suh, B. 2008. Crowdsourcing user studies with Mechanical Turk. In CHI 2008.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kittur, A., Suh, B., Pendleton, B. A.,&amp;Chi, E. H. 2007. He says, she says: Conflict and coordination in Wikipedia. In CHI 2007, San Jose, CA, 453--462.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Priedhorsky, R., Chen, J., Lam, S. T. K., Panciera, K., Terveen, L., Riedl, J. 2007. Creating, destroying, and restoring value in Wikipedia. In Proc. GROUP, 2007.  ",
      "doi": "10.1145/1316624.1316663"
    },
    {
      "text": "Rada, R., H., Mili, E., Bicknell&amp;M. Blettner (1989). Development and application of a metric to semantic nets. IEEE Transactions on Systems, Man and Cybernetics, 19(1):17.30.",
      "doi": ""
    },
    {
      "text": "Schonhofen, P. 2006. Identifying document topics using the Wikipedia category network. In Proc. Intl. Conf. on Web Intelligence, 456--462.  ",
      "doi": "10.1109/WI.2006.92"
    },
    {
      "text": "Strube, M.,&amp;Ponzetto, S. P. 2006. WikiRelate! Computing semantic relatedness using Wikipedia. In Proc. of AAAI 2006, 1419--1424. ",
      "doi": "10.5555/1597348.1597414"
    },
    {
      "text": "Wu, Z.&amp;M. Palmer (1994). Verb semantics and lexical selection. In Proc. of ACL 1994, pp. 133--138.  ",
      "doi": "10.3115/981732.981751"
    }
  ]
}