{
  "doi": "10.1145/1518701.1519046",
  "title": "Tactile feedback for predictive text entry",
  "published": "2009-04-04",
  "proctitle": "CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2257-2260",
  "year": 2009,
  "badges": [],
  "abstract": "Predictive text entry provides a fast way to enter text on phones and other small devices. Early work on predictive text entry highlighted that the reaction time for checking the screen dominates text entry times. Improving accuracy of predictions brings a downside: as prediction gets better, users will drop the slow operation of checking the screen and will thus miss prediction errors and system feedback/suggestions. In this note, we present an experiment into the use of vibration to alert the user when word completion is likely to aid them, using a dynamic approach based on their current typing speed, and when there are no dictionary matches to their entry. Results show significantly faster entry rates for users with vibration alerts, raising speeds from 20wpm to 23wpm once practiced.",
  "tags": [
    "tactile feedback",
    "mobiles",
    "text entry"
  ],
  "authors": [
    {
      "name": "Mark D. Dunlop",
      "institution": "University of Strathclyde, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100111439/rel-imgonly/2015francesquare.jpg",
      "acmid": "81100111439",
      "orcid": "missing"
    },
    {
      "name": "Finbarr Taylor",
      "institution": "University of Strathclyde, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416601938",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akamatsu, M., MacKenzie, I. S., and Hasbrouq, T. \"A comparison of tactile, auditory, and visual feedback in a pointing task using a mouse-type device,\" Ergonomics 38, 816--827, 1995.",
      "doi": ""
    },
    {
      "text": "Brewster, S.A., and Brown, L. M. \"Tactons: structured tactile messages for non-visual information display,\" in AUIC '04, Darlinghurst, Australia, 15--23, 2004. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "Brewster, S., Chohan, F., and Brown, L. \"Tactile feedback for mobile interactions,\" in Proc. CHI '07, San Jose, USA, 159--162, 2007.  ",
      "doi": "10.1145/1240624.1240649"
    },
    {
      "text": "Card, S. K., Newell, A., and Moran, T. P., The Psychology of Human-Computer Interaction,. Mahwah, NJ, USA: Lawrence Erlbaum Associates, Inc., 2000. ",
      "doi": "10.5555/556022"
    },
    {
      "text": "Clarkson, E., Clawson, J., Lyons, K., and Starner, T. \"An empirical study of typing rates on mini-QWERTY keyboards,\" in CHI '05 extended abstracts, Portland, USA, 1288--1291, 2005.  ",
      "doi": "10.1145/1056808.1056898"
    },
    {
      "text": "Dunlop, M. D. and A. Crossan, \"Predictive text entry methods for mobile phones,\" Personal Technologies 4(2), 134--143, 2000.",
      "doi": ""
    },
    {
      "text": "Dunlop, M. D., Glen, A., Motaparti, S., and Patel, S., \"AdapTex: contextually adaptive text entry for mobiles,\" in Proc. MobileHCI '06, Espoo, Finland, 265--265, 2006.  ",
      "doi": "10.1145/1152215.1152277"
    },
    {
      "text": "Hasselgren, J., Montnemery, E., Nugues, P., and Svensson, M., \"HMS: A Predictive Text Entry Method Using Bigrams,\" in Proc. Workshop on Language Modeling for Text Entry Methods, EACL 03, Budapest, Hungary, 43--49, 2003. ",
      "doi": "10.5555/1628195.1628201"
    },
    {
      "text": "Hoggan, E., Brewster, S.A., and Johnston, J. \"Investigating the effectiveness of tactile feedback for mobile touchscreens,\" in Proc. CHI '08, Florence, Italy, 1573--1582, 2008.  ",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "James, C., and Reischel, K. \"Text input for mobile devices: comparing model,\" in Proc. CHI '01, Seattle, USA, 365--371, 2001.  ",
      "doi": "10.1145/365024.365300"
    },
    {
      "text": "Lee, J. C., Dietz, P. H., Leigh, D., Yerazunis, W. S., and Hudson, S. E., \"Haptic pen: a tactile feedback stylus for touch screens,\" in Proc. UIST '04, Santa Fe, USA, 291--294, 2004.  ",
      "doi": "10.1145/1029632.1029682"
    },
    {
      "text": "MacKenzie, S., \"Mobile text entry using three keys,\" in Proc. NordiCHI '02, Århus, Denmark, 2002, 27--34.  ",
      "doi": "10.1145/572020.572025"
    },
    {
      "text": "MacKenzie, I. S., \"Attention Demands in Text Entry Interfaces,\" in Efficient Text Entry, 2006.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., and Soukoreff, R. W. \"Phrase sets for evaluating text entry techniques,\" in CHI '03 extended abstracts, Lauderdale, USA, 754--755, 2003.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "MacKenzie, I. S., Zhang, X. S., and Soukoreff, R. W., \"Text entry using soft keyboards,\" Behaviour&amp;Information Technology 18(4), 1999.",
      "doi": ""
    },
    {
      "text": "Pavlovych, A., and Stuerzlinger, W., \"Model for non-expert text entry speed on 12-button phone keypads,\" in Proc. CHI '04, Vienna, Austria, 351--358, 2004.  ",
      "doi": "10.1145/985692.985737"
    },
    {
      "text": "Poupyrev, I., and Maruyama, S. \"Tactile interfaces for small touch screens,\" in Proc. UIST '03, Vancouver, Canada, 217--220, 2003.  ",
      "doi": "10.1145/964696.964721"
    }
  ]
}