{
  "doi": "10.1145/29933.275641",
  "title": "Intelligence in interfaces (panel)",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "267-269",
  "year": 1986,
  "badges": [],
  "abstract": "The purpose of this symposium is three-fold:First, by presenting a selection of our work as examples, we seek to define a model of intelligent interaction and illustrate points in the interface process where artificial intelligence can play a role.Second, by comparing the approaches represented in our efforts, we intend to explore a fundamental philosophical difference in the field of intelligent interfaces: the distinction between the power tools vs. the intelligent assistant paradigms. (As part of this discussion, we intend to consider how to mine the rich ground that lies between these two extremes.)Third, by examining the design process underlying our examples, we seek to provide a better understanding of the relationship between AI interface tools and the applications that they communicate with.",
  "authors": [
    {
      "name": "Robert Neches",
      "institution": "Univ. of Southern California, Marina del Rey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327490788",
      "orcid": "missing"
    },
    {
      "name": "John Seely Brown",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100014251",
      "orcid": "missing"
    },
    {
      "name": "Norm Sondheimer",
      "institution": "Univ. of Southern California, Marina del Rey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100309548",
      "orcid": "missing"
    },
    {
      "name": "Tom Malone",
      "institution": "Massachusetts Institute of Technology, Cambridge",
      "img": "/do/10.1145/contrib-81100548740/rel-imgonly/oct2010.jpg",
      "acmid": "81100548740",
      "orcid": "missing"
    },
    {
      "name": "Mike Williams",
      "institution": "Intellicorp, Mountain View, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100006454",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. Balzer, D. Dyer, M. Morgenstern, R. Neches, Specification- Based Computing Environments, in Proceedings of the National Conference on Artificial Intelligence, AAAI, 1983.",
      "doi": ""
    },
    {
      "text": "P.J. Hayes, P.A. Szekeley, R.A. Lerner, Design Alternatives for User Interface Management Systems Based on Experience with COUSIN, in Proceedings of CHI '85, 169-175, 1985.  ",
      "doi": "10.1145/317456.317488"
    },
    {
      "text": "T. Kaczmarek, W. Mark, N. Sondheimer, The Consul/CUE Interface: an Integrated Interactive Environment, in Proceedings of CHI '83, 98-102, 1983.  ",
      "doi": "10.1145/800045.801589"
    },
    {
      "text": "Malone, T.W., Grant, K.R., Turbak, F.A., Brobst, S.A., &amp; Cohen, M.D. Intelligent information sharing systems, Communications of the ACM, in press.  ",
      "doi": "10.1145/22899.22903"
    },
    {
      "text": "R. Neches, R. Balzer, N. Goldman, D. Wile, Transferring Users' Responsibilities to a System: the Information Management Computing Environment, in Proceedings of INTERACT '8~, The First International Conference on Human-Computer Interaction, 421-426, 1984.",
      "doi": ""
    },
    {
      "text": "R. Wilensky, Talking to UNIX in English: An Overview of an On-line UNIX Consultant, in The AI Magazine, 5(1), AAAI, 1984.",
      "doi": ""
    }
  ]
}