{
  "doi": "10.1145/29933.275650",
  "title": "Evolution of an organizational interface: the new business department at a large insurance firm",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "315-322",
  "year": 1987,
  "badges": [],
  "abstract": "This paper describes how the work organization and computer system of the New Business Department at a large life insurance firm have interacted and evolved over time. The dynamics of interaction are explained largely in terms of the economic incentive to reduce the length of transaction processing chains and the more political goal of extending managerial control. It is argued that examining the interaction of organizations and computer systems Can contribute to a better theoretical understanding of the development of large computer systems and offer guidance to designers of user-computer interfaces. A graphical technique for depicting organizational interfaces is presented.",
  "authors": [
    {
      "name": "Andrew Clement",
      "institution": "York Univ., North York, Ont., Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100406488",
      "orcid": "missing"
    },
    {
      "name": "Calvin Carl Gotlieb",
      "institution": "Univ. of Toronto, Toronto, Ont., Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452617735",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Attewell, P. and Rule, J. Computing and organizations: What we know and what we don't know. Commun. ACM27, 12 (Dec. 1984), 1184-1192.  ",
      "doi": "10.1145/2135.2136"
    },
    {
      "text": "Baran, B. Office automation and the technological transformation of the insurance industry. In M. Castells (FEd.), High Technology, Sage, Beverley Hills, 1985, pp. 142-171.",
      "doi": ""
    },
    {
      "text": "Braverman, H. Labour and Monopoly Capital: The Degradation of Work in the Twentieth Century. Monthly Review Press, New York, 1974.",
      "doi": ""
    },
    {
      "text": "Chandler, A. D. Strategy and Structure: Chapters in the History of American Enterprise. MIT Press, Cambridge, Mass., 1962.",
      "doi": ""
    },
    {
      "text": "Clement, A. Managerial Control and On-line Processing at a Large Insurance Firm. Ph.D dissertation, Dept. of Computer Science, University of Toronto, 1986. ",
      "doi": "10.5555/912969"
    },
    {
      "text": "Cooley, M. Architect or Bee: The Human~Technology Relationship. Langley Technical Services, Slough, England, 1980.",
      "doi": ""
    },
    {
      "text": "De Marco, T. Structured Analysis and Systems Specification. Prentice-Hall, Englewood Cliffs, New Jersey, 1980.",
      "doi": ""
    },
    {
      "text": "Feldberg, R., and Glenn, E. N. New technology and its implications in U.S. clerical work. In D. Marschall and J. Gregory (Eds.), Office Automation: Jekyll or Hyde?, Working Women Education Fund, Cleveland, Ohio, 1983, pp. 89-95.",
      "doi": ""
    },
    {
      "text": "Gane, C. and Sarson, T. Structured Systems Analysis, Prentice-Hall, Englewood Cliffs, New Jersey, 1979. ",
      "doi": "10.5555/578524"
    },
    {
      "text": "Howard, R. UTOPIA: Where workers craft new technology. Technology Review, (April 1985), 43-49.",
      "doi": ""
    },
    {
      "text": "Kling, R. Social analyses of computing: Theoretical perspectives in recent empirical research. Computing Surveys 12, 1 (March 1980), 61-110.  ",
      "doi": "10.1145/356802.356806"
    },
    {
      "text": "Kraft, P. Programmers and Managers: The Routinization of Programming in the U. S. Springer Verlag, New York, 1977. ",
      "doi": "10.5555/538052"
    },
    {
      "text": "Malone, T. Designing organizational interfaces. Proceedings of the CHI'85 Conference on Human Factors in Computing Systems, (San Francisco, April 14- 18, 1985), ACM, New York, 1985, pp. 66-71.  ",
      "doi": "10.1145/317456.317469"
    },
    {
      "text": "Matteis, R. J., The new back office focusses on customer service. Harvard Business Review, (March-April, 1979), 146-159.",
      "doi": ""
    },
    {
      "text": "Mowshowitz, A. \"Social change in the computer revolution.\" (mimeo), Science and Technology Studies Division, Rensselaer Polytechnic Institute, Troy, New York, 1983.",
      "doi": ""
    },
    {
      "text": "Mumford, E. Successful systems design. In H. Otway and M. Peltu (Eds.), New Office Technology: Human and Organizational Aspects, Ablex, Norwood, New Jersey, 1983.",
      "doi": ""
    },
    {
      "text": "Noble, D. America by Design: Science, Technology and the Rise of Corporate Capitalism. Oxford University Press, Oxford, 1977.",
      "doi": ""
    },
    {
      "text": "Noble, D. Forces of Production: A Social History of Industrial Automation. Alfred Knopf, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Nygaard, K. Workers' participation in system development. In A. Mowshowitz (Ed.), Human Choice and Computers, North-Holland, Amsterdam, 1980, 71-75.",
      "doi": ""
    },
    {
      "text": "Robey, D. Computer information systems and organizational structure. Commun. ACM 24, 10 (1980), 679- 687.  ",
      "doi": "10.1145/358769.358786"
    },
    {
      "text": "Taylor, F. Principles of Scientific Management. Norton, New York, 1967, (original published 1911).",
      "doi": ""
    },
    {
      "text": "Turner, J. Computer mediated work: The interplay between technology and structured jobs. Coramun. ACM 27, 12 (1984), 1210-1217.  ",
      "doi": "10.1145/2135.2139"
    },
    {
      "text": "U.S. Congress, Office of Technology Assessment. Automation of America's Offices. OTA-CIT-287, U.S. Government Printing Office, Washington, D.C., December, 1985.",
      "doi": ""
    }
  ]
}