{
  "doi": "10.1145/29933.30868",
  "title": "The definition, editing, and contouring of surfaces for the analysis of field problems",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "109-114",
  "year": 1987,
  "badges": [],
  "abstract": "This paper reports on an interactive system for manipulating a tensor-product B-spline approximation to field data for applications in which contours are of interest. The features of the system are: an interpolation technique for approximating fields defined from scattered or gridded data by tensor-product B-splines, an interactive display providing control-vertex manipulation of the resulting B-spline approximation, and a contouring algorithm that is designed specifically for B-spline surfaces.",
  "authors": [
    {
      "name": "Robert R. Dickinson",
      "institution": "University of Waterloo, Department of Systems Design, Waterloo Ont., N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607545",
      "orcid": "missing"
    },
    {
      "name": "Richard H. Bartels",
      "institution": "University of Waterloo, Computer Graphics Laboratory, Department of Computer Science, Waterloo Ont. N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100508844",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R.H. Bartels, J. C. Beatty, and B. A. Barsky, An Introduction to the Use of Splines in Computer Graphics, Morgan Kaufmann Publishers, Los Altos, California (1987). ",
      "doi": "10.5555/26962"
    },
    {
      "text": "W. Boehm, G. Farin, and J. Kahmann, A Survey of Curve and Surface Methods in CAGD, Computer Aided Geometric Design 1(1) pp. 1-60 (lg84).  ",
      "doi": "10.1016/0167-8396%2884%2990003-7"
    },
    {
      "text": "G C. de Boor, A Practical Guide to Splines, Springer-Verlag (1978).",
      "doi": ""
    },
    {
      "text": "E. Cohen, T. Lyche, and R. Riesenfeld, Discrete B-splines and Subdivision Techniques in Computer-Aided Geometric Design and Computer Graphics, Computer Graphics and Image Processing 14(2) pp. 87-111 (1980).",
      "doi": ""
    },
    {
      "text": "A. I. Kulikov and G. S. Rivin, Mapping Fields of the Meteorological Elements Given at the Nodes of a Latitude Longitude Grid, Meteorol. and Gidrol. (Meteorology and Hydology) (U.S.S.R.) 1 pp. 41-48 (1982).",
      "doi": ""
    },
    {
      "text": "C. L. Lawson and R. J. Hanson, Solving Least Squares Problems, Prentice Hall (1974).",
      "doi": ""
    },
    {
      "text": "J. F. Lyness and L. Asquith, A Simple Contour Plotting Program for Finite Element Output, Advanced Eng. Software ,5(1) pp. 23-31 (1983).",
      "doi": ""
    },
    {
      "text": "D. J. McConalogue, A quasi-intrinsic scheme for passing a smooth curve through a discrete set of points, Computer Journal 13(4) pp. 392-396 (1970).",
      "doi": ""
    },
    {
      "text": "I. G. Moore, Automatic Contouring of Geological Data, 15th APCOM Symposium, pp. 209-219 (1977).",
      "doi": ""
    },
    {
      "text": "C.S. Petersen, Adaptive contouring of threedimensional surfaces, Computer Aided Geometric Design 1 pp. 61-74 (1984).",
      "doi": ""
    },
    {
      "text": "A. Preusser, Computing Contours by Successive Solution of Quintic Polynomial Equations, ACM Trans. on Math. Software 10(4) pp. 463-472 (1984).  ",
      "doi": "10.1145/2701.2770"
    },
    {
      "text": "A. Preusser, Algorithm 626 -- TRICP: A contour plot program for triangular meshes, ACM Trans. on Math. Software 10(4) pp. 473-475 (1984).  ",
      "doi": "10.1145/2701.2772"
    },
    {
      "text": "B. D. Ripley, Spatial Statistics, John Wiley &amp; Sons (1981).",
      "doi": ""
    },
    {
      "text": "P. SablonniSre, Bernstein-Bgzier Methods for the Construction of Bivariate Spline Approximants, Computer Aided Geometric Design - Surfaces in CAGD '84, pp. 29-36 North-Holland, Amsterdam, (1985).",
      "doi": ""
    }
  ]
}