{
  "doi": "10.1145/29933.30871",
  "title": "Positioning human factors in the user interface development chain",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "125-131",
  "year": 1987,
  "badges": [],
  "abstract": "Human factors professionals are not completely free to support the optimization of user interface design within the time span of individual software development projects. Interface design is constrained by conservative forces, such as the expectations of users of existing systems in the installed base and emerging de facto or formal standards. At the same time, human factors involvement with a particular product may ultimately have its greatest impact on future product releases. In this paper we explore an expanded time line for influencing product design. This time line brings middle- and upper-management concerns into focus, revealing critical opportunities for effectively positioning and applying human factors resources.",
  "authors": [
    {
      "name": "Jonathan Grudin",
      "institution": "MCC, P.O. Box 200195, Austin, TX",
      "img": "/do/10.1145/contrib-81100031531/rel-imgonly/jonathan_grudin.jpg",
      "acmid": "81100031531",
      "orcid": "missing"
    },
    {
      "name": "Susan F. Ehrlich",
      "institution": "Wang Laboratories, Inc., One Industrial Ave, Lowell, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100368806",
      "orcid": "missing"
    },
    {
      "name": "Rick Shriner",
      "institution": "Wang Laboratories, Inc., One Industrial Ave, Lowell, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100282844",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aucella, A. F. and Ehrlich, S. F., 1986. Voice messaging enhancing the user interface design based on field performance. In Proc. CHI'86 Human Factors in Computing Systems, (Boston, April 13-17, 1986), ACM, New York, pp. 156-161.  ",
      "doi": "10.1145/22627.22365"
    },
    {
      "text": "Boar, B. H., 1984. Application prototyping: A requirements definition strategy for the 80's. New York: John Wiley &amp; Sons, Inc. ",
      "doi": "10.5555/2285"
    },
    {
      "text": "Boehm, B. W., 1984. Software life cycle factors. In Vick, C. R. and Ramamoorthy, C. V., (Eds.) 1984. Handbook of software engineering. New York: Van Nostrand Reinhold Company.",
      "doi": ""
    },
    {
      "text": "Curtis, B., Krasner, H., Shen, V. and {scoe, N., 1987. Initial results from a field study of large software development projects. Manuscript in preparation.",
      "doi": ""
    },
    {
      "text": "De Marco, T., 1978. Structured analysis and system specification. New York: Yourdon Press, Inc.",
      "doi": ""
    },
    {
      "text": "Ehrlich, S. F., 1987. Social and psychological factors influencing the design of office communication systems. In this volume.  ",
      "doi": "10.1145/29933.275651"
    },
    {
      "text": "Fox, J. M., 1982. Software and its development. Englewood Cliffs, N. J.: Prentice-Hall, Inc. ",
      "doi": "10.5555/539194"
    },
    {
      "text": "Gould, J. D. and Lewis, C. Designing for usability -- Key principals and what designer think. In Proc. CHI'83 Human Factors in Computing Systems, (Boston, December 12-15, 1983), ACM, New York, pp. 50-53.  ",
      "doi": "10.1145/800045.801579"
    },
    {
      "text": "Grudin, J., 1986. Designing in the dark: Logics that compete with the user. In Proc. CHI'86 Human Factors in Computing Systems, (Boston, April 13-17, 1986), ACM, New York, pp. 281-284.  ",
      "doi": "10.1145/22627.22384"
    },
    {
      "text": "Gunther, R. C., 1978. Management methods for software product engineering. New York: John Wiley &amp; Sons, Inc. Jensen, R. W. and Tonies, C. C. (Eds.), 1979. Software engineering. Englewood Cliffs, N. J.: Prentice-Hall, Inc. ",
      "doi": "10.5555/540018"
    },
    {
      "text": "Kane, R. M. and Yuschik, M., 1987. A case example of human factors in product definition: Needs finding for a voice workstation for the blind. In this volume.  ",
      "doi": "10.1145/29933.30862"
    },
    {
      "text": "Mantel, M., 1986. Techniques for incorporating human factors in the software lifecycle. Proceedings of STA- III conference: Structured techniques in the eighties: practice and prospect, Chicago, June 1986.",
      "doi": ""
    },
    {
      "text": "Metzger, P. W., 1981. Managing a programming project. Englewood cliffs, N. J.: Prentice-Hall, Inc. ",
      "doi": "10.5555/23258"
    },
    {
      "text": "Norman, D. A. and Fisher, D., 1982. Why alphabetic keyboards are not easy to use: Keyboard layout doesn't much matter. Human Factors, 24, 509 - 515.\"",
      "doi": ""
    },
    {
      "text": "Rubin, M. L, 1970. Introduction to the system life cycle. Handbook of data processing management volume 1. Princeton, N. J. : Brandon/Systems Press.",
      "doi": ""
    },
    {
      "text": "Rubinstein, R. and Hersh, H., 1984. The human factor. Bedford, Mass.: Digital Press.",
      "doi": ""
    },
    {
      "text": "Vick, C. R. and Ramamoorthy, C. V., (Eds.) 1984. Handbook of software engineering. New York: Van Nostrand Reinhold Company. ",
      "doi": "10.5555/767"
    },
    {
      "text": "Wigander, K., Svensson, A., Schoug, L., Rydin, A., Dahlgren, C., 1979. Structured analysis and design of information systems. New York: McGraw-Hill, Inc. ",
      "doi": "10.5555/577802"
    },
    {
      "text": "Williams, R. D., 1984. Management of software development. In Vick, C. R. and Ramamoorthy, C. V. (Eds.) 1984. Handbook of software engineering. New York: Van Nostrand Reinhold Company.",
      "doi": ""
    },
    {
      "text": "Zimmer, W. L., 1986. Managing design of user computer human interfaces at Digital Equipment Corporation. Notes from panel discussion at CHI'86 Human Factors in Computing Systems, (Boston, April 17, 1986).  ",
      "doi": "10.1145/22627.22393"
    }
  ]
}