{
  "doi": "10.1145/29933.275646",
  "title": "Structural analysis of verbal data",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "297-301",
  "year": 1987,
  "badges": [],
  "abstract": "Current methods of analyzing verbal reports (Protocol Analysis) from human-computer interactions fall short of their potential. Although there are systematic methods for collecting complete and objective verbal reports applicable to a broad range of problem-solving tasks, currently available analyses of verbal reports are ad hoc and apply only to well constrained tasks. Structural Analysis is a systematic method, currently under development, for analyzing real-world tasks involving human-computer interaction. Starting with a rule that assigns utterances to two dichotomous categories related to a behavior of interest, rules are generated that expose the goal building and evaluation underlying that behavior. The resulting data yield time distributions that characterize subjects' goal-directed behavior and that allow comparisons among tasks or among subjects.",
  "tags": [
    "cognitive engineering",
    "verbal data",
    "protocol analysis",
    "problem solving"
  ],
  "authors": [
    {
      "name": "Wayne A. Bailey",
      "institution": "Tektronix, Inc., Beaverton, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100645102",
      "orcid": "missing"
    },
    {
      "name": "Edwin J. Kay",
      "institution": "Lehigh Univ., Bethlehem, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323491911",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "W.A. Bailey and E.J. Kay, \"Towards the Standard Analysis of Verbal Data,\" IEEE Systems, Man, and Cybernetics Proceedings, 1986.",
      "doi": ""
    },
    {
      "text": "K.S. Card, T.P. Moran, andA. Newell, The Psychology of Human-Computer Interaction, Hillsdale, N J: Lawrence Erlbaum Associates, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "K.A. Ericsson and H.A. Simon, Protocol Analys~ Verbal Reports as Data, Cambridge, Mass.: MIT Press, 1984.",
      "doi": ""
    },
    {
      "text": "A. Newell and H.A. Simon, Human Problem Solving, Englewood, N J: Prentice-Hall, 1972. ",
      "doi": "10.5555/1095704"
    }
  ]
}