{
  "doi": "10.1145/29933.275643",
  "title": "Panther: a specification system for graphical controls",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "279-284",
  "year": 1987,
  "badges": [],
  "abstract": "An experimental graphical control specification system, called Panther, has been written in C for UNIX®-based applications. Unlike similar systems, which focus on combining interaction techniques, Panther allows the specification of low-level interactions by invoking user-selectable subroutines for input-device transitions. A Panther interface is specified in a textual table as a set of hierarchically nested regions. Regions can model any control device, such as menu buttons, slider-bars, switches, alphanumeric displays, or even combinations of other regions. Panther does not rely on special hardware, extensive software, or interprocess communication.",
  "authors": [
    {
      "name": "J. I. Helfman",
      "institution": "AT&T Bell Labs, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100125410",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Status Report of the Graphics Standards Committee. Computer Graphics 18, 3 (August 1979).  ",
      "doi": "10.1145/988497.988498"
    },
    {
      "text": "Apollo Computer. DOMAIN System Call Reference, Release 9.0, Vol. 1. Chelmsford, MA, 1985.",
      "doi": ""
    },
    {
      "text": "Blewett, C., Freed, A., Langer, J., Mascitti, R., Rodine, C., and Weber, W. The Aegis System. AT&amp;T Bell Laboratories internal memorandum, May 31, 1985.",
      "doi": ""
    },
    {
      "text": "Burrows, T.A. GOS - A Tool Providing Customer Programmability of Graphical Human Interfaces. AT&amp;T Bell Laboratories internal memorandum, January 14, 1985.",
      "doi": ""
    },
    {
      "text": "Burton, C. .An Introduction to the Interactive Panel Generator. AT&amp;T Bell Laboratories internal memorandum, January 8, 1985.",
      "doi": ""
    },
    {
      "text": "Buxton, W., Lamb, M., Sherman, D., and Smith, K. Towards a Comprehensive User Interface Management System. In Computer Graphics, Vol. 17, No. 3, ACM SIGGRAPH, July 1983, pp. 35-42.  ",
      "doi": "10.1145/800059.801130"
    },
    {
      "text": "FORMAL: A Forms-Oriented, Visual-Directed Application Development System. COMPUTER 18, 8 (August 1985), 38-49.",
      "doi": ""
    },
    {
      "text": "Lipkie, D.E. Star Graphics: An Object-Oriented Implementation. In Computer Graphics, Vol. 16, No. 3, ACM SIGGRA.PH, July 1982, pp. 115-124.  ",
      "doi": "10.1145/800064.801270"
    },
    {
      "text": "Myers, B.A. and Buxton, W. Creating Highly- Interactive and Graphical User Interfaces by Demonstration. In Computer Graphics, Vol. 20, No. 4, ACM SIGGRAPH, August 1986, pp. 249- 258.  ",
      "doi": "10.1145/15886.15914"
    },
    {
      "text": "Nakatani, L.H. and Rohrlich, J.A. Soft Machines: A Philosophy of User-Computer Interface Design. In CHI '88 Proceedings, ACM SIGCHI, December 1983, pp. 19-23.  ",
      "doi": "10.1145/800045.801573"
    },
    {
      "text": "Pike, R. Graphics in Overlapping Bitmap Layers. ACM Transactions on Graphics 2, 2 (April 1983), 135-160.  ",
      "doi": "10.1145/357318.357322"
    },
    {
      "text": "Puttress, J. and Goguen, H. Incremental Loading of Subroutines at Runtime. AT&amp;T Bell Laboratories internal memorandum, April 9, 1986.",
      "doi": ""
    },
    {
      "text": "Sun Microsystems, Inc. SunView System Programmer's Guide. Mountain View, CA, 1986.",
      "doi": ""
    },
    {
      "text": "Well, G. and Helfman, J. Specification for Animation Using Keyframes (SPANKEY). AT&amp;T Bell Laboratories internal memorandum, November 30, 1984.",
      "doi": ""
    }
  ]
}