{
  "doi": "10.1145/29933.30854",
  "title": "On the parameters of human visual performance: an investigation of the benefits of antialiasing",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "13-19",
  "year": 1987,
  "badges": [],
  "abstract": "A two-part experiment was conducted to investigate the effects of aliasing artifacts and screen resolution on a simple visual recognition task. The results indicate that in many cases far less realism may be necessary in synthetic computer-generated imagery than is often assumed in the literature. The first part of the experiment comprised a subjective rating of image quality, the second part measured task effectiveness of image quality. In the second part subjects were asked to discriminate between images of two types of objects built from cubes, similar to objects used in experiments involving mental rotation.At higher resolutions the elimination of aliasing artifacts did not significantly improve subjects' performance. At intermediate and low resolutions, comparable to what might be used for iconic menus, the reduction in aliasing artifacts resulted in improved performance. The subjective ratings indicate that for both high and low resolution the elimination of aliasing artifacts does not improve “quality,” whereas images rendered at intermediate resolutions are significantly degraded by aliasing artifacts to the extent that antialiasing improves the subjective rating.An interpretation of these results is given in the context of an ongoing research program aimed at identifying the parameters of real-time human performance for graphics workstations.",
  "tags": [],
  "authors": [
    {
      "name": "Kellogg S. Booth",
      "institution": "Computer Graphics Laboratory, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502652847",
      "orcid": "missing"
    },
    {
      "name": "M. Philip Bryden",
      "institution": "Computer Graphics Laboratory, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100532837",
      "orcid": "missing"
    },
    {
      "name": "Wiliam B. Cowan",
      "institution": "Computer Graphics Laboratory, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410592379",
      "orcid": "missing"
    },
    {
      "name": "Michael F. Morgan",
      "institution": "Computer Graphics Laboratory, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405591710",
      "orcid": "missing"
    },
    {
      "name": "Brian L. Plante",
      "institution": "Computer Graphics Laboratory, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100576602",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Peter R. Atherton and Linnda R. Caporael, A subjective judgment study of polygon based curved surface imagery, CHI '85 Proceedings (April, 1985) pp. 27-34.  ",
      "doi": "10.1145/317456.317462"
    },
    {
      "text": "Kellogg S. Booth, William B. Cowan and David R. Forsey, Multitasking support in a graphics workstation, Proceedings 1st International Conference on Computer Workstations (November, 1985) pp. 82-89.",
      "doi": ""
    },
    {
      "text": "Michael F. Cohen and Donald P. Greenberg, The hemi-cube -- A radiosity solution for complex environments, Computer Graphics 19:3 (July, 1985) pp. 31-40.  ",
      "doi": "10.1145/325165.325171"
    },
    {
      "text": "Gary W. Meyer, Holly E. Rushmeier, Michael F. Cohen, Donald P. Greenberg and Kenneth E. Torrance, Assessing the realism of computer graphics images, to appear in ACM Transactions on Computer Graphics.",
      "doi": ""
    },
    {
      "text": "Allen Newell, unpublished address to CHI '85 Conference (April, 1985).",
      "doi": ""
    },
    {
      "text": "Raymond S. Nickerson, Using Computers: The Human Factors of Information Systems, MIT Press (1986) 432 pages. ",
      "doi": "10.5555/5909"
    },
    {
      "text": "Michael W. Schwarz, William B. Cowan and John C. Beatty, An experimental comparison of RGB, YIQ, LAB, HSV and opponent color models, to appear in ACM Transactions on Computer Graphics.  ",
      "doi": "10.1145/31336.31338"
    },
    {
      "text": "Roger N. Shepard and Jacqueline Metzler, Mental rotation of three-dimensional objects, Science 171 (1971) pp. 701-703.",
      "doi": ""
    },
    {
      "text": "Colin Ware and John C. Beatty, Using colour to display structures in multidimensional discrete data, Color Research and Application 11 (June, 1986) pp. $11-S14.",
      "doi": ""
    },
    {
      "text": "Marceli Wein, personal communication.",
      "doi": ""
    }
  ]
}