{
  "doi": "10.1145/29933.275624",
  "title": "Intelligent help in a one-shot dialog: a protocol study",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "163-168",
  "year": 1987,
  "badges": [],
  "abstract": "A database of 150 interactions conducted via electronic mail was analyzed. The database had been constructed as an on-line tool for users and advisors, but the interactions can also be regarded as modelling intelligent help dialog in which posing a query and providing a response are each accomplished in “one-shot”. The types of questions users ask and the advisory strategies employed for imcomplete queries without follow-up questioning are described. The goal is to understand this new on-line tool for advising and its implications as a model of one-shot intelligent help dialogs.",
  "tags": [
    "intelligent help",
    "advisory dialogs"
  ],
  "authors": [
    {
      "name": "Amy Aaronson",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351595037",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aaronson, A. and Carroll, J.M. Understanding intelligent help: A protocol analysis of advisory interactions. IBM Research Report, IBM Watson Research Center, Yorktown Heights, N.Y., 1987.",
      "doi": ""
    },
    {
      "text": "Alty, J.L. and Coombs, M.J. Communicating with university computer users: A case study. In M.J. Coombs &amp; J.L. Alty (Eds.), Computing skills and the user interface. Academic Press, London, 1981, 7-71.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. and McKendree, J. Interface design issues for advice-giving expert systems. Communications of the ACM, January, 1987.  ",
      "doi": "10.1145/7885.7886"
    },
    {
      "text": "Houghton, R.C., Online help systems: A conspectus. Communications of the ACM, 27, (1984), 126-133.  ",
      "doi": "10.1145/69610.357985"
    },
    {
      "text": "Kidd, A. The consultative role of an expert system. Proceedings of Conference on HCI, Norwich, United Kingdom, 1985.",
      "doi": ""
    },
    {
      "text": "Mack, R.L., Lewis, C.H., and Carroll, J.M. Learning to use office systems: Problems and prospects. ACM Transactions on Office Information Systems, 1, (1983), 254-271.  ",
      "doi": "10.1145/357436.357440"
    },
    {
      "text": "McKendree J. and Carroll J.M. Advising roles of a computer consultant. ACM CH1 Proceedings, Boston, MA, 1986, 35-40.  ",
      "doi": "10.1145/22627.22345"
    },
    {
      "text": "McKendree, J., McAuhffe, E.A., and Carroll, J.M. When all else fails: Problems brought to a text consultant. IBM Research Report, RC 11639, 1986.",
      "doi": ""
    },
    {
      "text": "Morse, H. and Chess, D.,. PCINFO: End User Support in the 1990s. IBM Research Report, 1987, (in press).",
      "doi": ""
    },
    {
      "text": "Pollack, M.E. Information sought and information provided: An empirical study of user/expert dialogs. ACM CHI Proceedings, San Francisco, CA, (1985), 155-159.  ",
      "doi": "10.1145/317456.317486"
    },
    {
      "text": "Rich, E.A. Programs as data for their help systems. AFIPS Conference Proceedings, Vol. 51, (1985) National Computer Conference, Houston, Texas, 481-485.",
      "doi": ""
    }
  ]
}