{
  "doi": "10.1145/29933.30874",
  "title": "Automated lip-synch and speech synthesis for character animation",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "143-147",
  "year": 1987,
  "badges": [],
  "abstract": "An automated method of synchronizing facial animation to recorded speech is described. In this method, a common speech synthesis method (linear prediction) is adapted to provide simple and accurate phoneme recognition. The recognized phonemes are then associated with mouth positions to provide keyframes for computer animation of speech using a parametric model of the human face.\nThe linear prediction software, once implemented, can also be used for speech resynthesis. The synthesis retains intelligibility and natural speech rhythm while achieving a “synthetic realism” consistent with computer animation. Speech synthesis also enables certain useful manipulations for the purpose of computer character animation.",
  "authors": [
    {
      "name": "J. P. Lewis",
      "institution": "Computer Graphics Laboratory, New York Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409595942",
      "orcid": "missing"
    },
    {
      "name": "F. I. Parke",
      "institution": "Computer Graphics Laboratory, New York Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100304539",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Programs for Digital Signal Processing. IEEE Press, 1979. ",
      "doi": "10.5555/539951"
    },
    {
      "text": "Bergeron, P., and Lachapelle, P. Controlling facial expressions and body movements in the computergenerated animated short \"Tony de Peltrie'. Siggraph Tutorial notes. 1985.",
      "doi": ""
    },
    {
      "text": "Flanagnn, J. Speech Analysis, Synthesis, and Perception. Springer-Verlag, New York, 1965.",
      "doi": ""
    },
    {
      "text": "Levinson, N. The Wiener RMS (root mean square) error criterion in filter design and prediction. J. Math. Phys. 25, 1947, 261-278.",
      "doi": ""
    },
    {
      "text": "Lewis, J.P. Methods for stochastic spectral synthesis. Proceedings, Graphics Interface. 1986. ",
      "doi": "10.5555/16564.16594"
    },
    {
      "text": "Lewis, J.P. and Purcell, P. Soft Machine: a personable interface. Proceedings, Graphics Interface. May 1984, 223-.226.",
      "doi": ""
    },
    {
      "text": "Markel, J. and Gray, A. Linear Prediction of Speech. Springer-Verlag, New York, 1970. ",
      "doi": "10.5555/578111"
    },
    {
      "text": "Parke, F. A Parametric Model for Human Faces. PhD. Dissertation, U. of Utah, 1974. ",
      "doi": "10.5555/907312"
    },
    {
      "text": "Parke, F. Parameterized models for facial animation. IEEE CG~A. 9, 2, Nov. 1982, 61-08.",
      "doi": ""
    },
    {
      "text": "Pearce, A., Wyvill, B., Wyvill, G., Hill, D. Speech and expression: a computer solution to face animation. Proceedings, Graphics Interface. 1980, 130-140. ",
      "doi": "10.5555/16564.16588"
    },
    {
      "text": "Rabiner, b. and Sehafer, R. Digital Processing of Speech Signals. Prentice Hall, Englewood Cliffs, N.J., 1979.",
      "doi": ""
    },
    {
      "text": "Well, P. About Face: Computergraphic Synthesis and Manipulation of Facial Imagery. M.S. Thesis, Massachusetts Institute of Technology, 1982.",
      "doi": ""
    },
    {
      "text": "Witten, I. Principles of Computer Speech. Academic Press, London, 1982. ",
      "doi": "10.5555/538758"
    },
    {
      "text": "Lewis, J.P. LispScore Manual, Squonk Manual. NYIT internal documentation, 1984,80.",
      "doi": ""
    }
  ]
}