{
  "doi": "10.1145/29933.275651",
  "title": "Social and psychological factors influencing the design of office communications systems",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "323-329",
  "year": 1986,
  "badges": [],
  "abstract": "Office automation is used by groups of people with complex communication needs to help them reach business goals such as scheduling, tracking, reviewing, and delegating. Effective individual and group decisions are heavily dependent on communication protocols and social conventions. Because these conventions are so ingrained, they are sometimes not readily available to conscious inspection during the design of communication systems. Even more problematic, system designers may not have first hand knowledge of the conventions and protocol for the range of environments in which their systems will be used. Nevertheless, office systems must work in tandem with these conventions. Wang Laboratories has a continuing program of research directed at identifying the psychological and social factors that come into play during the adoption and use of computer communication systems and the implications of these factors for the design of those systems. Highlights of a three year program of research are presented covering implications for voice mail, electronic mail, and electronic calendars.",
  "authors": [
    {
      "name": "Susan F. Ehrlich",
      "institution": "Wang Laboratories, Lowell, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100368806",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aucella, A.F. &amp; FEhrlich, S.F. \"Voice Messaging: Enhancing the user interface design based on field performance\", Prnc. CHI'86 Human Factors in Computing Systems (Boston, April 13-17, 1986), ACM, New York, pp. 156-161.  ",
      "doi": "10.1145/22627.22365"
    },
    {
      "text": "Bannon, L.J. \"Computer Mediated Communication\". In User Centered System Design: New Perspectives on Human-Computer Interaction (Ed.) D.A. Norman and S.W. Draper, Hillsdale, New Jersey: Earlbaum, 1985.",
      "doi": ""
    },
    {
      "text": "Ehrlich, S.F. &amp; Akiba, E.A. \"Successful implementation of voice store and forward technology: A Case Study\", ACM SIGOA Bulletin, 1985 pp. 19-26.  ",
      "doi": "10.1145/1022368.1022374"
    },
    {
      "text": "Gould, J.D. and Boies, S.J. \"Speech Filing - An office system for principals\", IBM Systems Journal, 1984, 2_3, 65-81.",
      "doi": "10.1147/sj.231.0065"
    },
    {
      "text": "Hiltz S.R. and Turoff, M. The Network Nation: Human Communication via Computer. Reading , Mass.: Addison-Wesley, 1978. ",
      "doi": "10.5555/151072"
    },
    {
      "text": "Palme, J. \"Survey of computer-based message systems\", Proc. lteract'84 First IFIP Conference on 'Human-Computer Interaction' (London Sept. 4-7, 1984), Elsevier Science Publishers, Amsterdam, pp. 1.263-1.268.",
      "doi": ""
    },
    {
      "text": "Malone, T.W. \"Designing organizational interfaces\" Prnc. CHI'85 Human Factors in Computing Systems (San Francisco, April 14-16, 1985), ACM, New York, pp. 66-71.  ",
      "doi": "10.1145/317456.317469"
    },
    {
      "text": "Malone, T.W., Grant, K.R., Turbak, F.A. \"The information lens: An intelligent system for information sharing in Organizations.\" Proc. CHI' 86 Human Factors in Computing Systems (Boston, April 13-17, 1986), ACM, New York, pp. 1-8.  ",
      "doi": "10.1145/22627.22340"
    },
    {
      "text": "Perlman, G. \"Usenet: Doing research on the network\". UNLX/World, December, 1985, pp. 75-81.",
      "doi": ""
    },
    {
      "text": "Reichwald, R. \"Cooperation in the office - Office communication systems as a management tool\", Proc. Second ACM-SIGOA Conference on Office Information Systems (Toronto, June 25-27, 1984), ACM, New York pp. 212-218.  ",
      "doi": "10.1145/800023.808350"
    },
    {
      "text": "Ehrlich, S.F., Barrows, P.Q., &amp; Akiba, E.A. Human Factors of answering machines. Internal Wang research report, 1984.",
      "doi": ""
    },
    {
      "text": "Ehrlich, S.F., Cooper, D.J., &amp; Akiba, E.A. Implementation of DVX at a cigarette manufacturer. Internal Wang research report, 1984.",
      "doi": ""
    },
    {
      "text": "Ehrlich, S.F., Barrows, p.Q., &amp; Akiba, E.A. Implementation of DVX at an oil company. Internal Wang research report, 1984.",
      "doi": ""
    },
    {
      "text": "DiCecco, J., Akiba, E.A., &amp; Munson, V.K. Study of Wang's Alliance Calendar. Internal Wang research report, 1984.",
      "doi": ""
    },
    {
      "text": "DiCecco, J. Study of Meeting Scheduling. Internal Wang research report, 1984.",
      "doi": ""
    },
    {
      "text": "Ehrlich, S.F. &amp; DiCecco, J. Study of team use of electronic calendars. Internal Wang research report, 1984.",
      "doi": ""
    }
  ]
}