{
  "doi": "10.1145/29933.30853",
  "title": "Why reading was slower from CRT displays than from paper",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "7-11",
  "year": 1986,
  "badges": [],
  "abstract": "Experiments, including our own (Gould et al., 1982; 1984; 1986), have shown that people read more slowly from CRT displays than from paper. Here we summarize results from a few of our fifteen experiments that have led us to conclude that the explanation centers on the image quality of the CRT characters. Reading speeds equivalent to those on paper were found when the CRT displays contained character fonts that resembled those on paper (rather than dot matrix fonts, for example), had a polarity of dark characters on a light background, were anti-aliased (e.g., contained grey level), and were shown on displays with relatively high resolution (e.g., 1000 x 800). Each of these variables probably contributes something to the improvement, but the trade-offs have not been determined. Other general explanations for the reading speed difference that can be excluded include some inherent defect in CRT technology itself or personal variables such as age, experience, or familiarity at reading from CRT displays.",
  "authors": [
    {
      "name": "John D. Gould",
      "institution": "IBM Thomas J. Watson Research Center, Hawthorne, P. O. Box 704, Yorktown Heights, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406593839",
      "orcid": "missing"
    },
    {
      "name": "Lizette Alfaro",
      "institution": "IBM Thomas J. Watson Research Center, Hawthorne, P. O. Box 704, Yorktown Heights, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100255430",
      "orcid": "missing"
    },
    {
      "name": "Rich Finn",
      "institution": "IBM Thomas J. Watson Research Center, Hawthorne, P. O. Box 704, Yorktown Heights, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100359304",
      "orcid": "missing"
    },
    {
      "name": "Brian Haupt",
      "institution": "IBM Thomas J. Watson Research Center, Hawthorne, P. O. Box 704, Yorktown Heights, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100288839",
      "orcid": "missing"
    },
    {
      "name": "Angela Minuto",
      "institution": "IBM Thomas J. Watson Research Center, Hawthorne, P. O. Box 704, Yorktown Heights, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100404914",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bantz, D and Gupta, S. (1984). Yoda 0.2 Principles of Operation. IBM Research Center, Internal Publication.",
      "doi": ""
    },
    {
      "text": "Bauer, D. &amp; Cavonius, C. R. Improving the legibility of visual display units through contrast reversal. In E. Grandjean &amp; E. Vigliani (Ed.) Ergonomic Aspects of Visual Display Terminals. Taylor &amp; Francis, London, 137-142",
      "doi": ""
    },
    {
      "text": "Cushman, W. H. (1986). Reading from microfiche, a VDT, and the printed page; subjective fatigue and performance. Human Factors, 28, 63-73. ",
      "doi": "10.1177/001872088602800107"
    },
    {
      "text": "Gould, J. D. &amp; Grischkowsky, N. (1982). Doing the same work with a CRT terminal and with hardcopy. Proceedings of the Human Factors Society Meeting. Seattle, 165-166.",
      "doi": ""
    },
    {
      "text": "Gould, J. D. &amp; Grischkowsky, N. (1984). Doing the same work with hardcopy and with cathode ray tube (CRT) computer terminals. Human Factors, 26, 323-337.",
      "doi": ""
    },
    {
      "text": "Gould, J. D. and Grischkowsky, N. (1986) Does Visual Angle Affect Reading Speed? Human Factors, 28, 165-173.",
      "doi": ""
    },
    {
      "text": "Gould, J. D. (1986). Why reading is slower from CRT displays than from Paper: Some experiments that fail to explain why. Human Factors, 1986 (in press). (Presently available as IBM Research Report, RC-11079, 1986.)",
      "doi": ""
    },
    {
      "text": "Gould, J. D., Alfaro, L., Finn, R., Haupt, B., Minuto, A. Reading from CRT displays can be as fast as reading from paper. IBM Research Report, RC-12083, 1986.",
      "doi": ""
    },
    {
      "text": "Gould, J. D., Alfaro, L., Finn, R., Haupt, B., Minuto, A., and Salaun, J. Why is reading slower from CRT displays than from paper? In Proceedings of the Annual Human Factors Society Meeting, Dayton, Ohio, October, 1986, 834-836.",
      "doi": ""
    },
    {
      "text": "Gupta, S., Bantz, D., Sholtz, Evangelisti, and DeOrazio, W.R. (1986). YODA: an advanced display for personal computers. IBM Research Report, RC-11618.",
      "doi": ""
    },
    {
      "text": "Heppner, F. H., Anderson, J. G. T., Farstrup, A.E., &amp; Weiderman, N.H. (1985). Reading performance on a standardized test is better from print than from computer display. Journal of Reading, 321-325.",
      "doi": ""
    },
    {
      "text": "Kak, A. V. Relationships between readability of printed and CRT-displayed text. In Proceedings of the 1981 Human Factors Society Meetings, Rochester, New York, 137-140. (Can be obtained from the Human Factors Society, Box 1369, Santa Monica, California 90406)",
      "doi": ""
    },
    {
      "text": "Kruk, R. S. and Muter, P. (1984). Reading of continuous text on video screens. Human Factors, 26, 339-346.",
      "doi": ""
    },
    {
      "text": "Mills, C. B. &amp; Weldon, L. J. (1984). Reading from computer screens. University of Maryland Human/Computer Interaction Laboratory, CAR-TR- 94.",
      "doi": ""
    },
    {
      "text": "Muter, P., Latremouille, S. A., Treuniet, W. C., and Beam, P. (1982). Extended readings of continuous text on television screens. Human Factors, 24, 501-508.",
      "doi": ""
    },
    {
      "text": "Sholtz, P. N. (1984). Making high-quality colored images on raster displays. IBM Research Report, RC-9632.",
      "doi": ""
    },
    {
      "text": "Switchenko, D. (1984). Reading from CRT versus Paper: the CRT-disadvantage hypothesis re-examined. In Proceedings of the 28th annual meeting of the Human Factors Society. San Antonio, p. 429.",
      "doi": ""
    },
    {
      "text": "Tinker, M. A. (1963). Legibility of Print. Ames, Iowa: Iowa State University Press.",
      "doi": ""
    },
    {
      "text": "Wright, P. and Lickorish, A. (1983). Proof-reading texts on screen and paper. Behaviour and Information Technology, 2(3), 227-235.",
      "doi": ""
    }
  ]
}