{
  "doi": "10.1145/29933.30872",
  "title": "The interface is often not the problem",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "133-136",
  "year": 1987,
  "badges": [],
  "abstract": "Computer systems in the form of tools for specific functions within a work environment are becoming increasingly common. Because the users are not computer experts, and because the introduction of the new tools can dramatically change their tasks, problems arise. It is argued that even if the proper design of the MMI is very important, this will not solve all the problems. More basic problems concern what functions should be included in the system and how the users can understand what the system can do in different work situations and how the response should be evaluated in the context of the work situations. This is demonstrated by experiences from application projects. It is concluded that more research must be devoted to these problem areas. Another important result is the fact that the possibilities to develop more generally applicable computer based tools are limited. Adaption to local circumstances and needs is usually a necessity.",
  "authors": [
    {
      "name": "Bengt Goransson",
      "institution": "Uppsala University Data Center, Box 2103, S-750 02 Uppsala, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057078",
      "orcid": "missing"
    },
    {
      "name": "Mats Lind",
      "institution": "Uppsala University Data Center, Box 2103, S-750 02 Uppsala, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100540194",
      "orcid": "missing"
    },
    {
      "name": "Else Pettersson",
      "institution": "Uppsala University Data Center, Box 2103, S-750 02 Uppsala, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100535261",
      "orcid": "missing"
    },
    {
      "name": "Bengt Sandblad",
      "institution": "Uppsala University Data Center, Box 2103, S-750 02 Uppsala, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100282336",
      "orcid": "missing"
    },
    {
      "name": "Patrik Schwalbe",
      "institution": "Uppsala University Data Center, Box 2103, S-750 02 Uppsala, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100631568",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Schneider, W., Lind, M., Allard, R. and Sandblad, B. Human cognition and human computer interaction in Readings on Cognitive Ergonomics - Mind and Computers. Van der Veer et al. ads. Springer Verlag (1984). ",
      "doi": "10.5555/2815.2820"
    },
    {
      "text": "Norman, Donald A. Cognitive Engineering in D.A.Norman &amp; S.Draper (Eds.) User Centered System Design. Hillsdale, N.Y: Lawrence Erlbaum Associatives ( ! 986).",
      "doi": ""
    },
    {
      "text": "Lundeberg, M., Goldkuhl, G., Nilsson, A. Information Systems Development: A Systematic Approach. Prentice-Hall ( 1981 ). ",
      "doi": "10.5555/578262"
    },
    {
      "text": "Galliers, Robert D. An approach to information needs analysis, in Proceedings of the Interact' 84 eel. 1. Elsevier science publishers B.V. (1984).",
      "doi": ""
    },
    {
      "text": "Sandblad, B., Lind, M., Schneider, W. Requirements for human computer interfaces in health care in Human-computer communications in health care. Peterson, H. E. and Schneider, W. eds. Elsevier science publishers B.V. (1986).",
      "doi": ""
    }
  ]
}