{
  "doi": "10.1145/29933.30861",
  "title": "Experiences with the alternate reality kit: an example of the tension between literalism and magic",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "61-67",
  "year": 1987,
  "badges": [],
  "abstract": "This paper presents an overview of the Alternate Reality Kit (ARK), an animated environment for creating interactive simulations. ARK is built upon a physical-world metaphor: all objects have an image, a position, a velocity, and can experience forces. Users manipulate objects with a mouse-operated “hand” which enables them to carry and throw objects, to press buttons, and to operate sliders.The interface features are discussed in light of a general user interface tension between literalism and magic. Literal features are defined to be those that are true to the interface's metaphor. Literal features enhance an interface's learnability. Magical features are defined to be those capabilities that deliberately violate the metaphor in order to provide enhanced functionality. Discussion of each ARK feature includes informal observations of early ARK users, an assessment of the feature's learnability, of its usefulness, and of its position on the magical-literal axis.Even though ARK includes magical features, applications-level users have be trained in a few minutes. Although this paper is about ARK, the tension between literalism and magic raises some interesting questions on its own. Some of these questions are presented briefly in the conclusion.",
  "tags": [],
  "authors": [
    {
      "name": "Randall B. Smith",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659551697",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bewly, W.L., Roberts, T.L., Schroit, D., and Verplank, W.L.\"Human Factors Testing in the design of Xerox's 8010 'Star' Office Workstation.\" Proceedings of the Conference on Human Factors in Computer Systems. (Boston, December 1983) pp. 72-77.  ",
      "doi": "10.1145/800045.801584"
    },
    {
      "text": "Borning, A.H. The Programming Language Aspects of ThingLab, a Constraint-Oriented Simulation Laboratory. ACM Transactions on Programming Languages and Systems 3(4):353-387, October 1982.  ",
      "doi": "10.1145/357146.357147"
    },
    {
      "text": "Card, Moran, and Newell The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, New Jersey, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Carroll, J.M. and Mack, R.L. Metaphor, computing systems, and active learning. Int. J. Man-Machine Studies (1985) 22, pp. 39-57.  ",
      "doi": "10.1016/S0020-7373%2885%2980076-6"
    },
    {
      "text": "Carroll, J.M. and Thomas, J.C. \"Metaphor and the cognitive representation of computing systems.\" Yorkiown Heights; N.Y.: IBM Watson Research Center technical report no. RC 8302. (1980).",
      "doi": ""
    },
    {
      "text": "Gentner, D. \"The structure of analogical models in science.\" Report 4451 (Bolt, Beranek, and Newman, July 1980)",
      "doi": ""
    },
    {
      "text": "Gittins, D. \"Icon-based human-computer interaction.\" Int. J. Man-Machine Studies (1986) 24, pp. 519-543.  ",
      "doi": "10.1016/S0020-7373%2886%2980007-4"
    },
    {
      "text": "Goldberg, A.J., and Robson, D. Smalltalk-80: The Language and its Implementation. Addison-Wesley, Reading, MA, 1983. ",
      "doi": "10.5555/273"
    },
    {
      "text": "Gould, L., and Finzer, W. \"Programming by Rehearsal.\" Technical Report SCL-84-1 (Xerox Palo Alto Research Center, May, 1984). A short version appears in Byte Magazine, Vol. 9 No. 6, June 1984.",
      "doi": ""
    },
    {
      "text": "Halasz, F., and Moran, T.P. \"Analogy Considered Harmful.\" Proceedings of the Conference on Human Factors in Computer Systems. (Gaithersburg, Maryland). March 1982.  ",
      "doi": "10.1145/800049.801816"
    },
    {
      "text": "Norman, D.A. \"Design Principles for Human-Computer Interfaces.\" Proceedings of the Conference on Human Factors in Computer Systems. (Boston, December 1983) pp. 1-10.  ",
      "doi": "10.1145/800045.801571"
    },
    {
      "text": "O'Shea, T. and Smith, R.B. \"Violating the Laws of Nature: Experiments in Understanding Physics by Exploring Alternate Realities.\" To appear in Proceedings of the 1987 Computer Assisted Learning Conference. (Glasgow, 1987).",
      "doi": ""
    },
    {
      "text": "Price, L.A., and Cordova, C.A. \"Use of Mouse Buttons.\" Proceedings of the Conference on Human Factors in Computer Systems. (Boston, December, 1983) pp. 262-266.  ",
      "doi": "10.1145/800045.801623"
    },
    {
      "text": "Smith, R.B. \"The Alternate Reality Kit: An Animated Environment for Creating Interative Simulations.\" Proceedings of the 1986 IEEE Computer Society Workshop on Visual Languages. (Dallas, June 1986) pp. 99-106.",
      "doi": ""
    }
  ]
}