{
  "doi": "10.1145/29933.275633",
  "title": "The user interface and program structure of a graphical VLSI layout editor",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "219-225",
  "year": 1987,
  "badges": [],
  "abstract": "In this paper the user interface and program organization of the SYMPLE VLSI symbolic layout editor is examined. The user interface is driven by a small interpreter that is constructed from a LISP-like language at run time and has access to a consistent library of menus and graphical information-gathering functions. To improve maintainability, the editor has been constructed in a modular form with well-defined interfaces.",
  "authors": [
    {
      "name": "Kevin S. B. Szabó",
      "institution": "Univ. of Waterloo, Waterloo, Ont., Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100433648",
      "orcid": "missing"
    },
    {
      "name": "Mohamed I. Elmasry",
      "institution": "Univ. of Waterloo, Waterloo, Ont., Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100442960",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "K. S. B. Szabo and M. I. Elmasry, Symple: A Process Independent Symbolic Layout Tool For Bipolar VLSI, Proceedings of ICCD, 1984, IEEE, Port Chester, New York, 474-47.",
      "doi": ""
    },
    {
      "text": "K. S. B. Szabo, J. M. Leask, and M. I. Elmasry, SYMPLE: A Symbolic Layout Tool For Bipolar and MOS VLSI, lEE Computer Aided Design (In review), 1987, IEE.",
      "doi": ""
    },
    {
      "text": "K. S. B. Szabo, J. M. Leask, and M. I. Elmasry, Symbolic Layout For Bipolar and MOS VLSI, IEEE Transactions on Computer Aided Design of Integrated Circuits and Systems (To Be Published), 1987, IEEE Circuits and Systems Society.",
      "doi": "10.1109/TCAD.1987.1270264"
    },
    {
      "text": "M. I. Elmasry, Digital Bipolar Integrated Circuits, John Wiley and Sons, New York, USA, 1983.",
      "doi": ""
    },
    {
      "text": "J. D. Foley and V. L. Wallace, The Art Natural Graphic Man-Machine Conversation, Proceedings of I.E.E.E., April, 1974, 462-470.",
      "doi": ""
    },
    {
      "text": "P. A. D. Powell and M. I. Elmasry, ICEWATER Language and Interpreter, Design Automation Conference, June, 1984, IEEE, 98-102. ",
      "doi": "10.5555/800033.800781"
    },
    {
      "text": "R. Baecker, Towards An Effective Characterization Of Graphical Interaction, SeiUac H Workshop On Man-Machine Interaction, 1980, North-Holland Publishing Co. IFIP.",
      "doi": ""
    },
    {
      "text": "W. Buxton, An Informal Study Of Selection Positioning Tasks, Proceedings Graphics Interface 1982, May, 1982, NCGA (National Computer Graphics Association), Toronto Ontario, Canada, 323-328.",
      "doi": ""
    },
    {
      "text": "B. Singh, J. C. Beatty, K. S. Booth, and Ryman, A graphics Editor for Benesh Movement Notation, CS-82-41, University of Waterloo Computer Graphics Lab, Waterloo, December, 1982, 120 pages.",
      "doi": ""
    },
    {
      "text": "L. A. Price and C. A. Cordova, Use of Mouse Buttons, CHI Proceedings, December, 1983, IEEE, 262-266.  ",
      "doi": "10.1145/800045.801623"
    },
    {
      "text": "B. Shneiderman, Design Issues and Experimental Results for Menu Selection Systems, CS-TR-1303, CAR-TR-26, University Of Maryland, College Park, July, 1983, 37 pages.",
      "doi": ""
    },
    {
      "text": "M. Pulver, J. Morrison, and K. Szabo, A Graphics Package for Interactive CAD Applications, VLSI Group, University of Waterloo, January, 1985.",
      "doi": ""
    },
    {
      "text": "J. Ousterhout, Caesar: An Interactive Editor For VLSI Layouts., VLSI Design, 4th Qtr, 1981, Palo Alto, California, 34-38.",
      "doi": ""
    },
    {
      "text": "W. M. Newman and R. F. Sproull, Principles Of Interactive Computer Graphics 2nd Edition., McGraw - Hill, 1979. ",
      "doi": "10.5555/5532"
    },
    {
      "text": "J. D. Foley and A. Van Dam, Fundamentals of Interactive Computer Graphics, Addison Wesley, Reading, Massachusetts, 1982. ",
      "doi": "10.5555/6684"
    },
    {
      "text": "M. I. Elmasry, (ed.), Digital VLSI Systems, I.E.E.E. Press, 1985.",
      "doi": ""
    },
    {
      "text": "M. I. Elmasry, Stick-Layout Notation For Bipolar VLSI, VLSI Design, March-April, 1983, Palo Alto, California, 65-69.",
      "doi": ""
    }
  ]
}