{
  "doi": "10.1145/29933.30867",
  "title": "A self-regulating adaptive system",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "103-107",
  "year": 1987,
  "badges": [],
  "abstract": "The viability of providing adaptive user interfaces has been demonstrated ([3], [5]). Such systems identify differences between users in order to provide purposeful change at the user interface. Thus, adaptive systems have objectives, as indicated by the term 'purposeful.' The research reported here takes an important step forward by demonstrating that adaptive systems can be built that regulate their own behaviour by assessing whether their adaptations are being successful in meeting these objectives.",
  "tags": [],
  "authors": [
    {
      "name": "Robert Trevellyan",
      "institution": "Data Logic Limited, Queens House, Greenhill Way, Harrow, Middlesex HA1 1YR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100518455",
      "orcid": "missing"
    },
    {
      "name": "Dermot P. Browne",
      "institution": "Data Logic Limited, Queens House, Greenhill Way, Harrow, Middlesex HA1 1YR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010235",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "GREENBERG, S., 1984, User modelling in interactive computer systems. MSc. thesis, Depertment of Computer Science, University of Calgary, Calgary, Alberta.",
      "doi": ""
    },
    {
      "text": "GREENBERG, S., and WlTI'EN, I. H., 1984, Comparison of menu displays for ordered lists. Proceedings of the Canadian Information Processing Society National Conference, Calgary, Alberta, May.",
      "doi": ""
    },
    {
      "text": "GREENBERG, S., and wrITEN, I. H., 1985, Adaptive personalised interfaces A question of viability. Behaviour and Information Technology, 4(1), 31-45.",
      "doi": ""
    },
    {
      "text": "PEACHEY, J. B., BUNT, R.B., and COLBOURN, C. J., 1982, Bradford-Zipf phenomena in computer systems. Proceedings of the Canadian Information Processing Society National Conference, Saskatoon, Saskatchewan, May, 155-161.",
      "doi": ""
    },
    {
      "text": "TOTIERDELL, P., and COOPER, P,. 1986, Design and evaluation of the AID adaptive front-end to Telecom Gold. People and Computers: Designing for Usability. Proceedings of the Second Conference of the British Computer Society Human Computer Interaction Specialist Group. University of York, 23-26 September 1986. Ed. HARRISON, M. D., and MONK, A. F. 281-295. ",
      "doi": "10.5555/17324.24090"
    },
    {
      "text": "WITTEN, I. H., CLEARY, J., and GREENBERG, S., 1984, On frequency-based menu-splitting algorithms. International Journal of Man-Machine Studies, 21, 135- 148.",
      "doi": ""
    }
  ]
}