{
  "doi": "10.1145/29933.275640",
  "title": "Comparing a form-based and a language-based user interface for instructing a mail program",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "261-266",
  "year": 1987,
  "badges": [],
  "abstract": "In the domain of interaction languages, forms have been found to be of value in allowing users, especially non-programmers, to specify objects and operations with a minimum of training, time, and errors. Most of that research, however, has been on the use of data base query languages. The present research found that in a procedural task of specifying mail filtering instructions, non-programmers using a form were as fast as programmers using a procedural language, although programmers using the form were faster still.",
  "tags": [
    "design trade-offs",
    "forms",
    "interaction styles"
  ],
  "authors": [
    {
      "name": "Robin Jeffries",
      "institution": "Hewlett-Packard Labs, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332506629",
      "orcid": "missing"
    },
    {
      "name": "Jarrett Rosenberg",
      "institution": "Hewlett-Packard Labs, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546139956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Greenblatt, D., and J. Waxman, A study of three database query languages, in B. Shneiderman, ed., Databases: Improving Usability and Responsiveness. New York: Academic Press. 1978.",
      "doi": ""
    },
    {
      "text": "Hayes, P., and P. Szekely, Graceful interaction through the COUSIN command interface. Int'l. J. Man-Machine Studies. 19, 1983.",
      "doi": ""
    },
    {
      "text": "Malone, T., Grant, K., and F. Turbak, The information lens: an intelligent system for information sharing in organizations, in Proc. CHI '86 Human Factors in Computing Systems. (Boston, April 1986). New York: ACM 1986.  ",
      "doi": ""
    },
    {
      "text": "Miller, L., Natural language programming: styles, strategies, and contrasts. IBM Watson Research Center Research Report RC 8687 Dec. 1980.",
      "doi": ""
    },
    {
      "text": "Shu, N. C. A forms-oriented and visual-directed application development system for non-programmers. in IEEE Computer Society Workshop on Visual Languages. Hiroshima, Japan: Computer Society Press, 1984.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K., Bonar, J., and J. Greenspan, What do novices know about programming? in A. Badre and B. Shneiderman, eds., Directions in Human-Computer Interaction. Norwood, N.J.: Ablex. 1982.",
      "doi": ""
    },
    {
      "text": "Thomas, J., Psychological issues in the design of database query languages, in M. Shaw and M. Coombs, eds., Designing for Human-Computer",
      "doi": ""
    },
    {
      "text": "Communication. New York: Academic Press. 1983. Thomas, J. and J. Gould, A psychological study of query by example, in Proc. Nat. Comp. Conf. Arlington, Va.: AFIPS Press. 1975.",
      "doi": ""
    },
    {
      "text": "Welty, C. and D. Stemple, Human factors comparison of a procedural and a nonprocedural query language, in ACM Trans. Database Systems. 6, 1981.  ",
      "doi": ""
    },
    {
      "text": "Zloof, M., Query by example, in Proc. Nat. Comp. Conf. Arlington, Va.: AFIPS Press. 1975.",
      "doi": ""
    },
    {
      "text": "Zloof, M., QBE/OBE: a language for office and business automation. IEEE Computer. May 1981.",
      "doi": ""
    }
  ]
}