{
  "doi": "10.1145/29933.30860",
  "title": "A multiple, virtual-workspace interface to support user task switching",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "53-59",
  "year": 1987,
  "badges": [],
  "abstract": "An interface is presented that is designed to help users switch among tasks on which they are concurrently working. Nine desirable properties for such an interface are derived. It is argued that a key constraint to building interfaces that support task switching is that low user-overhead switching among tasks requires a large amount of display space, whereas actual display space is limited. A virtual workspace design is presented that greatly speeds the inevitable task-switching induced window faulting. The resulting interface is presented as a study in theory-based human-interface design. It is shown how in this case theory is important in inspiring a design, but design entailments outside the theory raise new issues that must be faced to make the design viable. These design experiences, in turn, help inspire new theory.",
  "authors": [
    {
      "name": "Stuart K. Card",
      "institution": "Intelligent Systems Laboratory, Xerox Palo Alto Research Center, Palo Alto, California",
      "img": "/do/10.1145/contrib-81406592524/rel-imgonly/card_5x7.jpg",
      "acmid": "81406592524",
      "orcid": "missing"
    },
    {
      "name": "Austin Henderson",
      "institution": "Intelligent Systems Laboratory, Xerox Palo Alto Research Center, Palo Alto, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100433710",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bannon, L., Cypher, A., Greenspan, S., and Monty, M. L., Proceedings of the ACM Human Factors in Software Conference, CHI '83 (1983), 54-57.]]  ",
      "doi": "10.1145/800045.801580"
    },
    {
      "text": "Bannon, L., Cypher, A., Greenspan, S., and Monty, M., Evaluation and analysis of users' activity organization. Transcript of talk delivered at CHI '83, San Franciso, December, 1983.]]  ",
      "doi": "10.1145/800045.801580"
    },
    {
      "text": "Bolt, R. A. The Human Interface. Belmont, California: Lifetime Learning Publications, 1984.]]",
      "doi": ""
    },
    {
      "text": "Card, S. K., Pavel, M., and Farrell, J. Window-based computer dialogues. In B. Shackel (Ed.), Human-Computer Interaction-Interaction '84 (London, Aug. 1984), 239-243. Amsterdam: Elsevier Science Publishers, B. V., 1985.]]",
      "doi": ""
    },
    {
      "text": "Chan, P. P., Learning Considerations in User Interface Design: The Room Model (Report CS-84-16). Waterloo, Ontario, Canada: University of Waterloo Computer Science Department, 1984.]]",
      "doi": ""
    },
    {
      "text": "Denning, P. J. Working sets past and present. 1EEE Transactions of Software Engineering, SE-6 (1980), 66-84.]]",
      "doi": ""
    },
    {
      "text": "Donahue, J. and Widom, J. Whiteboards: A Graphical Database Tool (Report CSL-84-4). Xerox Palo Alto Research Center, Palo Alto, California, June, 1985.]]",
      "doi": ""
    },
    {
      "text": "Goldberg, A. Smalltalk-80. New York: Addison-Wesley, 1983.]]",
      "doi": ""
    },
    {
      "text": "Henderson, A. and Card, S. Rooms: The use of multiple virtual workspaces to reduce space contention in a window-based graphical user interface. ACM Transactions on Graphics, in press.]]  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "Kahn, K. C., Program Behavior and Load Dependent System Performance. Ph.D. dissertation, Dept. of Computer Science, Purdue University, W. Lafayette, Indianna, August, 1976.]] ",
      "doi": "10.5555/907757"
    },
    {
      "text": "McGregor, S. The viewer window package. In J. H. Homing (Ed.). The Cedar System: An Anthology of Documentation (Report CSL-83-14). Palo alto, California: Xerox Palo Alto Research Center, 1983.]]",
      "doi": ""
    },
    {
      "text": "Mintzberg, H., The Nature of Managerial Work. New York: Harper and Row, 1973.]]",
      "doi": ""
    },
    {
      "text": "Teitelman, W., Ten years of window system - A retrospective view. In Hopgood, F. R. A., Duce, D. A., Fielding, E. V. C., Robinson, K., Williams, A. S. (Eds.). Methodology of Window Management. Berlin: Springer- Verlag, 1986.]] ",
      "doi": "10.5555/23810.23813"
    }
  ]
}