{
  "doi": "10.1145/29933.275644",
  "title": "A control panel interface for graphics and image processing applications",
  "published": "1986-05-01",
  "proctitle": "CHI '87: Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface",
  "pages": "285-290",
  "year": 1986,
  "badges": [],
  "abstract": "This paper describes a graphical interface for application programs. The interface is based on the notion of a control panel. A control panel contains a browsable list of an application's parameters and a set of functions to control the application's execution. A variety of graphical knobs and gauges may be associated with any or all of the parameters to permit fine-grain execution control, including animation of an application's output. The control panel interface is integrated into the framework of an interactive programming environment for graphics and image processing applications. This integration is an important feature of the overall interface design.",
  "authors": [
    {
      "name": "Gene L. Fisher",
      "institution": "Univ. of California, Davis",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100550078",
      "orcid": "missing"
    },
    {
      "name": "Kenneth I. Joy",
      "institution": "Univ. of California, Davis",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100148606",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "t~rown, M.tI., and Sedgewick, R. A System for Algorithm Animation. ACM SIGGRAt'tl- 4 Conference Proceedings (Minneapolis, Min~, , July, 1984), 177- 186.  ",
      "doi": "10.1145/800031.808596"
    },
    {
      "text": "Carpenter, B. E., and Caillian, R. Experience with Remote Procedure Calls in a Real-Time Control System. Software: Practice and Experience 14, 9 (1984).",
      "doi": ""
    },
    {
      "text": "Delisle, N.M., et al. Viewing a Programming Environment as a Single Tool. Proceedings of the ACM SIGSOFT/SIGPLAN Software Engineering Symposium on Practical Software Development Environments. (Pittsburg, PA, Apr. 23-25 1984), 49-57.  ",
      "doi": "10.1145/800020.808248"
    },
    {
      "text": "Fisher, G.I,. The Daisy Program Development t,;nvironment. Tech. Report No. ECE/CS-86-3, Computer Science Division, University of Calif, Davis, Dept. of Electrical and Computer Engineering, Division of Computer Science, 28 pp.",
      "doi": ""
    },
    {
      "text": "Joy, K.I. A Model for Graphics Interface Tool Development. Proceedings of Graphics Interface '85. (Montreal, Quebec, May, 1985), 159-165.",
      "doi": ""
    },
    {
      "text": "Joy, K.I.'A Uniform Subdivision Method for 'triangular Bczier Patches. Proceedings of the International Conference on Computational Geometry and Computer-Aided Design. (New Orleans, I,A, June, 1985), 67-70.",
      "doi": ""
    },
    {
      "text": "Joy, K.I., \"Graphics Interface Tool l)cvelopment in a t'roblem Solving Enviromnent,\" The Visual Cornpaler 2, Springer Verlag (1986), 63-71.",
      "doi": ""
    },
    {
      "text": "Myers, lkA. Incense: A Systern for Displaying Data Structures. ACM SIGGRAt'll-3 Conference roceedings (l)etroit, Mich, July 25-29, 1983), 115- 125  ",
      "doi": "10.1145/800059.801140"
    },
    {
      "text": "User's l{eference Manna} for the Transl)ortable Apl)}i- 82-TAb~usrvie, NASA Goddard Space Flight Centre. Nov 23, 1982, 100 pp.",
      "doi": ""
    },
    {
      "text": "l~eiss, S.t'. l T',CAN: 1 'rogram l)evelopment Systems that Support Multiple Views,\" IEEI4 7\"ransaclions on Software Engineering, SE-11, 3 (March 1985), 276-285.  ",
      "doi": "10.1109/TSE.1985.232211"
    },
    {
      "text": "Stefik, M.J., et al. Integrating Access-Oriented Programming into a Multiparadigm Environment,\" IEEt~ Software, January 1986, 70-77.",
      "doi": ""
    },
    {
      "text": "Wcstrup, T.D., et al., \"User Interaction with and Environment for Image Processing and Graphics,\" Computer Graphics Forum 4, North-Holland (1985), 187-202.",
      "doi": ""
    }
  ]
}