{
  "doi": "10.1145/1753326.1753651",
  "title": "Supporting sandtray therapy on an interactive tabletop",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2133-2142",
  "year": 2010,
  "badges": [],
  "abstract": "We present the iterative design of a virtual sandtray application for a tabletop display. The purpose of our prototype is to support sandtray therapy, a form of art therapy typically used for younger clients. A significant aspect of this therapy is the insight gained by the therapist as they observe the client interact with the figurines they use to create a scene in the sandtray. In this manner, the therapist can gain increased understanding of the client's psyche. We worked with three sandtray therapists throughout the evolution of our prototype. We describe the details of the three phases of this design process: initial face-to-face meetings, iterative design and development via distance collaboration, and a final face-to-face feedback session. This process revealed that our prototype was sufficient for therapists to gain insight about a person's psyche through their interactions with the virtual sandtray.",
  "authors": [
    {
      "name": "Mark Hancock",
      "institution": "University of Calgary, Calgary, Canada",
      "img": "/do/10.1145/contrib-81100211996/rel-imgonly/acm.jpg",
      "acmid": "81100211996",
      "orcid": "missing"
    },
    {
      "name": "Thomas ten Cate",
      "institution": "University of Groningen, Groningen, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81458660194",
      "orcid": "missing"
    },
    {
      "name": "Sheelagh Carpendale",
      "institution": "University of Calgary, Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616781",
      "orcid": "missing"
    },
    {
      "name": "Tobias Isenberg",
      "institution": "University of Groningen, Groningen, Netherlands",
      "img": "/do/10.1145/contrib-81100203466/rel-imgonly/tobiselection.jpg",
      "acmid": "81100203466",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A., Balakrishnan, R. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. In Proc. CHI, ACM (2006), 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Bers, M. U., Ackermann, E., Cassell, J., Donegan, B., Gonzalez-Heydrich, J., DeMaso, D. R., Strohecker, C., Lualdi, S., Bromley, D., Karlin, J. Interactive storytelling environments: coping with cardiac illness at Boston's Children's Hospital. In Proc. CHI, ACM (1998), 603--610.  ",
      "doi": "10.1145/274644.274725"
    },
    {
      "text": "Bradway, K., McCoard, B. Sandplay: Silent Workshop of the Psyche. Routledge, 1997.",
      "doi": ""
    },
    {
      "text": "Cao, X., Wilson, A.D., Balakrishnan, R., Hinckley, K., Hudson, S.E. ShapeTouch: leveraging contact shape on interactive surfaces. In Proc. Tabletop, IEEE (2008), 129--136.",
      "doi": ""
    },
    {
      "text": "Carpendale, M. Essence and Praxis in the Art Therapy Studio. Trafford Publishing, 2009.",
      "doi": ""
    },
    {
      "text": "Cassell, J., Ryokai, K. Making space for voice: technologies to support children's fantasy and storytelling. PUC 5, 3 (2001), 169--190.  ",
      "doi": "10.1007/PL00000018"
    },
    {
      "text": "Cunningham, J. (Ed.). Journal of Sandplay Therapy, volume 18, number 2. STA, 2009.",
      "doi": ""
    },
    {
      "text": "Dietz, P., Leigh, D. DiamondTouch: a multi-user touch technology. In Proc. UIST, ACM (2001), 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Greenbaum, J. M., Kyng, M. (Eds.). Design at Work: Cooperative Design of Computer Systems. L. Erlbaum Associates Inc., 1991. ",
      "doi": "10.5555/574738"
    },
    {
      "text": "Grubert, J., Carpendale, S., Isenberg, T. Interactive stroke-based NPR using hand postures on large displays. In Eurographics Short Papers, Eurographics Association (2008), 279--282.",
      "doi": ""
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. UIST, ACM (2005), 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "1ancock, M., Carpendale, S., Cockburn, A. Shallow-depth 3D interaction: Design and evaluation of one-, two- and three-touch techniques. In Proc. CHI, ACM (2007), 1147--1156.  ",
      "doi": "10.1145/1240624.1240798"
    },
    {
      "text": "Hancock, M., Carpendale, S., Vernier, F. D., Wigdor, D., Shen, C. Rotation and translation mechanisms for tabletop interaction. In Proc. Tabletop, IEEE (2006), 79--88.  ",
      "doi": "10.1109/TABLETOP.2006.26"
    },
    {
      "text": "Hancock, M., ten Cate, T., Carpendale, S. Sticky tools: Full 6DOF force-based interaction for multi-touch tables. In Proc. ITS, ACM (2009), 145--152.  ",
      "doi": "10.1145/1731903.1731930"
    },
    {
      "text": "Igarashi, T., Matsuoka, S., Tanaka, H. Teddy: a sketching interface for 3D freeform design. In Proc. SIGGRAPH, ACM/Addison-Wesley (1999), 409--416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Kalff, D.M. Sandplay: A Psychotherapeutic Approach to the Psyche. Sigo Press, 1980.",
      "doi": ""
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S.D., Greenberg, S. Roles of orientation in tabletop collaboration: comprehension, coordination and communication. J. CSCW 13, 5--6 (2004), 501---537.  ",
      "doi": "10.1007/s10606-004-5062-8"
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S.D., Tang, A. Fluid integration of rotation and translation. In Proc. CHI, ACM (2005), 601--610.  ",
      "doi": "10.1145/1054972.1055055"
    },
    {
      "text": "1Krüger, W., Fröhlich, B. The Responsive Workbench. CG&A 14, 3 (1994), 12--15.  ",
      "doi": "10.1109/38.279036"
    },
    {
      "text": "Li, Y., Fontijn, W., Markopoulos, P. A tangible tabletop game supporting therapy of children with cerebral palsy. In Proc. Fun and Games, Springer-Verlag (2008), 182---193.  ",
      "doi": "10.1007/978-3-540-88322-7_18"
    },
    {
      "text": "Liu, J., Pinelle, D., Sallam, S., Subramanian, S., Gutwin, C. TNT: improved rotation and translation on digital tables. In Proc. GI, Canadian Information Processing Society (2006), 25--32. ",
      "doi": "10.5555/1143079.1143084"
    },
    {
      "text": "Morris, M.R., Cassanego, A., Paepcke, A., Winograd, T., Piper, A.M., Huang, A. Mediating group dynamics through tabletop interface design. CG&A 26, 5 (2006), 65--73.  ",
      "doi": "10.1109/MCG.2006.114"
    },
    {
      "text": "Piper, A.M., Hollan, J.D. Supporting medical conversations between deaf and hearing individuals with tabletop displays. In Proc. CSCW, ACM (2008), 147--156.  ",
      "doi": "10.1145/1460563.1460587"
    },
    {
      "text": "Ryokai, K., Cassell, J. StoryMat: a play space for collaborative storytelling. In Proc. CHI, ACM (1999), 272--273.  ",
      "doi": "10.1145/632716.632883"
    },
    {
      "text": "Schmidt, R., Wyvill, B., Sousa, M.C., Jorge, J.A. ShapeShop: sketch--based solid modeling with BlobTrees. In 2nd Eurographics Workshop on Sketch--Based Interfaces and Modeling (2005), 53--62.",
      "doi": ""
    },
    {
      "text": "Schuler, D., Namioka, A. (Eds.). Participatory Design: Principles and Practices. L. Erlbaum Associates Inc., 1993. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "27. Sellen, A.J., Kurtenbach, G.P., Buxton, W.A.S. The prevention of mode errors through sensory feedback. HCI 7, 2 (1992), 141--164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Tse, E., Shen, C., Greenberg, S., Forlines, C. How pairs interact over a multimodal digital table. In Proc. CHI, ACM (2007), 215--218.  ",
      "doi": "10.1145/1240624.1240659"
    },
    {
      "text": "Wilson, A.D., Izadi, S., Hilliges, O., Garcia-Mendoza, A., Kirk, D. Bringing physics to the surface. In Proc. UIST, ACM (2008), 67--76.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Wu, M., Balakrishnan, R. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. In Proc. UIST, ACM (2003), 193--202.  ",
      "doi": "10.1145/964696.964718"
    }
  ]
}