{
  "doi": "10.1145/1753326.1753604",
  "title": "UpStream: motivating water conservation with low-cost water flow sensing and persuasive displays",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1851-1860",
  "year": 2010,
  "badges": [],
  "abstract": "Water is our most precious and most rapidly declining natural resource. We explore pervasive technology as an approach for promoting water conservation in public and private spaces. We hope to motivate immediate reduction in water use as well as higher-order behaviors (seeking new information, etc) through unobtrusive low-cost water flow sensing and several persuasive displays. Early prototypes were installed at public faucets and a private (shared) shower, logging water usage first without and then with ambient displays. This pilot study led to design iterations, culminating in long-term deployment of sensors in four private showers over the course of three weeks. Sensors first logged baseline water usage without visualization. Then, two display styles, ambient and numeric, were deployed in random order, each showing individual and average water consumption. Quantitative data along with participants' feedback contrast the effectiveness of numeric displays against abstract visualization in this very important domain of water conservation and public health.",
  "tags": [
    "sustainability",
    "ambient displays",
    "persuasive technology"
  ],
  "authors": [
    {
      "name": "Stacey Kuznetsov",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338489421",
      "orcid": "missing"
    },
    {
      "name": "Eric Paulos",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Andrés del Valle, A.C., Opalach, A. \"The Persuasive Mirror: computerized persuasion for healthy living.\" ACM SIGCHI, 2005.",
      "doi": ""
    },
    {
      "text": "Arroyo, E., Bonanni, L., Selker, T. \"Waterbot: Exploring Feedback and Persuasive Techniques at the Sink.\" ACM SIGCHI, 2005.  ",
      "doi": "10.1145/1054972.1055059"
    },
    {
      "text": "Beckmann, C., Consolvo, S., Lamarca, A., \"Some Assembly Required: Supporting End-User Sensor Installation in Domestic Ubiquitous Computing Environments\", Ubiquitous Computing, 2004.",
      "doi": ""
    },
    {
      "text": "Bonanni, L., Arroyo, E., Lee, C., and Selker, T. 2005. \"Smart sinks: real-world opportunities for context-aware interaction.\" 1232--1235, ACM SIGCHI, 2005  ",
      "doi": "10.1145/1056808.1056884"
    },
    {
      "text": "Consolvo, S. McDonald, D.W., Toscos, T., Chen, M.Y., Froehlich, J., Harrison, B., Klasnja, P., LaMarca, A., LeGrand, L., Libby, R., Smith, I., Landay, J.A. \"Activity Sensing in the Wild: A Field Trial of UbiFit Garden.\"ACM SIGCHI, 2008.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Consolvo, S., Roessler, P., Shelton, B.E. \" The CareNet Display: Lessons Learned from an In Home Evaluation of an Ambient Display.\" UbiComp. Berlin: Springer-Verlag, 2004. 1--17.",
      "doi": ""
    },
    {
      "text": "Chen, J., Kam A., Zhang, J., Liu, N. and Shue, L. \"Bathroom Actvitity Monitoring Based on Sound\", Proceedings of the Internatonal Conference on Pervasive Computing, 47--61, 2005.  ",
      "doi": "10.1007/11428572_4"
    },
    {
      "text": "Chetty, M., Tran, D., Grinter, R.E. \"Getting to Green: Understanding Resource Consumption in the Home.\" UbiComp'08. ACM, 2008.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Darby, S., Bertoldi, P., Ricci, A, & de. Almeida A. \"Making It Obvious: Designing Feedback into Energy Consumption.\" Proceedings of the 2nd International Conference on Energy Efficiency in Household Appliances and Lighting, 685--696. Berlin, Springer-Verlag, 2001.",
      "doi": ""
    },
    {
      "text": "Fogarty, J., Au, C., Hudson, S.E. \"Sensing from the Basement: A Feasibility Study of Unobtrusive and Low-Cost Home Activity Recognition.\" ACM UIST, 2006.  ",
      "doi": "10.1145/1166253.1166269"
    },
    {
      "text": "Food Standards Agency. \"Traffic light labeling.\" http://www.eatwell.gov.uk/foodlabels/trafficlights/ Accessed January 7, 2010.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Dillahunt, T., Klasnja, P., Mankoff, J., Consolvo, S., Harrison, B., Landay, J.A. \"UbiGreen: Investigating a Mobile Tool for Tracking and Supporting Green Transportation Habits.\" CHI 2009.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Froehlich, J. Larson, E., Campbell, T., Haggerty, C., Fogarty, J., and Patel, S. \"HydroSense: Infrastructure-Mediated Single-Point Sensing of Whole-Home Water Activity\" Proceedings of UbiComp 2009.  ",
      "doi": "10.1145/1620545.1620581"
    },
    {
      "text": "Galloway, D.L., Jones, D.R., and Ingebritsen, S.E. \"Land subsidence in the United States: U.S. Geological Survey.\" Circular 1182, p. 177, 1999.",
      "doi": ""
    },
    {
      "text": "Gustafsson, A., Gyllensward, M. \"The Power-Aware Cord: Energy Awareness through Ambient Information Display.\" CHI. Portland: ACM, 2005.  ",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Kappel, K., Grechenig, T. \"From Feedback to Awareness: An Ambient Water Consumption Display.\" Poster: Ubicomp 2008.",
      "doi": ""
    },
    {
      "text": "Kappel, K., Grechenig, T. \"show me: Water Consumption at a Glance to Promote Water Conservation in the Shower.\" Persuasive '09. ACM, 2009.  ",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "Larson, Stephen S. Intille Kent. \"Designing and Evaluating Supportive Technology for Homes.\" Proc. IEEE/ASME International Conference on Advanced Intelligent Mechatronics, 2002.",
      "doi": ""
    },
    {
      "text": "Lin, J.J., Mamykina, L., Lindtner, S., Delajoux, G., Strub, H.B. \"Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game .\" UbiComp. Spinger Berlin / Heidelberg, 2006. 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Mankoff, J., Dey, A.K., Hsieh, G., Kientz, J., Lederer, S., Ames, M. \"Heuristic Evaluation of Ambient Displays.\" CHI. Ft. Lauderdale: ACM, 2003.  ",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Matthews, T., Rattenbury, T., Carter, S. \"Defining, Designing, and Evaluating Peripheral Displays: An Analysis Using Activity Theory.\" In Human-Computer Interaction, 22 (1) pp. 221--261, 2007. ",
      "doi": "10.5555/1466595.1466602"
    },
    {
      "text": "McCrickard, D.S., Chewar, C.M., Somervell, J.P. & Ndiwalana, A. \"A model for notification systems evaluation -- Assessing user goals for multitasking activity\". ACM Transactions on Computer-Human Interaction, 10 (4). 312--338, 2003.  ",
      "doi": "10.1145/966930.966933"
    },
    {
      "text": "Morris, M., Lundell, M., Dishman, E. \"Catalyzing social interaction with ubiquitous computing: a needs assessment of elders coping with cognitive decline.\" CHI '04. ACM, 2004.  ",
      "doi": "10.1145/985921.986011"
    },
    {
      "text": "Nassim, J., J. Forlizzi, A. Hurst, and J. Zimmerman. \"Breakaway: An Ambient Display Designed to Change Human Behavior.\" CHI 2005. ACM SIGCHI, 2005.  ",
      "doi": "10.1145/1056808.1057063"
    },
    {
      "text": "Pousman, Z., Stasko, J. \"A taxonomy of ambient information systems: four patterns of design.\" Proceedings of the working conference on Advanced visual interfaces, ACM, 2006.  ",
      "doi": "10.1145/1133265.1133277"
    },
    {
      "text": "Riva, G. \"Ambient Intelligence in Health Care.\" CyberPsychology & Behavior. DOI, 2003.",
      "doi": ""
    },
    {
      "text": "Rodriguez, M., Favela, J., Preciado, A., Vizcaino, A. \"Agent-based ambient intelligence for healthcare.\" AI Communications. IOS Press, 2005. 1--16. ",
      "doi": "10.5555/1218875.1218880"
    },
    {
      "text": "Shami, N.S., Leshed, G. & Klein, D. \"Context of use evaluation of peripheral displays.\" In Proceedings of the IFIP TC13 International Conference on Human Computer Interaction (INTERACT), 579--587, Springer, 2005.  ",
      "doi": "10.1007/11555261_47"
    },
    {
      "text": "Strengers, Y. \"Smart Metering Demand Management Programs: Challenging the Comfort and Cleanliness Habitus of Households.\" OZCHI: Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat, 2008.  ",
      "doi": "10.1145/1517744.1517747"
    },
    {
      "text": "United Nations Human Development Report. \"UN Development Report 2008 Update\". http://hdr.undp.org/en/reports/global/hdr2007-2008/. Accessed September 4, 2009",
      "doi": ""
    },
    {
      "text": "U.S Geological Survey. \"Ground-Water Depletion Across the Nation\". Fact Sheet 103--03. 2003.",
      "doi": ""
    },
    {
      "text": "\"Water Is Our Most Precious Natural Resource\", United Nations Secretary-General Ban Ki-moon, UNIS/SGSM/100, 17 March 2009.",
      "doi": ""
    },
    {
      "text": "World Health Organization. \"Health through safe drinking water and basic sanitation\". http://www.who.int/water_sanitation_health/mdg1/en/index.html. Accessed April 10, 2009.",
      "doi": ""
    }
  ]
}