{
  "doi": "10.1145/1753326.1753574",
  "title": "Minput: enabling interaction on small mobile devices with high-precision, low-cost, multipoint optical tracking",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1661-1664",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present Minput, a sensing and input method that enables intuitive and accurate interaction on very small devices -- ones too small for practical touch screen use and with limited space to accommodate physical buttons. We achieve this by incorporating two, inexpensive and high-precision optical sensors (like those found in optical mice) into the underside of the device. This allows the entire device to be used as an input mechanism, instead of the screen, avoiding occlusion by fingers. In addition to x/y translation, our system also captures twisting motion, enabling many interesting interaction opportunities typically found in larger and far more complex systems.",
  "tags": [
    "pointing",
    "sensors",
    "gestures",
    "input",
    "spatially aware displays",
    "mobile devices",
    "touch screens",
    "optical tracking"
  ],
  "authors": [
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P. and Chu, G. Back-of-device interaction allows creating very small touch devices. In Proc. CHI '09. 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Butler, A., Izadi, S., and Hodges, S. SideSight: multi-\"touch\" interaction around small devices. In Proc. UIST '08. 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Cho, S., Murray-Smith, R., and Kim, Y. Multi-context photo browsing on mobile devices based on tilt dynamics. In Proc. MobileHCI '07. 190--197.  ",
      "doi": "10.1145/1377999.1378006"
    },
    {
      "text": "Fitzmaurice, G. W., Zhai, S. and Chignell, M. H. Virtual Reality for Palmtop Computers. ACM Trans. on Information Systems, 11(3): 197--218 (1993).  ",
      "doi": "10.1145/159161.159160"
    },
    {
      "text": "Fitzmaurice, G. W. Situated Information Spaces and Spatially Aware Palmtop Computers. Comm. of the ACM, 36(7): 38--49 (1993).  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Fitzmaurice, G. W., Ishii, H., and Buxton, W. A. Bricks: laying the foundations for graspable user interfaces. In Proc. CHI '95. 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Harada, S., Landay, J. A., Malkin, J., Li, X., and Bilmes, J. A. The vocal joystick: evaluation of voice-based cursor control techniques. In Proc. ASSETS '06. 197--204.  ",
      "doi": "10.1145/1168987.1169021"
    },
    {
      "text": "Masui, T., Tsukada, K., Siio, I. MouseField: A Simple and Versatile Input Device for Ubiquitous Computing, In Proc. UbiComp '04. 319--328.",
      "doi": ""
    },
    {
      "text": "Mooser, J., You, S., and Neumann, U. Large document, small screen: a camera driven scroll and zoom control for mobile devices. In Proc. I3D '08. 27--34.  ",
      "doi": "10.1145/1342250.1342254"
    },
    {
      "text": "Olwal, A., Feiner, S., and Heyman, S. Rubbing and tapping for precise and rapid selection on touch-screen displays. In Proc. CHI '08. 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Olwal, A. LightSense: enabling spatially aware handheld interaction devices. In Proc. ISMAR '06. 119--122.  ",
      "doi": "10.1109/ISMAR.2006.297802"
    },
    {
      "text": "Ronkainen, S., Häkkilä, J., Kaleva, S., Colley, A., and Linjama, J. Tap input as an embedded interaction method for mobile devices. In Proc. TEI '07. 263--270.  ",
      "doi": "10.1145/1226969.1227023"
    },
    {
      "text": "Tsang, M., Fitzmzurice, G. W., Kurtenbach, G., Khan, A., and Buxton, B. Boom chameleon: simultaneous capture of 3D viewpoint, voice and gesture annotations on a spatially-aware display. ACM Trans. Graph. 22, 3 (Jul. 2003), 698--698.  ",
      "doi": "10.1145/882262.882329"
    },
    {
      "text": "Vogel, D. and Baudisch, P. Shift: a technique for operating pen--based interfaces using touch. In Proc. CHI '07. 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Wang, J., Zhai, S., and Canny, J. Camera phone based motion sensing: interaction techniques, applications and performance study. In Proc. UIST '06. 101--110.  ",
      "doi": "10.1145/1166253.1166270"
    },
    {
      "text": "Wigdor, D., Forlines, C., Baudisch, P., Barnwell, J., and Shen, C. Lucid touch: a see-through mobile device. In Proc. UIST '07. 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Yee, K. Peephole displays: pen interaction on spatially aware handheld computers. In Proc. CHI '03. 1--8.  ",
      "doi": "10.1145/642611.642613"
    }
  ]
}