{
  "doi": "10.1145/1753326.1753480",
  "title": "Where are you pointing?: the accuracy of deictic pointing in CVEs",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1029-1038",
  "year": 2010,
  "badges": [],
  "abstract": "Deictic reference -- pointing at things during conversation -- is ubiquitous in human communication, and should also be an important tool in distributed collaborative virtual environments (CVEs). Pointing gestures can be complex and subtle, however, and pointing is much more difficult in the virtual world. In order to improve the richness of interaction in CVEs, it is important to provide better support for pointing and deictic reference, and a first step in this support is to determine how well people can interpret the direction that another person is pointing. To investigate this question, we carried out two studies. The first identified several ways that people point towards distant targets, and established that not all pointing requires high accuracy. This suggested that natural CVE pointing could potentially be successful; but no knowledge is available about whether even moderate accuracy is possible in CVEs. Therefore, our second study looked more closely at how accurately people can produce and interpret the direction of pointing gestures in CVEs. We found that although people are more accurate in the real world, the differences are smaller than expected; our results show that deixis can be successful in CVEs for many pointing situations, and provide a foundation for more comprehensive support of deictic pointing.",
  "authors": [
    {
      "name": "Nelson Wong",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351594055",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Bangerter, A. 2004. Using Pointing and Describing to Achieve Joint Focus of Attention in Dialogue, Psychological Science, 15, 6, 415--418.",
      "doi": ""
    },
    {
      "text": "Bekker, M., Olson, J.S., and Olson, G.M. 1995. Analysis of gestures face-to-face design teams provides guidance for how to use groupware design. Proc. DIS'95, 157--166.  ",
      "doi": "10.1145/225434.225452"
    },
    {
      "text": "Benford, S., Bowers, J., Lennart, E.F., Greenhalgh, C., and Snowdon, D. 1995. User embodiment collaborative virtual environments. Proc. CHI'95, 242--249.  ",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Bowers, J., Pycock, J., and O'Brien, J. 1996. Talk and embodiment collaborative virtual environments. Proc. CHI '96, 58--65.  ",
      "doi": "10.1145/238386.238404"
    },
    {
      "text": "Bowers, J., O'Brien, J., and Pycock, J. 1996. Practically accomplishing immersion: Cooperation and for virtual environments. Proc. CSCW '96, 380--389.  ",
      "doi": "10.1145/240080.240349"
    },
    {
      "text": "Clark, H.H. 2003. Pointing and Placing. S. Kita (Ed.), Pointing. Where language, culture, and cognition meet. Hillsdale NJ: Erlbaum. 243--268.",
      "doi": ""
    },
    {
      "text": "Clark, H.H., and Brennan, S.E. Grounding Communication. 1991. L.B. Resnick, R.M. Levine, & S.D. Teasley (Eds.). Perspectives on socially shared cognition. Washington, DC: APA. 127--149.",
      "doi": ""
    },
    {
      "text": "Clark, H., and Wilkes-Gibbes, D., Referring as a Collaborative Process, Cognition, 22, 1986, 1--39.",
      "doi": ""
    },
    {
      "text": "Duchowski, A., Cournia, N., Cumming, B., McCallum, D., Gramopadhye, A., Greenstein, J., Sadasivan, S., and Tyrrell, R. 2004. Visual deictic reference a collaborative virtual environment. Proc. ETRA, 35--40.  ",
      "doi": "10.1145/968363.968369"
    },
    {
      "text": "Fussell, S.R., Setlock, L.D., Yang, J., Ou, J., Mauer, E.M., and Kramer, A. 2004. Gestures over video streams to support remote collaboration on physical tasks. Human-Computer Interaction, 19, 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Fraser, M., and Benford, S. 2002. Interaction effects of virtual structures. Proc. CVE 2002, 128--134.  ",
      "doi": "10.1145/571878.571898"
    },
    {
      "text": "Fraser, M., Benford, S., Hindmarsh, J., and Heath, C. 1999. Supporting awareness and interaction through collaborative virtual interfaces. Proc. UIST'99, 27--36.  ",
      "doi": "10.1145/320719.322580"
    },
    {
      "text": "Goodwin, C. 2003. Pointing as Situated Practice. S. Kita (Ed.), Pointing. Where language, culture, and cognition meet. Hillsdale NJ: Erlbaum. 217--241.",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Gutwin, C., and Roseman, M., 1996. Semantic Telepointers for Groupware. Proc. OzCHI '96, 54--61. ",
      "doi": "10.5555/548200.883204"
    },
    {
      "text": "Gutwin, C., and Penner, R. 2002. Improving Interpretation of Remote Gestures with Telepointer Traces, Proc. CSCW'02, 49--57.  ",
      "doi": "10.1145/587078.587086"
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C., Benford, S., and Greenhalgh, C. 1998. Fragmented Interaction: establishing mutual orientation virtual environments. Proc. CSCW'98, 217--226.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C., Benford, S., and Greenhalgh, C. 2000. Object-Focused Interaction in Collaborative Virtual Environments, ToCHI, 7, 4, 477--509.  ",
      "doi": "10.1145/365058.365088"
    },
    {
      "text": "Hindmarsh, J., and Heath, C. 2000. Embodied reference: A study of deixis workplace interaction. J. Prag. 32, 12, 1855--1878.",
      "doi": ""
    },
    {
      "text": "Kelly, J., Bell, A., and Loomis, J. 2004. Perception of Shared Visual Space: Establishing Common Ground in Real and Virtual Environments, Presence, 13, 4, 442--450.  ",
      "doi": "10.1162/1054746041944786"
    },
    {
      "text": "Kirk, D., Rodden, T., and Fraser, D.S. 2007. Turn it this way: grounding collaborative action with remote gestures. Proc CHI'07, 1039--1048.  ",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "Kita, S. (Ed.). 2003. Pointing: Where language, culture and cognition meet. Mahwah, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Krauss, R.M., and Fussell, S.R. 1990. Mutual knowledge and communicative effectiveness. In, J. Galegher, R.E. Kraut & C. Egido (Eds.), Intellectual Teamwork: Social and Technical Bases of Collaborative Work. Hillsdale, NJ: Erlbaum. 111--145. ",
      "doi": "10.5555/117848.117853"
    },
    {
      "text": "McNeill, D., Cassell, J., and Levy, E.T. 1993. Abstract deixis. Semiotica, 95(1/2), 5--19.",
      "doi": ""
    },
    {
      "text": "Moore, R., Ducheneaut, N., and Nickell, E. 2007. Doing Virtually Nothing: Awareness and Accountability in Massively Multiplayer Online Worlds, JCSCW, 16, 3, 265--305.  ",
      "doi": "10.1007/s10606-006-9021-4"
    },
    {
      "text": "Pechmann, T., and Deutsch W. 1982. The Development of Verbal and Nonverbal Devices for Reference. Journal of Experimental Child Psychology 34, 330--341.",
      "doi": ""
    },
    {
      "text": "Tang, A., Boyle, M., and Greenberg, S. 2005. Display and Presence Disparity Mixed Presence Groupware. JRPIT, 37, 2, 71--88.",
      "doi": ""
    },
    {
      "text": "Tang, J. 1991. Findings from Observational Studies of Collaborative Work, IJMMS, 34, 2, 143--160.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "Tang, J.C., and Minneman, S.L. 1990. VideoDraw: a video interface for collaborative drawing, Proc. CHI'90, 313--320.  ",
      "doi": "10.1145/97243.97302"
    },
    {
      "text": "Tang, J., and Minneman, S. 1991. VideoWhiteboard: video shadows to support remote collaboration, Proc. CHI'91, 315--322.  ",
      "doi": "10.1145/108844.108932"
    }
  ]
}