{
  "doi": "10.1145/1753326.1753633",
  "title": "Evaluation of text entry methods for Korean mobile phones, a user study",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2023-2026",
  "year": 2010,
  "badges": [],
  "abstract": "This paper reports the results of a user study designed to evaluate text entry methods for mobile phones used in Korea. At present the keypad layout for Korean mobile phones has not been standardized and different manufacturers produce phones with different layouts. Included in the evaluation are three of the dominant text entry methods: Chon-ji-in, EZ-Hangul, and SKY. The metrics used in the analysis are key strokes per character, words per minute, and total error rate. The results suggest that SKY offers a good balance between speed, effort, and accuracy. The paper also introduces a phrase set that has high correlation with the Korean language and could be used in other experiments on Korean text entry methods.",
  "authors": [
    {
      "name": "Ivaylo Ilinkin",
      "institution": "Gettysburg College, Gettysburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100627093",
      "orcid": "missing"
    },
    {
      "name": "Sunghee Kim",
      "institution": "Gettysburg College, Gettysburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659388954",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kee, D. Evaluation for performance and preference of Hangul entry methods using real mobile phones. Journal of the Ergonomics Society of Korea, 25, 3 (2006), 33--41.",
      "doi": ""
    },
    {
      "text": "Kim, H. and Kang, B. Frequency analysis of Korean. Korea University Institute of Korean Culture, 1997",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Soukoreff, R.W. Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction, 17 (2002), 147--198.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Soukoreff, R.W. Phrase sets for evaluating text entry techniques. Ext. Abstracts CHI 2003, ACM Press (2003), 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Myung, R. Keystroke-level analysis of Korean text entry methods on mobile phones. International Journal of Human-Computer Studies, 60, 5-6 (2004), 545--563.",
      "doi": ""
    },
    {
      "text": "Silfverberg, M., MacKenzie, I.S., and Korhonen, P. Predicting text entry speed on mobile phones. Proc. CHI 2000, ACM Press (2000), 9--16.  ",
      "doi": "10.1145/332040.332044"
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. Metrics for text entry research: An evaluation of MSD and KSPC, and a new unified error metric. Proc. CHI 2003, ACM Press (2003), 113--120.  ",
      "doi": "10.1145/642611.642632"
    }
  ]
}