{
  "doi": "10.1145/1753326.1753712",
  "title": "Investigating the opportunity for a smart activity bag",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2543-2552",
  "year": 2010,
  "badges": [],
  "abstract": "As long as people have traveled, they have constructed bags to help them carry more items than their hands will hold. While quite effective at keeping things together, bags do a poor job of communicating when something is missing. We propose that there exists an opportunity for the HCI community to improve the quality of people's lives by creating bags that have knowledge of people's schedules and equipment needs, can sense their contents, and can communicate when something has been forgotten. To investigate this opportunity, we conducted a field study with six dual-income families. Through interviews and observations we investigated their experiences using bags to organize equipment needed for children's enrichment activities. Based on the findings we generated 100 concepts and conducted a needs validation session to better understand the best opportunity to improve people's lives with technical intervention. This paper reports on our field study and needs validation session, and shares insights on the opportunities and implications of a smart activity bag.",
  "authors": [
    {
      "name": "Sun Young Park",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574568",
      "orcid": "0000-0001-8666-1800"
    },
    {
      "name": "John Zimmerman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81406592256/rel-imgonly/headshot2010.jpg",
      "acmid": "81406592256",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahuvia, A.C. Beyond the Extended Self: Loved Objects and Consumers' Identity Narratives. Journal of Consumer Research, 32, 1 (June 2005), 171--185.",
      "doi": ""
    },
    {
      "text": "Beech, S., Geelhoed, E., Murphy, R., Parker, J., Sellen, A. and Shaw, K. The Lifestyles of Working Parents: Implications and Opportunities for New Technologies. HP Techincal Report: HPL-2003-88, 2003.",
      "doi": ""
    },
    {
      "text": "Belk, R.W. Possessions and the Extended Self. Journal of Consumer Research, 15, 2 (September 1988), 139--168.",
      "doi": ""
    },
    {
      "text": "Beyer, H. and Holtzblatt, K. Contextual Design: Defining Customer-Centered Systems. Morgan Kaufmann, 1997. ",
      "doi": "10.5555/523184"
    },
    {
      "text": "Biever, C. Smart Fabrics Make for Enhanced Living. In New Scientist, (2004), Accessed: September 2, 2009: http://www.newscientist.com/article/dn6553-smart-fabrics-make-for-enhanced-living.html.",
      "doi": ""
    },
    {
      "text": "Buechley, L., Eisenberg, M., Catchen, J. and Crockett, A. The Lilypad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In Poc. Of CHI, (2008) ACM Press, 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Darrah, C., Jan English-Lueck and Freeman, J. Families and Work: An Ethnography of Dual Career Families. Final Report to Sloan Foundation grant # 95192--0113, San Jose State University, Department of Anthropology, San Jose, 2001.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Lee, M.K., Yiu, C.M., Zimmerman, J. & Dey, A.K. Principles of smart home control. In Proc. of UbiComp, (2006) Springer, 19--34.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Davidoff, S., Lee, M.K., Dey, A.K. and Zimmerman, J. Rapidly Exploring Application Design through Speed Dating. In Proc. of UbiComp, (2007) Springer, 429--446. ",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Dey, A.K. and Abowd, G.D. Cybreminder: A Context-Aware System for Supporting Reminders. In Proc. of HUC, (2000) Springer, 172--186. ",
      "doi": "10.5555/647986.757284"
    },
    {
      "text": "Frissen, V.A. Icts in the Rush Hour of Life. The Information Society, 16 (March 1999), 65--75.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Doubleday, Garden City, NY, USA, 1959.",
      "doi": ""
    },
    {
      "text": "Hallnäs, L., Melin, L. and Redström, J. Textile Displays: Using Textiles to Investigate Computational Technology as Design Material. In Proc. Of NORDICHI, (2002) ACM Press, 157--166.  ",
      "doi": "10.1145/572020.572039"
    },
    {
      "text": "Jacobs, M. and Worbin, L. Reach: Dynamic Textile Patterns for Communication and Social Expression. In Extended Abstracts of CHI, (2005) ACM New York, NY, USA, 1493--1496.  ",
      "doi": "10.1145/1056808.1056949"
    },
    {
      "text": "Kim, S.W., Kim, M.C., Park, S.H., Jin, Y.K. and Choi, W.S. Gate Reminder: A Design Case of a Smart Reminder. In Proc. of DIS, (2004) ACM Press, 81--90.  ",
      "doi": "10.1145/1013115.1013128"
    },
    {
      "text": "Kleine, R.E., Kleine, S.S. and Kernan, J.B. Mundane Consumption and the Self: A Social-Identity Perspective. Journal of Consumer Psychology, 2, 3 (1993), 209--235.",
      "doi": ""
    },
    {
      "text": "Kleine, S.S., Kleine, R.E. and Allen, C.T. How Is a Possession \"Me\" Or \"Not Me\"? Characterizing Types and an Antecedent of Material Possession Attachment. Journal of Consumer Research, 22, 3 (December 1995), 327--343.",
      "doi": ""
    },
    {
      "text": "LadyBag Project: http://www.ladybag.official.ws/",
      "doi": ""
    },
    {
      "text": "Lee, M.K., Davidoff, S., Zimmerman, J. and Dey, A.K. Smart Bag: Managing Home and Raising Children. In Proc. of DPPI, (2007) ACM Press, 434--437.  ",
      "doi": "10.1145/1314161.1314201"
    },
    {
      "text": "Ludford, P.J., Frankowski, D., Reily, K., Wilms, K. and Terveen, L. Because I Carry My Cell Phone Anyway: Functional Location-Based Reminder Applications. In Proc. of CHI, (2006) ACM Press, 889--898.  ",
      "doi": "10.1145/1124772.1124903"
    },
    {
      "text": "Marmasse, N. and Schmandt, C. Location-Aware Information Delivery with Commotion. In Proc. of HUC, (2000) Springer, 361--370. ",
      "doi": "10.5555/647986.741313"
    },
    {
      "text": "Nanda, G., Cable, A., Bove, V.M., Ho, M. and Hoang, H. Byob {Build Your Own Bag}: A Computationally-Enhanced Modular Textile System. In Proc. Of MUM, (2004) ACM Press, 1--4.  ",
      "doi": "10.1145/1052380.1052381"
    },
    {
      "text": "Nielsen, J. Heuristic Evaluation. In Usability Inspection Methods. J. Nielsen and R.L. Mack (eds). John Wiley & Sons, 1994. ",
      "doi": "10.5555/189200.189209"
    },
    {
      "text": "Raley, S.B., Mattingly, M.J. and Bianchi, S.M. How Dual Are Dual-Income Couples? Documenting Change from 1970 to 2001. Journal of Marriage and Family, 68, 1 (2006), 11--28.",
      "doi": ""
    },
    {
      "text": "Sellen, A., Harper, R., Eardley, R., Izadi, S., Regan, T., Taylor, A.S. and Wood, K.R. Homenote: Supporting Situated Messaging in the Home. In Proc. of CSCW, (2006) ACM Press, 383--392.  ",
      "doi": "10.1145/1180875.1180933"
    },
    {
      "text": "Turkle, S. Evocative Objects: Things We Think With. MIT Press, Cambridge, MA, USA, 2007.",
      "doi": ""
    },
    {
      "text": "Zimmerman, J. Designing for the self: Making products that help people become the person they desire to be. In Proc. of CHI, (2009) ACM Press, 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J. and Evenson, S. Research through Design as a Method for Interaction Design Research in HCI. In Proc. CHI, (2007) ACM Press, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}