{
  "doi": "10.1145/1753326.1753336",
  "title": "Space to think: large high-resolution displays for sensemaking",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "55-64",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Space supports human cognitive abilities in a myriad of ways. The note attached to the side of the monitor, the papers spread out on the desk, diagrams scrawled on a whiteboard, and even the keys left out on the counter are all examples of using space to recall, reveal relationships, and think. Technological advances have made it possible to construct large display environments in which space has real meaning. This paper examines how increased space affects the way displays are regarded and used within the context of the cognitively demanding task of sensemaking. A pair of studies were conducted demonstrating how the spatial environment supports sensemaking by becoming part of the distributed cognitive process, providing both external memory and a semantic layer.",
  "authors": [
    {
      "name": "Christopher Andrews",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406595222",
      "orcid": "missing"
    },
    {
      "name": "Alex Endert",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654929",
      "orcid": "0000-0002-6914-610X"
    },
    {
      "name": "Chris North",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142484",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pirolli, P. and Card, S. The Sensemaking Process and Leverage Points for Analyst Technology as Identified Through Cognitive Task Analysis International Conference on Intelligence Analysis, (2005).",
      "doi": ""
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. CHI '01.ACM Press, (2001) 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Ball, R., North, C. and Bowman, D. A. Move to improve: promoting physical navigation to increase user performance with large displays. CHI '07. ACM Press, (2007) 191--200.  ",
      "doi": "10.1145/1240624.1240656"
    },
    {
      "text": "Czerwinski, M. P., Smith, G., Regan, T., Meyers, B., et al. Toward characterizing the productivity benefits of very large displays. Interact '03.IFIP, (2003) 9--16.",
      "doi": ""
    },
    {
      "text": "Shupp, L., Andrews, C., Dickey--Kurdziolek, M., Yost, B. and North, C. Shaping the Display of the Future: The Effects of Display Size and Curvature on User Performance andInsights. Human--Computer Interaction, 24, 1--2 (January 2009), 230--272.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Tan, D.S and Robertson, G. Women take a wider view. CHI '02.ACM, (2002) 195--202.  ",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Tan, D.S., Gergle, D., Scupelli, P. and Pausch, R. Physically large displays improve performance on spatial tasks. ACM Trans. Comput.-Hum. Interact., 13, 1 (March 2006), 71--99.  ",
      "doi": "10.1145/1143518.1143521"
    },
    {
      "text": "Robinson,A.C. Design forSynthesis in Geovisualization. University Park, PA, 2008.",
      "doi": ""
    },
    {
      "text": "Wright, W., Schroh, D., Proulx, P., Skaburskis, A. and Cort, B. The Sandbox for analysis: concepts and methods. CHI '06.ACM, (2006) 801--810.  ",
      "doi": "10.1145/1124772.1124890"
    },
    {
      "text": "Shipman, I., Frank M., Hsieh, H., Maloor, P. and Moore, J., Michael. The visual knowledge builder: a second generation spatial hypertext. HYPERTEXT '01.ACM, (2001) 113--122.  ",
      "doi": "10.1145/504216.504245"
    },
    {
      "text": "Plaisant, C., Grinstein, G., Scholtz, J., Whiting, M., et al. Evaluating Visual Analytics at the 2007 VAST Symposium Contest. CG & A, IEEE, 28, 2 (March--April 2008), 12--21.  ",
      "doi": "10.1109/MCG.2008.27"
    },
    {
      "text": "Hutchings, D.R., Smith, G., Meyers, B., Czerwinski, M. and Robertson, G. Display space usage and window management operation comparisons between single monitor and multiple monitor users. AVI '04.ACM Press, (2004) 32--39.  ",
      "doi": "10.1145/989863.989867"
    },
    {
      "text": "Hollan, J., Hutchins, E. and Kirsh, D. Distributed cognition: toward a new foundation for human-computer interaction research. ACM Trans. Comput.-Hum. Interact., 7, 2 (June 2000), 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Ramey, T.B.J. Thinking aloud: reconciling theory and practice. IEEE T-PC, 43, 3 (Sept. 2000), 261--278.",
      "doi": ""
    },
    {
      "text": "Wise, J.A., Thomas, J.J., Pennock, K., Lantrip, D., et al. Visualizing the non--visual: spatial analysis and interaction with information for text documents. InfoVis '95.IEEE, (1995) 442--450. ",
      "doi": "10.5555/857186.857579"
    },
    {
      "text": "Russell, D.M., Slaney, M., Yan, Q. and Houston, M. Being Literate with Large Document Collections: Observational Studies and Cost Structure Tradeoffs. HICSS '06, (2006) 55--55.  ",
      "doi": "10.1109/HICSS.2006.73"
    },
    {
      "text": "Heuer, R. J. Psychology of Intelligence Analysis. Center for the Study of Intelligence, 1999.",
      "doi": ""
    },
    {
      "text": "Richardson, D. and Spivey, M. Representation, space and Hollywood Squares: Looking at things that aren't there anymore. Cognition, 76, 3 (Sept. 2000), 269--295.",
      "doi": ""
    },
    {
      "text": "Kirsh, D. The intelligent use of space. Artif. Intell., 73, 1--2 (Feb. 1995), 31--68.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Shipman, I., Frank M., Marshall, C. C. and Moran, T. P. Finding and using implicit structure in human-organized spatial layouts of information. CHI '95.ACM Press, (1995) 346--353.  ",
      "doi": "10.1145/223904.223949"
    }
  ]
}