{
  "doi": "10.1145/1753326.1753679",
  "title": "Average task times in usability tests: what to report?",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2347-2350",
  "year": 2010,
  "badges": [],
  "abstract": "The distribution of task time data in usability studies is positively skewed. Practitioners who are aware of this positive skew tend to report the sample median. Monte Carlo simulations using data from 61 large-sample usability tasks showed that the sample median is a biased estimate of the population median. Using the geometric mean to estimate the center of the population will, on average, have 13% less error and 22% less bias than the sample median. Other estimates of the population center (trimmed, harmonic and Winsorized means) had worse performance than the sample median.",
  "authors": [
    {
      "name": "Jeff Sauro",
      "institution": "Oracle Corporation, Measuring Usability LLC, Denver, CO, USA",
      "img": "/do/10.1145/contrib-81100263219/rel-imgonly/aa.jpg",
      "acmid": "81100263219",
      "orcid": "missing"
    },
    {
      "name": "James R. Lewis",
      "institution": "IBM, Boca Raton, FL, USA",
      "img": "/do/10.1145/contrib-81100350474/rel-imgonly/81100350474.jpg",
      "acmid": "81100350474",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrews, D. F., Bickel, P. J., Hampel, F. R., Tukey, J. W., & Huber, P. J. Robust estimates of location: Survey and advances. Princeton, NJ: (1972). Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Blalock, H. M. Social statistics. (1972). New York, NY: McGraw-Hill.",
      "doi": ""
    },
    {
      "text": "Cordes, R The effects of running fewer subjects on time-on-task measures. International Journal of Human-Computer Interaction, 5(4), (1993) 393--403.",
      "doi": ""
    },
    {
      "text": "Myers, J. L, Fundamentals of experimental design. (1979) Boston, MA: Allyn and Bacon.",
      "doi": ""
    },
    {
      "text": "Miller, J. A warning about median reaction time. Journal of Experimental Psychology: Human Perception and Performance, 14, (1988) 539--543.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Quantitative Studies, How Many Users to Test? (2006) Last viewed September 13, 2009, www.useit.com/alertbox/quantitative_testing.html.",
      "doi": ""
    },
    {
      "text": "Sauro, J. & Lewis J. R Correlations among Prototypical Usability Metrics: Evidence for the Construct of Usability. In Proc CHI 2009 (pp. 1609--1618).  ",
      "doi": "10.1145/1518701.1518947"
    },
    {
      "text": "Sauro, J Graph and Calculator for Confidence Intervals for Task Times Last viewed Sept. 10, 2009, http://www.measuringusability.com/time_intervals.php",
      "doi": ""
    },
    {
      "text": "Tukey, J. W The future of data analysis. Annals of Mathematical Statistics, 33(1), (1962) pp 1--67.",
      "doi": ""
    },
    {
      "text": "Walpole, R. E. Elementary statistical concepts. (1976) New York, NY: Macmillan.",
      "doi": ""
    }
  ]
}