{
  "doi": "10.1145/1753326.1753538",
  "title": "Digital drumming: a study of co-located, highly coordinated, dyadic collaboration",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1417-1426",
  "year": 2010,
  "badges": [],
  "abstract": "Collaborative drumming is a creative human activity that requires a high degree of coordination among the participants. In this study, inexperienced drummer and experienced drummer participants were paired with a computer or experienced human drummer counterpart and given the task of producing musical rhythms on the fly. We found differing patterns of music production across the computer and human conditions. Participants intentionally and unintentionally assumed leadership roles depending on the dyad dynamic. Also noted were differences in the needs of inexperienced and experienced participants for visual and verbal cues for coordination. In our study, participants did not treat computers as other humans, but seemed to engage a more complex evaluation of the situation. This study contributes to the growing body of knowledge on how people respond to and interact with technology to accomplish complex, collaborative tasks.",
  "authors": [
    {
      "name": "Bobby Beaton",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460656704",
      "orcid": "missing"
    },
    {
      "name": "Steve Harrison",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/do/10.1145/contrib-81100010024/rel-imgonly/81100010024.jpg",
      "acmid": "81100010024",
      "orcid": "missing"
    },
    {
      "name": "Deborah Tatar",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275563",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blaine, T., Forlines, C. JAM-O-WORLD: Evolution of the Jam-O-Drum Multi-Player Musical Controller into the Jam-O-Whirl Gaming Interface. Proceedings of the 2002 Conference on New Instruments for Musical Expression. Dublin, Ireland. (2002). ",
      "doi": "10.5555/1085171.1085176"
    },
    {
      "text": "Blaine, T., Perkins, T. The Jam-O-Drum Interactive Music System: A Study in Interactive Design. Proceedings of the ACM Symposium on Designing Interactive Systems. New York: ACM Press (2000), 165--173.  ",
      "doi": "10.1145/347642.347705"
    },
    {
      "text": "Blaine, T., Fels, S. Collaborative musical experiences for novices. J. New Music Res., vol. 32, no. 4 (2003), 411--428.",
      "doi": ""
    },
    {
      "text": "Chiasson, S., Gutwin, C. Testing the Media Equation with Children. Conference on Human Factors in Computing Systems, ACM Press (2005), 829--838.  ",
      "doi": "10.1145/1054972.1055089"
    },
    {
      "text": "Crick, C., Munz, M., Scassellati, B. Synchronization in social tasks: Robotic Drumming. Proceedings of the 15th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN 2006), University of Hertfordshire, United Kingdom, (2006).",
      "doi": ""
    },
    {
      "text": "Drake, C., Jones, M.R., and C. Baruch, The development of rhythmic attending in auditory sequences: attunement, referent period, focal attending. Cognition, vol. 77, no. 3 (2000), 251--288.",
      "doi": ""
    },
    {
      "text": "Gurevich, M. JamSpace: a Networked Real-Time Collaborative Music Environment. Conference on Human Factors in Computing Systems, ACM Press (2006), 821--826.  ",
      "doi": "10.1145/1125451.1125613"
    },
    {
      "text": "Hoffman, R., Eliciting knowledge from experts: a methodological analysis. Organ. Behav. Hum. Decis. Process. 62 (1992), 129--158.",
      "doi": ""
    },
    {
      "text": "Isaacs, E.A., and Clark, H.H. References in Conversation Between Experts and Novices. Journal of Experimental Psychology. General, 116, (1987), 26--37.",
      "doi": ""
    },
    {
      "text": "Jennings, K. Toy Symphony: An International Music Technology Project for Children. Music Education International, no. 2 (2003), 3--21.",
      "doi": ""
    },
    {
      "text": "Nass, C., Moon, Y. Machines and Mindless: Social Responses to Computers. Journal of Social Issues. 56, (2000), 81--103.",
      "doi": ""
    },
    {
      "text": "Nijholt, A., Reidsma, D., Van Welbergen, H., Op Den Akker, H., Ruttkay, Z.M., Mutually coordinated anticipatory multimodal interaction. In Proceedings of the COST. Springer, Berlin. (2008).  ",
      "doi": "10.1007/978-3-540-70872-8_6"
    },
    {
      "text": "Reeves, B., Nass, C. The Media Equation: How People Treat Computers, Televisions, and New Media Like Real People and Places. Cambridge, U.K.: Cambridge University Press, (1996). ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Rosenblum, A., Pikovsky, M. Synchronization: from Pendulum clocks to chaotic lasers and chemical oscillators. Contemporary Physics, (2003).",
      "doi": ""
    },
    {
      "text": "Schmidt, K. Modes and Mechanisms of Interaction in Cooperative Work, Risø National Laboratory, Roskilde, Denmark (1994), 60--64.",
      "doi": ""
    },
    {
      "text": "Shechtman, N.,Horowitz, L. Media Inequality in Conversation: How People Behave Differently When Interacting with Computers and People. Conference on Human Factors in Computing Systems, ACM Press (2003), 281--288.  ",
      "doi": "10.1145/642611.642661"
    },
    {
      "text": "Schober, M,. Virtual Environments for Creative Work in Collaborative Music-Making. Virtual Reality. 10. (2006), 85--94.",
      "doi": ""
    },
    {
      "text": "Weinberg, G., Driscoll, S., Thatcher, T. Jam'aa -- A Middle Eastern Percussion Ensemble for Human and Robotic Players, in International Computer Music Conference, New Orleans (2006), 464--467.",
      "doi": ""
    }
  ]
}