{
  "doi": "10.1145/1753326.1753554",
  "title": "Prefab: implementing advanced behaviors using pixel-based reverse engineering of interface structure",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1525-1534",
  "year": 2010,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Current chasms between applications implemented with different user interface toolkits make it difficult to implement and explore potentially important interaction techniques in new and existing applications, limiting the progress and impact of human-computer interaction research. We examine an approach based in the single most common characteristic of all graphical user interface toolkits, that they ultimately paint pixels to a display. We present Prefab, a system for implementing advanced behaviors through the reverse engineering of the pixels in graphical interfaces. Informed by how user interface toolkits paint interfaces, Prefab features a separation of the modeling of widget layout from the recognition of widget appearance. We validate Prefab in implementations of three applications: target-aware pointing techniques, Phosphor transitions, and Side Views parameter spectrums. Working only from pixels, we demonstrate a single implementation of these enhancements in complex existing applications created in different user interface toolkits running on different windowing systems.",
  "tags": [
    "user interface toolkits",
    "prefab",
    "pixel-based reverse engineering"
  ],
  "authors": [
    {
      "name": "Morgan Dixon",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350581254",
      "orcid": "missing"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142271",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P., Tan, D.S., Collomb, M., Robbins, D., Hinckley, K., Agrawala, M., Zhao, S. and Ramos, G. (2006). Phosphor: Explaining Transitions in the User Interface using Afterglow Effects. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2006), 169--178.  ",
      "doi": "10.1145/1166253.1166280"
    },
    {
      "text": "Edwards, W.K., Hudson, S.E., Marinacci, J., Rodenstein, R., Rodriguez, T. and Smith, I. (1997). Systematic Output Modification in a 2D User Interface Toolkit. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 1997), 151--158.  ",
      "doi": "10.1145/263407.263537"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. (2005). The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. Proc. of the ACM Conference on Human Factors in Computing Systems (CHI 2005), 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Hartmann, B., Wu, L., Collins, K. and Klemmer, S.R. (2007). Programming by a Sample: Rapidly Creating Web Applications with d.Mix. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2007), 241--250.  ",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Hudson, S.E. (1991). Incremental Attribute Evaluation: A Flexible Algorithm for Lazy Update. ACM Transactions on Programming Languages and Systems (TOPLAS), 13(3). 315--341.  ",
      "doi": "10.1145/117009.117012"
    },
    {
      "text": "Hudson, S.E., Mankoff, J. and Smith, I. (2005). Extensible Input Handling in the subArctic Toolkit. Proc. of the ACM Conference on Human Factors in Computing Systems (CHI 2005), 381--390.  ",
      "doi": "10.1145/1054972.1055025"
    },
    {
      "text": "Hudson, S.E. and Smith, I. (1997). Supporting Dynamic Downloadable Appearances in an Extensible User Interface Toolkit. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 1997), 159--168.  ",
      "doi": "10.1145/263407.263539"
    },
    {
      "text": "Hudson, S.E. and Tanaka, K. (2000). Providing Visually Rich Resizable Images for User Interface Components. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2000), 227--235.  ",
      "doi": "10.1145/354401.354783"
    },
    {
      "text": "Hurst, A., Hudson, S.E. and Mankoff, J. (2010). Automatically Identifying Targets Users Interact with During Real World Tasks. Proc. of the International Conference on Intelligent User Interfaces (IUI 2010), To Appear.  ",
      "doi": "10.1145/1719970.1719973"
    },
    {
      "text": "Hurst, A., Mankoff, J., Dey, A.K. and Hudson, S.E. (2007). Dirty Desktops: Using a Patina of Magnetic Mouse Dust to Make Common Interactor Targets Easier to Select. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2007), 183--186.  ",
      "doi": "10.1145/1294211.1294242"
    },
    {
      "text": "Hutchings, D.R. and Stasko, J. (2005). mudibo: Multiple Dialog Boxes for Multiple Monitors. Extended Abstracts of the ACM Conference on Human Factors in Computing Systems (CHI 2005), 1471--1474.  ",
      "doi": "10.1145/1056808.1056944"
    },
    {
      "text": "Myers, B.A., Hudson, S.E. and Pausch, R. (2000). Past, Present, and Future of User Interface Software Tools. ACM Transactions on Computer--Human Interaction (TOCHI), 7(1). 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Olsen, D.R., Hudson, S.E., Verratti, T., Heiner, J.M. and Phelps, M. (1999). Implementing Interface Attachments Based on Surface Representations. Proc. of the ACM Conference on Human Factors in Computing Systems (CHI 1999), 191--198.  ",
      "doi": "10.1145/302979.303038"
    },
    {
      "text": "Olsen, D.R., Taufer, T. and Fails, J.A. (2004). ScreenCrayons: Annotating Anything. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2004), 165--174.  ",
      "doi": "10.1145/1029632.1029663"
    },
    {
      "text": "Potter, R. (1993). Triggers: Guiding Automaton with Pixel to Achieve Data Access. A. Cypher, eds. MIT Press.",
      "doi": ""
    },
    {
      "text": "Rissanen, J. (1978). Modeling by Shortest Data Description. Automatica 14(5). 465--471.",
      "doi": "10.1016/0005-1098%2878%2990005-5"
    },
    {
      "text": "Russell, S. and Norvig, P. (2002). Artificial Intelligence: A Modern Approach. Prentice Hall. ",
      "doi": "10.5555/773294"
    },
    {
      "text": "St. Amant, R., Lieberman, H., Potter, R. and Zettlemoyer, L.S. (2000). Visual Generalization in Programming by Example. Communications of the ACM 43(3). 107--114.  ",
      "doi": "10.1145/330534.330549"
    },
    {
      "text": "St. Amant, R., Riedl, M.O., Ritter, F.E. and Reifers, A. (2005). Image Processing in Cognitive Models with SegMan. Proc. of the International Conference on Human-Computer Interaction (HCII 2005).",
      "doi": ""
    },
    {
      "text": "Stuerzlinger, W., Chapuis, O., Phillips, D. and Roussel, N. (2006). User Interface Façades: Towards Fully Adaptable User Interfaces. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2006), 309--318.  ",
      "doi": "10.1145/1166253.1166301"
    },
    {
      "text": "Tan, D.S., Meyers, B.R. and Czerwinski, M. (2004). WinCuts: Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. Extended Abstracts of the ACM Conference on Human Factors in Computing Systems (CHI 2004), 1525--1528.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Terry, M. and Mynatt, E.D. (2002). Side Views: Persistent, On Demand Previews for Open-Ended Tasks. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2002), 71--80.  ",
      "doi": "10.1145/571985.571996"
    },
    {
      "text": "Wobbrock, J.O., Fogarty, J., Liu, S., Kimuro, S. and Harada, S. (2009). The Angle Mouse: Target-Agnostic Dynamic Gain Adjustment Based on Angular Deviation. Proc. of the ACM Conference on Human Factors in Computing Systems (CHI 2009), 1401--1410.  ",
      "doi": "10.1145/1518701.1518912"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K. and Hudson, S.E. (1997). Making Computers Easier for Older Adults to Use: Area Cursors and Sticky Icons. Proc. of the ACM Conference on Human Factors in Computing Systems (CHI 1997), 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Yeh, T., Change, T.-H. and Miller, R.C. (2009). Sikuli: Using GUI Screenshots for Search and Automation. Proc. of the ACM Symposium on User Interface Software and Technology (UIST 2009), 183--192.  ",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "Zettlemoyer, L.S. and St. Amant, R. (1999). A Visual Medium for Programmatic Control of Interactive Applications. Proc. of the ACM Conference on Human Factors in Computing Systems (CHI 1999), 199--206.  ",
      "doi": "10.1145/302979.303039"
    },
    {
      "text": "Zettlemoyer, L.S., St. Amant, R. and Dulberg, M.S. (1998). IBOTS: Agent Control Through the User Interface. Proc. of the International Conference on Intelligent User Interfaces (IUI 1998), 31--37.  ",
      "doi": "10.1145/291080.291087"
    }
  ]
}