{
  "doi": "10.1145/1753326.1753720",
  "title": "After access: challenges facing mobile-only internet users in the developing world",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2603-2606",
  "year": 2010,
  "badges": [],
  "abstract": "This study reports results of an ethnographic action research study, exploring mobile-centric internet use. Over the course of 13 weeks, eight women, each a member of a livelihoods collective in urban Cape Town, South Africa, received training to make use of the data (internet) features on the phones they already owned. None of the women had previous exposure to PCs or the internet. Activities focused on social networking, entertainment, information search, and, in particular, job searches. Results of the exercise reveal both the promise of, and barriers to, mobile internet use by a potentially large community of first-time, mobile-centric users. Discussion focuses on the importance of self-expression and identity management in the refinement of online and offline presences, and considers these forces relative to issues of gender and socioeconomic status.",
  "authors": [
    {
      "name": "Shikoh Gitau",
      "institution": "University of Cape Town, Cape Town, South Africa",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442618088",
      "orcid": "missing"
    },
    {
      "name": "Gary Marsden",
      "institution": "University of Cape Town, Cape Town, South Africa",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452608565",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Donner",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371593741",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arch, A. Web Accessibility for Older Users: A Literature Review, W3C, 2009.",
      "doi": ""
    },
    {
      "text": "Chigona, W., Beukes, D., Vally, J. and Tanner, M. Can mobile internet help alleviate social exclusion in developing countries? Electronic Journal of Information Systems in Developing Countries, 36 (7). 1--16.",
      "doi": ""
    },
    {
      "text": "Cody, M.J., Dunn, D., Hoppin, S. and Wendt, P. Silver surfers: Training and evaluating Internet use among older adult learners. Communication education, 48 (4). 269--286.",
      "doi": ""
    },
    {
      "text": "Donner, J., Verclas, K. and Toyama, K. Reflections on MobileActive08 and the M4D Landscape. in Pettersson, J.S. ed. Proceedings of the First International Conference on M4D, Karlstad University Studies, Karlstad, Sweden, 2008, 73--83.",
      "doi": ""
    },
    {
      "text": "Gitau, S., Donner, J. & Marsden, G. 'i-Internet? Intle'(beautiful): Exploring first-time internet use viamobile phones in a South African women's collective. Proceedings of the 3rd International IDIA Development Informatics Conference, 28--30 October 2009.196--210",
      "doi": ""
    },
    {
      "text": "Hölscher, C. and Strube, G. Web search behavior of Internet experts and newbies. Computer networks, 33 (1--6). 337--346.  ",
      "doi": "10.1016/S1389-1286%2800%2900031-1"
    },
    {
      "text": "ITU. Online statistics, ICTeye, International Telecommunication Union, Geneva, 2009.",
      "doi": ""
    },
    {
      "text": "Jensen, R. The Digital Provide: Information (Technology), Market Performance, and Welfare in the South Indian Fisheries Sector. Quarterly Journal of Economics, 122 (3). 879--924.",
      "doi": ""
    },
    {
      "text": "Jones, M. and Marsden, G. Mobile Interaction Design. John Wiley & Sons, New York, 2006. ",
      "doi": "10.5555/1204709"
    },
    {
      "text": "Kreutzer, T. Generation mobile: online and digital media usage on mobile phones among low-income urban youth in South Africa Centre for Film and Media Studies, University of Cape Town, 2009.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Sagar, A. and Toyama, K., Text free user interfaces for illiterate and semi literate users. in International conference on information and communication technologies and development, (Berkeley, CA, 2006), IEEE, 72--81.",
      "doi": ""
    },
    {
      "text": "Pedersen, P.E. and Ling, R. Modifying adoption research for mobile Internet service adoption: cross-disciplinary interactions the 36th Annual Hawaii International Conference on System Sciences, 2003. ",
      "doi": "10.5555/820750.821477"
    },
    {
      "text": "Prahalad, C.K. The Fortune at the Bottom of the Pyramid: Eradicating Poverty Through Profits. Wharton School Publishing, NJ, 2005. ",
      "doi": "10.5555/1405767"
    },
    {
      "text": "Ratan, A.L., Satpathy, S., Zia, L., Toyama, K., Blagsvedt, S., Pawar, U.S. and Subramaniam, T., Kelsa+: Digital Literacy for Low-Income Office Workers. in 3rd IEEE/ACM International Conference on Information and Communication Technologies and Development, (Doha, 2009), IEEE. ",
      "doi": "10.5555/1812530.1812546"
    },
    {
      "text": "Roman, R. and Colle, R.D. Content creation for ICT development projects: Integrating normative approaches and community demand. Information technology for Development, 10 (2). 85--94.  ",
      "doi": "10.1002/itdj.1590100204"
    },
    {
      "text": "Tacchi, J., Slater, D. and Hearn, G. Ethnographic Action Research, UNESCO, 2003.",
      "doi": ""
    }
  ]
}