{
  "doi": "10.1145/1753326.1753658",
  "title": "Chinese online communities: balancing managementcontrol and individual autonomy",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2193-2202",
  "year": 2010,
  "badges": [],
  "abstract": "Existing studies of online social communities mainly focus on communities in the United States. Since Chinese social beliefs and behaviors largely differ from that of Americans, we hypothesize that Chinese online communities also greatly differ from their U.S. counterparts. In particular, we believe that Chinese online communities must balance management control and individual autonomy to accommodate both Chinese tradition and the social nature of online societies. In this paper, we present three studies to test our hypothesis. First, we use a structured observation (Study I) to examine community governance practices of 32 Chinese and American social sites. Based on the identified community governance practices, we use a cross-cultural survey of 208 Chinese and Americans (Study II) to learn about their behavior and attitude toward these practices. Finally, we interview 38 Chinese users (Study III) to help us further understand how Chinese online communities balance the needs of management and users. Not only do the studies confirm our hypothesis, but they also help us abstract two key design implications of social software to meet the needs of Chinese.",
  "tags": [
    "social software",
    "community management",
    "online governance",
    "online communities",
    "china"
  ],
  "authors": [
    {
      "name": "Qinying Liao",
      "institution": "IBM Research - China, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384608780",
      "orcid": "missing"
    },
    {
      "name": "Yingxin Pan",
      "institution": "IBM Research - China, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81423593545",
      "orcid": "missing"
    },
    {
      "name": "Michelle X. Zhou",
      "institution": "IBM Research - China, Beijing, China",
      "img": "/do/10.1145/contrib-81100264735/rel-imgonly/mzhou_81100264735.jpg",
      "acmid": "81100264735",
      "orcid": "missing"
    },
    {
      "name": "Fei Ma",
      "institution": "IBM Research - China, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538311156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ardichvili, A., et al. Cultural Influences on Knowledge Sharing through Online Communities of Practice. Journal of Knowledge Management 10, 1 (2006), 94--107.",
      "doi": ""
    },
    {
      "text": "Beenen, G., Ling, K., Wang, X.Q., Chang, K., Frankowski, D., Resnick, P., and Kraut, R.E. Using Social Psychology to Motivate Contributions to Online Communities. In Proc. CSCW 2004.  ",
      "doi": "10.1145/1031607.1031642"
    },
    {
      "text": "Chapman, C.N., and Lahav, M. International Ethnographic Observation of Social Networking Sites. Ext. Abstracts CHI 2008.  ",
      "doi": "10.1145/1358628.1358818"
    },
    {
      "text": "Chen, J.L., Geyer, W., Dugan, C., Muller, M., Guy, I. Make New Friends, But Keep the Old: Recommending People on Social Networking Sites. In Proc CHI 2009, AMC Press (2009), 201--210.  ",
      "doi": "10.1145/1518701.1518735"
    },
    {
      "text": "China Internet Network Information Center (CINIC). (2008), http://www.cnnic.net.cn/uploadfiles/pdf/2008/7/23/170516.pdf .",
      "doi": ""
    },
    {
      "text": "Donath, J.S. Identity and Deception in the Virtual Community. Communities in Cyberspace, ed. P. Kollock and M. Smith. 1999.",
      "doi": ""
    },
    {
      "text": "Ellison, N., Lampe, C. Steinfield, C., Gilbert, E., Karahalios, K., and Sandvig, C. The Network in the Garden: an Empirical Analysis of Social Media in Rural Life. In Proc. CHI 2008, 1603--1612.  ",
      "doi": "10.1145/1357054.1357304"
    },
    {
      "text": "Feenberg, A. and Barney, D., (Eds.), Community in the Digital Age -- Philosophy and Practice. Lanham, MD: Rowman & Littlefield Publishers, Inc. 2004",
      "doi": ""
    },
    {
      "text": "Harkness, J.A., Van de Vijver, F.J.R., Mohler, P., Cross-cultural survey methods, New York : John Wiley, 2003.",
      "doi": ""
    },
    {
      "text": "http://www.alexa.com/topsites/countries",
      "doi": ""
    },
    {
      "text": "Hofstede, G. Dimensions of National Cultures in Fifty Countries and Three Regions. In J. Deregowski, S. Dzuirawiec & R. Annis (Eds.), Expiscations in Cross-Cultural Psychology (1984).",
      "doi": ""
    },
    {
      "text": "Jones, S.G. (Ed.), Cybersociety 2.0: Revisiting Computer-Mediated Communication and Community, Thousand Oaks, CA: Sage, 1998 ",
      "doi": "10.5555/295080"
    },
    {
      "text": "Kayan, S., Fussell, S.R., Setlock, L.D. Cultural Differences in the Use of Instant Messaging in Asia and North America. In Proc. CSCW 2006, ACM Press (2006), 525--528.  ",
      "doi": "10.1145/1180875.1180956"
    },
    {
      "text": "Kittur, A., Lee, B., and Kraut, R.E.. Coordination in Collective Intelligence: the Role of Team Structure and Task Interdependence. In Proc. CHI 2009, ACM Press (2009), 1495--1504  ",
      "doi": "10.1145/1518701.1518928"
    },
    {
      "text": "Liu, I. (1986). Chinese Cognition. In M.H. Bond (Ed.), The Psychology of the Chinese People (pp. 73--105). New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Ludford, P. J., Cosley, D., et. al.. Think Different: Increasing Online Community Participation Using Uniqueness and Group Dissimilarity. In Proc. CHI 2004, ACM Press (2004), 631--638.  ",
      "doi": "10.1145/985692.985772"
    },
    {
      "text": "Marcurs, H.R. and Kitayama S., Culture and the Self: Implications for Cognitions, Emotion, and Motivation. Psych. Rev. 98:22, 224--253.",
      "doi": ""
    },
    {
      "text": "Mongoose Technologies. The 12 Principles of Collaboration (2001), available at http://www.typaldos.com/word.documents/12principles/12principles.pdf",
      "doi": ""
    },
    {
      "text": "Millen, D.R. and Patterson, J.F., Identity Disclosure and the Creation of Social Capital, Ext. Abstracts CHI 2003  ",
      "doi": "10.1145/765891.765950"
    },
    {
      "text": "Nielsen NetRankings, http://en-us.nielsen.com/tab/product_families/nielsen_netratings",
      "doi": ""
    },
    {
      "text": "Pang, C., Yen, D.C. and Tarn J.M., Exploring Online Shoppers' E-trust in China, Human Systems Management, Volume 26 (2007), 193--198",
      "doi": ""
    },
    {
      "text": "Rao, P. International Survey Research: Understanding National Cultures to Increase Survey Response Rate. Cross Cultural Management: An International Journal 16, 2 (2009), 165--178.",
      "doi": ""
    },
    {
      "text": "Smith, A.D. (1998). Problems of Conflict Management in Virtual Communities. In Communities in Cyberspace. P. Kollock and M. Smith (Eds.), Routledge Press",
      "doi": ""
    },
    {
      "text": "Sorkin, David E.,Internet Governance Models: An International Perspective. Internet Law Bulletin, Vol. 5, No. 1, pp.1--8, 2002. Available at SSRN: http://ssrn.com/abstract=1061341",
      "doi": ""
    },
    {
      "text": "Talukder, M and Yeow, P. A Study of Technical, Marketing and Cultural Differences between Virtual Communities in Industrially Developing and Developed Countries. Asia Pacific Journal of Marketing and Logistics, 18, 3 (2006), 184--200.",
      "doi": ""
    },
    {
      "text": "Triandis, H.C. Vertical and Horizontal Individualism and Collectivism: Theory and Research Implications for International Comparative Management. Advances in International Comparative Management, 12 (1998), 7--35.",
      "doi": ""
    },
    {
      "text": "Wallace, P. (1999). The Psychology of the Internet. Cambridge. ",
      "doi": "10.5555/519516"
    }
  ]
}