{
  "doi": "10.1145/1753326.1753484",
  "title": "MOSES: exploring new ground in media and post-conflict reconciliation",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1059-1068",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While the history of traditional media in post-conflict peace building efforts is rich and well studied, the potential for interactive new media technologies in this area has gone unexplored. In cooperation with the Truth and Reconciliation Commission of Liberia, we have constructed a novel interactive kiosk system, called MOSES, for use in that country's post-conflict reconciliation effort. The system allows the sharing of video messages between Liberians throughout the country, despite the presence of little or no communications infrastructure. In this paper, we describe the MOSES system, including several innovative design elements. We also present a novel design methodology we employed to manage the various distances between our design team and the intended user group in Liberia. Finally, we report on a qualitative study of the system with 27 participants from throughout Liberia. The study found that participants saw MOSES as giving them a voice and connecting them to other Liberians throughout the country; that the system was broadly usable by low-literate, novice users without human assistance; that the embodied conversational agent used in our design shows considerable promise; that users generally ascribed foreign involvement to the system; and that the system encouraged heavily group-oriented usage.",
  "authors": [
    {
      "name": "Thomas N. Smyth",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528806",
      "orcid": "missing"
    },
    {
      "name": "John Etherton",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377592119",
      "orcid": "missing"
    },
    {
      "name": "Michael L. Best",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342489230",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Videoletters Project. http://www.videoletters.net/.",
      "doi": ""
    },
    {
      "text": "Gurtong Peace Project. http://www.gurtong.org.",
      "doi": ""
    },
    {
      "text": "Oddcast. http://www.oddcast.com/.",
      "doi": ""
    },
    {
      "text": "Agarwal, S., Kumar, A., Nanavati, A.A., and Rajput, N. Content Creation and Dissemination by-and-for Users in Rural Areas. (2009).",
      "doi": ""
    },
    {
      "text": "Bell, G. Satu Keluarga, Satu Komputer (One Home, One Computer): Cultural Accounts of ICTs in South and Southeast Asia. Design Issues 22, 2 (2006), 35--55.",
      "doi": ""
    },
    {
      "text": "Best, M.L., Jones, K., Kondo, I., Thakur, D., Wornyo, E., and Yu, C. Post-conflict communications: The case of Liberia. Communications of the ACM 50, 10 (2007), 33--39.  ",
      "doi": "10.1145/1290958.1290987"
    },
    {
      "text": "Best, M.L., Smyth, T.N., Serrano-Baquero, D., and Etherton, J. Designing for and with Diaspora: A Case Study of Work for the Truth and Reconciliation Commission of Liberia. Extended abstracts of CHI 2009, (2009), 2903--2918.  ",
      "doi": "10.1145/1520340.1520418"
    },
    {
      "text": "Blake, E.H. A field computer for animal trackers. Extended abstracts of CHI 2002, (2002), 532--533.  ",
      "doi": "10.1145/506443.506466"
    },
    {
      "text": "Cassell, J., Bickmcre, T., and Campbell, L. Embodied conversational agents. MIT Press, Cambridge, MA, 2000. ",
      "doi": "10.5555/371552.371554"
    },
    {
      "text": "Catrambone, R., Stasko, J., and Xiao, J. ECA as user interface paradigm, From brows to trust: Evaluating embodied conversational agents. Kluwer Academic Publishers, Norwell, MA, 2004. ",
      "doi": "10.5555/1138317.1138327"
    },
    {
      "text": "Frohlich, D.M., Rachovides, D., Riga, K., et al. StoryBank: Mobile digital storytelling in a development context. Proceedings of CHI 2009, (2009), 1761--1770.  ",
      "doi": "10.1145/1518701.1518972"
    },
    {
      "text": "Hayner, P.B. Unspeakable truths. Routledge, 2001.",
      "doi": ""
    },
    {
      "text": "Hieber, L. Lifeline Media: Reaching populations in crisis. Media Action International, 2001.",
      "doi": ""
    },
    {
      "text": "Ho, M., Smyth, T.N., Kam, M., and Dearden, A. Human Computer Interaction for Development: A Brief History. Information Technologies and International Development, (2009), To appear.",
      "doi": ""
    },
    {
      "text": "Howard, R. The Media's Role in War and Peacebuilding. In G. Junne and W. Verkoren, eds., Postconflict Development: Meeting New Challenges. Lynne Rienner Publishers, Boulder, CO, 2005.",
      "doi": ""
    },
    {
      "text": "Kalathil, S., Langlois, J., and Kaplan, A. Towards a New Model: Media and Communication in Post-Conflict and Fragile States. 2008.",
      "doi": ""
    },
    {
      "text": "Kearsley, G. Public access systems. Intellect Books, 1994.",
      "doi": ""
    },
    {
      "text": "Kules, B., Kang, H., Plaisant, C., Rose, A., and Shneiderman, B. Immediate usability: A case study of public access design for a community photo library. Interacting with Computers 16, 6 (2004), 1171--1193.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. The limits of expert performance using hierarchic marking menus. Proceedings of CHI 1993, (1993), 482--487. ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Marie-Soleil, F. The Media and Conflicts in Central Africa. Lynne Rienner Publishers, Boulder, CO, 2007.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Sagar, A., and Toyama, K. Text-free user interfaces for illiterate and semi-literate users. Information Technologies and International Development 4, 1 (2007), 37--50.  ",
      "doi": "10.1162/itid.2007.4.1.37"
    },
    {
      "text": "Melone, S.D., Terzis, G., and Beleli, O. Using the Media for Conflict Transformation: The Common Ground Experience. In Berghof Handbook for Conflict Transformation. Berghof Research Center for Constructive Conflict Management, Berlin, 2002.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. and Molich, R. Heuristic evaluation of user interfaces. Proceedings CHI 1990 (1990), 249--256.  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Plauché, M. and Nallasamy, U. Speech interfaces for equitable access to information technology. Information Technologies and International Development 4, 1 (2007), 69--86.  ",
      "doi": "10.1162/itid.2007.4.1.69"
    },
    {
      "text": "Price, M.E. Restructuring the Media in Post-Conflict Societies: Four Perspectives the Experience of Intergovernmental and Non-governmental Organizations. Cardozo Online Journal of Conflict Resolution, (2000).",
      "doi": ""
    },
    {
      "text": "Ropers, N. From Resolution to Transformation: The Role of Dialogue Projects. In Berghof Handbook for Conflict Transformation. Berghof Research Center for Constructive Conflict Management, Berlin, 2004.",
      "doi": ""
    },
    {
      "text": "Sherwani, J., Ali, N., Mirza, S., et al. HealthLine: Speech-based Access to Health Information by Low-literate Users. Proceedings of ICTD 2007, (2007).",
      "doi": ""
    },
    {
      "text": "Sterling, S., O'Brien, J., and Bennett, J. Advancement through Interactive Radio. Proceedings of ICTD 2007, (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Strauss, A.C. and Corbin, J. Basics of Qualitative Research. Sage Publications, 1998.",
      "doi": ""
    },
    {
      "text": "United Nations Development Program. Human Development Report 2007/2008. Palgrave Macmillan, New York, 2007.",
      "doi": ""
    },
    {
      "text": "Wyche, S.P., Aoki, P.M., and Grinter, R.E. Re-placing faith: reconsidering the secular-religious use divide in the United States and Kenya. Proceedings of CHI 2008, (2008), 11--20.  ",
      "doi": "10.1145/1357054.1357057"
    }
  ]
}