{
  "doi": "10.1145/1753326.1753657",
  "title": "Predicting Chinese text entry speeds on mobile phones",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2183-2192",
  "year": 2010,
  "badges": [],
  "abstract": "Chinese text entry on mobile phones is critical considering the large number of Chinese speakers worldwide and as a key task in many core applications. But there is still a lack of both empirical data and predictive models that explore the pattern of user behavior in the process. We propose a model to predict user performance with two types of Chinese pinyin input methods on mobile phones. The model integrates a language model (digraph probability) with Fitts' law for key presses, a keystroke-level model for navigation, and a linear model for visual search in pinyin marks and Chinese characters. We tested the model by comparing its predictions with the empirical measures. The predictions are satisfactory and the percentage differences are all within 4% of the empirical results, suggesting that the model can be used to evaluate user performance of Chinese pinyin text entry solutions on mobile phones.",
  "authors": [
    {
      "name": "Ying Liu",
      "institution": "Nokia Research Center/Nokia, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351593162",
      "orcid": "missing"
    },
    {
      "name": "Kari Jouko Räihä",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100052864/rel-imgonly/aa.jpg",
      "acmid": "81100052864",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The keystroke-level model for user performance time with interactive systems. Communications of the ACM 23, 7 (1980), 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The Psychology of Human-Computer Interaction. Erlbaum, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Greenberg, S. A predictive model of menu performance. In Proc. CHI 2007, ACM Press (2007), 627--636.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Cockburn, A., and Gutwin, C. A predictive model of human performance with scrolling and hierarchical lists. Human-Computer Interaction 24, 3 (2009), 273--314.",
      "doi": ""
    },
    {
      "text": "Dunlop, M.D., and Crossan, A. Predictive text entry methods for mobile phones. Personal Technologies 4, 2 (2000), 134--143.",
      "doi": ""
    },
    {
      "text": "Dunlop, M.D., and Masters, M.M. Investigating five key predictive text entry with combined distance and keystroke modeling. Personal and Ubiquitous Computing 12, 8 (2008), 589--598.  ",
      "doi": "10.1007/s00779-007-0179-7"
    },
    {
      "text": "GB 2312-1980. Code of Chinese graphic character set for information interchange-Primary set (1980).",
      "doi": ""
    },
    {
      "text": "Hick, W.E. On the rate of gain of information. Quarterly Journal of Experimental Psychology 4, 1 (1952), 11--26.",
      "doi": ""
    },
    {
      "text": "Isokoski, P. Performance of menu--augmented soft keyboards. Proc. CHI 2004, ACM Press (2004), 423--430.  ",
      "doi": "10.1145/985692.985746"
    },
    {
      "text": "Isokoski, P., and MacKenzie, I.S. Combined model for text entry rate development. Ext. Abstracts CHI 2003, ACM Press (2003), 752--753.  ",
      "doi": "10.1145/765891.765970"
    },
    {
      "text": "James, C.L., and Reischel, K.M. Text input for mobile devices: Comparing model predictions to actual performance. Proc. CHI 2001, ACM Press (2001), 365--371.  ",
      "doi": "10.1145/365024.365300"
    },
    {
      "text": "Lin, M., and Sears, A. Constructing Chinese characters: keypad design for mobile phones. Behaviour & Information Technology 26, 2 (2007), 165--178.  ",
      "doi": "10.1080/01449290500094333"
    },
    {
      "text": "Liu, Y., and Räihä, K.-J. RotaTxt: Chinese pinyin input with a rotator. Proc. Mobile HCI 2008, ACM Press (2008), 225--233.  ",
      "doi": "10.1145/1409240.1409265"
    },
    {
      "text": "Liu, Y., and Wang, Q. Chinese pinyin phrasal input on mobile phone: Usability and developing trends. Proc. Mobility 2007, ACM Press (2007), 540--546.  ",
      "doi": "10.1145/1378063.1378151"
    },
    {
      "text": "Ma, D., Ichikawa, F., Liu, Y., and Jiang, L. Use of Chinese short messages. Proc. HCI International 2007, Springer (2007), LNCS 4558, 582--591. ",
      "doi": "10.5555/1766591.1766658"
    },
    {
      "text": "MacKenzie, I.S., and Buxton, W. Extending Fitts' law to two-dimensional tasks. Proc CH1 1992, ACM Press (1992), 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "MacKenzie, I.S., and Soukoreff, R.W. Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction 17, 2&3 (2002), 147--198.",
      "doi": ""
    },
    {
      "text": "Myung, R. Keystroke-level analysis of Korean text entry methods on mobile phones. International Journal of Human-Computer Studies 60, 5-6 (2004), 545--563.",
      "doi": ""
    },
    {
      "text": "Pavlovych, A., and Stuerzlinger, W. Model for non-expert text entry speed on 12--button phone keypads. Proc. CHI 2004, ACM Press (2004), 351--358.  ",
      "doi": "10.1145/985692.985737"
    },
    {
      "text": "Sacher, H., Tng, T.-H., and Loudon, G. Beyond translation: approaches to interactive products for Chinese consumers. International Journal of Human-Computer Interaction 13, 1 (2001), 41--51.",
      "doi": ""
    },
    {
      "text": "Sears, A., Jacko, J.A., Chu, J., and Moro, F. The role of visual search in the design of effective soft keyboards. Behaviour & Information Technology 20, 3 (2001), 159--166.",
      "doi": ""
    },
    {
      "text": "Seow, S.C. Information theoretic models of HCI: A comparison of the Hick-Hyman law and Fitts' law. Human-Computer Interaction 20, 3 (2005), 315--352.  ",
      "doi": "10.1207/s15327051hci2003_3"
    },
    {
      "text": "Shih, H.M., and Ravindra, S.G. Effectiveness of menu orientation in Chinese. Human Factors 40, 4 (1998), 569--576.",
      "doi": ""
    },
    {
      "text": "Silfverberg, M., MacKenzie, I.S., and Korhonen, P. Predicting text entry speed on mobile phones. Proc. CHI 2000, ACM Press (2000), 9--16.  ",
      "doi": "10.1145/332040.332044"
    },
    {
      "text": "Soukoreff, R.W., and MacKenzie, I.S. Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard. Behaviour & Information Technology 14, 6 (1995), 370--379.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R.W., and MacKenzie, I.S. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies, 61, 6 (2004), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Statistics from Ministry of Industry and Information Technology of China. http://www.miit.gov.cn/n11293472/n11293832/n11294132/n11302706/12426281.html (in Chinese)",
      "doi": ""
    },
    {
      "text": "Tanaka-Ishii, K., Zhou, M., and Kim, J.-D. Text entry in East Asian languages. In I.S. MacKenzie and K. Tanaka-Ishii (eds.), Text Entry Systems: Mobility, Accessibility, Universality, pp. 203--225. Morgan Kaufmann, 2007.",
      "doi": ""
    },
    {
      "text": "Wang, J., Zhai, S., and Su, H. Chinese input with keyboard and eye-tracking: an anatomical study. Proc. CHI 2001, ACM Press (2001), 349--356.  ",
      "doi": "10.1145/365024.365298"
    },
    {
      "text": "Wolfe, J.M. Visual search. In H. Pashler (ed.), Attention, pp. 13--72. Psychology Press, 1998.",
      "doi": ""
    },
    {
      "text": "Zhai, S. Characterizing computer input with Fitts' law parameters: the information and non-information aspects of pointing. International Journal of Human-Computer Studies 61, 6 (2004), 791--809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    }
  ]
}