{
  "doi": "10.1145/1753326.1753596",
  "title": "Understanding the space for co-design in riders' interactions with a transit service",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1797-1806",
  "year": 2010,
  "badges": [],
  "abstract": "The recent advances in web 2.0 technologies and the rapid adoption of smart phones raises many opportunities for public services to improve their services by engaging their users (who are also owners of the service) in co-design: a dialog where users help design the services they use. To investigate this opportunity, we began a service design project investigating how to create repeated information exchanges between riders and a transit agency in order to create a virtual \"place\" from which the dialog on services could take place. Through interviews with riders, a workshop with a transit agency, and speed dating of design concepts, we have developed a design direction. Specifically, we propose a service that combines vehicle location and \"fullness\" ratings provided by riders with dynamic route change information from the transit agency as a foundation for a dialog around riders conveying input for continuous service improvement.",
  "authors": [
    {
      "name": "Daisy Yoo",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556772856",
      "orcid": "missing"
    },
    {
      "name": "John Zimmerman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81406592256/rel-imgonly/headshot2010.jpg",
      "acmid": "81406592256",
      "orcid": "missing"
    },
    {
      "name": "Aaron Steinfeld",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100236968/rel-imgonly/steinfeld_aaron_2_1400square.jpg",
      "acmid": "81100236968",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tomasic",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81309501235/rel-imgonly/anthonyphoto.jpg",
      "acmid": "81309501235",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abdel-Aty, M.A. Using ordered probit modeling to study the effect of ATIS on transit ridership, Transportation Research Part C: Emerging Technologies, 9, 4 (2001), 265--277.",
      "doi": ""
    },
    {
      "text": "Bradwell, P. and Marr, S. Making the Most of Collaboration an International Survey of Public Service Co-Design, DEMOS Report 23. (2008), DEMOS, in association with PriceWaterhouseCoopers (PWC) Public Sector Research Centre, London.",
      "doi": ""
    },
    {
      "text": "Bitner, M.J., Ostrom, A.L. and Morgan, F.N. Service Blueprinting: A Practical Technique for Service Innovation. California Management Review, 50, 3 (2008).",
      "doi": ""
    },
    {
      "text": "Beyer, H. and Holtzblatt, K. Contextual Design: Defining Customer-Centered Systems. Morgan Kaufmann, 1997. ",
      "doi": "10.5555/523184"
    },
    {
      "text": "Boyne, G.A. Sources of Public Service Improvement: A Critical Review and Research Agenda. Journal of Public Administration Research and Theory, 13, 3 (July 2003), 367--394.",
      "doi": ""
    },
    {
      "text": "Casey, C. Real-time information: Now arriving. Metro Magazine, http://www.metro-magazine.com/Article/Story/2003/04/Real-Time-Information-Now-Arriving.aspx (Accessed Sept 11, 2009).",
      "doi": ""
    },
    {
      "text": "Chang, A.M. and Kannan, P.K. Leveraging Web 2.0 in Government. E-Government/Technology Series, (2008) IBM Center for The Business of Government.",
      "doi": ""
    },
    {
      "text": "Crandall, W., Bentzen, B.L., Myers, L. and Brabyn, J. New Orientation and Accessibility Option for Persons with Visual Impairment: Transportation Applications for Remote Infrared Audible Signage. Clinical and Experimental Optometry, 84, 3 (2001), 120--131.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Lee, M.K., Dey, A.K. and Zimmerman, J. Rapidly Exploring Application Design through Speed Dating. In Proc. of UbiComp, (2007) Springer, 429--446. ",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Gildea, G., Sheikh, M. Applications of technology in providing transit information. In Transportation Research Record 1521, (1996), 71--76.",
      "doi": ""
    },
    {
      "text": "HumanWare: http://www.humanware.com/en-usa/products/gps (Accessed Sept 11, 2009).",
      "doi": ""
    },
    {
      "text": "iBurgh: http://www.appstorehq.com/iburgh-iphone-63857/app (Accessed Sep 11, 2009).",
      "doi": ""
    },
    {
      "text": "Kuusisto, A. and Päällysaho, S. Customer Role in Service Production and Innovation -- Looking for Directions for Future Research, Report 195, (2008) Lappeenranta University of Technology, http://akseli.tekes.fi/opencms/opencms/OhjelmaPortaali/ohjelmat/Serve/fi/Dokumenttiarkisto/Viestinta_ja_aktivointi/Julkaisut/Kuusisto_Paeaelllysaho_raportti.pdf. (Accessed: August 29, 2009).",
      "doi": ""
    },
    {
      "text": "Li, C., Willis, K. Modeling context aware interaction for wayfinding using mobile devices. In Proc. of MobileHCI (2006), ACM Press, 97--100.  ",
      "doi": "10.1145/1152215.1152235"
    },
    {
      "text": "Masoodian, M., Lane, N. 2003. An empirical study of textual and graphical travel itinerary visualization using mobile phones. In Proc of AUIC (2003), ACM Press, 11--18. ",
      "doi": "10.5555/820086.820090"
    },
    {
      "text": "Norman, D. The design of future things. 2007, New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Nuance: http://www.nuance.com/talks/wayfinder.asp (Accessed Sept 11, 2009).",
      "doi": ""
    },
    {
      "text": "Osimo, D. Web 2.0 in Government: Why and How. JRC Scientific and Technical Reports, EUR 23358 EN. (2008), Institute for Prospective Technological Studies, JRC European Commission.",
      "doi": ""
    },
    {
      "text": "Parameswaran, M. and Whinston, A.B. Research Issues in Social Computing. Journal of the Association for Information Systems, 8, 6 (2007), 336--350.",
      "doi": ""
    },
    {
      "text": "Parks, R.B., Baker, P.C., Kiser, L., Oakerson, R., Ostrom, E., Ostrom, V., Percy, S.L., Vandivord, M.B., Whitaker, G.P. and Wilson, R. Consumers as Coproducers of Public Services: Some Economic and Institutional Considerations. Policy Studies Journal, 9 (1999), 1001--1011.",
      "doi": ""
    },
    {
      "text": "ParkScan San Francisco: http://www.parkscan.org/ (Accessed Sept 11, 2009).",
      "doi": ""
    },
    {
      "text": "Repenning, A., Ioannidou, A. Mobility agents: guiding and tracking public transportation users. In Proc. of AVI (2006), ACM Press, 127--134.  ",
      "doi": "10.1145/1133265.1133292"
    },
    {
      "text": "Sabal, R. Television Executives Speak About Fan Letters to the Networks. In The Adoring Audience: Fan Culture and Popular Media. L.A. Lewis (eds). 1992, 185--187.",
      "doi": ""
    },
    {
      "text": "Steinfeld, A., Aziz, R., Von Dehsen, L., Park, S.Y., Maisel, J., & Steinfeld, E. (2010). Modality preference for rider reports on transit accessibility problems. Transportation Research Board 2010 Annual Meeting. Washington, DC: Transportation Research Board.",
      "doi": ""
    },
    {
      "text": "Transportation Research Board. Transit Cooperative Research Program Synthesis 37: Communicating with Persons with Disabilities in a Multimodal Transit Environment. 2001, National Academy Press.",
      "doi": ""
    },
    {
      "text": "Wang, F.-Y., Zeng, D., Carley, K.M. and Mao, W. Social Computing: From Social Informatics to Social Intelligence. IEEE Intelligent Systems, 22, 2 (2007), 79--83.  ",
      "doi": "10.1109/MIS.2007.41"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J. and Evenson, S. Research through Design as a Method for Interaction Design Research in HCI. In Proceedings CHI, (2007) ACM Press, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}