{
  "doi": "10.1145/1753326.1753373",
  "title": "Why pay?: exploring how financial incentives are used for question & answer",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "305-314",
  "year": 2010,
  "badges": [],
  "abstract": "Electronic commerce has enabled a number of online pay-for-answer services. However, despite commercial interest, we still lack a comprehensive understanding of how financial incentives support question asking and answering. Using 800 questions randomly selected from a pay-for-answer site, along with site usage statistics, we examined what factors impact askers' decisions to pay. We also explored how financial rewards affect answers, and if question pricing can help organize Q&A exchanges for archival purposes. We found that askers' decisions are two-part--whether or not to pay and how much to pay. Askers are more likely to pay when requesting facts and will pay more when questions are more difficult. On the answer side, our results support prior findings that paying more may elicit a higher number of answers and answers that are longer, but may not elicit higher quality answers (as rated by the askers). Finally, we present evidence that questions with higher rewards have higher archival value, which suggests that pricing can be used to support archival use.",
  "authors": [
    {
      "name": "Gary Hsieh",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Aggarwal, P. 2004. The Effects of Brand Relationship Norms on Consumer Attitudes and Behavior, Journal of Consumer Research, 31 (June), 87--101.",
      "doi": ""
    },
    {
      "text": "Anderson, J.C., & Moore, L. 1978. The motivation to volunteer. Journal of Voluntary Action Research, 51--60.",
      "doi": ""
    },
    {
      "text": "Batson, C.D., & Powell, A.A. 2003. Altruism and prosocial behavior. In T. Millon & M. J. Lerner (Eds.), Handbook of psychology, Volume 5: Personality and social psychology. 463--484.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Ho, T., Kim, Y. 2008 Knowledge Market Design: A field Experiment at Google Answers. Journal of Public Economics Theory. To Appear.",
      "doi": ""
    },
    {
      "text": "Chiang, J. 1991. A Simultaneous Approach to the Whether, What, and How Much to Buy Questions. Marketing Science, Vol. 10, 4. 297--315.",
      "doi": "10.1287/mksc.10.4.297"
    },
    {
      "text": "Clark, M.S. and Mills, J. 1993, The Difference Between Communal and Exchange Relationships: What It Is and Is Not, Personality and Social Psychology Bulletin, 19, 684--691.",
      "doi": ""
    },
    {
      "text": "Deci, E.L., Koestner, R., & Ryan, R.M. 1999. A Meta-Analytic Review of Experiments Examining the Effects of Extrinsic Rewards on Intrinsic Motivation. Psychological Bulletin, 125, 627--668.",
      "doi": ""
    },
    {
      "text": "DePaulo, B.M., & Fisher, J.D. 1980. The costs of asking for help. Basic and Applied Social Psychology, 1, 23--35.",
      "doi": ""
    },
    {
      "text": "Edelman, B. 2004. Earnings and Ratings at Google Answers. Unpublished Manuscript.",
      "doi": ""
    },
    {
      "text": "Fehr, E. and Gaechter, S., Do Incentive Contracts Crowd out Voluntary Cooperation?, IEW -- Working Papers iewwp034, Institute for Empirical Research in Economics -- IEW.",
      "doi": ""
    },
    {
      "text": "Fisher, J.D., DePaulo, B.M., & Nadler, A. Extending Altruism beyond the Altruistic Act: The effects of Aid on the Help Recipient. In Altruism and Helping behavior.",
      "doi": ""
    },
    {
      "text": "Greenberg, M.S. & Shapiro S.P. 1971. Indebtedness: An Adverse Aspect of Asking for and Receiving Help. Sociometry, Vol. 34, No. 2, 290--301.",
      "doi": ""
    },
    {
      "text": "Harper, F.M., Moy, D., and Konstan, J.A. 2009. Facts or Friends?: Distinguishing Informational and Conversational Questions in Social Q&A Sites. In Proc. of the SIGCHI '09, 759--768.  ",
      "doi": "10.1145/1518701.1518819"
    },
    {
      "text": "Harper, F.M., Raban, D., Rafaeli, S., and Konstan, J.A. 2008. Predictors of answer quality in online Q&A sites. In Proc. of the SIGCHI '08, 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Heyman, J. & Ariely, D. 2004. Effort for Payment: A Tale of Two markets, Psychological Science, 15 (11) 787--793.",
      "doi": ""
    },
    {
      "text": "Hsieh, G. and Counts, S. 2009. mimir: A Market-Based Real-Time Question and Answer Service. In Proc.s of the SICHI '09, 769--778.  ",
      "doi": "10.1145/1518701.1518820"
    },
    {
      "text": "Ipeirotis, P. 2008. Mechanical Turk: The Demographics. http://behind-the-enemy-lines.blogspot.com/2008/03/mechanical-turk-demographics.html",
      "doi": ""
    },
    {
      "text": "Kraut, R.E., Sunder, S., Telang, R., & Morris, J. 2005. Pricing electronic mail to solve the problem of spam. Human Computer Interaction, 20, 195--223.  ",
      "doi": "10.1207/s15327051hci2001%25262_7"
    },
    {
      "text": "Landis, J.R. and Koch, G.G. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics. Vol. 33, 159--174.",
      "doi": ""
    },
    {
      "text": "Leibenluft, J. 2007. A Librarian's Worst Nightmare. Yahoo! Answers, where 120 Million Users Can be Wrong. Slate Magazine, Dec. 7, 2007.",
      "doi": ""
    },
    {
      "text": "Mahalo Answers. www.mahalo.com/answers",
      "doi": ""
    },
    {
      "text": "Nam, K.K., Ackerman, M.S., and Adamic, L.A. 2009. Questions in, knowledge in?: a study of naver's question answering community. In Proc. of the SIGCHI '09. ACM, New York, NY, 779--788.  ",
      "doi": "10.1145/1518701.1518821"
    },
    {
      "text": "Raban, D.R. 2008. The Incentive Structure in an Online Information Market. Journal of the American Society for Information Science and Technology 59(14): 2284--2295.  ",
      "doi": "10.5555/1464476.1464487"
    },
    {
      "text": "Rafaeli, S., Raban, D., Ravid, G. 2007. How Social Motivation Enhances Economic Activity and Incentives in the Google Answers Knowledge Sharing Market. International Journal of Knowledge and Learning 3, 1, 1--11.",
      "doi": ""
    },
    {
      "text": "Regner, T. 2005. Why Voluntary Contributions? Google Answer! CMPO Working Paper Series.",
      "doi": ""
    },
    {
      "text": "Snow, R., O'Connor, B., Jurafsky, D., Ng, A. 2008. Cheap and Fast -- But is it Good? Evaluation Non-Expert Annotations for Natural Language Tasks. In Proc. of EMNLP, 254--263. ",
      "doi": "10.5555/1613715.1613751"
    },
    {
      "text": "Wentzel, K.R. 1991. Social Competence at School: Relation Between Social Responsibility and Academic Achievement. Review of Educational Research, 1991; 61: 1--24.",
      "doi": ""
    },
    {
      "text": "Wills, T.A. 1976. Perceptual Consequences of Helping Another Person. Paper presented at the meeting of the American Psychological Association, Washington, D.C., September 1976.",
      "doi": ""
    },
    {
      "text": "Wills T.A. 1978. Perceptions of Clients by Professional Helpers. Psychological Bulletin, 85, 968--1000.",
      "doi": ""
    },
    {
      "text": "Zelizer, V.A. 1994. The Social Meaning of Money. Basic Books, New York, NY.",
      "doi": ""
    }
  ]
}