{
  "doi": "10.1145/1753326.1753378",
  "title": "Crosstrainer: testing the use of multimodal interfaces in situ",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "333-342",
  "year": 2010,
  "badges": [],
  "abstract": "We report the results of an exploratory 8-day field study of CrossTrainer: a mobile game with crossmodal audio and tactile feedback. Our research focuses on the longitudinal effects on performance with audio and tactile feedback, the impact of context such as location and situation on performance and personal modality preference. The results of this study indicate that crossmodal feedback can aid users in entering answers quickly and accurately using a variety of different widgets. Our study shows that there are times when audio is more appropriate than tactile and vice versa and for this reason devices should support both tactile and audio feedback to cover the widest range of environments, user preference, locations and tasks.",
  "authors": [
    {
      "name": "Eve Hoggan",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484652",
      "orcid": "missing"
    },
    {
      "name": "Stephen A. Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "Bernsen, N. O. Modality Theory in Support of Multi-modal Interface Design. ERCIM Workshop on Multi-modal HCI (1993), 27--44.",
      "doi": ""
    },
    {
      "text": "Brewster, S. A. Overcoming the Lack of Screen Space on Mobile Computers. Personal and Ubiquitous Computing 6 (2002), 188--205.  ",
      "doi": "10.1007/s007790200019"
    },
    {
      "text": "Brewster, S. A. Sound in the Interface to a Mobile Computer. In Proc. HCI International '99, Lawrence Erlbaum Associates (1999), 43--47. ",
      "doi": "10.5555/647944.743473"
    },
    {
      "text": "Brewster, S. A., Wright, P. C., and Edwards, A. D. N. Experimentally Derived Guidelines for the Creation of Earcons. In Proc. HCI '95, Springer (1995), 155--159.",
      "doi": ""
    },
    {
      "text": "Brown, L. M. and Brewster, S. A. Multidimensional Tactons for Non-Visual Information Display in Mobile Devices. In Proc. MobileHCI '06, ACM Press (2006), 231--238.  ",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Enriquez, M. and MacLean, K. The Role of Choice in Longitudinal Recall of Meaningful Tactile Signals. In Proc. IEEE Symposium on Haptic Interfaces for Virtual Environments and Teleoperator Systems, IEEE (2008), 49--56.  ",
      "doi": "10.1109/HAPTICS.2008.4479913"
    },
    {
      "text": "Garzonis, S. et al. Auditory Icon and Earcon Mobile Service Notifications: Intuitiveness, Learnability, Memorability and Preference. In Proc. CHI '09, ACM Press (2009), 1513 -- 1522.  ",
      "doi": "10.1145/1518701.1518932"
    },
    {
      "text": "Hoggan, E. and Brewster, S. A. Designing audio and tactile crossmodal icons for mobile devices. In Proc. ICMI '07, ACM Press (2007), 162--169.  ",
      "doi": "10.1145/1322192.1322222"
    },
    {
      "text": "Hoggan, E., Brewster, S. A., and Johnston, J. Investi--gating the Effectiveness of Tactile Feedback for Mo--bile Touchscreens. In Proc. CHI '08, ACM Press (2008), 1573--1582.  ",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "Hoggan, E., Crossan, A., Brewster, S. A., and Kaaresoja, T. Audio or Tactile Feedback: Which Modality When? In Proc. CHI '09, ACM Press (2009), 2253--2256.  ",
      "doi": "10.1145/1518701.1519045"
    },
    {
      "text": "Kaaresoja, T., Brown, L. M., and Linjama, J. Snap-Crackle-Pop: Tactile Feedback for Mobile Touch Screens. In Proc. Eurohaptics, (2006), 565--566.",
      "doi": ""
    },
    {
      "text": "Koskinen, E., Kaaresoja, T., and Laitinen, P. Feel-Good Touch: Finding the Most Pleasant Tactile Feed-back for a Mobile Touch Screen Button. In Proc. ICMI '08, ACM Press (2008), 297--304.  ",
      "doi": "10.1145/1452392.1452453"
    },
    {
      "text": "Laitinen, P. and Mäenpää, J. Enabling Mobile Haptic Design: Piezoelectric Actuator Technology Properties in Handheld Devices. In Proc. HAVE '06, (2006).",
      "doi": ""
    },
    {
      "text": "Lederman, S. J. and Klatzky, R. L. New Directions in Touch. Canadian Journal of Experimental Psychology 61 (2007), 169--170.",
      "doi": ""
    },
    {
      "text": "Lee, S. and Zhai, S. The Performance of Touch Screen Soft Buttons. In Proc. CHI '09, ACM Press (2009), 309--318.  ",
      "doi": "10.1145/1518701.1518750"
    },
    {
      "text": "Lewkowicz, D. J. The Development of Intersensory Temporal Perception: An Epigenetic Systems/Limitations View. Psychological Bulletin 126 (2000), 281--308.",
      "doi": ""
    },
    {
      "text": "Luk, J. et al. A role for haptics in mobile interaction: initial design using a handheld tactile display prototype In Proc. CHI '06, ACM Press (2006), 171--180.  ",
      "doi": "10.1145/1124772.1124800"
    },
    {
      "text": "Mackenzie, I. S., Zhang, S., and Soukoreff, R. W. Text Entry Using Soft Keyboards. Behaviour and Information Technology 18 (1999), 235--244.",
      "doi": ""
    },
    {
      "text": "Mortimer, B., Zets, G., and Cholewiak, R. W. Vibrotactile Transduction and Transducers. The Journal of the Acoustic Society of America 121 (2007), 2970--2977.",
      "doi": ""
    },
    {
      "text": "Poupyrev, I. and Maruyama, S. Tactile Interfaces for Small Touch Screens. In Proc. 16th Annual ACM Sym--posium on User Interface Software and Technology, ACM Press (2003), 217--220.  ",
      "doi": "10.1145/964696.964721"
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. Metrics for Text Entry Research: an Evaluation of MSD and KSPC, and a new Unified Error Metric. In Proc. CHI '03, ACM Press (2003), 113--120.  ",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "Williamson, J., Murray-Smith, R., and Hughes, S. Shoogle: excitatory multimodal interaction on mobile devices. In Proc. CHI'07, ACM Press (2007), 121--124.  ",
      "doi": "10.1145/1240624.1240642"
    }
  ]
}