{
  "doi": "10.1145/1753326.1753390",
  "title": "The infrastructure problem in HCI",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "423-432",
  "year": 2010,
  "badges": [],
  "abstract": "HCI endeavors to create human-centered computer systems, but underlying technological infrastructures often stymie these efforts. We outline three specific classes of user experience difficulties caused by underlying technical infrastructures, which we term constrained possibilities, unmediated interaction, and interjected abstractions. We explore how prior approaches in HCI have addressed these issues, and discuss new approaches that will be required for future progress. We argue that the HCI community must become more deeply involved with the creation of technical infrastructures. Doing so, however, requires a substantial expansion to the methodological toolbox of HCI.",
  "authors": [
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Mark W. Newman",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594629",
      "orcid": "0000-0001-7186-1383"
    },
    {
      "name": "Erika Shehan Poole",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339522411",
      "orcid": "0000-0003-4228-2336"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S.: The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human-Computer Interaction, 15(2--3):179--203, (2000)  ",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Bell, M., et al.: Interweaving Mobile Games with Everyday Life. ACM CHI 2006 417--426  ",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Bhattacharjee, S., Calvert, K.L. and Zegura, E.W.: An Architecture for Active Networking. Proceedings of the Seventh IFIP Conference on High Performance Networking, White Plains, NY, USA (1997) 265--279 ",
      "doi": "10.5555/267213.267289"
    },
    {
      "text": "Blumenthal, M.S. and Clark, D.D.: Rethinking the Design of the Internet: The End-to-End Arguments vs. the Brave New World. ACM Trans. on Internet Tech., 1(1):70--109, (2001)  ",
      "doi": "10.1145/383034.383037"
    },
    {
      "text": "Bly, S., et al.: Broken Expectations in the Digital Home. ACM CHI 2006 568--573  ",
      "doi": "10.1145/1125451.1125571"
    },
    {
      "text": "Calvert, K.L., Edwards, W.K. and Grinter, R.E.: Moving Toward the Middle: The Case Against the End-to-End Argument in Home Networking. ACM HotNets--VI (2007)",
      "doi": ""
    },
    {
      "text": "Cao, X. and Iverson, L.: Intentional Access Management: Making Access Control Usable for End-Users. ACM SOUPS 2006 20--31  ",
      "doi": "10.1145/1143120.1143124"
    },
    {
      "text": "Card, S.K., Moran, T.P. and Newell, A.: The Psychology of Human-Computer Interaction. Erlbaum (1983) ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chetty, M., Sung, J.-Y. and Grinter, R.E.: How Smart Homes Learn: The Evolution of the Networked Home and Household. Ubicomp 2007 127--144 ",
      "doi": "10.5555/1771592.1771600"
    },
    {
      "text": "Chun, B., et al.: PlanetLab: an overlay testbed for broad-coverage services. SIGCOMM Comput. Commun. Rev., 33(3):3--12, (2003)  ",
      "doi": "10.1145/956993.956995"
    },
    {
      "text": "Dabrowski, J.R. and Munson, E.V.: Is 100 Milliseconds Too Fast? : CHI 2001 317--318  ",
      "doi": "10.1145/634067.634255"
    },
    {
      "text": "Dey, A.K., Abowd, G.D. and Salber, D.: A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-Aware Applications. Hum.-Comput. Interact., 16(2):97--166, (2001)  ",
      "doi": "10.1207/S15327051HCI16234_02"
    },
    {
      "text": "Dey, A.K. and Newberger, A.: Support for Context-Aware Intelligibility and Control. ACM CHI 2009 859--868  ",
      "doi": "10.1145/1518701.1518832"
    },
    {
      "text": "Dourish, P.: Developing a Reflective Model of Collaborative Systems. ACM ToCHI, 2(1):40--63, (1995)  ",
      "doi": "10.1145/200968.200970"
    },
    {
      "text": "Dourish, P.: Accounting for System Behaviour. Computers and Design in Context (1997) 145--170 ",
      "doi": "10.5555/270318.270324"
    },
    {
      "text": "Dourish, P., et al.: Extending Document Management Systems with User-Specific Active Properties. ACM Trans. Inf. Syst., 18(2):140--170, (2000)  ",
      "doi": "10.1145/348751.348758"
    },
    {
      "text": "Edwards, W.K., et al.: Stuck in the Middle: The Challenges of User-Centered Design and Evaluation for Infrastructure. ACM CHI 2003:297--304, (2003)  ",
      "doi": "10.1145/642611.642664"
    },
    {
      "text": "Edwards, W.K. and Grinter, R.E.: At Home With Ubiquitous Computing: Seven Challenges. Ubicomp 2001 256--272 ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Edwards, W.K., et al.: Experiences with Recombinant Computing. ACM ToCHI, 16(1):1--44, (2009)  ",
      "doi": "10.1145/1502800.1502803"
    },
    {
      "text": "Edwards, W.K., et al.: Using Speakeasy for Ad Hoc Peer to Peer Collaboration. ACM CSCW 2002 256--265  ",
      "doi": "10.1145/587078.587114"
    },
    {
      "text": "Glasson, J.: Introduction to Environmental Impact Assessment. Routledge (2005)",
      "doi": ""
    },
    {
      "text": "Grinter, R.E., et al.: The Work to Make a Home Network Work. ECSCW 2005 469--488 ",
      "doi": "10.5555/1242029.1242053"
    },
    {
      "text": "Hong, J.I. and Landay, J.A.: An Architecture for Privacy-Sensitive Ubiquitous Computing. ACM MobiSys 2004 177--189  ",
      "doi": "10.1145/990064.990087"
    },
    {
      "text": "Hong, J.I. and Landay, J.A.: SATIN: a Toolkit for Informal Ink-Based Applications. ACM UIST 2000 63--72  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "Horrigan, J.: Home Broadband Adoption 2009. Pew Internet & American Life, Washington, DC, USA (2009)",
      "doi": ""
    },
    {
      "text": "Johanson, B. and Fox, A.: Extending Tuplespaces for Coordination in Interactive Workspaces. J. Syst. Softw., 69(3):243--266, (2004)  ",
      "doi": "10.1016/S0164-1212%2803%2900054-2"
    },
    {
      "text": "John, B.E., et al.: Bringing Usability Concerns to the Design of Software Architecture. Engineering HCI and Interactive Systems. Springer (2005) 1--19  ",
      "doi": "10.1007/11431879_1"
    },
    {
      "text": "Kiczales, G., des Rivieres, J. and Bobrow, D.: The Art of the Meta-Object Protocol. MIT Press, Cambridge (1991) ",
      "doi": "10.5555/574212"
    },
    {
      "text": "Klemmer, S.R., et al.: Papier-Mache: Toolkit Support for Tangible Input. ACM CHI 2004 399--406  ",
      "doi": "10.1145/985692.985743"
    },
    {
      "text": "Lampson, B.: Protection. ACM SIGOPS Operating Systems Review, 8(1):18--24, (1974)  ",
      "doi": "10.1145/775265.775268"
    },
    {
      "text": "Lee, C., Dourish, P. and Mark, G.: The Human Infrastructure of Cyberinfrastructure. ACM CSCW 2006. 483--492  ",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Leopold, L.B., et al.: A Procedure for Evaluating Environmental Impact. U.S. Geological Survey (1971)",
      "doi": ""
    },
    {
      "text": "Lim, B.Y., Dey, A.K. and Avrahami, D.: Why and Why Not Explanations Improve the Intelligibility of Context-Aware Intelligent Systems. ACM CHI 2009 2119--2128  ",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Maeda, C., et al.: Open Implementation Analysis and Design. SIGSOFT Softw. Eng. Notes, 22(3):44--52, (1997)  ",
      "doi": "10.1145/258368.258383"
    },
    {
      "text": "Mainwaring, S.D., Chang, M.F. and Anderson, K.: Infrastructures and Their Discontents: Implications for Ubicomp. Ubicomp 2004 418--432",
      "doi": ""
    },
    {
      "text": "Maxion, R.A. and Reeder, R.W.: Improving User-Interface Dependability Through Mitigation of Human Error. Int. J. Hum.-Comput. Stud., 63(1--2):25--50, (2005)  ",
      "doi": "10.1016/j.ijhcs.2005.04.009"
    },
    {
      "text": "McDonald, D.W., Smith, K.A. and Karlova, N.: Problem Solving Probes: A Method for Discovering Conceptual Disconnects with Digital Living Technologies. ACM CSCW 2008 Designing for Families Workshop",
      "doi": ""
    },
    {
      "text": "Miller, B., et al.: Home Networking with Universal Plug and Play. IEEE Communications, 39(12):104--109, (2001)  ",
      "doi": "10.1109/35.968819"
    },
    {
      "text": "Miller, R.B.: Response Time in Man-Computer Conversational Transactions. December 1968 Fall Joint Computer Conference (1968)  ",
      "doi": "10.1145/1476589.1476628"
    },
    {
      "text": "Myers, B., Hudson, S.E. and Pausch, R.: Past, Present, and Future of User Interface Software Tools. ACM ToCHI, 7(1):3--28, (2000)  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Newman, W.M.: Better or just different? On the benefits of designing interactive systems in terms of critical parameters. ACM DIS 1997 239--245  ",
      "doi": "10.1145/263552.263615"
    },
    {
      "text": "Nichols, J., et al.: Generating Remote Control Interfaces for Complex Appliances. ACM UIST 2002 161--170  ",
      "doi": "10.1145/571985.572008"
    },
    {
      "text": "Norman, D.A.: The Design of Everyday Things. Basic Books (2002) ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Olsen, D.R.: Evaluating User Interface Systems Research. ACM UIST 2007 251--258  ",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Olsen, D.R., et al.: Cross-Modal Interaction Using XWeb. ACM UIST 2000 191--200  ",
      "doi": "10.1145/354401.354764"
    },
    {
      "text": "Olson, J.S., Grudin, J. and Horvitz, E.: A Study of Preferences for Sharing and Privacy. ACM CHI 2005 1985--1988  ",
      "doi": "10.1145/1056808.1057073"
    },
    {
      "text": "Oppenheimer, P.: Top-down network design. Cisco (1998) ",
      "doi": "10.5555/521025"
    },
    {
      "text": "Palen, L. and Dourish, P.: Unpacking \"Privacy\" for a Networked World. ACM CHI 2003 129--136  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Rodden, T. and Benford, S.: The evolution of buildings and implications for the design of ubiquitous domestic environments. ACM CHI 2003  ",
      "doi": "10.1145/642611.642615"
    },
    {
      "text": "Salber, D., Dey, A.K. and Abowd, G.D.: The Context Toolkit: Aiding the Development of Context-Enabled Applications. ACM CHI 1999 434--441  ",
      "doi": "10.1145/302979.303126"
    },
    {
      "text": "Sandhu, R. and Samarati, P.: Access control: Principle and Practice. IEEE Communications, 32(9):40--48, (1994)",
      "doi": "10.1109/35.312842"
    },
    {
      "text": "Shehan, E. and Edwards, W.K.: Home Networking and HCI: What Hath God Wrought? : CHI 2007 547--556  ",
      "doi": "10.1145/1240624.1240712"
    },
    {
      "text": "Stankovic, J. and Ramamritham, K.: A Reflective Architecture for Real-Time Operating Systems. Advances in Real-Time Systems:23--38, (1995) ",
      "doi": "10.5555/207721.207723"
    },
    {
      "text": "Star, S.L.: The Ethnography of Infrastructure. The American Behavior Scientist, 43(3):377--391, (1999)",
      "doi": ""
    },
    {
      "text": "Star, S.L. and Ruhleder, K.: Steps towards an ecology of infrastructure: complex problems in design and access for large-scale collaborative systems. ACM CSCW 1994 253--264  ",
      "doi": "10.1145/192844.193021"
    },
    {
      "text": "Tolia, N., Andersen, D.G. and Satyanarayanan, M.: Quantifying Interactive User Experience on Thin Clients. Computer, 39(3):46--52, (2006)  ",
      "doi": "10.1109/MC.2006.101"
    },
    {
      "text": "Tolmie, P., et al.: Unremarkable computing. ACM CHI 2002. pp. 399--406  ",
      "doi": "10.1145/503376.503448"
    },
    {
      "text": "Voida, S., et al.: Share and Share Alike: Exploring User Interface Affordances of File Sharing. ACM CHI 2006 221--230  ",
      "doi": "10.1145/1124772.1124806"
    },
    {
      "text": "Westman, W.E.: Ecology, Impact Assessment, and Environmental Planning. Wiley (1985)",
      "doi": ""
    },
    {
      "text": "Whitten, A. and Tygar, J.D.: Why Johnny Can't Encrypt: A Usability Evaluation of PGP 5.0. USENIX Security Symposium (1999) ",
      "doi": "10.5555/1251421.1251435"
    }
  ]
}