{
  "doi": "10.1145/1753326.1753556",
  "title": "Faster progress bars: manipulating perceived duration with visual augmentations",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1545-1548",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Human perception of time is fluid, and can be manipulated in purposeful and productive ways. In this note, we propose and evaluate variations on two visual designs for progress bars that alter users' perception of time passing, and \"appear\" faster when in fact they are not. As a baseline, we use standard, solid-color progress bars, prevalent in many user interfaces. In a series of direct comparison tests, we are able to rank how these augmentations compare to one another. We then show that these designs yield statistically significantly shorter perceived durations than progress bars seen in many modern interfaces, including Mac OSX. Progress bars with animated ribbing that move backwards in a decelerating manner proved to have the strongest effect. In a final experiment, we measured the effect of this particular progress bar design and showed that it reduces the perceived duration among our participants by 11%.",
  "authors": [
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    },
    {
      "name": "Zhiquan Yeo",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81416604320/rel-imgonly/face.jpg",
      "acmid": "81416604320",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Allan, L.G. ''The perception of time.'' Perception and Psycho-physics, vol. 26, 1997, 340--354.",
      "doi": ""
    },
    {
      "text": "Brown, S. W. \"The attenuation effect in timing: Counteracting dual-task interference with time-judgment skill training.\" Perception, 37(5), 2008, 712--724.",
      "doi": ""
    },
    {
      "text": "Gescheider, G.A. Psychophysics: The Fundamentals. 3rd Edition. Lawrence Erlbaum Associates Inc., Mahwah, NJ., 1997.",
      "doi": ""
    },
    {
      "text": "Harrison, C., Amento, B., Kuznetsov, S., and Bell, R. Rethinking the progress bar. In Proc. UIST '07, 115--118.  ",
      "doi": "10.1145/1294211.1294231"
    },
    {
      "text": "Harrison, C., Amento, B., Kuznetsov, S., and Bell, R. Rethinking the progress bar. In Proc. UIST '07, 115--118.  ",
      "doi": "10.1145/1294211.1294231"
    },
    {
      "text": "Hildebrandt, M., Dix, A., and Meyer, H.A. Time Design. In CHI '04 Ext. Abst., 1737--1738.  ",
      "doi": "10.1145/985921.986208"
    },
    {
      "text": "Kolers, P.A. Aspects of Motion Perception. Pergamon Press Inc., New York, 1972.",
      "doi": ""
    },
    {
      "text": "McAuley, J.D. On the Perception of Time as Phase: Toward an Adaptive-Oscillator Model of Rhythm. PhD thesis, Indiana University, Bloomington, IN, 1995. ",
      "doi": "10.5555/240103"
    },
    {
      "text": "Myers, B.A. The importance of percent--done progress indica-tors for computer-human interfaces. In Proc. CHI '85, 11--17.  ",
      "doi": "10.1145/317456.317459"
    },
    {
      "text": "Seow S. C. Designing and Engineering Time: The Psychology of Time Perception in Software. Pearson Education, Boston, MA, 2008. ",
      "doi": "10.5555/1377538"
    },
    {
      "text": "Schiffman, H.R. Sensation and Perception: An Integrated Approach. 2nd ed. John Wiley & Sons, New York, 1982.",
      "doi": ""
    },
    {
      "text": "Tognazzini, B. Principles, Techniques, and Ethics of Stage Magic and Their Application to Human Interface Design. In Proc. INTERCHI '93, 355--362. ",
      "doi": "10.5555/164632.164946"
    },
    {
      "text": "Vierordt, K.V. Der Zeitsinn nach Versuchen. Tubingen: H. Laupp. 1868, 4--191.",
      "doi": ""
    }
  ]
}