{
  "doi": "10.1145/1753326.1753507",
  "title": "Constructing identities through storytelling in diabetes management",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1203-1212",
  "year": 2010,
  "badges": [],
  "abstract": "The continuing epidemics of diabetes and obesity create much need for information technologies that can help individuals engage in proactive health management. Yet many of these technologies focus on such pragmatic issues as collecting and presenting health information and modifying individuals' behavior. At the same time, researchers in clinical community argue that individuals' perception of their identity has dramatic consequences for their health behaviors. In this paper we discuss results of a deployment study of a mobile health monitoring application. We show how individuals with considerable diabetes experience found a unique way to adopt this health-monitoring application to construct and negotiate their identities as persons with a chronic disease. We argue that viewing health management from identity construction perspective opens new opportunities for research and design in technologies for health.",
  "authors": [
    {
      "name": "Lena Mamykina",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500656179",
      "orcid": "missing"
    },
    {
      "name": "Andrew D. Miller",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81460650224/rel-imgonly/miller2017.jpg",
      "acmid": "81460650224",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    },
    {
      "name": "Daniel Greenblatt",
      "institution": "SMART Technologies, Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488430",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, S., Pill, R., & Jones, A. 1997, Medication, Chronic Illness And Identity: The Perspective Of People With Asthma. Social Science & Medicine, 45, 189--201.",
      "doi": ""
    },
    {
      "text": "Bandura, A. 1994, Self-efficacy. In V. S. Ramachaudran (Ed.), Encyclopedia of human behavior (Vol. 4, pp. 71--81). New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Bers. M. 2007, Civic Identities, Online Technologies: From Designing Civics Curriculum to Supporting Civic Experiences. The John D. and Catherine T. MacArthur Foundation Series on Digital Media and Learning",
      "doi": ""
    },
    {
      "text": "boyd, d. 2008 Taken Out of Context: American Teen Sociality in Networked Publics. Dissertation. University of California, Berkeley.",
      "doi": ""
    },
    {
      "text": "Calvert, S.L. 2002, Identity Construction on the Internet. In S.L. Calvert, A.B. Jordan & R.R. Cocking (Eds.), Children in the Digital Age: Influences of Electronic Media on Development (pp. 57--70), Westport, CT: Praeger. ",
      "doi": "10.5555/560704"
    },
    {
      "text": "Carter, J.S., Perez, G.E., Gilliland, S.S., 1999, Communicating through Stories: experience of the native American Diabetes Project. The Diabetes Educator 1999; 25(2): 179--188.",
      "doi": ""
    },
    {
      "text": "Charon, R., 2004, Narrative and Medicine. New England Journal of Medicine 2004; 350(9):862--864.",
      "doi": ""
    },
    {
      "text": "Charmaz, K. 1983, Loss of self: A fundamental form of suffering in the chronically ill, Sociology of Health and Illness, 5, 168--195.",
      "doi": ""
    },
    {
      "text": "Charmaz, K. 1995, Identity dilemmas of chronically ill men. In D. Sabo & D. Gordon (Eds.). Men's health and illness-Gender, power and the body (pp. N 266--291). Sage: London.",
      "doi": ""
    },
    {
      "text": "Collins, W.A., & Kuczaj, S.A. 1991, Developmental Psychology: Childhood and Adolescence. New York: MacMIllan Publishing Company.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Everitt, K., Smith, I., and Landay, J. A. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems Montréal, Québec, Canada, April 22--27, 2006.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Cooley, C.H., (1902) Human Nature and the Social Order. New York: Scribner.",
      "doi": ""
    },
    {
      "text": "Crystal, D. 2001, Language and the Internet. Cambridge: Cambridge University Press. ",
      "doi": "10.5555/501493"
    },
    {
      "text": "Erikson, E., 1968, Identity: Youth and Crisis. New York: Norton.",
      "doi": ""
    },
    {
      "text": "Erez, M., & Earley, P.C., 1993, Culture, Self--Identity and Work. New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T., and Pacenti, E. 1999, Design: Cultural probes. interactions 6, 1 (Jan. 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Goffman, E. (1959). The presentation of self in everyday life. New York: Anchor Books.",
      "doi": ""
    },
    {
      "text": "Greenfield, P.M., & Subrahmanyam, K. 2003, Online Discource in a Teen Chatroom: New Codes and New Modes of Coherence in a visual medium. Journal of Applied Developmental Psychology, 24, 713--738.",
      "doi": ""
    },
    {
      "text": "Hall., 1996, Who needs identity. Questions of cultural identity pp. 1--17",
      "doi": ""
    },
    {
      "text": "Harter, S. 1998, The development of self-representations. In W. Damon & N. Eisenberg (Eds.), Handbook of Child Psychology; Vol. 3: Social, Emotional, and Personality Development, 5th ed. (pp. 553--617). New York: Wiley.",
      "doi": ""
    },
    {
      "text": "Hayes, G., Abowd, G., Davis, J., Blount, M., Ebling, M., and Mynatt, E. 2008, Opportunities for pervasive computing in chronic cancer care. Lecture Notes in Computer Science, 2008--Springer, pages 262--279.  ",
      "doi": "10.1007/978-3-540-79576-6_16"
    },
    {
      "text": "Herring, S.C. 2000, Gender differences in CMC: Findings and implications. Computer Professionals for Social Responsibility Journal, 18 (1).",
      "doi": ""
    },
    {
      "text": "Holland, D., Lachicotte, W., Skinner, D., and Cain, C., 1998, Identity and Agency in Cultural Worlds. Harvard University Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Høybye MT, Johansen C, Tjørnhøj-Thomsen T., 2005 Online interaction. Effects of storytelling in an internet breast cancer support group. Psychooncology. 2005 Mar;14(3):211--20.",
      "doi": ""
    },
    {
      "text": "Huffaker, D.A., Calvert, S.L., 2005 Gender, Identity and Language Use in Teenage Blogs, Journal of Computer-Mediated Communication, 10(2), article 1.",
      "doi": ""
    },
    {
      "text": "Jafarinaimi, N., Forlizzi, J., Hurst, A., and Zimmerman, J. 2005. Breakaway: an ambient display designed to change human behavior. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA, April 02 -- 07, 2005). CHI '05, 1945--1948.  ",
      "doi": "10.1145/1056808.1057063"
    },
    {
      "text": "Kelleher, D. 1988 Coming to terms with diabetes: Coping strategies and non-compliance. In R. Anderson & M. Bury (Eds.), Living with chronic illness: The experience of patients and their families (pp. 137--155). London: Unwin Hyman.",
      "doi": ""
    },
    {
      "text": "Landry, B.M., Guzdial, M. 2006 iTell: supporting retrospective storytelling with digital photos. Conference on Designing Interactive Systems 2006: 160--168  ",
      "doi": "10.1145/1142405.1142432"
    },
    {
      "text": "Lin, J., Mamykina, L., Delajoux, G., Lindtner, S., Strub, H., 2006 Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game, UbiComp'06, Springer-Verlag Berlin Heidelberg  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Mamykina, L., Mynatt, E., Davidson, P., and Greenblatt, D. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceeding of the SIGCHI Conference on Human Factors in Computing Systems. CHI '08. ACM, New York, NY, 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Mead, C. W. 1974. Mind, self and society from the standpoint of a social behaviorist, Endocrine Disorders, 31, 737--747.",
      "doi": ""
    },
    {
      "text": "Nardi, B., Whittaker, S. & Bradner, E. 2000. Interaction and outeraction: Instant messaging in action. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. New York, NY: ACM Press, pp. 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Sengers, P. & Gaver, B. 2006. Staying open to interpretation: Engaging multiple meanings in design and evaluation. In Proceedings of the ACM Conference on Designing Interactive Systems. New York, NY: ACM Press, pp. 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Strauss, A.L., Corbin A. 1990 Basics of Qualitative Research: Grounded Theory Procedures and Techniques, Newbury Park.",
      "doi": ""
    },
    {
      "text": "Tilden, B., Charman, D., Sharples, J., and Fosbury, J., 2005 Identity and Adherence in a Diabetes Patient: Transformations in Psychotherapy, Qualitative Health Research, 15 (3). pp.312 to 324.",
      "doi": ""
    },
    {
      "text": "Turkle, S. 1995 Life on the Screen. New York: Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Voida, A., Grinter, R.E., Ducheneaut, N., Edwards, W.K. & Newman, M.W. 2005. Listening in: Practices surrounding iTunes music sharing. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems. New York, NY: ACM Press, pp. 191--200  ",
      "doi": "10.1145/1054972.1054999"
    }
  ]
}