{
  "doi": "10.1145/1753326.1753361",
  "title": "The rogue in the lovely black dress: intimacy in world of warcraft",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "233-242",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we present a critical analysis of player accounts of intimacy and intimate experiences in the massively multiplayer online role-playing game World of Warcraft (WoW). Our analysis explores four characteristics that players articulated about their virtual intimate experiences: the permeability of intimacy across virtual and real worlds, the mundane as the origin of intimacy, the significance of reciprocity and exchange, and the formative role of temporality in shaping understandings and recollections of intimate experiences. We also consider the manifest ways that WoW's software features support and encourage these characteristics.",
  "tags": [
    "massively multiplayer online games",
    "reciprocity",
    "sociability",
    "intimacy",
    "world of warcraft",
    "virtual worlds"
  ],
  "authors": [
    {
      "name": "Tyler Pace",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580480",
      "orcid": "missing"
    },
    {
      "name": "Shaowen Bardzell",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    },
    {
      "name": "Jeffrey Bardzell",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057577",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bardzell, J., and Bardzell, S. Intimate interactions: On-line representation and software of the self. Interactions xv 5, ACM Press (2008), 11--15.  ",
      "doi": "10.1145/1390085.1400111"
    },
    {
      "text": "Bardzell, S., Bardzell, J., Pace, T., and Reed, K. Bliss-fully productive: grouping and cooperation in World of Warcraft instance runs. Proc. of CSCW'08, ACM Press (2008), 357--360.  ",
      "doi": "10.1145/1460563.1460621"
    },
    {
      "text": "Bhandari, S. and Bardzell, S. Bridging gaps: affective communication in long distance relationships. Extended Abstracts of CHI'08, ACM Press (2008), 2763--2768.  ",
      "doi": "10.1145/1358628.1358758"
    },
    {
      "text": "Boellstorff, T. Coming of Age in Second Life: An Anthropologist Explores the Virtually Human. Princeton: Princeton University Press (2008). ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Brown, B. and Bell, M. CSCW at play: There as a collaborative virtual environment. Proc. of CSCW'04, ACM Press (2004), 350--359.  ",
      "doi": "10.1145/1031607.1031666"
    },
    {
      "text": "Cheal, D. Showing them you love them: Gift giving and the dialectic of intimacy. The Sociological Review 35(1), 1987, 150--169.",
      "doi": ""
    },
    {
      "text": "Chen, M. (2009). Communication, coordination, and camaraderie in World of Warcraft. Games and Culture, Jan. 2009; Vol. 4: pp. 47--73.",
      "doi": ""
    },
    {
      "text": "Denes, M. Existential Approaches to Intimacy. In M. Fisher & G. Stricker (Eds.). Intimacy. New York: Plenum Press (1982), 127--140.",
      "doi": ""
    },
    {
      "text": "Douglas, M. Introduction. In Mauss, M. The Gift. W.W. Norton & Company (2000).",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N. and Moore, R. The social side of gaming: A study of interaction patterns in a massively multiplayer online game. Proc. of CSCW'04, ACM Press (2004), 360--369.  ",
      "doi": "10.1145/1031607.1031667"
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E. and Moore, R. \"Alone Together?\" Exploring the social dynamics of massively multiplayer online games. Proc. of CHI'06, ACM Press (2006), 407--416.  ",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Gaver, B. Provocative awareness. Computer Supported Cooperative Work 11(3) (2002), 475--493.  ",
      "doi": "10.1023/A%3A1021277326673"
    },
    {
      "text": "Gadamer, H. Truth and Method. The Crossroad Publishing Corporation, New York, 1989.",
      "doi": ""
    },
    {
      "text": "Gibbs, M. R., Vetere, F., Bunyan, M., and Howard, S. Sychromate: A phatic technology for mediating intimacy. Proc. of DUX'05 (2005), 2--6. ",
      "doi": "10.5555/1138235.1138279"
    },
    {
      "text": "Gregory, C. A. Gift and Commodities. London: Academic Press, Inc. (1982).",
      "doi": ""
    },
    {
      "text": "Grinter, R. and Palen, L. Instant messaging in teen life. Proc. of CSCW'02, ACM Press (2002), 21--30.  ",
      "doi": "10.1145/587078.587082"
    },
    {
      "text": "Grivas, K. Digital Selves: Devices for intimate communications between homes. Pers Ubiquit Comput. 10, (2006), 66--76.  ",
      "doi": "10.1007/s00779-005-0003-1"
    },
    {
      "text": "Hu, Y., Wood, J.F., Smith, V., and Westbrook, N. Friendship through IM: Examining the Relationship between Instant Messaging and Intimacy. Journal of Computer-Mediated Communication. 10, 1 (2004).",
      "doi": ""
    },
    {
      "text": "Kaye, J., Goulding, L. Intimate objects. Proc. of DIS'04 (2004), 341--344.  ",
      "doi": "10.1145/1013115.1013175"
    },
    {
      "text": "Kaye, J., Levitt, M., Nevins, J., Golden, J. and Schmidt, V. Communicating Intimacy One Bit at a Time. Proc. of CHI'05, ACM Press (2005), 1529--1532.  ",
      "doi": "10.1145/1056808.1056958"
    },
    {
      "text": "Kim, S., Kientz, J., Patel, S. and Abowd, G. Are you sleeping?: sharing portrayed sleeping status within a social network. Proc. of CSCW'08, ACM Press (2008), 619--628.  ",
      "doi": "10.1145/1460563.1460660"
    },
    {
      "text": "King, S. and Forlizzi, J. Slow Messaging: Intimate communication for couples living at a distance. Proc. of DPPI'07, ACM Press (2007), 451--454.  ",
      "doi": "10.1145/1314161.1314204"
    },
    {
      "text": "Kolo, C., and Baur, T. Living a virtual life: Social dynamics of online gaming. Game Studies 4, 1(2004).",
      "doi": ""
    },
    {
      "text": "Komter, A. Social Solidarity and the Gift. New York: Cambridge UP (2005).",
      "doi": ""
    },
    {
      "text": "Li, N., Jackson, M., and Trees, A. (2008). Relating online: Managing dialectical contradictions in massively multiplayer online role-playing game relationships. Games and Culture, Jan. 2008; vol. 3: pp. 76--97.",
      "doi": ""
    },
    {
      "text": "Liebert, M.A. Does virtual intimacy exist? CyberPsychology and Behavior 9(6), 2006, 759--61.",
      "doi": ""
    },
    {
      "text": "Mahrer, A. Humanistic Approaches to Intimacy. In M. Fisher & G. Stricker (Eds.). Intimacy. New York: Plenum Press (1982), 141--158",
      "doi": ""
    },
    {
      "text": "Malaby, T. (2006). Parlaying value: Capital in and beyond virtual worlds. Games and Culture, Apr 2006; vol. 1: pp. 141 -- 162.",
      "doi": ""
    },
    {
      "text": "Margolin, G. A Social Learning Approach to Intimacy. In M. Fisher & G. Stricker (Eds.). Intimacy. New York: Plenum Press (1982), 175--201.",
      "doi": ""
    },
    {
      "text": "Mauss, M. The Gift: The Form and Reason for Exchange in Archaic Societies. Trans, W.D. Halls. New York: W.W. Norton & Company (1990).",
      "doi": ""
    },
    {
      "text": "McCarthy, J., boyd, d., Churchill, E., Griswold, W., Lawley, E. and Zanger, M. Digital backchannels in shared physical spaces: Attention, intention, and contention. Proc. of CSCW'04 (2004), 550--554.  ",
      "doi": "10.1145/1031607.1031700"
    },
    {
      "text": "McMahon, J. Intimacy among friends and lovers. In M. Fisher & G. Stricker (Eds.). Intimacy. New York: Plenum Press (1982), 293--304.",
      "doi": ""
    },
    {
      "text": "Moss, B. and Schwebel, A. Defining intimacy in romantic relationships. Family Relations 42(1), 1993, 31--37.",
      "doi": ""
    },
    {
      "text": "Motamedi, N. Keep in touch: A tactile-vision intimate interface. Proc. of TEI'07 (2007), 21--22.  ",
      "doi": "10.1145/1226969.1226974"
    },
    {
      "text": "Nardi, B. and Harris, J. Strangers and Friends: Collaborative Play in World of Warcraft. Proc. of CSCW'06, ACM Press (2006), 149--158.  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Ogden, C., Richards, I.A. The Meaning of Meaning. Mariner Books, New York, 1923.",
      "doi": ""
    },
    {
      "text": "Pace, T. Can an orc catch a cab in stormwind?: Cybertype preference in the World of Warcraft character creation interface. Proc. of CHI'08, ACM Press (2008), 2493--2502.  ",
      "doi": "10.1145/1358628.1358706"
    },
    {
      "text": "Pace, T., Houssian, A., and McArthur, V. Are Socially Exclusive Values Embedded in the Avatar Creation Interfaces of MMORPGs? Journal of Information, Communication and Ethics in Society. 7, 2/3 (2009), 192--210.",
      "doi": ""
    },
    {
      "text": "Ploderer, B., Howard, S. and Thomas, P. Being online, living offline, The influence of social ties over the appropriation of social network sites. Proc. of CSCW'08 (2008), 333--342.  ",
      "doi": "10.1145/1460563.1460618"
    },
    {
      "text": "Reddy, M., Dourish, P. and Pratt, W. Temporality in medical work: Time also matters. Computer Supported Cooperative Work 15 (2006), 29--53.  ",
      "doi": "10.1007/s10606-005-9010-z"
    },
    {
      "text": "Register, L. and Henley, T. The Phenomenology of Intimacy. Journal of Social and Personal Relationships. 9, 4 (1992), 467--481.",
      "doi": ""
    },
    {
      "text": "Rubin, Z., and Shenker, S. Friendship, proximity, and self-disclosure. Journal of Personality 46 (1978), 1--22. Salen, K. & Zimmerman, E. Rules of Play: Game Design Fundamentals. Boston: MIT Press (2004).",
      "doi": ""
    },
    {
      "text": "Saslis-Lagoudakis, G., Cheverst, K., Dix, A., Fitton, D., and Rouncefield, M. Hermes@Home: Supporting awareness and intimacy between distant family members. Proc. of OZCHI'06 (2006), 23--30.  ",
      "doi": "10.1145/1228175.1228183"
    },
    {
      "text": "Schiphorst, T., Nack, F., Kauwatjoe, M., de Bakker, Stock, Aroyo, L., Rosillio, A., Schut, H., Jaffe, N. Pillowtalk: Can we afford intimacy? Proc. of TEI'07 (2007), 23--30.  ",
      "doi": "10.1145/1226969.1226975"
    },
    {
      "text": "Szostek, A., Karapanos, E., Eggen, B. and Holenderski, M. Understanding the implications of social translucence for systems supporting communication at work. Proc. of CSCW'08 (2008), 649--658.  ",
      "doi": "10.1145/1460563.1460664"
    },
    {
      "text": "Taylor, A. and Harper, R. The gift of the gab? A design oriented sociology of young people's use of mobiles. Computer Supported Cooperative Work 12 (2003), 267--296.  ",
      "doi": "10.1023/A%3A1025091532662"
    },
    {
      "text": "Taylor, T. L. Play Between Worlds: Exploring Online Game Culture. Boston: MIT Press (2004). ",
      "doi": "10.5555/1137764"
    },
    {
      "text": "The Daedalus Project. http://www.nickyee.com/daedalus/",
      "doi": ""
    },
    {
      "text": "Valle, R. and King, M. Existential-Phenomenological Alternatives for Psychology. Oxford UP, New York, 1978.",
      "doi": ""
    },
    {
      "text": "Vetere, F., Gibbs, M., Kjeldskov, J., Howard, S., Mueller, F., Pedell, S., Mecoles, K., and Bunyan, M. (2005) Mediating intimacy: designing technologies to support strong-tie relationships. Proc. of CHI2005. Portland, OR, USA.  ",
      "doi": "10.1145/1054972.1055038"
    }
  ]
}