{
  "doi": "10.1145/1753326.1753458",
  "title": "Usable gestures for mobile interfaces: evaluating social acceptability",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "887-896",
  "year": 2010,
  "badges": [],
  "abstract": "Gesture-based mobile interfaces require users to change the way they use technology in public settings. Since mobile phones are part of our public appearance, designers must integrate gestures that users perceive as acceptable for pub-lic use. This topic has received little attention in the litera-ture so far. The studies described in this paper begin to look at the social acceptability of a set of gestures with re-spect to location and audience in order to investigate possi-ble ways of measuring social acceptability. The results of the initial survey showed that location and audience had a significant impact on a user's willingness to perform ges-tures. These results were further examined through a user study where participants were asked to perform gestures in different settings (including a busy street) over repeated trials. The results of this work provide gesture design rec-ommendations as well as social acceptability evaluation guidelines.",
  "authors": [
    {
      "name": "Julie Rico",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81442606751/rel-imgonly/julie_pic.jpg",
      "acmid": "81442606751",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "Bolt, R. A. 1980. \"Put-that-there\": Voice and gesture at the graphics interface. In Proc. SIGGRAPH 1980, ACM Press (1980), 262--270.  ",
      "doi": "10.1145/800250.807503"
    },
    {
      "text": "Brown, L. M., Williamson, J. Shake-to-talk: Multi-modal Messaging for Interpersonal Communication. Proceedings of the 2nd International Workshop on Haptic and Audio Interaction Design (Seoul, Korea), 2007. ",
      "doi": "10.5555/1775512.1775521"
    },
    {
      "text": "Campbell, S. Perceptions of Mobile Phone Use in Public Settings: A Cross-Cultural Comparison. International Journal of Communication 1 (2007), 738--757.",
      "doi": ""
    },
    {
      "text": "Cassell, J. (1998). A framework for gesture generation and interpretation. In R. Cipolla & A. Pentland (Eds.), Computer vision in human-machine interaction (pp. 191--215). Cambridge, UK: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Conover, W. J. Practical Non-parametric Statistics. John Wiley & Sons, Inc., New York pp 199--208 (1980)",
      "doi": ""
    },
    {
      "text": "Crossan, A., Williamson, J., Brewster, S., and Murray-Smith, R. Wrist rotation for interaction in mobile contexts. In Proc. MobileHCI 2008, ACM Press (2008), 435--438.  ",
      "doi": "10.1145/1409240.1409307"
    },
    {
      "text": "Davis, F. D. A Technology Acceptance Model for Empirically Testing New End-User Information Systems: Theory and Results. In MIT Sloan School of Management. Cambridge, MA (1986)",
      "doi": ""
    },
    {
      "text": "Fishbein, M., and Ajzen, I. Belief, Attitude, Intention, and Behavior: An Introduction to Theory and Research. Reading, MA. Addison-Wesley (1975)",
      "doi": ""
    },
    {
      "text": "Fiske, S., Taylor, S. Social Cognition: from brains to culture. McGraw-Hill, New York (2008)",
      "doi": ""
    },
    {
      "text": "Goffman, Erving. The Presentation of Self in Everyday Life. Penguin Books, London (1990)",
      "doi": ""
    },
    {
      "text": "Howitt, D., Cramer, D. An Introduction to Statistics in Psychology: A Complete Guide for Students. Pearson Education Limited, Essex (2000)",
      "doi": ""
    },
    {
      "text": "Kendon, A. GESTURE. Annual Review of Anthropology (1997)",
      "doi": ""
    },
    {
      "text": "Malhotra, Y. and Galletta, D. F. Extending the Technology Acceptance Model to Account for Social Influence: Theoretical Bases and Empirical Validation. In Proc. of HICSS 1999, IEEE Computer Society (1999). ",
      "doi": "10.5555/874068.875913"
    },
    {
      "text": "Reeves, S., Benford, S., O'Malley, C., and Fraser, M. Designing the spectator experience. In Proc. CHI 2005, ACM Press (2005), 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Ronkainen, S., Häkkilä, J., Kaleva, S., Colley, A., and Linjama, J. Tap input as an embedded interaction method for mobile devices. In Proc. TEI 2007, ACM Press (2007), 263--270.  ",
      "doi": "10.1145/1226969.1227023"
    },
    {
      "text": "Strachan, S., Murray-Smith, R., and O'Modhrain, S. BodySpace: inferring body pose for natural control of a music player. Ext. Abstracts CHI 2007, ACM Press (2007), 2001--2006.  ",
      "doi": "10.1145/1240866.1240939"
    },
    {
      "text": "Väänänen, K., and Böhm, K. Gesture Driven Interaction as a Human Factor in Virtual Environments --- An Approach to Neural Networks. Virtual Reality Systems. R.A. Earnshaw, M.A. Gigante, and H. Jones. London, Academic Press Limited (1993).",
      "doi": ""
    },
    {
      "text": "Wexelblat, A. Research Challenges in Gesture: Open Issues and Unsolved Problems. In Proc. of the International Gesture Workshop (September 17-19, 1997). I. Wachsmuth and M. Fröhlich, Eds. Lecture Notes In Computer Science, vol. 1371. Springer, London, 1--11. ",
      "doi": "10.5555/647590.728557"
    },
    {
      "text": "Williamson, J., Murray-Smith, R., and Hughes, S. Shoogle: excitatory multimodal interaction on mobile devices. In Proc. CHI '07, ACM Press (2007), 121--124.  ",
      "doi": "10.1145/1240624.1240642"
    },
    {
      "text": "Mo, Z. and Neumann, U. Lexical Gesture Interface. In Proc. ICVS 2006. IEEE Computer Society, Washington, DC, 7.  ",
      "doi": "10.1109/ICVS.2006.39"
    }
  ]
}