{
  "doi": "10.1145/1753326.1753386",
  "title": "Exploiting knowledge-in-the-head and knowledge-in-the-social-web: effects of domain expertise on exploratory search in individual and social search environments",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "393-402",
  "year": 2010,
  "badges": [],
  "abstract": "Our study compared how experts and novices performed exploratory search using a traditional search engine and a social tagging system. As expected, results showed that social tagging systems could facilitate exploratory search for both experts and novices. We, however, also found that experts were better at interpreting the social tags and generating search keywords, which made them better at finding information in both interfaces. Specifically, experts found more general information than novices by better interpretation of social tags in the tagging system; and experts also found more domain-specific information by generating more of their own keywords. We found a dynamic interaction between knowledge-in-the-head and knowledge-in-the-social-web that although information seekers are more and more reliant on information from the social Web, domain expertise is still important in guiding them to find and evaluate the information. Implications on the design of social search systems that facilitate exploratory search are also discussed.",
  "tags": [
    "exploratory search",
    "search behavior",
    "domain expertise"
  ],
  "authors": [
    {
      "name": "Ruogu Kang",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660488221",
      "orcid": "missing"
    },
    {
      "name": "Wai-Tat Fu",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244379",
      "orcid": "missing"
    },
    {
      "name": "Thomas George Kannampallil",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100137586",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, B. Topic Knowledge and Online Catalog Search Formulation. The Library Quarterly 61, 2 (1991), 188--213.",
      "doi": ""
    },
    {
      "text": "Ames, M., Naaman, M. Why we tag: motivations for annotation in mobile and online media. In Proc. CHI 2007, ACM Press (2007), 971--980.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Cattuto, C., Loreto, V., Pietronero, L. Semiotic dynamics and collaborative tagging. In Proc. National Academy of Sciences (2007), 1461--1464.",
      "doi": ""
    },
    {
      "text": "Duggan, G. B., Payne, S. J. Knowledge in the head and on the web: using topic expertise to aid search. In Proc. CHI2008, ACM Press (2008), 39--48.  ",
      "doi": "10.1145/1357054.1357062"
    },
    {
      "text": "Fu, W.-T. The microstructures of social tagging: a rational model. In Proc. CSCW' 08, ACM Press (2008), 229--238.  ",
      "doi": "10.1145/1460563.1460600"
    },
    {
      "text": "Fu, W.-T., Kannampallil, T. G., Kang, R. Semantic Imitation in Social Tagging. ACM Transactions on Computer-Human Interaction, accepted pending minor revisions.  ",
      "doi": "10.1145/1806923.1806926"
    },
    {
      "text": "Griffiths, L. T., Steyvers, M., Firl, A. Google and the Mind: Predicting Fluency with PageRank. Psychological Science 18, 12 (2007), 1069--76.",
      "doi": ""
    },
    {
      "text": "Golder, S.A., Huberman, B.A. Usage patterns of collaborative tagging systems. Journal of Information Scence 32, 2 (2006), 198--208.  ",
      "doi": "10.1177/0165551506062337"
    },
    {
      "text": "Heymann, P., Koutrika, G., Garcia-Molina, H. Can social bookmarking improve web search? In Proc. WSDM 2008, ACM Press (2008), 195--206.  ",
      "doi": "10.1145/1341531.1341558"
    },
    {
      "text": "Hsieh--Yee, I. Effects of Search Experience and Subject Knowledge on the Search Tactics of Novice and Experienced Searchers. Journal of the American Society for Information Science 44, 3 (1993), 161--174.",
      "doi": ""
    },
    {
      "text": "Kammerer, Y., Nairn, R., Pirolli, P. L., Chi, E. H. Signpost from the masses: learning effects in an exploratory social tag search browser. In Proc. CHI 2009, ACM (2009), 625--634.  ",
      "doi": "10.1145/1518701.1518797"
    },
    {
      "text": "Krause, B., Hotho, A., Stumme, G. A Comparison of Social Bookmarking with Traditional Search. Advances in Information Retrieval (2008), 101--113. ",
      "doi": "10.5555/1793274.1793290"
    },
    {
      "text": "Marchionini, G. Exploratory search: from finding to understanding. Communications of the ACM 49, 4 (2006), 41--46.  ",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Millen, D. R., Yang, M., Whittaker, S., Feinberg, J. Social bookmarking and exploratory search. In Proc. ECSCW 2007, ACM Press (2007), 21--40.",
      "doi": ""
    },
    {
      "text": "Morrison, P. J. Tagging and searching: Search retrieval effectiveness folksonomies on the World Wide Web. Information Processing & Management 44, 4 (2008), 1562--1579.  ",
      "doi": "10.1016/j.ipm.2007.12.010"
    },
    {
      "text": "Sen, S., Lam, S. K., Rashid, A. M., Cosley, D., Frankowski, D., Osterhouse, J., Harper, F. M., Riedl, J. Tagging, communities, vocabulary, evolution, In Proc. CSCW 2006, ACM Press(2006), 181--190.  ",
      "doi": "10.1145/1180875.1180904"
    },
    {
      "text": "White, R.W., Drucker, S. M., Marchionini, G., Hearst, M., Schraefel, M. C. Exploratory search and HCI: designing and evaluating interfaces to support exploratory search interaction. Ext. Abstracts CHI 2007, ACM Press (2007), 2877--2880.  ",
      "doi": "10.1145/1240866.1241100"
    },
    {
      "text": "White, R.W., Dumais, S. T., Teevan, J. Characterizing the influence of domain expertise on web search behavior. In Proc. WSDM 2009, ACM Press (2009), 132--141.  ",
      "doi": "10.1145/1498759.1498819"
    },
    {
      "text": "Zhang, X. M., Anghelescu, H. G. B., Yuan, X.J. Domain knowledge, search behaviour, and search effectiveness of engineering and science students: an exploratory study. Information Research 10, 2 (2005).",
      "doi": ""
    }
  ]
}