{
  "doi": "10.1145/1753326.1753518",
  "title": "Cars, calls, and cognition: investigating driving and divided attention",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1281-1290",
  "year": 2010,
  "badges": [],
  "abstract": "Conversing on cell phones while driving an automobile is a common practice. We examine the interference of the cognitive load of conversational dialog with driving tasks, with the goal of identifying better and worse times for conversations during driving. We present results from a controlled study involving 18 users using a driving simulator. The driving complexity and conversation type were manipulated in the study, and performance was measured for factors related to both the primary driving task and secondary conversation task. Results showed significant interactions between the primary and secondary tasks, where certain combinations of complexity and conversations were found especially detrimental to driving. We present the studies and analyses and relate the findings to prior work on multiple resource models of cognition. We discuss how the results can frame thinking about policies and technologies aimed at enhancing driving safety.",
  "tags": [
    "cell phones",
    "dual task performance",
    "attention",
    "driving"
  ],
  "authors": [
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Yun-Cheng Ju",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100098724",
      "orcid": "missing"
    },
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alm, H. and L. Nilsson. The effects of a mobile telephone task on driver behavior in a car following situation. Accident Analysis and Prevention, 27 (5). 707--715.",
      "doi": ""
    },
    {
      "text": "Bailey, B.P. and S.T. Iqbal. Understanding Changes in Mental Workload During Execution of Goal-directed Tasks and Its Application for Interruption Management. ACM Transactions on Computer Human Interaction (TOCHI), 14 (4). 1--28.  ",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Beilock, S.L. and T.H. Carr. On the fragility of skilled performance: What governs choking under pressure? Journal of Experimental Psychology: General, 130. 701--725.",
      "doi": ""
    },
    {
      "text": "Beilock, S.L., T.H. Carr, C. MacMahon. and J.L. Starkes. When Attention becomes counterproductive: Divided versus skill-focused attention in performance of sensorimotor skills by novices and experts. Journal of Experimental Psychology: Applied, 8. 6--16.",
      "doi": ""
    },
    {
      "text": "Berthold, A. and A. Jameson. Interpreting Symptoms of Cognitive Load in Speech Input. in User Modeling, (Vienna, 1999), New York: Springer Wien New York. ",
      "doi": "10.5555/317328.317360"
    },
    {
      "text": "Bock, K., G.S. Dell, S.M. Garnsey, A.F. Kramer, and T.T. Kubose. Car talk, car listen. in Antje Meyer, L.W., Andrea Krott ed. Automaticityand Control in Language Processing, Psychology Press, 2006, 21--42.",
      "doi": ""
    },
    {
      "text": "Briem, V. and L.R. Hedman. Behavioral effects of mobile telephone use during simulated driving. Ergonomics, 38. 2536--2562.",
      "doi": ""
    },
    {
      "text": "Brookhuis, K.A., G. De Vries, and D. De Waard. The effects of mobile telephoning on driving performance. Accident Analysis and Prevention, 23 (309--316).",
      "doi": ""
    },
    {
      "text": "Brown, I.D., A.H. Tickner, and D.C.V. Simmonds. Interference between concurrent tasks of driving and telephoning. Journal of Applied Psychology, 53 (5). 419--424.",
      "doi": ""
    },
    {
      "text": "Brumby, D.P., D.D. Salvucci, and A. Howes. Focus on driving: How cognitive constraints shape the adaptation of strategy while dialing while driving Proceedings of the SIGCHI confrence on Human Factors in Computing Systems, ACM Press, Boston, MA, 2009, 1629--1638.  ",
      "doi": "10.1145/1518701.1518950"
    },
    {
      "text": "Brumby, D.P., D.D. Salvucci, W. Mankowski, and A. Howes. A cognitive constraint model of the effects of portable music-player use on driver performance Proceedings of the Human Factors and Ergonomics Society 51st Annual Meeting, HFES, Baltimore, MD, 2007, 1531--1535.",
      "doi": ""
    },
    {
      "text": "Fisk, A.D., P.L. Ackerman, and W. Schneider. Automatic and controlled processing theory and its applications to human factors problems. in Human Factors Psychology, North-Holland Publishing Co., 1987, 159--197. ",
      "doi": "10.5555/57295.57300"
    },
    {
      "text": "Green, P.A. Driver Distraction, Telematics Design, and Workload Managers: Safety Issues and Solutions, University of Michigan Transportation Institute, 2004.",
      "doi": ""
    },
    {
      "text": "Hoedemaeker, M. and M. Neerincx (eds.). Attuning In-car User Interfaces to the Momentary Cognitive Load. Springer-Verlag, Berlin, 2007.",
      "doi": ""
    },
    {
      "text": "Hoffman, J.D. A Dynamic Field Theory Model of Shared Visual Attention While Driving University of Iowa, Iowa City, 2008.",
      "doi": ""
    },
    {
      "text": "Horrey, W.J. and C.D. Wickens. Examining the Impact of Cell Phone Conversations on Driving Using Meta-Analytic Techniques. Human Factors, 48 (1). 196--205.",
      "doi": ""
    },
    {
      "text": "James, W. Principles of Psychology, New York, 1890.",
      "doi": ""
    },
    {
      "text": "Klauer, S.G., T.A. Dingus, V.L. Neale, J.D. Sudweeks, and D.J. Ramsey. The Impact of Driver Inattention on Near-Crash/Crash Risk: An Analysis Using the 100-Car Naturalistic Driving Study Data, National Highway Traffic Safety Administration, Washington DC, 2006.",
      "doi": ""
    },
    {
      "text": "Lee, J.D., B. Caven, S. Haake, and T. Brown. Speech-based Interaction with In-vehicle Computers: The Effect of Speech-based E-mail on Driver's attention to the Roadway. Human Factors, 43. 631--640.",
      "doi": ""
    },
    {
      "text": "Lee, J.D., D.V. McGehee, T.L. Brown, and N.L. Ryes. Collision warning timin, driver distraction, and driver response to imminent rear--end collisions in a high-fidelity driving simulator. Human Factors, 44. 314--334.",
      "doi": ""
    },
    {
      "text": "Levy, J. and H. Pashler. Task Prioritisation in Multitasking during Driving: Opportunity to Abort a Concurrent Task Does not Insulate Braking Responses from Dual Task Slowing. Applied Cognitive Psychology, 22. 507--525.",
      "doi": ""
    },
    {
      "text": "Logan, G.D. Repetition priming and automaticity: Common underlying mechanisms? Cognitive Psychology, 22 (1). 1--35.",
      "doi": ""
    },
    {
      "text": "McKnight, A.J. and A.S. McKnight. The effect of cellular phone use upon driver attention. Accident Analysis and Prevention, 25. 259--265.",
      "doi": ""
    },
    {
      "text": "Navon, D. Attention Division or Attention Sharing? Attention and Performance, 9.",
      "doi": ""
    },
    {
      "text": "Navon, D. and D. Gopher. On the Economy of the Human Processing System: A Model of Multiple Capacity. Psychological Review, 86. 254--255.",
      "doi": ""
    },
    {
      "text": "Newtson, D. and G. Engquist. The Perceptual Organization of Ongoing Behavior. Journal of Experimental Social Psychology, 12. 436--450.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. and D.G. Bobrow. On data-limited and resource-limited processes. Cognitive Psychology, 7 (44--64).",
      "doi": ""
    },
    {
      "text": "Nunes, L.M. and Recarte, M.A. Cognitive Demands of hands-free-phone conversation while driving. Transportation research Part F, 5. 133--144.",
      "doi": ""
    },
    {
      "text": "Redelmeier, D.A. and R.J. Tibshirani. Association between cellular-telephone calls and motor vehicle collisions. New England Journal of Medicine, 336 (7). 453--458.",
      "doi": ""
    },
    {
      "text": "Ruppin, E. and Y. Yeshurun. Recall and Recognition in an Attractor Neural Network Model of Memory Retrieval. Connection Science, 3. 381--399.",
      "doi": ""
    },
    {
      "text": "Salvucci, D.D. Predicting the effects of in-car interface use on driver performance: An integrated model approach. International Journal of Human-Computer Studies, 55. 85--107.",
      "doi": ""
    },
    {
      "text": "Salvucci, D.D., D. Markley, M. Zuber, and D.P. Brumby. iPod distraction: effects of portable music-player use on driver performance Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, San Jose, California, USA, 2007.  ",
      "doi": "10.1145/1240624.1240665"
    },
    {
      "text": "Schneider, W. and R.M. Shiffrin. Controlled and automatic human information processing ii: Perceptual learning, automatic attending and a general theory. Psychological Review, 84. 127--190.",
      "doi": ""
    },
    {
      "text": "Strayer, D.L. and W.A. Johnston. Driven to distraction: Dual-task studies of simulated driving and conversing on a cellular phone. Psychological Science, 12. 462--466.",
      "doi": ""
    },
    {
      "text": "Violanti, J.M. Cellular phones and traffic accidents. Public Health, 111 (6). 423--428.",
      "doi": ""
    },
    {
      "text": "Wickens, C.D. Multiple Resources and Performance Prediction. Theoretical Issues in Ergonomic Science, 3 (2). 159--177.",
      "doi": ""
    },
    {
      "text": "Wickens, C.D. and J.G. Hollands. Engineering Psychology and Human Performance. Prentice Hall, Upper Saddle River, NJ, 1999.",
      "doi": ""
    },
    {
      "text": "Wickens, C.D., D. Sandry, and M. Vidulich. Compatibility and resource competition between modalities of input, output and central processing. Human Factors, 25. 227--248.",
      "doi": ""
    }
  ]
}