{
  "doi": "10.1145/1753326.1753632",
  "title": "An adaptive speed-call list algorithm and its evaluation with ESM",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2019-2022",
  "year": 2010,
  "badges": [],
  "abstract": "We designed an algorithm to build a speed-call list adaptively based on mobile phone call logs. Call logs provide the time-dependent calling patterns of mobile phone users, and therefore a speed-call list based on them will be more successful in recommending a desired number than a speed-call list based on recent calls only. This paper presents the design process of our algorithm for an adaptive speed-call list, its verification result with recorded call logs, and in-situ evaluation results of the algorithm using an Experience Sampling Method (ESM) system.",
  "tags": [
    "call recommendation",
    "adaptive speed-call list",
    "experience sampling method",
    "calling pattern"
  ],
  "authors": [
    {
      "name": "Seunghwan Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-81350581745/rel-imgonly/sg1s41882.jpg",
      "acmid": "81350581745",
      "orcid": "missing"
    },
    {
      "name": "Jungsuk Seo",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81537788956",
      "orcid": "missing"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bridle, R., and McCreath, E. Inducing shortcuts on a mobile phone interface. In Proc. IUI 2006, ACM Press (2006), 327--329.  ",
      "doi": "10.1145/1111449.1111526"
    },
    {
      "text": "Cannon, J.M, Fadavi-Ardekani, J., and Johanson, J.A., US Pat. 6243459, Telephone with adaptive speed dial mechanism",
      "doi": ""
    },
    {
      "text": "Carter, S., Mankoff, J. and Heer, J. Momento: Support for situated ubicomp evaluation. In Proc. CHI 2007, ACM Press (2007),125--134.  ",
      "doi": "10.1145/1240624.1240644"
    },
    {
      "text": "Phithakkitnukoon, S., and Dantu, R, CPL: Enhancing Mobile Phone Functionality by Call Predicted List, OTM 2008 Workshops, LNCS 5333, 571--581.  ",
      "doi": "10.1007/978-3-540-88875-8_80"
    },
    {
      "text": "Vetek, A., Flanagan, J.A., Colley, A., and Keränen, T. SmartActions: Context-Aware Mobile Phone Shortcuts. In Proc. INTERACT 2009, LNCS 5726, 796--799.  ",
      "doi": "10.1007/978-3-642-03655-2_86"
    },
    {
      "text": "Wunsch, C., US Pat. 6606381, Dynamic ordering of an electronic phonebook",
      "doi": ""
    }
  ]
}