{
  "doi": "10.1145/1753326.1753685",
  "title": "Think-aloud protocols: a comparison of three think-aloud protocols for use in testing data-dissemination web sites for usability",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2381-2390",
  "year": 2010,
  "badges": [],
  "abstract": "We describe an empirical, between-subjects study on the use of think-aloud protocols in usability testing of a federal data-dissemination Web site. This double-blind study used three different types of think-aloud protocols: a traditional protocol, a speech-communication protocol, and a coaching protocol. A silent condition served as the control. Eighty participants were recruited and randomly pre-assigned to one of four conditions. Accuracy and efficiency measures were collected, and participants rated their subjective satisfaction with the site. Results show that accuracy is significantly higher in the coaching condition than in the other conditions. The traditional protocol and the speech-communication protocol are not statistically different from each other with regard to accuracy. Participants in the coaching condition are more satisfied with the Web site than participants in the traditional or speech-communication condition. In addition, there are no significant differences with respect to efficiency (time-on-task). This paper concludes with recommendations for usability practitioners.",
  "tags": [
    "user testing",
    "usability testing",
    "verbalization",
    "user-centered design",
    "think aloud",
    "experimental design"
  ],
  "authors": [
    {
      "name": "Erica L. Olmsted-Hawala",
      "institution": "U.S. Census Bureau, Wasthington DC, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460658339",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D. Murphy",
      "institution": "U.S. Census Bureau, Washington DC, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547838756",
      "orcid": "missing"
    },
    {
      "name": "Sam Hawala",
      "institution": "U.S. Census Bureau, Washington DC, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655854",
      "orcid": "missing"
    },
    {
      "name": "Kathleen T. Ashenfelter",
      "institution": "U.S. Census Bureau, Washington DC, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460656607",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boren, T., and Ramey, J. Thinking aloud: Reconciling theory and practice. IEEE Transactions on Professional Communication 43, 3 (2000), 261--278.",
      "doi": ""
    },
    {
      "text": "Bowers, V., and Snyder, H. Concurrent versus retrospective verbal protocol for comparing window usability. In Proc Human Factors Society 34th Annual Meeting, (1990), 1270--1274.",
      "doi": ""
    },
    {
      "text": "Chin, J.P., Diehl, V., and Norman, K.L. (1988). Development of an instrument measuring user satisfaction of the human-computer interface. In Proc CHI 88, ACM Press (1988), 213--218.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Deffner, G. Verbal protocols as a research tool in human factors. In Proc Human Factors Society 34th Annual Meeting, (1990), 1263--1264.",
      "doi": ""
    },
    {
      "text": "Dumas, J and Redish, J. A Practical Guide to Usability Testing. Intellect Press, Portland, OR, USA, 1999. ",
      "doi": "10.5555/600280"
    },
    {
      "text": "Ericsson, K.A. and Simon, H.A. Protocol Analysis: Verbal Reports As Data. (Revised ed.) MIT Press, Cambridge, MA, USA, 1996.",
      "doi": ""
    },
    {
      "text": "Hair, J.F., Anderson, R.E., Tatham, R.L., and Black, W.C. Multivariate data analysis. (5th ed.). Prentice Hall, Englewood Cliffs, NJ, USA, 1998.",
      "doi": ""
    },
    {
      "text": "Hertzum, M, Hansen, K., and Anderson, H. Scrutinising usability evaluation: does thinking aloud affect behaviour and mental workload? Behaviour & Information Technology 28, 2 (2009), 165--181.  ",
      "doi": "10.1080/01449290701773842"
    },
    {
      "text": "Hughes, J., and Parkes, S. Trends in the use of verbal protocol analysis in software engineering research. Behaviour & Information Technology 22, 2 (2003), 127--140.",
      "doi": ""
    },
    {
      "text": "Krahmer, E., and Ummelen, N. Thinking about thinking aloud: A comparison of two verbal protocols for usability testing. IEEE Transactions on Professional Communication 47, 2 (2004), 105--117.",
      "doi": ""
    },
    {
      "text": "Khasawneh, S. A. Construct validation of an Arabic version of the learning transfer system of the learning transfer system for use in Jordan. (2004), Dissertation: Louisiana State University.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Usability Engineering. Morgan Kaufmann, New York, NY, USA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Norgaard, M., and Hornbaek, K., What do usability evaluators do in Practice? An explorative study of think-aloud testing. In DIS 2006, ACM Press (2006), 209--219.  ",
      "doi": "10.1145/1142405.1142439"
    },
    {
      "text": "Novotny, E., and Cahoy, E. If we teach, do they learn?: The impact of instruction on online catalog search strategies. Portal: Libraries and the Academy, 6, 2 (2006), 155--167.",
      "doi": ""
    },
    {
      "text": "Rhenius, D., and Deffner, G. Evaluation of concurrent thinking aloud using eye-tracking data. In Proc Human Factors Society 34th Annual Meeting, (1990), 1265--1269.",
      "doi": ""
    },
    {
      "text": "Romaine, S. Communicating Gender. Erlbaum, Mahwah, NJ, USA, 1999.",
      "doi": ""
    },
    {
      "text": "Rubin, J. Handbook of usability testing: How to plan, design, and conduct effective tests. Wiley, New York: NY, USA, 1994. ",
      "doi": "10.5555/561768"
    },
    {
      "text": "SAS Institute, Inc. Statistical Analysis Software (SAS 8.02), 2001, Software package.",
      "doi": ""
    },
    {
      "text": "Tabachnick, B.G and Fidell, L.S. Using Multivariate Statistics (3rd Ed.). HarperCollins, New York, NY, USA, 1996.",
      "doi": ""
    },
    {
      "text": "Van Den Haak, M., De Jong, M., and Schellens, P. Retrospective vs. concurrent think-aloud protocols: Testing the usability of an online library catalogue. Behaviour & Information Technology 22, 5 (2003), 339--351.",
      "doi": ""
    },
    {
      "text": "Van Den Haak, M., De Jong, M., and Schellens, P. Employing think--aloud protocols and constructive interaction to test the usability of online library catalogues: A methodological comparison. Interacting with Computers 16, 6 (2004), 1153--1170.",
      "doi": ""
    },
    {
      "text": "Van Den Haak, M., De Jong, M., and Schellens, P. Evaluation of an informational Web site: Three variants of the think-aloud method compared. Technical Communication 54, 1 (2007), 58--71.",
      "doi": ""
    },
    {
      "text": "Ward, N and Tsukahara, W. Prosodic features which cue back-channel feedback in English and Japanese. Journal of Pragmatics 32, (2000), 1177--1207.",
      "doi": ""
    },
    {
      "text": "Wright, R., and Converse, S. Method bias and concurrent verbal protocol in software usability testing. Proc Human Factors Society 36th Annual Meeting, (1992), 1220--1224.",
      "doi": ""
    },
    {
      "text": "Yngve, V. On getting a word in edgewise. Papers from the sixth regional meeting {of the} Chicago Linguistic Society, (1970), 567--577.",
      "doi": ""
    }
  ]
}