{
  "doi": "10.1145/1753326.1753409",
  "title": "A stage-based model of personal informatics systems",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "557-566",
  "year": 2010,
  "badges": [],
  "abstract": "People strive to obtain self-knowledge. A class of systems called personal informatics is appearing that help people collect and reflect on personal information. However, there is no comprehensive list of problems that users experience using these systems, and no guidance for making these systems more effective. To address this, we conducted surveys and interviews with people who collect and reflect on personal information. We derived a stage-based model of personal informatics systems composed of five stages (preparation, collection, integration, reflection, and action) and identified barriers in each of the stages. These stages have four essential properties: barriers cascade to later stages; they are iterative; they are user-driven and/or system-driven; and they are uni-faceted or multi-faceted. From these properties, we recommend that personal informatics systems should 1) be designed in a holistic manner across the stages; 2) allow iteration between stages; 3) apply an appropriate balance of automated technology and user control within each stage to facilitate the user experience; and 4) explore support for associating multiple facets of people's lives to enrich the value of systems.",
  "authors": [
    {
      "name": "Ian Li",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100475536/rel-imgonly/ianli_640.png",
      "acmid": "81100475536",
      "orcid": "missing"
    },
    {
      "name": "Anind Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Jodi Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alleyne, R. \"The house that Twitters.\" Telegraph.co.uk, September 8, 2009. Accessed on September 16, 2009 at http://www.telegraph.co.uk/science/science-news/6156291/The-house-that-Twitters.html",
      "doi": ""
    },
    {
      "text": "Assogba, Y., and Donath, J. Mycrocosm: Visual Microblogging. HICSS'09, 2009, pp. 1--10.  ",
      "doi": "10.1109/HICSS.2009.321"
    },
    {
      "text": "Consolvo, S., McDonald, D.W., Toscos, T., et al. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. CHI'08, 2008, pp. 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Froehlich, J., Dillahunt, T., Klasnja, P., et al. Ubigreen: Investigating a Mobile Tool for Tracking and Supporting Green Transportation Habits. CHI'09, 2009, pp. 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Franklin, B. Autobiography of Benjamin Franklin. New York, 1916, pp. 146--155.",
      "doi": ""
    },
    {
      "text": "Frost, J. and Smith, B.K. Visualizing Health: imagery in diabetes education. DUX '03, 2003, pp. 1--14.  ",
      "doi": "10.1145/997078.997094"
    },
    {
      "text": "Gemmell, J., Bell, G., and Lueder, R. MyLifeBits: a personal database for everything. Communications of the ACM, 2006, pp. 88--95.  ",
      "doi": "10.1145/1107458.1107460"
    },
    {
      "text": "Gemmell, J. & Vemuri, S. \"CARPE Research Area.\" SIGMM. Accessed on January 6, 2010 at http://www.sigmm.org/Members/jgemmell/CARPE",
      "doi": ""
    },
    {
      "text": "Hallnäs, L. and Redström, J. Slow Technology: Designing for Reflection. Personal and Ubiquitous Computing, 5(3), 2001.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Hodges, S., Williams, L., Berry, E., et al., K. SenseCam: a Retrospective Memory Aid. Ubicomp'06, 2006, pp. 177--193.  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "Hsieh, G., Li, I., Dey, A., Forlizzi, J., and Hudson, S.E. Using Visualizations to Increase Compliance in Experience Sampling. Ubicomp'08, 2008, pp. 164--167.  ",
      "doi": "10.1145/1409635.1409657"
    },
    {
      "text": "Intille, S.S., Tapia, E.M., Rondoni, J., et al. Tools for Studying Behavior and Technology in Natural Settings. Ubicomp'03, 2003, pp. 157--174.",
      "doi": ""
    },
    {
      "text": "Jones, W., and Teevan, J. Personal Information Management. UW Press, 2007.",
      "doi": ""
    },
    {
      "text": "Li, I., Dey, A., and Forlizzi, J. Using Contextual Information to Improve Awareness of Physical Activity. Engaging Data Forum 2009, Boston, MA, 2009.",
      "doi": ""
    },
    {
      "text": "Lin, J.J., Mamykina, L., Lindtner, S., et al. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. Ubicomp'06, 2006, pp. 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Maitland, J., Sherwood, S., Barkhuus, L., et al. Increasing the Awareness of Moderate Exercise with Pervasive Computing. IEEE Pervasive Health Conference, 2006, pp. 1--9.",
      "doi": ""
    },
    {
      "text": "Mamykina, L., Mynatt, E.D., and Kaufman, D.R. Investigating health management practices of individuals with diabetes. CHI'06, 2006, pp. 927--936.  ",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Mankoff, J., Kravets, R., and Blevis, E. Some Computer Science Issues in Creating a Sustainable World. Computer, 41(8), 2008, pp. 102--105.  ",
      "doi": "10.1109/MC.2008.307"
    },
    {
      "text": "Pousman, Z., Stasko, J.T., and Mateas, M. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics, 2002, pp. 1145--1152.  ",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Scollon, C., Kim-Prieto, C., and Diener, E. Experience Sampling: Promises and Pitfalls, Strengths and Weaknesses. Journal of Happiness Studies, 4, 2003, pp. 5--34.",
      "doi": ""
    },
    {
      "text": "Wolf, G. Know Thyself: Tracking Every Facet of Life, from Sleep to Mood to Pain, 24/7/365. Wired, 17.07, 2009, pp. 92--95.",
      "doi": ""
    },
    {
      "text": "Yau, N. and Schneider, J. Self-Surveillance. Bulletin of ASIS&T, June/July 2009, pp. 24--30.",
      "doi": ""
    }
  ]
}