{
  "doi": "10.1145/1753326.1753343",
  "title": "Multitasking bar: prototype and evaluation of introducing the task concept into a browser",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "103-112",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper clarifies two common patterns of multitasking on the Web, namely Multiple Tasks (MT) and Multiple Session Task (MST). To support both of these, the task concept needs to be introduced into a browser. An online pilot survey has revealed which attributes of the task concept are most significant to Web users and as a result a simple prototype, the Multitasking Bar (MB), is proposed based on these findings. The MB copes with the multitasking needs of both MT and MST in the browser by providing functions for task related Web page management and task schedule management. A two-session controlled experiment has been conducted to evaluate the MB and to compare user performance and experience when multitasking on the Web with and without support for MT and MST. Results show that support for both MST and MT significantly improves user task performance efficiency and greatly enhances the user experience when multitasking on the Web.",
  "authors": [
    {
      "name": "Qing Wang",
      "institution": "Sun Yat-Sen University, Guangzhou, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651004",
      "orcid": "missing"
    },
    {
      "name": "Huiyou Chang",
      "institution": "Sun Yat-Sen University, Guangzhou, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660051805",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Save Session : Add-ons for Firefox. https://addons.mozilla.org/en-US/firefox/addon/4199.",
      "doi": ""
    },
    {
      "text": "Session Manager : Add-ons for Firefox. https://addons.mozilla.org/en-US/firefox/addon/2324.",
      "doi": ""
    },
    {
      "text": "Internet Explorer Plugin: TabSaver. http://tabsaver.codeplex.com/.",
      "doi": ""
    },
    {
      "text": "Multirow Bookmarks Toolbar : Add-ons for Firefox. https://addons.mozilla.org/en-US/firefox/addon/6937.",
      "doi": ""
    },
    {
      "text": "Group/Sort Tabs : Add-ons for Firefox. https://addons.mozilla.org/en-US/firefox/addon/5627.",
      "doi": ""
    },
    {
      "text": "Tab Kit : Add-ons for Firefox. https://addons.mozilla.org/en-US/firefox/addon/5447.",
      "doi": ""
    },
    {
      "text": "TabGroups Manager : Add-ons for Firefox. https://addons.mozilla.org/en-US/firefox/addon/10254.",
      "doi": ""
    },
    {
      "text": "SurveyGizmo: http://www.surveygizmo.com/",
      "doi": ""
    },
    {
      "text": "tlogger. http://dubroy.com/tlogger/.",
      "doi": ""
    },
    {
      "text": "Project home page. http://office.microsoft.com/en-us/project/default.aspx.",
      "doi": ""
    },
    {
      "text": "Outlook home page. http://office.microsoft.com/en-us/outlook/default.aspx.",
      "doi": ""
    },
    {
      "text": "iGTD. http://bargiel.home.pl/iGTD/.",
      "doi": ""
    },
    {
      "text": "Todoist. http://todoist.com/.",
      "doi": ""
    },
    {
      "text": "Burgess, P.W. Real-world multitasking from a cognitive neuroscience perspective. Control of cognitive processes: Attention and performance XVIII, (2000), 465--472.",
      "doi": ""
    },
    {
      "text": "Carlson, R.A. and Sohn, M.H. Cognitive control of multistep routines: Information processing and conscious intentions. Control of cognitive processes: Attention and performance XVIII, (2000), 443.",
      "doi": ""
    },
    {
      "text": "The UCLA Internet report: Surveying the digital future http://www.digitalcenter.org/pdf/InternetReportYearThree.pdf.",
      "doi": ""
    },
    {
      "text": "Cockburn A. and Mckenzie B. What do web users do? An empirical analysis of web use. International Journal of Human-Computer Studies 54, (2001), 903--922.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "Czerwinski, M., Horvitz, E., and Wilhite, S. A diary study of task switching and interruptions. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2004), 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "González, V.M. and Mark, G. \"Constant, constant, multi-tasking craziness\": managing multiple working spheres. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2004), 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "GVU's 10th WWW user survey. http://www.cc.gatech.edu/gvu/user_surveys/survey-1998--10/.",
      "doi": ""
    },
    {
      "text": "Iqbal, S.T. and Horvitz, E. Disruption and recovery of computing tasks: field study, analysis, and directions. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2007), 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Jhaveri, N. and Räihä, K. The advantages of a cross-session web workspace. CHI '05 extended abstracts on Human factors in computing systems, ACM (2005), 1949--1952.  ",
      "doi": "10.1145/1056808.1057064"
    },
    {
      "text": "Jones, W., Bruce, H., and Dumais, S. Keeping found things found on the web. Proceedings of the tenth international conference on Information and knowledge management, ACM (2001), 119--126.  ",
      "doi": "10.1145/502585.502607"
    },
    {
      "text": "Just, M.A., Carpenter, P.A., Keller, T.A., and Emery, L.Z. Interdependence of non-overlapping cortical systems in dual cognitive task. Neuroimage 14, , 417--426.",
      "doi": ""
    },
    {
      "text": "Kellar, M., Watters, C., and Shepherd, M. A field study characterizing Web-based information-seeking tasks. Journal of the American Society for Information Science and Technology 58, 7 (2007), 999--1018.  ",
      "doi": "10.5555/1241540.1241550"
    },
    {
      "text": "Lee, F.J. and Taatgen, N.A. Multitasking as skill acquisition. Proceedings of the twenty-fourth annual conference of the cognitive science society, (2002), 572--577.",
      "doi": ""
    },
    {
      "text": "MacKay, B. and Carolyn Watters. Understanding and supporting multi-session web tasks. Proceedings of the American Society for Information Science and Technology 45, 1 (2008), 1--13.",
      "doi": ""
    },
    {
      "text": "MacKay, B. and Watters, C. Exploring multi-session web tasks. Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM (2008), 1187--1196.  ",
      "doi": "10.1145/1357054.1357243"
    },
    {
      "text": "MacKay, B. and Watters, C. Building support for multi-session tasks. Proceedings of the 27th international conference extended abstracts on Human factors in computing systems, ACM (2009), 4273--4278.  ",
      "doi": "10.1145/1520340.1520652"
    },
    {
      "text": "Mayer, M. Web history tools and revisitation support: a survey of existing approaches and directions. Foundations and Trends® in Human-Computer Interaction 2, 3 (2007), 173--278.  ",
      "doi": "10.1561/1100000011"
    },
    {
      "text": "Mintzberg, H. The nature of managerial work. Prentice-Hall Englewood Cliffs, NJ, 1980.",
      "doi": ""
    },
    {
      "text": "Mintzberg, H. Structured observation as a method to study managerial work. Journal of Management Studies 7, 1 (1970), 87--104.",
      "doi": ""
    },
    {
      "text": "Miyata, Y. and Norman, D.A. Psychological issues in support of multiple activities. User centered system design, (1986), 265--284.",
      "doi": ""
    },
    {
      "text": "Morris, D., Morris, M.R., and Venolia, G. SearchBar: a search-centric web history for task resumption and information re-finding. Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM (2008), 1207--1216.  ",
      "doi": "10.1145/1357054.1357242"
    },
    {
      "text": "Reiss, F. The hawthorne effect in a pilot program. 1979.",
      "doi": ""
    },
    {
      "text": "Rubinstein, J.S., Meyer, D.E., and Evans, J.E. Executive control of cognitive processes in task switching. Journal Of Experimental Psychology Human Perception And Performance 27, 4 (2001), 763--797.",
      "doi": ""
    },
    {
      "text": "Sellen, A.J., Murphy, R., and Shaw, K.L. How knowledge workers use the web. Proceedings of the SIGCHI conference on Human factors in computing systems: Changing our world, changing ourselves, ACM (2002), 227--234.  ",
      "doi": "10.1145/503376.503418"
    },
    {
      "text": "Spink, A., Jansen, B.J., Wolfram, D., and Saracevic, T. From e-sex to e-commerce: Web search changes. Computer 35, 3 (2002), 107--109.  ",
      "doi": "10.1109/2.989940"
    },
    {
      "text": "Spink, A., Park, M., Jansen, B.J., and Pedersen, J. Multitasking during Web search sessions. Information Processing & Management 42, 1 (2006), 264--275.  ",
      "doi": "10.5555/1138797.1710820"
    },
    {
      "text": "University of Southern California (USC) Annenberg School, C.F.T.D.F. Center for the Digital Future: 2008 Digital Future Report. 2009. http://www.digitalcenter.org/pages/current_report.asp?intGlobalId=19.",
      "doi": ""
    }
  ]
}