{
  "doi": "10.1145/1753326.1753430",
  "title": "Learning on the job: characterizing the programming knowledge and learning strategies of web designers",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "703-712",
  "year": 2010,
  "badges": [],
  "abstract": "This paper reports on a study of professional web designers and developers. We provide a detailed characterization of their knowledge of fundamental programming concepts elicited through card sorting. Additionally, we present qualitative findings regarding their motivation to learn new concepts and the learning strategies they employ. We find a high level of recognition of basic concepts, but we identify a number of concepts that they do not fully understand, consider difficult to learn, and use infrequently. We also note that their learning process is motivated by work projects and often follows a pattern of trial and error. We conclude with implications for end-user programming researchers.",
  "tags": [
    "informal learning",
    "web development"
  ],
  "authors": [
    {
      "name": "Brian Dorn",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81100494006/rel-imgonly/briandorn-headshot.jpg",
      "acmid": "81100494006",
      "orcid": "missing"
    },
    {
      "name": "Mark Guzdial",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81100467156/rel-imgonly/img_3359.jpg",
      "acmid": "81100467156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L. Beckwith, C. Kissinger, M. Burnett, S. Wiedenbeck, J. Lawrance, A. Blackwell, and C. Cook. Tinkering and gender in end--user programmers' debugging. In Proceedings of CHI '06, pages 231--240, 2006.  ",
      "doi": "10.1145/1124772.1124808"
    },
    {
      "text": "A. F. Blackwell. First steps in programming: a rationale for attention investment models. In Proceedings of HCC '02, pages 2--10, 2002. ",
      "doi": "10.5555/795687.797842"
    },
    {
      "text": "J. Brandt, P. J. Guo, J. Lewenstein, M. Dontcheva, and S. R. Klemmer. Two studies of opportunistic programming: interleaving web foraging, learning, and writing code. In Proceedings of CHI '09, pages 1589--1598, 2009.  ",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "V. Braun and V. Clarke. Using thematic analysis in psychology. Qualitative Research in Pyschology, 3(2):77--101, 2006.",
      "doi": ""
    },
    {
      "text": "B. Dorn, A. E. Tew, and M. Guzdial. Introductory computing construct use in an end--user programming community. In Proceedings of VL/HCC '07, pages 27--30, 2007.  ",
      "doi": "10.1109/VLHCC.2007.33"
    },
    {
      "text": "B. Du Boulay. Some difficulties of learning to program. In E. Soloway and J. Spohrer, editors, Studying the Novice Programmer, pages 283--299. LEA, Hillsdale, NJ, 1989.",
      "doi": ""
    },
    {
      "text": "M. Felleisen, R. B. Findler, M. Flatt, and S. Krishnamurthi. The TeachScheme! project: Computing and programming for every student. Computer Science Education, 14(1):55--77, 2004.",
      "doi": ""
    },
    {
      "text": "S. Fincher and J. Tenenberg. Making sense of card sorting data. Expert Systems, 22(3):89--93, 2005.",
      "doi": ""
    },
    {
      "text": "T. R. G. Green and S. J. Payne. Organization and learnability in computer languages. International Journal of Man--Machine Studies, 21:7--18, 1984.  ",
      "doi": "10.1016/S0020-7373%2884%2980035-8"
    },
    {
      "text": "J. G. Greeno, A. M. Collins, and L. B. Resnick. Cognition and learning. In D. C. Berliner and R. C. Calfee, editors, Handbook of educational psychology, pages 15--46. Simon and Schuster Macmillan, New York, NY, 1996.",
      "doi": ""
    },
    {
      "text": "M. Guzdial and C. Kehoe. Apprenticeship--based learning environments: A principled approach to providing software--realized scaffolding through hypermedia. Journal of Interactive Learning Research, 9(3/4):289--336, 1998. ",
      "doi": "10.5555/305102.305109"
    },
    {
      "text": "C. Horstmann. Big Java. John Wiley and Sons, Hoboken, NJ, 2nd edition, 2006. ",
      "doi": "10.5555/1201947"
    },
    {
      "text": "C. Katsanos, N. Tselios, and N. Avouris. Autocardsorter: designing the information architecture of a web site using latent semantic analysis. In Proceedings of CHI '08, pages 875--878, 2008.  ",
      "doi": "10.1145/1357054.1357192"
    },
    {
      "text": "A. J. Ko, B. A. Myers, and H. H. Aung. Six learning barriers in end--user programming systems. In Proceedings of VL/HCC '04, pages 199--206, 2004.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "J. Lave, M. Murtaugh, and O. de la Rocha. The dialectic of arithmetic in grocery shopping. In B. Rogoff and J. Lave, editors, Everyday Cognition, pages 67--94. Harvard University Press, Cambridge, MA, 1984.",
      "doi": ""
    },
    {
      "text": "G. Leshed, E. M. Haber, T. Matthews, and T. Lau. Coscripter: automating & sharing how--to knowledge in the enterprise. In Proceedings of CHI '08, pages 1719--1728, 2008.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "G. Lewandowski, A. Gutschow, R. McCartney, K. Sanders, and D. Shinners--Kennedy. What novice programmers don't know. In Proceedings of ICER '05, pages 1--12, 2005.  ",
      "doi": "10.1145/1089786.1089787"
    },
    {
      "text": "J. Lewis and W. Loftus. Java Software Solutions (Java 5.0 version): Foundations of Program Design. Addison Wesley, Boston, MA, 4th edition, 2005.",
      "doi": ""
    },
    {
      "text": "H. Lieberman, editor. Your Wish is My Command: Programming by Example. Morgan Kaufmann, San Francisco, CA, 2001. ",
      "doi": "10.5555/369505.369520"
    },
    {
      "text": "H. Lieberman, F. Paterno, and V. Wulf, editors. End User Development. Springer, 2006.",
      "doi": ""
    },
    {
      "text": "G. Little and R. C. Miller. Translating keyword commands into executable code. In Proceedings of UIST '06, pages 135--144, 2006.  ",
      "doi": "10.1145/1166253.1166275"
    },
    {
      "text": "K. B. McKeithen, J. S. Reitman, H. H. Rueter, and S. C. Hirtle. Knowledge organization and skill differences in computer programmers. Cognitive Psychology, 13:307--325, 1981.",
      "doi": ""
    },
    {
      "text": "J. F. Pane, C. Ratanamahatana, and B. A. Myers. Studying the language and structure in non--programmers' solutions to programming problems. International Journal of Human--Computer Studies, 54:237--264, 2001.  ",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "B. Rogoff and J. Lave, editors. Everyday Cognition. toExcel, New York, NY, 1999.",
      "doi": ""
    },
    {
      "text": "M. B. Rosson, J. Ballin, and J. Rode. Who, what, and how: A survey of informal and professional web developers. In Proceedings of VL/HCC '05, pages 199--206, 2005.  ",
      "doi": "10.1109/VLHCC.2005.73"
    },
    {
      "text": "W.-M. Roth. Mathematical inscriptions and the reflexive elaboration of understanding: An ethnography of graphing and numeracy in a fish hatchery. Mathematical Thinking and Learning, 7(2):75--110, 2005.",
      "doi": ""
    },
    {
      "text": "G. Rugg and P. McGeorge. The sorting techniques: a tutorial paper on card sorts, picture sorts and item sorts. Expert Systems, 14(2):80--93, 1997.",
      "doi": ""
    },
    {
      "text": "G. Rugg and M. Petre. A gentle guide to research methods. Open University Press, Berkshire, UK, 2007.",
      "doi": ""
    },
    {
      "text": "K. Sanders, S. Fincher, D. Bouvier, G. Lewandowski, B. Morrison, L. Murphy, M. Petre, B. Richards, J. Tenenberg, L. Thomas, R. Anderson, R. Anderson, S. Fitzgerald, A. Gutschow, S. Haller, R. Lister, R. McCauley, J. McTaggart, C. Prasad, T. Scott, D. Shinners--Kennedy, S. Westbrook, and C. Zander. A multi--institutional, multinational study of programming concepts using card sort data. Expert Systems, 22(3):121--128, 2005.",
      "doi": ""
    },
    {
      "text": "C. Scaffidi, M. Shaw, and B. Myers. Estimating the numbers of end users and end user programmers. In Proceedings of VL/HCC '05, pages 207--214, 2005.  ",
      "doi": "10.1109/VLHCC.2005.34"
    },
    {
      "text": "E. Soloway, M. Guzdial, and K. E. Hay. Learner--centered design: The challenge for HCI in the 21st century. Interactions, 1(2):36--48, April 1994.  ",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "J. Spohrer and E. Soloway. Putting it all together is hard for novice programmers. In Proceedings of the IEEE International Conference on Systems, Man, and Cybernetics, November 1985.",
      "doi": ""
    },
    {
      "text": "S. Turkle and S. Papert. Epistemological pluralism and the revaluation of the concrete. In I. Harel and S. Papert, editors, Constructionism: Research reports and essays, 1985--1990, pages 161--192. Ablex, Norwood, N.J., 1991.",
      "doi": ""
    },
    {
      "text": "A. Wilson, M. Burnett, L. Beckwith, O. Granatir, L. Casburn, C. Cook, M. Durham, and G. Rothermel. Harnessing curiosity to increase correctness in end--user programming. In Proceedings of CHI '03, pages 305--312, 2003.  ",
      "doi": "10.1145/642611.642665"
    },
    {
      "text": "J. M. Wing. Computational thinking. Communications of the ACM, 49(3):33--35, 2006.  ",
      "doi": "10.1145/1118178.1118215"
    },
    {
      "text": "J. M. Zelle. Python Programming: An Introduction to Computer Science. Franklin Beedle, Wilsonville, OR, 2004. ",
      "doi": "10.5555/996187"
    }
  ]
}