{
  "doi": "10.1145/1753326.1753693",
  "title": "Cooking with robots: designing a household system working in open environments",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2427-2430",
  "year": 2010,
  "badges": [],
  "abstract": "We propose a cooking system that operates in an open environment. The system cooks a meal by pouring various ingredients into a boiling pot on an induction heating cooker and adjusts the heating strength according to the user's instructions. We then describe how the system incorporates robotic- and human-specific elements in a shared workspace so as to achieve a cooperative rudimentary cooking capability. First, we use small mobile robots instead of built-in arms to save space, improve flexibility and increase safety. Second, we use detachable visual markers to allow the user to easily configure the real-world environment. Third, we provide a graphical user interface to display detailed cooking instructions to the user. We hope insights obtained in this experiment will be useful for the design of other household systems in the future.",
  "tags": [
    "cooking with robots",
    "cooking interface",
    "cooking procedure",
    "human-robot interaction"
  ],
  "authors": [
    {
      "name": "Yuta Sugiura",
      "institution": "Keio University, JST ERATO IGARASHI Design UI Project, Yokohama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442608773",
      "orcid": "missing"
    },
    {
      "name": "Daisuke Sakamoto",
      "institution": "The University of Tokyo, JST ERATO IGARASHI Design UI Project, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81329491765/rel-imgonly/____________.jpg",
      "acmid": "81329491765",
      "orcid": "missing"
    },
    {
      "name": "Anusha Withana",
      "institution": "Keio University, JST ERATO IGARASHI Design UI Project, Yokohama, Japan",
      "img": "/do/10.1145/contrib-81456616335/rel-imgonly/28416_398719482664_7387313_n.jpg",
      "acmid": "81456616335",
      "orcid": "0000-0001-6587-1278"
    },
    {
      "name": "Masahiko Inami",
      "institution": "Keio University, JST ERATO IGARASHI Design UI Project, Yokohama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424140",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo, JST ERATO IGARASHI Design UI Project, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Forlizzi, J. How robotic products become social products: an ethnographic study of cleaning in the home. In Proc. HRI2007. ACM (2007), 129--136.  ",
      "doi": "10.1145/1228716.1228734"
    },
    {
      "text": "Guo, C. and Sharlin, E. Exploring the use of tangible user interfaces for human-robot interaction: a comparative study. In Proc. CHI 2008. ACM (2008), 121--130.  ",
      "doi": "10.1145/1357054.1357076"
    },
    {
      "text": "Hamada, R., Okabe, J., Ide, I., Satoh, S., Sakai, S., and Tanaka, H. Cooking navi: assistant for daily cooking in kitchen. In Proc. MULTIMEDIA 2005. ACM (2005), 371--374.  ",
      "doi": "10.1145/1101149.1101228"
    },
    {
      "text": "Kato, F., Shiina, M., Tokizaki, T., Mitake, H., Aoki, T., and Hasegawa, S. Culinary art designer. In Proc. ACE 2008, vol. 352. ACM (2008), 398--398.  ",
      "doi": "10.1145/1501750.1501847"
    },
    {
      "text": "Kemp, C. C., Anderson, C. D., Nguyen, H., Trevor, A. J., and Xu, Z. A point-and-click interface for the real world: laser designation of objects for mobile manipulation. In Proc. HRI 2008, (2008), 241--248.  ",
      "doi": "10.1145/1349822.1349854"
    },
    {
      "text": "Nakauchi, Y., Fukuda, T., Noguchi, K., and Matsubara, T. Time Sequence Data Mining for Cooking Support Robot, In Proc. CIRA 2005, No.We-B3-4, 2005",
      "doi": ""
    },
    {
      "text": "Okada, K., Ogura, T., Haneda, A., Fujimoto, J., Gravot, F., and Inaba, M. Humanoid motion generation system on HRP2-JSK for daily life environment. In Proc. ICMA 2005, IEEE (2005), Vol. 4, 29, 1772--1777.",
      "doi": ""
    },
    {
      "text": "Sakamoto, D., Honda, K., Inami, M. and Igarashi, T. Sketch and run: a stroke-based interface for home robots. In Proc. CHI 2009, ACM (2009), 197--200.  ",
      "doi": "10.1145/1518701.1518733"
    },
    {
      "text": "Sakamoto D., Kato J., Inami, M. and Igarashi, T. A Toolkit for Easy Development of Mobile Robot Applications with Visual Markers and a Ceiling Camera, In Ext. Abstract of UIST 2009, ACM (2009).",
      "doi": ""
    },
    {
      "text": "Siio, I., Mima, N., Frank, I., Ono, T., and Weintraub, H. Making Recipes in the Kitchen of the Future, In Ext. Abstracts of CHI 2004, (2004), 1554--1554.  ",
      "doi": "10.1145/985921.986130"
    },
    {
      "text": "Zhao, S., Nakamura, K., Ishii, K. and Igarashi, T. Magic cards: a paper tag interface for implicit robot control. In Proc. CHI 2009, ACM (2009), 173--182.  ",
      "doi": "10.1145/1518701.1518730"
    }
  ]
}