{
  "doi": "10.1145/1753326.1753369",
  "title": "An unobtrusive behavioral model of \"gross national happiness\"",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "287-290",
  "year": 2010,
  "badges": [],
  "abstract": "I analyze the use of emotion words for approximately 100 million Facebook users since September of 2007. \"Gross national happiness\" is operationalized as a standardized difference between the use of positive and negative words, aggregated across days, and present a graph of this metric. I begin to validate this metric by showing that positive and negative word use in status updates covaries with self-reported satisfaction with life (convergent validity), and also note that the graph shows peaks and valleys on days that are culturally and emotionally significant (face validity). I discuss the development and computation of this metric, argue that this metric and graph serves as a representation of the overall emotional health of the nation, and discuss the importance of tracking such metrics.",
  "tags": [
    "psychology",
    "gross national happiness",
    "statistics",
    "quantitative methods",
    "facebook",
    "emotion"
  ],
  "authors": [
    {
      "name": "Adam D.I. Kramer",
      "institution": "University of Oregon, Eugene, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100175734",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cacioppo, J. T., Gardner, W. L., & Bernston, G. G. (1997). Beyond bipolar conceptualizations and measures: The case of attitudes and evaluative space. Personality and Social Psychology Review, 1, 3--25.",
      "doi": ""
    },
    {
      "text": "Diener, Diener, & Diener (1995). Factors predicting the subjective well-being of nations. Journal of Personality and Social Psychology, 69, 851--864.",
      "doi": ""
    },
    {
      "text": "Diener, E., Emmons, R. A., Larson, R. J., & Griffin, S. (1985). The satisfaction with life scale. Journal of Personality Assessment, 49, 71--75.",
      "doi": ""
    },
    {
      "text": "Facebook Data Team. (2009). How diverse is Facebook? Retrieved from http://www.facebook.com/note.php?note_id=205925658858&id=8394258414&ref=mf",
      "doi": ""
    },
    {
      "text": "Facebook. (2009). Facebook Press Statistics. Retrieved Jan 5, 2009, from http://www.facebook.com/press/info.php?statistics",
      "doi": ""
    },
    {
      "text": "Gallup. (2008). Well-being index. http://www.well-beingindex.com.",
      "doi": ""
    },
    {
      "text": "Gill, A. J., French, R. M., Gergle, D., Oberlander, J. (2008). The language of emotion in short blog texts. Proc. CSCW 2008, 299--302.  ",
      "doi": "10.1145/1460563.1460612"
    },
    {
      "text": "Hancock, J. T., Landrigan, C., & Silver, C. (2007). Expressing emotion in online communication. Proc. CHI 2007, 929--932.  ",
      "doi": "10.1145/1240624.1240764"
    },
    {
      "text": "Kahneman, D., Diener, E., & Schwarz, N. (Eds.). (2003). Well-being: The foundations of hedonic psychology. New York: Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Kramer A. D. I., Fussell, S. R., & Setlock, L. D. (2004). Text analysis as a tool for analyzing conversation in online support groups. Proc. CHI 2004, 1485--1488.  ",
      "doi": "10.1145/985921.986096"
    },
    {
      "text": "Kramer, A. D. I. & Grover, R. (2009). United States Gross National Happiness on Facebook. http://apps.facebook.com/usa_gnh/",
      "doi": ""
    },
    {
      "text": "Mishne, G. (2005). Experiments with mood classification in blog posts. Proc. Style2005.",
      "doi": ""
    },
    {
      "text": "Pinheiro, J., Bates, D., DebRoy, S., Sarkar, D., & The R Core Team (2009). nlme: Linear and nonlinear mixed effects models. R package version 3, 1--93.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Chung, C. K., Ireland, M., Gonzales, A., & Booth, R. J. (2007). The development and psychological properties of LIWC2007. Retrieved from http://www.liwc.net",
      "doi": ""
    },
    {
      "text": "R Development Core Team (2009). R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria. ISBN 3-900051-07-0, URL http://www.R-project.org",
      "doi": ""
    },
    {
      "text": "Raudenbusch, S. W. & Bryk, A. S. (2001). Hierarchical linear models: Applications and data analysis methods (2nd ed.). Newbury Park: Sage.",
      "doi": ""
    },
    {
      "text": "Twitter. http://www.twitter.com",
      "doi": ""
    },
    {
      "text": "Thusoo, A., and Facebook Data/Infrastructure (August 2009). Hive --- A warehousing solution over a map-reduce framework. Proc. 35th. Intl. Conf. on Very Large Data Bases. Lyon, France. ",
      "doi": "10.14778/1687553.1687609"
    },
    {
      "text": "Veenhoven, R. (2007). Measures of gross national happiness. OECD: Statistics, Knowledge and Policy 2007: Measuring and fostering the progress of societies (pp. 231--253). OECD Publishing: London.",
      "doi": ""
    }
  ]
}