{
  "doi": "10.1145/1753326.1753682",
  "title": "The family window: the design and evaluation of a domestic media space",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2361-2370",
  "year": 2010,
  "badges": [],
  "abstract": "Families have a strong need to connect with their loved ones over distance. However, most technologies do not provide the same feelings of connectedness that one feels from seeing remote family members. Hence our goal was to understand if a video connection, in the form of a media space, could help families feel more connected and what design factors would be critical for its success. To answer this, we designed a video media space called the Family Window and deployed it within the homes of two families for eight months and four families for five weeks. Our results show that always-on video can lead to an increase in feelings of connectedness by providing availability awareness and opportunities for sharing everyday life. However usage and value of such media spaces hinges on close-knit relationships and control over one's autonomy.",
  "authors": [
    {
      "name": "Tejinder K. Judge",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655970",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Kodak Research Labs, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Andrew F. Kurtz",
      "institution": "Kodak Research Labs, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460653070",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Begole, J., Tang, J.C., Smith, R.B., and Yankelovich, N. Work Rhythms: Analyzing Visualizations of Awareness Histories of Distributed Groups. Proc CSCW '02, ACM Press (2002), 334--343.  ",
      "doi": "10.1145/587078.587125"
    },
    {
      "text": "Boyle, M., Edwards, C., and Greenberg, S. The Effects of Filtered Video on Awareness and Privacy, Proc. CSCW'00, ACM Press (2000).  ",
      "doi": "10.1145/358916.358935"
    },
    {
      "text": "Boyle, M., Neustaedter, C., and Greenberg, S. Privacy Factors in Video-based Media Spaces, Media Space: 20+ Years of Mediated Life, Springer (2009).",
      "doi": ""
    },
    {
      "text": "Brush, A.J., Inkpen, K., and Tee, K. SPARCS: Exploring Sharing Suggestions to Enhance Family Connectedness, Proc. CSCW 2008, ACM Press (2008).  ",
      "doi": "10.1145/1460563.1460661"
    },
    {
      "text": "Bly, S., Harrison, S., and Irwin, S. Media Spaces: Bringing Together a Video, Audio and Computing Environment, Communications of the ACM, 36(1), ACM Press (1993).  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Conversy, S., Mackay, W., Beaudouin-Lafon, M., and Roussel, N. VideoProbe: Sharing Pictures of Everyday Life, Proc. IHM 2003, ACM Press (2003).",
      "doi": "10.1145/1063669.1063704"
    },
    {
      "text": "Coutaz, J., Bérard, F., Carraux, E., and Crowley, J. Early Experience with the Mediaspace CoMedi, IFIP Working Conference on Engineering for Human-Computer Interaction (EHCI 98), (1998). ",
      "doi": "10.5555/645349.650713"
    },
    {
      "text": "Dourish, P. Culture and Control in a Media Space, Proc. ECSCW '93, Springer (1993), 125--137. ",
      "doi": "10.5555/1241934.1241943"
    },
    {
      "text": "Elliot, K., Watson, M., Neustaedter, C., and Greenberg, S., Location-dependent information appliances for the home, Proc. Graphics Interface 2007, ACM (2007).  ",
      "doi": "10.1145/1268517.1268543"
    },
    {
      "text": "Fish, R., Kraut, R., and Chalfonte, B. The VideoWindow System in Informal Communications, Proc. CSCW 1990, ACM Press (1990).  ",
      "doi": "10.1145/99332.99335"
    },
    {
      "text": "Gaver, W. The Video Window: My Life with a Ludic System, Media Space: 20+ Years of Mediated Life, Springer (2009).",
      "doi": ""
    },
    {
      "text": "Harrison, S. Media Space: 20+ Years of Mediated Life, Springer (2009). ",
      "doi": "10.5555/1557625"
    },
    {
      "text": "Hindus, D., Ackerman, M.S., Mainwaring, S., and Starr, B., Thunderwire: a field study of an audio-only media space, Proc. CSCW 1996, ACM Press (1996).  ",
      "doi": "10.1145/240080.240262"
    },
    {
      "text": "Hindus, D, Mainwaring, S.D., Leduc, N., Hagström, A.E., and Bayley, O. Casablanca: Designing Social Communication Devices for the Home, Proc. CHI 2001, ACM Press (2001), 325--332.  ",
      "doi": "10.1145/365024.383749"
    },
    {
      "text": "Hudson, S.E., and Smith, I. Techniques for Addressing Fundamental Privacy and Disruption Tradeoffs in Awareness Support Systems, Proc CSCW 96, ACM Press (1996), 248--257.  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., Rouseel, N., Eiderback, B., Lindquist, S., and Sundblad, Y. Technology Probes: Inspiring Design for and with Families, Proc. CHI 2003, ACM Press (2003), 17--25.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Ishii, H., Kobayashi, M., and Arita, K. Iterative Design of Seamless Collaboration Media, Communications of the ACM, 37(8), ACM Press, (1994).  ",
      "doi": "10.1145/179606.179687"
    },
    {
      "text": "Judge, T.K. and Neustaedter, C. Sharing Conversation and Sharing Life: Video Conferencing in the Home, Proc. CHI 2010, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753422"
    },
    {
      "text": "Judge, T.K., and Neustaedter, C. The Family Window: Perceived Usage and Privacy Concerns, Technical Report TR-10-01, Dept. of Computer Science, Virginia Tech, (2010).",
      "doi": ""
    },
    {
      "text": "Kurtz, A., Neustaedter, C., and Blose, A. Automated Videography for Residential Communications, Proc. SPIE 2010, Vol. 7527 (2010).",
      "doi": ""
    },
    {
      "text": "Lipartito, K. Picturephone and the Information Age: The Social Meaning of Failure, Technology & Culture, (2003), 50--81.",
      "doi": ""
    },
    {
      "text": "Lindley, S.E., Banks, R., Harper, R., Jain, A., Regan, T., Sellen, A., and Taylor, A.S. Resilience in the face of innovation: Household trials with BubbleBoard. IJHCS. 67, 2, Academic Press (2009), 154--164  ",
      "doi": "10.1016/j.ijhcs.2008.07.008"
    },
    {
      "text": "Mantei, M., Baecker, R., Sellen, A., Buxton, W., Milligan, T., and Wellman, B. Experiences in the use of a media space, Proc. CHI 1991, ACM Press (1991).  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "Minneman, S., and Harrison, S. Where Were We: Making and Using Near-synchronous, Pre-narrative Video, Proc. Multimedia 1993, ACM Press (1993).  ",
      "doi": "10.1145/166266.166290"
    },
    {
      "text": "Mynatt, E., Rowan, J., Jacobs, A., and Craighill, S. Digital Family Portraits: Supporting Peace of Mind for Extended Family Members, Proc. CHI 2001, ACM Press (2001), 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Noll, A. Anatomy of a Failure: Picturephone Revisited, Telecommunications Policy (2002).",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., and Greenberg, S. The Design of a Context-Aware Home Media Space, Proc. UbiComp 2003, Springer-Verlag (2003).",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., Elliot, K., and Greenberg, S. Interpersonal Awareness in the Domestic Realm, Proc. OzCHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1228175.1228182"
    },
    {
      "text": "Neustaedter, C., Greenberg, S., and Boyle, M. Blur Filtration Fails to Preserve Privacy for Home-Based Video Conferencing, ACM ToCHI, ACM Press (2006).  ",
      "doi": "10.1145/1143518.1143519"
    },
    {
      "text": "Neustaedter, C., Judge, T., Kurtz, A., and Fedorovskaya, E. The Family Window: Connecting Families over Distance with a Domestic Media Space, Video Proc. CSCW 2010, ACM Press.",
      "doi": ""
    },
    {
      "text": "Nunes, M., Greenberg, S., Carpendale, S., and Gutwin, C. What Did I Miss? Visualizing the Past through Video Traces, Proc. ECSCW 07, Springer (2007), 1--20.",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Black, A., and Lipson, M. Media Spaces and Mobile Video Telephony, Media Space: 20+ years of mediated life, Springer (2009).",
      "doi": ""
    },
    {
      "text": "Romero, N., Markopoulos, P., van Baren, J., de Ruyter, B, Jsselsteijn, W., and Farshchian, B. Connecting the Family with Awareness Systems, Personal and Ubiquitous Computing, 11, Springer-Verlag (2006).  ",
      "doi": "10.1007/s00779-006-0089-0"
    },
    {
      "text": "Roussel, N. From Analog to Digital, from the Office to the Living Room: Why I Happily Worked in a Media Space but Don't Live in One, Media Space: 20+ years of mediated life, Springer (2009).",
      "doi": ""
    },
    {
      "text": "Sellen, A., Eardley, R, Izadi, S., Harper, R., The Whereabouts Clock: Early Testing of a Situated Awareness Device, Proc. CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1125451.1125694"
    },
    {
      "text": "Sellen, A., Harper, R., Eardley, R., Izadi, S., Regan, T., Taylor, A., and Wood, K., Situated Messaging in the Home, Proc. CSCW 2006, ACM Press (2006).  ",
      "doi": "10.1145/1180875.1180933"
    },
    {
      "text": "Tang, J., and Minneman, S. VideoDraw: A Video Interface for Collaborative Drawing, Proc. CHI 1990, ACM Press (1990).  ",
      "doi": "10.1145/97243.97302"
    },
    {
      "text": "Tang, J., and Minneman, S. VideoWhiteboard: Video Shadows to Support Remote Collaboration, Proc. CHI 1991, ACM Press (1991).  ",
      "doi": "10.1145/108844.108932"
    },
    {
      "text": "Tee, K., Brush, A.J.B., and Inkpen, K.M. Exploring Communication and Sharing between Extended Families, International Journal of Human-Computer Studies, 67(2), (2009), 128--138.  ",
      "doi": "10.1016/j.ijhcs.2008.09.007"
    },
    {
      "text": "Tollmar, K., and Persson, J. Understanding Remote Presence, Proc. NordiCHI 2002, ACM Press (2002).  ",
      "doi": "10.1145/572020.572027"
    }
  ]
}