{
  "doi": "10.1145/1753326.1753589",
  "title": "Improving social game engagement on facebook through enhanced socio-contextual information",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1753-1756",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we describe the results of a controlled study of a social game, Magpies, which was built on the Facebook Online Social Network (OSN) and enhanced with contextual social information in the form of a variety of social network indices. Through comparison with a concurrent control trial using an identical game without the enhanced social information, it was shown that the additional contextual data increased the frequency of social activity between players engaged in the game. Despite this increase in activity, there was little increase in growth of the player-base when compared to the control condition. These findings corroborate previous work that showed how socio-contextual enhancement can increase performance on task-driven games, whilst also suggesting that it can increase activity and engagement when provided as context for non task-driven game environments.",
  "authors": [
    {
      "name": "Ben Kirman",
      "institution": "University of Lincoln, Lincoln, United Kingdom",
      "img": "/do/10.1145/contrib-81331496431/rel-imgonly/profile_nov21_sq.png",
      "acmid": "81331496431",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "University of Lincoln, Lincoln, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    },
    {
      "name": "Conor Linehan",
      "institution": "University of Lincoln, Lincoln, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440592407",
      "orcid": "missing"
    },
    {
      "name": "Francesco Martino",
      "institution": "University of Padova, Padova, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331498959",
      "orcid": "missing"
    },
    {
      "name": "Luciano Gamberini",
      "institution": "University of Padova, Padova, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100210885",
      "orcid": "missing"
    },
    {
      "name": "Andrea Gaggioli",
      "institution": "Istituto Auxologico Italiano, Milan, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81413593976",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Biocca, F., Harms, C. & Burgoon, J. K. Toward a more robust theory and measure of social presence, Teleoper. Virtual Environ., MIT Press, 2003, 12, 456--480  ",
      "doi": "10.1162/105474603322761270"
    },
    {
      "text": "DiMicco, J. M., Pandolfo, A. & Bender, W. Influencing group participation with a shared display CSCW '04: Proceedings of the 2004 ACM conference on Computer supported cooperative work, 614--623  ",
      "doi": "10.1145/1031607.1031713"
    },
    {
      "text": "Erickson, T. and Kellogg, W. A. (2000) Social translucence: an approach to designing systems that support social processes. ACM Trans. Comput.-Hum. Interact. 7, 1, 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Gjoka, M., Sirivianos, M., Markopoulou, A. & Yang, X. Poking facebook: characterization of osn applications WOSP '08: Proceedings of the first workshop on Online social networks, ACM, 2008, 31--36  ",
      "doi": "10.1145/1397735.1397743"
    },
    {
      "text": "Kim, T., Chang, A., Holland, L. & Pentland, A. Meeting mediator: enhancing group collaboration using sociometric feedback CSCW, 2008, 457--466  ",
      "doi": "10.1145/1460563.1460636"
    },
    {
      "text": "Kirman, B., Lawson, S., et al, S. Familiars --- Manipulating Social Networks with Mobile Gaming, Proceedings of Games Design and Technology Workshop and Conference (GDTW) 2008, Liverpool",
      "doi": ""
    },
    {
      "text": "Kluger, A.N. & DeNisi, A. (1996). The effects of feedback interventions on performance: a historical review, a meta-analysis and a preliminary feedback intervention theory. Psych. Bulletin, 119, 254--284",
      "doi": ""
    },
    {
      "text": "Madan, A. & Pentland, A. VibeFones: Socially Aware Mobile Phones 10th IEEE International Symposium on Wearable Computers",
      "doi": ""
    },
    {
      "text": "Martino. F., Baù, R., Spagnolli, A., Gamberini, L. (2009). Presence in the age of Social Networks: Augmenting Mediated Environments with Feedback on Group Activity. Virtual Reality, 13 (3)  ",
      "doi": "10.5555/1613629.1613635"
    },
    {
      "text": "Martino, F., Miotto, A., Davide, F. and Gamberini, L, Exploring Social Network Indices as Cues to Augment Communication, 1st International Workshop on Maps Based Interaction in Social Networks (MapISNet) 2007",
      "doi": ""
    },
    {
      "text": "Nazir, A. Raza, S. & Chuah, C. Unveiling facebook: a measurement study of social network based applications IMC '08: Proceedings of the 8th ACM SIGCOMM conference on Internet measurement, ACM, 2008, 43--56  ",
      "doi": "10.1145/1452520.1452527"
    },
    {
      "text": "Rogers, E. M., Diffusion of Innovations, 5th Edition, Free Press, 2003",
      "doi": ""
    },
    {
      "text": "Steinkuehler, C. & Williams, D. Where Everybody Knows Your (Screen) Name: Online Games as \"Third Places\" J of Computer-Mediated Comm, 2006, 11",
      "doi": ""
    },
    {
      "text": "Wasserman, S. & Faust, K. Social Network Analysis: Methods and Applications, New York: Cambridge University Press, 1994",
      "doi": ""
    }
  ]
}