{
  "doi": "10.1145/1753326.1753529",
  "title": "Interactive optimization for steering machine classification",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1343-1352",
  "year": 2010,
  "badges": [],
  "abstract": "Interest has been growing within HCI on the use of machine learning and reasoning in applications to classify such hidden states as user intentions, based on observations. HCI researchers with these interests typically have little expertise in machine learning and often employ toolkits as relatively fixed \"black boxes\" for generating statistical classifiers. However, attempts to tailor the performance of classifiers to specific application requirements may require a more sophisticated understanding and custom-tailoring of methods. We present ManiMatrix, a system that provides controls and visualizations that enable system builders to refine the behavior of classification systems in an intuitive manner. With ManiMatrix, users directly refine parameters of a confusion matrix via an interactive cycle of re-classification and visualization. We present the core methods and evaluate the effectiveness of the approach in a user study. Results show that users are able to quickly and effectively modify decision boundaries of classifiers to tai-lor the behavior of classifiers to problems at hand.",
  "tags": [
    "interactive optimization",
    "interactive machine learning",
    "decision theory",
    "visualization"
  ],
  "authors": [
    {
      "name": "Ashish Kapoor",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100301388",
      "orcid": "missing"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Desney Tan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "20 Newsgroups. http://kdd.ics.uci.edu/databases/20newsgroups/20newsgroups.html.",
      "doi": ""
    },
    {
      "text": "Ankerst, M., Elsen, C., Ester, M. and Kriegel, H.-P. Visual classification: an interactive approach to decision tree construction. KDD 1999.  ",
      "doi": "10.1145/312129.312298"
    },
    {
      "text": "Becker, B., Kohavi, R. and Sommerfield, D. Visualizing the Simple Bayesian Classifier. Information Visualization in Data Mining and Knowledge Discovery, {ed.} Fayyad, U., Grinstein, G. and Wierse, A. (2001). ",
      "doi": "10.5555/383784.383809"
    },
    {
      "text": "Caragea, D., Cook, D. and Honavar, V.G. Gaining insights into support vector machine pattern classifiers using projection-based tour methods. KDD 2001.  ",
      "doi": "10.1145/502512.502547"
    },
    {
      "text": "Cover, T.M. and Thomas, A.J. Elements of Information Theory. Wiley-Interscience, Hoboken, NJ, USA, 2006. ",
      "doi": "10.5555/1146355"
    },
    {
      "text": "Dai, J. and Cheng, J. HMM Editor: a visual editing tool for profile hidden Markov models. BMC Genomics 9, Suppl1 (2008).",
      "doi": ""
    },
    {
      "text": "Drummond, C. and Holte, R.C. Cost curves: An improved method for visualizing classifier performance. Machine Learning 65, 1 (2006).  ",
      "doi": "10.1007/s10994-006-8199-5"
    },
    {
      "text": "Duda, R.O, Hart, P.E. and Stock, D.G. Pattern Classification. Wiley-Interscience, Hoboken, NJ, USA, 2004. ",
      "doi": "10.5555/954544"
    },
    {
      "text": "Evgeniou, T., Pontil, M. and Elisseeff, A. Leave One Out Error, Stability, and Generalization of Voting Combinations of Classifiers. Machine Learning 55, 1 (2004).  ",
      "doi": "10.1023/B%3AMACH.0000019805.88351.60"
    },
    {
      "text": "Fails, J.A. and Olsen, D.R.J. Interactive machine learning. IUI 2003.  ",
      "doi": "10.1145/604045.604056"
    },
    {
      "text": "Fei-Fei, L., Fergus, R. and Perona, P. One-Shot Learning of Object Categories. IEEE Transactions on Pattern Analysis and Machine Intelligence 28, 4 (2006).  ",
      "doi": "10.1109/TPAMI.2006.79"
    },
    {
      "text": "Fogarty, J., Ko, A., Aung, H., Golden, E., Tang, K. and Hudson, S. Examining task engagement in sensor-based statistical models of human interruptibility. CHI 2005.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "Frank, E. and Hall, M. Visualizing class probability estimators. LNCS 2838, Springer (2003).",
      "doi": ""
    },
    {
      "text": "Garner, S.R. WEKA: The Waikato Environment for Knowledge Analysis. New Zealand Computer Science Research Students Conference, (1995).",
      "doi": ""
    },
    {
      "text": "Grimes, D., Tan, D., Hudson, S., Shenoy, P. and Rao, R. Feasibility and pragmatics of classifying working memory load with an electroencephalograph. CHI 2008.  ",
      "doi": "10.1145/1357054.1357187"
    },
    {
      "text": "Horvitz, E. and Apacible, J. Learning and Reasoning about Interruption. ICMI 2003.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Kapoor, A. and Horvitz, E. Experience sampling for building predictive user models: a comparative study. CHI 2008.  ",
      "doi": "10.1145/1357054.1357159"
    },
    {
      "text": "Moustakis, V. Do People in HCI Use Machine Learning? HCI 2, (1997).",
      "doi": ""
    },
    {
      "text": "Patel, K., Fogarty, J., Landay, J. and Harrison, B. Examining Difficulties Software Developers Encounter in the Adoption of Statistical Machine Learning. AAAI 2008. ",
      "doi": "10.5555/1620270.1620333"
    },
    {
      "text": "Picard, R.W. Affective computing. MIT Press, Cambridge, MA, USA, 1997. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Platt, J.C. Probabilistic Outputs for Support Vector Machines and Comparisons to Regularized Likelihood Methods. Advances in Large Margin Classifiers, MIT Press (1999).",
      "doi": ""
    },
    {
      "text": "Rheingans, P. and desJardins, M. Visualizing High-Dimensional Predictive Model Quality. VIS 2000. ",
      "doi": "10.5555/375213.375313"
    },
    {
      "text": "Saponas, S., Tan, S., Morris, D. and Balakrishnan, R. Demonstrating the feasibility of using forearm electro-myography for muscle-computer interfaces. CHI 2008.  ",
      "doi": "10.1145/1357054.1357138"
    },
    {
      "text": "Stiglic, G., Mertik, M., Podgorelec, V. and Kokol, P. Using Visual Interpretation of Small Ensembles in Microarray Analysis. CMBS 2006.  ",
      "doi": "10.1109/CBMS.2006.169"
    },
    {
      "text": "Talbot, J., Lee, B., Kapoor, A., and Tan, D. Ensemble Matrix: Interactive Visualization to Support Machine Learning with Multiple Classifiers, CHI 2009.  ",
      "doi": "10.1145/1518701.1518895"
    },
    {
      "text": "Urbanek, S. Exploring Statistical Forests. Joint Statistical Meeting 2002.",
      "doi": ""
    },
    {
      "text": "Ware, M., Frank, E., Holmes, G., Hall, M. and Witten, I. Interactive machine learning: letting users build classifiers. Int. J .Human-Computer Studies 56, 3 (2001). ",
      "doi": "10.5555/514412.514417"
    }
  ]
}