{
  "doi": "10.1145/1753326.1753607",
  "title": "Finding the lost treasure: understanding reuse of used computing devices",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1875-1878",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper, we report our findings on the adoption practices of used personal digital assistants (PDAs) to inform reuse of outdated computing products. Our interviews with 12 eBay users who bought used PDAs showed a variety of ways in which users indirectly supported sustainability. This allowed us to re-examine sustainability as something that is dynamically and arbitrarily shaped by the users and not just dependent on the sustainable feature of the product. We end with design implications for supporting users' shaping of sustainability.",
  "tags": [
    "situated sustainability",
    "sustainable interaction design",
    "sustainability",
    "reuse"
  ],
  "authors": [
    {
      "name": "Jina Huh",
      "institution": "University of Michigan, Ann Arbor, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659418780",
      "orcid": "missing"
    },
    {
      "name": "Kevin Nam",
      "institution": "University of Michigan, Ann Arbor, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660687539",
      "orcid": "missing"
    },
    {
      "name": "Nikhil Sharma",
      "institution": "University of Michigan, Ann Arbor, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659424316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nathan, L.P., et al., Beyond the hype, in CHI. 2008, ACM: Florence, Italy. p. 2273--2276.  ",
      "doi": "10.1145/1358628.1358667"
    },
    {
      "text": "Blevis, E., Sustainable interaction design, in CHI. 2007, ACM: San Jose, California, USA. p. 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Huang, E. and K. Truong, SUSTAINABLY OURS-Situated Sustainability for Mobile Phones. Interactions-New York, 2008. 15(2): p. 16--19.  ",
      "doi": "10.1145/1340961.1340966"
    },
    {
      "text": "Wakkary, R. and K. Tanenbaum, A sustainable identity, in CHI. 2009, ACM: Boston, MA, USA. p. 365--374.  ",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Dillahunt, T., et al. Motivating environmentally sustainable behavior changes with a virtual polar bear. in Pervasive'08 Workshop. 2008.",
      "doi": ""
    },
    {
      "text": "Huang, E.M. and K.N. Truong, Breaking the disposable technology paradigm, in CHI. 2008, p. 323--332.  ",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Odom, W., et al. Understanding why we preserve some things and discard others in the context of interaction design. in CHI. 2009. 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Miles, M. and A. Huberman, Qualitative data analysis: An expanded sourcebook. 1994: Sage.",
      "doi": ""
    }
  ]
}