{
  "doi": "10.1145/1753326.1753715",
  "title": "Individual models of color differentiation to improve interpretability of information visualization",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2563-2572",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Color is commonly used to represent categories and values in many computer applications, but differentiating these colors can be difficult in many situations (e.g., for users with color vision deficiency (CVD), or in bright light). Current solutions to this problem can adapt colors based on standard simulations of CVD, but these models cover only a fraction of the ways in which color perception can vary. To improve the specificity and accuracy of these approaches, we have developed the first ever individualized model of color differentiation (ICD). The model is based on a short calibration performed by a particular user for a particular display, and so automatically covers all aspects of the user's ability to see and differentiate colors in an environment. In this paper we introduce the new model and the manner in which differentiability limits are predicted. We gathered empirical data from 16 users to assess the model's accuracy and robustness. We found that the model is highly effective at capturing individual differentiation abilities, works for users with and without CVD, can be tuned to balance accuracy and color availability, and can serve as the basis for improved color adaptation schemes.",
  "authors": [
    {
      "name": "David R. Flatla",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-81460658260/rel-imgonly/mypicture2cropped.png",
      "acmid": "81460658260",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Birch, J. Diagnosis of Defective Colour Vision. Butterworth Heinemann, Linacre House, Jordan Hill, Oxford, 2nd ed., (2001).",
      "doi": ""
    },
    {
      "text": "Birch, J. Extreme anomalous trichromatism. In Mollon, Pokorny, and Knoblauch, eds., Normal and Defective Colour Vision. Oxford University Press, NY, NY, USA, (2003), 364--369.",
      "doi": ""
    },
    {
      "text": "Booth, D., and Freeman R. Discriminative feature integration by individuals. Acta Psy. 84 (1993), 1--16.",
      "doi": ""
    },
    {
      "text": "Brettel, H., Viénot, F., and Mollon, J. Computerized simulation of color appearance for dichromats. J. Opt. Soc. Am. A., 14, 10 (1997), 2647--2655.",
      "doi": ""
    },
    {
      "text": "Cole, B. The handicap of abnormal colour vision. Clinical and Experimental Optometry, 87, 4-5 (2004), 258--275.",
      "doi": ""
    },
    {
      "text": "Healey, C. Choosing Effective Colours for Data Visualization. Proc. VIS '96, IEEE (1996), 263--270. ",
      "doi": "10.5555/244979.245597"
    },
    {
      "text": "Heim M., Morgner J. Disturbed color vision in endogenous psychoses. Psychiatr. Prax. 28, 6 (2001), 284--286.",
      "doi": ""
    },
    {
      "text": "Iaccarino, G., Efficient Edge-Services for Colorblind Users. Proc. WWW '06, ACM (2006), 919--920.  ",
      "doi": "10.1145/1135777.1135944"
    },
    {
      "text": "Ichikawa, M., et al. Web-Page Color Modification for Barrier-Free Color Vision with Genetic Algorithm. Proc. GECCO 2003, (2003), 22--30. ",
      "doi": "10.5555/1756582.1756698"
    },
    {
      "text": "Ichikawa, M., et al. Preliminary Study on Color Modification for Still Images to Realize Barrier-Free Color Vision. Proc. IEEE SMC, (2004), 36--41.",
      "doi": ""
    },
    {
      "text": "Ishihara, S. Tests for Colour-Blindness, 9th ed. Pseudoisochromatic Plates, London, (1950).",
      "doi": ""
    },
    {
      "text": "Jefferson, L., and Harvey, R. Accommodating Color Blind Computer Users. ASSETS '06, (2006), 40--47.  ",
      "doi": "10.1145/1168987.1168996"
    },
    {
      "text": "Jefferson, L., and Harvey, R. An Interface to Support Color Blind Computer Users. Proc. CHI'07, (2007), 1535--1538.  ",
      "doi": "10.1145/1240624.1240855"
    },
    {
      "text": "Lomax, R., Ridgway P., and Meldrum M. Does Occupational Exposure to Organic Solvents Affect Colour Discrimination? Toxicological Reviews, 23, 2 (2004), 91--121.",
      "doi": ""
    },
    {
      "text": "Meyer, G., and Greenburg, D. Color-Defective Vision and Computer Graphics Displays. IEEE CG&A, 8, 5 (1988), 28--40.  ",
      "doi": "10.1109/38.7759"
    },
    {
      "text": "Neitz J. and Jacobs, G. Polymorphism of the long-wavelength cone in normal human colour vision. Nature, 323 (1986) 623--625.",
      "doi": ""
    },
    {
      "text": "Rasche, K., Geist R., and Westall, J. Detail Preserving Reproduction of Color Images for Monochromats and Dichromats. IEEE CG&A, 25, 3 (2005), 22--30.  ",
      "doi": "10.1109/MCG.2005.54"
    },
    {
      "text": "Rasche, K., Geist R., and Westall, J. Re-coloring Images for Gamuts of Lower Dimension. Computer Graphics Forum, 24, 3 (2005), 423--432.",
      "doi": ""
    },
    {
      "text": "Ro, Y., and Yang, S. Color Adaptation for Anomalous Trichromats. I.J. Imag. Sys. Tech., 14, 1 (2004), 16--20.",
      "doi": ""
    },
    {
      "text": "Stone, M. A Field Guide to Digital Color. Natick, MA. A. K. Peters, Ltd. (2003). ",
      "doi": "10.5555/863149"
    },
    {
      "text": "Tufte, E., Envisioning Information. Graphics Press, Cheshire, Connecticut, USA, 10th ed., (1990). ",
      "doi": "10.5555/78223"
    },
    {
      "text": "Viénot, F., et al. What do colour-blind people see? Nature, 376 (1995), 127--128.",
      "doi": ""
    },
    {
      "text": "Wakita, K., and Shimamura, K. SmartColor: Disambiguation Framework for the Colorblind. Proc. ASSETS '05, ACM (2005), 158--165.  ",
      "doi": "10.1145/1090785.1090815"
    },
    {
      "text": "Ware, C. Information Visualization -- Perception for Design. Morgan Kaufmann, San Francisco, (2000). ",
      "doi": "10.5555/329554"
    },
    {
      "text": "Yang, S., Ro, Y., Wong, E., and Lee, J. Quantification and Standardized Description of Color Vision Deficiency Caused by Anomalous Trichromats -- Part 1: Simulation and Measurement. EURASIP Journal on Image and Video Processing, (2008), 1--12.  ",
      "doi": "10.1155/2008/487618"
    }
  ]
}