{
  "doi": "10.1145/1753326.1753581",
  "title": "Where is my team: supporting situation awareness with tactile displays",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1705-1714",
  "year": 2010,
  "badges": [],
  "abstract": "A group of friends visiting a crowded and noisy music festival is an example of a situation where knowing the location of other people is important, but where external factors, such as darkness or noise, can limit the ability to keep track of the others. By combining theories about situation awareness and cognitive processing we inferred that communicating information via the sense of touch is a promising approach in such situations. We therefore investigated how to present the location of several people using a tactile torso display. In particular we focused on encoding spatial distances in the tactile signals. We experimentally compared encoding spatial distances in the rhythm, duration, and intensity of a tactile signal. Our findings show that all parameters are suited to encode distances. None of it was clearly outperformed. We then embedded our tactile location encoding into a fast-paced 3D multiplayer game. In this game, team play and the awareness of the team members' locations are crucial for the success in the game. The results provides evidence that the locations of the team members could be processed effectively despite the game's high cognitive demands. In addition, the team equipped with the tactile display showed a better team play and a higher situation awareness.",
  "authors": [
    {
      "name": "Martin Pielot",
      "institution": "OFFIS Institute for Information Technology, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-81385591697/rel-imgonly/cv_shirt.jpg",
      "acmid": "81385591697",
      "orcid": "missing"
    },
    {
      "name": "Oliver Krull",
      "institution": "University of Oldenburg, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460658487",
      "orcid": "missing"
    },
    {
      "name": "Susanne Boll",
      "institution": "University of Oldenburg, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398416",
      "orcid": "0000-0003-4293-1623"
    }
  ],
  "references": [
    {
      "text": "S. Brewster and L. M. Brown. Tactons: structured tactile messages for non-visual information display. In Proc. of the Australasian conference on user interface, 2004. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "A. Chan, K. MacLean, and J. McGrenere. Designing haptic icons to support collaborative turn-taking. Int. J. Human-Computer Studies, 66:333--355, 2008.  ",
      "doi": "10.1016/j.ijhcs.2007.11.002"
    },
    {
      "text": "R. W. Cholewiak, J. C. Brill, and A. Schwab. Vibrotactile localization on the abdomen: effects of place and space. Perception and Psychophysics., 66:970--987, 2004.",
      "doi": ""
    },
    {
      "text": "M. Duistermaat, L. R. Elliot, J. B. F. van Erp, and R. E. S. Human factor issues in complex system performance, chapter Tactile land navigation for dismounted soldiers, pages 43--53. Shaker publishing, Maastricht, The Netherlands, 2007.",
      "doi": ""
    },
    {
      "text": "F. T. Durso and A. R. Dattel. SPAM: The Real-Time Assessment of SA, chapter 8, pages 137--154. Ashgate Publishing Limited, 2004.",
      "doi": ""
    },
    {
      "text": "M. R. Endsley. Toward a theory of situation awareness in dynamic systems. Human Factor, 37(1):32--64, 1995.",
      "doi": ""
    },
    {
      "text": "M. R. Endsley. A comparative analysis of sagat and sart for evaluations of situation awareness. In 42nd Annual Meeting of the Human Factors & Ergonomics Society, Oktober 1998.",
      "doi": ""
    },
    {
      "text": "M. R. Endsley, B. Bolté, and D. G. Jones. Designing for situation awareness -- An approach to User-Centered Design. Taylor & Francis, 2003.",
      "doi": ""
    },
    {
      "text": "R. W. Lindeman, J. L. Sibert, E. Mendez-Mendez, S. Patil, and D. Phifer. Effectiveness of directional vibrotactile cuing on a building--clearing task. In CHI '05: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 271--280, New York, NY, USA, 2005. ACM.  ",
      "doi": "10.1145/1054972.1055010"
    },
    {
      "text": "T. L. McDaniel, S. Krishna, D. Colbry, and S. Panchanathan. Using tactile rhythm to convey interpersonal distances to individuals who are blind. In CHI EA '09: Proceedings of the 27th international conference extended abstracts on Human factors in computing systems, pages 4669--4674, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1520340.1520718"
    },
    {
      "text": "M. Pielot and S. Boll. Tactile Wayfinder: comparison of tactile waypoint navigation with commercial pedestrian navigation systems. In The Eighth International Conference on Pervasive Computing, Helsinki, Finland, 2010.  ",
      "doi": "10.1007/978-3-642-12654-3_5"
    },
    {
      "text": "M. Pielot, N. Henze, and S. Boll. Supporting map-based wayfinding with tactile cues. In MobileHCI '09: Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services, pages 1--10, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1613858.1613888"
    },
    {
      "text": "M. Pielot, N. Henze, and S. Boll. Sensing your social net at night. In Night and darkness: Interaction after dark. Workshop at the International Conference on Human Computer Interaction (CHI) 2008, April 5-10, 2008.",
      "doi": ""
    },
    {
      "text": "D. A. Ross and B. B. Blasch. Wearable interfaces for orientation and wayfinding. In Assets '00: Proceedings of the fourth international ACM conference on Assistive technologies, pages 193--200, New York, NY, USA, 2000. ACM.  ",
      "doi": "10.1145/354324.354380"
    },
    {
      "text": "A. Rupert. An instrumentation solution for reducing spatial disorientation mishaps. Engineering in Medicine and Biology Magazine, IEEE, 19(2):71--80, Mar/Apr 2000.",
      "doi": ""
    },
    {
      "text": "P. Salmon, N. Stanton, G. Walker, and D. Green. Situation awareness measurement: A review of applicability for c4i environments. In Applied Ergonomics, volume 37, pages 225--238, 2006.",
      "doi": ""
    },
    {
      "text": "N. J. J. M. Smets, G. M. te Brake, M. A. Neerincx, and J. Lindenberg. Effects of mobile map orientation and tactile feedback on navigation speed and situation awareness. In MobileHCI '08: Proceedings of the 10th international conference on Human computer interaction with mobile devices and services, pages 73--80, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1409240.1409249"
    },
    {
      "text": "J. B. F. Van Erp. Guidelines for the use of vibro-tactile displays in human computer interaction. In Proceedings of Eurohaptics 2002, 2002.",
      "doi": ""
    },
    {
      "text": "J. B. F. Van Erp. Presenting directions with a vibrotactile torso display. Ergonomics, 48:302--313, 2005.",
      "doi": ""
    },
    {
      "text": "J. B. F. Van Erp, E. L. Groen, and J. E. Bos. A tactile cockpit instrument supports the control of self-motion during spatial disorientation. Human Factors: The Journal of the Human Factors and Ergonomics Society, 48:219--228, 2006.",
      "doi": ""
    },
    {
      "text": "J. B. F. Van Erp, H. A. H. C. van Veen, C. Jansen, and T. Dobbins. Waypoint navigation with a vibrotactile waist belt. ACM Transactions on Applied Perception, 2(2):106--117, 2005.  ",
      "doi": "10.1145/1060581.1060585"
    },
    {
      "text": "H. A. H. C. Van Veen, M. Spapé, and J. B. F. Van Erp. Waypoint navigation on land: Different ways of coding distance to the next waypoint. In Proceedings of the 4th International Conference EuroHaptics 2004, 2004.",
      "doi": ""
    },
    {
      "text": "C. D. Wickens. Processing resources in attention. In Processing resource in attention. London: Academic, 1984.",
      "doi": ""
    }
  ]
}