{
  "doi": "10.1145/1753326.1753383",
  "title": "Who falls for phish?: a demographic analysis of phishing susceptibility and effectiveness of interventions",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "373-382",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we present the results of a roleplay survey instrument administered to 1001 online survey respondents to study both the relationship between demographics and phishing susceptibility and the effectiveness of several anti-phishing educational materials. Our results suggest that women are more susceptible than men to phishing and participants between the ages of 18 and 25 are more susceptible to phishing than other age groups. We explain these demographic factors through a mediation analysis. Educational materials reduced users' tendency to enter information into phishing webpages by 40% percent; however, some of the educational materials we tested also slightly decreased participants' tendency to click on legitimate links.",
  "authors": [
    {
      "name": "Steve Sheng",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335497366",
      "orcid": "missing"
    },
    {
      "name": "Mandy Holbrook",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489397",
      "orcid": "missing"
    },
    {
      "name": "Ponnurangam Kumaraguru",
      "institution": "Indraprastha Institute of Information Technology , New Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489236",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Julie Downs",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488083",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blais, A.-R. and Weber, E.U. A domain-specific risk-taking (DOSPERT) scale for adult populations. Judgment and Decision Making 1, 1 (2006), 33--47 KW",
      "doi": ""
    },
    {
      "text": "Dhamija, R., J.D. Tygar. and M. Hearst. 2006. Why phishing works. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada, April 22-27, 2006). R. Grinter, T. Rodden, P. Aoki, E. Cutrell, R. Jeffries, and G. Olson, Eds. CHI '06. ACM Press, New York, NY, 581--590.  ",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Downs, J., M. Holbrook and L. Cranor. 2006. Decision strategies and susceptibility to phishing. In Proceedings of the Second Symposium on Usable Privacy and Security (Pittsburgh, Pennsylvania, July 12-14, 2006). SOUPS '06, vol. 149. ACM Press, New York, NY, 79--90.  ",
      "doi": "10.1145/1143120.1143131"
    },
    {
      "text": "Downs, J.S., Holbrook, M., and Cranor, L.F. 2007. Behavioral response to phishing risk. In Proceedings of the Anti-Phishing Working Groups 2nd Annual Ecrime Researchers Summit (Pittsburgh, Pennsylvania, October 04-05, 2007). eCrime '07, vol. 269. ACM, New York, NY, 37--44.  ",
      "doi": "10.1145/1299015.1299019"
    },
    {
      "text": "Downs, J., M. Holbrook, S. Sheng and L. Cranor. 2009. Are Your Participants Gaming the System? Screening Mechanical Turk Workers. CHI 2010.  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Downs J.S. & Fischhoff B. (2009). Theories and models of adolescent decision making. In R.J. DiClemente, J.S. Santelli & R.A. Crosby (Eds.) Adolescent Health: Understanding and Preventing Risk Behaviors, San Francisco, CA: Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "eBay. Spoof Email Tutorial. Retrieved March 7, 2006, http://pages.ebay.com/education/spooftutorial/.",
      "doi": ""
    },
    {
      "text": "Evers, J. Security Expert: User education is pointless. Retrieved, Jan 13, 2007, http://news.com.com/2100-7350_3-6125213.html.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. An E-Card for You game. Retrieved Nov 7, 2006, http://www.ftc.gov/bcp/conline/ecards/phishing/index.html.",
      "doi": ""
    },
    {
      "text": "Ferguson, A.J. 2005. Fostering E-Mail Security Awareness: The West Point Carronade. EDUCASE Quarterly. 2005, 1. Retrieved March 22, 2006, http://www.educause.edu/ir/library/pdf/eqm0517.pdf.",
      "doi": ""
    },
    {
      "text": "Flynn J, Slovic, P, and Mertz, C.K 1994. Gender, Race, and Perception of Environmental Health Risks. Risk Analysis 14(6): 1101--1108.",
      "doi": ""
    },
    {
      "text": "Gartner Research. Gartner survey shows phishing attacks escalated in 2007. Press Release, 2007. http://www.gartner.com/it/page.jsp?id=565125",
      "doi": ""
    },
    {
      "text": "Gorling, S. 2006. The myth of user education. In Proceedings of the 16th Virus Bulletin International Conference.",
      "doi": ""
    },
    {
      "text": "Jagatic, T., N. Johnson, M. Jakobsson and F. Menczer. Social Phishing. Communications of the ACM. Retrieved March 7, 2006.  ",
      "doi": "10.1145/1290958.1290968"
    },
    {
      "text": "Jakobsson, M. The Human Factor in Phishing. http://www.informatics.indiana.edu/markus/papers/aci.pdf, 2006.",
      "doi": ""
    },
    {
      "text": "Kumaraguru, P., Sheng, S., Acquisti, A., Cranor, L.F., and Hong, J. 2007. Teaching Johnny not to fall for phish. Tech. rep., Carnegie Mellon University. http://www.cylab.cmu.edu/files/cmucylab07003.pdf.",
      "doi": ""
    },
    {
      "text": "Kumaraguru, P., Y. Rhee, A. Acquisti, L. Cranor, J. Hong and E. Nunge. 2007. Protecting People from Phishing: The Design and Evaluation of an Embedded Training Email System. In Proceedings of the 2007 Computer Human Interaction, CHI 2007.  ",
      "doi": "10.1145/1240624.1240760"
    },
    {
      "text": "Kumaraguru, P. Cranshaw, J., Acquisti, A., Cranor, L., Hong, J., Blair, M.A., and Pham, T. School of Phish: A Real-World Evaluation of Anti-Phishing Training. In the Proceedings On Usable Privacy and Security, 2009.  ",
      "doi": "10.1145/1572532.1572536"
    },
    {
      "text": "Mackinnon, D.P. and Dwyer, J.H. Estimating Mediated Effects in Prevention Studies. Eval Rev 17, 2 (1993), 144--158.",
      "doi": ""
    },
    {
      "text": "Mackinnon D.P, Fairchild, A.J and Fritz, M.S. Mediation analysis. Annual Review of Psychology 58, 1 (12 2006), 593--614.",
      "doi": ""
    },
    {
      "text": "MessageLabs. Messagelabs Intelligence May 2009. Report, May 2009. http://www.messagelabs.com/intelligence.aspx",
      "doi": ""
    },
    {
      "text": "Microsoft. Recognizing phishing scams and fraudulent emails. Retrieved Oct 15, 2006. http://www.microsoft.com/athome/security/email/phishing.mspx.",
      "doi": ""
    },
    {
      "text": "National Consumer League, Internet fraud tips: phishing. {url} http://www.fraud.org/tips/internet/phishing.htm . Retrieved Jan 1, 2009.",
      "doi": ""
    },
    {
      "text": "New York State Office of Cyber Security & Critical Infrastructure Coordination. Gone Phishing. A Briefing on the Anti-Phishing Exercise Initiative for New York State Government. Aggregate Exercise Results for public release. 2005",
      "doi": ""
    },
    {
      "text": "OnGuardOnline, How Not To Get Hooked by a \"Phishing\" Scam. {url}: http://www.onguardonline.gov/topics/phishing.aspx. Retrieved Jan 1, 2009.",
      "doi": ""
    },
    {
      "text": "Preacher K.J and Hayers A.F. Asymptotic and resampling strategies for assessing and comparing indirect effects in multiple mediator models. Behavior research methods 40, 3 (Aug 2008), 879--91.",
      "doi": ""
    },
    {
      "text": "Reyna VF & Farley F. (2006). Risk and rationality in adolescent decision making: Implications for theory, practice, and public policy. Psychological Science in the Public Interest, 7, 1--44.",
      "doi": ""
    },
    {
      "text": "Schechter, S.E., Dhamija, R., Ozment, A., Fischer, I., 2007 The Emperor's New Security Indicators. IEEE Symposium on Security and Privacy, 20-23 May 2007.  ",
      "doi": "10.1109/SP.2007.35"
    },
    {
      "text": "Sheng, S., Magnien, B., Kumaraguru, P., Acquisti, A., Cranor, L.F., Hong, J., and Nunge, E. 2007. Anti-Phishing Phil: the design and evaluation of a game that teaches people not to fall for phish. In Proceedings of the 3rd Symposium on Usable Privacy and Security (Pittsburgh, Pennsylvania, July 18-20, 2007). SOUPS '07, vol. 229. ACM, New York, NY, 88--99.  ",
      "doi": "10.1145/1280680.1280692"
    },
    {
      "text": "Slovic, P 2000. The Perception of Risk, Sterling, VA: Earthscan Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Wu, M., Miller, R.C., and Garfinkel, S.L. 2006. Do security toolbars actually prevent phishing attacks?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada, April 22-27, 2006). R. Grinter, T. Rodden, P. Aoki, E. Cutrell, R. Jeffries, and G. Olson, Eds. CHI '06. ACM Press, New York, NY, 601--610.  ",
      "doi": "10.1145/1124772.1124863"
    }
  ]
}