{
  "doi": "10.1145/1753326.1753393",
  "title": "i*CATch: a scalable plug-n-play wearable computing framework for novices and children",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "443-452",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "There has been much recent work in wearable computing that is directed at democratization of the field, to make it more accessible to the general public and more easily used by the hobbyist user. As the field becomes more diversified, there has also been a shift away from the highly specialized functionality of earlier applications towards aesthetics, creativity, design and self-expression, as well as a push towards using wearable computing as an outreach tool to broaden interest and exposure in engineering and computing. This paper presents the design and development of the i*CATch wearable computing framework, which was developed specifically for children and novices to the field. The i*CATch framework is based upon a bus-based architecture, and is more scalable than the current alternatives. It consists of a set of plug-and-play components, a construction platform with a standardized interface, and an easy-to-use hybrid text-graphical integrated development environment. We will also present results of the evaluation of the i*CATch framework in real teaching environments.",
  "tags": [
    "smart textiles",
    "wearable computing",
    "electronic textiles",
    "computational textiles",
    "i*catch",
    "construction kits",
    "e-textiles"
  ],
  "authors": [
    {
      "name": "Grace Ngai",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/do/10.1145/contrib-81100430876/rel-imgonly/grace.jpg",
      "acmid": "81100430876",
      "orcid": "missing"
    },
    {
      "name": "Stephen C.F. Chan",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100177282",
      "orcid": "missing"
    },
    {
      "name": "Vincent T.Y. Ng",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81541176456",
      "orcid": "missing"
    },
    {
      "name": "Joey C.Y. Cheung",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414612977",
      "orcid": "missing"
    },
    {
      "name": "Sam S.S. Choy",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654415",
      "orcid": "missing"
    },
    {
      "name": "Winnie W.Y. Lau",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414607133",
      "orcid": "missing"
    },
    {
      "name": "Jason T.P. Tse",
      "institution": "Hong Kong Polytechnic University, Kowloon, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440613296",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arduino. Available: www.arduino.cc.",
      "doi": ""
    },
    {
      "text": "Berzowska, J. Electronic textiles: Wearable computers, reactive fashion, and soft computation. Textile, 3(1):2--19, 2005.",
      "doi": ""
    },
    {
      "text": "Buechley, L. Lilypad Arduino | build something. http:// web.media.mit.edu/~leah/LilyPad/build.html",
      "doi": ""
    },
    {
      "text": "Buechley, L., and Eisenberg, M. Fabric PCBs, electronic sequins, and socket buttons: Techniques for e-textile craft. Journal of Personal and Ubiquitous Computing (2007).  ",
      "doi": "10.1007/s00779-007-0181-0"
    },
    {
      "text": "Buechley, L., Eisenberg, M., Catchen, J., and Crockett, A. 2008. The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In Procs. of CHI'08 (Florence, Italy, April 05-10, 2008), 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Cheung, J.C., Ngai, G., Chan, S.C., and Lau, W.W. 2009. Filling the gap in programming instruction: a text-enhanced graphical programming environment for junior high students. SIGCSE Bull. 41, 1 (Mar. 2009), 276--280.  ",
      "doi": "10.1145/1539024.1508968"
    },
    {
      "text": "Eduwear project. http://dimeb.informatik.uni-bremen.de/ eduwear/.",
      "doi": ""
    },
    {
      "text": "Eleksen, \"Belkin Selects ElekTex to Power New-to the-Market SportCommand Product,\" Sep. 19, 2006, retrieved fromthe internet athttp://www.eleksen.com/?page#news/index.asp&newsID#61, on Dec. 11, 2006, pp. 1--2.",
      "doi": ""
    },
    {
      "text": "Gorlick, M.M. Electric suspenders: A fabric power bus and data network for wearable digital devices. In ISWC '99: Proceedings of the 3rd IEEE International Symposium on Wearable Computers (Washington, DC, USA, 1999), IEEE Computer Society, 114. ",
      "doi": "10.5555/519309.856482"
    },
    {
      "text": "I2C, A networking solution for integrated circuits, http://www-us2.semiconductors.philips.com/i2c/I2C",
      "doi": ""
    },
    {
      "text": "Junker, H., Lukowicz, P., Tröster, G., \"PadNET: Wearable Physical Activity Detection Network,\" iswc, pp.244, 7th IEEE International Symposium on Wearable Computers (ISWC'03), 2003 ",
      "doi": "10.5555/946249.946882"
    },
    {
      "text": "Lau, W.W.Y., Ngai, G., Chan, S.C.F., and Cheung, J.C.Y. Learning programming through fashion and design: A pilot summer course in wearable computing for middle school students. In Proc. of SIGCSE '09 (Chattanooga, TN, Mar 2009).  ",
      "doi": "10.1145/1508865.1509041"
    },
    {
      "text": "Lehn, D., Neely, C., Schoonover, K., Martin, T., and Jones, M. e-tags: e-textile attached gadgets. In Communication Networks and Distributed Systems Modeling and Simulation Conference (January 2004).",
      "doi": ""
    },
    {
      "text": "Myers, B., Hudson, S.E., and Pausch, R. 2000. Past, present, and future of user interface software tools. ACM Trans. Comput.-Hum. Interact. 7,1 (Mar. 2000), 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Nanda, G., Cable, A., Bove, V.M., Ho, M., and Hoang, H. 2004. bYOB {Build Your Own Bag}: a computationally-enhanced modular textile system. In Procs of the 3rd Int'l Conf on Mobile and Ubiquitous Multimedia (College Park, MD, Oct 27-29, 2004). MUM '04, vol. 83. ACM, New York, NY, 1--4.  ",
      "doi": "10.1145/1052380.1052381"
    },
    {
      "text": "Ngai, G., Chan, S.C., Cheung, J.C., and Lau, W.W. 2009. The TeeBoard: an education-friendly construction platform for e-textiles and wearable computing. In Procs of CHI'09. (Boston, MA, USA, April 04-09, 2009). 249--258.  ",
      "doi": "10.1145/1518701.1518742"
    },
    {
      "text": "Orth, M., Post, R. and Cooper, E.. Fabric computing interfaces, SIGCHI: ACM Special Interest Group on Computer-Human Interactionÿ61998  ",
      "doi": "10.1145/286498.286800"
    },
    {
      "text": "Portsmore, M., ROBOLAB: Intuitive Robotic Programming Software to Support Life Long Learning, APPLE Learning Technology Review, Spring/Summer 1999",
      "doi": ""
    },
    {
      "text": "Post, E., Orth, M., Russo, P., and Gershenfeld, N. Ebroidery: Design and fabrication of textile-based computing. IBM Systems Journal 39, 3-4 (2000), 840--860.  ",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Park, S., K. Mackenzie and S. Jayaraman. The wearable motherboard: ÿ6 aframework for personalized mobile information processing (PMIP) 2002",
      "doi": ""
    }
  ]
}