{
  "doi": "10.1145/1753326.1753453",
  "title": "The influence of implicit and explicit biofeedback in first-person shooter games",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "859-868",
  "year": 2010,
  "badges": [],
  "abstract": "To understand how implicit and explicit biofeedback work in games, we developed a first-person shooter (FPS) game to experiment with different biofeedback techniques. While this area has seen plenty of discussion, there is little rigorous experimentation addressing how biofeedback can enhance human-computer interaction. In our two-part study, (N=36) subjects first played eight different game stages with two implicit biofeedback conditions, with two simulation-based comparison and repetition rounds, then repeated the two biofeedback stages when given explicit information on the biofeedback. The biofeedback conditions were respiration and skin-conductance (EDA) adaptations. Adaptation targets were four balanced player avatar attributes. We collected data with psycho¬physiological measures (electromyography, respiration, and EDA), a game experience questionnaire, and game-play measures. According to our experiment, implicit biofeedback does not produce significant effects in player experience in an FPS game. In the explicit biofeedback conditions, players were more immersed and positively affected, and they were able to manipulate the game play with the biosignal interface. We recommend exploring the possibilities of using explicit biofeedback interaction in commercial games.",
  "tags": [
    "biosignals",
    "games",
    "playing",
    "implicit biofeedback",
    "biofeedback",
    "explicit biofeedback",
    "affective computing"
  ],
  "authors": [
    {
      "name": "Kai Kuikkaniemi",
      "institution": "Helsinki Institute for Information Technology, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320492225",
      "orcid": "missing"
    },
    {
      "name": "Toni Laitinen",
      "institution": "Helsinki Institute for Information Technology, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489329",
      "orcid": "missing"
    },
    {
      "name": "Marko Turpeinen",
      "institution": "Helsinki Institute for Information Technology, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100262325",
      "orcid": "missing"
    },
    {
      "name": "Timo Saari",
      "institution": "Helsinki Institute for Information Technology, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607481",
      "orcid": "missing"
    },
    {
      "name": "Ilkka Kosunen",
      "institution": "Helsinki Institute for Information Technology, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442613328",
      "orcid": "missing"
    },
    {
      "name": "Niklas Ravaja",
      "institution": "Center for Knowledge and Innovation Research, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100105021",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bersak, D., McDarby, G., Augenblick, N., McDarby, P., McDonnell, D., McDonald, B., and Karkun, R. (2001). Intelligent Biofeedback Using an Immersive Competitive Environment. Designing Ubiquitous Computing Games Workshop at UbiComp 2001, Atlanta, Georgia, USA.",
      "doi": ""
    },
    {
      "text": "Björk, S. and Holopainen, J. (2004). Patterns in Game Design. Hingham, Mass., USA: Charles River Media. 423 p. ISBN: 9781584503545.",
      "doi": ""
    },
    {
      "text": "Dekker, A. and Champion, E. (2007). Please Biofeed the Zombies: Enhancing the Gameplay and Display of a Horror Game Using Biofeedback. In: Proceedings of DiGRA 2007: Situated Play, September 24-28, 2007, Tokyo, Japan.",
      "doi": ""
    },
    {
      "text": "Fairclough, S.H. (2007). Psychophysiological Inference and Physiological Computer Games. Brainplay '07: Brain-Computer Interfaces and Games. Advances in Computer Entertainment, Salzburg, Austria.",
      "doi": ""
    },
    {
      "text": "Freeman, D. (2004). Creating Emotion in Games: The Craft and Art of Emotioneering. USA: New Riders. 539 p. ISBN: 1-5927-3007-8. ",
      "doi": "10.5555/861425"
    },
    {
      "text": "Gilleade, K.M., Dix, A., and Allanson, J. (2005). Affective Videogames and Modes of Affective Gaming: Assist Me, Challenge Me, Emote Me. Proceedings of DiGRA 2005: Changing Views -- Worlds in Play, June 16-20, 2005, Vancouver, Canada.",
      "doi": ""
    },
    {
      "text": "Grodal, T. (2000). Video Games and the Pleasures of Control. In: D. Zillmann and P. Vorderer (eds.), Media Entertainment: The Psychology of Its Appeal (pp. 197--212). Mahwah, New Jersey, USA: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Hefner, D., Klimmt, C., and Vorderer, P. (2007). Identification with the Player Character As Determinant of Video Game Enjoyment. In: L. Ma, R. Nakatsu, & M. Rauterberg (eds.), International Conference on Entertainment Computing 2007 (Lecture Notes in Computer Science 4740, pp. 39--48). Berlin: Springer. ",
      "doi": "10.5555/2394259.2394267"
    },
    {
      "text": "Kim, J. and André, E. (2008). Four-Channel Biosignal Analysis and Feature Extraction for Automatic Emotion Recognition. In: Proceedings of BIOSTEC 2008, A. Fred, J. Filipe, & H. Gamboa (eds.). CCIS 25, pp. 265--277, Berlin: Springer-Verlag.",
      "doi": ""
    },
    {
      "text": "Lang, P.J. (1995). The Emotion Probe. Studies of Motivation and Attention. American Psychologist, 50, 372--385.",
      "doi": ""
    },
    {
      "text": "Lindley, C. and Sennersten, C. (2008). Game Play Schemas: From Player Analysis to Adaptive Game Mechanics. International Journal of Computer Games Technology, 2008, Article ID 216784.  ",
      "doi": "10.1155/2008/216784"
    },
    {
      "text": "Picard, R.W., Vyzas, E., and Healey, J. (2001). Toward Machine Emotional Intelligence: Analysis of Affective Physiological State. IEEE Transactions on Pattern Analysis and Machine Intelligence, 23, 10, 1175--1191. ISSN: 0162-8828.  ",
      "doi": "10.1109/34.954607"
    },
    {
      "text": "Ravaja, N., Saari, T., Laarni, J., Kallinen, K., Salminen, M., Holopainen, J., and Järvinen, A. (2005). The Psychophysiology of Video Gaming: Phasic Emotional Responses to Game Events. In: Proceedings of DiGRA 2005 Conference: Changing Views -- Worlds in Play, Vancouver, Canada. June 16-20, 2005, pp. 1--13.",
      "doi": ""
    },
    {
      "text": "Scherer, K.R. (1993). Neuroscience Projections to Current Debates in Emotion Psychology. Cognition and Emotion, 7, 1--41.",
      "doi": ""
    },
    {
      "text": "Tijs, T.J., Brokken, D., and Ijsselsteijn, W.A. (2008). Dynamic Game Balancing by Recognizing Affect. Fun and Games 2008 Conference. Eindhoven, Netherlands. October 20--21, 2008, pp. 88--93.  ",
      "doi": "10.1007/978-3-540-88322-7_9"
    },
    {
      "text": "Vorderer, P., Hartmann, T., and Klimmt, C. (2003). Explaining the Enjoyment of Playing Video Games: The Role of Competition. In: D. Marinelli (ed.), Proceedings of the 2nd International Conference on Entertainment Computing (ICEC 2003) (pp. 1--8). Pittsburgh, Penn., & New York, New York, USA: ACM ",
      "doi": "10.5555/958720.958735"
    }
  ]
}