{
  "doi": "10.1145/1753326.1753329",
  "title": "Predicting the cost of error correction in character-based text entry technologies",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "5-14",
  "year": 2010,
  "badges": [],
  "abstract": "Researchers have developed many models to predict and understand human performance in text entry. Most of the models are specific to a technology or fail to account for human factors and variations in system parameters, and the relationship between them. Moreover, the process of fixing errors and its effects on text entry performance has not been studied. Here, we first analyze real-life text entry error correction behaviors. We then use our findings to develop a new model to predict the cost of error correction for character-based text entry technologies. We validate our model against quantities derived from the literature, as well as with a user study. Our study shows that the predicted and observed cost of error correction correspond well. At the end, we discuss potential applications of our new model.",
  "tags": [
    "text entry",
    "prediction",
    "performance metric",
    "mobile phone",
    "hand-held devices",
    "error rate",
    "error correction",
    "cognitive model"
  ],
  "authors": [
    {
      "name": "Ahmed Sabbir Arif",
      "institution": "York University, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81460652875/rel-imgonly/1632569177136_sq_col_sm.jpg",
      "acmid": "81460652875",
      "orcid": "0000-0002-8384-4764"
    },
    {
      "name": "Wolfgang Stuerzlinger",
      "institution": "York University, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100214718",
      "orcid": "0000-0002-7110-5024"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R., Bothell, D. and Byrne, M.D. An integrated theory of the mind. American Psychological Association: Psychological Review 4, 111 (2004), 1036--1060.",
      "doi": ""
    },
    {
      "text": "Arif, A.S. and Stuerzlinger, W. Analysis of Text Entry Performance Metrics. In Proc. IEEE TIC-STH 2009. IEEE New York (2009), 100--105.",
      "doi": ""
    },
    {
      "text": "Beard, D.V., Smith, D.K., and Denelsbeck, K.M. Quick and dirty GOMS: A case study of computed tomography interpretation. Human-Computer Interaction 11, 2 (1996), 157--180.  ",
      "doi": "10.1207/s15327051hci1102_3"
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The keystroke-level model for user performance time with interactive systems. Communications of the ACM 23, 7 (1980), 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card, S.K., Moran, T.P. and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Dunlop, M.D. and Crossan, A. Predictive text entry methods for mobile phones. Personal and Ubiquitous Computing 4, 2-3 (2000), 134--143.",
      "doi": ""
    },
    {
      "text": "Gray, W.D., John, B.E. and Atwood, M.E. The precis of Project Ernestine or an overview of a validation of GOMS. In Proc. CHI 1992. ACM Press (1992), 307--312.  ",
      "doi": "10.1145/142750.142821"
    },
    {
      "text": "Grudin, J.T. Error patterns in skilled and novice transcription typing. In Cooper, W.E. ed. Cognitive Aspects of Skilled Typewriting, Springer-Verlag, New York, NY, 1984, 121--143.",
      "doi": ""
    },
    {
      "text": "Holleis, P., Otto, F., Hussmann, H., and Schmidt, A. Keystroke-level model for advanced mobile phone interaction. In Proc. CHI 2007. ACM Press (2007), 1505--1514.  ",
      "doi": "10.1145/1240624.1240851"
    },
    {
      "text": "How, Y. and Kan, M.Y. Optimizing predictive text entry for short message service on mobile phones. In Proc. HCII 2005, Lawrence Erlbaum Associates (2005).",
      "doi": ""
    },
    {
      "text": "Hudson, S.E., John, B.E., Knudsen, K., and Byrne, M.D. A tool for creating predictive performance models from user interface demonstrations. In Proc. UIST 1999. ACM Press (1999), 93--102.  ",
      "doi": "10.1145/320719.322590"
    },
    {
      "text": "John, B.E., Prevas, K., Salvucci, D.D., and Koedinger, K. 2004. Predictive human performance modeling made easy. In Proc. CHI 2004. ACM Press (2004), 455--462.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "Kieras, D.E. Towards a practical GOMS model methodology for user interface design. Martin Helander: Handbook of Human-Computer Interaction, Elsevier Science Publishers, Amsterdam, Netherlands, 1988.",
      "doi": ""
    },
    {
      "text": "Kieras, D.E. Using the keystroke-level model to estimate execution times. Technical Report, University of Michigan (1993).",
      "doi": ""
    },
    {
      "text": "Lee, S. and Zhai, S. The performance of touch screen soft buttons. In Proc. CHI 2009, ACM Press (2009), 309--318.  ",
      "doi": "10.1145/1518701.1518750"
    },
    {
      "text": "MacKenzie, I.S. KSPC (keystrokes per character) as a characteristic of text entry techniques. In Proc. HCI for Mobile Devices 2002, Springer-Verlag (2002), 195--210. ",
      "doi": "10.5555/645739.666587"
    },
    {
      "text": "MacKenzie, I.S. and Soukoreff, R.W. Phrase sets for evaluating text entry techniques. In Proc. CHI Extended Abstracts 2003, ACM Press (2003), 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "MacKenzie, I.S. and Zhang, S.X. An empirical investigation of the novice experience with soft keyboards. Behaviour & Information Technology, 20 (2001), 411--418.",
      "doi": ""
    },
    {
      "text": "Pavlovych, A. and Stuerzlinger, W. Model for non-expert text entry speed on 12--button phone keypads. In Proc. CHI 2004, ACM Press (2004), 351--358.  ",
      "doi": "10.1145/985692.985737"
    },
    {
      "text": "Robertson, P.S. and Black, J.B. Structure and development of plans in computer text editing. Human-Computer Interaction 2, 3 (1986), 201--226.  ",
      "doi": "10.1207/s15327051hci0203_2"
    },
    {
      "text": "Seow, S.C. Information theoretic models of HCI: A comparison of the Hick-Hyman Law and Fitts' Law, Human-Computer Interaction 20, 3 (2005), 315--352.  ",
      "doi": "10.1207/s15327051hci2003_3"
    },
    {
      "text": "Silfverberg, M. Historical overview of consumer text entry technologies. In MacKenzie, I.S. and Tanaka-Ishii, K. eds. Text Entry Systems: Mobility, Accessibility, Universality. Morgan Kaufmann, San Francisco, CA, 2007, 3--25.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. Theoretical upper and lower bounds on typing speed using a stylus and soft keyboard. Behaviour & Information Technology, 14 (1995), 370--379.",
      "doi": ""
    },
    {
      "text": "Suhm, B. Empirical evaluation of interactive multimodal error correction. In Proc. IEEE ASRU 1997, IEEE Signal Processing Society (1997), 583--590.",
      "doi": ""
    },
    {
      "text": "Williams, K.E. Automating the cognitive task modeling process: An extension to GOMS for HCI. In Proc. HCII Poster Sessions, Abridged Proceedings (1993), 182.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O. Measures of text entry performance. In MacKenzie, I.S. and Tanaka-Ishii, K. eds. Text Entry Systems: Mobility, Accessibility, Universality. Morgan Kaufmann, San Francisco, CA, 2007, 47--74.",
      "doi": ""
    }
  ]
}