{
  "doi": "10.1145/1753326.1753499",
  "title": "iCon: utilizing everyday objects as additional, auxiliary and instant tabletop controllers",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1155-1164",
  "year": 2010,
  "badges": [],
  "abstract": "This work describes a novel approach to utilizing everyday objects of users as additional, auxiliary, and instant tabletop controllers. Based on this approach, a prototype platform, called iCon, is developed to explore the possible design. Field studies and user studies reveal that utilizing everyday objects such as auxiliary input devices might be appropriate under a multi-task scenario. User studies further demonstrate that daily objects can generally be applied in low precision circumstances, low engagement with selected objects, and medium-to-high frequency of use. The proposed approach allows users to interact with computers while not altering their original work environments.",
  "authors": [
    {
      "name": "Kai-Yin Cheng",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416600159",
      "orcid": "missing"
    },
    {
      "name": "Rong-Hao Liang",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321494894",
      "orcid": "0000-0003-3239-8749"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    },
    {
      "name": "Rung-Huei Laing",
      "institution": "National Taiwan University of Science and Technology, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460645261",
      "orcid": "missing"
    },
    {
      "name": "Sy-Yen Kuo",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387592082",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Microsft Surface. http://www.microsoft.com/surface/.",
      "doi": ""
    },
    {
      "text": "A. Carvey, J. Gouldstone, P. Vedurumudi, A. Whiton, and H. Ishii. Rubber shark as user interface. In ACM CHI 2006 Extended Abstracts, pages 634--639, 2006.  ",
      "doi": "10.1145/1125451.1125582"
    },
    {
      "text": "K.-Y. Cheng, R.-H. Liang, H.-J. Lin, B.-Y. Chen, R.-H. Liang, M.-Y. Yu, H.-H. Chu, Y.-M. Chu, and S.-Y. Kuo. MemoIcon: using everyday objects as physical icons. In ACM SIGGRAPH Asia 2009 Emerging Technologies, pages 78--78, 2009.  ",
      "doi": "10.1145/1665137.1665197"
    },
    {
      "text": "G.W. Fitzmaurice, H. Ishii, and W.A.S. Buxton. Bricks: laying the foundations for graspable user interfaces. In ACM CHI 1995 Conference Proceedings, pages 442--449, 1995.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "T. Grossman, P. Dragicevic, and R. Balakrishnan. Strategies for accelerating on-line learning of hotkeys. In ACM CHI 2007 Conference Proceedings, pages 1591--1600, 2007.  ",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "J. Y. Han. Low-cost multi-touch sensing through frustrated total internal reflection. In Proceedings of 2005 ACM Symposium on User Interface Software and Technology, pages 115--118, 2005.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "S.J. Henderson and S. Feiner. Opportunistic controls: leveraging natural affordances as tangible user interfaces for augmented reality. In Proceedings of 2008 ACM Symposium on Virtual Reality Software and Technology, pages 211--218, 2008.  ",
      "doi": "10.1145/1450579.1450625"
    },
    {
      "text": "S.T. Iqbal and E. Horvitz. Disruption and recovery of computing tasks: field study, analysis, and directions. In ACM CHI 2007 Conference Proceedings, pages 677--686, 2007.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "H. Ishii. The tangible user interface and its evolution. Communications of the ACM, 51(6):32--36, 2008.  ",
      "doi": "10.1145/1349026.1349034"
    },
    {
      "text": "H. Ishii and B. Ullmer. Tangible bits: towards seamless interfaces between people, bits and atoms. In ACM CHI 1997 Conference Proceedings, pages 234--241, 1997.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "R.J. Jacob, A. Girouard, L.M. Hirshfield, M.S. Horn, O. Shaer, E.T. Solovey, and J. Zigelbaum. Reality-based interaction: a framework for post-WIMP interfaces. In ACM CHI 2008 Conference Proceeding, pages 201--210, 2008.  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "M. Kaltenbrunner and R. Bencina. reactivision: a computer-vision framework for table-based tangible interaction. In Proceedings of 2007 International Conference on Tangible and Embedded Interaction, pages 69--74, 2007.  ",
      "doi": "10.1145/1226969.1226983"
    },
    {
      "text": "D. Kirsh. The intelligent use of space. Artificial Intelligence, 73(1-2):31--68, 1995.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "P. Ljungstrand, J. Redström, and L.E. Holmquist. WebStickers: using physical tokens to access, manage and share bookmarks to the web. In Proceedings of DARE 2000 on Designing Augmented Reality Environments, pages 23--31, 2000.  ",
      "doi": "10.1145/354666.354669"
    },
    {
      "text": "T.W. Malone. How do people organize their desks?: Implications for the design of office information systems. ACM Transactions on Office Information Systems, 1(1):99--112, 1983.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "P. Mistry, T. Kuroki, and C. Chang. TaPuMa: tangible public map for information acquirement through the things we carry. In Proceedings of 2008 International Conference on Ambient Media and Systems, pages 1--5, 2008. ",
      "doi": "10.5555/1363163.1363175"
    },
    {
      "text": "D.A. Norman. Things that make us smart: defending human attributes in the age of the machine. 1993. ",
      "doi": "10.5555/200550"
    },
    {
      "text": "Q. Pan, G. Reitmayr, and T. Drummond. Interactive model reconstruction with user guidance. In Proceedings of 2009 IEEE International Symposium on Mixed and Augmented Reality, pages 209--210, 2009.  ",
      "doi": "10.1109/ISMAR.2009.5336460"
    },
    {
      "text": "J. Patten and H. Ishii. A comparison of spatial organization strategies in graphical and tangible user interfaces. In Proceedings of DARE 2000 on Designing Augmented Reality Environments, pages 41--50, 2000.  ",
      "doi": "10.1145/354666.354671"
    },
    {
      "text": "I. Rosenberg and K. Perlin. The UnMousePad: an interpolating multi-touch force-sensing input pad. page Article No. 65, 2009. (SIGGRAPH 2009 Conference Proceedings).  ",
      "doi": "10.1145/1576246.1531371"
    },
    {
      "text": "I. Siio. InfoBinder: A pointing device for a virtual desktop system. In HCI International 1995 Conference Proceedings, volume 2, pages 261--264, 1995.",
      "doi": ""
    },
    {
      "text": "N. Streitz, T. Prante, C. Müller-Tomfelde, P. Tandler, and C. Magerkurth. Roomware: the second generation. In ACM CHI 2002 Extended Abstracts, pages 506--507, 2002.  ",
      "doi": "10.1145/506443.506452"
    },
    {
      "text": "B. Ullmer and H. Ishii. The metaDESK: models and prototypes for tangible user interfaces. In Proceedings of 1997 ACM Symposium on User Interface Software and Technology, pages 223--232, 1997.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "A. van Dam. Post-WIMP user interfaces. Communications of the ACM, 40(2):63--67, 1997.  ",
      "doi": "10.1145/253671.253708"
    },
    {
      "text": "M. Weiss, J. Wagner, Y. Jansen, R. Jennings, R. Khoshabeh, J.D. Hollan, and J. Borchers. SLAP widgets: bridging the gap between virtual and physical controls on tabletops. In ACM CHI 2009 Conference Proceedings, pages 481--490, 2009.  ",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "S. White, D. Feng, and S. Feiner. Interaction and presentation techniques for shake menus in tangible augmented reality. In Proceedings of 2009 IEEE International Symposium on Mixed and Augmented Reality, pages 39--48, 2009.  ",
      "doi": "10.1109/ISMAR.2009.5336500"
    },
    {
      "text": "S. White, L. Lister, and S. Feiner. Visual hints for tangible gestures in augmented reality. In Proceedings of 2007 IEEE International Symposium on Mixed and Augmented Reality, pages 1--4, 2007.  ",
      "doi": "10.1109/ISMAR.2007.4538824"
    },
    {
      "text": "J.O. Wobbrock, M.R. Morris, and A.D. Wilson. User-defined gestures for surface computing. In ACM CHI 2009 Conference Proceedings, pages 1083--1092, 2009.  ",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}