{
  "doi": "10.1145/1753326.1753376",
  "title": "Why users of yahoo!: answers do not answer questions",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "329-332",
  "year": 2010,
  "badges": [],
  "abstract": "Posing a question to an online question and answer community does not guarantee a response. Significant prior work has explored and identified members' motivations for contributing to communities of collective action (e.g., Yahoo! Answers); in contrast it is not well understood why members choose to not answer a question they have already read. To explore this issue, we surveyed 135 active members of Yahoo! Answers. We show that top and regular contributors experience the same reasons to not answer a question: subject nature and composition of the question; perception of how the questioner will receive, interpret and react to their response; and a belief that their response will lose its meaning and get lost in the crowd if too many responses have already been given. Informed by our results, we discuss opportunities to improve the efficacy of the question and answer process, and to encourage greater contributions through improved design.",
  "tags": [
    "motivation",
    "q&a",
    "question and answer",
    "community"
  ],
  "authors": [
    {
      "name": "David Dearman",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100428285/rel-imgonly/headshot-nokia.jpg",
      "acmid": "81100428285",
      "orcid": "missing"
    },
    {
      "name": "Khai N. Truong",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "Adamic, L.A., Zhang, J., Bakshy, E., and Ackerman, M.S. Knowledge sharing and yahoo answers: everyone knows something. In Proc. WWW 2008, ACM Press (2008), 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Beyer, H. and Holtzblatt, K., Contextual Design: Defining Customer-Centered Systems. 1998, San Francisco, CA, USA: Morgan Kaufmann Publishers Inc. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Engelbart, D.C., Augmenting human intellect: A conceptual framework. Standfod Research Institute Summary Report on Contract AF 49(638)--1024, 1962.",
      "doi": ""
    },
    {
      "text": "Forte, A. and Bruckman, A. Why do people write for wikipedia? Incentives to contribute to open-content publishing. In Proc. GROUP 2005 workshop: Sustaining community: The role and design of incentive mechanisms, ACM Press (2005).",
      "doi": ""
    },
    {
      "text": "Glaser, B.G., Basics of Grounded Theory Analysis: Emergence Vs. Forcing. 1992, Mill Valley, CA, USA.",
      "doi": ""
    },
    {
      "text": "Harper, F.M., Raban, D., Rafaeli, S., and Konstan, J.A. Predictors of answer quality in online Q&A sites. In Proc. CHI 2008, ACM Press (2008), 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Janes, J., Hill, C., and Rolfe, A., Ask-an-expert service analysis. Journal of American Society for Information Science and Technology 52, 13 (2001) , 1106--1121.  ",
      "doi": "10.1002/asi.1177"
    },
    {
      "text": "Kollock, P., The economies of online cooperation: Gifts and public goods in cyberspace, in Communities in Cyberspace, M. Smith and P. Kollock (1999), Routledge. London, 220--239. ",
      "doi": "10.5555/552599"
    },
    {
      "text": "Leibenluft, J., A librarian's worst nightmare: Yahoo! Answers, where 120 million users can be wrong, Slate Magazine 2007.",
      "doi": ""
    },
    {
      "text": "McMillan, D.W. and Chavis, D.M., Sense of community: A definition and theory. Journal of Community Psychology 14, 1 (1986), 6--23.",
      "doi": ""
    },
    {
      "text": "Moore, T.D. and Serva, M.A. Understanding member motivation for contributing to different types of virtual communities: A proposed framework. In Proc. SIGMIS-CPR 2007, ACM Press (2007), 153--158.  ",
      "doi": "10.1145/1235000.1235035"
    },
    {
      "text": "Rafaeli, S., Raban, D.R., and Ravid, G., How social motivations enhances economic activity and incentives in the Google answers knowledge sharing market. International Journal of Knowledge and Learning 3, 1 (2007), 1--11.",
      "doi": ""
    },
    {
      "text": "Su, Q., Pavlov, D., Chow, J.-H., and Baker, W.C. Internet-scale collection of human-reviewed data. In Proc. WWW 2007, ACM Press (2007), 231--240.  ",
      "doi": "10.1145/1242572.1242604"
    },
    {
      "text": "Wasko, M.M. and Faraj, S., \"It is what on does\": why people participate and help others in electronic communties of practice. Journal of Strategic Information Systems 9 (2000), 155--173.",
      "doi": ""
    },
    {
      "text": "Yahoo, Yahoo! Answers, http://answers.yahoo.com.",
      "doi": ""
    }
  ]
}