{
  "doi": "10.1145/1753326.1753546",
  "title": "Trying too hard: effects of mobile agents' (Inappropriate) social expressiveness on trust, affect and compliance",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1471-1474",
  "year": 2010,
  "badges": [],
  "abstract": "Mobile services can provide users with information relevant to their current circumstances. Distant services in turn can acquire local information from people in an area of interest. Socially expressive agent behaviour has been suggested as a way to build reciprocal relationships and to increase user response to such requests. This between-subject, Wizard-of-Oz experiment aimed to investigate the potential of such behaviours. 44 participants performed a search task in an urgent context while being interrupted by a mobile agent that both provided and requested information. The socially expressive behaviour shown in this study did not increase compliance to requests; it instead reduced trust in provided information and compliance to warnings. It also negatively impacted the affective experience of users scoring lower on empathy as a personality trait. Inappropriate social expressiveness can have serious consequences; we here elaborate on the reasons for our negative results.",
  "tags": [
    "autonomy",
    "social expressiveness",
    "mobile interaction",
    "trust"
  ],
  "authors": [
    {
      "name": "Henriette Cramer",
      "institution": "University of Amsterdam, Mobile Life Centre, SICS, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487965",
      "orcid": "missing"
    },
    {
      "name": "Vanessa Evers",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/do/10.1145/contrib-81100133286/rel-imgonly/vanessa-1.jpg",
      "acmid": "81100133286",
      "orcid": "missing"
    },
    {
      "name": "Tim van Slooten",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460658335",
      "orcid": "missing"
    },
    {
      "name": "Mattijs Ghijsen",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342495492",
      "orcid": "missing"
    },
    {
      "name": "Bob Wielinga",
      "institution": "University of Amsterdam, Amsterdam, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100478624",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bickmore, T. and Schulman, D. Practical Approaches to Comforting Users with Relational Agents. In Proc CHI'07 (2007), 2291--2296.  ",
      "doi": "10.1145/1240866.1240996"
    },
    {
      "text": "Brave S., Nass, C. and Hutchinson, K. Computers that care. Int. J. Human-Comp. St. 62 (2005) 161--178.  ",
      "doi": "10.1016/j.ijhcs.2004.11.002"
    },
    {
      "text": "Eckles, D. et al. Social responses in mobile messaging. In Proc. CHI'09 (2009), 1651--1654.  ",
      "doi": "10.1145/1518701.1518954"
    },
    {
      "text": "Fogg, B.J. and Eckles, D. Mobile Persuasion. Stanford Captology Media (2007).",
      "doi": ""
    },
    {
      "text": "Gaver, W. et al. (2009) Anatomy of a failure: how we knew when our design went wrong, and what we learned from it, In Proc.CHI'09 (2009), 2213--2222.  ",
      "doi": "10.1145/1518701.1519040"
    },
    {
      "text": "Goldberg, L. et al. The International Personality Item Pool. J. Research in Personality 40 (2006), 84--96.",
      "doi": ""
    },
    {
      "text": "Hone, K. Empathic agents to reduce user frustration. Interact. Comput. 18, 2 (2006), 227--245.  ",
      "doi": "10.1016/j.intcom.2005.05.003"
    },
    {
      "text": "Jameson, A. and Schwarzkopf, E. Pros and Cons of Controllability. In Proc. AH'02 (2002), 193--202. ",
      "doi": "10.5555/647458.728231"
    },
    {
      "text": "Lang, P. and Bradley, M. Measuring emotion. J. Beh. Therapy & Exp. Psychiatry, 25 (1), 49--59, 1994.",
      "doi": ""
    },
    {
      "text": "McQuiggan, S., Rowe, J., and Lester, J. The effects of empathetic virtual characters on presence in narrative-centered learning environments. In Proc.CHI'08 (2008), 1511--1520.  ",
      "doi": "10.1145/1357054.1357291"
    },
    {
      "text": "Picard, R. and Liu, K. Relative subjective count and assessment of interruptive technologies applied to mobile monitoring of stress. Int. J. Hum-Comp. St. 65, 4(2007), 361--375.  ",
      "doi": "10.1016/j.ijhcs.2006.11.019"
    },
    {
      "text": "Reeves, B. and Nass, C. The Media Equation. Cambridge University Press & CSLI Press (1996).",
      "doi": ""
    },
    {
      "text": "Rubin, R., Palmgreen, P. and Sypher, H. Communication Research Measures, Routledge (2004).",
      "doi": ""
    },
    {
      "text": "de Ruyter, B. et al. Assessing the effects of building social intelligence in a robotic interface for the home. Interact. Comput. 17 (2005), 522--541.  ",
      "doi": "10.1016/j.intcom.2005.03.003"
    },
    {
      "text": "Takayama, L. and Nass, C. Driver safety and information from afar: An experimental driver simulator study. Int. J. Human-Comp. St. 66, 3 (2008), 173--184.  ",
      "doi": "10.1016/j.ijhcs.2006.06.005"
    },
    {
      "text": "Thompson, E. Development and validation of an int. reliable short-form of the positive and negative affect schedule. J. Cross-Cult.Psy. 38, 2 (2007), 227--242.",
      "doi": ""
    },
    {
      "text": "Wright, P. and McCarthy, J. Empathy and Experience in HCI. In Proc. CHI'08 (2008), 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    }
  ]
}