{
  "doi": "10.1145/1753326.1753387",
  "title": "Interactive effects of age and interface differences on search strategies and performance",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "403-412",
  "year": 2010,
  "badges": [],
  "abstract": "We present results from an experiment that studied the information search behavior of younger and older adults in a medical decision-making task. To study how different combination of tasks and interfaces influenced search strategies and decision-making outcomes, we varied information structures of two interfaces and presented different task descriptions to participants. We found that younger adults tended to use different search strategies in different combination of tasks and interfaces, and older adults tended to use the same top-down strategies across conditions. We concluded that older adults were able to perform mental transformation of medical terms more effectively than younger adults. Thus older adults did not require changing strategies to maintain the same level of performance.",
  "tags": [
    "age differences",
    "web search",
    "cost-benefit analysis",
    "interface affordance",
    "knowledge structure",
    "search strategies"
  ],
  "authors": [
    {
      "name": "Jessie Chin",
      "institution": "University of Illinois at Urbana Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416603161",
      "orcid": "0000-0002-2878-8544"
    },
    {
      "name": "Wai-Tat Fu",
      "institution": "University of Illinois at Urbana Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244379",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. The Adaptive Character of Thoughts. Hillsdale, Erlbaum, NJ, USA, 1990.",
      "doi": ""
    },
    {
      "text": "Beier, M.E. and Ackerman, P.L. Determinants of Health Knowledge: An Investigation of Age, Gender, Abilities, Personality, and Interests. Journal of Personality and Social Psychology, 84, (2003), 439--448.",
      "doi": ""
    },
    {
      "text": "Brumby, D.P. and Howes, A. Strategies for Guiding Interactive Search: An Empirical Investigation into the Consequences of Label Relevance for Assessment and Selection. Human-Computer Interaction, 23, (2008), 1--46.",
      "doi": ""
    },
    {
      "text": "Chin, J., Fu, W.-T. and Kannampallil, T. Adaptive information search: Age-dependent interactions between cognitive profiles and strategies. In Proc. CHI2009, ACM Press (2009), 1683--1692.  ",
      "doi": "10.1145/1518701.1518961"
    },
    {
      "text": "Charman, S.C. and Howes, A. The adaptive user: An investigation into the cognitive and task constraints on the generation of new methods. Journal of Experimental Psychology: Applied, 9, (2003), 236--248.",
      "doi": ""
    },
    {
      "text": "Czaja, S.J., Sharit, J., Ownby, R., Roth, D. and Nair, S. Examining Age Differences in Performance of a Complex Information Search and Retrieval Task. Psychology and Aging, 16, (2001), 564--579.",
      "doi": ""
    },
    {
      "text": "Fairweather, P. How Older and Younger Adults Differ in Their Approach to Problem Solving on a Complex Website. In Proc. ASSETS2008, ACM Press (2008), 67--72.  ",
      "doi": "10.1145/1414471.1414485"
    },
    {
      "text": "Fisk, A.D., Rogers, W.A., Charness, N., Czaja, S.J., and Sharit, J. Designing for Older Adults--Principles and Creative Human Factors Approaches. CRC Press, Washington, DC, USA, 2004.",
      "doi": ""
    },
    {
      "text": "Flynn, K.E., Smith, M.A., and Freese, J. When do older adults turn to the internet for health information? Findings from the Wisconsin longitudinal study. Journal Gen Intern Med, 21, (2006), 1295--1301.",
      "doi": ""
    },
    {
      "text": "Fu, W.-T., and Gray, W.D. Suboptimal Tradeoffs in Information-Seeking. Cognitive Psychology, 52, (2006), 195--242.",
      "doi": ""
    },
    {
      "text": "Fu, W.-T., Pirolli, P. SNIF-ACT: A cognitive model of user navigation on the World Wide Web. Human-Computer Interaction, 22, (2007), 355--412. ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Hutchins, E. Cognition in the Wild. MIT Press, Cambridge, MA, USA, 1994.",
      "doi": ""
    },
    {
      "text": "Kirsh, D., and Maglio, P. On distinguishing epistemic from pragmatic action. Cognitive Science, 18, (1994), 513--549.",
      "doi": "10.1016/0364-0213%2894%2990007-8"
    },
    {
      "text": "Mata, R., Schooler, L.J. and Rieskamp, J. The aging decision maker: cognitive aging and the adaptive selection of decision strategies. Psychology and Aging, 22, (2007), 796--810.",
      "doi": ""
    },
    {
      "text": "Meyer, B.J.F., Talbot, A.P. and Ranalli, C. Why older adults make more immediate treatment decisions about breast cancer than younger adults. Psychology and Aging, 22, (2007), 505--524.",
      "doi": ""
    },
    {
      "text": "Miller, L.M.S., Stine-Morrow, E.A.L., Kirkorian, H.L. and Conroy, M.L. Adult age differences in knowledge-driven reading. Journal of Educational Psychology, 96, (2004), 811--821.",
      "doi": ""
    },
    {
      "text": "Payne, S.J., Howes, A. and Reader, W.R. Adaptively distributed cognition: a decision making perspective on human-computer interaction. Behaviour & Information Technology, 20, (2001), 339--346.",
      "doi": ""
    },
    {
      "text": "Pew Internet & American Life Project. (2008). The Engaged E-patient Population. {Online}. Available: http://www.pewinternet.org/pdfs/PIP_Health_Aug08.pdf",
      "doi": ""
    },
    {
      "text": "Simon, H.A, Rational choice and the structure of the environment. Psychology Review, 63, (1956), 129--138.",
      "doi": ""
    },
    {
      "text": "Simon, H.A., The Structure of Ill-Structured Problems. Artificial Intelligence, 4, (1973), 181--204.",
      "doi": ""
    },
    {
      "text": "Sharit, J., Hernandez, M., Czaja, S. and Pirolli, P. Investigating the Roles of Knowledge and Cognitive Abilities in Older Adult Information Seeking on the Web. ACM Transactions on Computer-Human Interaction, 15, (2008), 11--25.  ",
      "doi": "10.1145/1352782.1352785"
    },
    {
      "text": "Stine-Morrow, E.A.L., Miller, L.M.S., Gagne, D.D. and Hertzog, C. Self-Regulated Reading in Adulthood. Psychology and Aging, 23, (2008), 23, 131--153.",
      "doi": ""
    },
    {
      "text": "Stronge, A.J., Rogers, W.A. and Fisk, A.D. Web-based information search and retrieval: effects of strategy use and age on search success, Human Factors, 48, (2006), 434--446.",
      "doi": ""
    },
    {
      "text": "Touron, D.R., and Hertzog, C. Strategy shift affordance and strategy choice in young and older adults. Memory & Cognition, 32, (2004), 298--310.",
      "doi": ""
    }
  ]
}