{
  "doi": "10.1145/1753326.1753568",
  "title": "Exploring affective technologies for the classroom with the subtle stone",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1623-1632",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Constructive emotional experiences are strongly related to effective learning. Yet, it is challenging for teachers, researchers and students alike to understand the emotions experienced in the classroom setting. Advances in wireless and sensor technologies open up possibilities for better supporting emotions. However, little work has explored how affective technologies in the classroom might operate. This paper describes a study where 15 high school students used the Subtle Stone: a tangible technology designed to support students' active emotional communication in the classroom. We report on how the students used and experienced this technology, and the values they demonstrated through this use: flexibility, privacy, agency, voice and reflection. We conclude by examining future possibilities for affective technologies in the classroom.",
  "authors": [
    {
      "name": "Madeline Balaam",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600301",
      "orcid": "0000-0001-9472-3805"
    },
    {
      "name": "Geraldine Fitzpatrick",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489057",
      "orcid": "missing"
    },
    {
      "name": "Judith Good",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090405",
      "orcid": "missing"
    },
    {
      "name": "Rosemary Luckin",
      "institution": "London Knowledge Lab, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452612610",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alsmeyer, M., R. Luckin, and J. Good. Looking out over a sea of blank faces: interpreting the emotional experiences of learners in formal educational settings. in Workshop in Modelling and Scaffolding Affective Experiences to Impact Learning held as part of AIED. 2007.",
      "doi": ""
    },
    {
      "text": "Alsmeyer, M., R. Luckin, and J. Good. Developing a novel interface for capturing self reports of affect. in Proc. CHI. 2008. ACM Press: p. 2883--2888.  ",
      "doi": "10.1145/1358628.1358778"
    },
    {
      "text": "Arroyo, I., et al. Emotion sensors go to school. in Proc. AIED. 2009. IOS Press: p. 17--24. ",
      "doi": "10.5555/1659450.1659458"
    },
    {
      "text": "Balaam, M., Luckin, R., Good, J, Supporting Affective communication in the classroom with the Subtle Stone. Int. Journal of Learning Technologies, 2009. 4(3/4): p. 188--215.  ",
      "doi": "10.1504/IJLT.2009.028806"
    },
    {
      "text": "Boehner, K., et al. Affect: from information to interaction. in Proc. Critical Computing. 2005. ACM Press: p. 59--68.  ",
      "doi": "10.1145/1094562.1094570"
    },
    {
      "text": "Craig, S., Graesser, A., Sullins, J., Gholson, B, Affect and learning: an exploratory look into the role of affect in learning with AutoTutor. Journal of Educational Media, 2004. 29(3): p. 241--250.",
      "doi": ""
    },
    {
      "text": "D'mello, S. and A. Graesser. Mind and Body: Dialogue and posture for affect detection in learning environments. in Proc. AIED 2007. 2007. IOS Press: p. 161--168. ",
      "doi": "10.5555/1563601.1563631"
    },
    {
      "text": "D'Mello, S.D., et al., Self versus teacher judgments of learner emotions during a tutoring session with AutoTutor. in Proc. ITS 2008, Springer: Heidelberg, Germany. p. 9--18.  ",
      "doi": "10.1007/978-3-540-69132-7_6"
    },
    {
      "text": "Fleck, R. and G. Fitzpatrick, Teachers' and tutors' social reflection around SenseCam images. Int Journal of Human Computer Studies, 2009. 67(12): p. 1024--1036.  ",
      "doi": "10.1016/j.ijhcs.2009.09.004"
    },
    {
      "text": "Goffman, E., The presentation of self in everyday life. 1959: Anchor Books.",
      "doi": ""
    },
    {
      "text": "Goleman, D., Emotional intelligence: Why it matters more than IQ. 1996, London: Bloomsbury.",
      "doi": ""
    },
    {
      "text": "Höök, K., et al. Interactional empowerment. in Proc. CHI. 2008. ACM press: p. 654--656.  ",
      "doi": "10.1145/1357054.1357157"
    },
    {
      "text": "Iachello, G., et al. Control, deception and communication: Evaluating the deployment of a location-enhanced messaging service. in Proc. UbiComp. 2005. Springer: p. 213--231.  ",
      "doi": "10.1007/11551201_13"
    },
    {
      "text": "Isbister, K., et al. The sensual evaluation instrument: developing an affective evaluation tool. in Proc. CHI. 2006. ACM: p. 1163--1172.  ",
      "doi": "10.1145/1124772.1124946"
    },
    {
      "text": "Kort, B. and R. Reilly. Analytical models of emotions, learning and relationships: Towards an affect-eensitive cognitive machine. in Proc. Virtual Worlds and Simulation. 2002.",
      "doi": ""
    },
    {
      "text": "Lindstrom, M., et al. Affective diary -- Designing for bodily expressiveness and self reflection. in Proc. CHI. 2006. ACM Press: p. 1037--1042.  ",
      "doi": "10.1145/1125451.1125649"
    },
    {
      "text": "Linnenbrink, E. and P. Pintrich, Achievement goal theory and affect: An asymmetrical bidirectional Model. Educational Psychologist, 2001. 37(2): p. 69--78.",
      "doi": ""
    },
    {
      "text": "Meyer, D. and J. Turner, Discovering emotion in classroom motivation research. Educational Psychologist, 2002. 37(2): p. 107--114.",
      "doi": ""
    },
    {
      "text": "Pekrun, R., et al., Academic emotions in students' self-regulated learning and achievement: a program of qualitative and quantitative research. Educational Psychologist, 2002. 37(2): p. 91--105.",
      "doi": ""
    },
    {
      "text": "Picard, R., Affective computing. 1997, Cambridge: MIT Press. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Sengers, P., et al. Evaluating Affector: Co-interpreting what \"works\". in Proc. CHI 2005 Workshop on Innovative Approaches to Evaluating Affective Systems. 2005.",
      "doi": ""
    },
    {
      "text": "Sundström, P., A. Ståhl, and K. Höök, In situ informants exploring an emotional mobile messaging system in their everyday practice. Int. Journal of Human-Computer Studies, 2007. 65: p. 388--403.  ",
      "doi": "10.1016/j.ijhcs.2006.11.013"
    }
  ]
}