{
  "doi": "10.1145/1753326.1753504",
  "title": "Characterizing debate performance via aggregated twitter sentiment",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1195-1198",
  "year": 2010,
  "badges": [],
  "abstract": "Television broadcasters are beginning to combine social micro-blogging systems such as Twitter with television to create social video experiences around events. We looked at one such event, the first U.S. presidential debate in 2008, in conjunction with aggregated ratings of message sentiment from Twitter. We begin to develop an analytical methodology and visual representations that could help a journalist or public affairs person better understand the temporal dynamics of sentiment in reaction to the debate video. We demonstrate visuals and metrics that can be used to detect sentiment pulse, anomalies in that pulse, and indications of controversial topics that can be used to inform the design of visual analytic systems for social media events.",
  "authors": [
    {
      "name": "Nicholas A. Diakopoulos",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309489274",
      "orcid": "0000-0001-5005-6123"
    },
    {
      "name": "David A. Shamma",
      "institution": "Yahoo! Research, Santa Clara, CA, USA",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    }
  ],
  "references": [
    {
      "text": "Diakopoulos, N., Goldenberg, S. and Essa, I., Videolyzer: Quality Analysis of Online Informational Video for Bloggers and Journalists. in Proc. CHI, (2009).  ",
      "doi": "10.1145/1518701.1518824"
    },
    {
      "text": "Golder, S., Wilkinson, D. and Huberman, B., Rhythms of social interaction: messaging within a massive online network. in Communities and Technologies, (2007).",
      "doi": ""
    },
    {
      "text": "Harboe, G., Metcalf, C.J., Bentley, F., Tullio, J., Massey, N. and Romano, G., Ambient social TV: drawing people into a shared experience. in CHI, (2008), 1--10.  ",
      "doi": "10.1145/1357054.1357056"
    },
    {
      "text": "Hunneycutt and Herring, Beyond Microblogging: Conversation and Collaboration via Twitter. in HICSS, (2009).",
      "doi": ""
    },
    {
      "text": "Java, A., Song, X., FInin, T. and Tseng, B., Why we twitter: understanding microblogging usage and communities. in Workshop on Web Mining and Social Network Analysis, (2007).  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Kittur, A., Chi, E.H. and Suh, B., Crowdsourcing User Studies With Mechanical Turk in Proceedings of CHI, (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Krishnamurthy, B., Gill, P. and Arlitt, M. A few chirps about twitter Workshop on online social networks (WOSP), 2008.  ",
      "doi": "10.1145/1397735.1397741"
    },
    {
      "text": "Lau, R.R. Negativity in Political Perception. Political Behavior, 4 (2). 353--377.",
      "doi": ""
    },
    {
      "text": "Naaman, M., Boase, J. and Lai, C.-H., Is it Really About Me? Message Content in Social Awareness Streams. in CSCW, (2010).  ",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Nakamura, S., Shimizu, M. and Tanaka, K., Can Social Annotation Support Users in Evaluating the Trustworthiness of Video Clips? in Workshop on Information Credibility on the Web (WICOW), (2008), 59--62.  ",
      "doi": "10.1145/1458527.1458542"
    },
    {
      "text": "Pang, B. and Lee, L. Opinion Mining and Sentiment Analysis, 2008.",
      "doi": ""
    },
    {
      "text": "Shamma, D.A., Kennedy, L. and Churchill, E. Tweet the debates ACM Multimedia Workshop on Social Media (WSM), (2009).  ",
      "doi": "10.1145/1631144.1631148"
    },
    {
      "text": "Sheng, V.S., Provost, F. and Ipeirotis, P.G., Get Another Label? Improving Data Quality and Data Mining Using Multiple, Noisy Labelers. in KDD, (2008).  ",
      "doi": "10.1145/1401890.1401965"
    },
    {
      "text": "Snow, R., O'Connor, B., Jurafsky, D. and Ng, A.Y., Cheap and Fast - But is it Good? Evaluating Non-Expert Annotations for Natural Language Tasks. in EMNLP, (2008). ",
      "doi": "10.5555/1613715.1613751"
    },
    {
      "text": "Williams, D., Ursu, M.F., Cesar, P., Bergström, K., Kegel, I. and Meenowa, J., An emergent role for TV in social communication. in European Interactive Television Conference (Euro ITV), (2009), 19--28.  ",
      "doi": "10.1145/1542084.1542088"
    }
  ]
}