{
  "doi": "10.1145/1753326.1753640",
  "title": "The prayer companion: openness and specificity, materiality and spirituality",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2055-2064",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "In this paper we describe the Prayer Companion, a device we developed as a resource for the spiritual activity of a group of cloistered nuns. The device displays a stream of information sourced from RSS news feeds and social networking sites to suggest possible topics for prayers. The nuns have engaged with the device enthusiastically over the first ten months of an ongoing deployment, and, notwithstanding some initial irritation with the balance of content, report that it plays a significant and continuing role in their prayer life. We discuss how we balanced specificity in the design with a degree of openness for interpretation to create a resource that the nuns could both understand and appropriate, describe the importance of materiality to the device's successful adoption, consider its implications as a design for older people, and reflect on the example it provides of how computation may serve spirituality.",
  "tags": [
    "research through design",
    "materiality",
    "interpretability",
    "interaction design",
    "older people",
    "spirituality"
  ],
  "authors": [
    {
      "name": "William Gaver",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    },
    {
      "name": "Mark Blythe",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100208849",
      "orcid": "missing"
    },
    {
      "name": "Andy Boucher",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100230335",
      "orcid": "0000-0002-4226-7059"
    },
    {
      "name": "Nadine Jarvis",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602135",
      "orcid": "missing"
    },
    {
      "name": "John Bowers",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260889",
      "orcid": "missing"
    },
    {
      "name": "Peter Wright",
      "institution": "Sheffield Hallum University, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Coleman, R. Designing for Our Future Selves. In Preiser, W. and Ostroff, E. (eds.) Universal Design Handbook. McGraw Hill (2001) 4.1--4.25.",
      "doi": ""
    },
    {
      "text": "Cooper, G and Bowers, J. Representing the user. In The Social and Interactional Dimensions of Human--Computer Interfaces, P. Thomas, Ed. Cambridge Univ. Press, 48--66. ",
      "doi": "10.5555/214811.214821"
    },
    {
      "text": "Crampton-Smith, G. and Tabor, P. 1996. The role of the artist-designer. In Bringing Design To Software, T. Winograd, Ed. ACM, New York, NY, 37--61.  ",
      "doi": "10.1145/229868.230031"
    },
    {
      "text": "Dalsgaard, P, Designing for inquisitive use. Proc. DIS'08, 21--30.  ",
      "doi": "10.1145/1394445.1394448"
    },
    {
      "text": "Frayling, C. Research in Art and Design. Royal College of Art Research Papers 1, 1 (1993),1--5.",
      "doi": ""
    },
    {
      "text": "Gaver, W, Bowers, J, Kerridge, T, et al. Anatomy of a failure. Proc. CHI '09, 2213--2222.  ",
      "doi": "10.1145/1518701.1519040"
    },
    {
      "text": "Gaver, W., Beaver, J., and Benford, S., Ambiguity as a resource for design. Proc. CHI'03 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Gaver, W., Boucher, A., Law, A., et al. Threshold devices. Proc. CHI '08. 1429--1438.  ",
      "doi": "10.1145/1357054.1357278"
    },
    {
      "text": "Hansen, M and Rubin, B. Listening Post: Giving Voice to Online Communication. Proc. ICAD'02, p. 1.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction, 2004. 19(4): 319--34.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "McCarthy, J and Wright P. Technology as Experience. Cambridge Mass: MIT Press 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Mynatt, E, Rowan, J, Craighill, S, and Jacobs, A. Digital Family portraits. Proc. CHI'01 333--340.",
      "doi": ""
    },
    {
      "text": "Park, S, Kang, S, Chung, S, and Song, J. NewsCube: delivering multiple aspects of news to mitigate media bias. Proc. CHI '09. 443--452.  ",
      "doi": "10.1145/1518701.1518772"
    },
    {
      "text": "Pousman, Z, Romero, M, Smith, A, and Mateas, M. Living with Tableau Machine. Proc. UbiComp '08, 370--379.  ",
      "doi": "10.1145/1409635.1409685"
    },
    {
      "text": "Pullen, G., Design meets Disability. MIT Press.",
      "doi": ""
    },
    {
      "text": "Sengers, P. and Gaver, W., Staying open to interpretation. Proc. DIS'06, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Vetere, F., Davis, H., Gibbs., M., Howard, S., The Magic Box: Responding to the challenge of distributed intergenerational play. IJHCS, 67,2 (2009) 165--178.  ",
      "doi": "10.1016/j.ijhcs.2008.09.004"
    },
    {
      "text": "Wherton, J., and Monk., A. Designing Cognitive Supports for Dementia. SIGACCESS'86. 28--31.  ",
      "doi": "10.1145/1196148.1196155"
    },
    {
      "text": "Willis, Paul (2000) The Ethnographic Imagination. Polity Press, Cambridge",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Augustin, S., and Foucault, B., Sabbath Day Home Automation: \"It's Like Mixing Technology and Religion.\" Proc. CHI'07. 527--536.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Wyche, S and Grinter, R Extraordinary computing: religion as a lens for reconsidering the home. Proc. CHI '09, 749--758.  ",
      "doi": "10.1145/1518701.1518817"
    },
    {
      "text": "Wyche, S, Caine, K, Davison, B, et al. Sun Dial: Exploring techno-spiritual design through a mobile islamic call to prayer application. Proc CHI'08, 3411--3416.  ",
      "doi": "10.1145/1358628.1358866"
    },
    {
      "text": "Wyche, S, Hayes, G, Harvel, L, and Grinter, R, Technology in Spiritual Formation. Proc. CSCW'06, 199--208.  ",
      "doi": "10.1145/1180875.1180908"
    },
    {
      "text": "Zimmerman, J., Research through Design as a Method for Interaction Design Research in HCI. Proc. CHI'06 493--503.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}