{
  "doi": "10.1145/1753326.1753400",
  "title": "d.note: revising user interfaces through change tracking, annotations, and alternatives",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "493-502",
  "year": 2010,
  "badges": [],
  "abstract": "Interaction designers typically revise user interface prototypes by adding unstructured notes to storyboards and screen printouts. How might computational tools increase the efficacy of UI revision? This paper introduces d.note, a revision tool for user interfaces expressed as control flow diagrams. d.note introduces a command set for modifying and annotating both appearance and behavior of user interfaces; it also defines execution semantics so proposed changes can be tested immediately. The paper reports two studies that compare production and interpretation of revisions in d.note to freeform sketching on static images (the status quo). The revision production study showed that testing of ideas during the revision process led to more concrete revisions, but that the tool also affected the type and number of suggested changes. The revision interpretation study showed that d.note revisions required fewer clarifications, and that additional techniques for expressing revision intent could be beneficial.",
  "authors": [
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    },
    {
      "name": "Sean Follmer",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377593653",
      "orcid": "0000-0001-5592-5949"
    },
    {
      "name": "Antonio Ricciardi",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654031",
      "orcid": "missing"
    },
    {
      "name": "Timothy Cardenas",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657441",
      "orcid": "missing"
    },
    {
      "name": "Scott R. Klemmer",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eclipse Graphical Editing Framework (GEF). http://www.eclipse.org/gef/.",
      "doi": ""
    },
    {
      "text": "Bailey, B.P., Konstan, J.A., and Carlis, J.V. DEMAIS: designing multimedia applications with interactive story--boards. Proceedings of the ACM international conference on Multimedia, ACM (2001), 241--250.  ",
      "doi": "10.1145/500141.500179"
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design, Chapter on Visual Story Telling. Morgan Kaufmann, 2007. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Cross, N. Designerly Ways of Knowing. Springer, 2006.",
      "doi": ""
    },
    {
      "text": "Drucker, S.M., Petschnigg, G., and Agrawala, M. Comparing and managing multiple versions of slide presentations. Proceedings of UIST 2006, ACM (2006), 47--56.  ",
      "doi": "10.1145/1166253.1166263"
    },
    {
      "text": "Girschick, M. Difference detection and visualization in UML class diagrams. Report TUD-2006-05, TU Darmstadt, 2006.",
      "doi": ""
    },
    {
      "text": "Guimbretière, F. Paper augmented digital documents. Proceedings of UIST 2003, ACM (2003), 51--60.  ",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Hailpern, J., Hinterbichler, E., Leppert, C., Cook, D., and Bailey, B.P. TEAM STORM: demonstrating an interaction model for working with multiple ideas during creative group work. Proceedings of Creativity and Cognition 2007, ACM (2007), 193--202.  ",
      "doi": "10.1145/1254960.1254987"
    },
    {
      "text": "Harel, D. Statecharts: A Visual Formalism For Complex Systems. Sci. of Computer Programming 8, (1987), 231--274.  ",
      "doi": "10.1016/0167-6423%2887%2990035-9"
    },
    {
      "text": "Hartmann, B., Yu, L., Allison, A., Yang, Y., and Klemmer, S.R. Design As Exploration: Creating Interface Alternatives through Parallel Authoring and Runtime Tuning. Proceedings of UIST 2008, ACM (2008).  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Hartmann, B., Klemmer, S.R., Bernstein, M., et al. Reflective physical prototyping through integrated design, test, and analysis. Proceedings of UIST 2006, ACM (2006), 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Heckel, P. A technique for isolating differences between files. Communications of the ACM 21, 4 (1978), 264--268.  ",
      "doi": "10.1145/359460.359467"
    },
    {
      "text": "Heer, J., Mackinlay, J.D., Stolte, C., and Agrawala, M. Graphical Histories for Visualization: Supporting Analysis, Communication, and Evaluation. Proceedings of IEEE Information Visualization 2008, IEEE (2008).  ",
      "doi": "10.1109/TVCG.2008.137"
    },
    {
      "text": "Hunt, J.W. and McIlroy, M.D. An Algorithm for Differential File Comparison. Computing Science Technichal Report #41, Bell Laboratories, (1976).",
      "doi": ""
    },
    {
      "text": "Jones, J.C. Design Methods. Wiley, 1992.",
      "doi": ""
    },
    {
      "text": "Klemmer, S. Integrating physical and digital interactions. Computer 38, 10 (2005), 111--113.  ",
      "doi": "10.1109/MC.2005.343"
    },
    {
      "text": "Klemmer, S.R., Sinha, A.K., Chen, J., Landay, J.A., Aboobaker, N., and Wang, A. Suede: a Wizard of Oz proto-typing tool for speech user interfaces. Proceedings of UIST 2000, ACM (2000), 1--10.  ",
      "doi": "10.1145/354401.354406"
    },
    {
      "text": "Klemmer, S.R., Thomsen, M., Phelps-Goodman, E., Lee, R., and Landay, J.A. Where do web sites come from?: capturing and interacting with design history. Proceedings of CHI 2002, ACM (2002), 1--8.  ",
      "doi": "10.1145/503376.503378"
    },
    {
      "text": "Kurlander, D. and Feiner, S. Editable Graphical Histories. Workshop on Visual Languages, IEEE (1988), 127--134.",
      "doi": ""
    },
    {
      "text": "Landay, J. and Myers, B. Sketching Interfaces: Toward More Human Interface Design. Computer 34, 3 (2001), 56--64.  ",
      "doi": "10.1109/2.910894"
    },
    {
      "text": "Li, Y., Hong, J.I., and Landay, J.A. Topiary: a tool for prototyping location-enhanced applications. Proceedings of UIST 2004, ACM (2004), 217--226.  ",
      "doi": "10.1145/1029632.1029671"
    },
    {
      "text": "Lin, J., Newman, M., Hong, J., and Landay, J. DENIM: finding a tighter fit between tools and practice for Web site design. Proceedings of CHI 2000, ACM (2000), 510--517.  ",
      "doi": "10.1145/332040.332486"
    },
    {
      "text": "MacIntyre, B., Gandy, M., Dow, S., and Bolter, J. DART: a toolkit for rapid design exploration of augmented reality experiences. Proceedings of CHI 2004, ACM (2004), 197--206.  ",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "Mehra, A., Grundy, J., and Hosking, J. A generic approach to supporting diagram differencing and merging for collaborative design. Proceedings of the International Conference on Automated software engineering, ACM (2005), 204--213.  ",
      "doi": "10.1145/1101908.1101940"
    },
    {
      "text": "Moggridge, B. Designing Interactions. The MIT Press, 2007. ",
      "doi": "10.5555/1196347"
    },
    {
      "text": "Neuwirth, C.M., Kaufer, D.S., Chandhok, R., and Morris, J.H. Issues in the design of computer support for co-authoring and commenting. Proceedings of CSCW 1990, ACM (1990), 183--195.  ",
      "doi": "10.1145/99332.99354"
    },
    {
      "text": "Perry, M. and Sanderson, D. Coordinating joint design work: the role of communication and artefacts. Design Studies 19, 3 (1998), 273--288.",
      "doi": ""
    },
    {
      "text": "Schipper, A., Fuhrmann, H., and Hanxleden, R.V. Visual Comparison of Graphical Models. Proceedings of the IEEE Int'l Conference on Engineering of Complex Computer Systems, IEEE Computer Society (2009), 335--340.  ",
      "doi": "10.1109/ICECCS.2009.15"
    },
    {
      "text": "Sharp, H., Rogers, Y., and Preece, J. Interaction Design: Beyond Human-Computer Interaction. Wiley, 2007. ",
      "doi": "10.5555/1215597"
    },
    {
      "text": "Song, H., Guimbretière, F., Hu, C., and Lipson, H. Model-Craft: capturing freehand annotations and edits on physical 3D models. Proceedings of UIST 2006, ACM (2006), 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Su, S. Visualizing, Editing, and Inferring Structure in 2D Graphics. Adjunct Proceedings of UIST 2007, ACM (2007).",
      "doi": ""
    },
    {
      "text": "Terry, M., Mynatt, E.D., Nakakoji, K., and Yamamoto, Y. Variation in element and action: supporting simultaneous development of alternative solutions. Proceedings of CHI 2004, ACM (2004), 711--718.  ",
      "doi": "10.1145/985692.985782"
    },
    {
      "text": "Wobbrock, J.O., Wilson, A.D., and Li, Y. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. Proceedings of UIST 2007, ACM (2007), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Wojahn, P.G., Neuwirth, C.M., and Bullock, B. Effects of interfaces for annotation on communication in a collaborative task. Proceedings of CHI 1998, ACM (1998), 456--463.  ",
      "doi": "10.1145/274644.274706"
    },
    {
      "text": "Yeh, R., Paepcke, A., and Klemmer, S.R. Iterative Design and Evaluation of an Event Architecture for Pen-and-Paper Interfaces. Proceedings of UIST 2008, ACM (2008).  ",
      "doi": "10.1145/1449715.1449734"
    }
  ]
}