{
  "doi": "10.1145/1753326.1753401",
  "title": "FrameWire: a tool for automatically extracting interaction logic from paper prototyping tests",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "503-512",
  "year": 2010,
  "badges": [],
  "abstract": "Paper prototyping offers unique affordances for interface design. However, due to its spontaneous nature and the limitations of paper, it is difficult to distill and communicate a paper prototype design and its user test findings to a wide audience. To address these issues, we created FrameWire, a computer vision-based system that automatically extracts interaction flows from the video recording of paper prototype user tests. Based on the extracted logic, FrameWire offers two distinct benefits for designers: a structural view of the video recording that allows a designer or a stakeholder to easily distill and understand the design concept and user interaction behaviors, and automatic generation of interactive HTML-based prototypes that can be easily tested with a larger group of users as well as \"walked through\" by other stakeholders. The extraction is achieved by automatically aggregating video frame sequences into an interaction flow graph based on frame similarities and a designer-guided clustering process. The results of evaluating FrameWire with realistic paper prototyping tests show that our extraction approach is feasible and FrameWire is a promising tool for enhancing existing prototyping practice.",
  "tags": [
    "programming by demonstration",
    "paper prototyping"
  ],
  "authors": [
    {
      "name": "Yang Li",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    },
    {
      "name": "Xiang Cao",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641268",
      "orcid": "missing"
    },
    {
      "name": "Katherine Everitt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584715",
      "orcid": "missing"
    },
    {
      "name": "Morgan Dixon",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350581254",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Alvarado, C. and Davis, R. SketchREAD: a multi-domain sketch recognition engine. UIST'04. p. 23--32.  ",
      "doi": "10.1145/1029632.1029637"
    },
    {
      "text": "Anoto. http://www.anoto.com.",
      "doi": ""
    },
    {
      "text": "Bailey, B.P., et al. DEMAIS: designing multimedia applications with interactive storyboards. ACM Multimedia'01. p. 241--250.  ",
      "doi": "10.1145/500141.500179"
    },
    {
      "text": "Barnes, C., et al. Video puppetry: a performative interface for cutout animation. ACM Trans. Graph. 27, 5 (Dec. 2008), 1--9.  ",
      "doi": "10.1145/1409060.1409077"
    },
    {
      "text": "Cypher, A., ed. Watch What I Do: Programming by Demonstration. 1993, MIT Press. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Guimbretière, F. Paper Augmented Digital Documents. UIST'03. p. 51--60.  ",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Hartmann, B., et al. Reflective physical prototyping through integrated design, test, and analysis. UIST'06. p. 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Hong, J.I. and Landay, J.A. WebQuilt: a framework for capturing and visualizing the web experience. WWW'01. p. 717--724.  ",
      "doi": "10.1145/371920.372188"
    },
    {
      "text": "Johnson, W., et al. Bridging the paper and electronic worlds: the paper user interface. CHI'93. p. 507--512. ",
      "doi": "10.5555/164632.164986"
    },
    {
      "text": "Kim, J., et al. Video-based document tracking: unifying your physical and electronic desktops. UIST'04. p. 99--107.  ",
      "doi": "10.1145/1029632.1029650"
    },
    {
      "text": "Klemmer, S.R., et al. Integrating Physical and Digital Interactions on Walls for Fluid Design Collaboration. Human-Computer Interaction, 23: p. 138--213.",
      "doi": ""
    },
    {
      "text": "Landay, J.A. and Myers, B.A. Sketching Interfaces: Toward More Human Interface Design. IEEE Computer, 2001. 34(3): p. 56--64.  ",
      "doi": "10.1109/2.910894"
    },
    {
      "text": "Liao, C., et al. Papiercraft: A gesture-based command system for interactive paper. TOCHI, 2008. 14(4): p. 1073--0516.  ",
      "doi": "10.1145/1314683.1314686"
    },
    {
      "text": "Lieberman, H., ed. Your Wish Is My Command: Programming by Example. 2001, Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "MacIntyre, B., et al. DART: A Toolkit for Rapid Design Exploration of Augmented Reality Experiences. UIST'04. p. 197--206.  ",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "Mackay, W.E. and Fayard, A.L. Video brainstorming and prototyping: techniques for participatory design. In CHI '99 Extended Abstracts. CHI '99. p. 118--119.  ",
      "doi": "10.1145/632716.632790"
    },
    {
      "text": "Newman, M.W., et al. DENIM: An Informal Web Site Design Tool Inspired by Observations of Practice. Human-Computer Interaction, 2003. 18(3): p. 259--324.  ",
      "doi": "10.1207/S15327051HCI1803_3"
    },
    {
      "text": "Rettig, M. Prototyping for Tiny Fingers. Communications of the ACM, 1994. 37(4): p. 21--27.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Snyder, C. Paper Prototyping: The Fast and Easy Way to Design and Refine User Interfaces. 2003, Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Ward, J.H. Hierarchical Grouping to Optimize an Objective Function. J. Am. Statist. Assoc., 1963. 58: p. 236--244.",
      "doi": ""
    },
    {
      "text": "Wellner, P. Interacting with paper on the DigitalDesk. Communications of the ACM, 1993. 36(7): p. 87--96.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Yeh, R., et al. ButterflyNet: a mobile capture and access system for field biology research. CHI'06. p. 571--580.  ",
      "doi": "10.1145/1124772.1124859"
    }
  ]
}