{
  "doi": "10.1145/1753326.1753593",
  "title": "Supporting coordination in surgical suites: physical aspects of common information spaces",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1777-1786",
  "year": 2010,
  "badges": [],
  "abstract": "To accommodate frequent emergencies, interruptions, and delays, hospital staff continually make and coordinate changes to the surgery schedule. The technical and social aspects of coordination in surgical suites have been described by prior studies. This paper addresses an understudied aspect of coordination: the physical environment. Based on a field study of four surgical suites in two large academic centers, we show how the physical layout of hallways and rooms, and barriers and spaces around displays and key coordinators, support or fail to support the common information spaces used for coordination. We use the concept \"information hotspots\" to represent how physical places and their characteristics facilitate coordination. We developed design principles based on the concept of information hotspots that should guide architectural considerations for coordination in dynamic environments such as hospitals.",
  "authors": [
    {
      "name": "Peter G. Scupelli",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100126432/rel-imgonly/cropped_scupelli.jpg",
      "acmid": "81100126432",
      "orcid": "missing"
    },
    {
      "name": "Yan Xiao",
      "institution": "Baylor Health Care System, Dallas, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100293086",
      "orcid": "missing"
    },
    {
      "name": "Susan R. Fussell",
      "institution": "Cornell University , Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    },
    {
      "name": "Mark D. Gross",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81330491589/rel-imgonly/mdg_head_photo_closeup.jpg",
      "acmid": "81330491589",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, T.J. (1977). Managing the flow of technology. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "American Institute of Architects (2006). Guidelines for design and construction of health care facilities. Washington, DC: American Institute of Architects.",
      "doi": ""
    },
    {
      "text": "Bannon, L.S. & Bodker, S. (1997). Constructing common information spaces. Proc. ECSCW 1997 (pp. 81--96). Kluwer. ",
      "doi": "10.5555/1241980.1241986"
    },
    {
      "text": "Bardram, J.E. & Bossen, C. (2005a). A web of coordinative artifacts: Collaborative work at a hospital ward. Proc. Group 2005 (pp. 168--176). NY: ACM.  ",
      "doi": "10.1145/1099203.1099235"
    },
    {
      "text": "Bardram, J.E., Hansen, T.R., & Soegaard, M. (2006). AwareMedia: a shared interactive display supporting social, temporal, and spatial awareness in surgery. Proceedings of CSCW 2006 (pp. 109--118). NY: ACM.  ",
      "doi": "10.1145/1180875.1180892"
    },
    {
      "text": "Bardram, J.E. (2000). Temporal coordination: on time and coordination of collaborative activities at a surgical department. Journal of Computer Supported Cooperative Work, 9, 157--187.  ",
      "doi": "10.1023/A%3A1008748724225"
    },
    {
      "text": "Bardram, J.E. & Bossen, C. (2005). Mobility work: the spatial dimension of collaboration at a hospital. Journal of Computer Supported Cooperative Work, 14, 131--160.  ",
      "doi": "10.1007/s10606-005-0989-y"
    },
    {
      "text": "Bardram, J.E., Baldus, H., Favela, J. (2007). Pervasive computing in hospitals. In J.E. Bardram, A Mihailidis, and D. Wan (Eds.) Pervasive Computing in Healthcare (pp. 49--77). Boca Raton, FL: CRC Press.",
      "doi": ""
    },
    {
      "text": "Bossen, C. (2002). The parameters of common information spaces: The heterogeneity of cooperative work at a hospital ward. Proc. CSCW 2002 (pp. 176--185). NY: ACM Press.  ",
      "doi": "10.1145/587078.587104"
    },
    {
      "text": "Carter, S., Mankoff, J., & Heer, J. (2007). Momento: support for situated ubicomp experimentation. Proc. CHI 2007 (pp. 125--134). NY: ACM.  ",
      "doi": "10.1145/1240624.1240644"
    },
    {
      "text": "Clarke, K., Hughes, J., Rouncefield, M., & Hemmings, T. (2003). When a bed is not a bed: the situated display of knowledge on a hospital ward. In K. O'Hara et al (Eds.) Public and Situated Displays. Social and Interactional Aspects of Shared Display Technologies. Kluwer.",
      "doi": ""
    },
    {
      "text": "Dexter F., Macario A., Traub, R.D., et al. (1999). An operating room scheduling strategy to maximize the use of operating room block time: Computer simulation of patient scheduling and survey of patients' preferences for surgical waiting time. Anesth Analg, 89, 7--20.",
      "doi": ""
    },
    {
      "text": "Faraj, S. & Xiao, Y. (2006). Coordination in fast-response organizations. Management Science, 52, 1155--1169.  ",
      "doi": "10.1287/mnsc.1060.0526"
    },
    {
      "text": "Favela, J. Rodriguez, M. Preciado, A. Gonzalez, V.M. (2004). Integrating context-aware public displays into a mobile hospital information system. IEEE Transactions on Information Technology in Biomedicine, 8, 279--286.  ",
      "doi": "10.1109/TITB.2004.834391"
    },
    {
      "text": "Festinger, L., Back, K.W., & Schachter, S. (1950). Social pressures in informal groups: A study of human factors in housing. New York: Univ. of Michigan Press.",
      "doi": ""
    },
    {
      "text": "Garritty, C. & El Emam, K. (2006). Who's using PDAs? Estimates of PDA use by health care providers: A systematic review of surveys, Journal of Medical Internet Research, 8(2), e7. www.jmir.org/2006/2/e7/",
      "doi": ""
    },
    {
      "text": "Goodwin, C. & Goodwin, M.H. (1996). Seeing as a situated activity: Formulating planes (pp. 61--95). In Y. Engeström & D. Middleton (Eds.), Cognition and Communication at Work. Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Hansen, T.R., Bardram, J.E., & Soegaard, M. (2006). Moving out of the lab: Deploying pervasive technologies in a hospital. IEEE Pervasive Computing, 5, 24--31.  ",
      "doi": "10.1109/MPRV.2006.53"
    },
    {
      "text": "Hatch, M.J., (1987). Physical barriers, task characteristics, and interaction activity in research and development firms. Administrative Science Quarterly, 32, 387--399.",
      "doi": ""
    },
    {
      "text": "Hawkey, K., Kellar, M., Reilly, D., Whalen, T., & Inkpen, K.M. (2005). The proximity factor: impact of distance on co-located collaboration. Proc. GROUP 2005 (pp. 31--40). NY: ACM Press.  ",
      "doi": "10.1145/1099203.1099209"
    },
    {
      "text": "Hillier, B. (1996). Space is the Machine. Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Hornecker, E., & Buur, J. (2006) Getting a grip on tangible interaction: A framework on physical space and social interaction. Proc. CHI 2006. NY: ACM.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Hu, P., Xiao, Y., Ho, D., Mackenzie, C.F., Hu, H., Voigt, R., & Martz, D. (2006). Advanced visualization platform for surgical operating room coordination: Distributed video board system. Surgical Innovation, 13, 129--135.",
      "doi": ""
    },
    {
      "text": "Huang, E.M., Koster, A., & Borcher, J. (2008). Overcoming assumptions and uncovering practices: When does the public really look at public displays?. Lecture Notes in Computer Science (Vol. 5013, pp. 228--243), Pervasive 2008. Sydney: Springer Link.  ",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Kobus, R.L., Skaggs, R.L., Bobrow, M., Thomas, J., & Payette, T.M. (2000). Building type basics for healthcare facilities: a building type basics handbook. New York: Wiley.",
      "doi": ""
    },
    {
      "text": "Kraut, R.E., Fish, R., Root, R., & Chalfonte, B. (1990). Informal communication in organizations: Form, function, and technology. In S. Oskamp & S. Spacapan (Eds.), Human reactions to technology: Claremont symposium on applied social psychology (pp. 145--199) Beverly Hills, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Ljungstrand, P. (2001). Context Awareness and Mobile Phones. Personal and Ubiquitous Computing, 5, 58--61.  ",
      "doi": "10.1007/s007790170032"
    },
    {
      "text": "Malone, T.W. & Crowston, K. (1990). What is coordination theory and how can it help design cooperative work systems. Proc. CSCW 1990 (pp. 357--370). NY: ACM Press.  ",
      "doi": "10.1145/99332.99367"
    },
    {
      "text": "Mark, W. (1999). Turning pervasive computing into mediated spaces. IBM Systems Journal, 38, 677--692.  ",
      "doi": "10.1147/sj.384.0677"
    },
    {
      "text": "McCullough, M. (2004). Digital ground: Architecture, pervasive computing, and environmental knowing. Cambridge, MA: MIT Press. ",
      "doi": "10.5555/983677"
    },
    {
      "text": "Mejia, D.A., Moran, A.L., & Favela, J. (2007). Supporting informal co-located collaboration in hospital work (pp. 255--270). In J.M. Haake, S.F. Ochoa, and A. Cechich (Eds.), CRIWG 2007, LNCS 4715, Berlin: Springer-Verlag. ",
      "doi": "10.5555/1784428.1784453"
    },
    {
      "text": "Moss, J., & Xiao, Y. (2004). Improving operating room coordination: communication pattern assessment. Journal of Nursing Administration, 34(2), 93--100.",
      "doi": ""
    },
    {
      "text": "Nemeth, C.P. (2003). The master schedule: How cognitive artifacts affect distributed cognition in acute care. Unpublished doctoral dissertation.",
      "doi": ""
    },
    {
      "text": "Neufert, E., & Neufert, P. (2000). Architects' data. 3rd ed. B. Baiche, & N. Walliman (Eds.) Oxford: Blackwell Science.",
      "doi": ""
    },
    {
      "text": "New York Times (2009). Health outcomes driving new hospital design. D5 (May 19).",
      "doi": ""
    },
    {
      "text": "Norman, D. (1990). The design of everyday things. New York: Doubleday.",
      "doi": ""
    },
    {
      "text": "Reddy, M.C., Dourish, P. & Pratt, W. (2001). Coordinating heterogeneous work: Information and representation in medical care. Proc. ECSCW 2001 (pp. 239--258). The Netherlands: Kluwer. ",
      "doi": "10.5555/1241867.1241880"
    },
    {
      "text": "Ren, Y., Fussell, S., & Kiesler, S. (2008). Multiple group coordination in complex and dynamic task environments: Interruptions, coping mechanisms, and technology recommendations. Journal of Management Information Systems, 25, 105--130.  ",
      "doi": "10.2753/MIS0742-1222250105"
    },
    {
      "text": "Rogers, Y. & Rodden, T. (2003). Configuring spaces and surfaces to support collaborative interactions. In K. O'Hara, M. Perry, E. Churchill, & D. Russell, (Eds.) Public and Situated Displays. (pp. 45--79). Kluwer.",
      "doi": ""
    },
    {
      "text": "Sarcevic, A., Marsic, I., Lesk, M.E., & Burd, R.S. (2008). Transactive memory in trauma resuscitation. Proc. CSCW '08 (pp. 215--224). NY: ACM Press.  ",
      "doi": "10.1145/1460563.1460597"
    },
    {
      "text": "Scupelli, P., Kiesler, S., & Fussell, S. R. (2007). Using isovist views to study placement of large displays in natural settings. CHI '07 Extended Abstracts (pp. 2645--2650). NY: ACM.  ",
      "doi": "10.1145/1240866.1241056"
    },
    {
      "text": "Sommer, R. (1969). Personal space: the behavioral basis of design. Englewood Cliffs, N.J.: Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Strauss, A., Fagerhaugh, S., Suczek, B., & Wiener, C. (1985). The social organization of medical work. Chicago: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Streitz, N, Geissler, J., Holmer, T., Konomi, S, Muller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P. & Steinmetz, R. (1999). i-Land: An interactive landscape for creativity and innovation. Proc. CHI 1999 (pp. 120--127). NY: ACM.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Su, R. & Bailey, B. (2005). Towards guidelines for positioning large displays in interactive workspaces, in Proceedings of INTERACT 2005, LNCS 3585, 337--349.  ",
      "doi": "10.1007/11555261_29"
    },
    {
      "text": "Suchman, L. (1997). Centers of coordination: A case and some themes. In L. Resnick, R. Saljo, and C. Pontecorvo (Eds.) Discourse, tools, and reasoning: essays on situated cognition. Berlin: Springer.",
      "doi": ""
    },
    {
      "text": "Symon, G., Long, K., & Ellis, J. (1996). The coordination of work activities: Cooperation and conflict in a hospital context. Computer Supported Cooperative Work, 5, 1--31.  ",
      "doi": "10.1007/BF00141934"
    },
    {
      "text": "Tang, C. & Carpendale, S. (2007). An observational study on information flow during nurses' shift change. In Proc. CHI 2007 (pp. 219--228). NY: ACM.  ",
      "doi": "10.1145/1240624.1240661"
    },
    {
      "text": "Tang, C. & Carpendale, S. (2009). A mobile voice communication system in medical setting: Love it or hate it?. In Proc. CHI 2009 (pp. 2041--2050). NY: ACM.  ",
      "doi": "10.1145/1518701.1519012"
    },
    {
      "text": "Tellioglu, H., & Warner, I. (2001). Work practices surrounding PACS: The politics of space in hospitals. Computer-Supported Cooperative Work, 10, 163--188.  ",
      "doi": "10.1023/A%3A1011298824442"
    },
    {
      "text": "Turner, A., Doxa, M., O'Sullivan, D., & Penn, A., (2001). From isovists to visibility graphs: a methodology for the analysis of architectural space. Environment and Planning B: Planning and Design, 28, 103--121",
      "doi": ""
    },
    {
      "text": "White, E.T. (1986). Space adjacency analysis, Tucson, AZ.: Architectural Media Ltd.",
      "doi": ""
    },
    {
      "text": "Whittaker, S., & Schwarz, H. (1999). Meetings of the board: The impact of scheduling medium on group coordination in software development. Computer Supported Cooperative Work, 8, 175--205.  ",
      "doi": "10.1023/A%3A1008603001894"
    },
    {
      "text": "Xiao Y., Kiesler S., Mackenzie C.F., et al. (2007). Negotiation and conflict in large scale collaboration: a preliminary field study. Cognition Technology & Work, 9, 171--176.  ",
      "doi": "10.1007/s10111-006-0052-x"
    },
    {
      "text": "Xiao, Y., Lasome, C, Moss, J, Mackenzie, C.F. & Faraj, S. (2001). Cognitive properties of a whiteboard: A case study in a trauma centre. Proc. ECSCW 2001 (pp. 259--278). Kluwer Academic Publishers. ",
      "doi": "10.5555/1241867.1241881"
    },
    {
      "text": "Xiao Y., Schenkel S., Faraj S., Mackenzie C.F., & Moss J.A. (2007). What whiteboards in a trauma center operating suite can teach us about emergency department communication. Annals of Emergency Medicine, 50, 387--95.",
      "doi": ""
    }
  ]
}