{
  "doi": "10.1145/1753326.1753670",
  "title": "Designing urban media façades: cases and challenges",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2277-2286",
  "year": 2010,
  "badges": [],
  "abstract": "Media façades comprise a category of urban computing concerned with the integration of displays into the built environment, including buildings and street furniture. This paper identifies and discusses eight challenges faced when designing urban media façades. The challenges concern a broad range of issues: interfaces, physical integration, robustness, content, stakeholders, situation, social relations, and emerging use. The challenges reflect the fact that the urban setting as a domain for interaction design is characterized by a number of circumstances and socio-cultural practices that differ from those of other domains. In order to exemplify the challenges and discuss how they may be addressed, we draw on our experiences from five experimental design cases, ranging from a 180 m2 interactive building façade to displays integrated into bus shelters.",
  "authors": [
    {
      "name": "Peter Dalsgaard",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81100468838/rel-imgonly/peter.jpeg",
      "acmid": "81100468838",
      "orcid": "missing"
    },
    {
      "name": "Kim Halskov",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81100505962/rel-imgonly/halskov_1_low_bw.jpg",
      "acmid": "81100505962",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. A Pattern Language: Towns, Buildings, Construction. Oxford University Press, USA, 1977.",
      "doi": ""
    },
    {
      "text": "Alexander, C., Ishikawa, S. and Silverstein, M.A. pattern language: towns, buildings, construction. Oxford University Press, New York, 1977.",
      "doi": ""
    },
    {
      "text": "Bødker, S. When second wave HCI meets third wave challenges. In NordiCHI '06: Proceedings of the 4th Nordic conference on Human-computer interaction. ACM, New York, NY, USA, 2006, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Bennett, G., Lindgaard, G., Tsuji, B., Connelly, K.H. and Siek, K.A. Reality testing: HCI challenges in non-traditional environments. In CHI '06: CHI '06 extended abstracts on Human factors in computing systems. ACM, New York, NY, USA, 2006, 1679--1682.  ",
      "doi": "10.1145/1125451.1125761"
    },
    {
      "text": "Brand, S. How buildings learn: what happens after they're built. Penguin Books, New York, 1994.",
      "doi": ""
    },
    {
      "text": "Brynskov, M., Dalsgaard, P., Ebsen, T., Fritsch, J., Halskov, K. and Nielsen, R. Staging Urban Interactions with Media Facades. In Human-Computer Interaction -- INTERACT 2009. Springer Verlag, Heidelberg, 2009, 154--167.  ",
      "doi": "10.1007/978-3-642-03655-2_20"
    },
    {
      "text": "Bullivant, L. Responsive environments: architecture, art and design. V&A, London, 2006.",
      "doi": ""
    },
    {
      "text": "Dalsgaard, P. and Halskov, K. Dynamically transparent window. In CHI EA '09: Proceedings of the 27th international conference extended abstracts on Human factors in computing systems. ACM, New York, NY, USA, 2009, 3019--3034.  ",
      "doi": "10.1145/1520340.1520429"
    },
    {
      "text": "Dalsgaard, P., Halskov, K. and Nielsen, R. Towards a design space explorer for media facades. In OZCHI '08: Proceedings of the 20th Australasian Conference on Computer-Human Interaction. ACM, New York, NY, USA, 2008, 219--226.  ",
      "doi": "10.1145/1517744.1517816"
    },
    {
      "text": "Dalsgaard, P. and Hansen, L.K. Performing Perception -- Staging Aesthetics of Interaction. ACM Transactions of Computer-Human Interaction, 15, 3 (2008), 1--33.  ",
      "doi": "10.1145/1453152.1453156"
    },
    {
      "text": "Foth, M. Handbook of Research on Urban Informatics: The Practice and Promise of the Real-Time City. Hershey, Pensylvania, 2009. ",
      "doi": "10.5555/1522476"
    },
    {
      "text": "Fritsch, J. and Dalsgaard, P. Media Facades Beyond Interaction. In Proceedings of OzCHI 2008.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T. and Pacenti, E. Design: Cultural probes. interactions, 6, 1 ( 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Goffman, E. Behavior in Public Places. Free Press, 1966.",
      "doi": ""
    },
    {
      "text": "Greenfield, A. and Shepard, M. Situated Technologies Pamphlets 1: Urban Computing and its Discontents. 2007.",
      "doi": ""
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: eight challenges for developers. Communications of the ACM, 37, 1 (1994), 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Haeusler, M.H. Media facades : history, technology, content. Avedition, Ludwigsburg, 2009.",
      "doi": ""
    },
    {
      "text": "Halskov, K. and Nielsen, R. Virtual Video Prototyping. Human-Computer Interaction, 21, 2 (2006), 199--233.  ",
      "doi": "10.1207/s15327051hci2102_2"
    },
    {
      "text": "Halskov, K. and Dalsgård, P. Inspiration Card Workshops. DIS, 2006, 1--10.  ",
      "doi": "10.1145/1142405.1142409"
    },
    {
      "text": "Hill, D. Teaching and Drawing Urban Sensing, 2009.",
      "doi": ""
    },
    {
      "text": "Jacobs, J. The Death and Life of Great American Cities. Random House, New York, 1961.",
      "doi": ""
    },
    {
      "text": "Klingmann, A. Brandscapes. MIT Press, 2007.",
      "doi": ""
    },
    {
      "text": "Leong, T.W. and Brynskov, M. CO2nfession: Engaging with values through urban conversations. In OZCHI 2009. 2009.  ",
      "doi": "10.1145/1738826.1738860"
    },
    {
      "text": "Mailund, L. and Halskov, K. Designing marketing experiences. In DIS '08: Proceedings of the 7th ACM conference on Designing interactive systems. ACM, New York, NY, USA, 2008, 222--229.  ",
      "doi": "10.1145/1394445.1394469"
    },
    {
      "text": "McCullough, M. Digital Ground: Architecture, Pervasive Computing, and Environmental Knowing. MIT Press, USA, 2004. ",
      "doi": "10.5555/983677"
    },
    {
      "text": "McKenna, M. G. and Naftulin, H. Challenges in the multicultural HCI development environment. In CHI '00: CHI '00 extended abstracts on Human factors in computing systems. ACM, New York, NY, USA, 2000, 362--362.  ",
      "doi": "10.1145/633292.633509"
    },
    {
      "text": "Morris, M. and Intille, S. HCI challenges in health assessment. In CHI '05: CHI '05 extended abstracts on Human factors in computing systems. ACM, New York, NY, USA, 2005, 2130--2131.  ",
      "doi": "10.1145/1056808.1057122"
    },
    {
      "text": "Nakhimovsky, Y., Eckles, D. and Riegelsberger, J. Mobile user experience research: challenges, methods & tools. In CHI EA '09: Proceedings of the 27th international conference extended abstracts on Human factors in computing systems. ACM, New York, NY, USA, 2009, 4795--4798.  ",
      "doi": "10.1145/1520340.1520743"
    },
    {
      "text": "Rudofsky, B. Architecture Without Architects. University of New Mexico Press 1987.",
      "doi": ""
    },
    {
      "text": "Schuler, D. and Namioka, A. Participatory Design: Principles and Practices. Lawrence Erlbaum Associates, Inc, Mahwah, NJ, USA, 1993. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Tuan, Y. Space and place: the perspective of experience. University of Minnesota Press, Minneapolis, 1977.",
      "doi": ""
    }
  ]
}