{
  "doi": "10.1145/1753326.1753569",
  "title": "vSked: evaluation of a system to support classroom activities for children with autism",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1633-1642",
  "year": 2010,
  "badges": [],
  "abstract": "Visual schedules--the use of symbols to represent a series of activities or steps--have been successfully used by caregivers to help children with autism to understand, structure, and predict activities in their daily lives. Building from in-depth fieldwork and participatory design sessions, we developed vSked, an interactive and collaborative visual scheduling system designed for elementary school classrooms. We evaluated vSked in situ in one autism-specific classroom over three weeks. In this paper, we present the design principles, technical solution, and results from this successful deployment. Use of vSked resulted in reductions in staff effort required to use visual supports. vSked also resulted in improvements in the perceived quality and quantity of communication and social interactions in the classroom.",
  "tags": [
    "assistive technology",
    "autism",
    "education",
    "visual supports"
  ],
  "authors": [
    {
      "name": "Sen H. Hirano",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430663071",
      "orcid": "missing"
    },
    {
      "name": "Michael T. Yeganyan",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657929",
      "orcid": "missing"
    },
    {
      "name": "Gabriela Marcu",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81443596216/rel-imgonly/marcuheadshotsept2017square.jpg",
      "acmid": "81443596216",
      "orcid": "0000-0001-7150-5784"
    },
    {
      "name": "David H. Nguyen",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100511688",
      "orcid": "missing"
    },
    {
      "name": "Lou Anne Boyd",
      "institution": "Orange County Department of Education, Fullerton, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460647791",
      "orcid": "0000-0002-9244-6581"
    },
    {
      "name": "Gillian R. Hayes",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592620",
      "orcid": "0000-0003-0966-8739"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D. and Mynatt, E.D. Charting Past, Present and Future Research in Ubiquitous Computing. ACM Trans on Comp.-Human Int. 7, 1, 29--58, 2000.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Anderson, R., Anderson, R., Davis, P., Linnell, N., Prince C., Razmov, V., and Videon, F. Classroom Presenter: Enhancing Interactive Education with Digital Ink, IEEE Computer, 56--61, 2007.  ",
      "doi": "10.1109/MC.2007.307"
    },
    {
      "text": "Cohen, M.J. and Sloan, D.L. Visual Supports for People with Autism: A Guide for Parents and Professionals. Woodbine House, USA, 2007.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R., Kientz, J.A., Truong, K.N., White, D.R., Abowd, G.D., and Pering, T. Designing Capture Applications to Support the Education of Children with Autism. In Proc. UbiComp 2004, 161--178, 2004.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R. and Abowd, G.D. Tensions in Designing Capture Technologies for an Evidence-Based Care Community. In Proc. CHI 2006, 937--946, 2006.  ",
      "doi": "10.1145/1124772.1124911"
    },
    {
      "text": "Hodgdon, L.A. Visual Strategies for Improving Visual Communication: Volume I: Practical support for school and home. Quirk Roberts Publishing, 1999.",
      "doi": ""
    },
    {
      "text": "Hourcade, J.P. Interaction Design and Children. Foundations and Trends in HCI. 1, 4, 277--392, 2008.  ",
      "doi": "10.1561/1100000006"
    },
    {
      "text": "Kientz, J.A., G.R. Hayes, T.L. Westeyn, T. Starner, and Abowd, G.D. Pervasive Computing and Autism: Assisting Caregivers of Children with Special Needs. IEEE Pervasive Computing. January 2007. 28--35, 2007.  ",
      "doi": "10.1109/MPRV.2007.18"
    },
    {
      "text": "Kimball, J.W., Kinney, E.M., Taylor, B.A. Stromer, R. Lights, Camera, Action! Using Engaging Computer--Cued Activity Schedules. Teaching Exceptional Children v. 36 no. 1, 40--45, 2003",
      "doi": ""
    },
    {
      "text": "Luchini, K., Quintana, C., and Soloway, E. Design Guidelines for Learner-Centered Handheld Tools. In Proc CHI 2004, 135--142, 2004.  ",
      "doi": "10.1145/985692.985710"
    },
    {
      "text": "McClanahan, L.E. and Krantz, P.J. Activity Schedules for Children with Autism: Teaching Independent Behavior. Woodbine House, 1999.",
      "doi": ""
    },
    {
      "text": "Mesibov G.B., Browder D.M., and Kirkland C. Using Individualized Schedules as a Component of Positive Behavioral Support for Students with Developmental Disabilities. J. Positive Behavior Interventions, 4(2): 73--79. 2002.",
      "doi": ""
    },
    {
      "text": "Savner, J.L. and Myles, B.S. Making Visual Supports Work in the Home And Community: Strategies for Individuals with Autism and Asperger Syndrome. Shawnee Mission, KS: Autism Asperger Publishing, 2000.",
      "doi": ""
    },
    {
      "text": "Tartaro, A. Storytelling with a Virtual Peer as an Intervention for Children with Autism. In Proc ASSETS 2005, ACM Press, p. 42--44, 2005.  ",
      "doi": "10.1145/1090785.1133180"
    },
    {
      "text": "Truong, K.N., Abowd, G.D., and Brotherton, J.A. Who, What, When, Where, How: Design Issues of Capture & Access Applications. In Proc Ubicomp 2001, 209--224, 2001. ",
      "doi": "10.5555/647987.741319"
    }
  ]
}