{
  "doi": "10.1145/1753326.1753374",
  "title": "Hidden markets: UI design for a P2P backup application",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "315-324",
  "year": 2010,
  "badges": [],
  "abstract": "The Internet has allowed market-based systems to become increasingly pervasive. In this paper we explore the role of user interface (UI) design for these markets. Different UIs induce different mental models which in turn determine how users understand and interact with a market. Thus, the intersection of UI design and economics is a novel and important research area. We make three contributions at this intersection. First, we present a novel design paradigm which we call hidden markets. The primary goal of hidden markets is to hide as much of the market complexities as possible. Second, we explore this new design paradigm using one particular example: a P2P backup application. We explain the market underlying this system and provide a detailed description of the new UI we developed. Third, we present results from a formative usability study. Our findings indicate that a number of users could benefit from a market-based P2P backup system. Most users intuitively understood the give & take principle as well as the bundle constraints of the market. However, the pricing aspect was difficult to discover/understand for many users and thus needs further investigation. Overall, the results are encouraging and show promise for the hidden market paradigm.",
  "authors": [
    {
      "name": "Sven Seuken",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385595731",
      "orcid": "missing"
    },
    {
      "name": "Kamal Jain",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100110196",
      "orcid": "missing"
    },
    {
      "name": "Desney S. Tan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Mary Czerwinski",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100280834/rel-imgonly/marycz.jpg",
      "acmid": "81100280834",
      "orcid": "0000-0003-0881-401X"
    }
  ],
  "references": [
    {
      "text": "C. Aperjis and R. Johari. A peer-to-peer system as an exchange economy. In Proceedings of GameNets, 2006.  ",
      "doi": "10.1145/1190195.1190206"
    },
    {
      "text": "S. Goel, D. Pennock, D. M. Reeves, and C. Yu. Yoopick: A combinatorial sports prediction market. In Proceedings of AAAI, Chicago, IL, July 2008. ",
      "doi": "10.5555/1620270.1620399"
    },
    {
      "text": "J. Hahn. The dynamics of mass online marketplaces: a case study of an online auction. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), Seattle, WA, April 2001.  ",
      "doi": "10.1145/365024.365124"
    },
    {
      "text": "F. A. Hayek. The uses of knowledge in society. American Economic Review, 35:519---530, 1945.",
      "doi": ""
    },
    {
      "text": "G. Hsieh and S. Counts. mimir: A market-based real-time question and answer service. In Proceedings of CHI, Boston, MA, April 2009.  ",
      "doi": "10.1145/1518701.1518820"
    },
    {
      "text": "G. Hsieh, R. Kraut, S. E. Hudson, and R. Weber. Can markets help? applying market mechanisms to improve synchronous communcation. In Proc. of CSCW, 2008.  ",
      "doi": "10.1145/1460563.1460648"
    },
    {
      "text": "K. Lai, L. Rasmusson, E. Adar, L. Zhang, and B. A. Huberman. Tycoon: An implementation of a distributed, market-based resource allocation system. Multiagent Grid Systems, 1(3):169--182, 2005. ",
      "doi": "10.5555/1233813.1233816"
    },
    {
      "text": "J. Li and C. Zhang. Distributed hosting of web content with erasure coding and unequal weight assignment. In Proceedings of ICME, Taipei, Taiwan, June 2004.",
      "doi": ""
    },
    {
      "text": "D. Morris, I. Simon, and S. Basu. Exposing parameters of a trained dynamic model for interactive music creation. In Proceedings of AAAI, Chicago, July 2008. ",
      "doi": "10.5555/1620163.1620194"
    },
    {
      "text": "S. S. Parikh and G. L. Lohse. Electronic futures markets versus floor trading: implications for interface design. In Proceedings of CHI, Denver, CO, May 1995.  ",
      "doi": "10.1145/223904.223942"
    },
    {
      "text": "A. E. Roth. What have we learned from market design? The Economic Journal, 118:285--310, 2008.",
      "doi": ""
    },
    {
      "text": "T. Sandholm. Expressive commerce and its application to sourcing: How we conducted $35 billion of generalized combinatorial auctions. AI Magazine, 28(3):45--58, 2007.",
      "doi": ""
    },
    {
      "text": "S. Seuken, D. Charles, M. Chickering, and S. Puri. Designing User Interfaces for Hidden Markets. In Proceedings of the IJCAI Workshop on Intelligence and Interaction, Pasadena, CA, July 2009.",
      "doi": ""
    },
    {
      "text": "S. Seuken, D. Charles, M. Chickering, and S. Puri. Market Design and Analysis for a P2P Backup System. In Proceedings of NetEcon, Stanford, CA, July 2009.",
      "doi": ""
    },
    {
      "text": "I. Simon, D. Morris, and S. Basu. Mysong: automatic accompaniment generation for vocal melodies. In Proceedings of CHI, Florence, Italy, April 2008.  ",
      "doi": "10.1145/1357054.1357169"
    }
  ]
}