{
  "doi": "10.1145/1753326.1753641",
  "title": "What's your idea?: a case study of a grassroots innovation pipeline within a large software company",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2065-2074",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Establishing a grassroots innovation pipeline has come to the fore as strategy for nurturing innovation within large organizations. A key element of such pipelines is the use of an idea management system that enables and encourages community ideation on defined business problems. The value of these systems can be highly sensitive to design choices, as different designs may influence participation. We report the results of a case study examining the use of one particular idea management system and pipeline. We analyzed the content, interaction, and participation from three creativity challenges organized via the pipeline and conducted interviews with users to uncover motivations for participating and perceptions of the outcomes. Additional interviews were conducted with senior managers to learn about the objectives, successes, and unique nature of the pipeline. From the results, we formulate recommendations for improving the design of idea management systems and execution of the pipelines within organizations.",
  "tags": [
    "creativity",
    "idea management",
    "innovation",
    "organizations"
  ],
  "authors": [
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    },
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amar, A.D. and J.A. Juneja. A Descriptive Model of Innovation and Creativity in Organizations: A Synthesis of Research and Practice. Knowledge Management Research & Practice, 6 (4), 2008, 298--311.",
      "doi": ""
    },
    {
      "text": "Bjelland, O.M. and R.C. Wood. An Inside View of IBM's 'Innovation Jam'. MIT Sloan Mgmt Review 50 (1), 2008, 31--41.",
      "doi": ""
    },
    {
      "text": "Cosley, D., D. Frankowski, L. Terveen and J. Riedl. Using Intelligent Task Routing and Contribution Review to Help Communities Build Artifacts of Lasting Value. CHI, 2006, 1037--1046.  ",
      "doi": "10.1145/1124772.1124928"
    },
    {
      "text": "Dasgupta, P. and E. Maskin. The Fairest Vote of All. Scientific American, 290 (3), 2004, 92--97.",
      "doi": ""
    },
    {
      "text": "Denning, P.J. The Social Life of Innovation. Communications of the ACM 47 (4), 2004, 15--19.  ",
      "doi": "10.1145/1029496.1029510"
    },
    {
      "text": "Diehl, M. and W. Stroebe. Productivity Loss in Brainstorming Groups: Towards the Solution of a Riddle. Journal of Personality and Social Psychology, 53 (3), 1987, 497--509.",
      "doi": ""
    },
    {
      "text": "Dougherty, D. and C. Hardy. Sustained Product Innovation in Large, Mature Organizations: Overcoming Innovation-to-Organization Problems. Academy of Management Journal, 39 (5), 1996, 1120--1153.",
      "doi": ""
    },
    {
      "text": "Drucker, P. Innovation and Entrepreneurship. Harper Business, 1993.",
      "doi": ""
    },
    {
      "text": "Ehn, P. Scandinavian Design: On Participation and Skill. Schuler, D. and Namioka, A. eds. Participatory Design. Principles and Practices, Lawrence Erlbaum, 1993, 41--77.",
      "doi": ""
    },
    {
      "text": "Farzan, R., J.M. DiMicco, D.R. Millen, C. Dugan, W. Geyer and E.A. Brownholtz. Results from Deploying a Participation Incentive Mechanism within the Enterprise. CHI, 2008, 563--572.  ",
      "doi": "10.1145/1357054.1357145"
    },
    {
      "text": "Hymes, C. and G. Olson. Unblocking Brainstorming through the Use of a Simple Group Editor. CSCW, 1992, 99--106.  ",
      "doi": "10.1145/143457.143467"
    },
    {
      "text": "Josang, A., R. Ismail and C. Boyd. A Survey of Trust and Reputation Systems for Online Service Provision. Decision Support Systems, 43 (2), 2007, 618--644.  ",
      "doi": "10.1016/j.dss.2005.05.019"
    },
    {
      "text": "Kelley, T. The Art of Innovation. Doubleday, New York, 2001.",
      "doi": ""
    },
    {
      "text": "Kittur, A. and R. Kraut. Harnessing the Wisdom of Crowds in Wikipedia: Quality through Coordination. CSCW 2008, 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Krieger, M. and Y.Y. Wang. Ideas2ideas: Encouraging Constructive Ideation in an Online, Mass-Participation Brainstorming System. UIST, Poster session, 2008.",
      "doi": ""
    },
    {
      "text": "Kriplean, T., I. Beschastnikh and D.W. McDonald. Articulations of Wikiwork: Uncovering Valued Work in Wikipedia through Barnstars. CSCW, 2008, 47--56.  ",
      "doi": "10.1145/1460563.1460573"
    },
    {
      "text": "Lampe, C. and P. Resnick. Slash(Dot) and Burn: Distributed Moderation in a Large Online Conversation Space. CHI, 2004, 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Osborn, A.F. Applied Imagination: Principles and Procedures of Creative Problem Solving. Charles Scribner's Sons, New York, NY, 1963.",
      "doi": ""
    },
    {
      "text": "Prante, T., C. Magerkurth and N. Streitz. Developing CSCW Tools for Idea Finding -- Empirical Results and Implications for Design. CSCW, 2002, 106--115.  ",
      "doi": "10.1145/587078.587094"
    },
    {
      "text": "Sandberg, J. Understanding Human Competence at Work: An Interpretive Approach. Academy of Management Journal, 43 (1), 2000, 9--25.",
      "doi": ""
    },
    {
      "text": "Shah, J., N. Vargas-Hernandez, J. Summers and S. Kulkarni. Collaborative Sketching (C-Sketch): An Idea Generation Technique for Engineering Design. Journal of Creative Behavior, 35 (3), 2001, 168--198.",
      "doi": ""
    },
    {
      "text": "Sharmin, M., C. Coats, B.P. Bailey and K. Hamilton. Understanding Knowledge Management Practices for Early Design Activity and Its Implications for Reuse. CHI, 2009, 2367--2376.  ",
      "doi": "10.1145/1518701.1519064"
    },
    {
      "text": "Sorensen, J.B. and T.E. Stuart. Aging, Obsolescence, and Organizational Innovation. Administrative Science Quarterly, 45 (1), 2000, 81--112.",
      "doi": ""
    },
    {
      "text": "Stefik, M., et al. Beyond the Chalkboard: Computer Support for Collaboration and Problem Solving in Meetings. CACM, 30 (1), 1987, 32--47.  ",
      "doi": "10.1145/7885.7887"
    }
  ]
}