{
  "doi": "10.1145/1753326.1753609",
  "title": "Physician-driven management of patient progress notes in an intensive care unit",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1879-1888",
  "year": 2010,
  "badges": [],
  "abstract": "We describe fieldwork in which we studied hospital ICU physicians and their strategies and documentation aids for composing patient progress notes. We then present a clinical documentation prototype, activeNotes, that supports the creation of these notes, using techniques designed based on our fieldwork. ActiveNotes integrates automated, context-sensitive patient data retrieval, and user control of automated data updates and alerts via tagging, into the documentation process. We performed a qualitative study of activeNotes with 15 physicians at the hospital to explore the utility of our information retrieval and tagging techniques. The physicians indicated their desire to use tags for a number of purposes, some of them extensions to what we intended, and others new to us and unexplored in other systems of which we are aware. We discuss the physicians' responses to our prototype and distill several of their proposed uses of tags: to assist in note content management, communication with other clinicians, and care delivery.",
  "authors": [
    {
      "name": "Lauren Wilcox",
      "institution": "Columbia University, New York City, NY, USA",
      "img": "/do/10.1145/contrib-81416600696/rel-imgonly/81416600696.jpeg",
      "acmid": "81416600696",
      "orcid": "0000-0001-6598-1733"
    },
    {
      "name": "Jie Lu",
      "institution": "IBM Research, Hawthorne, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545981856",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Lai",
      "institution": "IBM Research, Hawthorne, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452599499",
      "orcid": "missing"
    },
    {
      "name": "Steven Feiner",
      "institution": "Columbia University, New York City, NY, USA",
      "img": "/do/10.1145/contrib-81100427474/rel-imgonly/feiner02nothumb.png",
      "acmid": "81100427474",
      "orcid": "missing"
    },
    {
      "name": "Desmond Jordan",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100368527",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M., Naaman, M. Why we tag: Motivations for annotation in mobile and online media. Proc. CHI 2007, 971--80.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Ancona, M., Dodero, G., Minuto, F., Guida, M., and Gianuzzi, V. Mobile computing in a hospital: The WARD-IN-HAND project. Proc. ACM Symp Applied Comp, 2 (2000), 554--6.  ",
      "doi": "10.1145/338407.338419"
    },
    {
      "text": "Ash J.S., Gorman, P.N., Lavelle, M, Lyman, J., Delcambre, L.M., Maier, D., Bowers, S., and Weaver, M. Bundles: Meeting clinical information needs. Bull Med Libr Assoc. (2001) Jul;89(3):294--6.",
      "doi": ""
    },
    {
      "text": "Bade, R., Schlechtweg, S., and Miksch, S. Connecting time-oriented data and information to a coherent inter-active visualization. Proc. CHI 2004,105--12.  ",
      "doi": "10.1145/985692.985706"
    },
    {
      "text": "Billman, D., Bier, E. Medical sensemaking with entity workspace. Proc. CHI 2007, 229--32.  ",
      "doi": "10.1145/1240624.1240662"
    },
    {
      "text": "Ebadollahi, S., Coden, A.R., Tanenblatt, M.A., Chang, S., Syeda-Mahmood, T., and Amir, A. Concept-based electronic health records: opportunities and challenges. Proc ACM Multimedia 2006, 997--1006.  ",
      "doi": "10.1145/1180639.1180859"
    },
    {
      "text": "Eclipsys. http://www.eclipsys.com/",
      "doi": ""
    },
    {
      "text": "Embi P.J., Yackel T.R., Logan J.R., Bowen J.L., Cooney T.G., Gorman P.N. Impacts of computerized physician documentation in a teaching hospital: Perceptions of faculty and resident physicians. JAMIA, 11, 9 (2004) 300--9.",
      "doi": ""
    },
    {
      "text": "Flickr. http://www.flickr.com/",
      "doi": ""
    },
    {
      "text": "Frisse, M., Cousins, S., and Hassan, S. WALT: A research environment for medical hypertext. Proc. Hypertext 1991, 389--94.  ",
      "doi": "10.1145/122974.125117"
    },
    {
      "text": "Golovchinsky, G. What the query told the link: The integration of hypertext and information retrieval. Proc. Hypertext 1997, 67--74.  ",
      "doi": "10.1145/267437.267445"
    },
    {
      "text": "Gresh, D., Rabenhorst, D., Shabo, A., and Slavin, S. PRIMA: A case study of using information visualization techniques for patient record analysis. Proc. Visualization 2002, 509--12. ",
      "doi": "10.5555/602099.602182"
    },
    {
      "text": "Haas, J., Bright, T., Bakken, S., Stetson, P., and Johnson, S.B. Clinician perceptions of the usability of eNote. Proc. AMIA Symp. 2005, 973.",
      "doi": ""
    },
    {
      "text": "Ho, D. et al. \"Front-stage\" and \"back-stage\" information. Proc. CHI EA 2008. 3033--38.  ",
      "doi": "10.1145/1358628.1358803"
    },
    {
      "text": "Hripcsak, G., Cimino, J., and Sengupta, S. WebCIS: Large scale deployment of a web-based clinical information system. Proc. AMIA Symp. 1999, 804--8.",
      "doi": ""
    },
    {
      "text": "Hsieh, G., Lai J., Hudson S. and Kraut R., Using tags to assist near-synchronous communication. Proc. CHI 2008, 223--26.  ",
      "doi": "10.1145/1357054.1357093"
    },
    {
      "text": "Hughes, G., Carr, L. Microsoft smart tags: Support, ignore or condemn them? Proc. Hypertext 2002, 80--1.  ",
      "doi": "10.1145/513338.513362"
    },
    {
      "text": "Johnson, S.B., Bakken S., Dine D., Hyun S., Mendonça E., Morrison F., Bright T., Van Vleck T., Wrenn J., and Stetson P. An electronic health record based on structured narrative. JAMIA, 15 (2008), 54--64.",
      "doi": ""
    },
    {
      "text": "Lu, J. and Zhou, M. An interactive, smart notepad for context-sensitive information seeking. Proc. IUI 2009, 127--36.  ",
      "doi": "10.1145/1502650.1502671"
    },
    {
      "text": "Malhotra, S., Jordan, D., Shortliffe, E., and Patel, V. Workflow modeling in critical care: Piecing together your own puzzle. J Biomed Info., 40, 2 (2007), 81--92.  ",
      "doi": "10.1016/j.jbi.2006.06.002"
    },
    {
      "text": "Microsoft Amalga. http://www.microsoft.com/amalga/.",
      "doi": ""
    },
    {
      "text": "Müller, M. Frankewitsch, T., Ganslandt, T., Bürkle, T., and Prokosch, H. The clinical document architecture (CDA) enables electronic medical records to wireless mobile computing. Stud Health Technol Inform., 107, 2 (2004), 1448--52.",
      "doi": ""
    },
    {
      "text": "Payne, T., Graham, G. Managing the life cycle of electronic clinical documents. JAMIA, 13 (2006), 438--44.",
      "doi": ""
    },
    {
      "text": "Plaisant, C., Mushlin, R., Snyder, A., Li, J., Heller, D., and Shneiderman, B. LifeLines: Using visualization to enhance navigation and analysis of patient records. Proc. CHI 1996, 221--27.",
      "doi": ""
    },
    {
      "text": "Pope, C. Conducting ethnography in medical settings. Medical Education, 39, 12 (2005), 1180--7.",
      "doi": ""
    },
    {
      "text": "Practice Partner. http://www.practicepartner.com.",
      "doi": ""
    },
    {
      "text": "Reddy, M., Pratt, W., Dourish, P., and Shabot, M.M. Asking questions: Information needs in a surgical intensive care unit. Proc. AMIA 2002.",
      "doi": ""
    },
    {
      "text": "Reddy, M. and Dourish, P. 2002. A finger on the pulse: Temporal rhythms and information seeking in medical work. Proc. CSCW 2002, 344--53.  ",
      "doi": "10.1145/587078.587126"
    },
    {
      "text": "Rhodes, B. and Starner, T. Remembrance agent: A continuously running information retrieval system. Proc. Conf. Pract. App Intell. Agents, 1996, 487--495.",
      "doi": ""
    },
    {
      "text": "Rosenbloom, S., Grande, J., Geissbuhler, A., and Miller, R. Experience in implementing inpatient clinical note capture via a provider order entry system. JAMIA, 11, 4 (2004) 310--15.",
      "doi": ""
    },
    {
      "text": "Santos-Neto, E., Condon, D., Andrade, N., Iamnitchi, A., and Ripeanu, M. Individual and social behavior in tagging systems. Proc. Hypertext 2009, 183--92.  ",
      "doi": "10.1145/1557914.1557947"
    },
    {
      "text": "Tang, C. and Carpendale, S. An observational study on information flow during nurses' shift work. Proc. CHI 2007, 219--28  ",
      "doi": "10.1145/1240624.1240661"
    },
    {
      "text": "Tang, PH (ed). Key capabilities of an electronic health record system. Washington DC: Institute of Medicine, National Academy Press, 2003.",
      "doi": ""
    },
    {
      "text": "Van Kleek, M.G., Bernstein, M., Panovich, K., Vargas, G.G., Karger, D.R. and Schraefel, M. Note to self: Examining personal information keeping in a lightweight note-taking tool. Proc. CHI 2009, 1477--80.  ",
      "doi": "10.1145/1518701.1518924"
    },
    {
      "text": "VISICU eICU® eCareManager. http://www.visicu.com/ products/evantagesystem.html.",
      "doi": ""
    },
    {
      "text": "Wang, T.D., Plaisant, C., Quinn, A.J., Stanchak, R., Murphy, S. and Shneiderman, B. Aligning temporal data by sentinel events: discovering patterns in electronic health records. Proc. CHI 2008, 457--66.  ",
      "doi": "10.1145/1357054.1357129"
    },
    {
      "text": "WebCIS. https://webcis.nyp.org/.",
      "doi": ""
    },
    {
      "text": "Weir, C., Hurdle, J., Felgar, M., Hoffman, J., Roth, B., and Nebeker, J. Direct text entry in electronic progress notes. An evaluation of input errors. Methods Inf Med., 42, 1 (2003), 61--7.",
      "doi": ""
    },
    {
      "text": "Zhou, M.X., Houck, K., Pan S., Shaw, J., Aggarwal, V. and Wen, Z. Enabling context-sensitive information seeking. Proc. IUI 2006, 112--123.  ",
      "doi": "10.1145/1111449.1111479"
    },
    {
      "text": "Zhou, X., Ackerman, M.S., and Zheng, K. I just don't know why it's gone: Maintaining informal information use in inpatient care. Proc. CHI 2009, 2061--70.  ",
      "doi": "10.1145/1518701.1519014"
    }
  ]
}