{
  "doi": "10.1145/1753326.1753422",
  "title": "Sharing conversation and sharing life: video conferencing in the home",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "655-658",
  "year": 2010,
  "badges": [],
  "abstract": "Video conferencing is a technology that families and friends use to connect with each other over distance. However, even with such technology readily available, we still do not have a good understanding of how video conferencing systems are used by people as a part of their domestic communication practices. For this reason, we have conducted interviews with 21 adults in the United States to understand video conferencing routines in the home and to inform the design of future domestic communication technologies. Our findings illustrate the importance of discerning availability and willingness to video conference prior to calling, the need to share everyday life activities in addition to conversation, and a need for new privacy protecting strategies that focus on autonomy and solitude as opposed to confidentiality.",
  "authors": [
    {
      "name": "Tejinder K. Judge",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655970",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Kodak Research Labs, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    }
  ],
  "references": [
    {
      "text": "Boyle, M., Neustaedter, C., and Greenberg, S. Privacy Factors in Video-based Media Spaces, Media Space: 20+ Years of Mediated Life, Springer (2009).",
      "doi": ""
    },
    {
      "text": "Cicco, L., Mascolo, S., and Palmisano, V. Skype Video Responsiveness to Bandwidth Variations, Proc. NOSSDAV 2008, ACM Press (2008).  ",
      "doi": "10.1145/1496046.1496065"
    },
    {
      "text": "Harrison, S. Media Space: 20+ Years of Mediated Life, Springer (2009). ",
      "doi": "10.5555/1557625"
    },
    {
      "text": "Hindus, D., Mainwaring, S.D., Leduc, N., Hagström, A.E., and Bayley, O. Casablanca: Designing Social Communication Devices for the Home, Proc. CHI 2001, ACM Press (2001), 325--332.  ",
      "doi": "10.1145/365024.383749"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., Rouseel, N., Eiderback, B., Lindquist, S., and Sundblad, Y., Technology Probes: Inspiring Design for and with Families, Proc. CHI 2003, ACM Press (2003),17--25.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Judge, T.K., Neustaedter, C., and Kurtz, A. The Family Window: The Design and Evaluation of a Domestic Media Space, Proc. CHI 2010, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Nardi, B. A., Whittaker, S., and Bradner, E. Interaction and Outeraction: Instant Messaging in Action, Proc. CSCW 2000, ACM Press (2000) 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Noll, A. Anatomy of a failure: picturephone revisited, Telecommunications Policy (1992).",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., Elliot, K., and Greenberg, S. Interpersonal Awareness in the Domestic Realm, Proc. OzCHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1228175.1228182"
    },
    {
      "text": "O'Hara, K., Black, A., and Lipson, M. Media Spaces and Mobile Video Telephony, Media Space: 20+ Years of Mediated Life, Springer (2009), 303--323.",
      "doi": ""
    },
    {
      "text": "Romero, N., Markopoulos, P., van Baren, J., de Ruyter, B., Jsselsteijn, W., and Farshchian, B. Connecting the Family with Awareness Systems, Personal and Ubiquitous Computing, 11, Springer Verlag (2006).  ",
      "doi": "10.1007/s00779-006-0089-0"
    },
    {
      "text": "Schiano, D., Chen, C., Ginsberg, J., Gretarsdotti, U., Huddleston, M., and Issacs, E. Teen Use of Messaging Media, Proc. CHI 2002, ACM Press (2002), 594--595.  ",
      "doi": "10.1145/506443.506500"
    },
    {
      "text": "Tee, K., Brush, A.J.B., and Inkpen, K.M. Exploring Communication and Sharing between Extended families, International Journal of Human-Computer Studies, 67(2), (2009), 128--138.  ",
      "doi": "10.1016/j.ijhcs.2008.09.007"
    }
  ]
}