{
  "doi": "10.1145/1753326.1753469",
  "title": "Share: a programming environment for loosely bound cooperation",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "961-970",
  "year": 2010,
  "badges": [],
  "abstract": "We introduce a programming environment entitled Share that is designed to encourage loosely bound cooperation between individuals within communities of practice through the sharing of code. Loosely bound cooperation refers to the opportunity community members have to assist and share resources with one another while maintaining their autonomy and independent practice. We contrast this model with forms of collaboration that enable large numbers of distributed individuals to collaborate on large scale works where they are guided by a shared vision of what they are collectively trying to achieve. We hypothesize that providing fine-grained, publicly visible attribution of code sharing activity within a community can provide socially motivated encouragement for code sharing. We present an overview of the design of our tool and the objectives that guided its design and a discussion of a small-scale deployment of our prototype among members of a particular community of practice.",
  "tags": [
    "programming",
    "visualization",
    "collaboration",
    "cooperaion",
    "social software",
    "community",
    "open source",
    "computer suppoerted cooperative work"
  ],
  "authors": [
    {
      "name": "Yannick Assogba",
      "institution": "MIT Media Lab, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641673",
      "orcid": "missing"
    },
    {
      "name": "Judith Donath",
      "institution": "Harvard University Berkman Center, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223099",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "arXiv.org e-Print archive. http://arxiv.org/.",
      "doi": ""
    },
    {
      "text": "Apache CouchDB: The CouchDB Project. 2008. http:// couchdb.apache.org/.",
      "doi": ""
    },
    {
      "text": "Delicious. http://delicious.com/.",
      "doi": ""
    },
    {
      "text": "DZone Snippets: Store, sort and share source code, with tag goodness. http://snippets.dzone.com/.",
      "doi": ""
    },
    {
      "text": "Gist -- GitHub. http://gist.github.com/.",
      "doi": ""
    },
    {
      "text": "GitHub.http://github.com/.",
      "doi": ""
    },
    {
      "text": "Apache Lucene -- Overview. 2006. http:// lucene.apache.org/java/docs/.",
      "doi": ""
    },
    {
      "text": "Microsoft Team System. http://msdn.microsoft.com/en-us/teamsystem/default.aspx.",
      "doi": ""
    },
    {
      "text": "NetBeans. http://netbeans.org/.",
      "doi": ""
    },
    {
      "text": "OpenProcessing -- Share Your Sketches! www.openprocessing.org/.",
      "doi": ""
    },
    {
      "text": "Stack Overflow. http://stackoverflow.com/.",
      "doi": ""
    },
    {
      "text": "TrackBack Technical Specification. http:// www.sixapart.com/pronet/docs/trackback_spec.",
      "doi": ""
    },
    {
      "text": "von Ahn, L. and Dabbish, L. Labeling images with a computer game. Proc. 2004 Conference on Human factors in computing systems, ACM Press (2004), 326, 319.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Assogba, Y. Creative Networks: Socio-Technical Tools for Loosely Bound Cooperation. 2009. http://smg.media.mit.edu/papers/yannick/ yannick_assogba_thesis_final.pdf.",
      "doi": ""
    },
    {
      "text": "Benkler, Y. The Wealth of Networks. Yale University Press, 2007.",
      "doi": ""
    },
    {
      "text": "Booch, G. and Brown, A.W. Collaborative development environments. Advances in Computers 59, (2003), 2--29.",
      "doi": ""
    },
    {
      "text": "Cheng, L.-T., Hupfer, S., et al., \"Jazz: a collaborative application development environment,\" ACM SIGPLAN Conference on Object Oriented Programming Systems Languages and Applications, pp. 102--103, Anaheim, CA, USA, 2003.  ",
      "doi": "10.1145/949344.949370"
    },
    {
      "text": "Erickson, T. and Kellogg, W.A. Social translucence: an approach to designing systems that support social processes. ACM Transactions on Computer-Human Interaction (2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Fischer, G. and Ye, Y. Personalizing Delivered Information in a Software Reuse Environment. In Proc. 8th International Conference on User Modeling, (2001), 178--187. ",
      "doi": "10.5555/647664.733392"
    },
    {
      "text": "Ghosh, R.A. Understanding free software developers: Findings from the FLOSS study. Perspectives on free and open source software, (2005), 23--45.",
      "doi": ""
    },
    {
      "text": "Gilbert, E. and Karahalios, K. CodeSaw: A social visualization of distributed software development. Lecture Notes in Computer Science 4663, (2007), 303. ",
      "doi": "10.5555/1778331.1778363"
    },
    {
      "text": "Gutwin, C., Penner, R., and Schneider, K. Group awareness in distributed software development. Proc. 2004 ACM conference on Computer supported cooperative work, (2004), 72--81.  ",
      "doi": "10.1145/1031607.1031621"
    },
    {
      "text": "Heer, J. and Boyd, D. Vizster: Visualizing online social networks. Proc. 2005 IEEE Symposium on Information Visualization, (2005), 33--40.  ",
      "doi": "10.1109/INFOVIS.2005.39"
    },
    {
      "text": "Heer, J., Card, S.K., and Landay, J.A. Prefuse: a toolkit for interactive information visualization. Proc. SIGCHI conference on Human factors in computing systems, (2005), 421--430.  ",
      "doi": "10.1145/1054972.1055031"
    },
    {
      "text": "Hill, W.C., Hollan, J.D., Wroblewski, D., and McCandless, T. Edit wear and read wear. Proc. SIGCHI conference on Human factors in computing systems, (1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Kanefsky, B., Barlow, N.G., and Gulick, V.C. Can Distributed Volunteers Accomplish Massive Data Analysis Tasks. Lunar and Planetary Science XXXII, paper 1272, (2001).",
      "doi": ""
    },
    {
      "text": "Lakhani, K. and Wolf, R. Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects. Perspectives in Free and Open Source Software, MIT Press, Cambridge, MA, (2005).",
      "doi": ""
    },
    {
      "text": "Lerner, J. and Tirole, J. The scope of open source licensing. Journal of Law, Economics, and Organization 21, 1 (2005), 20--56.",
      "doi": ""
    },
    {
      "text": "Maloney, J., Burd, L., Kafai, Y., Rusk, N., Silverman, B., and Resnick, M. Scratch: a Sneak Preview. Proc. Second International Conference on Creating, Connecting and Collaborating through Computing, 2004.  ",
      "doi": "10.5555/1009376.1009408"
    },
    {
      "text": "Monroy-Hernández, A. ScratchR : a platform for sharing user-generated programmable media. 2007. http://dspace.mit.edu/handle/1721.1/42977?show=full.",
      "doi": ""
    },
    {
      "text": "Raymond, E.S. The Cathedral and the Bazaar. O'Reilly Associates, Inc., 1999. ",
      "doi": "10.5555/580808"
    },
    {
      "text": "Reas, C. and Fry, B. Processing: programming for the media arts. AI & Society 20, 4 (2006), 526--538.  ",
      "doi": "10.1007/s00146-006-0050-9"
    },
    {
      "text": "Wash, R. and Rader, E. Public bookmarks and private benefits: An analysis of incentives in social computing. Proc. American Society for Information Science and Technology 44, 1 (2007).",
      "doi": ""
    },
    {
      "text": "Wenger, E. Communities of practice. http:// www.ewenger.com/theory/index.htm.",
      "doi": ""
    },
    {
      "text": "Yee, K. Fisher, D. Dhamija, R. and Hearst, M. Animated Exploration of Dynamic Graphs with Radial Layout. Proc. IEEE Symposium on Information Visualization 2001, IEEE Computer Society (2001), 43. ",
      "doi": "10.5555/580582.857705"
    }
  ]
}