{
  "doi": "10.1145/1753326.1753414",
  "title": "Finger-count & radial-stroke shortcuts: 2 techniques for augmenting linear menus on multi-touch surfaces",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "591-594",
  "year": 2010,
  "badges": [],
  "abstract": "We propose Radial-Stroke and Finger-Count Shortcuts, two techniques aimed at augmenting the menubar on multi-touch surfaces. We designed these multi-finger two-handed interaction techniques in an attempt to overcome the limitations of direct pointing on interactive surfaces, while maintaining compatibility with traditional interaction techniques. While Radial-Stroke Shortcuts exploit the well-known advantages of Radial Strokes, Finger-Count Shortcuts exploit multi-touch by simply counting the number of fingers of each hand in contact with the surface. We report the results of an experimental evaluation of our technique, focusing on expert-mode performance. Finger-Count Shortcuts outperformed Radial-Stroke Shortcuts in terms of both easiness of learning and performance speed.",
  "authors": [
    {
      "name": "Gilles Bailly",
      "institution": "Telecom-Paristech, paris, France",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    },
    {
      "name": "Eric Lecolinet",
      "institution": "Telecom-ParisTech, paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390376",
      "orcid": "0000-0001-8114-1160"
    },
    {
      "name": "Yves Guiard",
      "institution": "Telecom-ParisTech, paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143867",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Appert, C. and Zhai, S. 2009. Using strokes as command shortcuts: cognitive benefits and toolkit support. Proc. CHI'09. ACM Press, 2289--2298.  ",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Beaudouin-Lafon, M. 2004. Designing interaction, not interfaces. Proc. AVI '04, ACM Press, 15--22.  ",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., and DeRose, T. D. 1993. Toolglass and magic lenses: the see-through interface. Proc. SIGGRAPH '93. ACM Press, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Brandl, P., Leitner, J., Seifried, T., Haller, M., Doray, B., and To, P. 2009. Occlusion-aware menu design for digital tabletops. Proc. CHI'09, ACM Press, 3223--3228.  ",
      "doi": "10.1145/1520340.1520461"
    },
    {
      "text": "Dietz, P. and Leigh, D. 2001. DiamondTouch: a multi-user touch technology. Proc. UIST'01, ACM, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Fitts, P. M., and Seeger, C. MS-R Compatibility: Spatial Characteristics of Stimulus and Response Codes. JEP, 1953, 46, 199--210.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G., Baudel, T., Kurtenbach, G., and Buxton, B. 1997. A GUI paradigm using tablets, two-hands and transparency. Proc. CHI '97, ACM, 212--213.  ",
      "doi": "10.1145/1120212.1120348"
    },
    {
      "text": "Guiard, Y. 1987. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior, 19(4), 486--517.",
      "doi": ""
    },
    {
      "text": "Koike, H., Xinlei, C., Nakanishi, Y., Oka, K., and Sato, Y. 2002. Two-handed drawing on augmented desk. Proc. CHI'02, ACM Press, 760--76.  ",
      "doi": "10.1145/506443.506584"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. 1991. Issues in combining marking and direct manipulation techniques. Proc. UIST '91, ACM Press, 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Nacenta, M. A., Baudisch, P., Benko, H., and Wilson, A. 2009. Separability of spatial manipulations in multi-touch interfaces. ACM GI'09, 175--182. ",
      "doi": "10.5555/1555880.1555919"
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G., and Barillot, E. 2000. Control menus: excecution and control in a single interactor. Proc. CHI '00, ACM Press 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Shahzad Malik,S. 2007. An Exploration of Multi-finger Interaction on Multi-touch Surfaces. Ph.D. Thesis. University of Toronto. ",
      "doi": "10.5555/1467540"
    },
    {
      "text": "Shneiderman, B. 1983. Direct Manipulation: A step beyond programming languages, IEEE Computer, 16(8), 57--69.  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Vogel, D., Cudmore, M., Casiez, G., Balakrishnan, R., and Keliher, L. 2009. Hand occlusion with tablet-sized direct pen input. Proc. CHI'09. ACM Press, 557--566.  ",
      "doi": "10.1145/1518701.1518787"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. 2003. Multi-finger and whole hand gestural interaction techniques for multi--user tabletop displays. Proc. UIST'03, ACM, 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Zhao, S. Balakrishnan, R. 2004. Simple vs. compound mark hierarchical marking menus. Proc UIST'04, ACM, 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    },
    {
      "text": "Immersion 2009 http://www.immersion.fr/",
      "doi": ""
    }
  ]
}