{
  "doi": "10.1145/1753326.1753477",
  "title": "End-user mashup programming: through the design lens",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1009-1018",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Programming has recently become more common among ordinary end users of computer systems. We believe that these end-user programmers are not just coders but also designers, in that they interlace making design decisions with coding rather than treating them as two separate phases. To better understand and provide support for the programming and design needs of end users, we propose a design theory-based approach to look at end-user programming. Toward this end, we conducted a think-aloud study with ten end users creating a web mashup. By analyzing users' verbal and behavioral data using Schön's reflection-in-action design model and the notion of ideations from creativity literature, we discovered insights into end-user programmers' problem-solving attempts, successes, and obstacles, with accompanying implications for the design of end-user programming environments for mashups. The contribution of our work is three-fold: 1) the methodology of using a design lens to view programming, 2) evidence, through insights gained, of the usefulness of this approach, and 3) the implications themselves.",
  "tags": [
    "mashups",
    "end-user programming",
    "design"
  ],
  "authors": [
    {
      "name": "Jill Cao",
      "institution": "Oregon State University, Corvallis, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435594157",
      "orcid": "missing"
    },
    {
      "name": "Yann Riche",
      "institution": "Riche Design, Seattle, USA",
      "img": "/do/10.1145/contrib-81363604200/rel-imgonly/ynr.jpg",
      "acmid": "81363604200",
      "orcid": "missing"
    },
    {
      "name": "Susan Wiedenbeck",
      "institution": "Drexel University, Philadelphia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100387125",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Valentina Grigoreanu",
      "institution": "Oregon State University, Microsoft Corporation, Redmond, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319492891",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bandura, A. Self-efficacy: Toward a unifying theory behavioral change. Psychological Review 8, 2 (1977), 191--215.",
      "doi": ""
    },
    {
      "text": "Bayazit N. Investigating design: A review of forty years of design research. Design Issues 20, 1 (2004), 16--29.",
      "doi": ""
    },
    {
      "text": "Beckwith, L. Burnett, M., Wiedenbeck, S., Cook, C., Sorte, S., and Hastings, M. Effectiveness of end-user debugging software features: Are there gender issues? In Proc. CHI 2005, ACM Press (2005), 869--878.  ",
      "doi": "10.1145/1054972.1055094"
    },
    {
      "text": "Beckwith, L., Burnett, M., Grigoreanu, V., and Wieden-beck, S. Gender HCI: What about the software? IEEE Computer 39, 11 (2006), 83--87.  ",
      "doi": "10.1109/MC.2006.382"
    },
    {
      "text": "Boden, M. The Dimensions of Creativity. MIT Press Cambridge, London, England, 1994.",
      "doi": ""
    },
    {
      "text": "Compeau, D. and Higgins, C. Computer self-efficacy: Development of a measure and initial test. MIS Quarterly 19, 2 (1995), 189--211.  ",
      "doi": "10.2307/249688"
    },
    {
      "text": "Do, E. and Gross, M. Inferring design intentions from designers' sketches -- An investigation of freehand drawing conventions in design, In Proc. CAADRIA'97 (1997).",
      "doi": ""
    },
    {
      "text": "Gray, W.D. and Anderson, J.R. Change-episodes in coding: When and how do programmers change their code? Second Workshop on Empirical Studies of Programmers, Ablex Publishing Corp., Norwood, NJ, 1987. ",
      "doi": "10.5555/54968.54980"
    },
    {
      "text": "Grigoreanu, V., Cao, J., Kulesza, T., Bogart, C., Rector, K., Burnett, M., and Wiedenbeck, S., Can feature design reduce the gender gap in end-user software development environments? In Proc. VL/HCC 2008, IEEE (2008), 149--156.  ",
      "doi": "10.1109/VLHCC.2008.4639077"
    },
    {
      "text": "Guilford, J.P. Intelligence, Creativity and Their Educational Implications. Robert R. Knapp, San Diego, CA, 1968.",
      "doi": ""
    },
    {
      "text": "Guindon, R. Designing the design process: Exploiting opportunistic thoughts. Human-Computer Interaction 5, 2 (1990), 305--344.  ",
      "doi": "10.1207/s15327051hci0502%25263_6"
    },
    {
      "text": "Hartmann, B., Yu, L., Allison, A., Yang, Y., and Klemmer, S. Design as exploration: Creating interface alternatives through parallel authoring and runtime tuning. In Proc. UIST 2008, ACM Press (2008), 91--100.  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Jeffries, R., Turner, A.A., Polson, P.G., and Atwood, M.E. The processes involved in designing software. In Cognitive Skills and their Acquisition, Anderson, J.R. (Ed.), Lawrence Erlbaum Associates, Hillsdale, NJ, 1981, 255--283.",
      "doi": ""
    },
    {
      "text": "Herring, S., Chang, C., Krantzler, J., and Bailey, B.P., Getting inspired! Understanding how and why examples are used in creative design practice. In Proc. CHI 2009, ACM Press (2009), 87--96.  ",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Kannengiesser, U. and Zhu, L. An ontologically-based evaluation of software design methods, The Knowledge Engineering Review 24, 1 (2009), 41--58.  ",
      "doi": "10.1017/S0269888909000113"
    },
    {
      "text": "Ko, A.J., Myers, B., and Aung, H. Six learning barriers in end-user programming systems. In Proc. VL/HCC 2004, IEEE Computer Society (2004), 199--206.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Landay, J.A. and Myers, B.A., Sketching interfaces: Toward more human interface design, IEEE Computer 34, 3(2001), 56--64.  ",
      "doi": "10.1109/2.910894"
    },
    {
      "text": "Milgram, R.M. Creativity: An idea whose time has come and gone, in Theories of Creativity. Mark, R.A. and Robert, A.S. (Ed.). Sage Publications, London, UK, 1990.",
      "doi": ""
    },
    {
      "text": "Myers, B., Park, S.Y., Nakano, Y., Mueller, and G., Ko, A. How designers design and program interactive behaviors. In Proc. VL/HCC 2008, IEEE (2008), 177--184.  ",
      "doi": "10.1109/VLHCC.2008.4639081"
    },
    {
      "text": "Nardi, B. A Small Matter of Programming: Perspectives on End-User Computing. MIT Press, Cambridge, MA, 1993. ",
      "doi": "10.5555/160165"
    },
    {
      "text": "Rist, R.S. Knowledge creation and retrieval in program design: A comparison of novice and intermediate student programmers. Human-Computer Interaction 6, 1 (1991), 1--46.  ",
      "doi": "10.1207/s15327051hci0601_1"
    },
    {
      "text": "Rode, J. and Rosson M.B. Programming at runtime: Requirements and paradigms for nonprogrammers' web application development. In Proc. VL/HCC 2003, IEEE (2003), 23--30. ",
      "doi": "10.5555/1153917.1153962"
    },
    {
      "text": "Rosson, M.B., Sinha, H., Bhattacharya, M., Zhao, D. Design planning in end-user web development, In Proc. VL/HCC, IEEE (2007).  ",
      "doi": "10.1109/VLHCC.2007.17"
    },
    {
      "text": "Rowe, M.B. Teaching Science as Continuous Inquiry (2nd. Ed.), McGraw-Hill, New York, NY, 1978.",
      "doi": ""
    },
    {
      "text": "Runco, M.A. Creativity Theories and Themes: Research, Development, and Practice. Elsevier Academic Press, Burlington, MA, 2007.",
      "doi": ""
    },
    {
      "text": "Schön, D.A., The Reflective Practitioner: How Professionals Think in Action. Basic Books, New York, NY, 1983.",
      "doi": ""
    },
    {
      "text": "Simpson, M. and Viller, S. Observing architectural design: Improving the development of collaborative design environments. In Proc. CDDVE'04 (2004).",
      "doi": ""
    },
    {
      "text": "Sommerville, I. Software Engineering (8th Ed.), Pearson Education Limited, Harlow, England 2006.",
      "doi": ""
    },
    {
      "text": "Terry, M., Mynatt, E., Nakakoji, K., and Yamamoto, Y. Variation in element and action: Supporting simultaneous development of alternative solutions. In Proc. CHI 2004, ACM Press (2004), 711--718.  ",
      "doi": "10.1145/985692.985782"
    },
    {
      "text": "Visser, W. Organization of design activities: Opportunistic, with hierarchical episodes. Interacting with Computers 6, 3 (1994), 239--274.",
      "doi": ""
    },
    {
      "text": "Visser, W. Designing as construction of representations: a dynamic viewpoint in cognitive design research. Human-Computer Interaction 21, 1 (2006), 103--152",
      "doi": ""
    },
    {
      "text": "Wong, J. and Hong, J.I. Making mashups with marmite: Towards end-user programming for the web. In Proc. CHI 2007, ACM Press (2007), 1435--1444.  ",
      "doi": "10.1145/1240624.1240842"
    }
  ]
}