{
  "doi": "10.1145/1753326.1753661",
  "title": "Multi-touch techniques for exploring large-scale 3D astrophysical simulations",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2213-2222",
  "year": 2010,
  "badges": [],
  "abstract": "Enabling efficient exploration of large-scale virtual environments such as those simulating astrophysical environments is highly challenging. Astrophysical virtual worlds span exceptionally large spatial scales occupied mostly by empty space, and this makes it difficult for the user to comprehend the spatial context during exploratory navigation. Public exhibits, where novice users have little experience using complicated virtual navigation interfaces, pose additional challenges. To address these issues, we propose multi-touch techniques to deliver an effective interface to navigate the unique features of large-scale 3D environments such as astrophysical simulations. In this work, we carefully study conventional multi-touch methods and adapt them to the practical requirements of this application. A novel technique called the powers-of-ten ladder is introduced to support efficient movement across huge spatial scales using multi-touch interactions. We also investigate user experiences with various multi-touch finger gestures on our prototype digital planetarium.",
  "authors": [
    {
      "name": "Chi-Wing Fu",
      "institution": "Nanyang Technological University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244740",
      "orcid": "missing"
    },
    {
      "name": "Wooi-Boon Goh",
      "institution": "Nanyang Technological University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100489363",
      "orcid": "missing"
    },
    {
      "name": "Junxiang Allen Ng",
      "institution": "Nanyang Technological University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646782",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple's iPhone, 2007. http://www.apple.com/iphone",
      "doi": ""
    },
    {
      "text": "Microsoft Surface, 2007. SIGGRAPH 2007 Emerging Technologies.",
      "doi": ""
    },
    {
      "text": "G. Bell, R. Carey, and C. Marrin. The Virtual Reality Modeling Language (VRML), version 2.0, 1996.",
      "doi": ""
    },
    {
      "text": "H. Benko, A. D. Wilson, and P. Baudisch. Precise selection techniques for multi-touch screens. CHI '06: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 1263--1272, 2006.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "G. Blasko and S. Feiner. Single-handed interaction techniques for multiple pressure-sensitive strips. CHI '04 extended abstracts on Human factors in computing systems, pages 1461--1464, 2004.  ",
      "doi": "10.1145/985921.986090"
    },
    {
      "text": "B. Buxton. Multitouch systems that I have known and loved, 2008. http://www.billbuxton.com/multitouchOverview.html.",
      "doi": ""
    },
    {
      "text": "W. Buxton, R. Hill, and P. Rowley. Issues and techniques in touch-sensitive tablet input. Proceedings of SIGGRAPH 85, pages 215--224, 1985.  ",
      "doi": "10.1145/325334.325239"
    },
    {
      "text": "C. and R. Eames. Powers of Ten, 1977. 9 1/2 minute film, made for IBM.",
      "doi": ""
    },
    {
      "text": "S.H.-H. Chang, L. Stuart, B. Plimmer, and B. Wunsche. Origami simulator: a multi-touch experience. CHI extended abstracts 2009, pages 3889--3894, 2009.  ",
      "doi": "10.1145/1520340.1520589"
    },
    {
      "text": "R.P. Darken. Wayfinding in large-scale virtual worlds. CHI '95: Conference companion on Human factors in computing systems, pages 45--46, 1995.  ",
      "doi": "10.1145/223355.223419"
    },
    {
      "text": "J.-B. de la Riviere, C. Kervegant, E. Orvain, and N. Dittlo. CubTile: a multi-touch cubic interface. Proceedings of the 2008 ACM symposium on Virtual Reality Software and Technology, pages 69--72, 2008.  ",
      "doi": "10.1145/1450579.1450593"
    },
    {
      "text": "P. Dietz and D. Leigh. DiamondTouch: A multi-user touch technology. UIST '01: ACM symposium on User Interface Software and Technology, pages 219--226, 2001.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "J. Edelmann, A. Schilling, and S. Fleck. The DabR -- a multitouch system for intuitive 3D scene navigation. 3DTV Conference: The True Vision -- Capture, Transmission and Display of 3D Video, pages 1--4, 2009.",
      "doi": ""
    },
    {
      "text": "J. Eden. Designing for multi-touch, multi-user and gesture-based systems, 2009. http://www.ddj.com/architect/216402697.",
      "doi": ""
    },
    {
      "text": "A. Esenther, C. Forlines, K. Ryall, and S. Shipman. DiamondTouch SDK: Support for multi-user, multi-touch applications, 2002. http://www.merl.com/projects/dtsdk/.",
      "doi": ""
    },
    {
      "text": "A. Esenther and K. Wittenburg. Multi-user multi-touch games on DiamondTouch with the DTFlash toolkit. Intelligent Technologies for Interactive Entertainment (INTETAIN), Nov 2005. MERL Report: TR2005-105.  ",
      "doi": "10.1007/11590323_42"
    },
    {
      "text": "European Space Agency. The Hipparcos and Tycho Catalogues, ESA SP-1200, 1997. Available at http://www.rssd.esa.int/Hipparcos/catalog.html.",
      "doi": ""
    },
    {
      "text": "G.W. Fitzmaurice, H. Ishii, and W. Buxton. Bricks: Laying the foundations for graspable user interfaces. CHI '95: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 442--449, 1995.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "C. Forlines and C. Shen. DTLens: multi-user tabletop spatial data exploration. UIST '05: ACM symposium on User Interface Software and Technology, pages 119--122, 2005.  ",
      "doi": "10.1145/1095034.1095055"
    },
    {
      "text": "C.-W. Fu and A.J. Hanson. A transparently scalable visualization architecture for exploring the universe. IEEE Transactions on Visualization and Computer Graphics, 13(1):108--121, 2007.  ",
      "doi": "10.1109/TVCG.2007.2"
    },
    {
      "text": "T. Grossman, D. Wigdor, and R. Balakrishnan. Multi-finger gestural interaction with 3D volumetric displays. UIST '04: ACM symposium on User Interface Software and Technology, pages 61--70, 2004.  ",
      "doi": "10.1145/1029632.1029644"
    },
    {
      "text": "J.Y. Han. Low-cost multi-touch sensing through frustrated total internal reflection. UIST '05: ACM symposium on User Interface Software and Technology, pages 115--118, 2005.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "A.J. Hanson. The rolling ball. In D. Kirk, editor, Graphics Gems III, pages 51--60. Academic Press, Cambridge, MA, 1992. ",
      "doi": "10.5555/130745.130757"
    },
    {
      "text": "T. Igarashi, T. Moscovich, and J.F. Hughes. As-rigid-as-possible shape manipulation. ACM Transactions on Computer Graphics, 24(3):1134--1141, 2005. ACM SIGGRAPH 2005.  ",
      "doi": "10.1145/1073204.1073323"
    },
    {
      "text": "Jet Propulsion Laboratory, NASA. Planetary data system, 2003. Website: http://pds.jpl.nasa.gov.",
      "doi": ""
    },
    {
      "text": "Y. Jung, J. Keil, J. Behr, S. Webel, M. Zollner, T. Engelke, H. Wuest, and M. Becker. Adapting X3D for multi-touch environments. Web3D '08: Proceedings of the 13th international symposium on 3D web technology, pages 27--30, 2008.  ",
      "doi": "10.1145/1394209.1394218"
    },
    {
      "text": "J.-S. Kim, D. Gracanin, K. Matkovic, and F. Quek. iPhone/iPod touch as input devices for navigation in immersive virtual environments. IEEE Virtual Reality 2009, pages 261--262, 2009.  ",
      "doi": "10.1109/VR.2009.4811045"
    },
    {
      "text": "S. Lee, W. Buxton, and K.C. Smith. A multi-touch three dimensional touch-sensitive tablet. SIGCHI Bulletin, 16(4):21--25, 1985.  ",
      "doi": "10.1145/1165385.317461"
    },
    {
      "text": "A. Leganchuk, S. Zhai, and W. Buxton. Manual and cognitive benefits of two-handed input: an experimental study. ACM Transactions on Human-Computer Interaction, 5(4):326--359, 1998.  ",
      "doi": "10.1145/300520.300522"
    },
    {
      "text": "Y. Li, C.-W. Fu, and A.J. Hanson. Scalable WIM: Effective exploration in large-scale astrophysical environments. IEEE Transactions on Visualization and Computer Graphics, 12(5):1005--1012, 2006.  ",
      "doi": "10.1109/TVCG.2006.176"
    },
    {
      "text": "N. Mehta. A flexible machine interface. Master's thesis, Dept. of Electrical Eng., University of Toronto, 1982.",
      "doi": ""
    },
    {
      "text": "T. Moscovich. Multi-touch interaction. CHI '06 extended abstracts on Human factors in computing systems, pages 1775--1778, 2006.  ",
      "doi": "10.1145/1125451.1125786"
    },
    {
      "text": "NUI Group Community. Community Core Vision (CCV) software, 2008. Website: http://ccv.nuigroup.com/.",
      "doi": ""
    },
    {
      "text": "R. Pausch, T. Burnette, D. Brockway, and M.E. Weiblen. Navigation and locomotion in virtual worlds via flight into hand-held miniatures. SIGGRAPH '95 Proceedings, pages 399--400, 1995.  ",
      "doi": "10.1145/218380.218495"
    },
    {
      "text": "P. Peltonen, E. Kurvinen, A. Salovaara, G. Jacucci, T. Ilmonen, J. Evans, A. Oulasvirta, and P. Saarikko. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. CHI '08: Proceedings of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, pages 1285--1294, 2008.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "M.A.C. Perryman et al (editor). The Hipparcos and Tycho Catalogues. ESA Publications Division, The Netherlands, 1997.",
      "doi": ""
    },
    {
      "text": "J.S. Pierce and R. Pausch. Navigation with place representations and visible landmarks. IEEE Virtual Reality '04, pages 173--180, 2004.  ",
      "doi": "10.5555/1009389.1010387"
    },
    {
      "text": "J.L. Reisman, P.L. Davidson, and J.Y. Han. A screen-space formulation for 2D and 3D direct manipulation. UIST '09: ACM symposium on User Interface Software and Technology, pages 69--78, 2009.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "J. Rekimoto. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. CHI '02: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 113--120, 2002.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "F. Steinicke, K.H. Hinrichs, J. Schoning, and A. Kruger. Multi-touching 3D data: Towards direct interaction in stereoscopic display environments coupled with mobile devices. Advanced Visual Interfaces (AVI) Workshop on Designing Multi-Touch Interaction Techniques for Coupled Public and Private Displays, pages 46--49, 2008.",
      "doi": ""
    },
    {
      "text": "R. Stoakley, M.J. Conway, and R. Pausch. Virtual reality on a WIM: interactive worlds in miniature. CHI 95': Proceedings of the SIGCHI conference on Human factors in computing systems, pages 265--272, 1995.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "F. Wang, X. Cao, X. Ren, and P. Irani. Detecting and leveraging finger orientation for interaction with direct-touch surfaces. UIST 09': ACM symposium on User Interface Software and Technology, pages 23--32, 2009.  ",
      "doi": "10.1145/1622176.1622182"
    },
    {
      "text": "F. Wang and X. Ren. Empirical evaluation for finger input properties in multi-touch interaction. CHI '09: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 1063--1072, 2009.  ",
      "doi": "10.1145/1518701.1518864"
    },
    {
      "text": "P. Wellner. The DigitalDesk Calculator: Tangile manipulation on a desk top display. UIST '91: ACM symposium on User Interface Software and Technology, pages 27--33, 1991.  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "W. Westerman, J.G. Elias, and A. Hedge. Multi-touch: A new tactile 2-D gesture interface for human-computer interaction. Proceedings of the Human Factors and Ergonomics Society 45th Annual Meeting, pages 632--636, 2001.",
      "doi": ""
    },
    {
      "text": "M. Wu and R. Balakrishnan. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. UIST 03': ACM symposium on User Interface Software and Technology, pages 193--202, 2003.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "W. Yee. Potential limitations of multi-touch gesture vocabulary: Differentiation, adoption, fatigue. HCI (2), Lecture Notes in Computer Science, pages 291--300. Springer, 2009.  ",
      "doi": "10.1007/978-3-642-02577-8_32"
    }
  ]
}