{
  "doi": "10.1145/1753326.1753520",
  "title": "Homeless young people's experiences with information systems: life and work in a community technology center",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1291-1300",
  "year": 2010,
  "badges": [],
  "abstract": "This paper explores how homeless young people, aged 13-25, make use of information systems in daily life. Observed in a community technology center, four different examples of uses are described: i) Using digital tools to find employment, ii) Telling stories with representations of the built world, iii) Portraying life on the street with video, and iv) Constructing online identities. From these examples and a discussion of this community, a framework of ecological considerations is proposed. This framework distinguishes between elements of 'life' on the street (Self-Reliance, Vulnerability, and Basic Needs) and 'work' in the community technology center (Conformity, Youth-Adult Relationships, and Goals). Any information system for homeless young people must engage the tensions and opportunities that arise from these two different perspectives of homelessness.",
  "tags": [
    "identity",
    "youth",
    "homelessness",
    "digital media"
  ],
  "authors": [
    {
      "name": "Jill Palzkill Woelfer",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81435608664/rel-imgonly/resize_img_2697_fulbright1.jpg",
      "acmid": "81435608664",
      "orcid": "missing"
    },
    {
      "name": "David G. Hendry",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100622591",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D. and Mynatt, E.D. Chartering past, present and future research in ubiquitous computing. ACM Transactions on Computer-Human Interaction, 7, 1 (March 2000), 29--58.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Ackermann, E., Decortis, F., Hourcade, J.P. and Schelhowe, H. Cultural coding and decoding as ways of participation: Digital media for marginalized young people. In Proc. IDC 2009, ACM Press (2009), 294--297.  ",
      "doi": "10.1145/1551788.1551864"
    },
    {
      "text": "Armaline, W.T. Kids need structure: Negotiating rules, power and social control in an emergency youth shelter. American Behavioral Scientist, 48, 8 (2005), 1124--1148.",
      "doi": ""
    },
    {
      "text": "Barry, P.J., Ensign, J. and Lippek, S.H. Embracing street culture: Fitting health care into the lives of street youth. J. of Transcultural Nursing 13, (2002), 145--152.",
      "doi": ""
    },
    {
      "text": "Bell, G. and Dourish, P. Yesterday's tomorrows: Notes on ubiquitous computing's dominant vision. Personal and Ubiquitous Computing, 11, 2 (Jan 2007), 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Bender, K., Ferguson, K., Pollio, D., Thompson, S. and McClendon, J. Technology as an underutilized tool for providing health services and support to street youth. Presentation at 137th American Public Health Association, (2009). Abstract at http://apha.confex.com/ apha/137am/webprogram/Paper199105.html",
      "doi": ""
    },
    {
      "text": "boyd, d. Why Youth (heart) Social Network Sites: The Role of Networked Publics in Teenage Social Life. In Youth, Identity, and Digital Media. MIT Press, 2008, 119--142.",
      "doi": ""
    },
    {
      "text": "Casey Family Programs. Learning Plan: Life Skills Guidebook Quick Start Instructions. www.caseylifeskills.org/pages/lp/lp_quick_start.htm",
      "doi": ""
    },
    {
      "text": "Dvorak, P. On the street and on Facebook: The homeless stay wired. The Wall Street Journal, A1, May 30, 2009.",
      "doi": ""
    },
    {
      "text": "Ensign, J. and Bell, M. Illness experiences of homeless youth. Qualitative Health Research, 14, (2004), 1239--1254.",
      "doi": ""
    },
    {
      "text": "Friedman, B., Kahn, P.H., Jr., Hagman, J., Severson, R.L. and Gill, B. The watcher and the watched: Social judgments about privacy in a public place. Human-Computer Interaction, 21, (2006), 235--272.  ",
      "doi": "10.1207/s15327051hci2102_3"
    },
    {
      "text": "Finley, S. The faces of dignity: Rethinking the politics of homelessness and poverty in America. Qualitative Studies in Education, 16, 4 (2003), 509--531.",
      "doi": ""
    },
    {
      "text": "Gilbert, E. and Karahalios, K. Predicting tie strength with social media. In Proc. CHI 2009. ACM Press (2009), 211--220.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Goffman, E. Stigma: Notes on the management of spoiled identity. Simon & Schuster, New York, 1963.",
      "doi": ""
    },
    {
      "text": "Grudin, J. The computer reaches out: The historical continuity of interface design. In Proc. CHI 1990. ACM Press (1990), 261--268.  ",
      "doi": "10.1145/97243.97284"
    },
    {
      "text": "Hersberger, J. Are the economically poor information poor? Does the digital divide affect homelessness and access to information? Canadian Journal of Information and Library Science 27, 3 (2002), 45--63.",
      "doi": ""
    },
    {
      "text": "Horst, H.A. Families. In Hanging Out, Messing Around, and Geeking Out, M. Ito (Ed.). MIT Press, 2010, 149--194.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C. and Edwards, W. K. Designs on dignity: Perceptions of technology use among the homeless. In Proc. CHI 2008, ACM Press (2008), 627--636.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Livingstone, S. Taking risky opportunities in youthful content creation: Teenagers' use of social networking sites for intimacy, privacy, and self expression. New Media & Society, 10 (2008), 393--411.",
      "doi": ""
    },
    {
      "text": "Moser, M. A. Text \"Superpowers\": A study of computers in homeless shelters. Science, Technology & Human Values (February 2009), 1--36.",
      "doi": ""
    },
    {
      "text": "Pinkett, R.D. The Creating Community Connections Project: Social and Cultural Approaches for Engaging Low-Income Communities. In Universal Usability: Designing Computer Interfaces for Diverse User Populations, J. Lazar (Ed.). John Wiley and Sons, West Sussex, England, 2007, 457--490.",
      "doi": ""
    },
    {
      "text": "Reed, A. 'My Blog is Me': Texts and persons in UK online journal culture (and Anthropology). Ethnos, 70 (June 2005), 220--242.",
      "doi": ""
    },
    {
      "text": "Resnick. M., Rusk, N. and Cooke, S. The Computer Clubhouse: Technological Fluency in the Inner City. In High Technology for Low-Income Communities, D.A. Schön, B. Sanyal, and W.J. Mitchell (Eds.) MIT Press, 1999, 263--286.",
      "doi": ""
    },
    {
      "text": "Rosenblum, D. What anyone can know: The privacy risks of social networking sites, Security & Privacy, 5, 3 (May-June 2007), 40--49.  ",
      "doi": "10.1109/MSP.2007.75"
    },
    {
      "text": "Schön, D.A., Sanyal, B. and Mitchell, W.J. High Technology for Low-Income Communities. MIT Press, 1999.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Universal usability. Communications of the ACM, 43, 5 (May 2000), 84--91.  ",
      "doi": "10.1145/332833.332843"
    },
    {
      "text": "Slesnick, N., Glassman, M., Garren, R., Toviesse, P., Bantchevska, D. and Dashora, P. How to open and sustain a drop-in center for homeless youth, Children and Youth Services Review, 30, 7 (July 2008), 727--734.",
      "doi": ""
    },
    {
      "text": "Spradley, J.P. You Owe Yourself a Drunk: An Ethnography of Urban Nomads. Little, Brown and Company, Boston, MA, 1970.",
      "doi": ""
    },
    {
      "text": "Steinfield, C., Ellison, N. and Lampe, C. Social capital, self-esteem, and use of online social network sites: A longitudinal analysis. Journal of Applied Developmental Psychology, 29 (2008), 434--445.",
      "doi": ""
    },
    {
      "text": "Subrahmanyam, K., Reich, S.M., Waechter, N. and Espinoza, G. Online and offline social networks: Use of social networking sites by emerging adults. Journal of Applied Developmental Psychology, 29 (2008), 420--433.",
      "doi": ""
    },
    {
      "text": "Urbina, I. Recession drives surge in youth runaways. The New York Times, A1, Oct 26, 2009.",
      "doi": ""
    },
    {
      "text": "Wiener, N. The Human Use of Human Beings. A Da Capo Paperback, New York, 1950/1954.",
      "doi": ""
    },
    {
      "text": "Wingert, S., Higgitt, N. and Ristock, J. Voices from the margins: Understanding street youth in Winnipeg. Canadian Journal of Urban Research, 14, 1 (2005), 54--80.",
      "doi": ""
    },
    {
      "text": "Woelfer J.P., Yeung, M.W.-M., Erdmann, C.G. and Hendry, D.G. Value considerations in an information ecology: Printed materials, service providers and homeless young people. In Proc. AM 2008, ASIST (2008), 248--256.",
      "doi": ""
    },
    {
      "text": "Woelfer, J.P. and Hendry, D.G. Stabilizing homeless young people with information and place. Journal of the American Society for Information Science and Technology, 60, 11 (2009), 2300--2312.  ",
      "doi": "10.5555/1656289.1656295"
    }
  ]
}