{
  "doi": "10.1145/1753326.1753673",
  "title": "High accuracy position and orientation detection in two-dimensional communication network",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2297-2306",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we describe a method of high accuracy device position and orientation detection for HCI environments. Our position and orientation detection is an additional function to the Two-Dimensional Communication technology, which enables devices placed on a thin sheet to achieve two key functions for ubiquitous computing, to communicate one another and to receive electricity through the sheet wirelessly. This paper discusses the method developed to specify the positions and orientation of devices placed on the sheet. It evaluates the accuracy of obtained position and orientation through an experiment using a prototype of our positioning sensor.",
  "tags": [
    "two-dimensional communication (2dc)",
    "ubiquitous computing",
    "device localization",
    "capacitance sensing",
    "surface-like device"
  ],
  "authors": [
    {
      "name": "Kei Nakatsuma",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421601844",
      "orcid": "missing"
    },
    {
      "name": "Hiroyuki Shinoda",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100555829",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anoto. http://www.anoto.com/",
      "doi": ""
    },
    {
      "text": "Bahl, P., Padmanabhan, V.N., RADAR: An in-building RF-based user location and tracking system. In Proc. of INFOCOM 2000, 775--784.",
      "doi": ""
    },
    {
      "text": "Broxton, M., Lifton, J., and Paradiso, J.A. Localization on the pushpin computing sensor network using spectral graph drawing and mesh relaxation. SIGMOBILE Mobile Computing Communications Review, 10, 1 ACM Press (2006), 1--12.  ",
      "doi": "10.1145/1119759.1119760"
    },
    {
      "text": "Dietz, P. and Leigh, D. DiamondTouch: a multi-user touch technology. In Proc. of UIST 2001, ACM Press (2001), 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Hoffmann, F. and Scott, J. Location of mobile devices using networked surfaces. In Proc. of UbiComp 2002, Springer (2002), 281--298. ",
      "doi": "10.5555/647988.741498"
    },
    {
      "text": "Kishino, Y., Terada, T., Villar, N., Gellersen, H., and Nishio, S. A position detection mechanism enabling location-aware Pin&Play. In International Journal of Smart Home, 1, 1, (2007), 31--39.",
      "doi": ""
    },
    {
      "text": "Kurakake, R., Nishizawa, Y., Sakakura, K., Ouchi, H., Minami, M. and Morikawa, H. Magic surfaces: A smart building material for indoor sensing infrastructures. In Proc. of INSS 2007, 213--220.",
      "doi": ""
    },
    {
      "text": "Leitner, J., Brandl, P., Seifried, T., Haller, I., Yun, K., Woo, W., Sugimoto, M. and Inami, M. IncreTable, bridging the gap between real and virtual worlds. In SIGGRAPH 2008 new tech demos, ACM Press (2008).  ",
      "doi": "10.1145/1401615.1401634"
    },
    {
      "text": "Lifton, J., Seetharam, D., Broxton, M., and Paradiso, J.A. Pushpin computing system overview: a platform for distributed, embedded, ubiquitous sensor networks. In Proceedings of Pervasive 2002, (2002), 139--151. ",
      "doi": "10.5555/646867.706692"
    },
    {
      "text": "Microsoft Surface. http://www.microsoft.com/surface/",
      "doi": ""
    },
    {
      "text": "Nakatsuma, K., Makino, Y. and Shinoda, H. Position sensing based on electric field measurement on Two-Dimensional Signal Transmission Sheet. In Proc. of INSS 2008, 189--194.",
      "doi": ""
    },
    {
      "text": "Patel, S.N., Truong, K.N. and Abowd, G.D. PowerLine positioning: a practical sub-room-level indoor location system for domestic use. In Proc. of UbiComp 2006, Springer (2006), 441--458.  ",
      "doi": "10.1007/11853565_26"
    },
    {
      "text": "Priyantha, N.B., Chakraborty, A., and Balakrishnan, H. The Cricket location-support system. In Proc. of MobiCom 2000. ACM Press (2000), 32--43.  ",
      "doi": "10.1145/345910.345917"
    },
    {
      "text": "Rekimoto, J., Ullmer, B. and Oba, H. DataTiles: a modular platform for mixed physical and graphical interactions. In Proc. of CHI 2001, ACM Press (2001), 269--276.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "Scott, J., Hoffmann, F., Addlesee, M., Mapp, G. and Hopper, A. Networked surfaces: a new concept in mobile networking. Mobile Networks and Applications, 7, 5, ACM Press (2002), 353--364.  ",
      "doi": "10.1023/A%3A1016539632660"
    },
    {
      "text": "Shinoda, H., Makino, Y., Yamahira, N. and Itai, H. Surface sensor network using inductive signal transmission layer. In Proc. of INSS 2007, 201--206.",
      "doi": ""
    },
    {
      "text": "Van Laerhoven, K., Villar, N., Schmidt, A., Gellersen, H.-W., Hakansson, M. and Holmquist, L.E. Pin&Play: the surface as network medium. In IEEE Communications Magazine, 41, 4, (2002), 90--95.  ",
      "doi": "10.1109/MCOM.2003.1193980"
    },
    {
      "text": "Want, R., Hopper, A., Falcão, V., and Gibbons, J. The active badge location system. ACM Trans. Inf. Syst. 10, 1, ACM Press (1992), 91--102.  ",
      "doi": "10.1145/128756.128759"
    },
    {
      "text": "Ward, A., Jones, A., Hopper, A. A new location technique for the active office, IEEE Personal Communications, 4, 5, (1997), 42--47.",
      "doi": ""
    }
  ]
}