{
  "doi": "10.1145/1753326.1753590",
  "title": "The role of community and groupware in geocache creation and maintenance",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1757-1766",
  "year": 2010,
  "badges": [],
  "abstract": "Applications that provide location-based experiences are an increasingly viable design space given the proliferation of GPS-enabled mobile devices. However, these applications are in their infancy, and we do not yet know what design factors will contribute to their success. For this reason, we have studied the well-established location-based experience of geocaching. We report on the results of a survey of geocachers along with observations from our own in-depth geocaching activities. Our findings illustrate that geocaching permits users to create a range of experiences for others within a permeable yet restricted culture of norms. Once created, geocaches are maintained by the community of geocachers through a well-designed groupware system. Here maintenance acts can be performed \"in the small,\" given their lightweight and well-defined nature, and become less about maintenance and more about personal participation. These findings provide insight into how community and groupware can be leveraged to support applications for location-based experiences.",
  "authors": [
    {
      "name": "Carman Neustaedter",
      "institution": "Kodak Research Labs, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Tejinder Judge",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657408",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benford, S., Crabtree, A., Flintham, M., Drozd, A., Anastasi, R., and Paxton, M. Can You See Me Now? ACM ToCHI, Vol. 13, No. 1, March (2006), 100--133.  ",
      "doi": "10.1145/1143518.1143522"
    },
    {
      "text": "Benford, S., Crabtree, A., Reeves, S., Flintham, M., Drozd, A., Sheridan, J., and Dix, A. The Frame of the Game: Blurring the Boundary between Fiction and Reality, Proc. CHI 2006, ACM Press (2006), 427--436.  ",
      "doi": "10.1145/1124772.1124836"
    },
    {
      "text": "BrightKite, http://brightkite.com/",
      "doi": ""
    },
    {
      "text": "Butler, B., Joyce, E., and Pike, J. Don't Look Now, But We've Created a Bureaucracy: The Nature and Roles of Policies and Rules in Wikipedia, Proc. CHI 2008, ACM Press (2008), 1101--1110.  ",
      "doi": "10.1145/1357054.1357227"
    },
    {
      "text": "Chavez, D.J., Courtright, R., and Schneider, I. Over the River and through the Woods, Parks & Recreation, 39, 4 (2004), 68--72.",
      "doi": ""
    },
    {
      "text": "Chavez, D.J., Schneider, I., and Powell, T. The Social Psychology of a Technology Driven Outdoor Trend: Geocaching in the USA, Proc. HICSS 2004, ACM Press (2004).",
      "doi": ""
    },
    {
      "text": "Darkslide, http://connectedflow.com/darkslide/",
      "doi": ""
    },
    {
      "text": "Geocaching, http://geocaching.com",
      "doi": ""
    },
    {
      "text": "Grudin, J. Groupware and Social Dynamics: Eight Challenges for Developers, Communications of the ACM, 37, 1, ACM Press (2004), 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Kelley, M.A. Local Treasures: Geocaching across America. Santa Fe: Center for American Places (2006).",
      "doi": ""
    },
    {
      "text": "Kittur, A., and Kraut, R. Harnessing the Wisdom of Crowds in Wikipedia: Quality through Coordination, Proc. CSCW 2008, ACM Press (2008), 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Kuznetsov, S. Motivations of Contributors to Wikipedia, Proc. SIGCAS 2006, 36, 2, ACM Press (2006).  ",
      "doi": "10.1145/1215942.1215943"
    },
    {
      "text": "Loopt, http://www.loopt.com/",
      "doi": ""
    },
    {
      "text": "Ludford, P., Frankowski, D., Reily, K., Wilms, K., and Terveen, L. Because I Carry My Cell Phone Anyway: Functional Location-Based Reminder Applications, Proc. CHI 2006, ACM Press (2006), 889--898.  ",
      "doi": "10.1145/1124772.1124903"
    },
    {
      "text": "Ludford, P., Priedhorsky, R, Reily, K., and Terveen, L., Capturing, Sharing, and Using Local Place Information, Proc. CHI 2007, ACM Press (2007), 1235--1244.  ",
      "doi": "10.1145/1240624.1240811"
    },
    {
      "text": "O'Hara, K. Understanding Geocaching Practices and Motivations, Proc. CHI 2008, ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "O'Hara, K., Kindberg, T., Glancy, M., Baptista, L., Sukumaran, B., Kahana, Gil., and Rowbotham, J. Social Practices in Location-Based Collecting, Proc. CHI 2007, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240810"
    },
    {
      "text": "Putnam, R. Bowling Alone,Simon and Schuster (2000).",
      "doi": ""
    },
    {
      "text": "Reily, K., Ludford, P., and Terveen, L. Sharescape: An Interface for Place Annotation, Proc. NordiCHI 2008, ACM Press (2008).  ",
      "doi": "10.1145/1463160.1463196"
    },
    {
      "text": "Salovaara, A., Johnson, M., Toiskallio, K., Tiitta, S., and Turpeinen, M. Playmakers in Multiplayer Game Communities, Proc. ACE 2005, ACM Press (2005).  ",
      "doi": "10.1145/1178477.1178540"
    },
    {
      "text": "Strauss, A. and Corbin, J. Basics of Qualitative Research, 2nd Edition. Chapter 8, Open Coding, Sage Publications (1998).",
      "doi": ""
    }
  ]
}