{
  "doi": "10.1145/1753326.1753547",
  "title": "A simple index for multimodal flexibility",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1475-1484",
  "year": 2010,
  "badges": [],
  "abstract": "Most interactive tasks engage more than one of the user's exteroceptive senses and are therefore multimodal. In real world situations with multitasking and distractions, the key aspect of multimodality is not which modalities can be allocated to the interactive task but which are free to be allocated to something else. We present the multi¬modal flexibility index (MFI), calculated from changes in users' performance induced by blocking of sensory modalities. A high score indicates that the highest level of performance is achievable regardless of the modalities available and, conversely, a low score that performance will be severely hampered unless all modalities are allocated to the task. Various derivatives describe unimodal and bimodal effects. Results from a case study (mobile text entry) illustrate how an interface that is superior to others in absolute terms is the worst from the multimodal flexibility perspective. We discuss the suitability of MFI for evaluation of interactive prototypes.",
  "tags": [
    "attention",
    "modality allocation",
    "multitasking",
    "mobile human-computer interaction",
    "multimodal interaction"
  ],
  "authors": [
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University and University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Joanna Bergstrom-Lehtovirta",
      "institution": "Aalto University and University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81453655512/rel-imgonly/blogpic_joanna.png",
      "acmid": "81453655512",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baber, C., and Mellor, B. Using critical path analysis to model multimodal human-computer interaction. International Journal of Human-Computer Studies 54, 4 (2001), 613--636.  ",
      "doi": "10.1006/ijhc.2000.0452"
    },
    {
      "text": "Bertelson, P., and de Gelder, B. The psychology of multimodal perception. In: Crossmodal Space and Crossmodal Attention (2004), 141--177.",
      "doi": ""
    },
    {
      "text": "Brewster, S., Lumsden, J., Bell, M., Hall, M., and Tasker, S. Multimodal \"eyes-free' interaction techniques for wearable devices. Proc. CHI2003, ACM Press (2003), New York, pp. 473--480.  ",
      "doi": "10.1145/642611.642694"
    },
    {
      "text": "Briem, V., and Hedman, L. Behavioural effects of mobile telephone use during simulated driving. Ergonomics 38, 12 (1995), 2536--2562.",
      "doi": ""
    },
    {
      "text": "Brumby, D., Howes, A., and Salvucci, D. A cognitive constraint model of dual-task trade-offs in a highly dynamic driving task. Proc. CHI2007, ACM Press (2007), New York, pp. 233--242.  ",
      "doi": "10.1145/1240624.1240664"
    },
    {
      "text": "Burke, J., Prewett, M., Gray, A., Yang, L., Stilson, F., Coovert, M., Elliot, L., and Redden, E. Comparing the effects of visual-auditory and visual-tactile feedback on user performance: A meta-analysis. Proc. ICMI2006, ACM Press (2006), New York, pp. 108--117.  ",
      "doi": "10.1145/1180995.1181017"
    },
    {
      "text": "Cashdan, S. and Zung, B.J. Effect of sensory modality and delay on form recognition. Journal of Experimental Psychology 86, 3 (1970), 458.",
      "doi": ""
    },
    {
      "text": "Cohen, M.R., and Nagel, E. Logic and Scientific Method. Harcourt Brace Jovanovich (1934), New York.",
      "doi": ""
    },
    {
      "text": "Colquhoun, W. Evaluation of auditory, visual, and dual mode displays for prolonged sonar monitoring in repeated sessions. Human Factors 17, 5 (1975), 425.",
      "doi": ""
    },
    {
      "text": "Driver, J., and Spence, C. Cross-modal links in spatial attention. Philosophical Transactions: Biological Sciences 353, 1373 (1998), 1319--1331.",
      "doi": ""
    },
    {
      "text": "Gray, W., and Boehm-Davis, D. Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology Applied 6, 4 (2000), 322--335.",
      "doi": ""
    },
    {
      "text": "Hoggan, E., Brewster, S., and Johnston, J. Investigating the effectiveness of tactile feedback for mobile touchscreens. Proc. CHI2008, ACM Press (2008), New York, pp. 1573--1582  ",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "Hoggan, E., Raisamo, R., and Brewster, S. Mapping information to audio and tactile icons. Proc. ICMI2009, ACM Press (2009), New York.  ",
      "doi": "10.1145/1647314.1647382"
    },
    {
      "text": "Isokoski, P., and Linden, T. Effect of foreign language on text transcription performance: Finns writing English. Proc. NordiCHI2004, ACM Press (2004), New York, pp. 109--112.  ",
      "doi": "10.1145/1028014.1028032"
    },
    {
      "text": "Jacko, J., Barnard, L., Kongnakorn, T., Moloney, K., Edwards, P., Emery, V., and Sainfort, F. Isolating the effects of visual impairment: Exploring the effect of AMD on the utility of multimodal feedback. Proc. CHI2004, ACM Press (2004), New York, pp. 311--318.  ",
      "doi": "10.1145/985692.985732"
    },
    {
      "text": "Jaimes, A., and Sebe, N. Multimodal human-computer interaction: A survey. Computer Vision and Image Understanding 108, 1-2 (2007), 116--134.  ",
      "doi": "10.1016/j.cviu.2006.10.019"
    },
    {
      "text": "Kane, S., Wobbrock, J., and Smith, I. Getting off the treadmill: Evaluating walking user interfaces for mobile devices in public spaces. Proc. MobileHCI, ACM Press (2008), New York, pp. 109--118.  ",
      "doi": "10.1145/1409240.1409253"
    },
    {
      "text": "Kieras, D., and Meyer, D. An overview of the EPIC architecture for cognition and performance with application to human-computer interaction. Human-Computer Interaction 12, 4 (1997), 391--438.  ",
      "doi": "10.1207/s15327051hci1204_4"
    },
    {
      "text": "Lee, J., and Spence, C. Assessing the benefits of multimodal feedback on dual-task performance under demanding conditions. Proc. BritishHCI2008, British Computer Society (2008), Swindon, UK, 185--192. ",
      "doi": "10.5555/1531514.1531540"
    },
    {
      "text": "Levenshtein, V. Binary codes capable of correcting deletions, insertions and reversals. Soviet Physics Doklady 10, 8 (1966), 707--710.",
      "doi": ""
    },
    {
      "text": "Liu, Y. Comparative study of the effects of auditory, visual and multimodality displays on drivers' performance in advanced traveller information systems. Ergonomics 44, 4 (2001), 425--442.",
      "doi": ""
    },
    {
      "text": "Lyons, K., Starner, T., Plaisted, D., Fusia, J., Lyons, A., Drew, A., and Looney, E. Twiddler typing: One-handed chording text entry for mobile phones. Proc. CHI2004, ACM Press (2004), New York, pp. 671--678.  ",
      "doi": "10.1145/985692.985777"
    },
    {
      "text": "MacKenzie, I. Motor behaviour models for human-computer interaction. In J. Carroll (ed.), HCI Models, Theories, and Frameworks: Toward a Multidisciplinary Science. Morgan Kaufmann (2003), San Francisco, 27--54.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I., and Soukoreff, R. Phrase sets for evaluating text entry techniques. Proc. CHI2003, ACM Press (2003), New York, pp. 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Mizobuchi, S., Chignell, M., and Newton, D. Mobile text entry: Relationship between walking speed and text input task difficulty. Proc. MobileHCI2005, ACM Press (2005), New York, pp. 122--128.  ",
      "doi": "10.1145/1085777.1085798"
    },
    {
      "text": "Nigay, L., and Coutaz, J. A design space for multimodal systems: Concurrent processing and data fusion. Proc. CHI1993, ACM Press (1993), New York, 172--178.  ",
      "doi": "10.1145/169059.169143"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V., and Kuorelahti, J. Interaction in 4-second bursts: The fragmented nature of attentional resources in mobile HCI. Proc. CHI2005, ACM Press (2005), New York, pp. 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Oviatt, S. Multimodal interfaces: The human-computer interaction. In A. Sears, J. Jacko (eds.), Human-Computer Interaction Handbook, Lawrence Erlbaum (2003), New York, 286--304. ",
      "doi": "10.5555/772072.772093"
    },
    {
      "text": "Pashler, H. The Psychology of Attention. MIT Press (1999), Boston.",
      "doi": ""
    },
    {
      "text": "Perakakis, M., and Potamianos, A. Multimodal system evaluation using modality efficiency and synergy metrics. Proc. ICMI2008, ACM Press (2008), New York, pp. 9--16.  ",
      "doi": "10.1145/1452392.1452397"
    },
    {
      "text": "Posner, M. Chronometric Explorations of Mind. Erlbaum (1978), Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Rockwell, T. Skills, judgment and information acquisition in driving. Human Factors in Highway Traffic Safety Research, Wiley (1972), New York, 133--164.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. A multitasking general executive for compound continuous tasks. Cognitive Science 29, 3 (2005), 457--492.",
      "doi": ""
    },
    {
      "text": "Senders, J.W., Kristofferson, A.B., Levison, W.H., Dietrich, C.W., and Ward, J. L. The attentional demand of automobile driving. Highway Research Record #195. National Academy of Sciences, Transportation Research Board (1967), Washington, DC, 15--33.",
      "doi": ""
    },
    {
      "text": "Sivak, M. The information that drivers use: Is it indeed 90% visual? Perception, 25, 9 (1996), 1081--1090.",
      "doi": ""
    },
    {
      "text": "Wickens, C. Multiple resources and performance prediction. Theoretical Issues in Ergonomics Science 3, 2 (2002), 159--177.",
      "doi": ""
    }
  ]
}