{
  "doi": "10.1145/1753326.1753468",
  "title": "Tools-at-hand and learning in multi-session, collaborative search",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "951-960",
  "year": 2010,
  "badges": [],
  "abstract": "Improving search interfaces and algorithms are major foci of HCI and information retrieval (IR) research respectively. However, less attention has been given to understanding how users collect, manage, organize, and share the results they find from conducting searches on the Web and designing tools to support their needs. In this paper, we present results from a study in which we interviewed 30 people in three cohorts (academic researchers, corporate workers, and people looking for medical information) about their current practices conducting, managing, and sharing information from on-going, exploratory searches. We report results on users' current practices, tool use, areas of difficulties and associated coping strategies with emphasis on how information seekers use a variety of \"tools-at-hand\" beyond search engines and web browsers as they search, process, and share results, and on the learning processes that occur as they seek and use information over time.",
  "authors": [
    {
      "name": "Robert Capra",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/do/10.1145/contrib-81100419460/rel-imgonly/rob-new-facebook-sm.jpg",
      "acmid": "81100419460",
      "orcid": "missing"
    },
    {
      "name": "Gary Marchionini",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/do/10.1145/contrib-81100052406/rel-imgonly/icadl01bwcropped.jpg",
      "acmid": "81100052406",
      "orcid": "missing"
    },
    {
      "name": "Javier Velasco-Martin",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657378",
      "orcid": "missing"
    },
    {
      "name": "Katrina Muller",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641208",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aula, A., Jhaveri, N., Käki, M. (2005). Information Search and Re-access Strategies of Experienced Web Users, In Proc. WWW 2005, Chiba, Japan, 583--592.  ",
      "doi": "10.1145/1060745.1060831"
    },
    {
      "text": "Bates, M. (1989). The Design of Browsing and Berrypicking Techniques for the Online Search Interface. Online Review, 13, 407--424.",
      "doi": ""
    },
    {
      "text": "Belkin, N., Oddy, R., and Brooks, H. (1982). ASK for information retrieval: Part 1: Background and Theory. Journal of Documentation, 38(2), 61--71.",
      "doi": ""
    },
    {
      "text": "Capra, R., and Pérez-Quiñones, M.A. (2005). Using Web Search Engines to Find and Refind Information. IEEE Computer 38(10): 36--42.  ",
      "doi": "10.1109/MC.2005.355"
    },
    {
      "text": "Dumais, S., Cutrell, E., Cadiz, J., Jancke, G., Sarin, R., and Robbins, D. C. (2003). Stuff I've Seen: A System for Personal Information Retrieval and Re-Use. In Proc. SIGIR 2003. ACM Press, 72--79.  ",
      "doi": "10.1145/860435.860451"
    },
    {
      "text": "Erickson, T. (2006). From PIM to GIM: Personal Information Management in Group Contexts. Communications of the ACM, 49, 1 (Jan. 2006), 74--75.  ",
      "doi": "10.1145/1107458.1107495"
    },
    {
      "text": "Evans, B. M. and Chi, E. H. 2008. Towards a Model of Understanding Social Search. In Proc. CSCW '08, ACM Press, 485--494.  ",
      "doi": "10.1145/1460563.1460641"
    },
    {
      "text": "Fox, S. (2006). Online Health Search 2006. Pew Internet and American Life Project. Accessed January 8, 2010: http://www.pewinternet.org/~/media//Files/ Reports/2006/PIP_Online_Health_2006.pdf.pdf",
      "doi": ""
    },
    {
      "text": "Golovchinsky, G., Qvarfordt, P., and Pickens, J. (2009). Collaborative Information Seeking. IEEE Computer 42(3), 47--51.  ",
      "doi": "10.1109/MC.2009.73"
    },
    {
      "text": "Jones, W., Bruce, H., and Dumais, S. (2001). Keeping Found Things Found on the Web. In Proc. CIKM 2001, ACM Press, 119--134.  ",
      "doi": "10.1145/502585.502607"
    },
    {
      "text": "Jones, W. (2007). Keeping Found Things Found: The Study and Practice of Personal Information Management. San Francisco: Morgan Kaufmann. ",
      "doi": "10.5555/2155696"
    },
    {
      "text": "Jones, W. (2007). \"How People Keep and Oragnize Information\". In Jones, W., and Teevan, J. (Eds.), Personal Information Management. Seattle: University of Washington Press.",
      "doi": ""
    },
    {
      "text": "Kellar, M., Watters, C., and Inkpen, K. M. (2007). An Exploration of Web-Based Monitoring: Implications for Design. In Proc. CHI 2007, ACM Press, 377--386.  ",
      "doi": "10.1145/1240624.1240686"
    },
    {
      "text": "Kulthau, C. (1991). Inside the Search Process: Information Seeking from the User's Perspective.\" Journal of the American Society for Information Science 42(5), 361--371.",
      "doi": ""
    },
    {
      "text": "MacKay, B. and Watters, C. (2008) Exploring Multi-Session Web Tasks. Proc. CHI '08, ACM, 1187--1196.  ",
      "doi": "10.1145/1357054.1357243"
    },
    {
      "text": "Marchionini, G. (1995). Information Seeking in Electronic Environments. Cambridge University Press, New York, NY. ",
      "doi": "10.5555/206740"
    },
    {
      "text": "Marchionini, G. 2006. Exploratory Search: From Finding to Understanding. CACM 49(4): 41--46.  ",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Morris, D., Morris, M. R., and Venolia, G. 2008. SearchBar: A Search-Centric Web History for Task Resumption and Information Re--finding. In Proc. CHI '08. ACM Press, 1207--1216.  ",
      "doi": "10.1145/1357054.1357242"
    },
    {
      "text": "Morris, M. R. (2008). A Survey of Collaborative Web Search Practices. In Proc. CHI '08. ACM, 1657--1660.  ",
      "doi": "10.1145/1357054.1357312"
    },
    {
      "text": "Morris, M. R., and Horvitz, E. (2007). SearchTogether: An Interface for Collaborative Web Search. In Proc of UIST 2007, 3--10.  ",
      "doi": "10.1145/1294211.1294215"
    },
    {
      "text": "Norman, D. (1998). The Invisible Computer. Cambriege, MA: MIT Press. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Pickens, J., Golovchinsky, G., Shah, C., Qvarfordt, P., and Back, M. (2008). Algorithmic mediation for collaborative exploratory search. In Proc. SIGIR 2008. ACM Press, 315--322.  ",
      "doi": "10.1145/1390334.1390389"
    },
    {
      "text": "Pirolli, P. (2007). Information foraging theory: Adaptive interaction with information. Oxford: Oxford Univ. Press. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Quintana, C., Krajcik, J., and Soloway, E. (2002). A Case Study to Distill Structural Scaffolding Guidelines for Scaffolded Software Environments. In Proc. CHI 2002. ACM Press, 81--88.  ",
      "doi": "10.1145/503376.503392"
    },
    {
      "text": "Schwartz, K., Roe, T., Northrup, J., Meza, J., Seifeldin, R., and Neale, V. (2006). J Am Board of Fam. Medicine 19: 39--45.",
      "doi": ""
    },
    {
      "text": "Spink, A. (1996). Multiple Search Sessions Model of End-User Behavior: An Exploratory Study. JASIS 47(8): 603--609.  ",
      "doi": "10.1002/%28SICI%291097-4571%28199608%2947%3A8%253C603%3A%3AAID-ASI4%253E3.3.CO%3B2-U"
    },
    {
      "text": "Toms, E. and Latter, C. (2007). Health Informatics J 13(3): 223--235.",
      "doi": ""
    },
    {
      "text": "Twidale, M. B., Nichols, D. M., & Paice, C. D. (1997). Browsing is a Collaborative Process. Information Processing and Management 33 (6), 761--783.  ",
      "doi": "10.1016/S0306-4573%2897%2900040-X"
    },
    {
      "text": "White, R. and Roth, R. (2009). Exploratory search: Beyond the Query-Response Paradigm. San Francisco: Morgan & Claypool. ",
      "doi": "10.5555/1521589"
    }
  ]
}