{
  "doi": "10.1145/1753326.1753509",
  "title": "Negotiating boundaries: managing disease at home",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1223-1232",
  "year": 2010,
  "badges": [],
  "abstract": "To move treatment successfully from the hospital to that of technology assisted self-care at home, it is vital in the design of such technologies to understand the setting in which the health IT should be used. Based on qualitative studies we find that people engage in elaborate boundary work to maintain the order of the home when managing disease and adopting new healthcare technology. In our analysis we relate this boundary work to two continuums of visibility-invisibility and integration-segmentation in disease management. We explore five factors that affect the boundary work: objects, activities, places, character of disease, and collaboration. Furthermore, the processes are explored of how boundary objects move between social worlds pushing and shaping boundaries. From this we discuss design implications for future healthcare technologies for the home.",
  "authors": [
    {
      "name": "Rikke Aarhus",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655329",
      "orcid": "missing"
    },
    {
      "name": "Stinne Aaløkke Ballegaard",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350573331",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aarhus, R., Ballegaard, S.A., Hansen, T.R. (2009) The eDiary: Bridging home and hospital through healthcare technology. Proceedings of eCSCW'09, Vienna, Austria.",
      "doi": ""
    },
    {
      "text": "Angus, J. et al (2005) The personal significance of home: habitus and the experience of receiving long-term home care, Sociology of Health and Illness Vol. 27, no. 2: 161--187.",
      "doi": ""
    },
    {
      "text": "Bardram, J., Bossen, C. (2005) Mobility Work: The Spatial Dimension of Collaboration at a Hospital, Computer Supported Cooperative Work 14:131--160.  ",
      "doi": "10.1007/s10606-005-0989-y"
    },
    {
      "text": "Berg, M. (1999) Accumulating and Coordinating: Occasions for Information Technologies in Medical Work, Computer Supported Cooperative Work, Vol. 8, no. 4:373--401.  ",
      "doi": "10.1023/A%3A1008757115404"
    },
    {
      "text": "Bossen, C. (2006) Representations at work: a national standard for electronic health records Proceedings of CSCW '06, Banff, Canada.  ",
      "doi": "10.1145/1180875.1180887"
    },
    {
      "text": "Brown, S. et al (2004) Care in the community, BT Technology Journal, vol. 22, no. 3:56--64.  ",
      "doi": "10.1023/B%3ABTTJ.0000047120.60489.7a"
    },
    {
      "text": "Ciolfi, L., Fitzpatrick, G., Bannon, L. (2008) Settings for Collaboration: the Role of Place. Computer Supported Cooperative Work Vol. 17:91--96.  ",
      "doi": "10.1007/s10606-007-9074-z"
    },
    {
      "text": "Davis, R., Wagner, E., Groves, T. (1999) Managing chronic disease. BMJ 318:1090--1.",
      "doi": ""
    },
    {
      "text": "Dewey, J. (1984). The quest for certainty. In: Boydston (ed.) John Dewey: The Latter Works, 1925--1953. vol. 4: 1929. Carbondale: University of Southern Illinois Press.",
      "doi": ""
    },
    {
      "text": "Douglas, M. (1966) Purity and danger: an analysis of concepts of pollution and taboo. Routledge & Keagan Paul: London.",
      "doi": ""
    },
    {
      "text": "Edwards, K., Grinter, R. (2001) At home with ubiquitous computing: seven challenges, Proceedings of the Conference on Ubiquitous Computing, 256--272. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Emerson, R., Fretz, R, Shaw L. (1995) Writing ethnographic fieldnotes. The University of Chicago Press: Chicago and London.",
      "doi": ""
    },
    {
      "text": "Estroff, S.E. (1993) Identity, Disability, and Schizophrenia. The Problem of Chronicity. In: Lindenbaum & Lock (eds.) Knowledge, Power and Practice. University of California Press: Berkeley.",
      "doi": ""
    },
    {
      "text": "Forlizzi, J., DiSalvo, C., Gemperle, F. (2004) Assistive robotics and an ecology of elders living independently in their homes. Human-Computer Interaction, Vol. 19, Issue 1:25--59.  ",
      "doi": "10.1207/s15327051hci1901%25262_3"
    },
    {
      "text": "Grøn, L., Meinert, L., Mattingly, C. (2008) Kronisk hjemmearbejde. Sociale håb, dilemmaer og konflikter i et hjemmearbejdsnarrativ i Uganda, Danmark og USA. (Chronic Homework. Social hopes, dilemmas and conflicts in Homework narratives in Uganda, Denmark, and US) Tidsskrift for Forskning i Sygdom og Samfund (The Journal for Research in Sickness and Society). 9: 71--95.",
      "doi": ""
    },
    {
      "text": "Hacking, I. (1991) The Making and Molding of Child Abuse. Critical inquiry, 17 (winter): 253--288.",
      "doi": ""
    },
    {
      "text": "Ihde, D. (1990) Technology and the Lifeworld: From Garden to Earth. Bloomington: Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Kientz, J. et al (2007) Grow and Know: Understanding Record-Keeping Needs for Tracking the Development of Young Children. Proceedings of CHI '07:1351--1360.  ",
      "doi": "10.1145/1240624.1240830"
    },
    {
      "text": "Larsen. J.A. (2005) Becoming mentally ill: Existential Crisis and the Social Negotiation of identity. In: Steffen et al (eds.) Managing Uncertainty. Ethnographic Studies of Illness, Risk and the Struggle for Control. Museum Tusculanum: Copenhagen.",
      "doi": ""
    },
    {
      "text": "Lee, C (2007) Boundary Negotiating Artifacts: Unbinding the routine of Boundary Objects and Embracing Chaos in Collaborative Work. Computer Supported Cooperative Work Vol.16: 307--339.  ",
      "doi": "10.1007/s10606-007-9044-5"
    },
    {
      "text": "2Lindahl, B., Sandman, P., Rasmussen, B. (2003) Meanings of living at home on a ventilator. Nursing Inquiry Vol. 10, no. 1: 19--27.",
      "doi": ""
    },
    {
      "text": "2Lutters, W.G., Ackerman, M.S. (2007) Beyond Boundary Objects: Collaborative Reuse in Aircraft Technical Support Computer Supported Cooperative Work Vol 16:341--372.  ",
      "doi": "10.1007/s10606-006-9036-x"
    },
    {
      "text": "Mamykina, L., Mynatt, E., Davidson, P., and Greenblatt, D. (2008) 'MAHI: investigation of social scaffolding for reflective thinking in diabetes management', Proceedings of CHI '08: 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Mateas, M., Salvador, T, Scholtz, J, Sorensen, D. (1996). Engineering Ethnography in the Home. Proceedings of CHI´96. Montreal, Canada.  ",
      "doi": "10.1145/257089.257323"
    },
    {
      "text": "Muur-Veeman, I. Eijkelberg, I. Spreeuwenberg, C. (2001) A discussion of the role of power, culture and structure in the development of shared care arrangements. Journal of Management in Medicine, vol. 15: 142--55.",
      "doi": ""
    },
    {
      "text": "Nippert-Eng, C.E. (1996) Home and work. Negotiating boundaries through everyday life. The university of Chicago Press: Chicago.",
      "doi": ""
    },
    {
      "text": "Nilsson, M., Hertzum, M. (2005) Negotiated rhythms of mobile work: time, place, and work schedules, Proceedings of GROUP '05, Florida, USA, pp 148--157.  ",
      "doi": "10.1145/1099203.1099233"
    },
    {
      "text": "Palen, L., Aaløkke, S. (2006) Of Pillboxes and Piano Benches: \"Home Made\" Methods for Managing Medication. Proceedings of CSCW'06, Banff, Canada.  ",
      "doi": "10.1145/1180875.1180888"
    },
    {
      "text": "Pinelle, D., Gutwin, C. (2003) Designing for loose coupling in mobile groups, Proceedings GROUP'03, Florida, USA: 75--84.  ",
      "doi": "10.1145/958160.958173"
    },
    {
      "text": "Pope, C, Mays, N. (eds.) (1996) Qualitative research in health care. Blackwell Publishing, BMJ Books: Oxford.",
      "doi": ""
    },
    {
      "text": "Rowan, J., Mynatt, E. D. (2005). Digital Family Portrait Field Trial: Support for Aging in Place. Proceedings of CHI05: 521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Star, S. L., Griesemer, J. R. (1989) Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkley's Museum of Vertebrate Zoology, 1907--39. Social Studies of Science Vol. 19: 387--420.",
      "doi": ""
    },
    {
      "text": "Strauss, A. L., et al (1985) Social organization of medical work. The University of Chicago Press: Chicago and London.",
      "doi": ""
    },
    {
      "text": "Tap, H. (2001) \"You mean here?\" -- Video-mediated nurse-patient communication. Proceedings from IFIP Interact01: HCI: 124--131. Tokyo, Japan.",
      "doi": ""
    },
    {
      "text": "Toussaint, P., Berg, M. (2000) The electronic patient record as an organizational artifact, Strategies for healthcare information systems, pp. 76--89. ",
      "doi": "10.5555/373168.373207"
    },
    {
      "text": "Wagner, E. et al. (2001) Quality improvement in chronic illness care: a collaborative approach. The Joint Commission Journal on Quality Improvement 27:63--80.",
      "doi": ""
    }
  ]
}