{
  "doi": "10.1145/1753326.1753513",
  "title": "Don't just stare at me!",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1241-1250",
  "year": 2010,
  "badges": [],
  "abstract": "Communication is more effective and persuasive when participants establish rapport. Tickle-Degnen and Rosenthal [57] argue rapport arises when participants exhibit mutual attentiveness, positivity and coordination. In this paper, we investigate how these factors relate to perceptions of rapport when users interact via avatars in virtual worlds. In this study, participants told a story to what they believed was the avatar of another participant. In fact, the avatar was a computer program that systematically manipulated levels of attentiveness, positivity and coordination. In contrast to Tickel-Degnen and Rosenthal's findings, high-levels of mutual attentiveness alone can dramatically lower perceptions of rapport in avatar communication. Indeed, an agent that attempted to maximize mutual attention performed as poorly as an agent that was designed to convey boredom. Adding positivity and coordination to mutual attentiveness, on the other hand, greatly improved rapport. This work unveils the dependencies between components of rapport and informs the design of agents and avatars in computer mediated communication.",
  "authors": [
    {
      "name": "Ning Wang",
      "institution": "University of Southern California, Marina del Rey, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384615081",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Gratch",
      "institution": "University of Southern California, Marina del Rey, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322494423",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M. Bodily Communication (Second Edition). Routledge, Oxford, 1988.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Cook, M. Gaze and Mutual Gaze. Cambridge University Press, Cambridge, 1976.",
      "doi": ""
    },
    {
      "text": "Bailenson, J.N., Yee, N., Blascovich, J., Beall, A.C., Lundblad, N., and Jin, M. The use of immersive virtual reality in the learning sciences: Digital transformations of teachers, students, and social context. The Journal of the Learning Sciences, (2008) 17, 102--141.",
      "doi": ""
    },
    {
      "text": "Beebe, S.A. Effects of eye contact, posture and vocal inflection upon credibility and comprehension. Australian SCAN: Jounal of Human Communication, (1980) 7-8, 57--70",
      "doi": ""
    },
    {
      "text": "Bevacqua, E., Mancini, M. and Pelachaud, C. A listening agent exhibiting variable behaviour, in 8th International Conference on Intelligent Virtual Agents, (Tokyo, 2008), Springer, 262--269.  ",
      "doi": "10.1007/978-3-540-85483-8_27"
    },
    {
      "text": "Bavelas, J.B., Coates, L. and Johnson, T. Listener responses as a collaborative process: The role of gaze. Journal of Communication, (2002) 52, 566--580",
      "doi": ""
    },
    {
      "text": "Bente, G., Eschenburg, F. and Aelker, L. Effects of simulated gaze on social presence, person perception and personality attribution in avatar-mediated communication, in 10th Annual International Workshop on Presence, (Barcelona, 2007)",
      "doi": ""
    },
    {
      "text": "Beskow, J. Animation of talking agents., in Proceedings of the ESCA Workshop on Audio-Visual Speech Processing, (1997) 149--152.",
      "doi": ""
    },
    {
      "text": "Blizzard: http://www.wow.com",
      "doi": ""
    },
    {
      "text": "Burgoon, J.K., Coker, D.A., and Coker, R.A. Communicative effects of gaze behavior: A test of two contrasting explanations. Human Communication Research, 1986 (12), 495--524.",
      "doi": ""
    },
    {
      "text": "Burns, M., Rapport and relationships: The basis of child care. Journal of Child Care, 1984. 2, 47--57.",
      "doi": ""
    },
    {
      "text": "Cassell, J., Bickmore, T.W., Billinghurst, M., Campbell, L., Chang, K., Vilhjalmsson, H.H., and Yan, H. Embodiment in Conversational Interfaces: Rea. In Proceedings of Computer Human Interaction, 1999, 520--527.  ",
      "doi": "10.1145/302979.303150"
    },
    {
      "text": "Cassell, J. & Miller, P. Is it self-administration if the computer gives you encouraging looks? In Conrad, F.G. & Schober, M.F. Eds. Envisioning the Survey Interview of the Future, Wiley, Hoboken, NJ, 2008, 161--178.",
      "doi": ""
    },
    {
      "text": "Cassell, J., Torres, O. and Prevost, S. Turn Taking vs. Discourse Structure: How Best to Model Multimodal Conversation. In Wilks, I., editor, Machine Conversations. Kluwer, The Hague, 1999.",
      "doi": ""
    },
    {
      "text": "Chartrand, T.L., and Bargh, J.A. The chameleon effect: The perception-behavior link and social interaction. Journal of Personality and Social Psychology, (1999) 76, 893--910.",
      "doi": ""
    },
    {
      "text": "Cheek, J.M., The Revised Cheek and Buss Shyness Scale (RCBS). Wellesley College, Wellesley MA, 1983.",
      "doi": ""
    },
    {
      "text": "Clark, H.H. and E.F. Schaefer, Contributing to discourse. Cognitive Science, (1989) 13, 259--294.",
      "doi": ""
    },
    {
      "text": "Cogger, J.W. Are you a skilled interviewer? Personnel Journal, (1982) 61, 840--843.",
      "doi": ""
    },
    {
      "text": "Colburn, R.A., Cohen, M.F., and Drucker, S.M. Avatar Mediated Conversational Interfaces. Technical Report MSR-TR-2000-81, Microsoft, 2000.",
      "doi": ""
    },
    {
      "text": "Drolet, A.L., and Morris, M.W. Rapport in conflict resolution: accounting for how face-to-face contact fosters mutual cooperation in mixed-motive conflicts. Experimental Social Psychology, (2000) 36, 26--50.",
      "doi": ""
    },
    {
      "text": "Fry, R. and Smith, G. F. The effects of feedback and eye contact on performance of a digit-encoding task. Journal of Social Psychology, (1975) 96, 145--146.",
      "doi": ""
    },
    {
      "text": "Fuchs, D. Examiner familiarity effects on test performance: implications for training and practice. Topics in Early Childhood Special Education, (1987) 7, 90--104.",
      "doi": ""
    },
    {
      "text": "Garau, M., Slater, M., Bee, S., and Sasse, M.A. The Impact of Eye Gaze on Communication Using Humanoid Avatars. In Proceedings of Conference on Human Factors in Computing Systems (CHI), 2001, 309--316.  ",
      "doi": "10.1145/365024.365121"
    },
    {
      "text": "Garcia, P. Move: Component groupware foundations for collaborative virtual environments, in 4th International Conference on Collaborative Virtual Environments, 2000, 55--62.  ",
      "doi": "10.1145/571878.571887"
    },
    {
      "text": "Goldberg, G.N., Kiesler, C.A., and Collins, B.E. Visual behavior and face-to-face distance during interaction. Sociometry, (1969) 32, 43--53.",
      "doi": ""
    },
    {
      "text": "Gratch, J., Wang, N., Gerten, J., Fast, E. and Duffy, R. Creating Rapport with Virtual Agents. In 7th International Conference on Intelligent Virtual Agents, (Paris, 2007), Springer, 125--138.  ",
      "doi": "10.1007/978-3-540-74997-4_12"
    },
    {
      "text": "Harrigan, J.A., Oxman, T.E., Rosenthal, R. Rapport expressed through nonverbal behavior. Journal of Non-verbal Behavior (1985) 9(2).",
      "doi": ""
    },
    {
      "text": "Heylen, D.K.J. and van Es, I. and Nijholt, A. and van Dijk, E.M.A.G. Controlling the Gaze of Conversational Agents, in Natural, Intelligent and Effective Interaction in Multimodal Dialogue Systems. Kluwer Academic Publishers, 2005, 245--262.",
      "doi": ""
    },
    {
      "text": "John, O.P. and S. Srivastava, The Big-Five trait taxonomy: History, measurement, and theoretical perspectives. Handbook of personality: Theory and research, (1999), 2, 102--138.",
      "doi": ""
    },
    {
      "text": "Kallmann, M., & Marsella, S. Hierarchical Motion Controllers for Real-Time Autonomous Virtual Humans. In 5th International Conference on Intelligent Virtual Agents, (Kos, 2005), Springer, 253--265.  ",
      "doi": "10.1007/11550617_22"
    },
    {
      "text": "Kang, S.-H, Gratch, J., Wang, N., Watt, J. Does Contingency of Agents' Nonverbal Feedback Affect Users' Social Anxiety? in 7th International Conference on Autonomous Agents and Multiagent Systems. (Estoril, 2008), 120--127. ",
      "doi": "10.5555/1402383.1402405"
    },
    {
      "text": "Kang, S.-H, Gratch, J., Wang, N., Watt, J. Agreeable People Like Agreeable Virtual Humans, in 8th International Conference on Intelligent Virtual Agents, (Tokyo, 2008), 253--261.  ",
      "doi": "10.1007/978-3-540-85483-8_26"
    },
    {
      "text": "Kendon, A. Some functions of gaze direction in social interaction. ACTA PSYCHOLOGICA, (1967), 26, 22--63.",
      "doi": ""
    },
    {
      "text": "Kopp, S., Krenn, B., Marsella, S., Marshall, A., Pelachaud, C., Pirker, H., et al. Towards a common framework for multimodal generation in ECAs: The behavior markup language. In 6th International Conference on Intelligent Virtual Agents, (Marina del Rey, 2006), 28--41.  ",
      "doi": "10.1007/11821830_17"
    },
    {
      "text": "Krumhuber, E., Cosker, D., Manstead, A.S.R., Marshall, D., & Rosin, P.L. Temporal aspects of smiles influence employment decisions: A comparison of human and synthetic faces, in 11th European Conference Facial Expressions: Measurement and Meaning, (Durham, United Kingdom, 2005).",
      "doi": ""
    },
    {
      "text": "Lennox, R.D. and R.N. Wolfe, Revision of the Self-Monitoring Scale. Journal of Personality and Social psychology, (1984). 46: p. 1349--1364.",
      "doi": ""
    },
    {
      "text": "Lester, J.C., Stuart, S.G., Callaway, C.B., Voerman, J.L., and Fitzgeral, P.J. Deictic and emotive communication in animated pedagogical agents. In S. Prevost, J. Cassell, J. Sullivan, and E. Churcill, eds, Embodied Conversational Characters. MIT Press, Cambridge, MA, 2000. ",
      "doi": "10.5555/371552.371560"
    },
    {
      "text": "Linden Lab: http://secondlife.com",
      "doi": ""
    },
    {
      "text": "Makena Technologies: http://www.there.com",
      "doi": ""
    },
    {
      "text": "McNeill, D. Hand and mind: What gestures reveal about thought. The University of Chicago Press, Chicago, 1992.",
      "doi": ""
    },
    {
      "text": "Morency, L.-P., Sidner, C., Lee, C., and Darrell, T. Contextual Recognition of Head Gestures. In 7th International Conference on Multimodal Interactions, (Toreno, 2005), 18--24.  ",
      "doi": "10.1145/1088463.1088470"
    },
    {
      "text": "Mutlu, B., Hodgins, J.K., and Forlizzi, J. A Storytelling Robot: Modeling and Evaluation of Human-like Gaze Behavior. In Proceedings of the IEEE-RAS International Conference on Humanoid Robots, (Genova, 2006), 518--523.",
      "doi": ""
    },
    {
      "text": "Nakano, Y.I., Reinstein, G., Stocky, T., and Cassell, J. 2003. Towards a model of face-to-face grounding. In 41st Annual Meeting on Association For Computational Linguistics -- Volume 1 (Sapporo, 2003). Association for Computational Linguistics, Morristown, NJ, 553--561.  ",
      "doi": "10.3115/1075096.1075166"
    },
    {
      "text": "Numedeon: http://www.whyville.net",
      "doi": ""
    },
    {
      "text": "O'Connor, B., and Gifford, R. A test among models of nonverbal intimacy reactions: Arousal-labeling, discrepancy-arousal, and social cognition. Journal of Nonverbal Behavior, (1988), 12, 6--33.",
      "doi": ""
    },
    {
      "text": "Oppenheim, A.V., and Schafer, R.W. From Frequency to Quefrency: A History of the Cepstrum. IEEE Signal Processing Magazine, (2004) 9, 95--106.",
      "doi": ""
    },
    {
      "text": "Pelachaud, C. and Bilvi, M. Modelling gaze behavior for conversational agents. In 4th International Conference on Intelligent Virtual Agents, (Kloster Irsee, 2003), Springer.",
      "doi": ""
    },
    {
      "text": "Rosenthal, R. Interpersonal expectancy effects: A 30-year perspective. Current Directions in Psychological Science, (1994) 3, 176--179",
      "doi": ""
    },
    {
      "text": "Scheier, M.F. and C.S. Carver, The Self-Consciousness Scale: A revised version for use with general populations. Journal of Applied Social Psychology, (1985) 15, 687--699.",
      "doi": ""
    },
    {
      "text": "Short, J.A., Williams, E., & Christie, B. The social psychology of telecommunications. New York: John Wiley & Sons, 1976.",
      "doi": ""
    },
    {
      "text": "Swaab, R. and Swaab, D. Sex differences in the effects of visual contact and eye contact in negotiations, Journal of Experimental Social Psychology (2009) 45 (1) 129--136.",
      "doi": ""
    },
    {
      "text": "Tatar, D. Social and personal consequences of a preoccupied listener. Department of Psychology. Stanford, CA, Stanford University: Unpublished doctoral dissertation (1997).",
      "doi": ""
    },
    {
      "text": "Thompson, L., & Nadler, J. Negotiating via information technology: Theory and application. Journal of Social Issues, (2002), 58, (1), 109--124.",
      "doi": ""
    },
    {
      "text": "Thórisson, K.R. and Cassell, J. Why Put an Agent in a Body: The Importance of Communicative Feedback in Human-Humanoid Dialogue. In Proceedings of Lifelike Computer Characters, (1996) 44--45.",
      "doi": ""
    },
    {
      "text": "Thórisson, K.R. Layered modular action control for communicative humanoids. In Computer Animation. IEEE Computer Society Press, Geneva, Switzerland, 1997.",
      "doi": ""
    },
    {
      "text": "Thórisson, K.R. Natural turn-taking needs no manual. In I. Karlsson, B. Granstr¨om, and D. House, eds, Multimodality in Language and speech systems,. Kluwer Academic Publishers, 2002, 173--207.",
      "doi": ""
    },
    {
      "text": "Tickle-Degnen, L., Rosenthal, R. The nature of rapport and its nonverbal correlates, Psychological Inquiry, (1990) 1, 285--93.",
      "doi": ""
    },
    {
      "text": "Tixeo Soft: http://www.workspace3d.com",
      "doi": ""
    },
    {
      "text": "Tsui, P., & Schultz, G.L. Failure of Rapport: Why psychotheraputic engagement fails in the treatment of Asian clients. American Journal of Orthopsychiatry, (1985) 55, 561--569.",
      "doi": ""
    },
    {
      "text": "Vertegaal, R. The GAZE Groupware System: Mediating Joint Attention in Multiparty Communication and Collaboration, in Proceedings of Conference on Human Factors in Computing Systems, (Pittsburgh, 1999), ACM, 294--301,  ",
      "doi": "10.1145/302979.303065"
    },
    {
      "text": "Ward, N., & Tsukahara, W. Prosodic features which cue back-channel responses in English and Japanese. Journal of Pragmatics, (2000) 23, 1177--1207.",
      "doi": ""
    },
    {
      "text": "Yngve, V.H. On getting a word in edgewise, in 6th regional Meeting of the Chicago Linguistic Society, 1970.",
      "doi": ""
    }
  ]
}