{
  "doi": "10.1145/1753326.1753649",
  "title": "Towards customizable games for stroke rehabilitation",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2113-2122",
  "year": 2010,
  "badges": [],
  "abstract": "Stroke is the leading cause of long term disability among adults in industrialized nations. The partial paralysis that stroke patients often experience can make independent living difficult or impossible. Research suggests that many of these patients could recover by performing hundreds of daily repetitions of motions with their affected limbs. Yet, only 31% of patients perform the exercises recommended by their therapists. Home-based stroke rehabilitation games may help motivate stroke patients to perform the necessary exercises to recover. In this paper, we describe a formative study in which we designed and user tested stroke rehabilitation games with both stroke patients and therapists. We describe the lessons we learned about what makes games useful from a therapeutic point of view.",
  "authors": [
    {
      "name": "Gazihan Alankus",
      "institution": "Washington University in St. Louis, St. Louis, MO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100182954",
      "orcid": "missing"
    },
    {
      "name": "Amanda Lazar",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    },
    {
      "name": "Matt May",
      "institution": "Washington University in St. Louis, St. Louis, MO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81542440456",
      "orcid": "missing"
    },
    {
      "name": "Caitlin Kelleher",
      "institution": "Washington University in St. Louis, St. Louis, MO, USA",
      "img": "/do/10.1145/contrib-81100607695/rel-imgonly/ckelleher.jpg",
      "acmid": "81100607695",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "WiiRemoteJ. http://www.world-of-cha0s.hostrocket.com/WiiRemoteJ/.",
      "doi": ""
    },
    {
      "text": "Looking Glass. http://lookingglass.wustl.edu/.",
      "doi": ""
    },
    {
      "text": "Broeren, J., Bjorkdahl, A., Claesson, L., et al. Virtual rehabilitation after stroke. Studies in Health Technology and Informatics 136, (2008), 77--82.",
      "doi": ""
    },
    {
      "text": "Burke, J., McNeill, M., Charles, D., Morrow, P., Crosbie, J., and McDonough, S. Optimising engagement for stroke rehabilitation using serious games. The Visual Computer 25, 12 (2009), 1085--1099.  ",
      "doi": "10.1007/s00371-009-0387-4"
    },
    {
      "text": "Burke, J., McNeill, M., Charles, D., Morrow, P., Crosbie, J., and McDonough, S. Serious Games for Upper Limb Rehabilitation Following Stroke. VS-GAMES '09, (2009), 103--110.  ",
      "doi": "10.1109/VS-GAMES.2009.17"
    },
    {
      "text": "Chen, Y., Xu, W., Sundaram, H., Rikakis, T., and Liu, S. A dynamic decision network framework for online media adaptation in stroke rehabilitation. ACM Trans. Multimedia Comp. Comm. App. 5, 1 (2008), 1--38.  ",
      "doi": "10.1145/1435375.1435387"
    },
    {
      "text": "Cicerone, K.D., Dahlberg, C., Malec, J.F., et al. Evidence-Based Cognitive Rehabilitation: Updated Review of the Literature From 1998 Through 2002. Arch. Phys. Med. & Rehab. 86, 8 (2005), 1681--1692.",
      "doi": ""
    },
    {
      "text": "Colombo, R., Pisano, F., Mazzone, A., et al. Design strategies to improve patient motivation during robot-aided rehabilitation. Journal of Neuroengineering and Rehabilitation 4, (2007), 3.",
      "doi": ""
    },
    {
      "text": "Deutsch, J.E., Borbely, M., Filler, J., Huhn, K., and Guarrera-Bowlby, P. Use of a low-cost, commercially available gaming console (Wii) for rehabilitation of an adolescent with cerebral palsy. Physical Therapy 88, 10 (2008), 1196--1207.",
      "doi": ""
    },
    {
      "text": "Flores, E., Tobon, G., Cavallaro, E., Cavallaro, F.I., Perry, J.C., and Keller, T. Improving patient motivation in game development for motor deficit rehabilitation. Proc. 2008 Intl. Conf. on Adv. in Comp. Entert. Tech., ACM (2008), 381--384.  ",
      "doi": "10.1145/1501750.1501839"
    },
    {
      "text": "Flynn, S., Palma, P., and Bender, A. Feasibility of using the Sony PlayStation 2 gaming platform for an individual poststroke: a case report. Journal of Neuro. Physical Therapy: JNPT 31, 4 (2007), 180--189.",
      "doi": ""
    },
    {
      "text": "Goude, D., Björk, S., and Rydmark, M. Game design in virtual reality systems for stroke rehabilitation. Studies in Health Technology and Informatics 125, (2007), 146--148.",
      "doi": ""
    },
    {
      "text": "Huber, M., Rabin, B., Docan, C., et al. PlayStation 3-based tele-rehabilitation for children with hemiplegia. Virtual Rehabilitation, 2008, (2008), 105--112.",
      "doi": ""
    },
    {
      "text": "Jack, D., Boian, R., Merians, A.S., et al. Virtual reality-enhanced stroke rehabilitation. Neural Sys. and Rehab. Engr., IEEE Trans. 9, 3 (2001), 308--318.",
      "doi": ""
    },
    {
      "text": "Jung, Y., Yeh, S., and Stewart, J. Tailoring virtual reality technology for stroke rehabilitation: a human factors design. CHI '06 extended abstracts on Human factors in computing systems, ACM (2006), 929--934.  ",
      "doi": "10.1145/1125451.1125631"
    },
    {
      "text": "Kwakkel, G., Wagenaar, R.C., Koelman, T.W., Lankhorst, G.J., and Koetsier, J.C. Effects of Intensity of Rehabilitation After Stroke : A Research Synthesis. Stroke 28, 8 (1997), 1550--1556.",
      "doi": ""
    },
    {
      "text": "Lang, C.E., MacDonald, J.R., and Gnip, C. Counting repetitions: an observational study of outpatient therapy for people with hemiparesis post-stroke. Journal Neuro. Phys. Therapy 31, 1 (2007), 3--10.",
      "doi": ""
    },
    {
      "text": "Langhorne, P., Coupar, F., and Pollock, A. Motor recovery after stroke: a systematic review. The Lancet Neurology 8, 8 (2009), 741--754.",
      "doi": ""
    },
    {
      "text": "van der Lee, J.H., Wagenaar, R.C., Lankhorst, G.J., Vogelaar, T.W., Deville, W.L., and Bouter, L.M. Forced Use of the Upper Extremity in Chronic Stroke Patients : Results From a Single-Blind Randomized Clinical Trial. Stroke 30, 11 (1999), 2369--2375.",
      "doi": ""
    },
    {
      "text": "Rizzo, A.\". and Kim, G.J. A SWOT Analysis of the Field of Virtual Reality Rehabilitation and Therapy. Presence: Teleoperators & VE 14, 2 (2005), 119--146.  ",
      "doi": "10.1162/1054746053967094"
    },
    {
      "text": "Sanchez, R., Jiayin Liu, Rao, S., et al. Automating Arm Movement Training Following Severe Stroke: Functional Exercises With Quantitative Feedback in a Gravity-Reduced Environment. Neur. Sys. and Rehab. Engr., IEEE Tr. on 14, 3 (2006), 378--389.",
      "doi": ""
    },
    {
      "text": "Selzer, M., Clarke, S., Cohen, L., Duncan, P., and Gage, F. Textbook of Neural Repair and Rehabilitation: Volume 2, Medical Neurorehabilitation. Cambridge Uni. Press, 2006.",
      "doi": ""
    },
    {
      "text": "Shaughnessy, M., Resnick, B.M., and Macko, R.F. Testing a model of post-stroke exercise behavior. Rehabilitation Nursing: The Official Journal of the Assoc. of Rehabil. Nurses 31, 1 (2006), 15--21.",
      "doi": ""
    },
    {
      "text": "Stach, T., Graham, T.C., Brehmer, M., and Hollatz, A. Classifying Input for Active Games. Proceedings of Advances in Computer Entertainment, ACM (2009).  ",
      "doi": "10.1145/1690388.1690465"
    },
    {
      "text": "Sweetser, P. and Wyeth, P. GameFlow: a model for evaluating player enjoyment in games. Comput. Entertain. 3, 3 (2005), 3--3.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Warlow, C., Sandercock, P., Hankey, G., et al. Stroke: Practical Management. Blackwell Publishing, 2008.",
      "doi": ""
    },
    {
      "text": "Whitehead, A., Crampton, N., Fox, K., and Johnston, H. Sensor networks as video game input devices. Proc. 2007 conf. on Future Play, ACM (2007), 38--45.  ",
      "doi": "10.1145/1328202.1328210"
    },
    {
      "text": "Yeh, S., Rizzo, A., Zhu, W., et al. An integrated system: virtual reality, haptics and modern sensing technique (VHS) for post-stroke rehabilitation. Proc. ACM symp. on VR soft. & tech., ACM (2005), 59--62.  ",
      "doi": "10.1145/1101616.1101628"
    }
  ]
}