{
  "doi": "10.1145/1753326.1753615",
  "title": "Lurking? cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1917-1926",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Online communities produce rich behavioral datasets, e.g., Usenet news conversations, Wikipedia edits, and Facebook friend networks. Analysis of such datasets yields important insights (like the \"long tail\" of user participation) and suggests novel design interventions (like targeting users with personalized opportunities and work requests). However, certain key user data typically are unavailable, specifically viewing, pre-registration, and non-logged-in activity. The absence of data makes some questions hard to answer; ac- cess to it can strengthen, extend, or cast doubt on previous results. We report on analysis of user behavior in Cyclopath, a geographic wiki and route-finder for bicyclists. With access to viewing and non-logged-in activity data, we were able to: (a) replicate and extend prior work on user lifecycles in Wikipedia, (b) bring to light some pre-registration activity, thus testing for the presence of \"educational lurking,\" and (c) demonstrate the locality of geographic activity and how editing and viewing are geographically correlated.",
  "authors": [
    {
      "name": "Katherine Panciera",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332520112",
      "orcid": "missing"
    },
    {
      "name": "Reid Priedhorsky",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489923",
      "orcid": "missing"
    },
    {
      "name": "Thomas Erickson",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/do/10.1145/contrib-81100235869/rel-imgonly/tom_sol_prtl_pic_183pxsq.jpg",
      "acmid": "81100235869",
      "orcid": "missing"
    },
    {
      "name": "Loren Terveen",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81100276946/rel-imgonly/my_mcknight_photo_2017.jpg",
      "acmid": "81100276946",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamic, L. A. et al. Knowledge sharing and Yahoo Answers: Everyone knows something. In Proc. WWW. 2008.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Anderson, C. The Long Tail: Why the Future of Business is Selling Less of More. Hyperion, 2006. ",
      "doi": "10.5555/1197299"
    },
    {
      "text": "Bryant, S. L. et al. Becoming Wikipedian: Transformation of participation in a collaborative online encyclopedia. In Proc. GROUP. 2005.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Carroll, J. and Rosson, M. Developing the Blacksburg electronic village. CACM, 39 (1996), 69--74.  ",
      "doi": "10.1145/240483.240498"
    },
    {
      "text": "Convertino, G. et al. Supporting content and process common ground in computer-supported teamwork. In Proc. CHI. 2009, 2339--2348.  ",
      "doi": "10.1145/1518701.1519059"
    },
    {
      "text": "Elwood, S. Volunteered geographic information: key questions, concepts and methods to guide emerging research and practice. GeoJournal, 72, 3--4 (2008), 133--135.",
      "doi": ""
    },
    {
      "text": "Fisher, D. et al. You are who you talk to: Detecting roles in usenet newsgroups. In HICSS. 2006.  ",
      "doi": "10.1109/HICSS.2006.536"
    },
    {
      "text": "Frankowski, D. et al. You are what you say: Privacy risks of public mentions. 2006, 565--572.  ",
      "doi": "10.1145/1148170.1148267"
    },
    {
      "text": "Friedman, E. and Resnick, P. The social cost of cheap pseudonyms. Economics and Management Strategy.",
      "doi": ""
    },
    {
      "text": "Golder, S. and Huberman, B. The structure of collaborative tagging systems. Arxiv preprint cs.DL/0508082.",
      "doi": ""
    },
    {
      "text": "Goodchild, M. F. and Gupta, R. Workshop on volunteered geographic information (2007). http://www.ncgia.ucsb.edu/projects/vgi/.",
      "doi": ""
    },
    {
      "text": "Harper, F. et al. Talk amongst yourselves: Inviting users to participate in online conversations. In Proc. IUI. ACM New York, NY, USA, 2007, 62--71.  ",
      "doi": "10.1145/1216295.1216313"
    },
    {
      "text": "Intille, S. and Ma, X. Eliciting user preferences using image-based experience sampling and reflection. In Proc. CHI. 2002.  ",
      "doi": "10.1145/506443.506573"
    },
    {
      "text": "Jones, Q. et al. Information overload and the message dynamics of online interaction spaces: A theoretical model and empirical exploration. Info. Sys. Research, 15, 2 (2004), 194--210.  ",
      "doi": "10.1287/isre.1040.0023"
    },
    {
      "text": "15. Kittur, A. et al. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. In Proc. alt.CHI. 2007.",
      "doi": ""
    },
    {
      "text": "Lampe, C. and Resnick, P. Slash(dot) and burn: Distributed moderation in a large online conversation space. In Proc. CHI. 2004, 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Lo, C. P. and Yeung, A. K. W. Concepts and Techniques of Geographic Information Systems. Prentice Hall, 2006, 2nd edition. ",
      "doi": "10.5555/1199499"
    },
    {
      "text": "Nonnecke, B. and Preece, J. Shedding light on lurkers in online communities. Ethnographic Studies in Real and Virtual Environments (1999), 123--128.",
      "doi": ""
    },
    {
      "text": "Nonnecke, B. and Preece, J. Lurker demographics: Counting the silent. In Proc. CHI. 2000, 73--80.  ",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "Panciera, K. et al. Wikipedians are born, not made: A study of power editors on Wikipedia. In Proc. GROUP. 2009, 51--60.  ",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Priedhorsky, R. and Terveen, L. The computational geowiki: What, why, and how. In Proc. CSCW. 2008, 267--276.  ",
      "doi": "10.1145/1460563.1460606"
    },
    {
      "text": "Priedhorsky, R. et al. Creating, destroying, and restoring value in Wikipedia. In Proc. GROUP. 2007.  ",
      "doi": "10.1145/1316624.1316663"
    },
    {
      "text": "Priedhorsky, R. et al. How a personalized geowiki can help bicyclists share information more effectively. In Proc. WikiSym. 2007.  ",
      "doi": "10.1145/1296951.1296962"
    },
    {
      "text": "Priedhorsky, R. et al. Eliciting and focusing geographic volunteer work. In Proc. CSCW. 2010.  ",
      "doi": "10.1145/1718918.1718931"
    },
    {
      "text": "Schuler, D. Community networks: Building a new participatory medium. CACM, 37, 1 (1994), 38--51.  ",
      "doi": "10.1145/175222.175225"
    },
    {
      "text": "Soroka, V. and Rafaeli, S. Invisible participants: how cultural capital relates to lurking behavior. In Proc. WWW. 2006, 163--172.  ",
      "doi": "10.1145/1135777.1135806"
    },
    {
      "text": "Soroka, V. et al. We can see you: A study of communities' invisible people through ReachOut. In Proc. Communities and Technologies. 2003. ",
      "doi": "10.5555/966263.966267"
    },
    {
      "text": "Suh, B. et al. The singularity is not near: Slowing growth of wikipedia. In Proc. WikiSym. 2009.  ",
      "doi": "10.1145/1641309.1641322"
    },
    {
      "text": "Sweeney, L. K-anonymity: A model for protecting privacy. Uncertain. Fuzziness Knowl.-Based Syst., 10, 5 (2002), 557--570.  ",
      "doi": "10.1142/S0218488502001648"
    },
    {
      "text": "Welser, H. T. et al. Visualizing the signatures of social roles in online discussion groups. In Social Structure. 2007.",
      "doi": ""
    },
    {
      "text": "Whittaker, S. et al. The dynamics of mass interaction. In Proc. CSCW. 1998.  ",
      "doi": "10.1145/289444.289500"
    }
  ]
}