{
  "doi": "10.1145/1753326.1753490",
  "title": "ColorPIN: securing PIN entry through indirect input",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1103-1106",
  "year": 2010,
  "badges": [],
  "abstract": "Automated teller machine (ATM) frauds are increasing drastically these days. When analyzing the most common attacks and the reasons for successful frauds, it becomes apparent that the main problem lies in the PIN based authentication which in itself does not provide any security features (besides the use of asterisks). That is, security is solely based on a user's behavior. Indirect input is one way to solve this problem. This mostly comes at the costs of adding overhead to the input process. We present ColorPIN, an authentication mechanism that uses indirect input to provide security enhanced PIN entry. At the same time, ColorPIN remains a one-to-one relationship between the length of the PIN and the required number of clicks. A user study showed that ColorPIN is significantly more secure than standard PIN entry while enabling good authentication speed in comparison with related systems.",
  "tags": [
    "authentication",
    "atm",
    "colorpin",
    "security"
  ],
  "authors": [
    {
      "name": "Alexander De Luca",
      "institution": "University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488374",
      "orcid": "missing"
    },
    {
      "name": "Katja Hertzschuch",
      "institution": "University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657607",
      "orcid": "missing"
    },
    {
      "name": "Heinrich Hussmann",
      "institution": "University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81100395854/rel-imgonly/heinrich-hussmann.jpg",
      "acmid": "81100395854",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A., Sasse, M. A. Users are not the enemy. Commun. ACM 42, 12, 40--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Hayashi, E., Dhamija, R., Christin, N., Perrig, A. Use your illusion: secure authentication usable anywhere. In Proc. SOUPS '08.  ",
      "doi": "10.1145/1408664.1408670"
    },
    {
      "text": "Moncur, W., Leplâtre, G. Pictures at the ATM: exploring the usability of multiple graphical passwords. In Proc. CHI '07.  ",
      "doi": "10.1145/1240624.1240758"
    },
    {
      "text": "Roth, V., Richter, K., Freidinger, R. A pin-entry method resilient against shoulder surfing. In Proc. CCS '04.  ",
      "doi": "10.1145/1030083.1030116"
    },
    {
      "text": "Sasamoto, H., Christin, N., Hayashi, E. Undercover: authentication usable in front of prying eyes. In Proc. CHI '08.  ",
      "doi": "10.1145/1357054.1357085"
    },
    {
      "text": "Tan, D., Keyani, P., Czerwinski, M. Spy-resistant keyboard: more secure password entry on public touch screen displays. In Proc. OZCHI '05. ",
      "doi": "10.5555/1108368.1108393"
    },
    {
      "text": "Wiedenbeck, S., Waters, J., Sobrado, L., Birget, J.-C. Design and evaluation of a shoulder-surfing resistant graphical password scheme. In Proc. AVI 2006.  ",
      "doi": "10.1145/1133265.1133303"
    }
  ]
}