{
  "doi": "10.1145/1753326.1753527",
  "title": "Animated UI transitions and perception of time: a user study on animated effects on a mobile screen",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1339-1342",
  "year": 2010,
  "badges": [],
  "abstract": "The capability to present advanced graphics in the present mobile devices can be utilized to improve their usability and overall user experience. Mobile devices have limitations compared to PCs due to their inferior computing power and small screens, but a successful design of animated transitions can hide processing delays and make the user experience smoother. In this paper, we describe the design of animated transitions and present a user study on how they are perceived. The results show that in the transition between two images, bringing up the next image earlier dominates the perception of a fast transition over other variables examined in the study.",
  "authors": [
    {
      "name": "Jussi Huhtala",
      "institution": "Nokia Research Center, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350586422",
      "orcid": "missing"
    },
    {
      "name": "Ari-Heikki Sarjanoja",
      "institution": "Nokia Research Center, Oulu, Finland",
      "img": "/do/10.1145/contrib-81442613980/rel-imgonly/160125-valve0807-small.jpg",
      "acmid": "81442613980",
      "orcid": "missing"
    },
    {
      "name": "Jani Mäntyjärvi",
      "institution": "VTT Technical Research Centre of Finland, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100147371",
      "orcid": "missing"
    },
    {
      "name": "Minna Isomursu",
      "institution": "VTT Technical Research Centre of Finland, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100322492",
      "orcid": "missing"
    },
    {
      "name": "Jonna Häkkilä",
      "institution": "Nokia Research Center, Oulu, Finland",
      "img": "/do/10.1145/contrib-81100417488/rel-imgonly/prof_jonna_hakkila.png",
      "acmid": "81100417488",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cooper, A. 1995. About Face: The Essentials of User Interface Design. John Wiley & Sons Inc, 1995. ",
      "doi": "10.5555/526507"
    },
    {
      "text": "De Angeli, A., Sutcliffe, A., Hartmann, J. What Influences User's Preferences? In Proc. DIS 2006.  ",
      "doi": "10.1145/1142405.1142446"
    },
    {
      "text": "Harrison, C., Amento, B., Kuznetsov, S. and Bell, R. 2007. Rethinking the Progress Bar. In Proc. UIST'07. ACM Press (2007), 115--118.  ",
      "doi": "10.1145/1294211.1294231"
    },
    {
      "text": "Lasseter, J. 1987. Principles of Traditional Animation Applied to 3D Computer Animation. In Computer Graphics (Proceedings of ACM SIGGRAPH 87), ACM Press (1987), 35--44.  ",
      "doi": "10.1145/37401.37407"
    },
    {
      "text": "Marentakis, G., Brewster, S. A. A Comparison of Feedback Cues for Enhancing Pointing Efficiency in Interaction with Spatial Audio Displays. In Proc. MobileHCI'05, ACM 2005, 55--62.  ",
      "doi": "10.1145/1085777.1085787"
    },
    {
      "text": "McCrickard, D., Zhao Q. and Stasko, J. 1999. Exploring Animation as a Presentation Technique for Dynamic Information Sources. In GVU Technical Report, GITGVU-99-47, 1999.",
      "doi": ""
    },
    {
      "text": "Myers, B. A. 1985. The importance of percent-done progress indicators for computer-human interfaces. In Proc. CHI '85. ACM Press (1985), 11--17.  ",
      "doi": "10.1145/317456.317459"
    },
    {
      "text": "Tractinsky, N., Katz, A. S., Ikar D. What Is Beautiful Is Usable. In Interacting with Computers 13 (2000), 127--145., Elsevier 2000",
      "doi": ""
    }
  ]
}