{
  "doi": "10.1145/1753326.1753524",
  "title": "Integrating Text with Video and 3D Graphics: The Effects of Text Drawing Styles on Text Readability",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1321-1330",
  "year": 2010,
  "badges": [],
  "abstract": "There have been many studies of computer based text reading. However, only a few have considered text integrated with video and 3D graphics. This paper presents an investigation into the effects of varying (a) text drawing style (plain, billboard, Anti-Interference, shadow), (b) image polarity (positive and negative), and (c) background style (video and 3D) on text readability. Reading speed and accuracy were measured and subjective views of participants recorded. Results showed that: (a) there was little difference in reading performance for the video and 3D backgrounds; (b) the negative presentation outperformed the positive presentation; (c) the billboard drawing styles supported the best performance; subjective comments showed a preference for the billboard style. We therefore suggest, for reading tasks, that designers of interfaces for games, video, and augmented reality provide billboard style to maximize readability for the widest range of applications.",
  "authors": [
    {
      "name": "Jacek Jankowski",
      "institution": "Digital Enterprise Research Institute, National University of Ireland, Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350597678",
      "orcid": "missing"
    },
    {
      "name": "Krystian Samp",
      "institution": "Digital Enterprise Research Institute, National University of Ireland, Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654921",
      "orcid": "missing"
    },
    {
      "name": "Izabela Irzynska",
      "institution": "Digital Enterprise Research Institute, National University of Ireland, Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436600749",
      "orcid": "missing"
    },
    {
      "name": "Marek Jozwowicz",
      "institution": "Digital Enterprise Research Institute, National University of Ireland, Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444608326",
      "orcid": "missing"
    },
    {
      "name": "Stefan Decker",
      "institution": "Digital Enterprise Research Institute, National University of Ireland, Galway, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100438867",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azuma, R. and Furmanski, C. Evaluating Label Placement for Augmented Reality View Management, In Proc. ISMAR 2004. ",
      "doi": "10.5555/946248.946790"
    },
    {
      "text": "Bell, B., Feiner, S., and Hollerer, T. View Management for Virtual and Augmented Reality. In Proc. UIST 2001.  ",
      "doi": "10.1145/502348.502363"
    },
    {
      "text": "Bernard, M.L., Chaparro, B.S., Mills, M.M. and Halcomb, C.G. Comparing the effects of text size and format on the readability of computer--displayed Times New Roman and Arial text. IJHCS, 2003.  ",
      "doi": "10.1016/S1071-5819%2803%2900121-6"
    },
    {
      "text": "Bolter, J.D. and Grusin, R. Remediation: Understanding New Media, 2000. ",
      "doi": "10.5555/298574"
    },
    {
      "text": "Chen, J., Pyla P., and Bowman D., Testbed Evaluation of Navigation and Text Display Techniques in an Information-Rich Virtual Environment. In Proc. Virtual Reality 2004.  ",
      "doi": "10.5555/1009389.1010389"
    },
    {
      "text": "Darroch, I., Goodman, J. Brewster, S. and Gray, P. The Effect of Age and Font Size on Reading Text on Handheld Computers. In Proc. INTERACT 2005.  ",
      "doi": "10.1007/11555261_23"
    },
    {
      "text": "Digital television recommendations: http://www.dtg.org.uk/ and http://www.ofcom.org.uk/",
      "doi": ""
    },
    {
      "text": "Dillon, A. Reading from paper vs. screens: A critical review of the empirical literature. Ergonomics, 1992.",
      "doi": ""
    },
    {
      "text": "Feiner, S., Augmented Reality: A new way of seeing, Scientific American, 2002.",
      "doi": ""
    },
    {
      "text": "Gabbard, J.L., Swan, J.E. and Hix, D. The effects of text drawing styles, background textures, and natural lighting on text legibility in outdoor augmented reality. Presence, 2006.  ",
      "doi": "10.1162/pres.2006.15.1.16"
    },
    {
      "text": "Gould, J.D., Alfaro, L., Finn, R., Haupt, B. and Minuto, A. Reading from CRT displays can be as fast as reading from paper. Human Factors, 1987. ",
      "doi": "10.1177/001872088702900501"
    },
    {
      "text": "Harrison, B.L. and Vicente, K.J. An experimental evaluation of transparent menu usage. In Proc. CHI 1996.  ",
      "doi": "10.1145/238386.238583"
    },
    {
      "text": "Hill, A.L. and Scharff, L.F. Readability of computer displays as a function of color, saturation, and background texture. Engineering Psychology & Cognitive Ergonomics, 1999.",
      "doi": ""
    },
    {
      "text": "Jankowski, J. and Decker, S. 2LIP: Filling the Gap between the Current and the Three-Dimensional Web, In Proc. Web3D 2009.  ",
      "doi": "10.1145/1559764.1559793"
    },
    {
      "text": "Jorna, G.C. and Snyder, H.L. Image Quality Determines Differences in Reading Performance and Perceived Image Quality with CRT and Hard-Copy Displays. Human Factors, 1991. ",
      "doi": "10.1177/001872089103300407"
    },
    {
      "text": "Larson, K., van Dantzich, M., Czerwinski, M. and Robertson, G. Text in 3D: some legibility results. In Proc. CHI 2002.  ",
      "doi": "10.1145/633292.633374"
    },
    {
      "text": "Lavie, T. and Tractinsky, N. Assessing dimensions of perceived visual aesthetics of web sites. IJHCS, 2004.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "Leykin, A. and Tuceryan, M. Automatic Determination of Text Readability over Textured Backgrounds for Augmented Reality Systems. In Proc. ISMAR 2004.  ",
      "doi": "10.1109/ISMAR.2004.22"
    },
    {
      "text": "Maass, S. and Dollner, J. Embedded labels for line features in interactive 3D virtual environments, In Proc. Afrigraph 2007.  ",
      "doi": "10.1145/1294685.1294695"
    },
    {
      "text": "Nunberg, G. The Future of the Book, 1997 ",
      "doi": "10.5555/547213"
    },
    {
      "text": "Polys, N.F., Kim, S. and Bowman, D.A. Effects of Information Layout, Screen Size, and Field of View on User Performance in Information-Rich Virtual Environments. In Proc. VRST 2005.  ",
      "doi": "10.1145/1101616.1101626"
    },
    {
      "text": "Preim, B., Raab, A., and Strothotte, T. Coherent Zooming of Illustrations with 3D-Graphics and Text. In Proc. Graphics Interface 1997. ",
      "doi": "10.5555/266774.266789"
    },
    {
      "text": "Ritter, F., Sonnet, H., Hartmann, K., and Strothotte, T. Illustrative Shadows: Integrating 3D and 2D Information Displays. In Proc. IUI 2003.  ",
      "doi": "10.1145/604045.604072"
    },
    {
      "text": "Riverside Publishing. Nelson--Denny Reading Test, 1993.",
      "doi": ""
    },
    {
      "text": "Scharff, L.F., Hill, A.L. and Ahumada, A.J. Predicting the readability of transparent text. Journal of Vision, 2002",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. and Plaisant, C. Designing the user interface: strategies for effective Human-Computer Interaction, 2004. ",
      "doi": "10.5555/983803"
    },
    {
      "text": "Sonnet, H., Carpendale, S., and Strothotte, T. Integrating expanding annotations with a 3D explosion probe. In Proc. AVI 2004.  ",
      "doi": "10.1145/989863.989871"
    },
    {
      "text": "Sonnet, H., Carpendale, S. and Strothotte, T. Integration of 3D Data and Text: The Effects of Text Positioning, Connectivity, and Visual Hints on Comprehension. In Proc. INTERACT 2005.  ",
      "doi": "10.1007/11555261_50"
    },
    {
      "text": "Tractinsky, N., Shoval-Katz, A., and Ikar, D. What is beautiful is usable. Interacting with Computers, 2000.",
      "doi": ""
    }
  ]
}