{
  "doi": "10.1145/1753326.1753512",
  "title": "Layered elaboration: a new technique for co-design with children",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1237-1240",
  "year": 2010,
  "badges": [],
  "abstract": "As technology for children becomes more mobile, social, and distributed, our design methods and techniques must evolve to better explore these new directions. This paper reports on \"Layered Elaboration,\" a co-design technique created to support these evolving needs. .Layered Elaboration allows design teams to generate ideas through an iterative process in which each version leaves prior ideas intact while extending concepts. Layered Elaboration is a useful technique as it enables co-design to take place asynchronously and does not require much space or many resources. Our intergenerational team, including adults and children ages 7 -- 11 years old, used the technique to design both a game about history and a prototype of an instructional game about energy conservation.",
  "tags": [
    "co-design",
    "storyboarding",
    "cooperative inquiry",
    "layered elaboration",
    "children",
    "low-tech prototyping"
  ],
  "authors": [
    {
      "name": "Greg Walsh",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81416598462/rel-imgonly/new_profilepic.png",
      "acmid": "81416598462",
      "orcid": "missing"
    },
    {
      "name": "Alison Druin",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    },
    {
      "name": "Mona Leigh Guha",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100549032",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Foss",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435595763",
      "orcid": "missing"
    },
    {
      "name": "Evan Golub",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100043718",
      "orcid": "missing"
    },
    {
      "name": "Leshell Hatley",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81435607424/rel-imgonly/81435607424.jpg",
      "acmid": "81435607424",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Bonsignore",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641019",
      "orcid": "missing"
    },
    {
      "name": "Sonia Franckel",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460658457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailey, B. P., Biehl, J. T., et al. Adapting paper prototyping for designing user interfaces for multiple display environments. Personal Ubiquitous Comput., 12, 3 (2008), 269--277.  ",
      "doi": "10.1007/s00779-007-0147-2"
    },
    {
      "text": "Beck, K. and Fowler, M. Planning extreme programming. Addison-Wesley Longman Publishing Co., Inc. Boston, Massachusetts, USA, 2000. ",
      "doi": "10.5555/557458"
    },
    {
      "text": "Brederode, B., Markopoulos, P., et al. pOwerball: the design of a novel mixed-reality game for children with mixed abilities. Proc. IDC '05: Proceedings of the 2005 conference on Interaction design and children, 2005. 32--39.  ",
      "doi": "10.1145/1109540.1109545"
    },
    {
      "text": "Druin, A. Cooperative inquiry: developing new technologies for children with children. Proc. CHI '99: Proceedings of the SIGCHI conference on Human factors in computing systems, 1999. 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Druin, A. Mobile Technology for Children: Designing for Interaction and Learning. Morgan Kaufmann. Burlington, Massachusetts, USA, 2009. ",
      "doi": "10.5555/1611279"
    },
    {
      "text": "Druin, A., Bederson, B. B., et al. Designing a digital library for young children. Proc. JCDL '01: Proceedings of the 1st ACM/IEEE-CS joint conference on Digital libraries, 2001. 398--405.  ",
      "doi": "10.1145/379437.379735"
    },
    {
      "text": "Guha, M. L., Druin, A., Chipman, G., Fails, J. A., Simms, S., and Farber, A. Mixing ideas: a new technique for working with young children as design partners. Proceedings of the 2004 conference on Interaction design and children: building a community, (2004).  ",
      "doi": "10.1145/1017833.1017838"
    },
    {
      "text": "Moraveji, N., Li, J., Ding, J., O'Kelley, P., and Woolf, S. Comicboarding: using comics as proxies for participatory design with children. Proceedings of the SIGCHI conference on Human factors in computing systems, (2007).  ",
      "doi": "10.1145/1240624.1240832"
    },
    {
      "text": "Ollila, E. M. I., Suomela, R., et al. Using prototypes in early pervasive game development. Comput. Entertain., 6, 2 (2008), 1--17.  ",
      "doi": "10.1145/1371216.1371220"
    },
    {
      "text": "Orr, K. L., Golas, K. C., et al. Storyboard development for interactive multimedia training. Journal of Interactive Instruction Development, 6, 3 (1994), 18--31.",
      "doi": ""
    },
    {
      "text": "Reside, D. The AXE Tool Suite: Tagging Across Time and Space. Proceedings of Digital Humanities, (2007), 178--9.",
      "doi": ""
    },
    {
      "text": "Scaife, M., Rogers, Y., Aldrich, F., and Davies, M. Designing for or designing with? Informant design for interactive learning environments. Proceedings of the SIGCHI conference on Human factors in computing systems, (1997).  ",
      "doi": "10.1145/258549.258789"
    },
    {
      "text": "Snyder, C. Paper prototyping. Morgan Kaufmann. Burlington, Massachusetts, USA, 2003.",
      "doi": ""
    },
    {
      "text": "Walsh, G. Wii can do it: using co-design for creating an instructional game. Proceedings of the 27th international conference extended abstracts on Human factors in computing systems, (2009)  ",
      "doi": "10.1145/1520340.1520722"
    }
  ]
}