{
  "doi": "10.1145/1753326.1753686",
  "title": "Powerful and consistent analysis of likert-type rating scales",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2391-2394",
  "year": 2010,
  "badges": [],
  "abstract": "Likert-type scales are used extensively during usability evaluations, and more generally evaluations of interactive experiences, to obtain quantified data regarding attitudes, behaviors, and judgments of participants. Very often this data is analyzed using parametric statistics like the Student t-test or ANOVAs. These methods are chosen to ensure higher statistical power of the test (which is necessary in this field of research and practice where sample sizes are often small), or because of the lack of software to handle multi-factorial designs nonparametrically. With this paper we present to the HCI audience new developments from the field of medical statistics that enable analyzing multiple factor designs nonparametrically. We demonstrate the necessity of this approach by showing the errors in the parametric treatment of nonparametric data in experiments of the size typically reported in HCI research. We also provide a practical resource for researchers and practitioners who wish to use these new methods.",
  "authors": [
    {
      "name": "Maurits Clemens Kaptein",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435598360",
      "orcid": "missing"
    },
    {
      "name": "Clifford Nass",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153283",
      "orcid": "missing"
    },
    {
      "name": "Panos Markopoulos",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81350577812/rel-imgonly/myphoto.jpg",
      "acmid": "81350577812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "C. A. Boneau. The effects of violations of assumptions underlying the t test. Psychological Bulletin, 57:49--64, 1960.",
      "doi": ""
    },
    {
      "text": "E. Brunner, S. Domhof, and F. Langer. Nonparametric Analysis of Longitudinal Data in Factorial Experiments, volume Total Quality Management. John Wiley & Sons, 2002.",
      "doi": ""
    },
    {
      "text": "E. Brunner and U. Munzel. Nichtparametrische Datenanalyse. Springer, 2002.",
      "doi": ""
    },
    {
      "text": "E. Brunner, U. Munzel, and M. L. Puri. Rank-score tests in factorial designs with repeated measures. Journal of Multivariate Analysis, 70:286--317, 1999.  ",
      "doi": "10.1006/jmva.1999.1821"
    },
    {
      "text": "E. Brunner and M. L. Puri. Nonparametric methods in factorial designs. Statistical Papers, 42:1--51, 2001.",
      "doi": ""
    },
    {
      "text": "J. Carifio and R. Perla. Resolving the 50-year debate around using and misusing Likert scales. Med Educ, 42:1150--52.",
      "doi": ""
    },
    {
      "text": "J. Carifio and R. Perla. Ten Common Misunderstandings, Misconceptions, Persistent Myths and Legends about Likert Scales and Likert Response Formats and their Antidotes. Journal of Social Sciences, 3:106--116.",
      "doi": ""
    },
    {
      "text": "R. A. Cribbie and H. J. Keselman. The effects of nonnormality on parametric, nonparametric, and model comparison approaches to pairwise comparisons. Educational and Psychological Measurement, 63:615--635, 2003.",
      "doi": ""
    },
    {
      "text": "G. V. Glass, P. D. Peckham, and J. R. Sanders. Consequences of failure to meet assumptions underlying the fixed effects analyses of variance and covariance. Review of Educational Research, 42(3):237--288, 1972.",
      "doi": ""
    },
    {
      "text": "M. C. Hart. Improving the discrimination of SERVQUAL by using magnitude scaling, volume Total Quality Management. Chapman & Hall, 1996.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction, 19:319--349, 2004.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "S. Hora and W. Conover. The f-statistic in the two-way layout with rank-score transformed data. Journal of the American Statistical Association, 79:668--673, 1984.",
      "doi": ""
    },
    {
      "text": "R. Likert. A technique for the measurement of attitudes. Journal of Social Psychology, 5:228--238, 1932.",
      "doi": ""
    },
    {
      "text": "U. Munzel and B. Bandelow. The use of parametric versus nonparametric tests in the statistical evaluation of ratings scales. Pharmacopsychiatry, 6:222--224, 1998.",
      "doi": ""
    },
    {
      "text": "J. Preece, Y. Rogers, and Sharp. Interaction Design. John Wiley & Sons, 2002. ",
      "doi": "10.5555/560143"
    },
    {
      "text": "S. S. Sawilowsky and R. C. Blair. A more realistic look at the robustness and type ii error probabilities of the t test to departures from population normality. Psychological Bulletin, 111:352--360, 1992.",
      "doi": ""
    },
    {
      "text": "D. A. Shah and L. V. Madden. Nonparametric analysis of ordinal data in designed factorial experiments. Pythopathology, 94:33--60, 2004.",
      "doi": ""
    },
    {
      "text": "T. Tullis and W. Albert. Measuring the User Experience: Collecting, Analyzing, and Presenting Usability Metrics. Morgan Kaufman, 2008. ",
      "doi": "10.5555/1796012"
    },
    {
      "text": "R. R. Wilcos. Comparing the means of two independent groups. Biometrics Journal, Biometrics Journal, 32:771--780, 1990.",
      "doi": ""
    }
  ]
}