{
  "doi": "10.1145/1753326.1753427",
  "title": "Using text animated transitions to support navigation in document histories",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "683-692",
  "year": 2010,
  "badges": [],
  "abstract": "This article examines the benefits of using text animated transitions for navigating in the revision history of textual documents. We propose an animation technique for smoothly transitioning between different text revisions, then present the Diffamation system. Diffamation supports rapid exploration of revision histories by combining text animated transitions with simple navigation and visualization tools. We finally describe a user study showing that smooth text animation allows users to track changes in the evolution of textual documents more effectively than flipping pages.",
  "tags": [
    "text editing",
    "animated transitions",
    "revision control"
  ],
  "authors": [
    {
      "name": "Fanny Chevalier",
      "institution": "Microsoft-INRIA joint center, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    },
    {
      "name": "Pierre Dragicevic",
      "institution": "INIRA, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723138",
      "orcid": "0000-0002-1854-5899"
    },
    {
      "name": "Anastasia Bezerianos",
      "institution": "Ecole Centrale Paris, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659165855",
      "orcid": "0000-0002-7142-2548"
    },
    {
      "name": "Jean-Daniel Fekete",
      "institution": "INRIA, Orsay, France",
      "img": "/do/10.1145/contrib-81100194446/rel-imgonly/81100194446.jpg",
      "acmid": "81100194446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "C. Appert and J.-D. Fekete. Orthozoom scroller: 1d multi-scale navigation. In Proc. CHI'06, 21--30, 2006.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "B. B. Bederson and A. Boltman. Does animation help users build mental maps of spatial information? In Proc. INFOVIS'99, Washington, DC, USA, 1999. ",
      "doi": "10.5555/857189.857656"
    },
    {
      "text": "A. Bezerianos, P. Dragicevic, and R. Balakrishnan. Mnemonic rendering: an image-based approach for exposing hidden changes in dynamic displays. In Proc. UIST'06, 159--168, 2006.  ",
      "doi": "10.1145/1166253.1166279"
    },
    {
      "text": "U. Brandes and J. Lerner. Visual analysis of controversy in user-generated encyclopedias. Information Visualization, 7(1):34--48, 2008.  ",
      "doi": "10.1145/1391107.1391111"
    },
    {
      "text": "B.-W. Chang and D. Ungar. Animation: from cartoons to the user interface. In Proc. UIST'93, 45--55, 1993.  ",
      "doi": "10.1145/168642.168647"
    },
    {
      "text": "S. Eick, J. Steffen, and E. S. Jr. Seesoft - a tool for visualizing line oriented software statistics. IEEE Transactions on Software Engineering, 18(11):957--968, 1992.  ",
      "doi": "10.1109/32.177365"
    },
    {
      "text": "C. Friedrich and P. Eades. Graph drawing in motion. J. Graph Algorithms Appl., 6(3):353--370, 2002.",
      "doi": ""
    },
    {
      "text": "C. Harrison, B. Amento, S. Kuznetsov, and R. Bell. Rethinking the progress bar. In Proc. UIST'07, 115--118, 2007.  ",
      "doi": "10.1145/1294211.1294231"
    },
    {
      "text": "P. Heckel. A technique for isolating differences between files. Commun. ACM, 21(4):264--268, 1978.  ",
      "doi": "10.1145/359460.359467"
    },
    {
      "text": "J. Heer and G. Robertson. Animated transitions in statistical data graphics. IEEE Trans. on Vis. and Comp. Graphics, 13(6):1240--1247, 2007.  ",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "W. C. Hill, J. D. Hollan, D. Wroblewski, and T. McCandless. Edit wear and read wear. In Proc. CHI '92, 3--9, 1992.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "J. W. Hunt and M. D. McIlroy. An algorithm for differential file comparison. Technical report, Bell Laboratories, 1976.",
      "doi": ""
    },
    {
      "text": "T. Igarashi and K. Hinckley. Speed-dependent automatic zooming for browsing large documents. In Proc. UIST'00, 139--148, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "B.-W. C. Jock, B. wei Chang, J. D. Mackinlay, P. T. Zellweger, and T. Igarashi. A negotiation architecture for fluid documents. In Proc. UIST'98, 123--132, 1998.  ",
      "doi": "10.1145/288392.288585"
    },
    {
      "text": "D. E. M. JohnW. Ratcliff. Pattern matching: The gestalt approach. Dr. Dobbs Journal, 46--51, July 1988.",
      "doi": ""
    },
    {
      "text": "C. Klein and B. B. Bederson. Benefits of animated scrolling. In Proc. CHI'05, 1965--1968, 2005.  ",
      "doi": "10.1145/1056808.1057068"
    },
    {
      "text": "J. C. Lee, J. Forlizzi, and S. E. Hudson. The kinetic typography engine: an extensible system for animating expressive text. In Proc. UIST'02, 81--90, 2002.  ",
      "doi": "10.1145/571985.571997"
    },
    {
      "text": "T. Nakamura and T. Igarashi. An applicationindependent system for visualizing user operation history. In Proc. UIST'08, 23--32, 2008.  ",
      "doi": "10.1145/1449715.1449721"
    },
    {
      "text": "M. Shanmugasundaram and P. Irani. The effect of animated transitions in zooming interfaces. In Proc. AVI'08, 396--399, 2008.  ",
      "doi": "10.1145/1385569.1385642"
    },
    {
      "text": "J. Tam and S. Greenberg. A framework for asynchronous change awareness in collaborative documents and workspaces. Int. J. Hum.-Comput. Stud., 64(7):583--598, 2006.  ",
      "doi": "10.1016/j.ijhcs.2006.02.004"
    },
    {
      "text": "A. Tang, S. Greenberg, and S. Fels. Exploring video streams using slit-tear visualizations. In Proc. AVI'08, 191--198, 2008.  ",
      "doi": "10.1145/1385569.1385601"
    },
    {
      "text": "W. F. Tichy. Rcs--a system for version control. Softw. Pract. Exper., 15(7):637--654, 1985.  ",
      "doi": "10.1002/spe.4380150703"
    },
    {
      "text": "F. B. Viégas, M.Wattenberg, and K. Dave. Studying cooperation and conflict between authors with history flow visualizations. In Proc. CHI'04, 575--582, 2004.  ",
      "doi": "10.1145/985692.985765"
    }
  ]
}