{
  "doi": "10.1145/1753326.1753384",
  "title": "The true cost of unusable password policies: password use in the wild",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "383-392",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "HCI research published 10 years ago pointed out that many users cannot cope with the number and complexity of passwords, and resort to insecure workarounds as a consequence. We present a study which re-examined password policies and password practice in the workplace today. 32 staff members in two organisations kept a password diary for 1 week, which produced a sample of 196 passwords. The diary was followed by an interview which covered details of each password, in its context of use. We find that users are in general concerned to maintain security, but that existing security policies are too inflexible to match their capabilities, and the tasks and contexts in which they operate. As a result, these password policies can place demands on users which impact negatively on their productivity and, ultimately, that of the organisation. We conclude that, rather than focussing password policies on maximizing password strength and enforcing frequency alone, policies should be designed using HCI principles to help the user to set an appropriately strong password in a specific context of use.",
  "tags": [
    "password policy",
    "passwords",
    "usable security"
  ],
  "authors": [
    {
      "name": "Philip G. Inglesant",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418595388",
      "orcid": "missing"
    },
    {
      "name": "M. Angela Sasse",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453650658",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A. and Sasse, M.A. Users Are Not The Enemy. Communications of the ACM 42, 12 (December 1999), 41--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Allan, A. Passwords Are Near the Breaking Point: Gartner Research Note (2004). http://www.indevis.de/dokumente/gartner_passwords_breakpoint.pdf.",
      "doi": ""
    },
    {
      "text": "Beautement, A., Sasse, M.A., and Wonham, M. The Compliance Budget: Managing Security Behaviour in Organisations. In Proc. NSPW 2008, ACM Press (2009), 47--58.  ",
      "doi": "10.1145/1595676.1595684"
    },
    {
      "text": "Brostoff, S. and Sasse, M.A. Safe and Sound: A Safety-Critical Approach to Security. In Proc. NSPW 2001 (2001), 41--50.  ",
      "doi": "10.1145/508171.508178"
    },
    {
      "text": "Brown, B.A.T., Sellen, A.J., and O'Hara, K.P. A Diary Study of Information Capture in Working Life. In Proc. CHI 2000, ACM Press (2000), 438--445.  ",
      "doi": "10.1145/332040.332472"
    },
    {
      "text": "Charmaz, K. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis, SAGE Publications, London, UK, 2006.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Grinter, R.E., Delgado de la Flor, J., and Joseph, M. Security in the wild: user strategies for managing security as an everyday, practical problem. Personal and Ubiquitous Computing 8, 6 (2004), 391--401.  ",
      "doi": ""
    },
    {
      "text": "Electric Alchemy Cracking Passwords in the Cloud: Insights on Password Policies http://news.electricalchemy.net/2009/10/passwordcracking-in-cloud-part-5.html.",
      "doi": ""
    },
    {
      "text": "Federal Information Processing Standards Publication 112: Password Usage (Withdrawn February 2008) (1985) http://www.itl.nist.gov/fipspubs/fip112.htm.",
      "doi": ""
    },
    {
      "text": "Florêncio, D. and Herley, C.A. Large-Scale Study of Web Password Habits. In Proc. WWW 2007, ACM Press (2007), 657--666.  ",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "Florêncio, D., Herley, C., and Coskun, B. Do Strong Web Passwords Accomplish Anything? In Proc. HotSec'07, USENIX Association (2007), Article No. 10. ",
      "doi": "10.5555/1361419.1361429"
    },
    {
      "text": "Herley, C. So Long and No Thanks for the Externalities: The Rational Rejection of Security Advice by Users. In NSPW 2009.  ",
      "doi": "10.1145/1719030.1719050"
    },
    {
      "text": "Morris, R. and Thompson, K. Password security: a case history. Communications of the ACM 22, 11 (November 1979), 594--597.  ",
      "doi": "10.1145/359168.359172"
    },
    {
      "text": "National Institute of Science and Technology NIST Special Publication 800--118: Guide to Enterprise Password Management (Draft): Recommendations of the National Institute of Standards and Technology (2009). http://csrc.nist.gov/publications/drafts/800-118/draft-sp800-118.pdf.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Salzman, M. Voice-Mail Diary Studies for Naturalistic Data Capture under Mobile Conditions. In Proc. CSCW 2002, ACM Press (2002), 87--95.  ",
      "doi": "10.1145/587078.587092"
    },
    {
      "text": "Sasse, M.A., Brostoff, S., and Weirich, D. Transforming the 'weakest link' -- a human/computer interaction approach to usable and effective security. BT Technology Journal 19, 3 (July 2001), 122--131.  ",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "Schneier, B. Secrets and Lies: Digital Security in a Networked World, Wiley, Indianapolis, IN, USA (2000). ",
      "doi": "10.5555/517959"
    },
    {
      "text": "Schneier, B. Write Down Your Password (2005). http://www.schneier.com/blog/archives/2005/06/write_down_your.html.",
      "doi": ""
    },
    {
      "text": "Scientific Software Development, 2006, 'ATLAS.ti The Knowledge Workbench'.",
      "doi": ""
    },
    {
      "text": "Singh, S., Cabraal, A., Demosthenous, C., Astbrink, G., and Furlong, M. Password Sharing: Implications for Security Design Based on Social Practice. In Proc. CHI 2007, ACM Press (2007), 895--904.  ",
      "doi": "10.1145/1240624.1240759"
    },
    {
      "text": "Trust Economics. http://www.trust-economics.org/.",
      "doi": ""
    },
    {
      "text": "Yan, J., Blackwell, A., Anderson, R., and Grant, A. Password Memorability and Security: Empirical Results. IEEE Security & Privacy 2, 5 (September/October 2004), 25--31.  ",
      "doi": "10.1109/MSP.2004.81"
    },
    {
      "text": "Zviran, M. and Haga, W.J. Password Security: An Empirical Study. Journal of Management Information Systems 15, 4 (Spring 1999), 161--185. ",
      "doi": "10.1080/07421222.1999.11518226"
    }
  ]
}