{
  "doi": "10.1145/1753326.1753683",
  "title": "FM radio: family interplay with sonic mementos",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2371-2380",
  "year": 2010,
  "badges": [],
  "abstract": "Digital mementos are increasingly problematic, as people acquire large amounts of digital belongings that are hard to access and often forgotten. Based on fieldwork with 10 families, we designed a new type of embodied digital memento, the FM Radio. It allows families to access and play sonic mementos of their previous holidays. We describe our underlying design motivation where recordings are presented as a series of channels on an old fashioned radio. User feedback suggests that the device met our design goals: being playful and intriguing, easy to use and social. It facilitated family interaction, and allowed ready access to mementos, thus sharing many of the properties of physical mementos that we intended to trigger.",
  "authors": [
    {
      "name": "Daniela Petrelli",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100189751",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Villar",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100599166",
      "orcid": "missing"
    },
    {
      "name": "Vaiva Kalnikaite",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384614073",
      "orcid": "missing"
    },
    {
      "name": "Lina Dib",
      "institution": "Rice University, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456610712",
      "orcid": "missing"
    },
    {
      "name": "Steve Whittaker",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boardman R. and Sasse, M. A., Stuff Goes in the Computer but it Doesn't Come Out, CHI 2004, ACM Press (2004), 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Crabtree, A., Rodden, T., Mariani, J. Collaborating around collections: informing the continued development of photoware. CSCW2004, ACM Press (2004), 396--405.  ",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Dib, L., Petrelli, D., Whittaker, S. Sonic Souvenirs: Exploring the paradoxes of Recorded Sound for Family Remembering. CSCW 2010, ACM Press (2010)  ",
      "doi": "10.1145/1718918.1718985"
    },
    {
      "text": "Droumeva, M., Antle, A, Wakkary, R. Exploring ambient sound techniques in the design of responsive environments for children. TEI 2007, ACM Press (2007).  ",
      "doi": "10.1145/1226969.1227005"
    },
    {
      "text": "Frohlich, D. Audiophotography --- Bringing photos to life with sounds. Kluver Academic Publisher (2004). ",
      "doi": "10.5555/1210132"
    },
    {
      "text": "Frohlich, D. and Murphy, R. The Memory Box, Personal and Ubiquitous Computing (2000), 4 (4), 238--240.  ",
      "doi": "10.1007/PL00000011"
    },
    {
      "text": "Frohlich, D. et al (2009) StoryBank: Mobile Digital Storytelling in a Development Context. Proc. CHI 2009  ",
      "doi": "10.1145/1518701.1518972"
    },
    {
      "text": "Halbwachs, M. On Collective Memory, University of Chicago Press, (1992).",
      "doi": ""
    },
    {
      "text": "Hoven, E. van den, and Eggen, B. Informing Augmented Memory System design through Autobiographical Memory theory. Personal and Ubiquitous Computing, 12, 6 (2008), 433--443.  ",
      "doi": "10.1007/s00779-007-0177-9"
    },
    {
      "text": "D. Kirk, A. Sellen, S. Izadi, S. Taylor and N. Villar, Putting the physical into the digital: Issues in designing hybrid interactive surfaces, BCS HCI 2009, (2009). ",
      "doi": "10.5555/1671011.1671016"
    },
    {
      "text": "Kim, J. and Zimmerman, J. (2006) Cherish: Smart Digital Photo Frames for Sharing Social Narratives at Home. CHI 2006 --- Extended Abstracts, 953--958.  ",
      "doi": "10.1145/1125451.1125635"
    },
    {
      "text": "Nunes, M., Greenberg, S., Neustaedter, C. Sharing digital photographs in the home through physical mementos, souvenirs, and keepsakes. DIS '08, ACM Press (2008), 250--260.  ",
      "doi": "10.1145/1394445.1394472"
    },
    {
      "text": "Oleksik, G, Frholich, D., Brown, L., Sellen, A. Sonic interventions: understanding and extending the domestic soundscape. CHI 2008, ACM Press,1419--1428.  ",
      "doi": "10.1145/1357054.1357277"
    },
    {
      "text": "Oleksik, G., Brown, L. Sonic gems: exploring the potential of audio recording as a form of sentimental memory capture. In BCS HCI 2008. ",
      "doi": "10.5555/1531514.1531537"
    },
    {
      "text": "Petrelli, D., Whittaker, S. and Brockmeier, J. Autotopography: What can physical mementos tell us about digital memories?, CHI'08, ACM Press.  ",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "Petrelli, D, and Whittaker, S. Family Memories in the Home: Contrasting Physical and Digital Mementos. Personal & Ubiquitous Computing, (2009).  ",
      "doi": "10.1007/s00779-009-0279-7"
    },
    {
      "text": "Reeves, S., Benford, S., O'Malley, C., Fraser, M. Designing the spectator experience. In CHI 2007, ACM Press (2007), 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Shen, C., Leash, N. and Vernier, F. Personal digital historian: story sharing around the table. Interactions (2003) 10 (2), 15--22.  ",
      "doi": "10.1145/637848.637856"
    },
    {
      "text": "Stevens, M., Abowd, G., Truong, K., Vollmer, F. Getting into the Living Memory Box: Family archives & holistic design. Personal and Ubiquitous Computing, 7, (2003)210--216.  ",
      "doi": "10.1007/s00779-003-0220-4"
    },
    {
      "text": "Taylor, A., Swan, S., and Durrant, A. Designing Family Photo Displays. ECSCW'07, Springer (2007), 79--99.",
      "doi": ""
    },
    {
      "text": "Wall, S., Brewster, S. Feeling what you hear: tactile feedback for navigation of audio graphs. In CHI 2006, ACM Press (2006), 1123--1132.  ",
      "doi": "10.1145/1124772.1124941"
    },
    {
      "text": "Wang, Q. and Brockmeier, J. (2002) Autobiographical remembering as cultural practice: Understanding the interplay between memory, self and culture, Cultural Psychology, 8 (45), 45--64",
      "doi": ""
    },
    {
      "text": "Williamson, J., Murray-Smith, R., Hughes, S. Shoogle: excitatory multimodal interaction on mobile devices. In CHI 2007, ACM Press (2007), 121--124.  ",
      "doi": "10.1145/1240624.1240642"
    },
    {
      "text": "Whittaker, S, Bergman, O, Clough, P. Easy on that trigger dad: a study of long term family photo retrieval. Personal and Ubiquitous Computing, March, (2009).  ",
      "doi": "10.1007/s00779-009-0218-7"
    },
    {
      "text": "Whittaker, S., Hirschberg, J. et al. SCANMail: a voicemail interface that makes speech browsable, readable and searchable. CHI2002, ACM Press (2002).  ",
      "doi": "10.1145/503376.503426"
    }
  ]
}