{
  "doi": "10.1145/1753326.1753494",
  "title": "Pointassist for older adults: analyzing sub-movement characteristics to aid in pointing tasks",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1115-1124",
  "year": 2010,
  "badges": [],
  "abstract": "Perceptual, cognitive and motor deficits cause many older adults to have difficulty conducting pointing tasks on computers. Many strategies have been discussed in the HCI community to aid older adults and others in pointing tasks. We present a different approach in PointAssist, software that aids in pointing tasks by analyzing the characteristics of sub-movements, detecting when users have difficulty pointing, and triggering a precision mode that slows the speed of the cursor in those cases. PointAssist is designed to help maintain pointing skills, runs as a background process working with existing software, is not vulnerable to clusters of targets or targets in the way, and does not modify the visual appearance or the feel of user interfaces. There is evidence from a prior study that PointAssist helps young children conduct pointing tasks. In this paper, we present a study evaluating PointAssist with twenty older adults (ages 66-88). The study participants benefited from greater accuracy when using PointAssist, when compared to using the \"enhance pointer precision\" option in Windows XP. In addition, we provide evidence of correlations between neuropsychological measures, pointing performance, and PointAssist detecting pointing difficulty.",
  "authors": [
    {
      "name": "Juan Pablo Hourcade",
      "institution": "University of Iowa, Iowa City, IA, USA",
      "img": "/do/10.1145/contrib-81100553487/rel-imgonly/jph-july-2011.jpg",
      "acmid": "81100553487",
      "orcid": "missing"
    },
    {
      "name": "Christopher M. Nguyen",
      "institution": "University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641188",
      "orcid": "missing"
    },
    {
      "name": "Keith B. Perry",
      "institution": "University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489779",
      "orcid": "missing"
    },
    {
      "name": "Natalie L. Denburg",
      "institution": "University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655481",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlström, D., Hitz, M. & Leitner, G. (2006). An evaluation of sticky and force enhanced targets in multi target situations. Proceedings of NordiCHI 2006. ACM Press: pp. 58--67.  ",
      "doi": "10.1145/1182475.1182482"
    },
    {
      "text": "Bechara, A., Damasio, A.R., Damasio, H., & Anderson, S.W. (1994). Insensitivity to future consequences following damage to human prefrontal cortex. Cognition, 50, 7--15.",
      "doi": ""
    },
    {
      "text": "Blanch, R., Guiard, Y. & Beaudouin-Lafon, M. (2004). Semantic Pointing: Improving Target Acquisition with Control-Display Ratio Adaptation. CHI Letters, 6(1), 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Blanch, R. and Ortega, M. (2009). Rake cursor: improving pointing performance with concurrent input channels. In Proceedings of CHI '09. ACM Press: pp. 1415--1418  ",
      "doi": "10.1145/1518701.1518914"
    },
    {
      "text": "Carey, J.R., Bhatt, E. and Nagpal, A. (2005). Neuroplasticity promoted by task complexity. Exerc. Sport Sci. Rev., 33(1), 24--31.",
      "doi": ""
    },
    {
      "text": "Carnahan, H., Goodale, M.A. and Marteniuk, R.G. (1993). Grasping versus pointing and the differential use of visual feedback. Human Movement Science, 12, 219--234.",
      "doi": ""
    },
    {
      "text": "Casiez, G., Vogel, D., Balakrishnan, R. and Cockburn, A. (2008) The impact of control-display gain on user performance in pointing tasks. Human-Computer Interaction 23 (3), 215--250.",
      "doi": ""
    },
    {
      "text": "Chaparro, A., Bohan, M., Fernandez, J.E., Choi, S.D. and Kattel, B. (1999). The impact of age on computer input device use: psychophysical and physiological measures. International Journal of Industrial Ergonomics, 24, 503--513.",
      "doi": ""
    },
    {
      "text": "Chaparro, A., Rogers, M., Fernandez, J., Bohan, M., Choi, S.D. and Stumpfhauser, L. (2000) Range of motion of the wrist: implications for designing computer input devices for the elderly. Disability and Rehabilitation, 22, 633--637.",
      "doi": ""
    },
    {
      "text": "Chapuis, O., Labrune, J., and Pietriga, E. (2009). DynaSpot: speed-dependent area cursor. In Proceedings of CHI '09. ACM Press: pp. 1391--1400.  ",
      "doi": "10.1145/1518701.1518911"
    },
    {
      "text": "Denburg, N. L., Tranel, D., & Bechara, A. (2005). The ability to decide advantageously declines prematurely in some normal older persons. Neuropsychologia, 43, 1099--1106.",
      "doi": ""
    },
    {
      "text": "Elliott, D., Hansen, S., Mendoza, J, Tremblay, L. (2004). Learning to optimize speed, accuracy, and energy expenditure: a framework for understanding speed-accuracy relations in goal-directed aiming. J Motor Behav, 36, 339--351.",
      "doi": ""
    },
    {
      "text": "Fastenau P.S., Denburg N.L., Hufford B.J. (1999). Adult norms for the Rey-Osterrieth Complex Figure Test and for supplemental recognition and matching trials from the Extended Complex Figure Test. Clin Neuropsychol., 13(1), 30--47.",
      "doi": ""
    },
    {
      "text": "Gajos, K.Z., Weld, D.S. and Wobbrock, J.O. (2008a). Decision-theoretic user interface generation. Proceedings of AAAI 2008. ACM Press. ",
      "doi": "10.5555/1620270.1620326"
    },
    {
      "text": "Gajos, K.Z., Wobbrock, J.O., and Weld, D.S. (2008b). Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. In Proceeding of CHI '08. ACM Press: pp. 1257--1266.  ",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Goggin, N.L. and Meeuwsen, H.J. (1992). Age-related differences in the control of spatial aiming. Research Quarterly for Exercise and Sport, 63, 366--372.",
      "doi": ""
    },
    {
      "text": "Grossman, T. & Balakrishnan, R. (2005). The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. Proceedings of Human Factors in Computing Systems (CHI 2005). ACM Press: 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R. and Beaudouin-Lafon, M. (2004) Object pointing: A complement to bitmap pointing in GUIs. Proceedigns of GI '04. Canadian Human-Computer Communications Society: pp. 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Hourcade, J.P. (2006). Learning from Preschool Children's Pointing Sub-Movements. Proceedings of Interaction Design and Children (IDC 2006). ACM Press: pp. 65--72.  ",
      "doi": "10.1145/1139073.1139093"
    },
    {
      "text": "Hourcade, J.P., Perry, K.B. and Sharma, A. (2008). PointAssist: Helping Four Year Olds Point with Ease. Proceedings of Interaction Design and Children 2008.  ",
      "doi": "10.1145/1463689.1463757"
    },
    {
      "text": "Hourcade, J.P. and Berkel, T.R. (2008). Simple pen interaction performance of young and older adults using handheld computers. Interacting with Computers, 20(1), 166--183.  ",
      "doi": "10.5555/1327552.1327929"
    },
    {
      "text": "Hourcade, J.P., Bederson, B.B., Druin, A. & Guimbretiere, F. (2004). Differences in Pointing Task Performance Between Preschool Children and Adults Using Mice. ACM Transactions on Computer-Human Interaction (TOCHI), 11(4), 357--386.  ",
      "doi": "10.1145/1035575.1035577"
    },
    {
      "text": "Hourcade, J.P., Crowther, M. & Hunt, L. (2007). Does Mouse Size Affect Study and Evaluation Results? A Study Comparing Preschool Children's Performance with Small and Regular-Sized Mice. Proceedings of Interaction Design and Children 2007. ACM Press: pp. 109--116.  ",
      "doi": "10.1145/1297277.1297300"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P. and Clarkson, J. (2004). Mouse movements of motion-impaired users: a submovement analysis. Proceedings of ASSETS 04. ACM Press: pp. 102--109.  ",
      "doi": "10.1145/1028630.1028649"
    },
    {
      "text": "Hwang, F., Batson, H., and Williams, N. (2008). Bringing the target to the cursor: proxy targets for older adults. In Extended Abstracts of CHI '08. ACM Press: pp. 2775--2780.  ",
      "doi": "10.1145/1358628.1358760"
    },
    {
      "text": "Ivnik, R.J., Malec, J.F., Tangalos, E.G., Peterson, R.C., Kokmen, E., and Kurland, L.T. (1990). The Auditory-Verbal Learning Test (AVLT): Norms for ages 55 years and older. Psychological Assessment: A Journal of Consulting and Clinical Psychology, 2(3), 304--312",
      "doi": ""
    },
    {
      "text": "Keates, S., Clarkson, J., and Robinson, P. (2000). Investigating the applicability of user models for motion-impaired users. Proceedings of Assets '00. ACM Press: pp. 129--136.  ",
      "doi": "10.1145/354324.354354"
    },
    {
      "text": "Keates, S. and Trewin, S. (2005). Effect of age and Parkinson's disease on cursor positioning using a mouse. Proceedings of ASSETS, 2005. ACM Press, pp. 68--75.  ",
      "doi": "10.1145/1090785.1090800"
    },
    {
      "text": "Ketcham, C.J., Seidler, R.D., van Gemmert, A.W.A. and Stelmach, G.E. (2002). Age-related kinematic differences as influenced by task difficulty, target size, and movement amplitude. Journal of Gerontology: Psychological Sciences, 57B, 54--64.",
      "doi": ""
    },
    {
      "text": "Khan, M.A. & Franks, I.M. (2000). The effect of practice on component submovements is dependent on the availability of visual feedback. Journal of Motor Behavior, 32, 227--240.",
      "doi": ""
    },
    {
      "text": "Khan, M.A., Hale, T., Garry, M.I. & Franks, I.M. (2002). Separate Sources of Spatial Information for Distance and Location in Rapid Aiming Movements. Motor Control, 6, 84--103.",
      "doi": ""
    },
    {
      "text": "Koester, H.H., LoPresti, E., and Simpson, R.C. (2005). Toward Goldilocks' pointing device: determining a \"just right\" gain setting for users with physical impairments. Proceedings of Assets '05. ACM Press: pp. 84--89.  ",
      "doi": "10.1145/1090785.1090802"
    },
    {
      "text": "Krampe, R.Th. and Ericsson, K.A. (1996). Maintaining excellence: deliberate practice and elite performance in young and older pianists. Journal of Experimental Psychology: General, 125(4), 331--359.",
      "doi": ""
    },
    {
      "text": "Lank, E., Cheng, Y.N., and Ruiz, J. (2007). Endpoint prediction using motion kinematics. Proceedings of CHI '07. ACM Press: pp. 637--646.  ",
      "doi": "10.1145/1240624.1240724"
    },
    {
      "text": "Lyons, J. Elliott, D., Swanson, L.R. and Chua, R. (1996). The use of vision and manual aiming by young and older adults. Journal of Aging and Physical Activity, 4, 165--178.",
      "doi": ""
    },
    {
      "text": "Mandryk, R.L. and Gutwin, C. (2008) Perceptibility and utility of sticky targets. Proceedings of GI '08. Canadian Human-Computer Communications Society: pp. 65--72. ",
      "doi": "10.5555/1375714.1375726"
    },
    {
      "text": "McGuffin, M. & Balakrishnan, R. (2002). Acquisition of Expanding Targets. CHI Letters, 4(1), 57--64.",
      "doi": ""
    },
    {
      "text": "Meyer, De, Abrams, RA, Kornblum, S, Wright CE, Smith, JE. (1988). Optimality in human motor performance: ideal control of rapid aimed movements. Psychol Review, 95(3), 340--370.",
      "doi": ""
    },
    {
      "text": "Mithal, A.K. & Douglas, S.A. (1996). Differences in Movement Microstructure of the Mouse and Finger-Controlled Isometric Joystick. Proceedings of Human Factors in Computing Systems (CHI 96). ACM Press: 300--307.  ",
      "doi": "10.1145/238386.238533"
    },
    {
      "text": "Moffatt, K.A. and McGrenere, J. (2007). Slipping and drifting: using older users to uncover pen-based target acquisition difficulties. Proceedings of Assets '07. ACM Press: pp. 11--18.  ",
      "doi": "10.1145/1296843.1296848"
    },
    {
      "text": "Morris, M.E. (2000). Movement disorders in people with Parkinson Disease: a model for physical therapy. Physical Therapy, 80(6), 578--597.",
      "doi": ""
    },
    {
      "text": "Patten, C. (2000). Reeducating Muscle Force Control in Older Persons through Strength Training. Topics in Geriatric Rehabilitation, 15(3), 47--59.",
      "doi": ""
    },
    {
      "text": "Pohl, P.S. and Winstein, C.J. (1998). Age-Related Effects on Temporal Strategies to Speed Motor Performance. Journal of Aging and Physical Activity, 6, 45--61.",
      "doi": ""
    },
    {
      "text": "Pratt, J., Chasteen, A.L. and Abrams, R.A. (1996). Rapid aimed limb movements: Age differences and practice effects in component submovmeents. Psychology and Aging, 9, 325--334.",
      "doi": ""
    },
    {
      "text": "Ruff, R.M., Parker, S.B. (1993). Gender- and age-specific changes in motor speed and eye-hand coordination in adults: normative values for the Finger Tapping and Grooved Pegboard Tests. Percept Mot Skills 1993, 76, 1219--30.",
      "doi": ""
    },
    {
      "text": "Sanders, M.S. & McCormick, E.J. (1993). Human Factors in Engineering and Design. Seventh Edition. New York: McGraw-Hill.",
      "doi": ""
    },
    {
      "text": "Seidler-Dobrin R.D. and Stelmach, G.E. (1998). Persistence in visual feedback control by the elderly, Experimental Brain Research, 119, 467--474.",
      "doi": ""
    },
    {
      "text": "Smith, M.W., Sharit, J. and Czaja, S.J. (1999). Aging, motor control, and the performance of computer mouse tasks. Human Factors, 41(3), 389--396.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. (2004). Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies, 61(6), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Trewin, S., Keates, S., and Moffatt, K. (2006). Developing steady clicks: a method of cursor assistance for people with motor impairments. Proceedings of Assets '06. ACM Press: pp. 26--33.  ",
      "doi": "10.1145/1168987.1168993"
    },
    {
      "text": "van Mensvoort, K. (2008). PowerCursor. Available at powercursor.com.",
      "doi": ""
    },
    {
      "text": "Walker, N., Philbin, D.A. and Fisk, A.D. (1997). Age related differences in movement control: adjusting submovement structure to optimize performance. Journal of Gerontology: Psychological Sciences, 52B, 40--52.",
      "doi": ""
    },
    {
      "text": "Wechsler, D. (1999). Wechsler Abbreviated Scale of Intelligence. San Antonio, TX.: The Psychological Corporation.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. and Gajos, K. (2008). Goal Crossing with Mice and Trackballs for People with Motor Impairments: Performance, Submovements, and Design Directions. ACM Trans. Access. Comput. 1(1), 1--37.  ",
      "doi": "10.1145/1361203.1361207"
    },
    {
      "text": "Wobbrock, J. O., Fogarty, J., Liu, S., Kimuro, S., and Harada, S. (2009). The angle mouse: target-agnostic dynamic gain adjustment based on angular deviation. In Proceedings of CHI '09. ACM Press: pp. 1401--1410  ",
      "doi": "10.1145/1518701.1518912"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., and Hudson, S. (1997). Making Computers Easier for Older Adults to Use: Area Cursors and Sticky Icons. Proceedings of Human Factors in Computing Systems (CHI 97). ACM Press, pp. 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Yan, J.H., Thomas, J.R. and Stelmach, G.E. (1998). Aging and Rapid Aiming Arm Movement Control. Experimental Aging Research, 24, 155--168.",
      "doi": ""
    },
    {
      "text": "Zhai, S., Conversy, S., Beaudouin-Lafon, M. & Guiard, Y. (2003). Human On-line Response to Target Expansion. CHI Letters, 5(1), 177--184.  ",
      "doi": "10.1145/642611.642644"
    }
  ]
}