{
  "doi": "10.1145/1753326.1753560",
  "title": "Moving beyond untagging: photo privacy in a tagged world",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1563-1572",
  "year": 2010,
  "badges": [],
  "abstract": "Photo tagging is a popular feature of many social network sites that allows users to annotate uploaded images with those who are in them, explicitly linking the photo to each person's profile. In this paper, we examine privacy concerns and mechanisms surrounding these tagged images. Using a focus group, we explored the needs and concerns of users, resulting in a set of design considerations for tagged photo privacy. We then designed a privacy enhancing mechanism based on our findings, and validated it using a mixed methods approach. Our results identify the social tensions that tagging generates, and the needs of privacy tools to address the social implications of photo privacy management.",
  "authors": [
    {
      "name": "Andrew Besmer",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361607803",
      "orcid": "missing"
    },
    {
      "name": "Heather Richter Lipford",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657300",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "F. Adu-Oppong, C. K. Gardiner, A. Kapadia, and P. P. Tsang. Social circles: Tackling privacy in social networks. July 2008. Poster presented at SOUPS 2008.",
      "doi": ""
    },
    {
      "text": "S. Ahern, D. Eckles, N. S. Good, S. King, M. Naaman, and R. Nair. Over-exposed?: Privacy patterns and considerations in online and mobile photo sharing. In Proceedings of the SIGCHI conference on Human factors in computing systems, pages 357--366, San Jose, California, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240683"
    },
    {
      "text": "I. Altman. The Environment and Social Behavior: Privacy, Personal Space, Territory, Crowding. Brooks/-Cole Pub. Co, Monterey, Calif, 1975.",
      "doi": ""
    },
    {
      "text": "M. Ames and M. Naaman. Why we tag: Motivations for annotation in mobile and online media. In Proceedings of the SIGCHI conference on Human factors in computing systems, pages 971--980, San Jose, California, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "danah michele boyd. Friendster and publicly articulated social networking. In CHI '04 extended abstracts on Human factors in computing systems, pages 1279--1282, Vienna, Austria, 2004. ACM.  ",
      "doi": "10.1145/985921.986043"
    },
    {
      "text": "danah michele boyd and J. Heer. Profiles as conversation: Networked identity performance on friendster. In System Sciences, 2006. HICSS '06. Proceedings of the 39th Annual Hawaii International Conference on, volume 3, page 59c, 2006.  ",
      "doi": "10.1109/HICSS.2006.394"
    },
    {
      "text": "J. M. DiMicco and D. R. Millen. Identity management: Multiple presentations of self in Facebook. In Proceedings of the 2007 international ACM conference on Supporting group work, pages 383--386, Sanibel Island, Florida, USA, 2007. ACM.  ",
      "doi": "10.1145/1316624.1316682"
    },
    {
      "text": "Facebook. Statistics. http://www.facebook.com/press/info.php?statistics, 2009.",
      "doi": ""
    },
    {
      "text": "E. Gilbert and K. Karahalios. Predicting tie strength with social media. In Proceedings of the 27th international conference on Human factors in computing systems, pages 211---220, Boston, MA, USA, 2009. ACM.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "R. Gross and A. Acquisti. Information revelation and privacy in online social networks. In Proceedings of the 2005 ACM workshop on Privacy in the electronic society, pages 71--80, Alexandria, VA, USA, 2005. ACM.  ",
      "doi": "10.1145/1102199.1102214"
    },
    {
      "text": "P. Kumaraguru and L. F. Cranor. Privacy indexes: A survey of westins studies. Institute for Software Research International, 2005.",
      "doi": ""
    },
    {
      "text": "A. D. Miller and W. K. Edwards. Give and take: A study of consumer photo-sharing culture and practice. In Proceedings of the SIGCHI conference on Human factors in computing systems, pages 347--356, San Jose, California, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "J. Palank. Face it: Book no secret to employers -- The Washington Post, July 2006.",
      "doi": ""
    },
    {
      "text": "L. Palen and P. Dourish. Unpacking \"privacy\" for a networked world. In Proceedings of the SIGCHI conference on Human factors in computing systems, pages 129--136, Ft. Lauderdale, Florida, USA, 2003. ACM.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "15. A. Romano. Walking a new beat: Surfing MySpace.com helps cops crack the case. -- Newsweek, Apr. 2006.",
      "doi": ""
    },
    {
      "text": "Z. Stone, T. Zickler, and T. Darrell. Autotagging facebook: Social network context improves photo annotation. In Computer Vision and Pattern Recognition Workshops, 2008. CVPRW '08. IEEE Computer Society Conference on, pages 1--8, 2008.",
      "doi": ""
    },
    {
      "text": "K. Strater and H. R. Lipford. Strategies and struggles with privacy in an online social networking community. In Proceedings of the 22nd British HCI Group Annual Conference on HCI 2008: People and Computers XXII: Culture, Creativity, Interaction -- Volume 1, pages 111--119, Liverpool, United Kingdom, 2008. British Computer Society. ",
      "doi": "10.5555/1531514.1531530"
    },
    {
      "text": "K. W. Thomas. Conflict and conflict management: Reflections and update. Journal of Organizational Behavior, 13(3):265--274, May 1992.",
      "doi": ""
    }
  ]
}