{
  "doi": "10.1145/1753326.1753623",
  "title": "Lessons learned from blog muse: audience-based inspiration for bloggers",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1965-1974",
  "year": 2010,
  "badges": [],
  "abstract": "Blogging in the enterprise is increasingly popular and recent research has shown that there are numerous benefits for both individuals and the organization, e.g. developing reputation or sharing knowledge. However, participation is very low, blogs are often abandoned and few users realize those benefits. We have designed and implemented a novel system -- called Blog Muse -- whose goal is to inspire potential blog writers by connecting them with their audience through a topic-suggestion system. We describe our system design and report results from a 4-week study with 1004 users who installed our tool. Our data indicate that topics requested by users are effective at inspiring bloggers to write and lead to more social interactions around the resulting entries.",
  "authors": [
    {
      "name": "Casey Dugan",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340488769",
      "orcid": "0000-0002-1508-2091"
    },
    {
      "name": "Werner Geyer",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100543332/rel-imgonly/wgeyer_100x100.jpg",
      "acmid": "81100543332",
      "orcid": "0000-0003-4699-5026"
    },
    {
      "name": "David R. Millen",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100086599/rel-imgonly/81100086599.jpg",
      "acmid": "81100086599",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S. and McDonald, D. W. 1996. Answer Garden 2: Merging Organizational Memory with Collaborative Help. In Proc CSCW'96.  ",
      "doi": "10.1145/240080.240203"
    },
    {
      "text": "Baumer, E., Sueyoshi, M., Tomlinson, B. 2008. Exploring the role of the reader in the activity of blogging. In Proc. CHI'08, 1111--1120  ",
      "doi": "10.1145/1357054.1357228"
    },
    {
      "text": "Burke, R. Hybrid Recommender Systems: Survey and Experiments. User Modeling and User-Adapted Interaction. 12(4), 331--370.  ",
      "doi": "10.1023/A%3A1021240730564"
    },
    {
      "text": "Chen, J., Geyer, W., Dugan, C., Muller, M., and Guy, I. 2009. Make new friends, but keep the old: recommending people on social networking sites. In Proc CHI '09. ACM, New York, NY, 201--210.  ",
      "doi": "10.1145/1518701.1518735"
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., and Riedl, J. 2006. Using Intelligent Task Routing and Contribution Review to Help Communities Build Artifacts of Lasting Value. In Proc CHI'06. 1037--1046  ",
      "doi": "10.1145/1124772.1124928"
    },
    {
      "text": "Efimova, L., Grudin, J. Cross Boundaries: A Case Study of Employee Blogging. In Proc HICSS'07, IEEE Press.  ",
      "doi": "10.1109/HICSS.2007.159"
    },
    {
      "text": "Ehrlich, K., Lin, C., and Griffiths-Fisher, V. 2007. Searching for experts in the enterprise: combining text and social network analysis. Proc Group'07, 117--126.  ",
      "doi": "10.1145/1316624.1316642"
    },
    {
      "text": "Farzan, R., DiMicco, J., Millen, D. R., Dugan, C., Geyer, W. and Brownholtz, E. Results from deploying a participation incentive mechanism within the enterprise. Proc. CHI'08, (2008), 563--572.  ",
      "doi": "10.1145/1357054.1357145"
    },
    {
      "text": "Geyer, W., Dugan, C. 2009. Inspired by the Audience -- A Topic Suggestion System for Blog Writers and Readers. To appear: Proc. CSCW'10.  ",
      "doi": "10.1145/1718918.1718964"
    },
    {
      "text": "Geyer, W., Dugan, C., DiMicco, J., Millen, D. R., Brownholtz, B., Muller, M. 2008. Use and reuse of shared lists as a social content type. In Proc CHI'08.  ",
      "doi": "10.1145/1357054.1357296"
    },
    {
      "text": "Geyer, W., Dugan, C., Millen, D.R., Muller, M., Freyne, J. 2008. Recommending Topics for Self-Descriptions in Online User Profiles. In Proc RecSys'08, 59--66.  ",
      "doi": "10.1145/1454008.1454019"
    },
    {
      "text": "Groh, G., & Ehmig, C. 2007. Recommendations in Taste Related Domains: Collaborative Filtering vs. Social Filtering. In Proc ACM Group'07. 127--136.  ",
      "doi": "10.1145/1316624.1316643"
    },
    {
      "text": "Gurzick, D., Lutters, W. G. From Personal to the Profound: Understanding the Blog Life Cycle. In Proc CHI'06, 827--832.  ",
      "doi": "10.1145/1125451.1125614"
    },
    {
      "text": "Harper, F.M., Frankowski, D., Drenner, S., Ren, Y.,Kiesler, S.Terveen, L.,Kraut, R., and Riedl, J. Talk Amongst Yourselves: Inviting Users to Participate in Online Conversations. In Proc. IUI'07, (2007), 62--71.  ",
      "doi": "10.1145/1216295.1216313"
    },
    {
      "text": "Herlocker , J. L., Konstan, J.A. , Riedl, J. 2000. Explaining collaborative filtering recommendations. In Proc ACM CSCW'00. 241--250.  ",
      "doi": "10.1145/358916.358995"
    },
    {
      "text": "Herring, S.C., Scheidt, L.A., Bonus, S., Wright, E. Bridging the Gap: A Genre Analysis of Weblogs. In Proc HICSS'04, IEEE Press. ",
      "doi": "10.5555/962752.962976"
    },
    {
      "text": "Huh, J., Jones, L., Erickson, T., Kellogg, W. A., Bellamy, R. K., and Thomas, J. C. BlogCentral: the role of internal blogs at work. In Proc CHI '07, 2447--2452.  ",
      "doi": "10.1145/1240866.1241022"
    },
    {
      "text": "Jackson, A., Yates, J., Orlikowski, W. Corporate Blogging: Building community through persistent digital talk. In Proc HICSS'07, IEEE Press.  ",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "McDonald, D. W. 2003. Recommending collaboration with social networks: a comparative evaluation. In Proc ACM CHI'03, 593--600.  ",
      "doi": "10.1145/642611.642714"
    },
    {
      "text": "McDonald, David W. and Ackerman, Mark S. 2000: Expertise Recommender: A Flexible Recommendation System and Architecture. In Proc CSCW'00, 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Mooney, R. J., & Roy, L. 2000. Content-based book recommending using learning for text categorization. In Proc ACM DL'00.195--204.  ",
      "doi": "10.1145/336597.336662"
    },
    {
      "text": "Nardi, B. A., Schiano, D. J., and Gumbrecht, M. Blogging as social activity, or, would you let 900 million people read your diary?. In Proc. CSCW '04.  ",
      "doi": "10.1145/1031607.1031643"
    },
    {
      "text": "Nardi, B. A., Schiano, D. J., and Gumbrecht, M., Swartz, L. 2004. Why we blog. CACM, Vol. 47, No.12, 41--46.  ",
      "doi": "10.1145/1035134.1035163"
    },
    {
      "text": "Pazzani, M. J., Muramatsu, J., & Billsus, D. 1996. Syskill webert: Identifying interesting web sites. AAAI/IAAI, Vol. 1, 54--61. ",
      "doi": "10.5555/1892875.1892883"
    },
    {
      "text": "Resnick, Paul and Varian, Hal. Recommender Systems, introduction to special section of Communications of the ACM, March 1997, vol. 40(3).  ",
      "doi": "10.1145/245108.245121"
    },
    {
      "text": "Sen, S., Geyer, W., Muller, M., Moore, M., Brownholtz, B., Wilcox, E., & Millen, D.R. 2006. FeedMe: a collaborative alert filtering system. In Proc. ACM CSCW'06. 89--98.  ",
      "doi": "10.1145/1180875.1180890"
    },
    {
      "text": "Sinha, R. and Swearingen, K. Comparing Recommendations made by Online Systems and Friends. Proc. DELOS-NSF Workshop on Personalization and Recommender Systems in Digital Libraries, (2001).",
      "doi": ""
    },
    {
      "text": "Spertus, E., Sahami, M., and Buyukkokten, O. 2005 Evaluating similarity measures: a large-scale study in the Orkut social network. In Proc SIGKDD'05. 678--684.  ",
      "doi": "10.1145/1081870.1081956"
    },
    {
      "text": "Sun, L. and Vassileva, J. 2006. Social Visualization Encouraging Participation in Online Communities. Groupware: Design, Implementation, and Use, 349--363.  ",
      "doi": "10.1007/11853862_28"
    },
    {
      "text": "Swearingen, K. and Sinha, R. 2002. Interaction Design for Recommender Systems. In Proc DIS'02.",
      "doi": ""
    },
    {
      "text": "http://technorati.com/blogging/state-of-the-blogosphere/",
      "doi": ""
    },
    {
      "text": "Yardi, S., Golder, S. A., and Brzozowski, M. J. Blogging at work and the corporate attention economy. In Proc CHI '09. 2071--2080.  ",
      "doi": "10.1145/1518701.1519016"
    }
  ]
}