{
  "doi": "10.1145/1753326.1753502",
  "title": "Opinion space: a scalable tool for browsing online comments",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1175-1184",
  "year": 2010,
  "badges": [],
  "abstract": "Internet users are increasingly inclined to contribute comments to online news articles, videos, product reviews, and blogs. The most common interface for comments is a list, sorted by time of entry or by binary ratings. It is widely recognized that such lists do not scale well and can lead to \"cyberpolarization,\" which serves to reinforce extreme opinions. We present Opinion Space: a new online interface incorporating ideas from deliberative polling, dimensionality reduction, and collaborative filtering that allows participants to visualize and navigate through a diversity of comments. This self-organizing system automatically highlights the comments found most insightful by users from a range of perspectives. We report results of a controlled user study. When Opinion Space was compared with a chronological List interface, participants read a similar diversity of comments. However, they were significantly more engaged with the system, and they had significantly higher agreement with and respect for the comments they read.",
  "authors": [
    {
      "name": "Siamak Faridani",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460658047",
      "orcid": "missing"
    },
    {
      "name": "Ephrat Bitton",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487831",
      "orcid": "missing"
    },
    {
      "name": "Kimiko Ryokai",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100335135/rel-imgonly/kimiko_ryokai.jpg",
      "acmid": "81100335135",
      "orcid": "missing"
    },
    {
      "name": "Ken Goldberg",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100491693",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A.J. Berinsky. The two faces of public opinion. American Journal of Political Science, pp. 1209--1230, 1999.",
      "doi": ""
    },
    {
      "text": "J. Bishop. Increasing participation in online communities: A framework for human-computer interaction. Computers in Human Behavior, 23(4):1881--1893, 2007.  ",
      "doi": "10.1016/j.chb.2005.11.004"
    },
    {
      "text": "E. Bitton. A Spatial Model for Collaborative Filtering of Comments in an Online Discussion Forum. Proc. Of RecSys, ACM, 2009.  ",
      "doi": "10.1145/1639714.1639797"
    },
    {
      "text": "P.J. Carrington, J. Scott, and S. Wasserman. Models and Methods in Social Network Analysis. Cambridge University Press, 2005.",
      "doi": ""
    },
    {
      "text": "W.J. Conover, R.L. Iman. Rank transformations as a bridge between parametric and nonparametric statistics. American Statistician. American Statistician, 35, 124--129, 1981.",
      "doi": ""
    },
    {
      "text": "P.B. Brandtzaeg and J. Heim. Explaining Participation in Online Communities. Handbook of Research on Socio--Technical Design and Social Networking Systems, 2009.",
      "doi": ""
    },
    {
      "text": "P. Dahlgren. The Internet, public spheres, and political communication: Dispersion and deliberation. Political Communication, 22(2):147--162, 2005.",
      "doi": ""
    },
    {
      "text": "L. Freeman. Visualizing Social Networks. Journal of Social Structure, 1(1):4, 2000.",
      "doi": ""
    },
    {
      "text": "J.S. Fishkin and R.C. Luskin. Experimenting with a democratic ideal: Deliberative polling and public opinion. Acta Politica, 40(3):284--298, 2005.",
      "doi": ""
    },
    {
      "text": "I.K. Fodor. A survey of dimension reduction techniques. LLNL Technical Report, UCRL-ID-148494 (2002).",
      "doi": ""
    },
    {
      "text": "11.M. Girvan and MEJ Newman. Community structure in social and biological networks. Proc. of the National Academy of Sciences, 99(12), 2002.",
      "doi": ""
    },
    {
      "text": "K. Goldberg, T. Roeder, D. Gupta, and C. Perkins. Eigentaste: A Constant Time Collaborative Filtering Algorithm. Information Retrieval Journal, 4(2), pp. 133--151. July 2001.  ",
      "doi": "10.1023/A%3A1011419012209"
    },
    {
      "text": "J. Heer and D. Boyd. Vizster: Visualizing online social networks. In Proc. of the IEEE Symposium on Information Visualization, pp. 33--40, 2005.  ",
      "doi": "10.1109/INFOVIS.2005.39"
    },
    {
      "text": "I.T. Joliffe. Principal Component Analysis. 2nd ed. Springer-Verlag, 2002.",
      "doi": ""
    },
    {
      "text": "P.J. Ludford, D. Cosley, D. Frankowski, and L. Terveen. Think different: increasing online community participation using uniqueness and group dissimilarity. Proc. of ACM CHI, pp. 631--638, 2004.  ",
      "doi": "10.1145/985692.985772"
    },
    {
      "text": "S. McKillup. Statistics explained: an introductory guide for life scientists. Cambridge University Press, 2006.",
      "doi": ""
    },
    {
      "text": "B. Pang and L. Lee. Opinion Mining and Sentiment Analysis. Foundations and Trends in Information Retrieval, 2(1--2):1--135, 2008.  ",
      "doi": "10.1561/1500000011"
    },
    {
      "text": "A. Perer and B. Shneiderman. Balancing systematic and flexible exploration of social networks. IEEE Transactions on Visualization and Computer Graphics, 12(5):693--700, 2006.  ",
      "doi": "10.1109/TVCG.2006.122"
    },
    {
      "text": "L. Rourke and H. Kanuka. Barriers to online critical discourse. International Journal of Computer-Supported Collaborative Learning, 2(1):105--126, 2007.",
      "doi": ""
    },
    {
      "text": "W. Sack. Conversation Map: An Interface for Very Large-Scale Conversations. Journal of Management Information Systems, 17(3), 2001. ",
      "doi": "10.5555/1289640.1289645"
    },
    {
      "text": "W. Sack. Discourse architecture and very large-scale conversation. Digital Formations: IT and New Architectures in the Global Realm, pp. 242--282, 2005.",
      "doi": ""
    },
    {
      "text": "C. Sunstein. Republic.com 2.0. Princeton University Press, 2007. ",
      "doi": "10.5555/1536923"
    },
    {
      "text": "MJW Thomas. Learning within incoherent structures: the space of online discussion forums. Journal of Computer Assisted Learning, 18(3):351--366, 2002.",
      "doi": ""
    },
    {
      "text": "L.J.P. van der Maaten and G.E. Hinton. Visualizing High-Dimensional Data Using t-SNE. Journal of Machine Learning Research 9(Nov):2579--2605, 2008.",
      "doi": ""
    },
    {
      "text": "F. Viegas and J. Donath. Social network visualization: Can we go beyond the graph. In Workshop on Social Networks, CSCW, volume 4, pages 6--10, 2004.",
      "doi": ""
    },
    {
      "text": "B.L. Welch. The generalization of \"Student's\" problem when several different population variances are involved. Biometrika 34 (1--2): 28--35, 1947.",
      "doi": ""
    }
  ]
}