{
  "doi": "10.1145/1753326.1753346",
  "title": "A case study of micro-blogging in the enterprise: use, value, and related issues",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "123-132",
  "year": 2010,
  "badges": [],
  "abstract": "This is a case study about the early adoption and use of micro-blogging in a Fortune 500 company. The study used several independent data sources: five months of empirical micro-blogging data, user demographic information from corporate HR records, a web based survey, and targeted interviews. The results revealed that users vary in their posting activities, reading behaviors, and perceived benefits. The analysis also identified barriers to adoption, such as the noise-to-value ratio paradoxes. The findings can help both practitioners and scholars build an initial understanding of how knowledge workers are likely to use micro-blogging in the enterprise.",
  "authors": [
    {
      "name": "Jun Zhang",
      "institution": "Pitney Bowes Inc. , Shelton, CT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582266",
      "orcid": "missing"
    },
    {
      "name": "Yan Qu",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337837",
      "orcid": "missing"
    },
    {
      "name": "Jane Cody",
      "institution": "Pitney Bowes Inc., Shelton, CT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655487",
      "orcid": "missing"
    },
    {
      "name": "Yulingling Wu",
      "institution": "Pitney Bowes Inc., Shelton, CT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650711",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blumler J.G. & Katz, E. (1974). The uses of mass communications: Current perspectives on gratifications research. Beverly Hills, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Danis, C. and Singer, D. 2008. A wiki instance in the enterprise: opportunities, concerns and reality. In Proceedings of the ACM 2008 Conference on CSCW(San Diego, USA, November, 2008)., 495--504.  ",
      "doi": "10.1145/1460563.1460642"
    },
    {
      "text": "DiMicco, J., Millen, D.R., Geyer, W., Dugan, C., Brownholtz, B., & Muller, M. 2008. Motivations for social networking at work. In Proceedings of CSCW'08.  ",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "Efimova, L. and Grudin, J. 2007. Crossing boundaries: A case study of employee blogging. In Proc HICSS'07.  ",
      "doi": "10.1109/HICSS.2007.159"
    },
    {
      "text": "Erickson, T. and Kellogg, W. A. 2000. Social translucence: an approach to designing systems that support social processes. ACM Trans. Comput.-Hum. Interact. 7, 1 (Mar. 2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Günther, O.; Krasnova, H.; Riehle, D.; and Schoendienst, V., 2009, \"Modeling Microblogging Adoption in the Enterprise\", AMCIS 2009 Proceedings.",
      "doi": ""
    },
    {
      "text": "Honeycutt, C., and Herring, S.C. 2009. Beyond Microblogging: Conversation and Collaboration via Twitter. In Proceedings of the 42nd HICSS, p1--10.  ",
      "doi": "10.1109/HICSS.2009.89"
    },
    {
      "text": "Huberman, Bernardo A., Romero, Daniel M. and Wu, Fang. Social Networks that Matter: Twitter Under the Microscope (December 5, 2008). Available at SSRN: http://ssrn.com/abstract=1313405",
      "doi": ""
    },
    {
      "text": "Huh, J., Jones, L., Erickson, T., Kellogg, W.A., Bellamy, R., Thomas, J.C. 2007. BlogCentral: The Role of Internal Blogs at Work. CHI 2007 Work in Progress, April 2007, San Jose, CA.  ",
      "doi": "10.1145/1240866.1241022"
    },
    {
      "text": "Isaacs, E., Walendowski, A., Whittaker, S., Schiano, D. J., and Kamm, C. 2002. The character, functions, and styles of instant messaging in the workplace. In Proceedings of CSCW'02,11--20  ",
      "doi": "10.1145/587078.587081"
    },
    {
      "text": "Jackson, A., Yates, J. and Orlikowski, W. 2007. Corporate Blogging: Building community through persistent digital talk. In Proc HICSS'07, 80  ",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "Java, A., Song, X., Finin, T. & Tseng, B. 2007. Why we twitter: Understanding micro-blogging usage and communities. Proceedings of the 13th ACM SIGKDD  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Krishnamurthy, B., Gill, P., and Arlitt, M. 2008. A few chirps about twitter. In Proceedings of WOSP '08,19--24.  ",
      "doi": "10.1145/1397735.1397741"
    },
    {
      "text": "McFedries, P. 2007. Technically speaking: All a-twitter. IEEE Spectrum, 44(10), 84.  ",
      "doi": "10.1109/MSPEC.2007.4337670"
    },
    {
      "text": "Nardi, B. A., Whittaker, S., and Bradner, E. 2000. Interaction and outeraction: instant messaging in action. In Proceedings of CSCW'00, 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Preece, Jennifer and Shneiderman, Ben (2009) \"The Reader-to-Leader Framework: Motivating Technology-Mediated Social Participation,\" AIS Transactions on Human-Computer Interaction (1) 1, pp. 13--32",
      "doi": ""
    },
    {
      "text": "Stevens, V. 2008. Trial by Twitter: The Rise and Slide of the Year's Most Viral Microblogging platform, TESL-EJ, volume 12, Number 1",
      "doi": ""
    },
    {
      "text": "Thom-Santelli, J., Muller, M.J. and Millen, D.R. 2008. Social Tagging Roles: Publishers, Evangelists, Leaders. In Proc CHI '08, 1041--1044.  ",
      "doi": "10.1145/1357054.1357215"
    },
    {
      "text": "Twitter. http://www.twitter.com",
      "doi": ""
    },
    {
      "text": "Yammer. http://www.yammer.com",
      "doi": ""
    },
    {
      "text": "Yardi, S., Golder, S. A., and Brzozowski, M. J. 2009. Blogging at work and the corporate attention economy. In Proceedings of the 27th international Conference on Human Factors in Computing Systems, 2071--2080.  ",
      "doi": "10.1145/1518701.1519016"
    },
    {
      "text": "Zhao, D. and Rosson, M. 2009. How and why people Twitter: the role that micro-blogging plays in informal communication at work. In Proceedings of the ACM Group'09, Florida, USA, May 2009, 243--252.  ",
      "doi": "10.1145/1531674.1531710"
    },
    {
      "text": "Zhang, J. and Qu, Y. 2009, Shall We Yammer? A Case Study of Micro-blogging at Work, working paper.",
      "doi": ""
    }
  ]
}