{
  "doi": "10.1145/1753326.1753459",
  "title": "iCanDraw: using sketch recognition and corrective feedback to assist a user in drawing human faces",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "897-906",
  "year": 2010,
  "badges": [],
  "abstract": "When asked to draw, many people are hesitant because they consider themselves unable to draw well. This paper describes the first system for a computer to provide direction and feedback for assisting a user to draw a human face as accurately as possible from an image. Face recognition is first used to model the features of a human face in an image, which the user wishes to replicate. Novel sketch recognition algorithms were developed to use the information provided by the face recognition to evaluate the hand-drawn face. Two design iterations and user studies led to nine design principles for providing such instruction, presenting reference media, giving corrective feedback, and receiving actions from the user. The result is a proof-of-concept application that can guide a person through step-by-step instruction and generated feedback toward producing his/her own sketch of a human face in a reference image.",
  "tags": [
    "sketch recognition",
    "pen-input computing",
    "computer-aided instruction",
    "assistive and corrective feedback"
  ],
  "authors": [
    {
      "name": "Daniel Dixon",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81544526556",
      "orcid": "missing"
    },
    {
      "name": "Manoj Prasad",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460645225",
      "orcid": "missing"
    },
    {
      "name": "Tracy Hammond",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/do/10.1145/contrib-81309486982/rel-imgonly/81309486982.jpg",
      "acmid": "81309486982",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alvarado, C. \"Sketch recognition user interfaces: guidelines for design and development.\" In AAAI 2004 Symposium on Making Pen-Based Interaction Intelligent and Natural (Oct 2004), 8--14.",
      "doi": ""
    },
    {
      "text": "Bae, S.-H., Balakrishnan, R., and Singh, K. \"ILoveSketch: as-natural-as-possible sketching system for creating 3d curve models.\" In Proc. of 21st Annual ACM Symposium on User Interface Software and Technology, (Oct 2008), 151--160.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "Bartel, M. \"Teaching creativity (2008).\" http://www.goshen.edu/~marvinpb/arted/tc.html.{Accessed Jan 2009}.",
      "doi": ""
    },
    {
      "text": "Bartel, M. \"How to teach drawing to children.\" 2007. http://www.goshen.edu/art/ed/draw.html. {Accessed: Jan 2009}.",
      "doi": ""
    },
    {
      "text": "Bruer, J.T. \"In search of...brain-based education.\" 1999. http://www.pdkintl.org/kappan/kbru9905.htm.{Accessed 1/2009}.",
      "doi": ""
    },
    {
      "text": "Clark, G., and Zimmerman, E. Teaching Talented Art Students -- Principles and Practices. Teachers College Press, New York, NY, USA, 2004.",
      "doi": ""
    },
    {
      "text": "Corballis, M.C., and Beale, I.L. The Psychology of Left and Right. Erlbaum, Hillsdale, NJ, USA, 1967.",
      "doi": ""
    },
    {
      "text": "Edwards, B. The New Drawing on the Right Side of the Brain. Penguin Group, Inc., New York, NY, USA, 1999.",
      "doi": ""
    },
    {
      "text": "Hammond, T., and Davis, R. \"LADDER: a language to describe drawing, display, and editing in sketch recognition.\" In Proc. of 2003 International Joint Conference on Artificial Intelligence (IJCAI), (August 2003), 461--467. ",
      "doi": "10.5555/1630659.1630728"
    },
    {
      "text": "Hoddinott, B. \"DrawSpace.com.\" 2009. http://www.drawspace.com. {Accessed: Mar 2009}.",
      "doi": ""
    },
    {
      "text": "Luxand Inc., Luxand FaceSDK, version 1.81, 2009.",
      "doi": ""
    },
    {
      "text": "Oh, Y., Do, E.Y-L., and Gross, M.D. \"Critiquing freehand sketching -- a computational tool for design evaluation.\" In Visual and Spatial Reasoning in Design (VR), Cambridge, MA, USA, (2004), 105--120.",
      "doi": ""
    },
    {
      "text": "Orde, B.J. \"Drawing as visual-perceptual and spatial ability training.\" In Proc. of National Convention of the Association for Educational Communications and Technology, Albuquerque, New Mexico, USA, (1997), 271--278.",
      "doi": ""
    },
    {
      "text": "Pariser, D.A.. \"Two methods of teaching drawing skills.\" In Studies in Art Education, 20, 3 (1979), 30--42.",
      "doi": ""
    },
    {
      "text": "Paulson, B., and Hammond, T. \"PaleoSketch: accurate primitive sketch recognition and beautification.\" In Proc. of 13th International Conference on Intelligent User Interfaces (IUI) (Jan 2008), 1--10.  ",
      "doi": "10.1145/1378773.1378775"
    },
    {
      "text": "Roam, D. The Back of the Napkin --- Solving Problems and Selling Ideas with Pictures. Penguin Group, Inc., New York, NY, USA, 2008.",
      "doi": ""
    },
    {
      "text": "Sezgin, T.M., Stahovich, T., and Davis, R. \"Sketch based interfaces: early processing for sketch understanding.\" In ACM SIGGRAPH 2007 Courses, August 2007, No. 37.  ",
      "doi": "10.1145/1281500.1281548"
    },
    {
      "text": "Taele, P., and Hammond, T. \"Hashigo: a next-generation sketch interactive system for Japanese kanji.\" In Twenty-First Innovative Applications Artificial Intelligence Conference (IAAI), (Jul 2009).",
      "doi": ""
    },
    {
      "text": "Tsang, S., Balakrishnan, R., Singh, K., and Ranjan, A. \"A suggestive interface for image guided 3D sketching.\" In Proc. of SIGCHI Conference on Human Factors in Computing Systems, (Apr 2004), 591--598.  ",
      "doi": "10.1145/985692.985767"
    },
    {
      "text": "Watt, S.M., and Xie, X. \"Prototype pruning by feature extraction for handwritten mathematical symbol recognition.\" In Proc. of Maple Conference 2005, Maplesoft, (2005), 423--437.",
      "doi": ""
    },
    {
      "text": "Willats, J. \"How children learn to draw realistic pictures.\" In The Quarterly Journal of Experimental Psychology. 29, 3 (Aug 1977), 367--382.",
      "doi": ""
    },
    {
      "text": "Wolin, A., Eoff, B., and Hammond, T. \"ShortStraw: a simple and effective corner finder for polylines.\" In Eurographics 5th Annual Workshop on Sketch-Based Interfaces and Modeling, (2008), 33--40.  ",
      "doi": "10.5555/2386301.2386308"
    },
    {
      "text": "Xu, Z., and Luo, J. \"Face recognition by expression-driven sketch graph matching.\" In Proc. 18th International Conference on Pattern Recognition (ICPR), (2006), 1119--1122.  ",
      "doi": "10.1109/ICPR.2006.525"
    },
    {
      "text": "Yang, M.C., and Cham, J.G. \"An analysis of sketching skill and its role in early stage engineering design.\" In Journal of Mechanical Design 129, 5 (May 2007), 476--482.",
      "doi": ""
    }
  ]
}