{
  "doi": "10.1145/1753326.1753332",
  "title": "Reactive information foraging for evolving goals",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "25-34",
  "year": 2010,
  "badges": [],
  "abstract": "Information foraging models have predicted the navigation paths of people browsing the web and (more recently) of programmers while debugging, but these models do not explicitly model users' goals evolving over time. We present a new information foraging model called PFIS2 that does model information seeking with potentially evolving goals. We then evaluated variants of this model in a field study that analyzed programmers' daily navigations over a seven-month period. Our results were that PFIS2 predicted users' navigation remarkably well, even though the goals of navigation, and even the information landscape itself, were changing markedly during the pursuit of information.",
  "authors": [
    {
      "name": "Joseph Lawrance",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100235486/rel-imgonly/me.png",
      "acmid": "81100235486",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Rachel Bellamy",
      "institution": "IBM Research, Hawthorne, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100257325",
      "orcid": "missing"
    },
    {
      "name": "Christopher Bogart",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/do/10.1145/contrib-81435601576/rel-imgonly/bogart_proff_photo.jpg",
      "acmid": "81435601576",
      "orcid": "missing"
    },
    {
      "name": "Calvin Swart",
      "institution": "IBM Research, Hawthorne, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100027041",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. The Adaptive Character Of Thought. Erlbaum, Hillsdale, NJ, USA, 1990.",
      "doi": ""
    },
    {
      "text": "Anderson, J.R. Rules of the Mind. Erlbaum, Hillsdale, NJ, USA, 1993.",
      "doi": ""
    },
    {
      "text": "Baeza-Yates, R. and Ribeiro-Neto, B. Modern Information Retrieval. Addison Wesley Longman, Reading, MA, 1999. ",
      "doi": "10.5555/553876"
    },
    {
      "text": "Becchetti, L., Castillo, C., Donato, D., Baeza-Yates, R. and Leonardi, S. Link analysis for web spam detection. ACM Transactions on the Web 2, 1 (2008).  ",
      "doi": "10.1145/1326561.1326563"
    },
    {
      "text": "Bettenburg, N., Just, S., Schroeter, A., Weiss, C., Premraj, R., and Zimmermann, T., What makes a good bug report? In Proc. FSE 2008, ACM Press (2008), 308--318.  ",
      "doi": "10.1145/1453101.1453146"
    },
    {
      "text": "Brooks, R., Towards a theory of the comprehension of computer programs. Int. J. Man-Mach. Stud. 18, (1983), 543--554.",
      "doi": ""
    },
    {
      "text": "Card, S., Pirolli, P., Van Der Wege, M., Morrison, J., Reeder, R., Schraedley, P., & Boshart, J. Information scent as a driver of web behavior graphs: Results of a protocol analysis method for web usability, In Proc. CHI 2001, ACM Press (2001), 498--505.  ",
      "doi": "10.1145/365024.365331"
    },
    {
      "text": "Chi, E., Hong, L., Heiser, J., Card, S. ScentIndex: Conceptually reorganizing subject indexes for reading. In Proc. IEEE VAST, IEEE (2006), 159--166.",
      "doi": ""
    },
    {
      "text": "Chi, E., Pirolli, P, Chen, K. and Pitkow, J, Using information scent to model user information needs and actions on the web. In Proc. CHI 2001, ACM Press (2001), 490--497.  ",
      "doi": "10.1145/365024.365325"
    },
    {
      "text": "Chi, E., Rosien, A., Supattanasiri, G., Williams, A., Royer, C., Chow, C., Robles, E., Dalal, B., Chen, J., Cousins, S. The Bloodhound project: Automating discovery of web usability issues using the InfoScent simulator, In Proc. CHI 2003, ACM Press (2003), 505--512.  ",
      "doi": "10.1145/642611.642699"
    },
    {
      "text": "Cubranic, D., Murphy, G., Singer, J. and Booth, K. Hipikat: A project memory for software development, IEEE Trans. Soft. Engr. 31, 6 (June 2005), 446--465.  ",
      "doi": "10.1109/TSE.2005.71"
    },
    {
      "text": "Fetterly, D., Manasse, M., Najork, M. and Wiener, J. A large-scale study of the evolution of web pages. In Proc. 12th International World Wide Web Conf., ACM Press (May 2003), 669--678.  ",
      "doi": "10.1145/775152.775246"
    },
    {
      "text": "Fu, W. and Pirolli, P. SNIF-ACT: A cognitive model of user navigation on the world wide web, Human-Computer Interaction 22, 4 (Nov. 2007), 355--412. ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Hill, E., Pollock, L., and Vijay-Shanker, K. Automatically capturing source code context of NL-queries for software maintenance and reuse, In Proc. ICSE 2009, IEEE Computer Society (2009), 232--242.  ",
      "doi": "10.1109/ICSE.2009.5070524"
    },
    {
      "text": "Ko, A., Myers, B., and Chau, D. A linguistic analysis of how people describe software problems, In Proc. VLHCC, IEEE (2006), 127--136.  ",
      "doi": "10.1109/VLHCC.2006.3"
    },
    {
      "text": "Ko, A., Myers, B., Coblenz, M., and Aung, H., An exploratory study of how developers seek, relate, and collect relevant information during software maintenance tasks, IEEE Trans. Software Engineering 32, 12 (Dec. 2006), 971--987.  ",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Landauer, T.K. and Dumais, S.T.A solution to Plato's problem: the Latent Semantic Analysis theory of acquisition, induction and representation of knowledge. Psychological Review, 104, 2 (1997), 211--240.",
      "doi": ""
    },
    {
      "text": "Lawrance, J., Bellamy, R., Burnett, M., and Rector, K. Using information scent to model the dynamic foraging behavior of programmers in maintenance tasks, In Proc. CHI 2008, ACM Press (2008), 1323--1332.  ",
      "doi": "10.1145/1357054.1357261"
    },
    {
      "text": "Lawrance, J., Bellamy, R., Burnett, M. and Rector, K. Can information foraging pick the fix? A field study, In Proc. IEEE VLHCC, IEEE (2008), 57--64.  ",
      "doi": "10.1109/VLHCC.2008.4639059"
    },
    {
      "text": "Lawrance, J., Bogart, C., Burnett, M., Bellamy, R., and Rector, K. How people debug, revisited: An information foraging theory perspective. IBM Technical Report RC24783 (2009). (Under review.)",
      "doi": ""
    },
    {
      "text": "Manning, C. and Schutze, Foundations of Statistical Natural Language Processing. MIT Press, Cambridge, MA, USA, May 1999. ",
      "doi": "10.5555/311445"
    },
    {
      "text": "Nielsen, J. Information foraging: Why Google makes people leave your site faster http://www.useit.com/alertbox/20030630.html. June 30, 2003.",
      "doi": ""
    },
    {
      "text": "Olston, C., Chi, E. ScentTrails: Integrating browsing and searching on the web. ACM Trans. Computer-Human Interaction, 10, 3 (2003), 177--197.  ",
      "doi": "10.1145/937549.937550"
    },
    {
      "text": "Pirolli, P. and Card, S., Information foraging in information access environments. In Proc. CHI 1995, ACM Press (1995), 51--58.  ",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Pirolli, P. Computational models of information scent-following in a very large browsable text collection. In Proc. CHI 1997, ACM Press (1997), 3--10.  ",
      "doi": "10.1145/258549.258558"
    },
    {
      "text": "Pirolli, P. and Card, S. Information foraging, Psychology Review 106, 4 (1999), 643--675.",
      "doi": ""
    },
    {
      "text": "Pirolli, P. Information Foraging Theory: Adaptive Interaction with Information. Oxford University Press, New York, NY, USA, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Robillard, M.P. and Murphy, G.C. Concern Graphs: Finding and describing concerns using structural program dependencies, In Proc. ICSE 2002, ACM Press (2002), 406--416.  ",
      "doi": "10.1145/581339.581390"
    },
    {
      "text": "Spool, J., Profetti, C., and Britain, D., Designing for the scent of information, User Interface Engineering, (2004).",
      "doi": ""
    }
  ]
}