{
  "doi": "10.1145/1753326.1753495",
  "title": "Steadied-bubbles: combining techniques to address pen-based pointing errors for younger and older adults",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1125-1134",
  "year": 2010,
  "badges": [],
  "abstract": "Tablet PCs are gaining popularity but many older adults still struggle with pointing, particularly with two error types: missing, landing and lifting outside the target bounds; and slipping, landing on the target, but slipping off before lifting. To solve these problems, we examined the feasibility of extending and combining existing techniques designed for younger users and the mouse, focusing our investigation on the Bubble cursor and Steady Clicks techniques. Through a laboratory experiment with younger and older adults, we showed that both techniques can be adapted for use in a pen interface, and that combining the two techniques provides greater support than either technique on its own. Though our results were especially pertinent to the older group, both ages benefited from the designs. We also found that technique performance depended on task context. From these findings we established guidelines for technique selection.",
  "authors": [
    {
      "name": "Karyn Moffatt",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81100235288/rel-imgonly/karyn.jpg",
      "acmid": "81100235288",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J. & Zhai, S. 2002. More than dotting the i's---Foundations for crossing-based interfaces. Proc. CHI'02, 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Apitz, G. & Guimbretière, F. 2004. CrossY: A crossing-based drawing application. Proc. UIST'04, 312--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Balakrishnan, R. 2004. \"Beating\" Fitts' law: Virtual enhancements for pointing facilitation. Int'l J. Human Computer Studies, 61(6): 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Birdi, K.S. & Zapf, D. 1997. Age differences in reactions to errors in computer-based work. Behav. Inf. Technol. 16(6): 309--319.",
      "doi": ""
    },
    {
      "text": "Charness, N., Holley, P., Feddon, J. & Jastrzembski, T. 2004. Light pen use and practice minimize age and hand performance differences in pointing tasks. Hum. Factors, 46(3): 373--384.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. & Firth, A. 2003. Improving the acquisition of small targets. In Proc. HCI'03, 181--196.",
      "doi": ""
    },
    {
      "text": "Cohen, J. 1988. Statistical Power Analysis for the Behavioral Sciences. 2nd edition, Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Greenstein, J.L. 1997. Pointing devices. In Handbook of human-computer interaction (1317--1348). Elsevier, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Guiard, Y., Blanch, R., & Beaudouin-Lafon, M. 2004. Object pointing: a complement to bitmap pointing in GUIs. Proc. GI'04, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Grossman, T. & Balakrishnan, R. 2005. The bubble cursor: Enhancing target acquisition by dynamic resizing of the cursor's activation area. Proc. CHI'05, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Hourcade, J.P. & Berkel, T. 2008. Simple pen interaction performance of young and older adults using handheld computers. Interact. Comput., 20(1):166--183.  ",
      "doi": "10.5555/1327552.1327929"
    },
    {
      "text": "Keates, S. & Trewin, S. 2005. Effect of age and Parkinson's disease on cursor positioning using a mouse. Proc. ASSETS'05, 68--75.  ",
      "doi": "10.1145/1090785.1090800"
    },
    {
      "text": "Ketcham, C. & Stelmach, G. 2004. Movement control in the older adult. In Technology for Adaptive Aging (64--92), National Academies Press, Washington DC.",
      "doi": ""
    },
    {
      "text": "Lee, M. & Dey, A. 2007. Providing good memory cues for people with episodic memory impairment. Proc. ASSETS'07, 131--138.  ",
      "doi": "10.1145/1296843.1296867"
    },
    {
      "text": "Massimi, M., Baecker, R. & Wu, M. 2007. Using participatory activities with seniors to critique, build, and evaluate mobile phones. Proc. ASSETS'07, 155--162.  ",
      "doi": "10.1145/1296843.1296871"
    },
    {
      "text": "McGuffin, M. J. & Balakrishnan, R. 2005. Fitts' law and expanding targets: Experimental studies and designs for user interfaces. TOCHI, 12(4):388--422.  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "Mizobuchi, S. & Yasumura, M. 2004. Tapping vs circling selections on pen-based devices: Evidence for different performance-shaping factors. Proc. CHI'04, 607--614.  ",
      "doi": "10.1145/985692.985769"
    },
    {
      "text": "Moffatt, K. & McGrenere, J. 2007. Slipping and drifting: Using older users to uncover pen-based target acquisition difficulties. Proc. ASSETS'07, 11--18.  ",
      "doi": "10.1145/1296843.1296848"
    },
    {
      "text": "Mynatt, E.D., Essa, I. & Rogers, W. 2000. Increasing the opportunities for aging in place. Proc. CUU'00, 65--71.  ",
      "doi": "10.1145/355460.355475"
    },
    {
      "text": "Ren, X. & Moriya, S. 2000. Improving selection performance on pen-based systems: A study of pen-based interaction for selection tasks. TOCHI, 7(3):384--416.  ",
      "doi": "10.1145/355324.355328"
    },
    {
      "text": "Rowe, M., Lane, S. & Phipps, C. 2007. CareWatch: A home monitoring system for use in homes of persons with cognitive impairment. Topics Geriatric Rehabil. Smart Technol., 23(1): 3--8.",
      "doi": ""
    },
    {
      "text": "Smith, M.W., Sharit, J. & Czaja, S.J. 1999. Aging, motor control and the performance of computer mouse tasks. Hum. Factors, 41(3): 589--596.",
      "doi": ""
    },
    {
      "text": "Trewin, S., Keates, S. & Moffatt, K. 2006. Developing Steady Clicks: A method of cursor assistance for people with motor impairments. Proc. ASSETS'06, 26--33.  ",
      "doi": "10.1145/1168987.1168993"
    },
    {
      "text": "Walker, N., Philbin, D.A. & Fisk, A.D. 1997. Age-related differences in movement control: Adjusting submovement structure to optimize performance. J. Gerontol. Psychol. Sci. 52(1): 40--52.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O. & Gajos, K.Z. 2008. Goal crossing with mice and trackballs for people with motor impairments: performance, submovements, and design directions. ACM TACCESS, 1(4): 4:1--4:37.  ",
      "doi": "10.1145/1361203.1361207"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K. & Hudson, S. 1997. Making computers easier for older adults to use: area cursors and sticky icons. Proc. CHI'97, 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Yan, J.H. (2000). Effects of aging on linear and curvilinear aiming arm movements. J. of Experimental Aging Research, 26(4):393--408.",
      "doi": ""
    }
  ]
}