{
  "doi": "10.1145/1753326.1753397",
  "title": "The Case of the Disappearing Ox: Seeing Through Digital Images to an Analysis of Ancient Texts",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "473-482",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "There are numerous settings where people examine, scrutinize and discuss the details of images in the course of their work. In most medical domains, scans and x-rays are used in the diagnosis of cases; in most areas of science, methods of visualization have been adopted to assist in the analysis of data; and images of different kinds are critical for many research fields in the social sciences and humanities. It is not surprising that recently technologies have been proposed to assist with the analysis and examination of images. In this paper, we consider requirements for technologies in a rather distinctive domain of research, the classics. Drawing upon an analysis of the detailed ways in which classicists work with digital images, we discuss the requirements for systems to support researchers in this domain, and also provide further considerations on the general development of image processing technologies and visualization techniques.",
  "tags": [
    "interaction analysis",
    "workplace studies",
    "cscw",
    "requirements engineering",
    "usability.",
    "ethnomethodology"
  ],
  "authors": [
    {
      "name": "Grace de la Flor",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496686474",
      "orcid": "missing"
    },
    {
      "name": "Paul Luff",
      "institution": "King's College, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100229533",
      "orcid": "missing"
    },
    {
      "name": "Marina Jirotka",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398221",
      "orcid": "missing"
    },
    {
      "name": "John Pybus",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655594",
      "orcid": "missing"
    },
    {
      "name": "Ruth Kirkham",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657714",
      "orcid": "missing"
    },
    {
      "name": "Annamaria Carusi",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414613623",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anoto Group AB, http://www.anoto.com",
      "doi": ""
    },
    {
      "text": "Bernardini, F., Rushmeier, H., Martin, I., Mittleman, J. & Taubin, G. Building a digital model of Michelangelo's Forentine pieta. IEEE Computer Graphics and Applications, 22,1 (2002), 59--67.  ",
      "doi": "10.1109/38.974519"
    },
    {
      "text": "Bowman, A, Tomlin, R. & Worp, K. Emptio Bovis Frisica: The 'Frisian ox sale' reconsidered. Journal of Roman Studies, 99, (2009), 156--70,",
      "doi": ""
    },
    {
      "text": "Bowman, A, Crowther C, Kirkham, R, & Pybus J. Virtual Research Environment for the Study of Documents and Manuscripts. The Oxford e-Research Conference, Oxford, UK, 11--13 Sept. 2008.",
      "doi": ""
    },
    {
      "text": "Bowman, A. & Tomlin, R. Wooden stilus tablets from Roman Britain. In Bowman, A. & Brady, M. (eds.), Images and artefacts of the ancient world. Oxford University Press, Oxford, (2005), 7--14.",
      "doi": ""
    },
    {
      "text": "Bowman, A., Brady, M. & Tomlin, R. Imaging incised documents. Literary and linguistic computing, 12, 3 (1997), 169--176.",
      "doi": ""
    },
    {
      "text": "Bowman, A, Crowther, C., Kirkham, R., & Pybus, J. 'A Virtual Research Environment for the Study of Documents and Manuscripts' in Bodard, & Mahony, (eds.), Digital Research and the Study of Classical Antiquity, Ashgate Press (Forthcoming).",
      "doi": ""
    },
    {
      "text": "Fraser, M., Hindmarsh, J., Best, K., Heath, C., Biegel, G., Greenhalgh, C. & Reeves, S. Remote Collaboration over Video Data: Towards Real-Time e-Social Science. JCSCW, Special Issue on Collaboration in e-Research, 15, 4 (2006), 257--279.  ",
      "doi": "10.1007/s10606-006-9027-y"
    },
    {
      "text": "Frost, C.O., Taylor, B., Noakes, A., Markel, S., Torres, D. & Drabenstott, K.M. Browse and search patterns in a digital image database. Information retrieval, 1 (2000), 287--313.  ",
      "doi": "10.1023/A%3A1009979200555"
    },
    {
      "text": "Garfinkel, H. Studies in ethnomethodology. Prentice-Hall, Englewood Cliffs, NJ, USA, 1967.",
      "doi": ""
    },
    {
      "text": "Goodrum, A. Image information retrieval: An overview of current research. Informing. Science 3, 2, (2000) 63--67.",
      "doi": ""
    },
    {
      "text": "Goodwin, C. Professional Vision. American Anthropologist, 96, 3 (1994), 606--633.",
      "doi": ""
    },
    {
      "text": "Hartswood, M., Jirotka, M, Procter, R., Slack, R., Voss, A. & S. Lloyd, Working IT Out in eScience: Experiences of Requirements Capture. In HealthGrid Projects, Proc of HealthGrid (2005), IOS Press.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K., Bederson, B.B., & Plaisant, C. Navigation Patterns and Usability of Zoomable User Interfaces With and Without an Overview. ACM Transactions on Computer-Human Interaction 9, 4 (2002), 362--389.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "Jirotka, M., Procter, M., Hartswood, M., Slack, R, Simpson, A, Coopmans, C., Hinds, C. & Voss A. Collaboration and Trust in Healthcare Innovation: the eDiamond Case Study, JCSCW 14 (2005), 369--398.  ",
      "doi": "10.1007/s10606-005-9001-0"
    },
    {
      "text": "Kirk, D.S., Rodden, T. & Stanton Fraser, D. Turn It This Way: Grounding Collaborative Action with Remote Gestures. CHI 2007, (2007), 1039--1048.  ",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "Kuzuoka, H., Yamashita, J., Yamazaki, K., & Yamazaki, A. Agora: A Remote Collaboration System that Enables Mutual Monitoring. CHI'99 Ext. Abstr, Philadelphia PA. (1999), 190--191.  ",
      "doi": "10.1145/632716.632836"
    },
    {
      "text": "Luff, P., Heath, C., & Sanchez Svensson, M. Discriminating Conduct: Deploying systems to support awareness in organisations. International Journal of Human Computer Interaction, 24, (2008), 410--436.",
      "doi": ""
    },
    {
      "text": "Molton, N., Pan, X., Brady, M., Bowman, A, Crowther, C., & Tomlin, R. Visual enhancement of incised text. Pattern Recognition, 36, (2003), 1031--1043.",
      "doi": ""
    },
    {
      "text": "Olson, G. Zimmerman, A. & Bos, N. (eds) Scientific Collaboration on the Internet. MIT Press, Cambridge, MA., 2008. ",
      "doi": "10.5555/1522423"
    },
    {
      "text": "Procter, R., Borgman, C., Bowker, G., Jirotka, M., Olsen, G., Pancake, C., Rodden, T., Schraefel, M.C. Usability research challenges for cyberinfrastructure and tools. In Proc. of ACM CHI 2006, Workshop on Human Factors in Computing Systems, (2006), 1675--1678.  ",
      "doi": "10.1145/1125451.1125760"
    },
    {
      "text": "Roued Olsen, H., Tarte, S, Terras, M., Brady, M. & Bowman, A. Towards an interpretation support system for reading ancient documents. Digital Humanites'09 (2009), 237--39.",
      "doi": ""
    },
    {
      "text": "Sacks, H. Lectures in Conversation: Volumes I and II. Blackwell, Oxford UK, 1992.",
      "doi": ""
    },
    {
      "text": "SensAble Technologies. http://www.sensable.com",
      "doi": ""
    },
    {
      "text": "Sharrock, W. and Coulter, J. On What We Can See. Theory and Psychology, 8,2 (1998), 147--164.",
      "doi": ""
    },
    {
      "text": "Tang, A., McLachlan, P., Lowe, K., Chalapati, R.S. & MacLean, K.E. Perceiving ordinal data haptically under workload. In Seventh International Conference on Multimodal Interfaces, Trento, Italy (2005), 244--251.  ",
      "doi": "10.1145/1088463.1088517"
    },
    {
      "text": "Tarte, S. Papyroligical Investigations: Transferring Perception and Interpretation into the Digital World. Literary and Linguistics Computing, (Forthcoming).",
      "doi": ""
    },
    {
      "text": "Terras, M.M. Image to interpretation: towards an intelligent system to aid historians in the reading of the Vindolanda texts. Oxford University Press UK, 2006. ",
      "doi": "10.5555/1205759"
    },
    {
      "text": "Tutt, D., Hindmarsh, J., Shaukat, M., & Fraser, M. The Distributed Work of Local Action: Interaction amongst virtually collocated research teams. ECSCW 2007 (2007), 199--218.",
      "doi": ""
    },
    {
      "text": "Ware, C. and Lewis, M. The DragMag image magnifier, CHI 1995, Denver, (1995), 407--408  ",
      "doi": "10.1145/223355.223749"
    },
    {
      "text": "Warr A., de la Flor, G. Jirotka, M. and S. Lloyd. Usability in e-science: The eDiaMoND case study. In CHI workshop on Increasing the Impact of Usability Work in Software Development, San Jose, USA, 2008.",
      "doi": ""
    },
    {
      "text": "Zheng, J., Zhang, Z. & Abe, N. Virtual recovery of excavated relics. IEEE Computer Graphics & Applications 19, 3 (1999), 6--11.  ",
      "doi": "10.1109/38.761541"
    }
  ]
}