{
  "doi": "10.1145/1753326.1753600",
  "title": "A death in the family: opportunities for designing technologies for the bereaved",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1821-1830",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Following the death of a loved one, bereaved family members use technology in several ways to respond to their loss. However, very little is known about how technology intersects with the lives of the bereaved. We present a survey and interview study which examines how the bereaved inherit personal digital devices, use technology to remember the deceased, and reflect on their own digital estates. The study provides one of the first characterizations of technology use by the bereaved, and presents a set of empirically-grounded design opportunities and challenges.",
  "tags": [
    "bereaved",
    "memory",
    "inheritance",
    "thanatosensitive design",
    "death"
  ],
  "authors": [
    {
      "name": "Michael Massimi",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100219924/rel-imgonly/mikemassimi_headshot_round.jpeg",
      "acmid": "81100219924",
      "orcid": "missing"
    },
    {
      "name": "Ronald M. Baecker",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100448368",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Carr, D. Factors that influence late-life bereavement: Considering data from the changing lives of older couples study. In Handbook of Bereavement Research and Practice (eds. Stroebe et al.), APA (2008), Washington, DC, 417--440.",
      "doi": ""
    },
    {
      "text": "Damianakis, T., Crete-Nishihata, M., Smith, K., Baecker, R., and Marziali, E. The psychosocial impacts of multimedia biographies on persons with cognitive impairments. The Gerontologist, (2009).",
      "doi": ""
    },
    {
      "text": "Egelman, S., Brush, A.J.B., Inkpen, K.M. Family accounts: A new paradigm for user accounts within the home environment. In Proc. CSCW 2008, ACM Press (2008), 669--678.  ",
      "doi": "10.1145/1460563.1460666"
    },
    {
      "text": "Facebook. http://www.facebook.com/help/search.php?h q=memorial&ref=hq.",
      "doi": ""
    },
    {
      "text": "Foong, P.S. and Kera, D. Applying reflective design to digital memorials. In SIMTech '08, (2008).",
      "doi": ""
    },
    {
      "text": "Foucault, M. What is an author? The Foucault Reader. Pantheon, New York, NY, USA, 1984.",
      "doi": ""
    },
    {
      "text": "Gemmell, J., Williams, L., Wood, K., Lueder, R., and Bell, G. Passive capture and ensuing issues for a personal lifetime store. In Proc 1st ACM Workshop on Continuous Archival and Retrieval of Personal Experiences, ACM Press (2004) 48--55.  ",
      "doi": "10.1145/1026653.1026660"
    },
    {
      "text": "Hallam, E. and Hockey, J. Death, Memory, and Material Culture. Berg, New York, NY, USA, 2001.",
      "doi": ""
    },
    {
      "text": "Kirk, D. and Banks, R. On the design of technology heirlooms. In SIMTech '08, (2008).",
      "doi": ""
    },
    {
      "text": "Massimi, M. and Charise, A. Dying, death, and mortality: Towards thanatosensitivity in HCI. In Proc. CHI 2009 Extended Abstracts, ACM Press (2009), 2459--2468.  ",
      "doi": "10.1145/1520340.1520349"
    },
    {
      "text": "Odom, W., Pierce, J. Stolterman, E., Blevis, B. (2009). Understanding why we preserve some things and discard others in the context of interaction design. In Proc. CHI 2009, ACM Press (2009), 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Olson, G. and Olson, J. Distance matters. Human-Computer Interaction 15, 2/3 (2000), 139--178.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Rockwell, L. Companies are being born out of death. Austin American-Stateman, (March 23, 2009).",
      "doi": ""
    },
    {
      "text": "Sofka, K. Social support \"internetworks,\" caskets for sale, and more: Thanatology and the information superhighway. Death Studies 21, 6 (1997), 553--574.",
      "doi": ""
    },
    {
      "text": "van den Hoven, E., Smeenk, W., Bilsen, H., et al. Communicating commemoration. In SIMTech '08, (2008).",
      "doi": ""
    },
    {
      "text": "Walter, T. The Revival of Death. Routledge, New York, NY, USA, 1994.",
      "doi": ""
    },
    {
      "text": "Worden, J. Grief Counseling and Grief Therapy (4th ed.). Springer, New York, NY, USA, 2008.",
      "doi": ""
    }
  ]
}