{
  "doi": "10.1145/1753326.1753396",
  "title": "Hand in hand with the material: designing for suppleness",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "463-472",
  "year": 2010,
  "badges": [],
  "abstract": "Designing for a supple interaction, involving users bodily and emotionally into a 'dance' with a system is a challenging task. Any break-ups in interaction become fatal to the sensual, fluent, bodily and social experience sought. A user-centered, iterative design cycle is therefore required. But getting to know the affordances of the digital material used to build the application plays an equally important role in the design process. The 'feel' of the digital material properties sometimes even determines what the design should be. We describe three situations in which the properties and affordances of sensor network technologies guided our design process of FriendSense -- a system for expressing friendship and emotional closeness through movement. We show how the sensor node look and feel, choice of sensors, limitations of the radio signal strength and coverage, as well as iterative prototyping to properly exploit the software/algorithmic possibilities guided our design process.",
  "authors": [
    {
      "name": "Petra Sundström",
      "institution": "Mobile Life @ Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597574",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "Mobile Life @ Stockholm University, Kista, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    }
  ],
  "references": [
    {
      "text": "Davies, E. (2001) Beyond Dance, Laban's Legacy of Movements Analysis, Brechin Books ltd., London, UK.",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Buxton, B. (2008). Usability evaluation considered harmful (some of the time). CHI'08. Florence, Italy.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Heidegger, M. (1996) Being and time. State University of New York Press, Albany.",
      "doi": ""
    },
    {
      "text": "Hutchinson, H., et al. (2003). Technology probes: in-spiring design for and with families, CHI'03. Ft. Lauderdale, Florida, USA.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Isbister, K. and Höök, K. (2009). On being supple: in search of rigor without rigidity in meeting new design and evaluation challenges for HCI practitioners. CHI'09. Boston, MA, USA.  ",
      "doi": "10.1145/1518701.1519042"
    },
    {
      "text": "Isbister, K. and Höök, K. (2007). Supple interfaces: designing and evaluating for richer human connections and experiences. Extended abstract CHI'07. San Jose, CA, USA.  ",
      "doi": "10.1145/1240866.1241094"
    },
    {
      "text": "Laban, R., and Lawrence F.C. (1974) Effort, Economy of Human Effort, Second Edition, Macdonald & Evans Ltd., London, UK.",
      "doi": ""
    },
    {
      "text": "Larssen, A.T., Robertson, T., et al. (2007). The Feel Dimension of Technology Interaction: Exploring Tangibles through Movement and Touch. TEI'07. Baton Rouge, LA, USA.  ",
      "doi": "10.1145/1226969.1227024"
    },
    {
      "text": "Löwgren, J. (2007). Inspirational patterns for embodied interaction. Journal of Knowledge, Technology & Policy 20(3).",
      "doi": ""
    },
    {
      "text": "Löwgren, J. and Stolterman, E. (2004). Thoughtful interaction design. Cambridge, MA: The MIT Press. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Löwgren, J and Stolterman, E. (1998) Design av informations-teknologi: Materialet utan egenskaper. Studentlitteratur, Lund, Sweden.",
      "doi": ""
    },
    {
      "text": "Moen, J. (2007). From Hand-Held to Body-Worn: Embodied Experiences of the Design and Use of a Wearable Movement-Based Interaction Concept. Tangible and Embedded Interaction. Baton Rouge, Louisiana, USA.  ",
      "doi": "10.1145/1226969.1227021"
    },
    {
      "text": "Paiva, A., Costa, M., et al. (2003). SenToy: an Affective Sympathetic Interface, International J. of Human Computer Studies, Vol. 59, Issues 1-2 , July 2003,  ",
      "doi": "10.1016/S1071-5819%2803%2900048-X"
    },
    {
      "text": "Schiphorst, T. (2009). soft(n): Toward a Somaesthetics of Touch. CHI'09. Boston, MA, USA.  ",
      "doi": "10.1145/1520340.1520345"
    },
    {
      "text": "Ståhl, A. Höök, K., et al. (2009) Experiencing the Affective Diary. In Personal and Ubiquitous Computing, Volume 13 Issue 5, pp. 365--378, Springer.  ",
      "doi": "10.1007/s00779-008-0202-7"
    },
    {
      "text": "Ståhl A (2006) Designing for emotional expressivity. Unpublished Licenciate Thesis, Institute of Design, Umeå University, Umeå, Sweden.",
      "doi": ""
    },
    {
      "text": "Sundström, P., Jaensson, T., et al. (2009). Probing the potential of non-verbal group communication. Supporting group work. Group'09. Sanibel Island, Florida, USA.  ",
      "doi": "10.1145/1531674.1531726"
    },
    {
      "text": "Sundström, P., Ståhl, A., and Höök, K. (2007) In Situ Informants Exploring an Emotional Mobile Messaging System in Their Everyday Practice, In a special issue of IJHCS on Evaluating Affective Interfaces, vol. 65, issue 4, pp. 388--403, April 2007.  ",
      "doi": "10.1016/j.ijhcs.2006.11.013"
    },
    {
      "text": "Taylor, A., Harper, R., et al. (2007) Homes that make us smart. In Personal and Ubiquitous Computing, Volume 11, Issue 5, Pages: 383--393, Springer.  ",
      "doi": "10.1007/s00779-006-0076-5"
    },
    {
      "text": "Vallgårda, A. and Redström, J. (2007). Computational composites. CHI '07. San Jose, California, USA.",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Wilde, D. (2009) Using technology to poetically extend the dynamic moving body. SEAM'09 Spatial Phrases symposium. Sydney, Australia.",
      "doi": ""
    },
    {
      "text": "Wright, P., McCarthy, J. 2008. Empathy and experience in HCI, CHI '08. Florence, Italy.  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "Zhao, L. (2001) Synthesis and Acquisition of Laban Movement Analysis Qualitative Parameters for Communicative Gestures, PhD thesis, CIS, University of Pennsylvania. ",
      "doi": "10.5555/934147"
    }
  ]
}