{
  "doi": "10.1145/1753326.1753601",
  "title": "Passing on & putting to rest: understanding bereavement in the context of interactive technologies",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1831-1840",
  "year": 2010,
  "badges": [],
  "abstract": "While it can be a delicate and emotionally-laden topic, new technological trends compel us to confront a range of problems and issues about death and bereavement. This area presents complex challenges and the associated literature is extensive. In this paper we offer a way of slicing through several perspectives in the social sciences to see clearly a set of salient issues related to bereavement. Following this, we present a theoretical lens to provide a way of conceptualizing how the HCI community could begin to approach such issues. We then report field evidence from 11 in-depth interviews conducted with bereaved participants and apply the proposed lens to unpack key emergent problems and tensions. We conclude with a discussion on how the HCI design space might be sensitized to better support the social processes that unfold when bereavement occurs.",
  "authors": [
    {
      "name": "William Odom",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    },
    {
      "name": "Richard Harper",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452613064",
      "orcid": "missing"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "David Kirk",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Richard Banks",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100462110",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell G. 2006. No More SMS For Jesus: Ubicomp, Religion, and Techno-spiritual Practices. In Proc. Of Ubicomp 2006. 141--158. Springer-Verlag.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Csikszentmihalyi, M., Rochberg-Halton, E. 1981. The meaning of things: Domestic symbols and the self. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Danforth, L. 1982. The Death Rituals of Rural Greece. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Dow, S. et al. 2005. Exploring spatial narratives and mixed reality experiences in Oakland Cemetery. ACE '05, 51--60.  ",
      "doi": "10.1145/1178477.1178484"
    },
    {
      "text": "Durkheim, E. 2001. The Elementary Forms of Religious Life. Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Finch, J., Mason, J. 2000. Passing On: Kinship & Inheritance in England. Routledge.",
      "doi": ""
    },
    {
      "text": "Foong, P. S. 2008. Designing technology for sensitive contexts: supporting end-of-life decision making. In Proc. of OZCHI '08, 172--179.  ",
      "doi": "10.1145/1517744.1517801"
    },
    {
      "text": "Foong P.S. & Kera D. 2008. Applying reflective design to digital memorials. SIMTech '08. Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Frohlich, D., Murphy, R. 2000. The Memory Box. Personal Ubiquitous Comput. 4, 4, 238--240.  ",
      "doi": "10.1007/PL00000011"
    },
    {
      "text": "Geertz, Clifford. 1973. The Interpretation of Cultures: Selected Essays. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Golden, A., Dalgleish, T., Mackintosh, B. 2007. Levels of Specificity of Autobiographical Memories and of Biographical Memories of the Deceased in Bereaved Individuals With and Without Complicated Grief. Journal of Abnormal Psychology, Vol. 116, 4, 786--795.",
      "doi": ""
    },
    {
      "text": "Green, J. 2008. Beyond the Good Death, Philadelphia, University Of Pennsylvania Press.",
      "doi": ""
    },
    {
      "text": "Hallam, E., Hockey, J. 2001. Death, Memory and Material Culture, Oxford, Berg.",
      "doi": ""
    },
    {
      "text": "Hertz, R., 1960. A Contribution to the Study of the Collective Representation of Death, in Death and the Right Hand, Glencoe, IL: The Free Press, pp. 27--86",
      "doi": ""
    },
    {
      "text": "Hurst, A. Mankoff, J., Dey, A., Hudson, S. 2007. Dirty Desktops: using a patina of magnetic mouse dust to make common interactor targets easier to select. In Proc. of UIST '07, 183--186.  ",
      "doi": "10.1145/1294211.1294242"
    },
    {
      "text": "Kaye, J. 'J'. et al. 2006. To have and to hold: exploring the personal archive. In Proc. of CHI '06, 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "Kirk, D., Banks, R. 2008. On the Design of Technology Heirlooms. SIMTech '08, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Kirk, D., Sellen, A. 2010, in press. On Human Remains: Values and Practice in the Home Archiving of Cherished Objects. To Appear in ACM TOCHI.  ",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Kubler-Ross. 1969. On Death & Dying. Routledge.",
      "doi": ""
    },
    {
      "text": "Kubler-Ross, E. 2005. On Grief and Grieving. Schuster.",
      "doi": ""
    },
    {
      "text": "Lachut, S. 2009. Digital Immortality & Death 2.0, PSFK last accessed 9/16/09 http://www.psfk.com/2009/08/digital-immortality-and-death-20.html",
      "doi": ""
    },
    {
      "text": "Malinowski, B. 1948. Magic, Science, and Religion. New York: The Free Press.",
      "doi": ""
    },
    {
      "text": "Massimi, M. and Charise, A. 2009. Dying, death, and mortality: towards thanatosensitivity in HCI. In Ext. Abs of CHI '09, 2459--2468.  ",
      "doi": "10.1145/1520340.1520349"
    },
    {
      "text": "Miller, D., Parrot, F. 2009. Loss and material culture in south London. Journal of the Royal Anthropological Institute, Vol 15, 3, 502--519.",
      "doi": ""
    },
    {
      "text": "Odom, W. Pierce, J., Stolterman, E., Blevis, E. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proc. of CHI '09, 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Petrelli, D., van den Hoven, E., Whittaker, S. 2009. Making history: intentional capture of future memories. In Proc. of CHI '09, 1723--1732.  ",
      "doi": "10.1145/1518701.1518966"
    },
    {
      "text": "Petrelli, D., Whittaker, S., and Brockmeier, J. 2008. AutoTopography: what can physical mementos tell us about digital memories? In Proc. Of CHI '08, 53--62.  ",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "Prigerson et al. 2009. Prolonged Grief Disorder: Psychometric Validation of Criteria Proposed for DSM-V and ICD-11. PLoS Med 6(8): e1000121.",
      "doi": ""
    },
    {
      "text": "Radcliffe-Brown, A.R. 1933. The Andaman islanders. Cambridge The University Press.",
      "doi": ""
    },
    {
      "text": "Seale, C. 1998. Constructing Death: The Sociology of Dying and Bereavement. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Sellen, A. et al. 2007. Do life-logging technologies support memory for the past?: an experimental study using sensecam. In Proc. of CHI '07, 81--90.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Sudnow, D. 1967. Passing On: The Social Organization of Dying. Englewood Cliffs, New Jersey.",
      "doi": ""
    },
    {
      "text": "Uriu, D. et al. 2006. MASTABA: the household shrine in the future. In SIGGRAPH 2006, 151.  ",
      "doi": "10.1145/1179849.1180038"
    },
    {
      "text": "van den Hoven, E. et al. 2008. Communicating commemoration. In Proc. of SIMTech '08. Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "van Gennep, A. 1977. The Rites of Passage. Routeledge.",
      "doi": ""
    },
    {
      "text": "Wyche, S., Grinter, R. 2009. Extraordinary computing: religion as a lens for reconsidering the home. In Proc. of CHI '09, 749--758.  ",
      "doi": "10.1145/1518701.1518817"
    }
  ]
}