{
  "doi": "10.1145/1753326.1753354",
  "title": "Transforming clinic environments into information workspaces for patients",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "183-192",
  "year": 2010,
  "badges": [],
  "abstract": "Although clinic environments are a primary location for exchanging information with clinicians, patients experience these spaces as harsh environments to access, use, exchange, and manage information. In this paper, we present results from an ethnographic-inspired study of breast cancer patients actively interacting with information in clinic environments. Through observations and interviews, we observed information interactions in awkward physical positions; inefficient use of existing clinical space; separation of patients from their information and lack of support for collaborative document viewing. These factors compromised patients' abilities to manage their information work when they experienced bursts of information exchange, lack of advance information, fragmented attention, and heightened stress in clinic environments. To overcome these challenges, we identify formative strategies to focus attention, encourage collaboration, and improve communication in clinical settings.",
  "authors": [
    {
      "name": "Kenton T. Unruh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236202",
      "orcid": "missing"
    },
    {
      "name": "Meredith Skeels",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231519",
      "orcid": "missing"
    },
    {
      "name": "Andrea Civan-Hartzler",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657149",
      "orcid": "0000-0003-4932-7314"
    },
    {
      "name": "Wanda Pratt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100298117/rel-imgonly/img_2793-4.jpg",
      "acmid": "81100298117",
      "orcid": "0000-0003-4035-0198"
    }
  ],
  "references": [
    {
      "text": "Baker, C.F. Annoyance to ICU Noise: A model of patient discomfort. Critical Care Nursing Quarterly, 16, 2 (1993), 83--90.",
      "doi": ""
    },
    {
      "text": "Baker, C.F., Garvin, B., Kennedy C.W., & Polivaka, B. The effect of environmental sound and communication on CCU patients' heart rate and blood pressure. Research in Nursing & Health, 16, 6 (1993), 415--421.",
      "doi": ""
    },
    {
      "text": "Ballegaard, S.A., Hansen, T.R., & Kyng, M. Healthcare in everyday life: designing healthcare services for daily life. CHI 2008. ACM press (2008), 1807--1816.  ",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Berg, M. Patients and professionals in the information society: what might keep us awake in 2013. International Journal of Medical Informatics, 66, 1-3 (2002), 31--37.",
      "doi": ""
    },
    {
      "text": "Broadbent, D.E. Perception and Communication. London: Pergamon Press, 1958.",
      "doi": ""
    },
    {
      "text": "Cabrera, I.N., & Lee, M.H.M. Reducing noise pollution in the hospital setting by establishing a department of sound: A survey of recent research on the effects of noise and music in health care. Preventive Medicine, 30, 4 (2000), 339--345.",
      "doi": ""
    },
    {
      "text": "Consolvo, S. & Towle, J. Evaluating an ambient display for the home. CHI 2005, ACM Press (2005), 1304--1307.  ",
      "doi": "10.1145/1056808.1056902"
    },
    {
      "text": "Ehlen, P., Purver, M., Niekrasz, J., Lee, K., & Peters, S. Meeting Adjourned: Off-line Learning Interfaces for Automated Meeting Understanding. IUI 2008, ACM press (2008), 276--284.  ",
      "doi": "10.1145/1378773.1378810"
    },
    {
      "text": "Frankel, R., Altschuler, A., George, S., Kinsman, J., Jimison, H., Robertson, N.R., & Hsu, J. Effects of exam-room computing on clinician-patient communication: a longitudinal qualitative study. Journal of General Internal Medicine, 20, 8 (2005), 677--682.",
      "doi": ""
    },
    {
      "text": "Frost, J. & Smith, B. 2002. Visualizing health practice to treat diabetes. CHI 2002, ACM press (2002), 606--607.  ",
      "doi": "10.1145/506443.506506"
    },
    {
      "text": "Hafner D. Lost in the fog: Understanding \"chemo brain\". Nursing, 39, 8 (2009), 42--45.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R., Abowd, G.D., Davis, J.S., Blount, M.L., Ebling, M., & Mynatt, E.D. Opportunities for Pervasive Computing in Chronic Cancer Care. Proc. Pervasive Computing 2008, 262--279.  ",
      "doi": "10.1007/978-3-540-79576-6_16"
    },
    {
      "text": "Henrich,, A., Fay, J., & Sorrells, A.K.. Effects of acuity-adaptable rooms on flow of patients and delivery of care. American Journal of Critical Care, 13, 1 (2004), 35--45.",
      "doi": ""
    },
    {
      "text": "Hignett, S. Physical Ergonomics in health care. In Carayon, P. (Ed). Handbook of human factors and ergonomics in health care and patient safety. Lawrence Earlbaum, Mahwah, New Jersey, USA, 2007, 309--321",
      "doi": ""
    },
    {
      "text": "Jackson, L. Information complexity and medical communication: The effects of technical language and amount of information in a medical message. Health Comm 4, 3 (1992), 197--210.",
      "doi": ""
    },
    {
      "text": "Ju, W., Ionescu, A., Neeley, L., & Winograd, T. Where the Wild Things Work: Capturing Shared Physical Design Workspaces. CSCW 2004, ACM press (2004), 533--541.  ",
      "doi": "10.1145/1031607.1031696"
    },
    {
      "text": "Ley, P., & Llewelyn, S. Improving patients' understanding, recall, satisfaction, and compliance. In Broome, A., & Llewelyn, S. (Eds.) Health psychology: processes and applications. Chapman and Hal, London, 75--98.",
      "doi": ""
    },
    {
      "text": "Ley, P., & Spellman, M.S. Communications in an outpatient setting. British Journal Soc Clin Psych, 4 (1965), 114--116.",
      "doi": ""
    },
    {
      "text": "Mamykina, L., Mynatt, E., Davidson, P., & Greenblatt, D. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. CHI 2008, ACM press (2008), 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Moen, A., & Brennan, P.F. Health@Home: the work of health information management in the household (HIMH): implications for consumer health informatics (CHI) innovations. JAMIA, 12, 6 (2005), 648--656.",
      "doi": ""
    },
    {
      "text": "Morris, M.R., Paepcke, A., Winograd, T., & Stamberger, J. TeamTag: Exploring Centralized versus Replicated Controls for Co-located Tabletop Groupware. CHI 2006, ACM press (2006), 1273--1282.  ",
      "doi": "10.1145/1124772.1124964"
    },
    {
      "text": "Page, A. Keeping Patients Safe: Transforming the Work Environment of Nurses. 2004, Institute of Medicine of the National Academies Press, Washington, D.C., USA.",
      "doi": ""
    },
    {
      "text": "Pitkethly, M., MacGillivray, S., & Ryan, R. Recordings or summaries of consultations for people with cancer Cochrane Database of Systematic Reviews 2007, Issue 1. Art. No.: CD001539.",
      "doi": ""
    },
    {
      "text": "Rice, G., Ingram, J., & Mizan, J. Enhancing a primary care environment: a case study of effects on patient and staff in a single general practice. British Journal of General Practice,58, 552 (2008), 465--470.",
      "doi": ""
    },
    {
      "text": "Rouf, E., Whittle, J., Lu, N. & Schwartz, M.D. Computers in the exam room: differences in physician-patient interaction may be due to physician experience. Journal of General Internal Medicine, 22, 1(2007), 43--48.",
      "doi": ""
    },
    {
      "text": "Schappert, S.M.,& Rechtsteiner, E.A. Ambulatory medical care utilization estimates for 2006. National health statistics reports, 6, 8 (2008), 1--29.",
      "doi": ""
    },
    {
      "text": "Scott, S.D., Sheelagh, M., Carpendale, T., & Inkpen, K.M. Territoriality in collaborative tabletop workspaces. CSCW 2004, ACM press (2004), 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Schmidt, K., & Bannon, L. Taking CSCW seriously: Supporting articulation work. Computer Supported Cooperative Work, 1, 1, (1992), 7--40.",
      "doi": ""
    },
    {
      "text": "Shumaker SA, Reizenstein JE. Environmental factors affecting inpatient stress in acute care hospitals. In: Evans, G.W. (Ed) Environmental stress, 1982. Cambridge University Press, New York, USA, 179--223.",
      "doi": ""
    },
    {
      "text": "Star, S.L., & Strauss, A. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. CSCW, 8, 1-2 (1999), 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Sullivan, F., & Wyatt, J.C. How computers can help to share understanding with patients. British Medical Journal, 331, 7521 (2005), 892--894.",
      "doi": ""
    },
    {
      "text": "Ulrich, R.S. View through a window may influence recovery from surgery. Science, 224, 4647 (1984), 420--421.",
      "doi": ""
    },
    {
      "text": "Wang, H. & Blevis, E. Concepts that support collocated collaborative work inspired by the specific context of industrial designers. Proc. of CSCW. ACM Press (2004), 546--549.  ",
      "doi": "10.1145/1031607.1031698"
    },
    {
      "text": "Williams, J.R., Guidelines for the Use of Multimedia in Instruction, Proceedings of the Human Factors and Ergonomics Society 42nd Annual Meeting, (1998), 1447--1451.",
      "doi": ""
    },
    {
      "text": "Wilson, A,D. PlayAnywhere: A Compact Interactive Tabletop Projection-Vision System. UIST 2005, ACM press (2005), 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    }
  ]
}