{
  "doi": "10.1145/1753326.1753428",
  "title": "Dynamic query interface for spatial proximity query with degree-of-interest varied by distance to query point",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "693-702",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we present an interactive query interface called \"TrapezoidBox\" to support spatial proximity queries where users' degree of interest varies depending upon the degree of separation from the point of interest. Spatial proximity queries are commonly built in information seeking tasks especially on online maps. If not impossible, it is hard to formulate spatial proximity queries using existing dynamic query widgets such as range sliders. TrapezoidBox allows users to easily build spatial proximity queries by interactively adjusting a trapezoidal function. Our controlled user study results show that TrapezoidBox has several advantages over a baseline interface with range sliders.",
  "authors": [
    {
      "name": "Myoungsu Cho",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460642396",
      "orcid": "missing"
    },
    {
      "name": "Bohyoung Kim",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758814957",
      "orcid": "missing"
    },
    {
      "name": "Dong Kyun Jeong",
      "institution": "Samsung Advanced Institute of Technology, Yongin, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460644351",
      "orcid": "missing"
    },
    {
      "name": "Yeong-Gil Shin",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100157283",
      "orcid": "missing"
    },
    {
      "name": "Jinwook Seo",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100413624",
      "orcid": "0000-0002-7734-822X"
    }
  ],
  "references": [
    {
      "text": "Ahlberg, C., Shneiderman, B., The alphaslider: A compact and rapid selector. Proc. CHI 1994, (1994), 365--371.  ",
      "doi": "10.1145/191666.191790"
    },
    {
      "text": "Ahlberg, C., Spotfire: an information exploration environment. ACM SIGMOD Record, (1996), 25(4): 25--29.  ",
      "doi": "10.1145/245882.245893"
    },
    {
      "text": "Ahlberg, C., Williamson, C., and Shneiderman, B., Dynamic queries for information exploration: An implementation and evaluation. Proc. CHI 1992, (1992), 619--626.  ",
      "doi": "10.1145/142750.143054"
    },
    {
      "text": "Bereuter, P., Venkateswaran, R., and Weibel, R., The use of filters for adaptive mobile mapping scenarios. Proc. AGILE 2009 Workshop on Adaptation in Spatial Communication, (2009), 39--44.",
      "doi": ""
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T., Toolglass and Magic Lenses: the See-Through Interface. Proc. CHI 1993, (1993), 73--80  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Burigat, S., Chittaro, L., Interactive visual analysis of geographic data on mobile devices based on dynamic queries. Journal of Visual Languages and Computing, (2008), 19(1): 99--122.  ",
      "doi": "10.1016/j.jvlc.2007.04.001"
    },
    {
      "text": "Fishkin, K., Stone, M.C., Enhanced dynamic queries via movable filters. Proc. CHI 1995, (1995), 415--420.  ",
      "doi": "10.1145/223904.223960"
    },
    {
      "text": "Hochheiser, H., Shneiderman, B., Dynamic query tools for time series data sets: timebox widgets for interactive exploration. Information Visualization, (2004), 3(1): 1--18.  ",
      "doi": "10.1145/993176.993177"
    },
    {
      "text": "Kang, H., Shneiderman, B., Visualization methods for personal photo collections: Browsing and searching in the PhotoFinder. Proc. IEEE International Conf. on Multimedia and Expo 2000, (2000), 1539--1542.",
      "doi": ""
    },
    {
      "text": "Mountain, D., MacFarlane, A., Geographic information retrieval in a mobile environment: Evaluating the needs of mobile individuals. Journal of Information Science, (2007), 33(5): 515.  ",
      "doi": "10.1177/0165551506075333"
    },
    {
      "text": "Osada, M., Liao, H., and Shneiderman, B., AlphaSlider: Searching textual lists with sliders. Proc. the Ninth Annual Japanese Conf. on Human Interface 1993, (1993).",
      "doi": ""
    },
    {
      "text": "Plaisant, C., Jain, V., Dynamaps: Dynamic queries on a health statistics atlas. Conf. on Human Factors in Computing Systems, (1994), 439--440.  ",
      "doi": "10.1145/259963.260438"
    },
    {
      "text": "Shneiderman, B., Ahlberg, C., Visual information seeking: Tight coupling of dynamic query filters with starfield displays. Proc. CHI 1994, (1994), 313--317.  ",
      "doi": "10.1145/191666.191775"
    },
    {
      "text": "Shneiderman, B., Dynamic queries for visual information seeking. IEEE Software, (1994), 11(6): 70--77.  ",
      "doi": "10.1109/52.329404"
    },
    {
      "text": "Shneiderman, B., The eyes have it: A task by data type taxonomy for information visualizations. Proc. IEEE Symposium on Visual Languages 1996, (1996), 336--343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Wattenberg, M., Sketching a graph to query a time-series database. Proc. CHI 2001 Extended Abstracts, (2001), 381--382.  ",
      "doi": "10.1145/634067.634292"
    },
    {
      "text": "Williamson, C., Shneiderman, B., The dynamic HomeFinder: Evaluating dynamic queries in a real-estate information exploration system. Proc. the 15th annual international ACM SIGIR Conf. on Research and development in information retrieval, (1992), 338--346.  ",
      "doi": "10.1145/133160.133216"
    },
    {
      "text": "Young, D., Shneiderman, B., A graphical filter/flow representation of boolean queries: A prototype implementation and evaluation. Journal of the American Society for Information Science, (1993), 44(6): 327--339.  ",
      "doi": "10.5555/160921.160924"
    }
  ]
}