{
  "doi": "10.1145/1753326.1753628",
  "title": "Studying always-on electricity feedback in the home",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1995-1998",
  "year": 2010,
  "badges": [],
  "abstract": "The recent emphasis on sustainability has made consumers more aware of their responsibility for saving resources, in particular, electricity. Consumers can better understand how to save electricity by gaining awareness of their consumption beyond the typical monthly bill. We conducted a study to understand consumers' awareness of energy consumption in the home and to determine their requirements for an interactive, always-on interface for exploring data to gain awareness of home energy consumption. In this paper, we describe a three-stage approach to supporting electricity conservation routines: raise awareness, inform complex changes, and maintain sustainable routines. We then present the findings from our study to support design implications for energy consumption feedback interfaces.",
  "tags": [
    "home",
    "behavior change",
    "electricity feedback",
    "participatory design"
  ],
  "authors": [
    {
      "name": "Yann Riche",
      "institution": "Riche Design, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81363604200/rel-imgonly/ynr.jpg",
      "acmid": "81363604200",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Dodge",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/do/10.1145/contrib-81335489985/rel-imgonly/dodgej2021square.jpeg",
      "acmid": "81335489985",
      "orcid": "missing"
    },
    {
      "name": "Ronald A. Metoyer",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/do/10.1145/contrib-81100388468/rel-imgonly/9.13.15ronaldmetoyer11560_medium.jpg",
      "acmid": "81100388468",
      "orcid": "0000-0003-2206-1720"
    }
  ],
  "references": [
    {
      "text": "M. Chetty, D. Tran, and R. E. Grinter. Getting to green: understanding resource consumption in the home. In Proc. of UbiComp, pages 242--251, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "A. Crabtree and T. Rodden. Domestic routines and and design for the home. CSCW, 13:191--220, 2004.  ",
      "doi": "10.1023/B%3ACOSU.0000045712.26840.a4"
    },
    {
      "text": "S. Darby. The effectiveness of feedback on energy consumption, 2006.",
      "doi": ""
    },
    {
      "text": "C. Fisher. Feedback on household electricity consumption: A tool for saving energy? Energy Efficiency, 1(1):79--104, 2008.",
      "doi": ""
    },
    {
      "text": "G. Fitzpatrick and G. Smith. Technology-enabled feedback on domestic energy consumption: Articulating a set of design concerns. Pervasive, 8(1), 2009.  ",
      "doi": "10.1109/MPRV.2009.17"
    },
    {
      "text": "J. Froehlich. Promoting energy efficient behaviors in the home through feedback: The role of human-computer interaction, 2009.",
      "doi": ""
    },
    {
      "text": "W. Kempton and L. L. Layne. The consumer's energy analysis environment. Energy Policy, 22(10):857--866, 1994.",
      "doi": ""
    },
    {
      "text": "E. A. Locke, K. N. Shaw, L. M. Saari, and G. P. Latham. Goal setting and task performance: 1969-1980. Psychological Bulletin, 90(1):125--152, 1981.",
      "doi": ""
    },
    {
      "text": "L. T. McCalley and C. J. H. Midden. Energy conservation through product-integrated feedback: The roles of goal-setting and social orientation. J. of Economic Psychology, 23(5):589--603, 2002.",
      "doi": ""
    },
    {
      "text": "D. Norman. Emotions and design: Attractive things work better. interactions, 9:36--42, July-August 2002.  ",
      "doi": "10.1145/543434.543435"
    },
    {
      "text": "S. N. Patel, T. Robertson, J. A. Kientz, M. S. Reynolds, and G. D. Abowd. At the flick of a switch: Detecting and classifying unique electrical events. In Proc. of Ubicomp, pages 271--288, 2007. ",
      "doi": "10.5555/1771592.1771608"
    },
    {
      "text": "J. Pierce, W. Odom, and E. Blevis. Energy aware dwelling: a critical survey of interaction design for eco-visualizations. In Proc. of OzCHI, pages 1--8. ACM New York, NY, USA, 2008.  ",
      "doi": "10.1145/1517744.1517746"
    },
    {
      "text": "J. Prochaska and C. DiClemente. The transtheoretical approach, pages 147--171. Oxford University, 2005.",
      "doi": ""
    },
    {
      "text": "Y. Riche. Designing Communication Appliances to Support Aging in Place. Ph.D. thesis, Univ. Paris Sud, France, 2008.",
      "doi": ""
    },
    {
      "text": "R. J. Sexton, N. Brown Johnson, and A. Konakayama. Consumer response to continuous-display electricity-use monitors in a time-of-use pricing experiment. Consumer Research, 14(1):55--62, 1987.",
      "doi": ""
    },
    {
      "text": "Energy use: the human dimension, 1984. Report to Committee on Behavioral and Social Aspects of Energy Consumption and Production, National Research Council.",
      "doi": ""
    },
    {
      "text": "T. Ueno, F. Sano, O. Saeki, and K. Tsuji. Effectiveness of an energy-consumption information system on energy savings in residential houses based on monitored data. Applied Energy, 83:166--183, 2005.",
      "doi": ""
    },
    {
      "text": "R. A. Winett, M. S. Neale, and H. C. Grier. Effects of self monitoring and feedback on residential electricity consumption. Applied Behavior Analysis, 12(2):173--184, 1979.",
      "doi": ""
    },
    {
      "text": "G. Wood and M. Newborough. Energy-use information transfer for intelligent homes.",
      "doi": ""
    }
  ]
}