{
  "doi": "10.1145/1753326.1753681",
  "title": "Designing a technological playground: a field study of the emergence of play in household messaging",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2351-2360",
  "year": 2010,
  "badges": [],
  "abstract": "We present findings from a field study of Wayve, a situated messaging device for the home that incorporates handwriting and photography. Wayve was used by 24 households (some of whom were existing social networks of family and friends) over a three-month period. We consider the various types of playfulness that emerged during the study, both through the sending of Wayve messages and through the local display of photos and notes. The findings are explored in the context of the literature on play, with the aim of identifying aspects of Wayve's design, as well as the context in which it was used, that engendered playfulness. We also highlight the role of play in social relationships, before concluding with design implications.",
  "authors": [
    {
      "name": "Siân E. Lindley",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100028041",
      "orcid": "missing"
    },
    {
      "name": "Richard Harper",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452613064",
      "orcid": "missing"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blythe, M.A., Overbeeke, K., Monk, A.F., Wright, P.C. Funology: From Usability to Enjoyment. Kluwer Academic Publishers, London, 2004. ",
      "doi": "10.5555/1139008"
    },
    {
      "text": "Caillois, R. Man, Play and Games. University of Illinois Press, Urbana and Chicago, 1958.",
      "doi": ""
    },
    {
      "text": "Costello, B., Edmonds, E. A study in play, pleasure and interaction design. In Proc. DPPI 2007, 76--91.  ",
      "doi": "10.1145/1314161.1314168"
    },
    {
      "text": "Csikszentmihalyi, M. Beyond Boredom and Anxiety. Jossey-Bass Publishers, San Francisco, 1975.",
      "doi": ""
    },
    {
      "text": "Ellis, M.J. Why People Play. Prentice Hall, Eaglewood Cliffs, 1973.",
      "doi": ""
    },
    {
      "text": "Gaver, B. Designing for Homo Ludens, still. http://kmdi.utoronto.ca/documentshomepage/gaver-ludens08.pdf",
      "doi": ""
    },
    {
      "text": "Gaver, W.W., Bowers, J., Boucher, A., Gellerson, H., Pennington, S., Schmidt, A. et al. The drift table: Designing for ludic engagement. In Ext. Abstracts CHI 2004, 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Huizinga, J. Homo Ludens: A Study of the Play Element in Culture. The Beacon Press, Boston, 1950.",
      "doi": ""
    },
    {
      "text": "Jacucci, G., Oulasvirta, A., Salovaara, A. Active construction of experience through mobile media. Personal and Ubiquitous Computing 11, (2007), 215--34.  ",
      "doi": "10.1007/s00779-006-0084-5"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., Sellen, A. The ubiquitous camera: An in-depth study of camera phone use. Pervasive Computing 4, 2 (April-June 2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Kurvinen, E. Only when Miss Universe snatches me: Teasing in MMS messaging. Proc. DPPI 2003, 98--102.  ",
      "doi": "10.1145/782896.782921"
    },
    {
      "text": "Lindley, S.E. Shades of lightweight: Supporting cross-generational communication through home messaging. Universal Access in the Information Society (in press).",
      "doi": ""
    },
    {
      "text": "Mäkelä, A., Giller, V., Tscheligi, M., Sefelin, R. Joking, storytelling, artsharing, expressing affection: A field trial of how children and their social network communicate with digital images in leisure time. In Proc. CHI 2000, 548--555.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "O'Hara, K., Harper, R., Unger, A., Wilkes, J., Sharpe, B., Jansen, M. TxtBoard: From text-to-person to text-to-home. In Ext. Abstracts CHI 2005, 1705--1708.  ",
      "doi": "10.1145/1056808.1057002"
    },
    {
      "text": "Perry, M., Rachovides, D. Entertaining situated messaging at home. Computer-Supported Cooperative Work 16, 2 (2007), 99--128.  ",
      "doi": "10.1007/s10606-007-9042-7"
    },
    {
      "text": "Salen, K., Zimmerman, E. Rules of Play. MIT Press, London, 2004.",
      "doi": ""
    },
    {
      "text": "Salovaara, A. Appropriation of a MMS-based comic creator: From system functionalities to resources for action. In Proc. CHI 2007, 1117--1126.  ",
      "doi": "10.1145/1240624.1240794"
    },
    {
      "text": "Saslis-Lagoudakis, G., Cheverst, K., Dix, A., Fitton, D., Rouncefield, M. Hermes@Home: Supporting awareness and intimacy between distant family members. In Proc. OzCHI 2006, 23--30.  ",
      "doi": "10.1145/1228175.1228183"
    },
    {
      "text": "Sellen, A., Harper, R., Eardley, R., Izadi, S., Regan, T., et al. HomeNote: Supporting situated messaging in the home. In Proc. CSCW 2006, 383--392.  ",
      "doi": "10.1145/1180875.1180933"
    },
    {
      "text": "Sengers, P., Gaver, B. Staying open to interpretation: Engaging multiple meanings in design and evaluation. In Proc. DIS 2006, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Vetere, F., Davis, H., Gibbs, M., Howard, S. The Magic Box and Collage: Responding to the challenge of distributed intergenerational play. International Journal of Human-Computer Studies 67, 2 (2009), 165--178.  ",
      "doi": "10.1016/j.ijhcs.2008.09.004"
    },
    {
      "text": "Voida, A., Greenberg, S. Wii all play: The console game as a computational meeting place. In Proc. CHI 2009, 1559--1568.  ",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Voida, A., Mynatt, E.D. Six themes of the communicative appropriation of photographic images. In Proc. CHI 2005, 171--180.  ",
      "doi": "10.1145/1054972.1054997"
    }
  ]
}