{
  "doi": "10.1145/1753326.1753436",
  "title": "Where there's a will there's a way: mobile media sharing in urban india",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "753-762",
  "year": 2010,
  "badges": [],
  "abstract": "We present the results of a qualitative study of the sharing and consumption of entertainment media on low-cost mobile phones in urban India, a practice which has evolved into a vibrant, informal socio-technical ecosystem. This wide-ranging phenomenon includes end users, mobile phone shops, and content distributors, and exhibits remarkable ingenuity. Even more impressive is the number of obstacles which have been surmounted in its establishment, from the technical (interface complexity, limited Internet access, viruses), to the broader socioeconomic (cost, language, legality, institutional rules, lack of privacy), all seemingly due to a strong desire to be entertained. Our findings carry two implications for projects in HCI seeking to employ technology in service of social and economic development. First, although great attention is paid to the details of UI in many such projects, we find that sufficient user motivation towards a goal turns UI barriers into mere speed bumps. Second, we suggest that needs assessments carry an inherent bias towards what outsiders consider needs, and that identified \"needs\" may not be as strongly felt as perceived.",
  "authors": [
    {
      "name": "Thomas N. Smyth",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528806",
      "orcid": "missing"
    },
    {
      "name": "Satish Kumar",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659394874",
      "orcid": "missing"
    },
    {
      "name": "Indrani Medhi",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329490627",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Constitution of India. 2003.",
      "doi": ""
    },
    {
      "text": "Bailur, S. The complexities of community participation in ICT for development projects: The case of \"Our Voices\". Proceedings of the International Conference on Social Implications of Computers in Developing Countries, (2007).",
      "doi": ""
    },
    {
      "text": "Brand, P. and Schwittay, A. The Missing Piece: Human-Driven Design and Research in ICT and Development. Proceedings of the international conference on information and communication technologies and development, (2006), 2--10.",
      "doi": ""
    },
    {
      "text": "Brewer, E., Demmer, M., Ho, M., et al. The challenges of technology research for developing regions. Pervasive Computing 5, 2 (2006), 15--23.  ",
      "doi": "10.1109/MPRV.2006.40"
    },
    {
      "text": "Cheverst, K., Dix, A., Fitton, D., et al. Exploring bluetooth based mobile phone interaction with the hermes photo display. Proceedings of the international conference on Human computer interaction with mobile devices and services, (2005), 47--54.  ",
      "doi": "10.1145/1085777.1085786"
    },
    {
      "text": "Cui, Y., Chipchase, J., and Jung, Y. Personal TV: A Qualitative Study of Mobile TV Users. Lecture Notes in Computer Science 4471, (2007), 195. ",
      "doi": "10.5555/1763017.1763044"
    },
    {
      "text": "Harper, R., Regan, T., Rouncefield, M., Rubens, S., and Al Mosawi, K. Trafficking: Design for the Viral Exchange of Digital Content on Mobile Phones. Proceedings of the international conference on Human computer interaction with mobile devices and services, (2007).  ",
      "doi": "10.1145/1377999.1378015"
    },
    {
      "text": "Heeks, R. Most egovernment-for-development projects fail: how can risks be reduced? Institute for Development Policy and Management, 2003.",
      "doi": ""
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., and Sellen, A. The ubiquitous camera: An in-depth study of camera phone use. Pervasive Computing, (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Kumar, A., Rajput, N., Chakraborty, D., Agarwal, S.K., and Nanavati, A.A. VOISERV: Creation and Delivery of Converged Services through Voice for Emerging Economies. Proceedings of the IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Kuriyan, R. and Toyama, K. Review of Research on Rural PC Kiosks. 2007. http://research.microsoft.com/en-us/um/india/projects/ruralkiosks/Kiosks%20Research.doc.",
      "doi": ""
    },
    {
      "text": "Manuel, P. Cassette Culture: Popular Music and Technology in North India. University Of Chicago Press, 1993.",
      "doi": ""
    },
    {
      "text": "Maunder, A., Marsden, G., and Harper, R. Creating and sharing multi-media packages using large situated public displays and mobile phones. Proceedings of the international conference on Human computer interaction with mobile devices and services, (2007), 222--225.  ",
      "doi": "10.1145/1377999.1378010"
    },
    {
      "text": "Medhi, I., Menon, G., and Toyama, K. Challenges in computerized job search for the developing world. CHI '08 extended abstracts on Human factors in computing systems, (2008), 2079--2094.  ",
      "doi": "10.1145/1358628.1358640"
    },
    {
      "text": "Mlama, P.M. Culture and development: The popular theatre approach in Africa. Nordiska Afrikainstitutet, Uppsala, 1991.",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Mitchell, A.S., and Vorbau, A. Consuming video on mobile devices. Proceedings of the conference on Human factors in computing systems, (2007), 857--866.  ",
      "doi": "10.1145/1240624.1240754"
    },
    {
      "text": "Pan, T. Market review: Shanzhai phones in India. 2009. http://www.shanzai.com/index.php? option=com_content&view=article&id=121.",
      "doi": ""
    },
    {
      "text": "Prasad, A., Medhi, I., Toyama, K., and Balakrishnan, R. Exploring the feasibility of video mail for illiterate users. Proceedings of the working conference on Advanced visual interfaces, (2008), 103--110.  ",
      "doi": "10.1145/1385569.1385588"
    },
    {
      "text": "Sey, A. Public Access to ICTs: A Review of the Literature. Center for Information & Society, University of Washington, 2008.",
      "doi": ""
    },
    {
      "text": "Shukla, R. How India Earns, Spends, and Saves. The Max New York Life Insurance Limited, 2007.",
      "doi": ""
    },
    {
      "text": "Södergård, C., ed. Mobile television-technology and user experiences. In Report on the Mobile-TV project. VTT Publications, Espoo, Finland, 2003.",
      "doi": ""
    },
    {
      "text": "Strauss, A.C. and Corbin, J. Basics of Qualitative Research. Sage Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Surana, S., Patra, R., Nedevschi, S., and Brewer, E. Deploying a Rural Wireless Telemedicine System: Experiences in Sustainability. Computer 41, 6 (2008), 48--56.  ",
      "doi": "10.1109/MC.2008.184"
    },
    {
      "text": "Toyama, K. and Keniston, K. Telecentre Debates. Telecentre Magazine 1, 2008. http://www.telecentremagazine.net/articles/article-details.asp?articleid=72.",
      "doi": ""
    }
  ]
}