{
  "doi": "10.1145/1753326.1753419",
  "title": "Weightless walls and the future office",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "619-628",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we describe how future office environments can benefit from the addition of weightless walls virtual, sound blocking walls created using headsets. We particularly focus on exploring how different interaction techniques can be employed to efficiently create, erase, or edit the layouts of these walls, and envisioning how they could impact the overall office experience. Metaphorically, the end effect of integrating weightless walls into offices is that space will be treated in a way similar to how random access memory is treated in PCs; as a shared resource open to dynamic allocations, and whose usage is periodically optimized in real time according to the collective activities of the occupants. Furthermore, we view weightless walls as harbingers of the emergence of synthetic space the eventual fusion of the architectural environment with the distinctive properties of digital bits.",
  "authors": [
    {
      "name": "Yuichiro Takeuchi",
      "institution": "Sony CSL, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314492368",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Architects and Climate Change. (http://www.aia.org/aiaucmp/groups/aia/documents/¥¥pdf/aias078740.pdf). Retrieved on Jan. 10, 2010.",
      "doi": ""
    },
    {
      "text": "Basu, S., Pentland, A. Smart Headphones. In Extended Abstracts of CHI 2001. pp.267--268.  ",
      "doi": "10.1145/634067.634226"
    },
    {
      "text": "Bell, P.A., Greene, T.C., Fisher, J.D., Baum, A. Environmental Psychology (Fifth Edition). Lawrence Erlbaum Associates. 2001.",
      "doi": ""
    },
    {
      "text": "Block, L.K., Stokes, G.S. Performance and Satisfaction in Private Versus Nonprivate Work Settings. Environment and Behavior, vol.21, no.3. pp.277--297. 1989.",
      "doi": ""
    },
    {
      "text": "Bly, S.A., Harrison, S.R., Irwin, S. Media Spaces: Bringing People Together in a Video, Audio, and Computing Environment. Communications of the ACM, vol.36, no.1, pp.28--46. 1993.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Brennan, A., Chugh, J.S., Kline, T. Traditional Versus Open Office Design: A Longitudinal Field Study. Environment and Behavior, vol.34, no.3. pp.279--299. 2002.",
      "doi": ""
    },
    {
      "text": "Convertino, G., Mentis, H.M., Rosson, M.B., Slavkovic, A., Carroll, J.M. Supporting Content and Process Common Ground in Computer Supported Teamwork. In Proc. of CHI 2009. pp.2339--2348.  ",
      "doi": "10.1145/1518701.1519059"
    },
    {
      "text": "Danninger, M., Vertegaal, R., Siewiorek, D.P., Mamuji, A. Using Social Geometry to Manage Interruptions and Co-Worker Attention in Office Environments. In Proc. of Graphics Interface 2005. pp.211--218. ",
      "doi": "10.5555/1089508.1089543"
    },
    {
      "text": "Davis, T.R. The Influence of Physical Environment in Offices. Academy of Management Review, vol.9, no.2. pp.271--283. 1984.",
      "doi": ""
    },
    {
      "text": "Dey, A.K., Salber, D., Abowd, G.D. A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-Aware Applications. Human-Computer Interaction, vol.16, no.1. pp.97--166. 2001.  ",
      "doi": "10.1207/S15327051HCI16234_02"
    },
    {
      "text": "Dourish, P., Bellotti, V. Awareness and Coordination in Shared Workspaces. In Proc. of CSCW 1992. pp.107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Duval, C.L., Charles, K.E., Veitch, J.A. Open-Plan Office Density and Environmental Satisfaction. IRC Research Report no.150. pp.2--25. 2002.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G.W., Ishii, H., Buxton, W.A.S. Bricks: Laying the Foundations for Graspable User Interfaces. In Proc. of CHI 1995. pp.442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Gutwin, C., Greenberg, S. Effects of Awareness Support on Groupware Usability. In Proc. of CHI 1998. pp.511--518.  ",
      "doi": "10.1145/274644.274713"
    },
    {
      "text": "Ishii, H., Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. In Proc. of CHI 1997. pp.234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Kapadia, A., Henderson, T., Fielding, J.J., Kotz, D. Virtual Walls: Protecting Digital Privacy in Pervasive Environments. In Proc. of Pervasive 2007. pp.162--179. ",
      "doi": "10.5555/1758156.1758169"
    },
    {
      "text": "Mamuji, A., Vertegaal, R., Dickie, C., Sohn, C., Danninger, M. Attentive Office Cubicles: Mediating Visual and Auditory Interactions Between Office Co-Workers. In Video Proc. of UbiComp 2004.",
      "doi": ""
    },
    {
      "text": "Mueller F., Karau, M. Transparent Hearing. In Extended Abstracts of CHI 2002. pp.730--731.  ",
      "doi": "10.1145/506443.506569"
    },
    {
      "text": "Myerson, J., Ross, P. The 21st Century Office. Laurence King Publishing. 2005.",
      "doi": ""
    },
    {
      "text": "Norman, D. The Design of Everyday Things. Basic Books. 1988.",
      "doi": ""
    },
    {
      "text": "Ono, Y., Lifton, J., Feldmeier, M., Paradiso, J.A. Distributed Acoustic Conversation Shielding: An Appication of a Smart Transducer Network. In Proc. of SANET 2007. pp.27--34.  ",
      "doi": "10.1145/1287731.1287738"
    },
    {
      "text": "Oommen, V., Knowles, M., Zhao, I. Should Health Managers Embrace Open Plan Work Environments? Asia Pacific Journal of Health Management, vol.3, no.2. pp.37--44. 2008.",
      "doi": ""
    },
    {
      "text": "Pan, J.J., Pan, S.J., Zheng, V.W., Yang, Q. Digital Wall: A Power-Efficient Solution for Location-based Data Sharing. In Proc. of PerCom 2008. pp.645--650.  ",
      "doi": "10.1109/PERCOM.2008.81"
    },
    {
      "text": "Rakkolainen, I., DiVerdi, S., Olwal, A., Candussi, N.l., Hullerer, T., Laitinen, M., Piirto, M., Palovuori, K. The Interactive FogScreen. In SIGGRAPH 2005 Emerging Technologies.  ",
      "doi": "10.1145/1187297.1187306"
    },
    {
      "text": "Raskar, R., Welch, G., Cutts, M., Lake, A., Stesin, L., Fuchs, H. The Office of the Future: A Unified Approach to Image-Based Modeling and Spatially Immersive Displays. In Proc. of SIGGRAPH 1998. pp.179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Schilit, B., Adams, N., Want, R. Context-Aware Computing Applications. In Proc. of WMCSA 1994, pp.85--90.  ",
      "doi": "10.1109/WMCSA.1994.16"
    },
    {
      "text": "Sundstrom, E. Work Places: The Psychology of the Physical Environment in Offices and Factories. Cambridge University Press. 1986.",
      "doi": ""
    },
    {
      "text": "Sundstrom, E., Herbert, R.K., Brown, D.W. Privacy and Communication in an Open-Plan Office: A Case Study. Environment and Behavior, vol.14, no.5. pp.543--559. 1982.",
      "doi": ""
    },
    {
      "text": "Tamaki, E., Miyaki, T., Rekimoto, J. Brainy Hand: An Ear-Worn Hand Gesture Interaction Device. In Extended Abstracts of CHI 2009. pp.4255--4260.  ",
      "doi": "10.1145/1520340.1520649"
    },
    {
      "text": "Underkoffler, J., Ishii, H. Illuminating Light: An Optical Design Tool with a Luminous-Tangible Interface. In Proc. of CHI 1998. pp.542--549.  ",
      "doi": "10.1145/274644.274717"
    },
    {
      "text": "Vawter, N. Ambient Addition: How to Turn Urban Noise into Music. Masters Thesis, Program in Media Arts and Sciences, Massachusetts Institute of Technology. 2006.",
      "doi": ""
    }
  ]
}