{
  "doi": "10.1145/1753326.1753721",
  "title": "ViralVCD: tracing information-diffusion paths with low cost media in developing communities",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2607-2610",
  "year": 2010,
  "badges": [],
  "abstract": "We describe ViralVCD: a low cost method for tracing paths of information diffusion in developing communities using physical media. We instituted a participatory video framework for creation and dissemination of developmental videos in seven urban slums and peri-urban communities of Bangalore, India. By combining a call-in contest with Video CDs, we were able to measure developmental impact as well as elicit data on social networks and technology usage practices. In particular, our technique was able to extract data from multiple layers-social, technological, and developmental. ViralVCD allowed us to identify key actors and map information diffusion, as well as technology ownership and access. These findings have implications for HCI initiatives targeting low income locales and populations.",
  "tags": [
    "hci4d",
    "diffusion",
    "tracking",
    "low-cost media",
    "methods"
  ],
  "authors": [
    {
      "name": "Nithya Sambasivan",
      "institution": "University of California, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81350582954/rel-imgonly/nithya_coorg.jpg",
      "acmid": "81350582954",
      "orcid": "missing"
    },
    {
      "name": "Ed Cutrell",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of California, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Chetty, M. and Grinter, RE. (2007). HCI4D: HCI Challenges in the Global South. CHI EA  ",
      "doi": "10.1145/1240866.1241002"
    },
    {
      "text": "Dearden, A., Light A., Dray S., Thomas, J.C., Best, M., Greenblatt D., Krishnan G., Pittman C. and Sambasivan N. User-Centered Design and International Development. CHI EA  ",
      "doi": "10.1145/1240866.1241087"
    },
    {
      "text": "Gandhi, R. Veeraraghavan, R., Toyama, K. and Ramprasad, V. (2007). Digital Green: Participatory Video for Agricultural Extension. Proc of ACM/IEEE ICTD.",
      "doi": ""
    },
    {
      "text": "Rogers, E. M. (1995). Diffusion of innovations (4th ed.). New York: The Free Press",
      "doi": ""
    },
    {
      "text": "Sambasivan, N., Rangaswamy, N., Cutrell, E. and Nardi, B. (2009). Ubicomp4D: Interaction and Infrastructure for International Development. Proc of UbiComp. pp. 155--164  ",
      "doi": "10.1145/1620545.1620570"
    }
  ]
}