{
  "doi": "10.1145/1753326.1753464",
  "title": "One size does not fit all: applying the transtheoretical model to energy feedback technology design",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "927-936",
  "year": 2010,
  "badges": [],
  "abstract": "Global warming, and the climate change it induces, is an urgent global issue. One remedy to this problem, and the focus of this paper, is to motivate sustainable energy usage behaviors by people. One approach is the development of technologies that provide real-time, continuous feedback of energy usage. However, there is one problem - most tech-nologies use a \"one-size-fits-all\" solution, providing the same feedback to differently motivated individuals at different stages of readiness, willingness and ableness to change. In this paper, we synthesize a wide range of motivational psychology literature to develop a motivational framework based on the Transtheoretical (aka Stages of Behavior Change) Model. For each stage, we state the mo-tivational goal(s), and recommendation(s) for how technol-ogies can reach these goals. Each goal and recommendation is supported by a rationale based on motivational literature. Each recommendation is supported by a simple textual example illustrating one way to apply the recommendation.",
  "authors": [
    {
      "name": "Helen Ai He",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384618417",
      "orcid": "missing"
    },
    {
      "name": "Saul Greenberg",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-81100197069/rel-imgonly/saul.greenberg.jpg",
      "acmid": "81100197069",
      "orcid": "missing"
    },
    {
      "name": "Elaine M. Huang",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100080130",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aarts, H., Dijksterhuis, A. (2000). Habits as knowledge structures: automaticity in goal-directed behavior. APA, 78(1).",
      "doi": ""
    },
    {
      "text": "Arkes, H. R. (1978). Competence and the maintenance of behavior. Motivation and Emotion, 2, 201--211.",
      "doi": ""
    },
    {
      "text": "Austin, J.T., Vancouver, J.B. (1996). Goal constructs in psychology: structure, process and content. Psyc. Bulletin, 120(3).",
      "doi": ""
    },
    {
      "text": "Becker, L.J. (1978). Joint effect of feedback and goal-setting on performance: A field study of residential energy conservation. J. of Applied Psyc., 63, 428--433.",
      "doi": ""
    },
    {
      "text": "Beebe, S.A., Beebe, S.J., Redmond, M.V. (1999). Interpersonal Communication: Relating to Others (2nd ed), Allyn & Bacon,.",
      "doi": ""
    },
    {
      "text": "Bem, D.J. (1967). Self-perception: an alternative interpretation of cognitive dissonance phenomena. Pysc. Review, 74(3).",
      "doi": ""
    },
    {
      "text": "Berlyne, D.E. (1961). Conflict and the orientation reaction. Journal of Experimental Psychology, 62, 476--483.",
      "doi": ""
    },
    {
      "text": "Blevis, E. (2007). Sustainable Interaction Design: invention and disposal, renewal and reuse. Proc. ACM CHI'07, 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Boud, D. (2001). Using journal writing to enhance reflective practice. In English, L.M.and Gillen, M.A (Eds). New Directions in Adult and Continuing Ed. No.90. Jossey-Bass, 9--18.",
      "doi": ""
    },
    {
      "text": "Cameron, L.D., Brown, P.M. (1998). Social value orientation and decisions to take proenvironmental action. J. of App. Social Pysc, 28(8).",
      "doi": ""
    },
    {
      "text": "Cialdini, R.B. (2003). Crafting normative messages to protect the environment. Current Dir. in Psyc. Science, 12, 105--109.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. (1975). Beyond boredom and anxiety: The experience of play in work and games. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "De Young, R. (1993). Changing behavior and making it stick: the conceptualization and management of conservation behavior. Environment and Behavior, 25(3), 485--505.",
      "doi": ""
    },
    {
      "text": "Deci, E.L. (1971). Effects of externally mediated rewards on intrinsic motivation. J. of Pers. and Social Pysc. 18, 105--115.",
      "doi": ""
    },
    {
      "text": "Deci, E.L. (1975). Intrinsic motivation. New York.",
      "doi": ""
    },
    {
      "text": "Deci, E. L., Ryan, R.M. (1985). Intrinsic motivation and self-determination in human behavior. Plenum Press.",
      "doi": ""
    },
    {
      "text": "Deci, E.L., Betley, G., Kahle, J., Abrams, L., Porac, J. (1981). When trying to win: competition and intrinsic motivation. Per--sonality and Social Psyc. Bulletin, 7(1).",
      "doi": ""
    },
    {
      "text": "Deci, E.L., Ryan, R.M. (2000). Intrinsic and extrinsic motivations: classic definitions and new directions. Cont. Ed. Psyc., 25.",
      "doi": ""
    },
    {
      "text": "Festinger, L. (1957). A theory of cognitive dissonance. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Fishbein, M., Ajzen, I. (1975). Belief, Attitude, Intention and Behavior: An Introduction to Theory and Research. Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Folz, D.H. (1991). Recycling program design, management, and participation: A national survey of municipal experience. Public Admin. Review, 51(3), 222--231.",
      "doi": ""
    },
    {
      "text": "Fritzsche, D. J. (1995). Personal values: potential keys to ethical decision making. J. of Bus. Ethics, 14(11), 909--922.",
      "doi": ""
    },
    {
      "text": "Froehlich, J. (2009). Promoting energy efficient behaviors in the home through feedback: the role of Human-Computer Interaction. HCIC '09 Workshop.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Dillahunt, T., Klasnja, P., Mankoff, J., Consolvo, S., Harrison, B., Landay, J.A. (2009). Ubigreen: investigating a mobile tool for tracking and supporting green transportation habits. Proc. ACM CHI'09, 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Geller, E.S., Winett, R.A., Everett, P.B. (1982). Preserving the Environment: New Strategies for Behavior Change. Pergamon Press Inc.",
      "doi": ""
    },
    {
      "text": "Gollwitzer, P.M. (1999). Implementation intentions: strong effects of simple plans. American Psychologist, 54, 493--503.",
      "doi": ""
    },
    {
      "text": "Gollwitzer, P.M., Brandstatter, V. (1997). Implementation intentions and effective goal pursuit. J. of Personality and Social Psyc., 73, 186--199.",
      "doi": ""
    },
    {
      "text": "Gustafsson, A., Gyllensward, M. (2005). The power-aware cord: energy awareness through ambient information display. Proc. ACM CHI'05, 1423--1426.  ",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Hockenbury, D.H., Hockenbury, S.E. (2003). Psychology (3rd ed.). Worth Publishers.",
      "doi": ""
    },
    {
      "text": "Holmes, T. G. (2007). Eco-visualization: combining art and technology to reduce energy consumption. Proc. of C&C'07.  ",
      "doi": "10.1145/1254960.1254982"
    },
    {
      "text": "Huitt, W. (2001). Motivation to Learn: An Overview. In Ed. Psyc. Interactive, Valdosta State Uni. http://chiron.valdosta.edu/whuitt/col/motivation/motivate.html",
      "doi": ""
    },
    {
      "text": "Iyengar, S.S., Lepper, M.R.(1999). Rethinking the value of choice: a cultural perspective on intrinsic motivation. J. of Personality and Social Pysc., 76(3), 349--366.",
      "doi": ""
    },
    {
      "text": "Kaplan, S. (1990). Being needed, adaptive muddling and human-environment relationships. In R.I. Selby, K.H. Anthony, J. Choi, and B. Orland (Eds), Coming of age, p19--25. Environmental Design Research Assoc.",
      "doi": ""
    },
    {
      "text": "Littell J.H., Girvin, H. (2002). Stages of change: a critique. Behavior Modification, 26(2), 223--273.",
      "doi": ""
    },
    {
      "text": "Maslow, A. (1943). A theory of human motivation. Psyc. Review, 50, 370--396.",
      "doi": ""
    },
    {
      "text": "McCalley, L. T., Midden, C. J. H. (2002). Energy conservation through product-integrated feedback: the roles of goal-setting and social orientation. J. Economic Psyc, 23, 589--603.",
      "doi": ""
    },
    {
      "text": "McConnaughy, E.A., Prochaska, J.O., Velicer, W.F. (1983). Stages of change in psychotherapy: measurement and sample profiles. Psychotherapy: Theory, Research and Practice, 20.",
      "doi": ""
    },
    {
      "text": "Miller, W.R., Rollnick, S. (2002). Motivational Interviewing: Preparing People for Change (2nd Ed). Guilford Press.",
      "doi": ""
    },
    {
      "text": "Petty, R.E., Cacioppo, J.T., Strathman, A.J. (1994). To think or not to think: exploring two routes to persuasion. Persuasion: Psyc. Insights and Perspectives, T.C. Brock and M.C. Green (Eds), p.81--116, Sage Pub. Inc.",
      "doi": ""
    },
    {
      "text": "Pierce, J., Odom, W., Blevis, E. (2008). Energy aware dwelling: a critical survey of interaction design for eco-visualizations. Proc. Of OZCHI'08, 287, 1--8.  ",
      "doi": "10.1145/1517744.1517746"
    },
    {
      "text": "Prochaska, J.O., Velicer, W.F. (1997). The Transtheoretical Model of health behavior change. Am. J. of Health Promotion.",
      "doi": ""
    },
    {
      "text": "Reeve, J. (1989). The interest-enjoyment distinction in intrinsic motivation. Motivation and Emotion, 13, 83--104.",
      "doi": ""
    },
    {
      "text": "Rokeach, M. (1973). The Nature of Human Values. Free Press.",
      "doi": ""
    },
    {
      "text": "Rotter, J.B. (1966). Generalized expectancies for internal versus external control of reinforcement. Pysc. Monograph: General and Applied, 80, 1--28.",
      "doi": ""
    },
    {
      "text": "Seligman, M. (1975). Helplessness: On depression, development and death. W.H. Freeman.",
      "doi": ""
    },
    {
      "text": "Shipworth, M. (2002) Motivating Home Energy Action: A Handbook of What Works. Australian Greenhouse Office. http://www.environment.gov.au/settlements/local/publications/pubs/motivating.pdf",
      "doi": ""
    },
    {
      "text": "Thibodeau, R., Aronson, E. (1992). Taking a closer look: reasserting the role of the self-concept in dissonance theory. Personality and Social Psyc. Bulletin, 18, 591--602.",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Hasbrouck, J., Augustin, S. (2008). A bright green perspective on sustainable choices. Proc. ACM CHI'08.  ",
      "doi": "10.1145/1357054.1357109"
    },
    {
      "text": "Wright, P.M., Kacmar, K.M. (1994). Goal specificity as a determinant of goal commitment and goal change. Organizational Behavior and Human Decision Processes, 59.",
      "doi": ""
    },
    {
      "text": "Yates, S.M., Aronson, E. (1983). A social psychological perspective on energy conservation in residential buildings. APA.",
      "doi": ""
    }
  ]
}