{
  "doi": "10.1145/1753326.1753486",
  "title": "Microblogging during two natural hazards events: what twitter may contribute to situational awareness",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1079-1088",
  "year": 2010,
  "badges": [],
  "abstract": "We analyze microblog posts generated during two recent, concurrent emergency events in North America via Twitter, a popular microblogging service. We focus on communications broadcast by people who were \"on the ground\" during the Oklahoma Grassfires of April 2009 and the Red River Floods that occurred in March and April 2009, and identify information that may contribute to enhancing situational awareness (SA). This work aims to inform next steps for extracting useful, relevant information during emergencies using information extraction (IE) techniques.",
  "authors": [
    {
      "name": "Sarah Vieweg",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384596988",
      "orcid": "missing"
    },
    {
      "name": "Amanda L. Hughes",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81413602846/rel-imgonly/81413602846.jpg",
      "acmid": "81413602846",
      "orcid": "missing"
    },
    {
      "name": "Kate Starbird",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456637076",
      "orcid": "missing"
    },
    {
      "name": "Leysia Palen",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Crews Fight Flare-Ups As Victims Assess Damage. April 11, 2009. KOCO Oklahoma City.",
      "doi": ""
    },
    {
      "text": "Dynes, R.R. Organized Behavior in Disaster. Lexington, MA: Heath, 1970.",
      "doi": ""
    },
    {
      "text": "Ellison, N., C. Steinfield, and C. Lampe. The Benefits of Facebook 'Friends': Exploring the Relationship Between College Students' Use of Conline Social Networks and Social Capital. Computer-Mediated Communication 12, 4 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Endsley, M.R. Toward a Theory of Situation Awareness in Dymanic Systems. Human Factors 37, 1 (1995), 32--64.",
      "doi": ""
    },
    {
      "text": "Endsley, M.R., Theoretical Underpinnings of Situation Awareness: A Critical Review, in Situation Awareness Analysis and Measurement, M.R.D.J.G. Endsley, Editor. 2000, Lawrence Erlbaum Associates: Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Event Summary for the Wildfire Outbreak of April 9th, 2009. http://www.srh.noaa.gov/oun/wxevents/20090409/.",
      "doi": ""
    },
    {
      "text": "Forecaster: Red River Flood Crest May Top 30 Feet in Fargo. Feb 24, 2009. USA Today.",
      "doi": ""
    },
    {
      "text": "Huberman, B.A., D.M. Romero, and F. Wu, Social Networks that Matter: Twitter Under the Microscope. 2008.",
      "doi": ""
    },
    {
      "text": "Hughes, A., L. Palen, J. Sutton, S. Liu, and S. Vieweg, \"Site-Seeing\" in Disaster: An Examination of On-Line Social Convergence, in 2008 ISCRAM Conference. 2008: Washington, DC.",
      "doi": ""
    },
    {
      "text": "Hughes, A.L. and L. Palen. Twitter Adoption and Use in Mass Convergence and Emergency Events. In Proc. ISCRAM 2009.",
      "doi": ""
    },
    {
      "text": "Java, A., X. Song, T. Finin, and B. Tseng. Why We Twitter: Understanding Microblogging Usage and Communities. In Proc. Knowledge Discovery and Data Mining (KDD), 56--65.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Joinson, A.N. 'Looking At', 'Looking Up' or 'Keeping Up With' People? Motives and Uses of Facebook. In Proc. CHI 2008, ACM Press, 1027--1036.  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Kalashnikov, D.V., Y. Ma, S. Mehrotra, R. Hariharan & C. Butts. Modeling and Querying Uncertain Spatial Information for Situational Awareness Applications. In Proc. ACM-GIS, ACM Press, 131--138.  ",
      "doi": "10.1145/1183471.1183494"
    },
    {
      "text": "Kendra, J.M.T.W. Reconsidering Convergence and Converger Legitimacy in Response to the World Trade Center Disaster. Research in Social Problems and Public Policty 11, (2003), 97--122.",
      "doi": ""
    },
    {
      "text": "Krishnamurthy, B., P. Gill, and M. Arlitt. A Few Chirps About Twitter. In Proc. First Workshop on Online Social Networks, ACM Press, 19--24.  ",
      "doi": "10.1145/1397735.1397741"
    },
    {
      "text": "Lampe, C., N. Ellison, and C. Steinfield. A Face(book) in the Crowd: Social Searching vs. Social Browsing. In Proc. CSCW 2006, ACM Press, 167--170.  ",
      "doi": "10.1145/1180875.1180901"
    },
    {
      "text": "Liu, S., L. Palen, J. Sutton, A. Hughes, and S. Vieweg, In Search of the Bigger Picture: The Emergent Role of On-Line Photo Sharing in Times of Disaster, in 2008 ISCRAM Conference. 2008: Washington, DC.",
      "doi": ""
    },
    {
      "text": "McNutt, M. Federal Help Sought for Oklahoma Wildfire Victims. April 23, 2009. NewsOK. http://newsok.com/federal-help-sought-for-oklahoma-wildfire-victims/article/3363783.",
      "doi": ""
    },
    {
      "text": "Nam, K.K., M.S. Ackerman & L.A. Adamic. Questions in, Knowledge in?: A Study of Naver's Question Answering Community In Proc. CHI 2009, ACM Press, 779--788.  ",
      "doi": "10.1145/1518701.1518821"
    },
    {
      "text": "NOAA Forecasters: Red River Will Crest Again in Fargo-Moorhead in Late April. Apr 3, 2009. NOAA.",
      "doi": ""
    },
    {
      "text": "Palen, L., K. Anderson, G. Mark, J. Martin, D. Sicker, & D. Grunwald. A Vision for Technology-Mediated Public Participation and Assistance in Mass Emergencies and Disasters, University of Colorado manuscript. 2010.",
      "doi": ""
    },
    {
      "text": "Palen, L. and S. Vieweg. The Emergence of Online Widescale Interaction in Unexpected Events: Assistance, Alliance & Retreat. In Proc. CSCW 2008, ACM Press, 117--126.  ",
      "doi": "10.1145/1460563.1460583"
    },
    {
      "text": "23. Palen, L., S. Vieweg, S. Liu, and A.L. Hughes. Crisis in a Networked World: Features of Computer-Mediated Communication in the April 16, 2007 Virginia Tech Event. Social Science Computer Review Special Issue on E--Social Science (2009).  ",
      "doi": "10.1177/0894439309332302"
    },
    {
      "text": "Qu, Y., P.F. Wu, and X. Wang. Online Community Response to Major Disaster: A Study of Tianya Forum in the 2008 Sichuan Earthquake. In Proc. Hawaii International Conference on System Sciences 2009.  ",
      "doi": "10.1109/HICSS.2009.330"
    },
    {
      "text": "Reilly, W.S.N., S.L. Guarino, and B. Kellihan. Model-based Measurement of Situation Awareness. In Proc. Winter Simulation Conference 2007, IEEE Press, 1353--1360. ",
      "doi": "10.5555/1351542.1351781"
    },
    {
      "text": "Sacks, H., E.M. Schegloff, and G. Jefferson. A Simplest Systematics for the Organization of Turn-Taking for Conversation Author(s). Language 50, 4 (1974), 696--735.",
      "doi": ""
    },
    {
      "text": "Salmon, P.M., G.H. Walker, D. Ladva, N.A. Stanton, D.P. Jenkins, and L. Rafferty. Measuring Situation Awareness in Command and Control: Comparison of Methods Study. In Proc. ECCE Conference, 28--31.  ",
      "doi": "10.1145/1362550.1362559"
    },
    {
      "text": "Sarter, N.B. and D.D. Woods. Situation Awareness: A Critical but Ill-Defined Phenomenon. The International Journal of Aviation Psychology 1, 1 (1991), 45--57.",
      "doi": ""
    },
    {
      "text": "Schwert, D.P. A Geologist's Persepective on the Red River of the North: History, Geography, and Planning/Management Issues. In Proc. Int'l Water Conference 2003.",
      "doi": ""
    },
    {
      "text": "Shklovski, I., L. Palen, and J. Sutton. Finding Community Through Information and Communication Technology in Disaster Events. In Proc. CSCW 2008, ACM Press, 127--136.  ",
      "doi": "10.1145/1460563.1460584"
    },
    {
      "text": "Skerritt, J. and B. Redekop. Manitoba Coping with Third-worst Flood of Century. Apr 14, 2009. Winnipeg Free Press.",
      "doi": ""
    },
    {
      "text": "Sonnenwald, D.H. and L.G. Pierce. Information behavior in dynamic group work contexts: interwoven situational awareness, dense social networks and contested collaboration in command and control. Information Processing and Management 36, (2000), 461--479.  ",
      "doi": "10.1016/S0306-4573%2899%2900039-4"
    },
    {
      "text": "Starbird, C. E-Data Visualization for Qualitative Research. Interactive Poster Presented at CSCW 2008.",
      "doi": ""
    },
    {
      "text": "Starbird, K., L. Palen, A.L. Hughes, and S. Vieweg. Chatter on the Red: What Hazards Threat Reveals about the Social Life of Microblogged Information. In Proc. CSCW 2010, ACM Press.  ",
      "doi": "10.1145/1718918.1718965"
    },
    {
      "text": "Sutton, J., L. Palen, and I. Shklovski. Backchannels on the Front Lines: Emergent Use of Social Media in the 2007 Southern California Fires. In Proc. ISCRAM 2008.",
      "doi": ""
    },
    {
      "text": "USGS Water Data for Red River at Fargo, ND. http://waterdata.usgs.gov/nd/nwis/uv/%3fsite_no=?station=05054000.",
      "doi": ""
    },
    {
      "text": "Vieweg, S., L. Palen, S. Liu, A. Hughes, and J. Sutton, Collective Intelligence in Disaster: Examination of the Phenomenon in the Aftermath of the 2007 Virginia Tech Shooting. In Proc. ISCRAM 2008.",
      "doi": ""
    }
  ]
}