{
  "doi": "10.1145/1753326.1753434",
  "title": "Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "733-742",
  "year": 2010,
  "badges": [
    "Best Paper"
  ],
  "abstract": "In this paper we present the results of a field study of Avaaj Otalo (literally, \"voice stoop\"), an interactive voice application for small-scale farmers in Gujarat, India. Through usage data and interviews, we describe how 51 farmers used the system over a seven month pilot deployment. The most popular feature of Avaaj Otalo was a forum for asking questions and browsing others' questions and responses on a range of agricultural topics. The forum developed into a lively social space with the emergence of norms, persistent moderation, and a desire for both structured interaction with institutionally sanctioned authorities and open discussion with peers. For all 51 users this was the first experience participating in an online community of any sort. In terms of usability, simple menu-based navigation was readily learned, with users preferring numeric input over speech. We conclude by discussing implications of our findings for designing voice-based social media serving rural communities in India and elsewhere.",
  "tags": [
    "ictd",
    "voice user interface",
    "india",
    "voice forum",
    "ivr"
  ],
  "authors": [
    {
      "name": "Neil Patel",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81330496706",
      "orcid": "missing"
    },
    {
      "name": "Deepti Chittamuru",
      "institution": "UC Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655471",
      "orcid": "missing"
    },
    {
      "name": "Anupam Jain",
      "institution": "IBM India Research Laboratory, New Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460644410",
      "orcid": "missing"
    },
    {
      "name": "Paresh Dave",
      "institution": "Development Support Center, Ahmedabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416594841",
      "orcid": "missing"
    },
    {
      "name": "Tapan S. Parikh",
      "institution": "UC Berkeley, Berkeley, CA, India",
      "img": "/do/10.1145/contrib-81100298867/rel-imgonly/tapan_parikh_lg_1.jpg",
      "acmid": "81100298867",
      "orcid": "0000-0003-2634-6395"
    }
  ],
  "references": [
    {
      "text": "M.S. Ackerman, B. Starr, D. Hindus, and S.D. Mainwaring. Hanging on the 'wire: a field study of an audio-only media space. ACM Trans. Comput.-Hum. Interact., 4(1):39--66, 1997.  ",
      "doi": "10.1145/244754.244756"
    },
    {
      "text": "S. Agarwal, A. Kumar, A. Nanavati, and N. Rajput. Content creation and dissemination by-and-for users in rural areas. In Proc. IEEE/ACM Int'l Conference on Information and Communication Technologies and Development, April 2009. ",
      "doi": "10.5555/1812530.1812537"
    },
    {
      "text": "R. Birner and J.R. Anderson. How to make agricultural extension demand-driven? Technical report, International Food Policy Research Insititute, November 2007.",
      "doi": ""
    },
    {
      "text": "R. Cervantes and N. Sambasivan. VoiceList: user-driven telephone-based audio content. In MobileHCI '08: Proceedings of the 10th international conference on Human computer interaction with mobile devices and services, pages 499--500, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1409240.1409328"
    },
    {
      "text": "P. Dourish, A. Adler, V. Bellotti, and A. Henderson. Your place or mine? Learning from long-term use of audio-video communication. Comput. Supported Coop. Work, 5(1):33--62, 1996. ",
      "doi": "10.1007/BF00141935"
    },
    {
      "text": "M. Gakuru, K. Winters, and F. Stepman. Inventory of innovative farmer advisory services using ICTs. Technical report, The Forum for Agricultural Research in Africa, 2009.",
      "doi": ""
    },
    {
      "text": "R.J. Honicky, O. Bakr, M. Demmer, and E. Brewer. A message oriented phone system for low cost connectivity. In Hot Topics in Networking 2007 (HOTNETS), 2007.",
      "doi": ""
    },
    {
      "text": "J.S. Kim. TattleTrail: An archiving voice chat system for mobile users over Internet protocol. Master's thesis, MIT, June 2002.",
      "doi": ""
    },
    {
      "text": "P. Kotkar, W. Thies, and S. Amarasinghe. An audio wiki for publishing user-generated content in the developing world. In HCI for Community and International Development (Workshop at CHI 2008), Florence, Italy, Apr 2008.",
      "doi": ""
    },
    {
      "text": "A. Kumar, N. Rajput, D. Chakraborty, S. Agarwal, and A. Nanavati. WWTW: The World Wide Telecom Web. In SIGCOMM Workshop on Networked Systems for Developing Regions, Kyoto, Japan, August 2007.  ",
      "doi": "10.1145/1326571.1326582"
    },
    {
      "text": "Lifelines. http://www.lifelines-india.net.",
      "doi": ""
    },
    {
      "text": "I. Medhi, S.N. Gautama, and K. Toyama. A comparison of mobile money-transfer uis for non-literate and semi-literate users. In CHI '09: Proceedings of the 27th international conference on Human factors in computing systems, pages 1741--1750, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1518701.1518970"
    },
    {
      "text": "T.S. Parikh, K. Ghosh, and A. Chavan. Design studies for a financial management system for micro-credit groups in rural India. In CUU '03: Proceedings of the 2003 conference on Universal usability, pages 15--22, New York, NY, USA, 2003. ACM Press.  ",
      "doi": "10.1145/957205.957209"
    },
    {
      "text": "N. Patel, S. Agarwal, N. Rajput, A. Nanavati, P. Dave, and T.S. Parikh. A comparative study of speech and dialed input voice interfaces in rural India. In CHI '09: Proceedings of the 27th international conference on Human factors in computing systems, pages 51--54, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1518701.1518709"
    },
    {
      "text": "M. Plauch-e and U. Nallasamy. Speech interfaces for equitable access to information technology. Inf. Technol. Int. Dev., 4(1):69--86, 2007.  ",
      "doi": "10.1162/itid.2007.4.1.69"
    },
    {
      "text": "M. Plauch-e, U. Nallasamy, J. Pal, C. Wooters, and D. Ramachandran. Speech recognition for illiterate access to information and technology. In Proc. IEEE/ACM Int'l Conference on Information and Communication Technologies and Development, May 2006.",
      "doi": ""
    },
    {
      "text": "P. Resnick. Phone-based CSCW: tools and trials. ACM Trans. Inf. Syst., 11(4):401--424, 1993.  ",
      "doi": "10.1145/159764.159760"
    },
    {
      "text": "P. Resnick. The Boston peace and justice event hotline: a phone-based community bulletin board. In CHI '94: Proceedings of the 12th international conference on Human factors in computing systems, New York, NY, USA, 1994. ACM.  ",
      "doi": "10.1145/259963.260183"
    },
    {
      "text": "C. Schmandt and B. Arons. A conversational telephone messaging system. Consumer Electronics, IEEE Transactions on, CE-30(3):xxi--xxiv, Aug. 1984.",
      "doi": ""
    },
    {
      "text": "A. Sharma, M. Plauch-e, E. Barnard, and C. Kuun. HIV health information access using spoken dialogue systems: Touchtone vs. speech. In Proc. IEEE/ACM Int'l Conference on Information and Communication Technologies and Development, April 2009. ",
      "doi": "10.5555/1812530.1812541"
    },
    {
      "text": "J. Sherwani, N. Ali, S. Mirza, A. Fatma, Y. Memon, M. Karim, R. Tongia, and R. Rosenfeld. Healthline: Speech-based access to health information by low-literate users. In Proc. IEEE/ACM Int'l Conference on Information and Communication Technologies and Development, December 2007.",
      "doi": ""
    },
    {
      "text": "J. Sherwani, S. Palijo, S. Mirza, T. Ahmed, N. Ali, and R. Rosenfeld. Speech vs. touch-tone: Telephony interfaces for information access by low literate users. In Proc. IEEE/ACM Int'l Conference on Information and Communication Technologies and Development, April 2009. ",
      "doi": "10.5555/1812530.1812575"
    },
    {
      "text": "R. Sulaiman V. Innovations in agricultural extension in india. Technical report, Food and Agriculture Organization of the United Nations, 2003.",
      "doi": ""
    },
    {
      "text": "A. Zinman. RadioActive: Enabling large-scale asynchronous audio discussions on mobile devices. Master's thesis, MIT, August 2006.",
      "doi": ""
    }
  ]
}