{
  "doi": "10.1145/1753326.1753330",
  "title": "SHRIMP: solving collision and out of vocabulary problems in mobile predictive input with motion gesture",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "15-24",
  "year": 2010,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Dictionary-based disambiguation (DBD) is a very popular solution for text entry on mobile phone keypads but suffers from two problems: 1. the resolution of encoding collision (two or more words sharing the same numeric key sequence) and 2. entering out-of-vocabulary (OOV) words. In this paper, we present SHRIMP, a system and method that addresses these two problems by integrating DBD with camera based motion sensing that enables the user to express preference through a tilting or movement gesture. SHRIMP (Small Handheld Rapid Input with Motion and Prediction) runs on camera phones equipped with a standard 12-key keypad. SHRIMP maintains the speed advantage of DBD driven predictive text input while enabling the user to overcome DBD collision and OOV problems seamlessly without even a mode switch. An initial empirical study demonstrates that SHRIMP can be learned very quickly, performed immediately faster than MultiTap and handled OOV words more efficiently than DBD.",
  "authors": [
    {
      "name": "Jingtao Wang",
      "institution": "UC Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81490672860/rel-imgonly/jingtaow_full.jpg",
      "acmid": "81490672860",
      "orcid": "missing"
    },
    {
      "name": "Shumin Zhai",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    },
    {
      "name": "John Canny",
      "institution": "UC Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415489",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aho, A., Sethi, R., Ullman, J., Compilers: Principles, Techniques, and Tools, Addison Wesley Publishing, ISBN 0201100886. ",
      "doi": "10.5555/6448"
    },
    {
      "text": "Dunlop, M., and Crossan, A. Predictive Text Entry Methods for Mobile Phones. Personal Technologies, 2000.",
      "doi": ""
    },
    {
      "text": "Dunlop, M., Taylor, F., Tactile Feedback for Predictive Text Entry, In Proc. of CHI 2009.  ",
      "doi": "10.1145/1518701.1519046"
    },
    {
      "text": "Gong, J., Tarasewich, P., Alphabetically Constrained Keypad Designs for Text Entry on Mobile Devices, In Proc. of CHI 2005.  ",
      "doi": "10.1145/1054972.1055002"
    },
    {
      "text": "Grover, D.L., King, M.T., and Kushler, C. A. Patent No. US5818437, Reduced keyboard Disambiguating Computer. Tegic Communications, Inc., Seattle (1998).",
      "doi": ""
    },
    {
      "text": "How, J., Kan, M.Y., Optimizing Predictive text entry for short message service on mobile phones. In Proc. of HCII 2005.",
      "doi": ""
    },
    {
      "text": "Ingmarsson, M., Dinka, D., Zhai, S., TNT: a Numeric Keypad based Text Input Method. In Proc of CHI 2004.  ",
      "doi": "10.1145/985692.985773"
    },
    {
      "text": "International Telecommunication Union, Arrangement of Digits, Letters and Symbols on Telephones and Other Devices that can be used for gaining access to a Telephone Network, ITU Recommendation E.161. 1993.",
      "doi": ""
    },
    {
      "text": "International Telecommunication Union: Worldwide mobile cellular subscribers to reach 4 billion mark late 2008 http://www.itu.int/newsroom/press_releases/2008/29.html",
      "doi": ""
    },
    {
      "text": "James, C.L. and Reischel, K.M., Text input for mobile devices: Comparing model prediction to actual performance. In Proc. of CHI 2001.  ",
      "doi": "10.1145/365024.365300"
    },
    {
      "text": "Jansen, B., Zhang, M., el al., Twitter power: Tweets as electronic word of mouth, Journal of the American Society for Information Science and Technology, 2009.  ",
      "doi": "10.5555/1656289.1656297"
    },
    {
      "text": "Jelinek, F., Statistical methods for speech recognition, MIT Press, Cambridge, MA, 1998 ",
      "doi": "10.5555/280484"
    },
    {
      "text": "Kucera, H. and Francis, W. N. Computational Analysis of Present-Day American English. Providence, Rhode Island: Brown University Press, 1967.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., Kober, H., et al., E. LetterWise: Prefix-based disambiguation for mobile text input. In Proc. of UIST 2001  ",
      "doi": "10.1145/502348.502365"
    },
    {
      "text": "Mayzner, M.S., and Tresselt, M.E. Table of single-letter and digram frequency counts for various word-length and letter-position combinations, Psychonomic Monograph Supplements 1 (1965), 13--32.",
      "doi": ""
    },
    {
      "text": "Rau, H., Skiena, S., Dialing for Documents: an Experiment in Information Theory, UIST 1994.  ",
      "doi": "10.1145/192426.192488"
    },
    {
      "text": "Silfverberg, M., MacKenzie, I.S., Korhonen, P. Predicting Text Entry Speed on Mobile Phones, In Proc. of CHI 2000.  ",
      "doi": "10.1145/332040.332044"
    },
    {
      "text": "Smith, S., Goodwin, N., Alphabetic Data Entry Via the Touch-Tone Pad: A Comment, HUMAN FACTORS, The Mitre Corporation, 1971, 13(2) P.p 189--190.",
      "doi": ""
    },
    {
      "text": "Wigdor, D., Balakrishnan, R., A Comparison of Consecutive and Concurrent Input Text Entry Techniques for Mobile Phones, in Proc. of CHI 2004.  ",
      "doi": "10.1145/985692.985703"
    },
    {
      "text": "Wigdor, D., Balakrishnan, R., TiltText: Using Tilt for Text Input to Mobile Phones. In Proc. of UIST 2003.  ",
      "doi": "10.1145/964696.964705"
    },
    {
      "text": "Wang, J, Zhai, S., Canny, J., Camera Phone Based Motion Sensing : Interaction Techniques, Applications and Performance Study. In Proc. of UIST 2006.  ",
      "doi": "10.1145/1166253.1166270"
    },
    {
      "text": "Why Book Means Cool http://www.languagehat.com/archives/002415.php",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O. and Myers, B.A. Analyzing the input stream for Character-level Errors in Unconstrained Text Entry Evaluations. In Proc of ACM ToCHI vol. 13 (4), 2006.  ",
      "doi": "10.1145/1188816.1188819"
    },
    {
      "text": "Wobbrock, J.O., Myers, B.A. and Chau, D.H. In-stroke Word Completion. In Proc. of UIST 2006.  ",
      "doi": "10.1145/1166253.1166305"
    },
    {
      "text": "Wobbrock, J.O., Chau, D.H. and Myers, B.A. An Alternative to Push, Press, and Tap-tap-tap: Gesturing on an Isometric Joystick for Mobile Phone Text Entry. In Proc. of CHI 2007.  ",
      "doi": "10.1145/1240624.1240728"
    },
    {
      "text": "Zhai, S., Hunter, M., Smith, B., The Metropolis Keyboard -- an Exploration of Quantitative Techniques for Virtual Keyboard Design, In Proc. of UIST 2001.  ",
      "doi": "10.1145/354401.354424"
    },
    {
      "text": "Zhai, S. and Kristensson, P. Shorthand Writing on Stylus Keyboard. In Proc. of CHI 2003.  ",
      "doi": "10.1145/642611.642630"
    }
  ]
}