{
  "doi": "10.1145/1753326.1753406",
  "title": "Managing nomadic knowledge: a case study of the European social forum",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "537-546",
  "year": 2010,
  "badges": [],
  "abstract": "In this paper we portray a specific type of knowledge which we term 'nomadic knowledge'. It is required periodically by different actors and travels along foreseeable paths between groups or communities of actors. This type of knowledge lets us question generally held assumptions about the way knowledge is enacted. We illustrate our point with an ethnographical field study analyzing the European Social Forum (ESF), a network of political activist organizations. In this network different actors organize a periodic (biannual) event in which some 13,000 activists participated in 2008. We investigate how knowledge about organizing and managing the ESF is transferred between two events respectively, the actors and communities involved. Our study highlights the specific challenges in sharing nomadic knowledge and the consequences of deficiencies on the organizing process. The paper contributes to a better understanding of knowledge sharing practices and opens new directions for technical support.",
  "authors": [
    {
      "name": "Saqib Saeed",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-81436593008/rel-imgonly/1.jpg",
      "acmid": "81436593008",
      "orcid": "missing"
    },
    {
      "name": "Volkmar Pipek",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100222454",
      "orcid": "missing"
    },
    {
      "name": "Markus Rohde",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-81100112472/rel-imgonly/rohde_foto.jpg",
      "acmid": "81100112472",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. S. Augmenting Organizational Memory: A Field Study of Answer Garden. ACM Transactions on Information Systems, 16, 3 (1998), 203--224.  ",
      "doi": "10.1145/290159.290160"
    },
    {
      "text": "Ackerman, M. S. and Halverson, C. Considering an Organization's Memory In Proc. CSCW 1998, ACM Press (1998), 39--48.  ",
      "doi": "10.1145/289444.289461"
    },
    {
      "text": "Bechky, B. Gaffers, Gofers, and Grips: Role-Based Coordination in Temporary Organizations. Organization Science, 17, 1 (2006), 3--21.  ",
      "doi": "10.1287/orsc.1050.0149"
    },
    {
      "text": "Bennett, W.L. Communicating global activism: strengths and vulnerabilities of networked politics. In Van de Donk, et al. (Ed.) Cyber protest -- New Media, citizens and social movements, Routledge (2004), 123--146. ",
      "doi": "10.5555/995038"
    },
    {
      "text": "Bieber, M., Engelbart, D.,Furuta, R., Hiltz, S.R., Noll, J., Preece, J., Stohr, E. A., Turoff, M. and Van de Walle, B. Toward virtual community knowledge evolution. Journal of Management Information Systems, 18 (2002), 11--35. ",
      "doi": "10.1080/07421222.2002.11045707"
    },
    {
      "text": "Cijvat, E., Danielson, J. and Brusewitz, E. Report Post-ESF 2008 Economy March 2009.",
      "doi": ""
    },
    {
      "text": "Davenport, T. H. and Prusak, L. Working Knowledge: How Organizations Manage What They Know. Harvard Business School Press, Boston, MA, USA, 1998. ",
      "doi": "10.5555/601533"
    },
    {
      "text": "Fagrell, H. and F. Ljungberg A Field Study of News Journalism: Implications for Knowledge Management Systems In Proc. PDC 2000, CPSR (2000).",
      "doi": ""
    },
    {
      "text": "Fagrell, H., S. Kristoffersen and F. Ljungberg Exploring Support for Knowledge Management in Mobile Work, In Proc. ECSCW 1999, Springer (1999), 259--275. ",
      "doi": "10.5555/351689.351704"
    },
    {
      "text": "Farooq, U. Conceptual and Technical Scaffolds for End User Development: Using scenarios and wikis in community computing. In Proc.VL/HCC 2005, IEEE Press (2005), 329--330.  ",
      "doi": "10.1109/VLHCC.2005.28"
    },
    {
      "text": "Farooq, U., Merkel, C., B., Nash, H., Rosson, M., B., Carroll, J., M., and Xiao, L. Participatory Design as Apprenticeship: Sustainable Watershed Management as a Community Computing Application. In Proc. HICSS 2005, IEEE Computer Society (2005), Vol. 17, 178c.  ",
      "doi": "10.1109/HICSS.2005.485"
    },
    {
      "text": "Fitzpatrick, G. Bootstrapping Expertise Sharing, In Ackerman, M., Pipek, V. and Wulf, V. (ed.), Sharing Expertise: Beyond Knowledge Management, MIT Press (2002), 81--110. ",
      "doi": "10.5555/572524"
    },
    {
      "text": "http://openesf.net",
      "doi": ""
    },
    {
      "text": "http://www.fse-esf.org",
      "doi": ""
    },
    {
      "text": "Hutchins, E. Cognition in the Wild. MIT Press, Cambridge MA, 1995.",
      "doi": ""
    },
    {
      "text": "Huysman, M. and Wulf, V. IT to Support Knowledge Sharing in Communities: Towards a Social Capital Analysis, In Journal on Information Technology (JIT), 21, 1(2006), 40 --51.",
      "doi": ""
    },
    {
      "text": "Imbach, Pauline An interview with IIRE Fellow Eric Toussaint http://www.iire.org/content/view/161/",
      "doi": ""
    },
    {
      "text": "Kavada, A. The 'alter-globalization movement' and the Internet: A case study of communication networks and collective action. Paper presented at the Cortona Colloquium 2006, Italy.",
      "doi": ""
    },
    {
      "text": "Klein, R. R., Letaief, R., Carter, S., Chabert, G., Lasonen, J. and Lubart, T. CSCL for NGO's cross cultural virtual teams in Africa: an Ethiopian children advocacy case study against exclusion and toward facilitation of expression, innovation and creativity In Proc. ICALT 2005, IEEE Press (2005), 1037--1041.  ",
      "doi": "10.1109/ICALT.2005.97"
    },
    {
      "text": "Lutters, W. G. and Ackerman, M. S. Achieving Safety: A Field Study of Boundary Objects in Aircraft Technical Support. In Proc. CSCW 2002, ACM Press (2002), 266--275.  ",
      "doi": "10.1145/587078.587116"
    },
    {
      "text": "McDonald D. W. and Ackerman, M. S. Just Talk to Me: A Field Study of Expertise Location In Proc. CSCW 1998, ACM Press (1998), 315--324.  ",
      "doi": "10.1145/289444.289506"
    },
    {
      "text": "Merkel, C., B., Xiao, L., Farooq, U., Ganoe, C., H., Lee, R., Carroll, J., M., and Rosson, M., B. Participatory Design in Community Computing Contexts: Tales from the Field. In Proc. PDC 2004 ACM Press (2004), 1--10.  ",
      "doi": "10.1145/1011870.1011872"
    },
    {
      "text": "Pipek, V., Hinrichs, J. and Wulf, V. Sharing Expertise: Challenges for Technical Support In Ackerman, M./Pipek, V./Wulf, V. (ed): Sharing Expertise: Beyond Knowledge Management, MIT-Press (2003), 111 -- 136.",
      "doi": ""
    },
    {
      "text": "Pipek V. and Wulf, V. Pruning the answer garden: knowledge sharing in maintenance engineering In Proc. ECSCW 2003, Kluwer Publishers (2003), 1--20. ",
      "doi": "10.5555/1241889.1241890"
    },
    {
      "text": "Reichling, T. and Wulf, V. Expert Recommender System in Practice: Evaluating semiautomatic profile generation. In: Proc .CHI 2009, ACM-Press (2009), 59 -- 68.  ",
      "doi": "10.1145/1518701.1518712"
    },
    {
      "text": "Reichling, T., and Veith, M. Expertise sharing in a heterogeneous organizational environment, In Proc. ECSCW 2005, Springer (2005), 325--345. ",
      "doi": "10.5555/1242029.1242046"
    },
    {
      "text": "Rohde, M. Find what binds. Building Social Capital in an Iranian NGO Community System. In Huysman, M., Wulf, V. (ed.): Social Capital and Information Technology, MIT Press (2004), 75--112. ",
      "doi": "10.5555/1036237"
    },
    {
      "text": "Saeed, S., Rohde, M. and Wulf, V. Technologies within Transnational social activist communities: An Ethnographic Study of the European Social Forum: In Proc. C&T 2009 ACM Press (2009), 85--94.  ",
      "doi": "10.1145/1556460.1556474"
    },
    {
      "text": "Saeed, S. and Rohde, M. Computer Enabled Social Movements? Usage of a collaborative web platform within the European Social Forum In Proc. COOP 2010 Springer (2010).",
      "doi": ""
    }
  ]
}