{
  "doi": "10.1145/1753326.1753470",
  "title": "Enhancing directed content sharing on the web",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "971-980",
  "year": 2010,
  "badges": [],
  "abstract": "To find interesting, personally relevant web content, people rely on friends and colleagues to pass links along as they encounter them. In this paper, we study and augment link-sharing via e-mail, the most popular means of sharing web content today. Armed with survey data indicating that active sharers of novel web content are often those that actively seek it out, we developed FeedMe, a plug-in for Google Reader that makes directed sharing of content a more salient part of the user experience. FeedMe recommends friends who may be interested in seeing content that the user is viewing, provides information on what the recipient has seen and how many emails they have received recently, and gives recipients the opportunity to provide lightweight feedback when they appreciate shared content. FeedMe introduces a novel design space within mixed-initiative social recommenders: friends who know the user voluntarily vet the material on the user's behalf. We performed a two-week field experiment (N=60) and found that FeedMe made it easier and more enjoyable to share content that recipients appreciated and would not have found otherwise.",
  "authors": [
    {
      "name": "Michael S. Bernstein",
      "institution": "MIT CSAIL, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    },
    {
      "name": "Adam Marcus",
      "institution": "MIT CSAIL, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342503657",
      "orcid": "missing"
    },
    {
      "name": "David R. Karger",
      "institution": "MIT CSAIL, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100337812/rel-imgonly/square-photo-2.0569-17-centered.jpg",
      "acmid": "81100337812",
      "orcid": "missing"
    },
    {
      "name": "Robert C. Miller",
      "institution": "MIT CSAIL, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100162232",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M., Starr, B., and Pazzani, M. The do-i-care agent: Effective social discovery and filtering on the web. Proc. RIAO '97, (1997), 17--31.",
      "doi": ""
    },
    {
      "text": "Allen, T. Managing the Flow of Technology. MIT Press, Cambridge, MA, 1977.",
      "doi": ""
    },
    {
      "text": "Baumer, E. and Fisher, D. Smarter Blogroll: An Exploration of Social Topic Extraction for Manageable Blogrolls. Proc. HICSS '08, IEEE (2008), 155.  ",
      "doi": "10.1109/HICSS.2008.398"
    },
    {
      "text": "Baumer, E., Sueyoshi, M., and Tomlinson, B. Exploring the role of the reader in the activity of blogging. Proc. CHI '08, ACM Press (2008), 1111--1120.  ",
      "doi": "10.1145/1357054.1357228"
    },
    {
      "text": "Bernstein, M., Tan, D., Smith, G., et al. Collabio: A Game for Annotating People within Social Networks. Proc. UIST '09, ACM Press (2009), 177--180.  ",
      "doi": "10.1145/1622176.1622195"
    },
    {
      "text": "Burke, M., Marlow, C., and Lento, T. Feed me: motivating newcomer contribution in social network sites. Proc. CHI '09, ACM Press (2009), 945--954.  ",
      "doi": "10.1145/1518701.1518847"
    },
    {
      "text": "Dennis, B. and Jarrett, A. NusEye: Visualizing Network Structure to Support Navigation of Aggregated Content. Proc. HICCS '05, IEEE Press (2005), 107c.  ",
      "doi": "10.1109/HICSS.2005.459"
    },
    {
      "text": "Ehrlich, K. and Cash, D. Turning Information into Knowledge: Information Finding as a Collaborative Activity. Proc. JCDL '94, (1994).",
      "doi": ""
    },
    {
      "text": "Ellison, N.B., Steinfield, C., and Lampe, C. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. JCMC 12, 4 (2007).",
      "doi": ""
    },
    {
      "text": "Erdelez, S. and Rioux, K. Sharing information encountered for others on the Web. The New Review of Information Behaviour Research 1, (2000), 219--233. ",
      "doi": "10.5555/568022.568036"
    },
    {
      "text": "Erickson, T. and Kellogg, W.A. Social translucence: an approach to designing systems that support social processes. TOCHI 7, 1 (2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Gamon, M., Basu, S., Belenko, D., et al. Blews: Using blogs to provide context for news articles. Proc. ICWSM '08, (2008), 60--67.",
      "doi": ""
    },
    {
      "text": "Granovetter, M. The Strength of Weak Ties. American Journal of Sociology 78, 6 (1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Hearst, M. Search User Interfaces. Cambridge University Press, 2009. ",
      "doi": "10.5555/1631268"
    },
    {
      "text": "Joachims, T., Freitag, D., and Mitchell, T. Webwatcher: A tour guide for the world wide web. Proc. IJCAI, AAAI (1997), 770--777.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E., and Suh, B. Crowdsourcing user studies with Mechanical Turk. Proc. CHI '08, ACM Press (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Marshall, C. and Bly, S. Sharing encountered information: digital libraries get a social life. Proc. JCDL '04, (2004), 218--227.  ",
      "doi": "10.1145/996350.996401"
    },
    {
      "text": "Mason, W. and Watts, D. Financial Incentives and the \"Performance of Crowds\". Proc. HCOMP '09, (2009), 77--85.  ",
      "doi": "10.1145/1600150.1600175"
    },
    {
      "text": "McDonald, D. and Ackerman, M. Expertise recommender: a flexible recommendation system and architecture. Proc. CSCW '00, ACM Press (2000), 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Montaner, M., López, B., and La, J.L. A Taxonomy of Recommender Agents on the Internet. Artificial Intelligence Review 19, 4 (2003), 285--330.  ",
      "doi": "10.1023/A%3A1022850703159"
    },
    {
      "text": "Paepcke, A. Information Needs in Technical Work Settings and Their Implications for the Design of Computer Tools. Computer Supported Cooperative Work 5, 1 (1996), 63--92. ",
      "doi": "10.1007/BF00141936"
    },
    {
      "text": "Resnick, P., Iacovou, N., Suchak, M., et al. GroupLens: An open architecture for collaborative filtering of net-news. Proc. CSCW '94, ACM Press (1994), 175--186.  ",
      "doi": "10.1145/192844.192905"
    },
    {
      "text": "Rocchio, J. Relevance feedback in information retrieval. In G. Salton, The SMART retrieval system: experiments in automatic document processing. Prentice Hall, Englewood Cliffs, NJ, 1971, 313--323.",
      "doi": ""
    },
    {
      "text": "Salton, G. and Buckley, C. Term-weighting approaches in automatic text retrieval. Information Processing and Management 24, 5 (1988), 513--523.  ",
      "doi": "10.1016/0306-4573%2888%2990021-0"
    },
    {
      "text": "Sen, S., Geyer, W., Muller, M., et al. FeedMe: a collaborative alert filtering system. Proc. CSCW '06, ACM Press (2006), 89--98.  ",
      "doi": "10.1145/1180875.1180890"
    },
    {
      "text": "Terveen, L. and McDonald, D. Social matching: A framework and research agenda. TOCHI 12, 3 (2005), 401--434.  ",
      "doi": "10.1145/1096737.1096740"
    },
    {
      "text": "Terveen, L., Hill, W., Amento, B., et al. PHOAKS: A system for sharing recommendations. CACM 40, 3 (1997), 59--62.  ",
      "doi": "10.1145/245108.245122"
    }
  ]
}