{
  "doi": "10.1145/1753326.1753638",
  "title": "Now let me see where i was: understanding how lifelogs mediate memory",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2045-2054",
  "year": 2010,
  "badges": [],
  "abstract": "Lifelogging technologies can capture both mundane and important experiences in our daily lives, resulting in a rich record of the places we visit and the things we see. This study moves beyond technology demonstrations, in aiming to better understand how and why different types of Lifelogs aid memory. Previous work has demonstrated that Lifelogs can aid recall, but that they do many other things too. They can help us look back at the past in new ways, or to reconstruct what we did in our lives, even if we don't recall exact details. Here we extend the notion of Lifelogging to include locational information. We augment streams of Lifelog images with geographic data to examine how different types of data (visual or locational) might affect memory. Our results show that visual cues promote detailed memories (akin to recollection). In contrast locational information supports inferential processes -- allowing participants to reconstruct habits in their behaviour.",
  "authors": [
    {
      "name": "Vaiva Kalnikaite",
      "institution": "The University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384614073",
      "orcid": "missing"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Steve Whittaker",
      "institution": "IBM Research Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "David Kirk",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    }
  ],
  "references": [
    {
      "text": "Azuma H., Mukaigawa Y., and Yagi Y., Spatio-Temporal Lifelog Using a Wearable Compound Omnidirectional Sensor, The 8th Workshop on Omnidirectional Vision, Camera Networks and Non-classical Cameras - OMNIVIS, Marseille, France, 2008.",
      "doi": ""
    },
    {
      "text": "Bell G., and Gemmell J., A digital life, Scientific American (2007).",
      "doi": ""
    },
    {
      "text": "Berry E., Kapur N., Williams L., Hodges S., et al, The use of a wearable camera, SenseCam, as a pictorial diary to improve autobiographical memory in a patient with limbic encephalitis, Encephalitis: Assessment and Rehabilitation Across the Lifespan (Special Issue of Neuropsychological Rehabilitation), 17 (2007), pp. 582--681.",
      "doi": ""
    },
    {
      "text": "Brewer W., and Sampaio C., Processes leading to confidence and accuracy in sentence recognition: A metamemory approach, Memory, 14 (2006), pp. 540--552.",
      "doi": ""
    },
    {
      "text": "Budvytis I., Scott J., and Butler A., Compass-Based Automatic Picture Taking using SenseCam, In Adjunct Proceedings of Pervasive 2008, Sydney, Australia, 2008.",
      "doi": ""
    },
    {
      "text": "Chalfen R., Family photography: One album is worth a 1000 lies, in D. M. Neuwman, ed., Sociology: Exploring the architecture of everyday life Thousand Oaks, CA.: Pine Forge Press, 1997, pp. 269--278.",
      "doi": ""
    },
    {
      "text": "Chalfen R., Snapshot Versions of Life, Bowling Green Ohio, Popular Press (1987).",
      "doi": ""
    },
    {
      "text": "Cohen G., Memory in the Real World, The Open University, Psychology Press, 1996.",
      "doi": ""
    },
    {
      "text": "Cohen G., Kiss G., and Le Voi M., Memory: Current Issues (Open Guide to Psychology), Open University Press, 1993.",
      "doi": ""
    },
    {
      "text": "Conway M.A., Episodic Memories, Neuropsychologia, 47 (2009), pp. 2305--2313.",
      "doi": ""
    },
    {
      "text": "Conway M. A., and Pleydell Pearce C. W., The construction of autobiographical memories in the self memory system, Psychological Review (2000), pp. 261--288.",
      "doi": ""
    },
    {
      "text": "DeVaul R. W., Pentland S. A. and Corey V. R., The Memory Glasses: Subliminal vs. Overt Memory Support with Imperfect Information, Proceedings of the 7th IEEE International Symposium on Wearable Computers, IEEE Computer Society, 2003. ",
      "doi": "10.5555/946249.946907"
    },
    {
      "text": "Doherty A. R., and Smeaton A. F., Automatically Segmenting LifeLog Data into Events, Image Analysis for Multimedia Interactive Services, 2008. WIAMIS '08, 2008, pp. 20--23.  ",
      "doi": "10.1109/WIAMIS.2008.32"
    },
    {
      "text": "Doherty R. A., Byrne D., Smeaton F. A. et al Investigating keyframe selection methods in the novel domain of passively captured visual lifelogs. In Proc of ICCIR'08, ACM Press, Niagara Falls, Canada, 2008.  ",
      "doi": "10.1145/1386352.1386389"
    },
    {
      "text": "Fleck R., and Fitzpatrick G., Supporting reflection with passive image capture. In supplementary proc. of COOP'06, Carry-le-Rouet, France, 2006, pp. 41--48.",
      "doi": ""
    },
    {
      "text": "Frohlich D., Kuchinsky A., Pering C., Don A., and Ariss S., Requirements for photoware. In Proc. of CSCW'02, ACM Press, New Orleans, Louisiana, USA, 2002.  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Gemmell J., Bell G. and Lueder R., MyLifeBits: a personal database for everything, 49 (2006), pp. 88--95.  ",
      "doi": "10.1145/1107458.1107460"
    },
    {
      "text": "González M. C., Hidalgo C. A., and Barabási A. L., Understanding individual human mobility patterns, Nature (2008), pp. 779--782.",
      "doi": ""
    },
    {
      "text": "Harper R., Randall D., et al, The past is a different place: they do things differently there. In Proc. of DIS'08, ACM Press, Cape Town, South Africa, 2008.  ",
      "doi": "10.1145/1394445.1394474"
    },
    {
      "text": "Harper R., Randall D., Smyth N., Evans C., Heledd L., and Moore R., Thanks for the memory, Interact: HCI 2007, Lancaster, UK, 2007. ",
      "doi": "10.5555/1531407.1531418"
    },
    {
      "text": "Hodges S., Williams L., Berry E., Izadi S., Srinivasan J., Butler A., Smyth G., Kapur N. and Wood K., SenseCam: A Retrospective Memory Aid, UbiComp'06 pp. 177--193.  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "Kalnikaite V. and Whittaker S., Software or wetware?: discovering when and why people use digital prosthetic memory, In Proc. of CHI'07, ACM Press, San Jose, California, USA, 2007.  ",
      "doi": "10.1145/1240624.1240635"
    },
    {
      "text": "Liao L., Patterson D., Fox D., and Kautz H., Learning and inferring transportation routines, In Proc. of AAAI, 2004, pp. 348--353. ",
      "doi": "10.5555/1597148.1597206"
    },
    {
      "text": "Liao L., Patterson D. J., Fox D. and Kautz H., Learning and Inferring Transportation Routines, Artificial Intelligence, 171 (2007), pp. 311--331.  ",
      "doi": "10.1016/j.artint.2007.01.006"
    },
    {
      "text": "Linton M., Transformation of memory in everyday life, in U. E. Neisser, ed., Memory Observed: Remembering in natural context., San Francisco: Freeman, SF, 1982.",
      "doi": ""
    },
    {
      "text": "Mann S., Fung J., Aimone C., Sehgal A. and Chen D., Designing EyeTap Digital Eyeglasses for Continuous Lifelong Capture and Sharing of Personal Experiences, In Proc. of CHI'05, ACM Press, 2005.",
      "doi": ""
    },
    {
      "text": "Nokia, \"Nokia viNe\", http://vine.nokia.com/, 2009.",
      "doi": ""
    },
    {
      "text": "Ochsner K. N., Are affective events richly recollected or simply familiar? The experience and process of recognizing feelings past., Journal of Experimental Psychology: General (2000), pp. 242--261.",
      "doi": ""
    },
    {
      "text": "Petrelli D., Whittaker S. and Brockmeier J., Autotopography: what can physical mementos tell us about digital memories? In Proc. of CHI'08, ACM Press, Florence, Italy, 2008.  ",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "ReQall, \"ReQall\", http://www.reqall.com/, 2009.",
      "doi": ""
    },
    {
      "text": "Sellen A. and Whittaker S., Beyond Total Capture: A Constructive Critique of Lifelogging. To appear in Communications of the ACM, 2010.  ",
      "doi": "10.1145/1735223.1735243"
    },
    {
      "text": "Sellen A., Fogg A., Aitken M., Hodges S., Rother C. and Wood K., Do life-logging technologies support memory for the past?: an experimental study using sensecam, In Proc. of CHI'07, ACM Press, San Jose, California, USA, 2007.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Stanford University, Wide Area Augmentation System (WAAS). http://waas.stanford.edu/research/waas.htm, 2009.",
      "doi": ""
    },
    {
      "text": "Stifelman L., Arons B., and Schmandt C., The audio notebook: paper and pen interaction with structured speech, In Proc. of CHI'01, ACM Press, Seattle, Washington, United States, 2001.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Tan D., Stefanucci J., Proffitt D., and Pausch R., The Infocockpit: providing location and place to aid human memory, In Proc. of workshop on Perceptive User Interfaces, ACM Press, Orlando, Florida, 2001.  ",
      "doi": "10.1145/971478.971526"
    },
    {
      "text": "Tulving E., Episodic memory: from mind to brain, Episodic Memory: from Mind to Brain, 53 (2002), pp. 1--25.",
      "doi": ""
    },
    {
      "text": "Vemuri S., Schmandt C., Bender W., Tellex S., and Lassey B., An Audio-Based Personal Memory Aid. In UbiComp'04, 2004, pp. 400--417.",
      "doi": ""
    },
    {
      "text": "Wagenaar W. A., Is Memory Self--serving?, in U. N. a. R. Fivush, ed., The Remembering Self: Construction and Accuracy in the Self-Narrative. Cambridge University Press, Cambridge, 1994, pp. 191--204.",
      "doi": ""
    },
    {
      "text": "Whittaker S., Hyland P., and Wiley M., FILOCHAT: handwritten notes provide access to recorded conversations, In Proc. of CHI'94, ACM, Boston, Massachusetts, United States, 1994.  ",
      "doi": "10.1145/191666.191763"
    }
  ]
}