{
  "doi": "10.1145/1753326.1753580",
  "title": "An empirical task analysis of warehouse order picking using head-mounted displays",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1695-1704",
  "year": 2010,
  "badges": [],
  "abstract": "Evaluations of task guidance systems often focus on evaluations of new technologies rather than comparing the nuances of interaction across the various systems. One common domain for task guidance systems is warehouse order picking. We present a method involving an easily reproducible ecologically motivated order picking environment for quantitative user studies designed to reveal differences in interactions. Using this environment, we perform a 12 participant within-subjects experiment demonstrating the advantages of a head-mounted display based picking chart over a traditional text-based pick list, a paper-based graphical pick chart, and a mobile pick-by-voice system. The test environment proved sufficiently sensitive, showing statistically significant results along several metrics with the head-mounted display system performing the best. We also provide a detailed analysis of the strategies adopted by our participants.",
  "authors": [
    {
      "name": "Kimberly A. Weaver",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81331507253/rel-imgonly/kimheadshot.jpg",
      "acmid": "81331507253",
      "orcid": "missing"
    },
    {
      "name": "Hannes Baumann",
      "institution": "Universität Bremen, Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447595282",
      "orcid": "missing"
    },
    {
      "name": "Thad Starner",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100175439",
      "orcid": "missing"
    },
    {
      "name": "Hendrick Iben",
      "institution": "Universität Bremen, Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371593138",
      "orcid": "missing"
    },
    {
      "name": "Michael Lawo",
      "institution": "Universität Bremen, Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654081",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Bartholdi and S. Hackmann. Warehouse and distribution science release 0.89. Technical report, Georgia Institute of Technology, January 2009.",
      "doi": ""
    },
    {
      "text": "N. Cowan. The magical number 4 in Short-Term memory: A reconsideration of mental storage capacity. Behavioral and Brain Sciences, 24(01):87--114, 2001.",
      "doi": ""
    },
    {
      "text": "J. Coyle, E. Bardi, and C. Langley. The Management of Business Logistics: A Supply Chain Perspective. South-Western College, Cincinnati, OH, 2002.",
      "doi": ""
    },
    {
      "text": "B. Crider. A battery of tests for the dominant eye. The Journal of General Psychology, 31:179--190, 1944.",
      "doi": ""
    },
    {
      "text": "H. Iben, H. Baumann, T. Starner, C. Ruthenbeck, and T. Klug. Visual based picking supported by context awareness: Comparing picking performance using paper-based lists versus lists presented on a head mounted display with contextual support. In ICMI-MLMI, Cambridge, MA, USA, November 2009. ACM.  ",
      "doi": "10.1145/1647314.1647374"
    },
    {
      "text": "R. Koster, T. Le-Duc, and K. Roodbergen. Design and control of warehouse order picking: a literature review. Technical Report ERS-2006-005-LIS, Rotterdam, The Netherlands, January 2006.",
      "doi": ""
    },
    {
      "text": "D. Mizell. Fundamentals of Wearable Computers and Augmented Reality, chapter Boeing's wire bundle assembly project, pages 447--467. Lawrence Erlbaum & Associates, Philadelphia, PA, 2001.",
      "doi": ""
    },
    {
      "text": "M. J. Muller. Invisible work of telephone operators: An ethnocritical analysis. Computer Supported Cooperative Work (CSCW), 8(1):31--61, Mar. 1999.  ",
      "doi": "10.1023/A%3A1008603223106"
    },
    {
      "text": "J. Ockerman. Task guidance and procedure context: aiding workers in appropriate procedure following. PhD thesis, Georgia Institute of Technology, Atlanta, GA USA, April 2000. ",
      "doi": "10.5555/931062"
    },
    {
      "text": "E. Peli. Visual issues in the use of a head-mounted monocular display. Optical Engineering, 29(8):883--892, 1990.",
      "doi": ""
    },
    {
      "text": "R. Reif, W.A. Günthner, B. Schwerdtfeger, and G. Klinker. Pick-by-vision comes on age: evaluation of an augmented reality supported picking system in a real storage environment. In AFRIGRAPH '09: Proceedings of the 6th International Conference on Computer Graphics, Virtual Reality, Visualisation and Interaction in Africa, pages 23--31, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1503454.1503459"
    },
    {
      "text": "B. Schwerdtfeger, T. Frimor, D. Pustka, and G. Klinker. Mobile information presentation schemes for supra-adaptive logistics applications. In Advances in Artificial Reality and Tele-Existence, pages 998--1007. 2006.  ",
      "doi": "10.1007/11941354_103"
    },
    {
      "text": "D. Siewiorek, A. Smailagic, L. Bass, J. Siegel, R. Martin, and B. Bennington. Adtranz: a mobile computing system for maintenance and collaboration. In International Symposium on Wearable Computers, pages 25--32. IEEE Computer Society Press, 1998. ",
      "doi": "10.5555/857199.858011"
    },
    {
      "text": "D. Siewiorek, A. Smailagic, and T. Starner. Application Design for Wearable Computing. Morgan Claypool, San Rafael, CA, 2008. ",
      "doi": "10.5555/1795905"
    },
    {
      "text": "A. Smailagic, D. Siewiorek, R. Martin, and J. Stivoric. Very rapid prototyping of wearable computers: a case study of custom versus off-the-shelf design methodologies. Design Automation for Embedded Systems, 3(1):217--230, March 1998.",
      "doi": ""
    },
    {
      "text": "T.E. Starner. Wearable computers: No longer science fiction. IEEE Pervasive Computing, 1(1):86--88, 2002.  ",
      "doi": "10.1109/MPRV.2002.993148"
    },
    {
      "text": "J.A. Tompkins, J.A. White, Y.A. Bozer, E.H. Frazelle, and J.M.A. Tanchoco. Facilities Planning. John Wiley and Sons, NJ, 2003.",
      "doi": ""
    }
  ]
}