{
  "doi": "10.1145/1753326.1753398",
  "title": "The implications of improvisational acting and role-playing on design methodologies",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "483-492",
  "year": 2010,
  "badges": [],
  "abstract": "For decades designers have used theatre metaphors to describe design methodologies and have used performance techniques to enhance the design process, two of which are improvisational acting and role-playing. Unfortunately, most design literature does not differentiate between these two practices even while using them in combination with various design methods. This paper discusses how improvisation and role-playing have been employed during the design process and why they are distinct from one another. The authors draw upon their current research involving improvisational acting and compare it with other role-playing research which examines role-playing from both a serious and entertainment angle. They conclude through this comparison that both performance techniques have their place in the design process and that more informed definitions of each technique can aid designers in deciding which technique's properties will benefit them the most.",
  "tags": [
    "role-playing",
    "theatre",
    "design methodologies",
    "improvisation",
    "performance"
  ],
  "authors": [
    {
      "name": "Ben Medler",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81365598309",
      "orcid": "missing"
    },
    {
      "name": "Brian Magerko",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327490117",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bartle, R. Designing Virtual Worlds. New Riders Games, 2003. ",
      "doi": "10.5555/1196681"
    },
    {
      "text": "Beard, R.L. Enhancing Transfer of Training: Using Role-Play to Foster Teamwork in the Cockpit. International Journal of Aviation Psychology 5, 2 (1995), 131--143.",
      "doi": ""
    },
    {
      "text": "Berger, F. Tabletop RPG meets performing arts Bringing pen & paper role-playing to the stage. In Proc. Knutepunkt 2009, 111--130.",
      "doi": ""
    },
    {
      "text": "Berliner, P.F. Thinking in jazz: the infinite art of improvisation. University of Chicago Press, Chicago, IL, USA. 1994.",
      "doi": ""
    },
    {
      "text": "Boess, S. First steps in role playing. In Proc. CHI 2008, ACM Press (2008), 2017--2024.  ",
      "doi": "10.1145/1358628.1358632"
    },
    {
      "text": "Boess, S. Do that Again? In Proc. CHI 2008, ACM Press (2008), 2575--2578.  ",
      "doi": "10.1145/1358628.1358715"
    },
    {
      "text": "Bruce, A., Knight, J., Listopad, S., Magerko, B., and Nourbakhsh, I. Robot Improv: Using Drama to Create Believable Agents. In Proc. ICRA 2000, 4, IEEE Press (2000), 4002--4008.",
      "doi": ""
    },
    {
      "text": "Burns, C., Dishman, E., Verplank, W., Lassiter, B. Actors, Hairdos & Videotape -- Informance Design. In Proc. of CHI 1994, ACM Press (1994), 119--20.  ",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Chelariu, C., Johnston, W., and Young, L. Learning to improvise, improvising to learn: a process of responding to complex environments. Journal of Business Research 55, 2 (2002), 141--147.",
      "doi": ""
    },
    {
      "text": "Cunha, M.P., Cunha, J.V., and Kamoche, K. Organizational improvisation: What, when, how and why. In Kamoche, K. Cunha, and M.P., Cunha J.V. (Eds.), Organizational improvisation. Routledge, 2002, 96--165.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Lee, M., Dey, A., Zimmerman, J. Rapidly Exploring Application Design Through Speed Dating. In Proc. Ubicomp 2007, ACM Press (2007), 1069--1072. ",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Enghoff, M. A Good Character Description. In Gade, M., Thorup, L. and Sander, M. (Eds.) As Larp Grows Up. Knudepunkt 2003, 154--159.",
      "doi": ""
    },
    {
      "text": "Fine, G. A.Shared Fantasy. Role-Playing Games as Social Worlds. University of Chicago Press, Chicago, IL, USA. 1983.",
      "doi": ""
    },
    {
      "text": "Flowers, A. Magerko, B., and Mishra, P. Gamemasters and Interactive Story: A Categorization of Storytelling Techniques in Live Roleplaying. In Proc. of Futureplay 2006, London, Ontario, (2006).",
      "doi": ""
    },
    {
      "text": "Gade, M. Interaction: the Key Element of Larp. In Gade, M., Thorup, L. and Sander, M. (Eds.) As Larp Grows Up. Knudepunkt 2003, 66--71.",
      "doi": ""
    },
    {
      "text": "Gerber, E. 2009. Using improvisation to enhance the effectiveness of brainstorming. In Proc. CHI 2009, ACM Press (2009), 97--104.  ",
      "doi": "10.1145/1518701.1518718"
    },
    {
      "text": "Grøtan, T.O., Størseth, F., Maren Helene Rø, M.H., and Skjerve, A.B. Resilience, Adaptation and Improvisation -- increasing resilience by organizing for successful improvisation. In Symposium on Resilience Engineering, (2008).",
      "doi": ""
    },
    {
      "text": "Gygax, G. and Arneson, D. Dungeons and Dragons 4th Edition. Wizards of the Coast, 2008.",
      "doi": ""
    },
    {
      "text": "Hayes-Roth, B. An architecture for adaptive intelligent systems. Artificial Intelligence 72, 1-2 (1995), 329--365.  ",
      "doi": "10.5555/1644719.1644728"
    },
    {
      "text": "Howard, S., Carroll, J., Murphy, J., Peck, J. Using 'endowed props' in scenario-based design. In Proc. 2nd NordCHI (2002), 1--10.  ",
      "doi": "10.1145/572020.572022"
    },
    {
      "text": "Johnson-Laird, P.N. How Jazz Musicians Improvise. Music Perception 19, 3 (2002), 415--442.",
      "doi": ""
    },
    {
      "text": "Johnstone, K. (1992). Impro: Improvisation and the Theatre. Routledge / Theatre Arts Books, New York, NY, USA, 1992.",
      "doi": ""
    },
    {
      "text": "Kuusela, H., and Paul, P. A Comparison of Concurrent and Retrospective Verbal Protocol Analysis. The American Journal of Psychology 113, 3 (2000), 387--404.",
      "doi": ""
    },
    {
      "text": "Laurel, B. Computers as Theatre. Addison-Wesley Professional, 1993. ",
      "doi": "10.5555/529145"
    },
    {
      "text": "Libera, A. The Second City Almanac of Improvisation. Northwestern University Press, 2004.",
      "doi": ""
    },
    {
      "text": "Magerko, B., Manzoul, W., Riedl, M., Baumer, A., Fuller, D., Luther, K., and Pearce, C. (2009). An Empirical Study of Cognition and Theatrical Improvisation. In the Proc. Creativity and Cognition 2009, ACM Press (2009).  ",
      "doi": "10.1145/1640233.1640253"
    },
    {
      "text": "Martin, J., Lope, J., Maravall, D. Adaptation, anticipation and rationality in natural and artificial systems: computational paradigms mimicking nature. Natural Computing, online (2008).  ",
      "doi": "10.1007/s11047-008-9096-6"
    },
    {
      "text": "Miner, A., Bassoff, P., and Moorman, C. Organizational improvisation and learning: A Field study. Administrative Science Quarterly 46, 2 (2001), 304--337.",
      "doi": ""
    },
    {
      "text": "Montola, M. The Invisible Rules of Role-Playing: The Social Framework of Role-Playing Process. International Journal of Role-Playing 1, 1 (2009), 22--36.",
      "doi": ""
    },
    {
      "text": "Moorman, C. and Miner, A. Organizational improvisation and organizational memory. The Academy of Management Review 23, 4 (1998), 698--723.",
      "doi": ""
    },
    {
      "text": "Newell, A., Carmichael, A., Morgan, M. & Dickinson, A. The use of theatre in requirements gathering and usability studies. Interacting with Computers, 18, 5 (2006), 996--1011.  ",
      "doi": "10.1016/j.intcom.2006.05.003"
    },
    {
      "text": "Perlin, K. and Goldberg, A. Improv: a system for scripting interactive actors in virtual worlds. In Proc. SIGGRAPH 1996, ACM Press (1996).  ",
      "doi": "10.1145/237170.237258"
    },
    {
      "text": "Pressing, J. Cognitive processes in improvisation. In W.R. Crozier & A.J. Chapman (Eds.), Cognitive processes in the perception of art. Amsterdam: North Holland, 1984, 345--363.",
      "doi": ""
    },
    {
      "text": "Reinholdsson, R. Making Music Together: An Interactionist Perspective on Small-Group Performance in Jazz. Acta Universitatis Upsaliensis: Studia Musicologica Upsaliensia, Nova Series 14, (1998).",
      "doi": ""
    },
    {
      "text": "Rosen, R. Anticipatory Systems: Philosophical, Mathematical and Methodological Foundations. Pergamon, 1985.",
      "doi": ""
    },
    {
      "text": "Sawyer, K. Improvised Dialogues. Greenwood Publishing Group, 2003.",
      "doi": ""
    },
    {
      "text": "Simsarian, K., Take it to the Next Stage: The Roles of Role Playing the Design Process. In Proc. of CHI 2003, ACM Press (2003), 1012--1013.  ",
      "doi": "10.1145/765891.766123"
    },
    {
      "text": "Spolin, V. Improvisation for the theater; a handbook of teaching and directing techniques. Northwestern University Press, Evanston, IL, 1963.",
      "doi": ""
    },
    {
      "text": "Svanaes, D. and Seland, G. Putting the users center stage: role playing and low-fi prototyping enable end users to design mobile systems. In Proc. CHI 2004, ACM Press (2004), 479--486.  ",
      "doi": "10.1145/985692.985753"
    },
    {
      "text": "Turkle, S. Life on the screen: identity in the age of the Internet. Simon and Schuster, 1995. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Weick, K.E. Organizational design as improvisation. In Huber G.P. and Glick W.H. (Eds.) Organizational change and redesign: ideas and insights for improving performance. Oxford Univ. Press (1993), 346--79.",
      "doi": ""
    },
    {
      "text": "Yardley-Matwiejczuk, K. Role play: theory and practice. SAGE Publication, 1997.",
      "doi": ""
    }
  ]
}