{
  "doi": "10.1145/1753326.1753692",
  "title": "Toque: designing a cooking-based programming language for and with children",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2417-2426",
  "year": 2010,
  "badges": [],
  "abstract": "An intergenerational design team of children (ages 7-11 years old) along with graduate students and faculty in computer science and information studies developed a programming language for children, Toque. Concrete real-world cooking scenarios were used as programming metaphors to support an accessible programming learning experience. The Wiimote and Nunchuk were used as physical programming input devices. The programs that were created were pictorial recipes which dynamically controlled animations of an on-screen chef preparing virtual dishes in a graphical kitchen environment. Through multiple design sessions, programming strategies were explored, cooking metaphors were developed and, prototypes of the Toque environment were iterated. Results of these design experiences have shown us the importance of pair-programming, programming by storytelling, parallel programming, function-argument relationships, and the role of tangibility in overcoming challenges with constraints imposed by the system design.",
  "authors": [
    {
      "name": "Sureyya Tarkan",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340493165",
      "orcid": "missing"
    },
    {
      "name": "Vibha Sazawal",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100192481",
      "orcid": "missing"
    },
    {
      "name": "Allison Druin",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    },
    {
      "name": "Evan Golub",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100043718",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth M. Bonsignore",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641019",
      "orcid": "missing"
    },
    {
      "name": "Greg Walsh",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81416598462/rel-imgonly/new_profilepic.png",
      "acmid": "81416598462",
      "orcid": "missing"
    },
    {
      "name": "Zeina Atrash",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655468",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bransford, J., Sherwood, R., Vye, N., and Rieser, J. Teaching Thinking and Problem Solving: Research Foundations. American Psychologist 41, 10 (1986), 1078--1089.",
      "doi": ""
    },
    {
      "text": "Cooper, S., Dann, W., and Pausch, R. 2000. Alice: A 3-D Tool for Introductory Programming Concepts. J. Comput. Small Coll. 15, 5 (2000), 107--116. ",
      "doi": "10.5555/364133.364161"
    },
    {
      "text": "Dalbey, J. and Linn, M.C. The Demands and Requirements of Computer Programming: A Literature Review. Journal of Educational Commuting Research 1, 3 (1985), 253--274.",
      "doi": ""
    },
    {
      "text": "Druin, A. The Role of Children in the Design of New Technology. Behaviour and Information Technology 21, 1 (2002), 1--25.",
      "doi": ""
    },
    {
      "text": "Nintendo. http://www.cookingmamacookoff.com/",
      "doi": ""
    },
    {
      "text": "Fernaeus, Y. and Tholander, J. Finding Design Qualities in a Tangible Programming Space. In Proc. CHI 2006, ACM Press (2006), 447--456.  ",
      "doi": "10.1145/1124772.1124839"
    },
    {
      "text": "Glu Cooking star. http://www.cookingstargame.com/.",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Fitchett, C. Phidgets: Easy Development of Physical Interfaces through Physical Widgets. In Proc. UIST 2001, ACM Press (2001), 209--218.  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Horn, M.S. and Jacob, R.J.K. Tangible Programming in the Classroom with Tern. Ext. Abstracts CHI 2007, ACM Press (2007), 1965--1970.  ",
      "doi": "10.1145/1240866.1240933"
    },
    {
      "text": "Igarashi, T. and Hughes, J.F. Smooth Meshes for Sketch-Based Freeform Modeling. In Proc. I3D 2003, ACM Press (2003), 139--142.  ",
      "doi": "10.1145/641480.641507"
    },
    {
      "text": "Kahn, K. Drawings on Napkins, Video-Game Animation, and Other Ways to Program Computers. Commun. ACM 39, 8 (1996), 49--59.  ",
      "doi": "10.1145/232014.232028"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Lowering the Barriers to Programming: A Taxonomy of Programming Environments and Languages for Novice Programmers. ACM Comput. Surv. 37, 2(2005), 83--137.  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Kelleher, C., Pausch, R., and Kiesler, S. Storytelling Alice Motivates Middle School Girls to Learn Computer Programming. In Proc. CHI 2007, ACM Press (2007), 1455--1464.  ",
      "doi": "10.1145/1240624.1240844"
    },
    {
      "text": "MacLaurin, M. Kodu: End--User Programming and Design for Games. In Proc. FDG 2009, ACM Press (2009), xviii-xix.  ",
      "doi": "10.1145/1536513.1536516"
    },
    {
      "text": "Maloney, J., Burd, L., Kafai, Y., Rusk, N., Silverman, B., and Resnick, M. Scratch: A Sneak Preview. In Proc. C5 2004, IEEE (2004), 104--109.  ",
      "doi": "10.5555/1009376.1009408"
    },
    {
      "text": "Martin, F., Mikhak, B., Resnick, M., Silverman, B., and Berg, R. To Mindstorms and Beyond: Evolution of a Construction Kit for Magical Machines. Robots for kids: exploring new technologies for learning (2000), 9--33. ",
      "doi": "10.5555/336882.336891"
    },
    {
      "text": "McDowell, C., Werner, L., Bullock, H.E., and Fernald, J. The Impact of Pair Programming on Student Performance, Perception and Persistence. In Proc. ICSE 2003, IEEE (2003), 602--607. ",
      "doi": "10.5555/776816.776899"
    },
    {
      "text": "McNerney, T.S. From Turtles to Tangible Programming Bricks: Explorations in Physical Language Design. Personal Ubiquitous Comput. 8, 5 (2004), 326--337.  ",
      "doi": ""
    },
    {
      "text": "Montemayor, J., Druin, A., Farber, A., Simms, S., Churaman, W., and D'Amour, A. Physical Programming: Designing Tools for Children to Create Physical Interactive Environments. In Proc. CHI 2002, ACM Press (2002), 299--306.  ",
      "doi": "10.1145/503376.503430"
    },
    {
      "text": "National Research Council. Being Fluent with Information Technology. National Academy Press, Washington, DC, 1999.",
      "doi": ""
    },
    {
      "text": "Pane, J.F. and Myers, B.A. The Impact of Human-Centered Features on the Usability of a Programming System for Children. Ext. Abstracts CHI 2002, ACM Press (2002), 684--685.  ",
      "doi": "10.1145/506443.506545"
    },
    {
      "text": "Pane, J.F., Myers, B.A., and Ratanamahatana, C.A. Studying the Language and Structure in Non-Programmers' Solutions to Programming Problems. Int. J. Hum.-Comput. Stud. 54, 2 (2001), 237--264.  ",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "Pizza Palace, Webkinz. http://webkinztown.com/.",
      "doi": ""
    },
    {
      "text": "Swan, K. and Black, J.B. Results of Four studies on Logo Programming, Problem Solving, and Knowledge-Based Instructional Design. In The International Conference on Technology and Education, March 1990.",
      "doi": ""
    },
    {
      "text": "Tarkan, S. The Formal Specification of a Kitchen Environment. Master's Thesis, U. of Maryland, 2009.",
      "doi": ""
    },
    {
      "text": "Tarkan, S., Sazawal, V., Druin, A., Foss, E., Golub, E., Hatley, L., Khatri, T., Massey, S., Walsh, G., Torres, G. Designing a Novice Programming Environment with Children. Technical Report 2009-03, HCIL, Jan 2009.",
      "doi": ""
    },
    {
      "text": "WiiRemoteJ, http://www.wiili.com/wiiremotej-f68.html",
      "doi": ""
    },
    {
      "text": "Williams, L. and Upchurch, R.L. In Support of Student Pair-Programming. In Proc. SIGCSE 2001, ACM Press (2001), 327--331.  ",
      "doi": "10.1145/364447.364614"
    },
    {
      "text": "Wyeth, P. and Purchase, H.C. Tangible Programming Elements for Young Children. Ext. Abstracts CHI 2002, ACM Press (2002), 774--775.  ",
      "doi": "10.1145/506443.506591"
    },
    {
      "text": "Zuckerman, O., Arida, S., and Resnick, M. Extending Tangible Interfaces for Education: Digital Montessori-Inspired Manipulatives. In Proc. CHI 2005, ACM Press (2005), 859--868.  ",
      "doi": "10.1145/1054972.1055093"
    }
  ]
}