{
  "doi": "10.1145/1753326.1753522",
  "title": "Postcolonial computing: a lens on design and development",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1311-1320",
  "year": 2010,
  "badges": [],
  "abstract": "As our technologies travel to new cultural contexts and our designs and methods engage new constituencies, both our design and analytical practices face significant challenges. We offer postcolonial computing as an analytical orientation to better understand these challenges. This analytic orientation inspires four key shifts in our approach to HCI4D efforts: generative models of culture, development as a historical program, uneven economic relations, and cultural epistemologies. Then, through reconsideration of the practices of engagement, articulation and translation in other contexts, we offer designers and researchers ways of understanding use and design practice to respond to global connectivity and movement.",
  "authors": [
    {
      "name": "Lilly Irani",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459507",
      "orcid": "missing"
    },
    {
      "name": "Janet Vertesi",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81328491066/rel-imgonly/vertesi_300.jpg",
      "acmid": "81328491066",
      "orcid": "missing"
    },
    {
      "name": "Paul Dourish",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81100521529/rel-imgonly/paul-headshot-square.jpg",
      "acmid": "81100521529",
      "orcid": "missing"
    },
    {
      "name": "Kavita Philip",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438595977",
      "orcid": "missing"
    },
    {
      "name": "Rebecca E. Grinter",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    }
  ],
  "references": [
    {
      "text": "Adas, M. Machines as the Measure of Men: Science, Technology, and Ideologies of Western Dominance. Cornell University Press, Ithaca, NY, 1989.",
      "doi": ""
    },
    {
      "text": "Akrich, M. The Description of Technical Objects. In Shaping Technology / Building Society. MIT Press, 1992.",
      "doi": ""
    },
    {
      "text": "Appadurai, A. Modernity at Large: Cultural Dimensions of Globalization. University of Minnesota Press, 1996.",
      "doi": ""
    },
    {
      "text": "Bidwell, N.J., Standley, P., George, T., and Steffensen, V. The landscape's apprentice: lessons for place-centred design from grounding documentary. Proc. DIS 2008 (Cape Town, South Africa), ACM Press, 88--98.  ",
      "doi": "10.1145/1394445.1394455"
    },
    {
      "text": "Brewer, E., Demmer, M., Du, B., et al. The case for technology in developing regions. Computer 38, 6 (2005), 25--38.  ",
      "doi": "10.1109/MC.2005.204"
    },
    {
      "text": "Butler, D. The race to wire up the poor. Nature 447, 7140 (2007), 6--7.",
      "doi": ""
    },
    {
      "text": "Chan, A. Coding Free Software, Coding Free States: Free Software Legislation and the Politics of Code in Peru. Anthropological Quarterly 77, 3 (2004), 531--545.",
      "doi": ""
    },
    {
      "text": "Chetty, M., Tucker, W., and Blake, E. Developing locally relevant software applications for rural areas: a South African example. Proc. SAICSIT 2004 (Stellenbosch, South Africa), ACM Press, 239--243. ",
      "doi": "10.5555/1035053.1035083"
    },
    {
      "text": "da Costa Marques, I. Cloning computers: From rights of possession to rights of creation. Science as Culture 14, 2 (2005), 139.",
      "doi": ""
    },
    {
      "text": "Easterbrook, S.M., Beck, E.E., Goodlet, J.S., Plowman, L., Sharples, M., and Wood, C.C. A Survey of Empirical Studies of Conflict. CSCW: Cooperation or Conflict, (1993), 1--68.",
      "doi": ""
    },
    {
      "text": "Escobar, A. Encountering development: The making and unmaking of the Third World. Princeton University Press Princeton, 1995.",
      "doi": ""
    },
    {
      "text": "Ess, C. and Sudweeks, F. Culture and Computer-Mediated Communication: Toward New Understandings. Journal of Computer-Mediated Communication 11, 1 (2005), 179--191.",
      "doi": ""
    },
    {
      "text": "Ferguson, J. The anti-politics machine:\" development,\" depoliticization, and bureaucratic power in Lesotho. Cambridge University Press, 1990.",
      "doi": ""
    },
    {
      "text": "Ferguson, J. Governing Extraction: New Spatializations of Order and Disorder in Neoliberal Africa. In Global shadows: Africa in the neoliberal world order. Duke Univ Press, 2006.",
      "doi": ""
    },
    {
      "text": "Fisher, W.F. Doing good? The politics and antipolitics of NGO practices. Annual Review of Anthropology 26, 1 (1997), 439--464.",
      "doi": ""
    },
    {
      "text": "Gupta, A. Postcolonial Developments: Agriculture in the Making of Modern India. Duke Univ Press, 1998.",
      "doi": ""
    },
    {
      "text": "Hall, E.T. Beyond culture. Anchor Books, 1977.",
      "doi": ""
    },
    {
      "text": "Hayden, C. When nature goes public. Princeton Univ Press, Princeton, NJ, 2003.",
      "doi": ""
    },
    {
      "text": "Hofstede, G. and Hofstede, G. Cultures and Organizations: Software for the Mind. McGraw-Hill, 2005.",
      "doi": ""
    },
    {
      "text": "Lindtner, S., Mainwaring, S., Dourish, P., and Wang, Y. Situating Productive Play: Online Gaming Practices and Guanxi in China. In INTERACT 2009. 2009, 328--341.  ",
      "doi": "10.1007/978-3-642-03655-2_37"
    },
    {
      "text": "Marcus, A. and Gould, E.W. Crosscurrents: cultural dimensions and global Web user-interface design. interactions 7, 4 (2000), 32--46.  ",
      "doi": "10.1145/345190.345238"
    },
    {
      "text": "Marcus, G.E. Ethnography in/of the World System: The Emergence of Multi-Sited Ethnography. Annual Review of Anthropology 24, (1995), 95--117.",
      "doi": ""
    },
    {
      "text": "Marsden, G. Designing technology for the developing world. interactions 13, 2 (2006), 39--59.  ",
      "doi": "10.1145/1116715.1116743"
    },
    {
      "text": "Marsden, G., Maunder, A., and Parker, M. People are people, but technology is not technology. Philosophical Transactions of the Royal Society 366, (2008), 3795--3804.",
      "doi": ""
    },
    {
      "text": "Muller, M.J. Participatory Design: The Third Space in HCI. Handbook of HCI. Erlbaum, (2003). ",
      "doi": "10.5555/772072.772138"
    },
    {
      "text": "Parikh, T.S., Javid, P., Ghosh, K., and Toyama, K. Mobile phones and paper documents: Evaluating a new approach for capturing microfinance data in rural India. Proc. CHI 2006 (New York, NY), ACM Press, 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Philip, K. What is a technological author? The pirate function and intellectual property. Postcolonial Studies 8, 2 (2005), 199--218.",
      "doi": ""
    },
    {
      "text": "Ramachandran, D., Kam, M., Chiu, J., Canny, J., and Frankel, J.F. Social dynamics of early stage co-design in developing regions. Proc. CHI 2007 (San Jose CA), ACM Press, 1087--1096.  ",
      "doi": "10.1145/1240624.1240790"
    },
    {
      "text": "Satchell, C. and Dourish, P. Beyond the User: Use and Non-Use in HCI. Proc. OzCHI 2007 (Melbourne, Australia, Nov 2009), ACM Press, .  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Schain, M. The Marshall Plan: Fifty Years After. Palgrave Macmillan, New York, 2001.",
      "doi": ""
    },
    {
      "text": "Smith, A. The Alternative Technology Movement: An Analysis of its Framing and Negotiation of Technology Development. Human Ecology Review 12, 2 (2005), 106--119.",
      "doi": ""
    },
    {
      "text": "Srinivasan, R. and Shilton, K. The South Asian web: an emerging community information system in the South Asian diaspora. Proc. PDC 2006 (Trento, Italy), ACM Press, 125--133.  ",
      "doi": "10.1145/1147261.1147280"
    },
    {
      "text": "Suchman, L. Located accountabilities in technology production. Scand. J. Inf. Syst. 14, 2 (2002), 91--105. ",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Suchman, L. Striking Likeness to Difference. 4S/EASST, (2008).",
      "doi": ""
    },
    {
      "text": "Verran, H. and Christie, M. Digital Technologies and Aboriginal Knowledge Practice. (2006).",
      "doi": ""
    },
    {
      "text": "Winograd, T. Bringing design to software. ACM, New York, NY, USA, 1996. ",
      "doi": "10.1145/229868"
    }
  ]
}