{
  "doi": "10.1145/1753326.1753379",
  "title": "Newport: enabling sharing during mobile calls",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "343-352",
  "year": 2010,
  "badges": [],
  "abstract": "Newport is a collaborative application for sharing context (e.g. location) and content (e.g. photos and notes) during mobile phone calls. People can share during a phone call and sharing ends when the call ends. Newport also supports using a computer during a call to make it easier to share content from the phone or launch screen sharing if the caller is also at a computer. We describe Newport's system design and a formative evaluation with 12 participants to study their experience using Newport to share location, receive directions, share photos, and perform desktop sharing. Participants preferred using Newport to current methods for these tasks. They also preferred limiting sharing location to phone calls compared with publishing it continuously. Tying sharing to a phone call gives individuals a social sense of security, providing a mechanism for exchanging information with unknown people.",
  "tags": [
    "desktop sharing",
    "mobile phone",
    "sharing",
    "collaboration"
  ],
  "authors": [
    {
      "name": "Junius A. Gunaratne",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100658274",
      "orcid": "missing"
    },
    {
      "name": "A. J. Bernheim Brush",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81332491415/rel-imgonly/ajbrushlarge.jpg",
      "acmid": "81332491415",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Auletta, V., Blundo, C., Cristofaro, E. D., & Raimato, G. Performance evaluation of web services invocation over Bluetooth. Proc. PM2HW2N 2006, 1--8.  ",
      "doi": "10.1145/1163653.1163655"
    },
    {
      "text": "Barkhuus, L., Brown, B., Bell, M., Sherwood, S., Hall, M., & Chalmers, M. From awareness to repartee: sharing location within social groups. Proc. CHI 2008, 497--506.  ",
      "doi": "10.1145/1357054.1357134"
    },
    {
      "text": "Berry, L., Bartram, L., & Booth, K. S. Role-based control of shared application views. Proc. UIST 2005, 23--32.  ",
      "doi": "10.1145/1095034.1095039"
    },
    {
      "text": "Boyaci, O., & Schulzrinne, H. Application and desktop sharing. Proc. CoNEXT 2007, 1--2.  ",
      "doi": "10.1145/1364654.1364738"
    },
    {
      "text": "Chapanis, A., & Ochsman, R. N. (1972). Studies in interactive communication: I. The effects of four communication modes on the behavior of teams during cooperative problem-solving. Human Factors, 14, 487--509.",
      "doi": ""
    },
    {
      "text": "Cheverst, K., Mitchell, K., Davies, N., and Smith, G. (2000) Exploiting Context to Support Social Awareness and Social Navigation. SIGGROUP Bulletin, Vol. 21(3), pp. 43--48.  ",
      "doi": "10.1145/605647.605654"
    },
    {
      "text": "Churchill, E. F., Nelson, L., & Denoue, L. (2003). Multimedia fliers: information sharing with digital community bulletin boards. Communities and technologies (pp. 97--117). Kluwer, B.V. ",
      "doi": "10.5555/966263.966269"
    },
    {
      "text": "Congleton, B., Ackerman, M. S., & Newman, M. W. The ProD framework for proactive displays. Proc. UIST 2008, 221--230.  ",
      "doi": "10.1145/1449715.1449752"
    },
    {
      "text": "Consolvo, S., Smith, I. E., Matthews, T., LaMarca, A., Tabert, J., & Powledge, P. Location disclosure to social relations: why, when, & what people want to share. Proc. CHI 2005, 81--90.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Deosthali, A. (2008, November). Worldwide Bluetooth Semiconductor 2008--2012 Forecast. IDC Research. Retrieved August 3, 2009, from http://www.idc.com/getdoc.jsp?containerId=214945.",
      "doi": ""
    },
    {
      "text": "Enck, W., Traynor, P., McDaniel, P., & Porta, T. L. (2005). Exploiting open functionality in SMS-capable cellular networks. Proc. CCS 2005, 393--404.  ",
      "doi": "10.1145/1102120.1102171"
    },
    {
      "text": "Gartner Says Worldwide Smartphone Sales Grew 16 Percent in Second Quarter of 2008. Gartner Research. Retrieved July 14, 2009, from http://www.gartner.com/it/page.jsp?id=754112.",
      "doi": ""
    },
    {
      "text": "Garriss, S., Cáceres, R., Berger, S., Sailer, R., Doorn, L. V., & Zhang, X. Trustworthy and personalized computing on public kiosks. Proc. MobiSys 2008, 199--210.  ",
      "doi": "10.1145/1378600.1378623"
    },
    {
      "text": "Huang, A., Pulli, K., & Rudolph, L. Kimono: kiosk-mobile phone knowledge sharing system. Proc. MUM 2005, 142--149.  ",
      "doi": "10.1145/1149488.1149513"
    },
    {
      "text": "Karlson, A., Smith, G., Meyers, B., Robertson, G., and Czerwinski, M. (2008). Courier: A Collaborative Phone-Based File Exchange System. Microsoft Research Technical Report MSR-TR-2008 5.",
      "doi": ""
    },
    {
      "text": "Kun, L. M. A., & Marsden, G. Co-present photo sharing on mobile devices. Proc. MobileHCI 2007, 277--284.  ",
      "doi": "10.1145/1377999.1378019"
    },
    {
      "text": "Madhavapeddy, A., Scott, D., Tse, A., & Sharp, R. (2005). Audio Networking: The Forgotten Wireless Technology. IEEE Pervasive Computing, 4(3), 55--60.  ",
      "doi": "10.1109/MPRV.2005.50"
    },
    {
      "text": "Paek, T., Agrawala, M., Basu, S., Drucker, S., Kristjansson, T., Logan, R., et al. Toward universal mobile interaction for shared displays. Proc. CSCW 2004, 266--269.  ",
      "doi": "10.1145/1031607.1031649"
    },
    {
      "text": "Sadun, E. (2009, March 1). Consumers, not providers, ready for ubiquitous cellular data. Ars Technica. Retrieved August 3, 2009, from http://arstechnica.com/telecom/news/2009/03/going-ubiquitous-with-cellular-data.ars.",
      "doi": ""
    },
    {
      "text": "Sarvas, R., Oulasvirta, A., & Jacucci, G. Building social discourse around mobile photos: a systemic perspective. Proc. MobileHCI 2005, 31--38.  ",
      "doi": "10.1145/1085777.1085783"
    },
    {
      "text": "Sellen, A., Eardley, R., Izadi, S., & Harper, R. The whereabouts clock: early testing of a situated awareness device. In extended abstracts CHI 2006, 1307--1312.  ",
      "doi": "10.1145/1125451.1125694"
    },
    {
      "text": "Voida, S., Edwards, W. K., Newman, M. W., Grinter, R. E., & Ducheneaut, N. Share and share alike: exploring the user interface affordances of file sharing. Proc. CHI 2006, 221--230.  ",
      "doi": "10.1145/1124772.1124806"
    },
    {
      "text": "Wiltse, H., & Nichols, J. PlayByPlay: collaborative web browsing for desktop and mobile devices. Proc. CHI 2009, 1781--1790.  ",
      "doi": "10.1145/1518701.1518975"
    }
  ]
}