{
  "doi": "10.1145/1753326.1753654",
  "title": "Protractor: a fast and accurate gesture recognizer",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2169-2172",
  "year": 2010,
  "badges": [],
  "abstract": "Protractor is a novel gesture recognizer that can be easily implemented and quickly customized for different users. Protractor uses a nearest neighbor approach, which recognizes an unknown gesture based on its similarity to each of the known gestures, e.g., training samples or examples given by a user. In particular, it employs a novel method to measure the similarity between gestures, by calculating a minimum angular distance between them with a closed-form solution. As a result, Protractor is more accurate, naturally covers more gesture variation, runs significantly faster and uses much less memory than its peers. This makes Protractor suitable for mobile computing, which is limited in processing power and memory. An evaluation on both a previously published gesture data set and a newly collected gesture data set indicates that Protractor outperforms its peers in many aspects.",
  "authors": [
    {
      "name": "Yang Li",
      "institution": "Google Research, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Kurtenbach, G. and Buxton, W. The limits of expert performance using hierarchical marking menus. CHI'93. 1993. p. 35--42. ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Rubine, D., Specifying gestures by example. ACM SIGGRAPH Computer Graphics, 1991. 25(4): p. 329--337.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "Russell, S. and Norvig, P., Artificial Intelligence: A Modern Approach. 2 ed. 2002. Prentice Hall. ",
      "doi": "10.5555/773294"
    },
    {
      "text": "Wobbrock, J.O., Wilson, A. and Li, Y., Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes, UIST'07. 2007. p. 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Zhai, S. and Kristensson, P.-O. Shorthand writing on stylus keyboard. CHI'03. 2003. p. 97--104.  ",
      "doi": "10.1145/642611.642630"
    }
  ]
}