{
  "doi": "10.1145/1753326.1753498",
  "title": "Touch-display keyboards: transforming keyboards into interactive surfaces",
  "published": "2010-04-10",
  "proctitle": "CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1145-1154",
  "year": 2010,
  "badges": [],
  "abstract": "In spite of many advances in GUI workstations, the keyboard has remained limited to text entry and basic command invocation. In this work, we introduce the Touch-Display Keyboard (TDK), a novel keyboard that combines the physical-ergonomic qualities of the conventional keyboard with dynamic display and touch-sensing embedded in each key. The TDK effectively transforms the keyboard into an interactive surface that is seamlessly integrated with the interaction space of GUIs, extending graphical output, mouse interaction and three-state input to the keyboard. This gives rise to an entirely new design space of interaction across keyboard, mouse and screen, for which we provide a first systematic analysis in this paper. We illustrate the emerging design opportunities with a host of novel interaction concepts and techniques, and show how these contribute to expressiveness of GUIs, exploration and learning of keyboard interfaces, and interface customization across graphics display and physical keyboard.",
  "authors": [
    {
      "name": "Florian Block",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319488693",
      "orcid": "missing"
    },
    {
      "name": "Hans Gellersen",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616827",
      "orcid": "0000-0003-2233-2121"
    },
    {
      "name": "Nicolas Villar",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100599166",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fingerworks. http://www.fingerworks.com/.",
      "doi": ""
    },
    {
      "text": "OLED Display Keyboard, United Keys Inc. http://www.unitedkeys.com/.",
      "doi": ""
    },
    {
      "text": "Optimus Maximus Keyboard, ArtLebedev Studios. http://www.artlebedev.com/everything/optimus/.",
      "doi": ""
    },
    {
      "text": "W. Fallot-Burghardt, M. Fjeld, C. Speirs, S. Ziegenspeck, H. Krueger, and T. L¨aubli. Touch&type: a novel pointing device for notebook computers. In Proc. NordiCHI '06, pages 465--468, 2006.  ",
      "doi": "10.1145/1182475.1182538"
    },
    {
      "text": "S. Greenberg and M. Boyle. Customizable physical interfaces for interacting with conventional applications. In Proc. UIST '02, pages 31--40, 2002.  ",
      "doi": "10.1145/571985.571991"
    },
    {
      "text": "D. Grolaux, J. Vanderdonckt, and P.V. Roy. Attach me, detach me, assemble me like you work. In Proc. INTERACT'05, pages 198--212.",
      "doi": ""
    },
    {
      "text": "T. Grossman, P. Dragicevic, and R. Balakrishnan. Strategies for accelerating on-line learning of hotkeys. In Proc. CHI 2007, pages 1591--1600, 2007.  ",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "B. Hartmann, M. Ringel Morris, H. Benko, and A.D. Wilson. Augmenting interactive tables with mice & keyboards. In Proc. UIST '09, 2009.  ",
      "doi": "10.1145/1622176.1622204"
    },
    {
      "text": "M. Helander. Handbook of Human Computer Interaction. North-Holland, 1988. ",
      "doi": "10.5555/549940"
    },
    {
      "text": "E. Hoggan, S.A. Brewster, and J. Johnston. Investigating the effectiveness of tactile feedback for mobile touchscreens. In Proc. CHI '08, pages 1573--1582, 2008.  ",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "P. Holleis, J. HAkkilA, and J. Huhtala. Studying applications for touch-enabled mobile phone keypads. In Proc. TEI'08, pages 41--44, 2008.  ",
      "doi": "10.1145/1347390.1347396"
    },
    {
      "text": "A. Howes, S.J. Payne, and A. Woodward. The trouble with shortcuts. In CHI '00 Extended Abstracts, pages 267--268, 2000.  ",
      "doi": "10.1145/633292.633448"
    },
    {
      "text": "P. Isokoski. A minimal device-independent text input method. Technical Report A-1999-14, Department of Computer Science, University of Tampere, 1999.",
      "doi": ""
    },
    {
      "text": "D.M. Lane, H.A. Napier, S.C. Peres, and A. Sandor. Hidden costs of graphical user interfaces: Failure to make the transition from menus and icon toolbars to keyboard shortcuts. In IJHCI, 18(2), pages 133--144, 2005.",
      "doi": ""
    },
    {
      "text": "H. McLoone, K. Hinckley, and E. Cutrell. Binamual interaction on the microsoft office keyboard. In Proc. Interact '03, pages 49--56, 2003.",
      "doi": ""
    },
    {
      "text": "D.L. Odell, R.C. Davis, A. Smith, and P.K. Wright. Toolglasses, marking menus, and hotkeys: A comparison of one and two-handed command selection techniques. In Proc. Graphics Interface 2004, pages 17--24, 2004. ",
      "doi": "10.5555/1006058.1006061"
    },
    {
      "text": "J. Rekimoto, T. Ishizawa, C. Schwesig, and H. Oba. Presense: interaction techniques for finger sensing input devices. In Proc. UIST '03, pages 203--212, New York, NY, USA, 2003. ACM.  ",
      "doi": "10.1145/964696.964719"
    },
    {
      "text": "J. Rekimoto, B. Ullmer, and H. Oba. Datatiles: a modular platform for mixed physical and graphical interactions. In Proc. CHI '01, pages 269--276, 2001.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "H. Roeber, J. Bacus, and C. Tomasi. Typing in thin air: the canesta projection keyboard -- a new method of interaction with electronic devices. In CHI Extended Abstracts 2003, pages 712--713, 2003.  ",
      "doi": "10.1145/765891.765944"
    },
    {
      "text": "A. Sears. Improving touchscreen keyboards: Design issues and a comparison with other devices. In Interacting with Computers, 3(3), pages 253--269, 1991.",
      "doi": ""
    },
    {
      "text": "W. Stuerzlinger, O. Chapuis, D. Phillips, and N. Roussel. User interface fac¸ades: towards fully adaptable user interfaces. In Proc. UIST '06, pages 309--318, 2006.  ",
      "doi": "10.1145/1166253.1166301"
    },
    {
      "text": "C. Tomasi, A. Rafii, and I. Torunoglu. Full-size projection keyboard for handheld devices. In Com. of the ACM, 46(7), pages 70--75, 2003.  ",
      "doi": "10.1145/792704.792732"
    },
    {
      "text": "M. Weiss, J. Wagner, Y. Jansen, R. Jennings, R. Khoshabeh, J.D. Hollan, and J. Borchers. Slap widgets: Bridging the gap between virtual and physical controls on tabletops. In Proc. CHI '09, pages 481--490, 2009.  ",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "J. Zhang and D.A. Norman. Representations in distributed cognitive tasks. In Cognitive Science, 18, pages 87--122, 1994.",
      "doi": ""
    }
  ]
}