{
  "doi": "10.1145/800276.810969",
  "title": "An integral approach to user assistance",
  "published": "1981-05-21",
  "proctitle": "CHI '81: Proceedings of the Joint Conference on Easier and More Productive Use of Computer Systems. (Part - II): Human Interface and the User Interface - Volume 1981",
  "pages": "98-104",
  "year": 1981,
  "badges": [],
  "abstract": "User assistance is incorporated into some of today's interactive computing systems. The assistance is rarely consistent in its accuracy, availability, accessibility or style. In this paper we discuss general requirements for assistance systems and a characterization of different types of assistance which may be provided users. A technique for integrating the design of an assistance system with the design of an interactive computing system is described. The technique satisfies the expressed requirements and greatly facilitates the development of assistance systems. Finally, a brief discussion of techniques for evaluating the quality and effectiveness of an interactive assistance system is presented.",
  "authors": [
    {
      "name": "Robert S Fenchel",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100252628",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "E. Organick, The MULTICS System - An Examination of its Structure, MIT Press, Cambridge, Mass. 1972. ",
      "doi": "10.5555/1095599"
    },
    {
      "text": "D. Bobrow, J. Burchfiel, D. Murphy and R. Tomlanson, \"TENEX, a Paged Time Sharing System for the PDP-10\", CACM, v. 15, no 3. pp. 135-143, March 1973.  ",
      "doi": "10.1145/361268.361271"
    },
    {
      "text": "Englebart, Watson and Norton, \"Augmented Knowledge Workshop\", AFIPS National Computer Conference Proceedings, v. 42, pp. 221-227, 1973.",
      "doi": ""
    },
    {
      "text": "J. Rothenberg, \"An Intelligent Tutor: On-line Documentation and Help for a Military Message Service\", ISI/RR-74-26, USC-ISI, May 1975.",
      "doi": ""
    },
    {
      "text": "W. Teitelman et al., Interlisp Reference Manual, Xerox Palo Alto Research Center, Palo Alto, Calif., CSC 77-3, March 1977.",
      "doi": ""
    },
    {
      "text": "J. Nievergelt and J. Weydert, \"Site, Modes, and Trails: Telling the user of an interactive system where he is, what he can do, and how to get to places\", IFIP W.G. 5.2 Workshop on Methodology of Interaction, Seillac, France, May 1979.",
      "doi": ""
    },
    {
      "text": "B. Schneiderman, Software Psychology, Winthrop Publishers Inc., Cambridge, Massachusetts, 1980.",
      "doi": ""
    },
    {
      "text": "P. Hayes, E. Ball, R. Reddy, \"Breaking the Man-Machine Communication Barrier\", Computer Magazine, v. 14, no. 3, March 1981.",
      "doi": ""
    },
    {
      "text": "D. Cheriton, \"Man-Machine Interface Design for Timesharing Systems\", ACM Annual Conference, pp. 362-366, 1976.  ",
      "doi": "10.1145/800191.805617"
    },
    {
      "text": "R. Fenchel, Integral Help for Interactive Systems, UCLA Computer Science Department, Report No.: UCLA-ENG-8051, September 1980.",
      "doi": ""
    },
    {
      "text": "G. H. Walther and H. F. O'Neil, Jr., \"On-line user-computer interface&mdash;The effects of interface flexibility, terminal type, and experience on performance\". AFIPS National Computer Conference Proceedings. v. 48. pp. 379-384, 1979.",
      "doi": ""
    },
    {
      "text": "E. Shortliffe, Computer-based medical consultations, MYCIN. American Elsevier Publishing Company. NY. 1976.",
      "doi": ""
    },
    {
      "text": "R. Fenchel. \"SARA System Tutorial Reference Manual\". UCLA Computer Science Department. December 1979.",
      "doi": ""
    },
    {
      "text": "S. Hiltz, M. Turoff, \"Lessons learned from EIES\", Presented at the Joint Conference on Easier and More Productive Use of Computing Systems, May 20-22, Ann Arbor, MI., 1981.",
      "doi": ""
    },
    {
      "text": "F. L. De Remer, \"Simple LR(k) Grammars\", CACM, v. 14 no. 7, pp. 453-460, July 1971.  ",
      "doi": "10.1145/362619.362625"
    },
    {
      "text": "D. F. Martin, \"The U.C.L.A. SLR(1) and LL(1) Grammar Analysis Programs\", UCLA Computer Science Department, 1975.",
      "doi": ""
    },
    {
      "text": "R. Fenchel, G. Estrin, \"Self-Describing System Using Integral Help\", to appear in IEEE Transactions on Systems, Man and Cybernetics, March-April 1982.",
      "doi": ""
    },
    {
      "text": "A. Wasserman, S. Stinson, \"A Specification Method for Interactive Information Systems\", Proceedings of the Fifth International Conference on Software Engineering, San Diego, Calif., pp. 68-79, 1981.",
      "doi": ""
    },
    {
      "text": "S. Feyock, \"Transition diagram-based CAI/HELP systems\", Int. J. Man-Machine Studies, 9, pp. 399-413, 1977.",
      "doi": ""
    },
    {
      "text": "G. Estrin, \"A methodology for design of digital systems Supported by SARA at the age of one\", AFIPS National Computer Conference Proceedings, v. 47, pp. 313-324, June 1978.",
      "doi": ""
    },
    {
      "text": "T. Moran, \"An Applied Psychology of the User\", ACM Computing Surveys, v 13., no. 1, pp. 1-11, March 1981.  ",
      "doi": "10.1145/356835.356836"
    },
    {
      "text": "W. S. Dzida, S. Herda and W. D. Itzfeldt, \"User-Perceived Quality of Interactive Systems\", IEEE Transactions on Software Engineering. v. SE-4, no. 4, pp. 270-276, July 1978.",
      "doi": "10.1109/TSE.1978.231511"
    }
  ]
}