{
  "doi": "10.1145/800276.810996",
  "title": "Uses of CONFER at Wayne State University (abstract only)",
  "published": "1981-05-21",
  "proctitle": "CHI '81: Proceedings of the Joint Conference on Easier and More Productive Use of Computer Systems. (Part - II): Human Interface and the User Interface - Volume 1981",
  "pages": "",
  "year": 1981,
  "badges": [],
  "abstract": "CONFER is used by a variety of organizations which have no\ndirect contact with any MTS site (the CONFER host computer system).\nIn many cases, the main contact of the CONFER user is with the\nthird party vendor or consultant who is supporting the networking\neffort. Several problems arise when the third party relationship is\nnot broadened to include the institutional consulting and\ndocumentation efforts. Such problems include:1. Overload on the\ntime of the third-party consultant.2. Production of custom\ndocumentation which parallels the institutional documentation.3.\nUser perceptions that they are not \"ready\" for institutional\ndocumentation.4. Development of abbreviated cognitive maps of the\nsystem and its user network.5. Users exchange superstitious views\nof how the system works.While it is not yet clear that the\nabsorption of third-party, mediated networks will solve such\nproblems, it is an obvious first step to a solution.\nMTS Help Facility\nA version of CONFER is tentatively planned for use as the\nprincipal Help Facility at WSU. A subset of CONFER capabilities\nwill be employed to decrease demands on the system.\nFeatures of the Help Facility will include agenda string\nsearches, execution of computer assisted instruction lessons from\nwithin tbe CONFERence, a \"suggestion box\" facility, and user\nmodelling features intended to decrease user frustration and\nmaximize efficiency. Existing help files will be called from the\nHelp Facility to increase the redundancy of available help to the\nuser.\nThe agenda used will be multi-dimensional, allowing the user to\nsearch for help within subject areas, type of information and skill\nlevel. For example, the user would be able to view all items which\nserve as tutorials on statistical packages with the CONFER command:\nAGENDA TUTORIALS+STATISTICS. Similarly, the user will be able to\nsearch item descriptors or text for character strings, such as\nusing WHICH \"SPSS\" to locate all items dealing with SPSS.\nRequests for help will be sent directly to various CSC\ndepartments, and responded to either via CONFER or telephone. User\nsuggestions and requests will be screened on a continuing basis by\nCSC staff, and changes to the information contained in each item\nwill be made as a result of these suggestions. Materials developed\nby users will be solicited for inclusion in the Help Facility.",
  "authors": [
    {
      "name": "Alan McCord",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100139227",
      "orcid": "missing"
    }
  ],
  "references": []
}