{
  "doi": "10.1145/800276.810956",
  "title": "How shall we evaluate prototype natural language processors?",
  "published": "1981-05-21",
  "proctitle": "CHI '81: Proceedings of the Joint Conference on Easier and More Productive Use of Computer Systems. (Part - II): Human Interface and the User Interface - Volume 1981",
  "pages": "21-26",
  "year": 1981,
  "badges": [],
  "abstract": "Recent years have seen important advances in computational linguistics and artificial intelligence. Although many problems remain, the goal of providing limited English-processing facilities for non-technical computer users is within sight. By the end of the decade, numerous systems providing limited coverage of \"natural language\" will be available for business and home use. Several systems (e.g. TQA [16]) have already become operational. One system (ROBOT [7]) has been supporting natural language inputs in a dozen or so different commercial database applications for at least three years. Many other systems have been developed to the prototype stage and will soon be able to be transferred, with varying degrees of effort, from a research to a production environment. Each system tends to provide special features of its own, and the future prospects for database, office, instructional, and other environments are quite exciting.",
  "authors": [
    {
      "name": "Bruce W. Ballard",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100634847",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ballard, Bruce, \"A Methodology for Evaluating Near-Prototype Natural Language Processors,\" Tech. Report TR-81-4, Dept. of Computer and Info. Science, Ohio State University, May, 1981.",
      "doi": ""
    },
    {
      "text": "Biermann, A., Ballard, B. and Holler, A., \"An Experimental Study of Natural Language Programming,\" CS-1979-5, Dept. of Computer Science, Duke University, July, 1979.",
      "doi": ""
    },
    {
      "text": "Bobrow, D., Kaplan, R., Kay, M., Norman, D., Thompson, H. and Winograd, T., \"GUS - A Frame-Driven Dialog System,\" Artificial Intelligence, August, 1977.",
      "doi": ""
    },
    {
      "text": "Brooks, Fred, The Mythical Man-Month, Academic Press, 1975. ",
      "doi": "10.5555/207583"
    },
    {
      "text": "Brooks, R.E., \"Studying Programmer Behavior Experimentally: The Problem of Proper Methodology,\" CACM, April 1980.  ",
      "doi": "10.1145/358841.358847"
    },
    {
      "text": "Damerau, Fred, \"The Transformational Query Answering System (TQA) Operational Statistics,\" IBM Research Report RC7739, June, 1979.",
      "doi": ""
    },
    {
      "text": "Harris, Larry, \"The ROBOT System: Natural Language Processing Applied to Data Base Query,\" Proceedings of the 1978 ACM National Conference.  ",
      "doi": "10.1145/800127.804087"
    },
    {
      "text": "Heidorn, George, \"Natural Language Dialogue for Managing on On-Line Calendar,\" IBM Research Report RC7447, August, 1978.",
      "doi": ""
    },
    {
      "text": "Hendrix, Gary, \"Human Engineering for Applied Natural Language Processing,\" Fifth Int. Conf. on Artificial Intelligence, Volume I, August, 1977, pp. 183-191.",
      "doi": ""
    },
    {
      "text": "Hershman, R., Kelly, R. and Miller, H., \"User Performance with a Natural Language Query System for Command Control,\" NPRDC TR 79-7, Navy Personnel Research and Development Center, San Diego, California, January, 1979.",
      "doi": ""
    },
    {
      "text": "Hill, I.D., \"Wouldn't It Be Nice if We Could Program in Ordinary English - Or Would It?\", the Computer Bulletin, June, 1972.",
      "doi": ""
    },
    {
      "text": "Hoare, C.A.R., \"The Emperor's Old Clothes\" (1980 Turing Award Lecture), CACM, February, 1981.  ",
      "doi": "10.1145/358549.358561"
    },
    {
      "text": "Hobbs, Jerry, \"Pronoun Resolution,\" Research Report 76-1, Dept. of Computer Science, CUNY, August, 1976.",
      "doi": ""
    },
    {
      "text": "Ledgard, H., Whiteside, J., Singer, A. and Seymour, W., \"The Natural Language of Interactive Systems,\" CACM, October, 1980.  ",
      "doi": "10.1145/359015.359018"
    },
    {
      "text": "Morris, John, \"Natural Language Systems: A User's View,\" SISTM Quarterly and Brain Theory Newsletter, 1979.",
      "doi": ""
    },
    {
      "text": "Plath, Warren, \"REQUEST: A Natural Language Question-Answering System,\" IBM Journal of Research and Development, July, 1976.",
      "doi": ""
    },
    {
      "text": "Sammet, Jean, \"The Use of English as a Programming Language,\" CACM, March, 1966.  ",
      "doi": "10.1145/365230.365274"
    },
    {
      "text": "Shneiderman, Ben, \"Natural vs. Precise Languages for Human Operation of Computers: Research Issues and Experimental Approaches,\" Eighteenth Annual Meeting of the ACL, June, 1980.  ",
      "doi": "10.3115/981436.981478"
    },
    {
      "text": "Shneiderman, Ben, Software Psychology, Winthrop Publishers, Cambridge, Mass., 1980.",
      "doi": ""
    },
    {
      "text": "Sondheimer, Norman, \"Why don't we - How can we - When will we - Have Practical English Language Interfaces?\", Technical Report H00002, Sperry Univac, Blue Bell, Pa., November, 1978.",
      "doi": ""
    },
    {
      "text": "Tennant, Harry, \"Experience with the Evaluation of Natural Language Question Answerers,\" Working Paper 18, Advanced Automation Group, Coordinated Science Lab, Univ. of Illinois, January, 1979.",
      "doi": ""
    },
    {
      "text": "Thompson, Fred B. and Thompson, Bozena H., \"Practical Natural Language Processing: the REL System as Prototype,\" in Advances in Computers, M. Rubinoff and M. Yovits, eds., Academic Press, New York, 1975.",
      "doi": ""
    }
  ]
}