{
  "doi": "10.1145/365024.365111",
  "title": "Locus of feedback control in computer-based tutoring: impact on learning rate, achievement and attitudes",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "245-252",
  "year": 2001,
  "badges": [],
  "abstract": "The advent of second-generation intelligent computer tutors raises an important instructional design question: when should tutorial advice be presented in problem solving? This paper examines four feedback conditions in the ACT Programming Tutor. Three versions offer the student different levels of control over error feedback and correction: (a) immediate feedback and immediate error correction; (b) immediate error flagging and student control of error correction; (c) feedback on demand and student control of error correction. A fourth, No-tutor condition offers no stepby-step problem solving support. The immediate feedback group with greatest tutor control of problem solving yielded the most efficient learning. These students completed the tutor problems fastest, and the three tutor-supported groups performed equivalently on tests. Questionnaires revealed little student preference among the four conditions. These results suggest that students will need explicit guidance to benefit from learning opportunities that arise when they have greater control over tutorial assistance.",
  "authors": [
    {
      "name": "Albert T. Corbett",
      "institution": "Human Computer Interaction Institute, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100192841",
      "orcid": "missing"
    },
    {
      "name": "John R. Anderson",
      "institution": "Psychology & Computer Science Departments, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363598414",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R., Conrad, F.G. and Corbett, A.T. (1989). Skill acquisition and the LISP Tutor. Cognitive Science, 13, 467-505.",
      "doi": ""
    },
    {
      "text": "Anderson, J.R., Corbett, A.T., Koedinger, K.R. and Pelletier, R. (1995). Cognitive tutors: Lessons learned. Journal of the Learning Sciences, 4, 167-207.",
      "doi": ""
    },
    {
      "text": "Anderson, J.R., Corbett, A.T. and Reiser, B.J. (1987) Essential Lisp. Reading, MA: Addison-Wesley. ",
      "doi": "10.5555/16142"
    },
    {
      "text": "Anderson, J.R. and Lebiere, C. (1998). The atomic components of thought. Mahwah, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Bangert-Drowns, R.L., Kulik, C.C., Kulik, J.A. &amp; Morgan, M. (1991). The instructional effect of feedback in test-like events. Review of Educational Research, 61, 213-238.",
      "doi": ""
    },
    {
      "text": "Bielaczyc, K., Pirolli, P.L., and Brown, A.L. (1995). Training in self-regulation strategies: Investigating the effects of knowledge acquisition activities on problem solving. Cognition and Instruction, 13, 221-252.",
      "doi": ""
    },
    {
      "text": "Corbett, A.T. and Anderson, J.R. (1995). Knowledge tracing: Modeling the acquisition of procedural knowledge. User Modeling and User-Adapted Interaction, 4, 253-278.",
      "doi": ""
    },
    {
      "text": "Corbett, A.T. and Trask, H. (2000). Instructional interventions in computer-based tutoring: Differential impact on learning time and accuracy. CHI 2000 Conference Proceedings: The Future is Here, 97-104.  ",
      "doi": "10.1145/332040.332412"
    },
    {
      "text": "Chi, M.T.H., Bassok, M., Lewis, M, Reimann, P., Glaser, R. (1989). Self-explanations: How students study and use examples in learning to solve problems. Cognitive Science, 13, 145-182.",
      "doi": ""
    },
    {
      "text": "Fox, B. (1991). Cognitive and interactional aspects of correction in tutoring. In P. Goodyear (ed.) Teaching knowledge and intelligent tutoring. Norwood, NJ: Ablex.",
      "doi": ""
    },
    {
      "text": "Kulhavy, R.W. (1977). Feedback in written instruction. Review of Educational Research, 47, 211-232.",
      "doi": ""
    },
    {
      "text": "Kulik, J.A. and Kulik, C.C. (1988). Timing of feedback and verbal learning. Review of Educational Research, 58, 79-97.",
      "doi": ""
    },
    {
      "text": "Lepper, M.R., Woolverton, M., Mume, D.L. and Gurtner, J. (1993). Motivational techniques of expert human tutors: Lessons for the design of computer-based tutors. In S. Lajoie &amp; S. Derry (eds.) Computers a cognitive tools. Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Merrill, D.C., Reiser, B.J., Ranney, M. and Trafton, J.G. (1992). Effective tutoring techniques: A comparison of human tutors and intelligent tutoring systems. Journal of the Learning Sciences, 2, 277-305.",
      "doi": ""
    },
    {
      "text": "Munro, A. Fehling, M.R. and Towne, D.M. (1985). Instruction intrusiveness in dynamic simulation training. Journal of Computer-Based Instruction, 12, 50-53. ",
      "doi": "10.5555/7095.7100"
    },
    {
      "text": "Pressey, S.L. (1926). A simple apparatus which gives tests and scores - and teaches. School and Society, 23 (586), 373-376.",
      "doi": ""
    },
    {
      "text": "Schmidt, R.A., Young, D.E., Swinnen, S. and Shapiro, D.C. (1989). Summary knowledge results for skill acquisition: Support for the guidance hypothesis. Journal of Experimental Psychology: Learning, Memory and Cognition, 15, 352-359.",
      "doi": ""
    },
    {
      "text": "Schofield, J.W. (1995). Computers and classroom culture. Cambridge, England: Cambridge University Press. ",
      "doi": "10.5555/526373"
    },
    {
      "text": "Schooler, L.J. and Anderson, J.R. (1990). The disruptive potential of immediate feedback. The Proceedings of the Twelfth Annual Conference of the Cognitive Science Society, Cambridge, MA.",
      "doi": ""
    }
  ]
}