{
  "doi": "10.1145/365024.365038",
  "title": "Improving the performance of the cyberlink mental interface with “yes / no program”",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "69-76",
  "year": 2001,
  "badges": [],
  "abstract": "We summarise the results of the first studies to investigate the Cyberlink brain body interface as an assistive technology. Three phases of studies and a contextual inquiry were performed with a range of users.  A focus group was formed from brain-injured users with locked-in syndrome who have no other method of communication or control of a computer than the Cyberlink. Versions of a Yes/No program were then created to allow communication and have achieved some success with the focus group.  The purpose of this paper is to discuss how this program has been improved and what steps need to be taken to create communication programs for persons with severe motor impairment.  As a result of our experiences, we have been able to develop a set of design guidelines for brain-body  interface operated Yes/No programs.  These are presented and justified on the basis of our experiences.  We also raise some general issues for assistive technologies of this nature.",
  "tags": [
    "mental interface",
    "cyberlink",
    "ody interface",
    "locked in syndrome",
    "assistive technology"
  ],
  "authors": [
    {
      "name": "Eamon Doherty",
      "institution": "School of Computing, Engineering and Technology, University of Sunderland, P.O. Box 299, Sunderland, SR6 OYN, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100175531",
      "orcid": "missing"
    },
    {
      "name": "Gilbert Cockton",
      "institution": "School of Computing, Engineering and Technology, University of Sunderland, P.O. Box 299, Sunderland, SR6 OYN, UK",
      "img": "/do/10.1145/contrib-81100175348/rel-imgonly/81100175348.jpg",
      "acmid": "81100175348",
      "orcid": "missing"
    },
    {
      "name": "Chris Bloor",
      "institution": "School of Computing, Engineering and Technology, University of Sunderland, P.O. Box 299, Sunderland, SR6 OYN, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100198998",
      "orcid": "missing"
    },
    {
      "name": "Dennis Benigno",
      "institution": "Trustee of Neurological Institute of N.J., Parent of Focus Group Member, 270 Hazel Avenue, Clifton, New Jersey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100643688",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barke, R., (1986), \"Science, Technology, and Public Policy,\" CQ Press, Washington D.C. USA, page 130",
      "doi": ""
    },
    {
      "text": "Berg, C., Junker, A., Rothman, A., Leininger, R. (1998) The Cyberlink Interface: Development of A Hands-Free Continuous/Discrete Multi-Channel Computer Interface, Brain Actuated Technologies, Incorporated 139 East Davis Street, Yellow Springs, Ohio 45387, USA",
      "doi": ""
    },
    {
      "text": "Berkow, R., Beers, M., Bogin, R., Fletcher, A., (1997) \"The Merck Manual of Medical Information,\" Merck Research Laboratories, Whitehouse Station, NJ, p. 372 Bevan,N.(1999)http://www.usability.serco.com/msexplor er/index.html",
      "doi": ""
    },
    {
      "text": "Beven,N.,(1999)www.usability.serco.com/msexplorer/ind ex.html",
      "doi": ""
    },
    {
      "text": "Bickford, P., (1997) \"Interface Design,\" Academic Press, San Diego CA, pages 265-270, 287 -292",
      "doi": ""
    },
    {
      "text": "Brain Injury Association Fact Sheet, available on request from 105 N. Alfred S., Alexandria, Va., 22314, USA",
      "doi": ""
    },
    {
      "text": "Brooks, H., (1984) \"The Resolution of Technically Intensive Public Policy Disputes,\" Science, Technology, and Human Values, Vol. 9, (Winter), Page 46",
      "doi": ""
    },
    {
      "text": "Chatrian, G., Bergamasco, B., Bricolo, B., Frost, J., Prior, P., (1996) \"IFCN recommended standards for electrophysiological monitoring in comatose and other unresponsive states. Report on IFCN committee,\" Electoencephalography and Clinical Neurophysiology, vol. 99, pages 103-122",
      "doi": ""
    },
    {
      "text": "Cole, E., Dehdashti, P., (1992)\"Interface Design for Individuals with Mild Learning Disabilities from Traumatic Brain Injury,\" CHI 1992 Proceedings, page 16  ",
      "doi": "10.1145/1125021.1125036"
    },
    {
      "text": "Davis, B., Personal Interviews August 2000, Brucedav@erols.com",
      "doi": ""
    },
    {
      "text": "Doherty, E, Bloor, C., Cockton, G(1999) The \"Cyberlink\" Brain Body Interface as an Assistive Technology for Traumatically Brain Injured Persons, CyberPsychology and Behavior, Liebert Publications, Larchmont, N.Y., 249-259",
      "doi": ""
    },
    {
      "text": "Doherty, E, Bloor, C., Cockton, G., Engel, W., Rizzo, J., Berg, C., (1999) Cyberlink - An Interface for Quadriplegic and Non - Verbal People, Pages 237-249, Conference Proceedings, CT99 3 rd International Cognitive Technology, Procs at www.cogtech.org/CT99",
      "doi": ""
    },
    {
      "text": "Doherty, E., Bloor, C., Cockton, G., Engel, W., Benigno, D., \"Yes/No - A Mind Operated device for Severely Motor Impaired Persons\" (2000), Computers Helping People with Special Needs, ICCHP 2000, Proc. 7th Int. Conf. on Computers Helping People with Special Needs, July 17-21,2000 Karlsruhe, Germany",
      "doi": ""
    },
    {
      "text": "Doherty, E., Cockton, G., Stephenson, G., \"Using a Cyberlink Mental Interface for Relaxation and Controlling a Robot,\" September 2000 ACM SIGCAPH  ",
      "doi": "10.1145/569309.569310"
    },
    {
      "text": "Doherty, E. Cockton, G., Bloor, C., Benigno, D., \"A Study Examining the Performance of the Cyberlink Mental Interface,\" ACM SIGBIO (awaiting publication)  ",
      "doi": "10.1145/370954.370958"
    },
    {
      "text": "Doherty, Rizzo J., Junker, A., Walters, J. Hermann, D., (to appear) \"Effect of Cyberlink on One Adult Male with Cerebral Palsy's Blood Pressure and Pulse\" Cognitive Technology.",
      "doi": ""
    },
    {
      "text": "Doherty, E., Cockton, G., Bloor, C., Benigno, D., (2000), \"Mixing Oil and Water: Transcending Method Boundaries in Assistive Technology for Traumatic Brain Injury\" Conference on Universal Usability Proceedings, Washington D.C., Nov 15-17  ",
      "doi": "10.1145/355460.355544"
    },
    {
      "text": "Doherty, E., Cockton, G., Bloor, C., Engel, W., Rizzo, J., (to appear) \"A Cyberlink Helmet Study to Improve Usability\" ICCIT 2001 Conference Proceedings, Montclair, N.J.",
      "doi": ""
    },
    {
      "text": "Engel, Walter, Personal Interviews, August 2000, 13 Brookside Avenue, Engelwood, NJ, 07631",
      "doi": ""
    },
    {
      "text": "Furness T, \"The Super Cockpit and its Human Factors Challenges,\" Proc. Human Factors Society 30 th Annual Meeting, 1986, Pages 48-52,",
      "doi": ""
    },
    {
      "text": "Iskowitz M., (1999) \"Finding the Right Combination for Communication,\" Advance for Speech-Language Pathologists &amp; Audiologists, August 9,1999, page 12-13",
      "doi": ""
    },
    {
      "text": "Junker A., United States Patent 5,692,517 Dec.2,1997",
      "doi": ""
    },
    {
      "text": "Katz, R., Haig, A., Clark, B, Rocco, J., DiPaola, (1992) \"Long-Term Survival, Prognosis and Life Care Planning for 29 Patients with Chronic Locked - In Syndrome\" Archives Physical Medical Rehabilitation Vol 73, May 1992 pages 403-405",
      "doi": ""
    },
    {
      "text": "Maus-Clum, N., Cole, M., McCort, T., Eifler, D., (1991) Journal of Neuroscience, October 1991, Vol. 23(4), p273- 85",
      "doi": ""
    },
    {
      "text": "Metz, S., Hoffman, B., \"Mind Operated Devices,\" Cognitive Technology, 2(1), 69-74, 1997",
      "doi": ""
    },
    {
      "text": "Nelson T., Hettinger L., Cunningham J., Roe M., Lu L., Haas M., Dennis L., Pick H., Junker A., Berg C., (1996) \"Brain-Body-Actuated Control: Assessment of an Alternative Control Technology For Virtual Environments,\" Image Conf., Scottsdale AZ. P 16-21",
      "doi": ""
    },
    {
      "text": "Polak, M., Kostov, A., (1997),\"Development Of Brain- Computer Interface: Preliminary Results,\" Proceedings - 19 th International Conference - IEEE/EMBS Oct. 30,1997 - Nov. 2, 1997, Chicago, Illinois, p1543 - 6",
      "doi": ""
    }
  ]
}