{
  "doi": "10.1145/365024.365027",
  "title": "Scale effects in steering law tasks",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2001,
  "badges": [],
  "abstract": "Interaction tasks on a computer screen can technically be scaled to a much larger or much smaller sized input control area by adjusting the input device's control gain or the control-display (C-D) ratio. However, human performance as a function of movement scale is not a well concluded topic. This study introduces a new task paradigm to study the scale effect in the framework of the steering law. The results confirmed a U-shaped performance-scale function and rejected straight-line or no-effect hypotheses in the literature. We found a significant scale effect in path steering performance, although its impact was less than that of the steering law's index of difficulty.  We analyzed the scale effects in two plausible causes: movement joints shift and motor precision limitation. The theoretical implications of the scale effects to the validity of the steering law, and the practical implications of input device size and zooming functions are discussed in the paper.",
  "tags": [
    "elbow",
    "limb",
    "C-D ratio",
    "input device",
    "steering law",
    "motor control",
    "finger",
    "arm",
    "joints",
    "device size",
    "wrist",
    "hand",
    "movement scale",
    "control gain"
  ],
  "authors": [
    {
      "name": "Johnny Accot",
      "institution": "Centre d'Études de la Navigation Aérienne, 7 avenue Edouard Belin, 31055 Toulouse cedex, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100509407",
      "orcid": "missing"
    },
    {
      "name": "Shumin Zhai",
      "institution": "IBM Almaden Research Center, 650 Harry Road, San Jose, CA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    }
  ],
  "references": [
    {
      "text": "J. Accot and S. Zhai. Beyond Fitts' law: models for trajectory-based hci tasks. In Proceedings of ACM CHI'97 Conference on Human Factors in Computing Systems, pages 295-302, 1997.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "J. Accot and S. Zhai. Performance evaluation of input devices in trajectory-based tasks: an application of the steering law. In Proceedings of ACM CHI'99 Conference on Human Factors in Computing Systems, pages 466-472, 1999.  ",
      "doi": ""
    },
    {
      "text": "L. Y. Arnaut and J. S. Greenstein. Is display/control gain a useful metric for optimizing an interface? Human Factors, 32(6):651-663, 1990. ",
      "doi": ""
    },
    {
      "text": "R. Balakrishnan and I. S. MacKenzie. Performance differences in the fingers, wrist, and forearm in computer input control. In Proceedings of ACM CHI'97 Conference on Human Factors in Computing Systems, pages 303-310, 1997.  ",
      "doi": "10.1145/258549.258764"
    },
    {
      "text": "K. R. Boff, L. Kaufman, and J. P. Thomas, editors. Handbook of Perception and Human Performance. John Wiley &amp; Sons, New York, 1986.",
      "doi": ""
    },
    {
      "text": "K. R. Boff and J. E. Lincoln. Engineering data compendium: Human perception and performance, Harry G. Armstrong Aerospace Medical Research Laboratory, Wright-Patterson Air Force Base, Ohio, 1988.",
      "doi": ""
    },
    {
      "text": "L. Buck. Motor performance in relation to controldisplay gain and target width. Ergonomics, 23(6):579- 589, 1980.",
      "doi": ""
    },
    {
      "text": "P. M. Fitts. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47:381- 391, 1954.",
      "doi": "10.1037/h0055392"
    },
    {
      "text": "C. B. Gibbs. Controller design: Interactions of controlling limbs, time-lags, and gains in positional and velocity systems. Ergonomics, 5:385-402, 1962.",
      "doi": ""
    },
    {
      "text": "Y. Guiard. Difficulty and scale as the basic dimensions of aimed movement. In Proceedings of the Tenth International Conference on Perception and Action, page 87, University of Edinburgh, Scotland, 1999.",
      "doi": ""
    },
    {
      "text": "R. A. Hess. Nonadjectival rating scales in human response experiments. Human Factors, 13(3):275-280, 1973.",
      "doi": ""
    },
    {
      "text": "H. D. Jellinek and S. K. Card. Powermice and user performance. In Proceedings of ACM CHI'90 Conference on Human Factors in Computing Systems, pages 213- 220, 1990.  ",
      "doi": ""
    },
    {
      "text": "G. D. Langolf and D. B. Chaffin. An investigation of Fitts' law using a wide range of movement amplitudes. Journal of Motor Behavior, 8:113-128, 1976.",
      "doi": ""
    },
    {
      "text": "I. S. MacKenzie. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7:91-139, 1992.",
      "doi": ""
    },
    {
      "text": "W. E. Woodson, B. Tillman, and P. Tillman. Human Factors Design Handbook. Second edition. McGraw- Hill, New York, 1992.",
      "doi": ""
    },
    {
      "text": "S. Zhai, P. Milgram, and W. Buxton. The influence of muscle groups on performance of multiple degree-offreedom input. In Proceedings of ACMCHI'96 Conference on Human Factors in Computing Systems, pages 308-315, 1996.  ",
      "doi": "10.1145/238386.238534"
    }
  ]
}