{
  "doi": "10.1145/365024.365130",
  "title": "Social navigation of food recipes",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "341-348",
  "year": 2001,
  "badges": [],
  "abstract": "The term Social Navigation captures every-day behaviour used to find information, people, and places - namely through watching, following, and talking to people. We discuss how to design information spaces to allow for social navigation. We applied our ideas in a recipe recommendation system. In a follow-up user study, subjects state that social navigation adds value to the service: it provides for social affordance, and it helps turning a space into a social place. The study also reveals some unresolved design issues, such as the snowball effect where more and more users follow each other down the wrong path, and privacy issues.",
  "tags": [
    "awareness",
    "online shopping",
    "social navigation",
    "recommender system",
    "privacy"
  ],
  "authors": [
    {
      "name": "Martin Svensson",
      "institution": "HUMLE, SICS, Box 1263, S-164 29 Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100551494",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "HUMLE, SICS, Box 1263, S-164 29 Kista, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Jarmo Laaksolahti",
      "institution": "HUMLE, SICS, Box 1263, S-164 29 Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100629235",
      "orcid": "missing"
    },
    {
      "name": "Annika Waern",
      "institution": "HUMLE, SICS, Box 1263, S-164 29 Kista, Sweden",
      "img": "/do/10.1145/contrib-81100020339/rel-imgonly/282023_3annika-waern.jpg",
      "acmid": "81100020339",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chau, P.Y.K., Au, G., and Tam, K.Y. User Interface Design of Interactive Multimedia Services (IMS) Applications: An Empirical Evaluation, in Proceedings of the 3rd Pacific Workshop on Distributed Multimedia systems (Hong Kong, June 1996), 25-28.",
      "doi": ""
    },
    {
      "text": "Churchill, E., Trevor, J., Nelson, L., Bly, S., Crubranic, D. Anchored Conversations: Chatting in the Context of a Document, in Proceedings of CHI'2000 (The Hague, April 2000), 454-461.  ",
      "doi": "10.1145/332040.332475"
    },
    {
      "text": "Dieberger, A. Supporting Social Navigation on the World-Wide Web. International Journal of Human- Computer Studies, special issue on innovative applications of the Web 46 (1997), 805-825.  ",
      "doi": "10.1006/ijhc.1996.0111"
    },
    {
      "text": "Dieberger A. Where did all the people go? A collaborative Web space with social navigation information, Poster at WWW9, The Hague, The Netherlands, (May, 2000).",
      "doi": ""
    },
    {
      "text": "Dieberger, A., Dourish, P., Hook, K., Resnick, P., and Wexelblat, A. Social Navigation: Techniques for building more usable systems, interactions, Nov-Dec issue, ACM, (2000).  ",
      "doi": "10.1145/352580.352587"
    },
    {
      "text": "Dourish, P., and Chalmers, M. Running out of Space: Models of Information Navigation, in Proceedings of HCI'94 (1994).",
      "doi": ""
    },
    {
      "text": "Erickson, T. and Kellogg, W. Social Translucence: An Approach to Designing Systems that Mesh with Social Processes. To appear in Transactions on Computer- Human Interaction. (In press , 2000).  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Frostling-Henningsson, M. Dagligvaruhandel over natetvad innebar det? En kvalitativ studie av 22 svenska hush~ll 1998-1999, Licentiate Thesis, in Swedish, available from School of Business, Stockholm University, Sweden, (2000).",
      "doi": ""
    },
    {
      "text": "Harper, R.H.R. Information that Counts: A sociological View of Information Navigation, in A. Munro, K. Hook, and D. Benyon (eds.), Social Navigation of Information Space, Springer Verlag, (1999), 81-89.",
      "doi": ""
    },
    {
      "text": "Harrison, S., and Dourish, P. Re-Place-ing Space: The Roles of Place and Space in Collaborative Systems, in Proceedings of the Conference on Computer-Supported Cooperative Work (CSCW'96) (Boston Mass, 1996), 67- 76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Konstan, J.A., Miller, B.N., Maltz, D., Herlocker, J.L., Gordon, L.R., and Riedl, J. GroupLens: Applying Collaborative Filtering to Usenet News. Communications of the ACM 40, 3, (1997), 77-87.  ",
      "doi": "10.1145/245108.245126"
    },
    {
      "text": "Lonnqvist, P., Dieberger, A., Hook, K., and Dahlback, N. Usability Studies of a Socially Enhanced Web Server, Short Paper accepted to CHI 2000 Workshop on Social Navigation, (The Haague, Netherlands, April 2000).",
      "doi": ""
    },
    {
      "text": "Maglio, Paul, and Barrett, Rob. WebPlaces: Adding People to the Web, In Eight International World Wide Web Conference WWW8, (Toronto, Canada, 1999).",
      "doi": ""
    },
    {
      "text": "Munro, A. Fringe Benefits: An Ethnographic Study of Social Navigation at the Edinburgh Festival, Deliverable 2.1.1 from the PERSONA project, available from SICS, Stockholm, Sweden, (1999).",
      "doi": ""
    },
    {
      "text": "Munro, A., Hook, K., and Benyon, D. (eds.) Social Navigation in Information Space, Springer, (August 1999). ",
      "doi": "10.5555/555200"
    },
    {
      "text": "Resnick, P., and Varian, H. Recommender Systems. Communications of the ACM 40, 3, (1997).  ",
      "doi": "10.1145/245108.245121"
    },
    {
      "text": "Richmond, A. Enticing online shoppers to buy - A human behaviour study. Computer Networks and ISDN Systems 28, (1996), 1469-1480.  ",
      "doi": "10.1016/0169-7552%2896%2900058-X"
    },
    {
      "text": "Shardanand, U., and Maes, P. (1995) Social Information Filtering: Algorithms for Automating \"Word of Mouth\", in Proceedings of Human factors in computing systems (CHI'95) (Denver Colorado, May 1995), 210-217.  ",
      "doi": "10.1145/223904.223931"
    },
    {
      "text": "Sjolinder, M., Hook, K., and Nilsson, L. Age differences in the use of an on-line grocery shop - implications for design, in Proceedings of CHI'2000 (The Hague, May 2000), 135.  ",
      "doi": "10.1145/633292.633369"
    },
    {
      "text": "Soininen, Kaisa, and Suikola, Eija Information Seeking is Social, Proceedings of the NordiCHI conference, Stockholm, (Stockholm, Sweden, October 2000).",
      "doi": ""
    },
    {
      "text": "Streeter, L.A., Vitello, D., and Wonsiewicz, S.A. How to Tell People Where to Go: Comparing Navigational Aids. Int. J. Man-Machine Studies 22, (1985), 549-562.  ",
      "doi": "10.1016/S0020-7373%2885%2980017-1"
    },
    {
      "text": "Svensson, M. Defining and Design Social Navigation, Licentiate thesis DSV report series 00-003, ISSN 1101- 8526, available from Stockholm University, (2000).",
      "doi": ""
    },
    {
      "text": "Timpka, T., Hallberg N. Talking at work - professional advice-seeking at primary healthcare centers. Scand. J. Prim Health Care 14, (1996), 130-135.",
      "doi": ""
    },
    {
      "text": "Wexelblat, A., and Maes, P. Footprints: History-Rich Tools for Information Foraging, in Proceeding of the CHI 99 Conference on Human Factors in Computing Systems: The CHI is the Limit (CHI'99) (Pittsburgh PA, 1999), 270-277.  ",
      "doi": "10.1145/302979.303060"
    }
  ]
}