{
  "doi": "10.1145/365024.365078",
  "title": "Doom as an interface for process management",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "152-157",
  "year": 2001,
  "badges": [],
  "abstract": "This paper explores a novel interface to a system administration task. Instead of creating an interface de novo for the task, the author modified a popular computer game, Doom, to perform useful work. The game was chosen for its appeal to the target audience of system administrators. The implementation described is not a mature application, but it illustrates important points about user interfaces and our relationship with computers. The applications relies on a computer game vernacular rather than the simulations of physical reality found in typical navigable virtual environments. Using a computer game vocabulary may broaden an application's audience by providing sn intuitive environment for children and non-technical users. In addition, the application highlights the adversarial relationships that exist in a computer and suggests a new resource allocation scheme.",
  "authors": [
    {
      "name": "Dennis Chao",
      "institution": "Computer Science Department, University of New Mexico, Albuquerque, NM",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660013255",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Axelrod, R. The Evolution of Cooperation. Basic Books, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Bob. Microsoft Corporation, Seattle WA, 1995.",
      "doi": ""
    },
    {
      "text": "Brand, S. How Buildings Learn: What Happens After They're Built. Viking Penguin, New York, 1994.",
      "doi": ""
    },
    {
      "text": "Brockmeier, J. A SysAdmin's Dream. Linux Magazine 2, 1 (January 2000), 76.",
      "doi": ""
    },
    {
      "text": "Bruckman, A. MOOSE Crossing: Construction, Community, and Learning in a Networked Virtual World for Kids. MIT Media Lab, Cambridge MA, 1997.",
      "doi": ""
    },
    {
      "text": "Chang, B.W., and Ungar, D. Animation: From Cartoons to the User Interface. UIST '93 Conference Proceedings (Atlanta GA, November 1993), ACM Press, 45-55.  ",
      "doi": "10.1145/168642.168647"
    },
    {
      "text": "Cherny, L., Clanton, C., and Ostrom, E. Entertainment is a Human Factor: A CHI 97 Workshop on Game Design and HCI. SIGCHI Bulletin 29, 4 (October 1997), 50-54.  ",
      "doi": "10.1145/270950.270981"
    },
    {
      "text": "Doom. Id Software, Mesquite TX, 1993.",
      "doi": ""
    },
    {
      "text": "Erickson, T. Working With Interface Metaphors. The Art of Human-Computer Interface Design, edited by Brenda Laurel. Addison-Wesley Publishing Company, Inc., New York, 1990.",
      "doi": ""
    },
    {
      "text": "Evard, R. Collaborative Networked Communication: MUDs as Systems Tools. Proceedings of the Seventh Systems Administration Conference (LISA VII) (Monterrey CA, November 1993), USENIX, 1-8. ",
      "doi": "10.5555/1024753.1024758"
    },
    {
      "text": "The Federal Trade Commission. Marketing Violent Entertainment To Children: A Review Of Self-Regulation And Industry Practices In The Motion Picture, Music Recording &amp; Electronic Game Industries. Washington: Government Printing Office, 2000.",
      "doi": ""
    },
    {
      "text": "Gentner, D., and Nielson, J. The Anti-Mac Interface. Communications of the ACM 39, 8 (August 1996), 70- 82.  ",
      "doi": "10.1145/232014.232032"
    },
    {
      "text": "GNU General Public License. Free Software Foundation, Inc., Boston MA, 1991.",
      "doi": ""
    },
    {
      "text": "Habitat. Lucasfilm Ltd, San Rafael CA, 1986.",
      "doi": ""
    },
    {
      "text": "Hakansson, J. Lessons Learned From Kids: One Developer's Point of View. The Art of Human-Computer Interface Design, edited by Brenda Laurel. Addison-Wesley Publishing Company, Inc., New York, 1990.",
      "doi": ""
    },
    {
      "text": "Heidemann, J. LavaPS. 1998. Available at http://www.isi.edu/johnh/SOFTWARE/LAVAPS/.",
      "doi": ""
    },
    {
      "text": "Hwang, F. Commando Line Interface. Wired 8, 2 (February 2000), 52.",
      "doi": ""
    },
    {
      "text": "Johnson, S. Interface Culture. Harper, San Francisco CA, 1997.",
      "doi": ""
    },
    {
      "text": "Kim, A.J. Ultima Online: An Interactive Virtual World with Multiple Personalities. SIGGRAPH Bulletin 32,2 (May 1998), 15-19.",
      "doi": ""
    },
    {
      "text": "Langford, D., and Jones, C. The Kitchen Interface - A Lateral Approach to GUI. SIGCHI Bulletin 26, 2 (April 1994), 41-45.  ",
      "doi": "10.1145/198125.198139"
    },
    {
      "text": "MagicCap. General Magic, Sunnyvale CA, 1994.",
      "doi": ""
    },
    {
      "text": "Malone, T.W. Toward a theory of intrinsically motivating instruction. Cognitive Science 4, 333-370.",
      "doi": ""
    },
    {
      "text": "Morningstar, C., and Farmer, F.R. The Lessons of Lucasfilm's Habitat. Cyberspace: First Steps, edited by Michael Benedikt. MIT Press, Cambridge MA, 1990, 273-301. ",
      "doi": "10.5555/114772.114792"
    },
    {
      "text": "Schmidt, J. Systemverwaltung nach Hackerart. c't: Magazin fur Computer Technik, 23 (1999), 68.",
      "doi": ""
    },
    {
      "text": "Somayaji, A. Automated Response Using System-Call Delays. 9th USENIX Security Symposium (Denver CO, August 2000), ACM Press, 185-197. ",
      "doi": "10.5555/1251306.1251320"
    },
    {
      "text": "Systemadministration mit dem Colt. IX: Magazin fur professionelle Informationstechnik, 12 (December 1999), 44.",
      "doi": ""
    },
    {
      "text": "UBUBU Universe. UBUBU, Inc., San Francisco CA, 2000. Available at http://www.ububu.com/.",
      "doi": ""
    },
    {
      "text": "Ultima Online. Electronic Arts, Inc., Redwood City CA, 1997.",
      "doi": ""
    },
    {
      "text": "Venturi, R., Scott Brown, D., and Izenour, S. Learning From Las Vegas. The MIT Press, Cambridge MA, 1972.",
      "doi": ""
    },
    {
      "text": "Vinge, V. True Names, in Binary Star #5, edited by James R. Frenkel. Dell, New York, 1981.",
      "doi": ""
    },
    {
      "text": "Weiser, M., and Brown, J.S. Designing Calm Technology. PowerGrid Journal 1.01 (July 1996).",
      "doi": ""
    }
  ]
}