{
  "doi": "10.1145/365024.365102",
  "title": "Accordion summarization for end-game browsing on PDAs and cellular phones",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "213-220",
  "year": 2001,
  "badges": [],
  "abstract": "We demonstrate a new browsing technique for devices with small displays such as PDAs or cellular phones. We concentrate on end-game browsing, where the user is close to or on the target page. We make browsing more efficient and easier by Accordion Summarization. In this technique the Web page is first represented as a short summary. The user can then drill down to discover relevant parts of the page. If desired, keywords can be highlighted and exposed automatically. We discuss our techniques, architecture, interface facilities, and the result of user evaluations. We measured a 57% improvement in browsing speed and 75% reduction in input effort.",
  "tags": [
    "WML",
    "HTML",
    "WWW (World-Wide Web)",
    "PDA (Personal Digital Assistant)",
    "WAP"
  ],
  "authors": [
    {
      "name": "Orkut Buyukkokten",
      "institution": "Digital Libraries Lab (InfoLab), Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501214",
      "orcid": "missing"
    },
    {
      "name": "Hector Garcia-Molina",
      "institution": "Digital Libraries Lab (InfoLab), Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100308969/rel-imgonly/81100308969.jpg",
      "acmid": "81100308969",
      "orcid": "missing"
    },
    {
      "name": "Andreas Paepcke",
      "institution": "Digital Libraries Lab (InfoLab), Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100130120/rel-imgonly/paepckeportraithomepage.jpg",
      "acmid": "81100130120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bickmore, T.W. &amp; Schilit, B. N. Digestor: Deviceindependent Access to the World-Wide Web. Proc. WWW6, 1997. ",
      "doi": "10.5555/283554.283349"
    },
    {
      "text": "Brown, T.J. Visual Display Highlighting and Information Extraction. Proc. The Human Factors Society, 35 th Annual Meeting, 1991, 1427-1431.",
      "doi": ""
    },
    {
      "text": "Buyukkokten, O., Garcia-Molina, H., Paepcke, A., &amp; Winograd, T. Power Browser: Efficient Web Browsing for PDAs. Proc. CHI'2000, 430-437.  ",
      "doi": "10.1145/332040.332470"
    },
    {
      "text": "Buyukkokten, O., Garcia-Molina, H. &amp; Paepcke, A. Focused Web Searching with PDAs. Proc. WWW9, 2000, 213-230. ",
      "doi": "10.5555/347319.346278"
    },
    {
      "text": "Chen, M., Hearst, M., Hong, J., &amp; Lin, J. Cha-Cha: A System for Organizing Intranet Search Results. Proc. the 2nd USENIX Symposium on Internet Technologies and SYSTEMS (USITS), 1999. ",
      "doi": "10.5555/1251480.1251485"
    },
    {
      "text": "Chimera, R., Wolman, K., Mark, S. &amp; Shneiderman, B. An Exploratory Evaluation of Three Interfaces for Browsing Large Hierarchical Tables of Contents. ACM Transactions on Information Systems, 12, 4, Oct. 94, 383-406.  ",
      "doi": "10.1145/185462.185483"
    },
    {
      "text": "Edmundson, H. P. New Methods in Automatic Extracting. Journal of the Association for Computing Machinery 16(2), 1968, 264-285.  ",
      "doi": "10.1145/321510.321519"
    },
    {
      "text": "Egan, D., E., Remde, J. R., Landauer, T. K., Lochbaum, C. C. &amp; Gomez, L. M. Behavioral Evaluation and Analysis of a Hypertext Browser. Proc. CHI'89, 205- 210.  ",
      "doi": "10.1145/67449.67490"
    },
    {
      "text": "Feiner, S. Seeing the Forest for the Trees: Hierarchical Display of Hypertext Structure. Conference on Office Information Systems, New York: ACM, 1988. 205-212.  ",
      "doi": "10.1145/45410.45432"
    },
    {
      "text": "Fox, A. &amp; Brewer, E. A. Reducing WWW Latency and Bandwidth Requirements by Real-Time Distillation. Proc. WWW5, 1996. ",
      "doi": "10.5555/232710.232766"
    },
    {
      "text": "Fox, A., Goldberg, I., Gribble, S. D., Lee, D. C., Polito, A. &amp; Brewer, E. A. Experience With Top Gun Wingman: A Proxy-Based Graphical Web Browser for the 3Com PalmPilot. Conference Reports of Middleware, 1998. ",
      "doi": "10.5555/1659232.1659266"
    },
    {
      "text": "Furnas, G. W. Generalized Fisheye Views. Proc. CHI'86, 16-23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Hans, W. J. User Engineering Principles for Interactive Systems. Proc. of Fall Joint Computer Conference, Nov. 1971, AFIPS Press, 523-532.",
      "doi": ""
    },
    {
      "text": "Hovy, E., &amp; Lin., C.-Y. Automated Text Summarization in SUMMARIST. Proc. Workshop on Intelligent Scalable Text Summarization, Aug. 1997, 18-24.",
      "doi": ""
    },
    {
      "text": "Jones, M., Marsden, G., Mohd-Nasir, N., Boone K. &amp; Buchanan, G. Improving Web Interaction on Small Displays. Proc. WWW8, 1999, 51-59. ",
      "doi": "10.1016/S1389-1286%2899%2900013-4"
    },
    {
      "text": "Kaasinen, E., Aaltonen, M., Kolari, J., Melakoski, S. &amp; Laakko, T. Two Approaches to Bringing Internet Services to WAP devices. Proc. WWW9, 2000, 231-246. ",
      "doi": "10.5555/347319.346282"
    },
    {
      "text": "Kamba, T., Elson, S. A., Harpold, T., Stamper, T. &amp; Sukaviriya, P. N. Using Small Screen Space more Efficiently. Proc. CHI'96.  ",
      "doi": "10.1145/238386.238582"
    },
    {
      "text": "Luhn, H.P. Keyword-In-Context Index for Technical Literature (KWIC Index). American Documentation XI, 4, 1960, 288-295.",
      "doi": ""
    },
    {
      "text": "Nation, D. A., Plaisant, C., Marchionini, G. &amp; Komlodi, A. Visualizing Web Sites using a Hierarchical Table of Contents Browser: WebToc. Proc. the 3 rd Conf. on Human Factors and the Web, 1997.",
      "doi": ""
    },
    {
      "text": "Palm, Inc., Palm OS Emulator: http://www.palmos.com/dev/tech/tools/emulator/.",
      "doi": ""
    },
    {
      "text": "Palm, Inc., Web Clipping Development: http://www.palmos.com/dev/tech/webclipping/.",
      "doi": ""
    },
    {
      "text": "Philipsen, G. Effects of Six Different Highlighting Modes on Visual Search Performance in Menu Options. Intl. Journal of Human-Computer Interaction 6, 3, 1994, 319-334.  ",
      "doi": "10.1080/10447319409526098"
    },
    {
      "text": "Pratt, W., Hearst, M. A., &amp; Fagan, L. M. A Knowledge- Based Approach to Organizing Retrieved Documents. AAAI-99: Proc. of the 16th National Conf. on AI, 1999. ",
      "doi": "10.5555/315149.315232"
    },
    {
      "text": "ProxiNet, Inc., ProxiWeb: http://www.proxinet.com/.",
      "doi": ""
    }
  ]
}