{
  "doi": "10.1145/365024.365094",
  "title": "Quiet calls: talking silently on mobile phones",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "174-181",
  "year": 2001,
  "badges": [],
  "abstract": "Quiet Calls is a technology allowing mobile telephone users to respond to telephone conversations without talking aloud. QC-Hold, a Quiet Calls prototype, combines three buttons for responding to calls with a PDA/mobile phone unit to silently send pre-recorded audio directly into the phone. This permits a mixed-mode communication where callers in public settings use a quiet means of communication, and other callers experience a voice telephone call. An evaluation of QC-Hold shows that it is easily used and suggests ways in which Quiet Calls offers a new form of communication, extending the choices offered by synchronous phone calling and asynchronous voicemail.",
  "tags": [
    "interaction design",
    "telecommunication",
    "computer mediated communication",
    "mobile computing",
    "hand-held devices"
  ],
  "authors": [
    {
      "name": "Les Nelson",
      "institution": "FX Palo Alto Laboratory, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100407787",
      "orcid": "missing"
    },
    {
      "name": "Sara Bly",
      "institution": "Sara Bly Consulting, North Plains, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100274421",
      "orcid": "missing"
    },
    {
      "name": "Tomas Sokoler",
      "institution": "Space & Virtuality Studio, The Interactive Institute, Malmo, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318754",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Associated Press, \"Cells Out - Wireless callers shepherded to their own lounge,\" printed in the San Jose Mercury News, 12 November 1999.",
      "doi": ""
    },
    {
      "text": "Bluelinx, Inc., www.bluelinx.com, 2000.",
      "doi": ""
    },
    {
      "text": "Brave, S., Dahley, A., Frei, P., Su, V., Ishii, H., inTouch, in Conference Abstracts and Applications of SIGGRAPH98, ACM Press, pp. 115.  ",
      "doi": "10.1145/280953.281309"
    },
    {
      "text": "Flores, F., Graves, M., Hartfield, B., Winograd, T., Computer systems and the design of organizational interaction; ACM Trans. Inf. Syst. 6, 2, pp. 153-172, 1988.  ",
      "doi": "10.1145/45941.45943"
    },
    {
      "text": "Goodwin, C., Conversational Organization: Interaction between speakers and hearers, Academic Press, New York, 1981.",
      "doi": ""
    },
    {
      "text": "Kimbrough, S.O., Moore, S.A.; On automated message processing in electronic commerce and work support systems: speech act theory and expressive felicity; ACM Trans. Inf. Syst. 15, 4, pp. 321-367, 1997.  ",
      "doi": "10.1145/263479.263480"
    },
    {
      "text": "Kyocera Wireless Corp., \"pdQ smartphone,\" www.kyocera-wireless.com/pdq/index.html, 2000.",
      "doi": ""
    },
    {
      "text": "Jacobson, D., Release of TalkToMe! V1.0, www.macinsearch.com/news/19990309/news_19990309. 21650.5.shtml, 1999.",
      "doi": ""
    },
    {
      "text": "Norman, D.A., The Design of Everyday Things, p. 53, Doubleday Currency, New York, NY, 1988.",
      "doi": ""
    },
    {
      "text": "Rabiner, L.R., Juang, B.H., Fundamentals of Speech Recognition, Prentice-Hall, Englewood Cliffs, NJ, 1993. ",
      "doi": "10.5555/153687"
    },
    {
      "text": "Research In Motion Limited (RIM), Home Page, www.blackberry.net/, 2000.",
      "doi": ""
    },
    {
      "text": "Rippon, A., Ward, A., \"I'm On Me Mobile\" - An Interesting Collection of True Mobile Phone Conversations, Robson Books, London, U.K., 2000.",
      "doi": ""
    },
    {
      "text": "Schegloff, E.A. and H. Sacks, Opening up closings, Semiotica, 8/4, p. 289-327, 1973.",
      "doi": ""
    },
    {
      "text": "Thorisson, K. R., Gandalf: an embodied humanoid capable of real-time multimodal dialogue with people, Proceedings of the first international conference on Autonomous agents , 1997, Pages 536 - 537.  ",
      "doi": "10.1145/267658.267823"
    }
  ]
}