{
  "doi": "10.1145/365024.365309",
  "title": "3D or not 3D?: evaluating the effect of the third dimension in a document management system",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "434-441",
  "year": 2001,
  "badges": [],
  "abstract": "Several recent research systems have provided interactive three-dimensional (3D) visualisations for supporting everyday work such as file and document management. But what improvements do these 3D interfaces offer over their traditional 2D counterparts? This paper describes the comparative evaluation of two document management systems that differ only in the number of dimensions used for displaying and interacting with the data. The 3D system is heavily based on Robertson et al.'s Data Mountain, which supports users in storing, organising and retrieving “thumbnail” representations of documents such as bookmarked Web-pages. Results show that our subjects were faster at storing and retrieving pages in the display when using the 2D interface, but not significantly so. As expected,  retrieval times significantly increased as the number of thumbnails increased. Despite the lack of significant differences between the 2D and 3D interfaces, subjective assessments showed a significant preference for the 3D interface.",
  "tags": [
    "spatial memory",
    "document management",
    "information visualisation",
    "3D user interfaces"
  ],
  "authors": [
    {
      "name": "Andy Cockburn",
      "institution": "Department of Computer Science, University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Bruce McKenzie",
      "institution": "Department of Computer Science, University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017816",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S. K., Robertson, G. G., and York, W. The WebBook and the WebForager: An Information Workspace for the World Wide-Web. In Proceedings of CHI'96, Vancouver, April 1996, ACM Press, 111-117.  ",
      "doi": "10.1145/238386.238446"
    },
    {
      "text": "Carswell, C., Frankenberger, S., and Bernhard, D. Graphing in depth: Perspectives on the use of threedimensional graphs to represent lower-dimensional data. Behavior and Information Technology 10, 6, 459-474. 1991.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and McKenzie, B. An evaluation of cone trees. In People and Computers XV (Proceedings of the 2000 British Computer Society Conference on Human- Computer Interaction.), University of Sunderland, September 2000, Springer-Verlag, In Press.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Dumais, S., Robertson, G., Dziadosz, S., Tiernan, S., and van Dantzich, M. Visualizing implicit queries for information management and retrieval. In Proceedings of CHI'99, Pittsburgh, May 1999, ACM Press, 560-567.  ",
      "doi": "10.1145/302979.303158"
    },
    {
      "text": "Levy, E., Zacks, J., Tversky, B., and Schiano, D. Gratuitous graphics? Putting preferences in perspective. In Proceedings of CHI'96, Vancouver, April 1996, ACM Press, 42-49.  ",
      "doi": "10.1145/238386.238400"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D., and van Dantzich, M. Data Mountain: Using spatial memory for document management. In Proceedings of UIST'98, San Francisco, California, November 1998, ACM Press. 153-162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Robertson, G., Mackinlay, J., and Card, S. K. Cone Trees: Animated 3D visualizations of hierarchical information. In Proceedings of CHI'91, New Orleans, May 1991, ACM Press, 189-194.  ",
      "doi": "10.1145/108844.108883"
    },
    {
      "text": "Spence, I. Visual psychophysics of simple graphical elements. Journal of Experimental Psychology: Human Perception and Performance 16, 4, 683-692, 1990.",
      "doi": ""
    },
    {
      "text": "Ware, C., and Franck, G. Evaluating stereo and motion cues for visualizing information nets in three dimensions. ACM Transaction on Graphics 15, 2, 121-139, 1996.  ",
      "doi": "10.1145/234972.234975"
    }
  ]
}