{
  "doi": "10.1145/365024.365305",
  "title": "An empirical study of human Web assistants: implications for user support in Web information systems",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "404-411",
  "year": 2001,
  "badges": [],
  "abstract": "User support is an important element in reaching the goal of universal usability for Web information systems. Recent developments indicate that human involvement in user support is a step towards this goal. However, most such efforts are currently being pursued on a purely intuitive basis. This, empirical findings about the role of human assistants are important. In this paper we present the findings from a field study of a general user support model for Web information systems. We show that integrating human assistance into Web systems is a way to provide efficient user support. Further, this integration makes a Web site more fun to use and increases the user's trust in the site. The support also improves the site atmosphere. Our findings are summarised as recommendations and design  guidelines for decision-makers and developers Web systems.",
  "authors": [
    {
      "name": "Johan Aberg",
      "institution": "Dept. of Computer and Information Science, Linköpings universitet, S-581 83 Linköping, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100216445",
      "orcid": "missing"
    },
    {
      "name": "Nahid Shahmehri",
      "institution": "Dept. of Computer and Information Science, Linköpings universitet, S-581 83 Linköping, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100181796",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aberg, J., and Shahmehri, N. The role of human Web assistants in e-commerce: an analysis and a usability study. Internet Research: Electronic Networking Applications and Policy 10, 2 (2000), 114-125.",
      "doi": ""
    },
    {
      "text": "Aberg, J., and Shahmehri, N. Collection and Exploitation of Expert Knowledge in Web Assistant Systems, in Proceedings of the 34 th Hawaii International Conference on System Sciences (2001). ",
      "doi": "10.5555/820759.821955"
    },
    {
      "text": "Ackerman, M.S. Augmenting the Organizational Memory: A Field Study of Answer Garden, in Proceedings of CSCW'94 (1994), 243-252.  ",
      "doi": "10.1145/192844.193019"
    },
    {
      "text": "Ackerman, M.S., and McDonald, D.W. Answer Garden 2: Merging Organizational Memory with Collaborative Help, in Proceedings of CSCW'96 (1996), 97-105.  ",
      "doi": "10.1145/240080.240203"
    },
    {
      "text": "Bouchard Jr., T.J. Field research methods: Interviewing, questionnaires, participant observation, systematic observation, unobtrusive measures. In Dunnette, M.D. (ed.) Handbook of Industrial and Organizational Psychology. Rand McNally, (1976), 363-413.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., and McKendree, J. Interface design issues for advice-giving expert systems. Communications of the ACM 30, 1 (1987), 14-31.  ",
      "doi": "10.1145/7885.7886"
    },
    {
      "text": "Hoffman, D.L., Novak, T.P, and Peralta, M. Building Consumer Trust Online. Commmunications of the ACM 42, 4 (1999), 80-85.  ",
      "doi": "10.1145/299157.299175"
    },
    {
      "text": "Isakowitz, T., Bieber, M., and Vitali, F. Web Information Systems. Communications of the ACM 41, 7 (1998), 78-80.  ",
      "doi": "10.1145/278476.278490"
    },
    {
      "text": "Jarvenpaa, S.L., and Todd, P.A. Consumer Reactions to Electronic Shopping on the World Wide Web. International Journal of Electronic Commerce 1, 2 (1997), 59-88. ",
      "doi": "10.1080/10864415.1996.11518283"
    },
    {
      "text": "Jensen, C., Farnham, S.D., Drucker, S.M., and Kollock, P. The Effect of Communication Modality on Cooperation in Online Environments, in Proceedings of CHI'00 (2000), 470-477.  ",
      "doi": "10.1145/332040.332478"
    },
    {
      "text": "Karat, J. User-Centered Software Evaluation Methodologies. In Helander, M., Landauer, P., and Prabhu, P. (eds.) Handbook of Human-Computer Interaction. Elsevier Science B.V., (1997), 689-704.",
      "doi": ""
    },
    {
      "text": "Kobayashi, M., Shinozaki, M., Sakairi, T., Touma, M., Daijavad, S., and Wolf, C. Collaborative Customer Services Using Synchronous Web Browser Sharing, in Proceedings of CSCW'98 (1998), 99-108.  ",
      "doi": "10.1145/289444.289484"
    },
    {
      "text": "Kraut, R., Scherlis, W., Mukhopadhyay, T., Manning, J., and Kiesler, S. The Home Net Field Trial of Residential Internet Services. Communications of the ACM 39, 12 (1996), 55-63.  ",
      "doi": "10.1145/240483.240493"
    },
    {
      "text": "Lee, J., Kim, J., and Moon, J.Y. What makes Internet Users visit Cyber Stores again? Key Design Factors for Customer Loyalty, in Proceedings of CHI'00 (2000), 305- 312.  ",
      "doi": "10.1145/332040.332448"
    },
    {
      "text": "Lohse, G.L., and Spiller, P. Quantifying the Effect of User Interface Design Features on Cyberstore Traffic and Sales, in Proceedings of CHI'98 (1998), 211-218.  ",
      "doi": "10.1145/274644.274675"
    },
    {
      "text": "Lowgren, J. Human-computer interaction. Studentlitteratur, Lund, Sweden, 1993.",
      "doi": ""
    },
    {
      "text": "Ratnasingham, P. The importance of trust in electronic commerce. Internet Research: Electronic Networking Applications and Policy 8, 4 (1998), 313-321.",
      "doi": ""
    },
    {
      "text": "Rocco, E. Trust Breaks Down in Electronic Contexts but Can Be Repaired by Some Initial Face-to-Face Contact, in Proceedings of CHI'98 (1998), 496-502.  ",
      "doi": "10.1145/274644.274711"
    },
    {
      "text": "Shneiderman, B. Universal Usability. Communications of the ACM 43, 5 (2000), 85-91.  ",
      "doi": "10.1145/332833.332843"
    },
    {
      "text": "Spiller, P., and Lohse, G.L. A Classification of Internet Retail Stores. International Journal of Electronic Commerce 2, 2 (1998), 29-56. ",
      "doi": "10.1080/10864415.1997.11518307"
    },
    {
      "text": "Vijaysarathy, L.R, and Jones, J.M. Print and Internet catalog shopping. Internet Research: Electronic Networking Applications and Policy 10, 3 (2000), 191- 202.",
      "doi": ""
    },
    {
      "text": "Webster, J., and Martocchio, J.J. Microcomputer playfulness: Development of a measure with workplace implications. MIS Quarterly 16, 2 (1992), 201-226.  ",
      "doi": "10.2307/249576"
    }
  ]
}