{
  "doi": "10.1145/365024.365311",
  "title": "Viewing meeting captured by an omni-directional camera",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "450-457",
  "year": 2001,
  "badges": [],
  "abstract": "One vision of future technology is the ability to easily and inexpensively capture any group meeting that occurs, store it, and make it available for people to view anytime and anywhere on the network. One barrier to achieving this vision has been the design of low-cost camera systems that can capture important aspects of the meeting without needing a human camera operator. A promising solution that has emerged recently is omni-directional cameras that can capture a 360-degree video of the entire meeting.The panoramic capability provided by these cameras raises both new opportunities and new issues for the interfaces provided for post-meeting viewers — for example, do we show all meeting participants all the time or do we just show the person who is speaking, how much  control do we provide to the end-user in selecting the view, and will providing this control distract them from their task. These are not just user interface issues, they also raise tradeoffs for the client-server systems used to deliver such content. They impact how much data needs to be stored on the disk, what computation can be done on the server vs. the client, and how much bandwidth is needed. We report on a rototype system built using an omni-directional camera and results from user studies of interface preferences expressed by viewers.",
  "authors": [
    {
      "name": "Yong Rui",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100018204",
      "orcid": "missing"
    },
    {
      "name": "Anoop Gupta",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611908",
      "orcid": "missing"
    },
    {
      "name": "J. J. Cadiz",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100025873",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "BeHere, http://www.behere.com/",
      "doi": ""
    },
    {
      "text": "Brave, S., Ishii, H. and Dahley, A., Tangible interface for remote collaboration and communication, Proc. of CSCW'98, 169-178.  ",
      "doi": "10.1145/289444.289491"
    },
    {
      "text": "Buxton, W., Sellen, A., &amp; Sheasby, M., Interfaces for multiparty videoconferences, Video-mediated communication (edited by Finn, K., Sellen, A., &amp; Wilbur, S.), Lawrence Erlbaum Associates, Publishers, 1997",
      "doi": ""
    },
    {
      "text": "Colmenarez, A. and Huang, T., Face detection with information-based maximum discrimination, Proc. of IEEE CVPR, June 17, 1997, 782-789 ",
      "doi": "10.5555/794189.794401"
    },
    {
      "text": "Daniilidis, K., Preface, Proc. of IEEE Workshop on Omnidirectional Vision, June, 12, 2000.",
      "doi": ""
    },
    {
      "text": "Elrod, S., Bruce, R., Gold, R. Goldberg, D. Halasz, F., Janssen, W., Lee, D., McCall, K. Pederson, E., Pier, K., Tang, J., &amp; Welch, B., Liveboard: a large interactive display supporting group meetings, presentations and remote collaboration, Proc. of CHI'92, 599-607.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "He, L., Cohen, M., &amp; Salesin, D., The virtual cinemato-grapher: a paradigm for automatic real-time camera control and directing, Proc. of ACM SIGGRAPH'96, New Orleans.  ",
      "doi": "10.1145/237170.237259"
    },
    {
      "text": "He, L., Grudin, J., &amp; Gupta, A., Designing presentations for on-demand viewing, Proc. of CSCW'00, Dec. 2000  ",
      "doi": "10.1145/358916.358983"
    },
    {
      "text": "He, L. Sanocki, E., Gupta, A, Grudin, J., Comparing presentation summaries: slides vs. reading vs. listening, Proc. of CHI'00, 177-184.  ",
      "doi": "10.1145/332040.332427"
    },
    {
      "text": "Huang, Q., Cui, Y., and Samarasekera S., Content based active video data acquisition via automated cameramen, Proc. IEEE ICIP'98, 808- 811.",
      "doi": ""
    },
    {
      "text": "Kang, S.-B., Catadioptric self-calibration, Proc. of IEEE CVPR, June 12, 2000, I:201-208.",
      "doi": ""
    },
    {
      "text": "Liu, Z., Zhang, Z., Jacobs, C., and Cohen, M., Rapid Modeling of Animated Faces From Video. Technical Report, Microsoft Research 99- 21, April 1999.",
      "doi": ""
    },
    {
      "text": "McCanne, S. and Jacobson, V., Vic: a flexible framework for packet video, Proc. ACM multimedia'95, 511-522.  ",
      "doi": "10.1145/217279.215315"
    },
    {
      "text": "Moran, T. et al., I'll get that off the audio: a case study of salvaging multimedia meeting records. Proc. of CHI'97, 202-209.  ",
      "doi": "10.1145/258549.258704"
    },
    {
      "text": "Nicolescu, M., Medioni, G., and Lee, M., Segmentation, tracking and interpretation using panoramic video, Proc. of IEEE Workshop on Omnidirectional Vision, June, 12, 2000, 169-174. ",
      "doi": "10.5555/518051.825422"
    },
    {
      "text": "Nishimura, T., Yabe, H., and Oka, R., Indexing of human motion at meeting room by analyzing time-varying images of omni-directional camera, Proc. IEEE ACCV'00, 1-4.",
      "doi": ""
    },
    {
      "text": "Omuigui, N., He, L., Gupta, A., Grudin, J., &amp; Sanock, E., Timecompression: system concerns, usage, and benefits, Proc. CHI'99, 136- 143  ",
      "doi": "10.1145/302979.303017"
    },
    {
      "text": "PictureTel, http://www.picturetel.com/",
      "doi": ""
    },
    {
      "text": "PictureTel, Enhanced continuous presence, http://www.picturetel.com",
      "doi": ""
    },
    {
      "text": "Sellen, A., Remote conversations: the effects of mediating talk with technology, Human-Computer Interaction, 10(4), 401-444.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Stanford Online, http://stanford-onlines.stanford.edu/",
      "doi": ""
    },
    {
      "text": "Stiefelhagen, R., Yang, J., and Waibel, A., Modeling focus of attention for meeting indexing, Proc. ACM Multimedia'99, 1-10.  ",
      "doi": "10.1145/319463.319464"
    },
    {
      "text": "Tang, J. C., &amp; Rua, M. Montage: providing teleproximity of distributed groups. Proc. of CHI'94, 37-43.  ",
      "doi": "10.1145/191666.191688"
    },
    {
      "text": "USC Integrated Media Systems Center, http://imsc.usc.edu/ education/education.htm",
      "doi": ""
    },
    {
      "text": "Wong, T., Hand and ear: enhancing awareness of others in MASH videoconferencing tools, Project report, University of California, Berkeley, http://www.cs.berkeley.edu/~twong/classes/cscw/report. html",
      "doi": ""
    },
    {
      "text": "Zhu, Z., Rajasekar, K., Riseman, E., and Hanson, A., Panoramic virtual stereo vision of cooperative mobile robots for localizing 3D moving objects, Proc. of IEEE Workshop on Omnidirectional Vision, June, 12, 2000, 29-36. ",
      "doi": "10.5555/518051.825435"
    }
  ]
}