{
  "doi": "10.1145/365024.365349",
  "title": "Single display privacyware: augmenting public displays with private information",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "522-529",
  "year": 2001,
  "badges": [],
  "abstract": "The research area of Single Display Groupware (SDG) confronts the standard model of computing interaction, one user working on one computer, by investigating how the best support groups of users interacting with a shared display. One problem that has arisen in SDG research concerns access to private information. Previously, private information could not be displayed on a shared display, it could only be accessed on external devices, such as private monitors or Personal Digital Assistants (PDAs). This paper discusses Single Display Privacyware (SDP), an interaction technique that allows private information to be shown within the context of a shared display. A description of the hardware and software components of our prototype SDP system is given, as are the results of a user study  performed to investigate users interacting in the environment. Conclusions concerning future research in the area of SDP are discussed.",
  "tags": [
    "awareness",
    "CSCW",
    "single display groupware",
    "single display privacyware (SDP)",
    "privacy",
    "collaboration"
  ],
  "authors": [
    {
      "name": "Garth B. D. Shoemaker",
      "institution": "EDGE Lab, School of Computing Science, Simon Fraser University, Burnaby, Canada",
      "img": "/do/10.1145/contrib-81100596912/rel-imgonly/p10009931.jpg",
      "acmid": "81100596912",
      "orcid": "missing"
    },
    {
      "name": "Kori M. Inkpen",
      "institution": "EDGE Lab, School of Computing Science, Simon Fraser University, Burnaby, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    }
  ],
  "references": [
    {
      "text": "M. Agrawala, A. C. Beers, B. Frohlich, P. Hanrahan, I. McDowall, and M. Bolas. The two-user responsive workbench: Support for collaboration through independent views of a shared space. In SIGGRAPH 97 Conference Proceedings, pages 327-332. Addison Wesley, 1997.  ",
      "doi": "10.1145/258734.258875"
    },
    {
      "text": "E. A. Bier and S. Freeman. MMM: A user interface architecture for shared editors on a single screen. In Proceedings of UIST '91, pages 79-86. ACM Press, 1991.  ",
      "doi": ""
    },
    {
      "text": "L. J. Bricker, M. J. Bennett, E. Fujioka, and S. L. Tanimoto. Colt: A system for developing software that supports synchronous collaborative activities. In EdMedia, 1999.",
      "doi": ""
    },
    {
      "text": "A. Butz, T. Hollerer, S. Feiner, B. MacIntyre, and C. Beshers. Enveloping users and computers in a collaborative 3D augmented reality. In Proceedings of IWAR 99 (International Workshop on Augmented Reality), pages 35-44, 1999. ",
      "doi": ""
    },
    {
      "text": "S. Greenberg, M. Boyle, and J. LaBerge. PDAs and shared public displays: Making personal information public, and public information personal. Personal Technologies, 3(1), 1999.",
      "doi": ""
    },
    {
      "text": "C. Gutwin and S. Greenberg. Design for individuals, design for groups: Tradeoffs between power and workspace awareness. In Proceedings of CSCW '98, pages 207-216. ACM Press, 1998.  ",
      "doi": ""
    },
    {
      "text": "C. Gutwin and S. Greenberg. Effects of awareness support on groupware usability. In Proceedings of CHI '98, pages 511-518. ACM Press, 1998.  ",
      "doi": "10.1145/274644.274713"
    },
    {
      "text": "J.-P. Hourcade and B. B. Bederson. Architecture and implementation of a Java package for multiple input devices (MID). Technical Report CS-TR-4018, University of Maryland, May 1999.",
      "doi": ""
    },
    {
      "text": "K. M. Inkpen, W. Ho-Ching, O. Kuederle, S. D. Scott, and G. B. D. Shoemaker. \"This is fun. we're all best friends and we're all playing!\": Supporting children's synchronous collaboration. In Proceedings of CSCL '99, 1999. ",
      "doi": ""
    },
    {
      "text": "K. M. Inkpen, J. McGrenere, K. S. Booth, and M. Klawe. The effect of turn-taking protocols on children's learning in mouse-driven collaborative environments. In Proceedings of Graphics Interface '97, pages 138-145, 1997. ",
      "doi": ""
    },
    {
      "text": "B. A. Myers, H. Stiehl, and R. Gargiulo. Collaboration using multiple PDAs connected to a PC. In Proceedings of CSCW '98, pages 285-294. ACM Press, 1998.  ",
      "doi": ""
    },
    {
      "text": "J. Rekimoto. A multiple device approach for supporting whiteboard-based interactions. In Proceedings of CHI '98, pages 18-23. ACM Press, 1998.  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "S. D. Scott, G. B. D. Shoemaker, and K. M. Inkpen. Towards seamless support of natural collaborative interactions. In Proceedings of Graphics Interface 2000, pages 103-110, 2000.",
      "doi": ""
    },
    {
      "text": "G. B. D. Shoemaker. Supporting private information on public displays. In CHI 2000 Extended Abstracts, pages 349-350. ACM Press, 2000.  ",
      "doi": ""
    },
    {
      "text": "J. Stewart, B. B. Bederson, and A. Druin. Single Display Groupware: A model for co-present collaboration. In Proceedings of CHI '99, pages 286-293. ACM Press, 1999.  ",
      "doi": ""
    },
    {
      "text": "J. Stewart, E. M. Raybourn, B. Bederson, and A. Druin. When two hands are better than one: Enhancing collaboration using Single Display Groupware. In Proceedings of CHI '98, pages 287-288. ACM Press, 1998.  ",
      "doi": "10.1145/286498.286766"
    },
    {
      "text": "Z. Szalavari, E. Eckstein, and M. Gervautz. Collaborative gaming in augmented reality. In Proceedings of VRST 98, pages 195-204, 1998.  ",
      "doi": ""
    },
    {
      "text": "M. Tani, M. Horita, K. Yamaashi, K. Tanikoshi, and M. Futakawa. Courtyard: Integrating shared overview on a large screen and per-user detail on individual screens. In Proceedings of CHI '94, pages 44-50. ACM Press, 1994.  ",
      "doi": ""
    }
  ]
}