{
  "doi": "10.1145/365024.365301",
  "title": "Better home shopping or new democracy?: evaluating community network outcomes",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "372-379",
  "year": 2001,
  "badges": [],
  "abstract": "This is a perspective paper on community networks - socio-technical infrastructures supporting villages, towns, and neighborhoods. Community networking is well-established, world wide, and addresses critical societal issues, such as the “crisis of community” and the sociality of the Internet. However, community network projects have not emphasized evaluation. Relatively little is known about the economic, social, and psychological consequences of community networks for the individuals, groups, and communities served. Evaluating community networks is a momentous mutual opportunity for the development of CHI evaluation methodologies and for bringing technical CHI expertise to bear on societal issues.",
  "tags": [
    "community networks",
    "evaluation",
    "social impact"
  ],
  "authors": [
    {
      "name": "John M. Carroll",
      "institution": "Center for Human-Computer Interaction and Department of Computer Science, Virginia Tech, Blacksburg, VA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    },
    {
      "name": "Mary Beth Rosson",
      "institution": "Center for Human-Computer Interaction and Department of Computer Science, Virginia Tech, Blacksburg, VA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, R.E.,Crespo, C.J., Bartlett, S.J., Cheskin, L.J. &amp; Pratt, M. 1998. Relationship of activity and television watching with body weight and level of fatness among children. Journal of the American Medical Association, 279, 938-942.",
      "doi": ""
    },
    {
      "text": "Anderson, S.E. 1992. Factors associated with usage of a public telecomputing system. Ed.D. Dissertation, Curry School of Education, University of Virginia.",
      "doi": ""
    },
    {
      "text": "Bandura, A. 1997. Self-efficacy: The exercise of control. W.H. Freeman and Company.",
      "doi": ""
    },
    {
      "text": "Beamish, A. 1995. Communities On-Line: Community-Based Computer Networks. Masters Thesis, Department of Urban Studies and Planning, MIT.",
      "doi": ""
    },
    {
      "text": "Bellah, R., Madsen, R., Sullivan, W., Swindler, A. and Tipton, S. 1986. Habits of the heart: Individualism and commitment in American life. U. California Press.",
      "doi": ""
    },
    {
      "text": "Berry, J.M., Portney, K.E. &amp; Thomson, K. 1993. The rebirth of urban democracy. Brookings Institution Press.",
      "doi": ""
    },
    {
      "text": "Bier, M., Gallo, M., Nuckols, E., Sherblom, S. &amp; Pennick, M. 1997. Personal empowerment in the study of home Internet use by low-income families. Journal of Research on Computing in Education, 30(22), 106-119.",
      "doi": ""
    },
    {
      "text": "Campbell, D., &amp; Fiske, D. W. (1959). Convergent and discriminate validation by the multitrait-multimethod matrix. Psychological Bulletin, 4, 297-312.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. &amp; Rosson, M.B. 1996. Developing the Blacksburg Electronic Village. CACM, 39(12), 69-74.  ",
      "doi": ""
    },
    {
      "text": "Cohen, S. &amp; Wills, T.A. 1985. Stress, social support, and the buffering hypothesis. Psychological Bulletin, 98, 310-357.",
      "doi": "10.1037/0033-"
    },
    {
      "text": "Cohill, A.M. &amp; Kavanaugh, A.L. 1997. Community networks: Lessons from Blacksburg, Virginia. Artech House. ",
      "doi": ""
    },
    {
      "text": "Coleman, J.S. 1990. The foundations of social theory. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Constant, D., Sproull, L. &amp; Kiesler, S. 1996. The kindness of strangers: On the usefulness of weak ties for technical advice. Organizational Science, 7, 119-135.",
      "doi": ""
    },
    {
      "text": "Farrington, C. &amp; Pine, E. 1996. Community memory: A case study in community communication. In P. Agre &amp; D. Schuler, eds., Reinventing technology, rediscovering community. Ablex.",
      "doi": ""
    },
    {
      "text": "Finn, J.D. 1993. School engagement and students at risk. National Center for Educational Statistics.",
      "doi": ""
    },
    {
      "text": "Flanagan, J.C. 1954. The critical incident technique. Psychological Bulletin, 51, 28-35.",
      "doi": ""
    },
    {
      "text": "Gantt, M. &amp; Nardi, B. 1992. Gardeners and gurus: Patterns of cooperation among CAD users. Proceedings of CHI'92. ACM, pp. 107-117.  ",
      "doi": "10.1145/142750.142767"
    },
    {
      "text": "Guy, N.K. 1996. Community Networks: Building real communities in a virtual space? MA thesis, Simon Fraser University, Dept of Geography.",
      "doi": ""
    },
    {
      "text": "Gygi, K. 1996. Uncovering Best Practices: A Framework for Assessing Outcomes in Community Computer Networking. Community Networking '96.",
      "doi": ""
    },
    {
      "text": "Hoiem, D. E., &amp; Sullivan, K. D. 1994. Designing and using integrated data collection and analysis tools. Behaviour &amp; Information Technology, 13(1), 160-170.",
      "doi": ""
    },
    {
      "text": "Hoover-Dempsey, K.V., Bassler, O.C. &amp; Brissie, J.S. 1992. Parent efficacy, teacher efficacy, and parent involvement: Explorations in parent-school relations. Journal of Educational Research, 85, 287-294.",
      "doi": ""
    },
    {
      "text": "Krackhardt, D. 1994. The strength of strong ties. In N. Nohria &amp; R. Eccles (Eds.), Networks and organizations: Structure, form, and action. Harvard Business School Press.",
      "doi": ""
    },
    {
      "text": "Kraut, R., Lundmark, V., Patterson, M., Kiesler, S., Mukopadhyay, T. &amp; Scherlis, W. 1998. Internet paradox: A social technology that reduces social involvement and psychological well-being? American Psychologist, 53 (9), 1017- 1031.",
      "doi": ""
    },
    {
      "text": "Kraut, R., Mukhopadhyay, T., Szczpula, J., Kiesler, S. &amp; Scherlis, W. 1998. Communication and information: Alternative uses of the internet in households. Proceedings of CHI 98. ACM, pp. 368-383.  ",
      "doi": "10.1145/274644.274695"
    },
    {
      "text": "Kraut, R., Scherlis, W., Mukhopadhyay, T., Manning, J. &amp; Kiesler, S. 1996. HomeNet: A field trial of residential Internet services. Proceedings of CHI 96. ACM, pp. 284-291.  ",
      "doi": "10.1145/238386.238531"
    },
    {
      "text": "Kubey, R. &amp; Csikszentmihalyi, M. 1990. Television and the quality of life: How viewing shapes everyday experience. Erlbaum.",
      "doi": ""
    },
    {
      "text": "McGrath, J. E. 1994. Methodology matters: Doing research in the behavioral and social sciences",
      "doi": ""
    },
    {
      "text": "Muller, M.J., Haslwanter, J.H. &amp; Dayton, T. 1997. Participatory practices in the software lifecycle. Handbook of Human- Computer Interaction, 2 nd edition. Elsevier, pp. 255-297.",
      "doi": ""
    },
    {
      "text": "Mynatt, E.D., Adler, A., Ito, M., &amp; O'Day, V. 1997. Design for network communities. Proceedings of CHI'97: Conference on Human Factors in Computing Systems. ACM, pp. 210-217.  ",
      "doi": "10.1145/258549.258707"
    },
    {
      "text": "Neale, D.C., Dunlap, D.R., Isenhour, P., and Carroll, J.M. 2000. Collaborative critical incident development. Proceedings of the Human Factors and Ergonomics Society, pp. 598-601.",
      "doi": ""
    },
    {
      "text": "Neuman, S.B. 1991. Literacy in the television age: The myth of the TV effect. Ablex.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. 1993. Usability Engineering. Academic Press. ",
      "doi": ""
    },
    {
      "text": "Patrick, A.S. 1997. Personal and social impacts of going on-line: Lessons from the National Capital FreeNet. http://debra.dgbt.doc.ca/services-research/survey/impacts/",
      "doi": ""
    },
    {
      "text": "Putnam, R.D. 2000. Bowling alone: the crumbling and revival of American community. Simon &amp; Schuster.",
      "doi": ""
    },
    {
      "text": "Rheingold, H. 1993. The Virtual Community: Homesteading on the electronic frontier. Addison-Wesley. ",
      "doi": ""
    },
    {
      "text": "Rogers, E.M., Collins-Jarvis, L. &amp; Schmitz, J. 1994. The PEN Project in Santa Monica: Interactive communication, equality, and political action. Journal of the American Society for Information Science, 45(6), 401-410.  ",
      "doi": ""
    },
    {
      "text": "Scherer, M. 1998. The shelter of each other. Educational Leadership, 55(8), 6-11.",
      "doi": ""
    },
    {
      "text": "Schmitz, J., Rogers, E.M., Phillips, K., &amp; Paschal, D. 1995. The public electronic network (PEN) and the homeless in Santa Monica. Journal of Applied Communication Research, 23, 26- 43.",
      "doi": ""
    },
    {
      "text": "Schuler, D. 1996. New community networks: Wired for change. Addison-Wesley. ",
      "doi": ""
    },
    {
      "text": "Scriven, M. 1967. The methodology of evaluation. In R. Tyler, R. Gagne &amp; M. Scriven, eds., Perspectives of curriculum evaluation. Rand McNally, pp. 39-83.",
      "doi": ""
    },
    {
      "text": "Sears, C. 1996. (Re)Visions of the Village: Building and participating in the Blacksburg Electronic Village. Masters Thesis in Science and Technology Studies, Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Shirley, D. 1997. Laboratories of democracy: Community organizing for school reform. University of Texas Press.",
      "doi": ""
    },
    {
      "text": "Sidney, S., Sternfeld, B., Haskell, W.L., Jacobs, D.R., Chesney, M.A. &amp; Hulley, S.B. 1998. Television viewing and cardiovascular risk factors in young adults: The CARDIA study. Annals of Epidemiology, 6(2), 154-159.",
      "doi": ""
    },
    {
      "text": "Sproull, L. &amp; Kiesler, S. 1991. Connections: New ways of working in the networked organization. MIT Press. ",
      "doi": ""
    },
    {
      "text": "Turkle, S. 1995. Life on the Screen: Identity in the Age of the Internet. Simon and Schuster. ",
      "doi": ""
    },
    {
      "text": "Uncapher, W. 1999. New communities/new communication: Big Sky Telegraph and its community. In M. Smith &amp; P. Kollock, eds., Communities in Cyberspace. Routledge.",
      "doi": ""
    },
    {
      "text": "Wellman, B. &amp; Tindall, D. 1993. Reach out and touch some bodies: How social networks connect telephone networks. Progress in Communication Studies, 12, 63-93.",
      "doi": ""
    }
  ]
}