{
  "doi": "10.1145/365024.365092",
  "title": "Effects of spatial audio on memory, comprehension, and preference during desktop conferences",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "166-173",
  "year": 2001,
  "badges": [],
  "abstract": "An experiment was conducted to determine the effect of spatial audio on memory, focal assurance, perceived comprehension and listener preferences during desktop conferences. Nineteen participants listened to six, pre-recorded, desktop conferences. Each conference was presented using either non-spatial audio, co-located spatial audio, or scaled spatial audio, and during half of the conferences, static visual representations of the conferees were present. In the co-located condition, each conferees voice originated from directly above their image on the screen, and in the scaled spatial audio condition, the spatial separation between conferee voices was increased beyond the visual separation. Results showed that spatial audio improved all measures, increasing memory, focal assurance, and perceived comprehension. In addition, participants preferred spatial audio to non-spatial audio. No strong differences were found in the visual conditions, or between the co-located spatial condition and the scaled spatial conditions.",
  "authors": [
    {
      "name": "Jessica J. Baldis",
      "institution": "Human Interface Technology Laboratory, University of Washington, PO Box 352142, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100522643",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baddeley, A. D. (1987). Working memory. Oxford: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Baddeley, A. D., &amp; Hitch, G. L. (1974). Working memory. In G. Bower (Ed.), The psychology of learning and motivation, Vol. VIII, (pp. 47-90). NY: Academic Press.",
      "doi": ""
    },
    {
      "text": "Blauert, J. (1996). Spatial hearing. London:MIT Press.",
      "doi": ""
    },
    {
      "text": "Egan, J. P., Carterette, E. C., &amp; Thwing, E. J. (1954). Some factors affecting multi-channel listening. J. Acoust. Soc. Am., 26, 774-782.",
      "doi": ""
    },
    {
      "text": "Logie, R. H. (1995). Visuo-spatial working memory. UK: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Mane, A. (1997). Group space: The role of video in multipoint videoconferencing and its implication for design. In K. E. Finn, A. J. Sellen, &amp; S. B. Wilbur (Eds.), Video-mediated communication, (pp. 401-414). New Jersey: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "McKinley, R., Ericson, M., &amp; D'Angelo, W. (1994). 3- Dimensional auditory displays: Development, applications, and performance. Aviation, Space, and Environmental Medicine, May: A31-A38.",
      "doi": ""
    },
    {
      "text": "Pye, R. &amp; Williams, E. (1977). Teleconferencing: Is video valuable or is audio adequate? Telecommunications Policy, (June), 230-241.",
      "doi": ""
    },
    {
      "text": "Wickens, C. D. (1992). Engineering psychology and human performance. NY: HarperCollins Publishers.",
      "doi": ""
    }
  ]
}