{
  "doi": "10.1145/365024.365322",
  "title": "Classroom collaboration in the design of tangible interfaces for storytelling",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "482-489",
  "year": 2001,
  "badges": [],
  "abstract": "We describe the design of tangible interfaces to the KidPad collaborative drawing tool. Our aims are to support the re-enactment of stories to audiences, and integration within real classroom environments. A six-month iterative design process, working with children and teachers in school, has produced the “magic carpet”, an interface that uses pressure mats and video-tracked and barcoded physical props to navigate a story in KidPad. Reflecting on this process, we propose four guidelines for the design of tangible interfaces for the classroom. (1) Use physical size and shysical props to encourage collaboration. (2) Be aware of how different interfaces emphasize different actions. (3) Be aware that superficial changes to the design can produce very different physical interactions. (4) Focus on open low-tech technologies rather than (over) polished products.",
  "tags": [
    "participatory design",
    "tangibles",
    "children",
    "storytelling"
  ],
  "authors": [
    {
      "name": "Danae Stanton",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100250935",
      "orcid": "missing"
    },
    {
      "name": "Victor Bayon",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100371655",
      "orcid": "missing"
    },
    {
      "name": "Helen Neale",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100165082",
      "orcid": "missing"
    },
    {
      "name": "Ahmed Ghali",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100403313",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Sue Cobb",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100349341",
      "orcid": "missing"
    },
    {
      "name": "Rob Ingram",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100067150",
      "orcid": "missing"
    },
    {
      "name": "Claire O'Malley",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593242",
      "orcid": "missing"
    },
    {
      "name": "John Wilson",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533516",
      "orcid": "missing"
    },
    {
      "name": "Tony Pridmore",
      "institution": "Mixed Reality Laboratory, University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100377785",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alborzi, H., Druin, A., Montemayor, J., Sherman, L., Taxen G., Best, J., Hammer, J., Kruskal, A., Lal, A., Plaisant Schwenn, T., Sumida, L., Wagner, R. &amp; Hendler, J., Designing StoryRooms: Interactive storytellng spaces for children, Proc. Designing Interactive Systems (DIS) 2000, ACM Press.]]  ",
      "doi": "10.1145/347642.347673"
    },
    {
      "text": "Benford, S., Bederson, B., Akesson, K.-P., Bayon, V., Druin, A., Hansson, P., Hourcade, J., Ingram, R., Neale, H., O'Malley, C., Simsarian, K., Stanton, D., Sundblad, Y., &amp; Tax~n, G., Designing storytelling technologies to encourage collaboration between young children. Proc. CHI 2000, ACM Press, 556-563.]]  ",
      "doi": "10.1145/332040.332502"
    },
    {
      "text": "Benford, S., Greenhalgh, C., Reynard, G., Brown, C., &amp; Koleva, B., Understanding and constructing shared spaces with mixed reality boundaries, ACM ToCHI, 5 (3), 185- 223.]]  ",
      "doi": "10.1145/292834.292836"
    },
    {
      "text": "Bobick, A., Intille, S., Davis, J., Baird, F., Pinhanez, C., Campbell, L., Ivanov, Y., Schutte, A., &amp; Wilson, A., The KidsRoom: A perceptually-based interactive and immersive story environment. Presence: Teleoperators and Virtual Environments, 8(4), 367-391, 2000.]]  ",
      "doi": "10.1162/105474699566297"
    },
    {
      "text": "Crook, C., Computers and the Collaborative Experience of Learning: Routledge, 1994.]] ",
      "doi": "10.5555/193913"
    },
    {
      "text": "DfEE., The National Literacy Strategy: Framework for Teaching. UK: Department for Education and Employment, 1998.]]",
      "doi": ""
    },
    {
      "text": "Druin, A. Cooperative inquiry: Developing new technologies for children with children. Proc. CHI'99, ACM Press.]]  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Druin, A., Stewart, J., Proft, D., Bederson, B., &amp; Hollan, J,. KidPad: A design collaboration between children, technologists and educators. Proc. CHI'97, ACM Press.]]  ",
      "doi": "10.1145/258549.258866"
    },
    {
      "text": "Galata A., Johnson, N. &amp; Hogg, D. Learning behaviour models of human activities, In: T. Pridmore &amp; D. Elliman (eds), Proc 10 th British Machine Vision Conference, pp 23-32, BMVA Press 1999.]]",
      "doi": ""
    },
    {
      "text": "Gorbet, M., Orth, M., &amp; Ishii, H. Triangles: Tangible interface for manipulation and exploration of digital information topography, Proc. CHI'98, ACM, 49-56.]]  ",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "Frei, P, Su, V., Mikhak, B. &amp; Ishii, H., Curlybot: Designing a new class of computational toys, Proc. CHI'2000, ACM Press.]]  ",
      "doi": "10.1145/332040.332416"
    },
    {
      "text": "Heath, C. &amp; Luff, P., Collaborative activity and technological design: Task coordination in London Underground control rooms, Proc. ECSCW91, Kluwer, 1991.]] ",
      "doi": "10.5555/1241910.1241915"
    },
    {
      "text": "Ishii, H., &amp; Ullmer, B. Tangible bits: Towards seamless interfaces between people, bits and atoms. Proc. CHI'97, ACM Press, 234-241.]]  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Koschmann, T. (Ed.). CSCL: Theory and Practice of an Emerging Paradigm: Lawrence Erlbaum, 1996.]]",
      "doi": ""
    },
    {
      "text": "Neale, H. &amp; Nichols, S. Theme-Based Content Analysis: A flexible method for virtual environment evaluation. International Journal of Human Computer Studies.]]  ",
      "doi": "10.1006/ijhc.2001.0475"
    },
    {
      "text": "O'Malley, C. Designing computer systems to support peer learning. European Journal of Psychology of Education, 7(4), 339-352, 1992.]]",
      "doi": ""
    },
    {
      "text": "O'Malley, C. (Ed.). Computer Supported Collaborative Learning: Springer-Verlag, 1995.]]",
      "doi": ""
    },
    {
      "text": "Patten, J., Griffith, L., &amp; Ishii, H. A tangible interface for controlling robotic toys. Proc. CHI2000, ACM.]]  ",
      "doi": "10.1145/633292.633454"
    },
    {
      "text": "Rogoff, B., Apprenticeship in Thinking: Cognitive Development in Social Context. New York: Oxford University Press, 1990.]]",
      "doi": ""
    },
    {
      "text": "Ryokai, K. &amp; Cassel, J., Computer Support for Children's Collaborative Fantasy Play and Story Telling, Proc. CSCL'99 (Stanford CA).]] ",
      "doi": "10.5555/1150240.1150303"
    },
    {
      "text": "Stanton, D., Wilson, P., Duffy, H., &amp; Foreman, N. Virtual environments as spatial training aids for children and adults with physical disabilities. Proc. 3 rd International Conference on Disability, Virtual Reality and Associated Technologies (Sardinia, 23-25 2000).]]",
      "doi": ""
    },
    {
      "text": "Stewart, J., Bederson, B., &amp; Druin, A., Single display groupware: A model for co-present collaboration. Proc. CHI'99, ACM Press, 287-288.]]  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Wood, D., &amp; O'Malley, C., Collaborative learning between peers: An overview. Educational Psychology in Practice, 11(4), 4-9, 1996.]]",
      "doi": ""
    }
  ]
}