{
  "doi": "10.1145/365024.365064",
  "title": "Predicting the effects of in-car interfaces on driver behavior using a cognitive architecture",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "120-127",
  "year": 2001,
  "badges": [],
  "abstract": "When designing and evaluating in-car user interfaces for drivers, it is essential to determine what effects these interfaces may have on driver behavior and performance. This paper describes a novel approach to predicting effects of in-car interfaces by modeling behavior in a cognitive architecture. A cognitive architecture is a theoretical frame-work for building computational models of cognition and performance. The proposed approach centers on integrating a user model for the interface with an existing driver model that accounts for basic aspects of driver behavior (e.g., steering and speed control). By running the integrated model and having it interact with the interface while driving, we can generate a priori predictions of the effects of interface use on driver performance. The paper illustrates the approach by comparing four representative dialing interfaces for an in-car, hands-free cellular phone. It also presents an empirical study that validates several of the qualitative and quantitative predictions of the model.",
  "authors": [
    {
      "name": "Dario D. Salvucci",
      "institution": "Nissan Cambridge Basic Research, Four Cambridge Center, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289294",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alm, H., &amp; Nilsson, L. (1994). Changes in driver behaviour as a function of hands-free mobile phones - A simulator study. Accident Analysis &amp; Prevention, 26, 441-451.",
      "doi": ""
    },
    {
      "text": "Anderson, J. R., &amp; Lebiere, C. (1998). The atomic components of thought. Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Anderson, J. R., Matessa, M., &amp; Lebiere, C. (1997). ACT-R: A theory of higher level cognition and its relation to visual attention. Human-Computer Interaction, 12, 439-462.  ",
      "doi": "10.1207/s15327051hci1204_5"
    },
    {
      "text": "Beusmans, J., &amp; Rensink, R. (Eds.) (1995). Cambridge Basic Research 1995 Annual Report (Tech. Rep. No. CBR-TR-95-7). Cambridge, MA: Nissan Cambridge Basic Research.",
      "doi": ""
    },
    {
      "text": "Brookhuis, K. A., De Vries, G., &amp; De Waard, D. (1991). The effects of mobile telephoning on driving performance. Accident Analysis &amp; Prevention, 23, 309-316.",
      "doi": ""
    },
    {
      "text": "Byrne, M. D., &amp; Anderson, J. R. (1998). Perception and action. In J. R. Anderson &amp; C. Lebiere (Eds.), The Atomic Components of Thought (pp. 167-200). Hillsdale, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T., &amp; Newell, A. (1983). The psychology of human-computer interaction. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Gray, W. D., John, B. E., &amp; Atwood, M. E. (1993). Project Ernestine: A validation of GOMS for prediction and explanation of real-world task performance. Human-Computer Interaction, 8, 237-309.",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "Hildreth, E. C., Beusmans, J. M. H., Boer, E. R., &amp; Royden, C. S. (in press). From vision to action: Experiments and models of steering control during driving. Journal of Experimental Psychology: Human Perception and Performance, in press.",
      "doi": ""
    },
    {
      "text": "Kieras, D. E., Wood, S. D., &amp; Meyer, D. E. (1997). Predictive engineering models based on the EPIC architecture for a multimodal high-performance human-computer interaction task. ACM Transactions on Computer-Human Interaction, 4, 230-275.  ",
      "doi": "10.1145/264645.264658"
    },
    {
      "text": "McKnight, A. J., &amp; McKnight, A. S. (1993). The effect of cellular phone use upon driver attention. Accident Analysis &amp; Prevention, 25, 259-265.",
      "doi": ""
    },
    {
      "text": "Newell, A. (1990). Unified theories of cognition. Cambridge, MA: Harvard University Press. ",
      "doi": "10.5555/86564"
    },
    {
      "text": "Reed, M. P., &amp; Green, P. A. (1999). Comparison of driving performance on-road and in a low-cost simulator using a concurrent telephone dialing task. Ergonomics, 42, 1015-1037.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. D., Boer, E. R., &amp; Liu, A. (in press). Toward an integrated model of driver behavior in a cognitive architecture. Transportation Research Record.",
      "doi": ""
    },
    {
      "text": "Serafin, C., Wen, C., Paelke, G., &amp; Green, P. (1993). Development and human factors tests of cell phones (Tech. Rep. No. UMTRI- 93-17). Ann Arbor, MI: The University of Michigan Transportation Research Institute.",
      "doi": ""
    },
    {
      "text": "VanLehn, K. (Ed.) (1991). Architectures for intelligence: The twenty-second Carnegie Mellon symposium on cognition. Hillsdale, NJ: Erlbaum.",
      "doi": ""
    }
  ]
}