{
  "doi": "10.1145/365024.365312",
  "title": "Partitioning digital worlds: focal and peripheral awareness in multiple monitor use",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "458-465",
  "year": 2001,
  "badges": [],
  "abstract": "Software today does not help us partition our digital worlds effectively. We must organize them ourselves. This field study of users of multiple monitors examines how people with a lot of display space arrange information. Second monitors are generally used for secondary activities related to principal tasks, for peripheral awareness of information that is not the main focus, and for easy access to resources. A second monitor improves efficiency in ways that are difficult to measure yet can have substantial subjective benefit. The study concludes with illustrations of shortcomings of today's systems and applications: the way we work could be improved at relatively low cost.",
  "authors": [
    {
      "name": "Jonathan Grudin",
      "institution": "Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/do/10.1145/contrib-81100031531/rel-imgonly/jonathan_grudin.jpg",
      "acmid": "81100031531",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bederson, B.B. and Hollan, J.D. (1994). Pad++: A zooming graphical interface for exploring alternate interface physics. Proc. UIST'94, 17-18.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "Cypher, A. (1986). The structure of users' activities. In D. Norman and S. Draper (Eds.), User Centered System Design (pp. 243-263). Erlbaum.",
      "doi": ""
    },
    {
      "text": "Furnas, G. (1986). Generalized fisheye views. Proc. CHI'86, 16-23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Gutwin, C., Roseman, M. and Greenberg, S. (1996). A usability study of awareness widgets in a shared workspace groupware system. Proc. CSCW'96, 258- 267.  ",
      "doi": "10.1145/240080.240298"
    },
    {
      "text": "Harrison, S. and Dourish, P. (1996). Re-Placing space: The roles of place and space in collaborative systems. Proc. CSCW'96, 67-76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Henderson, D.A. and Card, S. (1986). Rooms: The use of multiple virtual workspaces to reduce space contention in a window-based graphical user interface. ACM Transactions on Graphics, 5, 3, 211-243.  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "Ishii, H. &amp; Ullmer, B. (1997). Tangible bits: Towards seamless interfaces between people, bits and atoms. Proc. CHI'97, 234-241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Norman, D.A. (1998). Invisible Computer. MIT Press. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Robertson, G.G., Czerwinski, M., Larson, K., Robbins, D.C., Thiel, D. and van Dantzich, M. (1998). Data Mountain: Using spatial memory for document management. Proc. UIST'98, 153-162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Smith, R.B. and Taivalsaari, A. (1999). Generalized and stationery Scrolling. Proc. UIST'99, 1-9.  ",
      "doi": "10.1145/320719.322577"
    },
    {
      "text": "Streitz, N.A., Geibler, J., Holmer, T., Konomi, S., Muller-Tomfelde, C., Reischl, W., Rexroth, P, Seitz, P. &amp; Steinmetz, R. (1999). i-LAND: An interactive landscape for creativity and innovation. Proc. CHI'99, 120-127.  ",
      "doi": "10.1145/302979.303010"
    }
  ]
}