{
  "doi": "10.1145/365024.365100",
  "title": "On the road and on the Web?: comprehension of synthetic and human speech while driving",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "206-212",
  "year": 2001,
  "badges": [],
  "abstract": "In this study 24 participants drove a simulator while listening to three types of messages in both synthesized speech and recorded human speech. The messages consisted of short navigation messages, medium length (approximately 100 words) email messages, and longer news stories (approximately 200 words). After each message the participant was presented with a series of multiple choice questions to measure comprehension of the message. Driving performance was recorded. Findings show that for the low driving workload conditions in the study, (cruise control, predictable two-lane road with no intersections, invariant lead car) driving performance was not affected by listening to messages. This was true for both the synthesized speech and natural speech. Comprehension of messages in synthetic speech was significantly lower than for recorded human speech for all message types.",
  "authors": [
    {
      "name": "Jennifer Lai",
      "institution": "IBM Corporation, T.J. Watson Research Center, Hawthorne, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452599499",
      "orcid": "missing"
    },
    {
      "name": "Karen Cheng",
      "institution": "IBM Corporation, T.J. Watson Research Center, Hawthorne, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100100757",
      "orcid": "missing"
    },
    {
      "name": "Paul Green",
      "institution": "University of Michigan, Transportation Research Institute, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659882398",
      "orcid": "missing"
    },
    {
      "name": "Omer Tsimhoni",
      "institution": "University of Michigan, Transportation Research Institute, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81100633125/rel-imgonly/had_0200.jpg",
      "acmid": "81100633125",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alm, H., Nilsson, L. (1995) The Effects of a mobile telephone task on driver behavior in a car following situation. Accident Analysis and Prevention, 27(5), pp.707-715",
      "doi": ""
    },
    {
      "text": "Brown, I. D. (1965). Effect of a car radio on driving in traffic. Ergonomics, 8(4), 475-479.",
      "doi": ""
    },
    {
      "text": "Bruno, A. (1999) Auto Industry Drives Telematic Services. RCR Radio Communications Report, v18, n37, September 13, 1999",
      "doi": ""
    },
    {
      "text": "Fleming, J., Green, P., and Katz, S. (1998). Driver Performance and Memory for Traffic Messages: Effects of the Number of Messages, Audio Quality, and Relevance Technical Report UMTRI-98-22, Ann Arbor, MI: The University of Michigan Transportation Research Institute.",
      "doi": ""
    },
    {
      "text": "Francis, A.L., Nusbaum, H.C. (1999). Evaluating the quality of Synthetic Speech. In Gardner-Bonneau, D. (Ed.), Human Factors and Voice Interactive Systems (pp. 63 - 97)",
      "doi": ""
    },
    {
      "text": "Goodman, M., Bents, F.D., Tijerina, L., Wierwille, W., Lerner, N., and Benel, D. (1997). An Investigation of the Safety Implications of Wireless Communication in Vehicles (Technical Report DOT HS 808 635), Washington,D.C.: U.S. Department of Transportation",
      "doi": ""
    },
    {
      "text": "Jaencke, L., Musial, F., Wogt, J., &amp; Kalveram, K. T. (1994). Monitoring radio programs and time of day affect simulated car-driving performance. Perceptual &amp; Motor Skills, 79(2), 484-486.",
      "doi": ""
    },
    {
      "text": "Lai, J., Wood, D., Considine, M., The Effect of Task Conditions on the Comprehensibility of Synthetic Speech. ACM SIGCHI CHI 2000 Proceedings pp. 321- 328  ",
      "doi": "10.1145/332040.332451"
    },
    {
      "text": "Lee, J.D., Caven, B., Haanke, S., Brown, T. (under review). Speech-based Interaction with In-vehicle Computers: The Effect of Speech-based E-mail on Drivers Attention to the Roadway. Human Factors",
      "doi": ""
    },
    {
      "text": "Redelmeier, D.A.,Tibshirani,R.J. (1997) Association between cellular-telephone calls and motor vehicle collisions. New England Journal of Medicine 336(7) pp.453-458",
      "doi": ""
    },
    {
      "text": "Violanti, J.M., (1997) Cellular phones and Traffic Accidents. Public Health, 111(6) pp.423-428",
      "doi": ""
    },
    {
      "text": "www.driverdistraction.org",
      "doi": ""
    }
  ]
}