{
  "doi": "10.1145/365024.365030",
  "title": "Laser pointer interaction",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "17-22",
  "year": 2001,
  "badges": [],
  "abstract": "Group meetings and other non-desk situations require that people be able to interact at a distance from a display surface. This paper describes a technique using a laser pointer and a camera to accomplish just such interactions. Calibration techniques are given to synchronize the display and camera coordinates. A series of interactive techniques are described for navigation and entry of numbers, times, dates, text, enumerations and lists of items. The issues of hand jitter, detection error, slow sampling and latency are discussed in each of the interactive techniques.",
  "authors": [
    {
      "name": "Dan R. Olsen",
      "institution": "Computer Science Department, Brigham Young University, Provo, UT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410595121",
      "orcid": "missing"
    },
    {
      "name": "Travis Nielsen",
      "institution": "Computer Science Department, Brigham Young University, Provo, UT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332518387",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "http://www.mimio.com/",
      "doi": ""
    },
    {
      "text": "Crowley, J. L., Coutaz, J., and Berard, F. \"Things that See\" Communications of the ACM 43, 3 (March 2000), pp 54-64.  ",
      "doi": "10.1145/330534.330540"
    },
    {
      "text": "Berard, F. \"The Perceptual Window: Head Motion as a New Input Stream\" Proceedings of the 7 th IFIP conference on Human-Computer Interaction (INTERACT), (Sept 1999).",
      "doi": ""
    },
    {
      "text": "Reilly, R. B., \"Applications of Face and Gesture Recognition for Human-Computer Interaction,\" Proceedings of the 6 th ACM International Multimedia Conference on Face/Gesture Recognition and their Applications, (1998), pp 20-27.  ",
      "doi": "10.1145/306668.306677"
    },
    {
      "text": "Olsen, D. R., Jefferies, S., Nielsen, T., Moyes, W., Fredrickson, P., \"Cross-modal Interaction Using XWeb,\" Proceedings of the 13 th Annual ACM Symposium on User Interface Software and Technology (UIST '00), (Nov 2000).  ",
      "doi": "10.1145/354401.354764"
    },
    {
      "text": "Zhai, S., Morimoto, C., and Ihde, S., \"Manual and Gaze Input Cascaded (MAGIC) Pointing,\" Proceedings of Human Factors in Computing Systems (CHI '99), (May 1999), 246-253.  ",
      "doi": "10.1145/302979.303053"
    },
    {
      "text": "Jacob, R. J.K., \"The Use of Eye Movements in Human- Computer Interaction Techniques: What You Look at is What You Get,\" ACM Transactions on Information Systems, 9, 3 (April 1991), pp 152-169.  ",
      "doi": "10.1145/123078.128728"
    },
    {
      "text": "Kirstein, C. and M~ller, H. \"Interaction with a Projection Screen Using a Camera-Tracked Laser Pointer.\" Proceedings of The International Conference on Multimedia Modeling. IEEE Computer Society Press, (1998) ",
      "doi": "10.5555/823464.824324"
    }
  ]
}