{
  "doi": "10.1145/365024.365115",
  "title": "DataTiles: a modular platform for mixed physical and graphical interactions",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "269-276",
  "year": 2001,
  "badges": [],
  "abstract": "The DataTiles system integrates the benefits of two major interaction paradigms: graphical and physical user interfaces.  Tagged transparent tiles are used as modular construction units.  These tiles are augmented by dynamic graphical information when they are placed on a sensor-enhanced flat panel display.  They can be used independently or can be combined into more complex configurations, similar to the way language can express complex concepts through a sequence of simple words. In this paper, we discuss our design principles for mixing physical and graphical interface techniques, and describe the system architecture and example applications of the DataTiles system.",
  "authors": [
    {
      "name": "Jun Rekimoto",
      "institution": "Interaction Laboratory, Sony Computer Science Laboratories, Inc., 3-14-13 Higashigotanda, Shinagawa-ku, Tokyo 141-0022 Japan",
      "img": "/do/10.1145/contrib-81100008564/rel-imgonly/p2.png",
      "acmid": "81100008564",
      "orcid": "0000-0002-3629-2514"
    },
    {
      "name": "Brygg Ullmer",
      "institution": "Tangible Media Group, MIT Media Laboratory, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100226633",
      "orcid": "missing"
    },
    {
      "name": "Haruo Oba",
      "institution": "Interaction Laboratory, Sony Computer Science Laboratories, Inc., 3-14-13 Higashigotanda, Shinagawa-ku, Tokyo 141-0022 Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100154483",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "David Anderson, James L. Frankel, Joe Marks, Aseem Agarwala, Paul Beardsley, Jessica Hodgins, Darren Leigh, Kathy Ryall, Eddie Sullivan, and Jonathan S. Yedidia. Tangible Interaction + Graphical Interpretation: A new approach to 3D modeling. In SIGGRAPH 2000 Conference Proceedings, pages 393-402, 2000.  ",
      "doi": "10.1145/344779.344960"
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony DeRose. Toolglass and Magic Lenses: The see-through interface. In James T. Kajiya, editor, Computer Graphics (SIGGRAPH '93 Proceedings), volume 27, pages 73-80, August 1993.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "George W. Fitzmaurice, Hiroshi Ishii, and William Buxton. Bricks: laying the foundations for graspable user interfaces. In CHI'95 Conference, pages 442-449, 1995.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "M.G. Gorbet, M. Orth, and Hiroshi Ishii. Triangles: Tangible interface for manipulation and exploration of digital information topography. In CHI'98 Proceedings, pages 49-56, 1998.  ",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "System Watt Inc. ROBOCUBE. http://www.watt.co.jp.",
      "doi": ""
    },
    {
      "text": "Texas Instruments. Radio frequency identification systems. http://www.ti.com/tiris/.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. Tangible Bits: Towards seamless interfaces between people, bits and atoms. In CHI'97 Proceedings, pages 234-241, 1997.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "W.E. Mackay, D.S. Pagani, L. Faber, B. Inwood, P. Launiainen, L. Brenta, and V. Pouzol. Ariel: augmenting paper engineering drawings. In CHI'95 Conference Companion, pages 420-422, 1995.  ",
      "doi": "10.1145/223355.223763"
    },
    {
      "text": "Tim McNerney. Tangible programming bricks: An approach to making programming accessible to everyone. MS Thesis, MIT Media Lab, 2000.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. Pick-and-Drop: A Direct Manipulation Technique for Multiple Computer Environments. In Proceedings of UIST'97, pages 31-39, October 1997.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Jun Rekimoto. Time Machine Computing: A timecentric approach for the information environment. In Proceedings of ACM UIST'99, pages 45-54, 1999.  ",
      "doi": "10.1145/320719.322582"
    },
    {
      "text": "Jun Rekimoto and Katashi Nagao. The world through the computer: Computer augmented interaction with real world environments. In Proceedings of ACM UIST'95, pages 29-36, November 1995.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Jun Rekimoto and Masanori Saitoh. Augmented Surfaces: A spatially continuous workspace for hybrid computing environments. In Proceedings of ACM CHI'99, pages 378-385, May 1999.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Dieter Schmalsteig, Miguel Encarnacao, and Zsolt Szalavari. Using transparent props for interaction with the virtual table. In Proc. of Interactive 3D Graphics (I3DG'99), 1999.  ",
      "doi": "10.1145/300523.300542"
    },
    {
      "text": "Itiro Siio. InfoBinder: a pointing device for a virtual desktop system. In 6th International Conference on Human-Computer Interaction (HCI International '95), pages 261-264, July 1995.",
      "doi": ""
    },
    {
      "text": "H. Suzuki and H. Kato. AlgoBlock: a tangible programming language, a tool for collaborative learning. In Proceedings of 4th European Logo Conference, pages 297-303, August 1993.",
      "doi": ""
    },
    {
      "text": "Y. Tanaka and T. Imataki. IntelligentPad: A hypermedia system allowing functional composition of active media objects through direct manipulations. In Proc. of th IFIP 11th World Computer Congress, pages 541-546, 1989.",
      "doi": ""
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Dylan Glas. mediaBlocks: Physical containers, transports, and controls for online media. In SIGGRAPH'98 Proceedings, pages 379-386, 1998.  ",
      "doi": "10.1145/280814.280940"
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. Illuminating Light: An optical design tool with a luminous-tangible interface. In CHI'98 Proceedings, pages 542-549, 1998.  ",
      "doi": "10.1145/274644.274717"
    },
    {
      "text": "Mark Weiser. The computer for the twenty-first century. Scientific American, pages 94-104, September 1991.",
      "doi": ""
    },
    {
      "text": "Pierre Wellner. The DigitalDesk calculator: Tangible manipulation on a desk top display. In Proceedings of UIST'91, ACM Symposium on User Interface Software and Technology, pages 27-34, November 1991.  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "P. Yarin. Towards the distributed visualization of usage history. MS Thesis, MIT Media Lab, 1999.",
      "doi": ""
    }
  ]
}