{
  "doi": "10.1145/365024.365034",
  "title": "Cookies and Web browser design: toward realizing informed consent online",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "46-52",
  "year": 2001,
  "badges": [],
  "abstract": "We first provide criteria for assessing informed consent online. Then we examine how cookie technology and Web browser designs have responded to concerns about informed consent. Specifically, we document relevant design changes in Netscape Navigator and Internet Explorer over a 5-year period, starting in 1995. Our retrospective analyses leads us to conclude that while cookie technology has improved over time regarding informed consent, some startling problems remain. We specify six of these problems and offer design remedies. This work fits within the emerging field of Value-Sensitive Design.",
  "authors": [
    {
      "name": "Lynette I. Millett",
      "institution": "Department of Computer Science, Cornell University, Ithaca, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100351532",
      "orcid": "missing"
    },
    {
      "name": "Batya Friedman",
      "institution": "The Information School, University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636215",
      "orcid": "missing"
    },
    {
      "name": "Edward Felten",
      "institution": "Department of Computer Science, Princeton University, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100373505",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "The Belmont Report: Ethical Principles and Guidelines for the Protection of Human Subjects of Research. The National Commission for the Protection of Human Subjects of Biomedical and Behavioral Research. 1978.",
      "doi": ""
    },
    {
      "text": "Cookie Central. All copyright 1997, 1998, Cookie Central. http://www.cookiecentral.com .",
      "doi": ""
    },
    {
      "text": "Faden, R, and Beauchamp, T. A History and Theory of Informed Consent. Oxford University Press, New York NY, 1986.",
      "doi": ""
    },
    {
      "text": "Friedman, B. (Ed.) Human Values and the Design of Computer Technology. Cambridge University Press, New York NY, 1997. ",
      "doi": "10.5555/278213"
    },
    {
      "text": "Friedman, B. Value-Sensitive Design: A Research Agenda for Information Technology. (Contract No: SBR-9729633). National Science Foundation, Arlington, VA, 1999.",
      "doi": ""
    },
    {
      "text": "Friedman, B., Felten, E., and Millett, L. I. Informed Consent Online: A Conceptual Model and Design Principles. UW-CSE Technical Report Number 2000- 12-2, 2000.",
      "doi": ""
    },
    {
      "text": "Friedman, B., Kahn, P. H., Jr., &amp; Howe, D. C. Trust online. Communications of the ACM, 43(12), (2000), 34-40.  ",
      "doi": "10.1145/355112.355120"
    },
    {
      "text": "\"IE5 release data announced as March 18 th , 1999.\" Thread in uk.comp.os.win95.",
      "doi": ""
    },
    {
      "text": "Internet Explorer Products Download. http://www.microsoft.com/windows/ie/download/ie5all. htm .",
      "doi": ""
    },
    {
      "text": "Mayer-Schonberg, V. The Internet and privacy legislation: Cookies for a treat? West Virginia Journal of Law and Technology 1(1), 1997.",
      "doi": ""
    },
    {
      "text": "http://www.wvjolt.wvu.edu/wvjolt/current/issues1/articl es/mayer/mayer.htm .",
      "doi": ""
    },
    {
      "text": "Nass, C. I., Moon, Y., Morkes, J., Kim, E., &amp; Fogg, B. J. Computers are social actors: A review of current research. In B. Friedman (ed.), Human Values and the Design of Computer Technology (pp. 137-162). Cambridge University Press, New York NY, 1997. ",
      "doi": "10.5555/278213.278222"
    },
    {
      "text": "\"Netscape 4.6 is out..\" Thread in visi.general.",
      "doi": ""
    },
    {
      "text": "Netscape Products: Archived Products. http://home.netscape.com/download/archive/index.html",
      "doi": ""
    },
    {
      "text": "Nissenbaum, H. Accountability in a computerized society. Science and Engineering Ethics, 2 (1996), 25-42.",
      "doi": ""
    },
    {
      "text": "Reeves, B., &amp; Nass, C. The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Cambridge University Press, New York NY, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "\"Relese {sic} date for NSC4?\" Thread in comp.infosystems.www.browsers.ms-windows.",
      "doi": ""
    },
    {
      "text": "Thomas, J. C. Steps toward universal access in a communications company. In B. Friedman (ed.), Human Values and the Design of Computer Technology (1997), Cambridge University Press, New York NY, 271-287. ",
      "doi": "10.5555/278213.278231"
    },
    {
      "text": "Whalen, D. The Unofficial Cookie FAQ V. 2.53. http://www.cookiecentral.com/faq/. May, 1999.",
      "doi": ""
    },
    {
      "text": "Wilson, B. Browser History, Internet Explorer. http://kempelen.inf.bme.hu/htmlhelp/history/ie.htm",
      "doi": ""
    },
    {
      "text": "Wilson, B. Browser History, Netscape. http://kempelen.inf.bme.hu/htmlhelp/history/netscape.htm",
      "doi": ""
    }
  ]
}