{
  "doi": "10.1145/365024.365299",
  "title": "Model for unistroke writing time",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "357-364",
  "year": 2001,
  "badges": [],
  "abstract": "Unistrokes are a viable form of text input in pen-based user interfaces. However, they are a very heterogeneous group of gestures the only common feature being that all are drawn with a single stroke. Several unistroke alphabets have been proposed including the original Unistrokes, Graffiti, Allegro, T-Cube and MDITIM. Comparing these methods usually requires a lengthy study with many writers and even then the results are biased by the earlier handwriting experience that the writers have. Therefore, a simple descriptive model for predicting the writing time for an expert user on any given unistroke alphabet thus enabling sounder argumentation on the properties of different writing methods.",
  "tags": [
    "modeling of motor performance",
    "handwriting",
    "pen input"
  ],
  "authors": [
    {
      "name": "Poika Isokoski",
      "institution": "Computer-Human Interaction Group, Dept. of Computer and Information Sciences, FIN-33014 University of Tampere, Finland",
      "img": "/do/10.1145/contrib-81100311272/rel-imgonly/poika2_smaller.jpg",
      "acmid": "81100311272",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "3Com, PalmPilot Handbook, 1997, http: //www.palm.com/support/handbooks/palmpilothb.pdf",
      "doi": ""
    },
    {
      "text": "Accot J., and Zhai S., Beyond Fitts' Law: Models for Trajectory-based HCI Tasks. Proc. of CHI 97, ACM, 1997, 295 - 302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Card, S. K, Moran, T. P., and Newell, A., The Psychology of Human-Computer Interaction, Lawrence Erlbaum Associates Inc., Hillsdale, New Jersey, USA, 1983. ",
      "doi": ""
    },
    {
      "text": "Carnagie Mellon University Human Computer Interaction Institute, Amulet home page, http://www.cs.cmu.edu/afs/cs/project/amulet/www/amulet -home.html",
      "doi": ""
    },
    {
      "text": "Fonix, Allegro handwriting recognition, http://www.fonix.com/products/allegro.html",
      "doi": ""
    },
    {
      "text": "Gaur A., A History of Writing, British Library, London. 1987.",
      "doi": ""
    },
    {
      "text": "Goldberg, D., Unistrokes For Computerized Interpretation of Handwriting. United States Patent 5596656, 1997.",
      "doi": ""
    },
    {
      "text": "Goldberg, D., and Richardson, C., Touch-typing with a stylus. Proc. of INTERCHI93, ACM Press, 1993, 80-87.  ",
      "doi": "10.1145/169059.169093"
    },
    {
      "text": "Guiard, Y., On Fitts' and Hooke's laws: Simple harmonic movement in upper-limb cyclical aiming. Acta Psychologica, North Holland, 1993, vol 82, 139-159.",
      "doi": ""
    },
    {
      "text": "Isokoski, P. and Raisamo, R., Device Independent Text Input: A Rationale and an Example, Proceedings of Advanced Visual Interfaces 2000, ACM, 2000, 76-83.  ",
      "doi": ""
    },
    {
      "text": "John, B. E. and Kieras, D. E., The GOMS family of analysis techniques: Tools for design and evaluation, Carnegie Mellon University School of Computer Science Technical Report No. CMU-CS-94-181, 1994. ",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Fitts' law as a performance model in human-computer interaction. Doctoral dissertation. University of Toronto, 1991. ",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Zhang, S. X., and Soukoreff, R. W., Text entry using soft keyboards. Behaviour &amp; Information Technology, 1999, vol 18 (4), 235-244.",
      "doi": ""
    },
    {
      "text": "Plamondon R., Looking at handwriting generation from a velocity control perspective. Acta Psychologica, North Holland, 1993, vol 82, 89-101.",
      "doi": ""
    },
    {
      "text": "Rubine, D., Specifying gestures by example, Computer Graphics. ACM SIGGRAPH, Addison Wesley, Jul. 1991, 329-337.  ",
      "doi": ""
    },
    {
      "text": "Soukoreff, R. W., and MacKenzie I. S., Tehoretical upper and lower bounds on typing speed using as stylus and a soft keyboard. Behaviour &amp; Information Technology, 1995, vol 14 (6), 370 - 379.",
      "doi": ""
    },
    {
      "text": "Smith K. U., and Smith T. J., A Study of Handwriting and Its Implications for Cognitive Considerations in Human- Computer Interactions, International Journal of Human-Computer Interaction, 1991, vol 3(1), 1-30",
      "doi": ""
    },
    {
      "text": "Teulings, H-L., and Shoemaker, L. R. B., Invariant properties between stroke features in handwriting. Acta Psychologica, North Holland, 1993, vol 82, 69-88.",
      "doi": ""
    },
    {
      "text": "Venolia, D., and Neiberg F., T-Cube: A Fast, Self- Discrolsin Pen-Based Alphabet, Proceedings of the CHI 94, ACM, 1999, 265-270.  ",
      "doi": ""
    },
    {
      "text": "Wright, C. E., Evaluating the special role of time in the control of handwriting. Acta Psychologica, North Holland, 1993, vol 82, 5-52.",
      "doi": ""
    }
  ]
}