{
  "doi": "10.1145/365024.365310",
  "title": "Automating camera management for lecture room environments",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "442-449",
  "year": 2001,
  "badges": [],
  "abstract": "Given rapid improvements in network infrastructure and streaming-media technologies, a large number of corporations and universities are recording lectures and making them available online for anytime, anywhere access. However, producing high-quality lecture videos is still labor intensive and expensive. Fortunately, recent technology advances are making it feasible to build automated camera management systems to capture lectures. In this paper we report on our design, implementation and study of such a system. Compared to previous work-which has tended to be technology centric-we started with interviews with professional video producers and used their knowledge and expertise to create video production rules. We then targeted technology components that allowed us to implement a  substantial portion of these rules, including the design of a virtual video director. The system's performance was compared to that of a human operator via a user study. Results suggest that our system's quality in close to that of a human-controlled system. In fact most remote audience members could not tell if the video was produced by a computer or a person.",
  "authors": [
    {
      "name": "Qiong Liu",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100525820",
      "orcid": "missing"
    },
    {
      "name": "Yong Rui",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100018204",
      "orcid": "missing"
    },
    {
      "name": "Anoop Gupta",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611908",
      "orcid": "missing"
    },
    {
      "name": "J. J. Cadiz",
      "institution": "Collaboration and Multimedia Systems Group, Microsoft Research, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100025873",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arijon, D. Grammar of the film language, New York: Communication arts books, Hastings House Publishers, 1976.",
      "doi": ""
    },
    {
      "text": "Bargeron, D., Gupta, A., Grudin, J., and Sanocki, E., 1999. Annotations for Streaming Video on the Web. Proc. WWW8. ",
      "doi": "10.1016/S1389-1286%2899%2900058-4"
    },
    {
      "text": "Baumberg, A. &amp; Hogg, D., An efficient method for contour tracking using active shape models, TR 94.11, University of Leeds.",
      "doi": ""
    },
    {
      "text": "Benesty, J., Adaptive eigenvalue decomposition algorithm for passive acoustic source localization, Journal of Acoustics of America, vol. 107, January 2000, 384-391.",
      "doi": ""
    },
    {
      "text": "Bianchi, M., AutoAuditorium: a fully automatic, multi-camera system to televise auditorium presentations, Proc. of Joint DARPA/NIST Smart Spaces Technology Workshop, July 1998.",
      "doi": ""
    },
    {
      "text": "Brandstein, M., A pitch-based approach to time delay estimation of reverberant speech, Proc. IEEE ASSP Workshop Appls. Signal Processing Audio Acoustics, 1997.",
      "doi": ""
    },
    {
      "text": "Brotherton, J. &amp; Abowd, G., Rooms take note: room takes notes, Proc. AAAI Symposim on Intelligent Environments, 1998, 23-30.",
      "doi": ""
    },
    {
      "text": "Buxton, W., Sellen, A., &amp; Sheasby, M., Interfaces for multiparty videoconferences, Video-mediated communication (edited by Finn, K., Sellen, A., &amp; Wilbur, S.), Lawrence Erlbaum Publishers.",
      "doi": ""
    },
    {
      "text": "Cruz, G. &amp; Hill, R., Capturing and playing multimedia events with STREAMS, Proc. ACM Multimedia'94, 193-200.  ",
      "doi": "10.1145/192593.192654"
    },
    {
      "text": "Cutler, R. and Turk, M., View-based Interpretation of Real-time Optical Flow for Gesture Recognition, IEEE Automatic Face and Gesture Recognition, April 1998 ",
      "doi": "10.5555/520809.796121"
    },
    {
      "text": "He, L., Cohen, M., &amp; Salesin, D., The virtual cinemato-grapher: a paradigm for automatic real-time camera control and directing, Proc. of ACM SIGGRAPH'96, New Orleans, LA. August 1996.  ",
      "doi": "10.1145/237170.237259"
    },
    {
      "text": "He, L., Grudin, J., &amp; Gupta, A., Designing presentations for ondemand viewing, Proc. of CSCW'00, Dec. 2000  ",
      "doi": "10.1145/358916.358983"
    },
    {
      "text": "Jancke, G., Grudin, J., Gupta, A., Presenting to local and remote audiences: design and use of the Telep system, Proc. CHI'00  ",
      "doi": "10.1145/332040.332461"
    },
    {
      "text": "Jiang, W. &amp; Malvar, H., Adaptive speech noise reduction, Microsoft Research Technical Report, Aug. 1999.",
      "doi": ""
    },
    {
      "text": "Mukhopadhyay, S., &amp; Smith, B., Passive Capture and Structuring of Lectures, Proc. of ACM Multimedia'99, Orlando.  ",
      "doi": "10.1145/319463.319690"
    },
    {
      "text": "Omuigui, N., He, L., Gupta, A., Grudin, J., &amp; Sanock, E., Timecompression: system concerns, usage, and benefits, Proc. CHI'99  ",
      "doi": "10.1145/302979.303017"
    },
    {
      "text": "ParkerVision, http://www.parkervision.com/",
      "doi": ""
    },
    {
      "text": "PictureTel, http://www.picturetel.com/",
      "doi": ""
    },
    {
      "text": "PolyCom, http://www.polycom.com/",
      "doi": ""
    },
    {
      "text": "Stanford Online, http://stanford-onlines.stanford.edu/",
      "doi": ""
    },
    {
      "text": "Stiefelhagen, R., Yang, J., &amp; Waibel, A., Modeling focus of attention for meeting indexing, Proc. of ACM Multiemdia'99.  ",
      "doi": "10.1145/319463.319464"
    },
    {
      "text": "Wang, C. &amp; Brandstein, M., A hybrid real-time face tracking system, Proc. of ICASSP98, May 1998, Seattle, 3737-3740.",
      "doi": ""
    },
    {
      "text": "Zhai, S., Morimoto C. &amp; Ihde, S., Manual and gaze input cascaded (MAGIC) pointing, Proc. of CHI'99, 246-253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}