{
  "doi": "10.1145/365024.365047",
  "title": "Responding to subtle, fleeting changes in the user's internal state",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "77-84",
  "year": 2001,
  "badges": [],
  "abstract": "In human-to-human interaction, people sometimes are able to pick up and respond sensitively to the other's internal state as it shifts moment by moment over the course of an exchange. To find out whether such an ability is worthwhile for computer human interfaces, we built a semi-automated tutoring-type spoken dialog system. The system inferred information about the user's \\scare{ephemeral emotions}, such as confidence, confusion, pleasure, and dependency, from the prosody of his utterances and the context. It used this information to select the most appropriate acknowledgement form at each moment. In doing so the system was following some of the basic social conventions for real-time interaction. Users rated the system with this ability more highly than a version without.",
  "authors": [
    {
      "name": "Wataru Tsukahara",
      "institution": "Hitachi Central Research Labs, 1-280 Higashi-Koigakubo, Kokubunji-shi, Tokyo 185-8601 Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332532709",
      "orcid": "missing"
    },
    {
      "name": "Nigel Ward",
      "institution": "Mech-Info Engineering, University of Tokyo, 7-3-1 Hongo, Bunkyo-ku, Tokyo 113-8656 Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84358651257",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Angles, Jeffrey, Ayumi Nagatomi, &amp; Mieharu Nakayama (2000). Japanese Responses hai, ee, and un: yes, no, and beyond. Language and Communication, 20:55-86.",
      "doi": ""
    },
    {
      "text": "Ball, Gene &amp; Jack Breese (2000). Emotion and Personality in a Conversational Agent. In Embodied Conversational Agents, pp. 189-219. MIT Press. ",
      "doi": ""
    },
    {
      "text": "Bavelas, Janet Beavin, Nichile Chovil, Linda Coates, &amp; Lori Roe (1995). Gestures Specialized for Dialogue. Personality and Social Psychology Bulletin, 21:394-405.",
      "doi": ""
    },
    {
      "text": "Brennan, Susan E. &amp; Maurice Williams (1995). The Feeling of Another's Knowing: Prosody and filled pauses as cues to listeners about the metacognitive states of speakers. Journal of Memory and Language, 34:383- 398.",
      "doi": ""
    },
    {
      "text": "Brooks, Rodney A. (1991). Intelligence Without Representation. Artificial Intelligence, 47:139-159.  ",
      "doi": ""
    },
    {
      "text": "Cassell, Justine, Tim Bickmore, et al. (1999). Embodiment in Conversational Interfaces: Rea. In CHI '99, pp. 520-527. ACM Press.  ",
      "doi": ""
    },
    {
      "text": "Cassell, Justine, Tim Bickmore, et al. (2000). Human Conversation as a System Framework. In Embodied Conversational Agents, pp. 29-63. MIT Press. ",
      "doi": ""
    },
    {
      "text": "Cassell, Justine &amp; Kristinn R. Thorisson (1999). The Power of a Nod and a Glance: Envelope vs. Emotional Feedback in Animated Conversational Agents. Applied Artificial Intelligence, 13:519-538.",
      "doi": ""
    },
    {
      "text": "Clark, Herbert H. (1996). Using Language. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Fridlund, Alan J. (1997). The New Ethology of Human Facial Expressions. In J. A. Russell &amp; J. Fernandez Dols, editors, The Psychology of Facial Expression, pp. 103- 129. Cambridge.",
      "doi": ""
    },
    {
      "text": "Graesser, Arthur C., Katja Wiemer-Hastings, et al. (1999). AutoTutor: A Simulation of a Human Tutor. Journal of Cognitive Systems Research, 1:35-51.  ",
      "doi": ""
    },
    {
      "text": "Hatfield, Elaine, John T. Cacioppo, &amp; Richard L. Rapson (1994). Emotional Contagion. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Johnson, Jeff (2000). GUI Bloopers: Don'ts and Do's. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Johnstone, Anne, Umesh Berry, Tina Nguyen, &amp; Alan Asper (1995). There was a Long Pause: Influencing turntaking behaviour in human-human and human-computer dialogs. Int. J. Human-Computer Studies, 42:383-411.  ",
      "doi": ""
    },
    {
      "text": "Lanier, Jaron (1995). Agents of Alienation. http://www.well.com/user/jaron/agentalien.html.",
      "doi": ""
    },
    {
      "text": "Lester, James C., Sharolyn A. Converse, et al. (1997). The Persona Effect: Affective Impact of Animated Pedagogical Agents. In CHI '97, pp. 359-366. ACM Press.  ",
      "doi": "10.1145/258549.258797"
    },
    {
      "text": "Oviatt, Sharon (1996). User-Centered Modeling for Spoken Language and Multimodal Interfaces. IEEE Multimedia, pp. 26-35.  ",
      "doi": ""
    },
    {
      "text": "Picard, Rosalind (1997). Affective Computing. MIT Press. ",
      "doi": ""
    },
    {
      "text": "Reeves, Byron &amp; Clifford Nass (1996). The Media Equation. CSLI and Cambridge.",
      "doi": ""
    },
    {
      "text": "Rickenberg, Raoul &amp; Byron Reeves (2000). The Effects of Animated Characters on Anxiety, Task Performance, and Evaluations of User Interfaces. In CHI '00, pp. 49- 56. ACM Press.  ",
      "doi": ""
    },
    {
      "text": "Schmandt, Chris (1994). Computers and Communication. Van Nostrand Reinhold.",
      "doi": ""
    },
    {
      "text": "Shneiderman, Ben (2000). The Limits of Speech Recognition. Communications of the ACM, 43:63-65.  ",
      "doi": ""
    },
    {
      "text": "Tsukahara, Wataru (1998). An Algorithm for Choosing Japanese Acknowledgments Using Prosodic Cues and Context. In International Conference on Spoken Language Processing, pp. 691-694.",
      "doi": ""
    },
    {
      "text": "Tsukahara, Wataru (2000). Choice of Acknowledgements based on Prosody and Context in a Responsive Spoken Dialog System (in Japanese). D.Eng. Thesis, University of Tokyo, School of Engineering.",
      "doi": ""
    },
    {
      "text": "Tsukahara, Wataru &amp; Nigel Ward (2000). Evaluating Responsiveness in Spoken Dialog Systems. In International Conference on Spoken Language Processing, pp. III: 1097-1100.",
      "doi": ""
    },
    {
      "text": "Walker, M. A., D. J. Litman, C. A. Kamm, &amp; A. Abella (1998). Evaluating Spoken Dialog Agents with PARADISE: Two case studies. Computer Speech and Language, 12:317-348.",
      "doi": ""
    },
    {
      "text": "Ward, Nigel (1997). Responsiveness in Dialog and Priorities for Language Research. Systems and Cybernetics, 28(6):521-533.",
      "doi": ""
    },
    {
      "text": "Ward, Nigel (2000). The Challenge of Non-lexical Speech Sounds. In International Conference on Spoken Language Processing, pp. II: 571-574.",
      "doi": ""
    },
    {
      "text": "Ward, Nigel &amp; Takeshi Kuroda (1999). Requirements for a Socially Aware Free-standing Agent. In Proceedings of the Second International Symposium on Humanoid Robots, pp. 108-114.",
      "doi": ""
    },
    {
      "text": "Ward, Nigel &amp; Wataru Tsukahara (1999). A Responsive Dialog System. In Yorick Wilks, editor, Machine Conversations, pp. 169-174. Kluwer.",
      "doi": ""
    },
    {
      "text": "Yankelovich, Nichole, Gina-Anne Levow, &amp; Matt Marx (1995). Designing SpeechActs: Issues in Speech User Interfaces. In CHI '95, pp. 369-376. ACM Press.  ",
      "doi": ""
    }
  ]
}