{
  "doi": "10.1145/365024.365114",
  "title": "Surface drawing: creating organic 3D shapes with the hand and tangible tools",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "261-268",
  "year": 2001,
  "badges": [],
  "abstract": "Surface Drawing is a system for creating organic 3D shapes in a manner which supports the needs and interests of artists. This medium facilitates the early stages of creative design which many 3D modeling programs neglect. Much like traditional media such as line drawing and painting, Surface Drawing lets users construct shapes through repeated marking. In our case, the hand is used to mark 3D space in a semi-immersive virtual environment. The interface is completed with tangible tools to edit and manipulate models. We introduce the use of tongs to move and scale 3D shapes and demonstrate a magnet tool which is comfortably held without restricting hand motion. We evaluated our system through collaboration with artists and designers, exhibition before hundreds of users, our own extensive exploration of the medium, and an informal user study. Response was especially positive from users with an artistic background.",
  "tags": [
    "artistic shape creation",
    "semi-immersive environment",
    "repeated marking",
    "tangible user interface",
    "3D modeling",
    "hand-based interface",
    "fine art",
    "design prototyping"
  ],
  "authors": [
    {
      "name": "Steven Schkolne",
      "institution": "Caltech",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100001340",
      "orcid": "missing"
    },
    {
      "name": "Michael Pruett",
      "institution": "Caltech",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100420528",
      "orcid": "missing"
    },
    {
      "name": "Peter Schröder",
      "institution": "Bell Labs",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100117380",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "BUXTON, W. Chunking and phrasing and the design of human-computer dialogues. Information Processing '86 (1986), 475-480.",
      "doi": ""
    },
    {
      "text": "BUXTON, W. Touch, Gesture &amp; Marking. In Readings in Human Computer Interaction: Toward the Year 2000, R. Baecker, J. Grudin, W. Buxton, and S. Greenberg, Eds. Morgan Kaufmann Publishers, 1995.",
      "doi": "10.5555/212925.212974"
    },
    {
      "text": "COHEN, J. M., MARKOSIAN, L., ZELEZNIK, R. C., HUGHES,J.F.,AND BARZEL, R. An Interface for Sketching 3D Curves. 1999 ACM Symposium on Interactive 3D Graphics, 17-22.  ",
      "doi": "10.1145/300523.300655"
    },
    {
      "text": "CRUZ-NEIRA, C., SANDIN, D. J., AND DEFANTI, T. A. Surround-screen Projection-based Virtual Reality: The Design and Implementation of the CAVE. Proceedings of SIGGRAPH 1993 (1993), 135-142.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "DEERING, M. F. HoloSketch: A Virtual Reality Sketching/Animation Tool. ACM Transactions on Computer-Human Interaction 2, 3 (1995), 220-238.  ",
      "doi": "10.1145/210079.210087"
    },
    {
      "text": "FITZMAURICE, G., ISHII, H., AND BUXTON, W. Bricks: Laying the Foundations for Graspable User Interfaces. CHI '95 (1995), 442-449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "GALYEAN, T. A., AND HUGHES, J. F. Sculpting: An interactive volumetric modeling technique. In Computer Graphics (SIGGRAPH '91 Proceedings), 267- 274, 1991.  ",
      "doi": "10.1145/122718.122747"
    },
    {
      "text": "GORBET, M. G. Beyond Input Devices: A New Conceptual Framework for the Design of Physical-Digital Objects. Master's thesis, Massachusetts Institute of Technology, June 1998.",
      "doi": ""
    },
    {
      "text": "GUIARD, Y. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior (1987), 486-517.",
      "doi": ""
    },
    {
      "text": "HINCKLEY, K., PAUSCH, R., PROFFITT, D., PATTEN, J., AND KASSELL,N. Cooperative Bimanual Action. In Proceedings of CHI 1997, 27-34, 1997.  ",
      "doi": "10.1145/258549.258571"
    },
    {
      "text": "IGARASHI,T.,MATSUOKA, S., AND TANAKA, H. Teddy: A Sketching Interface for 3D Freeform Design. Proceedings of SIGGRAPH 99 (1999), 409-416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "IWAI, T. Composition on the Table, 1999. Shown at SIGGRAPH 1999 in Los Angeles.  ",
      "doi": "10.1145/312379.312383"
    },
    {
      "text": "KRUGER,W.,AND FROHLICH, B. The Responsive Workbench. IEEE Computer Graphics and Applications (May 1994), 12-15.  ",
      "doi": "10.1109/38.279036"
    },
    {
      "text": "SACHS, E., ROBERTS, A., AND STOOPS, D. 3-Draw: A tool for designing 3D shapes. IEEE Computer Graphics and Applications 11, 6 (1991), 18-26.  ",
      "doi": "10.1109/38.103389"
    },
    {
      "text": "SCHKOLNE, S., PRUETT, M., AND SCHR~DER, P. Algorithms for Surface Drawing. Tech. rep., Caltech, 2000. ",
      "doi": "10.5555/865817"
    },
    {
      "text": "SHNEIDERMAN, B. Direct Manipulation: A Step Beyond Programming Languages. IEEE Computer 16, 8 (1983), 57-69.",
      "doi": ""
    },
    {
      "text": "ULLMER, B., AND ISHII, H. The metaDESK: Models and Prototypes for Tangible User Interfaces. UIST '97 (1997), 223-232.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "WANG,S.W.,AND KAUFMAN, A. E. Volume Sculpting. In 1995 Symposium on Interactive 3D Graphics, 151-156, 1995.  ",
      "doi": "10.1145/199404.199430"
    },
    {
      "text": "ZELEZNIK, R. C., HERNDON,K.P.,AND HUGHES, J. F. SKETCH: An Interface for Sketching 3D Scenes. In Computer Graphics (SIGGRAPH '96 Proceedings), 163-170, 1996.  ",
      "doi": "10.1145/237170.237238"
    }
  ]
}