{
  "doi": "10.1145/365024.365121",
  "title": "The impact of eye gaze on communication using humanoid avatars",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "309-316",
  "year": 2001,
  "badges": [],
  "abstract": "In this paper we describe an experiment designed to investigate the importance of eye gaze in humanoid avatar's representing people engaged in conversation. We compare responses to dyadic conversations in four mediated conditions: video, audio-only, and two avatar conditions. The avatar conditions differed only in their treatment of eye gaze. In the random-gaze condition the avatars head and eye animations were unrelated to conversational flow. In the informed-gaze condition, they were related to turn-taking during the conversation. The head animations were tracked and the eye animations were inferred from the audio stream. Our comparative analysis of 100 post-experiment questionnaires showed that the random-gaze avatar did not improve on audio-only communication. The informed-gaze  avatar significantly outperformed the random-gaze model and also outperformed audio-only on several response measures. We conclude that an avatar whose gaze behaviour is related to the conversation provides a marked improvement on an avatar that merely exhibits liveliness.",
  "authors": [
    {
      "name": "Maia Garau",
      "institution": "Department of Computer Science, University College London (UCL), Gower St., London, WC1E 6BT, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100051968",
      "orcid": "missing"
    },
    {
      "name": "Mel Slater",
      "institution": "Department of Computer Science, University College London (UCL), Gower St., London, WC1E 6BT, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615391",
      "orcid": "missing"
    },
    {
      "name": "Simon Bee",
      "institution": "Parametric Technology Corp., 19 Apex Court, Woodlands, Almondsbury Park, Bristol, BS32 4JT, UK and MLB3/7, BT Labs., Martlesham Heath, Ipswich, IP5 3RE, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302046",
      "orcid": "missing"
    },
    {
      "name": "Martina Angela Sasse",
      "institution": "Department of Computer Science, University College London (UCL), Gower St., London, WC1E 6BT, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anstis, S.M., Mayhew, J.W., Morley, T. The Perception of Where a Face or Television 'Portrait' is Looking. American Journal of Psychology 82 (1969), 474-489.",
      "doi": ""
    },
    {
      "text": "Argyle, M., Bodily Communication. Methuen &amp; Co., London, 1975.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Cook, M. Gaze and Mutual Gaze. Cambridge University Press, Cambridge, 1976.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Ingham, R. Mutual Gaze and Proximity. Semiotica 6 (1972), 32-49.",
      "doi": ""
    },
    {
      "text": "Argyle, M., Ingham, R., Alkema, F. and McCallin, M. The Different Functions of Gaze. Semiotica 7 (1973), 10- 32.",
      "doi": ""
    },
    {
      "text": "Argyle, M., Lefebvre, L. and Cook, M. The Meaning of Five Patterns of Gaze. Eur. J. Soc. Psychol. 4, 2 (1974), 125-136.",
      "doi": ""
    },
    {
      "text": "Buxton, W. Telepresence: integrating shared task and person spaces, in Proceedings of Graphics Interface '92, 123-129. Earlier version appears in Proceedings of Groupware '91 (Amsterdam, Oct. 29, 1991), 27-36. ",
      "doi": "10.5555/155294.155309"
    },
    {
      "text": "Colburn, A., Drucker, S., Cohen, M. The Role of Eye- Gaze in Avatar-Mediated Conversational Interfaces, in Sketches and Applications, Siggraph '00 (New Orleans LA, July '00), ACM Press, 253.",
      "doi": ""
    },
    {
      "text": "Gibson, J.J. and Pick, A. Perception of Another Person's Looking Behaviour. American Journal of Psychology 46 (1963), 386-394.",
      "doi": ""
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C., Benford, S. and Greenhalgh, C. Fragmented Interaction: Establishing Mutual Orientation in Virtual Environments, in Proceedings of CSCW '98 (Seattle WA, November 1998), 48-53.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Isaacs, E. and Tang, J. What Video Can and Can't Do for Collaboration: A Case Study. Multimedia Systems, 2 (1993), 63-73.  ",
      "doi": "10.1007/BF01274181"
    },
    {
      "text": "Kendon, A. Some Functions of Gaze-Direction in Social Interaction. Acta Psychologica, 26 (1967), 22-63.",
      "doi": ""
    },
    {
      "text": "Kendon, M. and Cook, A. The Consistency of Gaze Patterns in Social Interaction. Br. J. Psychol, 60, 4 (1969), 481-494.",
      "doi": ""
    },
    {
      "text": "Lord, C. and Haith, M.M. The Perception of Eye Contact. Perception &amp; Psychophysics 16, 3 (1974), 413-416.",
      "doi": ""
    },
    {
      "text": "McCullagh, P. and Nelder, J.A. Generalised Linear Models. Chapman and Hall, 1983.",
      "doi": ""
    },
    {
      "text": "Sellen, A. Remote Conversations: The Effects of Mediating Talk with Technology. Human-Computer Interaction, 10(4) (1995), 401-444.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Short, J., Williams, E. and Christie, B. The Social Psychology of Telecommunications. John Wiley &amp; Sons, London, 1976.",
      "doi": ""
    },
    {
      "text": "Slater, M., Steed, A., McCarthy, J., Maringelli, F. (1998) The Influence of Body Movement on Subjective Presence in Virtual Environments. Human Factors, 40(3), 469- 477.",
      "doi": ""
    },
    {
      "text": "Slater, M., Howell, J., Steed, A., Pertaub, D-P., Garau, M. and Springel, S. Acting in Virtual Reality, in ACM Collaborative Virtual Environments, (San Francisco CA, Sept 2000), 103-110.  ",
      "doi": "10.1145/351006.351020"
    },
    {
      "text": "Steed, A. Slater, M., Sadagic, A. Tromp, J. and Bullock, A. Leadership and collaboration in virtual environments. In IEEE Virtual Reality, (Houston TX, March 1999), 112-115. ",
      "doi": "10.5555/554230.835708"
    },
    {
      "text": "Straus, S. and McGrath, J.E. Does the Medium Matter: The Interaction of Task and Technology on Group Performance and Member Reactions. Journal of Applied Psychology 79 (1994), 87-97.",
      "doi": ""
    },
    {
      "text": "Taylor, M.J. and Rowe, S.R. Gaze Communication Using Semantically Consistent Spaces, in Proceedings of CHI 2000 (The Hague, Amsterdam, April 2000), ACM Press, 400-407.  ",
      "doi": "10.1145/332040.332464"
    },
    {
      "text": "Vertegaal, R. The GAZE Groupware System: Mediating Joint Attention in Multiparty Communication and Collaboration, in Proceedings of CHI '99 (Pittsburgh PA, May 1999), ACM Press, 294-301.  ",
      "doi": "10.1145/302979.303065"
    },
    {
      "text": "Vilhjalmsson, H. and Cassell, J. BodyChat: Autonomous Communicative Behaviours in Avatars, in Autonomous Agents '98 (Minneapolis MN, May 1998), 269-276.  ",
      "doi": "10.1145/280765.280843"
    }
  ]
}