{
  "doi": "10.1145/365024.365303",
  "title": "GeneyTM: designing a collaborative activity for the palmTM handheld computer",
  "published": "2001-03-01",
  "proctitle": "CHI '01: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "388-395",
  "year": 2001,
  "badges": [],
  "abstract": "This paper describes a project to explore issues surrouding the development of a collaborative handheld educational application for children. A user-centered, iterative design process was used to develop GeneyTM, a collaborative problem solving application to help children explore genetic concepts using PalmTM handheld computers. The design methodology utilized mock-ups of representative tasks and scenarios, pre-design meetings with targets users, prototype development, and feedback sessions with target users. The results of this work identify an effective way of utilizing handheld computers for collaborative learning and provide important insights into the design of handheld applications for children. This work also illustrates the necessity of user-centered design when new user  groups are targeted, especially when novel user interface paradigms are employed that go beyond current windows-based interfaces.",
  "authors": [
    {
      "name": "Arman Danesh",
      "institution": "School of Computing Science, Simon Fraser University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538105656",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "School of Computing Science, Simon Fraser University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Felix Lau",
      "institution": "School of Computing Science, Simon Fraser University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100206591",
      "orcid": "missing"
    },
    {
      "name": "Keith Shu",
      "institution": "School of Computing Science, Simon Fraser University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100206506",
      "orcid": "missing"
    },
    {
      "name": "Kellogg Booth",
      "institution": "Department of Computer Science, University of British Columbia",
      "img": "/do/10.1145/contrib-81100170154/rel-imgonly/kelly2014.jpg",
      "acmid": "81100170154",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Center for Innovative Learning Technologies. DataGotchi Deep Dive. SRI International, 1998. Ret. Aug 23, 2000 from http://www.cilt.org/htm/ publications.html.]]",
      "doi": ""
    },
    {
      "text": "Colella, V., Borovoy, R., and Resnick, M. Participatory Simulations: Using computational objects to learn about dynamic systems. In Proceedings of CHI '98, Summary, (Los Angeles CA, April 1998) 9-10.]]  ",
      "doi": "10.1145/286498.286503"
    },
    {
      "text": "CyberLife Technology. Welcome to Creatures 2. Ret. February 23, 2000 from http://www.creatures2.com/.]]",
      "doi": ""
    },
    {
      "text": "Cybiko Inc. Ret. Aug 23, 2000 from http://www.cybiko.com/.]]",
      "doi": ""
    },
    {
      "text": "Driver, R., Asoko, H., Leach, J., Mortimer, E., and Scott, P. Constructing Scientific Knowledge in the Classroom. Educational Researcher, 23, 7 1994, 5-12.]]",
      "doi": ""
    },
    {
      "text": "Druin A. Cooperative inquiry: Developing new technologies for children with children. In Proceedings of CHI '99 (Pittsburgh, PA, May 1999) 592-599.]]  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Druin, A., Bederson, B., Boltman, A., Miura, A., Knotts-Callahan, D., and Platt, M. Children as our technology design partners. In Druin A. (ed.). The Design of Children's Technology. Morgan Kaufmann Publishers, San Francisco CA, 1999, 51-72]] ",
      "doi": "10.5555/303430.303435"
    },
    {
      "text": "Gardner, J., Morrison, H., Jarman, R., Reilly, C., and McNally, H. Learning with portable computers. Computers and Education, 22, 1/2 1994, 161-171.]]  ",
      "doi": "10.1016/0360-1315%2894%2990084-1"
    },
    {
      "text": "Geney TM . Ret. Aug 23, 2000 from http://www.geney.net.]]",
      "doi": ""
    },
    {
      "text": "Horwitz, P, Schwartz, J., Kindfield, A.C.H., Yessis, L.M., Hickey, D.T., Heidenberg, A.J., and Wolfe, E.W. Implementation and evaluation of the GenScope TM learning environment: Issues, solutions and results. In Proceedings of the ICLS (Charlottesville VA, December 1998), 6-10.]]",
      "doi": ""
    },
    {
      "text": "Inkpen, K.M. Designing Handheld Technologies for Kids. Personal Technologies Journal, 3, 1&amp;2 2000, 81-89.]]",
      "doi": ""
    },
    {
      "text": "Inkpen, K.M., Booth, K.S., Klawe, M., and Upitis, R. Playing together beats playing apart, especially for girls. In Proceedings of CSCL '95, (Indiana IL, October 1995), 177-181.]]  ",
      "doi": "10.3115/222020.222164"
    },
    {
      "text": "Inkpen, K., Upitis, R., Klawe, M., Lawry, J., Anderson, A., Ndunda, M., Sedighian, K., Leroux, S., Hsu, D. \"We have never forgetful flowers in our garden:\" Girls' responses to electronic games. Journal of Computers in Math and Science Teaching, 13, 4 1994, 383-403.]] ",
      "doi": "10.5555/203671.203673"
    },
    {
      "text": "Mikhak B., Martin F., Resnick M., Berg R. and Silverman B. The Childrens Machines: Handheld and Wearable Computers Too. In Proceedings of the International Symposium on Handheld and Ubiquitous Computing (Karlsruhe, Germany 1999).]] ",
      "doi": "10.5555/647985.743715"
    },
    {
      "text": "Nielsen, J. Usability Engineering. Academic Press, San Diego CA, 1993.]] ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Nintendo Co. Ltd. Nintendo: Game Boy Color. Ret. Aug. 23, 2000 from http://www.nintendo.com/gb/ index.html]]",
      "doi": ""
    },
    {
      "text": "Palmos.com. Good design practices. In PalmOS Programmer's Companion. Ret. Aug 28, 2000 from http://www.palmos.com/dev/tech/docs/palmos/Compan ionTOC.html]]",
      "doi": ""
    },
    {
      "text": "Resnick, M. New paradigms for computing, new paradigms for thinking. In Kafai Y. &amp; Resnick, M. (Eds.) Constructionism in practice: Designing, thinking and learning in a digital world. Lawrence Erlbaum Associates, Mahwah NJ, 1996, 255-267.]]",
      "doi": ""
    },
    {
      "text": "Rieger, R. and Gay, G. Using Mobile Computing to Enhance Field Study. In Proceedings of CSCL '97 (Toronto ON, December 1997), 215-223.]]",
      "doi": ""
    },
    {
      "text": "Rockman et al. Powerful tools for schooling: Second year study of the laptop program. Ret. Aug 23, 2000 from http://www.microsoft.com/education/aal/ research2.asp]]",
      "doi": ""
    },
    {
      "text": "diSessa, A.A. Social Niches for Future Software. In M. Gardner et al (Eds.) Toward a scientific practice of science education. Lawrence Erlbaum Associates, Hillsdale NJ, 1990, 301-322.]]",
      "doi": ""
    },
    {
      "text": "Soloway E., Grant W., Tinker R., Roschelle J., Mills M., Resnick M., Berg R. and Eisenberg M. Science in the Palms of Their Hands. Communications of the ACM, 42, 8 1999, 21-27.]]  ",
      "doi": "10.1145/310930.310953"
    },
    {
      "text": "Stager, G.S. Laptop schools lead the way in professional development. Educational Leadership, 53, 2 (1995), 78-81.]]",
      "doi": ""
    }
  ]
}