{
  "doi": "10.1145/191666.191697",
  "title": "Marquee: a tool for real-time video logging",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "58-64",
  "year": 1994,
  "badges": [],
  "abstract": "We describe Marquee, a pen-based video logging tool which enables users to correlate their personal notes and keywords with a videotape during recording. We present our observations about coordinating the task of logging in real time and describe the three phase, user-centered approach we took in designing the tool. Our early work explored the functionalities needed by users to successfully create a log. In the second phase we focused on testing our intuitions about logging by conducting user studies with paper mock-ups. In the final phase, we implemented a working prototype system and placed it in a setting to see if it supported people logging in real time.",
  "tags": [
    "user interfaces",
    "penbased computing",
    "video annotation",
    "user studies",
    "gestural interfaces",
    "video indexing",
    "multimedia"
  ],
  "authors": [
    {
      "name": "Karon Weher",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392592684",
      "orcid": "missing"
    },
    {
      "name": "Alex Poon",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100038514",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aguerre Smith, T. and Davenport, G. The Stratification System A Design Environment for Random Access Video. Proceedings of the 3rd International Workshop on Network and Operating System Support for Digital Audio and Video, San Diego, California. November 1992. ",
      "doi": "10.5555/646980.711991"
    },
    {
      "text": "Davis, M.E. Director's Workshop\" Semantic Video Logging with Intelligent Icons. AAAI-91 intelligent Multimedia Interfaces Workshop Position Paper 1991.",
      "doi": ""
    },
    {
      "text": "Gould, J.D. and Salaun, J. Behavioral Experiments on Handmarkings. CHI+GI 1987 Conference Proceedings. April 5-9, 1987 Toronto, Canada.  ",
      "doi": "10.1145/29933.275626"
    },
    {
      "text": "Harrison, B. The VANNA System: Video ANNotation and Analysis, (a videotape). University of Toronto. 1991.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. Issues in Combining Marking and Direct Manipulation Techniques. UIST 1991 Conference Proceedings. November 11 - 13, 1991, Hilton Head South Carolina.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Lamming, M.G. and Newman, W.N. Activity-based Information Retrieval\" Technology Support of Personal Memory. Personal Computers and Intelligent Systems, F.H. Vogt editor. Information Processing 92, Vol. III. Elsevier Science Publishers B.V., North Holland. 1992 ",
      "doi": "10.5555/645571.660379"
    },
    {
      "text": "Mackay, W. and Davenport, G. Virtual Video Editing in Interactive Multimedia Applications. Communications of the ACM, Vol. 32, No. 7. 1989  ",
      "doi": "10.1145/65445.65447"
    },
    {
      "text": "Minneman, S. and Harrison, S. Where Were We: making and using near-synchronous, pre-narrative video. Proceedings First ACM International Conference on Multimedia. 1- 6 August 1993, Anaheim, California.  ",
      "doi": "10.1145/166266.166290"
    },
    {
      "text": "O'Connor, B. Selecting Key Frames of Moving Image Documents: A Digital Environment for Analysis and Navigation. Microcomputers for Information Management, Vol. 8, No. 2.June 1991.",
      "doi": ""
    },
    {
      "text": "O'Shaughnessy, D. Speaker Recognition. IEEE ASSP Magazine, October 1986 p. 4-17",
      "doi": ""
    },
    {
      "text": "Otsuji, K. and Tonomura, Y. Projection Detecting Filter for Video Cut Detection. Proceedings First ACM International Conference on Multimedia. 1-6 August 1993, Anaheim, California.  ",
      "doi": "10.1145/166266.166295"
    },
    {
      "text": "Siu, M.H., Yu, G., Gish, H. An Unsupervised, Sequential Learning Algorithm For The Segmentation of Speech Waveforms With Multiple Speakers. Proceedin~ of International Conference on Acoustics, Speech attd Sigtzal Processing. Vol. 2. March 23-26, 1992, San Francisco, California.",
      "doi": ""
    },
    {
      "text": "Trigg, R.H. Computer Support for Transcribing Recorded Activity. SIGCHI Bulletin, Vol.2 I, No. 2, October 1989.  ",
      "doi": "10.1145/70609.70618"
    },
    {
      "text": "Tonomura, Akutsu, S., Otsuji, K., Sadakata, T.Video- MAP and VideospaceIcon: Tools for Anatomizing Video Content. INTERCHI'93 Conference Proceedings. 24-29, April 1993.Amsterdam, The Netherlands.  ",
      "doi": "10.1145/169059.169117"
    },
    {
      "text": "Turner, J. Representing and Accessing Information in the Stockshot Database at the National Film Board of Canada. The Canadian Journal of b~'ormation Science, Vol. 15, No. 4, December 1990.",
      "doi": ""
    },
    {
      "text": "Ueda, H., Miyatake, T., Sumino, S., and Nagasaka, A. Automatic Structure Visualization for Video Editing. INTERCHI'93 Conference Pro~'eedin~s. 24-29, April 1993.Amsterdam, The Netherlands.  ",
      "doi": "10.1145/169059.169118"
    },
    {
      "text": "Weber, K. and Bly, S. A. Annotating Video Records With Multiple Media. Pa}o Alto Research Center Technical Report, ISTL-CSA-92-12-01, 1992",
      "doi": ""
    },
    {
      "text": "Wilcox, L.D., Smith, I. and Bush, M.A. Wordspotting for Voice Editing and Audio Indexing. CHI '92 Colg'elvlt{'e Proceedings. May, 1992. Monterey, California.  ",
      "doi": "10.1145/142750.150715"
    },
    {
      "text": "Wolf, C. Can People Use Gesture Commands? SIGCHI Bulletin, Vol. 18, No. 2, October 1986.  ",
      "doi": "10.1145/15683.1044102"
    }
  ]
}