{
  "doi": "10.1145/191666.191795",
  "title": "The value of a baseline in determining design success",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "386-391",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "tags": [
    "CUI",
    "usability goals",
    "baseline",
    "design principles",
    "usability testing",
    "GUI",
    "comparative testing"
  ],
  "authors": [
    {
      "name": "Brenda Burkhart",
      "institution": "Bellcore, 444 Hoes Lane, Piscataway, N.J.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100216454",
      "orcid": "missing"
    },
    {
      "name": "Darold Hemphill",
      "institution": "Bellcore, 444 Hoes Lane, Piscataway, N.J.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104536",
      "orcid": "missing"
    },
    {
      "name": "Scott Jones",
      "institution": "Bellcore, 444 Hoes Lane, Piscataway, N.J.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332506940",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dieli, M. The usability process: Working with iterative design principles. IEEE Transactions on Professional Communications, 1989, 32, pp. 272- 278.",
      "doi": ""
    },
    {
      "text": "Gould, J.D. and Lewis, C. Designing for usability: key principles and what designers think. Communications of the ACM, 1985, 28, pp. 300- 311.  ",
      "doi": "10.1145/3166.3170"
    },
    {
      "text": "Hutchins, E. L., Hollan, J. D. and Norman, D. A. Direct manipulation interfaces, in User Centered System Design: New Perspectives on Human- Computer Interaction, D. A. Norman and S. W. Draper, Eds., Lawrence Erlbaum Associates, New York, 1986, pp. 87-124.",
      "doi": ""
    },
    {
      "text": "Kellogg, W. Conceptual consistency in the user interface: Effects on user performance, in Proceedings of the International Conference on Human-Computer Interaction, H. Bullinger and B. Shackel, Eds., Elsevier Science Publishers, New York, 1987, pp. 389-394.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Usability Engineering. Academic Press, New York, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Payne S. J. and Green, T. R. G. Task action grammars: A model of the mental representation of task languages, in Human-Computer Interaction, Volume 2, Lawrence Erlbaurn Associates, New York, 1986, pp. 93-133.",
      "doi": ""
    },
    {
      "text": "Rutkowski, C. An introduction to the human applications standard computer interface, in BYTE Magazine, October and November, 1982.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Designing the User Interface: Strategies for Effective Human-Computer Interaction. Addison Wesley Publishing Company, New York, 1987. ",
      "doi": "10.5555/6682"
    },
    {
      "text": "Tognazzini, B. Achieving consistency for the Macintosh, in Coordinating User Interfaces for Consistency, J. Nielsen, Ed., Academic Press, New York, 1989, pp. 57-73. ",
      "doi": ""
    },
    {
      "text": "Velte, C. Document usability through objectives. IEEE Transactions on Professional Communications, 1989, 32, pp. 279-282.",
      "doi": ""
    },
    {
      "text": "Whitefield, A., Wilson, F. and Dowell, J. A framework for human factors evaluation. Behaviour &amp; Information Technology, 1991, 10, pp. 65-79.",
      "doi": ""
    },
    {
      "text": "Whiteside, J., Bennett, J. and Holtzblatt, K. Usability Engineering: Our Experience and Evolution, in Handbook of Human-Computer Interaction, M. Helander, Ed., Elsevier Science Publishers, North Holland, 1988, pp. 791-871.",
      "doi": ""
    }
  ]
}