{
  "doi": "10.1145/191666.191793",
  "title": "Specification of interface interaction objects",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "372-378",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "David A. Carr",
      "institution": "University of Maryland, Computer Science Department, University of Maryland, Human Computer Interaction Laboratory, and RMS, Inc., NASA Goddard Space Flight Center, Code 520.9, Greenbelt, MD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405593382",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Guttag, John and J. J. Horning, \"Formal Specification as a Design Tool,\" Proceedings of the 7th Symposium on Programming Languages, 1980, pp. 251-261.  ",
      "doi": "10.1145/567446.567471"
    },
    {
      "text": "Hartson, H. Rex and Phillip D. Gray, \"Temporal Aspects of Tasks in the User Action Notation\", Human-Computer Interaction, Volume 7, 1992, Lawrence Erlbaum Associates, Inc. pp. 1-45.",
      "doi": "10.1207/s15327051hci0701_1"
    },
    {
      "text": "HareI, David, \"On Visual Formalisms,\" Communications ofthe ACM, 31(5), May 1988, pp. 514-530.  ",
      "doi": "10.1145/42411.42414"
    },
    {
      "text": "Hudson, Scott E., \"Graphical Specification of Flexible User Interface Displays,\" Proceedings of the A CM SIGGRAPH Symposium on User Interface Software and Technology, 1989, pp. 105-114.  ",
      "doi": "10.1145/73660.73673"
    },
    {
      "text": "Jacob, Robert J. K., \"A Specification Language for Direct-Manipulation User Interfaces,\" A CM Transactions on Graphics, vol. 5, no. 4, October 1986, pp. 283-317.  ",
      "doi": "10.1145/27623.27624"
    },
    {
      "text": "Plaisant, Catherine, and Wallace D., Touchscreen Toggle Switches: Push or Slide? Design Issues and Usability Study, University of Maryland, Center for Automation Research technical report CAR-TR-521 (also CS-TR-2557), Nov. 1990.",
      "doi": ""
    },
    {
      "text": "Plaisant, Catherine, and Wallace D., \"Touchscreen Toggle Design\", Proceedings of A CM CHI'92 Conference on Human Factors in Computing Systems, 1992, pp. 667-668 and the CHI'92 Formal Video Program.  ",
      "doi": "10.1145/142750.143079"
    },
    {
      "text": "Rouff, Christopher, Specification and Rapid Prototyping of User Interfaces, University of Southern California Ph.D., 1991, 219 pages. ",
      "doi": "10.5555/145701"
    },
    {
      "text": "Shneiderman, Ben, \"Multiparty Grammars and Related Features for Defining Interactive Systems,\" IEEE Transactions on Systems, Man, and Cybernetics, 12(2): 148-154, March/April 1982.",
      "doi": ""
    },
    {
      "text": "Shneiderman, Ben, Designing the User Interface, 2nd edition, Addison-Wesley, p. 517, 1992. ",
      "doi": "10.5555/129385"
    },
    {
      "text": "Siochi, Antonio C. and H. Rex Hartson, \"Task Oriented Representation of Asynchronous User Interfaces\", Proceedings of A CM CHI'89 Conference on Human Factors in Computing Systems, 1989, pp. 183-188.  ",
      "doi": "10.1145/67449.67487"
    },
    {
      "text": "Vander Zanden, Bradley T., \"Constraint Grammars -- A New Model for Specifying Graphical Applications,\" Proceedings of A CM CHI'89 Conference on Human Factors in Computing Systems, 1989, pp. 325-330.  ",
      "doi": "10.1145/67449.67513"
    },
    {
      "text": "Wasserman, Anthony I., \"Extending State Transition Diagrams for the Specification of Human-Computer Interaction\", IEEE Transactions on Software Engineering, vol. SE-11(8), August 1985, pp. 699-713.  ",
      "doi": "10.1109/TSE.1985.232519"
    },
    {
      "text": "Wellner, Pierre D., \"Statemaster: A UIMS Based on Statecharts for Prototyping and Target Implementation Notation for Specification,\" Proceedings of A CM CHI'89 Conference on Human Factors in Computing Systems, 1989, pp. 177-182.  ",
      "doi": "10.1145/67449.67486"
    }
  ]
}