{
  "doi": "10.1145/191666.191758",
  "title": "Usability testing in the field: bringing the laboratory to the user",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "252-257",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "David E. Rowley",
      "institution": "Varian Associates, Chromatography Systems Business, 2700 Mitchell Drive, Walnut Creek, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660399575",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Doyle, M. and Strause, D. How to Make Meetings Work: The New Interaction Method. Playboy Press, Chicago, 1976.",
      "doi": ""
    },
    {
      "text": "Karat, C., Campbell, R., and Fiefel, T. Comparison of Empirical Testing and Walkthrough Methods in User Interface Evaluation. In Proceedings of ACM CHr92 (Monterey, CA., May 1992), pp.397-404.  ",
      "doi": "10.1145/142750.142873"
    },
    {
      "text": "Nielsen, J. Designing for International Use. In Proceedings of ACM CHI'90 (Seattle, WA, April 1990), pp. 291-294.  ",
      "doi": "10.1145/97243.97298"
    },
    {
      "text": "Nielsen, J., and Molich, R. Heuristic Evaluation of User Interfaces. In Proceedings of ACM CHr90 (Seattle, WA, April 1990).  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "O'Malley, C.E., Draper, S.W, and Riley, M.S. Constructive Interaction: A Method for Studying Human-Computer-Human Interaction. In Proceedings of IFIP INTERACT'84: Human-Computer Interaction (Amsterdam, Sept. 1984), pp.269-274.",
      "doi": ""
    },
    {
      "text": "Rowley, D.E., and Rhoades, D.G. The Cognitive Jogthrough: A Fast-Paced User Interface Evaluation Procedure. In Proceedings of ACM CHr92 (Monterey, CA., May 1992), pp. 389-395.  ",
      "doi": "10.1145/142750.142869"
    },
    {
      "text": "Russo, P. and Boor, S. How Fluent is Your Interface? Designing for International Users. in Proceedings of ACM/INTERACT INTERCHI'93 (Amsterdam, The Netherlands, April 1993), pp. 342- 347.  ",
      "doi": "10.1145/169059.169274"
    },
    {
      "text": "Wharton, C., Bradford, J., Jeffries, R., and Franzke, M. Applying Cognitive Walkthroughs to More Complex User Interfaces: Experiences, Issues, and Recommendations. In Proceedings of ACM CHI'92 (Monterey, CA., May 1992), pp. 381-388.  ",
      "doi": "10.1145/142750.142864"
    },
    {
      "text": "Wright, P. and Monk, A. Co-Operative Evaluation - The York Manual. University of York, York, UK, 1991.",
      "doi": ""
    },
    {
      "text": "Gause, D. and Weinberg, G. Exploring Requirements - Quality Before Design. Dorset House, New York, 1989. ",
      "doi": "10.5555/575622"
    }
  ]
}