{
  "doi": "10.1145/191666.191708",
  "title": "Using a human face in an interface",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "85-91",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "tags": [
    "personable computers",
    "user interface design",
    "anthropomorphism",
    "facial animation",
    "facial expression",
    "multimodal interfaces"
  ],
  "authors": [
    {
      "name": "Janet H. Walker",
      "institution": "Cambridge Research Lab, Digital Equipment Corporation, One Kendall Square, Bldg 700, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423848",
      "orcid": "missing"
    },
    {
      "name": "Lee Sproull",
      "institution": "Department of Information Systems, School of Management, Boston University, 704 Commonwealth Avenue, Suite 400 Boston, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302497",
      "orcid": "missing"
    },
    {
      "name": "R. Subramani",
      "institution": "Department of Information Systems, School of Management, Boston University, 704 Commonwealth Avenue, Suite 400 Boston, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100038254",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple Computer Inc. Knowledge Navigator. (Videotape)",
      "doi": ""
    },
    {
      "text": "Aronoff, J., B.A. Woike, &amp; L.M. Hyman. Which are the Stimuli in Facial Displays of Anger and Happiness? Configurational Bases of Emotion Recognition. Journal of Personality and Social Psychology, 1992. 62, p. 1050- 1066.",
      "doi": ""
    },
    {
      "text": "Bailey, L., T. Moore, &amp; B. Bailar. An Interviewer Variance Study for the Eight impact Cities of the National Crime Survey. Journal of the American Statistical Association, 1987.73, p. 16-23.",
      "doi": ""
    },
    {
      "text": "Baker, M.J. &amp; G.A. Churchill Jr. The Impact of Physically Attractive Models on Advertising Evaluations. Journal of Marketing Research, 1977. 14(November), p. 538-555.",
      "doi": ""
    },
    {
      "text": "Binnick, Y.M., C.F. Westbury, &amp; D. Servan-Schreiber. Case Histories and Shorter Communications. Behavioral Research Therapy, 1989.27, p. 303-306.",
      "doi": ""
    },
    {
      "text": "Bond, E.K. Perceptions of Form by the Human Infant. Psychological Bulletin, 1972.77, p. 225-245.",
      "doi": ""
    },
    {
      "text": "Bradburn, N. Response Effects. In Handbook of survey research, P.H. Rossi, J.D. Wright, &amp; A.B. Anderson, (Ed). New York: Academic Press, 1983. p. 289-328.",
      "doi": ""
    },
    {
      "text": "Carey, S. Becoming a face expert. In Processing the Facial Image, V. Bruce, et al., (Ed). Oxford: Clarendon Press, 1992.",
      "doi": ""
    },
    {
      "text": "Deiner, E., et al. Effects of Deindividuating Variables on Stealing by Halloween Trick-or-treaters. Journal of Personality and Social Psychology, 1976. 33, p. 178-183.",
      "doi": ""
    },
    {
      "text": "Duffy, S.A. &amp; D.B. Pisoni. Comprehension of Synthetic Speech Produced by Rule: A Review and Theoretical Interpretation. Language and Speech, 1992. 35, p. 351-389.",
      "doi": ""
    },
    {
      "text": "Eichenwald, K. \"Hi, voter. This is your president.\" in New York Times, New York. November 2, 1986, section 3: 19.",
      "doi": ""
    },
    {
      "text": "Ekman, P. (Ed.) Emotion in the human face. 2nd ed. Cambridge: Cambridge University Press, 1982.",
      "doi": ""
    },
    {
      "text": "Ekman, P., et al. Does Image Size Affect Judgments of the Face? Journal of Nonverbal Behavior, 1979.4(1), p. 57-61.",
      "doi": ""
    },
    {
      "text": "Gaver, W.W. Auditory Icons: Using Sound in Computer Interfaces. Human-Computer Interaction, 1986. 2, p. 167-177.",
      "doi": ""
    },
    {
      "text": "Hess, U., A. Kappas, &amp; K.R. Scherer. Multichannel Communication of Emotion: Synthetic Signal Production. In Facets of emotion: Recent research, K.R. Scherer, (Ed). Hillsdale, N.J.: Lawrence Erlbaum Associates, 1988.",
      "doi": ""
    },
    {
      "text": "Itou, K.S., S. Hayamizu, &amp; H. Tanaka. Continuous Speech Recognition by Context-dependent Phonetic HMM and an Efficient Algorithm for Finding N-best Sentence Hypotheses. In Proceedings oflCASSP. IEEE Press, 1992.",
      "doi": ""
    },
    {
      "text": "Klatt, D.H. &amp; L.C. Klatt. Analysis, Synthesis, and Perception of Voice Quality Variations Among Female and Male Talkers. The Journal of the Acoustical Society of America, 1990.87(2), p. 820-856.",
      "doi": ""
    },
    {
      "text": "Laurel, B. Interface Agents: Metaphors with Character. In The art of human-computer interface design, B. Laurel, (Ed). New York: Addison-Wesley, 1990.",
      "doi": ""
    },
    {
      "text": "Morton, J. &amp; M.H. Johnson. CONSPEC and CONLERN: A Two-process Theory of Infant Face Recognition. Psychological Review, 1991.98(2), p. 164- 181.",
      "doi": ""
    },
    {
      "text": "Nass, C. &amp; J. Steuer. Voices, Boxes, and Sources of Messages: Computers and Social Actors. Human Communication Research, in press.",
      "doi": ""
    },
    {
      "text": "Neidecker-Lutz, B.K. &amp; R. Ulichney. Software Motion Pictures. Digital Technical Journal, 1993.5(2), p. 19-27. ",
      "doi": "10.5555/178270.178272"
    },
    {
      "text": "Norman, D.A. &amp; S.W. Draper (Ed.) User-centered system design. Hillsdale, N.J.: Lawrence Erlbaum Associates, 1986.",
      "doi": ""
    },
    {
      "text": "Oren, T., et al. Guides: Characterizing the Interface. In The art of human-computer interface design, B. Laurel, (Ed). New York: Addison-Wesley, 1990. p. 367-381.",
      "doi": ""
    },
    {
      "text": "Reilly, W.S. &amp; J. Bates. Building Emotional Agents. School of Computer Science, Carnegie Mellon University CMU-CS-92-143, 1992.",
      "doi": ""
    },
    {
      "text": "Resnick, P.V. &amp; H.B. Lammers. The Influence of Serfesteem on Cognitive Responses to Machine-like versus Human-like Computer Feedback. The Journal of Social Psychology, 1985. 125(6), p. 761-769.",
      "doi": ""
    },
    {
      "text": "Rich, C. Evaluating the Contribution of Discourse Theory to an interactive System. In Proceedings of AAM Fall Symposium on Human-Computer Collaboration. Raleigh, N.C., October, 1993.",
      "doi": ""
    },
    {
      "text": "Schuman, H. &amp; S. Presser. Questions and answers in attitude surveys: Experiments in question form, wording, and context. New York: Academic Press, 1981.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Designing the user interface: Strategies for effective human-computer interaction. Boston: Addison-Wesley, 1987. ",
      "doi": "10.5555/6682"
    },
    {
      "text": "Sidner, C. Using Discourse to Negotiate in Collaborative Activity: An Artificial }Language. 1992, Workshop on Cooperation Among Heterogeneous Agents: NCAI Conference.",
      "doi": ""
    },
    {
      "text": "Takemura, H. &amp; F. Kishino. Cooperative Work Environment Using Virtual Workspace. In Proceedings of Computer Supported Cooperative Work. Toronto, 1992.  ",
      "doi": "10.1145/143457.269747"
    },
    {
      "text": "Takeuchi, A. &amp; K. Nagao. Communicative Facial Displays as a New Conversational Modality. In Proceedings of INTERCHI '93. Amsterdam, ACM Press, 1993.  ",
      "doi": "10.1145/169059.169156"
    },
    {
      "text": "Thorisson, K.R. Dialog Control in Social Interface Agents. In Proceedings of INTERCHI \"93. Amsterdam, ACM Press, 1993.  ",
      "doi": "10.1145/259964.260151"
    },
    {
      "text": "Waters, K. A Muscle Model for Animating Threedimensional Facial Expressions. Computer Graphics, 1987. 21(4), p. 17-24.  ",
      "doi": "10.1145/37402.37405"
    },
    {
      "text": "Waters, K. &amp; T.M. Levergood. DECface: An Automatic Lip-synchronization Algorithm for Synthetic Faces. Cambridge Research Laboratory, Digital Equipment Corporation Technical Report CRL 93/4, 1993.",
      "doi": ""
    },
    {
      "text": "Zajonc, R. Social Facilitation. Science, 1965. 149, p. 269-274.",
      "doi": ""
    },
    {
      "text": "Zeithaml, V.A., A. Parasuraman, &amp; L.L. Berry. Communication and Control Processes in the Delivery of Service Quality. Journal of Marketing, 1988.52, p. 35-48.",
      "doi": ""
    },
    {
      "text": "Zeithaml, V.A., A. Parasuraman, &amp; L.L. Berry. Delivering quality service: balancing customer perceptions and expectations. New York: Free Press, 1990.",
      "doi": ""
    }
  ]
}