{
  "doi": "10.1145/191666.191821",
  "title": "Passive real-world interface props for neurosurgical visualization",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "452-458",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "University of Virginia, Departments of Neurosurgery and Computer Science",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Randy Pausch",
      "institution": "University of Virginia, University of Virginia, Computer Science",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    },
    {
      "name": "John C. Goble",
      "institution": "University of Virginia, Departments of Neurosurgery",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332500878",
      "orcid": "missing"
    },
    {
      "name": "Neal F. Kassell",
      "institution": "University of Virginia, Departments of Neurosurgery",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100259021",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Badler, N., Manoochehri, K., Baraff, D., \"Multi- Dimensional Input Techniques and Articulated Figure Positioning by Multiple Constraints,\" Proc. 1986 ACM Workshop on Int. 3D Graph., 151-170.  ",
      "doi": "10.1145/319120.319132"
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T., \"Toolglass and Magic Lenses: The See- Through Interface,\" SIGGRAPH '93, pp. 73-80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bolt, R., Herranz, E., \"Two-Handed Gesture in Multi-Modal Natural Dialog,\" UIST '92, pp. 7-13.  ",
      "doi": "10.1145/142621.142623"
    },
    {
      "text": "Buxton, W., \"Chunking and Phrasing and the Design of Human-Computer Dialogues,\" Information Processing '86, Proc. of the IFIP 10th World Computer Congress, pp. 475-480.",
      "doi": ""
    },
    {
      "text": "Buxton, W., Myers, B., \"A Study in Two-Handed Input,\" Proc. CHI'86, pp. 321-326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Conner, D., Snibbe, S., Herndon, K., Robbins, D., Zeleznik, R., van Dam, A., \"Three-Dimensional Widgets,\" Proc. 1992 Symposium on Interactive 3D Graphics, pp. 183-188,230-231.  ",
      "doi": "10.1145/147156.147199"
    },
    {
      "text": "Fitzkee, D., Magic By Misdirection, Lee Jacobs Productions, P. O. Box 362, Pomeroy, OH, 45769- 0362, 1975.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G., \"Situated Information Spaces and Spatially Aware Palmtop Computers,\" Comm. of the ACM, 36 (7), 1993, pp. 39-49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Hauptmann, A., \"Speech and Gestures for Graphic Image Manipulation,\" Proc. CHI'89, pp. 241-245.  ",
      "doi": "10.1145/67449.67496"
    },
    {
      "text": "Herndon, K., Zeleznik, R., Robbins, D., Conner, B., Snibbe, S., van Dam, A., \"Interactive Shadows,\" Proc. UIST'92, pp. 1-6.  ",
      "doi": "10.1145/142621.142622"
    },
    {
      "text": "Hewlett-Packard Company, 3000 Hanover St., Palo Alto CA 94304.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J. C., Kassell, N. F., \"A Three-Dimensional User Interface for Neurosurgical Visualization,\" Proc. SPIE Conf. on Medical Imaging, 1994 (to appear).",
      "doi": ""
    },
    {
      "text": "Interlink Electronics, (805) 484-8855.",
      "doi": ""
    },
    {
      "text": "International Technologies, Inc., (401) 781-5595.",
      "doi": ""
    },
    {
      "text": "Kabbash, P., MacKenzie, I. S., Buxton, W., \"Human Performance Using Computer Input Devices in the Preferred and Non-Preferred Hands,\" Proc. INTERCHI'93, pp. 474-481.  ",
      "doi": "10.1145/169059.169414"
    },
    {
      "text": "Karl, L., Pettey, M., Shneiderman, B., \"Speech- Activated versus Mouse-Activated Commands for Word Processing Applications: An Empirical Evaluation,\" Intl. J. Man-Machine Studies, 1993.",
      "doi": ""
    },
    {
      "text": "Kelly, P. J., Kall, B. A., eds., Computers in Stereotactic Neurosurgery, Blackwell Scientific Publications Inc., Cambridge, MA, 1992. ",
      "doi": "10.5555/573931"
    },
    {
      "text": "Liang, J., Green, M., \"JDCAD: A Highly Interactive 3D Modeling System,\" 3rd International Conference on CAD and Computer Graphics, Beijing, China, Aug. 1993, pp. 217-222.",
      "doi": ""
    },
    {
      "text": "McKenna, M., \"Interactive Viewpoint Control and Three-dimensional Operations,\" Proc. 1992 Symposium on Interactive 3D Graphics, pp. 53-56.  ",
      "doi": "10.1145/147156.147163"
    },
    {
      "text": "Nielsen, J., \"Noncommand User Interfaces,\" Communications of the ACM, 36 (4), pp. 83-99.  ",
      "doi": "10.1145/255950.153582"
    },
    {
      "text": "Osborn, J., Agogino, A., \"An Interface for Interactive Spatial Reasoning and Visualization,\" Proc. CHI'92, pp. 75-82.  ",
      "doi": "10.1145/142750.142762"
    },
    {
      "text": "Pausch, R., Shackelford, M. A., Proffitt, D., \"A User Study Comparing Head-Mounted and Stationary Displays,\" Proc. IEEE Symposium on Research Frontiers in Virtual Reality, Oct. 1993.",
      "doi": ""
    },
    {
      "text": "Pausch, R., Vogtle, L., Conway, M., \"One Dimensional Motion Tailoring for the Disabled: A User Study,\" Proc. CHI' 92, pp. 405-411.  ",
      "doi": "10.1145/142750.142876"
    },
    {
      "text": "Polhemus Navigation Sciences, (802) 655-3159.",
      "doi": ""
    },
    {
      "text": "Sachs, E., Roberts, A., Stoops, D., \"3-Draw: A Tool for Designing 3D Shapes,\" IEEE Computer Graphics and Applications, Nov. 1991, pp. 18-26.  ",
      "doi": "10.1109/38.103389"
    },
    {
      "text": "Schmandt, C. M., \"Spatial Input/Display Correspondence in a Stereoscopic Computer Graphic Work Station,\" Proc. SIGGRAPH '83, Computer Graphics, 17 (3), 1983, pp. 253-262.  ",
      "doi": "10.1145/964967.801156"
    },
    {
      "text": "Sellen, A. J., Kurtenbach, G. P., Buxton, W. A. S., \"The Role of Visual and Kinesthetic Feedback in the Prevention of Mode Errors,\" Proc. IFIP INTERACT' 90, pp. 667-673. ",
      "doi": "10.5555/647402.725427"
    },
    {
      "text": "Spectra Symbol, (801) 972-6995.",
      "doi": ""
    },
    {
      "text": "Tognazzini, B., \"Principles, Techniques, and Ethics of Stage Magic and Their Application to Human Interface Design,\" Proc. INTERCHI'93, pp. 355-361.  ",
      "doi": "10.1145/169059.169284"
    },
    {
      "text": "University of North Carolina, Dept. of Computer Science, Chapel Hill, NC. Unpublished virtual reality demonstration.",
      "doi": ""
    },
    {
      "text": "Verbex Voice Systems, Inc., 1-800-ASK-VRBX.",
      "doi": ""
    },
    {
      "text": "Ware, C., Arthur, K., Booth, K. S., \"'Fish Tank Virtual Reality,\" Proc. INTERCHI'93, pp. 37-41.  ",
      "doi": "10.1145/169059.169066"
    },
    {
      "text": "Wellner, P., \"Interacting with Paper on the DigitalDesk,\" Communications of the ACM, 36 (7), 1993, pp. 87-97.  ",
      "doi": "10.1145/159544.159630"
    }
  ]
}