{
  "doi": "10.1145/191666.191786",
  "title": "A taxonomy of see-through tools",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "358-364",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Eric A. Bier",
      "institution": "Xerox PARC, 3333 Coyote Hill Rd., Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100084142/rel-imgonly/bier-tree-128.jpg",
      "acmid": "81100084142",
      "orcid": "missing"
    },
    {
      "name": "Maureen C. Stone",
      "institution": "Xerox PARC, 3333 Coyote Hill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100388123",
      "orcid": "missing"
    },
    {
      "name": "Ken Fishkin",
      "institution": "Xerox PARC, 3333 Coyote Hill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424116",
      "orcid": "missing"
    },
    {
      "name": "William Buxton",
      "institution": "University of Toronto, CSRI, Toronto, ON, Canada, M5S 1A4",
      "img": "/do/10.1145/contrib-81452616426/rel-imgonly/81452616426.jpg",
      "acmid": "81452616426",
      "orcid": "0000-0002-0170-7097"
    },
    {
      "name": "Thomas Baudel",
      "institution": "Université de Paris-Sud, LRI, 91 405 Orsay Cedex, France",
      "img": "/do/10.1145/contrib-81100483880/rel-imgonly/tbaudel.jpg",
      "acmid": "81100483880",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joel F. Bartlett. Transparent controls for interactive graphics. WRL Technical Note TN-30, Digital Equipment Corporation, Palo Alto, CA, July 1992.",
      "doi": ""
    },
    {
      "text": "Eric A. Bier and Maureen Stone. Snap-dragging. Proceedings of Siggraph '86 (Dallas, August), Computer Graphics, Vol. 20, No. 4, ACM, 1986, pp. 233-240.  ",
      "doi": "10.1145/15886.15912"
    },
    {
      "text": "Eric A. Bier and Steve Freeman. MMM: a user interface architecture for shared editors on a single screen. Proceedings of the A CM SIGGRAPH Symposium o11 User Interface Software and Technology (South Carolina, November), ACM, 1991, pp. 79-86.  ",
      "doi": "10.1145/120782.120791"
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony D. DeRose. Toolglass and Magic Lenses: The See-Through Interface. Proceedings of Siggraph '93 (Anaheim, August), Co1~Tputer Graphics Annual Conference Series, ACM, 1993, pp. 73-80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, Ken Fishkin, Thomas Baudel, Matt Conway, William Buxton and Tony DeRose. Toolglass and Magic Lenses: The See-Through Interface (videotape, 10 minutes). In the formal video program of this conference.  ",
      "doi": "10.1145/259963.260447"
    },
    {
      "text": "William Buxton. Chunking and phrasing and the design of human-computer dialogues. Proceedings of the IFIP World Computer Congress (Dublin, Ireland), 1986, pp. 475-480.",
      "doi": ""
    },
    {
      "text": "William Buxton and Brad A. Myers. A study in twohanded input. Proceedings of CHI '86 Human Factors in Computing Systems (Boston, April), ACM, 1986, pp. 321-326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "J.D. Foley and V. L Wallace. The art of natural graphic man machine conversation. Proceedi~zgs of the IEEE, Vol. 62, No. 4, April 1974. Reprinted in IEEE Tutorial on Computer Graphics (2nd ed.), pp. 315-324.",
      "doi": ""
    },
    {
      "text": "Danny Goodman. The Complete HyperCard Handbook. Bantam Books, 1987. ",
      "doi": "10.5555/61924"
    },
    {
      "text": "Yves Guiard. Asymmetric division of labor in human skilled bimanual action: the kinematic chain as a model. The Journal of Motor Behavior, Vol. I9, No. 4, 1987, pp. 486-517.",
      "doi": ""
    },
    {
      "text": "Don Hopkins. The design and implementation of pie menus. Dr. Dobb's Journal, Vol. 16, No. 12, December 1991, pp. 16-26. ",
      "doi": "10.5555/135025.135026"
    },
    {
      "text": "Paul Kabbash, Abigail Sellen, and William Buxton. A comparison of two-handed click-through tools to traditional menu input. Included in these proceedings.",
      "doi": ""
    },
    {
      "text": "Myron W. Krueger, Thomas Gionfriddo, and Katrin Hinrichsen. VIDEOPLACE--An artificial reality. Proceedings of CHI '85, Human Factors i1~ Computer Systems (San Francisco, April), ACM, 1985, pp. 35-40.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. Issues in combining marking and direct manipulation techniques. Proceedings of the A CM Symposium on User Interface Software and Technology (UIST '91, S. Carolina, November), ACM, 1991, pp. 137-144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "MacDraw Manual. Apple Computer Inc. Cupertino, CA 95014, 1984.",
      "doi": ""
    },
    {
      "text": "William M. Newman. Markup. Alto User's Handbook, Xerox Palo Alto Research Center, 3333 Coyote Hill Rd., Palo Alto, CA 94304, 1979.",
      "doi": ""
    },
    {
      "text": "Ken Perlin and David Fox. Pad: an alternative approach to the computer interface. Proceedi~zgs of Siggraph '93 (Anaheim, August), Computer Graphics Annual Conference Series, ACM, 1993, pp. 57-64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "bnageVisio~, Silicon Graphics Inc., Mtn. View, CA.",
      "doi": ""
    },
    {
      "text": "Loretta Staples. Representation in virtual space: visual convention in the graphical user interface, figure 14. Proeeedillgs of lnterchi '93, Human Factors in Conlputing Systems (Amsterdam, April), ACM, 1993, pp. 348-354.  ",
      "doi": "10.1145/169059.169279"
    },
    {
      "text": "Maureen C. Stone, Ken Fishkin, Eric A. Bier. The movable filter as a user interface tool. Included in these proceedings.  ",
      "doi": "10.1145/191666.191774"
    },
    {
      "text": "Daniel C. Swinehart, Polle T. Zellweger, Richard J. Beach, and Robert B. Hagmann. A structural view of the Cedar programming environment. A CM Transactions on Programming Languages and Systems, Vol. 8, No. 4, ACM, 1986, pp. 419-490.  ",
      "doi": "10.1145/6465.6466"
    }
  ]
}