{
  "doi": "10.1145/191666.191726",
  "title": "Informal workplace communication: what is it like and how might we support it?",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "131-137",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Steve Whittaker",
      "institution": "Lotus Development Corporation, 1 Rogers St., Cambridge, MA and Office Appliances Dept., Hewlett-Packard Laboratories, Filton Road, Bristol, BS12 6QZ, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "David Frohlich",
      "institution": "Office Appliances Dept., Hewlett-Packard Laboratories, Filton Road, Bristol, BS12 6QZ, UK",
      "img": "/do/10.1145/contrib-81100162362/rel-imgonly/david_frohlich-small.jpg",
      "acmid": "81100162362",
      "orcid": "missing"
    },
    {
      "name": "Owen Daly-Jones",
      "institution": "Office Appliances Dept., Hewlett-Packard Laboratories, Filton Road, Bristol, BS12 6QZ, UK and Dept. of Psychology, U. of York, York Y01 5DD, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332495098",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "M. Abel. Experiences in an exploratory distributed organization. In J. Galeger, R. Kraut, and C. Egido, editors, Intellectual Teamwork: Social and Technologiccal Foundations of Co-operative Work, pages 489-510. Lawrence Erlbaum Associates, Hillsdale: NJ, 1990. ",
      "doi": "10.5555/117848.117866"
    },
    {
      "text": "W. Ablondi and T. Elliot. Mobile professional market segmentation study. BIS Strategic Decisions, 1993.",
      "doi": ""
    },
    {
      "text": "S. Bly, S. Harrison, and S. Irwin. Media spaces: Bringing people together in a video, audio and computing environment. Communications of the ACM, 36:28-45, 1993.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "R. Fish, R. Kraut, and B. Chalfonte. The videowindow system in informal communication. In Proceedings of the Conference on Computer Supported Co-operative Work, pages 1-12, 1990.  ",
      "doi": "10.1145/99332.99335"
    },
    {
      "text": "R. Fish, R. Kraut, R. Root, and R. Rice. Video as a technology for informal communication. Communications of the ACM, 36:48-61, 1993.  ",
      "doi": "10.1145/151233.151237"
    },
    {
      "text": "C. Heath and E Luff. Disembodied conduct: Communication through video in a multi-media environment. In Proceedings of Conference on Computer Human interaction, pages 99-103, 1991.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "R. Krant, C. Egido, and J. Galegher. Patterns of contact and communication in scientific research collaboration. in J. Galegher, R. Kraut, and C. Egido, editors, Intellectual Teamwork, pages 149-173. Lawrence Erlbaum Press, Hillsdale, N.J., 1990. ",
      "doi": "10.5555/117848.117854"
    },
    {
      "text": "R. Kraut, R. Fish, R. Root, and B. Chalfonte. Informal communication in organizations: form, function and technology. In R. Baecker, editor, Groupware and Computer-Supported Co-operative Work, pages 287- 314. Morgan Kaufmann, 1993.",
      "doi": ""
    },
    {
      "text": "M. Mantei, R. Baecker, A. Sellen, W. Buxton, T. Milligan, and B. Wellman. Experiences in the use of a media space. In Proceedings of the Conference on Computer Human Interaction, pages 203-209, 1991.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "B. O'Conaill, S. Whittaker, and S. Wilbur. Conversations over video-conferences: An evaluation of videomediated interaction. To appear in Human Computer Interaction, 1993.  ",
      "doi": "10.1145/259964.260080"
    },
    {
      "text": "G. Olson, J. Olson, M. Carter, and M. Storrosten. Small group design meetings: An analysis of collaboration. Human Computer Interaction, 7:347-374, 1992.",
      "doi": "10.1207/s15327051hci0704_1"
    },
    {
      "text": "R. Panko. Managerial communication patterns. Journal of Organisational Computing, 1992.",
      "doi": ""
    },
    {
      "text": "R. Rice and D. Shook. Voice messaging, co-ordination and communication. In J. Galegher, R. Kraut, and C. Egido, editors, Intellectual Teamwork, pages 327- 350. Lawrence Erlbaum Press, Hillsdale, N.J., 1990. ",
      "doi": "10.5555/117848.117860"
    },
    {
      "text": "L. Sproull. The nature of managerial attention. In L. Sproull and J. Larkey, editors, Advances in Information Processing in Organizations. JAI Press, 1984.",
      "doi": ""
    },
    {
      "text": "L. Suchman. Constituting shared workspaces. In D. Middleton and Y. Engestrom, editors, Cognition and communication at work. Sage, 1992.",
      "doi": ""
    },
    {
      "text": "J. Tang. Findings from observational studies of collaborative work. International Journal of Man-Machine Studies, 34:143-160, 1991.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "J. Tang and E. Isaacs. Why do users like video: Studies of multimedia-supported collaboration. Technical Report SMLI TR-92-5, SUN Microsystems Lab, 1992. ",
      "doi": "10.5555/974914"
    },
    {
      "text": "J. Tang and M. Rua. Montage: Providing teleproximity for distributed groups. In Proceedings of the Conference on Computer Human Interaction, 1994.  ",
      "doi": "10.1145/191666.191688"
    },
    {
      "text": "S. Whittaker, E. Geelhoed, and E, Robinson. Shared workspaces: How do they work and when are they useful? International Journal of Man-Machine Studies, 1993.  ",
      "doi": "10.1006/imms.1993.1085"
    }
  ]
}