{
  "doi": "10.1145/191666.191777",
  "title": "Evaluating the influence of interface styles and multiple access paths in hypertext",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "323-329",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Pawan R. Vora",
      "institution": "Department of Industrial Engineering, State University of New York at Buffalo, 342 Bell Hall, Amherst, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332533896",
      "orcid": "missing"
    },
    {
      "name": "Martin G. Helander",
      "institution": "Department of Industrial Engineering, State University of New York at Buffalo, 342 Bell Hall, Amherst, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100156628",
      "orcid": "missing"
    },
    {
      "name": "Valerie L. Shalin",
      "institution": "Department of Industrial Engineering, State University of New York at Buffalo, 342 Bell Hall, Amherst, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100246173",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Carmel, E., Crawford, S., and Chen, H. Browsing in hypertext: a cognitive study. IEEE Transactions on Systems, Man, and Cybernetics, 22(5), 1992, 865-884.",
      "doi": ""
    },
    {
      "text": "Chamey, D. A. Comprehending non-linear text: The role of discourse cues and reading strategies. Hypertext '87 (New York: ACM), 1987, 109-120.  ",
      "doi": "10.1145/317426.317436"
    },
    {
      "text": "Colley, A. M. Text comprehension. In J. Beech and A. Colley (eds.), Cognitive Approaches to Reading. (New York: Wiley), 1987",
      "doi": ""
    },
    {
      "text": "Collier, G. H. Thoth II: Hypertext with explicit semantics. Hypertext '87 (New York: ACM), 1987, 269-286.  ",
      "doi": "10.1145/317426.317446"
    },
    {
      "text": "Conklin, J. Hypertext: an introduction and survey. Computer, 20, 1987, 17-41.  ",
      "doi": "10.1109/MC.1987.1663693"
    },
    {
      "text": "Dillon, A. Readers' model of text structures: the case of academic articles. International Journal of Man- Machine Studies, 35, 1991, 913-925.  ",
      "doi": "10.1016/S0020-7373%2805%2980168-3"
    },
    {
      "text": "Edwards, D. M. and Hardman, L. 'Lost in hyperspace': Cognitive mapping and navigation in a hypertext environment. In R. McAleese-(ed.), Hypertext: Theory into Practice. (Norwood, NJ: Ablex), 1989, 105-125. ",
      "doi": "10.5555/320628.320639"
    },
    {
      "text": "Ekstrom, R. B., French, J. W., Harman, H. H., and Dermen, D. Kit of Factor-Referenced Cognitive Tests. Educational Testing Service, (Princeton, New Jersey), 1976.",
      "doi": ""
    },
    {
      "text": "Elm, W. C. and Woods, D. D. Getting lost: A case study in interface design. Proceedings of the Human Factors Society 29th Annual Meeting, (Santa Monica, CA: Human Factors Society), 1985, 927-931.",
      "doi": ""
    },
    {
      "text": "Foss, C. L. Tools for reading and browsing hypertext. Information Processing Management, 25(4), 1989, 407-418.  ",
      "doi": "10.1016/0306-4573%2889%2990068-X"
    },
    {
      "text": "Halasz, F. G., Moran, T. P., and Trigg, R. H. NoteCards in a nutshell. CHI+GI, 1987, 45-52.  ",
      "doi": "10.1145/29933.30859"
    },
    {
      "text": "Instone, K., Teasley, B. M., and Leventhal, L. M. Empirically-based re-design of a hypertext enc yclopedia, INTER CHl '93, 1993, 500-506. ",
      "doi": "10.5555/164632.164983"
    },
    {
      "text": "Kintsch, W. and van Dijk, T. A. Towards a model of text comprehension and production. Psychological Review, 85, 1978, 363-394.",
      "doi": ""
    },
    {
      "text": "Kintsch, W. and Yarbrough, J. C. Role of rhetorical structures in text comprehension. Journal of Educational Psychology, 74(x), 828-834.",
      "doi": ""
    },
    {
      "text": "Mohageg, M. F. The influence of hypertext linking structures on the efficiency of information retrieval. Human Factors, 34, 1992, 351-367. ",
      "doi": "10.1177/001872089203400308"
    },
    {
      "text": "Murray, P. C. Tyrannical links, loose associations, and other difficulties of hypertext. ACM SIGLINK, 2(1), 1993, 10-12.  ",
      "doi": "10.1145/152424.152427"
    },
    {
      "text": "Nielsen, J. Hypertext and Hypermedia (New York: Academic Press), 1990. ",
      "doi": "10.5555/79094"
    },
    {
      "text": "Nielsen, J. The matters that really matter for hypertext usability, Hypertext '89 Proceedings (New York: ACM), 1989, 239-248.  ",
      "doi": "10.1145/74224.74244"
    },
    {
      "text": "Parsaye, K., Chignell, M., Khoshafian, S., and Wong, H. Intelligent Databases (New York: John Wiley), 1989. ",
      "doi": "10.5555/87218.87230"
    },
    {
      "text": "Perrig, W. and Kintsch, W. Propositional and situational representations of text. Journal of Memory and Language, 24(x), 1982, 503-518.",
      "doi": ""
    },
    {
      "text": "Pitrella, F. D. and Kfippler, W. D. Identification and evaluation of scale design principles in the development of extended range, sequential judgment scale. Wachtberg: Forschungsinstitut fur Anthropotechnik. ReportNo. 80, 1988.",
      "doi": ""
    },
    {
      "text": "Plaisant, C. Guide to Opportunities in Volunteer Archaeology: case study on the use of a hypertext system in a museum exhibit. In E. Berk and J. Devlin (eds.), Hypertext/Hypermedia Handbook (New York: McGraw Hill). 1988, 498-505. ",
      "doi": "10.5555/116408.116453"
    },
    {
      "text": "Pohl, R.F. Acceptability of story continuation. In A. Flammer and W. Kintsch (Eds.), Discourse Processing (Amsterdam: North-Holland), 1982.",
      "doi": ""
    },
    {
      "text": "Simpson, A. and McKnight, C. Navigation in hypertext: structural cues and mental maps. in R. McAleese and C. Green (eds.), Hypertext: State of the Art (Oxford: Intellect), 1990.",
      "doi": ""
    },
    {
      "text": "Spyridakis, J. H. and Isakson, C. S. Hypertext: A new tool and its effect on audience comprehension. ~C 91 Proceedings, 1991, 37-44.",
      "doi": ""
    },
    {
      "text": "Thiiring, M., Haake, J. M., and Hanneman, J. What's Eliza doing in the Chinese Room? incoherent hyperdocuments -- and how to avoid them. Hypertext '91, 1991, 161-177.  ",
      "doi": "10.1145/122974.122991"
    }
  ]
}