{
  "doi": "10.1145/191666.191732",
  "title": "Nonvisual presentation of graphical user interfaces: contrasting two approaches",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "166-172",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "Graphics, Visualization and Usability Center, Georgia Institute of Technology, Atlanta, Georgia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    },
    {
      "name": "Gerhard Weber",
      "institution": "Universitäe Stuttgart, Institut füe Informatik, and F.H. Papenmeier GmbH&Co, KG, Schwerte, Institut füe Informatik, Breitwiesenstr., 20-22, 70565 Stuttgart, F.R. Germany",
      "img": "/do/10.1145/contrib-81100649507/rel-imgonly/gweber2008.jpg",
      "acmid": "81100649507",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L.H. Boyd, W.L. Boyd, and G.C. Vanderheiden. The graphical user interface: Crisis, danger and opportunity. Journal of Visual Impairment and Blindness, pages 496- 502, December 1990.",
      "doi": ""
    },
    {
      "text": "David Burgess. Low Cost Sound Spatialization. In UIST '92: The Fifth Annual Symposium on User Interface Software and Technology Conference Proceedings, November 1992.",
      "doi": ""
    },
    {
      "text": "Alistair D. N. Edwards. Modeling blind users' interactions with an auditory computer interface, international Journal of Man-Machine Studies, pages 575-589, 1989.  ",
      "doi": "10.1016/S0020-7373%2889%2980035-5"
    },
    {
      "text": "W. Keith Edwards, Elizabeth D. Mynatt and Tom Rodriguez. The Mercator Project: A Nonvisual Interface to the X Window System. The X Resource. O'Reilly &amp; Associates, Inc. April 1993. ",
      "doi": "10.5555/178463.178470"
    },
    {
      "text": "W.W. Gaver. The SonicFinder\" An interface that uses auditory icons. Human Computer Interaction, 4:67-94, 1989.",
      "doi": "10.1207/s15327051hci0401_3"
    },
    {
      "text": "W. W. Gaver. Synthesizing Auditory Icons. Proceedings of the 1992 International Conference on Auditory Display. Addison-Wesley Publishing Company.",
      "doi": ""
    },
    {
      "text": "Hill, R. D. Supporting concurrency, communication and synchronization in Human - Computer Interaction - the Sassafras UIMS, A CM Transactions on Graphics, Vol. 5, No. 3 (1986) 179 - 210.  ",
      "doi": "10.1145/24054.24055"
    },
    {
      "text": "Lester E Ludwig, Natalio Pincever, and Michael Cohen. Extending the notion of a window system to audio. Computer, pages 66-72, August 1990.  ",
      "doi": "10.1109/2.56873"
    },
    {
      "text": "Elizabeth Mynatt and Keith Edwards. New metaphors for nonvisual interfaces. In Extraordinary Human-Computer Interaction, 1991. Draft chapter accepted for upcoming book.",
      "doi": ""
    },
    {
      "text": "Elizabeth Mynatt and W. Keith Edwards. Mapping GUIs to Auditory Interfaces. In UIST '92: The Fifth Annual Symposium on User Interface Software and Technology Conference Proceedings, November 1992.  ",
      "doi": "10.1145/142621.142629"
    },
    {
      "text": "Elizabeth D. Mynatt. Auditory Presentation of Graphical User Interfaces. Auditory Presentation of Graphical User Interfaces. Proceedings of the 1992 International Conference on Auditory Display. Addison-Wesley Publishing Company.",
      "doi": ""
    },
    {
      "text": "Petrie, H; Heinila, J; Ekola, H. (1993) A comparative evaluation of computer input devices for blind user, in Proceedings of ECART 2, Stockholm, May 26-28, 1993, pp. P-II",
      "doi": ""
    },
    {
      "text": "Schwerdtfeger, Richard S.: Making the GUI talk, BYTE, Dec 1991, 118-128.",
      "doi": ""
    },
    {
      "text": "Vanderheiden, G. C.; Boyd, W.; Mendenhall, J.H.; Ford, K.: Development of a multisensory nonvisual interface to computers for blind users, in Proceedings of the Human Factors Society 35th Annual Meeting 1991, pp. 315-318",
      "doi": ""
    },
    {
      "text": "Weber, G.: Adapting graphical interaction objects for blind users by integrating braille and speech, in Zagler, W. (Ed.) Computers for Handicapped Persons, Oldenburg: Wien, 1992",
      "doi": ""
    },
    {
      "text": "Weber, G.(1993) Adapting direct manipulation for blind users, in Ashlund, Stacey et.al (eds.): Adjunct Proceedings of lNTERCHI '93, Addison Wesley, pp. 21-22  ",
      "doi": "10.1145/259964.260016"
    },
    {
      "text": "Weber, G. (1993) Access by blind people to interaction objects in MS Windows, in Proceedings of ECART 2, Stockholm, May 26-28, 1993, pp. 2.2",
      "doi": ""
    },
    {
      "text": "Bryant W. York, editor. Final Report of the Boston University Workshop on Computers and Persons with Disabilities, 1989.",
      "doi": ""
    }
  ]
}