{
  "doi": "10.1145/191666.191738",
  "title": "Protofoil: storing and finding the information worker's paper documents in an electronic file cabinet",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "180-185",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "tags": [
    "filing of paper documents",
    "paper user interface",
    "document imaging",
    "ad hoc information work",
    "information retrieval"
  ],
  "authors": [
    {
      "name": "Ramana Rao",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100591911",
      "orcid": "missing"
    },
    {
      "name": "Stuart K. Card",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81406592524/rel-imgonly/card_5x7.jpg",
      "acmid": "81406592524",
      "orcid": "missing"
    },
    {
      "name": "Walter Johnson",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100448919",
      "orcid": "missing"
    },
    {
      "name": "Leigh Klotz",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100428151",
      "orcid": "missing"
    },
    {
      "name": "Randall H. Trigg",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607598",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Blomberg, L. Suchrnan, and R. Trigg. Reflections on the work-oriented design project in three voices. In Social Science, Technical Systems, and Cooperative Work. 1994. Forthcoming.",
      "doi": ""
    },
    {
      "text": "D. O. Case. Collection and organization of written information by social scientists and humanists: a review and exploratory study. Journal of Information Science, 12:97- 104, 1986.  ",
      "doi": "10.1177/016555158601200302"
    },
    {
      "text": "D.O. Case. Conceptual organization and retrieval of text by historians: The role of memory and metaphor. Journal of the American Society for Information Sciences, 42(9):657- 668, 1991.",
      "doi": ""
    },
    {
      "text": "I. Cole. Human aspects of office filing: Implications for the electronic office. In Proceedings of the Human Factors Society 26th Annual Meeting, pages 59-62, 1982.",
      "doi": ""
    },
    {
      "text": "D. Cutting, J. Pedersen, and E-K. Halvorsen. An objectoriented architecture for text retrieval, In Conference Proceedings of RIAO' 91, Intelligent Text and Image Handling, Barcelona, Spain, pages 285-298, April 199 I.",
      "doi": ""
    },
    {
      "text": "D.R. Cutting, D. R. Karger, J. O. Pedersen, and J. W. Tukey. Scatter/gather: A cluster-based approach to browsing large document collections. In Proceedings of SIGIR' 92, June 1992.  ",
      "doi": "10.1145/133160.133214"
    },
    {
      "text": "W. Johnson, S. K. Card, H. jellinek, L. Klotz, and R. Rao. Bridging the paper and electronic worlds: The paper user interface. In Proceedings oflNTERCHI, 1993, pages 507- 512. ACM, April 1993. ",
      "doi": "10.5555/164632.164986"
    },
    {
      "text": "B. H. Kwasnik. The Influence of Context on Classifacto~ Behavior. PhD thesis, Rutgers University, 1989.",
      "doi": ""
    },
    {
      "text": "T.W. Malone. How do people organize their desks? implications for the design of office information systems. ACM Transactions on Office Information Systems, 1(1):99-112, 1983.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "J. O. Pedersen, D. R. Cutting, and J. W. Tukey. Snippet search: a single phrase approach to text access. In Proceedings of the 1991 Joint Statistical Meetings. American Statistical Association, 1991.",
      "doi": ""
    },
    {
      "text": "S. Putz. Design and implementation of the system 33 document service. ISTL Tech Report P93-00112, Xerox PARC, ISTL, 1993.",
      "doi": ""
    },
    {
      "text": "R. Rao, S. K. Card, H. Jellinek, J. D. Mackinlay, and G. G. Robertson. The information grid: A framework for building information retrieval and retrieval-centered applications. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM Press, Nov 1992.  ",
      "doi": "10.1145/142621.142625"
    },
    {
      "text": "R. Rao, D. M. Russell, and J. D. Mackinlay. System components for embedded information retrieval from multiple disparate information sources. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM Press, Nov 1993.  ",
      "doi": "10.1145/168642.168645"
    }
  ]
}