{
  "doi": "10.1145/191666.191728",
  "title": "Methods in search of methodology—combining HCI and object orientation",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "145-151",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Susan E. McDaniel",
      "institution": "Cognitive Science and Machine Intelligence Laboratory, The University of Michigan, 701 Tappan Street, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100363603",
      "orcid": "missing"
    },
    {
      "name": "Gary M. Olson",
      "institution": "Cognitive Science and Machine Intelligence Laboratory, The University of Michigan, 701 Tappan Street, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81100178543/rel-imgonly/81100178543.jpg",
      "acmid": "81100178543",
      "orcid": "missing"
    },
    {
      "name": "Judith S. Olson",
      "institution": "missing",
      "img": "/do/10.1145/contrib-81350567367/rel-imgonly/81350567367.jpg",
      "acmid": "81350567367",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, N. and Olson, J. R. (Eds.) Methods for Designing Software to Fit Human Needs and Capabilities: Proceedings of the Workshop on Software Human Factors. National Academy Press. 1985.",
      "doi": ""
    },
    {
      "text": "Belotti, V.M.E. Applicability of HCI Techniques to Systems Interface Design. Doctoral thesis. Queen Mary and Westfield College, London. 1990.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T. E, and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Inc. 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Coad, E and Yourdan, E. Object-Oriented Analysis. Yourden Press. 1991. ",
      "doi": "10.5555/130444"
    },
    {
      "text": "Coad, E and Yourdan, E. Object-Oriented Design. Yourden Press. 1991. ",
      "doi": "10.5555/119316"
    },
    {
      "text": "Hammer, M., and Champy, J. Reengineering the corporation: A manifesto for business revolution. Harper- Collins Publishers, Inc. 1993.",
      "doi": ""
    },
    {
      "text": "Jacobson, I., Christerson, M., Jonsson, E, and Overgaard, G. Object-Oriented Software Engineering, A Use Case Driven Approach. ACM Press and Addison- Wesley. 1992. ",
      "doi": ""
    },
    {
      "text": "Lira, K. Y. and Long, J. H. A Method for (Recruiting) Methods: Facilitation Human Factors Input to System Design. CHI '92 Conference Proceedings. ACM Press 1992.  ",
      "doi": "10.1145/142750.142984"
    },
    {
      "text": "Kieras, D. and Polson, E G. A Generalized Transition Network Representation for Interactive Systems. CHI '83 Conference Proceedings. ACM Press. 1983.  ",
      "doi": "10.1145/800045.801590"
    },
    {
      "text": "Moran, T. Getting into a system: External-internal task mapping analysis. Proceedings of the Conference on Human Factors in Computing Systems. ACM Press. 1983.  ",
      "doi": "10.1145/800045.801578"
    },
    {
      "text": "Olson, j. S. and Olson, G. M. The ~owth of cognitive modeling since GOMS. Human Computer Interaction. v6. 1991.",
      "doi": ""
    },
    {
      "text": "Poison, P.G., Lewis, C., Gugerty, L., Rudisill, M. (Eds.). Human-computer interface design: Success cases, emerging methods and real world contexts. (in press)",
      "doi": ""
    },
    {
      "text": "Robertson, Scott P. Generating Object-oriented design representations via scenario queries. J. Carroll (Ed.), Scenario-based design: Envisioning work in technology and system design (in press). ",
      "doi": "10.5555/209227.209249"
    },
    {
      "text": "Sasso, William C., Olson, Judith R., and Merten, Alan G. The Practice of Office Analysis: Objectives, Obstacles, and Opportunities. Office Knowledge Engineering. May 1987.",
      "doi": ""
    }
  ]
}