{
  "doi": "10.1145/191666.191727",
  "title": "A room of our own: experiences from a direct office share",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "138-144",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Annette Adler",
      "institution": "Xerox Corporation, 3333 Coyote Hill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100058926",
      "orcid": "missing"
    },
    {
      "name": "Austin Henderson",
      "institution": "Xerox Corporation, 3333 Coyote Hill Rd., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100433710",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, Victoria and Sellen, Abigail. 1993. \"Design for Privacy in Ubiquitous Computing Environments,\" ECSCW'93 Proceedings, 77-92.]] ",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Bly, Sara; Harrison, Steve; and Irwin, Susan. 1993. \"Media Spaces: Bringing People Together in a Video, Audio and Computing Environment,\" Communications of the ACM: v 36, n l, January 1993, pp28-47.]]  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Bowers, John and Rodden, Tom. 1993. \"Exploding the Interface: Experiences of the CSCW Network,\" INTERCHI'93 Proceedings, pp 255-262.]]  ",
      "doi": "10.1145/169059.169205"
    },
    {
      "text": "Clement, Andrew. 1993. \"Working in (and on) the Electronic Fishbowl? Privacy Aspects of Multi-media Communications,\" paper presented at the WIP WG9.1 NetWORKing Conference, Vienna, Austria, June 16- 18, 1993.]] ",
      "doi": "10.5555/647075.713913"
    },
    {
      "text": "Dourish, Paul. 1991. \"Godard: A Flexible Architecture for A/V Services in a Media Space,\" EuroPARC: Technical Report EPC-91-134.]]",
      "doi": ""
    },
    {
      "text": "Dourish, Paul. 1993 \"Culture and Control in a Media Space,\" ECSCW'93 Proceedings, pp 125-138.]] ",
      "doi": "10.5555/1241934.1241943"
    },
    {
      "text": "Dourish, P and Bellotti, V. 1991. \"Peculiar Practices in the (Virtual) Shared Office: a Dyad's Diary,\" Unpublished notes, Cambridge: Rank Xerox EuroPARC.]]",
      "doi": ""
    },
    {
      "text": "Dourish, Paul and Bly, Sara. 1992. \"Portholes\" Supporting Awareness in a Distributed Work Group, \" CH192 Proceedings, pp541-547.]]  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Fish, Robert; Kraut, Robert; Root, R.W. and Rice R.E. 1993. \"Video as a Technology for Informal Communications,\" Communications of the ACM, v. 36, n l, January 1993, pp48-61.]]  ",
      "doi": "10.1145/151233.151237"
    },
    {
      "text": "Gale, S. 1991. \"Adding audio and video to an office environment,\" In Studies in Computer Supported Cooperative Work. Bowers and Benford, Eds. Elsevier Science Publishers B.V. pp49-62.]] ",
      "doi": "10.5555/117730.117734"
    },
    {
      "text": "Gaver, William. 1992. \"The Affordances of Media Spaces for Collaboration,\" CSCW'92 Proceedings, pp17-24.]]  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Gaver, William; Moran, Thomas; MacLean, Allan; Lovstrand, Lennart; Dourish, Paul; Carter, Kathleen; and Buxton, William. 1992. \"Realizing a video environment\" EuroPARC's RAVE system,\" CHI'92 Proceedings, pp27-35.]]  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Gaver, William; Sellen, Abigail; Heath, Christian; Luff, Paul. 1993. \"One is Not Enough: Multiple Views in a Media Space,\" INTERCHI'93 Proceedings, pp335-339.]]  ",
      "doi": "10.1145/169059.169268"
    },
    {
      "text": "Heath, Christian and Luff, Paul. 1991. \"Disembodied Conduct: Communication through video in a multimedia office environment,\" CHI'91 Proceedings, pp99- 103.]]  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Heath, Christian and Luff, Paul. 1992. \"Collaboration and Control: Crisis Management and Multimedia Technology in London Underground Line Control Rooms,\" Computer Supported Cooperative Work 1:69-94. Netherlands: Luewer Academic Publishers.]]",
      "doi": ""
    },
    {
      "text": "Heath, Christian and Luff, Paul. 1992. \"Media Spaces and Communicative Asymmetries: Preliminary Observations of Video Mediated Interaction,\" Human- Computer Interaction, v7, pp315-346.]]",
      "doi": ""
    },
    {
      "text": "Hollan, Jim. and Stornella, Scott. 1992. \"Beyond Being There,\" CHr92 Proceedings, pp 119-125.]]  ",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Mackay, Wendy. 1991. \"Beyond Interactive Design\" User Innovation in Co-adaptive Systems,\" EuroPARC Technical Report EPC 91-130, Cambridge: Rank Xerox EuroPARC.]]",
      "doi": ""
    },
    {
      "text": "Mantei, Marilyn; Baecker, Ronald; Sellen, Abigail; Buxton, William; and Milligan, Thomas. 1991. \"Experiences in the Use of a Media Space,\" CHr91 Proceedings, pp203-208.]]  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "Nardi, Bonnie; Schwarz, Heinrich; Kuchinsky, Allan; Leichner, Robert; Whittaker, Steve; Sclabassi, Robert. 1993. \"Turning Away from Talking Heads: The Use of Video-as-Data in Neurosurgery,\" INTERCHr93\" Proceedings, pp327-334.]]  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Pagani, Daniele and Mackay, Wendy. 1993 \"Bringing Media Spaces into the Real World,\" ECSCW'93 Proceedings, pp341-356.]] ",
      "doi": "10.5555/1241934.1241957"
    },
    {
      "text": "Suchman, Lucy. 1987. Plans and situated action: The problem of human-machine communication. New York: Cambridge University Press.]] ",
      "doi": "10.5555/38407"
    }
  ]
}