{
  "doi": "10.1145/191666.191822",
  "title": "The “Silk Cursor”: investigating transparency for 3D target acquisition",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "459-464",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Shumin Zhai",
      "institution": "Department of Industrial Engineering, University of Toronto, Toronto, Ontario, M5S 1A4, Canada",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    },
    {
      "name": "William Buxton",
      "institution": "University of Toronto & Xerox PARC, c/o CSRI, University of Toronto, Toronto, Ontario, M5S 1A4, Canada",
      "img": "/do/10.1145/contrib-81452616426/rel-imgonly/81452616426.jpg",
      "acmid": "81452616426",
      "orcid": "0000-0002-0170-7097"
    },
    {
      "name": "Paul Milgram",
      "institution": "ATR Communication System Research Laboratories, Kyoto, Japan and Department of Industrial Engineering, University of Toronto, Toronto, Ontario, M5S 1A4, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023721",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Braunstein, M.L., Anderson, G. J., Rouse, M. W., Tittle, J. S., Recovering viewer-centered depth from disparity, occlusion and velocity gradients. Perception &amp; Psychophysics. 40 (1986). 216-224,",
      "doi": ""
    },
    {
      "text": "Card, S., G. Robertson, and J. Mackinlay. The information visualizer. Proc. of CHI (1991). pp. 181- 194.  ",
      "doi": "10.1145/108844.108874"
    },
    {
      "text": "Chen, M., S. J. Mountford, and A. Sellen. A study in interactive 3-D rotation using 2-D control devices. Proc. of ACM Siggraph (1988).  ",
      "doi": "10.1145/54852.378497"
    },
    {
      "text": "Evans, K., P. Tanner, and M. Wein. Tablet-Based Valuators That Provide One, Two, or Three Degrees of Freedom. Computer Graphics. 15(3) (1981). 91-97o  ",
      "doi": "10.1145/965161.806794"
    },
    {
      "text": "Fitts, P.M. The information capacity of the human motor system in controlling the amplitude of movement. J. of Experimental Psychology. 47 (1954). 381-391.",
      "doi": ""
    },
    {
      "text": "Foley, J. D., A. van Dam, S. K. Feiner, J.F. Hughes. Computer Graphics Principles and Practice. 1990, Reading, MA: Addison-Wesley. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "MacKenzie, I. S., A. Sellen, and W. Buxton. A comparison of input devices in elemental pointing and dragging tasks. Proc. of CHI (1991). 161-166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "Mackinlay, J. D., S. Card, and G. G. Robertson. Rapid controlled movement through a virtual 3D workspace. Computer Graphics, Proc. of SIGGRAPH. 24(3) (1990). pp. 197-176.  ",
      "doi": "10.1145/97880.97898"
    },
    {
      "text": "Poulton, E.C., Tracking skill and manual control. 1974, New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Schriever, W. Experimentelle Studien tiber das stereoskopische Sehen. Zeitschrifl far Pscyhologie. 96 (1925). 113-170.",
      "doi": ""
    },
    {
      "text": "SIGGRAPH. Proceedings of Workshop on Interactive 3D Graphics. (1986- 1992). ACM SIGGRAPH.",
      "doi": ""
    },
    {
      "text": "Sollenberger, R. L. and P. Milgram. Effects of stereoscopic and rotational displays in a threedimensional path-tracing task. Human Factors. 35(3) (1993). 483-499.",
      "doi": ""
    },
    {
      "text": "Venolia, D. Facile 3D direct manipulation. Proc. of INTERCHI (1993). pp. 31-36.  ",
      "doi": "10.1145/169059.169065"
    },
    {
      "text": "Wickens, C. D., S. Todd, and K. Seedier, Threedimensional displays: Perception, implementation and applications. (1989). CSERIAC Technical Report 89- 001. Wright Patterson Air Force Base, Ohio.",
      "doi": ""
    },
    {
      "text": "Yeh, Y. Y. and L. D. Silverstein. Spatial judgments with monoscopic and stereoscopic presentation of perspective displays. Human Factors. 34(5) (1992). 583-600. ",
      "doi": "10.1177/001872089203400506"
    },
    {
      "text": "Zhai, S. and P. Milgram. Human Performance Evaluation of Manipulation Schemes in Virtual Environments. Proc. of VRAIS'93: IEEE Virtual Reality Annual international Symposium. (1993). pp.155-161.",
      "doi": "10.1109/VRAIS.1993.380784"
    },
    {
      "text": "Zhai, S. and P. Milgram. Human performance evaluation of isometric and elastic rate controllers in a 6 DOF tracking task. Proc. SPIE Vol. 2057 Telemanipulator Technology &amp; Space Telerobotics (1993).",
      "doi": ""
    }
  ]
}