{
  "doi": "10.1145/191666.191794",
  "title": "Recursive interfaces for reactive objects",
  "published": "1994-04-24",
  "proctitle": "CHI '94: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "379-385",
  "year": 1994,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Michael Travers",
      "institution": "MIT Media Laboratory, 20 Ames Street, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100009075",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple Computer. Apple Human Interface Guidelines: The Apple Desktop Interface. Addison-Wesley, Reading, Massachusetts, 1987.]] ",
      "doi": "10.5555/1207530"
    },
    {
      "text": "Chang, B.-W. and Ungar, D. Animation: From Cartoons to the User interface, in Proceedings of UIST '93. (November 3-5, Atlanta, Georgia), 1993, pp. 45- 56.]]  ",
      "doi": "10.1145/168642.168647"
    },
    {
      "text": "diSessa, A.A. and Abelson, H. Boxer: A Reconstructible Computational Medium. Communications of the ACM 29, 9, 1986, 859-868.]]  ",
      "doi": "10.1145/6592.6595"
    },
    {
      "text": "Fenton, J. and Beck, K. Playground: An Object Oriented Simulation System with Agent Rules for Children of All Ages. In Proceedings of OOPSLA '89. 1989, pp. 123-137.]]  ",
      "doi": "10.1145/74877.74891"
    },
    {
      "text": "Finzer, W. and Gould, L. Programming by Rehearsal. Xerox Palo Alto Research Center Research Report SCL-84-1, 1984.]]",
      "doi": ""
    },
    {
      "text": "Haase, K., Framer. Unpublished software. 1992.]]",
      "doi": ""
    },
    {
      "text": "Hutchins, E.L., Hollan, J.D., and Norman, D.A., Direct Manipulation Interfaces, in User Centered System Design, D.A. Norman and S.W. Draper, Editor. 1986, Lawrence Erlbaum Associates: Hillsdale NJ.]]",
      "doi": ""
    },
    {
      "text": "Kay, A. Vivarium Papers. Unpublished essays, 1990.]]",
      "doi": ""
    },
    {
      "text": "Lakoff, G. Women, Fire, and Dangerous Things. University of Chicago Press, Chicago, 1987.]]",
      "doi": ""
    },
    {
      "text": "Lieberman, H. Using Prototypical Objects to Implement Shared Behavior in Object Oriented Systems. In Proceedings of First ACM Conference on Object Oriented Programming Systems, Languages &amp; Application., 1986.]]  ",
      "doi": "10.1145/28697.28718"
    },
    {
      "text": "Minsky, M. Society of Mind. Simon &amp; Schuster, New York, 1987.]]",
      "doi": ""
    },
    {
      "text": "Smith, R. Experiences with the Alternate Reality Kit: An Example of the Tension Between Literalism and Magic. In Proceedings of SIGCHI+GI'87: Human Factors in Computing Systems. Toronto), 1987, pp. 61-67.]]  ",
      "doi": "10.1145/29933.30861"
    },
    {
      "text": "Travers, M., Animal Construction Kits, in Artificial Life: SFI Series in the Sciences of Complexity, C. Langton, Editor. 1988, Addison-Wesley, Reading, Massachusetts, pp. 421-442.]]",
      "doi": ""
    },
    {
      "text": "Ungar, D. and Smith, R.B. Self: The Power of Simplicity. In Proceedings of OOPSLA '87. (October 4-8. 1987, Orlando, Florida), 1987, pp. 227-241.]]  ",
      "doi": "10.1145/38765.38828"
    }
  ]
}