{
  "doi": "10.1145/2207676.2208544",
  "title": "Touch me once and i know it's you!: implicit authentication based on touch screen patterns",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "987-996",
  "year": 2012,
  "badges": [],
  "abstract": "Password patterns, as used on current Android phones, and other shape-based authentication schemes are highly usable and memorable. In terms of security, they are rather weak since the shapes are easy to steal and reproduce. In this work, we introduce an implicit authentication approach that enhances password patterns with an additional security layer, transparent to the user. In short, users are not only authenticated by the shape they input but also by the way they perform the input. We conducted two consecutive studies, a lab and a long-term study, using Android applications to collect and log data from user input on a touch screen of standard commercial smartphones. Analyses using dynamic time warping (DTW) provided first proof that it is actually possible to distinguish different users and use this information to increase security of the input while keeping the convenience for the user high.",
  "authors": [
    {
      "name": "Alexander De Luca",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488374",
      "orcid": "missing"
    },
    {
      "name": "Alina Hang",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371595104",
      "orcid": "missing"
    },
    {
      "name": "Frederik Brudy",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-81502796016/rel-imgonly/photo-square-medium.jpg",
      "acmid": "81502796016",
      "orcid": "missing"
    },
    {
      "name": "Christian Lindner",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502711390",
      "orcid": "missing"
    },
    {
      "name": "Heinrich Hussmann",
      "institution": "University of Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453637932",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aviv, A. J., Gibson, K., Mossop, E., Blaze, M., Smith, J. M. Smudge attacks on smartphone touch screens. In USENIX 4th Workshop WOOT 2010. ",
      "doi": "10.5555/1925004.1925009"
    },
    {
      "text": "Bigun, J., Fierrez-Aguilar, J., Ortega-Garcia, J., Gonzales-Rodriguez, J. Combining biometric evidence for person authentication. Advanced Studies in Biometrics. Springer (2005), 1--18.  ",
      "doi": "10.1007/11493648_1"
    },
    {
      "text": "Brunelli, R., Falavigna, D. Person identification using multiple cues. IEEE Transactions on Pattern Analysis and Machine Intelligence, 17(10). (1995), 955--966.  ",
      "doi": "10.1109/34.464560"
    },
    {
      "text": "Buchoux, A., Clarke, N.L. Deployment of keystroke analysis on a smartphone. In Proceedings AIMS 2008.",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T., Newell, A. Computer text-editing: An information-processing analysis of a routine cognitive skill. Cognitive Psychology, 12(1). (1980), 32--74.",
      "doi": ""
    },
    {
      "text": "Chow, R., Jakobsson, M., Masuoka, R., Molina, J., Niu, Y., Shi, E., Song, Z. Authentication in the clouds: a framework and its application to mobile users. In Proceedings Workshop CCSW 2010. ACM Press (2010), 1--6.  ",
      "doi": "10.1145/1866835.1866837"
    },
    {
      "text": "Clarke, N.L., Furnell, S.M. Authenticating mobile phone users using keystroke analysis. International Journal of Information Security, 6(1). Springer (2007), 1--14.  ",
      "doi": "10.1007/s10207-006-0006-6"
    },
    {
      "text": "Clarke, N.L., Furnell, S.M., Rodwell, P.M., Reynolds P.L. Acceptance of subscriber authentication methods for mobile telephony devices. Computers & Security, 21 (3). (2002), 220--228.",
      "doi": "10.1016/S0167-4048%2802%2900304-8"
    },
    {
      "text": "Coventry, L., De Angeli, A., Johnson, G. Usability and biometric verification at the ATM interface. In Proceedings CHI 2003. ACM Press (2003), 153--160.  ",
      "doi": "10.1145/642611.642639"
    },
    {
      "text": "Cutting, J., Kozlowski, L. Recognizing friends by their walk: Gait perception without familiarity cues. Bulletin of the Psychonomic Society, 9(5). (1977), 353--356.",
      "doi": ""
    },
    {
      "text": "De Luca, A., Denzel, M. and Hussmann, H. Look into my eyes! Can you guess my password? In Proceedings SOUPS 2009. ACM Press (2009), 7:1--7:12.  ",
      "doi": "10.1145/1572532.1572542"
    },
    {
      "text": "Dunphy, P., Yan, J. Do background images improve \"draw a secret\" graphical passwords? In Proceedings CCS 2007. ACM Press (2007), 36--47.  ",
      "doi": "10.1145/1315245.1315252"
    },
    {
      "text": "Fleishman, E., Parker, J. Factors in the retention and relearning of perceptual-motor skill. Journal of Experimental Psychology, 64. (1962), 215--226.",
      "doi": ""
    },
    {
      "text": "Francis, L., Mayes, K., Hancke, G., Markantonakis, K. A location based security framework for authenticating mobile phones. In Proceedings Workshop M-MPAC 2010. ACM Press (2010), 5:1--5:8.  ",
      "doi": "10.1145/1890791.1890796"
    },
    {
      "text": "Giorgino, T. Computing and visualizing dynamic time warping alignments in R: the DTW package. Journal of Statistical Software, 31(7). (2009), 1--24.",
      "doi": ""
    },
    {
      "text": "Gafurov, D., Helkala, K., Søndrol, T. Biometric gait authentication using accelerometer sensor. Journal of Computers, 1 (7). Academy Publisher (2006), 51--59.",
      "doi": ""
    },
    {
      "text": "Jakobsson, M., Shi, E., Golle, P., Chow, R. Implicit authentication for mobile devices. In Proceedings HotSec 2009. USENIX Association, 9--9. ",
      "doi": "10.5555/1855628.1855637"
    },
    {
      "text": "Jermyn, I., Mayer, A., Monrose, F., Reiter, M. K., Rubin, A. D. The design and analysis of graphical passwords. In Proceedings SSYM 1999. USENIX Association. ",
      "doi": "10.5555/1251421.1251422"
    },
    {
      "text": "Kar, B., Dutta, P. K., Basu, T. K., Vielhauer, C., Dittmann, J. DTW based verification scheme of biometric signatures. In Proceedings ICIT 2006.",
      "doi": ""
    },
    {
      "text": "Karlson, A., Brush, A.J., Schechter, S. Can i borrow your phone? Understanding concerns when sharing mobile phones. In Proceedings CHI 2009. ACM Press (2009), 1647--1650.  ",
      "doi": "10.1145/1518701.1518953"
    },
    {
      "text": "Kim, D., Dunphy, P., Briggs, P., Hook, J., Nicholson, J., Nicholson, J., Olivier, P. Multi-touch authentication on tabletops. In Proceedings CHI 2010. ACM Press (2010), 1093--1102.  ",
      "doi": "10.1145/1753326.1753489"
    },
    {
      "text": "Legget, J., Williams, G., Usnick, M. Dynamic identity verification via keystroke characteristics. International Journal of Man-Machine Studies, 35 (6). Academic Press Ltd (1991), 859--870.  ",
      "doi": "10.1016/S0020-7373%2805%2980165-8"
    },
    {
      "text": "Mantyjarvi, J., Lindholm, M., Vildjiounaite, E., Makela, S. M., Ailisto, H.A. Identifying users of portable devices from gait pattern with accelerometers. In Proceedings ICASSP 2005.",
      "doi": ""
    },
    {
      "text": "Marcel, S., Cool, C., Atanasoaei, C., Tarsetti, F., Pesán, J., Matejka, P., Cernocky, J., Helistekangas, M., Turtinen, M. MOBIO: mobile biometric face and speaker authentication, In Proceedings CVPR 2010.",
      "doi": ""
    },
    {
      "text": "Nelson, D. L., Reed, V. S., Walling, J. R. Pictorial superiority effect. Journal of Experimental Psychology: Human Learning and Memory 2 (5). (1976), 523--528.",
      "doi": ""
    },
    {
      "text": "Pons, A.P., Polak, P. Understanding user perspectives on biometric technology. Commun. ACM, 51 (9). ACM Press (2008), 115--118.  ",
      "doi": "10.1145/1378727.1389971"
    },
    {
      "text": "Rogers, J. Please enter your four-digit pin. Financial Services Technology, U.S. Edition Issue 4 (Mar. 2007).",
      "doi": ""
    },
    {
      "text": "Rokita, J. Krzyzak, A., Suen, C.Y. Cell phones personal authentication systems using multimodal biometrics. In Proceedings ICIAR 2008. Springer (2008), 1013--1022.  ",
      "doi": "10.1007/978-3-540-69812-8_101"
    },
    {
      "text": "Sakoe, H., Chiba, S. Dynamic programming algorithm optimization for spoken word recognition. IEEE Transactions on Acoustics, Speech and Signal Processing, 26(1). (1978), 43--49.",
      "doi": ""
    },
    {
      "text": "Shadmer, R., Brashers-Krug, T. Functional stages in the formation of human long-term motor memory. The Journal of Neuroscience, 17(1). (1997), 409--419.",
      "doi": ""
    },
    {
      "text": "Shi, E., Niu, Y., Jakobsson, M., Chow, R. Implicit authentication through learning user behavior. In Proceedings ISC 2010. Springer (2011), 99--113. ",
      "doi": "10.5555/1949317.1949329"
    },
    {
      "text": "Sonkamble, S., Thool, R., Sonkamble, B. Survey of biometric recognition systems and their applications. Journal of Theoretical and Applied Information Technology, 11(1). (2010), 45--51.",
      "doi": ""
    },
    {
      "text": "Standing, L. Learning 10,000 pictures. The Quarterly Journal of Experimental Psychology, 25(2). (1973), 20722.",
      "doi": ""
    },
    {
      "text": "Tamviruzzaman, M., Ahamed, S. I., Hasan, C. S., O'brien, C. ePet: When cellular phone learns to recognize its owner. In Proceedings Workshop SafeConfig 2009. ACM Press (2009), 13--18.  ",
      "doi": "10.1145/1655062.1655066"
    },
    {
      "text": "Wood, H.M. The use of passwords for controlled access to remote computer systems and services. In Proceedings AFIPS 1977. ACM Press(1977), 27--33.  ",
      "doi": "10.1145/1499402.1499410"
    },
    {
      "text": "Weiss, R., De Luca, A. PassShapes: utilizing stroke based authentication to increase password memorability. In Proceedings NordiCHI 2008. ACM Press (2008), 383392.  ",
      "doi": "10.1145/1463160.1463202"
    },
    {
      "text": "Yazji, S., Chen, X. Dick, R.P., Scheuermann P. Implicit user re-authentication for mobile devices. In Proceedings UIC 2009. Springer (2009), 325--339.  ",
      "doi": "10.1007/978-3-642-02830-4_25"
    },
    {
      "text": "Zhu, W., Zeng, N., Wang, N. Sensitivity, specificity, accuracy, associated confidence interval and ROC analysis with practical SAS implementations. In Proceedings Nesug 2010.",
      "doi": ""
    }
  ]
}