{
  "doi": "10.1145/2207676.2207745",
  "title": "Implanted user interfaces",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "503-512",
  "year": 2012,
  "badges": [],
  "abstract": "We investigate implanted user interfaces that small devices provide when implanted underneath human skin. Such devices always stay with the user, making their implanted user interfaces available at all times. We discuss four core challenges of implanted user interfaces: how to sense input through the skin, how to produce output, how to communicate amongst one another and with external infrastructure, and how to remain powered. We investigate these four challenges in a technical evaluation where we surgically implant study devices into a specimen arm. We find that traditional interfaces do work through skin. We then demonstrate how to deploy a prototype device on participants, using artificial skin to simulate implantation. We close with a discussion of medical considerations of implanted user interfaces, risks and limitations, and project into the future.",
  "authors": [
    {
      "name": "Christian Holz",
      "institution": "Autodesk Research, Toronto, Ontario, Canada & Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Anne Agur",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594919",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, S. D. Practical Light Embalming Technique for Use in the Surgical Fresh Tissue Dissection Laboratory. Clin Anat., 19(1), (2006), 8--11.",
      "doi": ""
    },
    {
      "text": "Ashbrook, D., Clawson, J., Lyons, K., Patel, N., Starner, T., Clara, S. Quickdraw: the impact of mobility and on-body placement on device access time. Proc. CHI '08, 219--222.  ",
      "doi": "10.1145/1357054.1357092"
    },
    {
      "text": "Badshah, A., Gupta, S., Cohn, G., Villar, N., Hodges, S., Patel, S. N. Interactive generator: a self-powered haptic feedback device. Proc. CHI '11, 2051--2054.  ",
      "doi": "10.1145/1978942.1979240"
    },
    {
      "text": "Brumberg, J. S., Nieto-Castanon, A., Kennedy, P. R., Guenther, F. H., Brain-computer interfaces for speech communication, Speech Communication, 52(4), Silent Speech Interfaces, April 2010, 367--379.  ",
      "doi": "10.1016/j.specom.2010.01.001"
    },
    {
      "text": "Cornsweet, T. N. The Staircase-Method in Psychophysics. Amer. J. Psychol., 75(3), (1962), 485--491.",
      "doi": ""
    },
    {
      "text": "Denning, T., Borning, A., Friedman, B., Gill, B. T., Kohno, T., Maisel, W. H. Patients, pacemakers, and implantable defibrillators: human values and security for wireless implantable medical devices. Proc. CHI '10, 917--926.  ",
      "doi": "10.1145/1753326.1753462"
    },
    {
      "text": "Denning, T., Matsuoka, Y., Kohno, T. Neurosecurity: security and privacy for neural devices. Neurosurg. Focus, 27(1), E7.",
      "doi": ""
    },
    {
      "text": "Drew, T., Gini, M. Implantable medical devices as agents and part of multiagent systems. Proc. AAMAS '06, 1534--1541.  ",
      "doi": "10.1145/1160633.1160930"
    },
    {
      "text": "Fitzpatrick, R. C., Day, B. L. Probing the human vestibular system with galvanic stimulation. Journal of Applied Physiology, June 2004, 96(6), 2301--2316.",
      "doi": ""
    },
    {
      "text": "Fornage, B. D., Deshayes, J. Ultrasound of Normal Skin. J Clin Ultrasound 14, (1986), 619--622.",
      "doi": ""
    },
    {
      "text": "Gelfand, S. A. Hearing: An introduction to psychological and physiological acoustics. 1990, 2nd edition. New York and Basel: Marcel Dekker, Inc.",
      "doi": ""
    },
    {
      "text": "GivenImaging. http://www.givenimaging.com",
      "doi": ""
    },
    {
      "text": "Gustafson, S., Holz, C., Baudisch, P. Imaginary Phone: Learning Imaginary Interfaces by Transfer of Spatial Memory from a Familiar Screen Device. Proc. UIST '11, 283--292.  ",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Hakoama, M. Hakoyama, S. The impact of cell phone use on social networking and development among college students. AABSS Journal, 15, (2011).",
      "doi": ""
    },
    {
      "text": "Halperin, D., Heydt-Benjamin, T. S., Ransford, B., Clark, S. S. Defend, B. Morgan, W. Fu, K., Kohno, T., Maisel, W. Pacemakers and Implantable Cardiac Defibrillators: Software Radio Attacks and Zero-Power Defenses. Proc. SP '08, 129--142.  ",
      "doi": "10.1109/SP.2008.31"
    },
    {
      "text": "Harrison, C., Benko, H., Wilson, A. D. OmniTouch: Wearable Multitouch Interaction Everywhere. Proc. UIST '11, 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Harrison, C., Tan, D. and Morris, D. Skinput: appropriating the body as an input surface. Proc. CHI '10, 453--462  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Hinckley, K., Pierce, J., Sinclair, M., Horvitz, E. Sensing techniques for mobile interaction. Proc. UIST '00, 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Ho, H., Saeedi, E., Kim, S. S., Shen, T. T., Parviz, B. A. Contact lens with integrated inorganic semiconductor devices. Proc. MEMS '08, 403--406.",
      "doi": ""
    },
    {
      "text": "Holz, C. and Baudisch, P. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. Proc. CHI '10, 581--590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Huo, X., Wang, J., Ghovanloo, M. 2008. A magneto-inductive sensor based wireless tongue-computer interface. IEEE Trans on Neural Sys Rehab Eng. 16(5), 497--504.",
      "doi": ""
    },
    {
      "text": "Jovanov, E., Milenkovic, A., Otto, C., de Groen, P. C. A wireless body area network of intelligent motion sensors for computer assisted physical rehabilitation. NeuroEng Rehab, 2(6).",
      "doi": ""
    },
    {
      "text": "Kaiser, M., Proffitt, D. Observers' sensitivity to dynamic anomalies in collisions. Percept. Psychophysics 42, 3, 275--280.",
      "doi": ""
    },
    {
      "text": "Karrer, T., Wittenhagen, M., Lichtschlag, L., Heller, F., Borchers, J. Pinstripe: eyes-free continuous input on interactive clothing. Proc. CHI '11, 1313--1322.  ",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Lambert, M., Chadwick, G., McMahon, A., Scarffe, H. Experience with the portacath. Hematol Oncol, 6(1), 57--63.",
      "doi": ""
    },
    {
      "text": "Levitt, H. Transformed up-down methods in psychoacoustics. J. Acoust. Soc. Am., 49(2), (1971), 467--477.",
      "doi": ""
    },
    {
      "text": "Li, Z., Wang, Z. L. Air/liquid pressure and heartbeat driven flexible fiber nanogenerators as micro-nano-power source or diagnostic sensors. Adv. Mater. 23, (2011), 84--89.",
      "doi": ""
    },
    {
      "text": "Luhrmann, T. What students can teach us about iPhones. Salon May 30, (2010). http://salon.com/a/sT_weAA",
      "doi": ""
    },
    {
      "text": "Masters, A., Michael, K. Humancentric Applications of RFID Implants: The Usability Contexts of Control, Convenience and Care. Proc. WMCS '05, 32--41.  ",
      "doi": "10.5555/1112245.1112712"
    },
    {
      "text": "Moore, M. M., Kennedy, P. R. Human factors issues in the neural signals direct brain-computer interfaces. Proc. Assets '00, 114--120.  ",
      "doi": "10.1145/354324.354351"
    },
    {
      "text": "Ni, T. and Baudisch, P. Disappearing mobile devices. Proc. UIST '09, 101--110.  ",
      "doi": "10.1145/1622176.1622197"
    },
    {
      "text": "Norman, D. Cyborgs. Commun. ACM 44, 3 (Mar 2001), 36--37.  ",
      "doi": "10.1145/365181.365185"
    },
    {
      "text": "Orth, M., Post, R., Cooper, E. Fabric computing interfaces. Proc. CHI '98. 331--332.  ",
      "doi": "10.1145/286498.286800"
    },
    {
      "text": "Powermat inductive charging. http://www.powermat.com.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J. GestureWrist and GesturePad: unobtrusive wearable interaction devices. Proc. ISWC '01, 21--27. ",
      "doi": "10.5555/580581.856565"
    },
    {
      "text": "Saponas, T. S., Kelly, D., Parviz, B., Tan, D. Optically sensing tongue gestures for computer input. Proc. UIST '09, 177--180.  ",
      "doi": "10.1145/1622176.1622209"
    },
    {
      "text": "Saponas, T. S., Tan, D. S., Morris, D., Balakrishnan, R., Turner, J., Landay, J. A. Enabling always-available input with muscle-computer interfaces. Proc. UIST '09, 167--176.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Smith, D. V., Margolskee, R. F. Making sense of taste. Sci. Am. 2001 Mar, 284(3), 32--39.",
      "doi": ""
    },
    {
      "text": "Starner, T. Human-powered wearable computing. IBM Systems Journal, 35 (3), (1996), 618--629.  ",
      "doi": "10.1147/sj.353.0618"
    },
    {
      "text": "Starner, T. The Challenges of Wearable Computing: Part 1. IEEE Micro 21, 4 (July 2001), 44--52.  ",
      "doi": "10.1109/40.946681"
    },
    {
      "text": "Starner, T. The Challenges of Wearable Computing: Part 2. IEEE Micro 21, 4 (July 2001), 54--67.  ",
      "doi": "10.1109/40.946683"
    },
    {
      "text": "Starner, T. The cyborgs are coming. Tech Report 318, Perceptual Computing, MIT Media Labaratory, November 1995.",
      "doi": ""
    },
    {
      "text": "Stelarc. Official website. http://www.stelarc.org",
      "doi": ""
    },
    {
      "text": "Tamaki, E., Miyaki, T., Rekimoto, J. PossessedHand: a hand gesture manipulation system using electrical stimuli. Proc. AH '10, Article 2, 5 pages.  ",
      "doi": "10.1145/1785455.1785457"
    },
    {
      "text": "Ullah, S., Higgin, H., Siddiqui, M., Kwak, K. A Study of Implanted and Wearable Body Sensor Networks. Proc. KES-AMSTA '08, 464--473. ",
      "doi": "10.5555/1787839.1787892"
    },
    {
      "text": "Warwick, K. Project Cyborg. Official website. http://www.kevinwarwick.com/",
      "doi": ""
    },
    {
      "text": "Weiser, M. The Computer for the 21st Century. Scientific American Special Issue on Communications, Computers, and Networks, 265(3), Sept. 1991, 94--104.",
      "doi": ""
    },
    {
      "text": "Wishnitzer, R., Laiteerapong, T., Hecht, O. Subcutaneous implantation of magnets in fingertips of professional gamblers - Case report. Plast Reconstr Surg, 71(3):473--474, 1983.",
      "doi": ""
    },
    {
      "text": "Wolpaw, J. R., Birbaumer, N., McFarland, D. J., Pfurtscheller, G., Vaughan, T. M. Brain-computer interfaces for communication and control. Clin Neurophysiol., 113(6), (2002), 767--791.",
      "doi": ""
    },
    {
      "text": "Yatani, K., Truong, K. N. SemFeel: a user interface with semantic tactile feedback for mobile touch-screen devices. Proc. UIST '09, 111--120.  ",
      "doi": "10.1145/1622176.1622198"
    }
  ]
}