{
  "doi": "10.1145/2207676.2208576",
  "title": "ShoeSense: a new perspective on gestural interaction and wearable applications",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1239-1248",
  "year": 2012,
  "badges": [],
  "abstract": "When the user is engaged with a real-world task it can be inappropriate or difficult to use a smartphone. To address this concern, we developed ShoeSense, a wearable system consisting in part of a shoe-mounted depth sensor pointing upward at the wearer. ShoeSense recognizes relaxed and discreet as well as large and demonstrative hand gestures. In particular, we designed three gesture sets (Triangle, Radial, and Finger-Count) for this setup, which can be performed without visual attention. The advantages of ShoeSense are illustrated in five scenarios: (1) quickly performing frequent operations without reaching for the phone, (2) discreetly performing operations without disturbing others, (3) enhancing operations on mobile devices, (4) supporting accessibility, and (5) artistic performances. We present a proof-of-concept, wearable implementation based on a depth camera and report on a lab study comparing social acceptability, physical and mental demand, and user preference. A second study demonstrates a 94-99% recognition rate of our recognizers.",
  "tags": [
    "wearable",
    "mobile",
    "gesture set",
    "sensor placement",
    "shoe",
    "gestures"
  ],
  "authors": [
    {
      "name": "Gilles Bailly",
      "institution": "Quality and Usability Lab, Telekom Innovation Laboratories, TU Berlin, Berlin, Germany",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    },
    {
      "name": "Jörg Müller",
      "institution": "Quality and Usability Lab, Telekom Innovation Laboratories, TU Berlin, Berlin, Berlin, Germany",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    },
    {
      "name": "Michael Rohs",
      "institution": "University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81314494694/rel-imgonly/mr-120.jpg",
      "acmid": "81314494694",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Sven Kratz",
      "institution": "University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602445",
      "orcid": "0000-0002-0068-0793"
    }
  ],
  "references": [
    {
      "text": "Adidas Megalizer: http://popsop.com/44586",
      "doi": ""
    },
    {
      "text": "Amft O. and Lukowicz, P. 2009. From Backpacks to Smartphones: Past, Present, and Future of Wearable Computers. IEEE Pervasive Computing 8, 3 (July 2009), 8--13.  ",
      "doi": "10.1109/MPRV.2009.44"
    },
    {
      "text": "Apple Inc., Take Nike + iPod on your Run. In Apple. As of 2011.9.9 from http://www.apple.com/ipod/nike/run.html",
      "doi": ""
    },
    {
      "text": "Ashbrook, D. L., Clawson, J., Lyons, K., Patel, N., Starner, T. 2008. Quickdraw: the impact of mobility and on-body placement on device access time. CHI '08, 219--222.  ",
      "doi": "10.1145/1357054.1357092"
    },
    {
      "text": "Augsten, T., Kaefer, K., Meusel, R., Fetzer, C. Kanitz, D. .Stoff, T., Becker, T., Holz, C., Baudisch, P. 2010. Multitoe: high-precision interaction with back-projected floors based on high-resolution multi-touch input. ACM UIST'10, 209--218.  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Bailly, G. Lecolinet, E, Nigay, L.. 2008. Flower menus: a new type of marking menu with large menu breadth, within groups and efficient expert mode memorization. AVI'08, 15--22.  ",
      "doi": "10.1145/1385569.1385575"
    },
    {
      "text": "Bailly, G., Lecolinet, E., Guiard, Y. 2010. Finger-count & radial-stroke shortcuts: 2 techniques for augmenting linear menus on multi-touch surfaces. ACM CHI '10, 591--594.  ",
      "doi": "10.1145/1753326.1753414"
    },
    {
      "text": "Bailly, G., Walter, R., Müller, J., Ning, T., Lecolinet, E. 2011. Comparing Free Hand Menu Techniques for Distant Displays using Linear, Marking and Finger-Count Menus. IFIP INTERACT'11. 248--262. ",
      "doi": "10.5555/2042118.2042143"
    },
    {
      "text": "Baudel T., Beaudouin-Lafon, M. 1993. Charade: remote control of objects using free-hand gestures. Commun. ACM 36, 7, 28--35.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Benko, H. and Wilson, A. D. (2010). Multi-Point Interactions with Immersive Omnidirectional Visualizations in a Dome. ACM ITS ' 19--28.  ",
      "doi": "10.1145/1936652.1936657"
    },
    {
      "text": "Brett, B., MIT student arrested at Logan in bomb scare. The Boston Globe. 209.9 from http://www.boston.com/news/globe/city_region/breaking_news/2007/09/mit_student_arr.html.",
      "doi": ""
    },
    {
      "text": "Buxton, W. 1986. Chunking and phrasing and the design of human-computer dialogues, IFIP WCG, 475--480.",
      "doi": ""
    },
    {
      "text": "Camurri, A., Mazzarino, B., Ricchetti, M., Timmers, R. Volpe, G. 2004. Multimodal analysis of expressive gesture in music and dance performances. Gest.-based. Com. in Hum. -Comp. Int. vol. 2915. 357--358",
      "doi": ""
    },
    {
      "text": "Conseil, S. Bourennane, S., Martin, L. 2007 Comparison of Fourier Descriptors and Hu Moments for Hand Posture Recognition. EUSIPCO'07.",
      "doi": ""
    },
    {
      "text": "Fitzpatrick, P. and Kemp C. C. 2003. Shoes as a Platform for Vision. IEE ISWC '03. 231--233. ",
      "doi": "10.5555/946249.946902"
    },
    {
      "text": "Foxlin, E. M. 2002. Generalized architecture for simultaneous localization, auto-calibration, & map-building. IEEE/RJS. Vol.1. 527--533.",
      "doi": ""
    },
    {
      "text": "Guernsey, L., At Airport Gate, a Cyborg Unplugged. In The New York Times. As of 2011.9.9, from http://www.nytimes.com /2002/03/14/technology/circuits/14MANN.html.",
      "doi": ""
    },
    {
      "text": "Gustafson, S., Bierwirth, D. Baudisch, P. 2010. Imaginary interfaces: spatial interaction with empty hands and without visual feedback. ACM UIST'10, 3--12.  ",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Harrison, C. and Hudson, S.E. 2009 Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. ACM UIST'09, 121--124.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Harrison, C. Tan, D., Morris, D. 2010. Skinput: appropriating the body as an input surface. ACM CHI '10, 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Healey, J., Picard, R. 1998. Startlecam: A cybernetic wearable camera, Tech. Rep. 468, October 1998.",
      "doi": ""
    },
    {
      "text": "Hedge, A., Anthropometry and Workspace Design, in DEA 325/651. 2002, Cornell.",
      "doi": ""
    },
    {
      "text": "Hendry J, 1984. Shoes: the early learning of an important distinction in Japanese society, Europe Interprets Japan, 215--222",
      "doi": ""
    },
    {
      "text": "Higuchi, H. and Nojima, T. 2010 Shoe-shaped i/o interface. ACM UIST '10. 423--424.  ",
      "doi": "10.1145/1866218.1866252"
    },
    {
      "text": "Hinckley, K. 2007. Input technologies and techniques. Chapter 9. In The human-computer interaction handbook, 2nd edition.",
      "doi": ""
    },
    {
      "text": "Hudson S., Harrison, C, Harrison, B., LaMarca, A. 2010. Whack gestures: inexact and inattentive interaction with mobile devices. ACM TEI '10. 109--112.  ",
      "doi": "10.1145/1709886.1709906"
    },
    {
      "text": "ISO/DIS 9241--9. 2000. Ergonomic requirements for office work with visual display terminals (VDTs) - Part 9. ISO.",
      "doi": ""
    },
    {
      "text": "Kratz, S. Rohs, M. 2009. Hoverflow: exploring around-device interaction with IR distance sensors. ACM MobileHCI'09. 1--4.  ",
      "doi": "10.1145/1613858.1613912"
    },
    {
      "text": "Krupenkin, T., Taylor, J. 2011. Reverse electrowetting as a new approach to high-power energy harvesting. Nat. Commun. 2:448",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G., Buxton, W. 1991. Issues in combining marking and direct manipulation techniques. ACM UIST'91, 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Kymissis, J., Kendall, C., Paradiso, J., Gershenfeld, N. 1998. Parasitic Power Harvesting in Shoes. ISWC'98, 132--139. ",
      "doi": "10.5555/857199.858024"
    },
    {
      "text": "Lepinski, G. J., Grossman, T., Fitzmaurice, G. 2010. The design and evaluation of multitouch marking menus. ACM CHI'10. 2233--2242.  ",
      "doi": "10.1145/1753326.1753663"
    },
    {
      "text": "Loclair, C., Gustafson, S., Baudisch, P. 2010. PinchWatch: A Wearable Device for One-Handed Microinteractions, ACM MobileHCI'10 workshop on Ensembles of on-body devices.",
      "doi": ""
    },
    {
      "text": "Mann, S. 1995. Privacy Issues of Wearable Cameras Versus Surveillance Cameras. Newsweek, 86(11), 21--22.",
      "doi": ""
    },
    {
      "text": "Mayol, W., Tordoff, B., Murray, D. 2000. Towards wearable active vision platforms. Trans. Syst. Man. Cyber. V. 3, (Oct. 2000), 1627--1632.",
      "doi": ""
    },
    {
      "text": "Mayol, W., Tordoff, B., Murray, D. 2009. On the choice and placement of wearable vision sensors. Trans. Sys. Man Cyber. 39, 2. 414--425.  ",
      "doi": "10.1109/TSMCA.2008.2010848"
    },
    {
      "text": "Mistry, P., Maes, P., Chang, L. 2009. WUW-wear Ur world: a wearable gestural interface. ACM CHI EA '09. 4111--4116.  ",
      "doi": "10.1145/1520340.1520626"
    },
    {
      "text": "NASA TLX, NASA Ames Research Center, Moffet Field, California, 1988.",
      "doi": ""
    },
    {
      "text": "Ni, T., Baudisch, P. 2009. Disappearing mobile devices. ACM UIST '09. 101--110  ",
      "doi": "10.1145/1622176.1622197"
    },
    {
      "text": "Paradiso, J. and Hu, E. 1997. Expressive Footwear for Computer-Augmented Dance Performance. IEEE ISWC '97, 13--14. ",
      "doi": "10.5555/851036.856436"
    },
    {
      "text": "Pierce, J., Mahaney, H. 2004 Opportunistic Annexing for Handheld Devices: Opportunities and Challenges. HCIC04.",
      "doi": ""
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G., Barrilot, E. 2000. Control menus: execution and control in a single interactor. ACM CHI EA'00, 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Rico, J. and Brewster S. 2010. Usable gestures for mobile interfaces: evaluating social acceptability. ACM CHI '10, 887--896.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Ruiz, J., Li, Y., Lank, E. 2011. User-defined motion gestures for mobile interaction. ACM CHI '11, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Schiele B. and Pentland, A. 1999. Attentional objects for visual context understanding. Tech. Rep. 500, MIT media Lab, 1999.",
      "doi": ""
    },
    {
      "text": "Shiratori, T., Park, H. S., Sigal, L., Sheikh, Y., Hodgins, J. K. 2011. Motion Capture from-Mounted Cameras. SIGGRAPH. 10 pages.  ",
      "doi": "10.1145/1964921.1964926"
    },
    {
      "text": "Siek, Roger, Y., Connelly, K. 2005. Fat finger worries: How older and younger users physically interact with PDAs. INTERACT'05. 267--280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Starner, T. 1996. Human-powered wearable computing. IBM Syst. J. 35, 3--4 (September 1996), 618--629.  ",
      "doi": "10.1147/sj.353.0618"
    },
    {
      "text": "Starner, T., Wearer, J., Pentland, A. 1998. Real-Time American Sign Language Recognition Using Desk and Wearable Computer Based Video. IEEE Trans. Pat. Anal. Mach. Intell. 20, 12 (Dec. 98), 1371--1375.  ",
      "doi": "10.1109/34.735811"
    },
    {
      "text": "Starner, T., Auxier, J., Ashbrook, D., Gandy, M.2000. The Gesture Pendant: A Self-illuminating, Wearable, Infrared Computer Vision System for Home Automation Control and Medical Monitoring. IEEE ISWC '00, 87--94. ",
      "doi": "10.5555/851037.856538"
    },
    {
      "text": "Trigo, T. Pellegrino, S. 2010 An Analysis of Features for Hand-Gesture Classification. IWSSIP'10. 412--415",
      "doi": ""
    },
    {
      "text": "Vardy, A., Robinson, J., Cheng, L. 1999. The WristCam as Input Device. IEEE ISWC '99, 199--202. ",
      "doi": "10.5555/519309.856464"
    },
    {
      "text": "Wilson, A. D. 2006. Robust computer vision-based detection of pinching for one and two-handed gesture input. ACM UIST'06, 255--258.  ",
      "doi": "10.1145/1166253.1166292"
    },
    {
      "text": "Wobbrock, J., Morris, M., Wilson, A. 2009. User-defined gestures for surface computing. ACM CHI '09, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wu, M., Shen, C., Ryall, K., Forlines, C., Balakrishnan, R. 2006. Gesture registration, relaxation, and reuse for multi-point direct-touch surfaces. IEEE TableTop'06. p. 183.190.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    }
  ]
}