{
  "doi": "10.1145/2207676.2208375",
  "title": "Looking at you: fused gyro and face tracking for viewing large imagery on mobile devices",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2211-2220",
  "year": 2012,
  "badges": [],
  "abstract": "We present a touch-free interface for viewing large imagery on mobile devices. In particular, we focus on viewing paradigms for 360 degree panoramas, parallax image sequences, and long multi-perspective panoramas. We describe a sensor fusion methodology that combines face tracking using a front-facing camera with gyroscope data to produce a robust signal that defines the viewer's 3D position relative to the display. The gyroscopic data provides both low-latency feedback and allows extrapolation of the face position beyond the the field-of-view of the front-facing camera. We also demonstrate a hybrid position and rate control that uses the viewer's 3D position to drive exploration of very large image spaces. We report on the efficacy of the hybrid control vs. position only control through a user study.",
  "authors": [
    {
      "name": "Neel Joshi",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81330493210",
      "orcid": "missing"
    },
    {
      "name": "Abhishek Kar",
      "institution": "IIT Kanpur, Kanpur, Uttar Pradesh, India & Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660487621",
      "orcid": "missing"
    },
    {
      "name": "Michael Cohen",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406592138",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Casiez, G., Vogel, D., Pan, Q., and Chaillou, C. Rubberedge: reducing clutching by combining position and rate control with elastic feedback. In Proceedings of the 20th annual ACM symposium on User interface software and technology, UIST '07, ACM (New York, NY, USA, 2007), 129--138.  ",
      "doi": "10.1145/1294211.1294234"
    },
    {
      "text": "Eriksson, E., Hansen, T. R., and Lykke-Olesen, A. Movement-based interaction in camera spaces: a conceptual framework. Personal Ubiquitous Comput. 11 (December 2007), 621--632.  ",
      "doi": "10.1007/s00779-006-0134-z"
    },
    {
      "text": "Hannuksela, J., Sangi, P., Turtinen, M., and Heikkilä, J. Face tracking for spatially aware mobile user interfaces. In Proceedings of the 3rd international conference on Image and Signal Processing, ICISP '08, Springer-Verlag (Berlin, Heidelberg, 2008), 405--412.  ",
      "doi": "10.1007/978-3-540-69905-7_46"
    },
    {
      "text": "Hansen, T. R., Eriksson, E., and Lykke-Olesen, A. Use your head: exploring face tracking for mobile interaction. In CHI '06 extended abstracts on Human factors in computing systems, CHI EA '06, ACM (New York, NY, USA, 2006), 845--850.  ",
      "doi": "10.1145/1125451.1125617"
    },
    {
      "text": "Hinckley, K. Input technologies and techniques. In The Human-Computer Iteraction Handbook, A. Sears and J. A. Jacko, Eds. Addison Wesley, 2008, 161--176.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Cutrell, E., Bathiche, S., and Muss, T. Quantitative analysis of scrolling techniques. In Proceedings of the SIGCHI conference on Human factors in computing systems: Changing our world, changing ourselves, CHI '02, ACM (New York, NY, USA, 2002), 65--72.  ",
      "doi": "10.1145/503376.503389"
    },
    {
      "text": "Hua, G., Yang, T.-Y., and Vasireddy, S. Peye: toward a visual motion based perceptual interface for mobile devices. In Proceedings of the 2007 IEEE international conference on Human-computer interaction, HCI'07, Springer-Verlag (Berlin, Heidelberg, 2007), 39--48. ",
      "doi": "10.1007/978-3-540-75773-3_5"
    },
    {
      "text": "Igarashi, T., and Hinckley, K. Speed-dependent automatic zooming for browsing large documents. In Proceedings of the 13th annual ACM symposium on User interface software and technology, UIST '00, ACM (New York, NY, USA, 2000), 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Ishak, E. W., and Feiner, S. K. Content-aware scrolling. In Proceedings of the 19th annual ACM symposium on User interface software and technology, UIST '06, ACM (New York, NY, USA, 2006), 155--158.  ",
      "doi": "10.1145/1166253.1166277"
    },
    {
      "text": "Karlson, A. K., and Bederson, B. B. Understanding single-handed mobile device interaction. Tech. rep., HCIL-2006-02, 2006.",
      "doi": ""
    },
    {
      "text": "Karlson, A. K., Bederson, B. B., and Contreras-Vidal, J. L. Understanding One-Handed Use of Mobile Devices. In Handbook of Research on User Interface Design and Evaluation for Mobile Technology, J. Lumsden, Ed. Information Science Reference, 2008, ch. VI, 86--101.",
      "doi": ""
    },
    {
      "text": "Kopf, J., Chen, B., Szeliski, R., and Cohen, M. Street slide: browsing street level imagery. ACM Trans. Graph. 29 (July 2010), 96:1--96:8.  ",
      "doi": "10.1145/1778765.1778833"
    },
    {
      "text": "Kumar, M., and Winograd, T. Gaze-enhanced scrolling techniques. In Proceedings of the 20th annual ACM symposium on User interface software and technology, UIST '07, ACM (New York, NY, USA, 2007), 213--216.  ",
      "doi": "10.1145/1294211.1294249"
    },
    {
      "text": "Olwal, A., Feiner, S., and Heyman, S. Rubbing and tapping for precise and rapid selection on touch-screen displays. In Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, CHI '08, ACM (New York, NY, USA, 2008), 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Premerlani, W., and Bizard, P. Direction cosine matrix imu: Theory. http://gentlenav.googlecode.com/files/DCMDraft2.pdf.",
      "doi": ""
    },
    {
      "text": "Roudaut, A., Huot, S., and Lecolinet, E. Taptap and magstick: improving one-handed target acquisition on small touch-screens. In Proceedings of the working conference on Advanced visual interfaces, AVI '08, ACM (New York, NY, USA, 2008), 146--153.  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Roudaut, A., Lecolinet, E., and Guiard, Y. Microrolls: expanding touch-screen input vocabulary by distinguishing rolls vs. slides of the thumb. In Proceedings of the 27th international conference on Human factors in computing systems, CHI '09, ACM (New York, NY, USA, 2009), 927--936.  ",
      "doi": "10.1145/1518701.1518843"
    },
    {
      "text": "Smith, G. M., and Schraefel, M. C. The radial scroll tool: scrolling support for stylus- or touch-based document navigation. In Proceedings of the 17th annual ACM symposium on User interface software and technology, UIST '04, ACM (New York, NY, USA, 2004), 53--56.  ",
      "doi": "10.1145/1029632.1029641"
    },
    {
      "text": "Tsang, M., Fitzmzurice, G. W., Kurtenbach, G., Khan, A., and Buxton, B. Boom chameleon: simultaneous capture of 3d viewpoint, voice and gesture annotations on a spatially-aware display. ACM Trans. Graph. 22 (July 2003), 698--698.  ",
      "doi": "10.1145/882262.882329"
    },
    {
      "text": "Viola, P., and Jones, M. J. Robust real-time face detection. Int. J. Comput. Vision 57 (May 2004), 137--154.  ",
      "doi": "10.1023/B%3AVISI.0000013087.49260.fb"
    },
    {
      "text": "Zheng, K. C., Colburn, A., Agarwala, A., Agrawala, M., Salesin, D., Curless, B., and Cohen, M. F. Parallax photography: creating 3d cinematic effects from stills. In Proceedings of Graphics Interface 2009, GI '09, Canadian Information Processing Society (Toronto, Ont., Canada, Canada, 2009), 111--118. ",
      "doi": "10.5555/1555880.1555909"
    }
  ]
}