{
  "doi": "10.1145/2207676.2208311",
  "title": "The search dashboard: how reflection and comparison impact search behavior",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1785-1794",
  "year": 2012,
  "badges": [],
  "abstract": "Most searchers do not know how to use Web search engines as effectively as possible. This is due, in part, to search engines not providing feedback about how search behavior can be improved. Because feedback is an essential part of learning, we created the Search Dashboard, which provides an interface for reflection on personal search behavior. The Dashboard aggregates and presents an individual's search history and provides comparisons with that of archetypal expert profiles. Via a five-week study of 90 Search Dash-board users, we find that users are able to change aspects of their behavior to be more in line with that of the presented expert searchers. We also find that reflection can be beneficial, even without comparison, by changing participants' views about their own search skills, what is possible with search, and what aspects of their behavior may influence search success. Our findings demonstrate a new way for search engines to help users modify their search behavior for positive outcomes.",
  "tags": [
    "social feedback",
    "search expertise",
    "reflection",
    "web search"
  ],
  "authors": [
    {
      "name": "Scott Bateman",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361599570",
      "orcid": "0000-0003-3592-2163"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Ryen W. White",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100617179/rel-imgonly/ryenw_headshot_dec2021.jpg",
      "acmid": "81100617179",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aula, A., Khan, R.M. & Guan, Z. How does search behavior change as search becomes more difficult? Proc. CHI, 2010, 35--44.  ",
      "doi": "10.1145/1753326.1753333"
    },
    {
      "text": "Aula, A. & Nordhausen, K. Modeling successful performance in web searching. JASIST 57, 12 (2006), 1678--1693.  ",
      "doi": "10.5555/1165013.1165020"
    },
    {
      "text": "Aula, A., Jhaveri, N. & Kaki, M. Information search and re-access strategies of experienced Web users. Proc. WWW, 583--592.  ",
      "doi": "10.1145/1060745.1060831"
    },
    {
      "text": "Bandura, A. Social Foundations of Thought and Action: A Social Cognitive Theory. Englewood Cliffs, NJ, US: Prentice-Hall, 1986.",
      "doi": ""
    },
    {
      "text": "Bennett, P., Svore, K. & Dumais, S. Classificationenhanced ranking. Proc. WWW, 2010, 111--120.  ",
      "doi": "10.1145/1772690.1772703"
    },
    {
      "text": "Brand-Gruwel, S., Wopereis, I. & Vermetten, Y. Information problem solving by experts and novices: Analysis of a complex cognitive skill. Computers in Human Behavior, 21, (2005), 487--508.  ",
      "doi": "10.1016/j.chb.2004.10.005"
    },
    {
      "text": "Boud, D., Keogh, R. & Walker, D. Reflection: Turning Experience into Learning. Routledge, 1985.",
      "doi": ""
    },
    {
      "text": "Collins, A., Brown, J.S. & Newman, S.E. Cognitive apprenticeship: Teaching the craft of reading, writing and mathematics. Knowing, Learning and Instruction 8, 1 (1989), 453--494.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., McDonald, D. & Landay, J. Theory-driven design strategies for technologies that support behavior change in everyday life. Proc. CHI, 2009, 405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Dou, Z., Song, R. & Wen, J. A large-scale evaluation and analysis of personalized search strategies. Proc. WWW, 2007, 581--590.  ",
      "doi": "10.1145/1242572.1242651"
    },
    {
      "text": "Evans, B. M. & Chi, E.H. An elaborated model of social search. IP&M, 46, 6 (2010), 656--678.  ",
      "doi": "10.1016/j.ipm.2009.10.012"
    },
    {
      "text": "Fogg, B.J. Motivating, influencing, and persuading users. In The human-computer interaction handbook, Julie A. Jacko and Andrew Sears (Eds.). L., (2002), 358--370. ",
      "doi": "10.5555/772072.772096"
    },
    {
      "text": "Froehlich, J., Findlater, L. & Landay, J. The design of eco-feedback technology. Proc. CHI, 2010, 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Hölscher, C. & Strube, G. Web search behavior of Internet experts and newbies. Computer Networks 33, (2000), 337--346.  ",
      "doi": "10.1016/S1389-1286%2800%2900031-1"
    },
    {
      "text": "Khan, K. & Locatis, C. Searching through the cyberspace: the effects of link display and link density on information retrieval from hypertext on the World Wide Web. JASIST, 49, 2 (1998), 176--182.  ",
      "doi": "10.5555/274093.274102"
    },
    {
      "text": "Kodagoda, N. & Wong, B.L.W. Effects of low and high literacy on user performance in information search and retrieval. Proc. BCS-HCI, 2008, 173--181. ",
      "doi": "10.5555/1531514.1531538"
    },
    {
      "text": "Lazonder, A.W., Biemans, H.J.A. & Worpeis, I.G.J.H. Differences between novice and experienced users in searching information on the World Wide Web. JASIST 51, 6 (2000), 576--581.  ",
      "doi": "10.5555/358242.358267"
    },
    {
      "text": "Li, I., Forlizzi, J. & Dey, A. Know thyself: monitoring and reflecting on facets of one's life. Proc. CHI EA, 2010, 4489--4492.  ",
      "doi": "10.1145/1753846.1754181"
    },
    {
      "text": "Moraveji, N., Morris, M.R., Morris, D., Czerwinski, M. & Riche, N. ClassSearch: Facilitating the development of web search skills through social learning. Proc. CHI, 2011, 1797--1806.  ",
      "doi": "10.1145/1978942.1979203"
    },
    {
      "text": "Moraveji, N., Russell, D., Bien, J. & Mease, D. Measuring improvement in user search performance resulting from optimal search tips. Proc. SIGIR, 2011, 355--363.  ",
      "doi": "10.1145/2009916.2009966"
    },
    {
      "text": "Morris, D., Morris, M.R. & Venolia, G. SearchBar: a search-centric web history for task resumption and information re-finding. Proc. CHI, 2008, 1207--1216.  ",
      "doi": "10.1145/1357054.1357242"
    },
    {
      "text": "Nielsen, J. Incompetent research skills curb users' problem solving. Alertbox. April 11, 2011. (available at: http://www.useit.com/alertbox/search-skills.html)",
      "doi": ""
    },
    {
      "text": "Saito, H. & Miwa, K. A cognitive study of information seeking processes in the WWW: Effects of searcher's knowledge and experience. Proc. WISE, 2001, 321--333. ",
      "doi": "10.5555/882513.885476"
    },
    {
      "text": "Sparck-Jones, K. A statistical interpretation of term specificity and its application in retrieval. Journal of Documentation 28, 1 (1972), 11--21.",
      "doi": ""
    },
    {
      "text": "Thaler, R.H. & Sunstein, C.R. Nudge: improving decisions about health, wealth, and happiness. Yale, 2008.",
      "doi": ""
    },
    {
      "text": "Van Kleek, M., Moore, B., Xu, C., & Karger, D.R. Eyebrowse: Real-time web activity sharing and visualization. Proc. CHI EA, 2010, 3643--3648.  ",
      "doi": "10.1145/1753846.1754032"
    },
    {
      "text": "White, R.W. and Morris, D. Investigating the querying and browsing behavior of advanced search engine users. Proc. SIGIR, 2007, 255--262.  ",
      "doi": "10.1145/1277741.1277787"
    },
    {
      "text": "White, R.W., Bilenko, M., and Cucerzan, S. Studying the use of popular destinations to enhance web search Interaction. Proc. of SIGIR, 2007, 159--166.  ",
      "doi": "10.1145/1277741.1277771"
    },
    {
      "text": "White, R.W., Dumais, S., and Teevan, J. Characterizing the influence of domain expertise on web search behavior. Proc. WSDM, 2009, 132--141.  ",
      "doi": "10.1145/1498759.1498819"
    }
  ]
}