{
  "doi": "10.1145/2207676.2207735",
  "title": "The user as a sensor: navigating users with visual impairments in indoor spaces using tactile landmarks",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "425-432",
  "year": 2012,
  "badges": [],
  "abstract": "Indoor navigation systems for users who are visually impaired typically rely upon expensive physical augmentation of the environment or expensive sensing equipment; consequently few systems have been implemented. We present an indoor navigation system called Navatar that allows for localization and navigation by exploiting the physical characteristics of indoor environments, taking advantage of the unique sensing abilities of users with visual impairments, and minimalistic sensing achievable with low cost accelerometers available in smartphones. Particle filters are used to estimate the user's location based on the accelerometer data as well as the user confirming the presence of anticipated tactile landmarks along the provided path. Navatar has a high possibility of large-scale deployment, as it only requires an annotated virtual representation of an indoor environment. A user study with six blind users determines the accuracy of the approach, collects qualitative experiences and identifies areas for improvement.",
  "authors": [
    {
      "name": "Navid Fallah",
      "institution": "University of Nevada, Reno, Reno, Nevada, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456625118",
      "orcid": "missing"
    },
    {
      "name": "Ilias Apostolopoulos",
      "institution": "University of Nevada, Reno, Reno, Nevada, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502810783",
      "orcid": "missing"
    },
    {
      "name": "Kostas Bekris",
      "institution": "University of Nevada, Reno, Reno, Nevada, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100299463",
      "orcid": "missing"
    },
    {
      "name": "Eelke Folmer",
      "institution": "University of Nevada, Reno, Reno, Nevada, United States",
      "img": "/do/10.1145/contrib-81377590840/rel-imgonly/folmer.png",
      "acmid": "81377590840",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "National university of singapore library, http://nuslibrary.appspot.com/, last accessed: 12/29/2011.",
      "doi": ""
    },
    {
      "text": "A new frontier for google maps: mapping the indoors, http://googleblog.blogspot.com/2011/11/new-frontier-for-google-maps-mapping.html, last accessed: 12/28/2011.",
      "doi": ""
    },
    {
      "text": "Amemiya, T., Yamashita, J., Hirota, K., and Hirose, M. Virtual leading blocks for the deaf-blind: A real-time wayfinder by verbal-nonverbal hybrid interface and high-density rfid tag space. In Proc. of the IEEE Virtual Reality (Washington, DC, USA, 2004).  ",
      "doi": "10.5555/1009389.1010385"
    },
    {
      "text": "Apostolopoulos, E., Fallah, N., Folmer, E., and Bekris, K. E. Feasibility of interactive localization and navigation of people with visual impairments. In 11th IEEE Intelligent Autonomous Systems (IAS-10) (Ottawa, CA, August 2010).",
      "doi": ""
    },
    {
      "text": "Apostolopoulos, E., Fallah, N., Folmer, E., and Bekris, K. E. Integrated localization and navigation of people with visual impairments. In IEEE Int. Conf. on Robotics and Automation (ICRA12) (Minnesota, May 2012).",
      "doi": ""
    },
    {
      "text": "B. Tsuji, G. Lindgaard, A. P. Landmarks for navigators who are visually impaired. In Proceedings International Cartography Conference (2005).",
      "doi": ""
    },
    {
      "text": "Bessho, M., Kobayashi, S., Koshizuka, N., and Sakamura, K. Assisting mobility of the disabled using space-identifying ubiquitous infrastructure. In Proc. of the 10th Int. ACM SIGACCESS Conf. on Computers and Accessibility (ASSETS), ACM (Halifax, Nova Scotia, Canada, 2008), 283--284.  ",
      "doi": "10.1145/1414471.1414539"
    },
    {
      "text": "Bhattacharjee, A., Ye, A., Lisak, J., Vargas, M., and Goldreich, D. Vibrotactile masking experiments reveal accelerated somatosensory processing in congenitally blind braille readers. J Neurosci 30, 43 (Oct 2010), 14288--14298.",
      "doi": ""
    },
    {
      "text": "Foulke, E. Spatial abilities: Development and physiological foundations, New York, 1982, ch. Perception, cognition, and mobility of blind pedestrians., 55--76.",
      "doi": ""
    },
    {
      "text": "Fox, D., Burgard, W., and Thrun, S. Markov localization for mobile robots in dynamic environments. Journal of Artificial Intelligence Research (JAIR) 11 (1999), 391--427.",
      "doi": ""
    },
    {
      "text": "Giudice, N. A., Bakdash, J. Z., and Legge, G. E. Wayfinding with words: spatial learning and navigation using dynamically updated verbal descriptions. Psychol Res 71, 3 (May 2007), 347--358.",
      "doi": ""
    },
    {
      "text": "Golledge, R. Geography and the disabled: A survey with special reference to vision impaired and blind populations. Transations of the Intstitute of British Geographers 18 (1993), 63--85.",
      "doi": ""
    },
    {
      "text": "Hesch, J. A., Mirzaei, F. M., Mariottini, G. L., and Roumeliotis, S. I. A 3d pose estimator for the visually impaired. In Proc. of the IEEE/RSJ Intern. Conference on Intelligent Robots and Systems (IROS) (Oct. 11-15 2009), 2716--2723. ",
      "doi": "10.5555/1733023.1733184"
    },
    {
      "text": "Hesch, J. A., and Roumeliotis, S. I. An indoor localization aid for the visually impaired. In Proc. of the IEEE International Conference on Robotics and Automation (ICRA) (Roma, Italy, April 10-14 2007), 3545--3551.",
      "doi": ""
    },
    {
      "text": "Hollerer, T., Hallaway, D., Tinna, N., and Feiner, S. Steps toward accommodating variable position tracking accuracy in a mobile augmented reality system (2001). 31--37.",
      "doi": ""
    },
    {
      "text": "Horvat, M., Ray, C., Ramsey, V., Miszko, T., Keeney, R., and Blasch, B. Compensatory analysis and strategies for balance in individuals with visual impairments. Journal of Visual Impairment and Blindness 97, 1 (2003), 695--703.",
      "doi": ""
    },
    {
      "text": "Hub, A., Diepstraten, J., and Ertl, T. Design and development of an indoor navigation and object identification system for the blind. In Proc. of the 6th Int. ACM SIGACCESS Conf. on Computers and Accessibility (ASSETS), ACM (Atlanta, GA, USA, 2004), 147--152.  ",
      "doi": "10.1145/1028630.1028657"
    },
    {
      "text": "Jensen, B., Weingarten, J., Kolski, S., and Siegwart, R. Laser Range Imaging using Mobile Robots: From Pose Estimation to 3d-Models. In Proc. 1st Range Imaging Research Day (2005), 129--144.",
      "doi": ""
    },
    {
      "text": "Kalia, A. A., Legge, G. E., and Giudice, N. A. Learning building layouts with non-geometric visual information: the effects of visual impairment and age. Perception 37, 11 (2008), 1677--1699.",
      "doi": ""
    },
    {
      "text": "Kleeman, L. Optimal estimation of position and heading for mobile robots using ultrasonic beacons and dead-reckoning. In IEEE Int'l Conference on Robotics and Automation (1992), 2582--2587.",
      "doi": ""
    },
    {
      "text": "Koide, S., and Kato, M. 3-d human navigation system considering various transition preferences. In Systems, Man and Cybernetics, 2005 IEEE International Conference on, vol. 1 (2005), 859--864.",
      "doi": ""
    },
    {
      "text": "Kulyukin, V., Gharpure, C., Nicholson, J., and Pavithran, S. Rfid in robot-assisted indoor navigation for the visually impaired. In Proc. of the IEEE/RSJ Int. Conf. on Intelligent Robots and Systems (Sendai, Japan, Sept. 28-Oct.2 2004), 1979--1984.",
      "doi": ""
    },
    {
      "text": "Ladd, A. M., Bekris, K. E., Rudys, A., Kavraki, L. E., and Wallach, D. S. On the feasibility of using wireless ethernet for indoor localization. IEEE Transactions on Robotics and Automation 20, 3 (June 2004.), 555--559.",
      "doi": ""
    },
    {
      "text": "Ladd, A. M., Bekris, K. E., Rudys, A., Marceau, G., Kavraki, L. E., and Wallach, D. S. Robotics-based location sensing using wireless ethernet. In Eight ACM International Conference on Mobile Computing and Networking (MOBICOM 2002), ACM Press (Atlanta, GA, September 2002), 227--238.  ",
      "doi": "10.1145/570645.570674"
    },
    {
      "text": "Lahav, O., and Mioduser, D. Multisensory virtual environment for supporting blind persons acquisition of spatial cognitive mapping - a case study. In Proceedings of World Conference on Educational Multimedia, Hypermedia and Telecommunications 2001, C. Montgomerie and J. Viteli, Eds., AACE (Norfolk, VA, 2001), 1046--1051.",
      "doi": ""
    },
    {
      "text": "Loomis, J. M., Golledge, R. G., and Klatzky, R. L. Navigation system for the blind: Auditory display modes and guidance. Presence: Teleoper. Virtual Environ. 7, 2 (1998), 193--203.  ",
      "doi": "10.1162/105474698565677"
    },
    {
      "text": "Loomis, J. M., Klatzky, R. L., and Golledge, R. G. Navigating without vision: basic and applied research. Optometry and Vision Science 78, 5 (May 2001), 282--289.",
      "doi": ""
    },
    {
      "text": "Lynch, K. The Image of the city. MIT Press., Cambridge, Ma., 1960.",
      "doi": ""
    },
    {
      "text": "Nakamura, K., Aono, Y., and Tadokoro, Y. A walking navigation system for the blind. Systems and computers in Japan 28, 13 (1997), 1610--1618.",
      "doi": ""
    },
    {
      "text": "Ran, L., Helal, S., and Moore, S. Drishti: An integrated indoor/outdoor blind navigation system and service. IEEE International Conference on Pervasive Computing and Communications (March 2004), 23--30. ",
      "doi": "10.5555/977406.978696"
    },
    {
      "text": "Retscher, G. Pedestrian navigation systems and location-based services. In 3G Mobile Communication Technologies, 2004. 3G 2004. Fifth IEE International Conference on (2004), 359--363.",
      "doi": ""
    },
    {
      "text": "Riehle, T. H., Lichter, P., and Giudice, N. A. An indoor navigation system to support the visually impaired. In 30th Annual International Conference of the IEEE Conference on Engineering in Medicine and Biology Society (EMBS) (Aug. 2008), 4435--4438.",
      "doi": ""
    },
    {
      "text": "Rina, D., and Pearl, J. Generalized best-first search strategies and the optimality of a*. Journal of the ACM 32, 3 (1985), 505--536.  ",
      "doi": "10.1145/3828.3830"
    },
    {
      "text": "Ross, D. A., and Blasch, B. B. Development of a wearable computer orientation system. Personal Ubiquitous Comput. 6, 1 (2002), 49--63.  ",
      "doi": "10.1007/s007790200005"
    },
    {
      "text": "Semwal, S. K. Wayfinding and navigation in haptic virtual environments. IEEE International Conference on Multimedia and Expo (Aug 2001), 559--562.",
      "doi": ""
    },
    {
      "text": "Shoval, S., Borenstein, J., and Koren, Y. Auditory guidance with the navbelt - a computerized travel aid for the blind. IEEE Transactions on Systems, Man and Cybernetics 28, 3 (August 1998), 459--467.  ",
      "doi": "10.1109/5326.704589"
    },
    {
      "text": "Sonnenblick, Y. An indoor navigation system for blind individuals. In Proceedings of the 13th annual Conference on Technology and Persons with Disabilities (CSUN) (Northridge, Los Angeles, March 1998).",
      "doi": ""
    },
    {
      "text": "Stankiewicz, B. J., and Kalia, A. A. Acquisition of structural versus object landmark knowledge. J Exp Psychol Hum Percept Perform 33, 2 (Apr 2007), 378--90.",
      "doi": ""
    },
    {
      "text": "Tjan, B., Beckmann, P., Giudice, N., and Legge, G. Digital sign system for indoor wayfinding for the visually impaired. In Proc. of the IEEE Conf. on Computer Vision and Pattern Recognition - Workshop on Computer Vision Applications for the Visually Impaired (San Diego, CA, June 2005).  ",
      "doi": "10.1109/CVPR.2005.442"
    },
    {
      "text": "Yuan, D., and Manduchi, R. Dynamic environment exploration using a virtual white cane. In Proc. of the IEEE Conf. on Computer Vision and Pattern Recognition (San Diego, CA, June 20-25 2005), 243--249.  ",
      "doi": "10.1109/CVPR.2005.136"
    }
  ]
}