{
  "doi": "10.1145/2207676.2208356",
  "title": "Playable character: extending digital games into the real world",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2069-2078",
  "year": 2012,
  "badges": [],
  "abstract": "This paper describes a series of research probe games developed to investigate how real-world activity could be incorporated into digital game systems. These culminated in the design of our final game, Forest, which was conceived for the San Francisco non-profit Friends of the Urban Forest (FUF), who have been planting and caring for the city's street trees for 30 years. By incorporating real-world actions and behaviors into digital games, we can create experiences that both enhance our understanding of the world around us and provide incentive structures towards our personal, community, or societal goals.",
  "tags": [
    "social games",
    "location-based",
    "games",
    "forest",
    "design"
  ],
  "authors": [
    {
      "name": "Jason Linder",
      "institution": "California College of the Arts, San Francisco, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502773744",
      "orcid": "missing"
    },
    {
      "name": "Wendy Ju",
      "institution": "California College of the Arts, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81100098733/rel-imgonly/wendy_headshot.jpg",
      "acmid": "81100098733",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benford, S., Anastasi, R., Flinham, M., Drozd, A., Crabtree, A., Greenhalgh, C., Tandavanitja, N., Adams, M., and Row-farr, J. 2003. Coping with uncertainty in a location based game. IEEE Pervasive Computing (JulySept 2003), 34--41.  ",
      "doi": "10.1109/MPRV.2003.1228525"
    },
    {
      "text": "Benford, S., Magerkurth, C., and Ljungstrand, P. Bridging the physical and digital in pervasive gaming. Communications of the ACM 48, 3 (2005), 54--57.  ",
      "doi": "10.1145/1047671.1047704"
    },
    {
      "text": "Bogost, Ian. Persuasive Games: the Expressive Power of Videogames. Cambridge, MA: MIT, 2007. ",
      "doi": "10.5555/1214315"
    },
    {
      "text": "Consolvo, Sunny, David W. McDonald, and James A. Landay. \"Theory-Driven Design Strategies for Technologies That Support Behavior Change in Everyday Life.\" CHI 2009 (2009). Apr. 2009.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Deterding, S., Sicart, M., Nacke, L., O'Hara, K., and Dixon, D. Gamification: using game-design elements in non-gaming contexts. Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems, ACM (2011), 2425--2428.  ",
      "doi": "10.1145/1979742.1979575"
    },
    {
      "text": "Fogg, B. J. Persuasive Technology: Using Computers to Change What We Think and Do. Amsterdam: Morgan Kaufmann, 2003. ",
      "doi": "10.5555/2821581"
    },
    {
      "text": "Jenkins, H. Convergence Culture: Where Old and New Media Collide. (2006) New York: NYU Press.",
      "doi": ""
    },
    {
      "text": "Johnson, Steven. Emergence: the Connected Lives of Ants, Brains, Cities, and Software. New York: Scribner, 2001.",
      "doi": ""
    },
    {
      "text": "Marriott, M. The color of mayhem, in a wave of \"urban\" games. The New York Times, (2004).",
      "doi": ""
    },
    {
      "text": "McGonigal, Jane. Reality Is Broken: Why Games Make Us Better and How They Can Change the World. New York: Penguin, 2011. ",
      "doi": "10.5555/1972527"
    },
    {
      "text": "Michael, D. R. and Chen, S. L. Serious games: Games that educate, train, and inform. Muska & Lipman/Premier-Trade, 2005. ",
      "doi": "10.5555/1051239"
    },
    {
      "text": "Montola, Markus, Jaakko Stenros, and Annika Wærn. Pervasive Games: Theory and Design. Burlington, MA: Morgan Kaufmann, 2009. ",
      "doi": "10.5555/1717294"
    },
    {
      "text": "Mueller, Florian. \"Exertion Interfaces: Sports over a Distance for Social Bonding and Fun.\" Thesis. MIT, 2002.",
      "doi": ""
    },
    {
      "text": "Penenberg, Adam. \"Video Games Modifying Behavior Towards Good.\" FastCompany.com. Fast Company, 14 July 2010. Web. 10 Aug. 2010..",
      "doi": ""
    },
    {
      "text": "Schonfeld, Erick. \"SCVNGR's Secret Game Mechanics Playdeck.\" TechCrunch. 25 Aug. 2010. Web. 07 Sept. 2010. http://techcrunch.com/2010/08/25/scvngr-gamemechanics/.",
      "doi": ""
    },
    {
      "text": "SimCity. Maxis, 1989. Computer software.",
      "doi": ""
    },
    {
      "text": "Suits, B. What Is a Game? Philosophy of Science 34, 2 (1967), 148--156.",
      "doi": ""
    },
    {
      "text": "Tierny, John. \"On a Hunt for What Makes Gamers Keep Gaming.\" Nytimes.com. New York Times, 6 Dec. 2010. Web.",
      "doi": ""
    }
  ]
}