{
  "doi": "10.1145/2207676.2207682",
  "title": "\"Then click ok!\": extracting references to interface elements in online documentation",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "35-38",
  "year": 2012,
  "badges": [],
  "abstract": "This paper presents a recognizer for identifying references to user interface components in online documentation. The recognizer first extracts phrases matching a list of known components, then employs a classifier to reject coincidental matches. We describe why this seemingly straightforward problem is challenging, then show how informal conventions in documentation writing can be leveraged to perform classification. Using the features identified in this paper, our approach achieves an average F1 score of 0.81, and can correctly distinguish between actual command references and coincidental matches in 93.7% of test cases.",
  "authors": [
    {
      "name": "Adam Fourney",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/do/10.1145/contrib-81330490871/rel-imgonly/adamfo.png",
      "acmid": "81330490871",
      "orcid": "missing"
    },
    {
      "name": "Ben Lafreniere",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363599874",
      "orcid": "missing"
    },
    {
      "name": "Richard Mann",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013462",
      "orcid": "missing"
    },
    {
      "name": "Michael Terry",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100295906",
      "orcid": "0000-0003-1941-939X"
    }
  ],
  "references": [
    {
      "text": "M. Ekstrand, W. Li, T. Grossman, J. Matejka, and G. Fitzmaurice. Searching for software learning resources using application context. In Proc. UIST'11, pages 195--204, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/2047196.2047220"
    },
    {
      "text": "J. R. Finkel, T. Grenager, and C. Manning. Incorporating non-local information into information extraction systems by gibbs sampling. In Proc. ACL'05, pages 363--370, Stroudsburg, PA, USA, 2005. Association for Computational Linguistics  ",
      "doi": "10.3115/1219840.1219885"
    },
    {
      "text": "A. Fourney, R. Mann, and M. Terry. Query-feature graphs: bridging user vocabulary and system functionality. In Proc. UIST'11, pages 207--216, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/2047196.2047224"
    },
    {
      "text": "T. Lau, C. Drews, and J. Nichols. Interpreting written how-to instructions. In Proc. IJCAI'09, pages 1433--1438, 2009. ",
      "doi": "10.5555/1661445.1661675"
    },
    {
      "text": "G. Little and R. C. Miller. Translating keyword commands into executable code. In Proc. UIST'06, pages 135--144, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1166253.1166275"
    },
    {
      "text": "V. Ramesh, C. Hsu, M. Agrawala, and B. Hartmann. Showmehow: translating user interface instructions between applications. In Proc. UIST'11, pages 127--134, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/2047196.2047212"
    },
    {
      "text": "S. Russell and P. Norvig. Artificial Intelligence A Modern Approach, chapter 20, page 718. Prentice Hall, 2nd edition, 2003. ",
      "doi": "10.5555/773294"
    },
    {
      "text": "T. Weninger and W. H. Hsu. Text extraction from the web via text-to-tag ratio. Database and Expert Systems Applications, International Workshop on, 0:23--28, 2008.  ",
      "doi": "10.1109/DEXA.2008.12"
    },
    {
      "text": "I. Witten and T. Bell. The zero-frequency problem: estimating the probabilities of novel events in adaptive text compression. Information Theory, IEEE Transactions on, 37(4):1085--1094, July 1991.  ",
      "doi": "10.1109/18.87000"
    }
  ]
}