{
  "doi": "10.1145/2207676.2208282",
  "title": "Drawing the city: differing perceptions of the urban environment",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1603-1606",
  "year": 2012,
  "badges": [],
  "abstract": "In building location-based services, it is important to present information in ways that fit with how individuals view and navigate the city. We conducted an adaptation of the 1970s Mental Maps study by Stanley Milgram in order to better understand differences in people's views of the city based on their backgrounds and technology use. We correlated data from a demographic questionnaire with the map data from our participants to perform a first-of-its-kind statistical analysis on differences in hand-drawn city maps. We describe our study, findings, and design implications for location-based services.",
  "authors": [
    {
      "name": "Frank Bentley",
      "institution": "Motorola Mobility, Libertyville, Illinois, United States",
      "img": "/do/10.1145/contrib-81311482466/rel-imgonly/me.jpg",
      "acmid": "81311482466",
      "orcid": "missing"
    },
    {
      "name": "Henriette Cramer",
      "institution": "Mobile Life Centre at SICS, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487965",
      "orcid": "missing"
    },
    {
      "name": "William Hamilton",
      "institution": "Texas A&M University, College Station, Texas, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430595127",
      "orcid": "missing"
    },
    {
      "name": "Santosh Basapur",
      "institution": "Motorola Mobility, Libertyville, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611903",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bilandzic, M., & Foth, M. (2011) A Review of Locative Media, Mobile and Embodied Spatial Interaction. Int Journal of Human-Computer Studies, 69 (10).  ",
      "doi": "10.1016/S1071-5819%2811%2900107-8"
    },
    {
      "text": "Church, K., Neumann, J., Cherubini, M., Oliver. N.: The \"Map Trap\"?: an evaluation of map versus text-based interfaces for location-based mobile search services. WWW 2010: 261--270.  ",
      "doi": "10.1145/1772690.1772718"
    },
    {
      "text": "Cramer, H., Rost, M., Holmquist, L. (2011) Performing a Check-in: Emerging Practices, Norms and 'Conflicts' in Location-Sharing Using Foursquare. Proc. MobileHCI'11.  ",
      "doi": "10.1145/2037373.2037384"
    },
    {
      "text": "Fitzgerald, P. 2007. Map of violent crimes in 2006 in Chicago community areas per 100,000 residents. http://en.wikipedia.org/wiki/File:Chicago_violent_crime_map_2006.png. Accessed 9/6/11.",
      "doi": ""
    },
    {
      "text": "Foth, M. (Ed.) (2009). Handbook of Research on Urban Informatics: The Practice and Promise of the Real-Time City. Hershey, PA. ",
      "doi": "10.5555/1522476"
    },
    {
      "text": "Kuznetsov, S., Paulos E. Participatory Sensing in Public Spaces: Activating Urban Surfaces with Sensor Probes, DIS 2010, Aarhus, Denmark.  ",
      "doi": "10.1145/1858171.1858175"
    },
    {
      "text": "Lindqvist, J., Cranshaw, J., Wiese, J., Hong, J., and Zimmerman, J. 2011. I'm the mayor of my house: examining why people use foursquare - a social-driven location sharing application. Proc CHI '11.  ",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "Lynch, K. The Image of the City. Cambridge: M.I.T. Press, 1960.",
      "doi": ""
    },
    {
      "text": "Milgram, S. Psychological Maps of Paris, in: Environmental Psychology: People and Their Physical Settings, 2nd ed. Holt, Rinehart and Winston, New York, USA, 1976, pp. 104--124.",
      "doi": ""
    },
    {
      "text": "Moss and A. Townsend, \"How Telecommunication Systems are Transforming Urban Spaces,\" in Fractured Geographies: Cities in the Telecommunications Age, J. Wheeler and Y. Aoyama, Eds. New York: Routledge, 1999.",
      "doi": ""
    },
    {
      "text": "Paulos et al., The Familiar Stranger: Anxiety, Comfort, and Play in Public Places, Proc. CHI'04.  ",
      "doi": "10.1145/985692.985721"
    },
    {
      "text": "Taylor, H. and B. Tversky. Descriptions and depictions of environments. Memory and Cognition, (20):483--496, 1992.",
      "doi": ""
    },
    {
      "text": "The World Bank. Urban Development Data. http://data.worldbank.org/topic/urban-development Accessed 9/6/11.",
      "doi": ""
    }
  ]
}