{
  "doi": "10.1145/2207676.2208651",
  "title": "Supporting face-to-face communication between clinicians and children with chronic headaches through a zoomable multi-touch app",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2609-2618",
  "year": 2012,
  "badges": [],
  "abstract": "Chronic headaches are one of the top five health problems for young children in the United States, negatively affecting their quality of life and learning opportunities. A clear understanding of children's headache characteristics is crucial for delivering appropriate treatment. However, current data collection methods were designed for adults often resulting in insufficient information. In this paper we present a novel method to help children communicate with health care providers and researchers about their headaches. It augments an existing child-centric method called Draw-and-Tell Conversation, which has already been shown to provide more actionable information from children than standard data collection methods. It does so by enabling children to draw their symptoms on a zoomable drawing application, giving them the ability to provide more details and context than on paper. We present a study conducted with nineteen children aged 7 to 12 suggesting that children provided more information about their headaches when using the zoomable drawing application than when drawing on paper. This study provides a rare example of a mobile device used to enhance face-to-face interactions and contributes evidence of a specific benefit of zoomable user interfaces.",
  "tags": [
    "draw",
    "tablets",
    "headaches",
    "zoomable user interfaces",
    "children",
    "communication",
    "mobile devices",
    "pain"
  ],
  "authors": [
    {
      "name": "Juan Pablo Hourcade",
      "institution": "University of Iowa, Iowa City, Iowa, United States",
      "img": "/do/10.1145/contrib-81100553487/rel-imgonly/jph-july-2011.jpg",
      "acmid": "81100553487",
      "orcid": "missing"
    },
    {
      "name": "Martha Driessnack",
      "institution": "University of Iowa, Iowa City, Iowa, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812074",
      "orcid": "missing"
    },
    {
      "name": "Kelsey E. Huebner",
      "institution": "University of Iowa, Iowa City, Iowa, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502720923",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrasik F. and Schwartz M.S. (2006). Behavioral assessment and treatment of pediatric headache. Behavioral Modification, 30 (1), 93--113.",
      "doi": ""
    },
    {
      "text": "Apple iPhone. (2011). http://www.apple.com/iphone/",
      "doi": ""
    },
    {
      "text": "Apple iPhoto. (2011). http://www.apple.com/iphoto/",
      "doi": ""
    },
    {
      "text": "Apple Safari. (2011). http://www.apple.com/safari/",
      "doi": ""
    },
    {
      "text": "Ayres, L., Kavanaugh, K., and Knafl, K. A. (2003). Within-case and across-case approaches to qualitative data analysis. Qualitative Health Research, 13(6), 871883.",
      "doi": ""
    },
    {
      "text": "Bederson, B. B. (2001). PhotoMesa: a zoomable image browser using quantum treemaps and bubblemaps. In Proc. of the ACM Symp. on User interface Software and Technology. UIST 2001. ACM, New York, NY, 71--80.  ",
      "doi": ""
    },
    {
      "text": "Bederson, B.B. (2009). The promise of zoomable user interfaces. University of Maryland, HCIL Tech Report 2009--21.",
      "doi": ""
    },
    {
      "text": "Bers, M.U., Ackermann, E., Cassell, J., Donegan, B., Gonzalez-Heydrich, J. DeMaso, D.R., Strohecker, C., Lualdi, S., Bromley, D. and Karlin, J. (1998). Interactive storytelling environments: coping with cardiac illness at Boston's Children's Hospital. Proceedings of the Human Factors in Computing Systems (CHI 98). ACM Press: pp. 603--610.  ",
      "doi": "10.1145/274644.274725"
    },
    {
      "text": "Bers, M.U., Gonzalez-Heydrich, J., DeMaso, D.R. (2001). Identity construction environments: supporting a virtual therapeutic community of pediatric patients undergoing dialysis. Proceedings of Human Factors in Computing Systems 2001. ACM Press: pp. 380--387.  ",
      "doi": ""
    },
    {
      "text": "Brna P.M. & Dooley J.M. (2006). Headaches in the pediatric population. Seminars in Pediatric Neurology, 13, 222--230.",
      "doi": ""
    },
    {
      "text": "Camtasia. http://www.techsmith.com/camtasia/",
      "doi": ""
    },
    {
      "text": "Chin, J. and Tsuei, M. (2009). Multi-user Narrative Sharing System for Children with Chronic Illness. Advanced Learning Technologies, 2009. ICALT 2009. pp.479--481.  ",
      "doi": ""
    },
    {
      "text": "Coad, J. (2007). Using art-based techniques in engaging children and young people in health care consultation and/or research. Journal of Research in Nursing, 12(5), 487--497.",
      "doi": ""
    },
    {
      "text": "Cvengros J.A., Harper D. & Shevell M. (2007). Pediatric headache: An examination of process variables in treatment. Journal of Child Neurology, 22 (10), 1721181.",
      "doi": ""
    },
    {
      "text": "Dahlquist, L.M., Weiss, K.E., Dillinger Clendaniel, L., Law, E.F., Sonntag Ackerman, C., and McKenna, K.D. (2009). Effects of Videogame Distraction using a Virtual Reality Type Head-Mounted Display Helmet on Cold Pressor Pain in Children. J. Pediatr. Psychol., 34(5), 574--584.",
      "doi": ""
    },
    {
      "text": "Driessnack, M. (2005). Children's drawings as facilitators of communication: A meta-analysis. Journal of Pediatric Nursing, 20(6), 414--423.",
      "doi": ""
    },
    {
      "text": "Driessnack, M. (2006).'Draw and Tell Conversations' with children about fear. Qualitative Health Research, 16(10), 1414--1435.",
      "doi": ""
    },
    {
      "text": "Driessnack, M. (2009). Using the Colored Eco-Genetic Relationship Map with children. Nursing Research, 58(5), 304--311.",
      "doi": ""
    },
    {
      "text": "Driessnack, M. and Furukawa, R. (in press). The use of participatory arts-based inquiry in child. Journal for Specialists in Pediatric Nursing.",
      "doi": ""
    },
    {
      "text": "Duffy, W.J., Karasch, M.S. and Du, H. (2010). Point of Care Documentation Impact on the Nurse-Patient Interaction. Nursing Administration Quarterly, 34(1), 110.",
      "doi": ""
    },
    {
      "text": "Dynavox (2011). Avaiable at http://www.dynavoxtech.com/",
      "doi": ""
    },
    {
      "text": "Glennen, S.L. and DeCoste, D.C. (1997). The handbook of augmentative and alternative communication. San Diego, CA: Singular Publishing Group.",
      "doi": ""
    },
    {
      "text": "Good, L. and Bederson, B. B. (2002). Zoomable user interfaces as a medium for slide show presentations. Information Visualization 1(1), 35--49.  ",
      "doi": ""
    },
    {
      "text": "Heinrich M., Morris L., & Kroner-Herwig B. (2009). Self-report of headaches in children and adolescents in Germany: Possibilities and confines of questionnaire data for headaches classification. Cephalgia, 29, 864872.",
      "doi": ""
    },
    {
      "text": "Hourcade, J.P., Bederson, B.B., Druin, A. (2004). Building KidPad: An Application for Children's Collaborative Storytelling. Software Practice and Experience, 34, 895--914.  ",
      "doi": ""
    },
    {
      "text": "Hornof, A.J. & Cavender, A. (2005). EyeDraw: enabling children with severe motor impairments to draw with their eyes. In Proceedings of CHI '05. ACM Press: 161--170.  ",
      "doi": ""
    },
    {
      "text": "Hsieh, H.F. and Shannon, S.E. (2005). Three approaches to qualitative content analysis. Qualitative Health Research, 15, 1277--1288.",
      "doi": ""
    },
    {
      "text": "Johnson R. & Spence S. (1994). Pain, affect and cognition in children: Recall bias associated with pain. Progress in Pain Research and Management, 2, 877--884.",
      "doi": ""
    },
    {
      "text": "Krueger, M.W. (1983). Artificial Reality. Reading, MA:Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Lewis D.W. (2007). Headaches in children and adolescents. Current Problems in Pediatric and Adolescent Health Care, 37, 207--246.",
      "doi": ""
    },
    {
      "text": "Malchiodi, C.A. (1998). Understanding children's drawings. New York: The Guilford Press.",
      "doi": ""
    },
    {
      "text": "Microsoft Canvas For OneNote. http://www.officelabs.com/projects/canvasforonenote/P ages/default.aspx",
      "doi": ""
    },
    {
      "text": "Microsoft pptPlex. (2011). http://www.officelabs.com/projects/pptPlex/Pages/defau lt.aspx",
      "doi": ""
    },
    {
      "text": "Perlin, K. and Fox, D. (1993). Pad: an alternative approach to the computer interface. In Proc. of the 20th Annual Conf. on Computer Graphics and interactive Techniques. SIGGRAPH 1993. ACM, New York, NY, 57--64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Pierce, T. (2009). Social anxiety and technology: Faceto-face communication versus technological communication among teens. Computers in Human Behavior, 25(6), 1367--1372.  ",
      "doi": ""
    },
    {
      "text": "Prezi. (2011). http://prezi.com/",
      "doi": ""
    },
    {
      "text": "Proloquo (2011). Available at http://www.assistiveware.com/proloquo.php",
      "doi": ""
    },
    {
      "text": "Shonkoff J.P., Boyce T. W. & McEwen B.S. (2009). Neuroscience, molecular biology, and the roots of health disparities: Building a new framework for health promotion and disease prevention. JAMA, 301(21), 2252--2259.",
      "doi": ""
    },
    {
      "text": "Stafstrom C.E., Rostasy K. & Minster A. (2002). The usefulness of children's drawings in the diagnosis of headaches. Pediatrics, 109 (3), 460--472.",
      "doi": ""
    },
    {
      "text": "Trautmann E., Lackschewitz H. & Kroner-Herwig B. (2006). Psychological treatment of recurrent headache in children and adolescents: A meta-analysis. Cephalgia, 26, 1411--1426.",
      "doi": ""
    },
    {
      "text": "van den Brink M., Bandell-Hoekstra E.N.G. & AbuSaad H.H. (2001). The occurrence of recall bias in pediatric headache: A comparison of questionnaire and diary data. The Journal of Head and Face Pain, 41 (1), 11--20.",
      "doi": ""
    },
    {
      "text": "van Twillert, B., Bremer, M., and Faber, A.W. (2007). Computer-Generated Virtual Reality to Control Pain and Anxiety in Pediatric and Adult Burn Patients During Would Dressing Changes. Journal of Burn Care & Research, 28(5), 694--702.",
      "doi": ""
    },
    {
      "text": "Weiss, P.L., Whiteley, C.P., Treviranus, J. and Fels, D.I. (2001). Pebbles: A personal technology for meeting educational, social and emotional needs of hospitalized children. Personal and Ubiquitous Computing, 5, 157--168.  ",
      "doi": ""
    }
  ]
}