{
  "doi": "10.1145/2207676.2208361",
  "title": "Adaptation as design: learning from an EMR deployment study",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2097-2106",
  "year": 2012,
  "badges": [],
  "abstract": "We conducted an observational study in an Emergency Department (ED) to examine the adaptation process after deploying an Electronic Medical Records (EMR) system. We investigated how EMR was adapted to the complex clinical work environment and how doctors and nurses engaged in the adaptation process. In this paper, we present three cases in which ED clinicians designed workarounds in order to adapt to the new work practice. Our findings reveal a rich picture of ED clinicians' active reinterpretation and modification of their work practice through their engagement with the system-in-use and its organizational and physical context. These findings call for the adaptation period in designing a socio-technical system in healthcare settings to be critically considered as an active end-user design process, a negotiating process, and a re-routinized process.",
  "authors": [
    {
      "name": "Sun Young Park",
      "institution": "University of California, Irvine, Irvine, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574568",
      "orcid": "0000-0001-8666-1800"
    },
    {
      "name": "Yunan Chen",
      "institution": "University of California Irvine, Irvine, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131427",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ash, J. S., Berg, M., Coiera, E. Some Unintended Consequences of Information Technology in Health Care: the Nature of Patient Care Information System-related Errors. J Am Med Inform Assoc, 11, (2004), 104--112.",
      "doi": ""
    },
    {
      "text": "Azad, B., King, N. Enacting Computer Workaround Practices within a Medication Dispensing System. Eur J Inform Syst. 17, 3 (2008), 264--278.",
      "doi": ""
    },
    {
      "text": "Bardram, J. E., Bossen, C. Mobility Work: The Spatial Dimension of Collaboration at a Hospital. In Proc. CSCW 2005, ACM Press (2005), 131--160.  ",
      "doi": ""
    },
    {
      "text": "Berg, M. Implementing Information Systems in Health Care Organizations: Myths and Challenges. International Journal of Medical Informatics, 64, 2-3 (2001), 143--156.",
      "doi": ""
    },
    {
      "text": "Beyer, H., Holtzblatt, K. Contextual Design: Defining Customer-centered Systems. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 1997. ",
      "doi": ""
    },
    {
      "text": "Bjorgvinsson, E., Ehn, P., Hillgren, P.A. Participatory Design and \"Democratizing Innovation\". In Proc. PDC 2011, 41--50.  ",
      "doi": ""
    },
    {
      "text": "Boulus, N., Bjorn, P. A Cross-case Analysis of Technology-in-use Practices: EPR-Adaptation in Canada and Norway. International Journal of Medical Informatics, 79, 6 (2010), e97--e108.",
      "doi": ""
    },
    {
      "text": "Carroll, J. Completing Design in Use: Closing the Appropriation Cycle, In Proc. of the ECIS 2004.",
      "doi": ""
    },
    {
      "text": "Chen, Y. Documenting Transitional Information in EMR. In Proc. CHI 2010, ACM Press (2010), 1787--1796.  ",
      "doi": ""
    },
    {
      "text": "Convertino, G., Moran, T. P., Smith, B. A. Studying Activity Patterns in CSCW. In Proc. CHI2007, ACM Press (2007), 2339--2344.  ",
      "doi": ""
    },
    {
      "text": "Embi, P. J., Yackel, T. R., Logan, J. R., Bowen, J. L., Cooney, T. G., Gorman, P. N. Impacts of Computerized Physician Documentation in a Teaching Hospital: Perceptions of Faculty and Resident Physicians. J Am Med Inform Assoc, 11 (2001), 300--309.",
      "doi": ""
    },
    {
      "text": "Cyert, R. M., March, J. G. A Behavioral Theory of the Firm. Prentice-Hall, Englewood Cliffs, NJ, USA, 1963.",
      "doi": ""
    },
    {
      "text": "Feldman, M. S. Organizational Routines as a Source of Continuous Change. Organization Science, (2000), 611--629.  ",
      "doi": ""
    },
    {
      "text": "Glaser, B. G., Strauss, A. L. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine Transaction, New York, NY, USA, 1967.",
      "doi": ""
    },
    {
      "text": "Grudin, J., Palen, L. Emerging Groupware Successes in Major Corporations: Studies of Adoption and Adaptation. Worldwide Computing and Its Applications, (1997), 142--153. ",
      "doi": ""
    },
    {
      "text": "Han, Y. Y., Carcillo, J. A., Venkataraman, S. T., Clark, R. S. B., Watson, S., Nguyen, T. C., Bayir, H., Orr, R. A. Unexpected Increased Mortality after Implementation of a Commercially Sold Computerized Physician Order Entry System. Pediatrics 116 (2005), 1506--1512.",
      "doi": "10.1542/peds.2005-1287"
    },
    {
      "text": "Heath, C., Luff, P. Documents and Professional Practice: 'Bad' Organizational Reasons for 'Good' Clinical Records. In Proc. CSCW 1996, ACM Press, 354--363.  ",
      "doi": ""
    },
    {
      "text": "Henderson, A., Kyng, M. There's no place like home: Continuing design in use. In: Greenbaum, J. and Kyng, M. (Eds.). Design at Work: Cooperative Design of Computer Systems. Lawrence Erlbaum Associates, Hillsdale, N.J, USA, 1991. ",
      "doi": ""
    },
    {
      "text": "Hersh, W. R. The Electronic Medical Record: Promises and Problems. Journal of the American Society for Information Science, 46, 10 (1999), 772--776.",
      "doi": ""
    },
    {
      "text": "Kaptelinin, V., Nardi, B. A. Acting with Technology: Activity Theory and Interaction Design. MIT Press, Cambridge, MA, USA, 2006. ",
      "doi": ""
    },
    {
      "text": "Kobayashi, M., Fussell, S. R., Xiao, Y., Seagull F. J. Work Coordination, Workflow, and Workarounds in a Medical Context. In Proc. CHI 2005, 1561--1564.  ",
      "doi": ""
    },
    {
      "text": "Koppel, R., Metlay, J. P., Cohen, A., Abaluck, B., Localio, A. R., Kimmel, S. E., Strom, B. L. Role of Computerized Physician Order Entry Systems in Facilitating Medication Errors. JAMA, 293 (2005), 1197--1203.",
      "doi": ""
    },
    {
      "text": "Koppel, R., Wetterneck, T., Telles, J. L., Karsh, B. T. Workarounds to Barcode Medication Administration Systems: Their Occurrences, Causes, and Threats to Patient Safety. J Am Med Inform Assoc, 15, 1 (2008), 408--423.",
      "doi": ""
    },
    {
      "text": "Leonard-Barton, D. Implementation as Mutual Adaptation of Technology and Organization. Research Policy, 17, 5 Elsevier (1988), 251--267.",
      "doi": ""
    },
    {
      "text": "Mwanza, D. Towards an Activity-Oriented Method for HCI Research and Practice. Unpublished doctoral dissertation, The Open University, UK, 2002.",
      "doi": ""
    },
    {
      "text": "Nardi, B. Studying Context: A Comparison of Activity Theory, Situated Action Models, and Distributed Cognition. In Context and Consciousness: Activity Theory and Human-Computer Interaction. MIT Press, Cambridge, MA, USA, 1996. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Orlikowski, W. J., Hofman, J. D. An Improvisational Model for Change Management: the Case of Groupware Technologies. Sloan management review 38, 2 (1997).",
      "doi": ""
    },
    {
      "text": "Poissant, L., Pereira, J., Tamblyn, R., Kawasumi, Y. The Impact of Electronic Health Records on Time Efficiency of Physicians and Nurses: A Systematic Review. J Am Med Inform Assoc, 12 (2005), 505--516.",
      "doi": ""
    },
    {
      "text": "Reddy, M. C., Dourish, P. A. Finger on the Pulse: Temporal Rhythms on Information Seeking in Medical Work. In Proc. CSCW 2002, ACM Press, 344--353.  ",
      "doi": ""
    },
    {
      "text": "Richardson, J., Ash, J. The Effects of Hands Free Communication Devices on Clinical Communication: Balancing Communication Access Needs with User Control. In Proc. AMIA Annual Symposium, Washington DC (2008), 621--625.",
      "doi": ""
    },
    {
      "text": "Rittel, H. Second-Generation Design Methods. In Developments in design methodology, N. Cross (ed.) John Wiley & Sons, New York, NY, USA, 1984, 317--327.",
      "doi": ""
    },
    {
      "text": "Tucker, A., Edmondson, A. Managing Routine Exceptions: a Model of Nurse Problem Solving Behavior. Advances in Health Care Management, (2002), 87--113.",
      "doi": ""
    },
    {
      "text": "Tyre, M. J., Orlikowski, W. J. Windows of Opportunity: Temporal Patterns of Technological Adaptation in Organizations. Organization Science (1994), 98--118.",
      "doi": ""
    },
    {
      "text": "Vogelsmeier, A. A., Halbesleben, J. R. B., Scott-Cawiezell, J. R. Technology Implementation and Workarounds in the Nursing Home. J Am Med Inform Assoc, 15, 1 (2008), 114--119.",
      "doi": ""
    },
    {
      "text": "Zhou, X., Ackerman, M., Zheng, K. CPOE Workarounds, Boundary Objects, and Assemblages. In Proc. CHI 2011, ACM Press, 3353--3362.  ",
      "doi": ""
    }
  ]
}