{
  "doi": "10.1145/2207676.2208535",
  "title": "Tackling dilemmas in supporting 'the whole person' in online patient communities",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "923-926",
  "year": 2012,
  "badges": [],
  "abstract": "Online health communities that engage the patient as a whole person attend to personal and medical needs in a holistic manner. Whether current communities structure interaction between health professionals and patients to address the whole person is an open question. To gain insights into this question, we examined a sample of online patient communities to understand health professionals' involvement in bringing in medical advice into peer-patient conversations. We found the communities fall short in supporting the whole person, because (1) patient expertise and clinical expertise generated by health professionals are shared separately, and (2) patients' quantified data are separate from narrative experiences. Such separation in the design of these systems can lead to limitations in addressing patients' interwoven medical and personal concerns. We discuss dilemmas and design implications for supporting the whole person in online patient communities.",
  "authors": [
    {
      "name": "Jina Huh",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488800",
      "orcid": "missing"
    },
    {
      "name": "Rupa Patel",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502779989",
      "orcid": "missing"
    },
    {
      "name": "Wanda Pratt",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81100298117/rel-imgonly/img_2793-4.jpg",
      "acmid": "81100298117",
      "orcid": "0000-0003-4035-0198"
    }
  ],
  "references": [
    {
      "text": "Anderson, R. M., Funnell, M. M., Butler, P. M., Arnold, M. S., Fitzgerald, J. T., and Feste, C. C. Patient empowerment. Results of a randomized controlled trial. Diabetes Care 18, 7 (1995), 943.",
      "doi": ""
    },
    {
      "text": "Brown, J., Weston, W., and Stewart, M. The first component: exploring both the disease and the illness experience. Patient-centered Medicine. Transforming the Clinical Method 2, 3--52.",
      "doi": ""
    },
    {
      "text": "Cuijpers, P., Donker, T., van Straten, A., Li, J., and Andersson, G. Is guided self-help as effective as face-to-face psychotherapy for depression and anxiety disorders? A systematic review and meta-analysis of comparative outcome studies. Psychological medicine 40, 12 (2010), 1943--57.",
      "doi": ""
    },
    {
      "text": "Frost, J. H. and Massagli, M. P. Social uses of personal health information within PatientsLikeMe, an online patient community: What can happen when patients have access to one another's data. Journal of Medical Internet Research 10, 3 (2008), e15.",
      "doi": ""
    },
    {
      "text": "Hartzler, A. and Pratt, W. Managing the Personal Side of Health: How Patient Expertise Differs from the Expertise of Clinicians. JMIR 13, 3 (2011), e62.",
      "doi": ""
    },
    {
      "text": "Huh, J. Collaborative Help for Individualized Problems: Learning from the MythTV User Community and Diabetes Patient Support Groups. 2011.",
      "doi": ""
    },
    {
      "text": "Kleinman, A., Eisenberg, L., and Good, B. Culture, Illness, and Care: Clinical Lessons from Anthropologic and Cross-Cultural Research. Ann Intern Med 88, 2 (1978), 251--258.",
      "doi": ""
    },
    {
      "text": "Levenstein, J. H., McCracken, E. C., McWhinney, I. R., Stewart, M. A., and Brown, J. B. The Patient-Centred Clinical Method. 1. A Model for the Doctor-Patient Interaction in Family Medicine. Family Practice 3, 1 (1986), 24--30.",
      "doi": ""
    },
    {
      "text": "Lindsay, S. and Smith, S. The health impact of an online heart disease support group: a comparison of moderated versus unmoderated support. Health Education Research 24, 4 (2009), 646--654.",
      "doi": ""
    },
    {
      "text": "Lorig, K., Ritter, P. L., Laurent, D. D., et al. Online diabetes self-management program: a randomized study. Diabetes care 33, 6 (2010), 1275--81.",
      "doi": ""
    },
    {
      "text": "Plaisant, C., Mushlin, R., Snyder, A., Li, J., Heller, D., and Shneiderman, B. LifeLines: using visualization to enhance navigation and analysis of patient records. AMIA, (1998), 76.",
      "doi": ""
    },
    {
      "text": "Preece, J. Empathic communities: Reaching out across the web. Interactions 5, 2 (1998), 32--43.  ",
      "doi": "10.1145/274430.274435"
    },
    {
      "text": "Smith, B. K., Frost, J., Albayrak, M., and Sudhakar, R. Integrating glucometers and digital photography as experience capture tools to enhance patient understanding and communication of diabetes self-management practices. Personal and Ubiquitous Computing 11, 4 (2006), 273--286.  ",
      "doi": "10.1007/s00779-006-0087-2"
    },
    {
      "text": "Strauss, A. L. and Corbin, J. Basics of qualitative research: Grounded theory procedures and techniques. Sage Newbury Park, CA, 1990.",
      "doi": ""
    },
    {
      "text": "Willett, W., Heer, J., Hellerstein, J., and Agrawala, M. CommentSpace. Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11, ACM Press (2011), 3131.  ",
      "doi": "10.1145/1978942.1979407"
    },
    {
      "text": "Wolf, G. Know Thyself: Tracking Every Facet of Life, from Sleep to Mood to Pain, 24/7/365. Wired Magazine, 2009.",
      "doi": ""
    }
  ]
}