{
  "doi": "10.1145/2207676.2208534",
  "title": "Supporting visual assessment of food and nutrient intake in a clinical care setting",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "919-922",
  "year": 2012,
  "badges": [],
  "abstract": "Monitoring nutritional intake is an important aspect of the care of older people, particularly for those at risk of malnutrition. Current practice for monitoring food intake relies on hand written food charts that have several inadequacies. We describe the design and validation of a tool for computer-assisted visual assessment of patient food and nutrient intake. To estimate food consumption, the application compares the pixels the user rubbed out against predefined graphical masks. Weight of food consumed is calculated as a percentage of pixels rubbed out against pixels in the mask. Results suggest that the application may be a useful tool for the conservative assessment of nutritional intake in hospitals.",
  "authors": [
    {
      "name": "Rob Comber",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "Jack Weeden",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502808999",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Hoare",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502692228",
      "orcid": "missing"
    },
    {
      "name": "Stephen Lindsay",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    },
    {
      "name": "Gemma Teal",
      "institution": "Glasgow School of Art, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502802676",
      "orcid": "missing"
    },
    {
      "name": "Alastair Macdonald",
      "institution": "Glasgow School of Art, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336491304",
      "orcid": "missing"
    },
    {
      "name": "Lisa Methven",
      "institution": "University of Reading, Reading, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502807621",
      "orcid": "missing"
    },
    {
      "name": "Paula Moynihan",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655771",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Age Concern. Hungry to be Heard: The scandal of malnourished older people in hospital. Age Concern England, London, UK, 2006.",
      "doi": ""
    },
    {
      "text": "Chaudry, B., Connelly, K., Siek, K. A., and Welch, J. L. The design of a mobile portion size estimation interface for a low literacy population. In 5th International Conference on Pervasive Computing Technologies for Healthcare, (2011), 160--167.",
      "doi": ""
    },
    {
      "text": "Hernandez, T., Wilder, L., Kuehan, D., Rubotzky, K., Moser-Veillon, P., Godwin, S., et al., Portion size estimation and expectation of accuracy. J. Food Comp. Anal., 19, (2006), 814--821.",
      "doi": ""
    },
    {
      "text": "Larsson, J., Unosson, M., Ek, A.-C., Nilsson, L., Thorslund, S., and Bjurulf, P. Effect of dietary supplement on nutritional status and clinical outcome in 501 geriatric patients - a randomised study. Clinical Nutrition 9, 4 (1990), 179--184. DOI: 1016/02615614(90)90017-M.",
      "doi": ""
    },
    {
      "text": "Lucas, F., Niravong, M., Villeminot, S., Kaaks, R. and Clavel-Chapelon, F. Estimation of food portion size using photographs: validity, strengths, weaknesses and recommendations. Journal of Human Nutrition and Dietetics 8, (1995), 65--74.",
      "doi": ""
    },
    {
      "text": "Macdonald A. S., Teal G., and Moynihan P. A smarter food service for nutritionally vulnerable older adult hospital patients. In Proc. of CWUAAT 10, (2010), 169--177.",
      "doi": ""
    },
    {
      "text": "McWhirter, J. P. and Pennington, C. R. Incidence and recognition of malnutrition in hospital. British Medical Journal 308, (1994), 945--948.",
      "doi": ""
    },
    {
      "text": "Moynihan, P., Thomason, J. M., Walls, A. W. G., Gray-Donald, K., Morais, J. A., Ghanem, H., Wollin, S., Ellis, J. S., Steele, J., Lund, J., and Feine, J. Researching the impact of oral health on diet and nutritional status: methodological issues. Journal of Dentistry 37, 4 (2009), 237--249.",
      "doi": ""
    },
    {
      "text": "Reilly, H. M. Screening for nutritional risk. Proceedings of the Nutrition Society 55, (1996), 841--853. http://dx.doi.org/10.1017/S0029665196000286",
      "doi": ""
    },
    {
      "text": "Russell, C. and Elia, M. Nutrition Screening Survey in the UK and Republic of Ireland in 2010. A report by the British Association for Parenteral and Enteral Nutrition (BAPEN). BAPEN, Redditch, 2011.",
      "doi": ""
    },
    {
      "text": "Subar, A. F., Crafts, J., Zimmerman, T. P., Wilson, M., Mittl, B., Islam, N. G., et al. Assessment of the accuracy of portion size reports using computer-based food photographs aids in the development of an automated self-administered 24-hour recall. J. Am. Diet. Assoc., 110, (2010), 55--64.",
      "doi": ""
    }
  ]
}