{
  "doi": "10.1145/2207676.2207719",
  "title": "Urban HCI: spatial aspects in the design of shared encounters for media facades",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "307-316",
  "year": 2012,
  "badges": [],
  "abstract": "Designing interactive applications for Media Facades is a challenging task. Architectural sized largescale screens can result in unbalanced installations, and meaningful interaction is easily overshadowed by the drastic size of the display. In this paper we reflect on urban technology interventions by analyzing their spatial configuration in relation to the structuring of interaction. We outline basic categories and offer a new terminology to describe these interactive situations designed for the built environment.",
  "authors": [
    {
      "name": "Patrick Tobias Fischer",
      "institution": "Strathclyde University, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453649836",
      "orcid": "missing"
    },
    {
      "name": "Eva Hornecker",
      "institution": "University of Strathclyde, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100374937/rel-imgonly/s1579_0573-face.jpg",
      "acmid": "81100374937",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "BBC. Bigscreen Content Guidelines. http://www.bbc.co.uk/bigscreens/media/130111_contentg uidelines.pdf. 02.08.2011.",
      "doi": ""
    },
    {
      "text": "Boring, S., et al. Multi-user interaction on media facades through live video on mobile devices. Proc. of CHI, ACM, (2011), 2712--2724.  ",
      "doi": "10.1145/1978942.1979342"
    },
    {
      "text": "Brignull, H., Rogers, Y. Enticing people to interact with large public displays in public spaces. Proc. of INTERACT, IOS Press, (2003), 17--24.",
      "doi": ""
    },
    {
      "text": "Bruges, J. Platform 5. http://www.jasonbruges.com /projects/uk-projects/platform-5. 02.08.2011.",
      "doi": ""
    },
    {
      "text": "Dalsgaard, P.,Halskov, K. Designing urban media facades: cases and challenges. Proc. of CHI, ACM, (2010), 2277--2286.  ",
      "doi": "10.1145/1753326.1753670"
    },
    {
      "text": "Dalsgaard, P., et al. Towards a Design Space Explorer for Media Facades. Proc. of OzCHI, ACM, (2008).  ",
      "doi": "10.1145/1517744.1517816"
    },
    {
      "text": "Dieu, P. L., Dennen, A. Bus-Tops. http://bus-Tops.com. 21.07.2011.",
      "doi": ""
    },
    {
      "text": "doubleNegatives. Corpora. http://doublenegatives.jp /installations/Corpora/index.htm. 02.08.2011.",
      "doi": ""
    },
    {
      "text": "Eyl, F. Aperture. http://www.fredericeyl.de/aperture/. 02.08.2011.",
      "doi": ""
    },
    {
      "text": "Fallman, D. Mobility as involvement: on the role of involvement in the design of mobile support systems for industrial applications. AI & Soc., 25, 1, (2010), 43--52.  ",
      "doi": "10.1007/s00146-009-0235-0"
    },
    {
      "text": "Fallman, D. The New Good: Exploring the Potential of Philosophy of Technology to Contribute to HumanComputer Interaction. Proc. of CHI, ACM, (2011), 1051--1069.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Finke, M., et al. Lessons learned: game design for large public displays. Proc. of DIMEA 2008, ACM, (2008).  ",
      "doi": "10.1145/1413634.1413644"
    },
    {
      "text": "Fischer, P. T., et al. VR/Urban: Spread.gun - Design Process and Challenges in Developing a Shared Encounter for Media Façades. Proc. of British HCI, (2010). ",
      "doi": "10.5555/2146303.2146346"
    },
    {
      "text": "Goffman, E. Behaviour in Public Places. The Free Press, New York, 1966.",
      "doi": ""
    },
    {
      "text": "Guitiérrez, C., et al. Lummoblocks. http://www.lummo.eu/lummotetris.html. 21.07.2011.",
      "doi": ""
    },
    {
      "text": "Gustafson, P. Meanings of Place: Everyday Experience and Theoretical Conceptualizations. Journal of Environmental Psychology, 21, 1, (2002), 5--16.",
      "doi": ""
    },
    {
      "text": "Hall, E. T. The Hidden Dimension. Anchor, 1966.",
      "doi": ""
    },
    {
      "text": "Harrison, S., Dourish, P. Re-Place-ing Space: The Roles of Place and Space in Collaborative Systems. Proc. of CSCW, ACM, (1996).  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hillier, B. Space is the Machine: A Configurational Theory of Architecture. Cambridge Univ. Press, 1998.",
      "doi": ""
    },
    {
      "text": "Kendon, A. Spacing and Orientation in Co-present Interaction. Proc. of COST 2102 Training School, Springer Heidelberg, (2009), 1--15.  ",
      "doi": "10.1007/978-3-642-12397-9_1"
    },
    {
      "text": "Lefebvre, H. The production of space. Blackwell Publishing Ltd., 1991.",
      "doi": ""
    },
    {
      "text": "Lozano-Hemmer, R. Body Movies. Relational Architecture 6. http://www.lozanohemmer.com/body_movies.php. (seen 21.07.2011).",
      "doi": ""
    },
    {
      "text": "Marshall, P., et al. Using F-formations to Analyse Spatial Patterns of Interaction in Physical Environments. Proc. of CSCW, ACM, (2011), 445--454.  ",
      "doi": "10.1145/1958824.1958893"
    },
    {
      "text": "McCullough, M. Digital Ground. MIT Press, 2005.",
      "doi": ""
    },
    {
      "text": "Peltonen, P., et al. \"It's Mine, Don't Touch!\": Interactions at a Large Multi-Touch Display in a City Centre. Proc. of CHI, ACM, (2008), 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Peltonen, P., et al. Extending Large-Scale Event Participation with User-Created Mobile Media on a Public Display. Proc. of MUM, ACM, (2007), 131--138.  ",
      "doi": "10.1145/1329469.1329487"
    },
    {
      "text": "Reeves, S., et al. Designing the spectator experience. Proc. of CHI, ACM, (2005), 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Relph, E. C. Place and Placelessness. Pion, 1984.",
      "doi": ""
    },
    {
      "text": "Schieck, A. F. g., et al. Exploring Digital Encounters in the Public Arena. In K. S. Willis, et al. (eds). Shared Encounters, Springer, London, 2010, 179--195.",
      "doi": ""
    },
    {
      "text": "Schieck, A. F. g., O'Neill, E. The Urban Screen as a platform for communication. Proc. of CHI, ACM, (2009)",
      "doi": ""
    },
    {
      "text": "Sheridan, J. G., et al. Understanding Interaction in Ubiquitous Guerilla Performances in Playful Arenas. Proc. of HCI, Springer, (2004), 3--18.",
      "doi": ""
    },
    {
      "text": "Streitz, N., et al. Ambient Displays and Mobile Devices for the Creation of Social Architectural Spaces. In K. O'Hara (eds). Public and Situated Displays, Kluwer Academic Publisher, 2003.",
      "doi": ""
    },
    {
      "text": "Tuan, Y.-F. Space and Place. University of Minnesota Press, Minneapolis, 1977.",
      "doi": ""
    },
    {
      "text": "UnitedVisualArtists. Canopy. http://www.uva.co.uk/work/canopy.",
      "doi": ""
    },
    {
      "text": "Vogel, D., Balakrishnan, R. Interactive Public Ambient Displays: Transitioning from Implicit to Explicit, Public to Personal, Interaction with Multiple Users. Proc. of UIST, ACM, (2004), 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Wally, B., Ferscha, A. Ambient Façades. Proc. of UbiComp, ACM, (2008).",
      "doi": ""
    },
    {
      "text": "Whyte, W. H. City: Rediscovering the Center. Anchor, 1990.",
      "doi": ""
    },
    {
      "text": "Wiener, J. M., Franz, G. Isovists as a means to predict spatial experiences and behaviour. Proc. of Spatial Cognition IV, Springer, (2004), 42--57.  ",
      "doi": "10.1007/978-3-540-32255-9_3"
    },
    {
      "text": "Willis, K. S., et al. Shared Encounters. In K. S. Willis, et al. (eds). Shared Encounters, Springer, 2010, 1--15.",
      "doi": ""
    }
  ]
}