{
  "doi": "10.1145/2207676.2208605",
  "title": "Representing \"too small to see\" as \"too small to see\" with temporal representation",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1441-1450",
  "year": 2012,
  "badges": [],
  "abstract": "Teaching and learning the vast range of the sizes of the objects that are too small to see with human eyes (called imperceptible objects) has been a challenging issue in education. Because representation is the only medium that learners can use to make sense of imperceptible phenomena, learners encounter challenges when trying to understand the range of imperceptible sizes. However, the conventional visual representations that are incorporated in many learning technologies tend to direct learners to overestimate the sizes of imperceptible objects. To address this issue, we designed a multimodal representation called \"\"temporal-aural-visual representation\" (or TAVR) to provide students with an alternative way of perceiving and conceptualizing imperceptible sizes. In prior studies it was noticed that learners constructed more refined mental models of the vast range of imperceptible sizes through the TAVR-enhanced learning activity. In this paper, we introduce a recent study that explored how to best augment the temporal experience of the range of imperceptible sizes with supporting modalities.",
  "authors": [
    {
      "name": "Minyoung Song",
      "institution": "University of Michigan, Ann Arbor, Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416596040",
      "orcid": "missing"
    },
    {
      "name": "Chris Quintana",
      "institution": "University of Michigan, Ann Arbor, Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100211248",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ainsworth, S., The functions of multiple representations. Computers & Education, 1999. 33(2-3): p. 131--152.  ",
      "doi": "10.1016/S0360-1315%2899%2900029-9"
    },
    {
      "text": "Chi, M. T. H., Commonsense Conceptions of Emergent Processes: Why Some Misconceptions Are Robust. Journal of the Learning Sciences, 2005. 14(2): p. 161--199.",
      "doi": ""
    },
    {
      "text": "Chi, M. T. H. and R. D. Roscoe, The Processes and Challenges of Conceptual Change in Reconsidering Conceptual Change: Issues in Theory and Practice, M. L. a. L. Mason, Editor. 2002, Springer Netherlands: Dordrecht, Netherlands. p. 3--27.",
      "doi": ""
    },
    {
      "text": "Friedman, W., The Development of Relational Understandings of Temporal and Spatial Terms. 1979.",
      "doi": ""
    },
    {
      "text": "Hutchins, E., Cognition in the wild. 1995, Cambridge, Mass.: MIT Press. xviii, 381 p.",
      "doi": ""
    },
    {
      "text": "Kosslyn, S. M., Image and mind. 1980, Cambridge, Mass.: Harvard University Press. xv, 500 p.",
      "doi": ""
    },
    {
      "text": "Lakoff, G., Women, fire, and dangerous things : what categories reveal about the mind. 1987, Chicago: University of Chicago Press. xvii, 614 p.",
      "doi": ""
    },
    {
      "text": "Nanoscale Informal Science Education. Scale Ladder. Available from: http://www.nisenet.org/viz_lab/size-scale.",
      "doi": ""
    },
    {
      "text": "Office, E. Powers of Ten. Available from: http://www.powersof10.com.",
      "doi": ""
    },
    {
      "text": "Paivio, A. Mental representations : a dual coding approach. Oxford psychology series no. 9 1986; x, 322 p.}.",
      "doi": ""
    },
    {
      "text": "Quintana, C., et al., A Scaffolding Design Framework for Software to Support Science Inquiry. Journal of the Learning Sciences, 2004. 13(3): p. 337--386.",
      "doi": ""
    },
    {
      "text": "Song, M. and C. Quintana, WIIS: multimodal simulation for exploring the world beyond visual sense, in Proceedings of the 27th international conference extended abstracts on Human factors in computing systems. 2009, ACM: Boston, MA, USA. p. 4699--4704.  ",
      "doi": "10.1145/1520340.1520723"
    },
    {
      "text": "Stix, A., Creating Rubrics through Negotiable Contracting and Assessment. 1996.",
      "doi": ""
    },
    {
      "text": "Tretter, T. R., et al., Conceptual boundaries and distances: Students' and experts' concepts of the scale of scientific phenomena. Journal of Research in Science Teaching, 2006. 43(3): p. 282--319.",
      "doi": ""
    },
    {
      "text": "Tretter, T. R., M. G. Jones, and J. Minogue, Accuracy of Scale Conceptions in Science: Mental Maneuverings across Many Orders of Spatial Magnitude. Journal of Research in Science Teaching, 2006. 43(10): p. 1061--1085.",
      "doi": ""
    },
    {
      "text": "Vallesi, A., M. A. Binns, and T. Shallice, An effect of spatial-temporal association of response codes: Understanding the cognitive representations of time. Cognition, 2008. 107(2): p. 501--527.",
      "doi": ""
    },
    {
      "text": "Zhang, J. and D. Norman, The Representation of Relational Information. Proceedings of the Sixtheenth Annual Conference of the Cognitive Science Society, 1994: p. 952--957.",
      "doi": ""
    }
  ]
}