{
  "doi": "10.1145/2207676.2208591",
  "title": "User see, user point: gaze and cursor alignment in web search",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1341-1350",
  "year": 2012,
  "badges": [],
  "abstract": "Past studies of user behavior in Web search have correlated eye-gaze and mouse cursor positions, and other lines of research have found cursor interactions to be useful in determining user intent and relevant parts of Web pages. However, cursor interactions are not all the same; different types of cursor behavior patterns exist, such as reading, hesitating, scrolling and clicking, each of which has a different meaning. We conduct a search study with 36 subjects and 32 search tasks to determine when gaze and cursor are aligned, and thus when the cursor position is a good proxy for gaze position. We study the effect of time, behavior patterns, user, and search task on the gaze-cursor alignment, findings which lead us to question the maxim that \"gaze is well approximated by cursor.\" These lessons inform an experiment in which we predict the gaze position with better accuracy than simply using the cursor position, improving the state-of-the-art technique for approximating visual attention with the cursor. Our new technique can help make better use of large-scale cursor data in identifying how users examine Web search pages.",
  "tags": [
    "gaze",
    "eye-tracking",
    "search examination behavior",
    "cursor"
  ],
  "authors": [
    {
      "name": "Jeff Huang",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447597481",
      "orcid": "missing"
    },
    {
      "name": "Ryen White",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100617179/rel-imgonly/ryenw_headshot_dec2021.jpg",
      "acmid": "81100617179",
      "orcid": "missing"
    },
    {
      "name": "Georg Buscher",
      "institution": "Microsoft Bing, Bellevue, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100009613",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arroyo, E., Selker, T., and Wei, W. Usability tool for analysis of web designs using mouse tracks. In CHI Extended Abstracts (2006), 484--489.  ",
      "doi": "10.1145/1125451.1125557"
    },
    {
      "text": "Atterer, R., Wnuk, M., and Schmidt, A. Knowing the user's every move: user activity tracking for website usability evaluation and implicit interaction. In Proceedings of WWW (2006), 203--212.  ",
      "doi": "10.1145/1135777.1135811"
    },
    {
      "text": "Aula, A., Majaranta, P., and Räihä, K.-J. Eye-tracking reveals the personal styles for search result evaluation. In Proceedings of INTERACT (2005), 1058--1061.  ",
      "doi": "10.1007/11555261_104"
    },
    {
      "text": "Buscher, G., Cutrell, E., and Morris, M. R. What do you see when you're surfing?: using eye tracking to predict salient regions of web pages. In Proceedings of CHI (2009), 21--30.  ",
      "doi": "10.1145/1518701.1518705"
    },
    {
      "text": "Buscher, G., Dengel, A., and van Elst, L. Eye movements as implicit relevance feedback. In CHI Extended Abstracts (2008), 2991--2996.  ",
      "doi": "10.1145/1358628.1358796"
    },
    {
      "text": "Buscher, G., Dumais, S. T., and Cutrell, E. The good, the bad, and the random: an eye-tracking study of ad quality in web search. In Proceedings of SIGIR (2010), 42--49.  ",
      "doi": "10.1145/1835449.1835459"
    },
    {
      "text": "Buscher, G., van Elst, L., and Dengel, A. Segment-level display time as implicit feedback: a comparison to eye tracking. In Proceedings of SIGIR (2009), 67--74.  ",
      "doi": "10.1145/1571941.1571955"
    },
    {
      "text": "Chapelle, O., and Zhang, Y. A dynamic bayesian network click model for web search ranking. In Proceedings of WWW (2009), 1--10.  ",
      "doi": "10.1145/1526709.1526711"
    },
    {
      "text": "Chen, M. C., Anderson, J. R., and Sohn, M. H. What can a mouse cursor tell us more?: correlation of eye/mouse movements on web browsing. In CHI Extended Abstracts (2001), 281--282.  ",
      "doi": "10.1145/634067.634234"
    },
    {
      "text": "Claypool, M., Le, P., Wased, M., and Brown, D. Implicit interest indicators. In Proceedings of IUI (2001), 33--40.  ",
      "doi": "10.1145/359784.359836"
    },
    {
      "text": "Cole, M. J., Gwizdka, J., Liu, C., Bierig, R., Belkin, N. J., and Zhang, X. Task and user effects on reading patterns in information search. Interacting with Computers 23, 4 (2011), 346--362.",
      "doi": ""
    },
    {
      "text": "Cooke, L. Is the mouse a poor man's eye tracker? In Proceedings of STC (2006).",
      "doi": ""
    },
    {
      "text": "Cutrell, E., and Guan, Z. What are you looking for?: an eye-tracking study of information usage in web search. In Proceedings of CHI (2007), 407--416.  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Dumais, S. T., Buscher, G., and Cutrell, E. Individual differences in gaze patterns for web search. In Proceedings of IIiX (2010), 185--194.  ",
      "doi": "10.1145/1840784.1840812"
    },
    {
      "text": "Goecks, J., and Shavlik, J. Learning users' interests by unobtrusively observing their normal behavior. In Proceedings of IUI (2000), 129--132.  ",
      "doi": "10.1145/325737.325806"
    },
    {
      "text": "Guo, F., Liu, C., Kannan, A., Minka, T., Taylor, M., Wang, Y.-M., and Faloutsos, C. Click chain model in web search. In Proceedings of WWW (2009), 11--20.  ",
      "doi": "10.1145/1526709.1526712"
    },
    {
      "text": "Guo, Q., and Agichtein, E. Exploring mouse movements for inferring query intent. In Proceedings of SIGIR (2008), 707--708.  ",
      "doi": "10.1145/1390334.1390462"
    },
    {
      "text": "Guo, Q., and Agichtein, E. Ready to buy or just browsing?: detecting web searcher goals from interaction data. In Proceedings of SIGIR (2010), 130--137.  ",
      "doi": "10.1145/1835449.1835473"
    },
    {
      "text": "Guo, Q., and Agichtein, E. Towards predicting web searcher gaze position from mouse movements. In Proceedings of CHI (2010), 3601--3606.  ",
      "doi": "10.1145/1753846.1754025"
    },
    {
      "text": "Hauger, D., Paramythis, A., and Weibelzahl, S. Using browser interaction data to determine page reading behavior. In Proceedings of UMAP (2011), 147--158. ",
      "doi": "10.5555/2021855.2021869"
    },
    {
      "text": "Hijikata, Y. Implicit user profiling for on demand relevance feedback. In Proceedings of IUI (2004), 198--205.  ",
      "doi": "10.1145/964442.964480"
    },
    {
      "text": "Huang, J., White, R. W., and Dumais, S. No clicks, no problem: using cursor movements to understand and improve search. In Proceedings of CHI (2011), 1225--1234.  ",
      "doi": "10.1145/1978942.1979125"
    },
    {
      "text": "Ianniello, J. Time delay estimation via cross-correlation in the presence of large estimation errors. IEEE Trans. Acoust., Speech, Signal Process. 30, 6 (1982), 998--1003.",
      "doi": ""
    },
    {
      "text": "Lindeman, R., Merenda, P., and Gold, R. Introduction to Bivariate and Multivariate Analysis. Scott Foresman, Glenview IL, 1980, 119.",
      "doi": ""
    },
    {
      "text": "Liu, C.-C., and Chung, C.-W. Detecting mouse movement with repeated visit patterns for retrieving noticed knowledge components on web pages. IEICE Trans. Inf. Syst. E90-D, 10 (October 2007), 1687--1696.  ",
      "doi": "10.1093/ietisy/e90-d.10.1687"
    },
    {
      "text": "Reichle, E. D., Pollatsek, A., and Rayner, K. E-z reader: A cognitive-control, serial-attention model of eye-movement behavior during reading. Cognitive Systems Research 7, 1 (2006), 4--22.  ",
      "doi": "10.1016/j.cogsys.2005.07.002"
    },
    {
      "text": "Rodden, K., and Fu, X. Exploring how mouse movements relate to eye movements on web search results pages. In SIGIR Workshop on Web Information Seeking and Interaction (2007), 29--32.",
      "doi": ""
    },
    {
      "text": "Rodden, K., Fu, X., Aula, A., and Spiro, I. Eye-mouse coordination patterns on web search results pages. In CHI Extended Abstracts (2008), 2997--3002.  ",
      "doi": "10.1145/1358628.1358797"
    },
    {
      "text": "Shapira, B., Taieb-Maimon, M., and Moskowitz, A. Study of the usefulness of known and new implicit indicators and their optimal combination for accurate inference of users interests. In Proceedings of SAC (2006), 1118--1119.  ",
      "doi": "10.1145/1141277.1141542"
    },
    {
      "text": "Teevan, J., Dumais, S. T., and Liebling, D. J. To personalize or not to personalize: modeling queries with variation in user intent. In Proceedings of SIGIR (2008), 163--170.  ",
      "doi": "10.1145/1390334.1390364"
    },
    {
      "text": "Torres, L. A. L., and Hernando, R. V. (smt) real time mouse tracking registration and visualization tool for usability evaluation on websites. In Proceedings of IADIS WWW/Internet (2007), 187--192.",
      "doi": ""
    },
    {
      "text": "Ware, C., and Mikaelian, H. H. An evaluation of an eye tracker as a device for computer input. In Proceedings of CHI (1987), 183--188.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Weber, I., and Castillo, C. The demographics of web search. In Proceedings of SIGIR (2010), 523--530.  ",
      "doi": "10.1145/1835449.1835537"
    }
  ]
}