{
  "doi": "10.1145/2207676.2208728",
  "title": "PocketNavigator: studying tactile navigation systems in-situ",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3131-3140",
  "year": 2012,
  "badges": [],
  "abstract": "In this paper, we report about a large-scale in-situ study of tactile feedback for pedestrian navigation systems. Recent advances in smartphone technology have enabled a number of interaction techniques for smartphone that use tactile feedback to deliver navigation information. The aim is to enable eyes-free usage and avoid distracting the user from the environment. Field studies where participants had to fulfill given navigation tasks, have found these techniques to be efficient and beneficial in terms of distraction. But it is not yet clear whether these findings will replicate in in-situ usage. We, therefore, developed a Google Maps-like navigation application that incorporates interaction techniques proposed in previous work. The application was published for free on the Android Market and so people were able to use it as a navigation system in their everyday life. The data collected through anonymous monitoring suggests that tactile feedback is successfully adopted in one third of all trips and has positive effects on the user's level of distraction.",
  "authors": [
    {
      "name": "Martin Pielot",
      "institution": "OFFIS Institute for Information Technology, Oldenburg, Lower Saxony, Germany",
      "img": "/do/10.1145/contrib-81385591697/rel-imgonly/cv_shirt.jpg",
      "acmid": "81385591697",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Poppinga",
      "institution": "OFFIS Institute for Information Technology, Oldenburg, Lower Saxony, Germany",
      "img": "/do/10.1145/contrib-81350585017/rel-imgonly/poppinga_benjamin_small.jpg",
      "acmid": "81350585017",
      "orcid": "missing"
    },
    {
      "name": "Wilko Heuten",
      "institution": "OFFIS Institute for Information Technology, Oldenburg, Lower Saxony, Oldenburg, Lower Saxony, Germany",
      "img": "/do/10.1145/contrib-81320490169/rel-imgonly/csm_offis_gesundheit_heuten_wilko_dsc05737__1__web_4024cc8173.jpg",
      "acmid": "81320490169",
      "orcid": "0000-0003-2085-193X"
    },
    {
      "name": "Susanne Boll",
      "institution": "University of Oldenburg, Oldenburg, Lower Saxony, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398416",
      "orcid": "0000-0003-4293-1623"
    }
  ],
  "references": [
    {
      "text": "Brewster, S., and Brown, L. M. Tactons: structured tactile messages for non-visual information display. In Proc. AUIC 2004, Australian Computer Society, Inc. (2004), 15--23. ",
      "doi": ""
    },
    {
      "text": "Cramer, H., Rost, M., Belloni, N., Bentley, F., and Chincholle, D. Research in the large. using app stores, markets, and other wide distribution channels in ubicomp research. In Adjunct Proceedings of UbiComp 2010, ACM (2010), 511--514.  ",
      "doi": ""
    },
    {
      "text": "Elliott, L. R., van Erp, J., Redden, E. S., and Duistermaat, M. Field-based validation of a tactile navigation device. IEEE Transactions on Haptics 99 (2010).  ",
      "doi": ""
    },
    {
      "text": "Erp, J. B. F. V., Veen, H. A. H. C. V., Jansen, C., and Dobbins, T. Waypoint navigation with a vibrotactile waist belt. ACM Trans. Appl. Percept. 2 (April 2005), 106--117.  ",
      "doi": ""
    },
    {
      "text": "Fröhlich, P., Oulasvirta, A., Baldauf, M., and Nurminen, A. On the move, wirelessly connected to the world. Commun. ACM 54 (January 2011), 132--138.  ",
      "doi": "10.1145/1866739.1866766"
    },
    {
      "text": "Hoggan, E., and Brewster, S. A. Crosstrainer: testing the use of multimodal interfaces in situ. In Proceedings of the 28th international conference on Human factors in computing systems, ACM (2010), 333--342.  ",
      "doi": ""
    },
    {
      "text": "Ishikawa, T., Fujiwara, H., Imai, O., and Okabe, A. Wayfinding with a gps-based mobile navigation system: A comparison with maps and direct experience. Journal of Environmental Psychology 28, 1 (2008), 74--82.",
      "doi": ""
    },
    {
      "text": "Lin, M.-W., Cheng, Y.-M., Yu, W., and Sandnes, F. E. Investigation into the feasibility of using tactons to provide navigation cues in pedestrian situations. In Proc. OZCHI '08, ACM (2008), 299--302.  ",
      "doi": ""
    },
    {
      "text": "Madden, M., and Rainie, L. Adults and cell phone distractions. Tech. rep., Pew Research Center, 2010.",
      "doi": ""
    },
    {
      "text": "Magnusson, C., Rassmus-Gröhn, K., and Szymczak, D. The influence of angle size in navigation applications using pointing gestures. In Proc. HAID '10, Springer-Verlag (2010), 107--116. ",
      "doi": ""
    },
    {
      "text": "McMillan, D., Morrison, A., Brown, O., Hall, M., and Chalmers, M. Further into the wild: Running worldwide trials of mobile systems. In Proc. Pervasive '10 (2010).  ",
      "doi": ""
    },
    {
      "text": "Nagel, S. K., Carl, C., Kringe, T., Märtin, R., and König, P. Beyond sensory substitutionlearning the sixth sense. Journal of Neural Engineering 2, 4 (December 2005), R13+.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V., and Kuorelahti, J. Interaction in 4-second bursts: the fragmented nature of attentional resources in mobile hci. In Proc. CHI '05, ACM (2005), 919--928.  ",
      "doi": ""
    },
    {
      "text": "Pielot, M., and Boll, S. Tactile Wayfinder: comparison of tactile waypoint navigation with commercial pedestrian navigation systems. In Proc. Pervasive '10 (2010).  ",
      "doi": ""
    },
    {
      "text": "Pielot, M., Henze, N., and Boll, S. Supporting map-based wayfinding with tactile cues. In Proc. MobileHCI '09, ACM (2009), 23:1--23:10.  ",
      "doi": ""
    },
    {
      "text": "Pielot, M., Poppinga, B., and Boll, S. Pocketnavigator: vibro-tactile waypoint navigation for everyday mobile devices. In Proc. MobileHCI '10, ACM (2010), 423--426.  ",
      "doi": ""
    },
    {
      "text": "Pielot, M., Poppinga, B., Heuten, W., and Boll, S. 6th senses for everyone!: the value of multimodal feedback in handheld navigation aids. In Proc. ICMI '11, ACM (2011), 65--72.  ",
      "doi": ""
    },
    {
      "text": "Pielot, M., Poppinga, B., Heuten, W., and Boll, S. A tactile compass for eyes-free pedestrian navigation. In Proc. INTERACT '11, Springer-Verlag (2011), 640--656. ",
      "doi": "10.5555/2042118.2042179"
    },
    {
      "text": "Robinson, S., Jones, M., Eslambolchilar, P., Murray-Smith, R., and Lindborg, M. \"i did it my way\": moving away from the tyranny of turn-by-turn pedestrian navigation. In Proc. MobileHCI '10, ACM (2010), 341--344.  ",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Müller, M., and Hardy, R. Design, implementation and evaluation of a novel public display for pedestrian navigation: the rotating compass. In Proc. CHI '09s, ACM (2009), 113--122.  ",
      "doi": ""
    },
    {
      "text": "Rümelin, S., Rukzio, E., and Hardy, R. Naviradar: a novel tactile information display for pedestrian navigation. In Proc. UIST '11, ACM (2011), 293--302.  ",
      "doi": ""
    },
    {
      "text": "Rupert, A. An instrumentation solution for reducing spatial disorientation mishaps. Engineering in Medicine and Biology Magazine, IEEE 19, 2 (Mar/Apr 2000), 71--80.",
      "doi": ""
    },
    {
      "text": "Srikulwong, M., and O'Neill, E. A comparison of two wearable tactile interfaces with a complementary display in two orientations. In Proc. HAID '10, Springer-Verlag (2010), 139--148. ",
      "doi": ""
    },
    {
      "text": "Tan, H. Z., and Pentland, A. Tactual displays for wearable computing. In Proc. ISWC '97 (1997). ",
      "doi": ""
    },
    {
      "text": "Tscheligi, M., and Sefelin, R. Mobile navigation support for pedestrians: can it work and does it pay off? Interactions 13 (2006), 31--33.  ",
      "doi": ""
    },
    {
      "text": "Tsukada, and Yasumura. Activebelt: Belt-type wearable tactile display for directional navigation. In Proc. UbiComp '04 (2004).",
      "doi": ""
    },
    {
      "text": "van der Linden, J., Johnson, R., Bird, J., Rogers, Y., and Schoonderwaldt, E. Buzzing to play: lessons learned from an in the wild study of real-time vibrotactile feedback. In Proc. CHI '11, ACM (2011), 533--542.  ",
      "doi": ""
    },
    {
      "text": "van Erp, J. B. F. Tactile navigation display. In Workshop on Haptic HCI, Springer-Verlag (2001), 165--173. ",
      "doi": ""
    },
    {
      "text": "van Erp, J. B. F. Presenting directions with a vibrotactile torso display. Ergonomics 48 (2005), 302--313.",
      "doi": "10.1080/0014013042000327670"
    },
    {
      "text": "Wickens, C. D. Processing resources in attention. In Processing resource in attention. London: Academic, 1984.",
      "doi": ""
    },
    {
      "text": "Williamson, J., Robinson, S., Stewart, C., Murray-Smith, R., Jones, M., and Brewster, S. Social gravity: a virtual elastic tether for casual, privacy-preserving pedestrian rendezvous. In Proc. CHI '10, ACM (New York, NY, USA, 2010), 1485--1494.  ",
      "doi": ""
    }
  ]
}