{
  "doi": "10.1145/2207676.2208644",
  "title": "Trajectory-aware mobile search",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2561-2564",
  "year": 2012,
  "badges": [],
  "abstract": "Most location-aware mobile applications only make use of the user's current location, but there is an opportunity for them to infer the user's future locations. We present Trajectory-Aware Search (TAS), a mobile local search application that predicts the user's destination in real-time based on location data from the current trip and shows search results near the predicted location. TAS demonstrates the feasibility of destination prediction in an interactive mobile application. Our user study of TAS shows using predicted destinations to help select search results positively augments the local search experience.",
  "authors": [
    {
      "name": "Shahriyar Amini",
      "institution": "Microsoft Research, Redmond, Washington & Carnegie Mellon University, Pittsburgh, PA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81477642257",
      "orcid": "missing"
    },
    {
      "name": "Alice J. Bernheimer Brush",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81332491415/rel-imgonly/ajbrushlarge.jpg",
      "acmid": "81332491415",
      "orcid": "missing"
    },
    {
      "name": "John Krumm",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100611132",
      "orcid": "missing"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Amy Karlson",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100168208",
      "orcid": "0000-0001-8934-7761"
    }
  ],
  "references": [
    {
      "text": "Amin, A., Townsend, S., Ossenbruggen, J. and Hardman, L. Fancy a Drink in Canary Wharf?: A User Study on Location-Based Mobile Search. In Proc. INTERACT 2009, 736--749.  ",
      "doi": "10.1007/978-3-642-03655-2_80"
    },
    {
      "text": "Console, L., Gioria, S., Lombardi, I., Surano, V. and Torre, I. Adaptation and personalization on board cars: A framework and its application to tourist services. In Proc. Adaptive Hypermedia and Adaptive Web-Based Systems 2002, 112--121. ",
      "doi": "10.5555/647458.728229"
    },
    {
      "text": "Gui, F., Adjouadi, M. and Rishe, N. A contextualized and personalized approach for mobile search. Advanced Information Networking and Applications Workshops, 2009, 966--971.  ",
      "doi": "10.1109/WAINA.2009.187"
    },
    {
      "text": "Hu, P. S. and Reuscher, T. R. Summary of travel trends: 2001 national household transportation survey. Oak Ridge National Laboratory Technical Report ORNL/TM-2004/297, 2004.",
      "doi": ""
    },
    {
      "text": "Krumm, J. Real time destination prediction based on efficient routes. Paper 2006-01-0811. SAE International, 2006.",
      "doi": ""
    },
    {
      "text": "Krumm, J. Where will they turn: Predicting turn proportions at intersections. Personal and Ubiquitous Computing, 2009.  ",
      "doi": "10.1007/s00779-009-0248-1"
    },
    {
      "text": "Ludford, P., Frankowski, D., Reily, K., Wilms, K., and Terveen, L. Because I carry My Cell Phone Anyway: Functional Location-Based Reminder Applications. In Proc. CHI 2006.  ",
      "doi": "10.1145/1124772.1124903"
    },
    {
      "text": "Setten, M. V., Pokraev, S. and Koolwaaij, J. Context-aware recommendations in the mobile tourist application COMPASS. In Proc. Adaptive Hypermedia and Adaptive Web-Based Systems, 2004, 235--244.",
      "doi": ""
    },
    {
      "text": "Teevan, J., Karlson, A., Amini, S., Brush, A. J. and Krumm, J. Understanding the importance of location, time, and people in mobile local search behavior. In Proc. MobileHCI 2011.  ",
      "doi": "10.1145/2037373.2037386"
    }
  ]
}