{
  "doi": "10.1145/2207676.2207685",
  "title": "From participatory to contributory simulations: changing the game in the classroom",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "49-58",
  "year": 2012,
  "badges": [],
  "abstract": "There is much potential for supporting collaborative learning with interactive computer simulations in formal education and professional training. A number have been developed for single user and remote interaction. In contrast, our research is concerned with how such learning activities can be designed to fit into co-located large group settings, such as whole classrooms. This paper reports on the iterative design process and two in-the-wild evaluations of the 4Decades game, which was developed for a whole classroom of students to engage with a climate simulation. The system allows students to play and change the rules of the simulation, thereby enabling them to be actively engaged at different levels. The notion of Contributory Simulations is proposed as an instructional model that empowers groups to make informed, critical changes to the underlying scientific model. We discuss how large-group collaboration was supported through constraining an ecology of shared devices and public displays.",
  "authors": [
    {
      "name": "Stefan Kreitmayer",
      "institution": "Open University, Milton Keynes & University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656076",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Robin Laney",
      "institution": "Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283124",
      "orcid": "missing"
    },
    {
      "name": "Stephen Peake",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474687540",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AlAgha, I., Hatch, A., Ma, L., and Burd, L. Towards a teacher-centric approach for multi-touch surfaces in classrooms. Proc. of ITS Tabletop, ACM (2010).  ",
      "doi": "10.1145/1936652.1936688"
    },
    {
      "text": "Colella, V. Participatory simulations: Building collaborative understanding through immersive dynamic modeling. The Journal of the Learning Sciences 9, 4 (2000), pp. 471--500.",
      "doi": ""
    },
    {
      "text": "De Jong, T., and Van Joolingen, W. Scientific discovery learning with computer simulations of conceptual domains. Review of educational research 68, 2 (1998).",
      "doi": ""
    },
    {
      "text": "DiSessa, A. On \"Learnable\" Representations of Knowledge: A Meaning for the Computational Metaphor. Massachusetts Institute of Technology, A. I. Laboratory, 1977.",
      "doi": ""
    },
    {
      "text": "Fanning, R., and Gaba, D. The role of debriefing in simulation-based learning. Simulation in Healthcare 2, 2 (2007), 115.",
      "doi": ""
    },
    {
      "text": "Faria, A., and Wellington, W. A survey of simulation game users, former-users, and never-users. Simulation & Gaming 35, 2 (2004), 178.  ",
      "doi": "10.1177/1046878104263543"
    },
    {
      "text": "Hulme, M. Why we disagree about climate change: understanding controversy, inaction and opportunity. Cambridge University Press, Cambridge, 2009.",
      "doi": ""
    },
    {
      "text": "Jonassen, D., and Strobel, J. Modeling for meaningful learning. Engaged learning with emerging technologies (2006), 1--27.",
      "doi": ""
    },
    {
      "text": "Klopfer, E., Roque, R., Huang, W., Wendel, D., and Scheintaub, H. The simulation cycle: Combining games, simulations, engineering and science using StarLogo TNG. E-Learning and Digital Media, E-Learning and Digital Media, Vol. 6, No. 1, pp. 71--96.",
      "doi": ""
    },
    {
      "text": "Kreitmayer, S., Peake, S., Laney, R., and Rogers, Y. Designing a large multi-player simulation game to encourage reflection and critical debate. Proc. of ECGBL '10 (2011).",
      "doi": ""
    },
    {
      "text": "Lyons, L., Lee, J., Quintana, C., and Soloway, E. Preliminary evaluation of a synchronous co-located educational simulation framework. Proc. of CHI '06, ACM (2006).  ",
      "doi": "10.1145/1125451.1125652"
    },
    {
      "text": "Moher, T. Embedded phenomena: supporting science learning with classroom-sized distributed simulations. Proc. of CHI '06, ACM (2006), 691--700.  ",
      "doi": "10.1145/1124772.1124875"
    },
    {
      "text": "Roschelle, J., Tatar, D., Chaudbury, S., Dimitriadis, Y., Patton, C., and DiGiano, C. Ink, improvisation, and interactive engagement: Learning with tablets. Computer 40, 9 (2007), 42--48.  ",
      "doi": "10.1109/MC.2007.321"
    },
    {
      "text": "Stroup, W., Ares, N., Hurford, A., and Lesh, R. Diversity-by-design: The what, why, and how of generativity in next-generation classroom networks. Foundations for the future in mathematics education 367 (2007).",
      "doi": ""
    },
    {
      "text": "Turkle, S. From powerful ideas to powerpoint. Convergence: The International Journal of Research into New Media Technologies 9, 2 (2003).",
      "doi": ""
    },
    {
      "text": "Wilensky, U., and Stroup, W. Learning through participatory simulations: network-based design for systems learning in classrooms. Proc. CSCL '99, ISLS (1999). ",
      "doi": "10.5555/1150240.1150320"
    },
    {
      "text": "Wilensky, U. and Reisman, K. Thinking like a wolf, a sheep, or a firefly: Learning biology through constructing and testing computational theories - an embodied modeling approach. Cognition and Instruction, 2006",
      "doi": ""
    },
    {
      "text": "Yuill, N., and Rogers, Y. Mechanisms for collaboration: A design and evaluation framework for multi-user interfaces. To appear in TOCHI, ACM (2012).  ",
      "doi": "10.1145/2147783.2147784"
    }
  ]
}