{
  "doi": "10.1145/2207676.2208730",
  "title": "Using shear as a supplemental two-dimensional input channel for rich touchscreen interaction",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3149-3152",
  "year": 2012,
  "badges": [],
  "abstract": "Touch input is constrained, typically only providing finger X/Y coordinates. To access and switch between different functions, valuable screen real estate must be allocated to buttons and menus, or users must perform special actions, such as touch-and-hold, double tap, or multi-finger chords. Even still, this only adds a few bits of additional information, leaving touch interaction unwieldy for many tasks. In this work, we suggest using a largely unutilized touch input dimension: shear (force tangential to a screen's surface). Similar to pressure, shear can be used in concert with conventional finger positional input. However, unlike pressure, shear provides a rich, analog 2D input space, which has many powerful uses. We put forward five classes of advanced interaction that considerably expands the envelope of interaction possible on touchscreens.",
  "authors": [
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    },
    {
      "name": "Scott Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Cao, X., Wilson, A., Balakrishnan, R., Hinckley, K., and Hudson, S. E. ShapeTouch: Leveraging contact shape on interactive surfaces. In Proc. TABLETOP '08. 129--136.",
      "doi": ""
    },
    {
      "text": "Card, S., English, W., and Burr, B. Evaluation of Mouse, Rate-Controlled Isometric Joystick, Step Keys, and Text Keys for Text Selection on a CRT. Ergonomics, 1978. 21(8): 601--613.",
      "doi": ""
    },
    {
      "text": "Casiez, G. and Vogel, D. The effect of spring stiffness and control gain with an elastic rate control pointing device. In Proc. CHI '08. 1709--1718.  ",
      "doi": "10.1145/1357054.1357321"
    },
    {
      "text": "Chau, D., Wobbrock, J., Myers, B. and Rothrock, B. Integrating isometric joysticks into mobile phones for text entry. In CHI '06 Ext. Abst. 640--645.  ",
      "doi": "10.1145/1125451.1125583"
    },
    {
      "text": "Gibbs, C. Controller design: interactions of controlling limbs, time-lags and gain in positional and velocity systems. Ergonomics, 5 (1962), 385--402.",
      "doi": ""
    },
    {
      "text": "Harrison, C., Schwarz, J. and Hudson S. E. TapSense: Enhancing Finger Interaction on Touch Surfaces. In Proc. UIST ' 627--636.  ",
      "doi": "10.1145/2047196.2047279"
    },
    {
      "text": "Heo, S. and Lee, G. Force gestures: augmented touch screen gestures using normal and tangential force. In Proc. UIST'11. 621--626.  ",
      "doi": "10.1145/2047196.2047278"
    },
    {
      "text": "Herot, C., Weinzapfel, G., One-Point Touch Input of Vector Information from Computer Displays. In Proc. SIGGRAPH '78. 12(3): p. 210--216.  ",
      "doi": "10.1145/965139.807392"
    },
    {
      "text": "Hinckley K. and Song, H. Sensor synaesthesia: touch in motion, and motion in touch. In Proc. CHI '11. 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. The limits of expert performance using hierarchic marking menus. In Proc. CHI '93. 482--487. ",
      "doi": "10.5555/164632.164977"
    },
    {
      "text": "Lee, B., Lee, H., Lim, S., Lee, H., Han, S. and Park, J. Evaluation of Human Tangential Force Input Performance. In Proc. CHI '12.  ",
      "doi": "10.1145/2207676.2208727"
    },
    {
      "text": "Lepinski, J.G., Grossman, T., and Fitzmaurice, G. The design and evaluation of multitouch marking menus. In Proc. CHI '10. 2233--2242.  ",
      "doi": "10.1145/1753326.1753663"
    },
    {
      "text": "Li, F., Dearman, D., and Truong, K. Virtual shelves: interactions with orientation aware devices. In Proc. UIST '09. 125--128.  ",
      "doi": "10.1145/1622176.1622200"
    },
    {
      "text": "Li, Y., Hinckley, K., Guan, Z., and Landay, J. A. Experimental analysis of mode switching techniques in pen-based user interfaces. In Proc. CHI '05. 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Mascaro, S. A. and Asada, H. H. Measurement of finger posture and three-axis fingertip touch force using fingernail sensors. In IEEE Trans. on Robotics and Automation, 2004.",
      "doi": ""
    },
    {
      "text": "Minsky, M. R. Manipulating simulated objects with real-world gestures using a force and position sensitive screen. In Proc. SIGGRAPH '84, pp. 195--203.  ",
      "doi": "10.1145/800031.808598"
    },
    {
      "text": "Mithal, A. K. and Douglas. S. A. Differences in movement microstructure of the mouse and the finger-controlled isometric joystick. In Proc. CHI '96. 300--307.  ",
      "doi": "10.1145/238386.238533"
    },
    {
      "text": "Miyaki, T. and Rekimoto, J. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. In Proc. MobileHCI '09.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Omata, M., Kajino, M., and Imamiya, A. A multi-level pressure-sensing two-handed interface with finger-mounted pressure sensors. In Proc. GI '09. 199--202. ",
      "doi": "10.5555/1555880.1555924"
    },
    {
      "text": "Quinn, P. and Cockburn. A. Zoofing!: faster list selections with pressure-zoom-flick-scrolling. In Proc. OZCHI '09. 185--192.  ",
      "doi": "10.1145/1738826.1738856"
    },
    {
      "text": "Ramos, G. and Balakrishnan, R. Pressure marks. In Proc. CHI '07. 1375--1384.  ",
      "doi": "10.1145/1240624.1240834"
    },
    {
      "text": "Ramos, G. and Balakrishnan, R. Zliding: fluid zooming and sliding for high precision parameter manipulation. In Proc. UIST '05. 143--152.  ",
      "doi": "10.1145/1095034.1095059"
    },
    {
      "text": "Ramos, G., Boulos, M., and Balakrishnan, R. Pressure widgets. In Proc. CHI '04. 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Roudaut, A., Lecolinet, E. and Guiard, Y. MicroRolls: expanding touch-screen input vocabulary by distinguishing rolls vs. slides of the thumb. In Proc. CHI '09. 927--936.  ",
      "doi": "10.1145/1518701.1518843"
    },
    {
      "text": "Schwesig, C., Poupyrev, I., and Mori, E. Gummi: a bendable computer. In Proc. CHI '04. 263--270.  ",
      "doi": "10.1145/985692.985726"
    },
    {
      "text": "Selker, T., and Rutledge, J. Finger Force Precision for Computer Pointing. IBM RC 17342, October 1991.",
      "doi": ""
    },
    {
      "text": "Wang, F. and Ren, X. Empirical evaluation for finger input properties in multi-touch interaction. In Proc. CHI '09. 1063--1072.  ",
      "doi": "10.1145/1518701.1518864"
    },
    {
      "text": "Wigdor, D. and Balakrishnan, R. TiltText: using tilt for text input to mobile phones. In Proc. UIST '03. 81--90.  ",
      "doi": "10.1145/964696.964705"
    },
    {
      "text": "Wobbrock, J., Myers, B. and Kembel, J. EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. In Proc. UIST '03. 61--70.  ",
      "doi": "10.1145/964696.964703"
    }
  ]
}