{
  "doi": "10.1145/2207676.2208387",
  "title": "Legible, are you sure?: an experimentation-based typographical design in safety-critical context",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2287-2296",
  "year": 2012,
  "badges": [],
  "abstract": "Designing Safety-critical interfaces entails proving the safety and operational usability of each component. Largely taken for granted in everyday interface design, the typographical component, through its legibility and aesthetics, weighs heavily on the ubiquitous reading task at the heart of most visualizations and interactions. In this paper, we present a research project whose goal is the creation of a new typeface to display textual information on future aircraft interfaces. After an initial task analysis leading to the definition of specific needs, requirements and design principles, the design constantly evolves from an iterative cycle of design and experimentation. We present three experiments (laboratory and cockpit) used mainly to validate initial choices and fine-tune font properties. Results confirm the importance of rigorously testing the typographical component as a part of text output evaluation in interactive systems.",
  "tags": [
    "experimentation",
    "design",
    "typography",
    "aircraft",
    "legibility",
    "readability",
    "evaluation",
    "cockpit",
    "safety-critical"
  ],
  "authors": [
    {
      "name": "Jean-Luc Vinot",
      "institution": "Université de Toulouse - ENAC - IRIT & DSNA/DTI/R&D, Toulouse, France",
      "img": "/do/10.1145/contrib-81310489790/rel-imgonly/jl_vinot.jpg",
      "acmid": "81310489790",
      "orcid": "missing"
    },
    {
      "name": "Sylvie Athenes",
      "institution": "Université de Toulouse - UPS, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100230403",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellenkes, A.H., Wickens, C.D. & Kramer, A.F. Visual scanning and pilot expertise: The role of attentional flexibility and mental model development. Aviation, Space, and Environmental Medicin, 68: 569--579, 1997.",
      "doi": ""
    },
    {
      "text": "Bouma, H. Visual recognition of isolated lowercase letters. Vision Research 11: 459--474, 1971.",
      "doi": ""
    },
    {
      "text": "Frutiger, A. L'Homme et ses signes. Atelier Perrousseaux Editeur, 1999.",
      "doi": ""
    },
    {
      "text": "Haralambous, Y. Fonts & Encodings. Published by O'Reilly Media Inc, 2007.",
      "doi": ""
    },
    {
      "text": "Directed by Jackson, A. CoRe Project - Baseline Exemplary Style Guide, Eurocontrol EATM Guidelines - HRS/HSP-006-GUI-01, 2004.",
      "doi": ""
    },
    {
      "text": "Jacobs, A.M., Nazir, T.A. & Heller, D. Perception of lower letters in peripheral vision: A discrimination matrix based on saccade latencies. Perception & Psychophysics 46(1): 95--102, 1989.",
      "doi": ""
    },
    {
      "text": "Larson, K., Hazlett R.L., Chaparro, B.S. & Picard, R.W. Measuring the aesthetics of reading. People & Computers XX -- ENGAGE, In Proc. HCI 2006, Springer (2006), 41--56.",
      "doi": ""
    },
    {
      "text": "Mackay, W.E. and Fayard, A-L. HCI, Natural Science and Design: A Framework for Triangulation Across Disciplines. In Proc. ACM DIS '97, Amsterdam, PaysBas: ACM/SIGCHI (1997), 223--234.  ",
      "doi": "10.1145/263552.263612"
    },
    {
      "text": "Majaj, N.J., Pelli, D.G., Kurshan, P. & Palomares, M. The role of spatial frequency channels in letter identification. Vision Research 42, 1165--1184, 2002.",
      "doi": ""
    },
    {
      "text": "McConkie, G.W. & Rayner, K. The span of the effective stimulus during a fixation in reading. Perception & Psychophysics 17: 578--586. 1975.",
      "doi": ""
    },
    {
      "text": "www.microsoft.com/typography/web/fonts/verdana/",
      "doi": ""
    },
    {
      "text": "Nazir, T.A., Heller, D. & Sussmann, C. Letter visibility and word recognition:The optimal viewing position in printed words. Perception & Psychophysics 52(3): 315328, 1992.",
      "doi": ""
    },
    {
      "text": "Nazir, T.A., O'Reagan, J.K. & Jacobs, A.M. On words and their letters. Bulletin of Psychonomic Society 29(2), 171--174, 1991.",
      "doi": ""
    },
    {
      "text": "Palanque, P., Basnyat, S., Bernhaupt, R., Boring, R., Johnson, C., and Johnson, P.Beyond, usability for safety critical systems: how to be sure (safe, usable, reliable, and evolvable)? In CHI '07, ACM Press (2007), 21332136.  ",
      "doi": "10.1145/1240866.1240966"
    },
    {
      "text": "Pelli, D.G., Farell, B. & Moore, D.C. The remarkable inefficiency of word recognition. Nature 423, 752--756, 2003.",
      "doi": ""
    },
    {
      "text": "Reicher, G.M.. Perceptual recognition as a function of meaningfulness of stimulus material.Journal of Experimental Psychology, 81, 274--280, 1969.",
      "doi": ""
    },
    {
      "text": "Rubinstein, R. Digital Typography: an Introduction to Type and Composition for Computer System Design. AddisonWesley Longman Publishing Co., Inc. 1988. ",
      "doi": "10.5555/42470"
    },
    {
      "text": "Sere, B., Marendaz, C. & Herault, J. Nonhomogeneous resolution of images of natural scenes. Perception 29(12): 1403--1412, 2000.",
      "doi": ""
    },
    {
      "text": "Thurstone, L.L. A law of comparative judgement. Psychological Review 34: 278--286, 1927.",
      "doi": ""
    },
    {
      "text": "Wickens, C.D. & Hollands, J.G. Engineering Psychology and Human Performance. 3rd ed., Prentice Hall, New Jersey, 1999.",
      "doi": ""
    }
  ]
}