{
  "doi": "10.1145/2207676.2207771",
  "title": "Beyond energy monitors: interaction, energy, and emerging energy systems",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "665-674",
  "year": 2012,
  "badges": [],
  "abstract": "Motivated by a recent surge of research related to energy and sustainability, this paper presents a review of energy-related work within HCI as well as from literature outside of HCI. Our review of energy-related HCI research identifies a central cluster of work focused on electricity consumption feedback (ECF). Our review of literature outside of HCI highlights a number of emerging energy systems trends of strong relevance to HCI and interaction design, including smart grid, demand response, and distributed generation technologies. We conclude by outlining a range of opportunities for HCI to engage with the experiential, behavioral, social, and cultural aspects of these emerging systems, including highlighting new areas for ECF research that move beyond our field's current focus on energy feedback displays to increase awareness and motivate individual conservation behavior.",
  "tags": [
    "sustainability",
    "electricity",
    "energy",
    "design"
  ],
  "authors": [
    {
      "name": "James Pierce",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    },
    {
      "name": "Eric Paulos",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Allane, K. & Saari, A. 2006. Distributed generation and sustainable development. Renew. & sust. energy rev. 10(6).",
      "doi": ""
    },
    {
      "text": "Amsel, N. & Tomlinson, B. 2010. Green tracker: a tool for estimating the energy consumption of software. CHI EA '10.  ",
      "doi": "10.1145/1753846.1753981"
    },
    {
      "text": "Backlund, S. et al. 2006. Static! The aesthetics of energy in everyday things. Proc. of DRSIC.",
      "doi": ""
    },
    {
      "text": "Badshah, A., Gupta, S., Cohn, G., Villar, Hodges, S. & Patel, S. 2011. Interactive generator: a self-powered haptic feedback device. CHI '11.  ",
      "doi": "10.1145/1978942.1979240"
    },
    {
      "text": "Bang, M., Gustafsson, A., Katzeff, C. 2007. Promoting new patterns in household energy consumption with pervasive learning games. Persuasive'07. ",
      "doi": "10.5555/1780402.1780412"
    },
    {
      "text": "Blevis, E. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. CHI '07.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Broms, L., Katzeff, C., Bång, M, Nyblom, A., Hjelm, S. & Ehrnberger, K. 2010. Coffee maker patterns and the design of energy feedback artefacts. DIS '10.  ",
      "doi": "10.1145/1858171.1858191"
    },
    {
      "text": "Busse, D. 2011. Who Needs Energy Management? Reducing Energy Consumption in Manufacturing Industries - Early Results of Research into Industrial Energy Management Users. CHI EA '11.  ",
      "doi": "10.1145/1979742.1979821"
    },
    {
      "text": "Byrne, J. et al. 2009. Relocating energy in the social commons: Ideas for a sustainable energy utility. Bulletin of science, technology and society, 29(2):81--94.",
      "doi": ""
    },
    {
      "text": "Chetty, M., Tran, D. & Grinter, R. 2008. Getting to green: understanding resource consumption in the home. UbiComp '08.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Chetty, M., Brush, A. J., Meyers, B. & Johns, P.. 2009. It's not easy being green: understanding home computer power management. Proc. CHI '09. 1033--1042.  ",
      "doi": "10.1145/1518701.1518860"
    },
    {
      "text": "Davito et al. 2010. McKinsey on Smart Grid: The smart grid and the promise of demand-side management.",
      "doi": ""
    },
    {
      "text": "Devine-Wright, P. 2006. Energy citizenship: psychological aspects of evolution in sustainable energy technologies. In J. Murphy (ed.) Governance of Sustainable Technology.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T., Mankoff, J., Paulos, E. 2010. Understanding Conflict Between Landlords and Tenants: Implications for Energy Sensing and Feedback. UbiComp '10.  ",
      "doi": "10.1145/1864349.1864376"
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. 2010. Mapping the landscape of sustainable HCI. CHI '10.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Donelan, J. M et al. 2008. Biomechanical energy harvesting: Generating electricity during walking with minimal user effort. Science, 319:807--810.",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2010. HCI and environmental sustainability: the politics of design and the design of politics. DIS '10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "EPRI. 2011. Estimating the Costs and Benefits of the Smart Grid - A Preliminary Estimate of the Investment Requirements for a Fully Functioning Smart Grid.",
      "doi": ""
    },
    {
      "text": "Fallman, D. 2011. The new good: exploring the potential of philosophy of technology to contribute to human-computer interaction. CHI '11.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Foster, D., Lawson, S., Blythe, M., & Cairns, P. 2010. Wattsup?: motivating reductions in domestic energy consumption using social networks. NordiCHI '10.  ",
      "doi": "10.1145/1868914.1868938"
    },
    {
      "text": "Fitzpatrick, G., Smith, G. 2009. Technology-enabled feedback on domestic energy consumption: articulating a set of design concerns. Perv. Computing, 8(1):37--44.  ",
      "doi": "10.1109/MPRV.2009.17"
    },
    {
      "text": "Froehlich, J., Findlater, L., & Landay, J. 2010. The design of eco-feedback technology. In Proc. CHI '10.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Gustafsson, A. & Gyllenswärd, M. 2005. The poweraware cord: energy awareness through ambient information display. CHI EA '05.  ",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Ham, J., Midden, C., and Beute, F. (2009). Can ambient persuasive technology persuade unconsciously? Using subliminal feedback to influence energy consumption ratings of household appliances. Persuasive '09.  ",
      "doi": "10.1145/1541948.1541988"
    },
    {
      "text": "Hammerstrom, D. et al. 2007. Pacific Northwest GridWise(TM) Testbed Demonstration Projects: Part I. Olympic Peninsula Project. Richland, Washington, Pacific Northwest National Laboratory.",
      "doi": ""
    },
    {
      "text": "Harter, T., Vroegindeweij, S., Geelhoed, E., Manahan, M., & Ranganathan, P. 2004. Energy-aware user interfaces: an evaluation of user acceptance. CHI'04.  ",
      "doi": "10.1145/985692.985718"
    },
    {
      "text": "He, H., Greenberg, S. & Huang, E. 2010. One size does not fit all: applying the transtheoretical model to energy feedback technology design. CHI '10.  ",
      "doi": "10.1145/1753326.1753464"
    },
    {
      "text": "Heller, F. & Jan Borchers. 2011. PowerSocket: towards on-outlet power consumption visualization. CHI EA '11.  ",
      "doi": "10.1145/1979742.1979901"
    },
    {
      "text": "Hirsch, T. & Anderson, K. 2010. Cross currents: water scarcity and sustainable CHI. CHI EA '10.  ",
      "doi": "10.1145/1753846.1753871"
    },
    {
      "text": "Hledick, R. 2009. How green is the smart grid? Electricity, 22(3).",
      "doi": ""
    },
    {
      "text": "Holmes, T. G. Eco-visualization: combining art and technology to reduce energy consumption. C& C '07.  ",
      "doi": "10.1145/1254960.1254982"
    },
    {
      "text": "Hughes, T. 1983. Networks of power. John Hopkins.",
      "doi": ""
    },
    {
      "text": "Johnson, L., Broms, L. & Katzeff, C. 2010. Watt-Lite: energy statistics made tangible. DIS '10.  ",
      "doi": "10.1145/1858171.1858214"
    },
    {
      "text": "Kim, T., Hong, H., & Magerko, B. Coralog: use-aware visualization connecting human micro-activities to environmental change. Proc. CHI EA '09.  ",
      "doi": "10.1145/1520340.1520657"
    },
    {
      "text": "Kim, T., Hong, H., & Magerko, B. 2010. Design requirements for ambient display that supports sustainable lifestyle. Proc. DIS '10.  ",
      "doi": "10.1145/1858171.1858192"
    },
    {
      "text": "Kim, Y. Schmid, Charbiwala, & Srivastava. 2009. ViridiScope: design and implementation of a fine grained power monitoring system for homes. UbiComp '09.  ",
      "doi": "10.1145/1620545.1620582"
    },
    {
      "text": "Lehrer, D. & Vasudev, J. 2011. Evaluating a social media application for sustainability in the workplace. CHI EA '11.  ",
      "doi": "10.1145/1979742.1979935"
    },
    {
      "text": "Lovins, A. 1977. Soft energy paths. Penguin.",
      "doi": ""
    },
    {
      "text": "Monigatti, P., Apperley, M., & Rogers, B. 2010. Power and energy visualization for the micro-management of household electricity consumption. AVI '10.  ",
      "doi": "10.1145/1842993.1843052"
    },
    {
      "text": "Nathan, L. 2008. Ecovillages, Values, and Information Technology: Balancing Sustainability with Daily Life in 21st Century America. CHI EA '08.  ",
      "doi": "10.1145/1358628.1358920"
    },
    {
      "text": "Paradiso, J. & Starner, T. 2005. Energy scavenging for mobile and wireless electronics, IEEE Perv. Comput.  ",
      "doi": "10.1109/MPRV.2005.9"
    },
    {
      "text": "Patel, S., Gupta, S. & Reynolds, M. 2010. The design and evaluation of an end-user-deployable, whole house, contactless power consumption sensor. CHI '10.  ",
      "doi": "10.1145/1753326.1753700"
    },
    {
      "text": "Petersen, D. et al. 2009. WattBot: a residential electricity monitoring and feedback system. CHI EA '09.  ",
      "doi": "10.1145/1520340.1520413"
    },
    {
      "text": "Petkov, P., Köbler, F., Foth, M., Medland, R. & Krcmar, H. 2011. Engaging energy saving through motivationspecific social comparison. CHI EA '11. 1945--1950.  ",
      "doi": "10.1145/1979742.1979855"
    },
    {
      "text": "Pierce, J., Odom, W., Blevis, E. 2008. Energy Aware Dwelling: A Critical Survey of Interaction Design for Eco-Visualizations. Proc. OZCHI '08, 2008.  ",
      "doi": "10.1145/1517744.1517746"
    },
    {
      "text": "Pierce, J., Schiano, D., & Paulos, E. 2010. Home, habits and energy: examining domestic interactions and energy consumption. CHI '11.  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Pierce et al. 2010. Some consideration on the (in)effectiveness of energy feedback systems. DIS '10.  ",
      "doi": "10.1145/1858171.1858215"
    },
    {
      "text": "Pierce & Paulos. 2010. Materializing energy. DIS '10.  ",
      "doi": "10.1145/1858171.1858193"
    },
    {
      "text": "Pierce, J. & Paulos, E. A phenomenology of humanelectricity relations. CHI '11.  ",
      "doi": "10.1145/1978942.1979293"
    },
    {
      "text": "Potter, C et al. 2009. Building a smarter smart grid through better renewable energy information. IEEEPES Power Systems Conference and Exposition.",
      "doi": ""
    },
    {
      "text": "Quintal, F., Nunes, N., Ocneanu, A. & Berges, M. 2010. SINAIS: home consumption package: a low-cost ecofeedback energy-monitoring research platform. DIS '10.  ",
      "doi": "10.1145/1858171.1858252"
    },
    {
      "text": "Ramchurn, S. et al. 2011. Putting the ''Smarts'' into the Smart Grid: A Grand Challenge for Artificial Intelligence. Communications of the ACM . (In Press)  ",
      "doi": "10.1145/2133806.2133825"
    },
    {
      "text": "Riche, Y., Dodge, J. & Metoyer, R. 2010. Studying always-on electricity feedback in the Home. CHI '10.  ",
      "doi": "10.1145/1753326.1753628"
    },
    {
      "text": "Rodgers, J. & Bartram, L. 2010. ALIS: an interactive ecosystem for sustainable living. Ubicomp '10.  ",
      "doi": "10.1145/1864431.1864467"
    },
    {
      "text": "Schwartz, T., Betz, M., Ramirez, L., & Stevens, G. 2010. Sustainable energy practices at work: understanding the role of workers in energy conservation. NordiCHI '10.  ",
      "doi": "10.1145/1868914.1868966"
    },
    {
      "text": "Shove, E. 2003. Comfort, cleanliness and convenience: the social organisation of normality. Berg.",
      "doi": ""
    },
    {
      "text": "Shove E. 2010. Beyond the ABC: climate change policy and theories of social change, Env. and Planning, 42.",
      "doi": ""
    },
    {
      "text": "Shrubsole, P. et al. 2011. Flo: raising family awareness about electricity use. CHI EA '11.  ",
      "doi": "10.1145/1979742.1979665"
    },
    {
      "text": "Sohn, M. et al. 2009. Designing with unconscious human behaviors for eco-friendly interaction. CHI EA '09.  ",
      "doi": "10.1145/1520340.1520375"
    },
    {
      "text": "Strengers, Y. 2008. Smart metering demand management programs: challenging the comfort and cleanliness habitus of households. OZCHI '08.  ",
      "doi": "10.1145/1517744.1517747"
    },
    {
      "text": "Strengers, Y. 2011. Designing eco-feedback systems for everyday life. CHI '11.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Tatum, J. 1994. Technology and value: getting beyond the 'device paradigm' impasse. Science, Tech. and Hum. Values, 19:70--87.",
      "doi": ""
    },
    {
      "text": "Torriti, J., Hassan, M., Leach, M. 2009. Demand response experience in Europe: Policies, programmes and implementation. Energy, 35(4): 1575--1583.",
      "doi": ""
    },
    {
      "text": "US DOE (2006). Benefits of demand response in electricity markets and recommendations for achieving them. February 2006.",
      "doi": ""
    },
    {
      "text": "Vaitheeswaran, V. 2003. Power to the People: How the Coming Energy Revolution Will Transform an Industry, Change Our Lives, and Maybe Even Save the Planet.",
      "doi": ""
    },
    {
      "text": "Vawter, N. 2010. Exertion music. Unpublished PhD thesis.",
      "doi": ""
    },
    {
      "text": "Villar, N. & Hodges, S. 2010. The peppermill: a humanpowered user interface device. Proc. TEI '10.  ",
      "doi": "10.1145/1709886.1709893"
    },
    {
      "text": "Watson et al. 2006. Unlocking the power house: policy and system change for domestic microgeneration in the UK.",
      "doi": ""
    },
    {
      "text": "Wilson, C. & Dowlatabadi, H. 2007. Models of Decision Making and Residential Energy Use. Annual Review of Environment and Resources, 32.",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Hasbrouck, J., Augustin, S. 2008. A bright green perspective on sustainable choices. CHI '08.  ",
      "doi": "10.1145/1357054.1357109"
    },
    {
      "text": "Yun, T. 2009. Investigating the impact of a minimalist in-home energy consumption display. CHI EA'09.  ",
      "doi": "10.1145/1520340.1520676"
    },
    {
      "text": "Zareipour et al. 2004. Distributed Generation: Current Status and Challenges. IEEE Proc. of NAPS '04.",
      "doi": ""
    }
  ]
}