{
  "doi": "10.1145/2207676.2208334",
  "title": "Rock-paper-fibers: bringing physical affordance to mobile touch devices",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1929-1932",
  "year": 2012,
  "badges": [],
  "abstract": "We explore how to bring physical affordance to mobile touch devices. We present Rock-Paper-Fibers, a device that is functionally equivalent to a touchpad, yet that users can reshape so as to best match the interaction at hand. For efficiency, users interact bimanually: one hand reshapes the device and the other hand operates the resulting widget. We present a prototype that achieves deformability using a bundle of optical fibers, demonstrate an audio player and a simple video game each featuring multiple widgets. We demonstrate how to support applications that require responsiveness by adding mechanical wedges and clamps.",
  "tags": [
    "tangible",
    "reconfigurable",
    "input device",
    "optical fiber",
    "mobile",
    "gesture",
    "malleable",
    "wearable",
    "ubicomp"
  ],
  "authors": [
    {
      "name": "Frederik Rudeck",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460656798",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P. Becker, T, and Rudeck, F. Lumino: tangible blocks for tabletop computers based on Glass fiber bundles. In Proc. CHI '10, pp. 1165--1174.  ",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "Fitzmaurice, W., Ishii, H., and Buxton, W. Bricks: laying the foundations for graspable user interfaces. In Proc. CHI '9 pp. 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Harrison, C. and Hudson, S. E. Providing dynamically changeable physical buttons on a visual display. In Proc. CHI '09, pp. 299--308.  ",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. Skinput: appropriating the body as an input surface. In Proc. CHI '10, pp. 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Lahey, B., Girouard, A., Burleson, W. and Vertegaal, V. PaperPhone: Understanding the Use of Bend Gestures in Mobile Devices with Flexible Electronic Paper Displays. In Proc. CHI '11, pp. 1303--1312.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "OpenCV http://opencv.willowgarage.com",
      "doi": ""
    },
    {
      "text": "Pangaro, G., Maynes-Aminzade, D., Ishii, H. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proc. UIST '02, pp. 181--190.  ",
      "doi": "10.1145/571985.572011"
    },
    {
      "text": "Rekimoto, J. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In Proc. CHI '02, pp. 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Rekimoto, J., Ullmer, B., and Oba, H. DataTiles: A modular platform for mixed physical and graphical interactions, In Proc. CHI '01, pp. 269--276.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "Roudaut, A., Pohl, H., and Baudisch, P. Touch on curved surfaces. In Proc. CHI '11, pp. 1011--1020.  ",
      "doi": "10.1145/1978942.1979094"
    },
    {
      "text": "Schwarz, J., Harrison, C., Hudson, S., Mankoff, J. Cord input: an intuitive, high-accuracy, multi-degree-of-freedom input method for mobile devices. In Proc. CHI '10, pp. 1657--1660.  ",
      "doi": "10.1145/1753326.1753573"
    },
    {
      "text": "Schwesig, C., Poupyrev, I., Mori, E.: Gummi: a bendable computer. In Proc. CHI '04, pp. 263--270.  ",
      "doi": "10.1145/985692.985726"
    },
    {
      "text": "Scott, J., Brown, L., and Molloy, M. Mobile Device Interaction with Force Sensing. In Proc. Pervasive '09, pp. 133--150.  ",
      "doi": "10.1007/978-3-642-01516-8_10"
    },
    {
      "text": "Song, H., Benko, H., Guimbretière, F., Izadi, S., Cao, X., Hinckley, K. Grips and gestures on a multi-touch pen. In Proc. CHI '11, pp. 1323--1332.  ",
      "doi": "10.1145/1978942.1979138"
    },
    {
      "text": "Taylor, B. T. and Bove, V. M. Graspables: grasp-recognition as a user interface. In Proc CHI '09. pp. 917--926.  ",
      "doi": "10.1145/1518701.1518842"
    },
    {
      "text": "Weiss, M., Wagner, J., Jansen, Y., Jennings, R., Khoshabeh, R., Hollan, J., and Borchers, J. SLAP widgets: bridging the gap between virtual and physical controls on tabletops. In Proc. CHI '09, pp. 481--490.  ",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "Wimmer, R. FlyEye: grasp-sensitive surfaces using optical fiber. In Proc TEI '10, pp. 245--248.  ",
      "doi": "10.1145/1709886.1709935"
    },
    {
      "text": "Wimmer, R., and Baudisch, P. Modular and deformable touch-sensitive surfaces based on time domain reflectometry. In Proc. UIST '11, pp. 517--526.  ",
      "doi": "10.1145/2047196.2047264"
    },
    {
      "text": "Wobbrock, J., Wilson, A. and Li, Y. Gestures without libraries, toolkits or training: A $1 recognizer for user interface prototypes. Proc. UIST '07, pp. 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}