{
  "doi": "10.1145/2207676.2208341",
  "title": "Bridging between organizations and the public: volunteer coordinators' uneasy relationship with social computing",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1967-1976",
  "year": 2012,
  "badges": [],
  "abstract": "We present the results of a qualitative study of the use of social computing technologies by volunteer coordinators at nonprofit organizations. The work of volunteer coordinators is bridge-building work - bringing together numerous public constituencies as well as constituencies within their organizations. One might expect this class of work to be well supported by social software, some of which has been found to enable bridging social capital. However, we find that, in many ways, this class of technology fails to adequately support volunteer coordinators' bridge-building work. We discuss a number of strategies for bridge-building via social computing technologies, numerous challenges faced by volunteer coordinators in their use of these technologies, and opportunities for designing social software to better support bridge-building between organizations and the public.",
  "authors": [
    {
      "name": "Amy Voida",
      "institution": "University of California, Irvine, Irvine, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100147309",
      "orcid": "missing"
    },
    {
      "name": "Ellie Harmon",
      "institution": "University of California, Irvine, Irvine, California, United States",
      "img": "/do/10.1145/contrib-81328488651/rel-imgonly/me_jtree.jpeg",
      "acmid": "81328488651",
      "orcid": "missing"
    },
    {
      "name": "Ban Al-Ani",
      "institution": "University of California, Irvine, Irvine, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319487517",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brainard, L. A. & Brinkerhoff, J. M. (2004). Lost in cyberspace: Shedding light on the dark matter of grassroots organizations. Nonprofit and Voluntary Sector Quarterly, 33(3), 32S--53S.",
      "doi": ""
    },
    {
      "text": "Brudney, J. L. (1994). Designing and managing volunteer programs. In R. D. Herman (Ed.), The Jossey-Bass Handbook of Nonprofit Leadership and Management (pp. 279--302). San Francisco: Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Corbin, J. & Strauss, A. (2008). Basics of qualitative research: Techniques and procedures for developing grounded theory (3rd ed.). Los Angeles: Sage Publications.",
      "doi": ""
    },
    {
      "text": "DiMicco, J., Millen, D. R., Geyer, W., Dugan, C., Brownholtz, B. & Muller, M. (2008). Motivations for social networking at work. In Proc. CSCW 2008. New York: ACM Press, 711--720.  ",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "Efimova, L. & Grudin, J. (2007). Crossing boundaries: A case study of employee blogging. In Proc. HICSS 40. Los Alamitos, CA: Computer Society Press, 86a.  ",
      "doi": "10.1109/HICSS.2007.159"
    },
    {
      "text": "Ehrlich, K. & Shami, N. S. (2010). Microblogging inside and outside the workplace. In Proc. ICWSM 2010. Palo Alto, CA: AAAI Press, 42--49.",
      "doi": ""
    },
    {
      "text": "Ellison, N. B., Steinfield, C. & Lampe, C. (2007). The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication, 12(4), Article 1.",
      "doi": ""
    },
    {
      "text": "Goecks, J., Voida, A., Voida, S. & Mynatt, E. D. Charitable technologies: Opportunities for collaborative computing in nonprofit fundraising. In Proc. CSCW 2008. New York: ACM Press, 689--698.  ",
      "doi": "10.1145/1460563.1460669"
    },
    {
      "text": "Ingenhoff, D. & Koelling, A. M. (2009). The potential of web sites as a relationship building tool for charitable fundraising NPOs. Public Relations Review, 35(1), 66--73.",
      "doi": ""
    },
    {
      "text": "Jackson, A., Yates, J. & Orlikowski, W. (2007). Corporate blogging: Building community through persistent digital talk. In Proc. HICSS 40. Los Alamitos, CA: Computer Society Press, 80.  ",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "Kenix, L. J. (2008). Nonprofit organizations' perceptions and uses of the Internet. Television & New Media, 9, 407--428.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C. A. & Edwards, W. K. The view from the trenches: Organization, power, and technology at two nonprofit homeless outreach centers. In Proc. CSCW 2008, New York: ACM Press, 589--598.  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "McPhail, B., Constantino, T., Bruckmann, D., Barclay, R. & Clement, A. (1998). CAVEAT exemplar: Participatory design in a nonprofit volunteer organisation. Computer Supported Cooperative Work 7(3-4), 223--241. ",
      "doi": "10.1023/A%3A1008631020266"
    },
    {
      "text": "Merkel, C., Farooq, U., Xiao, L., Ganoe, C., Rosson, M. B. & Carroll, J. M. (2007). Managing technology use and learning in nonprofit community organizations: Methodological challenges and opportunities. In Proc. CHIMIT 2007. New York: ACM Press, Article 8.  ",
      "doi": "10.1145/1234772.1234783"
    },
    {
      "text": "Nardi, B., Whittaker, S. & Schwarz, H. (2002). NetWORKers and their activity in intensional network. Computer Supported Cooperative Work 11(1-2), 205--242.  ",
      "doi": "10.1023/A%3A1015241914483"
    },
    {
      "text": "National Center for Charitable Statistics. (1999). National taxonomy of exempt entities. Retrieved from: http://nccs.urban.org/classification/NTEE.cfm",
      "doi": ""
    },
    {
      "text": "Putnam, R. D. (2000). Bowling alone: The collapse and revival of American community. New York: Simon & Schuster.",
      "doi": ""
    },
    {
      "text": "Skeels, M. M., & Grudin, J. (2009). When social networks cross boundaries: A case study of workplace use of Facebook and LinkedIn. In Proc. GROUP 2009. New York: ACM Press, 95--104.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Starbird, K. & Palen, L. (2011). \"Voluntweeters\": Self-organizing by digital volunteers in times of crisis. In Proc. CHI 2011. New York: ACM Press, 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Steinfield, C., DiMicco, J. M., Ellison, N. B. & Lampe, C. (2009). Bowling online: Social networking and social capital within the organization. In Proc. C&T 2009. New York: ACM Press, 245--254.  ",
      "doi": "10.1145/1556460.1556496"
    },
    {
      "text": "Voida, A., Harmon, E. & Al-Ani, B. (2011). Homebrew databases: Complexities of everyday information management in nonprofit organizations. In Proc. CHI 2011. New York: ACM Press, 915--924.  ",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Waters, R., Burnett, E., Lamm, A., & Lucas, J. (2009). Engaging stakeholders through social networking: How nonprofit organizations are using Facebook. Public Relations Review, 35(2), 102--106.",
      "doi": ""
    }
  ]
}