{
  "doi": "10.1145/2207676.2208675",
  "title": "'Timid encounters': a case study in the use of proximity-based mobile technologies",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2759-2768",
  "year": 2012,
  "badges": [],
  "abstract": "We report a comparative ethnographic study of a proximity-based mobile 'video game' (Dragon Quest 9) in Japan: the Nintendo DS game terminals may 'recognize' one another and allow players to exchange game resources when they are close to one another. Because different communication infrastructures are available, situations of encounter are shown to be potentially seamful and to support multi-layered participation frames. Our observations show a variety of encounter formats, among whom 'timid' encounters are the most characteristic of the kind of sociality which may develop in urban public places turned into proximity-sensitive 'hybrid ecologies' The normative order which governs such encounters is marked by a tension between the minimality expected of encounters with strangers in urban spaces, and the concern for identification and focused interaction that derives from being engaged in proximal digital communication. These empirical observations and framework of analysis offer insights for the design and the understanding of proximity-based mobile technologies.",
  "authors": [
    {
      "name": "Christian Licoppe",
      "institution": "Telecom Paristech, Paris, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100462633",
      "orcid": "missing"
    },
    {
      "name": "Yoriko Inada",
      "institution": "Telecom Paristech, Paris, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309483316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, G., & Dourish, P. Yesterday's tomorrows: notes on ubiquitous computing's dominant vision. Personal & Ubiquitous Computing 11, 2 (2007), 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Chalmers, M. & Galani, A. Seamful Interweaving: Heterogeneity in the Theory and Design of Interactive Systems. Proc. ACM DIS 2004, ACM Press (2004), 243252.  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Crabtree, A., & Rodden, T. Hybrid Ecologies: Understanding Cooperative Interaction in Emerging Physical-Digital Environments. Personal and Ubiquitous Computing 12 (2008), 481--493.  ",
      "doi": "10.1007/s00779-007-0142-7"
    },
    {
      "text": "De Souza e Silva, A., & Frith, J. Locative Mobile Social Networks: Mapping Communication and Location in Urban Spaces. Mobilities 5, 4 (2010), 485--505.",
      "doi": ""
    },
    {
      "text": "De Souza e Silva, A., & Hjorth, L. Playful urban spaces: A historical approach to mobile games. Simulation & Gaming 40, 5 (2009), 602--625.  ",
      "doi": "10.1177/1046878109333723"
    },
    {
      "text": "Goffman, E. Behavior in Public Places. Free Press, New York, USA, 1963.",
      "doi": ""
    },
    {
      "text": "Goffman, E. Relations in Public. Microstructure of the Public Order. Harper & Row, New York, USA, 1971.",
      "doi": ""
    },
    {
      "text": "Goffman, E. Frame Analysis. An Essay on the Organization of Experience. Harper & Row, New York, USA, 1974.",
      "doi": ""
    },
    {
      "text": "Hannerz, U. Exploring the City: Inquiries towards an Urban Anthropology. Columbia University Press, New York, USA, 1980.",
      "doi": ""
    },
    {
      "text": "Hindmarsh, J., Heath, C., Von Lehn, D. & Cleverly, J. Creating Assemblies in Public Environments: Social Interaction, Interactive Exhibits and CSCW. Computer Supported Creative Work 14 (2005), 1--41.  ",
      "doi": "10.1007/s10606-004-1814-8"
    },
    {
      "text": "Joseph, I. L'espace public et le visible. Architecture & Comportement 9, 3 (1993), 397--401.",
      "doi": ""
    },
    {
      "text": "Joseph, I. Activité située et régimes de disponibilité. Raisons Pratiques 10 (1999), 157--172.",
      "doi": ""
    },
    {
      "text": "Licoppe, C., & Inada, Y. (2006). Emergent Uses of a Location Aware Multiplayer Game : The Interactional Consequences of Mediated Encounters. Mobilities 1, 1 (2006), 39--61.",
      "doi": ""
    },
    {
      "text": "Licoppe, C., & Inada, Y. Locative media and cultures of mediated proximity: the case of the Mogi game locationaware community. Environment and Planning D: Society and Space 28, 4 (2010), 691--709.",
      "doi": ""
    },
    {
      "text": "Lindtner, S., Nardi, B., Wang, Y., Mainwaring, S., Jing, H. & Liang, W. A Hybrid Cultural Ecology: World of Warcraft in China. Proc. CSCW'08, ACM Press (2008), 371--382.  ",
      "doi": "10.1145/1460563.1460624"
    },
    {
      "text": "Lofland, L. A World of Strangers. Order and Action in Urban Public Space. Waveland Press, Prospect Heights, USA, 1973.",
      "doi": ""
    },
    {
      "text": "Lofland, L. The Public Realm. Exploring the City's Quintessential Social Territory. Aldine de Gruyter, NY, USA, 1998.",
      "doi": ""
    },
    {
      "text": "Richardson, I. Ludic Mobilities: The Corporealities of Mobile Gaming. Mobilities 5, 4 (2010), 431--447.",
      "doi": ""
    },
    {
      "text": "Richarson, I., & Wilken, R. Haptic Vision, Footwork, Place Making: A Peripatetic Phenomenology of the Mobile Phone Pedestrian. Second Nature 2 (2009), 23--39.",
      "doi": ""
    },
    {
      "text": "Sacks, H. Collected Lectures. Cambridge University Press, Cambridge, UK, 1992.",
      "doi": ""
    },
    {
      "text": "Soderlund, T. Proximity Gaming: New Forms of Wireless Gaming. In A. de Souza e Silva & D. Sutko (Eds). Digital Cityscapes. Merging Digital and Urban Playspaces, Peter Lang, New York, USA (2010), 217230.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The computer for the 21st century. Scientific American 285 (1991), 94--104.",
      "doi": ""
    }
  ]
}