{
  "doi": "10.1145/2207676.2208302",
  "title": "Vignette: interactive texture design and manipulation with freeform gestures for pen-and-ink illustration",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1727-1736",
  "year": 2012,
  "badges": [],
  "abstract": "Vignette is an interactive system that facilitates texture creation in pen-and-ink illustrations. Unlike existing systems, Vignette preserves illustrators' workflow and style: users draw a fraction of a texture and use gestures to automatically fill regions with the texture. We currently support both 1D and 2D synthesis with stitching. Our system also has interactive refinement and editing capabilities to provide a higher level texture control, which helps artists achieve their desired vision. A user study with professional artists shows that Vignette makes the process of illustration more enjoyable and that first time users can create rich textures from scratch within minutes.",
  "tags": [
    "sketch based interaction",
    "texture design and manipulation",
    "pen-and-ink illustration"
  ],
  "authors": [
    {
      "name": "Rubaiat Habib Kazi",
      "institution": "National University of Singapore & JST ERATO Igarashi Design Interface Project, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645237",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "JST ERATO Igarashi Design Interface Project & The University of Tokyo, Bunkyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    },
    {
      "name": "Richard Davis",
      "institution": "Singapore Management University, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81416597118/rel-imgonly/2011-rcdavis-mugshot.jpg",
      "acmid": "81416597118",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barla P, Breslav S, Thollot J, Sillion F and Markosian L. Learning Style Translation for the Style of a Drawing. ACM Transactions of Graphics 22,1 (2003), 33--46.  ",
      "doi": "10.1145/588272.588277"
    },
    {
      "text": "Barla, P., Breslav, S., Thollot, J. and Markosian, L. Interactive hatching and stippling by example. INRIA Technical Report (2006).",
      "doi": ""
    },
    {
      "text": "Deussen, O., Hiller, S., Overveld, C. and Strothotte, T. Floating Points: A Method for Computing Stipple Drawings. IEEE Computer Graphics Forum 19,3 (2000), 41--50",
      "doi": ""
    },
    {
      "text": "Efros, A.A. AND Freeman W.T. Image quilting for Texture Synthesis and Transfer. In Proc. ACM SIGGRAPH (2001), 341--346.  ",
      "doi": "10.1145/383259.383296"
    },
    {
      "text": "Efros, A.A. and Leung, T.K. Texture Synthesis by Nonparametric sampling. IEEE Computer Vision Vol.2 (1999), 1033--1038 ",
      "doi": "10.5555/850924.851569"
    },
    {
      "text": "Gröller, E. and Szirmay-Kalos, L. Stroke Pattern Analysis and Synthesis. EUROGRAPHICS, 25 (2006), Number 3",
      "doi": ""
    },
    {
      "text": "Guptill A.L. Rendering with pen and ink. Watsom-Guptill Publications, New York, 1976.",
      "doi": ""
    },
    {
      "text": "Hertzmann, A., Oliver, N., Curless, B., Seitz, S.M. Curve Analogies. In Proc. Rendering Techniques (2002), 233--246. ",
      "doi": "10.5555/581896.581926"
    },
    {
      "text": "Igarashi, T. and Hughes, J.F. Clothing Manipulation In Proc. ACM UIST (2002), 91--100  ",
      "doi": "10.1145/571985.571999"
    },
    {
      "text": "Igarashi, T., Moscovich, T. and Hughes, J.F. As-rigid-aspossible Shape Manipulation. In Proc. ACM SIGGRAPH 24 ,3 (2005), 1134--1141.  ",
      "doi": "10.1145/1186822.1073323"
    },
    {
      "text": "Ijiri, T., Mech, R., Miller, G. and Igarashi, T. An examplebased procedural system for element arrangement. Computer Graphics Forum 27,2 (EUROGRAPHICS 2008), 429--436.",
      "doi": ""
    },
    {
      "text": "Kalnins, R.D., Markosian, L., Meier, B.J., Kowalski, M.A., Lee, J.C., Davidson, P.L., Webb, M., Hughes, J.F. and Finkelstein, A. WYSIWYG NPR: Drawing Strokes Directly on 3D Models. In Proc. ACM SIGGRAPH in Transactions on Graphics 21,3 (2002), 755--762.  ",
      "doi": "10.1145/566654.566648"
    },
    {
      "text": "Kazi, R.H., Chua, K.C., Zhao, S., Davis, R., Lim, K. SandCanvas: A multi-touch art medium inspired by sand animation. ACM CHI 2011. pp. 1283--1292.  ",
      "doi": "10.1145/1978942.1979133"
    },
    {
      "text": "Kopf, J., Fu, C., Chohen-Or, D., Deussen, O., Lischinski, D. and Wong, T. Solid Texture Synthesis from 2D exemplars. In Proc. ACM SIGGRAPH 26, 3 (2007), 21--29.  ",
      "doi": "10.1145/1275808.1276380"
    },
    {
      "text": "Ma, C., Wei, L. and Tong, X. Discrete Element Textures. In Proc. ACM SIGGRAPH 30, 4 (2011), Article 62.  ",
      "doi": "10.1145/1964921.1964957"
    },
    {
      "text": "McCloud, S. Making comics. Harper Paperbacks, 2006.",
      "doi": ""
    },
    {
      "text": "McCloud, S. Understanding Comics. Harper Paperbacks, 1994.",
      "doi": ""
    },
    {
      "text": "Nelson Chu WB, Li-Yi Wei, and Naga Govindaraju. Detailpreserving paint modeling for 3D brushes. NonPhotorealistic Animation and Rendering 2010.  ",
      "doi": "10.1145/1809939.1809943"
    },
    {
      "text": "Nice, C. Drawing in Pen and Ink. North Light Books, 1997.",
      "doi": ""
    },
    {
      "text": "Ryokai K, Marti S, and Ishii H. I/O brush: drawing with everyday objects as ink. In. Proc. of CHI 2004, 303--310.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Salisbury, M., Anderson, S., Barzel, R. and Salesin, D. Interactive pen and ink rendering. In Proc. ACM SIGGRAPH (1994), 101--108.  ",
      "doi": "10.1145/192161.192185"
    },
    {
      "text": "Salisbury, M.P., Wong, M.T., Hughes, J.F. and Salesin, D.H. Orientable Textures for Image-Based Pen-and-Ink Illustration. In Proc. ACM SIGGRAPH (1997), 401--406.  ",
      "doi": "10.1145/258734.258890"
    },
    {
      "text": "Schwarz, M., Isenberg, T., Mason, K. and Carpendale, S. Modeling with Rendering Primitives: An Interactive NonPhoto Realistic Canvas. Non-Photorealistic Animation and Rendering (2007), 15--22.  ",
      "doi": "10.1145/1274871.1274874"
    },
    {
      "text": "Simmons, G. The Technical Pen. Watson-Guptill, 1992.",
      "doi": ""
    },
    {
      "text": "Turk, G. Texture synthesis on surfaces. In Proc. ACM SIGGRAPH (2001), 347 - 354  ",
      "doi": "10.1145/383259.383297"
    },
    {
      "text": "Vandoren P, et al. FluidPaint: an interactive digital painting system using real wet brushes. In. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces 2009, ACM (2009), 53--56.  ",
      "doi": "10.1145/1731903.1731914"
    },
    {
      "text": "Vandoren P, et al. IntuPaint: Bridging the Gap between Physical and Digital Painting. IEEE TABLETOP 2008(2008).",
      "doi": ""
    },
    {
      "text": "Wei, L. and Levoy, M. Fast texture synthesis using treestructured vector quantization. In Proc. ACM SIGGRAPH (2000), 479--488  ",
      "doi": "10.1145/344779.345009"
    },
    {
      "text": "Wei, L., Lefebvre, S., Kwatra, V. and Turk, G. State of the Art in Example-Based Texture Synthesis. Eurographics (2009).",
      "doi": ""
    },
    {
      "text": "Winkenbach, G. and Salesin, D. Computer Generated Pen and Ink illustration. In Proc. ACM SIGGRAPH (1994), 91.  ",
      "doi": "10.1145/192161.192184"
    },
    {
      "text": "Winkenbach, G. and Salesin, D.H. Rendering Parametric Surfaces in Pen and Ink. In Proc. ACM SIGGRAPH in Computer Graphics (1996), 469--476  ",
      "doi": "10.1145/237170.237287"
    },
    {
      "text": "Winnemoller, H., Orzan, A., Boissieux, L. and Thollot, J. Texture Design and Draping in 2D images. Computer Graphics Forum. In Proc. Eurographics 28, 4 (2009), 1091.  ",
      "doi": "10.1111/j.1467-8659.2009.01486.x"
    }
  ]
}