{
  "doi": "10.1145/2207676.2208664",
  "title": "Codelets: linking interactive documentation and example code in the editor",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2697-2706",
  "year": 2012,
  "badges": [],
  "abstract": "Programmers frequently use instructive code examples found on the Web to overcome cognitive barriers while programming. These examples couple the concrete functionality of code with rich contextual information about how the code works. However, using these examples necessitates understanding, configuring, and integrating the code, all of which typically take place after the example enters the user's code and has been removed from its original instructive context. In short, a user's interaction with an example continues well after the code is pasted. This paper investigates whether treating examples as \"first-class\" objects in the code editor - rather than simply as strings of text - will allow programmers to use examples more effectively. We explore this through the creation and evaluation of Codelets. A Codelet is presented inline with the user's code, and consists of a block of example code and an interactive helper widget that assists the user in understanding and integrating the example. The Codelet persists throughout the example's lifecycle, remaining accessible even after configuration and integration is done. A comparative laboratory study with 20 participants found that programmers were able to complete tasks involving examples an average of 43% faster when using Codelets than when using a standard Web browser.",
  "tags": [
    "programming",
    "structured editing",
    "documentation",
    "example"
  ],
  "authors": [
    {
      "name": "Stephen Oney",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81453662914/rel-imgonly/81453662914.jpg",
      "acmid": "81453662914",
      "orcid": "0000-0002-5823-1499"
    },
    {
      "name": "Joel Brandt",
      "institution": "Adobe Systems, San Francisco, California, United States",
      "img": "/do/10.1145/contrib-81351596282/rel-imgonly/joel-brandt-adobe.jpg",
      "acmid": "81351596282",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bergman, L., Castelli, V., Lau, T., and Oblinger, D. DocWizards: A System for Authoring Follow-me Documentation Wizards. In Proc. UIST, (2005), 191--200.  ",
      "doi": "10.1145/1095034.1095067"
    },
    {
      "text": "Brandt, J., Dontcheva, M., Weskamp, M., Klemmer, S. R., and Francisco, S. Example-Centric Programming: Integrating Web Search into the Development Environment. In Proc. CHI, (2010), 513--522.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Brandt, J., Guo, P. J., Lewenstein, J., Dontcheva, M., Klemmer, S. R., and Francisco, S. Two Studies of Opportunistic Programming: Interleaving Web Foraging, Learning, and Writing Code. In Proc. CHI, (2009), 1589--1598.  ",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "Brandt, J., Guo, P. J., Lewenstein, J., and Klemmer, S. R. Opportunistic Programming: Writing Code to Prototype, Ideate, and Discover. In IEEE Software 26, 5 (2009), 18--24.  ",
      "doi": "10.1109/MS.2009.147"
    },
    {
      "text": "Davies, S. P. Externalising information during coding activities: Effects of expertise, environment and task. In Empi Empirical Studies of Programmers (1993), 42--61.",
      "doi": ""
    },
    {
      "text": "Davis, S. and Kiczales, G. Registration-Based Language Abstractions. In Proc. OOPSLA Onward!, (2010), 754--773.  ",
      "doi": "10.1145/1869459.1869521"
    },
    {
      "text": "Eisenberg, A. D. and Kiczales, G. Expressive Programs Through Presentation Extension. In Proc. AOSD, (2007), 73--84.  ",
      "doi": "10.1145/1218563.1218573"
    },
    {
      "text": "Eisenberg, D. S., Stylos, J., and Myers, B. A. Apatite: A New Interface for Exploring APIs. In Proc. CHI, (2010), 1331--1334.  ",
      "doi": "10.1145/1753326.1753525"
    },
    {
      "text": "Fischer, G., Henninger, S., and Redmiles, D. Cognitive tools for locating and comprehending software objects for reuse. In Proc. ICSE, (1991), 318--328. ",
      "doi": "10.5555/256664.256813"
    },
    {
      "text": "Goldman, M. and Miller, R. C. Codetrail: Connecting Source Code and Web Resources. In Proc. VL/HCC, (2009), 223--235.  ",
      "doi": "10.1109/VLHCC.2008.4639060"
    },
    {
      "text": "Green, T. and Petre, M. Usability Analysis of Visual Programming Environments: A Cognitive Dimensions Framework. Journal of Visual Languages and Computing 7, 2 (1996), 131--174.",
      "doi": ""
    },
    {
      "text": "Hartmann, B., Dhillon, M., and Chan, M. K. HyperSource: Bridging the Gap Between Source and Code-Related Web Sites. In Proc. CHI, (2011), 2207--2210.  ",
      "doi": "10.1145/1978942.1979263"
    },
    {
      "text": "Hartmann, B., Doorley, S., and Klemmer, S. R. Hacking, Mashing, Gluing: Understanding Opportunistic Design. Pervasive Computing 7, 3 (2008), 46--54.  ",
      "doi": "10.1109/MPRV.2008.54"
    },
    {
      "text": "Hoc, J. M. and Nguyen-Xuan, A. Language Semantics, Mental Models and Analogy. Psychology of Programming (1990), 139--156.",
      "doi": ""
    },
    {
      "text": "Hoffmann, R., Fogarty, J., and Weld, D. S. Assieme: Finding and Leveraging Implicit References in a Web Search Interface for Programmers. In Proc. UIST, (2007), 13--22.  ",
      "doi": "10.1145/1294211.1294216"
    },
    {
      "text": "Holland, I. M. and Thomas, B. M. Contracts: Specifying Behavioral Compositions in Object-Oriented Systems. In Proc. OOPSLA, (1990), 169--180.  ",
      "doi": "10.1145/97945.97967"
    },
    {
      "text": "Holmes, R., Cottrell, R., Walker, R. J., and Denzinger, J. The end-to-end use of source code examples: An exploratory study. In Proc. ICSE, (2009), 555--558.",
      "doi": ""
    },
    {
      "text": "Knuth, D. E. Literate Programming. CSLI Center for the Study of Language and Information, 1992. ",
      "doi": "10.5555/129057"
    },
    {
      "text": "Ko, A. J. and Myers, B. A. Barista: An Implementation Framework for Enabling New Tools, Interaction Techniques and Views in Code Editors. In Proc. CHI, (2006), 387--396.  ",
      "doi": "10.1145/1124772.1124831"
    },
    {
      "text": "Ko, A. J., Myers, B. A., and Aung, H. H. Six Learning Barriers in End-User Programming Systems. In Proc. VL/HCC, (2004), 199--206.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Kramer, D. API Documentation from Source Code Comments: A Case Study of Javadoc. In Proc. SIGDOC, (1999), 147--153.  ",
      "doi": "10.1145/318372.318577"
    },
    {
      "text": "Lewis, C. and Olson, G. Can principles of cognition lower the barriers to programming? Empirical Studies of Programmers, (1987), 248--263. ",
      "doi": "10.5555/54968.54984"
    },
    {
      "text": "Little, G. and Miller, R. C. Keyword Programming in Java. Automated Software Engineering 16, 1 (2009), 37--71.  ",
      "doi": "10.1007/s10515-008-0041-9"
    },
    {
      "text": "Mandelin, D., Xu, L., Bodik, R., and Kimelman, D. Jungloid Mining: Helping to Navigate the API Jungle. In Proc. PLDI, (2005), 48--61.  ",
      "doi": "10.1145/1065010.1065018"
    },
    {
      "text": "Nykaza, J., Messinger, R., Boehme, F., et al. What Programmers Really Want: Results of a Needs Assessment for SDK Documentation. In Proc. SIGDOC, (2002), 133--141.  ",
      "doi": "10.1145/584955.584976"
    },
    {
      "text": "Omar, C., Yoon, Y., Latoza, T., and Myers, B. Active Code Completion. Ext. Abstracts VL/HCC, (2011), 261--262.",
      "doi": ""
    },
    {
      "text": "Pane, J. F., Myers, B. A., and Miller, L. B. Using HCI Techniques to Design a More Usable Programming System. In Proc. HCC (2002), 198. ",
      "doi": "10.5555/795687.797801"
    },
    {
      "text": "Robillard, M. P., Walker, R. J., and Zimmerman, T. Recommendation Systems for Software Engineering. IEEE Software 27, 4 (2010), 80--86.  ",
      "doi": "10.1109/MS.2009.161"
    },
    {
      "text": "Rosson, M. B. and Carroll, J. M. The Reuse of Uses in Smalltalk Programming. ACM Transactions on Computer-Human Interaction 3, 3 (1996), 219--253.  ",
      "doi": "10.1145/234526.234530"
    },
    {
      "text": "Stylos, J. and Myers, B. A. Mica: A Web-Search Tool for Finding API Components and Examples. In Proc. VL/HCC, (2006), 195--202.  ",
      "doi": "10.1109/VLHCC.2006.32"
    },
    {
      "text": "Stylos, J., Faulring, A., Yang, Z., and Myers, B. Improving API Documentation Using API Usage Information. In Proc. VL/HCC, (2009), 119--126.  ",
      "doi": "10.1109/VLHCC.2009.5295283"
    },
    {
      "text": "Teitelbaum, T. and Reps, T. The Cornell program synthesizer: a syntax-directed programming environment. Communications of the ACM 24, 9 (1981), 563--573.  ",
      "doi": "10.1145/358746.358755"
    },
    {
      "text": "Yeh, R. B. Designing Interactions that Combine Pen, Paper, and Computer. Ph.D. thesis, Stanford University, Computer Science Department. 2008. ",
      "doi": "10.5555/1369304"
    },
    {
      "text": "Google Code Search. http://www.google.com/codesearch",
      "doi": ""
    }
  ]
}