{
  "doi": "10.1145/2207676.2208709",
  "title": "Look & touch: gaze-supported target acquisition",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2981-2990",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While eye tracking has a high potential for fast selection tasks, it is often regarded as error-prone and unnatural, especially for gaze-only interaction. To improve on that, we propose gaze-supported interaction as a more natural and effective way combining a user's gaze with touch input from a handheld device. In particular, we contribute a set of novel and practical gaze-supported selection techniques for distant displays. Designed according to the principle gaze suggests, touch confirms they include an enhanced gaze-directed cursor, local zoom lenses and more elaborated techniques utilizing manual fine positioning of the cursor via touch. In a comprehensive user study with 24 participants, we investigated the potential of these techniques for different target sizes and distances. All novel techniques outperformed a simple gaze-directed cursor and showed individual advantages. In particular those techniques using touch for fine cursor adjustments (MAGIC touch) and for cycling through a list of possible close-to-gaze targets (MAGIC tab) demonstrated a high overall performance and usability.",
  "tags": [
    "mobile touch interaction",
    "gaze-supported interaction",
    "gaze input",
    "target acquisition",
    "selection"
  ],
  "authors": [
    {
      "name": "Sophie Stellmach",
      "institution": "University of Magdeburg, Magdeburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385603177",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "University of Magdeburg, Magdeburg, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Adams, N., Witkowski, M., and Spence, R. The inspection of very large images by eye-gaze control. In Proc. of AVI'08 (2008), 111--118.  ",
      "doi": "10.1145/1385569.1385589"
    },
    {
      "text": "Ashmore, M., Duchowski, A. T., and Shoemaker, G. Efficient eye pointing with a Fisheye lens. In Proc. of Graphics Interface 2005, GI'05 (2005), 203--210. ",
      "doi": "10.5555/1089508.1089542"
    },
    {
      "text": "Bates, R., and Istance, H. Zooming interfaces!: enhancing the performance of eye controlled pointing devices. In Proc. of Assets'02, ACM (2002), 119--126.  ",
      "doi": "10.1145/638249.638272"
    },
    {
      "text": "Bieg, H.-J., Chuang, L. L., Fleming, R. W., Reiterer, H., and Bülthoff, H. H. Eye and pointer coordination in search and selection tasks. In Proc. of ETRA'10, ACM (2010), 89--92.  ",
      "doi": "10.1145/1743666.1743688"
    },
    {
      "text": "Castellina, E., and Corno, F. Multimodal gaze interaction in 3D virtual environments. In COGAIN'08 (2008), 33--37.",
      "doi": ""
    },
    {
      "text": "Cho, S.-J., Choi, C., Sung, Y., Lee, K., Kim, Y.-B., and Murray-Smith, R. Dynamics of tilt-based browsing on mobile devices. In Proc. of CHI'07, ACM (2007), 1947--1952.  ",
      "doi": "10.1145/1240866.1240930"
    },
    {
      "text": "Drewes, H., and Schmidt, A. The MAGIC touch: Combining MAGIC-pointing with a touch-sensitive mouse. In Proc. of INTERACT'09, Springer-Verlag (2009), 415--428.  ",
      "doi": "10.1007/978-3-642-03658-3_46"
    },
    {
      "text": "Fono, D., and Vertegaal, R. EyeWindows: evaluation of eye-controlled zooming windows for focus selection. In Proc. of CHI'05 (2005), 151--160.  ",
      "doi": "10.1145/1054972.1054994"
    },
    {
      "text": "Hansen, D. W., Skovsgaard, H. H. T., Hansen, J. P., and Mollenbach, E. Noise tolerant selection by gaze-controlled pan and zoom in 3D. In Proc. of ETRA'08, ACM (2008), 205--212.  ",
      "doi": "10.1145/1344471.1344521"
    },
    {
      "text": "Hansen, J. P., Johansen, A. S., Hansen, D. W., Ito, K., and Mashino, S. Command without a click: Dwell time typing by mouse and gaze selections. In Proc. of INTERACT'03, IOS Press (2003), 121--128.",
      "doi": ""
    },
    {
      "text": "Jacob, R. J. K. What you look at is what you get: eye movement-based interaction techniques. In Proc. of CHI'90, ACM (1990), 11--18.  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Kabbash, P., and Buxton, W. A. S. The prince technique: Fitts' law and selection using area cursors. In Proc. of CHI'95, ACM Press/Addison-Wesley Publishing Co. (1995), 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Kumar, M., Paepcke, A., and Winograd, T. EyePoint: practical pointing and selection using gaze and keyboard. In Proc. of CHI'07, ACM (2007), 421--430.  ",
      "doi": "10.1145/1240624.1240692"
    },
    {
      "text": "Lankford, C. Effective eye-gaze input into windows. In Proc. of ETRA'00, ACM (2000), 23--27.  ",
      "doi": "10.1145/355017.355021"
    },
    {
      "text": "Miniotas, D. Application of Fitts' law to eye gaze interaction. In Proc. of CHI EA'00, ACM (2000), 339--340.  ",
      "doi": "10.1145/633292.633496"
    },
    {
      "text": "Miniotas, D., Spakov, O., and MacKenzie, I. S. Eye gaze interaction with expanding targets. In Proc. of CHI EA'04, ACM (2004), 1255--1258.  ",
      "doi": "10.1145/985921.986037"
    },
    {
      "text": "Monden, A., Matsumoto, K., and Yamato, M. Evaluation of gaze-added target selection methods suitable for general GUIs. Int. J. Comput. Appl. Technol. 24 (June 2005), 17--24.  ",
      "doi": "10.1504/IJCAT.2005.007201"
    },
    {
      "text": "Salvucci, D. D., and Anderson, J. R. Intelligent gaze-added interfaces. In Proc. of CHI'00, ACM (2000), 273--280.  ",
      "doi": "10.1145/332040.332444"
    },
    {
      "text": "San Agustin, J., Hansen, J. P., and Tall, M. Gaze-based interaction with public displays using off-the-shelf components. In Proc. of Ubicomp'10, ACM (2010), 377--378.  ",
      "doi": "10.1145/1864431.1864444"
    },
    {
      "text": "Skovsgaard, H., Mateo, J. C., Flach, J. M., and Hansen, J. P. Small-target selection with gaze alone. In Proc. of ETRA'10, ACM (2010), 145--148.  ",
      "doi": "10.1145/1743666.1743702"
    },
    {
      "text": "Smith, B. A., Ho, J., Ark, W., and Zhai, S. Hand eye coordination patterns in target selection. In Proc. of ETRA'00, ACM (2000), 117--122.  ",
      "doi": "10.1145/355017.355041"
    },
    {
      "text": "Stellmach, S., Stober, S., Nürnberger, A., and Dachselt, R. Designing gaze-supported multimodal interactions for the exploration of large image collections. In Proc. of NGCA'11, ACM (2011), 1--8.  ",
      "doi": "10.1145/1983302.1983303"
    },
    {
      "text": "Spakov, O. Comparison of gaze-to-objects mapping algorithms. In Proc. of NGCA'11, ACM (2011), 1--8.  ",
      "doi": "10.1145/1983302.1983308"
    },
    {
      "text": "Ware, C., and Mikaelian, H. H. An evaluation of an eye tracker as a device for computer input. In Proc. of CHI'87, ACM (1987), 183--188.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Yamato, M., Inoue, K., Monden, A., Torii, K., and Matsumoto, K.-i. Button selection for general GUIs using eye and hand together. In Proc. of AVI'00, ACM (2000), 270--273.  ",
      "doi": "10.1145/345513.345339"
    },
    {
      "text": "Yoo, B., Han, J.-J., Choi, C., Yi, K., Suh, S., Park, D., and Kim, C. 3D user interface combining gaze and hand gestures for large-scale display. In Proc. of CHI EA'10, ACM (2010), 3709--3714.  ",
      "doi": "10.1145/1753846.1754043"
    },
    {
      "text": "Zhai, S., Morimoto, C., and Ihde, S. Manual and gaze input cascaded (MAGIC) pointing. In Proc. of CHI'99, ACM (1999), 246--253.  ",
      "doi": "10.1145/302979.303053"
    },
    {
      "text": "Zhang, X., Ren, X., and Zha, H. Improving eye cursor's stability for eye pointing tasks. In Proc. of CHI'08, ACM (2008), 525--534.  ",
      "doi": "10.1145/1357054.1357139"
    }
  ]
}