{
  "doi": "10.1145/2207676.2208685",
  "title": "Diversity among enterprise online communities: collaborating, teaming, and innovating through social media",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2815-2824",
  "year": 2012,
  "badges": [],
  "abstract": "There is a growing body of research into the adoption and use of social software in enterprises. However, less is known about how groups, such as communities, use and appropriate these technologies, and the implications for community structures. In a study of 188 very active online enterprise communities, we found systematic differences in size, demographics and participation, aligned with differences in community types. Different types of communities differed in their appropriation of social software tools to create and use shared resources, and build relationships. We propose implications for design of community support features, services for potential community members, and organizations looking to derive value from online groups.",
  "tags": [
    "teams",
    "idea labs",
    "communities",
    "virtual teams",
    "online communities",
    "communities of practice"
  ],
  "authors": [
    {
      "name": "Michael Muller",
      "institution": "IBM, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332517372",
      "orcid": "0000-0001-7860-163X"
    },
    {
      "name": "Kate Ehrlich",
      "institution": "IBM, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331492075",
      "orcid": "missing"
    },
    {
      "name": "Tara Matthews",
      "institution": "IBM Research - Almaden, San Jose, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Adam Perer",
      "institution": "IBM, Cambridge, Massachusetts, United States",
      "img": "/do/10.1145/contrib-81100462318/rel-imgonly/adam_head.jpg",
      "acmid": "81100462318",
      "orcid": "0000-0002-8369-3847"
    },
    {
      "name": "Inbal Ronen",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321488024",
      "orcid": "missing"
    },
    {
      "name": "Ido Guy",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/do/10.1145/contrib-81321492044/rel-imgonly/ig2014.png",
      "acmid": "81321492044",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Armstrong, A., & Hagel III, J., Real profits from virtual communities. Mckinsey Quart, 3, 126--141, 1995.",
      "doi": ""
    },
    {
      "text": "Bogdan, C., & Bowers, J., Tuning in: Challenging design for communities through a field study of radio amateurs, Proc Communities & Technologies 2007, Springer, 439--461.",
      "doi": ""
    },
    {
      "text": "Bos, N., Zimmerman, A., Olson, J., Yew, J., Yerkie, J., Dahl, E.,, & Olson, G., From shared databases to communities of practice: A taxonomy of collaboratories, JCMC 12(2), 652672, 2007.",
      "doi": ""
    },
    {
      "text": "Bressler, S. E., & Grantham, C. E.,. Communities of commerce: Building Internet business communities to accelerate growth, minimize risk, and increase customer loyalty. McGraw-Hill, 2000. ",
      "doi": "10.5555/556778"
    },
    {
      "text": "Butler, B., Sproull, L., Kiesler, S., & Kraut, R., Community effort in online groups: Who does the work and why? In Weisband, S., & Atwater, L, (eds.), Leadership at a distance: Research in technologically supported work, Earlbaum, 2008.",
      "doi": ""
    },
    {
      "text": "Carlén, U., Typology of online learning communities, Proc. Int. Conf. Net Learning 2002.",
      "doi": ""
    },
    {
      "text": "Denison, T., Hardy, G., Johanson, G, Stillman, L., & Schauder, D., Community networks: Identities, taxonomies and evaluations, Proc Elec. Netwk. 2002.",
      "doi": ""
    },
    {
      "text": "DiMicco, J., Millen, D.R., Geyer, W.G., Dugan, C., Brownholtz, B., & Muller, M. (2008), Motivations for social networking at work, Proc. CSCW 2008.  ",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "Dubé, L., Bourhis, A., & Jacob, R., Towards a typology of virtual communities of practice, Int. J. Info, Knowl. Mgmt. 1, 69--93, 2006.",
      "doi": ""
    },
    {
      "text": "Efimova, L., & Grudin, J., Crossing boundaries: A case study employee blogging, Proc. HICSS 2007.  ",
      "doi": "10.1109/HICSS.2007.159"
    },
    {
      "text": "Ehrlich, K. & Shami, N.S. 2010. Microblogging inside and outside the workplace. Proc. ICWSM '10.",
      "doi": ""
    },
    {
      "text": "Freyne, J., Jacovi, M., Guy, I., & Geyer, W., Increasing engagement through early recommender intervention, Proc. RECSYS 2009.  ",
      "doi": "10.1145/1639714.1639730"
    },
    {
      "text": "Hagel, J., & Armstrong, A., Net Gain: Expanding markets through virtual communities, Harvard Business School Press, 1997. ",
      "doi": "10.5555/265735"
    },
    {
      "text": "Holtzblatt, L.J., Damianos, L.E., & Weiss, D., Factors impeding wiki use in the enterprise: A case study, Proc. CHI 2010.  ",
      "doi": "10.1145/1753846.1754208"
    },
    {
      "text": "Huh, J., Jones, L., Erickson,T., Kellogg, W.A., Bellamy, R.K.E, & Thomas, J.C., BlogCentral: the role of internal blogs at work, CHI 2007 Extended Abstracts.  ",
      "doi": "10.1145/1240866.1241022"
    },
    {
      "text": "Jackson, A., Yates, J., and Orlikowski, W . (2006). Corporate Blogging: Building community through persistent digital talk. Proceedings of HICSS.  ",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "Jones, Q., & Rafaeli, S., Time to split, virtually: 'Discourse architecture' and 'community building' create vibrant virtual publics. Elec. Mrkts, 10(4), 214--223, 2000.",
      "doi": ""
    },
    {
      "text": "Komito, L., The net as a foraging society: Flexible communities. Info. Soc. 14, 97--106, 1998.",
      "doi": ""
    },
    {
      "text": "Lazar, J., & Preece, J., Classification schema for online communities, Proc. AISAC 1998.",
      "doi": ""
    },
    {
      "text": "Liu, C.-C., Identifying the value types of virtual communities based on the Q method, Int. J. Web Based Commun. 7(1), 2011.  ",
      "doi": "10.1504/IJWBC.2011.038125"
    },
    {
      "text": "Ludford, P.J., Cosley, D., Frankowski, D., & Terveen, L., Think different: Increasing online community participation using uniqueness and group dissimilarity, Proc. CHI 2004.  ",
      "doi": "10.1145/985692.985772"
    },
    {
      "text": "Matthews, T., Whittaker, S., Moran, T., Yuen, S. (2011). Collaboration personas: A new approach to designing workplace collaboration tools. Proc. CHI 2011.  ",
      "doi": "10.1145/1978942.1979272"
    },
    {
      "text": "Matthews, T., Whittaker, S., Moran, T., Yuen, S., Judge, T. (2011), Productive interrelationships between collaborative groups ease the challenges of dynamic and multi-teaming, CSCW Journal Special Issue on Collective Intelligence in Organizations. DOI: 10.1007/s10606-011--9154-y.  ",
      "doi": ""
    },
    {
      "text": "McDermott, R. (1999). Learning across teams: The role of communities of practice in team organizations. Knowledge Management Review, May/June 1999.",
      "doi": ""
    },
    {
      "text": "Millen, D.R., Feinberg, J., & Kerr, B., Social bookmarking in the enterprise, Proc. CHI 2006.  ",
      "doi": "10.1145/1124772.1124792"
    },
    {
      "text": "Mittilä, T. and Mäntymäki, M., Classification of Online Communities. Proc. Frontiers of e-Business Research 2003. http://www.ebrc.info.",
      "doi": ""
    },
    {
      "text": "Muller, M., & Carey, K., Design as a minority discipline in a software company: toward requirements for a community of practice, Proc. CHI 2002.  ",
      "doi": "10.1145/503376.503445"
    },
    {
      "text": "Muller, M., & Chua, S., Brainstorming for Japan: Rapid distributed global collaboration for disaster response, Proc. CHI 2012.  ",
      "doi": "10.1145/2207676.2208668"
    },
    {
      "text": "Muller, M.J., Freyne, J., Dugan, C., Millen, D.R., & ThomSantelli, J., Return On Contribution (ROC): A metric for enterprise social software. Proc. ECSCW 2009.",
      "doi": ""
    },
    {
      "text": "Muller, M.J., Geyer, W., Brownholtz, B., Wilcox, E., & Millen, D.R., One-hundred days in an activity-centric collaboration environment based on shared objects, Proc. CHI 2004.  ",
      "doi": "10.1145/985692.985740"
    },
    {
      "text": "Naaman, M., Boase, J., & Lai, C.-H., Is it really about me? Message content in social awareness streams, Proc. CSCW 2010.  ",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Orlikowski, W., Learning from Notes: Organizational issues in groupware implementation, Info. Soc. 9(3), 237--250, 1993.",
      "doi": ""
    },
    {
      "text": "Plant, R., Online communities, Tech. Soc. 26, 51--65, 2004.",
      "doi": ""
    },
    {
      "text": "Poole, E.S., Grudin, J., A taxonomy of wiki genres in enterprise settings, Proc. WikiSym 2010.  ",
      "doi": "10.1145/1832772.1832792"
    },
    {
      "text": "Porter, C.E., A typology of virtual communities: A multidisciplinary foundation for future research, JCMC 10(1), 2004.",
      "doi": ""
    },
    {
      "text": "Powell, A., Piccoli, G., & Ives, B., Virtual teams: A review of current literature and directions for future research, DATABASE Adv. Info. Sys. 35(1), 6--36, 2004.  ",
      "doi": "10.1145/968464.968467"
    },
    {
      "text": "Preece, J., Online communities: Designing usability, supporting sociability, Wiley, 2000. ",
      "doi": "10.5555/517688"
    },
    {
      "text": "Preece, J. and Maloney-Krichmar, D., Online Communities. In J. Jacko and A. Sears, A. (Eds.) Human-Computer Interaction Handbook, Erlbaum, 596--620, 2003.",
      "doi": ""
    },
    {
      "text": "Sarker, S., & Sahey, S., Understanding virtual team development: An interpretive study, JASIS 3, 247--285, 2002.",
      "doi": ""
    },
    {
      "text": "Shami, N.S., Muller, M., & Millen, D.R., Browse and discover: Social file sharing in the enterprise, Proc. CSCW 2011.  ",
      "doi": "10.1145/1958824.1958868"
    },
    {
      "text": "Skeels, M.M., & Grudin, J., When social networks cross boundaries: A case study of workplace use of Facebook and linkedin, Proc. GROUP 2009.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Stanoevska-Slabeva, K., & Schmid, B.F., A typology of online communities and community supporting platforms, Proc HICSS 2001. ",
      "doi": "10.5555/820759.821959"
    },
    {
      "text": "Voida, S., Edwards, W.K., Newman, M.W., Grinter, R.E., & Ducheneaut, N. 'Share and share alike: Exploring the user interface affordances of file sharing, Proc CHI 2006.  ",
      "doi": "10.1145/1124772.1124806"
    },
    {
      "text": "Wenger, E., McDermott, R., & Snyder, W., Cultivating communities of practice: a guide to managing knowledge. Harvard Business School Press, 2002. ",
      "doi": "10.5555/560383"
    },
    {
      "text": "Whalen, T., Toms, E.G., & Blustein, J. (2008). Information displays for managing shared files, Proc CHIMIT 2008.  ",
      "doi": "10.1145/1477973.1477980"
    },
    {
      "text": "Yardi, S., Golder, S.A., Brzozowski, M., Blogging at work and the corporate attention economy, Proc. CHI 2009.  ",
      "doi": "10.1145/1518701.1519016"
    },
    {
      "text": "Yardi, S., & Poole, E.S., Please help!: Patterns of personalization in an online tech support board, Proc. C&T 2009.  ",
      "doi": "10.1145/1556460.1556501"
    },
    {
      "text": "Zhang, J., Qu, Y., Cody, J., & Wu, Y. 2010. A case study of micro-blogging in the enterprise: use, value, and related issues. Proc. CHI 2010.  ",
      "doi": "10.1145/1753326.1753346"
    }
  ]
}