{
  "doi": "10.1145/2207676.2207681",
  "title": "Monsieur, azonnal kövessen engem bitte!: an automatically generated interlanguage tailored to speakers of minority but culturally influenced languages",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "31-34",
  "year": 2012,
  "badges": [],
  "abstract": "Automatic localization of cultural resources and UIs is crucial for the survival of minority languages, for which there are insufficient parallel corpora (or no corpus at all) to build machine translation systems. This paper proposes a new way to compensate for such resource-scarce languages, based on the fact that most languages share a common vocabulary. Concretely, our approach leverages a family of languages closely related to the speaker's native language to construct translations in a coherent mix of these languages. Experimental results indicate that these translations can be easily understood, being also a useful aid for users who are not proficient in foreign languages. Therefore this work significantly contributes to HCI in two ways: it establishes a language that can improve how applications communicate to their users, and it reports insights on the user acceptance towards the method.",
  "tags": [
    "machine translation",
    "interlingua",
    "cityspeak",
    "localization"
  ],
  "authors": [
    {
      "name": "Luis Leiva",
      "institution": "Institut Tecnològic d'Informàtica & Universitat Politècnica de València (UPV), Valencia, Spain",
      "img": "/do/10.1145/contrib-81413601851/rel-imgonly/luileito-crop.jpg",
      "acmid": "81413601851",
      "orcid": "0000-0002-5011-1847"
    },
    {
      "name": "Vicent Alabau",
      "institution": "Institut Tecnològic d'Informàtica & Universitat Politècnica de València (UPV), Valencia, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384611659",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brooke, J. SUS: A \"quick and dirty\" usability scale. In Usability Evaluation in Industry. Taylor and Francis, 1996.",
      "doi": ""
    },
    {
      "text": "Dagan, I., Itai, A., and Schwall, U. Two languages are more informative than one. In Proc. ACL (1991), 130--137.  ",
      "doi": "10.3115/981344.981361"
    },
    {
      "text": "Gollins, T., and Sanderson, M. Improving cross language retrieval with triangulated translation. In Proc. SIGIR (2001).  ",
      "doi": "10.1145/383952.383965"
    },
    {
      "text": "Hickey, R., Ed. The Handbook of Language Contact. Wiley-Blackwell, 2010.",
      "doi": ""
    },
    {
      "text": "Hu, C., Bederson, B. B., Resnik, P., and Kronrod, Y. Monotrans2: a new human computation system to support monolingual translation. In Proc. CHI (2011), 1133--1136.  ",
      "doi": "10.1145/1978942.1979111"
    },
    {
      "text": "Koehn, P., Hoang, H., Birch, A., Callison-Burch, C., Federico, M., Bertoldi, N., Cowan, B., Shen, W., Moran, C., Zens, R., Dyer, C., Bojar, O., Constantin, A., and Herbst, E. Moses: open source toolkit for statistical machine translation. In Proc. ACL (2007), 177--180. ",
      "doi": "10.5555/1557769.1557821"
    },
    {
      "text": "Lewis, M. P., Ed. Ethnologue: Languages of the World, 16th ed. SIL International, 2009.",
      "doi": ""
    },
    {
      "text": "Sammon, P. Future Noir: The Making of Blade Runner. Orion Books, 1997.",
      "doi": ""
    },
    {
      "text": "Tiedemann, J. News from OPUS - A collection of multilingual parallel corpora with tools and interfaces. In Proc. RANLP (2009), 237--248.",
      "doi": ""
    }
  ]
}