{
  "doi": "10.1145/2207676.2207756",
  "title": "Impression formation in corporate people tagging",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "569-578",
  "year": 2012,
  "badges": [],
  "abstract": "This research explores the relationship between self-presentation and perception by others as manifested explicitly through the use of tags in a people tagging system. The study provides insights relevant for the organizational context since it is based on a system implemented within IBM. We developed a detailed codebook and used it to categorize 9,506 tags assigned to a sample of taggers. Our analysis examines the use of self tags versus social tags (assigned by others) across different categories and sub-categories. While overlap exists, self tags tend to be more factual describing technology expertise, social tags augment the individual tags by adding a personal dimension.",
  "authors": [
    {
      "name": "Daphne R. Raban",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310487460",
      "orcid": "missing"
    },
    {
      "name": "Avinoam Danan",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502716067",
      "orcid": "missing"
    },
    {
      "name": "Inbal Ronen",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321488024",
      "orcid": "missing"
    },
    {
      "name": "Ido Guy",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/do/10.1145/contrib-81321492044/rel-imgonly/ig2014.png",
      "acmid": "81321492044",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Back, M. D., Stopfer, J. M., Vazire, S., Gaddis, S., Schmukle, S. C., Egloff, B. and Gosling, S. D. Facebook profiles reflect actual personality, not self-idealization. Psychological Science, 21, 3 (2010), 372.",
      "doi": ""
    },
    {
      "text": "DiMicco, J., Millen, D. R., Geyer, W., Dugan, C., Brownholtz, B. and Muller, M. Motivations for social networking at work. In Anonymous Proceedings of the 21st ACM conference on Computer supported cooperative work. ACM, , 2008, 711--720.  ",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "Dominick, J. R. Who Do You Think You Are? Personal Home Pages and Self-Presentation on the World Wide Web. Journalism and Mass Communication Quarterly, 76, 4 (1999), 646--658.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K. and Cash, D. Turning information into knowledge: Information finding as a collaborative activity. In Anonymous Proceedings of Digital Libraries. (1994), 119125.",
      "doi": ""
    },
    {
      "text": "Ellison, N., Heino, R. and Gibbs, J. Managing Impressions Online: Self-Presentation Processes in the Online Dating Environment. Journal of Computer-Mediated Communication, 11, 2 ( 2006), 415--441.",
      "doi": ""
    },
    {
      "text": "Farrell, S., Lau, T., Nusser, S., Wilcox, E. and Muller, M. Socially augmenting employee profiles with people-tagging. In Anonymous Proceedings of the 20th annual ACM symposium on User interface software and technology. (2007), 91--100. ACM New York, NY, USA.  ",
      "doi": "10.1145/1294211.1294228"
    },
    {
      "text": "Gibbs, J. L., Ellison, N. B. and Heino, R. D. SelfPresentation in Online Personals: The Role of Anticipated Future Interaction, Self-Disclosure, and Perceived Success in Internet Dating. Communication Research, 33, 2 (2006), 152.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. Allen Lane, , 1959.",
      "doi": ""
    },
    {
      "text": "Joinson, A. N. European Journal of Social Psychology, 31, 2 (2001), 177--192.",
      "doi": ""
    },
    {
      "text": "Kaid, L. L. and Wadsworth, A. J. Content analysis. Measurement of communication behavior, (1989), 197--217.",
      "doi": ""
    },
    {
      "text": "Kenny, D. A. Interpersonal perception: A social relations analysis. The Guilford Press, , 1994.",
      "doi": ""
    },
    {
      "text": "Lindgaard, G., Fernandes, G., Dudek, C. and Brown, J. Attention web designers: You have 50 milliseconds to make a good first impression! Behaviour & information technology, 25, 2 (2006), 115--126.",
      "doi": ""
    },
    {
      "text": "Marcus, B., Machilek, F. and Schütz, A. Personality in cyberspace: Personal web sites as media for personality expressions and impressions. J. Pers. Soc. Psychol., 90, 6 (2006), 1014.",
      "doi": ""
    },
    {
      "text": "Muller, M. J., Ehrlich, K. and Farrell, S. Social tagging and self-tagging for impression management. TR 06-02. IBM Research technical report, 2006.",
      "doi": ""
    },
    {
      "text": "Papacharissi, Z. and Rubin, A. M. Predictors of Internet use. Journal of Broadcasting & Electronic Media, 44, 2 (2000), 175--196.",
      "doi": ""
    },
    {
      "text": "Raban, D. R., Ronen, I. and Guy, I. Acting or Reacting? Preferential Attachment in a People Tagging System. Journal of the American Society for Information Science & Technology, 62, 4 (2011), 738--747.  ",
      "doi": "10.1002/asi.21490"
    },
    {
      "text": "Raban, D. R. Self-Presentation and the Value of Information in Q& A Web Sites. Journal of the American Society for Information Science and Technology, 60, 12 ( 2009), 2465--2473.  ",
      "doi": "10.5555/1672983.1673001"
    },
    {
      "text": "Rafaeli, S., Raban, D. R. and Kalman, Y. Social Cognition Online. In Amichai-Hamburger, Y. ed. The social net: The social psychology of the internet. Oxford University Press, Oxford, England, 2005.",
      "doi": ""
    },
    {
      "text": "Rouse, S. V. and Haas, H. A. Exploring the accuracies and inaccuracies of personality perception following Internet-mediated communication. Journal of research in personality, 37, 5 (2003), 446--467.",
      "doi": ""
    },
    {
      "text": "Savicki, V., Kelley, M. and Oesterreich, E. Judgments of gender in computer-mediated communication. Comput. Hum. Behav., 15, 2 ( 1999), 185--194.",
      "doi": ""
    },
    {
      "text": "Schau, H. J. and Gilly, M. C. We are what we post? Self-presentation in personal web space. Journal of Consumer Research, (2003), 385--404.",
      "doi": ""
    },
    {
      "text": "Singletary, M. W. Mass communication research: Contemporary methods and applications. Longman White Plains, NY, 1994.",
      "doi": ""
    },
    {
      "text": "Trammell, K. D. and Keshelashvili, A. Examining the new influencers: A self-presentation study of A-list blogs. Journalism & Mass Communication Quarterly, 82, 4 (2005), 968--982.",
      "doi": ""
    },
    {
      "text": "Turkle, S. Life on the Screen: Identity in the Age of the Internet. Simon & Schuster, New York, 1995. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Vazire, S. Who knows what about a person? The self-other knowledge asymmetry (SOKA) model. J. Pers. Soc. Psychol., 98, 2 (2010), 281.",
      "doi": ""
    },
    {
      "text": "Walther, J. B. Computer-Mediated Communication: Impersonal, Interpersonal, and Hyperpersonal Interaction. Communication Research, 23, 1 (1996), 3.",
      "doi": ""
    },
    {
      "text": "Whitty, M. T. Revealing the {} real'me, searching for the {} actual'you: Presentations of self on an internet dating site. Comput. Hum. Behav., 24, 4 (2008), 1707--1723.  ",
      "doi": "10.1016/j.chb.2007.07.002"
    }
  ]
}