{
  "doi": "10.1145/2207676.2208598",
  "title": "Evaluating the implicit acquisition of second language vocabulary using a live wallpaper",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1391-1400",
  "year": 2012,
  "badges": [],
  "abstract": "An essential aspect of learning a second language is the acquisition of vocabulary. However, acquiring vocabulary is often a protracted process that requires repeated and spaced exposure; which can be difficult to accommodate given the busyness of daily living. In this paper, we explore if a learner can implicitly acquire second language vocabulary through her explicit interactions with her mobile phone (e.g., navigating multiple home screens) using an interface we developed called Vocabulary Wallpaper. In addition, we examine if the type of vocabulary this technique exposes to the learner, whether it is contextually relevant or contextually-independent will influence the learner's rate of vocabulary acquisition. The results of our study show participants were able to use Vocabulary Wallpaper to increase the number of second language vocabulary that they can recognize and recall and their rate of vocabulary acquisition was significantly greater when presented with a contextually relevant vocabulary than a contextually-independent vocabulary.",
  "authors": [
    {
      "name": "David Dearman",
      "institution": "University of Toronto, Toronto, Ontario, Canada & Nokia Research Center, Palo Alto, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502707189",
      "orcid": "missing"
    },
    {
      "name": "Khai Truong",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "Al-Mekhlafi, K., Hu, X. and Zheng, Z. An approach to context-aware mobile Chinese language learning for foreign students. In Proc. ICMB 2009, IEEE Computer Society (2009), 340--346.  ",
      "doi": "10.1109/ICMB.2009.65"
    },
    {
      "text": "Baudin, J. S., Intille, S. S., Tapia, E. M., Rockinson, R. and Morris, M. E. Context-sensitive microlearning of foreign language vocabulary on a mobile device. In Proc. AmI 2007, Springer-Verlag (2007), 55--72. ",
      "doi": "10.5555/1775401.1775407"
    },
    {
      "text": "Cavus, N. and Ibrahim, D. m-Learning: an experiment in using SMS to support learning new English language words. British Journal of Educational Technology 40, 1 (2009), 78--91.",
      "doi": ""
    },
    {
      "text": "Chen, C. and Hsu, S. Personalized intelligent mobile learning system for supporting effective English learning. Educational Technology & Society 11, 3 (2008), 153--180.",
      "doi": ""
    },
    {
      "text": "Chun, D. M. and Plass, J. L. Effects of multimedia annotations on vocabulary acquisition. The Modern Language Journal 80, 2 (2007), 183--198.",
      "doi": ""
    },
    {
      "text": "Cui, Y. and Bull, S. Context and learning modeling for the mobile foreign language learner. System 33 (2005), 353--367.",
      "doi": ""
    },
    {
      "text": "Davies, M. Word frequency data from the Corpus of Contemporary American English (COCA). Downloaded from http://www.wordfrequency.info, February 1, 2011.",
      "doi": ""
    },
    {
      "text": "Dearman, D. and Truong, K. N. Identifying the activities supported by locations with community-authored content. In Proc. Ubicomp 2010, ACM Press (2010), 23--32.  ",
      "doi": "10.1145/1864349.1864354"
    },
    {
      "text": "Dempster, F. N. Effects of variable encoding and spaced presentations on vocabulary learning. Journal of Educational Psychology 79, 2 (1987), 162--170.",
      "doi": ""
    },
    {
      "text": "Edge, D., Searle, E., Chiu, K., Zhao, J. and Landay, J. A. MicroMandarin: mobile language learning in context. In Proc. CHI 2011, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1979413"
    },
    {
      "text": "Glasser, G., Hug, T. and Glahn, C. Integrated microlearning - an outline of the basic method and first results. In Proc. Interactive Computer Aided Learning 2004, Kassel University Press (2004), 1--7.",
      "doi": ""
    },
    {
      "text": "Gu, Y. and Johnson, R. K. Vocabulary learning strategies and language learning outcomes. Language Learning 46, 4 (1996), 643--679.",
      "doi": ""
    },
    {
      "text": "Gu, P. Y. Vocabulary learning in a second language: person, task, context and strategies. Teaching English as a Second of Foreign Language 7, 2 (2003).",
      "doi": ""
    },
    {
      "text": "Heibert, E. H., Kamil, M. L. Teaching and Learning Vocabulary. Lawrence Erlbaum Associates, London, England, 2005.",
      "doi": ""
    },
    {
      "text": "Hsieh, H., Chen, C. and Hong, C. Context-aware ubiquitous English learning in a campus environment. In Proc. ICALT 2007, IEEE Computer Society (2007), 351--353.",
      "doi": ""
    },
    {
      "text": "Huckin, T. and Coady, J. Incidental vocabulary acquisition in a second language: a review. Studies of Second Language Acquisition 21, 2 (1999), 181--193.",
      "doi": ""
    },
    {
      "text": "Hug, T. Micro learning and narration: exploring possibilities of utilization of narrations and storytelling for the design of \"micro units\" and didactical micro-learning arrangements. In Proc. Media in Transition 2005.",
      "doi": ""
    },
    {
      "text": "Kellogg, G. S. and Howe, M. J. A. Using words and pictures in foreign language learning. Alberta Journal of Educational Research 17, 2 (1971), 89--94.",
      "doi": ""
    },
    {
      "text": "Kolers, P. A. and Ostry, D. J. Time course of loss of information regarding pattern analyzing operations. Journal of Verbal Learning and Verbal Behaviour 13 (1974), 599--612.",
      "doi": ""
    },
    {
      "text": "Liu, T. Y. A context-aware ubiquitous learning environment for language listening and speaking. Journal of Computer Assisted Learning 25 (2009), 515--527.",
      "doi": ""
    },
    {
      "text": "Nation, P. Teaching and learning vocabulary. Heinle and Heinle, 1990.",
      "doi": ""
    },
    {
      "text": "Nation, P. Learning vocabulary in another language. Cambridge University Press, New York, NY, USA, 2001.",
      "doi": ""
    },
    {
      "text": "Ogata, H., Hui, G.L., Yin, C., Ueda, T., Oishi, Y. and Yano, Y. LOCH: supporting mobile language learning outside the classroom. Int. J. Mobile Learning and Organization 2, 3 (2008), 271--282.  ",
      "doi": "10.1504/IJMLO.2008.020319"
    },
    {
      "text": "Ogata, H. and Yano, Y. Context-aware support for computer-supported ubiquitous learning. In Proc. WMTE 2004, IEEE Computer Society (2004), 27--34. ",
      "doi": "10.5555/977408.978761"
    },
    {
      "text": "Tan, T. H. and Liu, T. Y. The mobile-based interactive learning environment (MOBILE) and a case study for assisting elementary school English learning. In Proc. ALT 2004, IEEE Computer Society (2004), 530--534. ",
      "doi": "10.5555/1018423.1020046"
    },
    {
      "text": "Thornton, P. and Houser, C. Using mobile phones in English education in Japan. Journal of Computer Assisted Learning 21, 3 (2005), 217--228.",
      "doi": ""
    },
    {
      "text": "Trusty, A. and Truong, K. N. Augmenting the web for second language vocabulary learning. In Proc. CHI 2011, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1979414"
    },
    {
      "text": "United States' Foreign Service Institute. Language Continuum. Available at: http://fsitraining.state.gov/training/Language%20Continuum.pdf, Accessed September 22, 2011.",
      "doi": ""
    },
    {
      "text": "Webb, S. The effect of repetition on vocabulary knowledge. Applied Linguistics 28, 1 (2007), 46--65.",
      "doi": ""
    }
  ]
}