{
  "doi": "10.1145/2207676.2208646",
  "title": "On the use of virtual environments for the evaluation of location-based applications",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2569-2578",
  "year": 2012,
  "badges": [],
  "abstract": "User experience (UX) research on pervasive technologies faces considerable challenges regarding today's mobile context-sensitive applications: evaluative field studies lack control, whereas lab studies miss the interaction with a dynamic context. This dilemma has inspired researchers to use virtual environments (VEs) to acquire control while offering the user a rich contextual experience. Although promising, these studies are mainly concerned with usability and the technical realization of their setup. Furthermore, previous setups leave room for improvement regarding the user's immersive experience. This paper contributes to this line of research by presenting a UX case study on mobile advertising with a novel CAVE-smartphone interface. We conducted two experiments in which we evaluated the intrusiveness of a mobile location-based advertising app in a virtual supermarket. The results confirm our hypothesis that context-congruent ads lessen the experienced intrusiveness thereby demonstrating that our setup is capable of generating preliminary meaningful results with regards to UX. Furthermore, we share insights in conducting these studies.",
  "authors": [
    {
      "name": "Arief Ernst Hühn",
      "institution": "NHTV Breda University of Applied Sciences, Breda, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502689408",
      "orcid": "missing"
    },
    {
      "name": "Vassilis-Javed Khan",
      "institution": "NHTV Breda University of Applied Sciences, Breda, Noord Brabant, Netherlands",
      "img": "/do/10.1145/contrib-81371592633/rel-imgonly/javed-khan-opt.jpg",
      "acmid": "81371592633",
      "orcid": "0000-0002-7333-981X"
    },
    {
      "name": "Andrés Lucero",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/do/10.1145/contrib-81314484387/rel-imgonly/81314484387.jpg",
      "acmid": "81314484387",
      "orcid": "missing"
    },
    {
      "name": "Paul Ketelaar",
      "institution": "Radboud Universiteit, Nijmegen, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502718789",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. and Mynatt, E. Charting past, present and future research in ubiquitous computing. ACM Trans. Comput.-Hum. Interact. 7, 1 (March 2000), 29--58.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Agarwal, R. and Prasad, J. The role of innovation characteristics and perceived voluntariness in the acceptance of information technologies. Decision Sciences 28, 3 (1997), 557--582.",
      "doi": ""
    },
    {
      "text": "Ajzen, I. The Theory of Planned Behavior. Organizational Behavior and Human Decision Processes 50, 2 (1991), 179--211.",
      "doi": "10.1016/0749-5978%2891%2990020-t"
    },
    {
      "text": "Banerjee, S. and Dholakia, R. R. Mobile advertising: does location-based advertising work? International Journal of Mobile Marketing 3, 2 (2008), 68--74.",
      "doi": ""
    },
    {
      "text": "Barton J. J. and Vijayaraghavan, V. Ubiwise: A ubiquitous wireless infrastructure simulation environment. Tech. report HP Labs, 2002.",
      "doi": ""
    },
    {
      "text": "Bauer, H. H., Reichardt, T., Barnes, S. J. and Neumann M. M. Driving Consumer Acceptance of Mobile Marketing: A Theoretical Framework and Empirical Study. Journal of Electronic Commerce Research 6, 3 (2005), 181--192.",
      "doi": ""
    },
    {
      "text": "Barkhuus, L. and Dey, A. Location-based services for mobile telephony: A study of users' privacy concerns. Proc. INTERACT '03, IOS Press (2003).",
      "doi": ""
    },
    {
      "text": "Barwise, P. and Strong, C. Permission-Based Mobile Advertising. Journal of Interactive Marketing 16, 1 (2002), 14--24.",
      "doi": ""
    },
    {
      "text": "Davis, F. D. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly 13 (1989), 319--340.  ",
      "doi": "10.2307/249008"
    },
    {
      "text": "Dhar, S. and Varshney, U. Challenges and business models for Mobile Location Based Services and Advertising. Commun. ACM 54, 5 (May 2011), 121--129.  ",
      "doi": "10.1145/1941487.1941515"
    },
    {
      "text": "Dinh, H. Q., Walker, N., Song, C., Kobayashi, A., and Hodges, L. F. Evaluating the Importance of Multisensory Input on Memory and the Sense of Presence in Virtual Environments. Proc. VR'99, IEEE (1999), 222. ",
      "doi": "10.5555/554230.835733"
    },
    {
      "text": "Duh, H. B.-L., Tan, G. C. B. and Chen, V. H.-h. Usability Evaluation for Mobile Device: A Comparison of Laboratory and Field Tests. Proc. Mobile HCI '06, ACM Press (2006), 181--186.  ",
      "doi": "10.1145/1152215.1152254"
    },
    {
      "text": "Edwards, M., Li, H. and Lee, J.-H. Forced exposure and psychological reactance: Antecedents and consequences of the perceived intrusiveness of pop-up ads. Journal of Advertising 31 (2002), 83--95.",
      "doi": ""
    },
    {
      "text": "Fishbein, M. and Ajzen, I. Belief, Attitude, intention and behavior: An introduction to theory and research. Addison-Wesley, 1975.",
      "doi": ""
    },
    {
      "text": "Ha, L. Observations: advertising clutter in consumer magazines: dimensions and effects. Journal of Advertising Research 36, (1996), 76--83.",
      "doi": ""
    },
    {
      "text": "Kaikkonen, A., Kallio, T., Kekäläinen, A., Kankainen, A. and Cankar, M. Usability testing of mobile applications: A comparison between laboratory and field testing. Journal of Usability Studies 1, 1 (2005), 4--16.",
      "doi": ""
    },
    {
      "text": "Karapanos, E. Quantifying Diversity in User Experience. PhD Thesis, Eindhoven University of Technology, 2010.",
      "doi": ""
    },
    {
      "text": "Khan, V. J., Nuijten, K. and Deslé, N. Pervasive Evaluation Application within Virtual Environments. Proc. PECCS '11, 261--264.",
      "doi": ""
    },
    {
      "text": "Kjeldskov J. and Graham C. A Review of MobileHCI Research Methods. Proc. MobileHCI '03, LNCS Springer-Verlag (2003), 317--335.",
      "doi": ""
    },
    {
      "text": "Kjeldskov, J. and Stage, J. New techniques for usability evaluation of mobile systems. International Journal of Human-Computer Studies 60, 5-6 (2004), 599--620.",
      "doi": ""
    },
    {
      "text": "Kjeldskov J., Skov M. B., Als B. S. and Høegh R. T. Is it Worth the Hassle? Exploring the Added Value of Evaluating the Usability of Context-Aware Mobile Systems in the Field. Proc. MobileHCI '04, SpringerVerlag (2004), 61--73.",
      "doi": ""
    },
    {
      "text": "Klompmaker, F., Stern, C., Reimann, C. and Santelmann, H. A Mock-up System for the Early Testing of Location Based Services. In: Mobile Interaction with the Real World 2007/5th Workshop on HCI in Mobile Guides. Singapore: ACM",
      "doi": ""
    },
    {
      "text": "Kowatsch, T. and Maass, W. In-store consumer behavior: How mobile recommendation agents influence usage intentions, product purchases, and store preferences. Computers in Human Behavior 26, (2010) 697--704.  ",
      "doi": "10.1016/j.chb.2010.01.006"
    },
    {
      "text": "Leichtenstern, K., André, E. and Rehm, M. Using the Hybrid Simulation for Early User Evaluations of Pervasive Interactions. Proc. of NordiCHI '10, ACM Press (2010), 315--324.  ",
      "doi": "10.1145/1868914.1868952"
    },
    {
      "text": "Li, H., Edwards, S. M. and Lee, J. Measuring the Intrusiveness of Advertisements: Scale Development and Validation. Journal of Advertising 31 (2002), 37--47.",
      "doi": ""
    },
    {
      "text": "Lin, J. J. W., Duh, H. B. L., Abi-Rached, H., Parker, D. E., and Furness, T. A. Effects of Field of View on Presence, Enjoyment, Memory, and Simulator Sickness in a Virtual Environment. Proc. VR '02, IEEE (2002), 164171. ",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Lumsden, J., Kondratova, I. and Durling, S. Investigating Microphone Efficacy for Facilitation of Mobile Speech-Based Data Entry. Proc. BCS-HCI '07, BCS Swinton (2007), 89--97. ",
      "doi": "10.5555/1531294.1531307"
    },
    {
      "text": "McCoy, S., Everard, A., Polak, P. and Galletta, D. F. An experimental study of Antecedants and consequences of online ad-intrusiveness. Journal of Human-Computer Interaction 24, 7 (2008), 672--699.",
      "doi": ""
    },
    {
      "text": "Muehling, D. D., Stoltman, J. J. and Grossbart, S. The impact of comparative advertising on levels of message involvement. Journal of Advertising 19, 4, 41--50.",
      "doi": ""
    },
    {
      "text": "Nielsen, C. M., Overgaard, M., Pedersen, M. B., Stage, J. and Stenild, S. It's worth the hassle!: the added value of evaluating the usability of mobile systems in the field. Proc. NordiCHI '06, ACM Press (2006), 272--280.  ",
      "doi": "10.1145/1182475.1182504"
    },
    {
      "text": "Nurmi, P., Salovaara, A., Bhattacharya, S., Pulkkinen, T. and Kahl, G. Influence of Landmark-Based Navigation Instructions on User Attention in Indoor Smart Spaces. Proc. IUI'11, ACM Press (2011), 33--42.  ",
      "doi": "10.1145/1943403.1943410"
    },
    {
      "text": "O'Neill, E., Klepal, M., Lewis, D., O'Donnell, T., O'Sullivan, D. and Pesch, D. A testbed for evaluating human interaction with ubiquitous computing environments. Proc. Tridentcom '05, IEEE (2005), 6069.  ",
      "doi": "10.1109/TRIDNT.2005.7"
    },
    {
      "text": "Pramanik, A. The use of a virtual environment as a method of wayfinding research in architecture. Master's Thesis, Texas Tech University, 2006.",
      "doi": ""
    },
    {
      "text": "Reynolds, V., Cahill, V. and Senart, A. Requirements for an ubiquitous computing simulation and emulation environment. Proc. InterSense '06, ACM Press (2006).  ",
      "doi": "10.1145/1142680.1142682"
    },
    {
      "text": "Roto, V. Oulasvirta, A. Haikarainen, T. Lehmuskallio, H. and Nyyssönen, T. Examining mobile phone use in the wild with quasi-experimentation. HIIT Technical Report 2004-1, August 13 2004.",
      "doi": ""
    },
    {
      "text": "Schellenbach, M., Krüger, A., Lövdén, M. and Lindenberger, U. A laboratory evaluation framework for pedestrian navigation devices. Proc. Mobility '07, ACM Press (2007), 495--502.  ",
      "doi": "10.1145/1378063.1378143"
    },
    {
      "text": "Slater, M., Steed, A., McCarthy, J. and Marinelli, F. The Influence of Body Movement on Presence in Virtual Environments. The Journal of the Human Factors and Ergonomics Society 40, 3 (1998), 469--477.",
      "doi": ""
    },
    {
      "text": "Singh, P., Ha, H. N., Kuang, Z., Olivier, P., Kray, C., Blythe, P. and James, P. Immersive video as a rapid prototyping and evaluation tool for mobile and ambient applications. Proc. MobileHCI '06, ACM Press (2006), 264--264.  ",
      "doi": "10.1145/1152215.1152276"
    },
    {
      "text": "Snowdon, C. and Kray, C. Exploring the use of landmarks for mobile navigation support in natural environments. Proc. MobileHCI '09, ACM Press (2009), Article 13, 10 pages.  ",
      "doi": "10.1145/1613858.1613875"
    },
    {
      "text": "Unni, R. and Harmon, R. Perceived effectiveness of push vs. pull mobile location-based advertising. Journal of Interactive Advertising 7, 2 (2007), 28--40.",
      "doi": ""
    },
    {
      "text": "Verbeke, W. and Vackier, I. Profile and effects of consumer involvement in fresh meat. Meat Science, 67, 1 (2004), 159--168.",
      "doi": ""
    },
    {
      "text": "Wehmeyer, K. Mobile Ad Intrusiveness - The Effects of Message Type and Situation. eMergence: Merging and Emerging Technologies, Processes, and Institutions 6 (2007), 1--18.",
      "doi": ""
    },
    {
      "text": "Xu, H., Oh, L.-B. And Teo, H.-H. Perceived effectiveness of text vs. multimedia Location-Based Advertising messaging. International Journal of Mobile Communications 17, 2 (2009), 154--177.  ",
      "doi": "10.1504/IJMC.2009.022440"
    }
  ]
}