{
  "doi": "10.1145/2207676.2208363",
  "title": "What do users really care about?: a comparison of usability problems found by users and experts on highly interactive websites",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2107-2116",
  "year": 2012,
  "badges": [],
  "abstract": "Expert evaluation methods, such as heuristic evaluation, are still popular in spite of numerous criticisms of their effectiveness. This paper investigates the usability problems found in the evaluation of six highly interactive websites by 30 users in a task-based evaluation and 14 experts using three different expert evaluation methods. A grounded theory approach was taken to categorize 935 usability problems from the evaluation. Four major categories emerged: Physical presentation, Content, Information Architecture and Interactivity. Each major category had between 5 and 16 sub-categories. The categories and sub-categories were then analysed for whether they were found by users only, experts only or both users and experts. This allowed us to develop an evidence-based set of 21 heuristics to assist in the development and evaluation of interactive websites.",
  "tags": [
    "heuristics",
    "expert evaluation",
    "usability problems",
    "user evaluation",
    "heuristic evaluation"
  ],
  "authors": [
    {
      "name": "Helen Petrie",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022960",
      "orcid": "missing"
    },
    {
      "name": "Christopher Power",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100082155",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Batra, S. and Bishu, R. R. (2007). Web usability and evaluation: issues and concerns. In N. Aykin (Ed.), Usability and Internationalization, Part I, HCII 2007 (LNCS 4559). Berlin: Springer-Verlag. ",
      "doi": "10.5555/1769821.1769853"
    },
    {
      "text": "Bryant, T. and Charmaz, K. (2007). The Sage Handbook of Grounded Theory. London: Sage.",
      "doi": ""
    },
    {
      "text": "Budd, A. (2007). Heuristics for modern web application development. Blogography, January 17. Available at: www.andybudd.com/archives/2007/01/heuristics_for_modern_web_application_development/",
      "doi": ""
    },
    {
      "text": "Cohen, J. (1960). A coefficient of agreement for nominal scales. Educational and Psychological Measurement 20(1), 37--46.",
      "doi": ""
    },
    {
      "text": "Cockton, G. and Woolrych, A. (2001). Understanding inspection methods: lessons from an assessment of heuristic evaluation. In A. Blandford, J. Vanderdonckt and P. D. Gray (Eds.), People and Computers XV. Berlin: Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Dix, A., Finlay, J., Abowd, G. D. and Beale, R. (2004). Human-computer interaction (3rd edition). Harlow, UK: Pearson Prentice Hall. ",
      "doi": "10.5555/1203012"
    },
    {
      "text": "Gray, W. D. and Salzman, M. (1998). Damaged merchandise? A review of experiments that compare usability evaluation methods. Human Computer Interaction, 13(3), 203--261.  ",
      "doi": "10.1207/s15327051hci1303_2"
    },
    {
      "text": "Hertzum, M. and Jacobsen, N. E. (2001). The evaluator effect: a chilling fact about usability evaluation methods. International Journal of Human-Computer Interaction, 13(4), 421--443.",
      "doi": ""
    },
    {
      "text": "Hertzum, M., Jacobsen, N. E. and Molich, R. (2002). Usability inspections by groups of specialists: perceived agreement in spite of disparate observations. In Ext. Abstracts CHI 2002, ACM Press (2002), 662--663.  ",
      "doi": "10.1145/506443.506534"
    },
    {
      "text": "Hornbaek, K. (2011). Dogmas in the assessment of usability evaluation methods. Behavior and Information Technology, 29(1), 97--111.  ",
      "doi": "10.1080/01449290801939400"
    },
    {
      "text": "Instone, K. (1997). Site usability heuristics for the web. Web Review, October. Available at: http://instone.org/heuristics",
      "doi": ""
    },
    {
      "text": "Jeffries, R., Miller, J. R., Wharton, C. and Uyeda, K. (1991). User interface evaluation in the real world: a comparison of four techniques. Proc. CHI 1991, ACM Press (1991), 119--124.  ",
      "doi": "10.1145/108844.108862"
    },
    {
      "text": "Koutsabasis, P., Spyrou, T. and Darzentas, J. (2009). Evaluating usability evaluation methods: criteria, method and a case study. In J. Jacko (Ed.), Human-Computer Interaction, Part I, HCII 2007 (LNCS 4550). Berlin: Springer Verlag. ",
      "doi": "10.5555/1772490.1772555"
    },
    {
      "text": "Lazar, J., Feng, J. H. and Hochheiser, H. (2010). Research methods in human-computer interaction. Chichester, UK: Wiley. ",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Lewis, C., Polson, P., Wharton, C., and Rieman, J. (1990). Testing a walkthrough methodology for theory-based design of walk-up-and-use interfaces. Proc. CHI 1990, ACM Press (1990), 235--242.  ",
      "doi": "10.1145/97243.97279"
    },
    {
      "text": "Lewis, C. and Wharton, C. (1997). Cognitive walkthroughs. In M. Helander, T. K. Landauer and P. Prabhu (Eds.), Handbook of human-computer interaction (2nd edition). Amsterdam: Elsevier.",
      "doi": ""
    },
    {
      "text": "Molich, R. and Nielsen, J. (1990). Improving a human-computer dialogue. Communications of the ACM, 33(3), 338--348.  ",
      "doi": "10.1145/77481.77486"
    },
    {
      "text": "Nielsen, J. (1993). Usability engineering. San Diego, CA: Morgan Kaufmann. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Nielsen, J. (1994). Enhancing the explanatory power of usability heuristics. Proc. CHI 1994, ACM Press (1994), 152--158.  ",
      "doi": "10.1145/191666.191729"
    },
    {
      "text": "Nielsen, J. and Molich, R. (1990). Heuristic evaluation of user interfaces. Proc. CHI 1990, ACM Press (1990), 249--256.  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Petrie, H. and Buykx, L. (2010). Collaborative Heuristic Evaluation: improving the effectiveness of heuristic evaluation. Proceedings of UPA 2010 International Conference. Omnipress. Available at: http://upa.omnibooksonline.com/index.htm",
      "doi": ""
    },
    {
      "text": "Rogers, Y., Sharp, H. and Preece, J. (2011). Interaction design: beyond human-computer interaction. Chichester, UK: Wiley. ",
      "doi": "10.5555/2031622"
    },
    {
      "text": "Shneiderman, B. and Plaisant, C. (2005). Designing the user interface (4th edition). Boston, MA: Addison Wesley.",
      "doi": ""
    },
    {
      "text": "Strauss, A. and Corbin, J. (1997). Grounded theory in practice. London: Sage.",
      "doi": ""
    },
    {
      "text": "Tognazzini, B. (2003). First principles of interaction design. Available at: http://asktog.com/basics/firstPrinciples.htm",
      "doi": ""
    }
  ]
}