{
  "doi": "10.1145/2207676.2208733",
  "title": "Accurate measurements of pointing performance from in situ observations",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3157-3166",
  "year": 2012,
  "badges": [],
  "abstract": "We present a method for obtaining lab-quality measurements of pointing performance from unobtrusive observations of natural in situ interactions. Specifically, we have developed a set of user-independent classifiers for discriminating between deliberate, targeted mouse pointer movements and those movements that were affected by any extraneous factors. To develop and validate these classifiers, we developed logging software to unobtrusively record pointer trajectories as participants naturally interacted with their computers over the course of several weeks. Each participant also performed a set of pointing tasks in a formal study set-up. For each movement, we computed a set of measures capturing nuances of the trajectory and the speed, acceleration, and jerk profiles. Treating the observations from the formal study as positive examples of deliberate, targeted movements and the in situ observations as unlabeled data with an unknown mix of deliberate and distracted interactions, we used a recent advance in machine learning to develop the classifiers. Our results show that, on four distinct metrics, the data collected in-situ and filtered with our classifiers closely matches the results obtained from the formal experiment.",
  "tags": [
    "pointing",
    "in situ studies",
    "motor performance",
    "machine learning"
  ],
  "authors": [
    {
      "name": "Krzysztof Gajos",
      "institution": "Harvard University, Cambridge, Massachusetts, United States",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    },
    {
      "name": "Katharina Reinecke",
      "institution": "Harvard University, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583575",
      "orcid": "0000-0001-7897-9325"
    },
    {
      "name": "Charles Herrmann",
      "institution": "Harvard University, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502771585",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J., and Zhai, S. Refining Fitts' law models for bivariate pointing. In CHI '03: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM Press (New York, NY, USA, 2003), 193--200.  ",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "Chapuis, O., Blanch, R., and Beaudouin-Lafon, M. Fitts' law in the wild: A field study of aimed movements. Tech. Rep. 1480, LRI, Univ. Paris-Sud, France, December 2007. 11 pages.",
      "doi": ""
    },
    {
      "text": "Denis, F., Gilleron, R., and Letouzey, F. Learning from positive and unlabeled examples. Theor. Comput. Sci. 348, 1 (2005), 70--83.  ",
      "doi": "10.1016/j.tcs.2005.09.007"
    },
    {
      "text": "Elkan, C., and Noto, K. Learning classifiers from only positive and unlabeled data. In Proceeding of the 14th ACM SIGKDD international conference on Knowledge discovery and data mining, KDD '08, ACM (New York, NY, USA, 2008), 213--220.  ",
      "doi": "10.1145/1401890.1401920"
    },
    {
      "text": "Evans, A., and Wobbrock, J. Taming wild behavior: The Input Observer for obtaining text entry and mouse pointing measures from everyday computer use. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '12). Austin, Texas (May 5-10, 2012), ACM Press (2012). To appear.  ",
      "doi": "10.1145/2207676.2208338"
    },
    {
      "text": "Gajos, K. Z., Weld, D. S., and Wobbrock, J. O. Automatically generating personalized user interfaces with Supple. Artificial Intelligence 174 (2010), 910--950.  ",
      "doi": "10.1016/j.artint.2010.05.005"
    },
    {
      "text": "Gajos, K. Z., Wobbrock, J. O., and Weld, D. S. Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. In CHI '08: Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM (New York, NY, USA, 2008), 1257--1266.  ",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Grossman, T., and Balakrishnan, R. A probabilistic approach to modeling two-dimensional pointing. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 3 (2005), 435--459.  ",
      "doi": "10.1145/1096737.1096741"
    },
    {
      "text": "Hurst, A., Hudson, S. E., and Mankoff, J. Automatically identifying targets users interact with during real world tasks. In Proceedings of the 15th international conference on Intelligent user interfaces, IUI '10, ACM (New York, NY, USA, 2010), 11--20.  ",
      "doi": "10.1145/1719970.1719973"
    },
    {
      "text": "Hurst, A., Hudson, S. E., Mankoff, J., and Trewin, S. Automatically detecting pointing performance. In IUI '08: Proceedings of the 13th international conference on Intelligent user interfaces, ACM Press (Jan. 2008).  ",
      "doi": "10.1145/1378773.1378776"
    },
    {
      "text": "Hurst, A., Mankoff, J., and Hudson, S. E. Understanding pointing problems in real world computing environments. In Assets '08: Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility, ACM (New York, NY, USA, 2008), 43--50.  ",
      "doi": "10.1145/1414471.1414481"
    },
    {
      "text": "International Organization for Standardization. 9241-9 Ergonomic requirements for office work with visual display terminals (VDTs) - Part 9: Requirements for non-keyboard input devices, 2000.",
      "doi": ""
    },
    {
      "text": "Jagacinski, R., Repperger, D., Moran, M., Ward, S., and Glass, B. Fitts' law and the microstructure of rapid discrete movements. Journal of Experimental Psychology: Human Perception and Performance 6, 2 (1980), 309--320.",
      "doi": ""
    },
    {
      "text": "Kaiser, J. F., and Reed, W. A. Data smoothing using low-pass digital filters. Review of Scientific Instruments 48, 11 (1977), 1447--1457.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7, 1 (1992), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I. S., Kauppinen, T., and Silfverberg, M. Accuracy measures for evaluating computer pointing devices. In Proceedings of the SIGCHI conference on Human factors in computing systems, CHI '01, ACM (New York, NY, USA, 2001), 9--16.  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "MacKenzie, S. I., and Buxton, W. Extending Fitts' law to two-dimensional tasks. In CHI '92: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM Press (New York, NY, USA, 1992), 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "Meyer, D. E., Abrams, R. A., Kornblum, S., Wright, C. E., and et al. Optimality in human motor performance: Ideal control of rapid aimed movements. Psychological Review 95, 3 (1988), 340--370.",
      "doi": ""
    },
    {
      "text": "Rzeszotarski, J. M., and Kittur, A. Instrumenting the crowd: Using implicit behavioral measures to predict task performance. In Proceedings of the 24th annual ACM symposium on User interface software and technology, UIST '11, ACM (New York, NY, USA, 2011).  ",
      "doi": "10.1145/2047196.2047199"
    },
    {
      "text": "Walker, N., Philbin, D. A., and Fisk, A. D. Age-related differences in movement control: adjusting submovement structure to optimize performance. J Gerontol B Psychol Sci Soc Sci 52, 1 (January 1997).",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., and Gajos, K. Z. Goal crossing with mice and trackballs for people with motor impairments: Performance, submovements, and design directions. ACM Trans. Access. Comput. 1, 1 (May 2008), 1--37.  ",
      "doi": "10.1145/1361203.1361207"
    },
    {
      "text": "World Wide Web Consortium. Accessible Rich Internet Applications (WAI-ARIA) 1.0, 2011. Accessed on January 8, 2012.",
      "doi": ""
    },
    {
      "text": "Yu, H., Han, J., and Chang, K. C.-C. Pebl: positive example based learning for web page classification using svm. In KDD '02: Proceedings of the eighth ACM SIGKDD international conference on Knowledge discovery and data mining, ACM (New York, NY, USA, 2002), 239--248.  ",
      "doi": "10.1145/775047.775083"
    }
  ]
}