{
  "doi": "10.1145/2207676.2208319",
  "title": "Claim mobile: when to fail a technology",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1833-1842",
  "year": 2012,
  "badges": [],
  "abstract": "This paper looks back at the deployment of Claim Mobile, a smartphone-based data collection application developed for a non-governmental organization (NGO) in Southwest Uganda. This NGO subsidizes health facilities by paying for medical services on the basis of claims submitted after the patient consultation, targeting treatment of 99,000 clients between 2006-2011. I successfully tested Claim Mobile in Summer 2008, processing 35 claims over two weeks, and then discontinued it six months later, when it became apparent that integration and scale-up of the technology would be problematic for the NGO. In addition, many issues we hoped to address through technology had been addressed through program management changes instead. I find that a) the context motivating the technology changed over time, b) simpler solutions can be as effective as new technologies, and c) prioritizing the needs of the NGO required abandoning the deployment of Claim Mobile. Thus this paper presents the value of learning from failure in the process of designing for users in developing regions.",
  "tags": [
    "hci4d",
    "braided communications",
    "sms",
    "ictd",
    "failure",
    "mobile phone"
  ],
  "authors": [
    {
      "name": "Melissa Densmore",
      "institution": "University of California, Berkeley, Berkeley, CA, United States",
      "img": "/do/10.1145/contrib-81502808464/rel-imgonly/mho-suit-bw.jpg",
      "acmid": "81502808464",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Best, M. Understanding Our Knowledge Gaps: Or, Do We Have an ICT4D Field? And Do We Want One? Information Technology and International Development. 6(SE), 49--52.",
      "doi": ""
    },
    {
      "text": "Braa, J. and Titlestad, O. H. and Sæbø J. 2004. Participatory Health Information Systems Development in Cuba the Challenge of Addressing Multiple Levels in a Centralized Setting. In Proc. of PDC2004.  ",
      "doi": "10.1145/1011870.1011877"
    },
    {
      "text": "Brewer, E. et al. 2006. \"The Challenges of Technology Research for Developing Regions,\" IEEE Pervasive Computing, 5(2), 15--23.  ",
      "doi": "10.1109/MPRV.2006.40"
    },
    {
      "text": "Densmore, M. 2012. Experiences with Bulk SMS for Health Financing in Uganda. In CHI'12 Extended Abstracts.  ",
      "doi": "10.1145/2212776.2212816"
    },
    {
      "text": "El Emam, K. & Garritty, C. 2006.Who's using PDAs? Estimates of PDA use by health care providers: a systematic review of surveys. Journal of Medical Internet Research. 8(2), p. e7.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T., & Pacenti, E. 1999. Design: Cultural probes. interactions. 6, pp. 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Heeks, R. 2003. Health Information Systems: Failure, success and improvisation, International Journal of Medical Informatics. 75(2), 125--137.",
      "doi": ""
    },
    {
      "text": "Ho, M. R., Owusu, E. K, and Aoki, P. M. Claim Mobile: Engaging Conflicting Stakeholder Requirements in Healthcare in Uganda. Proc. of ICTD '09. ",
      "doi": "10.5555/1812530.1812535"
    },
    {
      "text": "Ho, M. R., Smyth, T. N., Kam, M., and Dearden, A. 2009. Human-Computer Interaction for Development: The Past, Present, and Future, Information Technologies & International Development, 5(4), 1--18.",
      "doi": ""
    },
    {
      "text": "Keniston, K. 2003. IT for the Masses: Hope or Hype Economic and Political Weekly.",
      "doi": ""
    },
    {
      "text": "Kleine, D. & Unwin, T. 2009. Technological Revolution, Evolution and New Dependencies: What's New About ICT4D? Third World Quarterly. 30(5) 1045--1067.",
      "doi": ""
    },
    {
      "text": "Muller, M. J. & Kuhn, S. 1993. Participatory Design. Commun. ACM 36, 6, 24--28.  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Nuwaha. F. 2006. Determinants of Choosing Public or Private Health Care Among Patients With Sexually Transmitted Infections in Uganda. Journal of American Sexually Transmitted Diseases Assoc. 33(7), 422--427.",
      "doi": ""
    },
    {
      "text": "Schumacher, E. F. 2010. Small Is Beautiful: Economics as if People Mattered. Harper Perennial. Reprint.",
      "doi": ""
    },
    {
      "text": "Stacey, J. 1988. Can there be a feminist ethnography? Women's Studies International Forum. 11(1), 21--27.",
      "doi": ""
    },
    {
      "text": "Tacchi, J. and Slater, D. and Hearn, G. 2003. Ethnographic Action Research. UNESCO. New Delhi.",
      "doi": ""
    },
    {
      "text": "Toyama, K. 2010. \"Human-Computer Interaction and Global Development\", Foundations and Trends in Human-Computer Interaction: Vol. 4: No 1, pp 1--79.  ",
      "doi": "10.1561/1100000021"
    },
    {
      "text": "Veeraraghavan, R., Yasodhar, N., & Toyama, K. (2007). Warana Unwired: Replacing PCs with Mobile Phones in a Rural Sugarcane Cooperative. In Proc of ICTD.",
      "doi": ""
    },
    {
      "text": "Vredenburg, K. et al. 2002. A survey of user-centered design practice. In Proc. CHI '02. ACM  ",
      "doi": "10.1145/503376.503460"
    }
  ]
}