{
  "doi": "10.1145/2207676.2208558",
  "title": "A spatiotemporal visualization approach for the analysis of gameplay data",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1115-1124",
  "year": 2012,
  "badges": [],
  "abstract": "Contemporary video games are highly complex systems with many interacting variables. To make sure that a game provides a satisfying experience, a meaningful analysis of gameplay data is crucial, particularly because the quality of a game directly relates to the experience a user gains from playing it. Automatic instrumentation techniques are increasingly used to record data during playtests. However, the evaluation of the data requires strong analytical skills and experience. The visualization of such gameplay data is essentially an information visualization problem, where a large number of variables have to be displayed in a comprehensible way in order to be able to make global judgments. This paper presents a visualization tool to assist the analytical process. It visualizes the game space as a set of nodes which players visit over the course of a game and is also suitable to observe time-dependent information, such as player distribution. Our tool is not tailored to a specific type of genre. To show the flexibility of our approach we use two different kinds of games as case studies.",
  "tags": [
    "playtesting",
    "clustering",
    "gameplay visualization",
    "player behavior",
    "time-dependent visualization"
  ],
  "authors": [
    {
      "name": "Günter Wallner",
      "institution": "University of Applied Arts Vienna, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493799",
      "orcid": "missing"
    },
    {
      "name": "Simone Kriglstein",
      "institution": "University of Vienna, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100311784",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Algorithmics Group. MDSJ: Java Library for Multidimensional Scaling (Version 0.2). University of Konstanz, 2009. http://www.inf.uni-konstanz.de/algo/software/mdsj/.",
      "doi": ""
    },
    {
      "text": "Andersen, E., Liu, Y.-E., Apter, E., Boucher-Genesse, F., and Popović, Z. Gameplay analysis through state projection. In Proc. FDG 2010, ACM Press (2010), 1--8.  ",
      "doi": "10.1145/1822348.1822349"
    },
    {
      "text": "Brandes, U., and Pich, C. Eigensolver methods for progressive multidimensional scaling of large data. In Proc. GD 2006, Springer (2007), 42--53. ",
      "doi": "10.5555/1758612.1758620"
    },
    {
      "text": "Chittaro, L., Ranon, R., and Ieronutti, L. VU-Flow: A visualization tool for analyzing navigation in virtual environments. IEEE Transactions on Visualization and Computer Graphics 12 (2006), 1475--1485.  ",
      "doi": "10.1109/TVCG.2006.109"
    },
    {
      "text": "Davis, J. P., Steury, K., and Pagulayan, R. A survey method for assessing perceptions of a game: The consumer playtest in game design. Game Studies: The Int. Journal of Computer Game Research 5, 1 (2005).",
      "doi": ""
    },
    {
      "text": "Drachen, A., and Canossa, A. Analyzing spatial user behavior in computer games using geographic information systems. In Proc. MindTrek 2009, ACM Press (2009), 182--189.  ",
      "doi": "10.1145/1621841.1621875"
    },
    {
      "text": "Drachen, A., and Canossa, A. Towards gameplay analysis via gameplay metrics. In Proc. MindTrek 2009, ACM Press (2009), 202--209.  ",
      "doi": "10.1145/1621841.1621878"
    },
    {
      "text": "Drachen, A., and Canossa, A. Evaluating motion: Spatial user behavior in virtual environments. Int. Journal of Arts and Technology 4, 3 (2011).",
      "doi": ""
    },
    {
      "text": "Drachen, A., Canossa, A., and Yannakakis, G. Player modeling using self-organization in Tomb Raider: Underworld. In Proc. CIG 2009, IEEE (2009). ",
      "doi": "10.5555/1719293.1719305"
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E., and Moore, R. J. The life and death of online gaming communities: a look at guilds in World of Warcraft. In Proc. CHI 2007, ACM Press (2007), 839--848.  ",
      "doi": "10.1145/1240624.1240750"
    },
    {
      "text": "Electronic Arts. Dead Space 2. Xbox 360, 2011.",
      "doi": ""
    },
    {
      "text": "Finnegan, S., Holte, R., Xiao, G., and Trommelen, M. Machine learning for semi-automated gameplay analysis. In Game Developers Conference (GDC) (2005).",
      "doi": ""
    },
    {
      "text": "Gagné, A., El-Nasr, M. S., and Shaw, C. D. A deeper look at the use of telemetry for analysis of player behavior in RTS games. In Proc. ICEC 2011, Lecture Notes in Computer Science, Springer (2011), 247--257.  ",
      "doi": "10.1007/978-3-642-24500-8_26"
    },
    {
      "text": "Heyer, L. J., Kruglyak, S., and Yooseph, S. Exploring expression data: Identification and analysis of coexpressed genes. Genome Research 9, 11 (1999), 1106--1115.",
      "doi": ""
    },
    {
      "text": "Hoobler, N., Humphreys, G., and Agrawala, M. Visualizing competitive behaviors in multi-user virtual environments. In Proc. VIS 2004, IEEE Computer Society (2004), 163--170.  ",
      "doi": "10.1109/VISUAL.2004.120"
    },
    {
      "text": "Juul, J. Introduction to game time. In First Person: New Media as Story, Performance, and Game, N. Wardrip-Fruin and P. Harrigan, Eds., 1 ed. 2004, 131--141.",
      "doi": ""
    },
    {
      "text": "Kim, J. H., Gunn, D. V., Schuh, E., Phillips, B., Pagulayan, R. J., and Wixon, D. Tracking real-time user experience (TRUE): a comprehensive instrumentation solution for complex systems. In Proc. CHI 2008, ACM Press (2008), 443--452.  ",
      "doi": "10.1145/1357054.1357126"
    },
    {
      "text": "Köhler, W. Gestalt Psychology: An introduction to new concepts in modern psychology. Liveright Publishing Corporation.",
      "doi": ""
    },
    {
      "text": "Kruskal, J. B., and Wish, M. Multidimensional Scaling. Sage Publications, 1978.",
      "doi": ""
    },
    {
      "text": "Lewis, C., and Wardrip-Fruin, N. Mining game statistics from web services: a World of Warcraft armory case study. In Proc. FDG 2010, ACM Press (2010), 100--107.  ",
      "doi": "10.1145/1822348.1822362"
    },
    {
      "text": "MacQueen, J. B. Some methods for classification and analysis of multivariate observations. In Proc. of the 5th Berkeley Symposium on Mathematical Statistics and Probability, L. M. L. Cam and J. Neyman, Eds., vol. 1, University of California Press (1967), 281--297.",
      "doi": ""
    },
    {
      "text": "Medler, B., John, M., and Lane, J. Data Cracker: developing a visual game analytic tool for analyzing online gameplay. In Proc. CHI 2011, ACM Press (2011), 2365--2374.  ",
      "doi": "10.1145/1978942.1979288"
    },
    {
      "text": "Microsoft Game Studios. Fable 2. Xbox 360, 2008.",
      "doi": ""
    },
    {
      "text": "Milam, D., and El Nasr, M. S. Analysis of level design 'push & pull' within 21 games. In Proc. FDG 2010, ACM Press (2010), 139--146.  ",
      "doi": "10.1145/1822348.1822367"
    },
    {
      "text": "Moura, D., el Nasr, M. S., and Shaw, C. D. Visualizing and understanding players' behavior in video games: discovering patterns and supporting aggregation and comparison. In Proc. SIGGRAPH Sandbox 2011, ACM Press (2011), 11--15.  ",
      "doi": "10.1145/2018556.2018559"
    },
    {
      "text": "Nintendo. Super Mario Galaxy 2. Wii, 2010.",
      "doi": ""
    },
    {
      "text": "Pagulayan, R. J., Keeker, K., Wixon, D., Romero, R. L., and Fuller, T. The human-computer interaction handbook. L. Erlbaum Associates Inc., 2003, ch. User-centered design in games, 883--906. ",
      "doi": "10.5555/772072.772128"
    },
    {
      "text": "Phan, D., Xiao, L., Yeh, R., Hanrahan, P., and Winograd, T. Flow map layout. In Proc. INFOVIS 2005, IEEE Computer Society (2005), 219--224.  ",
      "doi": "10.1109/INFOVIS.2005.13"
    },
    {
      "text": "Psychostats, 2011. http://www.psychostats.com.",
      "doi": ""
    },
    {
      "text": "Thawonmas, R., and Iizuka, K. Visualization of online-game players based on their action behaviors. Int. Journal of Computer Games Technology (2008), 1--9.  ",
      "doi": "10.1155/2008/906931"
    },
    {
      "text": "Thawonmas, R., Kurashige, M., and Chen, K.-T. Detection of landmarks for clustering of online-game players. The Int. Journal of Virtual Reality 6, 3 (2007).",
      "doi": ""
    },
    {
      "text": "Tychsen, A. Crafting user experience via game metrics analysis. In Workshop Research Goals and Strategies for Studying User Experience and Emotion, part of NordiCHI 2008 (2008).",
      "doi": ""
    },
    {
      "text": "Valve Corporation. Team Fortress 2. PC, 2007.",
      "doi": ""
    },
    {
      "text": "Williams, D., Yee, N., and Caplan, S. E. Who plays, how much, and why? Debunking the stereotypical gamer profile. Journal of Computer-Mediated Communication 13, 4 (2008), 993--1018.",
      "doi": ""
    }
  ]
}