{
  "doi": "10.1145/2207676.2208417",
  "title": "Understanding agency in interaction design materials",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2499-2508",
  "year": 2012,
  "badges": [],
  "abstract": "We draw on the concept of agency in order to understand the process of how design materials 'talk back' to designers. In so doing, we illustrate the various levels at which agency can emerge in the context of intensive short-time prototyping sessions. In HCI, it is often assumed that the designer is the agent that acts intentionally in the design process. Contrary to this, recent notions of agency provide a way of analysing the performative role of design materials as intra-actions between components within a given phenomenon, rather than as meanings merely ascribed by actions of designers. The notion of agency puts focus on the emerging properties of materials and how they actively contribute to the way that design activity unfolds. The analyses showed how interaction design is to a large extent driven by emergent characteristics of available materials. The results have implications for understanding material interactions and materiality in interaction design.",
  "authors": [
    {
      "name": "Jakob Tholander",
      "institution": "Mobile Life, Stockholm University, Stockholm, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100187595",
      "orcid": "missing"
    },
    {
      "name": "Maria Normark",
      "institution": "Mobile Life Centre, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100425412",
      "orcid": "missing"
    },
    {
      "name": "Chiara Rossitto",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350605248",
      "orcid": "0000-0001-5819-8302"
    }
  ],
  "references": [
    {
      "text": "Barad, K. Posthumanist Performativity: Toward an Understanding of How Matter Comes to Matter In: Signs: Journal of Women in Culture and Society. 28(3). (2003).",
      "doi": ""
    },
    {
      "text": "Bardzell, J & Bardzell, S. Interaction criticism: a proposal and framework for a new discipline of HCI. Proc. CHI 2008. ACM Press. (2008).  ",
      "doi": "10.1145/1358628.1358703"
    },
    {
      "text": "Binder, T., De Michelis, G., T., Ehn, P., Jacucci, G., Linde, P., Wagner, I. Design Things. Cambridge, MA : MIT Press. (2011).",
      "doi": ""
    },
    {
      "text": "Coyne, R. D., & Snodgrass, A. D. (1991). Is designing mysterious? Challenging the dual knowledge thesis. Design Studies, 12(12, 3), 124--131.",
      "doi": ""
    },
    {
      "text": "Dourish. P. Where the action is. Foundations of Embodied Interaction. MIT Press. 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Dourish, P. Seeing Like an Interface, Proc OzCHI. ACM Press. (2007).  ",
      "doi": "10.1145/1324892.1324894"
    },
    {
      "text": "Fallman., D. Design-oriented human-computer interaction. Proc. CHI '03. ACM Press, New York, NY, USA, (2003). 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Gibson, J. The Theory of Affordances. In Perceiving, Acting, and Knowing, Eds. Shaw, R., and Bransford, J. (1977).",
      "doi": ""
    },
    {
      "text": "Hayles, K. How We Became Posthuman:Virtual Bodies in Cybernetics, Literature and Informatics. Chicago: University of Chicago Press. (1999). ",
      "doi": "10.5555/553246"
    },
    {
      "text": "Hutchins. E. Cognition in the Wild. MIT Press. (1995).",
      "doi": ""
    },
    {
      "text": "Iacucci, G., Wagner, I. Supporting Collaboration Ubiquitously: An augmented learning environment for architecture students. Proc ECSCW'03. Kluwer Academic Publishers, (2003). pp. 139--158 ",
      "doi": "10.5555/1241889.1241897"
    },
    {
      "text": "Jacucci, G., Wagner, I., Performative Roles of Materiality for Collective Creativity. Proc Creativity and Cognition 2007, (2007), ACM Press.  ",
      "doi": "10.1145/1254960.1254971"
    },
    {
      "text": "Laaksolaahti., J. (in preparation). Broken but polished. Unpublished Manuscript.",
      "doi": ""
    },
    {
      "text": "Latour B. On Interobjectivity. In Mind, Culture and Activity, Vol 3 (4) (1996). 228--245.",
      "doi": ""
    },
    {
      "text": "Lave, J. Cognition in Practice. (1988). Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Löwgren, J. and Stolterman, E. Thoughtful Interaction Design: A Design Perspective on Information Technology. The MIT Press. (2004). ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Jordan B., Henderson A.. Interaction Analysis: Foundation and Practices. The Journal of the Learning Sciences, 4 (1). (1995). 39--103.",
      "doi": ""
    },
    {
      "text": "Martin, D, O'Neill, J and Randall, D. Talking about (my) Generation': Creativity, Practice, Technology & Talk. Proc ECSCW. (2009). pp. 171--190.",
      "doi": ""
    },
    {
      "text": "Murphy, K. M.. Collaborative imagining: The interactive use of gestures, talk, and graphic representation in architectural practice. Semiotica, 156(1/4), (2005) 113145.",
      "doi": ""
    },
    {
      "text": "Norman, D. The Design of Everyday Things, Doubleday Business Press. (1990).",
      "doi": ""
    },
    {
      "text": "Pickering, A. The mangle of practice. University Of Chicago Press, (1995).",
      "doi": ""
    },
    {
      "text": "Robles, E. & M. Wiberg. Texturing the 'Material Turn' in Interaction Design, Proc TEI 2010. ACM Press. (2010).  ",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Rosner, D. and Taylor, A. S. Antiquarian answers: book restoration as a resource for design. Proc CHI '11. ACM Press, (2011). 2665--2668.  ",
      "doi": "10.1145/1978942.1979332"
    },
    {
      "text": "Schon, D. The Reflective Practitioner. How Professionals Think In Action. Basic Books. (1983)",
      "doi": ""
    },
    {
      "text": "Suchman, L. Plans and Situated Actions: the problem of human-machine communication. New York: Cambridge University Press. (1987). ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Suchman, L.. Human-Machine Reconfigurations: Plans and Situated Actions. (2006). Cambridge University Press ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Sundstrom, P & Hook, K. Hand in hand with the material: designing for suppleness, Proc CHI 2010, ACM Press. (2010).  ",
      "doi": "10.1145/1753326.1753396"
    },
    {
      "text": "Taylor, A. S.. Machine intelligence. Proc CHI '09, ACM Press (2009). pp. 2109--2118.  ",
      "doi": "10.1145/1518701.1519022"
    },
    {
      "text": "Tholander, J., Karlgren, K., Ramberg, R., and Sokjer, P. Where all the interaction is: sketching in interaction design as an embodied practice. Proc DIS '08. ACM Press, (2008), 445--454.  ",
      "doi": "10.1145/1394445.1394493"
    },
    {
      "text": "Vallgarda, A & Redstrom, J. Computational Composites. Proc CHI 2007. ACM Press. (2007). pp. 513-  ",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Wiberg, M, and Robles, E.. Texturing the \"material turn\" in interaction design. Proc TEI 2010. ACM Press. (2010)  ",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Wright, P & J. McCarthy. Experience-Centered Design., Morgan & Claypool Publishers. (2010).",
      "doi": ""
    },
    {
      "text": "Wolf, V.T., Rode, J., Sussman, J., and Kellogg, W. Dispelling \"design\" as the black art of CHI. Proc CHI '06. ACM Press, (2006). 521--530.  ",
      "doi": "10.1145/1124772.1124853"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evenson, S.. Research through design as a method for interaction design research in HCI. Proc CHI '07. (2007). 493--50.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}