{
  "doi": "10.1145/2207676.2208552",
  "title": "Talking in circles: selective sharing in google+",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1065-1074",
  "year": 2012,
  "badges": [],
  "abstract": "Online social networks have become indispensable tools for information sharing, but existing 'all-or-nothing' models for sharing have made it difficult for users to target information to specific parts of their networks. In this paper, we study Google+, which enables users to selectively share content with specific 'Circles' of people. Through a combination of log analysis with surveys and interviews, we investigate how active users organize and select audiences for shared content. We find that these users frequently engaged in selective sharing, creating circles to manage content across particular life facets, ties of varying strength, and interest-based groups. Motivations to share spanned personal and informational reasons, and users frequently weighed ''limiting' factors (e.g. privacy, relevance, and social norms) against the desire to reach a large audience. Our work identifies implications for the design of selective sharing mechanisms in social networks.",
  "authors": [
    {
      "name": "Sanjay Kairam",
      "institution": "Stanford Unviersity, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81416609309/rel-imgonly/headshot-square-2022.png",
      "acmid": "81416609309",
      "orcid": "missing"
    },
    {
      "name": "Mike Brzozowski",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309505971",
      "orcid": "missing"
    },
    {
      "name": "David Huffaker",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436595553",
      "orcid": "missing"
    },
    {
      "name": "Ed Chi",
      "institution": "Google, Inc., Mountain View, California, USA",
      "img": "/do/10.1145/contrib-81100330316/rel-imgonly/2018-edchi-dsc_3705-2048px.jpg",
      "acmid": "81100330316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. & Gross, R. Imagined communities: Awareness, information sharing, and privacy on the Facebook. Lect. Notes of Comp. Sci. 4258: 36--58. 2006.  ",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Adams, P. \"The Real-Life Social Network\". http://www.slideshare.net/padday/the-real-life-socialnetwork-v2. 2010.",
      "doi": ""
    },
    {
      "text": "Altman, I. The Environment and Social Behavior: Privacy, Personal Space, Territory, and Crowding. Brooks/Cole Pub. Co, Monterey, CA, USA. 1975.",
      "doi": ""
    },
    {
      "text": "Barnes, S. B. A privacy paradox: Social networking in the United States. First Monday, 11 (9). 2006.",
      "doi": ""
    },
    {
      "text": "Binder, J., Howes, A., & Sutcliffe, A. The problem of conflicting social spheres: effects of network structure on experienced tension in social network sites. Proc. CHI '09, 965--974. 2009.  ",
      "doi": "10.1145/1518701.1518849"
    },
    {
      "text": "Clauset, A., Shalizi, C. R., & Newman, M. E. J. Powerlaw distributions in empirical data. SIAM Review 51, 661--703. 2009.  ",
      "doi": "10.1137/070710111"
    },
    {
      "text": "Facebook, accessed 1/10/2012. http://www.facebook.com/press/info.php?statistics.",
      "doi": ""
    },
    {
      "text": "Farnham, S. D. & Churchill, E. F. Faceted identity, faceted lives: Social and technical issues with being yourself online. Proc. CSCW '11, 359--368. 2011.  ",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Garden City, New York: Doubleday. 1959.",
      "doi": ""
    },
    {
      "text": "Gross, R. & Acquisti, A. Information revelation and privacy in online social networks (The Facebook case). Proc. ACM WPES '05, 71--80. 2005.  ",
      "doi": "10.1145/1102199.1102214"
    },
    {
      "text": "Hall, E. T. The Hidden Dimension. New York: Doubleday. 1966.",
      "doi": ""
    },
    {
      "text": "Honeycutt, C. & Herring, S. C. Beyond microblogging: conversation and collaboration via Twitter. Proc. HICSS '09. 2009.  ",
      "doi": "10.1109/HICSS.2009.89"
    },
    {
      "text": "Hsieh, H. F. & Shannon, S. E. Three approaches to qualitative content analysis. Qual. Health. Res., 15 (9), 1277--1288. 2005.",
      "doi": ""
    },
    {
      "text": "Huffaker, D. A. & Calvert, S. L. Gender, identity, and language use in teenage blogs. JCMC, 10 (2). 2005.",
      "doi": ""
    },
    {
      "text": "Java, A., Song, X., Finin, T., & Tseng, B. Why we Twitter: understanding microblogging usage and communities. Proc. WebKDD/SNA-KDD '07. 2007.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Jones, S. & O'Neill, E. Feasibility of structural network clustering for group-based privacy control in social networks. Proc. SOUPS '10, 1--8. 2010.  ",
      "doi": "10.1145/1837110.1837122"
    },
    {
      "text": "Madden, M. & Zickuhr, K. Pew Internet, September 2011. http://www.pewinternet.org/Reports/2011/SocialNetworking-Sites.aspx.",
      "doi": ""
    },
    {
      "text": "Marwick, A. & boyd, d. I Tweet honestly, I Tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 96--113.",
      "doi": ""
    },
    {
      "text": "Naaman, M. Boase, J., & Lai, C.-H. Is it really about me? Message content in social awareness streams. Proc. CSCW '10, 189--192. 2010.  ",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Nardi, B., et al. Integrating communication and information through ContactMap. CACM 45 (4), 89--95.  ",
      "doi": "10.1145/505248.505251"
    },
    {
      "text": "Ozenc, F. K. & Farnham, S. D. Life \"modes\" in social media. Proc. CHI '11, 561--570. 2011.  ",
      "doi": "10.1145/1978942.1979022"
    },
    {
      "text": "Palen, L. & Dourish, P. Unpacking \"privacy\" for a networked world. Proc. CHI '03, 129--136. 2003.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Skeels, M. M. & Grudin, J. When social networks cross boundaries: A case study of workplace use of Facebook and LinkedIn. Proc. GROUP '09, 95--104. 2009.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Strater, K. & Lipfort, H. Strategies and struggles with privacy in an online social networking community. BCS-HCI '08, 111--119. 2008. ",
      "doi": "10.5555/1531514.1531530"
    },
    {
      "text": "Viégas, F. B. Bloggers' expectations of privacy and accountability: an initial survey. JCMC, 10 (3). 2005.",
      "doi": ""
    },
    {
      "text": "Wang, Y, et al. \"I regretted the minute I pressed share\": A qualitative study of regrets on Facebook. Proc. SOUPS '11, 1--13. 2011.  ",
      "doi": "10.1145/2078827.2078841"
    }
  ]
}