{
  "doi": "10.1145/2207676.2208390",
  "title": "Hand occlusion on a multi-touch tabletop",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2307-2316",
  "year": 2012,
  "badges": [],
  "abstract": "We examine the shape of hand and forearm occlusion on a multi-touch table for different touch contact types and tasks. Individuals have characteristic occlusion shapes, but with commonalities across tasks, postures, and handedness. Based on this, we create templates for designers to justify occlusion-related decisions and we propose geometric models capturing the shape of occlusion. A model using diffused illumination captures performed well when augmented with a forearm rectangle, as did a modified circle and rectangle model with ellipse \"fingers\" suitable when only X-Y contact positions are available. Finally, we describe the corpus of detailed multi-touch input data we generated which is available to the community.",
  "authors": [
    {
      "name": "Daniel Vogel",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    },
    {
      "name": "Géry Casiez",
      "institution": "LIFL & INRIA Lille, University of Lille, Villeneuve d'Ascq, Lille, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    }
  ],
  "references": [
    {
      "text": "Annett, M., Grossman, T., Wigdor, D., and Fitzmaurice, G. Medusa: a proximity-aware multi-touch tabletop. Proc. UIST'11, ACM (2011), 337--346.  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Apple Computer. iPad 2 User Guide. 2011.",
      "doi": ""
    },
    {
      "text": "Bragdon, A., Uguray, A., Wigdor, D., Anagnostopoulos, S., Zeleznik, R., and Feman, R. Gesture play: motivating online gesture learning with fun, positive reinforcement and physical metaphors. Proc. ITS'10, ACM (2010), 39--48.  ",
      "doi": "10.1145/1936652.1936661"
    },
    {
      "text": "Brandl, P., Leitner, J., Seifried, T., Haller, M., Doray, B., and To, P. Occlusion-aware menu design for digital tabletops. Proc. CHI'09, ACM (2009), 3223--3228.  ",
      "doi": "10.1145/1520340.1520461"
    },
    {
      "text": "Cao, X., Wilson, A., Balakrishnan, R., Hinckley, K., and Hudson, S. E. ShapeTouch: Leveraging Contact Shape on Interactive Surfaces. Proc. Horizontal Interactive Human Computer Systems, IEEE (2008).",
      "doi": ""
    },
    {
      "text": "Dang, C. T., Straub, M., and André, E. Hand distinction for multi-touch tabletop interaction. Proc. ITS '09, ACM (2009), 101--108.  ",
      "doi": "10.1145/1731903.1731925"
    },
    {
      "text": "Freeman, D., Benko, H., Morris, M. R., and Wigdor, D. ShadowGuides: visualizations for in-situ learning of multitouch and whole-hand gestures. Proc. ITS'09, ACM (2009), 165--172.  ",
      "doi": "10.1145/1731903.1731935"
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. Proc.UIST'05, ACM (2005), 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hancock, M. S. and Booth, K. S. Improving menu placement strategies for pen input. Proc. GI'04, CIPS (2004), 221--230. ",
      "doi": "10.5555/1006058.1006085"
    },
    {
      "text": "Hilliges, O., Izadi, S., Wilson, A. D., Hodges, S., Garcia-Mendoza, A., and Butz, A. Interactions in the air: adding further depth to interactive tabletops. Proc. UIST'09, ACM (2009), 139--148.  ",
      "doi": "10.1145/1622176.1622203"
    },
    {
      "text": "Hinrichs, U. and Carpendale, S. Gestures in the wild: studying multi-touch gesture sequences on interactive tabletop exhibits. Proc. CHI'11, ACM (2011), 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Holz, C. and Baudisch, P. Understanding touch. Proc. CHI'11, ACM (2011), 2501--2510.  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Käser, D. P., Agrawala, M., and Pauly, M. FingerGlass: efficient multiscale interaction on multitouch screens. Proc. CHI'11, ACM (2011), 1601--1610.  ",
      "doi": "10.1145/1978942.1979175"
    },
    {
      "text": "Kin, K., Agrawala, M., and DeRose, T. Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation. Proc. GI'09, CIPS (2009), 119--124. ",
      "doi": "10.5555/1555880.1555910"
    },
    {
      "text": "Kin, K., Miller, T., Bollensdorff, B., DeRose, T., Hartmann, B., and Agrawala, M. Eden: a professional multitouch tool for constructing virtual organic environments. Proc. CHI'11, ACM (2011), 1343--1352.  ",
      "doi": "10.1145/1978942.1979141"
    },
    {
      "text": "Micire, M., Desai, M., Courtemanche, A., Tsui, K. M., and Yanco, H. A. Analysis of natural gestures for controlling robot teams on multi-touch tabletop surfaces. Proc. ITS'09, ACM (2009), 41--48.  ",
      "doi": "10.1145/1731903.1731912"
    },
    {
      "text": "Morris, M. R., Wobbrock, J. O., and Wilson, A. D. Understanding users' preferences for surface gestures. Proc. GI'10, CIPS (2010), 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Pheasant, S. and Hastlegrave, C. Bodyspace: Anthropometry, Ergonomics and the Design of the Work. CRC, 2006.",
      "doi": ""
    },
    {
      "text": "Schmidt, D., Chong, M. K., and Gellersen, H. HandsDown. Proc. NordCHI'10, ACM (2010), 432--441.  ",
      "doi": "10.1145/1868914.1868964"
    },
    {
      "text": "Shen, C., Ryall, K., Forlines, C., et al. Informing the Design of Direct-Touch Tabletops. IEEE Comput. Graph. Appl. 26, 5 (2006), 36--46.  ",
      "doi": "10.1109/MCG.2006.109"
    },
    {
      "text": "Shneiderman, B. Touch Screens Now Offer Compelling Uses. IEEE Software 8, 2 (1991), 93--94, 107.  ",
      "doi": "10.1109/52.73754"
    },
    {
      "text": "Vogel, D. and Balakrishnan, R. Direct Pen Interaction with a Conventional Graphical User Interface. Human-Computer Interaction 25, 4 (2010), 324--388.",
      "doi": ""
    },
    {
      "text": "Vogel, D. and Balakrishnan, R. Occlusion-aware interfaces. Proc. CHI'10, ACM (2010), 263--272.  ",
      "doi": "10.1145/1753326.1753365"
    },
    {
      "text": "Vogel, D. and Baudisch, P. Shift: a technique for operating pen-based interfaces using touch. Proc. CHI'07, ACM (2007), 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Vogel, D., Cudmore, M., Casiez, G., Balakrishnan, R., and Keliher, L. Hand Occlusion with Tablet-sized Direct Pen Input. Proc. CHI'09, ACM (2009), 557--566.  ",
      "doi": "10.1145/1518701.1518787"
    },
    {
      "text": "Wagner, D. and Schmalstieg, D. ARToolKitPlus for Pose Tracking on Mobile Devices. Proc. CVWW'07, (2007).",
      "doi": ""
    },
    {
      "text": "Wigdor, D., Benko, H., Pella, J., Lombardo, J., and Williams, S. Rock & rails: extending multi-touch interactions with shape gestures to enable precise spatial manipulations. Proc. CHI'11, ACM (2011), 1581--1590.  ",
      "doi": "10.1145/1978942.1979173"
    },
    {
      "text": "Wigdor, D., Forlines, C., Baudisch, P., Barnwell, J., and Shen, C. Lucid touch: a see-through mobile device. Proc. UIST'07, ACM (2007), 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Wigdor, D., Leigh, D., Forlines, C., et al. Under the table interaction. Proc. UIST'06, ACM (2006), 259--268.  ",
      "doi": "10.1145/1166253.1166294"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. Proc. CHI'09, ACM (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wroblewski, L. Touch Gesture Reference Guide. 2010.",
      "doi": ""
    }
  ]
}