{
  "doi": "10.1145/2207676.2207782",
  "title": "MimicTile: a variable stiffness deformable user interface for mobile devices",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "745-748",
  "year": 2012,
  "badges": [],
  "abstract": "MimicTile is a novel variable stiffness deformable user interface for mobile devices that implements two key features. The first feature is an input interface that accepts a variety of deformation-based gestures, providing a user with several ways of interacting with a small mobile device. The other feature is the ability to provide information to the user through haptic feedback by varying the stiffness of the interface. The features are suitable for enhancing mobile applications. They were implemented using only shape memory alloy (SMA) wires as the actuator. SMA wire is extremely flexible, making it ideal for deformable user interfaces. In MimicTile, SMA wires act as both actuators and external input sensors. The actuator function works by altering stiffness based on user input. This study also discusses ideas for further development of deformable user interfaces.",
  "tags": [
    "mobile devices",
    "deformable user interfaces",
    "haptic feedback",
    "gestures",
    "shape memory alloy"
  ],
  "authors": [
    {
      "name": "Yusuke Nakagawa",
      "institution": "The University of Tokyo, Bunkyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502735349",
      "orcid": "missing"
    },
    {
      "name": "Akiya Kamimura",
      "institution": "National Instite of Advanced Industrial Science and Technology (AIST), Tsukuba, Japan, ,",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619371",
      "orcid": "missing"
    },
    {
      "name": "Yoichiro Kawaguchi",
      "institution": "The University of Tokyo, Bunkyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100605028",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Toki corporation. http://www.toki.co.jp/.",
      "doi": ""
    },
    {
      "text": "Badshah, A., Gupta, S., Cohn, G., Villar, N., Hodges, S., and Patel, S. N. P. Interactive generator: A self-powered haptic feedback device. In Proceedings of CHI 2011, 2051--2054.  ",
      "doi": "10.1145/1978942.1979240"
    },
    {
      "text": "Coelho, M., and Maes, P. Sprout I/O: A texturally rich interface. In Proceedings of TEI 2008, 221--222.  ",
      "doi": "10.1145/1347390.1347440"
    },
    {
      "text": "Gupta, S., Campbell, T., Hightower, J. R., and Patel, S. N. Squeezeblock: Using virtual springs in mobile devices for eyes-free interaction. In Proceedings of UIST 2010, 10--14.  ",
      "doi": "10.1145/1866029.1866046"
    },
    {
      "text": "Ikuta, K., Tsukamoto, M., and Hirose, S. Shape memory alloy servo actuator system with electric resistance feedback and application for active endoscope. In Proceedings of ICRA 1988, 427--430.",
      "doi": ""
    },
    {
      "text": "Lahey, B., Girouard, A., Burleson, W., and Vertegaal, R. Paperphone: Understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proceedings of CHI 2011, 1303--1312.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Lee, S.-S., Kim, S., Jin, B., Choi, E., adn Xu Jia, B. K., Kim, D., and Lee, K.-P. How users manipulate deformable displays as input devices. In Proceedings of CHI 2010, 1647--1656.  ",
      "doi": "10.1145/1753326.1753572"
    },
    {
      "text": "Looser, J., Grasset, R., and Billinghurst, M. A 3D flexible and tangible magic lens in augmented reality. In Proceedings of ISMAR 2007, 51--54.  ",
      "doi": "10.1109/ISMAR.2007.4538825"
    },
    {
      "text": "Michelitsch, G., Williams, J., Osen, M., Jimenez, B., and Rapp, S. Haptic chameleon: a new concept of shape-changing user interface controls with force feedback. In Proceedings of CHI 2004 extended abstracts, 1305--1308.  ",
      "doi": "10.1145/985921.986050"
    },
    {
      "text": "M.W.Jiang, R.C.Wang, J.Z.Wang, and D.W.Jin. A method of recognizing finger motion using wavelet transform of surface emg signal. International Conference of the Engineering in Medicine and Biology Society (2005), 2672--2674.",
      "doi": ""
    },
    {
      "text": "Oropesa, E., Cycon, H. L., and Jobert, M. Sleep stage classification using wavelet transform and neural network. International Computer Science Institute (1999).",
      "doi": ""
    },
    {
      "text": "Schwesig, C., Poupyrev, I., and Mori, E. Gummi: A bendable computer. In Proceedings of CHI 2004, 263--270.  ",
      "doi": "10.1145/985692.985726"
    }
  ]
}