{
  "doi": "10.1145/2207676.2207740",
  "title": "JigsawMap: connecting the past to the future by mapping historical textual cadasters",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "463-472",
  "year": 2012,
  "badges": [],
  "abstract": "In this paper, we present an interactive visualization tool, JigsawMap, for visualizing and mapping historical textual cadasters. A cadaster is an official register that records land properties (e.g., location, ownership, value and size) for land valuation and taxation. Such mapping of old and new cadasters can help historians understand the social/economic background of changes in land uses or ownership. With JigsawMap, historians can continue mapping older or newer cadasters. In this way, JigsawMap can connect the past land survey results to today and to the future. We conducted usability studies and long term case studies to evaluate JigsawMap, and received positive responses. As well as summarizing the evaluation results, we also present design guidelines for participatory design projects with historians.",
  "tags": [
    "case study",
    "history",
    "graph layout",
    "cadaster",
    "jigsawmap",
    "interactive visualization"
  ],
  "authors": [
    {
      "name": "Hyungmin Lee",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502784899",
      "orcid": "missing"
    },
    {
      "name": "Sooyun Lee",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502649580",
      "orcid": "missing"
    },
    {
      "name": "Namwook Kim",
      "institution": "Samsung Techwin, Changwon-si, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502691169",
      "orcid": "missing"
    },
    {
      "name": "Jinwook Seo",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100413624",
      "orcid": "0000-0002-7734-822X"
    }
  ],
  "references": [
    {
      "text": "Di Battista, G., Eades, P., Tamassia, R. and Tollis, I G., Algorithms for drawing graphs: an annotated bibliography. Computational Geometry: Theory and Applications 1994, 4, 5, (1994), 235--282.  ",
      "doi": "10.1016/0925-7721%2894%2900014-X"
    },
    {
      "text": "Elias, M., Elson, J., Fisher, D. and Howell. J, Do I live in a flood basin?: synthesizing ten thousand maps. In Proc. SIGCHI 2008, ACM (2008), 255--264.  ",
      "doi": "10.1145/1357054.1357100"
    },
    {
      "text": "Elson, J., Howell, J., and Douceur, J. R., MapCruncher: integrating the world's geographic information. SIGOPS Operating System Review 2007, 41, 2 ACM (2007), 50--59.  ",
      "doi": "10.1145/1243418.1243425"
    },
    {
      "text": "Gansner, E. R., Koutsofios, E., North, S. C. and Vo, K.-P., A Technique for Drawing Directed Graphs. Trans. on Software Engineering 1993, 19, 3 IEEE (1993), 214--230.  ",
      "doi": "10.1109/32.221135"
    },
    {
      "text": "Google Map Maker, Sep 2011. http://www.google.com/mapmaker.",
      "doi": ""
    },
    {
      "text": "Holten, D. and van Wijk, J. J., A user study on visualizing directed edges in graphs. In Proc. SIGCHI 2011, ACM (2009), 2299--2308.  ",
      "doi": "10.1145/1518701.1519054"
    },
    {
      "text": "Holten, D., Isenberg, P., van Wijk, J.J. and Fekete, J., An extended evaluation of the readability of tapered, animated, and textured directed-edge representations in node-link graphs. In Proc. PacificVis 2009, IEEE (2009), 195--202. ",
      "doi": "10.5555/2015551.2015652"
    },
    {
      "text": "Hypercities. http://hypercities.com/.",
      "doi": ""
    },
    {
      "text": "Kim, K., The Grasp on the Chinchôn and the Landholder through the Land Register and the Cadastral Survey, KYUJANGGAK 2010, 37 KIKS (Kyujanggak Institute for Korean Studies), (2010), 1--30.",
      "doi": ""
    },
    {
      "text": "Lyons, K. A., Cluster busting in anchored graph drawing, In Proc. CASCON 1992, 1, (1992), 7--17. ",
      "doi": "10.5555/962198.962200"
    },
    {
      "text": "Miyajima, H., Comparative analysis of Kwangmu yang'an and Cadastral, Research on the Cadastral Survey in Chosôn dynasty, Minumsa(1997), 199--248.",
      "doi": ""
    },
    {
      "text": "OpenStreetMap, Sep 2011. http://openstreetmap.org.",
      "doi": ""
    },
    {
      "text": "Rohrschneider, M., Heine, C., Reichenbach, A. Kerren, A. and Scheuermann, G., A Novel Grid-Based Visualization Approach for Metabolic Networks with Advanced Focus& Context View, In Proc. 17th International Symposium on Graph Drawing 2009, Lect. Notes Comp. Sci.. Edited by Emden Gansner DE, Springer (2009), 268--279.  ",
      "doi": "10.1007/978-3-642-11805-0_26"
    },
    {
      "text": "Shneiderman, B. and Plaisant, C., Strategies for evaluating information visualization tools: multi-dimensional in-depth long-term case studies. In Proc. AVI BELIV 2006, ACM (2006), 1--7.  ",
      "doi": "10.1145/1168149.1168158"
    },
    {
      "text": "Shneiderman, B. Tree visualization with tree-maps: 2D space-filling approach. Trans. on Graphics 1992, 11, 1 ACM (1992), 92--99.  ",
      "doi": "10.1145/102377.115768"
    },
    {
      "text": "Slingsby, A., Dykes, J. and Wood, J., Configuring Hierarchical Layouts to Address Research Questions. Trans. on Visualization and Computer Graphics 2009, 15, 6 IEEE (2009), 977--984.  ",
      "doi": "10.1109/TVCG.2009.128"
    },
    {
      "text": "Wikimapia, Sep 2011. http://wikimapia.org.",
      "doi": ""
    },
    {
      "text": "Wood, J. and Dykes J., Spatially ordered treemaps. Trans. on Visualization and Computer Graphics 2008, 14, 6 IEEE (2008), 1348--1355.  ",
      "doi": "10.1109/TVCG.2008.165"
    }
  ]
}