{
  "doi": "10.1145/2207676.2208575",
  "title": "Putting your best foot forward: investigating real-world mappings for foot-based gestures",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1229-1238",
  "year": 2012,
  "badges": [],
  "abstract": "Foot-based gestures have recently received attention as an alternative interaction mechanism in situations where the hands are pre-occupied or unavailable. This paper investigates suitable real-world mappings of foot gestures to invoke commands and interact with virtual workspaces. Our first study identified user preferences for mapping common mobile-device commands to gestures. We distinguish these gestures in terms of discrete and continuous command input. While discrete foot-based input has relatively few parameters to control, continuous input requires careful design considerations on how the user's input can be mapped to a control parameter (e.g. the volume knob of the media player). We investigate this issue further through three user-studies. Our results show that rate-based techniques are significantly faster, more accurate and result if far fewer target crossings compared to displacement-based interaction. We discuss these findings and identify design recommendations.",
  "authors": [
    {
      "name": "Jason Alexander",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019697",
      "orcid": "0000-0001-6093-6116"
    },
    {
      "name": "Teng Han",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488652855",
      "orcid": "missing"
    },
    {
      "name": "William Judd",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502784774",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Aliakseyeu, D., Irani, P., Lucero, A., Subramanian, S. Multi-flick: An Evaluation of Flick-based Scrolling Techniques for Pen Interfaces. CHI '08, 1689--1698.  ",
      "doi": "10.1145/1357054.1357319"
    },
    {
      "text": "Angel O. K., Chan, A., Ng., A., Luk, B. L. A Preliminary Analysis of Movement Times and Subjective Evaluations for a Visually-Controlled FootTapping Task on Touch Pad Device, IMECS '10.",
      "doi": ""
    },
    {
      "text": "Augsten, T., Kaefer, K., Meusel, R., Fetzer, C., Kanitz, D., Stoff., T., Becker, T., Holz, C. and Baudisch, P. Multitoe: High-Precision Interaction with Back-Projected Floors Based on High-Resolution MultiTouch Input. UIST '10, 209--218.  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Crossan, A., S. Brewster, and A. Ng. Foot Tapping for Mobile Interaction. BCS HCI '10. ",
      "doi": "10.5555/2146303.2146366"
    },
    {
      "text": "Grandjean, E. (1969) Fitting the task to the man: an ergonomic approach. Taylor and Francis, pp. 372.",
      "doi": ""
    },
    {
      "text": "Han, T., Alexander, J., Karnik, A., Irani, P., Subramanian, S. Kick: Investigating The Use Of Kick Gestures For Mobile Interactions. MobileHCI '11.  ",
      "doi": "10.1145/2037373.2037379"
    },
    {
      "text": "Hancock, M. S., Vernier, F., Wigdor, D., Carpendale, S., Chen, S. Rotation and Translation Mechanisms for Tabletop Interaction. Tabletop '06, 79--88.  ",
      "doi": "10.1109/TABLETOP.2006.26"
    },
    {
      "text": "Iso, T., and Yamazaki, K. Gait analyzer based on a cellphone with a single three-axis accelerometer. MobileHCI '06, 141--144.  ",
      "doi": "10.1145/1152215.1152244"
    },
    {
      "text": "Kratz, S. and M. Rohs. Protractor3D: A Closed-form Solution to Rotation-invariant 3D Gestures. IUI '11.  ",
      "doi": "10.1145/1943403.1943468"
    },
    {
      "text": "Liu, J., Pinelle, D., Gutwin, C., Subramanian, S. Improving digital handoff in shared tabletop workspaces. Tabletop '08, 9--16.",
      "doi": ""
    },
    {
      "text": "Paelke, V., Reimann, C., Stichling, D. Foot-based mobile interaction with games. ACE '04, 321--324.  ",
      "doi": "10.1145/1067343.1067390"
    },
    {
      "text": "Paelke, V., Reimann, C., Stichling, D. Kick-up menus. CHI EA '04, 1552.  ",
      "doi": "10.1145/985921.986128"
    },
    {
      "text": "Pakkanen, T., Raisamo, R. Appropriateness of foot interaction for non-accurate spatial tasks. CHI EA '04, 1123--1126.  ",
      "doi": "10.1145/985921.986004"
    },
    {
      "text": "Paradiso, J. A., Hsiao, K. Y., Benbasat, A. Interfacing to the foot: apparatus and applications. CHI EA '00, 175--176.  ",
      "doi": "10.1145/633292.633389"
    },
    {
      "text": "Paradiso J. A., et al. Interactive therapy with instrumented footwear. CHI EA '04, 1341--1343.  ",
      "doi": "10.1145/985921.986059"
    },
    {
      "text": "Pearson, G., Weiser, M. Exploratory Evaluations of Two Versions of a Foot-operated Cursor-positioning Device in a Target Selection Task, SIGCHI Bulletin 1988, Vol. 19, Issue 3, 70--75.  ",
      "doi": "10.1145/49108.1046356"
    },
    {
      "text": "Rahman, M., Gustafson, S., Irani, P. and Subramanian, S. Tilt techniques: investigating the dexterity of wristbased input. CHI '09, 1943--1952.  ",
      "doi": "10.1145/1518701.1518997"
    },
    {
      "text": "Rovers, A. F. and Van Essen, H. A. Guidelines for haptic interpersonal communication applications: an exploration of foot interaction styles. Virtual Reality 9, 2-3 (2006), 177--191.  ",
      "doi": "10.5555/1124635.1124642"
    },
    {
      "text": "Ruiz, J., Li, Y., Lank, E. User-defined motion gestures for mobile interaction. CHI '11, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Schöning, J., Daiber, F., Kruger, A., Rohs, M. Using hands and feet to navigate and manipulate spatial data. CHI EA '04, 4663--4668.  ",
      "doi": "10.1145/1520340.1520717"
    },
    {
      "text": "Tetsuya, Y., Tsukamoto, M., Yoshihisa, T. Foot-Step Input Method for Operation Information Devices While Jogging. SAINT '08, 173--176.  ",
      "doi": "10.1109/SAINT.2008.97"
    },
    {
      "text": "Scott, J., Dearman, D., Truong, K. Sensing Foot Gestures from the Pocket. UIST '10, 199--208.  ",
      "doi": "10.1145/1866029.1866063"
    },
    {
      "text": "Winograd, T, Bringing Design to Software. AddisonWesley, pp. 234. ",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., Wilson, A. D. UserDefined Gestures for Surface Computing. CHI '09, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}