{
  "doi": "10.1145/2207676.2208570",
  "title": "Engaging older people using participatory design",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1199-1208",
  "year": 2012,
  "badges": [],
  "abstract": "The use of digital technologies is increasingly proposed in health and social care to address the aging population phenomenon but, in practice, the designers of these technologies are ill equipped to design for older people. We suggest participatory design as an approach to improving the quality of design for older people but, based on previous work and our own experiences, identify four central issues that participatory design approaches need to address. We describe an approach to early engagement in design with older people that address each of these issues and some of our experiences applying the approach in a variety of different design projects. We conclude by discussing some of the issues that have been highlighted when attempting apply this approach in different design contexts and the issues that have been raised when working with partners who are less committed to the idea of engaging with older adults in participatory design.",
  "tags": [
    "participatory design",
    "empowerment",
    "older people"
  ],
  "authors": [
    {
      "name": "Stephen Lindsay",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    },
    {
      "name": "Daniel Jackson",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421599462",
      "orcid": "missing"
    },
    {
      "name": "Guy Schofield",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474697023",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Ballegaard, S.A., Hansen, T.R., and Kyng, M. Healthcare in Everyday Life - Designing Healthcare Services for Daily Life. In Proc. CHI 2008, ACM Press (2008), 1807--1816.  ",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Barrett, J. and Kirk, S. Running focus groups with elderly and disabled elderly participants. Applied Ergonomics 31, 6 (2000), 621--629.",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Briggs, P. and Olivier, P. Film as Invisible Design: The example of the Biometric Daemon. Video Showcase CHI 2009, ACM Press (2009).  ",
      "doi": "10.1145/1520340.1520517"
    },
    {
      "text": "Bødker, S. When second wave HCI meets third wave challenges. In Proc. NordiCHI' 2006, ACM Press (2006), 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Carrigan, M. Segmenting the grey market/: the case for fifty-plus lifegroups. Journal of Marketing 4, 2 (1998), 43--56.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. and Rosson, M.B. Getting around the taskartefact cycle: how to make claims and design by scenario. ACM TOIS 10, 2 (1992), 212--220.  ",
      "doi": "10.1145/146802.146834"
    },
    {
      "text": "Coleman, G.W., Gibson, L., Hanson, V.L., Bobrowicz, A., and Mckay, A. Engaging The Disengaged/: How Do We Design Technology for Digitally Excluded Older Adults/? In Proc. DIS 2010, ACM Press (2010), 175178.  ",
      "doi": "10.1145/1858171.1858202"
    },
    {
      "text": "Eisma, R., Dickinson, A., Goodman, J., Syme, A., Tiwari, L., and Newell, A.F. Early user involvement in the development of information technology-related products for older people. Universal Access in the Information Society 3, 2 (2004), 131--140.  ",
      "doi": "10.1007/s10209-004-0092-z"
    },
    {
      "text": "Gibbs, A. Focus groups. Social Research Update 19, 8 (1997).",
      "doi": ""
    },
    {
      "text": "Gregor, P. and Newell, A.F. Designing for dynamic diversity: making accessible interfaces for older people. In Proc. WUAUC 2001, ACM Press (2001), 90--92.  ",
      "doi": "10.1145/564526.564550"
    },
    {
      "text": "Gregor, P., Newell, A.F., and Zajicek, M. Designing for dynamic diversity: interfaces for older people. In Proc. ASSETS 2002, ACM Press (2002), 151--156.  ",
      "doi": "10.1145/638249.638277"
    },
    {
      "text": "Harman, D. The aging process. Proceedings of the National Academy of Sciences 78, 11 (1981), 71247134.",
      "doi": ""
    },
    {
      "text": "Hook, J., Green, D., Mccarthy, J., Taylor, S., Wright, P., and Olivier, P. A VJ Centered Exploration of Expressive Interaction. In Proc. CHI 2011, ACM Press (2011), 1265--1274.  ",
      "doi": "10.1145/1978942.1979130"
    },
    {
      "text": "Joyce, K., Williamson, J., and Mamo, L. Technology, Science and Ageism: An Examination of Three Patterns of Discrimination. Indian Journal of Gerontology 21, (2007), 110--127.",
      "doi": ""
    },
    {
      "text": "Keith, S. and Whitney, G. Bridging the gap between young designers and older users in an inclusive society. In Proc. The good, the bad and the challenging: the user and the future of ICT, (1998).",
      "doi": ""
    },
    {
      "text": "Light, A. Democratising Technology/: Making Transformation using Designing , Performance and Props. In Proc. CHI 2011, ACM Press (2011), 22392242.  ",
      "doi": "10.1145/1978942.1979269"
    },
    {
      "text": "Lindsay, S., Brittain, K., Jackson, D., Ladha, C., Ladha, K., and Olivier, P. Empathy, Participatory Design and People with Dementia. In Proc. CHI 2012, ACM Press (2012).  ",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Lines, L. and Hone, K.S. Research methods for older adults. In Proc BCS HCI 2002, (2002).",
      "doi": ""
    },
    {
      "text": "Mackay, W.E., Ratzer, A.V., and Janecek, P. Video Artifacts for Design/: Bridging the Gap Between Abstraction and Detail. In Proc. DIS 2000, (2000), 7282.  ",
      "doi": "10.1145/347642.347666"
    },
    {
      "text": "Mancini, C., Rogers, Y., Bandara, A.K., Coe, T., Jedrzejczyk, L., Joinson, A.N., Price, B.A., Thomas, K., and Nuseibeh, B. Contravision: exploring users' reactions to futuristic technology. In Proc. CHI 2010, ACM Press (2010), 153--162.  ",
      "doi": "10.1145/1753326.1753350"
    },
    {
      "text": "Massimi, M. and Baecker, R. Participatory design process with older users. In Proc. UbiCoomp2006 Workshop on future media, (2006).",
      "doi": ""
    },
    {
      "text": "McNaney, R., Lindsay, S., Ladha, K., Ladha, C., Schofield, G., Plötz, T., Hammerla, N., Jackson, D., Walker, R., Miller, N., et al. Cueing Swallowing in Parkinson's Disease. In Proc. CHI 2011, (2011), 619622.  ",
      "doi": "10.1145/1978942.1979030"
    },
    {
      "text": "Muller, M. PICTIVE: Democratizing the dynamics of the design session. Lawrence Erbaulm, 1993.",
      "doi": ""
    },
    {
      "text": "Myerson, J. and Lee, Y. Designing with the poeple, for the people and by the people. In Proc. Design Activism and Social Change, (2011).",
      "doi": ""
    },
    {
      "text": "Newell, A., Carmichael, A., Morgan, M., and Dickinson, A. The use of theatre in requirements gathering and usability studies. Interacting with Computers 18, 5 (2006), 996--1011.  ",
      "doi": "10.1016/j.intcom.2006.05.003"
    },
    {
      "text": "Newell, A.F. and Gregor, P. Extra-Ordinary HumanMachine Interaction: What can be Learned from People with Disabilities? Cognition, Technology & Work 1, 2 (1999), 78--85.",
      "doi": ""
    },
    {
      "text": "Oliver, M. and Sapey, B. Social Work With Disabled People. Palgrave Macmillan, 2006.",
      "doi": ""
    },
    {
      "text": "Raijmaker, B., Gaver, W.W., and Bishay, J. Design Documentaries/: Inspiring Design Research Through Documentary Film. In Proc. DIS 2006, ACM Press (2006), 229--238.  ",
      "doi": "10.1145/1142405.1142441"
    },
    {
      "text": "Ryan, E.B., Szechtman, B., and Bodkin, J. Attitudes toward younger and older adults learning to use computers. The Journal of Gerontology 47, 2 (1992), 96--106.",
      "doi": ""
    },
    {
      "text": "Smith, J.P. The changing economic circumstances of the elderly: Income, wealth, and social security.",
      "doi": ""
    },
    {
      "text": "Spence, A.P. Biology of Human Aging. Prentice Hall, 1995.",
      "doi": ""
    },
    {
      "text": "Vines, J., Dunphy, P., Blythe, M., Lindsay, S., Monk, A., and Olivier, P. The Joy of Cheques: Trust, Paper and Eighty Somethings. In Proc. CSCW 2012, ACM Press (2012).  ",
      "doi": "10.1145/2145204.2145229"
    },
    {
      "text": "Wardell, F. Who volunteers? British Journal of Social Work 30, 2 (2000), 227--248.",
      "doi": ""
    },
    {
      "text": "Wilkowska, W. and Ziefle, M. Which Factors Form Older Adults' Acceptance of Mobile Information and Communication Technologies? In HCI and Usability for e-Inclusion. 2009, 81--101.  ",
      "doi": "10.1007/978-3-642-10308-7_6"
    },
    {
      "text": "Wright, P.C. and McCarthy, J. Technology as Experience. MIT Press, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Position paper of the American Dietetic Association: Nutrition across the spectrum of aging. 105, 4 (2005), 616--633.",
      "doi": ""
    }
  ]
}