{
  "doi": "10.1145/2207676.2208382",
  "title": "Asking the right person: supporting expertise selection in the enterprise",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2247-2256",
  "year": 2012,
  "badges": [],
  "abstract": "Expertise selection is the process of choosing an expert from a list of recommended people. This is an important and nuanced step in expertise location that has not received a great deal of attention. Through a lab-based, controlled investigation with 35 enterprise workers, we found that presenting additional information about each recommended person in a search result list led the participants to make quicker and better-informed selections. These results focus attention on a currently understudied aspect of expertise location--expertise selection--that could greatly improve the usefulness of supporting systems. We also asked participants to rate the type of information that might be most useful for expertise selection on a paper prototype containing 36 types of potentially helpful information. We identified sixteen types of this information that may be most useful for various expertise selection tasks.",
  "tags": [
    "expertise location",
    "office",
    "expertise recommender systems",
    "expertise selection"
  ],
  "authors": [
    {
      "name": "Svetlana Yarosh",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, United States",
      "img": "/do/10.1145/contrib-81350580946/rel-imgonly/goldyandlana.jpg",
      "acmid": "81350580946",
      "orcid": "0000-0001-8389-2064"
    },
    {
      "name": "Tara Matthews",
      "institution": "IBM Almaden, San Jose, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Michelle Zhou",
      "institution": "IBM Almaden, San, California, United States",
      "img": "/do/10.1145/contrib-81100264735/rel-imgonly/mzhou_81100264735.jpg",
      "acmid": "81100264735",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, T.J. Managing the Flow of Technology. MIT Press, Cambridge, 1977.",
      "doi": ""
    },
    {
      "text": "Campbell, C.S., Maglio, P.P., Cozzi, A., and Dom, B. Expertise identification using email communications. Proc. of CIKM, (2003), 528.  ",
      "doi": "10.1145/956863.956965"
    },
    {
      "text": "Ehrlich, K., Lin, C.-yung, and Griffiths-fisher, V. Searching for Experts in the Enterprise: Combining Text and Social Network Analysis. Proc. of GROUP, (2007), 117--126.  ",
      "doi": "10.1145/1316624.1316642"
    },
    {
      "text": "Granovetter, M.S. The Strength of Weak Ties. American Journal of Sociology 7, 6 (1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Groth, K. and Bowers, J. On Finding Things Out: Situating Organisational Knowledge in CSCW. Proc. of ECSCW, (2001), 279--298. ",
      "doi": "10.5555/1241867.1241882"
    },
    {
      "text": "Guy, I., Perer, A., Daniel, T., et al. Guess Who? Enriching the Social Graph through a Crowdsourcing Game. Proc. of CHI, (2011), 1373--1382.  ",
      "doi": "10.1145/1978942.1979145"
    },
    {
      "text": "Lin, C.-Y., Ehrlich, K., Griffiths-Fisher, V., and Desforges, C. SmallBlue: People Mining for Expertise Search. IEEE Multimedia 15, 1 (2008), pp. 78--84.  ",
      "doi": "10.1109/MMUL.2008.17"
    },
    {
      "text": "Mamykina, L., Manoim, B., Mittal, M., Hripcsak, G., and Hartmann, B. Design Lessons from the Fastest Q & A Site in the West. Proc. of CHI, (2011), 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "McDonald, D.W. and Ackerman, M.S. Just Talk to Me: A Field Study of Expertise Location. Proc. of CSCW, (1998), 315--324.  ",
      "doi": "10.1145/289444.289506"
    },
    {
      "text": "McDonald, D.W. and Ackerman, M.S. Expertise Recommender: A Flexible Recommendation System and Architecture. Proc. of CSCW, (2000), 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Reichling, T. and Veith, M. Expertise Sharing in a Heterogeneous Organizational Environment. Proc. of ECSCW, (2005), 325--345. ",
      "doi": "10.5555/1242029.1242046"
    },
    {
      "text": "Reichling, T. and Wulf, V. Expert Recommender Systems in Practice: Evaluating Semi-automatic Profile Generation. Proc. of CHI, (2009), 59--68.  ",
      "doi": "10.1145/1518701.1518712"
    },
    {
      "text": "Ronen, I., Ofek-Koifman, S., Shahar, E., et al. Social networks and discovery in the enterprise (SaND). Proc. of SIGIR, (2009), 836.  ",
      "doi": "10.1145/1571941.1572156"
    },
    {
      "text": "Shami, N.S., Ehrlich, K., Gay, G., and Hancock, J.T. Making sense of strangers' expertise from signals in digital artifacts. Proc. of CHI, ACM Press (2009), 6978.  ",
      "doi": "10.1145/1518701.1518713"
    },
    {
      "text": "Shami, N.S. Pick Me! Link Selection in Expertise Search Results. Proc. of CHI, (2008), 1089--1092.  ",
      "doi": "10.1145/1357054.1357223"
    },
    {
      "text": "Sinha, R. and Swearingen, K. The role of transparency in recommender systems. Proc. of CHI, ACM Press (2002), 830--831.  ",
      "doi": "10.1145/506443.506619"
    },
    {
      "text": "Terveen, L. and Mcdonald, D.W. Social Matching: A Framework and Research Agenda. ToCHI 12, 3 (2005), 401--434.  ",
      "doi": "10.1145/1096737.1096740"
    },
    {
      "text": "Thom, J., Helsley, S.Y., Matthews, T.L., Daly, E.M., and Millen, D.R. What Are You Working On? Status Message Q & A in an Enterprise SNS. Proc. of ECSCW, (2011).",
      "doi": ""
    },
    {
      "text": "Vivacqua, A.S. Agents for Expertise Location Assisting the Help-Seeking Process. AAAI Technical Report SS-99-03, (1999).",
      "doi": ""
    },
    {
      "text": "White, R.W., Richardson, M., and Liu, Y. Effects of community size and contact rate in synchronous social q&a. Proc. of CHI, ACM Press (2011), 2837.  ",
      "doi": "10.1145/1978942.1979364"
    },
    {
      "text": "Yimam-Seid, D. and Kobsa, A. Expert-Finding Systems for Organizations: Problem and Domain Analysis and the DEMOIR Approach. Journal of Organizational Computing and Electronic Commerce 13, 1 (2003), 124.",
      "doi": ""
    }
  ]
}