{
  "doi": "10.1145/2207676.2207749",
  "title": "Empathy, participatory design and people with dementia",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "521-530",
  "year": 2012,
  "badges": [],
  "abstract": "We describe the development, application and evaluation of a design method tailored for working with people with mild to moderate dementia. Our experiences with the approach highlighted areas where designers and participants held radically different views. The tenet of our approach was that to overcome these differences we needed to create an empathic relationship between participants and designers. To achieve this we modified participatory design techniques to foster respectful engagement with participants in the development of a digital aid to facilitate \"safe walking\". The process begins with broad qualitative scoping and design work then moves to developing personally tailored, individual designs to further exploration of the experiential elements of the domain while reducing the need for the participants to engage in abstract thought. Reflection highlights a number of important areas that demand consideration when undertaking research in this area and, more generally, when performing design work with people with dementia.",
  "authors": [
    {
      "name": "Stephen Lindsay",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    },
    {
      "name": "Katie Brittain",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502648171",
      "orcid": "missing"
    },
    {
      "name": "Daniel Jackson",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421599462",
      "orcid": "missing"
    },
    {
      "name": "Cassim Ladha",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479664377",
      "orcid": "missing"
    },
    {
      "name": "Karim Ladha",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479663860",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Alzheimers Society. Policy position: Electronic tagging.",
      "doi": ""
    },
    {
      "text": "Barrett, J. and Kirk, S. Running focus groups with elderly and disabled elderly participants. Applied Ergonomics 31, 6 (2000), 621--629.",
      "doi": ""
    },
    {
      "text": "Boehner, K., Sengers, P., and Warner, S. Interfaces with the ineffable. ACM TOCHI 15, 3 (2008), 1--29.  ",
      "doi": "10.1145/1453152.1453155"
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Cohene, T. and Baecker, R. Designing interactive Life Story Multimedia for a family affected by Alzheimer's disease: A case study. In Proc. CHI 2005 EA, ACM Press (2005).  ",
      "doi": "10.1145/1056808.1056901"
    },
    {
      "text": "Dishman, E., Morris, M., and Lundell, J. Catalyzing social interaction with ubiquitous computing: a needs assessment of elders coping with cognitive decline. In Proc. CHI' 2004 EA, (2004).  ",
      "doi": "10.1145/985921.986011"
    },
    {
      "text": "Gibbs, A. Focus groups. Social Research Update 19, 8 (1997).",
      "doi": ""
    },
    {
      "text": "Hawkey, K., Inkpen, K.M., Rockwood, K., McAllister, M., and Slonim, J. Requirements gathering with Alzheimer's patients and caregivers. In Proc. ASSETS 2005, (2005), 142--149.  ",
      "doi": "10.1145/1090785.1090812"
    },
    {
      "text": "Hoey, J., Plotz, T., Jackson, D., Monk, A., Pham, C., and Olivier, P. Rapid Specification and Automated Generation of Prompting Systems to Assist People with Dementia. Pervasive and Mobile Computing 7, 3 (2010), 299--318.  ",
      "doi": "10.1016/j.pmcj.2010.11.007"
    },
    {
      "text": "Holmquist, L.E. User-Driven Innovation in the Future Applications Lab. CHI'2004, (2004), 1091--1092.  ",
      "doi": "10.1145/985921.985995"
    },
    {
      "text": "Keates, S. and Clarkson, P.J. Countering design exclusion: bridging the gap between usability and accessibility. Universal Access in the Information Society 2, 3 (2003), 215--225.",
      "doi": "10.1007/s10209-003-0059-5"
    },
    {
      "text": "Keith, S. and Whitney, G. Bridging the gap between young designers and older users in an inclusive society. In Proc. The good, the bad and the challenging: the user and the future of ICT, (1998).",
      "doi": ""
    },
    {
      "text": "Kitwood, T. Dementia Reconsidered. Open University Press, 1997.",
      "doi": ""
    },
    {
      "text": "Lai, K.Y. and Arthur, D.G. Wandering behaviour in people with dementia. Advanced Nursing 44, 2 (2003).",
      "doi": ""
    },
    {
      "text": "Massimi, M., Baecker, R.M., and Wu, M. Using participatory activities with seniors to critique, build, and evaluate mobile phones. In Proc. ASSETS 2007, (2007), 155--162.  ",
      "doi": "10.1145/1296843.1296871"
    },
    {
      "text": "Mattelmäki, T., C, H., and Helsinki, F.I.N. Empathy Probes. in Proc. PDC 2002, (2002).",
      "doi": ""
    },
    {
      "text": "McNaney, R., Lindsay, S., Ladha, K., Ladha, C., Schofield, G., Plötz, T., Hammerla, N., Jackson, D., Walker, R., Miller, N., et al. Cueing Swallowing in Parkinson's Disease. In Proc. CHI 2011, (2011), 619622.  ",
      "doi": "10.1145/1978942.1979030"
    },
    {
      "text": "Muller, M. PICTIVE: Democratizing the dynamics of the design session. Lawrence Erbaulm, 1993.",
      "doi": ""
    },
    {
      "text": "Olivier, P. and Wallace, J. Digital Technologies and the Emotional Family. IJHCS 67, 2 (2009).  ",
      "doi": "10.1016/j.ijhcs.2008.09.009"
    },
    {
      "text": "Orpwood, R., Chadd, J., Howcroft, D., Sixsmith, A., Torrington, J., Gibson, G., and Chalfont, G. User-led design of technology to improve quality of life for people with dementia. In P. Langdon, J. Clarkson and P. Robinson, eds., Designing Inclusive Futures. Cambridge, 2008, 185--195.",
      "doi": ""
    },
    {
      "text": "O'Shea, E. Costs and Consequences for the Carers of People with Dementia in Ireland. Dementia 2, (2003), 201--219.",
      "doi": ""
    },
    {
      "text": "Robinson, L., Brittain, K., Lindsay, S., Jackson, D., and Olivier, P. Keeping In Touch Everyday (KITE) project: developing assistive technologies with people with dementia and their carers to promote independence. 21, 03 (2009), 494--502.",
      "doi": ""
    },
    {
      "text": "Roulston, K. Reflective Interviewing: A Guide to Theory and Practice. SAGE Ltd, 2010.",
      "doi": ""
    },
    {
      "text": "Shinohara, K. and Wobbrock, J.O. In the Shadow of Misperception/: Assistive Technology Use and Social Interactions. CHI'11, (2011), 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Suri, J.F. The next 50 years: future challenges and opportunities for empathy in our science. Ergonomics 44, 14 (2001), 1278--1289.",
      "doi": ""
    },
    {
      "text": "United Nations. World Population Ageing: 1950--2050.",
      "doi": ""
    },
    {
      "text": "Wherton, J.P. and Monk, A.F. Technological opportunities for supporting people with dementia who are living at home. IJHCS 66, 8 (2008), 571--586.  ",
      "doi": "10.1016/j.ijhcs.2008.03.001"
    },
    {
      "text": "Wimo, A. and Prince, M. World Alzheimer's Report 2010.",
      "doi": ""
    },
    {
      "text": "Wright, P. and McCarthy, J. Empathy and experience in HCI. In Proc. CHI 2008, (2008), 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "Wright, P.C. and McCarthy, J. Technology as Experience. MIT Press, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Wu, M., Baecker, R., and Richards, B. Participatory design of an orientation aid for amnesics. In Proc. CHI 2005, (2005), 511--520.  ",
      "doi": "10.1145/1054972.1055043"
    }
  ]
}