{
  "doi": "10.1145/2207676.2208354",
  "title": "Reducing compensatory motions in video games for stroke rehabilitation",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2049-2058",
  "year": 2012,
  "badges": [],
  "abstract": "Stroke is the leading cause of long-term disability among adults in industrialized nations; approximately 80% of people who survive a stroke experience motor disabilities. Recovery requires hundreds of daily repetitions of therapeutic exercises, often without therapist supervision. When performing therapy alone, people with limited motion often compensate for the lack of motion in one joint by moving another one. This compensation can impede the recovery progress and create new health problems. In this work we contribute (1) a methodology to reliably sense compensatory torso motion in the context of shoulder exercises done by persons with stroke and (2) the design and experimental evaluation of operant-conditioning-based strategies for games that aim to reduce compensatory torso motion. Our results show that these strategies significantly reduce compensatory motions compared to alternatives.",
  "authors": [
    {
      "name": "Gazihan Alankus",
      "institution": "Washington University in St. Louis, St. Louis, Missouri, United States & Izmir University of Economics, Izmir, Turkey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100182954",
      "orcid": "missing"
    },
    {
      "name": "Caitlin Kelleher",
      "institution": "Washington University in St. Louis, St. Louis, Missouri, United States",
      "img": "/do/10.1145/contrib-81100607695/rel-imgonly/ckelleher.jpg",
      "acmid": "81100607695",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamovich, S. V., Merians, A. S., Boian, R., et al. A Virtual Reality-Based Exercise System for Hand Rehabilitation Post-Stroke. Presence: Teleoperators and Virtual Environments 14, 2 (2011), 161--174.  ",
      "doi": "10.1162/1054746053966996"
    },
    {
      "text": "Alankus, G., Lazar, A., May, M., and Kelleher, C. Towards customizable games for stroke rehabilitation. In Proc. of CHI 2010, ACM (2010), 2113--2122.  ",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "Alankus, G., Proffitt, R., Kelleher, C., and Engsberg, J. Stroke therapy through motion-based games: a case study. In Proc. ASSETS 2010, ACM (2010), 219--226.  ",
      "doi": "10.1145/1878803.1878842"
    },
    {
      "text": "Bach-y-Rita, P., Wood, S., Leder, R., et al. Computer-assisted motivating rehabilitation (CAMR) for institutional, home, and educational late stroke programs. Topics in Stroke Rehab. 8, 4 (2002), 1--10.",
      "doi": ""
    },
    {
      "text": "Broeren, J., Bjorkdahl, A., Claesson, L., et al. Virtual rehabilitation after stroke. Studies in Health Technology and Informatics 136, (2008), 77--82.",
      "doi": ""
    },
    {
      "text": "Burke, J., McNeill, M., Charles, D., Morrow, P., Crosbie, J., and McDonough, S. Optimising engagement for stroke rehabilitation using serious games. Vis Comp 25, 12 (2009), 1085--1099.  ",
      "doi": "10.1007/s00371-009-0387-4"
    },
    {
      "text": "Cirstea, M. C. and Levin, M. F. Compensatory strategies for reaching in stroke. Brain 123, 5 (2000), 940--953.",
      "doi": ""
    },
    {
      "text": "Conti, R. Time flies: investigating the connection between intrinsic motivation and the experience of time. Journal of Personality 69, 1 (2001), 1--26.",
      "doi": ""
    },
    {
      "text": "Deci, E. L., Eghrari, H., Patrick, B. C., and Leone, D. R. Facilitating Internalization: The Self-Determination Theory Perspective. Personality 62, 1 (1994), 119--142.",
      "doi": ""
    },
    {
      "text": "Deutsch, J. A., Lewis, J. A., Whitworth, E., Boian, R., Burdea, G., and Tremaine, M. Formative Evaluation and Preliminary Findings of a Virtual Reality Telerehabilitation System for the Lower Extremity. Presence: Teleop and Virt Env 14, 2 (2011), 198--213.  ",
      "doi": "10.1162/1054746053967030"
    },
    {
      "text": "Deutsch, J. E., Latonio, J., Burdea, G. C., and Boian, R. Post-stroke rehabilitation with the Rutgers Ankle System: a case study. Presence: Teleoperators and Virtual Environments 10, 4 (2001), 416--430.  ",
      "doi": "10.1162/1054746011470262"
    },
    {
      "text": "Egglestone, S. R., Axelrod, L., Nind, T., et al. A design framework for a home-based stroke rehabilitation system: Identifying the key components. In Proc. PervasiveHealth'09, IEEE (2009), 1--8.",
      "doi": ""
    },
    {
      "text": "Fogg, B., Cuellar, G., and Danielson, D. R. Motivating, influencing, and persuading users. In The human-computer interaction handbook. Routledge, 2003, 358--370. ",
      "doi": "10.5555/772072.772096"
    },
    {
      "text": "Goude, D., Björk, S., and Rydmark, M. Game design in virtual reality systems for stroke rehabilitation. Studies in Health Tech and Info 125, (2007), 146--148.",
      "doi": ""
    },
    {
      "text": "Holden, M. K., Dyar, T. A., Schwamm, L., and Bizzi, E. Virtual-Environment-Based Telerehabilitation in Patients with Stroke. Presence: Teleoperators & Virtual Environments 14, 2 (2005), 214--233.  ",
      "doi": "10.1162/1054746053967058"
    },
    {
      "text": "Lai, S.-M., Studenski, S., Duncan, P. W., and Perera, S. Persisting Consequences of Stroke Measured by the Stroke Impact Scale. Stroke 33, 7 (2002), 1840--1844.",
      "doi": ""
    },
    {
      "text": "Lang, C. E., MacDonald, J. R., and Gnip, C. Counting repetitions: an observational study of outpatient therapy for people with hemiparesis post-stroke. Neur Phys Ther: JNPT 31, 1 (2007), 3--10.",
      "doi": ""
    },
    {
      "text": "Langhorne, P., Coupar, F., and Pollock, A. Motor recovery after stroke: a systematic review. The Lancet Neurology 8, 8 (2009), 741--754.",
      "doi": ""
    },
    {
      "text": "Levin, M. F., Kleim, J. A., and Wolf, S. L. What do motor \"recovery\" and \"compensation\" mean in patients following stroke? Neurorehabilitation and Neural Repair 23, 4 (2009), 313--319.",
      "doi": ""
    },
    {
      "text": "Lum, P. S., Uswatte, G., Taub, E., Hardin, P., and Mark, V. W. A telerehabilitation approach to delivery of constraint-induced movement therapy. Rehab Res and Dev 43, 3 (2006), 391--400.",
      "doi": ""
    },
    {
      "text": "Thielman, G. Rehabilitation of reaching poststroke: a randomized pilot investigation of tactile versus auditory feedback for trunk control. J Neuro Phys Ther: JNPT 34, 3 (2010), 138--144.",
      "doi": ""
    },
    {
      "text": "Verplanck, W. S. The operant conditioning of human motor behavior. Psych Bulletin 53, 1 (1956), 70--83.",
      "doi": ""
    },
    {
      "text": "Warlow, C. P., Gijn, J. van, Dennis, M. S., et al. Stroke: Practical Management. Wiley-Blackwell, 2008.",
      "doi": ""
    },
    {
      "text": "Woodbury, M. L., Howland, D. R., McGuirk, T. E., et al. Effects of Trunk Restraint Combined With Intensive Task Practice on Poststroke Upper Extremity Reach and Function: A Pilot Study. Neurorehabilitation and Neural Repair 23, 1 (2009), 78--91.",
      "doi": ""
    },
    {
      "text": "Yee, N. The Psychology of Massively Multi-User Online Role-Playing Games: Motivations, Emotional Investment, Relationships and Problematic Usage, Avatars at Work and Play. Springer-Verlag, Berlin/Heidelberg, 187--207.",
      "doi": ""
    }
  ]
}