{
  "doi": "10.1145/2207676.2207710",
  "title": "Direct answers for search queries in the long tail",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "237-246",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Web search engines now offer more than ranked results. Queries on topics like weather, definitions, and movies may return inline results called answers that can resolve a searcher's information need without any additional interaction. Despite the usefulness of answers, they are limited to popular needs because each answer type is manually authored. To extend the reach of answers to thousands of new information needs, we introduce Tail Answers: a large collection of direct answers that are unpopular individually, but together address a large proportion of search traffic. These answers cover long-tail needs such as the average body temperature for a dog, substitutes for molasses, and the keyboard shortcut for a right-click. We introduce a combination of search log mining and paid crowdsourcing techniques to create Tail Answers. A user study with 361 participants suggests that Tail Answers significantly improved users' subjective ratings of search quality and their ability to solve needs without clicking through to a result. Our findings suggest that search engines can be extended to directly respond to a large new class of queries.",
  "authors": [
    {
      "name": "Michael S. Bernstein",
      "institution": "MIT CSAIL, Cambridge, Massachusetts, United States",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Susan Dumais",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100134501/rel-imgonly/sdumais02.jpg",
      "acmid": "81100134501",
      "orcid": "missing"
    },
    {
      "name": "Daniel Liebling",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363605125",
      "orcid": "missing"
    },
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adar, E., Teevan, J., Dumais, S.T., and Elsas, J.L. The web changes everything. Proc. WSDM '09, (2009).",
      "doi": "10.1145/1498759.1498837"
    },
    {
      "text": "Agichtein, E., Lawrence, S., and Gravano, L. Learning to find answers to questions on the Web. ACM TOIS 4, 2 (2004), 129--162.  ",
      "doi": "10.1145/990301.990303"
    },
    {
      "text": "Banko, M., Cafarella, M.J., Soderland, S., Broadhead, M., and Etzioni, O. Open information extraction for the web. IJCAI '072, University of Washington (2007). ",
      "doi": "10.5555/1625275.1625705"
    },
    {
      "text": "Bernstein, M.S., Little, G., Miller, R.C., et al. Soylent: A Word Processor with a Crowd Inside. Proc. UIST '10, (2010).  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Brill, E., Dumais, S., and Banko, M. An analysis of the AskMSR question-answering system. Proc. EMNLP '02, (2002).  ",
      "doi": "10.3115/1118693.1118726"
    },
    {
      "text": "Broder, A. A taxonomy of web search. ACM SIGIR Forum 36, 2 (2002), 3.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Chilton, L.B. and Teevan, J. Addressing people's information needs directly in a web search result page. Proc. WWW '11, (2011).  ",
      "doi": "10.1145/1963405.1963413"
    },
    {
      "text": "Cutrell, E. and Guan, Z. What are you looking for?: an eye-tracking study of information usage in web search. Proc. CHI '07, (2007).  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Horowitz, D. and Kamvar, S.D. The anatomy of a largescale social search engine. Proc. WWW '10, (2010).  ",
      "doi": "10.1145/1772690.1772735"
    },
    {
      "text": "Kellar, M., Watters, C., and Shepherd, M. A field study characterizing Web-based information-seeking tasks. JASIST 58, 7 (2007), 999--1018.  ",
      "doi": "10.5555/1241540.1241550"
    },
    {
      "text": "Law, E. and Zhang, H. Towards Large-Scale Collaborative Planning: Answering High-Level Search Queries Using Human Computation. Proc. AAAI '11, (2011).",
      "doi": ""
    },
    {
      "text": "Le, J., Edmonds, A., Hester, V., and Biewald, L. Ensuring quality in crowdsourced search relevance evaluation. Proc. SIGIR '10 Workshop on Crowdsourcing for Search Evaluation, (2010).",
      "doi": ""
    },
    {
      "text": "Li, J., Huffman, S., and Tokuda, A. Good abandonment in mobile and PC internet search. Proc. SIGIR '09, (2009).  ",
      "doi": "10.1145/1571941.1571951"
    },
    {
      "text": "Lin, J. An exploration of the principles underlying redundancy-based factoid question answering. ACM TOIS 25, 2 (2007).  ",
      "doi": "10.1145/1229179.1229180"
    },
    {
      "text": "Little, G., Chilton, L., Goldman, M., and Miller, R.C. Exploring iterative and parallel human computation processes. Proc. HCOMP '10, (2010).  ",
      "doi": "10.1145/1837885.1837907"
    },
    {
      "text": "Pirolli, P. Information foraging theory: adaptive interaction with information. Oxford Press, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Stamou, S. and Efthimiadis, E.N. Queries without clicks: Successful or failed searches. Proc. SIGIR '09 Wkshp on the Future of IR Evaluation, (2009).",
      "doi": ""
    },
    {
      "text": "Suchanek, F.M., Kasneci, G., and Weikum, G. YAGO : A Core of Semantic Knowledge Unifying Wikipedia and WordNet. WWW '07, (2007).  ",
      "doi": "10.1145/1242572.1242667"
    },
    {
      "text": "Teevan, J., Liebling, D.J., and Ravichandran Geetha, G. Understanding and predicting personal navigation. Proc. WSDM '11, (2011).  ",
      "doi": "10.1145/1935826.1935848"
    },
    {
      "text": "White, R.W., Bilenko, M., and Cucerzan, S. Studying the use of popular destinations to enhance web search interaction. Proc. SIGIR '07, (2007).  ",
      "doi": "10.1145/1277741.1277771"
    }
  ]
}