{
  "doi": "10.1145/2207676.2208357",
  "title": "Game design for promoting counterfactual thinking",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2079-2082",
  "year": 2012,
  "badges": [],
  "abstract": "We describe the first iteration of an Alternate Reality Game (ARG) designed to lead players into a newly enfranchised relationship with history and engage them in scientific thinking and information literacy practices. We found that the points at which the game's mythology blurred the lines between fact and fiction prompted middle school students to move beyond rote memorization of content. Instead, they began to question, analyze, and make hypotheses about the data presented. However, striking a meaningful balance between \"true\" history and imagined events poses new design challenges. We present a formative typology of counterfactual design patterns that can help designers, educators, and players locate interesting fault lines in reality that facilitate the expansion of ARG mythologies.",
  "tags": [
    "children",
    "counterfactual thinking",
    "alternate reality games"
  ],
  "authors": [
    {
      "name": "Elizabeth Bonsignore",
      "institution": "University of Maryland, College Park, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641019",
      "orcid": "missing"
    },
    {
      "name": "Kari Kraus",
      "institution": "University of Maryland, College Park, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502766929",
      "orcid": "missing"
    },
    {
      "name": "Amanda Visconti",
      "institution": "University of Maryland, College Park, MD, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502733564",
      "orcid": "missing"
    },
    {
      "name": "Derek Hansen",
      "institution": "Brigham Young University, Provo, Utah, Unite States",
      "img": "/do/10.1145/contrib-81311486004/rel-imgonly/derekhansen.png",
      "acmid": "81311486004",
      "orcid": "missing"
    },
    {
      "name": "Ann Fraistat",
      "institution": "University of Maryland, College Park, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502796311",
      "orcid": "missing"
    },
    {
      "name": "Allison Druin",
      "institution": "University of Maryland, College Park, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Byrne, R. The Rational Imagination: How People Create Alternatives to Reality. Cambridge, MA: MIT Press (2007).",
      "doi": ""
    },
    {
      "text": "Gaglio, C. M. The Role of Mental Simulations and Counterfactual Thinking in the Opportunity Identification Process. Entrepreneurship Theory and Practice, 28, 6 (2004), 533--552.",
      "doi": ""
    },
    {
      "text": "Hawkins, J., & Pea, R. D. Tools for bridging the cultures of everyday and scientific thinking. Journal of Research in Science Teaching, 24, 4 (1987), 291--307.",
      "doi": ""
    },
    {
      "text": "Isbister, K., Flanagan, M., & Hash, C. Designing games for learning: insights from conversations with designers. In Proc. CHI 2010, ACM Press (2010), 2041--2044.  ",
      "doi": "10.1145/1753326.1753637"
    },
    {
      "text": "Jenkins, H. Convergence culture: where old and new media collide. NY: New York Univ. Press, 2006.",
      "doi": ""
    },
    {
      "text": "Jenkins, H., Clinton, K., Purushotma, R., Robinson, A. J., & Weigel, M. (2006). Confronting the Challenges of Participatory Culture. MacArthur Foundation.",
      "doi": ""
    },
    {
      "text": "Johnson, M., Buhler, A. G., & Hillman, C. The Library is Undead: Information Seeking During the Zombie Apocalypse. Journal of Library Innovation, 1, 2 (2010), 29--43.",
      "doi": ""
    },
    {
      "text": "Bonsignore, E., Hansen, D., Kraus, K., & Ruppel, M. Alternate Reality Games as Platforms for Practicing 21st Century Literacies. IJLM. (Forthcoming.)",
      "doi": ""
    },
    {
      "text": "Lesh, B. \"Why won't you just tell us the answer?\": teaching historical thinking in grades 7--12. Portland, ME: Stenhouse Publishers, 2011.",
      "doi": ""
    },
    {
      "text": "McGonigal, J. Why I Love Bees: A Case Study in Collective Intelligence Gaming. In K. Salen (Ed.), The Ecology of Games, 199--2 Cambridge, MA: MIT Press, 2008.",
      "doi": ""
    },
    {
      "text": "McGonigal, J. (2011). Reality is broken. New York: Penguin Press.",
      "doi": ""
    },
    {
      "text": "Owens, T. Modding the History of Science: Values at Play in Modder Discussions of Sid Meier's Civilization. Simulation & Gaming, 42 (2010), 481--495.  ",
      "doi": "10.1177/1046878110366277"
    },
    {
      "text": "Squire, K. From Content to Context: Videogames as Designed Experience. Educational Researcher, 35, 8 (2006), 19--29.",
      "doi": ""
    },
    {
      "text": "Szulborski, D. This is not a game: a guide to alternate reality gaming. Macungie, PA: New-Fiction Pub.",
      "doi": ""
    },
    {
      "text": "Visconti, A. (Oct 4, 2011). This is Not a Game (But Play Nice!) The Ethics of Counterfactual ARGs in the History Classroom. Play The Past. Available at: http://www.playthepast.org/?p=1916.",
      "doi": ""
    }
  ]
}