{
  "doi": "10.1145/2207676.2208597",
  "title": "Collaboration in cognitive tutor use in latin America: field study and design recommendations",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1381-1390",
  "year": 2012,
  "badges": [],
  "abstract": "Technology has the promise to transform educational prac-tices worldwide. In particular, cognitive tutoring systems are an example of educational technology that has been ex-tremely effective at improving mathematics learning over traditional classroom instruction. However, studies on the effectiveness of tutor software have been conducted mainly in the United States, Canada, and Western Europe, and little is known about how these systems might be used in other contexts with differing classroom practices and values. To understand this question, we studied the usage of mathematics tutoring software for middle school at sites in three Latin American countries: Brazil, Mexico, and Costa Rica. While cognitive tutors were designed for individual use, we found that students in these classrooms worked collaboratively, engaging in interdependently paced work and conducting work away from their own computer. In this paper we present design recommendations for how cognitive tutors might be incorporated into different classroom practices, and better adapted for student needs in these environments.",
  "tags": [
    "cognitive tutors",
    "cultural adaptation",
    "collaborative learning"
  ],
  "authors": [
    {
      "name": "Amy Ogan",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583567",
      "orcid": "0000-0003-2671-6149"
    },
    {
      "name": "Erin Walker",
      "institution": "Arizona State University, Phoenix, Arizona, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491129",
      "orcid": "0000-0002-0976-9065"
    },
    {
      "name": "Ryan S.J.D. Baker",
      "institution": "Worcester Polytechnic Institute, Worchester, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436593472",
      "orcid": "missing"
    },
    {
      "name": "Genaro Rebolledo Mendez",
      "institution": "Universidad Veracruzana, Jalapa, Veracruz, Mexico",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384593021",
      "orcid": "missing"
    },
    {
      "name": "Maynor Jimenez Castro",
      "institution": "Universidad de Costa Rica, Guapiles, Costa Rica",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502804940",
      "orcid": "missing"
    },
    {
      "name": "Tania Laurentino",
      "institution": "SENAI Institute, Maceió, Alagoas, Brazil, ,",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488672251",
      "orcid": "missing"
    },
    {
      "name": "Adriana de Carvalho",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448597624",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aleven, V., McLaren, B., Roll, I., & Koedinger, K.: Toward tutoring help seeking: Applying cognitive modeling to metacognitive skills. In J. C. Lester, R. M. Vicario, & F. Paraguau (Eds.), Proc. ITS 04, 227--239.",
      "doi": ""
    },
    {
      "text": "Atkinson, R. K., Renkl, A., & Merrill, M. M. Transitioning from studying examples to solving problems: Effects of selfexplanation prompts and fading worked-out steps. J. Ed. Psych, 95 4 (2003), 774--783.",
      "doi": ""
    },
    {
      "text": "Baker, R.S.J.d., Corbett, A.T., Aleven, V. More Accurate Student Modeling Through Contextual Estimation of Slip and Guess Probabilities in Bayesian Knowledge Tracing. In Proc. ITS '08, 406--415.  ",
      "doi": "10.1007/978-3-540-69132-7_44"
    },
    {
      "text": "Baker, R. S., Corbett, A. T., Koedinger, K. R., & Wagner, A. Z. Off-task behavior in the Cognitive Tutor classroom: When students \"game the system.\" In Proc. CHI 2004, ACM Press (2004). 383--390.  ",
      "doi": "10.1145/985692.985741"
    },
    {
      "text": "Beck, J. E., & Sison, J.: Using knowledge tracing in a noisy environment to measure student reading proficiencies. IJAIED, 16 (2006). 129--143. ",
      "doi": "10.5555/1435344.1435347"
    },
    {
      "text": "Blanchard, E. G., Ogan, A. Infusing Cultural Awareness in Intelligent Tutoring Systems for a Globalized World. Advances in Intelligent Tutoring Systems. Springer (2010).",
      "doi": ""
    },
    {
      "text": "Corbett, A.T. and Anderson, J. R.: Knowledge Tracing: Modeling the Acquisition of Procedural Knowledge. UMUAI, 4 (4), 253--278 (1993).",
      "doi": ""
    },
    {
      "text": "Corbett, A.T. and Anderson, J.R. Locus of feedback control in computer-based tutoring: Impact on learning rate, achievement and attitudes. In Proc. Chi'2001, ACM Press (2001). 245--252.  ",
      "doi": "10.1145/365024.365111"
    },
    {
      "text": "Hoadley, C. Honwad, S., and Tamminga, K. Technologysupported cross cultural collaborative learning in the developing world. In Proc. ICIC '10, ACM Press, NY, USA (2010). 131--140.  ",
      "doi": "10.1145/1841853.1841873"
    },
    {
      "text": "Hofstede G. Culture's consequences: Comparing values, behaviors, institutions, and organizations across nations. Sage Publications Ltd. (2001).",
      "doi": ""
    },
    {
      "text": "Jain, M., Birnholtz, J., Cutrell, E. & Balakrishnan, R. Exploring display techniques for mobile collaborative learning in developing regions. In MobileHCI 2011. ACM Press.  ",
      "doi": "10.1145/2037373.2037388"
    },
    {
      "text": "Johnson, D. W. & Johnson, R. T. 1990. Cooperative learning and achievement. In S. Sharan (Ed.), Cooperative learning: Theory and research (pp. 23--37). NY: Praeger.",
      "doi": ""
    },
    {
      "text": "Koedinger, K. R. & Corbett, A. T. Cognitive tutors: Technology bringing learning science to the classroom. The Cambridge Handbook of the Learning Sciences. Cambridge University Press (2006). 61--78.",
      "doi": ""
    },
    {
      "text": "Kumar, A., Tewari, A., Shroff, G., Chittamuru, D., Kam, M., and Canny, J. An Exploratory Study of Unsupervised Mobile Learning in Rural India. In Proc. CHI'10, ACM Press.  ",
      "doi": "10.1145/1753326.1753435"
    },
    {
      "text": "Lomas, D., Ching, D., Hoadley, C., Patel, K., and Kam, M. When a Console Game Becomes CSCL: Play, Participatory Learning and 8-Bit Home Computing in India. In Proc. ICLS'11.",
      "doi": ""
    },
    {
      "text": "Moraveji, N., Kim, T., Ge, J., Pawar, U. S., Mulcahy, K., and Inkpen, K. 2008. Mischief: supporting remote teaching in developing regions. In Proc. CHI'08. ACM Press, 353--362.  ",
      "doi": "10.1145/1357054.1357114"
    },
    {
      "text": "Nicaud J.F., Bittar M., Chaachoua H., Inamdar P., Maffei L.: Experiments With Aplusix In Four Countries. I. J. Tech. in Math Ed., 13, 1 (2006).",
      "doi": ""
    },
    {
      "text": "Ogan, A., Aleven, V., Jones, C. Advancing development of intercultural competence through supporting predictions in narrative video. IJAIED, 19(3), 67--288 (2010). ",
      "doi": "10.5555/1891970.1891972"
    },
    {
      "text": "Pal, J., Pawar U., Brewer, E. and Toyama,K. The case for multi-user design for computer aided learning in developing regions. WWW2006, Edinburgh Scotland, May 2006.  ",
      "doi": "10.1145/1135777.1135896"
    },
    {
      "text": "Patton, M.Q. Qualitative Research and Evaluation, 3rd ed., Sage, Thousand Oaks, CA (2002).",
      "doi": ""
    },
    {
      "text": "Schofield, J. W. Computers and classroom culture. New York: Cambridge University Press (1995). ",
      "doi": "10.5555/526373"
    },
    {
      "text": "Sipitakiat, A., Blikstein, P. & Cavallo, D. GoGo Board: Augmenting Programmable Bricks for Economically Challenged Audiences, In Proc. ICLS'04. ",
      "doi": "10.5555/1149126.1149185"
    },
    {
      "text": "VanLehn, K. The behavior of tutoring systems. IJAIED, 16, 3 (2006), 227--265. ",
      "doi": "10.5555/1435351.1435353"
    },
    {
      "text": "Vassileva, J., McCalla, G., and Greer, J. Multi-Agent MultiUser Modeling in I-Help. UMUAI, 13, 179--210, (2003).  ",
      "doi": "10.1023/A%3A1024072706526"
    },
    {
      "text": "Warschauer, M. Technology and social inclusion: Rethinking the digital divide. Cambridge, MA: MIT Press (2003). ",
      "doi": "10.5555/640680"
    }
  ]
}