{
  "doi": "10.1145/2207676.2208584",
  "title": "A comparative evaluation of finger and pen stroke gestures",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1287-1296",
  "year": 2012,
  "badges": [],
  "abstract": "This paper reports an empirical investigation in which participants produced a set of stroke gestures with varying degrees of complexity and in different target sizes using both the finger and the pen. The recorded gestures were then analyzed according to multiple measures characterizing many aspects of stroke gestures. Our findings were as follows: (1) Finger drawn gestures were quite different to pen drawn gestures in basic measures including size ratio and average speed. Finger drawn gestures tended to be larger and faster than pen drawn gestures. They also differed in shape geometry as measured by, for example, aperture of closed gestures, corner shape distance and intersecting points deviation; (2) Pen drawn gestures and finger drawn gestures were similar in several measures including articulation time, indicative angle difference, axial symmetry and proportional shape distance; (3) There were interaction effects between gesture implement (finger vs. pen) and target gesture size and gesture complexity. Our findings show that half of the features we tested were performed well enough by the finger. This finding suggests that \"finger friendly\" systems should exploit these features when designing finger interfaces and avoid using the other features in which the finger does not perform as well as the pen.",
  "authors": [
    {
      "name": "Huawei Tu",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502783830",
      "orcid": "0000-0001-9689-9767"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    },
    {
      "name": "Shumin Zhai",
      "institution": "Google Research, Mountain View, California, United States",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    }
  ],
  "references": [
    {
      "text": "Andersen, T.H. and Zhai, S. \"Writing with music\": exploring the use of auditory feedback in gesture interfaces. ACM TAP 7, 3(2010), 1--24.  ",
      "doi": "10.1145/1773965.1773968"
    },
    {
      "text": "Appert, C. and Zhai, S. Using strokes as command shortcuts: cognitive benefits and toolkit support. In Proc. CHI 2009, ACM Press (2009), 2289--2298.  ",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Bau, O. and Mackay, W. E. OctoPocus: a dynamic guide for learning gesture-based command sets. In Proc. UIST 2008, ACM Press (2008), 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Blagojevic, R., Chang, S.H. and Plimmer, B. The power of automatic feature selection: Rubine on steroids. In Proc. SBIM 2010, Eurogaphics Association (2010), 79--86. ",
      "doi": "10.5555/1923363.1923377"
    },
    {
      "text": "Bragdon, A., Nelson, E., Li, Y. and Hinckley, K. Experimental analysis of touch-screen gesture designs in mobile environments . In Proc. CHI 2011, ACM Press (2011), 403--412.  ",
      "doi": "10.1145/1978942.1979000"
    },
    {
      "text": "Cao, X. and Zhai, S. Modeling human performance of pen stroke gestures. In Proc. CHI 2007, ACM Press (2007), 1495--1504.  ",
      "doi": "10.1145/1240624.1240850"
    },
    {
      "text": "DuoSense Digitizer Product Brief. http://www.n-trig.com.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Yatani, K., Pahud, M., Coddington, N., Rodenhouse, J., Wilson, A., Benko, H. and Buxton, B. Pen + Touch = New Tools. In Proc. UIST2010, ACM Press (2010), 27--36.  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "HP TouchSmart tx2 Notebook PC Maintenance and Service Guide. http://www.hp.com.",
      "doi": ""
    },
    {
      "text": "Isokoski, P. Model for unistroke writing time. In Proc. CHI 2001, ACM Press (2001), 357--364.  ",
      "doi": "10.1145/365024.365299"
    },
    {
      "text": "Kristensson, P.O. and Zhai, S. SHARK2 : a large vocabulary shorthand writing system for pen-based computers. In Proc. UIST 2004, ACM Press (2004), 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. Issues in combining marking and direct manipulation techniques. In Proc. UIST 1991, ACM Press (1991), 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Kurtenbach, G., Sellen, A. and Buxton, W. An empirical evaluation of some articulatory and cognitive aspects of \"marking menus\". Human Computer Interaction, 8, 1 (1993), 1--23.  ",
      "doi": "10.1207/s15327051hci0801_1"
    },
    {
      "text": "Lacuaniti, F., Terzuolo, C. and Viviani, P. The law relating the kinematic and figural aspects of drawing movements. Acta Psychologica, 54 (1983), 115--558.",
      "doi": ""
    },
    {
      "text": "Long, A.C., Landay, J.A., Rowe, L.A. and Michiels, J. Visual similarity of pen gestures. In Proc. CHI 2000, ACM Press (2000), 360--367.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Morris, M.R., Huang, A., Paepcke, A. and Winoqrad, T. Cooperative gestures: multi-user gestural interactions for co-located groupware. In Proc. CHI 2006, ACM Press (2006), 1201--1210.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Ren, X. and Zhou, X. The optimal size of handwriting character input boxes on PDAs, Int. J. Human-Computer Interaction, 25, 8 (2009), 762--784.",
      "doi": ""
    },
    {
      "text": "Rubine, D. Specifying gestures by example. In Proc. SIGGRAPH 1991, ACM Press (1991), 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Schmidt, R. A. Motor control and learning: a behavioral emphasis. 2nd ed. Champaign, IL: Human Kinetics (1988).",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R. and Wilson, A. D. User-defined gestures for surface computing . In Proc. CHI 2009, ACM Press (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wobbrock, J. O., Wilson, A. D. and Li, Y. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. In Proc. UIST 2007, ACM Press (2007), 59--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Wright, C. E. Generalized motor programs: reexamining claims of effector independence in writing. In Attention and Performance XIII, Erlbaum, Hillsdale, NJ (1990), 294--320.",
      "doi": ""
    },
    {
      "text": "Zhai, S. and Kristensson, P.O. Shorthand writing on stylus keyboard. In Proc. CHI 2003, ACM Press (2003), 97--104.  ",
      "doi": "10.1145/642611.642630"
    },
    {
      "text": "Zhai, S., Kristensson, P.O, Gong, P., Greiner, M., Peng, S.A., Liu, L.M. and Dunnigan, A. Shapewriter on the iphone: from the laboratory to the real world. Ext. abstracts. CHI 2009, ACM Press (2009), 2667--2670.  ",
      "doi": "10.1145/1520340.1520380"
    }
  ]
}