{
  "doi": "10.1145/2207676.2208395",
  "title": "Using mobile phones to support sustainability: a field study of residential electricity consumption",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2347-2356",
  "year": 2012,
  "badges": [],
  "abstract": "Recent focus on sustainability has made consumers more aware of our joint responsibility for conserving energy resources such as electricity. However, reducing electricity use can be difficult with only a meter and a monthly or annual electricity bill. With the emergence of new power meters units, information on electricity consumption is now available digitally and wirelessly. This enables the design and deployment of a new class of persuasive systems giving consumers insight into their use of energy resources and means for reducing it. In this paper, we explore the design and use of one such system, Power Advisor, promoting electricity conservation through tailored information on a mobile phone or tablet. The use of the system in 10 households was studied over 7 weeks. Findings provide insight into peoples awareness of electricity consumption in their home and how this may be influenced through design.",
  "authors": [
    {
      "name": "Jesper Kjeldskov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020677",
      "orcid": "0000-0001-7990-4229"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Jeni Paay",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423598",
      "orcid": "missing"
    },
    {
      "name": "Rahuvaran Pathmanathan",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490696238",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brandon, G. and Lewis, A. (1999) Reducing Household Energy Consumption: A Qualitative and Quantitative Field Study. Journal of Environment Psychology, Vol. 19, pp. 75--85.",
      "doi": ""
    },
    {
      "text": "Darby, S. (2006) The effectiveness of feedback on energy consumption. University of Oxford, UK.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdöttir (2010) Mapping the Landscape of Sustainable HCI. In Proceedings of Human Factors in Computing Systems (CHI'10), ACM Press, pp. 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Fischer, C. (2008) Feedback on household electricity consumption: A tool for saving energy? Energy Efficiency, Vol 1, No. 1, pp. 79--104.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. (2003) Persuasive Technology, Morgan Kaufmann, San Francisco, USA.",
      "doi": ""
    },
    {
      "text": "Foth, M., Paulos, E., Satchell, C., and Dourish, P. (2009) Pervasive Computing and Environmental Sustainability: Two Conference Workshops. IEEE Pervasive Computing, Vol. 8(1), pp. 78--81.  ",
      "doi": "10.1109/MPRV.2009.13"
    },
    {
      "text": "Froehlich, J., Findlater, L., and Landay, J. (2010) The design of eco-feedback technology. In Proceedings of Human Factors in Computing Systems (CHI'10), ACM Press pp. 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Froehlich, J. (2009) Promoting energy efficient behaviours in the home through feedback: The role of human-computer interaction. In Proceedings of HCIC 2009 Winter Workshop, p. 10.",
      "doi": ""
    },
    {
      "text": "Haakana, M., Sillanpaa, L., and Talsi, M. (1997) The effect of feedback and focused advice on household energy consumption. Proc. ECEEE'97.",
      "doi": ""
    },
    {
      "text": "Helen, H. A., Greenberg, S. and Huang, E. M. (2010) One size does not fit all: Applying the Transtheoretical Model to Energy Feedback Technology Design. In Proceedings of Human Factors in Computing Systems (CHI'10), pp. 927--936.  ",
      "doi": "10.1145/1753326.1753464"
    },
    {
      "text": "Kirman, B., Linehan, C., Lawson, S., Foster, D., and Doughty, M. (2010) There's a monster in my kitchen: using aversive feedback to motivate behaviour change. In Proceedings of Human Factors in Computing Systems (CHI'10), ACM Press, pp. 2685--2694.  ",
      "doi": "10.1145/1753846.1753852"
    },
    {
      "text": "Modstrøm A/S, (2011) http://www.modstroem.dk/",
      "doi": ""
    },
    {
      "text": "Petersen, J. E., Shunturov, V., Janda, K., Platt, G., and Weinberger, K. (2007) Dormitory residents reduce electricity consumption when exposed to real-time visual feedback and incentives. International Journal of Sustainability in Higher Education. Vol. 8(1), pp. 16--33.",
      "doi": ""
    },
    {
      "text": "Petersen, D., Steele, J. and Wilkerson, J. (2009) WattBot: a residential electricity monitoring and feedback system. In Proceedings of extended abstracts in Human Factors in Computing Systems (CHI'09), pp. 2847--2852.  ",
      "doi": "10.1145/1520340.1520413"
    },
    {
      "text": "Pierce, J., Schiano, D. J., and Paulos, E. (2010) Home, Habits, and Energy: Examining Domestic Interactions and Energy Consumption. In Proceedings of Human Factors in Computing Systems (CHI'10), ACM Press pp. 1985--1994.  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Power Advisor Prototype (2011) http://www.s.inwire.dk",
      "doi": ""
    },
    {
      "text": "Prochaska, J. O. and Velicer, W. F. (1997) The Transtheoretical Model of Health Behavior Change. American Journal of Health Promotion. Vol. 12, pp. 38--48.",
      "doi": "10.4278/0890-1171-12.1.38"
    },
    {
      "text": "Schultz P. W., Nolan, J. M., Cialdini, R. B., Goldstein N. J., Griskevicius, V. (2007) The constructive, destructive, and reconstructive power of social norms. Psychological Science, Vol. 18(5), pp. 429--434.",
      "doi": ""
    },
    {
      "text": "Shiraishi, M., Washio, Y., Takayama, C., Lehdonvirta, V., Kimura, H., and Nakajima, T. (2009) Tracking behaviour in persuasive apps: Is sensor-based detection always better than user self-reporting. In Proceedings of extended abstracts in Human Factors in Computing Systems (CHI'09), pp. 4045--4050.  ",
      "doi": "10.1145/1520340.1520615"
    },
    {
      "text": "Strauss, A. and Corbin, J. M. (1990) Basics of Qualitative Research, SAGE.",
      "doi": ""
    },
    {
      "text": "The Danish Energy Saving Trust (2011) http://www.goenergi.dk",
      "doi": ""
    },
    {
      "text": "Weiss, M., Graml, T., Staake, T., Mattern, F., Fleisch, E. (2009) Handy feedback: Connecting smart meters with mobile phones. Proceedings of MUM 2009, Cambridge, UK, ACM, pp. 1--4.  ",
      "doi": "10.1145/1658550.1658565"
    },
    {
      "text": "Winett, R. A., Neale, M. S., and Grier, H. C. (1979) Effects of self monitoring and feedback on residential electricity consumption. Applied Behavior Analysis, Vol. 12(2), pp.173--184.",
      "doi": ""
    },
    {
      "text": "Yann, R., Dodge, J., and Metoyer, R. A. (2010) Studying always-on electricity feedback in the home. In Proceedings of Human Factors in Computing Systems (CHI'10), ACM Press, pp. 1995--1998.  ",
      "doi": "10.1145/1753326.1753628"
    }
  ]
}