{
  "doi": "10.1145/2207676.2208291",
  "title": "Analysis within and between graphs: observed user strategies in immunobiology visualization",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1655-1658",
  "year": 2012,
  "badges": [],
  "abstract": "We present an analysis of two user strategies in interactive data analysis, based on an observational study of four researchers in the immunology domain. Screen captures, video records, interviews, and verbal protocols are used to analyze common procedures in this type of visual data analysis, as well as how these procedures differ among these users. Our findings present a case where skilled users can approach a similar problem with diverging analysis strategies. In the group we observed, strategies fell within two broad categories: within-graph analysis, in which a user generates a few graph layouts and interacts heavily within them, and between-graph analysis, in which a user generates a series of graphs and switches between them in sequence. Differences in strategies lead to distinct interaction patterns, and are likely to be best supported by different interface designs. We characterize these observed strategies and discuss their implications for scientific visualization design and evaluation.",
  "authors": [
    {
      "name": "Caroline Ziemkiewicz",
      "institution": "Brown University, Providence, Rhode Island, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502692336",
      "orcid": "missing"
    },
    {
      "name": "Steven Gomez",
      "institution": "Brown University, Providence, Rhode Island, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340489328",
      "orcid": "missing"
    },
    {
      "name": "David Laidlaw",
      "institution": "Brown University, Providence, Rhode Island, United States",
      "img": "/do/10.1145/contrib-81100589961/rel-imgonly/statement_dec2015copy2.jpg",
      "acmid": "81100589961",
      "orcid": "0000-0002-3411-7376"
    }
  ],
  "references": [
    {
      "text": "Tibco Spotfire S+. Accessed 9/21/2011.",
      "doi": ""
    },
    {
      "text": "Amar, R., Eagan, J., and Stasko, J. Low-level components of analytic activity in information visualization. In Proceedings of IEEE InfoVis (2005), 15--23.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Pirolli, P., and Card, S. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of International Conference on Intelligence Analysis (2005).",
      "doi": ""
    },
    {
      "text": "Plaisant, C. The challenge of information visualization evaluation. In Proceedings of AVI (2004), 109--116.  ",
      "doi": "10.1145/989863.989880"
    },
    {
      "text": "Reich, M., Liefeld, T., Gould, J., Lerner, J., Tamayo, P., and Mesirov, J. P. GenePattern 2.0. Nature Genetics 38, 5 (2006), 500--501.",
      "doi": ""
    },
    {
      "text": "Springmeyer, R. R., Blattner, M. M., and Max, N. L. A characterization of the scientific data analysis process. In Proceedings of IEEE Visualization (1992). ",
      "doi": "10.5555/949685.949728"
    },
    {
      "text": "Wickham, H., Cook, D., Hofmann, H., and Buja, A. Graphical inference for infovis. IEEE TVCG 16, 6 (2010), 973--979.  ",
      "doi": "10.1109/TVCG.2010.161"
    }
  ]
}