{
  "doi": "10.1145/2207676.2208656",
  "title": "Investigating interruptions in the context of computerised cognitive testing for older adults",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2649-2658",
  "year": 2012,
  "badges": [],
  "abstract": "Interruptions in the home pose a threat to the validity of self-administered computerised cognitive testing. We report the findings of a laboratory experiment investigating the effects of increased interruption workload demand on older adults' computerised cognitive test performance. Related work has reported interruptions having a range of inhibitory and facilitatory effects on primary task performance. Cognitive ageing literature suggests that increased interruption workload demand should have greater detrimental effects on older adults' performance, when compared to younger adults. With 36 participants from 3 age groups (20-54, 55-69, 70+), we found divergent effects of increased interruption demand on two primary tasks. Results suggest that older and younger adults experience interruptions differently, but at no age is test performance compromised by demanding interruptions. This finding is reassuring with respect to the success of a self-administered computerised cognitive assessment test, and is likely to be useful for other applications used by older adults.",
  "authors": [
    {
      "name": "Matthew Brehmer",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453653104",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Charlotte Tang",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384594929",
      "orcid": "missing"
    },
    {
      "name": "Claudia Jacova",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502795037",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Altmann, E. M. & Trafton, J. G. Task interruption: Resumption lag & the role of cues. In Proc. Cognitive Science Society, 43--48, 2104.",
      "doi": ""
    },
    {
      "text": "Bailey, B. P., Konstan, J. A., & Carlis, J. V. Measuring the effects of interruptions on task performance in the user interface. In Systems, Man & Cybernetics, 757--762, 2000.",
      "doi": ""
    },
    {
      "text": "Brehmer, M. M. Usability and the effects of interruption in CTOC: Self-Administered Cognitive Testing on a Computer. M.Sc thesis. University of British Columbia, 2011.",
      "doi": ""
    },
    {
      "text": "Cabeza, R. Task-independent & Task-specific Age Effects on Brain Activity during Working Memory, Visual Attention and Episodic Retrieval. Cerebral Cortex, 14(4):364--375, 2004.",
      "doi": ""
    },
    {
      "text": "Clapp, W. C. & Gazzaley, A.. Distinct mechanisms for the impact of distraction and interruption on working memory in aging. Neurobiology of Aging: 1--15, 2010, In Press.",
      "doi": ""
    },
    {
      "text": "Cohen, J. Eta-squared and partial eta-squared in communication science. Human Communication Research, 28:473--490, 1973.",
      "doi": ""
    },
    {
      "text": "Craik, F .I. M. & Byrd, M. Aging and cognitive deficits: The role of attentional resources, 19--222. In Craik, F. I. M. & Trehub, S. E. (eds.), Aging & Cognitive Processes. Plenum Press, 1982.",
      "doi": ""
    },
    {
      "text": "Craik, F. I. M. & Salthouse, T. A., Eds. The Handbook of Human Aging & Cognition. Erlbaum, Hillsdale, NJ, 2nd edition, 1992.",
      "doi": ""
    },
    {
      "text": "De Renzi, E. & Vignolo, L. A. The token test: A sensitive test to detect receptive disturbances in aphasics. Brain: A Journal of Neurology 85: 665--678, 1962.",
      "doi": ""
    },
    {
      "text": "Dickinson, A., Arnott, J., & Prior. S. Methods for human-computer interaction research with older people. Behaviour & Information Technology 26(4):343--352, 2007.  ",
      "doi": "10.1080/01449290601176948"
    },
    {
      "text": "Farrimond, S., Knight, R. G., & Titov, N. The effects of aging on remembering intentions: performance on a simulated shopping task. Applied Cognitive Psychology, 20(4):533--555, 2006.",
      "doi": ""
    },
    {
      "text": "Folstein, M. F., Folstein, S. E., & McHugh, P. R. Mini-Mental State: a practical method for grading the cognitive state of patients for the clinician. Journal of Psychiatric Research, 12:189--198, 1975.",
      "doi": ""
    },
    {
      "text": "Gillie, T. & Broadbent, D. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychological Research, 50(4):243--250, 1989.",
      "doi": ""
    },
    {
      "text": "Hart, S. G. & Staveland, L. E. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research, 139--183. In Hancock, P. & Meshkati, N. (Eds.). Advances in Human Psychology: Human Mental Workload. Elsevier Science, 1988.",
      "doi": ""
    },
    {
      "text": "Hasher, L. & Zacks, R. T. Working memory, comprehension, and aging: A review and a new view. Psychology of Learning & Motivation, 22:193--225, 1988.",
      "doi": ""
    },
    {
      "text": "Iqbal, S. T. & Bailey, B. P. Leveraging characteristics of task structure to predict the cost of interruption. In Proc. CHI, 741--750, 2006.  ",
      "doi": "10.1145/1124772.1124882"
    },
    {
      "text": "Iqbal, S. T. & Horvitz, E. Disruption and recovery of computing tasks: Field study, analysis, and directions. In Proc. CHI, 677--686, 2007.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Jacova, C., Lee H. S., Le Huray, S., McGrenere, J., Beattie, B. L., Feldman, H., and Hsiung G-Y. R. Cognitive Testing on Computer (C-TOC): Designing a computerized test battery for evaluation of cognitive impairment with user and community health professional input. Alzheimer's & Dementia, 6(4):S317S318, 2010.",
      "doi": ""
    },
    {
      "text": "Monk, C. A., Trafton, J. G., & Boehm-Davis, D. A. The effect of interruption duration and demand on resuming suspended goals. Journal of Experimental Psychology: Applied, 14(4):299--313, 2008.",
      "doi": ""
    },
    {
      "text": "Nasreddine, Z. S., Phillips, N. A., Bédirian, V., Charbonneau, S., Whitehead, V., Collin, I., Cummings, J. L., & Chertkow, H. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment. Journal of the American Geriatrics Society, 53(4):695--699, 2005.",
      "doi": ""
    },
    {
      "text": "O'Conaill, B. & Frohlich, D. Timespace in the workplace: Dealing with interruptions. In Proc. CHI, 262--263, 1995.  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Oulasvirta, A. & Saariluoma, P. Surviving task interruptions: Investigating the implications of long-term working memory theory. International Journal of Human-Computer Studies, 64(10):941--961, 2006.  ",
      "doi": "10.1016/j.ijhcs.2006.04.006"
    },
    {
      "text": "Owen, A. M., McMillan, K. M., Laird, A. R., & Bullmore, E. N-back working memory paradigm: a meta-analysis of normative functional neuroimaging studies. Human Brain Mapping, 25(1):46--59, 2005.",
      "doi": ""
    },
    {
      "text": "Salthouse, T. A. The processing-speed theory of adult age differences in cognition. Psychological Review, 103(3):403--428, 1996.",
      "doi": ""
    },
    {
      "text": "Speier, C., Vessey, I., & Valacich, J. S. The effects of interruptions, task complexity, and information presentation on computer-supported decision-making Performance. Decision Sciences, 34(4):771--797, 2003.",
      "doi": ""
    },
    {
      "text": "Storch, N. A. Does the user interface make interruptions disruptive? A study of interface style and form of interruption. Technical report, Lawrence Livermore National Laboratory, Springfield, 1992.",
      "doi": ""
    },
    {
      "text": "Trafton, J. G., Altmann, E. M., Brock, D. P., & Mintz, F. E. Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal. International Journal of Human-Computer Studies, 58(5):583--603, 2003.  ",
      "doi": "10.1016/S1071-5819%2803%2900023-5"
    },
    {
      "text": "Uttl, B. North American Adult Reading Test: age norms, reliability, and validity. Clinical & Experimental Neuropsychology, 24(8):1123--1137, 2002.",
      "doi": ""
    },
    {
      "text": "Uttl, B. Transparent meta-analysis of prospective memory and aging. PloS ONE, 3(2):e1568 1--31, 2008.",
      "doi": ""
    },
    {
      "text": "Wasylyshyn, C., Verhaeghen, P., & Sliwinski, M. J. Aging and task switching: a meta-analysis. Psychology & Aging, 26(1):15--20, 2011.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Findlater, L., Gergle, D., & Higgins, J. J. The aligned rank transform for nonparametric factorial analyses using only ANOVA procedures. In Proc. CHI, 143--146, 2011.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Zeigarnik, B. Das behalten erledigter und unerledigter handlungen. Psychologische Forschung, 9:1--85, 1927.",
      "doi": ""
    },
    {
      "text": "Zijlstra, F. R. H., Roe, R. A., Leonora, A. B., & Krediet, I. Temporal factors in mental work: Effects of interrupted activities. Journal of Occupational & Organizational Psychology,72(2):163--185, 1999.",
      "doi": ""
    }
  ]
}