{
  "doi": "10.1145/2207676.2207731",
  "title": "Interactivity as self-expression: a field experiment with customization and blogging",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "395-404",
  "year": 2012,
  "badges": [],
  "abstract": "A paradigmatic quality of interactive interfaces is that they allow users to express themselves, thereby converting message receivers into communication sources. We define this quality as Source Interactivity [26, 29], and test its effects on user experience with a field experiment (N=141) of a portal site featuring cosmetic customization, functional customization and blogging (active versus filter). In demonstrating the psychological influence of source-based interactivity on such outcomes as user engagement, sense of agency, sense of community, intrinsic motivation and attitudes toward the interface, we discuss how designers can use them for creating interactive tools for self-expression.",
  "authors": [
    {
      "name": "S. Shyam Sundar",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, United States & Sungkyunkwan University, Seoul, Korea",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    },
    {
      "name": "Jeeyun Oh",
      "institution": "Pennsylvania State Universtiy, University Park, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646759",
      "orcid": "missing"
    },
    {
      "name": "Saraswathi Bellur",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654914",
      "orcid": "missing"
    },
    {
      "name": "Haiyan Jia",
      "institution": "Pennsylvania State University, University Park, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81460650583/rel-imgonly/haiyan-profile-small.jpg",
      "acmid": "81460650583",
      "orcid": "missing"
    },
    {
      "name": "Hyang-Sook Kim",
      "institution": "Pennsylvania State University, University Park, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714093",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarwal, R. and Karahanna, E. Time flies when you're having fun: Cognitive absorption and beliefs about information technology usage. MIS Quarterly 24, 4 (2000), 665--694.  ",
      "doi": "10.2307/3250951"
    },
    {
      "text": "Baghaei, N., Kimani, S., Freyne, J., Brindal, E., Berkovsky, S. and Smith, G. Engaging families in lifestyle changes through social networking. International Journal of Human-Computer Interaction 27, 10 (2011), 971--990.",
      "doi": ""
    },
    {
      "text": "Bailey, R. W., and Bolls, P. How avatar customizability affects children's arousal and subjective presence during junk food-sponsored online video games. CyberPsychology & Behavior 12, 3 (2009), 277--283.",
      "doi": ""
    },
    {
      "text": "Baker, J. R. and Moore, S. M. Blogging as a social tool: A psychosocial examination of the effects of blogging. CyberPsychology & Behavior 11, 6 (2008), 747--749.",
      "doi": ""
    },
    {
      "text": "Busselle, R. and Bilandzic, H. Fictionality and perceived realism in experiencing stories: A model of narrative comprehension and engagement. Communication Theory 18, 2 (2008), 255--280.",
      "doi": ""
    },
    {
      "text": "Cheng, R., and Vassileva, J. User motivation and persuasion strategy for peer-to-peer communities. In Proc. HICSS'38 (2005), Hawaii, USA, 193--202.  ",
      "doi": "10.1109/HICSS.2005.653"
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The psychology of optimal experience. New York: Harper and Row, 1990.",
      "doi": ""
    },
    {
      "text": "Firpo, D., Kasemvilas, S., Ractham, P. and Zhang, X. Generating a sense of community in a graduate educational setting through persuasive technology. In Proc. Persuasive Technology, ACM Press (2009), Article 41.  ",
      "doi": "10.1145/1541948.1542000"
    },
    {
      "text": "Flemming, M. A. and Petty, R. E. Identity and persuasion: An elaboration likelihood approach. In M. A. Hogg & D. J. Terry (Eds.), Attitude, behavior, and social context: The role of norms and group membership. Mahawah, NJ: Erlbaum, 2000.",
      "doi": ""
    },
    {
      "text": "Guay, F., Vallerand, R. J., and Blanchard, C. On the assessment of situational intrinsic and extrinsic motivation: The situational motivation scale. Motivation and emotion 24, 3 (2000), 175--213.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. and Tractinsky, N. User experience: A research agenda. Behavior and Information Technology 25, 2 (2006), 91--97.",
      "doi": ""
    },
    {
      "text": "Higgins, E. T. Value from hedonic experience and engagement. Psychological Review 113, 3 (2006), 439--460.",
      "doi": ""
    },
    {
      "text": "Hu, Y. and Sundar, S. S. Effects of online health sources on credibility and behavioral intentions. Communication Research 37, 1 (2010), 105--132.",
      "doi": ""
    },
    {
      "text": "Huang, C., Shen, Y.-Z., Lin, H.-X. and Chang, S.-S. Bloggers' motivations and behaviors: A model. Journal of Advertising Research 47, 4 (2007), 472--484.",
      "doi": ""
    },
    {
      "text": "Iyengar, S. and Lepper, M. When choice is demotivating: Can one desire too much of a good thing? Journal of Personality and Social Psychology 79 (2000), 995--1006.",
      "doi": ""
    },
    {
      "text": "Kalyanaraman, S. and Sundar, S. S. The psychological appeal of personalized content in Web portals: Does customization affect attitudes and behavior? Journal of Communication 56 (2006), 110--132.",
      "doi": ""
    },
    {
      "text": "Kumkale, G. T. and Albarracin, D. The sleeper effect in persuasion: A meta-analytic review. Psychological Bulletin 130 (2004), 143--172.",
      "doi": ""
    },
    {
      "text": "Marathe, S. S. and Sundar, S. S. The 'me' revolution in mediated communication: Investigating the psychology of cosmetic and functional customization. In Proc. International Communication Association, 2011.",
      "doi": ""
    },
    {
      "text": "Marathe, S. S. and Sundar, S. S. What drives customization? Control or identity? In Proc. CHI 2011, ACM Press (2011), 781--790.  ",
      "doi": "10.1145/1978942.1979056"
    },
    {
      "text": "Marathe, S. S., Sundar, S. S., Bijvank, M. N., et al. Who are these power users anyway? Building a psychological profile. In Proc. International Communication Association, 2007.",
      "doi": ""
    },
    {
      "text": "O'Brien, H. L., Toms, E. G., Kelloway, E. K. and Kelley, E. Developing and evaluating a reliable measure of user engagement. In Proc. American Society for Information Science and Technology, 2008.",
      "doi": ""
    },
    {
      "text": "Petty, R. E. and Cacioppo, J. T. Involvement and persuasion: Tradition versus integration. Psychological Bulletin 107 (1990), 367--374.",
      "doi": ""
    },
    {
      "text": "Rivera, D. The effect of content customization on learnability and perceived workload. In Proc. CHI '05 extended abstracts on Human factors in computing systems, ACM Press (2005), 1749--1752.  ",
      "doi": "10.1145/1056808.1057013"
    },
    {
      "text": "Stavrositu, C., and Sundar, S. S. (2008). Can blogs empower women? Designing agency-enhancing and community-building interfaces. In Proc. Ext. Abstracts CHI 2008, ACM Press (2008), 2781--2786.  ",
      "doi": "10.1145/1358628.1358761"
    },
    {
      "text": "Sundar, S. S. Self as source: Agency and customization in interactive media. In E. Konijn, S. Utz, M. Tanis, and S. Barnes (Eds.), Mediated interpersonal communication (pp. 58--74). New York: Routledge, 2008.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S. Social psychology of interactivity in human-website interaction. In A. N. Joinson, K. Y. A. McKenna, T. Postmes, and U.-D. Reips (Eds.). The Oxford handbook of Internet psychology, (pp. 89--104). Oxford University Press Oxford, UK, 2007.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., Kalyanaraman, S. and Brown, J. Explicating website interactivity: Impression-formation effects in political campaign sties. Communication Research 30 (2003), 30--59.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., and Marathe, S. S. Personalization versus customization: The importance of agency, privacy, and power usage. Human Communication Research 36 (2010), 298--322.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., Xu, Q., and Bellur, S. Designing interactivity in media interfaces: A communications perspective. In Proc. CHI 2010, ACM Press (2010), 2247--2256.  ",
      "doi": "10.1145/1753326.1753666"
    },
    {
      "text": "Ulken, E. Measuring user engagement: Lessons from BusinessWeek. Online Journalism Review. http://www.ojr.org/ojr/people/eulken/200904/1696/.",
      "doi": ""
    },
    {
      "text": "Vohs, K. D., Baumeister, R. F., Schemeichel, B. J., Twenge, J. M., Nelson, N. M. and Tice, D. M. Making choices impairs subsequent self-control: A limited-resource account of decision making, self-regulation, and active initiative. Journal of Personality and Social Psychology 94 (2008), 883--989.",
      "doi": ""
    },
    {
      "text": "Wei, L. Filter blogs vs. personal journals: Understanding the knowledge production gap on the Internet. Journal of Computer-Mediated Communication 14 (2009), 532--558.",
      "doi": ""
    },
    {
      "text": "Winer, D. The history of weblogs. 2002. http://oldweblogscomblog.scripting.com/historyOfWeblogs.",
      "doi": ""
    },
    {
      "text": "Xiao, J., Stasko, J., and Catrambone, R. The role of choice and customization on users' interaction with embodied conversational agents: Effects on perception and performance. In Proc. CHI 2007, ACM Press (2007), 1293--1302.  ",
      "doi": "10.1145/1240624.1240820"
    },
    {
      "text": "Yu, F.-Y. Scaffolding student-generated questions: Design and development of a customizable online learning system, Computers in Human Behavior 25, 5 (2009), 1129--1138.  ",
      "doi": "10.1016/j.chb.2009.05.002"
    }
  ]
}