{
  "doi": "10.1145/2207676.2207752",
  "title": "The way i talk to you: sentiment expression in an organizational context",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "551-554",
  "year": 2012,
  "badges": [],
  "abstract": "Sentiment is a rich and important dimension of social interaction. However, its presence in computer-mediated communication in corporate settings is not well understood. This paper provides a preliminary study of people's expression of sentiment in email conversations in an organizational context. The study reveals that sentiment levels evolve over time during the process of newcomers' socialization, that sentiment varies according to tie-strength with the recipient, and that sentiment patterns can be indicative of one's position in the corporate social network as well as job performance. These findings shed light on the complex and dynamic nature of sentiment patterns, and would inspire further explorations and applications of sentiment analysis in organizations.",
  "tags": [
    "social network",
    "sentiments",
    "organizational science",
    "email",
    "computer-mediated-communication (cmc)",
    "socializing"
  ],
  "authors": [
    {
      "name": "Jiang Yang",
      "institution": "University of Michigan, Ann Arbor, Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592536",
      "orcid": "missing"
    },
    {
      "name": "Lada Adamic",
      "institution": "University of Michigan Ann Arbor, Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593838",
      "orcid": "missing"
    },
    {
      "name": "Mark Ackerman",
      "institution": "University of Michigan, Ann Arbor, Michigan, United States",
      "img": "/do/10.1145/contrib-81100017207/rel-imgonly/81100017207.jpg",
      "acmid": "81100017207",
      "orcid": "0000-0001-9727-1664"
    },
    {
      "name": "Zhen Wen",
      "institution": "IBM T. J. Watson Research Center, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309482469",
      "orcid": "missing"
    },
    {
      "name": "Ching-Yung Lin",
      "institution": "IBM T. J. Watson Research Center, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81423596297",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arguello, J., Butler, B., Elisabeth, J., Kraut, R., Ling, K. S., Rose, C., and Wang, X. Talk to Me: Foundations for Successful Individual-Group Interactions in Online Communities. in CHI (2006).  ",
      "doi": "10.1145/1124772.1124916"
    },
    {
      "text": "Burke, M., Marlow, C., and Lento, T. M. Feed me: motivating newcomer contribution in social network sites. in CHI (2009), 945--954.  ",
      "doi": "10.1145/1518701.1518847"
    },
    {
      "text": "Chan, D. and Schmitt, N., Interindividual differences in intraindividual changes in proactivity during organizational entry: A latent growth modeling approach to understanding newcomer adaptation. Journal of Applied Psychology 85, 2 (2000), 190--210.",
      "doi": ""
    },
    {
      "text": "Diakopoulos, N. A. and Shamma, D. A. Characterizing debate performance via aggregated twitter sentiment. in CHI (2010), 1195--1198.  ",
      "doi": "10.1145/1753326.1753504"
    },
    {
      "text": "Gilbert, E. and Karahalios, K. Predicting tie strength with social media. in CHI (2009), 211--220.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Mishne, G. and Rijke, M. d., Predicting movie sales from blogger sentiment, in AAAI 2006 Spring Symposium on Computational Approaches to Analysing Weblogs (AAAI-CAAW 2006). 2006.",
      "doi": ""
    },
    {
      "text": "Pang, B., Lee, L., and Vaithyanathan, S. Thumbs up? Sentiment Classification using Machine Learning Techniques. in Proc. Empirical methods in natural language processing, ACL (2002), 79--86.  ",
      "doi": "10.3115/1118693.1118704"
    },
    {
      "text": "Wilson, T., Wiebe, J., and Hoffmann, P. Recognizing Contextual Polarity in Phrase-Level Sentiment Analysis. in Proc. HLT-EMNLP, (2005).  ",
      "doi": "10.3115/1220575.1220619"
    },
    {
      "text": "Wu, L., Lin, C.-Y., Aral, S., and Brynjolfsson, E., Value of Social Network - A Large-Scale Analysis on Network Structure Impact to Financial Revenue of Information Technology Consultants. 2009.",
      "doi": ""
    },
    {
      "text": "Yang, J., Ackerman, M., and Adamic, L. Virtual Gifts and Guanxi: Supporting Social Exchange in a Chinese Online Community. in Proc. CSCW, ACM (2011), 45--54.  ",
      "doi": "10.1145/1958824.1958832"
    }
  ]
}