{
  "doi": "10.1145/2207676.2208608",
  "title": "Reactive information foraging: an empirical investigation of theory-based recommender systems for programmers",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1471-1480",
  "year": 2012,
  "badges": [],
  "abstract": "Information Foraging Theory (IFT) has established itself as an important theory to explain how people seek information, but most work has focused more on the theory itself than on how best to apply it. In this paper, we investigate how to apply a reactive variant of IFT (Reactive IFT) to design IFT-based tools, with a special focus on such tools for ill-structured problems. Toward this end, we designed and implemented a variety of recommender algorithms to empirically investigate how to help people with the ill-structured problem of finding where to look for information while debugging source code. We varied the algorithms based on scent type supported (words alone vs. words + code structure), and based on use of foraging momentum to estimate rapidity of foragers' goal changes. Our empirical results showed that (1) using both words and code structure significantly improved the ability of the algorithms to recommend where software developers should look for information; (2) participants used recommendations to discover new places in the code and also as shortcuts to navigate to known places; and (3) low-momentum recommendations were significantly more useful than high-momentum recommendations, suggesting rapid and numerous goal changes in this type of setting. Overall, our contributions include two new recommendation algorithms, empirical evidence about when and why participants found IFT-based recommendations useful, and implications for the design of tools based on Reactive IFT.",
  "tags": [
    "debugging",
    "software maintenance",
    "information foraging"
  ],
  "authors": [
    {
      "name": "David Piorkowski",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/do/10.1145/contrib-81474694114/rel-imgonly/profile_sm.jpg",
      "acmid": "81474694114",
      "orcid": "missing"
    },
    {
      "name": "Scott Fleming",
      "institution": "University of Memphis & Oregon State University, Memphis, Tennessee, United States",
      "img": "/do/10.1145/contrib-81100588251/rel-imgonly/scott_fleming.jpg",
      "acmid": "81100588251",
      "orcid": "missing"
    },
    {
      "name": "Christopher Scaffidi",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100575732",
      "orcid": "missing"
    },
    {
      "name": "Christopher Bogart",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/do/10.1145/contrib-81435601576/rel-imgonly/bogart_proff_photo.jpg",
      "acmid": "81435601576",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Bonnie John",
      "institution": "IBM Research & HCI Institute, Carnegie Mellon University, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "Rachel Bellamy",
      "institution": "IBM Research, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100257325",
      "orcid": "missing"
    },
    {
      "name": "Calvin Swart",
      "institution": "IBM Research, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100027041",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baeza-Yates, R., Ribeiro-Neto, B. Modern Information Retrieval, Addison Wesley Longman, 1999. ",
      "doi": "10.5555/553876"
    },
    {
      "text": "Bragdon, A., Zeleznik, R., Reiss, S., Karumuri, S., Cheung, W., Kaplan, J., Coleman, C., Adeputra, F., and LaViola, J. Proc. CHI, ACM (2010), 2503--2512.  ",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Chi, E., Pirolli, P, Chen, K., and Pitkow, J. Using information scent to model user information needs and actions on the web. Proc. CHI, ACM (2001), 490--497.  ",
      "doi": "10.1145/365024.365325"
    },
    {
      "text": "Chi, E., Rosien, A., Supattanasiri, G., Williams, A., Royer, C., Chow, C., Robles, E., Dalal, B., Chen, J., and Cousins, S. The Bloodhound project: Automating discovery of web usability issues using the InfoScent simulator, Proc. CHI, ACM (2003), 505--512.  ",
      "doi": "10.1145/642611.642699"
    },
    {
      "text": "Cubranic, D, and Murphy, G. Hipikat: Recommending pertinent software development artifacts. Proc. ICSE, ACM/IEEE (2003), 408--418. ",
      "doi": "10.5555/776816.776866"
    },
    {
      "text": "DeLine, R., Khella, A., Czerwinski, M., and Robertson, G. Towards understanding programs through wearbased filtering. Proc. Softvis, ACM (2005), 183--192.  ",
      "doi": "10.1145/1056018.1056044"
    },
    {
      "text": "Fu, W. and Pirolli, P. SNIF-ACT: A cognitive model of user navigation on the World Wide Web, HumanComputer Interaction 22, 4 (2007), 355--412. ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Grigoreanu, V., Burnett, M., Wiedenbeck, S., Cao, J., Rector, K., and Kwan, I. End-User Debugging Strategies: A Sensemaking Perspective. ACM Trans. Comput.Hum. Interact. (to appear).  ",
      "doi": "10.1145/2147783.2147788"
    },
    {
      "text": "Gross, P. and Kelleher, C. Non-programmers identifying functionality in unfamiliar code: Strategies and barriers. Proc. VL/HCC. IEEE (2009), 75--82.  ",
      "doi": "10.1109/VLHCC.2009.5295294"
    },
    {
      "text": "Hill, W., Hollan, J., Wroblewski, D., McCandless, T. Edit wear and read wear. Proc. CHI, ACM (1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Jakobsen, M. and Hornbaek, K. Evaluating a fisheye view of source code. Proc. CHI, ACM (2006), 377--386.  ",
      "doi": "10.1145/1124772.1124830"
    },
    {
      "text": "Kersten, M. and Murphy, G. Mylar: A degree-of-interest model for IDEs. Proc. ASOD, ACM (2005), 159--168.  ",
      "doi": "10.1145/1052898.1052912"
    },
    {
      "text": "Ko, A., Myers, B., Coblenz, M., and Aung, H. An exploratory study of how developers seek, relate, and collect relevant information during software maintenance tasks. IEEE Trans. Soft. Eng. 32, (2006), 971--987.  ",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Lawrance, J., Bellamy, R., Burnett, M., and Rector, K. Using information scent to model the dynamic foraging behavior of programmers in maintenance tasks, Proc. CHI, ACM (2008), 1323--1332.  ",
      "doi": "10.1145/1357054.1357261"
    },
    {
      "text": "Lawrance, J., Bogart, C., Burnett, M., Bellamy, R., Rector, K., and Fleming, S. How programmers debug, revisited: An information foraging theory perspective, IEEE Trans. Soft. Eng. (to appear 2012).  ",
      "doi": "10.1109/TSE.2010.111"
    },
    {
      "text": "Lawrance, J., Burnett, M., Bellamy, R., Bogart, C., and Swart, C. Reactive information foraging for evolving goals. Proc. CHI, ACM (2010), 25--34.  ",
      "doi": "10.1145/1753326.1753332"
    },
    {
      "text": "Nielsen, J. Information foraging: Why Google makes people leave your site faster. http://www.useit.com/ alertbox/20030630.html. June 30, 2003.",
      "doi": ""
    },
    {
      "text": "Olston, C. and Chi, E. ScentTrails: Integrating browsing and searching on the web. ACM Trans. Comput.-Hum. Interact. 10, 3 (2003), 177--197.  ",
      "doi": "10.1145/937549.937550"
    },
    {
      "text": "Parnin, C. and Gorg, C. Building usage contexts during program comprehension. Proc. ICPC, IEEE (2006), 13--22  ",
      "doi": "10.1109/ICPC.2006.14"
    },
    {
      "text": "Piorkowski, D., Fleming, S. D., Scaffidi, C., John, L., Bogart, C., John, B. E., Burnett, M., and Bellamy, R. Modeling programmer navigation: A head-to-head empirical evaluation of predictive models. Proc. VL/HCC, IEEE (2011), 109--116.",
      "doi": ""
    },
    {
      "text": "Pirolli, P. Computational models of information scentfollowing in a very large browsable text collection. Proc. CHI 1997, ACM Press (1997), 3--10.  ",
      "doi": "10.1145/258549.258558"
    },
    {
      "text": "Pirolli, P. Information Foraging Theory: Adaptive Interaction with Information. Oxford Univ. Press, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Pirolli, P. and Card, S.K. Information foraging. Psychological Review 106, 4 (1999), 643--675.",
      "doi": ""
    },
    {
      "text": "Resnick, P. and Varian, H. Recommender systems. Commun. ACM 40, 3 (1997), 56--58.  ",
      "doi": "10.1145/245108.245121"
    },
    {
      "text": "Sillito, J., Murphy, G., and De Volder, K. Questions programmers ask during software evolution tasks. Proc. FSE, ACM (2006), 23--34.  ",
      "doi": "10.1145/1181775.1181779"
    },
    {
      "text": "Sillito, J., De Voider, K., Fisher, B., and Murphy, G. Managing software change tasks: An exploratory study. Proc. ISESE, IEEE (2005), 1--10.",
      "doi": ""
    },
    {
      "text": "Sinha, V., Karger, D., and Miller, R. Relo: Helping users manage context during interactive exploratory visualization of large codebases. Proc. VL/HCC, IEEE (2006), 187--194.  ",
      "doi": "10.1109/VLHCC.2006.40"
    },
    {
      "text": "Spool, J., Profetti, C., and Britain, D., Designing for the scent of information, User Interface Engineering, (2004).",
      "doi": ""
    },
    {
      "text": "Storey, M, Best, C, Michaud, J, Rayside, D, Litoiu, M, and Musen, M. SHriMP views: An interactive environment for information visualization and navigation. Ext. Abstracts CHI '02, (2002), 520--521.  ",
      "doi": "10.1145/506443.506459"
    },
    {
      "text": "Wiedenbeck, S. and Evans, N. Beacons in program comprehension. ACM SIGCHI Bulletin 18, 2 (1986), 56--57.  ",
      "doi": "10.1145/15683.1044090"
    }
  ]
}