{
  "doi": "10.1145/2207676.2208638",
  "title": "Beyond stereo: an exploration of unconventional binocular presentation for novel visual experience",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2523-2526",
  "year": 2012,
  "badges": [],
  "abstract": "Human stereo vision processes the two different images seen by the two eyes to generate depth sensation. While current stereoscopic display technologies look at how to faithfully simulate the stereo viewing experience, we took a look out of this scope, to explore how we may present binocular image pairs that differ in other ways to create novel visual experience. This paper presents several interesting techniques we explored, and discusses their potential applications according to an informal user study.",
  "authors": [
    {
      "name": "Haimo Zhang",
      "institution": "Microsoft Research Asia & National University of Singapore, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502794017",
      "orcid": "missing"
    },
    {
      "name": "Xiang Cao",
      "institution": "Microsoft Research Asia, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100130420",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    }
  ],
  "references": [
    {
      "text": "Billock, V. A. and Tsou, B. H. Seeing Forbidden Colors. Scientific American 302, (2010), 72--77.",
      "doi": ""
    },
    {
      "text": "Blake, R. A Primer on binocular rivalry, including current controversies. Brain and Mind 2, 1 (2001), 5--38.",
      "doi": ""
    },
    {
      "text": "Fahle, M. Binocular rivalry: suppression depends on orientation and spatial frequency. Vision Research 22, 7 (1982), 787--800.",
      "doi": ""
    },
    {
      "text": "Goshtasby, A. A. and Nikolov, S. Image fusion: Advances in the state of the art. Information Fusion 8, 2 (2007), 114--118.  ",
      "doi": "10.1016/j.inffus.2006.04.001"
    },
    {
      "text": "Jung, Y. J., Sohn, H, Lee, S., Ro, Y. M. and Park, H. W. Quantitative measurement of binocular color fusion limit for non-spectral colors. Optics Express 19, 8 (2011), 7325--7338.",
      "doi": ""
    },
    {
      "text": "Roth, H. L., Lora, A. N. and Heilman, K. M. Effects of monocular viewing and eye dominance on spatial attention. Brain 125, Pt 9 (2002), 2023--35.",
      "doi": ""
    },
    {
      "text": "Tyler, C. W. Sensory processing of binocular disparity. Vergence eye movements: Basic and clinical aspects. Butterworths, London, UK, 1983.",
      "doi": ""
    },
    {
      "text": "Xu, J. P., He, Z. J. and Ooi, T. L. Surface boundary contour strengthens image dominance in binocular competition. Vision Research 50, 2 (2010), 155--170.",
      "doi": ""
    }
  ]
}