{
  "doi": "10.1145/2207676.2208677",
  "title": "Narratives of satisfying and unsatisfying experiences of current mobile augmented reality applications",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2779-2788",
  "year": 2012,
  "badges": [],
  "abstract": "Over the last few years, mobile applications demonstrating Augmented Reality (AR) - such as Layar, Junaio and Google Goggles - have been introduced to consumers. We conducted an online survey to explore the user experience (UX) of early stage mobile AR applications available in the market in spring 2011, covering both location-based AR browsers and image recognition AR applications for object-based interaction. We identify various types of experiences such applications have evoked by qualitatively analyzing 84 users' narratives of their most satisfying and unsatisfying experiences. The results highlight, for example, experiences of awareness of surroundings, empowerment, positive surprise, amazement and fascination from the novelty value, as well as some examples of immersion and social connectivity. The analysis indicates that the applications have not yet reached their potential in evoking a multifaceted user experience that is characteristic especially to AR. This work helps in understanding the experiential design potential in mobile AR and points out UX issues to further focus on in design.",
  "authors": [
    {
      "name": "Thomas Olsson",
      "institution": "Tampere University of Technology, Tampere, Finland",
      "img": "/do/10.1145/contrib-99659364710/rel-imgonly/20180530-tdo_5098_small.jpg",
      "acmid": "99659364710",
      "orcid": "missing"
    },
    {
      "name": "Markus Salo",
      "institution": "University of Jyväskylä, Jyväskylä, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496642981",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azuma, R. T. Tracking requirements for augmented reality. Communications of the ACM 36, 7 (1993), 50--51.  ",
      "doi": "10.1145/159544.159581"
    },
    {
      "text": "Barba, E., MacIntyre, B., Rouse, R., Bolter, J. Thinking inside the box: Making meaning in a handheld AR experience. In Proc. ISMAR 2010, IEEE (2010), 19--26.",
      "doi": ""
    },
    {
      "text": "Barthel, R., Hudson-Smith, A., Jode, M., Blundell, B. Tales of things. The Internet of 'old' things: collecting stories of objects, places and spaces. In Proc. Internet of Things, IEEE (2010). ",
      "doi": "10.5555/2227001.2227026"
    },
    {
      "text": "Chang, S. E., Hsieh, Y., Lee, T., Liao, C., Wang, S. A user study on the adoption of location based services. In Proc. APWeb/WAIM Workshops (2007), 276--286.",
      "doi": ""
    },
    {
      "text": "Desmet, P. Designing emotions. Dissertation, Delft University of Technology, 2002.",
      "doi": ""
    },
    {
      "text": "Desmet, P. & Hekkert, P. Framework of product experience. International Journal of Design 1, 1 (2007), 57--66.",
      "doi": ""
    },
    {
      "text": "Desmet, P., Porcelijn, R., van Dijk, M. Emotional design; Application of a research-based design approach. Knowledge, Technology & Policy 20, 3 (2007), 141--155.",
      "doi": ""
    },
    {
      "text": "Dünser, A., Grasset, R., Billinghurst, M. A survey of evaluation techniques used in augmented reality studies, In Proc. ACM SIGGRAPH 2008, ACM Press (2008).",
      "doi": ""
    },
    {
      "text": "Geven, A., Schrammel, J., Tscheligi, M. Narrations and storytelling as methodological key elements for studying user experience. In Proc. NordiCHI COST294-MAUSE, ACM Press (2006), 79--83.",
      "doi": ""
    },
    {
      "text": "Gremler, D. The critical incident technique in service research. Journal of Service Research 7, 1 (2004), 65--89.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. The thing and I: understanding the relationship between user and product. In Funology: From Usability to Enjoyment, Blythe, M. et al. (Eds). Kluwer Academic Publishers, 2003, pp 31--42. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "Höllerer, T. & Feiner, S. Mobile Augmented Reality. In Karimi, H. & Hammad, A. (Eds), Telegeoinformatics: Location-Based Computing and Services, Taylor & Francis Books Ltd, 2004.",
      "doi": ""
    },
    {
      "text": "ISO FDIS 9241-210:2009. Ergonomics of human system interaction - Part 210: Human-centred design for interactive systems. International Organisation for Standardisation, ISO (2009).",
      "doi": ""
    },
    {
      "text": "Jordan. P. W. Designing pleasurable products. CRC Press, 2002.",
      "doi": ""
    },
    {
      "text": "Jumisko-Pyykkö, S. & Vainio, T. Framing the context of use in mobile HCI. International Journal of Mobile Human-Computer Interaction 2, 4, (2010), 1--28.  ",
      "doi": "10.4018/jmhci.2010100101"
    },
    {
      "text": "Kahnemann, D., Krueger, A., Schkade, D., Schwarz, N., Stone, A. A survey method for characterizing daily life experience: The day reconstruction method. Science 3 306, 5702 (2004), 1776--1780b.",
      "doi": ""
    },
    {
      "text": "Karpischek, S. & Michahelles, F. my2cents - Digitizing consumer opinions and comments about retail products. In Proc. Internet of Things, IEEE (2010).",
      "doi": ""
    },
    {
      "text": "Kindberg, T. Implementing physical hyperlinks using ubiquitous identi er resolution. In Proc. World Wide Web, ACM Press (2002), 191--199.  ",
      "doi": "10.1145/511446.511472"
    },
    {
      "text": "Korhonen, H., Arrasvuori,J., Väänänen-Vainio-Mattila, K. Let users tell the story: Evaluating user experience with experiencer. In CHI Extended Asbtracts, ACM Press (2010), 4051--4056.  ",
      "doi": "10.1145/1753846.1754101"
    },
    {
      "text": "Kruijff, E. Swan, E., Feiner, S. Perceptual issues in augmented reality revisited. In Proc. ISMAR 2010, IEEE (2010), 3--12.",
      "doi": ""
    },
    {
      "text": "Larson, R., & Csikszentmihalyi, M. The experience sampling method. New Directions for Methodology of Social and Behavioral Science 15, (1983), 41--56.",
      "doi": ""
    },
    {
      "text": "Olsson, T., Ihamäki, P., Lagerstam, E., Ventä-Olkkonen, L., Väänänen-Vainio-Mattila, K. User expectations for mobile mixed reality services. In Proc. ECCE'09, ACM Press (2009), 177--184. ",
      "doi": "10.5555/1690508.1690533"
    },
    {
      "text": "Olsson, T,. Lagerstam, E., Kärkkäinen, T., Väänänen-Vainio-Mattila, K. Expected user experience of mobile augmented reality services: A user study in the context of shopping centers. Journal of Personal and Ubiquitous Computing, Online first (2011).  ",
      "doi": "10.1007/s00779-011-0494-x"
    },
    {
      "text": "Olsson, T & Salo, M. Online user survey on current mobile augmented reality applications. In Proc. ISMAR 2011, IEEE (2011), 75--84.  ",
      "doi": "10.1109/ISMAR.2011.6092372"
    },
    {
      "text": "Paay, J. & Kjeldskov, J. Understanding the user experience of location-based services: five principles of perceptual organizations applied. Journal of Location Based Services 2, 4 (2008).  ",
      "doi": "10.1080/17489720802609328"
    },
    {
      "text": "Partala, T. & Kallinen, A. Understanding the most satisfying and unsatisfying user experiences: emotions, psychological needs, and context. Accepted to Interacting with Computers.  ",
      "doi": "10.1016/j.intcom.2011.10.001"
    },
    {
      "text": "Vaittinen, T., Kärkkäinen, T., Olsson, T. A diary study on annotating locations with mixed reality information. In Proc. Mobile Ubiquitous Multimedia 2010, ACM Press (2010), Article No. 21.  ",
      "doi": "10.1145/1899475.1899496"
    },
    {
      "text": "Vallino, J. Interactive augmented reality. Dissertation, University of Rochester (1998). ",
      "doi": "10.5555/926846"
    }
  ]
}