{
  "doi": "10.1145/2207676.2208583",
  "title": "Going beyond the surface: studying multi-layer interaction above the tabletop",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1277-1286",
  "year": 2012,
  "badges": [],
  "abstract": "Lightweight spatially aware displays (Tangible Magic Lenses) are an effective approach for exploring complex information spaces within a tabletop environment. One way of using the 3D space above a horizontal surface is to divide it into discrete parallel layers stacked upon each other. Horizontal and vertical lens movements are essential tasks for the style of multi-layer interaction associated with it. We conducted a comprehensive user study with 18 participants investigating fundamental issues such as optimal number of layers and their thickness, movement and holding accuracies, and physical boundaries of the interaction volume. Findings include a rather limited overall interaction height (44 cm), a different minimal layer thickness for vertical and horizontal search tasks (1 cm/4 cm), a reasonable maximum number of layers depending on the primary task, and a convenience zone in the middle for horizontal search. Derived from that, design guidelines are also presented.",
  "tags": [
    "multi-layer interaction",
    "above the tabletop",
    "user study",
    "tangible magic lens",
    "spatially aware displays"
  ],
  "authors": [
    {
      "name": "Martin Spindler",
      "institution": "University of Magdeburg, Magdeburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320495228",
      "orcid": "missing"
    },
    {
      "name": "Marcel Martsch",
      "institution": "University of Magdeburg, Magdeburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502800558",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "University of Magdeburg, Magdeburg, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "E. A. Bier, M. C. Stone, K. Pier, W. Buxton, and T. D. DeRose. Toolglass and Magic Lenses: The See-Through Interface. Proc. SIGGRAPH 1993, ACM Press (1993), 445--446.  ",
      "doi": "10.1145/259963.260447"
    },
    {
      "text": "L. D. Brown, and H. Hua, Magic Lenses for Augmented Virtual Environments. IEEE Computer Graphics and Applications. 26, 4 (July 2006), 64--73.  ",
      "doi": ""
    },
    {
      "text": "L. K. Y. Chan and H. Y. K. Lau. Poster: A Tangible User Interface Using Spatial Augmented Reality. Proc. IEEE 3DUI, IEEE Comp. Society, 2010, 137--138.  ",
      "doi": ""
    },
    {
      "text": "G. W. Fitzmaurice. Situated Information Spaces and Spatially Aware Palmtop Computers, Communications of ACM, 36, 7 (1993), 39--49.  ",
      "doi": ""
    },
    {
      "text": "K. Hirota and Y. Saeki. Cross-section Projector: Interactive and Intuitive Presentation of 3D Volume Data using a Handheld Screen. Proc. 3DUI 2007, IEEE Computer Society Press (2007), 57--63.",
      "doi": ""
    },
    {
      "text": "D. Holman, R. Vertegaal, M. Altosaar, N. Troje, and D. Johns. Paper Windows: Interaction Techniques for Digital Paper. Proc. CHI '05, ACM Press (2005), 591--599.  ",
      "doi": ""
    },
    {
      "text": "H. Ishii and B. Ullmer. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. Proc. CHI 1997, ACM Press (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "S. Izadi, S. Hodges, S. Taylor, D. Rosenfeld, N. Villar, A. Butler, and J. Westhues. Going Beyond the Display: A Surface Technology with an Electronically Switchable Diffuser. Proc. UIST '08, ACM Press (2008), 269--278.  ",
      "doi": ""
    },
    {
      "text": "Y. Kakehi and T. Naemura. UlteriorScape: Interactive Optical Superimposition on a View-Dependent Tabletop Display. Proc. TABLETOP '08. IEEE Computer Society Press (2008), 189--192.",
      "doi": ""
    },
    {
      "text": "J. Konieczny, C. Shimizu, G. W. Meyer, and D. A. Colucci. Handheld Flexible Display System. Proc. VIS '05, IEEE Computer Society Press (2005), 75--81.",
      "doi": ""
    },
    {
      "text": "J. C. Lee, S. E. Hudson, J. W. Summet, and P. H. Dietz. Moveable Interactive Projected Displays Using Projector Based Tracking. Proc. UIST '05, ACM Press (2005), 63--72.  ",
      "doi": "10.1145/1095034.1095045"
    },
    {
      "text": "J. Oh and H. Hua. User Evaluations on Form Factors of Tangible Magic Lenses. Proc. ISMAR '06, ACM Press (2006), 23--32.  ",
      "doi": ""
    },
    {
      "text": "J. Sanneblad and L. E. Holmquist. Ubiquitous Graphics: Combining Hand-held and Wall-size Displays to Interact with Large Images. Proc. AVI '06, ACM Press (2006), 373--377.  ",
      "doi": ""
    },
    {
      "text": "M. Spindler and R. Dachselt. Poster: Towards Making Graphical User Interface Palettes Tangible. Proc. ITS '10, ACM Press (2010), 291--292.  ",
      "doi": ""
    },
    {
      "text": "M. Spindler, S. Stellmach, and R. Dachselt. Advanced Magic Lens Interaction above the Tabletop. Proc. ITS '09, ACM Press (2009), 77--84.  ",
      "doi": ""
    },
    {
      "text": "M. Spindler, C. Tominski, H. Schumann, and R. Dachselt. Tangible Views for Information Visualization. Proc. ITS '10, ACM Press (2010), 157--166.  ",
      "doi": ""
    },
    {
      "text": "S. Subramanian, D. Aliakseyeu, and A. Lucero. Multi-Layer Interaction for Digital Tables. Proc. UIST '06, ACM Press (2006), 269--272.  ",
      "doi": ""
    },
    {
      "text": "A. R. Tilley. The Measure of Man and Woman: Human Factors in Design. John Wiley & Sons, 2nd ed., 2002.",
      "doi": ""
    },
    {
      "text": "A. Treisman and G. Gelade. A Feature Integration Theory of Attention. Cognitive Psychology. 12, (1980), 97--136.",
      "doi": ""
    },
    {
      "text": "B. Ullmer and H. Ishii. The metaDESK: Models and Prototypes for Tangible User Interfaces. Proc. UIST '97, ACM Press (1997), 223--232.  ",
      "doi": ""
    },
    {
      "text": "M. Weiser. The Computer for the 21st Century. Scientific American. 265, 3 (1991), 66--75.",
      "doi": ""
    },
    {
      "text": "K. Yee. Peephole Displays: Pen Interaction on Spatially Aware Handheld Computers. Proc. CHI '03, ACM Press (2003), 1--8.  ",
      "doi": ""
    }
  ]
}