{
  "doi": "10.1145/2207676.2208641",
  "title": "MUSTARD: a multi user see through AR display",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2541-2550",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present MUSTARD, a multi-user dynamic random hole see-through display, capable of delivering viewer dependent information for objects behind a glass cabinet. Multiple viewers are allowed to observe both the physical object(s) being augmented and their location dependent annotations at the same time. The system consists of two liquid-crystal (LC) panels within which physical objects can be placed. The back LC panel serves as a dynamic mask while the front panel serves as the data. We first describe the principle of MUSTARD and then examine various functions that can be used to minimize crosstalk between multiple viewer positions. We compare different conflict management strategies using PSNR and the quality mean opinion score of HDR-VDP2. Finally, through a user-study we show that users can clearly identify images and objects even when the images are shown with strong conflicting regions; demonstrating that our system works even in the most extreme of circumstances.",
  "authors": [
    {
      "name": "Abhijit Karnik",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81484644010/rel-imgonly/abe4-sq.jpg",
      "acmid": "81484644010",
      "orcid": "missing"
    },
    {
      "name": "Walterio Mayol-Cuevas",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414621228",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Bridson, R. Fast Poisson disk sampling in arbitrary dimensions. In SIGGRAPH 2007 Sketches.  ",
      "doi": "10.1145/1278780.1278807"
    },
    {
      "text": "Chandrasekaran, R. and Tamir, A. Open questions concerning Weiszfeld's algorithm for the Fermat-Weber location problem. Mathematical Programming (1989).",
      "doi": ""
    },
    {
      "text": "Ferscha, A. and Keller, M. DigiScope: An Invisible Worlds Window. In Ubicomp 2003 (2003), 261--264.",
      "doi": ""
    },
    {
      "text": "Hirakawa, M., Kojima, Y. and Yoshitaka, A. Transparent interface: a seamless media space integrating the real and virtual worlds. In Proc. Human Centric Computing Languages and Environments (2003). 120--122. ",
      "doi": "10.5555/1153917.1153978"
    },
    {
      "text": "Hirsch, M., Lanman, D., Holtzman, H. and Raskar, R. BiDi screen: a thin, depth-sensing LCD for 3D interaction using light fields. In SIGGRAPH Asia 2009.  ",
      "doi": "10.1145/1661412.1618505"
    },
    {
      "text": "Huynh-Thu, Q. and Ghanbari, M. Scope of validity of PSNR in image/video quality assessment. Electronics Letters 44 (2008), 800--801.",
      "doi": ""
    },
    {
      "text": "Kitamura, Y., Konishi, T., Yamamoto, S. and Kishino, F. Interactive stereoscopic display for three or more users. In SIGGRAPH 2001, ACM (2001), 231--240.  ",
      "doi": "10.1145/383259.383285"
    },
    {
      "text": "Kooima, R., Prudhomme, A., Schulze, J., Sandin, D. and DeFanti, T. A multi-viewer tiled autostereoscopic virtual reality display. In Proc. VRST 2010, (2010).  ",
      "doi": "10.1145/1889863.1889899"
    },
    {
      "text": "Mantiuk, R., Kim, K. J., Rempel, A. G. and Heidrich, W. HDR-VDP-2: a calibrated visual metric for visibility and quality predictions in all luminance conditions. In SIGGRAPH 2011, ACM (2011), 1--14.  ",
      "doi": "10.1145/1964921.1964935"
    },
    {
      "text": "Matsushita, M., Iida, M., Ohguro, T., Shirai, Y., Kakehi, Y. and Naemura, T. Lumisight table: a face-to-face collaboration support system that optimizes direction of projected information to each stakeholder. In CSCW '04.  ",
      "doi": "10.1145/1031607.1031653"
    },
    {
      "text": "Matusik, W. and Pfister, H. 3D TV: a scalable system for real-time acquisition, transmission, and autostereoscopic display of dynamic scenes. In SIGGRAPH 2004, (2004).  ",
      "doi": "10.1145/1186562.1015805"
    },
    {
      "text": "Morishima, H., Nose, H., Taniguchi, N., Inoguchi, K. and Matsumura, S. Rear-cross-lenticular 3D display without eyeglasses. In Stereoscopic Displays and Virtual Reality Systems V, (1998).",
      "doi": ""
    },
    {
      "text": "Nashel, A. and Fuchs, H. Random Hole Display: A nonuniform barrier autostereoscopic display. In 3DTV Conference: The True Vision - Capture, Transmission and Display of 3D Video, (2009), 1--4.",
      "doi": ""
    },
    {
      "text": "Olwal, A., Lindfors, C., Gustafsson, J., Kjellberg, T. and Mattsson, L. ASTOR: An Autostereoscopic Optical Seethrough Augmented Reality System. In ISMAR '05.  ",
      "doi": "10.1109/ISMAR.2005.15"
    },
    {
      "text": "Perlin, K., Paxia, S. and Kollin, J. S. An autostereoscopic display. In SIGGRAPH '00, (2000).  ",
      "doi": "10.1145/344779.344933"
    },
    {
      "text": "Perry, M., Beckett, S., O'Hara, K. and Subramanian, S. WaveWindow: public, performative gestural interaction. In ITS '10, ACM (2010), 109--112.  ",
      "doi": "10.1145/1936652.1936672"
    },
    {
      "text": "Peterka, T., Kooima, R. L., Sandin, D. J., Johnson, A., Leigh, J. and DeFanti, T. A. Advances in the Dynallax Solid-State Dynamic Parallax Barrier Autostereoscopic Visualization Display System. IEEE Transactions on Visualization and Computer Graphics 14, (2008).  ",
      "doi": "10.1109/TVCG.2007.70627"
    },
    {
      "text": "Sakurai, S., Kitamura, Y., Subramanian, S. and Kishino, F. A visibility control system for collaborative digital table. Personal Ubiquitous Comput. 13, (2009).  ",
      "doi": "10.1007/s00779-009-0243-6"
    },
    {
      "text": "Sandin, D. J., Margolis, T., Ge, J., Girado, J., Peterka, T. and DeFanti, T. A. The Varrier autostereoscopic virtual reality display. ACM Trans. Graph. 24, (2005), 894--903.  ",
      "doi": "10.1145/1073204.1073279"
    },
    {
      "text": "Wilson, A. D. TouchLight: an imaging touch screen and display for gesture-based interaction. In ICMI, (2004).  ",
      "doi": "10.1145/1027933.1027946"
    },
    {
      "text": "Ye, G., State, A. and Fuchs, H. A practical multi-viewer tabletop autostereoscopic display. In ISMAR '10 (2010).",
      "doi": ""
    }
  ]
}