{
  "doi": "10.1145/2207676.2208409",
  "title": "Finding and assessing social media information sources in the context of journalism",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2451-2460",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Social media is already a fixture for reporting for many journalists, especially around breaking news events where non-professionals may already be on the scene to share an eyewitness report, photo, or video of the event. At the same time, the huge amount of content posted in conjunction with such events serves as a challenge to finding interesting and trustworthy sources in the din of the stream. In this paper we develop and investigate new methods for filtering and assessing the verity of sources found through social media by journalists. We take a human centered design approach to developing a system, SRSR (\"Seriously Rapid Source Review\"), informed by journalistic practices and knowledge of information production in events. We then used the system, together with a realistic reporting scenario, to evaluate the filtering and visual cue features that we developed. Our evaluation offers insights into social media information sourcing practices and challenges, and highlights the role technology can play in the solution.",
  "tags": [
    "news events",
    "computational journalism",
    "social media"
  ],
  "authors": [
    {
      "name": "Nicholas Diakopoulos",
      "institution": "Rutgers University, New Brunsick, New Jersey, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309489274",
      "orcid": "0000-0001-5005-6123"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "Rutgers University & Microsoft Research, New Brunsick, New Jersey, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    },
    {
      "name": "Mor Naaman",
      "institution": "Rutgers University, New Brunswick, New Jersey, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    }
  ],
  "references": [
    {
      "text": "Berkowitz, D. and Beach, D., W. News Sources and News Context: The Effect of Routine News, Conflict, and Proximity. Journalism Quarterly, 70. 4--12.",
      "doi": ""
    },
    {
      "text": "Boczkowski, P. J. News at Work: Imitation in an Age of Information Abundance. University of Chicago Press, 2010.",
      "doi": ""
    },
    {
      "text": "Carlson, M. Dueling, Dancing, or Dominating? Journalists and Their Sources. Communication & Media, 3 (4).",
      "doi": ""
    },
    {
      "text": "Carroll, J. M. Making Use: Scenario-Based Design of Human-Computer Interactions. The MIT Press, 2003. ",
      "doi": "10.5555/517699"
    },
    {
      "text": "Castillo, C., Mendoza, M. and Poblete, B., Information Credibility on Twitter. Proc. WWW, (2011).  ",
      "doi": "10.1145/1963405.1963500"
    },
    {
      "text": "Cheng, Z., Caverlee, J. and Lee, K., You are where you tweet: a content-based approach to geo-locating twitter users. Proc. CIKM, (2010).  ",
      "doi": "10.1145/1871437.1871535"
    },
    {
      "text": "De Choudhury, M., Diakopoulos, N. and Naaman, M., Unfolding the Event Landscape on Twitter: Classification and Exploration of User Categories. Proc. CSCW, (2012).  ",
      "doi": "10.1145/2145204.2145242"
    },
    {
      "text": "Diakopoulos, N., Naaman, M. and Kivran-Swaine, F., Diamonds in the Rough: Social Media Visual Analytics for Journalistic Inquiry. Proc. VAST, (2010).",
      "doi": ""
    },
    {
      "text": "Diakopoulos, N. and Shamma, D. A., Characterizing Debate Performance via Aggregated Twitter Sentiment. Proc. CHI, (2010).  ",
      "doi": "10.1145/1753326.1753504"
    },
    {
      "text": "Hansen, K. Source Diversity and Newspaper Enterprise Journalism. Journalism Quarterly, 68. 474--482.",
      "doi": ""
    },
    {
      "text": "Hecht, B., Hong, L., Suh, B. and Chi, E. H., Tweets from Justin Bieber's Heart: The dynamics of the \"location\" field in User Profiles. Proc. CHI, (2011).  ",
      "doi": "10.1145/1978942.1978976"
    },
    {
      "text": "Hermida, A. Twittering the News: The emergence of ambient journalism. Journalism Practice, 4 (3). 297--308.",
      "doi": ""
    },
    {
      "text": "Kovach, B. and Rosenstiel, T. Blur: How to know what's true in the age of information overload. Bloomsbury, 2010.",
      "doi": ""
    },
    {
      "text": "Lasorsa, D., Lewis, S. and Holton, A. 'Normalizing' Twitter: Journalism practice in an emerging communication space. Journalism Studies.",
      "doi": ""
    },
    {
      "text": "Marcus, A., Bernstein, M., Badar, O., Karger, D., Madden, S. and Miller, R., TwitInfo: Aggregating and Visualizing Microblogs for Event Exploration. Proc. CHI, (2011).  ",
      "doi": "10.1145/1978942.1978975"
    },
    {
      "text": "Murthy, D. Twitter: Microphone for the masses? Media, Culture & Society, 33 (5). 779--789.",
      "doi": ""
    },
    {
      "text": "Oh, O., Agrawal, M. and Rao, H. R. Information control and terrorism: Tracking the Mumbai terrorist attack through Twitter. Information Systems Frontiers, 13 (1).  ",
      "doi": "10.1007/s10796-010-9275-8"
    },
    {
      "text": "Pal, A. and Counts, S., Identifying Topical Authorities in Microblogs. Proc. WSDM, (2011).  ",
      "doi": "10.1145/1935826.1935843"
    },
    {
      "text": "Peters, J. D. Witnessing. Media, Culture & Society, 23 (6). 707--723.",
      "doi": ""
    },
    {
      "text": "Qazvinian, V., Rosengren, E., Radev, D. and Mei, Q., Rumor has it: Identifying Misinformation in Microblogs. Proc. EMNLP, (2011). ",
      "doi": "10.5555/2145432.2145602"
    },
    {
      "text": "Ringel Morris, M., Counts, S., Roseway, A., Hoff, A. and Schwarz, J., Tweeting is Believing? Understanding Microblog Credibility Perceptions. Proc. CSCW, (2012).  ",
      "doi": "10.1145/2145204.2145274"
    },
    {
      "text": "Schudson, M. The Sociology of News. W. W. Norton & Company, 2003.",
      "doi": ""
    },
    {
      "text": "Starbird, K., Palen, L., Hughes, A. and Vieweg, S., Chatter on The Red: What Hazards Threat Reveals about the Social Life of Microblogged Information. Proc. CSCW, (2010).  ",
      "doi": "10.1145/1718918.1718965"
    },
    {
      "text": "Väätäjä, H., Vainio, T., Sirkkunen, E. and Salo, K., Crowdsourced news reporting: supporting news content creation with mobile phones. MobileHCI, (2011).",
      "doi": ""
    },
    {
      "text": "Vieweg, S., Hughes, A. L., Starbird, K. and Palen, L., Microblogging During Two Natural Hazards Events: What Twitter May Contribute to Situational Awareness. Proc. CHI, (2010).  ",
      "doi": "10.1145/1753326.1753486"
    },
    {
      "text": "Weng, J., Lim, E.-P., Jiang, J. and He, Q., Twitterrank: finding topic-sensitive influential twitterers. Proc. WSDM, (2010).  ",
      "doi": "10.1145/1718487.1718520"
    },
    {
      "text": "Wilson, P. Second-Hand Knowledge: An Inquiry into Cognitive Authority. Greenwood, 1983.",
      "doi": ""
    },
    {
      "text": "Wu, S., Hofman, J. M., Mason, W. A. and Watts, D. J., Who Says What to Whom on Twitter. Proc. WWW, (2011).  ",
      "doi": "10.1145/1963405.1963504"
    },
    {
      "text": "Yardi, S. and boyd, d., Tweeting from the town square: Measuring geographic local networks. Proc. ICWSM, (2010).",
      "doi": ""
    },
    {
      "text": "Zelizer, B. On \"Having Been There\": \"Eyewitnessing\" as a Journalistic Key Word. Critical Studies in Media Communication, 24 (5). 408--428.",
      "doi": ""
    }
  ]
}