{
  "doi": "10.1145/2207676.2208338",
  "title": "Taming wild behavior: the input observer for obtaining text entry and mouse pointing measures from everyday computer use",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1947-1956",
  "year": 2012,
  "badges": [],
  "abstract": "We present the Input Observer, a tool that can run quietly in the background of users' computers and measure their text entry and mouse pointing performance from everyday use. In lab studies, participants are presented with prescribed tasks, enabling easy identification of speeds and errors. In everyday use, no such prescriptions exist. We devised novel algorithms to segment text entry and mouse pointing input streams into \"trials\". We are the first to measure errors for unprescribed text entry and mouse pointing. To measure errors, we utilize web search engines, adaptive offline dictionaries, an Automation API, and crowdsourcing. Capturing errors allows us to employ Crossman's (1957) speed-accuracy normalization when calculating Fitts' law throughputs. To validate the Input Observer, we compared its measures from 12 participants over a week of computer use to the same participants' results from a lab study. Overall, in the lab and field, average text entry speeds were 74.47 WPM and 80.59 WPM, respectively. Average uncorrected error rates were near zero, at 0.12% and 0.28%. For mouse pointing, average movement times were 971 ms and 870 ms. Average pointing error rates were 4.42% and 4.66%. Average throughputs were 3.48 bits/s and 3.45 bits/s. Device makers, researchers, and assistive technology specialists may benefit from measures of everyday use.",
  "authors": [
    {
      "name": "Abigail Evans",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658986852",
      "orcid": "missing"
    },
    {
      "name": "Jacob Wobbrock",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Anderson, T. W. and Darling, D. A. (1954). A test of goodness of fit. J. American Statistical Association 49 (268), 765--769.",
      "doi": ""
    },
    {
      "text": "Arthur, D. and Vassilvitskii, S. (2007). k-means++: The advantages of careful seeding. Proc. SODA '07. Philadelphia: Society for Industrial and Applied Mathematics, 1027--1035. ",
      "doi": "10.5555/1283383.1283494"
    },
    {
      "text": "Balota, D. A., Yap, M. J., Cortese, M. J., Hutchison, K. A., Kessler, B., Loftis, B., Neely, J. H., Nelson, D. L., Simpson, G. B. and Treiman, R. (2007). The English Lexicon Project. Behavior Research Methods 39 (3), 445--459.",
      "doi": ""
    },
    {
      "text": "Bradski, G. R. and Pisarevsky, V. (2000). Intel's Computer Vision Library: Applications in calibration, stereo, segmentation, tracking, gesture, face and object recognition. Proc. CVPR '00. Washington, D.C.: IEEE Computer Society, 796--797.",
      "doi": ""
    },
    {
      "text": "Brown, B., Reeves, S. and Sherwood, S. (2011). Into the wild: Challenges and opportunities for field trial methods. Proc. CHI '11. New York: ACM Press, 1657--1666.  ",
      "doi": "10.1145/1978942.1979185"
    },
    {
      "text": "Carter, S., Mankoff, J., Klemmer, S. R. and Matthews, T. (2008). Exiting the cleanroom: On ecological validity and ubiquitous computing. Human-Computer Interaction 23 (1), 47--99.",
      "doi": ""
    },
    {
      "text": "Chapuis, O., Blanch, R. and Beaudouin-Lafon, M. (2007). Fitts' law in the wild: A field study of aimed movements. LRI Technical Report Number 1480. Laboratorie de Recherche en Informatique. Orsay, France: Universite de Paris Sud.",
      "doi": ""
    },
    {
      "text": "Choudhury, T., Borriello, G., Consolvo, S., Haehnel, D., Harrison, B., Hemingway, B., Hightower, J., Klasnja, P., Koscher, K., LaMarca, A., Landay, J. A., LeGrand, L., Lester, J., Rahimi, A., Rea, A. and Wyatt, D. (2008). The Mobile Sensing Platform: An embedded activity recognition system. IEEE Pervasive Computing 7 (2), 32--41.  ",
      "doi": "10.1109/MPRV.2008.39"
    },
    {
      "text": "Crossman, E. R. F. W. (1957). The speed and accuracy of simple hand movements. In The Nature and Acquisition of Industrial Skills, Crossman and Seymour (eds.). University of Birmingham: Final Report to the M.R.C./D.S.I.R. Joint Committee on Individual Efficiency in Industry.",
      "doi": ""
    },
    {
      "text": "D'Agostino, R. B. (1986). Tests for the normal distribution. In Goodness-of-Fit Techniques, D'Agostino and Stephens (eds.). New York: Marcel Dekker, 367--420.",
      "doi": ""
    },
    {
      "text": "Dixon, M. and Fogarty, J. A. (2010). Prefab: Implementing advanced behaviors using pixel-based reverse engineering of interface structure. Proc. CHI '10. New York: ACM Press, 1525--1534.  ",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Dumont, C., Vincent, C. and Mazer, B. (2002). Development of a standardized instrument to assess computer task performance. American J. Occupational Therapy 56 (1), 60--68.",
      "doi": ""
    },
    {
      "text": "Evans, A. and Wobbrock, J. O. (2011). Input Observer: Measuring text entry and pointing performance from naturalistic everyday computer use. Extended Abstracts CHI '11. New York: ACM Press, 1879--1884.  ",
      "doi": "10.1145/1979742.1979871"
    },
    {
      "text": "Fisher, R., Perkins, S., Walker, A. and Wolfart, E. (2003). Gaussian smoothing. Hypermedia Image Processing Reference. Available at http://homepages.inf.ed.ac.uk/rbf/HIPR2/gsmooth.htm",
      "doi": ""
    },
    {
      "text": "Fitts, P. M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. J. Experimental Psychology 47 (6), 381--391.",
      "doi": ""
    },
    {
      "text": "Fitts, P. M. and Radford, B. K. (1966). Information capacity of discrete motor responses under different cognitive sets. J. Experimental Psychology 71 (4), 475482.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Chen, M. Y., Consolvo, S., Harrison, B. and Landay, J. A. (2007). MyExperience: A system for in situ tracing and capturing of user feedback on mobile phones. Proc. MobiSYS '07. New York: ACM Press, 57--70.  ",
      "doi": "10.1145/1247660.1247670"
    },
    {
      "text": "Gajos, K. Z., Weld, D. S. and Wobbrock, J. O. (2010). Automatically generating personalized user interfaces with SUPPLE. Artificial Intelligence 174 (12-13), 910--950.  ",
      "doi": "10.1016/j.artint.2010.05.005"
    },
    {
      "text": "Hamerly, G. and Elkan, C. (2004). Learning the k in kmeans. In Advances in Neural Information Processing Systems 16, Thrun, Saul and Schölkopf (eds.). Cambridge, MA: The M.I.T. Press, 281--288.",
      "doi": ""
    },
    {
      "text": "Hourcade, J. P. (2006). Learning from preschool children's pointing sub-movements. Proc. IDC '06. New York: ACM Press, 65--72.  ",
      "doi": "10.1145/1139073.1139093"
    },
    {
      "text": "Hurst, A., Hudson, S. E. and Mankoff, J. (2007). Dynamic detection of novice vs. skilled use without a task model. Proc. CHI '07. New York: ACM Press, 271--280.  ",
      "doi": "10.1145/1240624.1240669"
    },
    {
      "text": "Hurst, A., Mankoff, J. and Hudson, S. E. (2008). Understanding pointing problems in real world computing environments. Proc. ASSETS '08. New York: ACM Press, 43--50.  ",
      "doi": "10.1145/1414471.1414481"
    },
    {
      "text": "Hurst, A., Hudson, S. E. and Mankoff, J. (2010). Automatically identifying targets users interact with during real world tasks. Proc. IUI '10. New York: ACM Press, 11--20.  ",
      "doi": "10.1145/1719970.1719973"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P. and Clarkson, P. J. (2004). Mouse movements of motion-impaired users: A submovement analysis. Proc. ASSETS '04. New York: ACM Press, 102--109.  ",
      "doi": "10.1145/1028630.1028649"
    },
    {
      "text": "Jansen, A., Findlater, L. and Wobbrock, J. O. (2011). From the lab to the world: Lessons from extending a pointing technique for real-world use. Extended Abstracts CHI '11. New York: ACM Press, 1867--1872.  ",
      "doi": "10.1145/1979742.1979888"
    },
    {
      "text": "Lloyd, S. P. (1982). Least squares quantization in PCM. IEEE Trans. Information Theory 28 (2), 129--137.  ",
      "doi": "10.1109/TIT.1982.1056489"
    },
    {
      "text": "MacKenzie, I. S. (1992). Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7 (1), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I. S., Kauppinen, T. and Silfverberg, M. (2001). Accuracy measures for evaluating computer pointing devices. Proc. CHI '01. New York: ACM Press, 9--16.  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. (2002). Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction 17 (2), 147--198.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. (2003). Phrase sets for evaluating text entry techniques. Extended Abstracts CHI '03. New York: ACM Press, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. (2003). Card, English, and Burr (1978) - 25 years later. Extended Abstracts CHI '03. New York: ACM Press, 760--761.  ",
      "doi": "10.1145/765891.765974"
    },
    {
      "text": "MacKenzie, I. S. and Isokoski, P. (2008). Fitts' throughput and the speed-accuracy tradeoff. Proc. CHI '08. New York: ACM Press, 1633--1636.  ",
      "doi": "10.1145/1357054.1357308"
    },
    {
      "text": "Meyer, D. E., Abrams, R. A., Kornblum, S., Wright, C. E. and Smith, J. E. K. (1988). Optimality in human motor performance: Ideal control of rapid aimed movements. Psychological Review 95 (3), 340--370.",
      "doi": ""
    },
    {
      "text": "Mithal, A. K. and Douglas, S. A. (1996). Differences in movement microstructure of the mouse and the finger-controlled isometric joystick. Proc. CHI '96. New York: ACM Press, 300--307.  ",
      "doi": "10.1145/238386.238533"
    },
    {
      "text": "Murata, A. (1996). Empirical evaluation of performance models of pointing accuracy and speed with a PC mouse. Int'l J. Human-Computer Interaction 8 (4), 457--469.  ",
      "doi": "10.1080/10447319609526164"
    },
    {
      "text": "Palen, L. and Salzman, M. (2002). Voice-mail diary studies for naturalistic data capture under mobile conditions. Proc. CSCW '02. New York: ACM Press, 87--95.  ",
      "doi": "10.1145/587078.587092"
    },
    {
      "text": "Rogers, Y. (2011). Interaction design gone wild: Striving for wild theory. interactions 18 (4), 58--62.  ",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "Rosenbaum, D. A. (1991). Aiming. In Human Motor Control. San Diego, CA: Academic Press, 205--216.",
      "doi": ""
    },
    {
      "text": "Sears, A., Lin, M., Jacko, J. and Xiao, Y. (2003). When computers fade... Pervasive computing and situationally-induced impairments and disabilities. Proc. HCI Int'l '03. Mahwah, NJ: Lawrence Erlbaum, 1298--1302.",
      "doi": ""
    },
    {
      "text": "Smith, R. (2007). An overview of the Tesseract OCR engine. Proc. ICDAR '07. Washington, D.C.: IEEE Computer Society, 629--633. ",
      "doi": "10.5555/1304596.1304846"
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. (2001). Measuring errors in text entry tasks: An application of the Levenshtein string distance statistic. Extended Abstracts CHI '01. New York: ACM Press, 319--320.  ",
      "doi": "10.1145/634067.634256"
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. (2003). Metrics for text entry research: An evaluation of MSD and KSPC, and a new unified error metric. Proc. CHI '03. New York: ACM Press, 113--120.  ",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. (2004). Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. Int'l J. HumanComputer Studies 61 (6), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Stephens, M. A. (1972). EDF statistics for goodness of fit and some comparisons. J. American Statistical Association 69 (347), 730--737.",
      "doi": ""
    },
    {
      "text": "Walker, N., Philbin, D. A. and Fisk, A. D. (1997). Agerelated differences in movement control: Adjusting submovement structure to optimize performance. J. Gerontology: Psychological Sciences 52B (1), 40--52.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O. and Myers, B. A. (2006). Analyzing the input stream for character-level errors in unconstrained text entry evaluations. ACM Trans. Computer-Human Interaction 13 (4), 458--489.  ",
      "doi": "10.1145/1188816.1188819"
    },
    {
      "text": "Wobbrock, J. O. (2007). Measures of text entry performance. In Text Entry Systems, MacKenzie and Tanaka-Ishii (eds.). San Francisco: Morgan Kaufmann, 47--74.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Kane, S. K., Gajos, K. Z., Harada, S. and Froehlich, J. (2011). Ability-based design: Concept, principles, and examples. ACM Trans. Accessible Computing 3 (3), 9:1--27.  ",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Wobbrock, J. O., Shinohara, K. and Jansen, A. (2011). The effects of task dimensionality, endpoint deviation, throughput calculation, and experiment design on pointing measures and models. Proc. CHI '11. New York: ACM Press, 1639--1648.  ",
      "doi": "10.1145/1978942.1979181"
    },
    {
      "text": "Zhai, S. (2004). Characterizing computer input with Fitts' law parameters - the information and non-information aspects of pointing. Int'l J. Human-Computer Studies 61 (6), 791--809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    },
    {
      "text": "Zhai, S., Kong, J. and Ren, X. (2004). Speed-accuracy tradeoff in Fitts' law tasks - on the equivalency of actual and nominal pointing precision. Int'l J. Human-Computer Studies 61 (6), 823--856.  ",
      "doi": "10.1016/j.ijhcs.2004.09.007"
    }
  ]
}