{
  "doi": "10.1145/2207676.2208518",
  "title": "Natural use profiles for the pen: an empirical exploration of pressure, tilt, and azimuth",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "801-804",
  "year": 2012,
  "badges": [],
  "abstract": "Inherent pen input modalities such as tip pressure, tilt and azimuth (PTA) have been extensively used as additional input channels in pen-based interactions. We conducted a study to investigate the natural use profiles of PTA, which describes the features of PTA in the course of normal pen use such as writing and drawing. First, the study reveals the ranges of PTA in normal pen use, which can distinguish pen events accidently occurring in normal drawing and writing from those used for mode switch. The natural use profiles also show that azimuth is least likely to cause false pen mode switching while tip pressure is most likely to cause false pen mode switching. Second, the study reveals correlations among various modalities, indicating that pressure plus azimuth is superior to other pairs for dual-modality control.",
  "authors": [
    {
      "name": "Yizhong Xin",
      "institution": "Kochi University of Technology & Shenyang University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387602671",
      "orcid": "missing"
    },
    {
      "name": "Xiaojun Bi",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485662",
      "orcid": "0000-0002-9716-7709"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R. and MacKenzie, S. (1997). Performance differences in the fingers, wrist, and forearm in computer input control. ACM CHI, 303--310.  ",
      "doi": "10.1145/258549.258764"
    },
    {
      "text": "Bi, X., Moscovich, T., Ramos, G., Balakrishnan, R. and Hinckley, K. (2008). An exploration of pen rolling for pen-based interaction. ACM UIST, 191--200.  ",
      "doi": ""
    },
    {
      "text": "Hammerton, M. and Tickner, A. H. (1966). An investigation into the comparative suitability of forearm, hand and thumb controls in acquisition tasks. Ergonomics, 9(2), 125--130.",
      "doi": ""
    },
    {
      "text": "Napier, J. R. (1956). The prehensile movements of the human hand. Bone and Joint Surgery. 38B(4), 902--913.",
      "doi": ""
    },
    {
      "text": "Oshita, M. (2004). Pen-to-mime: pen based interface for interactive control of a human figure. Eurographics Workshop on Sketch-Based Interfaces and Modeling, 43--52.  ",
      "doi": ""
    },
    {
      "text": "Ramos, G. and Balakrishnan. R. (2007). Pressure marks. ACM CHI, 1375--1384.  ",
      "doi": ""
    },
    {
      "text": "Ramos, G., Cockburn, A., Balakrishnan, R. and Beaudouin-Lafon, M. (2007). Pointing lenses: facilitating stylus input through visual-and motor-space magnification. ACM CHI, 757--766.  ",
      "doi": ""
    },
    {
      "text": "Ren, X., Yin, J., Zhao, S. and Li, Y. (2007). The adaptive hybrid cursor: A pressure-based target selection technique for pen-based user interfaces. INTERACT, 310--323. ",
      "doi": ""
    },
    {
      "text": "Stevens, S. S. (1986). Psychophysics: introduction to its perceptual, neural, and social prospects. Transaction Publishers.",
      "doi": ""
    },
    {
      "text": "Tian, F., Ao, X., Wang, H., Setlur, V. and Dai, G. (2007). The tilt cursor: enhancing stimulus-response compatibility by providing 3D orientation cue of pen. ACM CHI, 303--306.  ",
      "doi": ""
    },
    {
      "text": "Tian, F., Xu, L., Wang, H., Zhang, X., Liu, Y., Setlur, V. and Dai, G. (2008). Tilt menu: using the 3D orientation information of pen devices to extend the selection capability of pen-based user interfaces. ACM CHI, 1371--1380.  ",
      "doi": "10.1145/1357054.1357269"
    },
    {
      "text": "Xin, Y., Bi, X., and Ren, X. (2011). Acquiring and pointing: an empirical study of pen-tilt-based interaction. ACM CHI, 849--858.  ",
      "doi": ""
    },
    {
      "text": "Xin, Y. and Ren, X. (2010). An investigation of adaptive pen pressure discretization method based on personal pen pressure use profile, IEICE Transactions on Information and Systems, E93-D(5), 1205--1213.",
      "doi": ""
    },
    {
      "text": "Xin, Y. and Ren, X. (2009). A study of inherent pen input modalities for precision parameter, IEICE Transactions on Information and Systems, E92-D(12), 2454--2461.",
      "doi": ""
    }
  ]
}