{
  "doi": "10.1145/2207676.2208372",
  "title": "Brainput: enhancing interactive systems with streaming fnirs brain input",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2193-2202",
  "year": 2012,
  "badges": [],
  "abstract": "This paper describes the Brainput system, which learns to identify brain activity patterns occurring during multitasking. It provides a continuous, supplemental input stream to an interactive human-robot system, which uses this information to modify its behavior to better support multitasking. This paper demonstrates that we can use non-invasive methods to detect signals coming from the brain that users naturally and effortlessly generate while using a computer system. If used with care, this additional information can lead to systems that respond appropriately to changes in the user's state. Our experimental study shows that Brainput significantly improves several performance metrics, as well as the subjective NASA-Task Load Index scores in a dual-task human-robot activity.",
  "authors": [
    {
      "name": "Erin Solovey",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81324494052/rel-imgonly/erinsolovey.jpg",
      "acmid": "81324494052",
      "orcid": "missing"
    },
    {
      "name": "Paul Schermerhorn",
      "institution": "Indiana University, Bloomington, Indiana, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100573922",
      "orcid": "missing"
    },
    {
      "name": "Matthias Scheutz",
      "institution": "Tufts University, Medford, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100029514",
      "orcid": "missing"
    },
    {
      "name": "Angelo Sassaroli",
      "institution": "Tufts University, Medford, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607862",
      "orcid": "missing"
    },
    {
      "name": "Sergio Fantini",
      "institution": "Tufts University, Medford, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416600157",
      "orcid": "missing"
    },
    {
      "name": "Robert Jacob",
      "institution": "Tufts University, Medford, Massachusetts, United States",
      "img": "/do/10.1145/contrib-81100438120/rel-imgonly/portrait.jpg",
      "acmid": "81100438120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barbosa, A.O.G., Achanccaray, D.R. and Meggiolaro, M.A., Activation of a mobile robot through a brain computer interface. In Proc. IEEE ICRA, (2010), 48154821.",
      "doi": ""
    },
    {
      "text": "Blankertz, B., et al. The Berlin brain-computer interface: Machine-learning based detection of user specific brain states. In G. Dornhege, J. d. R. Millán, T. Hinterberger, D. J. McFarland & K. Müller (Eds.), Toward BrainComputer Interfacing: MIT Press (2007).",
      "doi": ""
    },
    {
      "text": "Coyle, S.M., Ward, T.E. and Markham, C.M. Braincomputer interface using a simplified functional nearinfrared spectroscopy system. J. of Neural Engineering,(3). 219.",
      "doi": ""
    },
    {
      "text": "Escolano, C., et al. A telepresence robotic system operated with a P300-based brain-computer interface: Initial tests with ALS patients. In Proc. IEEE EMBC, (2010), 4476--4480.",
      "doi": ""
    },
    {
      "text": "Fairclough, S.H. Fundamentals of physiological computing. Interact. Comput., 21 (1--2). 133--145.  ",
      "doi": "10.1016/j.intcom.2008.10.011"
    },
    {
      "text": "Girouard, A., Solovey, E.T. and Jacob, J.K. Designing a Passive Brain Computer Interface using Real Time Classification of Functional Near-Infrared Spectroscopy. Intl J of Autonomous and Adaptive Communications Systems (2010).  ",
      "doi": "10.1504/IJAACS.2013.050689"
    },
    {
      "text": "Grimes, D., Tan, D.S., Hudson, S.E., Shenoy, P. and Rao, R.P.N. Feasibility and pragmatics of classifying working memory load with an electroencephalograph. In Proc. CHI'08, ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357187"
    },
    {
      "text": "Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P. and Witten, I.H. The WEKA data mining software: an update. SIGKDD Explor. Newsl., 11 (1). 10--18.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Hart, S.G. and Staveland, L.E. Development of NASATLX (Task Load Index): Results of empirical and theorical research. in Hancock, P., Meshkati, N. ed. Human Mental Workload, 1988, pp 139 - 183.",
      "doi": ""
    },
    {
      "text": "Hirshfield, L.M., Solovey, E.T., Girouard, A., Kebinger, J., Sassaroli, A., Tong, Y., Fantini, S. and Jacob, R.J.K. Brain Measurement for Usability Testing and Adaptive Interfaces: An Example of Uncovering Syntactic Workload with Functional Near Infrared Spectroscopy. In Proc. CHI'09, ACM Press (2009).  ",
      "doi": "10.1145/1518701.1519035"
    },
    {
      "text": "Hirshfield, L.M., et al. This is your brain on interfaces: enhancing usability testing with functional near-infrared spectroscopy. In Proc. CHI'11, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1978996"
    },
    {
      "text": "Jackson, M.M. and Mappus, R. Applications for BrainComputer Interfaces. in Tan, D. and Nijholt, A. eds. Brain Computer Interfaces: Applying our Minds to Human-Computer Interaction, Springer (2010), 89--104.",
      "doi": ""
    },
    {
      "text": "Kennedy, P.R., Bakay, R.A.E., Moore, M.M., Adams, K. and Goldwaithe, J. Direct control of a computer from the human central nervous system. IEEE Trans. on Rehabilitation Engineering, 8 (2). 198.",
      "doi": ""
    },
    {
      "text": "Koechlin, E., Basso, G., Pietrini, P., Panzer, S. & Grafman, J. The role of the anterior prefrontal cortex in human cognition. Nature (1999), 148--151.",
      "doi": ""
    },
    {
      "text": "Kuikkaniemi, K., et al. The influence of implicit and explicit biofeedback in first-person shooter games. In Proc CHI'10. ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753453"
    },
    {
      "text": "Lee, J.C. and Tan, D.S. Using a low-cost electroencephalograph for task classification in HCI research. In Proc. UIST, ACM Press (2006).  ",
      "doi": "10.1145/1166253.1166268"
    },
    {
      "text": "Mandryk, R., Atkins, M. and Inkpen, K. A continuous and objective evaluation of emotional experience with interactive play environments. In Proc. CHI, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124926"
    },
    {
      "text": "Nacke, L.E., Kalyn, M., Lough, C. and Mandryk, R.L. Biofeedback game design: using direct and indirect physiological control to enhance game interaction. In Proc. CH1, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "O'Hara, K., Sellen, A. and Harper, R. Embodiment in brain-computer interaction. In Proc. CHI, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1978994"
    },
    {
      "text": "Okumura, M. and Zhiwei, L., On NIRS-based brainrobot interface. In Proc. IEEE ROBIO (2007), 864--869.",
      "doi": ""
    },
    {
      "text": "Pan, M.K.X.J., Chang, J.-S., Himmetoglu, G.H., Moon, A., Hazelton, T.W., MacLean, K.E. and Croft, E.A. Now where was I?: physiologically-triggered bookmarking. In Proc. CHI, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1978995"
    },
    {
      "text": "Perrin, X., Chavarriaga, R., Colas, F., Siegwart, R. and Millán, J.d.R. Brain-coupled interaction for semiautonomous navigation of an assistive robot. Robot. Auton. Syst., 58 (12). 1246--1255.  ",
      "doi": "10.1016/j.robot.2010.05.010"
    },
    {
      "text": "Pfurtscheller, G., Flotzinger, D. and Kalcher, J. Braincomputer interface: a new communication device for handicapped persons. J. Microcomput. Appl., 16 (3). 293--299.  ",
      "doi": "10.1006/jmca.1993.1030"
    },
    {
      "text": "Pope, A. T., et al. Biocybernetic system evaluates indices of operator engagement in automated task. Biological Psychology, 40, (1995), 187--195.",
      "doi": ""
    },
    {
      "text": "Schalk, G., McFarland, D.J., Hinterberger, T., Birbaumer, N. and Wolpaw, J.R. BCI2000: a generalpurpose brain-computer interface (BCI) system. IEEE Trans. on Biomedical Engineering, 51 (6). 1034.",
      "doi": ""
    },
    {
      "text": "Schermerhorn, P. and Scheutz, M. Disentangling the Effects of Robot Affect, Embodiment, and Autonomy on Human Team Members in a Mixed-Initiative Task. In Proc. ACHI (2011), 236--241.",
      "doi": ""
    },
    {
      "text": "Scheutz, M., Schermerhorn, P. and Kramer, J. The utility of affect expression in natural language interactions in joint human-robot tasks. In Proc. HRI (2006).  ",
      "doi": "10.1145/1121241.1121281"
    },
    {
      "text": "Solovey, E.T., et al. Using fNIRS Brain Sensing in Realistic HCI Settings: Experiments and Guidelines. In Proc. UIST (2009).  ",
      "doi": "10.1145/1622176.1622207"
    },
    {
      "text": "Solovey, E.T., et al., Sensing Cognitive Multitasking for a Brain-Based Adaptive User Interface. In Proc. CHI, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1978997"
    },
    {
      "text": "Solovey, E. T. Real-time fNIRS Brain Input for Enhancing Interactive Systems. Doctoral Dissertation, Tufts University (2012).",
      "doi": ""
    },
    {
      "text": "Tsubone, T., Tsutsui, K., Muroga, T. and Wada, Y. Estimation of Force Motor Command to Control Robot by NIRS-Based BCI. in Masumi, I., Kenji, D., Hiroyuki, M. and Takeshi, Y. eds. Neural Information Processing, Springer-Verlag (2008), 969--978.  ",
      "doi": "10.1007/978-3-540-69162-4_101"
    },
    {
      "text": "Wolpaw, J.R., McFarland, D.J., Neat, G.W. and Forneris, C.A. An EEG-based brain-computer interface for cursor control. Electroencephalography and Clinical Neurophysiology, 78 (3). 252.",
      "doi": ""
    },
    {
      "text": "Yuksel, B.F., Donnerer, M., Tompkin, J. and Steed, A. A novel brain-computer interface using a multi-touch surface. In Proc. CHI, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753452"
    }
  ]
}