{
  "doi": "10.1145/2207676.2208532",
  "title": "Findings of e-ESAS: a mobile based symptom monitoring system for breast cancer patients in rural Bangladesh",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "899-908",
  "year": 2012,
  "badges": [],
  "abstract": "Breast cancer (BC) patients need traditional treatment as well as long term monitoring through an adaptive feedback-oriented treatment mechanism. Here, we present the findings of our 31-week long field study and deployment of e-ESAS - the first mobile-based remote symptom monitoring system (RSMS) developed for rural BC patients where patients are the prime users rather than just the source of data collection at some point of time. We have also shown how 'motivation' and 'automation' have been integrated in e-ESAS and creating a unique motivation-persuasion-motivation cycle where the motivated patients become proactive change agents by persuading others. Though in its early deployment stages (2 months), e-ESAS demonstrates the potential to positively impact the cancer care by (1) helping the doctors with graphical charts of long symptom history (automation), (2) facilitating timely interventions through alert generation (automation) and (3) improving three way communications (doctor-patient-attendant) for a better decision making process (motivation) and thereby improving the quality of life of BC patients.",
  "authors": [
    {
      "name": "Md Haque",
      "institution": "Marquette University, Milwaukee, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322495512",
      "orcid": "missing"
    },
    {
      "name": "Ferdaus Kawsar",
      "institution": "Marquette University, Milwaukee, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474684881",
      "orcid": "missing"
    },
    {
      "name": "Mohammad Adibuzzaman",
      "institution": "Marquette University, Milwaukee, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488667253",
      "orcid": "missing"
    },
    {
      "name": "Sheikh Ahamed",
      "institution": "Marquette University, Milwaukee, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100291196",
      "orcid": "missing"
    },
    {
      "name": "Richard Love",
      "institution": "International Breast Cancer Research Foundation, Madison, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502717967",
      "orcid": "missing"
    },
    {
      "name": "Rumana Dowla",
      "institution": "AGBC Center, Khulna, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502796364",
      "orcid": "missing"
    },
    {
      "name": "David Roe",
      "institution": "International Breast Cancer Research Foundation, Madison, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81536597356",
      "orcid": "missing"
    },
    {
      "name": "Syed Hossain",
      "institution": "AGBC Center, Khulna, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659657646",
      "orcid": "missing"
    },
    {
      "name": "Reza Selim",
      "institution": "AGBC Center, Khulna, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502808402",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bangladesh Bureau of Statistics. (2008).Ministry of Planning. Statistical Yearbook of Bangladesh, 2007.",
      "doi": ""
    },
    {
      "text": "http://www.whoban.org/LinkFiles/Publication_Cancer_ Strategy.pdf.pdf",
      "doi": ""
    },
    {
      "text": "http://www.btrc.gov.bd/newsandevents/mobile_phone_s ubscribers/mobile_phone_subscribers_june_2011.php",
      "doi": ""
    },
    {
      "text": "http://ecog.dfci.harvard.edu/general/perf_stat.html",
      "doi": ""
    },
    {
      "text": "http://english.peopledaily.com.cn/90001/90782/6521649 .html",
      "doi": ""
    },
    {
      "text": "http://www.empainline.org/linked_site_content/pdf/Edm onton%20Functionl%20Assess%20System.pdf",
      "doi": ""
    },
    {
      "text": "DeRenzi, B., Lesh, N., Parikh, T., Sims, C., Mitchell, M., Maokola, W., Chemba, M., Hamisi, Y., Schellenbe, D., Borriello,G. e-IMCI: Improving Pediatric Health Care in Low-Income Countries. In Proc. CHI '08, (2008).  ",
      "doi": "10.1145/1357054.1357174"
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing health workers in rural India. In Proc. CHI '10, 1889--1898, (2010).  ",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S. Parikh. 2010. Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. In Proc. CHI '10, 733--742, (2010).  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Shimira, K., Mukasa, O., Schellenberg, A. J., Manzi, F., John, D., Mushi, A., Mrisho, M., Tanner, M., Mshinda, H., Schellenberg, D. The use of personal digital assistants for data entry at the point of collection in a large household survey in southern Tanzania. Emerging Themes in Epidemiology (2007), 4:5.",
      "doi": ""
    },
    {
      "text": "Luk, R., Ho, M., and Aoki, M. P. Asynchronous remote medical consultation for Ghana. In Proc. CHI '08, 743--752, (2008).  ",
      "doi": "10.1145/1357054.1357173"
    },
    {
      "text": "Peters, D., Kohli, M., Mascarenhas, M. Can computers improve patient care by primary health care workers in India? International Journal for Quality Health Care. 2005 18 (6): 435--445.",
      "doi": ""
    },
    {
      "text": "Mitchell, M., Lesh, N., Crammer, H., Fraser, H., Haivas, I. Wolf, K. Improving Care - Improving Access: The Use of Electronic Decision Support with AIDS patients in South Africa. International Journal of Healthcare Technology and Management. In process.",
      "doi": ""
    },
    {
      "text": "http://www.bridges.org/case_studies/351",
      "doi": ""
    },
    {
      "text": "http://www.healthnet.org/hnuganda.php",
      "doi": ""
    },
    {
      "text": "Adams, W. G., Fuhlbrigge, A. L., Miller, C. W., et al. TLCAsthma: an integrated information system for patient-centered monitoring, case management, and point-of-care decision support. Proceedings of the AMIA Annual Symposium 2003 Nov 8--12; Washington DC.",
      "doi": ""
    },
    {
      "text": "Cherry, J. C., Moffatt, T. P., Rodriguez, C., Dryden, K. Diabetes disease management program for an indigent population empowered by telemedicine technology. Diabetes Technol & Ther 2002; 4(6):783--791.",
      "doi": ""
    },
    {
      "text": "Dubenske, L. L., Chih, M. Y., Dinauer, S., Gustafson, D. H., Cleary, J. F. Development and implementation of a clinician reporting system for advanced stage cancer: initial lessons learned. J Am Med Inform Assoc. 2008 Sep- Oct;15(5):679--86.",
      "doi": ""
    },
    {
      "text": "Gustafson, D. H., McTavish, F. M., Stengle, W., et al. Use and impact of eHealth system by low-income women with breast cancer J Health Commun 2005;10:195--218.",
      "doi": ""
    },
    {
      "text": "Bielli, E., Carminati, F., La Capra, S., Lina, M., Brunelli, C., Tamburini, M. A wireless health outcomes monitoring system (WHOMS): development and field testing with cancer patients using mobile phones BMC Med Inform Dec Making 2004;4(7)Jun 15.",
      "doi": ""
    },
    {
      "text": "DuBenske, L. L., Gustafson, D. H., Shaw, B. R., Cleary, J. F. Web-based cancer communication and decision making systems: connecting patients, caregivers, and clinicians for improved health outcomes. Med Decis Making. 2010 Nov-Dec; 30(6):732--44",
      "doi": ""
    },
    {
      "text": "Celler, B. G., Lovell, N. H., Basilakis, J. Using information technology to improve the management of chronic disease MJA 2003; 179:242--246.",
      "doi": ""
    }
  ]
}