{
  "doi": "10.1145/2207676.2208310",
  "title": "Best faces forward: a large-scale study of people search in the enterprise",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1775-1784",
  "year": 2012,
  "badges": [],
  "abstract": "This paper presents Faces, an application built to enable effective people search in the enterprise. We take advantage of the popularity Faces has gained within a globally distributed enterprise to provide an extensive analysis of how and why people search is used within the organization. Our study is primarily based on an analysis of the Faces query log over a period of more than four months, with over a million queries and tens of thousands of users. The analysis results are presented across four dimensions: queries, users, clicks, and actions, and lay the foundation for further advancement and research on the topic.",
  "authors": [
    {
      "name": "Ido Guy",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/do/10.1145/contrib-81321492044/rel-imgonly/ig2014.png",
      "acmid": "81321492044",
      "orcid": "missing"
    },
    {
      "name": "Sigalit Ur",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100444027",
      "orcid": "missing"
    },
    {
      "name": "Inbal Ronen",
      "institution": "IBM Research, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321488024",
      "orcid": "missing"
    },
    {
      "name": "Sara Weber",
      "institution": "IBM CIO's Office, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502762730",
      "orcid": "missing"
    },
    {
      "name": "Tolga Oral",
      "institution": "IBM CIO's Office, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502810167",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amitay, E., Carmel, D., Har'el, N., Soffer, A., Golbandi, N., Ofek-Koifman, S., & Yogev, S. 2009. Social search and discovery using a unified approach. Proc. HT '09, 199--208.  ",
      "doi": "10.1145/1557914.1557950"
    },
    {
      "text": "Broder, A. 2002. A taxonomy of web search. SIGIR Forum 36, 2 (September 2002), 3--10.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Ehrlich, K. & Shami, N. S. 2008. Searching for expertise. Proc. CHI '08, 1093--1096.  ",
      "doi": "10.1145/1357054.1357224"
    },
    {
      "text": "Farrell, S., Lau T., Nusser S., Wilcox E., & Muller, M. 2007. Socially augmenting employee profiles with people-tagging. Proc. UIST '07, 91--100.  ",
      "doi": "10.1145/1294211.1294228"
    },
    {
      "text": "Guy, I., Jacovi, M., Shahar, E., Meshulam, N., Soroka, V., & Farrell, S. 2008. Harvesting with SONAR: the value of aggregating social network information. Proc. CHI '08, 1017--1026.  ",
      "doi": "10.1145/1357054.1357212"
    },
    {
      "text": "Guy, I., Ur, S., Ronen, I., Perer, A., & Jacovi, M. 2011. Do you want to know?: recommending strangers in the enterprise. Proc. CSCW '11, 285--294.  ",
      "doi": "10.1145/1958824.1958867"
    },
    {
      "text": "Hawking, D. 2004. Challenges in enterprise search. Proc. ADC '04, 15--24. ",
      "doi": "10.5555/1012294.1012297"
    },
    {
      "text": "Huurnink B., Hollink L., van den Heuvel W., & de Rijke, M. 2010. Search behavior of media professionals at an audiovisual archive: a transaction log analysis. JASIST 61, 6 (June 2010), 1180--1197.  ",
      "doi": "10.5555/1814490.1814506"
    },
    {
      "text": "Jansen, B. J. & Spink, A. 2006. How are we searching the world wide web?: a comparison of nine search engine transaction logs. Inf. Process. Manage. 42, 1 (Jan. 2006), 248--263.  ",
      "doi": "10.5555/1138797.1710819"
    },
    {
      "text": "Kautz, H., Selman, B., & Shah, M. 1997. Referral Web: combining social networks and collaborative filtering. Commun. ACM 40, 3 (Mar. 1997), 63--65.  ",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Kazai, G. & Doucet, A. 2008. Overview of the INEX 2007 Book Search Track (BookSearch'07). SIGIR Forum 42, 2--15.  ",
      "doi": "10.1145/1394251.1394253"
    },
    {
      "text": "Lawrence S., Bollacker K., & Giles, C. L. 1999. Indexing and retrieval of scientific literature. Proc. CIKM '99, 139--146.  ",
      "doi": "10.1145/319950.319970"
    },
    {
      "text": "McDonald, D. W. & Ackerman M. S. 1998. Just talk to me: a field study of expertise location. Proc. CSCW '98, 315--324.  ",
      "doi": "10.1145/289444.289506"
    },
    {
      "text": "McDonald, D. W. & Ackerman, M. S. 2000. Expertise recommender: a flexible recommendation system and architecture. Proc. CSCW '00, 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Mishne, G. & de Rijke, M. 2006. A study of blog search. Proc. ECIR '06, 289--301.  ",
      "doi": "10.1007/11735106_26"
    },
    {
      "text": "Philips, L. 2000. The double metaphone search algorithm. C/C++ Users J. 18, 6 (June 2000), 38--43. ",
      "doi": "10.5555/349124.349132"
    },
    {
      "text": "Reichling, T., Veith, M., & Wulf, V. 2007. Expert recommender: designing for a network organization. JCSCW 16, 4-5 (October 2007), 431--465.  ",
      "doi": "10.1007/s10606-007-9055-2"
    },
    {
      "text": "Silverstein, C., Marais, H., Henzinger, M., & Moricz, M. 1999. Analysis of a very large web search engine query log. SIGIR Forum 33, 1 (Sept.1999), 6--12.  ",
      "doi": "10.1145/331403.331405"
    },
    {
      "text": "Smirnova, E. & Balog, K. 2011. A user-oriented model for expert finding. Proc. ECIR '11, 580--592. ",
      "doi": "10.5555/1996889.1996964"
    },
    {
      "text": "Weerkamp, W., Berendsen, R., Kovachev, B., Meij, E., Balog, K., & de Rijke, M. 2011. People searching for people: analysis of a people search engine log. Proc. SIGIR '11, 45--54.  ",
      "doi": "10.1145/2009916.2009927"
    },
    {
      "text": "Yiman-Seid, D. & Kobsa, A. 2003. Expert-finding systems for organizations: Problem and domain analysis and the DEMOIR approach. JOCEC 13, 1 (2003), 1--24.",
      "doi": ""
    }
  ]
}