{
  "doi": "10.1145/2207676.2208622",
  "title": "#EpicPlay: crowd-sourcing sports video highlights",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1569-1572",
  "year": 2012,
  "badges": [],
  "abstract": "During a live sports event, many sports fans use social media as a part of their viewing experience, reporting on their thoughts on the event as it unfolds. In this work, we use this information stream to semantically annotate live broadcast sports games, using these annotations to select video highlights from the game. We demonstrate that this approach can be used to select highlights specific for fans of each team, and that these clips reflect the emotions of a fan during a game. Further, we describe how these clips differ from those seen on nightly sportscasts.",
  "tags": [
    "video summarization",
    "crowd-sourcing",
    "sports",
    "video annotation",
    "microblogging",
    "broadcast sports",
    "twitter"
  ],
  "authors": [
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Sebastian Boring",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/do/10.1145/contrib-81331489074/rel-imgonly/mobilehci2015.jpg",
      "acmid": "81331489074",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Babaguchi, N., Kawai, Y., Ogura, T., and Kitahashi, T. Personalized abstraction of broadcasted American football video by highlight selection. In IEEE Multimedia 6 (4), (2004), 575--586.  ",
      "doi": "10.1109/TMM.2004.830811"
    },
    {
      "text": "Chakrabarti, D., and Punera, K. Event summarization using tweets. In Proc ICWSM 2011, (2011).",
      "doi": ""
    },
    {
      "text": "Hannon, J., McCarthy, K., Lynch, J., and Smyth, B. Personalized and automatic social summarization of events in video. In Proc IUI 2011, (2011), 335--338.  ",
      "doi": "10.1145/1943403.1943459"
    },
    {
      "text": "Marcus, A., Bernstein, M. S., Badar, O., Karger, D. R., Madden, S., and Miller, R. C. Twitinfo: aggregating and visualizing microblogs for event exploration. In Proc CHI 2011, (2011), 227--236.  ",
      "doi": "10.1145/1978942.1978975"
    },
    {
      "text": "Nepal, S., Srinivasan, U., and Reynold, G. Automatic detection of 'Goal' segments in basketball videos. In Proc Multimedia '01, (2001), 261--269.  ",
      "doi": "10.1145/500141.500181"
    },
    {
      "text": "Olsen, D. R., and Moon, B. Video summarization based on user interaction. In Proc EuroITV 2011, (2011), 115--122.  ",
      "doi": "10.1145/2000119.2000142"
    },
    {
      "text": "Shamma, D. A., Kennedy, L., and Churchill, E. F. Conversational shadows: describing live media events using short messages. In Proc ICWSM 2010, (2010).",
      "doi": ""
    },
    {
      "text": "Wu, S.-Y., Thawonmas, R., and Chen, K.-T. Video summarization via crowdsourcing. In Ext. Abstracts of CHI 2011, (2011), 1531--1536.  ",
      "doi": "10.1145/1979742.1979803"
    },
    {
      "text": "Xu, C., Wang, J., Wan, K., Li, Y., and Duan, L. Live sports event detection based on broadcast video and web-casting text. In Proc Multimedia '06, (2006), 221--230.  ",
      "doi": "10.1145/1180639.1180699"
    }
  ]
}