{
  "doi": "10.1145/2207676.2207779",
  "title": "\"Baby it's cold outside\": the influence of ambient temperature and humidity on thermal feedback",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "715-724",
  "year": 2012,
  "badges": [],
  "abstract": "Thermal feedback is a new area of research in HCI and, as such, there has been very little investigation of the impact of environmental factors on its use for interaction. To address this shortcoming we conducted an experiment to investigate how ambient temperature and humidity could affect the usability of thermal feedback. If environmental conditions affect perception significantly, then it may not be suitable for mobile interactions. Evaluations were conducted outdoors in varying environmental conditions over a period of 5 months. Results showed that the ambient temperature has a significant impact on people's ability to detect stimuli and also their perception of these stimuli. Humidity has a negligible effect for most humidity values. Despite this, previous thermal feedback design recommendations still hold in varying temperatures and humidities showing that thermal feedback is a useful tool for mobile interaction.",
  "authors": [
    {
      "name": "Martin Halvey",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310486119",
      "orcid": "missing"
    },
    {
      "name": "Graham Wilson",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467653138",
      "orcid": "0000-0003-2664-1634"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Stephen Hughes",
      "institution": "SAMH Engineering, Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81494640446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cherycroze, S., Painful Sensation Induced by a Thermal Cutaneous Stimulus. Pain, 1983. 17(2): p. 109--137.",
      "doi": ""
    },
    {
      "text": "Fujita, H. and K. Nishimoto, Lovelet: a heartwarming communication tool for intimate people by constantly conveying situation data. Proc. CHI 2004.  ",
      "doi": "10.1145/985921.986129"
    },
    {
      "text": "Gagge, A., J. Stolwijk, and J. Hardy, Comfort and Thermal Sensations and Associated Physiological Responses at Various Ambient Temperatures. Environ Res, 1967. 1(1): p. 1--20.",
      "doi": ""
    },
    {
      "text": "Givoni, B., J. Khedari, N. H. Wong, H. Feriadi, and M. Noguchi, Thermal sensation responses in hot, humid climates: effect of humidity. Building Research & Information, 2006. 34(5): p. 496--506.",
      "doi": ""
    },
    {
      "text": "Gooch, D., An Investigation into Communicating Social Presence With Thermal Devices. MSc Dissertation, University of Bath, 2009: p. 1--390.",
      "doi": ""
    },
    {
      "text": "Green, B. G., Temperature perception on the hand during static versus dynamic contact with a surface. Atten Percept Psycho, 2009. 71(5): p. 1185--1196.",
      "doi": ""
    },
    {
      "text": "Hagander, L., H. Midani, and M. Kuskowski, Quantitative sensory testing: effect of site and skin temperature on thermal thresholds. Clinical Neurophysiology, 2000.",
      "doi": ""
    },
    {
      "text": "Halvey, M., Y. Vazquez-Alvarez, G. Wilson, and S. Brewster. The Effect of Clothing on Thermal Feedback Perception. Proc ICMI 2011: p. 217--220.  ",
      "doi": "10.1145/2070481.2070519"
    },
    {
      "text": "Harrison, J. and K. Davis, Cold-evoked pain varies with skin type and cooling rate: a psychophysical study in humans. Pain, 1999. 83(2): p. 123--135.",
      "doi": ""
    },
    {
      "text": "Hirosawa, I., H. Dodo, M. Hosokawa, S. Watanabe, K. Nishiyama, and Y. Fukuichi, Physiological Variations of Warm and Cool Sense with Shift of Environmental-Temperature. Int J Neurosci, 1984. 24(3--4): p. 281--288.",
      "doi": ""
    },
    {
      "text": "Iwasaki, K., T. Miyaki, and J. Rakimoto, AffectPhone: A Handset Device to Present User's Emotional State with Warmth/Coolness. BIOSTEC2010, 2010. 2010(B-Interface Workshop): p. 1--6.",
      "doi": ""
    },
    {
      "text": "Johnson, K., I. Darian-Smith, and C. LaMotte, Peripheral neural determinants of temperature discrimination in man: a correlative study of responses to cooling skin. Journal of Neurophysiology, 1973.",
      "doi": ""
    },
    {
      "text": "Jones, L. A. and M. Berris, The Psychophysics of Temperature Perception and Thermal-Interface Design. 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2002: p. 1--6. ",
      "doi": "10.5555/795682.797526"
    },
    {
      "text": "Kenshalo, D., C. E. Holmes, and P. B. Wood, Warm and Cool Thresholds as a Function of Temperature Change. Perception & Psychophysics, 19 3(2A): p. 4.",
      "doi": ""
    },
    {
      "text": "Kenshalo, D. and H. Scott, Temporal course of thermal adaptation. Science, 1966.",
      "doi": ""
    },
    {
      "text": "Kushiyama, K., T. Baba, K. Doi, and S. Sasada, Thermo-Pict neo. Proc SIGGRAPH 2010: p. 1--1.  ",
      "doi": "10.1145/1836845.1836890"
    },
    {
      "text": "Lee, W. and Y. K. Lim, Thermo-Message: Exploring the Potential of Heat as a Modality of peripheral Expression. Proc CHI Extended Abstracts 2010: p. 1--6.  ",
      "doi": "10.1145/1753846.1754131"
    },
    {
      "text": "Nakashige, M., M. Kobayashi, and Y. Suzuki, \"Hiya-Atsu\" media: augmenting digital media with temperature. Proc. CHI 2009: p. 3181--3186.  ",
      "doi": "10.1145/1520340.1520453"
    },
    {
      "text": "Narumi, T., T. Akagawa, Y. A. Seong, and M. Hirose, Thermotaxis. Proc. SIGGRAPH 2009: p. 1--1.  ",
      "doi": "10.1145/1599301.1599319"
    },
    {
      "text": "Stevens, J. C., Thermal Sensibility, in The Psychology of Touch, M. A. Heller and W. Schiff, Editors. 1991, Lawrence Erlbaum: New Jersey.",
      "doi": ""
    },
    {
      "text": "Strigo, I., F. Carli, and M. Bushnell, Effect of ambient temperature on human pain and temperature perception. Anesthesiology, 2000. 92(3): p. 699--707.",
      "doi": ""
    },
    {
      "text": "Wettach, R., C. Behrens, A. Danielsson, and T. Ness, A thermal information display for mobile applications. Proc. MobileHCI 2007: p 182--185.  ",
      "doi": "10.1145/1377999.1378004"
    },
    {
      "text": "Wilson, G., M. Halvey, S. A. Brewster, and S. Hughes, A., Some Like it Hot? Thermal Feedback for Mobile Devices. Proc. CHI 2011: p. 2555--2564.  ",
      "doi": "10.1145/1978942.1979316"
    }
  ]
}