{
  "doi": "10.1145/2207676.2208405",
  "title": "HoloDesk: direct 3d interactions with a situated see-through display",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2421-2430",
  "year": 2012,
  "badges": [],
  "abstract": "HoloDesk is an interactive system combining an optical see through display and Kinect camera to create the illusion that users are directly interacting with 3D graphics. A virtual image of a 3D scene is rendered through a half silvered mirror and spatially aligned with the real-world for the viewer. Users easily reach into an interaction volume displaying the virtual image. This allows the user to literally get their hands into the virtual display and to directly interact with an spatially aligned 3D virtual world, without the need for any specialized head-worn hardware or input device. We introduce a new technique for interpreting raw Kinect data to approximate and track rigid (e.g., books, cups) and non-rigid (e.g., hands, paper) physical objects and support a variety of physics-inspired interactions between virtual and real. In particular the algorithm models natural human grasping of virtual objects with more fidelity than previously demonstrated. A qualitative study highlights rich emergent 3D interactions, using hands and real-world objects. The implementation of HoloDesk is described in full, and example application scenarios explored. Finally, HoloDesk is quantitatively evaluated in a 3D target acquisition task, comparing the system with indirect and glasses-based variants.",
  "tags": [
    "kinect",
    "augmented reality (ar)",
    "3d physics interactions",
    "natural human grasping",
    "see-through display"
  ],
  "authors": [
    {
      "name": "Otmar Hilliges",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81309495440/rel-imgonly/81309495440.jpg",
      "acmid": "81309495440",
      "orcid": "missing"
    },
    {
      "name": "David Kim",
      "institution": "Newcastle University, Newcastle upon Tyne & Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81460641092/rel-imgonly/david.jpg",
      "acmid": "81460641092",
      "orcid": "missing"
    },
    {
      "name": "Shahram Izadi",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488768",
      "orcid": "missing"
    },
    {
      "name": "Malte Weiss",
      "institution": "RWTH Aachen University, Aachen, Germany & Microsoft Research, Cambridge, United Kingdom,",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414605252",
      "orcid": "missing"
    },
    {
      "name": "Andrew Wilson",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    }
  ],
  "references": [
    {
      "text": "Agrawala, M., et al. The two-user responsive workbench: support for collaboration through individual views of a shared space. In Proc. ACM SIGGRAPH (1997), 327--332.  ",
      "doi": "10.1145/258734.258875"
    },
    {
      "text": "Bimber, O., et al. The extended virtual table: An optical extension for table-like projection systems. Presence: Teleoper. Virtual Environ. 10 (December 2001), 613--631.  ",
      "doi": "10.1162/105474601753272862"
    },
    {
      "text": "Bimber, O., and Raskar, R. Spatial Augmented Reality: Merging Real and Virtual Worlds. A. K. Peters, Ltd., Natick, MA, USA, 2005. ",
      "doi": "10.5555/1088894"
    },
    {
      "text": "Brox, T., et al. High accuracy optical flow estimation based on a theory for warping. Computer 4, May (2004).",
      "doi": ""
    },
    {
      "text": "Butler, A., et al. Vermeer: Direct Interaction with a 360° Viewable 3D Display. In Proc. ACM UIST (2011).  ",
      "doi": "10.1145/2047196.2047271"
    },
    {
      "text": "Czernuszenko, M., et al. The immersadesk and infinity wall projection-based virtual reality displays. SIGGRAPH Comput. Graph. 31 (May 1997), 46--49.  ",
      "doi": "10.1145/271283.271303"
    },
    {
      "text": "Feng, Z., et al. Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR. In Proc. IEEE ISMAR (2008), 193--202.  ",
      "doi": "10.1109/ISMAR.2008.4637362"
    },
    {
      "text": "Graham, E. D., and MacKenzie, C. L. Physical versus virtual pointing. In Proc. ACM CHI (1996), 292--299.  ",
      "doi": "10.1145/238386.238532"
    },
    {
      "text": "Grossman, T., and Wigdor, D. Going Deeper: a Taxonomy of 3D on the Tabletop. In Proc. ACM ITS, IEEE (Oct. 2007), 137--144.",
      "doi": ""
    },
    {
      "text": "Hachet, M., et al. Toucheo: Multitouch and Stereo Combined in a Seamless Workspace. In Proc. ACM UIST (Oct. 2011).  ",
      "doi": "10.1145/2047196.2047273"
    },
    {
      "text": "Hancock, M., Carpendale, S., and Cockburn, A. Shallow-Depth 3D Interaction: design and evaluation of one-, two- and three-touch techniques. In Proc. ACM CHI (2007), 1147--1156.  ",
      "doi": "10.1145/1240624.1240798"
    },
    {
      "text": "Hilliges, O., et al. Interactions in the Air: Adding Further Depth to Interactive Tabletops. In Proc. ACM UIST (2009), 139--148.  ",
      "doi": "10.1145/1622176.1622203"
    },
    {
      "text": "Hoffman, D., et al. Vergence accommodation conflicts hinder visual performance and cause visual fatigue. IJVR 8, 3 (2008), 33.",
      "doi": ""
    },
    {
      "text": "Izadi, S., et al. C-Slate: A Multi-Touch and Object Recognition System for Remote Collaboration using Horizontal Surfaces. In IEEE Tabletop, vol. 0, IEEE (2007), 3--10.",
      "doi": ""
    },
    {
      "text": "Izadi, S., et al. Going beyond the display. In Proc. ACM UIST, ACM (2008), 269.  ",
      "doi": "10.1145/1449715.1449760"
    },
    {
      "text": "Izadi, S., et al. KinectFusion: Real-time 3D Reconstruction and Interaction Using a Moving Depth Camera. In Proc. ACM UIST, ACM (2011).  ",
      "doi": "10.1145/2047196.2047270"
    },
    {
      "text": "Johnson, A., Scharver, C., and Leigh, J. Designing Cranial Implants in a Haptic Augmented Reality Environment. Communications of the ACM 47, 8 (2004), 32--38.  ",
      "doi": "10.1145/1012037.1012059"
    },
    {
      "text": "Kakehi, Y., et al. Tablescape Plus: Interactive Small-sized Vertical Displays on a Horizontal Tabletop Display. In Proc. ACM ITS, IEEE (2007), 155--162.",
      "doi": ""
    },
    {
      "text": "Kim, S. W., Treskunov, A., and Marti, S. DRIVE: Directly Reaching Into Virtual Environment with bare hand manipulation behind mobile display. In Proc. IEEE 3D UI (2011), 107--108. ",
      "doi": "10.5555/2013881.2014222"
    },
    {
      "text": "Knödel, S., and Hachet, M. Multi-touch RST in 2D and 3D Spaces: Studying the Impact of Directness on User Performance. In Proc. IEEE 3D UI (2011). ",
      "doi": "10.5555/2013881.2014214"
    },
    {
      "text": "Lee, T., and Hollerer, T. Handy AR: Markerless Inspection of Augmented Reality Objects Using Fingertip Tracking. In Proc. ISWC, IEEE (2007), 1--8.  ",
      "doi": "10.1109/ISWC.2007.4373785"
    },
    {
      "text": "Malik, S., and Laszlo, J. Visual touchpad: a two-handed gestural input device. In Proc. ACM ICMI (2004), 289.  ",
      "doi": "10.1145/1027933.1027980"
    },
    {
      "text": "Martinet, A., et al. The design and evaluation of 3d positioning techniques for multi-touch displays. In Proc. IEEE 3D UI (2010), 115--118.  ",
      "doi": "10.1109/3DUI.2010.5444709"
    },
    {
      "text": "McKenna, M. Interactive viewpoint control and three-dimensional operations. In Proc SI3D, vol. 25, ACM (1992), 53--56.  ",
      "doi": "10.1145/147156.147163"
    },
    {
      "text": "Mulder, J. D., and Liere, R. V. The personal space station: Bringing interaction within reach. In Proc. VRIC (2002).",
      "doi": ""
    },
    {
      "text": "Nakashima, B. K., et al. A 2D-3D Integrated Tabletop Environment for Multi-user Collaboration. Computer Animation and Virtual Worlds 18, 1 (November 2007), 39--56.  ",
      "doi": "10.5555/1229030.1229033"
    },
    {
      "text": "Olwal, A., et al. ASTOR: An Autostereoscopic Optical See-through Augmented Reality System. In Proc. IEEE ISMAR, IEEE (2005), 24--27.  ",
      "doi": "10.1109/ISMAR.2005.15"
    },
    {
      "text": "Papagiannakis, G., et al. A survey of mobile and wireless technologies for augmented reality systems. Comput. Animat. Virtual Worlds 19 (February 2008), 3--22.  ",
      "doi": "10.5555/1348083.1348087"
    },
    {
      "text": "Paris, S., and Durand, F. A Fast Approximation of the Bilateral Filter Using a Signal Processing Approach. IJCV 81, 1 (Dec. 2007), 24--52.  ",
      "doi": "10.1007/s11263-007-0110-8"
    },
    {
      "text": "Poston, T., and Serra, L. The virtual workbench: dextrous VR. In Proc. ACM VRST (1994), 111--121. ",
      "doi": "10.5555/207072.207133"
    },
    {
      "text": "Prachyabrued, M., and Borst, C. W. Dropping the ball: Releasing a virtual grasp. In Proc. ACM VRST (2011), 59--66. ",
      "doi": "10.5555/2013881.2014212"
    },
    {
      "text": "Reisman, J. L., et al. A screen-space formulation for 2D and 3D direct manipulation. In Proc. ACM UIST (2009), 69--78.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "Stavness, I., Lam, B., and Fels, S. pCubee : A Perspective-Corrected Handheld Cubic Display. In Proc. ACM CHI (2010), 1381--1390.  ",
      "doi": "10.1145/1753326.1753535"
    },
    {
      "text": "Ware, C., Arthur, K., and Booth, K. S. Fish Tank Virtual Reality. In Proc. ACM CHI, ACM (1993), 37--42.  ",
      "doi": "10.1145/169059.169066"
    },
    {
      "text": "Wilson, A. D. Depth-Sensing Video Cameras for 3D Tangible Tabletop Interaction. In Proc. ACM ITS, IEEE (2007), 201--204.",
      "doi": ""
    },
    {
      "text": "Wilson, A. D. Simulating Grasping Behavior on an Imaging Interactive Surface. In Proc. ACM ITS, ACM (2007), 125--132.  ",
      "doi": "10.1145/1731903.1731929"
    },
    {
      "text": "Wilson, A. D., and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. ACM UIST (2010), 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Wilson, A. D., et al. Bringing Physics to the Surface. In Proc. ACM UIST (2008), 67--76.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Yoshida, T., et al. Repro3d: full-parallax 3d display using retro-reflective projection technology. In Proc. ACM SIGGRAPH, ACM (2010).  ",
      "doi": "10.1145/1836821.1836841"
    },
    {
      "text": "Zhang, Z. A flexible new technique for camera calibration. IEEE Transactions on Pattern Analysis and Machine Intelligence 22, 11 (2000), 1330--1334.  ",
      "doi": "10.1109/34.888718"
    }
  ]
}