{
  "doi": "10.1145/2207676.2208316",
  "title": "Interactive paper substrates to support musical creation",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1825-1828",
  "year": 2012,
  "badges": [],
  "abstract": "We present paper substrates, interactive paper components that support the creation and manipulation of complex musical data. Substrates take different forms, from whole pages to movable strips, and contain or control typed data representations. We conducted participatory design sessions with five professional musicians with extensive experience with music creation tools. All generated innovative uses of paper substrates, manipulating their data, linking multiple representation layers and creating modular, reusable paper elements. The substrates reflect the structure of their computer-based data, but in a much more flexible and adaptable form. We use their prototypes to provide concrete examples of substrates, identify their roles, properties and functions. Finally, we explore their physical and interaction design with an interactive prototype.",
  "authors": [
    {
      "name": "Jérémie Garcia",
      "institution": "INRIA & Univ Paris-Sud & IRCAM, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502729419",
      "orcid": "0000-0001-7076-6229"
    },
    {
      "name": "Theophanis Tsandilas",
      "institution": "INRIA & Univ Paris-Sud, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100306817",
      "orcid": "missing"
    },
    {
      "name": "Carlos Agon",
      "institution": "IRCAM, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100052954",
      "orcid": "missing"
    },
    {
      "name": "Wendy Mackay",
      "institution": "INRIA, Orsay, France & Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236706",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Coughlan, T. and Johnson, P. Understanding productive, structural and longitudinal interactions in the design of tools for creative activities. In Proc. C&C'09 (2009), ACM, 155--164.  ",
      "doi": "10.1145/1640233.1640258"
    },
    {
      "text": "Garcia, J., Tsandilas, T., Agon, C. and Mackay, W. Ink-Splorer: Exploring Musical Ideas on Paper and Computer. In Proc. NIME'11 (2011), 361--366.",
      "doi": ""
    },
    {
      "text": "Gardener, R. Music Notation, a Manual of Modern Practice. London: V. Gollancz, 1982.",
      "doi": ""
    },
    {
      "text": "Liao, C., Guimbretière, F., Hinckley, K. and Hollan, J. Papiercraft: A gesture-based command system for interactive paper. In TOCHI, 14(4), 2008, ACM, 1--27.  ",
      "doi": "10.1145/1314683.1314686"
    },
    {
      "text": "Mackay, W. E. Is paper safer? The role of paper flight strips in air traffic control. In TOCHI, 6(4), 1999, ACM, 311--340.  ",
      "doi": "10.1145/331490.331491"
    },
    {
      "text": "Sellen, A. J. and Harper, R. H. R. The Myth of the Paperless Office. (2003). MIT Press. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Song, H., Guimbretière, F., Hu, C. and Lipson, H. ModelCraft: capturing freehand annotations and edits on physical 3D models. In Proc. UIST'06 (2006), ACM, 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Tsandilas, T., Letondal, C. and Mackay, W. E. Musink: composing music through augmented drawing. In Proc. CHI'09 (2009), ACM, 819--828.  ",
      "doi": "10.1145/1518701.1518827"
    },
    {
      "text": "Yeh, R., Liao, C., Klemmer, S., Guimbretière, F., Lee, B., Kakaradov, B., Stamberger, J. and Paepcke, A. ButterflyNet: a mobile capture and access system for field biology research. In Proc. CHI'06 (2006), ACM, 571--580.  ",
      "doi": "10.1145/1124772.1124859"
    }
  ]
}