{
  "doi": "10.1145/2207676.2207703",
  "title": "Understanding flicking on curved surfaces",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "189-198",
  "year": 2012,
  "badges": [],
  "abstract": "Flicking is a common interaction technique to move objects across large interactive surfaces, but little is known about its suitability for use on non-planar, curved surfaces. Flicking consists of two stages: First, visually determining the direction in which to flick the object, then planning and executing the corresponding gesture. Errors in both stages could influence flicking accuracy. We investigated flicking interactions on curved interactive surface to evaluate which type of error influences accuracy. Therefore, we carried out three user studies to analyze how each stage of flicking on a curved surface is influenced. Our main findings are: 1) Flicking gestures are more accurate if horizontal and vertical surface are joined by a continuous curve than if they are separated by an edge or gap. 2) Flicking gestures on curved surfaces are mostly influenced by the motor execution stage of the gesture rather than the visual perception stage. 3) Flicking accuracy decreases as the starting point of the gesture is moved closer to the curve. 4) We conclude with a first mathematical model to estimate the error users will make when flicking across a curve.",
  "authors": [
    {
      "name": "Simon Voelker",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81479651640/rel-imgonly/simon_voelker.jpg",
      "acmid": "81479651640",
      "orcid": "missing"
    },
    {
      "name": "Christine Sutter",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650762",
      "orcid": "missing"
    },
    {
      "name": "Lei Wang",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502740248",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "Cao, X., Wilson, A., Balakrishnan, R., Hinckley, K., and Hudson, S. Shapetouch: Leveraging contact shape on interactive surfaces. In 3rd IEEE International Workshop on Horizontal Interactive Human Computer Systems '08. (2008), 129--136.",
      "doi": ""
    },
    {
      "text": "Coldefy, F., and Louis-dit Picard, S. Digitable: an interactive multiuser table for collocated and remote collaboration enabling remote gesture visualization. In Proc. Computer Vision and Pattern Recognition '07, IEEE (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Collomb, M., Hascoët, M., Baudisch, P., and Lee, B. Improving drag-and-drop on wall-size displays. In Proc. Graphics Interface 2005, Canadian Human-Computer Communications Society (2005), 25--32. ",
      "doi": ""
    },
    {
      "text": "Faisal, A. A., Selen, L. P. J., and Wolpert, D. M. Noise in the nervous system. Nature Review Neuroscience 9 (2008), 292--303.",
      "doi": ""
    },
    {
      "text": "Fineman, M. The Nature of Visual Illusion. New York: Dover, 1996.",
      "doi": ""
    },
    {
      "text": "Geissler, J. Shuffle, throw or take it! working efficiently with an interactive wall. In Proc. CHI '98, ACM (1998), 265--266.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Green, R. T., and Hoyle, E. M. The poggendorff illusion as a constancy phenomeno. Nature 200 (1963), 611--612.",
      "doi": ""
    },
    {
      "text": "Hammerton, M., and Tickner, A. H. An investigation into the comparative suitability of forearm, hand and thumb controls in acquisition tasks. Ergonomics 9 (1966), 125--130.",
      "doi": ""
    },
    {
      "text": "Hinrichs, U., and Carpendale, S. Gestures in the wild: studying multi-touch gesture sequences on interactive tabletop exhibits. In Proc. CHI '11, ACM (2011), 3023--3032.  ",
      "doi": ""
    },
    {
      "text": "Langolf, G. D., Chaffin, D. B., and Foulke, J. A. An investigation of Fitts' law using a wide range of movement amplitudes. Journal of Motor Behaviour 8 (1976), 113--128.",
      "doi": ""
    },
    {
      "text": "Morris, M., Brush, A., and Meyers, B. Reading revisited: Evaluating the usability of digital display surfaces for active reading tasks. In Proc. TABLETOP '07 (2007), 79--86.",
      "doi": ""
    },
    {
      "text": "Morris, M., Brush, A., and Meyers, B. A field study of knowledge workers' use of interactive horizontal displays. In Proc. TABLETOP '08 (2008), 105--112.",
      "doi": ""
    },
    {
      "text": "Moyle, M., and Cockburn, A. Analysing mouse and pen flick gestures. In Proc. SIGCHI-NZ Symposium On Computer-Human Interaction '02 (2002), 266--267.  ",
      "doi": ""
    },
    {
      "text": "Penfield, W., and Rasmussen, T. The cerebral cortex of man. New York: Macmillan, 1950.",
      "doi": ""
    },
    {
      "text": "Reetz, A., Gutwin, C., Stach, T., Nacenta, M., and Subramanian, S. Superflick: a natural and efficient technique for long-distance object placement on digital tables. In Proc. Graphics Interface '06, Canadian Information Processing Society (2006), 163--170. ",
      "doi": ""
    },
    {
      "text": "Rekimoto, J. Pick-and-drop: a direct manipulation technique for multiple computer environments. In Proc. Symposium on User Interface Software and Technology '97, ACM (1997), 31--39.  ",
      "doi": ""
    },
    {
      "text": "Restle, F., and Decker, J. Size of the mueller-lyer illusion as a function of ist dimensions: Theory and data. Theory and data. Perception and Psychophysics 21 (1977), 489--503.",
      "doi": ""
    },
    {
      "text": "Sato, T., Fukuchi, K., and Koike, H. Implementation and evaluations of vision-based finger flicking gesture recognition for tabletops. In 3rd IEEE International Workshop on Horizontal Interactive Human Computer Systems '08. (2008), 137--144.",
      "doi": ""
    },
    {
      "text": "Tognazzini, B. The starfire video prototype project: a case history. In Proc. CHI '94, ACM (1994), 99--105.  ",
      "doi": ""
    },
    {
      "text": "Weiss, M., Voelker, S., Sutter, C., and Borchers, J. Benddesk: dragging across the curve. In Proc. Interactive Tabletops and Surfaces, ACM (2010), 1--10.  ",
      "doi": ""
    },
    {
      "text": "Wellner, P. The digitaldesk calculator: tangible manipulation on a desk top display. In Proc. Symposium on User Interface Software and Technology '91, ACM (1991), 27--33.  ",
      "doi": ""
    },
    {
      "text": "Wigdor, D., Jiang, H., Forlines, C., Borkin, M., and Shen, C. Wespace: the design development and deployment of a walk-up and share multi-surface visual collaboration system. In Proc. CHI '09, ACM (2009), 1237--1246.  ",
      "doi": ""
    },
    {
      "text": "Wigdor, D., Perm, G., R., K., Esenther, A., and Shen, C. Living with a tabletop: Analysis and observations of long term office use of a multi-touch table. In Proc. TABLETOP '07 (2007), 60--67.",
      "doi": ""
    },
    {
      "text": "Wilson, A. D., Izadi, S., Hilliges, O., Garcia-Mendoza, A., and Kirk, D. Bringing physics to the surface. In Proc. Symposium on User Interface Software and Technology '08, ACM (2008), 67--76.  ",
      "doi": ""
    },
    {
      "text": "Wimmer, R., Hennecke, F., Schulz, F., Boring, S., Butz, A., and Hussmann, H. Curve: revisiting the digital desk. In Proc. Nordic Conference on Human-Computer Interaction '10, ACM (2010), 561--570.  ",
      "doi": ""
    },
    {
      "text": "Wu, M., and Balakrishnan, R. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. In Proc. Symposium on User Interface Software and Technology '03, ACM (2003), 193--202.  ",
      "doi": ""
    }
  ]
}