{
  "doi": "10.1145/2207676.2208654",
  "title": "Enabling self, intimacy and a sense of home in dementia: an enquiry into design in a hospital setting",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2629-2638",
  "year": 2012,
  "badges": [],
  "abstract": "Design and digital technologies to support a sense of self and human relationships for people living with dementia are both urgently needed. We present an enquiry into design for dementia facilitated by a public art commission for an adult mental health unit in a hospital in the UK. The interactive art piece was informed by the notion of personhood in dementia that foregrounds the person's social being and interpersonal relationships as sites where self is maintained and constructed. How clients, clients' family members and staff used the piece is reported and insights related to the notions of home, intimacy, possessions and self are presented. The art piece served as window on both dementia and the institution leading to a number of insights and implications for design.",
  "authors": [
    {
      "name": "Jayne Wallace",
      "institution": "Northumbria University, Newcastle Upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/do/10.1145/contrib-81318496730/rel-imgonly/jayne_sm.jpg",
      "acmid": "81318496730",
      "orcid": "missing"
    },
    {
      "name": "Anja Thieme",
      "institution": "Newcastle University, Newcastle Upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482659504",
      "orcid": "0000-0002-9639-5531"
    },
    {
      "name": "Gavin Wood",
      "institution": "Newcastle University, Newcastle Upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479648974",
      "orcid": "missing"
    },
    {
      "name": "Guy Schofield",
      "institution": "Newcastle University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474697023",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Allan, D. Negotiating the role of expert carers on an adult hospital ward. Sociology of Health & Illness, 22(2), 2000, 149--17",
      "doi": ""
    },
    {
      "text": "Alzheimer's Disease Facts and Figures report 2011, p.36, from www.alz.org/downloads/Facts_Figures_2011.pdf",
      "doi": ""
    },
    {
      "text": "Alzheimer Society of Canada. Guidelines for Care. Toronto: ASC; 1992, p.",
      "doi": ""
    },
    {
      "text": "Baumeister, R.F., and Leary, M.R., The need to belong: Desire for interpersonal attachments as a fundamental human motivation. Psychological Bulletin, 117(3), 1995, 497--529.",
      "doi": ""
    },
    {
      "text": "Belk, R.W. Possessions and the extended self. Journal of Consumer Research, 15(2), 1988, 139--168.",
      "doi": ""
    },
    {
      "text": "Braun, V., and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology, 3, 2006, 77--101.",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Buckland, S. Well-being, personality and residential care. In: Kitwood T, Benson S, eds. The New Culture of Dementia Care. Hawker Publications, 1997, 30--34.",
      "doi": ""
    },
    {
      "text": "Clampitt, P.G. Communicating for managerial effectiveness. Sage, 1996.",
      "doi": ""
    },
    {
      "text": "Cohen, D. and Eisdorfer, C. The loss of self: A family resource for the care of Alzheimer's disease and related disorders. Norton, 1986.",
      "doi": ""
    },
    {
      "text": "Davies, S. 'Making the move': relatives' experience of the transition into a care home. Health and Social care in the Community, 12(6), 2004, 517--526.",
      "doi": ""
    },
    {
      "text": "1Ehrenfeld, M., Bronner, G., Tabak, N., Alpert, R., and Bergman, R. Sexuality among institutionalizes elderly patients with dementia. Nursing Ethics, 6, 1999, 144--149.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Blythe, M., Boucher, A., Jarvis, N., Bowers, J. and Wright, P. The Prayer Companion: Openness and Specificity, Materiality and Spirituality. In Proc. CHI 2010, ACM Press (2010), 2055--2064.  ",
      "doi": "10.1145/1753326.1753640"
    },
    {
      "text": "Hughes, J.C., Louw, S.J., and Sabat, S.R. Dementia: mind, meaning, and the person. Oxford Medical Publication, 2006.",
      "doi": ""
    },
    {
      "text": "Killick, J. and Craig, C Creativity and Communication in Persons with Dementia: A Practical Guide Jessica, Kingsley Publishers, 2011.",
      "doi": ""
    },
    {
      "text": "Kitwood, T. Dementia reconsidered: The person comes first. Open University Press, 1997.",
      "doi": ""
    },
    {
      "text": "Kitwood, T., and Bredin, K. Towards a theory of dementia care: Personhood and well-being. Ageing and Society, 12, 1992, 269--287.",
      "doi": ""
    },
    {
      "text": "Kontos, P. C. Embodied selfhood in Alzheimer's disease --",
      "doi": ""
    },
    {
      "text": "Rethinking person-centred care. Dementia, 4, 2005, 553--570.",
      "doi": ""
    },
    {
      "text": "Kuhn, D. Intimacy, Sexuality, and Residents with Dementia. Alzheimer's Care Quarterly, 3(2), 2002, 165--176.",
      "doi": ""
    },
    {
      "text": "Larson, J.H., Hammond, C.H., and Harper, J.M. Perceived equity and intimacy in marriage. Journal of Marital and Family Therapy, 24, 1998, 487--506.",
      "doi": ""
    },
    {
      "text": "McCracken, G. Culture and consumption among the elderly: Three research objectives in an emerging field. Aging and Society, 7(2), 1987, 203--224.",
      "doi": ""
    },
    {
      "text": "2Miller, D. The comfort of things. Polity Press, 2008.",
      "doi": ""
    },
    {
      "text": "2Moss, B.F., and Schwebel, A.I. Defining intimacy in romantic relationships. Family Relations, 42, 1993, 31--37.",
      "doi": ""
    },
    {
      "text": "Mynatt, E.D., Melenhorst, A.-S., Fisk, A.D., and Rogers, W.A. Aware Technologies for Aging in Place: Understanding User Needs and Attitudes, IEEE Pervasive Computing, 3(2), 2004, 36--41.  ",
      "doi": "10.1109/MPRV.2004.1316816"
    },
    {
      "text": "Olivier, P., and Wallace, J. Digital technologies and the emotional family. International Journal of Human Computer Studies, 67(2), 2009, 204 -- 214.  ",
      "doi": "10.1016/j.ijhcs.2008.09.009"
    },
    {
      "text": "Orpwood, R. et al. Designing technology to support quality of life of people with dementia. Technology and Disability, 19, 2007, 103--112.",
      "doi": ""
    },
    {
      "text": "Salvage, J. The theory and practice of the 'New Nursing'. Nursing Times, 86, 1990, 42--45.",
      "doi": ""
    },
    {
      "text": "Schaefer, M.T., and Olson, D.H. Assessing intimacy: the pair inventory. Journal of Marital and Family Therapy, 7(1), 1981, 47--60.",
      "doi": ""
    },
    {
      "text": "Thieme, A., et al. Lover's box: Designing for reflection within romantic relationships. International Journal of Human Computer Studies, 69(5), 2011, 283--297.  ",
      "doi": "10.1016/j.ijhcs.2010.12.006"
    },
    {
      "text": "Tornatore, J.B., and Grant, L.A. Burden among family caregivers of persons with Alzheimer's disease in nursing homes. The Gerontologist, 42(4), 2002, 497--506.",
      "doi": ""
    },
    {
      "text": "Wallace, J., Dearden, A., and Fischer, T. The significant other: the value of jewellery in the conception, design and experience of body focused digital devices. AI & Soc, 22, 2007, 53--62.  ",
      "doi": "10.5555/1284260.1284261"
    },
    {
      "text": "3Wallace, J., McCarthy, J., Wright, P. and Olivier, P. Beyond reminiscing: Looking back to look forward in dementia. CHI 2011 Workshop on Bridging Practices to Support Reminiscence.",
      "doi": ""
    },
    {
      "text": "http://www.cs.cornell.edu/~danco/remchiwork/papers/Wallace_CHI2011_wkshp.pdf",
      "doi": ""
    },
    {
      "text": "3Watzlawik, P., Beavin, J.H., and Jackson, D.D., Menschliche Kommunikation: Formen, Stoerungen, Paradoxien. Hans Huber, Vol. 10. 2003, 1--170.",
      "doi": ""
    },
    {
      "text": "3Williams, A. A literature review on the concept of intimacy in nursing. Journal of Advanced Nursing, 33(5), 2001, 660--667.",
      "doi": ""
    },
    {
      "text": "Wimo, A. and Prince, M., World Alzheimer Report: The Global Economic Impact of Dementia, Alzheimer's Disease International (ADI), London, 2010.",
      "doi": ""
    },
    {
      "text": "Wright, P., Wallace, J. and McCarthy, J. Aesthetics and experience-centred design. ACM Trans. Computer-Human Interactions, 15 (4), 2008, 1 -- 21.  ",
      "doi": "10.1145/1460355.1460360"
    }
  ]
}