{
  "doi": "10.1145/2207676.2208368",
  "title": "ZeroTouch: an optical multi-touch and free-air interaction architecture",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2165-2174",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "ZeroTouch (ZT) is a unique optical sensing technique and architecture that allows precision sensing of hands, fingers, and other objects within a constrained 2-dimensional plane. ZeroTouch provides tracking at 80 Hz, and up to 30 concurrent touch points. Integration with LCDs is trivial. While designed for multi-touch sensing, ZT enables other new modalities, such as pen+touch and free-air interaction. In this paper, we contextualize ZT innovations with a review of other flat-panel sensing technologies. We present the modular sensing architecture behind ZT, and examine early diverse uses of ZT sensing.",
  "tags": [
    "zerotouch",
    "multi-touch",
    "free-air",
    "interaction",
    "sensing"
  ],
  "authors": [
    {
      "name": "Jon Moeller",
      "institution": "Texas A&M University, College Station, Texas, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435604178",
      "orcid": "missing"
    },
    {
      "name": "Andruid Kerne",
      "institution": "Texas A&M University, College Station, Texas, United States",
      "img": "/do/10.1145/contrib-81100203284/rel-imgonly/andruidamusebouche1.jpg",
      "acmid": "81100203284",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarawala, A. and Balakrishnan, R. 2006. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. CHI '06: Proceedings of the SIGCHI conference on Human Factors in computing systems (April 2006).  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Bau, O. et al. 2010. TeslaTouch: electrovibration for touch surfaces. UIST '10: Proceedings of the 23nd annual ACM symposium on User interface software and technology (October 2010).  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Echtler, F. et al. 2009. A Short Guide to Modulated Light. Proc. TEI 2009 (Cambridge, United Kingdom, 2009).  ",
      "doi": "10.1145/1517664.1517742"
    },
    {
      "text": "Echtler, F. et al. 2009. Inverted FTIR: Easy Multitouch Sensing for Flatscreens. Proc. ITS 2009 (Banff, Canada, 2009).  ",
      "doi": "10.1145/1731903.1731909"
    },
    {
      "text": "Echtler, F. et al. 2010. An LED-based multitouch sensor for LCD screens. Proc. TEI 2010 (Cambridge, Massachusetts, USA, 2010).  ",
      "doi": "10.1145/1709886.1709930"
    },
    {
      "text": "Han, J.Y. 2005. Low-cost multi-touch sensing through frustrated total internal reflection. Proc. UIST 2005 (Seattle, WA, USA, 2005).  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hinckley, K. et al. 2010. Pen + Touch = New Tools. Proc. UIST 2010 (New York, NY, USA, 2010)  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Hodges, S. et al. 2007. ThinSight: versatile multi-touch sensing for thin form-factor displays. Proc. UIST 2007 (Newport, Rhode Island, USA, 2007).  ",
      "doi": "10.1145/1294211.1294258"
    },
    {
      "text": "Hofer, R. et al. 200 FLATIR: FTIR multi-touch detection on a discrete distributed sensor array. Proc. TEI 2009 (Cambridge, United Kingdom, 2009).  ",
      "doi": "10.1145/1517664.1517730"
    },
    {
      "text": "Jovanovic, N. and Korst, J. 2008. Minimum blocking sets of circles for a set of lines in the plane. Proc. CCCG 2008.",
      "doi": ""
    },
    {
      "text": "1Jovanovic, N. et al. 2009. Object Detection in Flatland. ADVCOMP '09 (2009), 95--100.  ",
      "doi": "10.1109/ADVCOMP.2009.21"
    },
    {
      "text": "Jovanovic, N. et al. 2009. Candle in the woods: asymptotic bounds on minimum blocking sets. SCG '09: Proceedings of the 25th annual symposium on Computational geometry (June 2009).  ",
      "doi": "10.1145/1542362.1542394"
    },
    {
      "text": "Microsoft Surface. http://www.surface.com/.",
      "doi": ""
    },
    {
      "text": "Moeller, J. and Kerne, A. 2010. Scanning FTIR: unobtrusive optoelectronic multi-touch sensing through waveguide transmissivity imaging. Proc. TEI 2010 (Cambridge, Massachusetts, USA, 2010).  ",
      "doi": "10.1145/1709886.1709900"
    },
    {
      "text": "Moeller, J. et al. 2011. intangibleCanvas: free-air finger painting on a projected canvas. CHI EA '11: Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems (May 2011).  ",
      "doi": "10.1145/1979742.1979817"
    },
    {
      "text": "Moeller, J. et al. 2011. ZeroTouch: a zero-thickness optical multi-touch force field. CHI EA '11: Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems (May 2011).  ",
      "doi": "10.1145/1979742.1979710"
    },
    {
      "text": "Smart Technologies DViT. http://www.smart-technologies.com/dvit.html.",
      "doi": ""
    },
    {
      "text": "Takeoka, Y. and Miyaki, T. 2010. Z-touch: an infrastructure for 3d gesture interaction in the proximity of tabletop surfaces. Proc. ITS 2010 (2010).  ",
      "doi": "10.1145/1936652.1936668"
    },
    {
      "text": "The Power of PixelSense\". http://www.microsoft.com/surface/en/us/pixelsense.aspx.",
      "doi": ""
    },
    {
      "text": "ZIGELBAUM + COELHO - Timepiece Explorer.",
      "doi": ""
    }
  ]
}