{
  "doi": "10.1145/2207676.2208400",
  "title": "Video kids: augmenting close friendships with asynchronous video conversations in videopal",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2387-2396",
  "year": 2012,
  "badges": [],
  "abstract": "Consumer-based synchronous video communication is on the rise and is viewed as a valuable medium to support long distance relationships. We were interested in the potential of asynchronous video to augment children's close friendships and what types of activities they would engage in using video. We explored both of these concepts through a 9-week field study with a group of six 9-10 year old girls. We see children as potential media trendsetters when it comes to video communication given their comfort with video and desire for rich social interactions. The results from this study were striking. Despite having frequent face-to-face interactions, the girls used our asynchronous video communication tool extensively to augment their existing relationships. Not only were they able to have rich conversations using asynchronous video, they also demonstrated a strong desire to share more than just a \"talking head\". The results from this work point to the need for video mediated communication to move beyond conversations, to the sharing of rich experiences.",
  "authors": [
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Honglu Du",
      "institution": "Pennsylvania State University, University Park, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416605029",
      "orcid": "missing"
    },
    {
      "name": "Asta Roseway",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100432875",
      "orcid": "0000-0001-5340-8518"
    },
    {
      "name": "Aaron Hoff",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592774",
      "orcid": "missing"
    },
    {
      "name": "Paul Johns",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608130",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M. G., Go, J., Kaye, J. J. and Spasojevic, M., Making love in the network closet: the benefits and work of family video chat. Proc. CSCW 2010, 145--154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Barksdale, J., Inkpen, K., Hoff, A., Johns, P., Roseway, A., Czerwinski, M. Tang, J., and Venolia, G. Video Threads: Asynchronous video sharing for temporally distributed teams. Proc. CSCW 2012.  ",
      "doi": "10.1145/2145204.2145367"
    },
    {
      "text": "Bruner, J. S. The Ontogenesis of speech acts. Journal of Children Language, 2(1975), 1--40.",
      "doi": ""
    },
    {
      "text": "Cao, X., Sellen, A., Brush, A. J., Kirk, D. Edge, D., and Ding, X. Understanding family communication across time zones, Proc. CSCW 2010, 155--158.  ",
      "doi": "10.1145/1718918.1718947"
    },
    {
      "text": "Clark, H. H., & Brennan, S. E. Grounding in Communication. Perspectives on Social Shared Cognition. American Psychological Association, Washington, DC, 1991.",
      "doi": ""
    },
    {
      "text": "Daft, R. and Lengel, R. Information richness: A new approach to managerial behavior and organization design. In Staw and Cummings (Eds.): Research in Organizational Behavior, JAI Press, Greenwich, CT, 1984, 191--233.",
      "doi": ""
    },
    {
      "text": "Du, H., Inkpen, K., Chorianopoulos, K., Czerwinski, M., Johns, P., Hoff, A., Roseway, A., Morlidge, S., Tang, J., and Gross, T. VideoPal: Exploring asynchronous video-messaging to enable cross-cultural friendships. Proc. ECSCW 2011.",
      "doi": ""
    },
    {
      "text": "Ekman, P. and Friesen, W. Nonverbal behavior in psychotherapy research. Research in Psychotherapy: Proceeding of the Third Conference, 3(1968), 179--183.",
      "doi": ""
    },
    {
      "text": "Isaac, E. A., and Tang, J. What video can and cannot do for collaboration: a case study. Multimedia Systems, 2(2), 1994, 63--73.  ",
      "doi": "10.1007/BF01274181"
    },
    {
      "text": "Judge, T. K., Neustaedter, C., Harrison, S., and Blose, A. Family portals: Connecting families through a multifamily media space. Proc. CHI 2011, 1205--1214.  ",
      "doi": "10.1145/1978942.1979122"
    },
    {
      "text": "Judge, T. K., Neustaedter, C. and Kurtz, A. F. The family window: the design and evaluation of a domestic media space. Proc. CHI 2010, 2361--2370.  ",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Kirk, D. S., Sellen, A. and Cao, X., Home video communication: Mediating Closeness. Proc. CSCW 2010, 135--144.  ",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "Littlejohn, S. Theories of Human Communication. Wadsworth, 2002.",
      "doi": ""
    },
    {
      "text": "Mehrabian, A. Nonverbal Communication. AldineAtherton, Chicago, IN, USA, 1972.",
      "doi": ""
    },
    {
      "text": "Modlitba, P., and Schmandt, C. Globetoddler: Designing for remote interaction between preschoolers and their traveling parents, CHI 2008 Extend Abstracts, 3057--3062.  ",
      "doi": "10.1145/1358628.1358807"
    },
    {
      "text": "Moore, K. 71% of online adults now use video-sharing sites. Pew Internet & American Life Project, 7/25/2011, http://pewinternet.org/Reports/2011/Video-sharing-sites.aspx, accessed on 9/21/2011.",
      "doi": ""
    },
    {
      "text": "Piaget, J. The Language and Thought of the Child. Harcourt, Brace & Company, Inc., NY, USA, 1926.",
      "doi": ""
    },
    {
      "text": "Potamianos, A. Robust recognition of children's speech. IEEE Transactions on speech and audio processing, Vol 11(6), (2003), 603--616.",
      "doi": ""
    },
    {
      "text": "Prasad A., Medhi I., Toyama, K., and Ravin, B. Exploring the feasibility of video mail for illiterate users. Proc. AVI '08. 103--110.  ",
      "doi": "10.1145/1385569.1385588"
    },
    {
      "text": "Raffle, H., Ballagas, R., Revelle, G., Mori, K., Horii, H., Paretti, C., and Spasojevic, C. Pop goes the cell phone: asynchronous messaging for preschoolers. Proc. IDC 2011, 99--108.  ",
      "doi": "10.1145/1999030.1999042"
    },
    {
      "text": "Rideout, V. J., Foehr, U. G., and Roberts, D. F. Generation M2: Media in the lives of 8- to 18-Yea-rOlds. A Kaiser Family Foundation Study, January 2010. http://www.kff.org/entmedia/upload/8010.pdf, accessed on 9/21/2011.",
      "doi": ""
    },
    {
      "text": "Romero, N., Markopoulos, P., van Baren, J., de Ruyter, B., Jsselsteijn, W., and Frashchian, B. Connecting the family with awareness systems. Personal and Ubiquitous Computing, 11, Springer (2009), 303--329.  ",
      "doi": "10.1007/s00779-006-0089-0"
    },
    {
      "text": "Short, J., Williams, E. & Christie, B. The Social Psychology of Telecommunication. John Wiley, London, England, 1976.",
      "doi": ""
    },
    {
      "text": "Tee, K., Brush, A. J., and Inkpen, K. M. Exploring communication and sharing between extended families, International Journal of Human-Computer Studies, 67(2), 2009, 128--138.  ",
      "doi": "10.1016/j.ijhcs.2008.09.007"
    },
    {
      "text": "Yarosh, S., and Abowd, G. D. Mediated parent-child contact in work-separated families. Proc. CHI 2011, 1185--1194.  ",
      "doi": "10.1145/1978942.1979120"
    },
    {
      "text": "Yarosh, S., Inkpen, K. M., and Brush A. J. Video playdate: Toward free play across distance. Proc. CHI 2010, 1251--1260.  ",
      "doi": "10.1145/1753326.1753514"
    },
    {
      "text": "Valkenburg, P. M. and Peter, J. The Effects of Instant Messaging on the Quality of Adolescents' Existing Friendships: A Longitudinal Study. Journal of communication Y. 2009, vol. 59, No. 1.",
      "doi": ""
    },
    {
      "text": "Zuckerman, O. and Maes, P. Awareness system for children in distributed families. Proc. Interaction Design for Children 2005. Poster.",
      "doi": ""
    }
  ]
}