{
  "doi": "10.1145/2207676.2208610",
  "title": "Profanity use in online communities",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1481-1490",
  "year": 2012,
  "badges": [],
  "abstract": "As user-generated Web content increases, the amount of inappropriate and/or objectionable content also grows. Several scholarly communities are addressing how to detect and manage such content: research in computer vision focuses on detection of inappropriate images, natural language processing technology has advanced to recognize insults. However, profanity detection systems remain flawed. Current list-based profanity detection systems have two limitations. First, they are easy to circumvent and easily become stale - that is, they cannot adapt to misspellings, abbreviations, and the fast pace of profane slang evolution. Secondly, they offer a one-size fits all solution; they typically do not accommodate domain, community and context specific needs. However, social settings have their own normative behaviors - what is deemed acceptable in one community may not be in another. In this paper, through analysis of comments from a social news site, we provide evidence that current systems are performing poorly and evaluate the cases on which they fail. We then address community differences regarding creation/tolerance of profanity and suggest a shift to more contextually nuanced profanity detection systems.",
  "tags": [
    "comment threads",
    "profanity",
    "negativity",
    "community management",
    "user-generated content",
    "online communities"
  ],
  "authors": [
    {
      "name": "Sara Sood",
      "institution": "Pomona College, Claremont, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385595965",
      "orcid": "missing"
    },
    {
      "name": "Judd Antin",
      "institution": "Yahoo! Research, Santa Clara, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430623055",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Churchill",
      "institution": "Yahoo! Research, Santa Clara, California, United States",
      "img": "/do/10.1145/contrib-81100143170/rel-imgonly/elizabethchurchill.jpeg",
      "acmid": "81100143170",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boyd, D. and Marwick, A. Why Cyberbullying Rhetoric Misses the Mark. The New York Times, 2011. http://www.nytimes.com/2011/09/23/opinion/whycyberbullying-rhetoric-misses-the-mark.html.",
      "doi": ""
    },
    {
      "text": "Callison-Burch, C. Fast, cheap, and creative: evaluating translation quality using Amazon's Mechanical Turk. Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, (2009). ",
      "doi": "10.5555/1699510.1699548"
    },
    {
      "text": "Dinakar, K., Reichart, R., and Lieberman, H. Modeling the Detection of Textual Cyberbullying. Proceedings of International AAAI Conference on Weblogs and Social Media, Workshop \"Social Mobile Web,\" (2011).",
      "doi": ""
    },
    {
      "text": "Fleck, M. M., Forsyth, D. A., and Bregler, C. Finding Naked People. European Conference on Computer Vision II, (1996), 592--602. ",
      "doi": "10.5555/645310.649014"
    },
    {
      "text": "Hammami, M., Chahir, Y., and Chen, L. WebGuard: a Web filtering engine combining textual, structural, and visual content-based analysis. IEEE Transactions on Knowledge and Data Engineering 18, (2006), 272--284.  ",
      "doi": "10.1109/TKDE.2006.34"
    },
    {
      "text": "Haninger, K. and Thompson, K. M. Content and Ratings of Teen-Rated Video Games. JAMA: The Journal of the American Medical Association 291, 7 (2004), 856--865.",
      "doi": ""
    },
    {
      "text": "Ivory, J. D., Williams, D., Martins, N., and Consalvo, M. Good clean fun? A content analysis of profanity in video games and its prevalence across game systems and ratings. Cyberpsychology & Behavior: The Impact of the Internet, Multimedia and Virtual Reality on Behavior and Society 12, 4 (2009), 457--460.",
      "doi": ""
    },
    {
      "text": "Jacob, V., Krishnan, R., Ryu, Y., Chandrasekaran, R., and Hong, S. Filtering objectionable internet content. Proceeding ICIS '99 Proceedings of the 20th international conference on Information Systems, (1999). ",
      "doi": "10.5555/352925.352950"
    },
    {
      "text": "Jacob, V. S., Krishnan, R., and Ryu, Y. U. Internet content filtering using isotonic separation on content category ratings. ACM Transactions on Internet Technology 7, (2007), 1-es.  ",
      "doi": "10.1145/1189740.1189741"
    },
    {
      "text": "Joachims, T. Text categorization with Support Vector Machines: Learning with many relevant features. In C. Nédellec and C. Rouveirol, eds., Machine Learning: ECML- Springer-Verlag, Berlin/Heidelberg, 1998, 137--142. ",
      "doi": "10.5555/645326.649721"
    },
    {
      "text": "Jones, M. J. and Rehg, J. M. Statistical color models with application to skin detection. INTERNATIONAL JOURNAL OF COMPUTER VISION 46, (1999), 274--280.  ",
      "doi": "10.1023/A%3A1013200319198"
    },
    {
      "text": "Laboreiro, G., Sarmento, L., Teixeira, J., and Oliveira, E. Tokenizing micro-blogging messages using a text classification approach. Proceedings of the fourth workshop on Analytics for noisy unstructured text data, ACM (2010), 81--88.  ",
      "doi": "10.1145/1871840.1871853"
    },
    {
      "text": "Levenshtein, V. I. Binary codes capable of correcting deletions, insertions, and reversals. Soviet Physics Doklady 10, 8 (1966), 707--710.",
      "doi": ""
    },
    {
      "text": "Li, Q. Cyberbullying in Schools. School Psychology International 27, 2 (2006), 157 -170.",
      "doi": ""
    },
    {
      "text": "Lou, J. K., Chen, K. T., and Lei, C. L. A collusion-resistant automation scheme for social moderation systems. IEEE Consumer Communications and Networking Conference, 2009., (2009), 571--575. ",
      "doi": "10.5555/1700527.1700681"
    },
    {
      "text": "Nguyen, D. and Rose, Carolyn. Language use as a reflection of socialization in online communities. Proceedings of the Workshop on Language in Social Media., (2011). ",
      "doi": "10.5555/2021109.2021119"
    },
    {
      "text": "Sheng, V. S., Provost, F., and Ipeirotis, P. G. Get another label? improving data quality and data mining using multiple, noisy labelers. Proceeding of the 14th ACM SIGKDD international conference on Knowledge discovery and data mining - KDD '08, (2008), 614.  ",
      "doi": "10.1145/1401890.1401965"
    },
    {
      "text": "Siersdorfer, S., Chelaru, S., Nejdl, W., and San Pedro, J. How useful are your comments?: analyzing and predicting youtube comments and comment ratings. Proceedings of the 19th international conference on World wide web, (2010), 891--900.  ",
      "doi": "10.1145/1772690.1772781"
    },
    {
      "text": "Sood, S. O., Churchill, E., and Antin, J. Automatic identification of personal insults on social news sites. Journal of the American Society for Information Science and Technology, (2011).  ",
      "doi": "10.1002/asi.21690"
    },
    {
      "text": "Spertus, E. Smokey: Automatic Recognition of Hostile Messages. IN PROC. IAAI, (1997), 1058--1065. ",
      "doi": "10.5555/1867406.1867616"
    },
    {
      "text": "Sukumaran, A., Vezich, S., McHugh, M., and Nass, C. Normative influences on thoughtful online participation. Proceedings of the 2011 annual conference on Human factors in computing systems, ACM (2011), 3401--3410.  ",
      "doi": "10.1145/1978942.1979450"
    },
    {
      "text": "Tetreault, J. R., Filatova, E., and Chodorow, M. Rethinking Grammatical Error Annotation and Evaluation with the Amazon Mechanical Turk. Proceedings of the NAACL HLT 2010 Fifth Workshop on Innovative Use of NLP for Building Educational Applications, (2010), 45--48. ",
      "doi": "10.5555/1866795.1866801"
    },
    {
      "text": "Wang, J. Z., Li, J., Wiederhold, G., and Firschein, O. System for Screening Objectionable Images. COMPUTER COMMUNICATIONS JOURNAL 21, (1998), 1355--1360.  ",
      "doi": "10.1016/S0140-3664%2898%2900203-5"
    },
    {
      "text": "Yin, D., Xue, Z., Hong, L., Davison, B., Kontostathis, A., and Edwards, L. Detection of Harassment on Web 2.0. Proceedings of the Content Analysis in the WEB 2.0 (CAW2.0) Workshop at WWW2009, (2009).",
      "doi": ""
    },
    {
      "text": "Yoon, T., Park, S.-Y., and Cho, H.-G. A Smart Filtering System for Newly Coined Profanities by Using Approximate String Alignment. Proceedings of the 2010 10th IEEE International Conference on Computer and Information Technology, IEEE Computer Society (2010), 643--650.  ",
      "doi": "10.1109/CIT.2010.129"
    }
  ]
}