{
  "doi": "10.1145/2207676.2207772",
  "title": "The dubuque water portal: evaluation of the uptake, use and impact of residential water consumption feedback",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "675-684",
  "year": 2012,
  "badges": [],
  "abstract": "The Dubuque Water Portal is a system aimed at supporting voluntary reductions of water consumption that is intended to be deployed city-wide. It provides each household with fine-grained, near real time feedback on their water consumption, as well as using techniques like social comparison, weekly games, and news and chat to encourage water conservation. This study used logs, a survey and interviews to evaluate a 15-week pilot with 303 households. It describes the Portal's design, and discusses its adoption, use and impacts. The system resulted in a 6.6% decrease in water consumption, and the paper employs qualitative methods to look at the ways in which the Portal was (or wasn't) effective in supporting its users and enabling them to reduce their consumption. The paper concludes with a discussion of design implications for residential feedback systems, and possible engagement models.",
  "authors": [
    {
      "name": "Thomas Erickson",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, United States",
      "img": "/do/10.1145/contrib-81100235869/rel-imgonly/tom_sol_prtl_pic_183pxsq.jpg",
      "acmid": "81100235869",
      "orcid": "missing"
    },
    {
      "name": "Mark Podlaseck",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100011274",
      "orcid": "missing"
    },
    {
      "name": "Sambit Sahu",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100188072",
      "orcid": "missing"
    },
    {
      "name": "Jing D. Dai",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659660842",
      "orcid": "missing"
    },
    {
      "name": "Tian Chao",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452598656",
      "orcid": "missing"
    },
    {
      "name": "Milind Naphade",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100323855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arroyo, E., Bonanni, L., Selker, T. Waterbot: exploring feedback and persuasive techniques at the sink. Proc. CHI 2005, ACM (2005), 631--639.  ",
      "doi": "10.1145/1054972.1055059"
    },
    {
      "text": "Blevis, E. Sustainable interaction design: Invention & disposal, renewal & reuse. Proc. CHI 2007, ACM (2007), 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Brown, L. Outgrowing the Earth: The Food Security Challenge in an Age of Falling Water Tables and Rising Temperatures. Norton, 2005.",
      "doi": ""
    },
    {
      "text": "Chen, F., Dai, J., Wang, B., Sahu, S., Naphade, M. and Lu, C. Activity Analysis Based on Low Sample Rate Smart Meters. Proc. Intl. Conf. on Knowledge Discovery and Data Mining. ACM (2011), 240--248.  ",
      "doi": "10.1145/2020408.2020450"
    },
    {
      "text": "Darby, S. The effectiveness of feedback on energy consumption. 2006. http://www.eci.ox.ac.uk/research/energy/electricmetering.php. Accessed 9-11-11.",
      "doi": ""
    },
    {
      "text": "Darby, S. Social learning and public policy: Lessons from an energy-conscious village. Energy Policy 34 (2006), 2929--2940.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. Mapping the landscape of sustainable HCI. Proc. CHI 2010, ACM (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "IBM Research. Smart Water Pilot Report. June 10, 2011. {Public report} http://www.cityofdubuque.org/DocumentView.aspx?DID=3116. Accessed 9-11-11.",
      "doi": ""
    },
    {
      "text": "ICF International. Water and Energy: Leveraging Voluntary Programs to Save Both Water and Energy. March 2008. http://water.epa.gov/scitech/wastetech/upload/Final-Report-Mar-2008.pdf. Accessed 9-11-11.",
      "doi": ""
    },
    {
      "text": "IEEE. Water Vs. Energy: Special Report. IEEE Spectrum, 47:6, June 2010.  ",
      "doi": "10.1109/MSPEC.2010.5466788"
    },
    {
      "text": "Froehlich, J., Findlater, L., and Landay, J. The design of eco-feedback technology. Proc. CHI 2010. ACM (2010), 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Kappel, K. and Grechenig, T. \"show-me\": Water consumption at a glance to promote water conservation in the shower. Proc. Pervasive 2009. ACM (2009), 1--6.  ",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "Kuznetsov, S. and Paulos, E. 2010. UpStream: motivating water conservation with low-cost water flow sensing and persuasive displays. Proc. CHI 2010, ACM (2010), 1851--1860.  ",
      "doi": "10.1145/1753326.1753604"
    },
    {
      "text": "Petersen, J. E., V. Shunturov, K. Janda, G. Platt, K. Weinberger. Combining real-time feedback on resource use with incentives stimulates dormitory residents to reduce electricity consumption. Int. J. of Sustainability in Higher Education, 8, (2007), 16--33.",
      "doi": ""
    },
    {
      "text": "Pierce, J., Odom, W., and Blevis, E. Energy aware dwelling: A critical survey of interaction design for ecovisualizations. Proc. OZCHI 2008, ACM (2008), 1--8.  ",
      "doi": "10.1145/1517744.1517746"
    },
    {
      "text": "Pierce, J., Fan, C., Lomas, D., Marcu, G. and Paulos, E. Some consideration on the (in)effectiveness of residential energy feedback systems. Proc. DIS 2010, ACM (2010), 244--247.  ",
      "doi": "10.1145/1858171.1858215"
    },
    {
      "text": "Strengers, Y. Designing eco-feedback systems for everyday life. Proc. CHI 2011. ACM (2011) 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "UNICEF. UNICEF Handbook on Water Quality. 2008. http://www.unicef.org/wash/files/WQ_Handbook_final_signed_16_April_2008.pdf. Accessed 9-11-11.",
      "doi": ""
    },
    {
      "text": "UN Water. Coping with Water Scarcity - Challenge of the Twenty-first Century. UN Water, 2007. http://www.fao.org/nr/water/docs/escarcity.pdf. Accessed 9-11-11.",
      "doi": ""
    }
  ]
}