{
  "doi": "10.1145/2207676.2208415",
  "title": "Easing the generation of predictive human performance models from legacy systems",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2489-2498",
  "year": 2012,
  "badges": [],
  "abstract": "With the rise of tools for predictive human performance modeling in HCI comes a need to model legacy applications. Models of legacy systems are used to compare products to competitors, or new proposed design ideas to the existing version of an application. We present CogTool-Helper, an exemplar of a tool that results from joining this HCI need to research in automatic GUI testing from the Software Engineering testing community. CogTool-Helper uses automatic UI-model extraction and test case generation to automatically create CogTool storyboards and models and infer methods to accomplish tasks beyond what the UI designer has specified. A design walkthrough with experienced CogTool users reveal that CogTool-Helper resonates with a \"pain point\" of real-world modeling and provide suggestions for future work.",
  "authors": [
    {
      "name": "Amanda Swearngin",
      "institution": "University of Nebraska-Lincoln, Lincoln, Nebraska, United States",
      "img": "/do/10.1145/contrib-81488669260/rel-imgonly/avatar.jpg",
      "acmid": "81488669260",
      "orcid": "missing"
    },
    {
      "name": "Myra Cohen",
      "institution": "University of Nebraska-Lincoln, Lincoln, Nebraska, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100147227",
      "orcid": "missing"
    },
    {
      "name": "Bonnie John",
      "institution": "IBM T. J. Watson Research Center, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "Rachel Bellamy",
      "institution": "IBM T. J. Watson Research Center, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100257325",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R., Bothell, D., Byrne, M. D., Douglass, S., Lebiere, C., and Qin, Y. (2004) An integrated theory of the mind. Psychological Review 111, 4, 1036--1060.",
      "doi": ""
    },
    {
      "text": "Bellamy, R., John, B. E., Kogan, S. (2011) Deploying CogTool: Integrating quantitative usability assessment into real-world software development. Proceeding of the 33rd International Conference on Software Engineering (ICSE '11). ACM, New York, NY, USA, 691--700.  ",
      "doi": "10.1145/1985793.1985890"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. 1983. The Psychology of Human-Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chang, T., Yeh, T., and Miller, R. C. (2010) GUI testing using computer vision, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1535--1544.  ",
      "doi": "10.1145/1753326.1753555"
    },
    {
      "text": "Gray, W. D., John, B. E., & Atwood, M. E. (1993) Project Ernestine: Validating a GOMS analysis for predicting and explaining real-world task performance. Human-Computer Interaction, 8, 237--309.  ",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "Grechanik, M. Xie, Q. and Fu C. (2009) Creating GUI testing tools using accessibility technologies, Software Testing Verification and Validation Workshop, 243--250.  ",
      "doi": "10.1109/ICSTW.2009.31"
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D. D., and Koedinger, K. 2004. Predictive human performance modeling made easy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 455--462.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "Kieras, D. E. (1999). A Guide to GOMS Model Usability Evaluation using GOMSL and GLEAN3. University of Michigan. Available at: ftp://www.eecs.umich.edu/people/kieras/GOMS/GOMSL_Guide.pdf",
      "doi": ""
    },
    {
      "text": "Knight, A., Pyrzak, G., and Green, C. 2007. When two methods are better than one: combining user study with cognitive modeling. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1783--1788.  ",
      "doi": "10.1145/1240866.1240900"
    },
    {
      "text": "Memon, A. M. (2002), GUI testing: pitfalls and process, IEEE Computer, 35(8), 87--88.  ",
      "doi": "10.1109/MC.2002.1023795"
    },
    {
      "text": "Memon, A. M. (2011) GUITAR- A GUI testing framework, available at: http://guitar.sourceforge.net.",
      "doi": ""
    },
    {
      "text": "Memon, A. M. (2011) TerpOffice, available at: http://www.cs.umd.edu/~atif/TerpOffice/",
      "doi": ""
    },
    {
      "text": "Memon, A. M., Banerjee, I and Nagarajan, A. (2003) GUI Ripping: Reverse engineering of graphical user interfaces for testing, In Proceedings of The 10th Working Conference on Reverse Engineering, 260--269. ",
      "doi": "10.5555/950792.951350"
    },
    {
      "text": "Memon, A. M., Pollack, M. E. and Soffa, M. L. (2001) Hierarchical GUI test case generation using automated planning, IEEE Transactions on Software Engineering, 27(2), 144--155.  ",
      "doi": "10.1109/32.908959"
    },
    {
      "text": "Monkiewicz, J. (1992). CAD's next-generation user interface. Computer-Aided Engineering, November, 1992, 55--56.",
      "doi": ""
    },
    {
      "text": "Pirolli, P. and Card, S. K. (1999). Information foraging. Psychological Review, 106, 643--675.",
      "doi": ""
    },
    {
      "text": "St. Amant, R., and Riedl, M. O. (2001). A perception/action substrate for cognitive modeling in HCI. International Journal of Human-Computer Studies 55(1), 15--39.",
      "doi": "10.1006/ijhc.2001.0470"
    },
    {
      "text": "Teo, L., John, B. E., and Blackmon, M. H. (2012) CogTool-Explorer: A Model of Goal-Directed User Exploration that Considers Information Layout. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA.  ",
      "doi": "10.1145/2207676.2208414"
    },
    {
      "text": "White L. and Almezen, H. (2000). Generating test cases for GUI responsibilities using complete interaction sequences, in International Symposium on Software Reliability Engineering (ISSRE), 110--121. ",
      "doi": "10.5555/851024.856239"
    },
    {
      "text": "Yuan, X. and Memon. A. M. (2010). Generating event sequence-based test cases using GUI runtime state feedback. IEEE Transactions on Software Engineering, 36(1), 81--95.  ",
      "doi": "10.1109/TSE.2009.68"
    }
  ]
}