{
  "doi": "10.1145/2207676.2208614",
  "title": "Twitter and the development of an audience: those who stay on topic thrive!",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1515-1518",
  "year": 2012,
  "badges": [],
  "abstract": "Although economists have long recognized the importance of a critical mass in growing a community, we know little about how it is achieved. This paper examines how initial topical focus influences communities' ability to attract a critical mass. When starting an online community, organizers need to define its initial scope. Topically narrow communities will probably attract a homogeneous group of interested in its content and compatible with each other. However, they are likely to attract fewer members than a diverse one because they offer only a subset of the topics. This paper reports an empirical analysis of longitudinal data collected from Twitter, where each new Twitter poster is considered the seed of a potential social collection. Users who focus the topics of their early tweets more narrowly ultimately attract more followers with more ties among them. Our results shed light on the development of online social networking structures.",
  "authors": [
    {
      "name": "Yi-Chia Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384593188",
      "orcid": "missing"
    },
    {
      "name": "Robert Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    }
  ],
  "references": [
    {
      "text": "Adamic, L. A., Zhang, J., Bakshy, E., & Ackerman, M. S. (2008). Knowledge sharing and Yahoo Answers: Everyone knows something. In Proc. WWW 2008, 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Blei, D., Ng, A., & Jordan, M. Latent Dirichlet allocation. (2003). Journal of Machine Learning Research, 3(Jan), 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Butler, B. S. (2001). Membership size, communication activity, and sustainability: A resource-based model of online social structures. Information Systems Research, 12(4), 346--362.  ",
      "doi": "10.1287/isre.12.4.346.9703"
    },
    {
      "text": "Hampton, K. N., Sessions, L., & Her, E. J. (2011). Core networks, social isolation, and new media: How Internet and mobile phone use is related to network size and diversity. Information, Communication & Society, 14(1).",
      "doi": ""
    },
    {
      "text": "Harper, F. M., Frankowski, D., Drenner, S., Ren, Y., Kiesler, S., Terveen, L., Kraut, R., & Riedl, J. (2007). Talk amongst yourselves: Inviting users to participate in online conversations. In Proc. ACM IUI07, 62--71.  ",
      "doi": "10.1145/1216295.1216313"
    },
    {
      "text": "Katz, M. L., & Shapiro, C. (1985). Network Externalities, competition, and compatibility. American Economic Review, 75(3), 424--440.",
      "doi": ""
    },
    {
      "text": "Markus, L. (1987). Towards a \"critical mass\" theory of interactive media: Universal access, interdependence, and diffusion. Communication Research, 14(5), 491--511.",
      "doi": ""
    },
    {
      "text": "McMillan, D., & Chavis, D. (1986). Sense of community: A definition and theory. Journal of Community Psychology, 14(1), 6--23.",
      "doi": "10.1002/1520-6629%28198601%2914%3A1"
    },
    {
      "text": "McPherson, J. M., Smith-Lovin, L., & Cook, J. M. (2001). Birds of a feather: Homophily in social networks. Annual Review of Sociology, 27(1), 415--444.",
      "doi": ""
    },
    {
      "text": "Pew Internet. 8% of online Americans use Twitter. (2011). http://pewinternet.org/Reports/2010/Twitter-update-2010.aspx, retrieved on Feb 4, 2011.",
      "doi": ""
    },
    {
      "text": "Raban, D., Moldovan, M., & Jones, Q. (2010). An empirical study of critical mass and online community survival. In Proc. CHI 2010, 71--80.  ",
      "doi": "10.1145/1718918.1718932"
    },
    {
      "text": "Resnick, P., Chen, Y., Konstan, J., & Kraut, R. E. (In press). Starting new online communities. In R. E. Kraut & P. Resnick (Eds.), Building successful online communities: Evidence-based social design (pp. 231--289). Cambridge, MA: MIT Press.",
      "doi": ""
    }
  ]
}