{
  "doi": "10.1145/2207676.2207751",
  "title": "On saliency, affect and focused attention",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "541-550",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We study how the visual catchiness (saliency) of relevant information impacts user engagement metrics such as focused attention and emotion (affect). Participants completed tasks in one of two conditions, where the task-relevant information either appeared salient or non-salient. Our analysis provides insights into relationships between saliency, focused attention, and affect. Participants reported more distraction in the non-salient condition, and non-salient information was slower to find than salient. Lack-of-saliency led to a negative impact on affect, while saliency maintained positive affect, suggesting its helpfulness. Participants reported that it was easier to focus in the salient condition, although there was no significant improvement in the focused attention scale rating. Finally, this study suggests user interest in the topic is a good predictor of focused attention, which in turn is a good predictor of positive affect. These results suggest that enhancing saliency of user-interested topics seems a good strategy for boosting user engagement.",
  "authors": [
    {
      "name": "Lori McCay-Peet",
      "institution": "Dalhousie University, Halifax, Nova Scotia, Canada",
      "img": "/do/10.1145/contrib-81453653226/rel-imgonly/lori.jpg",
      "acmid": "81453653226",
      "orcid": "missing"
    },
    {
      "name": "Mounia Lalmas",
      "institution": "Yahoo! Research, Barcelona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100072366",
      "orcid": "missing"
    },
    {
      "name": "Vidhya Navalpakkam",
      "institution": "Yahoo! Research, Santa Clara, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100297402",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arapakis, J. M. Jose & P. D. Gray. Affective feedback: An investigation into the role of emotions in the information seeking process. In Proc. SIGIR2008, ACM press (2008), 395--402.  ",
      "doi": "10.1145/1390334.1390403"
    },
    {
      "text": "S. Attfield, G. Kazai, M. Lalmas & B. Piwowarski. Towards a science of user engagement (Position Paper), WSDM Workshop on User Modelling for Web Applications (2011).",
      "doi": ""
    },
    {
      "text": "M. Banerjee, M. Capozzoli, L. McSweeney, & D. Sinha. Beyond kappa: A review of interrater agreement measures. Canadian Journal of Statistics, 27, 1 (1999).",
      "doi": ""
    },
    {
      "text": "R. Carmi & L. Itti. Visual causes versus correlates of attentional selection in dynamic scenes. Vision Research, 46, 26 (2006).",
      "doi": ""
    },
    {
      "text": "J. Gwizdka & I. Lopatovska. The role of subjective factors in the information search process. JASIST, 60, 12 (2009).  ",
      "doi": "10.5555/1672983.1672999"
    },
    {
      "text": "M. H. Huang. Designing website attributes to induce experiential encounters. Computers in Human Behavior, 19, 4 (2003).",
      "doi": ""
    },
    {
      "text": "L. Itti and C. Koch. A saliency-based search mechanism for overt and covert shifts of visual attention. Vision Research, 40, 10--12 (2000), 1489--1506.",
      "doi": ""
    },
    {
      "text": "M. Jennings. Theory and models for creating engaging and immersive e-commerce websites. In Proc. SIGCPR 2000, ACM Press (2000).  ",
      "doi": "10.1145/333334.333358"
    },
    {
      "text": "C. Jennett, A. L. Cox, P. Cairns, S. Dhoparee, A. Epps, T. Tijs & A. Walton. Measuring and defining the experience of immersion in games. International Journal of HumanComputer Studies, 66, 9 (2008), 641--661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "A. Kittur, E. H. Chi & B. Suh. Crowdsourcing user studies with Mechanical Turk. In Proc. SIGCHI 2008, ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "I. Lopatovska. Searching for good mood: Examining relationships between search task and mood. American Society for Information Science and Technology, 46, 1 (2009), 1--13.",
      "doi": ""
    },
    {
      "text": "C. C. Marshall & F. M. Shipman. The ownership and reuse of visual media. In Proc. JCDL 2011, ACM Press (2011).  ",
      "doi": "10.1145/1998076.1998108"
    },
    {
      "text": "W. Mason & S. Suri. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods (2010), 1--23.",
      "doi": ""
    },
    {
      "text": "V. Navalpakkam & L. Itti. Search goal tunes visual features optimally. Neuron, 53, 4 (2007), 605--617.",
      "doi": ""
    },
    {
      "text": "T. P. Novak, D. L. Hoffman, & Y. Yiu-Fai. Measuring the Customer Experience in Online Environments: A Structural Modeling Approach. Marketing Science, 19, 1 (2000), 22--42.  ",
      "doi": "10.5555/2882592.2882595"
    },
    {
      "text": "H. L. O'Brien. Defining and Measuring Engagement in User Experiences with Technology. PhD Thesis, 2008.",
      "doi": ""
    },
    {
      "text": "H. L. O'Brien. Exploring user engagement in online news interactions. In Proc. ASIST 2011 (forthcoming).",
      "doi": ""
    },
    {
      "text": "H. O'Brien & E. Toms. The development and evaluation of a survey to measure user engagement. JASIST 61, 1 (2010).  ",
      "doi": "10.5555/1672957.1672978"
    },
    {
      "text": "S. Pace. A grounded theory of the flow experiences of Web users. International Journal of Human-Computer Studies, 60, 3 (2004), 327--363.  ",
      "doi": "10.1016/j.ijhcs.2003.08.005"
    },
    {
      "text": "K. Purcell, L. Rainie, A. Mitchell, T. Rosenstiel, & K. Olmstead. Understanding the Participatory News Consumer. Pew Internet & American Life Project (2010).",
      "doi": ""
    },
    {
      "text": "K. Overbeeke, T. Djajadiningrat, C. Hummels, S. Wensveen & J. Frens. Let's make things engaging. Funology. Kluwer, 2003.",
      "doi": ""
    },
    {
      "text": "R. Peters & L. Itti. Applying computational tools to predict gaze direction in interactive visual environments. ACM Transactions on Applied Perception (TAP), 5, 2 (2008).  ",
      "doi": "10.1145/1279920.1279923"
    },
    {
      "text": "B. G. Tabachnick & L. S. Fidell. Using Multivariate Statistics (4th ed.). Boston, MA: Allyn and Bacon, 2001.",
      "doi": ""
    },
    {
      "text": "A. Treisman & G. Gelade. A feature-integration theory of attention. Cognitive Psychology, 12, 1 (1980).",
      "doi": "10.1016/0010-0285%2880%2990005-"
    },
    {
      "text": "D. Watson, L. A. Clark & A. Tellegen. Development and validation of brief measures of positive and negative affect: The PANAS Scales. Journal of Personality and Social Psychology, 47 (1988).",
      "doi": ""
    },
    {
      "text": "J. Wolfe & T. Horowitz. What attributes guide the deployment of visual attention and how do they do it? Nature Reviews Neuroscience, 5, 6 (2004), 495--501.",
      "doi": ""
    }
  ]
}