{
  "doi": "10.1145/2207676.2208556",
  "title": "Comparing averages in time series data",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1095-1104",
  "year": 2012,
  "badges": [],
  "abstract": "Visualizations often seek to aid viewers in assessing the big picture in the data, that is, to make judgments about aggregate properties of the data. In this paper, we present an empirical study of a representative aggregate judgment task: finding regions of maximum average in a series. We show how a theory of perceptual averaging suggests a visual design other than the typically-used line graph. We describe an experiment that assesses participants' ability to estimate averages and make judgments based on these averages. The experiment confirms that this color encoding significantly outperforms the standard practice. The experiment also provides evidence for a perceptual averaging theory.",
  "tags": [
    "information visualization",
    "visualization evaluation",
    "line graphs",
    "colorfields"
  ],
  "authors": [
    {
      "name": "Michael Correll",
      "institution": "University of Wisconsin - Madison, Madison, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502658789",
      "orcid": "0000-0001-7902-3907"
    },
    {
      "name": "Danielle Albers",
      "institution": "University of Wisconsin - Madison, Madison, WI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466645205",
      "orcid": "missing"
    },
    {
      "name": "Steven Franconeri",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502804057",
      "orcid": "missing"
    },
    {
      "name": "Michael Gleicher",
      "institution": "University of Wisconsin - Madison, Madison, Madison, Wisconsin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100342764",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albers, D., Dewey, C., and Gleicher, M. Sequence surveyor: Leveraging overview for scalable genomic alignment visualization. In Visualization and Computer Graphics, IEEE Transactions on, vol. 17, IEEE (December 2011).  ",
      "doi": "10.1109/TVCG.2011.232"
    },
    {
      "text": "Alvarez, G. A., and Oliva, A. Spatial ensemble statistics are efficient codes that can be represented with reduced attention. Proceedings of the National Academy of Sciences 106 (2009), 7345--7350.",
      "doi": ""
    },
    {
      "text": "Ariely, D. Seeing sets: representation by statistical properties. Psychological Science 12 (2001), 157--162.",
      "doi": ""
    },
    {
      "text": "Best, L. A., Smith, L. D., and Stubbs, D. A. Perception of linear and nonlinear trends: using slope and curvature information to make trend discriminations. Perceptual and motor skills 104, 3 Pt 1 (June 2007), 707--21.",
      "doi": ""
    },
    {
      "text": "Brewer, C. Color use guidelines for data representation. In Proceedings of the Section on Statistical Graphics, American Statistical Association (1999), 55--60.",
      "doi": ""
    },
    {
      "text": "Chong, S. C., and Treisman, A. Representation of statistical properties. Vision Research 43 (2003), 393--404.",
      "doi": ""
    },
    {
      "text": "Cleveland, W. S., and McGill, R. Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods. Journal of the American Statistical Association 79, 387 (Sept. 1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Correll, M., Ghosh, S., O'Connor, D., and Gleicher, M. Visualizing virus population variability from next generation sequencing data. In 2011 IEEE Symposium on Biological Data Visualization (BioVis), IEEE (oct 2011), 135--142.  ",
      "doi": "10.1109/BioVis.2011.6094058"
    },
    {
      "text": "Eaton, C., Plaisant, C., and Drizd, T. Visualizing missing data: graph interpretation user study. Human-Computer Interaction-INTERACT 2005 (2005), 861--872.  ",
      "doi": "10.1007/11555261_68"
    },
    {
      "text": "Elmqvist, N., and Fekete, J.-D. Hierarchical aggregation for information visualization: Overview, techniques, and design guidelines. Visualization and Computer Graphics, IEEE Transactions on 16, 3 (may-june 2010), 439--454.  ",
      "doi": "10.1109/TVCG.2009.84"
    },
    {
      "text": "Franconeri, S., Bemis, D., and Alvarez, G. Number estimation relies on a set of segmented objects. Cognition 113, 1 (2009), 1--13.",
      "doi": ""
    },
    {
      "text": "Freeman, J., and Simoncelli, E. P. Metamers of the ventral stream. Nature Neuroscience, 9 (Sep 2011), 1195--1201. Advance online publication: 14 Aug 2011.",
      "doi": ""
    },
    {
      "text": "Hagh-Shenas, H., Kim, S., Interrante, V., and Healey, C. G. Weaving versus blending: a quantitative assessment of the information carrying capacities of two alternative methods for conveying multivariate data with color. Visualization and Computer Graphics, IEEE Transactions on 13, 6, 1270--7.  ",
      "doi": "10.1109/TVCG.2007.70623"
    },
    {
      "text": "Harrower, M., and Brewer, C. Colorbrewer.org: An online tool for selecting colour schemes for maps. The Cartographic Journal 40, 1 (June 2003), 27--37.",
      "doi": ""
    },
    {
      "text": "Healey, C. G., and Enns, J. Building perceptual textures to visualize multidimensional datasets. Proceedings Visualization '98 (Cat. No.98CB36276) (1998), 111--118. ",
      "doi": "10.5555/288216.288232"
    },
    {
      "text": "Heer, J., and Bostock, M. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the 28th international conference on Human factors in computing systems, ACM (2010), 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Hughes, H. C., Nozawa, G., and Kitterle, F. Global precedence, spatial frequency channels, and the statistics of natural images. J. Cognitive Neuroscience 8 (July 1996), 197--230.  ",
      "doi": "10.1162/jocn.1996.8.3.197"
    },
    {
      "text": "Javed, W., McDonnel, B., and Elmqvist, N. Graphical perception of multiple time series. Visualization and Computer Graphics, IEEE transactions on 16, 6 (2010), 927--34.  ",
      "doi": "10.1109/TVCG.2010.162"
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with Mechanical Turk. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08 (2008), 453.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kosara, R., Healey, C. G., Interrante, V., Laidlaw, D., and Ware, C. Thoughts on user studies: Why, how, and when. IEEE Computer Graphics and Applications 23, 4 (2003), 20--25.  ",
      "doi": "10.1109/MCG.2003.1210860"
    },
    {
      "text": "Kosslyn, S., and Chabris, C. Minding information graphics. Folio: the Magazine for Magazine Management, Feb. 1, 1992, 21 2 (1992), 69--71.",
      "doi": ""
    },
    {
      "text": "Kumar, N., and Benbasat, I. The effect of relationship encoding, task type, and complexity on information representation: An empirical evaluation of 2D and 3D line graphs. MIS Quarterly 28, 2 (2004), 255--281. ",
      "doi": "10.5555/2017219.2017225"
    },
    {
      "text": "Lam, H., Munzner, T., and Kincaid, R. Overview use in multiple visual information resolution interfaces. Visualization and Computer Graphics, IEEE transactions on 13, 6 (2007), 1278--85.  ",
      "doi": "10.1109/TVCG.2007.70583"
    },
    {
      "text": "Legrand, H., Rand, G., and Rittler, C. Tests for the detection and anlysis of color-blindness i. the ishihara test: An evaluation. Journal of the Optical Society of America 35 (1945), 268.",
      "doi": ""
    },
    {
      "text": "Mason, W., and Suri, S. Conducting Behavioral Research on Amazon's Mechanical Turk. Behavior Research Methods (2010).",
      "doi": ""
    },
    {
      "text": "Meserth, T., and Hollands, J. Comparing 2D and 3D displays for trend estimation: The effects of display augmentation. In Human Factors and Ergonomics Society Annual Meeting Proceedings, vol. 43, Human Factors and Ergonomics Society (1999), 1308--1312.",
      "doi": ""
    },
    {
      "text": "Munzner, T. A nested model for visualization design and validation. Visualization and Computer Graphics, IEEE transactions on 15, 6 (2009), 921--8.  ",
      "doi": "10.1109/TVCG.2009.111"
    },
    {
      "text": "Munzner, T. Visualization. In Fundamentals of computer graphics, 3e., P. Shirley and S. Marschner, Eds. AK Peters, 2009, 675--707.",
      "doi": ""
    },
    {
      "text": "Myczek, K., and Simons, D. J. Better than average: Alternatives to statistical summary representations for rapid judgments of average size. Perception & Psychophysics 70 (2008), 772--788.",
      "doi": ""
    },
    {
      "text": "Nourbakhsh, M. R., and Ottenbacher, K. J. The statistical analysis of single-subject data: a comparative examination. Physical therapy 74, 8 (Aug. 1994), 768--76.",
      "doi": ""
    },
    {
      "text": "Parkes, L., Lund, J., Angelucci, A., Solomon, J., and Morgan, M. Compulsory averaging of crowded orientation signals in human vision. Nature Neuroscience 4 (2001), 739--744.",
      "doi": ""
    },
    {
      "text": "Perlin, K. Improving noise. In ACM Transactions on Graphics (TOG), vol. 21, ACM (2002), 681--682.  ",
      "doi": "10.1145/566654.566636"
    },
    {
      "text": "Playfair, W. The commercial and political atlas: representing, by means of stained copper-plate charts, the progress of the commerce, revenues, expenditure, and debts of England, during the whole of the eighteenth century. Printed by T. Burton, for J. Wallis, 1801.",
      "doi": ""
    },
    {
      "text": "Ramanarayanan, G., Bala, K., and Ferwerda, J. A. Perception of complex aggregates. ACM Trans. Graph. 27 (August 2008), 60:1--60:10.  ",
      "doi": "10.1145/1360612.1360659"
    },
    {
      "text": "Rosenholtz, R., Dorai, A., and Freeman, R. Do predictions of visual perception aid design? Transactions on Applied Perception (2011).  ",
      "doi": "10.1145/1870076.1870080"
    },
    {
      "text": "Rosenholtz, R., Li, Y., Mansfield, J., and Jin, Z. Feature congestion: a measure of display clutter. Proceedings of the SIGCHI conference on Human factors in computing systems (2005).  ",
      "doi": "10.1145/1054972.1055078"
    },
    {
      "text": "Ross, J., Irani, L., Silberman, M. S., Zaldivar, A., and Tomlinson, B. Who are the crowdworkers? shifting demographics in mechanical turk. In Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems, CHI EA '10 (2010), 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Shneiderman, B. Extreme visualization: squeezing a billion records into a million pixels. In Proceedings of the 2008 ACM SIGMOD International Conference on Management of Data, ACM (2008), 3--12.  ",
      "doi": "10.1145/1376616.1376618"
    },
    {
      "text": "Singh, M., and Hoffman, D. Constructing and representing visual objects. Trends in Cognitive Sciences 1, 3 (1997), 98--102.",
      "doi": ""
    },
    {
      "text": "Swihart, B. J., Caffo, B., James, B. D., Strand, M., Schwartz, B. S., and Punjabi, N. M. Lasagna plots: a saucy alternative to spaghetti plots. Epidemiology (Cambridge, Mass.) 21, 5 (Sept. 2010), 621--5.",
      "doi": ""
    },
    {
      "text": "Wolfe, J., and Bennett, S. C. Preattentive object files: Shapeless bundles of basic features. Vision Research 37, 1 (1997), 25--43.",
      "doi": ""
    }
  ]
}