{
  "doi": "10.1145/2207676.2207693",
  "title": "Augmented perception of satiety: controlling food consumption by changing apparent size of food with augmented reality",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "109-118",
  "year": 2012,
  "badges": [],
  "abstract": "The main contribution of this paper is to realize a method for modifying perception of satiety and controlling nutritional intake by changing the apparent size of food with augmented reality. As a possible method for decreasing rates of obesity, we focused on controlling food intake implicitly without any effort. We hypothesized that ambiguous perception of satiety can be applied to control our food intake. Recent psychological studies have revealed that the amount of food consumed is influenced by both its actual volume and external factors during eating. Based on this knowledge, we sought to control perception of satiety gained from the same amount of food by changing its apparent size. We also proposed a method for food-volume augmentation using real-time shape deformation. Our results suggest that this augmentation can control the perception of satiety and food intake.",
  "authors": [
    {
      "name": "Takuji Narumi",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331500452",
      "orcid": "0000-0002-9010-1491"
    },
    {
      "name": "Yuki Ban",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488658104",
      "orcid": "missing"
    },
    {
      "name": "Takashi Kajinami",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466640651",
      "orcid": "missing"
    },
    {
      "name": "Tomohiro Tanikawa",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100172183",
      "orcid": "missing"
    },
    {
      "name": "Michitaka Hirose",
      "institution": "The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100257385",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "World Health Organization, Obesity: preventing and managing the global epidemic. Geneva: World Health Organization, 1998.",
      "doi": ""
    },
    {
      "text": "Haslam, D. W. and James, W. P.: Obesity, Lancet 366 (9492): 1197--1209, 2005.",
      "doi": ""
    },
    {
      "text": "Lau, D. C., Douketis, J. D., Morrison, K. M., Hramiak, I. M., Sharma, A. M., and Ur, E.: 2006 Canadian clinical practice guidelines on the management and prevention of obesity in adults and children. CMAJ 176 (8): S1--13, 2007.",
      "doi": ""
    },
    {
      "text": "Mokdad, A. H., Marks, J. S., Stroup, D. F. and Gerberding, J. L.: Actual causes of death in the United States, 2000, JAMA 291 (10): 1238--45, 2004.",
      "doi": ""
    },
    {
      "text": "Maitland, J. and Chalmers, M.: Designing for peer involvement in weight management. In Proceedings of the 2011 annual conference on Human factors in computing systems (CHI '11), pp. 315--324, 2011.  ",
      "doi": "10.1145/1978942.1978988"
    },
    {
      "text": "Consolvo S, Everitt K, Smith I and Landay JA: Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06), pp. 457--466, 2006.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Grimes, A. and Harper, R.: Celebratory technology: new directions for food research in HCI. In Proceedings of the twenty-sixth annual SIGCHI conference on Human factors in computing systems (CHI '08), pp. 467--476, 2008.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Mankoff, J., Hsieh, G., Hung, H. C., Lee, S. and Nitao, E.: Using Low-Cost Sensing to Support Nutritional Awareness. In Proceedings of Ubicomp 2002, pp. 371--378, 2002. ",
      "doi": "10.5555/647988.761044"
    },
    {
      "text": "Noronha, J., Hysen, E., Zhang, H. and Gajos, K. Z.: Platemate: crowdsourcing nutritional analysis from food photographs. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), pp. 1--12, 2011.  ",
      "doi": "10.1145/2047196.2047198"
    },
    {
      "text": "Shimojo, S. and Shams, L.: Sensory modalities are not separate modalities: plasticity and interactions, Current Opinion in Neurobiology 2001 Aug;11(4):505--9, 2001.",
      "doi": ""
    },
    {
      "text": "Narumi, T., Nishizaka, S., Kajinami, T., Tanikawa, T. and Hirose, M.: Augmented Reality Flavors: Gustatory Display Based on Edible Marker and Cross-Modal Interaction, In Proceedings of the 2011 annual conference on Human factors in computing systems (CHI '11), pp.93--102, 2011.  ",
      "doi": "10.1145/1978942.1978957"
    },
    {
      "text": "Hashimoto, Y., Inami, M. and Kajimoto, H.: Straw-like User Interface (II): a new method of presenting auditory sensations for a more natural experience, Euro Haptics 2008, pp. 484--493, 2008.  ",
      "doi": "10.1007/978-3-540-69057-3_62"
    },
    {
      "text": "Brobeck, J. R.: Food intake as a mechanism of temperature regulation, Yale Journal of Biology and Medicine, 20:545--552, 1948.",
      "doi": ""
    },
    {
      "text": "Sommer, R.: Personal Space. Behavioral Basis of Design. Englewood Cliff, NJ: Prentice-Hall, 1969.",
      "doi": ""
    },
    {
      "text": "Lyman, B.: A Psychology of Food. More Than a Matter of Taste. Van Nostrand-Reinhold, 1989.",
      "doi": ""
    },
    {
      "text": "Caldwell, C. and Hibbert, S. A.: The influence of music tempo and musical preference on restaurant patrons' behavior. Psychology and Marketing, 19:895--917, 2002.",
      "doi": ""
    },
    {
      "text": "North, A. C. and Hargreaves, D. J.: The effects of music on responses to a dining area. Journal of Environmental Psychology, 24:55--64, 1996.",
      "doi": ""
    },
    {
      "text": "Bell, R. and Pliner, P. L.: Time to eat: the relationship between the number of people eating and meal duration in three lunch settings. Appetite 41:215--218, 2003.",
      "doi": ""
    },
    {
      "text": "de Castro J. M.: Family and friends produce greater social facilitation of food intake than other companions. Physiology and Behavior, 56:445--455, 1994.",
      "doi": ""
    },
    {
      "text": "Wansink, B., Painter J. E. and Lee, Y. K.: The office candy dish: proximity's influence on estimated and actual consumption. International Journal of Obesity, 30(5):871--875, 2006.",
      "doi": ""
    },
    {
      "text": "Volkow N. D., Wang, G. J., Fowler, J. S., Logan, J., Jayne, M., Franceschi, D., Wong C., Gatley, S. J., Gifford, A. N., Ding, Y. S. and Pappas N: \"Nonhedonic\" food motivation in humans involves dopamine in the dorsal striatum and methylphenidate amplifies this effect, Synapse, 44:175--180, 2002.",
      "doi": ""
    },
    {
      "text": "Rolls, B. J., Rowe, E. A., Rolls, E. T., Kingston, B., Megson, A. and Gunary, R.: Variety in a meal enhances food intake in men. Physiol. Behav. 26:215--221, 1981.",
      "doi": ""
    },
    {
      "text": "Kahn, B. E. and Wansink, B.: The influence of assortment structure on perceived variety and consumption quantities. Journal of Consumer Research, 30:519--533, 2004.",
      "doi": ""
    },
    {
      "text": "Rolls, J. B., Morris, E. L. and Roe, L. S.: Portion size of food affects energy intake in normal-weight and overweight men and women, American Journal of Clinical Nutrition, Vol. 76, No. 6, pp. 1207--1213, December 2002.",
      "doi": ""
    },
    {
      "text": "Rolls, B. J., Roe, L. S., Kral, T. V. E., Meengs, J. S. and Wall, D. E., Increasing the portion size of a packaged snack increases energy intake in men and women, Appetite, Vol. 42 Issue 1, pp. 63--69, 2004.",
      "doi": ""
    },
    {
      "text": "Rolls, B. J., Engell, D. and Birch, L. L.: Serving portion size influences 5-year-old but not 3-year-old children's food intakes. Journal of the American Dietetic Association, 100(2): 232--234, 2000.",
      "doi": ""
    },
    {
      "text": "Coren, S: A size-contrast illusion without physical size differences, The American Journal of Psychology, Vol. 84(4), pp.565--566, 1971.",
      "doi": ""
    },
    {
      "text": "Wansink, B. and Cheney, M. M.: Super Bowls: serving bowl size and food consumption. The Journal of the American Medical Association. 13;293(14):1727--1728, 2005.",
      "doi": ""
    },
    {
      "text": "Wansink, B., Van Ittersum, K., and Painter, J. E.: Ice cream illusions bowls, spoons, and self-served portion sizes. American Journal of Preventive Medicine, 31(3):240--243, 2006.",
      "doi": ""
    },
    {
      "text": "Mishra, A., Mishra, H. and Masters, T. M.: The Influence of Bite Size on Quantity of Food Consumed: A Field Study, Journal of Consumer Research, 2012. (published online June 2011).",
      "doi": ""
    },
    {
      "text": "Piaget, J.: The Mechanisms of Perception, Routledge & Kegan Paul Pliner, London, 1969.",
      "doi": ""
    },
    {
      "text": "Wansink, B. and Van Ittersum, K.: Bottoms up! The influence of elongation on pouring and consumption, Journal of Consumer Research, 30:455--463, 2003.",
      "doi": ""
    },
    {
      "text": "Schaefer, S., McPhail, T. and Warren, J.: Image deformation using moving least squares. ACM Transactions on Graphics 25, 3, pp. 533--540, 2006.  ",
      "doi": "10.1145/1141911.1141920"
    },
    {
      "text": "Ban, Y., Kajinami, T., Narumi, T., Tanikawa, T. and Hirose, M.: Modifying an Identified Curved Surface Shape Using Pseudo-Haptic Effect, The 2012 IEEE Haptics Symposium (HAPTICS2012), 2012.",
      "doi": ""
    },
    {
      "text": "Herling, J. and Broll, W.: Advanced self-contained object removal for realizing real-time Diminished Reality in unconstrained environments, In Proc. of 9th IEEE International Symposium on Mixed and Augmented Reality (ISMAR2010), pp. 207--212, 2010.",
      "doi": ""
    }
  ]
}