{
  "doi": "10.1145/2207676.2208549",
  "title": "Delta: a tool for representing and comparing workflows",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1027-1036",
  "year": 2012,
  "badges": [],
  "abstract": "Tutorials and sample workflows for complicated, feature-rich software packages are widely available online. As a result users must differentiate between workflows to choose the most suitable one for their task. We present Delta, an interactive workflow visualization and comparison tool that helps users identify the tradeoffs between workflows. We conducted an initial study to identify the set of attributes users attend to when comparing workflows, finding that they consider result quality, their knowledge of commands, and the efficiency of the workflow. We then designed Delta to surface these attributes at three granularities: a high-level, clustered view; an intermediate-level list view that contains workflow summaries; and a low-level detail view that allows users to compare two individual workflows. Finally, we conducted an evaluation of Delta on a small corpus of 30 workflows and found that the intermediate list view provided the best information density. We conclude with thoughts on how such a workflow comparison system could be scaled up to larger corpora in the future.",
  "tags": [
    "tutorials",
    "search interfaces",
    "delta",
    "workflow comparison"
  ],
  "authors": [
    {
      "name": "Nicholas Kong",
      "institution": "University of California, Berkeley, Berkeley, California, United States & Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489071",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, California, United States",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    }
  ],
  "references": [
    {
      "text": "Andrews, K., Wohlfahrt, M., and Wurzinger, G. Visual Graph Comparison. Info. Vis., pp. 62--67, 2009.  ",
      "doi": "10.1109/IV.2009.108"
    },
    {
      "text": "Bederson, B., Shneiderman, B., and Wattenberg, M. Ordered and quantum treemaps: Making effective use of 2D space to display hierarchies. ACM Trans. Graph, 21(4):833--854, 2002.  ",
      "doi": "10.1145/571647.571649"
    },
    {
      "text": "Chen, H.-T., Wei, L.-Y. and Chang, C.-F. Nonlinear Revision Control for Images. ACM Trans. Graph, 30(4), Article 105, 2011.  ",
      "doi": "10.1145/2010324.1965000"
    },
    {
      "text": "Chi, E. H., Pirolli, P., Chen, K., and Pitkow, J. Using information scent to model user information needs and actions and the Web. ACM CHI, pp. 490--497, 2001.  ",
      "doi": "10.1145/365024.365325"
    },
    {
      "text": "Chi, E., Pirolli, P., and Pitkow, J. The scent of a site: a system for analyzing and predicting information scent, usage, and usability of a Web site. ACM CHI, pp. 161--168, 2000.  ",
      "doi": "10.1145/332040.332423"
    },
    {
      "text": "Cutrell, E. and Guan Z. What are you looking for?: an eye-tracking study of information usage in web search. ACM CHI. pp. 407--416. 2007.  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Cutting, D., Karger, D., Pedersen, J., and Tukey, J. Scatter/Gather: a cluster-based approach to browsing large document collections. SIGIR. pp. 318--329. 1992.  ",
      "doi": "10.1145/133160.133214"
    },
    {
      "text": "Denning, J. D., Kerr, W. B., and Pellacini, F. MeshFlow: Interactive Visualization of Mesh Construction Sequences. ACM Trans. Graph, 30(4), Article 66, 2011.  ",
      "doi": "10.1145/2010324.1964961"
    },
    {
      "text": "Dorn, B. and Guzdial, M. Learning on the job: characterizing the programming knowledge and learning strategies of web designers. ACM CHI, pp. 703--712. 2010.  ",
      "doi": "10.1145/1753326.1753430"
    },
    {
      "text": "Grabler, F., Agrawala, M., Li, W., Dontcheva, M. and Igarashi, T. Generating Photo Manipulation Tutorials by Demonstration. SIGGRAPH. pp. 66:1--66:9, 2009.  ",
      "doi": "10.1145/1576246.1531372"
    },
    {
      "text": "Grossman, T., Matejka, J. and Fitzmaurice, G. Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. UIST, pp. 143--152, 2010.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Grossman, T., Fitzmaurice, G. and Attar, R. A Survey of Software Learnability: Metrics, Methodologies and Guidelines. ACM CHI, pp. 649--658, 2009.  ",
      "doi": "10.1145/1518701.1518803"
    },
    {
      "text": "Guan. Z., and Cutrell, E. An eye tracking study of the effect of target rank on web search. ACM CHI, pp. 417--420, 2007.  ",
      "doi": "10.1145/1240624.1240691"
    },
    {
      "text": "Hearst, M. Search User Interfaces (1st ed.). Cambridge University Press, New York, NY, USA. 2009. ",
      "doi": "10.5555/1631268"
    },
    {
      "text": "Heer, J., Mackinlay, J., Stolte, C. and Agrawala, M. Graphical Histories for Visualization: Supporting Analysis, Communication, and Evaluation. IEEE TVCG, pp. 1189--1196, 2008.  ",
      "doi": "10.1109/TVCG.2008.137"
    },
    {
      "text": "Jing, F. Wang, W., Yao, Y., Deng, K., Zhang, L., and Ma, W.-Y. IGroup: web image search results clustering. ACM Multimedia, pp. 377--384, 2006.  ",
      "doi": "10.1145/1180639.1180720"
    },
    {
      "text": "Koop, D., Scheidegger, C., Callahan, S., Freire, J., and Silva, C. VisComplete: Automating Suggestions for Visualization Pipelines. IEEE TVCG, pp. 1691--1698, 2008.  ",
      "doi": "10.1109/TVCG.2008.174"
    },
    {
      "text": "Kurlander, D.,and Feiner, S. Editable graphical histories. IEEE Visual Languages, pp. 127--134, 1988.",
      "doi": ""
    },
    {
      "text": "LaFreniere, B., Bunt, A., Lount, M., Krynicki, F., and Terry, M. AdaptableGIMP: designing a sociallyadaptable interface. UIST Adjunct, pp. 89--90. 2011.  ",
      "doi": "10.1145/2046396.2046437"
    },
    {
      "text": "Lee, B., Srivastava, S., Kumar, R., Brafman, R., and Klemmer, S. Designing with Interactive Example Galleries. ACM CHI, pp. 2257--2266, 2010.  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Nakamura, T. and Igarashi, I. An application-independent system for visualizing user operation history. UIST, pp. 23--32, 2008.  ",
      "doi": "10.1145/1449715.1449721"
    },
    {
      "text": "Pirolli, P. and Card, S. Information foraging. Psychological Review, 106(4):643--675, 1999.",
      "doi": ""
    },
    {
      "text": "Santos, E., Lins, L., Ahrens, J., Freire, J., and Silva, C. A first study on clustering collections of workflow graphs. IPAW, pp. 160--173, 2008.  ",
      "doi": "10.1007/978-3-540-89965-5_18"
    },
    {
      "text": "Sorokin, A. and Forsyth, D. Utility data annotation with Amazon Mechanical Turk. CVPRW, pp.1--8, 2008.",
      "doi": ""
    },
    {
      "text": "Wagner, R. and Fischer, M. The String-to-String Correction Problem. J. ACM, 21(1):168--173, 1974.  ",
      "doi": "10.1145/321796.321811"
    }
  ]
}