{
  "doi": "10.1145/2207676.2208553",
  "title": "Omnipedia: bridging the wikipedia language gap",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1075-1084",
  "year": 2012,
  "badges": [],
  "abstract": "We present Omnipedia, a system that allows Wikipedia readers to gain insight from up to 25 language editions of Wikipedia simultaneously. Omnipedia highlights the similarities and differences that exist among Wikipedia language editions, and makes salient information that is unique to each language as well as that which is shared more widely. We detail solutions to numerous front-end and algorithmic challenges inherent to providing users with a multilingual Wikipedia experience. These include visualizing content in a language-neutral way and aligning data in the face of diverse information organization strategies. We present a study of Omnipedia that characterizes how people interact with information using a multilingual lens. We found that users actively sought information exclusive to unfamiliar language editions and strategically compared how language editions defined concepts. Finally, we briefly discuss how Omnipedia generalizes to other domains facing language barriers.",
  "authors": [
    {
      "name": "Patti Bao",
      "institution": "Northwestern University, Evanston, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416596129",
      "orcid": "missing"
    },
    {
      "name": "Brent Hecht",
      "institution": "Northwestern University, Evanston, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577456",
      "orcid": "missing"
    },
    {
      "name": "Samuel Carton",
      "institution": "Northwestern University, Evanston, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502692079",
      "orcid": "missing"
    },
    {
      "name": "Mahmood Quaderi",
      "institution": "Northwestern University, Evanston, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502808102",
      "orcid": "missing"
    },
    {
      "name": "Michael Horn",
      "institution": "Northwestern University, Chicago, Illinois, United States",
      "img": "/do/10.1145/contrib-81502668367/rel-imgonly/2v0a0247-3.jpg",
      "acmid": "81502668367",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, Evanston, Illinois, United States",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    }
  ],
  "references": [
    {
      "text": "Adafre, S.F. and de Rijke, M. 2006. Finding Similar Sentences Across Multiple Languages in Wikipedia. EACL 2006 Workshop on New Text, Wikis and Blogs and Other Dynamic Text Sources.",
      "doi": ""
    },
    {
      "text": "Adar, E., Skinner, M. and Weld, D.S. 2009. Information Arbitrage Across Multi-lingual Wikipedia. WSDM '09.  ",
      "doi": "10.1145/1498759.1498813"
    },
    {
      "text": "von Ahn, L. 2011. Three human computation projects. (2011). SIGCSE '11.  ",
      "doi": "10.1145/1953163.1953354"
    },
    {
      "text": "Au Yeung, C.-man, Duh, K. and Nagata, M. 2011. Providing Cross-Lingual Editing Assistance to Wikipedia Editors. CICL '11. ",
      "doi": "10.5555/1964750.1964786"
    },
    {
      "text": "Bergstrom, T. and Karahalios, K. 2009. Conversation clusters: grouping conversation topics through human-computer dialog. CHI '09.  ",
      "doi": "10.1145/1518701.1519060"
    },
    {
      "text": "Budanitsky, A. and Hirst, G. 2006. Evaluating WordNet-based Measures of Lexical Semantic Relatedness. Computational Linguistics. 32, 1 (2006), 13--47.  ",
      "doi": "10.1162/coli.2006.32.1.13"
    },
    {
      "text": "Callahan, E.S. and Herring, S.C. Cultural bias in Wikipedia content on famous persons. Journal of the American Society for Information Science and Technology. 62: 1899--1915.  ",
      "doi": "10.1002/asi.21577"
    },
    {
      "text": "Capocci, A., Servedio, V.D.P., Colaiori, F., Buriol, L.S., Donato, D., Leonardi, S. and Caldarelli, G. 2006. Preferential attachment in the growth of social networks: The internet encyclopedia Wikipedia. Physical Review E. 74, 3 (2006), 036116.",
      "doi": ""
    },
    {
      "text": "Dong, W. and Fu, W.-T. 2010. Cultural difference in image tagging. CHI '10.  ",
      "doi": "10.1145/1753326.1753472"
    },
    {
      "text": "Duolingo: http://duolingo.com/. Accessed: 2011-09--13.",
      "doi": ""
    },
    {
      "text": "Filatova, E. 2009. Multilingual Wikipedia, Summarization, and Information Trustworthiness. SIGIR Workshop on Information Access in a Multilingual World.",
      "doi": ""
    },
    {
      "text": "Frequently asked questions - Wikimedia Foundation: http://wikimediafoundation.org/wiki/Frequently_asked_questions. Accessed: 2011-09--21.",
      "doi": ""
    },
    {
      "text": "Gärdenfors, P. 2000. Conceptual Spaces: The Geometry of Thought. The MIT Press. ",
      "doi": ""
    },
    {
      "text": "Hecht, B. and Gergle, D. 2009. Measuring Self-Focus Bias in Community-Maintained Knowledge Repositories. Communities and Technologies 2009.  ",
      "doi": "10.1145/1556460.1556463"
    },
    {
      "text": "Hecht, B. and Gergle, D. 2010. The tower of Babel meets web 2.0: user-generated content and its applications in a multilingual context. CHI '10.  ",
      "doi": "10.1145/1753326.1753370"
    },
    {
      "text": "Hong, L., Convertino, G. and Chi, E.H. 2011. Language Matters in Twitter: A Large Scale Study. ICWSM '11.",
      "doi": ""
    },
    {
      "text": "Jarmasz, M. and Szpakowicz, S. 2003. Roget's thesaurus and semantic similarity. RANLP '03.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Suh, B. and Chi, E.H. 2008. Can you ever trust a wiki?: impacting perceived trustworthiness in wikipedia. CSCW '08.  ",
      "doi": "10.1145/1460563.1460639"
    },
    {
      "text": "Kumaran, A., Datha, N., Ashok, B., Saravanan, K., Ande, A., Sharma, A., Vedantham, S., Natampally, V., Dendi, V. and Maurice, S. 2010. WikiBABEL: A System for Multilingual Wikipedia Content. American Machine Translation Association (AMTA) Workshop.",
      "doi": ""
    },
    {
      "text": "wiki/List_of_Wikipedias. Accessed: 2011-09--20.",
      "doi": ""
    },
    {
      "text": "Manypedia: 2011. http://www.manypedia.com/.",
      "doi": ""
    },
    {
      "text": "de Melo, G. and Weikum, G. 2010. Untangling the Cross-Lingual Link Structure of Wikipedia. ACL '10. ",
      "doi": "10.5555/1858681.1858768"
    },
    {
      "text": "Mihalcea, R. and Csomai, A. 2007. Wikify!: linking documents to encyclopedic knowledge. CIKM '07.  ",
      "doi": "10.1145/1321440.1321475"
    },
    {
      "text": "Milne, D. and Witten, I.H. 2008. An Effective, Low-Cost Measure of Semantic Relatedness Obtained from Wikipedia Links. WIKIAI '08.",
      "doi": ""
    },
    {
      "text": "Milne, D. and Witten, I.H. 2008. Learning to link with wikipedia. CIKM '08.  ",
      "doi": "10.1145/1458082.1458150"
    },
    {
      "text": "Oh, J.-H., Kawahara, D., Uchimoto, K., Kazama, J. and Torisawa, K. 2008. Enriching Multilingual Language Resources by Discovering Missing Cross-Language Links in Wikipedia. WIIAT '08.  ",
      "doi": "10.1109/WIIAT.2008.317"
    },
    {
      "text": "Pfeil, U., Zaphiris, P. and Ang, C.S. 2006. Cultural Differences in Collaborative Authoring of Wikipedia. Journal of Computer-Mediated Communication. 12, 1, 88--113.",
      "doi": ""
    },
    {
      "text": "Sorg, P. and Cimiano, P. 2008. Enriching the Crosslingual Link Structure of Wikipedia - A Classification-based Approach. WIKI-AI '08.",
      "doi": ""
    },
    {
      "text": "Suh, B., Chi, E.H, Pendleton, B.A. and Kittur, A. 2007. Us vs. Them: Understanding Social Dynamics in Wikipedia with Revert Graph Visualizations. VAST '07.  ",
      "doi": "10.1109/VAST.2007.4389010"
    },
    {
      "text": "Translating the world's information with Google Translator Toolkit: 2009. http://googleblog.blogspot.com/2009/06/translating-worlds-information-with.html. Accessed: 2011-09--16.",
      "doi": ""
    },
    {
      "text": "Viégas, F.B., Wattenberg, M. and Dave, K. 2004. Studying cooperation and conflict between authors with history flow visualizations. CHI '04.",
      "doi": ""
    },
    {
      "text": "Wattenberg, M., Viégas, F.B. and Hollenbach, K. 2007. Visualizing activity on wikipedia with chromograms. INTERACT '07. ",
      "doi": "10.5555/1778331.1778361"
    },
    {
      "text": "WikiBhasha beta -- A multi-lingual content creator for Wikipedia: http://www.wikibhasha.org/.",
      "doi": ""
    }
  ]
}