{
  "doi": "10.1145/2207676.2208301",
  "title": "Rewarding the original: explorations in joint user-sensor motion spaces",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1717-1726",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper presents a systematic and general technique for establishing a set of motions suitable for use with sensor systems, by drawing performable and measurable motions directly from users. It uses reinforcement which rewards originality to induce users to explore the space of motions they can perform. A decomposition of movements into motion primitives is constructed, among which a meaningful originality metric can be defined. Because the originality measure is defined in terms of the sensed input, the resulting space contains only movements which can both be performed and sensed. We show how this can be used to evaluate the relative performance of different joint user-sensor systems, providing objective analyses of gesture lexicons with regard to the technical limitations of sensors and humans. In particular, we show how the space of motions varies across the arm for a body-mounted inertial sensor.",
  "tags": [
    "reinforcement",
    "novelty",
    "inertial",
    "gesture",
    "originality",
    "motion"
  ],
  "authors": [
    {
      "name": "John Williamson",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100169940",
      "orcid": "missing"
    },
    {
      "name": "Roderick Murray-Smith",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100572841/rel-imgonly/aa.jpg",
      "acmid": "81100572841",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. M. Alexander. Principles of animal locomotion. Princeton University Press, 2003.",
      "doi": ""
    },
    {
      "text": "J.-D. Fekete, N. Elmqvist, and Y. Guiard. Motion-pointing: target selection using elliptical motions. In CHI '09, pages 289--298. ACM, 2009.  ",
      "doi": "10.1145/1518701.1518748"
    },
    {
      "text": "P. M. Fitts. The information capacity of the human motor system in controlling the amplitude of movement. J. Exp. Psych., 47(6):381--391, 1954.",
      "doi": ""
    },
    {
      "text": "F. Gosselin and P. G. Schyns. Superstitious Perceptions Reveal Properties of Internal Representations. Psychological Science, 14(5):505--509, 2003.",
      "doi": ""
    },
    {
      "text": "A. J. Ijspeert, J. Nakanishi, and S. Schaal. Learning attractor landscapes for learning motor primitives. In NIPS'03, pages 1523--1530. MIT Press, 2003.",
      "doi": ""
    },
    {
      "text": "R. J. Jagacinski and J. M. Flach. Control theory for humans : quantitative approaches to modeling performance. L. Erlbaum Associates, 2003.",
      "doi": ""
    },
    {
      "text": "J. Kangas, T. Kohonen, and J. Laaksonen. Variants of self-organizing maps. IEEE Tran. Neural Networks, 1(1):93--99, 1990.",
      "doi": "10.1109/72.80208"
    },
    {
      "text": "A. Kendon. Gesture: Visible Action as Utterance. Cambridge University Press, 2004.",
      "doi": ""
    },
    {
      "text": "T. Kohonen. Self-organized formation of topologically correct feature maps. Biological Cybernetics, 43:59--69, 1982.",
      "doi": ""
    },
    {
      "text": "C. Kray, D. Nesbitt, J. Dawson, and M. Rohs. User-defined gestures for connecting mobile phones, public displays, and tabletops. In MobileHCI '10, pages 239--248, 2010.  ",
      "doi": "10.1145/1851600.1851640"
    },
    {
      "text": "I. S. MacKenzie. Fitts' law as a research and design tool in human-computer interaction. Hum.-Comput. Interact., 7:91--139, 1992.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "G. Pask. A comment, a case history and a plan. In J. Reichardt, editor, Cybernetics, Art and Ideas, pages 76--99. New York Graphic Society, 1971.",
      "doi": ""
    },
    {
      "text": "K. Pryor. Don't Shoot the Dog: The New Art of Teaching and Training. Ringpress Books, 2002.",
      "doi": ""
    },
    {
      "text": "J. Rico and S. Brewster. Usable gestures for mobile interfaces: evaluating social acceptability. In CHI '10, pages 887--896, 2010.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "A. Scoditti, R. Blanch, and J. Coutaz. A novel taxonomy for gestural interaction techniques based on accelerometers. In IUI '11, pages 63--72. ACM, 2011.  ",
      "doi": "10.1145/1943403.1943414"
    },
    {
      "text": "B. F. Skinner. 'superstition' in the pigeon. Journal of Experimental Psychology, 38(2):168--172, 1948.",
      "doi": ""
    },
    {
      "text": "R. W. Soukoreff and I. S. MacKenzie. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. Int. J. Hum.-Comput. Stud., 61:751--789, 2004.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "J. Williamson and R. Murray-Smith. Pointing without a pointer. In CHI '04, pages 1407--1410. ACM, 2004.  ",
      "doi": "10.1145/985921.986076"
    },
    {
      "text": "J. O. Wobbrock, M. R. Morris, and A. D. Wilson. User-defined gestures for surface computing. In CHI '09, pages 1083--1092, 2009.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "K. Yatani, K. Tamura, K. Hiroki, M. Sugimoto, and H. Hiromichi. Toss-it: Intuitive information transfer techniques for mobile devices using toss and swing actions. IEICE - Trans. Inf. Syst., E89-D:150--157, 2006.  ",
      "doi": "10.1093/ietisy/e89-d.1.150"
    }
  ]
}