{
  "doi": "10.1145/2207676.2208660",
  "title": "Beyond QWERTY: augmenting touch screen keyboards with multi-touch gestures for non-alphanumeric input",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2679-2682",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Although many techniques have been proposed to improve text input on touch screens, the vast majority of this research ignores non-alphanumeric input (i.e., punctuation, symbols, and modifiers). To support this input, widely adopted commercial touch-screen interfaces require mode switches to alternate keyboard layouts for most punctuation and symbols. Our approach is to augment existing ten-finger QWERTY keyboards with multi-touch gestural input that can exist as a complement to the moded-keyboard approach. To inform our design, we conducted a study to elicit user-defined gestures from 20 participants. The final gesture set includes both multi-touch and single-touch gestures for commonly used non-alphanumeric text input. We implemented and conducted a preliminary evaluation of a touch-screen keyboard augmented with this technique. Findings show that using gestures for non-alphanumeric input is no slower than using keys, and that users strongly prefer gestures to a moded-keyboard interface.",
  "authors": [
    {
      "name": "Leah Findlater",
      "institution": "University of Maryland, College Park, MD & University of Washington, Seattle, WA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    },
    {
      "name": "Ben Lee",
      "institution": "University of Washington, Seattle, WA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502784817",
      "orcid": "missing"
    },
    {
      "name": "Jacob Wobbrock",
      "institution": "University of Washington, Seattle, WA, United States",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Anthony, L. and Wobbrock, J. O. 2010. A lightweight multistroke recognizer for user interface prototypes. Proc. GI '10, 245--252. ",
      "doi": "10.5555/1839214.1839258"
    },
    {
      "text": "Brewster, S. A., and Hughes, M. 2009. Pressure-based text entry for mobile devices. Proc. MobileHCI '09, 73--76.  ",
      "doi": "10.1145/1613858.1613870"
    },
    {
      "text": "Isokoski, P.. 2004. Performance of menu-augmented soft keyboards. Proc. CHI '04, 423--430.  ",
      "doi": "10.1145/985692.985746"
    },
    {
      "text": "Kristensson, P. and Zhai, S. 2004. SHARK2 : a large vocabulary shorthand writing system for pen-based computers. Proc. UIST '04, 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "MacKenzie, I. S., Soukoreff, R. W. 2002. Text entry for mobile computing: models and methods, theory and practice. Human-Computer Interaction 17 (2), 147--198.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Zhang, S. X. 1997. The immediate usability of Graffiti. Proc. GI '97, 129--137. ",
      "doi": "10.5555/266774.266792"
    },
    {
      "text": "Soukoreff , R. W. and MacKenzie, I. S. 2003. Metrics for text entry research: an evaluation of MSD and KSPC, and a new unified error metric. Proc. CHI '03, 113--120.  ",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "Wobbrock, J. O., Aung, H. H., Rothrock, B. and Myers, B. A. (2005). Maximizing the guessability of symbolic input. Extended Abstracts CHI '05, 1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. 2009. User-defined gestures for surface computing. Proc. CHI '09, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Zhai, S., Hunter, M., and Smith, B. A. 2002. Performance optimization of virtual keyboards. HumanComputer Interaction 17 (3), 89--129.",
      "doi": ""
    }
  ]
}