{
  "doi": "10.1145/2207676.2208377",
  "title": "Determining the orientation of proximate mobile devices using their back facing camera",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2231-2234",
  "year": 2012,
  "badges": [],
  "abstract": "Proximate mobile devices that are aware of their orientation relative to one another can support novel and natural forms of interaction. In this paper, we present a method to determine the relative orientation of proximate mobile devices using only the backside camera. We implemented this method as a service called Orienteer, which provides mobile device with the orientation of other proximate mobile devices. We demonstrate that orientation information can be used to enable novel and natural interactions by developing two applications that allow the user to push content in the direction of another device to share it and point the device toward another to filter content based on the device's owner. An informal evaluation revealed that interactions built upon orientation information can be natural and compelling to users, but developers and designers need to carefully consider how orientation should be applied effectively.",
  "tags": [
    "proximate",
    "mobile devices",
    "orientation",
    "backside camera"
  ],
  "authors": [
    {
      "name": "David Dearman",
      "institution": "University of Toronto, Toronto, Ontario, Canada & Nokia Research Center, Palo Alto, California, United States",
      "img": "/do/10.1145/contrib-81100428285/rel-imgonly/headshot-nokia.jpg",
      "acmid": "81100428285",
      "orcid": "missing"
    },
    {
      "name": "Richard Guy",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100594482",
      "orcid": "missing"
    },
    {
      "name": "Khai Truong",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "Ballendat, T. Visualization of and interaction with digital devices around large surfaces as a function of proximity. Master's Thesis, Dept. Insitut fur Informatik, LudwigMaximilians-University Munche, Munich, Germany, 2011.",
      "doi": ""
    },
    {
      "text": "Boring, S., Baur, D., Butz, A., Gustafson, S. and Baudisch, P. Touch projector: mobile interaction through video. In Proc. CHI 2010, ACM Press (2010), 2287--2296.  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Boring, S, Gehring, S., Wiethoff, A., Blöckner, M., Schöning, J., and Butz, S. Multi-user interaction on media facades through live video on mobile devices. In Proc. CHI 2011, ACM Press (2011), 2721--2724.  ",
      "doi": "10.1145/1978942.1979342"
    },
    {
      "text": "Bump Technologies, 2011. http://Bu.mp",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Marquardt, N., Ballendat, T., DiazMarino, R. and Wang, M. Proxemic interactions: the new ubicomp? Interactions 18, 1 (January 2011), 42--50.  ",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Harrison, C. and Dey, A. K. Lean and zoom: proximity-aware user interface and content magnification. In Proc. CHI 2008, ACM Press (2008), 507--510.  ",
      "doi": "10.1145/1357054.1357135"
    },
    {
      "text": "Hinkley, K. Synchronous gestures for multiple persons and computers. In Proc. UIST 2003, ACM Press (2003), 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Holmquist, L. E., Mattern, F., Schiele, B., Alahuhta, P., Beigl, M. and Gellersen, H.-W. Smart-Its friends: a technique for users to easily establish connections between artefacts. In Proc. UbiComp 2001, SpringerVerlag (2001), 116--122. ",
      "doi": "10.5555/647987.741340"
    },
    {
      "text": "Kortuem, G, Kray, C. and Gellersen, H. Sensing and visualizing spatial relations of mobile devices. In Proc. UIST 2005, ACM Press (2005), 93--102.  ",
      "doi": "10.1145/1095034.1095049"
    },
    {
      "text": "Marquardt, N., Diaz-Marino, R., Boring, S. and Greenbreg, S. The proximity toolkit: prototyping proxemic interactions in ubiquitous computing ecologies. In Proc. UIST 2011, ACM Press (2011), 315--326.  ",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Schilit, B., Adams, N. and Want, R. Context-aware computing applications. In Proc. WMCSA 1994, IEEE Computer Society (1994), 85--90.  ",
      "doi": "10.1109/WMCSA.1994.16"
    },
    {
      "text": "Swindells, C. E. Use that there! Pointing to establish device identity. Master's Thesis, School of Computing Science, Simon Fraser University, 2002.",
      "doi": ""
    },
    {
      "text": "Varshavsky, A. and Patel, S. Location in ubiquitous computing. In J. Krumm (Eds.), Ubiquitous Computing Fundamentals, Chapman & Hall (2009), 285--320.",
      "doi": ""
    },
    {
      "text": "Voida, S., Edwards, W. K., Newman, M. W., Grinter, B. E., Ducheneaut, N. Share and share alike: exploring the user interface affordances of file sharing. In Proc. CHI 2006, ACM Press (2006), 221--230.  ",
      "doi": "10.1145/1124772.1124806"
    },
    {
      "text": "Want, R., Hopper, A., Falcão, V. and Gibbons, J. The active badge location system. ACM Trans. Inf. Syst. 10, 1 (January 1992), 91--102.  ",
      "doi": "10.1145/128756.128759"
    },
    {
      "text": "Want, R., Fishkin, K. P., Gujar, A. and Harrison, B. L. Bridging physical and virtual worlds with electronic tags. In Proc. CHI 1999, ACM Press (1999), 370--377.  ",
      "doi": "10.1145/302979.303111"
    }
  ]
}