{
  "doi": "10.1145/2207676.2208528",
  "title": "Athletes and street acrobats: designing for play as a community value in parkour",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "869-878",
  "year": 2012,
  "badges": [],
  "abstract": "Participatory design methods face challenges when designing for a widespread youth community. In such projects, it is not enough to design in collaboration with a few selected individuals; one must also strive to understand the community at a deeper level and incorporate its values and practices into the design solution. We report on our process of designing with, and for, an identified youth group: the Parkour and Freerunning community. We show how the successful design relied not only on employing methods of participatory observation and participatory design, but also on acquiring an understanding of the practice as a \"fun community\", valuing play over achievement and competition.",
  "authors": [
    {
      "name": "Annika Waern",
      "institution": "Mobile Life Centre & Stockholm University, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81100020339/rel-imgonly/282023_3annika-waern.jpg",
      "acmid": "81100020339",
      "orcid": "missing"
    },
    {
      "name": "Elena Balan",
      "institution": "Mobile Life Centre, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502704103",
      "orcid": "missing"
    },
    {
      "name": "Kim Nevelsteen",
      "institution": "Mobile Life Centre & Interactive Institute, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812265",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bavinton, N. From obstacle to opportunity: Parkour, leisure, and the reinterpretation of constraints, Annals of leisure research, 10(3--4), (2010) 391--412.",
      "doi": ""
    },
    {
      "text": "Brown, N. The art of displacement. Parkour as a challenge to social perceptions of body and space. Parkour Generations, blog post (2007). http://www.parkourgenerations.com/articles.php?id_cat=2&idart=21",
      "doi": ""
    },
    {
      "text": "Cockton, G. Designing worth is worth designing. Nordic CHI (2006) 165--174  ",
      "doi": "10.1145/1182475.1182493"
    },
    {
      "text": "Colting, F. and Gadd, C-J.Extremsport, Nicotext (2008).",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The psychology of optimal experience, Harper Perennial reprint 2008 (1991).",
      "doi": ""
    },
    {
      "text": "Daskalaki, M., Starab, A. and Imasa, M. The 'Parkour organisation': inhabitation of corporate spaces. Culture and Organization 14(1) (2008) 49--64",
      "doi": ""
    },
    {
      "text": "DeBord, G. Theory of the Dérive, Les Lèvres Nues #9 (1956) reprint in Internationale Situationniste #2 (1958)",
      "doi": ""
    },
    {
      "text": "DeKoven, B. Coliberation continued. Deep fun, blog post (2011) http://www.deepfun.com/coliberation-continued/",
      "doi": ""
    },
    {
      "text": "Harrison, L., Harrison C.K, and Moore, L.N. African American racial identity and sport. Sport, education and leisure 7(2) (2002) 121--133.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. and Tractinsky, N. User experience - a research agenda. Behaviour and information technology, 25(2) (2006) 91--97.",
      "doi": ""
    },
    {
      "text": "Jonasson, K. Parkour -- en posthumanistisk idrott?, Proc. of Kultur Natur: Konferens för kulturstudier i Sverige, Norrköping, Sweden. (2009)",
      "doi": ""
    },
    {
      "text": "Karsten, L., and Pel, E. Skateboarders exploring urban public space: Ollies, obstacles and conflicts. Journal of housing and the built environment 15, (2000) 327--340.",
      "doi": ""
    },
    {
      "text": "Klausen, M. Parkour og den mobile teknologi: En etnografisk undersøgelse af fænomenet parkour i dimensionerne krop, by og medialisering. Qualitative Studies 1(1), (2010) 33--47.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C., Shehan Poole, E., and Wyche, S.P., Values as lived experience: Evolving value sensitive design in support of value discovery. Proc. CHI'09, ACM (2009) 1141--1150  ",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Ozanne, J.L, and Saatcioglu, B. Participatory action research. Journal of consumer research 35 (2008) 423-- 439.",
      "doi": ""
    },
    {
      "text": "Saville, S.J. Playing with fear: Parkour and the mobility of emotion. Social & cultural geography 9(8) (2008) 891--914",
      "doi": ""
    },
    {
      "text": "Williamson, J., Robinson, S., Stewart, C., MurraySmith, R., Jones, M., and Brewster, S. Social Gravity: A virtual elastic tether for casual, privacy-preserving pedestrian rendezvous, CHI'10 ACM (2010). 1485-- 1494.  ",
      "doi": "10.1145/1753326.1753548"
    }
  ]
}