{
  "doi": "10.1145/2207676.2208530",
  "title": "Twiage: a game for finding good advice on twitter",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "889-898",
  "year": 2012,
  "badges": [],
  "abstract": "Millions of recommendations, opinions and experiences are shared across popular microblogging platforms and services each day. Yet much of this content becomes quickly lost in the stream shortly after being posted. This paper looks at the feasibility of identifying useful content in microblog streams so that it might be archived to facilitate wider access and reference. Towards this goal, we present an experiment with a game-with-a-purpose called Twiage that we designed to determine how well the deluge of content in \"raw\" microblog streams could be turned into filtered and ranked collections using ratings from players. Experiments with Twiage validate the feasibility of applying human-computation to this problem, finding strong agreement about what constitutes the \"most useful\" content in our test dataset. Second, we compare the effectiveness of various methods of eliciting such ratings, finding that a \"choose-best\" interface and Elo rating ranking scheme yield the greatest agreement in the fewest rounds. External validation of resulting top-rated twitter content with a domain expert found that while the top Twiage-ranked \"tweets\" were among the best of the set, there was a tendency for players to also select what we term \"weak spam\" - e.g., promotional content disguised as articles or reviews, indicating a need for more stringent content filtering.",
  "authors": [
    {
      "name": "Max Van Kleek",
      "institution": "University of Southampton, Southampton, Hampshire, United Kingdom",
      "img": "/do/10.1145/contrib-81328490974/rel-imgonly/max-android.jpg",
      "acmid": "81328490974",
      "orcid": "0000-0003-3873-6366"
    },
    {
      "name": "Daniel Smith",
      "institution": "University of Southampton, Southampton, Hampshire, United Kingdom",
      "img": "/do/10.1145/contrib-81100080112/rel-imgonly/n286108029_3734675_4929_300px.jpg",
      "acmid": "81100080112",
      "orcid": "missing"
    },
    {
      "name": "Ruben Stranders",
      "institution": "University of Southampton, Southampton, Hampshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436595950",
      "orcid": "missing"
    },
    {
      "name": "m.c. schraefel",
      "institution": "University of Southampton, Southampton , United Kingdom",
      "img": "/do/10.1145/contrib-81311483103/rel-imgonly/81311483103.jpg",
      "acmid": "81311483103",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamic, L. A., Zhang, J., Bakshy, E., and Ackerman, M. S. Knowledge sharing and yahoo answers: everyone knows something. In Proceeding of the 17th international conference on World Wide Web, WWW '08, ACM (New York, NY, USA, 2008), 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Andre, P., Bernstein, M., and Luther, K. Who gives a tweet: Evaluating microblog content value. In ACM Conference on Computer-Supported Cooperative Work (2012).  ",
      "doi": "10.1145/2145204.2145277"
    },
    {
      "text": "Aula, A., Khan, R. M., Guan, Z., Fontes, P., and Hong, P. A comparison of visual and textual page previews in judging the helpfulness of web pages. In Proceedings of the 19th international conference on World wide web, WWW '10, ACM (New York, NY, USA, 2010), 51--60.  ",
      "doi": "10.1145/1772690.1772697"
    },
    {
      "text": "Barrington, L., O'Malley, D., Turnbull, D., and Lanckriet, G. User-centered design of a social game to tag music. In Proceedings of the ACM SIGKDD Workshop on Human Computation, HCOMP '09, ACM (New York, NY, USA, 2009), 7--10.  ",
      "doi": "10.1145/1600150.1600152"
    },
    {
      "text": "Benevenuto, F., Magno, G., Rodrigues, T., and Almeida, V. Detecting spammers on twitter. In Collaboration, Electronic messaging, Anti-Abuse and Spam Conference (CEAS) (2010).",
      "doi": ""
    },
    {
      "text": "Boyd, D., Golder, S., and Lotan, G. Tweet, Tweet, Retweet: Conversational Aspects of Retweeting on Twitter. vol. 0, IEEE Computer Society (Los Alamitos, CA, USA, Jan. 2010), 1--10.  ",
      "doi": "10.1109/HICSS.2010.412"
    },
    {
      "text": "Brill, E. A simple rule-based part of speech tagger. In Proceedings of the third conference on Applied natural language processing, ANLC '92, Association for Computational Linguistics (Stroudsburg, PA, USA, 1992), 152--155.  ",
      "doi": "10.3115/974499.974526"
    },
    {
      "text": "Dann, S. Twitter content classification. First Monday 15, 12 (2010), 1--11.",
      "doi": ""
    },
    {
      "text": "Evans, B. M., and Chi, E. H. Towards a model of understanding social search. In Proceedings of the 2008 ACM conference on Computer supported cooperative work, CSCW '08, ACM (New York, NY, USA, 2008), 485--494.  ",
      "doi": "10.1145/1460563.1460641"
    },
    {
      "text": "Gernburd, P., and Jadad, A. R. Will spam overwhelm our defenses? evaluating offerings for drugs and natural health products. PLoS Med 4, 9 (09 2007), e274.",
      "doi": ""
    },
    {
      "text": "Hacker, S., and von Ahn, L. Matchin: eliciting user preferences with an online game. In Proceedings of the 27th international conference on Human factors in computing systems, CHI '09, ACM (New York, NY, USA, 2009), 1207--1216.  ",
      "doi": "10.1145/1518701.1518882"
    },
    {
      "text": "Harper, F. M., Raban, D., Rafaeli, S., and Konstan, J. A. Predictors of answer quality in online q&a sites. In Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, CHI '08, ACM (New York, NY, USA, 2008), 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Jansen, B. J., Zhang, M., Sobel, K., and Chowdury, A. Twitter power: Tweets as electronic word of mouth. J. Am. Soc. Inf. Sci. 60, 11 (2009), 2169--2188.  ",
      "doi": "10.5555/1656289.1656297"
    },
    {
      "text": "Java, A., Song, X., Finin, T., and Tseng, B. Why we twitter: understanding microblogging usage and communities. In Proceedings of the 9th WebKDD and 1st SNA-KDD 2007 workshop on Web mining and social network analysis, WebKDD/SNA-KDD '07, ACM (New York, NY, USA, 2007), 56--65.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Liu, S., Liu, F., Yu, C., and Meng, W. An effective approach to document retrieval via utilizing wordnet and recognizing phrases. In Proceedings of the 27th annual international ACM SIGIR conference on Research and development in information retrieval, SIGIR '04, ACM (New York, NY, USA, 2004), 266--272.  ",
      "doi": "10.1145/1008992.1009039"
    },
    {
      "text": "Mamykina, L., Manoim, B., Mittal, M., Hripcsak, G., and Hartmann, B. Design lessons from the fastest q&a site in the west. In Proceedings of the 2011 annual conference on Human factors in computing systems, CHI '11, ACM (New York, NY, USA, 2011), 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Naaman, M., Boase, J., and Lai, C.-H. Is it really about me?: message content in social awareness streams. In Proceedings of the 2010 ACM conference on Computer supported cooperative work, CSCW '10, ACM (New York, NY, USA, 2010), 189--192.  ",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Paul, S., Hong, L., and Chi, E. Is twitter a good place for asking questions? a characterization study, 2011.",
      "doi": ""
    },
    {
      "text": "Savage, P. User interface evaluation in an iterative design process: a comparison of three techniques. ACM, New York, NY, United States, 1996, 307--308.  ",
      "doi": "10.1145/257089.257335"
    },
    {
      "text": "Twitter, I. Streaming api methods. https://dev.twitter.com/docs/streaming-api/methods (2011).",
      "doi": ""
    },
    {
      "text": "van Kleek, M., Smith, D. A., Stranders, R., and schraefel, m. Spam filtering on twitter: a web thumbnail image comparison technique. In Technical Report, ECS (2011).",
      "doi": ""
    },
    {
      "text": "von Ahn, L., and Dabbish, L. Labeling images with a computer game. In Proceedings of the SIGCHI conference on Human factors in computing systems, CHI '04, ACM (New York, NY, USA, 2004), 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "von Ahn, L., and Dabbish, L. Designing games with a purpose. Commun. ACM 51 (August 2008), 58--67.  ",
      "doi": "10.1145/1378704.1378719"
    }
  ]
}