{
  "doi": "10.1145/2207676.2208351",
  "title": "The design space of opinion measurement interfaces: exploring recall support for rating and ranking",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2035-2044",
  "year": 2012,
  "badges": [],
  "abstract": "Rating interfaces are widely used on the Internet to elicit people's opinions. Little is known, however, about the effectiveness of these interfaces and their design space is relatively unexplored. We provide a taxonomy for the design space by identifying two axes: Measurement Scale for absolute rating vs. relative ranking, and Recall Support for the amount of information provided about previously recorded opinions. We present an exploration of the design space through iterative prototyping of three alternative interfaces and their evaluation. Among many findings, the study showed that users do take advantage of recall support in interfaces, preferring those that provide it. Moreover, we found that designing ranking systems is challenging; there may be a mismatch between a ranking interface that forces people to specify a total ordering for a set of items, and their mental model that some items are not directly comparable to each other.",
  "authors": [
    {
      "name": "Syavash Nobarany",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502773155",
      "orcid": "missing"
    },
    {
      "name": "Louise Oram",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658500",
      "orcid": "missing"
    },
    {
      "name": "Vasanth Kumar Rajendran",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502754435",
      "orcid": "missing"
    },
    {
      "name": "Chi-Hsiang Chen",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725390",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Tamara Munzner",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047885",
      "orcid": "0000-0002-3294-3869"
    }
  ],
  "references": [
    {
      "text": "Abeyratna, S., Paramei, G., Tawfik, H., and Huang, R. An affective interface for conveying user feedback. Proc. Computer Modeling and Simulation, IEEE Computer Society (2010), 369--374.  ",
      "doi": "10.1109/UKSIM.2010.75"
    },
    {
      "text": "Alwin, D.F. and Krosnick, J.A. The measurement of values in surveys: A comparison of ratings & rankings. Public Opinion Quarterly 49, 4 (1985), 535 -552.",
      "doi": ""
    },
    {
      "text": "Amatriain, X., Pujol, J., and Oliver, N. I like it... I like it not: Evaluating user ratings noise in recommender systems. Proc. UMAP 2009. Springer (2009), 247--258.  ",
      "doi": "10.1007/978-3-642-02247-0_24"
    },
    {
      "text": "Amatriain, X., Pujol, J.M., Tintarev, N., and Oliver, N. Rate it again: increasing recommendation accuracy by user re-rating. Proc. RecSys 2009, ACM (2009), 173--180.  ",
      "doi": "10.1145/1639714.1639744"
    },
    {
      "text": "Cades, D.M., Trafton, J.G., Boehm Davis, D.A., and Monk, C.A. Does the difficulty of an interruption affect our ability to resume? Proc. Human Factors and Ergonomics Society Annual Meeting 51, (2007), 234--238.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Karlson, A., and Bederson, B. A review of overview+detail, zooming, and focus+context interfaces. ACM Computing Surveys 41, (2009), Article 2.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Cosley, D., Lam, S., Albert, I., Konstan, J., and Riedl, J. Is seeing believing?: How recommender system interfaces affect users' opinions. Proc. CHI 2003, ACM (2003), 585--592.  ",
      "doi": "10.1145/642611.642713"
    },
    {
      "text": "Eagly, A.H. and Chaiken, S. The Psychology of Attitudes. Wadsworth, Belmont, CA, USA, 1993.",
      "doi": ""
    },
    {
      "text": "Gawronski, B. Attitudes can be measured! But what is an attitude? Social Cognition 25, 5 (2007), 573--581.",
      "doi": ""
    },
    {
      "text": "Harper, F., Li, X., Chen, Y., and Konstan, J. An economic model of user rating in an online recommender system. Proc. UM 2005. Springer (2005), 307--316.  ",
      "doi": "10.1007/11527886_40"
    },
    {
      "text": "Herlocker, J., Konstan, J., Borchers, A., and Riedl, J. An algorithmic framework for performing collaborative filtering. Proc. SIGIR 1999, ACM (1999), 230--237.  ",
      "doi": "10.1145/312624.312682"
    },
    {
      "text": "Ivanov, A., Erickson, T., and Cyr, D. Plot-polling: Collaborative knowledge visualization for online discussions. Proc. International Conference on Information Visualization 2006, IEEE Computer Society (2006), 205--210.  ",
      "doi": "10.1109/IV.2006.84"
    },
    {
      "text": "Klein, M., Dülmer, H., Ohr, D., Quandt, M., and Rosar, U. Response sets in the measurement of values: A comparison of rating and ranking procedures. International Journal of Public Opinion Research 16, 4 (2004), 474 -483.",
      "doi": ""
    },
    {
      "text": "Krosnick, J.A., Judd, C.M., and Wittenbrink, B. The Measurement of Attitudes. In The Handbook of Attitudes. 2005, 21--76.",
      "doi": ""
    },
    {
      "text": "Lietz, P. Research into questionnaire design. International Journal of Market Research 52, 2 (2010), 249--272.",
      "doi": ""
    },
    {
      "text": "Owen, A.M., McMillan, K.M., Laird, A.R., and Bullmore, E. N-back working memory paradigm: a metaanalysis of normative functional neuroimaging studies. Human Brain Mapping 25, 1 (2005), 46--59.",
      "doi": ""
    },
    {
      "text": "Ozakca, M. and Lim, Y.-K. A study of reviews and ratings on the internet. Ext. abstracts CHI 2006, ACM (2006), 1181--1186.  ",
      "doi": "10.1145/1125451.1125673"
    },
    {
      "text": "Philip, B.R. Generalization and central tendency in the discrimination of a series of stimuli. Canadian Journal of Psychology 1, 4 (1947), 196--204.",
      "doi": ""
    },
    {
      "text": "Preston, C.C. and Colman, A.M. Optimal number of response categories in rating scales: reliability, validity, discriminating power, and respondent preferences. Acta Psychologica 104, 1 (2000), 1--15.",
      "doi": ""
    },
    {
      "text": "Reips, U.-D. and Funke, F. Interval-level measurement with visual analogue scales in Internet-based research: VAS Generator. Behavior Research Methods 40, (2008), 699--704.",
      "doi": ""
    },
    {
      "text": "Van Schaik, P. and Ling, J. Design parameters of rating scales for web sites. ACM Transactions on ComputerHuman Interaction 14, 1 (2007), Article 4.  ",
      "doi": "10.1145/1229855.1229859"
    },
    {
      "text": "Thurstone, L.L. Attitudes Can Be Measured. The American Journal of Sociology 33, 4 (1928), 529--554.",
      "doi": ""
    },
    {
      "text": "Turnbull, D. Rating, voting & ranking: designing for collaboration & consensus. Ext. abstracts CHI 2007, ACM (2007), 2705--2710.  ",
      "doi": "10.1145/1240866.1241066"
    },
    {
      "text": "Willett, W., Heer, J., and Agrawala, M. Scented widgets: Improving navigation cues with embedded visualizations. IEEE Transactions on Visualization and Computer Graphics 13, 6 (2007), 1129--1136.  ",
      "doi": "10.1109/TVCG.2007.70589"
    },
    {
      "text": "Ye, Q., Law, R., and Gu, B. The impact of online user reviews on hotel room sales. International Journal of Hospitality Management 28, 1 (2009), 180--182.",
      "doi": ""
    }
  ]
}