{
  "doi": "10.1145/2207676.2208376",
  "title": "User learning and performance with bezel menus",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2221-2230",
  "year": 2012,
  "badges": [],
  "abstract": "Touchscreen phones tend to require constant visual attention, thus not allowing eyes-free interaction. For users with visual impairment, or when occupied with another task that requires a user's visual attention, these phones can be difficult to use. Recently, marks initiating from the bezel, the physical touch-insensitive frame surrounding a touchscreen display, have been proposed as a method for eyes-free interaction. Due to the physical form factor of the mobile device, it is possible to access different parts of the bezel eyes-free. In this paper, we first studied the performance of different bezel menu layouts. Based on the results, we designed a bezel-based text entry application to gain insights into how bezel menus perform in a real-world application. From a longitudinal study, we found that the participants achieved 9.2 words per minute in situations requiring minimal visual attention to the screen. After only one hour of practice, the participants transitioned from novice to expert users. This shows that bezel menus can be adopted for realistic applications.",
  "tags": [
    "bezel menu",
    "eyes-free interaction",
    "text entry",
    "touchscreen phones"
  ],
  "authors": [
    {
      "name": "Mohit Jain",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529179",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. More Than Dotting the i's - Foundations for Crossing-based Interfaces. CHI 2002, ACM, 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Andersen, T. H. and Zhai, S. \"Writing with Music\": Exploring the Use of Auditory Feedback in Gesture Interfaces. ACM Transactions on Applied Perception 7, 3 (2010), 1--24.  ",
      "doi": "10.1145/1773965.1773968"
    },
    {
      "text": "Apple - Accessibility - iPhone - VoiceOver. http://www.apple.com/accessibility/iphone/vision.html",
      "doi": ""
    },
    {
      "text": "PlayBook. http://us.blackberry.com/playbook-tablet/",
      "doi": ""
    },
    {
      "text": "Bonner, M. N. et al. No-Look Notes: Accessible Eyes-Free Multi-touch Text Entry. Pervasive 2010, 409--426.  ",
      "doi": "10.1007/978-3-642-12654-3_24"
    },
    {
      "text": "Bragdon, A. et al. Experimental Analysis of Touch-Screen Gesture Designs in Mobile Environments. CHI 2011, ACM, 403--412.  ",
      "doi": "10.1145/1978942.1979000"
    },
    {
      "text": "Callahan, J. et al. An Empirical Comparison of Pie vs. Linear Menus. CHI 1988, ACM, 95--100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Castellucci, S. J. and MacKenzie, I. S. Graffiti vs. Unistrokes: An Empirical Comparison. CHI 2008, ACM, 305--308.  ",
      "doi": "10.1145/1357054.1357106"
    },
    {
      "text": "Clarkson, E., Clawson, J., Lyons, K. and Starner, T. An Empirical Study of Typing Rates on mini-QWERTY Keyboards. Ext. Abstracts CHI 2005, ACM, 1288--91.  ",
      "doi": "10.1145/1056808.1056898"
    },
    {
      "text": "Concise Oxford Dictionary Letter Frequency: http://www.oxforddictionaries.com/page/133",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Wobbrock, J. and Kane, S. K. Barrier Pointing: Using Physical Edges to Assist Target Acquisition on Mobile Device Touch Screens. ASSETS 2007, ACM, 19--26.  ",
      "doi": "10.1145/1296843.1296849"
    },
    {
      "text": "Goldberg, D. and Richardson, C. Touch-Typing with a Stylus. CHI 1993, ACM, 80--87.  ",
      "doi": "10.1145/169059.169093"
    },
    {
      "text": "Hinckley, K. et al. Pen + Touch = New Tools. UIST 2010, ACM, 27--36.  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Isokoski, P. and Linden, T. Effect of Foreign Language on Text Transcription Performance: Finns Writing English. NordiCHI 2004, ACM, 109--112.  ",
      "doi": "10.1145/1028014.1028032"
    },
    {
      "text": "Kristensson, P. and Zhai, S. SHARK2 : A Large Vocabulary Shorthand Writing System for Pen-based Computers. UIST 2004, ACM, 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. The Limits of Expert Performance Using Hierarchic Marking Menus. INTERCHI 1993, ACM, 482--487.  ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Least Squares Fitting. http://mathworld.wolfram.com/LeastSquaresFitting.html",
      "doi": ""
    },
    {
      "text": "Li, F. C. Y. et al. Virtual Shelves: Interactions with Orientation Aware Devices. UIST 2009, ACM, 125--128.  ",
      "doi": "10.1145/1622176.1622200"
    },
    {
      "text": "Lyons, K., et al. Twiddler Typing: One-Handed Chording Text Entry for Mobile Phones. CHI 2004, ACM, 671--678.  ",
      "doi": "10.1145/985692.985777"
    },
    {
      "text": "MacKenzie, I. S. KSPC (Keystrokes per Character) as a Characteristic of Text Entry Techniques. HCI with Mobile Devices 2002, Springer-Verlag, 195--210. ",
      "doi": "10.5555/645739.666587"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. A Character-level Error Analysis Technique for Evaluating Text Entry Methods. NordiCHI 2002, ACM, 243--246.  ",
      "doi": "10.1145/572020.572056"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. Text Entry for Mobile Computing: Models and Methods, Theory and Practice. HCI 17, (2002), 147--198.",
      "doi": ""
    },
    {
      "text": "Mankoff, J. and Abowd, G. D. Cirrin: A Word-level Unistroke Keyboard for Pen Input. UIST 1998, ACM, 213--214.  ",
      "doi": "10.1145/288392.288611"
    },
    {
      "text": "McGookin, D., Stephen, B. and WeiWei, J. Investigating Touchscreen Accessibility for People with Visual Impairments. NordiCHI 2008, ACM, 298--307.  ",
      "doi": "10.1145/1463160.1463193"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V. and Kuorelahti, J. Interaction in 4-second Bursts: the Fragmented Nature of Attentional Resources in Mobile HCI. CHI 2005, ACM, 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Perlin, K. Quikwriting: Continuous Stylus-based Text Entry. UIST 1998, ACM, 215--216.  ",
      "doi": "10.1145/288392.288613"
    },
    {
      "text": "Roth, V. and Turner, T. Bezel Swipe: Conflict-Free Scrolling and Multiple Selection on Mobile Touch Screen Devices. CHI 2009, ACM, 1523--1526.  ",
      "doi": "10.1145/1518701.1518933"
    },
    {
      "text": "Sanchez, J. and Aguayo, F. Mobile Messenger for the Blind. ERCIM 2007, Springer-Verlag, 369--385. ",
      "doi": "10.5555/1783789.1783817"
    },
    {
      "text": "Sears, A. et al. When Computers Fade: Pervasive Computing and Situationally-induced Impairments and Disabilities. HCI: Theory and Practice 2003, 1298--1302.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. Measuring Errors in Text Entry Tasks: An Application of the Levenshtein String Distance Statistic. Ext. Abstracts of CHI 2001, ACM,319--320.  ",
      "doi": "10.1145/634067.634256"
    },
    {
      "text": "StreamAnalyzer. http://depts.washington.edu/ewrite/downloads/texteval.zip",
      "doi": ""
    },
    {
      "text": "T9 The Global Standard for Mobile Text Input. http://www.nuance.com/for-business/by-product/t9/index.htm",
      "doi": ""
    },
    {
      "text": "Tinwala, H. and Mackenzie, I. S. Eyes-free Text Entry on a Touchscreen Phone. TIC-STH 2009, IEEE, 83--89.",
      "doi": ""
    },
    {
      "text": "Venolia, D. and Neiberg, F. T-Cube: A Fast, Self-Disclosing Pen-Based Alphabet. CHI 1994, ACM, 265--270.  ",
      "doi": "10.1145/191666.191761"
    },
    {
      "text": "Wobbrock, J. O., Myers, B. A. and Kembel, J. A. EdgeWrite: A Stylus-based Text Entry Method Designed for High Accuracy and Stability of Motion. UIST 2003, ACM, 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Wobbrock, J. O., Wilson, A. D. and Li, Y. Gestures Without Libraries, Toolkits or Training: a $1 Recognizer for User Interface Prototypes. UIST 2007, ACM, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Yfantidis, G. and Evreinov, G. Adaptive Blind Interaction Technique for Touchscreens. Universal Access in the Information Society 4, 4 (2006), 328--337.  ",
      "doi": "10.1007/s10209-004-0109-7"
    },
    {
      "text": "Zhao, S. and Balakrishnan, R. Simple vs. Compound Mark Hierarchical Marking Menus. UIST 2004, ACM, 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}