{
  "doi": "10.1145/2207676.2207736",
  "title": "Guidelines are only half of the story: accessibility problems encountered by blind users on the web",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "433-442",
  "year": 2012,
  "badges": [],
  "abstract": "This paper describes an empirical study of the problems encountered by 32 blind users on the Web. Task-based user evaluations were undertaken on 16 websites, yielding 1383 instances of user problems. The results showed that only 50.4% of the problems encountered by users were covered by Success Criteria in the Web Content Accessibility Guidelines 2.0 (WCAG 2.0). For user problems that were covered by WCAG 2.0, 16.7% of websites implemented techniques recommended in WCAG 2.0 but the techniques did not solve the problems. These results show that few developers are implementing the current version of WCAG, and even when the guidelines are implemented on websites there is little indication that people with disabilities will encounter fewer problems. The paper closes by discussing the implications of this study for future research and practice. In particular, it discusses the need to move away from a problem-based approach towards a design principle approach for web accessibility.",
  "tags": [
    "accessibility guidelines",
    "blind users",
    "web accessibility",
    "user evaluation"
  ],
  "authors": [
    {
      "name": "Christopher Power",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100082155",
      "orcid": "missing"
    },
    {
      "name": "André Freire",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100284962",
      "orcid": "missing"
    },
    {
      "name": "Helen Petrie",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022960",
      "orcid": "missing"
    },
    {
      "name": "David Swallow",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/do/10.1145/contrib-81311485720/rel-imgonly/david_swallow.jpg",
      "acmid": "81311485720",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Research Based Web Design & Usability Guidelines. U.S. General Services Administration, 2004.",
      "doi": ""
    },
    {
      "text": "Equality Act 2010. Government Equalities Office, 2010.",
      "doi": ""
    },
    {
      "text": "Alonso, F., Fuertes, J. L., González, Á. L. and Martíez, L. On the testability of WCAG 2.0 for beginners. In Proc. of W4A'10, ACM (2010).  ",
      "doi": "10.1145/1805986.1806000"
    },
    {
      "text": "Babu, R. and Singh, R. (2009) Evaluation of Web Accessibility and Usability from Blind User's Perspective: The Context of Online Assessment, in (AISeL), A. E. L., ed. Americas Conference on Information Systems (AMCIS) 2009, San Francisco, Paper 623, 2009.",
      "doi": ""
    },
    {
      "text": "Brajnik, G., Yesilada, Y. and Harper, S. Testability and validity of WCAG 2.0: the expertise effect. In Proc. of ASSETS 2010, ACM (2010), 43--50.  ",
      "doi": "10.1145/1878803.1878813"
    },
    {
      "text": "Caldwell, B., Cooper, M., Guarino Reid, L. and Vanderheiden, G. Web Content Accessibility Guidelines (WCAG) 2.0. Web Accessibility Initiative (WAI), World Wide Web Consoritum (W3C), 2008. Retrieved from http://www.w3.org/TR/WCAG20/ on Jan. 15, 2012.",
      "doi": ""
    },
    {
      "text": "Colwell, C. and Petrie, H. Evaluation of guidelines for designing accessible Web content. SIGCAPH Comput. Phys. Handicap., 70 (2001), 11--13.  ",
      "doi": "10.1145/501078.501082"
    },
    {
      "text": "Cooper, M., Guarino Reid, L., Vanderheiden, G. and Caldwell, B. Understanding WCAG 2.0: A guide to understanding and implementing Web Content Accessibility Guidelines 2.0. Web Accessibility Initiative (WAI), World Wide Web Consortium (W3C), 2010. Retrieved from http://www.w3.org/TR/UNDERSTANDINGWCAG20/ on Jan. 15, 2012.",
      "doi": ""
    },
    {
      "text": "Cooper, M., Guarino Reid, L., Vanderheiden, G. and Caldwell, B. Techniques for WCAG 2.0: Techniques and Failures for Web Content Accessibility Guidelines 2.0. Web Accessibility Initiative (WAI), World Wide Web Consortium (W3C), 2010. Retrieved from http://www.w3.org/TR/WCAG20-TECHS/ on Jan. 15, 2012.",
      "doi": ""
    },
    {
      "text": "Disability Rights Commission. The Web: access and inclusion for disabled people - A formal Investigation conducted by the Disability Rights Commission. Disability Rights Commission, 2004,",
      "doi": ""
    },
    {
      "text": "Donnelly, A. and Magennis, M. Making Accessibility Guidelines Usable. In Proc. Universal Access: Theoretical Perspectives, Practice and Experience, Springer (2003), 56--57. ",
      "doi": "10.5555/1765426.1765431"
    },
    {
      "text": "Freed, F. and Rothberg, M. Accessible Digital Media Guidelines, National Centre for Accessible Media Website, (2006). Retrieved from http://ncam.wgbh.org/invent_build/web_multimedia/accessible-digital-media-guide on Jan. 15, 2012.",
      "doi": ""
    },
    {
      "text": "Goette, T., Collier, C. and Daniels White, J. An exploratory study of the accessibility of state government Web sites. Universal Access in the Information Society, 5, 1 (2006), 41--50.  ",
      "doi": "10.1007/s10209-006-0023-2"
    },
    {
      "text": "Hackett, S. and Parmanto, B. A longitudinal evaluation of accessibility: higher education web sites. Internet Research, 15, 3 (2005), 281--294.",
      "doi": ""
    },
    {
      "text": "Henry, S. L. Introduction to Web Accessibility. Web Accessibility Initiative (WAI), World Wide Web Consortium (W3C), 2005. Retrieved from: http://www.w3.org/WAI/intro/accessibility.php on Jan. 15, 2012.",
      "doi": ""
    },
    {
      "text": "Kane, S. K., Shulman, J. A., Shockley, T. J. and Ladner, R. E. A web accessibility report card for top international university web sites. In Proc. of W4A'07, ACM (2007), 148--156.  ",
      "doi": "10.1145/1243441.1243472"
    },
    {
      "text": "Kelly, B., Sloan, D., Phipps, L., Petrie, H. and Hamilton, F. Forcing standardization or accommodating diversity?: a framework for applying the WCAG in the real world. In Proc. of W4A'05, ACM (2005), 46--54.  ",
      "doi": "10.1145/1061811.1061820"
    },
    {
      "text": "Lazar, J., Dudley-Sponaugle, A. and Greenidge, K.-D. Improving web accessibility: a study of webmaster perceptions. Computers in Human Behavior, 20, 2 (2004), 269--288.",
      "doi": ""
    },
    {
      "text": "Lazar, J. and Greenridge, K.-D. One year older, but not necessarily wiser: an evaluation of homepage accessibility problems over time. Universal Access in the Information Society, 4, 4 (2006), 285--291.  ",
      "doi": "10.1007/s10209-003-0087-1"
    },
    {
      "text": "Leporini, B. and Paternò, F. Applying Web Usability Criteria for Vision-Impaired Users: Does It Really Improve Task Performance? International Journal of Human-Computer Interaction, 24, 1 (2008), 17--47.",
      "doi": ""
    },
    {
      "text": "Leuthold, S., Bargas-Avila, J. A. and Opwis, K. Beyond web content accessibility guidelines: Design of enhanced text user interfaces for blind internet users. International Journal of Human-Computer Studies, 66, 4 (2008), 257--270.  ",
      "doi": "10.1016/j.ijhcs.2007.10.006"
    },
    {
      "text": "Lopes, R., Gomes, D. and Carriço, L. Web Not For All: A Large Scale Study of Web Accessibility. In Proc. of W4A'10, ACM (2010), 10.  ",
      "doi": "10.1145/1805986.1806001"
    },
    {
      "text": "Nielsen, J. Usability Engineering. Morgan Kaufmann, Boston, MA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Petrie, H., Badani, A. and Bhalla, A. Sex, lies and web accessibility: the use of accessibility logos and statements on e-commerce and financial websites. In Proc. of ADDW 2005, University of Dundee (2005). ",
      "doi": "10.5555/2227734.2227751"
    },
    {
      "text": "Petrie, H. and Kheir, O. The relationship between accessibility and usability of websites. In Proc. of CHI'07, ACM (2007), 397--406.  ",
      "doi": "10.1145/1240624.1240688"
    },
    {
      "text": "Petrie, H., Power, C., Swallow, D., Velasco, C. A., Gallagher, B., Magennis, M., Murphy, E., Collin, S. and Down, K. The value chain of web accessibility: challenges and opportunities. In Proc. of ADDW 2011, Sun SITE Central Europe (2011).",
      "doi": ""
    },
    {
      "text": "Power, C., Petrie, H., Freire, A. and Swallow, D. Remote Evaluation of WCAG 2.0 Techniques by Web Users with Visual Disabilities. In Proc. of UAHCI: Design for All and eInclusion, 6765, (2011), 285--294. ",
      "doi": "10.5555/2022591.2022625"
    },
    {
      "text": "Regan, B. Accessibility and design: a failure of the imagination. In Proc. of W4A'04, ACM (2004), 29--37.  ",
      "doi": "10.1145/990657.990663"
    },
    {
      "text": "Rømen, D. and Svanæs, D. Evaluating web site accessibility: validating the WAI guidelines through usability testing with disabled users. In Proc. of the 5th NordiCHI 2008, ACM (2008), 535--538.  ",
      "doi": "10.1145/1463160.1463238"
    },
    {
      "text": "Sloan, D., Gregor, P., Booth, P. and Gibson, L. Auditing accessibility of UK Higher Education web sites. Interacting with Computers, 14, 4 (2002), 313--325.",
      "doi": ""
    },
    {
      "text": "Thatcher, J., Burkes, M. R., Heilmann, C., Henry, S. L., Kirkpatrick, A., Lauke, P. H., Lawson, B., Regan, B., Rutter, R., Urban, M. and Waddel, C. D. Web accessibility: web standards and regulatory compliance. Friends of ED, 2006. ",
      "doi": "10.5555/1162223"
    },
    {
      "text": "Vanderheiden, G., Chisholm, W. and Jacobs, I. Web Content Accessibility Guildeines 1.0. Web Accessibility Initiative (WAI), World Wide Web Consortium (W3C), 1999. Retrieved from: http://www.w3.org/TR/WAI-WEBCONTENT/ on Jan. 15, 2012.",
      "doi": ""
    },
    {
      "text": "Williams, R. and Rattray, R. An assessment of Web accessibility of UK accountancy firms. Managerial Auditing Journal, 18, 9 (2003), 710--716.",
      "doi": ""
    }
  ]
}