{
  "doi": "10.1145/2207676.2208620",
  "title": "LemonAid: selection-based crowdsourced contextual help for web applications",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1549-1558",
  "year": 2012,
  "badges": [],
  "abstract": "Web-based technical support such as discussion forums and social networking sites have been successful at ensuring that most technical support questions eventually receive helpful answers. Unfortunately, finding these answers is still quite difficult, since users' textual queries are often incomplete, imprecise, or use different vocabularies to describe the same problem. We present LemonAid, a new approach to help that allows users to find help by instead selecting a label, widget, link, image or other user interface (UI) element that they believe is relevant to their problem. LemonAid uses this selection to retrieve previously asked questions and their corresponding answers. The key insight that makes LemonAid work is that users tend to make similar selections in the interface for similar help needs and different selections for different help needs. Our initial evaluation shows that across a corpus of dozens of tasks and thousands of requests, LemonAid retrieved a result for 90% of help requests based on UI selections and, of those, over half had relevant matches in the top 2 results.",
  "authors": [
    {
      "name": "Parmit K. Chilana",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81416609224/rel-imgonly/parmit2015linkedin.jpg",
      "acmid": "81416609224",
      "orcid": "missing"
    },
    {
      "name": "Amy J. Ko",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S. and Malone, T.W. Answer Garden: a tool for growing organizational memory. Proc ACM SIGOIS (1990), 31--39.  ",
      "doi": "10.1145/91474.91485"
    },
    {
      "text": "Adar, E., Dontcheva, M., Fogarty, J., and Weld, D.S. Zoetrope: interacting with the ephemeral web. Proc ACM UIST (2008), 239--248.  ",
      "doi": "10.1145/1449715.1449756"
    },
    {
      "text": "Belkin, N.J. Helping people find what they don't know. Commun. ACM 43, 8 (2000), 58--61.  ",
      "doi": "10.1145/345124.345143"
    },
    {
      "text": "Bolin, M., Webber, M., Rha, P., Wilson, T., and Miller, R.C. Automation and customization of rendered web pages. Proc ACM UIST (2005), 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Brandt, J., Dontcheva, M., Weskamp, M., and Klemmer, S.R. Example-centric programming: integrating web search into the development environment. Proc ACM CHI (2010), 513--522.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Chilana, P.K., Grossman, T., and Fitzmaurice, G. Modern software product support processes and the usage of multimedia formats. Proc ACM CHI (2011), 3093--3102.  ",
      "doi": "10.1145/1978942.1979400"
    },
    {
      "text": "Delisle, S. and Moulin, B. User interfaces and help systems: from helplessness to intelligent assistance. Artificial Intelligence Review 18, 2 (2002), 117--157.  ",
      "doi": "10.1023/A%3A1015179704819"
    },
    {
      "text": "Downs, J.S., Holbrook, M.B., Sheng, S., and Cranor, L.F. Are your participants gaming the system?: screening mechanical turk workers. Proc ACM CHI, (2010), 2399--2402.  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Ekstrand, M., Li, W., Grossman, T., Matejka, J., and Fitzmaurice, G. Searching for software learning resources using application context. Proc ACM UIST (2011), 195--204.  ",
      "doi": "10.1145/2047196.2047220"
    },
    {
      "text": "Farkas, D.K. The role of balloon help. ACM SIGDOC 17, 2 (1993), 3--19.  ",
      "doi": "10.1145/154425.154426"
    },
    {
      "text": "Furnas, G.W., Landauer, T.K., Gomez, L.M., and Dumais, S.T. The vocabulary problem in human-system communication. Commun. ACM 30, 11 (1987), 964--971.  ",
      "doi": "10.1145/32206.32212"
    },
    {
      "text": "Grossman, T. and Fitzmaurice, G. Toolclips: An investigation of contextual video assistance for functionality understanding. Proc ACM CHI (2010), 1515--1524.  ",
      "doi": "10.1145/1753326.1753552"
    },
    {
      "text": "Harper, F.M., Raban, D., Rafaeli, S., and Konstan, J.A. Predictors of answer quality in online Q&A sites. Proc ACM CHI (2008), 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Hartmann, B., MacDougall, D., Brandt, J., and Klemmer, S.R. What would other programmers do: suggesting solutions to error messages. Proc ACM CHI (2010), 1019--1028.  ",
      "doi": "10.1145/1753326.1753478"
    },
    {
      "text": "Hastie, H.W., Johnston, M., and Ehlen, P. ContextSensitive Help for Multimodal Dialogue. Proc IEEE ICMI (2002), 93.  ",
      "doi": "10.1109/ICMI.2002.1166975"
    },
    {
      "text": "Horvitz, E. Principles of mixed-initiative user interfaces. Proc ACM CHI (1999), 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Kittur, A., Chi, H., and Suh, B. Crowdsourcing user studies with Mechanical Turk. Proc ACM CHI (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Ko, A.J. and Myers, B.A. Designing the whyline: a debugging interface for asking questions about program behavior. Proc ACM CHI (2004), 151--158.  ",
      "doi": "10.1145/985692.985712"
    },
    {
      "text": "Lakhani, K.R. and Von Hippel, E. How open source software works: \"free\" user-to-user assistance. Research policy 32, 6 (2003), 923--943.",
      "doi": ""
    },
    {
      "text": "Matejka, J., Grossman, T., and Fitzmaurice, G. IP-QAT: In-Product Questions, Answers & Tips. Proc ACM UIST (2011), 175--184.  ",
      "doi": "10.1145/2047196.2047218"
    },
    {
      "text": "Matejka, J., Li, W., Grossman, T., and Fitzmaurice, G. CommunityCommands: command recommendations for software applications. Proc ACM UIST (2009), 193--202.  ",
      "doi": "10.1145/1622176.1622214"
    },
    {
      "text": "Morris, M.R., Teevan, J., and Panovich, K. What do people ask their social networks, and why?: a survey study of status message q&a behavior. Proc ACM CHI (2010), 1739--1748.  ",
      "doi": "10.1145/1753326.1753587"
    },
    {
      "text": "Myers, B.A., Weitzman, D.A., Ko, A.J., and Chau, D.H. Answering why and why not questions in user interfaces. Proc ACM CHI (2006), 397--406.  ",
      "doi": "10.1145/1124772.1124832"
    },
    {
      "text": "Pangoli, S. and Paternó, F. Automatic generation of task-oriented help. Proc ACM UIST (1995), 181--187.  ",
      "doi": "10.1145/215585.215971"
    },
    {
      "text": "Paolacci, G., Chandler, J., and Ipeirotis, P.G. Running experiments on amazon mechanical turk. Judgment and Decision Making 5, 5 (2010), 411--419.",
      "doi": ""
    },
    {
      "text": "Ramachandran, A. and Young, R.M. Providing intelligent help across applications in dynamic user and environment contexts. Proc ACM IUI (2005), 269--271.  ",
      "doi": "10.1145/1040830.1040893"
    },
    {
      "text": "Salton, G., Wong, A., and Yang, C.S. A vector space model for automatic indexing. Commun. ACM 18, 11 (1975), 613--620.  ",
      "doi": "10.1145/361219.361220"
    },
    {
      "text": "Singh, V., Twidale, M.B., and Nichols, D.M. Users of Open Source Software - How Do They Get Help? Proc HICSS (2009), 1--10.  ",
      "doi": "10.1109/HICSS.2009.489"
    },
    {
      "text": "Singh, V., Twidale, M.B., and Rathi, D. Open Source Technical Support: A Look at Peer Help-Giving. Proc HICSS (2006), 118.3.  ",
      "doi": "10.1109/HICSS.2006.370"
    },
    {
      "text": "Snow, R., O'Connor, B., Jurafsky, D., and Ng, A.Y. Cheap and fast--but is it good?: evaluating non-expert annotations for natural language tasks. Proc Empirical Methods in NLP (2008), 254--263. ",
      "doi": "10.5555/1613715.1613751"
    },
    {
      "text": "Stevens, G. and Wiedenhöfer, T. CHIC - a pluggable solution for community help in context. Proc ACM NordiCHI (2006), 212--221.  ",
      "doi": "10.1145/1182475.1182498"
    },
    {
      "text": "Sukaviriya, P. and Foley, J.D. Coupling a UI framework with automatic generation of context-sensitive animated help. Proc ACM SIGGRAPH (1990), 152--166.  ",
      "doi": "10.1145/97924.97942"
    },
    {
      "text": "Twidale, M.B. Over the shoulder learning: supporting brief informal learning. J CSCW 14, 6 (2005), 505--547.  ",
      "doi": "10.1007/s10606-005-9007-7"
    },
    {
      "text": "Tynan-Wood, C. The (Better) Future of Tech Support. InfoWorld, 2010.",
      "doi": ""
    },
    {
      "text": "Yeh, T., Chang, T.H., Xie, B., Walsh, G., Watkins, I., Wongsuphasawat, K., Huang, M., Davis, L., and Bederson, B. Creating contextual help for GUIs using screenshots. Proc UIST (2011), 145--154.  ",
      "doi": "10.1145/2047196.2047214"
    },
    {
      "text": "Amazon Mechanical Turk. http://www.mturk.com/.",
      "doi": ""
    },
    {
      "text": "TurboTax Support. http://turbotax.intuit.com/support/.",
      "doi": ""
    }
  ]
}