{
  "doi": "10.1145/2207676.2208686",
  "title": "Homeless young people on social network sites",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2825-2834",
  "year": 2012,
  "badges": [],
  "abstract": "This paper reports on the use of social network sites (MySpace and Facebook) by homeless young people, an extraordinary user population, made so in part by its vulnerability. Twenty-three participants of diverse ethnicities, 11 women and 12 men (mean age, 21.7 years), were interviewed in same-sex discussion groups of four participants each. The interviews consisted of questions about the uses, benefits, and harms of social network sites and how people present themselves online. Qualitative analysis of the discussion group transcripts shows how young people explore their identities, cultivate and exploit social ties, experience interpersonal tensions, manage incompatible audiences, and respond to shifting affiliations and transitions. From this analysis, implications for social intervention and technical design are presented, focused on maintaining ties with pro-social family and friends and with maintaining separation between communication spheres of incompatible audiences. This work contributes to the growing literature on vital, deeply human experiences that have become associated with social network sites.",
  "authors": [
    {
      "name": "Jill Palzkill Woelfer",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81435608664/rel-imgonly/resize_img_2697_fulbright1.jpg",
      "acmid": "81435608664",
      "orcid": "missing"
    },
    {
      "name": "David G. Hendry",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100622591",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barkhuus, L., and Tashiro, J. Student socialization in the age of Facebook. In Proc. CHI 2010, ACM Press (2010), 133--142.  ",
      "doi": "10.1145/1753326.1753347"
    },
    {
      "text": "Binder, J., Howes, A., and Sutcliffe, A. The problem of conflicting social spheres: Effects of network structure on experienced tension in social network sites. In Proc. CHI 2009, ACM Press (2009), 965--974.  ",
      "doi": "10.1145/1518701.1518849"
    },
    {
      "text": "Brubaker, J. R., and Hayes, G. R. SELECT * FROM USER: Infrastructure and socio-technical representation. In Proc. CSCW 2011, ACM Press (2011), 369--378.  ",
      "doi": "10.1145/1958824.1958881"
    },
    {
      "text": "DiMicco, J. M., and Millen, D. R. Identity management: Multiple presentations of self in Facebook. In Proc. GROUP 2007, ACM Press (2007), 383--386.  ",
      "doi": "10.1145/1316624.1316682"
    },
    {
      "text": "Egelman, S., Oates, A., and Krishnamurthi, S. Oops, I did it again: Mitigating repeated access control errors on Facebook. In Proc. CHI 2011, ACM Press (2011), 2295--2304.  ",
      "doi": "10.1145/1978942.1979280"
    },
    {
      "text": "Farnham, S. D., and Churchill, E. F. Faceted identity, faceted lives: Social and technical issues with being yourself online. In Proc. CSCW 2011, 259--368.  ",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "Hampton, K. N., Goulet, L. S., Rainie, L,. and Purcell, K. Social Network Sites and our Lives. Pew Research Center, Washington, D.C., 2011.",
      "doi": ""
    },
    {
      "text": "Hancock, J. T., Toma, C., and Ellison, N. The truth about lying in online dating profiles. In Proc. CHI 2007, ACM Press (2007), 449--452.  ",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Hendry, D. G., Woelfer, J. P., Bauer, T., Fitzer, T., and Champagne, M. How to integrate digital media into a drop-in for homeless young people for deepening relationships between youth and adults. Children and Youth Services Review, 33, 5 (2011), 774--782.",
      "doi": ""
    },
    {
      "text": "Horst, H. A. Families. In Hanging Out, Messing Around, and Geeking Out, M. Ito (Ed.). MIT Press, 2010, 149--194.",
      "doi": ""
    },
    {
      "text": "Kidd, S. A., and Davidson, L. \"You have to adapt because you have no other choice\": The stories of strength and resilience of 208 homeless youth in New York City and Toronto. Journal of Community Psychology, 35, 2 (2007), 219--238.",
      "doi": ""
    },
    {
      "text": "Lampe, C., Ellison, N. B., and Steinfield, C. A Face(book) in the crowd: Social searching vs. social browsing. In Proc. CSCW 2006, ACM Press (2006), 167--170.  ",
      "doi": "10.1145/1180875.1180901"
    },
    {
      "text": "Lampe, C., Ellison, N. B., and Steinfield, C. A. Changes in use and perception of Facebook. In Proc. CSCW 2008, ACM Press (2008), 721--730.  ",
      "doi": "10.1145/1460563.1460675"
    },
    {
      "text": "Lampe, C., and Ellison, N. B. Student athletes on Facebook. In Proc. CSCW 2010, ACM Press (2010), 193--196.  ",
      "doi": "10.1145/1718918.1718954"
    },
    {
      "text": "Lampinen, A., Tamminen, S., and Oulasvirta, A. \"All my people right here, right now\": Management of group co-presence on a social networking site. In Proc. Group 2009, ACM Press (2009), 281--290.  ",
      "doi": "10.1145/1531674.1531717"
    },
    {
      "text": "Lampinen, A., Lehtinen, V., Lehmuskallio, A., and Tamminen, S. We're in it together: Interpersonal management of disclosure in social network services. In Proc. CHI 2011, ACM Press (2011), 3217--3226.  ",
      "doi": "10.1145/1978942.1979420"
    },
    {
      "text": "Le Dantec, C. A., Farrell, R. G., Christensen, J. E., Bailey, M. Ellis, J. B., Kellogg, W. A., and Edwards, W. K. Publics in practice: Ubiquitous computing at a shelter for homeless mothers. In Proc. CHI 2011, ACM Press (2011), 1687--1696.  ",
      "doi": "10.1145/1978942.1979189"
    },
    {
      "text": "Le Dantec, C. A., and Edwards, W. K. Designs on dignity: Perceptions of technology among the homeless. In Proc. CHI 2008, ACM Press (2008), 627--636.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Manago, A. M., Graham, M. B., Greenfield, P. M., and Salimkhan, G. Self-presentation and gender on MySpace. Journal of Applied Developmental Psychology 29, 6 (2008), 446--458.",
      "doi": ""
    },
    {
      "text": "Marwick, A., and boyd, d. (2011). \"The Drama! Teen conflict in networked publics.\" Presented at the Oxford Internet Institute Decade in Internet Time Symposium.",
      "doi": ""
    },
    {
      "text": "Newell, A. F. Chapter 1 - Extra-ordinary humancomputer interaction (pp. 3--18). In Extra-ordinary Human-Computer Interaction. Cambridge University Press, New York, 1995. ",
      "doi": "10.5555/215596.215600"
    },
    {
      "text": "Rice, E. The positive role of social networks and social network technology in the condom-using behaviors of homeless young people. Public Health Reports, 125, (2010), 588--595.",
      "doi": ""
    },
    {
      "text": "Rice, E., Milburn, N. G., and Monro, W. Social network technology, social network composition, and reductions in substance use among homeless adolescents. Prevention Science 12, 1 (2011), 80--88.",
      "doi": ""
    },
    {
      "text": "Roberson, J., and Nardi, B. Survival needs and social inclusion: Technology use among the homeless. In Proc. CSCW 2010, ACM Press (2010), 445--448.  ",
      "doi": "10.1145/1718918.1718993"
    },
    {
      "text": "Skeels, M. M., and Grudin, J. When social networks cross boundaries: A case study of workplace use of Facebook and LinkedIn. In Proc. GROUP 2009, ACM Press (2009), 95--104.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Stutzman, F. D., and Hartzog, W. Boundary regulation in social media. In Proc. AOIR 2009, Milwaukee.",
      "doi": ""
    },
    {
      "text": "Whitbeck, L. B. Mental health and emerging adulthood among homeless young people. Psychology Press, New York, 2009.",
      "doi": ""
    },
    {
      "text": "Woelfer, J. P., and Hendry D. G. Homeless young people's experiences with information systems: Life and work in a community technology center. In Proc. CHI 2010, ACM Press (2010), 1291--1300.  ",
      "doi": "10.1145/1753326.1753520"
    },
    {
      "text": "Woelfer, J. P., and Hendry, D. G. Homeless young people and living with personal digital artifacts. In Proc. CHI 2011, ACM Press (2011), 1697--1706.  ",
      "doi": "10.1145/1978942.1979190"
    }
  ]
}