{
  "doi": "10.1145/2207676.2208727",
  "title": "Evaluation of human tangential force input performance",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3121-3130",
  "year": 2012,
  "badges": [],
  "abstract": "While interacting with mobile devices, users may press against touch screens and also exert tangential force to the display in a sliding manner. We seek to guide UI design based on the tangential force applied by a user to the surface of a hand-held device. A prototype of an interface using tangential force input was implemented utilizing a force sensitive layer and an elastic layer and used for the user experiment. We investigated user controllability to reach and maintain target force levels and considered the effects of hand pose and direction of force input. Our results imply no significant difference in performance when applying force holding the device in one hand and in two hands. We also observed that users have more physical and perceived loads when applying tangential force in the left-right direction compared to the up-down direction. Based on the experimental results, we discuss considerations for user interface applications of tangential-force-based interface.",
  "tags": [
    "force-based interface",
    "input devices",
    "mobile interaction"
  ],
  "authors": [
    {
      "name": "Bhoram Lee",
      "institution": "Samsung Advanced Institute of Technology, Yongin-si, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020586",
      "orcid": "missing"
    },
    {
      "name": "Hyunjeong Lee",
      "institution": "Samsung Advanced Institute of Technology, Yongin-si, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416601463",
      "orcid": "missing"
    },
    {
      "name": "Soo-Chul Lim",
      "institution": "Samsung Advanced Institute of Technology, Yongin-si, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659413678",
      "orcid": "missing"
    },
    {
      "name": "Hyungkew Lee",
      "institution": "Samsung Advanced Institute of Technology, Yongin-si, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502784885",
      "orcid": "missing"
    },
    {
      "name": "Seungju Han",
      "institution": "Samsung Advanced Institute of Technology, Yongin-si, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460640986",
      "orcid": "missing"
    },
    {
      "name": "Joonah Park",
      "institution": "Samsung Advanced Institute of Technology, Yongin-si, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416597784",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J., Zhai, Z., Beyond Fitts' law: models for trajectory-based HCI tasks. In Proc. CHI '97. ACM (1997), 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Card, S., English, W., Burr, B., Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT. Ergonomics (1978). 21(8): 601--613.",
      "doi": ""
    },
    {
      "text": "Casiez, G. and Vogel, D. The effect of spring stiffness and control gain with an elastic rate control pointing device. In Proc. CHI '08. ACM (2008), 1709--1718.  ",
      "doi": "10.1145/1357054.1357321"
    },
    {
      "text": "Clarkson, E. C., Patel, S. N., Pierce, J. S., Abowd, G. D., Exploring continuous pressure input for mobile phones. GVU Technical Report. GIT-GVU-06-20, 2006.",
      "doi": ""
    },
    {
      "text": "Heo, S., Lee, G., Force gestures: augmented touch screen gestures using normal and tangential force. Ext. Abstracts CHI ' ACM (2011), 1909--1914.  ",
      "doi": "10.1145/1979742.1979895"
    },
    {
      "text": "Heo, S., Lee, G., Force gestures: augmented touch screen gestures using normal and tangential force. In Proc. UIST '11. ACM (2011), 621--626.  ",
      "doi": "10.1145/2047196.2047278"
    },
    {
      "text": "Herot, C., Weinzapfel, G., One-Point Touch Input of Vector Information from Computer Displays. In Proc. SIGGRAPH '78. ACM (1978), 210--216.  ",
      "doi": "10.1145/800248.807392"
    },
    {
      "text": "Luczak, W. Oleksiuk, M. Bodnicki, Sensing tilt with MEMS Accelerometers. IEEE Sensors Journal (2006), 1669--1675.",
      "doi": ""
    },
    {
      "text": "McCallum D. C., Mak, E., Irani, P., Subramanian, S., PressureText: pressure input for mobile phone text entry. Ext. Abstracts CHI '09. ACM (2009), 4519--4524.  ",
      "doi": "10.1145/1520340.1520693"
    },
    {
      "text": "Minsky, M. R. Manipulating simulated objects with real-world gestures using a force and position sensitive screen. In Proc. SIGGRAPH '84. ACM (1984), 195--203.  ",
      "doi": "10.1145/800031.808598"
    },
    {
      "text": "Miyaki, T., Rekimoto, J., GraspZoom: zooming and scrolling control model for single-handed mobile interaction. In Proc. MobileHCI '09. ACM (2009), 81--84.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Mizobuchi, S., Terasaki, S., Keski-Jaskari, T., Nousiainen, J., Ryynanen, M., Silfverberg, M., Making an impression: force-controlled pen input for handheld devices. Ext. Abstracts CHI '05. ACM (2005), 1661--1664.  ",
      "doi": "10.1145/1056808.1056991"
    },
    {
      "text": "Moore, K. L., Dalley, A. F., Agur, A. M. R., Clinically Oriented Anatomy. 6th ed., Lippincott Williams & Wilkins (2010).",
      "doi": ""
    },
    {
      "text": "Nakazawa, N., Ikeura, R., Innoka, H., Characteristics of human fingertips in the shearing direction. Biological Cybernetics 82(3). Springer-Verlag (2000), 207--214.",
      "doi": ""
    },
    {
      "text": "Pataky, T. C., Latash, M. L., Zatsiorsky, V. M., Viscoelastic response of the finger pad to incremental tangential displacements. Journal of Biomechanics, 38 (2005). 1441--1449.",
      "doi": ""
    },
    {
      "text": "Quinn, P., Cockburn, A., Zoofing!: faster list selections with pressure-zoom-flick-scrolling. In Proc. OZCHI '09. ACM (2009),185--192.  ",
      "doi": "10.1145/1738826.1738856"
    },
    {
      "text": "Ramos, G., Boulos, M., Balakrishnan, R., Pressure widgets. In Proc. CHI '04. ACM (2004), 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Rekimoto, J., Schwesig, C., PreSenseII: Bi-directional touch and pressure sensing interactions with tactile feedback. Ext. Abstracts CHI '06. ACM (2006), 1253--1258.  ",
      "doi": "10.1145/1125451.1125685"
    },
    {
      "text": "Rutledge, J. D., Selker, T., Force-to-motion functions for pointing, In Proc. of Human-Computer Interaction - INTERACT'90. Springer (1990), 701--705. ",
      "doi": "10.5555/647402.725310"
    },
    {
      "text": "Selker, T., and Rutledge, J. Finger Force Precision for Computer Pointing. IBM RC 17342 (1991), 2--7.",
      "doi": ""
    },
    {
      "text": "Shi, K., Irani, P., Gustafson, S., Subramanian, S., PressureFish: a method to improve control of discrete pressure-based input. In Proc. CHI '08. ACM (2008), 1295--1298.  ",
      "doi": "10.1145/1357054.1357256"
    },
    {
      "text": "Silfverberg, M., MacKenzie, I. S., Kauppinen, T. An Isometric Joystick as a Pointing Device for Handheld Information Terminals. In Proc. Graphics Interface 2001, 119--126. ",
      "doi": "10.5555/780986.781001"
    },
    {
      "text": "Stewart, C., Rohs, M., Krats, S., Essl, G., Characteristics of pressure-based input for mobile devices. In Proc. CHI '10. ACM(2010), 801--810.  ",
      "doi": "10.1145/1753326.1753444"
    },
    {
      "text": "Wilson, G., Stewart, C., Brewster, S. A., Pressure-based menu selection for mobile devices. In Proc. MobileHCI '10. ACM (2010), 181--190.  ",
      "doi": "10.1145/1851600.1851631"
    },
    {
      "text": "Wilson, G., Brewster, S., Halvey, M., The effects of walking and control method on pressure-based interaction. Ext. Abstracts CHI '11. ACM (2011), 2275--2280.  ",
      "doi": "10.1145/1979742.1979943"
    }
  ]
}