{
  "doi": "10.1145/2207676.2208333",
  "title": "IllumiShare: sharing any surface",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1919-1928",
  "year": 2012,
  "badges": [],
  "abstract": "Task and reference spaces are important communication channels for remote collaboration. However, all existing systems for sharing these spaces have an inherent weakness: they cannot share arbitrary physical and digital objects on arbitrary surfaces. We present IllumiShare, a new cost-effective, light-weight device that solves this issue. It both shares physical and digital objects on arbitrary surfaces and provides rich referential awareness. To evaluate IllumiShare, we studied pairs of children playing remotely. They used IllumiShare to share the task-reference space and Skype Video to share the person space. The study results show that IllumiShare shared the play space in a natural and seamless way. We also found that children preferred having both spaces compared to having only one. Moreover, we found that removing the task-reference space caused stronger negative disruptions to the play task and engagement level than removing the person space. Similarly, we found that adding the task-reference space resulted in stronger positive disruptions.",
  "authors": [
    {
      "name": "Sasa Junuzovic",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81320490942/rel-imgonly/chelan3.jpg",
      "acmid": "81320490942",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Tom Blank",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100357747",
      "orcid": "missing"
    },
    {
      "name": "Anoop Gupta",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611908",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M. G., Go, J., Kaye, J. J. and Spasojevic, M., Making love in the network closet: the benefits and work of family video chat. Proc. CSCW 2010, 145--154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Buxton, W. Mediaspace - meaningspace - meetingspace. In Harrison, S. (Ed) Media Space 20+ Years of Mediated Life, Springer, 2009.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Raffle, H. Go, J., Ballages, R., and Ishii, H. Video play: playful interactions in video conferencing for long-distance families with young children. ACM IDC 2010.  ",
      "doi": "10.1145/1810543.1810550"
    },
    {
      "text": "Ishii, H. and Kobayashi, M. ClearBoard: a seamless medium for shared drawing and conversation with eye contact. ACM CHI, 1992.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Liao, M., Yang, R., and Zhang, Z. Robust and Accurate Visual Echo Cancelation in a Full-duplex Projector-camera System. IEEE Trans Pattern Analysis and Machine Intelligence, 30(10), 2008.  ",
      "doi": "10.1109/TPAMI.2007.70828"
    },
    {
      "text": "Minneman, S. L. and Bly, S. Managing a trois: a study of a multi-user drawing tool in distributed design work. ACM CHI, 1991.  ",
      "doi": "10.1145/108844.108893"
    },
    {
      "text": "Raffle, H., Revelle, G., Mori, K. et al. Hello, Is Grandma There? StoryVisit: Family Video Chat and Connected E-Books. ACM CHI, 2011.  ",
      "doi": "10.1145/1978942.1979121"
    },
    {
      "text": "Tang, J. C. and Minneman, S. L. Videodraw: a video interface for collaborative drawing. ACM TOIS, 9(2), 1991.  ",
      "doi": "10.1145/123078.128729"
    },
    {
      "text": "Tang, A., Neustaedter, C., and Greenberg, S. VideoArms: embodiments for mixed presence groupware. BCC HCI Conference. 2007.",
      "doi": ""
    },
    {
      "text": "Wellner, P. The Double Digital Desk: shared editing of paper documents. TR EPC-93-108. Xerox Research Centre Cambridge. 1993.",
      "doi": ""
    },
    {
      "text": "Wilson, A. D., and Robbins, D. C. Playtogether: playing games across multiple interactive tabletops. IUI Workshop on Tangible Play: Research and Design for Tangible and Tabletop Games, 2007.",
      "doi": ""
    },
    {
      "text": "Yarosh, S., Cuzzort, S., Mueller, H., and Abowd, G. D. Developing a Media Space for Remote Synchronous Parent-Child Interaction. ACM IDC, 2009.  ",
      "doi": "10.1145/1551788.1551806"
    },
    {
      "text": "Yarosh, S., Inkpen, K. M., and Brush, A. J. Video Playdate: Toward Free Play across Distance. ACM CHI, 2010.  ",
      "doi": "10.1145/1753326.1753514"
    },
    {
      "text": "Yarosh, S. and Kwikkers, M. Supporting Pretend and Narrative Play over Videochat. ACM IDC, 2011.  ",
      "doi": "10.1145/1999030.1999065"
    }
  ]
}