{
  "doi": "10.1145/2207676.2208414",
  "title": "CogTool-Explorer: a model of goal-directed user exploration that considers information layout",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2479-2488",
  "year": 2012,
  "badges": [],
  "abstract": "CogTool-Explorer 1.2 (CTE1.2) predicts novice exploration behavior and how it varies with different user-interface (UI) layouts. CTE1.2 improves upon previous models of information foraging by adding a model of hierarchical visual search to guide foraging behavior. Built within CogTool so it is easy to represent UI layouts, run the model, and present results, CTE1.2's vision is to assess many design ideas at the storyboard stage before implementation and without the cost of running human participants. This paper evaluates CTE1.2 predictions against observed human behavior on 108 tasks (36 tasks on 3 distinct website layouts). CTE1.2's predictions accounted for 63-82% of the variance in the percentage of participants succeeding on each task, the number of clicks to success, and the percentage of participants succeeding without error. We demonstrate how these predictions can be used to identify areas of the UI in need of redesign.",
  "authors": [
    {
      "name": "Leong-Hwee Teo",
      "institution": "DSO National Laboratories & Carnegie Mellon University, Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311486654",
      "orcid": "missing"
    },
    {
      "name": "Bonnie John",
      "institution": "IBM Research & HCI Institute, Carnegie Mellon University, Hawthorne, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "Marilyn Blackmon",
      "institution": "University of Colorado, Boulder, Colorado, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100037866",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R., Bothell, D., Byrne, M. D., Douglass, S., Lebiere, C., and Qin, Y. (2004) An integrated theory of the mind. Psychological Review 111, 4, 1036--1060.",
      "doi": ""
    },
    {
      "text": "Bellamy, R., John, B. E., Kogan, S. (2011) Deploying CogTool: Integrating quantitative usability assessment into real-world software development. Proceeding of the 33rd International Conference on Software Engineering (ICSE '11). ACM, New York, NY, USA, 691--700.  ",
      "doi": "10.1145/1985793.1985890"
    },
    {
      "text": "Blackmon, M. H. (2012). Information scent determines attention allocation and link selection among multiple information patches on a webpage. Behaviour Information & Technology, 31(1), 3--15.",
      "doi": ""
    },
    {
      "text": "Blackmon, M. H., Kitajima, M., and Polson, P. G. (2005) Tool for accurately predicting website navigation problems, non-problems, problem severity, and effectiveness of repairs. In Proc. CHI 2005, ACM Press, 31--40.  ",
      "doi": "10.1145/1054972.1054978"
    },
    {
      "text": "Budiu, R., and Pirolli, P. L. (2007) Modeling navigation in degree of interest trees. In Proc. of the 29th Annual Conference of the Cognitive Science Society, Cognitive Science Society.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T.P., and Newell, A. (1980) The keystroke level model for user performance time with interactive systems. Communications of the ACM 23, 7, 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Chi, E. H., Rosien, A., Supattanasiri, G., Williams, A., Royer, C., Chow, C., Robles, E., Dalal, B., Chen, J., and Cousins, S. (2003). The bloodhound project: automating discovery of web usability issues using the InfoScent simulator. In Proc. CHI 2003, ACM Press (2003), 505512.  ",
      "doi": "10.1145/642611.642699"
    },
    {
      "text": "Fitts, P. M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, xlvii, 381--391.",
      "doi": ""
    },
    {
      "text": "Fu, W.-T., and Pirolli, P. (2007) SNIF-ACT: A cognitive model of user navigation on the World Wide Web. Human-Computer Interaction, 22, 355--412. ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Halverson, T., and Hornof, A. J. (2007) A minimal model for predicting visual search in human-computer interaction. In Proc. CHI 2007, ACM Press, 431--434.  ",
      "doi": "10.1145/1240624.1240693"
    },
    {
      "text": "Hornoff, A. J. (2004). Cognitive strategies for the visual search of hierarchical computer displays. Human-- Computer Interaction, 19, 183--223.  ",
      "doi": "10.1207/s15327051hci1903_1"
    },
    {
      "text": "Itti, L., Koch, C., and Niebur, E. (1998) A Model of Saliency-Based Visual Attention for Rapid Scene Analysis, IEEE Transactions on Pattern Analysis and Machine Intelligence, 20(11), 1254--1259.  ",
      "doi": "10.1109/34.730558"
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D. D., and Koedinger, K. (2004) Predictive human performance modeling made easy. In Proc. CHI 2004, ACM Press, 455--462.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "Kintsch, W. (1988). The role of knowledge in discourse comprehension: A construction-integration model. Psychological Review, 95, 163--182.",
      "doi": ""
    },
    {
      "text": "Kitajima, M., Blackmon, M.H., and Polson, P.G. (2000). A comprehension-based model of Web navigation and its application to Web usability analysis. In S. McDonald, Y. Waern and G. Cockton (Eds.), People and Computers XIV - Usability or Else! (Proceedings of HCI 2000, 357--373). Springer-Verlag.",
      "doi": ""
    },
    {
      "text": "Kitajima, M., Blackmon, M. H., and Polson, P. G. (2005). Cognitive Architecture for Website Design and Usability Evaluation: Comprehension and Information Scent in Performing by Exploration. HCI International 2005.",
      "doi": ""
    },
    {
      "text": "Kitajima, M., and Polson, P. (1997). A comprehensionbased model of exploration. Human-Computer Interaction, 12, 4, 345--389.  ",
      "doi": "10.1207/s15327051hci1204_3"
    },
    {
      "text": "Knight, A., Pyrzak, G., and Green, C. (2007). When two methods are better than one: combining user study with cognitive modeling. Ext. Abstracts CHI 2007, ACM Press (2007), 1783--1788.  ",
      "doi": "10.1145/1240866.1240900"
    },
    {
      "text": "Landauer,T. K., McNamara, D. S., Dennis, S., and Kintsch W. (Eds). Handbook of Latent Semantic Analysis, Mahwah NJ: Lawrence Erlbaum Associates, 2007.",
      "doi": ""
    },
    {
      "text": "Miller, C. S., and Remington, R. W. (2004) Modeling Information Navigation: Implications for Information Architecture. Human-Computer Interaction, 19, 225271.  ",
      "doi": "10.1207/s15327051hci1903_2"
    },
    {
      "text": "Pirolli, P. and Card, S.K. (1999). Information foraging. Psychological Review, 106, 643--675.",
      "doi": ""
    },
    {
      "text": "Rosenholtz, R., Twarog, N. R., Schinkel-Bielefeld, N., and Wattenberg, M. (2009) An intuitive model of perceptual grouping for HCI design. In Proc. CHI 2009, ACM Press, 1331--1340.  ",
      "doi": "10.1145/1518701.1518903"
    },
    {
      "text": "Salvucci, D. D. (2001) An integrated model of eye movements and visual encoding. Cognitive Systems Research 1, 4, 201--220.  ",
      "doi": "10.1016/S1389-0417%2800%2900015-2"
    },
    {
      "text": "Teo L., and John B. E. (2008) Towards a Tool for Predicting Goal-directed Exploratory Behavior. In Proc. of the HFES 52nd Annual Meeting, 950--954.",
      "doi": ""
    },
    {
      "text": "Teo, L., and John, B. E. (2011) The Evolution of a GoalDirected Exploration Model: Effects of Information Scent and GoBack Utility on Successful Exploration. Topics in Cognitive Science, 3, 154--165.",
      "doi": ""
    },
    {
      "text": "Teo, L. (2011) Modeling Goal-Directed User Exploration in Human-Computer Interaction. Unpublished Doctoral Dissertation, Carnegie Mellon University. ",
      "doi": "10.5555/2126101"
    },
    {
      "text": "Toldy, M. E. (2009) The impact of working memory limitations and distributed cognition on solving search problems on complex informational websites. Unpublished Doctoral Dissertation, University of Colorado -- Boulder, Department of Psychology. ",
      "doi": "10.5555/1750963"
    },
    {
      "text": "Welford, A. T. (1960). The measurement of sensorymotor performance: Survey and reappraisal of twelve years' progress. Ergonomics, 3, 189--230.",
      "doi": ""
    },
    {
      "text": "Wolfson, C.A., Bailey, R.W., Nall, J. and Koyani, S. (2008), Contextual card sorting (or FirstClick testing): A new methodology for validating information architectures, Proceedings of the UPA.",
      "doi": ""
    }
  ]
}