{
  "doi": "10.1145/2207676.2207743",
  "title": "Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "483-492",
  "year": 2012,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Touché proposes a novel Swept Frequency Capacitive Sensing technique that can not only detect a touch event, but also recognize complex configurations of the human hands and body. Such contextual information significantly enhances touch interaction in a broad range of applications, from conventional touchscreens to unique contexts and materials. For example, in our explorations we add touch and gesture sensitivity to the human body and liquids. We demonstrate the rich capabilities of Touché with five example setups from different application domains and conduct experimental studies that show gesture classification accuracies of 99% are achievable with our technology.",
  "tags": [
    "ubiquitous interfaces",
    "touch",
    "mobile devices",
    "gestures",
    "on-body computing",
    "sensors"
  ],
  "authors": [
    {
      "name": "Munehiko Sato",
      "institution": "Disney Research, Pittsburgh, Pittsburgh, Pennsylvania, USA & The University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421593159",
      "orcid": "missing"
    },
    {
      "name": "Ivan Poupyrev",
      "institution": "Disney Research, Pittsburgh, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593278",
      "orcid": "missing"
    },
    {
      "name": "Chris Harrison",
      "institution": "Disney Research, Pittsburgh & Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Barrett, G. and Omote, R. Projected-Capacitive Touch Technology. Information Display. (26) 3, 20 16--21.",
      "doi": ""
    },
    {
      "text": "Bau, O., Poupyrev, I., Israr, A., Harrison, C., Teslatouch: electrovibration for touch surfaces. in UIST'10, 283--292.  ",
      "doi": ""
    },
    {
      "text": "Buxton, W. and Myers, B., A Study in Two-Handed Input. in CHI'86, 321--326.  ",
      "doi": ""
    },
    {
      "text": "Cassinelli, Á., Perrin, S., Ishikawa, M., Smart laser-scanner for 3D human-machine interface. in CHI EA'05, 1138--1139.  ",
      "doi": ""
    },
    {
      "text": "Cheney, M., Isaacson, D., Newell, J. C. Electrical impedance tomography. SIAM Review, 41, 1, 1999. 85--101.  ",
      "doi": ""
    },
    {
      "text": "Dietz, P. and Leigh, D., DiamondTouch: A Multi-User Touch Technology. in UIST '01, 219--226.  ",
      "doi": ""
    },
    {
      "text": "Dietz, P. H., Han, J. Y., Westhues, J., Barnwell, J., Yerazunis, W., Submerging technologies. in SIGGRAPH'06 ETech, 30.  ",
      "doi": ""
    },
    {
      "text": "Follmer, S., Johnson, M., Adelson, E., Ishii, H., deForm: an interactive malleable surface for capturing 2.5 D arbitrary objects, tools and touch. in UIST '11, 527--536.  ",
      "doi": ""
    },
    {
      "text": "Forlizzi, J., Disalvo, C., Zimmerman, J., Hurst, A., The SenseChair: The lounge chair as an intelligent assistive device for elders. in DUX '05, 1--13. ",
      "doi": ""
    },
    {
      "text": "Foster, K. R. and Lukaski, H. C. Whole-body impedance - what does it measure? The American journal of clinical nutrition, 64 (3). 1996. 388S-396S.",
      "doi": ""
    },
    {
      "text": "Gemperle, F., Kasabach, C., Stivoric, J., Bauer, M. , Martin, R. Design for wearability. in IEEE ISWC'98, 116--122. ",
      "doi": ""
    },
    {
      "text": "Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P., Witten, I. H. The WEKA data mining software: an update. SIGKDD Explorations, 11, 1, 2009. 10--18.  ",
      "doi": ""
    },
    {
      "text": "Harker, F. R. and Maindonald, J. H. Ripening of Nectarine Fruit. Plant physiology, 106, 1994. 165--171.",
      "doi": ""
    },
    {
      "text": "Harrison, B. L., Fishkin, K. P., Gujar, A., Mochon, C., Want, R., Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. in CHI '98, 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Harrison, C., Benko, H., Wilson, A., OmniTouch: wearable multitouch interaction everywhere. in UIST'11, 441--450.  ",
      "doi": ""
    },
    {
      "text": "Harrison, C., Schwarz, J., Hudson, S., TapSense: enhancing finger interaction on touch surfaces. in UIST'11, 627--636.  ",
      "doi": ""
    },
    {
      "text": "Harrison, C., Tan, D. , Morris, D., Skinput: Appropriating the Body as an Input Surface. in CHI '10, 453--462.  ",
      "doi": ""
    },
    {
      "text": "Hilliges, O., Izadi, S., Wilson, A. D., Hodges, S., Garcia-Mendoza, A., Butz, A., Interactions in the air: adding further depth to interactive tabletops. in UIST '09, 139--148.  ",
      "doi": ""
    },
    {
      "text": "Hinkley, K. and Sinclair, M., Touch-sensing input devices. in CHI '99, 223--230.  ",
      "doi": ""
    },
    {
      "text": "Kry, P. G. and Pai, D. K. Grasp Recognition and Manipulation with the Tango. in ISER'06. 551--559.",
      "doi": ""
    },
    {
      "text": "Lee, S. K., Buxton, W., Smith, K. C., A multi-touch three dimensional touch-sensitive tablet. in CHI '85, 21--25.  ",
      "doi": ""
    },
    {
      "text": "Matsushita, N. and Rekimoto, J., HoloWall: designing a finger, hand, body and object sensitive wall. UIST'97, 209--210.  ",
      "doi": ""
    },
    {
      "text": "Miyaki, T., Rekimoto, J. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. in MobileHCI '09, 81--84.  ",
      "doi": ""
    },
    {
      "text": "Paradiso, J. and Hsiao, K., Swept-frequency, magnetically-coupled resonant tags for realtime, continuous, multiparameter control. in CHI EA '99, 212--213.  ",
      "doi": ""
    },
    {
      "text": "Philipp, H. Charge transfer sensing. Sens. Review, 19. 96--105.",
      "doi": ""
    },
    {
      "text": "Pier, M. D. and Goldberg, I. R., Using water as interface media in VR applications. in CLIHC '05, ACM, 162--169.  ",
      "doi": ""
    },
    {
      "text": "Poupyrev, I. and Maruyama, S., Tactile interfaces for small touch screens. in UIST '03, 217--220.  ",
      "doi": ""
    },
    {
      "text": "Poupyrev, I., Oba, H., Ikeda, T., Iwabuchi, E., Designing embodied interfaces for casual sound recording devices. in CHI EA'08, 2129--2134.  ",
      "doi": ""
    },
    {
      "text": "Poupyrev, I., Yeo, Z., Griffin, J. D., Hudson, S., Sensing human activities with resonant tuning. in CHI EA '10, 4135--4140.  ",
      "doi": ""
    },
    {
      "text": "Rekimoto, J., SmartSkin: An Infrastructure for Freehand Manipulation onInteractive Surfaces. in CHI '02, 113--120.  ",
      "doi": ""
    },
    {
      "text": "Rosenberg, I. and Perlin, K. The UnMousePad: an interpolating multi-touch force-sensing input pad. in SIGGRAPH'09, Article 65:1--65:9.  ",
      "doi": ""
    },
    {
      "text": "Russo, A., Ahn, B. Y., Adams, J. J., Duoss, E. B., Bernhard, J. T., Lewis, J. A. Pen-on-Paper Flexible Electronics. Advanced materials, (23) 30. 2011. 3426--3430.",
      "doi": ""
    },
    {
      "text": "Saponas, T. S., Tan, D. S., Morris, D., Balakrishnan, R., Turner, J., Landay, J. A., Enabling always-available input with musclecomputer interfaces. in UIST '09, 167--176.  ",
      "doi": ""
    },
    {
      "text": "Sato, M. Particle display system: a real world display with physically distributable pixels. in CHI EA '08, 3771--3776.  ",
      "doi": ""
    },
    {
      "text": "Skulpone, S., Dittman, K. Adjustable proximity sensor. US Patent 3,743,853, 1973.",
      "doi": ""
    },
    {
      "text": "Smith, J. R. Field mice: Extracting hand geometry from electric field measurements. IBM Systems Journal, 35. 587--608.  ",
      "doi": ""
    },
    {
      "text": "Song, H., Benko, H., Izadi, S., Cao, X., Hinckley, K., Grips and Gestures on a Multi-Touch Pen. in CHI '11, 1323--1332.  ",
      "doi": ""
    },
    {
      "text": "Taylor, B. and Bove, V., Graspables: Grasp-recognition as a user interface. in CHI '09, 917--926.  ",
      "doi": ""
    },
    {
      "text": "Wang, F. and Ren, X., Empirical evaluation for finger input properties in multi-touch interaction. in CHI '09, 1063--1072.  ",
      "doi": ""
    },
    {
      "text": "Wang, R. Y. and Popovic, J. Real-time hand-tracking with a color glove. in SIGGRAPH '09, Article 63, 63:1--63:8  ",
      "doi": ""
    },
    {
      "text": "Watanabe, J., VortexBath: Study of Tangible Interaction with Water in Bathroom for Accessing and Playing Media Files. in HCI '07, 1240--1248. ",
      "doi": ""
    },
    {
      "text": "Webster, J. G. Ed, Medical instrumentation: application and design. Wiley, 2010.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The computer for the 21st century. Scientific American (9). 94--104.",
      "doi": ""
    },
    {
      "text": "Wimmer, R. and Baudisch, P., Modular and Deformable Touch-Sensitive Surfaces Based on Time Domain Reflectometry. in UIST '11, 517--526.  ",
      "doi": ""
    },
    {
      "text": "Yonezawa, T. and Mase, K., Tangible Sound: Musical instrument using fluid media. in ICMC2000.",
      "doi": ""
    },
    {
      "text": "Zimmerman, T. G., Smith, J. R., Paradiso, J. A., Allport, D., Gershenfeld, N., Applying electric field sensing to human-computer interfaces. in CHI '95, 280--287.  ",
      "doi": ""
    }
  ]
}