{
  "doi": "10.1145/2207676.2208312",
  "title": "Building the trail best traveled: effects of domain knowledge on web search trailblazing",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1795-1804",
  "year": 2012,
  "badges": [],
  "abstract": "Web users can help guide others through complex tasks in unfamiliar domains by creating ordered sequences of queries and Web pages, an activity we call trailblazing. The trails generated from this process can be surfaced by search engines to help users engaged in these tasks. However, if search engines are going to have people generate trails they need to understand whether there is value in using domain experts for trailblazing (or whether novices are sufficient). In this paper, we describe the findings of a user study of trailblazing in the medical domain, comparing domain novices and experts. We observed differences in how people in each of the groups blazed trails and the value of the trails they generated; experts were more efficient and generated better-quality trails. Although there has been significant research on contrasting novice and expert search behaviors, to our knowledge there is no work (at least in the search domain) on establishing whether artifacts created by domain experts (trails in our case) are more valuable than those created by novices. The answer to this question is important for system designers who want to learn whether investing in domain expertise is worthwhile.",
  "authors": [
    {
      "name": "Xiaojun Yuan",
      "institution": "State University of New York, Albany, New York, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100116376",
      "orcid": "missing"
    },
    {
      "name": "Ryen White",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/do/10.1145/contrib-81100617179/rel-imgonly/ryenw_headshot_dec2021.jpg",
      "acmid": "81100617179",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agichtein, E., Brill, E., and Dumais, S. Improving web search ranking by incorporating user behavior information. SIGIR, (2006), 19--26.  ",
      "doi": "10.1145/1148170.1148177"
    },
    {
      "text": "Allen, B. L. Topic knowledge and online catalog search formulation. Lib. Quart. 61, 2, (1991), 188--213.",
      "doi": ""
    },
    {
      "text": "Bates, M. J. The design of browsing and berrypicking techniques for the online search interface. Online Review 13, 5, (1989), 407--424.",
      "doi": ""
    },
    {
      "text": "Bhavnani, S. K. Important cognitive components of domain-specific search knowledge. TREC, (2001), 571--578.",
      "doi": ""
    },
    {
      "text": "Bhavnani, S. K. Domain-specific search strategies for the effective retrieval of healthcare and shopping information. SIGCHI, (2002), 610--611.  ",
      "doi": "10.1145/506443.506508"
    },
    {
      "text": "Bilenko, M. and White, R. W. Mining the search trails of surfing crowds: identifying relevant websites from user activity. WWW, (2008), 51--60.  ",
      "doi": "10.1145/1367497.1367505"
    },
    {
      "text": "Borlund, P. Experimental components for the evaluation of interaction information retrieval systems. Journal of Documentation 56, 1, (2000), 71--90.",
      "doi": ""
    },
    {
      "text": "Bush, V. As we may think. Atlantic Monthly 3, 2, (1945), 37--46.  ",
      "doi": "10.1145/227181.227186"
    },
    {
      "text": "Cartright, M., White, R. W., and Horvitz, E. Intentions and attention in exploratory health search. SIGIR, (2011), 65--74.  ",
      "doi": "10.1145/2009916.2009929"
    },
    {
      "text": "Chalmers, M., Rodden, K., and Brodbeck, D. The order of things: activity-centered information access. WWW, (1998). ",
      "doi": "10.5555/297805.297861"
    },
    {
      "text": "Collins-Thompson, K. and Callan, J. P. A language modeling approach to predicting reading difficulty. HLT-NAACL, (2004), 193--200.",
      "doi": ""
    },
    {
      "text": "Fu, W.-T. and Pirolli, P. SNIF-ACT: a cognitive model of user navigation on the world wide web. HumanComputer Interaction 22, 4, (2007), 355--412. ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Guinan, C. and Smeaton, A. F. Information retrieval from hypertext using dynamically planned guided tours. ECHT, (1993), 122--130.  ",
      "doi": "10.1145/168466.168506"
    },
    {
      "text": "Hammond, N. and Allison, L. Travels around a learning support environment: rambling, orienteering, or touring? SIGCHI, (1988), 269--273.  ",
      "doi": "10.1145/57167.57212"
    },
    {
      "text": "Joachims, T. Optimizing search engines using clickthrough data. SIGKDD, (2002), 133--142.  ",
      "doi": "10.1145/775047.775067"
    },
    {
      "text": "Joachims, T., Freitag, D. and Mitchell, T. WebWatcher: a tour guide for the world wide web. IJCAI, (1997), 770--775.",
      "doi": ""
    },
    {
      "text": "Olston, C. and Chi, E. ScentTrails: Integrating browsing and searching on the web. TOCHI 10, 3, (2003), 1--21.  ",
      "doi": "10.1145/937549.937550"
    },
    {
      "text": "O'Day, V. and Jeffries, R. Orienteering in an information landscape: how information seekers get from here to there. INTERCHI, (1993), 438--445. ",
      "doi": "10.5555/164632.164969"
    },
    {
      "text": "Pandit, S. and Olston, C. Navigation-aided retrieval. WWW, (2007), 391--400.  ",
      "doi": "10.1145/1242572.1242626"
    },
    {
      "text": "Pirolli, P. and Card, S. K. Information foraging. Psychological Review 106, 4, (1999), 643--675.",
      "doi": "10.1037/0033-"
    },
    {
      "text": "Purcell, K., Rainie, L., Mitchell, A., Rosenstiel, T. and Olmstead, K. Understanding the participatory news consumer. Pew Internet & American Life Proj., (2010).",
      "doi": ""
    },
    {
      "text": "Schwarz, J. and Morris, M. R. Augmenting web pages and search results to support credibility assessment. SIGCHI, (2011), 1245--1254.  ",
      "doi": "10.1145/1978942.1979127"
    },
    {
      "text": "Singhal, A. Modern information retrieval: a brief overview. Bulletin of the IEEE Computer Society Technical Communication on Data Engineer. 24, 4, (2001), 35--43.",
      "doi": ""
    },
    {
      "text": "Singla, A., White, R. W., and Huang, J. Studying trailfinding algorithms for enhanced web search. SIGIR, (2010), 443--450.  ",
      "doi": "10.1145/1835449.1835524"
    },
    {
      "text": "Teevan, J., Alvarado, C., Ackerman, M. S., and Karger, D. R. The perfect search engine is not enough: A study of orienteering behavior in directed search. SIGCHI, (2004), 415--422.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "Teevan, J. Adar, E., Jones, R., and Potts, M. A. S. Information re-retrieval: repeat queries in Yahoo's logs. SIGIR, (2007), 151--158.  ",
      "doi": "10.1145/1277741.1277770"
    },
    {
      "text": "Trigg, R. H. Guided tours and tabletops: tools for communicating in a hypertext environment. TOIS 6, 4, (1988).  ",
      "doi": "10.1145/58566.59299"
    },
    {
      "text": "Wexelblat, A. and Maes, P. Footprints: history-rich tools for information foraging. SIGCHI, (1999), 270--277.  ",
      "doi": "10.1145/302979.303060"
    },
    {
      "text": "Wheeldon, R. and Levene, M. The best trail algorithm for assisted navigation of web sites. LA-WEB, (2003). ",
      "doi": "10.5555/951953.952393"
    },
    {
      "text": "White, R.W., Bilenko, M., and Cucerzan, S. Studying the use of popular destinations to enhance web search interaction. SIGIR, (2007), 159--166.  ",
      "doi": "10.1145/1277741.1277771"
    },
    {
      "text": "White, R. W. and Drucker, S. M. Investigating behavioral variability in web search. WWW, (2007), 21--30.  ",
      "doi": "10.1145/1242572.1242576"
    },
    {
      "text": "White, R. W., Dumais, S. T., and Teevan, J. Characterizing the influence of domain expertise on web search behavior. WSDM, (2009), 132--141.  ",
      "doi": "10.1145/1498759.1498819"
    },
    {
      "text": "White, R. W. and Horvitz, E. Cyberchondria: studies of the escalation of medical concerns in web search. TOIS 27, 4, (2009).  ",
      "doi": "10.1145/1629096.1629101"
    },
    {
      "text": "White, R. W. and Huang, J. Assessing the scenic route: measuring the value of search trails in web logs. SIGIR, (2010), 587--594.  ",
      "doi": "10.1145/1835449.1835548"
    },
    {
      "text": "Wildemuth, B. M. The effects of domain knowledge on search tactic formulation. JASIST 55, 3, (2004), 246--258.  ",
      "doi": "10.1002/asi.10367"
    },
    {
      "text": "Yuan, X., Zhang, X.-M., and Trofimvosky, A. (2010). Testing visualization on the use of information systems. IIiX, 365--369.  ",
      "doi": "10.1145/1840784.1840840"
    },
    {
      "text": "Zellweger, P. T. (1989). Scripted documents: a hypermedia path mechanism. Hypertext, 1--14.  ",
      "doi": "10.1145/74224.74225"
    },
    {
      "text": "Zhang, X., Anghelescu, H. G. B., and Yuan, X. (2005). Domain knowledge, search behavior, and search effectiveness of engineering and science students. Information Research 10, 2, 217.",
      "doi": ""
    }
  ]
}