{
  "doi": "10.1145/2207676.2207770",
  "title": "Collapse informatics: augmenting the sustainability & ICT4D discourse in HCI",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "655-664",
  "year": 2012,
  "badges": [],
  "abstract": "Research in many fields argues that contemporary global industrial civilization will not persist indefinitely in its current form, and may, like many past human societies, eventually collapse. Arguments in environmental studies, anthropology, and other fields indicate that this transformation could begin within the next half-century. While imminent collapse is far from certain, it is prudent to consider now how to develop sociotechnical systems for use in these scenarios. We introduce the notion of collapse informatics---the study, design, and development of sociotechnical systems in the abundant present for use in a future of scarcity---as a complement to ICT4D and mitigation-oriented sustainable HCI. We draw on a variety of literatures to offer a set of relevant concepts and articulate the relationships among them to orient and evaluate collapse informatics work. Observing that collapse informatics poses a unique class of cross-cultural design problems, we sketch the design space of collapse informatics and provide a variety of example projects. We explore points of connection and distinction between collapse informatics and sustainable HCI, ICT4D, and crisis informatics. Finally, we discuss next steps and comment on the potential value of collapse informatics work even in the event that collapse never occurs.",
  "authors": [
    {
      "name": "Bill Tomlinson",
      "institution": "University of California, Irvine, Irvine, California, United States",
      "img": "/do/10.1145/contrib-81100457381/rel-imgonly/billatbackbaycropped.jpg",
      "acmid": "81100457381",
      "orcid": "missing"
    },
    {
      "name": "M. Six Silberman",
      "institution": "Bureau of Economic Interpretation, Berkeley, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460648816",
      "orcid": "missing"
    },
    {
      "name": "Donald Patterson",
      "institution": "University of California, Irvine, Irvine, California, United States",
      "img": "/do/10.1145/contrib-81100565147/rel-imgonly/1024square.png",
      "acmid": "81100565147",
      "orcid": "missing"
    },
    {
      "name": "Yue Pan",
      "institution": "School of Informatics & Computing, Indiana University, Bloomington, Indiana, United States",
      "img": "/do/10.1145/contrib-81388593537/rel-imgonly/profile.jpg",
      "acmid": "81388593537",
      "orcid": "missing"
    },
    {
      "name": "Eli Blevis",
      "institution": "School of Informatics & Computing, Indiana University, Bloomington, Indiana, United States",
      "img": "/do/10.1145/contrib-81100365314/rel-imgonly/20171007-self.jpg",
      "acmid": "81100365314",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baumer, E.P.S. and Silberman, M.S. When the implication is not to design (technology). Proceedings of the 28th international conference on Human factors in computing systems (CHI 2011), (2011), 2271.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Blevis, E. and Blevis, S. Hope for the best and prepare for the worst: interaction design and the tipping point. interactions 17, 5 (2010), 26--30.  ",
      "doi": "10.1145/1836216.1836223"
    },
    {
      "text": "Bonanni, L., Hockenberry, M., Zwarg, D., Csikszentmihalyi, C., and Ishii, H. Small business applications of sourcemap. Proceedings of the 28th international conference on Human factors in computing systems (CHI 2010), (2010), 937.  ",
      "doi": "10.1145/1753326.1753465"
    },
    {
      "text": "Costanza, R., Cumberland, J.H., Daly, H., Goodland, R., and Norgaard, R.B. An Introduction to Ecological Economics. CRC Press, 1997.",
      "doi": ""
    },
    {
      "text": "Daly, H.E. Toward a Steady-state Economy. W.H.Freeman & Co Ltd, 1973.",
      "doi": ""
    },
    {
      "text": "Diamond, J. Collapse: How Societies Choose to Fail or Succeed. Viking Adult, 2004.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. Mapping the landscape of sustainable HCI. Proceedings of the 28th international conference on Human factors in computing systems (CHI 2010), (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Dourish, P. What we talk about when we talk about context. Personal and Ubiquitous Computing 8, (2004), 19--30.  ",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Fayers, P.M. and Machin, D. Quality of life: the assessment, analysis and interpretation of patientreported outcomes. Wiley, 2007.",
      "doi": ""
    },
    {
      "text": "Fry, T. Design futuring: sustainability, ethics, and new practice. Berg, 2008.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R. The relationship of action research to human-computer interaction. ACM Trans. Comput.Hum. Interact. 18, 3 (2011), 15:1--15:20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Horning, J. and Neumann, P.G. Risks of neglecting infrastructure. Comm. ACM 51, (2008), 112.  ",
      "doi": "10.1145/1349026.1349047"
    },
    {
      "text": "Laurel, B. Gaian IxD. interactions 18, 5 (2011), 38--46.  ",
      "doi": "10.1145/2008176.2008187"
    },
    {
      "text": "Lovelock, J. The Vanishing Face of Gaia: A Final Warning. Basic Books, 2009.",
      "doi": ""
    },
    {
      "text": "Luers, A.L., Lobell, D.B., Sklar, L.S., Addams, C.L., and Matson, P.A. A method for quantifying vulnerability, applied to the agricultural system of the Yaqui Valley, Mexico. Global Environmental Change 13, 4 (2003), 255--267.",
      "doi": ""
    },
    {
      "text": "Matthews, H.D. and Weaver, A.J. Committed climate warming. Nature Geosci 3, 3 (2010), 142--143.",
      "doi": ""
    },
    {
      "text": "Max-Neef, M. Human scale development: conception, application and further reflections. The Apex Press, 1991.",
      "doi": ""
    },
    {
      "text": "McKibben, B. Eaarth: Making a Life on a Tough New Planet. Times Books, 2010.",
      "doi": ""
    },
    {
      "text": "Meadows, D. Groping in the Dark: The First Decade of Global Modelling. John Wiley & Sons Inc, 1982.",
      "doi": ""
    },
    {
      "text": "Meadows, D.H. Limits to Growth. Signet, 1972.",
      "doi": ""
    },
    {
      "text": "Meehl, G.A., Washington, W.M., Collins, W.D., et al. How Much More Global Warming and Sea Level Rise? Science 307, 5716 (2005), 1769 -1772.",
      "doi": ""
    },
    {
      "text": "Nelson, T.H. Crush and crash: logic of a terrible tomorrow. Comm. ACM 40, (1997), 90--91.  ",
      "doi": "10.1145/253671.253729"
    },
    {
      "text": "Norris, F. Time to Say It: Double Dip May Be Happening. The New York Times, 2011. http://www.nytimes.com/2011/08/05/business/economy/ double-dip-recession-may-be-returning.html.",
      "doi": ""
    },
    {
      "text": "Pachauri, R.K. Climate Change 2007: Synthesis Report. Contribution of Working Groups I, II and III to the Fourth Assessment Report of the Intergovernmental Panel on Climate Change. IPCC, 2007.",
      "doi": ""
    },
    {
      "text": "Pan, Y., Cheong, C.M., and Blevis, E. The climate change habitability index. interactions 17, 6 (2010), 2933.  ",
      "doi": "10.1145/1865245.1865253"
    },
    {
      "text": "Rawles, J.W. Patriots: Surviving the Coming Collapse: A Novel of the Turbulent Near Future. Xlibris Corporation, 2006.",
      "doi": ""
    },
    {
      "text": "Schuler, D. Communities, technology, and civic intelligence. Proceedings of the fourth international conference on Communities and technologies, (2009), 61--70.  ",
      "doi": "10.1145/1556460.1556470"
    },
    {
      "text": "Shirky, C. Gin, Television, and Social Surplus - Here Comes Everybody. 2008. http://www.herecomeseverybody.org/2008/04/lookingfor-the-mouse.html.",
      "doi": ""
    },
    {
      "text": "Silberman, M.S. and Tomlinson, B. Precarious infrastructure and postapocalyptic computing. Examining Appropriation, Re-use, and Maintenance for Sustainability, workshop at CHI 2010, (2010).  ",
      "doi": "10.1145/1753846.1754173"
    },
    {
      "text": "Silberman, M.S. and Tomlinson, B. Toward an ecological sensibility: tools for evaluating sustainable HCI. CHI EA '10 Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems (2010), 3469.  ",
      "doi": "10.1145/1753846.1754003"
    },
    {
      "text": "Tainter, J.A. The Collapse of Complex Societies. Cambridge University Press, 1990.",
      "doi": ""
    },
    {
      "text": "Tainter, J.A. Social complexity and sustainability. ecological complexity 3, 2 (2006), 91--103.",
      "doi": ""
    },
    {
      "text": "Tomlinson, B. Greening through IT: Information Technology for Environmental Sustainability. The MIT Press, 2010. ",
      "doi": "10.5555/1809764"
    },
    {
      "text": "Vardi, M.Y. The financial meltdown and computing. Communications of the ACM 52, (2009), 5.  ",
      "doi": "10.1145/1562164.1562165"
    },
    {
      "text": "Walsh, R. Lifestyle and mental health. American Psychologist, (2011).",
      "doi": ""
    },
    {
      "text": "Wigley, T.M.L. The Climate Change Commitment. Science 307, 5716 (2005), 1766--1769.",
      "doi": ""
    },
    {
      "text": "Wong, J. Prepare for Descent: Interaction Design in our New Future. Defining the Role of HCI in the Challenges of Sustainability, workshop at CHI 2009, (2009).  ",
      "doi": "10.1145/1520340.1520751"
    },
    {
      "text": "Vulnerability, Resilience and Adaptation. 16:25:48.679192. http://ihdp.unu.edu/article/adaptation.",
      "doi": ""
    }
  ]
}