{
  "doi": "10.1145/2207676.2208621",
  "title": "Is this what you meant?: promoting listening on the web with reflect",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1559-1568",
  "year": 2012,
  "badges": [],
  "abstract": "A lack of support for active listening undermines discussion and deliberation on the web. We contribute a design frame identifying potential improvements to web discussion were listening more explicitly encouraged in interfaces. We explore these concepts through a novel interface, Reflect, that creates a space next to every comment where others can summarize the points they hear the commenter making. Deployments on Slashdot, Wikimedia's Strategic Planning Initiative, and a local civic effort suggest that interfaces for listening may have traction for general use on the web.",
  "tags": [
    "grounding",
    "discussion",
    "listening",
    "deliberation",
    "web"
  ],
  "authors": [
    {
      "name": "Travis Kriplean",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339510476",
      "orcid": "missing"
    },
    {
      "name": "Michael Toomim",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578147",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Morgan",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443595373",
      "orcid": "missing"
    },
    {
      "name": "Alan Borning",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81100164129/rel-imgonly/alan.jpg",
      "acmid": "81100164129",
      "orcid": "missing"
    },
    {
      "name": "Amy J. Ko",
      "institution": "University of Washington, Seattle, Washington, United States",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "M. S. Ackerman et al. I-DIAG: from community discussion to knowledge distillation, pages 307--325. Kluwer, B.V., 2003. ",
      "doi": "10.5555/966263.966279"
    },
    {
      "text": "J. Arguello et al. Foundations for successful individual-group interactions in online communities. In CHI, 2006.  ",
      "doi": "10.1145/1124772.1124916"
    },
    {
      "text": "E. Baumer et al. Fostering critical and creative thinking about metaphor in political blogs. In CHI, 2010.  ",
      "doi": "10.1145/1753326.1753541"
    },
    {
      "text": "W. L. Bennett. Changing citizenship in the digital age. MacArthur Series on Digital Media and Learning, 2007.",
      "doi": ""
    },
    {
      "text": "I. Beschastnikh et al. Wikipedian self-governance in action. In ICWSM, 2008.",
      "doi": ""
    },
    {
      "text": "M. Billings and L. Watts. Understanding dispute resolution online. In CHI, 2010.  ",
      "doi": "10.1145/1753326.1753542"
    },
    {
      "text": "A. J. Brush et al. Anchored discussions vs. discussion boards. In CSCL, 2002.",
      "doi": ""
    },
    {
      "text": "S. Buckingham Shum. Cohere: Towards web 2.0 argumentation. In COMMA, 2008. ",
      "doi": "10.5555/1566134.1566144"
    },
    {
      "text": "J. Cappella et al. Electronic dialogue during campaign 2000. Political Communication, 19(1), 2002.",
      "doi": ""
    },
    {
      "text": "E. F. Churchill et al. Anchored conversations. In CHI, 2000.",
      "doi": "10.1145/332040.332475"
    },
    {
      "text": "H. Clark et al. Grounding in communication. In Perspectives on socially shared cognition. Am. Psych. Assoc., 1991.",
      "doi": ""
    },
    {
      "text": "S. Coleman and J. Blumler. The Internet and Democratic Citizenship. Cambridge, 2009.",
      "doi": ""
    },
    {
      "text": "J. Conklin et al. Facilitated hypertext for collective sensemaking: 15 years on from gIBIS. In HYPERTEXT, 2001.  ",
      "doi": "10.1145/504216.504246"
    },
    {
      "text": "G. Convertino et al. Supporting content and process common ground. In CHI, 2009.  ",
      "doi": "10.1145/1518701.1519059"
    },
    {
      "text": "N. Diakopoulos and M. Naaman. Towards quality discourse in online news comments. In CSCW, 2011.  ",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "M. Dickey-Kurdziolek et al. Lessons from thoughtswap-ing. In CSCW, 2010.  ",
      "doi": "10.1145/1718918.1718934"
    },
    {
      "text": "S. Duncan. The structure of speaker-auditor interaction during speaking turns. Language in Society, 3(2):161--180, 1974.",
      "doi": ""
    },
    {
      "text": "S. Faridani et al. Opinion Space: a scalable tool for browsing online comments. In CHI, 2010.  ",
      "doi": "10.1145/1753326.1753502"
    },
    {
      "text": "S. Fussell et al. Coordination of communication. In CSCW, 2000.  ",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "S. Hansen et al. Wikipedia, critical social theory, and the possibility of rational discourse. The Inf. Soc., 25, 2009.  ",
      "doi": "10.1080/01972240802587562"
    },
    {
      "text": "W. Hill et al. Edit wear and read wear. In CHI, 1992.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "R. Kraut et al. Listener responsiveness and the coordination of conversation. J. of Personality and Soc. Psych., 43(4), 1982.",
      "doi": ""
    },
    {
      "text": "T. Kriplean et al. Supporting reflective public thought with considerit. In CSCW '12, 2012.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "C. Lamm et al. The neural substrate of human empathy. J. of Cog. Neuroscience, 19(1), 2007.  ",
      "doi": "10.1162/jocn.2007.19.1.42"
    },
    {
      "text": "C. Lampe and P. Resnick. Distributed moderation in a large online conversation space. In CHI, 2004.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "K. Nam and M. Ackerman. Arkose: reusing informal information from online discussions. In GROUP, 2007.  ",
      "doi": "10.1145/1316624.1316644"
    },
    {
      "text": "F. Polletta and J. Lee. Rhetoric in public deliberation after 9/11. Am. Soc. Rev., 71(5), 2006.",
      "doi": ""
    },
    {
      "text": "W. Sack. Conversation Map: An interface for very large-scale conversations. J. Manage. Inf. Syst., 17(3), 2001. ",
      "doi": "10.5555/1289640.1289645"
    },
    {
      "text": "F. M. Shipman, III and C. C. Marshall. Formality considered harmful. Comput. Supported Coop. Work, 8, 1999.  ",
      "doi": "10.1023/A%3A1008716330212"
    },
    {
      "text": "M. Smith and A. Fiore. Visualization components for persistent conversations. In CHI, 2001.  ",
      "doi": "10.1145/365024.365073"
    },
    {
      "text": "A. Sukumaran et al. Normative influences on thoughtful online participation. In CHI, 2011.  ",
      "doi": "10.1145/1978942.1979450"
    },
    {
      "text": "M. Wattenberg and D. Millen. Conversation thumbnails for large-scale discussions. In CHI, 2003.  ",
      "doi": "10.1145/765891.765963"
    },
    {
      "text": "S. White. Backchannels across cultures. Language in Society, 18(1), 1989.",
      "doi": ""
    },
    {
      "text": "S. Whittaker. Theories and methods in mediated communication, volume 18. New Jersey: Erlbaum, 2003.",
      "doi": ""
    },
    {
      "text": "S. Whittaker et al. The dynamics of mass interaction. In CSCW, 1998.  ",
      "doi": "10.1145/289444.289500"
    },
    {
      "text": "V. Yngve. On getting a word in edgewise. In Regional meeting of the Chicago Ling. Soc. Chicago Linguistic Society, 1970.",
      "doi": ""
    }
  ]
}