{
  "doi": "10.1145/2207676.2208385",
  "title": "The SoundsRight CAPTCHA: an improved approach to audio human interaction proofs for blind users",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2267-2276",
  "year": 2012,
  "badges": [],
  "abstract": "In this paper we describe the development of a new audio CAPTCHA called the SoundsRight CAPTCHA, and the evaluation of the CAPTCHA with 20 blind users. Blind users cannot use visual CAPTCHAs, and it has been documented in the research literature that the existing audio CAPTCHAs have task success rates below 50% for blind users. The SoundsRight audio CAPTCHA presents a real-time audio-based challenge in which the user is asked to identify a specific sound (for example the sound of a bell or a piano) each time it occurs in a series of 10 sounds that are played through the computer's audio system. Evaluation results from three rounds of usability testing document that the task success rate was higher than 90% for blind users. Discussion, limitations, and suggestions for future research are also presented.",
  "tags": [
    "web accessibility",
    "evaluation",
    "security",
    "audio CAPTCHA",
    "blind users",
    "human interaction proof",
    "accessibility"
  ],
  "authors": [
    {
      "name": "Jonathan Lazar",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/do/10.1145/contrib-81100417512/rel-imgonly/lazar_jonathan_high_res.jpg",
      "acmid": "81100417512",
      "orcid": "0000-0002-6317-1582"
    },
    {
      "name": "Jinjuan Feng",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/do/10.1145/contrib-81100140918/rel-imgonly/feng-jinjuan-sq.jpg",
      "acmid": "81100140918",
      "orcid": "missing"
    },
    {
      "name": "Tim Brooks",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502761767",
      "orcid": "missing"
    },
    {
      "name": "Genna Melamed",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502800518",
      "orcid": "missing"
    },
    {
      "name": "Brian Wentz",
      "institution": "Frostburg State University, Frostburg, Maryland, United States",
      "img": "/do/10.1145/contrib-81442617856/rel-imgonly/brian-wentz.jpg",
      "acmid": "81442617856",
      "orcid": "missing"
    },
    {
      "name": "Jon Holman",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338488954",
      "orcid": "missing"
    },
    {
      "name": "Abiodun Olalere",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488671033",
      "orcid": "missing"
    },
    {
      "name": "Nnanna Ekedebe",
      "institution": "Towson University, Towson, Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502800815",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bigham, J. and Cavender, A. 2009. Evaluating existing audio CAPTCHAs and an interface optimized for non-visual use. Proceedings of ACM Conference on Human Factors in Computing Systems (CHI), 1829--1838.  ",
      "doi": "10.1145/1518701.1518983"
    },
    {
      "text": "Bohr, S. and Shome, A. Improving auditory CAPTCHA security Technical report from the Institute for Systems Research, University of Maryland 2008, Available at: http://www.isr.umd.edu/Labs/CSSL/simonlab/pub s/Bohr+ShomeREU2008.pdf.",
      "doi": ""
    },
    {
      "text": "Chellapilla, K., Larson, K., Simard, P., et al. 2005. Designing human friendly human interaction proofs (HIPs) Proceedings of ACM conference on Human factors in computing systems (CHI), 711720.  ",
      "doi": "10.1145/1054972.1055070"
    },
    {
      "text": "Chew, M. and Tygar, J. 2004. Image Recognition CAPTCHAs. Proceedings of 7th International Information Security Conference (ISC 2004), 268279.",
      "doi": ""
    },
    {
      "text": "Holman, J., Lazar, J. and Feng, J. 2008. Investigating the Security-Related Challenges of Blind Users on the Web. In Langdon, P., Clarkson, J., and Robinson, P ed. Designing Inclusive Futures, SpringerVerlag, London, 129--138.",
      "doi": ""
    },
    {
      "text": "Holman, J., Lazar, J., Feng, J., et al. 2007. Developing Usable CAPTCHAs for Blind Users. Proceedings of ACM Conference on Assistive Technologies (ASSETS), 245--246.  ",
      "doi": "10.1145/1296843.1296894"
    },
    {
      "text": "Lazar, J. (ed.), Universal Usability: Designing Computer Interfaces for Diverse User Populations. John Wiley & Sons, Chichester, UK, 2007. ",
      "doi": "10.5555/1213079"
    },
    {
      "text": "Lazar, J., Feng, J., Adelegan, O., et al. 2010. Assessing the Usability of the new Radio Clip-based Human Interaction Proofs. Proceedings of ACM SOUPS Symposium On Usable Privacy and Security., 1--2.",
      "doi": ""
    },
    {
      "text": "Lazar, J., Feng, J. and Hochheiser, H. 2010. Research Methods in Human Computer Interaction. John Wiley and Sons, Chichester, UK. ",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Lazar, J., Kumin, L. and Feng, J. 2011. Understanding the Computer Skills of Adult Expert Users with Down Syndrome: An Exploratory Study Proceedings of ACM Conference on Assistive Technology (ASSETS), 51--58.  ",
      "doi": "10.1145/2049536.2049548"
    },
    {
      "text": "Mori, G. and Malik, J. 2003. Recognizing objects in adversarial clutter: Breaking a visual CAPTCHA. Proceedings of IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 134--141. ",
      "doi": "10.5555/1965841.1965858"
    },
    {
      "text": "Sasse, A., Brostoff, S. and Weirich, D. 2001. Transforming the Weakest Link - A Human/Computer Interaction Approach to Usable and Effective Security. BT Technology Journal, 19,3. 122--130.  ",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "Sauer, G., Holman, J., Lazar, J., et al. 2010. Accessible Privacy and Security: A Universally Usable Human-Interaction Proof. Universal Access in the Information Society, 9,3. 239--248.  ",
      "doi": "10.1007/s10209-009-0171-2"
    },
    {
      "text": "Sauer, G., Lazar, J., Hochheiser, H., et al. 2010. Towards A Universally Usable Human Interaction Proof: Evaluation of Task Completion Strategies. ACM Transactions on Accessible Computing, 2,4. 1--32.  ",
      "doi": "10.1145/1786774.1786776"
    },
    {
      "text": "Tam, J., Simsa, V., Hyde, S., et al. 2009. Breaking audio CAPTCHAs. Advances in Neural Information Processing Systems 21. 1625--1632.",
      "doi": ""
    },
    {
      "text": "Turing, A. 1950. Computing machinery and intelligence. Mind, 49. 433--460.",
      "doi": ""
    },
    {
      "text": "Von Ahn, L., Blum, M. and Langford, J. 2004. Telling humans and computers apart automatically. Communications of the ACM, 47,2. 56--60.  ",
      "doi": "10.1145/966389.966390"
    },
    {
      "text": "Yan, J. and Ahmad, A. 2008. A low-cost attack on a Microsoft captcha. Proceedings of 15th ACM conference on Computer and communications security 543--554.  ",
      "doi": "10.1145/1455770.1455839"
    }
  ]
}