{
  "doi": "10.1145/2207676.2208554",
  "title": "Social annotations in web search",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1085-1094",
  "year": 2012,
  "badges": [],
  "abstract": "We ask how to best present social annotations on search results, and attempt to find an answer through mixed-method eye-tracking and interview experiments. Current practice is anchored on the assumption that faces and names draw attention; the same presentation format is used independently of the social connection strength and the search query topic. The key findings of our experiments indicate room for improvement. First, only certain social contacts are useful sources of information, depending on the search topic. Second, faces lose their well-documented power to draw attention when rendered small as part of a social search result annotation. Third, and perhaps most surprisingly, social annotations go largely unnoticed by users in general due to selective, structured visual parsing behaviors specific to search result pages. We conclude by recommending improvements to the design and content of social annotations to make them more noticeable and useful.",
  "tags": [
    "eye tracking",
    "information seeking",
    "social search"
  ],
  "authors": [
    {
      "name": "Aditi Muralidharan",
      "institution": "University of California, Berkeley, Berkeley, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481643448",
      "orcid": "missing"
    },
    {
      "name": "Zoltan Gyongyi",
      "institution": "Google, Inc., Mountain View, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410595499",
      "orcid": "missing"
    },
    {
      "name": "Ed Chi",
      "institution": "Google, Inc., Mountain View, California, United States, ,",
      "img": "/do/10.1145/contrib-81100330316/rel-imgonly/2018-edchi-dsc_3705-2048px.jpg",
      "acmid": "81100330316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M., and Malone, T. Answer garden: A tool for growing organizational memory. In Proc. ACM SIGOIS and IEEE CS TC-OA (1990), 3139.  ",
      "doi": "10.1145/91474.91485"
    },
    {
      "text": "Ackerman, M. S., and McDonald, D. W. Answer garden 2: merging organizational memory with collaborative help. In Proc. CSCW, CSCW '96, ACM (New York, NY, USA, 1996), 97105. ACM ID: 240203.  ",
      "doi": "10.1145/240080.240203"
    },
    {
      "text": "Amershi, S., and Morris, M. R. CoSearch. In Proc. SIGCHI, ACM Press (2008), 1647.  ",
      "doi": "10.1145/1357054.1357311"
    },
    {
      "text": "Bao, S., Xue, G., Wu, X., Yu, Y., Fei, B., and Su, Z. Optimizing web search using social annotations. In Proc. WWW (2007), 501510.  ",
      "doi": "10.1145/1242572.1242640"
    },
    {
      "text": "Borgatti, S., and Cross, R. A relational view of information seeking and learning in social networks. Management science (2003), 432445.  ",
      "doi": "10.1287/mnsc.49.4.432.14428"
    },
    {
      "text": "Carmel, D., Zwerdling, N., Guy, I., Ofek-Koifman, S., Har'el, N., Ronen, I., Uziel, E., Yogev, S., and Chernov, S. Personalized social search based on the user's social network. In Proc. CIKM (2009), 12271236.  ",
      "doi": "10.1145/1645953.1646109"
    },
    {
      "text": "Chi, E., Gumbrecht, M., and Hong, L. Visual foraging of highlighted text: An eye-tracking study. In Proc. HCI (2007), 589598. ",
      "doi": "10.5555/1769590.1769657"
    },
    {
      "text": "Chi, E. H. Information seeking can be social. Computer 42, 3 (2009), 4246.  ",
      "doi": "10.1109/MC.2009.87"
    },
    {
      "text": "Cutrell, E., and Guan, Z. What are you looking for? In Proc. SIGCHI, ACM Press (2007), 407.  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Erickson, T., and Kellogg, W. A. Social translucence: an approach to designing systems that support social processes. ACM ToCHI 7, 1 (Mar. 2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Erickson, T., Smith, D. N., Kellogg, W. A., Laff, M., Richards, J. T., and Bradner, E. Socially translucent systems. In Proc. SIGCHI, ACM Press (1999), 72--79.  ",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "Evans, B. M., and Chi, E. H. Towards a model of understanding social search. In Proc. CSCW (2008), 485494.  ",
      "doi": "10.1145/1460563.1460641"
    },
    {
      "text": "Evans, B. M., Kairam, S., and Pirolli, P. Do your friends make you smarter?: An analysis of social strategies in online information seeking. Information Processing & Management 46, 6 (Nov. 2010), 679--692.  ",
      "doi": "10.1016/j.ipm.2009.12.001"
    },
    {
      "text": "Golovchinsky, G., Pickens, J., and Back, M. A taxonomy of collaboration in online information seeking. In Proc. 1st Workshop on Collaborative Information Seeking (2008).",
      "doi": ""
    },
    {
      "text": "Golovchinsky, G., Qvarfordt, P., and Pickens, J. Collaborative information seeking. Information Seeking Support Systems (2008).",
      "doi": ""
    },
    {
      "text": "Granka, L. A., Joachims, T., and Gay, G. Eye-tracking analysis of user behavior in WWW search. In Proc. SIGIR, SIGIR '04, ACM (New York, NY, USA, 2004), 478479.  ",
      "doi": "10.1145/1008992.1009079"
    },
    {
      "text": "Guan, Z., and Cutrell, E. An eye tracking study of the effect of target rank on web search. In Proc. SIGCHI, ACM Press (2007), 417.  ",
      "doi": "10.1145/1240624.1240691"
    },
    {
      "text": "Haines, R. A breakdown in simultaneous information processing. Presbyopia research. From molecular biology to visual adaptation (1991), 171175.",
      "doi": ""
    },
    {
      "text": "Hershler, O., and Hochstein, S. At first sight: A high-level pop out effect for faces. Vision Research 45, 13 (2005), 17071724.",
      "doi": ""
    },
    {
      "text": "Heymann, P., Koutrika, G., and Garcia-Molina, H. Can social bookmarking improve web search? In Proc. intl. conf. on Web search and web data mining, ACM Press (2008), 195.  ",
      "doi": "10.1145/1341531.1341558"
    },
    {
      "text": "Hill, W. C., Hollan, J. D., Wroblewski, D., and McCandless, T. Edit wear and read wear. In Proc. SIGCHI, ACM (Monterey, California, United States, 1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Horowitz, D., and Kamvar, S. D. The anatomy of a large-scale social search engine. In Proc. WWW, Proc. WWW, ACM (New York, NY, USA, 2010), 431440. ACM ID: 1772735.  ",
      "doi": "10.1145/1772690.1772735"
    },
    {
      "text": "Joachims, T., Granka, L., Pan, B., Hembrooke, H., and Gay, G. Accurately interpreting clickthrough data as implicit feedback. In Proc. SIGIR, SIGIR '05, ACM (New York, NY, USA, 2005), 154161.  ",
      "doi": "10.1145/1076034.1076063"
    },
    {
      "text": "Kammerer, Y., Nairn, R., Pirolli, P., and Chi, E. H. Signpost from the masses: learning effects in an exploratory social tag search browser. In Proc. SIGCHI (2009), 625634.  ",
      "doi": "10.1145/1518701.1518797"
    },
    {
      "text": "Langton, S., Law, A., Burton, A., and Schweinberger, S. Attention capture by faces. Cognition 107, 1 (2008), 330342.",
      "doi": ""
    },
    {
      "text": "Lorigo, L., Pan, B., Hembrooke, H., Joachims, T., Granka, L., and Gay, G. The influence of task and gender on search and evaluation behavior using google. Information Processing & Management 42, 4 (July 2006), 1123--1131.  ",
      "doi": "10.1016/j.ipm.2005.10.001"
    },
    {
      "text": "Mack, A., Pappas, Z., Silverman, M., and Gay, R. What we see: Inattention and the capture of attention by meaning. Consciousness and Cognition 11, 4 (2002), 488506.",
      "doi": ""
    },
    {
      "text": "Mack, A., and Rock, I. Inattentional blindness. In Visual Attention. The MIT Press, 1998.",
      "doi": ""
    },
    {
      "text": "Manning, C. D., Raghavan, P., and Schutze, H. Introduction to information retrieval. Cambridge University Press, 2008. ",
      "doi": "10.5555/1394399"
    },
    {
      "text": "Morris, M. R. A survey of collaborative web search practices. In Proc. SIGCHI, ACM Press (2008), 1657.  ",
      "doi": "10.1145/1357054.1357312"
    },
    {
      "text": "Morris, M. R., and Horvitz, E. SearchTogether. In Proc. UIST, ACM Press (2007), 3.  ",
      "doi": "10.1145/1294211.1294215"
    },
    {
      "text": "Morris, M. R., Lombardo, J., and Wigdor, D. WeSearch. In Proc. CSCW, ACM Press (2010), 401.  ",
      "doi": "10.1145/1718918.1718987"
    },
    {
      "text": "Nelson, L., Held, C., Pirolli, P., Hong, L., Schiano, D., and Chi, E. H. With a little help from my friends: examining the impact of social annotations in sensemaking tasks. In Proc. SIGCHI, CHI '09, ACM (New York, NY, USA, 2009), 17951798. ACM ID: 1518977.  ",
      "doi": "10.1145/1518701.1518977"
    },
    {
      "text": "Pan, B., Hembrooke, H., Joachims, T., Lorigo, L., Gay, G., and Granka, L. In google we trust: Users decisions on rank, position, and relevance. Journal of Computer-Mediated Communication 12, 3 (2007), 801823.",
      "doi": ""
    },
    {
      "text": "Pickens, J., Golovchinsky, G., Shah, C., Qvarfordt, P., and Back, M. Algorithmic mediation for collaborative exploratory search. In Proc. ACM SIGIR, ACM Press (2008), 315.  ",
      "doi": "10.1145/1390334.1390389"
    },
    {
      "text": "Pirolli, P. An elementary social information foraging model. In Proc. SIGCHI (2009), 605614.  ",
      "doi": "10.1145/1518701.1518795"
    },
    {
      "text": "Pirolli, P., and Card, S. Information foraging. Psychological Review 106 (1999), 643--675.",
      "doi": ""
    },
    {
      "text": "Rock, I., Linnett, C. M., Grant, P., and Mack, A. Perception without attention: Results of a new method. Cognitive Psychology 24, 4 (Oct. 1992), 502--534.",
      "doi": ""
    },
    {
      "text": "Silvers, V., and Kreiner, D. The effects of Pre-Existing inappropriate highlighting on reading comprehension. Reading Research and Instruction 36, 3 (1997), 21723.",
      "doi": ""
    },
    {
      "text": "Simons, D. J., and Chabris, C. F. Gorillas in our midst: sustained inattentional blindness for dynamic events. Perception 28, 9 (1999), 1059--1074. PMID: 10694957.",
      "doi": ""
    },
    {
      "text": "Theeuwes, J., and Van der Stigchel, S. Faces capture attention: Evidence from inhibition of return. Visual Cognition 13, 6 (2006), 657665.",
      "doi": ""
    },
    {
      "text": "Von Restorff, H. Ueber die wirkung von bereichsbildungen im spurenfeld. Psychological Research 18, 1 (1933), 299342.",
      "doi": ""
    },
    {
      "text": "Yanbe, Y., Jatowt, A., Nakamura, S., and Tanaka, K. Can social bookmarking enhance search in the web? In Proc. ACM/IEEE-CS joint conf. on Digital libraries, ACM Press (2007), 107.  ",
      "doi": "10.1145/1255175.1255198"
    },
    {
      "text": "Zanardi, V., and Capra, L. Social ranking: uncovering relevant content using tag-based recommender systems. In Proc. ACM RecSys, ACM Press (2008), 51.  ",
      "doi": "10.1145/1454008.1454018"
    }
  ]
}