{
  "doi": "10.1145/2207676.2208413",
  "title": "Designing a debugging interaction language for cognitive modelers: an initial case study in natural programming plus",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2469-2478",
  "year": 2012,
  "badges": [],
  "abstract": "In this paper, we investigate how a debugging environment should support a population doing work at the core of HCI research: cognitive modelers. In conducting this investigation, we extended the Natural Programming methodology (a user-centered design method for HCI researchers of programming environments), to add an explicit method for mapping the outcomes of NP's empirical investigations to a language design. This provided us with a concrete way to make the design leap from empirical assessment of users' needs to a language. The contributions of our work are therefore: (1) empirical evidence about the content and sequence of cognitive modelers' information needs when debugging, (2) a new, empirically derived, design specification for a debugging interaction language for cognitive modelers, and (3) an initial case study of our \"Natural Programming Plus\" methodology.",
  "authors": [
    {
      "name": "Christopher Bogart",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/do/10.1145/contrib-81435601576/rel-imgonly/bogart_proff_photo.jpg",
      "acmid": "81435601576",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Scott Douglass",
      "institution": "Air Force Research Laboratory, Dayton, Ohio, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100374117",
      "orcid": "missing"
    },
    {
      "name": "Hannah Adams",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502664885",
      "orcid": "missing"
    },
    {
      "name": "Rachel White",
      "institution": "Oregon State University, Corvallis, Oregon, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81413594129",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J., Boyle, C. Corbett, A., and Lewis, M. Cognitive modeling and intelligent tutoring, In Artificial Intelligence and Learning Environments, W. Clancey and E. Soloway, (Eds.). MIT Press (1990), 7--49. ",
      "doi": "10.5555/103358.103550"
    },
    {
      "text": "Bates, M. Where should the person stop and the information search interface start? Information Processing and Management, 26:5, (1990), 575--591.  ",
      "doi": "10.1016/0306-4573%2890%2990103-9"
    },
    {
      "text": "Bogart, C., Burnett, M., Douglass, S., Piorkowski, D., Shinsel, A. Does my model work? Evaluation abstractions of cognitive modelers. Proc. VLHCC, IEEE (2010), 49--56.  ",
      "doi": "10.1109/VLHCC.2010.16"
    },
    {
      "text": "Bothell, D. et al., ACT-R Tutorial. Distributed with ACT-R 6.0 version 1.3 r766. http://actr.psy.cmu.edu/actr6/. Retrieved August, 2009.",
      "doi": ""
    },
    {
      "text": "Douglass, S., Mittal, S., Using domain specific languages to improve scale and integration of cognitive models, Behavior Representation in Modeling and Simulation, (2011).",
      "doi": ""
    },
    {
      "text": "Fu, W. and Pirolli, P. SNIF-ACT: A cognitive model of user navigation on the world wide web. HumanComputer Interaction, 22:4 (2007), 355--412 ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Green, T. and Petre, M. Usability Analysis of Visual Programming Environments: A \"Cognitive Dimensions\" Framework. Journal of Visual Languages and Computing, 7:2 (1996), 131--174.",
      "doi": ""
    },
    {
      "text": "John, B. and Kieras, D. The GOMS family of user interface analysis techniques: comparison and contrast. ACM TOCHI 3:4 (1996), 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "Ko, A., Myers, B. A framework and methodology for studying the causes of software errors in programming systems. J. Vis. Langs. & Computing, 16 (2005), 41--84.  ",
      "doi": "10.1016/j.jvlc.2004.08.003"
    },
    {
      "text": "Ko, A., DeLine, R. and Venolia, G. Information needs in collocated software development teams. Proc. ICSE, ACM (2007) 344--353.  ",
      "doi": "10.1109/ICSE.2007.45"
    },
    {
      "text": "Ko A., Myers, B. Finding causes of program output with the Java Whyline. Proc. CHI, ACM (2009), 1569--1578.  ",
      "doi": "10.1145/1518701.1518942"
    },
    {
      "text": "Little, G., Miller, R., Chou, V., Bernstein, M., Lau, T. and Cypher, A., Sloppy programming, In No Code Required, Cypher, A., Dontcheva, M., Lau, T. and Nichols, J. (Eds.). Morgan Kaufmann (2010), 289--307.",
      "doi": ""
    },
    {
      "text": "Myers, B., Weitzman, D., Ko, A., Chau, D. Answering why and why not questions in user interfaces. Proc. CHI, ACM (2006), 397--406.  ",
      "doi": "10.1145/1124772.1124832"
    },
    {
      "text": "Neumann, C., Metoyer, R. and Burnett, M. End-user strategy programming. J. Visual Languages and Computing, 20:1 (2009), 16--29.  ",
      "doi": "10.1016/j.jvlc.2008.04.005"
    },
    {
      "text": "Newell, A. and Card. S. The prospects for psychological science in human-computer interaction. HumanComputer Interaction, 1:3 (1985), 209--242.  ",
      "doi": "10.1207/s15327051hci0103_1"
    },
    {
      "text": "Pane, J., Ratanamahatana, C. and Myers, B., Studying the language and structure in non-programmers' solutions to programming problems, Intl. J. HumanComputer Studies, 54:2 (2001) 237--264.  ",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "Pane, J., Myers, B., More Natural Programming Languages and Environments, In End User Development, vol. 9 of the Human-Computer Interaction Series, H. Lieberman, F. Paterno, V. Wulf, (Eds.). Springer (2006).",
      "doi": ""
    },
    {
      "text": "Pirolli, P., Card, S. Information foraging in information access environments. Proc CHI, ACM (1995), 51--58.  ",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Segal, J. Some problems of professional end user developers. Proc. VLHCC, IEEE (2007), 111--118.  ",
      "doi": "10.1109/VLHCC.2007.50"
    },
    {
      "text": "Tor, K., Ritter, F., Haynes, S. and Cohen, M., CaDaDis: A tool for displaying the behavior of cognitive models and agents. Proc. Conf. on Behavior Representation in Modeling and Simulation, (2004), 192--200.",
      "doi": ""
    },
    {
      "text": "Wong, J. and Hong, J. Making mashups with Marmite: Re-purposing web content through end-user programming. Proc. CHI, ACM (2007), 1435--1444.  ",
      "doi": "10.1145/1240624.1240842"
    },
    {
      "text": "Yaremko, R., Harari, H., Harrison, R., Lynn, E. Reference Handbook of Research and Statistical Methods in Psychology for Students and Professionals. Harper and Row (1982), New York.",
      "doi": ""
    }
  ]
}