{
  "doi": "10.1145/2207676.2207774",
  "title": "A transformational product to improve self-control strength: the chocolate machine",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "689-694",
  "year": 2012,
  "badges": [],
  "abstract": "Lack of self-control is at the heart of many undesirable behaviors, such as overeating, overspending, and even overworking. While the field of Persuasive Technologies searches for ways to change attitudes and behaviors, it often neglects the science of self-control. We present the Chocolate Machine, an exploratory interactive product to train self-control strength based upon Ego Depletion theory. A field study showed the machine to increase perceived self-control over time, while providing a sustained positive experience. This makes the machine transformational, aiming at facilitating behaviors people find worthwhile, but hard to implement.",
  "authors": [
    {
      "name": "Flavius Kehr",
      "institution": "University of Koblenz-Landau, Landau, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812013",
      "orcid": "missing"
    },
    {
      "name": "Marc Hassenzahl",
      "institution": "Folkwang University of Arts, Essen, Germany",
      "img": "/do/10.1145/contrib-81452610719/rel-imgonly/hassenzahl.jpg",
      "acmid": "81452610719",
      "orcid": "0000-0001-9798-1762"
    },
    {
      "name": "Matthias Laschke",
      "institution": "Folkwang University of the Arts, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472655523",
      "orcid": "0000-0003-2714-4293"
    },
    {
      "name": "Sarah Diefenbach",
      "institution": "Folkwang University of Arts, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583472",
      "orcid": "0000-0002-4347-5028"
    }
  ],
  "references": [
    {
      "text": "Fogg, B. J. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann, 2003. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Laschke, M., Hassenzahl, M., and Diefenbach, S. Things with attitude: Transformational Products. In Create11 Conference (2011), 1-2, Retrieved from http://www.create-conference.org/storage/create11papersposters/Things_with_attitude.pdf",
      "doi": ""
    },
    {
      "text": "Lee, M. K., Kiesler, S., and Forlizzi, J. Mining behavioral economics to design persuasive technology for healthy choices. In Proceedings of the 2011 annual conference on Human Factors in Computing Systems - CHI '11, ACM Press (2011), 325.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Loewenstein, G. The Fall and Rise of Psychological Explanations in the Economics of Intertemporal Choice. In G. F. Loewenstein and J. Elster, eds., Choice over time. Russell Sage, 1992, 3--34.",
      "doi": ""
    },
    {
      "text": "Metcalfe, J. and Mischel, W. A hot/cool-system analysis of delay of gratification: dynamics of willpower. Psychological Review 106, 1 (1999), 3--19.",
      "doi": ""
    },
    {
      "text": "Muraven, M. and Baumeister, R. F. Self-regulation and depletion of limited resources: does self-control resemble a muscle? Psychological Bulletin 126, 2 (2000), 247--259.",
      "doi": ""
    },
    {
      "text": "Muraven, M., Baumeister, R. F., and Tice, D. M. Longitudinal improvement of self-regulation through practice: building self-control strength through repeated exercise. Journal of Social Psychology 139, 4 (1999), 446--457.",
      "doi": ""
    },
    {
      "text": "Muraven, M. Building self-control strength: Practicing self-control leads to improved self-control performance. Journal of Experimental Social Psychology 46, 2 (2010), 465--468.",
      "doi": ""
    },
    {
      "text": "Redström, J. H. Persuasive design: Fringes and foundations. In Proceedings of the first international conference on Persuasive Technology for Human Well-Being (PERSUASIVE'06), Springer (2006), 112--122. ",
      "doi": "10.5555/1986822.1986842"
    },
    {
      "text": "Tangney, J. P., Baumeister, R. F., and Boone, A. L. High self-control predicts good adjustment, less pathology, better grades, and interpersonal success. Journal of Personality 72, 2 (2004), 271--324.",
      "doi": ""
    },
    {
      "text": "Zimmerman, J. Designing for the self: making products that help people become the person they desire to be. In Proceedings of the 2009 annual conference on Human Factors in Computing Systems - CHI '09, ACM Press (2009), 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}