{
  "doi": "10.1145/2207676.2208540",
  "title": "Undesigning technology: considering the negation of design by design",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "957-966",
  "year": 2012,
  "badges": [],
  "abstract": "Motivated by substantive concerns with the limitations and negative effects of technology, this paper inquires into the negation of technology as an explicit and intentional aspect of design research within HCI. Building on theory from areas including philosophy and design theory, this paper articulates a theoretical framework for conceptualizing the intentional negation of technology (i.e., the undesign of technology), ranging from the inhibition of particular uses of technology to the total erasure or foreclosure of technology. The framework is then expanded upon to articulate additional areas of undesigning, including self-inhibition, exclusion, removal, replacement, restoration, and safeguarding. In conclusion a scheme is offered for addressing questions concerning the disciplinary scope of undesign in the context of HCI, along with suggestions for ways that undesigning may be more strongly incorporated within HCI research.",
  "authors": [
    {
      "name": "James Pierce",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    }
  ],
  "references": [
    {
      "text": "Akrich, M. 1992. The description of technical objects, in Bijker, W. E. #38; Law, J. (Eds), Shaping Technology/Building Society. MIT Press.",
      "doi": ""
    },
    {
      "text": "Baumer, E. & Silberman, S. 2011. When the implication is not to design (technology). CHI '11.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Blevis, E. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. CHI '07.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Blevis, E. & Stolterman, E. 2009. Transcending disciplinary boundaries in interaction design. interactions 16, 5 (Sep. 2009), 48--51.  ",
      "doi": "10.1145/1572626.1572636"
    },
    {
      "text": "Blevis, E. 2011. Digital Imagery as Meaning and Form in HCI and Design: An Introduction to the Visual Thinking Backpage Gallery. interactions 18, 5.  ",
      "doi": "10.1145/2008176.2008190"
    },
    {
      "text": "Bodker, S. 2006. When second wave HCI meets third wave challenges. NordiCHI '06.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Borgmann, A. 1984. Technology and the character of contemporary life. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Bower, J. L. & Christensen, C. M. 1995. \"Disruptive Technologies: Catching the Wave\" Harvard Business Review, January-February 1995",
      "doi": ""
    },
    {
      "text": "Bourdieu, P. 1972. Outline of a theory of practice. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Buchanan, R. 1989. Declaration by design: Rhetoric, argument, and demonstration in design practice. In V. Margolin (Eds.), Design discourse (pp. 91--109).",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. 2010. Mapping the landscape of sustainable HCI. CHI '10.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "DiSalvo, C., Light, A., Hirsch, T., Le Dantec, C., Goodman, E. & Hill, H. 2010. HCI, communities and politics. CHI EA '10.  ",
      "doi": "10.1145/1753846.1753940"
    },
    {
      "text": "DiSalvo, C. 2009. Design and the Construction of Publics. Design Issues, 25(1): 48--63.",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. DIS '10  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Dourish, P. 2006. Implications for design. CHI '06.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Dunne, A., & Raby, F. 2001. Design noir: The secret life of electronic objects. August Media, Boston.",
      "doi": ""
    },
    {
      "text": "Fallman, D. 2011. The new good: exploring the potential of philosophy of technology to contribute to human-computer interaction. CHI '11.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Fallman, D. 2003. Design-Oriented Human-Computer Interaction. CHI '03.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Fallman, D. 2005. Why Research-Oriented Design Isn't Design-Oriented Research. NordiCHI '95.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December.  ",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Friedman, B. (Ed.) (1997). Human Values and the Design of Computer Technology. CSLI Press. ",
      "doi": "10.5555/278213"
    },
    {
      "text": "Friedman, B. & Nathan, L. 2010. Multi-lifespan information system design: a research initiative for the hci community. CHI '10.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Fry, T. 2009. Design futuring: sustainability, ethics, and new practice. Berg.",
      "doi": ""
    },
    {
      "text": "Fry, T. 1999. A New Design Philosophy: An Introduction to Defuturing. New South Wales, Australia: NSWU Press.",
      "doi": ""
    },
    {
      "text": "Fullerton, B. 2010. Designing for solitude. interactions 17(6):6--9.  ",
      "doi": "10.1145/1865245.1865247"
    },
    {
      "text": "Gaver, W., Bowers, J., Boucher, A., Gellerson, H., Pennington, S., Schmidt, S., Steed, A., Villars, N. & Walker, B. 2004. The drift table: designing for ludic engagement. CHI EA '04.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Gaver, W. & Martin, H. 2000. Alternatives: exploring information appliances through conceptual design proposals. CHI '00.  ",
      "doi": "10.1145/332040.332433"
    },
    {
      "text": "Giddens, A. 1984. The Constitution of Society. Outline of the Theory of Structuration. Cambridge.",
      "doi": ""
    },
    {
      "text": "Ihde, D. (1990). Technology and the lifeworld - from garden to earth. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K., & Grinter, R. E. 2010. Postcolonial computing: a lens on design and development. CHI '10.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Latour, B. 2005. Reassembling the social: An introduction to actor-network-theory. Oxford.",
      "doi": ""
    },
    {
      "text": "Latour, B. 2000. Where are the missing masses? The sociology of a few mundane artefacts. In Bijker, W. E. #38; Law J. (Eds), Shaping Technology/Building Society: Studies in Sociotechnical Change. MIT Press",
      "doi": ""
    },
    {
      "text": "Leshed, G. & Sengers, P. 2011. \"I lie to myself that I have freedom in my own schedule\": productivity tools and experiences of busyness. CHI '11.  ",
      "doi": "10.1145/1978942.1979077"
    },
    {
      "text": "Löwgren, J. & Stolterman, E. 2004. Thoughtful interaction design: a design perspective on information technology. MIT Press. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Mitcham, C. 1978. Types of technology. Research in philosophy and technology, I, 229--294.",
      "doi": ""
    },
    {
      "text": "Nelson, H. & Stolterman, E. 2003. Design Way: Intentional Change in an Unpredictable World. Englewood Cliffs. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Norman, D. 1999. Affordance, conventions and design. interactions, 6(3).  ",
      "doi": "10.1145/301153.301168"
    },
    {
      "text": "Perrin, N. 1979. Giving up the gun. Japan's reversion to the sword, 1543--1879. Boston: David R. Godine.",
      "doi": ""
    },
    {
      "text": "Redström, J. 2006. Persuasive Design: Fringes and Foundations. Persuasive, 3962:112--122. ",
      "doi": "10.5555/1986822.1986842"
    },
    {
      "text": "Satchell, C. & Dourish, P. 2009. Beyond the user: use and non-use in HCI. OZCHI '09.  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Sellen, A. & Harper, R. 2001. The myth of the paperless office. MIT Press. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Schumpeter, J. A. 1949. The historical approach to the analysis of business cycles, in Essays: On Entrepreneurs, Innovations, Business Cycles, and the Evolution of Capitalism. Transaction.",
      "doi": ""
    },
    {
      "text": "Sengers, P. 2011. What I learned on Change Islands: reflections on IT and pace of life. interactions, 18(2).  ",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "Sengers, P. & Gaver, W. 2006 Staying open to interpretation: engaging multiple meanings in design and evaluation. DIS '06.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Shove, E. 2003. Comfort, cleanliness and convenience: The social organization of normality. Berg.",
      "doi": ""
    },
    {
      "text": "Simon, H. 1996. The Sciences of the Artificial: 3rd Edition. MIT Press. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Tatar, D., Lee, J.-S., Alaloula, N. 2008. Playground games. DIS '08.",
      "doi": "10.1145/1394445.1394453"
    },
    {
      "text": "Taylor, A. 2011. Out there. CHI '11.",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "Tomlinson, B. 2010. Greening Through IT. MIT Press.",
      "doi": ""
    },
    {
      "text": "Tonkinwise, C. Design away. Design philosophy politics. Retrieved September 2011 from http://designphilosophypolitics.informatics.indiana.edu",
      "doi": ""
    },
    {
      "text": "Verbeek, P.-P. 2005. What things do: Technology, agency and design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Wakkary, R. and Tanenbaum, K. 2009. A sustainable identity: the creativity of an everyday designer. CHI '09.  ",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Willis, A. M. (2006). Ontological designing. Design Philosophy Papers. #02/2006",
      "doi": ""
    },
    {
      "text": "Winner, L. 1986. The whale and the reactor: a search for limits in an age of high technology. U. of Chicago.",
      "doi": ""
    },
    {
      "text": "Winograd, T. & Flores, F. 1987. Understanding computers and cognition: A new foundation for design. Addison-Wesley. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evenson, S. 2007. Research through design as a method for interaction design research in HCI. CHI '07.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J. & Stolterman, E. 2010. An analysis and critique of Research through Design: towards a formalization of a research approach. DIS '10.  ",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}