{
  "doi": "10.1145/2207676.2207759",
  "title": "Why Johnny can't opt out: a usability evaluation of tools to limit online behavioral advertising",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "589-598",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present results of a 45-participant laboratory study investigating the usability of nine tools to limit online behavioral advertising (OBA). We interviewed participants about OBA and recorded their behavior and attitudes as they configured and used a privacy tool, such as a browser plugin that blocks requests to specific URLs, a tool that sets browser cookies indicating a user's preference to opt out of OBA, or the privacy settings built into a web browser. We found serious usability flaws in all tools we tested. Participants found many tools difficult to configure, and tools' default settings were often minimally protective. Ineffective communication, confusing interfaces, and a lack of feedback led many participants to conclude that a tool was blocking OBA when they had not properly configured it to do so. Without being familiar with many advertising companies and tracking technologies, it was difficult for participants to use the tools effectively.",
  "authors": [
    {
      "name": "Pedro Leon",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466645782",
      "orcid": "missing"
    },
    {
      "name": "Blase Ur",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    },
    {
      "name": "Richard Shay",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81339527920/rel-imgonly/rich.jpg",
      "acmid": "81339527920",
      "orcid": "missing"
    },
    {
      "name": "Yang Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82458950557",
      "orcid": "missing"
    },
    {
      "name": "Rebecca Balebako",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502795147",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Cranor",
      "institution": "Carnegie Mellon, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    }
  ],
  "references": [
    {
      "text": "Ayenson, M., Wambach, D. J., Soltani, A., Good, N., and Hoofnagle, C. J. Flash cookies and privacy II. http://ssrn.com/abstract=1898390 (2011).",
      "doi": ""
    },
    {
      "text": "Brunk, B. A user-centric privacy space framework. In Security and Usability, L. F. Cranor and S. Garfinkel, Eds. O'Reilly, 2005, ch. 20, 401--420.",
      "doi": ""
    },
    {
      "text": "Cranor, L. F. A first look at Internet Explorer 9 privacy features. http://www.techpolicy.com/Blog/March-2011/A-firstlook-at-Internet-Explorer-9-privacy-featur.aspx.",
      "doi": ""
    },
    {
      "text": "Cranor, L. F. Web Privacy with P3P. O'Reilly & Associates, Inc., Sebastopol, CA, USA, 2002. ",
      "doi": "10.5555/863030"
    },
    {
      "text": "Cranor, L. F. Privacy policies and privacy preferences. In Security and Usability, L. F. Cranor and S. Garfinkel, Eds. O'Reilly, 2005, ch. 22, 447--472.",
      "doi": ""
    },
    {
      "text": "Cranor, L. F., Guduru, P., and Arjula, M. User interfaces for privacy agents. ACM Transactions on Computer-Human Interaction 13 (2006).  ",
      "doi": "10.1145/1165734.1165735"
    },
    {
      "text": "Dumas, J. S. The Human-Computer Interaction Handbook. Lawrence Erlbaum Associates, 2003, 1093--1117.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. Online Profiling: a Report to Congress: Part 2 Recommendations, July 2000.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. Self-regulatory principles for online behavioral advertising, 2009.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. Protecting consumer privacy in an era of rapid change, 2010.",
      "doi": ""
    },
    {
      "text": "Ha, V., Inkpen, K., Al Shaar, F., and Hdeib, L. An examination of user perception and misconception of internet cookies. In CHI Extended Abstracts (2006).  ",
      "doi": "10.1145/1125451.1125615"
    },
    {
      "text": "Komanduri, S., Shay, R., Norcie, G., and Cranor, L. F. AdChoices? compliance with online behavioral advertising notice and choice requirements. CyLab Technical Report Carnegie Mellon University-CyLab-11-005, 2011.",
      "doi": ""
    },
    {
      "text": "Krishnamurthy, B., and Wills, C. Privacy diffusion on the web: a longitudinal perspective. In Proc. WWW (2009), 541--550.  ",
      "doi": "10.1145/1526709.1526782"
    },
    {
      "text": "Lederer, S., Hong, J., Dey, A., and Landay, J. Personal privacy through understanding and action: five pitfalls for designers. Personal and Ubiquitous Computing 8, 6 (2004), 440--454.  ",
      "doi": ""
    },
    {
      "text": "Leon, P. G., Cranor, L. F., McDonald, A. M., and McGuire, R. Token attempt: the misrepresentation of website privacy policies through the misuse of P3P compact policy tokens. In Proc. WPES (2010), 93--104.  ",
      "doi": "10.1145/1866919.1866932"
    },
    {
      "text": "Lewis, J. R. Handbook of Human Factors and Ergonomics. John Wiley & Sons, Inc., 2006, ch. 49 Usability Testing, 1275--1316.",
      "doi": ""
    },
    {
      "text": "McDonald, A. M., and Cranor, L. F. Beliefs and behaviors: Internet users' understanding of behavioral advertising. In TPRC (2010).",
      "doi": ""
    },
    {
      "text": "Sauro, J. A Practical Guide to the System Usability Scale (SUS): Background, Benchmarks & Best Practices. Denver, CO: Measuring Usability LLC., 2011.",
      "doi": ""
    },
    {
      "text": "Turow, J., King, J., Hoofnagle, C. J., Bleakley, A., and Hennessy, M. Americans reject tailored advertising and three activities that enable it. http://ssrn.com/abstract=1478214 (2009).",
      "doi": ""
    }
  ]
}