{
  "doi": "10.1145/2207676.2208611",
  "title": "Consensus building in open source user interface design discussions",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1491-1500",
  "year": 2012,
  "badges": [],
  "abstract": "We report results of a study which examines consensus building in user interface design discussions in open source software communities. Our methodology consisted of conducting interviews with designers and developers from the Drupal and Ubuntu communities (N=17) and analyzing a large corpus of interaction data collected from Drupal. The interviews captured user perspectives on the challenges of reaching consensus, techniques employed for building consensus, and the consequences of not reaching consensus. We analyzed the interaction data to determine how different elements of the content, process, and user relationships in the design discussions affect consensus. Our main result shows that design discussions engaging participants with more experience and prior interaction history are more likely to reach consensus. Based on all of our results, we formulated design implications for promoting consensus in distributed discussions of user interface design issues.",
  "authors": [
    {
      "name": "Roshanak Zilouchian Moghaddam",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658921",
      "orcid": "missing"
    },
    {
      "name": "Brian Bailey",
      "institution": "University of Illinois-Urbana, Urbana, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    },
    {
      "name": "Wai-Tat Fu",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, Illinois, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244379",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamic, L. A., Zhang, J., Bakshy, E. and Ackerman, M. S. Knowledge Sharing and Yahoo Answers: Everyone Knows Something. In Proc. WWW 2008, 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Agichtein, E., Castillo, C., Donato, D., Gionis, A. and Mishne, G. Finding High-Quality Content in Social Media. In Proc. WSDM 2008, 183--194.  ",
      "doi": "10.1145/1341531.1341557"
    },
    {
      "text": "Baltes, B. B., Dickson, M. W., Sherman, M. P., Bauer, C. C. and LaGanke, J. S. Computer-Mediated Communication and Group Decision Making: A Meta-Analysis. Organizational Behavior and Human Decision Processes, 87, 1 (2002), 156179.",
      "doi": ""
    },
    {
      "text": "Barcellini, F., Détienne, F., Burkhardt, J.-M. and Sack, W. A Study of Online Discussions in an Open-Source Software Community. Springer Netherlands, 2005.",
      "doi": ""
    },
    {
      "text": "Benkler, Y. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale Univ. Press., (2006). ",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Briggs, R. O., Kolfschoten, G. L. and Vreede, G.-J. d. Toward a Theoretical Model of Consensus Building. In Proc. AMCIS",
      "doi": ""
    },
    {
      "text": "Burke, M. and Kraut, R. Mopping Up: Modeling Wikipedia Promotion Decisions In Proc. CSCW 2008, 27--36.  ",
      "doi": "10.1145/1460563.1460571"
    },
    {
      "text": "Clawson, V. K., Bostrom, R. P. and Anson, R. The Role of the Facilitator in Computer- Supported Meetings. Small Group Research, 24(1993), 547--565.",
      "doi": ""
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L. and Riedl, J. SuggestBot: using intelligent task routing to help people find work in wikipedia. In Proc. IUI 2007, 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Erickson, T., Kellogg, W. A., Laff, M., Sussman, J., Wolf, T. V., Halverson, C. A. and Edwards, D. A persistent chat space for work groups: the design, evaluation and deployment of loops. In Proc. DIS 2006, 331--340.  ",
      "doi": "10.1145/1142405.1142454"
    },
    {
      "text": "Farnham, S., Chesley, H. R., McGhee, D. E., Kawal, R. and Landau, J. Structured Online Interactions: Improving the Decision Making of Small Discussion Groups. In Proc. CSCW 2000, 299--308.  ",
      "doi": "10.1145/358916.359001"
    },
    {
      "text": "Fiol, C. M. Consensus, diversity, and learning in organizations. Organizational Science, 5, 3 (1994), 403--420.",
      "doi": "10.1287/orsc.5.3.403"
    },
    {
      "text": "Hare, A. P. A Study of Interaction and Consensus in Different Sized Groups. American Sociological Review, 17, 3 (1952), 261--267.",
      "doi": ""
    },
    {
      "text": "Hars, A. and Ou, S. Working for Free? Motivations for Participating in Open-Source Projects. International Journal of Electronic Commerce, 6, 3 (2002), 25--39. ",
      "doi": "10.5555/1286960.1286963"
    },
    {
      "text": "Heckman, R., Crowston, K., Eseryel, Y. U., Howison, J., Allen, E. and Li, Q. Emergent Decision-making Practices in Free/Libre Open Source Software (FLOSS) Development Teams. Springer, 2007.",
      "doi": ""
    },
    {
      "text": "Hiltz, S. R., Johnson, K. and Turoff, M. Experiments in Group Decision Making Communication Process and Outcome in Face-to-Face Versus Computerized Conferences. Human Communication Research, 13(1986), 225--252.",
      "doi": ""
    },
    {
      "text": "Horowitz, D. and Kamvar, S. D. The anatomy of a large-scale social search engine. In Proc. WWW 2010, 431--440.  ",
      "doi": "10.1145/1772690.1772735"
    },
    {
      "text": "Kerr, N. L. and Tindale, R. S. Group Performance and Decision Making. Annu. Rev. Psychol, 55(2004), 623--655.",
      "doi": ""
    },
    {
      "text": "Ko, A. J. and Chilana, P. K. Design, discussion, and dissent in open bug reports. In Proc. iConference 2011, 106--113.  ",
      "doi": "10.1145/1940761.1940776"
    },
    {
      "text": "Ko, A. J. and Chilana, P. K. How power users help and hinder open bug reporting. In Proc. CHI 2010, 1665--1674.  ",
      "doi": "10.1145/1753326.1753576"
    },
    {
      "text": "Lam, S. K., Karim, J. and Riedl, J. The effects of group composition on decision quality in a social production community. In Proc. GROUP 2010, 55--64.  ",
      "doi": "10.1145/1880071.1880083"
    },
    {
      "text": "Lemus, D. R., Seibold, D. R., Flanagin, A. J. and Metzger, M. J. Argument and Decision Making in Computer-Mediated Groups. Journal of Communication, 54, 2 (2004), 302--320.",
      "doi": ""
    },
    {
      "text": "Luther, K., Counts, S., Stecher, K. B., Hoff, A. and Johns, P. Pathfinder: an online collaboration environment for citizen scientists. In Proc. CHI 2009, 239--248.  ",
      "doi": "10.1145/1518701.1518741"
    },
    {
      "text": "Straus, S. G. and McGrath, J. Does the medium matter? The interaction of task type and technology on group performance and member reactions. Journal of Applied Psychology, 79(1994), 87--97.",
      "doi": ""
    },
    {
      "text": "Strauss, A. L. Qualitative analysis for social scientists. Cambridge University Press, (1987).",
      "doi": ""
    },
    {
      "text": "Susskind, L., McKearnan, S. and Thomas-Larmer, J. The Consensus Building Handbook. 1999.",
      "doi": ""
    },
    {
      "text": "Twidale, M. B. and Nichols, D. M. Exploring Usability Discussions in Open Source Development. In Proc. HICSS 2005, 198.193.  ",
      "doi": "10.1109/HICSS.2005.266"
    },
    {
      "text": "Uzzi, B. Social structure and competition in interfirm networks: the paradox of embeddedness. Administrative Science Quarterly, 42, 1 (1997), 35--67.",
      "doi": ""
    },
    {
      "text": "Willett, W., Heer, J., Hellerstein, J. and Agrawala, M. CommentSpace: structured support for collaborative visual analysis. In Proc. CHI 2011, 3131--3140.  ",
      "doi": "10.1145/1978942.1979407"
    },
    {
      "text": "Zaheer, A. and Bell, G. G. Benefiting from network position: firm capabilities, structural holes, and performance. Strategic Management Journal, 26, 9 (2005), 809--825.",
      "doi": ""
    },
    {
      "text": "Zilouchian Moghaddam, R., Bailey, B. and Poon, C. IdeaTracker: An Interactive Visualization Supporting Collaboration and Consensus Building in Online Interface Design Discussions. In Proc. INTERACT 2011 2011, 259276. ",
      "doi": "10.5555/2042053.2042083"
    }
  ]
}