{
  "doi": "10.1145/2207676.2208590",
  "title": "Digital pen and paper practices in observational research",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1331-1340",
  "year": 2012,
  "badges": [],
  "abstract": "Researchers from many disciplines are taking advantage of increasingly inexpensive digital video to capture extensive records of human activity in real-world settings. The ability to record and share such data has created a critical moment in the practice and scope of behavioral research. While recent work is beginning to develop techniques for visualizing and interacting with integrated multimodal information collected during field research, navigating and analyzing these large datasets remains challenging and tools are especially needed to support the early stages of data exploration. In this paper we describe digital pen and paper practices in observational research and their integration with ChronoViz, a tool for annotating, visualizing, and analyzing multimodal data. The goal is to better support researchers both in the field, while collecting data, and later in the lab, during analysis. We document the co-evolution of notetaking practices and system features as 28 participants used the tool during an 18-month deployment.",
  "authors": [
    {
      "name": "Nadir Weibel",
      "institution": "University of California San Diego, La Jolla, California, United States",
      "img": "/do/10.1145/contrib-81100240198/rel-imgonly/nadirweibel_small.jpg",
      "acmid": "81100240198",
      "orcid": "0000-0002-3457-4227"
    },
    {
      "name": "Adam Fouse",
      "institution": "University of California, San Diego, La Jolla, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319491523",
      "orcid": "missing"
    },
    {
      "name": "Colleen Emmenegger",
      "institution": "University of California, San Diego, La Jolla, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500664111",
      "orcid": "missing"
    },
    {
      "name": "Whitney Friedman",
      "institution": "University of California, San Diego, La Jolla, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502786100",
      "orcid": "missing"
    },
    {
      "name": "Edwin Hutchins",
      "institution": "University of California, San Diego, La Jolla, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100209416",
      "orcid": "missing"
    },
    {
      "name": "James Hollan",
      "institution": "UCSD, La Jolla, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332504463",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bernstein, M., Van Kleek, M., Karger, D., and Schraefel, M. Information scraps: How and why information eludes our personal information management tools. ACM TOIS 26, 4 (2008), 1--46.  ",
      "doi": "10.1145/1402256.1402263"
    },
    {
      "text": "Brandl, P., Richter, C., and Haller, M. Nicebook: supporting natural note taking. In Proc. CHI '10 (2010), 599--608.  ",
      "doi": "10.1145/1753326.1753417"
    },
    {
      "text": "Fouse, A., and Hollan, J. D. DataPrism: A tool for visualizing multimodal data. In Proc. Measuring Behavior 2010 (2010), 1:1--1:4.  ",
      "doi": "10.1145/1931344.1931345"
    },
    {
      "text": "Fouse, A., Weibel, N., Hutchins, E., and Hollan, J. D. Chronoviz: a system for supporting navigation of time-coded data. In Extended Abstracts of CHI 2011 (2011), 299--304.  ",
      "doi": "10.1145/1979742.1979706"
    },
    {
      "text": "Goldman, R., Pea, R., Barron, B., and Derry, S., Eds. Video Research in the Learning Sciences. 2007.",
      "doi": ""
    },
    {
      "text": "Guimbretière, F. Paper Augmented Digital Documents. In Proc. UIST 2003 (2003), 51--60.  ",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Hutchins, E. Cognition in the wild. MIT Press, 1995.",
      "doi": ""
    },
    {
      "text": "Hymes, D. The ethnography of speaking. Anthropology and human behavior 13, 53 (1962), 11--74.",
      "doi": ""
    },
    {
      "text": "Ispas, A., Signer, B., and Norrie, M. C. A study of incidental notetaking to inform digital pen and paper solutions.",
      "doi": ""
    },
    {
      "text": "Lin, M., Lutters, W., and Kim, T. Understanding the micronote lifecycle: improving mobile support for informal note taking. In Proc. CHI 2004 (2004), 687--694.  ",
      "doi": "10.1145/985692.985779"
    },
    {
      "text": "Mackay, W., Fayard, A., Frobert, L., and Médini, L. Reinventing the familiar: exploring an augmented reality design space for air traffic control. In Proc. CHI 1998 (1998), 558--565.  ",
      "doi": "10.1145/274644.274719"
    },
    {
      "text": "Mackay, W. E., Pothier, G., Letondal, C., Bøegh, K., and Sørensen, H. E. The Missing Link: Augmenting Biology Laboratory Notebooks. In Proc. UIST 2002 (2002), 41--50.  ",
      "doi": "10.1145/571985.571992"
    },
    {
      "text": "McAlpine, H., Hicks, B., Huet, G., and Culley, S. An investigation into the use and content of the engineer's logbook. Design Studies 27, 4 (2006), 481--504.",
      "doi": ""
    },
    {
      "text": "Sacks, H. Lectures on conversation, vol. 1. 1995.",
      "doi": ""
    },
    {
      "text": "Sellen, A., and Harper, R. The Myth of the Paperless Office. The MIT Press, 2003. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Stifelman, L., Arons, B., and Schmandt, C. The audio notebook: paper and pen interaction with structured speech. In Proc. CHI 2001 (2001), 182--189.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Tabard, A., Mackay, W., and Eastmond, E. From individual to collaborative: the evolution of prism, a hybrid laboratory notebook. In Proc. CSCW 2008 (2008), 569--578.  ",
      "doi": "10.1145/1460563.1460653"
    },
    {
      "text": "Tsandilas, T., Letondal, C., and Mackay, W. Musink: composing music through augmented drawing. In Proc. CHI 2009 (2009), 819--828.  ",
      "doi": "10.1145/1518701.1518827"
    },
    {
      "text": "Weibel, N., Fouse, A., Hutchins, E., and Hollan, J. D. Supporting an integrated paper-digital workflow for observational research. In Proc. IUI 2011 (2011), 257--266.  ",
      "doi": "10.1145/1943403.1943443"
    },
    {
      "text": "Yeh, R. B., Liao, C., Klemmer, S. R., Guimbretière, F., Lee, B., Kakaradov, B., Stamberger, J., and Paepcke, A. ButterflyNet: A Mobile Capture and Access System for Field Biology Research. In Proc. CHI 2006 (2006), 571--580.  ",
      "doi": "10.1145/1124772.1124859"
    }
  ]
}