{
  "doi": "10.1145/2207676.2207714",
  "title": "Improving scrolling devices with document length dependent gain",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "267-276",
  "year": 2012,
  "badges": [],
  "abstract": "We describe a method for applying gain to events reported by scrolling input devices such as scroll wheels. By treating document length as an input to our gain functions, the method allows rapid document traversal regardless of document length; it also allows slow and precise scroll control at shorter distances. An initial experiment characterises four diverse scrolling input devices -- a standard 'notched' scroll wheel, a high performance 'inertial' wheel, an isometric scrolling joystick, and a trackpad -- and the results are used to calibrate several gain function parameters. A second experiment validates the method, showing that it allows faster scrolling in long and short documents than current scrolling-device gain methods, and that subjective preferences favour it.",
  "tags": [
    "control-display gain",
    "empirical studies",
    "scrolling"
  ],
  "authors": [
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Philip Quinn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351595064",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Stephen Fitchett",
      "institution": "University of Canterbury & University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607003",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. and Beale, R. Users, systems and interfaces: A Unifying Framework for Interaction. in People and computers VI. Proc. British HCI '91. 20, 1991, 73--87.",
      "doi": ""
    },
    {
      "text": "Aliakseyeu, D., Irani, P., Lucero, A. and Subramanian, S. Multi-flick: An evaluation of flick-based scrolling techniques for pen interfaces. in Proc. CHI'08, ACM Press, (2008), 1689--1698.  ",
      "doi": "10.1145/1357054.1357319"
    },
    {
      "text": "Appert, C. and Fekete, J. OrthoZoom Scroller: 1D Mutli-scale navigation. in Proc. CHI'06, ACM Press, (2006), 21--30.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "Buxton, W. Lexical and pragmatic considerations of input structures. SIGGRAPH Computer Graphics 17, 1 (1983), 31--37.  ",
      "doi": "10.1145/988584.988586"
    },
    {
      "text": "Card, S., Mackinlay, J.D. and Robertson, G. A morphological analysis of the design space of input devices. ACM Transactions on Information Systems 9, 2 (1991), 99--122.  ",
      "doi": "10.1145/123078.128726"
    },
    {
      "text": "Casiez, G. and Roussel, N. No more Bricolage! Methods and Tools to Characterize, Replicate and Compare Pointing Transfer Functions. in Proc. UIST '11, ACM Press, (2011).  ",
      "doi": "10.1145/2047196.2047276"
    },
    {
      "text": "Casiez, G., Vogel, D., Balakrishnan, R. and Cockburn, A. The Impact of Control-Display Gain on User Performance in Pointing Tasks. Human-Computer Interaction 23, 3 (2008), 215--250.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Gutwin, C. and Alexander, J. Faster Document Navigation with Space-Filling Thumbnails. in Proc CHI '06, ACM Press, (2006), 1--10.  ",
      "doi": "10.1145/1124772.1124774"
    },
    {
      "text": "Cockburn, A., Savage, J. and Wallace, A. Tuning and Testing Scrolling Interfaces that Automatically Zoom. in Proc. CHI '05, ACM Press, (2005), 71--80.  ",
      "doi": "10.1145/1054972.1054983"
    },
    {
      "text": "Hart, S. and Staveland, L. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. in Hancock, P. and Meshkati, N. eds. Human Mental Workload, 1988, 139--183.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Cutrell, E., Bathiche, S. and Muss, T. Quantitative Analysis of Scrolling Techniques. in Proc. CHI '02, ACM Press, (2002), 65--72.  ",
      "doi": "10.1145/503376.503389"
    },
    {
      "text": "Hinckley, K. and Cuttrell, E. Distance-based accelerated scrolling. US Patent: 7,173,637 B1, 2007.",
      "doi": ""
    },
    {
      "text": "Igarashi, T. and Hinckley, K. Speed-dependent Automatic Zooming for Browsing Large Documents. in Proc. UIST '00, ACM Press, (2000), 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Ishak, E. and Feiner, S. Content-aware scrolling. in Proc. UIST '06, ACM Press, (2006), 155--158.  ",
      "doi": "10.1145/1166253.1166277"
    },
    {
      "text": "Jacob, R., Sibert, L., McFarlane, D. and Mullen, M. Integrality and separability of input devices. ACM Transactions on Human-Comptuer Interaction. 1, 1 (1994), 3--26.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Malacria, S., Lecolinet, E. and Guiard, Y. Clutch-free panning and integrated pan-zoom control on touchsensitive surfaces: the cyclostar approach. in Proc. CHI '10, ACM Press, (2010), 2615--2624.  ",
      "doi": "10.1145/1753326.1753724"
    },
    {
      "text": "Moscovich, T. and Hughes, J. Navigating documents with the virtual scroll ring. in Proc. UIST '04, ACM Press, (2004), 57--60.  ",
      "doi": "10.1145/1029632.1029642"
    },
    {
      "text": "Wobbrock, J., Findlater, L., Gergle, D. and Higgins, J. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only ANOVA Procedures. in Proc. CHI '11, ACM Press, (2011), 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Zhai, S., Smith, B. and Selker, T. Improving Browsing Performance: A Study of Four Input Devices for Scrolling and Pointing Tasks. in Proc. INTERACT'97, (1997), 286--292. ",
      "doi": "10.5555/647403.723823"
    }
  ]
}