{
  "doi": "10.1145/2207676.2208538",
  "title": "What should we expect from research through design?",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "937-946",
  "year": 2012,
  "badges": [],
  "abstract": "In this essay, I explore several facets of research through design in order to contribute to discussions about how the approach should develop. The essay has three parts. In the first, I review two influential theories from the Philosophy of Science to help reflect on the nature of design theory, concluding that research through design is likely to produce theories that are provisional, contingent, and aspirational. In the second part, I discuss three possible interpretations for the diversity of approaches to research through design, and suggest that this variation need not be seen as a sign of inadequate standards or a lack of cumulative progress in the field, but may be natural for a generative endeavour. In the final section, I suggest that, rather than aiming to develop increasingly comprehensive theories of design, practice based research might better view theory as annotation of realised design examples, and particularly portfolios of related pieces. Overall, I suggest that the design research community should be wary of impulses towards convergence and standardisation, and instead take pride in its aptitude for exploring and speculating, particularising and diversifying, and - especially - its ability to manifest the results in the form of new, conceptually rich artefacts.",
  "tags": [
    "theory",
    "portfolios",
    "research through design",
    "philosophy of science",
    "annotation"
  ],
  "authors": [
    {
      "name": "William Gaver",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    }
  ],
  "references": [
    {
      "text": "Alexander, C., Ishikawa, S. (1977) A pattern language: towns, buildings, construction. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Bardzell, J., Bardzell, S., DiSalvo, C., Gaver, B. and Sengers P (2012). Panel: The humanities and/in HCI. CHI'2012.  ",
      "doi": "10.1145/2212776.2212405"
    },
    {
      "text": "Collins, R. (1994). Why the Social Sciences Won't Become High-Consensus, Rapid-Discovery Science. Sociological Forum 9(2) 155--177.",
      "doi": ""
    },
    {
      "text": "Crampton-Smith, G. and Tabor, P. 1996. The role of the artist-designer. In Bringing Design To Software, T. Winograd, Ed. ACM, New York, NY, 37--61.  ",
      "doi": "10.1145/229868.230031"
    },
    {
      "text": "Curd, M. and Cover, J. (1998). Philosophy of Science: The Central Issues. London: W. W. Norton & Co.",
      "doi": ""
    },
    {
      "text": "Djajadiningrat, T., Matthews, B., Stienstra, M. (2007). Easy doesn't do it: skill and expression in tangible aesthetics. Pers Ubiquit Comput 11:657--676.  ",
      "doi": "10.1007/s00779-006-0137-9"
    },
    {
      "text": "Fallmann, D. (2003). Design-oriented human-computer interaction. CHI'2003, 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Feynman, R. (1989). The character of physical law. London: MIT Press.",
      "doi": ""
    },
    {
      "text": "Forlizzi, J., DiSalvo, C., Bardzell, J., Koskinen, I., and Wensveen, S. (2011). Quality control: A panel on the critique and criticism of design research. CHI 2011 Panel, 823--826.  ",
      "doi": "10.1145/1979742.1979497"
    },
    {
      "text": "Forlizzi, J. (2008). The Product Ecology: understanding social product use and supporting design culture. International Journal of Design 2 (1), 11--20.",
      "doi": ""
    },
    {
      "text": "Frayling, C. Research in Art and Design. Royal College of Art Research Papers 1, 1 (1993), 1--5.",
      "doi": ""
    },
    {
      "text": "Gaver, W. (2011) Making spaces: how design workbooks work. Proc. CHI '11, 1551--1560.  ",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "Gaver, W., (2009). Designing for Homo Ludens, Still. In (Re)searching the Digital Bauhaus. Binder, T., Löwgren, J., and Malmborg, L. (eds.). London: Springer, pp. 163--178.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Beaver, J., and Benford, S. (2003). Ambiguity as a resource for design. Proc. CHI'03, Ft. Lauderdale. New York: ACM Press.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Gibson, J. (1979). The ecological approach to visual perception. Boston: Haughton Mifflin, 1979.",
      "doi": ""
    },
    {
      "text": "Isbister, K., and Höök, K. (2007). Supple interfaces: designing and evaluating for richer human connections and experiences. Proc CHI'07 extended abstracts, 2853--2856.  ",
      "doi": "10.1145/1240866.1241094"
    },
    {
      "text": "Kuhn, T. (1970). The Structure of Scientific Revolutions. London: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Kuhn, T. (1977). Objectivity, value judgment, and theory choice. Reprinted in {3}.",
      "doi": ""
    },
    {
      "text": "Lakatos, I. (1977). Science and pseudoscience. Reprinted in {3}.",
      "doi": ""
    },
    {
      "text": "Latour, B. (1987). Science in Action. Cambridge, Mass: Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Law, J. and Urry, J. (2004). Enacting the social. Economy and Society 33(3) pp 390--410.",
      "doi": ""
    },
    {
      "text": "Osborne, T. and Rose, N. (1999). Do the social sciences create phenomena?: the example of public opinion research. British Journal of Sociology 50(3) pp. 367--396.",
      "doi": ""
    },
    {
      "text": "Overbeeke, K. and Wesveen, S. (2003). From perception to experience, from affordances to irresistibles. Proc. DPPI'03, 92--97.  ",
      "doi": "10.1145/782896.782919"
    },
    {
      "text": "Popper, K. (1963). Science: conjectures and refutations. Reprinted in {3}.",
      "doi": ""
    },
    {
      "text": "Pullin, Graham (2010). Curating and creating design collections. Design and Culture 2 (1), 309--328.",
      "doi": ""
    },
    {
      "text": "Rittel, H., and Webber, M. (1974). Dilemmas in general theory of planning. Design Research and Methods, 8(1), 31--39.",
      "doi": ""
    },
    {
      "text": "Rogers, Y. (2004). New theoretical approaches for humancomputer interaction. In B. Cronin (Vol. Ed.), Annual review of information, science and technology: Vol. 38 (pp. 87--143). Medford, NJ: Information Today.",
      "doi": ""
    },
    {
      "text": "Schoen, D. (1983). The reflective practitioner, how professionals think. New York, Basic Books.",
      "doi": ""
    },
    {
      "text": "Sengers, P. (2006). Must design become 'scientific'? DIS'06 Workshop on Exploring Design as a Research Activity.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K., David, S., and Kaye, J. (2005). Reflective design. Proc. AARHUS'05, 49--58. 24.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Stolterman, E. (2008). The nature of design practice and implications for interaction design research. International Journal of Design 2(1), 55--65.",
      "doi": ""
    },
    {
      "text": "Wiltse, H. and Stolterman, E. (2010). Architectures of interaction: An architectural perspective on digital experience. Proc. NordiCHI 2010, 821--824.  ",
      "doi": "10.1145/1868914.1869038"
    },
    {
      "text": "Zimmerman, J., and Forlizzi, J. (2008) The Role of Design Artifacts in Design Theory Construction. Human-Computer Interaction Institute. Paper 37.",
      "doi": ""
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evenson, S. (2007). Research through design as a method for interaction design research in HCI. Proc. CHI'07 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Zimmerman, J., Stolterman, E., and Forlizzi, J. (2010). An analysis and critique of research through design: toward a formalization of a research approach. DIS 2010, 310--319.  ",
      "doi": "10.1145/1858171.1858228"
    },
    {
      "text": "Zimmerman, J. (2009). Designing for the Self: Making products that help people become the person they desire to be. Proc. CHI 2009, 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}