{
  "doi": "10.1145/2207676.2208545",
  "title": "WebTicket: account management using printable tokens",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "997-1006",
  "year": 2012,
  "badges": [],
  "abstract": "Passwords are the most common authentication scheme today. However, it is difficult for people to memorize strong passwords, such as random sequences of characters. Additionally, passwords do not provide protection against phishing attacks. This paper introduces WebTicket, a low cost, easy-to-use and reliable web account management system that uses \"tickets\", which are tokens that contain a two-dimensional barcode that can be printed or stored on smartphones. Users can log into accounts by presenting the barcodes to webcams connected to computers. Through two lab studies and one field study consisting of 59 participants in total, we found that WebTicket can provide reliable authentication and phishing resilience.",
  "authors": [
    {
      "name": "Eiji Hayashi",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371593190",
      "orcid": "missing"
    },
    {
      "name": "Bryan Pendleton",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489834",
      "orcid": "missing"
    },
    {
      "name": "Fatih Ozenc",
      "institution": "Autodesk Inc., Waltham, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657682",
      "orcid": "missing"
    },
    {
      "name": "Jason Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    }
  ],
  "references": [
    {
      "text": "eToken. http://www.aladdin.com/etoken/.",
      "doi": ""
    },
    {
      "text": "QRCode.com. http://www.denso-wave.com/qrcode/.",
      "doi": ""
    },
    {
      "text": "RSA securID http://www.rsa.com/node.aspx?id=1156.",
      "doi": ""
    },
    {
      "text": "A. Adams and M. Sasse. Users are not the enemy. Communications of the ACM (1999).  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "S. Brostoff and M. Sasse. Are passfaces more usable than passwords: A field trial investigation. In Proc. of HCI 2000, (2000).",
      "doi": ""
    },
    {
      "text": "S. Chiasson, R. Biddle, and P. V. Oorschot. A second look at the usability of click-based graphical passwords. In Proc. of SOUPS (2007).  ",
      "doi": "10.1145/1280680.1280682"
    },
    {
      "text": "R. Dhamija and J. Tygar. The battle against phishing: Dynamic security skins. In Proc. of SOUPS (2005).  ",
      "doi": "10.1145/1073001.1073009"
    },
    {
      "text": "A. Dirik, N. Memon, and J. C. Birget. Modeling user choice in the passpoints graphical password scheme. In Proc. of SOUPS (2007).  ",
      "doi": "10.1145/1280680.1280684"
    },
    {
      "text": "S. Egelman, L. F. Cranor, J. Hong. You've been warned: an empirical study of the effectiveness of web browser phishing warnings. In Proc. of SIGCHI (2008)  ",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "K. Everitt, T. Bragin, J. Fogarty, and T. Kohno. A comprehensive study of frequency, interference, and training of multiple graphical passwords. In Proc. of CHI (2009).  ",
      "doi": "10.1145/1518701.1518837"
    },
    {
      "text": "Gartner. Automated password resets can cut it service desk costs. 2004.",
      "doi": ""
    },
    {
      "text": "S. Gaw and E. Felten. Password management strate-gies for online accounts. In Proc. of SOUPS (2006).  ",
      "doi": "10.1145/1143120.1143127"
    },
    {
      "text": "J. T. Hallinan. Why We Make Mistakes. Broadway, 2009.",
      "doi": ""
    },
    {
      "text": "E. Hayashi, R. Dhamija, N. Christin, and A. Perrig. Use your illusion: secure authentication usable anywhere. In Proc. of SOUPS (2008).  ",
      "doi": "10.1145/1408664.1408670"
    },
    {
      "text": "E. Hayashi, J. I. Hong, A Diary Study of Password Usage in Daily Life. In Proc. of SIGCHI (2011).  ",
      "doi": "10.1145/1978942.1979326"
    },
    {
      "text": "D. V. Klein. \"foiling the cracker\": A survey of, and improvements to, password security. In Proc. of USENIX Security, (1990).",
      "doi": ""
    },
    {
      "text": "S. Klemmer, M. Newman, and R. Farrell. The designers' outpost: a tangible interface for collaborative web site. In Proc. of UIST (2001).  ",
      "doi": "10.1145/502348.502350"
    },
    {
      "text": "C. Kuo, S. Romanosky, and L. Cranor. Human selection of mnemonic phrase-based passwords. In Proc. of SOUPS (2006).  ",
      "doi": "10.1145/1143120.1143129"
    },
    {
      "text": "S. L. Learning 10,000 pictures. Quarterly Journal of Experimental Psychology, (1967).",
      "doi": ""
    },
    {
      "text": "W. MacKay. Is paper safer? The role of paper flight strips in air traffic control. ACM Transactions on Computer-Human Interaction, (1999).  ",
      "doi": "10.1145/331490.331491"
    },
    {
      "text": "J. McCune, A. Perrig, and M. Reiter. Seeing-isbelieving: Using camera phones for human-verifiable authentication. In IEEE S&P (2005).  ",
      "doi": "10.1109/SP.2005.19"
    },
    {
      "text": "D. McGee, P. Cohen, R. Wesson, and S. Horman. Comparing paper and tangible, multimodal tools. In Proc. of CHI (2002).  ",
      "doi": "10.1145/503376.503449"
    },
    {
      "text": "T. Moran, E. Saund, W. V. Melle, A. Gujar, K. Fishkin, and B. Harrison. Design and technology for collaborage: collaborative collages of information on physical walls. In Proc. of UIST (1999).  ",
      "doi": "10.1145/320719.322602"
    },
    {
      "text": "L. Nelson, S. Ichimura, E. Pedersen, and L. Adams. Palette: a paper interface for giving presentations. In Proc. of CHI (1999).  ",
      "doi": "10.1145/302979.303109"
    },
    {
      "text": "A. Paivio and T. Rogers. Why are pictures easier to recall than words? Psychonomic Science, (1968).",
      "doi": ""
    },
    {
      "text": "B. Parno, C. Cuo and A. Perrig, PhoolprofPhishing Prevention. In Proc of. the Financial Cryptography and data security (2006).  ",
      "doi": "10.1007/11889663_1"
    },
    {
      "text": "B. Ross, C. Jackson, N. Miyake, D. Boneh, and J. Mitchell. Stronger password authentication using browser extensions. In Proc. of the USENIX Security(2005). ",
      "doi": "10.5555/1251398.1251400"
    },
    {
      "text": "M. Sasse, S. Brostoff, and D. Weirich. Transforming the 'weakest link' a human/computer interaction approach to usable and effective security. BT technology journal, (2001).  ",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "A. Whitten and J. Tygar. Why johnny can't encrypt. In USENIX Security, (1999).",
      "doi": ""
    },
    {
      "text": "S. Wiedenbeck, J. Waters, J. Birget, and A. Brodskiy. Passpoints: Design and longitudinal evaluation of a graphical password system. International Journal of Human-Computer Studies, (2005).  ",
      "doi": "10.1016/j.ijhcs.2005.04.010"
    },
    {
      "text": "J. Yan, A. Blackwell, R. Anderson, and A. Grant. Password memorability and security: Empirical results. In IEEE Security & privacy, Vol. 2, pp. 25--31, (2004).  ",
      "doi": "10.1109/MSP.2004.81"
    },
    {
      "text": "K. Yee, K. Sitaker. Passpet: convenient password management and phishing protection. In Proc. of SOUPS (2006).  ",
      "doi": "10.1145/1143120.1143126"
    },
    {
      "text": "Your Top 20 most frequently used passwords. http://www.tomshardware.com/news/imperva-rockyoumost-common-passwords,9486.html",
      "doi": ""
    }
  ]
}