{
  "doi": "10.1145/2207676.2207706",
  "title": "How small can you go?: analyzing the effect of visual angle in pointing tasks",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "213-216",
  "year": 2012,
  "badges": [],
  "abstract": "People are increasingly using wireless mice from across rooms as they use computers as entertainment centers. As a consequence, they often have to point at targets occupying small visual angles. In this note we present the results of a study on pointing performance for targets occupying small visual angles. Our results suggest there is a steep degradation of pointing performance in both accuracy and speed for targets occupying a visual angle below 3 minutes of arc.",
  "tags": [
    "visual angle",
    "efficiency",
    "accuracy",
    "pointing"
  ],
  "authors": [
    {
      "name": "Juan Pablo Hourcade",
      "institution": "University of Iowa, Iowa City, Iowa, United States",
      "img": "/do/10.1145/contrib-81100553487/rel-imgonly/jph-july-2011.jpg",
      "acmid": "81100553487",
      "orcid": "missing"
    },
    {
      "name": "Natasha Bullock-Rest",
      "institution": "University of Iowa, Iowa City, Iowa, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502681165",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bakdash, J. Z., Augustyn, J. S., and Proffitt, D. R. (2006). Large displays enhance spatial knowledge of a virtual environment. Proceedings of APGV '0 ACM Press: pp. 59--62.  ",
      "doi": "10.1145/1140491.1140503"
    },
    {
      "text": "Blanch, R., Guiard, Y. & Beaudouin-Lafon, M. (2004). Semantic Pointing: Improving Target Acquisition with Control-Display Ratio Adaptation. Proceedings of CHI 2004. ACM Press: pp. 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Cockburn, A. and Brock, P. (2006). Human On-Line Response to Visual and Motor Target Expansion. Proceedings of Graphics Interface 2006, 81--87. ",
      "doi": "10.5555/1143079.1143093"
    },
    {
      "text": "Holladay, J. T. (1997). Proper Method for Calculating Average Visual Acuity. Journal of Refractive Surgery, 13, 388--391.",
      "doi": ""
    },
    {
      "text": "Hourcade, J. P., Nguyen, C. M., Perry, K. B. and Denburg, N. L. (2010). PointAssist for Older Adults: Analyzing Sub-Movement Characteristics to Aid in Pointing Tasks. Proceedings of CHI 20 ACM Press: pp. 1115--1124.  ",
      "doi": "10.1145/1753326.1753494"
    },
    {
      "text": "Jota, R., Nacenta, M. A., Jorge, J. A., Carpendale, S. and Greenberg, S. (2010). A comparison of ray pointing techniques for very large displays. In Proceedings of Graphics Interface 2010 (GI '10), 269--276. ",
      "doi": "10.5555/1839214.1839261"
    },
    {
      "text": "Kopper, R., Silva, M. G., McMahan, R. P. and Bowman, D. A. (2008). Increasing the Precision of Distant Pointing for Large High-Resolution Displays. TR-08-17, Computer Science, Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Kovacs, A. J., Buchanan, J. J. and Shea, C. H. (2008). Perceptual influences on Fitts' law. Exp. Brain Research, 190, 99--103.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S. (2004). Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies, 61(6), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Tan, D. S., Gergle, D., Scupelli, P., and Pausch, R. 2006. Physically large displays improve performance on spatial tasks. ACM Trans. Comput.-Hum. Interact. 13, 1, 71--99.  ",
      "doi": "10.1145/1143518.1143521"
    }
  ]
}