{
  "doi": "10.1145/2207676.2207692",
  "title": "Health promotion as activism: building community capacity to effect social change",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "99-108",
  "year": 2012,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As HCI researchers have designed tools to promote wellness, disease has often been approached as a general problem. In contrast, public health research argues for an activist approach focused on how certain groups disproportionately experience disease and eliminating these disparities. Taking this activist stance, we examine how technology can reduce health inequalities by disrupting power relationships and helping communities pursue social change. We discuss our tool, Community Mosaic (CM), which allows individuals to share their healthy eating ideas with one another as a means of advocating behavior change. Our results characterize how CM helped facilitate activism (i.e., collective efforts to counter local challenges to healthy living) and shift users' attitudes regarding their role as advocates for health. We contribute to the field of HCI by using our findings to present a set of recommendations for future research focused on designing and evaluating health promotion tools using an activist lens.",
  "authors": [
    {
      "name": "Andrea Parker",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, United States",
      "img": "/do/10.1145/contrib-81100507646/rel-imgonly/parker_andrea_099.jpg",
      "acmid": "81100507646",
      "orcid": "missing"
    },
    {
      "name": "Vasudhara Kantroo",
      "institution": "Nokia R& D, Sunnyvale, California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321493781",
      "orcid": "missing"
    },
    {
      "name": "Hee Rin Lee",
      "institution": "School of Informatics & Computing, Indiana University, Bloomington, Bloomington, Indiana, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659636793",
      "orcid": "missing"
    },
    {
      "name": "Miguel Osornio",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502793414",
      "orcid": "missing"
    },
    {
      "name": "Mansi Sharma",
      "institution": "College of Computing, Georgia Institute of Technology, Atlanta, United States, Atlanta, Georgia, Georgia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502712697",
      "orcid": "missing"
    },
    {
      "name": "Rebecca Grinter",
      "institution": "College of Computing, Georgia Institute of Technology, Atlanta, Georgia, United States",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    }
  ],
  "references": [
    {
      "text": "HHS Action Plan to Reduce Racial and Ethnic Health Disparities. Department of Health and Human Services.",
      "doi": ""
    },
    {
      "text": "Bardzell, S., \"Feminist HCI: taking stock and outlining an agenda for design,\" CHI'2010 (2010), 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Chen, Y., Ngo, V., Harrison, S. and Duong, V., \"Unpacking exam-room computing: negotiating computer-use in patient-physician interactions,\" CHI'11 (2011), 3343--3352.  ",
      "doi": "10.1145/1978942.1979438"
    },
    {
      "text": "Consolvo, S., Everitt, K., Landay, J.A., \"Design Requirements for Technologies that Encourage Physical Activity,\" CHI'06, ACM (2006), 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "DiSalvo, C., Light, A., Hirsch, T., Le Dantec, C.A., Goodman, E. and Hill, K., \"HCI, communities and politics,\" CHI'10, ACM (2010), 3151--3154.  ",
      "doi": "10.1145/1753846.1753940"
    },
    {
      "text": "DiSalvo, C., Sengers, P. and Brynjarsdóttir, H., \"Mapping the landscape of sustainable HCI,\" CHI'10, ACM (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Dourish, P., \"HCI and environmental sustainability: the politics of design and the design of politics,\" DIS'2010, ACM (2010), 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Friedman, B. and Freier, N.G., \"Value Sensitive Design,\" in Fisher, K.E., Erdelez, S. and McKechnie, E.F. (eds.), Theories of information behavior: A researcher's guide, Information Today, Medford, NJ, 2005, 368--372.",
      "doi": ""
    },
    {
      "text": "Friedman, B., Kahn, P.H. and Borning, A., \"Value Sensitive Design and Information Systems,\" in The Handbook of Information and Computer Ethics, John Wiley & Sons, Inc., 2009, 69--101.",
      "doi": ""
    },
    {
      "text": "Frost, J. and Smith, B.K., \"Visualizing health: imagery in diabetes education,\" DUX'03, ACM (2003), 1--14.  ",
      "doi": "10.1145/997078.997094"
    },
    {
      "text": "Garrett, R.K., \"Protest in an Information Society: a review of literature on social movements and new ICTs,\" Information, Communication & Society 9, 2 (2006), 202--224.",
      "doi": ""
    },
    {
      "text": "Grimes, A., Bednar, M., Bolter, J.D. and Grinter, R.E., \"EatWell: Sharing nutrition-related memories in a lowincome community,\" CSCW'08, ACM (2008), 87--96.  ",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Grimes, A. and Grinter, R., \"Designing Persuasion: Health Technology for Low-Income African American Communities,\" Persuasive'07, Springer-Verlag (2007), 24--35. ",
      "doi": "10.5555/1780402.1780407"
    },
    {
      "text": "Hirsch, T., \"Communities real and imagined: designing a communication system for zimbabwean activists,\" C& T'09, ACM (2009), 71--76.  ",
      "doi": "10.1145/1556460.1556472"
    },
    {
      "text": "Kahn, R. and Kellner, D., \"New Media and Internet Activism: From the 'Battle of Seattle' to Blogging,\" New Media & Society 6, 1 (2004), 87--95.",
      "doi": ""
    },
    {
      "text": "Kimani, S., Berkovsky, S., Smith, G., Freyne, J., Baghaei, N. and Bhandari, D., \"Activity awareness in family-based healthy living online social networks,\" IUI'2010, ACM (2010), 337--340.  ",
      "doi": "10.1145/1719970.1720025"
    },
    {
      "text": "Kristal, A.R., Glanz, K., Curry, S.J. and Patterson, R.E., \"How Can Stages of Change be Best Used in Dietary Interventions?,\" Journal of the American Dietetic Association 99, 6 (1999), 679--684.",
      "doi": ""
    },
    {
      "text": "Kuznetsov, S., Odom, W., Moulder, V., DiSalvo, C., Hirsch, T., Wakkary, R. and Paulos, E., \"HCI, politics and the city: engaging with urban grassroots movements for reflection and action,\" CHI'11 Extended Abstracts, ACM (2011), 2409--2412.  ",
      "doi": "10.1145/1979742.1979568"
    },
    {
      "text": "Lester, J., Hartung, C., Pina, L., Libby, R., Borriello, G. and Duncan, G., \"Validated caloric expenditure estimation using a single body-worn sensor,\" Ubicomp'09, ACM (2009), 225--234.  ",
      "doi": "10.1145/1620545.1620579"
    },
    {
      "text": "Lievrouw, L.A., \"Oppositional and activist new media: remediation, reconfiguration, participation,\" PDC'06, ACM (2006), 115--124.  ",
      "doi": "10.1145/1147261.1147279"
    },
    {
      "text": "Maitland, J., \"Towards negotiation as a framework for health promoting technology,\" SIGHIT Rec. 1, 1 (2011), 10--19.  ",
      "doi": "10.1145/1971706.1971710"
    },
    {
      "text": "Maitland, J., Chalmers, M. and Siek, K., \"Persuasion not Required: Improving our Understanding of the Sociotechnical Context of Dietary Behavioural Change,\" Pervasive Health'09, IEEE (2009), 1--8.",
      "doi": ""
    },
    {
      "text": "Mamykina, L., Mynatt, E., Davidson, P. and Greenblatt, D., \"MAHI: investigation of social scaffolding for reflective thinking in diabetes management,\" CHI'08, ACM (2008), 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Morland, K., Wing, S., Diez Roux, A. and Poole, C., \"Neighborhood characteristics associated with the location of food stores and food service places,\" American Journal of Preventive Medicine 22, 1 (2002), 23--29.",
      "doi": ""
    },
    {
      "text": "Morozov, E., The Net Delusion: The Dark Side of Internet Freedom. PublicAffairs, New York, NY, 2011. ",
      "doi": "10.5555/1964879"
    },
    {
      "text": "Newman, M.W., Lauterbach, D., Munson, S.A., Resnick, P. and Morris, M.E., \"It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health,\" CSCW'11, ACM (2011), 341350.  ",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Paulos, E., Honicky, R. and Hooker, B., \"Citizen Science: Enabling Participatory Urbanism,\" in Foth, M. (ed.) Handbook of Research on Urban Informatics: The Practice and Promise of the Real-Time City, Information Science Reference, Hershey, PA, 2009.",
      "doi": ""
    },
    {
      "text": "Plescia, M., Groblewski, M. and Chavis, L., \"A Lay Health Advisor Program to Promote Community Capacity and Change Among Change Agents,\" Health Promotion Practice 9, 4 (2008), 434--439.",
      "doi": ""
    },
    {
      "text": "Purpura, S., Schwanda, V., Williams, K., Stubler, W. and Sengers, P., \"Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight,\" CHI'11, ACM (2011), 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Ramachandran, D., Canny, J., Das, P.D. and Cutrell, E., \"Mobile-izing health workers in rural India,\" CHI'2010, ACM (2010), 1889--1898.  ",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Sloane, D.C., Diamant, A.L., Lewis, L.B., Yancey, A.K., Flynn, G., Nascimento, L.M., Mc Carthy, W.J., Guinyard, J.J. and Cousineau, M.R., \"Improving the Nutritional Resource Environment for Healthy Living Through Community-based Participatory Research,\" Journal of General Internal Medicine 18, 7 (2003), 568--575.",
      "doi": ""
    },
    {
      "text": "Thomas, D.R., \"A general inductive approach for qualitative data analysis,\" American Journal of Evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Wallerstein, N.B. and Duran, B., \"Using CommunityBased Participatory Research to Address Health Disparities,\" Health Promotion Practice 7, 3 (2006), 312--323.",
      "doi": ""
    },
    {
      "text": "Williams, G.H., \"The determinants of health: structure, context and agency,\" Sociology of Health & Illness 25, 3 (2003), 131--154.",
      "doi": ""
    },
    {
      "text": "World Health Organization, Closing the gap in a generation: Health equity through action on the social determinants of health, 2008.",
      "doi": ""
    },
    {
      "text": "Zoller, H.M., \"Health Activism: Communication Theory and Action for Social Change,\" Communication Theory 15, 4 (2005), 341--364.",
      "doi": ""
    }
  ]
}