{
  "doi": "10.1145/2207676.2208704",
  "title": "An evaluation of how small user interface changes can improve scientists' analytic strategies",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2953-2962",
  "year": 2012,
  "badges": [],
  "abstract": "Subtle changes in analysis system interfaces can be used purposely to alter users' analytic behaviors. In a controlled study subjects completed three analyses at one-week intervals using an analysis support system. Control subjects used one interface in all sessions. Test subjects used modified versions in the last two sessions: a first set of changes aimed at increasing subjects' use of the system and their consideration of alternative hypotheses; a second set of changes aimed at increasing the amount of evidence collected. Results show that in the second session test subjects used the interface 39% more and switched between hypotheses 19% more than in the first session. They then collected 26% more evidence in the third than in the second session. These increases differ significantly (p<0.05) from near constant control rates. We hypothesize that this approach can be used in many real applications to guide analysts unobtrusively towards improved analytic strategies.",
  "tags": [
    "persuasive technology",
    "visual analytics",
    "analytic biases"
  ],
  "authors": [
    {
      "name": "Radu Jianu",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502685863",
      "orcid": "missing"
    },
    {
      "name": "David Laidlaw",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/do/10.1145/contrib-81100589961/rel-imgonly/statement_dec2015copy2.jpg",
      "acmid": "81100589961",
      "orcid": "0000-0002-3411-7376"
    }
  ],
  "references": [
    {
      "text": "Ames, M., and Naaman, M. Why we tag: motivations for annotation in mobile and online media. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems, ACM (2007), 980.  ",
      "doi": ""
    },
    {
      "text": "Arroyo, E., Bonanni, L., and Selker, T. Waterbot: exploring feedback and persuasive techniques at the sink. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems, ACM (2005), 639.  ",
      "doi": ""
    },
    {
      "text": "Asch, S. Studies of independence and conformity: a minority of one against a unanimous majority. Psychological monographs 70, 9 (1956), 1--70.",
      "doi": ""
    },
    {
      "text": "Ben-Shakhar, G., Bar-Hillel, M., Bilu, Y., and Shefler, G. Seek and ye shall find: Test results are what you hypothesize they are. Journal of Behavioral Decision Making 11, 4 (1998), 235--249.",
      "doi": ""
    },
    {
      "text": "Bier, E., Card, S., and Bodnar, J. Entity-based collaboration tools for intelligence analysis. In Visual Analytics Science and Technology, 2008. VAST'08. IEEE Symposium on, Ieee (2008), 99--106.",
      "doi": ""
    },
    {
      "text": "Bodnar, J. Making sense of massive data by hypothesis testing. In International Conference on Intelligence Analysis (2005), 2--4.",
      "doi": ""
    },
    {
      "text": "Bruner, J., and Potter, M. Interference in visual recognition. Science 144, 3617 (1964), 424--425.",
      "doi": ""
    },
    {
      "text": "Canas, A., Carff, R., Hill, G., Carvalho, M., Arguedas, M., Eskridge, T., Lott, J., and Carvajal, R. Concept maps: Integrating knowledge and information visualization. Lecture Notes in Computer Science 3426 (2005), 205. ",
      "doi": ""
    },
    {
      "text": "Chartrand, T., and Bargh, J. The chameleon effect: the perception-behavior link and social interaction. Journal of Personality and Social Psychology 76, 6 (1999), 893--910.",
      "doi": ""
    },
    {
      "text": "Cialdini, R., and Goldstein, N. Social influence: Compliance and conformity. Annual Psychology Review 55 (2004), 591--621.",
      "doi": ""
    },
    {
      "text": "Deutsch, M., and Gerard, H. A study of normative and informational social influences upon individual judgment. Journal of Abnormal and Social Psychology 51, 3 (1955), 629--636.",
      "doi": ""
    },
    {
      "text": "DuCharme, W. Response bias explanation of conservative human inference. Journal of Experimental Psychology 85, 1 (1970), 66--74.",
      "doi": ""
    },
    {
      "text": "Dunbar, K. Concept discovery in a scientific domain. Cognitive Science 17, 3 (1993), 397--434.",
      "doi": ""
    },
    {
      "text": "Dunbar, K. What scientific thinking reveals about the nature of cognition. Designing for science: Implications from Everyday, Classroom, and Professional Settings (2001), 115--140.",
      "doi": ""
    },
    {
      "text": "Eccles, R., Kapler, T., Harper, R., and Wright, W. Stories in geotime. Information Visualization 7, 1 (2008), 3--17.  ",
      "doi": ""
    },
    {
      "text": "Elstein, A., and Schwarz, A. Clinical problem solving and diagnostic decision making: selective review of the cognitive literature. Stroke 33 (2002), 493--6.",
      "doi": ""
    },
    {
      "text": "Fogg, B. Persuasive computers: perspectives and research directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press/Addison-Wesley Publishing Co. (1998), 225--232.  ",
      "doi": "10.1145/274644.274677"
    },
    {
      "text": "Gotz, D., Zhou, M., and Aggarwal, V. Interactive visual synthesis of analytic knowledge. In Proceedings of the IEEE Symposium on Visual Analytics Science and Technology (2006), 51--58.",
      "doi": ""
    },
    {
      "text": "Gray, W., and Fu, W. Soft constraints in interactive behavior: The case of ignoring perfect knowledge in-the-world for imperfect knowledge in-the-head. Cognitive Science 28, 3 (2004), 359--382.",
      "doi": ""
    },
    {
      "text": "Green, T., Ribarsky, W., and Fisher, B. Visual analytics for complex concepts using a human cognition model. In Visual Analytics Science and Technology, 2008. VAST'08. IEEE Symposium on, IEEE (2008), 91--98.",
      "doi": ""
    },
    {
      "text": "Green, T., Ribarsky, W., and Fisher, B. Building and applying a human cognition model for visual analytics. Information Visualization 8, 1 (2009), 1--13.  ",
      "doi": ""
    },
    {
      "text": "Hastie, R., and Dawes, R. Rational choice in an uncertain world. Journal of the Indian Academy of Applied Psychology (2003), 107.",
      "doi": ""
    },
    {
      "text": "Kang, Y., Gorg, C., and Stasko, J. Evaluating visual analytics systems for investigative analysis: Deriving design principles from a case study. In Visual Analytics Science and Technology, 2009. VAST 2009. IEEE Symposium on, IEEE (2009), 139--146.",
      "doi": ""
    },
    {
      "text": "Kenrick, D., Maner, J., Butner, J., Li, N., Becker, D., and Schaller, M. Dynamical evolutionary psychology: Mapping the domains of the new interactionist paradigm. Personality and Social Psychology Review 6, 4 (2002), 347.",
      "doi": ""
    },
    {
      "text": "Klayman, J., and Ha, Y. Confirmation, disconfirmation, and information in hypothesis testing. Psychological Review 94, 2 (1987), 211--228.",
      "doi": ""
    },
    {
      "text": "Klein, G. A recognition-primed decision (rpd) model of rapid decision making. Decision Making in Action: Models and Methods (1993), 138--147.",
      "doi": ""
    },
    {
      "text": "Kumar, M., and Kim, T. Dynamic speedometer: dashboard redesign to discourage drivers from speeding. In CHI'05 Extended Abstracts on Human Factors in Computing Systems, ACM (2005), 1576.  ",
      "doi": ""
    },
    {
      "text": "Nov, O. What motivates Wikipedians? Communications of the ACM 50, 11 (2007), 64.  ",
      "doi": ""
    },
    {
      "text": "Oinas-Kukkonen, H., and Harjumaa, M. Towards deeper understanding of persuasion in software and information systems. In First International Conference on Advances in Computer-Human Interaction, IEEE (2008), 200--205.  ",
      "doi": ""
    },
    {
      "text": "Pirolli, P., and Card, S. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of International Conference on Intelligence Analysis, vol. 2005 (2005), 2--4.",
      "doi": ""
    },
    {
      "text": "Rodgers, R., and Hunter, J. The discard of study evidence by literature reviewers. The Journal of Applied Behavioral Science 30, 3 (1994), 329.",
      "doi": ""
    },
    {
      "text": "Savikhin, A., Maciejewski, R., and Ebert, D. Applied visual analytics for economic decision-making. In IEEE Symposium on Visual Analytics Science and Technology, 2008. VAST'08 (2008), 107--114.",
      "doi": ""
    },
    {
      "text": "Simon, H. Rationality as process and as product of thought. The American Economic Review 68, 2 (1978), 1--16.",
      "doi": ""
    },
    {
      "text": "Stangor, C., Sechrist, G., and Jost, J. Social influence and intergroup beliefs: The role of perceived social consensus. Social Influence: Direct and Indirect Processes (2001), 235--252.",
      "doi": ""
    },
    {
      "text": "Stasko, J., Gorg, C., and Liu, Z. Jigsaw: supporting investigative analysis through interactive visualization. Information Visualization 7, 2 (2008), 118--132.  ",
      "doi": ""
    },
    {
      "text": "Sunstein, C., and Thaler, R. Libertarian paternalism is not an oxymoron. U. Chi. L. Rev. 70 (2003), 1159.",
      "doi": ""
    },
    {
      "text": "Thaler, R., and Benartzi, S. Save More Tomorrow: using behavioral economics to increase employee saving. Journal of political Economy (2004), 164--187.",
      "doi": ""
    },
    {
      "text": "Thaler, R., and Sunstein, C. Nudge: Improving decisions about health, wealth, and happiness. Yale Univ Pr, 2008.",
      "doi": ""
    },
    {
      "text": "Thomas, J., and Cook, K. Illuminating the path: The research and development agenda for visual analytics. IEEE Computer Society (2005).",
      "doi": ""
    },
    {
      "text": "Wason, P. Reasoning about a rule. The Quarterly Journal of Experimental Psychology 20, 3 (1968), 273--281.",
      "doi": ""
    },
    {
      "text": "Wright, W., Schroh, D., Proulx, P., Skaburskis, A., and Cort, B. The Sandbox for analysis: concepts and methods. In Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM New York, NY, USA (2006), 801--810.  ",
      "doi": ""
    },
    {
      "text": "Yang, D., Rundensteiner, E., and Ward, M. Nugget discovery in visual exploration environments by query consolidation. In Proceedings of the sixteenth ACM conference on Conference on information and knowledge management, ACM New York, NY, USA (2007), 603--612.  ",
      "doi": ""
    },
    {
      "text": "Experimental data. http://graphics.cs.brown.edu/research/sciviz/nudges/.",
      "doi": ""
    }
  ]
}