{
  "doi": "10.1145/2207676.2207766",
  "title": "Swift: reducing the effects of latency in online video scrubbing",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "637-646",
  "year": 2012,
  "badges": [],
  "abstract": "We first conduct a study using abstracted video content to measure the effects of latency on video scrubbing performance and find that even very small amounts of latency can significantly degrade navigation performance. Based on these results, we present Swift, a technique that supports real-time scrubbing of online videos by overlaying a small, low resolution copy of the video during video scrubbing, and snapping back to the high resolution video when the scrubbing is completed or paused. A second study compares the Swift technique to traditional online video players on a collection of realistic live motion videos and content-specific search tasks which finds the Swift technique reducing completion times by as much as 72% even with a relatively low latency of 500ms. Lastly, we demonstrate that the Swift technique can be easily implemented using modern HTML5 web standards.",
  "tags": [
    "video",
    "online streaming",
    "video navigation"
  ],
  "authors": [
    {
      "name": "Justin Matejka",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153192",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    }
  ],
  "references": [
    {
      "text": "Bachmann, T. (1991). Identification of spatially queatized tachistoscopic images of faces: How many pixels does it take to carry identity? European J. of Cog. Psychology. 3:85--103.",
      "doi": ""
    },
    {
      "text": "Bailer, W., Schober, C., and Thallinger, G. (2006). Video Content Browsing Based on Iterative Feature Clustering for Rushes Exploration. TRECVID Workshop. 230--239.",
      "doi": ""
    },
    {
      "text": "Chang, L., Yang, Y., and Hua, X. S. (2008). Smart Video Player. IEEE Multimedia and Expo. 1605--1606.",
      "doi": ""
    },
    {
      "text": "Chen, L., Chen, G. C., Xu, C. Z., March, J., and Benford, S. (2008). EmoPlayer: A Media Player for Video Clips with Affective Annotations. Int. with Comp. 20:17--28.  ",
      "doi": "10.5555/1327552.1327934"
    },
    {
      "text": "Divakaran, A. and Forlines, C. and Lanning, T. and Shipman, S. and Wittenburg, K. (2005). Augmenting Fast-Forward and Rewind for Personal Digital Video Recorders. ICCE. 43--44.",
      "doi": ""
    },
    {
      "text": "Doulamis, A. D. and Doulamis, N. D. (2004). Optimal Contentbased Video Decomposition for Interactive Video Navigation. IEEE CSVT. 757--775.  ",
      "doi": "10.1109/TCSVT.2004.828348"
    },
    {
      "text": "Dragicevic, P., Ramos, G., Bibliowitcz, J., Nowrouzezahrai, D., Balakrishnan, R., and Singh, K. (2008). Video browsing by direct manipulation. CHI. 237--246.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. (2010). Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. UIST. 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Hanson, G. and Haridakis, P. (2008). YouTube Users Watching and Sharing the News: A Uses and Gratifications Approach. Journal of Electronic Publishing. 11:3.",
      "doi": ""
    },
    {
      "text": "Hefeeda, M. and Hsu, C. H. (2008). Rate-Distortion Optimized Streaming of Fine-Grained Scalable Video Sequences. ACM TOMCCAP. 1--28.  ",
      "doi": "10.1145/1324287.1324289"
    },
    {
      "text": "Holthe, O. and Ronningen, L. A. (2006). Video Browsing Techniques for Web Interfaces. IEEE CCNC. 1224--1228.",
      "doi": ""
    },
    {
      "text": "Hürst, W. (2006). Interactive Audio-Visual Video Browsing. ACM MM. 675--678.  ",
      "doi": "10.1145/1180639.1180781"
    },
    {
      "text": "Karrer, T., Weiss, M., Lee, E., and Borchers, J. (2008). DRAGON : A Direct Manipulation Interface for Frame-Accurate In-Scene Video Navigation. CHI. 247--250.  ",
      "doi": "10.1145/1357054.1357097"
    },
    {
      "text": "Janin, A., Gottlieb, L., and Friedland, G. (2010). Joke-o-Mat HD: Browsing Sitcoms with Human Derived Transcripts. ACM MM. 1591--1594.  ",
      "doi": "10.1145/1873951.1874295"
    },
    {
      "text": "Krasic, C. and Légaré, J. S. (2008). Interactivity and Scalability Enhancements for Quality-Adaptive Streaming. MM. 753--756.  ",
      "doi": "10.1145/1459359.1459478"
    },
    {
      "text": "MacKenzie, I. S. and Ware, C. (1993). Lag as a Determinant of Human Performance in Interactive Systems. CHI. 488--493. ",
      "doi": "10.5555/164632.164979"
    },
    {
      "text": "Pavlovych, A. and Stuerzlinger, W. (2009). The Tradeoff between Spatial Jitter and Latency in Pointing Tasks. ACM Symposium on Eng. Interactive Comp. Syst. 33--44.  ",
      "doi": "10.1145/1570433.1570469"
    },
    {
      "text": "Pavlovych, A. and Stuerzlinger, W. (2011). Target Following Performance in the Presence of Latency, Jitter, and Signal Dropouts. GI. 33--44. ",
      "doi": "10.5555/1992917.1992924"
    },
    {
      "text": "Pongnumkul, S., Wang, J., Ramos, G., and Cohen, M. (2010). Content-Aware dynamic timeline for video browsing. ACM UIST. 139--142.  ",
      "doi": "10.1145/1866029.1866053"
    },
    {
      "text": "Ramos, G. and Balakrishnan, R. (2003). Fluid Interaction Techniques for the Control and Annotation of Digital Video. ACM UIST. 105--114.  ",
      "doi": "10.1145/964696.964708"
    },
    {
      "text": "Schoeffmann, K., Hopfgartner, F., Marques, O., Boeszoermenyi, L., and Jose, J. M. (2010). Video browsing interfaces and applications: a review. SPIE Reviews. 18004:1--35.",
      "doi": ""
    },
    {
      "text": "Schoeffmann, K., Taschwer, M., and Boeszoermenyi, L. (2010). The Video Explorer - A Tool for Navigation and Searching within a Single Video based on Fast Content Analysis. ACM SIGMM. 247--258.  ",
      "doi": "10.1145/1730836.1730867"
    },
    {
      "text": "Torralba, A., Fergus, R., and Freeman, W. T. (2008). 80 million tiny images: A large data set for non-parametric object and scene recognition. IEEE Pattern Analysis and Machine Intelligence. 1958--1970.  ",
      "doi": "10.1109/TPAMI.2008.128"
    },
    {
      "text": "Truong, B. T. and Venkatesh, S. (2007). Video Abstraction: A Systematic Review and Classification. ACM TOMCCAP. Appl. 3, 1, Article 3.  ",
      "doi": "10.1145/1198302.1198305"
    },
    {
      "text": "Uchihashi, S., Foote, J., Girgensohn, A., and Boreczky, J. (1999). Video Manga: Generating Semantically Meaningful Video Summaries. ACM CHI. 383--392.",
      "doi": ""
    }
  ]
}