{
  "doi": "10.1145/2207676.2208526",
  "title": "Understanding heart rate sharing: towards unpacking physiosocial space",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "859-868",
  "year": 2012,
  "badges": [],
  "abstract": "Advances in biosensing make it possible to include heart rate monitoring in applications and several studies have suggested that heart rate communication has potential for improving social connectedness. However, it is not known how people understand heart rate feedback, or what issues need to be taken into account when designing technologies including heart rate feedback. To explore this, we created a heart rate communication probe that was used in two qualitative in-lab studies and a two-week field trial in participants' homes. Results show that heart rate feedback is a strong connectedness cue that affects the interaction in various ways, depending on a number of interrelated factors. In particular, we found two distinct categories of effects: heart rate as information and heart rate as connection. We propose two mechanisms that could explain these observations and draw out the implications they have for future use of heartbeat communication to support social connectedness or other aspects of social interaction.",
  "authors": [
    {
      "name": "Petr Slovák",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611500",
      "orcid": "missing"
    },
    {
      "name": "Joris Janssen",
      "institution": "Philips Research & Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501656025",
      "orcid": "missing"
    },
    {
      "name": "Geraldine Fitzpatrick",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "M. G. Ames, J. Go, J. J. Kaye, and M. Spasojevic. Making love in the network closet: the benefits and work of family videochat. In CSCW '10, page 145. ACM Press, 2010.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "P. A. Andersen, L. K. Guerrero, D. B. Buller, and P. F. Jorgensen. An empirical comparison of three theories of nonverbal immediacy exchange. Human Communication Research, 24:501--535, 1998.",
      "doi": ""
    },
    {
      "text": "M. Argyle. The psychology of happiness. Methuen, London, 1987.",
      "doi": ""
    },
    {
      "text": "M. Argyle and J. Dean. Eye-contact, distance, and affiliation. Sociometry, 28:289--304, 1965.",
      "doi": ""
    },
    {
      "text": "M. Balaam, G. Fitzpatrick, J. Good, and E. Harris. Enhancing interactional synchrony with an ambient display. In CHI '11, pages 867--876. ACM Press, 2011.  ",
      "doi": "10.1145/1978942.1979070"
    },
    {
      "text": "E. Bradner and G. Mark. Why distance matters: effects on cooperation, persuasion and deception. In CSCW '02, page 226. ACM Press, 2002.  ",
      "doi": "10.1145/587078.587110"
    },
    {
      "text": "B. Brown, A. S. Taylor, S. Izadi, A. Sellen, J. J. Kaye, and R. Eardley. Locating family values: a field trial of the whereabouts clock. In Ubicomp '07, pages 354--371. Springer-Verlag, 2007. ",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "J. T. Cacioppo, M. E. Hughes, L. J. Waite, L. C. Hawkley, and R. A. Thisted. Loneliness as a specific risk factor for depressive symptoms: Cross-sectional and longtitudinal analyses. Psychology and Aging, 21:140--151, 2006.",
      "doi": ""
    },
    {
      "text": "S. Consolvo, D. W. McDonald, and J. A. Landay. Theory-driven design strategies for technologies that support behavior change in everyday life. In CHI '09, pages 405--414, New York, USA, 2009. ACM.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "A. K. Dey and E. de Guzman. From awareness to connectedness: the design and deployment of presence displays. In CHI '06, page 899. ACM Press, 2006.  ",
      "doi": "10.1145/1124772.1124905"
    },
    {
      "text": "S. H. Fairclough. Fundamentals of physiological computing. Interacting with Computers, 21(1-2):133--145, 2009.  ",
      "doi": "10.1016/j.intcom.2008.10.011"
    },
    {
      "text": "K. Garnaes, O. Grünberger, J. Kjeldskov, and M. B. Skov. Designing technologies for presence-in-absence. Personal Ubiquitous Computing, 11:403--408, 2007.  ",
      "doi": "10.1007/s00779-006-0072-9"
    },
    {
      "text": "E. Goffman. The presentation of self in everyday life. Anchor Books, New York, 1959.",
      "doi": ""
    },
    {
      "text": "H. Hutchinson, H. Hansen, N. Roussel, B. Eiderbäck, W. Mackay, B. Westerlund, B. B. Bederson, A. Druin, C. Plaisant, M. Beaudouin-Lafon, S. Conversy, and H. Evans. Technology probes: inspiring design for and with families. In CHI '03, pages 17--24. ACM Press.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "J. H. Janssen, J. N. Bailenson, W. A. IJsselsteijn, and J. H. D. M. Westerink. Intimate heartbeats: Opportunities for affective communication technology. IEEE Transactions on Affective Computing, 1:72--80, 2010.  ",
      "doi": "10.1109/T-AFFC.2010.13"
    },
    {
      "text": "P. Klasnja, S. Consolvo, and W. Pratt. How to evaluate technologies for health behavior change in HCI research. In CHI '11, pages 3063--3072. ACM, 2011.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "S. D. Kreibig. Autonomic nervous system activity in emotion: A review. Biological Psychology, 84:394--421, 2010.",
      "doi": ""
    },
    {
      "text": "J. P. Laurenceau, L. M. Rivera, A. R. Schaffer, and P. R. Pietromonaco. Intimacy as an interpersonal process: Current status and future directions. In D. Mashek and A. Aron, editors, Handbook of closeness and intimacy, pages 61--78. Lawrence Erlbaum, Mahwah, NJ, 2004.",
      "doi": ""
    },
    {
      "text": "R. W. Levenson and A. M. Ruef. Empathy: A physiological substrate. Journal of Personality and Social Psychology, 63(2):234--246, 1992.",
      "doi": ""
    },
    {
      "text": "G. Lotan and C. Croft. imPulse. In CHI '07 Extended Abstracts CHI '07, pages 1983--1988. ACM Press.  ",
      "doi": "10.1145/1240866.1240936"
    },
    {
      "text": "D. Lottridge, N. Masson, and W. Mackay. Sharing empty moments: design for remote couples. In CHI '09, page 2329. ACM Press, 2009.  ",
      "doi": "10.1145/1518701.1519058"
    },
    {
      "text": "J. J. Lynch. The broken heart: The medical consequences of loneliness. Basic Books, New York, 1979.",
      "doi": ""
    },
    {
      "text": "R. Mandryk, K. Inkpen, and T. Calvert. Using psychophysiological techniques to measure user experience with entertainment technologies. Behaviour & Information Technology, 25(2):141--158, 2006.",
      "doi": ""
    },
    {
      "text": "P. Markopoulos, B. De Ruyter, and W. Mackay. Awareness systems: Advances in theory, methodology, and design. Human-Computer Interaction Series. Springer, 2009. ",
      "doi": "10.5555/1608964"
    },
    {
      "text": "H. Murakami and H. Ohira. Influence of attention manipulation on emotion and autonomic responses. Perceptual and Motor Skills, 105(1):299--308, 2007.",
      "doi": ""
    },
    {
      "text": "B. Parkinson. Emotional effects of false autonomic feedback. Psychological Bulletin, 98:471--494, 1985.",
      "doi": ""
    },
    {
      "text": "P. Sanches, K. Höök, E. Vaara, C. Weymann, M. Bylund, P. Ferreira, N. Peira, and M. Sjölinder. Mind the body!: designing a mobile stress management application encouraging personal reflection. In DIS '10, pages 47--56. ACM Press, 2010.  ",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "T. Scherini, P. Melo, T. van Craenendonck, W. Zou, and M. Kaptein. Enhancing the sleeping quality of partners living apart. In DIS '10, page 171. ACM Press, 2010.  ",
      "doi": "10.1145/1858171.1858201"
    },
    {
      "text": "A. Steptoe, N. Owen, S. R. Kunz-Ebrecht, and L. Brydon. Loneliness and neuroendocrine, cardiovascular, and inflammatory stress response in middle-aged men and women. Psychoneuroendocrinology, 29:593--611, 2004.",
      "doi": ""
    },
    {
      "text": "R. Strong and W. Gaver. Feather, Scent & Shaker: Supporting Simple Intimacy in Videos. In Extended Proceedings of CSCW'96, pages 29--30, 1996.",
      "doi": ""
    },
    {
      "text": "H. Tsujita, K. Tsukada, and S. Itiro. InPhase: evaluation of a communication system focused on \"happy coincidences\" of daily behaviors. In CHI '10, page 2481. ACM Press, 2010.  ",
      "doi": "10.1145/1753326.1753701"
    },
    {
      "text": "G. E. Vaillant. Aging Well: Surprising Guideposts to a Happier Life from the Landmark Harvard Study of Adult Development. Little, Brown and Company, New York, 2003.",
      "doi": ""
    },
    {
      "text": "S. Valins. Cognitive effects of false heart-rate feedback. Journal of Personality and Social Psychology, 4:400--408, 1966.",
      "doi": ""
    },
    {
      "text": "F. Vetere, M. R. Gibbs, J. Kjeldskov, S. Howard, F. F. Mueller, S. Pedell, K. Mecoles, and M. Bunyan. Mediating intimacy: designing technologies to support strong-tie relationships. In CHI '05, pages 471--480. ACM Press, 2005.  ",
      "doi": "10.1145/1054972.1055038"
    },
    {
      "text": "J. Werner, R. Wettach, and E. Hornecker. United-pulse: feeling your partner's pulse. In MobileHCI '08, pages 535--538. ACM Press, 2008.  ",
      "doi": "10.1145/1409240.1409338"
    },
    {
      "text": "J. Wild, D. M. Clark, A. Ehlers, and F. McManus. Perception of arousal in social anxiety: effects of false feedback during a social interaction. Journal of behavior therapy and experimental psychiatry, 39(2):102--16, 2008.",
      "doi": ""
    }
  ]
}