{
  "doi": "10.1145/2207676.2208650",
  "title": "Developing IDEAS: supporting children with autism within a participatory design team",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2599-2608",
  "year": 2012,
  "badges": [],
  "abstract": "IDEAS (Interface Design Experience for the Autistic Spectrum) is a method for involving children with Autism Spectrum Disorders (ASD) in the technology design process. This paper extends the IDEAS method to enable use with a design team, providing specific added support for communication and collaboration difficulties that may arise. A study to trial this extended method was conducted with two design teams, each involving three children with ASD, in a series of six, weekly design sessions focused on designing a math game. The findings from this study reveal that the children were able to successfully participate in the sessions and collaborate with other children. The findings also highlight the positive experience that involvement in such a process can offer this population.",
  "tags": [
    "autism",
    "educational games",
    "children",
    "participatory design"
  ],
  "authors": [
    {
      "name": "Laura Benton",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/do/10.1145/contrib-81484651103/rel-imgonly/profilepic_small.jpg",
      "acmid": "81484651103",
      "orcid": "missing"
    },
    {
      "name": "Hilary Johnson",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100449016",
      "orcid": "missing"
    },
    {
      "name": "Emma Ashwin",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656882",
      "orcid": "missing"
    },
    {
      "name": "Mark Brosnan",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533253",
      "orcid": "missing"
    },
    {
      "name": "Beate Grawemeyer",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384608380",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "APA. DSM-IV Diagnostic and Statistical Manual of Mental Disorders (4th edition). American Psychiatric Association, Washington DC, 1994.",
      "doi": ""
    },
    {
      "text": "Ashwin, E., Brosnan, M., Johnson, H., Grawemeyer, B. and Benton, L. Social functioning, systemizing ability and emotion recognition in autism spectrum conditions. Autism Neuroscience Conference 2010, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Barry, M. and Pitt, I. Interaction design: a multidimensional approach for learners with autism. Proc. IDC 2006, ACM Press, 33--36.  ",
      "doi": "10.1145/1139073.1139086"
    },
    {
      "text": "Benton, L., Johnson, H., Brosnan, M., Ashwin, E. and Grawemeyer, B. IDEAS: an interface design experience for the autistic spectrum. Ext. Abstracts CHI 2011, ACM Press, 1759--1764.  ",
      "doi": "10.1145/1979742.1979841"
    },
    {
      "text": "Druin, A. Cooperative inquiry: developing new technologies for children with children. Proc. CHI 1999, ACM Press, 595--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Druin, A. The role of children in the design of new technology. Behaviour and IT 21, 1 (2002), 1--25.",
      "doi": ""
    },
    {
      "text": "Frauenberger, C., Good, J. and Keay-Bright, W. Designing technology for children with special needs -- bridging perspectives through participatory design. CoDesign 7, 1 (2011), 1--28.",
      "doi": ""
    },
    {
      "text": "Goldsmith, T.R. and LeBlanc, L.A. Use of technology in interventions for children with autism. Journal of Early and Intensive Behavior Int. 1, 2 (2004), 166--178.",
      "doi": ""
    },
    {
      "text": "Guha, M.L., Druin, A. and Fails, J. Design with and for children with special needs: An inclusionary model. Proc. IDC 2008, ACM Press, 61--64.  ",
      "doi": "10.1145/1463689.1463719"
    },
    {
      "text": "Guha, M.L., Druin, A. and Fails, J. Investigating the impact of design processes on children. Proc. IDC 2010, ACM Press, 198--201.  ",
      "doi": "10.1145/1810543.1810570"
    },
    {
      "text": "Kam, M., Ramachandran, D., Raghavan, A., Chiu, J., Sahni, U. and Canny, J. Practical considerations for PD with rural school children in underdeveloped regions: early reflections from the field. Proc. IDC 2006, ACM Press, 25--32.  ",
      "doi": "10.1145/1139073.1139085"
    },
    {
      "text": "Keay-Bright, W. The reactive colours project: demonstrating participatory and collaborative design methods for the creation of software for autistic children. Design Principles and Practices: An International Journal 1, 2 (2007), 133--151.",
      "doi": ""
    },
    {
      "text": "Kientz, J.A., Hayes, G.R., Westeyn, T.L., Starner, T. and G.D. Pervasive computing and autism: assisting caregivers of children with special needs. IEEE Pervasive Comp. Magazine 6, 1 (2007), 28--35.  ",
      "doi": "10.1109/MPRV.2007.18"
    },
    {
      "text": "James, I. Autism and Mathematical Talent. The Mathematical Intelligencer 32, 1 (2010), 56--58.",
      "doi": ""
    },
    {
      "text": "Large, A., Nesset, V., Tabatabaei, N. and Beheshti, J. Bonded design re-visited: involving children in information visualization design. Canadian Journal of Inform. and Library Science 32, 3/4, (2008), 107--139.",
      "doi": ""
    },
    {
      "text": "Madsen, M., el Kaliouby, R., Eckhardt, M., Hoque, M.E., Goodwin, M.S. and Picard, R. Lessons from participatory design with adolescents on the autism spectrum. Proc. CHI 2009, ACM Press, 3835--3840.  ",
      "doi": "10.1145/1520340.1520580"
    },
    {
      "text": "Mazzone, E., Read, J. and Beale, R. Design for and with disaffected teenagers. Proc. NordiCHI 2008, 290--297.  ",
      "doi": "10.1145/1463160.1463192"
    },
    {
      "text": "Mesibov, G.B., Shea, V. and Schopler, E. The TEACCH approach to autism spectrum disorders. Springer, New York, 2004.",
      "doi": ""
    },
    {
      "text": "Millen, L., Cobb, S. and Patel, H. A method for involving children with autism in design. Proc. IDC 2011, ACM Press, 185--188.  ",
      "doi": "10.1145/1999030.1999057"
    },
    {
      "text": "National Autistic Society. Computers: applications for people with autism. http://www.autism.org.uk.",
      "doi": ""
    },
    {
      "text": "Owens, G., Granader, Y., Humprey A. and BaronCohen, S. LEGO©Therapy and the social use of language programme: an evaluation of two social-skills interventions for children with high functioning autism and asperger syndrome. J Autism Dev Disord 38, (2008) 1944--1957.",
      "doi": ""
    },
    {
      "text": "Piper, A.M., O'Brien, E., Morris, M.R. and Winograd, T. SIDES: a cooperative tabletop computer game for social skills development. Proc. CSCW 2006, ACM Press, 1--10.  ",
      "doi": "10.1145/1180875.1180877"
    },
    {
      "text": "Read, J.C. and MacFarlane, S. Using the fun toolkit and other survey methods to gather opinions in child computer interaction. Proc. IDC 06, ACM Press, 81--88.  ",
      "doi": "10.1145/1139073.1139096"
    },
    {
      "text": "van Rijn, H. and Stappers, P.J. Expressions of ownership: motivating users in a co-design process. Proc. PDC 2008, 36--39. ",
      "doi": "10.5555/1795234.1795266"
    },
    {
      "text": "Wing, L. and Gould, J. Severe impairments of social interaction and associated abnormalities in children: epidemiology and classification. J Autism Dev Disord 9, (1979) 11--29.",
      "doi": ""
    }
  ]
}