{
  "doi": "10.1145/2207676.2208403",
  "title": "KidCAD: digitally remixing toys through tangible tools",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2401-2410",
  "year": 2012,
  "badges": [],
  "abstract": "Children have great facility in the physical world, and can skillfully model in clay and draw expressive illustrations. Traditional digital modeling tools have focused on mouse, keyboard and stylus input. These tools may be complicated and difficult for young users to easily and quickly create exciting designs. We seek to bring physical interaction to digital modeling, to allow users to use existing physical objects as tangible building blocks for new designs. We introduce KidCAD a digital clay interface for children to remix toys. KidCAD allows children to imprint 2.5D shapes from physical objects into their digital models by deforming a malleable gel input device, deForm. Users can mashup existing objects, edit and sculpt or draw new designs on a 2.5D canvas using physical objects, hands and tools as well as 2D touch gestures. We report on a preliminary user study with 13 children, ages 7 to 10, which provides feedback for our design and helps guide future work in tangible modeling for children.",
  "tags": [
    "digital clay",
    "children's design tools",
    "tangible sculpting tools"
  ],
  "authors": [
    {
      "name": "Sean Follmer",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377593653",
      "orcid": "0000-0001-5592-5949"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, United States",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Aish, R. 3d input for caad systems. Computer-Aided Design 11, 2 (1979), 66--70.",
      "doi": ""
    },
    {
      "text": "Blauvelt, G. R. Machineshop: a design environment for supporting children's construction of mechanical reasoning and spatial cognition. PhD thesis, Boulder, CO, USA, 2006. AAI3212102. ",
      "doi": "10.5555/1195604"
    },
    {
      "text": "Carroll, E. A., Latulipe, C., Fung, R., and Terry, M. Creativity factor evaluation: towards a standardized survey metric for creativity support. In C&C '09, ACM (New York, NY, USA, 2009), 127--136.  ",
      "doi": "10.1145/1640233.1640255"
    },
    {
      "text": "Chaudhuri, S., and Koltun, V. Data-driven suggestions for creativity support in 3d modeling. ACM Trans. Graph. 29 (December 2010), 183:1--183:10.  ",
      "doi": "10.1145/1882261.1866205"
    },
    {
      "text": "Csikszentmihalyi, M., and Halton, E. The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press, 1981.",
      "doi": ""
    },
    {
      "text": "Eisenberg, M. Educational fabrication, in and out of the classroom. In Proceedings of Society for Information Technology And Teacher Education International Conference 2011, AACE (March 2011).",
      "doi": ""
    },
    {
      "text": "Fishkin, K. P. A taxonomy for and analysis of tangible interfaces. Personal Ubiquitous Comput. 8 (2004).  ",
      "doi": "10.5555/1023813.1023819"
    },
    {
      "text": "Follmer, S., Johnson, K., Addelson, E., and Ishii, H. deform: An interactive malleable surface for capturing 2.5d arbitrary objects, tools and touch. In UIST 2011, UIST '11, ACM (New York, NY, USA, 2011).  ",
      "doi": "10.1145/2047196.2047265"
    },
    {
      "text": "Funkhouser, T., Kazhdan, M., Shilane, P., Min, P., Kiefer, W., Tal, A., Rusinkiewicz, S., and Dobkin, D. Modeling by example. ACM Trans. Graph. 23 (2004).  ",
      "doi": "10.1145/1015706.1015775"
    },
    {
      "text": "Gardner, H. E. Art, Mind, And Brain: A Cognitive Approach To Creativity. Basic Books, 1984.",
      "doi": ""
    },
    {
      "text": "Gershenfeld, N. FAB: The Coming Revolution on Your Desktop--From Personal Computers to Personal Fabrication. Basic Books, 2005. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Getzels, J. W., and Csikszentmihalyi, M. The Creative Vision: Longitudinal Study of Problem Finding in Art. John Wiley & Sons Inc, 1976.",
      "doi": ""
    },
    {
      "text": "Grossman, T., Balakrishnan, R., and Singh, K. An interface for creating and manipulating curves using a high degree-of-freedom curve input device. In CHI 2003 (2003).  ",
      "doi": "10.1145/642611.642645"
    },
    {
      "text": "Hendrix, S. L., and Eisenberg, M. A. Computer-assisted pop-up design for children: computationally enriched paper engineering. Adv. Technol. Learn. 3 (April 2006). ",
      "doi": "10.5555/1165537.1165545"
    },
    {
      "text": "Kirsh, D., and Maglio, P. On distinguishing epistemic from pragmatic action. Cognitive Science 18, 4 (1994).",
      "doi": ""
    },
    {
      "text": "LeClerc, V., Parkes, A., and Ishii, H. Senspectra: a computationally augmented physical modeling toolkit for sensing and visualization of structural strain. In CHI '07, ACM (New York, NY, USA, 2007), 801--804.  ",
      "doi": "10.1145/1240624.1240744"
    },
    {
      "text": "Leduc-Mills, B., and Eisenberg, M. The ucube: a child-friendly device for introductory three-dimensional design. In IDC '11, ACM (New York, NY, USA, 2011).  ",
      "doi": "10.1145/1999030.1999039"
    },
    {
      "text": "Lessig, L. Remix: Making Art and Commerce Thrive in the Hybrid Economy. Penguin (Non-Classics), 2009.",
      "doi": ""
    },
    {
      "text": "Mori, Y., and Igarashi, T. Plushie: an interactive design system for plush toys. ACM Trans. Graph. 26 (2007).  ",
      "doi": "10.1145/1276377.1276433"
    },
    {
      "text": "Piaget, J. Play, Dreams and Imitation in Childhood (International Library of Psychology). Routledge, 1938.",
      "doi": ""
    },
    {
      "text": "Piper, B., Ratti, C., and Ishii, H. Illuminating clay. In CHI '02, ACM Press (New York, USA, Apr. 2002).",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Ryokai, K., Marti, S., and Ishii, H. I/o brush: drawing with everyday objects as ink. In CHI '04, ACM (New York, NY, USA, 2004), 303--310.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Sheng, J., Balakrishnan, R., and Singh, K. An interface for virtual 3D sculpting via physical proxy. Computer graphics and interactive techniques in Australasia and South East Asia (2006), 213.  ",
      "doi": "10.1145/1174429.1174467"
    },
    {
      "text": "Shneiderman, B., Fischer, G., Czerwinski, M., Myers, B., and Resnick, M. Creativity Support Tools: A workshop sponsored by the NSF, 2005.",
      "doi": ""
    },
    {
      "text": "Singer, D., Golinkoff, R. M., and Hirsh-Pasek, K. Play = Learning: How Play Motivates and Enhances Children's Cognitive and Social-Emotional Growth. Oxford University Press, USA, 2009.",
      "doi": ""
    },
    {
      "text": "Smith, R. T., Thomas, B. H., and Piekarski, W. Digital foam interaction techniques for 3D modeling. Virtual Reality Software and Technology (2008), 61--68.  ",
      "doi": "10.1145/1450579.1450592"
    },
    {
      "text": "Weller, M. P., Do, E. Y.-L., and Gross, M. D. Posey: Iinstrumenting a poseable hub and strut construction toy. Tangible and embedded interaction (2008).  ",
      "doi": "10.1145/1347390.1347402"
    },
    {
      "text": "Zhang, S. Recent progresses on real-time 3D shape measurement using digital fringe projection techniques. Optics and Lasers in Engineering 48, 2 (Feb. 2010).",
      "doi": ""
    }
  ]
}