{
  "doi": "10.1145/2207676.2208665",
  "title": "Evaluating interactive support for secure programming",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2707-2716",
  "year": 2012,
  "badges": [],
  "abstract": "Implementing secure code is an important and oft-overlooked non-functional requirement. Secure programming errors are a subset of program errors that result in many common privacy and security breaches in commercial software. We are seeking to provide interactive support for secure programming in the development environment. In this paper, we have evaluated our prototype tool, ASIDE, which provides real-time warnings and code generation to reduce secure programming errors introduced by programmers. We evaluate the potential use and effectiveness of ASIDE on both novice and professional developers in two comparison user studies. Our results demonstrate that the interactive support can help address this important non-functional requirement, and suggest guidelines for such tools to support programmers.",
  "tags": [
    "software developers",
    "secure programming",
    "software security"
  ],
  "authors": [
    {
      "name": "Jing Xie",
      "institution": "University of North Carolina at Charlotte, Charlotte, North Carolina, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481648938",
      "orcid": "missing"
    },
    {
      "name": "Heather Lipford",
      "institution": "University of North Carolina at Charlotte, Charlotte, North Carolina, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385595946",
      "orcid": "0000-0002-5261-0148"
    },
    {
      "name": "Bei-Tseng Chu",
      "institution": "University of North Carolina at Charlotte, Charlotte, North Carolina, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100141333",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bateson, A., Alexander, R. A., and Murphy, M. D. Cognitive processing differences between novice and expert computer programmers. Int. J. Man-Mach. Stud. 26 (June 1987), 649--660.  ",
      "doi": "10.1016/S0020-7373%2887%2980058-5"
    },
    {
      "text": "Bragdon, A., Reiss, S. P., Zeleznik, R., Karumuri, S., Cheung, W., Kaplan, J., Coleman, C., Adeputra, F., and LaViola, Jr., J. J. Code bubbles: rethinking the user interface paradigm of integrated development environments. In Proceedings of the 32nd ACM/IEEE International Conference on Software Engineering, ICSE'10, 455--464.  ",
      "doi": "10.1145/1806799.1806866"
    },
    {
      "text": "Chess, B., and West, J. Secure programming with static analysis, 1st ed. Addison-Wesley Professional, 2007. ",
      "doi": "10.5555/1406221"
    },
    {
      "text": "Cigital. Whitebox SecureAssist. http://www.cigital.com/solutions/secureassist/.",
      "doi": ""
    },
    {
      "text": "Fortify, H. Fortify SCA. https://www.fortify.com/products/hpfssc/source-code-analyzer.html.",
      "doi": ""
    },
    {
      "text": "Graff, M. G., and Wyk, K. R. V. Secure Coding: Principles and Practices. O'Reilly & Associates, Inc., Sebastopol, CA, USA, 2003. ",
      "doi": "10.5555/863708"
    },
    {
      "text": "Hao, D., Zhang, L., Zhang, L., Sun, J., and Mei, H. Vida: Visual interactive debugging. In Proceedings of the 31st International Conference on Software Engineering, ICSE '09, IEEE Computer Society (2009), 583--586.  ",
      "doi": "10.1109/ICSE.2009.5070561"
    },
    {
      "text": "Kersten, M., and Murphy, G. C. Using task context to improve programmer productivity. In Proceedings of the 14th ACM SIGSOFT international symposium on Foundations of software engineering, SIGSOFT '06/FSE-14, ACM (2006), 1--11.  ",
      "doi": "10.1145/1181775.1181777"
    },
    {
      "text": "Ko, A. J., and Myers, B. A. A framework and methodology for studying the causes of software errors in programming systems. J. Vis. Lang. Comput. 16 (February 2005), 41--84.  ",
      "doi": "10.1016/j.jvlc.2004.08.003"
    },
    {
      "text": "Ko, A. J., and Myers, B. A. Barista: An implementation framework for enabling new tools, interaction techniques and views in code editors. In Proceedings of the SIGCHI conference on Human Factors in computing systems, CHI '06, ACM (2006), 387--396.  ",
      "doi": "10.1145/1124772.1124831"
    },
    {
      "text": "Ko, A. J., and Myers, B. A. Debugging reinvented: asking and answering why and why not questions about program behavior. In Proceedings of the 30th international conference on Software engineering, ICSE '08, ACM (2008), 301--310.  ",
      "doi": "10.1145/1368088.1368130"
    },
    {
      "text": "Murphy-Hill, E., and Black, A. P. An interactive ambient visualization for code smells. In Proceedings of the 5th international symposium on Software visualization, SOFTVIS '10, ACM (2010), 5--14.  ",
      "doi": "10.1145/1879211.1879216"
    },
    {
      "text": "Oracle. Java Servlet. http://www.oracle.com/technetwork/java/javaee/servlet/index.html.",
      "doi": ""
    },
    {
      "text": "OWASP. ESAPI. https://www.owasp.org/index.php/Category:OWASP_Enterprise_Security_API.",
      "doi": ""
    },
    {
      "text": "SAFECode. SAFECode. http://www.safecode.org/.",
      "doi": ""
    },
    {
      "text": "SourceForge. Findbugs. http://findbugs.sourceforge.net/.",
      "doi": ""
    },
    {
      "text": "VERACODE. State of Software Security Report Volume 1, 2 and 3. http://www.veracode.com/reports/index.html.",
      "doi": ""
    },
    {
      "text": "Weinberg, G. M. The psychology of computer programming. Van Nostrand Reinhold Co., New York, NY, USA, 1988. ",
      "doi": "10.5555/61465"
    },
    {
      "text": "Xie, J., Chu, B., and Lipford, H. R. Idea: interactive support for secure software development. In Proceedings of the Third international conference on Engineering secure software and systems, ESSoS '11, Springer-Verlag (2011), 248--255. ",
      "doi": "10.5555/1946341.1946367"
    },
    {
      "text": "Xie, J., Chu, B., Lipford, H. R., and Melton, J. T. Aside: Ide support for web application security. In Proceedings of the 27th Annual Computer Security Applications Conference, ACSAC '11, ACM (2011), 267--276.  ",
      "doi": "10.1145/2076732.2076770"
    },
    {
      "text": "Xie, J., Lipford, H. R., and Chu, B. Why do programmers make security errors? In Proceedings of 2011 IEEE Symposium on Visual Languages and Human Centric Computing (2011), 161--164.",
      "doi": ""
    }
  ]
}