{
  "doi": "10.1145/2207676.2208529",
  "title": "Communication and commitment in an online game team",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "879-888",
  "year": 2012,
  "badges": [],
  "abstract": "Theories about commitment in online settings and empirical evidence from offline environments suggest that greater communication in online groups should lead members to become more committed and participate longer. However, experimental evidence is sparse, in part because of difficulties inducing communication online. Moreover, previous work has not identified the route by which communication leads to increased commitment. In this paper, we investigated whether task versus social communication modeled by a leader versus a peer influenced the amount that group members talked and their willingness to continue participating in the group. We conducted an experiment within ad hoc groups in the online game World of Warcraft. Results suggest that communication early in a group's history causes members to talk more later on and that the early communication increases their commitment through its influence on group atmosphere rather than through increased member participation. Social communication by a peer is especially valuable in increasing commitment.",
  "tags": [
    "conversation",
    "communication",
    "status",
    "online games",
    "commitment",
    "virtual teams"
  ],
  "authors": [
    {
      "name": "Laura Dabbish",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    },
    {
      "name": "Robert Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Jordan Patton",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502698706",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, N. J., and Meyer, J. P. The measurement and antecedents of affective, continuance, and normative commitment to the organization. J. of Occupational and Organizational Psychology 63 (1990), 1--8.",
      "doi": ""
    },
    {
      "text": "Bargh, J., and Williams, E. The automaticity of social life. Current Directions in Psychological Science 15, 1 (2006), 1--4.",
      "doi": ""
    },
    {
      "text": "Baron, R.M., and Kenny, D.A. The moderator-mediator variable distinction in social psychological research. J. of Personality and Social Psychology 51, 6 (1986), 1173--1182.",
      "doi": ""
    },
    {
      "text": "Berg, J.H., and Archer, R.L. The disclosure-liking relationship: Effects of self-perception, order of disclosure, and topical similarity. Human Communication Research 10, 2 (1983), 269--281.",
      "doi": ""
    },
    {
      "text": "Bettenhausen, K. L. Five years of groups research: What we've learned and what needs to be addressed. J. of Management 17 (1991), 345--381.",
      "doi": ""
    },
    {
      "text": "Butler, B. Membership size, communication activity, and sustainability: A resource-based model of online social structures. Information Systems Research 12, 4 (2001), 346--362.  ",
      "doi": "10.1287/isre.12.4.346.9703"
    },
    {
      "text": "Casciaro, T., and Lobo, M.S. When task competence is irrelevant: The role of positive and negative interpersonal affect in instrumental ties, Administrative Science Quarterly 53 (2008), 655--684.",
      "doi": ""
    },
    {
      "text": "Chua, C., Wareham, J., and Robey, D. The role of online trading communities in managing internet auction fraud, MIS Quarterly 31, 4 (2004), 759--781. ",
      "doi": "10.5555/2017356.2017363"
    },
    {
      "text": "Cialdini, R.B., and Goldstein N.J. Social Influence: Conformity and Compliance. Annual Review of Psychology 55 (2004), 591--621.",
      "doi": ""
    },
    {
      "text": "Collins, M., and Miller, L.C. Self-disclosure and liking: A meta-analytic review. Psychological Bulletin 116, 3(1994), 457--475.",
      "doi": ""
    },
    {
      "text": "Cramton, C.D., Orvis, K.L., and Wilson, J.M. Situation invisibility and attribution in distributed collaborations. J. of Management 33, 4 (2007), 525--546.",
      "doi": ""
    },
    {
      "text": "Crossman, A., and Lee-Kelly, L. Trust, commitment, and team working: The paradox of virtual organizations. Global Networks 4 (2004), 375--390.",
      "doi": ""
    },
    {
      "text": "Farzan, R., Dabbish, L., Kraut, R. E., and Postmes, T. (2011). Increasing Commitment in Online Communities via Building Social Attachment, In Proc. CSCW 2011, ACM Press (2011), 321--330.  ",
      "doi": "10.1145/1958824.1958874"
    },
    {
      "text": "Festinger, L. Informal social communication. Psychological Review 57 (1950), 271--282.",
      "doi": ""
    },
    {
      "text": "Gerstner, C.R., and Day, D.V. Meta-analytic review of leader-member exchange theory: Correlates and construct issues. J. of Applied Psychology 82, 6 (1997), 827--844.",
      "doi": ""
    },
    {
      "text": "Gibson, C., and Gibbs, J.L. Unpacking the concept of virtuality. Administrative Science Quarterly 51 (2006), 451--495.",
      "doi": ""
    },
    {
      "text": "Goldstein, N. J., Cialdini, R. B., and Griskevicius, V. A room with a viewpoint: Using social norms to motivate environmental conservation in hotels. J. of Consumer Research 35(2008).",
      "doi": ""
    },
    {
      "text": "Harper, F., Frankowski, D., Drenner, S., Yuqing Ren, Kiesler, S., Terveen, L., et al. Talk Amongst Yourselves. In Proc. IUI 2007, ACM Press (2007), 6271.  ",
      "doi": "10.1145/1216295.1216313"
    },
    {
      "text": "Herbsleb, J. D., and Mockus, A. An empirical study of speed and communication in globally-distributed software development. IEEE Transactions on Software Engineering 29, 3 (2003), 1--14.  ",
      "doi": "10.1109/TSE.2003.1205177"
    },
    {
      "text": "Hogg, M.A. A social identity theory of leadership. Personality and Social Psychology Review 5 (2001), 184--200.",
      "doi": ""
    },
    {
      "text": "Johnson, S.K., Bettenhausen, K., and Gibbons, E. Realities of working in virtual teams. Small Group Research 40, 6 (2009), 623--649.",
      "doi": ""
    },
    {
      "text": "Kanawattanachai, P., and Yoo, Y. Dynamic nature of trust in virtual teams. Case Western Reserve University, USA . Sprouts: Working Papers on Information Systems, 2, 10 (2002). http://sprouts.aisnet.org/2--10.",
      "doi": ""
    },
    {
      "text": "Kittur, A., and Kraut, R. E. Harnessing the wisdom of crowds in Wikipedia: Quality through coordination. In Proc. CSCW 2008, ACM Press (2008), 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Levine, J., and Moreland, D. Small Groups. Handbook of Social Psychology (2998), 415--469.",
      "doi": ""
    },
    {
      "text": "Luthans, F., Wahl, L.V.K., and Steinhaus, C.S. The importance of social support for employee commitment. Org. Development Journal, Winter (1992), 1--10.",
      "doi": ""
    },
    {
      "text": "Mathieu, J. E., and Zajac, D. M. A review and metaanalysis of the antecedents, correlates, and consequences of organizational commitment. Psychological Bulletin 108, 2 (1990), 171--194.",
      "doi": ""
    },
    {
      "text": "Markey, P. M. Bystander intervention in computermediated communication. Computers in Human Beh. 16, 2 (2000), 183--188.",
      "doi": ""
    },
    {
      "text": "McKenna, K.Y.A., Green, A.S., and Gleason, M.E.J. Relationship formation on the Internet: What's the big attraction? J. of Social Issues 58,1 (2002), 9--31.",
      "doi": ""
    },
    {
      "text": "Meyer, J.P., and Allen, N.J. A three-component conceptualization of organizational commitment. Human Resource Management Review 1, (1991), 61--89.",
      "doi": ""
    },
    {
      "text": "Meyer, J.P., Becker, T.E., and Vandenberghe, C. Employee commitment and motivation: A Conceptual analysis and integrative model. J. of Applied Psychology 89, 6(2004), 991--1007.",
      "doi": ""
    },
    {
      "text": "Meyer, J.P., and Herscovitch, L. Commitment in the workplace: Toward a general model. Human Resource Management Review 11 (2001), 299--326.",
      "doi": ""
    },
    {
      "text": "Mockus, A., Fielding, R., and Herbsleb, J.D. Two case studies of open source software development: Apache and Mozilla. ACM Transactions on Software Engineering and Methodology 11, 3 (2002), 309--346.  ",
      "doi": "10.1145/567793.567795"
    },
    {
      "text": "Moreland, R. L., and Levine, J. M. Socialization in organizations and work groups. In M. E. Turner (Ed.), Groups at Work: Theory and Research (pp. 69112). Erlbaum: Mahwah, NJ, 2001.",
      "doi": ""
    },
    {
      "text": "Newcomb, T. The Acquaintance Process. Holt, Rinehart & Winston: New York, 1961.",
      "doi": ""
    },
    {
      "text": "Nonnecke, B., and Preece, J. Lurker demographics: Counting the silent. ACM CHI Conference, CHI Letters 4, 1(2000), 73--80.  ",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "Parks, M.R., and Floyd, K. Making friends in cyberspace. J. of Communication 46 (1995), 80--97.",
      "doi": ""
    },
    {
      "text": "Pickering, M. J., and Garrod, S. Toward a mechanistic psychology of dialogue. Behavioral and Brain Sciences 27 (2004), 169--226.",
      "doi": ""
    },
    {
      "text": "Postmes, T., Tanis, M., and de Wit, B. Communication and committment in organizations: A social identity approach. Group Processes and Intergroup Relations 4, 3 (2001), 227--426.",
      "doi": ""
    },
    {
      "text": "Powell, A., Piccoli, G., and Ives, B. Virtual teams: A review of current literature and directions for future research. ACM SIGMIS Database 35, 1 (2004), 6--36.  ",
      "doi": "10.1145/968464.968467"
    },
    {
      "text": "Prentice, D. A., Miller, D. T., and Lightdale, J. R. Asymmetries in attachments to groups and to their members, Personality and Social Psychology Bulletin 20, 5 (1994), 484--493.",
      "doi": ""
    },
    {
      "text": "Ren, Y., Harper, F. M., Drenner, S., Terveen, L., Kiesler, S., Riedl, J., et al. Increasing attachment to online communities. MIS Quarterly (under review).",
      "doi": ""
    },
    {
      "text": "Ren, Y., Kraut, R. E., and Kiesler, S. Applying common identity and bond theory to design of online communities,\" Org. Studies 28,3 (2007), 377--408.",
      "doi": ""
    },
    {
      "text": "Rodgers, R., and Chen, Q. Internet community group participation: Psychosocial benefits for women with breast cancer. JCMC 10, 4(2005) np.",
      "doi": ""
    },
    {
      "text": "Sacks, H., andJefferson, G. Lectures on conversation: Wiley-Blackwell: New York, 1995.",
      "doi": ""
    },
    {
      "text": "Sassenberg, K. Common bond and common identity groups on the internet: Attachment and normative behavior in on-topic and off-topic chats, Group Dynamics 6,1(2002), 27--37.",
      "doi": ""
    },
    {
      "text": "Shapiro, D. L., Furst, S. A., Spreitzer, G. M., and Von Glinow, M. A. Transnational teams in the electronic age: Are team identity and high performance at risk? J. of Org. Behavior 23 (2002), 455--467.",
      "doi": ""
    },
    {
      "text": "Smith, C.B., McLaughlin, M.L., and Osborne, K.K. Conduct control on usenet. JCMC 2, 4(1997), np.",
      "doi": ""
    },
    {
      "text": "Strodbeck, F.L., James, R.M., and Hawkins, C. Social status in jury deliberations. American Sociological Review 22 (1957), 713--719.",
      "doi": ""
    },
    {
      "text": "Tangirala, S., and Alge, B. J. Reactions to unfair events in computer-mediated groups: A test of uncertainty management theory. OBHDP 100 (2004), 1--20.",
      "doi": ""
    },
    {
      "text": "Vandenberghe, C., Bentein, K., and Stinglhamber, F. Affective commitment to the organization, supervisor, and work group. J. of Vocational Beh. 64 (2004), 47--71.",
      "doi": ""
    },
    {
      "text": "Wikipedia. (2011). World of Warcarft Retrieved Sep 9, 2011, from http://en.wikipedia.org/wiki/World_of_Warcraft",
      "doi": ""
    },
    {
      "text": "Workman, M., Kahnweiler, W., and Bommer, W. The effects of cognitive style and media richness in commitment to telework and virtual teams. J. of Vocational Beh. 63 (2003), 199--219.",
      "doi": ""
    }
  ]
}