{
  "doi": "10.1145/2207676.2208550",
  "title": "QuickDraw: improving drawing experience for geometric diagrams",
  "published": "2012-05-05",
  "proctitle": "CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1037-1064",
  "year": 2012,
  "badges": [],
  "abstract": "We present QuickDraw, a prototype sketch-based drawing tool, that facilitates drawing of precise geometry diagrams that are often drawn by students and academics in several scientific disciplines. Quickdraw can recognize sketched diagrams containing components such as line segments and circles, infer geometric constraints relating recognized components, and use this information to beautify the sketched diagram. Beautification is based on a novel algorithm that iteratively computes various sub-components of the components using an extensible set of deductive rules. We conducted a user study comparing QuickDraw with four state-of-the-art diagramming tools: Microsoft PowerPoint, Cabri II Plus, Geometry Expressions and Geometer's SketchPad. Our study demonstrates a strong interest among participants for the use of sketch-based software for drawing geometric diagrams. We also found that QuickDraw enables users to draw precise diagrams faster than the majority of existing tools in some cases, while having them make fewer corrections.",
  "authors": [
    {
      "name": "Salman Cheema",
      "institution": "University of Central Florida, Orlando, Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456637300",
      "orcid": "missing"
    },
    {
      "name": "Sumit Gulwani",
      "institution": "Microsoft Research, Redmond, Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100315615",
      "orcid": "missing"
    },
    {
      "name": "Joseph LaViola",
      "institution": "University of Central Florida, Orlando, Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283513",
      "orcid": "0000-0003-1186-4130"
    }
  ],
  "references": [
    {
      "text": "Aldefeld, B. Variation of geometries based on a geometric-reasoning method. Computer Aided Design 20, 3 (April 1988), 117--126.  ",
      "doi": "10.1016/0010-4485%2888%2990019-X"
    },
    {
      "text": "Bouma, W., Fudos, I., Hoffmann, C. M., Cai, J., and Paige, R. Geometric constraint solver. Computer-Aided Design 27, 6 (1995), 487--501.",
      "doi": ""
    },
    {
      "text": "Cabri ii plus, 2011. http://www.cabri.com.",
      "doi": ""
    },
    {
      "text": "Chin, J. P., Diehl, V. A., and Norman, K. L. Development of an instrument measuring user satisfaction of the human-computer interface. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (1988), 213--218.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Forbus, K., Usher, J., Lovett, A., Lockwood, K., and Wetzel, J. Cogsketch: Sketch understanding for cognitive science research and for education. Topics in Cognitive Science (2011).",
      "doi": ""
    },
    {
      "text": "Geometer's sketchpad, 2011. http://dynamicgeometry.com/.",
      "doi": ""
    },
    {
      "text": "Geometry expressions, 2011. http://www.geometryexpressions.com/.",
      "doi": ""
    },
    {
      "text": "Gulwani, S., Korthikanti, V. A., and Tiwari, A. Synthesizing geometry constructions. In Proceedings of the 32nd ACM SIGPLAN conference on Programming language design and implementation, PLDI '11, ACM (New York, NY, USA, 2011), 50--61.  ",
      "doi": "10.1145/1993498.1993505"
    },
    {
      "text": "Hammond, T., and Davis, R. Ladder, a sketching language for user interface developers. Computers and Graphics 29, 4 (2005), 518--532.  ",
      "doi": "10.1016/j.cag.2005.05.005"
    },
    {
      "text": "Holm, S. A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics 6, 2 (1979), 65--70.",
      "doi": ""
    },
    {
      "text": "Igarashi, T., Matsuoka, S., Kawachiya, S., and Tanaka, H. Interactive beautification: a technique for rapid geometric design. In Proceedings of the 10th annual ACM symposium on User interface software and technology, UIST '97 (1997), 105--114.  ",
      "doi": "10.1145/263407.263525"
    },
    {
      "text": "Jiang, Y., Tian, F., Wang, H., Zhang, X., Wang, X., and Dai, G. Intelligent understanding of handwritten geometry theorem proving. In Proceedings of the 15th international conference on Intelligent user interfaces, IUI '10, ACM (New York, NY, USA, 2010), 119--128.  ",
      "doi": "10.1145/1719970.1719988"
    },
    {
      "text": "Kondo, K. Algebraic method for manipulation of dimensional relationships in geometric models. Computer-Aided Design 24, 3 (1992), 141--147.",
      "doi": ""
    },
    {
      "text": "LaViola, Jr., J. J., and Zeleznik, R. C. Mathpad2: a system for the creation and exploration of mathematical sketches. ACM Trans. Graph. 23 (August 2004), 432--440.  ",
      "doi": "10.1145/1015706.1015741"
    },
    {
      "text": "Li, Q., Liu, Y., Xu, H., Ren, L., and Ma, C. An intelligent pen-based whiteboard for dynamic geometry teaching. In Information Technologies and Applications in Education, 2007. ISITAE '07. First IEEE International Symposium on (nov. 2007), 396--401.",
      "doi": ""
    },
    {
      "text": "Microsoft powerpoint, 2011. http://office.microsoft.com/en-us/powerpoint/.",
      "doi": ""
    },
    {
      "text": "Nelson, G. Juno, a constraint-based graphics system. In SIGGRAPH (1985), 235--243.  ",
      "doi": "10.1145/325334.325241"
    },
    {
      "text": "Paulson, B., and Hammond, T. Paleosketch: accurate primitive sketch recognition and beautification. In Proceedings of the 13th international conference on Intelligent user interfaces, IUI '08, ACM (New York, NY, USA, 2008), 1--10.  ",
      "doi": "10.1145/1378773.1378775"
    },
    {
      "text": "Wais, P., Wolin, A., and Alvarado, C. Designing a sketch recognition front-end: user perception of interface elements. In Proceedings of the 4th Eurographics workshop on Sketch-based interfaces and modeling. SBIM '07, ACM (New York, NY, USA, 2007), 99--106.  ",
      "doi": "10.1145/1384429.1384451"
    },
    {
      "text": "Xiong, Y., and LaViola Jr., J. J. Technical section: A shortstraw-based algorithm for corner finding in sketch-based interfaces. Comput. Graph. 34 (October 2010), 513--527.  ",
      "doi": "10.1016/j.cag.2010.06.008"
    },
    {
      "text": "Zeleznik, R. C., Bragdon, A., Liu, C.-C., and Forsberg, A. Lineogrammer: creating diagrams by drawing. In Proceedings of the 21st annual ACM symposium on User interface software and technology, UIST '08, ACM (New York, NY, USA, 2008), 161--170.  ",
      "doi": "10.1145/1449715.1449741"
    }
  ]
}