{
  "doi": "10.1145/274644.274721",
  "title": "Communicating graphical information to blind users using music: the role of context",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "574-581",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "James L. Alty",
      "institution": "LUTCHI Research Centre, Dept. of Computer Science, Loughborough University, Loughborough, Leicestershire, LE11 3TU, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452617053",
      "orcid": "missing"
    },
    {
      "name": "Dimitrios I. Rigas",
      "institution": "School. of Computing and Mathematics, University of Huddersfield, Huddersfield, HD1 3DH, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410594480",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Shneiderman, B., \"Direct Manipulation: A Step beyond Programming Languages\", IEEE Computer, August, 1983, 57 -62.",
      "doi": ""
    },
    {
      "text": "Bly, S.A., Communicating with Sound, Proe. of CHI'82, ACM Press, Addison-Wesley, New York, 371-375.  ",
      "doi": "10.1145/800049.801814"
    },
    {
      "text": "Gaver, W., Using Sound in Computer Interfaces, Human Computer Interaction, Vol. 2, No. 2, (1986), 167- 177.",
      "doi": "10.1207/s15327051hci0202_3"
    },
    {
      "text": "Gaver, W., The SonicFinder: An Interface that Uses Auditory Icons, Human Computer Interaction, Vol. 4, No. 1, (1989), 87-94.  ",
      "doi": "10.1145/67880.1046601"
    },
    {
      "text": "Edwards. A.D.N, (1989), Soundtrack: An Auditory Interface for Blind Users, Human Computer Interaction, Vol. 4, No. 1, (1989), 45-66.  ",
      "doi": "10.1145/67880.1046600"
    },
    {
      "text": "Blattner, M.M., Sumikawa, D., and Greenberg, R., Earcons and Icons: Their Structure and Common Design Principles, In Human Computer Interaction, Vol. 4, (1989), 11-44  ",
      "doi": "10.1145/67880.1046599"
    },
    {
      "text": "Brown, M., and Hershberger, J., Colour and Sound in Algorithm Animation, IEEE Computer Vol. 25, No. 12,, (1992), 52-63.  ",
      "doi": "10.1109/2.179117"
    },
    {
      "text": "Alty, J.L., Can we Use Music in Human Computer Interaction ?, Proc. Hcr95, People and Computers X, Kirby, M.A, Dix, A.L, and Finlay, J.E., (eels.), ,Cambridge University Press, 409 - 423. ",
      "doi": "10.5555/215635.215726"
    },
    {
      "text": "Book, D.S., Auditory Software diagnosis Using a Sound Domain Specification Lan~maage, Ph.D. Thesis, Syracuse University, Syracuse, (1995). ",
      "doi": "10.5555/922799"
    },
    {
      "text": "Vickers, P., and Alty, J.L., CAITLIN: A Musical Program Auralisation Tool to Assist Novice Progrzmmers with Debug~ng, in Proe. of ICAD'96, (1996), Santa Fe Institute.",
      "doi": ""
    },
    {
      "text": "Brewster, S., Navigating Telephone-based Interfaces Mth Earcons, t'roe, tiers7, (Bristol, 1997), People and computers XII, (Thimbleby, IL, O'Conaill, B., and Thomas, P., eels.), Springer, Berlin, 39-56. ",
      "doi": "10.5555/646684.702629"
    },
    {
      "text": "Brewster, S., and Crease, M., Malting Menus Musical, Proe. INTERACT'W, (Howard, S., Hammond, J., and Lingaard, G., eds.), Chapman and Hall, London, 389-396. ",
      "doi": "10.5555/647403.723529"
    },
    {
      "text": "Mynatt, E.D., Designing Auditory Cues for Mercator, Proe. INTERACT'97, (Howard, S., Hammond, L, and Lingaard, G., eels.), Chapman and Hall, London, 236-243 ",
      "doi": "10.5555/647403.723687"
    },
    {
      "text": "Viekers, P., and Alty, J.L., The CAITLIN Auralisation system: Hierarchical Leitmotif Design as a clue to Program Comprehension, in Proc. ICAD'97, (1997), Santa Fe Institute.",
      "doi": ""
    },
    {
      "text": "Rigas, D., and Alty, J.L., The Use of Music in a Graphical Interface for the Visually Impaired, Proc. of INTERACT'97 (Howard., S., Hammond, J., and Lindegaard, G., (eds.)), Sydney, 1997, 228-235. ",
      "doi": "10.5555/647403.723538"
    },
    {
      "text": "Femstrom, M., and Bannon, L., Explorations in Sonic Browsing, Proe. HCI'87, (Bristol, 1997), People and computers XII, (Thimbleby, H., O'Conaill, B., and Thomas, P., eds.), Springer, Berlin, 117-132. ",
      "doi": "10.5555/646684.702632"
    },
    {
      "text": "Kennel, A.R., AUDIOGRAF: A Diagram-Reader for the Blind. In Proc. ASSETS'96, Vancouver, ACM Press, (1996), 51 - 56.  ",
      "doi": "10.1145/228347.228357"
    }
  ]
}