{
  "doi": "10.1145/274644.274675",
  "title": "Quantifying the effect of user interface design features on cyberstore traffic and sales",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "211-218",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Gerald L. Lohse",
      "institution": "The Wharton School of the University of Pennsylvania, 1319 Steinberg Hall-Dietrich Hall, Philadelphia, Pennsylvania",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100506802",
      "orcid": "missing"
    },
    {
      "name": "Peter Spiller",
      "institution": "McKinsey & Company, Inc., Koenigsallee 60C, 40027 Duesseldorf, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321498495",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnold, S. L; Ma, S.; Tigert, D. J. A comparative analysis of determinant attributes in retail store selection. Advances in Consumer Research, Association for Consumer Research, 5 (1977), 663- 667.",
      "doi": ""
    },
    {
      "text": "Belsley, David A., Kuh, Edwin, and Welsch, Roy E., Regression Diagnostics: identifying Influential Data and Sources of Collinearity, John Wiley, New York, 1980",
      "doi": ""
    },
    {
      "text": "Berry, L. L The components of department store image: A theoretical and empirical analysis. Journal of Retailing, 45, 1 (Spring 1969), 3-20.",
      "doi": ""
    },
    {
      "text": "Jarvenpaa, S. L. and Todd, P. A. Consumer reactions to electronic shopping on the World Wide Web. International Journal of Electronic Commerce, (1997), 1, 2, 59-88. ",
      "doi": "10.1080/10864415.1996.11518283"
    },
    {
      "text": "Glamour, September 1996, p 232.",
      "doi": ""
    },
    {
      "text": "Lindquist, L D. Meaning of image. Journal of Retailing, 50, 4 (Winter 1974-1975), 29-38.",
      "doi": ""
    },
    {
      "text": "Mason, Charlotte H. and Perreault, William D. Ir., Collineadty, Power and Interpretation of Multiple Regression Analysis, Journal of Marketing Research, Vol. 28 No. 3 (August 1991), p. 268-280.",
      "doi": ""
    },
    {
      "text": "May, E. G. Practical applications of recent retail image research. Journal of Retailing, 50, 4 (Winter 1974-1975), 15-20.",
      "doi": ""
    },
    {
      "text": "Morris-Lee, L Push-pull marketing with magalogs. Direct Marketing, 56, 2 (June 1993), 23-26, 47.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Usability Engineering. Cambridge, MA: Academic Press, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Poison, P. G. The consequences of consistent and inconsistent user interfaces, in: Guindon, R. (ed.). Cognitive Science and its Application for Human- Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum, 1988.",
      "doi": ""
    },
    {
      "text": "Ridgon, J. Caught in the Web. Wall Street Journal, (June 17, 1996)R14.",
      "doi": ""
    },
    {
      "text": "Sandberg, L Making the sale. Wall Street Journal, Qune 17, 1996)R6.",
      "doi": ""
    },
    {
      "text": "Spiller, P. &amp; Lohse, G.L. (forthcoming). A classification of Intemet retail stores. International Journal of Electronic Commerce, 2, 2. ",
      "doi": "10.1080/10864415.1997.11518307"
    },
    {
      "text": "White, Halbert, \"A Heteroskedasticity-Consistent Covariance Matrix Estimator and a Direct Test for I-Ieteroskedasticity,\" Econometrica, Vol. 48 No. 4 (1980), p. 817-838",
      "doi": ""
    }
  ]
}