{
  "doi": "10.1145/274644.274685",
  "title": "When the interface is a talking dinosaur: learning across media with ActiMates Barney",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "288-295",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "tags": [
    "learning",
    "interactive media",
    "interface",
    "childern"
  ],
  "authors": [
    {
      "name": "Erik Strommen",
      "institution": "Microsoft Corporation, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100626243",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bretherton, I. and Beeghly, M. Pretence: Acting 'as if.' In LL Loc~an and N. L. Hazen (FAs.) Action in Social Context: Perspectives on Early Development. Plenum Press, NY, 1989, pp. 239-271",
      "doi": ""
    },
    {
      "text": "Brown, C.M. Human-computer interface design guidelines. Ablex Publishing Co., Norwood, NJ, 1988. ",
      "doi": "10.5555/38160"
    },
    {
      "text": "Collins, W.A, Sobol, B.L. &amp; Westby, S. Effects of adult commentary on children's comprehension and inferences about a televised aggressive portrayal. Child Development, 52, 1 (1981), 158-163.",
      "doi": ""
    },
    {
      "text": "Diaz, 1LM., and Berk, L.E. (eds.). Private Speech: From Social Interaction to Self-Regulation. Lawrence ErIbaum Associates, tSllsdale, NJ, 1992.",
      "doi": ""
    },
    {
      "text": "Drain, A. Noobie: The Animal Design Playstation. SIGCHIBulletin, 20, 1 (1988), 45-53.  ",
      "doi": "10.1145/49103.49106"
    },
    {
      "text": "Druin, A. Physical Mul~media Environments. In A. Drain and C. Solomon (eds.). Designing Multimedia Environments for ChildrerL John Wiley and Sons, NY, 1992, 176-191.",
      "doi": ""
    },
    {
      "text": "Forys, S.K.S., and McCune-Nicolich, L. Shared pretend: Sociodmmatic play at 3 years of age. In I. Bretherton (ed.). Symbolic Play: The Development of Social Understanding. Academic Press, NY, 1984, 159-191.",
      "doi": ""
    },
    {
      "text": "Haefner, I~~.L and Wartella, E.A. Effects of Sibling Coviewing on Children's Interpretations of Television Programs. Journal of Broadcasting and Electronic Media, 31, 2 (1987), 153-68.",
      "doi": ""
    },
    {
      "text": "Huston, A.C., Donuerstein, E., Fairchild, H., Katz, P.A., Mma-ay, J.P., Rubinstein, E.A., W'flcox, B.L., and Zuckerman, D.M. Big World, Small Screen: The Role of Television in American Society. University of Nebraska Press, Lincoln, NE, 1992.",
      "doi": ""
    },
    {
      "text": "Johnson, D.W. and Johnson, 1L Learning Together and Alone: Cooperatior competition, and individualization. Prentice-Hall, Englewood Cliffs, NJ, 1975.",
      "doi": ""
    },
    {
      "text": "Jones, M K. Human-Computer Interaction: A Design Guide. Educational Technology Publications, Englewood Cliffs, NJ, 1988. ",
      "doi": "10.5555/61953"
    },
    {
      "text": "McCarthy, D. Manual for the McCarthy Scales of Children's Abilities. The Psychological Corporation, Cleveland, OH, 1972.",
      "doi": ""
    },
    {
      "text": "Mevarech, Z.R., Silber, 0., &amp; Fein, D. Leaning with computers in small groups: Cognitive and affective outcomes. Journal of Educational Computing Research, 7 (1991), 233-243.",
      "doi": ""
    },
    {
      "text": "Nastasi, B.K. and Clements, D.H. Social-cognitive behaviors and higher-order thinking in educational computing environments. Learning and instruction (special issue on cooperative learning and computers), 2 (1992), 215-238",
      "doi": ""
    },
    {
      "text": "Norman, D. Design Principles for Human-Computer Interfaces. In A. Janda (ed.), Human Factors in Computer Systems. Proceedings of the A CM SIGCHI Conference (Boston MA, December 1983), North- Holland, Amsterdam, 1-10.  ",
      "doi": "10.1145/800045.801571"
    },
    {
      "text": "Resnick, P., and Virzi, R.A. Relief from the Audio Interface Blues: Expanding the Spectrum of Menu, List, and Form Styles. ACM Transactions on Computer-Human Interaction, 2, 2 (June 1995), 145- 176.  ",
      "doi": "10.1145/210181.210183"
    },
    {
      "text": "Robson, S. \"Best of all I like Choosing Time\": Talking With Children About Play and Wore Early Child Development and Care, 92, (1993), 37-51.",
      "doi": ""
    },
    {
      "text": "Rogoff, B., &amp; Gardner, W. Adult Guidance of Cognitive Development. In B. Rogoff and J. Lave (eds.). Everyday Cognition: Its Development in Social Context. Harvard University Press, Cambridge, MA, 1984, 95-116.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Designing the Human Interface: Strategies for Effective Human-Computer Interaction. Addison-Wesley Publishing Co., Reading, MA, 1987 ",
      "doi": "10.5555/6682"
    },
    {
      "text": "Slavin, R. E. Cooperative Learning. Review of Educational Research, 60 (1980), 315-342.",
      "doi": ""
    },
    {
      "text": "Strommen, E.F. \"What did he say?\": Speech output in preschool software. In Proceedings of NECC'91 (Phoenix AR, June 1991), Intemational Society for Technology in Education, Eugene, Oregon, 149-151.",
      "doi": ""
    },
    {
      "text": "Tudge, LILH., Winterhoff, P.A., &amp; Hogan, D.M. The Cognitive Consequences of Collaborative Problem Solving With and Without Feedback. ChiM Development, 67(6, 1996), 2892-2909.",
      "doi": ""
    },
    {
      "text": "Vygotsky, L. S. Mind in Society: The Development of Higher Psychological Processes. Harvard University Press, Cambridge, MA, 1978.",
      "doi": ""
    },
    {
      "text": "Vygotsky, L. S. Thought and Language. M.I.T. Press, Cambridge, MA, 1967.",
      "doi": ""
    }
  ]
}