{
  "doi": "10.1145/274644.274716",
  "title": "Scripting graphical applications by demonstration",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "534-541",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "tags": [
    "command objects",
    "macros",
    "scripting",
    "programming by demonstration",
    "user interface development environments",
    "amulet",
    "toolkits"
  ],
  "authors": [
    {
      "name": "Brad A. Myers",
      "institution": "Human Computer Interaction Institute, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    }
  ],
  "references": [
    {
      "text": "Halbert, D.C. \"S mallS tar: Programming by Demonstration in the Desktop Metaphor,\" in Watch What I Do: Programming by Demonstration. 1993. Cambridge, MA: MIT Press. pp. 102-123. ",
      "doi": "10.5555/168080.168101"
    },
    {
      "text": "Kosbie, D.S. and Myers, B.A., \"PBD Invocation Techniques: A Review and Proposal,\" in Watch What I Do: Programming by Demonstration, A. Cypher, Editor 1993, MIT Press. Cambridge, MA. pp. 423-431. ",
      "doi": "10.5555/168080.168137"
    },
    {
      "text": "Kurlander, D. \"Chimera: Example-Based Graphical Editing,\" in Watch What I Do: Programming by Demonstration. 1993. Cambridge, MA: MIT Press. pp. 271-290. ",
      "doi": "10.5555/168080.168118"
    },
    {
      "text": "Kurlander, D. and Bier, E.A. \"Graphical Search and Replace,\" in Proceedings SIGGRAPH'88: Computer Graphics. 1988. Atlanta, GA: 22. pp. 113-120.  ",
      "doi": "10.1145/54852.378495"
    },
    {
      "text": "l.,akJn, F., et al., \"l'he Electronic Design Notebook: Performing Medium And Processing Medium.\" Visual Computer: International Journal of Computer Graphics, 1989. 5(4): pp. 214-226.",
      "doi": ""
    },
    {
      "text": "Lieberman, H. \"Dominos and Storyboards: Beyond Icons on Strings,\" in IEEE Computer Society: 1992 IEEE Workshop on Visual Languages. 1992. Seattle, WA: pp. 65-71.",
      "doi": ""
    },
    {
      "text": "Maulsby, D.L. and Witten, I.H. \"Inducing Procedures in a Direct-Manipulation Environment,\" in Proceedings SIGCHI'89: Human Factors in Computing Systems. 1989. Austin, TX: pp. 57- 62.  ",
      "doi": "10.1145/67449.67463"
    },
    {
      "text": "McDaniel, R.G. and Myers, B.A. \"Building Applications Using Only Demonstration,\" in 1998 International Conference On Intelligent User Interfaces. 1998. San Francisco, CA: To appear.  ",
      "doi": "10.1145/268389.268409"
    },
    {
      "text": "Modugno, F., Corbett, A.T., and Myers, B.A., \"Graphical Representation of Programs in a Demonstrational Visual Shell -- An Empirical Evaluation.\" A CM Transactions on Computer-Human Interaction, 1997. 4(3): pp. 276-308.  ",
      "doi": "10.1145/264645.264659"
    },
    {
      "text": "Myers, B.A., \"Creating User Interfaces Using Programmingby-Example, Visual Programming, and Constraints.\" ACM Transactions on Programming Languages and Systems, 1990. 12(2): pp. 143-177.  ",
      "doi": "10.1145/78942.78943"
    },
    {
      "text": "Myers, B.A. and Kosbie, D. \"Reusable Hierarchical Command Objects,\" in Proceedings CH1'96: Human Factors in Computing Systems. 1996. Vancouver, BC, Canada: pp. 260-267.  ",
      "doi": "10.1145/238386.238526"
    },
    {
      "text": "Myers, B.A., et al., 'fflae Amulet Environment: New Models for Effective User Interface Software Development.\" IEEE Transactions on Software Engineering, 1997. 23(6): pp. 347-365.  ",
      "doi": "10.1109/32.601073"
    },
    {
      "text": "Stallman, R.M., Emacs: The Extensible, Customizable, Self- Documenting Display Editor. MIT Artificial Intelligence Lab, 1979. ",
      "doi": "10.5555/888850"
    }
  ]
}