{
  "doi": "10.1145/274644.274646",
  "title": "The PadMouse: facilitating selection and spatial positioning for the non-dominant hand",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "9-16",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "tags": [
    "mouse",
    "touchpad",
    "hot-keys",
    "gestures",
    "marking-menus",
    "bimanual input",
    "toolgass",
    "interaction techniques",
    "input devices"
  ],
  "authors": [
    {
      "name": "Ravin Balakrishnan",
      "institution": "Dept. of Computer Science, University of Toronto, Toronto, Ontario, Canada M5S 3G4 and Aliaslwavefront, 210 King Street East, Toronto, Ontario, Canada M5A 1J7",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    },
    {
      "name": "Pranay Patel",
      "institution": "Aliaslwavefront, 210 King Street East, Toronto, Ontario, Canada M5A 1J7",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100489779",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., &amp; DeRose, T.D. (1993). Toolglass and magic lenses: The see-through interface. Computer Graphics Proceedings, Annual Conference Series, 73-80, New York: ACM SIGGRAPH.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Fishkin, K., Buxton, W., &amp; Baudel, T. (1994). A taxonomy of see-through tools. Proceedings of the CHI'94 Conference on Human Factors in Computing Systems, 358-364, New York: ACM.  ",
      "doi": "10.1145/191666.191786"
    },
    {
      "text": "Buxton, W., &amp; Myers, B. A. (1986). A study in twohanded input. Proceedings of the CHI'86 Conference in Human Factors in Computing Systems, 321-326, New York: ACM.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Card, S. K., Moran, T.P., &amp; Newell, A. (1980). The Keystroke-Level model for user performance time with interactive systems. Communications of the ACM, 23, 7, 396-410, New York: ACM.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Fitzmaurice, G. W., &amp; Buxton, W. (1997). An empirical evaluation of graspable user interfaces: towards specialized, space-multiplexed input. Proceedings of CH1\"97 Conference on Human Factors in Computing Systems, 43-50, New York: ACM.  ",
      "doi": "10.1145/258549.258578"
    },
    {
      "text": "Guiard, Y. (1987). Asymmetric division of labour in human skilled bimanual action: The ldnematie chain as a model. Journal of Motor Behaviour, 19, 486-517.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Proffitt, D., Patten, L, &amp; Kassell, N. (1997). Cooperative Bimanual Action. Proceedings of the CHI'97 Conference on Human Factors in Computing Systems, 27-34, New York: ACM.  ",
      "doi": "10.1145/258549.258571"
    },
    {
      "text": "Hopkins, D. (1991). The design and implementation of pie menus. Dr. Dobbs\" Journal, December 1991, 16- 26. ",
      "doi": "10.5555/135025.135026"
    },
    {
      "text": "Jacob, R. J. K., Sibert, L. E., McFarlane, D. C., &amp; Mullen, M. P. (1994). Integrality and separability of input devices. A CM Transactions on Computer- Human Interaction, 1, 1, 3-26.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Kabbash, P., Buxton, W., &amp; SeUen, A. (1994). Twohanded input in a compound task. Proceedings of the CHI'94 Conference on Human Factors in Computing Systems, 417-423, New York: ACM.  ",
      "doi": "10.1145/191666.191808"
    },
    {
      "text": "Kurtenbach, G. (1993). The Design and Evaluation of Marking Menus. Ph.D. Thesis, Department of Computer Science, University of Toronto, Toronto, Canada. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Kurtenbach, G., &amp; Buxton, W. (1993). The limits of expert performance using hierarchical marking menus. Proceedings of InterCHI'93 Conference on Human Factors in Computing Systems, 482-487, New York: ACM.  ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Baudel, T., &amp; Buxton, W. (1997). The design of a GUI paradigm based on tablets, two-hands, and transparency. Proceedings of the CHI'97 Conference on Human Factors in Computing Systems, 35-42, New York: ACM.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Nilsen, E. L. (1991). Perceptual-motor control in human-computer interaction. Technical Report NO. 37, Cognitive Science and Machine Intelligence Laboratory, University of Michigan. ",
      "doi": ""
    },
    {
      "text": "Zeleznik, R. C., Forsberg, A. S., &amp; Strauss, P. S. (1997). Two pointer input for 3D interaction. Proceedings of 1997 Symposium on Interactive 3D Graphics, Providence, Rhode Island.  ",
      "doi": "10.1145/253284.253316"
    },
    {
      "text": "Zhai, S., Smith, B. A., &amp; Selker, T. (1997). Improving browsing performance: A study of four input devices for scrolling and pointing. Proceedings of INTER- ACT'97: The Sixth IFIP Conference on Human-Computer Interaction, Sydney, Australia. ",
      "doi": "10.5555/647403.723823"
    }
  ]
}