{
  "doi": "10.1145/274644.274705",
  "title": "Finding and visualizing inter-site clan graphs",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "448-455",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Loren Terveen",
      "institution": "AT&T Labs-Research, 180 Park Avenue, P.O. Box 971, Florham Park, NJ",
      "img": "/do/10.1145/contrib-81100276946/rel-imgonly/my_mcknight_photo_2017.jpg",
      "acmid": "81100276946",
      "orcid": "missing"
    },
    {
      "name": "Will Hill",
      "institution": "AT&T Labs-Research, 180 Park Avenue, P.O. Box 971, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100454370",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baldonado, M.Q.W., and Winograd, T. An Information- Exploration Interface Supporting the Contextual Evolution of a User's Interests, in Proceedings of CHI\"9Y (Atlanta GA, March 1997), ACM Press, 11-18.  ",
      "doi": "10.1145/258549.258563"
    },
    {
      "text": "Botafogo, R.A., Rivlin, E., and Shneiderman, B. Structural Analysis of Hypertexts: Identifying Hierarchies and Useful Metrics. A CM Transactions on Information Systems 10, 2, I42-180.  ",
      "doi": "10.1145/146802.146826"
    },
    {
      "text": "Card, S.K., Robertson, G.C., and York, W. The x, VebBook and the Web Forager: An Information Workspace for the World-Wide Web, in Proceedings of CHI'96 (Vancouver BC, April 1996), ACM Press, 111- 117.  ",
      "doi": "10.1145/238386.238446"
    },
    {
      "text": "CanS~re, J., and Kazman R. WebQuery: Searching and Visualizing the Web through Connectivity, in Proceedings of WWW6 (Santa Clara CA, April 1997). ",
      "doi": "10.5555/283554.283412"
    },
    {
      "text": "Communications of the A CM, Special issue on Recommender Systems, 40, 3 (March 1997). Resnick, P., and Varian, HR., ~maest editors.  ",
      "doi": "10.1145/245108.245121"
    },
    {
      "text": "Fumas, G.W. Effective View Navigation, in Proceedings of CH1\"97 (Atlanta GA, March 1997), ACM Press, 367-374.  ",
      "doi": "10.1145/258549.258800"
    },
    {
      "text": "Garfield, E. Citation Indexing. ISI Press, Philadelphia, PA, 1979.",
      "doi": ""
    },
    {
      "text": "Hill, W.C., Stead, L., Rosenstein, M. and Fumas, G. Recommending and Evaluating Choices in a Virtual Community of Use, in Proceedings of CHI'95 (Denver CO, l~Iay 1995), ACM Press, 194-201.  ",
      "doi": "10.1145/223904.223929"
    },
    {
      "text": "Jackson, M.H. Assessing the Structure of Communication on the World Wide Web. Journal of Computer-Mediated Communication, 3, 1, June 1997",
      "doi": ""
    },
    {
      "text": "Kandogan, E., and Shneiderman, B. Elastic Windows: A Hierarchical Multi-Window World-Wide Web Browser, in Proceedings of UIST'97 (forthcoming), preprint at http:/Iwww.cs.umd.edaluserslkandogan/papersluist97/pa per.html  ",
      "doi": "10.1145/263407.263541"
    },
    {
      "text": "Kleinberg, LM. Authoritative Sources in a Hypeflinked Environment, in Proceedings of 1998 A CM-SIAM Symposium on Discrete Algorithms (forthcoming). ",
      "doi": "10.5555/314613.315045"
    },
    {
      "text": "Lamping, J., Rao, R., and Pirolli, P. A Focus + Context Technique Based on Hyperbolic Geometry for Visualizing Large Hierarchies, in Proceedings of CHI'95 (Denver CO, May 1995), ACM Press, 401-408.  ",
      "doi": "10.1145/223904.223956"
    },
    {
      "text": "Mackinlay, LD., Rao, R., and Card, S.K. An Organic User Interface for Searching Citation Links, in Proceedings of CH1\"95 (Denver CO, May 1995), ACM Press, 67 -73.  ",
      "doi": "10.1145/223904.223913"
    },
    {
      "text": "Maarek Y.S., Jacovi, M., Shtalhaim, M., Ur, S., Zemik, D., and Ben Shaul, I.Z. WebCutter: A System for Dynamic and Tailorable Site Mapping, in Proceedings of WWW6 (Santa Clara CA, April 1997). ",
      "doi": "10.5555/283554.283418"
    },
    {
      "text": "Mukherjea, S., and Foley, J. D. Visualizing the World- Wide Web with the navigational view finder. Computer Networks and lSDN Systems 27, 1, (1995), 1075-1087.  ",
      "doi": "10.1016/0169-7552%2895%2900023-Z"
    },
    {
      "text": "Mukherjea, S., Foley, J.D., and Hudson, S. Visualizing Complex Hypermedia Networks through Multiple Hierarchical Views, in Proceedings of CHI'95 (Denver CO, May 1995), ACM Press, 331-337.  ",
      "doi": "10.1145/223904.223947"
    },
    {
      "text": "Pirolli, P., Pitkow, J., and Rao, R. Silk from a Sow's Ear: Extracting Usable Structures from the Web, in Proceedings of CHI'96 (Vancouver BC, April 1996), ACM Press, 118-125.  ",
      "doi": "10.1145/238386.238450"
    },
    {
      "text": "Pirolli, P., Schank, P., Hearst, M., and Diehl, Scatter/Gather Browsing Communicates the Topic Structure of a Very Large Text Collection, in Proceedings of CH1\"96 (Vancouver BC, April 1996), ACM Press, 213-220.  ",
      "doi": "10.1145/238386.238489"
    },
    {
      "text": "Pitkow, J., and Pirolli, P. Life, Death, and Lawfidness on the Electronic Frontier, in Proceedings of CH1\"97 (Atlanta GA, March 1997), ACM Press, 383-390.  ",
      "doi": "10.1145/258549.258805"
    },
    {
      "text": "Scott, J. Social Network Analysis: A Handbook. SAGE Publications, London, 1991.",
      "doi": ""
    },
    {
      "text": "Terveen, L.G., Hill, W.C., Amento, B., McDonald, D., and Creter, J. Building Task-Specific Interfaces to High Volume Conversational Data, in Proceedings of CH1\"97 (Atlanta GA, March 1997), ACM Press, 226-233.  ",
      "doi": "10.1145/258549.258712"
    },
    {
      "text": "What is tw Url ? http://www.roir.com/whatis.htm",
      "doi": ""
    }
  ]
}