{
  "doi": "10.1145/274644.274692",
  "title": "A multiple device approach for supporting whiteboard-based interactions",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "344-351",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Jun Rekimoto",
      "institution": "Sony Computer Science Laboratory Inc., 3-14-13, Higashi-gotanda, Shinagawa-ku, Tokyo 141, Japan",
      "img": "/do/10.1145/contrib-81100008564/rel-imgonly/p2.png",
      "acmid": "81100008564",
      "orcid": "0000-0002-3629-2514"
    }
  ],
  "references": [
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, WiUiamBuxton, and Tony DeRose. ToolNass and Marc Lenses: The see-through interface. In James T. Kajiya, editor, Computer Graphics (SIGGRAPH '93 Proceedings), volume 27, pp. 73-80, Au~st 1993.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "C. H. Blickenstorfer. Graffiti: Wow! Pen Computing Magazine, pp. 30-31, 1995.",
      "doi": ""
    },
    {
      "text": "R. A. Bolt. Put-That-There: voice and gesture at the graphics interface. A CM SIGGRAPH Comput. Graph., Vol. 14, No. 3, pp. 262-270, 1980.  ",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "3Com Corporation. PalmPilot home page. http:ll ww.usr.com/palm/, 1997.",
      "doi": ""
    },
    {
      "text": "Scott Elrod, Richard Bruce, Rich Gold, David Goldberg, Frank Halasz, W'tUiam Janssen, David Lee, Kim McCall, Elin Pedersen, Ken Pier, Jhon Tang, and Brent Welch. LiveBoard: A large interactive display supporting group meetings, presentations and remote collaboration. In CHI'92 Proceedings, pp. 599-607, 1992.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "George W. Fitzmaurice. Situated information spaces and spatially aware palmtop computers. Communication ofthe ACM, Vol. 36, No. 7, pp. 38-49, July 1993.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "George W. Fitzmaurice, Hiroshi Ishii, and William Buxton. Bricks: laying the foundations for graspable user interfaces. In CHI'95 Conference, pp. 442-449, 1995.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "D. Goldberg and C. Richardson. Touch-typing with a stylus. In Proc. lnterCHI '93, pp. 80-87. ACM, 1993.  ",
      "doi": "10.1145/169059.169093"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, Sachiko Kawachiya, and Hidehiko Tanaka. Interactive beautification: A technique for rapid geometric design. In Proceedings of UIST'97, October 1997. to appear.  ",
      "doi": "10.1145/263407.263525"
    },
    {
      "text": "Sun Microsystems Inc. JavaBeans home page. http:lljava.sun.comlbeansl, 1997.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. Tan~ble Bits: Towards seamless interfaces between people, bits and atoms. In CHI'96 Proceedings, pp. 234-241, 1997.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "M. Nakagawa, T. Oguni, T. Yoshino, K. Horiba, and S. Sawada. Interactive dynamic whiteboard for educational applications. In International Conference on Virtual Systems and Multimedia (VSMM) \"96, pp. 479- 484, September 1996.",
      "doi": ""
    },
    {
      "text": "Elin R. Pedersen, Kim McCall, Thomas P. Moran, and Frank G. Halasz. Tivoli: An electronic whiteboard for informal workgroup meetings. In Proc. InterCHI \"93, pp. 80-87. ACM, 1993.  ",
      "doi": "10.1145/169059.169309"
    },
    {
      "text": "Jtm Rekimoto. Pick-and-Drop: A Direct Manipulation Technique for Multiple Computer Environments. In Proceedings of UIST'97, October 1997. to appear.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Stott Robertson, Cathleen Wharton, Catherine Ashworth, and Marita Franzke. Dual device user interface desi~: PDAs and interactive television. In CHI'96 Proceedings, pp. 79-86, 1996.  ",
      "doi": "10.1145/238386.238408"
    },
    {
      "text": "Roy Want, Bill Schilit, Norman Adams, Rich Gold, Karin Petersen, John Ellis, David Goldberg, and Mark Weiser. The PARCTAB ubiquitous computing experiment. Technical Report CSL-95-1, Xerox Palo Alto Research Center, March 1995.",
      "doi": ""
    },
    {
      "text": "MarkWeiser. The computer for the twenty-first century. Scientific American, Vol. 265, No. 3, pp. 94-104, 1991.",
      "doi": ""
    },
    {
      "text": "Pierre Wellner. Interacting with paper on the DitalDesk. Communication of the ACM, Vol. 36, No. 7, pp. 87-96, Au~st 1993.  ",
      "doi": "10.1145/159544.159630"
    }
  ]
}