{
  "doi": "10.1145/274644.274647",
  "title": "Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces",
  "published": "1998-01-01",
  "proctitle": "CHI '98: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "17-24",
  "year": 1998,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Beverly L. Harrison",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010116",
      "orcid": "missing"
    },
    {
      "name": "Kenneth P. Fishkin",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424116",
      "orcid": "missing"
    },
    {
      "name": "Anuj Gujar",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100566652",
      "orcid": "missing"
    },
    {
      "name": "Carlos Mochon",
      "institution": "Intern at Xerox PARC from the MIT Department of Physics",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100417437",
      "orcid": "missing"
    },
    {
      "name": "Roy Want",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, California",
      "img": "/do/10.1145/contrib-81450595327/rel-imgonly/81450595327.jpg",
      "acmid": "81450595327",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S. K., Mackinlay, L D., and Robertson, G. A. A Morphological Analysis of the Design Space of Input Devices. A CM Transactions on Information Systems, (2), April 1991, pp. 99-122.  ",
      "doi": "10.1145/123078.128726"
    },
    {
      "text": "Fishkin, K. P., Moron, T., and Harrison, B. L. Design Principles for Manipulative User Interfaces. Working Paper, December 1997. Xerox Palo Alto Research Center. Palo Alto, CA.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G. Situated Information Spaces and Spadally Aware Palmtop Computers, CA CM, 36(7), July 1993, pp.38-49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Fitzmaurice, G., Ishii, H., and Buxton, W. A. S. Laying the Foundations for Graspable User Interfaces. Proceedings of CHI'95, pp. 422-449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Guiard, Y. and Ferrand, T. Asymmetry in Bimannual Skills. In Manual Asymmetries in Motor Performance, Elliot &amp; Roy (eds), 1995, pp. 176-195. CRC Press, Boca Raton FL.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J. and Kassel, N. Passive Real-World Interface Props for Neurosurgical Visualization, Proceedings of CHI'94, pp. 452-458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits, and Atoms. Proceedings of CHI'97, pp. 234-241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Milgram, P. Rastogi, A., and Grodski, J. J. Telerobotie Control Using Augmented Reality. IEEE Robot and Human Communication (RO-MAN)'95, Japan, July 1995.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J. Tilting Operations for Small Screen Interfaces. Proceedings of UIST '96, pp. 167-168.  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Schilit B. N., Golovchinsky, G and Price M. Beyond Paper: Supporting Active Reading with free-form digital ink annotations. Proceedings of CHI'98.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Schneiderman, B. The Future of Interactive Systems and the Emergence of Direct Manipulation. Behaviour and information Technology, 1, 1982, pp. 237-256.",
      "doi": ""
    },
    {
      "text": "Small, D., and Ishii, H. Design of Spatially Aware Graspable Displays. Extended Abstracts of CHI'97, pp. 367-368.  ",
      "doi": "10.1145/1120212.1120437"
    },
    {
      "text": "Smith, D. C., Irby, C. H., Kimball, R., Verplank, W., and Harslem, E. Deisgning the Star User Interface. Byte 7(4), April 1982, pp. 242-282.",
      "doi": ""
    },
    {
      "text": "Taylor, A. R., Nonverbal Communications Systems in Native North America. Semiotica, 13(4), 1975, pp. 329- 374.",
      "doi": ""
    },
    {
      "text": "Want, R., Schilit, B. N., Adams, N. I., Gold, R., Petersen, K., Goldberg, D., Ellis, }'. R., and Weiser, M. An Overview of the ParcTab Ubiquitous Computing Experiment. IEEE Personal Communications, December 1995, pp. 28-43.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The Computer for the 21st Century. Scientific America, 265(3), 1991, pp. 94-104.",
      "doi": ""
    },
    {
      "text": "Wellner, P. Mackay, W., and Gold, R. Computer Augmented Environments: Back to the Real World. CA CM, 36(7), ~Iuly 1993.  ",
      "doi": "10.1145/159544.159555"
    }
  ]
}