{
  "doi": "10.1145/3173574.3174218",
  "title": "Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stiffness Actuation",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We present Haptic Links, electro-mechanically actuated physical connections capable of rendering variable stiffness between two commodity handheld virtual reality (VR) controllers. When attached, Haptic Links can dynamically alter the forces perceived between the user's hands to support the haptic rendering of a variety of two-handed objects and interactions. They can rigidly lock controllers in an arbitrary configuration, constrain specific degrees of freedom or directions of motion, and dynamically set stiffness along a continuous range. We demonstrate and compare three prototype Haptic Links: Chain, Layer-Hinge, and Ratchet-Hinge. We then describe interaction techniques and scenarios leveraging the capabilities of each. Our user evaluation results confirm that users can perceive many two-handed objects or interactions as more realistic with Haptic Links than with typical unlinked VR controllers.",
  "authors": [
    {
      "name": "Evan Strasnick",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-99659080917/rel-imgonly/headshot.jpg",
      "acmid": "99659080917",
      "orcid": "missing"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Mike Sinclair",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498872",
      "orcid": "0000-0003-4343-2332"
    },
    {
      "name": "Hrvoje Benko",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100182346/rel-imgonly/81100182346.jpg",
      "acmid": "81100182346",
      "orcid": "0000-0002-2059-3558"
    }
  ],
  "references": [
    {
      "text": "Actuonix. 2017. L12-R Micro Linear Servos for RC & Arduino. Retrieved January 1, 2017 from https://www.actuonix.com/L12-R-Linear-Servo-ForRadio-Control-p/l12-r.htm",
      "doi": ""
    },
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer. In Proc. TEI 2016, 218--226.  ",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch. In Proc. UIST 2016, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Jonathan Blake and Hakan B. Gurocak. 2009. Haptic glove with MR brakes for virtual reality. In IEEE/ASME Transactions on Mechatronics 14, 5: 606-- 615.",
      "doi": ""
    },
    {
      "text": "M Bouzit, G Burdea, G Popescu, and R Boian. 2002. The Rutgers Master II-ND Force Feedback Glove. In Proc. HAPTICS 2002, 256--263. ",
      "doi": "10.5555/795682.797508"
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-Point Mid-Air Haptic Feedback for Touch Surfaces. In Proc. UIST 2013, 505--514.  ",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Sonny Chan, François Conti, Kenneth Salisbury, and Nikolas H. Blevins. 2013. Virtual Reality Simulation in Neurosurgery. In Neurosurgery 72, January: A154-- A164.",
      "doi": ""
    },
    {
      "text": "Nadia G. Cheng, Maxim B. Lobovsky, Steven J. Keating, Adam M. Setapen, Katy I. Gero, Anette E. Hosoi, and Karl D. Iagnemma. 2012. Design and analysis of a robust, low-cost, highly articulated manipulator enabled by jamming of granular media. In Proc. ICRA 2012, 4328--4333.",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark Roman Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proc. UIST 2017, 199130.  ",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Adjunct Proc. UIST 2016, 117--119.  ",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "CyberGlove Systems Inc. 2017. CyberGrasp Glove. Retrieved January 1, 2017 from http://www.cyberglovesystems.com/cybergrasp/",
      "doi": ""
    },
    {
      "text": "CyberTouch. 2017. CyberTouch Glove. Retrieved January 1, 2017 from http://www.cyberglovesystems.com/cybertouch/",
      "doi": ""
    },
    {
      "text": "FeeTech. 2013. Standard 15kg.cm Metal Gears Analog Servo FS5115M. Retrieved January 1, 2017 from http://www.feetechrc.com/product/analogservo/standard-15kg-cm-metal-gears-analog-servofs5115m/",
      "doi": ""
    },
    {
      "text": "Yves Guiard. 1987. Asymmetric Division of Labor in Human Skilled Bimanual Action. In Journal of Motor Behavior 19, 4: 486--517.",
      "doi": ""
    },
    {
      "text": "Sidhant Gupta, Tim Campbell, Jeffrey R. Hightower, and Shwetak N. Patel. 2010. SqueezeBlock: Using virtual springs in mobile devices for eyes-free interaction. In Proc. UIST 2010, 101--104.  ",
      "doi": "10.1145/1866029.1866046"
    },
    {
      "text": "Haption SA. 2017. Haption Virtuose 6D. Retrieved January 1, 2017 from https://www.haption.com/site/index.php/en/productsmenu-en/hardware-menu-en/virtuose-6d-menu-en",
      "doi": ""
    },
    {
      "text": "HTC. 2017. Vive. Retrieved January 1, 2017 from https://www.vive.com/us/product/vive-virtual-realitysystem/",
      "doi": ""
    },
    {
      "text": "O Khatib, X Yeh, G Brantner, B Soe, B Kim, S Ganguly, H Stuart, S Wang, M Cutkosky, A Edsinger, P Mullins, M Barham, C R Voolstra, K N Salama, M L'Hour, and V Creuze. 2016. Ocean One: A Robotic Avatar for Oceanic Discovery. In IEEE Robotics Automation Magazine 23, 4: 20--29.",
      "doi": ""
    },
    {
      "text": "Yong Jae Kim, Shanbao Cheng, Sangbae Kim, and Karl Iagnemma. 2012. Design of a tubular snake-like manipulator with stiffening capability by layer jamming. In Proc. IROS 2012, 4251--4256.",
      "doi": ""
    },
    {
      "text": "Yukari Konishi, Nobuhisa Hanamitsu, Kouta Minamizawa, Ayahiko Sato, and Tetsuya Mizuguchi. 2016. Synesthesia suit: the full body immersive experience. In ACM SIGGRAPH 2016 VR Village, 20.  ",
      "doi": "10.1145/2929490.2932629"
    },
    {
      "text": "A. Kron, G. Schmidt, B. Petzold, M.I. Zah, P. Hinterseer, and E. Steinbach. 2004. Disposal of explosive ordnances by use of a bimanual haptic telepresence system. In Proc. ICRA 2004, 1968--1973.",
      "doi": ""
    },
    {
      "text": "Jaedong Lee, Youngsun Kim, and Gerard Kim. 2012. Funneling and saltation effects for tactile interaction with virtual objects. In Proc. CHI 2012, 3141.  ",
      "doi": "10.1145/2207676.2208729"
    },
    {
      "text": "Richard Q der Linde, Piet Lammertse, Erwin Frederiksen, and B Ruiter. 2002. The HapticMaster, a new high-performance haptic interface. In Proc. Eurohaptics 2002, 1--5.",
      "doi": ""
    },
    {
      "text": "Michael A Liss and E M McDougall. 2013. Robotic surgical simulation. In Cancer Journal (United States) 19, 2: 124--129.",
      "doi": ""
    },
    {
      "text": "Mariangela Manti, Vito Cacucciolo, and Matteo Cianchetti. 2016. Stiffening in soft robotics: A review of the state of the art. In IEEE Robotics and Automation Magazine 23, 3: 93--106.",
      "doi": ""
    },
    {
      "text": "Thomas H. Massie and J. K. Salisbury. 1994. The PHANTOM Haptic Interface: A Device for Probing Virtual Objects. In Proceedings of the ASME Dynamic Systems and Control Division 1994, 295--301.",
      "doi": ""
    },
    {
      "text": "Takashi Mitsuda, Sachiko Kuge, Masato Wakabayashi, and Sadao Kawamura. 2002. Wearable haptic display by the use of a Particle Mechanical Constraint. In Proc. HAPTICS 2002, 153--158. ",
      "doi": "10.5555/795682.797507"
    },
    {
      "text": "Yusuke Nakagawa, Akiya Kamimura, and Yoichiro Kawaguchi. 2012. MimicTile: A Variable Stiffness Deformable User Interface for Mobile Devices. In Proc. CHI 2012, 745--748.  ",
      "doi": "10.1145/2207676.2207782"
    },
    {
      "text": "Novint. Novint Falcon. Retrieved January 1, 2017 from http://www.novint.com/index.php/novintfalcon",
      "doi": ""
    },
    {
      "text": "Oculus. 2017. Oculus Rift. Retrieved from https://www.oculus.com/rift/",
      "doi": ""
    },
    {
      "text": "Oculus. 2017. Getting Started With Your Rock Band VR Connector. Retrieved from https://www.youtube.com/watch?v=HIEkqmmSWos",
      "doi": ""
    },
    {
      "text": "Angelika Peer and Martin Buss. 2008. A new admittance-type haptic interface for bimanual manipulations. In IEEE/ASME Transactions on Mechatronics 13, 4: 416--428.",
      "doi": ""
    },
    {
      "text": "PJRC. 2017. Teensy USB Development Board. Retrieved January 1, 2017 from https://www.pjrc.com/teensy/index.html",
      "doi": ""
    },
    {
      "text": "ProTubeVR. 2017. ProTubeVR. Retrieved January 1, 2017 from https://www.protubevr.com/productpage/copie-de-protubevr-for-htc-vive-and-oculus-riftinside-ue",
      "doi": ""
    },
    {
      "text": "Jukka Raisamo. 2010. Vibrotactile Movement and Its Applications for Virtual Reality. In PIVE 2010, 25--27.",
      "doi": ""
    },
    {
      "text": "Hitec RCD. 2017. HS-35HD Ultra Nano Servo. Retrieved January 1, 2017 from http://hitecrcd.com/products/servos/micro-and-miniservos/analog-micro-and-mini-servos/hs-35hd-ultranano-servo/product",
      "doi": ""
    },
    {
      "text": "R. M. Sage. 1987. The mathematical modeling of ball joints with friction. Thesis. University of Leicester, Leicester, United Kingdom. http://hdl.handle.net/2381/34822",
      "doi": ""
    },
    {
      "text": "Jessie Lee C. Santiago, Isuru S. Godage, Phanideep Gonthina, and Ian D. Walker. 2016. Soft Robots and Kangaroo Tails: Modulating Compliance in Continuum Structures Through Mechanical Layer Jamming. In Soft Robotics 3, 2: 54--63.",
      "doi": ""
    },
    {
      "text": "Samuel B. Schorr and Allison M. Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proc. CHI 2017, 3115--3119.  ",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Timothy M. Simon, Ross T. Smith, and Bruce H. Thomas. 2014. Wearable jamming mitten for virtual environment haptics. In Proceedings of the 2014 ACM International Symposium on Wearable Computers, 67-- 70.  ",
      "doi": "10.1145/2634317.2634342"
    },
    {
      "text": "Christian Steins, Sean Gustafson, Christian Holz, and Patrick Baudisch. 2013. Imaginary devices: Gesturebased interaction mimicking traditional input devices. In Proc. MobileHCI 2013, 123.  ",
      "doi": "10.1145/2493190.2493208"
    },
    {
      "text": "Anthony Talvas, Maud Marchal, Gabriel Cirio, and L Anatole. 2013. 3D Interaction Techniques for Bimanual Haptics in Virtual Environments. In Multi-finger Haptic Interaction, 31--53.",
      "doi": ""
    },
    {
      "text": "Dzmitry Tsetserukou. 2011. FlexTorque, FlexTensor, and HapticEye: Exoskeleton Haptic Interfaces for Augmented Interaction. In Proceedings of the 2nd Augmented Human International Conference, 33:1--33:2.  ",
      "doi": "10.1145/1959826.1959859"
    },
    {
      "text": "Dzmitry Tsetserukou, Shotaro Hosokawa and Kazuhiko Terashima. 2014. LinkTouch: A wearable haptic device with five-bar linkage mechanism for presentation of two-DOF force feedback at the fingerpad. In Proc. HAPTICS 2014, 307--312.",
      "doi": ""
    },
    {
      "text": "B. Vanderborght, A. Albu-Schaeffer, A. Bicchi, E. Burdet, D. G. Caldwell, R. Carloni, M. Catalano, O. Eiberger, W. Friedl, G. Ganesh, M. Garabini, M. Grebenstein, G. Grioli, S. Haddadin, H. Hoppner, A. Jafari, M. Laffranchi, D. Lefeber, F. Petit, S. Stramigioli, N. Tsagarakis, M. Van Damme, R. Van Ham, L. C. Visser, and S. Wolf. 2013. Variable impedance actuators: A review. In Robotics and Autonomous Systems 61, 12: 1601--1614.  ",
      "doi": "10.1016/j.robot.2013.06.009"
    },
    {
      "text": "VR Merch. 2017. HTC Vive Dual Controller Rifle Stock. Retrieved January 1, 2017 from https://vrmerch.com/products/htc-vive-dual-controllerrifle-stock",
      "doi": ""
    },
    {
      "text": "VR Merch. 2017. HTC Vive Golf Club Attachment. Retrieved January 1, 2017 from https://vrmerch.com/products/htc-vive-controller-golfclub",
      "doi": ""
    },
    {
      "text": "Ying Wei, Yonghua Chen, Yang Yang, and Yingtian Li. 2016. A soft robotic spine with tunable stiffness based on integrated ball joint and particle jamming. In Mechatronics 33: 84--92.",
      "doi": ""
    },
    {
      "text": "Kotaro Yamaguchi, Ginga Kato, Yoshihiro Kuroda, Kiyoshi Kiyokawa, and Haruo Takemura. 2016. A Non-grounded and Encountered-type Haptic Display Using a Drone. In Proceedings of the 2016 Symposium on Spatial User Interaction, 43--46.  ",
      "doi": "10.1145/2983310.2985746"
    },
    {
      "text": "Vibol Yem and Hiroyuki Kajimoto. 2017. Wearable tactile device using mechanical and electrical stimulation for fingertip interaction with virtual world. In Proc. IEEE Virtual Reality 2017, 99--104.",
      "doi": ""
    }
  ]
}