{
  "doi": "10.1145/3173574.3173709",
  "title": "Pocket Transfers: Interaction Techniques for Transferring Content from Situated Displays to Mobile Devices",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "We present Pocket Transfers: interaction techniques that allow users to transfer content from situated displays to a personal mobile device while keeping the device in a pocket or bag. Existing content transfer solutions require direct manipulation of the mobile device, making inter-action slower and less flexible. Our introduced tech-niques employ touch, mid-air gestures, gaze, and a mul-timodal combination of gaze and mid-air gestures. We evaluated the techniques in a novel user study (N=20), where we considered dynamic scenarios where the user approaches the display, completes the task, and leaves. We show that all pocket transfer techniques are fast and seen as highly convenient. Mid-air gestures are the most efficient touchless method for transferring a single item, while the multimodal method is the fastest touchless method when multiple items are transferred. We provide guidelines to help researchers and practitioners choose the most suitable content transfer techniques for their systems.",
  "tags": [
    "content transfer",
    "ubiquitous computing",
    "cross-device interaction",
    "public displays",
    "multimodal",
    "gaze",
    "mid-air gestures"
  ],
  "authors": [
    {
      "name": "Ville Mäkelä",
      "institution": "University of Tampere & LMU Munich, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758718057",
      "orcid": "0000-0001-6095-2570"
    },
    {
      "name": "Mohamed Khamis",
      "institution": "LMU Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-99659272366/rel-imgonly/22_-_287_computing_science_staff_mohamad_khamis_0058.jpg",
      "acmid": "99659272366",
      "orcid": "0000-0001-7051-5200"
    },
    {
      "name": "Lukas Mecke",
      "institution": "LMU Munich & Munich University of Applied Sciences, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659035193",
      "orcid": "missing"
    },
    {
      "name": "Jobin James",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019625",
      "orcid": "missing"
    },
    {
      "name": "Markku Turunen",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100155914",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "LMU Munich & Munich University of Applied Sciences, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Florian Alt, Alireza Sahami Shirazi, Thomas Kubitza, and Albrecht Schmidt. 2013. Interaction techniques for creating and exchanging content with public displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1709--1718.  ",
      "doi": "10.1145/2470654.2466226"
    },
    {
      "text": "Gregor Broll, Wolfgang Reithmeier, Paul Holleis, and Matthias Wagner. 2010. Design and evaluation of techniques for mobile interaction with dynamic NFCdisplays. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, New York, NY, USA, 205--212.  ",
      "doi": "10.1145/1935701.1935743"
    },
    {
      "text": "Ishan Chatterjee, Robert Xiao, and Chris Harrison. 2015. Gaze+Gesture: Expressive, Precise and Targeted Free-Space Interactions. In Proceedings of the 2015 ACM on International Conference on Multimodal Interaction (ICMI '15). ACM, New York, NY, USA, 131--138.  ",
      "doi": "10.1145/2818346.2820752"
    },
    {
      "text": "Heiko Drewes. 2010. Eye Gaze Tracking for Human Computer Interaction. Ph.D Dissertation. LMU München: Faculty of Mathematics, Computer Science and Statistics, München, Germany.",
      "doi": ""
    },
    {
      "text": "Kathrin Gerling, Ian Livingston, Lennart Nacke, and Regan Mandryk. 2012. Full-body motion-based game interaction for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 18731882.  ",
      "doi": "10.1145/2207676.2208324"
    },
    {
      "text": "Jeremy Hales, David Rozado, and Diako Mardanbegi. 2013. Interacting with objects in the environment by gaze and hand gestures. In Proceedings of the 3rd International Workshop on Pervasive Eye Tracking and Mobile Eye-Based Interaction (PETMEI '13), 1--9",
      "doi": ""
    },
    {
      "text": "Robert Hardy and Enrico Rukzio. 2008. Touch & interact: touch-based interaction of mobile phones with displays. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI '08). ACM, New York, NY, USA, 245--254.  ",
      "doi": "10.1145/1409240.1409267"
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed endurance: a metric to quantify arm fatigue of mid-air interactions. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, New York, NY, USA, 1063--1072.  ",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Robert J. K. Jacob. 1990. What you look at is what you get: eye movement-based interaction techniques. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90), Jane Carrasco Chew and John Whiteside (Eds.). ACM, New York, NY, USA, 11--18.  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Svebor Karaman, Andrew D. Bagdanov, Lea Landucci, Gianpaolo D'Amico, Andrea Ferracani, Daniele Pezzatini, and Alberto Del Bimbo. 2016. Personalized multimedia content delivery on an interactive table by passive observation of museum visitors. Multimedia Tools and Applications, 75(7), 3787--3811.  ",
      "doi": "10.1007/s11042-014-2192-y"
    },
    {
      "text": "Mohamed Khamis, Ozan Saltuk, Alina Hang, Katharina Stolz, Andreas Bulling, and Florian Alt. 2016. TextPursuits: using text for pursuits-based interaction and calibration on public displays. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 274--285.  ",
      "doi": "10.1145/2971648.2971679"
    },
    {
      "text": "Mohamed Khamis, Axel Hoesl, Alexander Klimczak, Martin Reiss, Florian Alt, and Andreas Bulling. 2017. EyeScout: Active Eye Tracking for Position and Movement Independent Gaze Interaction with Large Public Displays. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 155--166.  ",
      "doi": "10.1145/3126594.3126630"
    },
    {
      "text": "Ricardo Langner, Ulrich von Zadow, Tom Horak, Annett Mitschick, and Raimund Dachselt. 2016. Content Sharing Between Spatially-Aware Mobile Phones and Large Vertical Displays Supporting Collaborative Work.In Collaboration Meets Interactive Spaces, Craig Anslow, Pedro Campos, and Joaquim Jorge (eds). Springer, Cham, Switzerland, 75--96.",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay. 2002. Which interaction technique works when?: floating palettes, marking menus and toolglasses support different task strategies. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '02), Maria De Marsico, Stefano Levialdi, and Emanuele Panizzi (Eds.). ACM, New York, NY, USA, 203--208.  ",
      "doi": "10.1145/1556262.1556294"
    },
    {
      "text": "Päivi Majaranta, Anne Aula, and Kari-Jouko Räihä. 2004. Effects of feedback on eye typing with a short dwell time. In Proceedings of the 2004 symposium on Eye tracking research & applications (ETRA '04). ACM, New York, NY, USA, 139--146.  ",
      "doi": "10.1145/968363.968390"
    },
    {
      "text": "Ville Mäkelä, Hannu Korhonen, Jarno Ojala, Antti Järvi, Kaisa Väänänen, Roope Raisamo, and Markku Turunen. 2016. Investigating mid-air gestures and handhelds in motion tracked environments. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, New York, NY, USA, 45--51.  ",
      "doi": "10.1145/2914920.2915015"
    },
    {
      "text": "Ville Mäkelä, Jobin James, Tuuli Keskinen, Jaakko Hakulinen, and Markku Turunen. 2017. \"It's Natural to Grab and Pull\": Retrieving Content from Large Displays Using Mid-Air Gestures. IEEE Pervasive Computing 16(3), 70--77.",
      "doi": "10.1109/MPRV.2017.2940966"
    },
    {
      "text": "Daniel Michelis and Jörg Müller. 2011. The Audience Funnel: Observations of Gesture Based Interaction with Multiple Large Displays in a City Center. International Journal of Human-Computer Interaction 27(6), 562--579.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Anqi Huang, Andreas Paepcke, and Terry Winograd. 2006. Cooperative gestures: multi-user gestural interactions for co-located groupware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 1201--1210.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Martez E. Mott, Shane Williams, Jacob O. Wobbrock, and Meredith Ringel Morris. 2017. Improving DwellBased Gaze Typing with Dynamic, Cascading Dwell Times. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2558--2570.  ",
      "doi": "10.1145/3025453.3025517"
    },
    {
      "text": "Jörg Müller, Gilles Bailly, Thor Bossuyt, and Niklas Hillgren. 2014. MirrorTouch: combining touch and mid-air gestures for public displays. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, New York, NY, USA, 319--328.  ",
      "doi": "10.1145/2628363.2628379"
    },
    {
      "text": "Pai Chet Ng, James She, Kang Eun Jeon, and Matthias Baldauf. 2017. When Smart Devices Interact With Pervasive Screens: A Survey. ACM Trans. Multimedia Comput. Commun. Appl. 13, 4, Article 55 (August 2017), 23 pages.  ",
      "doi": "10.1145/3115933"
    },
    {
      "text": "Mark Perry, Steve Beckett, Kenton O'Hara, and Sriram Subramanian. 2010. WaveWindow: public, performative gestural interaction. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, New York, NY, USA, 109--112.  ",
      "doi": "10.1145/1936652.1936672"
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, Ming Ki Chong, and Hans Gellersen. 2014. Gaze-touch: combining gaze with multi-touch for interaction on the same surface. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 509--518.  ",
      "doi": "10.1145/2642918.2647397"
    },
    {
      "text": "Kathy Ryall, Clifton Forlines, Chia Shen, Meredith Ringel Morris, and Katherine Everitt. 2006. Experiences with and Observations of Direct-Touch Tabletops. In Proceedings of the First IEEE International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP '06). IEEE Computer Society, Washington, DC, USA, 89--96.  ",
      "doi": "10.1109/TABLETOP.2006.12"
    },
    {
      "text": "Khoovirajsingh Seewoonauth, Enrico Rukzio, Robert Hardy, and Paul Holleis. 2009. Touch & connect and touch & select: interacting with a computer by touching it with a mobile phone. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, USA,, Article 36, 9 pages.  ",
      "doi": "10.1145/1613858.1613905"
    },
    {
      "text": "Linda E. Sibert and Robert J. K. Jacob. 2000. Evaluation of eye gaze interaction. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 281288.  ",
      "doi": "10.1145/332040.332445"
    },
    {
      "text": "Sophie Stellmach and Raimund Dachselt. 2013. Still looking: investigating seamless gaze-supported selection, positioning, and manipulation of distant targets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 285--294.  ",
      "doi": "10.1145/2470654.2470695"
    },
    {
      "text": "Jayson Turner, Jason Alexander, Andreas Bulling, Dominik Schmidt, Hand Gellersen. 2013. Eye Pull, Eye Push: Moving Objects between Large Screens and Personal Devices with Gaze and Touch. In: Kotzé P., Marsden G., Lindgaard G., Wesson J., Winckler M. (eds) Human-Computer Interaction -- INTERACT 2013. INTERACT 2013. Lecture Notes in Computer Science, vol 8118. Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "Jayson Turner, Andreas Bulling, Jason Alexander, and Hans Gellersen. 2013. Eye drop: an interaction concept for gaze-supported point-to-point content transfer. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, New York, NY, USA, Article 37, 4 pages.  ",
      "doi": "10.1145/2541831.2541868"
    },
    {
      "text": "Jayson Turner, Andreas Bulling, Jason Alexander, and Hans Gellersen. 2014. Cross-device gaze-supported point-to-point content transfer. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '14). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/2578153.2578155"
    },
    {
      "text": "Nina Valkanova, Robert Walter, Andrew Vande Moere, and Jörg Müller. 2014. MyPosition: sparking civic discourse by a public interactive poll visualization. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1323--1332.  ",
      "doi": "10.1145/2531602.2531639"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST '04). ACM, New York, NY, USA, 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Julie R. Williamson and John Williamson. 2014. Analysing Pedestrian Traffic Around Public Displays. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14), Sven Gehring (Ed.). ACM, New York, NY, USA,, Pages 13, 6 pages.  ",
      "doi": "10.1145/2611009.2611022"
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2014. CrossMotion: Fusing Device and Image Motion for User Identification, Tracking and Device Association. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 216--223.  ",
      "doi": "10.1145/2663204.2663270"
    }
  ]
}