{
  "doi": "10.1145/3173574.3173611",
  "title": "TopoText: Context-Preserving Text Data Exploration Across Multiple Spatial Scales",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "TopoText is a context-preserving technique for visualizing text data for multi-scale spatial aggregates to gain insight into spatial phenomena. Conventional exploration requires users to navigate across multiple scales but only presents the information related to the current scale. This limitation potentially adds more steps of interaction and cognitive overload to the users. TopoText renders multi-scale aggregates into a single visual display combining novel text-based encoding and layout methods that draw labels along the boundary or filled within the aggregates. The text itself not only summarizes the semantics at each individual scale, but also indicates the spatial coverage of the aggregates and their underlying hierarchical relationships. We validate TopoText with both a user study as well as several application examples.",
  "tags": [
    "typographic map",
    "text visualization",
    "multi-scale analysis",
    "geospatial visualization",
    "context preservation"
  ],
  "authors": [
    {
      "name": "Jiawei Zhang",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659137199",
      "orcid": "missing"
    },
    {
      "name": "Chittayong Surakitbanharn",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488671078",
      "orcid": "missing"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    },
    {
      "name": "Ross Maciejewski",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363590851",
      "orcid": "missing"
    },
    {
      "name": "Zhenyu Qian",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958852457",
      "orcid": "missing"
    },
    {
      "name": "David S. Ebert",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100113675",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Shehzad Afzal, Ross Maciejewski, Yun Jang, Niklas Elmqvist, and David S Ebert. 2012. Spatial text visualization using automatic typographic maps. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2556--2564.  ",
      "doi": "10.1109/TVCG.2012.264"
    },
    {
      "text": "Eric Carlson Alexander, Chih-Ching Chang, Mariana Shimabukuro, Steve Franconeri, Christopher Collins, and Michael Gleicher. 2017. Perceptual Biases in Font Size as a Data Encoding. IEEE transactions on visualization and computer graphics PP, 99 (2017), 1--1.",
      "doi": ""
    },
    {
      "text": "Bilal Alsallakh, Luana Micallef, Wolfgang Aigner, Helwig Hauser, Silvia Miksch, and Peter Rodgers. 2014. Visualizing sets and set-typed data: State-of-the-art and future challenges. In Proceedings of the IEEE VGTC/EuroGraphics Conference on Visualization. 1--21.",
      "doi": ""
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In Proceedings of the IEEE Symposium on Information Visualization. IEEE, 111--117.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Gennady Andrienko, Natalia Andrienko, Harald Bosch, Thomas Ertl, Georg Fuchs, Piotr Jankowski, and Dennis Thom. 2013. Thematic patterns in georeferenced tweets through space-time visual analytics. Computing in Science & Engineering 15, 3 (2013), 72--82.  ",
      "doi": "10.1109/MCSE.2013.70"
    },
    {
      "text": "Caroline Appert and Jean-Daniel Fekete. 2006. OrthoZoom scroller: 1D multi-scale navigation. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, 21--30.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "Harald Bosch, Dennis Thom, Florian Heimerl, Edwin Puttmann, Stephan Koch, Robert Kruger, Michael Worner, and Thomas Ertl. 2013. Scatterblogs2: Real-time monitoring of microblog messages through user-guided filtering. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2022--2031.  ",
      "doi": "10.1109/TVCG.2013.186"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Richard Brath and Ebad Banissi. 2016a. Typographic sets: Labeled set elements with font attributes. In International Workshop on Set Visualization and Reasoning. 29--43.",
      "doi": ""
    },
    {
      "text": "Richard Brath and Ebad Banissi. 2016b. Using Typography to Expand the Design Space of Data Visualization. She Ji: The Journal of Design, Economics, and Innovation 2, 1 (2016), 59--87.",
      "doi": ""
    },
    {
      "text": "Cynthia Brewer. 2004. Designing Better Maps: A Guide for GIS Users. Environmental Systems Research. ",
      "doi": "10.5555/993697"
    },
    {
      "text": "Junghoon Chae, Yuchen Cui, Yun Jang, Guizhen Wang, Abish Malik, and David S. Ebert. 2015. Trajectory-based Visual Analytics for Anomalous Human Movement Analysis using Social Media. In Proceedings of the EuroVis Workshop on Visual Analytics. The Eurographics Association.",
      "doi": ""
    },
    {
      "text": "Ming-Te Chi, Shih-Syun Lin, Shiang-Yi Chen, Chao-Hung Lin, and Tong-Yee Lee. 2015. Morphable word clouds for time-varying text data visualization. IEEE Transactions on Visualization and Computer Graphics 21, 12 (2015), 1415--1426.  ",
      "doi": "10.1109/TVCG.2015.2440241"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B Bederson. 2009. A review of overview+detail, zooming, and focus+context interfaces. ACM Computing Surveys (CSUR) 41, 1 (2009), 2.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Edward G Coffman Jr, Michael R Garey, and David S Johnson. 1984. Approximation algorithms for bin-packing: an updated survey. In Algorithm design for computer system design. Springer, 49--106.",
      "doi": ""
    },
    {
      "text": "Christopher Collins, Sheelagh Carpendale, and Gerald Penn. 2009a. DocuBurst: Visualizing Document Content Using Language Structure. Computer Graphics Forum 28, 3 (2009), 1039--1046.  ",
      "doi": "10.1111/j.1467-8659.2009.01439.x"
    },
    {
      "text": "Christopher Collins, Fernanda B Viegas, and Martin Wattenberg. 2009b. Parallel tag clouds to explore and analyze faceted text corpora. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. IEEE, 91--98.",
      "doi": ""
    },
    {
      "text": "Weiwei Cui, Yingcai Wu, Shixia Liu, Furu Wei, Michelle X. Zhou, and Huamin Qu. 2010. Context preserving dynamic word cloud visualization. In Proceedings of the IEEE Pacific Symposium on Visualization. 121--128.",
      "doi": ""
    },
    {
      "text": "Jean-Yves Delort. 2010. Vizualizing large spatial datasets in interactive maps. In Proceedings of the International Conference on Advanced Geographic Information Systems, Applications, and Services. IEEE, 33--38.  ",
      "doi": "10.1109/GEOProcessing.2010.13"
    },
    {
      "text": "Marian Dörk, Sheelagh Carpendale, Christopher Collins, and Carey Williamson. 2008. VisGets: Coordinated visualizations for web-based information exploration and discovery. IEEE Transactions on Visualization and Computer Graphics 14, 6 (2008), 1205--1212.  ",
      "doi": "10.1109/TVCG.2008.175"
    },
    {
      "text": "Herbert Edelsbrunner and Roman Waupotitsch. 1997. A combinatorial approach to cartograms. Computational Geometry 7, 5--6 (1997), 343--360.  ",
      "doi": "10.1016/S0925-7721%2896%2900006-5"
    },
    {
      "text": "Niklas Elmqvist and Jean-Daniel Fekete. 2010. Hierarchical aggregation for information visualization: Overview, techniques, and design guidelines. IEEE Transactions on Visualization and Computer Graphics 16, 3 (2010), 439--454.  ",
      "doi": "10.1109/TVCG.2009.84"
    },
    {
      "text": "Cristian Felix, Anshul Vikram Pandey, and Enrico Bertini. 2017. TextTile: An Interactive Visualization Tool for Seamless Exploratory Analysis of Structured Data and Unstructured Text. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 161--170.  ",
      "doi": "10.1109/TVCG.2016.2598447"
    },
    {
      "text": "Nivan Ferreira, Lauro Lins, Daniel Fink, Steve Kelling, Chris Wood, Juliana Freire, and Claudio Silva. 2011. BirdVis: Visualizing and understanding bird populations. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2374--2383.  ",
      "doi": "10.5555/2068462.2068640"
    },
    {
      "text": "Alex Godwin, Yongxin Wang, and John Stasko. 2017. TypoTweet Maps: Characterizing Urban Areas through Typographic Social Media Visualization. In Proceedings of the IEEE VGTC/EuroGraphics Conference on Visualization. 25--29.",
      "doi": ""
    },
    {
      "text": "Sarah Goodwin, Jason Dykes, Aidan Slingsby, and Cagatay Turkay. 2016. Visualizing multiple variables across scale and geography. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 599--608.",
      "doi": "10.1109/TVCG.2015.2467199"
    },
    {
      "text": "Florian Heimerl, Markus John, Qi Han, Steffen Koch, and Thomas Ertl. 2016. DocuCompass: Effective exploration of document landscapes. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. IEEE, 11--20.",
      "doi": ""
    },
    {
      "text": "Eduard Imhof. 1975. Positioning names on maps. The American Cartographer 2, 2 (1975), 128--144.",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Pierre Dragicevic, Wesley Willett, Anastasia Bezerianos, and Jean-Daniel Fekete. 2013. Hybrid-image visualization for large viewing environments. IEEE transactions on visualization and computer graphics 19, 12 (2013), 2346--2355.  ",
      "doi": "10.1109/TVCG.2013.163"
    },
    {
      "text": "Waqas Javed, Sohaib Ghani, and Niklas Elmqvist. 2012a. GravNav: Using a gravity model for multi-scale navigation. In Proceedings of the ACM Conference on Advanced Visual Interfaces. ACM, 217--224.  ",
      "doi": "10.1145/2254556.2254597"
    },
    {
      "text": "Waqas Javed, Sohaib Ghani, and Niklas Elmqvist. 2012b. PolyZoom: multiscale and multifocus exploration in 2D visual spaces. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 287--296.  ",
      "doi": "10.1145/2207676.2207716"
    },
    {
      "text": "Susanne Jul and George W. Furnas. 1998. Critical Zones in Desert Fog: Aids to Multiscale Navigation. In Proceedings of the ACM Symposium on User Interface Software and Technology. 97--106.  ",
      "doi": "10.1145/288392.288578"
    },
    {
      "text": "KyungTae Kim, Sungahn Ko, Niklas Elmqvist, and David S Ebert. 2011. WordBridge: Using composite tag clouds in node-link diagrams for visualizing content and relations in text corpora. In Proceedings of the Hawaii International Conference on System Sciences. 1--8.  ",
      "doi": "10.1109/HICSS.2011.499"
    },
    {
      "text": "Minjeong Kim, Kyeongpil Kang, Deokgun Park, Jaegul Choo, and Niklas Elmqvist. 2017. TopicLens: Efficient multi-level visual topic exploration of large-scale document collections. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 151--160.  ",
      "doi": "10.1109/TVCG.2016.2598445"
    },
    {
      "text": "Etien L. Koua, Alan MacEachren, and M.-J. Kraak. 2006. Evaluating the usability of visualization methods in an exploratory geovisualization environment. International Journal of Geographical Information Science 20, 4 (2006), 425--448.",
      "doi": ""
    },
    {
      "text": "Nina Siu-Ngan Lam and Dale A. Quattrochi. 1992. On the issues of scale, resolution, and fractal analysis in the mapping sciences. The Professional Geographer 44, 1 (1992), 88--98.",
      "doi": ""
    },
    {
      "text": "Shixia Liu, Jialun Yin, Xiting Wang, Weiwei Cui, Kelei Cao, and Jian Pei. 2016. Online visual analytics of text streams. IEEE transactions on visualization and computer graphics 22, 11 (2016), 2451--2466.",
      "doi": "10.1109/TVCG.2015.2509990"
    },
    {
      "text": "Wanyu Liu, Rafael Lucas DÓliveira, Michel Beaudouin-Lafon, and Olivier Rioul. 2017. BIGnav: Bayesian Information Gain for Guiding Multiscale Navigation. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 5869--5880.  ",
      "doi": "10.1145/3025453.3025524"
    },
    {
      "text": "Steffen Lohmann, Florian Heimerl, Fabian Bopp, Michael Burch, and Thomas Ertl. 2015. ConcentriCloud: Word cloud visualization for multiple text documents. In Proceedings of the International Conference on Information Visualization. 114--120.  ",
      "doi": "10.1109/iV.2015.30"
    },
    {
      "text": "Alan M. MacEachren. 1995. How Maps Work: Representation, Visualization, and Design. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Ron Maharik, Mikhail Bessmeltsev, Alla Sheffer, Ariel Shamir, and Nathan Carr. 2011. Digital Micrography. In ACM Transactions on Graphics. 100:1--100:12.  ",
      "doi": "10.1145/2010324.1964995"
    },
    {
      "text": "Axis Maps. 2017. Typographic maps. http://store.axismaps.com/. (2017). Accessed: 2017-08--15.",
      "doi": ""
    },
    {
      "text": "Stanley Milgram. 1976. Psychological maps of Paris. Environmental psychology: People and their physical settings (1976), 104--124.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC Press.",
      "doi": ""
    },
    {
      "text": "Miguel Nacenta, Uta Hinrichs, and Sheelagh Carpendale. 2012. FatFonts: combining the symbolic and visual aspects of numbers. In Proceedings of the ACM Conference on Advanced Visual Interfaces. ACM, 407--414.  ",
      "doi": "10.1145/2254556.2254636"
    },
    {
      "text": "Dinh-Quyen Nguyen and Heidrun Schumann. 2010. Taggram: Exploring geo-data on maps through a tag cloud-based visualization. In Proceedings of the International Conference on Information Visualization. 322--328.  ",
      "doi": "10.1109/IV.2010.52"
    },
    {
      "text": "Dinh Quyen Nguyen, Christian Tominski, Heidrun Schumann, and Tuan Anh Ta. 2011. Visualizing tags with spatiotemporal references. In Proceedings of the International Conference on Information Visualization. 32--39.  ",
      "doi": "10.1109/IV.2011.43"
    },
    {
      "text": "Victoria Rautenbach, Serena Coetzee, and Arzu Çöltekin. 2016. Development and evaluation of a specialized task taxonomy for spatial planning - A map literacy experiment with topographic maps. ISPRS Journal of Photogrammetry and Remote Sensing 127 (2016), 16--26.",
      "doi": ""
    },
    {
      "text": "Aidan Slingsby, Jason Dykes, Jo Wood, and Keith Clarke. 2007. Interactive tag maps and tag clouds for the multiscale exploration of large spatio-temporal datasets. In Proceedings of the International Conference on Information Visualization. 497--504.  ",
      "doi": "10.1109/IV.2007.71"
    },
    {
      "text": "Jonathan Stott, Peter Rodgers, Juan Carlos Martinez-Ovando, and Stephen G Walker. 2011. Automatic metro map layout using multicriteria optimization. IEEE Transactions on Visualization and Computer Graphics 17, 1 (2011), 101--114.  ",
      "doi": "10.1109/TVCG.2010.24"
    },
    {
      "text": "Cagatay Turkay, Aidan Slingsby, Helwig Hauser, Jo Wood, and Jason Dykes. 2014. Attribute signatures: Dynamic visual summaries for analyzing multivariate geographical data. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 2033--2042.",
      "doi": ""
    },
    {
      "text": "David Wong. 2009. The modifiable areal unit problem (MAUP). The SAGE Handbook of Spatial Analysis (2009), 105--123.",
      "doi": ""
    },
    {
      "text": "Pak Chung Wong, Patrick Mackey, Ken Perrine, James Eagan, Harlan Foote, and Jim Thomas. 2005. Dynamic visualization of graphs with extended labels. In Proceedings of the IEEE Symposium on Information Visualization. 73--80.  ",
      "doi": "10.1109/INFOVIS.2005.11"
    },
    {
      "text": "Jo Wood, Jason Dykes, Aidan Slingsby, and Keith Clarke. 2007. Interactive visual exploration of a large spatio-temporal dataset: Reflections on a geovisualization mashup. IEEE Transactions on Visualization and Computer Graphics 13, 6 (2007), 1176--1183.  ",
      "doi": "10.1109/TVCG.2007.70570"
    },
    {
      "text": "Jie Xu and Craig S. Kaplan. 2007. Calligraphic Packing. In Proceedings of Graphics Interface. 43--50.  ",
      "doi": "10.1145/1268517.1268527"
    },
    {
      "text": "Jiawei Zhang, Benjamin Ahlbrand, Abish Malik, Junghoon Chae, Zhiyu Min, Sungahn Ko, and David S. Ebert. 2016. A Visual Analytics Framework for Microblog Data Analysis at Multiple Scales of Aggregation. Computer Graphics Forum 35, 3 (2016), 441--450.  ",
      "doi": "10.5555/3071534.3071581"
    },
    {
      "text": "Jiawei Zhang, Abish Malik, Benjamin Ahlbrand, Niklas Elmqvist, Ross Maciejewski, and David S. Ebert. 2017. TopoGroups: Context-Preserving Visual Illustration of Multi-Scale Spatial Aggregates. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 2940--2951.  ",
      "doi": "10.1145/3025453.3025801"
    }
  ]
}