{
  "doi": "10.1145/3173574.3173680",
  "title": "Measuring the “Why” of Interaction: Development and Validation of the User Motivation Inventory (UMI)",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Motivation is a fundamental concept in understanding people's experiences and behavior. Yet, motivation to engage with an interactive system has received only limited attention in HCI. We report the development and validation of the User Motivation Inventory (UMI). The UMI is an 18-item multidimensional measure of motivation, rooted in self-determination theory (SDT). It is designed to measure intrinsic motivation, integrated, identified, introjected, and external regulation, as well as amotivation. Results of two studies (total N = 941) confirm the six-factor structure of the UMI with high reliability, as well as convergent and discriminant validity of each subscale. Relationships with core concepts such as need satisfaction, vitality, and usability were studied. Additionally, the UMI was found to detect differences in motivation for people who consider abandoning a technology compared to those who do not question their use. The central role of motivation in users' behavior and experience is discussed.",
  "authors": [
    {
      "name": "Florian Brühlmann",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/do/10.1145/contrib-81557646656/rel-imgonly/photofunia-1603985913.jpg",
      "acmid": "81557646656",
      "orcid": "missing"
    },
    {
      "name": "Beat Vollenwyder",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658654462",
      "orcid": "missing"
    },
    {
      "name": "Klaus Opwis",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048343",
      "orcid": "missing"
    },
    {
      "name": "Elisa D. Mekler",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549460056",
      "orcid": "0000-0003-0076-6703"
    }
  ],
  "references": [
    {
      "text": "Marjan Bakker and Jelte M. Wicherts. 2014. Outlier removal, sum scores, and the inflation of the type I error rate in independent samples t tests: The power of alternatives and recommendations. Psychological Methods 19, 3 (2014), 409--427.",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Cheralyn Atkins, Jason T. Bowey, and Regan L. Mandryk. 2016. Fostering Intrinsic Motivation Through Avatar Identification in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2982--2995.  ",
      "doi": "10.1145/2858036.2858062"
    },
    {
      "text": "Marc R. Blais, Stéphane Sabourin, Colette Boucher, and Robert J. Vallerand. 1990. Toward a Motivational Model of Couple Happiness. Journal of Personality and Social Psychology 59, 5 (1990), 1021--1031.",
      "doi": ""
    },
    {
      "text": "Ingwer Borg and Patrick J. F. Groenen. 2005. Modern multidimensional scaling: Theory and applications. Berlin: Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Rafael A. Calvo, Dorian Peters, Daniel Johnson, and Yvonne Rogers. 2014. Autonomy in technology design. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14. ACM, 37--40.  ",
      "doi": "10.1145/2559206.2560468"
    },
    {
      "text": "Valery Chirkov, Richard M. Ryan, Youngmee Kim, and Ulas Kaplan. 2003. Differentiating autonomy from individualism and independence: A self-determination theory perspective on internalization of cultural orientations and well-being. Journal of Personality and Social Psychology 84, 1 (2003), 97--110.",
      "doi": ""
    },
    {
      "text": "Paul G. Curran. 2016. Methods for the detection of carelessly invalid responses in survey data. Journal of Experimental Social Psychology 66 (2016), 4--19.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The \"What\" and \"Why\" of Goal Pursuits: Human Needs and the Self-Determination of Behavior. Psychological Inquiry 11, 4 (2000), 227--268.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2002a. Handbook of self-determination research. Rochester, NY: University Rochester Press.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2002b. Overview of Self-Determination Theory. In Handbook of self-determination research, Edward L. Deci and Richard M. Ryan (Eds.). Rochester, NY: University Rochester Press, Chapter 1, 3--33.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2016. Contextual Autonomy Support in Video Game Play : A Grounded Theory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3931--3943.  ",
      "doi": "10.1145/2858036.2858395"
    },
    {
      "text": "Robert F. DeVellis. 2017. Scale Development: Theory and Applications. Vol. 26. Thousand Oaks, CA: Sage publications.",
      "doi": ""
    },
    {
      "text": "Ed Diener, Robert A. Emmons, Randy J. Larsen, and Sharon Griffin. 1985. The Satisfaction With Life Scale. Journal of Personality Assessment 49, 1 (1985), 71--75.",
      "doi": ""
    },
    {
      "text": "Kraig Finstad. 2010. The Usability Metric for User Experience. Interacting with Computers 22, 5 (2010), 323--327.  ",
      "doi": "10.1016/j.intcom.2010.04.004"
    },
    {
      "text": "Marylène Gagné, Jacques Forest, Maarten Vansteenkiste, Laurence Crevier-Braud, Anja van den Broeck, Ann Kristin Aspeli, Jenny Bellerose, Charles Benabou, Emanuela Chemolli, Stefan Tomas Güntert, Hallgeir Halvari, Devani Laksmi Indiyastuti, Peter A. Johnson, Marianne Hauan Molstad, Mathias Naudin, Assane Ndao, Anja Hagen Olafsen, Patrice Roussel, Zheni Wang, and Cathrine Westbye. 2015. The Multidimensional Work Motivation Scale: Validation evidence in seven languages and nine countries. European Journal of Work and Organizational Psychology 24, 2 (2015), 178--196.",
      "doi": ""
    },
    {
      "text": "Graham S. Gaine and Jennifer G. La Guardia. 2009. The unique contributions of motivations to maintain a relationship and motivations toward relational activities to relationship well-being. Motivation and Emotion 33, 2 (2009), 184--202.",
      "doi": ""
    },
    {
      "text": "Frédéric Guay, Robert J. Vallerand, and Céline Blanchard. 2000. On the Assessment of Situational Intrinsic and Extrinsic Motivation: The Situational Motivation Scale (SIMS). Motivation and Emotion 24, 3 (2000), 175--213.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl. 2010. Experience Design: Technology for All the Right Reasons. Synthesis Lectures on Human-Centered Informatics 3, 1 (2010), 1--95. ",
      "doi": "10.5555/1855019"
    },
    {
      "text": "Marc Hassenzahl, Sarah Diefenbach, and Anja Göritz. 2010. Needs, affect, and interactive products -- Facets of user experience. Interacting with Computers 22, 5 (2010), 353--362.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "Marc Hassenzahl and Daniel Ullrich. 2007. To do or not to do: Differences in user experience and retrospective judgments depending on the presence or absence of instrumental goals. Interacting with Computers 19, 4 (2007), 429--437.  ",
      "doi": "10.1016/j.intcom.2007.05.001"
    },
    {
      "text": "Kasper Hornbæk and Morten Hertzum. 2017. Technology Acceptance and User Experience: A Review of the Experiential Component in HCI. ACM Transactions on Computer-Human Interaction 24, 5, Article 33 (Oct. 2017), 30 pages.  ",
      "doi": "10.1145/3127358"
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5040--5052.  ",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Matt C. Howard. 2016. A Review of Exploratory Factor Analysis Decisions and Overview of Current Practices: What We Are Doing and How Can We Improve? International Journal of Human-Computer Interaction 32, 1 (2016), 51--62.",
      "doi": ""
    },
    {
      "text": "Matt C. Howard and Robert C. Melloy. 2016. Evaluating Item-Sort Task Methods: The Presentation of a New Statistical Significance Formula and Methodological Best Practices. Journal of Business and Psychology 31, 1 (2016), 173--186.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Steve Haroz, Shion Guha, Pierre Dragicevic, and Chat Wacharamanotham. 2017. Moving Transparent Statistics Forward at CHI. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17 (CHI EA '17). ACM, New York, NY, USA, 534--541.  ",
      "doi": "10.1145/3027063.3027084"
    },
    {
      "text": "Marc-André K. Lafrenière, Jérémie Verner-Filion, and Robert J. Vallerand. 2012. Development and validation of the Gaming Motivation Scale (GAMS). Personality and Individual Differences 53, 7 (2012), 827 -- 831.",
      "doi": ""
    },
    {
      "text": "Effie Lai-Chong Law and Paul van Schaik. 2010. Modelling user experience -- An agenda for research and practice. Interacting with Computers 22, 5 (2010), 313--322.  ",
      "doi": "10.1016/j.intcom.2010.04.006"
    },
    {
      "text": "Chris Lonsdale, Ken Hodge, and Elaine A. Rose. 2008. The behavioral regulation in sport questionnaire (BRSQ): instrument development and initial validity evidence. Journal of sport & exercise psychology 30, 3 (2008), 323--55.",
      "doi": ""
    },
    {
      "text": "Clifford Mallett, Masato Kawabata, Peter Newcombe, Andrés Otero-Forero, and Susan Jackson. 2007. Sport motivation scale-6 (SMS-6): A revised six-factor sport motivation scale. Psychology of Sport and Exercise 8, 5 (2007), 600--614.",
      "doi": ""
    },
    {
      "text": "David Markland and Vannessa Tobin. 2004. A Modification to the Behavioural Regulation in Exercise Questionnaire to Include an Assessment of Amotivation. Journal of Sport and Exercise Psychology 26, 2 (2004), 191--196.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler and Kasper Hornbæk. 2016. Momentary Pleasure or Lasting Meaning?. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (CHI '16). ACM, New York, NY, USA, 4509--4520.  ",
      "doi": "10.1145/2858036.2858225"
    },
    {
      "text": "Helfried Moosbrugger and Augustin Kelava. 2007. Testtheorie und Fragebogenkonstruktion. Berlin: Springer.",
      "doi": ""
    },
    {
      "text": "Frederiki C. Moustaka, Symeon P. Vlachopoulos, Spyridoula Vazou, Maria Kaperoni, and David A. Markland. 2010. Initial validity evidence for the Behavioral Regulation in Exercise Questionnaire-2 among Greek exercise participants. European Journal of Psychological Assessment 26, 4 (2010), 269--276.",
      "doi": ""
    },
    {
      "text": "Elaine Mullan, David Markland, and David K. Ingledew. 1997. A graded conceptualisation of self-determination in the regulation of exercise behaviour: development of a measure using confirmatory factor analytic procedures. Personality and Individual Differences 23, 5 (1997), 745--752.",
      "doi": ""
    },
    {
      "text": "Timo Partala and Aleksi Kallinen. 2012. Understanding the most satisfying and unsatisfying user experiences: Emotions, psychological needs, and context. Interacting with Computers 24, 1 (2012), 25--34.  ",
      "doi": "10.1016/j.intcom.2011.10.001"
    },
    {
      "text": "Luc G. Pelletier, M. S. Fortier, Robert J. Vallerand, and N. M. Brierè. 2001. Associatons among perceived autonomy support, forms of self-regulations, and persistence: A prospective study. Motivation and Emotion 25, 4 (2001), 279--306.",
      "doi": ""
    },
    {
      "text": "Luc G. Pelletier, Meredith A. Rocchi, Robert J. Vallerand, Edward L. Deci, and Richard M. Ryan. 2013. Validation of the revised sport motivation scale (SMS-II). Psychology of Sport and Exercise 14, 3 (2013), 329--341.",
      "doi": ""
    },
    {
      "text": "Luc G. Pelletier, Kim M. Tuson, Isabelle Green-Demers, Kimberley Noels, and Ann M. Beaton. 1998. Why Are You Doing Things for the Environment? The Motivation Toward the Environment Scale (MTES)1. Journal of Applied Social Psychology 28, 5 (1998), 437--468.",
      "doi": ""
    },
    {
      "text": "Luc G. Pelletier, Kim M. Tuson, and Najwa K. Haddad. 1997. Client Motivation for Therapy Scale: a measure of intrinsic motivation, extrinsic motivation, and amotivation for therapy. Journal of personality assessment 68, 2 (1997), 414--35.",
      "doi": ""
    },
    {
      "text": "Frederick F. Reichheld. 2003. The one number you need to grow. Harvard business review 81, 12 (2003), 46--55.",
      "doi": ""
    },
    {
      "text": "Marco M. C. Rozendaal, David V. Keyson, and Huib de Ridder. 2007. Product Behavior and Appearance Effects on Experienced Engagement during Experiential and Goal-directed Tasks. In Proceedings of the 2007 Conference on Designing Pleasurable Products and Interfaces. ACM, 181--193.  ",
      "doi": "10.1145/1314161.1314178"
    },
    {
      "text": "Richard M. Ryan and James P. Connell. 1989. Perceived locus of causality and internalization: Examining reasons for acting in two domains. Journal of Personality and Social Psychology 57, 5 (1989), 749--761.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. Contemporary Educational Psychology 25, 1 (2000), 54--67.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Christina Frederick. 1997. On Energy, Personality, and Health: Subjective Vitality as a Dynamic Reflection of Well-Being. Journal of Personality 65, 3 (1997), 529--565.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (01 Dec 2006), 344--360.",
      "doi": ""
    },
    {
      "text": "Jeff Sauro and James R. Lewis. 2012. Quantifying the User Experience: Practical Satistics for User Research. Cambridge, MA: Morgan Kaufmann. ",
      "doi": "10.5555/2222513"
    },
    {
      "text": "Hanna Schneider, Kilian Moser, Andreas Butz, and Florian Alt. 2016. Understanding the Mechanics of Persuasive System Design: A Mixed-Method Theory-driven Analysis of Freeletics. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 309--320.  ",
      "doi": "10.1145/2858036.2858290"
    },
    {
      "text": "Kennon M. Sheldon, Neetu Abad, and Christian Hinsch. 2011. A two-process view of Facebook use and relatedness need-satisfaction: Disconnection drives use, and connection rewards it. Journal of Personality and Social Psychology 100, 4 (2011), 766--775.",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon, Andrew J. Elliot, Youngmee Kim, and Tim Kasser. 2001. What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of Personality and Social Psychology 80, 2 (2001), 325--339.",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon, Richard M. Ryan, Edward L. Deci, and Tim Kasser. 2004. The Independent Effects of Goal Contents and Motives on Well-Being: It's Both What You Pursue and Why You Pursue It. Personality and Social Psychology Bulletin 30, 4 (2004), 475--486.",
      "doi": ""
    },
    {
      "text": "Hyewon Suh, Nina Shahriaree, Eric B. Hekler, and Julie A. Kientz. 2016. Developing and Validating the User Burden Scale: A Tool for Assessing User Burden in Computing Systems. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3988--3999.  ",
      "doi": "10.1145/2858036.2858448"
    },
    {
      "text": "Alexandre N Tuch, Paul Van Schaik, and Kasper Hornbæk. 2016. Leisure and Work, Good and Bad: The Role of Activity Domain and Valence in Modeling User Experience. ACM Transactions on Computer-Human Interaction (TOCHI) 23, 6 (2016), 35.  ",
      "doi": "10.1145/2994147"
    },
    {
      "text": "Alexandre N. Tuch, Rune Trusell, and Kasper Hornbæk. 2013. Analyzing Users' Narratives to Understand Experience with Interactive Products. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2079--2088.  ",
      "doi": "10.1145/2470654.2481285"
    },
    {
      "text": "Robert J. Vallerand. 1997. Toward A Hierarchical Model of Intrinsic and Extrinsic Motivation. Advances in Experimental Social Psychology, Vol. 29. Academic Press, 271 -- 360.",
      "doi": ""
    },
    {
      "text": "Robert J. Vallerand, Michelle S. Fortier, and Frédéric Guay. 1997. Self-determination and persistence in a real-life setting: Toward a motivational model of high school dropout. Journal of Personality and Social Psychology 72, 5 (1997), 1161--1176.",
      "doi": ""
    },
    {
      "text": "Paul van Schaik and Jonathan Ling. 2009. The role of context in perceptions of the aesthetics of web pages over time. International Journal of Human-Computer Studies 67, 1 (2009), 79 -- 89.  ",
      "doi": "10.1016/j.ijhcs.2008.09.012"
    },
    {
      "text": "Symeon P. Vlachopoulos, Ermioni S. Katartzi, Maria G. Kontou, Frederiki C. Moustaka, and Marios Goudas. 2011. The revised perceived locus of causality in physical education scale: Psychometric evaluation among youth. Psychology of Sport and Exercise 12, 6 (2011), 583--592.",
      "doi": ""
    },
    {
      "text": "Jia Wei Zhang, Ryan T. Howell, and Peter A. Caprariello. 2013. Buying Life Experiences for the \"Right\" Reasons: A Validation of the Motivations for Experiential Buying Scale. Journal of Happiness Studies 14, 3 (2013), 817--842.",
      "doi": ""
    }
  ]
}