{
  "doi": "10.1145/3173574.3174093",
  "title": "How Far Is Up?: Bringing the Counterpointed Triad Technique to Digital Storybook Apps",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Interactive storybooks, such as those available on the iPad, offer multiple ways to convey a story, mostly through visual, textual and audio content. How to effectively deliver this combination of content so that it supports positive social and educational development in pre-literate children is relatively underexplored. In order to address this issue we introduce the \"Counterpointed Triad Technique\". Drawing from traditional literary theory we design visual, textual and audio content that each conveys different aspects of a story. We explore the use of this technique through a storybook we designed ourselves called \"How Far Is Up?\". A study involving 26 kindergarten children shows that \"How Far Is Up?\" can engage pre-literature children while they are reading alone and also when they are reading with an adult. Based on our craft knowledge and study findings, we present a set of design strategies that aim to provide designers with practical guidance on how to create engaging interactive digital storybooks.",
  "authors": [
    {
      "name": "Betty Sargeant",
      "institution": "RMIT University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058623757",
      "orcid": "missing"
    },
    {
      "name": "Florian 'Floyd' Mueller",
      "institution": "RMIT University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    }
  ],
  "references": [
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2, 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Linda Candy. 2006. Practice Based Research: A Guide, CSS Report, no. 1, Creative and Cognition Studios, Sydney",
      "doi": ""
    },
    {
      "text": "Linda Candy and Ernest A Edmonds. 201. The Role of the Artefact and Frameworks for Practice-based Research. In The Routledge Companion to Researchin the Arts, Michael Biggs and Henrik Karlsson (eds.). Routledge, London.",
      "doi": ""
    },
    {
      "text": "CDC. (n.d.). Milestone Moments. Retrieved July 27, 2015 from http://www.cdc.gov/ncbddd/actearly/pdf/parents_pdfs/ milestonemomentseng508.pdf.",
      "doi": ""
    },
    {
      "text": "Luca Colombo and Monica Landoni. A Diary of Children's User Experiences with Ebooks Using Flow Theory as Framework. Proceedings of the 2014 Conference on Interaction design and children (IDC'14):135--144.  ",
      "doi": "10.1145/2593968.2593978"
    },
    {
      "text": "Common Sense Media. 2013, Zero to Eight: Children's Media use in America 2013. Retrieved January 20, 2014 from https://www.commonsensemedia.org/research/zero-toeight-childrens-media-use-in-america-2013",
      "doi": ""
    },
    {
      "text": "Bill Cope. 2001. New ways with words: Print and etext convergence. In Print and Electronic Text Convergence, Bill Cope and Diana Kalantzis (eds.). C-2-C Project: Book 2.1, Common Ground Publishing, Altona, Australia.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action is: The Foundations of Embodied Interaction. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Alison Druin. 1999. Cooperative inquiry: Developing new technologies for children with children. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99), 592--599. http://dl.acm.org/citation.cfm?id=303166  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Alison Druin. 2002. The role of children in the design of new technology. Behavior and Information Technology 21, 1: 1--25.",
      "doi": ""
    },
    {
      "text": "Alex Hernandez. 2014. Toddlers and Tablets: Emerging Apps Take Cues from Learning Science. Education Next, 14, 1. Retrieved July 20 2015 from http://www.questia.com/library/journal/1G1352376588/toddlers-and-tablets-emerging-apps-takecues-from#/",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade. 2008. Interaction design and children. Foundations and Trends in Human Computer Interaction, 1, 4: 277--392. http://dl.acm.org/citation.cfm?id=1454704  ",
      "doi": "10.1561/1100000006"
    },
    {
      "text": "Juan Pablo Hourcade. 2015. Child Computer Interaction. Retrieved from http://homepage.cs.uiowa.edu/~hourcade/book/childcomputer-interaction-first-edition.pdf",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade, Sarah L Mascher, David Wu, and Luiza Pantoja. 2015. Look my baby is using an iPad! An analysis of You Tube videos of infants and toddlers using tablets. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systemss (CHI '15): 1915--1924.  ",
      "doi": "10.1145/2702123.2702266"
    },
    {
      "text": "Ruth Sancho Huerga, Jennifer Lade and Florian Mueller, Designing Play to Support Hospitalized Children. CHI PLAY 2016. ACM. 401--412  ",
      "doi": "10.1145/2967934.2968106"
    },
    {
      "text": "Wolfgang Iser. 1974. The Implied Reader. Johns Hopkins University Press, Baltimore, MA.",
      "doi": ""
    },
    {
      "text": "MV Johnston, A Nishimura, K Harum, J Pekar, and ME Blue. 2001. Sculpting the developing brain. Advances in Pediatrics, 48: 1--38.",
      "doi": ""
    },
    {
      "text": "Heekyoung Jung and Erik Stolterman. 2012. Digital form and materiality: Propositions for a new approach to interaction design research. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12), 645--654. http://dl.acm.org/citation.cfm?id=2399115  ",
      "doi": "10.1145/2399016.2399115"
    },
    {
      "text": "Xiaoming Li, Melissa Atkins, and Bonita Stanton. 2006. Effects of Home and School Computer Use on School Readiness and Cognitive Development Among Head Start Children: A Randomized Controlled Pilot Trial. Merrill-Palmer Quarterly, 52, 2: 239--263.",
      "doi": ""
    },
    {
      "text": "John Locke. 1996. Some Thoughts Concerning Education and of the Conduct of the Understanding, RW Grant and N Tarcov (eds.). Hackett, Indianapolis, IN.",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren. 1995. Applying design methodology to software development. In Proceedings of the 1st Conference on Designing Interactive Systems: Processes, Practices, Methods and Techniques (DIS '95), 97--95. http://dl.acm.org/citation.cfm?id=225444  ",
      "doi": "10.1145/225434.225444"
    },
    {
      "text": "Jonas Löwgren. 2014. Interaction design -- brief intro. in The Encyclopaedia of Human Computer Interaction, (2nd ed), M Soegaard and RF Dam (eds.). Interaction Design Foundation, Denmark.",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren and Erik Stolterman. 2004. Thoughtful Interaction Design: A Design Perspective on Information Technology, MIT Press, Cambridge, MA. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Krystnia Madej. 2003. Towards digital narrative for children: From education to entertainment, a historical perspective. ACM Computers in entertainment (CIE '03), 1, 1, (3): 1--17.  ",
      "doi": "10.1145/950566.950585"
    },
    {
      "text": "Panos Markopoulos, Janet C Read, and Stuart MacFarlane. 2008. Evaluating Children's Interactive Products: Principles and Practices for Interaction Designers, (1st ed). Morgan Kaufmann, San Francisco, CA. ",
      "doi": "10.5555/1386295"
    },
    {
      "text": "Richard E Mayer and Roxana Moreno. 2002. Animation as an aid to multimedia learning. Educational Psychology Review, 14, 1, 87--99. http://ydraw.com/wp-content/uploads/2012/04/StopMotion-Aids-Multimedia-Learning.pdf.",
      "doi": ""
    },
    {
      "text": "Katy McCarrick, and Xiaoming Li. 2007. Buried Treasure: The Impact of Computer Use on Young Children's Social, Cognitive, Language Development and Motivation. Association for the Advancement of Computing in Education (AACE), 15, 1: 73--95.",
      "doi": ""
    },
    {
      "text": "Katy McCarrick, Xiaoming Li, Angela Fish, Teresa Holtrop, Navaz P Bhavnagri, Bonita Stanton, Gail A Brumitt, Sheretta Butler and Ty Partridge. 2007. Parental Involvement in Young Children's Computer Use and Cognitive Development. NHSA Dialog, 10, 2:67--82.",
      "doi": ""
    },
    {
      "text": "Kristen McLean and Carl Kulo. 2013. The Children's Book Consumer in the Digital Age. Bowker Market Research.",
      "doi": ""
    },
    {
      "text": "Sarah Merritt and Anne Haas Dyson. 1992. A social perspective on informal assessment: Voices, texts, pictures and play from a first grade. In Ways of Assessing Children and Curriculum: Stories of Early Childhood Practice, C Genishi (ed.), 95--125. http://www.eric.ed.gov/contentdelivery/servlet/ERICSe rvlet?accno=ED341986.",
      "doi": ""
    },
    {
      "text": "Koichi Mori, Rafael Ballagas, Glenda Revelle, Hayes Raffle, Hiroshi Horii, and Mirjana Spasojevic. 2011. Interactive rich reading: Enhanced book reading experience with a conversational agent. In Proceedings of the 19th ACM International Conference on Multimedia (MM '11), 825--826. http://dl.acm.org/citation.cfm?id=2072298.2072478.  ",
      "doi": "10.1145/2072298.2072478"
    },
    {
      "text": "Anna Munster. 2011. Materializing New Media: Embodiment in Information Aesthetics, Darthmouth College Press, Hanover, NH. ",
      "doi": "10.5555/1201436"
    },
    {
      "text": "Anna Munster. 2014. Materiality. In The Johns Hopkins Guide to Digital Media, (2nd ed), ML Ryan, L Emerson and B Robertson (eds.). Johns Hopkins University Press, Baltimore, MA, 327--330.",
      "doi": ""
    },
    {
      "text": "Maria Nikolajeva and Carole Scott. 2006. How Picturebooks Work. Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "Perry Nodelman. 1988. Words About Pictures: The Narrative Art of Children's Picture Books. University of Georgia Press, Athens, GA.",
      "doi": ""
    },
    {
      "text": "Allen Paivio. 1986. Mental Representations: The Dual Coding Approach. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "Lynda Plowman and Christine Stephen. 2005. Children, play, and computers in pre-school education. British Journal of Educational Technology. 36, 2: 145--157.",
      "doi": ""
    },
    {
      "text": "Lynda Plowman, Olivia Stevenson, Christine Stephen, and Joanna McPake. 2012. Preschool children's learning with technology at home. Computers and Education, 59, 1: 30--37.  ",
      "doi": "10.1016/j.compedu.2011.11.014"
    },
    {
      "text": "Scott Rigby and Richard Ryan, 2011. Glued to games: How video games draw us in and hold us spellbound. Praeger",
      "doi": ""
    },
    {
      "text": "Betty Sargeant. 2013. Interactive storytelling: How picture book conventions inform multimedia book app narratives. Australian Journal of Intelligent Information Processing Systems (AJIIPS), Special Issue on Edutainment, 13, 3: 29--35.",
      "doi": ""
    },
    {
      "text": "Betty Sargeant. 2015. What is an ebook? What is a book app? And why should we care? An analysis of contemporary digital picture books. Children's Literature in Education, 45,175.",
      "doi": ""
    },
    {
      "text": "Betty Sargeant. 2014. How Far Is Up? Ipad App accessed 26.2.2017. https://itunes.apple.com/au/app/how-far-isup/id860628627?mt=8.",
      "doi": ""
    },
    {
      "text": "Sesame Studios. 2014. The Monster at the End of this Book. Ipad App accessed 26.2.17. https://itunes.apple.com/au/app/the-monster-at-theend-of-this-book-with-grover/id409467802?mt=8.",
      "doi": ""
    },
    {
      "text": "Daisy Smeets. 2012. Storybook Apps as a Tool for Early Literacy Development. PhD Dissertation. University of Leiden, The Netherlands. https://openaccess.leidenuniv.nl/handle/1887/20363",
      "doi": ""
    },
    {
      "text": "Daisy Smeets and Adriana Bus. 2013. Picture storybooks go digital: Pros and cons. In Quality Reading Instruction in the Age of Common Core Standards, SB Neuman and SB Gambrell (eds.). International Reading Association, Newark, DE, 176189.",
      "doi": ""
    },
    {
      "text": "Daisy Smeets and Adriana Bus. 2014. The interactive animated e-book as a word learning device for kindergartners. Applied Psycholinguistics, 22, 1: 1--22. http://media.leidenuniv.nl/legacy/the-interactiveanimated-e-book.pdf.",
      "doi": ""
    },
    {
      "text": "Penelope Sweetser, Daniel M Johnson, Anne Ozdowska, and Peta Wyeth. 2012. Active versus passive screen time for young children. Australasian Journal of Early Childhood, 37, 4: 94--98. http://eprints.qut.edu.au/56494/3/56494.pdf .",
      "doi": ""
    },
    {
      "text": "Stephen G. West, et. al. 2008. Alternatives to the Randomized Controlled Trial. American Journal of Public Health, 98(8), 1359--1366.",
      "doi": ""
    },
    {
      "text": "Junko Yokata and William Teale. 2014. Picture books and the digital world: Educators making informed choices. The Reading Teacher, 67, 8, 577--585.",
      "doi": ""
    }
  ]
}