{
  "doi": "10.1145/3173574.3174028",
  "title": "LoopMaker: Automatic Creation of Music Loops from Pre-recorded Music",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-6",
  "year": 2018,
  "badges": [],
  "abstract": "Music loops are seamlessly repeatable segments of music that can be used for music composition as well as backing tracks for media such as videos, webpages, and games. They are regularly used by both professional musicians as well as novices with very little experience in audio editing and music composition. The process of creating music loops can be challenging and tedious, particularly for novices. We present LoopMaker, an interactive system that assists users in creating and exploring music loops from pre-recorded music. Our system can be used in a semi-automatic mode in which it refines a user's rough selection of a loop. It can also be used in a fully automatic mode in which it creates a number of loops from a given piece of music and interactively allows the user to explore these loops. Our user study suggests that our system makes the loop creation process significantly faster, easier, and more enjoyable than manual creation for both novices and experts. It also suggests that the quality of these loops are comparable to manually created loops by experts.",
  "tags": [
    "interactive audio editing",
    "music loop creation",
    "audio applications"
  ],
  "authors": [
    {
      "name": "Zhengshan Shi",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260429",
      "orcid": "missing"
    },
    {
      "name": "Gautham J. Mysore",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418598351",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jim Aikin. 2001. Making loop music in a computer. Keyboard 27, 2 (02 2001), 134--135.",
      "doi": ""
    },
    {
      "text": "Luca Benedetti, Holger Winnemöller, Massimiliano Corsini, and Roberto Scopigno. 2014. Painting with bob: Assisted creativity for novices. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 419--428.  ",
      "doi": "10.1145/2642918.2647415"
    },
    {
      "text": "William E Benjamin. 1984. A theory of musical meter. Music Perception: An Interdisciplinary Journal 1, 4 (1984), 355--413.",
      "doi": ""
    },
    {
      "text": "Adam Berenzweig, Beth Logan, Daniel PW Ellis, and Brian Whitman. 2004. A large-scale evaluation of acoustic and subjective music-similarity measures. Computer Music Journal 28, 2 (2004), 63--76.  ",
      "doi": "10.1162/014892604323112257"
    },
    {
      "text": "Nicholas J. Bryan, Gautham J. Mysore, and Ge Wang. 2014. ISSE: an interactive source separation editor.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/2556288.2557253"
    },
    {
      "text": "J. Brzezinski. 2009. Game sound: an introduction to the history, theory, and practice of video game music and sound design. Choice 46, 7 (03 2009), 1323.",
      "doi": ""
    },
    {
      "text": "Mark Cartwright, Bryan Pardo, Gautham J Mysore, and Matt Hoffman. 2016. Fast and easy crowdsourced perceptual audio evaluation. In Acoustics, Speech and Signal Processing (ICASSP), 2016 IEEE International Conference on. IEEE, 619--623.",
      "doi": "10.1109/ICASSP.2016.7471749"
    },
    {
      "text": "Matthew E.P. Davies, Philippe Hamel, Kazuyoshi Yoshii, and Masataka Goto. 2014. AutoMashUpper: Automatic Creation of Multi-Song Music Mashups. IEEE/ACM Transactions on Audio, Speech, and Language Processing 22, 12 (2014), 1726--1737.  ",
      "doi": "10.1109/TASLP.2014.2347135"
    },
    {
      "text": "Nicholas Davis, Holger Winnemöller, Mira Dontcheva, and Ellen Yi-Luen Do. 2013. Toward a cognitive theory of creativity support. In Proceedings of the 9th ACM Conference on Creativity & Cognition. ACM, 13--22.  ",
      "doi": "10.1145/2466627.2466655"
    },
    {
      "text": "Daniel PW Ellis. 2007. Beat tracking by dynamic programming. In Journal of New Music Research, Vol. 36. 51--60.",
      "doi": ""
    },
    {
      "text": "Bill Gibson. 2005. The S.M.A.R.T. Guide to Producing Music with Samples, Loops, and MIDI. Artistpro, Boston, MA, USA. ",
      "doi": "10.5555/1076509"
    },
    {
      "text": "Masataka Goto, Hiroki Hashiguchi, Takuichi Nishimura, and Ryuichi Oka. 2002. RWC Music Database: Popular, Classical and Jazz Music Databases.. In ISMIR, Vol. 2. 287--288.",
      "doi": ""
    },
    {
      "text": "Tatsunori Hirai, Hironori Doi, and Shigeo Morishima. 2015. MusicMixer: computer-aided DJ system based on an automatic song mixing. In Proceedings of the 12th International Conference on Advances in Computer Entertainment Technology. ACM, 41.  ",
      "doi": "10.1145/2832932.2832942"
    },
    {
      "text": "Ning Hu, Roger B Dannenberg, and George Tzanetakis. 2003. Polyphonic audio matching and alignment for music retrieval. In Applications of Signal Processing to Audio and Acoustics, 2003 IEEE Workshop on. IEEE, 185--188.",
      "doi": ""
    },
    {
      "text": "Tetsuro Kitahara, Kosuke Iijima, Misaki Okada, Yuji Yamashita, and Ayaka Tsuruoka. 2015. A loop sequencer that selects music loops based on the degree of excitement. Proceedings of the 12th International Conference in Sound and Music Computing, SMC 2015 (2015), 435--438.",
      "doi": ""
    },
    {
      "text": "Meinard Müller. 2007. Dynamic time warping. In Information Retrieval for Music and Motion. 69--84.",
      "doi": ""
    },
    {
      "text": "Bee Suan Ong and Sebastian Streich. 2008. Music loop extraction from digital audio signals. In IEEE International Conference on Multimedia and Expo. 453--469.",
      "doi": ""
    },
    {
      "text": "David E. Reese, Lynne S. Gross, and Brian Gross. 2009. Audio production worktext: concepts, techniques, and equipment. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Steve Rubin, Floraine Berthouzoz, Gautham J. Mysore, Wilmot Li, and Maneesh Agrawala. 2000. Content-based tools for editing audio stories. In Proceedings of International Society of Music Information Retrieval. ACM, 113--122.  ",
      "doi": "10.1145/2501988.2501993"
    },
    {
      "text": "Joan Serra, Emilia Gómez, Perfecto Herrera, and Xavier Serra. 2008. Chroma binary similarity and local alignment applied to cover song identification. IEEE Transactions on Audio, Speech, and Language Processing 16, 6 (2008), 1138--1151.  ",
      "doi": "10.1109/TASL.2008.924595"
    },
    {
      "text": "Sebastian Streich and Bee Suan Ong. 2008. A Music Loop Explorer System. In International Computer Music Conference Proceedings.",
      "doi": ""
    },
    {
      "text": "Adobe Creative Team. 2012. Extending and Shortening Musical Selections in Adobe Audition CS6. (2012). http://www.adobepress.com/articles/article.asp?p= 1867758&seqNum=7.",
      "doi": ""
    },
    {
      "text": "Newspapers Tribune. 2004. Making music; Software makes it easy for amaterus to compose tunes. (04 2004).",
      "doi": ""
    },
    {
      "text": "Brian Whitman. The Infinite Jukebox. http://labs.echonest.com/Uploader/index.html.",
      "doi": ""
    },
    {
      "text": "Jun Xie, Aaron Hertzmann, Wilmot Li, and Holger Winnemöller. 2014. PortraitSketch: Face sketching assistance for novices. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 407--417.  ",
      "doi": "10.1145/2642918.2647399"
    }
  ]
}