{
  "doi": "10.1145/3173574.3173927",
  "title": "ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "The latest generations of smartphones with built-in AR capabilities enable a new class of mobile apps that merge digital and real-world content depending on a user's task, context, and preference. But even experienced mobile app designers face significant challenges: creating 2D/3D AR content remains difficult and time-consuming, and current mobile prototyping tools do not support AR views. There are separate tools for this; however, they require significant technical skill. This paper presents ProtoAR which supplements rapid physical prototyping using paper and Play-Doh with new mobile cross-device multi-layer authoring and interactive capture tools to generate mobile screens and AR overlays from paper sketches, and quasi-3D content from 360-degree captures of clay models. We describe how ProtoAR evolved over four design jams with students to enable interactive prototypes of mobile AR apps in less than 90 minutes, and discuss the advantages and insights ProtoAR can give designers.",
  "authors": [
    {
      "name": "Michael Nebeling",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640607",
      "orcid": "0000-0003-3743-2387"
    },
    {
      "name": "Janet Nebeling",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261164",
      "orcid": "missing"
    },
    {
      "name": "Ao Yu",
      "institution": "University of Michigan & Tsinghua University, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260428",
      "orcid": "missing"
    },
    {
      "name": "Rob Rumble",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260802",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel J. Wigdor, and George W. Fitzmaurice. 2015. MoveableMaker: Facilitating the Design, Generation, and Assembly of Moveable Papercraft. In Proc. UIST. 565--574.  ",
      "doi": "10.1145/2807442.2807483"
    },
    {
      "text": "Ronald Azuma. 1997. A Survey of Augmented Reality. Presence 6, 4 (1997), 355--385.  ",
      "doi": "10.1162/pres.1997.6.4.355"
    },
    {
      "text": "Ronald Azuma, Yohan Baillot, Reinhold Behringer, Steven Feiner, Simon Julier, and Blair MacIntyre. 2001. Recent Advances in Augmented Reality. IEEE Computer Graphics and Applications 21, 6 (2001), 34--47.  ",
      "doi": "10.1109/38.963459"
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. In Proc. DIS. 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proc. CHI.  ",
      "doi": "10.1145/2702123.2702451"
    },
    {
      "text": "Alan Cooper, Robert Reimann, David Cronin, and Christopher Noessel. 2014. About face: the essentials of interaction design. John Wiley & Sons. ",
      "doi": "10.5555/2688796"
    },
    {
      "text": "Steven Dow, Jaemin Lee, Christopher Oezbek, Blair MacIntyre, Jay David Bolter, and Maribeth Gandy. 2005a. Wizard of Oz interfaces for mixed reality applications. In Proc. CHI Extended Abstracts. 1339--1342.  ",
      "doi": "10.1145/1056808.1056911"
    },
    {
      "text": "Steven Dow, Blair MacIntyre, Jaemin Lee, Christopher Oezbek, Jay David Bolter, and Maribeth Gandy. 2005b. Wizard of Oz support throughout an iterative design process. IEEE Pervasive Computing 4, 4 (2005), 18--26.  ",
      "doi": "10.1109/MPRV.2005.93"
    },
    {
      "text": "Maribeth Gandy and Blair MacIntyre. 2014. Designer's augmented reality toolkit, ten years later: implications for new media authoring tools. In Proc. UIST.  ",
      "doi": "10.1145/2642918.2647369"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-Device Interaction. In Proc. CHI.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proc. CHI.  ",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Andrew J. Hunsucker, Kelly McClinton, Jennifer Wang, and Erik Stolterman. 2017. Augmented Reality Prototyping For Interaction Design Students. In Proc. CHI Extended Abstracts. 1018--1023.  ",
      "doi": "10.1145/3027063.3053684"
    },
    {
      "text": "Shahram Izadi, David Kim, Otmar Hilliges, David Molyneaux, Richard A. Newcombe, Pushmeet Kohli, Jamie Shotton, Steve Hodges, Dustin Freeman, Andrew J. Davison, and Andrew W. Fitzgibbon. 2011. KinectFusion: real-time 3D reconstruction and interaction using a moving depth camera. In Proc. UIST. 559--568.  ",
      "doi": "10.1145/2047196.2047270"
    },
    {
      "text": "Bret Jackson and Daniel F. Keefe. 2016. Lift-Off: Using Reference Imagery and Freehand Sketching to Create 3D Models in VR. TVCG 22, 4 (2016).  ",
      "doi": "10.1109/TVCG.2016.2518099"
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2017. IllumiPaper: Illuminated Interactive Paper. In Proc. CHI. 5605--5618.  ",
      "doi": "10.1145/3025453.3025525"
    },
    {
      "text": "Scott R. Klemmer, Jack Li, James Lin, and James A. Landay. 2004. Papier-Mache: toolkit support for tangible input. In Proc. CHI. 399--406.  ",
      "doi": "10.1145/985692.985743"
    },
    {
      "text": "Scott R. Klemmer, Mark W. Newman, Ryan Farrell, Mark Bilezikjian, and James A. Landay. 2001. The designers' outpost: a tangible interface for collaborative web site. In Proc. UIST. 1--10.  ",
      "doi": "10.1145/502348.502350"
    },
    {
      "text": "Boriana Koleva, Ian Taylor, Steve Benford, Mike Fraser, Chris Greenhalgh, Holger Schn¨ adelbach, Dirk vom Lehn, Christian Heath, Ju Row-Farr, and Matt Adams. 2001. Orchestrating a mixed reality performance. In Proc. CHI. 38--45.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "James A. Landay and Brad A. Myers. 1995. Interactive Sketching for the Early Stages of User Interface Design. In Proc. CHI. 43--50.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "Chunyuan Liao, Franc ¸ois Guimbreti` ere, Ken Hinckley, and James D. Hollan. 2008. Papiercraft: A gesture-based command system for interactive paper. ACM Trans. Comput.-Hum. Interact. 14, 4 (2008), 18:1--18:27.  ",
      "doi": "10.1145/1314683.1314686"
    },
    {
      "text": "James Lin, Mark W. Newman, Jason I. Hong, and James A. Landay. 2000. DENIM: finding a tighter fit between tools and practice for Web site design. In Proc. CHI. 510--517.  ",
      "doi": "10.1145/332040.332486"
    },
    {
      "text": "Hao L¨ u and Yang Li. 2012. Gesture Coder: A Tool for Programming Multi-touch Gestures By Demonstration. In Proc. CHI.  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: a toolkit for rapid design exploration of augmented reality experiences. In Proc. UIST.  ",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems 77, 12 (1994), 1321--1329.",
      "doi": ""
    },
    {
      "text": "Bill Moggridge and Bill Atkinson. 2007. Designing interactions. Vol. 17. MIT press Cambridge, MA. ",
      "doi": "10.5555/1196347"
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proc. CHI.  ",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling and Anind K. Dey. 2016. XDBrowser: User-Defined Cross-Device Web Page Designs. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858048"
    },
    {
      "text": "Michael Nebeling, Theano Mintsi, Maria Husmann, and Moira C. Norrie. 2014. Interactive Development of Cross-Device User Interfaces. In Proc. CHI.  ",
      "doi": "10.1145/2556288.2556980"
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic Books (AZ).",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Peter Ondruska, Pushmeet Kohli, and Shahram Izadi. 2015. MobileFusion: Real-Time Volumetric Surface Reconstruction and Dense Tracking on Mobile Phones. TVCG 21, 11 (2015).  ",
      "doi": "10.1109/TVCG.2015.2459902"
    },
    {
      "text": "Thammathip Piumsomboon, Adrian J. Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-Defined Gestures for Augmented Reality. In Proc. INTERACT. 282--299.  ",
      "doi": "10.1145/2468356.2468527"
    },
    {
      "text": "Marc Rettig. 1994. Prototyping for Tiny Fingers. Commun. ACM 37, 4 (1994), 21--27.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Yvonne Rogers, Helen Sharp, and Jenny Preece. 2011. Interaction design: beyond human-computer interaction. John Wiley & Sons. ",
      "doi": "10.5555/2031622"
    },
    {
      "text": "Carolyn Snyder. 2003. Paper prototyping: The fast and easy way to design and refine user interfaces. Morgan Kaufmann. ",
      "doi": "10.5555/2821584"
    },
    {
      "text": "Jie Song, G´ abor S¨ or¨ os, Fabrizio Pece, Sean Ryan Fanello, Shahram Izadi, Cem Keskin, and Otmar Hilliges. 2014. In-air gestures around unmodified mobile devices. In Proc. UIST. 319--329.  ",
      "doi": "10.1145/2642918.2647373"
    },
    {
      "text": "Eugene M. Taranta II, Amirreza Samiei, Mehran Maghoumi, Pooya Khaloo, Corey R. Pittman, and Joseph J. LaViola Jr. 2017. Jackknife: A Reliable Recognizer with Few Samples and Many Modalities. In Proc. CHI. 5850--5861.  ",
      "doi": "10.1145/3025453.3026002"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proc. UIST.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proc. UIST.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Feng Zhou, Henry Been-Lirn Duh, and Mark Billinghurst. 2008. Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR. In Proc. ISMAR. 193--202.  ",
      "doi": "10.1109/ISMAR.2008.4637362"
    }
  ]
}