{
  "doi": "10.1145/3173574.3173740",
  "title": "KickAR: Exploring Game Balancing Through Boosts and Handicaps in Augmented Reality Table Football",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "When player skill levels are not matched, games provide an unsatisfying player experience. Player balancing is used across many digital game genres to address this, but has not been studied for co-located augmented reality (AR) tabletop games, where using boosts and handicaps can adjust for different player skill levels. In the setting of an AR table football game, we studied the importance of game balancing being triggered by the game system or the players, and whether player skill should be required to trigger game balancing. We implemented projected icons to prominently display game balancing mechanics in the AR table football game. In a within-subjects study (N=24), we found players prefer skill-based control over game balancing and that different triggers are perceived as having different fairness. Further, the study showed that even game balancing that is perceived as unfair can provide enjoyable game experiences. Based on our findings, we provide suggestions for player balancing in AR tabletop games.",
  "tags": [
    "player experience",
    "game balancing",
    "mario kart effect",
    "augmented reality",
    "foosball",
    "handicap"
  ],
  "authors": [
    {
      "name": "Katja Rogers",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-83458799557/rel-imgonly/img_0821-bw.png",
      "acmid": "83458799557",
      "orcid": "missing"
    },
    {
      "name": "Mark Colley",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-99659260328/rel-imgonly/img_6166.jpg",
      "acmid": "99659260328",
      "orcid": "0000-0001-5207-5029"
    },
    {
      "name": "David Lehr",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659041148",
      "orcid": "missing"
    },
    {
      "name": "Julian Frommel",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-88159458857/rel-imgonly/jf_2020_12_17_400x400.jpg",
      "acmid": "88159458857",
      "orcid": "missing"
    },
    {
      "name": "Marcel Walch",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557244156",
      "orcid": "missing"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    },
    {
      "name": "Michael Weber",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100649893",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sami Abuhamdeh, Mihaly Csikszentmihalyi, and Baland Jalal. 2015. Enjoying the possibility of defeat: Outcome uncertainty, suspense, and intrinsic motivation. Motivation and Emotion 39, 1 (2015), 1--10.",
      "doi": ""
    },
    {
      "text": "David Altimira, Florian \"Floyd\" Mueller, Jenny Clarke, Gun Lee, Mark Billinghurst, and Christoph Bartneck. 2016. Digitally Augmenting Sports: An Opportunity for Exploring and Understanding Novel Balancing Techniques. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1681--1691.  ",
      "doi": "10.1145/2858036.2858277"
    },
    {
      "text": "David Altimira, Florian Floyd Mueller, Jenny Clarke, Gun Lee, Mark Billinghurst, and Christoph Bartneck. 2017. Enhancing player engagement through game balancing in digitally augmented physical games. International Journal of Human-Computer Studies 103, Supplement C (2017), 35 -- 47.  ",
      "doi": "10.1016/j.ijhcs.2017.02.004"
    },
    {
      "text": "The British Foosball Association. 2009. Beginner's Guide - Pin Shot. (2009). {Website} Accessed: 9th September 2017. https://britfoos.com/guides/beginners-guide/pin-shot/.",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L. Mandryk, Tadeusz Stach, and Carl Gutwin. 2011. Target Assistance for Subtly Balancing Competitive Play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2355--2364.  ",
      "doi": "10.1145/1978942.1979287"
    },
    {
      "text": "Nadia Bianchi-Berthouze, Whan Woong Kim, and Darshak Patel. 2007. Does body movement engage you more in digital game play? and why?. In International Conference on Affective Computing and Intelligent Interaction. Springer, Heidelberg, Germany, 102--113.  ",
      "doi": "10.1007/978-3-540-74889-2_10"
    },
    {
      "text": "Barbaros Bostan and Sertaç Öğgüt. 2009. Game challenges and difficulty levels: Lessons learned from RPGs. International Simulation and Gaming Association Conference (ISAGA) (2009).",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1 (1994), 49--59.",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Jeanne H Brockmyer, Christine M Fox, Kathleen A Curtiss, Evan McBroom, Kimberly M Burkhart, and Jacquelyn N Pidruzny. 2009. The development of the Game Engagement Questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624--634.",
      "doi": ""
    },
    {
      "text": "Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving Player Balancing in Racing Games. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 47--56.  ",
      "doi": "10.1145/2658537.2658701"
    },
    {
      "text": "Jenova Chen. 2007. Flow in Games (and Everything else). In Communications of the ACM (CACM), Vol. 50. ACM, New York, NY, USA, 31--34.  ",
      "doi": "10.1145/1232743.1232769"
    },
    {
      "text": "Nicholas Cooper, Aaron Keatley, Maria Dahlquist, Simon Mann, Hannah Slay, Joanne Zucco, Ross Smith, and Bruce H. Thomas. 2004. Augmented Reality Chinese Checkers. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, New York, NY, USA, 117--126.  ",
      "doi": "10.1145/1067343.1067357"
    },
    {
      "text": "Alena Denisova and Paul Cairns. 2015a. Adaptation in Digital Games: The Effect of Challenge Adjustment on Player Performance and Experience. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, New York, NY, USA, 97--101.  ",
      "doi": "10.1145/2793107.2793141"
    },
    {
      "text": "Alena Denisova and Paul Cairns. 2015b. The Placebo Effect in Digital Games: Phantom Perception of Adaptive Artificial Intelligence. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, New York, NY, USA, 23--33.  ",
      "doi": "10.1145/2793107.2793109"
    },
    {
      "text": "Ansgar E. Depping, Regan L. Mandryk, Chengzhao Li, Carl Gutwin, and Rodrigo Vicencio-Moreira. 2016. How Disclosing Skill Assistance Affects Play Experience in a Multiplayer First-Person Shooter Game. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3462--3472.  ",
      "doi": "10.1145/2858036.2858156"
    },
    {
      "text": "Nintendo EAD. 1993. Super Mario Kart. Game {SNES}. (21 January 1993). Nintendo, Kyoto, Japan.",
      "doi": ""
    },
    {
      "text": "Brian J Gajadhar, Yvonne AW De Kort, and Wijnand A Ijsselsteijn. 2008. Shared fun is doubled fun: player enjoyment as a function of social setting. In Fun and games. Springer, Heidelberg, Germany, pp. 106--117.  ",
      "doi": "10.1007/978-3-540-88322-7_11"
    },
    {
      "text": "Maribeth Gandy, Blair MacIntyre, Peter Presti, Steven Dow, Jay Bolter, Brandon Yarbrough, and Nigel O'Rear. 2005. AR Karaoke: Acting in your favorite scenes. In Proceedings of the Fourth IEEE and ACM International Symposium on Mixed and Augmented Reality. IEEE, Piscataway, New Jersey, United States, pp. 114--117.  ",
      "doi": "10.1109/ISMAR.2005.11"
    },
    {
      "text": "Fun With Balls GmbH. 2017. interactiveSquash. http://interactivesquash.com/. (2017). Accessed: 2017-09-04.",
      "doi": ""
    },
    {
      "text": "Wijnand IJsselsteijn, Yvonne De Kort, Karolien Poels, Audrius Jurgelionis, and Francesco Bellotti. 2007. Characterising and measuring user experiences in digital games. In International Conference on Advances in Computer Entertainment Technology, Vol. 2. Springer, Heidelberg, Germany, p. 27.",
      "doi": ""
    },
    {
      "text": "Rob Janssen, Jeroen de Best, and René van de Molengraft. 2009. Real-time ball tracking in a semi-automated foosball table. In Robot Soccer World Cup. Springer, Heidelberg, Germany, pp. 128--139. ",
      "doi": "10.5555/2167873.2167885"
    },
    {
      "text": "Rob Janssen, Mark Verrijt, Jeroen de Best, and René van de Molengraft. 2012. Ball localization and tracking in a highly dynamic table soccer environment. Mechatronics 22, 4 (2012), 503--514.",
      "doi": ""
    },
    {
      "text": "Tony Jebara, Cyrus Eyster, Joshua Weaver, Thad Starner, and Alex Pentland. 1997. Stochasticks: Augmenting the billiards experience with probabilistic vision and wearable computers. In Proceedings of the First International Symposium on Wearable Computers. IEEE, Piscataway, New Jersey, United States, pp. 138--145. ",
      "doi": "10.5555/851036.856456"
    },
    {
      "text": "Charlene Jennett, Anna L Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and defining the experience of immersion in games. International Journal of Human-Computer Studies 66, 9 (2008), pp. 641--661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Choices, values, and frames. In Handbook of the Fundamentals of Financial Decision Making: Part I. World Scientific, Singapore, pp. 269--278.",
      "doi": ""
    },
    {
      "text": "Jens Kesting and Ralf Plaschke. 2009. Kickern& Tischfußball. Humboldt, Hannover, Germany.",
      "doi": ""
    },
    {
      "text": "Studio Liverpool. 2021. Table Soccer for Playstation Vita. Game {PSVITA}. (22 February 2021). SCEA, San Mateo, United States.",
      "doi": ""
    },
    {
      "text": "Markus Löchtefeld, Sven Gehring, Ralf Jung, and Antonio Krüger. 2011. guitAR: Supporting Guitar Learning Through Mobile Projection. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, pp. 1447--1452.  ",
      "doi": "10.1145/1979742.1979789"
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research quarterly for exercise and sport 60, 1 (1989), 48--58.",
      "doi": ""
    },
    {
      "text": "Florian Floyd Mueller, Luke Cole, Shannon O'Brien, and Wouter Walmink. 2006. Airhockey over a distance: a networked physical game to support social interactions. In Proceedings of the 2006 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology. ACM, New York, USA, p. 70.  ",
      "doi": "10.1145/1178823.1178906"
    },
    {
      "text": "Mark Newheiser. 2009. Playing Fair: A Look at Competition in Gaming. Strange Horizons (2009), 1.",
      "doi": ""
    },
    {
      "text": "Toshikazu Ohshima, Kiyohide Satoh, Hiroyuki Yamamoto, and Hideyuki Tamura. 1998. AR2Hockey: A Case Study of Collaborative Augmented Reality. In Proceedings of the Virtual Reality Annual International Symposium. IEEE, Piscataway, New Jersey, USA, pp. 268--275. ",
      "doi": "10.5555/522258.836145"
    },
    {
      "text": "Karin A. Orvis, Daniel B. Horn, and James Belanich. 2008. The roles of task difficulty and prior videogame experience on performance and motivation in instructional videogames. Computers in Human Behavior 24, 5 (2008), pp. 2415 -- 2433.  ",
      "doi": "10.1016/j.chb.2008.02.016"
    },
    {
      "text": "Randy J Pagulayan, Kevin Keeker, Dennis Wixon, Ramon L Romero, and Thomas Fuller. 2002. User-centered design in games. CRC Press, Boca Raton, Florida, USA.",
      "doi": "10.5555/772072.772128"
    },
    {
      "text": "Erika A Patall, Breana J Sylvester, and Cheon-woo Han. 2014. The role of competence in the effects of choice on motivation. Journal of Experimental Social Psychology 50 (2014), pp. 27--44.",
      "doi": ""
    },
    {
      "text": "Marco Roccetti, Gustavo Marfia, and Angelo Semeraro. 2012. Playing into the wild: A gesture-based interface for gaming in public spaces. Journal of Visual Communication and Image Representation 23, 3 (2012), pp. 426--440.  ",
      "doi": "10.1016/j.jvcir.2011.12.006"
    },
    {
      "text": "Katja Rogers, Amrei Röhlig, Matthias Weing, Jan Gugenheimer, Bastian Könings, Melina Klepsch, Florian Schaub, Enrico Rukzio, Tina Seufert, and Michael Weber. 2014. Piano: Faster piano learning with interactive projection. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces. ACM, pp. 149--158.  ",
      "doi": "10.1145/2669485.2669514"
    },
    {
      "text": "Richard M Ryan. 1982. Control and information in the intrapersonal sphere: An extension of cognitive evaluation theory. Journal of Personality and Social Psychology 43, 3 (1982), p. 450.",
      "doi": ""
    },
    {
      "text": "Bruce H Thomas. 2012. A survey of visual, mixed, and augmented reality gaming. Computers in Entertainment (CIE) 10, 1 (2012), p. 3.  ",
      "doi": "10.1145/2381876.2381879"
    },
    {
      "text": "Tim J. W. Tijs, Dirk Brokken, and Wijnand A. IJsselsteijn. 2008. Dynamic Game Balancing by Recognizing Affect. In Proceedings of the Second International Conference on Fun and Games. Springer, Heidelberg, Germany, pp. 88--93.  ",
      "doi": "10.1007/978-3-540-88322-7_9"
    },
    {
      "text": "Table Tennis Trainer. 2017. T-T-T ( Table Tennis Trainer). http://ttt3000.de/. (2017). Accessed: 2017-09-04.",
      "doi": ""
    },
    {
      "text": "Giel van Lankveld, Pieter Spronck, H. Jaap van den Herik, and Matthias Rauterberg. 2010. Incongruity-Based Adaptive Game Balancing. Springer, Heidelberg, Germany, pp. 208--220.  ",
      "doi": "10.1007/978-3-642-12993-3_19"
    },
    {
      "text": "Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2255--2264.  ",
      "doi": "10.1145/2702123.2702242"
    },
    {
      "text": "Rodrigo Vicencio-Moreira, Regan L. Mandryk, Carl Gutwin, and Scott Bateman. 2014. The Effectiveness (or Lack Thereof) of Aim-assist Techniques in First-person Shooter Games. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, pp. 937--946.  ",
      "doi": "10.1145/2556288.2557308"
    },
    {
      "text": "Stewart John Woods. 2009. (Play) ground rules: The social contract and the magic circle. Observatorio (OBS*) 3, 1 (2009).",
      "doi": ""
    }
  ]
}