{
  "doi": "10.1145/3173574.3173599",
  "title": "Introducing Transient Gestures to Improve Pan and Zoom on Touch Surfaces",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2018,
  "badges": [],
  "abstract": "Despite the ubiquity of touch-based input and the availability of increasingly computationally powerful touchscreen devices, there has been comparatively little work on enhancing basic canonical gestures such as swipe-to-pan and pinch-to-zoom. In this paper, we introduce transient pan and zoom, i.e. pan and zoom manipulation gestures that temporarily alter the view and can be rapidly undone. Leveraging typical touchscreen support for additional contact points, we design our transient gestures such that they co-exist with traditional pan and zoom interaction. We show that our transient pan-and-zoom reduces repetition in multi-level navigation and facilitates rapid movement between document states. We conclude with a discussion of user feedback, and directions for future research.",
  "tags": [
    "bimanual input",
    "multi-touch",
    "tablet"
  ],
  "authors": [
    {
      "name": "Jeff Avery",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658642355",
      "orcid": "missing"
    },
    {
      "name": "Sylvain Malacria",
      "institution": "Inria, Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414620309",
      "orcid": "0000-0002-5201-5875"
    },
    {
      "name": "Mathieu Nancel",
      "institution": "Inria, Lille, France",
      "img": "/do/10.1145/contrib-81444606807/rel-imgonly/questions.jpg",
      "acmid": "81444606807",
      "orcid": "missing"
    },
    {
      "name": "Géry Casiez",
      "institution": "Université de Lille, Lille, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    }
  ],
  "references": [
    {
      "text": "Pär-Anders Albinsson and Shumin Zhai. 2003. High Precision Touch Screen Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 105--112.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Caroline Appert, Olivier Chapuis, Emmanuel Pietriga, and María-Jesús Lobo. 2015. Reciprocal Drag-and-Drop. ACM Trans. Comput.-Hum. Interact. 22, 6, Article 29 (Sept. 2015), 36 pages.  ",
      "doi": "10.1145/2785670"
    },
    {
      "text": "Jeff Avery, Mark Choi, Daniel Vogel, and Edward Lank. 2014. Pinch-to-zoom-plus: An Enhanced Pinch-to-zoom That Reduces Clutching and Panning. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 595--604.  ",
      "doi": "10.1145/2642918.2647352"
    },
    {
      "text": "Jeff Avery and Edward Lank. 2016. Surveying Expert-Level Gesture Use and Adoption on Multi-Touch Tablets. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 577--581.  ",
      "doi": "10.1145/2901790.2901895"
    },
    {
      "text": "Olivier Chapuis and Nicolas Roussel. 2010. UIMarks: Quick Graphical Interaction with Specific Targets. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 173--182.  ",
      "doi": "10.1145/1866029.1866057"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2014. Supporting Novice to Expert Transitions in User Interfaces. ACM Comput. Surv. 47, 2, Article 31 (Nov. 2014), 36 pages.  ",
      "doi": "10.1145/2659796"
    },
    {
      "text": "Alix Goguey, Mathieu Nancel, Géry Casiez, and Daniel Vogel. 2016. The Performance and Preference of Different Fingers and Chords for Pointing, Dragging, and Object Transformation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4250--4261.  ",
      "doi": "10.1145/2858036.2858194"
    },
    {
      "text": "Yves Guiard. 1987. Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. Journal of Motor Behavior 19 (1987), 486--517.",
      "doi": ""
    },
    {
      "text": "Eve Hoggan, Miguel Nacenta, Per Ola Kristensson, John Williamson, Antti Oulasvirta, and Anu Lehtiö. 2013. Multi-touch Pinch Gestures: Performance and Ergonomics. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, New York, NY, USA, 219--222.  ",
      "doi": "10.1145/2512349.2512817"
    },
    {
      "text": "Dominik P. Käser, Maneesh Agrawala, and Mark Pauly. 2011. FingerGlass: Efficient Multiscale Interaction on Multitouch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1601--1610.  ",
      "doi": "10.1145/1978942.1979175"
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. 1994. User Learning and Performance with Marking Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 258--264.  ",
      "doi": "10.1145/191666.191759"
    },
    {
      "text": "Edward Lank and Son Phan. 2004. Focus+Context Sketching on a Pocket PC. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 1275--1278.  ",
      "doi": "10.1145/985921.986042"
    },
    {
      "text": "Yang Li, Ken Hinckley, Zhiwei Guan, and James A.Landay. 2005. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Sylvain Malacria, Eric Lecolinet, and Yves Guiard. 2010. Clutch-free Panning and Integrated Pan-zoom Control on Touch-sensitive Surfaces: The Cyclostar Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2615--2624.  ",
      "doi": "10.1145/1753326.1753724"
    },
    {
      "text": "Damien Masson, Alix Goguey, Sylvain Malacria, and Géry Casiez. 2017. WhichFingers: Identifying Fingers on Touch Surfaces and Keyboards Using Vibration Sensors. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 41--48.  ",
      "doi": "10.1145/3126594.3126619"
    },
    {
      "text": "Mathieu Nancel, Daniel Vogel, and Edward Lank. 2015. Clutching Is Not (Necessarily) the Enemy. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4199--4202.  ",
      "doi": "10.1145/2702123.2702134"
    },
    {
      "text": "Matei Negulescu, Jaime Ruiz, and Edward Lank. 2011. ZoomPointing Revisited: Supporting Mixed-resolution Gesturing on Interactive Surfaces. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, New York, NY, USA, 150--153.  ",
      "doi": "10.1145/2076354.2076382"
    },
    {
      "text": "Alex Olwal, Steven Feiner, and Susanna Heyman. 2008.Rubbing and Tapping for Precise and Rapid Selection on Touch-screen Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Morgan N. Price, Bill N. Schilit, and Gene Golovchinsky.1998. XLibris: The Active Reading Machine. In CHI 98 Conference Summary on Human Factors in Computing Systems (CHI '98). ACM, New York, NY, USA, 22--23.  ",
      "doi": "10.1145/286498.286510"
    },
    {
      "text": "Jaime Ruiz, Andrea Bunt, and Edward Lank. 2008. A Model of Non-preferred Hand Mode Switching. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 49--56.http://dl.acm.org/citation.cfm?id=1375714.1375724 ",
      "doi": "10.5555/1375714.1375724"
    },
    {
      "text": "Andrew Sears and Ben Shneiderman. 1991. High Precision Touchscreens: Design Strategies and Comparisons with a Mouse. Int. J. Man-Mach. Stud. 34, 4 (April 1991), 593--613.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "Jessica J. Tran, Shari Trewin, Calvin Swart, Bonnie E. John, and John C. Thomas. 2013. Exploring Pinch and Spread Gestures on Mobile Devices. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 151--160.  ",
      "doi": "10.1145/2493190.2493221"
    },
    {
      "text": "Julie Wagner, Stéphane Huot, and Wendy Mackay. 2012.BiTouch and BiPad: Designing Bimanual Interaction for Hand-held Tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    }
  ]
}